{"posts": [{"author": "אסף טנגיר", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nחשוב לעשות\nהמבחן: לחוץ-אין זמן לנשום\nהשורה התחתונה: \nמעבדות-בזבוז זמן!", "timestamp": 1602795341089}, {"author": "סטודנט רגיל", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יסכה\nחוות דעת - הרצאות: חשובות\n\nשם המתרגל/ת: כל המתרגלים\nחוות דעת - תרגולים: תרגולים סבבה\n\nשעורי הבית: גהנום\n\nהמבחן: ציונים לא משקפים השקעה\n\nהשורה התחתונה: הקורס מעניין אבל החוויה עמוסה ולפעמים לא ברורה במאה אחוז", "timestamp": 1603296145674}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יסכה\nחוות דעת - הרצאות: מתנגדת לפרסם הקלטות כי לטענתה הם פגעו בציונים, אתם יכולים לראות בעצמכם שלא הייתה שום פגיעה בציונים בתקופת הקורונה... בנוסף היא מדברת  בצורה כל כך לא יפה וחסרת סבלנות לסטודנטים.\n\nשם המתרגל/ת: ניסיתי את כולם\nחוות דעת - תרגולים: חשובים מאוד להבנת החומר, גם להם אין הקלטות כי לסגל לא אכפת מהסטודנטים \n\nשעורי הבית: קשים מאוד אבל חשובים ביותר, זה לא קורס שאפשר ללמוד בסוף הסמסטר, חייב להיות על החומר כל הסמסטר ולהשתדל לפתור את התרגילים לבד.\n\nהמבחן: נ-ו-ר-א-י. \n\nהשורה התחתונה: הכל נוראי בקורס הזה חוץ מהחומר עצמו! לא היו הקלטות. אז אם פספסתם הרצאה, את התאוריה תוכלו לקבל מספר שיש בכמות מוגבלת מאוד והוא באנגלית בספריה או מהסיכומים שיסכה מעלה למודל שכוללים לרוב דף אחד שמסכם שלוש שעות (לכו תשברו את הראש על מה היא דברה שם שלוש שעות)\nאין ישור קו בין התרגולים, בכולם פותרים אותם תרגילים אבל לכל מתרגל יש תוצאה שונה. במבחן הסגל החליט שאפשר לשאול שאלה רק דרך פתק (כמה נוח) כנראה מפחדים מהקורונה אבל לעומת זאת בשעות קבלה שעשו לקראת המבחן הודיעו מראש שהן יהיו רק פרונטיליות (פתאום לא מפחדים מקורונה אה?) שוב, כמה נוח... \n\nהשורה הממש תחתונה: קורס שחיכיתי לו, החומר מעניין אבל הסגל ובעיקר המרצה פשוט הרסו הכל.", "timestamp": 1658356405695}, {"author": "..", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יסכה\nחוות דעת - הרצאות: מאוד חשובות . אבל המרצה לא מעבירה אותן בצורה מעניינת.\n\nשם המתרגל/ת: לידור\nחוות דעת - תרגולים: מתרגל מקסים יודע להעביר את החומר בצורה הכי יעילה וגם מושיט יד ועוזר כמה שאפשר.\n\nשעורי הבית: ארוכות מאוד אבל עוזרות בהבנת החומר . כדאי לנסות לפתור אותם בלי רפרנס.\n\nהמבחן: המבחן שלנו היה נוראי קשה מאוד ולא משקף ידע והבנה.\n\nהשורה התחתונה: קורס מעניין וחשוב אבל חבל שהמבחן בכלל לא משקף הבנה.", "timestamp": 1658481320549}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יסכה\nחוות דעת - הרצאות: ההרצאות היה אחלה ויסכה נותנת תחושה טובה בכיתה, חברמנית וכו' (עד המבחן).\nלעיתים כל ההרצאה מפתחים דברים והכול נראה קצת כמו מדע טילים ואז בתרגול הכול נוחת לראש בצורה קלה.\n\nשם המתרגל/ת: לידור\nחוות דעת - תרגולים: תרגולים בסדר. קצת חסר חשק יש לומר. התרגילים בתרגולים לאורך כל הסמסטר הם תרגילי מבחני עבר אז שווה לעקוב.\n\nשעורי הבית: גם כאן, תרגילי מבחן. תרגילים לא פשוטים אבל אם פתרתם אותם אז אתם על דרך המלך.\n\nהמבחן: המבחן צפוף בזמן וצריך לדעת לעבוד יעיל (חבל שהסמסטר הזה באופן כללי מייצג מבחנים ארוכים בזמן קצר, ר' ערך תכן מבנים) . בסמסטר שלנו הכניסו את הנושא של מומנטי אינרציה של מסה למרות שהמתרגלים אמרו שזה נושא שלא נצטרך לדעת. היה מבחן לא מאוד הוגן ומאוד קצר בזמן. תודה סגל!\n\nהשורה התחתונה: קורס שהוא בסדר לאורך הסמסטר, במיוחד לאור המעבר של ביצוע דוחות המעבדה במעבדות עצמן. המבחן לא באמת משקף את הידע, הזריז ביותר מנצח. \nקורס עם פוטנציאל להיות מאוד מעניין ומושך אבל הסגל הפך אותו לדי מעיק. קחו לתשומת לבכם :)", "timestamp": 1658935466528}]}