{"posts": [{"author": "אבן חן", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אורי להב\nחוות דעת - הרצאות: ההרצאות מעניינות מאוד. אורי דואג להביא כל הזמן דוגמאות רלוונטיות. לשים לב שלמרות שההרצאות חשובות ומעניינות, למבחן לומדים מהתרגולים.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: אחד המתרגלים הכי טובים שהיו לי. מסביר מדהים. אך לשים לב שהוא לא יתרגל יותר את הקורס הזה.\n\nשעורי הבית: קיימים וחשובים למרות שהם לא להגשה כי יש עליהם בוחן קצר וקליל בכניסה לכל מעבדה. יש שש מעבדות בקורס והדו\"חות יכולים להיות קצת חופרים.\n\nהמבחן: הוגן מאוד. מי שלמד כמו שצריך במהלך הסמסטר לא יתקשה להוציא 80+ ואפילו 90+.\n\nהשורה התחתונה: \nקורס מעניין מאוד ומומלץ אם כי קצת עמוס בגלל המעבדות", "timestamp": 1642091059329}, {"author": "ניצן", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורי להב\nחוות דעת - הרצאות: \nמרצה טוב מאוד. לפעמים קשה לעכוב אחריו בעיקר שההרצאות היו ב8:30 בבוקר.\nשם המתרגל/ת:\nחן דגן\nחוות דעת - תרגולים: \nמתרגלת מדהימה. מסבירה מעולה התרגולים והשעות קבלה איתה ממש עוזרים להבין את החומר. היא משקיעה המון בקורס ושמים לב לזה. \nשעורי הבית: \nיש באזור ה-7 מעבדות ובכניסה לכל מעבדה יש בוחן על השיעורי בית הרלוונטים. הדוחות מאוד כבדים ודרשו המון זמן.\n\nהמבחן: \nהמבחן עם חומר פתוח והוא די הוגן. חשוב ללמוד אליו כמו שצריך .\nהשורה התחתונה: \nלהגיע לתרגולים ולהשקיע במעבדות. הקורס והדוחות דורשים המון זמן. תקחו את ספר הקורס בתחילת הסמסטר כי הוא אחד לאחד מה שמלמדים בקורס ואורי כתב אותו", "timestamp": 1659024236058}, {"author": "מדיטציה- הפיתרון לסבל", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "הקורס עמוס במעבדות בצורה קיצונית\nבנוסף אורי להב לא מרצה באופן ברור", "timestamp": 1680158563351}, {"author": "אורג׳ואן סלפיתי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאורי מרצה מדהים, מאוד ברור ומובן וחשוב לו שנבין את התיאוריה ושנצא לשטח עם הידע הדרוש להבין איך התהליכים מתרחשים. הוא גם מספר על כל מיני חוויות תעשייתיות ופרויקטים שהוא עשה שלדעתי זה ממש מוסיף מעבר לחומר התיאורטי בתחום של מים וסביבה. יש לאורי גם הקלטות מעולות, מאוד נעזרתי בהם במהלך הסמסטר. הוא מרצה גמיש, היה זמין כל הזמן במייל ומוכן לשבת איתכם  במידת הצורך מתי שתרצו.. אז תנצלו אותו.\nשם המתרגל/ת: המוקלט של יוני+ חן\nחוות דעת - תרגולים: \nיוני (שלצערי לא מלמד יותר את הקורס) הוא מסביר מעולה את הכל ונותן כל מיני טיפים בין השורות.\nחן היא גם מתרגלת מקסימה, אנרגטית וחשוב לה שתבינו את הכל, היא מסבירה בצורה ממש פשטנית ע״מ שתעזור לכם להבין.\n\nשעורי הבית: \nכל שבוע נפתח גיליון של כמה שאלות לא קשה במיוחד, מי שעקב בהרצאות ובתרגולים יסתדר. ודווקא כל גיליון עוזר להבין את החומר יותר טוב.\nמעבדות:\nדוחות: שזה החלק המעצבן בקורס, למרות שצוות המעבדה והמדריכים; יובל וארינה הם אחלה של אנשים. המעבדות עצמן לא קשות במיוחד אם מבינים מה קורה ומתכוננים היטב לפני, יש בוחן כניסה שנפתח לפני כל מעבדה במודל והשאלות שם ממש נותנות רקע למה מתרחש בפועל במעבדה. הדוחות לוקחות המוווון זמן שזה מעצבן ומורידים מלא נקודות על דברים בהגזמה. לא לרפרנס כי הדוחות הכי טובים הם אלו של המתרגל חן והיא כמובן תדע שעתקתם ממנה. קיצר קחו לכם שותפים רציניים אשר מבינים מה קורה שם, ותבינו את הרקע של כל מעבדה לדעתי יהיה סבבה.\n\nהמבחן: \nמבחנים של אורי הם הגיוניים ממש, למי שעקב אחרי החומר והבין את הכל, צריך לתרגל ולפתור כמה מבחנים שאפשר על מנת להיחשף לעוד רעיונות. אפשר להוציא 95+ אם מתכוננים נכון.\n\nהשורה התחתונה: קורס דורש השקעה, החומר די מעניין ומרתק, אישית ממש התחברתי. צוות הקורס הם אחלה של צוות וממש חשוב להם שכולם יצליחו. קחו את הספר של הקורס הוא אחד לאחד למה שאורי מסבר ומעביר בהרצאות.", "timestamp": 1703185036086}, {"author": "סביבונית", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורי להב\nחוות דעת - הרצאות: מרצה מעולה ומתחשב, חשוב לו שנצליח ונבין עד הסוף את הדברים.\n\nשם המתרגל/ת: חן דגן\nחוות דעת - תרגולים: תותחית נעימה מאוד ומעבירה את החומר בצורה הכי טובה וברורה שיש, ממליצה ללכת לשעות קבלה שלה לחיזוקים נוספים בחומר, ממש עוזר. \n\nשעורי הבית: חלק קשים, לא לוקחים יותר מדי זמן, חשוב חשוב לעשות אותם\nסה\"כ 10% מהציון הסופי, בדיקת ש\"ב היא מדגמית\n\nמעבדות: שאיבת זמן רצינית, מעבדות חלקן קשות וחלקן בסדר גמור. לקחת בחשבון שכתיבת הדוח זה אירוע וצריך לתכנן מספיק זמן מראש כדי לסיים את הדוח בזמן. תוכן המעבדה חשוב להבנת התהליכים שהועברו בהרצאות ובתרגולים.\nלא כל שבוע יש מעבדה, לפעמים יש שבוע-שבועיים הפסקה שבזמן הזה יושבים על הדוחות\nמדריכות המעבדה חן דגן ונירית דנה מעולות. לפעמים הפרוטוקולים לא הכי ברורים  אבל הן שם בשביל לעזור\nלא מכסחים בבדיקה של המעבדות, אפשר להוציא 90+ כל עוד ישבתם על זה כמו שצריך והקשבתם\nסה\"כ 25% מהציון הסופי\n\nהמבחן: הוגן, יש המון מבחנים לתרגל מהם והמון חומר באופן כללי ללמוד ממנו, ממליצה על הספר של אורי להב- כימיה של המים, הוא כתוב בעברית ומכסה את כל החומר הנדרש שהועבר בהרצאות ובתרגולים. \n\nהשורה התחתונה: קורס חשוב ומעניין. הסגל עצמו מאוד מתחשב ודאג לבטל/לדחות משימות במקרה הצורך. יש המון חומר ללמוד+הקלטות של ההרצאות והתרגולים\nממליצה בחום לשבת על הדוחות כמה שיותר מהר, אפילו באותו יום של המעבדה. ובכללי להיות על זה לאורך הסמסטר", "timestamp": 1703664431531}]}