{"posts": [{"author": "שוקרי אמסיס", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעודד מרצה מעולה , מומלץ לראות את ההרצאות על מנת להבין מאיפה הדברים שעושים בתרגולים באים.\nחוות דעת - תרגולים:  מומלץ מאוד להבין כל מה שמועבר בתרגול , זה יעזור המון גם בשיעורי בית וגם בבחינה הסופית.\n\nשעורי הבית: לפעמים ארוכים , אך עוזרים רבות בהבנת החומר עוד יותר והם אחלה תרגול לבחינה הסופית \nהמבחן:  מבחן הוגן , ניתן להוציא ציון גבוה למי שמשקיע במהלך הסמסטר ונשאר עקבי עם החומר.", "timestamp": 1638641374169}, {"author": "David Goncharenko", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ניקולו פוליני\nחוות דעת - הרצאות: אחרי הרצאה אחת רוב הסטודנטים הפסיקו להגיע. המרצה לא יודע עברית טוב ולא מובן.\nההרצאות היו בעצם כיתה הפוכה מה שהפך את ההרצאות למיותרות מאוד.\nלפני כל הרצאה, היה שיעור הכנה קצר שהספיק בשביל להבין כמעט לגמרי את העקרונות החשובים. היו הרצאות מוקלטות של מרצה משנים קודמות שהציל לגמרי את הסטודנטים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים היו סדנאות שבהן אפשר היה לשאול דברים לא ברורים בשיעורי הבית. המתרגלים היו טובים עם כוונה לעזור.\n\nשעורי הבית: כל שבוע יש, לוקחים זמן אבל חשובים.\n\nהמבחן: המבחן היה בסך הכל הוגן. \n\nהשורה התחתונה: קורס חשוב, שהועבר ברמה די נמוכה וחבל. לא קשה מאוד.", "timestamp": 1716733778514}, {"author": "יי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nניקולו מרצה בן זונה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהשורה התחתונה:", "timestamp": 1716856607375}, {"author": "סטודנט  מאוכזב", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ניקולו\nחוות דעת : \nעד שמישהו בפקולטה לא יתעורר ממליץ בחום לדחות את הקורס הזה כל עוד אתם יכולים. מרצה חדש שלא מצליח ללמד את החומר כמו שצריך ובכללי מתקשה בשפה העברית. תרגולים שעובדים בשיטה של תראו בבית ואם יש שאלות תשאלו (לא ברור למה). \nואת המבחנים שהוא רושם ואיך שהוא בודק מוזמנים לראות בהיסטוגרמיה. \nהתנהלות מביכה של הפקולטה במקצוע !", "timestamp": 1718114303998}, {"author": "11", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה:ניקולו \nחוות דעת - הרצאות: \nבקיצור מרצה על הפנים, מתקשה בעברית ו למרות זאת הוא בודק שאלות במבחן אני לא מבין איך זה הגיוני.הממוצע של הקורס בדרך כלל טוב לא אמור להיות קורס מכשיל.אבל עם המרצה הזה אפילו אם אתה מבין את החומר אתה יכול לכשל בקלה קלות כי אופן הבדיקה של המבחנים מגעיל בצורה בלתי נתפסת.האמת שאין עוד מה לסבר ההסטוגרמה אומרת הכול.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718142148497}, {"author": "ו", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניקולו \nחוות דעת - הרצאות: מאיפה מתחילים ? בהרצאות שלו האודיטוריום של טאוב כמעט וריק ויש סיבה, הוא ממלמל לעצמו ,רושם בקטן ולא מעביר טוב את החומר \nאה ושולח להקלטות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: זה סנדנאות, כלומר אתם תפתרו ואנחנו נעבור בינכם \nמנסים להשתלט על מלא סטודנטים, יש כאילו שמקבלים יותר יחס ויש כאלו שפחות \n\nשעורי הבית: הוגנים \n\nהמבחן: המבחן של ניקולו לא טוב, ארוך מאוד ועם הרבה טריקים \nאו שתקצר או שתעשה מבחן רגיל \nהקורס עומד בדרכ על ממוצע טוב אבל איך שהוא בא הממוצע נכשל\n\nהשורה התחתונה: אם הקורס עם עודד אז הרווחתם , אם זה עם ניקולו - בהצלחה", "timestamp": 1718773408664}]}