{"posts": [{"author": "Shir Shefi", "difficultyRank": 4, "generalRank": 1, "semester": "201901", "text": "שם המרצה: דן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשים ולא ברורים\nהמבחן: \nקשה ועמוס\nהשורה התחתונה: קורס עמוס, הרבה פיזיקה ופירוק משוואות מצב", "timestamp": 1598804018296}, {"author": "יוסי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nסך הכל מרצה בסדר גמור, אבל לפעמים קופצים מנושאים לנושאים ולא תמיד השורה התחתונה עוברת טוב. המון שיעורים מבוזבזים על הדגמות במטלב שלא באמת חשובות לקורס... בנוסף, אין ממש דוגמאות לחיים זה פשוט מעבר ממשוואה אחת לאחרת..\nיש הרצאות מוקלטות מעולות של אורי שביט, מומלץ לראות אותן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים מאוד סבירים, תחושה קצת של חוסר רצון מהמתרגלים. הבעיה העיקרית בתרגילים שהם מאוד עמוסים, צריך לעשות פחות תרגילים ולהסביר אותם כמו שצריך במקום לרוץ.\nהרצאות מוקלטות של אסף מעולות! מומלץ לראות רק אותן.. גם ככה כמעט כל הקורס מועתק משנה לשנה אז זה לא משנה...\n\nשעורי הבית: \nיכולים להיות תרגילים ממש קשים, ובכלל תרגילי הבית הרבה יותר קשים מהתרגול שזה מעצבן. אבל לרוב יש רפרנס לתרגילים או שהם פשוט לוקחים מספרי הקורס... מה שכן, תרגילי הבית יותר קשים מהתרגילים במבחן.\nהמבחן: \n\nהשורה התחתונה: \n\nהיה מבחן קל יותר משנים קודמות ככה שזה היה מאוד הוגן וגם נחמה מסויימת לסיום קורס. הקורס עצמו מעניין ו אבל גם מאוד עמוס וקשה (וגם המבחן יכול להיות קשה מאוד)", "timestamp": 1612688388113}, {"author": "נכון זה אני", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "קורס מאוד קשה ועמוס אבל מעניין \n\nשעורי הבית: פעם בשבוע היו מפרסמים תרגיל בית\nקשים וארוכים(יש רפרנס טוב לא לדאוג) מי שמבין אותם טוב הוא יכול לפתור כל שאלה במכניקת הזורמים לדעתי\n\nהמבחן: מבחן מועד א היה אמריקאי וקל יחסית ממבחנים משנים קודמות\n\nממליצה מאוד על ההרצאת והתרגולים המוקלטים בפונופטו,בזכותם עברתי את הקורס בציון גבוה יחסית", "timestamp": 1612814256881}, {"author": "ניצן", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: מרצה טוב , לפעמים קופץ מנושא לנושא יותר מידי מהר\n\nשם המתרגל/ת: ארז בר רק\nחוות דעת - תרגולים: התרגולים טובים אבל חלקם עמוסיםם\n\nשעורי הבית: \nשיעורי בית כל שבוע והם תקפים. מכינים טוב למבחן\nהמבחן: הוגן, לא פשוט\n\nהשורה התחתונה:", "timestamp": 1643927979537}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תרגולים מוקלטים של אסף מצויינים\n\nשעורי הבית: יש כל  שבוע, יחסית עמוסים.\n\nהמבחן: היה מבחן הוגן בסה\"כ, חשוב להיות על החומר במשך הסמסטר\n\nהשורה התחתונה:", "timestamp": 1644423141891}, {"author": "s", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאורי מרצה מעולה. פרונטלית לפעמים מעט מבולגן, אבל ההקלטות שלו בפנופטו מסודרות ומובנות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאסף דנה המתרגל מההקלטות הוא המתרגל הטוב ביותר.\nשעורי הבית: \nלא קלים, מומלץ לפתור מיד אחרי התרגולים.\nהמבחן: \nלרוב הוגן, מתבסס מאוד על דוגמאות שאורי מראה בכיתה או בתרגול. לעבור טוב על ההרצאות, התרגולים והגיליונות.\nהשורה התחתונה: \nקורס שמצריך השקעה רבה.", "timestamp": 1649318036302}, {"author": "Aviya Zinner", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי שביט \nחוות דעת - הרצאות: נהניתי מאוד ממהרצאות. אורי מומחה בלהראות את היופי שבמשוואות הזרימה. מסביר כל התיאוריה בתהליך בצורה ברורה, קוהרנטית ונעימה.\n\nשם המתרגל/ת: ארז ראק\nחוות דעת - תרגולים: סובלני ונעים. \n\nשעורי הבית: הגשה שבועית. תרגילים קשים שמכינים טוב למבחן\n\nהמבחן: המבחן דורש חשיבה מעבר ושליטה מעולה בחומר. צריך להתכונן טוב ולהבין את התיאוריה טוב, ולא רק לפתור תרגילים בצורה טכנית. \n\nהשורה התחתונה:", "timestamp": 1656928366712}, {"author": "לא משנה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: מרצה מדהים, החומר מועבר בצורה מעניינת\n\nשם המתרגל/ת: מוקלט של אסף דנה \nחוות דעת - תרגולים: אם רואים הרצאות אז התרגולים יהיו מאוד יעילים ותורמים משמעותית בהבנת החומר, לדעתי בקורס זה כמעט אי אפשר להבין כלום מבלי לצפות בהרצאות\nהמבחן: מצריך הבנה עמוקה אך מי שפתר תרגילי בית ומבין את החומר יהיו לו קל יחסית(מועד א כמובן)\n\nהשורה התחתונה: אישית למרות העומס של תב במהלך הסמסטר(12 תב) נהניתי מאוד ללמוד את הקורס הזה עם מרצה אכפתי ונשמה כמו אורי, תנצלו את שעות הקבלה.", "timestamp": 1675437463409}, {"author": "רוני", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: אורי מרצה מדהים, מאוד ברור ומובן וחשוב לו שנבין את התיאוריה והפיתוח של כל דבר. חובה ללכת להרצאות. יש גם הקלטות מאוד טובות שלו מ2017, מאוד נעזרתי בהם במהלך הסמסטר\n\nשם המתרגל/ת: ארז ראק\nחוות דעת - תרגולים:  מתרגל טוב, קצת רץ לפעמים. יש תרגולים מאוד עמוסים וש כאלה שהם בסדר, אני נעזרתי בתרגולים המוקלטים של אסף שהיה מתרגל בעברו בטכניון\n\nשעורי הבית: מאוד מכינים למבחן, חשוב באמת לא לרפרנס אותם ולהיות בקצב במהלך הסמסטר. זה באמת הבסיס להצלחה במבחן\n\nהמבחן: הוגן, אפשר לקבל ציון טוב אם מתמידים ועושים ש\"ב\n\nהשורה התחתונה: ללכת להכל, לעשות ש\"ב ולצפות בהקלטות לעזר נוסף", "timestamp": 1675585581913}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: \nיש לאורי הקלטות מעולות מ2017 שעדיף לראות. אורי של היום כועס ומחנך יותר מידי בהרצאות. הוא משכנע אותנו יותר שההסבר שלו מובן מאשר שהוא באמת היה מובן. עשה שכונה ולימד אותנו יחד עם מכניקת זורמים והשתגע מהרעש. \nשם המתרגל/ת: הקלטות של אסף\nחוות דעת - תרגולים: \nמעולים ממש, ממליץ בחום.\nשעורי הבית: \nארוכים ומתאגרים. חייבים לפתור אותם ולהבין כדי להצליח.\nהמבחן: \nמאתגר ודורש ידע תיאורטי וטכני רב.\nהשורה התחתונה: \nקורס עמוס ומאתגר שדורש למידה רציפה.", "timestamp": 1675875596473}, {"author": "נעמה קנר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: מעניינות, החומר מוסבר טוב\n\nשם המתרגל/ת: מאיה\nחוות דעת - תרגולים: מסבירה מצויין ומשקיעה מלא, מומלץ להגיע גם לשעת קבלה\n\nשעורי הבית: ארוכים, דורשים הבנה והשקעה\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678536717249}]}