{"posts": [{"author": "Shir Shefi", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: ברק\nחוות דעת - הרצאות: \nממש טוב, מחזיק אותך מרוכז כל השיעור. חשוב להיות בהרצאות\nשם המתרגל/ת:  שני\nחוות דעת - תרגולים: \nמדהימה! מלמדת ממש טוב, מסבירה את כל החומר  מתרגילים פשוטים עד ממש מורכבים\nשעורי הבית: \nבוחן כל שבוע. חשוב להתכונן כדי לבוא מוכנים לתרגול\nהמבחן: \nקשה ועמוס, צריך להתכונן טוב אבל מי שלומד מצליח\nהשורה התחתונה:", "timestamp": 1598803956837}, {"author": "Ran Eckl", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ברק\nחוות דעת - הרצאות: ההרצאות הועברו בסך הכל בצורה טובה, ספציפית בסמסטר הזה ההרצאות הוקלטו מראש שלמען האמת זה היה לא ממש נוח (אי אפשר לשאול שאלות).\n\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: מתרגלת מדהימה! בפער הכי טובה שהייתה לנו בסמסטר. מומלצת מאוד.\n\nשעורי הבית: יש שיעורי בית לא להגשה, אבל עושים בוחן בכיתה על כל שיעורי בית שבועיים אחרי הפרסום שלהם. ממוצע ה-6 הכי טובים קובע 30% מהציון (שווה ללמוד, אפשר בכיף להוציא 100).\n\nהמבחן: המבחן היה קצת קשוח אבל די הוגן. פוטנציאל לציונים גבוהים.\n\nהשורה התחתונה: קורס סבבה ממש. חשוב ממש להגיע לתרגולים (אפילו יותר מההרצאות), אפשר להוציא ציונים גבוהים.", "timestamp": 1615546234609}, {"author": "א'", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nפרופ' ברק פישביין\nחוות דעת - הרצאות: \nסמסטר קורונה - הרצאות מוקלטות - מאוד נוח.\nשם המתרגל/ת: \nשני בן משה\nחוות דעת - תרגולים: \nשני מעולה!!\nשעורי הבית: \nעבודות בית לא להגשה, רק לתרגול.\nיש בוחן קצר בכל תרגול והוא קובע חלק מהציון. \nהמבחן: \nסמסטר קורונה - מבחן אמריקאי 40 שאלות \nהשורה התחתונה: \nקורס מעניין מאוד. ממליץ לפתור את כל העבודות במהלך הסמסטר, למרות שלא להגשה.", "timestamp": 1617703181666}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ברק פישביין\nחוות דעת - הרצאות: טובים וממוקדים. מסביר את החומר כמו שצריך\n\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: אחלה מתרגלת, מסבירה טוב ומספיקה הרבה.\n\nשעורי הבית: לא חובת הגשה. יש גליון כל שבוע ונלקחת משם שאלה כל שבוע לבוחן (שהוא תקף ל30% מהציון הסופי).\n\nהמבחן: הוגן מאוד. בהחלט לרמה של הקורס\n\nהשורה התחתונה: קורס טוב. תזהרו מאוד מסגל הקורס, לא אכפת להם כלל מהסטודנטים והם משנים כללי המשחק איך שבא להם (בחנים שהיו מוגדרות מגן הפכו לתקף בדיעבד לקראת סוף הסמסטר, המרצה שינה את הסילבוס כך שלא היה אפשר להתנגד). יש חוסר גמישות מוחלט וגם התעלמות מהנחיות הטכניון.", "timestamp": 1626936707323}, {"author": "A", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמאוד קלים, יש מבדק לכל שיעור בית והמבדקים מהווים 30%, 8/10 נכללים. \nהמבחן: \nקשה מאוד ביחס לרמת תרגילי בית והתרגולים\nהשורה התחתונה: \nצריך להבין לעומק", "timestamp": 1644792867802}, {"author": "אא", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמעניין\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nבוחן כל שבוע על הש\"ב קצת מציק ולא בהכרח מעיד על הצלחה.\nהמבחן: \nהיו כמה שאלות לא ברורות בכלל אבל היו פארים בבדיקה\nהשורה התחתונה:", "timestamp": 1647180687869}, {"author": "התפלגות נורמלית", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פרק\nחוות דעת - הרצאות: \nמרצה טוב וחזק\n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: תותחית\n\nשעורי הבית: 10 -- 7 תקף --- 3 מגן \nלא לפספס\n\nהמבחן: מועד א / הוגן \n\nהשורה התחתונה:  רמת המבחנים רחוקה מזו של ש\"ב ולכן להיות מוכנים\nקורס יפה ואפשר להוציא אחלה ציובים", "timestamp": 1659013940798}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ברק פישביין\nחוות דעת - הרצאות: ברק מרצה מעולה, שולט בחומר, ועושה הכל בשביל להפוך את הקורס למעניין למרות שהנושאים משעממים.\n\nשם המתרגל/ת: נועם ג'ינאו\nחוות דעת - תרגולים: לצערי נועם המתרגל היחיד לקורס שהיה אצלינו. הוא בינוני, לא לכאן ולא לכאן. אם היו עוד מתרגלים כנראה שלא הייתי הולך אליו\n\nשעורי הבית: קלים\n\nהמבחן: הוגן\n\nהשורה התחתונה: אין בקורס ש.ב להגשה, אלא יש חובת נוכחות בתרגולים שבתחילת כל תרגול עושים בוחן של 15 דקות שיש בו שאלה מהש.ב ועליה מקבלים ציון.", "timestamp": 1677167726457}, {"author": "ש", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "השורה התחתונה: לבהמה שרשם מקודם שהבחן היה קליל והמבחן הסופי היה הוגן אז או שאתה דבע או שאתה דבע, שליש מהסטודנטים נכשלו בגלל חזי שרוצה לעשות רושם מול הפקולטה בגלל שהוא מרצה חדש והעלה את הרמה של הבחן והמבחן פי אלף.\nשורה תחתונה אל תיקחו עם חזי.", "timestamp": 1680203405918}, {"author": "ליה", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ברק פישביין\nחוות דעת - הרצאות: סה\"כ אחלה מרצה. אני לא הלכתי להרצאות והסתדרתי ברוב התרגולים בלי לעבור על ההרצאות לפני. יש הקלטות שלו\n\nשם המתרגל/ת: עדי בן צבי\nחוות דעת - תרגולים: מעולה, נעימה, מעבירה את החומר כמו שצריך. חשוב להיות בתרגול שאליו נרשמתם בגלל הבחנים שעושים במהלך התרגול\n\nשעורי הבית: ברמה קלה-סבירה. אין הגשה של התרגילי בית אלא בוחן עליהם בתחילת כל תרגול. יש אחלה מגן, בין 20%-30% מהציון הסופי\n\nהמבחן: רמה יותר גבוהה מהשיעורי בית. לתרגל כמה שיותר מבחנים ולעשות סימולציות. אפשר להביא דפי נוסחאות למבחן.\n\nהשורה התחתונה: קורס בסדר סהכ", "timestamp": 1703664845563}]}