{"posts": [{"author": "ANON", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: מרק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: שי הכי מקסים שיש\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1647284257689}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: מאוד מעניינות. הוא זורק הרבה הערות תוך כדי ההרצאה שחשובות למבחן, ומי שלא רואה אותן נדפק אחר כך.\n\nשם המתרגל/ת: אתנה\nחוות דעת - תרגולים: שעה תרגול. לא מספיק לכלום. אתנה מתרגלת טובה אבל היא רצה על 200 קמ\"ש וקשה לקלוט כל מילה שהיא אומרת.\n\nשעורי הבית: \n\nהמבחן: מבחן קשה. מועד א היה הוגן, מועד ב הרבה פחות.\n\nהשורה התחתונה: קורס די עמוס מבחינת הגשות ומעבדות. אפשר להוציא ציון טוב במבחן אם משקיעים ומבינים את החומר.", "timestamp": 1654340600934}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: מעניינות לפי דעתי. והמרצה מסביר בצורה מעניינת עם דוגמאות מהשטח ומניסיונו האישי.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: חשובים... אם הייתי חוזרת בזמן הייתי הולכת לפרונטלי.\n\nשעורי הבית: כל שבוע, קלילים יחסית ולא משקפים את רמת המבחן אבל חשוב לפתור אותם כי הם הבסיס.\n\nהמבחן: קליל יחסית. אם נשארים במעקב במהלך הסמסטר אפשר להשיג ציון טוב מאוד. \n\nהשורה התחתונה: קורס נחמד ומעניין, להבין את העקרונות שלו ולדעת להשתמש בטכניקות ואתם על הגל.", "timestamp": 1677843682809}, {"author": "Malak Azzam", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: \nאני צפיתי בהקלטות הן ממש מעולות והכל מיבן מסביר בצורה ברורה וקצר ולעניין\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא זוכרת את שם המתרגל אבל גם במוקלט קצר ולעניין הכל מובן כמעט \nשעורי הבית: \nממש סבבה לא עמוסים בדרך כלל שאלה או שתיים מומלץ לפתור במהלך הסמסטר ולא סתם להגיש כך נשארים חדים על החומר \nהמבחן: \nהמבחנים לא מסובכים וניתן לקבל ציון טוב אם עוברים על מספיק שאלות ,הבעיה היא שהם לא מעלים למודל מבחנים וזה בעסה\nהשורה התחתונה:", "timestamp": 1679232099695}, {"author": "I AM GROOT", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרק\nחוות דעת - הרצאות: מעניינות\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: מצויין\n\nשעורי הבית: קלים\n\nהמבחן: סבבה\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1679304526893}, {"author": "student", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: לדעתי הוא מעביר את ההרצאות באופן הכי מעניין! וגם החומר כל כך מעניין.. חשוב מאוד  לצפות בהרצאות כך שיש מלאאא חומר בקורס שדורש הבנה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: משך תרגול הוא שעה (ההרצאה 3 שעות) אז לא באמת מספיק לכלום.. יש תרגולים מוקלטים בפנופטו מתרגל מעולה ומסביר הרבה\n\nשעורי הבית: לא קשים.. מאוד קצרים \n\nהמבחן: היה 4 שאלות במשך זמן של שעתיים ורבע. קצת עמוס כך שיש שרטוטים וחישובים וכו'.. אבל מי שהיה עוקב בקרוס ניתן לקבל ציון ממש טוב!\n\nהשורה התחתונה: קורס הכי מעניין ושווה להשקיע בו.", "timestamp": 1681820591875}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: \nהרצאות טובות שכדאי להיות בהן אקטיבי ולרשום. קשה מאוד ללמוד ממצגות ריקות של המרצה בלי הערות. יש נושאים שמופיעים רק בהרצאות.\nשם המתרגל/ת: אהוד\nחוות דעת - תרגולים: \nתרגולים מעולים, מאוד ברורים ולא קשים בכלל.\nשעורי הבית: \nקלים ומרופרנסים. כדאי לא לרפרנס אותם ולהיות יותר מוכנים לקראת המבחן.\nהמבחן: \nרובו ככולו מאוד טכני וחוזר על עצמו. יש בערך 4.5 נושאים ו4 שאלות לכן אין מה להפתיע במיוחד. לשים לב שיש שאלות על בסיס מעבדות בלבד(מעבדה 1 בעיקר) ושאלות מההרצאות לכן אם מתרגלים מבחני עבר אפשר להיחשף לכל סוגי השאלות ולהוציא ציון טוב.\n\nהשורה התחתונה: \nקורס נחמד סה\"כ. פרופורציונלי לגודל שלו.", "timestamp": 1715365817459}]}