{"posts": [{"author": "סטודנטית", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: טולדו תומר\nחוות דעת - הרצאות:  ההרצאות הועברו באופן מקצועי בזום אך הן הוקלטו מראש כך שלא היה ניתן לשאול תוך כדי ההרצאה אם משהו לא ברור אלא רק בשעות קבלה.\n\nשם המתרגל/ת: הלל רוני\nחוות דעת - תרגולים: \nלא היו לנו תרגולים מובנים בשבילינו רק נתנו לנו לראות את התרגולים בפנופטו. רוני מתרגלת מעולה. חלק מהתרגולים לא היו בחומר וחלק מחומר ההרצאה לא היה בתרגולים.\nשעורי הבית: שיעורי בית במטלאב, כתיבת הקוד לעיתים לוקחת הרבה זמן חוץ מהקוד את שאר השאלות די זריז לפתור.\n\nהמבחן: המבחן הרמה מאד גבוהה מהנלמד. תומר עושה את המבחנים ברמה הכי גבוהה שניתן ומצליח מחדש להפתיע בשאלות.\nבמבחן שאלה קטנה על קוד. שאלות ע השיטות השונות ושאלות מרצה פתוחות.\nהשורה התחתונה: קורס לא פשוט עם מלא נושאים שצריך לדעת וצריך להתכונן אליו ממש טוב לפני מבחן ולהיות עקבי עם ההרצאות והתרגולים. לראות את שניהם כי הם משלימים אחד את השני. ש.ב בזוגות.", "timestamp": 1600975103167}, {"author": "אלישבע הורביץ", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמשעממות בעיני, אבל כדאי ללכת כי בסוף 20 נקודות המבחן זה נטו הרצאות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמהפנופטו!!\n\nשעורי הבית: \nיש כאלה שורפים זמן, ויש כאלה יחסית קלילים. עם פרטנר טוב והבנה בסיסית של מטלב- יהיה בסדר\n\nהמבחן: \nהוגן לחלוטין. שאלות מרצה תמיד מתעתע, צריך לחזור על ההרצאות וממש להבין את כל התכונות של כל השיטות וקצת תיאוריה.\n\nהשורה התחתונה: \nקורס שאם קצת משקיעים בוק לגמרי אפשר להצליח. המון טכני. קצת תיאוריה ומטלב.", "timestamp": 1626170254472}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: טוב ולעניין. החומר הוא טכני ואין מה לעשות אבל הוא טוב בלהבהיר את הרקע התיאורטי ולתת הבנה.\n\nשם המתרגל/ת: פנופטו\nחוות דעת - תרגולים: פצצה! מסבירה מועלה ובקצב טוב.\n\nשעורי הבית: הוגן מואד, עוזר מעוד בהבנה. ההגשה בזוגות, פרטנר טוב זה קריטי.\n\nהמבחן: הוגן מאוד, תואם למה שנלמד. חשוב להתכונן.\n\nהשורה התחתונה: קורס מומלץ וחשוב.", "timestamp": 1626936912499}, {"author": "Ran Eckl", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: מרצה מעולה. מסביר טוב, נחמד ועונה לשאלות.\n\nשם המתרגל/ת: מומלץ לראות במוקלט.\n\nשעורי הבית: כל שבוע, די מעמיס. נדרשים לכתוב די הרבה קודים.\n\nהמבחן: המבחן עם הרבה תיאוריה. מאוד מומלץ לעקוב אחר מה שאמיר אומר לאורך הסמסטר ולרשום הערות כי הפאנצ'ים נכנסים למבחן בעיקר לשאלה 1 במבחן שכוללת סעיפים מהתיאוריה.", "timestamp": 1635236390951}, {"author": "שוקרי אמסיס", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: \nהרצאות שמראות את התיאוריה של התרגולים בעיקר , והן מאוד חשובות לקראת הבחינה הסופית כי יש שאלה של 20 נקודות בבחינה הסופית כחומר תיאורטי שמועבר אך ורק בהרצאות.\nחוות דעת - תרגולים: \nתרגולים ישנים מהפנופטו מעולים מכסים הכל\n\nשעורי הבית:  שיעורי בית ארוכים , נדרשת רמה גבוהה במטלב על מנת לדעת לפתור אותן , וכדאי מאוד להבין כל שלב בהן כי במבחן הסופי בדרך כלל יש שאלת מטלב.\n\nהמבחן: כדאי לתרגל כמה שיותר מבחנים , יש כל כך הרבה שיטות פתרון בקורס שאם לא מתרגלים אותם מספיק , יתבזבז זמן במבחן והמבחן ממילא לחוץ בזמן , מי שמתרגל הרבה יכול להוציא ציון גבוה!", "timestamp": 1638641918632}, {"author": "student", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: מרצה טוב - עדיף מאוד להישאר במעקב בהרצאות כך שיש בבחינה 20 נק' שאלות של מרצה מהחומר שנלמד בהרצאה! גם כך זה עוזר להבין את השיטות \n\nשם המתרגל/ת: קבלאוי מחמוד\nחוות דעת - תרגולים: מתרגל מדהים!! דואג שנבין כל מילה ושלב בפתרון. מומלץ מאוד. (יש מוקלטים אך לפי דעתי פרונטלית יותר טוב כך שהתרגולים מעודכנים לפי רצון המרצה)\n\nשעורי הבית: ארוכים מאודדד ועבודה שחורה במטלב.. לא כיף. שאלות הפתרון הידני טובים לתרגול השיטות שנלמדו.\n\nהמבחן: הוגן. צריך להגיע לתקופת מבחנים עם ידע כולל של החומר. כלומר להישאר במעקב כי במהלך הסמסטר מתרגלים כל שיטה בנפרד, ופתאום בבחינות כל השיטות הן ביחד. מומלץ לפתור כמה שיותר בחינות וניתן מאוד לקבל ציון טוב.\n\nהשורה התחתונה: קורס סבבה..", "timestamp": 1658092409662}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "חוות דעת - הרצאות: שווה להיות בהרצאות, יש שאלת מרצה בבחינה המהווה 20 נק'\n\nשם המתרגל/ת: מחמוד קבלאוי\nחוות דעת - תרגולים: מתרגל תותח !! אין מילים\n\nשעורי הבית: לוקחים זמן, שווה להשקיע\n\nהמבחן: סביר, הכל הייה כמו בתרגולים אבל שאלת מרצה קשה\n\nהשורה התחתונה: תשקיעו במהלך הסמסטר והכל יהייה טוב", "timestamp": 1663234684421}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: מרצה טוב, חשוב להגיע. \nלקראת המבחן גם חשוב לעבור טוב על השקפים כי זה ממש המיקום מהם הוא מביא את השאלות\n\nשם המתרגל/ת: מוקלטת\nחוות דעת - תרגולים: מהממת. מסבירה טוב, פרקטית, לעניין, ומוקלטת ממש טוב אז אפשר לרוץ על התרגול מבלי לבהות שעות בחישוב טכני. לדעתי ממש עדיף על פרונטלי, יותר מתאים לפורמט של הקורס.\n\nשעורי הבית: מציקים. הרמה סבבה והכל, חשוב לעשות אותם כי זאת דרך ממש טובה ללמוד את החומר. אופן מתן הציונים קצת קטנוני, מורידים הרבה נקודות על זוטות מעצבנות ולא על העיקר. \n\nהמבחן: בוחן אמצע - חשוב לעשות טוב! מגן ממש חשוב ומבחן קל יחסית. אם לומדים אפשר להשיג ציון מאוד גבוה, במיוחד אם עשית את כל הש\"ב עד כה.\nהמועד א' היה זוועה. נראה שהסגל היה עצבני על הסטודנטים, לדעתי לא היה הוגן. ממש ארוך מדי והחלוקת נקודות לא תואמת את כמות העבודה שכל סעיף דורש. בחרו מספר נושאים שלא היה עליהם הרבה פוקוס. חשוב לתרגל הרבה מבחנים ולעבור על החומר עם סיכום טוב, כי רוב המבחן בוחן הבנה תיאורטית של חומר שנלמד בהרצאות, אבל גם המון חישובים טכניים ארוכים, ולבסוף גם על כישורי מטלב. מרגיש כאילו ללמוד למבחן זה ללמוד ל-3 קורסים שונים מבחינת כישורים. בקיצור, קורס מאוד מציק. \n\nהשורה התחתונה: לדעתי החומר היה מאוד מעניין, שמחתי ללמוד אותו. מבחן לא קל אבל אפשרי ללמוד אליו. הרבה חומר יחסית לכמות הנק\"ז. דורש יותר למידה משנראה.\nאפשר להבין טוב את החומר ולתרגל מלא אבל עדיין לצאת עם טעם מר מהמבחן.", "timestamp": 1689587789045}, {"author": "נופר", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: חשובות, לא הכי מעניינות. מרצה נעים ומסביר מעולה. חשוב לעקוב , במבחן יש הרבה שאלות מרצה שלא עוברים עליהם בתרגולים\n\nשם המתרגל/ת: הקלטות פנופטו\nחוות דעת - תרגולים: המתרגלת בהקלטות תותחית, אין צורך ללכת פרונטלי\n\nשעורי הבית: מתחלקים לזוגות, ברוב ההגשות יש לכתוב קוד במטלב, רוב הש\"ב לא היו עמוסים בהגזמה, היו חלק שכן אבל בסה\"כ בסדר. לא קשה במיוחד\n\nהמבחן: קשוח, צריך להיות חדים על כל החומר ולתרגל באמת את כל השיטות.\n\nהשורה התחתונה: סגל קצת מבאס ולא אכפתי, הבוחן אמצע היה סביר, לרוב ככל הנראה זה יעזור בציון הסופי. סה\"כ קורס בסדר", "timestamp": 1690116240660}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: מרצה מעולה ומקצועי. שולט בחומר מאד ועונה בכיף לסטודנטים. הוא מהיר בהרצאות ולא עוצר עד השניה האחרונה של ההרצאה.\n\nשם המתרגל/ת: רוני מוקלט\nחוות דעת - תרגולים: \nתרגולים בפנופטו זה כל מה שצריך בשביל הקורס הזה. מתרגלת מעולה בפנופטו שסוגרת את הכל הפינות בחומר.\nשעורי הבית: קשים ולוקחים זמן בעיקר בגלל שאלות מטל\"ב. היתר סביר.\n\nהמבחן: לא קל, אבל אם לומדים מספיק ונותנים דגש במקומות הנכונים אפשר לקבל ציון טוב. המבחן במבנה זהה תמיד. יש תמיד שאלת מטל\"ב, שאלת מד\"ר, שאלת מטריצות וכ'ו. אם לומדים מכוון למבחן מצליחים.\n\nהשורה התחתונה: קורס מעניין וחשוב שהמטל\"ב זה מה שמקשה עליו", "timestamp": 1690705405143}, {"author": "אנונומי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: לא הגעתי בכלל. לדעתי מספיק לקרוא את המצגות לפני המבחן בשביל השאלות מרצה וזהו\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: אפשר לראות על 2 ולהבין הכל. מתרגלת חזקה מאודדדדדדד ואת כל הקורס למדתי רק מהמוקלט\n\nשיעורי הבית: חשובים-דורשים השקעה, לוקחים זמן,רק עשר אחוז מהציון אבל הם מאוד עוזרים להבין ולהסגר על החומר כמו שצריך\n\nהמבחן: הוגן-צריך לחזור ולתרגל את השיטות,אין יותר מדי הפתעות-כשמבינים את השיטות זה פשוט טכני\n\nהשורה התחתונה: אפשר לסיים את הקורס עם ציון גבוה מאוד,מומלץ לגשת לבחן אמצע ולהשקיע בשיעורי בית", "timestamp": 1694619795389}]}