{"posts": [{"author": "prital margi", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: אנטונינה\nחוות דעת - תרגולים:\n\nשעורי הבית: יש הגשה של מעבדה כל שבוע, זה דיי חופר אבל יש מלא רפרנסים בדרייבים לפחות\n\nהמבחן: בפעם הראשונה מזה שנים שהמבחן לא היה כולו ממוחזר, זה היה ממש מפתיע אבל הבדיקה לא הייתה קשוחה ובסופו של דבר הציונים היו סבירים.\n\nהשורה התחתונה: קורס מציק שמתים לסיים איתו, חברים שלי לקחו אותו בקיץ ולדעתי זה היה חכם, הקורס בקיץ הרבה יותר קליל, פחות מקפידים על איכות המעבדות ובאים רק פעמיים כל פעם עושים 4 מעבדות ומסיימים עם זה.", "timestamp": 1649510746867}, {"author": "og", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: מעבדות\nאדם מעביר את התרגולים בצורה מעניינת ונותן הערות תוך כדי שעוזרות בפתרון הדוחות.\n\nשעורי הבית: \nיש מעבדה כמעט כל שבוע ונדרש להכין דוח עבור כל אחת.\nהדוחות דיי מעיקים וארוכים 5-7 שעות לדוח.\nיש רפרנסים\n\nהמבחן: \nהוגן אפשר לקבל ציון טוב אם עושים את כל הדוחות ולומדים יומיים לבחינה\n\nהשורה התחתונה: דיי מעיק אבל בסדר", "timestamp": 1658055796536}, {"author": "I AM GROOT", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: הוא מעולה ומובן\n\nשעורי הבית: מעצבנים ואי אפשר לשרוד את הסמסטר בלי לעשות הכל מרופרנס\n\nהמבחן: סביר\n\nהשורה התחתונה: ממש עדיף לעשות בקיץ, הייתי יכולה להשקיע הרבה יותר בדברים אחרים לאורך הסמסטר. הקורס הזה אכל לי זמן", "timestamp": 1679304171165}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אין\nחוות דעת - הרצאות: \nאין\nשם המתרגל/ת: אדם סבח\nחוות דעת - תרגולים: אדם היה המנחה מעבדה. הוא קליל ונוח. המעבדה עוברת איתו בסבבה סך הכל.\n\nשעורי הבית: יש דו\"חות מוגזמים בטירוף. בשימוש 3 רפרנסים לכל דו\"ח, לקח לנו בממוצע 5 שעות לדו\"ח.\n\nהמבחן: פשוט מאד, אם עושים את הדוחות כמו שצריך ולומדים יומיים לפני המבחן זה מספיק. המבחן ממוחזר מאד.\n\nהשורה התחתונה: קורס מעמיס מאד במהלך הסמסטר בגלל הדוחות. כל השאר שטויות", "timestamp": 1690705182145}, {"author": "בני מוניץ", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: אדם סבח\nחוות דעת - תרגולים: אדם מתרגל מעבדה טוב, זורם והכל מתנהל באווירה טובה. רק לפעמים הוא קשוח מבחינת דרישות והדו\"חות\n\nשעורי הבית: יש דו\"חות מעבדה נוראיים. כל אחד לוקח לפחות 5 שעות עם 3 רפרנסים שונים. זה סיוט לקחת במהלך הסמסטר. מומלץ לקחת בקיץ\n\nהמבחן: ממוחזר, קל ופשוט. מומלץ לעשות כמה שיותר טוב את הדו\"חות כי המבחן מאד דומה ומסתמך על השאלות שהיו בדו\"חות.\n\nהשורה התחתונה: להשקיע בדו\"חות למרות שהם סיוט מבחינת זמן. הם לא קשים, הם רק שואבים זמן.", "timestamp": 1704625778330}, {"author": "Student", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המתרגל/ת: אנטונינה\nחוות דעת - מעבדה: \nיש 8 מעבדות באורכים שונים. יש בוחן כניסה על התיאוריה לפני כל מעבדה. \nאנטונינה ממש משקיעה מעצמה ועוזרת במהלך המעבדה. \nדוחות:\nמעייפים. יש רפרנסים מ2002 ואילך שכדאי מאוד להשתמש בהם. גם איתם הדוחות נורא ארוכים.\nהמבחן: \nקליל. הוא מבוסס על החלקים הטכניים בדוחות. מספיק יום- יומיים למידה של לעבור על שאלות עבר כי המבחן הוא ממוחזר ממש.\nהשורה התחתונה: \nקורס קליל סה\"כ. החלק הקשה בו זה לתפוס מקום בעיקר בחורף.", "timestamp": 1715497607939}]}