{"posts": [{"author": "Mish Lomov", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מחמוד \nחוות דעת - הרצאות: הרצאות עמוסות בחומר, ומורגש לפעמים שהם אינן חיוניות לפתירת שיעורי בית . לדעתי מספיק לראות תרגולים ונוכל להגיע מוכנים לשיעורי הבית ולמבחן. \n\nשם המתרגל/ת: מיכל לבנוני\nחוות דעת - תרגולים: מתרגלת אחראית- יחסי אנוש מעולים, מבינה את הסטודנטים ומסבירה בצורה מעולה, אולם קצת מבולגן על הלוח אבל זה שטויות.\n\nשעורי הבית: שיעורי הבית היו מאוד עמוסים, לפחות עד שיעורי בית 9. לקח המון המון זמן לפתור את כולם כי נתנו מלא תרגילים והיה מתרגל בשם נתנאל שהיה מוריד נקודות על שטויות ודקויות שרק הוא היה אומר בתרגולים שלו והוא היה בודק גם לאחרים את השיעורים.. \n\nהמבחן: \nמבחן אמצע היה מאוד הוגן והרוב קיבלו ציונים גבוהים. \nהשורה התחתונה: קורס מעולה, מעניין ופותח את החשיבה לתואר הנדסת בניין.", "timestamp": 1612628784415}, {"author": "נ.א.", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מחמוד גבארין\nחוות דעת - הרצאות: מרצה מגעיל, ממליצה לא לצפות בהרצאות. תקחו את החומר ממישהו ותקראו אותו לפני התרגול.\n\nשם המתרגל/ת: אבי וורף\nחוות דעת - תרגולים: מאוד ממליצה, מסביר מצויין ופותר את הכל מראש כדי שלא יבזבז זמן על חישובים בזמן התרגול.\n\nשעורי הבית: גועל נפש חחחחח. הם לא קשים אבל לוקחים הרבה זמן לפתור, ממליצה להתחיל לפתור ככל המוקדם. יש תרגיל בית בסוף כל שבוע על הנושא של השבוע וכולם חובה. תנסו לעשות אותם לבד כי תכלס המבחן הוא כמו 3 תרגילי הבית האחרונות. \n\nהמבחן: ארוך, ארוך, ארווווך. בממועצ יש 3-5 שאלות ומשך הבחינה היא עד 3 שעות (מחמוד לא אומר כלום על מבנה המבחן לפני הבחינה). בגדול אני ממליצה לצבור כמה שיותר נקודות כי רוב הסיכוי שלא תספיקו את הכל. \n\nהשורה התחתונה: קורס לא קשה בכלל, פשוט לוקח הרבה זמן.", "timestamp": 1613746753715}, {"author": "א.ב", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מחמוד ג'אברין\nחוות דעת - הרצאות: לא יודע מי כתב פה תגובות קודמות אבל לכתוב \"מרצה מגעיל\" זה קצת קיצוני. החומר לא פשוט, זה לא אומר שהוא לא בסדר, בנאדם ממש רציני ורהוט בצורה יוצאת דופן, פשוט מאוד אוהב להתנהל בצורה מסודרת, לסיים הסבר ואז ששואלים שאלות וכו'\n\nשם המתרגל/ת: מיכל המלכה\nחוות דעת - תרגולים: אלופה, אין מה להגיד\n\nשעורי הבית: די קשים אבל אפשר להסתדר לגמרי\n\nהמבחן: מבחן אמצע מתחשב ביותר, היו ציונים טובים\nמבחן סוף טכני לגמרי, לשלוט לאורך הסמסטר ואין סיבה שלא להוציא ציון טוב\nהשורה התחתונה: להשקיע כל הסמסטר, לראות שמבינים הכל תמיד, המבחן דורש טכניקה טובה אז אם אתם בסדר לאורך הסמסטר, גם המבחן יהיה סבבה", "timestamp": 1614880505684}, {"author": "א'", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nפרופ' מחמוד ג'ברין\nחוות דעת - הרצאות: \nהרבה ידע תיאורטי.\nחוות דעת - תרגולים: \nחשובים, להגיע לכולם.\nשעורי הבית: \nארוכים אבל מתרגלים בצורה טובה את החומר.\nשימו לב כי כל מתרגל מלמד באופן קצת שונה ודורש רמת פירוט אחרת.\nממליץ להגיש תרגילים מפורטים ככל הניתן וברורים.\nהמבחן: \nמבחן לא פשוט אבל עם הרבה תרגול מצליחים.\nהשורה התחתונה: \nקורס בסיסי ומעניין.", "timestamp": 1617702206776}, {"author": "...", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרופ. מחמוד גבארין\nחוות דעת - הרצאות: שווה לצפות בזמן. מרצה תותח.\n\nשם המתרגל/ת: שלום-דוד אקסמן-קליינגיזנד\nחוות דעת - תרגולים: שלום מסודר ואכפתי. אמנם קצת איתי אבל מעניין אותו שכולם יבינו\n\nשעורי הבית: יחסית עמוסים, אבל מי שמבין את החומר מסיים יחסית מהר( הייתי מקדיש יום אחד לשיעורי בית, מקסימום 2)\n\nהמבחן: \n\nלפתור כמה שיותר מבחנים !!! ולא לרפרנס שיעורי בית !!!", "timestamp": 1644061085974}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מחמוד ג'עברין\nחוות דעת - הרצאות: \nהמרצה מלמד ברמה טובה והחומר מעניין. הוא קצת אוהב ללמד בקצב שלו אז לא להיפגע אם הוא לא עונה על שאלות לכל מי שצועק \nשם המתרגל/ת: נתנאל בן זקן\nחוות דעת - תרגולים: \nהתרגולים מעולים, יש שירגישו התנשאות ומרירות מנתנאל אבל הוא משקיע המון ויעזור לכם כמה שרק תבקשו בשעות קבלה ומעבר.\nהקורס הזה הוא בין היחידים בטכניון שיש נוכחות חובה וזה באמת חריג, אצלנו אפילו הקריאו שמות ובאמת הרגיש כמו בית ספר.\nשעורי הבית: \nקשיםם. יום שלם בשבוע רק על השיעורי בית. הם היו נותנים גם תרגילי רשות שלדעתי חבל על הזמן של מי שהכין אותם כי בקושי יש זמן לשיעורים עצמם.\nקצת מעצבן שאין תשובות לשיעורי בית/בחני אמצע/מבחנים משנים שעברו ונורא קשה ללמוד לקראת המבחן כי לא יודעים בכלל מה התשובות.\n\nהמבחן: \nארוך וקשה לסיים בזמן\nהשורה התחתונה: \nקורס מעניין וחשוב אבל ההתנהלות של הסגל מרגישה שהם בכוונה רוצים להקשות כדי שלא כולם יעברו.", "timestamp": 1644732348536}, {"author": "mohamad abumkh", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מחמוד גבארין\nחוות דעת - הרצאות: מרצה מעולה, מסביר הכל בצורה ברורה, אחרי כל הסבר נותן לסטודנטים לשאול ומאפשר דיון בין הסטודנטים על השאלה לפני שהוא נותן את התשובה, רואים שהוא טיפה יותר רציני ממרצים אחירים.\n\nשם המתרגל/ת: שלום\nחוות דעת - תרגולים: מתרגל טוב, אכפת לו שכולם מבינים.\n\nשעורי הבית: ארוכים מדי, אבל נותנים לנו להבין את החומר בצורה ברורה.\n\nהמבחן: ארווווווך מדי, נתן לנו כמו המבחנים הקודמים 4 שאלות, אבל 2 השאלות שהן על סופרפוזיציה ומומנט אינרציה שהן לא לוקחות כמעט זמן במבחן לא היו, במקום היו שאלות שלוקחות הרבה יותר זמן, שאלה אחרונה במבחן פעם ראשונה שאנחנו רואים כמוה, כמעט אף סטודנט סיים את המבחן בזמן, (מבחן לא הוגן בכלל !!)\n\nהשורה התחתונה: קורס מעניין, חשוב מאוד, כיף ללמוד אותו, רק שיתנו מבחן הוגן.", "timestamp": 1645701456370}, {"author": "?", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: הבין אישי שלו לא משהו\n\nשם המתרגל/ת: שלום\nחוות דעת - תרגולים: ממש חמוד ועושה דברים מהלב\n\nשעורי הבית:  צריך להשקיע הרבה זמן אבל לא קשים יותר מדי\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1647102887306}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מחמוד גבארין \nחוות דעת - הרצאות: מרצה שחצן שבכלל לא מכבד את הסטודנטים שלו   , נותן הרגשה שהוא היחיד בעולם שיש לו תואר פרופסור , כמו שהסטודנטים הם כלבים ועבדים שלו , מבחינת שיטת לימוד הוא לא אביב צנזור , עוקאשה או עליזה מלק השיטה שלו רגילה לגמרי ואין בה משהו מיוחד אפשר להחליפו בסטודנט עם תואר שני בהנדסת מבנים ,  וההרצאות שלו חשובות עד ההרצאה החמישית אחרי כך מיותר מספיק תירגולים\n\nשם המתרגל/ת: נתנאל בן זקן\nחוות דעת - תרגולים: ממליצה מאוד , מסביר טוב , מלמד מהלב , מתעמק ואכפת לו שמבינים , לפעמים עצבני אבל הוא נותן רציני ומכבד\n\nשעורי הבית: ארוכים וצריכים הרבה השקעה , צריך לפתור לבד , אבל הרבה לשאול , ללכת לשעות קבלה להיעזר בחברים (בלשאול ולהבין רק) \n\nהמבחן: מבחן שלא ממש משקף את הידע וההבנה וצריך אסטרטגיות למידה מיוחדים , הרבה תירגול והתכוננות רצינית וטובה , מבחן ארוך בכללי הבעיה היא הזמן\n\nהשורה התחתונה: הרגשה שממש קשה לפני שעוברים , ומאוד כל אחרי", "timestamp": 1647388279965}, {"author": "נ.א", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: מרצה טוב, מסביר טוב ומסודר. \n\nשם המתרגל/ת: שלום\nחוות דעת - תרגולים: מאוד חשוב להבין את הכל בתרגולים, בהרצאות לומדים את התיאוריה ובתרגולים איך באמת לפתור שאלות. \n\nשעורי הבית: לוקחות הרבההה זמן, אחת כל שבוע כולם תקפים (לפעמים האחרונה נותנים כמגן) \n\nהמבחן: ארוך ארוך ארוך. לא קשה, מאוד הוגן אבל צריך הרבה תרגול כדי להצליח לסיים את המבחן בזמן. 90% לא סיימו לפחות שאלה אחת מתוך 4 שהיו בבחינה. תמיד לפתור לפי נקודות, לצבור כמה שיותר בזמן הקצר ביותר. לא להתעכב על דברים קטנים! \n\nהשורה התחתונה: מאוד עמוס אבל לא קשה.", "timestamp": 1648645967801}, {"author": "שי קליין", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מחמוד ג'ברין\nחוות דעת - הרצאות: \nהרצאות בנויות היטב, ניכר שהמרצה מנוסה ויודע כיצד להעביר את החומר בצורה מיטבית. \nשם המתרגל/ת: שלום קליינגזינד\nחוות דעת - תרגולים: \nתרגולים טובים. נותן את הדגשים החשובים ומסביר בסבלנות כשצריך.\nשעורי הבית: \nארוכים מאוד, אבל תורמים בצורה משמעותית להבנה. חשוב מאוד לעשות לבד ואז להשוות עם חברים.\nהמבחן: \nהקושי הגדול במבחן הוא הזמן. בשנים האחרונות רואים גם עלייה בדרגת הקושי של השאלות, כולל שאלות על נושאים שנדונו בהרצאה בלבד ולא ניתנו עליהם תרגולים או תרגילי בית, צריך להיות מוכנים לכל תרחיש. \nהשורה התחתונה: \nקורס מעניין מאוד, רמת קושי גבוהה, אבל אם משקיעים אפשר להוציא ציונים טובים בהחלט.", "timestamp": 1656915272039}, {"author": "adam shhady", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מחמוד גבריאן\nחוות דעת - הרצאות: \nהוא ממש טוב בהעברת החומר למרות שלפעמים מתעסק בהוכחות מיותרות וארכות ואי אפשר להבין בזמן ההרצאה \nשם המתרגל/ת: ינאי אבריס\nחוות דעת - תרגולים: \nהתרגולים לא כל כך זה פשוט לשבת 2 שעות לראות את המתרגל פותר משוואות עם משתנים \nשעורי הבית: \nקשים מאוד צריך טריקים שלא לומדים במסגרת הקורס ( לא בהרצאות ולא בתרגולים ) \nהמבחן: \nממש קשה ולא הוגן מבחינת זמן בהשוואה עם שנים קודמים והמבחן לא סביר צריך לתרגל הרבה מבחנים לפני וחשוב לתרגל עם זמן \nהשורה התחתונה:", "timestamp": 1658149196126}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מחמוד גבארין\nחוות דעת - הרצאות: המרצה רציני וקצת קשוח, אך מסביר את החומר בצורה מצויינת וברורה, מניסיון חשוב להגיע להרצאות כדי להבין את החומר בצורה יותר טובה ועמוקה ובכך ללכת מוכנים לתרגול, מומלץ מאוד ללכת להרצאות של הנושאים כבלים\\ קשתות ומהלכים הפוכים כי בקושי מתרגלים אותם בתרגולים (הנושא כבלים אפילו לא הופיע בתרגולים) ועם זאת הופיעו במבחנים האחרונים.\n\nשם המתרגל/ת: אבי וורף\nחוות דעת - תרגולים: מתרגל טוב, בתחילת כל תרגול היה עושה הקדמה קצרה על הנושא ואחרי זה מתחיל לפתור את השאלות, יש שיתוף פעולה בינו לבין הסטודנטים מה שהיה דבר טוב.\n\nשעורי הבית: בכל שבוע יש הגשה, שיעורי הבית קצת ארוכים ולוקחים זמן לכן מומלץ לא לדחות אותם לרגע האחרון, אם הבנתם את העיקרון מההרצאות והתרגולים יהיה אפשר לפתור אותם לבד, מומלץ מאוד להשקיע בהם כדי להגיע למבחן מוכנים.\n\nהמבחן: אפשר לראות שבכל מועד יש עלייה ברמת הקושי במבחנים, שני המועדים האחרונים לא היו קלים והממוצע מעיד על כך, לכן תתרגלו המון ותפתרו כמה שיותר שאלות.\n\nהשורה התחתונה: קורס דורש השקעה והבנה טובה בחומר אל תתביישו לשאול אם לא מבינים משהו ותלכו לשעת קבלה במידת הצורך.", "timestamp": 1666272779400}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מחמוד גבארין\nחוות דעת - הרצאות: מחמוד מרצה טוב ומצויין בהעברת החומר אבל הוא נותן לנו הרגשה שהוא האיש היחיד בעולם שיודע מכניקה אבל תכלס שיטה מצויינת \nשם המתרגל/ת: איבראהים בולוס \nחוות דעת - תרגולים: מתרגל מצויין ודואג ובא לקראת הסטודנט ומקשיב לכל השאלות ופותר הכל תכלס אחלה מתרגל \n\nשעורי הבית: די ארוכים החלק מהשאלות קצת מיותרים אבל עדיף להשקיע בהם על מנת להצליח במבחן כי הם דומים מאוד לשאלות המבחן\n\nהמבחן: די ארוך וצריך השקעת זמן עדיף לתרגל בבית עם טיימר כדי להספיק וצריך הבנה לטריקים \n\nהשורה התחתונה:", "timestamp": 1679473616788}, {"author": "סטודנט אזרחית", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "סטודנטים חדשים שימו לב. הקורס הזה שונה משאר הקורסים.\nתן לו יחס מיוחד. 2/3 מהתואר נכשלו במועד א והרבה גם נכשלו מועד ב.\nאם נכנסים להרצאות ולתרנגולים ופותרים ש.ב, צריך להיות בסדר.\nאבל אתה צריך להבין שלא מדובר בסתם עוד קורס.\nהקורס הזה הוא הבסיס לכל שאר התואר.", "timestamp": 1679555887694}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה:  יורי קרינסקי.\nחוות דעת - הרצאות: מרצה לא טוב בכלל  ,אל תיקחו את הקורס עם יורי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמאוד קשה וארוך ומורידים מלא נקודות .\n\nהשורה התחתונה:", "timestamp": 1690795401686}, {"author": "ויקטוריה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מחמוד \nחוות דעת - הרצאות: מרצה מעולה !מעביר את החומר בצורה נהדרת \nמגיע בצורה מכבדת ודורש שיכבדו אותו (בלי פלאפונים /דיבורים וכו ) \nפחות נחמד בכתיבת מבחנים \n\nשם המתרגל/ת:אבי  \nחוות דעת - תרגולים: מתרגל טוב, בדרך כלל מספיק את כל החומר \n\nשעורי הבית: כל שבוע מטלה \n\nהמבחן: לא פשוט ,יש לבוא מוכנים ממש ,להשתדל לתרגל כמה שיותר \n\nהשורה התחתונה:", "timestamp": 1704732585309}]}