{"posts": [{"author": "Ran Eckl", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "חלק ראשון:\nשם המרצה: תומר טולדו\nחוות דעת - הרצאות: הרצאות מוקלטות סך הכול טובות, הרבה חומר יחסית (אבל בסופו של דבר במבחן מה שחשוב זה הפתרון של התרגילים, התיאוריה פחות רלוונטית).\n\nשם המרצה: ופא אליאס\nחוות דעת - הרצאות: ופא מרצה מצוינת ומתחשבת. לימדה בצורה טובה, הרצאות בלייב.\n\nשם המתרגל/ת: מחמוד + שאדי\nחוות דעת - תרגולים: התרגולים היו טובים (הוקלטו מראש), פתרו תרגילים בוריאציות שונות, תכלס מה שצריך למבחן.\n\nשעורי הבית: 2 שיעורי בית ופרויקט. שיעורי הבית נוגעים לחלק הראשון של הקורס (ומאוד רלוונטים למבחן) והפרויקט נוגע לחלק השני של הקורס.\nהפרויקט עמוס וכולל 3 חלקים - שווה מאוד לדעת אוטוקאד או ללמוד תוך כדי תנועה בשביל הפרויקט! אחרת צריך לעשות את הפרויקט ידני (לא מומלץ)\n\nהמבחן: מבחן הוגן עם ציונים גבוהים. כולל את 2 חלקי הקורס (2 שאלות חלק ראשון, 2 שאלות חלק שני)\n\nהשורה התחתונה: אחלה קורס, ציונים גבוהים. החלק של הפרויקט מאוד מעמיס.", "timestamp": 1615547088496}, {"author": "prital margi", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עומר ווופא\nחוות דעת - הרצאות: הרצאות נחמדות, לא חומר מסובך להבנה.\n\nשם המתרגל/ת: יאמן (ראיתי את ההקלטות)\nחוות דעת - תרגולים: תרגולים קלילים ממש בין 10-50 דקות כל אחד. \n\nשעורי הבית: יש שתי עבודות להגשה (על החלק הראשון של הקורס) ושני פרויקטים להגיש (על החלק השני של הקורס) שמאוד עוזרים בהבנה. \n\nהמבחן: מבחן הוגן לחלוטין, היה שם טיפה התייחסות לדברים שנאמרו רק בהרצאות ולא בתרגולים כי הם לא רוצים שסטודנטים יראו רק את התרגולים אך זה לא היה קריטי.\n\nהשורה התחתונה: זה היה הקורס הכי קליל שלקחתי הסמסטר, נהנתי ללמוד אותו ובלי השקעה מטורפת קיבלתי ציון סביר.", "timestamp": 1649511432633}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: תומר ואליאס\nחוות דעת - הרצאות: בחלק הראשון - התרגולים וההרצאות מוקלטים וצריך לראות לבד בבית ובהרצאה פותרים את התרגילי כיתה. אפשר להסתדר מבלי לראות את ההרצאות.\n\nשם המתרגל/ת: מוקלטים - יאמן ומחמוד\nחוות דעת - תרגולים: חשוב לראות\n\nשעורי הבית: בזוגות- של החלק הראשון בקורס - היו תרגילי כיתה כלומר מי שרוצה יכול להגיע להרצאה לפתור ואם יש שאלות לשאול את המרצה והמתרגלים - היו נוראיים, היה קשה להבין מה הם רוצים מאיתנו ומה מבקשים (בגלל זה היו תרגילי *כיתה*), הרבה אקסל.\nבחלק השני יש פרויקט שמורכב משני חלקים - תכן אופקי ותכן אנכי. יש אוטוקד קצת מעצבן אבל מסתדרים. \nבסופו של דבר התרגילי בית כן עוזרים לקראת המבחן והמגן מטורף! 40% על תרגילי הבית והפרויקט.\n\nהמבחן: מורכב בדרך כלל מ 5 שאלות - שאלת תכן אופקי, שאלת תכן אנכי, שתי שאלות תחבורה ולפעמים שאלת תאורייה של 10 נקודות כמעט. לא כזה קשה.\n\nהשורה התחתונה: הקורס מחולק לשני חלקים - תנועה/ תחבורה ותכן גיאומטרי. קורס מיותר לדעתי.", "timestamp": 1677844597924}, {"author": "I AM GROOT", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: תומר טולדו\nחוות דעת - הרצאות: בן אדם קטנוני ולא נחמד בכלל. במקרים רבים הגיעו קבוצה גדולה של סטודנטים אם אותה השאלה, ובמקום להבין שמשהו לא היה ברור בהעברה של החומר, הוא בחר להתייחס אלינו כאילו כולנו טיפשים.\n\nשם המתרגל/ת: מחמוד מוקלט\nחוות דעת - תרגולים: ממש אחלה\n\nשעורי הבית: יותר שיעורי בית באקסל מאשר שיעורי בית בתחבורה.\nמומלץ בשביל הפרוייקט למצוא את ההקלטה של מחמוד שבה הוא מסביר איך לעשות הכל שלב שלב באוטוקאד\n\nהמבחן: פסדר\n\nהשורה התחתונה: לעשות מבחנים", "timestamp": 1679304978154}]}