{"posts": [{"author": "אסף טנגיר", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאין קשר בין המבחן להרצאות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהרבה חפירות.מבלבל\nשעורי הבית: \nלעשות!\nהמבחן: \nעמוס מאוד..\nהשורה התחתונה:", "timestamp": 1602795541555}, {"author": "מיג", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: מיכל אשור\nחוות דעת - הרצאות: מספיק לראות את השקופיות, אם יש הרצאות מוקלטות בכפול שתיים זה גם נחמד. לא הכרחי.\n\nשם המתרגל/ת: עדיה שקד\nחוות דעת - תרגולים: באופן יחסי לרוב המתרגלים היא נחשבת טובה.\n\nשעורי הבית: ארוכים, משוב לא משהו, ציונים לא תמיד קשורים לכמה השקעת בתרגיל בית. בסה\"כ ציונים בין 80-100 לרוב\n\nהמבחן: ארוך. להגיע מוכנים.\n\nהשורה התחתונה: זה הקורס הראשון שלוקח אותך כסטודנט שעושה אנליזה לדבריןם שניתנים לך לבין כזה שמחליט איך לבנות מבנה במתווה מסויים. בדבר הזה, הוא מגניב. חבל שזה כרוך בקצת סבל בדרך", "timestamp": 1603296085345}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיכל אשור\nחוות דעת - הרצאות: הרבה חומר חשוב ומעניין, אבל לא תמיד ההרצאה קשורה לתרגיל של אותה שבוע, אבל בכל זאת כדאי להקשיב, יש במבחן שאלות תיאורטיות שמתבססות על ההרצאות (יחסית קצת נקודות)\n\nשם המתרגל/ת: עדיה שקד\nחוות דעת - תרגולים: הסדנאות מאוד רלוונטיות ועוזרות הרבה לפתירת תרגילי הבית. הן חובה.\n\nשעורי הבית: מאוד חשובים, המבחן הוא סוג של תרגיל בית, אבל בזמן הרבה יותר קצר. חשוב להבין איך לבצע אותם נכון בזמן הקצר ביותר, זה תרגול מאוד טוב למבחן. (בהתחלה לוקח יותר מידי זמן לעשות ת.ב)\nכדאי לעשות אותם בזוגות!\n\nהמבחן: לא מאוד קשה מבחינת החומר, אבל מאוד לחוץ בזמן.\nמבנה המבחן היה:\n10 נק טיאוריה\n20 שאלה קטנה\n70 שאלה גדולה\n\nהשורה התחתונה: להשקיע בתרגילי בית ולנסות להבין איך לפתור ביעילות.\nזה קורס שעוזר מאוד לפתור בעיות כמהנדס.", "timestamp": 1627969413854}, {"author": "אסף", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מיכל אשור\nחוות דעת - הרצאות: \nלרוב ההרצאות מעניינות.\nשם המתרגל/ת: עדיה\nההקלטות היו מעולות\nיש סדנאות שלדעתי לא כ\"כ מועילות\nשעורי הבית: \nארוכים\n\nהמבחן: \nטכני וארוך צריך לעבוד מהר ולחשוב מעט.\nהשורה התחתונה: \nבמהלך הקורס מצפים ליצירתיות אבל בפועל המבחן הוא על טכניקה ומהירות", "timestamp": 1635274462056}, {"author": "אני?", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכל אשור\nחוות דעת - הרצאות: משעמם בטירוף. החומר עם פוטנציאל להיות מאוד מאוד מעניין ובסוף עוסקים בלב המקצוע אבל המרצה גורמת לזה להיות משעמם מאוד ומנותק מאוד מהפרקטיקה של התרגולים והמטלות.\n\nשם המתרגל/ת: לי-אור\nחוות דעת - תרגולים: היו אחלה ובאווירה טובה אבל לצערי השיעור שהיה אמור להכין אותנו לקראת ביצוע המטלות התקיים דווקא במפגש האחרון של הסמסטר (בהרצאה) ככה שכל הסמסטר היינו צריכים להבין לבד איך להתמודד עם התרגילים וכיצד הם רוצים שהם יהיו מוגשים.\n\nשעורי הבית: ארוכים אבל חשובים.\n\nהמבחן: לא משקף ב-כ-ל-ל. הציונים הזויים (השנה הממוצע הכי נמוך שהיה אבר לדעתי). המבחן היה לחוץ בזמן ברמה כזו שמי שהעז לצאת לשירותים מטורף. כל מה שלמדנו במהלך הסמסטר ***לא*** בא לידי ביטוי במבחן. היה צריך לעבוד מהר ובלי מחשבה (לא שהיה זמן לחשוב).\n\nהשורה התחתונה: קורס חשוב אבל הדרך... אוי הדרך... הסגל הזה צריך לעשות חושבים ארוכים ארוכים.\nלא הגיוני שסטודנטים שמשקיעים כל הסמסטר יקבלו ציון רע.", "timestamp": 1659967831945}, {"author": "5בונוס", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מירב בורשטיין (קורס במתכונת חדשה)\nחוות דעת - הרצאות: נוכחות חובה עם רשימת שמות.\nנחמדות, כשהקורס מתחיל מתקבל הרושם של \"סוף סוף קורס שהולך ללמד משהו\" וההרצאות באמת גורמות לך לחשוב ככה, עד שאתה מגיע לאמצע הסמסטר ואתה מבין שהגאולה לא תבוא מהקורס הזה.\n\nשם המתרגל/ת: מגוון\nחוות דעת - תרגולים: נוכחות חובה עם רשימת שמות.\nזה לא באמת תרגולים, מדובר על איזשהי מוטציה שבה בחלק הראשון מציגים את ההגשת ביניים, מראים לך איפה טעית (*ולא מסבירים לך איך לתקן*)\nבחלק השני מסבירים בחפיף את ההגשה הבאה.\nבחלק השלישי אתה שובר את הראש בלנסות להבין מה רוצים ממך תוך כדי שהמתרגלים מסתובבים ואומרים לך שוב איפה טעית *ולא מסבירים לך איך לתקן*\nהמנטליות של הצוות היא \"תן לסטודנטים לשבור את הראש, בסוף אולי הם יצליחו להבין לבד\"\n\nשעורי הבית: \nסיוט, כל הגשה מתחלקת לשני חלקים, הגשת ביניים והגשה סופית. הם פשוט לא מסבירים כמו שצריך מה הם רוצים ממך כל הגשה היא נטל כבד מנשוא, שורפת שעות ותאים במוח.\nשעות קבלה הן לא מילה גסה (וגם כאן צריך לדעת לאיזה מתרגל ללכת, רק מירב, לי-אור או עדיה באמת יודעות מה צריך לעשות בהגשות האלה, השאר סתם...)\nפתרונות רשמיים בשביל שנדע בדיוק איך לפתור בדיעבד? הצחקתם אותי... היה להגשה הראשונה, לכל השאר כבר לא היה לצוות כוח לספק.\n\nהמבחן: \nהיה רע, לא נתנו לנו דרך אמיתית ללמוד אליו, מבחנים לדוגמה? הצחקתם אותי... נתנו לנו שניים שלא היו קשורים בכלל למבחן האמיתי. כביכול היינו אמורים לעבור על ההגשות שעשינו בשביל ללמוד אליו, אבל להסתמך על הגשה מחורטטת בשביל להתכונן למבחן.... מתכון לאסון.\nכאילו שחסר להם על מה לבחון אז הם תוקעים שרטוט של קומה בקנ''מ כאילו זה מידע גרפי הנדסי- החומר קדם לקורס הזה הוא בטון 1,2 ועוד...\n\nהפרויקט:\nסתם חופר, שורף מלא שעות ולא מלמד כלום. לא הובהר כמו שצריך מהם הקריטריונים שהולכים לשפוט עליהם, מסכנות הקבוצות שבנו תקרה עבה חלולה ובסוף פסלו להם על שקיעות (חוסר תקשורת ובהירות, מוטיב חוזר!)\nמה שכן בונוס 5 נקודות לציון הסופי לקבוצה המנצחת היה נחמד.\n\nהשורה התחתונה: \nקורס של 5 נק''ז שמתחפש ל-3 נק''ז.\n50% מגן, 50% מבחן, ממוצע 75 (וגם זה בחסד גדול!) תבינו לבד....\nבסמסטר של פלדה ודינמיקה, זה היה הקורס הכי מעיק בפער.", "timestamp": 1704916153123}]}