{"posts": [{"author": "OC", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: מחמוד ג'בארין\nחוות דעת - הרצאות: \nמעניין, מסביר טוב\n\nשם המתרגל/ת: ניר יצחק בן ישראל\nחוות דעת - תרגולים: \nמתרגל מעולה אבל לפעמים לא חד מספיק על החומר ומטעה את הסטודנטים\n\nשעורי הבית: \nדי עמוס\n\nהמבחן: \nקשה, צריך ללמוד מינימום 5 ימים מלאים\n\nהשורה התחתונה: קורס חובה למבנים אז אין פה הרבה להתלבט", "timestamp": 1601110640184}, {"author": "אסף טנגיר", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: מחמוד גברין-מרצה טוב\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nחשוב!\nהמבחן: \nמבחן קשה\nהשורה התחתונה: חייבים להשקיע.", "timestamp": 1615213286563}, {"author": "ANON", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרופסור ג'בארין מחמוד\nחוות דעת - הרצאות: מעניין מאוד! היכרות עם מודלים פיזיקליים וחשיפה ראשונה להתנהגויות מבניות חדשות (פלטות, מאמצי טבלה, מאמצים ממברניים, מבוא לפעולה מרחבית). קצרה היריעה מלהרחיב בחשיבות הקורס ובדגש על הבנת ההנחות בבסיס כל פיתוח - כדי להשתמש בכלי עבודה צריך לדעת מתי רלוונטי ועוד יותר מתי איננו (עלול להיות אף מסוכן).\n\nשם המתרגל/ת: ניר\nחוות דעת - תרגולים: מתרגל מצויין ובעל גישה טובה ונעימה - יכולות הוראה גבוהות. מחכה לסמסטר הבא איתו בפלדה.\n\nשעורי הבית: ברמת הקורס (לא דורשים מעל שעה-שעתיים בשבוע).\n\nהמבחן: ברמת הקורס, גישה טכנית תספק 70. כל ציון מעל דורש הבנה וכמובן השתתפות פעילה בקורס ובפרט בהרצאות.\n\nהשורה התחתונה: הקורס הכי שווה שלמדתי עד לנקודת זמן זו.", "timestamp": 1647284211601}, {"author": "---", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: חשובות ומעניינות. די עמוסות ואינטנסיביות. \n\nשם המתרגל/ת: ניר בן ישראל\nחוות דעת - תרגולים: מתרגל ממש טוב. יודע להסביר את החומר מעולה ועוזר במה שצריך.\n\nשעורי הבית: די מקיפים את כל החומר הנלמד. שיעורי בית ממש שאלות ממבחנים ככה שזה גם חזרה טובה וגם הכנה טובה כשמתכוננים למבחן.\n\nהמבחן: לא פשוט בכלל, תמיד יש קאץ' אבל בגדול בעיניי די פייר.\n\nהשורה התחתונה: קורס עמוס אבל מעניין וחשוב מאד.", "timestamp": 1647878483616}, {"author": "prital margi", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מחמוד ג'אברין\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: לידור יוסף\nחוות דעת - תרגולים: מתרגל נהדר, בודק את השיעורי בית בצורה טיפה קשוחה אבל רואים שהוא רוצה שנצליח ונבין. \n\nשעורי הבית: יש 12 שיעורי בית להגשה, לקחו לי הרבה זמן\n\nהמבחן: מועד א' היה הוגן לגמרי, מועד ב' היה קשה מאוד ומועד ג' היה לא פתיר. אולי למחמוד יש נטייה לעשות מועדי א' קלים יותר...\n\nהשורה התחתונה: קורס קשוח, דורש הבנה מעמיקה תוך כדי הסמסטר, אי אפשר ללמוד אותו רק בתקופת מבחנים. יש סיכומי קורס בדרייבים כך שאין צורך לסכם.", "timestamp": 1649510914640}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מחמוד ג'בארין\nחוות דעת - הרצאות: מעניינות וחשובות.\n\nשם המתרגל/ת: חנין\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה מאוד טוב ומסדרת את החומר בראש\n\nשעורי הבית: כל שבוע. שאלות ממבחני עבר. להשקיע בהם ולנסות לפתור לבד, יעזור לקראת המבחן\n\nהמבחן: לא קל, עמוס. צריך ללמוד היטב ולהבין את החומר בצורה מעמיקה כדי לעבור ולהשיג ציון טוב.\n\nהשורה התחתונה: להשקיע במהלך הסמסטר ולהיות במעקב!", "timestamp": 1677843116022}, {"author": "I AM GROOT", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניינות מאוד\n\nשם המתרגל/ת: ניר\nחוות דעת - תרגולים: חבל שהוא לרוב מקריא את כל החישובים ממצגת. לא קיבלנו הזדמנות לנסות לחשוב ולפתור ביחד, רק הקראה \\ כמה שאלות קטנות שמופנות אלינו.\nהיו כמה סטודנטים בודדים שידעו בפער יותר מהשאר וניר רץ איתם בלי לוודא ששאר הכיתה מבינה.\n\nשעורי הבית: קשים אבל חשובים\n\nהמבחן: קשה בלי פרופורציה לחיים\n\nהשורה התחתונה: לדעתי היה פחות קשה לעבור את הקורס הזה עם ציון סביר אם התרגולים היו מכינים אותנו יותר לחשוב לבד", "timestamp": 1679304424962}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: משעממות, כמעט על גבול המיותרות אבל מחמוד מכניס למבחנים שאלת מרצה (עם משקל מופחת) שהיא לפתח משהוא שהוא עשה בהרצאה.\n\nשם המתרגל/ת: חנין\nחוות דעת - תרגולים: המתרגלת הכי טובה שפגשתי בטכניון עד היום, אין צורך להרחיב.\n\nשעורי הבית: שאלות ממבחנים (עם טיפה שינויים).\n\nהמבחן: צריך הרבה זמן ללמוד אליו, צריך לדעת לנהל זמנים במבחן עצמו (יש לחץ), אתם תראו במבחנים שאלות שאפילו לאחר מעבר על התרגול המתאים לא תבינו איך לפתור אותם.\n\nהשורה התחתונה: נוכחות חובה עם רשימת שמות במעבדות ובתרגולים, מעבר לזה אתם גם מסלול מבנים אז אין לכם ברירה, בהצלחה.", "timestamp": 1682427718743}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: \nבהרצאות הוא מפתח המון תיאוריה שנדרשת אחר כך לא פעם לפתח במבחנים. \nשם המתרגל/ת: ניר\nחוות דעת - תרגולים: \nתרגולים בסדר סה\"כ ומובנים. אפשר על בסיסם להבין את החלק הטכני של הקורס יחסית טוב. \nשעורי הבית: \nיש גליונות רגילים של לפתור תרגילים שדומים לתרגולים והתחילו לעשות מטלות בית שדורשות למדל ברביט ולחלץ מישם נתונים. השיעורים קצת ארוכים בהתחלה עד שמתרגלים לעבוד ברביט אבל מהווים אחלה התנסות מעשית במידול ממוחשב. את הגליונות לא בודקים ברחמנות מידי אז אל תזלזלו בהגשות.\nהמבחן: \nבגלל שמחמוד מעביר את הקורס מלא שנים המבחנים שלו מתחילים לחזור על עצמם, בעיקר בחלקים הטכניים. מי שלומד רק את החלקים הטכניים כמו בתרגול יכול להבטיח לעצמו בערך 70-75 נקודות מהמבחן. אצלנו במועד א' היה ממוצע גבוה באופן יחסי למה \"שנהוג\" אז כדאי כן ללמוד למבחנים הבאים מאוד ברצינות.\nהשורה התחתונה: \nקורס חשוב שמהווה קפיצה גדולה בהבנה של תכן מבני בטון. רובו טכני מאוד ואפשר לעבור אותו ובשביל להצטיין צריך להבין את ההרצאות.", "timestamp": 1715365430861}]}