{"posts": [{"author": "אלעד ויצמן", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: נורית תרגולים מוקלטים\nחוות דעת - תרגולים: מתרגלת מצויינת. הכל מוקלט. תענוג.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613549352731}, {"author": "י", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ווידאו\nחוות דעת - תרגולים: המתרגלת בווידאו די טובה, מסבירה היטב את הרוב, אפשר גם ללכת למתרגלת ענבל שהיא ממש אחלה ומסבירה 1 על 1 אם צריך\n\nשעורי הבית: \n4 גיליוניות, רב התרגילים הם ממבחני עבר שפתרונם במודל\nהמבחן: \nעקב תקלות זום/קורונה היה לנו 3/4 שאלות לענות, הציונים גבוהים בהתאם. השאלות שיקפו בצורה הוגנת את החומר הנלמד\nהשורה התחתונה:", "timestamp": 1614497924629}, {"author": "אלעד ויצמן", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: תראואת התרגולים המוקלטים מ 2017", "timestamp": 1616579906705}, {"author": "מאיה", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ענבל\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: 4 תרגילי בית לא כבדים, עוברים על מה שנלמד בתרגולים.\n\nהמבחן:4 שאלות מתחומים שונים, קצת עמוס.\n\nהשורה התחתונה: קורס מאוד מעניין שיכול לעזור בעתיד, לא עמוס מאוד אבל כן צריך ללמוד כמו שצריך למבחן", "timestamp": 1644419304370}, {"author": "prital margi", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רפי לינקר\nחוות דעת - הרצאות: לא צפיתי בשום הרצאה.\n\nשם המתרגל/ת: ענבל גליקמן (צפיתי במוקלט)\nחוות דעת - תרגולים: מעולים, ענבל מתרגלת נהדרת.\n\nשעורי הבית: יש 4 עבודות להגשה ופרוייקטון בסוף הסמסטר, חשוב ממש לעשות אותם כי הם תורמים מאוד להבנה של הקורס.\n\nהמבחן: טיפה קשוח יותר ממה שציפיתי אבל אם עשיתם את השיעורי בית, הפרוייקטון והבחן אמצע (מומלץ מאוד) אז אמור להיות לכם מגן מפחיד של 45% שמקפיץ את ציון המבחן.\n\nהשורה התחתונה: נהנתי מאוד ללמוד את החומר, דורש הבנה של איך הדברים עובדים.", "timestamp": 1649511701905}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רפי לינקר\nחוות דעת - הרצאות: מרצה גרוע. לא צריך לראות הרצאות בקורס בכלל. אם רוצים יש מוקלט של שלמה בכור והוא עדיף בהרבה.\n\nשם המתרגל/ת: ענבל\nחוות דעת - תרגולים: מתרגלת מעולה! גם המתרגלת במוקלט טובה, זה לא משנה למי משתיהן הולכים.\n\nשעורי הבית: לא קשים, קצת ארוכים.\n\nהמבחן: עם למידה טובה אפשר להוציא ציון גבוה מאוד. מבחן טכני מאוד ודי חוזר על עצמו ויש הרבה פתרונות במודל למבחני עבר אז אפשר לדעת איך יראה המבחן.\n\nהשורה התחתונה: קורס טכני, לא צריך לראות הרצאות, להשקיע טוב בתרגולים ובתרגילי בית אפשר להוציא בו ציון מעולה.", "timestamp": 1654340916295}, {"author": "HH", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  רפאל לינקר\n\nשם המתרגל/ת:  ענבל גליקמן \nחוות דעת - תרגולים:  המתרגלת מקסימה \nהשורה התחתונה: החומר לגמרי סבבה ואפשר להתמודד איתו,כיפי והתרגולים של ענבל עם הסברים מאוד ברורים ושיטות לפתרון כל סוג שאלה ( ההרצאות לא באמת תורמות להבנת החומר לפי דעתי ), 4 תגילי בית חלק קלילים וחלק קצת פחות בוחן אפשר להוציא ציון ממש טוב , עם חומר סגור רק 5 השבועות הראשונים של הסמסטר ( הכי קלים) , פרויקטון סביר לפי דעתי  אבל הוא בחודש האחרון לפני תקופת המבחנים אז בתקופה עמוסה לכן תעשו במוקדם האפשרי , מה שכן צריך לתרגל הרבה ולפתור כמה שיותר מבחנים מהשנים האחרונות כדי להיחשף לכמה שיותר רעיונות ( עם כל זאת המרצה שוב יביא מבחנים עם רעיונות חדשים חחחח ) תהיו מוכנים לזאת , המבחן הוא עם חומר פתוח מודפס , שימו לב לעניין של הזמן , הזמן מאוד לחוץ אם תתחילו לחפש כל משהו קטן בחומר  \nשיהיה בהצלחה לכולנו", "timestamp": 1674996057233}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רפי לינקר\nחוות דעת - הרצאות: כל ההרצאות מוקלטות באופן מאוד מסודר, יש דף שמקשר בין ההטלטות לההרצאות. ההרצאות ללא ממש מובנים או תורמים לידע במקצוע.\n\nשם המתרגל/ת: ענבל\nחוות דעת - תרגולים: מוקלטים גם כן. כל החומר לקורס הוא מהתרגולים.\n\nשעורי הבית: 4 במהלך הסמסטר ופרויקט. כולם ברמה של מבחן, אבל מרווחים מאוד.\n\nהמבחן: פייר וממש תואם לחומר\n\nהשורה התחתונה: בסוף קורס אופטימיזציה, מעניין אבל מוצג באופן די לא טוב.", "timestamp": 1676377685703}, {"author": "I AM GROOT", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רפי\nחוות דעת - הרצאות: בזבוז זמן\n\nשם המתרגל/ת: אביעוז\nחוות דעת - תרגולים: תמיד בודק שכולם מבינים מה עושים ומה ההגיון מאחורה. אווירה מצויינת בכיתה. לגמרי קיבלתי ציון מעולה בזכות אביעוז.\n\nשעורי הבית: בהתחלה לא פשוט אבל אחרי שמבינים את הקטע כבר בסדר. שווה לא לוותר על אף תרגיל בית כי יש לכל אחד מהם מרכיב גדול בסופי\n\nהמבחן: נכנס לקטנות בשביל להכשיל אז שווה להבין מעט ממה שקורה מאחורי הטכניקה\n\nהשורה התחתונה: לא קשה מדי", "timestamp": 1679305151641}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רפי לינקר\nחוות דעת - הרצאות: עשיתי הכל מהמוקלט, שהוא נורא מסודר. קשה מאוד להבין מה רוצים ממך בהרצאות, לא מועברים בצורה טובה. יש יותר מדי היצמדות למתמטיקה טהורה ופחות מדי הסברים\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: המתרגלת במוקלט מעולה, מסבירה הכל טוב. הדרך היחיד לעבור את הקורס.\n\nשעורי הבית: 4 שיעורי בית גדולים ופרויקט שהם תקפים. די קשים.\n\nהמבחן: הוגן מאוד, אם מתכוננים על מבחנים ישנים לא אמור להיות בעיה.\n\nהשורה התחתונה: בתכלס זה קורס אופטימיזציה. חומר מעניין יחסית, הרבה מטמתיקה להגיד דברים פשוטים.", "timestamp": 1679330146999}, {"author": "מ", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלמה\nחוות דעת - הרצאות: לא הלכתי להרצאות \n\nשם המתרגל/ת: ענבל\nחוות דעת - תרגולים: מתרגלת מעולה אין עליה עוזרת מאוד ומסבירה הכל בצורה טובה ,מאוד חמודה\n\nשעורי הבית: היה 4 תרגילי בית ופרוייקטון בסוף, יש רפרנס לשיעורי בית אבל אני ממליצה לנסות לפתור לבד כי מאוד מאוד עוזרות בהבנת החומר והתכוננות למבחן\n\nהמבחן: היה הוגן, מי שתרגל החומר ופתר מבחנים קודמים היה קל לו להוציא 90 ,יש הרבה מבחנים עם פתרון שיכולים לתרגל אותם לפני מבחן אם תתרגלו הרבה תראו ששלמה חוזר על עצמו והשאלות באותו הסגנון\n\nהשורה התחתונה: המפתח לקבלת ציון גבוה הוא תרגול החומר!", "timestamp": 1690618771763}, {"author": "נחמד", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רפי\nחוות דעת - הרצאות: לא הייתי, אין צורך\n\nשם המתרגל/ת: ענבל שילוב פרונטלי ומוקלט\nחוות דעת - תרגולים: מצוינת\n\nשעורי הבית: בגלל המלחמה היה תרגיל אחד והפרויקט, לדעתי לא מספיק ע\"מ לתרגל את החומר... מגיעים לקראת המבחן בלי ניסיון בפועל בגישה לתרגילים ופתרון שלהם. להבנתי בסמסטר רגיל יש תרגילים כל שבועיים וניתן לרפרנס\n\nהמבחן: חומר פתוח, מלחיצים שיהיה קשה בגלל זה ולא ממש ברור למה, להכניס תרגולים פתורים, דף נוסחאות ו-4-6 מבחנים שפתרת בלמידה למבחן ואת/ה מסודר/ת\n\nהשורה התחתונה: אחלה סה\"כ", "timestamp": 1716392123626}]}