{"posts": [{"author": "Yarden", "difficultyRank": 2, "generalRank": 5, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: לא חובה להגיע להרצאות, 15 נקודות במבחן הם על החומר מההרצאות אבל.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לראות רק את המוקלטים, מצויינים ומכסים הכל\n\nשעורי הבית:  3 מעט ארוכים \n\nהמבחן: לא קשה, אבל ארוך, קשה לסיים בזמן למרות הרמה הבינונית\n\nהשורה התחתונה: קורס קליל מתנה, כדאי מאוד לקחת את הבוחן אמצע שהוא מגן. המעבדות קלות אפשר לרפרנס ולפעמים יש קאוט שנותן בונוס למבחן", "timestamp": 1598181560483}, {"author": "Ran Eckl", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שגיא\nחוות דעת - הרצאות: מעביר את ההרצאות בצורה טובה בסך הכול. המצגות נורא מפורטות.\n\nחוות דעת - תרגולים: לראות את המוקלטים. תרגולים מצוינים וממוקדים שמלמדים תכל'ס לפתור תרגילים ברמה שנדרשת.\n\nשעורי הבית: ארוכים קצת, אבל יש רק 3 כאלה אז זה ממש לא נורא. שווה להשקיע בשביל המגן.\n\nהמבחן: הוגן מאוד. היה קצת לחץ של זמן אבל בסך הכול המבחן ברמה שנלמדה ואפשר להוציא ציונים גבוהים מאוד בקורס.\n\nהשורה התחתונה: קורס ממש ממש אחלה. ציונים גבוהים. יש גם בחני קאהוט שאפשר לקבל בהם עד 5 נק. בונוס לציון הסופי.", "timestamp": 1615546683182}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: שגיא דליות\nחוות דעת - הרצאות: הרצאות אחלה. מעניינות וקלילות. ברובם מיותרות לחלוטין, יש גם כמה הרצאות אורח מיותרות אבל מעניינות. אפשר היה להוריד את ההרצאות לשעה אחת כל שבועיים בקלות.\n\nשם המתרגל/ת: רובא גלגולה\nחוות דעת - תרגולים: מאוד מונוטונית. הכל כתוב לפני והיא בגדול די מקראיה. לא מומלצת. מה שכן- תרגולים זה איפה שרוב הקורס נלמד בפועל.\n\nשעורי הבית: 3 בסמסטר. ארוכים וקצת מעצבנים אבל דומים מאוד למבחן.\n\nהמבחן: מעיק מאוד. דרוש לעשות חשבונות לדיוק של 7 ספרות עשרוניות ולהראות כל חישוב וכל השלבים שבהם. על כל טעות מורידים ניקוד, וכנ\"ל אם שחכת לרשום יחידות. עצם החומר קל, אבל השטויות מסביב מאוד מאוד מייגעים.\n\nהשורה התחתונה: קורס שמלמד יותר שיטות עבר מאשר עתידף בעוד עשור בכלל לא יהיה רלוונטי. הצצה טובה לעולם של מדידיה.", "timestamp": 1628847519358}, {"author": "Ameer Arraf", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: סגיא\nחוות דעת - הרצאות: לא הייתי נוכח כך כך\n\nשם המתרגל/ת: רובא וגריר\nחוות דעת - תרגולים: מן המתרגילים הטובים ביותר בלמדו אותי\n\nשעורי הבית: \n\nהמבחן: תיקון המבחן מאוד קפדני\n\nהשורה התחתונה: קורס מהנה ולא קשה", "timestamp": 1646564698476}, {"author": "E(X)", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלמוג \nחוות דעת - הרצאות: אפשר לא ללכת\n\nשם המתרגל/ת: גריר + רובא\nחוות דעת - תרגולים: שני מתרגלים מוכשרים,טובים ונחמדים\n\nשעורי הבית: \n3 ש\"ב , כדאי לתרגל , עוזרים להבנת הקורס ולתרגל אותו\n\nהמבחן: \nהסיפור מתחיל מהשאלה מ\"ס 1 שהיא גם קשה וגם ארוכה ,המבחן ידוע שהוא לחוץ בזמן והם לא התחשבו בכך,שאלה מ\"ס 2 מאוד מוזרה ולא נתקלנו אף פעם במשהוא שדומה לה , ביקשו לחשב זמן מחזור של לייזר ודברים שאף פעם לא נתקלנו וגם לא תרגלנו,שאלה 3 ,לרוב לא ראו אותה מחוסר הזמן , היא גם ארוכה ומסובכת עם דף שלם של הוראות , אני די בטוחה שגריר מי שכתב את השאלה - שאלות גריר במבחנים לא נחמדים בכלל-\nהמרצה הוסיף רבע שעה לבחינה לכולם ובכל זת אף אחד לא הספיק,נקווה שיהי פאקטור.\n\n++ המגן היה עבודת בית שמורכבת מ 3 שאלות דומות למה שהמרצה מסביר בהרצאות+++  קל להוציא ציונים טובים\n\nהמרצה החליט להתחשב בציון הגבוה מבין שני המועדים\n\nהשורה התחתונה: קורס מעניין יפה ונותן ידע על עולם המיפוי ומעניק שפה משותפת בין המהנדסים בשטח, חשוב לסטודנטים במסלול הגיאואנפורמציה ופחות רלוונטי למבנים ותחבורה\nאפשר להוציא ציונם בתנאי שיש לכם תוספת זמן", "timestamp": 1659013650104}, {"author": "...", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלמוג\nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  ג'ריר ורובא\nחוות דעת - תרגולים: המתרגילים הכי נעימים ותוחים שיש\nדואגים לסטודנטים\n\nהמבחן: מועד א היה הזייה, נתן פקטור של יותר מ25 נק'\nמבחן ארוך\n\nהשורה התחתונה: קורס מעניין, מבחן מהווה 50% \nתשקיעו בעבודות בית, מעבדות ודוחות\nהייתה עבודת נגן של 20% \nניתן להוציא 80+ אם משקיעים במהלך הסמסטר", "timestamp": 1663234552869}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  אופיר אלמוג\nחוות דעת - הרצאות: מרצה לא משהו בכלל. אין סיבה להגיע להרצאות. הוא נתן מטלת בונוס בתחילת סמסטר של קריאת ספרים. בסוף כל ספר צריך להגיש לו עמוד של עקרונות הנדסיים מהספר, ומקבלים נקודה בציון הסופי על כל ספר.\n\nשם המתרגל/ת: אביב כהן\nחוות דעת - תרגולים: מתרגל לא טוב בכלל. לא כריזמטי, לא מעניין, לא מצליח להעביר את החומר טוב, נתקע כששואלים אותו שאלות... מומלץ ביותר לראות תרגולים בפנופטו!\n\nשעורי הבית: יש 3 מטלות שהן טיפה ארוכות אבל קל לקבל עליהן ציונים טובים אז שווה להשקיע\n\nהמבחן: ארוך, מסורבל, קשה ולא הוגן. הסגנון של אופיר שונה מהסגנון של המועדים האחרים. כמעט תמיד יש ממוצע מאד נמוך והוא נותן פקטור מטורף אז לא להרגיש בבאסה אם הלך גרוע במבחן, כי כנראה שזה ככה לכולם ותקבלו פקטור.\n\nהשורה התחתונה: יש המון מגן בקורס הזה- ש.ב, מטלות, מעבדות, בוחן אמצע... המבחן היה רק 50 אחוז מהציון הסופי. אז שווה מאד להשקיע במגן לאורך הסמסטר.", "timestamp": 1678645587564}, {"author": "מרצה חדש", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אופיר\nחוות דעת - הרצאות: מרצה חדש, מרצה חוץ, בונה מבחנים מאוד עמוסים ושני הסמסטרים האחרונים גם כולם קיבלו פקטור....\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש וארוכים, יש גם מעבדות\n\nהמבחן: מבחן היה עם חומר פתוח, היה עמוס בטירוף וכולם קיבלו הארכה  בזמן של 15 דק׳. ועדיין מעטים מאוד סיימו את המבחן. \n\nהשורה התחתונה: עמוס ומצריך המון השקעה לאורך הסמסטר.", "timestamp": 1678789839590}, {"author": "michael", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nעם חומר פתוח , אין מספיק זמן לפתור את המבחן אז ממליץ ללכת על שאלות ארוכות עם כמה שיותר נקודות ב2 סמסטרים קודמים המרצה נתן פקטור בכל המועדים כי הוא עדיין לא יודע לבנות מבחן נורמלי שמספיק בזמן ובקושי שנלמד בקורס. \nהשורה התחתונה:", "timestamp": 1681806105622}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אופיר\nחוות דעת - הרצאות: \nזוועה, ברמה נמוכה.\nהמרצה מתחיל כל הרצאה בסבב שמות (?!) ומעביר ככה את הזמן. אחרי זה הוא מקריא את המצגת לאט לאט בכל מונוטוני, דווקא באזורים החישובים הוא רץ ואומר שזה קל ולא פותר עד הסוף. יש איזה 8 הרצאות שבקושי אנשים באים. הוא מחלק בונוסים על קריאת ספרים ומעביר דפי נוכחות מידי פעם..\nשם המתרגל/ת: ג'ריר\nחוות דעת - תרגולים: \nתרגולים סבבה, היה גם אחראי מעבדה. באמצע הסמסטר אכל עלינו סיבוב ונכנס בנו במעבדות, לא עשה שעות קבלה מסודרות ובעיקר היה לא נחמד.\nשעורי הבית: \nיש איזה 3 גליונות, כולם לקראת המבחנים ככה שלא מתרגלים בכלל את החומר במהלך הסמסטר. כמו כן, הם דורשים דף תשובות סופי כדי להקל על עצמם בבדיקה.\nהמבחן: \nבזיוני, המרצה מגזים בעבודת נמלים ועבודת מחשבון, לא מרגיש לי שהמבחן בודק את הידע שלי אלא יותר את יכולות הריכוז והקלדה שלנו. הבזיון ממשיך בזה שהם לא יודעים לכתוב מבחן טוב אז הם גילו גימיק חדש- לגלות את כלהשאלות במבחן לפני אן לתת פאקטורים מפחידים. \nהשורה התחתונה: \nקורס בזיוני שלא לומדים בו כלום למי שלא במסלול מיפוי ובעיקר יוצר אנטגוניזם למקצוע עקב סגל לא מתפקד, נקמן וזחוח.", "timestamp": 1688661025927}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אופיר\n\nחוות דעת - הרצאות: \nאופיר ממש אחלה - עדיין לא יודע לבנות מבחנים אבל לומד לאט לאט.\nאין מה להגיע להרצאות חוץ מזה ששווה שיכיר אתכם.\n\nשם המתרגל/ת: \n\nחוות דעת - תרגולים: \nרק מהפנופטו !\nמעבדות - לברוח מאורן !\n\nשעורי הבית: \nמטלות - סבבה \nדוחות -סיוט \n\nהמבחן: \nסביר - אין אף פעם אומדן נכון של כמה זמן הוא אמור לקחת באמת לבין כמה זמן מקבלים \n\nהשורה התחתונה: לא צריך יותר מידי כדי לקבל ציון גבוהה", "timestamp": 1689499748655}, {"author": "מאזנת", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אופיר\nחוות דעת - הרצאות: אופיר בן אדם מדהים, קצת מרגיש כמו חזרה לתיחון, השעות של ההרצאות שלו קשות, אבל שווה להגיה, מסביר מצויין את החומר ונותן תיפים למבחן\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: מדהימה \n\nמעבדות: ארוכות ומיותרות, חוסר מקצועיות של מדריכים פוגעים בחשק ברצון וביכולת להבין מה רוצים ממך\nלא ברור מה רוצים בדוחות ואיך לעבוד עם התכנות השונוט\nשעורי הבית: יחסית הרוכים \n\nהמבחן: לא קשה בחלל, להגיה להרצאות להבין מה אופיר אוהב לישול ולהבין את הראש שלו\n\nהשורה התחתונה:\nקורס מיותר למי שלא צריך אותו והוא מבזבז זימן", "timestamp": 1716367632665}]}