{"posts": [{"author": "Nate", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: שחף מרדכי\nחוות דעת - הרצאות: הרצאות יחסית משעממות ונמרחות. לפעמים כן יש דברים מעניינים. לפחות 20 נקודות מהמבחן זה דברים שנלמדים רק בהרצאות! חשוב לדעת את זה ולהקשיב. למרצה אכפת מאוד מהלימוד והוא משקיע.\n\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: התרגולים קריטיים להצלחה בקורס. חשוב לעבוד ביחד עם המתרגל ולשאול כל מה שלא מבינים. בסוף הקורס מגישים את הפרויקט שעובדים עליו בתרגולים (בחצי השני של הקורס), ולכן חשוב מאוד לעבוד עם המתרגלים ביחד.\nבחלק השני של הרוויט יש גם תרגולים מוקלטים- מומלץ מאוד לרשום כל דבר שמוסבר בהקלטות של איך עושים דברים, יעזור מאוד בפרויקט סיום.\n\nשעורי הבית: עמוסים מאוד בעיקר בחצי הראשון של הקורס. לוקחים מלא שעות. מייגעים. בחלק השני יותר נחמדים.\n\nהמבחן: לפני המבחן צריך להכין פרויקט ברוויט מאפס שלוקח מלא זמן. שואלים עליו במבחן ולכן חשוב לסמן מידה של כל דבר. במבחן לא היה מספיק זמן לשרטט והרבה הספיקו בקושי סעיף. בסוף 'התחשבו' ועשו בדיקה מקילה.\n\nהשורה התחתונה: קורס נחמד ומהנה למי שמתחבר. דורש ראיה מרחבית.", "timestamp": 1611740103617}, {"author": "דותן בארי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות: מאוד קלילות, מהרצאה 5-6 פחות רלוונטי לגמרי.\n\nשם המתרגל/ת: מוחמד זידאן\nחוות דעת - תרגולים: מעולה, מסביר טוב, מתחשב.\n\nשעורי הבית: ה-5 הראשונים טיפה עמוסים וארוכים, השאר בסדר.\nחשוב לעשות אותם מוקדם כי אמנם אין הרבה עבודות אבל כל אחת לוקחת לא מעט זמן.\n\nהמבחן: לא קשה מדי, קצת חסר זמן.\n\nהשורה התחתונה: אחלה קורס, מעניין, מאוד רלוונטי מבחינת המקצוע!", "timestamp": 1613411885527}, {"author": "shsh", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: חריפה מאודד, צריך להגיד שהיא בונה גם חלק מהמבחן והיא לא פראיירית בכלל...\n\nשעורי הבית: כל שבועיים, בסך הכל לא מאוד קשים, פשוט לוקחים המון זמן\n\nהמבחן: המבחן בדרכ בתחילת תקופת המבחנים כשהלחץ מתחיל, כדאי לקחת 3 4 ימים לפני ופשוט לרוץ על כל החומר אינטנסיבי ולהקיא הכל במבחן.\n\nהשורה התחתונה: מרדכי מקסים אבל באמת כדאי לראות את כל ההקלטות ברטרו לפני המבחן ולהיכנס רק לתרגולים במהלך הסמסטר. כל השיעורי בית מבוססים עליהם.", "timestamp": 1613585160665}, {"author": "אסף מן", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: מרדכי שחף\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  מוחמד זידאן\nשעורי הבית: 4  הגשות ראשונות מאוד עמוסות . מהתחלת עבודה ברוויט חשוב להיכנס לתרגולים כי שם בונים את הפרויקט האישי\n\nהמבחן: עמוס מאוד \n\nהשורה התחתונה:", "timestamp": 1614590210841}, {"author": "לירון לובל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות:  שימו לב שרוב החומר בהרצאות הוא חלק מהחומר למבחן גם אם לא נגעתם בזה כל הסמסטר!\n\nשם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: פשוט תותח.\n\nשעורי הבית: בחצי הראשון של הקורס- ארוכים מאוד ודורשים השקעה רבה.\nבחצי השני- די קלים ולא דורשים מאמץ רב ביחס למחצית הראשונה.\n\nהמבחן: לא קל בכלל, רוב האנשים לא יספיקו אפילו לסיים אותו.\n\nהשורה התחתונה: קורס מעט שונה, מאוד מלמד.", "timestamp": 1616436202122}, {"author": "א'", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nמרדכי שחף\nחוות דעת - הרצאות: \nהמרצה טוב, אך חלק גדול מההרצאות מרגיש לא רלוונטי.\nחוות דעת - תרגולים: \nיש חוסר התאמה באופן בו כל מתרגל מלמד את כללי השרטוט ואופן העבודה מול התוכנה.\nממליץ לוודא וללכת לפי ההנחיות של המתרגל האחראי.\nשעורי הבית: \nארוכים, אבל ממליץ מאוד לפתור הכל ולבד. השרטוטים מהווים חלק משמעותי מהמבחן.\nהמבחן: \nלא פשוט לסיים במסגרת הזמן, אבל אפשרי.\n(יש במבחן גם שאלות ידע מתוך ההרצאות).\nהשורה התחתונה: \nקורס מעניין ולא קשה אבל מצריך השקעה והרבה זמן.\nממליץ מאוד לתרגל כמה שיותר שרטוטים.", "timestamp": 1617701966050}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות:  \nמרדכי איש טוב מוסיף המון העשרה שקשורה לתחום של  העבודה בהנדסה אזרחית.\nרוב החומר בהרצאות חוזר על עצמו בתרגול, אך עדין ממליץ לראות. \n\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: עניינית ומעבירה את החומר בצורה טובה.\nלעשות את הפרוייקט האישי במהלך התרגולים.\nלעשות עבודות בית במקביל לסרטונים של מרדכי.\nשעורי הבית: ארוכים מאוד !\n\nהמבחן: \nהכי חשוב לדעת לצייר איזומטריה וחתך מהר ומדוייק.\nלא קשה\nהשורה התחתונה:", "timestamp": 1625818586828}, {"author": "noam nissim", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מרדכי שפירא\nחוות דעת - הרצאות: \nמרצה מעולה וגבר על, ההרצאות מעניינות ממש אבל לא כלכך רלוונויות למבחן\nשם המתרגל/ת: טניה בלוך\nחוות דעת - תרגולים: \nמתרגלת מעולה! מסבירה טוב תמיד, ויודעת להעביר את החומר גם בזום.\nהתרגולים הם הדבר הכי חשוב בקורס\nשעורי הבית: \nמעיקים ארוכים ולא פורפוצינאלים לנק\"ז בכלל.\nכל הגשה בהתחלה ארוכה מהשנייה.\nהמבחן: \nמבחן קל אם עשית שיעורי בית, אבל לחוץ בזמנים\nהשורה התחתונה: \nקורס קל יחסית אבל דורש כמות זמן כמו קורס כבד מאוד", "timestamp": 1625835417650}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות: מרצה תותח-על שמשקיע הרבה בהרצאות ומרגישים את זה. הרצאות מרתקות וחומר מעניין וחשוב\n\nשם המתרגל/ת: טניה בלוך\nחוות דעת - תרגולים: טובים ממש, עוזרים להבין את החומר.\n\nשעורי הבית: קשים וארוכים ולפעמים בלתי מצאתיים. \n\nהמבחן: אי אפשר לקבל 100, מורידים נקודות על כל דבר הכי קטן שלא מושלם. לחוץ מאוווווד מבחינת זמן. לא תואם למה שהתמקדו במהלך הסמסטר ובוודאי לא מה שחשוב בקורס.\n\nהשורה התחתונה: קורס נורא מהנה ומומלץ, אך תדעו מראש שהציון לא יהיה משו.", "timestamp": 1626935307714}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות: מרצה אדיר, כיף בהרצאות והפואנטה מועברת בצורה משעשעת לסטודנטים.\n\nשם המתרגל/ת: אורי נסים\nחוות דעת - תרגולים: מעולה, קשוב.\n\nשעורי הבית: חצי הראשון של הקורס - מעצבנים ולוקחים זמן.. אפשר לרוץ לרפרנס למרות שלא כדאי.\nחצי שני ריוויט היה משהו.. ממש כיף אבל לוקח המון זמן, ממש כדאי להיעזר בשעות הקבלה עם המתרגלים + חונכים.\n\nהמבחן: סביר \n\nהשורה התחתונה: קורס קליל וכיפי, הרצאות שממש חיכיתי להן כל שבוע, ניתן להוציא ציון ממש טוב די בקלות אם משקיעים בשב.", "timestamp": 1632239036988}, {"author": "לב פודביצקי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות:\nחשובות ומעניינות. לא להקשיב לשטויות שאומרים לא להגיע כי בהרצאות מעבירים המון מידע שמופיע במבחן.\n\nשם המתרגל/ת: אורי ניסים\nחוות דעת - תרגולים: \nמדהים!! מתרגל קשוב ואכפתי שנותן את הנשמה.\n\nשעורי הבית: \nקשים וארוכים. חשוב מאוד להשקיע כי במבחן נדרשים לשרטט בלחץ של זמן וחשוב לתרגל את הטכניקה.\n\nהמבחן: \nהמבחן עמוס מאוד וחשוב לדעת לנהל את הזמן כמו שצריך. המתרגלים לא \"שוחטים\" על טעויות אז אפשר להוציא ציונים טובים.\n\nהשורה התחתונה: \nקורס חשוב מאוד עם שיעורי בית לא פשוטים.", "timestamp": 1644687632854}, {"author": "מידע גרפי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות: לדעתי המון מידע מיותר שאפשר להסביר ב-5 דקות, אבל מה לעשות בסוף זה כן חוזר במבחן\n\nשם המתרגל/ת: מוחמד זידאן\nחוות דעת - תרגולים: מדבר מאוד נעים, מאוד סבלני ורגוע, היה ממש נחמד לבוא לתרגולים.\nבלי קשר, ממש ממש כדאי להגיע לתרגולים, יש מידע שאין בהרצאות אבל זה במיוחד חשוב כדי לתרגל (מתרגלים תוך כדי תרגול)\n\nשעורי הבית: \nש''ב 4 לקח לי איזה 24 שעות, כל השאר חלק לוקחים המון זמן חלק פחות. לא קשים, אבל סוחטים זמן. החל משבוע 5 (רוויט) מומלץ לעשות ש''ב ביחד עם הסרטונים של מרדכי\n\nהמבחן: הוגן, הרבה שאלות קטנות, הרבה חלקים, אבל לא קשה. מומלץ להשקיע בש''ב וזה כבר רוב הנקודות\n\nהשורה התחתונה: אחלה קורס, הוא לקח הרבה יותר זמן מהשבוע משהייתי מוכנה לתת לו, אבל בסך הכל לא קורס קשה ומורגש שהסגל רוצה ללמד ולא להיתקע על שטויות. אחלה סגל. בסוף נהניתי :)", "timestamp": 1647705739102}, {"author": "פלוני", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מעניין רוב ההשקעה היא במהלך הסמסטר ובעיקר בחלק הראשון שלו", "timestamp": 1657217415153}, {"author": "…", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: לא השתתפתי \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: בששת התרגולים הראשונים: מסודרים והכל מובן בהם\nתרגולי הרוויח: ממש רעש ואי סדר במהלך התרגול- אפשר לוותר עליהם ולצפות בהקלטות המודל\n\nשעורי הבית: האיזומטריה מאוד קשה ולוקחת המווון זמן\nלהיעזר ברפרנסים\n\nהמבחן: הוגן\n\nהשורה התחתונה: לא השתתפתי בהרצאות ולקח לי לימוד למבחן שני יומיים\nהברוייקט הסופי לקח שלוש ימים ובס״כ קיבלתי ציון טוב", "timestamp": 1657908081298}, {"author": "adam shhady", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות: \nאחלה מרצה מעביר החומר בצורה ממש מעניינת ובהרצאות הוא מציג כמה פרויקטים שהוא עובד עליהם בזמן אמת \nשם המתרגל/ת: אבי\nחוות דעת - תרגולים: \nהוא ממש ברור בהסברים ומנסה להעביר את החומר בצורה הכי קלה להבנה \nשעורי הבית: \nארוכים קצת חלק מהתרגילים לוקח 5 שעות מינימום בלי תיקונים \nהמבחן: \nממש סביר וקל ופרויקט למבחן לקח לי 7 שעות רצופות בלי תיקונים\nהשורה התחתונה:", "timestamp": 1658149363835}, {"author": "Rafael", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מרדכי שחף\nחוות דעת - הרצאות: \nחלק מההרצאות מעניינות וחלק מרגישות מיותרות כי הוא מדבר בהן על המקצוע שלו בחיים האמיתיים. בסך הכל הוא מרצה מעולה שניכר שהוא אוהב את התחום בו הוא מתעסק, מעביר הרצאות בצורה איכותית ומכווין מה חשוב לקראת המבחן. \nבסה\"כ מרדכי מרצה מעולה ומשלב הומוא בהרצאות וזה גורם להיות קשוב אליו, וזה קורס חשוב בעיקר לחבר'ה של מסלול מבנים. \n\nשם המתרגל/ת: שי נחום\nחוות דעת - תרגולים: \nמתרגל ממש טוב וסבלני שעונה על כל השאלות, וגם זמין מאוד במייל ביחס למתרגלים בקורסים אחרים. לפעמים מסביר קצת מהר מדי אבל אין לו בעיה לחזור כמה פעמים שצריך על ההסבר כדי שכולם יבינו ולא יישארו עם שאלות. \n\nשעורי הבית: \nכדאי מאוד להשקיע ולעשות אותם לבד כי השאלות במבחן הם בקונספטים זהים. תרגילי בית 4-5 קריטיים להוצאת ציון גבוה בקורס כי לא מעט נקודות בבחינה הולכות לשאלות שעוסקות בנושאים האלה. \nתרגיל בית 4 ארוך ומייגע, אבל למרות זאת ממש לא מומלץ להעתיק מהרפרנס כי בסופו של דבר חייב לדעת לשרטט טוב ומהר במבחן. \nהחל משבוע 6 הקורס הופך להיות יותר כיפי כי עוברים לחוות המחשבים אבל גם שם חשוב להיות על החומר ולראות ולהבין את הסרטונים שמועלים למודל.\n\nהמבחן: \nהיה יותר קשה בכמה רמות מהמבחנים לדוגמה שמפרסמים במודל אבל לא משהו שמוגזם בטירוף. רק לקרוא דקויות בנתונים כאלה ואחרים כי זה יכול לבלבל לא מעט אנשים. \nהשורה התחתונה:\nקורס כיפי ומלמד מאוד, אבל דורש השקעה במהלך הסמסטר, אבל מי שמשקיע מרוויח.", "timestamp": 1675330850416}, {"author": "A", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות: \nההרצאות הן יום בחיי מרדכי \nהרצאות מצחיקות קלילות, דברים שנראים קצת חסרי חשיבות נמצאים בבחינה, בעיקר מאמצע הקורס הקשר לתרגולים כמעט ולא קיים\nאפשר להסתדר בלי אבל לא מצטער שהגעתי \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: \nאחלה תרגולים מאד תכלסי\n\n\nשעורי הבית: ארוכים פחד אבל 4ו-5 עוזרים מאד למבחן\nלקראת הסוף נהיה יותר מרווח \nהמבחן: \nלא מרגיש קשור ב100% למה שנלמד לתרגל מבחנים ישנים עוזר\nהשורה התחתונה: השקעה אדירה של זמן אבל בסוף רוב הציונים גבוהים להשקיע בפרויקט ושיעורי בית יש להם משקל גדול בציון", "timestamp": 1676036092522}, {"author": "Hanoch Egyes", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות: מעניין אבל הבן אדם מעופף\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: תרגיל כמעט כל שבוע, הראשונים קלים יחסית. יש עומס רציני בשבוע 4 ולקראת סוף הסמסטר\n\nהמבחן: על כל החומר מההרצאות והתרגולים\n\nהשורה התחתונה: מעניין, מלמד אבל העומס הלא רציף קצת מעצבן", "timestamp": 1676215488518}, {"author": "שם", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרדכי\nחוות דעת - הרצאות: \nהמרצה היחיד שמלמד תכלס את המקצוע\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: \nהיה מובן מאוד\nשעורי הבית: \nלא קשים אבל ארוכים מאוד\nהמבחן: \nהוגן. שווה להגיע להרצאה האחרונה הוא פתר את רוב השאלה שלו\nהשורה התחתונה: כנראה הקורס הכי מעניין בסמסטר ראשון. יותר מידי עבודה בשבועות הראשונים", "timestamp": 1676990541096}, {"author": "N", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מורדכי\nחוות דעת - הרצאות:  אוהב עבודתו \n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: \nהיינו קבוצה קטנה בתרגולים והיה מתייחס לכולם \nשעורי הבית: \nארווווווכים אבל תהנו כשעושים ביחד\nהמבחן: \nיש שאלות קשות ואחרות בסידר\nהשורה התחתונה:", "timestamp": 1679058970193}, {"author": "?", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מדרכי עודד \nחוות דעת - הרצאות: משעממות יש הכל בסיכומים \n\nשם המתרגל/ת: טטיאנה בלוך\nחוות דעת - תרגולים: \n6 תרגולים ראשונים חשבוים מאוד את השאר יש מוקלט במודל \n\nשעורי הבית:  הרבה זמן + הרבה השקעה עדיף לעבוד בקבוצות \n\nהמבחן: סביר (70+_)\n\nהשורה התחתונה:", "timestamp": 1689371972659}, {"author": "ויקטוריה", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מדרכי \nחוות דעת - הרצאות: מרצה מדהים ! הכי טוב שפגשתי עד כה \nמספר ומלמד ממש מעניין ומעביר את החומר ממש טוב\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לוקח לא מעט זמן , צריך להקדיש לזה באמת את הזמן שלו ,יכול להגיע לכמה שעות של שרטוט \n\nהמבחן: מאוד מתחשב ,כן צריך לדעת את החומר ויש גם כל מיני נושאים אבל יחסית נחמדים בבדיקה ואם עושים עבודה טובה במהלך הסמסטר אין סיבה שתצאו עם ציון נמוך ,בעיקר כשיש אחוז גדול על שיעורי בית אז תשקיעו \nהשורה התחתונה: יש ציוד שצריך לקנות מראש, סרגלים ועפרונות (יש רשימה מסודרת ובשיעור הראשון עוברים על הכל )", "timestamp": 1704732067853}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שחף \nחוות דעת - הרצאות: \nלא הייתי הולכת 🙃\nאבל יש שאלות במבחן שהן מתיחסות רק להרצאות אז עברתי על המצגות לפני המבחן\nשם המתרגל/ת: אורי ניסים \nחוות דעת - תרגולים: \nאת האמת שלא יודעת אם הבעיה היתה בי או בו, הייתי יוצאת מהתרגול עם הבנה של 40%\nשעורי הבית: \nדורשים הרבה מאוד זמן \nאבל יש עליהם אחוז גדול אז תשקיעו\nהמבחן: \nהוגן , תתאמנו טוב בבית על השרטוט", "timestamp": 1717932344117}]}