{"posts": [{"author": "prital margi", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: חאזם מאדח\nחוות דעת - הרצאות: מעניינות מאוד\n\nשם המתרגל/ת: גזל אלולי\nחוות דעת - תרגולים: מתרגלת נהדרת, באיזשהו שלב עברתי לראות את התרגולים המוקלטים וזו הייתה טעות כי לדעתי הייתי מבינה יותר טוב אם הייתי מגיעה לפרונטלי עם גזל.\n\nשעורי הבית: קשוחים, לקח לי המון זמן לעשות אותם. יש 10 גליונות, הגליון האחרון היה להגשה ממש בסוף הסמסטר ולא הגשתי אותו. הם כולם תקפים ולכן כדאי להגיש אותם מעבר לזה שזה יעזור לכם מאוד אחר כך כשתלמדו למבחן. \n\nהמבחן: היה יותר קשה ממה שציפיתי, חאזם ממש הפתיע, היו הרבה נכשלים, המבחנים שיש בדרייב משנים קודמות בכלל לא ברמה של המבחנים שהיו הסמסטר הזה (חורף תשפ\"ב, מועד א' ב' וג')\n\nהשורה התחתונה: קורס קשוח מידי בשביל 3 נק\"ז. אל תזלזלו בו.", "timestamp": 1649512076964}, {"author": "f22^-1=s22", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חאזם\nחוות דעת - הרצאות: \nסבבה ומעניין \n\nשם המתרגל/ת: גזל\nחוות דעת - תרגולים: עברתי למקולט היה סבבה , גזל טובה \n\nשעורי הבית: ארוכים קשים ואין קשר בינם לבין המבחן \n\nהמבחן: סביר אך לא קל , עם הרבה מכשולים , צריך ריכוז 100%\nעם הבנה לחומר \n\nהשורה התחתונה: \nקורס לא קל ו 3 נקודות על קורס כזה הינו דבר מוזר\nפער עצום בין ש.ב לבין המבחנים", "timestamp": 1675539259436}, {"author": "I AM GROOT", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חאזם\nחוות דעת - הרצאות: מעניין מאוד אבל גם נורא איטי\n\nשם המתרגל/ת: גזל\nחוות דעת - תרגולים: בתרגול יש הרבה אנשים אז זה מרגיש כמו פעולה בצופים אבל אחד על אחד היא מסבירה בסבלנות וממש נחמדה\n\nשעורי הבית: ארוכים, מתישים ומבזבזים המווווווןןן זמן\n\nהמבחן: ממש בסדר\n\nהשורה התחתונה: כדאי שיהיו כמה רפרנסים או לעשות שיעורי בית כולם ביחד בשביל לא לבזבז 12 שעות בשבוע", "timestamp": 1679305267841}, {"author": "Student", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עודד אמיר\nחוות דעת - הרצאות: \nהרצאות מאוד טובות, עודד העביר את המקצוע פעם ראשונה ועשה את זה ממש טוב. חלק מהחומר מועבר רק בשיעורי הכנה אז כדאי להשקיע גם בהם.\nשם המתרגל/ת: מג'ד\nחוות דעת - תרגולים: \nמתרגל מעולה, מסביר מעולה ונותן דגשים טובים. חצי מהתרגולים זה סדנאות לפתור את הש\"ב/קוד וחלק זה תרגול פרונטלי רגיל.\nשעורי הבית: \nהיו לנו 5 גליונות שלקחו המון זמן אבל שווים 15%מהציון אז כדאי להשקיע. חשוב ממש להשקיע בתרגילים של הקוד כי רוב המשקל של המבחן יהיה על זה.\nהמבחן: \nהיה מאוד קשה, היה בונוס של 5 נקודות וכנראה זה לא הספיק אז הם הפכו שאלה של 15 נקודות גם לבונוס.. חצי מהמבחן זה להשלים שורות קוד חסרות על בסיס הבנה בקוד ובמשמעות של כל פרמטר, כנראה שזה ימשיך להיות הנושא המרכזי במבחנים גם בעתיד.\nהשורה התחתונה: \nקורס חשוב שדורש המון ביחס לנק\"ז שלו. האנגלית היא לא פקטור בהבנה/בציון אז אין מה להילחץ.", "timestamp": 1714553064345}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עודד אמיר \nחוות דעת - הרצאות: \nמרצה מעולה שאכפת לו מהסטודנטים ואוהב לתת מכל הלב, בנה את הקורס בצורה מעולה שעזרה לשפר את צורת החשיבה של הסטודנטים.\nשם המתרגל/ת: מג'ד וגזל\nחוות דעת - תרגולים: שני המתרגלים של הקורס היו טובים מאוד בחומר, נתנו מכל הלב תמיד אהבו לעזור לסטודנטים.\n\nשעורי הבית: שיעורי הבית היו ארוכים יחסית ל 3 נק\"ז לקחו לנו מלא זמן לאורך הסמסטר ,אבל עזרו מאוד בהבנה של החומר ,מה שהכי לקח זמן היה הקוד אבל מתגברים על הכל בסוף. \n\nהמבחן: היה מבחן ארוך מאוד יחסית והיה מאוד טריקי ביחס לשנים קודמות , זאת פעם ראשונה  של עודד מעביר את הקורס ,אז הוא כתב את המבחן שונה מהמרצה שהיה לפניו , בסוף הם התחשבו בציונים כך שנתנו שאלה שהרוב לא הצליחו לעשות אותה כבונוס\n\nהשורה התחתונה: קורס ממש יפה שלמדתי ממנו הרבה , היה לחוץ לאורך הסמסטר אבל עזר מאוד, זכינו בצוות מעולה של הקורס שבנו והעבירו אותו בצורה מצוינת", "timestamp": 1714723145039}]}