{"posts": [{"author": "סטודנט", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי שביט\nחוות דעת - הרצאות: מרצה נורא. מהגרועים שהיו לי. יש לו את כל היכולות להיות מרצה טוב והוא כאילו \"בכוונה\" מרצה גרוע. כנראה שאין לו כוח לסטודנטים בכלל.\n\nשם המתרגל/ת: נעמה\nחוות דעת - תרגולים: על הפנים. מתרגלת שלא שולטת בחומר, לא מצליחה להנגיש אותו וללמד אותו כמו שצריך\n\nשעורי הבית: גליונות כל שבוע. רמת הקושי משתנה לפי הנושא של אותו שבוע...\n\nהמבחן: נראה שהמבחני עבר היו הוגנים. אצלינו המבחן היה קשה בצורה מוגזמת, עם ממוצע של 10 נקודות נמוך מבדרך כלל\n\nהשורה התחתונה: אורי לא מרצה טוב. ממליץ לראות בפנופטו גם של ההרצאות וגם של התרגולים. (הקלטות של יסודות מכניקת הזורמים)", "timestamp": 1677167938584}, {"author": "חרא של קורס", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורי שביט \nחוות דעת - הרצאות: עצבן אותי לאורך כל הסמסטר, הגיע עם גישה שהוא בא לחנך את כל 250 סטודנטים. אם מישהו מרים יד אז הוא מצפה שיהיה שקט מופתי בכל האולם. שיתקדם הלאה, באתי לרכוש ידע ולא שיחנכו אותי... \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עמוסים מאוד ומצריכים הרבה השקעה, כל שבוע היה לנו בוחן על אחד מתרגילים בתרגיל הבית ומה שמגיעים במודל אוטומטית מקבלים 100 ואין דרך לדעת אם פתרנו נכון או לא... רק לראות את הציון ומה היו הטעויות בבוחן בכיתה.\n\nהמבחן: קשה ועמוס , בסוף קיבלנו דף נוסחאות של יסודות מכניקת זורמים ולא של מכניקת זורמים אז תלמדו עם הדף נוסחאות הזה הוא דומה אבל טיפה שונה \n\nהשורה התחתונה: לא סבלתי את המרצה אבל תגיעו לשעות קבלה ולתרגולים הם מאוד חשובים ועוזרים להבין את הקורס הזה מאוד.", "timestamp": 1678790213431}, {"author": "סטודנט אזרחית", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: הרצאות לא פשוטות בכלל. אם מתמידים אז קולטים מה שחשוב והוא נוטה לשים דגש על דברים שהוא שואל עליהם במבחן. מרצה מעולה אכפתי בעל תשוקה למקצוע. קורס יחסית קשה.\n\nשם המתרגל/ת: נעמה / דוד\nחוות דעת - תרגולים: מומלצים. חשוב לנצל את התרגול להנחית את מה שנאמר בהרצאה. לתרגם לעברית את הסינית מההרצאה.\n\nשעורי הבית: הזדמנות לעקוב על החומר במהלך הסמסטר. חשוב לפתור ולהבין את שיעורי הבית. זה משמעותית קל משאלות מבחן.\n\nהמבחן: בדר״כ יש שאלת שימור תנע במערכת זזה\n\nהשורה התחתונה: קורס קשה, עדיף להיות בעניינים במהלך הסמסטר ולתרגל הרבה מאשר לעבור על הדברים דקה לפני המבחן.", "timestamp": 1679555373735}, {"author": "Rafael", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: גיא רמון \nחוות דעת - הרצאות: \nסבבה סך הכל, לא מזיק. אפשר להסתדר גם רק עם תרגולים. \nשם המתרגל/ת: נתן בלנק\nחוות דעת - תרגולים: \nמלך העולם. זמין 99% מהזמן ועוזר כשצריך, ולא משאיר אף שאלה בלי לענות עליה. לקראת המבחן הוא גם מקדיש אפילו אקסטרה זמן לשעות קבלה ושאלות.\nשעורי הבית: \nיש גיליונות אבל הם לא להגשה. זה החיסרון הגדול בקורס, כי הרוב לא נוגעים באמת במה שלא חובה להגיש.\nהמבחן: \nסך הכל הוגן. כדאי לקחת בחשבון שככל הנראה תהיה שאלה אחת קשה מהשאר. בכל אופן הם בודקים את הבחינה בצורה מתחשבת.\nהשורה התחתונה: \nקורס שנראה מבהיל בהתחלה אבל כשלומדים למבחן הכל מסתדר. למדתי דרך המבחנים את הקורס מהתחלה ב5 ימים ויצא לי 89 בסוף אז אין סיבה שעוד אנשים לא יצליחו.", "timestamp": 1716049248816}, {"author": "ו", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גיא רמון \nחוות דעת - הרצאות: אני אהבתי , יש כאלו שלא התחברו \nלדעתי מסביר טוב ודי זמין (יש תרגולים מוקלטים שלו ביוטיוב)\n\nשם המתרגל/ת: נתן \nחוות דעת - תרגולים: נתן הציל את הקורס ,כלכך עזר והיה זמין לשאלות והשתדל לעזור כמה שיכל \n\nשעורי הבית: אין .. יש מטלות לבדיקה עצמית \nמומלץ לעשות אותם ולא להגיע עד המבחן עם שוק\n\nהמבחן: המבחן לא קל אבל היתה ממש התחשבות בציונים ,שינו את משקלי השאלות וזה הקפיץ את הציונים מאוד - מרגישים שרצו שנצליח \n\nהשורה התחתונה: מהלך הקורס היה לא פשוט אבל היתה התחשבות בציון", "timestamp": 1718773567463}]}