{"posts": [{"author": "--", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שגיא דליות\nחוות דעת - הרצאות: יש הכל מוקלט בפנופטו, אבל מי שיגיע יכול לקבל עד 5 נק בונוס מקהוט\n\nשעורי הבית: שאלות ממבחנים משנים קודמות, לא קל ודורש השקעה\n\nהשורה התחתונה: להשקיע במעבדות ובשיעורי הבית וזה יעזור להישאר על החומר במהלך הסמסטר ולהצליח במבחן", "timestamp": 1597903816071}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאופיר \nמרצה מהמם, הלכתי כמה פעמים להרצאות, את האמת היו מעניינות אך השעה של ההרצה הייתה מאוחרת. אבל יש הכל במוקלט.\nשם המתרגל/ת: אביב\nחוות דעת - תרגולים: אין על אביב, בהתחלה הרגשתי שהוא לא כל כך שולט בחומר אבל אחרי התרגול השלישי הכל התחיל להסתדר.\n\nשעורי הבית: 3 ע\"ב בסמסטר עושים בזוגות.\nארוכות אך ברמת מבחן, כדאי מאוד לחזור על החומר ולפטור לבד\nהמבחן: \nהמבחן היה מאוד הוגן , אופיר מרצה מהמם המבחנים היו מאוד סבירים.\n\nהשורה התחתונה: מבחן המעבדה אצל קבוצת ג\"ריר היה מאוד לא הוגן והוא הכשיל את שני שליש הקבוצה ובמועד ב נתן ציונים גבוליים .", "timestamp": 1690568611048}, {"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אופיר\nחוות דעת - הרצאות: לא עוזרות בהבנת החומר בכלל\n\nשם המתרגל/ת: אביב \nחוות דעת - תרגולים: אביב מהמם, מסביר את החומר בצורה ברורה ממש, היה מאוד מעניין אותו שנבין את החומר ונצליח בקורס, ותמיד היה זמין לשאלות מחוץ לתרגולים, אחלה מתרגל.\n\nמתרגל המעבדה: גריר\nהמתרגל הכי טוב שראיתי בטכניון, גריר היה מאוד היה קרוב מהסטודנטים. למרות שהציונים שנתן במעבדות ובבוחן המעשי \nלא היו גבוהים אך הוא מאוד הוגן.\nהפסד לנו כך שהוא לא ילמד אותנו במיפוי 2.\n\nשעורי הבית: 3 עבודות כל הסמסטר(שאלות ממבחנים).מומלץ להשקיע בהם כדי להבין את החומר.\nלוקחות 3 עד 4 שעות, לא עמוסים בסמסטר.\n\nהמבחן: ארוך מאוד ולא קל, צריך לתרגל על פתירת מבחנים בזמן הדרוש .היה פקטור של 9 נקודות. \n\nהשורה התחתונה: קורס לא קל וגם לא קשה , החומר מובן אך הזמן קריטי במבחן , ניתן להוציא ציון גבוה אם משקיעים בדוחות המעבדה ובעבודות בית ומקבלים בהם ציון גבוה.", "timestamp": 1692060012102}]}