{"posts": [{"author": "אסף טנגיר", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nטובים\nשעורי הבית: \nלא קשים\nהמבחן: \nלא קשה\nהשורה התחתונה: \nממליץ", "timestamp": 1615213345747}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: ויצמן\nחוות דעת - תרגולים: מצויין !\n\nשעורי הבית: קלים, לוקח קצת זמן.\nיש גם פרוייקט סבבה.\nהמבחן: לא ממש קשה. צריך ללמוד.\n\nהשורה התחתונה: מומלץ.", "timestamp": 1625139640004}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: ארוכותמ אוד\n\nשם המתרגל/ת: אלעד ויצמן \nחוות דעת - תרגולים: ממש טוב. יש ביוטיוב.\n\nשעורי הבית: 5 תרגילי בית. יש רפרנסים.\n\nהמבחן: לא קשה, לא קל.\n\nהשורה התחתונה: אחלה קורס בשביל 4 נק\"ז", "timestamp": 1643538567437}, {"author": "prital margi", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבי וענת\nחוות דעת - הרצאות: ענת לא הייתה בעד ההקלטות וארחי ההרצאה השנייה הפסיקה להקליט. אבי היה בעד והקליט אותן. לא ראיתי את ההרצאות בכלל, נעזרתי בסיכומים שהיו בדרייבים.\n\nשם המתרגל/ת: פאדי \nחוות דעת - תרגולים: אין על פאדי, מתרגל נהדר שדואג להעביר את החומר בצורה ברורה. \n\nשעורי הבית: יש רק 5 עבודות להגשה, כולן עוזרות מאוד בהבנה ולכן חשוב לעשות אותן. יש פרויקט שצריך להגיש שלוקח יחסית הרבה זמן אבל הוא תורם לציון הסופי.\n\nהמבחן: בנוי מ60% החומר של התרגולים ו40% החומר של ההרצאות בצורה של שאלות אמריקאיות לכן לדעתי החומר של ההרצאות פחות קריטי לעומת התרגולים. \n\nהשורה התחתונה: קורס נחמד ממש, היה לי מגן טוב בכלל שהפרויקט שלי היה בין העבודות המצטיינות אז גם קיבלתי בונוס, סיימתי עם ציון 81 מבלי לראות שום הרצאה.", "timestamp": 1649511190599}, {"author": "משה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: מיותר\n\nשם המתרגל/ת: ויצמן\nחוות דעת - תרגולים: מצויין. ביוטיוב\n\nשעורי הבית: סבבה\n\nהמבחן: סביר\n\nהשורה התחתונה:", "timestamp": 1651076537361}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ענת ואבי\nחוות דעת - הרצאות: מיותרות ולא מעניינות.\n\nשם המתרגל/ת: אלעד ויצמן\nחוות דעת - תרגולים: מתרגל תותח. יש תרגולים שלו ביוטיוב שווה לראות הוא סוגר אתכם על כל החומר ומלמד איך להצליח במבחן בלי בלבולי מוח. התרגולים בכללי לא קשים.\n\nשעורי הבית: קלים וקצרים.\nבפרוייקט צריך ללכת בדיוק לפי ההנחיות, לא פחות ולא יותר מזה ומקבלים ציון גבוה. מספיק לבחור בניין קטן לא צריך להגזים ולבחור מגה פרוייקט זה רק יסבך אתכם.\n\nהמבחן: החלק התיאורתי בעייתי וקשה להשלים אותו אם לא ראית הרצאות. מצד שני גם מי שראה לא הצליח בכולו.\n\nהשורה התחתונה: קורס קליל, ציון גבוה, את הפרוייקט עשינו בשלושה ימים כולל ביקור באתר וקיבלנו 90.", "timestamp": 1654341244947}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: אחרי 3 הרצאות הפסקתי לבוא. פשוט בזבוז זמן.\n\nשם המתרגל/ת: פאדי\nחוות דעת - תרגולים: לא באתי לתרגולים. יש תרגולים מצויינים של ויצמן ביוטיוב. פשוט לפני כל מטלת שיעורי בית רואים את התרגולים הרלוונטים וככה עד סוף הסמסטר רואים הכל.\n\nשעורי הבית: יש 5 מטלות שלוקחות בערך 3-4 שעות למטלה. היתרון הוא שהמטלות זה בדיוק אופן השאלות במבחן אז שווה לעשות אותן כמו שצריך. בנוסף יש מטלת סמסטר שהיא 20% ושווה להשקיע בה כי זה מקפיץ את הציון\n\n\n\n\n\nהמבחן: החלק של ניהול ובטיחות הוא אמריקאי, שבשלושה ימים אפשר ללמוד את כל מה שצריך. שאר המבחן הוא שאלות חישוביות בדיוק כמו המטלות שהיו לאורך הסמסטר. \n\nהשורה התחתונה: אין טעם לבוא להרצאות ולתרגולים. חשוב לעשות את המטלות ולתרגל הרבה לפני המבחן. החלק של האמריקאיות זה פשוט שינון של החומר.", "timestamp": 1677168359088}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: כדאי ללכת אבל יש סיכומים לקראת הבחינה.\n\nשם המתרגל/ת: מוקלט ביוטיוב\nחוות דעת - תרגולים: משעממים בעיניי אבל לא קשים בכלל\n\nשעורי הבית: 5 ת\"ב + פרויקט. חשוב לעשות, גם לא קשים.\n\nהמבחן: יש חלק תאורטי וחלק חישובי. לא קשה\n\nהשורה התחתונה: קורס חמוד.", "timestamp": 1677844796048}, {"author": "I AM GROOT", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: הרגשתי שההרצאות היו כמו העשרה מתוך עניין, כי לא ממש היה אפשר להבין מהן מה החומר שצריך לדעת למבחן. מצד שני, סוף סוף הרגשתי שנותנים לנו לדבר עם מישהי מהתעשייה שיש לה המון ניסיון לחלוק\n\nשם המתרגל/ת: פאדי\nחוות דעת - תרגולים: פאדי מדהים אבל גם פופולארי מדי וצריך למצוא את התרגולים שלו שהולכים אליהם פחות אנשים. התרגול של 16:30-18:30 היה אחלה ממש\n\nשעורי הבית: פסדר\n\nהמבחן: התיאורטי זה כמו למלא כרטיס לוטו. עדיף לעבור על מלא שאלות אמריקאיות לפני המבחן בשביל החלק הזה.\nהחלק עם החישובים ממש פשוט כשמבינים למה זה עובד ומכניסים לזה הגיון פשוט.\n\nהשורה התחתונה: נחמד", "timestamp": 1679304774550}, {"author": "student", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: למרצה יש הרבה ידע אך משעממת. אפשר לא לצפות בהרצאות אך במבחן יש שאלות תיאורטיות על חומר שמועבר מילולית במהלך ההרצאות.\n\nשם המתרגל/ת: פאדי\nחוות דעת - תרגולים: מתרגל מושלם! \n\nשעורי הבית: יש 4 שיעורי בית בזוגות - לא קשה אך צריך להיות עקביים בחומר. יש גם פרויקט שלוקח הרבה זמן והשקעה אבל שווה את זה.\n\nהמבחן: לא קשה. ניתן לקבל ציון מאוד גבוה! השאלות התיאורטיות קצת מכשילות\n\nהשורה התחתונה: אחלה 4 נק'", "timestamp": 1681820338087}, {"author": "Student", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה:ענת \nחוות דעת - הרצאות: \nמשעממת ברמות\nשם המתרגל/ת: פאדי\nחוות דעת - תרגולים: overrated\n\nשעורי הבית: קלים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1712940278726}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ענת ואבי\nחוות דעת - הרצאות: \nלא הלכתי\nשם המתרגל/ת:  פאדי\nחוות דעת - תרגולים: \nתרגולים בסדר והתרגילים ברמת הש\"ב והמבחן.\nשעורי הבית: \nיש 5 מטלות ופרויקט. המטלות די קצרות כמו בתרגולים ועושים אותם בזוגות שזה בכלל מקל. הפרויקט הוא ללכת לאתר בניה כלשהו ולראיין את המנהל פרויקט על: בטיחות, לוחות זמנים, בעיות בלתי צפויות שקרו וכו'.\nהמבחן: \nיש 3 חלקים במבחן. אחד של ניהול אחד של בטיחות ואחד של שאלות חישוביות.\nהניהול והבטיחות מבוססים על ההרצאות שלא הייתי בגלל המילואים. בניהול היה קשה ללמוד מהמצגות(הן פשוט נקודות שהמרצה כנראה דיברה עליהם בהרחבה בכיתה) והבטיחות מאוד מזכיר נהיגה מונעת- תמיד לענות את השאלה המתרפסת ביותר ולקוות שזה נכון. החלק החישובי הוא 60% מהמבחן מאוד סביר ודורש בעיקר הגיון בריא ולתרגל קצת לפני\nהשורה התחתונה: \nקורס קל שהדבר הכי מועיל בו זה הפרויקט.", "timestamp": 1715366285949}]}