{"posts": [{"author": "אסף", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצים: רוני ואלכס\nחוות דעת - הרצאות: \nמשעמם ולא מובן\nשם המתרגל/ת: \nמוחמד\nחוות דעת - תרגולים: \nאחלה מתרגלים השקיעו במהלך הסמסטר\nשעורי הבית: \nלא ארוכים במיוחד\nהמבחן: \nקשה יש שאלות שאף אחד לא הצליח לפתור\n\nהשורה התחתונה: \nתגיעו להרצאות המרצים מאוד נעלבו שלא הגיעו ועשו מבחן בהתאם", "timestamp": 1635274726221}, {"author": "דארסי וויסבך", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nקשה מאוד\nפסלו שאלה במבחן\nהיה פאקטור של 13 נקודות ולמרות כך הממוצע די נמוך\n\nהשורה התחתונה:", "timestamp": 1659014052895}, {"author": "student", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה:  אלכס פורמן +  נעמה שגב מארק\nחוות דעת - הרצאות: הועבר הקורס במתכונת חדשה כך שהתחלק לשני חלקים: הראשון הוא הידרולוגיה ע\"י אלכס והשני הידרוליקה ע\"י נעמה. ההרצאות סבבה סבירות, יש מלא פיתוחים וחומר מיותר/משעמם אך החומר התיאורטי חשוב למבחן. המרצים כל כך נחמדים ואכפת להם.\n\nשם המתרגל/ת: הקלטות של מוחמד או של שגיא\nחוות דעת - תרגולים: תרגול של שעה מסכמים בהם את כל החומר והנוסחאות - הקלטות מוחמד מעולים! \n\nשעורי הבית: היו סה\"כ 6 כל הסמסטר - 3 לכל חלק. סבירות לא רמה קשה וחשוב מאוד לפתור אותם כי הם בעצם שאלות ממבחנים קודמים שלדעתי זה נהדר! עוזר בהבנת החומר מאוד + אין הבדל ברמת הקושי בין הש\"ב למבחן.\n\nהמבחן: היו שני מבחנים. של החלק הראשון באמצע הסמסטר(בחינה סופית) והחלק השני במועדי א. רמה מאוד סבירה וניתן לקבל ציון גבוה מאוד!\n\nהשורה התחתונה: קורס אחלה! צריך להישאר עקבי במהלך הסמסטר ותקבלו ציון מעולה. קורס מוצלח יחסית ל3.5 נק\"ז:)", "timestamp": 1690394901211}, {"author": "shorook rada", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה:אלכס ונעמה \n אלכס מסביר החומר בצורה טובה והוא מאוד חזק בחומר, אבל הקול שלו מאוד חלש ולכן מרגיש הרדמות, נעמה למדה את זה בפעם הראשונה הסימסטר היא קצת מבולגנת אבל בכללי הקורס הלך אחלה \nחוות דעת - הרצאות:הרגשתי שהרצאות ההידרוליקה אין בהם חומר מספיק, החומר היה מועבר בעל פה בהרצאה ובשקופיות היה מעט חומר  \n\nשם המתרגל/ת: אביעוז דגן\nחוות דעת - תרגולים: אביעוז תותח, מעביר את החומר בצורה ברורה ומסודרת,אוהב לעזור, כל הזמן יש לו דלת פתוחה לשעות קבלה ומילים מהסטודנטים הוא פשוט אשששש\n\nשעורי הבית: היו 6 שיעורי בית שמאוד עוזרים להבנת החומר ומאוד עזרו במבחן כי היה אותו סגנון\n\nהמבחן: מבחן סביר מאוד ,מי שהיה במעקב אין לו בעיה \n\nהשורה התחתונה: קורס אחלה מאוד אהבתי", "timestamp": 1690624426025}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נעמה ואלכס\nחוות דעת - הרצאות: \nאלכס- ממש מקצועי, שקט מבחינת הטון.\nנעמה- חדשה בללמד, קצת מתקשה בהתחלה.\nשם המתרגל/ת: \nנטשה- איזה שלושה תרגולים ואז עברתי למוקלט כדי לא להישאר בימי חמישי.\nחוות דעת - תרגולים: \nנטשה ממש טובה, מומלצת ביותר. מסבירה טוב וברור. אני מקווה שיתנו לה שעות יותר טובות סמסטר הבא.\nשעורי הבית: \nחשובים מאוד. זה שאלות ממש ממבחנים והם ההכנה הכי טובה בתכלס.\nהמבחן: \nיש שניים, אחד באמצע על חלק אחד המקצוע ובתקופת מבחנים עוד אחד. אפשר להוציא אחלה ציונים בכמה ימי למידה.\nהשורה התחתונה: \nקורס סבבה לגמרי, רגוע.", "timestamp": 1690912175240}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלכס פורמן ונעמה\nחוות דעת - הרצאות: לא הגעתי בכלל וגם לא השלמתי והסתדרתי, אבל אלכס מרצה חמוד אפשר להגיע לשעות קבלה הוא באמת שמח לשמוע שאלות ולעזור\n\nשם המתרגל/ת: נטשה האלופה\nנטשה מושלמת! אכפת לה מכל סטודנט,מקדישה הרבה מעבר לשעות שלה בשביל לעזור לכולנו. סבלנית, מסבירה מעולה,לא מתייאשת להסביר שוב ושוב עד שמובן. רואים שמגיעה מוכנה לכל תרגול \nחוות דעת - תרגולים: תרגולים לא קשים, סגל הקורס מפרסם לקראת המבחן הקלטות \n\nשעורי הבית: לא הכי סימפטי- אבל שמים שאלות ברמת מבחן כך שזה עוזר לתרגל ברמה שרלוונטית לנו\n\nהמבחן: המבחן של אלכס היה קשה, ממוצע נמוך. המבחן של נעמה היה קל-ממש פירגנה לנו\n\nהשורה התחתונה: אפשר להוציא 90+ בקלות, אחלה סגל וחומר לא קשה. בהצלחה!", "timestamp": 1691349059800}]}