{"posts": [{"author": "anonymous", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: קונסטנטין קובלר\nחוות דעת - הרצאות: מרצה לא מתחשב בכלל מביא מבחנים מחלל\n\nשם המתרגל/ת: איגור לפירו\nחוות דעת - תרגולים: אין תיאום בכלל בין המתרגל למרצה וגם אין למתרגל שום דעה או השפעה לדעת המרצה\n\nשעורי הבית: בינוני\n\nהמבחן: קשהההההה\n\nהשורה התחתונה:", "timestamp": 1612689811003}, {"author": "ברק לוי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: קוסטה\nחוות דעת - הרצאות: \nקוסטה מונוטוני מאוד .לוקח דברים כמובן מאליו והמבחן מבוסס על ההערות הקטנות שהוא נותן במהלך הסמסטר\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמעבדות\nהמבחן: \nטריקי . \nהשורה התחתונה: כולם חייבים לעבור את זה, קחו אוויר ותכווצו את הישבן כי אין מה לעשות.", "timestamp": 1616434477328}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: קוסטה ריקה\nחוות דעת - הרצאות: \nלא הכי טובות, נורא קל לאבד ריכוז ויש מלא סיפורי רקע שקוסטה מנסה להלהיב אתכם על המקצוע ונורא לא מפריד בין עיקר לטפל. קוסטה עושה בחנים קטנים כאלה באתר סוקרטיב שלא ברור מה התרומה שלהם לציון אבל עדיף כן לעשות אותם(יש שאלות מהמבחן שמופיעות שם). יש הקלטות מעולות של אמנון כץ, בכל מקרה קוסטה מקריא את המצגת שלו(לפעמים לא כזה טוב ולוקח לו רגע להבין מה כתוב שם). עכשיו כדי לראות את אמנון ולוותר על ההרצאות תעשו את הדבר הבא:\nתיכנסו בשעות של ההרצאות של קוסטה לאתר SOCRATIVE ותיכנסו לחדר KOVLER וכשהוא פותח את זה תענו על זה שלא תפסידו נקודות, או תיהיו בקשר עם מישהו בהולך להרצאות ויכול להתריע לכם על הסוקרטיבים. למתקדמים ותחמנים- תיכנסו עם 2 משתמשים שאחד מהם פיקטיביים וככה תוכלו לדעת מה התשובות הנכונות.\nתרגולים:\nאין תרגולים יש 6 מעבדות שאמורות להיות צמודות להרצאות ולהדגים את החומר. די נחמדות.\n\nשעורי הבית: \nאין בכלל יש דוחות מעבדה(6 מעבדות סה\"כ).\nהמבחן: \nהמבחן הוא החלק המעצבן כאן. הוא מפוצל ל2 בחני אמצע תקפים, כל אחד בערך 40% מהציון הסופי. הבחנים ממש ממוחזרים- הראשון בד\"כ קשה יותר וכולל את כל המבוא והחומר עד בטון כזה והשני הוא על תכן תערובות, בדיקות ותכונות של בטון וטיח. יש בבוחן השני שאלה ממש גדולה על תכן תערובת נורא טכנית, אלא אם כן תיפלו על תכן הפוך(כמו אנחנו) ואז זה יותר מאתגר. \nיש 2 ספרי קורס שצריך ללמוד לבחנים ואין איך להתחמק מיזה, יש את הספרים בספרייה או בקבצים סרוקים, תבקשו מאנשים שעשו את הקורס בטוח יש להם.\nהשורה התחתונה: \nקורס לא קשה מידי, קצת מרגיז אבל אפשרי לעבור עם ציון סבבה.", "timestamp": 1676982258183}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: קוסטה קובלר\nחוות דעת - הרצאות: הרוב לא התחבר אליו ועבר לראות הקלטות של אמנון מהפנופטו. למרות שקוסטה מרצה שמכניס למבחן דברים ספציפיים שהוא אמר בהרצאות ומי שלא היה לא יידע.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: יש מעבדות. הן יחסית קלילות ומרפרנסים את כל הדו\"חות מהר. \n\nשעורי הבית: אין\n\nהמבחן: ממוחזר, ומה שלא ממוחזר זה מה שקוסטה אומר בהרצאות\n\nהשורה התחתונה: קורס יחסית קל, חומר לא מעניין, קורס הומני מאד יחסית לשאר הקורסים", "timestamp": 1677168087252}, {"author": "1", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אמנון\nחוות דעת - הרצאות: מעניינות אבל אפשר ללמוד למבחן בלי ללכת להרצאות,פשוט ללמוד מהסיכום שיש בו 82 עמודים   \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין תרגולים,יש 6 מעבדות שמאוד יפות ומעניינות.\nשעורי הבית: \n6 דוחות בדרך כלל(בסמסטר שלנו עשינו רק 5)לא קשות ולא דורשות הרבה השקעה.\nהמבחן: הוגן, מי שלמד טוב קיבל ציון גבוה.\n\nהשורה התחתונה: קורס יפה ומעניין ובמיוחד המעבדות.", "timestamp": 1714765647650}, {"author": "ו", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה:אמנון  \nחוות דעת - הרצאות: מספר סיפורים לרקע מצגת \nצריך לדעת להבדיל בין עיקר לטפל אבל בסהכ מדבר לעניין \n\nשם המתרגל/ת: מעבדה - ענבל \nחוות דעת - תרגולים: אחלה מעבדות יש בוחן סוקרטיב בכניסה , לא משהו שמקשה \n\nשעורי הבית: דוחות מעבדה מאוד בסדר \n\nהמבחן: סביר מאוד ,מי שלומד במהלך הסמסטר אין סיבה שלא יצליח \nלפעמים הוא מכסח בנקודות שזה פחות נחמד \nיש קוויז מי עם שאלות לדוגמה לאמריקאיות \n\nהשורה התחתונה:", "timestamp": 1718773725235}]}