{"posts": [{"author": "Yarden", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות:\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  שניהם מצויינים, אחד מהתחום מסביר מנקודת מבט יותר כלכלית והשני מנקודת מבט של מבחן\n\nשעורי הבית:  5-6 הגשות די פשוטות דומות לעבר, קל לרפרנס\n\nהמבחן: 20 שאלות אמריקאיות, צריך לשים לב לטקסט, המבחן עצמו לא קשה אבל קל מאוד להתבלבל\n\nהשורה התחתונה:  קורס לא כבד בכלל, ניתן להשלים פערים ב 4 ימים לפני המבחן, מומלץ אבל כן ללכת לכל התירגולים בזמן הסמסטר", "timestamp": 1598181155600}, {"author": "..", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שלומית\nחוות דעת - הרצאות: הרצאות מעולות , כדאי לראות כדי להיות מוכנים לתרגולים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: פאדי שהין\nמומלץ בחום , הוא מעביר את החומר בצורה הכי טובה שקיימת , עונה לשאלות ודואג שכולם מבינים\n\nשעורי הבית: מומלץ לפתור לבד אחרי התרגולים\n\nהמבחן: \n\nהשורה התחתונה: מומלץ מאוד להיות עקביים במהלך הסמסטר", "timestamp": 1627659656845}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שלומית הון-שניר\nחוות דעת - הרצאות: תותחית. מעבירה הכל באופן מתומצת ובהיר. באמת אכפת לה מהסטודנטים ומההבנה לא רק לקורס אלא גם לחיים. מנסה להקל על חיי הסטודנטים כמה שיותר.\n\nשם המתרגל/ת: פאדי שהין\nחוות דעת - תרגולים: גם מדהים. אכפת לו מהסטודנטים והוא עודה על שלות בכל שעות היום במהירות שיא (תשובות טובות וארוכות). מעביר את החומר מאוד ברור. \n\nשעורי הבית: מאטים וקלילים. יש גם תרגול שלם של שו\"ת לכל שיעור בית בנפרד שבה פאדי די פותר אותם. צריך להיות רשלני מאוד לא לקבל ציון גבוה.\n\nהמבחן: הוגן מאוד. מי שלמד והתכונן יצליח, וצוות הקורס נותן תחושה חזקה שהם רוצים שכמכ שיותר יצליחו.\n\nהשורה התחתונה: קורס עם צוות מדהים שרלוונטי מאוד לחיים הפרטיים והמקצועניים.", "timestamp": 1628847838890}, {"author": "...", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המתרגל/ת: פאדי\nחוות דעת - תרגולים: פאדי מתרגל מצויין\n\nשעורי הבית: לא לוקחים הרבה זמן\n\nהמבחן: רמה יותר גבוהה ממה שהייה בתרגולים\n\nהשורה התחתונה: יש 6 תרגולים\nממליץ גם להיות בהרצאות, בכדי להשלים פערים", "timestamp": 1663234781654}, {"author": "Yaakov L.", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שלומית הון-שניר\nחוות דעת - הרצאות: משקיע מאוד ומביאה חומר חשוב לחיים אך אין שום צורך להגיע בשביל להצליח בקורס\n\nשם המתרגל/ת: פאדי שאהין\nחוות דעת - תרגולים: מתרגל מעולה וגם כמעט אין תרגולים בקורס הזה אז בונוס ענק ואפשר ללמוד את כל הקורס רק מהתרגולים שיש בערך 6 כאלה כל הסמסטר וגם הם לוקחים פחות זמן ממה שרשום במערכת\n\nשעורי הבית: קלילים\n\nהמבחן: די קל\n\nהשורה התחתונה: קורס קל ומעניין יחסית. ממליץ בחום לכל מי שרוצה להעלות ממוצע בקלות", "timestamp": 1679392794420}, {"author": "Student", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nסברינה\nחוות דעת - הרצאות: \nמלאות בחומר, לא חומר קשה ודי נקלט ישר. בשלב מוקדם הפסקתי לבוא אבל הייתי עובר על מצגות לבד והיה בסדר.\nשם המתרגל/ת:\n רחמים\nחוות דעת - תרגולים: \nממש אחלה! הכל בשפה ברורה ורהוטה. מסביר טוב ועונה על כל שאלה שיש.\nשעורי הבית: \nיש הרבה גליונות אבל הם מאוד קטנים, לא לוקחים הרבה זמן בכלל.\nהמבחן: \nקל, ממוחזר. תעשו את השיעורי בית+ התרגולים+ לעבור על הכמה מבחני עבר הבודדים שיש ויהיה בסדר.\nהשורה התחתונה: \nקורס קל ונחמד", "timestamp": 1695471107683}]}