{"posts": [{"author": "מייקי רונן", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פייסל אלולי\nחוות דעת - הרצאות: ההרצאות מאוד תורמות להרחבת האופקים של הסטודנט. קורס חשוב מאוד לכל מהנדס לעתיד.\nהמרצה, אינג׳ א. פייסל, עושה עבודה טובה בהעברת החומר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613065293378}, {"author": "סטודנטית מאוכזבת", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: פייסל אלולי\nחוות דעת - הרצאות: נכחתי בכל הרצאות הקורס ולצערי המרצה לא הצליח להעביר אותם בצורה מובנת מספיק, וגם התרומה שלהם למבחן היתה מזערית. שאר ההתנהלות של המרצה ביחס לקורס זה בשנה זו היתה קשוחה בהרבה משנים קודמות והציונים והמשוב היו נמוכים ולא תואמים כלל. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: בדיקה הרבה הרבה יותר קשוחה משנים קודמות. ממנוצע נכשלים היה 28% לעומת 0 נכשלים בשנים קודמות. אני מקווה שכשתעלה ההיסטוגרמה הסופית התוצאה תהיה שונה מזאת ושנראה שעשו משהו לשינוי.\n\nהשורה התחתונה: קורס שלא הוסיף לנו שום מידע חדש. ההייליט של הקורס - ניסוי ההעמדה לא קשור כלל לנלמד בקורס וגם התבצע ללא הדרכה. ובסוף - גם הבדיקה היתה לא הוגנת עם ציון מקסימלי של 88.", "timestamp": 1676478768547}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: פייסל אלולי\nחוות דעת - הרצאות: מדבר על נושאים ברומו של עולם ועל מבנים מיוחדים, פתרונות יצירתיים וכאלה, שזה מאוד נחמד בתיאוריה אבל לרוב ללא יישום פרקטי בסדנאות ובתרגילי הבית.\n\nחוות דעת - סדנאות: אין באמת צורת התנהלות, עובדים על תרגילי הבית ואפשר לשאול את המנחים שאלות, אף אחד מעולם לא פתר תרגיל על הלוח והציג את הדרישות של מה שצריך להיות וכיצד דברים צריכים להיעשות, התבססנו על עיקרי תכן מבנים במובן הזה.\n\nשעורי הבית: הם בסדר. עם זאת יש בעיה עיקרית והיא המשוב על שיעורי הבית. לרוב אם פתרתם את התרגיל בצורה סבירה המנחה פשוט ירוץ על הקובץ, יהנהן שהכול בסדר, לעיתים עם אפס הערות שליליות ועדיין יכול לדפוק ציון 90 (לאן הלכו 10 נקודות? רק השם יודע). בנוסף אין התמקדות על המיקרו - סכימות, צורות עומסים וכולי ודווקא במבחן ניתן לכל אלה דגש מיוחד מאוד מאוד מאוד.\n\nהמבחן: מה נשתנה השנה? לא ידוע. מה שכן ידוע הוא שדי הרבה סטודנטים יצאו בתחושות טובות מהמבחן והציונים התנגשו להם בפרצוף. הייתה בדיקה מאוד מחמירה והורדת ניקוד מסיבית, לא תמיד לצד הסבר או הערות בונות, פשוט לפי העין. \n\nאפשר לשים את האצבע על כמה סיבות מדוע הממוצע של השנה נמוך ביחס לשנים אחרות:\n- התרגיל הראשון במבחן חתר לפתרון די ספציפי שכאשר סטודנטים לא הגיעו לאותו הפיתרון, הסכימות הסתבכו. הפיתרון מאידך היה די לא טריוויאלי (לא תמיד קל לחשוב על פתרונות כשיש לך 3 שעות ל-3 חלופות עבור 3 מבנים שונים - הזמן משחק פקטור סופר משמעותי).\n- זמן זמן זמן (כמו שנכתב כבר מעלה) - גם בעיקרי תכן וגם כאן, הזמן קצר והמלאכה מרובה. אין זמן לעצור ולחשוב (הפוך מהעולם האמיתי) ויש טרפת אמיתית לסיים את המבחן במסגרת הזמן הקצוב, וזה כמובן בא לידי ביטוי בתוצרים לא מאוד יפים ואסתטיים.\n- ככל הנראה הסגל אימץ דרקטיבה של בדיקה מחמירה ביחס לשנים קודמות. הציונים הנמוכים גם באו לידי ביטוי בפרויקט (ניסוי העמסה) כשהציון הכי גבוה היה 88 (עבור מודלים מכובדים, חכמים ומושקעים) כשבשנה שעברה היו ציוני 100. הבדיקה המחמירה כמובן באה לידי ביטוי במבחן והבודקים דאגו להוריד ניקוד והרבה ניקוד על כל דבר, גם על דברים מופרכים שהם מעולם לא דיברו עליהם.\n- מניסיון שיח למול הסגל והפקולטה נתקלנו בחומה סדורה. היו ניסיונות להידבר ולהעביר מסר עבור הדורות הבאים שבקורסים כאלה אין צורך במבחן כי הוא לא משקף במאומה את הלמידה, ההשקעה או ההבנה של הסטודנטים בחומר (אלא כמה מהר אתה עובד ומי בדק לך).\n\nהשורה התחתונה: קורס שבנוי בצורה לא טובה, עובר בצורה לא טובה ומסתיים בצורה לא טובה. יש שיגידו שאלו הקורסים החשובים בתואר, אבל כדי שהם אכן יהיו כה חשובים כנראה שצריך לצקת לתוכם תוכן (שכבר ישנו) בצורה אחרת, מסודרת יותר, אקדמית יותר, עם פיקוח מהפקולטה.\n\nאין לכם ברירה לקחת את הקורס כי הוא חובה במבנים, אז רק אייחל שבסמסטר שלכם יהיה מבחן נורמלי ובדיקה נורמלית. תנסו לשפר ממוצע בקורסים אחרים כי גם אם תשקיעו לא בטוח שתקבלו פה ציון טוב, זה לא תלוי רק בכם.", "timestamp": 1677087289497}, {"author": "ע.", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אינג' פייסל אלולי\nחוות דעת - הרצאות: מעניינות מאוד ועם השתתפות פעילה של הסטודנטים. לפעמים הוא רץ וקצת קשה לעקוב אחריו.\nבכללי, לא חומר קשה. \nלב הקורס זה להבין את זרימת הכוחות במבנים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: סדנאות כמו בעיקרי תכן. מאוד חשוב לנצל אותם ולשאול המון שאלות ולנסות ללמוד כמה שיותר! \n\nשעורי הבית: דומה לעיקרי תכן, אבל בעיקרי תכן הדגש הוא יותר על החישובים של התכן הראשוני, וכאן הדגש הוא יותר על החשיבה ההנדסית. אם השקעתם בעיקרי תכן יהיה לכם קל יותר בקורס הזה.\nהרבה מתרגילי הבית היו שאלות ממבחני עבר שזה טוב.\nלהשקיע בתרגילי הבית ולנסות להבין הכל תוך כדי הסמסטר, אחרת יהיה לכם קשה במבחן.\n\nהמבחן: הלמידה למבחן מתבצעת תוך כדי הסמסטר. אם השקעתם בתרגילי הבית יהי לכם קצת יותר קל. בכל זאת חשוב ללמוד למבחן ולראות סריקות משנים עבר.\n\nפרויקט: השקענו בזה הרבה עבודה ומחשבה (וגם כסף) ובסוף קיבלנו ציון נמוך שלא מתאר את העבודה והחשיבה ההנדסית שלנו. ורוב הציונים היו נמוכים.\n \nעכשיו על התנהלות הקורס והצוות - \nמשוב על תרגילי הבית - הרגיש כאילו צוות הקורס מחפשים קיצורי דרך ומחפשים איך לחסוך כמה שיותר עבודה. \nהיה מבולגן במהלך הסמסטר, לפעמים ביקשו להדפיס את תרגילי הבית ולהגיש מודפס, לפעמים בחנו אותנו פרונטלית -כל קבוצה הציגה למנחה והוא שאל שאלות. לא כל המנחים בוחנים אותו דבר ולא כולם נותנים משוב הולם. \n\nבדיקת הפרויקט - היה קטסטרופה. לא נדרשנו להגיש דוח שזה נשמע כיף התחלה אבל בסוף זה פוגע בסטודנטים כי צוות הקורס לא יודע על מה חשבנו ומה עשינו וכמה השקענו ובסוף הרגיש שחילקו ציונים רנדומלית! הציונים היו מאוד נמוכים ולא שווים ולא שיקפו את ההשקעה. מרגיש שפספסו את הפואנטה שזה החשיבה ההנדסית.\n\nבדיקת המבחן - אישית הרגשתי שבדקו לי את המבחן בצורה הוגנת, אבל ממה שהבנתי שיש כמה מנחים שבודקים את אותו תרגיל לסטודנטים שונים, ואם זה אכן ככה אז זה מש לא בסדר כי כל אחד בודק בצורה אחרת והבדיקה לא אחידה וזה תלוי במזל ולדעתי צריך להתלונן על זה כי זה לא תקין.\n\nהשורה התחתונה: קורס חשוב, חבל שמרגישים זלזול בסטודנטים. צריך הרבה סדר בקורס הזה.", "timestamp": 1715158733705}]}