{"posts": [{"author": "Itay Zaidel", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אדר געתון\nחוות דעת - הרצאות: הרבה רצון טוב, ים סבלנות ואמפתיה. \nהסברים מעט לוקים בחסר שכן זה קורס כללי יחסית\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: ממוקדים ומוסברים היטב, משקל רב לתירגולים. \n\nשעורי הבית: גג 5 שעות בשבוע\n\nהמבחן: מאתגר אך פתיר\n\nהשורה התחתונה: אם לא מבינים, תשאלו. אם יש כשלים טכניים, תגידו. \nהסגל מאוד בגובה העיניים", "timestamp": 1603003935069}, {"author": "אופק", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש כל שבוע, בין שעתיים ל-4 שעות\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1631788785822}, {"author": "שיר", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: \nמאוד ארוכות ומתישות, אך בכל מקרה מומלץ להגיע, אמיר מרצה טוב וקשוב.\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: יש לו רצון טוב, בסה\"כ אחלה\n\nשעורי הבית: עושים בזוגות, שיעורי בית תקפים, ברמה של המבחן, לא כל כך מעיקים, ממליצה לפתור בנפרד את התרגילים כדי להיות כמה שיותר מוכנים למבחן\n\nהמבחן: מאוד פייר, אבל חשוב חשוב לתרגל זמנים ולעשות סימולציות מלאות, הזמן קריטי.\n\nהשורה התחתונה:", "timestamp": 1658159572498}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אמיר דגני\nחוות דעת - הרצאות: לרוב מאוד משעממות אך קשה לדעתי קשה להצליח בקורס בלי ללכת אליהן\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: התרגולים חשובים מאוד ליישום הטכניקה, עמית מסביר תאכלס מה צריך לעשות כדי לפתור תרגיל ושם דגש על מה חשוב. חשוב לו שסטודנטים יצליחו בקורס לכן משתדל לענות על כל השאלות יש לו הרבה רצון טוב.\n\nשעורי הבית: רובם ברמת מבחן, ההגשה בזוגות, תקף בממוצע לפתור לוקח 4 שעות לכל גליון\n\nהמבחן: ברמה של השיעורי בית. חשוב מאוד להשקיע כל הסמסטר ולעשות את השיעורי בית כי הם מכינים טוב למבחן\n\nהשורה התחתונה: אם לא משאירים הכל לתקופת מבחנים ומתמודדים עם השב בלי לרפרנס הכל, יכול להיות אחלה ציון.", "timestamp": 1658814246935}, {"author": "ק", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: אמיר דגני- אחלה אבל 3 שעות ברצף זה קשוח.\nשם המתרגל/ת: שיר רבינוביץ'\nחוות דעת - תרגולים: שיר מדהימה, רק בזכות התרגולים שלה הבנתי את החומר כמו שצריך, הייתה זמינה והרגישו שהיא רצתה שנצליח. \n\nשעורי הבית: חשוב לעשות כי הם ברמה של מבחנים\n\nהמבחן: הוגן \n\nהשורה התחתונה: קורס של 4 נק\"ז אז שווה להשקיע", "timestamp": 1691338346150}]}