{"posts": [{"author": "חן", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: הרצאות משעממות מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים המוקלטים ממש לא טובים\n\nשעורי הבית: המון שיעורי בית שמהווים בסך הכל 5 אחוז מהציון \nיש גם פרויקטון שמהווה 15% ומצריך מעל לשבוע עבודה\n\nהמבחן: \nקשה בצורה לא פרופורציונלית \n\nהשורה התחתונה:", "timestamp": 1658755673016}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: רפי לינקר\n\nקורס ביזיוני. דורש השקעה לאורך כל הסמסטר, וגם זה לא בטוח מספיק. כל הסמסטר פתרנו תרגילי בית לבד, הגענו להרצאות, לתרגולים + צפייה במוקלט מראש ושעות קבלה.\nהמבחן הסופי בקורס היה לא פרופורציונלי לשלוש שעות בשום צורה. שאלות ברמה יותר גבוהה מהנלמד בתרגולים ובהרצאות ומכל מבחן שהיה לפניו. אם הממוצע האמיתי היה מחושב כנראה שהוא היה 30 בלחץ.\nנתנו פקטור בין 5 ל10 נקודות לכל סטודנט ועדיין הממוצע של המבחן הגיע ל57 ו40% נכשלים. גם הבדיקה של המבחנים הייתה מגוחכת, כביכול בדיקה מקלה לסטודנטים שגם ככה לא עוברים את ה55 רק בשביל להרים את הממוצע למצב של לכאורה מבחן הוגן.\n\nבשורה התחתונה - \nמאוכזבת מהסגל מאוד ברמה האישית. ברוך שפטרני.", "timestamp": 1659218761475}, {"author": "אורג'ואן סלפיתי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רפי לינקר\nחוות דעת - הרצאות: הייתי ממליצה לצפות במוקלט קודם ואז להגיע לכיתה, לפחות ככה תדעו על מה מחרטטים שם, ואז יותר קל לכם לעקוב אחרי רפי ולדון איתו בנקודות שפספסתם במוקלט; אחרת יתכן שההרצאות יהיו מתישות ולא מובנות.\nרפי מלמד בקצב ממש איטי וסלואו מושן כזה (שאישית זה עיצבן אותי) אבל אין לו בעיה לחזור על עצמו אלף פעמים עד שתבינו.\nקיצור ההרצאות לא פשוטות בכלל. אם מתמידים אז קולטים מה שחשוב.\n\nשם המתרגל/ת: אלעד גיפס + ראזי\nחוות דעת - תרגולים: השנה התרגולים היו בסגנון של כיתה הפוכה, יש את ההקלטות של ראזי (לא מתרגל את הקורס יותר) שהן אחלה, הוא מסביר את הכל מההתחלה בצורה יותר פשטנית, עדיין לא לוותר על ההרצאות מאוחר והמבחן + הבוחן הם לרוב נטו חומר של הרצאה וקטע של הבנה לעומק של כל הדיאגרמות, הבקרים, תגובה דינמית ויציבות המערכות השונות. בסוף כל הקלטה ראזי עובר על כמה תרגילים מתרגיל הבית ונותן כל מיני טיפים ופקודות למטלב שיעזרו לכם לפתור.\nויש את אלעד שהוא נשמה, לאחר הצפיה מגיעים לכיתה לפתור איתו את השאלות שלא הצלחתם מתרגיל הבית, הוא גם חוזר על כל חלק שתרצו מההקלטות מרחיב על זה בסבלנות ומוסיף הסבר מעבר לזה של ראזי. \n\nמעבדות: חשוב מאוד להיות נוכחים במעבדות (זה לא מעבודת של דוחות) הן ממש חשובות לשיעורי הבית ולמבחן שאותו עושים על המחשב, שם לומדים כל הקודים והפקודות שצריך להכיר בנוסף מנסים לתרגל וללמוד איך לתכנן במטלב ולהריץ סימולציות בסימולינק.\n\nשעורי הבית: כל שבוע גיליון של כמה שאלות ממליצה בחום לפתור לבד, לא לרפרנס, לשבור את הראש על זה כמובן ייקח מלא זמן אבל משתלם בסוף כשמתכוננים לבחינה. בכל מקרה ראזי מסביר קצת על כמה תרגילים מהגיליון בסוף של כל הקלטה, ואלעד פותר את מה שלא מצליחים בכיתה והוא תמיד זמין במייל. חבל שזה רק 5% מהציון הסופי.\n\nפרויקטון: השנה לא עשינו בגלל שביתת המרצים.\n\nהמבחן: מצטטת מחוות דעת לפני: \"המבחן הסופי בקורס היה לא פרופורציונלי לשלוש שעות בשום צורה. שאלות ברמה יותר גבוהה מהנלמד בתרגולים ובהרצאות ומכל מבחן שהיה לפניו.\"\nמציינת שגם לאחר הפקטור המטורף שהיה וכל השינויים שהיו במשקל השאלות עדיין התקבל ממוצע נמוך.\n \nמועד א': מאוחר ולא עשינו תפרויקט משום מה הוא החליט להפתיע אותנו בשאלה שלמה על תכנון ומימוש פיזיקלי שזה נטו חומר של הפרויקט. לכן מותר להגיד שהמועד הזה לא היה פייר. \n\nמועד ב': אותו סגנון ואותה רמה כמו א'. שתי שאלות תכנון בקר קל וטכני אם הצלחתם לייצב את החוג ולעמוד בדרישות מהפעם הראשונה ללא תיקון ותכנון חוזר, שאלה 4 היא תמיד בודקת את הבנת הסטודנט לחומר ומי שהשקיע במהלך הסמסטר אין לו סיבה שלא יצליח לפתור. \n\nהשורה התחתונה: קורס לא קליל בכלל, still, חומר ממש מעניין למי שאוהב מידול, בקרה ואופטימיזציה של מערכות. אחד הקורסים שהכי התחברתי אליהם עד עכשיו. הקורס דרוש יותר מהמקסימום שלכם, אז להתכונן...\n אפשר להוציא 85+", "timestamp": 1702746912118}]}