{"posts": [{"author": "רן", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חזי גריסרו\nחוות דעת - הרצאות: מצוינות. מעבר לעובדה שהחומר מאוד מעניין וסדר ההוראה מדויק, חזי מבין מהי נקודת הפתיחה של הסטודנטים בקורס שלו ובונה את הקורס בהתאם. אם תשקיעי מאמץ ותגיעו להרצאות (מומלץ) אין ספק שאת הקורס תסיימו כשהידיעות שלכם בקורס מצויינות.\n\nשם המתרגל/ת: עולא ותד\nחוות דעת - תרגולים: התרגולים הועברו לראשונה הסמסטר, סך הכול היו 5 תרגולים והם היו מפורטים וטובים מאוד.\n\nשעורי הבית: 5 תרגילים בית ופרויקט.\nהתרגילים ארוכים ודורשים הרבה עבודה, כולל תכנות (מטלב) אבל העומס בא לידי ביטוי בציון הסופי בנתח הגדול שהתרגילים תופסים (50%) להבדיל מקורסי בחירה אחרים. התרגילים מאוד מלמדים ועוזרים ליישם את החומר.\nהפרויקט הוא פרויקט אישי לכל סטודנט כאשר כל אחד בוחר נושא ספציפי מעולם התוכן של הקורס ומכין מצגת ודף עם פירוט החישובים, המטרות, מסקנות וכולי. גם כאן מדובר במטלה עמוסה עם נפח גדול בציון (30%).\n\nהמבחן: מדובר בבוחן שמהווה 20% מהציון.\n\nהשורה התחתונה: קורס מעולה ומומלץ לכל סטודנט בפקולטה. מפתח את המחשבה ומרחיב את הידיעות בחישובים דינמיים של מבנים.", "timestamp": 1676559190593}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חזי\nחוות דעת - הרצאות: מכסים המון חומר בהרצאות (הדף, דינמיקה, נומריות, תכן, ועוד...) ונכנסים בכל נושא יחסית לעומק.\nהרצאות אורח נחמדות, לא קריטיות למבחן, אבל הנטייה של חזי היא לתת פרויקטים שהנושאים שלהם הם בין היתר מה שדובר עליו בהרצאות אורח.\nאין נוכחות חובה בהרצאות, אבל שחררו מהמנטליות של הלחץ של קורסים של תואר ראשון, זה לא ככה כאן. מומלץ מאוד להגיע להרצאות אם אתם רוצים להצליח את התרגילי בית. (התרגולים לא מספיקים בשביל לפתור אותם)\n\nשם המתרגל/ת: עולא\nחוות דעת - תרגולים: 5 תרגולים, התרגולים ה\"לחוצים\" יחסית הם בנושאים שאמורים להיות לכם כבר ידועים כמו דינמיקה למשל. התרגולים הם ה\"ליבה\" של הפתרון של תרגילי הבית.\n\nשעורי הבית: 5 הגשות, לא \"קלות\" כמו שחזי מנסה לצייר אותן.\nארוכות, קריטיות למבחן- אז תעבדו מסודר (במבחן אתה ממש פותח את ההגשות ואת התרגולים)\nבהגשות האלו, חזי מנסה לכפות על הסטודנטים לצאת מאיזור הנוחות של רק הרצאות ותרגולים והוא רוצה שממש תפתחו את ה*ספר* של הקורס UFC 340 ותבינו איך להשתמש בספר הזה (לא מדע טילים, ברגע שנופל האסימון זה שטויות)\n\nהמבחן: אי אפשר להגיד קשה על המבחן, שאלות מסוימות היו 1 ל-1 מה שהיה בתרגולים.מה שכן, במועד א' שלנו חזי הביא יציאה של סעיף ששווה 15 נקודות שלא היינו ערוכים אליו בלשון המעטה. (ועל הסעיף הזה בנה עוד סעיף של 15 נקודות, שהוא כבר היה פתיר)\n\nפרויקט:\nכל אחד או זוג מקבל פרויקט על נושא ספציפי (כל צוות מקבל נושא אחר) שחזי ועולא בוחרים (שכבות הקרבה, תכנון של גשר היו אצלנו למשל... שמות מפוצצים אבל זה לא מדע טילים, אין מה להיות בלחץ)\nיש הצגה של הפרויקט מול שאר הכיתה על הנושא שמקבלים עליה ציון, ועוד הגשה של דו''ח שמקבלים עליו ציון גם כן.\n\nהשורה התחתונה: \nמבחן 35% מהסופי, פרויקט 20% מהסופי, הגשות 45% מהסופי.\nזה הקורס הכי טוב שתוכלו לקחת בקבוצה א'. כן, הוא כבד בסמסטר, אבל הוא מעניין, וזה הקורס היחידי בכל ה-4 שנים האלה שלא הרגיש כמו סיר לחץ. אני לא חושב שיש סטודנט אחד שעשה את הקורס שיכול להגיד אחרת.", "timestamp": 1715514297567}]}