{"posts": [{"author": "Omri Bar-Asher", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nאורן לבן\nחוות דעת - הרצאות: \nחלקן ממש לא פשוטות להבנה, אורן לא מוכן לשתף הקלטות וקשה לסכם הכול תוך כדי. זה ממש מעצבן כי 15 נקודות מהמבחן הן על זה.\nשם המתרגל/ת: \nאוהד ואמיר\nחוות דעת - תרגולים: \nסבירים. בחלקם הייתה ריצה ב\"בריף\" על הדברים ולא הספקנו בכלל להבין מה לשאול את המתרגל. גם חלק מהמצגות עשויים חצי כוח וזה ניכר.\nשעורי הבית: \nלא כבדים, יש פרויקט ב-3 חלקים\nהמבחן: \nקשה! היה לנו ממוצע 55 במועד א. הקורס לא מכין טוב לרמה של המבחן.\nהשורה התחתונה:\nקורס מאוד חשוב (צריך להיות חובה) כי מי שהולך לתכן בהכרח יצטרך לדעת את החומר הזה, מה גם שבפרויקט גמר צריך לחשב לרעידות אדמה. חבל מאוד שזה היחס לקורס בחירה וזו רמת ההצלחה של הסטודנטים. אני מדרג מומלץ כי החומר חשוב.", "timestamp": 1648708165218}, {"author": "Anonymous", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורן לבן\nחוות דעת - הרצאות: הן בסך הכול בסדר ורק בסדר. עמוסות בידע תיאורטי שחשוב להבנת התחום (בזה אין ספק). המצגות לא מכילות את כל החומר ודווקא הדברים שאורן אומר בעל פה יופיעו בחלק התאורטי במבחן (טקטיקה שכזו).\n\nשם המתרגל/ת: אוהד אידלס\nחוות דעת - תרגולים: אי אפשר לומר שהתרגולים טובים. התרגולים קצרים מאוד, רובם מסתיימים אחרי שעה בלבד מתוך שעתיים (שזה כיף במהלך הסמסטר אבל עוד מעט תבינו למה לא) ושמים דגש על תרגילים ברמת התכן שזה מאוד חשוב אבל גם מאוד לא מחובר למבחן. בתרגולים לא פותרים תרגילי מבחן (למרות שיש שעה ספייר אז לגמרי אפשר), וכל הטריקים והשטיקים במבחנים בכלל לא מתורגלים והציונים בהתאם.\n\nשעורי הבית: קצרים, קלים, יש רק שלושה כאלה. הם לא עוזרים לחומר לשקוע ורחוקים שנות אור מרמת המבחן.\n\nהמבחן: המבחנים של אורן נולדו כדי להכשיל סטודנטים (אומר זאת בתור סטודנט שלא נכשל) ואסביר:\n- יש המון טריקים הזויים, מבנים מוזרים ודרישות שמעולם לא עלו בתרגול או בהרצאה וגם אין להם הרבה קשר לאנליזת רעידות אדמה למבנים (בקיצור, רחוקים מאוד מתכן מעשי).\n- יש כל מיני קטנות שמצפים שנדע אבל לא עברו עליהם איתנו, יש סיכוי טוב שאתם פותרים מבחנים וחושבים שמצבכם מעולה ואז מגלים שהמצב ממש לא כך כי היה איזה תכסיס שלא הבחנתם בו מעולם, וגם אין דרך לבקר את זה כי כל הסריקות נוראיות.\n- אורן אומר, ואני מצטט: \"אני לא מאמין בללמוד למבחן בתרגול של מבחני עבר\" כאשר הוא מלמד את הקורס שזה כנראה הכי נדרש בו כי הפער בין ההרצאות והתרגולים למבחן הוא עצום.\n\nהשורה התחתונה: את האמת לא מרגיש שלמדתי הרבה על רעידות אדמה. לא מבין מה ה'הייפ' של משרדים סביב הקורס הזה והדרישה שלהם שנלמד אותו. הייתי מוותר עליו בשביל קצת שלוות נפש והפחתת תסכול.\n\nלדעתי הקורס הזה צריך מתיחת פנים מטורפת, החל בבניית התרגולים מחדש. מישהו אולי צריך לדבר עם אורן כי הוא לטענתו לא מבין למה הממוצעים שלו כאלה נמוכים (באנקר 55) - אולי כי אף אחד לא מכין אותנו למבחנים שלך?", "timestamp": 1676975920178}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורן לבן\nחוות דעת - הרצאות: חשובות מאוד ומעניינות. חשוב להקשיב ולרשום הערות.\n\nשם המתרגל/ת: אהד אידלס\nחוות דעת - תרגולים: מתרגל טוב, מעביר את החומר בצורה טובה ומאוד בקיא בחומר. \n\nשעורי הבית: קצרים ודי קלילים. גם הפרויקט. הקורס הכי לא מעמיס במהלך הסמסטר.\n\nהמבחן: קשוח. חשוב *להבין* את החומר טוב מאוד. ללמוד ולהבין את הפרויקט לעומק כי תמיד יש שאלה דומה, מפתה לרפרנס אבל מי שעושה את זה ייפול בסוף!\nחשוב לחזור על ההרצאות והתרגולים ואז לתרגל טכניקה. אם מנסים לפתור רק בעזרת טכניקה בלי להבין - נופלים.\n\nהשורה התחתונה: קורס שצריך להיות חובה למי שרוצה ללכת לקונסטרוקציה. יש הרבה דברים בתקן שהם לא לגמרי מדוייקים  או נכונים בכל המקרים, אז אם רוצים להיות מהנדסים טובים ולא ברמה של הנדסאים, חובה לקחת את הקורס הזה.", "timestamp": 1716984399771}]}