{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: עודד אמיר\nחוות דעת - הרצאות: בגדול החומר והקורס מעניין, אבל עודד מסבך הכל כמו תמיד, מנסה לשלב אלף ואחד דברים אל תוך קורס אחד. מנסה לשלב תקן ישראלי ותקן אירופאי ופשוט עושה סלט.\nבנוסף, יש שני שיעורי הכנה במהלך הסמסטר שהיה צריך לעשות.\n\nשם המתרגל/ת: יונתן ולידור\nחוות דעת - תרגולים: חצי מהקורס היה סדנאות בנוגע לפרויקט והחצי השני היו תרגולים רגילים. בכל מקרה, שני המתרגלים לא מדהימים ברמות. יש מוקלטים של מג'ד והוא מעולה ומסביר הכל בצורה מאוד טובה ונותן טיפים למבחן. \n\nשעורי הבית: סיוט אחד גדול. בסמסטר שלנו עשינו 4 חלקי פרויקט בדריכת קדם ועוד פרויקט בדריכת אחר (שעודד קורא לו פרויקטון למרות שהוא ממש לא קטן!). \nהם לא בדקו את הפרויקט לפני שנתנו לנו אותו וזה יצר בלגן מאוד גדול. למשל החלק השני של הפרויקט לקח לנו איזה חודש לעבוד עליו, והצוות נתן לנו הארכה פעמיים כי הם לא ציפו שזה יהיה כלכך ארוך. שורפים את הזמן חבל על הזמן! \nומה עוד, בגלל שהסמסטר היה קצר מהרגיל (מלחמת חרבות ברזל..) אז היה לנו להגיש עוד שני פרויקטים בתקופת מבחנים!!\n\nבתחילת הסמסטר היה על הפרויקטים 35% ובגלל שעבדנו עליהם כל כך הרבה הגדילו את האחוז ל 50% (הוסיפו 15% מגן). \n\nהמבחן: ארוך! אבל די בסדר. לא כל כך קשה.\n\nהשורה התחתונה: הקורס משלב הרבה חוזק ומאמצים ומעניין למי שאוהב חוזק, אבל ממש ממש ממש ממש ממש סיוט מבחינת פרויקטים וצוות הקורס כי עודד חושב שהוא מלך העולם ואין אף קורס מלבד הקורסים שלו. הוא מעמיס כל כךךךךךךךך על הסטודנטים ופשוט הופך את זה למעיק ביותר! מי שלא חייב להתרחק כמו מאש!!!!!!!!!!!!!!!!!! באמת התחרטתי שלקחתי את הקורס מאוד מעמיס במהלך הסמסטר ופוגע בקורסים אחרים (במיוחד בשילוב עם רעידות ובניית המהנדס). היה עדיף לקחת אלסטיות רק מי שרוצה להתעסק בגשרים צריך לקחת ובהצלחה לכם חחחח", "timestamp": 1715098812619}, {"author": "Avigail Siman Tov", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: פרופ\"ח עודד אמיר\n\nשורה תחתונה: ממש מעניין אבל לא שווה את הטרחה\n\nהרצאות מעניינות, חומר מעניין.\nקורס תכן שמתעסק ישירות בתיאוריה (הרבה חוזק) ולא רק בנוסחאות אמפיריות שנקבעו בתכן, שזה די נחמד.\n\nהמבחן לא קשה אם יש מספיק זמן ללמוד אליו, אם יודעים לחשב מאמצים ואם מבינים את הרעיון בחומר - המבחן די טכני והבעיה הכי גדולה בו היא זמן.\n\nהקאטצ': יש רק \"סדנאות\" שזו מילה יפה ל\"אין תרגולים ואין שיעורי בית עם תרגילים פשוטים יותר שיכינו אתכם לפרויקט או למבחן\".\nשני פרויקטים גדולים: אחד מהם מחולק לארבע הגשות והשני דומה לראשון בנתונים ובמשימות (ובנפח!!) אבל עם סוג דריכה שונה.\nחלק מהגשות הביניים לקחו לאנשים הטובים מבינינו מעל חודש. ההוראות לא ברורות מספיק, ויש דברים שצריך לדעת פשוט כי ענו עליהם לבן אדם אחד בסדנה. אני אישית עשיתי על כל הגשת ביניים משהו כמו שני לילות לבנים, לא כולל השעות ששרפתי עליהן לפני זה.\nאם היה אפשר לדרג את עומס הקורס ביותר מ-5 הייתי מדרגת אותו 18 לפחות (ואין מי שלא יסכים איתי).\n\nמומלץ רק למי שרוצה לתכנן גשרים.", "timestamp": 1715423825904}]}