{"posts": [{"author": "שחר פדר", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רזי אפשרטיין\nחוות דעת - הרצאות: עבר בזום- הרצאות מסודרות שמעבירות את החומר מסודר, לא תמיד הכי מעניין דרך הזום...\n\nשם המתרגל/ת: נירית\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613486884983}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רזי אפשטיין\nחוות דעת - הרצאות: הרצאות די יבשות הוא מקריא את המצגת. המצגות מלאות בכל החומר הנדרש ולפעמים עמוסות במלל אבל לא נוראי. חשוב מאוד ללמוד את התאוריה כי יש במבחן גם שאלות הבנה ולא רק חישובים.\n\nשם המתרגל/ת: נירית דנה כהן\nחוות דעת - תרגולים: תרגולים חשובים מאוד, שאלות קשות ומורכבות שצריך להיות על זה במשך הסמסטר כדי להצליח במבחן. \n\nשעורי הבית: פעם בשבועיים יש ש.ב. לשבועיים על הנושאים של התרגולים, לא קשים מידי ומיישמים את החומר. \n\nהמבחן: מבחן מורכב גם משאלות חישוביות וגם משאלות פתוחות על ידע עיוני. שי חוזרים על אצמם משנים קודמות במבנה ובעומס, תמיד יש שאלה אחת ארוכה ועוד 2-3 קטנות יותר.\n\nהשורה התחתונה: קורס מעיניין ורלוונטי מאוד בעיקר בידע העיוני של תהליכים ביולוגיים, החצי השני של הקורס יותר מעשי על תכנון ראקטורים.", "timestamp": 1645535110182}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רזי אפשטיין\nחוות דעת - הרצאות: \nהרצאות חשובות, עוזרות להבין את התהליכים הביולוגים בריאקטורים ובעיקר בשפכים. המצגות של רזי מאוד ברואות. הוא מדבר קצת לאט אבל ברור.\nשם המתרגל/ת: הן נ\nחוות דעת - תרגולים: \nחשוב כדי להבין איך התאוריה באה לידי ביטוי בחישובים\nשעורי הבית: \nהגשה חובה, ועוזר להתכונן למבחן.\nהמבחן: \nמבחן עמוס, 4 שאלות חישוביות ושאלה אחת עם סעיפים של נכון לא נכון. למרות העומס מבחן הוגן מאוד, לא לבנות על דף הנוסחאות שלהם.\nהשורה התחתונה:", "timestamp": 1648458926221}, {"author": "בורג", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רזי אפשטיין\nחוות דעת - הרצאות: מרצה טוב, לא חובה להגיע להרצאות אבל שווה\n\nשם המתרגל/ת: נירית האלופה\nחוות דעת - תרגולים: תרגולים חשובים! \n\nשעורי הבית: יש יחסית הרבה ושווה לעשות ולהבין ולא רק לרפרנס\n\nהמבחן: לא קל, דורש הבנה\n\nהשורה התחתונה: קורס של הבנה, לא מעט חישובים ומעברי יחידות. סך הכל יחסית מעניין", "timestamp": 1713375921563}]}