{"posts": [{"author": "א", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: דן מורדכי\nחוות דעת - הרצאות: \nמאוד עמוסות עם הרבה מתמטיקה והרבה אינטואיציה, לא פשוטות וכדאי לחזור עליהן במהלך הסמסטר כדי שהחומר ישקע\n\nשם המתרגל/ת: אלישע בוידאו\nחוות דעת - תרגולים: \nהמתרגל בוידאו נהדר, מומלץ מאוד.\nשעורי הבית: \nגליונות במודל, יש קלים ויש עמוסים, מומלץ לעשות לבד.\nהמבחן: \nדן לא מרחם בכלל", "timestamp": 1598430435604}, {"author": "גל", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: מסביר לאט אבל מובן. מעודד שאילת שאלות. מתרגל מעולה סה\"כ\n\nשיעורי הבית: לא קלים \n\nהמבחן: לא יודע עוד לא עשיתי\n\nהשורה התחתונה:", "timestamp": 1612524724466}, {"author": "עכבר", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: \nיודע ללמד את החומר אבל אכזרי ממש במבחנים, המבחנים שלו קשים ובלתי פתירים\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: יודע ללמד בצורה מעולה \n\nשעורי הבית:  קשים מאוד, יש רפרסנים\n\nהמבחן:  קשה מאוד\n\nהשורה התחתונה:  תתפללו לא לקחת את הקורס שספי מרצה אחראי!!", "timestamp": 1614340412341}, {"author": "חנה סמואלס", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אמיל בורנשטיין\nחוות דעת - תרגולים: מדהים!!!!!! חייבים ללכת אליו.\n\nשעורי הבית: יש אקסל\n\nהמבחן: מזעזע.\n\nהשורה התחתונה:", "timestamp": 1615203170929}, {"author": "Guy Sonenzon", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: מרצה מעולה, מסביר מצויין, קצת חסר סבלנות לשאלות של סטודנטים\n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: מתרגל מעולה, ממש ברור ומסביר בפשטות\n\nשעורי הבית: \nסבבה ממש, לפעמים קצת מוזרים ועם שטויות מעצבנות אבל לא מהותי\nהמבחן: \nלא פרופורציונלי למה שנלמד בקורס, חמש רמות מעל כל דבר שנתקלים בו במהלך התרגולים וההרצאות\nהשורה התחתונה: \nקורס מעניין וחשוב שיצא מכל פרופורציה", "timestamp": 1615592295200}, {"author": "סטודנט/ית", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: מרצה מצוין, מאוד מעמיק בנושאים השונים ולרוב דואג גם לחבר אותם לתחומים מוכרים מחיי היומיום.\n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: מתרגל מדהים, יודע להנגיש את החומר בצורה מובנת ולהדגיש את מה שחשוב לקורס.\n\nשעורי הבית: לא קלים, אבל מחזקים את החומר.\n\nהמבחן: קשוח מאוד, לא הייתי מתנגד למבחן קצת קל יותר. אפילו הייתי מתאר כאחד הקשים בתואר.\n\nהשורה התחתונה: קורס קשה מאוד, אבל מעניין וחשוב להמשך הדרך.", "timestamp": 1645199728118}, {"author": "shay rhiner", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: הרצאות מעולות עוזרות להבין את החומר בצורה טובה\nשם המתרגל/ת: אמיל- \nחוות דעת - תרגולים: ללכת רק לאמיל המתרגל היחידי שמסביר בצורה טובה ולא מקריא מדף\n\nשעורי הבית: סבירים לוקחים הרבה זמן ולפעמים יש שאלות מוגזמות\n\nהמבחן: לא סביר בשום צורה \n\nהשורה התחתונה: כדי לעבור את המבחן צריך להשקיע כמה ימים בשבוע", "timestamp": 1645971804138}, {"author": ":)", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: מרצה נהדר, מסודר ומעביר את החומר בצורה ברורה תוך שילוב דוגמאות והדגמות במהלך ההרצאות. מומלץ מאוד לחזור על ההרצאות ולהפנים את עיקרי הדברים והפיתוחים שבוצעו במהלך ההרצאה. בנוסף, מומלץ מאוד להעשיר ולחזק מידי פעם נקודות בחומר מבחינה תיאורטית בעזרת ההקלטות של ליפשיץי, הוא מעמיר מאוד ונותן אינטואיציה טובה.\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: בין המתרגלים הטובים שיש לפקולטה להציע. עונה על כל שאלה ויתעקש שתבינו את החומר. יודע להיכנס לנעליים של הסטודנט ויודע כיצד להכווין כל אחד ואחת להשתפר. \n\nשעורי הבית: גליונות מודל על בסיס שבועי, ארוכים, מתישים אך חשובים מאוד בתהליך הלמידה.\n\nהמבחן: קשוח, מאתגר ובכמה רמות מעל הנלמד במהלך הסמסטר. כשספי כותב את הבחינה אי אפשר לצפות לכלום כי בכל פעם הוא \"ממציא מחדש את הגלגל\" ואף פעם לא כותב שאלות בסגנונות שחוזרים על עצמם. \n\nהשורה התחתונה: לכו לשעות קבלה ותעשו את השיעורי בית עם כמה שפחות רפרנסים. לכל מבחן יש אופי אחר וכמעט ואין מוטיבים חוזרים. הדרך היחידה להצליח היא באמת להבין את החומר ברמה גבוהה לעומק, ולכן ההתמודדות עם תרגילי הבית ועם פתירת מבחנים באופן עצמאי לקראת הבחינה קריטית.", "timestamp": 1646955907727}, {"author": "Alen", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: מרצה מעולה , לדעתי כל הרצאה הייתה יותר מעניינת מההרצאה הקודמת , בנוסף מאוד סבלני כלפי שאלות . מנהל את ההרצאה בצורה מאוד מקצועית וכיפית .\n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: מתרגל מצויין , יודע להסביר בצורה מדוייקת ומפורטת את הדרך לשימוש בחומר התיאורטי שנלמד בהרצאה , יודע לשים דגש על הדגשים הקטנים שמתפספסים בחומר .\n\nשעורי הבית: בהתחלה הם מהירים וטכניים ועם הזמן הם נעשים ליותר ויותר מחשבתיים ודורשי זמן . בגדול הם מלמדים אך הם רק נותנים את הפוש ההתחלתי לשליטה טובה בחומר.\n\nהמבחן: קשה , בכל מובן קשה , דורש הבנה מאוד מעמיקה של החומר יחד עם יעילות גבוהה לפתרון שאלות ללא טעויות בחישובים ארוכים . קפיצה מטורפת מהתרגולים ומההרצאות , דורש הכנה קפדנית ועמוקה .\n\nהשורה התחתונה: קורס מאוד מעניין עם סגל מטורף , אך הקושי שלו הוא דבר שלא נתקלתי בו באף קורס עד כה .", "timestamp": 1647266633348}, {"author": "המשמיד", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: \nספי מרצה מאוד טוב, לפעמים מרגיש שהרצאה של שלוש שעות יכולה להיות גם 5 דקות, אבל זה נטו כי בהרצאות במוצקים 2 עוסקים בפיתוחים. ההרצאות עצמן הן בונוס, הן מוסיפות רקע לידע של הקורס, אבל בתכלס, רק הפואנטות שאליהן מגיעים מכל הפיתוחים הן מה שמשנה.\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: \nאמיל מתרגל מאוד טוב, אם לא הכי טוב. באמת ממליץ ללכת רק אליו. התרגולים בקורס מאוד חשובים כי הם נותנים את כל הפרקטיקה לקורס, וזה מקצוע שהוא טכני והבנתי מאוד.\n\nשעורי הבית: \n12 גליונות מודל, מתוכם 10 נבחרים. מאוד דומה למוצקים 1. רוב הגליונות ארוכים ויש בהם אלגברה לא סימפטית במיוחד, שבספק שתמצאו משהו קרוב אליה במבחן.\n\nהמבחן: \nמבחן לא עביר בעליל, הממוצע קורס שלנו היה עובר. הבמנה בחינה עצמו זהה למוצקים 1. מה שקורה לאחר הבחינה נבדקת היא שספי מסתכל על התוצאות, משחק עם הסעיפים והופ- הממוצע עולה קצת. לא באמת יודעים איך בוצע השקלול הסופי לציון הבחינה. מלבד זה מבחן זוועה של שלוש שאלות ושלוש שעות לפתור אותן, הוא אמריקאי עם חובת דרך ככה שאין לא את היתרון של אמריקאי ולא את היתרון של מבחן פתוח.\n\nהשורה התחתונה: \nאם אתם ממכונות, אז אין לכם יותר מדיי ברירה, ממליץ לשבת על התרגולים טוב ולתרגל מלא לפני הבחינה (למרות שזה גם לא ככ עוזר). אם אתם לא ממכונות, לא ממליץ לאף אחד :(", "timestamp": 1647430177003}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  ספי\nחוות דעת - הרצאות: מרצה נהדר. אשכרה יוצאים מההרצאה עם ידע ושיט.\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: מתרגל טוב, מסביר סבבה ופחות או יותר במסודר.\n\nשעורי הבית: קשים, ארוכים, רמה מעל התרגול.\n\nהמבחן: קשה, ארוך, רמה מעל השיעורי בית.\n\nהשורה התחתונה: נכשל", "timestamp": 1649882256243}]}