{"posts": [{"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: איל זוסמן\nחוות דעת - הרצאות: מרצה לא הכי ברור. 95% מהחומר התכלס מופיע בתרגולים, אבל המרצה נוהג להכניס למבחן משהו שעובר בעל פה בהרצאות (לא בתרגולים ולא בשקפי ההרצאה). חוץ מזה, החומר יחסית קליל ולדעתי מעניין. הנושאים כמעט נפרדים לגמרי אחד מהשני (לעומת קורסים שבהם צריך להשתמש בחומר של שבוע 1 כדי להבין את שבוע 2).\n\nחוות דעת - תרגולים: ה-pdf-ים של התרגולים ברורים וסוגרים את הפינה של \"מה רוצים ממני בתכלס\"\n\nשעורי הבית: מצד אחד יחסית קלילים, מצד שני שאלות די פתוחות ולא תמיד היה ברור מה נדרש.\nהפרויקט היה נחמד ומעניין, קצת עמוס בכמה שבועות שעובדים על זה.\n\nהמבחן: היה ארוך מדי בשביל הזמן שניתן, כנראה בגלל שינויי קורונה.\n\nהשורה התחתונה: קורס נחמד, אבל המרצה קצת תופס אותך בקטנות. קורס (חובה אז תתעלמו מהדירוג הכללי)", "timestamp": 1597830979351}, {"author": "asdf", "difficultyRank": 2, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אייל זוסמן\nחוות דעת - הרצאות: \nחשוב להיות בהן, שואל שאלות מהמבחן על דברים שנאמרו בהחת מההרצאות ולא דובר בכלל בשום מקום אחר.\n\nחוות דעת - תרגולים: \nעוזרים בהבנה של החומר אבל מקיפים רק חצי מהחומר, השאר אמורים להין לבד מההרצאות וכח האל.\nשעורי הבית: \nלא מסובכים, כבונוס.\nהמבחן: \nקשוח, דורש לעבור על ההרצאות עצמן ושאלות מוזרות שניתנו פעם אחת במבחן לפני 38 שנים.\nהשורה התחתונה: \nהחומר עצמו די מעניין אבל כקורס: תלכצ מגעיל מגעיל", "timestamp": 1600434627646}, {"author": "Amit Ashkenazi", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: פרופ. איל זוסמן\nחוות דעת - הרצאות: \nמשעמם, אבל הטריקים במבחן מגיעים בדיוק מההרצאות. בנוסף, בערך כל מה שעושים בתעשייה איכשהו קשור לקורס, אז כן כדאי לדעת בגדול מה הולך\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא להגשה, אך מועילים כהכנה למבחן\nהמבחן: \nמיחזר שאלות, סך הכל פתיר.\nהשורה התחתונה: \nפרויקט היה מגניב, צריך להתכונן נפשית לשבוע עמוס לקראת סוף הסמסטר", "timestamp": 1602696126693}, {"author": "אביבוש 2021", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אייל זוסמן\nחוות דעת - הרצאות: \nלאייל יש כוונות טובות אבל הוא לא לגמריי סגור על עצמו. דורש דברים שהוא בעצמו לא סגור מה הוא מצפה לקבל כתשובה.\n\nשם המתרגל/ת: דני/שלום - זה לא באמת משנה\nחוות דעת - תרגולים: \nלא ברורים בשיט, הם לא סגורים בעצמם על מה הקורס הזה\n\nשעורי הבית: \nהיה 5 תרגילי בית עמוסים, משעממים ולא ברורים, המתרגלים בעצמם לא היו סגורים מה התשובות עד שהגיע זמן הבדיקה ואז הם שחטו בציונים...\nהיה גם פרוייקטון ממש מעניין על מסכה, אבל אותו סיפור... לפחות שם היה יותר חופש ביטוי אז פחות יכלו לשחוט על \"הבנה\" של החומר הנלמד\n\nהמבחן: \nלא היה, וטוב שככה...\n\nהשורה התחתונה: \nקורס שאמור להיות מעניין ובסיסי הפך לביזיון אחד גדול. לפחות  הוא טוב לממוצע כשאין מבחן...", "timestamp": 1626088002379}, {"author": "האווז", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nאייל זוסמן\nחוות דעת - הרצאות: \nבחר להפנות להקלטות בסמסטר פרונטלי, ובהרצאות זום שלו דיבר על הפרויקט. משמע יצא שקיבלנו שעות הרצאה כפולות- גם הרצאות עבר על החומר והרצאות הווה על הפרויקט. \n\nשם המתרגל/ת: \nלא רלוונטי.\nחוות דעת - תרגולים: \nרק הקלטות, לך תבין. לא יעיל וחבל. דווקא בקורס, כביכול, מעשי.\n\nשעורי הבית: \nיותר מדי, גם 5 גליונות ש\"ב כבדים וגם פרויקט. מרגיש לי שלא לימדו והסבירו לנו מספיק טוב מה הם רוצים באמת שנעשה/איך לפתור.  אבל, לפחות לא היה מבחן. \n\nהשורה התחתונה: \nקורס שחשבתי שאמור להיות מעשי, בדגש על פרונטלי, ע\"מ שבאמת נלמד את החומר. החומר בעיניי חשוב ולפעמים גם מעניין, אבל כל הפוקוס בקורס היה על הדפסת 3D. בעיניי בזבוז של קורס וזמן.", "timestamp": 1626107058814}, {"author": "זוסמן", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אייל זוסמן\nחוות דעת - הרצאות: לא היה הרצאות, שלח אותנו להקלטות שלו משנה שעברה,פעם בשבוע העביר שעת קבלה במקום ההרצאה, התעסקות בעיקר בפרויקט פחות בגליונות.\n\nשם המתרגל/ת: שלום שוחאט\nחוות דעת - תרגולים: תרגולים מוקלטים משנה שעברה, מתרגל שזמין לשאלות ולעזרה בגליונות הנוראיים של הקורס.\n\nשעורי הבית:  זוועה, אין כמעט רפרנס, צריך לשבור את הראש על גליונות לא ברורים, ללכת לשעות קבלה ולסחוט תשובות מהמתרגלים.\nהיה פרויקט מעניין מאוד בהדפסת תלת מימד, 70% מהציון.\nהמבחן: אין, זה המזל. \n\nהשורה התחתונה: קורס עמוס, לצערי לא למדתי ממנו יותר מדי על הדברים הפרקטיים של עולם היצור. קורס חובה ובמתכונת הנוכחית די קורס מתנה.", "timestamp": 1626161245686}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איל זוסמן\nחוות דעת - הרצאות: זוסמן בחור עם ידע אדיר ושווה להקשיב לו\n\nשם המתרגל/ת: סופיה קופרמן\nחוות דעת - תרגולים: לא באמת היו תרגולים, אלא שעות ייעוץ והכוונה לגבי הפרוייקט.\n\nשעורי הבית: יש פרוייקט גדול הדורש השקעה רבה, אך משתלמת.\n\nהמבחן: אין\n\nהשורה התחתונה: לקחת בחורף עם זוסמן", "timestamp": 1651663033551}, {"author": "ליאור ליאון", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה:אלכסנדר\nחוות דעת - הרצאות: ממש לא ברור מה קורה שמה... ולא צריך להיכנס כדי לעבור את הקורס. אבל כדי לקבל ציון טוב צריך לדעת די בעל פה את החומר בהרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חובה לעשות, הדרך היחידה לעקוב אחרי מה שקורה בקורס- אני השלמתי תרגולים לפני השיעורי בית , זה נותן די הרבה ככה\n\nהמבחן: אמריקאי, בחישובים זה נוסחאות די קלילות להצבה, תמיד יש איזה קאץ' שצריך לעלות עליו. הרבה שאלות נכון לא נכון שצריך לשרוק את ההרצאות בעל פה בשביל לענות עליהם נכון", "timestamp": 1657179370048}, {"author": "איש", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה:  אלכס\nחוות דעת - הרצאות:  לא קוהרנטי בשום צורה,מסביר מושגים שאתה לא מכיר אם מושגים אחרים שאתה לא מכיר, כנראה אחד המרצים הכי גרועים שהיו לי ויש תחרות טובה לטייטל הזה.\n\nשם המתרגל/ת: אין תקווה באזור הזה כולם גרועים\nחוות דעת - תרגולים:  אף אחד מהסגל לא קוהרנטי אבל ספציפית שלום גם לא קוהרנטי וגם לפעמים שוכח שיש תרגול.\n\nשעורי הבית: \n3 גליונות בלי שום חיבור לחומר הנלמד, לא בדקו עד יום לפני המבחן, כמו כן היה לנו מעבדות בתחילת הסמסטר שעדיין לא קיבלנו עליהם תשובה, זריקת הזין הכי גדולה שראיתי.\nהמבחן:  אמריקאי, היו טעויות בכמה שאלות אז הם \"עשו לנו טובה\" ובדקו גם דרך שאמרו שלא צריך לכתוב כי הרי אין להם דרך לבדוק שאלה אמריקאית בלי תשובה נכונה... אבל לפחות פקטרו בשמונה נקודות... \n\nהשורה התחתונה: מהיוצרים של שרטוט ידני ואנליזה נומרית, הקורס זבל של סמסטר ד'. בשום פנים ואופן לא לקחת עם אלכס, לדחות את הקורס אם צריך.", "timestamp": 1657902494581}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלכסנדר כץ דמיאנץ\nחוות דעת - הרצאות: זוועה, המרצה פשוט יושב על הבמה מול המחשב ואומרים מושגים שלא אומרים כלום לאף אחד, לא נותן שום רקע מקדים לנושא לפני שצולל לפרטים ככה שרוב האנשים מרגישים אבודים.\nממש חסר תועלת ללכת להרצאות גם בגלל שכמעט כל החומר הרלוונטי למבחן נמצא בתרגולים.\n\nשם המתרגל/ת: שלום שוחאט\nחוות דעת - תרגולים: מתרגל נחמד מאוד, יש קצת בלאגן במערך התרגולים של הקורס אבל זה לא תלוי בו. מומלץ לעבור על המצגת של ההרצאה ואז ללכת לתרגול (לא ללכת להרצאות).\n\nשעורי הבית: 3 גליונות כל הסמסטר, לא קשים מידי אבל יש כל מיני דברים בעיתיים בשאלות עצמן - ניסוח לא תקין, שואלים על חומר שלא באמת נלמד...\n\nמעבדות: 3 מעבדות נחמדות, דו\"ח קצר יחסית (סוג של דף עבודה).\n\nהמבחן: קרקס מוחלט, לא הייתה שאלה אחת שלא היו בה לפחות 2-3 טעויות קריטיות שמונעות מלפתור אותו בצורה תקינה. ביזיון.\n\nהשורה התחתונה: חומר לא קשה אבל זריקה מוחלטת מצד סגל הקורס ובמיוחד מצד המרצה.", "timestamp": 1658243005425}, {"author": "אחשווראש", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: הייתי כמעט בכולם, היה מאוד מיותר. חבל על הזמן.\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: היה בסדר, גם די מיותר אבל צריך ללמוד איכשהו...\n \nשם האחראי מעבדה: דניאל (נדמה לי ככה קראו לו)\nחוות דעת - במזל אף אחד לא מת. לא הסבירו לנו איך לעבוד במעבדה כי רוב הזמן דניאל בכלל לא היה איתנו אלא היה בשעות קבלה שלו בזום, ועובדים עם כלים חשמליים מסוכנים (כרסמות, מחרטות). תאספו שיער לפני, ואל תאבדו יד, זה לא בריא.\n\nשעורי הבית: \nאין ממש קשר לחומר, כל אחד קיבל תשובה שונה, ועדיין קיבלנו ציונים טובים. \n\nה\"מבחן\": 4 \"שאלות\" אמריקאיות עם סעיפים, 3 מהן היו לא נכונות או בנתונים או בפתרון. היה שישו ושמחו בערעורים. סיפור שהיה באמת: באמצע המבחן פניתי למתרגל, אמרתי לו שאחת ה\"שאלות\" ב\"מבחן\" לא נכונה, והראיתי לו שבחישוב מגיעים לתשובה שאין באף אחת מהאפשרויות. אחרי 5 דקות של תקתוק אינסופי במחשבון הוא התייאש ואמר לי שאין לו מושג ופשוט להקיף את תשובה ב'. \n\nהשורה התחתונה: הקורס הכי ביזיוני שהייתי בו בטכניון. מותיר אבק לכל קורס ביזיוני אחר (שרטוט, נומרית, וכו') ברמת הביזיוניות. פשוט ביזיון ביזיון ביזיון. וזה לא שאני מתנקמ.ת בסגל או משהו, יש לי אחלה ציון... מה שהופך את זה לעוד יותר ביזיון כי פתרתי בקושי שאלה אחת מהמבחן", "timestamp": 1666269633443}, {"author": "פשוט לא", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אייל זוסמן\nחוות דעת - הרצאות: הרצאות משעממות לא קשורות לחיים. מציג מלא קונספטים כלליים שאמורים להישמע מעניין, הבן אדם עושה אותם הכי משעממים שיש.\n\nשם המתרגל/ת: סופי קופרממן\nחוות דעת - תרגולים: ליטרלי אין אותה. מי היא בכלל, היא צצה רק בבדיקה של הדוחות וקטלה שם בצורה לא נורמלית, בקושי הוציאה כמה מילים במהלך הקורס אבל ליטרלי שברה סטודנטים בציונים.\n\nשעורי הבית: אין. יש כל הקורס מבוסס פרויקט ודוחות שמגישים במהלך הסמסטר. כל דוח לוקח שעות הכנה, הבקשות וההנחיות לכתיבת הדוחות מעורפלים ולא ברורים. יש קטילה לא נורמלית בציונים גם אם הדוח תואם את ההנחיות כך שלסיים עם 40 על דוח שהשקעתם בו שבועות זה בהחלט הגיוני. \n\nהמבחן: אין מבחן אבל יש תחרות של כל הפרויקטים (סגנון מי בנה את  הפרויקט הכי טוב) מי שמנצח מקבל בונוס חמש נק' לציון סופי. אבל אלו מתגמדות לעומת הציונים הנוראיים בדוחות וההשקעה המרובה שהם דורשים.\n\nהשורה התחתונה: לאאאא לקחת את הקורס במתכונת הזו אלא אם ממששש אתם חייבים לקחת אותו. קחו אותו בסמסטר רגיל תחסכו לעצמכם כמה שיערות לבנות.", "timestamp": 1680210663793}, {"author": "S", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: הייתי ב2 הרצאות. פשוט אלכס מדבר ברצף שעתיים והנושאים לא ממש מתחברים אחד לשני. מצגות לא עוזרות במיוחד. לדעתי המרצה הכי גרוע שהיה לי עד כה בתואר.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: כולם גרועים. דפי התרגול מסודרים מזעזע אבל זה מקור הידע היחיד שאפשר ללמוד ממנו במהלך הקורס.\n\nשעורי הבית: 3 גליונות במהלך הסמסטר. חלק מהשאלות דומות לתרגול וחלק לא קשורות בכלל לכל חומר שהועבר בתרגולים/הרצאות. אפשר לרפרנס בלי להיפגע יותר מדי.\n\nמעבדה: נחמד להתעסק קצת בכרסום וחריטה אבל לא מקבלים הדרכה טובה במיוחד ובאופן לא מפתיע החלקים שמתקבלים בסוף יוצאים על הפנים. דוח 1 על כל המעבדות, יחסית קליל ומקבלים ציון גבוה.\n\nהמבחן: חומר פתוח, צריך לסדר מראש את הכל לדעת איפה למצוא פתרונות למה שצריך, עם לא הרבה למידה אפשר להוציא ציון סבבה.\nאצלנו היו 30 שאלות נכון/לא נכון ועוד 3 שאלות חישוביות (אמריקאיות) על כל מיני נושאים שנלמדו בקורס.\n\nהשורה התחתונה: מתחת לכל ביקורת. מרצים מזעזעים, מתרגלים מזעזעים. מצגות ודפי תרגול הכי לא ברורים ולא עוזרים שהיו לי בכל קורס. מודל מבולגן, חוסר סדר ותיאום בין הרצאות לתרגולים. חוסר תיאום בתוך הסגל. באמת שזה הקורס הכי מזעזע בפקולטה הזו.", "timestamp": 1691096975895}, {"author": "יצור", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה:  אלכסנדר\nחוות דעת - הרצאות:  כמו שאמרו פה כולם, ההרצאות די מעפנות כדי לבוא ולכתוב על המצגות וגם לראות יוטיוב לפני כדי לדעת מה תהליך היצור באותו שיעור. אבל בגדול ללמוד את החומר מהתרגולים ובהרצאה רק להכיר את הדברים בכללי מאוד. ממליץ למשל לקרוא את הסיכומים של בראודה כדי רק לדעת מה הנושאים.\n\nשם המתרגל/ת: שולום בר שוחאט\nחוות דעת - תרגולים: מתרגל מאוד נחמד ובתרגולים באמת כדאי להקשיב מאוד טוב, כי כל הפרקטיקה/ההבנה היא שמה. אם יש נושא שלא ברור לפנות אליו! מומלץ בחום ללמוד את התרגול טוב ואז טיפה להקשיב לתיאוריה בהרצאה.\n\nשעורי הבית: כמו בתרגול, כדאי להקשיב בתרגול.\n\nהמבחן: 70% כמו בתרגול וזה כיף ו-30% אמריקאי מוזר כזה (חלק מזה טריביאלי אם עושים סיכום טוב וחלק על נושאים מינורים שרק בהרצאה מדבר עליהם, אם מבינים חומרים אפשר לצדוק בכמה).\n\nהשורה התחתונה: קורס עם נושאים מעניינים שרק בתרגול באמת לומדים רציני, אבל המרצה מחכה לשאול את האמריקאיות, אז מומלץ לעשות דף נוסחאות עצמי מהתרגולים ולהכין סיכום של ההרצאות (אני נעזרתי בסיכום של בראודה) בהרצאות זה די שטחי ואם מצליחים לחבר נקודות אז אחלה. לא מרצה טוב, כדאי לשאול דברים ספציפיים את המתרגל.", "timestamp": 1691237318011}, {"author": "L", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אלכסנדר \nחוות דעת - הרצאות: \nההרצאה מעוברת בעל פה וגם הרבה זמן ומצגת לא עוזרת \nשם המתרגל/ת: שלום ויבגני\nחוות דעת - תרגולים: \nרק התרגולים לומדים דברים חדשים ומבינים את חומר,מתרגלים טובים\nשעורי הבית: \nכמעט לא היה\nהמבחן: \nנוראי\nהשורה התחתונה:", "timestamp": 1691474317746}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: משעמם. יש שאלות במבחן מההרצאות, לא יודע אם שווה להגיע רק בגלל זה.\n\nשם המתרגל/ת: שלום\nחוות דעת - תרגולים: חצי קלאץ. תרגולים שבקושי מלמדים משהו, מצד שני זה אומר שאין הרבה חומר ללמוד למבחן.\n\nשעורי הבית: שטויות חסרות תועלת\n\nהמבחן: תבואו עם מלא שאלות למתרגלים ולמרצים כי הרבה לא ברור והם לפעמים פשוט נותנים את התשובה. מבחן לא קשה מדי.\n\nהשורה התחתונה:", "timestamp": 1705569335825}]}