{"posts": [{"author": "shahar tsadok", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: גלעד יוסיפון\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שמרי חביב\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: היה סבבה. דומה מאוד למבחנים בשנים עברו\n\nהשורה התחתונה:", "timestamp": 1602607953715}, {"author": "DK", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: ההרצאות של רנה לא משהו ולא כל כך ברורות, אז היה צריך להתרכז בתרגול\n\nשם המתרגל/ת: וידאו\nחוות דעת - תרגולים: ...\n\nשעורי הבית: קשים אבל מאוד מתרגלים", "timestamp": 1612963759914}, {"author": "Omri Berkovich", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא להיט\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמצוינים\nשעורי הבית: \nקשים\nהמבחן: \nהוגן\nהשורה התחתונה:", "timestamp": 1614008373139}, {"author": "amit", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רנה ואן הוט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שחר ארז\nחוות דעת - תרגולים: מקסימה, מקצועית, מסבירה טוב\n\nשעורי הבית: קשים, ארוכים, לוקחים מלא זמן\n\nהמבחן: ספציפית הסמסטר היה מבחן סבבה\n\nהשורה התחתונה: קורס יותר קל מתרמו ומזרימה", "timestamp": 1614248804385}, {"author": "פלוץ זה סוג של הסעה", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: עומרי רם\nלא חייב ללכת בתרגולים מסבירים את זה שוב\nשם המתרגל/ת: \nחוות דעת - תרגולים: רנא\nלא משהו\nשעורי הבית: \nאין\nהמבחן: \nיש שני בחני אמצע מגן סבירים\nמעבדה די קשה חובה\nמבחן סוף סביר פלוס כי היה מתוך 110 נקודות\nהשורה התחתונה: \nקורס חביב לא עפתי עליו אבל חובה לתואר", "timestamp": 1644838052323}, {"author": "אוסבורן ריינולדס", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: \nמיותרות, מלא פיתוחים שלא באמת עוזרים להבין את הרעיון\n\nשם המתרגל/ת: מור אלגריסי + שימרי (פנופטו)\nחוות דעת - תרגולים:  \nשמרי מסביר מעולה את טכניקת הפתרון של תרגילים. מור שם המון דגש על ההבנה של העקרונות, אלוף כהרגלו.\n\nשעורי הבית: \nשני בחני אמצע מגן - היו ממש סבבה. \nבנוסף הייתה מעבדה באמצע סמסטר לפני שבאמת לימדו את כל הנושאים. דוח מעבדה מתיש ומיותר שנגרר עד השלמת כל הנושאים (סוף סמסטר)\n\nהמבחן: \nיש המון נושאים ודקויות שצריך לזכור / לדעת למצוא בספר הקורס. בגדול כל הסודות שם, רק באנגלית ומלא מלל.\n\nהשורה התחתונה: \nקורס פרקטי וממש חשוב למי שמתעניין בתחום של אנרגיה אבל ביצוע פחות מוצלח - לנתח מעברי חום ב-3 שעות של מבחן זה הרבה פחות יעיל מפרוייקט רציני באמת", "timestamp": 1645029844168}, {"author": "האננס", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: מרצה טוב.\nשעתיים ראשונות מלמד ומסביר את החומר בצורה מפורטת ובשעה השלישית מתחיל בפיתוחים מתמטים שאפילו הוא הולך לאיבוד בהם.\nללא עובדים שווה ללכת להרצאות, מוסיף ידע נרחב מאוד בנושא מעבר לחומר למבחן אבל ללחוצים בזמן אפשר ללמוד הכל מהתרגולים.\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: מתרגל מצוין.\nהתרגולים מלאים בתוכן ועוברים בצורה טובה על החומר הנלמד בהרצאות, ניתן לצפות בתרגולים המוקלטים שבהם מועבר כמעט אותו תוכן והם מצויינים.\nהתרגולים מספיקים בהחלט בשביל ללמוד למבחן.\n \nשעורי הבית:\n לא עשיתי אבל מסטודנטים שכן עשו אמרו שמלמדים מאוד, במיוחד התרגילים בהתחלה. בכל מבחן יש שאלה מהשיעורי בית (אותו מקרה אבל יותר סעיפים) \nלקראת סוף הסמסטר יש מעבדה, קצת מיותרת.\n\nהמבחן: \nהוגן מאוד, 3 שאלות אחת משיעורי הבית ואחת ממבחני עבר.\nרוצים לראות שבאמת מבינים את החומר ויודעים להשתמש בקורלציות המתאימות מהספר\n\nהשורה התחתונה: \nקורס לא קשה ומאוד מעניין, קורס חובה אז לא באמת משנה מה כתבתי.", "timestamp": 1647680549253}, {"author": "~", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: Omri Ram\nחוות דעת - הרצאות: Omri is a very nice guy, but it was his first time teaching the course and so it was a bit of a rough journey. He wrote stuff on the board extremely fast, it was very difficult to keep up with him when I tried to take notes (I had to give up eventually). He didn't record the lectures, but if he did I feel that it would've been more helpful for us. \n\nשם המתרגל/ת: Mor Elgarisi\nחוות דעת - תרגולים: Mor is a beast of a TA, you'd be a fool to go to any other tutorial but his. \n\nשעורי הבית: Not graded, but they were helpful for learning the material. There was a single lab, which felt more or less like a waste of time (I think we have to do the same lab in the \"Experimental Methods\" course anyways), but it's an easy grade that helps boost your final grade for the course.\n\nהמבחן: Very fair exam, nothing too bold or tricky. Matched the level of previous years and the homeworks well enough.\n\nהשורה התחתונה: The best way to learn this course is to just read the textbook, it's phenomenal. They could definitely improve the course by making the lectures slower/offering recordings, as well as by actually grading the homeworks and removing the lab component.", "timestamp": 1657557793663}, {"author": "מעביר החום", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: \nמרצה משעמם שלא יודע על מה הוא מדבר\nלא ללכת לשום הרצאה בזבוז זמן וגורם לשעמום לא נתפס\nמומלץ ללכת רק במידה ומעוניינים להשלים שעות שינה\nקצת מביך שיש כאלה אנשי סגל בטכניון\nתעודת עניות למקום הזה\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: \nמתרגל תותח לכו אליו הוא מחליף את ההרצאה בשעה במקום הגיהנום שנמשך שלוש שעות ונקרא במערכת הרצאה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nמרצה גרוע", "timestamp": 1660816935917}, {"author": "שיגמר כבר", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה:  עומרי רם \nחוות דעת - הרצאות: \nבניגוד לבחור שכתב פה בעבר, ההרצאות לא משעממות לגמרי, כן בהתחלה לוקח לו להניע אבל סה\"כ מאוד אכפת לו והוא כן מנסה להנגיש את החומר, כן נתן לנו בונוסים לנוכחות בהרצאות (משהו כמו 6 נקודות, לא זוכר בדיוק)\n\nשם המתרגל/ת: רנא\nחוות דעת - תרגולים: \nכפרה על רנא, אמנם בהתחלה היה קצת קושי של שפה, אבל בערך משבוע 4 היא יותר נכנסה לזה,לרוב גלשנו עוד עשר דקות לאחרי התרגול כדי להספיק הכל\nכמו כן, בתחילת כל תרגול היא חילקה לנו את הסיכום/ עמודים רלוונטיים בספר כדי שנהיה בעניין גם אם לא הבאנו אותו\n\nשעורי הבית: \nחלק קלי קלות, חלק טכניים וחלק שואת עולם ואני מעדיף לעשות גליון במוצקים.\nתודה לאל שיש רפרנסים, חשוב לעשות את השיעורי בית בשביל המגן, אבל הם לא ברמה של המבחן \n\nהמבחן: אני כותב יום או שניים לפני הציונים\nאבל, שואת עולם, לא ברור מה עבר לעומרי בראש שהוא כתב את המבחן הזה, כנראה סגנית הדיקן המדהימה שלנו אמרה לו להשחיל אותנו אחרי ששנה שעברה היה להם מבחן של ליטוף ארנבים בגן תות.\nיש לי הארכת זמן ויצאתי בשניה האחרונה כי היה עמוס בטירוף ומאוד לא טכני, אני יכול לקלל עד מחר אבל וואלה עדיף מבחנים של שפירא זה קללה גדולה מכולן.\n\nהשורה התחתונה: קורס מעניין, מבחן תלוי במצב רוח של המרצה, לפחות יש מגן גבוה יחסית לפקולטה", "timestamp": 1676895655171}, {"author": "מחומם", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: דיי מונוטוני ולא מצליח באמת לסחוף בשביל לעניין אבל לפחות מנסה, בחני כיתה (לא כל הרצאה) עם בונוס לציון סופי כדי לעודד אנשים להגיע\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: מתרגל מעולה, מדגיש את הקטע בכל נושא.\n\nשעורי הבית: מכינות ממש לבחן אמצע ולמבחן סוף, מומלץ מאוד לעשות, 10% (אאלט) מהציון.\n\nמעבדה: מעבדה מעניינת שממחישה את הנושאים.\n\nהמבחן: היה ממש קשוח, כנראה לא אהבו את הממוצע של 2022.\n\nהשורה התחתונה: סימניות בספר = הצלחה", "timestamp": 1677876613989}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: מרצה חביב ונחמד לסטודנטים, פתוח ומזמין לשאול שאלות. משתדל להנגיש את החומר בצורה הטובה ביותר. לפעמים מצליח ממש ולפעמים פשוט לשבת במקביל עם הספר בהרצאה עושה את העבודה. מתגמל עם בונוסים בהרצאה, כדאי ללכת להרוויח אותם.\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: ממשיך את הקו מזרימה, מתרגל פשוט תותח. כיף לבוא לתרגולים.\n\nשעורי הבית: חובת הגשה, מגרילים בדיקה בכל הגשה אז צריך לעשות אותם במלואם. בסוף מקבלים את כל הניקוד אם מגישים 10/12 מתוכם. יש מעבדה קלילה שמקבלים עליה 100 בסוף.\n\nהמבחן: עמרי למד מהפעם הראשונה שהוא העביר ונתן מבחן לא סימפטי בכלל. הרגיש שהרמה עלתה ושהייתה דרושה הרבה יותר הבנה כדי להצליח ביחס לשנים קודמות ובהתאם ההיסטוגרמה שדומה למוצקים 2 עם ספי.  \n\nהשורה התחתונה: מרגיש כמו תכן מכני רק בגרסה האנרגטית - מלא נוסחאות וקורלציות וצריך לדעת מתי להשתמש ואיך. בסוף המגן+בונוסים מההרצאות+שיעורי בית מקפיצים את הציון אז לא נורא מאוד.", "timestamp": 1678038548305}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: \nמרצה מאוד נחמד, אבל עם יכולת הוראה בינונית. הוא מתקדם בכיתה מאוד מהר, אז קשה לעקוב אחרי מה שהוא אומר, ולהספיק להעתיק הכל. למרות זאת, חשוב שלפחות סטודנט אחד יעתיק את החומר מהלוח בצורה מסודרת. גם בבוחן אמצע וגם בבחינה (מועד א) היו שאלות שעוסקות בדברים שהוסברו בהרצאה ועומרי כתב על הלוח (ולא ממש מצויים בספר)\n***חשוב***\nכל הרצאה שנייה עומרי היה עושה תרגיל כיתה פשוט, שהגשה שלו מזכה בנקודה בונוס לציון הסופי, ככה שלמרות שההרצאות עשויות להיות לעיתים משעממות ולא יותר מדי מובנות, מומלץ להגיע.\n\nשם המתרגל/ת: רנא ומור\nחוות דעת - תרגולים: \nרנא מתרגלת מעולה, מקצועית ויסודית. כל תרגול הייתה מדפיסה לסטודנטים את הדפים הרלוונטים לתרגול מספר הקורס, עושה חזרה עניינית וברורה על החומר שנלמד בהצראה, ופותרת את שאלות התרגול בצורה מאוד ברורה.\nמור מתרגל פשוט מעולה, מסביר את החומר בצורה מאוד מאוד ברורה וסבלני לשאלות.\n\nשעורי הבית: \nחלק קצרים ופשוטים, וחלק יותר ארוכים ומסובכים. הבדיקה של תרגילי הבית היא בדיקת הגשה בלבד (אם הגשת קיבלת 100). מומלץ לא לרפרנס כי תרגילי הבית מאוד מלמדים.\nבבוחן אמצע אחת השאלות הייתה שאלה מתרגיל בית.\n\nהמבחן: \nלא פשוט בכלל, דורש הבנה של החומר ושליטה בטכניקות שלומדו במהלך הסמסטר.\n\nהשורה התחתונה: \nלדעתי קורס מאוד מעניין. סגל הקורס מאוד מקצועי ומאוד מתחשב. הקורס כן דורש השקעה במהלך הסמסטר, אבל אפשר להוציא בו ציון גבוהה.", "timestamp": 1679999149728}, {"author": "S", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: אנשים עפים עליו אבל לדעתי הוא לא מרצה טוב (לא רע כמו מרצים אחרים בפקולטה כגון הקסנר ושלי צליל אבל עדיין רע). לעמרי יש נטייה פשוט לעלות ללוח ולהתחיל ללמד מהדפים שלו ואם הכיתה מאבדת אותו או לא מבינה הוא פשוט ממשיך וממשיך. לרוב גם אנשים מאבדים אותו בגלל שהוא עושה טעות או מסביר משהו לא מדוייק ואז אומר \"לא זה בסדר\" שמנסים לתקן אותו.\nבכל זאת, זה קורס עם הרבה חומר תיאורטי חשוב לבוא להרצאות, מה גם שכל 2-3 הרצאות עמרי עושה \"בוחן\" שמי שמגיש אותו מקבל נקודת בונוס לציון הסופי (לא צריך לענות נכון, זה בייסקלי בדיקת נוכחות). \n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: לדעתי המתרגל שהכי אהבתי כל התואר, גם בזרימה הוא היה תותח וגם פה. מסביר את הכל בצורה סופר מדוייקת. מאוד בקיא בחומר ועושה את הכל באווירה קלילה ובאמת כיף ללמוד ממנו.\n\nשעורי הבית: בערך גיליון כל שבוע, כן לוקחים את ה3-5 שעות כל אחד אבל רוב התרגילים יחסית דומים ברמה שלהם לשאלת מבחן ועוזרים להבין את החומר. לא באמת בודקים אותם, מספיק להגיש.\n\nיש גם מעבדה עם דו\"ח מכין ודו\"ח מסכם, דו\"ח מכין קצת ארוך אבל לא קשה במיוחד ודו\"ח מסכם יחסית קליל. מהמעבדות היותר פשוטות בקורסי חובה וגם ציונים די גבוהים.\n\nהמבחן: עמרי החליט לשנות את הפורמט של המבחן השנה. במקום 3 שאלות ארוכות עם כמה סעיפים כל אחת הוא עשה 2 כאלה + עוד 7 שאלות \"קצרות\". המרכאות האלה חשובות כי בתכלס כל אחת מהן לקחה בערך חצי מהזמן שלוקח לעשות שאלה ארוכה רגילה. הבדיקה שלהן הייתה לא פיירית בעליל. כל טעות קטנה הורידה את כל הנקודות. ממוצע במבחן נמוך בהרבה משנים קודמות. נתנו פקטור קטן מדי ואז אחרי כל המגנים מש\"ב ומעבדה והבונוסים של עמרי יצא ממוצע נורמלי בציון הסופי אבל המבחן היה קשה מדי ובכלל לא דומה לשנים קודמות.", "timestamp": 1717182375763}, {"author": "~", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: \nאין ספק שלעמרי יש זיקה גדולה לעולם. הוא יודע הרבה, מתעניין והוא משלב הרבה פעמים דברים חדשים שמתפתחים וניסויים שקורים וסיפר לנו עליהם בזמן ההרצאות.\nמבחינת הרצאה נטו- הוא בסדר, קצת מבולגן על הלוח ומדבר את מה שהוא כותב. אני חושב שאם הוא היה יותר מתרכז בלהסביר לנו את הפיתוחים המתמטיים לפני שהוא רושם אותם על הלוח זה היה הרבה יותר מובן, אולי שווה לבקש ממנו את זה מראש..\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: \nהוא באמת מתרגל תותח. עושה סדר בהכל, עובר על כל המשוואות הרלוונטיות לתרגול בצורה מובנת, שומר על הכיתה ערנית ובאמת כיף ללמוד אצלו.\n\nשעורי הבית: \nרובם המוחלט בסדר גמור ולא יידרשו מלא זמן (לעומת זרימה נגיד), שווה לעשות אותם עם הספר כדי להתרגל להשתמש בספר ולהוסיף sticky notes וכו'\n\nהמבחן: \nאם רמת המבחן משקפת את הידע שהיינו אמורים לצבור במהלך הסמסטר מההרצאות והתרגולים, אז הסגל כנראה לא מחובר וצריך לשנות את שיטת הלימוד- כי הוא היה קשה. מאוד. עומרי החליט לשנות אצלנו את מבנה המבחן, ובמקום 3 שאלות פתוחות קשות הוא הפך את זה ל2 שאלות קשות+ עוד 6 שאלות \"\"\"\"\"קטנות\"\"\"\"\" שביחד הפכו את המבחן ל5 שאלות קשות.\nקיצור... אם הוא ממשיך עם המבנה הזה- בהצלחה, כי פקטור נורמאלי לא יהיה \nהשורה התחתונה: \nהחומר מעניין, הסגל טוב, הקורס קשה והמבחן לא פרופורציונלי", "timestamp": 1717402279924}, {"author": "watermelon", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: מרצה בערך ממוצע , אולי אפילו מעל הממוצע. אין הרבה מה לעשות עם זה שהרבה מהקורס זה קורלציות משעממות שהוא חייב להעביר.\nיש בונוסים למי שמגיע , סופר משמעותי לציון בסוף\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: מתרגל מעולה , מבין את החומר לעומק \n\nשעורי הבית: רמה רגועה יותר מזרימה , מומלץ לעשות\n\nהמבחן: מבחינת קושי - לגיטימי, מבחינת אורך - 3 ימי עסקים לפתור את כולו\n\nהשורה התחתונה: אחלה קורס , נושאים באמת חשובים למרות שקל מאוד להשתעמם", "timestamp": 1720723128811}]}