{"posts": [{"author": "shahar tsadok", "difficultyRank": 2, "generalRank": 3, "semester": "201901", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: די משעמם... עובר על כל מה שמופיע בסיכומים אחד לאחד\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: לא מספיק מפרט ומסביר. אבל קבצי התרגול מחפים על זה בסופו של דבר\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602608028562}, {"author": "חיימון לימון", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: לפעמים הוא מדבר על שימושים פרקטיים של דברים וזה מעניין את מי שזה מעניין, אבל להרצאות יש אפס רלוונטיות למבחן, הן כמעט בגדר העשרה. ככה שמי שרוצה לגרד מהלו\"ז - אפשר לוותר.\n\nשם המתרגל/ת: אלון שירזלי\nחוות דעת - תרגולים: בחור נפלא, לפעמים התרגול קצת נמרח ולא ממוקד. אבל הוא באמת קשוב לכל שאלה וחשובה לו ההצלחה של הסטודנטים.\n\nשעורי הבית: היו 5/6 גיליונות חובה, יש רפרנס, היו יחסית קלילים וברמה של המבחן פחות או יותר, אפשר בזוגות או שלשות.\nיש פרויקט לתוך תקופת המבחנים, עיקר הזמן שנגזל עליו הוא ההתעסקות עם התוכנה (MULTISIM) והבאגים שבה. השקענו שעות על הפרויקט ובתכלס בהצגה שלו רק רצו לראות שהבנו מה אנחנו עושים, לא שאלו שאלות לפרטי פרטים והציון היה גבוה. \n\nהמבחן: יש שנים שיותר קשה ויש שנים שפחות. בסוף המבחן יחסית חוזר על עצמו וגם הטכניקות. צריך מעט הבנה והרבה תרגול כדי להצליח בו. זה מבחן בעיקר של מיומנות, לפעמים לוקח לדברים זמן להיות ברורים אבל הם חוזרים על עצמם.\nבאופן כללי, המבחנים של רימון בקורס יחסית הוגנים עם טוויסט.\n\nבמועד א' הוא לא שם טרנזיסטורים ומערכות ספרתיות בדרך כלל, כי הוא מאמין שזה חומר שלא שוקע טוב עד למועד א'.\n\nהשורה התחתונה: קורס שאם קולטים בו את הקטע - הוא קליל כדי להעלות את הממוצע. מצד שני, גם ציון עובר בו נותן ציון סופי סבבה כי לפרויקט ולשיעורי בית יש הרבה משקל.", "timestamp": 1647681459603}, {"author": "האננס", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: \nמלמדות מאוד, כנראה לא השתנו מאז תחילת הקורס.\nיש סיכום בדרייב שמרגיש שאילון מקריא ממנו.\nמומלץ לראות את ההרצאות המוקלטות של אילון, הוא מעביר שם את אותו חומר בדיוק בחצי מהזמן.\nמרצה מאוד נחמד, חוץ מזה שתקע לנו את הפרויקטון ביום האחרון לסמסטר ונפל על תקופת מבחנים.\n\nשם המתרגל/ת: הקלטות (מתחלף בין המתרגלים)\nחוות דעת - תרגולים: \nכל המתרגלים מהקלטות טובים, אם במציאות הם טובים כמו שהיו בהקלטות אז אפשר ללכת לכולם.\nהתרגולים קצת קצרים (שעה) אז יש הרבה שאלות שלא מספיקים אליהן.\nמאוד טכניים שזה מה שצריך למבחן.\nאפשר לראות רק את התרגולים ולהצליח בקורס.\n\nשעורי הבית: \nסבירים, לא דורשים הרבה זמן ועוזרים להשאר על החומר במהלך הסמסטר.\n\nהמבחן: \nהוגן מאוד, בדיקה הוגנת. בנוי מ3 שאלות של 30 נקודות שהמתרגלים בונים ועוד שאלה תאורטית מאוד של 10 נקודות שבונה אילון (בדרך כלל המהמוצע על השאלה הזאת הוא 2-3) נקודות.\nהשנה אילון החליט לכתוב גם את השאלה ה3 שהייתה נוראית והיו צריכים לתת עליה פקטור שמן ויפה.\n\nהשורה התחתונה: \nקורס נחמד ומעניין, בסופו של יום מאוד טכני (נועד למהנדסי מכונות ולא חשמל).\nחוץ מהעצם בגרון בצורת פרויקט על החופשת סמסטר לא קשה בכלל.\nקורס חובה אז כל מה שרשמתי לא רלוונטי.", "timestamp": 1647682161713}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: Elon Rimon\nחוות דעת - הרצאות: Elon explains the material very well, but he's not such a nice person. He yelled at somebody for using a laptop in class because it \"distracted him\" too much.\n\nשם המתרגל/ת: Alon Shirizly\nחוות דעת - תרגולים: Alon is a decent TA, and the tutorial notes themselves are great and really are the main way to learn the material.\n\nשעורי הבית: Six easy homeworks, match the level of the tutorials well enough.\n\nהמבחן: Elon does this thing where he gives three slighlty tricky questions for 30 points each, and then one question for 10 points that is basically impossible. You basically enter the exam starting from a 90, it's ridiculous. Apprently he does it to separate the 90 students from the 100 students, which is absolutely ridiculous.\n\nפרויקט:  The project involves designing a complex circuit for some application, this was actually the most interesting part of the course and was a great way to apply our knowledge of the material. I wish Elon would get rid of the exam, and make the project the main grade of the course.\n\nהשורה התחתונה: A useful and not so heavy course, very easy to do well. Hopefully Elon will learn to treat students with a bit more respet in the future.", "timestamp": 1657558245743}, {"author": "מחושמל", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: אל תלכו, בזבוז זמן\n\nשם המתרגל/ת: הקלטות\nחוות דעת - תרגולים: עדיפים על כל מתרגל אחר בקורס בפער\n\nשעורי הבית: 5 גליונות שכדאי לעשות בשביל הציון לא מעבר\n\nפרויקטון: פעם ראשונה שראיתי קשר בין מה שאני לומד למה שיכול להיות אחרי התואר.\n\nהמבחן: סביר, 3 שאלות פתוחות ועוד שאלת הבנה של 10 נקודות.\n\nהשורה התחתונה: במועד א' יש פחות חומר אז כדאי להשקיע ולא ללכת על מועד ב'.", "timestamp": 1677876763245}, {"author": ":)", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: הייתי בהרצאה הראשונה, רימון אמר שיתפרסמו הקלטות אז לא הלכתי והתברר שגם לא היה כל כך טעם בלראות אותן. מסוכמות ברמת המילה בדרייב. לא ממליץ ללכת להרצאות אלא אם רוצים להעשיר את הידע (עדיף להשקיע את הזמן בקורסים אחרים בסמסטר כמו מעבר חום ומבוא לבקרה).\n\nשם המתרגל/ת: קבוצה ריקה\nחוות דעת - תרגולים: פרסמו הקלטות מהקורונה, כל פעם מתרגל אחר. אם כבר ללכת אז לדוד רוזנשטוק/אלון שיריזלי. אפשר גם להסתפק בקריאה של הרשימות שלהם.\n\nשעורי הבית: 5 גליונות סה\"כ, מאוד קצרים, קלילים והם בשלשות/זוגות (לבחירתכם). יש פרוייקטון בסוף הסמסטר על התקופת בחינות, הוא לא כבד מאוד אבל מצריך חשיבה והשקעה.\n\nהמבחן: סביר++. 3 שאלות טכניות ועוד אחת של הבנה שרימון כותב (אל תבנו עליה). מצריך הכנה ולמידה לקראתו.\n\nהשורה התחתונה: הקורס הקליל של סמסטר 5", "timestamp": 1678037408179}, {"author": "ג", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אילון\nחוות דעת - הרצאות: מומלץ לבוא חדים על החומר לפני ההרצאה, כי אילון לא.\n\nשעורי הבית: סבבה בסה\"כ, הפרויקט קשוח ולא מובן למה אי אפשר פשוט להגיש במקום לגרור אנשים לטכניון בין תקופות מבחנים.\n\nהמבחן: לא קשה במיוחד\n\nהשורה התחתונה: קורס שיכל להיות מאוד מעניין וחבל.", "timestamp": 1679238949648}, {"author": "L", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אילון\nחוות דעת - הרצאות: \nמלמד לאט את ההרצאות אבל דיי בסדר\nשם המתרגל/ת: אייל\nחוות דעת - תרגולים: \nמתרגל אחלה ,התרגול מעובר מסודר וברור מאוד.\nשעורי הבית: \nדרוש מאמץ קטן\nהמבחן: \nדרוש זמן להשקיע בו\nהשורה התחתונה: \nקורס שניתן לעבור את מועד א בו", "timestamp": 1715880103221}]}