{"posts": [{"author": "ליאור ליאון", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות:  מי שיש לו זמן פנוי, יכול להיכנס להרצאות בתור העשרה נחמדה, אני לא נכנסתי\n\nשם המתרגל/ת: ימית\nחוות דעת - תרגולים: מסבירים שמה הכל מההתחלה, תכלס מספיק\n\nשעורי הבית: ארוכים מאוד מאוד  ביחס ל נ\"ז המסכנים שיש לקורס הזה\n\nהמבחן: \n\nהשורה התחתונה: קורס יחסית קליל, שיעורי בית שלוקחים זמן, כל קו ארוך נצח. קורס בהחלט מיותר והיה יכול להיות ממש נחמד בתור העשרה או משו כזה,אבל בפועל, כשיש סוליד...", "timestamp": 1626112109110}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: מיותרות סך הכל. נראה שזה מנהג בן שנים שעובר בין מרצה למרצה.\n\nשם המתרגל/ת: ימית גרון.\nחוות דעת - תרגולים: סך הכל היא מתרגלת טובה אבל התרגולים לא באמת עוזרים להבין את החומר ולא מתקרבים בשום קשר לרמה של השיעורי בית או המבחן.\n\nשעורי הבית: יש כאלה סבירים הרוב לא, רפרנסים זה דבר חשוב מאוד.\n\nהמבחן:  זוועת עולם.\n\nהשורה התחתונה: הייתי אומר לכם להתרחק אבל כנראה אתם חייבים לקחת את הקורס. יצאתי עם כלום ידע בשרטוט הנדסי והרבה מטען על הצוות שאת רובו לא עניין הקורס.", "timestamp": 1627798363863}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: מיותרות, נכנסתי לבודדות והתחרטתי על זה\n\nחוות דעת - תרגולים:  המתרגלים לא יודעים לתרגל ולא ממש שולטים בחומר, בהרבה מקרים לא הם מתקשים לפתור שאלות משיעורי הבית או ממבחנים.\n\nשעורי הבית: מבחינת רמת הקושי נעים בין קלים ברמה שהיה אפשרי לפתור אותם בלי ללמוד כלום לבין שיעורי בית שהמתרגלים בעצמם לא מבינים. כמות שיעורי הבית גדולה בהרבה ממה שכמות נקודות הזכות מצדיקה.\n\nהמבחן: נורא, הסגל הצהיר על מבנה מבחן מסוים וזה לא המבנה שהיה, לא נתן שום פקטור בזמן שהממוצע ירד בהרבה מהממוצע של שנים קודמות, ולא ברור אם טרחו לבדוק אם המבחן בכלל (היו סטודנטים בודדים שקיבלו יותר נקודות ממה שענו עליהן במבחן). המתרגלים פרסמו פתרון וטעו בעצמם בחלק מהשאלות.\n\nהשורה התחתונה: מן הסתם לא לקחת אם לא חייבים. קורס מיותר שגם רמת ההוראה בו וגם עצם קיומו הם תעודת עניות לטכניון", "timestamp": 1627799183792}, {"author": "שמואל", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "*****אם דן שפרי מרצה אחראי או ימית גרון מתרגלת אחראית, חשוב שתקראו את זה!!!!!\n\nשם המרצה: דן שפרי\nחוות דעת - הרצאות: \nמרצה חביב סך הכל, מעביר את החומר באווירה נעימה. הרצאות מאוד מיותרות, רוב מה שנעבר בהן זה חומר העשרה על התעשיה וכל החומר הפרקטי כמעט ולגמרי מדולג. למבחן לומדים מתרגולים, גם שיעורי הבית בקצב של התרגולים.\nשם המתרגל/ת: ימית גרון (מתרגלת אחראית)\nחוות דעת - תרגולים: \nתרגולים מועברים טוב. בנושאים האחרונים ממש לא העבירו את הכישורים שצריך כדי להתמודד עם שיעורי הבית.\nשעורי הבית: \nבאמת ששיעורי ההכי ביזיוניים שאי פעם יצא לי לפגוש. המתרגלת האחראית נתנה תרגילי בית להגשה בלי לבדוק בכלל אם למדנו את החומר (או אם הוא יילמד בכלל) או אם הוא תואם את קצב התרגולים, לכן בכל תרגיל בית חוץ משלוש בוטל לפחות תרגיל אחד, כי \"החומר לא נלמד עדיין\" או \"לא יילמד בכלל\". בנוסף לכך היה תרגיל בית שלם שדחו אותו בשבוע במשך חודש כי הוא הכיל חומר מתקדם הרבה יותר מהתרגולים, לכן היה שבוע שבו הגשנו 3 תרגילי בית שונים.\nבנוסף לכך תרגילי הבית לוקחים הרבה יותר מדי זמן והשקעה (במיוחד כשתנקעים על שאלות שהחומר בהן לא נלמד עדיין) בשביל קורס של 2.5 נקז.\nחשוב להשוות בין בדיקות של מתרגלים שונים כי אין שום תיאום ויכולות לרדת לכם נקודות סתם על טעות של המתרגל.\n** בקיצור הכי חשוב לרפרנס אחרת זה לא שווה את זה.\nהמבחן: \nעובדה אשר לא יצא לי לדעת בגלל שלא ראיתי את ההרצאות, היא ששפרי מאוד אוהב גיאומטריה תיאורתית. כל כך אוהב אותה למעשה שכמעט חצי מהניקוד של המבחן היה תרגילי גיאומטריה תיאורתית. אבל התרגילים האלה לא היו קשורים בשום מידה ואופן לכל מה שהיה במבחנים משנים קודמות, בנוסף לכך הם השתמשו בנתונים שאף פעם לא שמענו עליהם (המתרגלים אפילו לא היו סגורים על עצמם מה הנתון אומר). כמובן כמו עם שיעורי הבית היה בערך 5 או 6 שישה תיקונים לטעויות שהם עשו במבחן בזמן המבחן ואחריו.\nכל שאר הנושאים שלא היו גיאומטריה תיאורתית, כלומר הנושאים האשכרה הנדסיים שקשורים למכונות, היו בדיחה מהלכת ולא ברמה בכלל לעומת מבחנים משנים קודמות (אולי שפרי מצפה שההעשרה שהוא נתן מספיקה כדי שניהיה מהנדסי מכונות טובים).\nבמבחן היו 110 נקודות, אז אפשר לקבל מעל 100, שזה יתרון. אבל בהתחשב בזה שכמו בבדיקת שיעורי הבית לא היה תיאום בין הבודקים, ירדו לאנשים נקודות על כלום, שזה בסדר מגיעים לפתיחת מחברות ומערערים ומקבלים את הנקודות המגיעות. הבעיה היא שיש בודקים שבדקו ככה שאנשים קיבלו ציונים גבוהים הרבה יותר ממה שמגיע להם (ברמת הפרש של יותר מ10 נקודות), לכן מי שיצא לו במזל הרוויח. כל השאר נדפקים כי הציונים הגבוהים מעלים את הממוצע אז זה נותן מספיק תירוץ לצוות לא לתת פקטור (בעוד שהיה לנו את הממוצע הנמוך ביותר בכמה שנים האחרונות).\nהשורה התחתונה: \nקורס באמת מעניין מעשיר ונותן הרגשה טובה של מה זה להיות מהנדס מכונות (בשביל שנה א' כמובן), אבל לצוות הזה ספציפית לא היה אכפת מהקורס או מהסטודנטים, כל מה שקיבלנו היה זלזול פעם אחרי פעם. אז אל תצפו למבחן הוגן או אחד שבודק משהו חוץ מיכולות בגיאומטריה משפרי ואל תצפו לבדיקה כמו שצריך של שיעורי בית ושל המבחן עם ימית, היא ממש לא הולכת לעשות תיאום בין המתרגלים. ולגבי פקטור תשכחו לגמרי, הם לא שמעו על זה.", "timestamp": 1628026764750}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: לא נכנסתי לשום הרצאה, מיותרות לחלוטין.\n\nשם המתרגל/ת: ימית\nחוות דעת - תרגולים: מסבירה את החומר יחסית בסדר, בתכלס לומדים את החומר בתרגולים\n\nשעורי הבית: זוועה. פשוט מעיקים ומתסכלים. כל תרגיל בית יותר נורא מהשני. אין שום קשר בין תרגילי הבית לחומר שלומדים בתרגולים.\n\nהמבחן: ביזיון מוחלט. חוץ משאלה אחת למבחן לא היה שום קשם לחומר שלמדנו בסמסטר. במהלך המבחן תיקנו שאלה בערך 3 פעמים כל פעם, כל מתרגל ענה תשובה שונה על שאלה במבחן (אני בספק שהם באמת יודעים איך לפתור את כל המבחן לבד). היה חוסר תיאום מוחלט בין המתרגלים בבדיקה של המבחן, חלק קיבלו יותר נקודות ממה שהם צברו, חלק קיבלו חצי מהנקודות שהם צברו, וחלק קיבלו 5 נקודות בונוס סתם ככה. הממוצע הכי נמוך שהיה בקורס אי פעם, אבל הצוות פירגן עם 0 נקודות פקטור אז אי אפשר להתלונן. \n\nהשורה התחתונה: אין עוד דרך לתאר את הקורס הזה חוץ מהקורס הכי נורא שקיים בטכניון. צוות קורס שלא יודע ללמד וכנראה לא באמת מבין את החומר עד הסוף, שיעורי בית מתסכלים שלא תואמים את החומר שלומדים בתרגולים, מבחן שנבנה ללא התחשבות או חשיבה, הרצאות חסרות תועלת ותרגולים משעממים.\nקורס שפשוט מבזה את השם הטוב של הטכניון", "timestamp": 1628108347684}, {"author": "תרנגול האפרשזיף", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: הלכתי לבערך מחצית מההרצאות או אולי שליש. ההרצאות לא ממש נחוצות כדי להצליח בקורס, אולי העשרה מעניינת. דן בחור חביב, אבל אפילו הוא רמז שההרצאות די מיותרות\n\nשם המתרגל/ת: ימית גרון\nחוות דעת - תרגולים: -\n\nשעורי הבית: לא בדקו לבערך חצי מהאנשים עד הרגע האחרון, ממש טיפה לפני תחילת המבחנים הם בכלל הגיעו לבדוק לנו את תרגיל 2, גם לאחר שבדקו את התרגילים 2-12, הם בדקו עם מלא טעויות (ככה זה כשדוחים כמה מאות תרגילים לרגע האחרון...) היה ביזיון שלם. איך אנחנו אמורים ללמוד מטעויות אם אפילו לא בודקים לנו אותן בזמן? \n\nהמבחן: ביזיון עוד יותר גדול מהש\"ב. היה מבחן קשה, לי דווקא היה ציון טוב, אבל קיבלתי נקודות איפה שלא הגיע לי ואיבדתי איפה שדווקא כן הגיע, אז זה לא אומר הרבה. יש חברים ששכחו לבדוק להם דפים שהגישו, כאלו שקיבלו יותר נקודות מכמות הסעיפים שהם ענו עליהם, ועוד ועוד. באמת שזה היה פשוט ביזיון. \n\nהשורה התחתונה: חבל שזה ככה, אבל ממש נראה שלאף אחד לא אכפת בכלל מהקורס הזה חוץ מלסטודנטים, וגם להם לא בטוח.", "timestamp": 1629394171410}, {"author": "Artemiy Tumanov", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  ימית גרון\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nקורס מבולגן לגמרי!\nהתנהלות כושלת של הסגל בפן הלוגיסטי- בדיקת ש.ב, העלאת חומר למבחן וכו", "timestamp": 1631528866189}, {"author": "~~", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: מפוזר מאוד, קשה מאוד להבין מה הוא רוצה במהלך ההרצאות, לא הבין מה אנחנו רוצים ממנו כששאלו שאלות על מה הוא אמר. אחרי ניסיון של חצי סמסטר להישאר בהרצאות ויתרתי על זה בלב שלם מאוד. מיותר להחריד, ומבאס כי הוא התבאס עלינו שלא הגענו להרצאות.\nעל הקורס בכללי- תכלס מעבר לשבועיים האחרונים בקורס אין באמת שימוש למה שלמדנו. פשוט בזבוז זמן.\n\nשם המתרגל/ת: ימית גרון\nחוות דעת - תרגולים: כנ\"ל+ כמתרגלת אחראית הופתעה לגלות שהם עוד לא לימדו חומר שנתנו עליו כבר שיעורי בית.\n\nשעורי הבית: שאלות ממבחנים ישנים, מכין בגדול לא רע למבחן. זו הייתה שעת הציור השבועית שלי ולחובבי הז'אנר זה לא רע.\n\nהמבחן: היה אצלנו עם חומר פתוח. שאלות מגעילות וציונים לא מדהימים בכלל (לכל הכיתה). קיצר- אם יש לכם אפשרות לא לעשות את הקורס תחסכו לעצמכם. \n\nהשורה התחתונה: הפקולטה תעשה לעצמה ולנו טובה גדולה מאוד אם יהיה מרצה אחד שיטרח להכין מראש פלייליסט של סרטונים ביוטיוב שמלמדים את כל החומר, תסדיר כמו שצריך את מה בכלל יש בסילבוס ומה המטרות שלו, ושזה ירוץ משם והלאה. מעבר לזה קורס עם פוטנציאל להיות קליל וחביב עם יחס ממש מעצבן מהסגל שקילקל. חבל.\n\nטיפ אם אתם לפני תחילת הקורס- תשאלו בתחילת הסמסטר אם יהיה מבחן עם חומר פתוח. אם כן- תתארגנו על סיכום מודפס מראש ותתרגלו לעבוד איתו. יש את כל הציוד לקורס שאתם צריכים למסירה אצל מחזורים מעליכם (סרגלים, מחוגות סיכומים..)", "timestamp": 1634585231535}, {"author": "ג", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: דן בן אדם מדהים עם כוונות טובות, אבל פחות התחברתי להרצאות שלו. \n\nשם המתרגל/ת: ימית גרון\nחוות דעת - תרגולים: לא כל כך מסבירה טוב מה שהיא עושה, אבל בסך הכול מתרגלת טובה, כנראה הבנאדם היחידי בקורס עם רגליים על הקרקע.\n\nשעורי הבית:  לוקחים הרבה יותר מדי זמן ולא קשורים להרצאה או לתרגול במקרים רבים, ובוודאי שלא למבחן.\n\nהמבחן: כאמור, קשור רק באופן חלקי לדברים שנלמדו. בואו עם ראש פתוח??\n\nהשורה התחתונה: חומר הקורס עצמו לא קשה, אבל הצורה בה הוא התנהל בסמסטר הנוכחי היה בדיחה. אני לא יודע מי \"אשם\" בזה אבל במשפט אחד הרגיש שאין שום פיקוח על הבלגן בקורס.\n\nשיעורי בית נפתחו לפני שלמדנו כלל את החומר הרלוונטי, והוחזרו (במקרה הטוב) שבועות לאחר תאריך ההגשה. לחלק מהאנשים הוחזרו שיעורי בית רק זמן קצר לפני המבחן! ואני מדבר על יותר משלוש ארבע גליונות. \n\nגם אחרי שקיבלנו את שיעורי הבית הפידבק לא עזר יותר מדי (לא פנים מול פנים ולא בגיליון עצמו) בהבנת טעויות, וחוסר סינכרוניזציה בין מה שנלמד בהרצאה והתרגול הפך את הקורס הזה לdysfunctional mess.\n\nכמובן, יכול להיות שהבעיה הייתה רק בסמסטר הזה ספציפית.", "timestamp": 1634645251189}, {"author": "עמרי בן חיים", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \nיש לו הרבה אנרגיה והתלהבות אבל מנותק מהקורס\nשם המתרגל/ת: ימית גרון\nחוות דעת - תרגולים: מאוד נחמדה ואכפתית אבל לא הכי טובה בחומר\n\nשעורי הבית: \nלוקחים הרבה זמן, לרוב אפילו המתרגלים לא סגורים על דרך פתרון\nהמבחן: מבחן מנותק מהמציאות אבל יש חומר פתוח לפחות\n\nהשורה התחתונה:", "timestamp": 1635144205651}, {"author": "mip", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \nנורא קשה לעקוב אחרי המצגת בהרצאות, באופן כללי כדאי מאוד לשבת ולעבור עליהן, לרוב יויתר קל אחרי תרגול.\nשם המתרגל/ת: אבישי קדרון\nחוות דעת - תרגולים: \nאחלה מתרגל, מושקע בקורס ואיכפתי, בעל ניסיון רב בתחום ולכן נותן מידע הנדסי רלוונטי ויכול לענות על שאלות מניסיון (ולא רק תיאורטית)\nשעורי הבית: \nלוקחים המון זמן, יש בדרייב סיכומים שעוזרים להבין את השלבים לשיטות השונות\nהמבחן: \n\nהשורה התחתונה: העומס בקורס ממש יכול להצטמצם אם פותרים את השיעורי בית ישר אחרי התרגול, אפילו בכיתה כשהמתרגל עוד שם", "timestamp": 1658762160013}, {"author": "שפ", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \nהלכתי רק בתחילת הסמסטר קשה לעקוב ולא כזה רלוונטי לשיעורי בית ולהבנת החומר\nשם המתרגל/ת: איתמר ונטורה\nחוות דעת - תרגולים: \nתרגולים חובה להבנת החומר שם לומדים הכל\nשעורי הבית: לוקחים הרבה זמן אבל כדאי להשקיע בהן גם מגן 30% גם תרגול טוב למבחן\n\nהמבחן: ביזיון מוחלט החליפו שתי שאלות מתנה של חישובים קלילים בשתי שאלות נוראיות שלא ראינו משהו דומה בעבר \n\nהשורה התחתונה: קורס יכול להיות הרבה יותר כיף ומעניין אם הסגל יעשו העבודה שלהם יותר טוב אין סיכום או חומר טוב למבחן וגם אין פתרונות מלאים למבחני עבר צריך לשבור הראש כדי ללמוד למבחן", "timestamp": 1658949818624}, {"author": "L", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: מרצה מבדח, מסביר טוב את נושאים\n\nשם המתרגל/ת: דוד\nחוות דעת - תרגולים: מתרגל מצוין, מסביר כמו שצריך את נושאים. עונה על כל שאלה.\n\nשעורי הבית: מעייפים וקשוחים\n\nהמבחן: נוראי מאוד\n\nהשורה התחתונה: קורס מעייף", "timestamp": 1659110165748}, {"author": "א", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: הייתי רק ב-2 הרצאות והוא די מזעזע. מאוד מזלזל בסטודנטים ופשוט יש לו מיינדסט מאוד זקן. גם לא נאמר יותר מדי חומר חשוב בהרצאה שאי אפשר להתמודד בלעדיו. וגם אם כן אז אפשר להשלים דרך הקלטות או קריאה של המצגת בקלות. \n\nשם המתרגל/ת: איתמר ונטורה\nחוות דעת - תרגולים: אחלה מתרגל, מסביר הכל במהירות (רוב התרגולים היו שעה או פחות ואז שעת קבלה לשאר הזמן) ואפילו הפך את הקורס המזעזע הזה לכיף מדי פעם. לא מאמין שהוא ימשיך לתרגל בעתיד אז לא יודע עד כמה זה עוזר לכם \\:.\n\nשעורי הבית: משאבת זמן לא נורמלית. גם כשברור מבחינה רעיונית איך אמורים לפתור הם עדיין לוקחים מלא זמן לשרטט. הם כן תרגול מאוד טוב והציון שלהם תקף אז לא לוותר.\n\nהמבחן: לנו היה מבחן מזעזע! שנות אור ברמה מעל כל מבחני עבר. לא אפשרי לפתור ב-3 שעות. מקווה שבעתיד ינרמלו קצת את הרמה או שיחליפו את שפרי המזעזע הזה.\n\nהשורה התחתונה: קורס נוראי ומבזבז זמן בטירוף. גם השיעורי בית לוקחים מלא זמן וגם התרגולים הם חובה. בכללי גם באמת תועלת למה שנלמד. כל מה שחשוב לדעת בקורס הזה זה טולרנסים ולומדים את זה בצורה יותר מקיפה ויסודית בתהליכי ייצור. הלוואי והייתי יכול להגיד לכם לא לקחת אבל זה עדיין קורס חובה אז נדפקתם.", "timestamp": 1659386034544}, {"author": "..", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שפרי דן\nחוות דעת - הרצאות: לא הלכתי\n\nשם המתרגל/ת: איתמר ונטורה\nחוות דעת - תרגולים: \nבן אדם טוב ורוצה לעזור אבל אישית לא התחברתי \n\nשעורי הבית: כל שבוע מטלה חדשה דורשים המון זמן אבל כדאי להשקיע כי זה מגן לא רע וגם תרגול להבנת החומר\n\nהמבחן: \nהמבחן לא מאוד קשה מה שקשה זה איך להתכונן למבחן אין פתרונות מלאים אין מספיק מבחנים ישנים  \nהשורה התחתונה: קורס יכול להיות הרבה יותר כיף ומעניין אם היה סגל שאכפת לו מהסטודנטים", "timestamp": 1666702163669}, {"author": "Noam Hannoun", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המתרגל/ת: בעז\nחוות דעת - תרגולים: \nאם יש לכם אפשרות ללכת לבעז, לכו. הוא מתרגל מעולה. הוא באמת רוצה שנבין את התרגולים שלו. הוא משקיע כל כך הרבה בתוך מתרגל שהיא אפשר לא להבין. הדפיס לנו בתלת מימד את התרגילים כדי שנבין יותר טוב את הגיאומטריה, בודק כל משפט של כל שיעורי בית (אל תדאגו הציונים טובים בקורס הזה) ומחזיר לנו את השיעורי בית עם תיקונים והערות כדי שנוכל ללמוד מהטעויות. \nבאמת תודה לבעז, הלכתי לכמה מתרגלים אבל החלטתי להשאר איתו, הוא היחיד שבאמת איכפת לו שנבין. \n\nשעורי הבית: \nלוקח קצת זמן אבל ציונים טובים \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1690780682600}, {"author": "חתולה_שובבה69", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שפרי דן\nחוות דעת - הרצאות: \nכדאי ללכת להרצאה הראשונה כדי להבין שלא מומלץ להגיע להרצאות\nשם המתרגל/ת: דוד רוזנשטוק\n\nחוות דעת - תרגולים: דוד היה מקצוען אמיתי, קצת קשה לו להשתלט על כיתה, אבל יותר מרגיז שיש כאלה שמרשים לעצמם להפריע בשיעורים. נותן מעצמו אקסטרה ועזר מאוד להבין איך הכי מומלץ ללמוד למבחן.\n\nשעורי הבית: לוקחים זמן, מומלץ להתחיל לפחות יומיים מראש לפני תאריך ההגשה אם רוצים להבין את שיעורי הבית. מומלץ להבין אותם כי חלק מהם רלוונטיים מאוד למבחן.\n\nהמבחן: קונספטים שחזרו ממבחנים קודמים, פרט לאיזומטריה שלא תורגל כמעט בכיתת הלימוד, אבל זה קל ברגע שמבינים מה לעשות, מאוד טכני.\n\nהשורה התחתונה: יכול להיות טוב, דורש שלושה ימים לפחות של הכנה למבחן כדי להגיע לרמה של מוכנות מבחינת השימוש בכלי השרטוט קוריאה של השאלות", "timestamp": 1690980430391}, {"author": "יובי", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \nמאוד מבדר, דן מרצה טוב, אבל רוב הטכניקה נלמדת בתרגולים. הוא מסביר אם שואלים.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nחלקם עמוסים וקשים קולקטיבית, חלקם להפך ולפעמים תוהים אם כל התרגיל הודפס.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1693565523887}, {"author": "אורי בלוגולובסקי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: הלכתי לשעה והבנתי שלא רלוונטי בכלל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1693826546315}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דן\nחוות דעת - הרצאות: מיותר להחריד\n\nשם המתרגל/ת: סלמן\nחוות דעת - תרגולים: מתרגל מצויין, מסביר טוב מאוד ונותן זמן לשאלות וחניכה\n\nשעורי הבית: בסדר\n\nהמבחן: בנוי שלא לסיים אותו\n\nהשורה התחתונה:", "timestamp": 1695721527874}, {"author": "Tim Manor", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דן שפרי\nחוות דעת - הרצאות: \nלא הלכתי להרצאה אחת אבל לא הרבה סטודנטים הולכים. לפי מה שאמרו לי הוא מסביר הרבה יותר ממה שאתה צריך בפועל.\nשם המתרגל/ת: אשל איזנברג ובועז זיק\nחוות דעת - תרגולים: \nאשל מסביר מעולה! הפשלה היחידה שהייתה לו הייתה שבאחד התרגולים הוא לא עבר על כל החומר ואז היינו צריכים לשבור קצת את הראש בשיעורי הבית.\nבועז אפילו יותר טוב! אין לי משהו רע להגיד עליו בתור מתרגל בנושא! מתרגל מושלם!\nשעורי הבית: \nחלקים קצרים וחלקם ארוכים. בגדול די מטחנת זמן. עושים שיעורי בית על דפים ומגישים בתיבת הגשה בחוות המחשבים בדוויס.\nהמבחן: \nיש חומר פתוח במבחן אז כולם מדפיסים מלא דברים ובאים עם קלסרים. לי אישית היה ממש טוב במבחן על אף הזמן הקצר שהיה להתכונן (2.5 ימים). \nהשורה התחתונה: \nקורס שמרגיש לא מעודכן למציאות היום. יש בו דברים חשובים אבל, לדעתי ניתן ללמד אותם ביחד עם קורס ההמשך שלו, שרטוט הנדסי ממוחשב. מאוד ממליץ לקחת בחזרה את שיעורי הבית הפתורים ולשמור למבחן, לי זה עזר.\nגם אין מבחנים פתורים במודל אז ממליץ לבקש משנים מתקדמות את הסריקות שלהם. המבחן עצמו די חזרתי בחלק מהדברים אז זו הדרך היחידה שבאמת ניתן להתכונן אליו.", "timestamp": 1704704709257}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המתרגל/ת: דוד\nחוות דעת - תרגולים: גבר על! מסביר מצויין, עם גישה חיובית וסבלני מאוד", "timestamp": 1704879286188}, {"author": "הצל", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שפרי דן \nחוות דעת - הרצאות: הייתי בשתי הרצאות, לא מרגיש שהן מועילות אולי לידע כללי, בדרכ בתרגול הוא חזר על כל מה שרלוונטי ולא הרגשתי מאחור בגלל שלא הגעתי להרצאות. \n\nשם המתרגל/ת: סלמאן עבדאללה\nחוות דעת - תרגולים: מדהים! באמת הבן אדם מסביר טיל, מדבר תכלס וחשוב לו מאוד מהתלמידים, הרגיש שממש נותן מענה לכל מה שצריך והכיתת תרגול שלו הייתה מאוד נעימה והיה נוח לשאול שאלות ולעבור על החומר. \n\nשעורי הבית: מלא זמן, חשוב אבל הרבה יותר מידי זמן בשביל הנקז של הקורס.\n\nהמבחן: הוגן, חשוב להתכונן ולעשות סימולציות כי הבעיה זה בעיקר הזמן. \n\nהשורה התחתונה: לא ברור למה עדיין עושים את הקורס הזה, אבל אני נהניתי.", "timestamp": 1705307988022}, {"author": "שם", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ד\"ר דן שפרי\nחוות דעת - הרצאות: \nלא הייתי, עברתי לבד לפני התרגולים . \n\nשם המתרגל/ת: דוד רוזנשטוק\nחוות דעת - תרגולים: \nמתרגל מעולה. מסביר בברור וחד על החומר. \n\nשעורי הבית: נורא ואיום, אבל אין לכם מה לעשות עם זה. זה קורס חובה\n\nהמבחן:  תבואו לשעות הקבלה לפני המבחן! \n\nהשורה התחתונה:", "timestamp": 1706014521821}]}