{"posts": [{"author": "S", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלה לוין\nחוות דעת - הרצאות: לא הייתי בגלל אילוצי לו\"ז. לא מאוד קשה להשלים מסיכומים או מהמצגת ולרוב גם אפשר פשוט לבוא לתרגול ולתפוס את כל החומר בכל מקרה. אבל אם הייתי יכול מבחינת לו\"ז הייתי מגיע.\n\nשם המתרגל/ת: אביעד רוטבוים\nחוות דעת - תרגולים: תותח. עובר על החומר התאורטי לפני כל תרגול. עושה את כל התרגילים באיזון משולם בין עבודה עם המצגת לעבודה על הלוח. הכל ברור לחלוטין. ואיכשהו עדיין מסיים 20 דקות לפני הזמן רוב הפעמים.\n\nשעורי הבית: גיליון בערך כל שבוע. חובה להגיש 8 מתוך 10. די פשוטים ומאוד משקפים את הרמה במבחן. תואמים בדיוק את מה שלומדים בתרגול. כל גיליון לוקח בערך שעה וחצי-שעתיים. לדעתי היה רק גיליון אחד שלקח לי יותר מזה.\n\nהמבחן: יחסית קליל. חצי אמריקאי (7-8 שאלות) + שתי שאלות פתוחות (לרוב הפתוחות יותר על הנושא של סטטיסטיקה מאשר על הסתברות). מאוד דומה למה שעושים בשיעורי בית. לא קשה להוציא 90+ עם כמה ימים של למידה ודף נוסחאות טוב (אבל כן חשוב ללמוד לקראת).\n\nהשורה התחתונה: לדעתי הקורס שהייתי צריך להשקיע בו הכי מעט מאמץ מתחילת התואר. רק חשוב להישאר על זה כל הסמסטר ולא לפתוח פערים. יכול בקלות להרים ממוצע.", "timestamp": 1715323775049}, {"author": "L", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלה\nחוות דעת - הרצאות: \nמרצה טובה נותנת את כל ליבה להרצאות\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nמתרגל אלוף,התרגול מובן מאוד ומסובר בצורה מצוינת\nשעורי הבית: \nדרוש מאמץ קטן\nהמבחן: \nהלך דיי סבבה\nהשורה התחתונה: \nקורס דורש מאמץ קטן אבל ניתן לקבל בו ציונים גבוהים", "timestamp": 1715880223720}, {"author": "D", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלה\nחוות דעת - הרצאות: היא סבבה, מאוד מאוד נחמדה, קצת איטית. אבל כדאי להגיע, לפחות להרצאות האחרונות.\n\nשם המתרגל/ת: אביעד\nחוות דעת - תרגולים: הבנאדם מרצה של קורסים דומים מחוץ לטכניון, אז הוא ממש בעניינים.\nחד מאוד על החומר ויודע להריץ אותו מהר בלי לפגוע ביכולת ההבנה.\n\nשעורי הבית: \nלא קשים מדי.\n\nהמבחן: \nדי קל, הבדיקה של הפתוחות הייתה סבבה.\n\nהשורה התחתונה: כמו הקורס הכלל טכניוני רק עם פחות חומר.", "timestamp": 1716017710027}]}