{"posts": [{"author": "עידו לביא", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יהב \nחוות דעת - הרצאות: יהב ממש משקיע בהרצאות, היו לנו בסמסטר קורונה 8 הרצאות, חלקן גלשו מהזמן \n\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: תמציתיים וממוקדים, נחמד\n\nשעורי הבית: לא עמוס מלבד גליון של הסימולצייה\n\nהמבחן: הגיוני, לא קל לא קשה\n\nהשורה התחתונה: אחלה שינויים של יהב,פרויקט סופי לא קליל", "timestamp": 1597831541630}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ד\"ר יהב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בסמסטר שלנו היו הקלות ונתנו 4 ש\"ב אך הרביעית הייתה קשה, אבל אינם עמוסים והסגל מתחשב.\n\nהמבחן:  לא קשה\n\nהשורה התחתונה: \nהפרויקט קצת עמוס.", "timestamp": 1598213299946}, {"author": "Noam Sharoni", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יהב מורג\nחוות דעת - הרצאות: הועבר בזום, אני באופן אישי לא עקבתי כלכך אבל המצגות מסודרות (אבל ארוכות\n\nשם המתרגל/ת: הועבר בזום\nחוות דעת - תרגולים: אחלה תרגולים, תורמים להבנה\n\nשעורי הבית: כולם רלוונטים וסבירים פרט לפרוייקט ולתרגיל הבית בתכנת flux\n\nהמבחן: \nללמוד מהמבחנים מהשנים האחרונות...\nהשורה התחתונה:", "timestamp": 1603258327717}, {"author": "Penina Padwo", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דר. יהב מורג\nחוות דעת - הרצאות: טוב\n\nשם המתרגל/ת: מר אמיר הילמן\nחוות דעת - תרגולים: טוב\n\nשעורי הבית: 4 הגשות + פרוייקט יחסית גדול\n\nהמבחן: דומה לחומר הנלמד\n\nהשורה התחתונה: קצת עמוס", "timestamp": 1603258952641}, {"author": "Adi", "difficultyRank": 2, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: בזבוז זמן. לא הייתי כל הסמסטר\n\nשם המתרגל/ת: אמנון אייל\nחוות דעת - תרגולים: התרגולים חשובים כדי להבין את החומר. עיקר הלמידה הייתה מהתרגול ולא מההרצאות\n\nשעורי הבית: לא עמוסים כל כך. פעם בשבועיים בערך ומגישים בקבוצות. עשה חזרה טובה על החומר.\n\nהמבחן: מבחן לא קל אם לא בקיאים בחומר.\n\nהשורה התחתונה: קורס חובה אז אין כל כך מה להגיד. החומר לא קשה רק צריך טיפה להיכנס לראש של הנע וזה אמור להיות בסדר.", "timestamp": 1603810015321}, {"author": "סופוקליס", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מורג יהב\nחוות דעת - הרצאות: יהב משתדל מאוד אבל לי אישית הרגיש שדחסו המון חומר במעט זמן ולא קלטתי כלום בהרצאות\n\nשם המתרגל/ת: הילמן אמיר\nחוות דעת - תרגולים: תכלס את החומר לומדים בתרגולים\n\nשעורי הבית: סבירים מלבד השאלה בFLUX בגליון הראשון\n\nהמבחן: סבבה, דומה לתרגולים\n\nהשורה התחתונה: בעיקר מרגיש שהקורס צריך להיות הרבה יותר נק\"ז ממה שהוא. מלבד הרצאות תרגולים שעורי בית ומבחן יש גם פרויקט גדול, וובינרים, צריך בעצם ללמוד FLUX,simulink,simscape ומרגיש שזה קורס שצריך להיות 4 נק\"ז.", "timestamp": 1625647277191}, {"author": "האננס", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: מורג יהב\nחוות דעת - הרצאות: לא יודעת, לא הייתי בהרצאות. \nלפי דעתי דיי מיותרות, רק לשים לב להביא אותם למבחן כי אצלנו הייתה שאלה מההרצאה.\n\nשם המתרגל/ת: ניר דרוקר\nחוות דעת - תרגולים: מלמד סבבה ומעביר את החומר בצורה הגיונית.\n\nשעורי הבית: דיי קשורים לחומר. משאבת זמן, במיוחד ללמוד FLUX (התוכנה הארכאית ביותר שיכלו להקריץ) ושהסגל בעצמו לא יודע איך משתמשים בה.\nיש \"פרוייקטון\" (45% מהציון = 1.125 נק\"ז, גדול יותר מהמבחן אבל עדיין קוראים לביזיון הזה פרוייקטון) שהוא בזבוז של זמן.\nצריך לבנות \"מנוע חשמלי\" שלא עובד בעזרת הבית מלאכה הלא מתפקד של הפקולטה, להריץ סימולציות בFLUX, לסכם הכל ולהגיש מצגת ובסוף עדיין מתקמצנים על ציונים כאילו שזה עולה להם כסף. \nהמלצה שלי (גילוי נאות מישהו מהמחזור שלי עשה ולא אני): תבנו מנוע שנראה יפה בתמונות ופשוט תכניסו נתונים משלכם, אין דרישה פיזית להראות שהמנוע באמת עובד או הגנה על ההגשה. באמת חבל שתבזבזו את הזמן חופש היקר שלכם.\n\nנ.ב. ההגשה של הפרויקט היא חודש וחצי אחרי תקופת מבחנים ככה שאם עוד לא הרגשתם שמזלזלים בכם אז אולי עכשיו תבינו למה אני מתכוונת.\n\nהמבחן: שטויות. חומר פתוח עם מחשב ואייפד על מצב טיסה.\nתלמדו כמו שצריך 4-5 ימים לפני ותבואו עם כל המצגות מוכנות ויהיה סבבה.\n\nהשורה התחתונה: קורס של זלזול, הסגל מנותק מאוד ורק מעמיס במשימות ולא מוכן לעזור (רוב המקרים גם לא יודע לעזור) \nקורס חובה אז תהנו ::)", "timestamp": 1672062945668}, {"author": "מנוע חשמלי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "השורה התחתונה: קורס עם פוטנציאל, שמתנהל בצורה בזיונית לחלוטין - אין פידבק על כלום, המרצה ממציא שטויות, יש פרויקט עם מרכיב פיזי (+ שיעורי בית + מבחן) שהאחראי עליו הוא סטודנט שנה ד' שבקושי נמצא בקמפוס. אם לא היה קורס חובה, הייתי ממליץ להתרחק ממנו כמו מאש!\n\nשם המרצה: יהב מורג\nחוות דעת - הרצאות: מלא חומר ומלא דוגמאות, אבל יהב מלמד בצורה מאוד מאוד יבשה ומשעממת.\n\nשעורי הבית: משום מה שיחררו את 3 מתוך 5 הגשות בשלושה שבועות האחרונים של הסמסטר, ללא הסבר מתאים. באופן כללי שיעורי הבית לקחו הרבה זמן (ושינו הכל אז אין רפרנסים), ואין שום פידבק אז קשה לדעת אם צודקים או נמצאים בכיוון הנכון\n\nהמבחן: אקראי לחלוטין, עם טריקים ושטיקים שלא נלמדו (ובלמידה למבחנים - רואים שאותו טריק/שטיק נפתר בצורה שונה בשנים שונות, עם תוצאות שונות מהותית)", "timestamp": 1689349744738}, {"author": ":)", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יהב מורג\nחוות דעת - הרצאות: \nיהב מאוד נחמד, מעביר את החומר בצורה לא טובה ואטרקטיבית לדעתי. בשלב כלשהו הבנתי שההרצאות לא קריטיות להצלחה בקורס אז הפסקתי להקשיב וניצלתי את הנוכחות לבונוס שהוא נותן ועשיתי דברים אחרים. קשה להקשיב להרצאה לאורך זמן (שעה מאוחרת ביום + רמת ההרצאה לא טובה = באסה). ההרצאות מוקלטות ומועלות משנים קודמות אז שווה לנסות אותן כאלטרנטיבה כי החומר חשוב לדעתי להמשך הקריירה.\n\nשם המתרגל/ת: ניר דרוקר מוקלט\nחוות דעת - תרגולים: קלילים, מהירים וטובים. אם אפשר פרונטלי אז כדאי כי לפעמים לא מבינים בכלל מה הוא אומר ולשאול היה עוזר\n\nשעורי הבית: קלים חוץ מאלו שמשלבים סימולינק ופלאקס שהם מורכבים יותר.\n\nהמבחן: 40% מהסופי, יחסית סבבה ואפשרי ללמוד אליו גם בלי להיות צמוד לקורס בארבע ימים.  \n\nהשורה התחתונה: קורס חשוב, מועבר ומנוהל בצורה לא טובה לצערי, פרויקט עם דרישות מוגזמות יחסית לנק\"ז של הקורס.", "timestamp": 1689852919447}, {"author": "תלת פאזי", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "עד היום אף פעם לא כתבתי ביקורת על קורס, אבל הקורס הזה שבר אותי. הכל בקורס הזה עולה על גדותיו ומוגזם ויוצא מפרופורציה. הרצאות עם עשרות שקפים במצגת, שכדי להספיק אותם המרצה מדבר בקצב כל כך מהיר שפשוט אי אפשר לעקוב או להבין משהו. הקורס דורש בנוסף לחומר התיאורטי ללמוד את התוכנות של סימולינק, סימסקייפ ופלאקס, ולמרות שיש כביכול שיעורים ותרגולים שמוקדשים לזה אי אפשר להבין מהם כלום עד שיושבים על זה בעצמך שעות על גבי שעות. גם אחרי שישבתי שעות ולמדתי את הטוטוריאלס שיש בתוך הממשק של הסימולינק והסימסקייפ, עדיין לא ידעתי איך לעשות את שיעורי הבית, כי לא מלמדים את כל הרכיבים שצריך בעיקר בדומיינים המגנטי והמכני וצריך להבין בעצמך. הפלאקס אותו דבר, שעות על שעות כדי ללמוד את כל הפרטים. ועוד לא דיברנו על גולת הכותרת, הפרויקט, עם דרישות מוגזמות ומופרכות, כולל בנייה פיזית, סימולציות בכל התוכנות, מצגת של עשרות שקפים, ביצוע של המון ניסויים. זה נראה שיש מישהו בסגל של הקורס שנמצא במנטליות כזו שהקורס צריך להכיל כמה שיותר, שכמה שיותר זורקים חומר על הסטודנטים וכמה שיותר דורשים מהם ככה הקורס יותר מעשיר או חוויתי או משהו כזה, בלי קשר למספר הנקודות או השעות של הקורס, ויש שלב שהאפקט הזה פשוט מתהפך, ובמקום הערכה זה כבר יוצר מיאוס. \n\nשם המרצה: יהב מורג\nחוות דעת - הרצאות: יהב נחמד וסימפטי, ייאמר לזכותו. זה נראה שכן חשוב לו לבוא לקראת הסטודנטים וכנראה הוא לא רואה את המציאות שנוצרת בקורס הזה. לגבי ההרצאות עצמן, כאמור, כמויות אדירות של חומר שנשפכות עליך כמו דלי עם מים, בקצב שאין מצב לעמוד בו בזמן אמת.\n\nשם המתרגל/ת: ניר דרוקר ודניס איווניצקי\nחוות דעת - תרגולים: אם יש משהו מאוזן בקורס הזה, זה התרגולים. מצגות שמכילות בדיוק את מה שצריך, כמה שצריך, מאוד לעניין.\n\nשעורי הבית: 5 גיליונות שהם סך הכל סבירים, חוץ מהקטע שרוב ההתעסקות איתם הולכת על ההתמודדות עם הסימולינק הסימסקייפ והפלאקס במקום על הלמידה של החומר עצמו ופתרון התרגילים היבשים.\n\nהמבחן: סביר.\n\nהשורה התחתונה: קורס שהיה יכול להיות הרבה יותר נעים אלמלא התחושה הזו שעוברת לאורכו של המוגזמות, הכל מוגזם, הרצאות מוגזמות, התעסקות מוגזמת עם תוכנות, פרויקט מוגזם עם דרישות מוגזמות. אני אסכם בפרסומת מהניינטיז לחטיף של ורד הגליל, מי שלא מכיר שיחפש ביוטיוב: מוגזם מוגזם מוגזם, מוגזם מוגזם מוגזם, מוגזם מוגזם מוגזם.", "timestamp": 1691498461390}, {"author": "t", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה:  יהב\nחוות דעת - הרצאות:  משמים אבל שווה את הבונוס שהוא נתן על נוכחות\n\nשם המתרגל/ת:  לא הלכתי\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: מעיקים. הפרויקט בסוף כאב ראש רציני\n\nהמבחן: נוסחאות וודו שאני נעל בית אם מישהו (שלקח את הקורס) מבין מה הן עושות ולמה הן נראות כמו שהן נראות. בסוף זה להציב לקבל תשובה ולא להתפלסף יותר מדי\n\nהשורה התחתונה: אין לכם ברירה :)", "timestamp": 1706001342508}]}