{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: ניתאי דרימר\nחוות דעת - הרצאות: די מיותרות, אין ממש קשר בינן לבין התרגולים והשיעורי בית, שווה אבל להסתכל על המצגות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כמעט כל שבוע, בדרכ עמוסים וייקחו זמן, בסוף הסמסטר הם נהיים קצרים.\n\nהמבחן: הוגן בסך הכל.\nהשורה התחתונה: סגל מזעזע. הקורס די מיותר מאחר וגם ככה יש אחר כך שרטוט ממוחשב... יש שם כמה דברים נחמדים אבל לא יותר מזה.", "timestamp": 1597944419212}, {"author": "yaaokv", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: נתאי דרימר\nחוות דעת - הרצאות: \nמשעממות רצח\nשם המתרגל/ת: הדר שאוליאן\nחוות דעת - תרגולים: \nהמתרגלת הטובה היחידה בקורס הנורא הזה\nשעורי הבית: \nהרבה, כל שבוע הגשה שדורשת הרבה שעות עבודה לפעמים\nהמבחן: \n\nהשורה התחתונה:  קורס מיותר לחלוטין", "timestamp": 1598347438422}, {"author": "yuval", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: ניתאי\nחוות דעת - הרצאות: הרצאות משעממות ולא קשורות לחומר שבש\"ב או במבחן \n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים:  עצלן\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס גרוע", "timestamp": 1598375239312}, {"author": "SJ", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: ניתאי דרימי\nחוות דעת - הרצאות: משעממות ומיותרות, מזל שהיה זום ונוכחות לא הייתה חובה\n\nשם המתרגל/ת: הדר שאוליאן\nחוות דעת - תרגולים: תותחית, קרן אור יחידה של הקורס המבזה הזה\n\nשעורי הבית: ארוכים ומייגעים\n\nהמבחן: קשוח\n\nהשורה התחתונה: קורס מיותר", "timestamp": 1598375580946}, {"author": "Shai Baruch", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: ניתאי מקדרימי\nחוות דעת - הרצאות: על כפול 3.7 אפשר עוד לראות את זה אם מדלגים פה ושם\n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים: הלוואי והייתי יכול להגיד שהוא כל המן חיפש לעשות את המינימום, כי גם את זה הוא לא עשה. מתרגל גרוע ושחצן\n\nשעורי הבית: כל שבוע יש הגשה ובסך הכל זה די מזעזע. היו 3-4 גליונות קלים והשאר היו סיוט שלא ברא השטן. ממש לא תואם את הרמה ה\"נלמדת\" בהרצאות ובתרגולים\n\nהמבחן: סביר\n\nהשורה התחתונה: אני לא יודע אם זה רק בגלל הקורונה, בעיקר בגלל הקורונה או לא קשור לקורונה - אבל אני באמת לא יכול לדמיין קורס יותר גרוע ממבוא לשרטוט הנדסי. מהיום הראשון ועד האחרון הם כל פעם מצאו דרך אחרת לעלות לנו על העצבים ולהוריד את הרף לא רק של הקורס אלא של הטכניון כולו", "timestamp": 1598378531178}, {"author": ",", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ניתאי דרימר\nחוות דעת - הרצאות: שווה לעבור על המצגות באתר, לפעמים יש דברים שימושיים שם. הדגמות בהרצאות יכול להיות יעיל- עוזר לפעמים. אם רוצים לראות,  שווה לראות בוידאו על פי שתיים ולחסוך זמן\n\nשם המתרגל/ת: הדר שאוליאן\nחוות דעת - תרגולים: מתרגלת מצויינת. יודעת את החומר בצורה מעולה. סבלנית, מסבירה בצורה יסודית למי שלא מבין. מדגימה דברים ככה שאתה יכול לראות את זה. \nממליץ ללכת לשעת קבלה שבועית אצלה. שווה ממש!\nבסמסטר רגיל, חובה ללכת לתרגול שאליו אתה רשום, לוודא בתחילת סמסטר שאתם רשומים אליה!\n\nשעורי הבית: שיעורי בית שבדרך כלל ארוכים, מייגעים ומתישים. דרכם מבינים את החומר בצורה טובה, גם אם לוקח הרבה זמן. שואב זמן, אבל אם משקיעים בזה, מבינים את כל הטריקים והשיטות הנדרשות. שיעורי בית כל שבוע שצריך להגיש תוך שבוע (12 במספר)\n\nהמבחן: קשה בדרך כלל, אבל אם משקיעים בהבנה יסודית, ניתן להצליח בצורה טובה. \n\nהשורה התחתונה: רוב סגל הקורס לא אכפתי. צריך ללמוד לבד ולהיעזר ממה שיש.", "timestamp": 1598379078415}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: ניתאי\nחוות דעת - הרצאות: מיותר לחלוטין (למעט הרצאה על ספליין בסוף הסמסטר)\n\nשם המתרגל/ת: כלל המתרגלים\nחוות דעת - תרגולים: בסמסטר מקוון תרגולים פשוט לא מובנים ולא עוזרים כמעט לפתור את שיעורי הבית \n\nשעורי הבית: מייגעים, השיטה הרווחת היא לרפרנס\n\nהמבחן: הוגן, נעזרים בחומרי עזר מהדרייב ומעט מהמבחנים של שנים קודמות \n\nהשורה התחתונה: קורס לא טוב במתכונת קורונה", "timestamp": 1599548279546}, {"author": "חייב?", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: ניתאי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לוקח הרבה זמן ברוב השב\n\nהמבחן: היה קשה אבל נתן פקטור כמו מלך\n\nהשורה התחתונה: אין ברירה אבל תכינו את עצמכם נפשית", "timestamp": 1601882284556}, {"author": "Guy Sonenzon", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: ניתאי דרימר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלים אבל דורשים המון זמן\n\nהמבחן: קצת צפוף מבחינת זמן כיוון שהשרטוט עצמו לוקח זמן, אבל הוגן וכלל את החומר הנלמד\n\nהשורה התחתונה:", "timestamp": 1609403141902}]}