{"posts": [{"author": "!", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יצחק בוכר\nחוות דעת - הרצאות: ההרצאות היו מוקלטות ולא מובנות, הקריא מPDF, בשעות קבלה היה יותר ברור.\n\nשם המתרגל/ת: הוקלט בזום-כל תרגול עושה מתרגל אחר\nחוות דעת - תרגולים: דוד רוזנשטוק היה הכי ברור וענייני.\n\nשעורי הבית: אין\n\nהמבחן: לא היה, היה במקום 3 פרוייקטים ו-3 בחנים. הפרוייקטים מאד עמוסים וגזלו הרבה זמן.\n\nהשורה התחתונה: ממליץ לא לקחת אם מועבר בזום. ולא בסמסטרים עמוסים.", "timestamp": 1612360107869}, {"author": "DK", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יצחק בוכר\nחוות דעת - הרצאות: \nהרצאות די מעניינות, מבין הקורסים היותר משמעותיים שהיו לי בתואר.\nדי קשה ועמוס אבל הציונים בסוף יפים.\n\nשם המתרגל/ת: אייל ברוך\nחוות דעת - תרגולים: \nאלעד ואייל שני מתרגלים שמשקיעים בטירוף ומלמדים יוצא מן הכלל.\n\nשעורי הבית: \nלא זוכר\n\nהמבחן: \nתחרשו ובסוף החומר יורד ומצליחים, הציונים באמת יפים.", "timestamp": 1653905387751}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יולי סטרוסבצקי\n\nחוות דעת - הרצאות: \nיולי אחד המרצים הכי מקשיבים והכי אכפתיים כלפי סטודנטים, והדבר ניכר בכל בקשה כלפיו. עם זאת הוא לא מאוד כריזמטי וקשה לעקוב אחריו בהרצאות. חלקן הוא כותב על הלוח ובחלקן הוא משתמש במצגת.\n\nשני מתרגלים בקורס: אלעד ואייל. היתרון באלעד שהוא משאיר את הכיתה מאוד מרוכזת אבל יש לו תסביך שהוא חושב שהוא מצחיק אבל זה סתם קרינג'. בנוסף הוא מאוד גרוע בלענות על שאלות בשעות קבלה\\במייל ואינו עוזר.\nאייל לעומת זאת בחור מקסים שיש לו המון קשב וסבלנות לסטודנטים, והרגשנו הרבה יותר בנוח איתו בשיח אישי. גם אייל בעצמו מתרגל מעולה ויודע להעביר חומר בצורה מדהימה.\nחוות דעת - תרגולים: \nהתרגולים מכסים דיי טוב את הנושאים בקורס אבל לא את כולם. יש נושא\\שניים שלא נלמדו בכלל בתרגולים ומופיעים במבחנים ובפרויקטים במהלך הקורס.\n\nשעורי הבית: \nשלושה פרויקטונים לאורך הסמסטר, מאוד עמוסים ודורשים תשומת לב לפרטים הכי קטנים אחרת מורידים נקודות על שטויות, צריך לשים לב טוב להנחיות כתיבת דוחות שמופיעים במודל.\n\nהמבחן: \nדורש הבנה מעמיקה בחומר וטריקים מתמטיים נרחבים כדי לקצר זמנים במהלך המבחן. יולי כותב מבחן ארוך מאוד, ותוך כדי הבחינה מבין את זה ונותן הארכה בהתאם.\nהשורה התחתונה: \nהיה מאוד מעניין מבחינה מתמטית, אבל חושב שרוב הפרקטיקה של המקצוע אינה רלוונטית למגמת רבדים.", "timestamp": 1676791836790}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יולי סטרוסבצקי\nחוות דעת - הרצאות: אכפתי מאוד כלפי הסטודנטים, קשוב אך לדעתי שם את הדגש יותר מידי על האנליטיקה והפיתוחים ופחות על הפרקטיקה והיישומים של הכלים הנלמדים בקורס.\n\nשם המתרגל/ת: אלעד טננבאום\nחוות דעת - תרגולים: מתרגל טוב, מצליח להחזיק את הכיתה בהקשבה ולאורך זמן ועונה על שאלות גם אחרי התרגול. הרבה בדיחות, לפעמים מעצבן ולא קשור, לרוב מצחיק. קצר מידי לשעה בודדת, לרוב לא מספיקים לעבור על הכול באופן מלא.\n\nשעורי הבית: 3 פרויקטים גדולים. שתפו פעולה כדי לפתור אותם במלואם ונכון כדי להוציא מהם את המיטב כי בבדיקה אלעד ואייל מורידים על כל שטות ודבר קטן שלא בא להם טוב בעין.\n\nהמבחן: גדול, מצריך הכנה רצינית לקראתו ומעבר מקיף על החומר. מומלץ ללכת ליולי לשעות קבלה לשאול שאלות ולהציף פערים - הוא עוזר לסגור אותם ועונה ישירות בדומה מאוד לשאלות שהוא שואל במבחן. כנ\"ל גם בפרויקטים.\n\nהשורה התחתונה: קורס מעניין ועמוס מאוד יחסית ל-3 נק\"ז, הנושאים הנלמדים מרתקים אך כשהמרצה והמתרגלים לא מתואמים בצורה טובה וכל אחד מהצדדים שם את הדג\"ש על נקודות שונות, מקבלים קורס לא פרופורציולי לכמות נקז שלו ומחסור בתרגול בנושאים רבים. את הפער המיותר הזה אנחנו הסטודנטים צריכים לסגור לקראת הבחינה וזה סתם מבאס. \n\n*הקורס הופך לחובה אז יכול להיות שישתנה לגמרי אז ראו ביקורת זו בערבון מוגבל.", "timestamp": 1676910107952}, {"author": "S", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יואב ורד/יצחק בוכר\nחוות דעת - הרצאות: טכנית יואב היה המרצה האחראי של הקורס אבל עד שבוע 7 הוא היה במילואים אז למדנו עם בוכר. בוכר מרצה מעולה וכיף ללמוד ממנו. הוא קצת מבולגן וספציפית פה היה נראה שהוא לא בדיוק מעביר את הקורס כמו שהוא היה רוצה כי הוא לא רצה לשנות ליואב את הפורמט אז היה קצת מוזר.\nיואב מרצה חדש ורואים את זה, לא מאוד מסודר ומאבד את הכיתה מאוד מהר בזמן השיעור. קבצי ההרצאה טובים ועוזרים לסגור את הפינה. אבל קשה ללמוד מיואב.\n\nשם המתרגל/ת: דורין רואינסקי\nחוות דעת - תרגולים: יש רק שעה לתרגול בקורס הזה וזה ממש ממש לא מספיק. צריכים לדלג על שלבים חישוביים קריטיים כדי להספיק הכל וגם אז בדר\"כ לא מספיקים. דורין עשתה את המיטב עם מה שהיה לה וכן עזרה לי להבין נושאים קשים. לפעמים אבל צריך לחדד אותה קצת על החומר כי היא כן עושה טעויות.\n\nשעורי הבית: יש שני פרוייקטים. הראשון הוא ניתוח תאורטי די ארוך של מערכת עם פתרונות נומריים. עוזר מאוד להבנה של החומר אבל היה מאוד ארוך לפיתרון בין היתר כי פרסמו אותו עם מלא טעויות וסעיפים לא ברורים ואז כל הזמן היו צריכים לתקן.\nהפרוייקט השני הוא לעשות ניסוי ממש קצר על המערכת שניתחנו בחלק הראשון ואז להתאים את המדידות למודל מחלק א. ההגשה עצמה היא במצגת מוקלטת ולא בכתב שזה קצת קדר. בהתחלה החלק השני נראה יותר קל אבל התברר שהוא סופר אינטסיבי אולי אפילו יותר מהראשון. \nצריך לעבוד קשה בשביל ציון גבוה. שמעתי על אנשים שקיבלו גם 70-80 שזה מבאס לקבל בפרוייקט.\n\nהמבחן: נתנו פורמט חדש. 8 שאלות אמריקאיות יחסית קצרות ואז עוד שאלה פתוחה עם 7-8 סעיפים. סה\"כ מבחן הוגן. לא הכי קל ללמוד אליו כי אין הרבה מבחני עבר וגם אלו שיש הרבה פעמים די שונים ממה שלמדנו השנה ועובדים על דגשים שונים.\n\nהשורה התחתונה: קורס קשה אבל מאוד מעניין. \"תנודות\" נשמע יחסית נישתי אבל אפשר להתייחס לקורס הזה פשוט בתור \"דינמיקה 2\". הדברים שלומדים פה חשובים ממש ומשתמשים בשיטות האלה גם בתעשייה.", "timestamp": 1717181838861}]}