{"posts": [{"author": "Nir Zipris", "difficultyRank": 2, "generalRank": 3, "semester": "201901", "text": "שם המרצה: לאוניד טרטקובסקי\nחוות דעת - הרצאות: \nעד השלב של מחזורי עבודה - מעניין ואפילו מהנה. ממליץ לא ללכת להרצאות כשמתחילים מחזורי עבודה - סופר משעמם ועדיף לעבור טוב על התרגולים בנושא\n\nשעורי הבית: גליונות ללא חובת הגשה אבל מומלץ לעשות אחרת מאבדים את ההרצאות מאוד מהר. מאוד ממליץ ללמוד טוב ולגשת לבוחן אמצע כי זה יסגור חלק גדול מאוד בקורס\n\nהמבחן: יש בערך 5 טריקים שחוזרים על עצמם בכל המבחנים - תלמדו אותם טוב ותהיו מוכנים למבחן", "timestamp": 1598430578012}, {"author": "ר", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לאוניד המלך\nחוות דעת - הרצאות: ארוכות, אבל לאוניד מלך ויש לו חוש הומור וזה נחמד\n\nשם המתרגל/ת: אמנון אייל\nחוות דעת - תרגולים: מלך!!! מומלץ מאוד. מסביר טוב\n\nשעורי הבית: לא חובה, בחלק מהגליונות יש טעויות וזה מעצבן שלא מתקנים כבר שנים. תתרגלו בחני אמצע או מבחנים (בהתאם לשלב בסמסטר)\n\nהמבחן: לא קל, אבל פשוט צריך לדעת את החומר. תקפידו להיות על החומר כל הזמן\n\nהשורה התחתונה: לאוניד צריך לעלות על השולחן!", "timestamp": 1614182162353}, {"author": "JFK", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: לאוניד טרטקובסקי\nחוות דעת - הרצאות: מרצה ברור ומשעשע, החומר בארבעת השבועות האחרונים קצת משעמם אבל חוץ מזה היה ממש מעניין.\n\nשם המתרגל: אמנון אייל\nחוות דעת - תרגולים: מסביר את החומר בצורה ברורה ומסודרת ונותן טיפים לבוחן/למבחן.\n\nשעורי הבית: שבועיים, לא להגשה. חשוב לעשות את שיעורי הבית כדי להבין את החומר.\n\nהמבחן: הוגן ומאוד דומה למבחנים משנים קודמות.\n\nהשורה התחתונה: קורס ממש מעניין ומומלץ!", "timestamp": 1614980821158}, {"author": "Alen", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ליאוניד טרטקובסקי\nחוות דעת - הרצאות: ראיתי את ההקלטות בזום עם מהירות מוגברת , פעם אחת באתי פרונטלית ומרגיש שהרבה דיבורים מבזבזים את הזמן . עם זאת בדרך כלל אחרי כל הרצאה יש הרבה שאלות כי החומר מאוד מעורפל וקשה להבין אותו בהתחלה .\n\nשם המתרגל/ת: אנדי\nחוות דעת - תרגולים: ראיתי הקלטות שלו , תרגולים של שעה במקום שעתיים וממש ממצים את הנלמד .\n\nשעורי הבית: ארוכים כמו התואר , יש בהם הרבה טעויות שלא מתקנים כבר 15 שנה אך הם נותנים הבנה טובה לחומר הנלמד . מומלץ לעשות אותם\n\nהמבחן: הוגן , לא קשה אך גם לא קל . דורש הבנה .\n\nהשורה התחתונה: קורס מעניין , אך לא רגיל בצורת לימוד שלו , במנטליות שלו ובחומר שמועבר בו .", "timestamp": 1647266826060}, {"author": "ks", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  לאוניד\nחוות דעת - הרצאות:  פרסמו הקלטות של שנה שעברה וזה מדהים כי הוא מדבר ממש לאט והרצאה שהייתה אמורה להיות 3 שעות הופכת לשעה וחצי.\n\nשם המתרגל/ת: אמנון\nחוות דעת - תרגולים:  השגתי הקלטות של אמנון של שנה שעברה(בסמסטר שלנו הוא כבר לא תירגל) והוא ה-מתרגל שעשה לי את הקורס!! \nשעורי הבית: אין חובת הגשה והם לא קשים, ממולץ לעשות אותם ולא לדחות לסוף הסמסטר זה מה שישאיר אתכם על החומר לאורך הסמסטר\nהמבחן:  הוגן \nהשורה התחתונה:  קורס מעניין מאד שיצא לו שם רע ולא בצדק לדעתי.\nאני ממליץ גם להשתמש בשעות קבלה של המתרגלים זה ממש עוזר לסגור פערים במהלך הסמסטר.", "timestamp": 1647422465171}, {"author": "המשמיד", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לאוניד טרטקובסקי \nחוות דעת - הרצאות: \nמרצה באמת תותח, הוא קצת מאוד מונוטוני אבל זה סביל כי הוא מצחיק מאוד ומעביר את החומר בצורה סבבה. הקורס עצמו, בסופו של יום מתנקז רק למחזורי עבודה שהם סוף הקורס- אם אתם יודעים מחזורי עבודה אתם כנראה יודעים את כל הקורס.\nסהכ ההרצאות היו סבבה, לא הזיקו, במיוחד שיש את לאוניד בהקלטה שניתן להריץ. המקצוע עצמו סופר טכני ולא דורש הבנה, אולי בהתחלה תשברו ראש קצת אבל אחרי שתעברו 2/3 קורס יהיה פיקס.\n\nשם המתרגל/ת: אנדי\nחוות דעת - תרגולים: \nהיו לנו הקלטות ולייב. ההקלטות של אנדי משנים קודמות מעולות, הן גם מאוד זריזות ולא נמרחות על שעתיים (למעט תרגול אחד או שניים). התרגולים יותר חשובים מההרצאות כי הם שמים את הדגש הטכני של המקצוע.\n\nשעורי הבית: \nאין שב, הם רשות. אפשר לעשות אותם בשביל להשאר על החומר, צוות הקורס בדרך כלל מפרסם את הפתרון שלהם אחרי שבוע לדעתי. עם זאת, אפשר גם לא לעשות אותם להיות ממש על התרגולים.\n\nהמבחן: \nמבחן סבבה, מאוד טכני. אם מתרגלים מספיק יכולים להגיע ולקטוף ציון מאוד מכובד בהתחשב בעובדה שזה קורס ליבה בפקולטה של מכונות. בדרך כלל זה מבחן של שלוש שאלות, עם מחזורי עבודה, צילינדרים וכו'.\n\nהשורה התחתונה: \nקורס מאוד סבבה, לדעתי הקורס ליבה הכי סביר וסבבה במכונות. לא צריך ככ להשקיע בו, רק לקראת בוחן האמצע (אין שב בקורס)", "timestamp": 1647430578313}, {"author": "אלי באבא ו40 השודדים", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לאונירד\nוואלה החומר מלומד בצורה של שינון הגדרות ואז נדרש מהסטודנטים ללמוד בעצמם את השאר.\nלאונירד מרצה טוב ותומך בהקלטות, ואנדי גם תותח אבל פשוט משהו בקורס הזה לא מסתדר עד הסוף", "timestamp": 1648218108669}, {"author": "ג", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: מרצה מצחיק ונחמד, אבל ההרצאות היו הקראה ממצגת או שיחה, לעיתים על נושאים שלא באמת קשורים. היה קשה לי לשמור על חוט המחשבה בהרצאות שלו.\n\nשם המתרגל/ת: דוד דיסקין\nחוות דעת - תרגולים: אנדרייטד. מאוד אהבתי.\n\nשעורי הבית: לא חובה, אבל תעשו לעצמכם טובה ותשקיעו בהם כמה זמן שרק צריך.\n\nהמבחן: קשה ביותר, יש לתרגל המון לפני ולהתכונן מאוד ברצינות.", "timestamp": 1649881750961}, {"author": "mip", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: הרצאות מוקלטות של ליאוניד מאוד ממולצות, מסביר טוב ואפילו מצחיק\n\nשם המתרגל/ת: דוד חסין/ ניר (מוקלט)\nחוות דעת - תרגולים:דוד מסביר טוב, משקיע ממש בסטודנטים.\nהתרגלוים המוקלטים אולי לא באיכות הכי טובה אבל המתרגל מעולה ומסביר ממש טוב. רוב התרגילים אחד לאחד.\n\nשעורי הבית: אין, וזה חבל! מאוד מקשה על החיבור למשוואות ולנושאים שלומדים לאורך כל הקורס, נורא קל להזניח את הקורס להתעורר בסוף סמסטר ולהבין שאת/ה לא יודע/ת כלום\n\nהמבחן: השאלות בכללי קשות, יש המון דקויות ודברים להבין, צריך להיות חדים על החומר מבחינה תיאורטית! לא מספיק רק לענות על שאלות\n\nהשורה התחתונה:\nהמלצה: להשקיע לאורך הסמסטר- זה אומר לענות על הגיליונות וללכת לשעות קבלה באופן קבוע, אחרת לא נוגעים בחומר ולא משתמשים בנוסחאות עד המבחן...", "timestamp": 1676134808310}, {"author": "Yoav Golan", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: הרצאות מעניינות, חבל שאין מספיק זמן להעמקה\n\nשם המתרגל/ת: מתרגלים שונים\nחוות דעת - תרגולים: צוות מתרגלים תותח, מוכנים לתת מעל ומעבר בשעות קבלה \n\nשעורי הבית: רשות, מומלץ לפתור ולגשת לבוחן אמצע\n\nהמבחן: קשוח יחסית למועדים קודמים (אבל כל מתרגל נתן לפחות שתיים - שלוש שעות קבלה!)\n\nהשורה התחתונה:", "timestamp": 1676274082744}, {"author": "S", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: ברוב הנושאים הוא מאוד ברור ומאוד ישיר. מסיים הרצאות 15-20 דקות מוקדם יותר. לא מבזבז את הזמן יותר מדי בלאכול את הראש. די משעמם אבל עדיין ממליץ ללכת להרצאות.\n\nשם המתרגל/ת: דויד קייסר + הקלטות של אנדי.\nחוות דעת - תרגולים: דוד קייסר אחלה מתרגל אם כי קצת \"צהוב\". לא חושב שהוא הולך לתרגל בעתיד אבל ממליץ להימנע מדויד חסין כי הוא פשוט אומר שטויות לא נכונות בתרגולים וזה יכול ממש לבלבל.\nהקלטות של אנדי ממש טובות. מסיים תרגול שלם בשעה-שעה ועשרים במקום שעתיים. לא ממליץ להסתמך רק על ההקלטות כי בכל זאת הוא מאוד מהיר וקל לפספס נקודות חשובות אבל עוזר מאוד.\n\nשעורי הבית: לא חובה. מומלץ מאוד לעשות אותם אבל רק יחידי סגולה יצליחו למצוא את הזמן והמוטיבציה לעשות זאת. באמת שהיה עוזר אם היה עליהם ציון בשביל לדרבן אנשים לעשות אותם.\n\nהמבחן: לא קל אבל מאוד מאוד חוזר על עצמו. צריך ללמוד כמה טריקים וניסוחים שחוזרים על עצמם כל הזמן ואז אפשר לפתור בקלות כמעט הכל. לא לזלזל אבל, צריך להשקיע זמן בלמידה.\n\nהשורה התחתונה: לא קורס מאוד מעניין לטעמי אבל מאוד בסיסי וחשוב להבא. מרגיש נורא נורא מפושט ושמה שלומדים לא באמת קשור למציאות. קצת הוריד לי ממגמת אנרגיה.", "timestamp": 1676825165306}, {"author": "L", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רנה \nחוות דעת - הרצאות: \nמסביר בצורה טובה את נושאי ההרצאה. המצגות מובנות.\nשם המתרגל/ת: דוד קיסר(יש 3 דודים בקורס)\nחוות דעת - תרגולים: \nמתרגל סבבה, שמסביר בצורה את נושאי התרגול ופותר בצורה טובה את שאלות התרגול.\nשעורי הבית: \nאין בכלל, זה חיסרון ענקי מאוד בקורס .\nהמבחן: \nארוך ומעייף, מורידים בו על שטות הרבה נקודות\nהשורה התחתונה: \nקורס שדרוש לקיים בו הרבה ש\"ב", "timestamp": 1677536871502}, {"author": "בן", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רנה\nחוות דעת - הרצאות: \nמסביר טוב אבל המצגות באנגלית\n\nשם המתרגל/ת:  שמעון פיסנוי\nחוות דעת - תרגולים: \nבזכותו אני יודע תרמו, מעריך אותו מאוד.\n\nשעורי הבית:  \nלא חובה, כל מי שלא עשו לאורך הסמסטר ממליצים בחום.\n\nהמבחן: \nכל השאלות די דומות- יש מערכת שמורכבת מחלקים בעלי תכונות (חלקן נתונות) מסיומות וגז/ נוזל שעובר דרך כולם.\nצריך לאתר את שאר התכונות של החלקים (או ערך כללי כמו יעילות של כל המערכת).\nנשמע לכם מוכר? \nמדובר בקורס סודוקו בסטייל של הנדסה.\n\nהאתגר העיקרי זה להשתמש ביחידות מידה נכונות, ולאתר צירופים של 2 מקסימום 3 משוואות שימצאו לך את הנעלם הבא. \n\nהשורה התחתונה: \nלאורך הקורס רואים הרבה אינטגרלים ו dx במצגות אבל אל דאגה, עושים רק חשבון בקורס. \n\nקורס מגניב לדעתי.\n\n.", "timestamp": 1678883730750}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לאוניד(מוקלט)\nחוות דעת - הרצאות: \nהרצאה של שעה וחצי במקום שלוש שעות .\nתראו לאוניד במוקלט חבל על הזמן.\nשם המתרגל/ת: דוד דיסקין\nחוות דעת - תרגולים: \nאחלה מתרגל מאוד אהבתי הוא אחלא בן אדם עוזר לסטודנטים ועונה על שאלות אבל הוא לא עושה חזרה על החומר ולכן צריך להגיע לתרגולים שלו פיקס עם החומר שנלמד בהרצאה.\nשעורי הבית: אין וחבל.\n\nהמבחן: \nמבחן קשה צריך לדעת כל קטנה ולתרגל המון מבחני עבר.\nהשורה התחתונה: קורס חובה וקשה אבל נהניתי.", "timestamp": 1679529012474}, {"author": "an", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לאוניד מוקלט\nחוות דעת - הרצאות: שמים על 1.75 וזה פנאן. זה אותו חומר כבר שנים וזה לא ממש משנה מי המרצה בפועל.\n\nשם המתרגל/ת: דניס/קיסר/שמעון\nחוות דעת - תרגולים: המתרגלים עשו לי את הקורס, ממש מרגיש שהם חיים מכונות וזה פשוט כיף שיש שיח משותף שגולש גם לתחומים אחרים. \nכל השלושה סבבה. דניס הכי משקיע, ויש לו קבצי תרגול ממש מושקעים. הבאסה שיש לו נטיה לסבך הסברים ולהפוך בעיות פשוטות למסובכות, ולפעמים זה ממש גורם לך לצאת מהתרגול בלי להבין מה הולך שם.\n\nשעורי הבית: \nלא חובה, אבל הם ממש קשים, רמה מעל המבחנים. מי שעושה אותם (לבד) המבחן כנראה יהיה בכיס שלו.\nהמבחן: תמיד יש דברים קצת לא ברורים אבל נראה שבסוף אין מטרה כללית להכשיל.\n\nהשורה התחתונה: \nיש קצת תחושה שזה קצת Thermodynamics for dummies ובהמשך נגלה שחצי ממה שלמדנו זה בעצם הנחות מקלות שהן שקר.\nאבל מעבר לזה קורס כיפי, מכונות פרופר.", "timestamp": 1679782001391}, {"author": "SG", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: \nארוכות, לפעמים קצת משעממות ורנה מדבר לאט, אבל כדאי להגיע כי הוא כן ממקד וחלק מהנושאים מעניינים. הוא גם בדר\"כ משחרר מוקדם.\nשם המתרגל/ת: דוד קיסר\nחוות דעת - תרגולים: \nתותח, מסביר מצוין וכריזמטי ויודע להנגיש את הקונספטים היותר מורכבים, לא ממשיך בתרגולים אז פחות רלוונטי\nשעורי הבית: \nלא חובה (אין הגשה). ממליץ בכל זאת למצוא את הזמן לעשות אותם בעיקר כדאי לתרגל את העבודה עם הטבלאות קיטור, זה סזיפי ואיטי וגומר את הזמן במבחן אז עדיף ללמוד לעשות את זה כמה שיותר מהר.\nהמבחן: \nקשה, אבל לא בלתי אפשרי. מועד א' היה קשה מהממוצע ומועד ב' קל יותר אבל לא לבנות על זה. הרבה נושאים וסוגי שאלות חוזרים אז כדאי לעשות את כל מבחני העבר של רנה.\nהשורה התחתונה: קורס קשה וחשוב, אני לא הקפדתי על שיעורי הבית והתחרטתי על זה אחר כך.", "timestamp": 1680115715638}, {"author": "צור", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: \nאיטי טיפה, אבל נחמד, תכלס אפשר לראות הקלטות\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: \nמאוד מעמיק ויודע לענות על הכול\nטיפה רץ בתרגולים \n\nשעורי הבית: \nהכול כמעט ממוחזר מהדרייב\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713362637590}, {"author": "anon", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  לאוניד \nחוות דעת - הרצאות: \nמאוד מעניין, חומר רלוונטי ומרצה שאוהב ללמד ורואים את זה \n\nשם המתרגל/ת: דוד דיסקין\nמתרגל מעולה, יודע את החומר ומעביר אותו בצורה נוחה ומונגשת. משקיע בשעות קבלה ועונה על שאלות. מומלץ\nחוות דעת - תרגולים: \nבכללי כל המתרגלים בקורס אחלה ועוזרים\nשעורי הבית: \nקשים ולוקחים זמן אבל מלמדים. מומלץ לעשות \nהמבחן: \n\nהשורה התחתונה: \nקורס שגם המרצה וגם המתרגלים מעוניינים שנלמד אותו", "timestamp": 1714209133198}, {"author": "אא", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לאוניד טרטקובסקי\nחוות דעת - הרצאות: קשה מאוד איתו. מדבר לאטטטטטט\n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: \nמסביר טוב מאוד ועוזר, הבעיה היחידה שאם הוא מתחיל להסביר משהו קשה לו לסיים להסביר.\n\nשעורי הבית: \nבגלל המלחמה השיעורי בית היו חובה והיו 25% מגן הכל ממוחזר משנים קודמות אבל ממש ממליץ לשבת לבד ולפתור הכל.\n\nהמבחן:\nקונספטים שחוזרים על עצמם מאוד מאוד. צריך להבין מה קורה בכל שאלה ויותר חשוב להבין למה כותב השאלה מתכוון כדי לקחת את ההנחות הנכונות וזה הקושי האמיתי. אבל בגדול אין תחושה שבאים להכשיל אותך \n\nהשורה התחתונה: \nתכלס היה כיף", "timestamp": 1715516675584}, {"author": "אנתרופיה שלילית", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לאוניד טרטקובסקי\nחוות דעת - הרצאות: אוהב מאוד ללמד, אכפת לו מהסטודנטים באופן אישי והוא תמיד יישמח להסביר לכם עד שתבינו. לקראת הסוף היה קצת יותר משעמם בהרצאות. אכפת לו מאוד ממילואימניקים\n\nשם המתרגל/ת: דניס\\דוד חסין\nחוות דעת - תרגולים: דניס מאוד מבין ומקצועי אבל מרגיש שההסברים שלו קצת מתסבכים מידי וברוב התרגולים הוא טס ולא ממש אוהב לענות על שאלות תוך כדי. \nדוד חסין מתרגל מצוין, אכפתי מאוד ומסביר מעולה\n\n\nשעורי הבית: \nמאתגרים אבל מלמדים, שבו לעשות אותם לבד ותלכו לשעות קבלה ובאמת תתעקשו על להבין איך הדברים עובדים. הם גם 25% מהציון. לעתים השאלות מנוסחות בצורה לקויה אך אף אחד לא טורח לשנות את זה.\nהמבחן: היה לי קשה ביחס למבחנים אחרים בתרמו שפתרתי, גם הממוצע היה דיי נמוך. \n\nהשורה התחתונה: ממש נהניתי מההרצאות ומהחומר ולמדתי המון, קורס מאתגר שדורש השקעה ומבחן ממש לא פשוט.", "timestamp": 1715529207959}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ליאוניד טרטקובסקי\nחוות דעת - הרצאות: ליאוניד אחלה מרצה, מסביר בצורה טובה, שולט בחומר ויענה על כל שאלה שלא תיהיה. הוא מרצה באווירה קלילה ועם הומור, ההרצאות עוברות בסדר.\n\nשם המתרגל/ת: דניס \nחוות דעת - תרגולים: המתרגל האחראי. עשה מעל ומעבר בשביל הסטודנטים. וכמובן בלי קשר הוא מתרגל מעולה. הוא רק מסביר לפעמים יותר מידי על התיאוריה ואז אין זמן לפתור את כל השאלות.\n\nשעורי הבית: הש.ב ברמה טובה ומאתגרת. חשוב מאד מאד לעשות את כל הש.ב כמה שיותר לבד בשביל להבין את הקורס. הם לא עמוסים מידי אבל חשובים מאד. \n\nהמבחן: המבחן קשה, לנו במועד א היו יותר נכשלים מעוברים, אבל עם למידה של מספיק זמן (לדעתי שבוע לפחות), אפשר לקבל ציון סבבה.\n\nהשורה התחתונה: החומר לכשעצמו לא קל. צריך להשקיע בקורס לאורך כל הסמסטר. בעיקר בהבנה ובתרגול שאלות. צריך לתרגל הרבה מבחנים בשביל לראות כמה שיותר שאלות. בסוף זה קורס חשוב במכונות ושווה להשקיע.", "timestamp": 1715614480118}, {"author": "Shaked Yeshurun", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: מדבר כל כל איטי שזה בלתי אפשרי להקשיב בהרצאה. ראיתי הכל מוקלט על כפול 2.5. \nשם המתרגל/ת: דוד חסין המלך\nחוות דעת - תרגולים: מסביר פשוט מעולה!!! אכפתי וחשוב לו שנבין את הדברים כמו שצריך. מסביר בצורה פשוטה ומובנת. אין ספר שבזכותו עברתי את הקורס. \nשעורי הבית: ארוכים מאוד, דורשים הבנה וידע אבל תרמו מאוד להבנת החומר. מי שלא עושה אותם כנראה לא יעבור את המבחן..\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1715799564728}, {"author": "שםם", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לאונידדדד הקסם\nחוות דעת - הרצאות: לאוניד קסם\nלוקח זמן להבין אותו אבל ברגע שקולטים אז הוא פשוט המרצה הכי טוב שיש\nוהוא גם מאוד נחמד בפאן האישי\nאל תפשלו והוא יתגמל אתכם\nיש לו קטעים קצת סקססיסטים לפעמים, ברגע שמגיבים אז הוא קולט וישר מתנצל ומסביר שהוא רק צוחק\nלא לקחת ללב ובעיקר להקשיב לו\n\nשם המתרגל/ת: דוד דיסקין\nחוות דעת - תרגולים: בכללי כל המתרגלים בתרמו מעולים.\nדוד דיסקין היה מובן לאורך כל הסמסטר , לפעמים קפץ אבל 99% היה קשוב בטירוף לקבוצה וממש עצר כשנתקענו. הוא מממש ממש נחמד לכולם ועזר להעביר את החומר בצורה סופר ברורה. היינו קבוצה קטנה וזה גם כן עזר. \nמומלץ ממממש! \n\nשעורי הבית: מלא, עמוס, אין ברירה צריך לעשות. גם פה אם עושים בלי רפרנסים אז המבחן קליל\n\nהמבחן: מועד א לא מובן, מועד ב הרבה יותר. צריך לעבוד ממש על הבנת הניסוח של השאלות לרוב,  שעות קבלה עוזר בזה. \n\nהשורה התחתונה: אחלה בחלה", "timestamp": 1717361768300}]}