{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  מקסים קריסטלני\nחוות דעת - הרצאות: \nמרצה סה\"כ טוב מאוד. בסמסטר שלנו הוא פירסם אחרי מרבית ההרצאות סיכום מצוין שכולל בעצם די את כל מה שצריך לדעת מאותה הרצאה.\nשם המתרגל/ת: אצלנו התחלפו כל תרגול.\nחוות דעת - תרגולים: \nסה\"כ טובים מאוד, כמעט זהים לש\"ב רק טיפה קלים יותר.\nשעורי הבית: \nקלים למדי, חבל לרפרנס כי הם דורשים באמת יחסית מעט מאמץ ובעיני היו קריטים בשביל להישאר במעקב על הקורס. אצלינו היה פרויקט שלא כדאי לזלזל בו כי הבודק די דקדקן.\nהמבחן: \nקשה, שווה לבוא פיקס על השיעורי בית הם מזכירים במידה מסוימת את המבחן, אם כי קלים יותר.\nהשורה התחתונה: קורס מעניין בטירוף.", "timestamp": 1615907479832}, {"author": "נתן", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: לאוניד מירקין.\nחוות דעת - הרצאות: \nמרצה תת רמה, עם דרישות מוגזמות הן בזמני הגשות של הפרוייקט והן בדרישות מהמבחן.\nשם המתרגל/ת: \n\nחוות דעת - תרגולים: \nלא ברורים, עדיף הקלטות בפנופטו.\nשעורי הבית: \nלא חובה.\nהמבחן: \nסביר בקושי, בדיקה מחמירה.\nהשורה התחתונה: \nלא לקחת עם לאוניד מירקין", "timestamp": 1645993968526}, {"author": "האננס", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות:\nמרצה זה שם יפה מידי, יותר נכון לרשום מכונת קול שמקריאה את ההרצאות מאנגלית לעברית.\nההרצאות מאוד חשובות, לא הנוכחות בהן, אלא התוכן שנמצא במצגות.\nהמבחן בנוי מנקודות תאירוטיות מאוד ספציפיות שנאמרו בהרצאה/ כתובות במצגת.\nההקלטות לא רלוונטיות כי הן באמת מלמדות את החומר ומתבססות על הבנה של החומר בניגוד להרצאות שפשוט צריכים לזכור בעל פה א תהמצגות ולזכור טריקים שאנמרו בהרצאה.\n\nשם המתרגל/ת: תחילת הסמסטר אצל גלעד יקיר ואחריו אצל גל ברקאי\nחוות דעת - תרגולים:\nגלעד מתרגל לא טוב, רק מקריא את התרגולים מהדף ועדיין מצליח להסתבך עם עצמו. לא מומלץ להגיע, עדיף ללכת למתרגל אחר או לראות את ההקלטות.\nגל ברקאי מתרגל טוב שמבין מאוד טוב את החומר, קצת מתנשא אבל אם מצליחים להתעלם מזה מאוד מומלץ להגיע לתרגולים.\nהתרגולים עצמם בנויים ככה שכל תרגול יש שאלה קלה שפותרים ב10-15 דקות, שאלה קשה שלוקחת את יתר הזמן ועוד שאלה שצריך לפתור בבית. מלמד מאוד טוב את החומר אבל לא רלוונטי לשום דבר (לא לפרויקטים ולא למבחן).\nההקלטות טובות, הסדר שונה אצל לאוניד והדגשים טיפה שונים אבל בגלל שהתרגולים לא באמת רלוונטים אז אפשר לראות אותם. \nבונוס, בני גאמוס חתיך.\n\nשעורי הבית: \nמאוד תאורטים ולא קשורים למבחן.\nיש פרויקטון בשני חלקים ומעבדה על כל חלק, יש קשר קל לחומר הנלמד אבל הציון שנבחר מאוד אקרעי.\nהמעבדה דיי מיותרת.\nטיפ שלי, בגלל שחייבים להוריד ניקוד על ההגשה בלי קשר לכמה טובה היא, אז כדאי להכניס טעות קלה מכוונת בשביל שיורידו שם 2-3 נקודות ולא ישימו לב לטעויות חמורות יותר בהמשך (עבד בכל הגשה)\n\nהמבחן: \nלפני המבחן מפורסמות 70 שאלות חזרה שדומות לשאלות במבחן, הדבר היחיד שחשוב בקורס הזה.\nהשאלות קצרות ומצריכות בין 3-15 דקות לפתירה כל אחת.\nחלק מהשאלות דורשות קצת מחשבה וחישובים וחלק מסתמכות על זה שזכרתם חצי משפט מאוד אקרעי שנכתב במצגת.\nהמבחן בנוי מ26 שאלות באותו סגנון כמו השאלות חזרה (היו 2 משוחזרות).\n\nהשורה התחתונה: \nקורס חובה, אז לא רלוונטי מה רשמתי.\nללכת לכל הרצאות ולזכור כל מילה שיוצאת ללאוניד מהפה.\nלזכור את ההרצאות בעל פה (אפשרי).\nלפתור את כל השאלות חזרה.\nלא ללכת לגלעד.\nהתרגולים מיותרים ממש.", "timestamp": 1647681668342}, {"author": "חיימון לימון", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות:  אני לא חושב שהוא מרצה טוב במיוחד, גם מאוד קשה כשהמצגות באנגלית והוא מרצה בעברית, גם למי שדובר אנגלית מבית. \nעם זאת, הוא מכבד את הסטודנטים ונותן מקום לשאלות.\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: גם כאן, קשה לעקוב כשהתרגול כתוב באנגלית אבל עובר בעברית. גל ניסה כמה שיותר לגשר על זה ועשה את המקסימום. רואים שיש לו תשוקה לתחום וחשוב לו שהחומר יעבור בצורה טובה עד כמה שניתן, משתדל גם למקד לגבי מה חשוב ומה לא.\n\nשעורי הבית: לא חובה בקורס, לא עשיתי\n\nהמבחן: היה מאתגר מאוד וטריקי. זה הקורס הראשון אי פעם בטכניון שלעבור על ההרצאות לפני המבחן באמת הכין אותי. אני חושב שבניגוד לכל הביקורת על מירקין, הוא היה פייר. נתן שאלות הכנה למבחן, חלקן באמת הופיעו במבחן או לפחות בסגנון. מיקד לגבי מה חשוב למבחן, וכל דבר שנשאל במבחן נמצא אצלו במצגות.\nהמבחן לא קל, מאוד איכותי, ומי שלא מתחבר לבקרה כנראה יסבול.\n\nהשורה התחתונה: עם מירקין קורס תיאורטי ואיכותי, פחות כמותי.", "timestamp": 1647682958664}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: מייגעות לעתים והמלל באנגלית, אבל הטריק הוא קודם להקשיב למרצה ורק אם הוא מצביע על משהו במצגת אז לקרוא את המלל, אחרי שמבינים את הטריק ההרצאות זורמות יותר\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: תרגולים סבבה, עוזרים להבנה וגל סובלני מאוד להרבה שאלות, גם אם מעט מתנשא לעתים.\n\nשעורי הבית: אין, רק פרוייקט מייגע עם חומר שלא למדנו בקורס.\n\nהמבחן: הוגן - 20 ומשהו שאלות עם תשובה באורך שורה או שתיים וחישובים קצרים, עם דף נוסחאות ללא מחשבון\n\nהשורה התחתונה: קורס נחמד לאנשים מסוימים, לאחרים פחות אבל חובה אז אין הרבה מה לעשות", "timestamp": 1657859449243}, {"author": "מבוקר", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יהושע דיין\nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב ואכפתי \n\nגל ברקאי\nבדיוק ההפך... המתרגל הכי גרוע שנתקלתי בו, מכתב לא קריא ועד חוסר אכפתיות ברמה קיצונית תוך כדי התנשאות.\n\nשיעורי הבית: כל שבוע, רק 5% וארוכים, אבל הכרחיים להבנה טובה יותר\n\nפרויקטון ומעבדה: ארוכים ולא מבין מה התועלת שיש בהם, ממליץ לקחת דוגמה ממעבר חום ומכטרוניקה..\n\nהמבחן: קשוח, כל השנתון יצא מזועזע \n\nהשורה התחתונה: קורס חובה שכל מי שלא יילך לרבדים רק יחכה לסיים איתו", "timestamp": 1677876358861}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יהושע דיין\nחוות דעת - הרצאות: לא יודע לא הלכתי.\n\nשם המתרגל/ת: בני גאמוס בפנופטו\nחוות דעת - תרגולים: הקלטות מצויינות ובני מתרגל מעולה, הלוואי שהיה פרונטלי. אפשר ללמוד את כל הקורס מההקלטות שלו, פשוט לוודא שלא נוספים נושאים נוספים במפתיע ובמקסימום אפשר להשלים עצמאית מהיוטיוב/מקבצי התרגולים המעודכנים של צוות הקורס. גל ברקאי גם אחלה.\n\nשעורי הבית: משקל זניח אך חשובים להבנת החומר (למבחן לא כל כך). להשקיע בעיקר במעבדה ובפרוייקט.\n\nהמבחן: מאתגר, אך עם ההכנה הנכונה ואחרי שנופלים האסימונים של הקורס הוא לא קשה במיוחד וקשה להפתיע עם טריקים חדשים. ממליץ לקרוא את הקבצי תרגולים של סרגיי לפני הבחינה, מכילים סיכומים ממש מפורטים.\n\nהשורה התחתונה: קורס מעניין, בהתחלה קשה להבין את השפה והמונחים ואיך כל הדברים והנקודות מתחברות אחת לשנייה, אבל כשזה קורה הקורס הופך להיות מאוד סימפטי ולא מאתגר כפי שהוא נראה בהתחלה.", "timestamp": 1678825917060}, {"author": "close loop", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות: \nלצערי ליאוניד הוא מרצה שלא אכפת לו מהסטודנטים, הוא מלמד במצגות לא מובנות ומשעמות, התוכן כולו באנגלית על אף שהקורס נחשב כקורס בעברית, ליאוניד לא נותן שום הקלות למילואים דבר שעושה את הלמידה בקורס בלתי אפשרית, גרמה לי להמון דיכאון ורצון לא לקחת את הקורס ואפילו לעזוב את הלימודים. מציע לליאוניד לרכך את ליבו אך לצערי כנראה אינו יקרא את זה, לפרסם מבחני עבר, להיות נגיש לסטודנטים. אבל מי אנחנו סטודנטים קטנים לעומת מרצה כזה...\n\nשם המתרגל/ת: שניר כרמלי\nחוות דעת - תרגולים: \nשניר הוא משב רוח מרענן בקורס שליאוניד עושה נוראי, הוא מהיר ונמרץ ומאוד אוהב בקרה. אני צופה לו עתיד מזהיר בתור מתרגל, כן אציין שחשוב כי אולי יעזור אם יכתוב מסודר יותר ויסביר את הרציונל בכל תרגיל (שכן ליאוניד כותב תרגולים ארוכים ללא רציונל בכלל)\n\nשעורי הבית: אין\n\nהמבחן: נראה לי גרוע\n\nהשורה התחתונה:  מקווה שלא תתקלו בליאוניד בחיים", "timestamp": 1712599740617}, {"author": "חוג פתוח", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: \nמעביר מצגות באנגלית, שלדעתי לא מפורטות מספיק ומדבר בעברית. לא כותב על הלוח. לדעתי לא מרצה טוב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין להגשה\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1714245555413}, {"author": "L", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מירקין לאוניד \nחוות דעת - הרצאות: \nמעביר בעברית את הרצאה כשמצגות באנגלית,דרוש ריכוז מאוד כדי להקשיב לו בהרצאה \nשם המתרגל/ת:ליאור\nחוות דעת - תרגולים: \nמתרגל תותח \nשעורי הבית: \nאין\nהמבחן: \n26 שאלות עם תשובות קצרות,דרוש לעבור על הרצאות,תרגולים,תרגילי חזרה הרבה מאוד פעמים כדי להבין הכל ולדעת איך לפתור נכון את מבחן שלו.\nהשורה התחתונה:\nאם עשיתם ליניאריות קודם לפני מבוא לבקרה עם אותו מרצה,אז יהיה לכם יותר קל להתרגל עליו במבוא לבקרה", "timestamp": 1716582446772}, {"author": "P", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מירקין\nחוות דעת - הרצאות: מצגות באנגלית והרצאה בעברית זה קשה, והדוגמאות מורכבות מדי לעיתים. יותר קל להבין מה הולך בהן לקראת סוף הקורס\n\nשם המתרגל/ת:  שניר ובני גמוס\nחוות דעת - תרגולים: שניר ממש אחלה ודואג להסביר היטב, אבל בסוף עובד לפי התרגולים של לאוניד והם קצת מסורבלים לעיתים. בני מדהים וקצת יותר קל עם התרגולים שם, מאוד מאוד עוזר להבין את הקורס.\n\nשעורי הבית: אין\n\nהמבחן: אם מבינים היטב את שאלות ההכנה (כולל כיצד במבחן אפשר לסובב אותן לתשובה אחרת), המבחן לא יהיה קשה.\n\nהשורה התחתונה: אופן הוראה קשוח, אבל אם מעכלים את החומר אפשר להוציא ציון טוב.", "timestamp": 1716804317015}, {"author": "Saar Levy", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות: אחרי סמסטר איתו במערכות לינאריות הוא כבר לא מפתיע. לדעתי (המאוד לא פופולרית) הוא מרצה טוב סה\"כ. הבעיה הגדולה איתו זה שהוא בנאדם שקשה להסתדר איתו. מבחינתו יש בדיוק דרך אחת ללמוד את הנושא ואם אתה לא מבין את מה שהוא אומר אז הוא פשוט יחזור על זה.\nהמצגות מכילות את כל מה שצריך לדעת למבחן/קורס באופן כללי. צריך ללמוד לעבוד איתן כי הן לא \"מאכילות בכפית\" את החומר.\n\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: מתרגל טוב מאוד, גם איתו אני ממשיך עוד ממערכות לינאריות. כאן הוא היה משמעותית יותר טוב כי הקורס הועבר במתכונת שהוא מכיר אז הוא ידע בדיוק איזה דגשים לתת. לפעמים קצת מאבד את התרגיל באמצע הפתרון על הלוח ואז קשה לחזור לעקוב אחריו אבל סה\"כ מתרגל מעולה\n\nשעורי הבית: יש פרוייקט שהוא בתכלס דו\"ח מכין למעבדה עלייה יש דו\"ח מסכם. המעבדה עצמה פשוטה לביצוע אבל הדו\"חות מאוד ארוכים ואינטנסיבים ודורשים הבנה רצינית של החומר. לדעתי כל אחד לוקח בסביבות ה8-10 שעות. \n\nהמבחן: חוזר על מה שאמרתי כבר. אבל אחרי מערכות לינאריות הוא כבר לא כלכך הפתיע אותי. 24 שאלות שרובן לא לוקחות המון זמן אבל חלקן יחסית קשות. הדבר הכי חושב שלומדים למבחן של מירקין זה שהוא בקושי כותב דברים לא רלוונטיים במצגות שלו. 99.99% מהמלל זה חומר קריטי להבנה בקורס וגם ההערות הכי נישתיות או שוליות יכולות להיות שאלה שלמה במבחן. יש המון התחכמויות והוא שם מלא \"מלכודות\" אז לא לזלזל.\n\nהשורה התחתונה:", "timestamp": 1717181120275}, {"author": "Feedback", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: הרצאות מאוד חשובות לא הנוכחות בהן but the תוכן מירקין מרצה יודע החומר טוב מאוד אך קצת קשה לעקוב אחריו ולכן חייבים לחזור על מצגות ההרצאות לבד ולעזור בחומרים חיצוניים( youtube lemashal)\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: התרגולים מאוד טכניים לעומת המבחן שמאוד תאוריטי\n\nשעורי הבית: אין, יש פרויקט ודוח מעבדה לא פשוטים ומצריכים שעות עבודה.\n\nהמבחן: מבחן מאוד תאוריטי וטריקי לדעתי הרמה שלו הוגנת אך הבדיקה וההכנה לו זה החלק הקשה.\n\nהשורה התחתונה: אישית היה לי מאוד מעניין.\nלא יודע אם המצב תמיד כך אבל הסמסטר מועד א היה הרבה יותר קל ממועד ב ולכן כדאי להגיע מוכנים ולסיים ממועד א.", "timestamp": 1718654562748}]}