{"posts": [{"author": "G", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יעקב בן חיים\nחוות דעת - הרצאות: משעממות נורא, אומר את אותו מידע בוורציאציות שונות לאורך כל הקורס ועדיין לא ברור מה הפואנטה שלו, מה הוא מנסה להגיד, ועל מה הקורס. מעבר לחישוב (בכאילו. קשה לקרוא לזה חישוב. יותר דוגמה מספרית) על רובסטיות.\n \nחוות דעת - תרגולים: \n\nשעורי הבית: לא להגשה\nהמבחן: אין. שתי עבודות אחת של 40 אחוז ואחת של 60 אחוז מהציון הסופי. הציונים יכולים להיות 0 או 70 או 85 או 100 (אני לא סגור על המספרים) אבל לא ביניהם. אין לו בושה לתת לאנשים 0 למרות שהגישו עבודה של מעל 2 עמודים למטלה שלא היה ברור לאף אחד בקורס מה צריך לעשות בה בכלל.\n\nהשורה התחתונה: לא לקחת", "timestamp": 1661686892311}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעקב בן חיים\nחוות דעת - הרצאות: משעממות ממש. אני לא הקשבתי בהרצאות. \n\nשעורי הבית: לא להגשה\nהמבחן: לא היה. היו שתי עבודות אחת באמצע הסמסטר של 40 אחוז ואחת בסוף הסמסטר של 60 אחוז מהציון הסופי. הציונים יכולים להיות 0 או 70 או 85 או 100 (כמעט כולם אצלנו קיבלו 100 או 85). העבודות היו להמציא בעיה שקשורה לחומר.יש חוברת מלאה עם רפרנסים לכל מיני תרגילים ושיעורי בית פתורים, לוקחים משם השראה וממציאים בעיה זה לא לוקח יותר מדי זמן. העבודה הראשונה הייתה כולה שני עמודים והעבודה השנייה הייתה 4 עמודים (במקום 8 כפי שתוכנן בתחילת הסמסטר). \n\nהשורה התחתונה: קורס מומלץ, לא צריך להשקיע מלא ולא צריך להקשיב בהרצאות", "timestamp": 1668637311045}, {"author": "הדלאי לאמה", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יעקב בן חיים\nחוות דעת - הרצאות: לא ברורות ומשעממות מאוד.\nמי חשב שזה החומר שצריך ללמד בקורס כזה? יכלו לחשוף אותנו לנושאים מעניינים בתחום של ניהול פרויקטים וכלכלת פרויקטים אבל במקום זה קיבלנו רשימה של משוואות משמימות וחסרות משמעות. אחת ההחלטות הכי גרועות שלי הסמסטר אחרי החומס ביום שני בצהריים...\n\nשם המתרגל/ת: יעקב האח\nחוות דעת - תרגולים: SOS\n\nשעורי הבית: אין להגשה\n\nהמבחן: אעדכן בהתפתחויות. (שנים קודמות היה עבודה להגשה וקיווינו שגם השנה אבל במקום זה קיבלנו מבחן יאיי)\n\nהשורה התחתונה: להתרחק אלא אם ממש חייבים את הנקז", "timestamp": 1687595141073}, {"author": "ספי גיבלי", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יעקב בן-חיים\nחוות דעת - הרצאות: משעממות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין חובת הגשה\n\nהמבחן: יחסית קל - תבנית חוזרת בסגנון ש''ב.\n\nהשורה התחתונה: חוץ מנק''ז לא תורם בשום צורה, לא ידע ולא שום כלי מעשי או מעניין שניתן לעשות איתו משהו. בזבוז זמן, לא מומלץ.", "timestamp": 1690036291123}, {"author": "ש", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יעקב בן חיים\nחוות דעת - הרצאות: משעממות, עדיף לנצל את הזמן לדברים אחרים\n\nשם המתרגל/ת: יעקב בן חיים\nחוות דעת - תרגולים: התרגולים הם לא בדיוק תרגולים אלא יותר סגנון של סדנא שהמרצה מעביר גם אותה אז אי אפשר להתחמק מהשעמום\n\nשעורי הבית: אין\n\nהמבחן: יעקב נתן מבחן שהקושי העיקרי בו היה להבין את הניסוחים, בסופו של דבר הייתה שאלה שלא הבנתי את הניסוח עד הסוף אז שאלתי אותו במהלך המבחן כדי להבין מה הכוונה שלו והוא פשוט סירב לענות, כאילו המבחן הוא בהבנת הנקרא ואם אני לא מצליח להבין מה הוא שואל אז זה בעיות שלי ובדיוק על זה הוא חיפש שסטודנטים יפלו, בסוף עשיתי מה שהבנתי וקיבלתי 0 על שאלה שווה 25 נקודות\n\nהשורה התחתונה: הקורס היה טוב שהיה בו עבודה אבל הקורס גם משעמם וגם בסוף המבחן מחפש אותך על אם הבנת בכלל את השאלה ולא אם אתה יודע לפתור אותה. בקיצור לא ממליץ לקחת.", "timestamp": 1690112967592}, {"author": "וינסטון", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אמריקאי במסווה של פתוחות - טעית בתחילת השאלה- נכשלת בכולה. הוא לא מוכן לשמוע על ערעור בנושא. חומר לא קשה אבל מבלבל, טעות אחת של מינוס פלוס והלך 25 נקודות במבחן. הרוב לא טעו והממוצע גבוה\n\nהשורה התחתונה: למרות שלא הלך לי משהו - מומלץ", "timestamp": 1690366466459}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: לא באמת הרצאות אלא סוג של סדנא משעממת בלי הסברה אמיתית של החומר.\nיעקב בן חיים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן מכשיל, ניסוח לא ברור שיעקב לא הסכים להבהיר, בדיקה נוראית של המבחן - על שאלה של 25 נקודות הוריד את כל הניקוד על בסיס מינוס, ובכללי יחסי אנוש פח אשפה.\n\nהשורה התחתונה: בתקופת הקורונה שמעתי שהיה בסדר, בתקופה רגילה לא מומלץ בכלל, קחו הידרודינמיקה של אוניות או קורס אחר של שלמה אשד.", "timestamp": 1691145853355}]}