{"posts": [{"author": "shahar tsadok", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: אלכס אורון\nחוות דעת - הרצאות: ארוכות ומייבשות. קשה נורא לעקוב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים. דורשים הרבה השקעה\n\nהמבחן: עם אלכס המבחן קשה מאוד. וגם הציונים ברצפה\n\nהשורה התחתונה: לנסות לעשות את הקורס עם מרצה שהוא לא אלכס אורון", "timestamp": 1602608099607}, {"author": "ליאת אלישע", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nלא מומלץ... אי אפשר להבין מילה ממה שהוא אומר, מה שכן יש לו אחלה רשימות שהוא העלה לפני לאתר. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nסיוט, הסמסטר היו לנו גם 2 פרויקטים והעומס לא היה פרופורציונלי בשום צורה לנק\"ז של הקורס. \nהמבחן: \nתיאורטי ומונפץ, המון פיתוחים, לא טכני כמו מבחני עבר.\nהשורה התחתונה: מקצוע חובה אז אין ממש מה לעשות", "timestamp": 1612521798533}, {"author": "נתבש", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: לא מובנות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים אין משוב\n\nהמבחן: קשה. לא מובן\n\nהשורה התחתונה:  זבל של קורס", "timestamp": 1612875179817}, {"author": "אור", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: לא ברורות, הר\\מרצה לא עובר על החומר לפני ולא מעביר את ההרצאה בצורה טובה בכלל.\nהמרצה מעלה לפני ההרצאות רשימות מסוכמות היטב אך לא נצמד אליהן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עמוסים מאוד, לא ברורים, לא מכינים לקראת המבחן ודיי מנותקים ממה שנלמד בהרצאות.\n\nהמבחן: לא קשה במיוחד למי שהבין את השאלות, שהיו לא ברורות בכלל.\nהיה קשור במידה מועטה לתוכן שנלמד.\nמאוד תיאורטי.\nהשורה התחתונה: לא ללמוד את הקורס עם דניאל כמרצה.", "timestamp": 1612975042456}, {"author": "עכבר", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: הקסנר המשעמם\nחוות דעת - הרצאות: \nש ע מ ו ם אחד גדול ולא מועיל.\nהרבה גמגומים של הקסנר והרבה תקיעות. \nהבנאדם לא יודע ללמד נקודה.\nמעלה סיכומים לא ברורים למודל , שאתה מנסה להבין מה הוא רוצה להעביר אבל פשוט לא מבין.\nשם המתרגל/ת: ניסיתי את כולם, כל אחד יותר גרוע מהשני, רמת לימוד ששווה לגרביים אחרי שיעור ספורט באמצע אוגוסט.\nחוות דעת - תרגולים: \nחוץ מלעזור לפתור את מטלות הבית אין תועלת לכלום.\nשעורי הבית: \nרוע טהור!!!! 7 גליונות שכל אחד יותר הזיה מהשני, לא ברור מה צריך לעשות. מזל שיש רפרנסים והקורס מרופרנס שנים.\nהמבחן:  אפשר להבין את הלך הרוח של המבחן לפי הלך הרוח הנוראי של הקןרס.\n\n\nהשורה התחתונה: קורס מגעיל. משאבת זמן, במקום להתמקד בדברים יותר חשובים הסמסטר מצאתי את עצמי מבזבז זמן על פתירת גליונות ופרויקט ששאב לי את כל חופשת חנוכה .\nאין ברירה קורס חובה .\nלא לקחת עם הקסנר, עדיף עם אורון.", "timestamp": 1616272936774}, {"author": "GS", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: גרועות. קשה להבין מה הוא אומר\n\nשם המתרגל/ת: יגאל כהן\nחוות דעת - תרגולים: מסביר לאט אבל מובן\n\nשעורי הבית: פרויקט עמוס מאוד. שיעורי בית הוגנים\n\nהמבחן: לא מאוד הוגן\n\nהשורה התחתונה:", "timestamp": 1616422684220}, {"author": "ליאור ליאון", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: מיותר, לא מובן, מידי פעם יש אנקדוטה חשובה- עדיף להוציא אותה מסיכומים\\מצגות ולעשות רשימה קצרה של מושגים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תכלס, צריך ליבחור מתרגל טוב\n\nשעורי הבית: סופר רלוונטי.לא קשים מידי מתרגלים את מה שיהיה במבחן. הפרוייקטונים ארוכים בטירוף(בעיקר הראשון) ולא נוגעים כמעט למה שיהיה במבחן(ביחס לכמות הזמן שהם לוקחים), אולי למה שתעשו כמהנדסים.\n\nהמבחן: תכלס, לדעת להציב לנוסחאות, טיפה הבנה מעבר.\n\nהשורה התחתונה: חראם על הזמן של ההרצאות, עדיף לקרוא סיכומים\\מצגות, לסכם נק חשובות, ולשרוף את הזמן הזה על לתרגל ולהציב בפועל את מה שנלמד בהרצאה.", "timestamp": 1645170408144}, {"author": "m", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: היה ממש נחמד, חושבת שהסביר טוב, הרוב לא אהבו מסיבה כלשהיא\n\nשם המתרגל/ת: אדר\nחוות דעת - תרגולים: מתרגל טוב, מסביר אינטואיציה \n\nשעורי הבית: נהניתי מאוד מהפרויקטים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1645372897339}, {"author": "J", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nאחלה מצגות, מספיקות לגמרי כדי להבין את החומר ברמה טובה.\n\nשם המתרגל/ת: (מוקלט מהפנופטו)\nחוות דעת - תרגולים:  תרגולים טובים, מראים בול את מה שיהיה במבחן\n\nשעורי הבית: \nיש בקורס שיעורי בית דו שבועיים בזוגות, ו2 פרויקטונים בזוגות, השיעורי בית כיסו את החומר כמו שצריך.\nהפרויקטונים היו ממש סבבה אם עובדים עליהם מסודר, עיקר הבעיה הייתה הזמן הארוך שלקח לצוות הקורס לבדוק אותם.\n\nהמבחן: \nדי ממוחזר, הוגן לגמרי ובודק את ההבנה בחומר, רובו מורכב מקונספטים שחוזרים על עצמם במבחני עבר ובתרגולים.\n\nהשורה התחתונה: \nקורס מעניין, יחסית עמוס בהשוואה לשאר הקורסים, אבל עם מבחן הרבה יותר סימפטי.", "timestamp": 1645718075725}, {"author": "Hexner22", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "כללי: הרבה סטודנטים מחליטים לדחות את הקורס לסמסטר 5 כי הוא לא מהווה למעשה קדם לאף קורס מומלצת בפקולטה. למרות שהקורס עמוס והוא די שונה ממה שהכרתם עד כה, אל תדחו אותו. בסופו של דבר הוא מאוד מעשי, מיומנויות המטלאב שלכם ישתפרו פלאים והמבחן בו סביר למדי. \n\nשם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: בפורמט הנוכחי מיותרות לטעמי ועדיף להשקיע את הזמן בדברים אחרים. \n\nשם המתרגל/ת: אדר געתון / אלחנן בוידאו\nחוות דעת - תרגולים: אדר מתרגל מעולה ומשרה אווירה טובה בתרגולים. מאוד אכפת לו מהסטודנטים ותמיד שמח לעזור, אבל הם מתקיימים בשעות מאוחרות וקשה לשמור על ריכוז. יש גם תרגולים מוקלטים של אלחנן בפנופטו מ2018 והם ברמה גבוהה ואפשר להריץ על 1.75X ולסיים אותם תוך 40 דקות, אם כי לפעמים לא מסונכרנים עם הסילבוס. \n\nשעורי הבית: יוצאים כל שבועיים שלושה, עבודה בזוגות ולרוב קלילים. במהלך הסמסטר יוצאים 2 פרוייקטונים שמהווים 20% מהציון ועיקר העומס נובע מהם.\n\nהמבחן: למבחן יש מבנה שחוזר על עצמו לאורך השנים והוא יחסית סימפטי. את רובו אפשר לפתור עם דף נוסחאות.\n\nהשורה התחתונה: תשקיעו בפרוייקטונים ובשיעורי הבית כי עיקר הלמידה מהם ולא מההרצאות והתרגולים, מה גם שהם 30% ואפשר להשיג מהם בונוס לציון סופי.", "timestamp": 1646230325609}, {"author": "על מאזדה 6 מגיל 6", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\n\nחוות דעת - הרצאות: מאוד קשה לעקוב אחריו בהרצאות, בשלב מסוים כולם הפסיקו להגיע. יש מחסום שפה ולפעמים לא ברור מה חשוב ומה לא או שפיתוחים נעשים בחצי הסבר כשהמרצה מדבר לעצמו. \nההרצאות תיאורטיות ואפילו שהן עוברות גרוע מאוד, צריך למצוא דרך לדעת את הפיתוחים שהוא עושה כי הוא מאוד אוהב לשאול במבחן על דברים מההרצאה. יש סיכומים טובים בדרייב והספר של הקורס (לפעמים קצת מעמיק מידי) משלים איפה שההרצאה לא ברורה (שזה רוב ההרצאה).\n\nשם המתרגל/ת: צבי\nחוות דעת - תרגולים: מתרגל בסדר, התרגולים עצמם מאוד טכניים והרבה מהם זה להציב מספרים בתוך אלגוריתמים. הם לא מספיקים לבדם כדי להיות מוכנים למבחן ולא כל כך נותנים תובנה עמוקה.\n\nשעורי הבית: גזלו כמויות לא פרופורציונליות של זמן לקורס של 3 נק\"ז. היו 2 פרויקטים בלי רפרנס שאחד מהם שוחרר קרוב לסוף הסמסטר, וגיליונות שיעורי בית שחלק עברו חלק ולפעמים היו שאלות שלקחו הרבה זמן.\nשעות ארוכות ויקרות הלכו על המטלות של הקורס הזה והרבה תסכול. חלק מהתסכול נבע מזה שהניסוחים של השאלות ניתנים להבנה בכמה דרכים או לא ברור מה שואלים (שוב - מחסום שפה קשה).\nמשהו שהבנו בדיעבד - שווה מאוד ללכת לשעת קבלה של מארק (או מי שיהיה בסמסטר שלכם ואחראי על הפרויקט), הוא נתן הכוונה טובה, עזר לנו להתקדם כשהיינו תקועים ובגדול תרגם לנו את הפרויקט למה שהתכוונו לשאול.\n\nהמבחן: להגיע משומנים עם הטכניקה מהתרגולים, לדעת פיקס איך מפתחים שיטות, שגיאות תיאורטיות, קצב התכנסות וחסמים למינהם. לדעת טור טיילור כאילו החיים שלכם תלויים בזה.\nהדף נוסחאות קצת לא עדכני, מוזר ולעיתים מבלבל אז לא לסמוך עליו 100% שיציל אתכם אם נתקעתם.\n\nהשורה התחתונה: קורס שהחומר שלו מעניין מאוד, מועבר בצורה גרועה לצערי, עמוס לא פרופורציונלית לכמות הנק\"ז שלו תחת דניאל הקסנר, להגיע עם סבלנות.", "timestamp": 1646468011713}, {"author": "המשמיד", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nכל קשר בין ההרצות בקורס הזה לבין הבחינה או לכל דבר מקרי בהחלט, תחסכו לעצמכם את הזמן ואל תלכו. גם במחזור שלנו היו אנשים שהיו אופטימיים והלכו, אבל בסוף היו בהרצאות 10 אנשים בקושי.\n\nשם המתרגל/ת: אדר געתון או אלחנן\nחוות דעת - תרגולים: \nהמתרגלים בקורס הזה סבבה, לא יותר מזה. אדר היה מאוד מצחיק ולא הכי סגור על החומר, אבל היה מאוד סבבה. עם זאת, עלו למודל קבצי התרגול, בהם היו גם רקע תאורטי וגם תרגילים עם פתרונות, ככה שנוח מאוד ללמוד מהדפים האלה. למי שיותר מתחבר לסרטונים, יש בפנופטו (תחפשו אנליזה נומרית) סרטונים של המתרגל אלחנן, הוא אחד התותחים, עדיף על הכל.\n\nשעורי הבית: \nאצלנו היו אמורים להיות 9 גליונות, בגלל שצוות הקורס ככ לא מחובר לעולם בסוף היו רק 6 שמתוכם נבחרו 5. הגליונות סהכ בסדר, לא גרועים מדיי אבל הניסוח בהם לפעמים זוועתי. הם לוקחים כמות סבירה של זמן.\nמלבד הגליונות הללו, היו שני פרוייקטונים. הפרוייקטונים היו חובה ולא היוו מגן, אבל כנראה הצוות קורס היה חפשן שנתנו בהם לכולם 100. חושב שסהכ הפרוייקטונים היו בסדר ברמתם, פשוט דרשו זמן רב, שרובו הלך על לנסות להבין מה הצוות קורס רוצה מהחיים שלך (אם כי היה פורום שאלות מאוד פעיל שהצוות ענה עליו דיי מהר).\n\nהמבחן: \nלא קשור ככ לחיים, גם אם תלמד שבוע וגם אם תלמד יום, זה עניין של יותר מזל משכל. יש דברים טכניים שצריך לדעת אבל יש דברים מונפצים שגם אם למדת את הקורס כל הסמסטר אתה לא תדע בבחינה.\nהרמה עצמה של הבחינה לא הכי גבוהה, פשוט חלק מהסעיפים לא ברורים/משאירים אותך בחוסר ידע. היה הרבה מגן (שב ופרוייקטונים שהם חובה) ככה שגם עם ציון עובר בבחינה, הקורס כולו ייסתכם ב70 לפחות.\n\nהשורה התחתונה: צוות קורס לא הכי מחובר, פרוייקטונים מעמיסים, לקורס עצמו יש הרבה פוטנציאל וחומר חשוב, פשוט הוא לא מועבר בצורה טובה/בדרך הערכה טובה. מבחן מונפץ מאוד.", "timestamp": 1647431224349}, {"author": "6", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\n\nחוות דעת - הרצאות: \nהרצאות לא ברורות, כנל למצגות עצמן, הלכתי בהתחלה ולא תרם לי כלום להבנה של הקורס אז הפסקתי ללכת, ממליץ לכם לחסוך את הזמן הזה מההרצאה הראשונה ולנצל אותו לדברים טובים יותר\n\nשם המתרגל/ת: יגאל\n\nחוות דעת - תרגולים: \nבהתחשב בזה שלא כדאי ללכת להרצאות, מהתרגולים מבינים על מה הקורס שזה חשוב כדי להצליח בו\n\nשעורי הבית: \nהשיעורי בית סבירים אבל במהלך הקורס מפרסמים שני פרוייקטונים לא מובנים וארוכים במיוחד, העמיס לי על כל סוף הסימסטר ברמה שהייתי חייב להזניח את הלמידה וההצלחה שלי בקורסים אחרים כדי לעמוד בהם\n\nהמבחן: \nסך הכל היה הוגן אבל הלמידה אליו היא נטו מפתירת מבחנים קודמים ואולי חזרה על התרגולים, לא הרגשתי שהשיעורי בית תרמו לי להצלחה בו.\n\nהשורה התחתונה: \nקורס חובה שהוא לא קדם לכלום ומעמיס על הסימסטר בטירוף, ממליץ לדחות לשנה שלישית או רביעית ואם מרגישים חוסר אז אפשר להקדים קורס אחר פחות עמוס כי סימסטר 3 קשה מאוד גם בלעדיו. הנושא עצמו יכול להיות מעניין אם היו מלמדים אותו כמו שצריך.", "timestamp": 1647796570800}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: לא נראה שהוא נהנה מלהרצות, וגם הסטודנטים בבירור לא נהנים מהרצאותיו. לטובת הכלל, שחררו אותו מן המטלה הזו.\n\nשם המתרגל/ת: אדר\nחוות דעת - תרגולים: הבן אדם הכי ציל בעולם. מסביר טוב ומסודר, מאוד מומלץ.\n\nשעורי הבית: הפרויקטונים סיוט, ש\"ב רגילים יותר טובים אבל עדיין מאוד עמוסים.\n\nהמבחן: קשה בש\"ב קל במבחן. בכללי מתבסס יותר על התרגולים מאשר על הש\"ב או ההרצאות.\n\nהשורה התחתונה: דווקא מאוד התעניינתי בחומר הלימוד, כאשר הוסבר בצורה נורמלית.", "timestamp": 1649881328450}]}