{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nש\"ב כל שבוע-יש מלא רפרנסים\nהמבחן: \nהשורה התחתונה:\nדורש השקעה ולפתור הרבה תרגילים", "timestamp": 1598213393193}, {"author": "Amit Ashkenazi", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: מיילס רובין (וידאו)\nחוות דעת - הרצאות: \nמרצה מעולה, מאוד כריזמטי כשהוא מדבר בפי 2.\nמסביר בצורה ברורה ונעימה כמויות לא סבירות של חומר קשה.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשים, המון מהם, סבל טהור. לרוב יש רפרנס, ויוצאים פתרונות מלאים אחרי ההגשות עבור למידה למבחן.\nהמבחן: \nזוועת עולם. למה אכלתי אמא?\nהשורה התחתונה: \nכמו פיזיקה 1 על סטרואידים. הקורס מעניין, כל החובות זוועה.", "timestamp": 1602696279254}, {"author": "דובי דוברמן", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אולג גנדלמן\nחוות דעת - הרצאות: אחרי שתי הרצאות הבנתי שאין טעם ללכת. יכול להיות שהוא אחלה בנאדם אבל אסור לתת לו להרצות, בזבוז זמן\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: אחלה מתרגל, קצת מבולגן אבל אפשר לעבוד עם זה\n\nשעורי הבית: עמוסים סתם, 10 הגשות (כמעט כל שבוע) מכובדות מבחינת העומס שלהן. שאלות מוזרות שלא ברור הקשר שלהן לקורס לפעמים\n\nהמבחן: כמו כל הקורס הזה, מנותק מכל שאר הדברים, שאלות קשות שדורשות הבנה מעמיקה, הרבה מעבר למה שבאמת אפשר לקלוט מהמרצה והמתרגלים...\n\nהשורה התחתונה: חובה, אוף", "timestamp": 1627566339903}, {"author": "איצטרובל מסולסל", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אולג גנדלמן\nחוות דעת - הרצאות: סבל טהור, שיעמום בלתי פוסק ועוד 4 שעות שבועיות! אסור לתת לאולג להרצות, המרצה הכי משעמם שנתקלתי בו, הוא כל כך משעמם שהוא גורם לעצמו להרדם , ההרצאות לא לימדו אותי דבר וחצי דבר על דינמיקה, רק להעתיק נוסחאות מהלוח כמו תוכי, דבר שיתבטא בציון הסופי של כל המחזור. Wait for it...\n\nשם המתרגל/ת: מג'די גזאל\nחוות דעת - תרגולים: מתרגל טוב, קצת מבולגן אבל הסיכומים המודפסים עוזרים להבין ואחכ גם תורמים בלמידה למבחן. בלי קשר אדם מדהים שתמיד רוצה לעזור , תמיד קשוב לצרכי הסטודנטים. יעשה הכל כדי לתרום להצלחתם.\n\nשעורי הבית: זוועות זוועות זוועות, רוע טהור במשך עשרה גליונות, אתה רק בוכה במהלך הדרך, מזל שיש רפרנסים.\n\nהמבחן: ממוצע 39 לפני פקטור חחחחחחחחח וכמובן באשמת הסטודנטים והמוח הקטן שלהם. עשו לנו את הנירמול הכי מטורף שחוויתי בטכניון, אפילו יותר מספי. החשיבו מגן לכולם , גם למי שנכשל, נתנו 13 נק פקטור כדי להשתיק וכל מי שקיבל בין 50 ל55 עיגלו לו תציון ככה בשביל ההשתקה ל55. קיצר מסריח ברמות.\n\nהשורה התחתונה:  תתפללו לעבור והכי הכי תתפללו לא להיות עם גנדלמן.", "timestamp": 1627960985075}, {"author": "G", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אולג גנדלמן\nחוות דעת - הרצאות: לא ראיתי את ההרצאות כי סמסטר קורונה ולאולג לא היה אכפת שלא מבינים מילה ממה שהוא אומר בזום\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: קבצי הPDF במודל של התרגולים היו מאוד מובנים ומפורטים. במקרים בודדים שלא הבנתי משהו ראיתי את ההקלטה של עידו ניצן והוא הסביר ברור\n\nשעורי הבית: קשים. יש רפרנס בדרייב אבל לא איפה שהוא אמור להיות. הכל מבולגן.\n\nהמבחן: מזעזע. גם במועד א וגם במועד ב. יותר קשה בהרבה מהרמה של המבחנים עד הסמסטר הזה, וההיסטוגרמה בהתאם (היו 20 ומשהו נקודות פקטור בכל מועד)\n\nהשורה התחתונה:", "timestamp": 1636140178769}, {"author": "סטודנט מדוכא", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יולי סטרוסבצקי (בתכלס מיילס בוידיאו)\nחוות דעת - הרצאות: \nלא הלכתי ליולי, אבל ייאמר לזכותו שהוא הקפיד להעביר את החומר באופן שבו מיילס העביר בוידיאו. מיילס מרצה מעולה, די כריזמטי על 1.5 ומצליח להעביר את כל הקונספטים בקורס בצורה מעולה. הקורס עצמו סופר מעניין - פיזיקה 1 על סטרואידים ובמהלכו מתארים קינטיקה וקינמטיקה של גופים קשיחים במרחב.\n\nשם המתרגל/ת: מוחמד ספדי (וידיאו)\nחוות דעת - תרגולים: \nמתרגל מעולה, מעביר הכל פיקס ונותן כלים טובים לפתרון בעיות. הלכתי גם כמה תרגולים למג'די ומעבר לזה שמדובר בבנאדם הכי חמוד בפקולטה הוא גם אחלה מתרגל\nשעורי הבית: \nקשים, ארוכים, מייאשים *אבל* \nיש רפרנסים. כמו כן אני ממליץ לפתור אותם באופן די עצמאי - מאוד תורם להבנה והטמעה של החומר.\nהמבחן: \nלא סימפטי בכלל, אבל יולי נותן בחינות סבירות ביחס לאלטרניטיבות (ראו ערך גנדלמן וגל שמואל).  ייאמר לזכותו שהוא נתן פקטור שמן מאוד.\nהשורה התחתונה: \nקורס מדהים בעיניי, הכי מעניין עד עכשיו בתואר. מבחן מחורבן, אבל אם משקיעים אפשר להוציא ציון יפה. ממליץ מאוד ללמוד ולגשת לבוחן אמצע - יסגור לכם את החצי הראשון של הקורס.", "timestamp": 1659624291226}, {"author": "דינמי", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יולי \nחוות דעת - הרצאות: \nמרצה משעמם, פיתוחים ארוכים ולא מובנים.\n\nשם המתרגל/ת: מירון\nחוות דעת - תרגולים: \nתרגולים טובים, רואים שהוא מבין את החומר ומסביר אותו בצורה שאפשר להבין גם.\n\nשעורי הבית: \nכל שבוע מטלה, לא פשוטה\nהמבחן: \nקשוח, תתפללו לפקטור\nהשורה התחתונה:", "timestamp": 1668502181470}, {"author": "yuval wolfovich", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יולי סטרוסבצקי\nחוות דעת - הרצאות: \nיולי הצהיר שהוא הולך ללמד לפי מיילס, אז צפיתי בהקלטות של מיילס רובין והיה מצויין. מיילס מרצה ממש טוב, מצליח להנגיש קונספטים מסובכים ונותן דוגמאות רלוונטיות. בנוסף, יש לו גם ספר לימוד שתואם לחלוטין את ההרצאות אז מומלץ לעבור עליו גם.\n\nשם המתרגל/ת: מג'די גזאל/ מוחמד ספדי בוידיאו\nמג'די מתרגל מעולה, אבל בכיתות עמוסות לפעמים קצת קשה לו להשתלט על הכיתה. ממש אכפת לו שכולם יבינו ולכן הוא מתעכב הרבה פעמים על כל דבר.\nספדי בוידיאו גם טיל והתרגולים סה\"כ כיסו את החומר.\n\nשעורי הבית: \nשואתיים, אבל יש רפרנס. ממליץ להקדיש להם את הזמן כי הם ממש מלמדים.\nהמבחן: \nמבחן קשה, אבל אצל יולי היה חומר פתוח. אם תרגלתם לאורך כל הסמסטר ונתתם לקונספטים לשקוע אין סיבה לא להצליח, יותר טכני מזרימה למשל. \n\nהשורה התחתונה: \nהקורס הכי מעניין שלקחתי עד כה בתואר, מדהים מדהים מדהים *אבל* קשה ומצריך השקעה. אם אהבתם פיזיקה 1/ 1מ אתם ממש תהנו.", "timestamp": 1669015214590}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יולי\nחוות דעת - הרצאות: אלוהים ישמור\n\nשם המתרגל/ת: מג'די\nחוות דעת - תרגולים: לא רע בכלל, המתרגל הכי טוב בקורס לדעתי.\n\nשעורי הבית: לא פשוט, אבל לפחות הגשה בזוגות.\n\nהמבחן: לא פשוט וצריך ללמוד, אבל יש קורסים יותר זוועה.", "timestamp": 1679239815668}, {"author": "דינמיקה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יזהר\nחוות דעת - הרצאות: רץ על הרבה נושאים, כדאי להקשיב טוב בתרגולים ואז זה ברור. כל הקורס זה נוסחאות ורעיונות (כמו פיסיקה) אז כדאי להקשיב ולרשום בהרצאות, ומקסימום לעבור ביסודיות על הפתרונות של מירון שהם 10/10\n\nשם המתרגל/ת: מירון/אוהד\nחוות דעת - תרגולים: אוהד מתרגל די סטנדרטי מסביר ונחמד, לא מסייע המון בלסדר את החומר.\nמירון לעומת זאת מדהים! אחד המתרגלים הכי מסודרים ומבריקים. ממש מומלץ ללמוד אצלו, התרגילים ארוכים וכדאי לקחת איתו צעד אחורה ולהבין את הדרך/תהליך (בדר\"כ זה בכיוון של דג\"ח->מאזנים+תנאי קינמטי ופתרון אלגברי) לפעמים התנגשויות וכו.\n\nשעורי הבית: מעולים! (יש כמה תרגילים ספציפיים מאתגרים) מומלץ פשוט ללכת כמו מירון ואז להתרגל למשוואות.\n\nהמבחן: לנו היה אמריקאי ארוך (לרוב המבחן בקורס פתוח) הרגשתי בבית ברוב השאלות. במיוחד עם דף נוסחאות עצמי ופתרון מסודר ושיטתי של התרגילים!\n\nהשורה התחתונה: קורס מאתגר. דורש את כל שלבי הלמידה: הרצאה (חשיפה ראשונית) ->תרגול של מירון (מתחילים להבין שימושים/מגבלות -> הכנסת הנוסחאות -> ש\"ב כדי להתנסות ואז להמשיך. ממש ממליץ להיות מסודר זה מאוד מקל. קיצור תלמדו ממירון ואם לא אז תקראו את הדפים לעומק!", "timestamp": 1691237691025}, {"author": "yoyo", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יזהר\nחוות דעת - הרצאות: אחלה מרצה, גם אכפתי.\n\nשם המתרגל/ת: מירון\nחוות דעת - תרגולים: \nמירון אדם זהב, משקיע בטירוף ואכפת לו מאוד. מספר פעמים העביר זומים של שעות כדי לוודא שהחומר נקלט.\nהתרגולים עצמם קצת עמוסים מדי, קשה לעקוב.\nשעורי הבית: \nצריך לשבור את הראש בשניים-שלושה גליונות ראשונים, אחרי שעוברים את השלב הזה (וחשוב לעבור אותו!) הם די זורמים. כן מסתכלים על רפרנסים מדי פעם, אבל סה\"כ סבבה.\nהמבחן: ארוך אבל הוגן, תואם את השאלות שראינו בקורס.\n\nהשורה התחתונה: ככה צריך להראות קורס במכונות. לא מקשים בלי סיבה, שיעורי הבית פתירים, חומר מעניין, וצוות אכפתי.", "timestamp": 1691435887549}, {"author": "L", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יזהר \nחוות דעת - הרצאות: \nאחד ממרצים הכי טובים שהיו לי בחיים בקמפוס הזה, ההרצאות היו מאוד מעניינות\nשם המתרגל/ת: מירון\nחוות דעת - תרגולים: \nמתרגל תותח,רושם סיכומים ברורים של תרגול שניתן להבין בהם הכל,מעביר את תרגול לפי סיכומים כל שניתן להבין הכל בו\nשעורי הבית: \nלוקח זמן לפתור אותם\nהמבחן: \nאמריקאי \n\nהשורה התחתונה:", "timestamp": 1691474445735}, {"author": "R7", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: ספדי(ווידאו)/מירון\nחוות דעת - תרגולים: השילוב של ספדי + הסיכומים של התרגולים של מירון שילוב מנצח\n\nשעורי הבית: עוזרים להבנת החומר, חלקם ממש ארוכים ,מומלץ לפתור כי היה במבחן שאלת ש\"ב\n\nהמבחן:  אמריקאי, הוגן לחלוטין\n\nהשורה התחתונה: קורס כבד שמועבר בצורה טובה ע\"י סגל מצוין.", "timestamp": 1695056435416}]}