{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יוסף גבלי\nחוות דעת - הרצאות: הרצאות מעניינות, המרצה מדהים ונורא מתחשב, רוב החומר די ברור.\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: אמיל ממש טוב ודואג שכל סטודנט שלו יבין את החומר.\n\nשעורי הבית: קשים אך מאוד חשובים.\n\nהמבחן: קשה.\n\nהשורה התחתונה: קורס מעניין מאוד וגם חשוב מאוד. צריך לעשות הכל - הרצאות, תרגולים ושיעורי בית כדי לא להיאבד בחומר. חשוב להיות על החומר כל הזמן.", "timestamp": 1597944971050}, {"author": "Gal Saias", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: מובן מאוד, מוסבר טוב,אבל ארוך איטי ומשעמם, מרצה טוב מאוד\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: מעביר הכל בצורה יסודית מאוד ומובנת מאוד(אך איטית), מעודד שאילת שאלות, מתרגל מעולה\n\nשעורי הבית: קשים\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1598266742881}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ספי ג'בלי\nחוות דעת - הרצאות: \nמרצה מצוין\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nהתרגולים היו ברורים מאוד, אחלה מתרגל\nשעורי הבית: \nדורשים השקעה\nהמבחן: \nקשה\nהשורה התחתונה:", "timestamp": 1598347488585}, {"author": "S", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: מתרגל תותח, מעביר את החומר בצורה ברורה ומעודד שאלות.\n\nשעורי הבית: קשים\n\nהמבחן: קשה \n\nהשורה התחתונה: קורס קשה, כדאי להיות על החומר במהלך הסמסטר וללמוד טוב למבחן, מבחנים לא פשוטים", "timestamp": 1598376282032}, {"author": "חייב?", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לוקחים המון המון זמן\n\nהמבחן: קשה ממש!!! אל תקלו ראש\n\nהשורה התחתונה: קורס קשה צריך להשקיע בו יותר מאשר 4 נקז... אבל מעניין מאוד", "timestamp": 1601882347612}, {"author": "G", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: מסביר טוב מאוד אבל בקצב איטי\n\nשם המתרגל/ת: אמיל ברונשטיין\nחוות דעת - תרגולים: מעולים. הוא נותן מקום לשאלות, מסביר ברור מאוד אך בקצב מעט איטי.\n\nשעורי הבית: בינוני-קשה\n\nהמבחן: קשה\n\nהשורה התחתונה: דורש הרבה השקעה", "timestamp": 1603628802616}, {"author": "Guy Sonenzon", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: ספי מרצה תובעני\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דורשים זמן\n\nהמבחן: קשה, דורש הבנה מעמיקה בחומר והכרות עם טכניקות העבודה\n\nהשורה התחתונה: קורס קשה אבל מעניין, ספי מרצה מעולה אבל תובעני", "timestamp": 1609403223915}, {"author": "אאאאא", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שלי\nחוות דעת - הרצאות: מאוד מפוזרת. היה קשה לעקוב\n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: מלך\n\nשעורי הבית: לא קלים\n\nהמבחן: לא פשוט. ולא היה פקטור. אשכרה ממוצע 58\n\nהשורה התחתונה: אם אתם עם שלי - שיהיה לכם בהצלחה", "timestamp": 1629107529615}, {"author": "~~", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: היה לי קשוח, ולא רק בגלל החומר. הלימוד היה ברובו דרך הזום והיה קשה להבין על מה היא מדברת (ולאן הדיון מוביל אותנו).\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: איזה תותח אמאלה. היה מעולה. הציל לי את הקורס. עשה חזרה תיאורטית קצרה על החומר לפני תחילת התרגול, ורק אז התחיל על התרגילים. ממליץ בחום.\n\nשעורי הבית: אמנם יש קפיצה גדולה בין הרמה של התרגולים לרמה שלהם, אבל אני חושב שזו עדיין לא רמת קושי מספקת כדי להכין למבחן. צריך להבין איך פותרים ביעילות את התרגילים, ולא רק להבין שהצלחת לפתור. אם משהו לא מסתדר בפתרון (גם ברמת הפלוס מינוס) ללכת לשעת קבלה ולסדר את זה. תכלס זו הכנה בסיסית כדי לא להיות שוקיסט לגמרי, ולא הייתי מוותר גן על הבוחן אמצע- קצת קשה להבין את הקונספט של הקורס ומה האתגרים בו במבחן עד שמנסים לפתור אחד כזה.\n\nהמבחן: מרגיש קצת כמו פסיכומטרי. ממש קצר בזמן ואמריקאי (יש איזה הנפצה שהם פותחים מחברות לבדוק אם גם שיטת הפתרון נכונה, סקפטי..)\n\nהשורה התחתונה: \nקורס קשה אבל זה קורס יסוד אז בהצלחה.\nלא לזלזל בו במהלך הדרך למרות שיש שבועות שהם יותר קלילים. לא לחסוך בתרגולים", "timestamp": 1634585686824}, {"author": "ג", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: כוונות טובות, אבל מאוד מפוזרת. קשה לעקוב והיא לא מסבירה כל כך טוב את מה שהיא עושה. מרגיש שמה שאולי מבחינתה מובן מאליו לסטודנטים כלל לא מובן מאליו. \n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים:  מתרגל נהדר. מסביר מסודר וברור. בהחלט מומלץ.\n\nשעורי הבית: לא פשוטים בכלל, אבל הכנה טובה למבחן. ממליץ להשקיע בהם כמות נכבדת של זמן.\n\nהמבחן: קשה אחושילינג, ממוצע חמישים ומשהו. לא שמעתי עדיין על מישהו שפתר את כולו בזמן שניתן.\n\nהשורה התחתונה: לא לזלזל, להשתדל לעקוב ולהתפלל לעובר.", "timestamp": 1634643448800}, {"author": "mip", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שלי\nחוות דעת - הרצאות: \nמרבה לאחר, יש לה נטיה להתנשא וזה ממש לא מעודד למידה, בד״כ יש מרצה אחד ואיין באמת תחליף מספיק טוב בשבייל לוותר על ההרצאות. מומלץ להיעזר בסיכומים כתובים של ההרצאות וככה לא להתעכב על הכתיבה\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: בגדול ממש טוב, די רץ מהר, יש את התרגולים כבר כתובים אז אפשר לדלג על ההעתקה ולהתרכז יותר בדרך שמלמדים. עידו מקצועי ממש ויודע לענות על שאלות\n\nשעורי הבית: קשים! כנראה שאם תתעקשו ללכת לשעות קבלה לנסות לפתור בעצמכם זה יעזור מממממממש בתקופת מבחנים. \nמומלץ ביום שנפתח התרגיל להתחיל כדי שיהיה זמן לגשת למתרגל.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1658762520195}, {"author": "L", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שלי\nחוות דעת - הרצאות: שלי מפוזרת ברישום בלוח, הרצאות ארוכות ומעייפות. 3 שעות קשה\n\nשם המתרגל/ת: אדר\nחוות דעת - תרגולים: מתרגל טובו מסביר טוב את נושאים, גורם לסטודנטים להיות בפוקוס ולהיות ערניים.\n\nשעורי הבית: קשים\n\nהמבחן:מעייף\n\nהשורה התחתונה: קורס קשוח", "timestamp": 1659109978849}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שלי\nחוות דעת - הרצאות: ארוכות והחומר משעמם \n\nשם המתרגל/ת: אדר געתון\nחוות דעת - תרגולים: מדהיםםם. הוא מעביר את החומר בצורה מעניינת וברורה, הוא נותן את הלב, עונה לשאלות ומאוד סבלני.\nרואים שאכפת לו מהסטודנטים שלו ושהוא רוצה שכולם יעברו.\n\nשעורי הבית:  קשים וארוכים, לעשות אותם נורא מייאש אבל הם נורא חשובים. רוב השאלות לקוחות ממבחנים וזה תרגול ממש ממש חשוב.\n\nהשורה התחתונה: קורס קשה, עם השקעה מתמדת במהלך הסמסטר הוא אפשרי.", "timestamp": 1659163618074}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: לא מרצה טובה. קצת מגזימים ומוציאים לה שם רע אבל יש אמת במה שאומרים עליה. מאוד מבולגנת, קופצת מלא מנושא לנושא ולא מוודא שיש בסיס טוב לפני שהיא מתקדמת הלאה. אני קיבלתי את ההרגשה שהיא מאוד חכמה ובגלל זה היא פשוט לא מצליחה להתחבר לסטודנטים בהרצאה שלא מבינים מה היא מנסה להסביר ובמקום פשוט מאבדת סבלנות מתעצבנת עליהם.\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: תותח. היו כמה שבועות שלא היה אפשר להבין כלום בהרצאה ואז ברגע שמגיעים לתרגול הוא פשוט מיישב הכל ואתה מבין שהנושא לא באמת כלכך מורכב.\n\nשעורי הבית: קשים מאוד ולוקחים זמן. אבל שווים את זה. לא לוותר כי הרבה שבועות מאוד בונים על חומר של שבועות קודמים וכדאי מאוד להבין טוב את החומר. ממליץ להשקיע.\n\nהמבחן: מאוד משתנה משנה לשנה. אצלנו שינו את המבחן לפתוח ככה שאפשר ליפול בטעויות חישוב ועדיין לקבל ניקוד (וממש קל לטעות בחישובים בקורס הזה). בנוסף רמת המבחן שלנו הייתה יחסית הוגנת. אממה, כל שנה המבחן ארוך בטירוף, לא יודע איך אפשר להספיק את כולו בלי הארכת זמן. גם אם אתה מבין את החומר ממש טוב פשוט לוקח זמן לפתור. ממליץ להתייחס אליו קצת כמו פסיכומטרי ולנסות לצבור כמה שיותר נקודות מסעיפים קלים.\n\nהשורה התחתונה: אין מה לעשות. קורס קשה מאוד אבל קורס חובה. הוא גם קורס מאוד חשוב להמשך הלימודים והקריירה בהנדסה ואפשר לראות איפה הוא נכנס בחיים (לא כמו שרטוט) אז כדאי להשקיע.", "timestamp": 1659386507959}, {"author": "שפ", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: מרצה לא טובה היא לא מעבירה החומר בצורה ברורה ומאוד קשה לעקוב בהרצאות שלה גם כן בתור מרצה אחראית היא לא עושה עבודה כמו שצריך\n\nשם המתרגל/ת:גזאל מגדי \nחוות דעת - תרגולים: \nמאוד משקיע בסטודנטים שלו ואכפת לו מכל סטודנט בכיתה עונה על כל השאלות ומסביר ברור סהכל אחלה בן אדם \nשעורי הבית: קשים but must להבין את החומר\n\nהמבחן: מעייף\n\nהשורה התחתונה: קורס קשה מאוד", "timestamp": 1660046930225}, {"author": "IDM", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: שלי\nחוות דעת - הרצאות: חרא הרצאות עדיף כבר לראות את ההקלטות העתיקות למרות שגם הן לא הכי רלוונטיות.\nלא עונה למיילים, לא מסכימה להקלטות (אפילו של הסדנה, או של ספי משנים קודמות), מאחרת. עדיף שהייתה נשארת במחקר והיו אומרים לנו ללמוד לבד בשלוש שעות האלה.\n\nשם המתרגל/ת: עידו ניצן/ הקלטות\nחוות דעת - תרגולים: עידו בסדר אבל זה לא תמיד מספיק אחרי הרצאות מחורבנות כל כך. הרצאות המוקלטות בסדר.\n\nשעורי הבית: הרבה רפרנסים כי כאמור לא מבינים את החומר מההרצאות\n\nהמבחן: מזעזע עם 60 אחוז נכשלים\n\nהשורה התחתונה: חרא קורס, אבל יש ברירה? אולי לעבור פקולטה..", "timestamp": 1660488398068}, {"author": "אנונימי אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: מרצה לא טובה. מאוד מבולגנת על הלוח ובשטף הדיבור. לא מגדירה מטרות ככה שממש קל לאבד אותה. נותנת לסטודנטים הרגשה שהם טיפשים על ידי הצבת זמנים לא ריאליים לביצוע משימות. חושבת שהכל מובן מאליו לסטודנטים שעכשיו פגשו את המקצוע. מאחרת באופן קבוע. מבזבזת שעתיים על פתרון תרגיל אחד ואז רצה בשעה השלישית וגורמת לאי הבנת החומר.\n\nשם המתרגל/ת: אדר געתון\nחוות דעת - תרגולים: מתרגל ובן-אדם מדהים. התרגולים מתנהלים בצורה מסודרת, עניינית ונעימה. משתף את הסטודנטים, מסביר מה עושה. כותב הכל על הלוח. עושה בהתחלה סיכומון שממש מועיל להמשך התרגול ולפתרון התרגילים בבית. החוויה הטובה היחידה שלי מהקורס הם התרגולים שלו.\n\nשעורי הבית: לא פשוטים, דורשים הבנה עמוקה של החומר.\nהרבה מאוד פעמים צריך עזרה של חברים או שעות קבלה.\n\nהמבחן: מזעזע. ארוך קשה ומרבית הסטודנטים פשוט לא מצליחים לסיים אותו\n\nהשורה התחתונה: קורס סופר חשוב ותובעני. בעל פוטנציאל להיות מאוד מעניין כשלומדים אותו כמו שצריך. באמת ממליץ מאוד לא לבזבז זמן לנסות להבין את שלי, הכי טוב להשתמש בתרגולים המוקלטים.", "timestamp": 1665139717223}, {"author": "למה אני לא בחשמל", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלי צליל\nחוות דעת - הרצאות: נוראיות, מאוד מבולגנת, בהסבר ועל הלוח.\nהסברים לא ברורים, לא מוכנה לשחרר פתרונות של תרגולים או של מבחנים לצורך תרגול מאיזה שהיא אמונה שגויה בכך שאם אתה לא יודע ואין לך כיוון אז תמשיך לבזבז את הזמן שלך ותשב על הסעיף 4 ימים ולא יצא מזה כלום וככה תלמד טוב יותר,אחותי התקדמנו אנחנו לא בשנות ה60 הסובייטיות וצורת הלימוד הזאת חלפה מן העולם(כנל לעוד קורסים בפקולטה העתיקה הזאת שלא מוכנה להתקדם לעולם החדש)\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: מתרגל נהדר, מסביר בצורה טובה את העקרונות ועל מה לשים דגש\n\nשעורי הבית: קשים\n\nהמבחן: מזעזע.\nאין הרבה מה לומר עליו כיוון שהממוצעים לאורך השנים אומרים הכל.\nאו שלאורך שנים כל מהנדסי המכונות שיצאו מהטכניון ברמה ממוצעת של 50 או שסגל הקורס נתקע בזמן וחי כמו דיזואור שלא מוכן להתקדם ולהבין שהמבחן לא פתיר בזמן סביר ולעשות 20 שאלות שכל אחת דורשת זמן ,פיתוח ומחשבה ב3 שעות זה לא סביר,ולראייה הממוצעים בקורס לאורך השנים.\nאני בוחר באופציה השניה.\n\nהשורה התחתונה: אין ברירה", "timestamp": 1666165862126}, {"author": "Tim Manor", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: דנה מרצה חדשה, בסך הכל נחמדה אבל קורה הרבה פעמים שמגיעים לסוף ההרצאה ומרגיש שהיא לא הספיקה לעבור על הכל... \n\nשם המתרגל/ת: דורין ומאור.\nחוות דעת - תרגולים:  דורין גם נחמדה בסך הכל והרבה מהחומר היא הסבירה בסדר גמור אבל מאור זו ליגה אחרת. הבן אדם מסודר ומעביר ידע ברמה גבוהה.\n\nשעורי הבית: די מייגעים. מאוד קשה לעשות אותם בלי לרפרנס בכלל או להשתמש באקסל. טוענים שאלו תרגילים ממבחן אבל לוקח כמה שעות טובות לעשות תרגיל אחת מתוך שיעורי הבית.\n\nהמבחן: עוד לא עשיתי\n\nהשורה התחתונה: הקורס באמת מעניין וחשוב להמשך התואר. יש הקלטות מעולות של אלטוס בפנופטו, הן אחלה מקור ידע, שלפי דנה, מכסה את כל החומר ואולי אפילו יותר. ממש ממליץ לעבוד מולן. ועצה שאני מאמין שכבר נתנו אבל אתן שוב: לתרגל כמה שיותר כדי לדעת לפתור את התרגילים בצורה הכי יעילה לקראת המבחן.", "timestamp": 1688411249048}, {"author": "הצל", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דנה \nחוות דעת - הרצאות: אחלה מרצה, חשוב לה שהתלמידים יבינו ועונה על שאלות ברצון.\n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: מאור אחלה גבר, לפעמים מבולגן ומפוזר, אוהב מטא חומרים, אבל סהכ התרגולים בסדר, יאמר לזכותו שבשעות קבלה מקדיש המון תשומת לב לתלמידים וישב איתכם ויסביר עד שתבינו הכל.\n\nשעורי הבית: בסדר, לוקחים זמן אבל מלמדים ומעבירים את החומר טוב\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689437797323}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: מרצה טובה ממש, רואים שאכפת לה שכולם יבינו ויצליחו בקורס.\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: מתרגל מצויין, רושם קצת מבולגן על הלוח\n\nשעורי הבית: הרבה\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689485555700}, {"author": "אייל כהן", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: מאור \nחוות דעת - תרגולים: \nמאור מעביר את התרגולים בצורה מאוד טובה וגם משקיע הרבה בשעות הקבלה כדי שהסטודנט יוכל להרגיש בנוח לשאול את כל השאלות. \nשעורי הבית: המון המון זמן אבל חשוב לנסות באמת לפתור לבד כי זה התרגול היחיד שאיפשר לי להרגיש את ההבנה בחומר ולהתקדם בקורס.\n\nהמבחן: \n\nהשורה התחתונה: קשה כמו מוצקים", "timestamp": 1689596451144}, {"author": "hk", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: \nדנה מקסימה ויודעת מה היא אומרת, פשוט יש לה כנראה פחות ניסיון כמרצה וזה מורגש..\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: מדהים, פשוט המתרגל הכי טוב שתלכו אליו, יותר חשוב מההרצאה.\n\nשעורי הבית: ארוכים וקשים אבל חשוב לעשות לבד ולנסות לא לרפרנס (אפילו שבסוף כולם מרפרנסים)\n\nהמבחן: \nהמבחן היה הוגן סה''כ, קשה, אבל הוגן.\nהשורה התחתונה: בסה''כ קורס מאוד מעניין אבל דורש המון השקעה.", "timestamp": 1690196753454}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: מרצה מעולה, מסבירה בפשטות, מסודרת וממוקדת על הלוח בלי פיתוחים מעייפים ומיותרים. נענית לשאלות סטודנטים באוירה טובה. לפעמים היו לה קצת תקיעות אבל זה כנראה בגלל שזו פעם ראשונה שהיא מעבירה את הקורס. בתור חוזר קורס שחווה את שלי, דנה עשתה לי חוויה מתקנת אמיתית לקורס.\n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: אחלה מתרגל, מסביר את הדברים טוב והתרגולים שלו מתנהלים באוירה ממש טובה ורצינית. קצת מבולגן על הלוח אבל מסביר טוב את מה שהוא עושה ולא משאיר שאלות באויר ללא מענה.\n\nשעורי הבית: לא קלים, וסופר חשוב להתמודד איתם כדי להצליח בקורס. 12 גליונות מודל עם חובת הגשת דרך פתרון. חובת הגשה של 10 נותנים 10% תקף.\n\nהמבחן: עמוס, 20 סעיפים שמחולקים ל3 שאלות. קשה ממש (אך אפשרי) להספיק את כולן אפילו עם תוספת זמן.\n\nהשורה התחתונה: קורס ממש חשוב! להשקיע לאורך כל הסמסטר! אם יש סגל טוב אז סיכויי ההצלחה עולים", "timestamp": 1690275160903}, {"author": "~~~", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: מרצה חדשה אבל היא הייתה סבבה לגמרי\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: אחלה מתרגל עוזר להבין את החומר לעומק\n\nשעורי הבית: קשים מאוד כמעט בלתי אפשרי בלי רפרנס\n\nהמבחן: וואלה היה יחסית קל לשנים קודמות אבל עדיין ממוצע נמוך\n\nהשורה התחתונה: רק לעבור", "timestamp": 1690378876953}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: מרצה תותחית\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: תותח\n\nשעורי הבית: קשים אבל אל תעשו מרפרנס, לא שווה את זה\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה:", "timestamp": 1695721591151}, {"author": "מוט אפס", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: דנה היא אחת המרצות ההוגנות שיצא לי להיתקל בהן מבחינת רמת הקושי במבחן והאנושיות שלה. היא מאוד באה לקראת וניסתה ממש לא לדפוק אותנו כשניגשתי למועד ב במלחמה (וגם מועד א היה הוגן). מבחינת הרצאות - לא הכי הבנתי אותה והיה לי קשה לא לאבד ריכוז.\n אבל זה באמת לא משנה כי ההתחשבות שלה בסטודנטים זה מה שחשוב.\n\nשם המתרגל/ת: דורין ואז המוקלטים של אמיל\nחוות דעת - תרגולים: לא הכי הבנתי את דורין, אבל שווה להתקמבן על המוקלטים של אמיל וזה ייסגור לכם את הפינה.\n\nשעורי הבית: אל תעשו את הטעות שאני עשיתי ותתעקשו לעשות אותם לבד, זה משאיר אתכם על החומר.\n\nהמבחן: \nקשה. מאוד. דנה נשמה טובה והיא באה לקראת, המטרה שלה זה שסטודנטים יעברו את זה (ואולי גם בטוב). \nהשורה התחתונה: אין מה לומר, קורס קשה ואם דנה מרצה אחראית אז זכיתם. תשקיעו.", "timestamp": 1703761086338}, {"author": "Tim Manor", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דנה סולב\nחוות דעת - הרצאות: \nרואים שדנה מרצה אכפתית, ושבאמת בשאלות פרטניות היא יודעת להסביר את החומר, אבל בהרצאות היא קצת מעופפת ונראה כאילו היא קצת לחוצה. אבל מצד שני להבנתי זה הקורס הראשון שהיא מעבירה בפקולטה אז מאמין שהיא תשתפר עם הזמן.\nשם המתרגל/ת: דורין רואינסקי \nחוות דעת - תרגולים: מתרגלת מסודרת אבל מהצד לא נראה כאילו היא ממש חדה על החומר. לפחות היא רושמת הכל ממש מסודר אז אפשר להבין הכל אחר כך. יצא לי להיות גם קצת אצל מאור שומינוב והוא מתרגל מעולה! חד על החומר ומסביר ממש טוב!\n\nשעורי הבית: הכל זה תרגילים ממבחנים אז ממש כדאי לעשות הכל! לא קלים אבל לרוב עוזרים בהבנת החומר!\n\nהמבחן: \nבסך הכל הוגן.\nהשורה התחתונה: \nקורס לא קל, צריך להתרגל לעבוד עם השאלות בצורה מסוימת ותמיד לחפש את הדרך הקצרה ביותר אחרת נגררים להמון חישובים, שהם מלכודת לטעויות חישוב או מבוי סתום.", "timestamp": 1704702925001}, {"author": "יוסף", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: מסבירה מצויין ועם חיוך גדול. היתה סבלנית מאוד לשאלות ודאגה שהשואל יקבל תשובה מספקת \n\nשעורי הבית: משקפים היטב את החומר ולדעתי לא כבדים מדי\n\nהמבחן: רק שאלות מתרגילי בית או תרגולים. לא יכל להיות יותר קל\n\nהשורה התחתונה: דנה מרצה מושלמת!", "timestamp": 1704879134192}, {"author": "הצל", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: ההרצאות היו טובות, קצת איטיות לפעמים ולפעמים היו נקודות בהן דנה מניחה שרוב הכיתה הבינה כשבפועל החומר לא עבר עד הסוף.\nלמרות זאת, דנה נכונה מאוד לענות על שאלות ומאוד חשוב לה שהתלמידים יבינו\n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: אחלה גבר, מעביר את התרגולים קצת מהר מידי וממש לא מתעקב על חישובים, עושה אותם בבית ופשוט מרביץ אותם על הלוח ולא אוהב ששואלים איך עשה. \nלעומת זאת מאוד מאוד חשוב לו שתבינו את השיטה ואיך הדברים עובדים וידאג לשבת ולהסביר עד שברור ב100%, אני ממש נעזרתי בו בשעות קבלה והוא ממש הבהיר לי דברים. \n\nשעורי הבית: חשוב מאוד מאוד! אני קצת רפרנסתי והתחרטתי על זה, כן אפשר לרפרנס אם ממש לא מצליחים אבל לשבת ולהבין מה קורה ומה עשו. להשקיע את הזמן כי זה ממש ממש חשוב.\n\nהמבחן: הוגן \n\nהשורה התחתונה: אין ברירה וגם תכלס די מעניין", "timestamp": 1705307196298}, {"author": "שם", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: \nמעולה! \nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: \nמעולה כפליים! \nשעורי הבית: דרגת הקושי עולה עם הזמן, יש הרבה תרגילים אבל רק עם עושים אותם בלי לרפרנס קולטים את החומר בצורה טובה\nהמבחן:  היה הוגן! חייבים ללמוד הרבה ולפתח טכניקה.", "timestamp": 1706014632944}]}