{"posts": [{"author": "ברנולי", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מורן ברקוביץ המלך\nחוות דעת - הרצאות: \nפשוט וואו. מורן המרצה הכי טוב בפקולטה בפער. בן אדם נחמד כריזמטי ואכפתי שרק מנסה לעזור לנו ומסביר את החומר בצורה נהדרת ומרתקת. בשורה התחתונה מרצה ובן אדם מדהים שלא תפגשו כמוהו בשום מקום אחר בפקולטה.\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: \nהתרגולים היו נהדרים וממש עזרו להבנת החומר. מור מתרגל מצוין, מסביר ברור, חד על החומר ויודע לתת את ההערות הנכונות להבנת החומר. התרגולים עצמם טובים מאוד ונותנים אחלה רקע לעשיית שיעורי הבית. דניאל וידקר החליף אותו בכמה תרגולים וגם הוא היה מצוין, על אף שלטעמי מור יותר טוב. \nשעורי הבית: \nקשים מאוד, אבל אם מצליחים אותם לבד ושוברים את הראש זה משתלם. לנו במבחן הייתה שאלה מהשב ומי שעשה אותה לבד והבין הצליח בה. הם לפעמים נראלים קשים מאוד או לא ברורים אבל כדאי מאוד לשבור את הראש ולשבת מולם עד שמצליחים ולא לרפרנס בכלל. בשעות קבלה הצוות עזר מאוד.\nהמבחן: \nהמבחן שלנו היה מורכב מ-2 שאלות במקום 3 שיש בדכ וגם שתיהן היו מהשב והתרגול, כשבדכ הייתה רק שאלה אחת מתוך 3 כזו. מודה שמעט הופתעתי מהממוצע במועד א. אני עשיתי את השיעורים וחזרתי על התרגולים והסדנאות לפני המבחן וזה בהחלט השתלם בציון. לדעתי המבחן הראה כמה חשוב להבין את השיעורי בית ולשבור עליהם את הראש ולא סתם לרפרנס כי ככה היה ניתן להצליח את רוב המבחן וגם הסעיפים החדשים שלא היו בשב עדיין היו בסדר אם מבינים את החומר. עדיין אי אפשר להגיד שהמבחן היה קל, שתי השאלות שהיו בו היו מהקשות שראינו ולכן כן ניתן להבין בצורה כזאת או אחרת את הממוצע.\nהשורה התחתונה: \nקורס מעניין, הצוות הכי טוב בפקולטה בפער. להשקיע מלא בסמסטר, ללכת לסדנאות אם יש, וללמוד טוב למבחן ובהחלט אפשר להוציא מהקורס הזה הרבה.", "timestamp": 1690385659540}, {"author": "זרימה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: מציג את הנושאים בקצב רגוע. מומלץ להקשיב בתרגולים ולפתור הכי מסודר כי אז הרעיונות הפיסיקליים ברורים.\n\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים: תרגולים מסודרים. ברור שהוא מבין וזה עוזר. מומלץ בחום לפתור את התרגולים שוב מסודר כדי גם שיהיה במחברת/קלסר פתרון ברור וגם כדי שאחרי זה בלמידה למבחן הנושאים יהיו זמינים. (הבנה של איך עובד אינטגרל למשל מפיסיקה 2 מאוד חשובה! כאילו תרגול 1 שמה)\n\nשעורי הבית: סבבה. (רק תרגיל אחד מוזר, לא להתבייש לרפרנס אם צריך ואז לכתוב מסודר ולהיות בטוחים שהרעיון מובן). השלב אחד החשובים, לא לדלג!\n\nהמבחן: מאוד נחמד, מקווה שגם בשנים באות יעשה 2 שאלות פתוחות ולא 3.\n\nהשורה התחתונה: קורס כיף ומאתגר. תהנו!", "timestamp": 1691237909833}, {"author": "L", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: \nהרצאות ארוכות ומעייפות,אך חשובות.\nהמרצה מלמד דיי בסדר במשך 4 שעות וגם בצורה מעניינת \nשם המתרגל/ת: ישראל \nחוות דעת - תרגולים: \nתרגולים דיי מובנים ומועברים בסדר.אך לפעמים כיוון שמתרגל רוצה שנענה יחד איתו על שאלות התרגול,נוצר לפעמים ויכוחים שלוקחים זמן.חוץ מזה,ישראל מתרגל תותח\nשעורי הבית: \nארוכים וקשים\nהמבחן: \nדורש ידע רב ושליטה חזקה בחומר\n\nהשורה התחתונה: \nהיה פרוייקטים בקורס כנקודת בונוס והם היו מעניינים", "timestamp": 1691474638450}, {"author": "AA", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: מרצה מאוד אכפתי וכריזמתי אבל קצת מבולגן על הלוח. יש כאלה שמסתדרים עם זה ויש כאלה שמאבדים  את הריכוז בגלל זה.\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: מור מתרגל טוב ויודע את החומר היטב, אבל הוא קצת רץ על התרגולים לפעמים ומדלג על דברים שאחכ שוברים עליהם תראש בש.ב.\nנותן טיפים נהדרים לפתרון תרגילים.\n\nשעורי הבית: כמעט בלתי פתירים, הרפרנסים כמעט כולם עם טעויות.\nמצד אחד אם פתרתם אותם לבד המבחן בכיס הקטן, מצד שני הרוב מרפרנסים ואז רק לומדים מטעויות שנמשכות לאורך כל הסמסטר.\nתלכו לשעות קבלה אין ברירה אחרת.\n\nהמבחן: \nקל אם פתרתם את הש.ב. לבד. קשה אם רפרנסתם.", "timestamp": 1705568907113}]}