{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות: \nההרצאות וידאו מצויינות.\nשם המתרגל/ת: סרגיי מהוידאו\nחוות דעת - תרגולים: \nהתרגולים בוידאו מצויינים.\nשעורי הבית: \nחשובים בעיקר בשביל כל מיני טכניקות אלגבריות שנלמדו במהלך הקורס (ויש לא מעט כאלה), לא מרגיש שכל כך עוזרים להבנה עמוקה של החומר.\nהמבחן: \nלפני המבחן מאוד חשוב לדעת שאתם סגורים על כל הטריקים הקטנים של פיתרון שאלות ויש הרבה כאלה. מהבחינה הזאת כדאי לעבור על הש\"ב לפני המבחן כדי לחזור על כל הטכניקות. תבואו עם דף נוסחאות טוב, מומלץ להכין חלק ממנו בעצמכם.\nהשורה התחתונה: \nקורס ממש יפה ומעניין בטירוף. יזהר תותח", "timestamp": 1602238102778}, {"author": "רוני", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יזהר\nחוות דעת - הרצאות: מרצה בצורה טובה, מאוד מסודר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בערך 7 גליונות די גדולים, אבל יש גם פרויקט שמעמיס ככה שיש הרבה מה לעשות\n\nהמבחן: היה מאוד ארוך, בלתי אפשרי כמעט לסיים בזמן. בעבר היו מבחנים הרבה יותר קלים והוגנים.\n\nהשורה התחתונה: קורס די עמוס, לא מעט חומר, אבל לא קשה מידי והציון הסופי תלוי בעיקר במבחן שהמרצה יחליט לתת", "timestamp": 1602423666482}, {"author": "יוני בלוך", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות: מרצה מעולה, ממש מתודי ומסביר את הדברים בצורה מאוד טכנית וברורה. קצת מונוטוני אבל זורק בדיחות קרש בין לבין שמעירות את כל הסטודנטים\n\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים:  לא הלכתי, לא היה חסר\n\nשעורי הבית:  היו 7 תרגילי בית להגשה במשקל מגוחך של 5 אחוז, אבל תקף ובנוסף היו שלושה פרוייקטונים חצי עמוסים שכל אחד מהם היה 10 אחוז תקף.\n\nהמבחן: לא פרופורציונלי, לא לתרגילי הבית והפרוייקטונים ולא למבחני עבר. דרעק\n\nהשורה התחתונה: קורס מעניין, מאוד בסיסי. אפילו כיף אם לא דופקים אותך במבחן", "timestamp": 1627566760083}, {"author": "המשמיד", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקסים קריסטלני\nחוות דעת - הרצאות: מרצה באמת נחמד ואחלה. אני אישית חושב שההרצאות הן לא גולת הכותרת ומספיק ללמוד את הפרקטיקה לפני המבחן, אבל מקסים בחור מאוד חמוד ואולי לא הייתי מוותר עליהן.\n\nשם המתרגל/ת: קבצי תרגול\nחוות דעת - תרגולים: לא התחברתי לאף אחד מהמתרגלים בקורס, הרגשתי שהם היו לא משהו בכלל. הקבצי תרגול בקורס מאוד מאוד מפורטים וסוגרים את רוב אם לא כל הפינות בחומר.\n\nשעורי הבית: 5 גיליונות ברמה בסדר, ששווים 5 אחוז תקף (לא שווים את הזמן השקעה בהם, אבל אין ברירה). פרויקטון מתמשך שמחולק לשלושה חלקים והוא 30 אחוז תקף, היה ברמה בסדר ולא דרש לשים כמות זמן לא הגיונית בהשוואה לקורסים אחרים.\n\nהמבחן: המבחן היה מאוד פייר, למי שהיה על החומר באמת וקיבל גם מספיק זמן ללמוד לפניו- אין סיבה שלא יצליח. בשבוע האחרון לסמסטר מקסים פתר בחינה לדוגמא ואמר שהבחינה תהיה דומה לה- אז כדאי לשים לב אם הוא המרצה שלכם.\n\nהשורה התחתונה:  מקסים>>יזהר. קורס חובה שחשוב להצליח ולהתעניין בו למי שמעוניין בתחום הבקרה.", "timestamp": 1658394559834}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקסים קריסטלני\nחוות דעת - הרצאות: מרצה נחמד ואכפתי מאוד. הרצאות מעניינות אך לפעמים מתעכבות ממש על תיאוריה מתמטית מיותרת.\nשם המתרגל/ת: קבוצה ריקה.\nחוות דעת - תרגולים: \nהקבצי תרגול ממש מעולים ואפשר ללמוד את הקורס דרכם וללכת לשעות קבלה לשאלות ספציפיות או לצפות בהקלטה של סרגיי. אם כבר הולכים אז ליאור אחלה. \nשעורי הבית: \n35 אחוז תקף, מהם 30 פרוייקטונים ו-5 שיעורי בית. בסה\"כ סבירים. \nהמבחן של מקסים: \nהוגן, לא שואל על פינות חשוכות בחומר, אך בעל משקל כבד מידי לשאלות האמריקאיות.\nהשורה התחתונה:\nקורס מעניין, פרקטי אבל הרגיש שהיה יכול להיות הרבה יותר, מעט מטלאב ובחינה הוגנת.", "timestamp": 1659039128885}, {"author": "מלונאר", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יזהר - הקלטות\nחוות דעת - הרצאות: \nמסביר טוב ומובן, קצת רץ \n\nשם המתרגל/ת: וידאו\nחוות דעת - תרגולים: \nמובן רוב הזמן\nשעורי הבית: \nקשים ורעים כולל פרוייקטונים מייאשים\nהמבחן: \nמאוד תלוי מרצה, כל אחד שם דגש אחר\nהשורה התחתונה: \nאם היו צריכים לתאר אותי בשתי מילים זה היה קוטב חיובי", "timestamp": 1668502845273}, {"author": "ג", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקסים\nחוות דעת - הרצאות: כשמו כן הוא.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: אחלה מתרגל, מומלץ.\n\nשעורי הבית: עוזרים להבנת החומר הנלמד.\n\nהמבחן: סביר ביותר\n\nהשורה התחתונה: קורס מעניין ויותר באיזי.", "timestamp": 1679240238989}, {"author": "Random", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: \nהרס את הקורס\n\nשם המתרגל/ת: אף אחד\nחוות דעת - תרגולים: \nכל המתרגלים ממש גרועים\n\nשעורי הבית: \nאין\n\nהמבחן: \nאני מתפלל לשלושת הדתות שיהיה בסדר\n\nהשורה התחתונה: \nמשעמם ומזעזע, דף נוסחאות בגודל של מיקרון, בלי מחשבון, עם 20 ספרות של פאי. כל הקורס הוחלף משום מה בעיבוד אותות מאשר מערכות לינאריות", "timestamp": 1689258414162}, {"author": "S", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות: ליאוניד הוא ההתגלמות של המשפט \"It's my way or the highway\". הוא מלמד איך שהוא חושב שנכון ללמד ולא כלכך אכפת לו אם אנשים מבינים או לא.\nאם מצליחים להתמודד עם הגישה הזו אפשר ללמוד הרבה מהרצאות אבל כל הרצאה מכילה מסה עצומה של חומר וקשה מאוד להבין מה רלוונטי באמת ומה סתם אנקדוטה שולית.\nקצב הלימוד מאוד מאוד מהיר. בשקופית אחת הוא יכול להגדיר מושג חדש, לעבור עליו פעם אחת בזריזות ואז כל שאר ההרצאה זה הופך להיות הנושא החשוב והוא נותן 1000 פרטי מידע נוספים לפני שמישהו בכלל הספיק לעכל את ההגדרה.\n\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: מכל המתרגלים הוא הכי טוב אבל גם הוא לא מהמתרגים המדהימים שהיו לי עד כה בתואר. סך הכל מעביר את כל התרגול ונותן את הדגשים החשובים. מלמד מאוד מאוד לאט ולפעמים פשוט קראתי לבד את הפתרון של כל התרגול בזמן שהוא תקוע על השאלה הראשונה.\nמאוד אכפתי ומנסה לעזור לכולם להבין.\n\nשעורי הבית: אין רשמית. יש כמה שאלות נוספות לתרגול עצמי בסוף כל קובץ תרגול.\n\nהמבחן: 26 שאלות זריזות שמכסות את רוב החומר שנלמד בקורס. יש המון דברים לשנן ולזכור. רוב השאלות מתבססות או על הבנה מאוד בסיסית או על שינון של נוסחא/כלל אצבע שנלמד בהרצאה. אין הרבה חישובים.\n\nהשורה התחתונה: פוטנציאל ממש גבוה להיות קורס מרתק אבל הועבר בצורה די מזעזעת. כל שבועיים יש בוחן על החומר של השבועיים האחרונים שאף אחד לא באמת מצליח בו. \n\nליאוניד שינה משמעותית את הרכב הקורס לעומת שנים קודמות אז אף אחד לא באמת הבין מה הולך כל הסמסטר, כולל המתרגלים (הם הגיעו להרצאות בעצמם בשביל להבין מה אנחנו לומדים).\nיכול להיות ששנה הבאה יהיה יותר טוב כי ליאוניד כבר בנה את הקורס אז גם הוא וגם המתרגלים ידעו יותר טוב מה הכיוון הכללי ויהיה ניתן להכווין לנושאים החשובים בצורה מדוייקת יותר.", "timestamp": 1690050159606}, {"author": "T", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: האדם הכי חסר רגש שפגשתי בחיים. השקיע המון בבניית ההרצאות אבל הוא ממש אפתי וההרצאות שלו קשות. לא כזה אכפת לו מסטודנטים.\n\nשם המתרגל/ת: מארק\nחוות דעת - תרגולים: מארק בסדר, אם כי קצת קשה לו להעביר עקרונות לפעמים וזה מקשה על ההבנה. \n\nשעורי הבית: לא היה\n\nהמבחן: מבחן סופר טריקי על דברים ממש ספציפיים, מצד אחד הוא כן הבהיר לפני מה הדברים המדויקים שצריך לדעת בעל פה, מצד שני כן היה צריך לדעת את כל החומר כדי להצליח במבחן.\n\nהשורה התחתונה: דורש למידה מסוג אחר לגמרי ממה שהייתי צריך בשביל קורסים אחרים. בהצלחה.", "timestamp": 1690185582843}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: ההרצאות די עמוסות ומועברות בצורה משעממת. כמעט חצי קורס עשינו הכנה מתמטית ולא עסקנו בשום דבר ממשי ופשוט לא היה מובן על מה הקורס ומה מצופה מאיתנו להבין.\n\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: המושיע של הקורס, הצליח להסביר בכמה דקות בצורה הכי פשוטה ואינטואיטיבית קונספטים לא מובנים שפשוט נזרקו עלינו בהרצאה ולאוניד דיבר עליהם שעות.\n\nשעורי הבית: אין חובת הגשה, יש בסוף כל דף תרגול כמה שאלות שמוגדרות שאלות לתרגול בבית אבל הן לא קשורות לסוג השאלות שיש במבחן, בדרך כלל הרבה יותר מורכבות ממה שנדרש לעשות במבחן.\n\nהמבחן: 26 שאלות קצרות של סימוני נכון/לא נכון שדורשות לספק הסבר של שורה או שתיים.אם בחרת בתשובה הנכונה אבל סיפקת הסבר לא מתאים לאוניד קוטל אותך. חלק מהשאלות דורשות פשוט תשובה מספרית ללא נימוק. השאלות יחסית טריקיות ולא מעט פעמים לאוניד נכנס לפינות אפורות בחומר ודקויות מעצבנות אז חשוב לשים לב לזה.\nבמהלך הסמסטר כל הרצאה שניה בערך לאוניד עשה \"חידון\"(סה\"כ 6 חידונים) ככה שציון המגן(30%) של כל סטודנט הוא ממוצע ה5 הטובים ביותר. זו שיטת הערכה על הפנים כי הוא נותן 8 דק' לענות על 3 שאלות ומספיק שטעית בשאלה 1 כבר הציון שלך גרוע. בקיצור המגנים של רוב הקורס היו לא משהו\n\nהשורה התחתונה: קורס חשוב שמועבר בראש קשה ובצורה לא טובה.", "timestamp": 1690274497124}, {"author": "מיפ", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ליאוניד מירקין \nחוות דעת - הרצאות: \nאין דרך להבין 60 עמודים של מצגת מלאה באינטגרלים בשלוש שעות. הוא משעמם חושב שאנחנו רובוטים שמבינים הכל אחרי שמראים לנו שקף במשך 10 שניות ובכללי לא נראה שאכפת לו מסטודנטים.\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: \nהמתרגל היחיד הטוב בקורס הזה. כל שאר המתרגלים הם בושה לפקולטה. ליאור מסביר טוב ובכללי הוא נקודת האור היחידה בקורס. לכו אליו בכל מחיר בלעדיו זה אבוד.\nשעורי הבית: \nאין וחבל (לפרסם 3 שאלות לתרגול עצמי בסוף כל תרגול ולקרוא לזה שיעורי בית זה יפה אבל זה לא שב)\nהמבחן: \nלנו היה 26 שאלות קצרות יחסית של שאלה ואז תשובה קצרה והסבר עליה. השאלות היו על כל מקרי הקצה האפשרים ביקום ובכללי הלמידה למבחן היא יותר שינון של דברים מאשר הבנה וחבל. \nהשורה התחתונה: \nמירקין הרשע הרס את הקורס ובאסה לנו שהוא חוזר גם במבוא לבקרה", "timestamp": 1690386033848}, {"author": "מערכות לינאריות", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מירקין\nחוות דעת - הרצאות: רץ כמו dream במיינקראפט. תעברו על ההרצאה טוב בבית או לפני (כנראה שלא אצלו כי הוא משחק עם המצגת עד הרגע האחרון). אין לו פרופורציה לגבי כמות החומר שזורק על הלוח. אבל נושאים סופר סופר חשובים!\n\nשם המתרגל/ת: ליאור\nחוות דעת - תרגולים: מסודר, ברור ועוזר לסדר את החומר כמו שצריך\n\nשעורי הבית: אין וחבל!\n\nהמבחן: אם עושים דף נוסחאות מסודר ללמידה ועוברים על התרגולים ופותרים שאלות הכנה לבד זה סוד להצלחה. אמריקאי סבבה\n\nהשורה התחתונה: מרצה זבל. מתרגל מלך ותלמדו מהתרגולים (חלק מהמשפטים באפור במצגת הם bulshit, תשתדלו להבין את הרעיונות בלינאריות)", "timestamp": 1691238261113}, {"author": "L", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: לאוניד מירקין \nחוות דעת - הרצאות: \nהרצאות היו נוראיות ולוקחות הרבה זמן סתם.\nשם המתרגל/ת:ליאור ומארק\nחוות דעת - תרגולים: \nמתרגלים תותחים שרק בתרגולים שלהם למדתי נושאים חדשים והבנתי את חומרי הקורס\nשעורי הבית: \nלא היה,היה בחנים כל הרצאה שהיו נוראים\nהמבחן: \nדורש ידע חזק בקורס\nהשורה התחתונה: \nקורס שהיה יכול להיות יותר טוב אם היה סגנון אחר של לימוד והרכב שונה של ציון קורס.", "timestamp": 1691474789679}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות: יזהר מרצה נהדר, מסביר טוב מאד. ההרצאות מועברות טוב ומובנות. קשוב לסטודנטים גם מעבר להרצאות. \n\nשם המתרגל/ת: ליאור סאלם\nחוות דעת - תרגולים: מתרגל פגז, המלצה חמה ללכת אליו.\n\nשעורי הבית: הש.ב חשובים בשביל להבין את החומר. בכללי הקורס נוגע בנושאים ש\"חדשים\" מבחינת הקונספטים וכדומה, לכן חשוב לעקוב אחרי החומר שלא יברח.\nהיו גם 3 מיני פרוייקטים במטל\"ב שהיו קשים אבל עזרו להבנה. הש.ב והמיני פרוייקטים בנו 40% מגן שזה פצצה.\n\nהמבחן: מבחן אמריקאי עם 13 שאלות. היה מבחן הוגן. החיסרון הוא שאין מבחני עבר כמעט לתרגל מהם ומה שיש זה בלי פתרונות רשמיים אם בכלל. לנו פרסמו 4 מבחנים במודל בלי פתרון.\n\nהשורה התחתונה: קורס חשוב בפקולטה, צריך להיות עם אצבע על הדופק לאורך הקורס. למיד של 5 ימים חזקים מספיקה בשביל לעבור ולקבל ציון סבבה", "timestamp": 1715615597444}]}