{"posts": [{"author": "מתוסכל", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: מורן ברקוביץ,\nחוות דעת - הרצאות: ראינו הרצאות מוקלטות משנים קודמות, בסוף מורן דפק אותנו ושאל מלא במבחן על דברים שהוא דיבר עליהם רק בשעות קבלה שהוא הגדיר רשות ולהלן ממוצע 47 במועד ב אחרי פקטור 10 נקודות. חד משמעית המרצה האכזרי ביותר שנתקלתי בו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא היו חובה אבל עוזרים לתרגול\n\nהמבחן: עשיתי רק מועד ב והיה מזעזע אפילו לסטנדרט טכניוני, שאלה של 50 נקודות על נושא קטן ונוראי שהוא עבר עליו רק בשעות הקבלה שלא היו חובה, עוד מלא סעיפים תאורטים לחלוטין בסגנון של להוכיח נוסחאות. הממוצע היה 47 אחרי פקטור של 10 נקודות.\n\nהשורה התחתונה: הקורס הכי מחריד בתואר", "timestamp": 1613928193857}, {"author": "עכברוש", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מורן ברקוביץ'\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, מורן אדם מרתק, לפעמים סוטה מהנושא יותר מדי ומכניס דברים מחיי היומיום שלו (ניסויים וכו).\n\nשם המתרגל/ת: ישראל גבאי\nחוות דעת - תרגולים: מתרגל תותח, סבלנות ורצון לענות על שאלות תמיד\n\nשעורי הבית:  קשים מאוד, אין רפרנס רשמי כך שקשה מאוד לדעת איפה עומדים מבחינת התרגילים.אין הגשות חובה. מומלץ מאוד מאוד לעשות כדי להיות עם האצבע על הדופק, אחרת מאבדים את זה .\nהיו 4 פרויקטוני בונוס נחמדים של 3 נק כל אחד.\nהמבחן: לשם שינוי היה מועד הוגן, מומלץ מאוד מאוד ללכת לכל שעות הקבלה, לומדים משם המון .\n\nהשורה התחתונה: קדם , קורס חובה ככה שאין יותר מדי ברירות. קורס להוציא בו 60 ולשכוח ממנו.", "timestamp": 1626161502993}, {"author": "אור", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מורן \n\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים: מתרגל טוב, משתף את הכיתה בתהליך החשיבה של פתרון התרגיל ומסביר בצורה מעולה.\n\nשעורי הבית: לא חובה, לא פשוטים אבל חשובים מאוד. ממליץ לפתור אותם במהלך הסמסטר.\nלנו הייתה שאלה מהשיעורי בית במבחן.\n\nהמבחן: הוגן, אם לומדים טוב ומבינים את העקרונות אפשר להוציא ציון טוב בכיף.", "timestamp": 1626441097589}, {"author": "הפחח", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  מורן ברקוביץ'\nחוות דעת - הרצאות: מרצה מעולה, כיף ממש להקשיב לו והוא ממש מובן\n\nשם המתרגל/ת: ישראל גבאי\nחוות דעת - תרגולים: ישראל עשה סדר בחומר, ענה לשאלות בסבלנות. לפעמים התרגולים קצת עמוסים אז היה פחות זמן לשאלות אבל מסתדרים\n\nשעורי הבית: 6 תרגילי בית שהם לא חובה. ברמה של מבחן וממש עוזרים בלמידה לקראתו (מעבר לזה שאחת משאלות תרגילי הבית מופיעה במבחן עצמו)\nבנוסף היו 5 פרוייקטונים של לעשות סרטון של כל מיני ניסויים בזרימה, דיי מעניינים וקלילים יחסית. נתנו 3 נקודות בונוס על כל פרוייקטון שעמד בדרישות, ממש נקודות מתנה\n\nהמבחן:  דורש המון הבנה והמון השקעה. עם תכנון זמן נכון ממש אפשר להצליח להוציא בו ציון יפה\n\nהשורה התחתונה: אחלה קורס, אחלה סגל", "timestamp": 1627566565679}, {"author": "מגנוס", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ'\nחוות דעת - הרצאות:  מרצה מצויין ואחלה בנאדם בכללי הופך את הקורס לחווייה אמיתית, סה''כ מאוד ממליץ להגיע ולהקשיב, הידע התיאורטי בקורס הזה מאוד חשוב למבחן.\n\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים:  בחור סבבה סה\"כ, הבעיה היחידה שלו זה שלפעמים צריך להיאבק איתו קצת כדי שיענה על שאלות בכיתה אבל הוא נותן הרבה נקודות חיזוק במהלך התרגולים שלו והוא מערב סטודנטים בפיתרון, מתרגל ברמה מצויינת אבל יש מקום לשיפור.\n\nשעורי הבית:  קשים וארוכים אבל מאוד מלמדים את החומר וכמעט תמיד לקוחים ממבחני עבר, מאוד ממליץ לעשות אותם עם רפרונס מינימלי כי הם באמת מלמדים את הקורס מ-א עד ת.\n\nהמבחן:  מבחן מאוד הוגן, מאוד דומה לשיעורי הבית והכי חשוב מבחן פתוח א אשכרה בודקים אם אתה יודע את החומר, יש פה ושם הנפצות שזה המבלן הכי קשה בפקולטה אבל זה לא מתקרב לקרסוליים של ספי למי שדואג ממורן.\nכמו כן יש גם פרוייקטונים דיי סבבה שעצם הגשתם כמעט תמיד תקנה לפחות 2 נקודות לציון הסופי, כלומר אם עושים את כולם ניתן להוסיף 8 עד  12 נקודות לסופי, זה מטורף ואם אתם לא עושים את כולם אתם יוצאים פראיירים.\nהשורה התחתונה:  קורס מעניין מאוד, סגל ברמה גבוהה ומבחן הוגן, ממליץ לקחת עם מורן אם יש אפשרות בשביל החווייה והאווירה שהוא מקנה בכיתה.", "timestamp": 1657901969344}, {"author": "Alen", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: ברורות ומעניינות , אין מה להרחיב על מורן , הוא פשוט ממש טוב .\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: מתרגל טוב , עוזר להבין את החומר שנלמד בהרצאות ומנסה להנגיש אותו בצורה טובה וברורה , ובנוסף לפתח אינטואיציה . קשוב לשאלות .\n\nשעורי הבית: ארוכים , קשים אך מלמדים . בלעדם קשה לי להבין איך באמת מצליחים להבין את הקורס .\n\nהמבחן: קשה , אבל הוגן . מצריך הכנה קפדנית והבנה עמוקה של החומר . \n\nהשורה התחתונה: קורס מעניין ומלמד , המעבדות מראות תופעות מגניבות ומנגישות את החומר בצורה שונה . אך הקורס גם מאוד קשה בו זמנית .", "timestamp": 1658231952964}, {"author": "המשמיד", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ'\nחוות דעת - הרצאות: מרצה טוב סה\"כ, ההרצאות הן של שלוש שעות ומאוד מאוד מעייפות, עוסקות ממש בפיתוחים תאורטיים שלא הכי רלוונטיים לקורס (כי הפרקטיקה חשובה בתכלס). הרצאות מעניינות אבל מתישות ממש.\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: מתרגל מעולה, חושב שבאמת הוא מבין אנשי הצוות היותר מוצלחים שיש בפקולטה. נותן טיפים ורציונל לדרכי פתרון שאלות, וזה מאוד חשוב בקורס כמו זה.\nבכללי הצוות מתרגלים בקורס הזה מעולה (שזה טוב כי הקורס נחשב למבין היותר קשים בפקולטה), אבל מור תותח.\n\nשעורי הבית: 5 גיליונות דיי גרועים וארוכים, אבל ממש מכינים לבחינה הסופית ואם פותרים אותם עצמאית אתם לגמרי על הקורס. מורן אפילו עשה במבחן שאלה שממש מבוססת אחד לאחד על תרגיל שב שהיה לנו.\n\nהמבחן: קיבלנו סה\"כ מועד א פייר, שלוש שאלות פתוחות שנבדקו לא בצורה הכי מחמירה- אז בכללי צוות הקורס יצא ממש בסדר למול הסטודנטים. אם לומדים ואתם על החומר אין סיבה שלא תצליחו (רק צריך להבין איך מורן חושב ולהכנס לראש שלו).\n\nהשורה התחתונה: קורס חובה קשה ובצדק, אבל הצוות קורס לחלוטין \"מפצה\" על זה.", "timestamp": 1658394183901}, {"author": "אפי הנמר", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: חשוב להיות בהם מקנה לכם אינטואיציה וזה חשוב בקורס הזה\n\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים: פשוט מעולה עובר בקצרה על התאוריה ושם דגשים חשובים.\nשעורי הבית:  מאתגרים מומלץ לא לרפרנס וללכת לשעות קבלה (שמאד עוזרים) אם התקשתם בפתרון תרגיל.\nבנוסף יש שאלת ש\"ב במבחן.\nהמבחן:  הוגן לחלוטין, לא נפלנו מהכסא משום שאלה שהייתה שם.\n\nהשורה התחתונה: קורס חשוב ומעניין מאד, אפשר לקבל ציון ממש טוב אם פותרים ש\"ב + פרויקטונים(שהם בין 8-10 נק מתנה)", "timestamp": 1659034817386}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ'\nחוות דעת - הרצאות: \nהמרצה הכי טוב בפקולטה, מבין את הסטודנטים ונותן הכוונה והעשרה רבה בשעות קבלה. שווה ללכת ולהקשיב גם אם אין שאלה ספציפית.\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: \nמתרגל מצויין, גורם לקורס להיראות הרבה יותר סימפטי ולא משעמם לרגע. קלאס באפס מאמץ. \nשעורי הבית: \nכבדים. רק דרכם באמת לומדים ומבינים את הקורס.\nהמבחן: \nהוגן אך מצריך הכנה גדולה מאוד לקראתו.\nהשורה התחתונה: \nקורס מעניין, סגל מעולה והפרוייקטונים שווים את ההשקעה.", "timestamp": 1659038079187}, {"author": "סטודנט מדוכא", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ' (ראיתי את מי שיש בפנופטו)\nחוות דעת - הרצאות: \nשמעתי שמורן מרצה מעולה, אבל אישית לא יכולתי להגיע להרצאות שלו. צפיתי בהרצאות בוידיאו - בדיעבד לא הפקתי מהן יותר מדי אבל נפגשתי עם החומר בפעם הראשונה דרכן וככה לא הגעתי בשוק לתרגולים.\n\nשם המתרגל/ת: מור אלגריסי (מוראל גריסי)\nחוות דעת - תרגולים: \nהמתרגל הכי טוב שהיה לי עד כה בתואר, מסביר בצורה מאוד מובנת קונספטים מורכבים ודואג שכל מעבר לא טריוויאלי שלו יובן. כמו כן, הוא נותן כלים מעולים לפתרון תרגילים ובאמת עוזר להצליח.\n\nשעורי הבית: \nאצלנו היו חובה וטוב שכך. דרך השיעורי בית באמת לומדים את הקורס, ממליץ *לא לרפרנס בכלל*. הם אמנם קשים ולוקחים זמן אבל זה שווה את זה.\nהמבחן: \nמורן רפרנס שאלה אחת מתרגילי הבית - ככה שתדאגו לעשות אותם כמו שצריך ולא \"לעבור על פתרונות\" כי אחרת תתרסקו בהבטחה. אם השקעתם בקורס לאורך כל הסמסטר אין לכם מה לדאוג, מורן עשה לנו מועד א' סופר הוגן.\nהשורה התחתונה: \nקורס די מעניין, שווה להשקיע בו כי באמת אפשר להוציא ציון מעולה. בנוסף - תעשו את הפרוייקטונים!!!!!! זה נקודות חינם. סופי המתרגלת של הפרוייקטים כמעט לא בודקת והסטנדרט באמת ברצפה, אמנם זה קצת קאדר אבל אם עושים את המינימום בכולם זה 8 נקודות בונוס לציון הסופי.", "timestamp": 1659624688476}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: מורן הוא המרצה הכי טוב שהיה לי בטכניון. הוא מסביר את החומר בצורה באמת מעולה, וגורם לאווירה מאוד טובה בהרצאות.\n\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים: מתרגל מאוד מקצועי ויסודי, מסביר את החומר בצורה מעולה שמפתחת אינטואיציה.\n\nשעורי הבית: אצלנו תרגילי הבית היו חובת הגשה עם ציון תקף. לדעתי זו ההחלטה הכי טובה שסגל הקורס עשה הסמסטר.\nתרגילי הבית לא פשוטים בכלל (חלק מכובד מהם היו שאלות מבחנים), אבל מלמדים ממש את החומר וסוגרים פינות.\n\nהמבחן: לא פשוט בכלל, אבל הוגן לגמרי. אצלינו שאלה אחת בבחינה הייתה שאלה מתרגילי הבית, ושאלה אחרת הייתה מאוד דומה לשאלה ממבחן עבר אחר. אם מנצלים היטב את כל זמן הלמידה שיש אפשר להוציא ציון יפה מאוד.\n\nהשורה התחתונה: לדעתי זה קורס החובה הכי מעניין שלומדים בתואר עד סמסטר 4. תוסיפו לזה סגל קורס באמת מקצועי שיודע מה הוא עושה, ופרויקטונים קלילים שהם בונוס לציון הסופי, וקיבלתם (לדעתי) את אחד הקורסים הכי טובים שתיקחו בתואר.", "timestamp": 1659702095552}, {"author": "סטודנטית מגניבה", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ\n\nחוות דעת - הרצאות: \nמרצה מהנה ביותר, כל הרצאה חוויה, לא מבינה כלום מאף הרצאה. במבחן הוא ממש התיישב לידנו כדי לענות על השאלות ונתן תחושה שהוא באמת בא בשביל לעזור.\n\nשעורי הבית: \nקשים רצח, חובה לפתור ולשבת עליהם ולהבין בשביל להגיע מוכנים לתקופת בחינות. השיעורי בית היו ארוכים בטירוף ובלתי ניתנים לסיום \n\nהמבחן: \nקשה ברמות, דורש הבנה ואל תשכחו שאפשר להשתמש במשוואת הגזים בשביל לחשב לחצים.\n\nהשורה התחתונה: \nקורס קשה ממש ממש אבל מעניין ברמות, מורן אגדה", "timestamp": 1663234643793}, {"author": "תום אבני", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מורן \nחוות דעת - הרצאות: \nההרצאות מעניינות ומורן נוטף כריזמה. עם זאת ממליץ להשיג מראש סיכומים של ההרצאות כי מורן נוטה להתבלבל בפיתוחים ואז חוזר אחורה וזה קצת מבלבל כל הסיפור.\nשם המתרגל/ת: ישראל\nחוות דעת - תרגולים: \nיודע את העבודה. מדגיש מה שחשוב ומסביר הכל ברוגע ובבהירות.\n\nשעורי הבית: \nקשים ודורשים זמן. תעברו על התרגול ואז תעשו ש.ב יהיה בסדר.\nהמבחן: \nמועד א' הוגן.\nמועד ב': ניגשתי כדי לשפר, מרגיש ממש שהסגל לא מעוניין שאנשים יעשו מועד ב'. אם עברתם מועד א' אני ממליץ לחשוב בכובד ראש אם לעשות מועד ב', כי הרמה שם פסיכית. \nהשורה התחתונה: \nאל תעשו מועד ב' אם לא חייב. אם כן אפשרי מאוד לעבור וגם לשפר ממועד א'- דורש הבנה מאוד עמוקה של החומר", "timestamp": 1664042790583}, {"author": "זרימתי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מורן\nחוות דעת - הרצאות: \nהמרצה הכי טוב שיש בפער, מסביר בצורה טובה ממחיש ומבין את הקושי שיש בחומר.\nשם המתרגל/ת: ישראל \nחוות דעת - תרגולים: \nכמו מורן רק המתרגל.\nשעורי הבית: \nמספר גליונות לא פשוטים אך מלמדים מאוד\nהמבחן: \nקשוח, בדיקה יחסית מקלה רק חשוב להראות הבנה \nהשורה התחתונה: \nאם לא מורן לא לקחת", "timestamp": 1668502498715}, {"author": "yuval wolfovich", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מורן ברקוביץ'\nחוות דעת - הרצאות: \nלא הייתי, אילוצי מערכת. \nצפיתי בשמעון הבר המוקלט כדי להבין בגדול על מה החומר.\n\nשם המתרגל/ת: מור אלגריסי\nחוות דעת - תרגולים: \nמלך, בזכותו הבנתי את הקורס. ממליץ לבוא פרונטלית לכל התרגולים ולהיות מפוקס כי מהם לומדים את הפרקטיקה.\n\nשעורי הבית: \nקשים מאוד, אבל ממליץ בחום לא לרפרנס. בעזרתם מבינים את החומר של הקורס\nהמבחן: \nקשה, אבל מורן רפרנס שאלה שלמה מהשיעורי בית. אם עשיתם את השיעורי בית כמו שצריך והקשבתם בתרגולים אפשרי ממש לקבל ציון יפה.\n\nהשורה התחתונה: \nאני מרגיש שקצת פספסתי את הקורס כי לא הייתי בהרצאות, אבל הקורס היה סה\"כ מעניין.", "timestamp": 1669015394679}, {"author": "ג", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה:  מורן\nחוות דעת - הרצאות: אחלה מרצה, מסביר ברור, לעניין, מעשיר בידע כללי וכו' וכו'.\n\nשם המתרגל/ת: ישראל גבאי\nחוות דעת - תרגולים: קצת קשה לעקוב אחרי ההסברים.\n\nשעורי הבית: ארוכים.\n\nהמבחן: דורש הבנה של החומר, לא פשוט.\n\nהשורה התחתונה: געגועי לתרמו", "timestamp": 1679240140468}]}