{"posts": [{"author": "נתן", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nלא ברור מה הוא עושה בהוראה, אבל זה הסיפור של חלק גדול מהמרצים בטכניון. הרצאות מיותרות.\n\nשם המתרגל/ת: יגאל כהן\nחוות דעת - תרגולים: \nהמתרגל הגרוע ביותר שנתקלתי בו, מצליח למרוח את ההסברים ולעשות אותם לא ברורים בכל זאת, מבין את החומר ברמה נמוכה ומסביר בצורה גרועה.\nשעורי הבית: דורשים זמן ועבודה.\n\nהמבחן: \n\nהשורה התחתונה: \nחרא של קורס, סגל גרוע.\nמומלץ לפתור את תרגילי הבית כדי להיות בעניינים וללמוד עצמאית מקבצי התרגול.", "timestamp": 1668106189722}, {"author": "Blank", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסר\nחוות דעת - הרצאות: \nכינוי : המלפפון\nיכולות מיוחדות: הרדמת סטודנטים, יכולת לסבך נושאים פשוטים\nאולטימייט סקייל: רשימת מבחן לא פתיר\nסיכום: פוקימון דיי מעפן, לא ממליץ אבל איזה באסה שלא שאלו אותכם.\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: פשוט אל\nבכללי כל המתרגלים לא למדו את החומר של הקורס והסתכלו על המצגות אופטימיזציה יותר בהלם ממנו.\n\nשעורי הבית: סבבה דווקא\n\nהמבחן: בלי אפשרי, מונפץ לגמרי\nלא מפרסמים מבחנים, לא מפרסמים פתרןנות\nפשוט בדיחה\n\nהשורה התחתונה: תהנו", "timestamp": 1675688012101}, {"author": "S", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: אין מה להגיד. הוא פשוט לא יודע ללמד. באמת שהוא מנסה ומשתדל. הוא לא מהמרצים המגעילים האלה שנראה ששונאים סטודנטים כמו שלי צליל אבל הוא פשוט מסביר גרוע. הלוואי ויום אחד יבינו שהוא לא מרצה טוב ויתנו לו להתעסק במחקר שלו בשקט.\n\nשם המתרגל/ת: פשוט אל\nחוות דעת - תרגולים: לא הלכתי לתרגולים בקורס. כל המתרגלים אחד אחד גרועים. לא באמת יודעים את החומר, לא עוזרים להבין. פשוט שעמום אחד גדול וכל התרגילים זה חישובים שהמתרגלים בעצמם טועים בהם. היחיד שהיה סביר היה מארק שמדי פעם הלכתי לשעות קבלה שלו.\n\nשעורי הבית: קשוחים וארוכים. מנוסחים מזעזע ולא ברור בכלל, הבדיקה מאוד לא עקבית. כן עוזרים להבין את החומר אבל לא מכינים למבחן ממש. החלק העיקרי של השיעורים זה כתיבת קוד אז לחלק זה ממש זורם וחלק שונאים את זה. \n\nהמבחן: לא הגיוני לסיים ב-3 שעות. הגעתי ממש מוכן למבחן, עשיתי את כל המבחנים מהקורס הקודם שפרסמו לנו. המבחן שקיבלנו היה איזה 10 רמות מעליהם. גם מלא חישובים וטכניקה וגם הוכחות והבנה תאורטית לא פשוטה בכלל. \n\nהשורה התחתונה: ביזיון מוחלט. לאף אחד מהסגל אין מושג מה הולך. יד ימין לא יודעת מה יד שמאל עושה. באמת שקורס עם פוטנציאל מבוזבז. נושא שבאמת יש לו חשיבות ויכול להיות מעניין ופשוט כל הניהול על הפנים. חבל שזה קורס חובה.", "timestamp": 1676824433417}, {"author": "L", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל הקסנר \nחוות דעת - הרצאות: \nמרצה עם מוטיבציה טובה, איך מסביר נושאים בהרצאה במשך 3 שעות כשניתן תוך שעה-שעתיים לסיים אותם.\nשם המתרגל/ת: יגאל כהן\nחוות דעת - תרגולים: \nמתרגל עם מוטיבציה טובה, איך מסביר מעביר לאט את תרגול שניתן להספיק מהר יותר אותו.\nשעורי הבית: \nנוראים מאוד ועמוסים\nהמבחן: \nנוראי, ארוך, עמוס ומעייף.\nהשורה התחתונה: \nקורס לא ברור", "timestamp": 1677537073108}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nהרצאות לא מובנות בכלל, יכולת הוראה השואפת לאפס, לא מבין איך הוא מרצה.\nשם המתרגל/ת: מארק\nחוות דעת - תרגולים: \nיש לו מוטיבציה להסביר את החומר, לפעמים יש לו דקה אחת מובנת מתוך שעה וחצי. בעיקר לא מובן כמו כל סגל הקורס.\nשעורי הבית: ארוכים וקשים.\n\nהמבחן: קשה, תחושה שדניאל כתב את המבחן כדי להתנקם בנו.\n\nהשורה התחתונה: קורס שהוא לא קדם לכלום, לא לקחת הסמסטר הזה, לדחות אותו לסמסטר אחר. בנוסף יש בקורס פרוייקט מזעזע שלא מובן בכלל (כמו כל הקורס).", "timestamp": 1677609246441}, {"author": "shalev", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: נכנסתי אופטימי להרצאות עד אמצע סימסטר שהבנתי שאפשר גם לבד. \n\nשם המתרגל/ת: מארק ברנמן\nחוות דעת - תרגולים: \nבניגוד לדעות מסוימות שקראתי על מארק והתרגולים שלו, מאוד נהנתי ללמוד איתו. הוא ממש מסור לסטודנטים, זמין בצורה יוצאת דופן. בכל פעם שהצטרכתי אותו הוא הסכים לקבל אותי במשרד שלו מחוץ לשעות הקבלה, והוא ממש מסביר מעולה ובצורה פשוטה יחסית.\nפלוס, הוא מאוד מאוד עוזר בפרוייקט.\n\nשעורי הבית: \nנהנתי לכתוב קוד במאטלב, באמת תוכנה מופלאה למי שלא מכיר. שיעורי הבית אורכים זמן מה. ממליץ להתחיל לפתור כמה שיותר מהר את המטלות ואם נתקעים לא לבזבז על זה זמן מיותר אלא ישר לקבוע פגישה עם אחד המתרגלים. זה חוסך הרבה זמן. \n\nהמבחן: מאתגר אך לא בלתי אפשרי. לחתור להשיג מבחנים משנים קודמות של דניאל.\nללמוד את התאוריה כמו שצריך בלי לעגל פינות, לזכור פיתוח טיילור בעל פה ויהיה בסדר.\n\n\nהשורה התחתונה:  קורס חשוב מאוד, שווה להשקיע בו להמשך הלימודים ובכלל לעתיד.", "timestamp": 1679398571071}, {"author": "NN", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: לא יודע להרצות, המזל היחיד שהוא גם מרצה לאט אז בסוף אין הרבה חומר בקורס למרות מלא שעות הרצאה\n\nשם המתרגל/ת: יגאל ומארק\nחוות דעת - תרגולים: יגאל עייף מהחיים, התרגולים שלו היו חסרי תועלת בשבילי.\nמארק היחיד בקורס הזה שמבין משהו, חבל שיש קצת מחסום שפה.\n\nשעורי הבית: לא נוראיים. אפשר לרפרנס בהתחלה, אחכ כשכבר מכירים מטלאב לעשות לבד כי זה עוזר לפרויקט ולמבחן.\n\nהמבחן: מבחן חרא ובדיקה חרא, אין לבודקים וגם למי שכותב את המבחן הבנה בחומר. \nנראה שהציון במבחן תלוי יותר בבודק מאשר במה שאשכרה כתבת במחברת.\n\nהשורה התחתונה: קורס שצריך לגנוז. \nהחומר חשוב, וגם לא קשה. אבל במתכונת הזו מדובר בבזבוז זמן, זה לא מלמד כלום. עדיף להמיר לקורס מטלאב וזהו.\nהזוי שהבנאדם הכי מובן בקורס הוא בכלל עולה חדש (מארק).", "timestamp": 1679422682575}, {"author": "SG", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nהפסקתי להגיע אחרי פעמיים-שלוש, בלתי אפשרי להקשיב לו. איטי ולא ברור\nשם המתרגל/ת: אלחנן מוקלט \nחוות דעת - תרגולים: \nניסיתי עם מארק ולא היה לי הכי מובן. אלחנן מסביר הכי טוב גם עם החומר לא לחלוטין חופף.\nשעורי הבית: \nמזעזעים, לוקחים שעות ולא מובנים. בסוף עשינו הכל עם הchat GPT.\nהמבחן: רע, שאלות מונפצות על תיאוריה שלא הוסברה היטב.  \n\nהשורה התחתונה: קורס ביזיוני שחייב לעבור רפורמה קשה. לא מרגיש שלמדתי משהו אחד חשוב ממנו.", "timestamp": 1680116078141}, {"author": "טיילור למתקדמים", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות:  גרוע מאד\n\nשם המתרגל/ת: אלחנן (הקלטות) , יותר טוב מכל המתרגלים שבקורס\nשעורי הבית:  לא היו חובה ולא עשיתי אבל ממה שהבנתי חלקם היו ממש ארוכים\nהמבחן: מזעזע כמה רמות מעל התרגולים ומבחני עבר, דניאל הפך את הקורס למאוד תאורתי ורק המעטים שהיו בהרצאות והצליחו להבין אותו יכולים להצליח בקורס כי הוא שם המון שאלות/סעיפים במבחן על נושאים שלמדו בהרצאה בלבד.\n\nהשורה התחתונה:  שיהיה לכם המון בהצלחה עם דניאל", "timestamp": 1680116741401}, {"author": "צור", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nנורא,לא ללכת\nשם המתרגל/ת: מארק\nחוות דעת - תרגולים: \nמתרגל מצויין, היחיד לדעתי שאשררה מבין תחומר\nשעורי הבית: \nסיוט ארוך ומתמשך\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713362825947}, {"author": "אא", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דניאל הקסנר\nחוות דעת - הרצאות: \nהלכתי להרצאה ראשונה והוא פשוט הקריא מהלוח מטריצה סדר nxn איבר איבר ומאז יותר לא נכנסתי\n\nשם המתרגל/ת: מארק/אלחנן המוקלט\nחוות דעת - תרגולים: מארק באמת נראה ממש אחלה פשוט לי אישית הפריע שקצת לא חוזרים על מה שקורה בהרצאות וישר רצים לתרגילים לעומת אלחנן המוקלט שקצת מסביר מי נגד מי ורק אז מתחיל לפתור תרגילים.\n\nשעורי הבית: ארוכים ולא דומים בכלל למה שהיה במבחן אבל היה 40% מגן עליהם אז היה לגמרי שווה את ההשקעה  \n\nהמבחן: קונספטים שדי חוזרים על עצמם בסופו של דבר לדעתי הדרך הכי טובה להתכונן אליו זה לטחון כמה שיותר מבחנים לפני ולהבין פחות או יותר איך לפעול בכל מצב.\n\nהשורה התחתונה: נראה כמו קורס חשוב להמשך הדרך פשוט חבל שהמרצה גרוע..", "timestamp": 1715515988918}]}