{"posts": [{"author": "Ilan", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ד\"ר ברנד מאיר\nחוות דעת - הרצאות: מי שמעניין אותו החומר יהנה מההרצאות, לא לפחד מכל הנוסחאות שמופיעות בהרצאה, אין צורך להעתיק או לזכור אותן כי הכל בחוברת.\n\nשם המתרגל/ת: מר ברוך רופמן\nחוות דעת - תרגולים: עובר על המצגת המוכנה, ולרוב זה מספיק טוב כדי להבין הכל. מוסיף מהניסיון שלו הרבה הערות מעניינות לגבי עבודתו של מהנדס בפועל.\n\nשעורי הבית: חשובים מאוד, חשוב לעבוד עם החוברת.\n\nהמבחן: צריך לדעת להשתמש טוב בחוברת הנוסחאות, ולפתור מבחנים קודמים כדי להכיר כל מני מקרים מיוחדים.\n\nהשורה התחתונה: קורס חשוב, לא עמוס בצורה יוצאת דופן, מעניין למי שאוהב תכן.", "timestamp": 1604833020400}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מאיר ברנד\nחוות דעת - הרצאות: לא עברו בצורה מעניינת כל כך, ככל הנראה בגלל לימודים היברידיים \n\nשם המתרגל/ת: ברוך רופמן\nחוות דעת - תרגולים: מאוד מעניין והרבה ערך מוסף\n\nשעורי הבית: גליונות במודל, שאלות בסגנון מבחנים, שווה לפתור לבד\n\nהמבחן: קצת קשה משנים עברו אבל ברמה סבירה, ניתן גם פקטור של 5 נק\n\nהשורה התחתונה: אחלה קורס, מפתח מאוד חשיבה הנדסית", "timestamp": 1628924156229}, {"author": "Gal Saias", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מאיר ברנד (הקלטות)\nחוות דעת - הרצאות: מסביר ברור סה\"כ\n\nשם המתרגל/ת: ברוך רופמן (הקלטות)\nחוות דעת - תרגולים: מתרגל טוב מאוד, עושה חזרה במשך חצי תרגול על החומר של ההרצאה, ורק אז פותר\n\nשעורי הבית: לחצי מהם יש רפרנס, מומלץ לעבוד צמוד עם חוברת הנוסחאות\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1635064302423}, {"author": "מתוכן", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מאור ברנד\nחוות דעת - הרצאות: \nבן אדם טוב, רואים שאכפת לו אבל אין יותר מדי בהרצאות\nיש מצגת מפורטת שזאת תכלס ההרצאה.\nשם המתרגל/ת: וידאו - ברוך\nחוות דעת - תרגולים: עדיף להריץ את התרגולים מאשר להיות בכיתה\n\nשעורי הבית: \nגיליון אלקטרוני כל שבוע, לפעמים מאתגר לפעמים לא\nהמבחן: \nהוגן, צריכים להיות חדים על הספר והטריקים שחוזרים על עצמם.\nהשורה התחתונה: \nלפתור כמה שיותר מבחנים", "timestamp": 1668502676952}]}