{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא מובנות \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאינם תורמים לחלק מהפרויקטים, כן לחלק מהם.\nשעורי הבית: \nאין\nהמבחן: \nאין ,יש פרויקט שמחולק לשני חלקים. \nהשורה התחתונה: \nהעומס רק בעת העבודה על הפרויקט\nהציונים גבוהים בסוף", "timestamp": 1598213552442}, {"author": "shahar tsadok", "difficultyRank": 1, "generalRank": 3, "semester": "201901", "text": "שם המרצה: שמואל אוסובסקי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יוליה \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מוזר... לא מספיק מסודר וברור.\nבסופו של דבר לא דורש כמעט השקעה כל הסמסטר. בשבוע עבודה אחד לקראת סוף הסמסטר משלימים את המצגת שצריך להציג ומקבלים ציון טוב ו2.5 נק\"ז מתנה", "timestamp": 1602608532355}, {"author": "Noam Sharoni", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: שמוליק אוסובסקי\nחוות דעת - הרצאות: הועבר בזום- בגדול פרמטרים של חיישנים\n\nשם המתרגל/ת: אדווה הס\nחוות דעת - תרגולים: הנחתה אותנו בפרויקט והיה ממש אחלה\n\nשעורי הבית: אין שיעורי בית, רק שאלות בונוס ופרויקט (2 מצגות)\n\nהמבחן: אין\n\nהשורה התחתונה: ציון גבוה יחסית", "timestamp": 1603258424311}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דורון\nחוות דעת - הרצאות: מעביר בצורה מעניינת סך הכל, אבל החומר המועבר לא קשור בשום צורה לפרויקט ולא מרגיש רלוונטי לתואר בכלל\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: בתור מנחה ממש אחלה\n\nשעורי הבית: \nאין, יש בוחן הרצאה בסוף כל הרצאה. בחנים קלים ונותנים מגן יפה\nהמבחן: \nפרויקט, דורון נותן פרויקט קשה ולא מובן בכלל ובונה על זה שנבוא לשעות הנחיה כדי להבין מה הולך. לדעתי זה קונספט ממש מעצבן ולא הוגן. בנוסף דורון קוטל יחסית בהגנה על הפרויקט בצורה ממש לא סימפטית\nהשורה התחתונה: \nממש ממש לא לקחת אם דורון מעביר, לדחות בסמסטר", "timestamp": 1647536989114}, {"author": "אוסבורן ריינולדס", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שמואל אוסובסקי\nחוות דעת - הרצאות: היו עד אמצע הסמסטר, מיותרות לחלוטין.\n\nשם המתרגל/ת: אסף דנה\nחוות דעת - תרגולים: לא בדיוק תרגולים אלא שעות הנחייה לפרוייקט. אסף היה סבבה, רציני ממש לגביי הקורס והיה ממש קשה להוציא ממנו מידע לגביי הציפיות שלו מהפרוייקט\n\nשעורי הבית:  אין, רק פרוייקט\n\nהמבחן:  אין, רק פרוייקט\n\nהשורה התחתונה: \nיכל להיות קורס ממש מועיל לגביי תכנון ניסויים ובחירת חיישנים מתאימים אבל עשו ממנו צ'יקמוק. בכל מקרה זה קורס חובה אז תסבלו לכם, לפחות הציונים טובים", "timestamp": 1658405985830}, {"author": "האננס", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שמואל אוסובסקי\nחוות דעת - הרצאות: נוכחות חובה, לא רלוונטיות ורק עד אמצע הסמסטר.\nכמעט ולא נלמד כלום בהרצאות ומה שכן נלמד לא הועבר בצורה טובה.\n\nשם המתרגל/ת: טל גולדשטיין\nחוות דעת - תרגולים: לא באמת הועברו תרגולים, היינו צריכים לקבוע שעות ייעוץ על ההגשה של הפרויקט.\nהיתה דיי זריקה מצידו, בקטע טוב, הוא רצה לראות שאנחנו יודעים על מה אנחנו מדברים ועזר מאוד להבין מה רוצים מאיתנו.\n\nשעורי הבית: אין יש רק פרויקט שמחולק לשני חלקים.\n\nהמבחן: אין, אדבר במקום זה על הפרויקט.\nבפרויקט צריך לתכנן, על הנייר, מערכת מדידה לאחד מ4 ניסויים. \nהפרויקט מחולק ל2 חלקים.\nהחלק הראשון: הבנת המערכת, הבנת הפיזיקה ותכנון הדרישות מהחיישנים.\nהחלק השני: בחירת חיישנים לפי הדרישות מהחלק הראשון והסבר קצר על כל החיישן.\n\nהשורה התחתונה: הקורס לא מועבר בצורה טובה.\nכל דבר שאמור ללמד פרקטיקה בפולקטה מועבר או בצורה גרוע ולא מושקעת או בצורה קשה ללא פרופורציה (כן כן פרוייקט תכן לייצור, אני מדברת עליך..)\nלמזלנו הקורס הזה הועבר בצורה הראשונה והפך להיות קורס החרטוטים הגדול. \nדורש מעט מאוד השקעה והרבה יכולת חרטוטים מול קהל.\nסך הכל קורס שמעלה את הממוצע.\nקורס חובה אז לא באמת משנה מה שכתבתי.", "timestamp": 1658654483689}, {"author": "Yaakov L.", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה:  שמואל אוסובסקי\nחוות דעת - הרצאות: שיעמום\n\nשם המתרגל/ת: טל גולדשטיין\nחוות דעת - תרגולים: הכי זורק שראיתי בחיים. אבל זה טוב בקורס הזה\n\nשעורי הבית: הגשה מיותרת \n\nהמבחן: לא היה\n\nהשורה התחתונה: משעמם אבל חובה", "timestamp": 1679392589316}]}