{"posts": [{"author": "yochai heinrich", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ספי ג'בלי\nחוות דעת - הרצאות: מאוד מענינות מעוברות היטב אך לא עוזרות בלפתור את תרגילי הבית\n\nשם המתרגל/ת: עידו ניצן\nחוות דעת - תרגולים: מתרגל טוב מאוד מעביר את החומר בצורה בהירה וברורה\n\nשעורי הבית: עם באמת רוצים להבין את הקורס צריך לפתור אותם ללא רפרנס וללכת לשעות קבלה \n\nהמבחן: עדיין לא עשיתי נקווה לטוב:)\n\nהשורה התחתונה: קורס חשוב מאוד במיוחד למהנדסי מכונות , מצריך השקעה רבה בישביל באמת להבין את החומר, יותר ממה שהזמן מאפשר לנו", "timestamp": 1676091878695}, {"author": "S", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: מהמרצים הטובים שהיו לי עד עכשיו בתואר. מאוד מעניין, מאוד ברור. בונה את התאוריה לאט ובצורה שיטתית ובאמת אפשר להרגיש את השימושים של החומר.\n\nשם המתרגל/ת: אמיל ומאור\nחוות דעת - תרגולים: אמיל הוציא לעצמו שם של מתרגל תותח ובאמת שמגיע לו. סופר מסודר ומתמצא בטירוף בחומר ובקורס. הכיתות שלו מפוצצות ממש ולדעתי הוא לא עד כדי כך שווה את זה.\nמאור אנדרייטד בטירוף, מתרגל כיפי ומצחיק ומלמד ברמה לא פחות טובה מאמיל. פחות מסודר על הלוח.\n\nשעורי הבית: קשים ממש ולוקחים שעות. לא לוותר עליהם כי בלעדיהם אתם אבודים בקורס ולא תבינו כלום.\n\nהמבחן: קשה בטירוף, ספי כותב את המבחן בצורה כזו שכל מבחן שונה וזה מאוד מקשה על הלמידה לקראתו. צריך להבין טוב מאוד את התאוריה וגם להיות מתורגלים כמו שצריך בכל השיטות. גם אם אתם מגיעים מוכנים עדיין יהיה מבחן קשה בטירוף.\n\nהשורה התחתונה: קורס מאוד מעניין ומאוד חשוב להנדסה. מכיל כמות אדירה של תאוריה וטכניקות שצריך לדעת. זה כנראה יהיה הקורס שיעשה לכם הכי הרבה בעיות הסמסטר.", "timestamp": 1676825642626}, {"author": "KS", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: מרצה מעולה מסביר את החומר היטב וברמה גבוהה ניכר שהוא בקיא בתחום ומאד נהנה ללמד את הקורס.\n\nשם המתרגל/ת עידו ניצן וישראל \n\nחוות דעת - תרגולים: \nמדובר במתרגלים הכי טובים בפקולטה בעיני, אצל ישראל התרגולים לא כ\"כ מלאים אז ממולץ ללכת אליו למי שאוהב ללמוד בקבוצות קטנות.\nשעורי הבית: \nיותר קלים ממוצקים 1 בעיני, אבל חלקם לא ברמה של המבחנים של ספי\n\nהמבחן: הוגן ביחס לשנים קודמות(אחמ אחמ 2021) \nהקונספט של מבחן אמריקאי עם דרך הופך אותו למאתגר יותר\n\nהשורה התחתונה: קורס הנדסי סופר חשוב ומעניין חשוב להיות על הקורס כל הסמסטר! לפתור את כל תרגילי הבית ולא להשאיר חורים בנושאים מסוימים, שעות הקבלה די ריקות אז תנצלו אותם.", "timestamp": 1677601341526}, {"author": "student", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: יודע את החומר, אחד המרצים הטובים שיצא לי לראות. עם זאת, מאוד מקפיד על הפסקות קצרות, וכאשר יש 4 שעות הרצאה רצופה, המח פשוט לא קולט בשעה האחרונה.\n\nשם המתרגל/ת: אמיל פרונטלי ומוקלט\nחוות דעת - תרגולים: מתרגל ממש טוב וממש אכפת לו שהסטודנטים יבינו. הפרונטלי והמוקלט די אותו דבר.\n\nשעורי הבית: לי הם היו קשים מאוד מאוד. המון המון מספרים וחישובים ופשוט טבעתי בכל הבלאגן הזה. יש סעיפים שלא הצלחתי לפתור בלי להציב באקסל, אפילו עם רפרנס. נורא.\n\nהמבחן: המבחנים של ספי לא באים להכשיל, אבל הם דורשים ראש פתוח והבנה מעמיקה בחומר. בעיקר חשוב לא לקבל שוק מהשאלות המוזרות שהוא נוטה לתת. ניהול הזמן חשוב, ועדיף לעבור על כמה שיותר סעיפים - חלקם סעיפי מתנה וחבל לפספס אותם רק כי הם היו בסוף.\n\nהשורה התחתונה: קשה אבל שווה. מעדיף קורסים כאלה על פני זבל כמו נומרית.", "timestamp": 1680605826573}, {"author": "Nadav", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: מרצה מאוד מעניין, יש לו כמות עצומה של ידע לתת, ממליץ כן להגיע להרצאות ולא רק לראות מוקלטים אבל בכללי הדרך שבה הוא מלמד היא מצויינת. לא מגמגם, לא מתלבט, יודע לשלוף דוגמאות מצויינות מהמותן לשאלות וגם מכיר באיזה נקודות בחומר הסטודנטים מתקשים ולכן מתמקד בהם יותר.\n\nהדבר שהכי אהבתי בהרצאות זה היה השאלות שהוא שואל באמצע הרצאה ועושה סוג של תחרות מי הראשון שמגיע לתשובה תוך כמה דקות (זה הכי עזר לי להתפקס כשהייתי מאבד אותו וגם נתן לי אינדיקציה איך אני מבחינת הבנה בחומר +-). \n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: לחלוטין המתרגל הכי טוב בטכניון, ללא ספק המתרגל הכי טוב למוצקים 2. הוא מכיר את החומר פנימה והחוצה, חוזר ומדגיש את הדברים הקריטיים גם להבנה וגם למבחן, נותן מלא טיפים וקיצורי דרך. הוא זריז, מעביר את החומר בלי בלבולי שכל ובלי טעויות מיותרות. \n\nשעורי הבית: לא פשוטים אבל ממש חשובים להבנה, אני אהבתי את הדרך שבה הם בנויים, סעיפים ראשונים מתחילים קל תוך כדי חזרה כללית על הנושא, בהמשך מכניסים שאלות שלפעמים נראות קשות חישובית אבל אם מבינים את השאלה לעומק אפשר לפתור מהר ע\"י כל מיני טריקים וקיצורי דרך. לא הייתי מרפרנס אותם וגם אם כן הייתי ממליץ לחזור עליהם מאוחר יותר ולוודא שאתם מבינים את החומר. \n\nהמבחן: עוד לא היה נקווה שיהיה בסדר, ספי נראה כמו בחור הוגן לא חושב שהוא ינסה לדפוק אותנו בכוונה.\n\nהשורה התחתונה: קורס לא פשוט אך מעניין, נכנסים שלב אחד עמוק יותר ממוצקים 1 אבל בעיקרון יש מלא שימוש בדברים שלמדנו ממוצקים 1 חשוב לחזור טוב על דג\"חים חתכים ומציאת כוחות ומומנטים פנימיים. יש המון שימוש באלגברה לינארית בעיקר טרנספורמציות ע\"ע וו\"ע. לכל מי שמסתבך עם איזשהו קונספט בקורס ממליץ מאוד להיכנס ליוטיוב ולראות סרטון של The efficient engineer על הנושא", "timestamp": 1713449457489}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דן מרדכי\nחוות דעת - הרצאות: מרצה ברמה גבוהה, ניכר שחשוב לו שנבין את החומר, נותן הרבה מאוד פרקטיקה ומחזק אינטואיציה בחומר. בדרך כלל יש אצלו פחות סטודנטים.\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: מאוד חשוב  לו שנבין, הוא ממש מבין איפה הבעיה ואיפה החומר נוגד את האינטואיציה. אחלה גבר\n\nשעורי הבית: חשוב לעשות אותם לבד ולא לרפרנס, ברמה גבוהה\n\nהמבחן: שיהיה בהצלחה להספיק אותו\n\nהשורה התחתונה:", "timestamp": 1715251728322}, {"author": "gil blank", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: ספי מרצה מצויין, הוא מעביר את הקורס הרבה שנים והטיפים שלו באמת שווים זהב.\n\nשם המתרגל/ת: ישראל גבאי\nחוות דעת - תרגולים: ישראל עובד לאט ומסודר.\n\nשעורי הבית: לוקחים 6-10 שעות כל שבוע אבל חייבים כדי להצליח בקורס. שאלות מעניינות\n\nהמבחן: מהמבחנים הקשים שהיו לי בתואר.", "timestamp": 1715343467518}, {"author": "אא", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: ספי פשוט מלך, הבן אדם יודע להושיב אותך 4 שעות ברצף בלי שתרגיש.\n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: אחלה אמיל! נראה שמאוד חשוב לו שכל אחד יבין\n\nשעורי הבית: מתחיל טוב עד איזה גיליון 7 אבל הנושאים האחרונים קשים בצורה יוצאת דופן מה שהופך את הגיליונות האחרונים לקשים מאוד מאוד\n\nהמבחן: \nלא פשוט בכלל בלשון המעטה. הרבה מאוד מסיחים שלא בטוח כמה הם בודקים הבנה או האם אתה לחוץ ומבולבל\nהשורה התחתונה: \nקורס חשוב והרבה מעסיקים מסתכלים עליו. חובה להשקיע כל הסמסטר ולא לעגל פינות", "timestamp": 1715516467583}, {"author": "Oren R", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי\nחוות דעת - הרצאות: ההרצאות קריטיות להצלחה בקורס, וספי מרצה בחסד עליון - לא מגמגם, לא משתהה ותמיד יודע לענות שאלות ולתת דוגמא לכל מקרה שתבקשו. אולי המרצה הכי טוב במכונות.\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: מתרגל מקצועי שמעביר תרגולים באווירה קלילה וכיפית, ויורד עד לניואנסים הכי קטנים. מומלץ בחום\n\nשעורי הבית: קשים מאוד, אבל קרייטיים להצלחה במבחן. לא לעשות את הטעות ולרפרנס.\n\nהמבחן: קשה מאוד, אבל אם מתעכבים על שיעורי הבית בהחלט אפשר לעבור אותו בכבוד", "timestamp": 1715601970782}, {"author": "איתם טננבאום", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי גיבלי\nחוות דעת - הרצאות: \nספי מרצה מעולה, בעל תשוקה עזה למקצוע.\nההרצאות מאוד תיאורטיות ומלאות בהוכחות והדוגמאות הניתנות בהרצאה מאוד קלות ביחס לתרגילים.\nספי כמעט ולא נותן דוגמאות ואלו שכן מאוד קלות כך שכאשר ניגשים לתרגל הפער ברמה ניכר.\n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: \nמאור מתרגל מעולה, מסביר היטב את החומר ומעביר אותו בצורה ברורה כיפית וקלילה, ממליץ עליו מאוד.\n\nשעורי הבית: \nארוכים ועמוסים, ברמה גבוהה מהרבה מהמועבר בשיעור ובתרגול, יש רפרנסים אך ממליץ מאוד לנסות לפתור לבד.\n\nהמבחן: \nהוגן, המבחן בודק את הידע בכל תוכן הקורס, המבחן שואל שאלות על כל הנושאים ומכריח אותך לשלוט בקורס על בוריו.\n\nהשורה התחתונה: \nקורס חשוב מאוד, על כן הוא מאוד עמוס וברמה גבוהה, ממליץ להקדיש לו הרבה זמן ולוודא שליטה תמידית בחומר.", "timestamp": 1715855381113}, {"author": "L", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דן מרדכי\nחוות דעת - הרצאות: \nמובנות מאוד מוסברות היטב\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: \nמתרגל תותח ואלוף,תרגולים מובנים ומוסברים טוב\nשעורי הבית: \nדרוש השקעה\nהמבחן: \nקשוח,אבל דורש ידע טוב על חומר\nהשורה התחתונה: \nצריך לשבת הרבה ימים להתאמן לקראת המבחן ולא קצת ימים", "timestamp": 1715880401317}, {"author": "אייל כהן", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ספי גבלי\nחוות דעת - הרצאות: ספי מדהים, מומלץ להגיע להרצאות למרות האורך, זה מאוד עוזר כי זה קורס שמצריך יותר הבנה ולא רק תרגול. \n\nשם המתרגל/ת: מאור שומינוב\nחוות דעת - תרגולים: מאור המלך !!!\n\nשעורי הבית: קשים, ארוכים, מייגעים, אבל הכרחיים. שווה לנסות לפתור פעם אחת מההתתלה עד הסוף לבד לחלוטין בלי רפרנס או אקסל או חבר, ובמידת האפשר לחזור על התרגילים של התרגול ולהתנסות בהם לפני שפותרים את הש\"ב, זה ממש ממש עוזר וחוסך זמן.\n\nהמבחן: אי אפשר לסיים אותו, תנסו לבחור נכון את הסעיפים לפי נושאים, יש סעיפים מתנה ויש סעיפים שיכולים לקחת שעה ויש סעיפים שלו תצליחו לפתור אם לא זוכרים את כל ההרצאות בעל פה, אז צריך לדעת לדלג, או לנחש חכם.\n\nהשורה התחתונה: קורס מאוד חשוב, שמסתכלים על הציון שלו בראיון עבודה ראשון, שווה לשים אותו בראש סדר העדיפויות שלכם.", "timestamp": 1716477425770}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דן מרדכי\nחוות דעת - הרצאות: אחד המרצים הכי טובים שהיו לי עד עכשיו בלימודים\n\nשם המתרגל/ת: מאור \nחוות דעת - תרגולים: מתרגל מקצועי, ממש חשוב לו שנבין, הוא יודע להסביר ממש טוב. לא מתעכב על שטויות ומצד שני ממש מתעכב על העיקר - לא ימשיך עד שכולם מבינים\n\nשעורי הבית: ממש חשוב לעשות אותם לבד ולא לרפרנס\n\nהמבחן: הוגן מאוד, אבל מרוץ נגד הזמן\n\nהשורה התחתונה:", "timestamp": 1716714027984}, {"author": "שםם", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: ספי\nמעולה\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: \nמאור אלוף, המתרגל הכי ברור וחד שיש. \n\nשעורי הבית: מלא שיעורים, אם עושים אותם בלי רפרנסים אז גם מבינים את החומר\nמומלץ להשקיע ממש\n\nהמבחן: \nמבחן קשה, אין זמן להספיק את כולו.\nשאלות אמריקאיות\nכביכול אפשר לסמן ו' אם לא יודעים את התשובה ואז לקבל 15% מהניקוד, סטטיסטית יותר משתלם לנחש. הם טוענים שהם בודקים אבל לא נראה שהם בודקים. \nבכללי ספי לא מפרסם מבחנים מהשנים האחרונות, אפשר לבוא לפתיחת מחברות וגם אז אסור לצלם את הבחינה או לרשום אותה. הם גם לא אומרים מה התשובות הנכונות, פשוט מצפים שנפתור את הבחינה מחדש בזמן שאנחנו שם. זה פשוט התעללות שאי אפשר להתחמק ממנה. תעברו מועד א עם ציון טוב רק בשביל לא לעבור את הפתיחת מחברות שלהם. \n\nהשורה התחתונה: \nהם מושלמים עד פתיחת מחברות. \nזה קורס חובה\nוהצוות איכותי \nאין לכם ברירה", "timestamp": 1717361253919}]}