{"posts": [{"author": "Yaakov L.", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי גולדווין\nחוות דעת - הרצאות: מעביר את ההרצאות בצורה מרתקת. באתי עם ציפיות נמוכות מאוד לקורס הזה (נרשמתי מחוסר ברירה של אילוצי מערכת) והופתעתי לטובה. נהנתי מאוד מההרצאות\n\nשם המתרגל/ת:  דניס בונטין\nחוות דעת - תרגולים: מסביר טוב מאוד ושולט בחומר. אבל נוהג קצת להאריך בהסברים שלו. מעבר לזה מתרגל מעולה\n\nשעורי הבית: יש פרויקט שצריך להגיש עבודה של 15 עמודים וכן להרצות עליו בכיתה. לוקח זמן אבל מעניין ומלמד מאוד לפי דעתי. יש חופש בחירה גדול מאוד בנושא הפרויקט\n\nהמבחן: לא קשה לא קל\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1677795867853}, {"author": "Otto", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה:  גדעון (גידי) \nחוות דעת - הרצאות:  ההרצאות היו מצויינות, גידי ממש מעניין, רק חבל שבסוף המבחן תאם להרצאות עבר של ליאוניד וייתר את ההרצאות בצורה משמעותית...\n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים:  מרבה להתעסק בתפל... במקום להעמיק בתכני הקורס השקיע יותר מדי זמן בלהראות איך עושים צימצום שברים...\n\nשעורי הבית:  לא חובה\n\nהמבחן: הוגן, החומר לא מסובך לכן היה יחסית פשוט ללמוד אליו למרות שנדרשה הרבה למידה עצמית... חלק גדול מדי של שאלות נכון לא נכון שדואג להוריד את הממוצע יפה יפה\n\nהשורה התחתונה: קורס לא כזה מעניין, למרות שחבר'ה שאוהבים מנועים נראו יותר מתלהבים... בכל אופן זה סוג של חובה במגמת אנרגיה אז אין הרבה אפשרויות אחרות, הרע במיעוטו", "timestamp": 1679605393382}, {"author": "Hey Wood", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "הציון מורכב ממבחן 55%, עבודה סמינריונית והצגת העבודה מול הכיתה בשני השיעורים האחרונים\n\nשם המרצה: טרטקובסקי\nחוות דעת - הרצאות: בתרמו ממש לא התחברתי והיה לי קשה מאוד להבין את ההרצאות אבל בקורס הזה החומר יותר מעשי ופחות תיאורטי והיה סבבה. ליאוניד ממש חברותי ולא מתנשא והיינו קבוצה קטנה אז הוא היה מתעכב אם חלק לא הבינו גם אם לא היו שאלות. בנוסף שוחררו הקלטות מסמסטר הכתר בגלל המילואים אבל היו פתוחות לכולם ובכל זאת העדפתי להגיע להרצאה כי הנושאים היו מעניינים.\n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: בחצי הראשון של הסמסטר התרגולים חשובים כי ההרצאות היו איכותיות בלבד והיה צורך לחבר את את החומר בחישובים. החל ממידול מנוע וחישוב מחזורים החומר בהרצאה ובתרגול היו כמעט זהים.\nבכל מקרה שעה אחת לא הספיקה לאף אחד מהתרגולים ודניס היה ממש לחוץ להספיק אז רוב התרגולים הרגישו על מהירות 1.5 והיה קשה מאוד להשחיל שאלות במידת הצורך. מנגד בתרגולים המוקלטים (יותר משעה) הקצב היה טוב והיה נוח ללמוד מהם.\n\nשעורי הבית: לא הייתה חובת הגשה אז לא הספקתי להגיע אליהם עד ללמידה למבחן. יש שם שאלות שלא ברור מאיפה להתחיל לפתור והקשר ביניהן לבין המבחן מקרי בהחלט.\n\nהמבחן: המבחן לא קשה ולא מפתיע אבל דורש למידה והבנה של החומר. יש שאלה של מידול מחזור יניקה-דחיסת תערובת בלתי שרופה-שריפה בנפח קבוע-התפשטות תערובת שרופה-פליטה בטבלא בדומה לתרמו; עוד שאלה פתוחה בדרך כלל של גיאומטרית מנוע, חישוב נצילות\\לחץ אפטיבי וכו ועוד ים שאלות כן\\לא (בערך שליש מהנקודות) של דברים שנאמרו במהלך ההרצאות ו\\או בהצגת העבודות של הסטודנטים - לדוגמא:'למנוע רוטורי הספק סגולי גדול יותר ממנוע 4 בוכנות 4 פעמיות'.\n\nהשורה התחתונה: קורס מאוד מעניין למי שמתעניין במנועים (בגלל זה הלכנו ללמוד הנדסת מכונות, לא?) שמועבר על ידי סגל עם המון ידע ונסיון מחקר בנושא. הקורס עמוס בשביל 2.5 נקודות והשקעתי בו הרבה יותר זמן מקורס 3 נקודות שלקחתי באותו הסמסטר ואם יוסיפו הגשת שיעורי בית אז בכלל יהיה עמוס.", "timestamp": 1717053680355}]}