{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: מרצה טוב. מדברים על כל מיני נושאים בהנדסת מכונות על קצה המזלג. הרצאות לא ממש חשובות לקורס. אך כן, חשוב להיות נוכח בהם. זה אמנם רשום כשלוש שעות במערכת, אך הרבה פעמים, אצלנו זה נגמר לפני הזמן. ויש פעמים שלא מגיעים בכלל\n\nשעורי הבית: אין. יש רק שלושה פרויקטים קטנים (בניית מתקנים שעושים כל מיני פעולות) שצריך לעשות במהלך הסמסטר+ הכנת מצגת (עבודה בקבוצות של 5-6). להשקיע בהתאם כי זה הציונים של הקורס אבל לא להישאב לזה יותר מדי (זה שואב זמן!). הציונים ינועו גם ככה בין 85-95\n\nהמבחן: אין.\n\nהשורה התחתונה: קורס נחמד עם ציונים גבוהים. יכול להיות עמוס אם מגזימים ונשאבים לזה. בסך הכול מומלץ.", "timestamp": 1597860786885}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: דוד \nחוות דעת - הרצאות: מרצה נחמד מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן:  אין\n\nהשורה התחתונה:", "timestamp": 1598347086874}, {"author": "Idan W", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: \nההרצאות מרתקות ונותנות רקע על הנדסה בכללי ועל הנדסת מכונות בפרט. ההסברים הם בשפה פשוטה. מטרת הקורס היא לפתח חשיבה מחוץ לקופסא כדי להתמודד עם אתגרים הנדסיים ביצירתיות, בשונה משאר הקורסים שבהם לומדים מיומנויות טכניות.\nשם המתרגל/ת: לר\nחוות דעת - תרגולים: \nאין תרגולים פרונטלים, אפשר לבוא למתרגלים לעזרה בפרויקטים\nשעורי הבית: \nיש 3-4 פרויקטים של אתגרים הנדסיים, שלאחר מכן מתחרים בכיתה והקבוצה עם הביצועים הטובים ביותר מנצחת. על כל פרויקט רושמים דוח מפורט.\nהמבחן: \nאין מבחן, יש פרויקטים תחרותיים\nהשורה התחתונה: \n\nאל תקחו את הקורס הזה בשביל לקבל ציון גבוה בלי רצון להשקיע עבודה, כי סתם תסבלו ממנו ותגרמו לשאר חברי הקבוצה שלכם לסבול. הקורס דורש הרבה שעות מעבר לשעות הפרונטליות כדי לעבוד על הפרויקטים עם הקבוצה.", "timestamp": 1598356571790}, {"author": "...", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: \nההרצאות מביאות רקע הנדסי כללי בעקרונות מכאניים, לרוב לפי נושאים שדוד קובע מראש, ולפעמים גם בעקבות בקשות מהסטודנטים, הנוכחות חובה (גם בסמסטר קורונה), אך עדיין מעשירה, כאשר חשוב לציין שאין קשר ישיר בין ההרצאות לבין הפרוייקטים והדוח\"ות (שהם הציון בפועל)\n\nשעורי הבית: \n3/4 פרוייקטים, ומצגת בקבוצה\n\nהמבחן: \nאין, יש דוחות ופרוייקטים, הממוצע לרוב בסביבות 91\nהשורה התחתונה: \nאחלה קורס, חשוב לא להקדיש יתר על המידה זמן על הפרויקטים, הם יכולים להיות מאוד מעמיסים לפעמים, ולשבת באופן רציני על הדוח\"ות.", "timestamp": 1612895988842}, {"author": "YR", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: ההרצאות הן בעיקר על ההיסטוריה של הנדסה וכל מני מערכות ותופעות שמתחשק לדוד לדבר עליהן. אין חומר מסודר ולא חייבים לזכור את מה שנאמר בהרצאות אבל שווה להקשיב בכל מקרה כי הנושאים רוב הזמן מעניינים.\n\nשעורי הבית: יש 5 פרוייקטים להגשה בקורס. בתחילת השנה מתחלקים לקבוצות של ארבע וכל קבוצה מקבלת ניקוד משותף על כל הפרוייקטים. 3 מהפרוייקטים הם מכשירים שהקבוצה צריכה לבנות שמקבלים ניקוד ביחס לפרוייקטים של קבוצות אחרות. ישנה גם עבודה להגשה על מכשיר טכנולוגי שיפורק בכיתה, ובסוף שנה צריך להרצות במשך עשר דקות על נושא טכנולוגי כלשהו.\n\nהמבחן: אין. הציון מורכב מציוני הפרוייקטים.\n\nהשורה התחתונה: אחלה קורס, מהנה מאוד, אבל הפרוייקטים דורשים המון השקעה.", "timestamp": 1644220698965}, {"author": "המלך", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: הרצאות חובה כל שבוע, בערך שעה וחצי.\n3 פעמים בסמסטר מתכנסים לביצוע ניסוי עם התכנים שנבנו, ממש מצחיק. פלוס עוד מעבדה, דויד נוטה לחרוג מהחומר, אבל מאוד מעניין ופותח את הראש.\n\nשם המתרגל/ת: אין\n\nשעורי הבית: בניית פרויקטים 3 פעמים בסנסטר, תמיד לחוץ לקראת ההגשה.\n\nהמבחן: אין, יש פרויקטים במהלך הסמסטר.\n\nהשורה התחתונה: ברקיסט אז הייתי חייב לקחת,אבל מומלץ בחום.", "timestamp": 1680165944933}, {"author": "אורי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דוד אילתה \nחוות דעת - הרצאות:  היה קורס של ברקיסטים בלבד עד לא מזמן, פתוח לכל מי שמצליח לתפוס מקום עכשיו. \nדוד מדבר בכלליות על המון נושאים כללים או מאוד ספציפיים בהנדסה מכאנית, יכול להיות סופר מעניין או משעמם/ חופר לחלק מהאנשים.\nמתחלקים לקבוצות של 5 בהם עושים את כל העבודות בקורס, אז שימו לב עם מי אתם וכמה זמן ומאמץ אתם משקיעים, זה יכול להפוך את הקורס לממש סבבה או לסיוט.\n \n\nשם המתרגל/ת:  דוד/ סאלמן\nחוות דעת - תרגולים: \nלא באמת קיימים, זה עוד שעה בשביל שדוד ימשיך ימשיך את ההרצאה/ הצגה של פרויקטים.\nתמיד זמינים במייל או במשרד שלהם לשאלות לגבי הפרוייקטים.\n\nשעורי הבית: \nיש מעבדה אחת באמצע הסמסטר, מצגת בסוף, ועוד 5 פרויקטים במהלך הסמסטר. יכול לאכול הרבה זמן. \n\n\nהמבחן:  אין.\n\nהשורה התחתונה: קורס קל ומעניין יחסית, קל מאוד להוציא ציון ממש גבוה. רק לשים לב שהוא יכול לאכול הרבה זמן. למי שמתכוון לקחת פיזיקה 1 אולי פחות מומלץ, אבל אפשרי (אישית לקחתי במקביל 1מ)", "timestamp": 1714556256014}]}