{"posts": [{"author": "~~", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ראובן כץ\nחוות דעת - הרצאות: \nהרצאות לרוב מעניינות ורלוונטיות מאד לעבודה. נוכחות חובה אז אין בררה.\nשם המתרגל/ת: עומרי קאופמן\nחוות דעת - תרגולים: \nהתרגולים חשובים אבל לא תמיד היו מעניינים למרות שהמתרגל התאמץ לעשות אותם מעניינים.\nשעורי הבית: \nיש שלושה גיליונות לאורך הסמסטר, לא קשים מידי.\nהמבחן: \nאין. יש שלושה פרויקטים במקום. הפרויקטים יחסית עמוסים אבל מלמדים.\nהשורה התחתונה: אחד הקורסים הטובים שלקחתי בתואר, מאגד בתוכו הרבה חומר שנלמד לאורך התואר ומקשר אותו לעבודת התכן.", "timestamp": 1625988722531}, {"author": "מיקי מלמוד", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nחובה, ראובן לא בודק אבל נכנס במי שהוא לא מכיר לו את הפנים או השם\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n3 פרויקטים לאורך הסמסטר, מעניינים אבל דורשים קצת זמן\nהמבחן: \nאין\nהשורה התחתונה: \nאחלה קורס, מומלץ", "timestamp": 1626005930993}, {"author": "לא מגלה", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ראובן כץ\nחוות דעת - הרצאות:  מבקש נוכחות חובה, מבקש להקריא באנגלית, לא תמיד הבנאדם הכי נחמד. מבחינת חומר ההרצאות היה מאוד מעניין אחלה קורס לסמסטר אחרון, כי הוא סוגר הרבה פערי ידע שצוברים במהלך הלימודים ומכין את הסטודנטים לתעשייה.\n\nשעורי הבית: שעורי הבית לא קשים מידי והציונים עליהם לרוב טובים.\n\nפרויקטים:  הפרויקטים לא קלים בכלל ועמוסים מאוד, הציונים בהם לא כל כך גבוהים והם חלק גדול מהציון הסופי.\n\nהשורה התחתונה: ממליץ למי שמתעניין להמשיך בתעשייה כמתכנן מכאני.", "timestamp": 1635080602351}, {"author": "המשמיד", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ראובן כץ\nחוות דעת - הרצאות: ראובן אדם מיוחד ולא ארחיב יותר.\n\nשם המתרגל/ת: אוהד לוי\nחוות דעת - תרגולים:  מתרגל חמוד, התרגולים בקורס לא הכי נחוצים בתכלס. לא הייתה לו בעיה לדחות הגשות ומאוד שיתף איתנו פעולה.\n\nשעורי הבית: שלושה גיליונות, דיי פשוטים שלא מבזבזים יותר מדיי זמן והם 20 אחוז. אז זה אחלה ממש.\n\nהפרוייקטים: בקורס יש שלושה פרוייקטי תכן שערכם סה\"כ 80 אחוז. הם באמת שמנים ודורשים הרבה זמן ועוסקים בתכן. עם זאת, חלק מהקורס קיבל ציונים סבהה/טובים וחלק פחות, כתלות בטיב התכן שנעשה.\n\nהשורה התחתונה: מומלץ רק למשוגעים שרוצים לעשות תכן כי הקורס נותן כאפה רצינית בתחום.", "timestamp": 1679465536508}]}