{"posts": [{"author": "בן", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות:  בוריס הוא אדם טוב שרוצה לעזור לסטודנטים. הרצאות 3 שעות, ותירגול שעה. השיעורים הם בעצם בוריס שמסביר את המצגות הענקיות (מצגות באנגלית, אבל ברור שהוא מדבר עברית). אפשר לראות שהוא מתכוון לטוב, אבל קשה להישאר מרוכז. בגדול ההרתאות מעניינים אבל אין צורך להגיע\n\nשם המתרגל/ת:  אילן\nחוות דעת - תרגולים:  בניגוד לבוריס, נראה היה שאילן רצה שניכשל בקורס. מאוד קפדן בבדיקת שיעורי בית (שהיה אצלנו בערך 25% מהציון, והוא נתן ציונים נמוכים בשנות ה-80 בלי לחשוב פעמיים). לתירגולים יש מצגות בעברית שמסבירות היטב את החומר, אילן לא ידע על מה הוא מדבר ותלמידים לא פעם תיקנו אותו. כמו שיעורים, אין צורך להגיע לתירגולים, קריאת המצגות בלבד מספיקה\n\nשעורי הבית: קל יחסית, אבל אילן עשה בדיקה אבסורדית ומעולם לא הבנו את המשוב שלו ואיפה באמת טעינו. באחת הגיליות אני וחבר שלחנו 95% את אותו הקובץ. הוא קיבל 90, אני קיבלתי 75. תרגיל בית בזוגות, ובערך 5/6 גיליונות על הסמסטר\n\nפרויקט:  פרוייקט על כל נושא הקשור לכל נושא שקשור באופן מינימלי לאנרגיה מתחדשת (הם נותנים רשימה של נושאים מוצעים אבל אתה יכול ליצור משלך).  קל, וזה לא דורש כל כך הרבה. יש דוח ובסוף הסמסטר מצגת זום עם בוריס והמתרגל. ציוני הפרויקט שקלו את הכבד ביותר בציון הקורס הסופי, וציוניו היו טובים. הפרויקט גם בזוגות\n\n\nהמבחן: חומר פתוח עם מחשב. 70% שאלות חישובים ו-30% שאלות תיאוריה. השאלות של חישוביים הן אותו הדבר בכל שנה אז קלות ב-70%. החלק התיאורטי היה קשה מאוד ולא פרופורציונלי לקורס. אבל בסופו של דבר, ציוני המבחנים היו טובים שכן בוריס עשה בדיקת קלה. 2/3 ימי לימוד ואתה יכול להצליח במבחן\n\nהשורה התחתונה: קורס מעניין וקל מאוד. אפשר לדלג על כל הרצאות ותרגול ולעבור בציון טוב מאוד. החלק המאכזב היה שהציונים יכלו להיות אפילו הרבה יותר טובים אם מתרגל לא היה בעצם מפשל את ציוני שיעורי הבית שלנו. קורס מומלץ", "timestamp": 1688544073185}, {"author": "מחדש האנרגיה", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: \nוואו וואו וואוווו \nהרצאות קשות לשמיעה, איטי ,מסורבל ומשעמם\nחומר מעניין מאוד אם הייתי לומד לבד, אבל הרצאה משמימה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש פרויקט שהוא קצת סיוט, אבל ברוב המקצועות מהרשימה יש פרויקט אז לא ממש משנה\nהמבחן: \n\nהשורה התחתונה: \nקצת מוזר שזה הקורס היחיד לאנרגיות מתחדשות שיש בפקולטה", "timestamp": 1689283110531}, {"author": "VSD", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: \nבפועל יש 3-3.5 שעות הרצאה. ההרצאה קשה, בוריס יושב רוב הזמן ונראה לפעמים שהוא מרדים אפילו את עצמו.\nבגדול הוא מקריא מהמצגת אבל המצגות הן שיבוב מידע עצום והרבה שקופיות לא רלוונטיות\\באנגלית\\מלאות מלל מיותר כך שגם ללמוד לבד לא מתאפשר.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: היה במילואים בשבועות הראשונים אז בוריס העביר תרגולים ושיעורי בית (והיה זוועה). כשאופק היה היה סבבה.\n\nשעורי הבית: \nאחרי הראשונים שבוריס המציא שאלות לא פתירות, נתנו את הגליונות משנה שעברה אז היה רפרנס בדרייב. היו סבירים ביותר ואפילו מלמדים. סכ\"ה היו 6 גליונות. 25%\nיש גם עבודה 35% בנושא אנרגיות מתחדשות שלא נלמדו בכיתה שצריך ללשלוח לבוריס במייל לאישור אבל הוא לא עונה אף פעם. ההנחיות לא היו ברורות וגם תאריך ההגשה וההצגה לא היה מוגדר כמו שצריך. \n\nהמבחן: \nלא היה יותר מידי קשר בין המבחן לבין החומר שהועבר. יש מאגר של כמה שאלות שבוריס ממחזר ממנו שאלות מקסימום עם נתונים קצת שונים, והמבחן עם חומר פתוח בלפטופ (כולל תרגילים פתורים). אבל בהצלחה עם זה כי התרגילים לא עוברים הגהה ואפשר להבין אותם בכמה דרכים. גם אין שעות קבלה לקראת המבחן והתשובות במבחן לא חד- משמעיות - נראה לי שהורידו לי נקודות על תשובה שרשמתי לפי ההערה שנרשמה לי בתרגיל בית. בכל מקרה אין איך לדעת כי לא היו סריקות ולא היו פתיחת מחברות ואין עם מי לדבר. אגב, הציונים הסופיים על בסיס מועד א הגיעו לגריידס רק בשבוע 4 של הסמסטר הבא.\n\nהשורה התחתונה: הקורס אמור להיות 4 נקודות לפי יחס הרצאות-תרגולים שלו אבל חוץ מהעבודה הוא לא ממש עמוס גם לקורס של 3.\n\nהנושאים בקורס מאוד מעניינים וחשובים והקורס יכול להיות מועבר הרבה יותר טוב. חבל שהוא ממש לא מוצלח במתכונת הנוכחית.\nאלא אם כן יש לכם הרבה זמן פנוי בסמסטר, הרבה סבלנות והמון קפה, עדיף לקחת קורס אחר כל עוד בוריס מעביר.", "timestamp": 1722098769723}]}