{"posts": [{"author": "פיזיואלקטרי", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אילתה\nחוות דעת - הרצאות:  משעממות ,לא תורמות יותר מדי , הוא אוהב לדבר והוא די משעמם ומונוטוני.\n\nשם המתרגל/ת:  דוד רוזנשטוק\nחוות דעת - תרגולים:  מתרגל חביב , מעביר את התרגולים סבבה וסוגר את הפינה\n\nשעורי הבית: כל שבוע גליון אבל זה עוזר להיות על החומר, בסוף 2/3 מהמבחן זה שאלות מהגליונות. יש רפרנסים.\n\nהמבחן: המבחן בעקרון ממוחזר משנה לשנה, מבנה המבחן הוא בין 85-90 אחוז שאלות לפתרון המזכירות מאוד את השאלות מההרצאות / תרגולים/ גליונות ועוד שאלה נוספת על חומר ממאמרים שהוא מפרסם בתחילת הסמסטר וצריך ללמוד אותם. בסה\"כ מאוד עקבי. ספציפית מועד א' היה הוגן, 2 שאלות ממוחזרות מהתרגול ומגליון שיעורי בית. עוד שאלה מהמאמר שהופיעה בשחזור עבר ועוד שאלה על פיזואלקטרים די מסריחה כי הייתה תאורטית. בדיעבד 3-4 ימים מספיקים ללמוד למבחן.\n\nהשורה התחתונה: קורס גדול יחסית, לא יותר מדי עמוס, די משעמם אבל סוגר את הפינה של בחירה במגמה (ברבדים). אם אין באמת צורך לא כדאי לקחת, באמת אחד הקורסים הכי משעממים שלקחתי בתואר.", "timestamp": 1675350547909}, {"author": ":)", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: לדוד יש תשוקה לעולם ה-MEMS וזה ניכר עליו בהרצאות ובדרך שבה החומר מועבר. ההרצאות מעניינות ונותנות סקירה רחבה בתחום.\n יש מספר נקודות חשובות במהלך ההרצאות  שכדאי לשים אליהן לב, ודוד מדגיש אותן. מזמין ופתוח לשאלות.\n\nשם המתרגל/ת: דוד רוזנשטוק\nחוות דעת - תרגולים: מתרגל מאוד נחמד ומעביר את התרגולים בצורה מאוד קלילה.\n\nשעורי הבית: כל שבוע בערך יש גליון. לא קשה במיוחד אם כי דורש השקעה ומחשבה.\n\nהמבחן: יש בוחן אמצע ויש מבחן. השאלות מאוד ישירות ובוחנות בעיקר אם הקשבתם בהרצאות ובתרגולים והכנתם את שיעורי הבית. ממליץ לשאול את דוד בסוף כל הרצאה על הייחוד של האקטואטור/המאמר כי תמיד יש שאלה בנוגע לאחד מהמאמרים שהוצגו שחוזרת על עצמה.  \n\nהשורה התחתונה: מומלץ מאוד ומשתלם מאוד ל-3.5 נקודות", "timestamp": 1704701701608}, {"author": "close loop", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דוד אילתה\nחוות דעת - הרצאות: הרצאות מעניינות- ללא ספק חשיפה לעולם הMEMS, אך עם זאת שהקורס מתקדם ומציג קונספטים חדשים הוא אינו קשה מידי, כנראה בגלל שדוד מקפיד להסביר הכל לעומק ובצורה ברורה ונעימה. הקורס מועבר בצורה משפחתית ומצומצמת ככה שדוד יכול לתת יחס אישי לכל הסטודנטים, להסביר אותם קונספטים שוב בדרכים שונות למי שלא הבין, ובאופן כללי אווירה מאוד חיובית.\n\nשם המתרגל/ת: דוד רוזנשטוק\nחוות דעת - תרגולים: רוזנשטוק הוא אגדה בקורס, יכול להעביר תרגול מלא ברבע שעה, והוא יודע הכל! בכל נושא! בסופו של דבר התרגולים די עוזרים בעיקר בשיעורים שבהם הדברים לפעמים מופשטים או תיאורטים\n\nשעורי הבית: בדרך כלל קלילים עם תרגיל דומה ממה שנעשה בכיתה בהרצאה או בתרגול וצריך לשחזר את הטכניקות והידע שנלמד\n\nהמבחן: דומה באופי לשיעורי בית, לא קשה מידי, כן היה צריך להכיר את המאמרים שלמדנו במהלך השנה אבל ממש בקטנה. לא מבחן מפחיד ובאופן כללי לדוד לא אכפת כל כך מלחלק ציונים גבוהים לכולם, העיקר שנהנו בקורס.\n\nהשורה התחתונה:  ממליץ ממליץ ממליץ", "timestamp": 1713331711773}]}