{"posts": [{"author": "shahar tsadok", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: איטיות נורא. אבל מובנות ותורמות להצלחה בקורס\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: המצגות של התרגולים סוגרות פינה. נותן סיכום מעולה לקורס\n\nשעורי הבית: לא הרבה גליונות. תרגילים די פשוטים\n\nהמבחן: מתאים בול למה שנלמד בקורס. אין הפתעות. וחומר פתוח כך שיש סיכומים שממש סוגרים את כל הפינות שצריך\n\nהשורה התחתונה: יש גם פרויקטון בקורס שלוקח די הרבה זמן.\nאבל בסך הכל קורס מעניין עם לא הרבה חומר לימוד אז די פשוט לעבור אותו בציון גבוה.\nבגלל הפרויקטון דורש השקעה אבל הוא לא קשה", "timestamp": 1602608418744}, {"author": "amit", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: איילון רימון\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עמית פרגוזין\nחוות דעת - תרגולים: מסביר טוב , תמיד עונה ומקדיש הרבה לסטודנטים\n\nשעורי הבית: קלילים\n\nהמבחן: מועד א' סבבה מועד ב' עם יותר חומר \n\nהשורה התחתונה: הדבר היחיד המעיק זה הפרויקטון - קשה וצריך להשקיע בו מלא זמן.", "timestamp": 1614248710700}, {"author": "האננס", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אילון רימון\nחוות דעת - הרצאות: מיותרות.\nיש בדרייב סיכום (תמלול) של ההרצאות שלו ויאמר לזכות אילון שהוא המרצה הכי עקבי שקיים בתואר הזה ברמה שהשוני היחיד בין הסיכום להרצאות זה התאריך.\n\n\nשם המתרגל/ת: עמית פריגוזין\nחוות דעת - תרגולים: מתרגל מעולה, עובר על התרגולים בצורה מסודרת וברורה.\nהמצגות מעולות וסוגרות את כל החמור שצריך לדעת.\n\nשעורי הבית: תרגילים מאוד דומים לתרגולים, עושים חזרה טובה על החומר.\n\nכיאה לחיימון לימון יש פרויקטון שנפתח בשבוע 12 והוא להגשה חודש אחרי תקופת מבחנים (כן כן, תגידו ביי לטיסה לאיטליה בקרוב). \nהפרויקטון לא פשוט ודורש הבנה של החומר, לוקח הרבה זמן וכמובן שיש הגנה בסופו. (ההגנה לקראת סוף אוגוסט אז קחו בחשבון)\n\nהמבחן: לא קשה במיוחד, במועד א' יש 4 שאלות, 3 השאלות הראשונות שוות 30% ועוד שאלה 4 של 10% על מנת לייצר פקטור שלילי (בכל זאת צריך לתת קרדיט לעקביות של אילון). \nהמבחן עם חומר פתוח אבל מודפס.\n\nהשורה התחתונה: קורס נחמד ,קליל ומעניין מאוד שלא דורש הרבה השקעה ועם ציונים יחסית גבוהים ביחס לקורס חבה במגמה. (אהמ אהמ בקרה וחיישנים)", "timestamp": 1672063684346}]}