{"posts": [{"author": "Adi", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דורון קלפץ\nחוות דעת - הרצאות: לא הלכתי. לאחר צפייה בהקלטות נראה שזה לא תורם במיוחד, אולם במבחן הסופי היו כמה שאלות תיאורטיות שההרצאות כנראה היו מועילות במענה עליהן.\n\nשם המתרגל/ת: פיטר ברייטמן\nחוות דעת - תרגולים: מתרגל מעולה! החומר לא כזה פשוט ודורש הבנה ותרגול רב. חשוב ללכת לתרגולים ולראות שמבינים את כל העקרונות.\n\nשעורי הבית: גיליונות מוקלדים עמוסים, עוזר להבין את החומר אבל דורש הרבה עבודה והשקעה.\n\nהמבחן: מבנה ידוע מראש, כמה שאלות ארוכות ועוד כמה שאלות קצרות. השאלות מאתגרות אבל עם הרבה תרגול אפשר להצליח ולקבל ציון יפה.\n\nהשורה התחתונה: עם השקעה ועשיית שיעורי בית אפשר להצליח יפה בקורס. אני ממליצה על הקורס הזה ביחס לאפשרויות האחרות הקיימות במקבץ של מגמת אנרגיה.", "timestamp": 1617521773531}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דורון קלפץ'\nחוות דעת - הרצאות: לא הלכתי כי התנגש לי עם קורס אחר. לקראת הבחינה בשעת קבלה עם דורון גיליתי שהוא אדם מאוד נחמד והיה נראה שאכפת לו מהסטודנטים והוראה בקורס, אז מרגיש לי שפספסתי.\n\nשם המתרגל/ת: מוקלטים וסיוון לוי\nחוות דעת - תרגולים: מזל שהיו מוקלטים (נינה ונועם לוי), מכסים כמעט הכול ודי מסודרים. סיוון מתרגל טוב אבל מתעכב יותר מידי על התפל (רקע תיאורטי מקורסים קודמים והסברים על נושאים שהם לא התרגול) ופחות על העיקר - הבנה של שיטת הפתרון ונקודות חשובות בחומר: שגיאות, בנייה של מטריצה גלובלית, בניית הפתרון ע\"י פונקציות הבסיס לאחר מציאת הערכים בצמתים. הרגיש שלא הושם דגש חזק בנושאים האלה. במבט לאחור היה ניתן פשוט לקרוא אותם ולהבין אבל לא ממליץ על זה.\n\nשעורי הבית: 5 גליונות עמוסים כאשר האחרון לא חובה להגשה, המטלב קשוח. \n\nהמבחן: ארוך וקשה. מצריך הכנה קפדנית והבנה עמוקה של הטכניקה ושל החומר והרציונאל שבדרך הפתרון כדי להצליח בו. יש גם שאלות ידע כללי שקל מאוד לענות עליהן אם הולכים להרצאות.\n\nהשורה התחתונה: קורס מאתגר, מעניין אבל מלא מתמטיקה משעממת אם כי לא מסובכת. לכו להרצאות אם יש לכם אפשרות, החיים שלכם יהיו בסופו של דבר קלים יותר.", "timestamp": 1690037653945}]}