{"posts": [{"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: David Greenblatt\nחוות דעת - הרצאות: David is an excellent lecturer, and he presents the information in an interesting manner. He does his best to make sure the students understand what's going on.\n\nשם המתרגל/ת: Nitzan Popper\nחוות דעת - תרגולים: Nitzan is a wonderful TA, his tutorials were helpful for understanding the material, he always tried to help when we had questions, and he graded the assignments fairly.\n\nשעורי הבית: There were 5 homeworks, one lab (with report), and one presentation at the end of the semester on compressible flow. The homeworks were reasonable and usually only took a day or two to complete, and Nitzan graded them fairly. The lab involved a wind tunnel experiment to study the boundary layer over a flat plate, the experiment itself was fine and the report required a bit of work. The compressible flow presentation seemed a bit unnecessary, since we didn't learn about compressible flow at all in the course. It wasn't a lot of work (it's just a 15 minute presentation given on the last day of the semester in front of the other students), but David and Nitzan asked some challenging questions at the end (though they gave everyone nice grades).\n\nהמבחן: Very fair exam, at the level of the homeworks. Not difficult like the exams for Fluid Mechanics 1.\n\nהשורה התחתונה: Great course for anyone interested in learning more about aerodynamics beyond what we learned in Fluid Mechanics 1, the course staff are truly excellent. Having homeworks, a lab, a presentation, and an exam in a 2.5 credit course was a bit frustrating, but everything else was great.", "timestamp": 1657553981573}, {"author": "הזרום", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דוד\nחוות דעת - הרצאות: \nוואו איזה זוועה \nלא מבין כלום מהחיים שלו פשוט סיוט כל רגע הקורס הזה\nקורס חובה למגמה כרגע אבל עוד מעט מפסיקים עם החובות ואין ספק שהקורס יעלם כלא היה. 2.5 נקז שדורש מעבדה, פרויקט,פרזנטציה,שיעורי בית ומבחן. מי שיכול לברוח שיברח מי שלא חבל\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: זוועה", "timestamp": 1679330695116}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד גרינבלט\nחוות דעת - הרצאות: \nהחומר שלמדנו במהלך הסמסטר היה לדעתי מעניין. היה גם ניכר שדוד נהנה ללמד אותו. \nדוד כתב על הלוח מאוד מסודר, אבל באנגלית , אז היה אפשר ללכת לאיבוד בקלות יחסית.\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: \nמתרגל טוב, התרגולים הועברו בצורה עניינית וברורה. בסוף הסמסטר עידן פרסם פתרונות רשמיים של כל התרגולים, מה שעזר מאוד בלמידה למבחן.\n\nשעורי הבית: \nעוזרים בהפנמה ותרגול של החומר, לא יותר מדי ארוכים, ולא יותר מדי קשים.\nמעבר לתרגילי הבית היה בקורס גם מעבדה וגם פרויקטון של זרימה דחיסה.\nהמעבדה הייתה נחמדה ומלמדת, ועם קצת השקעה אפשר להוציא בדוח ציון מאוד גבוהה.\nהפרויקטון של זרימה דחיסה בעייני קצת מיותר, לא למדנו נושאים שקשורים לזרימה דחיסה בקורס ונשלחנו לקרוא פרקים מספרים ולהכין על זה מצגת של עשר דקות. היה דיי ברור שרוב הסטודנטים לא באמת הבינו את הנושא שהם היו צריכים להציג.\n\nהמבחן: \nהוגן ועם בדיקה מכבדת. 4-5 ימים ללמידה מספיקים בשביל להוציא ציון גבוהה\n\nהשורה התחתונה:\nאישית מאוד נהניתי מהקורס. החומר מעניין, וסגל הקורס העביר אותו בצורה טובה ומכבדת. \nשיעורי בית, מעבדה, פרויקטון ומבחן זה לדעתי קצת הרבה בשביל קורס של 2.5 נק״ז, אבל בסופו של דבר הם יכולים להעלות את הציון הסופי בקורס בצורה משמעותית.", "timestamp": 1679997632812}, {"author": "וינסטון", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דייויד גרינבלט\nחוות דעת - הרצאות: חומר קשה מאוד לעיכול, מלא משוואות ופיתוחים, דייויד ממש נחמד. לשים לב לטעויות בפיתוחים הוא מפספס לעיתים. בקורס אתם הולכים להתמקצע באינטגרלים, נגזרות חלקיות וכו'. החומר עצמו יחסית נישתי ולא יודע כמה תיתקלו בו במציאות - הבפנים של הבפנים של שכבות גבול. מתאים מאוד לאוהבי מחקר ופחות להנדסה לדעתי.\n\nשם המתרגל/ת: עידן ערבה\nחוות דעת - תרגולים: לא תרם לי רבות לצערי. מתרגל נחמד\n\nשעורי הבית: 5 גליונות, מאוד קשים, מעט רפרנסים\nיש גם מעבדה קלה בקורס. נחמדה ודורשת השקעה סבירה.\nהמבחן: היה יחסית קל. קיימו מה שהבטיחו - שיהיה דומה לשיעורי בית. \n\nהשורה התחתונה: אחרי שעושים כל כך הרבה פיתוחים אולי בסוף קצת אוהבים אותם. יעזור לכם לקורסים אחרים גם לדעתי. החומר עצמו לדעתי משעמם ולא תורם אבל השיטות למידה בו יתרמו בעתיד. בגדול בינוני-מומלץ.", "timestamp": 1713336340401}, {"author": "וון כרמן פול שוורצנגרפטן", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "הקורס מחולק ל-3 חלקים:\nבשבועות הראשונים זה חזרה על זרימה 1 (נפח בקרה\\נבייר סטוקס בגיאומטריה תמירה\\זרימה פוטנציאלית\\ברנולי..)+ הכללה\nאחר כך כל שבוע בערך לומדים טעימה מאחד הנושאים בזרימה (כנף דקה\\זרימה צמיגה\\סיכה הידרודינאמית וכו) כדי שנוכל לבחור להעמיק בנושא בקורס שמיועד לו.\nבחלק האחרון של הסמסטר מעמיקים בשכבות גבול וקצת מ.האנרגיה ומעבר חום בהסעה.\n\nשם המרצה: דוד\nחוות דעת - הרצאות: \nההרצאות ממש לא זורמות וקשה לעקוב. הרבה פעמים דוד מתבלבל בין u לU ואז בכלל בלתי אפשרי לעקוב אחרי הפיתוחים. צריך כל הזמן לשאול אותו שאלות ואז הוא מתקן את הטעויות אבל קשה ללמוד ככה.\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: \nנראה שהוא משתדל אבל התרגולים לא היו טובים. היה חסר הסבר קצר לפני שמתחילים תרגילים כדי לחבר אותנו מההרצאה. גם במהלך התרגילים לרוב הרגיש שהוא פשוט מקריא מהדף ורושם על הלוח. מנגד התרגולים בפנופטו של ניצן היו ממש טובים ועזרו לי להתחבר לחומר.\n\nשעורי הבית: \n5 גליונות חובה(תקף). התרגילים לקוחים מMIT או ממרתפי העינוים של בניין אנרגיה. חלק מהתרגילים לא פתירים, חלק נישתיים וצריך איזהקשר שדוד זורק עליו משהו בקטנה בסוף ההרצאה.\nמאוד מתסכל. לפחות הבדיקה לא מחמירה.\nיש גם מעבדה לקראת סוף הסמסטר עם הגשת דוח מעבדה (תקף). ופרויקט שלא היה השנה כנראה בגלל המלחמה וקיצור הסמסטר (זה קורס 2.5 נקז, כן?)\n\nהמבחן: \nלמרות שהיו שאלות משיעורי הבית, לא נורא בכלל. ממש לא בא להכשיל וגם הרבה טריקים חוזרים על עצמם במבחנים משנים קודמות.\n\nהשורה התחתונה: \nזה היה קורס חובה במגמה אז יכול להיות שהחל משנה הבאה הכל ישתנה", "timestamp": 1715777421107}]}