{"posts": [{"author": "טל", "difficultyRank": 1, "generalRank": 3, "semester": "201901", "text": "שם המרצה: כרמל רוטשילד\nחוות דעת - הרצאות: \nההרצאות היו מאוד לא ברורות. כרמל מאוד מבולבל ולא מסביר בשפה פשוטה שתהיה ברורה לאדם ששומע את המושגים בפעם הראשונה. מומלץ מאוד לדרוש הסברים ולבקש כמה שיותר הדגמות חיות של המושגים שמדברים עליהם (דימות, אברציות וכו'). \nכדאי מאוד לעבוד צמוד לספר הקורס. \n\nשם המתרגל/ת: מיכל סימנוביץ'\nחוות דעת - תרגולים: \nהתרגולים היו חזרה מקיפה (לעתים יותר מידי) על ההרצאות. כמעט כל תרגול נמשך מעבר לזמן שהוקצה לו. היה עדיף אם החזרה על חומר ההרצאה הייתה יותר כללית וברמת האינטואיציה והיינו מספיקים לפתור יותר תרגילים בכיתה. \n\nשעורי הבית: \nפעמים רבות הם לא ברורים והמשוב עליהם היה גרוע מאוד.. כדאי לדרוש משוב במיידי ולא בסוף הסמסטר. \n\nהמבחן: \nשני המועדים היו מאוד לא ברורים. כדאי לקרוא את המבחן בעיון לפני שמתחילים ולהעלות בפני כרמל כל דבר שנראה לא הגיוני במבחן (בכל מועד היינו צריכים לחכות 10 דקות עד שכרמל יבדוק איך הוא מסדר את הנתונים שהוא מספק בצורה שתהיה הגיונית..)\n\nהשורה התחתונה: \nזה הקורס הבסיסי ביותר באופטיקה. יש לו פוטנציאל ללמד המון וקורסים אחרים (כמו תכן אופטומכני) מתבססים עליו מאוד. חבל שהקורס הועבר לא טוב. \nמומלץ לאנשים שלוקחים את הקורס לשבת על הסגל ולדרוש מהם להיות ברורים בהסברים ובמשוב שלהם.", "timestamp": 1599928310111}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: כרמל רוטשילד\nחוות דעת - הרצאות: ההרצאות היו מאוד מאוד מעניינות והועברו ברמה איכותית מאוד, אולי אפשר לגשת למבחן רק עם התירגולים, אבל החומר שנלמד בהרצאות מאוד מעניין ורלוונטי לקריירה.\n\nשם המתרגל/ת: דרור מירון\nחוות דעת - תרגולים: התרגולים היו מאוד ענייניים ועזרו להעמיק את ההבנה של החומר הנלמד בהרצאות.\n\nשעורי הבית: קשים אבל חשובים, והבדיקה שלהם הוגנת ומיטיבה עם הסטודנטים.\n\nהמבחן: חומר פתוח ללא הגבלה, היה מבחן ממש קשה הסמסטר שדרש חשיבה ברמה גבוהה, אבל בסופו של דבר המבחן כן היה פתיר.\n\nהשורה התחתונה: קורס מאוד מהנה, מומלץ לקחת אותו כמה שיותר מוקדם כדי לדעת אם באמת מתאים מגמת אופטיקה. מומלץ לא להגזים עם החומר הפתוח שמביאים למבחן.", "timestamp": 1646144004375}]}