{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: זלמן פלמור\nחוות דעת - הרצאות: \nהמרצה די רץ על החומר לאורך ההרצאות שהיו ארוכות מאוד והיה קשה לעקוב אחריו\nהניח הרבה מאוד ידע קודם שלא בהכרח היה קיים (לא שזה עניין אותו)\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: \nניסה להעביר את התרגולים בשעה שנתנו לו למרות שכמות החומר הייתה גדולה הרבה יותר ממה שאפשר.\n\nשעורי הבית: \nשני פרוייקטים לא פשוטים, אבל די סוגרים על החומר הרמה מסויימת\nהמבחן: \nקשה מאוד, גם היה קשה להתכונן אליו בגלל התעקשות של המתרגל לא לפרסם פתרונות לשאלות שפורסמו או לפרסם בחינות ושאלות קודמות\nהשורה התחתונה: \nקורס לא קל בכלל. חובה ברבדים אז אין מה לעשות", "timestamp": 1626711075157}, {"author": "SMOKIN BODE", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  זלי פלמור\nחוות דעת - הרצאות: הרצאות כבדות עם המון חומר כל פעם, אני מאוד ממליץ לרשום על גבי המצגות שיהיה מסודר ונגיש בסוף בשביל המבחן, וגם בכללי לשאול מלא שאלות כי קל מאוד לאבד את עצמך בחומר.\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים:  התרגולים לא ממש מספיקים בשביל לתרגל אשכרה את החומר, המתרגל בעצמו אומר את זה, הוא כן מספק לכיתה סקריפטים במטלב של כל מיני תרגילים, בקרים וגרפים רלוונטיים לחומר וכאלה וממליץ לשחק איתם ולהבין בעצמנו, לא ממש עשיתי את זה אבל אולי היה כדאי באמת.\n\nשעורי הבית: אין תרגילי בית אבל יש פרוייקט לא קטן שמחולק לשניים במהלך הסמסטר, פרוייקט לא פשוט שמכריח אותך לעבור על החומר שוב ושוב כדאי לפתור נכון, אחר כך גל מחזיר את הפרוייקטים עם משובים שזה פלוס גדול.\n\nהמבחן: \nקשה, לא הייתי מסתדר בלי ההרצאות המודפסות עם ההערות שלי ממהלך הסמסטר. \nהשורה התחתונה: פנאן בסך הכל.", "timestamp": 1657731853414}, {"author": "PD", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  ליאוניד מירקין\nחוות דעת - הרצאות: \nהנושא מעניין ורחב. מירקין ממש טוב במקצוע שלו.\nאם זאת, ניכר שלא נעשה יישום של עקרונות הקורס בהוראה עצמה. לא נראה שיש מאמץ אמיתי ללמד, או ללמוד ללמד במהלך הקורס. \n\nבעיות ההוראה העיקריות הן:\n1. בקורסים שיש הרבה לשנן יש יותר תרגול מעשי עם נפח, ובקורסים שיש יותר נושאים כבדים להבנה יש יותר זמן להעמיק ויותר את מי לשאול. אבל בקורס הזה יש המון! לשנן, ודי הרבה נושאים מורכבים, ואין זמן לתרגל או להעמיק ולכן רצים על הכל די מהר, אפילו אין זמן לסכם במהלך ההרצאה. \nכל מי שלימד אי פעם משהו, יודע שיש כמות סופית של מקום בזיכרון העבודה של סטודנט, ואי אפשר לצפות להחזיק שם כמות גדולה מידי של מידע חדש וגם ליישם אותו בהבנה. ליאוניד מתכחש לחוק הטבע הזה.\n\n2. אין פידבק. אין דרך לדעת אם הבנת משהו עד הסוף כי אין מספיק פידבק כדי לגלות את הטעויות.\n\nשם המתרגל/ת: גל \nחוות דעת - תרגולים: \nגל תותח, וממש טוב בבקרה, הוא יודע להעביר קונספטים מורכבים בצורה פשוטה. אבל אין זמן בתרגולים, וזה לא קורס שאפשר לשאול לגביו משהו דרך האימייל. \n\nשעורי הבית: אין, רק פרויקט בלי מספיק פידבק או הנחיה.\n\nהמבחן: \nמצריך גם שינון ממש גבוה כי אין דף נוסחאות, וגם הבנה עמוקה כי יש מלא טריקים.\n\nהשורה התחתונה: \nזוועות עליך שמשון", "timestamp": 1658215634453}, {"author": "האננס", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שלום! חזרתי מסמסטר קודם, אתחיל ואומר שהמצב לא השתפר מאז 'מבוא לבקרה' חורף 2021-2022 ואפילו התדרדר.\nאמל\"ק: מירקין מרצה נוראי ורשע מרושע. אני זוכרת שאחרי ספי חשבתי שאין מרצה יותר רשע ומרושע ממנו, לצערי טעיתי.\n*ניתן לקרוא את הביקורת שלי על הקורס 'מבוא לבקרה' מסמסטר חורף 2021-2022.\n\nשם המרצה: לאוניד מירקין\nחוות דעת - הרצאות: ברצוני להתחיל בציטוט מחוות הדעת שכתבתי סמסטר שעבר במבוא לבקרה: \"מרצה זה שם יפה מידי, יותר נכון לרשום מכונת קול שמקריאה את ההרצאות מאנגלית לעברית.\"\nונחזור לביקורת, בהרצאה הראשונה לאוניד אמר לנו (ואני מצטטת): \"אתם בחרתם להיות פה אז אני מרשה לעצמי לענות אתכם, מי שרוצה שיהיה לו קל שיעבור למגמת תכן\".\nההרצאות סופר סופר חשובות, צריך לזכור בעל פה כל פסיק שכתוב שם (במיוחד במיוחד דברים שכתובים באפור).\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: אתחיל ואומר שאני קצת מרחמת על גל, הוא אמנם מניאק אבל מירקין מכריח אותו להיות אפילו יותר מניאק מבדרך כלל. (אני נגד עלבונות אישים נגד מרצים ומתרגלים אבל הפעם באמת הייתה הגזמה)\nהוא מאוד רוצה לעזור לנו אבל ידיו כבולות.\nהתרגולים בכלל לא חשובים, גל כן פותר שם תרגילים אבל זה לא באמת עוזר להבנה ובכלל בכלל לא עוזר למבחן.\n\nשעורי הבית: יש 2 פרויקטים שכל אחד 20% מהציון, הרמה של הפרויקטים מאוד גבוהה והם לא שווים בקושי.\nהראשון הרבה יותר קשה.\nיש קשר קל בין הנלמד בהרצאות לבין הפרויקטים.\n\nהמבחן: נוראי!\nבדרך כלל אני לא מתבכיינת על מבחנים אבל באמת נוראים.\nיש מאגר שאלות במירקין מפרסם לפני המבחן, ללא פתרון ואסור לגל לגלות לנו את התשובות לשאלות.\nהמבחן עצמו בנוי מ-21 שאלות, כל אחת 5 נקודות, כשהשאלות הקלות במבחן קשות הרבה יותר מהשאלות הקשות במאגר.\nהיו 3 שאלות על חומר שנאמר שבהרצאות: \"אל תדאגו, החומר לא לרמת הקורס\".\nכל השאלות התמקדו על מקרי קצה שרק הוזכרו בהרצאות ובתרגולים.\nניתן לראות מההיסטוגרמה (נכון ליום כתיבת חוות דעת זו לא ניתנו פקטורים) שרק 11 מתוך 43 סטודנטים עברו את המבחן ורק אחד קיבל מעל 90.\n\nהשורה התחתונה: קורס חובה למגמת רבדים, אם אפשר לא לעשות אותו עם מירקין.\nהוא באמת נוראי.\nהשילוב של מירקין וגל ברקאי באמת נוראי, כל אחד מדרבן את השני להיות יותר קשוח.\nלסיום אני אתן דוגמה, את הפרויקט השני העתקנו מילה במילה (אני לא גאה בעצמי ובאמת לא יפה אבל היה סמסטר עמוס) מרפרנס שקיבל 100 מגל ברקאי בכבודו ובעצמו וקיבלנו רק 82. \nלכו תבינו.", "timestamp": 1658656470199}, {"author": "הדלאי לאמה", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: מיריקין\nחוות דעת - הרצאות: אין מילים, לא הבנתי הרבה, עושה מאמץ משמעותי שלא נבין את החומר תוך כדי שהוא אומר מילים רלוונטיות עם הקשרים בינהן. את ההבנה קיבלתי מסרטונים ביוטיוב, החומר עצמו לא מזעזע כמו שמיריקין גורם לו להיראות.\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: מה קרה פה הרגע?\n\nשעורי הבית: שני פרויקטים אכזריים - הראשון יותר מהשני.\n\nהשורה התחתונה: עונש למי שלקח רבדים כברירת מחדל ולא כי בקרה זורמת לו בעורקים...", "timestamp": 1687595428874}, {"author": "הדלאי לאמה", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: L\nחוות דעת - הרצאות: שטויות יפות\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: לא ברור למה הוא טרח לבוא בכלל\n\nשעורי הבית: אין, גם לא שאלות פתורות לתרגול, והשאלות שכן יש לתרגול מירקין לא מסכים לגל לענות עליהן.\n\nהמבחן: השם ירחם\n\nהשורה התחתונה: אחלה סיבה לא ללכת למגמת רבדים.", "timestamp": 1690549886427}, {"author": "אדם לא קונטרולבילי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות: החומר עצמו באמת לא קשה אבל מירקין טס עליו תחת ההנחה שאתם זוכרים כל מה שלמדתם לפני כמה חודשים אחד לאחד וכאילו כל מה שהוא אומר מובן מיידית דבר שלעיתים קרובות גורם לחוסר הבנה בחומר.\nלדעתי בדיעבד כדאי לראות על מה השקופיות מדברות קצת לפני ההרצאה ולמצוא סרטון יוטיוב קצר שמסביר את הקונספט כדי שיהיה קל יותר לעמוד בקצב של מירקין.\nיש לומר שמירקין הוא אדם דיי מצחיק וכריזמטי אבל הוא לא מרצה כל כך טוב כי הוא עצלן בכל הלוגיסטיקה שקשורה ללנהל קורס, כלומר הוא לא מביא שיעורי בית כי אין לו כוח לרשום או לבדוק אותם, הוא לא מביא גישה למבחנים קודמים או תשובות לשאלות מהמאגר כי אז הוא לא יוכל למחזר את המבחן ויצטרך לרשום עוד שאלות. אז בעצם יוצא שאין כמעט משאבים ללמידה למבחן. מה שכן יש לומר שהוא נותן מענה מאוד גדול בשעות קבלה ומיילים, הרבה מעבר למרצים אחרים (בימים לפני המבחן אנשים היו  מגיעים אליו לשעות קבלה במשך שעות כל יום ובנפרד ולמיילים ארוכים ששלחו הוא ענה תוך גג שעה בצורה מאוד נרחבת) אז כן שווה לתת קרדיט על זה.\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים: לא כל כך שימושיים, גם גל יודע את זה אבל לפחות הוא מנסה\n\nשעורי הבית: אין, יש שני פרוייקטונים, הראשון ארוך והשני קצר, נותנים נגיעה בחלק קטן מהחומר.\n\nהמבחן: המבחנים של מירקין מוזרים מאוד, לקרוא להם מבחנים בבקרה יהיה שקר, הם מבחני זיכרון ואלגברה וכדי להצליח בהם תצטרכו גם להבין את החומר וגם לשנן המון דברים מההרצאות. יש לומר שמירקין, כפי שאמרתי קודם הוא קצת עצלן בכל מה שקשור לכתיבת שאלות ולכן חלק מהשאלות יהיו מהמאגר וחלקן ימוחזרו ממבחנים של שנים קודמות (שלא ישוחררו לכם אבל תהיו בטוחים שמחזורים לפניכם ניסו לשמר ידע אז דברו איתם).\n\nהשורה התחתונה: קורס מעניין אך חבל שלא מועבר בצורה יותר טובה, בכל מקרה למי ששוקל לדלג עליו כי הוא לא רוצה לעשות קורס נוסף עם מירקין, רק תדעו שחוץ מזה שהחומר סהכ דיי מעניין, הוא גם קדם להמון קורסים מצויינים וחבל לוותר עליהם בגלל קורס אחד אז לשיקולכם.", "timestamp": 1691177133981}, {"author": "האובסרוובילי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ליאוניד מירקין\nחוות דעת - הרצאות: \nכפי שהמליצו חבריי - לעבור על ההרצאה + סרטון ביוטיוב לפני השיעור, אחרת אין סיכוי גדול להבין הרבה למעט יחידי סגולה.\nיש לומר שמירקין הוא חביב מאוד והידע שלו נרחב, אבל יש לו קושי להעביר אותו בצורה פשטנית, הייתי מנסה לשאול הרבה שאלות במקום \"להנהן\" כאילו הבנתי, מירקין ישמח לענות לכל שאלה.\n\nשם המתרגל/ת: גל ברקאי\nחוות דעת - תרגולים:\nלא רלוונטיים למבחן עצמו אבל גל מנסה להסביר יותר בפשטות את נושאי ההרצאה. אם הייתה עוד שעה או אפילו שעתיים תרגול כדי לעבור על המתמטיקה עצמה ולא על הסברים כללים וגרפים אז יכול להיות שבאמת היינו מבינים את הקורס\n\nשעורי הבית: \nאין, וחבל - תרגול של כל נושא יכול לגרום להבנה עמוקה של החומר ולא רק זכרון של כללי אצבע.\nיש שני פרויקטים שמספקים מעבר על חלק מהחומר והם כן תורמים להבנה, תשקיעו בהם זה יעזור מאוד לציון\n\nהמבחן: \nמבחן באלגברה וזכרון כפי שנאמר. תשאירו לעצמכם מספיק זמן ללמוד את כל ההרצאות ולזכור את כל הכללים.\n\nהשורה התחתונה: \nההפחדות סביב הקורס מוגזמות, אתם תהיו בסדר", "timestamp": 1691241857936}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "Don’t take this course, worst mistake i’ve ever made in my whole degree. RUN!", "timestamp": 1717232338012}]}