{"posts": [{"author": "אדם בלי דרגות חופש", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות:  מרצה טוב סה\"כ, אדם מאוד נחמד ומסביר יותר טוב מרוב האנשים בפקולטה. החומר בהרצאות מעניין ומסביר את התיאוריה של חומר יחסית טכני, החיסרון היחיד הוא שלפעמים ליזהר יש נטייה לא לומר את השורה התחתונה.\n\nשם המתרגל/ת:  צבי צ'פניק\nחוות דעת - תרגולים: מאוד טכניים ובנויים בצורה שגורמת להם להיות כמה שפחות שימושיים כי הרובוטים בתרגילים שם כל כך מפושטים שהוא לא קשורים כמעט בשום צורה למה שנתקלים בשיעורי בית\n\nשעורי הבית:  מאוד ארוכים ועמוסים, המון מטלאב ואם זה ממש מלמדים את החומר בצורה טובה וגורמים לך באמת ליישם אותו. 4 גיליונות שכל אחד מהם פחות או יותר בגודל של הפרוייקט סוף במבוא לרובוטיקה, האחרון גולש כבר לתקופת מבחנים. אבל בפועל בגליונות האלה החומר באמת שוקע.\n\nהמבחן:  מאוד טכני ודורש הבנה טובה של החומר אבל לא קשה, אם הייתם על הקורס במהלך הסמסטר אפשר לסיים אותו גם שעה לפני הזמן ולחזור אחורה כדי למצוא טעויות חישוב שללא ספק תעשו שם.\n\nהשורה התחתונה: קורס מאוד מעניין שמאוד ניהניתי ממנו, מביא הרבה כלים לנתח קינמטיקה ודינמיקה של רובוטים, מבחינת בקרה מפני שהרגיש לי שרוב החומר בנושא זה היה בעיקר תיאורטי ופחות פרקטי. בכל מקרה מאוד מומלץ למי שרוצה קורס מעניין ומלמד, פחות מומלץ למי שרוצה קורס עם ציון גבוה וקצת עומס, כנראה היה אחד מהקורסים היותר עמוסים שלי בתואר.", "timestamp": 1688728972612}, {"author": "G", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יזהר אור\nחוות דעת - הרצאות: הרבה תיאוריה אבל אחד המרצים היותר טובים שיצא לי לחוות.\n\nשם המתרגל/ת: צבי צ'פניק\nחוות דעת - תרגולים: לרוב היה אפשר להבין את התרגולים מקבצי PDF שכתובים מצוין ופורסמו במודל. צבי היה מפוזר קצת\n\nקיים נוהל מיוחד שהמתרגל או עוזר ההוראה (עוד אחד מצוות הקורס) עשו סדנה - מעין שעת קבלה משותפת שבה אפשר לשאול את צוות הקורס מה כדאי לעשות כשנתקעים (ונתקעים.) בשיעורי בית. זה יכול מאוד לעזור.\n\nשעורי הבית: 4 גיליונות קשים ובעיקר עמוסים שדורשים הרבה מטלאב. דברים לא תמיד הולכים לעבוד לכם אבל עדיין תקבלו בהם ציון סביר אם נראה שלפחות הבנתם את הדרך. הפרויקט הראשון הוא ליטרלי הפרויקט סיום של מבוא לרובוטיקה (אז כן, אפשר להעתיק משם הרבה אם עשיתם נכון), והשאר באותה רמת עומס.\nלמרות כל הדברים הרעים שאמרתי, הם מאוד מלמדים (מהם לומדים את רוב הקורס), ולי לפחות היו גם מאוד מעניינים.\n\nהמבחן: \nהייתה לנו בדיקה סופר קשוחה אבל המבחן בגדול טכני\nהשורה התחתונה: \nקורס מאוד מעניין. עמוס אבל שווה את זה.\nמאוד מזכיר את קינמטיקה של מכניזמים למי שלקח, מבחינת מבנה הקורס (בלי הפרויקט בסוף)", "timestamp": 1689836102052}]}