{"posts": [{"author": "A", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: הרצאות סבבה, מבחינת הבנת החומר זה לא נחוץ. אבל אמיר נותן שאלוני בונוס קצרים במהלך ההרצאה (צריך להגיש את התשובה תוך כמה דקות) ואם עונים נכון מקבלים 1% בציון 100 למגן אז זה יכול להצטבר להרבה נקודות.\n\nשם המתרגל/ת: דוד קיסר\nחוות דעת - תרגולים: מתרגל מצוין, מעביר את החומר טוב ובצורה ברורה. שווה לעבוד בצמוד עם דף הנוסחאות מתחיל הסמסטר כדי לרשום הערות. ממליצה מאוד ללכת לתרגולים ולקרוא את דפי התרגול לפני תחילת התרגול עצמו.\n\nשעורי הבית: לא להגשה. בערך 5 גיליונות.\n\nהמבחן: אם אין מגן ש\"ב/נקודות בונוס אז המבחן הוא 100% מהציון הסופי. בד\"כ אצל אמיר יש 3 שאלות חישוביות יחסית מובנות ועוד שאלה תיאורטית אחת של פיתוח נוסחאות או דברים מסובכים אחרים. כדאי לעבור טוב על הפיתוחים בהרצאות כדי להצליח בשאלה הזו.\n\nהשורה התחתונה: בסך הכל קורס לא קשה (ביחס לאופציות האחרות במקבץ) לכן מומלץ למי שרוצה לסיים עם קורסי החובה בכיף ובטוב.", "timestamp": 1626428158275}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: מרצה מצויין! מעביר את החומר באופן מענייו מאוד (מביא מתודות יוצרות עניין בכיתה - תמונות וסרטונים, הצגת מערכת schlieren בכיתה).\nמעבר למבחן סוף היה פרוייקט (25% מהציון הסופי) של קריאת מאמר - כתיבת סיכום ופרזנטציה בכיתה.\nיחס מכבד ורציני כלפי הסטודנטים.\n\nשם המתרגל/ת: דוד קיסר\nחוות דעת - תרגולים: מתרגל מעולה. מעביר את החומר בצורה ברורה ומעלה PDF של כל התרגולים עם הסברים מורחבים. \nנגיש מאוד.\n\nשעורי הבית: קיימים במודל עם פתרונות אבל אין חובת הגשה.\n\nהמבחן: מבחן שברובו דומה למה שנראה בתרגולים ובתרגילי הבית. אבל לא מבחן פשוט.\n\nהשורה התחתונה: קורס מאוד מעניין! מומלץ!", "timestamp": 1657827272150}, {"author": "הזורם", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: \nהקורס הועבר באנגלית דבר שלא הוסיף - לא הודיעו על הכוונה שיהיה באנגלית וחטפנו את זה בהפתעה בשיעור הראשון מה גם ששנה שעברה היה באנגלית, הרצאות מזעזעות קשה מאוד להישאר ער, את רוב החומר למדתי מהספר שהוא משעמם להחריד \nשם המתרגל/ת: דוד קיסר\nחוות דעת - תרגולים: \nמתרגל מצוין\nשעורי הבית: \nלא חובה אבל לא הכינו למבחן\nהמבחן: \nהיה קשוח לעומת שנים קודמות, היה פקטור של 10 נקודות ועדיין ממוצע נמוך בקרוב ל10 נקודות משנים קודמות. יש פרויקט שמהווה 25 אחוז מהציון הסופי, לקרוא מאמר מדעי על נושא שלא הכרת מאתר עם 10000 מאמרים ללא כל הכוונה מה לקחת, אתה יכול ליפול על נושא אלוהים אדירים מה שיגזול ממך זמן כמו קורס של 4 נקז בפני עצמו, המאמר באנגלית הסיכום שכותבים עליו באנגלית ויש פרזנטציה באנגלית לא הגיוני בעליל ל25 אחוז במקצוע של 2.5 נק\"ז\nהשורה התחתונה: \nלא מומלץ בכלל, קורס מעניין אבל לא שווה את זה\nמומלץ לפני השינה לקרוא 2 3 עמודים מהספר בחיים לא ישנתי ככה\nקראתי את ספר הקורס 90 אחוז מהפעמים נרדמתי", "timestamp": 1658909590365}, {"author": "100 בדוק", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עומרי רם\nחוות דעת - הרצאות: \nזוועה, גיהנום, לברוח כמו מאש\nמרצה גרוע \nמעמיס ברמה לא נורמלית עם פרויקט שלא מלמד כלום ושלוקח את כל הזמן בסמסטר\nלא לקחת!!!!!!!!!!!!!!!!!!!\nולא להתקרב!!!!!!!!!!!!!!!\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1660820455053}, {"author": "איילת השחר", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עמרי רם\nחוות דעת - הרצאות: מרצה טוב, גם היה די נחמד וגם מקצועי\n\nשם המתרגל/ת: יואב גיחון\nחוות דעת - תרגולים: אדם פצצה, מתרגל מקצועית לא טוב. הרבה טעויות . השתפר לאורך הסמסטר\n\nשעורי הבית: קשים וארוכים. \n\nהמבחן: היה הוגן וחישובי. שאלות תיאוריה יכולות להוריד את הממוצע ב15-20 נקודות . מאחל שלא תיתקלו בהן \n\nהשורה התחתונה: מעט מבאס. החומר לא עניין את רובנו למרות שהגענו עם הרבה מוטיבציה. הקורס מתמקד בנושא מאוד ספציפי (גלי הלם) ולכל מי שאין איזו זיקה לנושא כנראה שפחות יתחבר.", "timestamp": 1690366224527}]}