{"posts": [{"author": "B", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אמיר גת \nחוות דעת - הרצאות: ההרצאות היו באנגלית במבטא ישראלי כבד. כן ניסה להיות חברותי ונחמד וענה על שאלות אבל לא הכי מעניין\n\nשם המתרגל/ת: ערן בן חיים \nחוות דעת - תרגולים: שמו הולך לפניו, המתרגל הכי טוב בפקולה אם לא בטכניון בכלל. משקיע ברמות מסביר מדהים נותן חומר אקסטרה והכנה לשיעורים הבאים, פתח איתנו קבוצת ווצאפ לקורס, מדהים פשוט. \n\nשעורי הבית: עמוסים ברמות נוראיות, כל שבוע בערך 20-30 עמודים של פתרונות מוקלדים \n\nהמבחן: הרמה היתה סבבה אבל ארוך בהגזמה. בגלל זה קיבלנו 25% פקטור\n\nהשורה התחתונה: לא קורס שלוקחים לכיף", "timestamp": 1615191932815}, {"author": "Adi", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: לא הייתי. לא חושבת שיש צורך ללכת להרצאות כדי להצליח בקורס.\n\nשם המתרגל/ת: ערן בן חיים\nחוות דעת - תרגולים: תותח על! מתרגל מעולה שמסביר את החומר בצורה טובה ממש. שם דגש על הדברים החשובים. יש גם תרגולים מוקלדים ממש טובים שעוזרים להבנה יחד עם התרגול של ערן.\n\nשעורי הבית: תרגילי בית שבועיים ארוכים יחסית. מה שכן הם מאוד מלמדים ולדעתי זה מאוד חשוב להשקיע בהם כי ככה החומר נכנס טוב לראש לקראת הבחינה.\n\nהמבחן: דיי דומה לתרגילי הבית, אין הפתעות. מי שעשה שיעורי בית וחד על החומר יצליח כנראה גם במבחן.\n\nהשורה התחתונה: קורס לא פשוט שמומלץ לקחת רק אם עושים תואר שני, אחרת חבל על ההשקעה והמאמץ. עם השקעה במהלך הסמסטר אפשר לקבל ציון טוב בקורס.", "timestamp": 1625421858119}, {"author": "עילום שם", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: אישית עברתי על קבצי ההרצאות הכתובים במודל. מדובר בקבצים מפורטים ומסודרים שלדעתי ניתן ללמוד מהם כהלכה. בנוגע לחללי הבנה ניתן לפנות לשעות קבלה של המרצה/ המתרגל אך אישית לא הרגשתי צורך בכך (מה גם שהחלק העיקרי מועבר בתרגולים עצמם). \n\nשם המתרגל/ת: ערן בן חיים\nחוות דעת - תרגולים: ממוקד מאוד, דואג להבנת הסטודנטים ופנוי לשאלותיהם ואי הבנותיהם. לדעתי מומלץ מאוד ללכת לתרגולים שלו, יחד עם שעות קבלה אם יש צורך. \nבאופן כללי, התרגולים חשובים מאוד להבנה, בקיאות והפנמה. כדאי לעבור על התרגילים ולוודא הבנת מהלך הפתרון, ואף לעבור על כלל התרגולים עצמאית שוב לקראת המבחן. \n\n\nשעורי הבית: יחסית כבדים, מדובר בגיליון יחסית ארוך כל שבוע (הגשת 10 גליונות לפחות מתוך 12). מומלץ לבצע זאת לאחר ביצוע התרגול התואם ולהקדיש לכך כמה ימי עבודה (כמה שעות בכל יום) ולא לחכות לרגע האחרון. \n\nהמבחן: עדיין לא התקבלו התוצאות. באופן כללי המלצתי האישית היא לעבור עצמאית בצורה מוקפדת על כל התרגולים מחדש, להבין את מהלך הפתרון לעומק ולהגיע ליכולת לפתור את התרגילים לבד, ללא עזרה חיצונית. מומלץ גם להכין/ להדפיס דף נוסחאות מסודר שיכיל את כל החומר הרלוונטי (אצלנו היה עם חומר פתוח, ולא היתה מגבלת מקום) ולהתקדם איתו לאורך הסמסטר (ותוך כדי להוסיף נוסחאות/ חלקים רלוונטיים נוספים). כמו כן, חשוב מאוד גם לתרגל מבחנים מהשנים האחרונות, בייחוד של המרצה האחראי. \n\nהשורה התחתונה:", "timestamp": 1644326537796}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: מרצה סביר, עם כוונה טובה אבל לא הכי מוצלח בהסברים שלו. מצגות שהוא מעלה למודל נוחות ודי ברורות. נותן \"בחנים\" במהלך ההרצאות שנותנות נקודות בונוס לציון הסופי - דבר נחמד מצידו.\n\nשם המתרגל/ת: ערן בן-חיים\nחוות דעת - תרגולים: מתרגל תותח! מסביר ומלמד מצויין, אפילו נתן את ההרצאה במקום אמיר בכמה מקרים והיה ממש מוצלח. ברמה האישית - אדם נחמד מאוד.\n\nשעורי הבית: עמוס מאוד! גם לא מעט תרגילים וגם צריך להקליד (ניתן להגיש בזוגות). אבל מי שפותר ומגיש אותם יצליח במבחן.\n\nהמבחן: מבחן לא קל, אבל בהחלט אפשרי אם מבצעים את תרגילי הבית (הם העלו לא מעט מבחנים לדוגמה במודל). סך הנקודות במבחן היו 120 כאשר הניקוד המקסימלי היה 100.\n\nהשורה התחתונה: קורס חובה לתואר מתקדם, אז אין פה כל כך בחירה. לקחת כקורס בחירה - רק אם יש זמן פנוי. סה\"כ הנושאים המתמטיים די מעניינים (פוקנציות מרוכבות, מד\"ר\\מד\"ח, שיטות אסימפטוטיות).", "timestamp": 1648478645549}, {"author": "רם הנדסת מכונות", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nפרופסור אמיר גת\nחוות דעת - הרצאות: \nבגלל שביתות עקב פיטורי שר הביטחון,שביתה של מרצים כדי להעלות את השכר שלהם וכוח עליון היה רק 7 הרצאות מתוך 13!\nמדובר במשהו נדיר שלא קרה אף פעם בקורס ואני אישית לא נתקלתי בו אף פעם בטכניון.\nלכן כל הנושא של אנליזה קומפלקסית ירד מהחומר.\nההרצאות היו נחמדות והיה בחנים קלילים שנותנים בונוס לציון הסופי.\nבכללי לפי דעתי בגלל שהמרצה הוא איש אנרגיה, רוב הדוגמאות שלו בקורס הן בזרימה או מעבר חום.\nשם המתרגל/ת: ערן בן חיים\nחוות דעת - תרגולים: \nמתרגל מצוין,\nבסמסטר שלנו הוא עשה סדנא שבועית של שעתיים בכל פעם של סיוע בפתירת השיעורי בית במקום שעות קבלה וזה היה ממש מוצלח.\nאציין שהבחני בונוס של התרגולים יותר קשים מהבחני בונוס של ההרצאות.\nשעורי הבית: \nשיעורי בית עמוסים ממש אך היו רק 6 גיליונות חובה ובדרך כלל יש 12 אז יש פה עקיצה רצינית\nהמבחן: \nהיה קשוח מאוד ודפקו את רוב הקורס לכן הממוצע הרבה יותר נמוך משנים קודמות,בכל זאת אם עוקצים את הקורס בכך שלומדים חצי ממנו הסגל עוקץ את הסטודנטים חזרה.\nהשורה התחתונה: \nהקורס לא קשור בכללללל לרובוטיקה,בקרה,אופטיקה,תכן וכדומה. הוא מתאים רק למי שקשור לתחום האנרגיה לכן לפי דעתי לא הוגן לחייב את כל הסטודנטים לתואר שני בפקולטה לקחת אותו אבל זו הסיטואציה כרגע.\nאני ממליץ להשיג רפרנס לשיעורי בית אך בכל זאת לנסות לפתור כמה שיותר מהם בכוחות עצמך.\nבקיצור אם סבתא שלי היתה שואלת אותי אם לקחת את הקורס הייתי עונה לה שרק אם היא רוצה תואר שני בהנדסת מכונות אז שתיקח.", "timestamp": 1690053505156}, {"author": ":)", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: מאוד קלילות, אמיר מרצה מעולה ונחמד מאוד. הבחנים מאוד עוזרים להישאר קשובים. ההרצאות מאוד ברורות ואמיר פתוח ומזמין לשאלות. \n\nשם המתרגל/ת: ערן בן חיים\nחוות דעת - תרגולים: ממליץ מאוד - ערן מתרגל מעולה ומאוד חד. מסיים בקרוב להעביר אז כנראה שלא רלוונטי.\n\nשעורי הבית: עמוסים, כל שבוע גליון. להשקיע ולראות שאתם מבינים את החומר כי הרבה מהגליונות מכילים שאלות ממבחני עבר. \n\nהמבחן: פרקטי, טכני, עמוס מאוד ומאתגר. למידה רציפה כל המסמסטר והשקעה בשיעורי בית היא הדרך היחידה להצליח. \n\nהשורה התחתונה: לא ממליץ אלא אם עושים תואר שני ואז הקורס חובה, וגם אז הוא לא רלוונטי למחקר של חלק גדול מהסטודנטים.", "timestamp": 1715810108562}, {"author": "המשמיד", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אמיר גת\nחוות דעת - הרצאות: אחלה הרצאות. אמיר מאוד חביב ונחמד, עושה מלא מיני בחנים (שמהווים כמגן בקורס) ומגלה להם את התשובות. ההרצאה היא 3 שעות אבל בפועל אמיר מלמד שעתיים מתוכה (במקרה הטוב).\n\nשם המתרגל/ת: ערן בן חיים\nחוות דעת - תרגולים: ערן אחלה מתרגל, יש קבצי תרגול מאוד סבבה במודל. בסוף כל תרגול יש בוחן מגן שנמשך עוד אקסטרה חצי שעה (מעבר למה שמצוין בשעות התרגול). הבוחן הזה לרוב דיי קשוח אבל אפשר להצליח את חלקם ולהשיג עוד אחוזי מגן. מדגיש כי ערן בדרך כלל עושה תרגול ישר אחרי ההרצאה של אמיר, אז ממליץ להתכונן נפשית ל-6 שעות לימוד.\n\nשעורי הבית: גליונות שבועיים בזוגות, ארוכים, מעצבנים וגרועים. לא פעם היה טעות בגיליון, לקח זמן גם לצוות הקורס להתייחס לזה וזה היה קשוח. עם זאת, הגליונות מכינים מאוד טוב למבחן.\n\nהמבחן: יש ארבע שאלות, ניתן לצבור עד 120 נקודות. לרוב השאלות סטנדרטיות, אבל הם משלבים בהם כל מיני טריקים פה ושם ואז זה קצת מקשה. בסופו של דבר אם מקבלים עובר בבחינה (מאוד ריאלי), עם המגן בקורס מגיעים לציון 75~.\n\nהשורה התחתונה: קורס דיי עמוס בהגשות. עם זאת, אפשר להשיג בו כ-50 אחוז מגן לבחינה ולכן כדאי להגיש את כל ההגשות (15% מגן), להגיע להרצאות (5% על נוכחות) ולהשקיע בבחנים (כ-30% מגן).", "timestamp": 1716289204718}]}