{"posts": [{"author": "אווירו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רנה ואן-האוט\nחוות דעת - הרצאות: הרצאות מעניינות בסה״כ. רנה נחמד מאוד ומשתדל להסביר את הדברים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית:  5 ת״ב לא קלים במיוחד אבל גם לא קשים בצורה חריגה, כן דורשים זמן והבנה אבל מתבססים על מה שנלמד בהרצאה.\n\nהמבחן: אין\n\nהשורה התחתונה:  קורס חביב ומקיף", "timestamp": 1679779303295}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: לא התחברתי בכלל לקורס, חשבתי שיהיה אופי שונה. הרצאות מאוד מאוד תיאורטיות, לומדים את כל התיאוריה מאחורי שכבות הגבול השונות. כדאי לבוא להרצאות כי בסוף הקורס יש מבחן בעל פה...\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: לנו היו 4 גיליונות ש\"ב (בעיקרון יש 5), אם יש פתרונות משנים קודמות אז זה יותר נחמד אבל אם אין אז זה קצת לשבור את הראש ולוקח לא מעט זמן. שיעורי הבית הם 80% תקף מהציון הסופי.\n\nהמבחן: מבחן בעל פה 20% מהציון הסופי. 30 עד 45 שיחה עם רנה 1x1, שואל שאלות על החומר כדי לראות שמשהו הובן מהקורס, רנה עוזר ומכווין כשלא יודעים בדיוק את התשובה. ציונים סבבה במבחן גם אם לא יודעים מאוד טוב את החומר, רנה מפרגן.\n\nהשורה התחתונה: קורס לא מאוד מאוד מעמיס אם יש פתרונות או עזרה של סטודנטים אחרים. חומר קצת קשה ולא מובן, מאוד תיאורטי. אם מחפשים משהו מעניין אז זה לא זה לטעמי, אם מחפשים קורס לסגור את התואר אז זה יכול להתאים אם אין משהו אחר יותר טוב.", "timestamp": 1715191202711}, {"author": ":)", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רנה ואן האוט\nחוות דעת - הרצאות: מעשירות מאוד את הרקע מאחורי כל תורת שכבות הגבול והן מעניינות, אם כי לפעמים הפיתוחים המתמטיים משעממים. רנה מרצה טוב ומאוד אכפתי.\n\nשעורי הבית: 4 גליונות יחסית מרופרנסים שלכולם הסמסטר היה פתרון מלא בספר פתרונות של ספר הקורס (שאלות אנליטיות) או בדרייב הפקולטי לשאלות הנומריות. כל גליון 20% אז חשוב להשקיע. רנה בודק בקפידה.\n\nהמבחן: יש בחינה בעל פה שמשקלה 20% מהציון הסופי על אחד הנושאים שנלמדו בקורס. כדאי להתכונן לקראתה ולעבור על ההרצאות, בעיקר באה לראות שהייתם נוכחים והקשבתם. רנה נחמד מאוד ומכווין.\n\nהשורה התחתונה: ממליץ בעיקר מכיוון שהוא ליבה לתואר שני, אם כי דורש השקעה ויחסית עמוס לקורס תואר שני.", "timestamp": 1716402752824}]}