{"posts": [{"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אילת טל\nחוות דעת - הרצאות: היא מלמדת קצת מהר, אך נותנת הרבה הזדמנויות לשאול כדי להבין.\n\nשם המתרגל/ת: עמית פלג\nחוות דעת - תרגולים: מועברים היטב ובאופן ברור.\n\nשיעורי הבית: לא פשוטים ודורשים השקעה לא מבוטלת. יש 9 תרגילי בית, והציון נקבע על סמך 8 התרגילים הטובים ביותר.\n\nהמבחן: מאתגר וצפוף, אך לא ברמה שאי אפשר להצליח בו.\n\nהשורה התחתונה: קורס לא קל, אך לא בלתי עביר. נותן בסיס טוב לנושא חשוב.", "timestamp": 1602405332312}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עידו טל\nחוות דעת - הרצאות: סבירות אבל רוב החומר הרלוונטי מועבר בתרגול. יש דברים שמועברים בהרצאה ולא מועברים בתרגול, אז כדאי לשים לב. \n\nשם המתרגל/ת: עמית פלג\nחוות דעת - תרגולים: תותח על ומסביר מעולה\n\nשעורי הבית: 8 גליונות יבשים, הרוב מרופרנס אבל כדאי להשקיע בהם אם רוצים לקבל מושג לגבי המבחן.\n\nהמבחן: היה מבחן קשה פי כמה מסמסטר רגיל. עיקר הבעיה במבחן הוא הלחץ זמנים.\n\nהשורה התחתונה: קורס בסיס שפותח את המחשבה, אבל לא כדאי לזלזל.", "timestamp": 1613393139836}, {"author": "דב", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: איש נחמד אבל חסר כריזמה בעליל.לא חד כאשר הוא מעביר את החומר\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגל טוב,מרגיש שהרבה פעמים בגלל הלחץ שלו להספיק את כל התרגילים לא ניתן לשאול כמעט שאלות בתרגול\n\nשעורי הבית: ארוכים אבל רלוונטים ממש\n\nהמבחן: קשה וארוך. די תלוי בודק,אבל אותי אישית כיסחו בבדיקה\n\nהשורה התחתונה:", "timestamp": 1613979950708}, {"author": "סטודנט כללי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: \nחומר שברובו מעניין גם אם לא מרגיש כך בהתחלה או אפילו בהמשך לתוך הסמסטר. אורי הסביר בצורה ברורה ונעימה את החומר.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא קלים ואף ארוכים, מבוססים על שאלות שהיו במבחנים ומכינים טוב לקראת הלמידה למבחן.\nהמבחן: \nהוגן, ללמוד טוב ולהצליח!\nהשורה התחתונה:", "timestamp": 1614284468168}, {"author": "באבל סורט", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: זהירות המרצה מוריד נקודות בערעורים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614887225216}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי רוטנשטייך\nחוות דעת - הרצאות: מסביר מעולה, מפרט את השלבים באלגוריתמים ועונה לשאלות\n\nשם המתרגל/ת: עמית פלג\nחוות דעת - תרגולים: מתרגל מעולה\n\nשעורי הבית: די ארוכים יחסית לכמות נק\"ז\n\nהמבחן: די ארוך ולא פשוט. חשוב להכיר את האלגוריתמים ממש טוב, ולהבין מה תפקיד כל חלק וכמה סיבוכיות הוא לוקח. \n\nהשורה התחתונה: קורס מאוד מעניין", "timestamp": 1616057286642}, {"author": "AA", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי \nחוות דעת - הרצאות: אורי מעולה. ראיתי את ההקלטות . ממליץ בחום\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: ככה ככה אין יותר מידי ערך מוסף די קוראת מהדפים .\n\nשעורי הבית: ארוך מאוד ביחס ל3 נקז. רוב השאלות ממבחני עבר\n\nהמבחן: עמוס מאוד צריך לשלוט באלגוריתמים ולהכיר את כל ה'טריקים'.\n\nהשורה התחתונה: אחלה קורס מעניין די עמוס לא קשה מידי", "timestamp": 1643877084448}, {"author": "Omer Reuven", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: איילת\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים לא מספיק משקפים את הרמה הנדרשת\nאבל כן הציגו בהם כמה רעיונות שימושיים\n\nשעורי הבית: \nשאלות ממבחני עבר וממוחזרים \nלוקחים זמן אבל עוזרים להבין את החומר\nהמבחן: \nהרמה סבירה אבל הזמן קצר ביחס לכמה שצריך לכתוב\nרמת הקושי עולה בשנים האחרונות והמבחן האחרון היה קשה ועמוס\nהשורה התחתונה: קורס נחמד אבל לפעמים מרגיש שטחי מדי והמבחן לא בנוי טוב", "timestamp": 1644249329882}, {"author": "aa", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ממוחזרים ועמוסים\n\nהמבחן: קשה מהרגיל\n\nהשורה התחתונה:", "timestamp": 1644249478486}, {"author": "מסווג חריג שבכס\"ל", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אילת טל\nחוות דעת - הרצאות:  רואים שיש פה מישהו שמנסה לפצות על משהו , כאילו קורס חשוב ומעניין מצד אחד מצד שני מועבר לא טוב . אפשר להחליף אותו בסרטונים של הודים ביוטיוב והוא יהיה יותר ברור . באופן דיי משעשע הדגש לפעמים בקורס הוא לא בישום או בפרקטיקה של האלגוריתם אלא בפורמליות ובחרטא של הפתרון . מעלה נשכחות וניחוחות של אינפי, במובן של אין מספיק פידבק על העבודות בית( שגם ככה ארוכים מידי) כך שבאמת נוכל לדעת מה אנחנו עושים נכון ולא נכון .\n\nשם המתרגל/ת: היו יותר מידי \nחוות דעת - תרגולים: סתם כמו תמיד יש טובים יותר וטובים פחות הכי טוב היה בן קרצו \n\nשעורי הבית: ארוכים בקטע מוגזם ולא פרופרצינאלי למגן והשפע על הציון סופי\n\n\n\nמלג לא מומלץ.\n\nהמבחן: \nהכנס GIF של גילגול עיניים \nהשורה התחתונה: מלג לא מומלץ בעליללל", "timestamp": 1644498202788}, {"author": "SF", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: מרצה אכפתי, אבל ההרצאות איטיות ומיותרות להחריד. לראות על X3 או לקרוא מצגות (אבל כן להבין את החומר וגם שטויות קטנות)\n\nשם המתרגל/ת: ניקי\nחוות דעת - תרגולים: מלך. ממש נותן משמעות לאלגוריתמים ועוזר להבין טוב דברים שנראים לא חשובים אבל אחר כך נדפקים עליהם\n\nשעורי הבית: גליונות יבשים כמעט כל שבוע, בזוגות, מלאים ב\"טריקים\" \n\nהמבחן: קשוח, הרבה טריקים ווריאציות על אלגוריתמים והבנה של מתמטיקה שמעולם לא הובהרה כמו שצריך, אבל מובן ופתיר למי שעובר על מבחנים לפני כן. עמוס מבחינת זמן.\n\nהשורה התחתונה: להכיר אלגוריתמים ומבנים ותצליחו במבחן", "timestamp": 1644583507178}, {"author": "סטונדט", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: אחלה מרצה מעביר את החומר בצורה ברורה ומובנת, בהתחלה ראיתי פרונטלי אבל עברתי לראות מוקלט על X2 כי רוב החומר בהרצאות לא באמת נחוץ ועדיין אורי מובן.\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: מסבירה טוב ולעומק הבעיה שהיא איטית מאוד לכן לא מספיקה את כל התרגילים בזמן וזה גורר תרגולים ארוכים יותר ותרגולי השלמה.\n\nשעורי הבית: ארוכים מאוד, 6-8 שאלות רובן ברמה של מבחנים לכן חשוב מאוד להשקיע ולהבין איך פותרים. ייתכן מאוד שתהיה שאלה מהגליון במבחן (במועד זה היה). מה שכן הכל מרופרנס (משנים קודמות או לחפש במבחנים).\n\nהמבחן: מאוד לחוץ בזמנים, אין שנייה לנוח ומלא בטריקים. בגדול אם עושים הרבה מבחנים אפשר להצליח עם ציון סבבה.\n\nהשורה התחתונה:", "timestamp": 1644947008497}, {"author": "חשמל", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איילת טל\nחוות דעת - הרצאות: \nהרצאות מיותרות איילת רק מתרגמת את ההרצאות \n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: \nמדהימה ומומלצת ללכת רק אליה!\nשעורי הבית: בזבוז זמן משווע! לא להשקיע את הזמן בשביל 15 אחוז תקף\nכשבודקים בסוף רק שאלה אחת בכל גיליון\n\nהמבחן: לא ריאלי מבחינת זמן\n\nהשורה התחתונה:", "timestamp": 1645023595872}, {"author": "גיא ג'מבה", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nאורי רוטנשרייך\n\nחוות דעת - הרצאות: \nההרצאות לא כל כך מעניינות, בעיקר בשתי שליש הראש של הסמסטר שחוזרים על אלגוריתמים ועוד כל מיני דברים שלמדנו במבוא למדמ\"ח. \nאורי מרצה בסדר, קשוב לשאלות ומכיר את החומר טוב.\n\nשם המתרגל/ת: \nניקי  דברשווילי \n\nחוות דעת - תרגולים: \nניקי מתרגל סבבה, תכלס כל המתרגלים מעברים את אותם המצגות די מילה במילה, אז תלכו למי שמסתדר במערכת.\n\nשעורי הבית: \nהזויים \nזה קורס של 3 נקודות טכניוניות, השיעורי בית הם 15 אחוז מהציון שזה לא הרבה בכלל. כמות העבודה שצריך כדי לפתור הזוייה, זה לוקח ימים ועל ממש מעט נקודות מגן. שיעורי בית \nמוגזמים לגמרי.\n\nהמבחן: \nהמבחן שלנו היה מחורבן ממש לדעתי, עם כמה סעיפים קשים. בכללי המבחנים ממש קשים והבדיקה של הצוות סופר קשוחה.\n\nהשורה התחתונה: \nקורס שרוב החומר כבר נלמד במבוא למדמ\"ח בתכלס, ובגלל זה לא מעניין כל כך. השיעורי בית מחורבנים לגמרי ולוקחים מלא זמן, אבל קורס חובה אז...", "timestamp": 1645734137309}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: מעביר סך הכל סבבה, ה-kahoot בסוף ההרצאה נחמד\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: משתדלת מאוד, מעבירה סך הכל סבבה, אבל היא איטית מאוד.\n\nשעורי הבית: לוקחים זמן\n\nהמבחן: חוץ משאלה אחת שאף אחד לא הצליח לענות היה סביר\n\nהשורה התחתונה: קורס שמועבר בצורה לא טובה פשוט", "timestamp": 1645976936211}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איילת\nחוות דעת - הרצאות: איילת היא המרצה האחראית בקורס אבל מה שאפשר להגיד עליה זה שהיא הכל חוץ מלהיות אחראית. לא ראיתי עוד קורס בטכניון על התנהלות מתחת לכל ביקורת כמו הקורס הזה. איילת לא עונה למיילים, כששואלים אותה שאלה על שיעורי הבית היא אומרת שאין לה מושג ומפנה אל המתרגלים ובשיעורים כשמבקשים לשאול שאלה אז כמובן שהיא אומרת שאין זמן ואם היא כבר עונה זה מאוד מאוד מינימלי ולא מספק. כמובן שלקהות תמיד יש זמן אבל לשאלות של סטודנטים מה פתאום.\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: פשוט מצוינת!!! מאוד יסודית, מאוד נחמדה ונעימה ותמיד עונה בהרחבה לשאלות. \n\nשעורי הבית: ארוכים ולא מצדיקים את האחוזי מגן העלובים של 15 אחוז שניתנים.\n\nהמבחן: ארוך ולא הוגן מבחינת זמן.\n\nהשורה התחתונה: אם הקורס לא חובה לא מומלץ בכלל ואם בכל זאת לוקחים אותו אז עדיף בסמסטר עם מרצה אחראי אחר.", "timestamp": 1646583567033}, {"author": "ת", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "תקראו ישר את השורה התחתונה\nשם המרצה: איילת\nחוות דעת - הרצאות: הרצאות ממש בסדר אבל לא יותר מבסדר, פשוט מקריאה את המצגת ומסבירה אותה שזה חשוב כי הפסאודו קוד מאוד לא ברור והם ממציאים שם מושגים ורעיונות על הדרך (הרבה דברים לא מוגדרים היטב בקרוס)\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: היא טובה, התרגולים נחמדים אבל אין קשר למבחן\n\nשעורי הבית: עמוסים ארוכים מייגעים ולא שווים את זה מבחינת נק'. כרגיל.\n\nהמבחן: המבחן בקורס הזה הוא בזיוני, אני לא יודע אם איילת מרכיבה את המבחנים אבל תחתיה המבחנים קשים יותר וממועד למועד הם נעשים קשים יותר ככה שכשאתה פותר את המבחנים של שנים אחורה ביחס לאחרונים הם פשוט בדיחה.\nבשאלות הקשות יותר (סעיפי ג') במבחן הקשר לחומר הנלמד בהרצאות/תרגולים הוא מקרי בהחלט וצריך להחזיק אצבעות שיהיה רעיון שכבר ראית במבחני עבר, אחרת הסיכוי שלך לפתור אותו הוא קלוש.\nבמועד ב' חורף 2021-22 ציון מקסימלי היה 87 מתוך כמעט 90 נבחנים, זה כבר אומר משהו על המבחן ההזוי הזה.\nבנוסף לכל זה הוא ארוך בצורה איומה ככה שאין מספיק זמן לחשוב+לכתוב כל מה שצריך, ועוד לא התחלתי לדבר על השאלות 4 ב' וג' שהן הכי הזויות- משנה לשנה רק התארכו ועכשיו כל שאלה כזאת היא עמוד קריאה שלם! רק לקרוא ולהבין מה כתוב לוקח 15 דק' כי הן שאלות מורכבות, שלא נדבר על לכתוב הכל.\n\nהשורה התחתונה: קורס בזיון אחד גדול, באמת החומר עצמו קליל לא מסובך ויכול להיות מהנה, רעיונות נחמדים באלגוריתמים. אבל מה לעשות שצריך שהממוצע הקשיח ישאר קשיח? אין קשר בין מה שנלמד למה שאתה נבחן עליו ובסופו של דבר נותנים לך ציון על סמך שאלות מונפצות שאני בטוח שגם אם נותנים אותם לסגל פעם ראשונה רובם לא יצליחו אותן במסגרת הזמן.\nלקבל 100 במבחן זה לא אפשרי. (כמובן שאין פקטור)", "timestamp": 1647258163680}, {"author": "1", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איילת טל\nחוות דעת - הרצאות: מרצה סבבה לגמרי, מעבירה את החומר כהלכה. בנוסף הייתי אצל אורי גם בכמה שיעורים וממה שהרגשתי גם הוא בסדר גמור.\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: לדעתי זו אחת המתרגלות הכי אכפתית ומקצועית שהייתי אצלה אי פעם, מאוד ממליץ, מסודרת מאוד, לא מפספסת אף פרט, ומתייחסת כמו שצריך לכל שאלה מצד התלמידים.\n\nשעורי הבית: השיעורי בית לא הגיוניים לקורס של 3 נק\"ז, לדעתי הם הרבה מאוד וגם עצם העובדה ש\"ממליצים\" להקליד מאוד מבזבזת זמן. סה\"כ השיעורים כן תורמים להבנה וליישום של החומר, ובנוסף גם מגיעה שאלת מבחן אז כדאי להשקיע למרות שזה ממש הרבה זמן השקעה.\n\nהמבחן: \nהמבחן לדעתי הוגן ברובו, מי שמתרגל הרבה ומשקיע לא אמורה להיות לו בעיה.\nהשורה התחתונה: \nקורס סבבה לגמרי, קצת לא תואם לכמות הנק\"ז שלו, אבל לדעתי בבסיסו גם מאוד חשוב.", "timestamp": 1647612951029}, {"author": "..", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: טל עדו\nחוות דעת - הרצאות: \nמסביר מעולה ונותן זמן לשאלות אולם לפעמים ההרצאה נהיית משעממת וקל לאבד אותו.\nשם המתרגל/ת: רועי רשף\nחוות דעת - תרגולים: \nמסביר מעולה ועונה לשאלות אבל לפעמיים לא מספיק לסיים את התרגול \nשעורי הבית: \nחשובים, כי רוב השאלות בעצם שאלות ממבחנים (יש רפרנס)\nהמבחן: \n4 שאלות כול שאלה 3 סעיפים הסעיף הראשון די פשוט סעיף שני דורש הרבה לתרגל ו סעיף אחרון הכי קשה \nהשורה התחתונה: \nקורס מעניין אך לא פשוט ועם מלא חומר", "timestamp": 1675871383759}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: פרונטלית בכמה פעמים שהייתי הוא היה מדבר די חלש אבל הוא ממש אחלה בהקלטות, שווה לנסות לראות אם זה עובד לכם.\n\nשם המתרגל/ת: אוראן\nחוות דעת - תרגולים: היא בדר\"כ מעבירה רק דרך הזום וגם יש לה הקלטות, מסבירה מעולה ונחמדה כלפי הסטודנטים. יש חומר שמועבר רק בתרגולים כמו חציון אז זהו חלק בלתי נפרד מהקורס\n\nשעורי הבית: הגשה בזוגות שהם 15% תקף מהציון הסופי (זהו לא מגן), היו 9 גליונות שהיה צריך להגיש רק 8 מתוכם. שאלות שהופיעו במבחנים בעבר אז כדאי לפתור גם בשביל לראות שאתם מצליחים לעקוב אחרי החומר. (הכמות עבודה ושאלות לא תואמות את ה15% אחוז אז תתכוננו להשקיע זמן על זה)\n\nהמבחן: בעיקרון 12 שאלות שהקורס מסיבה כלשהי אוהב להציג כ4 שאלות עם 3 סעיפים כל שאלה שלרוב אין שום קשר ביניהם. מתוכם 4-5 סעיפים של הרצת אלגוריתם/ידע מעמיק על אלגוריתם ספציפי שלא לוקחות יותר זמן. כל השאר זה כבר שאלות שצריך לבנות אלגוריתם בשביל מקרה/בעיה ספציפית עם המבני נתונים/ אלגוריתמים שנלמדו במהלך הקורס. מאוד מומלץ לפתור לפחות 12 מבחנים לפני בשביל להבין את הרעיונות והטריקים השכיחים.\n\nהשורה התחתונה: קורס חובה, חומר מעניין אבל צריך להשקיע לא מעט זמן", "timestamp": 1676880074152}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי (מוקלט)\nחוות דעת - הרצאות: הרצאות מוקלטות ממש טובות. אורי מסביר את החומר מעולה ולא כדאי לוותר עליהם ולהסתפק רק בתרגולים\n\nשם המתרגל/ת: אוראן (מוקלט)\nחוות דעת - תרגולים: אחלה מתרגלת וההקלטות שלה ממש טובות. תשימו לב לדקויות שמועברות בתרגול ותנסו כבר שם לפתח את החשיבה שנצרכת כדי לפתור את הבעיות שיש בסוף במבחן\n\nשעורי הבית: מאוד עמוסים. כל גליון מכיל מספר שאלות שברובם מתישות. אל תרפרנסו בלי לחשוב אבל לא לבזבז על גליון יותר משעתיים-שלוש.\n\nהמבחן: מירוץ נגד השעון. להספיק המון שאלות בזמן קצר יחסית. הטיפ כאן בעיני הוא להפסיק לראות כמה שיותר מבחנים ולחזור גם על רעיונות שעלו בשיעורי בית. בסופו של דבר כנראה במבחן תשמשו ברעיון שכבר ראיתם והשאלה היא רק האם תשלפו אותו מספיק  מהר.\n\nהשורה התחתונה: קורס ממש מעניין שקיים בהקלטות בצורה ממש טובה.", "timestamp": 1676880689602}, {"author": "א", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: מניאקים בערעורים, מאיימים לא לערער ומורידים בערעור , אם מבינים שהגיעו עוד נק ימצאו סיבה בסעיף אחר להגיד שאם לא מושלם לא חובה בכלל ניקוד חלקי \n\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: לא הוגן, ארוך \nהאמריקאיות מדגמיות מאוד וטעות קטנה תעלה הרבה\n\nהפתוחות אם מספיקים את כולן , מה שלא אחד לאחד הכי אופטימלי וכמו הרשמי בקושי יקבל 2 נק מ8 אם בכלל ואם תערערו גם את ה2 האלה יורידו. \n\n\nסגל קורס מתנשא \n\nחוץ מאוראן מתרגלת מצוינת \n\nהשורה התחתונה: חייבים להעיף את הקורס הזה למי שלא בתוכנה , \n\nהבנת האלגוריתמים חשובה לפיתוח חשיבה אבל איך שמועבר בזבוז זמן והורדת ממוצע אלא אם שורפים עליו זמן וגם אם כן לא מובטח שישתקף במבחן.", "timestamp": 1678918418352}, {"author": "Grades", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה:\nעדו טל \nחוות דעת - הרצאות: \nדי משמים ולא הרגשתי שתרם במיוחד, \nלקראת המועד ב' ראיתי הקלטות של אורי והן היו מעולות\n\nשם המתרגל/ת: \nבן קרצו\nחוות דעת - תרגולים: \nבאופן אישי מאוד אהבתי, לא בהכרח מסביר הכל הכי טוב אבל מאוד אכפתי כלפי הסטודנטים ונותן אקסטרה מצידו.\nבכללי הרגשתי שמבחינת סגל לקורס אין יותר מדי מה להציע\n\nשעורי הבית: \nארוכים וקשים עם הרבה רעיונות שרואים פעם ראשונה אז כמעט אי אפשר לעלות עליהם\n\nהמבחן: \nארוך ואין שנייה לנוח.\nחובה לעשות הרבה מבחנים ולעבור על התרגולים כי הרבה פעמים הרעיונות יחזרו על עצמם.\nבכללי מכסחים בבדיקה, כל טעות מינורית יכולה להביא לכך שיורידו לך חצי מהסעיף, צריכים להיות מאוד חדים.\nאצלי במבחן זה ממש הורגש, בכל המקומות שירד לי אז ירד על חוסר דיוק שסה\"כ הוריד לי מעל 10 נקודות במבחן שבדיעבד נפלו נטו על חוסר דיוק ולא על חוסר הבנה של מה שצריך לעשות או אחרת\n\nהשורה התחתונה:", "timestamp": 1678951199419}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורי \nחוות דעת - הרצאות: הוא מדבר מהר אבל חוזר על עצמו, אישית היה לי קשה להישאר אצלו פיזית כי החזרתיות הרדימה אותי, במקלט שלו ראיתי על יותר מהיר אז הייתי חייבת להתרכז כדי לקלוט מה הוא באמת אומר\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: מתרגל ממש טוב, מעביר את החומר בצורה מובנת ממש\n\nשעורי הבית: כבדים יחסית לקורס של 3 נקז\n\nהמבחן: המבחן ארוך פצצות, אישית לא הרגשתי שיש אפשרות לסיים אותו בזמן הנתון, ובעיני הוא לא הוגן רק מכך שהוא ארוך פיצוצים (הם אומרים 4 שאלות, אבל כל שאלה זה 3 סעיפים (חלקן עם תת סעיפים) שלא קשורים אחד לשני, אז בתכלס זה 12 עם סעיפים)\n\nהשורה התחתונה: לא מומלץ, אבל לא בחירה", "timestamp": 1679382171913}, {"author": "צוריאל ויזל", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהקלטות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהקלטות\nשעורי הבית: \nקשים ודי עמוסים יחסית לנק\"ז\nהמבחן: \nעמוס\nהשורה התחתונה: קורס קשה צריך לזכור טוב את החומר", "timestamp": 1683625758920}, {"author": "מון שרי (שרי כמו העגבניה)", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: במילה אחת משעמם. בשתי מילים משעמם מאוד. מה זה הקורס הזה...\n\nשם המתרגל/ת: בן קרצו\nחוות דעת - תרגולים: אחלה מתרגל, אוהב ממש את המקצוע ההזוי הזה. חמוד, ומובן מאוד. קרצו זה רומני לכל מי שרוצה לדעת. דברו איתו על עצים הוא מת על זה... \n\nשעורי הבית: לא משהו, עמוס וגם בזוגות. שאלות שהם לוקחים ממבחנים בדרך כלל. בכל מקרה, יש רפרנס להכל.\n\nהמבחן: כמו שאיזו גברת חכמה שאני מכירה אומרת - גועל נפש. שרי מה נסגר איתך? איזו הטרלה. די די כבר עם המרצים האחראים החדשים האלה שחושבים שהם צריכים לשנות הכל. תמחזרו קצת מה קרה?\n\nהשורה התחתונה: לא אהבתי.", "timestamp": 1690382671008}, {"author": "שוסי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: \nשרי מנסה לדאוג שכולם יבינו ולנסות ליצור אווירה טובה בכיתה. ראיתי הרבה ביקורות טובות עליה בקורסים אחרים. להגיד תאמת אני לא מבין על מה כל ה-hype. \nלדעתי היא מרצה באופן ממש משעמם - מדברת בקול חלש ומונוטוני ככה שצריך לשבת ממש מקדימה כדי לא להירדם (כמעט קרה לי בכמה הרצאות). אני עברתי על המצגות לבד והבנתי יותר ממה שהיא הסבירה בכיתה.\nשם המתרגל/ת: בן קרצו\nחוות דעת - תרגולים: \nבן מתרגל ממש טוב וחשוב לו שכולם יבינו את החומר. אבל כתוצאה מזה הוא מתעקב ממש על שאלות של סטודנטים ככה שיצא שלא סיימנו אף תרגול בזמן והיינו צריכים להשלים את שאר השאלות לבד.\nאך למרות זאת, אני נהניתי אצלו.\nשעורי הבית: \nיש 9 גליונות הגשה מהם צריך להגיש 8. הגליונות הם בזוגות אך למרות זאת הם ממש ארוכים ודורשים הרבה יותר זמן ממה שהם צריכים להיות עבור קורס של 3 נק\"ז.\nאבל השאלות הם ממבחני עבר ככה שמתחילים לתרגל שאלות ממבחנים ישר מהשבוע הראשון. יש רפרנסים להכל אבל מומלץ לנסות לפתור לבד כדי להבין טוב את החומר.\nהמבחן: \nעשיתי את שני המועדים.\nלפני מועד א תרגלתי בעיקר מבחנים מהשנים האחרונות מה שהתברר כטעות. שרי לקחה השראה ממבחנים ישנים (15-16) והיו שאלות ממש דומות לשאלות ממבחנים ישנים.\nלפני מועד ב תרגלתי גם מבחנים ישנים. במועד ב שרי הביאה שאלות די יצירתיות שלא ראיתי שאלות דומות להן במבחני עבר. הייתי שאלה אחת אולי שדומה לשאלות ממבחני עבר. אך למרות זאת, מי שמתרגל מספיק מבחנים ובאמת מבין את החומר יקבל ציון טוב.\nאם שרי המרצה האחראית אז מומלץ לראות כמה שיותר סוגי שאלות כי אין דפוס חוזר של שאלות אצלה.\nהשורה התחתונה: \nלדעתי החומר של הקורס מעניין מאוד ושהקורס מפתח חשיבה למרות שאני לא מבין למה הוא קורס חובה לחשמל. אך עם זאת, ההשקעה הדרושה בקורס זה לא פרופורציונאלית לכמות הנק\"ז שלו. בנוסף הרגשתי פער ניכר ברמה של ההרצאות והתרגולים למבחן.\nאבל לא בחירה אז אין ברירה לקחת.", "timestamp": 1695926089335}, {"author": "אדסחר דייקסטרה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: שרי \nחוות דעת - הרצאות: \nהייתי בכל הרצאות. ההרצאות עצמן משעממות נורא, לדעתי זה החומר עצמו ולא המרצה. שרי מסבירה בסדר אבל המון פעמים סטודנטים פשוט שואלים אותה שאלות שאמרה להן את התשובה קודם לכן וזה קורה בתדירות לא סבירה לדעתי ככה שההרצאה ממש לא זורמת. \nשם המתרגל/ת:  בן קרצו\nחוות דעת - תרגולים: \nבן חמוד ממש ורואים שהוא חולה על החומר של הקורס. שעה של תרגול ככה שזה לא כל כך אפקטיבי אבל בן עצמו אחלה מתרגל. \nשעורי הבית: \nיש גיליון אחד שאפשר לא להגיש אז יוצא שיש גיליון כל שבוע וחצי בערך. אצלנו היה קטע קצת מעצבן ששחררו את שני האחרונים ממש קרוב לסוף הסמסטר ככה שזה הקורס האחרון שסיימתי בו את שיעורי הבית. הם לא קצרים אבל לרוב יש רפרנס ובלי קשר לי ממש עזרו להיסגר על החומר שנלמד באותו שבוע. תעשו אותם ברצינות. \nהמבחן: \nמבחן כנראה הכי קשה שנתקלתי בו עד כה (מומלצת של חשמל עד סמסטר 3, כולל). לא אומר כדי להלחיץ אבל זו האמת. לדעתי כן קשה להיכשל בו אבל עוד יותר קשה להוציא ציון גבוה. עשיתי גם מועד א' וב' ובסוף סיימתי עם אחלה ציון אבל בתכלס ראיתי המון מבחנים ובכל קורס אחר ובמיוחד בקורס של 3 נקודות זה היה overkill לגמרי. הבדיקה במבחן דיי מכסחת אבל קיבלנו פקטור בשני המועדים 🤷🏼‍♂️ \nהשורה התחתונה:\nהקורס הכי קשה בשבילי שהיה עד כה. השאלות במבחן (לפחות אצלנו) היו לא ממוחזרת, אפילו לא רעיונית. מתוך 20 מבחנים בערך שפתרתי לא שאלו בחיים על אלגוריתם random select. לא אומר שמבחנים צריכים להיות ממוחזרים אבל דווקא בקורס כזה שצריך לפתור בעיות ביעילות, וגם לעלות על הטריקים בזמן מבחן הייתי מצפה שיהיו קצת פחות קשוחים. ממש לא מרגיש כמו קורס של 3 נקודות. צוות הקורס נראלי בטוח שזה הקורס הכי חשוב בתואר שלנו וקצת תופסים תחת.\nמה שכן, אם לומדים כמו שצריך אפשרי ביותר לקבל מעל 80. בהצלחה!", "timestamp": 1696541951216}, {"author": "בסטר בקסטר", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: שרי שירנולד\nחוות דעת - הרצאות: \nההרצאות לא הכי מעניינות בעולם לדעתי, יש מידי פעם הבלחות אבל הרוב הוא די יבש - מכירים את מבני הנתונים ואת האלגורתימים המרכזיים בקורס, אבל לדעתי צריך להעמיק אחרי זה הרבה באופן עצמאי כדי להבין באמת איך הכל עובד. \nשרי אחלה, חמודה ממש ומעבירה את החומר בצורה סבירה (ההרצאות יכולות להיות משעממות להחריד, ואצלה פרט להרצאה אחת זה לא קרה).\nשם המתרגל/ת:  אוראן - מוקלט\nחוות דעת - תרגולים: \nבמהלך הסמסטר היה לי קשה לצפות בתרגולים באופן רציף (המתרגל הפרונטלי היחיד שיכולתי ללכת אליו היה נורא), וזו הייתה טעות. התרגולים מכילים הרבה חומר שקריטי לדעת אחרי זה למבחן, ולא כדאי להזניח אותם. אוראל אחלה מתרגלת, ממליץ על ההקלטות שלה, אפשר גם לחפש בפנופטו (לפי מספר קורס) את ההקלטות החסרות.\n\nשעורי הבית: \nארוכים להחריד. הם כן מכילים שאלות ממבחנים אז הם חשובים, אבל היה לי קשה לשבת עליהם ברצינות במהלך סמסטר עמוס (לקחתי את הקורס בסמסטר 4, סמסטר עם 3 בחני אמצע). יש רפרנסים טובים, אבל אני ממליץ להתעמק בפתרונות כי הם מציגים קונספטים שחוזרים על עצמם במבחן.\n\nהמבחן: \nקשה מאוד לדעתי. יש במבחן שאלות מתנה (לדעת להשתמש באלגוריתם\\מבנה נתונים ספציפי) אבל גם שאלות שכמעט בלתי אפשרי לעלות על הפתרון שלהם. לתרגל כמה שיותר מבחנים, ללכת לשעות קבלה לפני הבחינה, ויהיה בסדר. רוב האנשים מקבלים ציון בין 85 ל75, וזה ציון אחלה ביחס למקצוע ולמבחן.\nהשורה התחתונה: \nקורס עם פוטנציאל מפוספס, אותי אישית לא ככ עניין ולפי חברים שכבר עשו, לא הכי רלוונטי לחשמל טהור. לחשמל תוכנה הוא חשוב.", "timestamp": 1696586403625}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רוטנשטרייך אורי\nחוות דעת - הרצאות: מדבר לאט רצח וחוזר על עצמו ממש, לי היה קשה להתרכז פיזית ולכן ראיתי אותו במוקלט במהירות של פי 2.5 וזה היה סבבה\n\nשם המתרגל/ת: בן קרצו\nחוות דעת - תרגולים: מסביר טוב\n\nשעורי הבית: מסייעים להבנת הקורס\n\nהמבחן: לא הוגן בכלל, הוא ממש ארוך ואין זמן לענות על הכל, הסגל מודע לזה אבל רוצה לשאול על כל החומר הנלמד ולכן בוחר להמשיך לעשות שאלות ארוכות עם סעיפים למרות שהמבחן לא מותאם לזמן שלו בכלל\n\nהשורה התחתונה: הקורס מעניין אבל קשה להוציא בו ציון טוב כי המבחן לא הוגן. אם אתם לא חייבים לקחת תתרחקו", "timestamp": 1705162349384}, {"author": "סטודנט ממושקל ומכוון", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: ההרצאות יחסית איטיות אבל החומר מועבר בהן בצורה טובה עם דוגמאות שמסבירות מצויין את החומר. אורי מרצה טוב אבל לפעמים הוא נתקע לרגע או נעצר על דברים שמרגישים טיפה שוליים.\n\nשם המתרגל/ת: יובל גרזון\nחוות דעת - תרגולים: הלכתי לבערך חצי מהתרגולים. ממה שהלכתי, הרוב הרגיש לא מאוד נחוץ אבל דיי נחמד כדי לעזור לפתח את החשיבה של הקורס. יובל מתרגל אחלה אבל אין לי באמת נקודת ייחוס כי הלכתי רק אליו.\n\nשעורי הבית: הגליונות לוקחים קצת זמן, אפילו עם שותף. חובה חובה חובה מוקלד, לא רק בשביל הבונוס אלא בשביל שיהיה קריא וברור. הגליונות זה החלק שממנו לומדים הכי טוב איך לפתור שאלות בנושאים השונים ועל מה צריך לשים דגש.\n\nהמבחן: לדעתי רוב האנשים מגזימים לגבי האורך של המבחן. הוא אכן לא קצר אבל ממש אפשר לפתור את כולו בשלוש שעות. תמיד יהיו שאלה או שתיים שדורשות יצירתיות מופרזת ואם מזהים אותן בזמן אז אפשר לדאוג לשאר המבחן קודם ואז לנסות לתקוף אותן כמו שצריך. \n\nהשורה התחתונה:  קורס חובה, מה לעשות. הוא יכול להיות מאוד מעניין ונחמד, בעיקר אחרי שקולטים מה שהוא מנסה להגיד.", "timestamp": 1715850085769}, {"author": "s", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איילת טל\nחוות דעת - הרצאות: מסבירה לא רע. אם יש לכם שאלה אפילו הכי קטנה באמצע הרצאה אז היא תקטול אתכם תזהרו מראש\n\nשם המתרגל/ת: רועי רשף\nחוות דעת - תרגולים: מסביר דיי טוב, אבל אם יש לך שאלה שהוא לא מעריך הוא יענה לא בצורה נעימה.\n בשעות קבלה הוא עוזר, בניגוד לחלק מהאחרים. אוראן ראיתי גם מוקלט חלק מהזמן והיא גם אחלה\n\nשעורי הבית: \nקשים וארוכים\n\nהמבחן: \nקשה וארוך. אין אמצע, או שהצלחת בול מה שהם רצו בתשובה, ואם הצלחת בערך עם אי דיוקים קלים זה שקול ל-0 ניקוד על השאלה שזה גם מבאס.\nהשורה התחתונה: קורס לא מובן", "timestamp": 1716557004755}, {"author": "דייקסטרה", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: בעיני מסביר מעולה ובעיקר טוב לאנשים שיש להם קצת ידע מקדים בנושא כי הוא מסביר יותר מהר טיפה למרות שיש לו הרבה חזרתיות\n\nשם המתרגל/ת: אוראן מוקלט\nחוות דעת - תרגולים: הבן אדם קסם מהלך במיוחד החיוך שלה והאווירה הנעימה שהיא משרה היא באמת נותנת המון טריקים שהשתמשתי בהם במבחן עצמו גם והיא מסבירה מהמם חוזרת על החומר תוך כדי התרגול ונותנת תחושה טובה באמת אני מאוד ממליצה\n\nשעורי הבית: ארוכים וקשים, לא להיתקע שנים על שאלה - לרפרנס!! ואם אין רפרנס זה כנראה שאלה שהייתה במבחן עבר לחפש\n\nהמבחן: סביר, כל המבחנים דומים תפתרו מספיק מבחנים ותהיו מוכנים\n\nהשורה התחתונה: בגדול קורס ממש מעניין ומגניב אני אהבתי אבל שימו לב שהוא יחסית עמוס במטלות", "timestamp": 1717104263363}, {"author": "מכווץ מסלולים", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: ההרצאות לא מעניינות במיוחד, אורי נחמד אבל הכי נוח לראות הקלטות במהירות כפולה כי לוקח הרבה זמן להגיע לפואנטה.\n\nשם המתרגל/ת: רן אלבז \nחוות דעת - תרגולים: לא משהו, אבל לא היו אלטרנטיבות הרבה יותר טובות לדעתי. \n\nשעורי הבית: ארוכים אבל חשובים. הרוב המוחלט של הגיליונות מורכב משאלות ממבחני עבר, ושווה לשבור עליהם את הראש כדי להיכנס לראש של הקורס.\n\nהמבחן: מועד א' היה סביר. מועד ב' היה יותר קשה. המבחנים כן פתירים ואפשר להוציא ציון טוב אבל קשה להספיק לפתור את השאלות בזמן. תפתרו כמה שיותר מבחני עבר ותקוו שיהיו שאלות פתירות.\n\nהשורה התחתונה: קורס חובה.", "timestamp": 1717596350851}, {"author": "דוד רוקוס", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי במוקלט\nחוות דעת - הרצאות: לדעתי אין טעם לבוא להרצאות, תראו מוקלט של אורי. אחלה הקלטה\n\nשם המתרגל/ת: אוראן בזום\nחוות דעת - תרגולים: אוראן מסבירה טוב והיא נחמדה, לפעמים היא איטית קצת ואז עושה תרגולי השלמה\nאבל העובדה שזה בזום איתה זה ממש נוח\n\nשעורי הבית: קשים, אבל חשובים לפיתוח הבנה בפתרון תרגילים\n\nהמבחן: המבחן לדעתי מאוד קשה. צריך לתרגל הרבה מאוד מבחני עבר, להבין את הסגנון שאלות, ורק ככה אפשר להצליח\n\n\nהשורה התחתונה: קורס מעניין אבל לא פשוט בכלל", "timestamp": 1717955258781}]}