{"posts": [{"author": "Alon Kaplan", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אבינועם קולודני\nחוות דעת - הרצאות: הוידאו ממש טוב, והוא מסביר באופן מעניין\n\nשם המתרגל/ת: ספיר ביטון\nחוות דעת - תרגולים: מתרגלת טובה, מעבירה את החומר בצורה סבירה. נראה ש 50 דקות תרגול בעיה רצינית במקצוע.\n\nשעורי הבית: שיעורי בית סבירים, לא קשים מדי ולא קלים מדי\n\nהמבחן:  לא מאוד מסובך, ארוך אבל אם מתרגלים מבחנים משנים קודמות אפשר להצליח יפה מאוד\n\nהשורה התחתונה: מקצוע מעניין אבל דורש השקעה", "timestamp": 1597822727496}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אבינועם קולודני (וידיאו ביוטיוב)\nחוות דעת - הרצאות: ההרצאות עם לוח גיר, המרצה מעולה ומסביר טוב.\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים: מתרגל תותח, משקיע ומשתדל להנגיש את החומר. \n\nשעורי הבית: יבש כל שבוע, ממוחזר. התרגילים דומים לסגנון שיש במבחן, לכן כדאי לעשות אותם.\n\nהמבחן: קצת עמוס, אבל זה עניין של תרגול. צריך לראות מספיק מבחנים ולהבין את הראש.\n\nהשורה התחתונה: קורס חביב, מזכיר קצת כימיה של תיכון. אין כמעט מתמטיקה - רק הבנה ותיאוריה.", "timestamp": 1597830948734}, {"author": "מי זה", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: איליה גויכמן ותמי בן יעקב\nחוות דעת - הרצאות: איליה מדבר מהר ולא מסביר מאוד ברור, הוא שמח לקבוע שעת קבלה פרטית ולהסביר, אז הוא הסביר טוב. תמי הייתה בבית והיא כותבת על הלוח ומיד מסתירה, מסבירה טוב אבל לדעתי עדיף לראות אותה בזום\n\nשם המתרגל/ת: ספיר ביטון\nחוות דעת - תרגולים: ספיר מסבירה בצורה ברורה, מתחילים כל תרגול בחזרה על החומר ובסוף עונים על שאלות ממבחנים\n\nשיעורי הבית: מסבירים טוב את החומר\n\nהמבחן: 3 שעות, חלק אמריקאי ועוד 2 שאלות פתוחות די קשות\n\nהשורה התחתונה: קורס שהיה יכול להיות יותר טוב אם לא היה בזום, לדעתי הוא יכול להיות מבין הקורסים הכי מעניינים", "timestamp": 1613294669728}, {"author": "א", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: איליה גויכמן\nחוות דעת - הרצאות: איליה מקצועי ומסביר טוב על אף שהוא מסביר יחסית מהר ונוטה גם להביא הסברים \"עמוקים\" יחסית\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים: דן מסביר מעולה. בהרבה תרגולים הוא חורג מהזמן אך זה מפני שחשוב לו להעביר טוב את מה שהוא מלמד. מתרגל מומלץ\n\nבעקרון יש גם עמודים לקריאה עצמית בתרגולים שחייבים לקרוא לבד ושואלים עליהם גם בתרגילי הבית וגם במבחנים\n\nשעורי הבית: ממוחזרים אך עוזרים להבנת הנושאים הנלמדים\n\nהמבחן: מועד א' יחסית קשה - בעיקר השאלות הפתוחות. בסמסטרים הקודמים המבחנים היו סבירים יותר\n\nהשורה התחתונה: נושאי הקורס מעניינים בסך הכול אך הוא צפוף ולטעמי מבחינת ההיקף, הוא יותר דומה לקורסים של 4-4.5 נקודות זכות", "timestamp": 1614004210282}, {"author": "שירי טל", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: ההרצאות טובות, הוא מסביר מעולה וכמעט ולא עושה השלמות. גם עושה שעות קבלה פרטיות במידת הצורך ובאמת רוצה לעזור.. הוא לא מפרסם את הסיכום שלו שזה קצת באסה אבל חוץ מזה הוא מעולה\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים:  הוא מעולההההה, מסביר ממש טוב! \n\nשעורי הבית: מרופרנסים ועוזרים להבין את החומר\n\nהמבחן: קשה מדי, אבל הבוחן אמצע קל יחסית ונותן מגן גבוה אז אולי זה מתקזז\n\nהשורה התחתונה:", "timestamp": 1614591464064}, {"author": "CB", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: קולודני (מוקלט)\nחוות דעת - הרצאות: מסביר מצויין, אמנם וידאו ישן ולוח עם גיר אבל ההסברים מאוד ברורים ונותן הרבה אנלוגיות שעוזרות להבין לעומק ולהפנים את החומר.\n\nשם המתרגל/ת: דן לירז \nחוות דעת - תרגולים: מתרגל מצויין, טיפה מבולגן ולוקח זמן מעבר לשעת התרגול (בצדק כי הקורס עמוס יחסית ל 3.5 נק\"ז). מאוד עוזר להבין את החומר שנלמד בהרצאות.\n\nשעורי הבית: כדאי!! עוזרים מאוד להבין את החומר. מרופרנסים. \n\nהמבחן: 8 אמריקאיות ו 2 פתוחות. דורש הבנה של החומר, עמוס לכן לפתור מספיק מבחנים. כדאי לעשות את בחן האמצע (10 אמריקאיות), נותן מגן טוב ולא קשה במיוחד.\n\nהשורה התחתונה: \nקורס מאוד מעניין.\nחשוב מאוד: דורש הבנה לעומק לא מספיק רק לתרגל.", "timestamp": 1617096977794}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: החומר עצמו די מעניין אבל לא מועבר בצורה מעניינת בכלל. המון חישובים ומתמטיקה מיותרת.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nגיליון פעם בשבוע. לא עמוסים אבל מעיקים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626375801209}, {"author": "לאה", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: איליה גויכמן\nחוות דעת - הרצאות: לא משהו בכלל. בעלות הרבה תקלות טכניות, הסברים לא מלאים, אווירה לא נעימה, אין עידוד השתתפות מצד הקהל, זלזול בשאלות והדבר הכי גרוע - כמה הרצאות השלמה. מי שאוהב פיתוחים מתמטיים ולהבין את הinternals של הקורס, עם קצת הומור משעשע ומסוגל לסבול את כל הדברים שמצוינים לעיל - go for it. אני נפלתי לקטגוריה הזו לצערי.\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים: הוא אחלה, אבל חייבים להשלים מהתרגולים הכתובים.\n\nשעורי הבית: הקורס התנהל בצורה קצת בזיונית בנושא. להשאיר 2 גליונות ל\"תרגול עצמי לפני המבחן\" כשלא הספיקו להכניס אותם בסמסטר כי היה איזה חודש ללא שיעורי בית: זה די בזיון. בכל מקרה יש לעשות את כולם. במבחן היו שאלות שמזכירות שאלות מגיליון 12.\n\nהמבחן: ממש לא טוב. באופן ספציפי היו 3 שאלות אמריקאיות שהסתמכו על קונספט שלא הוזכר/תורגל בקורס - קיבול צומת PN באות קטן. מילא זה, אך התשובות לא היו תואמות לתשובות האמיתיות. נכון ההבדל קטן מ5% כפי שהם מציינים בעמוד השער. אבל כשאת.ה רואה תשובות אמריקאיות מדויקות ואת מקבל.ת תשובות עשרוניות - את.ה פשוט מתרשמ.ת שאת.ה טועה. אני מאמינה שצוות הקורס מודע לבעיה, נקווה שתהיה התייחסות הוגנת מצד הקורס בנושא.\n\nהשורה התחתונה: אם יהיה לכם מזל תקבלו מבחן שבאמת יבחן אתכם ויהיה הוגן. הקורס לא עמוס מדיי, אבל כן דורש עבודה חזקה על הגיליונות. קורס עם פוטנציאל גבוה שיכל לעבור בצורה יותר מגניבה עם יותר הדגמות וסרטונים שיפתחו את האינטואציה. חבל מאוד.", "timestamp": 1627058242099}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אליה \nחוות דעת - הרצאות:  הרצאות מאוד תיאורטיות, חלק מהחומר לא באמת שואלים במבחן. לפעמים קשה לעקוב אחריו בהרצאות.\n\nשם המתרגל/ת: דן לירז \nחוות דעת - תרגולים: מתרגל מעולה. מסביר ממש טוב, מעמיק במה שצריך. תירגולים ארוכים מהרגיל אבל עובר לאט ומסודר על כל החומר שצריך.\n\nשעורי הבית: יבשים כל שבוע על החומר של התרגול, בעיקר שאלות ממבחנים. מבסס את ההבנה בצורה טובה.\n\nהמבחן: 8 שאלות אמריקאיות ו-2 שאלות פתוחות. מבחן לא קל אבל הוגן. שואלים על כל הנושאים בקורס.\n\nהשורה התחתונה: קורס עמוס מכיל הרבה חומר אבל אפשר להצליח בו.", "timestamp": 1627279800320}, {"author": "s", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: קולודני (מוקלט)\nחוות דעת - הרצאות: הרצאות טובות ומסביר את החומר טוב עם שרטוטים ואנלוגיות.\n\nשם המתרגל/ת: תרגולים כתובים\nחוות דעת - תרגולים: יש במודל תרגילים מסוכמים מאוד טוב שמכילים את כל החומר הרלוונטי. יש גם סדנאות שאפשר לצבור בהן מגן של עד 10 נקודות.\n\nשעורי הבית: גליון שבועי מרופרנס בזוגות. \n\nהמבחן: יש בוחן אמצע (10 אמריקאיות) פשוט יחסית שהוא מגן ונוסף על כך מבחן (8 אמריקאיות + 2 פתוחות) יחסית עמוס שבודק הבנה אבל דומה למבחני עבר.\n\nהשורה התחתונה: קורס מעניין שדורש הבנה וגם טכניקה.", "timestamp": 1631200028034}, {"author": "stav lotan", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: מאוד אוהב את הצד המתמטי אבל לדעתי מרצה טוב שעונה על כל שאלה החיסרון הוא שהוא מתערב הרבה פעמים על נושאים שלא בהכרח בחומר\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: מתרגל מעולה הכין מצגות משלו שמאוד עזרו ללמידה\n\nשעורי הבית: מרופרנסים עוזרים להבין את החומר \n\nהמבחן: הוגן חצי אמריקאי חצי פתוח \n\nהשורה התחתונה: מאוד אהבתי", "timestamp": 1633671092942}, {"author": "סטודנט כללי", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  אלכס חייט\nחוות דעת - הרצאות:  אלכס מעביר את החומר די טוב וסך הכל ברור.\n\nשם המתרגל/ת:  דן לירז לידזי\nחוות דעת - תרגולים: מתרגל מעולה!\n\nשעורי הבית: לא עמוסים מדי ובעלי רפרנס.\n\nהשורה התחתונה: קורס עם חומר מעניין אך לדעתי לא בנוי טוב וחסרה בו לא מעט בנייה ריגורוזית של דברים שמשתמשים בהם.", "timestamp": 1634564155530}, {"author": "לפלס", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: איליה מעביר את החומר טוב, אבל מדבר לא יפה לסטודנטים\n\nשם המתרגל/ת: דן לירזי\nחוות דעת - תרגולים: מתרגל מעולה, צריך לעבור ולקרוא את התרגולים הכתובים כי לא מספיקים הכל\n\nסדנאות: עמנואל\nחשוב להגיע, פותרים שאלות רלוונטיות לבוחן ולמבחן\n\nשעורי הבית: ארוכים אבל עוזרים להבין את החומר\n\nהמבחן: סיוט\n\nהשורה התחתונה: סגל נוראי, מבחן קשה\nמלג לא מומלץ.", "timestamp": 1649420049629}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: ראיתי הרצאות מוקלטות של קולודני, הן מכסות מהניסיון שלי כל מה שצריך\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יחסית קצרים אבל מלאים בחישובים ודי מעצבנים\n\nהמבחן: עוד לא היה, המבחנים שעשיתי כדי להכין היו ארוכים ומייגעים \n\nהשורה התחתונה: קורס חובה, אין מה לעשות. התוצאות מעניינות ומאוד חשובות אבל להתעסק עם זה מאוד מעצבן", "timestamp": 1658419196142}, {"author": "Anonymous", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אילייה\nחוות דעת - הרצאות: מרצה נחמד מאוד בתור בן אדם, הבעיה בקורס שיש הרבה הזנחות בפיתוחים שלא מספרים את הסיבה להזנחות. פשוט מקבלים את זה.\n\nשם המתרגל/ת: איתן קמינסקי\nחוות דעת - תרגולים: מתרגל ממש טוב\n\nשעורי הבית: עוזרים להבנה של החומר, לא ארוכים בדרך כלל\n\nהמבחן: היה קל יחסית\n\nהשורה התחתונה: כימיה תיכונית עם תוספות", "timestamp": 1658903723491}, {"author": "סטודנט/ית", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה:  איליה גויכמן\nחוות דעת - הרצאות: מרצה מעולה. מסביר את החומר בהתלהבות ובצורה מעניינת. כותב על הלוח ולא משתשמש במצגות, בניגוד למרצה השני. לי זה היה מאוד נוח.\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים: ראיתי את המוקלטים מלפני כמה סמסטרים של דן לירז. מתרגל מעולה. מבהיר את החומר בצורה טובה ונותן אחלה דגשים\n\nשעורי הבית: לא קשים. עוזרים מאוד בהבנת החומר. מי שרוצה להצליח בקורס חייב לעשות אותם כמו שצריך.\n\nהמבחן: 8 אמריקאיות, 2 פתוחות. האמריקאיות הן על כל החומר והן מאוד מבלבלות. הפתוחות הן בעיקר על חומר של המחצית השניה של  הסמסטר. צריך להיות מאוד חד על החומר ולפתור כמה שיותר מבחני עבר. \n\nהשורה התחתונה: יש סדנאות שניתן לצבור בהן עד 10% מגן ובוחן אמצע שנותן סביבות 20% מגן. ככה שניתן לקבל מגן יפה מאוד. כדאי ללמוד טוב טוב לבוחן. זה מאוד עוזר להתפקס על החומר ולבסס את כל מה שנלמד עד אותו שלב. \nעבורי הקורס היה מאוד מעניין ומעשיר.", "timestamp": 1658998756520}, {"author": "יהונתן שולדבראנד", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nאלכס חייט\nחוות דעת - הרצאות: \nאלכס מרצה טוב מאוד. מעביר את החומר בקצב טוב, ובצורה יחסית מעניינת, חוזר בתחילת כל הרצאה ומוודא הבנה. שואל את הסטודנטים הרבה שאלות לוודא שכולם איתו (וחוזר אחורה אם צריך). בנוסף, אלכס שם המון דגש על לתת אינטואיציה במהלך ההרצאות, שזה מאוד חשוב כי הרבה מהמבחן/בוחן על זה.\n\nשם המתרגל/ת: \nאיתן קמינסקי\nחוות דעת - תרגולים: \nאיתן מתרגל מצויין. איתן הכין מצגות בעצמו, במקום התרגולים של הקורס. המצגות שלו מצויינות והרבה יותר מקיפות ומובנות מהתרגול הרגיל של הקורס. בקיצור ממולץ.\n\nיש גם סדנאות של עמנואל בר, אני כמעט אף פעם לא מגיע לסדנאות, אבל הסדנאות של עמנואל מעולות. הוא גם כותב הרבה מהמבחן והבוחן ונותן טיפים מכוונים לזה בצורה מצויינת.\n\nשעורי הבית: \nהשיעורים ארוכים, במיוחד בשביל 10%, אבל בסוף כל גליון הרגשתי שאני מבין הרבה יותר טוב את החומר,שווה לעשות בצורה רצינית. \nיש גם 10% מגן על שאלונים בסדנאות, 10% קלים מאוד להשגה (זה בעצם לראות שבאתם לסדנה), תלכו ותקבלו אותם.\n\nהמבחן: \nהמבחן עצמו קשה. יש 2 שאלות פתוחות שדי דומות לשאלות שאלות שיעורי בית, ויש 8 אמריקאיות. האמריקאיות ברוב המבחנים מונפצות מאוד וחלקן שואלות על דברים מאוד ספציפים ומוזרים בחומר שהופך אותן למאוד קשות. \n\nדווקא אצלנו הן האמריקאיות היו קשות, אבל בל הרבה הנפצות. היה לנו גם במועד א' ממוצע מאוד מאוד גבוה אז לא יודע כמה זה מייצג.\n\nיש בוחן על 25% מגן. שווה מאוד ללמוד אליו כי לדעתי הבוחן באופן משמעותי קל מהמבחן ויכול לתת אחלה מגן למבחן היחסית קשה בד\"כ במקצוע הזה.\n\nהשורה התחתונה: \nקורס מעניין מאוד, שמרות שהוא \"רק\" 3.5 נקודות, יוצא שלומדים המון. מתחילים מהיסודות של כימיה (כלל אוקטט) ומסיימים באיך עובדים טרנזיסטורים המודרנים. הקורס למספר הנקודות האקדמי שלו דורש יחסית הרבה השקעה, אבל הוא שונה מאוד מכל מה שהיה עד עכשיו ולדעתי לומדים בו המון דברים מעניינים.", "timestamp": 1659550486999}, {"author": "1", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: אני קצת חלוק לגבי הדעה שלי אליו כי מצד אחד הוא יודע להעביר את החומר אבל לפעמים הוא גם יכול להסתבך קצת ולהתעמק קצת יותר ממה שצריך ואז זה יוצא טיפה לא ברור ואז הכל מתחרבש... אבל סה\"כ לדעתי הוא כן יודע להעביר את החומר ומי שקשוב כמו שצריך יבין כל מה שצריך למבחן.\n\nשם המתרגל/ת: איתן קמינסקי + – דן לירז \nחוות דעת - תרגולים: איתן הוא מתרגל מעולה, מעביר את החומר בצורה ברורה ומובנת אומנם קצת מהר בגלל לחץ של זמן וכמות חומר די גדולה... אני במהלך הסמסטר עברתי לראות את דן במוקלט והוא גם מתרגל מעולה! מעביר את החומר בצורה רגורוזית וברורה ומאוד מתאים למי שכן רוצה להשקיע איזה חצי שעה אקסטרה בתרגול אבל להבין קצת יותר לעומק.\n\nשעורי הבית: די חשובים בשבילכם לראות איך אתם על החומר, יש רפרנסים להכל. כדאי לעשות ולהשקיע.\n\nהמבחן: המבחן יחסית בינוני, מלא טריקים ונקודות שצריך לשים לב אליהם אבל סה\"כ סביר.\n\n**טיפ שלי אליכם** אני הפסקתי ללכת לסדנאות מאמצע הסמסטר ואני חייב להגיד לכם שלא הרגשתי חוסר בכלום (גם בציון), אז אם אומרים לכם שהסדנאות הם הכרחיות להצלחה בקורס אז אני שובר פה את האמירה הזאת ויכול להגיד לכם שאתם יכולים להצליח גם בלי הסדנאות בוודאות.\nכמובן שכדאי תמיד ללכת אם זה מסתדר לכם... \n\nהשורה התחתונה: בהצלחה!", "timestamp": 1664516090061}, {"author": "Hili", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המתרגל/ת:  איתן \nחוות דעת - תרגולים:  תרגולים מדהימים, עובד עם מצגות מאוד מובנות שמכין בעצמו וממש רואים את ההשקעה שלו. ממליצה מאוד!\n\nשעורי הבית:  פעם בשבוע פחות או יותר, לא עמוס מדי\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1666191685568}, {"author": "סטונדט 0", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: מעביר את החוצר בצורה מעניינת, רואים שהוא מבין את כל החומר ואוהב אותו.\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: מתרגל מצוין!\nגם המוקלט של דן מעולות.\n\nשעורי הבית: ארוכים\n\nהמבחן: מבחן הוגן (ניגשתי למועד ב), שאלות פתוחות לא קשות (אולי קצת ארוכות עם חישובים מיותרים). אמריקאיות קלות ברובן לפעמים שאלה אחת על נושא שולי.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1667397747071}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: איליה \nחוות דעת - הרצאות: הפסקתי ללכת, ראיתי את אבינועם קולודני ביוטיוב. מעביר את החומר בצורה מאוד טובה!\n\nשם המתרגל/ת: איתן קמינסקי\nחוות דעת - תרגולים: מתרגל מאוד טוב, נחמד ואכפתי .\nהמצגות שלו מעולות!\n\nשעורי הבית: גיליונות יבשים כל שבוע, קצת מתיש אבל יש רפרנס להכל. ממליצה להבין ממש טוב כי החומר הולך ונהיה מורכב יותר.\n\nהמבחן: ארוך , חלק אמריקאי ו2 שאלות פתוחות. מרגיש שאין כל כך זמן. אבל אם לומדים היטב אפשר להוציא ציון טוב\n\nהשורה התחתונה: קורס מאוד מעניין אבל קשה.", "timestamp": 1668894049068}, {"author": "MMM", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: המרצה באמת בא עם מוטיבציה למשוך אנשים לתחום ולכן מקפיד מאוד על שעות קבלה ועושה את החומר מעניין עם דוגמאות של שימושים במלמ וגם העשרה.\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: מעביר את החומר טוב ויודע לענות על השאלות.\n\nשעורי הבית:סבירים ,רלוונטים להצלחה בבוחן ומבחן. \n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס חובה חשוב להמשך.", "timestamp": 1675791477570}, {"author": "נעם", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליאור קורנבלום\nחוות דעת - הרצאות: \nבאיזשהו שלב החומר נהיה מאוד לא ברור ונדרשה המון למידה עצמית בבית כדי לספק הסברים מספקים.\nניכר שליאור עשה מאמץ להנגיש את החומר אבל בשורה התחתונה לא הצליח.\n\nשם המתרגל/ת: איתן קמינסקי\nחוות דעת - תרגולים: איתן העביר את התרגולים, חלקם עבורי לא היו ברורים, בעיקר בסוף הקורס. נראה שלמתרגלים יש הרבה חומר לדחוס ב50 דקות אבל זה לא עובד.\nעמנואל בר העביר סדנאות, כמו תרגול נוסף. עמנואל מלמד מדהים, עונה לכולם בסבלנות והכל באווירה טובה.\n\nשעורי הבית: הגשה שבועית מעיקה.\nלא כ\"כ רלוונטיים למבחן.\n\nהמבחן: מאתגר, דורש המון למידה בצורה לא פרופורציונלית ל3.5 נק\"ז.\n\nהשורה התחתונה: קורס קשה. הרצאות + תרגולים + סדנאות + מטלות לקריאה עצמית ועדיין רחוק מאוד מלהגיע לרמת ההבנה הנדרשת במבחן.", "timestamp": 1678392311772}, {"author": "מלמ מנוון", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: אמאל'ה איזו נסיכה!!!!! רוצו אליה אם היא מלמדת. היא מסבירה ממש טוב, כותבת הכל מילה במילה על הלוח, יש רשימות שלה בדרייב, היא קורעת מצחוק ותסביר מיליון פעם עד שתבינו. בקיצור היא הסיבה היחידה שאני יודע משהו על מלמ. \n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: מסודר ומסביר מעולה, אחלה מצגות\n\nשעורי הבית: הרוב לא כזה רלוונטי לתכלס מה ששואלים במבחן אבל חשוב לעשות להבנה, אם אני לא טועה זה איזה 15%\n\nבוחן: בוחן קליל שמעלה ממוצע, אצלנו על כל שאלה נכונה נתנו 2% מגן נוסף בציון 100, היה אפשר לצבור 20% מגן בציון 100. בכללי ממש טוב כי יושבים ללמוד את החומר הזה באמצע סמסטר שהוא דיי חשוב.\n\nהמבחן: מבחן מסריח, בוויב סטייל ספרתיות עם תקרת זכוכית ב80.\nבמועד א' היו אמריקאיות מונפצת ופקטור של 3 נק, במועד ב מועד יותר סבבה פקטור של 6 נקודות\n\nהשורה התחתונה: חובה אז עושים, המבחן מוציא חשק מהקורס הזה.", "timestamp": 1679338708190}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליאור קורנבלום\nחוות דעת - הרצאות: פעם ראשונה שהוא מרצה, אין שקפים מסודרים בהרצאות דבר שמאוד חסר כשרוצים לחזור על החומר או ללמוד למבחן. מרצה טוב סך הכל, מנסה ליצור אווירה נחמדה בהרצאה.\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: שם הבנתי את החומר ומה רוצים בקורס הזה. המצגות של התרגולים הרבה יותר טובות משל ההרצאות. היו סדנאות של עמנואל שגם עזרו. בתכלס זה עוד שעה תרגול והוא נותן טיפים ודגשים חשובים\n\nשעורי הבית: גליונות מרופרנסים. יש גם בחני סדנה ששווה לעשות זה מוסיף למגן.\n\nהמבחן: חצי אמריקאי חצי פתוח. המבחן שלנו היה הוגן לדעתי אם לומדים טוב מוציאים ציון טוב והמגן מוסיף הרבה לציון. יש בוחן אמצע של 20 אחוז שבשבילו שווה להשקיע לפחות בחצי הראשון של הקורס\n\nהשורה התחתונה: הרבה אומרים שהוא משעמם, אולי בגלל שהייתי עם ליאור בהרצאות הוא הרגיש קצת יותר מעניין. לא עמוס יותר מדי וגם החומר לא מאוד קשה. אפשר להצליח במבחן אם לומדים לאורך הסמסטר בצורה סבירה", "timestamp": 1679952395717}, {"author": "SHBC", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: מעבירה את ההרצאות באנגלית, יש רשימות יחסית נוחות בדרייב. לדעתי קצב ההרצאה היה קצת איטי ותמי כמעט לא נותנת זמן לשאול שאלות, אבל ההרצאה יחסית מעניינת ונותנת אינטואיציה טובה לחומר\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים:  ממש אחלה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689244475365}, {"author": "Yaniv Slor Futterman", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: מרצה מציונת. מדברת באנגלית. קורעת מצחוק וגם מסבירה טוב. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה סך הכל\n\nהמבחן: \n\nהשורה התחתונה: בינוני. החומר היה משמעם והועבר בצורה לא טובה. לא הסבירו מאיפה דברים הגיעו והרגיש שהיה הרבה שינון של משוואות בלי הבנה עמוקה מספיק...", "timestamp": 1689771813347}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: אם אתם רוצים שיהיה לכם כיף ואשכרה תבינו את החומר תלכו אליה. מדברת באנגלית פשוטה ולפעמים מכניסה כמה מילים בעברית (מבינה את רוב השאלות ששואלים אותה בעברית), אבל רק אם באמת קשה עם אנגלית חבל לוותר עליה.\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: הוא בסדר בסך הכל, הוא מאולץ להעביר חומר שמעבירים בהרצאה בשלוש שעות תוך שעה בודדת - לא המכון הכי טכנולוגי. הוא כן מנסה להעביר את התרגול ככה שכולם יבינו ומתעקב על דברים ששואלים אותו לטוב ולרע. יש הקלטות של דן לירז שהם אחלה אלטרנטיבה.\n\nסדנאי: עמנואל\nחוות דעת - סדנאות: עשה בסך הכל 12 סנדאות שבהם הוא פותר מספר תרגילים ברמה של מבחן ואפילו יותר גבוהה וממש מפתח את ההבנה של החומר. בתחילת 10 מתוך ה-12 סנדאות יש בחנים של 3 שאלות פשוטות שכל בחן מהווה מגן של 100 בגודל של 1% (הוא עובר בינארי). גם בחור מצחיק אז היה נחמד לסיים איתו את השבוע\n\nשעורי הבית: 10% תקף מהציון הסופי. היה 10 גיליונות והיה צריך להגיש רק 8. כל גיליון בין 4 ל-5 שאלות ברמה די גבוהה, כדאי לנסות לפתור אבל אין סיבה לשבת על זה סתם יותר מידי זמן.\n\nבוחן: היה בוחן אמצע של 10 שאלות אמריקאיות לא כל כך קשות. אם מקבלים יותר מ-60 כל שאלה שווה ל-2% מגן של 100 (מגן מצטבר יעני)\n\nהמבחן: מועד א' לדעתי היה סביר, אם פותרים 10 מבחנים מבינים אות רוח השאלות ולא הרבה אמור להפתיע לאחר מכן.\n\nהשורה התחתונה: קורס חמוד, סגל אחלה. שעורי בית לא משהו. עכשיו הגיע הזמן לגדל סיליקון לבד ולגרום לתמי להיות גאה.", "timestamp": 1690379401187}, {"author": "אמבטוקם", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: \nשיטת ההוראה של אלכס היא שונה מרוב המרצים שראיתי לטכניון, יש כאלה שמתחברים יותר ויש כאלה שפחות, אני אישית ממש אהבתי. בזמן ההרצאה הוא שואל את הסטודנטים הרבה מאוד שאלות, וככה כל הזמן מוודא הבנה. לדעתי זה עוזר לך להיות על הדברים, וזה הופך את ההרצאות ליותר מעניינות ומועילות. החומר במקצוע היה מעניין, במיוחד שמגיעים להתקנים בחצי השני של הקורס.\n\nשם המתרגל/ת: איתן קמינסקי\nחוות דעת - תרגולים: \nאחלה מתרגל, עונה על שאלות ומסביר את הכל. התרגולים בד\"כ התחילו מ15-20 דקות של חזרה על החומר התיאורטי (חשוב מאוד לדעתי במקצוע) והשאר היה בפתרון שאלות. התרגולים בקורס הם רק שעה אבל חשוב להגיע. בנוסף, לדעתי שווה ללכת לסדנאות (מעבר למגן שהן נותנות) כי בתכלס הן נותנות עוד שעה תרגול, וצריך את זה במקצוע הזה\n\nשעורי הבית: \nגיליון שבועי להגשה בזוגות, יש רפרנס אבל שווה לעשות לבד כדי להצליח לעשות שאלות אחרי זה (השאלות בגיליונות הם בערך ברמת המבחן, לפעמים קצת יותר קשות). לקח בין 3 ל5 שעות בממוצע.\n\nהמבחן: לא קל אבל בסה\"כ היה הוגן במועד שלנו. במבחנים הראשונים הם קשים כי לא מכירים את כל העקרונות של ההתקנים, אבל אחרי 7-8 מבחנים מתחילים לראות שאלות שחוזרות על עצמם.\nיש גם בוחן אמצע, לדעתי שווה ללמוד כי הוא שווה פוטנציאלית מגן מאוד גבוה + הוא סוגר אותך על החצי הראשון של הקורס בצורה ממש טובה שעוזרת במבחן אחרי זה.\n\nהשורה התחתונה: \nאחלה של קורס, אחלה סגל, חומר מעניין, מבחינתי זה היה הקורס הכי מוצלח בסמסטר 4", "timestamp": 1690895565853}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תמי בן יעקב\nחוות דעת - הרצאות: תמי מרצה מעולה - מסבירה באופן מסודר, עם ציורים ועונה להרבה שאלות. גם מצחיקה אז יש אווירה כיפית בהרצאות. \nהייתי בהרצאה אחת של אלכס בתחילת הסמסטר- התרשמתי שההבדל המרכזי בניהם הוא שאלכס יותר נכנס לפיתוחים המתמטיים של הנוסחאות, ושתמי שמה יותר דגש על אינטואיציה.\n\nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: התרגולים קצרים מדי ביחס לכמות החומר בקורס. איתן מתחיל ממעבר של כרבע שעה על החומר (תלוי נושא) ואז עובר לתרגול שאלות. התרגולים חשובים ומאוד מסדרים את החומר.\nבשקופיות המוסתרות במצגות של איתן מופיעים הרבה פעמים הפיתוחים המתמטיים של הנוסחאות - זה סגר את רוב מה שהיה חסר לי מההרצאות. כדאי לעבור, עוזר להבין מאיפה דברים מגיעים.\n\nשעורי הבית: גליונות כל שבוע בערך, 4-5 שאלות. הגשה בזוגות. הגליונות עמוסים ואפילו מעיקים, אבל כן עוזרים להבנה של החומר.\n\nהמבחן: השאלות הפתוחות הוגנות וברוב המקרים משקפות טוב את הנקודות המרכזיות בקורס. לדעתי השאלות האמריקאיות הרבה פעמים לא הוגנות, אבל אינטואיציה והבנה טובה של החומר יכולה לעזור מאוד.\n\nהשורה התחתונה: קורס מאוד מעניין, שמצריך הרבה הבנה. חשוב להיות על החומר במהלך הסמסטר אחרת קל לאבד את זה בהרצאה. ללומדים מספרים - ספר הקורס \"Solid State Electronic Devices\" של Streetman יכול לעזור מאוד.", "timestamp": 1691318699032}, {"author": "בחור מסוג P", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תמי בן יעקב\nחוות דעת - הרצאות: אמנם תמי מרצה באנגלית וזה נשמע מרתיע בהתחלה, אבל היא די מובנת, נותנת אינטואציה טובה לקורס שרובו אינטואיציה.\nמצד שני ההרצאות מקיפות קצת יותר מדי, ובתרגולים גם ככה חוזרים על הדגשים הרלוונטיים. \n\nשם המתרגל/ת: ארי רוזוב \nחוות דעת - תרגולים: ארי מתרגל לעניין, לא מעבר. התרגולים מאוד עמוסים, ברובם עוברים על תיאוריה מחדש ואז נשארות 5 דקות בסוף לכמה תרגילים מסכנים. התרגול האמיתי הוא בסדנה.\n\nשעורי הבית: לא ארוכים, ממוחזרים, יש רפרנס להכל\n\nהמבחן: די הוגן, חצי אמריקאי חצי פתוח. חלקו גם ממוחזר.\n\nהשורה התחתונה: קורס עם הרבה חומר, אבל ברגע שמבינים מי נגד מי, הרוב מתחיל לחזור על עצמו ואין מה לחשוש. יש בוחן אמצע שאני ממליץ ללמוד אליו כמו שצריך, ככה שגם אם מתחילים לאבד את הקורס לפחות יש בסיס טוב.", "timestamp": 1691444936869}, {"author": "a", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אלכס/תמי/אבינועם\nחוות דעת - הרצאות: \nגם אלכס וגם תמי עם רצון טוב.\nאלכס מרצה לא טוב, מצגות לא מובנות, ניסיתי ללכת אליו ולהישאר אבל זה היה בלתי אפשרי ולא רלוונטי.\nלתמי יכולתי להגיע רק לשעתיים בגלל התנגשות במערכת בשעה השלישית. בסה\"כ היא בסדר אבל קשה לסנכרן אותה עם אבינועם ולהבין מה רלוונטי ומה לא מההרצאות שלה ככה שבסוף עברתי לאבינועם מהיוטיוב-אם לא מפריע לכם איכות של לפני 30 שנה בסרטונים הוא אחלה ממש ומסביר מצוין, רק שווה לראות מה רלוונטי לקורס.\nשם המתרגל/ת: ארי\nחוות דעת - תרגולים: \nסך הכל מתרגל בסדר גמור, לא הסתדרתי כל כך עם איתן ואצלו הצלחתי להבין יותר. יש גם את הסדנאות שהן די חובה כי בתרגול לא באמת מתרגלים, והן גם נקודות מתנה למגן.\nבאופן כללי רק התרגולים והסדנאות באמת רלוונטים למבחן.\nשעורי הבית: \nיש רפרנסים מלאים בדרייב, כן שווה לעשות לבד כי הם תורמים להבנה של החומר (רובם, חלק קצת מעיקים).\nהמבחן: \nמלא טריקים מעצבנים שאם מתרגלים מספיק ועם מגן טוב אפשר להוציא ציון בסדר גמור.\nהשורה התחתונה: \nקורס עם פוטנציאל להיות ממש מעניין וטוב, אבל מועבר ומנוהל על הפנים.", "timestamp": 1691583646627}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלכס \nחוות דעת - הרצאות: \nראיתי אולי 5 הרצאות במהלך הסמסטר והפסקתי ללכת כי לא הצלחתי להתרכז במשך 3 שעות רצוף. לא השפיע על הציון שלי, אבל אם אתם יכולים לכו להרצאות זה יחסוך לכם זמן, לי לקח קצת יותר זמן להבין את החומר כי לא הלכתי להרצאות. \nשם המתרגל/ת: איתן\nחוות דעת - תרגולים: \nאיתן מתרגל טוב, עונה על כל השאלות וסך הכל סבבה. התרגולים קצרים לפי דעתי ויש המון חומר. בתרגולים מעבירים מצגות אבל התרגולים המועלים למודל מאוד מאוד טובים אני למדתי למבחן מהם ולפי דעתי זה היה מספיק, קצת ארוכים ומלאים חומר אבל מכסים הכל.\nלא קריטי ללכת לסדנאות.\nשעורי הבית: \nבזוגות אז סבבה, יש רפרנס.\nהמבחן: \nהוגן אבל יכול להיות קשה, חשוב להבין את החומר טוב מאוד ולקרוא את התרגולים טוב טוב. צריך לשנן הרבה דברים. אבל בסך הכל אפשרי.\nהשורה התחתונה: קורס נחמד אבל מלאאאאא חומר.", "timestamp": 1691657341806}, {"author": "5", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חייט אלכסנדר\nחוות דעת - הרצאות: מעניינות בסך הכל, אפשר לראות את ההקלטות, אין שוני רב.\n\nשם המתרגל/ת: קמינסקי איתן\nחוות דעת - תרגולים: אחלה מתרגל, לפי דעתי מתעקב קצת יותר מידי על החומר התיאורטי וצריך לפתור יותר תרגילים. מי שמרגיש שצריך חיזור להבנה, ממליץ עליו.\n\nשעורי הבית: גליונות יבשים בלבד,  אחת לשבוע בממוצע, מרופרנסים. נעשים בזוגות\n\nהמבחן: לא היה קשה לפי דעתי, 8 שאלות אמריקאיות ושתי שאלות פתוחות. במועד א שלנו הפתוחות היו ממש לא קשות. אם תמי היא אחת המרצות, ממליץ להתאמן על ציור של רמות פסי אנרגיה, קבוע היא כותבת שאלה פתוחה שסובבת סביב זה.\n\nהשורה התחתונה: אחלה קורס לפי געתי, מכיר לך את העולם של המוליכים למחצה.", "timestamp": 1692014316783}, {"author": "עבדאללה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: לא ראיתי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: לא זוכר, אבל עמנואל מהסדנאות היה מושלם.\nחוות דעת - תרגולים: \n\nשעורי הבית: \nכיף חיים\nהמבחן: \nחרא בלבן\nהשורה התחתונה: \nסבבה של קורס", "timestamp": 1705346058530}, {"author": "יובל", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: זה סמסטר אחרון שלה אז הפסדתם, מרצה מצוינת וכיפית. יש את אלכס, אני פחות התחברתי כי הוא קצת ממהר, אבל אם עוצרים אותו הוא מאוד שמח להסביר שוב ולעומק.\n\nשם המתרגל/ת: איתן קמינסקי\nחוות דעת - תרגולים: חביב ביותר, המון רצון טוב ושולט בחומר.\n\nשעורי הבית: קצת מעמיסים, לוקח ערב אחד מהשבוע.\n\nהמבחן: הסמסטר היה מבחן קשה. לרוב הוא יותר קל. אפשר לקבל ציונים טובים!\n\nהשורה התחתונה: קורס מעניין וחביב", "timestamp": 1715427024377}, {"author": "לא חשוב", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תמי\nחוות דעת - הרצאות: המרצה הכי נחמדה שפגשתי , מסבירה בצורה מעולה ומתייחסת לסטודנטים כמו ילדים שלה\n\nשם המתרגל/ת: מוקלט של דן לירז\nחוות דעת - תרגולים: מתרגל מצויין ששולט בחומר היטב\n\nשעורי הבית: מרופרנסים\n\nהמבחן: מועד א שלנו היה אכזרי, הממוצע מדבר בעד עצמו ! אבל בד\"כ ניתן להוציא אחלה ציון.\n\nהשורה התחתונה: קורס מאוד מעניין !", "timestamp": 1715685549940}, {"author": "BAD BITCH", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שעורי הבית: \nמרופרנס\nהמבחן: חרא של מבחן\n\nהשורה התחתונה:  \nהקורס עצמו כיפי עם חומר מובן, הכל טוב עד שמגיעים למבחן, שם יש שאלות מכשילות בפרט האמריקאיות איקסססססס\nמומלץ לפתור הרבה מבחני עבר ולהעמיק את ההבנה כי השאלות לא פשוטות.\n\nטיפ קטן: תשקיעו בבחן אמצע ובציוני המגן כי יצילו אותכם בהמשך.", "timestamp": 1716483385109}, {"author": "eren yeager", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "השורה התחתונה: \nמצליחים בגדול <--> יש לכם אינטואיציה טובה מאוד", "timestamp": 1716721078352}, {"author": "מוסי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר תמי בן יעקב 3>\nחוות דעת - הרצאות: מהממת, באסה לכם שהיא כבר לא מרצה. עזבה אותנו לטובת עמק הסיליקון, לקחה קצת יותר מידי ברצינות את שם הקורס...\n\nשם המתרגל/ת: דן לירז מוקלט\nחוות דעת - תרגולים: בסדר, נראה לי עדיף ללכת פרונטלי.\n\nשעורי הבית: בסדר סך הכל, גיליון כל שבוע, יש רפרנס להכל הם ממחזרים אחושרמוטה. מעיק קצת להקליד ואם אתם עושים בעצמכם וגם כי זה כל שבוע הגשה.\n\nהמבחן: כל כך לא מכבד. איכס\n\nהשורה התחתונה: מתחיל נחמד, מעניין, אני סך הכל אהבתי את הקורס אבל דופקים קטע במבחן וזה הורס את הכל. בהתחלה חשבתי אולי לקחת שרשרת מיקרו-ננו אבל המבחנים ממש ממש הרסו לי את החשק לזה....", "timestamp": 1717944967799}]}