{"posts": [{"author": "שלומי ברדה", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: -\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \n\nשעורי הבית: \nש\"ב דומים לשל שנים עברו\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597948044414}, {"author": "&", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אריה פויאר \nחוות דעת - הרצאות: אריה מעביר את הקורס מלא זמן, הוא יודע את ההרצאות בעפ ואת החומר ממש טוב. הוא די משעמם ולא קל לשמור על ריכוז במהלך ההרצאות. \n\nשם המתרגל/ת: דן לירד לידזי\nחוות דעת - תרגולים: מתרגל ממש טוב, משקיע, הכין מצגות לכל אחד מהתרגולים. התרגול הוא רק שעה אז דן כמעט תמיד \"גנב\" עוד זמן בשביל להספיק לסיים את התרגול. \n\nשעורי הבית: ארוכים, לא מאוד קשים אבל לוקחים זמן. יש רטוב במאטלב ובסימולינק. \n\nהמבחן: אריה עבר למבחן מסוג של שאלות קצרות כאשר הוא בודק את התשובה בלבד וכמעט לא מתייחס לדרך. לא הצורה הכי טובה להערכת ידע אבל זה מה יש. צריך להיות חד על כל החומר (הרצאה + תרגולים) כי הוא שואל הכל מהכל. \n\nהשורה התחתונה: \nקורס נחמד, מעביר בצורה טובה מה נדרש מבקרה בסיסית של מערכות אבל לא תורם המון. מרגיש כמו חובה לכל מי ששואף להיות אי פעם אחראי על מערכות גדולות ומורכבות אבל אם זה לא המצב אז רחוק מלהיות חובה או הכרחי, מה שלומדים באותות ומערכות כנראה די מספיק.", "timestamp": 1615736314994}, {"author": "P.", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: פרופ' אריה פויאר\nחוות דעת - הרצאות: ההרצאות של אריה סבירות. \nהחומר מועבר תוך העמקה יחסית, כך שאם חשוב לכם להבין את החומר להמשך החיים - אריה מעביר אותו בצורה שיכולה להועיל.\nעם זאת, ההרצאות והדגשים של אריה במהלכם, אינן מועילות למבחן הסופי בשום צורה שהיא - ולמעשה זה בעיקר בזבוז זמן ללכת להרצאות שלו אם המטרה היא להוציא ציון גבוה בבחינה ולשכוח מהקורס הזה לתמיד.\n\nשם המתרגל/ת: חן באר\nחוות דעת - תרגולים: התרגולים מעוברים בצורה סבירה, בעיקר החלק של החזרה על החומר מההרצאה בתחילת כל תרגול.\nגם במקרה זה, הדוגמאות בתרגולים בנויים על תרגילים עם מערכת מסויימת עם הרבה סעיפים (אשר תואמים למבנה הישן של הבחינה). \nבנוסף, הרמה של הדוגמאות שניתנות בכיתה לרוב בסיסית מאוד, ואת הסעיפים היותר מורכבים לא פותרים (מקוצר זמן או כל סיבה אחרת) - ופשוט חן כותבת את התשובה הסופית ומסבירה את העיקרון שעומד מאחורי השאלה (בד\"כ זה הסעיפים שלא מספיקים בתרגול ונדחקים ל-5 דקות האחרונות של התרגול).\nבשורה התחתונה, התרגולים מסייעים בהבנת החומר אבל לא מסייעים בהכנה למבחן כמעט בכלל.\n\nשעורי הבית: \n5-6 תרגילים לאורך הסמסטר כולל כמה סעיפים רטובים בכל תרגיל בית. רמת עומס בינונית.\n\nהמבחן: \nלפני מספר סמסטרים המבחן הסופי עבר לפורמט של 12 שאלות בשעתיים או 20 שאלות בשלוש שעות (כתלות בקורונה), במקום 3 שאלות גדולות מרובות סעיפים כפי שהיה עד אז.\nלכל שאלה במבחן יש כ-10 דקות לפתרון, ולא מדובר בשאלות אמריקאיות אלא שאלות שדורשות פתרון מלא (אם כי לא תמיד יש דגש על הנימוק - תלוי שאלה).\nבמצב הזה המון סטודנטים פשוט לא מספיקים לראות את כל השאלות במבחן ולראייה הממוצע ירד בצורה דרסטית.\nבסמסטר שלי הממוצע של המועד ב' היה 59 עם 40% נכשלים.\n\nהשורה התחתונה:\nאם אתם לא מעוניינים להיות מהנדסי בקרה בעתיד, תעשו לעצמכם טובה ענקית ואל תקחו את הקורס הזה. \nאני לקחתי את הקורס מתוך עניין בתחום של בקרה והוא נחשב לי בתור בחירה פקולטית.\nיצא שקיבלתי ציון סופי בקורס שנמוך ב-25 נקודות מהמממוצע תואר שלי. \nתהיו חכמים ואל תעשו את זה לעצמכם גם.", "timestamp": 1617624434516}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אריה\nחוות דעת - הרצאות:   אריה איש מקסים, מעט מפוזר, אבל שולט בחומר. הרגשתי שההרצאות מיותרות, ראיתי את כולן על פי 2.5 בפנופטו\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: \nחן מקסימה, מאוד מסודרת, תמיד ממלאת את הלוח לפני השיעור, ועוברת מסודר על כל החומר של דפי התרגול.\nשעורי הבית: \n\nהמבחן: \nהרבה יגידו שזה קורס קשה, ממוצע נמוך, ולא עוזר למי שלא רוצה להכנס לתחום. \nאני לא מסכים כל כך. שיעורי בית היו  5 יבשים מתוך 6. יכולים לקחת יום אם מקלידים, חצי יום אם לא, ובסוף כל אחד יש משחקי סימולינק/מטלב שיכולים לקחת חצי שעה אם אתה טוב ושעה אם אתה פחות טוב.\nכולם היו מלמדים וממוחזרים \nיש ארסנל שלם של מבחני עבר לחזור עליהם, והקושי היחיד שהרגשתי בבחינה אפילו לא היה קושי זמני אלא נטו טעויות חישוב ושטויות של מהירות.\n\nמי שלומד טוב , מבין את החשיבה ומתרגל הרבה תרגילים -  יצליח. המבחן היה נטו טכניקה, ושליטה בחומר שהועבר בתרגולים ובשב, והיו סטודנטים שראיתי יוצאים מחדר הבחינה אחרי שעה וחצי (לא שפויים). לא מאמינים? תסתכלו בהיסטוגרמה כמה קיבלו מעל 90 (לא מעט).\n\nהממוצע נמוך בגלל טעויות חישוב שיכולות להרוס לך שאלה שלמה (משקל גדול לכל שאלה), לכן ממליץ בסוף המבחן כשנשאר זמן, לחזור על הכל ולחפש אם עשית שטויות\n\nבמידה וישנו לכם חזרה למבחן של 20 שאלות קצרות, תבדקו באותו רגע ואל תנסו להוכיח חישובים כי זאת לא המטרה במחבנים מהסוג הזה ואתם סתם תבכו מול השעון.\n\nהשורה התחתונה: קורס מאוד טכני, אני מאשר. :)", "timestamp": 1627414314763}, {"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: אריה מרצה ותיק ומנוסה. מעביר את הנושאים היטב.\n\nשם המתרגל/ת: חן בר\nחוות דעת - תרגולים: מאוד מסודרת ומסבירה טוב.\n\nשעורי הבית: לא קשים מדי וחוזרים על עצמם.\n\nהמבחן: בסך הכול לא קשה מדי - רצוי לפתור הרבה מבחנים כדי לתרגל את הפרקטיקה ואת סוגי השאלות השונים שיכולים לשאול.\n\nהשורה התחתונה: קורס נחמד ומעניין. עם מספיק תרגול לקראת המבחן, אפשר להצליח בקורס הזה.", "timestamp": 1646734046198}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה:  אריה פויאר\nחוות דעת - הרצאות: \nאותן הרצאות שהיו ב20 שנה האחרונות במקצוע בלי הרבה שינוי, לא בהכרח עוזרות בפתירת תרגילים אך נותנון הבנה כללית יותר של המקצוע, דיי מונוטניות.\n\nשם המתרגל/ת: ליאור בר\nחוות דעת - תרגולים: \nמתרגל מעולה, מסביר את החומר בצורה מצויינת ופותר כמה תרגילים שאפשר בתרגול של שעה אחת.\nשעורי הבית: \nהחלק של המאטלב מרגיש קצת מיותר, חוץ מזה השאלות המתמטיות הן פשוט שאלות ממבחנים.\n\nהמבחן: \nמבחן לא כזה פשוט כמו שמציגים פה, למרות הרבה תרגול של מבחנים שונים המבחן שתיגשו אליו תלוי באריה ואיך הוא קם באותו בוקר, אפשר לשים לב מפתירת מבחנים משנים עברו שחלק קלים מאוד וטכנים וחלק דורשים יותר חשיבה.\nבנוסף לזה אין הקלת ראש בטעויות חישוב וכד' (בעייתי מכיוון שהמבחן אלגברי ברובו), בדיקה מאוד קפדנית. \n\nהשורה התחתונה: \nאם התחברתם באותות ומערכות לכל החלק של משוואות מצב, תרשימי בודה, ודיאגרמת נייקויסט, ובנוסף לזה אתם ממעטים לעשות טעיות חישוב, הקורס הזה הוא בשבילכם ונכנס לעומק בנושאים כאלה ואחרים.\n\nאם לא, הייתי ממליץ לקחת קרס אחר שאתם יותר מתחברים אליו, כי לא כזה פשוט להוציא פה ציון גבוה, כמו שחלק מאמינים.", "timestamp": 1663842451663}, {"author": "אנון", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: \nאריה מרצה הרבה שנים והוא ממש מובן, יש גם וידאו שלו שהוא מעביר את אותו חומר למי שמעדיף ללמוד כך.\nשם המתרגל/ת: ליאור בר הלל\nחוות דעת - תרגולים: \nמתרגל מצוין, מסביר ממש טוב ומספיק הרבה בזמן הקצר שניתן לתרגול (שעה)\n\nשעורי הבית: \n5 מתוך 6, יבשים עם חלק קטן של מאטלאב בסוף, מומלץ מאוד לעשות את שעורי הבית, הם לא עמוסים ובד\"כ ממבחנים כך שהם תרגול טוב\nהמבחן: \n5 שאלות שלכל אחת 20 נק, המבחן די טכני ואריה נותן מבחנים ממש הוגנים \nהשורה התחתונה: \nקורס יחסית קליל שאפשר להוציא בו ציון די טוב, מומלץ", "timestamp": 1666295011701}, {"author": "ע", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: יש הקלטות בפנופטו, לא ממש מעניינות. \n\nשם המתרגל/ת: דן לירז )יוטיוב(\nחוות דעת - תרגולים: מתרגל טוב, החומר כבד ודורש עיבוד. רוב התרגולים לא מסתיימים בשעה המוגדרת אז צריך לקחת את זה בחשבון\n\nשעורי הבית: 6 תרגילים, נדרש להגיש 5 מתוכם. הרוב ממבחני עבר/שנים קודמות. התרגילים ברמה גבוהה ודורשים זמן אבל מכינים טוב לנושא.\n\nהמבחן: ארוך וקשה, ממש לא כמו שתיארו פה, יש הרבה סעיפים מכשילים שפחות דובר עליהם לאורך הקורס. \n\nהשורה התחתונה: דורש השקעה רבה, והמבחן קשה וארוך. ממש לא ציון קליל. יש הרבה חומר והוא מאוד כבד, הגיוני לקורס של 4 נק אבל חשוב לציין.\nלמי שהתחבר לחלק של בקרה באותות ומערכות )נייקוויסט, בודה, PID( יכול להיות טוב ונכנס לעומק של מה שדובר שם, למי שלא עדיף למצוא אופציה אחרת.", "timestamp": 1691042948794}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אריה \nחוות דעת - הרצאות: מרצה טוב, קצת משעמם, חוזר על החומר אם צריך, עונה לשאלות. ההרצאות חשובות להבנה וגם יש כמה נושאים שלא מועברים בתרגולים שכן שואלים עליהם במבחן כמו PID\n\nשם המתרגל/ת: דן מוקלט ביוטיוב \nחוות דעת - תרגולים: ממש טובים \n\nשעורי הבית: צריך להגיש 5 גיליונות מתוך 6. הרוב המוחלט זה שאלות ממבחנים ולכן כן חשוב לעשות אותם (חובה בכל מקרה) \n\nהמבחן: 5 שאלות פתוחות, דומה למבחני עבר. ברובו טכני אבל גם צריך להבין את חומר טוב. קל מאוד לטעות באלגברה ולכן חשוב לחזור על הפתרון.\n\nהשורה התחתונה: אם התחברתם לנושאים של מרחב מצב/PID/בודה וכו מאותות ומערכות ורוצים להבין את הנושאים יותר לעומק וללמוד שיטות תכן בקרים, אז ממליץ. אך חשוב לציין שזה לא קורס קל כפי שנאמר פה וכן צריך ללמוד היטב.", "timestamp": 1691080935506}, {"author": "לא כיף", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאריה-לב  זהב, אכפתי ורוצה ליצור עיניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא הייתי, אבל שעות קבלה לחומר שלא יושב מספיק \nשעורי הבית: \nמשקפים מבחן אבל ארוכים\nהמבחן: \nהוגן\nהשורה התחתונה:", "timestamp": 1692631344301}, {"author": "1", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: ההרצאות בחלקן מעניינות עד שמגיעים לקטעים חישוביים ומעברים מתמטיים שטסים עליהם והם ממש לא מוסברים אבל גם לא ממש חשובים בשביל להצליח למבחן, כן הייתי ממליץ להגיע להרצאות, ולהבין את העקרונות כי הם חשובים אבל לא להתעמק יותר מדי בהוכחות וכו'...\n\nשם המתרגל/ת: דן לירז (תרגולים מוקלטים)\nחוות דעת - תרגולים: תרגולים מעולים! פשוט אין מילים! אמנם לפעמים התרגולים לא תואמים לדפים של השנים האחרונות אבל החומר שלו זה בול אותו חומר המועבר במהלך הסמסטר ומוסבר אפילו יותר טוב מהדפים ומההרצאה.\nבנוסף יש את רון אופיר שהוא גם אחלה גבר אבל אין לו מוקלטות.\n\nשעורי הבית: ארוכים מאודדדדד, אבל מאוד עוזרים להיות על החומר.\n\nהמבחן: מבחן טיל, יש שאלה מכשילה של 10 נק' שרק אם אתם ממש אלופים אז תפתרו אותה ואם לא אבל למדתם מספיק טוב והרצתם מבחנים אז תקבלו 85-90. \n\nהשורה התחתונה: קורס מאוד מומלץ, חלקו מעניין חלקו פחות, לצערי אין נגיעה מעניינת בבקרה, זה יותר המשך של אותות.", "timestamp": 1703788437525}, {"author": "Dan Aronin", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: ארוכות ומשעממות, כאשר סוף סוף מגיעים לדוגמא היא כל כך ארוכה ומסורבלת שלא תורמת כלום להבנה.\nהחומר עצמו מוסבר טוב בחלקו התיאורטי.\nלא אתייחס להוכחות של משפטים שהן כבר רחוק מהמובן והרצוי.\n\nשם המתרגל/ת: דן לירז\nחוות דעת - תרגולים: הקלטות מעולות עם הסברים מפורטים.\n\nהשורה התחתונה: המשך ישיר של אותות ומערכות, מומלץ ביחס לשאר קורסי הליבה, אל תצפו לרכוש ידע בבקרה אחריו.", "timestamp": 1703788962437}, {"author": "לידור זינו", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אריה פויאר\nחוות דעת - הרצאות: \nענייניות סה\"כ. אפשר ללמוד מההקלטות, הן זהות בחומר לנלמד בכיתה, אך לא תמיד באותו קצב.\nכדאי ללכת לפרונטליות למי שרוצה להבין מעבר ללפתור את המבחן.\n\nשם המתרגל/ת: אלעד שרוני\nחוות דעת - תרגולים: \nמתרגל מעולה, לדעתי אם אתם צריכים לבחור בין יותם לאלעד עדיף אלעד\nכל תרגיל מוסבר פשוט ולעניין, באופן בהיר. האופן שהוא מסביר בתרגול זה בדיוק מה שצריך למבחן. לא נכנס לתאוריות ומשוואות שלא מועילות.\nשעורי הבית: \nלא קשים מדי, לפעמים צריך לרפרנס.\nהמבחן: \nמי שהיה על החומר במהלך הסמסטר ולמד לפחות 3 ימים ידע לפתור את המבחן\nהשורה התחתונה: \nקורס מומלץ לכל אחד\nלא צריך שרשרת שלמה כדי להעלות את הממוצע", "timestamp": 1715175599112}]}