{"posts": [{"author": "D", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא עמוס, 4 תרגילי בית יבשים במהלך הסמסטר\nהמבחן: \nניתן להוציא ציון מאוד גבוה בקלות. מבחן טכני\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1612344365277}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  פרופ. חבר יואש לברון\nחוות דעת - הרצאות: הרצאות סבבה, יואש מרצה ממש נחמד, מתעכב ומסביר אם משהו לא מובן\n\nשם המתרגל/ת: גפן בן יוסף\nחוות דעת - תרגולים: קצרים נותנים מה שצריך\n\nשעורי הבית: 4 תרגילים יבשים, בממוצע 4 שאלות\n\nהמבחן: טכני, בלי התחכמויות, מה שנלמד בהרצאות ותרגולים\n\nהשורה התחתונה: אחלה קורס, מעניין למי שרצה לדעת איך עובדים ממירי מתח, וחשוב למי שרוצה להיכנס לתחום", "timestamp": 1612779405667}, {"author": "G", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יואש\nחוות דעת - הרצאות: הרצאות מעניינות, מעביר רק את מה שצריך לדעת ורקע רלוונטי ומעלה סיכומים להכל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 4 גליונות לא ארוכים מדי, ברמה של שאלות מהמבחן ולהגשה בזוגות. בערך יום עבודה לגיליון\n\nהמבחן: 2 שאלות באותו סגנון של שיעורי הבית ועם חומר פתוח.\n\nהשורה התחתונה:", "timestamp": 1612983361660}, {"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יואש\nחוות דעת - הרצאות: יואש נחמד מאוד ואחלה מרצה, נותן את מה שצריך \n\nשם המתרגל/ת: שי \nחוות דעת - תרגולים: אחלה של מתרגל אבל אפשר גם לקרוא את התרגולים לבד \n\nשעורי הבית: 4 יבשים קלילים, 15% מגן \n\nהמבחן: הסמסטר קצת הגזימו לדעתי ועלו ברמה\n\nהשורה התחתונה: קורס חביב", "timestamp": 1648472088242}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  יואש לברון\nחוות דעת - הרצאות: מרצה מדהים, המרצה הכי טוב בפקולטה.  מעלה הקלטות מסטסמרים קודמים, מעלה גם את החומר והוא ממש אחלה, סופר ברור ומובן. בנוסף לכך, החומר שמועבר פיזית\\שמועבר בהקלטות\\שנמצא בדפים זהה לחלוטין, כך שאתם יכולים ללמוד איך שנוח לכם. בכל זאת ממליץ להגיע להרצאה פיזית.\n\nשם המתרגל/ת: שי בורנשטיין\nחוות דעת - תרגולים:  מתרגל טוב, שולט בחומר. \n\nשעורי הבית: 4 גיליונות יבשים קצרים, לא עמוסים בכלל, מלמדים , 15% מגן.\n\nהמבחן: הוגן, בוחן הבנה והוא זהה לשיעורי הבית ולמבחני עבר\n\nהשורה התחתונה: אחד הקורסים הכי טובים בפקולטה, שילוב נדיר של חומר מעניין שמועבר בצורה טובה, סגל שמתחשב בסטודנטים, שיעורי בית הוגנים, מבחן הוגן ובהחלט ניתן להוציא ציון גבוה. ממליץ בחום", "timestamp": 1676023291420}, {"author": "Yuval Avruch", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יואש\nחוות דעת - הרצאות: אין מרצים כאלה בטכניון!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמרופרנסים\nהמבחן: \nהוגן\nהשורה התחתונה:", "timestamp": 1676370623683}, {"author": "ל.ב.", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nיואש תותח! חומר מאורגן וברור. כמו כן, הקורס סופר מעניין בפני עצמו. נותן ראייה רחבה על התחום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nשי מסביר מעולה, תרגולים מובנים ובאורך מתאים.\n\nשעורי הבית: \nשיעורי בית נוחים לפתרון שמאפשרים באמת לתרגל את הנאמר בכיתה. \n\nהמבחן: \nמבחן הוגן.\n\nהשורה התחתונה: \nקורס ממש מומלץ למי שרוצה לקבל ראייה רחבה יותר על עולם החשמל. סגל שרוצה בהצלחת הסטודנטים! ישר כח!", "timestamp": 1676445597341}, {"author": "Daniel Stümler", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: מרצה מצוין, ראיתי את ההקלטות. \n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: תרגולים קצרים ומאוד ממוקדים, שי מעביר אותם מעולה. \n\nשעורי הבית: לא עמוסים, יש רפרנסים \n\nהמבחן: מבחן טכני והוגן מאוד. \n\nהשורה התחתונה: מומלץ בחום. חלק מהחומר לא מאוד מעניין אבל יש דברים נחמדים גם. קורס פקולטי מרים ממוצע עם אחלה סגל.", "timestamp": 1678279085755}, {"author": "Tom", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: \nמאוד מעניין (למי שאוהב את התחום), יואש מסביר הכל בצורה ברורה ואינטואיטיבית, עם דגש על הנדסה ולא רק תיאוריה.\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: \nמתרגל טוב, מסביר באופן מובן, למרות שהתרגולים טכניים מדי, וקל לאבד אותו בזמן פיתוחים ארוכים.\nשעורי הבית: \nמרופרנסים, אם פותרים את שיעורי הבית באופן חכם (לא להעתיק על עיוור) הרבה אסימונים נופלים, והם מאוד עוזרים להבין את החומר, ומאוד רלוונטים למבחן\nהמבחן: \nאם אתם שולטים בחומר, אין סיבה לא להוציא ציון מאוד גבוהה\nהשורה התחתונה: \nאחלה קורס, מאוד ממולץ!", "timestamp": 1678878440497}, {"author": "-.-", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יואש\nחוות דעת - הרצאות: אפשר לבוא להרצאות\\לראות מוקלט זה זהה, יואש כן מרצה טוב בעיני והחומר מועבר בצורה ברורה\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים:  התרגולים היו טובים, אבל לרוב הם קצרים וחבל של מוסיפים אליהם עוד תרגילים\n\nשעורי הבית: ארבעה גיליונות יחסית פשוטים ולא לוקחים יותר מידי זמן.\n\nהמבחן: \nכאן הקורס נופל, לדעתי הסמסטר המבחנים היו יותר קשים וגם יותר מכשילים. בגדול נראה שיואש החליט להעלות את הרמה בקורסים של הספק ולעתי זה גם מתבטא בציונים. הבעיה העיקרית שבמבחני עבר הרמה קצת יותר נמוכה ואי אפשר כבר להתכונן על פיהם. \n \nהשורה התחתונה: בגדול לדעתי החומר מעניין, והוא גם לא מאוד מסובך, תכלס יש כמה עקרונות שהולכים על פיהם לרוב וזהו. מצד שני בהרגשה שלי יש כאן ניסיון להוריד את הממוצע, אז אם צריך כדי לסגור שרשרת הספק אני עיין ממליץ, אבל להיות חדים על פתירת מבחנים ולשאול כל דבר שלא מובן כי שי ויואש פחות נכנסים לדקויות שיש במבחנים.", "timestamp": 1716989674426}, {"author": "Fuck you yoash", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יואש\nחוות דעת - הרצאות: מקצוען\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: תותח\n\nשעורי הבית: \nקלילים ועוזרים להבנה\nהמבחן: \nגועל נפש! המבחן עצמו קל עד שמגיעים לבדיקה, מכסחים בבדיקה, מורידים את כל הניקוד על טעות קטנה בחישוב, אם התשובה הסופית שלך לא כמו הפתרון הרשמי, הלך עליך. \nרמה בינונית של מבחן.\nהשורה התחתונה: הקורס קל ללמוד ולהבין, אבל הציונים ממש לא, הבדיקה מגעילה.", "timestamp": 1717060630700}, {"author": "חזאי לא אופטימלי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nיואש, מרצה טוב, מאוד נחמד\n\nשם המתרגל/ת: \nשי, אחלה\n\nשעורי הבית: \n4 גיליונות לדעתי, 15%, לא עמוס מידי וחשוב להבנה של החומר\nהמבחן: \nאל תקחו את הקורס הזה בהתבסס על היסטוגרמות קודמות, הוא הפסיק להיות הוגן בגלל המבחן. המבחנים ב2023 ו2024 נהיו ממש קשים וטריקיים וניכר שיש רצון להקשות ולהוריד את הממוצע. אני מניח שרוב הסטודנטים (היו 190 אצלנו) נרשמו כי ציפו לקורס הוגן מיואש אבל התאכזבו לגלות קורס פקולטי קלאסי עם מבחן ממש מסריח. מה גם לא היה בכלל פקטור. עכשיו אם היה מספיק מבחנים ברמה הזאת היה אפשר באמת להתכונן לרמה, אבל בגלל שהמבחנים הישנים לא רלוונטים ושאין מספיק מבחנים אי אפשר באמת להתכונן לזה...\n\nהשורה התחתונה: \nלא הייתי ממליץ יותר בקיצור", "timestamp": 1717141489937}, {"author": "BAD BITCH", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "המבחן: אם תטעה במינוס, הלך עליך חצי מהציון. \nטעות בחישוב? הלך עליך הכל.\n\nהשורה התחתונה: קורס חרא עם מבחן חרא ובדיקה יותר חרא, תשקלו לקחת אותו, הוא כבר לא \"קורס קל\" \nהם הופכים את הקורס לקשה מאוד להשגת ציון טוב.", "timestamp": 1717425570859}, {"author": "נוחי דנקנר", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: לא הלכתי להרצאות, ממליץ לפתור את הגליונות איך שהם יוצאים בצמוד לפידיאף של ההרצאה והתרגול ולשכוח שהקורס קיים עד הגליון הבא\n\nשם המתרגל/ת: לא הלכתי לתרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: מלמדים ומכינים למבחן\n\nהמבחן: מועד א' היה קליל, יצאתי אחרי שעה וחצי וקיבלתי 100. ממה שהבנתי מועד ב' היה קצת יותר קשה. כל מה שצריך זה להכין דף נוסחאות טוב ותמציתי, לא להתבחבש עם יותר מדי חומר פתוח ולהיות מדויק באלגברה.\n\nהשורה התחתונה: קורס נהדר על טייס אוטומטי למי שלא רוצה לעבוד קשה מדי בסמסטר ומוכן לתת 6-7 ימים של למידה רצינית למבחן.", "timestamp": 1717599054403}]}