{"posts": [{"author": "ע", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור קורנבלום\nחוות דעת - הרצאות: מרצה מעולה, שם דגש על דברים שיותר קשורים לחשמל ומראה את הרלוונטיות של החומר.\n\nשם המתרגל/ת: אין תרגול, יש מעבדות עם מדריכים מתחלפים\nחוות דעת - תרגולים: 2 מעבדות בכל נושא (סה\"כ 10), המעבדות מאוד מעניינות, דורשות דו\"ח הכנה ומסכם לכל נושא. דוחות ההכנה די קצרים, 2-3 שעות לכל אחד, הדוחות המסכמים לוקחים בערך יום-יומיים אבל הם בקבוצות אז אפשר לחלק את העבודה בקלות.\n\nשעורי הבית: אין תרגילי הגשה חוץ מהדוחות, ציוני המעבדות גבוהים יחסית.\n\nהמבחן: המבחן הוא כ-50% מהציון, לא קשה אבל נכנס לפרטים ספציפיים בחומר, צריך לדעת טוב את התהליכים, התנאים לכל אחד ואת ההבדלים ביניהם. \n\nהשורה התחתונה: סך הכול הציונים גבוהים בשקלול עם המעבדות, יש עומס (6 שעות שבועיות של הרצאה ומעבדות), מאוד מעשי ומעניין", "timestamp": 1645091367642}, {"author": "מל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  עמוס פניגשטין\nחוות דעת - הרצאות: מזעזעות, לא מסודר, לא מובן, לרב די משעמם.\n\nשם המתרגל/ת: דנה כהן-אזרזר\nחוות דעת - תרגולים: (מעבדות ולא תרגולים) המעבדות עצמן ממש כיפיות לרב, מלמדות הרבה וממש בידיים שזה שינוי מרענן לקורסים אחרים. \n\nשעורי הבית: הדוחות יחסית עמוסים - אחד הכנה ואחד סיכום לכל ניסוי (סה\"כ 5 ניסויים שכל אחד מהם 2 מפגשים). לוקחים די הרבה זמן.\n\nהמבחן: אחלה לרב, אין משהו מתחכם מדי.\n\nהשורה התחתונה: קורס נחמד למי שאוהב את הדברים האלה, אבל עמוס מאוד ולא מעבדה כזו שקל להעיף.", "timestamp": 1646119210970}, {"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: קורנבלום ליאור\nחוות דעת - הרצאות: מרצה מעולה. מאוד אכפתי לסטודנטים וחשוב לו שהכל יהיה מובן. לפעמים קצת מתפזר על החומר אז צריך לשים לב מה חשוב ומה פחות.\n\nחוות דעת - מעבדות: מועברים בצורה ממש ממש טובה, הסגל של המעבדה ובעיקר טטיאנה ודימה היו מעולים גם בהסברים וגם בחניכה של העבודה במעבדה. מבחינת מדיריכים לא כזה משנה עם מי אתם, רואים אותם אולי ל10 דק כל מעבדה.\n\nשעורי הבית: הדוחות יכולים להיות מעיקים קצת וגם אין רפרנס טוב. דוח הכנה לוקח בערך שעתיים והדוח מסכם בערך 4 שעות\nסך הכל מגישים 5 דוחות הכנה ומסכמים.\n\nהמבחן: ממש הוגן, ליאור גם דואג לעשות תיאום ציפיות במהלך ההרצאות על מה כן למבחן ומה לא.\n\nהשורה התחתונה: קורס מאוד מומלץ. החלק הכי כיף לדעתי הוא המעבדות ששם באמת נוגעים בידיים ועושים את התהליכים עצמם. ובסוף גם מקבלים את הפיסות סיליקון הבייתה :)", "timestamp": 1658083804081}, {"author": "H", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: ההרצאות דיי מעניינות, ליאור אוהב להרחיב המון על נושאי העשרה כל עוד הוא רואה שגם הכיתה מתעניינת בהן, הרבה פעמים זה בא על חשבון על החומר שהוא באמת צריך להעביר אבל זה גורם לשיעור לעבור בצורה יותר קלילה. אין סיכום מסודר לקורס, אז מאד מומלץ לסכם טוב את המצגות ולרשום הערות, אחרת ההכנה למבחן מאד מאתגרת.\n\nחוות דעת - מעבדות: \nהמעבדות עצמן מאד מאד כיפיות ומלמדות, לרוב מסיימים אותן בפחות מ-4 שעות, בכל מקרה גם אם לא מספיקים ב-4 שעות צוות המעבדה ממשיך את העבודה בשבילכם. להיות עם החליפה המלאה בחדר הנקי קצת מאתגר אבל מתרגלים לזה עם הזמן.\n\nשעורי הבית: \nדוחות המעבדה דיי עמוסים, יש קצת רפרנסים אבל לא ב100%, דוחות הכנה דורשים בין 3-5 שעות ודוחות מסכמים בדר\"כ 8 שעות - תלוי ברמת ההשקעה. חשוב לזכור שהם כמעט ולא בודקים את החלק של חומר הרקע בדוחות אז לא שווה להשקיע מאמץ בו בכלל, אלא בעיקר להתמקד בחלק של ניתוח התוצאות והשאלות על החומר (שדרך אגב, רובן ברמה של מבחן אז מהוות אחלה של תרגול). \nיש בממוצע כל שבוע דוח אחד להגשה (הכנה או מסכם), לקראת סוף הסמסטר הם מתחילים להיות יותר עמוסים אבל התרגול של הדוחות מתחילת הסמסטר גורם להם לעבור מהר יותר.\n\nהמבחן: המבחן לא פשוט, מי שהיה פעיל בכיתה והשתתף בשיעורים, דאג לשאול שאלות בזמן המעבדות והתייעץ עם הצוות על דברים שלא ברורים בדוחות יצליח להגיע לציון ממש גבוה במבחן עם משהו כמו 3-4 ימי למידה. אבל גם אם לא השקעתם אפשר לקבל ציון סביר במבחן (ששווה רק 40% מהציון הסופי) ועדיין לסיים את הקורס עם ציון מעולה, שההיסטוגרמה שלו מדברת בעד עצמה.\n\nהשורה התחתונה: קורס מומלץ מאד, אמנם מעט עמוס אך הציונים מתגמלים בהתאם. אחלה דרך להיחשף לעולם ייצור השבבים - בתור מהנדסי חשמל ככל הנראה לא נעבוד יותר מידי בתחום אך הבנה לעומק של תהליך הייצור לגמרי תורמת להבנה הכוללת של עולם פיתוח השבבים.", "timestamp": 1661076867272}, {"author": "Positive Photoresist", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: עמוס פיינגשטיין\nלא אכפת לו ללמד פשוט. הוא בא, פותח את המצגת (שאגב לא הוא עשה) וקורא מהשקופיות. אבל היה 10% מגן על נוכחות בהרצאות. לכן ממליץ ללכת ולעשות משהו אחר בזמן ההרצאה.\n\nמעבדות:\nרוב המעבדות הם במשך של 3-4 שעות, בתחילת הסמסטר מסיימים טיפה יותר מוקדם, מעבדה ראשונה זה סיור בבניין ובחדרים הנקיים. רוב העבודה במהלך המעבדות היא עם המהנדסים ורק בחצי שעה אחרונה יש מפגש עם המדריכים.\nחשוב לציין ש 70% מזמן המעבדה זה לחכות למכונות לסיים את העבודה שלה, צריך הרבה סבלנות.\n\nמדריכים:  (ניקיטה/ רבקה/אור)\nמאוד אכפתיים, כיף לדבר איתם ולפתוח שיחות על החומר וגם מעבר לו. התפקיד שלהם הוא להשגיח על כתיבת נתונים וביצוע תקין על מדידות בסוף התהליך.\n\nומהנדסים: (טטיאנה, אינה, דימה, עמית, איה)\nטטיאנה היא מלכת המעבדה, כל מילה נוספת מיותרת עליה. היא המנהלת של הקורס, גם בכתיבת הסילבוס, גם בביצוע המעבדות גם בנושא ההשלמות וכו'. היא האחראית על התהליכים בחדרים הנקיים בקורס. מרגיש טיפה כמו האמא של המעבדות.\nכל המהנדסים היה כיף לעבוד איתם, ממש אחלה של סגל. (שיעורי הריקוד עם אינה היו החלק הכי כיפי אפילו יותר מתחרות ההלבשה עם טטיאנה).\n\nדוח''ות הגשה:  10 דוחות בסמסטר שכל אחד דורש 3-5 שעות עבודה לכל שותף (גם עם רפרנס).  יש 5 מעבדות, לכל מעבדה יש דו''ח מכין ואחד מסכם. המדירכים הם אלו שבודקים את הדוח''ות, הם מאוד גמישים בזמנים, נותנים משוב טוב  אך לא מורידים הרבה גם אם יש הרבה טעויות.\n\nהמבחן:  לא קל בכלל, ולפעמים שואלים דברים מעבר לקורס, אבל תמיד נותנים ציונים רק על הבנה ועל יישום החומר הנלמד ולא מקשים בבדיקה בכלל ולכן הציונים במבחן גבוהים. נתנו 4+ פקטור למרות שהממוצע היה גבוה. \n\nחלוקת ציון סופי:\n60% - מעבדות\n10% - נוכחות בכיתה (מגן)\n40% -מבחן\n\nהשורה התחתונה: מומלץ מאוד, למרות העומס של ההגשות. אחד הסגלים הטובים בטכניון (מלבד המרצה עמוס).", "timestamp": 1675934956480}, {"author": "natan borkowski", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: וואו אחד המרצים היותר טובים שהיו לי בתואר. חי את החומר ומעביר אותו בורה הכי מובנת שאפשר\n\nשם המתרגל/ת: אין. יש מדריכי מעבדות\nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות הגשה וסיכום אחרי כל מעבדה( כולמר כל שבועיים) ארוכים מאוד!! שניהם ביחד לוקחים יום לימודים מלא, וזה אם יש לך רפרנס!!! \n\nהמבחן: קליל לגמרי אחרי כל הדוחות הכנה וסיכום. אין מצב שאתה לא שולט בחומר של הקורס שאתה ניגש לפתור מבחנים\n\nהשורה התחתונה: קורס הכי כיפי שהיה לי בתואר . הלוואי שהיה עוד קורסים כאלו", "timestamp": 1693818540644}, {"author": "RAZ", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ליאור קורנבלום\nחוות דעת - הרצאות: מעולה\n\n\nשעורי הבית: יש דוחות למעבדות, בסכ\"ה בסדר\n\nהמבחן: מבחן סבבה, 100% קשור לחומר ומחובר למציאות.\n\nהשורה התחתונה: קורס מומלץ - רשימת המתנה ארוכה, יש רק 12 מקומות כל סמסטר.", "timestamp": 1712743643184}]}