{"posts": [{"author": "מעבדה 1ב בהנדסת חשמל", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "דודי סתם נהנה לגרום לסטודנטים לבזבז כמויות אדירות של זמן על מעבדה שלא לומדים בה כלום. חבל.", "timestamp": 1612276744142}, {"author": "T", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: המעבדות עצמן ארוכות יותר (במיוחד דוחות ההכנה), אבל סביר יותר מ1א כי אין פרויקט (לפחות לא בסמסטר קורונה)", "timestamp": 1612518523900}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: סה\"כ מעבדה סבבה לגמרי, לא עמוסה מדיי ואין מה להשוות בכלל ל-1א'. בסמסטר קורונה כמעט כל המעבדות התקיימו בזום, יש שתיים שמתקיימות פרונטלי.", "timestamp": 1613392909340}, {"author": "דוד", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "המעבדה עוסקת בחומר הנלמד בתורת המעגלים החשמליים, מל\"מ ואותות ומערכות ועבודה עם הרכיבים שלמדנו עליהם בקורס האלה. למי שלוקח במקביל אליה את מעגלים אלקטרוניים החומר עצמו יהיה הרבה יותר מובן אבל לא חובה בשביל ההבנה.\n\nדוחות ההכנה לוקחים בין 3-8 שעות עבודה כל אחד (לא כולל קריאה של חומר הרקע) תלוי מעבדה. המעבדה עצמה אורכת 4 שעות אך לי ולשותף שלי אישית רק מעבדה אחת לקחה יותר מ-4 שעות ואת כל השאר סיימנו אפילו מעט לפני כולל הגשת דוחות המעבדה.\nאין פרויקט אז פרט לבערך יום עבודה אחד במצטבר על כל דוח הכנה אין לחץ מטורף במהלך הסמסטר. סה\"כ 6 מעבדות.\n\nהבחנים היו לא קלים אך פתירים ברובם, מתבססים בעיקר על נוסחאות וחישובים שנעשו בעבודות ההכנה - אז שווה להתעכב עליהם ולחזור עליהם לפני כל מעבדה.\n\nהשורה התחתונה: מעבדה הרבה הרבה יותר קלה מ1א' הציונים פחות או יותר כמו ב1א' אבל אי אפשר להשוות בכלל את כמות העומס. מומלץ לנסות לסיים איתה כמה שיותר מוקדם במהלך הסמסטר בשביל להקל", "timestamp": 1645689381524}, {"author": "natan borkowski", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: מדריך דרור\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות הכנה. \nיש 6 ניסויים במעבדה בזאת. ה4 הראשונים עם דוחות סבירים לחלוטין והוראות ברורות, בערך 3 שעות כל אחד.\nה2 האחרונים ארוכים יותר ,בדגש על האחרון שבונים את הפותר מד\"ר \n\nהמבחן: אין\n\nהשורה התחתונה: הרבה יותר קלה מ1 א' ,ומקבלים טעימות מהרבה נטסעים בפקולטה ככה שמי לא סגור על עצמו זה יכול לתת כיוון בקטנה", "timestamp": 1657451448757}, {"author": "matan", "difficultyRank": 3, "generalRank": 4, "semester": "202103", "text": "שם המרצה: גיל\nחוות דעת - מדריך: תרוצו אליו!! הכי טוב שיש\n\nשעורי הבית: דוחות הכנה ארוכים מאוד כ-8 שעות \n\nהמבחן: אין\n\nהשורה התחתונה: מעבדה סבירה, לא יותר ולא פחות, לא הכי כיפית ולא הכי משעממת, שימו לב ללמוד לבחני הכניסה לפני ההגעה כי לא קל להוציא 100 בהם, סה\"כ תלוי במצב רוח שלכם ושל המדריך", "timestamp": 1666530181128}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המדריך: גיל \nחוות דעת  :  מדריך מצויין\n\nשעורי הבית:  דוחות הכנה סבירים לחלוטין, סיימנו אות רובם ב כשעתיים, האחרון יותר ארוך אך עדיין סביר, סביב ה 5 שעות\n\nהשורה התחתונה: מעבדה כיפית, בונים כל מיני מעגלים שנלמדים בקורסים אחרים. יש 6 מפגשים של 4 שעות, אך סיימנו את כולם טיפה לפני הזמן. פגישה פעם בשבועיים ולכן כמעט ואין עומס במהלך הסמסטר. אהבתי", "timestamp": 1675362590929}, {"author": "לידור זינו", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המדריך מעבדה: קובי\nקצת חופר(תשובה של דקה יכולה להימרח לרבע שעה), אבל עוזר מאוד. צריך לדעת לבחור מדריך. היו מדריכים שעזרו לכולם לסיים מוקדם והיו כאלו שלא עזרו גם כשסטודנטים התעכבו חצי שעה ומעלה.\n\nהמעבדה מורכבת מ - 6 מפגשים 1, מפגש אחד לשבועיים, ולרוב לא נשארים מעבר ל-4 שעות השבועיות הקיימות.\nהדוחות הכנה לעומת זאת כן עמוסים בהתאם למעבדה.\n\nהמעבדה נותנת הזדמנות להתעסק במה שלמדנו במעגלים אלקטרוניים, מל\"מ ועוד", "timestamp": 1715175852114}, {"author": "a", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המדריך: שלמה \nמבוגר וחמוד, עוזר מאוד ונותן אינטואיציות מהתעשייה. עונה על מה שנכון מקצועית, אבל לא תמיד מה שנכון לדו\"ח.\n\nשעורי הבית: \nדוחות הכנה די ארוכים, למצוא רפרנס טוב משנים קודמות ולהסתמך עליו אבל לא לרפרנס על עיוור-כי צריך להבין את ההכנה לפני שמגיעים למעבדה.\nהמעבדה:\nיש 6 מעבדות שזה נחמד שמסתיימות לפני סוף הסמסטר, אבל ההתפלגות היא אחת קצרה בעיבוד אותות, אולי עוד 1-2 סבירות והשאר ארוכות להחריד, ידרשו מכם להישאר אחרי הזמן של המעבדה או לבוא ביום אחר.\nהשורה התחתונה: \nמאוד ממליץ לקחת את המעבדה בצמידות לקורס של מעגלים אלקטרוניים, או לכל הפחות אחרי הקורס. לא חובה, כי החומר מתבסס על מלמ ואותות, אבל איכשהו יצא שהמעבדות הסתנכרנו עם מה שלמדנו בשבוע-שבועיים האחרונים באלקטרוניים וגרם גם להבין טוב יותר את המעבדה וגם את החומר בכיתה.\nהמעבדה עצמה הייתה יכולה להיות נחמדה, אם היא לא הייתה כל כך ארוכה ועמוסה.", "timestamp": 1716115838166}]}