{"posts": [{"author": "Guy Yoffe", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: מרצה מעולה. יש סיכום של ההרצאות שלו בדרייב והוא הולך אחד לאחד לפי מהשכתוב שם. מסביר מעולה, בקצב טוב, מעניין מאוד.\n\nשעורי הבית: גיליונות יבשים שאינם חובה (בוחן האמצע מרופרנס לגמרי מהגיליונות האלו), וגיליונות רטובים לא מאוד מסובכים ויחסית די נחמדים.\n\nהמבחן: לא קל בכלל.\n\nהשורה התחתונה: קורס מעניין מאוד. המשך ישיר של אותות ומערכות - ומעניין מאוד.", "timestamp": 1597781962221}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: רצוי ללמוד מהחוברת הרצאות שלו בדרייב. הוא מעביר את כל החומר אחד לאחד מהחוברת. גם רונן מעביר את החומר בצורה טובה.\n\nשם המתרגל/ת: אילון אהרון\nחוות דעת - תרגולים: התרגולים לא תורמים כל כך הרבה, עדיף ללמוד את התרגולים לבד, הם גם מסוכמים בPDF בצורה מספיק טובה ומכילים הרבה תרגילים לתרגול עצמי.\n\nשעורי הבית: היבשים לא חובה ולא להגשה, אך יש בוחן אמצע שבנוי נטו על היבשים, לכן רצוי להכניס בלו\"ז כן לפתור את היבשים ולהבין אותם, גם לקראת המבחן.\nיש 3 רטובים להגשה כשכל הגשה היא לחודש, ממש קלים, אפשר לתקתק אותם תוך כלום זמן, במיוחד למי שיודע מטלב טוב.\n\nהמבחן: ללמוד טוב ממבחני עבר של רונן, הרמה סבירה, מבחנים ממוחזרים אבל לפעמים דוחפים שאלות שדורשות הבנה של נושאים בקורס.\n\nהשורה התחתונה: הקורס נותן בסיס טוב לעיבוד אותות, מעניין למי שרוצה ללמוד עיבוד אותות. לא קשה מדי.", "timestamp": 1597831376923}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 1, "semester": "201902", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: מרדים בטירוף, אבל חשוב לדעת לבחינה והוא בכוונה עושה דברים לא כמו בוידאו\n\nשם המתרגל/ת: אלמוג\nחוות דעת - תרגולים: מסביר טוב\n\nשעורי הבית: 6 יבשים ממוחזרים, ללא חובת הגשה, 3 \"רטובים\" משעממים במאטלב, ממוחזרים.\n\nהמבחן: מלא טריקים מעצבנים \n\nהשורה התחתונה: משעמם בטירוף, בדיעבד לא הייתי לוקחת. לא נראה לי \"חשוב\" בכלל למי שהולך לכיוון עיבוד תמונה ולומדות", "timestamp": 1600178408436}, {"author": "אלון נמירובסקי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: הרצאות טובות ומעניינות\n\nשם המתרגל/ת: אלמוג\nחוות דעת - תרגולים: התרגולים עוברים ברמה טובה\n\nשעורי הבית: שיעורי הבית לא פשוטים, חשוב להבין אותם לבחינה\n\nהמבחן: מבחן לא פשוט, צריך ללמוד טוב\n\nהשורה התחתונה: קורס מעניין ונחמד", "timestamp": 1614182052547}, {"author": "עד מתי", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: מאוד מאוד משעממות\n\nשם המתרגל/ת: אלמוג\nחוות דעת - תרגולים: מתרגל ממש אחלה\n\nשעורי הבית: יש רפרנס רשמי להכל אבל הגליונות ממש ממש ארוכים ולא הכי מובנים\n\nהמבחן: נורא ממש, הכי מבוסס מזל שנתקלתי עד כה בתואר - אפשר להתכונן שבוע שלם ולהיכשל ואפשר להתכונן יום אחד ולצאת עם ציון טוב\nיש בקורס המון נושאים ובמבחן רק 4 שאלות, יוצא מצב שאפשר לפתור כמות מכובדת של מבחנים ועדיין לא להצליח לעבור על כל החומר הרלוונטי למבחן\n\nהשורה התחתונה: לא ממליצה בכלל, לא לימד שום דבר חשוב במיוחד", "timestamp": 1615885812453}, {"author": "Daniel Stumler", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: מרצה מצוין. ההרצאות מעניינות, יש הרבה פיתוחים מתמטיים שחשוב להבין עד הסוף.\n\nשם המתרגל/ת: יובל\nחוות דעת - תרגולים: מתרגל מעולה.\n\nשעורי הבית: חלק מהשאלות בתרגילים היבשים נלקחו ממבחני עבר אז הם מאתגרים. בחלק הרטוב (matlab) ההנחיות לא הכי ברורות. סה\"כ לא מאוד עמוס.\n\nהמבחן: לא פשוט, יש שאלות הבנה וגם שאלות שמתבססות על הפיתוחים מההרצאות. חשוב להכיר את הטריקים ולתרגל הרבה מבחנים.   \n\nהשורה התחתונה: קורס טוב, לא עמוס מדי.", "timestamp": 1626608314783}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: סה\"כ הרצאות סבירות , לא מועברות בצורה מעניינת מאוד אבל החומר עצמו מעניין יחסית \n\nשם המתרגל/ת: אלמוג\nחוות דעת - תרגולים:  קצרים וטובים סה\"כ\n\nשעורי הבית: יבשים , כבדים ולא מובנים , דורשים רפרנוס לצערי\n\nהמבחן: זוועתי , המבחן לא בחן שום דבר מלבד לעלות על טריקים מתמטיים שלא רואים במבחני עבר , לא התעסק במהות של הקורס ולא היה דומה לשום דבר שאפשר לראות בתרגולים או בהרצאות\n\nהשורה התחתונה: אם יש לכם את האפשרות , אל תקחו את הקורס הזה , מצטער על הרגע שהוספתי אותו ב ug.", "timestamp": 1626611089631}, {"author": "Matan", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: הרצאות טובות סה\"כ , מסביר ברור ומעניין , יכול להיות טיפה מונוטוני\n\nשם המתרגל/ת: אלמוג/יובל \nחוות דעת - תרגולים:  שניהם מתרגלים מעולים ומבינים את החומר לעומק .\n\nשעורי הבית:  בסמסטר אצלנו היה חמישה יבשים ועוד שלושה רטובים, הרטובים ממוחזרים וגם לא מסובכים , היבשים גם ממוחזרים אבל לדעתי מאוד קשה לעשות אותם במהלך הסמסטר בלי לרפרנס אני הצלחתי לפתור אותם כמו שצריך רק בלמידה למבחן בסוף הסמסטר..\n\nהמבחן: מבחן קשה אבל אפשרי להצליח אם נופלים על מבחן ברמת קושי סטנדרטית. המון טריקים מתמטיים שלא תמיד רואים בהרצאות והתרגולים , אבל סה\"כ אפשר ללמוד את רוב הטריקים מפתירת מבחני עבר של רונן , ולכן אני ממליץ ממש לפתור כמה שיותר מבחנים , זה בגדול מה שעזר לי לסיים את הקורס עם ציון סבבה.\n\nהשורה התחתונה: אצלי הוא היה חובה אז לא היה יותר מדי ברירה , החומר מעניין ורלוונטי למי שרוצה להתעסק בעיבוד אות בתצורה כלשהי בעתיד ,אבל צריך לקחת בחשבון שהוא דורש המון למידה ולא פשוט לעיכול לכולם.", "timestamp": 1634282404059}, {"author": "רון", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ד\"ר גל בן דוד\nחוות דעת - הרצאות: מרצה מעולה,  אושייה בתחום עיבוד האותות, מסביר את הנושאים בצורה אינטאוטיבית ויפה. נהניתי מכל רגע בהרצאות שלו. הוא הסיר את נושא הדגימה והשחזור מסילבוס הקורס לסמסטר זה, משום שנושא זה נלמד באותות ומערכות. \nחשוב לציין שגל הכניס כמה נואשים חדשים לקורס, כגון עיבוד אותות מרחבי ותכן מסננים בשיטת רמז\n\nשם המתרגל/ת: יובל סילמן\nחוות דעת - תרגולים: מתרגל נהדר, נותן הערות וטיפים שעוזרים להתמודדות של שאלות ממבחנים\n\nשעורי הבית:  \nבסמסטר זה ספיציפית גל נקרא ללמד בצורה חד פעמית במקום רונן טלמון. \n10% על 3 תרגילי בית רטובים במטלב  -  קלילים ולא לטקחים יותר מדיי מן אם מחלקים את העבודה.\n20% על בוחן מגן שעסק בנושא ה- DFT \nהמבחן: \nהמבחן היה הוגן והתבסס על הבנה של החומר של גל בעיקר. היו שתי שאלות שהן נטו מההרצאות שלו. חשוב להבין היטב את ההרצאות התרגולים ולתרגל כמה שיותר מבחנים של המרצה כדי לקבל ציון גבוה.\n\nהשורה התחתונה: \nגל שינה את סילבוס הקורס בסמסטר זה (חורף 2022) ובעיקר עסקנו בנושאים של DFT, FFT,  עיבוד אותות מרחבי, התמרת זמן-תדר ותכן מסננים, ועיבוד אותות מסתגל.\nהקורס בסמסטר זה עם גל זכה לפן יותר אינטאוטיבי והבנתי ופחות גחמות מתמטיות כפי שהיה נהוג עם פרופ' טלמון. \nמומלץ לכל מי שאהב אותות ומערכות ומעוניין להמשיך בתחום", "timestamp": 1645958974479}, {"author": "ביורפואן אקראי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: מתמטיות למדי. החצי הראשון של הקורס יותר תיאורטי (מעמיקים בהתמרות פורייה למיניהן) והחצי השני יותר מעשי (מסננים). ההרצאות הן אחד לאחד כמו הסיכום בדרייב, ממש אין צורך לכתוב תוך כדי הרצאה.\n\nחוות דעת - תרגולים: עברתי בין מתרגלים, כולם לא שיא. מה שכן, דפי התרגול מלמדים טוב מאוד את החומר.\n\nשעורי הבית: אצלי היבשים היו המלצה אבל הרטובים תקף.\n\nהמבחן: קשה.\n\nהשורה התחתונה: צריך להיות על הקורס לאורך הסמסטר. קורס חשוב לעיבוד אותות שעושה סדר בבלאגן שנקרא \"אותות ומערכות\".", "timestamp": 1657298429520}, {"author": "יונתן לונברג", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: \nמרצה מהטובים שפגשתי בפקולטה, רונן הוא חצי מתמטיקאי ולכן ההרצאות מאוד ברורות ומובנות- הרציונאל ברור, המעברים ברורים וההסברים קולחים. לדעתי קורס שהוא חובה למהנדס חשמל, מהסיבה הפשוטה שבגדול, התמרת פוריה זה חצי תואר שלנו, והידע שמקבלים מאותות ומערכות הוא רקע מאוד מאוד חשוב, אבל הוא לא פרקטי כי בסוף מה לעשות עיבוד אות הוא ספרתי ואין פונקציות רציפות ממינוס אינסוף עד אינסוף בעולם האמיתי. כמה שיעורים ראשונים הם חזרה על החומר מאותות, DTFT,DFT ואז מלמדים את אלגוריתם FFT שהוא חשוב מאוד. נוגעים באנליזה ספקטרלית מעשית, שזה שם קצת מפוצץ אבל נושא חשוב כי הוא מסביר את המקור לבעיות כשעוברים לזמן בדיד. אחרי זה נלמד התמרת זמן תדר, התמרה מגניבה מאוד ושימושית מאוד כי בניגוד להתמרת פוריה שם אתה מקבל את התדרים אבל באיזשהו אופן בממוצע בסיגנל, כאן אתה מקבל את התדרים לפי הזמן שהופיעו. ולבסוף יש תכן מסננים ועיבוד אות מסתגל. תכן מסננים לדעתי קצת משעמם אבל נחמד בסהכ ובתכלס גם חשוב כי הוא עונה על השאלה מה קורה עם הפאזה כשמסננים אות. אנחנו רגילים לא להתייחס לזה בכלל ורק להסתכל על הערך המוחלט של תגובת התדר ומתעלמים לגמרי מהפאזה (שהיא גם חשובה). לבסוף יש הרצאה על עיבוד אות מסתגל. מעניין כי זה מראה קצת עיבוד אותות ב-real time\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nראיתי מוקלט, היה מצויין, בחור דתי\nשעורי הבית: \n3 רטובים חובה, לא ארוכים, סהכ 4 שעות בממוצע לרטוב.\nהמבחן: \nהמבחנים לא פשוטים ומתמטים, בכל מקרה אפשר להצליח אם חדים על הקורס ופותרים מספיק מבחני עבר (תמיד כשיש קורס עם אותו מרצה 20 שנה ופתרונות מלאים מפורסמים אפשר להצליח בקורס, פשוט צריך לפתור מספיק).\nהשורה התחתונה: \nאם השתכנעתם שהתמרת פוריה זה חשוב, אז צריך לקחת את הקורס הזה.", "timestamp": 1657665207449}, {"author": "הליקופטר", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רונן\nחוות דעת - הרצאות: אחלה מרצה, מאוד ברור בהסברים ובמעברים שלו, ועונה ממש בכיף על כל שאלה גם הכי מטומטת. ההרצאות הן ברוח די מתמטית.\n \nשם המתרגל/ת: אלמוג (מוקלטים מאביב 2021)\nחוות דעת - תרגולים: תרגולים קצרים וקולעים, עוברים על הגדרות ורואים קצת דוגמאות ולפעמים הדמיה במטלאב.\n\nשעורי הבית: 3 רטובים במטלאב, כל אחד 5 אחוז תקף. סך הכל לא מאוד עמוסים, אבל גם לא מאוד מלמדים. יש יבשים בגדר המלצה, שמעתי שעוזרים להבין את החומר אבל אישית לא היה לי זמן לגעת בהם. \n\nהמבחן: יש חלק הנדסי אבל גם חלק לא קטן שהוא מתמטי בטירוף. יש למבחנים של רונן מבנה די קבוע אבל צריך לתרגל המון ועדיין זה לא יבטיח הצלחה בחלקים המתמטיים כי הם תלויים בעיקר בטריקים של טורים או דברים מסריחים דומים. החלק ההנדסי של המבחן כמו אנליזה ספקטרלית או תכן מסננים הם הוגנים מאוד.\n\nהשורה התחתונה: גילוי נאות, אני לא נמשך לתחום של עיבוד אותות בכלל. ועדיין, אני שמח שלקחתי את הקורס כי לדעתי הוא מלמד עקרונות מאוד חשובים בהנדסת חשמל ומביא את ההעמקה הנחוצה ואת הפרקטיקה לתחום שחשפו אותנו אליו באותות ומערכות בצורה מאוד מפוזרת ותיאורטית.\nקורס חשוב, חבל שחלק גדול ממנו הוא מאוד מתמטי.", "timestamp": 1657735999141}, {"author": "מיקמק הסדרה", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פרופ\"ח רונן טלמון\nחוות דעת - הרצאות: מעניינות אבל מרגישות לא מאוד קריטיות למבחן עצמו, את רוב החומר אפשר לקלוט מהתרגולים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: ממליץ ללמוד בעזרתם למבחן- מועילים, מעניינים ולא עמוסים מדי. \n\nשעורי הבית: יש 3 שיעורי בית רטובים לא קשים מדי אבל כן לוקחים קצת זמן אם אתם לא חזקים מאוד במאטלב.\n\nהמבחן: מבחן לא פשוט ודורש הבנה די טובה בחומר אבל אפשרי לקבל בו ציון טוב עם מספיק הכנה.\n\nהשורה התחתונה: אני ממליץ לקחת את הקורס למי שרוצה הבנה קצת מעבר לבסיסית בעיבוד אותות. מרגיש כמו השלמה לחלקים שפחות העמיקו בהם באותות ומערכות.", "timestamp": 1663779664754}, {"author": "סטודנט כללי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: אחלה מרצה, ברור ומסודר וההבנה של הסטודנטים חשובה לו.\n\nשעורי הבית: 3 רטובים חובה שהם לא קשים ולא גוזלים יותר מדי זמן. נותנים 15% מגן.\n\nהמבחן: סך הכול בסדר.\n\nהשורה התחתונה: קורס חביב, מלמד את הבסיס של עיבוד אותות בדרך נעימה, חוויה מתקנת לאותות ומערכות.", "timestamp": 1675346967304}, {"author": "רוי", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות:  ההרצאות בסדר, לא מעניינות במיוחד וגם לא משעממות, מועברות ברוח די מתמטית והקצב יחסית איטי כי אין הרבה חומר, מה שמאפשר לשאול שאלות חופשי וגם אם מאבדים אותו אפשר ממש להגיד לו \"תחזור שוב על כל מה שעשית\" והוא עושה את זה. רונן בחור נחמד וברור.\n\nשם המתרגל/ת: הייתי חלקית עם בר אמיתי בפרונטלי וחלקית במוקלט עם בחור בשם אלמוג, שני המתרגלים סבבה בערך באותה מידה.\nחוות דעת - תרגולים:  רוב התרגולים לא עמוסים כל כך ויעילים למבחן, הקורס באופן כללי לא מהקורסים הכבדים בתואר, פשוט יש בו נושאים קצת טריקיים או מעצבנים מתמטית לפעמים.\n\nשעורי הבית:  יש שישה יבשים לא חובה להגשה, אבל הם ברמת מבחן(לפעמים אפילו קצת מעבר) והם עוזרים לשמור על שליטה בחומר. \nיש שלושה רטובים ששווים 15% *תקף* אבל גם הם לא עמוסים, בממוצע בין 4 ל6 שעות לרטוב במידה ויש שליטה סבירה במאטלב ולא פח אשפה.\n\nהמבחן:  המבחן עם מבנה די קבוע של 4 שאלות, בדר\"כ שתי שאלות הוגנות וסבירות לחלוטין ושתי שאלות נוספות שיכולות להיות טריקיות ומעצבנות, יש מועדים נחמדים יותר ויש מועדים נחמדים פחות.\nממליץ לטחון לפחות בין 10 ל15 מבחנים כדי להשתפשף מספיק בטריקים ובחשיבה של הקורס הזה, כי המבחן באמת דורש מיומנות מסוימת.\n\nהשורה התחתונה: באתי בציפיה גדולה יותר לקורס הזה והאמת שקצת התאכזבתי, הוא פחות מעניין משחשבתי והייתי ממליץ עליו אך ורק לאנשים שבוודאות ממשיכים בתחום של עיבוד אותות.", "timestamp": 1676404096294}, {"author": "natan borkowski", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: מארצה מעולה שנותן הסברים בגובה העיינים, אחרי הטרואמה באותות מהסרטוני יוטיוב של דגבג פתאום הבנתי את החומר\n\nשם המתרגל/ת: ראיתי הקלטות של אלמוג\nחוות דעת - תרגולים: הקלטות מתקופת הקורונה, מתרגל טוב\n\nשעורי הבית: 3 רטובים שלא באמת מלמדים כלום...פשוט קחו תעשו מה שלמדנו תראו איזה יופי\n\nהמבחן: קשוח\n\nהשורה התחתונה: קורס מומלץ כי חומר חשוב, מבחן טריקים מתמטים של סכומים", "timestamp": 1693817887465}, {"author": "גיבורי ישראל 24", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nרונן טלמון\nחוות דעת - הרצאות: \nרונן מרצה מצויין ובחור מקסים. רונן מעביר את החומר לאט וברור, ויחזור בשמחה על חלקים שלמים של ההרצאה אם מישהו שואל שאלה. רונן בהרצאות נותן הסבר עמוק ויסודי לכל מיני \"כללי אצבע\" שדגב\"ד אומר באותות ומערכות (רחב בזמן צר בתדר וכאלה) ולדעתי נותן המון ידע ואינטואיציה מעבר למה שרואים באותות ומערכות.\n\nשם המתרגל/ת: \nאלמוג (מוקלט)\nחוות דעת - תרגולים: \nהקלטה מסמטר ישן, אלמוג מסביר טוב את החומר והתרגולים נותנים טריקים טובים למבחן.\n\nשעורי הבית: \nיש 3 רטובים קלים מאוד ושלוקחים כלום זמן (ואני גרוע רצח בקוד). בנוסף יש גם יבשים לא להגשה, שווה לעשות תרגיל או שתיים מכל גיליון לוודא שאתם על זה. בכללי הם די חופרים והרוב לא נוגעים בהם ולדעתי זה גם לא כזה נורא לעשות את זה. הקורס הכי פחות עמוס שעשיתי בפקולטה.\n\nהמבחן: \nמבחן לא קל. הרבה טריקים ודברים שחוזרים ככה שלדעתי תרגול טוב יכול לעזור להוציא ציון סבבה לגמרי. בכללי המבחנים יחסית מתמטים.\n\nהשורה התחתונה: \nקורס מעולה לדעתי. בנוסף, זה הקורס הכי פחות עמוס שעשיתי בפקולטה כי השיעורים בדיחה.\nהקורס הוא קורס בחירה שבנוי לגמרי שונה מרוב קורסי הבחירה בפקולטה. רוב קורסי הבחירה נותנים סקירה מאוד רדודה ורחבה ברמת כותרות שקשורה לנושא מסויים, ורוב הזמן אני מרגיש שאני מסיים את הקורס עם ידע על הרבה מושגים אקראיים מסויים, אבל לא מקבל אינטואיציה לגבי התחום. במבל\"ס רונן לוקח 3 נושאים בסך הכל, ומלמד אותם לעומק מאוד, מה שיוצא מזה שמקבלים מלא אינטואיציות חדשות וידע עמוק על הנושא של עיבוד אותות. \n\nבסופו של דבר קורס מעניין, לא עמוס בכלל, עם חומר חשוב ונכנס לכל השרשראות כמעט, אני חושב ששווה כמעט לכל מי שבפקולטה לקחת אותו.", "timestamp": 1704011729353}, {"author": "הבחור האדום", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: \nחשובות למבחן, ענייניות.\n\nשם המתרגל/ת: חן זנו\nחוות דעת - תרגולים: \nמתרגל מעולה, לכו אליו\nאצלנו היה לו תרגול בבוקר ותרגול אחה\"צ. היה שווה להשקיע ולבוא לתרגול שלו בבוקר - כי אז הכיתה של 5 סטודנטים.\nוידוי - אני גר במעונות אז לי קצת יותר קל, אבל עדיין ממליץ\n\nשעורי הבית: יבשים - קשים ולא פתירים. כדאי לעשות ולרפרנס, למרות שהם לא הגשה, כדי להבין יותר טוב את החומר.\n3 רטובים - לוקחים בערך 4 שעות כל אחד, מבינים יותר טוב את החומר אחרי הש.ב הללו. לא קשים מדי, אבל ארוכים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1715176598154}, {"author": "Grades", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: רונן מרצה טוב והוא מעביר את הקורס כבר הרבה שנים וסהכ תמיד עונה על שאלות של סטודנטים גם אחרי ההרצאה.\nכן יש נטייה להרצאות להפוך להיות מאוד מתמטיות ואז קל לאבד אותו, במיוחד בחלק של ההוכחות של הDFT\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: טובות ומפורטות עם הרבה תרגילים לתרגול עצמי שבסוף עוזרים למבחן\n\nשעורי הבית: 3 רטובים, בתור מילואימניק עשיתי 2 אז פחות יש לי מה להגיד עליהם.\nיש גם 6 יבשים שהם מאוד חשובים, אם תעברו עליהם טוב ותבינו אותם כמו שצריך אז משפר מאוד את הסיכוי להצליח במבחן\n\nהמבחן: קשה.\nמבחנים של רונן לפעמים יכולים מאוד ליפול לפן יותר מתמטי מאשר הנדסי.\nאצלנו היה פקטור 12 נקודות לבחינה\n\nהשורה התחתונה: חשוב ממש לעשות את היבשים ולטחון מבחנים בשביל להצליח בסוף.\nוגם מאוד חשוב להבין את כל הפיתוחים המתמטיים שמועברים בתרגולים וביבשים(במיוחד בחלק של דגימה ושחזור ו DFT כי בסוף במבחן יביאו לכם שחזור לא אידיאלי/DFT טיפה מוזר ותצטרכו לדעת לפתח את זה , שאת זה אפשר רק אם אתם מבינים ממש טוב מה עשו בתרגול/ שיעורי בית)", "timestamp": 1715939545401}, {"author": "נעם", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רונן טלמון\nחוות דעת - הרצאות: \nרונן מסביר ברור. נחמד ועונה בסבלנות על כל שאלה.\nשם המתרגל/ת: יוני לוי (הקלטות ישנות)\nחוות דעת - תרגולים: \nתותח. כיף ללמוד ממנו.\nשעורי הבית: \nיש רטובים להגשה. מנוסחים לא טוב. גם אם רוצים לא לרפרנס ולהשקיע כדי לעשות ולהבין יותר טוב את החומר זה מרגיש מוגזם.\nהמבחן: \nמועד א' היה זוועתי. ב' היה יותר סביר.\nיש נטייה במבחנים מהשנים האחרונות לקחת את זה לקצה, חבל.\nהשורה התחתונה: אחלה קורס. מומלץ למי שמתעניין בעיבוד אותות.", "timestamp": 1718097614798}]}