{"posts": [{"author": "Guy Yoffe", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: משה הורוביץ\nחוות דעת - הרצאות: מעט משעמם. מדבר די לאט, וקשה להסביר את זה אבל קשה מאוד להתעניין.\nסך הכל מעביר את החומר בסדר ויודע את החומר מדהים, אבל קצת קשה להתרכז ולעקוב אחריו.\n\nשם המתרגל/ת: ליאור ענני\nחוות דעת - תרגולים: מתרגל די סבבה. קשה לקבוע איתו שעת קבלה בלי שהוא ידחה אותה לשבוע אחרי. סה\"כ התרגולים שלו היו סבבה ועזרו להבין את החומר.\n\nשעורי הבית: \nמרופרנסים. חלקם עוזרים להבין את החומר, חלקם מיותרים.\nהמבחן: \nתמיד המבחן מוזר עם שאלות מונפצות ולא קשורות לחומר הקורס. מרגישים בלמידה למבחן שכל מבחן זו חוויה שונה לחלוטין עם קשיים הזויים ושאלות שאף אחד לא מבין\nהשורה התחתונה: \nקורס נחמד למי שרוצה להכיר את התחום ואת השרשרת. אחרת - לא מאוד מומלץ", "timestamp": 1597753512819}, {"author": "itamar priel", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: משה הורוביץ\nחוות דעת - הרצאות: מעניינות, אם כי לפעמים קצת איבדו את הפרקטיקה\n\nשם המתרגל/ת: ליאור ענני\nחוות דעת - תרגולים: סופד ממוקד, ממש מוצלח. מאוד אוהב את מה שהוא מלמד, תומך בסטודנטים\n\nשעורי הבית: קצת ארוכים, אבל יש רפרנסים חלקיים להכל, ולא באים בבת אחת\n\nהמבחן: לא קשה, אבל ממש לא ברור. אם היה ברור להבנה, ממוצע 90+\n\nהשורה התחתונה:", "timestamp": 1600114616233}, {"author": "&", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: משה הורביץ \nחוות דעת - הרצאות: נוראיות. המרצה מאוד משעמם בצורה לא מוסברת, קשה לעקוב אחרי מה שהוא אומר ולהישאר מרוכזים לארוך שעתיים של הרצאה. \nההרצאות עוברות במצגות, מהמצגות הגרועות שיצא לי לחוות בתואר, מלא מתמטיקה ואלגברה, מעט הסברים, בערך 0 אינטואציה. בשביל באמת לפתח הבנה צריך להקשיב למשה וזאת משימה ממש קשה. \n\nשם המתרגל/ת: אחיעד לוי\nחוות דעת - תרגולים: מתרגל בסדר, לא הכי בקיא בחומר, סה\"כ נחמד. התרגולים לא תמיד עוברים על מה שהיה בהרצאה אלא מרחיבים או מוסיפים. לא פותרים בהם הרבה תרגילים והתרגילים שפותרים מאוד טכניים ופשוטים ולא מאוד הבנתיים. עוברים במצגות קצת יותר סבירות מההרצאות.  \n\nשעורי הבית: 4-5 תרגילי בית יבשים. תרגילי הבית ארוכים נורא על גבול המייאשים. רובם מרופרנסים. לא תמיד רלוונטים כי הם מאוד ישנים ולא מספיק דורשים הבנה (בניגוד למבחן). \n\nהמבחן: מזעזע. משום מה סגל הקורס לא ממש מפרסם בחינות עבר בצורה מסודרת וקלה לגישה, הפתרונות לכל מבחני העבר חלקיים מאוד וצריך להסתמך על סריקות מהדרייב (ואין הרבה). המבחן מרגיש כמו ניסיון להמציא את הגלגל כל פעם מחדש, מה שאומר שצריך להבין את החומר בצורה מאוד טובה, אין כמעט שתי שאלות דומות. המבחנים מנוסחים לא ברור וזה מאוד מתסכל. מה שכן, משה אמר שהוא חושב שהממוצע צריך להיות סביב ה-80 באופן עקבי. \n\nהשורה התחתונה: קורס די גרוע. כנראה עדיף לעשות אנטנות וקרינה בשביל לסגור את השרשרת. כנראה לומדים בו דברים חשובים למי שרוצה לעסוק בפוטוניקה אבל גם אם כן אני לא יודע מה הם כי לא הדגישו מה חשוב ומה לא בהרצאות. לעשות רק אם נשמע ממש ממש ממש מעניין או רק אם אין ברירה אחרת.", "timestamp": 1627324864376}, {"author": "~", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: משה הורוביץ\nחוות דעת - הרצאות: \nהחומר מעניין אבל משה מסביר ממש לא טוב לדעתי והמצגות שלו מאוד לא ברורות. אפשר ללמוד את הרוב מהתרגול ולהשלים את החוסרים מהסיכום של מוטי שגב\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים ויש רפרנס\n\nהמבחן: \nמשה לא מפרסם פתרונות לכל מבחני העבר, משום מה הוא החליט שלכל השאלות על לייזרים הוא מוחק את הפתרון הרשמי ואתה צריך לנחש עם עשית נכון כשאתה לומד למבחן וזה די מעצבן\nהשורה התחתונה: \nאם באמת מעניין אותכם אני ממליץ על לייזרים של פיזיקה במקום הקורס הזה", "timestamp": 1678448698885}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: משה הורביץ\nחוות דעת - הרצאות: \nההרצאות לא ברורת כלכך, אם כי ניכר שאכפת למרצה שיבינו את החומר והוא תמיד שמח לעזור בשעות קבלה.\nשם המתרגל/ת: עידן שליסרמן\nחוות דעת - תרגולים: \nאחלה של מתרגל, רואים שאכפת לו מהסטודנטים ועושה קצת סדר בבאלגן מההרצאות.\nשעורי הבית: \nלא עמוס, 5 יבשבים עם רפרנסים\nהמבחן: \nהמבחן זה סיפור מאוד מוזר. כל מבחן יש שאלה אחת בסך 50 נקודות על לייזרים/מגברים ועוד 50 נקודות על נושאים אחרים.\nהשאלה על לייזרים, תמיד אבל תמיד קשה בטירוף, ולא ברורה בעליל. מרגיש כאילו המרצה חושב פתאום על שאלה למבחן ואז רושם את הרעיון הראשוני הזה על דף וזהו. אין בקרה לוודא שהשאלה קריאה/ברורה/פתירה /הגיונית.\nהבדיקה של השאלה הזאת גם כן מוזרה, ככל שאתה יותר קרוב לכוונת המשרור ככה הציון שלך גבוה יותר, אבל אין אמת אוביקטיבית לשאלה, זה ככל שאתה מצליח לפגוע למה שהוא חשב באותו הרגע ככה הציון שלך גבוה יותר.\nבשביל שישאר מעניין ויהיה עניין בלמידה למבחן (ואולי בשביל לשמר את עניין חוסר הבהירות בשאלה), כמעט ואין פתרון רשמי לאף מבחן בשאלה הזאת (בצדק, אי אפשר לייצר לה פתרון רשמי כי לרוב היא לא מוגדרת היטב).\nהשורה התחתונה: \nהחומר של הקורס מעניין מאוד. לטעמי, ההרצאות לא ברורות מספיק וקשה להבין את הנושא המרכזי שזה לייזרים. התרגולים טובים.\nהמבחן הוא חתול בשק. יש לך חצי מבחן (50 אחוז מהציון הסופי) שהם כמו רולטה רוסית. כמעט תמיד לא ברור מה צריך לעשות.\nבגלל עניין המבחן, יש לשקול היטב אם לקחת את הקורס, כי החוויה לא תמיד נעימה במבחן ובלמידה אליו (אם כי בסוף לרוב מפקטרים ויש בדיקה יחסית מקלה)", "timestamp": 1689197581846}]}