{"posts": [{"author": "עייפות בע\"מ", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "מדריכים בסמסטר שלי:\nמתן - נחמד מאוד\nאורית - קצת פחות\n\nבגדול יש שישה ניסויים עם דוחות הכנה בגדלים סבירים.\nהניסוי הראשון הוא חפירה אחת גדולה בסימולינק שצריכה להיות גיליון בית.\nשני ניסויים הם די נחמדים עם עבודה במטלב וסימולינק, והשלושה האחרים די חופרים ו... פחות מעניינים.\nהנחמדים יותר הם:\nמטוטלת הפוכה קווית (הכי שווה לדעתי)\nזרוע בחיבור גמיש (לנו קרסו העמדות ומתן הרשה להגיש רק את מה שהצלחנו).\n\nהפחות נחמדים הם:\nמטוטלת הפוכה במסלול מעגלי (מודרך מידי עם דו\"ח הכנה חופר).\nבקרת מנוע DC עם סעיפים מגעילים בדו\"ח הסופי ותוכנה לא משהו בלשון המעטה.\nניסוי PID - חפירה אחת ענקית בסימולטור. בזבוז זמן מוחלט. לניסוי הזה אין זכות קיום.\n\nבכל הניסויים די חוזרים על אותו הדבר. אותם פיתוחים, וכמעט לגמרי אותן טכניקות בקרה.\n\nבסה\"כ שתי נקודות שבאות די בסבבה אם כי יש הרבה רגעים לא מעניינים במיוחד. נותן את ההיבט הפרקטי של בקרה 1.", "timestamp": 1597824311800}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המדריך: גבי\nחוות דעת:\n6 ניסויים שדי חוזרים על אותו רעיון. בכל ניסוי מבצעים בקרה על מערכת מעט שונה.\nבתחילת כל ניסוי יש בוחן, ואחרי הבוחן המדריך שואל שאלות בע\"פ לראות אם הגענו מוכנים.\nבבחנים יש שאלות גם על דברים  מדו\"ח ההכנה וגם שאלות שדורשות הבנה עמוקה יותר של תכנון בקרים (חומר של בקרה1, לפעמים גם חומר של בקרה 2)\nהמדריך נחמד מאוד ועוזר מאוד. יחד עם זאת הבחנים שלו קצת קשים והשאלות שהוא שואל אחרי הבוחן גם.\nדו\"חות הכנה חופרים באמת.\n\n\nהשורה התחתונה: אם חייבים לקחת מעבדה, ממליצה על הקורס הזה. אם לא חייבים לקחת מעבדה, באופן אישי לא חושבת שכדאי בגלל העומס שזה מוסיף במהלך הסמסטר. מצד שני אלו 2 נקודות עם ציון טוב אז לשיקולכם.", "timestamp": 1685525754054}, {"author": "דוברת אמת", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: גבי דוידוב\nחוות דעת - \nיש 6 מפגשים , חלקם מעניינים וחלקם פחות.\nגבי עושה בחנים של שעה בבוקר לפני תחילת המעבדה. \nשואל גם בכתב וגם בעל פה, לפעמים השאלות נוגעות גם בחומר של בקרה 2 למרות שדרישות הקדם הן רק בקרה 1.\nמפעיל שיקול דעת שגוי ונותן ציונים נמוכים יחסית למידת המוכנות / השקעה.\n\nשעורי הבית:  12 דוחות - הכנה + סיכום, חופרים ברמות ולא שווים את השעות שיושבים עליהם.\n\nהשורה התחתונה: לא לקחת . בשביל 2 נקז תקחו מל\"ג. ואם אתם כבר מחליטים לקחת את הניסויים של בקרה, תוודאו היטב שגבי דוידוב לא המדריך שלכם.", "timestamp": 1689140873045}]}