{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: \nההרצאות בסדר, לעיתים רחוקות מעניינות אבל לרוב די משעממות כי יש פיתוחים מתמטיים של מה שרואים בתרגולים,\nחשוב לשים לב שגם אם ההרצאות מרגישות מיותרות, בשני המועדים הסמסטר היה חשוב להכיר את החומר בהרצאות (שלא בהכרח מועבר/מודגש בתרגולים ובסדנאות), ככה שאם יש זמן לקראת המבחן להכניס מעבר על ההרצאות והפיתוחים זה יכול לעזור.\n\nשם המתרגל/ת: יגאל וגם מיכאל \nחוות דעת - תרגולים: \nיגאל מסביר מעולה את הבסיס - אבל מתקדם מאוד לאט, ולרוב לא מספיק לפתור את כל התרגילים. עם זאת, הוא דואג לחזור ולהסביר באופן ברור את הדגשים.\nמיכאל יותר מאוזן, מספיק את כל התרגול ומסביר בסדר.\nממליץ קצת יותר על יגאל - במיוחד לצפות בהקלטות כאשר לומדים למבחן.\n\nשעורי הבית: \nאין שיעורי בית, הגליונות המוצעים בהתחלה (ללא מגן) קצת מסורבלים ולא ברורים אבל הגלינות המאוחרים יותר קצת יותר מזכירים את מבנה המבחן.\n\nהמבחן: \nלא פשוט, אבל עם למידה נכונה לגמרי לגמרי אפשרי.\nממליץ לפתור לא מעט מבחנים שכן הרבה שאלות דומות בעקרונות לשאלות עבר, ויש חשיבות לתרגול בקורס בעיניי.\n\nהשורה התחתונה: \nלא מעניין במיוחד, אבל יש פה ושם דברים נחמדים שלומדים.\nלנסות להקדיש לקורס את הזמן שלו כולל פתרון מבחנים עוד במהלך הסמסטר כדי שהחומר ישקע באמת כמו שצריך.\n\nבוחן אמצע - לרוב ממוצע גבוה ושווה את ההשקעה, 10/20 אחוז מגן בקורס הזה יכולים בהחלט קצת לשפר את הציון הסופי.", "timestamp": 1602921316627}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: מרצה סביר. מדי פעם מציג יישומים שימושיים לנושאים הנלמדים. בהרצאות הוא מעביר תיאוריה כללית של הנושאים הנלמדים הכוללת פיתוחים מתמטיים. אמנם לא תמיד הכי מעניין, אך זה רקע למה שמועבר בתרגולים. בנוסף, חלק מהפיתוחים לא מופיעים בתרגולים אך יכולים להופיע במבחן.\n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: מתרגל מעולה. משתדל מאוד להעביר את הנושאים בצורה הטובה ביותר וניכר שחשוב לו שהסטודנטים יבינו. אחד המתרגלים המסורים והמכבדים שיצא לי לראות.\n\nשיעורי הבית: לא להגשה ועל אף שגם חלקם לא ממש רלוונטיים למבחן, כדאי לפתור אותם במהלך הסמסטר כדי לפתח מיומנות של פתרון תרגילים ולהתנסות בתרגילים שונים\n\nהמבחן: שתי שאלות פתוחות מרובות סעיפים עם חומר פתוח. לרוב המבחן יחסית מאתגר אך לאחר פתרון כמה מבחנים וחזרה על ההרצאות והתרגולים, אפשר \"להבין את הראש\"\n\nהשורה התחתונה: בסך הכול, מדובר בקורס בסיסי שמביא טעימה לנושא אלקטרומגנטיות. בניגוד לדעה הרווחת מהשנים הקודמות, הקורס כבר לא קשה מאוד ובהחלט ניתן להצליח בו", "timestamp": 1615114633008}, {"author": "Dor Akerman", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: \nמתרגל מעולה! מסביר את החומר טוב ונותן אינטואיציה, אכפת לו שהתלמידים יבינו.\nשעורי הבית: לא חובה להגשה\n\nהמבחן: לדעתי היה מבחן הוגן.\n\nהשורה התחתונה:", "timestamp": 1627800068551}, {"author": ".", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מאיר אורנשטיין\nחוות דעת - הרצאות: ממש ממש משעמם\n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: מתרגל יחסית בסדר אבל ממש משעמם. חוזר על החומר בתחילת כל תרגול לאורך זמן וזה מרגיש יותר כמו חצי הרצאה בשילוב עם תרגול.\n\nשעורי הבית: לא להגשה, קצת קשים אבל מסבירים את החומר\n\nהמבחן: לא קשה מדי אבל לא קל מדי. מאוד דומה לשיעורי הבית ולתרגולים\n\nהשורה התחתונה: קורס קשה שהוא כמו שילוב של פיזיקה 2 ממ ומד\"ח סטירואידים. לא מרגיש שהם מנסים להפוך אותו למעניין ופשוט מלמדים מיליון נוסחאות כל הקורס", "timestamp": 1629637404781}, {"author": "אור ברנע", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות:\nהרצאות יחסית סבבה פחות פרקטיות מהתרגולים \n\nשם המתרגל/ת: יגאל ילין\nחוות דעת - תרגולים: \nתותח, מחזיק את כל הקורס\n\nשעורי הבית: \nלא עשיתי\nהמבחן: \nפייר\nהשורה התחתונה: \nתדעו טוב את התרגולים הם התאכלס של הקורס", "timestamp": 1633058930669}, {"author": "דיפול", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: משעממות אבל הסגל יודע שסטודנטים לא באים להרצאות לכן מנסים בה ושם להכניס שאלות שמתבססות על החומר מהרצאות\n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: מתרגל טוב ומאוד נחמד סבל עונה על שאלות וסופר משקיע\n\nשעורי הבית: כדאי כי דומים לשאלות מבחינה  \n\nהמבחן: היום ניגשתי למועד ב היה מבחן סיוט מאוד קשה לא בוחן הבנה כל המבחן פיתוחים מגעילים וארוכים הוסיפו רבע שעה לבחינה אבל לא עזר 🥲מועד א היה קשה אבל בהשוואה למועד ב הוא מקסים וחמוד\n\nהשורה התחתונה: קורס יפה (בלי התיחסות לבחינה שלנו כל מועד הוא דומה לתרגולים ושיעורי בית אצלנו השתנה המצב 🤕) , חבל שהמרצים עושים כך בסמסטר אביב הזה וכותבים בחינה בכדי להתנקם בסטודנטים חבל ואאלא חבל.", "timestamp": 1633696310395}, {"author": "Jh", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מאיר\nחוות דעת - הרצאות: לא הלכתי \n\nשם המתרגל/ת: יגאל \nחוות דעת - תרגולים: מצויין\n\nשעורי הבית: לא עשיתי\n\nהמבחן: מבינוני ++ עד קשה מאוד \n\nהשורה התחתונה: מומלץ וחביב", "timestamp": 1634040752563}, {"author": "Jonathan Korner", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהיה מעניין מאד אבל לא תמיד רלוונטי לקורס\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמעולים מלמדים ומאד ממוקדים שזה כיף\nשעורי הבית: \nאין\nהמבחן: \nקשה אבל הוגן. יש הרבה מבחני עבר ללמוד מהם\nהשורה התחתונה:  חייבים אז חיים", "timestamp": 1641280782571}, {"author": "Hyunjoon Watterson", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה:  מאיר אורנשטיין\nללא ספק יש לו ידע עצום, אבל אינו יודע ללמד. ההרצאות הם פיתוחים מתמטיים מיותרים והוא לא ממש מלמד לעומק, חבל שבזבזתי זמן בהרצאות.\n\nשם המתרגל/ת:  יגאל אלין\nאני יכול די בקלות להגיד שיגאל הוא אחד המתרגלים הכי טובים בתואר עד כה. הוא ממש מבין מה הוא עושה וממש יודע להעביר חומר.\n\nשעורי הבית: אין\n\nבוחן אמצע: דומה לתרגולים.\n\nהשורה התחתונה: קורס של פיתוחים מתמטיים מיותרים. לא כל כך קל להתחבר אליו", "timestamp": 1644000874021}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מאיר\nחוות דעת - הרצאות: לי היה קשה לעקוב וויתרתי באיזשהו שלב. חוץ מכמה נוסחאות פה ושם שלא מראים בתרגולים לא הרגשתי תרומה מיוחדת.\n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: מתרגל תותח, יודע את החומר לעומק ועונה בשמחה על שאלות. \n\nשעורי הבית: גיליונות שבועיים שהם ללא חובת הגשה, אני לא עשיתי אותם במהלך הסמסטר אבל לקראת המבחן כן כדאי לפחות לעבור עליהם אם יש זמן. בדיעבד לעשות אותם במהלך הסמסטר כנראה היה מאוד עוזר לקראת המבחן, אבל כשאין חובת הגשה קל מאוד לוותר.\n\nהמבחן: מבחן ארוך, בהחלט אפשרי אבל צריך לתרגל הרבה לפני על מנת להגיע עם ביטחון וניסיון בשאלות. \nיש בוחן אמצע שמהווה 20% מגן שכדאי מאוד להתכונן אליו, הוא בד\"כ עם ממוצע גבוה וכדאי להצליח בו במיוחד כשאין מגן של ש\"ב.\n\nהשורה התחתונה: בעיניי למרות שהוא קורס לא פשוט ומאוד פיזיקלי, הוא מאוד פותח את הראש וגורם להסתכל על בעיות בצורה הנדסית. הופתעתי לטובה", "timestamp": 1646851340400}, {"author": "Anonymous", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: מרצה סבבה, מאיר אורנשטיין החליף אותו מסיבות אישיות לשתי הרצאות ומאז רק אפשר להעריך יותר ויותר את אמיר. אמיר מרצה שמנסה להעביר מעט אינטואיציות ולשתף אנשים תוך כדי בשאלות, למרות שיש לא מעט פיתוחים מתמטיים. מאיר פשוט רץ על המצגת ולא הסביר כלום \n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון\n\nשעורי הבית: לא להגשה אבל לדעתי כן כדאי לעבור עליהם\n\nהמבחן: היה סבבה\n\nהשורה התחתונה:", "timestamp": 1658903848983}, {"author": "סטונדט 0", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אמיר \nחוות דעת - הרצאות: הרצאות די משעממות אבל עדיף בהרבה(!!!!) על מאיר\n\nשם המתרגל/ת: יגאל \nחוות דעת - תרגולים: מלך העולם, מחזיק את כל הקורס הזה והסיבה היחידה שהבנתי משהו.\n\nשעורי הבית: לא להגשה, מועברים בסדנאות כדאי לעבור לפני המבחן והבוחן אמצע\n\nהמבחן: לא כזה קשה בהתחשב בעובדה שיש חומר פתוח והכל מועבר בתרגולים. מי שמכיר טוב את התרגולים יצליח לקבל ציון טוב. בנוסף יש בוחן אמצע קליל של 20% מגן, שוב, תרגולים.\n\nהשורה התחתונה:", "timestamp": 1662277518749}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אמיר \nחוות דעת - הרצאות: הרצאות מאוד משעממות .. החומר קצת קשה להבנה ולא מועבר בצורה ברורה. לקראת אמצע הסמסטר הפסקתי ללכת \n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: מתרגל ממש ממש מעולה! מעביר את התרגולים בצורה נלהבת וגורם לחומר להישמע מעניין. מאוד אכפתי ונחמד.\n\nשעורי הבית: אין\n\nהמבחן: מבחן מאוד הוגן אבל יחסית ארוך, שתי שאלות עם שמונה תשעה סעיפים כל אחת. לפתור הרבה מבחנים ולנסות גם להבין אותם.\n\nהשורה התחתונה: שורדים :)", "timestamp": 1668893740644}, {"author": "RFID", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מאיר\nחוות דעת - הרצאות: לא הלכתי, והן לא נחוצות, יש רק פיתוחים מתמטיים שאפשר לקרוא לבד ולא להבין כי הם באמת לא רלוונטיים\n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: תותח, רוצו אליו\n\nשעורי הבית: לא להגשה, ממליץ לעשות אותם בכל זאת, עוזרים להבנה\n\nהיה בוחן אמצע קליל עם 20% מגן, שווה לעשות אותו\n\nהמבחן: מועד א שלנו היה קשוח, היו כמה סעיפים שכנראה הגיעו מהחלל החיצון, והוא שונה בהרבה ממועדים קודמים.\nלצורך השוואה, ממוצע מועד א אצלנו היה 43...\n\nהשורה התחתונה: קורס מאוד פיזיקלי ומאוד טכני, החומר עצמו קשה ולא קל להתחבר אליו, אבל בכל זאת רואים כמה דברים נהדרים בעולם האלקטרומגנטיות, והיה בסדר בסופו של דבר. \n\n קורס חובה ¯\\_(ツ)_/¯", "timestamp": 1677773827266}, {"author": "Yaniv Slor Futterman", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: \nמרצה נחמד מאוד. עדיף מאוד כשהוא מעביר פיזית ולא בזום\n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: \nמרצה מצוין. חובה להגיע אליו. הרבה יותר חשוב מההרצאות\n\nשעורי הבית: ארוכים אבל שווים את זה. אצלנו הם לא היו להגשה וזה חבל כי הרבה לא עשו אותם. מאוד מאוד מומלץ, זו ההכנה הכי טובה למבחן שאפשר\n\nהמבחן: בסדר. 2 שאלות ארוכות מרובות סעיפים. אם מתרגלים מבחנים לפני ועושים את הגליונות אפשר להצליח יפה\n\nהשורה התחתונה: קורס לא רע. לא כל כך חידש ביחס לפיזיקה 2פ' עד שמגיעים לשליש של סוף הקורס (קוואזי סטטי + קיטוב) אבל עדיין נחמד סך הכל", "timestamp": 1689771733076}, {"author": "יגאל מלכנו", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: \nפשוט תותח. אין על יגאל. מסביר את החומר מדהים. לכו רק אליו (או שהוא סיים את הדוקטורט והקורס הופך להיות גרוע)\nשעורי הבית: \nאין\nהמבחן: \nהיה קשה אבל נחכה לציונים\nהשורה התחתונה: \nקורס חמוד, מי שמתחבר שיחכה עם לבחור בשרשרת פוטוניקה כי יש את גלים.", "timestamp": 1690054965176}, {"author": "איציק זרקא", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: אמיר מנסה, ובסה\"כ הוא אדם די חמוד, אבל קשה לי לראות את התועלת בהרצאות. כל מה שלמדתי הסמסטר למדתי מהתרגולים, ופרט מלחזור על דברים מההרצאה לקראת המטלת כיתה (מה שלא עזר באמת), לא באמת פתחתי את דפי ההרצאות. היו 2-3 הרצאות מעניינות, אבל השאר היו פרווה.\n\nשם המתרגל/ת: יגאל פרונטלי\nחוות דעת - תרגולים: מלך, כל מה שאני יודע בקורס זה הודות לו. נותן הרבה אינטואציה לדברים שנעשים בקורס, והתרגולים שלו והחשיבה מאחוריהם הם הסוד להצלחה במקצוע הזה לדעתי. \n\nשעורי הבית: \nשיעורי בית מאוד מוגזמים ביחס לשיעורי בית לא חובה שלא מקבלים עליהם מגן, אני עשיתי עד אזור הבוחן אמצע ומאז כבר לא היה לי זמן, אולי עלה לי בכמה נקודות בציון הסופי אבל הם באמת ארוכים בצורה לא הגיונית.\n\nהמבחן: לא קל בכלל. יש בו כמות יחסית גדולה של נקודות שמצריכה שליטה טובה עד טובה מאוד בחומר, ולמידה טובה לפניו.\nיש בוחן אמצע שכדאי ללמוד אליו כי הוא נותן מגן די סביר, ואחרת אין למקצוע הזה מגן כמעט בכלל.\n\nהשורה התחתונה: לא קורס סיוט כמו שעשו ממנו לדעתי, אבל גם לא מעניין בצורה מטורפת. קורס מומלצת די ממוצע", "timestamp": 1690813659380}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: ההרצאות בסדר סך הכל, הרבה פיתוחים מתמטיים של הדברים שאחרי זה רואים בתרגילים ואיך מגיעים לכל מיני תוצאות, אין רשימות רשמיות של אמיר אלא סיכום של סטודנטים שברובו מספיק קרוב אבל לפעמים קצת חורג. אמיר כן רוצה שיבינו, אבל לפעמים קצת קשה לעקוב. סך הכל סבבה\n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: מתרגל מצוין, מעביר את הקורס הזה כבר כמה שנים טובות ורואים את זה. מדגיש את כל הדברים הקריטיים ושם כל מיני טיפים למבחן, אם אפשר ללכת אליו פרונטלית עדיף אבל היו לו גם הקלטות מלפני שנתיים שהסגל פרסם. בעיקר התרשמתי מההתלהבות שהוא מעביר בה את החומר גם אחרי כל כך הרבה זמן.\n\nשעורי הבית: אין שיעורי בית חובה. יש גיליון שמפורסם כל שבוע שבערך מאמצע הקורס מכיל בעיקר שאלות ממבחנים. כמו כן יש בוחן אמצע שבגדול אמור להבטיח מגן במקום השיעורי בית. אישית עשיתי את השיעורי בית ממש עד לשבוע האחרון, כן ממליץ בחום למי שיכול כי אחרת יוצא שמתרגלים את רמת השאלות שפרקטית יהיו במבחן (השאלות של הבוחן אמצע לא ברמה בכלל) רק בלמידה למבחן וזה קשוח.\n\nהמבחן: חומר פתוח לגמרי ושתי שאלות ארוכות. מהלמידה שלי נראה שברוב המבחנים של אמיר יש 80~ נק' שמורכבות מחומר שראינו בעבר בתרגולים / שיעורי בית / מבחנים ו-20~ נק' שהם צריכים להמציא את הגלגל מחדש קצת בגלל שמדובר בחומר פתוח. בדיקה קשוחה, גם בחומר המוכר צריך לדייק בשיקולים הפיזיקליים ובדרישות שלה. סך הכל מבחן לא קל אבל אם מתרגלים מספיק אפשר לסגור את הנק' שמוכרות ואז אפשר להוציא ציון סבבה.\n\nהשורה התחתונה: קורס אחלה סך הכל, החומר עצמו למי שעושה 2פ' (לא יודע בנוגע ל-2מ', מניח שגם שם מאוד דומה) לא מחדש יותר מדי עד לכמה שבועות האחרונים, אולי עם העמקה יותר גדולה בכל הנושא של גלים. אם לא עושים שיעורי בית כמעט ולא דורש כלום לאורך הסמסטר, אבל עדיין ממליץ לעשות כדי לוודא שעל + יש סדנאות רשות שעוברים על השיעורי בית שגם בכמה פעמים שהלכתי היו סבבה והביאו עוד נק' ששווה לשים לב אליהן.", "timestamp": 1691297784538}, {"author": "a", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: \nניכר שלאמיר יש רצון טוב, אבל ההרצאות לא טובות, קשה לעקוב אחריהן ומלאות בפיתוחים מתמטיים. אי אפשר להבין מה רלוונטי ומה רק היה פיתוח, ובאופן כללי הן לא כאלה חשובות להבנה במבחן.\nשם המתרגל/ת: יגאל אילין.\nחוות דעת - תרגולים: \nמלך, תותח, פנומן, אחד המתרגלים הכי טובים שיצא לי לפגוש, לפחות בטופ 3 אם לא טופ 1. מסביר את כל מה שלא היה ברור בהרצאות, יודע להבדיל בין תפל לעיקר ועדיין מצליח לענות לכל שאלה בלי לצאת מהקו של התרגול. יודע בדיוק מה צריך בקורס, בלי התרגולים שלו לא חושב שאפשרי להצליח.\nשעורי הבית: \nלא חובה, ממליץ כן לפחות לעבור עליהן בשביל להגיע לסדנאות, שבעיניי אם נמצאים בקבוצה קטנה יכולים להוסיף קצת להבנה של איך לגשת אליהן.\nהמבחן: \nמועד א שלנו היה די קשה וארוך. באופן כללי יש מבוחנים קשים עד לא פתירים וכמה סבירים, אבל הממוצע הכללי שלהם הוא קשה.\nהשורה התחתונה: קורס שלדעתי היה מאוד מעניין ברובו, והופך המון נושאים מוזרים בפיזיקה 2 למובנים וברורים יותר.", "timestamp": 1692008961296}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: אישית פחות התחברתי אבל אין חלופה אחרת\n\nשם המתרגל/ת: יגאל\nחוות דעת - תרגולים: ראיתי מוקלט כי לא הסתדר לי בלוז אף תרגול, הוא מסביר דיי טוב\n\nשעורי הבית: לא להגשה, דיי קשים, מומלץ לעשות לפני המבחן, בכל אופן פותרים אותם בסדנאות אם מסתבכים ויש פיתרון רשמי\n\nהמבחן: עם חומר פתוח, הוא דיי חוזר על עצמו בטריקים פרט לבערך 2 סעיפים בכל שאלה\n\nהשורה התחתונה: קורס חובה", "timestamp": 1705162878846}, {"author": "ילדת הימוהולדת", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לא ראיתי הרצאות\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: \nיגאל המתרגל הכי טוב שהיה לי בתואר עד כה. בפער.\nשעורי הבית: \nאין, יש גיליונות שכדאי לעשות כי הם עוזרים במבחן אבל הם לא חובה.\nהמבחן: \nזוועה. פקטור מצחיק של נקודה אבל בסדר.\nהשורה התחתונה: \nקורס מעניין, מבחן קשה. אין מה לעשות.", "timestamp": 1705345882616}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: מונוטוני ברמות אבל לא היו הקלטות נורמליות אז לא הייתה חלופה\n\nשם המתרגל/ת: יגאל מוקלט\nחוות דעת - תרגולים: שינו את התרגול היחיד שהתאים לי ביום הראשון של הסמסטר אז ראיתי מוקלט של יגאל, הוא דיי טוב\n\nשעורי הבית: לא להגשה לתרגול אישי, אישית את רובם לא עשיתי רק חלק כזה לפני המבחן, יש סדנאות שעוברים בהם על השיעורי בית, גם להם יש הקלטות\n\nהמבחן: היה הוגן, דומה למבחני עבר\n\nהשורה התחתונה: קורס חובה, אם לא חובה דיי משעמם אז לא הייתי לוקחת, והציונים בו לא כאלה טובים", "timestamp": 1717009779907}, {"author": "קואקסיאלי הקוקסינל", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מושה\nחוות דעת - הרצאות: לא הלכתי, מיותר ומשעמם, אחרי הרצאה אחת פרשתי.\n\nשם המתרגל/ת: יגאל אילין\nחוות דעת - תרגולים: אחלה יגאל, מתרגל אש. אני ראיתי מוקלט אבל נראה לי עדיף ללכת פרונטלי כי זה קורס מגעיל וקשה קצת להבין את החרא הזה.\n\nשעורי הבית: גיליונות אחת לשבוע שהם לא להגשה, אצלנו במבחן הייתה שאלת שיעורי בית. תכלס שווה לפתור/ ללכת לסדנאות ששם פותרים, כי אלו שאלות די דומות לשאלות מבחן (לפחות חלקן).\n\nהמבחן: חרדה. \n\nהשורה התחתונה: לא להתקרב!!! ומי שחייב- רבים עשו את זה לפניכם ועברו, אתם גם תצליחו...", "timestamp": 1717944499855}]}