{"posts": [{"author": "עייפות בע\"מ", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nיובל בק\n\nשם המתרגל/ת: \nנועה זרגרי\n\nשעורי הבית: \n4 מתוך 5 גיליונות חובה בסמסטר שלי. 10% מהציון.\n\nהמבחן: \nסביר והוגן אם לומדים טוב, רק שאין הרבה דוגמאות ללמוד מהן.\n\nהקורס שונה לחלוטין הסמסטר עם דגש משמעותי על PV במקום על שנאים כפי שהיה בעבר. יובל מרצה בת\"א. כתוצאה מהשינוי וחוסר ההיכרות של יובל עם הסילבוס של הפקולטה החומר לא מאורגן הכי טוב, אבל בהחלט אפשר ללמוד מהשקפים. ממליץ מאוד על התרגולים. מקווה שכל הבעיות שנלוות לשינוי משמעותי בסילבוס יסודרו עם השנים.\n\nלגי סילבוס הקורס:\n- תזכורת על רשת החשמל\n- הרמוניות זרם/מתח כתוצאה מעומסים לא לינאריים.\n- מנוע/גנרטור DC\n- מנוע/גנרטור תלת-פאזי\n- כל הבסיס הטכני של PV (החל מזוויות ועד לעבודה בנקודת הספק מקסימלי ותכן מאגרי אנרגיה)", "timestamp": 1597826644300}, {"author": "Guy Harel", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יובל בק \nחוות דעת - הרצאות: היה מוצלח ומעניין, היה נושא אחד פחות ברור (הרמוניות) שבתקווה יחדדו לסמסטר הבא.\n\nשם המתרגל/ת: נעה זרגורי\nחוות דעת - תרגולים: היו קצת בעיות של פעם ראשונה שעובר, אבל התרגולים היו נוחים ומסודרים כי היו מקולדים במקביל לתרגולים\n\nשעורי הבית: לא עמוסים מדי, עוזרים להבנה. \n\nהמבחן: היה יותר מבלבל מהצפוי והיו חסרים קצת מבחני עבר לתרגול, אבל פתיר.\n\nהשורה התחתונה: אחלה קורס, מומלץ", "timestamp": 1599217930319}, {"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רם מחלב\nחוות דעת - הרצאות: מעניינות. פה ושם יש טעויות בנוסחאות או מושגים מבלבלים, אך רם משתדל מאוד להבהיר הכול (לעיתים זה קורה אחרי ההרצאה)\n\nשם המתרגל/ת: ליעד סויסה\nחוות דעת - תרגולים: מתרגל מעולה. מסביר ממש טוב\n\nשעורי הבית: יש חמישה גליונות יבשים, מתוכם חובה להגיש ארבעה. הגליונות לא קשים מדי ולעיתים ממוחזרים. הם נותנים הזדמנות טובה לתרגול הנושאים מההרצאות והתרגולים.\nיש גם תרגיל תוכנה שדורש יותר השקעה מהגליונות היבשים, אך הוא ממש נחמד ומלמד\n\nהמבחן: צריך ללמוד טוב אך הוגן מאוד\n\nהשורה התחתונה: מומלץ מאוד. שילוב מוחץ של קורס מעניין ומלמד ושל סגל הוגן שבא לקראת הסטודנטים", "timestamp": 1658058749011}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רם מחלב\nחוות דעת - הרצאות: נחמד, ההרצאות מועברות במצגת (מה שכבר מוריד מאיכות ההרצאה עצמה) והן לא מעניינות במיוחד כך שקל לאבד את רם.\n\nשם המתרגל/ת: ליעד \nחוות דעת - תרגולים: אחלה של מתרגל, אחלה של תרגולים. שווה לבוא\\לראות את ההקלטות.\n\nשעורי הבית: יחסית קלילים מלבד הרטוב שאמנם לא לוקח המון זמן אבל הבדיקה שלו קשוחה ממש והוא מוריד המון מהציון של ש\"ב. שווה להשקיע בו ולוודא שאין טעויות.\n\nהמבחן: \nצריך לתרגל, וסה\"כ העקרונות חוזרים על עצמם מהתרגולים וההרצאות. עם זאת זה לא מבחן כזה פשוט בעיני.\nהשורה התחתונה:  הקורס הולך לעבור שינוי עכשיו, לדעתי זה לטובתו כי חצי מהקורס סתם התבזבז על מנועים (וזה גם החלק שמועבר הכי פחות טוב). אם לוקחים שרשרת של הספק שווה לקחת אותו.", "timestamp": 1705431528759}]}