{"posts": [{"author": ":)", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: טובות, החומר מועבר בקצב בינוני, המרצה מסביר את החומר בצורה טובה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טובים\n\nשעורי הבית: קושי בינוני, עוזרים להבין את החומר\n\nהמבחן :קושי בינוני\n\nהשורה התחתונה:", "timestamp": 1603550644712}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יצחק\nחוות דעת - הרצאות: \nטובות סה\"כ\nשם המתרגל/ת:אור \nחוות דעת - תרגולים: תרגולים טובים סה\"כ \n\nשעורי הבית:  רמה סבירה , יבשים לא ארוכים מאוד\n\nהמבחן: ברמה גבוהה משמעותית מהתרגולים והש\"ב , הכל מקרים מנוונים לעומת מה שקורה במבחן . לדעתי קצת מוגזם\n\nהשורה התחתונה: \nלתרגל המון לקראת המבחן , להיות על החומר בסמסטר זה מעולה אבל זה לא נותן המון אינדיקציה בגלל הפער בין המבחן לקורס עצמו.", "timestamp": 1611761482797}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: \nמרצה מעולה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאפשר ללמוד את התרגולים באופן עצמאי מהפי.די.אף - ברורים ומעולים\n\nשעורי הבית: גליונות שבועיים. חלק פשוטים וחלק לא אבל מאוד חשוב ועוזר להתכונן למבחן כבר במהלך הסמסטר\n\nהמבחן: קשה אך הוגן צריך לתרגל מספיק מבחנים כדי להבין את הטריקים. לרוב שואלים על אותם הנושאים\n\nהשורה התחתונה:", "timestamp": 1614188471113}, {"author": "Yahav vinokur", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יובל קסוטו\nחוות דעת - הרצאות: \nדי מעניינות, מאד לעניין\nשם המתרגל/ת: גל אסא\nחוות דעת - תרגולים: \nאחלה תרגולים. מאד פרקטיים\nשעורי הבית: \nלעשות. ממש לעניין, פתירים, עוזרים לחזור על החומר.\nהמבחן: \nיובל עשה מבחן קצת טריקי. להיזהר.\nהשורה התחתונה: \nקורס חובה מבחינתי, אבל לא נורא בכלל", "timestamp": 1626851990245}, {"author": "Daniel Stumler", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יצחק\nחוות דעת - הרצאות: מהמרצים הטובים שהיו לי בתואר. מעביר את החומר בצורה מעניינת ומאוד אכפת לו שהסטודנטים יבינו. \n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: מתרגל טוב מאוד. \n\nשעורי הבית: היבשים סבירים ביותר, הם נלקחו ממבחנים (או מבוססים על שאלות ממבחנים). הרטוב די לא מובן אבל מסתדרים.\n\nהמבחן: המועד האחרון היה הוגן מאוד. חשוב לתרגל הרבה לפני. (בדומה להסתברות ולאקראיים)\n\nהשורה התחתונה: לא קורס קל אבל בהחלט מומלץ.", "timestamp": 1644515888570}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: מרצה סבבה, לי היה קצת קשה להבין אותו אבל הוא בסדר גמור.\n\nשם המתרגל/ת: גל \nחוות דעת - תרגולים: מתרגל מסמסטר שעבר, לא ראיתי בלייב ולכן הלכתי אליו. \n\nשעורי הבית:  יחסית קצרים, אבל יש כל שבוע.. חשוב לעשות, נלקחים ברובם ממבחנים ולכן משקף רמה ועוזר להבין את החומר.\n\nהמבחן: מבחן מאוד הוגן.. הממוצע מדבר בעד עצמו\n\nהשורה התחתונה: לא הרגשתי שלמדתי בצורה מטורפת בקורס אבל מהווה בסיס לתחום..", "timestamp": 1644526676802}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: ממש אחלה, מעביר בצורה מעניינת.\n\nשם המתרגל/ת: חן בר\nחוות דעת - תרגולים: מתרגל מעולה. בנוסף, התרגולים כתובים בצורה טובה מאוד ורלוונטיים לשיעורי בית. \n\nשעורי הבית: יש רפרנסים, נראלי שהכל ממבחני עבר ועוזרים להיות עם יד על הדופק.\n\nהמבחן: אצלנו היה מבחן הוגן. המבנה של המבחן יחסית קבוע וזה מאוד עוזר להתכונן. לא פשוט אבל אחרי שמתרגלים הרבה מכל נושא הדברים חוזרים על עצמם פחות או יותר.\n\nהשורה התחתונה:", "timestamp": 1644660612236}, {"author": "רון", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פרופ' יצחק קסלסי\nחוות דעת - הרצאות:  מרצה מצויין, מעביר את החומר בצורה עניינית ואינטאוטיבית, מלמד גם חומר שקשור לתעשיה...\n\nשם המתרגל/ת: חן בר\nחוות דעת - תרגולים: מתרגל טוב \n\nשעורי הבית: \nהיו 11 תרגילי בית סה\"כ, שבועיים, כך שאחד מהם רטוב . התרגילים הם ממבחני עבר וניתן לרפרנס אותם בקלות.\nכל התרגילים הם רשות ומהווים 16% מגן לכל היותר (5% על הרטוב, וכל יבש 1%)\n\nהמבחן: \nבמועד הזה ספיציפית היה מבחן לגמרי הוגן.\n יש לתרגל המון מבחנים וחשוב להבין הסתברות ברמה טובה ע\"מ לצלוח את השאלות (מ\"א גיאומטרי, פואסוני, אקספוננציאלי... לא מעבר)\nהמבחן מכיל 4 שאלות שעוסקות בנושאים של אינטרנט, תורת התורים, רשתות אלחוטיות, פרוטוקולים אמינים. \nהשורה התחתונה: \nקורס בסיסי ברשתות שמכיל חומר שכל מהנדס חשוב שיכיר. \nמתעסק במבנה האינטרנט ואיך הכל מתנהל שם, אבל גם נכנס לנושאים הסתברותיים באינטרנט כמו ניתוח תורים ברשת, נצילות פרוטוקולים... שעליהם מוטל (לצערינו) יותר דגש במבחן. \nחשוב לפתור את תרגילי הבית במהלך הסמסטר, למרות שהם רשות.", "timestamp": 1644661905393}, {"author": "הליקופטר", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יצחק\nחוות דעת - הרצאות: הרצאות די מעניינות ולא קשות מידי להבנה. יצחק מרצה סבבה ומאוד אכפת לו מהסטודנטים והוא יסביר מחדש כל שאלה שעולה.\n\nשם המתרגל/ת: אור(מוקלט)\nחוות דעת - תרגולים: תרגולים מעולים! עוברים טוב על החומר בהתחלה ואז פותרים כמה תרגילים. פרקטיים ולעניין. \nראיתי הקלטות של אור מסמסטר אביב הקודם והוא היה אחלה.\n\nשעורי הבית: גליון יבש כל שבוע - חלק קשים יותר וחלק פחות, בגדול מאוד מרופרנסים ותורמים להבנה של החומר, שווה לעשות. יש בנוסף רטוב אחד באמצע הסמסטר שהוא מאין סימולציה ומאוד תיאורטי שהוא לוקח איזה יומיים עבודה אבל לא קשה בכלל.\n\nהמבחן: חומר פתוח, רובו מאוד מתמטי וטריקי. כדאי לתרגל הרבה מבחנים מראש בשביל האינטואיציה אבל בגדול יצחק אמר בעצמו שהם מנסים כל פעם למצוא טריקים חדשים בשביל שסטודנטים לא פשוט יעתיקו את הפתרון ממבחן עבר מודפס.\nלדעתי שווה לעבור על התרגולים זריז ואז ישר לפתור כמה שיותר מבחנים.\n\nהשורה התחתונה: קורס מעניין, מקנה ידע די בסיסי בהרבה נושאים ברשתות אינטרנט ובסך הכל לא קשה מידי ואפשר להשיג ציון טוב. לא נכנסים יותר מידי לעומק של כל הפרוטוקלים והנושאים אלא בעיקר עוברים לרוחב על הרבה נקודות ובסופו של דבר המבחן בודק בעיקר בפן הטכני.", "timestamp": 1644866287199}, {"author": "Adi Tal", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 10 גליונות יבשים (יחסית קלים,ויש רפרנסים להכל) ועוד רטוב אחד שלוקח כמה שעות לעשות ולא כזה קשה\n\nהמבחן: 4 שאלות פתוחות, יש בו לא מעט חישובים מהסתברות שזה החלק הקשה של המבחן\n\nהשורה התחתונה: נהניתי מהקורס לא עמוס מידי ויחסית מעניין", "timestamp": 1644923558914}, {"author": "מל", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: מרצה נחמד ולרב די מובן. ההרצאות עצמן מעניינות ולמעט נושאים ספציפיים לא קשות מדי להבנה.\n\nשם המתרגל/ת: נעה כהן\nחוות דעת - תרגולים: מתרגלת מצוינת! התרגולים בנויים טוב ועוזרים להבנת החומר. \n\nשעורי הבית: קלילים. גיליון פעם בשבוע שלוקח שעתיים-שלוש לסיים אם פותרים לבד. רטוב אחד שלוקח יותר זמן.\n\nהמבחן: סביר לגמרי אחרי תרגול מספיק, הנושאים יחסית חוזרים על עצמם.\n\nהשורה התחתונה: אחלה קורס, מעניין ולא קשה מדי.", "timestamp": 1646118971071}, {"author": "ALOHA", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: \nמרצה טוב, מסביר את החומר באופן ברור ונותן הרבה אנלוגיות ודוגמאות אבל בהחלט אפשר להסתדר בלי  ההרצאות\nשם המתרגל/ת: נעה כהן\nחוות דעת - תרגולים: מתרגלת טובה, במיוחד בפן הבין-אישי\nשעורי הבית: יבשים+ תרגיל רטוב אחד \nתרגילי בית מאוד מלמדים הם בעיקר לקוחים ממבחנים ולכן שווה לעשות אותם. \nהמבחן: הוגן, אך צריך לשים לב לכל מיני טריקים קטנים. אם פותרים מלא מבחנים אין סיבה לא להוציא ציון טוב \n\nהשורה התחתונה: נהניתי מהקורס, שווה לעשות במיוחד אם אתם אוהבים הסתברות", "timestamp": 1658232796876}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: \nהההרצאות התחילו יחסית בסדר, רק שבשלב מסוים יצחק הגביר קצב עם החומר.\nלדעתי הוא דיבר מהר מידי בהרצאות, ועבר על נקודות בחומר שבשבילו הם טרוויאליות, אבל היה צריך להתעכב עליהם יותר בשביל הבנה.\nהיתרון היה שהוא סיים את כל החומר בשבוע 10, אבל עדיין הייתי צריך לחזור על כל ההקלטות של יובל באמת כדי להבין את החומר.\n\nשם המתרגל/ת:  נועה + וידאו\nחוות דעת - תרגולים: \nהייתי בשתי תרגולים של נועה בתחילת סמסטר, והיא באמת הייתה בסדר, פשוט הכיתה הייתה מפוצצת עד אפס מקום אז עברתי לוידאו.\nשני המתרגלים בוידאו ממש אחלה, רק חסר קצת דברים שמועברים בחורף ולא באביב (המתרגלים מהאביב), לא משהו שאי אפשר להשלים לבד מהדפי תרגול.\nבנוסף אפשר לבחור בניהם שאחד עם כיתה ולוח והשני היה רק בזום.\n\nשעורי הבית: \nהשיעורי בית הם פשוט שאלות ממבחנים. עברתי עליהם לעומק לפני המבחן, הבאסה היחידה שהמטלות שבועיות מה שנותן וייב קצת של סמסטר א'.\nיש תרגיל בית אחד שהוא סימולציה, שלא הרגשתי שבאמת עזר בהבנה של החומר והיה יותר העשרה כללית.\nסה\"כ 15 אחוז מגן.\n\nהמבחן: \nהחלוקה במבחן הייתה ברורה.\nהיו 4 שאלות כל אחת 25 נקודות.\n2 שאלות היו קלות (סיימתי אותן בפחות משעה).\nשאלה אחת הייתה בינונית +, כאשר הסעיפים האחרונים שלה היו קשים.\nושאלה אחת קשה שהתבססה על איזה נספח מאחד התרגולים עם טריקים שלא למדנו.\n\n\nהשורה התחתונה: \nבוא נגיד שהרבה המליצו לי על הקורס כקורס בחירה, ולקחתי אותו מתוך עניין וגם כי הוא קשור במקצת לתחום עבודה שלי.\nבדיעבד הבנתי במבחן למה הממוצע יציב בדרך כל על 75, וכי יש הבדל חד במבחן בין השאלות הקשות לשאלות הקלות.\nאם אתם מחפשים על קורס בחירה קליל בשרשרת מחשבים הייתי שוקל לקחת קורס אחר שאפשר להוציא בו יותר בקלות ציון גבוה.", "timestamp": 1675238992278}, {"author": "לא אהבתי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יצחק\nחוות דעת - הרצאות: מהיר מדי , מלמד בצורה לא מעמיקה\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מסבירה בסדר , ברמה המנהלתית קצת \n\nשעורי הבית: או ממש קלים , או לא פתירים\n\nהמבחן: היה הוגן (?) מחכה לציון כבר חודש אז נראה לפי הממוצע\n\nהשורה התחתונה: סגל שעושה טובה שהוא קיים, לא הרגשתי שלקחתי ממש משהו מהקורס. חבל", "timestamp": 1676452121949}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "אמ\"לק: קיבלתי ציון טוב בקורס, עדיין מגיע לו דיס לדעתי.\n\nשם המרצה: יצחק קסלסי\nחוות דעת - הרצאות:  יצחק מרצה קליל ונחמד. כל הרצאה הוא שואל אם הכל בסדר עם השיעורי בית והתרגולים והוא כן מביע עניין בסטודנטים, אבל אם תבואו לשאול אותו משהו על שיעורי הבית הוא כנראה ישלח אותכם למתרגלות. הוא טס על החומר ויוצא שהוא בדרך כלל מסיים את ההרצאות בשבוע 10, לטובה ולרעה. זה כן מפנה זמן בסמסטר אבל לא תצאו עם הרגשה שהבנתם מה באמת קרה בהרצאות.\n\nשם המתרגל/ת: נעם ואז מוקלטים של גל אסא.\nחוות דעת - תרגולים: נעם מעבירה את התרגולים בצורה טובה אבל אם לא מסתדר במערכת אפשר לעבור למוקלטים. יש מדי פעם הבדלים בין המצגות העדכניות לבין ההקלטה אז מומלץ לעבוד עם החומר העדכני בצמוד להקלטה.\n\nשעורי הבית: גליון שבועי עם שותפים, סימולציה אחת במכונה וירטואלית. הגליונות השבועיים כוללים 2 שאלות חובה ובדרך כלל עוד אחת לא להגשה. הן כמעט תמיד שאלות ממבחנים אז מומלץ לחפש רפרנס במבחני עבר למרות שלא תמיד קל למצוא פתרונות אליהם. מכיוון שאלו שאלות מבחינות, הן ברמה גבוהה של בחינה ולא תמיד מובן מה רוצים או איך לגשת לפתרון.\n\nהמבחן: המבחן הוא 4 שאלות, עם חומר פתוח. לרוב יש פורמט די קבוע של שאלה על תורת התורים, פרוטוקולים אמינים לתקשורת, רשתות אלחוטיות(לא מה שאתם חושבים, ראו בהמשך) ומודל האינטרנט. יש שאלות קשות יותר וקשות פחות.\n\nהשורה התחתונה: בסופו של דבר, לא מה שהייתם מצפים בקורס ברשתות. עוברים על המודלים העיקריים של איך עובד אינטרנט ב-high level מאוד מבלי ירידה ליישומים או למימושים. מה כן תדעו אחרי הקורס?\nתדעו לא רע לגשת לבעיות של תורת התורים, שאלות שמתבססות מאוד חזק על הסתברות.\nתדעו איך עובדים פרוטוקולים שמספקים אמינות בתקשורת באינטרנט בצורה תיאורטית.\nתדעו איך שולחים כמה הודעות על גבי טווח משותף בשיטת ALOHA.\nניכר מההכנה למבחן שהדגש הוא על לדעת טוב הסתברות ולדעת לפתור כל מני סיטואציות תיאורטיות ודמיוניות בנוגע לשיפורים כאלה ואחרים בפרוטוקולים למעלה, במקום לדעת למשל, איך הם ממומשים בפועל בחומרה או תוכנה.\nאני אישית התאכזבתי, אבל לשיקולכם :)", "timestamp": 1677579838878}, {"author": "י'", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: \nמרצה בסדר גמור, רואים שאכפת לו מהסטודנטים שלו.\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: \nמוקלט- אחלה מתרגל, מבין את החומר ונותן דגשים חשובים\nשעורי הבית: \nסביר\nהמבחן: \nהמבחן חוזר על עצמו מאוד ככה שאם פתרתם 6 מבחנים אחרונים והבנתם הכל, הסיכוי להצליח הוא ענק\nהשורה התחתונה: \nקורס מעניין בטירוף, בייחוד לאנשים שבאים בלי רקע על איך עובד האינטרנט. מקבלים הבנה כללית נחמדה מאוד כמעט ברמה של ידע כללי כזה. מה שמקשה על הקורס זה החלק המתמטי הסתברותי (תורת התורים) והחישובים שיש בחלק של פרוטוקולים. לדעתי דווקא היה מעניין ללמוד קצת על תורת התורים, לא מכיר קורס פקולטי נוסף שנוגע בזה.\nלסיכום אחלה של קורס, אפשר לסכם את הקורס כקורס\n ידע כללי + הסתברות .\nממליץ מאוד כי להבין קצת איך עובד האינטרנט, וכמה זה מורכב היה mind-blowing.", "timestamp": 1678368160103}, {"author": "TCP", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יצחק קסלסי\nחוות דעת - הרצאות: ההסברים לא מאוד ברורים, סיימנו את החומר בערך חודש לפני הזמן וההרגשה היא שרצים על דברים ולא מתעמקים בהם. המצגות גם לא מאוד ברורות. הקורס בנוי בצורה כזו שדיי קשה להבין בכל שלב בקורס באיזה שכבה נמצאים ומה קשור למה. \n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: מתרגלת אחלה. שעות קבלה מועילות.\n\nשעורי הבית: מתחיל ביבשים קצרים ולאט לאט הם נהיים קשים יותר, סוג השאלות ביבשים דיי דומה לשאלות במבחן אבל שעה אחת של תרגול לא מספיקה כדי להביא לרמה הדרושה לפתירה שלהם.\n\nהמבחן: מועד א היה הוגן, אבל בכלל הצורה שבה המבחן בנוי לא מאוד קשורה לרשתות בעיניי והרבה תרגילים של הסתברות שמנוסחים בצורה לא ברורה ולא חד משמעית.\n\nהשורה התחתונה: לא מומלץ מאוד. ידע כללי שנחמד שיהיה אבל אפשר לראות אותו בשעתיים תרגול בהפעלה, לא צריך קורס שלם. בכללי יש הרגשה שהסגל דיי זורק, הקורס לא בנוי טוב, והחומר לא מאוד מעניין", "timestamp": 1678377154950}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יצחק קסלסי ובפועל הקלטות של יובל קסוטו\nחוות דעת - הרצאות: יצחק לא מרצה טוב. הוא מאוד נחמד אבל לא מעביר את החומר כמו שצריך וכלן מומלץ שאם אתם בסמסטר שהוא מעביר פשוט לראות את ההקלטות של יובל קסוטו.\n\nשם המתרגל/ת: גל אסא- מוקלט\nחוות דעת - תרגולים: התרגולים המוקלטים של גל אסא מעולים אז אם הקורס הזה מתנגש לכם עם קורסים אחרים תדעו שאפשר לעשות את כולו עם הקלטות ושיש אחלה של הקלטות גם לתרגולים וגם להרצאות\n\nשעורי הבית: השיעורי בית סופר חשובים כדי להיות מוכנים למבחן. הכל מרופרנס ואם לא מצליחים את התרגיל אז הרפרנס ממש עוזר להבין. ממליצה שלמרות שההגשה היא בזוגות לעשות לבד את כל התרגילי בית (חוץ מאת הרטוב שלא תורם לשום דבר אבל הוא 5 אחוז מגן וזה נחמד)\n\nהמבחן: 75 אחוז מהמבחן זה הסתברות והשאלות לא מנוסחות כל כך טוב. כן יש דברים שחוזרים והכל אבל הבעיה היא שהניסוחים ממש יכולים להפיל. אז ממליצה במהלך המבחן שאם יש משהו שאתם אפילו רק חושדים שלא הבנתם נכון פשוט לשאול כי זה רק יחסוך לכם נקודות.\n\nהשורה התחתונה: כולם אמרו לי לפני כן שהקורס הוא נורא קליל וגם הממוצעים נראים דיי גבוהים אבל בפועל הקורס כן דורש את ההשקעה במהלך הסמסטר וגם צריך לעשות המון מבחנים ולהתכונן למבחן לדעתי בין 5 ימים לשבוע ואז באמת אפשר להוציא ציון טוב.", "timestamp": 1678870828146}, {"author": "יוני", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המתרגל/ת:  נעה כהן\nחוות דעת - תרגולים:  אחלה מתרגלת, עזרה מאוד להבין את החומר והיה לה חשוב שסטודנטים יבינו מה הולך. המבחן הוא בחומר פתוח, וטיפים שהיא נתנה לאורך התרגולים התגלו כשימושיים לפתרון מבחנים.\n\nשעורי הבית: \nיחסית קלילים, חוץ מהגשה אחת רטובה קצת מעיקה (אבל מאוד מושקעת וכן עוזרת להבין את החומר טוב יותר).\n\nהמבחן: חומר פתוח, הם כן מצליחים להמציא את עצמם מחדש בכל מבחן אבל מבחני עבר הם מאודדד משמעותיים להצלחה כאן. יש חלוקת קטגוריות מאוד ברורה, אז גם אם נושא מסוים יושב פחות טוב - זה לא שפתאום יהיה מבחן עם 80% על הנושא הזה שבדיוק פספסתם. לי עזר ללמוד רוחבי.\n\nהשורה התחתונה: קורס מאוד חמוד עם אחלה סגל, למי שאוהב את העולם של התקשורת וקצת מעוניין באיך דברים עובדים, יש הרבה התעסקות בפרקטיקה שזה היה נחמד", "timestamp": 1679608271066}, {"author": "סטונדט 0", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יובל קסוטו\nחוות דעת - הרצאות: \nמרצה די משעמם, עד אמצע סמסטר היו הקלטות אז אפשר היה לשים על מהירות יותר גבוהה ולאזן את זה, אבל משום מה החליטו לחסום את הגישה אליהן. \n\nשם המתרגל/ת: אור מוקלט\nחוות דעת - תרגולים: \nמתרגל נהדר, רק בזכותו הבנתי מה קורה בקורס.\n\nשעורי הבית: \n11 גליונות, אצלנו ויתרו על הרטוב בגלל השביתה. חלק מרופרנס וחלק לא. מלמדים וברמת מבחן. \n\nהמבחן: \nמבנה קבוע, תמיד תהיה שאלה על פרוטוקולים אמינים, ALOHA, תורת התורים ו-Ethernet. ככה שכדאי לעבוד לפי נושאים. לא קשה מידי אבל הרבה הסתברות. \nהשורה התחתונה: לא מה שציפיתי בקורס על רשתות ואינטרנט, הרבה תאוריה הסתברותית ופחות מימושים.", "timestamp": 1691009589444}, {"author": "המשאית", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס משעמם אבל חובה במסלול", "timestamp": 1694681022350}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יובל קסוטו\nחוות דעת - הרצאות: \nמשמימות, בעיקר לא מרגיש שהן תורמות משהו לקורס.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא פשוטים, חלק מהשאלות ממבחנים. לרוב יש רפרנס כך שאפשר להסתדר.\n\nהמבחן: \nפה טמונה הבעיה, יש הבדל לא קטן בין הרמה שבתרגולים לרמה של המבחנים. ומעבר לכך יש בד\"כ הבדל גדול מאוד בין מועד א' למועד ב'. אם לוקחים את הקורס תתכננו להיבחן במועד א'. כי במועד ב' לצוות הקורס כנראה אין כוח למבחן והוא כותב מבחן הרבה פחות פתיר.\nהשורה התחתונה: אם הוא לא חובה לשרשרת אני לא בטוח שהייתי ממליץ עליו. הוא נראה קליל וגם יחסית לא עמוס בסמסטר, אבל הוא מצריך הבנה דיי עמוקה של חלק מהרעיונות במבחן עצמו.", "timestamp": 1705431738155}, {"author": "Ron Lebedinsky", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יצחק (יובל מוקלט)\nחוות דעת - הרצאות: יצחק מכניס קצת כיף להרצאות, אבל הוא ויובל מעבירים אותם אחלה. החומר לפעמים (לרוב) משעמם כי פשוט מדברים על איך הפרוטוקולים בנויים או מדברים על תורים (יאי הסתברות). תבחרו מה שיותר נוח לכם.\n\nשם המתרגל/ת: טל (מוקלט)\nחוות דעת - תרגולים: עושה את העבודה, בתרגולים בעיקר עושים חזרה קצרה על מה שנלמד ואז פותרים מספר שאלות בנושא (לפעמים ממבחני עבר). עוזרים להבין מה בערך רוצים ממך בכל שאלה.\n\nשעורי הבית: בזוגות. היה 10 גיליונות של 2,3 שאלות כל אחד שהתמקדו על נושא ספציפי. כל גיליון היה שווה 1.5% מגן אבל חשוב לעשות אותם כי בדרך כלל אלו שאלות ממבחנים. עוזרים להבין שוב למה לשנוא הסתברות זה in.\n\nהמבחן: מועד א היה סבבה לגמרי. בהחלט מומלץ לפתור בסביבות ה-10 ויותר מבחנים בשביל לקבל מרגש לגבי השאלות של תורים ו-ALOHA (יאי הסתברות).\n\nהשורה התחתונה: ברובו משעמם כי זה או הסתברות או דיבור על פרוטוקולים אבל השבועיים הראשונים ממש אחלה כי מסבירים במבט על איך אינטרנט עובד (ואין שם הסתברות)\n\nמצטער אם אתם אוהבים הסתברות, אם כן אתם גם כנראה לא תענו מההסתברות בקורס כי עושים מלא קיצורי דרך והנחות מקלות כדי לא להסתבך", "timestamp": 1714406423021}]}