{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אילנה דוד\nחוות דעת - הרצאות: יבשות ומשעממות\n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: מתרגל תותח, התרגולים מעניינים\n\nשעורי הבית: מעצבנים, לא בהכרח עוזרים להבנת החומר, בפועל 90 אחוז מהזמן המושקע הוא רק לדיבוגים ופחות על התרגיל עצמו.\n\nהמבחן: המבחנים של אילנה ממוחזרים מאוד, לתרגל מבחנים שלה מהדרייב כי בפועל לא מפרסמים את כל המועדים מהסיבה שהם ממוחזרים.\n\nהשורה התחתונה: קורס בסיסי מומלץ וחשוב בעיקר החלק של c++ ופחות החלק של bash שכנראה לא אתעסק בו אי פעם.", "timestamp": 1597828009840}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אילנה דוד\nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  אלון רשלבך\nחוות דעת - תרגולים: מתרגל טוב\n\nשעורי הבית:  5 ש\"ב, עמוסים\n\nהמבחן: שלושה נושאים: bash,  ADT, ++C\n\nהשורה התחתונה:  חשוב לתרגל כמה שיותר מבחנים, ולהבין טוב את עקרונות OOP, אין שום דרך לצלוח ADT של C מבלי לתרגל המון שאלות דומות ממבחנים קודמים.\nהסדנאות עוזרות בהבנת החומר.\nממליץ לראות את המוקלט של מת\"מ", "timestamp": 1599169776040}, {"author": "אור ממיסטבלוב", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: \nהתרגולים שלו מצויינים! על כל נושא שהוא אומר 'לא נוגעים בזה יותר מדי' זה יהיה במבחן בצורה מקיפה.\nשעורי הבית: \nמאוד זריקה למים במיוחד בשני התרגילים האחרונים.\nהמבחן: \nמתבסס הרבה על החומר הנלמד. במיוחד על דברים שלא נלמדו כמו שצריך ורק הוזכרו כבדרך אגב בתרגולים או בהרצאות\nהשורה התחתונה: \nכמו כל קורס שלא אמור להיות קשה, המבחן מאוד לא הוגן מול רמת הלמידה וכדאי ללמוד כל דבר שנאמר בהרצאה והתרגול בצורה יסודית עם סרטונים ביוטיוב שיש הכל על הכל.", "timestamp": 1601029546287}, {"author": "Is", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ד\"ר אילנה דוד\nחוות דעת - הרצאות: הרצאות בסדר גמור. מאורגנות ומובנות. המון המון חומר!\n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: המתרגל נפלא בכלל ולקורס בפרט.\n\nשעורי הבית:  5 מטלות רטובות (C, C++). לפעמים לוקח הרבה זמן, כמו שקורה בדרך כלל עם מטלות מהסוג הזה.\n\nהמבחן: המבחן קשוח קצת. מצריך שליטה טובה מאוד בחומר והבנה לעומק של העקרונות של תכנות מונחה עצמים ו-ADT. כמו כן, חשיבות מרובה לתשומת לב לפרטים.\n\nהשורה התחתונה: קורס חשוב מאוד. הצוות נפלא ובהחלט מומלץ למי שחושב לקחת את השלב הבא בתכנות בפקולטה.", "timestamp": 1602610094078}, {"author": "A", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מארק\nחוות דעת - הרצאות: \nמבולגנות, לא מוסברות טוב ,מסה של חומר בשביל קורס בודד - מארק שינה לחלוטין את הקורס ,אתם לא תצאו ממנו יודעים לתכנת ויהיה לכם קצת רקע גם במערכות הפעלה ואסמבלי. טיפה adt טיפה ממש cpp ,בקיצור ניסו לעשות הכל מהכל וזה כמובן לא הצליח\nשם המתרגל/ת: אלון \nחוות דעת - תרגולים: \nאלון מסביר טוב , אבל עדיין יש מסה של חומר, לא מעט תרגולים פשוט לא הספקנו או שהיה צורך בהשלמות \n\nשעורי הבית: יש בערך כל שבוע חלקם יבשים חלקם רטובים \nאבל מלבד שניים מהם שהם הadt והcpp שלוקחים זמן ,השאר היו אולי 4 שעות אז לא מאוד עמוס,בגלל שזה סמסטר ראשון והתרגילים מועברים לראשונה היו בהם לא מעט פשלות אבל זה תמיד ככה בקורס חדש מה שחשוב להדגיש הוא שתרגיל הבית האחרון יוצא אמנם כמה שבועות לפני סוף סמסטר אבל החומר הרלוונטי אליו הועבר בערך שבוע וחצי לפני סוף סמסטר ולפני כן לא יכולנו להתחיל את התרגיל, מה שדפק את המבחנים הראשונים \n\nהמבחן: \nכשmakefile הוא משמעותית יותר נקודות מcpp אתה יודע שהסגל עושה משהו לא נכון. חשוב להדגיש אם המבחן עם חומר פתוח תדפיסו הכל ,כל ההרצאות כל התרגולים וגם כל הסדנאות \nרוב המבחן נזכרתי איפה היו דברים מסויימים ודפדפתי לשם,מי שלא היה לו הכל מודפס דיי נדפק\nהשורה התחתונה: \nהיינו הסמסטר הראשון שהקורס הועבר בצורה הנוכחית, זה היה לא מוצלח בלשון המעטה אבל העלנו את הטענות שלנו . לצערי על חלקן הלא קטן המרצה רמז (יותר אמר) שאנחנו בכיינים והיה לו קצת קשה לקבל ביקורת אבל עדיין מקווה שלסמסטר הבא הם ישתפרו", "timestamp": 1614159791311}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "חשוב לציין שהקורס השתנה מאוד בסמסטר הנוכחי, הוא הפך להיות סוג של את\"מ בשילוב עם קצת דברים מממ\"ת הישן.\n\nשם המרצה: מרק זילברשטיין\nחוות דעת - הרצאות: מרק מרצה טוב סה\"כ אבל הייתה כמות חומר מטורפת שלא תואמת את הנק\"ז של הקורס. ההרצאות היו עמוסות מאוד, אני ראיתי אותן בהקלטה, השתדלתי באמת להבין את החומר ולעקוב ולקח לי פי 2-3 מהזמן המקורי של הההרצאה.\n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: אלון באמת השתדל להעביר את כל החומר בצורה טובה, אבל שעה בשבוע של תרגול זה פשוט לא מספיק. חלק מהזמן הרגיש שהתרגולים וההרצאות לא מתואמים ומדברים על דברים שונים, בעיקר כי ההרצאות מאוד תיאורטיות ואי אפשר לתרגל את החומר שהועבר בחלק מהן (מה שכמובן לא מנע מזה להופיע במבחן).\n\nשעורי הבית: 8 גיליונות שלוקחים מהם את ה-7 הטובים, ועוד ת\"ב אחד תשיעי שהוא חובה. מה-8 הראשונים חלק יבשים, הרוב רטובים. הם סבבה לגמרי ואפילו כיפים בחלקם, חוץ משני הרטובים האחרונים שלקחו משהו כמו יומיים עבודה כל אחד, השאר לקחו כמה שעות. הת\"ב ה-9 היה עמוס ולא היה לנו הרבה זמן לעשות אותו, זה היה השבוע וחצי האחרונים של הסמסטר וזה היה ממש מירוץ נגד הזמן.\n\nהמבחן: מבחן באת\"מ עם נגיעות של קוד. שאלה של 20 נק' על נושא שלא הופיע בתרגולים ולא בתרגילי הבית. אמנם נלמד בהרצאה אבל רק כתיאוריה ויצא שהפעם הראשונה שבה תרגלנו אותו היה במבחן. חלוקת נקודות לא ברורה, שאלה של c++ שפעם היתה רבע מהמבחן קיבלה משקל של 12 נק'. כמובן שגם לא היו לנו מבחנים לתרגל מהם לקראת המבחן (חוץ ממבחן לדוגמא שהסגל כתב לנו, שהקשר בינו לבין המבחן במועד א' הוא מקרי לחלוטין).\n\nהשורה התחתונה: היו המון פישולים מצד הסגל של איך הקורס בנוי וכמה זמן מוקדש לכל נושא, אבל ככה זה בקורס חדש. אני מבינה את הרציונל של השינוי של הקורס, אבל עשו את זה מוגזם מדיי לצד החומרתי והזניחו את הצד של התוכנה (8 שבועות מול 5 שבועות). בסופו של דבר ממ\"ת אמור להיות קורס תכנות ואני לא הרגשתי שקיבלתי את הכלים שרציתי לצאת איתם מהקורס. יצאתי עם רגשות מעורבים ממנו...", "timestamp": 1614778688580}, {"author": "Dor Akerman", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מרק זילברשטיין\nחוות דעת - הרצאות: סך הכל מרק מרצה טוב. הקורס עבר שינוי פנים אז שקפי ההרצאות עוד לא היו מאורגנים עד הסוף. מרק עושה סקרים במהלך ההרצאה שהם חשובים ולדעתי עוזרים להבנה.\n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: אלון מתרגל מעולה. אותו כנ\"ל לגבי שקפי התרגולים.\n\nשעורי הבית: היו 3 יבשים וכל השאר רטובים. רוב תרגילי הבית היו בסדר גמור ולא לקחו המון זמן. צריך להגיש 7 מתוך 8 ועוד אחד מסכם שהוא חובה. \n\nהמבחן: המבחן עמוס בשאלות והוא קצת מרוץ נגד הזמן, אבל יחסית הוגן ברמתו.\n\nהשורה התחתונה: אחלה קורס, סגל הקורס כן מצפה מהסטודנט ללמוד גם לא מעט בעצמו אז צריך להיות מוכנים לזה מראש", "timestamp": 1616272532512}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פבל ליפשיץ\nחוות דעת - הרצאות: \nקצת מפוזר\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: \nמתרגל מעולה\nשעורי הבית: \n6 רטובים, 3 יבשים, חלק לא מבוטל מהם לוקח המון זמן\nהמבחן: \n\nהשורה התחתונה: \nקורס מאוד מעניין וחשוב, אך עמוס ויש להיות עם יד על הדופק לאורך כל הסמסטר כי יש ים חומר", "timestamp": 1626124632404}, {"author": "א", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: פבל ליפשיץ\nחוות דעת - הרצאות: לא מסביר משהו\n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: מסביר בסדר אך ניכר שלא מבין את קשיי הסטודנטים\n\nשעורי הבית: חלקם קצרים וחלקם כבדים מאוד וגוזלים זמן\n\nהמבחן: ארוך ובקושי פתיר\n\nהשורה התחתונה: קורס מעניין וחשוב אך מועבר באופן גרוע מאוד", "timestamp": 1626261838118}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: \nלמדנו בסמסטר היברדי,  אז ההרצאות היו קצת בעייתיות, כל פעם שפבל התרחק מהמחשב פשוט לא שמעו אותו, חוץ מזה ההרצאות הועברו בצורה בסדר, לא שיא.\nמצד שני הם מאוד חשובות, בנוסף כל תחילת הרצאה היה בוחן על ההרצאה הקודמת שמזכה ב0.5 נקודת בונוס כפול הציון שקיבלת באחוזים.\nהבחנים היו קשים מאוד ברובם.\n\nשם המתרגל/ת: \nאלון \nחוות דעת - תרגולים: \nאלון מתרגל טוב, מבחינת ההבנה של החומר, אבל לדעתי לא מכין טוב את הסטודנטים למבחן, כי השאלות שמופיעות במבחן שונות ממה שהוא העביר.\nשעורי הבית: \nאני בא בלי ניסיון בתכנות חוץ מבוא למדמח, והשיעורי בית היו מאוד קשים.\nבהתחלה זה כמה תרגילים בבbash.\nתרגיל בית נוראי בADT/\nותרגיל 6 שישבנו עליו שבועות.\n\nלדעתי כמו הזמן שמשקיעים בקורס הזה לא שווה את הנקז שלו.\n\nהמבחן: \nהמבחן היה נוראי, מורכב מ3 שאלות גדולות של 20 נקודות שהתמקדו בהבנה של files בסי, ולינקוג', ואסמבלי, שלכל שאלה איזה 6 סעיפים ותתי סעיפים, גומר לך את רוב הזמן במבחן.\n40 הנקודות הנותרות התחלקו לשאלה בbash (שחייב להיות מתורגלים ממש בbash, כדי לפתור אותה בזמן של מבחן)\nשאלה בADT שזה הנושא הכי קשוח בקורס לדעתי.\nועוד שאלה בCPP שאמורה להיות פשוטה ואצלנו היא הייתה נוראית.\nושאלה שיעורי בית, שגם אצלנו כללה שוב ADT וגם הייתה ממש קשה.\n\nהשורה התחתונה: \nקורס קשה מאוד, אבל דיי חובה למי שרוצה שרשרת מחשבים.", "timestamp": 1626274229501}, {"author": "עדי לוי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: פבל, לדעתי היה מרצה לא טוב, למרות שהכוונת שלו היו טובות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אלון מתרגל מדהים, מסביר ממש ממש טוב את החומר, שאר המתרגלים ומעבירי הסדנאות פחות טובים.\n\nשעורי הבית: יש משהו כמו 5 רטובים ו-3 יבשים. כמות הזמן שצריך להשקיע בהם ממש ממש גדולה ולא פרופציונלית ל-3.5 נז קורס.\n\nהמבחן: קשוח, לאחרונה שינו את הפורמט של הקורס וקצת אין מאיפה לתרגל מבחנים.\n\nהשורה התחתונה: סגל לא משהו, קורס קצת קשוח, אבל לומדים דברים חשובים.", "timestamp": 1626368954871}, {"author": "דפח\"מ", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: ההרצאות מועברות לא רע ויחסית מובנות. פבל עשה חידונים קטנים במודל בתחילת כל הרצאה עם חצי נקודה מגן כל אחד, נשמע טוב לא עובד. כל חידון 200 שאלות 4 דקות ורמה שלא תבייש מבחנים. \n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: תרגולים תורמים מאוד להבנה של החומר\n\nשעורי הבית: שיעורי בית רטובים קשים, הסגל זורק ישר למים ומקווה שנלמד לשחות.\n\nהמבחן: סיוטי.\n\nהשורה התחתונה: קורס עם חומר מאוד שימושי, הבעיה שהמבחן בגדר הבלתי אפשרי עם חומר פתוח- שקפים מההרצאות בלבד, כך שתתכוננו לבוא עם קלסר של 700 עמודים בתקווה למצוא שם משהו שיציל את הבחינה. אין כמעט מבחנים להתכונן מהם כך שלעבור על ההרצאות והתרגולים, בשילוב עם סרטונים 10 שעות ביוטיוב כל אחד הם עיקר הלמידה.", "timestamp": 1626601009776}, {"author": "E", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פבל\nחוות דעת - הרצאות:  מרצה לא רע בכלל והחומר יחסית מעניין. יש בחנים בתחילת כל הרצאה עם טיפה מגן שהם לא הכי ברורים והם גם לחוצים בזמן אבל זה אחלה בונוס למי שעל החומר.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל מעולה.\n\nשעורי הבית: יש כמה רטובים שהם מאוד עמוסים והרטובים של אמצע סמסטר עם ADT והרטוב בC++ יכולים לקחת כמה ימים אז שווה לפנות זמן. חשוב להתעדכן הרבה בפורום כי ההנחיות שם יכולות להיות קריטיות והם לא מעדכנים את הPDF. היבשים יותר סבבה ואפשר לסיים בישיבה אחת פחות או יותר.\n\nהמבחן: השתנה הפורמט של הקורס בחורף 2021 אז אין כמעט מבחנים לתרגל מהם מה שמאוד מקשה על ההכנה, כי באמת הוסיפו המון חומר שמעולם לא שאלו עליו בקורס וגם על החומר שכן היה בפורמט הקודם(ADT, C++) אז שם הרמה הייתה גבוהה יותר ולכן היא לא הכי מייצגת.\nהמבחן עצמו היה ממש ארוך והכיל שאלות כבדות על נושאים שנראים שוליים יחסית כמו קבצים ולינקינג וקונבנציות של i\\o.\nומצד שני לנושאים שנראים הרבה יותר מרכזיים וחשובים כמו c++ הייתה רק שאלה אחת של 10 נקודות...\n\nהשורה התחתונה: הרבה חומר, ברובו מעניין ולדעתי מאוד חשוב שכל אחד יקח גם אם הוא לא הולך לשרשרת מחשבים כי מלמדים בקורס ידע מאוד בסיס בתכנות ומבנה המחשב שלא יזיק לאף אחד. הפורמט החדש אכן מקשה אבל אני מאמין שעם השנים גם יהיה יותר קל לתרגל את הקורס וגם הסגל יידע להרכיב מבחנים בצורה יותר \"מתונה\"", "timestamp": 1627420438907}, {"author": "a", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: ההרצאות הועברו בצורה טובה פרונטאלית, ממש גרועה בזום(כמעט בלתי אפשרי להבין מה הוא אמר..) עשה בחני בונוס חמודים שקצת עזרו לציון הסופי.\nלקראת סוף הסמסטר עברתי לראות את מארק מוקלט מסמסטר שעבר והרגשתי שאני מבין יותר.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל חד, ממש טוב ומסביר נפלא.\n\nשעורי הבית: חלקם ארוכים ובלתי נסבלים (4 ו6 בעיקר) \nאבל מלמדים\n\nהמבחן: לא כיף בלשון המעטה, דפק לנו מבחן באורך הגלות והממוצע במבחן אומר הכל..\n\nהשורה התחתונה: לא ממליץ לעשות כרגע אם לא דחוף, הקורס עבר המון שינויים ועוד לא מעוכל כמו שצריך בסגל הטכניוני.", "timestamp": 1627850412463}, {"author": "mamat terminator", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: לא מומלץ\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מדויק, ומסביר טוב\n\nשעורי הבית: עמוסים\n\nהמבחן: לא כיף\n\nהשורה התחתונה: להיות על החומר בקורס כל הזמן ! במבחן יש צורך לשלוט בכל פיפס לקראת המבחן (אפילו דברים שנראים שוליים) כמו הרשאות, דגלים של makefile, ספריות סטטיות/דינמיות, קבצים..\n\nלמרות הכל, הקורס מעניין", "timestamp": 1634680543820}, {"author": "Daniel Stumler", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: ההרצאות מעניינות ופבל מעביר אותן טוב. הרגשתי לפעמים שיש נקודות שהוא פחות מתמקד בהן אז השלמתי מההרצאות של מרק. בתחילת כל הרצאה היו בחני בונוס על ההרצאה הקודמת, השאלות בהם היו טובות ועזרו בהכנה למבחן.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל מצוין. מסביר את החומר ברור ולעניין. \n\nשעורי הבית: עמוסים מאוד. כדאי לעשות שוב את היבשים אחרי שעוברים על ההרצאות ומתכוננים למבחן.\n\nהמבחן: מאתגר והוגן. צריך לחזור טוב על כל שקף בהרצאות ולהבין כל מילה. \n\nהשורה התחתונה: הקורס מעניין מאוד. עשו שינוי במבנה הקורס כך שעל חשבון יותר עומק בCpp וADT לומדים על נושאים כמו קבצים ואסמבלי.", "timestamp": 1634702278249}, {"author": "גבי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: הרצאות עמוסות בטירוף, המון חומר שמתפזר עד שכבר לא ברור מה חשוב לקורס ומה העשרה שמטרתה ליצור עניין ולהראות רלוונטיות. נהיה סלט מבולגן והיה מאוד קשה לעקוב אחריו.\nמול הטענות על העומס והבלגן, הצוות נתן חיוך, אמר \"אני יודע\", ופה נגמרה השיחה - כאילו אין להם מה לעשות לגבי זה. אז אמנם האווירה טובה, אבל ההתנהלות פחות.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: אלון מתרגל ממש טוב ויודע את החומר, ובאמת הראה נכונות לחזור ולחדד עד שכולם מרגישים בנוח עם החומר. פשוט יש **המון** חומר, וקל מאוד ללכת לאיבוד.\nלפעמים לא היה ממש תיאום עם ההרצאות.\n\nסדנאות: יואב - אם החומר מההרצאות והתרגולים לא הספיק, אז קחו סדנאות - הן \"לא חובה\", אבל בלי ניסיון קודם קשה עד בלתי-אפשרי להתקדם בקורס ולהבין מה הולך.\nיואב היה ממש אחלה.\n\nשעורי הבית: עמוסים, קצת מבולגנים והבדיקות נעשות ככה שהטסט היחיד שאפשר להריץ הוא זה שבו מקבלים ציון.\n\nהמבחן: דורש הרבה ידע תכנות והרבה \"להתלכלך בחומר\"\n\nהשורה התחתונה: מצד אחד דברים באמת חשובים ומעניינים, מצד שני קורס עמוס ומבולגן מאוד, לא ברור איך הוא רק 3 נק\"ז. תקפידו לא ללכת לאיבוד!", "timestamp": 1644929082774}, {"author": "STACKOVERFLOW", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: משקיע ממש כדי שסטודנטים יגיעו להרצאות. נותן חידות ובחני בונוס כך שאם עושים הכל אפשר לקבל עד 10! נקודות לציון הסופי. האווירה בהרצאות טובה ופבל מאוד קשוב לסטודנטים ומשתדל לשאול שאלות וליצור עניין. לפעמים קצת מונוטוני ואפשר לאבד ריכוז.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: פשוט יודע הכל, מסביר מעולה, עומד בזמנים ונוגע בכל הנקודות החשובות. ממש ממש מומלץ\n\nסדנאות: עם יואב האלוף, הסדנאות הראשונות עוזרות כדי להצליח את השיעורי בית, והסדנאות האחרונות הן פתרון שאלות ממבחנים. מומלצות מאוד\n\nשעורי הבית: היבשים מאוד רלוונטיים למבחן, ומבין הרטובים יש שאלה אחת במבחן שמתבססת על אחד מהם. חובה לעשות 8 מתוך 9 וחובה לעשות את תרגיל בית 6 (תרגיל ארוך מאוד)\n\nהמבחן: הסמסטר המבחנים היו מאוד הוגנים, הסגל באמת עושה מאמץ לשפר את הקורס ולהקשיב לסטודנטים. אבל עדיין, לסטודנט הממוצע כדי לקבל ציון מעל 80 כדאי שיהיו הבונוסים מההרצאות.\n\nהשורה התחתונה: אחלה קורס ואחלה סגל", "timestamp": 1647985769038}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: פבל בן אדם נחמד, בתור מרצה לדעתי הוא לא מרצה טוב. עונה על שאלות בצורה מרוחה ממש, ככה שהוא קולט 10 דקות לפני סוף ההרצאה שהוא לא הספיק את כל מה שרצה, וטס על החומר בזמן הזה.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: רואים שהוא יודע את החומר, והוא מתרגל ממש טוב\n\nשעורי הבית: לא פשוטים ודורשים השקעה\n\nהמבחן: בגלל שהמתכונת של הקורס השתנתה לפני שנה וחצי הם לא סגורים על המתכונת בעצמם, כל מבחן שונה מקודמו, כל מבחן באמצע המתרגלים נכנסים ומתקנים הרבה טעויות.\n\nהשורה התחתונה: המתכונת של הקורס לדעתי לא טובה. הרבה נגיעות בהמון נושאים בצורה שטחית.", "timestamp": 1658904145510}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: המרתה הכי גרוע שתראו איי פעם בחיים שלכם\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: ארוכים בטירוף ביחס לזה שזה קורס של כולה 3 נקז\n\nהמבחן: פשוט לא הוגן בשום צורה. הבטיחו מבנה מסוים של מבחן ואז עשו משהו אחר לגמרי. אחרו בפרסום הציונים והסריקות.\n\nהשורה התחתונה: בחיים לא ראיתי צוות קורס שמתנהל בצורה כזאת בזיונית. פשוט בושה וחרפה. אם הקורס הזה לא חובה עבורכם אז ממש לא מומלץ.", "timestamp": 1658912138087}, {"author": "123", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: יש בחנים בתחילת כל הרצאה שמעניקים בונוס, הבחנים חוזרים על עצמם משנים קודמות. לפבל אמנל יש כוונות טובות אבל לפעמים הוא לא ברור, וגם לא עונה למיילים.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל מעולה ממש\n\nשעורי הבית: בגדול זה שבירת ראש. הרבה מהחומר לא נלמד וצריך להסיק לבד או לחפש באינטרנט. שעות של ניסוי וטעייה. התרגיל האחרון הוא מתוך 138 נקודות ולכן גם כאן ניתן לצבור בונוס. הבדיקה ע\"י אלגוריתם של טסטים ולמרות זאת לפעמים יש טעויות בבדיקה.\n\nהמבחן: אפשר להכניס חומר פתוח. המבחן קצת ארוך אבל בשנים האחרונות המבנה די חוזר. עם זאת תמיד אפשר להפתיע, לתרגל הרבה. \n\nהשורה התחתונה: להשיג את כל הבונוסים שאתם יכולים, מצטבר סכום יפה (כ10 נקודות) למי שמשקיע. הרבה סבלנות לקורס הוא דורש המון.", "timestamp": 1661851912152}, {"author": "1", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: מרצה מעולה, הרצאות קלילות לרוב חצי שעה יש בוחן ואז הרצאה מעניינת, הבעיה שפבל לפעמים נותן יותר מדי זמן לשאלות וזה קצת מפריע להלך השיעור.\n\nשם המתרגל/ת: אלון \nחוות דעת - תרגולים: גם תותח\n\nשעורי הבית: ש.ב עלולים להיות קצת מסובכים או קשים אבל תעזרו בחברים לא אמורה להיות בעיה\n\nהמבחן: כמו כל מבחן יש טריקים, תלמדו יפה במהלך הסמסטר, תרביצו מבחנים לפני ויהיה טוב\n\nהשורה התחתונה: קורס מאוד כיף למי שאוהב את התחום.\nשימו לב!! הסדנאות בקורס הזה הן כן חשובות ומאוד חשוב כן להיות עקבי ולא לזלזל בהם.", "timestamp": 1666954693633}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: מדהימות.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מדהימים.\n\nשעורי הבית: קצת ארוכים אבל מאוד מלמדים ומאוד רלוונטיים למבחן. הם גם מעניינים. \n\nהמבחן: הוגן מאוד. השנה היה עם חומר סגור לעומת שנים קודמות אבל ההבדל לא הורגש כל כך. היה סבבה. \n\nהשורה התחתונה: קורס מעולה, מעניין ומאוד רלוונטי לתעשיה. קדם לשרשרת מחשבים.", "timestamp": 1678041732241}, {"author": "~", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: בהתחלה יש בוחן על הרצאה קודמת, לא חייב להגיע להרצאה כדי לעשות אותו הוא במודל. אם עושים מספיק בחנים מגיעים לבונוס המקסימלי של 5 נקודות. מדי פעם יש בונוס אחרים שגם שווה לעשות זה עוזר לציון הסופי. פבל מרצה שיודע טוב את החומר, תמיד עונה על שאלות ויודע להסביר.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל מעולה רק בגלל שהתרגול שעה הוא חותך די מהר שאלות.\n\nשעורי הבית: 30 אחוז כאשר התרגיל על c++ הוא חובה ושווה 9 נקודות. התרגיל האחרון הוא על אסמבלי ואפשר להגיע ל138 נקודות ככה שגם אם נופלים בהגשות במהלך הסמסטר אפשר לתקן עם התרגיל הזה. הש.ב ממש עמוסים וקשים. בהתחלה אין מושג מה הלוז אבל אחרי זה מסתדרים. רצוי להשיג רפרנס.\n\nהמבחן: אצלנו שינו את הפורמט מאפשרות של להביא כל חומר פתוח מודפס שרוצים לדף אחד והם נותנים דף נוסחאות שלהם. לדעתי הפורמט הזה עדיף המבחנים יותר קלים\n\nהשורה התחתונה: קורס בסיס לשרשרת מחשבים אם אתם חשמל טהור ואם מחשבים תוכנה הוא חובה. אני חושב שהוא מאוד מעניין אבל צריך לקחת בחשבון שהוא מאוד עמוס. מי שבחשמל ולא לוקח שרשרת מחשבים לחשוב 10 פעמים לפני שלוקחים אותו", "timestamp": 1679951915786}, {"author": "123", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: פבל ליפשיץ\nחוות דעת - הרצאות: פבל מרצה מאוד חביב, חשוב לו שהסטודנטים יבינו את החומר. ההרצאות עמוסות בחומר וקשה לדעת תוך כדי הסמסטר מה חשוב ומה לא. \n\nשם המתרגל/ת: אלון רשלבך\nחוות דעת - תרגולים: חצי סמסטר ראיתי את אלון מוקלט, ובחצי השני הלכתי אליו פרונטלי. אין ספק שהבן אדם שוחה בחומר והוא בהחלט מתרגל טוב עם כריזמה וביטחון, אבל לתחושתי הוא לא מדבר מספיק בגובה העניינים, והוא מרבה לזרוק מושגים חדשים ככה כבדרך אגב. קל מאוד לאבד אותו בתרגולים, בטח למי שלא ממש על החומר. למי שמתקשה בקורס ויש זמן הייתי ממליץ לראות את ההקלטה ואז ללכת שוב פרונטלי, בעיקר בתרגולים היותר קשוחים על ADT ו ++C.\n\nשעורי הבית: הרטובים מאוד כבדים. בתחילת הקורס פבל אמר שזה בין 3-4 שעות. לא כך המצב בלשון המעטב. תתכוננו מנטלית לשבירת ראש, אבל בסוף זה אמור להפיל הרבה אסימונים למבחן.\n\nהמבחן: לנו היה מבחן עם חומר סגור, אני לא הגעתי מוכן אליו אבל בראייה אובייקטיבית הוא היה יחסית הוגן.\n\nהשורה התחתונה: הסגל מאוד נחמד ורוצה בהצלחת הסטודנטים, הקורס די כבד.", "timestamp": 1691444330351}, {"author": "Gil Elgarisi", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: \nמרצה מעולה, מעביר את החומר בצורה ברורה, חצי השעה הראשונה של ההרצאה מוקדשת לבחני בונוס על נושא ההרצאה הקודמת והסברים לכל השאלות\nשם המתרגל/ת: אלון ויואב(סדנאי)\nחוות דעת - תרגולים: \nאלון- מעביר את החומר בצורה ברורה ומסודרת, בכל תחילת תרגול מעביר חזרונת קצרה על כלל החומר שנלמד במהלך הסמסטר.\nיואב-מסדנת מעולה, רואים עליו שחשובה לו הצלחת הסטודנטים\nשעורי הבית: \nארוכים, אבל חשובים ממש להבנה.\nבמידת הצורך ניתן לבקש הארכה מהסגל ולרוב נענים בחיוב.\n\nהמבחן: \nכמו כל מבחן בטכניון בנוי בצורה של 60% מהמבחן פתיר, 20% מהמבחן קשה ובשביל ה20% האחרונים צריך להיות עילוי.\nהשורה התחתונה: \nקרס מעניין מאוד ומומלץ ממש גם למי שלא עושה מסלול תוכנה. לומדים בו כלים בסיסיים לכתיבת קוד.", "timestamp": 1691572722444}, {"author": "MMMM", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: \nאחלה מרצה ,בקיא בחומר ,מתעמק הרבה ולכן אצלנו היה צורך בהשלמה כדי להספיק הכל, פבל גם הביא בחני בונוס שעזרו להיות על החומר במהלך הסמסטר.\n\nשם המתרגל/ת: ג'ימי\nחוות דעת - תרגולים: מתרגל טוב מכיר את החומר וידע לענות על שאלות במהלך התרגול.\n\nשעורי הבית: חשובים מאוד להבנה תעשו לבד ,גם אם יש לכם שותף תנסו כל אחד לעשות ולהתייעץ בין לבין.\n\nהמבחן: הוגן מאוד ,דומה ברובו למבנה של מבחנים משנים קודמות.\n\nהשורה התחתונה: אחד הקוסים הטובים שעשיתי בתואר ממש נהיתי וגם רכשתי ידע פרקטי.", "timestamp": 1714552211635}, {"author": "הבחור האדום", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "אני כאן כדי להגיד שהסדנאות הן בעצם התרגולים, והתרגול הוא פשוט עוד הרצאה.\nבתרגולים מלמדים עוד חומר, ורק בסדנה באמת רואים תרגילים לדוגמה.\nלכו לסדנאות", "timestamp": 1715539323648}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: פבל מושלם ומעביר את החומר ממש מעניין, עשה בחני כניסה להרצאה כדי לתת בונוס למי שהגיע פיזית (קיבלו רבע נקודה לציון הסופי על השתתפות בבוחן ועוד רבע נקודה על סמך הציון)\n\nשם המתרגל/ת: אלון מוקלט\nחוות דעת - תרגולים: סבבה, כתובים טוב ומסבירים את החומר\n\nשעורי הבית: מעניינים ממש\n\nהמבחן: הייתה שאלה אחת לא הוגנת על חומר מהסדנאות שהוא לא חומר חובה בקורס אבל סה\"כ הממוצע היה ממש גבוה עם כל הבונוסים והאחוז שיעורי בית אז אין תלונות\n\nהשורה התחתונה: מומלץ!", "timestamp": 1717010654426}]}