{"posts": [{"author": "עידו", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס דסקין\nחוות דעת - הרצאות:  מרצה מומלץ אם הוא אחראי אז המבחן יהיה הוגן \n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים:  מתרגל לא מומלץ, בסמסטר קורונה מלמד עם מיקרופון הרוס וכותב על העכבר על הפי די אפ\n\nשעורי הבית: קלילים וממוחזרים\n\nהמבחן: אם זה מבחן של אלכס אזי המבחן יהיה על שאלות הבנה, וחישובים לא מורכבים מידי. המבחן בסמסטר קורונה היה אמריקאי\n\nהשורה התחתונה: מומלץ אם אלקס המרצה", "timestamp": 1616582693553}, {"author": "ע", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: ההרצאות מעניינות, החומר קשור מאוד לעיסוק בעולם הRF\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: מתרגל טוב, לא על כל הנושאים בחומר יש תרגול. סגנון השאלות בתרגולים לא כל כך תואם למבחנים אבל עוזר להבין את הנושא.\n\nשעורי הבית: בתחילת הסמסטר פורסם דיהיו 4 יבשים ותרגיל רטוב. בפועל היו 2 יבשים ממוחזרים שהיוו 10% מהציון )לתרגיל הרטוב לא השיגו רישיונות(.\n\nהמבחן: מבחן אמריקאי עם חומר פתוח, ברובו הבנה וכמה שאלות חישוב. הרמה של שאלות ההבנה גבוהה אבל הציונים טובים.\n\nהשורה התחתונה: קורס מעניין, קשור לעיסוק בפועל בתחום הRF, מבחן לא פשוט עם ציונים גבוהים.", "timestamp": 1645527499621}, {"author": "~", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכסיי דיסקין\nחוות דעת - הרצאות: ההרצאות היו מעניינות ואלכסיי בסה\"כ מרצה לא רע. עם זאת, ישנן הרבה טעויות בשקפי ההרצאות של הקורס שדרושים תיקון - ואח\"כ זה מלמד דברים לא נכונים למבחן.\n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: איתמר זרק לגמרי בסמסטר שאני לקחתי את הקורס. כל תרגול שלו נמשך בערך 20-30 דקות.\nבנוסף לכך, איתמר ביטל יותר מחצי מהתרגולים וביצע השלמות בצה\"ד בימי רביעי. בנוסף, הוא דחף 2 תרגולים רצופים בשבוע האחרון של הסמסטר - על חומר שנלמד שבועיים וחצי לפני.\nכמו כן, הוא דילג על כמעט כל החישובים בדפי התרגול ופשוט ציין בע\"פ - אם מציבים כך וכך נקבל כך וכך, כאשר התחושה הייתה שהוא פשוט לא יודע איך לבצע את החישוב.\nכמו כן, היו לא מעט מקומות שבהם הוא לימד דברים שהם פשוט לא נכונים בכלל.\n\nשעורי הבית: סבירים, אם כי ישנן טעויות רבות בפתרונות הרשמיים - ואנשים פשוט מרפרנסים מזה ולומדים דברים לא נכונים.\nבד\"כ יש גם סימולציית מחשב בתוכנת AWR שאמורה להוות 5% מהציון הסופי ובגלל סיבות כאלה ואחרות היא בוטלה בסופו של דבר בסמסטר שלנו. \nחשוב לציין שמשכו אותנו עד לשבוע האחרון של הסמסטר לעדכון בנוגע לתרגיל הסימולציה.\n\nהמבחן: במועד א' היו לא מעט טעויות, והסגל החליט לשנות את התשובות אחרי פרסום הציונים ופרסום הפתרון הרשמי, אחרי שהתגלו שאלות שהסגל בעצמו טעה בהן בתשובות. \nיותר מזה, בחלק מן השאלות החליטו להשאיר תשובות לא נכונות בכלל (משהו שמופיע בכל ספר בתחום של RF) - רק בגלל גאוותנות של הסגל.\n\nהשורה התחתונה: לא ממליץ בכלל על הקורס.\nהתחום מאוד מעניין אבל ההתנהלות של סגל הקורס לאורך כל הסמסטר וגם במבחן הייתה בעייתית מאוד בלשון המעטה.\nלאורך כל הסמסטר היה מספר לא סביר בכלל של ביטולים של הרצאות ותרגולים (סדר גודל של חצי). ההשלמות של ההרצאות והתרגולים כמובן היו תמיד בצה\"ד ביום רביעי (כאשר אני למשל עובד בימי רביעי ולכן לא הייתה לי בכלל אפשרות ללמוד את הקורס בצורה פרונטלית). \nכלומר, צריך לקחת בחשבון שהקורס מועבר בימים שמופיעים בUG *וגם* בימי רביעי בין 12:30-14:30 באופן כמעט קבוע.\nבנוסף, ביטול תרגיל המחשב והקטנת מרכיב שיעורי הבית מ-15% ל-10% כמובן לא היו בטובת הסטודנטים.\nמעבר לכל אלו, במועד א' עצמו היה חלק שלם של יותר מ-20% מהמבחן על דרגות הגבר ומגברים דיפרנציאליים (ממעגלים לינאריים) - שלא נגענו בו בכלל בשום צורה שהיא בקורס.\nלא זו בלבד, החלק הזה היה גם מלא בטעויות, שרק חלקן תוקנו *לאחר* שכבר פורסמו הציונים של המועד א'.\n\nלסיכום, מי שמתעניין בתחום של RF SYSTEM מומלץ בחום ללמוד מהספר של RAZAVI.\nלא ממליץ בכלל על הקורס במתכונת הנוכחית, בעיקר בגלל הסגל.", "timestamp": 1645791922747}, {"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלכסיי דיסקין\nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר בצורה מאד מסודרת וברורה, כדאי להדפיס את השקופיות לפני ההרצאה ולכתוב עליהן את כל ההערות שאלכסיי מוסיף, זה עוזר אח\"כ למבחן. אלכסיי גם מגיע מהתעשייה ואפשר להרגיש שהוא מביא רוח אחרת לקורס(בקטע טוב כמובן).\n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: התרגולים לא ארוכים, לגמרי אפשרי לעבור עליהם לבד. בדפי תרגול בדר\"כ מופיע רק המשוואה הראשונה והתוצאה הסופית ולא ככ ברור איזה הצבות או הנחות עשו באמצע, אז כדאי לראות שאתם יודעים ממש להציב בנוסחאות ומקבלים את המספרים הסופיים(עם היחידות המתאימות).\n\nשעורי הבית: \n2 תרגילים יבשים 10%, לא ארוכים. כדאי לעשות לבד\n\nהמבחן: מבחן אמריקאי, 15 שאלות. בודק בעיקר הבנה ופחות טכניקה(אם יש תרגיל חישובי הוא מאד ישיר ואין מה להסתבך). מי שחזק בחומר יכול לצאת תוך פחות משעה. היו קצת פיקשושים קטנים בתשובות אבל לא משהו יוצא דופן משאר המבחנים האמריקאיים בפקולטה.\n\nהשורה התחתונה: קורס בסיסי בתקשורת, בנוי טוב ומסודר.", "timestamp": 1645953478405}, {"author": "RF", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלכסיי\nחוות דעת - הרצאות: \nמרצה מעולה, באמת רוצה שנלמד ונבין. הוא בא עם גישה פרקטית ולא תיאורטית וכך גם החומר של הקורס הכי פרקטי שחוויתי בפקולטה.\nמדי פעם יש טעויות בשקפים ודוגמאות שלא מועברות הכי ברור וזה קצת מוריד מההרצאות אבל בגדול הן טובות וחשובות.\n\nשם המתרגל/ת:  איתמר\nחוות דעת - תרגולים: \nהוא מבין מעולה את החומר אבל מסביר דברים רק אם שואלים אותו במהלך התרגול, אחרת בעיקר מקריא את הפתרון ומרגיש לי שהייתי תלוי בכמה אנשים שאלו במהלך התרגול בעיקר.\n\nהמבחן: \nמרבית השאלות לא מסובכות בכלל. עם זאת כשיש שאלות טכניות (כתלות במועד יכול להיות גם חצי מהמבחן, לרוב זה איזה רבע מהמבחן), מגלים שאת החלק הטכני של איך לפתור תרגילים בקורס לימדו בצורה מאוד לקויה, במהלך הלמידה צריך להתאמץ מאוד כדי להבין איך לפתור כי או שיש ממש מעט דוגמאות או שחלק מהדברים בכלל לא עברו בתרגולים.\nבנוסף לזה יש גם מדי פעם טעויות במבחנים שזה קצת מבאס.\nבכל מקרה נראה שאלכסיי מתחשב כשיש טעויות/בעיות ובמועד ב' הוא גם פקטר 2 שאלות שאף אחד לא הצליח לפתור.\n\nהשורה התחתונה: \nהקורס הכי רלוונטי לתעשייה שעשיתי בטכניון. עושה recap מעולה לבעיות פרקטיות בעולם התקשורת ולא מתעכב על התיאוריה בשום שלב. אלכסיי מביא הרבה מהידע הפרקטי שלו לקורס ואני לגמרי ממליץ לקחת את הקורס, גם אם יש בו מעט בעיות טכניות לעיתים.", "timestamp": 1648448798665}, {"author": "רון", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלכס דיסקין\nחוות דעת - הרצאות: מרצה מעולה ומעורר השראה. הסגנון שלו בהעברת החומר וההרצאות היה מצוין, בייחוד שהוא חוזר על הדברים המהותיים של ההרצאה הקודמת בתחילת כל הרצאה ומחלק סוכריות למי שעונה נכון... \n\nשם המתרגל/ת: איתמר מלמד\n\nשעורי הבית: \nספיציפית לסמסטר זה בוטל התרגיל הרטוב בגלל בעיות רישיון. היו 2 יבשים תקפים שהיוו 10% מהציון\nהמבחן: מועד א' היה מאוד קל. אני אישית נאלצתי לגשת למועדי ב' ו-ג', ושם המבחנים היו זוועתיים ביותר. \nהמבחן אמריקאי, כך שאם טועים בדרך, מאבדים המון ניקוד...\nהשורה התחתונה: \nלגשת רק למועד א'. מועד ב' פי 1000 יותר קשה...\nהקורס עוסק בארכיטקטורה של מערכות RF, מבלי להיכנס לרמה המעגלית. מדברים על רעש, מודולציות תקשורת ומשדרים, הפסדים, תכן מקלטים ומכ\"מ\nחשוב להבין את ההרצאות והתרגולים בצורה טובה כדי להשיג ציון טוב בקורס... אם ניגשים למועד ב', כדאי להשקיע יותר בפתרון שאלות של מבחנים ישנים.\nמומלץ למי שמעוניין להתעסק ב-RF מבחינת ארכטקטורה של מערכת.", "timestamp": 1649247857486}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלכסיי דיסקין.\nחוות דעת - הרצאות: \nמרצה סביר לדעתי אבל לא יותר מזה. בכללי מרגיש שההרצאות והקורס לא נכנסים לעומק כל כך. ויותר מועבר הקורס \"סקירה\" בנושאים ואספקתים שונים של מערכות תקשורת.\n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: \nמתרגל סבבה. מובן וסבלני.\nשעורי הבית: היו 2 יבשים ו2 רטובים. הרטובים לא ארוכים בכלל אז מבחינת עומס לא אמור להדאיג לדעתי. והיבשים גם לא דרשו הרבה מאמץ.\n\nהמבחן: \nחומר פתוח.\nמועד א היה נורא הסמסטר. שאלות עם ניסוח מעורפל. הרבה התלוננו שהיו שאלות על חומר שבכלל לא תרגלנו בש.ב או בתרגולים ורק הייתה הרצאה אחת עליו. \n\n אך לדעתי הבעיה העיקרית שהיו לא מעט שאלות אמריקאיות עם ניסוחים מאוד מבלבלים. וגם אם מבינים את החומר היטב אפשר להתבלבל ובלי לשים לב לאבד 20 נקודות בגלל ניסוח מעורפל ודו משמעי. בכללי המבחן הסמסטר היה הרבה יותר קשה מהרגיל אך עם זאת שמתי לב לתרנד כזה גם במבחני עבר של שאלות שכתובות בצורה מבלבלת.\n\nהשורה התחתונה: \nהייתי ממליץ רק לקחת את הקורס אם יש באמת זיקה לתחום שקשור לתקשורת או RF \n\nאחרת זה ירגיש כמו סתם קורס אקראי שעובר על מלא נושאים רנדומליים.\n\n הוא כן פותח ידע רלוונטי להרבה אספקטים שונים אך שוב הוא יותר מרגיש כמו קורס סקירה ראשוני שלא נכנס לעומק יותר מדי.", "timestamp": 1677190261808}, {"author": "speak true", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלכסיי דיסקין\nחוות דעת - הרצאות: ההרצאות סבירות. אלכסיי הוא מרצה עם המון ידע ורואים שיש לו זיקה גדולה לתחום. הקושי נובע מכך שההרצאות באנגלית והוא פשוט חוזר על דברים מהר תוך כדי קריאה מהשקפים. לפעמים בהרצאות הוא גולש גם מעבר לחומר שהוא לא רלוונטי בכלל לקורס וזה סתם גורם לאיבוד ריכוז.\nידעתי את הקורס מעולה לפני הבחינה, הציון לא משקף בכלל את הידע. \n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: איתמר באמת בן אדם נחמד בסך הכל,  אבל אני לא יודעת איך הוא מתרגל הוא ממש מבולגן וקשה להבין אותו בתרגולים. אם תקראו אותם לבד אתם תסתדרו\n\nשעורי הבית: בסדר גמור, לא עמוסים יותר מדי ולגמרי פתירים\n\nהמבחן: מי שלא אוהב בחינות אמריקאיות שלא ייקח את הקורס. לדעתי הבחינה הייתה מבלבלת וטריקית.\n\nהשורה התחתונה: אם לא בא לכם להוריד ממוצע, אל תיקחו את הקורס!!!!\nיש קורסים יותר מוצלחים בפקולטה שאיתם ניתן לסגור שרשראות.", "timestamp": 1716100388334}, {"author": "סטונדט 0", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  אלכסיי\nחוות דעת - הרצאות: החומר מעניין ואלכסיי מעביר אותו צורה טובה. \n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: דפי התרגול מבולגנים ולא מובנים.\n\nשעורי הבית: שני תרגילים יבשים, לא קשים מידי אבל ארוכים לפעמים יש איזה תרגיל מונפץ. בסך הכל כדאי להשקיע כי הם מחדדים את החומר.\n\nשני תרגילים רטובים שהשני אצלנו הפך לבונוס (לא עשיתי). \nהראשון חמוד לא ארוך או קשה ורואים בעין את החומר.\n\nהמבחן: מבחן אמריקאי וטריקי צריך להיות חדים על כל החומר בהרצאות כי יש שאלות על נושאים איזוטרים. \n\nהשורה התחתונה: בסך הכל בסדר", "timestamp": 1716111912593}]}