{"posts": [{"author": "גבי", "difficultyRank": 4, "generalRank": 5, "semester": "202003", "text": "הסגל ממש הוגן ומסביר בצורה טובה ומדויקת מה רוצים ממך. היו זמינים ועזרו בכל מה שהיה צריך.\nהקורס בזוגות.\n\nשעורי הבית:  דו\"חות שדורשים 15-30 דקות לקראת רוב המעבדות, ופרויקט שמתחילים לעבוד עליו בערך מאמצע הקורס.\n\nמבחן:  הצגת הפרויקט בסוף הקורס.\n\nהשורה התחתונה: לא מאוד קשה, אבל דורש הרבה זמן. בגלל שאין כל כך זמן במהלך סמסטר רגיל, אני ממליץ לקחת אותו בקיץ.", "timestamp": 1634724539774}, {"author": "סטונדט", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: -\nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: דוחות הכנה שלפעמים קצרים מאוד ולפעמים ארוכים כמו הגלות. \n\nהמבחן: אין מבחן. יש את הפרויקט, תיפרדו משעות שינה ומהקורסים האחרים כי שבועיים תשקיעו רק בזה.\n\nהשורה התחתונה: בגדול אני די נהניתי במעבדה, קצת לעבוד תכלס ולא עוד חומר תיאורטי. גם לעשות את הפרויקט למרות העומס שהוא יוצר היה מהנה. המעבדה מסתיימת בערך חודש לפני  סוף הסמסטר שמאוד תורם להורדת העומס בסוף והשלמת פערים. הציונים בסוף גבוהים בהתאם לזמן שהמעבדה דורשת.", "timestamp": 1643912848001}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות הכנה שבועיים, לרוב לוקח באזור שעה לעבור על חומר ההכנה, ועוד שעתיים-שלוש לסגור את הדו\"ח. לא קשים במיוחד ולא ממש עמוסים.\n\nהמבחן: רוב הציון מורכב מהפרוייקט - עמוס מאוד, בערך שבועיים-שלושה של עבודה אך ורק על הפרוייקט. עמוס מאוד בתקופה של לפני ההגשה, אבל בגלל שהמעבדה נגמרת חודש לפני סוף הסמסטר אפשר להשלים אחר כך את הפערים בקורסים האחרים.\n\nהשורה התחתונה: אני נהניתי ממש, הפרוייקט ממש נחמד למרות העומס, והציונים משקפים את ההשקעה.", "timestamp": 1644078936827}, {"author": "אינטל", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המדריך: אבי סולומון\nחוות דעת - הרצאות: מדריך מצויין הכי טוב\n\nשעורי הבית: דוחות הכנה שבועיים ארוכים.\n\nהמבחן: פרויקט שדורש הרבה השקעה.\n\nהשורה התחתונה: 10/10", "timestamp": 1644165290567}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "מעבדה עמוסה באמצע הסמסטר אבל נגמרת מוקדם (המפגש האחרון בשבוע 9). יש פרויקט די גדול שלקח לי את כל חנוכה+כמה ימים אחר כך, וחוץ מזה דוחות שבועיים שלוקחים שעתיים בשבוע בממוצע. \nאני מאוד נהניתי במעבדה הזו, היא מאוד עמוסה אבל גם מספקת והפרויקט תכלס כיף. שואבת זמן, אבל מספקת והציון מתגמל.", "timestamp": 1646933664635}, {"author": "i'm a boss bitch", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שעורי הבית: דוחות לניסויים סה\"כ סבירים מאוד, לוקחות שעה- שעתיים \n\nהמבחן: יש בסביבות שבוע 9 פרויקט ארווווווך, אל תעשו טעות ותתחילו בו מאוחר, עדיף שתסיימו ממש לפני כולם בשבוע החמישי-שישי, למרות שאין לכם הרבה כלים, כולם בסוף יקבל ציון טוב, אבל אל תפספסו את ההרגשה העצמית שעשיתם משהו נהדר עם הפרויקט, זה כמו בוחן להכנה לראיונות עבודה. תקפידו להבין כל מעבדה ואיך בוצעה ובעיקר מעבדת VGA , אם הבנתם הכל, יזרום לכם הפרויקט ולא תתקעו באמצע.\n\nהשורה התחתונה: מעבדה סבירה, אבל הפרויקט עמוס רצח, תחלקו את העומס על שני השותפים ושיהיה התקדמות ממש מוקדם, אל תחכו לרגעים האחרונים", "timestamp": 1654613322898}, {"author": "ורילוג", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות הכנה כל שבוע , הכנה לפרויקטון\n\n\nהמבחן: הצגת הפרויקט מול סטודנטים ומדריכי המעבדה", "timestamp": 1655161903167}, {"author": "הדר", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם מדריך: מוחמד\nחוות דעת - הרצאות: אחלה מדריך,תמיד עוזר ברצון ומסביר טוב מאוד, מומלץ אם יש לכם אופציה.\n\nהשורה התחתונה: כידוע 2 נק\"ז לא באמת משקפות את המעבדה, יותר לכיוון 5 מבחינת זמן שאתה שם בה.\nאני הוספתי את המעבדה בסמסטר 4 של חשמל לפי המומלצת (יחד עם אותות, מלמ, שדות והסתברות) וזאת הייתה החלטה טובה ביחס לסמסטר 3 שהוא יותר עמוס.\nנתנו לנו לעבוד על הפרוייקט כבר בפסח וזה היה מעולה סיימנו את רובו שם, מומלץ מאוד לסיים את הפרוייקט הארוך שגוזל כ 100 שעות בחופש של הסמסטר - פסח או חנוכה אחרת נגררים איתו וזה יוצר בלגן.\nתשאלו חברים שכבר עשו איך לעבוד נכון עם הבלוקים הנתונים כבר וזה אמור לרוץ בקלות יותר מההתחלה.", "timestamp": 1656070754568}, {"author": "ל\"א", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אייל לב\nחוות דעת - הרצאות: הוא בין המדריכים שכן יודעים מה הם עושים, עדיף להיות אצלו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עבודת הכנה לפני כל מעבדה ופרוייקט גדול, דיי עמוס\n\nהמבחן: אין מבחן הציון הוא על סמך הפרוייקט, ההגשות השבועיות (הכנה ובמעבדה) והבחני כניסה למעבדה\n\nהשורה התחתונה: עמוס אבל מעניין יחסית", "timestamp": 1679665793797}, {"author": "גאוס 2", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: בעז (שנות אור)\nחוות דעת - הרצאות: \nבעז מדריך אעש, אם יש לכם אפשרות לכו אליו\n\nשעורי הבית: \nדוחות כל שבוע. מעיק בעיקר בתחילת הסמסטר שם הדוחות יותר ארוכים אבל זה בסדר כי בקורסים האחרים לרוב דווקא דיי גרוע.\n\nהמבחן: \nפרויקט מגעיל ומעיק, תכינו תתחת.\n\nהשורה התחתונה: \nמעבדה חובה, אבל תכלס גם נותנת אחלה כלים למהנדסי חשמל.\nחוץ מזה מתי תהיה לכם עוד הזדמנות לעשות צחוקים עם דודי?", "timestamp": 1690469699103}, {"author": "Grades", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אייל/מור/אוהד\nחוות דעת - הרצאות: \nאייל ומור היו טובים, אוהד הרגשתי ממנו חוסר מקצועיות ולא היה נחמד במיוחד.\nלא הרגשתי בכלל עזרה/הכוונה בפרוייקט ממנו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nפרויקט גדול שלוקח כמות שעות מוגזמת עם בדיקה הכי מעפנה שקיימת\n\nהשורה התחתונה: \nקורס שכל מה שהוא עושה זה להרוס את הסמסטר.\nאתה מזניח שבוע ומשהו מהסמסטר רק בשביל לסיים את הפרוייקט, עובד עליו לפחות 120+ שעות(תלוי פרוייקט), ואז עושים את הבדיקה הכי שטחית והכי מעפנה שיש.\nקורס כזה מאכזב, ובעיקר מעצבן הכמות שעות הלא פרופורציונליות לנקז שאתה משקיע וכמעט לא מקבל תמורה.\nקורסים יותר חשובים עם יותר נקז אתה נאלץ להזניח בגלל המעבדה הזאת ואז תקופת מבחנים אתה מקווה לטוב.", "timestamp": 1690803044274}, {"author": "ראז", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "*פרויקט ועומס ודברים אחרים רשומים בכל חוות דעת השונות ואני מסכים איתם*\n\nאני פה להזהיר אותם לא לקחת את המעבדה עם \"קובי\" \nלא יודע אם יש יותר גרוע ממנו אבל בטוח לנסות לא לקחת איתו. לרוב הוא: \nמבלבל את הסטודנטים.\nלא עוזר בהתקדמות. \nלוקח שעה לעבור על חומר שלא אמור לעבור עליו (נו למדנו את זה בבית)\nלא נותן פידבק טוב, לא מקדם.\n\nפשוט אל....נסו להחליף או להתרחק", "timestamp": 1691158218167}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202203", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בקיץ - 10 שעות בשבוע לפחות (בנוסף לשעות הפרונטליות במעבדה).\n\nהמבחן: הצגה של הפרוייקט בעזרת מצגת, קליל יחסית.\n\nהשורה התחתונה: קורס עמוס מאוד - לא בהתאמה לכמות הנק\"ז. הפרוייקט עצמו מגניב.", "timestamp": 1696154857084}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202203", "text": "שם המרצה:  דודי בר און - היה גם המדריך במעבדה\n\nממה שהועבר נאמר כי מהסמסטר הנוכחי יירדו רמת הדרישות בפרויקט וזה אמור להיות קל יותר ופחות עמוס.\n\nבפועל במהלך הקיץ זה 2 מעבדות בשבוע עם בערך 5 שעות עבודה על כל מעבדה\n\nהפרויקט עצמו חשוב להתחיל לעבוד מוקדם ולא להגיע לסוף עם פערים כי יהיה קשה לסגור את זה.\n\nבסך הכל ממליץ מאוד לקחת בקיץ ולא בזמן סמסטר חבל על הזמן, תשקיעו אותו בקורסים אחרים בסמסטר רגיל.\n\nהמבחן:  מצגת ומעבר על הקוד של הפרויקט\n\nהשורה התחתונה:  פעם ראשונה שמבינים איך דברים שלמדנו בספרתיות מתקשרים וחשובים באמת, סוף סוף קצת פרקטיקה", "timestamp": 1700495315451}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אייל לב\nחוות דעת - הרצאות: הוא יודע את החומר שהוא מעביר בניגוד להרבה אחרים שם, ממליצה ללכת אליו הוא אשכרה ידע לעזור לכם עם התוכנה והפרויקט\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש עבודות הכנה ללפני המעבדות שהן דיי ארוכות, ויש את הפרוייקט שהוא מאוד גדול וגוזל מלא זמן\n\nהמבחן: אין\n\nהשורה התחתונה: קורס חובה, דיי עמוס אבל מעניין", "timestamp": 1705162460662}, {"author": "tj", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה (מדריך) : דן\nחוות דעת - מפגשים: יש משהו כמו 9 מפגשים רובם מרגישים דיי רלוונטיים. כל פעם מתחילים בבוחן של כמה דקות ואז מעבר קצר על חומר הרקע, דן היה מאוד תכליתי עבר על דברים רלוונטים ונתן דגשים חשובים. \nבמהלך העבודה שהרבה ממנה עצמית צריך לקרוא למדריך מדיי פעם להסתכל. דן היה מכבד מאתגר אבל גם מבין.\nיש דוח מעבדה שיש בו הוראות \"תפתחו קובץ\" \"תבנו מונה\" ועוקבים אחריהן. זה מאוד מגניב לראות את מה שכותבים עובד על כרטיס פיזי, כלומר כבר במעבדה הראשונה עושים שער or ורואים אם מנורות נדלקות בהתאם ללחיצה על כפתורים. \nרוב המפגשים אצלנו נמשכו אל תוך השעה שאחריי המעבדה, היה מפגש יחיד שנמשך אפילו עוד שעה, המפגש הראשון והשניים האנלוגיים נמשכו כ 4 שעות בדיוק. \n\nעבודות הכנה: כל שבוע יש עבודת הכנה לוקחת פחות משעה ורלוונטית גם לבוחן וגם למעבדה עצמה. \n\nבחנים: בחנים מאוד הוגנים, רק על חומר שנמצא בהכנה.\n\nעבודות מסכמות: במהלך המעבדה ממלאים דוח, הדוחות במעבדה הזאתי הם לרוב מאין שאלונים במודל, יש כמה שהם שאלונים בקובץ וורד. לא צריך לכתוב דוח מסודר עם פסקאות ופרקים ושטויות. כל הדוחות נכתבים בזמן המעבדה. \n\nפרוייקט: הפרוייקט שלנו היה הגיוני לזמן שנתנו לנו, עזרו לנו לחלק אותו לחלקים אפשריים, עשינו בזוגות. הפרוייקט שלנו היה דומה למשחק מריו, נתנו הוראות ברורות על מה הדרישות עבור 70 ועבור מאה, ועודדו את כולם לעשות מעל ומעבר להן. \nאני לא עבדתי אף לילה לבן, בשבוע האחרון נתנו קצת גז אבל לא משהו מטורף . עשינו את זה במהלך סמסטר שגם לא היה בו שבוע הפסקה ועדיין הצלחנו לעמוד בדרישות ובזמן. \n*צוות המעבדה מקיים \"שעות קבלה\" במהלך כל התקופה שעושים את הפרוייקט אז כל הזמן אפשר לגשת ולבקש עזרה. \n\nדוח פרוייקט: מאוד מסודר, נותנים קובץ וורד עם דוגמאות איפה שצריך. כל פעם יש שאלה למשל \"תנו דוגמא לבאג שהיה לכם והסבירו איך פתרתם\" וצריך לענות. לוקח זמן אבל מאוד אפשרי.\nצריך להכין גם מצגת שיש לה המון חפיפה עם הדוח. גם לוקח זמן. \n\nהצגת פרוייקט:  \nמראים בדקה או שתיים את הפרוייקטים של כל הקבוצות שמציגות באותה שעה, ואז בקבוצות של 3 זוגות עם כל המדריכים של הקבוצות האלו מציגים את המצגת, לכל קבוצה יש 10 דקות באותו הזמן אפשר גם להציג עוד את הפרוייקט עצמו. מיד אחריי זה יושבים 10 דקות עם המדריך והוא עושה code review בסגנון של \"למה פה זה כפל ולא and\" או \"למה זה לא מודולים נפרדים\" . \n\nהשורה התחתונה: \nפחות עמוס ממה שסטודנטים הפחידו אותי שיהיה (אבל גם אמרו שנתנו לנו פרוייקט יחסית רגוע בגלל שזה סמסטר מלחמה) . אם שני השותפים עובדים ומצליחים לחלק בינהם עבודה נכון זה מאוד אפשרי. אני לא חושב שחייבים לדחות את זה לקיץ אבל כן צריך לאפשר לזה זמן. כל השבוע לפני ההגשה כנראה ילך על זה ובמהלך השבוע זה לוקח זמן גם כן. זה שלא צריך לכתוב דוח אחריי המעבדה מאוד מקל. \nמעבדה מאוד הוגנת, מאוד באים לקראת, מאוד אכפת להם, יש עם מי לדבר אם צריך. והיא גם מהנה לא עושים דברים סתם. \n\nגם מצאתי את זה מרתק, אני מאוד נהנתי מהחומר, מהאפשרות לבנות משהו מורכב סוףסוף, אני מרגיש שלא הבנתי עד הרגע הזה את ההבדל בין כתיבת חומרה וכתיבת תוכנה. אני מרגיש ממש בנוח עם system verilog עכשיו. אני ממליץ בחום (אפילו שזה חובה)", "timestamp": 1712481078463}, {"author": "יובל", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אוהד סגל\nחוות דעת - הרצאות: המעבדות נחמדות לרוב, אוהד מעביר אותן באווירה טובה.\n\nשעורי הבית: עמוסים, דורש ערב שלם בשבוע. \n\nהמבחן: אין מבחן אבל יש פרויקט סיום תובעני ביותר, ממליץ לבחור מראש שותף שכיף לכם להעביר איתו ביחד את הזמן כי יהיה לכם המון זמן ביחד.\n\nהשורה התחתונה: קצת קשה אז בוכים?", "timestamp": 1715426858079}, {"author": "קורסגרוע", "difficultyRank": 5, "generalRank": 1, "semester": "202302", "text": "שם המרצה: אוהד\nחוות דעת - הרצאות: אוהד הוא הבן אדם הכי נורא שנתקלתי בו בטכניון. מציע לכולם כולל כולם שיוצאים איתו לברוח כמה שיותר מהר. הבן אדם מתנשא, לא נחמד, חופר, וכשאתה שואל שאלה במקום לענות לך הוא מבלבל את המוח שעה ואז גם מתבזבז לך הרבה זמן, וגם אתה יוצא יותר מבולבל מלפני ששאלתה. לסיכום, תברחו ממנו כמה שיותר מהר\nבכלל המעבדדה הזאת גוזלת ממלא זמן. לא מבין למה לא משנים את הכמות חומר שיש שם. שלא נדבר על זה שכל המעבדות הראשונות לומדים לפרויקט, ואז שיש אותו שגם הוא לוקח מלא זמן, מלמדים עוד שתי מעבדות שלא קשורות בכלל אליו. מה שמרגיש בזבוז זמן מוחלט.\nללא ספק הקורס הכי טובעני ובזבוז זמן שעברתי הסמסטר. ממליץ לכל אחד שחושב לקחת אותו לכיף לברוח.\nהוא הרגיש לי יותר נורא מכל הקורסים שעשיתי הסמסטר ביחד בו זמנית. ואני לא אחד שמתלונן על קורסים כל כך בדרך כלל\nמקווה שהסגל המעאפן שם יעשה איזה משהו וישנה את האופן שהקורס מועבר, כי מה שקרה עד עכשיו (בדגש על אוהד הבן אדם הכי חסר אמפתיה וסוציופת בטכניון) לא בסדר בכלל \n\nשם המתרגל/ת: אין תרגולים\nחוות דעת - תרגולים: אין תרגולים\n\nשעורי הבית: \nיש עבודות הכנה שמבזבזות כל כך הרבה זמן\nקריאה של חומר שנבחנים עליו בתחילת המעבדה, וגם ככה לומדים אותו במהלך המעבדה עצמה. בזבזתי אני והשותפ\\ה שלי כל כך הרבה זמן\n\nהמבחן: \nאין מבחן, יש פרויקט שלוקח זמן פשוט מטורף\nלא משנה מה אני אכתוב עכשיו על הפרויקט, זה לא יתקרב לתיאור כמה הדבר הזה נורא\n\nהשורה התחתונה: \nהקורס הכי גרוע שלקחתי בטכניון, מודה כל כך שסיימתי אותו, ומקווה שישנו אותו לטובת הדורות הבאים\nעצה אישית: כל מה שאתם יכולים לרפרנס, תרפרנסו\nזה בזבוז זמן מוחלט שלא יעזור לכם כלום (אולי חוץ מללמוד קצת סיסטם ורילוג)", "timestamp": 1716407332415}]}