{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "201901", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: רצוי לסכם, או להדפיס סיכומים ולהביא להרצאות, כי החומר מועבר בצורה די מרושלת ומפוזרת דרך מצגות, ולמרות זאת חשוב להגיע להרצאות בגלל המבחן.\n\nשם המתרגל/ת: שלומי בושר\nחוות דעת - תרגולים: מתרגל מצוין, רואים עליו שהוא יודע את כל החומר בקורס על בוריו, וגם שזה מעניין אותו ברמה שהוא גורם לנו להתעניין ולהתלהב מהתחום הננו-מיקרו בפקולטה.\n\nשעורי הבית: ממוחזרים, רובם לא קשורים בכלל לחומר אלא מכילים כל מיני פיתוחים מוזרים של תאוריות שלא קשורות לנושאים שנלמדו.\n\nהמבחן: המבחן היה לא הוגן ברמות, מי שחיבר אותו הוא המרצה השני, יובל, שכמעט אף אחד לא הלך להרצאות שלו. והוא חיבר מבחן שהתנקם בכל מי שלא היה אצלו בהרצאות, כי המרצה השני הורגש שהעביר כמעט קורס שונה לחלוטין ממה שאלכס העביר.\n\nהשורה התחתונה: הקורס מכיל כמה נושאים מעניינים אבל רובו משעמם, הרבה פיסיקה, לא קל להתחבר לחומר, רק את מי שמעוניין ללכת לשרשרת ננו-מיקרו. גם ההתנהלות לא היתה טובה, אלכס ויובל שני מרצים כאילו העבירו קורסים שונים לגמרי, כמעט לא היתה חפיפה בחומר ביניהם ולא היה שום תיאום. פשוט לא עניין אותם.", "timestamp": 1597830318571}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "חוות דעת - הרצאות: \nהמרצים לא מסונכרנים בכלל\nחוות דעת - תרגולים: \nהמתרגלים מנסים אבל זה לא כלכך מספיק\nשעורי הבית: \nיש אחד כל שבוע\nהמבחן: \nעם חומר פתוח, שאלות מנוסחות בצורה מזוויעה. עשו מלא טעויות בניקוד וכדי לעקוץ ושלא יהיה פקטור נתנו 10 נק' בונוס שכנראה רק בודדים הצליחו. \nהשורה התחתונה: \nקורס לא מומלץ, אבל נכפה עלינו לעשות אותו בממולצת. לא ברור מה מטרת הקורס, הסגל לא מעבירים את החומר בצורה טובה. ולסיכום קורס מיותר שלא למדתי ממנו כלום ולא אקח ממנו שום דבר לעתיד.", "timestamp": 1613033990018}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: מרצה טוב, אבל אלכס והמרצה השני (יובל) לא מסונכרנים בינהם, מעבירים חומר שונה וזה גם משתקף במבחנים.\n\nשם המתרגל/ת: שלומי בושר\nחוות דעת - תרגולים: אחד המתרגלים הטובים שיצא לי להכיר. לא רק מבחינה לימודית, אלא גם מבחינה של יחס לסטודנטים. רואים שהוא רוצה בטובתנו ואכפת לו, והוא באמת יודע ומכיר את החומר.\n\nשעורי הבית: גיליון בשבוע, הרוב מרופרנס \n\nהמבחן: אחד המבחנים הקשים שיצא לי לעשות. היו בו דברים שאם לא היית בהרצאות של יובל (ורוב הסטודנטים לא היו) לא ידעת לענות עליהם. לא כלל חצי מהחומר שתרגלנו הסמסטר.\n\nהשורה התחתונה: קורס סבבה אם המרצים היו מתואמים. קורס פיזיקלי עם הרבה הבנה, ממש ההמשך של פיזיקה 3ח. אומרים שמהסמסטר הבא יובל ואלכס יכתבו את המצגות שלהם מחדש ויעבירו את אותו החומר, אז אולי המצב במבחן ישתפר...", "timestamp": 1613393471356}, {"author": "למא הוארי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים: מסביר את הדברים בצורה די אנטואטיבית, לא מסבך, והתרגול זורם איתו מהר.\n\nשעורי הבית: \nרק יבשים, לא לוקחים יותר מדי זמן, סטרייט פורוורד אין בהם דבר מיוחד\nהמבחן: המבחן קצת לא תואם את סגנון הלימוד במהלך הסמסטר, אז כדאי להיחשף למבחנים מוקדם ולגוון (יש הרבה מבחים באותו סגנון וזה לאו דווקא מה שתקבלו במבחן שלכם).\n\nהשורה התחתונה: שני המרצים לא מתואמים בכלל, למרות שלא ראיתי הרבה הרצאות, אבל הם עשו לנו בראש בלאגן אחד גדול.", "timestamp": 1614004664093}, {"author": ":(", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  אלכס\nחוות דעת - הרצאות:  הקלטות, ההרצאות יחסית מובנות ומוסברות טוב. כדאי להגיע לשעות קבלה כדי לברר פרטים קטנים שלא הובנו במהלך ההרצאה.\n\nשם המתרגל/ת:  דימה/שלומי\nחוות דעת - תרגולים:  לא הועברו בצורה טובה. היו המון חישובים מתמטיים שלא הוצגו כראוי וניסוי להעביר אינטואיציה בלבד במהלך התרגולים. \"למען הסר ספק\", זה ממש לא מה שחיכה במבחן...\n\nשעורי הבית: גיליון שבועי, לא ארוך במיוחד\n\nהמבחן: לא פשוט בכלל. נראה היה כי המבחן \"תלוש\" מחומר הקורס ודורש חישובים מתמטיים מורכבים וארוכים ושואל על דברים תיאורטיים שלא כ\"כ נלמדו. כמו כן, הוקדש ניקוד גבוה לתרגיל שהועבר בכמה דקות בתרגולים (משושה, תרגול 12:) ).\n\nהשורה התחתונה: אם אינו קורס חובה, לא כ\"כ מומלץ. אמנם, מקבלים תובנות של נוסחאות במל\"ם אך זה לא שווה את זה", "timestamp": 1619778863668}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: אלכס מרצה נחמד ומסביר בסדר.\n\nשם המתרגל/ת: נדב לנדאו\nחוות דעת - תרגולים: מתרגל טוב וניכרת ההשקעה שלו.\n\nשעורי הבית: במקרה שלנו היו תשעה תרגילי בית להגשה, שכללו סעיפי חישוב ולעיתים אפילו סעיפים שהיה צריך לחשב או לשרטט בהם באמצעות matlab. לעיתים היו גם שאלות ממבחנים.\n\nהמבחן: כלל שלוש שאלות פתוחות עם הרבה חישובים מעצבנים. נתנו תוספת של חצי שעה לזמן המבחן והביאו תוספת של 18 נקודות לציון המבחן.\n\nאציין שגם היה בוחן אמצע מגן שמשקלו 35%. גם לבוחן וגם למבחן ניתן היה להביא חמישה דפי נוסחאות דו-צדדיים.\n\nהשורה התחתונה: לדעתי, הקורס מעניין, אך בעייתי בצורה שבה הוא מועבר, וזה לא בגלל איכות ההוראה אלא בעיקר בגלל הפער בין איך שהתרגולים מועברים (בעיקר פיתוח אינטואיציה פיזיקלית) למה שדרוש במבחן (לא מעט חישובים).", "timestamp": 1626634448417}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: מסביר טוב אם אתם מצליחים להקשיב.\n\nשם המתרגל/ת: נדב לנדאו\nחוות דעת - תרגולים: סבבה, מסביר טוב.\n\nשעורי הבית: שבועיים. סבירים, רובם ממוחזרים ואפשר לסיים אותם מהר.\n\nהמבחן: נוראי. לא באמת משנה כמה אתם יודעים את החומר. אבל מקבלים אחלה פקטור (אצלנו נתנו חצי שעה תוספת בבחינה וגם 18 נקודות פקטור - כלומר, מבחן מוגזם).\n\nהשורה התחתונה:  קורס חובה אין ברירה אלא לקחת", "timestamp": 1626962973014}, {"author": "םםםםם", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: אף פעם לא באמת הצלחתי להקשיב לו \n\nשם המתרגל/ת: נדב\nחוות דעת - תרגולים: מסביר טוב וסבלן\n\nשעורי הבית: רובם ממוחזרים, יש קצת מטלב\n\nהמבחן: נורא, ברוך שפטרנו \n\nהשורה התחתונה: למי שאוהב את התחום - אחלה. למי שלא - סבל מיותר. לא שיש לכם ברירה, זה חובה", "timestamp": 1632646197445}, {"author": "נח", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המתרגל/ת: ג'לאל\nחוות דעת - תרגולים: פשוט מקריא מהדף, לא מבין את החומר, היה המתרגל האחראי בצורה הכי לא אחראית שיש, פרסם ש\"ב שלא תואמים את השבועות בהם נמצאים ומבולגן.\n\nשעורי הבית: בזבוז זמן ואנרגיה\n\nהשורה התחתונה: קורס שיכול להיות מעניין, מועבר בצורה זוועה.", "timestamp": 1642865583876}, {"author": "~", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: הרצאות מאוד משעממות. חלק ראשון של הקורס (פיסיקה סטטיסטית) לא קשור לחלק השני של הקורס (מצב מוצק) ולא ברור מה הולך בכל הקורס. הוא עומד בפינה של הכיתה כל השיעור ומקריא את המצגת המאוד לא אינפורמטיבית ומבולגנת שלו. הוא לא היה מוכן להקליט את ההרצאות ולא היה מוכן לבוא לקראת הסטודנטים. אפילו הבוחן אמצע בקורס התחיל 10 דקות אחרי ההרצאה שלו והיינו צריכים להתחנן אליו שישחרר אותנו 20 דקות לפני כדי שנוכל להירגע ולהתארגן לבוחן שלו!\n\nשם המתרגל/ת: שלומי מוקלט מסמסטר קודם\nחוות דעת - תרגולים:  ההקלטות של שלומי טובות. הוא כן נוטה להקנות אינטואיציה והבנה ומסביר הרבה בנוסף למה שהולך בהרצאה. התרגולים מאוד מאוד חשובים. הרבה דברים עוברים בתרגולים ולא עוברים בהרצאה ואז נשאלים על זה במבחן. התרגולים הרבה פעמים יותר חשובים מההרצאה.\n\nשעורי הבית:  גיליונות אחת לשבוע. לא מאוד ארוכים. אפשר לסיים בכמה שעות עם רפרנסים. לפעמים יש רטובים מייגעים במטלב לפתור איזו משוואה סתומה או משהו מיותר כזה. רובם מרופרנסים. הרבה פעמים נשאלים על דברים שלא למדנו.\n\nהמבחן: המבחן קשה ועמוס. קיבלנו 11 נקודות פקטור. שאלה במבחן שמתבססת על נוסחה איזוטרית של מומנט מגנוט מפיסיקה 2 (בלי שדיברנו על זה מילה בהרצאות ובתרגולים) והנה 30 נקודות לפח על נוסחה שאתה לא זוכר.\n\nהשורה התחתונה: קורס מיותר, משעמם, לא מועבר טוב, מבולגן. לא מומלץ בכלל.", "timestamp": 1644947986434}, {"author": "ד", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה:אלכס חייט\nחוות דעת - הרצאות: הרצאות בסדר, אלכס עונה על כל מה ששואלים חבל שלא מקליט היה יכול לעזור מאוד כשלמדנו למבחן או סתם עשינו שיעורי בית\n\nשם המתרגל/ת: נדב\nחוות דעת - תרגולים: מתרגל סביר מבין טוב מאוד את החומר אבל כל המצגות שלו כתובות כשאלות ככה שתהיה חייב להגיע לשיעור ולא תוכל ללמוד בלי שהוא יהיה מולך\n\nשעורי הבית: \n\nהמבחן: היה בסדר אלכס הנפיץ קצת בכל מיני מקומות אבל בסדר\n\nהשורה התחתונה: הקורס לדעתי ממש מעניין אבל מועבר בצורה לא טובה בעיקר התרגולים די מבולגנים מבחינת נושאים יכול להיות שנלמד משהו בהרצאה ונלמד אותו בתרגול כמה שבועות אחרי והפוך ובאסה שאלכס מתעקש שאנחנו לומדים טוב יותר בלי הקלטות", "timestamp": 1645350165118}, {"author": "_", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: \nמעביר בצורה משעממת, אחרי בוחן אמצע הבנתי שלא עוזרים בכלום, והוא גם לא מוכן להקליט.\n\n\nשם המתרגל/ת: שלומי מוקלט\nחוות דעת - תרגולים: \nמסביר בצורה טובה.\n\nשעורי הבית: \nמרופרנסים ברובם.\n\nהמבחן: \nנורא ואיום, לא בודק ידע אלא לבדוק כמה הצלחת להכניס לדף נוסחאות.\nהורידו לחצי קורס נקודות על זה שלא ציירו מדויק..\nשאלות על חומר שלא נלמד (מפיסיקה 2ממ) או חומר שרק חלק מהמתרגלים העבירו.\n\nהשורה התחתונה: \nסגל זוועת עולם. אין אפילו פורום שאלות במודל. \nאם אתם יכולים תחליפו מסלול למשהו שלא צריך את הדבר הזה.", "timestamp": 1645366071171}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות:  איטיות, ולא יעילות. בערך 7 שעות הרצאה התבזבזו על התבוננות בתוכנות סימולציה (\"applets\") ומתוכן אולי שעה אחת במצטבר הייתה אפקטיבית. המון חומר חדש מועבר בתירגולים בלבד למרות שיש מלא זמן לעבור עליו בהרצאות.\n\nאין סיכום רשמי של החומר, אין פורום לשאלת שאלות אפילו שהנציג שלנו ביקש, הסגל מדי פעם מבריז משעות קבלה (כולל המרצה), מעט שעות קבלה לפני המבחן (ובהפרש זמן רב לפני מועד ב'), אין הקלטות.\nהפילוסופיה הפדגוגית של אלכס עושה שפגטים באוויר כדי להגיע במקרה לגמרי לשיטת ההוראה עם כמות ההשקעה המינימלית מצידו.\n\nשם המתרגל/ת: ג'לאל (מתרגל אחראי)\nחוות דעת - תרגולים: המתרגל האחראי הכי גרוע שנאלצתי ללמוד ממנו משיקולי לו\"ז, בנוסף היה לא אחראי או מודע לנלמד בקורס בהקשר של פירסום שיעורי הבית.\n\nשעורי הבית: שבועיים ולא רלוונטיים. חברים שלקחו את הקורס המליצו לי לא לעשות אותם ולעבור על התירגול במקום, ולצערי בחרתי לעשות את שיעורי הבית. מעט מאוד מהשאלות היו רלוונטיות להבנה של החומר או למבחן.\n\nהמבחן: הבדיקה אכזרית, והקורס לא מכין למבחן.\n\nהשורה התחתונה: תידחו את הקורס לסמסטר האחרון אם אתם לא לוקחים את השרשרת. אין דבר אחד בקורס הזה שמתנהל טוב, והאגו של הסגל כל כך גדול שלא סביר שזה ישתנה", "timestamp": 1645463903265}, {"author": "דוברת אמת", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: המרצה כנראה חושב שהשמש זורחת לו מהתחת אחרת אין הצדקה להתנהגות שלו.\n\nשם המתרגל/ת: נדב לנדאו\nחוות דעת - תרגולים:  הוא סבבה רק מדבר מהר מדי.\n\nשעורי הבית: זוועה\n\nהמבחן: עוד יותר זוועה\n\nהשורה התחתונה: קורס מזעזע, התנהלות סגל מזעזעת. כל קשר בין המבחן לשיעורי בית והחומר הוא מקרי לחלוטין. טרטרו אותנו כל הסמסטר ולא היו מוכנים לבוא לקראתנו, לא בהגשות, לא בהקלטות של הקורס, וגם לא במבחן.", "timestamp": 1646076488629}, {"author": "Daniel", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: יובל מרצה מצוין! הוא העביר את החומר בצורה מסודרת וברורה מאוד.\n\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים: התרגולים של דימה טובים מאוד, נותן הרבה אינטואיציה פיזיקלית לפתור את התרגילים לפני שצוללים לתוך החישובים, מומלץ. \n\nשעורי הבית: לא מאוד רלוונטים למבחן, חלק מרופרנסים.\n\nהמבחן: לדעתי המועדים הסמסטר היו הוגנים מאוד. הסגל בא לקראת הסטודנטים ואת אחת השאלות הפתוחות החליפו ב-5 אמריקאיות. אני חושב שזה צעד טוב מאוד ובהחלט מוריד עומס בזמן מבחן, במיוחד כשחלק מהאמריקאיות אפשר לפתור עם שיקולים פיזיקליים מהר יותר ולעקוף חישובים ארוכים ומייגעים. כמו שנכתב כאן לפני, הקורס יחסית חדש ויש לא מעט מועדים קשים אבל אני חושב שיש תהליך הפקת לקחים והקורס משתנה לטובה. \n\nהשורה התחתונה: לקח לי זמן להתחבר לקורס (בפרט כשאני לא לוקח את שרשרת מיקרו-ננו) אבל בסוף האסימונים נפלו והתחברתי. הקורס דורש השקעה ולא קל, ממליץ בחום לקחת את הקורס עם יובל.", "timestamp": 1667399974905}, {"author": "T_T", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: \nבהתחלה באתי פורנטלי אבל אז עברתי למוקלט. מאז שהוא התחיל עם גבישים איבדתי אותו לגמרי. \n\nשם המתרגל/ת: שלומי\nחוות דעת - תרגולים: \nגם ראיתי הקלטות. מתרגל טוב ומומלץ.\n\nהחלק של סטטרמית היה מעניין אבל פה החלק הטוב נגמר.\nקורס מאוד לא ברור. לא הבנתי בכלל את המטרה. כאילו לקחו מספר קורסים לא קשורים וערבבו אותם ביחד ככה שהפואנטה של כולם נאבדת.\nשיעורי הבית לא מובנים ובחלק מהגיליונות היו טעויות שתיקנו יום לפני ההגשה. בכללי שיעורי הבית לקחו כמות לא הגיונית של זמן, לרוב בגלל שהשאלות לא ברורות, לא פתירות, או סתם מטלב מסרב לשתף פעולה עם המשוואות הסתומות המסובכות שנאלצנו לפתור.\n\nסה\"כ קורס מיותר ומייגע שגרם להרבה כאב ראש. מאחל לדורות הבאים שהקורס לא יהיה חובה.", "timestamp": 1673206231063}, {"author": "סטודנט 0", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: ראיתי מוקלט, ההרצאות בסך הכל בסדר. לפעמים מרגיש כמו כל מיני נושאים לא קשורים. \n\nשם המתרגל/ת: שלומי\nחוות דעת - תרגולים: ראיתי את שלומי מוקלט כל הסמסטר, בגדול הוא מתרגל טוב אבל זה לא הכי מתאים למה שקורה בקורס. ממליץ מאוד ללכת לדימה או לפחות לעבור על המצגות שלו. \n\nשעורי הבית: סיוט, אוסף שאלות שלא מנוסחות טוב ולפעמים תרגיל מטלב שנועד להוציא ממך את החשק. \n\nהמבחן: סיוט עוד יותר גדול. לא מנוסח טוב, ארוך ומאוד קשה \n\nהשורה התחתונה: לא מומלץ בכלל אבל זה חובה", "timestamp": 1675183041731}, {"author": "דנה", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: אלכס שם הרבה דגש על אינטואיציה, מעביר את ההרצאה ללא פיתוחים מתמטיים ארוכים ועושה שימוש בהדגמות בסימולטורים שונים. כדאי לקחת את הקורס בחורף כאשר הוא המרצה האחראי. \n\nשם המתרגל/ת: דימה \nחוות דעת - תרגולים: מעביר את החומר מעולה, מסביר ברור ונותן דוגמאות מהמחקר שלו ומיישומים מהיום יום.  \n \nשעורי הבית: 10 גיליונות (הגשה כל שבוע- שבוע וחצי). 2 מהם כוללים matlab. רוב הגיליונות לא ארוכים מידי, ויש רפרנסים (לפעמים אפשר לסיים אותם בשעה).\n\nהמבחן: המבחן שינה את הפורמט שלו בסמסטר שבו אני לקחתי את הקורס. הוא כלל 6 שאלות אמריקאיות ו-2 פתוחות. לדעתי היה הוגן.\n\nהשורה התחתונה: הקורס מורכב מ-2 חלקים: פיסיקה סטטיסטית והחלק השני מצב מוצק. החיבור בין השניים לא עובד טוב ובפועל יוצא שלא ברור לאן הקורס חותר. בנוסף קרה לא פעם שסגל הקורס לא היה מסונכרן עם עצמו (בתרגולים ובשיעורי בית) וביחד כל המצב יוצר הרבה תסכול.\n בסך הכל כדאי לקחת את הקורס בפרופורציה- לעבוד כבר מההתחלה עם דף נוסחאות ומושגים ויהיה בסדר גמור.", "timestamp": 1675337820630}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  אלכס חייט\nחוות דעת - הרצאות: אני נהנתי , מאוד פחדתי מהקורס בגלל מה שרשמו לפני אבל המרצה נחמד ומנסה להשיג שיתוף פעולה של הסטודנטים בהרצאה.\nקצת קשה לקשר בין כל החומר שמועבר, לא ברור מה הכיוון של הקורס. \n\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים:  מתרגל מאוד טוב ונחמד, אבל התרגול שלו זה סוג של עוד הרצאה, חוזר על החומר התיאורטי בצורה מורחבת מדי במקום לגעת בכמה שיותר תרגילים.\n\nשעורי הבית: יבשים סבבה (הרוב מרופרנס) וטיפה רטובים במטלב 15% מגן סך הכל , המתרגל האחראי היה קצת לא ברור לגבי כמה מהשאלות שנתנו ושינה דברים ברגע האחרון אז ממליצה לעקוב ולשאול חברים.\n\nהמבחן: לומדים טוב ולא אמורה להיות בעיה.\n\nהשורה התחתונה: קורס מפוספס עם פוטנציאל.", "timestamp": 1679561329014}, {"author": "משה בוזנח", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: מרצה הכי גרוע בטכניון\n\nשם המתרגל/ת: באסל ודימה\nחוות דעת - תרגולים: התירגולים של דימה המוקלטים לא מובנים בכלל באסל מתרגל לא משהו בכלל ועוד היה מתרגל אחראי באותו הסמסטר ... ללכת לדימה פרונטלי \n\nשעורי הבית: בזבוז זמן \n\nהמבחן: הזזזוווי עניין של מזל \n\nהשורה התחתונה: חרא קורס. מרגיש מומצא . אחד המתרגלים פותר ומקבל תוצאה x והשני מקבל תוצאה y.\nאין ברירה כי במומלצת שלא ברור איך ...\nקורס הכי משעמם והזוי ומעפןןן שהיה לי בתואר", "timestamp": 1679769591316}, {"author": "רוי", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: לא טובות על אף שיעיש עושה רושם של בנאדם נחמד שמשתדל נורא לגרום לסטודנטים להבין אבל הביצוע על הפנים - זה לא עובד. ההרצאות מלאות בקפיצות לוגיות, מעברים מונפצים ובאופן כללי יש תחושה שכל הרצאה מכילה איזשהוא בלאגן אחד גדול, כאילו לקחו קצת מפה קצת משם ערבבו הכול ביחד ומנסים לייצר משהו כושל. \n\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים: דימה מתרגל מצוין ובחור ממש טוב, עם כמה שהקורס גרוע וההרצאות מזעזעות נחמד לי להגיע אליו לתרגולים כי הוא מצליח לעשות קצת סדר ולשים אצבע על מה חשוב ומה לא, הוא מבין את האופי הדפוק של הקורס.\nהמתרגל השני(באסל) גם בסדר אבל פחות טוב מדימה ופחות מבין שהקורס דפוק. \n\nשעורי הבית: מבחינת עומס - הם לא עמוסים בכלל באופן מפתיע, אפשר לסיים גיליון בשעה וחצי-שעתיים, הבעיה שלפעמים חלקם מונפצים אז צריך להיעזר ברפרנס.\n\nהמבחן: עוד לא היה, אבל הבוחן אמצע שהיה לנו היה *יחסית* הוגן עד כדי איזה שאלה או שניים אמריקאיות קצת מוזרות. \nבאופן כללי צריך להכין דף נוסחאות מאוד טוב לקורס הזה, להקשיב לדימה ולהבין על מה לשים דגש ועל מה לא, ואז סביר שאפשר להצליח ולהתקדם בחיים.\n\nהשורה התחתונה:\nחסרונות - אני מסיים סמסטר שישי וזה בפער הקורס הכי גרוע שעשיתי בפקולטה, הרבה זמן לא ראיתי רמת בלאגן והנפצות בקורס, סה\"כ סבל מנטלי לעבור אותו.\n\nיתרונות - יש מגן שמן, עם יובל יעיש אפשר להגיע עד ל50% מגן והוא נותן עוד נקודות אקסטרה על נוכחות בהרצאה ככה שאפשר לצבור פה מגן די פסיכי, אפשר גם להצליח יפה במבחן ולסיים עם ציון ממש טוב בקורס למרות האופי הדפוק שלו.\nבנוסף כמו שאמרתי למעלה - הקורס לא עמוס! (לפחות עם יובל יעיש).", "timestamp": 1688804210747}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: יובל מרצה טוב ודואג לסטודנטים שלו ומזהה אכפתיות כלפי כל סטודנט וסטודנט , לפעמים קצת קשה לעקוב וקל מאוד לאבד אותו , אבל הוא מסביר ממש טוב ושולט בחומר מאוד \n\nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: באסל מתרגל ממש טוב נותן אינטואציה פיזקלית טובה שעוזרת להבין ואז לא צריך לזכור דברים בעל פה , ויש לו שליטה טובה בחומר .\n\nשעורי הבית: לא עמוסים , קצת פחות רלוונטים .\n\nהמבחן: לא היה קשה במיוחד , דומה לסמסטרים שעברו ואף יותר מסודר וברור . רואים שהקורס עובר שיפור \n\nהשורה התחתונה: קורס שמצריך מעקב בסמסטר כדי להבין ולהצליח", "timestamp": 1689766148756}, {"author": "-", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: \nההרצאות בחלק של סטטיסטית חשובות, בחלק של מצב מוצק קצת מאבדים אותו וצריך לעבור על החומר הרבה פעמים באופן עצמאי. לדעתי כן חשובות כדי להבין את הקורס.\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים: \nהתרגולים ממש טובים, קצת מפוזרים אבל שווה ללכת כי הוא נותן הרבה סיטואציה למבחן.\nשעורי הבית: הזויים, בחלקם כוללים תרגילי מאטלאב מיותרים, וגם היבשים לא הכי סימפטיים.\nהמבחן: \nלמבחן יש מבנה דיי קבוע בסמסטרים האחרונים, חלק מהשאלות סבירות, וחלקן בלתי פתירות, תלוי מי כתב את השאלה.\nהשורה התחתונה: \nזה למעשה שני קורים, קורס אחד בפיסיקה סטטיסטית, החלק הזה יחסית מובן, ואפילו דיי מעניין. החלק השני של מצב מוצק הוא פשוט זוועה, אין שום קשר בין שני החלקים של הקורס בגדול, ואין ממש קשר גם בין מה שקורה בהרצאות התרגולים וש\"ב.", "timestamp": 1690463163547}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: בחלק של סטטיסטית ההרצאות יחסית ברורות ואפילו מעניינות.\nבחלק של מצב מוצק אי אפשר להבין שום דבר, ואין שום הקשר בין החלק הראשון של הקורס לשני.\n\nשם המתרגל/ת: דימה\nחוות דעת - תרגולים: התרגולים לא כ\"כ דומים להרצאות, אבל הם הרבה יותר קרובים למבחן עצמו לכן שווה ללכת. דימה מעביר את התרגולים באופן טוב עם דוגמאות מהתחום שלו.\n\nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: באסל נחמד מאוד, וכן יכול לעזור להבין את החומר כשנמצאים איתו אחד על אחד. התרגולים שלו לא היו טובים בלשון המעטה, הם חסרי פוקוס ועניין.\n\nשעורי הבית: הם חובה, לפעמים מכילים קוד מאטלאב מיותר לחלוטין שלא מקנה שום אינטואיציה, ובכללי כוללים סתם חישובים מגעילים.\n\nהמבחן: \nהמבחן היה סביר והבדיקה הייתה מקלה יחסית אז נראה שהסמסטר יצא בסדר סה\"כ. אם כי חלק גדול מהשאלות בבחינות עבר הן לא פתירות וחלק גדול מהפעמים הנתונים לא מספיק ברורים.\nהשורה התחתונה: אין ברירה כי זה חובה במסלול של חשמל. לכל השאר הייתי ממליץ להתרחק, הקורס מבולגן מבחינה רעיונית, והוא לא מקנה שום ידע שיעזור לכם אח\"כ. הוא גם יחסית עמוס לקורס של 3 נק\"ז כיוון שהחומר קשה תצטרכו לעבור עליו הרבה פעמים כדי שהחומר יכנס וזה במיוחד נכון לחלק של מצב מוצק בו כל לוגיקה עוזבת את הקורס ואתם רק תתהו כל ההרצאה על מה המרצה מדבר בכלל.", "timestamp": 1705431276617}, {"author": "RAZ", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: יובל יעיש -  איכפתי ממש, מבין החומר. הבעיה שהקורס מבולגן ממש, לא ברור מה הוא. מל\"מ, הסתברות, פיסיקה 3 (פיסיקה קוונטית להנדסה), מצב מוצק, תירמודנמיקה. ממש לא ברור, יש את הכל מהכל וזו בעיה כי לא מצליחים להבין דברים. \nשם המתרגל/ת: דימה (דימטרי)\nחוות דעת - תרגולים: מתרגל חזק, מסביר את החומר תוך הפנמה אישית, מאוד חשוב לו אינטויציה.\n\nשעורי הבית: יש, בזוגות, קצת עמוסים. יש אלו שאומרים שהם עוזרים בהבנת החומר לדעתי פחות.\n\nהמבחן: נפלתי על מבחן יחסית סבבה והצלחתי להוציא ציון סבבה. לדעתי מזלי שלקחתי את הקורס ויובל יעיש אחראי. יש אחוז טוב מהסטודנטים ששמו את זה כ \"עובר בינארי\".\nהיה אחוז מגן גבוה (30 על בוחן אאמצע, 20 ת\"ב וגם 5 בונוס על נוכחות בתרגולים ובהרצאות - לא חייב להיות אותם מנהלות כל סמסטר) לא קיבלתי את המגן של הבוחן אמצע אך הצלחתי להציא ציון  סבבה בסכ\"ה.\n\nהשורה התחתונה: אם חובה לקחת אז לקחת אם לא אז אין סיבה לזו. החומר מבוללגן - יותר מסתדר בלמידה למבחן.", "timestamp": 1712743551863}, {"author": "פורייה", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלכסנדר חייט\nחוות דעת - הרצאות: אל תלכו להרצאות\nממש הוא לא מסביר טוב , לא מוסר רעיונות ישר \nולעניין כמו כן החומר עצמו בלי תרגול בלתי ניתן להבנה דווקא בחלק השני של הקורס\nשם המתרגל/ת: באסל \nחוות דעת - תרגולים: פשוט מדהים \nמסביר את החומר מחלק את התרגולים לפי נושאים ופותר שאלות רלוונטיות שבדומה בווול אבל בוווול לשאלות מבחן\n\nשעורי הבית: יש כמה שלא כל כך פתירות ושלא צריך אותן למבחן והשאר כן מאוד עוזרות להבנה \n\nהמבחן:\nהיה כמה שאלות פה ושמה שקצת מטעות אבל בסכ\"ה סביר דווקא שיש שני סעיפי בונוס.\n\nהשורה התחתונה: מבחינת האם מעניין?\nלא \nהאם מומלץ?\nלא \nהאם אתה יוצא ממנו בציון ?\nתלוי", "timestamp": 1715195718079}, {"author": "דרודה", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות:  ההרצאות בחלק של סטטרמית טובות, בחלק של מצב מוצק ממש לא ברורות \n\nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: מתרגל טוב, מעביר את התרגול בצורה מסודרת, ויש לו קבצי PDF נורמליים שאפשר ללמוד מהם במקום  המצגות הלא ברורות\n\nשעורי הבית: 8 גיליונות יבשים, הרוב מרופרנס, לא כזה עוזרים להבנה אבל בסדר בסה\"כ, 20% מגן\n\nהמבחן: מועד א לדעתי היה קצת יותר קשה ממה שנהוג בסמסטרים האחרונים, היו כמה סעיפי בונוס כך שבסופו של דבר יצאתי עם ציון בסדר\n\nהשורה התחתונה: קורס לא ברור, נועד כדי להקנות ידע לכל הפיזיקה מאחורי מל\"מ אבל הוא לא עושה עבודה טובה עם זה, פשוט מעבירים אלף נושאים לא קשורים אחד לשני.  ראיתי סרטון של 30 דק ביוטיוב שהצליח להסביר את מה שניסו להסביר למשך סמסטר בקורס הזה. בתכלס אם לא חובה אז אל תעשו", "timestamp": 1715241065837}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: אלכס\nמרצה טוב, הרשימות הרצאה שלו יחסית ברורות ככה שאפשר להקשיב לו ולעבור עליהן אחר כך.\n\nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: \nהציל לי את הקורס!!\nבאסל מתרגל סבלני מאוד ששולט בחומר בצורה טובה.\nיש לו רשימות תרגול משל עצמו - מומלץ מאוד (!!) לעבור עליהן.\nרק דרכן הבנתי את החומר.\nבקיצור- מומלץ מאוד!!!\n\nשעורי הבית: \nסבבה משעממים\n\nהמבחן: \nמי שלומד כמו שצריך מצליח. \nמומלץ גם להתעמק בחומר ולא רק לפתור תרגילים, כי הם שואלים על דברים חדשים ממבחן למבחן ( קורס עבר שינוי אז אין הרבה מבחנים במתכונת החדשה)\n\nהשורה התחתונה: \nחייבים לקחת, אבל פחות נורא משציפיתי (הודות לבאסל)", "timestamp": 1716454580101}, {"author": "אלקטרון חופשי", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: \nלא תמיד הקשבתי לו. הרגיש לי שהרבה דברים שמעבירים בהרצאות הם רק רקע למה שיופיע במבחן, ובמבחן מופיע משהו דומה למה שיש בתרגולים (אפילו התרגולים עצמם יותר מדי מפורטים). ולצערי הוא לא הסכים לתת לנו גישה למוקלט שלו :/ \nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: \nתותח!! באסל מאוד בקיא בחומר וכל כך אכפת לו מהסטודנטים. הרגיש כאילו הוא היה גם מתרגל אחראי וגם מרצה אחראי. ללמוד טוב טוב את התרגולים שלו כדי לבוא מוכנים למבחן.\nשעורי הבית: \nפעם בשבוע, אם אין רפרנס זה יכול לקחת הרבהה זמן, לצערנו הסמסטר כתבו הרבה שאלות חדשות וזה לא היה כיף. \nהמבחן: \nהסמסטר היה יחסית יותר קשה, יש 10 נקודות בונוס למי שמספיק אבל בדרך כלל המבחן ארוך, לא בלתי אפשרי אבל כן צריך ללמוד טוב מאוד את התרגולים של באסל (הרצאות פחות)\nהשורה התחתונה: קורס מבולגן ולא מומלץ, לא הבנתי מה כל הקטע, מסבירים דברים שלמדנו במלמ, רלוונטי אולי רק למי שעושה שרשרת ננו, חוץ מזה, פשוט לא.", "timestamp": 1716628301557}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אלכס חייט\nחוות דעת - הרצאות: אני לא התחברתי, הוא בשעה הראשונה בדרך כלל חוזר על השיעור הקודם. אני הרגשתי שהוא לא ממש איתנו (לא ידע להגיד איזה חומר ירד בגלל הקיצור סמסטר, כמה תרגילי בית יהיו (זה גם לא היה מפורסם בסילבוס רק בשבוע האחרון של הסמסטר בערך המתרגל האחראי אמר כמה חובה להגשה בסוף) וכו)\n\nשם המתרגל/ת: שלומי/באסל\nחוות דעת - תרגולים: התחלתי במוקלט של שלומי אבל חלק מהחומר השתנה אז עברתי לבאסל (חלקית זום חלקית מוקלט מהסמסטר) הוא יודע את החומר אבל הרבה פעמים נותן מידע על דברים שלא בחומר או מתעכב על נושא יותר מידי ככה שהרבה פעמים בתרגול אחרי עוד השלים את התרגול הקודם.\n\nשעורי הבית: זוועה, לא נהנתי בכלל, והבודקת תרגילים לא נתנה הערות בונות רק על איזה סעיף היא הורידה את הניקוד בלי הסבר למה. \n\nהמבחן: היה ממש קשה, במיוחד השאלות האמריקאיות, הממוצע לא משקף כל כך בעיני (כי עם ההטבת מילואים יכולת להגיע ל+40 נקודות לציון הסופי)\nבאמריקאיות אני יודעת על הרבה שניחשו את התשובה בכמה שאלות... והמבחן היה עד 110 נקודות (היה 10 נקודות בונוס במקום הבוחן אמצע שלא היה)\n\nהשורה התחתונה: אם אתם לא חייבים לקחת תתרחקו", "timestamp": 1716820227650}]}