{"posts": [{"author": "כללי", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nמעט מאוד חומר אך אם זאת מועבר בצורה מבולגנת\nשם המתרגל/ת: מרסל\nחוות דעת - תרגולים: \n-\nשעורי הבית: \n-\nהמבחן: \n-\nהשורה התחתונה:", "timestamp": 1614836092712}, {"author": "אבי", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שרי שינוולד\nחוות דעת - הרצאות: חומר יחסית לא קשה ושרי מעבירה בצורה טובה וברורה.\n\nשם המתרגל/ת:  מרסל חליפה\nחוות דעת - תרגולים: מרסל מאוד משקיעה, לא מספיקים לעבור בתרגולים על כל התרגילים, מומלץ לנסות לקרוא ולהבין פתרונות מהקבצי תרגול.\n\nשעורי הבית: הגשה בזוגות כל שבועיים, לוקח שעות בודדות. \n\nהמבחן: חומר פתוח, מבנה הבחינה חוזר על עצמו, שאלות לא תמיד ברורות\n\nהשורה התחתונה: קורס קליל יחסית לקורסים בשנה ב', ממליץ ביותר", "timestamp": 1626983088183}, {"author": "גבי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה ממש טובה, מעבירה את החומר בצורה מסודרת וברורה. מהמרצים היחידים בטכניון שבאמת הרגשתי שרוצה בטובת הסטודנטים.\n\nשם המתרגל/ת:  מג'ד\nחוות דעת - תרגולים: לא היה כל כך בעניין, התרגולים היו די יבשים וכמעט אחד לאחד מה שכתוב בדפים.\nכן חשוב להבין כל מה שכתוב בדפים של התרגול, לא בטוח שנוכחות בתרגול זה הכרחי בשביל זה.\n\nשעורי הבית: לא מאוד עמוסים, יחסית הוגנים. רמה נמוכה יותר מהמבחן\n\nהמבחן: \nקשוח יותר ממה שנוגעים בו לאורך הסמסטר, אז מומלץ להתחיל מבחנים כמה שיותר מוקדם\nהשורה התחתונה:", "timestamp": 1644928712116}, {"author": "אוהב את תחשיב הפסוקים", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מדהימה, מעבירה את החומר בצורה מאוד מקצועית וברורה. \n\nשם המתרגל/ת: מאג'ד\nחוות דעת - תרגולים: לא הלכתי ונוכחות לא קריטית (לדעתי) במהלך הסמסטר - אפשר לעבור עליהם תוך כדי הלמידה למבחן.\n\nשעורי הבית:  לא רלוונטיים למבחן כל כך, מרופרנסים ברובם מסמסטרים קודמים אולי מלבד שאלה או 2.\n\nהמבחן: המבחנים בסמסטרים האחרונים התחילו להיות יותר קצת יותר תיאורטיים ופחות טכניים, חשוב להבין טוב את ההרצאות ולהתחיל לפתור מבחנים (בעיקר של הסמסטרים האחרונים) מוקדם ולהבין אותם.\n\nהשורה התחתונה: קורס לא עמוס במהלך הסמסטר ואפשר להצליח בו.", "timestamp": 1644967172115}, {"author": "דיסק", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: המרצה הכי טובה שיצא לי לעבור קורס אצלה עד כה בטכניון , מסבירה את החומר בצורה קפדנית ומוודאה שכולם הבינו, האוירה בכיתה נעימה, שרי עונה על שאלות סטודנטים בבירור ובשמחה.\n\nשם המתרגל/ת: מאג'ד\nחוות דעת - תרגולים: לא ברור ולא קל להבין אותו. לרוב מאחר לתרגולים ומושך לפחות 10 דקות לאחר סיום הזמן.\n\nשעורי הבית: קושי ברמה בינונית, המגן ממש זניח. יש רפרנס לרוב.\n\nהמבחן: למרות התלונות עליו, בעיניי היה הוגן וכלל את רוב הנושאים. ממליץ להתכונן הרבה זמן מראש מכיוון שלרוב אין דפוס חוזר של שאלות.\n\nהשורה התחתונה: ממליץ להתעקש על שאלות לא מובנות, להגיע לשעות הקבלה ולסגור את החורים כבר במהלך הסמסטר. כמו כן להתכונן למבחן יותר ממבחן רגיל.", "timestamp": 1646692230965}, {"author": "1", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: לדעתי היא אחת המרצות הטובות ביותר שיש מבחינת להעביר את החומר וזרימה של השיעור.\n\nשם המתרגל/ת: מאג'ד.\nחוות דעת - תרגולים: לצערי לא הצלחתי להבין כלום מהתרגולים שלו ממש, עדיף לקרוא את הדפים לבד, ככה גם לחסוך זמן וגם לרוב לקלוט יותר חומר.\n\nשעורי הבית: מוגזמים, לא ברמה של תרגול ושל הרצאה.\n\nהמבחן: קשה מאוד אבל עם קצת תרגול אפשר לעבור.\n\nהשורה התחתונה: לדעתי הקורס הוא מאוד נחמד מבחינת הרצאות אך מאחר ואין ממש תרגולים שיכולים להכין אותך לרמה של הש.ב וגם של המבחנים אז הקורס הזה הוא פשוט לא טוב.", "timestamp": 1647613167700}, {"author": "קטלן הראשון", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שרי \nמרצה מדהימה מסבירה ממש טוב ויש לה אחלה חוש הומור. אם יש לכן זמן תלכו אליה פיזית.\n\nשם המתרגל/ת: מרסל (הקלטות)\nחוות דעת - תרגולים: \nמאוד עוזרים להבין את החומר אבל כמו בכול קורס מתמטי התרגילים או קלים מדיי או קשים מדיי. בכול מקרה התרגולים לא משתנים לכן ההקלטות מספיקות.\n\nשעורי הבית: \n5 גיליונות של 2% מגן כול אחד. כול גיליון כ7 שאלות ארוכות מאוד (ל6 מתוכן בדרך כלל יש רפרנס) סדר גודל של 6 שעות לגיליון אם נעזרים ברפרנס. מאוד מאוד ארוך אבל מצד שני חלק מהשאלות הן שאלות ממבחנים אז כדאי מאוד לעשות אותם בשביל להתרגל טיפה לרמה.\n\nהמבחן:  מבחן סטנדרטי של הפקולטה לחשמל, רחוק שנות אור מהרמה של ההרצאות והתרגולים. לפחות שאלה אחת בקונספט חדש ושונה לגמריי מכול מה שהיה במבחנים קודמים ויש לחץ של זמן. שווה לתרגל כמה שיותר מבחנים אבל זה לא מבטיח הצלחה לצערנו.\n\nהשורה התחתונה: \nאם אתם לוקחים את הקורס כי אתם במחשבים תוכנה ואין לכם ברירה תשתדלו להיות על החומר במהלך הסמסטר. כדיי להוציא כאן ציון טוב צריך הבנה מאוד מאוד טובה של הבסיס התאורטי (הייתי אומר אפילו ברמה של קורסיי אינפי) אבל בשביל ציון סביר לעשות ש\"ב ולתרגל מבחנים יספיק לכם.", "timestamp": 1676459993073}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מהמרצות הטובות שנתקלתי בהן. חשוב לה שהסטודנטים יבינו, מסבירה הכל ברור ולאט וחוזרת עם הרבה דוגמאות על מה שלא ברור.\n\nשם המתרגל/ת: מרסל (מוקלט)\nחוות דעת - תרגולים: מעבירה את החומר בצורה מעולה ומסבירה טוב\n\nשעורי הבית: בזוגות, דיי פתירים וחוזרים על עצמם משנים קודמות\n\nהמבחן: שלנו היה מזעזע, אבל פקטרו בהתאם. \n\nהשורה התחתונה: סהכ החומר טריקי אבל מעניין", "timestamp": 1677745027181}]}