{"posts": [{"author": "Guy Yoffe", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: \nמרצה נחמד. מעט איטי ויכול לעיתים לשעמם, אבל סה\"כ מעביר את החומר בצורה ברורה.\n\nשעורי הבית: קשים מאוד. גיליונות ארוכים ולא קלים בכלל.\n\nהמבחן: סביר.\n\nהשורה התחתונה: קורס קשה. החלק הראשון לא כל כך מעניין, החלק השני יותר מעניין.", "timestamp": 1597781873462}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: הרצאות משעממות, אפשר ללמוד מסיכומים, גם ככה לא יותר מדי מעמיקים בתאוריות והוכחות.\n\nשם המתרגל/ת: גל מנדלסון\nחוות דעת - תרגולים: מתרגל פשוט תותח, מקצועי ברמה מטורפת, יודע להעביר את כל החומר בתרגול ברמה מאוד מקצועית, מאוד מקיפה ומאוד בגובה עיני הסטודנטים. יודע להעמיק בדיוק בנושאים ובתרגילים בהם סטודנטים נופלים וצריכים חיזוקים.\n\nשעורי הבית: ארוכים מאוד, קשים מאוד, מייגעים. השיעורי בית ברמה של אינפי1מ- מלא הוכח/הפרך, מלא חישובים מייגעים, המון עבודה ולא כולם ממוחזרים. רצוי להתחיל אותם מיד כשהם יוצאים ורצוי להשוות עם אנשים.\n\nהמבחן: סביר, אותה רמה בערך כל סמסטר, לתרגל פשוט כמה שיותר מבחנים כדי להבין את המבנה הכללי של המבחן. המבחן בחלקו המרכזי טכני ומתמטי ולכן כדאי לתרגל כדי לא ליפול בחישובים, וכדי לא לבזבז זמן על חישובים, כי הזמן מאוד קריטי במבחן.\n\nהשורה התחתונה: קורס נחמד ולא מעבר לזה.", "timestamp": 1597829740483}, {"author": "A", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: ההרצאות ברמה נמוכה,המבחנים לא.\n\nשם המתרגל/ת: אב\nחוות דעת - תרגולים: מסבירה סבבה\n\nשעורי הבית: עמוסים מאוד ומהווים רק 10 (תקף כמובן)\n\nהמבחן: באמת לפי מצב רוחו של המרצה האחראי באותו הרגע\n\nהשורה התחתונה: אולי בסמסטר לא קורונה המצב שונה,אבל החומר הועבר ברמה נמוכה והמבחן היה ברמה גבוהה והממוצע נמוך מאוד לעומת סמסטרים אחרים אשר לא הסכימו לפקטר", "timestamp": 1597834295011}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "80% מהקורס הוא התעללות בהסתברות ורק ה 20% האחרונים מדברים על אותות. החומר עצמו לא קשה, אבל השאלות קשות עם המון התעללויות מתמטיות וטריקים שצריך לשנן. תרגילי הבית קשים ולוקחים לא מעט זמן (הם בזוגות, לרוב השאלות יש רפרנס). לא לקחת אותו אם הוא לא חובה או לא קדם למשהו שאתם צריכים. כלומר לא לקחת אותו \"סתם\", הוא לא \"קורס כיף\".\n\n*יש סדנאות בקורס, מומלץ ללכת", "timestamp": 1598106869810}, {"author": "גיל", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "קורס מאוד עמוס עם המון מתמטיקה.\nמרגיש בעיקר כמו המשך של הסתברות.\nהמילה \"אות\" לא מופיעה עד שבוע 12 בקורס.\nאם לא חייבים, עדיף להמנע", "timestamp": 1600443560279}, {"author": "שם", "difficultyRank": 4, "generalRank": 4, "semester": "201802", "text": "שם המרצה: נרי מרחב\nחוות דעת - הרצאות: יש לו כריזמה מוזרה כזו, כן נהנתי מההרצאות ברובן, אבל לא יכולה להגיד שהן עזרו לי להבין את החומר במלואו (לפני הקורונה)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים מאוד מועילים, הייתי בכמה, ויש סדנאות מועילות גם\n\nשעורי הבית: מעייפים ומאוד עמוסים, עוזרים להבין מה רוצים ממך בקורס\n\nהמבחן: יש מבנה מאוד קבוע, אצלנו היו בעיות במיזוג שהקשו על הריכוז, עוד לפני שהספקנו להתלונן נתנו תוספת זמן ולפני שהמבחן נגמר המרצה האחראי שלח מייל התיחסות, הם כן אוהבים למצוא איך להכשיל, דורש למידה מאוד רצינית כדי להצליח באמת (לקבל 85+) אבל אפשר להוציא 60 במאמץ סביר\n\nהשורה התחתונה: קורס מתמטי, מאוד מזכיר סטטיסטיקה רק מכיוון של ניתוח אותות, אם עושים אחרי סטטיסטיקה יותר קל, ביעני הוא נתן לי כלים שהשתמשתי בהם גם אחריו ולכן הוא קורס שחשוב לעשות, הוא לא קורס כיפי או מעלה ממוצע", "timestamp": 1600857767534}, {"author": "A", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: תומר כרמלי\nחוות דעת - הרצאות: הרצאות ברמה מאוד נמוכה, יוצאים מההרצאה בתחושה שהכל ברור והבנת הכל ,רוצה להדגיש שזה לא,ממליצה את תרגילי הבית לנסות לעשות לבד אם לא מצליחים אז שעות קבלה, התרגולים וההרצאות הם לא מה שיכינו אתכם לבמבחן\n\nשם המתרגל/ת: אב \nחוות דעת - תרגולים: תרגולים וסדנאות ברמה נמוכה,מעבירה אותם סבבה אבל אין הסבר מעבר ואין דוגמאות מסובכות מידי\n\nשעורי הבית: שיעורי בית קשים וארוכים ,יש מספר שאלות יבשות כל שאלה ט סעיפים ובנוסף בין שאלה ל2 רטובות (מטלב) כל שאלה גם כן ט סעיפים, הם רק 10 אחוז אבל תקף אז באסה..\n\nהמבחן: במהלך הקורס ההרצאות והתרגולים ברמה יחסית נמוכה אבל שיעורי הבית ברמה מאוד גבוהה, אתה מגיע למבחן ומבין שרמת שיעורי הבית זו הרמה של המבחן\n\nהשורה התחתונה: אם הוא לא חובה לכם ממליצה לא לקחת, הסגל הוא לא פחות מבזיון והיחס כלפי הסטודנטים מזלזל מאוד\nוללא כל קשר גם משעמם", "timestamp": 1602510032327}, {"author": "nadav david", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עומר בוברובסקי\nחוות דעת - הרצאות: \nהרצאות מצוינות, עומר מסביר את החומר בצורה אינטואיטיבית ומשתף אנשים בדיון.\n\nשעורי הבית: \nפעם בשבועיים, מאוד עמוסים אבל מלמדים.\n\nהשורה התחתונה: קורס מתמטי ועמוס אבל מעניין ונשמע שחשוב בשביל הבסיס.", "timestamp": 1612365789595}, {"author": "Daniel", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: מרצה מצוין. הציג דוגמאות בmatlab מדי פעם שתרמו להבנת החומר.\n\nשם המתרגל/ת: אב\nחוות דעת - תרגולים: התרגולים בסדר, אפשר אולי להסתפק בקריאה של ה-PDF.  כן חשוב להגיע לסדנאות כי השאלות ברמה שיותר מתאימה למבחן מאשר אלו שבתרגול. \n\nשעורי הבית: עמוסים וקשים. צריך להשקיע זמן כדי לפתור אותם כמו שצריך. להבין שמדובר בתרגילים ברמת מבחן. (חלקם נלקחו ממש ממבחנים)\n\nהמבחן: לא פשוט... יש מועדים סבירים ויש אסונות טבע. שאלה שלמה מתבססת על חומר שנלמד בשבוע וחצי לפני סוף הסמסטר.  \n\nהשורה התחתונה: קורס לא פשוט ועמוס. חבל שמתעסקים באותות וסינון רק בשבוע 12 של הקורס. אין מספיק תרגול בזה לדעתי ביחס לרמה הנדרשת במבחנים.", "timestamp": 1613686668581}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עומר בוברובסקי\nחוות דעת - הרצאות: מאוד מעניינות, ברורות, מאוזנות בדיוק ברמה המתאימה בין ה\"ת'כלס\" לבין הדקדקנות, לא חופרים עמוק מדי במתמטיקה.\n\nשם המתרגל/ת: אב\nחוות דעת - תרגולים: מתרגלת אחלה, כבר מנוסה מאוד בקורס, אין משהו חריג לומר על התרגולים.\n\nשעורי הבית: יכול להיות שכבר ציפיתי לנורא מכל על סמך חוות דעת מהעבר, אבל לא התרשמתי שהעומס חריג עד כדי כך. בסך הכל אם מתחלקים עם השותף צריך לעשות משהו כמו 8-9 שאלות, רובן שאלות ברמת מבחן ועוד מעט שאלות של מטלאב (שאם שולטים במטלאב הן לא יותר מדי נוראיות) ובסך הכל הן כן עוזרות ללמוד את החומר ולהפנים אותו, וזה לא לוקח עד כדי כך הרבה זמן.\n\nהמבחן: סביר לדעתי, אבל אני מחשיב את עצמי כאחד שאוהב הסתברות אז כנראה שבצורה אובייקטיבית זה קורס שמהחבנים בו קשים.\n\nהשורה התחתונה: מי שאהב הסתברות לדעתי מאוד יהנה מהקורס הזה (במיוחד מהפרק של תהליכים אקראיים ושרשראות מרקוב שבעיניי היה פשוט כיף. שאר חלקי הקורסים לפעמים קצת מציקים אבל לכל הפחות החלק השלישי של סינון תהליכים בזמן רציף מאוד חשוב למי שירצה לאחר מכן לעסוק בתקשורת ועיבוד אותות אקראיים.\nאני מאוד אהבתי את הקורס", "timestamp": 1614932824319}, {"author": "אני", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: מובנות אבל החומר משעמם.\n\nשם המתרגל/ת: אב\nחוות דעת - תרגולים: תרגולים מועברים בצורה טובה אבל השאלות ברמה נמוכה כך שאפשר פשוט לקרוא מהpdf. שיעורי הבית והמבחנים ברמה הרבה יותר גבוהה.\n\nהסדנאות כן ברמה יותר גבוהה ולכן מומלץ להגיע אליהן.\n\nשעורי הבית: בזוגות, עמוסים יותר משהם אמורים להיות בהתחשב בזה שהם רק 10 אחוז תקף. \n\nהמבחן:  סביר.\n\nהשורה התחתונה: קורס שלא מאורגן טוב. \nיש בחנים במודל שחובה לגשת אליהם (כדי לגשת למבחן) ומבזבזים זמן, אבל לא נכנסים לציון בקורס והחומר שם ברמה הרבה יותר גבוהה משנדרשים בקורס. \nבנוסף, המבחן בנוי בצורה של 3 שאלות וכל אחת על נושא כך שהרבה מאוד זמן מוקדש לתחילת החומר ולשאלה האחרונה של המבחן משהו כמו שבועיים כך שאין מספיק תרגול בנושא.", "timestamp": 1615744437809}, {"author": "yiftach edelstein", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עומר בוברובסקי ויוסף שטיינברג\nחוות דעת - הרצאות: מעניין מאוד, הקורס הכי מעניין שעשיתי הסמסטר, הלכתי ליוסף ברוב ההרצאות והיה מרתק, מרצה מצויין שעצוב לי שלא באו יותר לחוות את זה.\n\nשם המתרגל/ת: אב זיסלמן\nחוות דעת - תרגולים: מוקלדים מצויין, התרגול מועבר בצורה מאוד טובה, חסר מעט זמן ויש הרבה חומר להעביר אז מאוד חבל שאין עוד שעה בלו״ז להעביר את התרגולים. הסדנאות בנוסף מאוד עוזרות ומאוד טובות לקראת המבחן \n\nשעורי הבית: מעניינים, עמוסים יחסית, בעיקר יחסית לכמות הנק״ז של הקורס אבל חשובים מאוד להבנה של החומר, לא לוותר או לרפרנס אם אפשר\n\nהמבחן: אקראיים בצורה מסויימת הוא מקצוע הסתברות 2, ולכן אם הייתם חזקים בהסתברות, יהיה לכם בסדר באקראיים, אבל המבחן לא פשוט ודורש הרבה תרגול והבנה לא בסיסית בחומר כדי לעכל את כל הנושאים המועברים\n\nהשורה התחתונה: מאוד מומלץ, משרה בסיס מאוד טוב בתחום, מאוד נהנתי מהקורס, האהוב עלי הסמסטר", "timestamp": 1615795023226}, {"author": "Peretz Porath", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: ד\"ר עומר בוברובסקי\nחוות דעת - הרצאות: ההרצאות של עומר היו בסה\"כ סבירות. בגלל שהייתה נוכחת יחסית דלה בהרצאות זום שלו הוא החליט לכתוב מבחנים מכשילים עם שאלות מקורסים מתקדמים ולהכשיל רבע מהסטודנטים בקורס, כאשר ממוצע של שני המבחנים היה באיזור 65 אחרי פקטורים של כמה נקודות.\n\nשם המתרגל/ת: אב זיסלמן\nחוות דעת - תרגולים: הייתה פשוט נוראית במהלך הסמסטר. לא ספרה את הסטודנטים ממטר ולא הסתירה את זה.\n\nשעורי הבית: \n\nהמבחן: מועד א' ומועד ב' היו מחרידים בצורה קיצונית.\nהבדיקה של המבחנים במועד ב' הייתה פשוט הזויה ונתנו לאנשים 0 על סעיפים של 7-8 נקודות בגלל טעויות חישוב פשוטות או כי התבלבלו בביטוי הסופי, בדברים קטנוניים בצורה קיצונית.\nמיותר לציין ששליש מהסטודנטים שניגשו למועד ב' נכשלו. \n\nהשורה התחתונה: תברחו !!!!\nלא לקחת את הקורס הזה אם עומר בוברובסקי הוא המרצה האחראי גם בעד שלום!", "timestamp": 1615817392757}, {"author": "Roy Mahlab", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: עומר ברובסקי\nלדעתי היה מרצה טוב הסביר ברור ובקצב טוב. הוא גם שילב דוגמאות יפות של מימוש הרעיונות של הקורס במטלב ובטלפון.\n\nשם המתרגל/ת:  אב זיסלמן\nהייתה מתרגלת טובה, אבל בשידור חי אני לא חושב שהייתי הולך אליה. לדעתי הקצב שם היה קצת איטי, ובגלל זה טוב שהיה ניתן לכנוון מהירות צפייה.\nחוות דעת - תרגולים: \nלתרגולים נוספו כמובן סדנאות שבאופן כללי היו ברמה נמוכה יותר מהשיעורי בית. \nכן תורם להבנה אבל לא יותר מדי.\nשעורי הבית: \nשאלות ממבחנים אז לא פשוטים. מצריכים לא מעט זמן.\nהמבחן: \nלדעתי היה הוגן מאוד, בשני המועדים, אבל ההמוצע לא היה יפה\nהשורה התחתונה: הסתברות 2 ברמה גבוהה.", "timestamp": 1616576663677}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: אחד המרצים הטובים והמובנים שהיו לי בתואר עד כה. מומלץ מאוד, לדעתי.\n\nשם המתרגל/ת: אב זיסלמן\nחוות דעת - תרגולים: מסבירה ממש טוב ומפרטת, על אף שהיה לי קצת קשה להתרגל לקצב האיטי שלה.\n\nשעורי הבית: די קשים ולוקחים לא מעט זמן. מהווים רק 10% (תקפים) מהציון הסופי.\n\nהמבחן: ארוך ולא פשוט.\n\nהשורה התחתונה: ההתרשמות שלי היא שהקורס מועבר טוב, על אף שהתרגילים בקורס - המופיעים בשיעורי הבית ובמבחן הסופי - לא קלים.", "timestamp": 1628163681575}, {"author": "oriz95", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: מדהים, המרצה הכי טוב שהיה לי בתואר עד עכשיו\n\nשם המתרגל/ת: אב זיסלמן\nחוות דעת - תרגולים: הכי סבירה מבין כולם אבל משעממת, לא עושה כלום חוץ מלהקריא מהדף, אפשר פשוט לקרוא לבד\n\nשעורי הבית: ארוכים. תרגילי מאטלב מייגעים שלא תורמים כלום\n\nהמבחן: קשה מאוד. צריך לשלוט בכל מיני טריקים של הסתברות שכבר הספקתם לשכוח (כמעט שליש מהמבחן זה רק הסתברות), ומלא פיתוחים מתמטיים שלדעתי לא סביר לפתח בזמן מבחן.\n\nהשורה התחתונה: הקורס מעניין, אני ממליץ. במהלך הסמסטר הוא יחסית קליל - עד אמצע הסמסטר יש תחושה שלא לומדים כמעט כלום (חוזרים על הסתברות, ולומדים על שערוך - שזה בגדול הסתברות מותנית), אבל המבחן מאוד קשה - לא קורס מעלה ממוצע.", "timestamp": 1630617479693}, {"author": "ג.ג", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פרופ' תומר מיכאלי\nחוות דעת - הרצאות: \nהרצאות מסודרות וברורות עם הרבה דוגמאות פרקטיות. \nאחד המרצים שהכי נהניתי ללמוד אצלו. \nמומלץ ללמוד אצלו. \n\nשם המתרגל/ת: חן זנו\nחוות דעת - תרגולים: \nמתקתק את החומר ונותן טיפים לפתרון התרגילים \n\nשעורי הבית: \nמרופנרסים..\n\nהמבחן: \nכמו בשאר המקצועות, הרבה תרגול מבחנים, לא מבחן קשה במיוחד אבל בדיקה מאוד נוקשה. \n\nהשורה התחתונה: קורס מרתק כשמועבר כמו שצריך", "timestamp": 1633590772522}, {"author": "Matan Millionshik", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: מרצה מצויין, מעביר בצורה מובנת ונחמד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  לא היו מתרגלים טובים בקורס בכלל\n\nשעורי הבית: מעייפים\n\nהמבחן: קשה וארוך\n\nהשורה התחתונה: קורס חובה אבל לא קורס נחמד", "timestamp": 1635319672626}, {"author": "ס", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות:  מרצה נפלא ומסביר מצוין\n\nשם המתרגל/ת: אב\nחוות דעת - תרגולים: היא סבבה\n\nשעורי הבית: לא כיפיים בכלל, קשים מאוד ועליית מדרגה ביחס לתרגולים\n\nהמבחן: כנ\"ל על השיעורי בית, המבחן לא קל בכלל ותתכוננו להרבה הסתברות.\n\nהשורה התחתונה: קורס חובה , לא מהנוראים שעשיתי בתואר. \nאותי אישית החומר בהרצאות עניין.", "timestamp": 1645605407467}, {"author": "חח", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מייגעים\n\nהמבחן: גועל נפש , קשה ארוך וכל שאלה יותר קשה מהשנייה\n\nהשורה התחתונה: קורס חובה , אין מה לעשות .", "timestamp": 1646262196073}, {"author": "~", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים:  מאוד מסודר ומסביר עם הרבה סבלנות\n\nשעורי הבית: נוראיים, ארוכים מאוד ודורשים חישובים ארוכים מאוד, מומלץ לעבוד צמוד לרפרנס\n\nהמבחן: קשה מאוד, המון טריקים שצריך להכיר \n\nהשורה התחתונה: הקורס הכי נורא שעשיתי בתואר מבחינת עניין, קורס חובה....", "timestamp": 1646553556905}, {"author": "אקראיים", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס הכי רומנטי שיש בפקולטה לחשמל!!!!,אולי שמעתם סיפורים לא טובים, אבל אם תתנו לזה צ’אנס תוכלו בטוח להנות מהקורס הזה ולמצוא בו גם חלקים מעניינים", "timestamp": 1650128889776}, {"author": "Arnold Cheskis", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: PDF\nחוות דעת - הרצאות: מפורטים וטובים\n\nשם המתרגל/ת: PDF\nחוות דעת - תרגולים: מפורטים וטובים\n\nשעורי הבית: רמה גבוהה יותר מהמבחן, מגישים בזוגות. לפתור שאלות ממבחנים לדעתי יותר חשוב (לא היה משהו דומה למבחן, זה עוזר בעיקר להבנה)\n\nהמבחן: לא קל, ראיתי שבסמסטרים קודמים היו הרבה יותר קלים אבל גם הרבה יותר קשים. אצלי היה המון המון חישובים (אינטגרלים וכולה...) שביקשו לפתור עד הסוף. לדעתי הקושי הכי גדול היה להחליט להביא דוגמאות נגדיות או להחליט אם צפיפות הספק ספקטרלית קיימת או לא וכולה...\n\nהשורה התחתונה: קורס כיפי :)", "timestamp": 1658946280113}, {"author": "GAUSS", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: מרצה מדהים, מסביר ברור ומעניין ומוכיח כל משפט, משתדל לתת גם אינטואיציה. הוא העלה למודל גם הקלטות שלו מסמסטר קודם ואת הטקסט של ההקלטות.\n\nשם המתרגל/ת: אב זיסלמן\nחוות דעת - תרגולים: מתרגלת מעולה, קצת איטית. נותנת אינטואיציה ועוברת על טריקים שרלוונטיים למבחנים, אבל לא תמיד מספיקה את כל התרגול. הסדנאות ממש מומלצות וחשובות, שם פותרים שאלות קשות יותר מבתרגולים.\n\nשעורי הבית: 5 גיליונות, חובה להגיש 4. הגיליונות ארוכים ומלאים חישובים (חלק מהשאלות ממבחנים) ושאלה אחת במטלב בכל גיליון.\n\nהמבחן: קשה, במועד ב' היו 17 נקודות פקטור. צריך לעבור טוב על ההרצאות והתרגולים ולתרגל הרבה מבחנים כי יש טריקים שצריך להכיר.\n\nהשורה התחתונה: קורס מאוד מעניין אבל לא פשוט", "timestamp": 1665006853927}, {"author": "SF", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: מרצה נהדר, מאוד אינטואיטיבי ושם דגש על הבנת החומר ומטרותיו\n\nשם המתרגל/ת: PDF\nחוות דעת - תרגולים: כתובים טוב, מסבירים את החומר ונותנים תרגילים בנושא.\n\nשעורי הבית: 4 גליונות מתוך 5, ארוכים אבל מתרגלים את החומר\n\nהמבחן: קשוח, מבחן עם דרישה להבנה רחבה של החומר ובו זמנית פתירת טריקים של הסתברויות.\n\nהשורה התחתונה: הסתברות 2ח', מה שחשבתם על הסתברות תקף גם כאן.", "timestamp": 1676625139254}, {"author": "סטונדט 0", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: תומר\nחוות דעת - הרצאות: החומר עצמו מאוד משעמם אבל תומר מסביר ברור ועונה לשאלות\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: מתרגל טוב מסביר ברור אבל מרגיש שהתרגולים לא מתואמים לרמה של הקורס.\n\nשעורי הבית: מאוד קשים וארוכים, הפתרונות שמפרסמים לוקים בהסברים אז קשה ללמוד מהם.\n\nהמבחן: קשה מאוד.\n\nהשורה התחתונה: שוב, קורס קשה, מאוד מתמטי ומי שלא אוהב הסתברות יסבול.", "timestamp": 1677150306369}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: תומר מוקלט\nחוות דעת - הרצאות: מאוד איטי בפרונטלי. מוקלט על X2 ואז הוא ממש אחלה. \n\nשם המתרגל/ת: חן זנו מוקלט\nחוות דעת - תרגולים: אחלה\n\nשעורי הבית: נורא ואיום. ארוך, קשה, ולא הכל מרופרנס. לא תורם יותר מדי להצלחה במבחן\n\nהמבחן: נורא ואיום. תומר סופר יצירתי, והמבחן קשה מאוד.\n\nהשורה התחתונה: קורס מאוד מתמטי, לא רואים את הצד ההנדסי כמעט בכלל. חובה...", "timestamp": 1678041606130}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: תומר\nחוות דעת - הרצאות:  ההרצאות דיי משמימות, בסוף תומר כן מעביר את החומר טוב, אבל צריך לראות כמה פעמים כל הרצאה כדי שהחומר יכנס\n\nשם המתרגל/ת:  חן זנו\nחוות דעת - תרגולים: \nעדיף לעבור עליהם לבד וזהו, מתרגל שבא לסמן וי על זה שהוא מעביר את התרגול\nשעורי הבית: \nעמוסים בקטע פסיכי, כמעט כל השאלות ממבחנים כשהורס לא קרוב ללהיות ברמה הזאת. בנוסף בחלקם יש מאטלאב ארוך שלא תורם כלום חוץ מצלקות נפשיות\nהמבחן: \nעד כה המבחן הכי רע בתואר, תומר ורמי ממש מנסים לצאת מגדרם לעשות את המבחן למבחן בלתי אפשרי, במיוחד בשאלה השנייה של שרשראות מרקוב. גם אם עברתם על כל המבחנים משנת 2000 כנראה שלא תהיו מוכנים אליו.\nהשורה התחתונה: \nלמי שזה לא חובה, להתרחק! לפחות עד שיתחלף המרצה האחראי כי נראה שהדבר היחיד שאכפת לו ממנו זה להכשיל.", "timestamp": 1678089283263}, {"author": "רוי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות:  מרצה מצוין, מסביר את החומר בצורה ברורה ומשתדל לתת אינטואיציה לכל מעבר או תופעה בקורס.\n\nשם המתרגל/ת: עידו כהן\nחוות דעת - תרגולים:  מתרגל מעולה, חשוב לו מאוד שסטודנטים יהיו איתו ושרוב הכיתה תבין מה הולך כי הוא שונא לדבר לעצמו. חשוב לציין שהוא פרונטלי 100% ואין מוקלטים שלו אז זה קצת מבאס, בנוסף שאר המתרגלים לא משהו בכלל לדעתי אבל יש מוקלטים שלהם בשפע.\n\nשעורי הבית: 5 גיליונות יבשים שכוללים לפעמים שאלה או שניים במאטלב, הציון על סמך 4 הכי טובים מתוך ה5, 10% מהציון תקף.\nהגיליונות ארוכים מאוד אך רוב השאלות כן פתירות ורלוונטיות למבחן פשוט לוקח זמן לסיים את הגיליון.\n\nהמבחן: ספציפית המבחנים של תומר קשים מאוד, המועד שהיה לנו לדעתי היה המועד הכי קשה שעשיתי בקורס הזה. המבחנים כשרמי אתר אחראי מעט יותר סימפתיים אך גם לא קלים ובסה\"כ להוציא פה 90+ סופי זאת משימה באמת מאתגרת.\n\nהשורה התחתונה: פשוט מאוד - מי שאוהב הסתברות יאהב גם את הקורס הזה ולהפך, מי שסולד יסבול גם פה.\nהקורס בסך הכול מסודר ומקצועי, אחד הקורסים היותר מעניינים שעשיתי בתואר לדעתי והעובדה שהמבחן רצחני לא פגעה לי בתחושה הזאת.", "timestamp": 1678540591956}, {"author": "MMM", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות:מסביר טוב ובאופן ענייני לא מסובך כמו בקורסים אחרים למרות שהחומר מאוד לא פשוט. \n\nשם המתרגל/ת: עידו כהן\nחוות דעת - תרגולים: מתרגל מעולה ,למרות שאני ממש שנאתי את הסתברות והקורס הזה מבוסס על הסתברות הוא פישט את החומר וגם מסונכרן עם התלמידים בזמן שיעור ,עונה על כל שאלה בפירוט ומעודד השתתפות, שעות קבלה שלו זה הסיבה שקיבלתי ציון טוב.\n\nשעורי הבית: קשים אבל השאלות ברמת מבחן ויש קשר בין שיעורי בית לבחינה בשונה מקורסים אחרים.\n\nהמבחן: קשה אבל פתיר אחרי הרבה סימולציות הטריקים חוזרים על עצמם.\n\nהשורה התחתונה: קורס מעניין אך מאוד קשה.", "timestamp": 1678786655361}, {"author": "חשמלטור", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: תומר כמרצה, מרצה טוב מאוד, הוא ברור ומסביר טוב את החומר.\n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים: מתרגל מעולה, מאוד אכפתי - ממליץ גם על התרגולים המוקלטים שלו, בעייני היה הכי טוב מהמתרגלים.\n\nשעורי הבית: זוועה , 10 אחוז של תקף שאתה מבזבז עליהם המון שעות של רפרנס - כי הם קשים בטירוף בדרך כלל.\nאין ממש רפרנס טוב כי הפתרונות הרשמיים של הקורס מאוד לא מפורטים.\n\nהמבחן: זוועה, המבחן שהיה לי הכי קשה להתכונן אליו בתואר כי : א) המבחן הוא מתמטי כמעט לחלוטין ורוב פתרון השאלות הם טריקים הסתברותיים שצריך לשלוט בהם כאילו זה לוח הכפל.\nב) הפתרונות הרשמיים, שוב, לא מפורטים כמו שצריך ואז שוברים את הראש על מעברים כדי להבין באיזה דרך יצירתית פתרו את השאלה.\nכמובן שבמבחן עצמו תראה טריקים חדשים שכנראה לא תכיר וכל מיני אנקדוטות נסתרות שבקושי הופיעו בקורס. \nממוצעים נמוכים בהתאם.\n\nהשורה התחתונה: \nמאיפה להתחיל ? בקורס אין הרבה חומר ורמת ההרצאות והתרגולים תוך כדי הסמסטר נראית סבירה בעוד רמת המטלות נראית נוראית תוך כדי הסמסטר (כמו בקורסים רבים בטכניון), אך כשמגיעים למבחן מבינים שרמת ההרצאות והתרגולים מאוד נמוכה ביחס למבחן ושהמדד הנכון יותר הוא המטלות הבלתי אפשריות.\nאני לא מבין למה לעשות את הקורס הזה כל כך מתמטי ולא הנדסי, אבל מילא זה ובחרו לעשות קורס הסתברות 2 (הרבה יותר קשה ממבוא להסתברות), למה לעשות מבחן תופת על טריקים ולא דברים יותר סבירים, גדול עליי.\nלצערי לא מרגיש שלמדתי משהו משמעותי בתור מהנדס מהקורס, וחבל כי מרגיש שזה נושא באמת חשוב אבל שהתפספס פה כל העניין הפרקטי של \"אותות\" ונשארו רק עם ה \"אקראיים\".\nאם חייב -> בוכים\nאם לא חייב -> בורחים", "timestamp": 1679079925956}, {"author": "רני רהב", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nרמי אתר\nחוות דעת - הרצאות: \nמרצה מצויין, אחד הטובים בפקולטה לדעתי. רמי בא תמיד מוכן להרצאות ופותר באופן מסודר וברור. מקפיד ללמד גם טריקים למבחן תוך כדי ההרצאה ותמיד מדגיש שאת הפיתוחים הספציפים האלה כדי לזכור ולדעת. מאוד קשוב לשאלות של סטודנטים ועונה ברצון. הכיתה שלנו הייתה גם יחסית קטנה ובגלל זה הוא הוא לימד בקצב שהתאים לנו לפי כמה שהוא ראה שהבנו את הנושא שהוא מלמד.\nמומלץ מאוד!\n\nשם המתרגל/ת: \nיונתן שדמי\nחוות דעת - תרגולים: \nמתרגל טוב. מעביר את התרגולים של הקורס בלי יותר מידי לבלבל בשכל. לרוב מסיים את התרגול מוקדם וכמעט תמיד הספיק את כל התרגול למרות שהם די עמוסים. \n\nשעורי הבית: \n5 גליונות קשים וארוכים מאוד. הם גם רק 10% תקף שלא מרגיש הוגן בשביל כמה שהם קשים וארוכים, במיוחד ביחס לקורס של 3 נק\"ז.\n\nהמבחן: \nנורא, אחד הקשים שהיה לי בתואר. תומר מיכאלי עושה מבחנים נוראיים כשהוא אחראי, הוא גם נורא \"מקורי\" ובגלל זה קשה מאוד ללמוד למבחן. נתנו למועד א' פקטור קטן מאוד ביחס למה שאני חושב שהיה פייר למבחן כזה. להתפלל לטוב אין מה להגיד יותר מזה. \n\nהשורה התחתונה: \nקורס אחד המעניינים בתואר לדעתי. החומר משלב את הנושא של הסתברות ואותות וההרצאות ברמה גבוהה מאוד. הקורס מכיל חלקים מתמטים יותר תאורטים אבל גם דברים שהם יותר \"הנדסיים\". \nבשנים האחרונות, כשתומר אחראי, המבחן \"הורס\" קצת כי הוא קשה באופן מוגזם מאוד לדעתי. אני עדיין חושב שזה קורס מעניין מאוד ששווה לקחת אם אוהבים הסתברות או אותות.", "timestamp": 1679310321271}, {"author": "יוני", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  תומר מיכאלי\nחוות דעת - הרצאות: ההרצאות ממש מוצלחות, נותנות אינטואיציה טובה בסך הכל ותומר גם לפעמים קישר יפה בין החומר התאורטי שלומדים לבין השימושים במציאות. ההרצאות היו לפעמים מעט מונוטוניות\nNo pun intended\n\nשם המתרגל/ת: עדו\nחוות דעת - תרגולים:  אחלה מתרגל, השקיע ובאמת היה לו חשוב שאנשים יבינו. נותן הרבה טריקים למבחן והשקיע הרבה בלתת כיוונים והנחיות.\n\nשעורי הבית: לא עמוסים, איזה 5 הגשות. אפשר לרפרנס, מומלץ לפחות להבין אותם פחות או יותר כי שיעורי הבית כן עוזרים להבין מה הולך בקורס. יש גם חלק MATLAB מעיק.\n\nהמבחן: קשה משמעותית משיעורי הבית, מחפשים ממש את הטריקים הקטנים וההתחכמויות שעלולות לגרום לכל אחד ליפול. בסוף, כמו בהרבה קורסים, לתרגל ולתרגל.\n\nהשורה התחתונה: יש קצת עומס במהלך הסמסטר אבל החומר של הקורס לא קל, אז להיות על זה", "timestamp": 1679608047535}, {"author": "אלון", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: תומר\nחוות דעת - הרצאות: הרצאות טובות \n\nשם המתרגל/ת: מיקס \nחוות דעת - תרגולים: תקראו את הדפים אותו דבר \n\nשעורי הבית: קשיםםםםםםםםםםם וארוכים ולא ככ עוזרים למבחן \n\nהמבחן: אצלנו 2 המועדים היו קשים מאוווד מאווד תומר עושה מבחנים נאצים לעומת ההרצאות שלו \n\nהשורה התחתונה: קורס מעניין מבחנים הזויים בשנים האחרונות", "timestamp": 1679769241624}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: ראיתי מוקלט לרוב, רובם התבטלו בגלל השביתה\nמרצה טוב בגדול\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מתרגל מצוין, אבל היה צריך מלא השלמות והוא לא היה על זה...\n\nשעורי הבית: ארוכים, חשובים, אצלנו לא היה רטובים\nתשברו עליהם את הראש במהלך סמסטר, זה המפתח לפתח הבנה למבחן (בעיני יותר מקורסים אחרים)\n\nהמבחן: יש מבחנים ויש מבחנים, תתרגלו הרבה ותאלתרו עם הדף נוסחאות, אם מבינים את המבחנים תרגולים וסדנאות בסוף מפתחים אינטואיציה\nיש גם מבחני עבר לא פתירים, לרוב יש פקטורים אבל תתפללו שלא יצא לכם כזה\n\nהשורה התחתונה: משמיצים את הקורס הזה המון, בתכלס מי שלא סבל בהסתברות בגדול זה חשיבה דומה, אני חושבת שקצת מגזימים.\nדווקא זה היה מהקורסים היותר אהובים עלי בתואר", "timestamp": 1692720363596}, {"author": "אות אקראי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תומר מוקלט\nחוות דעת - הרצאות: \nבערך כל מה שראיתי בסמסטר, אבל נורא אהבתי את הקורס. סוף סוף מבינים באמת הסתברות.\nשם המתרגל/ת: חן זנו\nחוות דעת - תרגולים: \nהייתי מדי פעם בתרגול כי לא קמתי בבוקר, אבל הוא מתרגל אחלה לגמרי.\nשעורי הבית: \nלנו היו רק שלושה אבל זה בגלל שביתות וכאלו אז לא יודע כמה הם באמת נוראיים.\nהמבחן: \nקשה, כמו כל מבחן של תומר, אבל היה טוב בסה\"כ.\n\nהשורה התחתונה: \n\nאהבתי *מאוד* את הקורס. קורס שמנוהל טוב וחומר מעניין. מומלץ למי שזה לא חובה בשבילו (או בשבילה).", "timestamp": 1705346460514}, {"author": ".", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: באמת הרצאות מעניינות בגדול, אני לא התחברתי לקורס אבל תומר מעביר את ההרצאות מעולה. כל מי שחושב אחרת טועה.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: \nעל גבול הבלתי פתירים, באמת בלתי נסבלים.\nהמבחן: \nזוועה זוועתית שלא ניתן לתאר. זה יותר מבחן בהסתברות ובאלגברה מאשר בכל דבר אחר. תומר יכול להחליט שכל השאלה הראשונה פתאום עוסקת במטריצות סתם כי בא לו. או התמרת פורייה שאף אחד לא יזכור בחיים\\יצליח לפתור באופן סביר. כשזה לא קורה, אז ההסתברות קשה או שהשאלה לא מובנת או שיש בה טעות שלמעשה פוסלת את השאלה (ועדיין שרפתם זמן נכבד מהמבחן עליה)  כמו שכבר קרה בכמה מבחנים שלו בעבר.\nהשורה התחתונה:  לא לקחת, פשוט לא. אם זה לא חובה\\ הסתברות לא זורמת לכם בדם\\ אתם לא מזוכיסטים פשוט להתרחק מהקורס. אני אציין שהוא מעניין בעיני ויש בו בסיס להרבה מהקורסים האחרים בפקולטה ובכל זאת אם ניתן להסתדר בלעדיו עדיף להתרחק.", "timestamp": 1705432109766}, {"author": "דיגי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nקורס קשה צריך להשקיע הרבה", "timestamp": 1714473523431}, {"author": "סקיבידי טוילט", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  רמי אתר\nחוות דעת - הרצאות: \nהרצאות מעניינות אבל עמוסות וקשות. חשוב לעבור כל הרצאה על הפיתוחים של ההרצאה הקודמת ולהיות חדים על החומר, כי רמי מתקדם יחסית מהר והחומר הוא סינית אם אתה לא בקיא בו. רמי מרצה מעולה בעיניי, יודע את החומר ממש טוב ותמיד יודע להסביר שוב ובצורה אחרת אם לא הצלחת להבין אותו.\n\nשם המתרגל/ת: איתי שופרו\nחוות דעת - תרגולים: \nמתרגל סבבה לגמרי, לפעמים קצת רץ על התרגולים ולא מוודא הבנה אצל הסטודנטים, אבל בסהכ בסדר.\n \nשעורי הבית: \nגיליון כל שבוע, בסמסטר שלנו היו ממש סבירים באורך. מצריכים רפרנסים לפעמים אבל הם מתרגלים די טוב את החומר וחשוב להשקיע בהם.\nהמבחן: \nקשה. המבחן שלנו היה יחסית סבבה ביחס לשנים קודמות (במיוחד ביחס לתומר), אבל חשוב ללמוד הרבה כי יש חלקים טכנים שצריך לדעת לעשות כמו שצריך + הבנה ששווה זהב במבחן.\n\nהשורה התחתונה: \nקורס מאוד מעניין בעיניי, לא פשוט אבל יש אפשר לראות לאן הוא יכול להתקדם ואיך הוא מגיע לקונספטים מאוד מעניינים.", "timestamp": 1715086381990}, {"author": "חזאי לא אופטימלי", "difficultyRank": 3, "generalRank": 3, "semester": "202302", "text": "שם המרצה: הקלטות תומר\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: עידו כהן פרונטלי\nחוות דעת - תרגולים: מתרגל תותח, מסביר טוב ובקשר רציף עם הסטודנטים בתרגול\n\nשעורי הבית: גיליון כל שבוע, 1-2 שאלות, 10% ציון הסופי\n\nהמבחן: מסריח וקשה, צריך לתרגל הרבה, היה פקטור של 5 נקודות למועד א' למי שלא היה לו הקלות מילואים (בצדק), ההיסטוגרמה בלי הקלות מילואים הייתה בטח נמוכה\n\nהשורה התחתונה: עושים כי צריך", "timestamp": 1715253071150}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: תומר מיכאלי מוקלט\nחוות דעת - הרצאות: מוקלט באיכות דיי טובה והוא מרצה ממש טוב\n\nשם המתרגל/ת: מוקלט של יונתן\nחוות דעת - תרגולים: מסביר דיי טוב ולא הרגיש כאילו הוא רק קורא מהדף כנל לסדנאות שלו\n\nשעורי הבית: אחת לשבוע, רובם ממש סבבה ואפשר לתקתק בכמה שעות אבל חלקם מייגעים רצח\n\nהמבחן: באורך הגלות, היה מבחן ארוך ברמות (ובגלל התקיפה האירנית כל מי שלקח את המומלצת נדפק בלעשות אותו בשישי בבוקר כשעשינו מבחן אחר ברביעי בערב כך שבקושי היה זמן ללמוד אליו) אם לומדים מספיק אפשר להוציא ציון טוב. כן אציין שניתן פקטור של 5 נקודות לציון הסופי  \n\nהשורה התחתונה: קורס מומלץ למי שרוצה לעשות שרשרת עיבוד אותות. הקורס עצמו מתחיל מאוד הסתברותי ואז מגיע לחלק יותר מעניין של המשך לאותות ומערכות, אם סבלתם בשני הקורסים האלו אז לא מומלץ.", "timestamp": 1716819645466}, {"author": "חילזון הפרא", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: \nמרצה מאוד ברור שמאוד אכפת לו מהסטודנטים שלו. כדאי לעקוב אחרי הקורס כל הסמסטר כי הוא פשוט קשה.\nשם המתרגל/ת: איתי שופרו\nחוות דעת - תרגולים: התרגולים בסדר, פשוט הרגיש שברובם החומר יותר קל מהדרישות של הקורס\n\nשעורי הבית: תרגילים שבועיים לא ארוכים מדי שמלמדים את החומר יחסית בסדר\n\nהמבחן: קשה, מאוד ארוך וצריך להיות חדים על כל הגדרה כי הבדיקה מאוד קפדנית. במבחנים של רמי לפחות הרגיש שהמבחן לא בנוי רק על הברקות מתמטיות ועם מספיק תרגול אפשר להצליח\n\nהשורה התחתונה:", "timestamp": 1717074427460}, {"author": ".", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רמי \nחוות דעת - הרצאות: \nרמי מרצה מצוין, אכפת לו מהסטודנטים, פשוט החומר עצמו לא תמיד מעניין\nשם המתרגל/ת: עידו כהן\nחוות דעת - תרגולים: \nמעולה רק חבל שאין לו מוקלט. להבין טוב טוב את התרגולים, הם בדרך כלל קצרים ומובנים, חבל שהמבחן לא ככה\nשעורי הבית: \nפעם בשבוע, לא נוראיים כי בדרך כלל יש רפרנס\nהמבחן: \nקשההה. הלכתי לכל ההרצאות והתרגולים ופתרתי את כל שיעורי הבית ועדיין הרגיש לי שלא מספיק. אני לא אגיד שזה בלתי אפשרי, אבל לפי דעתי צריך ללמוד לפחות 8 ימים כדי לקבל 80+\nהשורה התחתונה: הסתברות 2. זה באמת קורס שדומה להסתברות יותר משזה דומה לאותות. וחבלללל", "timestamp": 1717148411157}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: תומר מיכאלי (מוקלט) \nחוות דעת - הרצאות: תומר מרצה מעולה. מסביר ברור ומשתדל לתת אינטואיציה. ההרצאות היו מעניינות.\n\nשם המתרגל/ת: עידו כהן\nחוות דעת - תרגולים: התרגולים הם שעה ולא מספיקים הרבה אז כן שווה ללכת לסדנה לדעתי. בהרגשה שלי התרגולים בעיקר עשו מעבר זריז על החומר + מיקוד של הנוסחאות המרכזיות ואיך ליישם אותם בתרגילים פשוטים, ובסדנאות לרוב פתרנו תרגילים יותר \"עמוקים\" שיותר משקפים את רמת המבחן. ממליצה על בת-שבע, היא מסבירה מעולה!\n\nשעורי הבית: גליון כל שבוע, בדרך כלל 2-4 שאלות. הגליונות לא קלים ולדעתי שווה ללכת לשעות קבלה אם נתקעים, כי הם כן משקפים את הרמה שנדרשת במבחן ובאמת עוזרים להבין את החומר לעומק.\n\nהמבחן: קשה, בסמסטר האחרון בעיקר היה מאוד מאוד ארוך. אבל אם לומדים את הקורס כמו שצריך במהלך הסמסטר חד משמעית אפשר להוציא ציון טוב.\n\nהשורה התחתונה: אחד הקורסים שהיו לי הכי קשים אבל שהכי נהניתי ממנו בתואר. סך הכל זה קורס שההבנה בו היא חשובה ודורש השקעה. ברמה הטכנית, צריך לשלוט טוב בהסתברות.", "timestamp": 1719571589874}]}