{"posts": [{"author": "מעיין", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות:ההרצאות מיותרות לחלוטין, התרגולים מכסים את רוב החומר\n\nשם המתרגל/ת: אדיר כהן\nחוות דעת - תרגולים: מתרגל טוב, מסביר את החומר מעולה\n\nשעורי הבית: עמוסים, דורשים הרבה זמן והשקעה.\n\nהמבחן:שאלות חוזרות על עצמן, אם חורשים מבחנים לפני, וכל הסמסטר לא מזלזלים, אין סיבה לא לקבל ציון טוב.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1597744797970}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: מונוטוני, ויתרתי על ההרצאות בערך באמצע הסמסטר. התרגולים מכסים את החומר.\n\nשם המתרגל/ת: מארון (וידיאו בפנופטו)\nחוות דעת - תרגולים: מתרגל תותח, מסביר את החומר ולא רק פותר שאלות. מומלץ\n\nשעורי הבית: שלושה רטובים שלוקחים הרבה זמן. הם פחות רלוונטיים למבחן עצמו אבל הש\"ב תקפים אז אין דרך להתחמק מהם.\n\nהמבחן: אין הרבה מבחנים לתרגל מהם כי הקורס חדש יחסית, אבל בסה\"כ המבחנים די הוגנים. \n\nהשורה התחתונה: אחלה קורס, מעניין. הסגל נתן הרגשה שהוא באמת בא לקראת הסטודנטים.", "timestamp": 1597831737885}, {"author": "natan borkowski", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: אחלה מרצה .מתאים למי שיכול להחזיק ראש 4 שעות הרצאה\n\nשם המתרגל/ת: אדיר כהן\nחוות דעת - תרגולים: משקיע ורוצה ללמד\n\nשעורי הבית: בחצי הראשון של הסמסטר אין הגשות ואז בחצי השני כל שבועיים יש הגשה שלוקח 3 שבועות לעשות אותה\n\nהמבחן: המבחן אמריקאי ומחפשים הבנה +כמה שאלות תכניות לגמרי לשיפור הציון\n\nהשורה התחתונה:", "timestamp": 1597844577864}, {"author": "Segev", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ראובן \nחוות דעת - הרצאות: הרצאות מעניינות מאוד, מקיפות את כלל החומר.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nתרגולים מגוונים, הרבה שאלות לפתירה, דומה לרמת המבחן.\nשעורי הבית: \n4 סימולציות רטובות לאורך חודשיים, אין תרגילים יבשים להגשה\nהמבחן: \nמבחן לא פשוט, דורש הבנה עמוקה של החומר.\nהשורה התחתונה: קורס מעניין ממש, נותן הצצה לעולם החומרה.", "timestamp": 1598099098956}, {"author": "מע\"ס", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: אחלה מרצה, הקליט לנו הרצאות, היה ברור ופירט תמיד על מה שצריך, הביא דוגמאות פרקטיות מהתעשייה.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל מעולה, ברור ויודע להסביר את הנקודות החשובות והטריקיות שיש במבחנים.\n\nשעורי הבית: הקוויזים קלילים. הסימולציות של אמצע הסמסטר יחסית כבדות וצריך לשבת עליהן טוב טוב וגם להשקיע יפה ולא לזרוק כי כל אחת 10 אחוז מהציון.\n\nהמבחן: טריקי נורא ומציק. לעבור על כל המבחנים שיש משנים קודמות (למרות שאין הרבה כי הקורס חדש) ולחפש את הניואנסים בשאלות. לעומת זאת בחני האמצע שמשמשים כמגן נורא הוגנים ועוזרים לציון הסופי.\n\nהשורה התחתונה: קורס כיפי ומעניין, מביא צוהר להבין תחום שבו מתעסקים מהנדסי חשמל. המבחן קצת מבאס בסוף.", "timestamp": 1598288084454}, {"author": "ב", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: מרצה טוב מאוד\n\nשם המתרגל/ת: אורי + מארון (מוקלט)\nחוות דעת - תרגולים: אורי מצויין, מסביר הכל בצורה מעניינת וברורה.\nהמוקלט של מארון ממש טוב וברור! כל דבר שלא מבינים בהרצאות יכולים להבין בתרגולים שלו, מאוד מומלץ.\n\nשעורי הבית: תרגילים יבשים (לא מגישים)\n12 קוויזים קצרצרים קלים מאוד\n4 תרגילים רטובים שמתחילים באמצע הסמסטר: צופים ב 5 סדנאות (המוקלט של עדי טוב מאוד) שהן הכרחיות ועוזרות מאוד בפתרון. \n\n\nהשורה התחתונה: קורס יפה מאוד, מעניין ומומלץ מאוד. לא עמוס בכלל ואפשר לקבל ציון טוב מאוד!", "timestamp": 1598531196381}, {"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "סך הכל לא קורס נורא קשה. הציון מורכב מ-45% עבודות בית ובחנים שהם סך הכל לא קשים ו-55% מבחן (בתנאי שעוברים את המבחן). החיסרון היחיד שלו הוא שחלק מהחומר קצת משעמם.\n\nשם המרצה:  ראובן דובקין\nחוות דעת - הרצאות: מסביר מאוד ברור. בסמסטר הזה הוא הקליט את ההרצאות ואז העלה אותן לאתר הקורס וניהל מפגשי שאלות ותשובות פעמיים בשבוע. לא השתתפתי במפגשי שאלות ותשובות כי הוא הסביר ברור ובמקרה שלא, אפשר היה לראות שוב בוידאו עד שמבינים\n\nשם המתרגל/ת: מארון טורק (המתרגל מהוידאו)\nחוות דעת - תרגולים: מתרגל מצויין! מסביר הכל באופן ממש ברור.\n\nשעורי הבית: התרגילים דורשים השקעה, אבל לא נורא קשים. ממליץ לעבוד יחד עם השותף כי החומר הרלוונטי לתרגילי הבית בדרך כלל לא שוקע טוב, אז אם כל אחד זוכר חצי מצליחים להתמודד יפה\n\nהמבחן: לא נורא קשה, אבל אמריקאי. אם מקשיבים בהרצאות יכולים להוציא ציון טוב בלי המון מאמץ\n\nהשורה התחתונה:", "timestamp": 1598988549315}, {"author": "יצחק ספוקויני", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nבדיחה, יש תרגילים יבשים לא להגשה. רק השב מהסדנאות לוקחים הרבה זמן, אבל הם לא קשים.\nהמבחן: \nדי קשה כי השאלות מבלבלות ונכנסים לפרטים קטנים\nהשורה התחתונה: \nקורס מאוד מעניין ומלמד ממש מהבסיס. יוצאים בסוף עם חומר חשוב. קצת מועבר בצורה מבולגנת לטעמי", "timestamp": 1603212246104}, {"author": "א", "difficultyRank": 4, "generalRank": 1, "semester": "201903", "text": "שם המרצה: שחר קוטסינסקי\nחוות דעת - הרצאות: לא היו בלייב\n\nשם המתרגל/ת: לא היו בלייב\nחוות דעת - תרגולים: לא זוכר\n\nשעורי הבית: לא קשים במיוחד\n\nהמבחן: קשה הרבה יותר מדי, הרבה יותר מהש.ב. להתרחק כמו מאש ממועדי קיץ!\n\nהשורה התחתונה: לא מומלץ למי שרוצה ציון גבוה, תדחו בסמסטר", "timestamp": 1603216308431}, {"author": "רון", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: פרופ' שחר קוטינסקי\nחוות דעת - הרצאות:  מרצה מצוין, מסביר את המוטיבציה לתחום של מערכות ספרתיות, ומעורר בסטודנטים השראה לתחום. מסביר את החומר בצורה טובה ומובנת.\n\nשם המתרגל/ת בפועל: מארון טורק (מוקלט)\nחוות דעת - תרגולים: מתרגל טוב, מסביר את החומר בצורה נהירה. החיסרון הבולט הוא שהתרגולים מועברים באמצעות מצגות לקוניות כך שלא כל דבריו של המתרגל כתובים שם. ולכן יש צורך לעקוב אחרי ההערות שלו, ולרשום אותן.\nצוות הקורס דרש מאיתנו לצפות בתרגולים המוקלטים ורק אחרי זה להגיע לזום.\nבתרגולים של הזום חזרו בקצרה על החומר, הציגו ופתרו שאלות ממבחנים קודמים. כמו כן היו רעיונות שהויעו בבחינה הסופית.\n\nשעורי הבית: 4 סימולציות בשפת תיאור החומרה SystemVerilog. יש להגיע לסדנאות על מנת לדעת לפתור אותן. ממליץ ללכת אצל עדי אליהו. יש גם מוקלט בpanopto\n\nישנם גם תרגילים יבשים שהם לא חובה לביצוע, ולא נכללים בציון הסופי. הם חשובים בגלל עליהם מבוססים הבחני-אמצע. \n\nהמבחן: \nחלק אמריקאי (11 שאלות) וחלק פתוח (5 שאלות). המבחן בודק הבנה יותר מטכניקה. יש להבין היטב את הנושאים האחרונים של הקורס: צינור, תקשורת, הבנת קוד בשפת אסימבלי, מעבדים (Single,Multi,Exceptions,Pipe), שכן 4\\3 משאלות המבחן מבוססות על הדברים הללו. שאר המבחן בודק ידע במערכות צירופיות (כמו הבחנים)\nהשורה התחתונה: \nקורס כבד, המון חומר בהרצאות, בתרגולים ובסדנאות... וגם לא הכל מסוכם במצגות. צריך לעקוב אחרי דבריו של המרצה והמתרגל ולהבין יותר מאשר להציב בנוסחא. הסימולציות מאוד עמוסות, עדיף לחלק את העבודה. הן והבחנים מהווים 45% מציון הקורס. סדנאות מאוד עמוסות ביחד עם התרגולים וההרצאות. כדי להצליח יש לפתור הכי הרבה ממבחני העבר של הקורס במתכונתו הנוכחית, ובעיקר להבין את העניין.", "timestamp": 1604099252440}, {"author": "George Washington", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ניר מסביר ממש טוב, אבל ההרצאה הייתה 4 שעות רצוף, ובדיעבד הרבה פעמים חזרתי להקלטה כדי לשמוע שוב את ההסברים (יתרונות סמסטר קורונה :) )\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: התרגולים ממש טובים, תכלס אפשר להצליח אפילו אם עוקבים רק אחרי התרגולים (ההרצאות ממש מעניינות וחשובות, אבל התכלס הוא בעיקר בתרגולים).\n\nשעורי הבית: הסימולציות קצת עמוסות (בעיקר בימים לפני ההגשה) אבל ממש מעניינות וכיפיות. הquiz השבועי המודל ממש קליל ובקטנה. כן שווה להשקיע ולעשות גם את היבשים, למרות שהם לא להגשה- מאוד עוזר בבוחן אמצע ולקראת המבחן.\n\nהמבחן: מועד א' היה מזעזע- היה קשה בכמה סדרי גודל יותר משאר המבחנים (ועברנו על כולם). מועד ב' כבר היה יותר הוגן מבחינת הרמה (לא ממש קל, אבל סביר).\n\nהשורה התחתונה: קורס ממש מעניין, לא עמוס יותר מידי, רק חשוב להיות עם יד על הדופק ולהבין הכל כמו שצריך.", "timestamp": 1607384465452}, {"author": "Ariel Cohen", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה:  ניר קציר\nחוות דעת - הרצאות: פשוט מעולה\nמסביר את החומר בצורה הכי טובה, מוסיף שקופיות משל עצמו כדי להנגיש את החומר הכי טוב\nיודע להשאיר את הכיתה איתו ומתחשב בשעות הקשות\nמומלץ על אף 4 שעות ברצף\n\nשם המתרגל/ת: תרגולים מוקלטים של מארון\nחוות דעת - תרגולים: מעולים, עשויים הייטב ומעבירים את החומר בצורה ברורה ולא מעייפת ותמיד אפשר לחזור אם לא קלטת משהו בפעם הראשונה\n\nשעורי הבית: לוקחים זמן ומחשבה אבל לא קשים יותר מידי\nמסתכמים בכ-3 הגשות לקראת סוף הסמסטק\n\nהמבחן: ארוך, שאלות ארוכות ושלאו דווקא כתובות היטב, לפעמים טריקי ומבלבל עם סוגי המעבדים השונים\nלדוגמה יכולות לבוא שאלות מאוד מאוד דומות וקל לפספס את העובדה שהחליפו את סוג המעבד בשאלה\n\nהשורה התחתונה: קורס חובה (לא חושב שמישהו לוקח אותו כרשות) לא מייגע יותר מידי.\nלכו לניר למרות השעות והתרגולים הקיימים בוידאו והסדנאות בוידאו פשוט מעולים ולדעתי לא מצדיקים להגיע פרונטלית אלא אם לא הבנת משהו ספציפי", "timestamp": 1607532928203}, {"author": "ALU", "difficultyRank": 5, "generalRank": 3, "semester": "201802", "text": "שם המרצה: ניר קציר \nחוות דעת - הרצאות: אחלה מרצה שבעולם. סבלני מאוד ומסביר ברוגע ובבהירות רבה. העביר חומר בצורה מעניינת . \n\nשם המתרגל/ת: מארון פייב\nחוות דעת - תרגולים: מתרגל נפלא, אדיב וחייכן. בגלל הביקוש הרב התרגולים שלו היו מפוצצים אז זה היה המוני מדי. \n\nשעורי הבית: המון, גם יבש וגם תרגילים בתוכנה ייעודית לסימולציית חומרה. \n\nהמבחן: קשה, הרבה שאלות אמריקאיות בזמן קצר. הרבה מאוד חומר. \n\nהשורה התחתונה: עמוס, מאתגר. החומר לא קשה אבל הבחינה הייתה מאוד עמוסה.", "timestamp": 1610240566998}, {"author": "Ido", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: \nאחלה מרצה, בסמסטר שלנו לא היו הרצאות לייב (אלא שעת קבלה אחת ארוכה) אז ראינו הרצאה מוקלטת מסמסטר קודם. מרצה טוב מסביר את החומר בצורה טובה, בכמה דרכים שונות, ולכן עוזר לחומר לשקוע טוב\n\nסימולציה: ראיתי בפנוטפטו את הסדנאות של עדי, מעבירה מצויין. (לא רואה צורך ללכת לאלו שבלייב)\n\nשעורי הבית: יש 3 גיליונות במהלך הסמסטר, גיליון 2 הוא העמוס ביותר, ולוקח כמה שעות טובות כדי לסיים אותו, אבל באופן כללי הגיליונות לא קשים במיוחד.\n\nהמבחן: ארוך מאוד וטריקי, צריך לקרוא טוב מאוד. השאלות לא מנוסחות באופן הכי בהיר שיש.\n\nהשורה התחתונה: סה\"כ קורס מהנה, לא עמוס במיוחד במהלך הסמסטר, פרט לשבועיים שבהם יש את ההגשה של רטוב 1 ו 2.", "timestamp": 1612460056774}, {"author": "עבד", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רובן דובקין\nחוות דעת - הרצאות: חצי ראשון של קורס כמעט אין חומר, חצי שני עמוס בחומר מאוד ובמיוחד לקראת סוף סמסטר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612777918035}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: \nבעיניי הרצאות ממש טובות. לא הרבה התחברו כי העדיפו לראות הקלטות אבל אני נהניתי. ראובן יודע להעביר את החומר והוא מאוד פנוי לשאלות.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: \nמעולים - העביר גם את התאוריה וגם את התכלס, היה זריז ולעניין אבל גם התעכב על דברים קשים. ממליץ בחום\n\nהחומר:\nבתור מי שנחשף פעם ראשונה לעולמות החומרה זה היה מאוד מאוד מעניין - בתחילת הקורס מלמדים אותך מה זה בינארי ובסוף הקורס אתה יודע איך עובד מעבד של מחשב.\n\nשעורי הבית: \nיש \"בחנים\" קטנים במודל כל שבוע שצריך לזכור לעשות (שתי שאלות אמריקאיות, ממש לא קשות). חוץ מזה יש רק את הסימולציות ב-verilog (שפה לתיאור חומרה, בעצם מתכננים בעזרת קוד רכיבים חומרתיים), שהן נחמדות, אבל אין אפשרות להריץ את הקוד על איזשהו שרת של הטכניון, אז לי קרה שהבודקים טענו שהקוד שלי לא עובד ולא הסכימו לקבל שום הוכחה לזה שהוא כן, שזה היה מרגיז. היו להם גם הרבה טעויות בתיאורי התרגילים והיה צריך די להתאמץ כדי להבין מה רוצים ממך.\n\nהמבחן: \nמבחן שחצי ממנו שאלות אמריקאיות והחצי השני זה רק תשובות סופיות (כבר הרבה שנים ככה). די מעצבן כי על כל טעות קטנה אתה מאבד את כל הנקודות. מהבחינה הזאת אני חושב שסגל הקורס לדורותיו מתנהל בצורה לא הוגנת כלפי הסטודנטים.\n\nהשורה התחתונה: \nזה קורס חובה, אז אין הרבה מה להתלבט :) לדעתי הוא מעניין מאוד ולא קשה מדי, אבל תתכוננו להשקיע הרבה זמן ברטובים ותתכוננו נפשית לזה שהמבחן אמריקאי", "timestamp": 1612946424632}, {"author": "david", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: הרצאות היו ההקלטות של סמסטר שעבר אבל הן היו נהדרות!\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל מצויין\n\nשעורי הבית: לא קלים, ולא עוזר שהם מפרסמים אותם ואת הקבצי עבודה עם טעויות רבות ולא טורחים לתקן\n\nהמבחן: לא קל אבל מקיף את כל החומר\n\nהשורה התחתונה: קורס ממש מעניין", "timestamp": 1612963711036}, {"author": "Me", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ההרצאות ארוכות מאוד, היה אפשר לקצר אותן, אבל ניר ממש מצחיק ומלמד טוב.\n\nשם המתרגל/ת: נתן פלד\nחוות דעת - תרגולים: מתרגל מעולה! חצי ראשון של התרגול זה חזרה על ההרצאה, חצי שני תרגילים. ככה שרבה פעמים אפשר לראות את התרגול במקום את ההרצאה.\n\nשעורי הבית: חופרים. לא קשים.\n\nהמבחן: מאוד טכני, תמיד יש שאלות מכשילות, אבל מבחן לא נורא.\n\nהשורה התחתונה: קורס קצת עמוס מבחינת שעות, החומר לא קשה בכלל, המבחן לא כיף.", "timestamp": 1613030605123}, {"author": "amir alkalay", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  ניר קציר\nחוות דעת - הרצאות:  המוקלטות של 2020 מצוינות\n\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: כולם תותחים\n\nשעורי הבית: לא כל כך נוראיים, הייתה מצפה ליותר שיעורים בקורס של 5.5 נקז\n\nהמבחן: אמריקאי ברובו, דורש השקעה והבנה של כל החומר. לא הייתי אומר שהוא קשה מדיי\n\nהשורה התחתונה: קורס מעניין, אחלה סגל, מבחן קצת מעצבן.", "timestamp": 1613313555801}, {"author": "Bob Bobinson", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "(סמסטר זום)\nשם המרצה: ראובן דובקין\nחוות דעת - הרצאות: מרצה מאוד טוב ויסודי, שמעביר את כל החומר שצריך בקצב טוב יחסית (הסמסטר סיים את החומר שתי הרצאות לפני הסוף, אותן השאיר לסיכום ושעת קבלה). החומר נע בין מעניין למשעמם, ובהתאם כמובן ההרצאה, אבל ממולץ להגיע אליהן.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: מתרגל מצויין, עובר על כל החומר מאוד מהר אבל עוזר לסדר אותו ולהבין אותו, ובעיקר פותר המון המון תרגילים לדוגמה, שעוד יותר עוזרים להבין הכל.\n\nחשוב לציין שיש גם סדנאות, בהן לומדים את השפה של שיעורי הבית. קצת מבולגנים ולא קשורים ממש לכלום, אבל יש חמש בסמסטר אז זה לא נוראץ\n\nשעורי הבית: שיעורי הבית בסדר, לא נוראיים מדי אם מוצאים שותף טוב. הבעיה העיקרית היא שהתוכנה שעובדים איתה ממש לא נוחה ואיטית (שיעורי הבית הראשונים הם די רק להתקין אותה, והם באמת קשים...). אבל מעבר לזה הם בסדר.\n\nהמבחן: המבחן חצי אמריקאי וחצי פתוח. יש המון חומר, אבל הכל מתקשר אחד לשני. צריך ללמוד אליו יחסית הרבה, ובעיקר לפתור המון תרגילים ממבחנים קודמים.\n\nהשורה התחתונה: סך הכל קורס מעניין מאוד, שעוסק במבנה המעבד מהתיאוריה המתמטית הבסיסית עד כדי המעבד השלם על כל חלקיו וסוגי מעבדים שונים. קורס מוצלח, מסודר ומלמד.", "timestamp": 1615464442625}, {"author": "סטודנט כללי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: מאוד מסודר, נהיר וניכר שמבין לעומק את הדברים. לפעמים בהרצאות יש ירידה לפרטים תאורטיים שמרגישים פחות מעניינים אך בסך הכול ההרצאות טובות.\n\nשם המתרגל/ת: אורי ליניאל\nחוות דעת - תרגולים: מתרגל תותח על שיודע להסביר, להכווין ולמקד לקראת המבחן.\n\nשעורי הבית: \n3 תרגילים רטובים שהם באמת \"חובה\" ונוטלים זמן השקעה אך יש במהלך הסמסטר גם בחנים קטנים במודל ותרגילים יבשים שעוזרים להתפקס ולשלוט בחומר.\nהמבחן: \nדי טריקי עם שאלות שפה ושם מנוסחות בצורה לא ברורה ב-100%.\nהשורה התחתונה: קורס חביב מאוד", "timestamp": 1615482847805}, {"author": "ליאור", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ראינו הרצאות מוקלטות שלו מסמסטר אביב 20, שבעיניי היו טובות.\n\nשם המתרגל/ת: אורי ליניאל\nחוות דעת - תרגולים: מתרגל מדהים, מומלץ מאוד\n\nשעורי הבית: לא מי יודע מה עמוסים, בעיניי רלוונטים למבחן\n\nהמבחן: יותר מבלבל מקשה, אפשר לשלוט בחומר במאה אחוז ולהוציא 60\n\nהשורה התחתונה: ממש נהניתי מהקורס, המבחן לא תמיד פייר. הייתי מביא לו 4 נק\"ז ולא 5", "timestamp": 1616235055087}, {"author": "s", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: אני צפיתי בהרצאות המוקלטות של ניר קציר מאביב 2020, הוא מסביר נחמד אבל ההרצאות ארוכות ומייגעות ככה שעדיף לפצל ולא לצפות בכל הארבע שעות אחרת קורסים\n\nשם המתרגל/ת: מארון טורק \nחוות דעת - תרגולים: התרגולים שלו מוקלטים בפנופטו, הכי טובים בעולם, אחרי כל הסבר של משהו מפחיד מארון זורק ״מאוד פשוט״ ומצליח כמעט להרגיע, לפחות אותי\n\nשעורי הבית: שלוש סימולציות, השנייה הכי כבדה וארוכה אבל הן כולן אפשריות ופתירות ואם יושבים עליהן רצוף אז אפשר לסיים ביום אחד למרות כל ההפחדות. עדיף לא להתחיל מיד כי יש מלא תיקונים מעצבנים שתעדיפו שאחרים ישברו עליהם את הראש ולא אתם\n\nהמבחן: חצי אמריקאי חצי פתוח, די טריקי, הרמה לא בשמיים אבל צריך להכיר שאלות ורעיונות ממבחני עבר כדי להצליח אותו\n\nהשורה התחתונה: קורס די עמוס מבחינת השעות שצריך להקדיש לו כל שבוע (הרצאות, תרגולים, סדנאות וסימולציות), אבל בסופו של דבר החומר מאוד מעניין ויש 30% תקף שיעורי בית ועוד 10% מגן בוחן אמצע ככה שאם משקיעים במהלך הסמסטר זה מתגמל מאוד בציון הסופי", "timestamp": 1616320204374}, {"author": "מוחמד עוסמאן", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר \nחוות דעת - הרצאות: מעולה - מי שרוצה להבין את החומר בצורה הטובה ביותר שילך להרצאות שלו  \n\nשם המתרגל/ת: מארון (מוקלט)\nחוות דעת - תרגולים: טוב מאוד - מומלץ לצפות בתרגולים נוספים \n\nשעורי הבית: צריך שותף רציני כדי לעבור את הסימולציות \n\nהמבחן: טרם נעשה\n\nהשורה התחתונה: קורס מעניין ... חומר שמאוד כיף ללמוד", "timestamp": 1626354664160}, {"author": "Michal Maya", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  ניר קציר\nחוות דעת - הרצאות: טובות.  חומר ממש מעניין (בהתחלה פחות אבל משתפר ממש) הוא קצת חופר אבל מסביר טוב וברור, מספר מלא בדיחות אבא לדעתי מוצלחות\n\nשם המתרגל/ת: אלעד ואורי\nחוות דעת - תרגולים:  שניהם מעולים ומסבירים ממש טובץ אלעד קצת יותר טוב\n\nשעורי הבית: עמוסים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1627292334997}, {"author": "אופק גינת", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: הרצאות נחמדות מעביר את החומר בצורה משעשעת\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: אורי תותח, מבין את החומר על בוריו ומביא דוגמאות חשובות ממבחנים\n\nשעורי הבית: מעניינים, מרגישים שעושים משהו אמיתי שיתרום בעתיד\n\nהמבחן: קשה אבל הוגן \n\nהשורה התחתונה: אחלה קורס נהנתי מכל רגע, חומר מעניין ואני בטוח שהוא יתרום בהמשך", "timestamp": 1628092524246}, {"author": "YT", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: \nמרצה מעולה ומצחיק. \nההרצאות מאד מאד ארוכות ומייאשות. אני לא בטוח עד כמה הן הועילו במשהו ולדעתי אפשר להסתדר רק עם לראות תרגולים בצורה טובה. אם כבר רואים ממליץ לראות על מהירות גבוהה, לא באמת חייב לקלוט כל פרט ופרט.\n\nשם המתרגל/ת: אלעד הדר ומארון(מוקלט)\nחוות דעת - תרגולים: \nבעיקרון רוב התרגולים ראיתי של אלעד שהיה מעולה והסביר ממש טוב, אבל כשחזרתי על החומר למבחן או היה נקודות שלא הבנתי ראיתי מארון והוא פשוט מדהים! כל מילה שיוצאת לו מהפה פתאום הכל נהיה ברור. תותח אמיתי.\n\nשעורי הבית: לא קשים בכלל ולא מורגשים, סימולציה 0 לוקחת 4-5 שעות. סימולציות 2 ו1 לוקחות יום וחצי- יומיים וסימולציה 3 חצי יום. שווה להשקיע כי המגן מטורף.\n\nהמבחן: מבחנים מאד הוגנים וזה לגמרי קורס עם פוטנציאל לציון מעלה ממוצע. הבנה בסיסית יחסית של החומר מספיקה ופשוט לעבור על כמה שיותר מבחנים לפני המבחן ולראות את כל הטריקים הקטנים שחוזרים על עצמם.\n\nהשורה התחתונה: ההתחלה של הקורס פחות מעניינת אבל ההמשך ובמיוחד החלק של המעבדים לדעתי היה מאד מעניין ובסוף הכל מתחבר. באופן כללי קורס מאד מומלץ. סגל הקורס מעולה ויש מתרגלים מדהימים. קורס שבאמת לא גוזל הרבה זמן מעבר לשעות צפייה רבות, אין לי מושג איך הוא 5 נקז אבל צריך להגיד תודה. ממליץ מדי פעם לעשות חזרה קטנה או לפתור את היבשים במודל כדי להיות על החומר.", "timestamp": 1628508333152}, {"author": "ניסים מזרחי אדרי בן זכאי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nניר קציר\nחוות דעת - הרצאות: \nאחלה מרצה, מעביר את החומר בצורה טובה ויודע על מה להתעכב, יש גם אווירה טובה ומצחיק אצלו בשיעורים.\n\nשם המתרגל/ת: \nאלעד הדר\nחוות דעת - תרגולים: \nמתרגל טוב, יודע את החומר מעביר אותי היטב, ובעיקר יודע לתת טיפים של איך אשכרה לפתור תרגילים בלי כל החרטאות.\n\nשעורי הבית: \nיש סימולציות שהם ממש ארוכות וקשות, חוץ מזה אין גליונות או משהו. יש 3 סימולוציות אשכרה אמיתיות, יושבים חזק שבוע על כל אחת ומסיימים.\n\nהמבחן: \nמבחן קשה בטירוף. החלק של השאלות האמריקאיות הרבה ממנו לא באמת קשור לחומר של הקורס. אני הרגשתי שהציונים שלי במבחנים שפתרתי לפני המבחן עצמו השתנו מאוד בתלות במזל בעיקר. היו מבחנים שעשיתי שהייתי מקבל בהם 20 נקודות פחות ממה שקיבלתי במבחן הסופי.\nשורה תחתונה מבחנים ממש ממש מבאסים, לדאוג שבסימולציות יש ציון טוב. \nתלמדו טוב לבוחן, שמים אותו על חציון 100 ועם השקעה, תקבלו 100 על 10 אחוז מהציון.\n\nהשורה התחתונה: \nקורס חדש, שמרגיש קצת מבולגן עדיין, אבל וואלה על נושא שמעט מכירים ויש בו חלקים מעניינים. מעט הגשות, אבל וואלה די מחורבנות. המבחנים קשים, לוודא שבמגן שיכול להיות עד 40 (!) אחוז מהציון יש ציון גבוהה.", "timestamp": 1628606141367}, {"author": "Elad Kay", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מיותרות ומשעממות\n\nשם המתרגל/ת: ירין ממרן\nחוות דעת - תרגולים: מצוין! מבין המתרגלים הטובים שהיו לי בתואר. הולכים להרצאה, קולטים כמה מילים ואז באים לתרגול להבין מה המשמעות של המילים.\n\nשעורי הבית: 3 רטובים עם משקל גדול (2% לתרגיל הכנה ממש קטן, 10% לכל אחד משני תרגילים שאחרי ו־5% לתרגיל האחרון). לא לוקחים עד כדי כך הרבה זמן אבל די עמוסים. יש תרגיל אמריקאי יבש במודל כל שבוע שצריך לעשות ולוקחים 12 טובים להיות 3% מהציון. אני לא מגזים כשאני אומר שמתוך ה־13 שמפרסמים, 10 אפשר לעשות בפחות מדקה ואת כולם אפשר לעשות בפחות מחמש דקות. כל זה 30% תקף.\nבנוסף יש בוחן אמצע לא קשה שהוא 10% מגן. סך הכול מגן די גדול על הציון.\n\nהמבחן: לא קל אבל מסתדרים\n\nהשורה התחתונה: לא אהבתי אישית את החומר ואת ההרצאות אבל הקורס ממש בסדר מבחינת ציונים והתרגולים מסדרים את הראש\n*הכותב הוא ממדמ״ח", "timestamp": 1628959037546}, {"author": "חראבו דראב", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: מרצה טוב שהצליח להעביר את החומר בצורה ברורה.\n\nשם המתרגל/ת: אלעד \nחוות דעת - תרגולים:  המתרגל היחידי שגם בזום כדאי לראות אותו \nמסודר ומעביר את החומר בצורה ברורה .\n\nשעורי הבית:  בחנים שבועיים שחא מצריכים כלום חוץ מלהקשיב . המטלות הרטובות לפעמים לא קשורות בכלל לסדנאות. שאותם בכלל כדאי לראות מוקלטות, בפרט של עדי.\n\nהמבחן: המבחן טיפה מלחיץ כי הוא מתבסס על הבנה מעמיקה יותר של החומר ממה שנדרש במהלך הקורס . המבחנים הראשונים ילכו לא טוב , אבל למי שמבין את החומר בקורס תהיה עקומת שיפור חדה אז פשוט לא להתייאש .\n \n\nהשורה התחתונה:", "timestamp": 1629013645478}, {"author": "רוי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מרצה ממש מצחיק וקליל אם כי מעביר את החומר בצורה סבירה לפעמים סבירה מינוס לטעמי, יש נושאים שמסביר טוב יותר ויש שמחפף קצת. ההרצאות ארוכות בטירוף ומכילות אין סוף חומר ומושגים חדשים, אבל יש הערה מנחמת - הרבה מאוד מהחומר של ההרצאות לא באמת רלוונטי למבחן בסוף, אבל לומדים להבין מה חשוב ומה לא רק בסוף הסמסטר.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל מצוין, אחד המתרגלים הכי מקצועיים שפגשתי במהלך השנה, נורא קשוב לסטודנטים ועונה ל100% מהשאלות בשיעור.\nמומלץ בחום להגיע לתרגולים אחרי שכבר ראיתם את ההרצאה שקשורה באותו הנושא(לא חייב להבין את ההרצאה פרפקט אלא להבין בערך מה הולך) זה שילוב מנצח.\n\nשעורי הבית: בחניים שבועיים 3% תקף מעפנים בטירוף לוקח פחות מ20 שניות כל שבוע.\nסימולציות 0,1,2,3 27% תקף. הסימולציות הכבדות שיכולות לקחת גם יומיים שלמים הם 1 ו-2, אבל בגלל שזה נעשה בזוגות זה מקל משמעותית על העבודה במידה והשותף טוב ורציני, תבחרו את השותפים שלכם בהתאם!\nבוחן אמצע *מגן* 10% בדר\"כ קל ממש למי שעל החומר במהלך הסמסטר ודואג לתרגל קצת לפני הבוחן.\nסך הכול אפשר להשיג 95+ של 40% בקורס וזה מומלץ ממש.\n\nהמבחן: באופן כללי, מבחני עבר הרגישו לי ממש טריקיים ומלוכלכים, תשומת לב מוגזמת לפרטים קטנים, הרבה אלמנטים מטעים, ניגשתי למועד אביב 2021 קצת מאוכזב כי היו סימולציות שנפלתי בהן הרבה.\nספציפית מועד אביב 2021 היה הפתעה לטובה, המבחן היה אחד המבחנים הכי הוגנים שפתרתי במהלך הסמסטר, אפילו קל, חצי מהמבחן היה ממוחזר מהמצגות של התרגולים \\ התרגילים היבשים שנותנים לעשות במהלך הסמסטר.\nמסקנה - תיהיו חדים על התרגולים ותעשו את היבשים!!!!!\n\nהשורה התחתונה: קורס מפוצץ במושגים חדשים בקטע מוגזם, קצת שוק בהתחלה כי זה \"עולם\" לא אינטואיטיבי למי שאין רקע בזה, אבל בסך הכול קורס חשוב מאוד והוא בסיס לכל דבר שלומדים בהמשך לכן חשוב להשקיע בו ולהוציא ציון טוב.", "timestamp": 1630333557512}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות:  חופר ממש אבל כן מרצה טוב ויש לו בדיחות מטומטמות שאני אישית ממש אוהבת \n\nשם המתרגל/ת:  אלעד ואורי\nחוות דעת - תרגולים:  שניהם מעולים ממש, לי אלעד היה קצת יותר טוב\n\nשעורי הבית:  אין הרבה אבל הרטובים לוקחים הרבה זמן\n\nהמבחן: סבבה\n\nהשורה התחתונה:  קורס מעניין אבל לוקח לו זמן להתניע", "timestamp": 1633856635620}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 5, "semester": "202003", "text": "שם המרצה: שחר קוטינטסקי\nחוות דעת - הרצאות: מעניינות, יודע להעביר טוב ובהומור, בסוף ההרצאות הוא הסביר לנו קצת על המחקר שלו והיה ממש מגניב\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: המתרגל הכי טוב שאי פעם היה לי, אני נהנתי בכל התרגולים שלו שהוא מעביר בצורה מדהימה, בזכותו אהבתי את החומר.\n\nשעורי הבית: יש תרגילים שהם 3% והם באמת בדיחה, לוקח 5 דקות גג לפתור כל אחד, יש את התרגילים הרטובים 0,1,2,3 שמהווים 27% מהציון הסופי.\nרטוב 0 מאוד קל מכיוון שהוא רק מרגיל אותך למערכת, 1 קצת יותר ארוך, 2 באמת לוקח הרבה זמן ו3 יחסית קצר ומראה איך בסוף הקורס אפשר להשתמש בכל החומר שלמדנו בצורה ממש מגניבה.\n\nהמבחן: לנו היו 2 בחני אמצע, שניהם היו באמת בדיחה ורוב האנשים קיבלו 100.\nהמבחן הסופי, שהוא גם אביב מועד ב', הרגיש לי משמעותית יותר קשה ממועד א', היו הרבה יותר שאלות טריקיות, בהרבה שאלות אמריקאיות היו המון טריקים קטנים שהיו יכולים להוביל לשגיאה של מספר אחד ובגלל שזה אמריקאי לא מקבלים על כך נקודות.\n\nהשורה התחתונה: קורס ממש כיף, שמח שלקחתי אותו, המבחן היה קצת מבאס אבל אם תשקיעו בתרגילים ותוציאו מגן טוב שזה בכלל לא קשה אם אתם יודעים את החומר, תוכלו לסיים עם ציון טוב!", "timestamp": 1634846923260}, {"author": "ליאור", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: החומר שלעצמו מעניין, הרצאות משעממות ומייגעות. אם ללמוד איתו אז מומלץ בהקלטות ולהריץ מהר\n\nשם המתרגל/ת: ירין ממרן\nחוות דעת - תרגולים: מומלץ מאוד! מעבר להיותו חזק בחומר ומעביר מעניין ושיתופי, גם אדם זהב וכיף איתו מאוד\n\nשעורי הבית: סימולציות, עושים בזוגות\n\nהמבחן: ניסוחים מכשילים אבל בלמידה נכונה וכמה שיותר תרגול אפשר להתרגל להבין את הצורת חשיבה שהם מחפשים ולהצליח\n\nהשורה התחתונה: קורס נחמד, לשים דגש יותר על תרגולים מאשר על הרצאות", "timestamp": 1634894548852}, {"author": "Noam Wolf", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר  \nחוות דעת - הרצאות: היה סבבה, קצת יבש, לרוב מספיק התרגולים. רק לקראת הסוף באמת יש חשיבות להרצאה. הסדנאות שיעורי בית גם חשובות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים מצריכים השקעה וזמן, אבל לא דומה לקורסים ממש כבדים כמו מבני ומתם. \n\nהמבחן: מבחן הגון, אמריקאי, אפשר להצליח בו. לא היה איזה שאלה מוגזמת על משהו שבקושי היה החומר או טריק אזוטרי\n\nהשורה התחתונה:", "timestamp": 1635228909212}, {"author": "milf33", "difficultyRank": 3, "generalRank": 4, "semester": "202003", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: לא כיף\n\nשם המתרגל/ת: elad hadar\nחוות דעת - תרגולים: אלעד הכי גבר בארץ, חוזר על החומר של ההרצאות(שלאף אחד אין כח להקשיב בהן כי זה ים חומר תיאורטי). עונה על שאלות מוגזמות ויודע להסביר כמו מקצוען. הון נזיל 900k, איבר מ זכרי באורך 700 מטר.\n\nשעורי הבית: פתירים גם לבד(הגשות בזוגות[בלעעעעעעעע])\n\nהמבחן: מתעתע אך קל- הרבה תיאוריה ודברים טכניים שצריך לדעת\n\nהשורה התחתונה: מי שלא הולך לאלעד חתיכת ליצן, הרצאות חשוב לא להרדם, אבל גם לא קריטי אם מנמנמים פה ושם כי אלעד הגבר יסביר הכל.", "timestamp": 1635346516128}, {"author": "-", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: ארוכות מאוד, מייגעות, אבל גם מעניינות מאוד וניר מצחיק ועושה אווירה טובה \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: פשוט מעולה! מדויק, ברור, חד ואחלה בן אדם. \n\nשעורי הבית: לוקחים המון המון זמן, בזוגות, אבל גם מועילים ונותנים מגן משמעותי.\n\nהמבחן: מבלבל מאוד, טריקי, במיוחד באמריקאיות. \n\nהשורה התחתונה:", "timestamp": 1635425070948}, {"author": "דלגלג מדורבן קצה", "difficultyRank": 4, "generalRank": 3, "semester": "202003", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: ניר קורע מצחוק, אבל באמת ההרצאות מיותרות לחלוטין. אני מסמן דרגת עומס: \"עמוס\" רק כי הרבה סטודנטים למרות ההמלצה שלי - כן יצפו בהקלטות, וזה יגנוב להם המון זמן בסמסטר (כל הרצאה 4 שעות ובתכלס לא מבינים כלום אז כל רגע חוזרים.. לי לקח 8 שעות כל הרצאה בלי הגזמה).\n\nשם המתרגל/ת: מרון/אורי לינאל (מוקלטים)\nחוות דעת - תרגולים: הכי חשובים בקורס. ממליץ גם על ההקלטות של הכיתות הפוכות של אורי הוא מסביר מדהים.\n\nשעורי הבית: כל הגשה לקחה 2 פגישות של פלוס מינוס 6 שעות כל אחת ויש רק 3 הגשות אז זה סבבה. (נראה לי שסימולציה 2 היא הכי עמוסה מביניהן).\n\nהמבחן: טריקי מאוד, נטו לפתור מיליון מבחנים לפניי זה ולהבין את התירגולים פרפקט. שוב, הרצאות מיותרות. הבוחן אמצע קל וממוחזר מתוך הגליונות היבשים.\n\nהשורה התחתונה: מקצוע מאוד חופר אבל בסיס לכל מדמחיסט גם לשונאי חומרה כמוני, ומסיימים עם ציונים טובים.", "timestamp": 1641648364149}, {"author": "עמנואל זלצמן", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: מרצה מעולה מומלץ המוקלטות שלו קצת ארוך אבל מרצה שמשקיע\n\nשם המתרגל/ת: מרסל\nחוות דעת - תרגולים: תרגולים נהדרים, נהנתי מאוד, חיסרון שאין הקלטה , ממליץ בהקלטות על אורי \n\nשעורי הבית: לא קשים מדיי, סימולציות משעממות\n\nהמבחן: נראים בסה\"כ פייר, צריך לדעת את החומר טוב ברמת הפרטים הקטנים מכל נושא, ולא להתרכז רק בנושא האחרון\n\nהשורה התחתונה:", "timestamp": 1644150351897}, {"author": "Daniel Litvak", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר קציר\n\nחוות דעת - הרצאות: \nלמרות השעות הקשות (3 וחצי עד 7 וחצי) נהנתי בהרצאות של ניר, מוסיף הומור ועם אווירה קלילה\n\nשם המתרגל/ת: נתן פלד\n\nחוות דעת - תרגולים: \nמעביר את החומר בצורה ברורה בתרגולים, מאוד מקצועי\n\nשעורי הבית:\nעמוסים ודורשים בין 8 ל12 שעות עבודה\n\nהמבחן: \nרוב המבחן שאלות אמריקאיות וקצת שאלות חצי פתוחות, מאתגר\n\nהשורה התחתונה: \nקורס נחמד ומעניין, מבחן לא קל", "timestamp": 1645119656208}, {"author": "i5 - single cycle - RISC1", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: -\nחוות דעת - הרצאות: לא נכחתי בהרצאות, הן בעיניי מיותרות אך כדאי ללכת אם יש לכם זמן לפני כל תרגול.  \n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: בן אדם תותח, גאון, שאוהב את החומר שהוא מלמד וגם נותן הערות חשובות בכל תרגול, אם קיימות אופציות פרונטלי וזום אז תלכו על פרונטלי. תרגולי אלעד עזרו לי במיוחד בנושאים האחרונים של המעבדים/חריגות. להבדל מן ההרצאות אלעד מסביר אך ורק את הנקודות החשובות בכל נושא ומראה חסרונות ויתרונות של כל מעבד ומשווה אותו עם מעבדים אחרים. \n\nשעורי הבית: לא כמו מת\"ם. יותר קלים. \n\nהמבחן: לפתור את כל המבחנים שבמודל כדי לקבל 80+.\n\nהשורה התחתונה: זה קורס חשוב מאוד (בעיניי גם עבור מדמ\"חיסטים), לא הייתי ממליץ לקחת אותו עם מבני נתונים כדי שתשקיעו בו יותר, הוא מהווה מבוא לכל עולם החומרה והמעבדים, אם אתם הנדסת חשמל אז תשאפו ל85+. בהצלחה!", "timestamp": 1646123621590}, {"author": "המעבד", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "אני באמת לא מבין איך אורי ליניאל לא נבחר לאיש השנה של טיים.", "timestamp": 1646154789700}, {"author": "Annon", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ראובן\n\nחוות דעת - הרצאות: \nמרצה תותח מלמד בצורה מעניינת ונותן הרבה דוגמאות מהחיים שעוזרות להבין את החומר, מומלץ בחום!\n\nשם המתרגל/ת: אלעד הדר\n \nחוות דעת - תרגולים: אין מילים, פשוט מעולה!\n\nשעורי הבית: מצריכים השקעה וזמן אבל מהווים 30% מהציון הסופי ועוזרים להבין הרבה דברים בחומר אז כדאי להשקיע.\n\nהמבחן: רעיונות חוזרים על עצמם, פתירת הרבה מבחנים והבנה של החומר (במיוחד החלק השני של הקורס) מבתיחות ציון טוב. \n\nהשורה התחתונה: קורס מאוד מעניין וחשוב, מצריך השקעה כדי להבין את החומר אבל שווה כל דקה.", "timestamp": 1646256104393}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: הרצאה של 4 שעות ארוכה אבל אפשר לשרוד את זה. הוא משתדל להעביר את ההרצאות עם הומור וזה גורם להן להיות יותר קלילות.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: התחלתי פרונטלי ועברתי למוקלט שלו של סמסטר קודם בגלל שלא הסתדר במערכת. מאוד ברור ומסביר טוב את החומר ואת הפתרון של התרגילים.\n\nשעורי הבית: 3 סימולציות שלוקחות כמה ימים כל אחת (אפשרי גם לסיים כל אחת בסופש) ושוות 30 אחוז תקף בציון הסופי. בהתחלה לא מבינים מה רוצים ואחר כך זה מסתדר וגם הציונים שם מאוד גבוהים.\n\nהמבחן: מועד א הייתי מופתע ממש מהדברים הקטנים ששואלים ובקושי עברתי. מועד ב זה כבר הסתדר אחרי שהבנתי במה צריך להתמקד. עדיף להקדיש זמן כבר בהתחלת הלמידה למבחן לעבור על מבחן אחד או שניים לראות מה שואלים זה לא דומה לתרגול.\n\nהשורה התחתונה: קורס עמוס אבל אפשר להצליח.", "timestamp": 1647210167223}, {"author": "tina", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר קציר(מוקלט)וראובן(מוקלט)\nחוות דעת - הרצאות: הדבר הכי עמוס בקורס הזה הוא ההרצאות,4 שעות הרצאה זה לא דבר נורמלי גם אם זה בהקלטה,הרצאות המוקלטות של ניר היו ארוכות משמעותית מאלו של רואבן כי הוא הקליט שיעור עם כיתה וראובן הקליט את עצמו אז אין שאלות והתעכבויות על החומר ובגלל זה עברתי לראות אותו, שניהם מדהימים ומסביריםצ החומר בצורה טובה אך החומר בהרצאות הוא לא הכי קריטי ועבל מועבר בתרגולים אז קצת חבל לבזבז 4 שעות עליהן,רק אם אתם מעוניינים ביותר תיאוריה והסבר מעמיק אז אולי כדי(אבל למה?)\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: אז כמו שכולם אומרים בחוות הדעת אלעד מתרגל אלוףףף הוא מסביר החומר בדרך הכי ברורה שיש, מוכן לענות על שאלות הכל והכי טוב שהתרגולים שלו היו מוקלטים\nממליצה בחוםם!!!\n\nשעורי הבית: למי שעבר קורס-סיוט-מתם הש\"ב לא יהיו קשים במיוחד ןלא גוזלים זמן, מתבססים על מה שנלמד בסדנאות ולמי שהבין מה הועבר יהיה קל מאוד לסיים התרגיל ןלדעתי כולם לוקחים פחות מיום לסיים-הראשון לוקח שעה שעתיים וזהו-\n\nהמבחן: אז המבחן קצת טריקי, חייבים להבין החלק השני של הקורס היטבב כדי להצליח,אמא ממש היטב!\nאגב אם מקבלים ציון 67 ומעלה ויש לכם 100 בכל שיעורי הבית/קוויזים/בוחן אמצע אז הציון הסופי יהיה 80 ומעלה אז באמת קל לקבל ציון גבוההה אם משקיעים במהלך הסמסטר\n\nהשורה התחתונה: קורס מעניין מאוד נותן מידע מעמיק על מבנה המחשב, אני אישית נהניתי מאוד,ולקורס של 5 נק\"ז כל לעבור בציון טוב\nממליצהה:)", "timestamp": 1647245486516}, {"author": "--", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ניר אחלה מרצה, מנסה להעביר את החומר בצורה מעניינת ורלוונטית, מספר הרבה בדיחות ומערב את הסטודנטים בהרצאה. אבל 4 שעות הרצאה בערב זה הדבר הכי מיותר שעשיתי הסמסטר, רוב החומר מועבר גם בתרגולים. יש חומר וכמה הוכחות שמועברים רק בהרצאות, אבל הייתי ממליצה פשוט לראות את ההקלטות ולא לבזבז את הזמן באולם.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: מתרגל מושלם, סבלני ומוכן להסביר הכל כמה פעמים עד שכולם מבינים. הוא הוסיף לנו לתרגולים שאלות ממבחנים או שאלות מעניינות שקשורות לחומר וזה מאוד עזר בהבנה כי השאלות בתרגולים לפעמים קלות מידי. \n\nשעורי הבית: 4 תרגילי סימולציה תקפים + בוחן שבועי במודל תקף.\nהסימולציות לא מאוד קשות, עובדים בזוגות והן מאוד עוזרות להבין את החומר יותר לעומק. שימו לב שכותבים בשפת system verilog שלא לומדים בהרצאות אלא רק בסדנאות, אז תגיעו לסדנאות זה עוזר. הסימולציה הכי עמוסה היא סימולציה 2, לקחה לנו בערך יומיים עבודה.\nהבחנים השבועיים פשוטים (2-3 שאלות) על החומר שהועבר בהרצאה, לשים לב לא לפספס אותם.\n\nהמבחן: פייר, 14 שאלות אמריקאיות ועוד 3 שאלות \"פתוחות\" (קופסאות מוות). אם פותרים הרבה מבחני עבר ואת התרגילים מהתרגולים אפשר להוציא ציון ממש סבבה.\nיש גם בוחן אמצע שנותן 10% מגן ובד\"כ נותנים בו שאלות ממאגר קבוע-לא לוותר עליו.\n\nהשורה התחתונה: קורס מעניין ונותן בסיס להבנה על אופן העבודה של המחשב.", "timestamp": 1647254979624}, {"author": "לי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: לא הלכתי להרצאות, ההרצאות היו בשעות מאוחרות אז בקושי מבינים, הצלחתי להסתדר גם בלי\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל פשוט תותח!! למדתי רק מהתרגולים שלו. חשוב להבין כל דבר בתרגול !! לחזור עליהם אם צריך לפני המבחן .\n\nשעורי הבית:  הרטובים קצת מעיקים אבל אם באים בגישה חיובית יכולים להיות נחמדים.\n\nהמבחן: קשה, במועד ב היו שאלות מאוד לא הוגנות ומבלבלות שלא בוחנות ידע או הבנה. לרוב המבחנים בסדר צריך פשוט לתרגל מספיק.\n\nהשורה התחתונה: קורס דיי מעניין וכיפי", "timestamp": 1647781211242}, {"author": "r", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: לא כל כך מובן וגם יענה לכם בנחמדות \"לא\" על כל דבר שתבקשו, הוא אחד מאבני הבניין של הסטיגמה על האטימות בפקולטה\n\nשעורי הבית: מרופנססים\n\nהמבחן: לא הוגן כל כך, שאלות הזויות כאילו אני מינימום אחד מהאחים גרים\n\nהשורה התחתונה: קורס חובה אין מה לעשות, אל תלמדו עם ראובן", "timestamp": 1647867078223}, {"author": "תלמידה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: אחלה מרצה, מסביר את החומר בצורה ברורה, גם ההקלטות שהעלה מעולות.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: מסביר את החומר בצורה מעולה.\n\nשעורי הבית: ארוכים, אבל שווה להשקיע בהם כי עוזרים להבין את החומר שמופיע בבוחן ובמבחן.\n\nהמבחן: לא מסובך, אך דורש הרבה למידה של הרבה חומר. בעיקר שווה לפתור תרגילים כי יש הרבה מיחזורים.\n\nהשורה התחתונה: אחלה קורס, שווה להשקיע (מלא נק\"ז) די מעניין.", "timestamp": 1648044812070}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מומלץ מאוד (!!) ושווה את ה4 שעות הרצאה רצוף. בהמשך הקורס מצליח בדר\"כ לחסוך שעה ומקצר את ההרצאה ל3. מעביר את החומר בצורה מעניינת ומובנת ככה שזוכרים ממש את מה שלומדים. ההרצאות איתו קלילות ועוזרות להעביר את השעות בסבבה.\n\nשם המתרגל/ת: מרסל חליפה\nחוות דעת - תרגולים: אחלה ממש!\n\nשעורי הבית: הרטובים עוזרים מאוד להבין את החומר ומאוד חשובים. בסוף הם כמעט 30% מהציון הסופי אז כדאי להשקיע. יכול לקחת הרבה מאוד זמן.\n\nהמבחן: הממוצע לא נוראי בכלל אבל השאלות רובן אמריקאיות והרבה פעמים מכשילות בכוונה. כדאי לשים לב לכל הפרטים בשאלה.\n\nהשורה התחתונה: קורס חובה אבל בלי קשר מומלץ מאוד! אם בחרתם בתארים האלו כי הם מעניינים אתכם אז אתם תהנו מאוד :)", "timestamp": 1648493280321}, {"author": "טיילור", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ניר אחלה מרצה ואחלה בן אדם, יודע שחלק לא קטן מהתוכן של ההרצאות מיותר ומשתדל לזרוק בדיחות בשביל לשמר את הקשב.\n4 שעות רצופות זה לא תענוג גדול, אני באיזשהו שלב נכנעתי ועברתי להקלטות שלו מהקורונה.\n\nשם המתרגל/ת: נעמי אבקסיס, מארון מוקלט\nחוות דעת - תרגולים: נעמי אחלה, נחמדה מאוד ושולטת בחומר. התרגולים בקורס הזה חשובים הרבה יותר מההרצאות (אבל אסור לוותר על ההרצאות). מארון בהקלטות מתרגל מעולה, שימו לב שיש דברים קטנים שהשתנו בקורס, אצלנו העבירו קובץ יישור קו לפני המבחן כדי למנוע בעיות.\n\nשעורי הבית: יבשים לתרגול עצמי - מיותרים לדעתי.\nרטובים - הסימולציות הן כמעט 30 אחוז תקף, יכולות לקחת זמן לפעמים ולהעיק, במיוחד כשמשהו לא עובד ולא יודעים מה. סך הכל נהניתי מהן, ממש מרגישים את היישום של מה שלמדתם בכיתה וזה חשוב לעתיד.\nקוויז - לא ברור מה הם רוצים אבל 3% מגן על 0 השקעה זה גם משהו\n\nהמבחן: אמריקאי ברובו. יכולות ליפול שאלות קשות פה ושם, רוב הקונספטים ממוחזרים. \nלצוות הקורס יש כישרון מיוחד לעשות טעות בכל מבחן ולכן יוצא שמפקטרים קצת.\n\nהשורה התחתונה: קורס מעניין ומאוד חשוב, תשקיעו את מה שצריך. אם תוציאו ציון טוב בבוחן אמצע יהיו לכם 40% בכיס ביחד עם ההגשות, ואפשר לצאת עם אחלה ציון.", "timestamp": 1649864240110}, {"author": "בחור טוב", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: \n\nניר אחלה מרצה, הייתי אצלו 2-3  הרצאות בפרונטלי ואז עברתי למוקלט מטעמי נוחות, להרגשתי לא היה הבדל - הוא העביר את החומר באותה האנרגיה, ומצליח לשמור אותך מרוכז גם כשהחומר לא הכי מעניין. הסיבה העיקרית ללכת לפרונטלי זה בשביל הבדיחות הגסות שהוא לפעמים מכניס.\nשם המתרגל/ת: אלעד הדר (זום)\nחוות דעת - תרגולים:\nאלעד תותח על חלל. מעביר את החומר בצורה ברורה ומתוקתקת, יודע לשלוף תשובה לכל שאלה שיכולה להיות לך ואחלה גבר באופן כללי. התרגולים שלו בזום עברו ממש טוב, אפילו יותר מהפרונטלי לדעתי (הקורס באופן כללי מתבסס בעיקר מצגות), אם יש אפשרות כזו, תיקחו.\n\nשעורי הבית: \nהרטובים מייגעים ולוקח לצוות הקורס המון זמן לבדוק אותם, אבל רוב הקושי הוא להבין איך לעבוד עם השפה - התרגילים עצמם סבירים בהחלט.\n\nיבשים - תעשו לפני המבחני אמצע באופן מרוכז, מכינים אותך די טוב לפני הבחנים(יש בקורס שני בחנים עם חציון מאוד גבוה, שווה לעשות אותם)\n\nהמבחן:  לא עשיתי עדיין \n\nהשורה התחתונה: אחלה קורס, הקורס הראשון שבאמת קשור להנדסת חשמל, אותי אישית ממש עניין :)", "timestamp": 1657385601964}, {"author": "אלמוג", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר- מוקלט\nחוות דעת - הרצאות: ראיתי את ההקלטות על כפול 2 רק כדי לקבל קצת קצת הבנה על מושגים חדשים. לא להשקיע בזה הרבה זמן לא שווה\n\nשם המתרגל/ת: אלעד- פרונטלי\nחוות דעת - תרגולים: אלעד מלך!!! מעביר בצורה ברורה, מסביר הכל לעומק, מוודא שיש הבנה. מתרגל מעולה\n\nשעורי הבית: ארוכים\n\nהמבחן: טרם היה\n\nהשורה התחתונה: חובה אז אין ממש איך לברוח מזה. עד כה הקורס שהכי עניין אותי!!!", "timestamp": 1657730672717}, {"author": "Yaniv Slor Futterman", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מצוין. כיף איתו והוא מרצה טוב. 4 שעות רצוף זה קצת קשוח, אבל מאוד ממליץ. להחליט לראות את זה דדרך ההקלטות זה קשה ורוב החברים שלי שניסו בסוף לא עמדו בקצב ותפסו פערים לעומת מי שהגיעו להרצאות וזהו.\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: מתרגל מלך! מסביר מצוין, נותן מלא טיפים טובים ואחלה גבר. התרגולים ממש רלוונטים לבחני אמצע ולמבחן. \n\nשעורי הבית: יבשים שהם רשות אבל מאוד מומלץ לפני בחנים והמבחן. ורטוב שזה מעיק ורק קצת מלמד ובעיקר לוקח הרבה זמן.\n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס. כיפי, לא קשה מידי. יחסית הרבה חומר אבל מהנה ומעניין.", "timestamp": 1658682242720}, {"author": "עידו פריימן", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: \nבשבועיים הראשונים לסמסטר הלכתי פרונטלי להרצאות הרצופות של 4 שעות, ולי זה היה פחות מתאים. צפיתי בהקלטות במשך כל הסמסטר ולי זה היה טוב למרות שלקראת סוף הסמסטר התחלתי לוותר על הרצאות. ניר אחלה של מרצה, רק שלפעמים הוא ציני ואנשים מתקשים להבין מתי הוא רציני ומתי לא. באופן כללי ההרצאות נותנות בסיס תיאורטי וידע מעמיק יותר לקראת התרגול. בפועל בחני האמצע והמבחנים נבנים על סמך התרגולים. לי היה יותר קל לצפות בהרצאות ולהגיע יותר מוכן לתרגולים עם רקע כלשהו בחומר ושאני לא אשמע את הדברים בפעם הראשונה. עקרונית לדעתי ההרצאות הן לא מאסט בטח אם אתם קולטים דברים מהר.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל מעולה, בקיא מאוד בחומר ויודע לענות על כל שאלה. הוא די רץ בחומר אבל יענה על כל שאלה אז אל תתייבשו לשאול. בנוסף הוא מעביר תרגולים גם בזום (ומקליט) וגם פרונטלי. תבחרו מה שנוח\n\nשעורי הבית: \nשאלונים על החומר הנלמד כל שבוע, ברמת ה 3 דק כל שבוע.\nעיקר הזמן הוא על הרטובים (החומר שנלמד בסדנאות).\nכדאי לעבור על החומר גם בזמנים שאין בחני אמצע וכו' כדי שלא תצטרכו להתניע כל החומר מחדש לקראת המבחן.\n\nהמבחן: \n\nהשורה התחתונה: קורס עם הרבה חומר אבל יחסית טכני.", "timestamp": 1659436087003}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: ניר מסביר מעולה גם בהקלטות, בסך הכל ההרצאות מכניסות אותך לחומר ואז בתרגולים אתה כבר מבין טוב מה הולך, אם עמוס מדי אפשר גם לוותר על ההרצאות ולהסתדר רק עם התרגולים \n\nשם המתרגל/ת: אלעד הדר (מוקלט)\nחוות דעת - תרגולים: מסביר מעולה וסוגר את החומר בצורה ממש טובה. מומלץ מאוד\n\nשעורי הבית: יש יבשים שכדאי לעשות אותם לפני הבחנים. בנוסף תרגילים רטובים שנראים מאוד כבדים אבל ביחס למשקל שלהם בציון הסופי הם בהחלט שווים את העבודה. כל תרגיל לוקח קצת זמן להבין מה בדיוק רצו ממך אבל אחרי זה זה זורם חלק יחסית.\n\nהמבחן: אמריקאי שבא לבלבל אותך ולראות כמה ביטחון יש לך בחומר. אחרי מספיק תרגולים והבנה טובה של החומר ברוב השאלות כבר אמורים להסתדר.\n\nהשורה התחתונה: קורס מעניין, לא מאוד קשה ושווה להשקיע בו כדי להוציא ציון מאוד טוב", "timestamp": 1659592859274}, {"author": "~~", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nסך הכל שחר מעביר את ההרצאות בצורה טובה. הוא יודע להעביר את החומר בצורה טובה, ולא היינו קבוצה גדולה במיוחד הסמסטר אצלו אז זה היה טוב. מה שכן לפעמים מרגיש שהוא עונה בחוסר סבלנות מסוימת לחלק מהשאלות, לא בצורה בוטה מדי אבל עדיין.\nבעיניי היתרון הגדול בהרצאות היה כששחר הביא מידע \"מעבר\" למה שלומדים בקורס, כלומר איך התעשייה / אקדמיה כיום מתנהלת סביב חלק מהנושאים וזה היה מאוד מעניין!\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: פשוט מלך. לא חושב שמחדש משהו מעבר למיליון הביקורות האחרות שיש על אלעד, אבל הבחור שולט בחומר ברמה מאוד גבוהה, עונה על כל שאלה שהיא ותמיד נותן תחושה מאוד נעימה בתרגול. אם הוא מתרגל שלכם ממליץ בחום ללכת אליו.\n\nשעורי הבית: \nיש בוחן שבועי שלוקח 5 דק'. תרגילים יבשים שהם לא להגשה אבל מומלץ לעשות לפני הבחני אמצע. הקטע העיקרי הם התרגילים הרטובים שלגמרי לוקחים זמן, אבל בעיניי היו מאוד מגניבים ובניגוד לשיעורי בית בקורסים אחרים היה נחמד לעשות משהו \"hands on\". לקחת בחשבון שצריך להשקיע בהם בין יום ליומיים של עבודה מלאה, כתלות בכמה באגים צריך לפתור.\n\nהמבחן:\nקשה, הרבה אמריקאיות שרובן לצד הבנה טובה של החומר דורשות תשומת לב לאיזשהו טריק קטן שמשנה את התשובה (רוב השאלות אמריקאיות). אחרי שעושים המון מבחני עבר מתחילים לזהות אותם יותר טוב.\n\nהשורה התחתונה:\nתכלס לצד הבחני אמצע והרטובים, הציון של המבחן הסופי יכול להגיע רק ל-55~ אחוז משקל, שזה אומר שאפשר להוציא ציון ממש סבבה בקורס. הרבה חומר אבל יחסית טכני, ולי אישית היה מעניין מאוד.", "timestamp": 1659620754993}, {"author": "Doctor Moore", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: אחלה הרצאות, מסביר את החומר באופן ברור ועם טיפה הומור.\n\nשם המתרגל/ת: אורי ליניאל\nחוות דעת - תרגולים: מלך. מסביר מדהים, ונותן את הדגשים שלו בכל נושא\n\nשעורי הבית: quiz קצר כל שבוע ועוד 3 תרגילים רטובים. הרטובים יכולים להיות טיפה ארוכים אבל לא באופן קיצוני, וסה\"כ טיפה עוזרים להבין את החומר.\n\nהמבחן: אמריקאי ברובו שמכיל די הרבה טריקים. עם מספיק חזרה מגלים אותם ואפשר להוציא ציון סבבה.\n\nהשורה התחתונה: שיעורי הבית הם תקף 30% והיו עוד שני בחני אמצע שהיו מתנה ששווים כל אחד ל-7.5% מגן, ושאר הציון זה המבחן, ככה שגם אם ציון לא משהו במבחן אפשר להוציא ציון סבבה.\nהחומר של הקורס יחסית מעניין ומאוד טכני, הקורס מרגיש מאוד מאורגן והסגל מקצועי מאוד.", "timestamp": 1659624951478}, {"author": "עומר", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המתרגל/ת: אורי\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: בזבוז זמן\n\nהמבחן: חרא גדול!\n\nהשורה התחתונה: בינג' תרגולים מוקלטים בתחילת הסמסטר ורק לפתור מבחנים.\n\nקורס מעניין שהוציאו ממנו את כל הכיף.", "timestamp": 1660058513117}, {"author": "a", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ניר קציר (הקלטות)\n\nחוות דעת - הרצאות: \nהלכתי פעם אחת להרצאה של ה4 שעות ולא עמדתי בזה. ניר מרצה טובה ומנסה להקליל ולקצר, אבל 4 שעות ברצף אחה\"צ זה לא פשוט. ההקלטות גם מייגעות קצת, ומשלב מסוים הפסקתי לראות הרצאות ונשארתי רק על התרגולים.\nבגדול מה שחשוב זה התרגולים וגם מסבירים שם את החומר, ההרצאות הן בעיקר בשביל לתת רקע/להעמיק/נושאים בודדים שלא נוגעים בהם בהרצאות.\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: \nמלך! רואים שהוא ממש נהנה להסביר והסטודנטים חשובים לו, מדבר בגובה העיניים ומשלב הסברים עם דוגמאות וכל מה שצריך. לפעמים הוא קצת מהיר, אבל זה ממש בקטנה והוא גם חוזר בכיף ובסבלנות על כל שאלה וחוסר הבנה שעלתה. הכי מומלץ.\nשעורי הבית: \nיש את ה12 קוויזים שזה בדיחה. הרטובים עמוסים לא כי הם יותר מידי קשים פרקטית, אלא בעיקר כי ההוראות שלהם סופר לא מובנים. בנוסף, את החומר לרטובים לומדים בתכלס בסדנאות שהן מזעזעות והיו על הפנים ולא ברורים בכלל. חופר ברמות אבל לרוב יש גם רפרנסים טובים.\n\nהמבחן: \nהיו שני בחני אמצע, אחד ממש ממש ממש בדיחתי, השני קצת יותר מאתגר אבל פיקטרו אותו וביטלו שאלות אז היה בסדר.\nהמבחנים עצמם הם קשים וסופר מתחכמים ומעצבנים, אם זה שאלות אמריקאיות שלהתבלבל בהן זה מובן מאליו כי זה תשובה מספרית עם מספרים צמודים, או כל מיני דברים שאתה שם לב אליהם בדיעבד. במבחן שלנו, הייתה שאלה עם חומר שלא נלמד בכיתה וזה לא עניין את המרצה האחראי, לא משנה כמה רעש ניסינו לעשות. פשוט לעשות מלא מבחנים ולקוות שהמרצה האחראי לא יהיה זבל.\nהשורה התחתונה: \nקורס בסיס לכל מי שלומד חשמל. יש קטעים מעניינים ויש קטעים משעממים, לנסות להשקיע בכל המגנים כי הם מעלים את הציון בהמון.", "timestamp": 1660737217240}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: מעביר את החומר בצורה טובה\n\nשם המתרגל/ת: נעמי אבקסיס\nחוות דעת - תרגולים: מתרגלת טובה. חלק מהתרגולים חוזרים על מה שנאמר בהרצאות\n\nשעורי הבית: הקוויזים קצרים ופשוטים. הרטובים לוקחים כמה שעות, אבל הם לא קשים מדי.\n\nהמבחן: קשה, רמה מעל שיעורי הבית. שאלה אחת הייתה בכלל בקומבינטוריקה. עשוי כולו משאלות אמריקאיות, לכן צריך להכיר את הגימיקים היטב\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660737455771}, {"author": "Meidan Zehavi", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: פלד נתן\nחוות דעת - תרגולים: מאוד ממליץ. אכפתי נורא ומעביר באופן טוב \n\nשעורי הבית: \n\nהמבחן: קשה\n\nהשורה התחתונה: סבבה", "timestamp": 1662044221681}, {"author": "אלחנן בלוך", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ההרצאות מעולות. ניר משתדל תמיד להוסיף בדיחות קרש כדי שיהיה יותר מעניין, ולדעתי זה גם ממש עוזר לזכור את החומר. אבל בסוף ההרצאות ארוכות והחומר עצמו לא תמיד ממש מעניין...\n\nשם המתרגל/ת: נתן\nחוות דעת - תרגולים: נתן מסביר ממש טוב, ומתעכב על כל דבר עד שכולם מבינים.\n\nשעורי הבית: לא דורשים הרבה זמן יחסית לגודל הקורס. אבל המטלות לא כ\"כ קשורות לחומר הקורס - כל מה שחובת הגשה זה קוד verilog (שפת חומרה), שזה יחסית שולי בקורס. לכן מצד אחד זה דורש הרבה השקעה (ללמוד לעבוד עם השפה), ומצד שני זה ממש לא מספיק כדי להגיע מוכנים למבחן. לדעתי צריך לעשות במהלך הסמסטר גם שאלות ממבחנים, או מהשיעורי בית היבשים (למרות שאין שום חובת הגשה).\n\nהמבחן: קשה, ודורש הבנה יחסית מעמיקה של החומר, אבל הוגן.\n\nהשורה התחתונה: קורס ממש ממולץ - בסוף לומדים איך בונים מחשב מאפס (ואחד), וזה די מעניין...", "timestamp": 1664652738225}, {"author": "עידן", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ד\"ר ניר קציר\nחוות דעת - הרצאות: \nניר מסביר ממש אחלה. מצחיק להיות אצלו בהרצאות, וזה גם תורם לפי דעתי להישאר בקשב. למרות זאת, הוא מעביר ביום אחד בשבוע חומר שמרצה אחר מעביר ביומיים, כלומר נשארים בדרך כלל 3-4 שיעורים רצוף באולם ההרצאות איתו וזה די קשוח.\nשם המתרגל/ת: אורי ליניאל\nחוות דעת - תרגולים: \nאורי מסביר מעולה, ומבחינתי היה ממש טוב שהוא הקליט את כל הסמסטר (התרגולים שלו התנגשו עם שאר המערכת שלי ולכן ראיתי רק מהקלטות).\nמה שכן, כל הקלטה שלו ראיתי לפחות בפי 1.5 מהירות מהרגיל, אולי ההסברים שלו בעיניי קצת איטיים מדי, ואז הוא גם לא הספיק לפתור את כל התרגילים מהמצגות.\nיש לי ביקורת נוספת על התרגולים, באופן כללי ולא בהכרח קשור לאורי - חוזרים בהם כמעט לגמרי על החומר מההרצאה (יש לפחות 80% חפיפה), מה שנראה לי ממש מיותר. עדיף היה שיתנו דגש על הדברים החשובים במקום לחזור על הכל, ובעיקר ילמדו איך לגשת לפתירת התרגילים.\nשעורי הבית: \nשיעורי בית שבועיים זה 2-3 תרגילים שהם שטויות, רק צריך לשים לב לעשות אותם בזמן כדי לא להפסיד מהציון.\nהסימולציות נחמדות ומלמדות טוב את החומר, ולוקחים כמה ימים כל אחת.\nבעיניי השיעורי בית השבועיים מיותרים וכדאי להחליף אותם בתרגילים של שיעורי הבית היבשים, שהם לא להגשה במתכונת הנוכחית היום.\nהמבחן: \nתפתרו הרבה מבחנים, כמה שיותר, אחרי חזרה על החומר. בעיקר צריך לתרגל הרבה ולדייק כמה שיותר (לשים לב ממש לפרטים הקטנים), כי על טעות קטנה יכול לרדת כל הניקוד.\nהשורה התחתונה: \nקורס ממש מעניין ונחמד, אהבתי אותו. גם מלמדים בו בצורה טובה וגם סביר לגמרי לקבל בו ציון טוב אחרי כל המגנים.", "timestamp": 1665395407117}, {"author": "Vex", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: קורס ממש מגניב ומעניין. הרצאה של 4 שעות רצופות זה קשוח, אבל ניר מרצה מצוין שדואג לשמור על דברים מעניינים אז זה בסדר.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: מתרגל ממש טוב; עוזר להטמיע את החומר ולהבין את הפרקטיקה.\n\nשעורי הבית: מעניינים ומלמדים. לא עמוסים במיוחד: יש רק תרגילים בודדים במשך סמסטר שלם וניתן לסיים תרגיל ביום או יומיים של חרישה.\n\nהמבחן: הוגן; לא קל ולא קשה מדי.\n\nהשורה התחתונה: אחלה קורס!", "timestamp": 1666102149774}, {"author": "יובל", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ראובן - מוקלט\nחוות דעת - הרצאות: מאוד נהניתי ללמוד מראובן, הוא מרצה מצוין. והבונוס: אלה הקלטות שהוא הכין בלי השתתפות של סטודנטים ככה שאין שאלות מעצבנות.\n\nשם המתרגל/ת: אלעד הדר\nחוות דעת - תרגולים: הוא מצוין, מתרגל בחסד. מומלץ ממש.\n\nשעורי הבית: הסימולציות לא קשות פרט לאיזה סעיף 1 או 2 גג. חשוב להיות על החומר כדי להצליח יפה. אל תדחו לרגע האחרון.\n\nהמבחן: אפשר להגיע מוכנים אבל ליפול על שטויות. מקצוע שדורש הרבה תשומת לב, ולכן מומלץ לתרגל כמה שיותר ולהיחשף לכל הטריקים. בגדול לדעתי המבחן פייר.\n\nהשורה התחתונה: קורס חמוד, פותח את הראש, אם מתחברים אפשר אפילו להנות.", "timestamp": 1666267961122}, {"author": "Ron Lebedinsky", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר (מוקלט)\nחוות דעת - הרצאות: ניר הוא סבבה אבל לפעמים ה-4 שעות ברצף יכולות להרוג, מעביר את החומר בצורה נחמדה.\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים:  אחלה מתרגל, מדבר ומסביר לעניין. יחס טוב לסטודנטים.\n\nשעורי הבית: היה \"בחן\" שבועי של שני שאלות ממש קלות ששואל בקצרה על החומר שנלמד באותו שבוע. היו שלושה עבודות רטובות שהיה צריך להגיש עם בזוג עם שותפ/ה, לא ממש קשות אך ממליץ לעבור על השאלות בקצרה לפני כדי שיהיה כיוון כשכן באים לפתור את השאלות - לקח בממוצע כ4 שעות לעבודה. ( גם צריך לבוא לסדנאות בכדי לכתוב את הסימולציות)\n\nהמבחן:  ארוך ומלא טריקים, אבל אם מתרגלים טוב ופותרים הרבה מבחנים הדברים חוזרים על עצמם. קושי בינוני פלוס\n\nהשורה התחתונה: חומר שמרגיש שלא קשור לכלום עד שמגיעים לשבועות האחרונים, בסופו של דבר מעניין. מומלץ כן לשמור על קצב במהלך הסמסטר ולא לשמור לסוף.", "timestamp": 1666293515702}, {"author": "matan", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: בסדר גמור\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: מעולה ומסביר טוב\n\nשעורי הבית: ארוכות אבל סבירות\n\nהמבחן: המבחן לא בודק הבנה, סתם מגיע כדי להפיל ולשמור על ממוצע נמוך, מתרחקים מהמטרה של הקורס למקומות אחרים ושואלים שאלות סופר טריקיות ומכשילות, בעולם המעשי אין דברים כאלה, פשוט אכזבה שהמבחן כל כך קשה ולא בודק הבנת הסטודנט בקורס.\n\nהשורה התחתונה: הקורס עצמו מעניין אבל המבחן טריקי מאוד, אפילו מי שלומד היטב עלול ליפול ולקבל נכשל, לא בודק כמה למדת אלא כמה אתה שם לב לדברים מאוד קטנים.", "timestamp": 1666426589662}, {"author": "Li shai Avraham", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר קציר \nחוות דעת - הרצאות: ההרצאות ארוכות, וקצת קשה להישאר לאורך כל ה4 שעות אך הוא מלמד טוב, ולעמיתים קרובות משחרר לפני סיום ה4 שעות כדי להקל\n\nשם המתרגל/ת: נעמי אבוקסיס\nחוות דעת - תרגולים: מתרגלת מדהימה ואכפתית, ממליצה ממש!!!!\n\nשעורי הבית: שיעורי הבית הם 30% תקף מהציון הסופי תבחרו שותף טוב ותשקיעו בהם! הם דורשים זמן \n\nהמבחן: אצלנו היו הרבה טעויות במבחן שתוך כדי נכנסו לתקן ודף הנוסחאות לא הודפס תקין אז הובא רק זמן מה לאחר תחילת המבחן, בנוסף הייתה שאלה שהסתמכה בחלקה על חומר בקורס אחר שלא נלמד עדיין, ולא נתנו פקטור כלל אז אל תצפו (למרות שבבחני אמצע כן נתנו פקטורים ויחד איתם, שיעורי בבית והבחנים השבועיים יוצא שהמבחן רק בערך 60% מהציון הסופי)\n\nהשורה התחתונה: קורס ממש נחמד, מעניין, מומלץ", "timestamp": 1666590061298}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202103", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: \nשחר מסביר את החומר בצורה טובה , הדבר היחידי שהפריע לי הוא שהוא חושב שאנחנו מבינים את החומר כמוה , ולאחר ששואלים שאלה לפעמים הוא עונה בצורה לא נעימה ( כאילו מה לא מובן )\nשם המתרגל/ת:  אלעד\nחוות דעת - תרגולים: \nמתרגל מעולה מעביר את החומר בצורה טובה\nשעורי הבית: \nיבשים - ממש מומלץ לעשות , בעיקר בשביל להבין את החומר בצורה יותר טובה , ובעיקר עוזר לבחנים מאחר והם לוקחים תרגילים משם.\nסימולציות - יש עמוסות ( סימולציה 1 ו 2 ) ויש פחות עמוסות (סימולציה 0 ו 3 ) . בעיקר עוזרים להבין גם את החומר הנלמד וגם את האופן שבו כותבים קוד ב system verilog\n\nהמבחן: מבחן 17 שאלות, שבהן השאלות לא מנוסחות בצורה הטובה ביותר , ולרוב ישנן טעויות.\nהמבחן שלנו לא היה עד כדי כך הוגן  - שאלה של 10 נקודות על חומר שהועבר 10 דקות בהרצאה , ואין תרגיל אחד עליו בכל המבחני עבר, ושאלות לא כאלה דומות למה שהיו במבחני עבר ( הממוצע הכי נמוך שהיה מתחילת הקורס).\nאבל בגדול, הצורה הכי טובה ללמוד אליו זה לתרגל מבחני עבר , כי כן חלק מהרעיונות חוזרים על עצמם\n\nהשורה התחתונה: \nקורס שנהנתי ללמוד אותו , מעניין מבחינת החומר , למרות שיש הרבה חומר . להיות על זה במהלך הסמסטר ולא לדחות בלהבין דברים כי הכל מתקשר אחד לשני.\n- הקורס עמוס , לפחות בקיץ , כי המטלות קרובות אחד לשני יחסית ( כמובן שאפשר להספיק לסיים הכל , אבל בגלל שזה הרבה חומר בקצת זמן הוא מרגיש טיפה עמוס )", "timestamp": 1666721231162}, {"author": "מדמ\"חיסט", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: מוקלטות של ראובן\nחוות דעת - הרצאות: מרצה מצוין, מסביר טוב את החומר, לרוב גם הרבה יותר מהר מאשר בפרונטלי. ממש ממליץ לוותר על נוכחות פיזית ולראות את המוקלטות שלו.\n\nשם המתרגל/ת: מוקלטים של מארון\nחוות דעת - תרגולים: אחלה מתרגל, גם אצלו ממש אפשר לוותר על השיעורים הפרונטליים.\n\nשעורי הבית: \nיחסית קצרים וקלים בשביל קורס של 5 נק\"ז, ציונים גבוהים בהתאם.\nהמבחן: \nחלק מהשאלות די טריקיות, סך הכל ההרגשה שלי היא שרמת הקושי אחידה בין השנים.\nהשורה התחתונה: \nקורס ממש מעניין וגם די כיף, סוף סוף לראות איך מחשב עובד, לא מרגיש כמו עומס של 5 נק\"ז. אם לשפוט לפי הקורס הזה אז רמת ההוראה בפקולטה לחשמל הרבה יותר גבוהה מזו של מדמ\"ח.", "timestamp": 1666721541068}, {"author": "שישקבב", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמיותר, רק תרגולים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהדר אלעד או אלעד הדר לא סגור על מה השם הפרטי, מתרגל טוב ממש, ראיתי מוקלט שלו והיה טילאבוחשמיל.\nמסביר לעומק ובדיוק מה שצריך, בלי כל האקסטרה המיותר בהרצאות\nשעורי הבית: \nרפרנס \nהמבחן: \nאמריקאי סבבה ראש טוב\nהשורה התחתונה: \nמלג מומלץ לעלות את הממוצע", "timestamp": 1667130709971}, {"author": "מיר", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nהקלטות של ניר קציר\nחוות דעת - הרצאות: \n בקיצור מיותר\nשם המתרגל/ת: \nאלעד הדר\nחוות דעת - תרגולים: \nהמתרגל הכי טוב נקודה. יש לו גם מוקלט ממליצה בחום.\nשעורי הבית: \nלוקח מלא זמן. מעצבן ממש תנסו למצוא רפרנס זה יעזור. ואני ממליצה ללכת לסדנאות או לצפות במוקלט כי זה ממש עוזר וגם יש שאלה במבחן על החומר שמועבר בסדנאות אז לא לזלזל ולא לדחות.\nהמבחן: \nלא קל. נפלנו על שני מועדים קשים בלי פקטור. מבחן מאוד מבלבל, תלמדו ממש טוב למרות שבסוף יש קצת מזל באמריקאי ולמרות כל העבודה הקשה תגיע שאלה עם ניסוח מזעזע ותפיל אותכם.\nהשורה התחתונה: \nקורס מאוד מעניין למרות שהוא לא הכי קל. תשקיעו ותתפללו שלא יהיה לכם כמו המבחנים שלנו.", "timestamp": 1669373698745}, {"author": "Dambi", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ראובן מוקלט\nחוות דעת - הרצאות: ראובן תותח. הוא עשה הקלטות במיוחד לזום אז אין הפרעות ושומעים אותו טוב ורואים טוב את המצגות. מאוד מאוד ממליץ על מוקלט במקום על לשבת 4 שעות רצוף בהרצאות ולא להבין כלום מהדאחקות של ניר קציר.\n\nשם המתרגל/ת: המתרגל המוקלט\nחוות דעת - תרגולים: לא הלכתי פרונטלי לתרגולים אבל ההקלטות אחלה.\n\nשעורי הבית: אם הסימולציות לגמרי לא ברורות אז לוודא שלמדתם קודם את כל החומר הרלוונטי, עם דגש על ההקלטות של הסדנאות.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: לראות מוקלט. זה קורס קל מאוד יחסית לחמש נק\"ז וההרצאות הפרונטליות סתם נגררות. בסוף יש רגע מאוד יפה שהכול מתחבר אז ממליץ לחכות בסבלנות.", "timestamp": 1676534305597}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה:\nחוות דעת - הרצאות: \nלגבי ההרצאות, לאחרי פתירת הרבה מבחנים השגתי שהם מיותרות ב-90%, ובלמידה למבחן הסתמכתי רק על התרגולים בנוסף חזרתי על כל הנושאים שהיו רק בהרצאות ולא הזכירו אותם בתרגולים, וזאת הדרך הנכונה להתמודד עם ההרצאות. אם אתם תלכו לכל ההרצאות ותחזרו עליהם כדי להבין הכל, אז הקורס יקח ממכם במהלך הסמסטר מאוד זמן ויהיה עמוס, וזה לא יעזור לכם בערך נוסף במבחן\nשם המתרגל/ת: מוקלט של מארון\nחוות דעת - תרגולים: תותח!!!!\nהמוקלט אש!!!!! מארון מתרגל מצויין. בנוסף להקלטות ציפתי בפעמים בודדות כמה דקות במוקלט של אלעד כי הוא לפעמים מוסיף שקופיות למצגת או מדבר על מקרה קצה שמארון הזכיר שהוא קיים אבל לא דבר עליו בפירוט ( למשל אם מארון אומר נניח שזה מתקיים, אז תצפו כמה דקות אצל אלעד והוא יסביר אם ההנחה הזאת לא מתקיימת איך להתמודד- וזה כן הופיע באחד המבחנים. ויש גם רבע שעה של שעת קבלה מוקלטת של אורי שנמצאת במודל שגם מדברת על מקרה קצה קטנטן)\nשעורי הבית: \nלא עוזרות להבנת החומר כל כך, רק המטרה שלהם לדעתי לבזבז את הזמן שלנו כדי שבאמת נראה שזה קורס של 5 נקודות\nאם אין לכם זמן תעזרו ברפרנס\nהמבחן: \nהוגן, צריך לארגן את הזמן שלכם מאוד טוב במהלך הבחינה\nוצריך לפתור כמות גדולה של מבחנים כי הטריקים מופיעים כמעט רק שם ( המלצה: במקום לבזבז זמן על 4 שעות הרצאה שבועיות, מומלץ לפתור שאלות מבחנים על הנושא שלמדתם השבוע, מאוד עוזר!, הסתמכתי על זה במהלך הסמסטר וזה מאוד עזר להבין אותם ולזכור אותם במקום להבין ולזכור כמות גדולה של רעיונות בימים בודדות לפני הבחינה)\nהשורה התחתונה: \nהקורס לא קשה, צריך להבין את התרגולים והדברים הנוספים מההרצאות במהלך הסמסטר, לפתור מלא מבחנים, ולהיות מרוכז בבחינה עצמה", "timestamp": 1676538872103}, {"author": "Idk", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  ניר\nחוות דעת - הרצאות:  אחלה מרצה, \n\nשם המתרגל/ת: מארון, מוקלט\nחוות דעת - תרגולים: איכות מעולה, מובן, ומספיק \n\nשעורי הבית: \n\nהמבחן: הגיוני\n\nהשורה התחתונה:", "timestamp": 1676988195450}, {"author": "קרנו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: \nניר ממש אחלה של מרצה. מכניס המון בדיחות קלילות תוך כדי, וגם עושה מדי פעם שאלות לאתגר את הקהל. רואים שאכפת לו שהסטודנטים יבינו. בדרך כלל הוא גם מסיים לפני הזמן. זה באמת קצת קשה ה4 שעות, אבל ניר מעביר אותן היטב.\n\nשם המתרגל/ת: אלעד הדר ואז אורי לניאל\nחוות דעת - תרגולים: \nבחצי הראשון הייתי עם אלעד ואז בחצי השני אורי החליף אותו, מין סידור שהיה ביניהם. שני מתרגלי על של הקורס, מומלצים מאוד. מסבירים טוב ועונים על שאלות. גם נתן מתרגל מומלץ. \n\nשעורי הבית: \nיש כמה סימולציות לא ברמת קושי גבוה במיוחד, ואני דווקא חושב שהן תורמות מוד להבנת הקורס. חשוב מאוד לראות את הסדנאות לפני שמתחילים, למרות שטכנית אפשר גם בלי. יש הקלטות של מתרגלת שממש טובות.\n\nהמבחן: \nמבחן עם טריקים שמאוד חוזרים על עצמם. קשה, אבל אם פותרים ים מבחנים, רואים כמעט את כל הטריקים, ואז לא נופלים. הוא אמריקאי והם שמים המון מסיחים בתשובות. פשוט לפתור כמה שיותר מבחנים, אין מה לעשות.\n\nהשורה התחתונה: אחלה של קורס לדעתי, שמועבר בצורה טובה. סגל מהטובים יותר שפגשתי.", "timestamp": 1677088748671}, {"author": "קרנו", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: מרצה מעולה, השעות קצת קשות - הוא מלמד ברצף 4 שעות אבל לרוב מסיים לפני הזמן. החומר נע בין משעמם לממש מגניב.\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: מתרגל חדש כנראה, ממש דואג לסטודנטים שלו ומנסה לענות על כל השאלות אבל לפעמים לא בטוח בעצמו או מתבלבל. הקבוצה הייתה יחסית קטנה אז יחסית רצנו על החומר והיה אפשר להעמיק איפה שלא הבנתי. ניסיתי אצל אלעד אבל הקבוצה הייתה ממש גדולה והקצב היה איטי מדי.\n\nשעורי הבית: היבשים לא להגשה אבל נראה שהם החומר לבחני האמצע שהם מגן מתנה בקורס. הרטובים הם סיוט! אפשר להימרח איתם לשעות של באגים.\n\nהמבחן: טריקי, חלק מהשאלות קלות מאוד וחלקן קשות ומבלבלות. הקורס דורש הרבה תרגול של מבחנים ולדעת כמעט את כל הנושאים שלומדים.\n\nהשורה התחתונה: קורס חובה אז אין מה לעשות, יש רגעים מעניינים אבל בכללי קורס מהקשים שהיו לי השנה.", "timestamp": 1677150551712}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמשעממות נורא , התייאשתי בשלב כלשהו \n\nשם המתרגל/ת: אלעד פרונטלי ומוקלט\nחוות דעת - תרגולים: מתרגל מלך, הכי טוב שנתקלתי בו בטכניון, מגיע מוכן ומעביר מצוין , ההקלטות שלו פצצה\n\nשעורי הבית: מתישים אבל משתלמים מאוד\n\nהמבחן: נראה לא קשה אבל יכול להפתיע\n\nהשורה התחתונה: ההתחלה של הקורס משעממת להחריד בסוף זה כבר מתחיל לעניין, אבל אפשר להגיע לציון גבוה בלי המון עבודה וזה 5 נקז!", "timestamp": 1677749630168}, {"author": "idle", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מעביר ארבע שעות ברצף.\nמצד אחד לא קל בכלל להתרכז, מצד שני ניר מודע למצב, משלב הרבה הומור ומעביר את החומר בצורה קלילה. אפשר להסתדר לגמרי בלי להגיע לכל ההרצאות. יש כמה קטעים יחסית מורכבים בקורס ואני הרגשתי שהדוגמאות על הלוח והדיון בכיתה עזרו לי להבין טוב יותר. בסוף גם ארבע שעות הקלטה יכול להיות קשה.\nלרוב אחרי האמצע של הקורס ניר משתדל לשחרר אחרי 3 שעות, לפעמים אפילו פחות.\nבסה\"כ מרצה מעולה.\n\nשם המתרגל/ת: אלעד הדר + אורי ליניאל (התחלקו בתרגולים לאורך הסמסטר)\nחוות דעת - תרגולים: שני מתרגלים מצוינים.\nכל דבר שיש בו טכניקה/ עומק בחומר - יש עליו תרגול מעמיק (וטוב שכך), כך שאין מה להיבהל אם לא מבינים בהרצאה.\nהמבחן (פירוט בהמשך) דורש הבנה לפרטים הכי קטנים של החומר - לכן מאוד מומלץ להבין כל שטות שמציגים בתרגול (וגם בהרצאה). יש הרבה \"טכניקות\" שמציגים בקורס (מפות קרנו, צינור, צמצום מכונות..) וצריך להבין כל דבר לעומק ולא רק בפן הטכני כי במבחן מנסים להתחכם.\nאני אישית התחברתי לאורי שבקיא בחומר, עם הרבה ניסיון בקורס, מאוד חשוב לו שנבין ולכן מסביר לאט ובבהירות וגם משדר רוגע. אולי המתרגל הכי טוב שהיה לי בטכניון.\nיש גם הקלטות של מארון, גם מומלץ אם לא מספיקים הכל בתרגול.\n\nשעורי הבית: שתי שאלות במודל על בסיס שבועי, תרגילי בית יבשים וארבע סימולציות.\nשאלוני מודל - בערך 10 דק' עבודה אם יודעים את החומר ברמה הבסיסית..\nתרגילי בית יבשים - לא להגשה ככה שאפשר לעשות מתי שרוצים. מציע לעשות לפני הבוחן אמצע כל מה שבחומר (תנסו מראש בקרבת הבוחן אמצע לפנות לזה בערך 3/4 יום) ולפני המבחן את החלק השני אם יש זמן.\nסימולציות - סימולציה 0 מאוד בסיסית ולוקחת שעות בודדות ממש. סימולציות 1 ו - 2 קצת יותר כבדות ולפעמים לוקח זמן עד שמבינים מי נגד מי. מציע לא להתעכב על המסגרת של הקוד ולהסתכל די מהר אם לא מבינים במצגות/ רפרנסים. כל סימולציה בערך יום וחצי.\nסימולציה 3 יותר קצרה ולוקחת בערך חצי זמן מסימולציות 1,2.\nסה\"כ לא קשה אבל היבשים קצת ארוכים ולפעמים אפשר להיתקע כל שטויות של SYSTEM VERILOG.\n\nהמבחן: 60 אחוז מהציון הסופי וכדי לשמור על ממוצע שהסגל רוצה - המבחן מתחכם ומבלבל. 14 אמריקאיות ו3 פתוחות שברובן הן תשובות סופיות.\nדורש חדות גבוהה על החומר בתוספת לחדות מחשבה ותשומת לב לפרטים קטנים.\nמידי פעם צץ איזה נושא קטן מהחומר ששואלים עליו פעם ב.. אם בכלל (אצלנו זה היה לדוגמה הצגת מספרים עם נקודה עשרונית, שאני לא פגשתי עליו שאלה בכלל במבחני עבר). \nמציע קודם כל להשקיע בכל מה שנותן מגן (בוחן אמצע וסימולציות), וכשפותרים שאלה ממבחן מצד אחד להבין שהם מנסים להתחכם, מצד שני יש שאלות פשוטות שבהן חושבים איפה התחכום סתם.. לזכות הסגל ייאמר שבמקרים שבהם היו כמה תשובות אפשריות (כל מיני מקרי קצה) התקבלו כמה תשובות.\nשימו לב לדף הנוסחאות. יש בו המון מידע שיכול לעזור, יותר ממה שנראה בהתחלה.\n\nהשורה התחתונה: קורס מקיף עם הרבה חומר, חלקו משעמם חלקו מאוד מעניין. בשורה התחתונה מגיעים בסמסטר מללמוד ייצוג בינארי ועד ללהבין איך עובד מעבד בסיסי ברמה כמעט מלאה.. לדעתי מעניין מאוד ונותן הרבה הארות על דברים שלא הבנתי עד הקורס למה הם כמו שהם ואיך הם עובדים.\nבמעטפת קורס קצת מוזר.. מצד אחד חמש נק\"ז מצד שני כמות שיעורי בית של שלוש-ארבע נק\"ז.\nארבע שעות הרצאה ושעתיים סדנה בשבוע (כל מה שעל SYSTEM VERILOG - מוקלט על כפול 2 ומעלה. לסדנאות ההפוכות לדעתי כדאי ללכת/ לעשות את התרגילים) כשבסוף הדבר הכי חשוב (לדעתי) זה התרגולים. הרבה חומר מקורסים אחרים (למדמ\"ח) - מתק\"א, לוגיקה וקומבי.\nהציון הוא 40 אחוז מגן יחסית קלים (ש\"ב רטובים ובוחן אמצע של חציון 100) ו - 60 אחוז מבחן מבלבל ומתחכם.", "timestamp": 1677938380946}, {"author": "Tamir Manoach", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ראובן דובקין\nחוות דעת - הרצאות: המרצה טוב, אבל ההרצאות לא מעניינות בפני עצמם\n\nשם המתרגל/ת: מורן הדר\nחוות דעת - תרגולים: מתרגלת בינונית, יש לה מוטיבציה והיא רוצה לעזור, אבל היא לא ממש ממש טובה\n\nשעורי הבית: רטובים, לא קשים אבל לפעמים ארוכים\n\nהמבחן: קשה, החומר לא קשה, אבל המבחן כן קשה.\n80% מהמבחן אמריקאי ולכן קל ליפול על כלום\n\nהשורה התחתונה: הקורס לא קשה עד למבחן.\n#לא לגלגל בבוחן אמצע, המגן חשוב לציון הסופי#", "timestamp": 1678260451404}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניר קציר חצי סמסטר\nחוות דעת - הרצאות: \nעל רוב החומר של ההרצאות חוזרים בתרגולים. ההרצאות עצמן ארוכות וקשה להתרכז בהן (4 שעות ברצף אצל ניר בשעות אחר הצהריים ערב). לי באיזשהו שלב זה קצת פחות התאפשר מבחינת עומס של הסמסטר. לדעתי אפשר לוותר לגמרי על הגעה להרצאות ולהשלים את הנושאים הקטנים שהתרגולים לא מכסים בעזרת הרצאות מוקלטות מסמסטר קורונה של ראובן דובקין.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: הסגל של הקורס מאוד מקצועי ומנוסה. אני באופן אישי הגעתי במהלך הסמסטר לתרגולים הפרונטלים של נתן שהיו ממש טובים לדעתי, לפני המבחן חזרתי על החומר עם התרגולים המוקלטים של אורי - גם הוא מתרגל טוב ורואים שהוא מאוד חד על החומר. \n\nשעורי הבית: \nתרגילי בית הם מימוש של כל מיני דברים בשפת ורילוג שלומדים בסדנאות. הם לא נוראיים (ביחס לפקולטה למדמח לפחות) אבל יש לא מעט מהם ורובם משתחררים בסוף הסמסטר. בנוסף, במבחן יש רק שאלה אחת על ורילוג ולפחות אצלנו להכין את תרגילי הבית לא ממש עזר בה...\nבכללי, מומלץ להעזר ברפרנסים מסמסטרים קודמים כדי לא להתקע שעות על דברים קטנים שלא מסתדרים לכם עם הורילוג.\nזה 27% תקף אז מאוד חשוב להשקיע כי זה מציל את הציון.\n\nהמבחן: \nמרגיש קצת כמו פסיכומטרי שמנוסח גרוע.\nהמבחן מכיל 15 שאלות אמריקאיות ו3 שאלות פתוחות שעונים בהן רק תשובה סופית מספרית. אז גם אם תדע את החומר מצויין, עדיין ניסוח שאלה מבלבל (שקורה הרבה) או טעויות חישוב קטנות יכולים להוריד הרבה מאוד נקודות. החומר של הקורס לא קשה ולכן הם מתאמצים לכתוב שאלות טריקיות שבוחנות על ניואנסים קטנים מאוד אז חשוב לתרגל המון כדי להחשף לכמה שיותר טריקים ושטויות שהם אוהבים לשים.\nהכי חשוב - לא לזלזל בבוחן אמצע שנותן 10% מגן, לשמור על ריכוז שיא במבחן ולחזור טוב טוב על החומר של מעבדים כי בערך שליש מבחן זה על מעבדים.\n\nהשורה התחתונה: לא הקורס הכי מעניין חוץ מנושא המעבדים שהיה נחמד. המבחן קצת מסריח כי אמריקאי טריקי אז מזל שיש מגן + תקף שמגיעים עד 40%!", "timestamp": 1678460985597}, {"author": "אליננד", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: מרצה מעולה. מסביר ברור מאוד, באווירה מאוד טובה וכיפית וסבלני לכל שאלה. השעות קשות ולא לכל אחד. ניר מודע לכך ובאמת שעושה הכל כדי לעזור להתגבר על זה, אז מי שחושש מהשעות אני ממליץ מאוד לנסות הרצאה אחת או שתיים לפני שמוותרים כי הוא באמת מעולה וההרצאות שלו מיוחדות. \n\nשם המתרגל/ת: אלעד הדר ומרון (מוקלט)\nחוות דעת - תרגולים: מצטרף להמלצות לפניי, שניהם באמת מעולים ואוסיף ואומר שבתור בן אדם שקשה לו לקום בבוקר התייצבתי חצי מהסמסטר ב8:30 אצל אלעד כי התרגולים היו פשוט זהב. לצערי אלעד עבר לקבוצת תרגול אחרת באמצע הסמסטר ולכן לא יכולתי להמשיך איתו ועברתי למוקלטים של מרון. בשביל ההקלטות לא הייתי צריך לקום ב8:30 אבל גם הייתי קם אם היה צריך. \n\nשעורי הבית: הבחנים השבועיים במודל לוקחים 2 דקות אם מרפרנסים ו 10 דקות גג אם עושים בעצמכם. ממליץ להשקיע את ה10 דקות האלו, זו חזרה טובה על החומר וזה עוזר לחלחול שלו. לגבי היבשים, אצלנו הופיעו שאלה או שתיים מתוכם בבוחן אמצע לכן כדאי לפתור אותם לפני הבוחן אמצע. את החצי השני שווה לפתור לפני המבחן.\nהסימולציות לא קשות מידי (חוץ מהראשונה שארוכה להחריד) ואני די נהנתי מהן. בסוף כל עבודות הבית מהוות 30 אחוז (!) תקף ולכן כדאי לעשות הכל כדי להוציא שם 100. בנוסף הבוחן הוא עוד 10 אחוז מגן ו100 בו יביא אתכם למבחן עם 40 נקודות בכיס. מוריד הרבה מהלחץ לפני.\n\nהמבחן: הוגן מאוד. צריך לקרוא טוב מאוד את השאלות ולהזהר בחישובים, במיוחד באמריקאיות. עם השקה לא מטורפת אפשרי להוציא ציון גבוה מאוד\n\nהשורה התחתונה: אחד הקורסים הטובים שלקחתי, סופר מהנה ומעניין לטעמי. יש המון שעות של הרצאות ותרגולים אבל חוץ מזה אין עומס גדול בשיעורי בית.", "timestamp": 1678529165598}, {"author": "אידאל מינימלי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: הגעתי להרצאות הפרונטליות רק חצי מהסמסטר, ואולי אפילו טיפה פחות. לדעתי חשוב להגיע להרצאות, אני הגעתי בחצי הראשון של הסמסטר שבו ההרצאות היו 4 שעות בשעות לא קלות (אחה\"צ). אחרי החצי הזה ניר (ממה שהבנתי) ניסה לשחרר תמיד לפני הזמן ואפילו בפחות מ3 שעות. שמעתי המון פעמים ששווה לוותר על ההרצאות וכדאי לעבור לצפות בתרגולים. לדעתי באמת יש המון חומר מיותר בהרצאות שלא מופיע במבחנים (ואם מופיע אז משום מקום לאחר שלא הופיע באף מבחן עבר אבל זה מזערי). בסופו של דבר ללמוד את הנושאים הקשים של הקורס רק מהתרגולים זה קשה מאוד לסטודנט שהוא לא מבריק במיוחד. ממליץ להגיע להרצאות הפרונטליות בקיצור.\n\nשם המתרגל/ת: נתן פרונטלי ומוקלט אלעד/מרון/אורי\nחוות דעת - תרגולים: נתן מתרגל מעולה, מבין את החומר טוב. מרון ואורי מעולם גם כן. אלעד במוקלט גם כן מצוין אבל רץ מהר מאוד על החומר, ואולי מפספס דברים חשובים. ממה שהבנתי בתרגולים הפרונטליים הסמסטר היה בקצב יותר נורמלי. התרגולים חשובים מאוד ונהיים קשים בחלק של המעבדים. \n\nשעורי הבית: מרפרנסים הכל.\n\nהמבחן: נראה שבאמת יש השתדלות להשתפר מבחינת ניסוחים, והניסוחים הרבה יותר מקצועיים מאשר מה שהיה לפני שנה/שנתיים. אבל עדיין במבחן אצלנו במועד ב' הייתה שאלה שנוסחה כל כך גרועה, שיצא שבזבזתי עליה 10 דקות מיותרות שלא הייתי מבזבז עליה אם הייתה מנוסחת כראוי (2 תשובות שונות התקבלו כתשובות נכונות....). בסופו של דבר צריך מזל, המבחן של מועד ב' לדעתי היה הרבה יותר סביר משל מועד א'. צריך להיות מרוכזים מאוד, אסור לטעות בשום מילוי טבלת אמת, לא לטעות באף חישוב. באמת שהריכוז פה משחק תפקיד משמעותי ביותר בציון הסופי שלכם. לעבור על כמה שיותר מבחני כבר, הטריקים חוזרים על עצמם, ואחרי כמות מכובדת של מבחנים חלק מהאסימונים (במיוחד לגבי מעבדים) נופלים. במועד ב' היו שאלות שמיחזרו רעונות כבר, ומי שלא נתקל בהם כנראה בזבז על השאלות האלו המון זמן.\n\nהשורה התחתונה: החלק האחרון של הקורס - מעבדים - מעניין מאוד, אבל גם דיי קשה להבנה מבחינתי לפחות. לדעתי בקורס קיימים נושאים שחלקם לא קלים בכלל, ולנסות להבין אותם רק מהתרגולים לא מומלץ. בסופו של דבר, קורס שעם מזל במבחן, ריכוז טוב, ומעבר על החומר לפני תרגול מבחנים +תרגול 15 מבחנים - מוציאים ציון טוב שמעלה את הממוצע.", "timestamp": 1678572767737}, {"author": "sheesh the kabab", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מוקלט ניר קציר\nחוות דעת - הרצאות: אל תלכו להרצאות ! לא משנה מי מה מו ! בזבוז זמן מטורף תראו תרגולים קודם ואז תעברו על ההקלטה של ההרצאה - התרגולים זה מה שמשנה וחשוב .\n\nשם המתרגל/ת: אורי מוקלט\nחוות דעת - תרגולים: תראו תרגולים או של אורי או של אלעד - היחידים שמסבירים ופותרים שאלות ממבחנים כמו שצריך\n\nשעורי הבית:  קוויזים כל שבוע - לרפרנס אין קשר למבחן\nמטלות להגשה- תרפרנסו אבל תשנו מלא דברים - בודקים העתקות \nמי שחוזר על הקורס הם משנים משהו קטן כל מטלה אז תשימו לב \n\nהמבחן: 17 שאלות - מועד א היה קשה ממש עם שאלות לא מובנות ומועד ב׳ קליל. \n\nהשורה התחתונה: 5 נקז שבתכלס מל״ג - רק תראו הרצאות ותתרגלו הרבה מבחנים", "timestamp": 1678613344186}, {"author": "אנונ'", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: \nהקלטות סבבה לגמרי\nשם המתרגל/ת: מרוואן\nחוות דעת - תרגולים: אחלה של הקלטות\n\nשעורי הבית: סימולציות ארוכות ולוקחות זמן, צריך הבנה טובה של החומר כדי לעשות, יש רפרנסים :)\n\nהמבחן: טריקי מאוד, תמיד יש איזה כמה שאלות שמתבססות אל איזה פרט מידע סופר שולי שכמעט אף אחד לא זוכר. יתר השאלות סבירות\n\nהשורה התחתונה: לא לזלזל אפשר להצליח כי יש מגן מפנק", "timestamp": 1678630137745}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניר (מוקלטות)\nחוות דעת - הרצאות: לא מאוד רלוונטיות, ראיתי אותן על X2 תוך כדי שעשיתי דברים אחרים. יש כמה נושאים בודדים שעוברים רק בהרצאות (למשל צמצום מכונת מצבים)- תאתרו אותם מראש ותתמקדו רק בהם.\nסה\"כ ההרצאות די משעממות אבל ניר מקליל את זה קצת עם ההומור שלו (חלקו צריך להיות מסווג למבוגרים בלבד)\n\nשם המתרגל/ת: אלעד הדר (מוקלטות)\nחוות דעת - תרגולים: אלעד מסביר מעולה והתרגולים באופן כללי ממש חשובים אז קחו אותם ברצינות.\n\nשעורי הבית: 4 סימולציות רטובות (לכל אחת גם חלק יבש): סימולציה 0 היא כמה דקות רק להכיר את סביבת העבודה, 1+2 הן איזה יום יומיים עבודה וסימולציה 3 כמה שעות עבודה. חוץ מזה יש בוחן ממוחשב כל שבוע, קל בטירוף ומסתובבים הפתרונות שלא משתנים מסמסטר לסמסטר, 3% תקף קליל. בנוסף היה לנו בוחן אמצע די קל 10% מגן שהרוב הוציאו בו 100. יש גם גיליונות יבשים שלא מגישים אותם אבל עוזרים להתכונן למבחן לאורך הסמסטר.\n\nהמבחן: מועד א היה קשה, בעיקר באורך שלו, הוסיפו זמן וגם נתנו פקטור ובכל זאת הציונים על הטופס לא היו מזהירים. עם כל המגנים והתקפים זה הביא את רוב מי שעבר את המבחן אל מעבר לרף ה80.\n\nהשורה התחתונה: באופן אישי פחות התחברתי לחומר, כנראה שיאהבו את הקורס יותר מי שמתעניינים בהנדסת מחשבים ובlow level. \nהרטובים לא הכי רלוונטיים למבחן ובכל זאת הם התרגול היחידי הרציני שעושים לאורך הסמסטר, להוציא את הגיליונות היבשים שהרוב לא נגעו בהם ואולי בדיעבד הייתי עושה את זה.", "timestamp": 1678779833548}, {"author": "איריס שורות", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רובן\nחוות דעת - הרצאות: \nאחלה רובן. ראיתי הקלטות שלו כל הסמסטר, מרצה טוב, מומלץ מאוד. כשהוא נכנס אליי למבחן לשאלות, ממש התרגשתי.\n\nשם המתרגל/ת: מורן שקולניק\nחוות דעת - תרגולים: \nמורן מתרגלת סבבה, מסבירה טוב אבל לא חושבת שזה מספיק בשביל המבחן, כדאי לחזור לראות הקלטות של כמה מהתרגולים על הנושאים החשובים לפני המבחן.\n\nשעורי הבית: \nלא אהבתי בכלל. תמצאו שותף טוב.\n\nהמבחן: \nחרא של דבר. שני מועדים מסריחים מאוד, בודקים אותך על טריקים ועל קטנות, והמבחן כולו אמריקאי וזה נוראי...\nשווה להשקיע בבוחן אמצע ולקבל בו 100 כדי שיהיה לכם עוד מגן.\n\nהשורה התחתונה: \nלא כל כך התחברתי לקורס, החומר עצמו בסך הכל כן מעניין אבל המבחן ומה שהם בוחנים עליו עם כל הטריקים האלה, מוציא את כל החשק ויוצר אנטי לדבר הזה...\nכמו שאומרים מלג לא מומלץ.", "timestamp": 1678871486016}, {"author": "טי פי די", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: אחד הקורס הטובים שעשיתי, אבל ההרצאות מייגעות. מדובר על טירוף לעשות את כל ההרצאות ברצף, העובדה היחידה שעודדה אותי היא שמדי פעם ניר סיים לפני הזמן. אבל אין מה להגיד, ניר יודע להסביר ומרגיש שאם באורח פלא אתה עוקב אחריו לאורך כל ההרצאה אז הבנת הכל. ממליץ אבל עם כוכבית. \n\nשם המתרגל/ת: זאב אברהם צוקרמן \nחוות דעת - תרגולים: אחלה מתרגל, מנסה לעשות אווירה טובה בשיעורים. שולט טוב בחומר ומסביר טוב, לפעמים נותן דרך פתרון אחרת או טריק לשאלה. בתרגולים שהוא סיים לפני הזמן (נדיר בקורס) הוא נתן כל מיני העשרות וחיבר אותנו לפרקטיקה. מתרגל זמין מאוד שעונה הרבה בפורום של הקורס. לסיכום, מתרגל מומלץ.\n\nשעורי הבית: היבשים לא חובה והם די קלילים - ממש לא ברמה של המבחן. הרטובים נוראיים! לא בא ממקום של תכנות וגם החברים שלי שכן התקשו יחסית, לומדים בסדנאות שפת תכנות חדשה והסימולציות מתבססות עליה לחלוטין.\n\nהמבחן: מועד א' זוועה - שאלות פתוחות של הישמור, מועד ב' הוגן.\n\nהשורה התחתונה: UART זה נורא. אבל הקורס ממש מעניין ומובן לחלוטין למה הוא חובה בחשמל כי הוא הקורס הנדסה הראשון.", "timestamp": 1679172140217}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוקלט של ניר\nחוות דעת - הרצאות:  הרצאות נחמדות, ניר מסביר די טוב. לקראת הסוף כבר ויתרתי על רוב ההרצאות אבל שווה לעבור לפחות ברפרוף על המצגות\n\nשם המתרגל/ת: מוקלט של אלעד\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: 3 סימולציות לא יותר מדי קשות. הסימולציה השניה לוקחת קצת יותר זמן אז לשים לב לא להתחיל ברגע האחרון. בסהכ הקורס לא מאוד עמוס במהלך הסמסטר\n\nהמבחן: מבחן סביר, ברובו אמריקאי. צריך לתרגל הרבה ולנסות להיות על זה במהלך הסמסטר, כי זה הרבה חומר שקשה להשלים בתקופת מבחנים.\n\nהשורה התחתונה: קורס חמוד אם כי קצת משעמם לטעמי, לא מומלץ להזניח אותו במהלך הסמסטר", "timestamp": 1679772090159}, {"author": "מישהו", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: רב הקורס הלך לניר קציר אבל אני נשארתי אצל ראובן. גם יש הקלטות משנים קודמות וגם הוא מעביר את החומר בקצב מהיר אבל מובן. הוא היה עושה שאלה אמריקאית בסוף כל מצגת וזה היה ההיילייט של ההרצאה בשבילי. אני אומר, תנסו ללכת לראובן, לא תאהבו, תחליפו. אבל אני בעדו מאוד.\n\nשם המתרגל/ת: איתמר יקותיאל\nחוות דעת - תרגולים: אני נורא נהנתי עם איתמר, במיוחד בגלל הצחוקים וכי היינו קבוצה קטנה אז היה יחס אישי ומענה על שאלות. בתרגולים לומדים גם חומר שלא מופיע בהרצאה אז אני לגמרי ממליץ להגיע.\n\nשעורי הבית: תמצאו שותף שיודע ורילוג. סימולציות קשות ואני לא יודע שהן תורמות למבחן.. רק צריך לעבור אותן ולקבל את ה-30%. לעומת זאת, היבשים שהם לא חובה מצילים חיים והם תרגול נוסף מעולה למבחן.\n\nהמבחן: מועד א היה לדעתי יותר קשה ממועד ב, שאלות ממוחזרות לפעמים ממועדים קודמים אז הייתי ממליץ ממש לחרוש על מבחנים קודמים. השאלות הן אמריקאיות ומרגישות טיפה כמו חידון.\n\nהשורה התחתונה: קורס חמוד מאוד, מרגיש כמו טריוויה", "timestamp": 1688568977750}, {"author": "נתי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nהעדפתי לפצל לשעתיים שעתיים במקום 4 שעות אצל ניר, לכן הגעתי לשחר.\nמרצה מעולה, עובר בקצב סבבה על החומר, מסביר לעומק ובצורה ברורה. ממליצה עליו בחום!\nאם לא מסתדר הרצאות, יש גם את ההקלטות של ניר קציר בדרייב שהן מטורפות, אבל ארוכות מאוד.\n\nשם המתרגל/ת: חצי סמסטר אורי וחצי סמסטר שני אלעד\nחוות דעת - תרגולים: שניהם מרצים מעולים! התרגולים סופר חשובים אפילו במידה מסוימת יותר מההרצאות. בתרגולים מדברים על התכלס ועוברים פעם נוספת על החומר שהיה בהרצאה, ופותרים תרגילים. אפשר לוותר על ההרצאות ולראות הקלטות אבל תרגולים ממליצה לכם להגיע.\n\nסדנה: וואלה, דיי מיותרת. ראיתי חלק מהסדנאות המוקלטות ובסוף נעזרתי במצגות שלהן וזה הספיק.\n\nשעורי הבית: הגדול אין ממש שיעורי בית בקורס, למעט הסימולציות. \nיש שאלונים פעם בשבועיים שנפתחים שהם ממש קלילים, איתם אין לחץ בכלל.\nלגבי הסימולציות- לא לדחות!!! הן (בעיקר הסימולציה הראשונה) לוקחות הרבה זמן!!! ואם זה לא נראה לכם, אז כנראה תעשו איזו טעות קטנה וייקח לכם נצח לדבג אותה. אז, תתחילו אותן כמה שיותר מהר, בעיקר כי הן בסוף הסמסטר כשמתחיל להיות לחץ של מבחנים והגשות.\n\nהמבחן: בחני האמצע היו דיי קלים, כן צורכים למידה לפני אבל לא משהו גרנדיוזי. גם היו פקטורים מטורפים.\nכותבת את זה לפני המבחן הסופי, מקווה שיהיה טוב :)\n\nהשורה התחתונה: קורס מעניין מאוד ושווה את ההשקעה, הוא לא קל מאוד אז לא להיות שאננים!", "timestamp": 1690233649995}, {"author": "A", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ארבע שעות רצופות זה ממש קשוח, וזה גם בסוף היום כשכבר עייפים, אבל לפחות הוא זורק בדיחות וכאלה אז זה קצת יותר מעניין. ראיתי כמה דקות מהרצאה של ראובן והיה משעמם למות. כבר עדיף ארבע שעות עם ניר...\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: מתרגל מדהים!!! מומלץ בחום\n\nשעורי הבית: ארוכים ומפרכים, אבל יש רפרנסים. אנחנו החלטנו לפתור בעצמנו אבל בדקנו את התשובות שלנו עם הרפרנסים אחר כך.\n\nהמבחן: אמריקאי, לא היה קל אבל היה תואם לרמה של הקורס, לא היו הפתעות מיוחדות\n\nהשורה התחתונה: קורס די משעמם בעיניי וגם לא קל בכלל ודי עמוס, אבל קורס חובה וזה מה יש", "timestamp": 1690728632876}, {"author": "מעריץ של הסופר", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר קציר / ראובן מקולט\nחוות דעת - הרצאות: \nאם בא לכם חוויה וצחוקים מוזרים ולא אכפת לכם השעה והאורך, לכו לניר. \n\nאם בא לכם ללמוד בשעיות נורמליות, תצפו בראובן. הוא גם טוב!\n\nשם המתרגל/ת: זיו ניסים / אלעד הדר מוקלט\nחוות דעת - תרגולים: \nמהחוויה שלי ומחברים כל המתרגלים פשוט טובים אז תבחרו מה שמתאים לכם בלוז.\n\nשעורי הבית: \nפתירים\n\nהמבחן: \nהוגן\n\nהשורה התחתונה: \nלא לחשוש לראות את ראובן, מה שחשוב בסוף זה התרגולים", "timestamp": 1691080496947}, {"author": "*", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nסופר בקיא בחומר ורואים שזה מעניין אותו. מסביר מעולה ותמיד יודע לענות על שאלות. אני ממש נהניתי בהרצאות שלו.\n\nשם המתרגל/ת: אורי ליניאל ואז אלעד הדר (החליפו באמצע הסמסטר)\nחוות דעת - תרגולים: \nשניהם מתרגלים מעולים, רואים שהם כבר עם הרבה נסיון והם סופר על החומר ומסבירים אותו טוב. במיוחד אלעד, באמת שהוא תותח.\n\nשעורי הבית: \nיש quizים קטנים במודל שלוקחים כלום זמן. יש תרגילים יבשים לא להגשה אבל אם יש לכם זמן לדעתי זה כדאי להסתכל עליהם. רוב העבודה זה על הסימולציות הרטובות, כדאי להתחיל הרבה מראש ולבדוק אותן עם טסטים.\n\nהמבחן: \nהיו שני בחני אמצע יחסית קלים שהמטרה שלהם זה להיות מגן והסגל גם סופר פרגנו עם פקטורים ענקיים כדי שהרוב יקבלו 100.\nהמבחן עצמו אמריקאי ויש הרבה נקודות קטנות ופרטים שאפשר ליפול עליהם, לדעתי הדרך הכי טובה להצליח היא לטחון מבחני עבר.\n\nהשורה התחתונה: \nחומר מעניין וקל יחסית לקורסים אחרים, סגל ממש חמוד ומנוסה, אחלה קורס סך הכל :)", "timestamp": 1691508032428}, {"author": "***", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  הקלטות \nחוות דעת - הרצאות:  ההרצאות המקלטות טובות מאוד, וגם אם ההרצאות פחות חשובות בקורס מהתרגולים מאוד מומלץ לעבור על ההרצאות או על המצגות, זה עוזר בהבנה יותר עמוקה \n\nשם המתרגל/ת: ניר \nחוות דעת - תרגולים: ניר מתרגל מעולה! תמיד מסביר הדברים בצורה פשוטה וברורה ואין לא בעיה לחזור ולהסביר עוד אם היה משהו לא ברור, וגם נותן טיפים חשובים, מומלץץץץץ \n\nשעורי הבית: יש 3 סימולציות \nצריכות השקעה וחשיבה, אבל ניתן לגמרי\n\nהמבחן: המבחן לא פשוט וצריך למידה מסודרת ולפעמים הבנה של פרטים קטנים, אבל יש מגן מאוד טוב מתרגלי הבית והבוחן אז הכול מסתדר בסוף \n\nהשורה התחתונה:", "timestamp": 1691655467527}, {"author": "טור מספרים מתבדר", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: \nבעל חוש הומור ומשרה אווירה טובה בכיתה.\nכנראה האדם היחיד שמצליח להעביר 4 שעות הרצאה ברצף, ואיכשהו עדיין כולם בסדר עם זה.\n\nאוהב לענות לשאלות ומסביר את החומר בצורה לא רעה.\n\nדבר אחד שלא אהבתי בהוראה שלו, היא שהוא הרבה פעמים מפתח בכוונה כיווני מחשבה לא טובים ואז ״צוחק עליהם״ או מפריך אותם.\n\nמצאתי שזה ממש ערער אותי בחלק מההרצאות וגרם לי להרגיש שלא הבנתי את החומר.\n\nבכל מקרה, כמו הפרלמנט בבודפשט או מופע סטנדאפ של שחר חסון,\nמדובר באטרקציה שצריך ללכת אליה לפחות פעם אחת.\n\nשם המתרגל/ת: אורי ליניאל (מוקלט)\nחוות דעת - תרגולים: \n\nאין הרבה מילים רעות להגיד. ניכר שהוא מבין את החומר בצורה טובה ונוגע בהרבה נקודות חשובות.\n\nמהנסיון שלי עם כמה מתרגלים אחרים שהלכתי אליהם הסמסטר, רובם לא כל כך מגיעים לרמה שלו מבחינת רמת הפירוט והשליטה בחומר, אז ממליץ בחום להשתמש בהן (או ללכת אליו פרונטלי!)\n\nשעורי הבית: בגדול משחקים קצת עם קוד ב-Verilog שאמור לתאר תכן לוגי ומתכננים כל מיני מבנים (+ מיני יבש שרושמים בו מה עשיתם ומצרפים כמה גרפים מ-ModelSim).\n\nדי חיבבתי את הקונספט. זכיתי להכיר צורת חשיבה שלא הכרתי קודם, וגם היה כיף לראות הרבה מהעקרונות (שלרוב מיוצגים רק בתור טבלת אמת או ציור במחברת) באים לידי ביטוי בקוד שרץ על המחשב.\nגם מתעסקים טיפה במכונות מצבים, שזה תמיד טוב.\n\nיש גם שאלות אמריקאיות ב-moodle שצריך לענות עליהן כל שבוע.\nלדעתי קצת מיותר אבל שיהיה.\n\nהמבחן: בקורס בסמסטר אביב יש שני בחני אמצע בנוסף למבחן.\nלדעתי, תיקחו מאוד ברצינות את בחני האמצע בקורס.\nזה קורס עם הרבה חומר, וזאת הזדמנות אמיתית לפתח קצת זיכרון שרירים ולהיכנס לעומק של נושאים שאתם הולכים לא לתרגל הרבה זמן (לפחות עד למבחן).\n\nהמבחן עצמו הסמסטר היה קצת מוזר והיו בו דברים שלא הופיעו כל כך בסמסטרים קודמים.\nבכל מקרה יצאתי ממנו איכשהו בזול.\n\nהשורה התחתונה: קורס שלדעתי הוא מאוד מעניין, למרות שלפעמים קצת לא ברור למה צריך שסטודנט למדמ״ח ילמד את כל זה.\n\nבכל מקרה אין לכם יותר מדי ברירה xD", "timestamp": 1692800472179}, {"author": "pipeline", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: מרצה מעולה וממש נחמד.\n\nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: אחד המתרגלים הכי טובים שלמדתי אצלם. מסביר את החומר בצורה ברורה ונותן טיפים לפתרון שאלות ממבחנים. מומלץ ביותר!\n\nשעורי הבית: יש 3 תרגילים רטובים ושני בחני אמצע קצרים. סה\"כ 45% מגן שכולם מקבלים. \n\nהמבחן: המבחן קצת טריקי, צריך לתרגל הרבה מבחנים לפני כדי לקבל ציון טוב. \n\nהשורה התחתונה: החומר מעניין אבל הקורס דורש השקעה.", "timestamp": 1693313847276}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר קציר הקלטות\nחוות דעת - הרצאות: בתכלס כן אפשר לוותר על ההרצאות ולראות רק תרגולים - אבל אם יש זמן ואתם מתעניינים בחומר אז הייתי ממליץ כן לראות גם את ההרצאות כי זה מאוד העשיר אותי וגם נתן לי בסיס טוב לקראת ה\"למידה האמיתית\" שהיא בתרגולים. כששמעתי בתרגול כבר פעם שנייה את החומר אז הבנתי הרבה יותר טוב.\n\nשם המתרגל/ת: אלעד הדר הקלטות\nחוות דעת - תרגולים: מתרגל סבבה לגמריי. הייתי ממליץ לראות אותו למי שאוהב מוקלט.\n\nשעורי הבית: מוזרים.. לא קשורים למבחן למעט שאלה 1 בכל מועד (ששווה 5 נקודות).\n\nהשורה התחתונה: אני אהבתי את החומר ולהבין איך המעבדים שהציגו לנו עובדים. קורס לדעתי שיכול להיות כיפי אם באמת מתעניינים בו.", "timestamp": 1695924025551}, {"author": "גיא ריס", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הקלטות של ניר קציר\nחוות דעת - הרצאות: אני מאוד אהבתי את ההקלטות, ההסברים היו מצוינים ובעיקר אפשר לפצל לחלקים כי כל הרצאה היא בסביבות 3-4 שעות. החומר עצמו מאוד מעניין.\n\nשם המתרגל/ת: איתמר יקותיאל\nחוות דעת - תרגולים: התרגולים עם איתמר היו ממש מהנים, כל הכיתה השתתפה והוא נתן המון מקום לשאול שאלות ולהיות אקטיבי. אני מאוד ממליץ\n\nשעורי הבית: \nהסימולציות אחלה אבל דורשות הרבה זמן. והשאלות השבועיות כל מטרתן היא לבדוק שאתה זוכר שהן קיימות(אז בתור אחד שפספס הרבה ממליץ לשים איזו תזכורת).\nהמבחן: \nהשורה התחתונה:", "timestamp": 1696342139925}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: פחות אהבתי אבל בסדר\n\nשם המתרגל/ת: זיו נסים\nחוות דעת - תרגולים: גבר על. ממליץ ממש אבל צה״ל גנבו לנו אותו.\n\nשעורי הבית: אין חובה לתרגילי הבית היבשים, וזה הדבר הכי גרוע ששמעתי עליו. אפילו לאלו שמשקיעים וכן עושים אותם, התרגילים האלו די גרועים ולא משקפים מה שיהיה במבחן וגם אין אף אחד שיבדוק אותם וייתן עליהם משוב.\nמבקש מצוות הקורס לשנות את זה בהקדם ולהפוך את היבשים לחובה, או לכל הפחות להכין יבשים חדשים ומוצלחים יותר (לא 4 גליונות אלא 13 ועם שאלות אמיתיות).\n\nהמבחן: המבחן הכי מכשיל שנתקלתי בו (אולי חוץ מבמעגלים חשמליים). כמעט ולא בוחן את הבנת החומר אלא הבנת הנקרא. אני שונא מבחנים אמריקאיים בלי קשר, אבל זו הייתה רמה אחרת.\n\nהשורה התחתונה: קיוויתי ללמוד בקורס הזה איך המחשב עובד, זה לא קרה.", "timestamp": 1697091690331}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ניר -מוקלט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: זאב אברהם\nחוות דעת - תרגולים: מתרגל מצויין מסביר את החומר בצורה טובה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1697366011657}, {"author": "שוסי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nמרצה די משעמם ומרדים. רוב הסטודנטים הלכו למרצה האחר. באופן כללי לא אהבתי את ההרצאות. למרות שהחומר מעניין הרוב לא רלוונטי למבחן ולא עוזר ששחר לוקח אותו כמובן מאליו ולא מסביר יותר מדי.\n\nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: \nאהבתי מאוד. מסביר טוב ודואג שכולם יבינו. תמיד עונה על שאלות והוא אפילו שלח לנו שאלות תרגול נוספות ועשה תרגול נוסף לפני מועד א. ממליץ בחום.\n\nשעורי הבית: \nהשיעורים העיקריים בקורס זה 4 תרגילים בורילוג שמהוים גם 27 אחוז תקף ככה שכדאי להשקיע. בעיקרון התרגילים בנויים לזוג אבל אפשרי לעשות לבד (מבחינת עומס). התרגילים אורכים מאוד ולוקחים זמן אך עם זאת מעניינים מאוד ורואים את הפרקטיקה של החומר. חבל רק שבסוף רק 5 נקודות מהמבחן קשורות לשיעורי בית. מרגישים מנותקים מהקורס.\n\nהמבחן: \nהיו שני בחני אמצע שסגל הקורס דאג משום מה להביא פקטורים פסיכיים כדי שיהיה חציון 100. לא הייתי דואג מהם יותר מדי.\nלמועד א לא ניגשתי. מועד ב הכיל הרבה שאלות דומות ממש למבחני עבר אך עם זאת היו כמה שאלות יצירתיות. מי שמתרגל מלא מבחני עבר יראה פחות או יותר את כל סוגי השאלות וככל הנראה יקבל ציון טוב.\n\nהשורה התחתונה: חומר הקורס מעניין מאוד לדעתי. חבל שההרצאות לא רלוונטיות ושתרגילי הבית מנותקים מהמבחן, וחבל שרוב המבחן אמריקאי ככה שמי שיודע את החומר יכול לקבל ציון נמוך עדיין. אך עם זאת, אהבתי.", "timestamp": 1704226055718}, {"author": "עדן", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ארוך, אבל אפשרי. מה שעוזר לכם להתרכז (לסכם, לשאול שאלות, לעיין במצגת לפני) - תעשו את זה. לא הכל מרגיש רלוונטי, התרגולים יותר מתומצתים אבל זה עוזר לבנות בסיס.\n\nשם המתרגל/ת: מיכאל/איתמר\nחוות דעת - תרגולים: מצוינים, לא לפספס, שווה את זה. אם מבינים את התרגולים טוב, הלמידה למבחן הולכת חלק.\n\nשעורי הבית: הסדנאות עוזרות עם כתיבת הסימולציות (יש גם מוקלטות, אותו דבר), בגלל שזה פשוט ממליצה לא לחפף. היבשים גם נקודות טובות למגן אמריקאי פשוט.\n\nהמבחן: מועד ב מאוחר, הוגן - הרבה אמריקאיות ומספר שאלות פתוחות. לתרגל הרבה בחינות ולא ליפול בניסוח (אין הרבה הטעיות בכלל לטעמי) , \n\nהשורה התחתונה: קורס עם הרבה חומר אבל פשוט עם הרבה חומר בסיס לעתיד, בהצלחה.\nממליצה לעבוד עם סיכומים כי יש הרבה מושגים חדשים ושיטות חדשות.", "timestamp": 1704622857576}, {"author": "alon shorr", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות:  קשוח 4 שעות ברצף, אבל אין על ניר. משתדל להשאיר אותנו בלופ עם הרבה בדיחות וקלילות, מעביר את החומר בצורה מאוד טובה ומאוד שמח להישאר אחרי ההרצאות לשאלות של סטודנטים. סך הכל אם תצליחו לעמוד ב4 שעות ברצף (ולא לפרוש להקלטות), לדעתי ממש כדאי ומוצלח. אם מראש יודעים שיהיה לכם קשה ללמוד בשעות שהוא מלמד, עדיף לנסות משהו אחר.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: בן אדם תותח, מסביר מעולה וממש עושה סדר בדברים. מעביר את הדברים בצורה מעניינת ועונה על שאלות ממש טוב. מתמקד בתכלס.\n\nשעורי הבית: סבירים אבל הסימולציות יכולות קצת לחפור. יתרון ענק זה המגן הממש גדול לציון שהן נותנות. שווה להשקיע ולהוציא בהן ציונים טובים.\n\nהמבחן: 17 שאלות אמריקאיות מרגישות כמו למלא לוטו. קצת קשוח במסגרת הזמנים של המבחן. גם מבחינת ניקוד הוא יורד די מהר בגלל שהכל אמריקאי, אז יכול להיות קצת קשוח. אבל ביחד עם המגן הענק מהסימולציות והבחנים אפשר להוציא ציון לא רע בכלל עם קצת השקעה.\n\nהשורה התחתונה: קורס מומלץ, לא שיש לכם ברירה אם אתם לומדים הנדסת חשמל.. בהצלחה!", "timestamp": 1704705018307}, {"author": "ייט", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  ניר קציר\nחוות דעת - הרצאות: 4 שעות ארוכות ברמה לא מוסברת אבל לקראת אמצע הסמסטר ניסה להמעיט בשעה האחרונה אם בכלל הייתה.\nבכללי מצחיק ויודע להשאיר את הכיתה בקצב\n\nשם המתרגל/ת: סילברסטין נעמי\nחוות דעת - תרגולים: הלכתי לתרגול אחד שלה עד עכשיו והיא תותחית על, מסבירה את החומר פיקס ובקושי משאירה מקום לשאלות.\n\nשעורי הבית: יבשים לא להגשה, סימולציות יחסית ארוכות אז מומלץ להשקיע מהיום הראשון לפחות במחשבה על הפתרון ואחרי זה לממש.\n\nהמבחן: לא היה לנו עדיין אמן רחמו עלינו\n\nהשורה התחתונה: 010101010101010101010101", "timestamp": 1711032090715}, {"author": "Yuval Maltsev", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: הרצאות פרונטליות לא כל כך מעניינות אבל זאת אחלה אופציה למי שרוצה. ההקלטות של ניר קציר מעולות.\n\nשם המתרגל/ת: קריחלי תומר\nחוות דעת - תרגולים: מתרגל מצוין\n\nשעורי הבית: השאלונים במודל מאוד נחמדים, רובם טריוויאלים אם רואים את ההרצאות. השיעורי בית הרטובים שואבים יותר זמן, לקח לי ולשותף ביחד כ10 שעות עבודה כל מטלה.\n\nהמבחן: \n\nהשורה התחתונה: קורס נחמד, מעניין מאוד.", "timestamp": 1713294394087}, {"author": "pipeline", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ניר מעביר את החומר בצורה טובה אבל 4 שעות פרונטליות זה יותר מדי והמוקלט שלו מספיק טוב אז עדיף מוקלט על 1.5\n\nשם המתרגל/ת: מארון מוקלט + אורי מוקלט (לפני המבחן)\nחוות דעת - תרגולים: מארון מסביר ברור והאיכות של ההקלטות טובה\nאורי פותר שאלות ממבחנים ונותן כל מיני טריקים ולכן מומלץ לראות תוך כדי חזרה על החומר לקראת המבחן (אם יש זמן)\n\nשעורי הבית: יבשים לא עשיתי \nרטובים לוקחים קצת זמן (אבל לא יותר מיום) ובסוף מקבלים 40% אז שווה את הזמן\n\nהמבחן: לא הכי קשה אבל לדעתי שלנו (מועד א') היה מבלבל וניסוח השאלות טריקי ברמות אבל סה\"כ סביר\n\nהשורה התחתונה: קורס נחמד, עצה אחת היא לשים דגש על ההרצאות האחרונות בנושא מעבדים", "timestamp": 1714598283253}, {"author": "SM", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: ההרצאות קשוחות (ארבע שעות רצופות) אבל ניר מעביר אותן מאוד מעניין. הוא מצחיק ומשתדל לערב כמה שיותר את הסטודנטים בזמן ההרצאות. לקראת סוף הסמסטר ההרצאות מתקצרות ונהיות פחות נוראיות מבחינת זמן.\n\nשם המתרגל/ת: תומר קריחלי\nחוות דעת - תרגולים: תומר מתרגל מצוין והצליח להעביר את החומר ממש טוב.\n\nשעורי הבית: 12 ״בחנים״ קצרצרים ושלוש סימולציות לא מאוד קשות, בסדנאות מלמדים את החומר בשביל לפתור אותן. בנוסף יש תרגילים יבשים לא להגשה שגם לא נבדקים.\n\nהמבחן: לא פשוט בכלל, בגלל שהוא כמעט כולו אמריקאי ותשובות סופיות בלבד ללא נימוק קל מאוד לטעות בדברים מאוד קטנים ולאבד את כל הנקודות על השאלה. השאלות עצמן לא מאוד קשות, יחסית חזרתיות ופתירות לגמרי אבל קל מאוד ליפול בהן על שטויות. אחרי משהו כמו 5 מבחנים אפשר לומר שאפשר לכסות את כל מה שאפשר לתת במבחן אבל חשוב לתרגל הרבה כדי להבין את השטיקים והדברים שקל ליפול בהם. בכל מקרה הציון של הסימולציות והבחנים הוא מאוד משמעותי (בערך 40%) אז אפשר להוציא ציון טוב בקורס גם בלי לקבל ציון מאוד גבוה בבחינה עצמה.\n\nהשורה התחתונה: אחלה קורס, הרבה נק״ז אז משפיע מאוד על הממוצע. יש נושאים מאוד נחמדים ומעניינים.", "timestamp": 1714750002514}, {"author": "המדמחיסט", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דר. ניר קציר\nחוות דעת - הרצאות: \nהמרצה הכי טוב שזכיתי להיות נוכח בהרצאות שלו. בדרך כלל ההרצאות הן 4 שעות ברצף, אל תתנו לזה להרתיע אותכם (לפעמים מסיימים שעה מוקדם). ההרצאות עוברות בכיף ובאווירה קלילה, ואת האמת הן עוברות מהר יותר מהרצאות אחרות של שעתיים שהייתי בהן. ניר מספר בדיחות, קורא לאנשים ללוח, ומעביר את החומר הכי מעניין שראיתי בהרצאה. אם ניר מעביר הרצאות בסמסטר שלכם ואתם לא הולכים אליו, המצב לא תקין.\n\nשם המתרגל/ת: מר אבו אחמד ואו גלאל\nחוות דעת - תרגולים: \nמתרגל טוב סה\"כ, עונה לשאלות ומסביר טוב.\n\nשעורי הבית: \n3 תרגילי בית (הסגל קורא להם סימולציות), תרגילים לא קשים מדי ולא קלים מדי, והייתי אומר אפילו קצת מעניינים. יש רק 3  סימולציות (לא כולל סימולציה 0 שזה עבודה של חצי שעה) וההגשה בזוגות אז אין הרבה עומס בכלל ויש זמן לקורסים אחרים. יש גם כל שבוע \"בחן\" שזה תכלס 3-4 שאלות אמריקאיות במודל ויש 2 ניסיונות, אפשר לסיים כל בחן בהפסקה בין הרצאות.\n\nהמבחן: \nמבחן לא קל, אבל לא קשה מדי. אם לומדים טוב אפשר להוציא ציון טוב, במיוחד בהתחשב בעובדה שיש מגן של כמעט 50%.\n\nהשורה התחתונה: \nהקורס הכי מעניין שהיה לי עד כה. מתחילים ברמה של שערים לוגיים ולומדים איך מהם בונים מעבד מודרני ואיך מתרגמים אסמבלי לפעולות במעבד. הקורס לא קשה ולא עמוס.", "timestamp": 1715162037092}, {"author": "סטודנט Pipeline עם Forwarding מלא", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לא\nחוות דעת - הרצאות: הלכתי לכמה הרצאות של ראובן וראיתי כמה מוקלטות של ניר ולא מצאתי בהן ערך. באמת ובתמים נרדמתי. גם הסמסטר אמרו ש\"בהרצאות יהיה חומר שלא יופיע בתרגולים\" ועדיין הבנתי את כל החומר רק מהתרגולים\n\nשם המתרגל/ת: ניר אלפסי / אמנון סטניסלבסקי\nחוות דעת - תרגולים: שניהם מתרגלים טובים, התרגולים זה בערך הדבר היחיד שצריך בקורס הזה.\n\nשם המסדנת/ת: יואב גולד\nחוות דעת - סדנאות: אחלה מסדנת, הסביר את החומר בצורה קלילה עם בדיחות פה ושם, דאג שכולם עוקבים אחרי מה שקורה ונתן טיפים לאיך לגשת לשאלות. \n\nשעורי הבית: השאלונים השבועיים בדיחה.\nהסימולציות לוקחות יותר זמן ממה שאתם מצפים אבל הן לא קשות במיוחד. \n\nהמבחן: ספציפית הסמסטר היה מבחן מאוד קשה לדעתי, וזה התבטא בפקטור של 7 נקודות. רוב השאלות נורא קלות ופשוט דורשות עבודה. השאלות הקשות בדרך כלל קשות מאוד לדעתי. מבחן שהוא 70% אמריקאי זה אכן מבאס אבל זה מה יש ועם זה מנצחים.\n\nהשורה התחתונה: החומר של הקורס מדהים וכיפי, פשוט המבנה של הקורס והבחינה עקומים. המון זמן הולך על מושגים שנראים אקראיים שבסוף חלקם מתחברים יחד וחלקם נשכחים בצד. שבועות 7-9 מבאסים אבל צריך לעבור אותם.", "timestamp": 1715166424901}, {"author": "OG", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר קציר (מוקלט)\nחוות דעת - הרצאות: \nאחלה מרצה, מובן גם בX2\nשם המתרגל/ת: נעמי סילברסטין\nחוות דעת - תרגולים: \nמקסימה!!\nשעורי הבית: \nהסמסטר לא הייתה חובת הגשה ליבשים, בחנים ממוחזרים במתנה כל שבוע (10% תקף)\nסימולציות די קשות וארוכות אבל סך הכל לא נוראיות (וגם ממוחזרות לגמרי)\nהמבחן: \n70% אמריקאי זה מתכון לאסון, המועד הזה היה טיפה יותר קשוח מאחרים אבל עדיין לא נורא בכלל\nהשורה התחתונה: \nקורס חשוב ומעניין (במיוחד למהנדסי חשמל) ממליץ להשקיע במהלך הסמסטר ואז זורם במבחנים", "timestamp": 1715258224999}, {"author": "Kaufman", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר\nחוות דעת - הרצאות:  הרצאות טובות אבל ארוכות מאוד לא תמיד מבינים הכול\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  מבינים את החומר של ההרצאות בתרגולים\n\n\nהמבחן: לא פשוט אין מספיק זמן לענות על הכול  \n\nהשורה התחתונה:  מי שרוצה לקחת את הקורס כבחירה מאוד מומלץ להרחבת אופקים וראייה שונה של איך המחשב עובד", "timestamp": 1715697177870}, {"author": "~", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר קציר\nחוות דעת - הרצאות: \nמעניינות, קצת מגזים עם הבדיחות לפעמים אבל מעביר את החומר בצורה טובה.\n\nשם המתרגל/ת: ג'לאל\nחוות דעת - תרגולים: \nמתרגל מצוין, שולט בחומר ויודע להסביר את החומר בצורה מובנת וברורה.\n\nשעורי הבית: \n4 סימולציות, ממש לא קשוח, כמה שעות של עבודה ומסיימים כל אחת - סה\"כ לא דורש הרבה השקעה.\n\nהמבחן: \nהוגן, 14 שאלות אמריקאיות + 3 פתוחות, ממש הגיוני אם מבינים את החומר.\n\nהשורה התחתונה: \nממש אפשרי להוציא ציון גבוה בקורס + הציון מגן הוא איזה 40%, פשוט תהיו על החומר במהלך הסמסטר ואל תחכו לקגע האחרון ללמוד.", "timestamp": 1715887251982}, {"author": "bruh", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: קציר ניר\nחוות דעת - הרצאות: 4 שעות ובשעות אחה\"צ אבל עדיף מאשר לנסות להשלים עצמאית כי אף אחד לא ישלים את זה עצמאית (וניסיתי, כמה פעמים בסמסטר)\nאחלה מרצה בכל זאת\n\nשם המתרגל/ת: צחי עידן\nחוות דעת - תרגולים: לא מעביר את החומר בצורה מעניינת, עברתי להקלטות ולא חזרתי\n\nשעורי הבית: 4 סימולציות שזה בתכלס כתיבת קוד ואנליזה של הקוד עם דיאגרמות. חשוב להתחיל לעבוד על הסימולציות מוקדם ולא לדחות לרגע האחרון. אם כי דחיתי סימולציה אחת בנסיבות שלא בשליטתי וסיימתי אותה תוך 8 שעות. תסיקו מזה את מה שאתם צריכים.\nבנוסף יש חידונים שבועיים עם 2 שאלות אמריקאיות.\nסה\"כ 40% מגן קל\n\nהמבחן: 14 שאלות אמריקאיות ו3 שאלות פתוחות שהן בתכלס חישוביות/ הבנתיות. עם מספיק תרגול השאלות חוזרות על עצמן. בגלל שיש לסימולציות והשאלונים משקל יחסית גבוה אין סיבה לא לקבל ציון מעולה גם אם רק עוברים את המבחן.\n\nהשורה התחתונה: אחלה קורס בין הטובים שלקחתי הסמסטר", "timestamp": 1716572567851}, {"author": "עוד אחד", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לא יודע\nחוות דעת - הרצאות: לא ראיתי הרצאות בקורס. לא מרגיש שכתוצאה מכך ידעתי פחות או שלא הייתי מוכן למבחן.\n\nשם המתרגל/ת: מארון\nחוות דעת - תרגולים: בין התרגולים הטובים שראיתי. אמנם מלפני 5 שנים אבל רלוונטי לחלוטין וכיסה הכל אצלינו, הוא ברור מאוד וקשה לא להבין את החומר איתו.\n\nשעורי הבית: שאלונים קטנים אחת לשבוע שהמטרה שלהם היא לתת לכף ציון תקף קבוה יותר בסוף, ו3 סימולציות של כמה שעות. אני הרגשתי שהסימולציות היו מעניינות ודי כיפיות, ועזרו לי להבין יותר טוב את מה שלמדנו.\n\nהמבחן: מבחן של תשומת לב לפרטים. החומר לא קשה מדי אבל המבחן והלמידה אליו מתישה, כי צריך לדעת טוב טוב איפה נתון מסוים יכול להפיל את כל השאלה - וזה אמריקאי.\n\nהשורה התחתונה: אני אהבתי מאוד את הקורס, פחות את המבחן. שמח לדעת את מה שלמדנו והסגל טוב.", "timestamp": 1716884633649}, {"author": "gg", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  ניר קציר\nחוות דעת - הרצאות: \nהרצאות הלכתי רק חצי סמסטר בערך, בפועל גם זה כנראה היה מיותר\nנראה שהן סתם חופרות והקשר למבחן הוא בעיקר במאקרו ופחות תכלס.\nשם המתרגל/ת: תומר\nתותח מתרגל מצויין מסביר את החומר כמו שצריך ומלמד נהדר\nממליץ בחום\nחוות דעת - תרגולים: \nתרגולים חשובים הרבה יותר מההרצאות, אולי אפילו הדבר היחיד שחשוב בקורס הזה.\nשעורי הבית: \nהקוויזים השבועיים שטויות\nהסימולציות מרופרנסות לחלוטין וגם לא ארוכות יותר מידי.\nמה שכן במבחן יש שאלה אחת של ורילוג אז אולי כן כדאי להבין איך השפה עובדת ומה הרעיון מאחורי דברים(או להמר על 5 נקודות).\nהמבחן: \nטופס לוטו, החומר והשאלות לרוב לא קשות או מסובכות מידי אבל אפשר ליפול על מלא שטויות קטנות ולאבד הרבה נקודות בגלל זה, הסמסטר היה נראה שהם ממש רוצים שהמבחן יהיה מבלבל ומטעה(אבל בהתאם היה גם פקטור), ממליץ להגיע מרוכזים ובמהלך הלמידה אליו לתרגל כמה שיותר ולשים דגש על דיוק בפתרון.\nהשורה התחתונה: ברגע שמפסיקים לבוא להרצאות ממש לא מרגיש קורס של 5 נקז ואפשר להוציא בו ציון פגז בכיף. בוסט משמעותי לממוצע אם מצליחים במבחן.", "timestamp": 1718040503923}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ראובן (מוקלט)\nחוות דעת - הרצאות: ראובן מעביר את החומר בצורה הכי משעממת שאפשר, ובנוסף הוא דוחף בכל משפט כמה שיותר מושגים גם אם הוא הגדיר אותם לפני דקה ועדיין לא ברור לגמרי מה הם אומרים. למרות שזה מרגיש שאפשר לוותר על ההרצאות, אני ממליץ שלא (אלא אם כן יש לכם רקע בתחום). בנוסף ממליץ על ההקלטות של ניר קציר ולא של ראובן.\n\nשם המתרגל/ת: מארון (מוקלט)\nחוות דעת - תרגולים: כנראה יותר טוב מכל האופציות הפרונטליות. הוא מסביר סבבה סה\"כ, אבל עד שלא תפתרו שאלות ממבחנים כנראה שהרבה ניואנסים שמוזכרים בתרגול יעברו לכם מעל הראש ועד הבחינה תשכחו אותם. בכל מקרה אסור לוותר על התרגולים כי זה עיקר הלמידה בקורס, אז כדאי להבין מה הולך בהם וגם לחזור עליהם טוב לפני המבחן.\n\nשעורי הבית: היו בחנים שבועיים כאלה במודל, לוקח כמה דקות בודדות לעשות אותם וזה תקף. בנוסף היו 4 סימולציות. הן מתמקדות בכל מה שלא חשוב בקורס, ולא עוזרות בכלל להבין את החומר וגם לא מכינות למבחן. מומלץ לרפרנס ובזמן שחסכתם תתחילו לפתור מבחנים. אם החלטתם בכל זאת לעשות אותן, אז הן לא מאוד ארוכות אבל כן בסופו של דבר שורפות כמה שעות טובות.\n\nהמבחן: ביזיון אחד גדול. המבחן בנוי קודם כל כדי שלסגל הקורס יהיה קל בבדיקה, ובפעם הראשונה בטכניון הרגשתי שמנסים להכשיל אותי. 14 שאלות אמריקאיות + 3 שאלות \"פתוחות\" (פשוט כותבים תשובה סופית). כל שאלה אמריקאית שווה 5 נקודות, אבל זה לא מפריע לסגל לכתוב שאלות עמוסות במלל שלפעמים מתפרסות על עמוד או יותר. בנוסף הרבה מהשאלות מכילות כל מני חישובים קטנים שקל מאוד להתבלבל בהם. הרבה ניסוחים מבלבלים, מה שהופך את המבחן לבחינה בהבנת הנקרא ואפשר לאבד המון נקודות כי הלכתם לאיבוד בסיפורי אלף לילה ולילה שמספרים בשאלה. הדרך היחידה להצליח במבחן הזה היא לתרגל המון מבחנים ובמקביל לעבור שוב על התרגולים כי הם מסתמכים עליהם. בסוף המבחן תבדקו טוב טוב כל שאלה, גם את השאלות הפתוחות, כי אפשר לאבד את כל הנקודות על טעות חישוב.\n\nהשורה התחתונה: קורס גרוע, מנסים לדחוף המון חומר ובמקביל לרדת לרזולוציות הזויות. רמת הוראה נמוכה. אולי עבור אנשים שיש להם קצת רקע בתחום זה קורס סבבה, אבל אם לא אז זה כנראה יהיה קורס סיוט (אפילו שבמהלך הסמסטר הוא לא עמוס, זאת אשליה וזה יתפוס אתכם במבחן). אל תזלזלו וגם תנסו לא להתייחס יותר מדי למי שמהלל את הקורס הזה.", "timestamp": 1718041344990}, {"author": "פופו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ניר קציר מוקלט \nחוות דעת - הרצאות:  תנחומיי למי שצריך לעבור 4 שעות ברצף עם ניר שחושב שלמישהו מהסטודנטים יש כוח לשמוע את הבדיחות הציניות שלו. (הוא עדיין עדיף על אחרים)\n\nשם המתרגל/ת: מרון מוקלט \\אורי כיתה הפוכה\nחוות דעת - תרגולים: צמד מנצח בשביל להבין את החומר\n\nשעורי הבית: שאלוני מודל בדיחה פעם בשבוע, 3 סימולציות בsystem verilog עמוסות וממש ממש לא ברורות בהתחלה, מציע לא לרפרנס כי לי הן עזרו להבין את החומר.\n\nהמבחן: בדרך כלל המבחנים סבבה, עמוס וצריך לתרגל מספיק מבחנים כדי להספיק לסיים את כולו אבל לגמרי אפשרי. אבל אצלנו מי שכתב את המבחן החליט לחרבן עלינו. מועד א ממוצע 59 לפני פקטור (בין 10 ל20 נקודות הבדל מסמסטרים אחרים) מועד ב עוד יותר מסריח, הרגיש כאילו מנסים בכוח להכשיל את מי שניגש. חבל כי זה קורס שיכול להיות ממש נחמד ומלמד ממש.\n\nהשורה התחתונה: פוטנציאל טוב ביצוע עלוב", "timestamp": 1719004085038}]}