{"posts": [{"author": "אהרון", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אדם\nחוות דעת - הרצאות:  מונוטוני ומשעמם\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nארז על הפנים\n\nשעורי הבית: \n\nהמבחן: \nפיקטרו את הצורה\nהשורה התחתונה:", "timestamp": 1597774496471}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: מרצה תותח, מסביר את החומר מעולה.\n\nשם המתרגל/ת: עביר חואלד\nחוות דעת - תרגולים: מתרגלת טובה, באופן כללי התרגולים בקורס הזה חשובים מאוד וחובה להיות על החומר כדי להבין אותם.\n\nשעורי הבית: עמוסים. שלושה רטובים, יבש כל שבוע. היבשים ברובם ממוחזרים, חשובים וכדאי לפתור אותם. הרטובים לא קשים אבל ארוכים.\n\nהמבחן: היה קשה מאוד והיה פקטור. כדאי מאוד להצליח גם בבוחן אמצע (אצלנו הוא היה מגן, בד\"כ הוא תקף) - שווה להשקיע את הלמידה בו כי הוא לא מאוד קשה ונותן אחלה מגן.\n\nהשורה התחתונה: קורס עמוס ולא פשוט, אבל בסופו של דבר מעניין.", "timestamp": 1597830541836}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה:  גל בן דוד\nחוות דעת - הרצאות:  ההרצאות שלו מהיוטיוב מעולות, החומר מוסבר טוב ואפילו ביתר פירוט \n\nשם המתרגל/ת:  עביר \nחוות דעת - תרגולים:  התרגולים אצלה לא היו עמוסים באנשים, היא תמיד הספיקה לעבור על כל התרגולים ולענות על כל השאלות.\n\nשעורי הבית:  שיעורי בית יחסית עמוסים, היו הרבה גיליונות והם לא קצרים. אמנם לקראת סוף הסמסטר השיעורים נעשו קצרים יותר.\n\nהמבחן:  מבחן לא פשוט בכלל, ודורש הבנה טובה של החומר מההרצאות. אם זאת לאחר תרגול מספיק, השאלות דיי טכניות וניתן להצליח בו.\n\nהשורה התחתונה:  קורס מעניין, אך עמוס.", "timestamp": 1597932724748}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: \nגל הקליט והעלה את כל ההרצאות ליוטיוב, עשויות טוב שווה צפייה (על 1.5)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי בית שיכולים להיות מאוד מעניינים אבל גם מאוד עמוסים. שווה להתחיל מוקדם לדעתי\n\nהמבחן: \n\nהשורה התחתונה: לא מל\"ג מומלץ אבל לחלוטין קורס מעניין. עמוס אבל במידה", "timestamp": 1598176317794}, {"author": "Omer", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אדם שוורץ\nחוות דעת - הרצאות: \nהקורס עצמו מעניין מאוד לדעתי, הוא בהחלט בסיס חשוב למקצוע.\nההרצאות ברובן מעניינות.\n\nפלייליסט שלם של כל הסיכום של \"בפרקים הקודמים\" מההרצאות של אדם (חזרה של כמה דקות שאמורה לקשר את הכיתה להרצאה של היום).\nזה די נוח כי יש 4 שעות שבועיות ולא נראה לי שלמישהו יש זמן לראות את הכל.\n\nמוזמנים להעזר בסרטונים ולהוסיף תגיות והערות כך שיעזרו לאנשים אחרים למצוא נושאים ספציפיים מתוך הסרטונים.\n\nhttps://www.youtube.com/playlist?list=PLTBLOvkfAOMVOcRmnz_o-OHmOWWJb6HXy\n\nזה לא מספיק במקום ההרצאות, אבל זה טוב למועד ב'.\n\nשם המתרגל/ת: רועי רונן\nחוות דעת - תרגולים: \nרועי מתרגל מעולה, מסביר מצויין ומנהל טוב את השיעורים..\n\nשעורי הבית: \nעמוסים, אבל ברובם רלוונטיים.\n\nהמבחן: \nסמסטר קורונה - הגזימו עלינו חבל על הזמן. דגב\"ד דפק מבחן לא סביר בכלל.\n\nהשורה התחתונה: \nקורס חובה, אין לכם הרבה ברירה, אבל הוא לא בהחלט לא מהקורסים הנוראיים של התואר.", "timestamp": 1600421970650}, {"author": "R", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: מומלץ!!!\n\nשם המתרגל/ת: רועי רונן\nחוות דעת - תרגולים: מתרגל מצוין!!\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס כיף שמלמד המון", "timestamp": 1600945834772}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גל בן-דוד\nחוות דעת - הרצאות: מקצוען ומבין היטב את מה שהוא מלמד אך לעיתים ניכר שהוא מסביר קצת מהר.\n\nשם המתרגל/ת: ארז שלו, רון זיו, עידו כהן\nחוות דעת - תרגולים: התרגולים היו מוקלטים, לרוב באיכות לא הכי טובה. חוץ מזה, מסבירים לא רע.\n\nשיעורי הבית: כל שבוע יש תרגיל מוכנות ותרגיל בית יבש ובנוסף יש שלושה תרגילי MATLAB בסמסטר. התרגילים היבשים כוללים שאלות ממבחנים בעיקר - כדאי מאוד לפתור גם את אלו שלא חייבים להגיש. התרגילים ב-MATLAB מביאים התנסות נחמדה בתוכנה אך הם נוטים להיות לא מובנים\n\nהמבחן: ארבע שאלות פתוחות מרובות סעיפים - שונה מהמתכונת של הסמסטרים הקודמים. המבחן היה יחסית צפוף ומאתגר אך לא בלתי פתיר ובהחלט ניתן להצליח בו. כדאי לפתור מבחנים מהשנים האחרונות ובעיקר מבחנים של גל כדי \"להבין את הראש שלו\"\n\nהשורה התחתונה: לדעתי האישית, זהו אחד הקורסים המעניינים. יחד עם זאת, זה קורס צפוף שדורש הרבה מאוד השקעה", "timestamp": 1615115467383}, {"author": ",$##", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: מרצה מעולה מסביר הכל בצורה טובה , ההרצאות מאוד עמוסות בחומר וכדאי מאוד להיות 10/10 במהלך הסמסטר\n\nשם המתרגל/ת: ארז שלו , רון זיו, עידו כהן\nחוות דעת - תרגולים: המתרגלים טובים האיכות של הוידאו היתה נמוכה מאוד בנוסף לכך מבחינתי התרגול בקורס זה טוב לבוחן אמצע , למבחן עצמו ההרצאות קריטיות\n\nשעורי הבית: 13 יבשים אפשר לבחור 10 מתוכם הם בעיקר שאלות ממבחנים קודמים לכן מאוד כדאי לפתור אותם לבד , ישנן עוד 3 תרגילי מחשב בשפת מטלב מאוד יפים תלוי מרצה , אבל בסה\"כ שיעורי בית עמוסים !\n\nהמבחן: קשה , דגבד נתן לנו במועד ב מבחן לא קל בכלל , מועד א היה הוגן ויותר נחמד .\n\nהשורה התחתונה:", "timestamp": 1615947879011}, {"author": "Bar Gabbay", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דר.גל בן דוד\nחוות דעת - הרצאות: הרצאות מוקלטות וערוכות (סרטונים קצרים של כ- 20-40 דק') משעממות, עמוסות בחומר, מאוד מונוטוניות וכמעט ולא מאפשרות הבנה רציפה של כמות החומר האדירה שיש בקורס\n\nשם המתרגל/ת: כלל המתרגלים\nחוות דעת - תרגולים: גם כן סרטונים קצרים ביוטיוב שהשתתפו בהם כלל המתרגלים - תרגולים חסרי טעם, מאוד מונוטוניים ומשעממים, ללא יכולת להשתתף ללא יכולת לשאול שאלות. \n\nשעורי הבית: בוחן הכנה שבועי במודל, בנוסף תרגיל בית שבועי להגשה בזוגות ובנוסף 3 תרגילים רטובים במטלאב. המון שעות של עבודה על הקורס\n\nהמבחן: מבחן קשה מאוד שכמעט ולא בחן ידע וכלל שאלות שלא נתקלנו בהן מעולם.\n\nהשורה התחתונה: קורס מאוד קשה עם המון חומר מתמטי וכמעט אפס חיבור למשהו מעשי שהועבר בצורה הכי מונוטונית וגרועה שאפשר להעביר קורס מבלי להתחשב בבקשות החוזרות של הסטודנטים לעבור להוראה בצורה המסורתית.", "timestamp": 1626438200197}, {"author": "סטודנט כללי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: סרטוני הרצאות מוקלטים שבגדול דגב\"ד מתמלל את השקפים איתם הוא עובד. מדי פעם נותן אנקדוטות או חידודים על דברים שלרוב לא הרגישו כמחזקים את ההבנה של החומר.\n\nשעורי הבית: רבים ועמוסים, גיליון יבש מדי שבוע ושלושה תרגילי מחשב שגוזלים מלא זמן.\n\nהמבחן: כמובן שלא פשוט.\n\nהשורה התחתונה: קורס חובה שיכול להיות שמדבר על תחום מעניין אך לא מועבר בצורה מעניינת.\n\"קונבולוציה\"", "timestamp": 1626450587717}, {"author": "טראומה מדגב״ד", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: הקלטות של דגב״ד ומפגשי אדם\nחוות דעת - הרצאות: \nכמויות אדירה של חומר, סרטונים בגדול משעממים, אין אינטראקציה. חומר מעניין.\nשם המתרגל/ת: כל המתרגלים\nחוות דעת - תרגולים: \nנראה לי הקורס הראשון בטכניון שפגשתי שהתרגולים שלו מיותרים. הקורס דורש הבנה עמוקה של החומר ולא רק תרגול.\nשעורי הבית: עמוסים, יבשים ממש עוזרים להבנת החומר, רטובים עמוסים וגדולים אבל סבירים ועבודות מעניינות, שאלוני מוכנות טורמים להבנה.\n\nהמבחן: \nקשוח, עמוס.\nהשורה התחתונה: \nקורס מעניין, עמוס, חומר לא קשה אלא קמויות מפחידות של חומר. בגדול צריך השקעה של 40%-50% מזמנך במהלך הסמסטר (רציני).", "timestamp": 1626553454901}, {"author": "דפח\"מ", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות:  הרצאות על הפנים (קיבלנו סרטונים מוקלטים מראש כל שבוע של דגבד), מלא חומר ש90% ממנו מיותר לחלוטין ומבלבל בשילוב עם ניסיון לשתף את הצופים עם חידונים בלתי אפשריים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים שימושיים מאוד רק חבל שלפעמים לא עוברים לגמרי על כל החומר כמו התמרת DFT. החומר עצמו שימושי מאוד והתרגולים הם המקום היחיד שמשהו מובן.\n\nשעורי הבית: שיעורי הבית עוזרים מאוד להבין את החומר, לרוב כמה שאלות ברמת קושי סבירה ושאלה אחת ת' סעיפים. סך הכל יום- יום וחצי עבודה לגיליון.\n\nהמבחן: המבחן היה קשה מאוד מומלץ לפתור כמה שיותר ולקוות שאלת המזל תזרוק איזו עצם.\n\nהשורה התחתונה: קורס קשה ודורשני, חומר מעניין אבל ההרצאות הן לא המקום להבין אותו, עם זאת אין בתרגולים את כל החומר, כך שרואים את ההרצאות מחוסר ברירה ומחכים לשמוע את דגבד אומר קונ-בו-לו-ציה לאט כאילו זה החלק הקשה ביותר להבנה בקורס.", "timestamp": 1626600548131}, {"author": "דגבד", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: \nהקלטות של סרטונים, מאוד מושקע, המון חומר אבל מעביר בצורה טובה פשוט עמוס מידי\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: \nסרטונים מוקלטים של תרגולים, לא משהו בכלל\nשעורי הבית: \nעמוס מאוד, בייחוד הרטוב.\nהמבחן: \nלא הוגן בכלל, עם פקטור יצא ממוצע נמוך. שאלה של 30 נקודות שאפילו הסגל לא היה סגור איך לפתור אותה\nהשורה התחתונה: \nקורס קשוח, מעניין אבל מאוד עמוס בחומר ומטלות.", "timestamp": 1626605221909}, {"author": "שם", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: מרצה מדהים שבאמת באמת אכפת לו שסטודנטים יבינו. תמיד היה עונה תשובות טובות לסטודנטים בפורום השאלות, וכשנתנו אפשרות לבוא להרצאה בפרונטלי, היה מסביר עד שכולם הבינו (הבאסה בהרצאות האלו הן השעות המאוחרות). יש לו גם סרטונים שבו הוא מלמד את כל חומר הקורס, אבל הם *עמוסים* דגב\"ד דוחס חומר של 4 שעות לתוך שעתיים של סרטונים כל שבוע, אבל חייבים 4 שעות כדי לצפות בהם כדי לעכל את החומר וכדאי לשים את מהירות הסרטון על 0.75 אם לא 0.5. ממש לא מומלץ לדחות את הצפיה בהרצאות ליום שישי כי אז הלך כל היום.\nשם המרצה: אדם שוורץ\nחוות דעת - הרצאות: \"לימד\" בכיתה ההפוכה - היה חוזר על טעויות של סטודנטים בבחני המוכנות השבועיים. רוב הזמן בזבז לנו את הזמן, היה ממש לא מובן, והעיר הערות על זה שאנחנו לא עושים את בחני המוכנות כמו שצריך. היה ממש בלתי נסבל אחרי בוחן האמצע (כשלא בדקו את רוב הבחנים) אמר שמי שלא הצליח וקיבל מעל 80 בבוחן צריך לחזור על הקורס, ועדיף לו לא לגשת למבחנים. \n\nשם המתרגל/ת: אין לי מושג, צפיתי בתרגולים המוקלטים ביוטוב.\nחוות דעת - תרגולים: לוקח זמן להתרגל לקונספט של תרגול הפוך, אבל אחרי שרוב הסמסטר למדתי כך היה קשה להגיע לתרגול פרונטלי כשפתחו את האפשרות. התרגולים ממש קצרים ואפשר לצפות בהם בכל מקום (כולל ברכבת). לא לוקח הרבה זמן לצפות בהם והם מובנים.\n\n**יש לציין שבסמסטר אביב 2021 הקורס לומד בצורה של כיתה הפוכה - רואים את ההרצאות ואת התרגולים לפני הכיתה ההפוכה, עושים בוחן מוכנות, מגיעים לכיתה ההפוכה כדי לעבור על הבוחן ולעשות את שעורי הבית היבשים בקבוצות עם עזרת מתרגל (לקראת סוף הסמסטר ראו את המתרגלים פחות פחות)**\n\nשעורי הבית: יש המון שעורי בית!\nבחני מוכנות - כל שבוע לפני ההרצאה הראשונה/הכיתה ההפוכה יש בוחן מוכנות על חומר שנלמד באותו  שבוע - בערך 6 שאלות כל פעם - רב ברירה שצריך לסמן כמה אפשרויות נכונות.\nשעורי בית יבשים - 13 גליונות - צריך לעשות 10 מהם - לרוב  יהיו שם שאלות ממבחנים או שאלה הזויה שאחד המתרגלים כתב. בדר\"כ אין הרבה משוב על שעורי הבית היבשים ומקבלים עליהם לרוב ציונים טובים. שעורי בית בזוגות.\nשעורי בית רטובים - יש 3 שתקפים וחייבים לעשות את כולם. לוקח בערך 10 שעות לעשות כל שאלה ובכל הגשה יש 2 שאלות (אז סה\"כ 20 שעות). שעורי בית בזוגות. ממש חייבים להקפיד שלכל גרף יש כותרת ושמות לצירים וחייבים לחפור על הכל כדי שלא יורידו נקודות. בודק הרטובים ממש מחפש איפה להוריד לסטודנטים נקודות ובמשובים על ההגשה הרטובה הראשונה שלנו, הוריד על דברים שלא ביקשו ורשם הערות ממש מזלזלות. ממש מומלץ לפתוח את הפורום השאלות ולראות מה אנשים שאלו ומה ענו להם כדי לפתור את ההגשות הרטובות.\n\nבוחן אמצע: יש בוחן אמצע שהוא מגן של 15% - נתנו פקטור של 10% על בוחן האמצע. בוחן האמצע לא היה אמריקאי אז כדאי לתרגל בחני אמצע עם שאלות פתוחות.\n\nהמבחן: מבחן קשה שלא היה ממש הגיוני, נתנו 4 נקודות פקטור במועד א, ונתנו אפשרות למלא סקר כדי לקבל עוד נקודת בונוס למבחן. \n\nהשורה התחתונה: קורס ממש עמוס עם המון עבודה וחלק מהסגל ממש בלתי נסבל. רוב השבוע משקיעים בקורס הזה. עם זאת החומר של הקורס מעניין (לדעתי), אבל הקונספט של הכיתה ההפוכה גרועה ומבזבזת לסטודנטים יותר זמן.", "timestamp": 1626943931942}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות:  כל שבוע העלה 5 סרטונים מוקלטים שלו שצריך לצפות בהם. הרבה מאוד חומר, צריך להבין כל מה שהוא אומר כי אחר כך שואלים על זה. \n\nשם המתרגל/ת: תירגולים מוקלטים מסמסטר קודם\nחוות דעת - תרגולים:  התרגולים די חוזרים על ההרצאה, אין ממש פיתרון של תרגילים ממבחנים וחבל.\n\nשעורי הבית: יבשים כל שבוע שלוקחים כמה שעות. כל גיליון מכיל שאלה מוזרה שלא קשורה לקורס כל כך ולוקחת את עיקר הזמן. תרגילי הכנה כל שבוע שבודקים נקודות קטנות שנאמרו בהרצאות ולא את עיקר החומר, מכילים הרבה טעויות גם. 3 תרגילי מאטלב ארוכים מאוד , מנוסחים גרוע מאוד ולא מועילים בשום צורה.\n\nהמבחן: 4 שאלות פתוחות די קשות \n\nהשורה התחתונה: קורס עמוס מאוד ודי קשה אבל אין לכם ברירה.", "timestamp": 1627282408281}, {"author": "s", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: הסרטונים שלו ביוטיוב טובים וגם המצגות מסכמות טוב את החומר.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: היו סרטוני תרגולים ואפשרות לראות תרגולים מוקלטים אבל לא צריך כל כך.\n\nשעורי הבית: גליון שבועי בזוגות + שלושה רטובים לאורך הסמסטר. הרטובים ארוכים יחסית אבל נחמדים והיבשים חישוביים ברובם חוץ משאלה אחת שהיא יותר ארוכה ולוקחת את רוב הזמן בתרגיל. יש גם שאלוני הכנה שבועיים שבד\"כ על נקודות שוליות בהרצאות.\n\nהמבחן: 4 שאלות פתוחות די קשות. היה גם בוחן אמצע שבו 3 שאלות דומות למבחן.\n\nהשורה התחתונה: קורס די מעניין אבל עמוס.", "timestamp": 1631199826060}, {"author": "שה תמים", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: גל העלה כל שבוע 5 סרטונים שדי מקיפים את חומר. על פניו זה טוב, בפועל 4 הרצאות שבועיות לא מקבילות לשעתיים וחצי של דיבור רציף של מרצה. מאוד קשה לעקוב אחרי הוידאו, כי הוא הוקלט מראש אז גל מסביר כמעט בלי עצירות. הרבה חומר, חלק מאוד לא.\n\nשם המתרגל/ת: לא יודע \nחוות דעת - תרגולים: היו תרגולים מוקלטים מסמסטר קודם באיכות על הפנים שלא שמעו יותר מדי, ולא היה ברור מה נאמר.\n\nשעורי הבית:  כל שבוע יש שיעורי בית שהקשר בינהם למה שנלמד לא קיים.\nיש תרגילי בית רטובים שהם ממש מעניינים וכיפיים ורק שם מורגש העיבוד אותות.\n\nהמבחן:  מאוד קשה, כל סמסטר מחליטים על פורמט חדש למבחן\n\nהשורה התחתונה: סגל הזוי, חוץ מגל שהשקיע בסרטונים סגל מאוד לא מורגש שמנסה לעשות הכל חוץ מללמד.\nאדם לא הורגש בשום צורה לאורך כל הסמסטר, וכל המתרגלים גם. בחלק מהשבועות המתרגלים לא העלו סרטון כי אין על מה לתרגל( אבל יש על מה ללמד באותו שבוע).\nהקורס נוהל בצורה הזויה, הוא התחיל בשבוע לפני הסמסטר ונגמר חודש לפני סוף הסמסטר.\nרוצים לשמוע בדיחה? אדם שוורץ הוא בוועדה לשיפור הוראה אבל לא טרח לעשות כלום בסמסטר.\nבסוף בזכות התרגילים הרטובים ולמרות הסגל הנושא מעניין.", "timestamp": 1633157648807}, {"author": "-", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות:  ההרצאות הפרונטליות לא הסתדרו לי במערכת, ניסיתי בהתחלה לראות את הסרטונים ביוטיוב אבל הם מאוד לא ברורים.  אם אפשר - ללכת רק לפרונטלי.\n\nשם המתרגל/ת:  חן בן פורת\nחוות דעת - תרגולים: מתרגלת מדהימה!!!  מסבירה טוב, נותנת אינטואיציה ומאוד משתדלת שכולם יבינו\n\nשעורי הבית:  המטלב סתם לוקחים נצח, לא באמת מלמדים בקורס הזה איך לעבוד עם התוכנה הזאת ונטו זורקים למים העמוקים.  היבשים מאוד עוזרים להבנה של החומר\n\nהמבחן: עוד לא קרה\n\nהשורה התחתונה:  קורס קלאסי של חשמל, מאוד מתמטי", "timestamp": 1643899693095}, {"author": "הילבט ביבו", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דגבג\nחוות דעת - הרצאות:לא הבנתי מילה מהיוטיוב(ובטח שלא מההרצאות הפרונטליות) \n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: מתרגלת חדשה וממש ממש טובה.ממליץ בחום.\n\nשעורי הבית:רטובים שלא תורמים בכלום \n\nהמבחן: קשה,אך אפשרי.\n\nהשורה התחתונה:", "timestamp": 1645547205826}, {"author": "לפלס", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: מעולות, חוזר על משפטים חשובים ונותן הרבה טיפים שבדיעבד מאוד עוזרים במבחן. בזום קשה לראות את ההרצאות, עדיף להגיע פרונטלי. מרצה שאכפת לו מהסטודנטים ועושה מאמץ כדי שיצליחו.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: מתרגל חדש אבל מסביר מעולה. בהתחלה הייתי אצל רון זיו, ברחתי דיי מהר.\n\nשעורי הבית: הסמסטר היבשים לא היו חובה וחבל, זו הדרך הכי טובה להבין את החומר וכדאי לעשות אותם במהלך הסמסטר. רטובים מעניינים אבל לומדים את החומר אליהם בערך שבוע לפני ההגשה אז זה יוצא קצת לחוץ.\nבחני אמצע - ממש מומלץ להשקיע ולגשת. \n\nהמבחן: המבחנים של דגבד בוחנים יותר הבנה מאלגברה ואם מבינים את החומר ברמה טובה אפשר לקבל אחלה ציון. \n\nהשורה התחתונה: קורס ממש מעניין וחשוב", "timestamp": 1645609238817}, {"author": "ברוכים הבאים לקורס אותות ומערכות אני גל בן דוד", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דגבד - גל בן דוד\nחוות דעת - הרצאות: מאוד חשובות, להשתדל להגיע להרצאות ולא ללמוד מהיוטיוב, אמנם החומר זהה אך לטעמי ביוטיוב אין התעמקות בנושאים החשובים. בהרצאות עצמן להישאר קשובים כל הזמן כי מאוד קל לאבד את גל. להישאר על החומר במהלך כל הסמסטר ולא לדחות לרגע האחרון.\nשם המתרגל/ת: רון זיו\nחוות דעת - תרגולים: מתרגל נחמד ואדיב אבל לטעמי דביר מארש מסביר יותר טוב. שווה לנסות גם את חן בן פורת - הבנתי שהיא מאוד טובה. באופן כללי, התרגולים הרבה פחות חשובים מההרצאות אך לדעתי כן חשוב לעבור עליהם.\n\nשעורי הבית: \nיבשים - לא היה חובה הסמסטר אך מאוד מאוד חשוב לפתור אותם מהסיבה שהרוב המוחלט של השאלות בבחני האמצע ובבחינה הסופית דומות לתרגילים בשיעורי הבית ולא לתרגולים. אפרופו בחני אמצע - הסמסטר היו שני בחנים ( לפעמים יש רק אחד - מניח שתלוי מרצה) עם 15 אחוד מגן כל אחד. כדאי מאוד להשקיע בהם. \nרטובים - גוזלים די הרבה זמן. הבדיקה שוחטת.\nהמבחן: ארוך ועמוס אך די הוגן וניתן לקבל בו ציון טוב אם מתכוננים כמו שצריך.\n\nהשורה התחתונה: קורס חשוב לדעתי.", "timestamp": 1645715256447}, {"author": "..", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דר. בן-דוד גל\nחוות דעת - הרצאות: \nמסביר את החומר טוב, נותן הרבה אינטואיצה\nשם המתרגל/ת: גב. בן פורת חן\nחוות דעת - תרגולים: \nמדהימה\nשעורי הבית: \nגליוניות יבשים מדי שבוע שדורשים 2 שעות כול אחד , 3 תרגילית מחשב רטובים שעושים בהן סימולאציות וקוד במטלאב (דורשים זמן)\nומטלות ממוחשבות ב moodle מדי שבוע שבודקים הבנה של החומר הנלמד\nהמבחן: \nאצלנו היה בוחן אמצט תקף שהוא 25% מהציון הסופי , והוא יחסית טכני וניתן להוציא ציון טוב בו.\nבמבחן יש חלק שהוא מאוד טכני כ 50 נקודות ועוד 25 שבודקים הבנה כללית והשאר בודקים הבנה לעומק, למרות זאת עם הרבה תרגול אפשר להוציא ציון טוב\nהשורה התחתונה: \nקורס לא הכי מעניין, צריך להשאר על החומר כול הזמן כי קל לאבד אותו, דורש הרבה זמן והשקעה.", "timestamp": 1657185035257}, {"author": "נתראה", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: ראיתי אותו ביוטיוב בעיקר כי ההרצאות שלו הפרונטליות היו מאוחרות. כנראה שעדיף לבוא פרונטלית כדי לקבל את כל הטיפים שלו והדגשים. באופן כללי מרצה טוב.\n\nשם המתרגל/ת: ניר גוטמן\nחוות דעת - תרגולים: מתרגל מדהים, אכפתי, מסביר לעומק כל נושא, נותן אינטואיציה טובה. מומלץ בחום!!\n\nשעורי הבית: כמות שיעורי הבית משתנה מסמסטר לסמסטר, אצלנו היו המון בקטע לא פרופורציונאלי, ככה שצריך לדעת לתעדף. אצלנו היו:\n1. שאלות שבועיות במודל - 2-3 שאלות בשבוע, אבל טריקיות, לפעמים צריך לחרוש על הספר הרצאות של אדם כדי להצליח בהן. לא מומלץ להשקיע בהן יותר מחצי שעה.\n2. יבש שבועי להגשה - מומלץ לעשות אותו ולהתעמק בו.\n3. מאטלאב גריידרים - ממש מיותרים שלא עוזרים ללמוד מאטלאב וגם לא ממש עוזרים ללמוד את החומר.\n4. 3 תרגילים רטובים במאלטאב במהלך הסמסטר, שניים כבדים והשלישי קצת פחות.\n\nהמבחן: בודק טכניקה והבנה, הוגן, רצוי לעבור טוב על ההרצאות ולהבין גם את הפיתוחים.\nגם לבוחן אמצע מומלץ ללמוד טוב כדי לבוא מוכנים יותר למבחן.\n\nהשורה התחתונה: קורס עמוס מאוד בשיעורי בית, מומלץ להיות על החומר במהלך הסמסטר.", "timestamp": 1657714951232}, {"author": "סטונדט", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: מרצה נהדר מצליח להעביר אינטואיציה לחומר, לפעמים יש פיתוחים ודקויות מתמטיות נורא משעממות.\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: מדהימה, מתרגלת מהטובות שיש.\n\nשעורי הבית: עמוסים ברמה לא נורמלית.\nכל שבוע יש גליון יבש ושאלון במודל ולפעמים גם מטלה הזויה במטלב.\nבנוסף יש 3 תרגילי מטלב רטובים שלא מנוסחים כראוי ולכן צריך לחכות להבהרות, ממש מעייף.\n\nהמבחן: הסמסטר היה בוחן 25% תקף (אחר כך הומר ל-15% תקף ו-10% מגן), בנוסף עם השיעורי בית מגיעים לזה שהמבחן שווה רק 45% מהציון.\nהמבחן בודק את ההבנה של החומר והוא ברובו המוחלט לא קשה. לפתור מספיק מבחנים של גל ומבינים את הקונספט.\n\nהשורה התחתונה:  קורס נחמד אבל מאוד עמוס", "timestamp": 1657719204241}, {"author": "ברוכים הבאים לקורס אותות ומערכות אני גל בן דוד", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: ההרצאות שלו היו בשעות שכבר אי אפשר להתרכז בהן, אז באיזשהו שלב עברתי לראות סרטונים ביוטיוב. סה\"כ הרצאות מלמדות ורלוונטיות, אבל בכיתה הוא מתעכב הרבה יותר על דברים שחשובים לו ככה שמומלץ לדבר עם אנשים שכן הולכים להרצאות הפרונטליות ולהבין מה הלו\"ז.\n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: מתרגלת טובה וסבלנית ברמות, אבל התרגולים לא קריטיים בעיני להבנה של הקורס.\n\nשעורי הבית: יש אינסוף שיעורי בית. כל שבוע בממוצע יש 3 מטלות להגשה- יבש (מומלץ לשבת ולעשות), מטלה ממוחשבת במודל (לא להשקיע יותר משעה) ומטלב גריידר (לא רלוונטי). בסוף כל השיעורי בית האלה הם 20% מהציון, כשהיבשים הם 10% והממוחשבות והגריידר 10% ככה שתחלקו את הזמן בהתאם. יש 3 רטובים כבדים יחסית בעיקר כי הם מנוסחים בצורה גרועה שרוב הזמן מתבזבז על לפענח מה רוצים ממך, וגם הם שווים סך הכל 10% מהציון שזה ממש לא פרופורציונלי לכמות הזמן המושקעת.\n\nהמבחן: בוחן אמצע תקף 25% שאפשר להצליח בו אם לומדים טוב מה שמוריד את המשקל של המבחן הסופי ל45%. המבחן בודק הבנה של החומר, מתרגלים כמה מבחנים של דגב\"ד וקולטים את הפואנטה- הוא לא אוהב חישובים מסובכים אלא הבנה של החומר. מי שמבין יכול לקבל ציון גבוה ממש גם במבחן.\n\nהשורה התחתונה: קורס מעניין אבל עמוס בטירוף, חבל שההרצאות בשעות כאלה תקועות כי אפשר להפיק ממנו הרבה יותר", "timestamp": 1657782770264}, {"author": "אחד הסתם", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  דגב\"ד\nחוות דעת - הרצאות: אני ראיתי את ההרצאות המוקלטות של דגב\"ד ביוטיוב בלבד, והן עזרו לי ללמוד את החומר. את התרגולים של הקורס לא עשיתי, ולמדתי בעיקר מהשיעורי בית עצמם. \n\nשעורי הבית: יש מטלות ממוחשבות שברובן לא רלוונטיות עם מטלב, וגיליונות כל שבוע להגשה. הגליונות לא ארוכים ועוזרים להבין אם אתה יודע לפתור תרגילים במבחן או לא.\n\nהמבחן: המבחן שלנו היה יחסית קל ביחס למבחנים אחרים ממה שהמרצים אמרו אבל אני חושב שגם יש מגמה בשנים האחרונות שהמבחן נהיה קל יותר, מהמבחנים שפתרנו לקראת המבחן.\n\nהשורה התחתונה: קורס מעניין מאוד לדעתי, די עמוס אבל גם לא קשה בטירוף.", "timestamp": 1657782885136}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: בגדול חלק מהחומר מעניין וחלק פחות (על טעם וריח אין על מה להתווכח), דגבד הוא לדעתי אלוף בכל התחום אבל בלהעביר שיעור מבחינת טכניקת לימוד וכולי קצת פחות. ככה או ככה אין לכם ברירה אתם חייבים לראות את ההרצאות שלו, ולדעתי גם המוקלט של היוטיוב מספיק כדי לקבל לא פחות מ100. אז אל תרגישו רע אם אומרים לכם שזה לא כמו השיעור הפרונטלי.\n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: אחת המתרגלות היותר טובות שיצא לי לפגוש, מאוד מאוד ממליץ. \n\nשעורי הבית: ש.ב יבשים בסמסטר שלנו היו קצרים אבל הרטובים היו ארוכים ומייגעים. \n\nהמבחן: ספציפית מועד א' היה אצלנו די קל, אבל ממבחני עבר בדרך כלל הם פחות קלים.\n\nהשורה התחתונה: אין לכם ברירה, תשקיעו בקורס הזה ותקבלו תגמול בחזרה.", "timestamp": 1657809464212}, {"author": "זזי בזזי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nגל בן דוד\nחוות דעת - הרצאות: \nגל מרצה טוב, לא חושב שהוא ממש מרצה מטורף או גרוע במיוחד. הוא מגיע מאוד מוכן להרצאות ומעביר אותם טוב. \nהבעיה היא שהוא מעביר את ההרצאות בשעות ממש מבאסות. מצד שני בהרצאות הפיזיות הוא נותן טריקים שאליהם הוא שואל במבחן אז יש ייתרון ענק ללבוא אליו פיזית.\n\nשם המתרגל/ת: \nדביר מארש\nחוות דעת - תרגולים: \nמרצה ממש טוב לדעתי, יודע את החומר היטב ונותן דרכים חכמות ופשוטות לפתור כל סוג של תרגיל, אני ממש ממליץ לדעתי עושה את החיים הרבה יותר קלים בקורס הזה.\n\nשעורי הבית: \nמשום מה היה איזה 4 סוגים שונים של שיעורי בית, לצערי אף אחד מהסוגים לא ממש הרגיש שתרגל את החומר באופן טוב, במיוחד לא הרטובים, שאלו תרגילי מטלאב ארוכים רצח שלא באמת קשורים לחומר.\nהקורס עמוס רצח, אני עדיין חושב שכדי לבוודא שאתם על החומר למרות כמות השיעורים, כי שום דבר מהשיעורי בית דומה למבחן או לבוחן באיזשהי צורה. \n\nהמבחן: \nהיה לנו הסמסטר בוחן תקף של 25% שהיה קשה מאוד ובסוף נתנו גם 6 נקודות פאקטור, צריך ללמוד אליו מאוד טוב כי כמות החומר אפילו עד אמצע הקורס ענקית.\n\nהמבחן עצמו עובד בעיקר נגד הזמן, יש 4 שאלות פתוחות. לכל שאלה בדרך כלל יש בערך 10 סעיפים, מה שאומר שצריך לדעת את כל הכמות הענקית של החומר לדעת בשליפה ממש אחרת אין סיכוי לסיים את כל המבחן בצורה סבירה.\n\nהשורה התחתונה: \nקורס עם המון חומר, באמת שצוברים המון ידע בו. החודש הראשון חוזר על דברים ממורכבות והתמרות, שמשעמם מאוד וגם לא מוסיף הרבה ידע. אחר כך מתחילים לדבר על דברים שכבר לא ראינו בכלל ובעיקר בחודש האחרון יש עומס של מלר חומר חדש לגמרי. \nהיות והבוחן הפך תקף וכנראה ישאר ככה, צריך להיות ממש על החומר. ההמלצה שלי, יש את החוברת הממש ענקית שאדם יצר לקורס הזה, למרות שזה מבאס, תקראו בא ותוודאו הבנה לדעתי היא מעבירה את החומר מעולה.", "timestamp": 1657816130770}, {"author": "i'm a boss bitch", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: לא הלכתי לאף הרצאה, הכל יש ביוטיוב בערוץ של גל בן דוד עם אחלה איכות\n\nשם המתרגל/ת: משולב\nחוות דעת - תרגולים: גם ראיתי ביוטיוב את כל התרגולים, מאוד מומלץ!\n\nשעורי הבית: \n1. מטלב גריידר: בעעע הכי מגעיל\n2. מטלות ממוחשבות במודל: גועל נפש של תרגילים, גם שלא זהים עבור כל סטודנט וסטודנט לכן קשה לרפרנס.\n3. תרגילי מחשב: דורשים השקעה בהבנת מטלב וגם חומר תיאורטי, אבל בגדול ההוראות ברורות ולא קשה להוציא 100.\n\nהמבחן: הפעם נפלתי בסמסטר בו כל הסטודנטים חנונים, זה בנוסף לאלה שחוזרים על הקורס, המבחן היה בינוני מינוס, כיסחו בבדיקה אבל בגלל ציוני המגן הממוצע יצא פצצה (למי שיש 90 בבוחן האמצע וציון שלם בש\"ב היה מספיק לקבל במבחן מועד א 55 כדי שיקבל בסופי 80+), כמובן שאדם שוורץ הולך להיעלף כי לא ציפה שיהיה ממוצע כזה גבוה, ליבי איתכם הניגשים למועד ב, בגדול תפתרו מבחנים מ 2020+ תקבלו ציון טוב.\nהשורה התחתונה: קורס נחמד אבל משעמם רצח, יש הרבה מטלות אבל הכל פתיר, ניתן להוציא ציון טוב!!", "timestamp": 1657992524645}, {"author": "אא", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: איכשהו ההרצאות הפרונטליות שלו יותר טובות וברורות מאשר ההקלטות. ממליץ מאוד לנסות להגיע להרצאות הפרונטליות אם אתם יכולים, אבל אם אין ברירה גם הסרטונים ביוטיוב עובדים סבבה\n\nשעורי הבית: היבשים לא היו מרופרנסים הפעם אבל הם לא היו מסובכים מידי רוב הזמן. התרגילים במודל לרוב סבל, אבל אפשר לרפרנס מאחרים אם צריך. תאריכי ההגשה שלהם לא תמיד ברורים, אז שימו לב לזה שלא תפספסו בטעות הגשות (מניסיון אישי). הרטובים לוקחים הרבה זמן למי שאין ניסיון במאטלב אבל בסך הכל ההוראות די ברורות ולא קשה לקבל 100.\n\nהמבחן: ארוך אבל הוגן, הבנה עמוקה של החומר ותרגול מבחנים תבטיח ציון סביר. חוץ מזה יש מלא מגן בקורס הזה, אז גם עם ציון נמוך במבחן אפשר לקבל ציון סופי טוב (ראו היסטוגרמה).\n\nהשורה התחתונה: קורס יחסית מתמטי ועם *מלא* חומר, אבל די מעניין סה\"כ.", "timestamp": 1658133886857}, {"author": "Anonymous", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: הרצאות חמודות, לדעתי חובה לבוא פרונטלי כי יש דברים מעבר שעוברים בהרצאה.\nלפעמים הוא מביע את דעתו בהחלטיות ומציג אותה כעובדה גמורה, אותי באופן אישי זה קצת הכעיס.\n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: סך הכל אחלה מתרגלת, היא בן אדם מדהים דואג ומתחשב. התרגולים עצמם רובם לא ברמה כזאת גבוהה כמו החומר שמועבר בהרצאות.\n\nשעורי הבית: עמוסים בטירוף. היבשים בדרך כלל קצרים, הרטובים לוקחים המון זמן. בנוסף יש עוד מטלות ממוחשבות שלוקחות קצת זמן, אבל ביחד עם הבוחן אמצע יצא תקף של 55 אחוזים שזה מטורף.\n\nהמבחן: לא היה קשה. לפתור הרבה מבחנים והעיקר להבין את הקונספט של הקורס \n\nהשורה התחתונה: קורס מעניין", "timestamp": 1658903527885}, {"author": "נייקווסט", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ד\"ר גל בן דוד\nחוות דעת - הרצאות: \nמרצה טוב מסביר לאט וברור, יש סרטונים ביוטיוב שלו שמסבירים טוב אבל בכיתה מוסיף מעבר למצגות ומדגיש דברים שיהיו במבחן\n\nשם המתרגל/ת: חן בן-פורת\nחוות דעת - תרגולים:  מתרגלת מעולה, דפי התרגול מסודרים מאוד ובאנגלית\n\nשעורי הבית: \nעמוסים, שלושה רטובים (MATLAB)לוקחים יומיים, יבשים שתי שאלות יחסית פשוטות (לא ברמת מבחן בכלל) , שתיים שאלות שאלות אמריקאיות טריקיות במודל, ועוד MATLABGRADER כל שבוע. עמוס.  שווים יחסית הרבה מהניקוד הסופי.\n\nבוחן אמצע : תקף!! היה אמור להיות 20% אחרי תלונות הורדנו ל-20% תקף למי שהציון מעל לציון מבחן ו-15% תקף למי שמתחת לציון מבחן. היה קשה ועמוס באמצע סמסטר. 3 שאלות אחת עם בונוס. קשות \n\nהמבחן: מועד א' הוגן, 4 שאלות פתוחות. הרבה סעיפים\n\nהשורה התחתונה: בהתחלה מתמטי מאוד. אחר כך נהיה מעניין יותר. קורס חשוב עם הרבה נק\"ז. בכל מקרה קורס חובה", "timestamp": 1661160991465}, {"author": "סטודנט/ית", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דר. גל בן דוד\nחוות דעת - הרצאות: הלכתי בתחילת הסמסטר להרצאות הפרונטליות, בעיניי הן לא מוסיפות הרבה ממה שיש בהקלטות + סיכומים שמוצעים באתר. ההרצאות בסה\"כ סבבה, אופן ההעברה שלהן לא משהו; גל פשוט קורא מה שכתוב על המצגת כך שאחרי כמה הרצאות זה נהיה משעמם, בפרט כאשר עובר על ביטויים של סכום והוא פשוט קורא את האנדקסים בלי להסביר בגדול מה נעשה פה. \n\nשם המתרגל/ת: חן בן פורת וניר גוטמן.\nחוות דעת - תרגולים: שני המתרגלים פצצה, בקיאים בחומר ומעבירים את החומר בצורה מסודרת; חן יותר מסודרת מבינת כתב על הלוח והיא דאגנית וחשוב לה שהסטודנטים יצאו עם הבנה מלאה. ניר (מתרגל אחראי) בן אדם עשר, הוא לא מספיק לרוב את כל התרגול כי הוא מסביר את החומר גם תוך כדי -מאוד מוסיף- ,תמיד בא לקראת הסטודנטים ועושה את התפקיד שלו בכלל וכמתרגל אחראי בפרט בצורה מאוד מקצועית - תודה ניר ותודה חן.\n\nשעורי הבית: ההגשות בסמסטר הזה היו פחות מזה של סמסטר שעבר, 12 רטובים להגיש 10 (ברמה של בחינות משנים קודמות, אבל כבר לא-הרמה ממש עלתה)  ו- 3 רטובים (לוקחים זמן יחסית למי שאין לו ניסיון במטלב).\n\nהמבחן: המבחן היה ארוך מאוד, וקשה ביחס למבחני עבר. לצערי עוד אין מספיק מבחנים ברמה הזו כדי לתרגל מספיק, המלצה שלי זה להיות חדים על החומר, לפתור מבחני עבר כי בסה\"כ זה תורם אבל לא להסתמך על הרמה שהיתה.\n\nהשורה התחתונה: בתור מישהו שלא היה לו בכלל מושג על מה זה אותות (עיבוד אותות וכו'), אני יכול להגיד לכם שהקורס הזה הוא בסיס טוב להתחלה, וממש מעניין.", "timestamp": 1677143329594}, {"author": "Industrial Quack", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דגב״ד\nחוות דעת - הרצאות: גל מנהל את הקורס בצורה מופתית: הכל מתוקתק ומסודר ברמה שלא יצא לי להיתקל עדיין בטכניון. בנוסף, כל שאלה או פנייה תענה בהקדם.\nעם זאת, לטעמי ההרצאות מועברות בצורה יבשה ומונוטונית מדי וקל נורא לאבד אותו. כשהגעתי להרצאות בלייב הוא די טס על המצגות ולכן בשלב מסויים עברתי למוקלטות שלו ביוטיוב- שגם שם הייתי צריך להריץ אחורה לא מעט פעמים. בהרצאות שלו תמיד קיבלתי תחושה שהוא לא מדבר אל הסטודנטים בגובה העיניים ומשתמש בשפה אקדמאית מליצית (כאילו הוא מרצה למרצים אחרים) עם הסברים טכניים למדי שקשים להבנה בשמיעה ולוקחים רגע להתעכל. \n\nשם המתרגל/ת: חן בן פורט —> הקלטות של רון זיו\nחוות דעת - תרגולים: הגעתי לשני תרגולים הראשונים של חן ובגדול היא אחלה- פשוט התרגולים היו עמוסים מדי אז עברתי להקלטות שהיו מצויינות.\n\nשעורי הבית: אין מה להיבהל כשלא מצליחים, תבינו הכל בתקופת מבחנים. יש רפרנס לרוב היבשים. הרטובים קצת תקועים וסיזיפים אבל נחמדים בגדול.\n\nהמבחן: סבבה, לא נורא מדי. הם אוהבים לפנק בפקטור וגם יש בקורס הזה מגן מטורף (אם מצליחים בבוחן אמצע).\n\nהשורה התחתונה: קורס חשוב ומעניין ברובו שפותח עולם חדש וסוגר את הפינות של כל מה שלא היה לכם ברור בתורת המעגלים.", "timestamp": 1677207286336}, {"author": "סטודנט/ית", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה:   גל בן דוד\nחוות דעת - הרצאות:   חשובות מאוד. למרות שהרבה פעמים לא הכי ברורות. גל נותן כל מיני הערות ביניים חשובות שאחר כך מופיעות בבחינה. כדאי לעקוב ולנהל קובץ שמכיל את כל האמירות מהסוג הזה.\n\nשם המתרגל/ת:   דביר\nחוות דעת - תרגולים:   המתרגל הכי טוב בפער. רק דביר!\nאם לא דביר אז ניר.\n\nשעורי הבית:   חשוב לפתור כמו שצריך. חלק מהשאלות לקוחות ממבחני עבר ככה שהן מכינות יחסית טוב למבחן.\nהרטובים לא הכי מועילים.    להיזהר!!!!!    הם משנים בקטנה את הנתונים ביחס לסמסטר קודם וככה תופסים העתקות. \n\n\nהמבחן:   עמוס מאוד מבחינת זמן. חובה לפתור מלא מבחני עבר. לפעמים הפתרון הרשמי לא מלמד יותר מידי ומסתפק באיזו אמירה שתקפה לשאלה מסויימת ואין מה להסיק לשאלות הבאות. לכן לנסות לפתור בדרכים נוספות.\nיש בוחן אמצע שהוא תקף!! ללמוד אליו כמו שצריך. לעבור גם על הגדרות של פונקציית בוחן/פונקציות מוכללות. השאלות בנושאים אלה מופיעות בדרך כלל בבוחן.\n\nהשורה התחתונה: \nלנסות להיות על החומר כמו שצריך במהלך כל הסמסטר. בסך הכל הקורס די מעניין. עם מספיק השקעה אפשר ממש להוציא ציון טוב. הצוות של הקורס מעולה ועושים עבודה טובה בארגון הקורס.", "timestamp": 1678543163145}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דגבד- יוטיוב\nחוות דעת - הרצאות: היוטיוב מעולה ומכסה את כל החומר כמו שצריך.\n\nשם המתרגל/ת: רון- מוקלט\nחוות דעת - תרגולים: התרגולים בנויים דיי גרוע סך הכל לא משנה לאיזה מתרגל תלכו. ממליצה להשיג את ההקלטות של חן לדעתי היא הכי טובה.\n\nשעורי הבית: היבשים ממש עוזרים וקריטיים להבנה והטמעה של החומר ומכינים ממש לבוחן/מבחן.\n\nבוחן אמצע: המשקל שלו דיי רציני ובדרך כלל הבחנים מאוד הוגנים וממש אפשר להצליח בהם. ממליצה לעצור את הסמסטר לאיזה 5 ימים- שבוע כדי להתכונן לבוחן ואז גם יש לכם אחלה מגן וגם אתם הרבה יותר מוכנים למבחן.\n\nהמבחן: הוגן מאוד אבל לא קל. צריך ללמוד הרבה ולבוא מוכנים ובאמת שאפשר להוציא בקורס הזה אחלה ציון.\n\nהשורה התחתונה: אחלה של קורס. כן יש צורך בשינוי התרגולים כי מה שמועבר בהם והדפים עצמם של התרגולים לא טובים. עם ההשקעה הנכונה ממש אפשר להוציא בקורס הזה ציון טוב.", "timestamp": 1678870476270}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר גל בן דוד\nחוות דעת - הרצאות: הרצאות מעניינות - דגבד מעביר את החומר בצורה הכי מעניינת ומסביר כל נושא איך נקשר לתעשייה. עובד לפי מצגות ברורות נמצאות במודל. מלא חומר מסודר ויש גם סרטוני יוטיוב מזמן הקורונה גם עוזרות להבנה. ההרצאות לדעתי חשובות כי הקורס הוא לא כל כך טכני.\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: תרגולים חשובים מאוד אבל לא מספיקים לעבור על כל החומר של הקורס כי יש מלא חומר ומלא רעיונות לשאלות. קצב מעצבן שהן באנגלית אבל מסתדרים בסוף\nאבל ממש חשוב להיות בתרגול ולשאול כל דבר לא מובן (יהיה הרבה)\n\nשעורי הבית: עמוסות - יבש כל שבוע ו 3 רטוב שלוקחות זמן אבל בדרך כלל הם משוחזרות אז יש ריפרנס. \nלחזור על גליונות היבש לפני המבחן זה חשוב! כי הן בעצם שאלות ממבחנים\n\nהמבחן: הוגן- אבל צריך הבנה ולעבור על מלא שאלות על מנת לעלות על הפתרון בזמן קצר כי המבחן ארוך ומתיש.\nאצלנו היה מגן של 49% מבוחן אמצע ושיעורי בית \n\nהשורה התחתונה: לא להשאיר אותו לתקופת מבחנים. קורס עמוס. וניתן להוציא בו מעל 80 והוא קורס 5 נקודות אז חשוב!", "timestamp": 1678885292312}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: סבבה לגמרי. הרצאות קלילות, מסודרות ועונה לסטודנטים. \n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: \n\nשעורי הבית: ממוחזרות , לדעתי טוב לעשות כי יש שאלות שיעורי בית במבחן, וגם לתרגול\n\nהמבחן: מועד א היה קשה, מועד ב קל. באמצע הקורס פשוט נשרתי ולמבחן למדתי מאפס מההקלטות של הילה + הקלטות של פתחי בנושא האחרון. צריך כמובן הרבה תרגול. ציון מבחן 84\n\nהשורה התחתונה:", "timestamp": 1679235404924}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ד\"ר גל בן דוד\nחוות דעת - הרצאות:  ההרצאות היו מאוד משעממות ובשילוב עם השעות המאוחרות קשה לשמור על ריכוז.\nאני לא ראיתי, אבל לדעתי עדיף לראות את המוקלטות ביוטיוב ולהריץ מאשר לבזבז זמן.\n\nשם המתרגל/ת: ניר\nחוות דעת - תרגולים: מתרגל סבבה.\n\nשעורי הבית: יבש כל שבוע, יחסית לא לוקח הרבה זמן ולרוב מרופרנס (לפעמים נלקח ממבחני עבר).\nשלושה רטובים (במטלב) במהלך הסמסטר מעצבנים ממש ולטעמי לא עוזרים להבנה.\n\nהמבחן: ארוך קצת אבל הוגן ופתיר.\n\nהשורה התחתונה: אני פחות התחברתי לקורס אבל הרבה נהנים ממנו.", "timestamp": 1679560715646}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: הלכתי לפעמים פרונטלי לפעמים מוקלט. לדעתי אפשר לראות רק מוקלט אבל שווה להיות בקשר עם מישהו שהולך לפרונטלי לראות איזה חומר הוא מוריד באותו סמסטר ואם הוא נותן איזה דגש שלא יופיע במוקלט. רוב הטריקים כן מופיעים במוקלט אז לא באמת לא חייב פרונטלי.\n\nשם המתרגל/ת: ניר\nחוות דעת - תרגולים: תרגולים מצוינים אווירה טובה. החומר נהיה יותר מובן בתרגול.\n\nשעורי הבית: יבשים כל שבוע ו3 רטובים. חלק מהיבשים מרופרנסים והשאר שאלות ממבחנים קודמים. ברטובים לשים לב!!!! לא להעתיק מילה במילה מרפרנס דגבד בודק את זה ובסמסטר שלנו נתן לסטודנטים 0 על תרגילי הבית. כן שווה לרפרנס אם רואים שנתקעים ברטוב ומבזבזים המון זמן אבל לרפרנס עם טאקט\n\nהמבחן: קודם כל יש בוחן אמצע תקף לא לזלזל בקורס זה יכול לפגוע בציון. אם הציון בבוחן אמצע גדול יותר מציון המבחן אז המבחן הוא רק 50 אחוז מהציון. אצלנו היה מאוד עמוס ובגלל זה גם נתנו פקטור. שאלות פתוחות צריך לנמק הכל. גם הרמת הקושי של המבחן לא קלה, אבל מי שעוקב כל הסמסטר אחרי הקורס ולומד טוב למבחן יוציא ציון טוב.\n\nהשורה התחתונה: קורס חובה 5 נק\"ז. להשקיע!! \nמאוד עמוס עם כל ההגשות (יבשים ורטובים)", "timestamp": 1679952969310}, {"author": "לחם חביתה נתניה גיבורי ישראל 24", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דגבד פרונטלי\nחוות דעת - הרצאות: \nהייתי אצל דגבד פרונטלית כל הסמסטר, ולמרות השעות הקשוחות אני ממליץ. דגבד תמיד מגיע מוכן להרצאות, מעביר אותם מעולה ומכניס הומור בומרי מידי פעם כדי לשמור על עניין. הוא לפעמים קצת מסורבל בהסברים שלו, אבל רואים שיש לו המון של ידע לתת. בנוסף, הסרטונים ביוטיוב יכולים קצת לגרום לך להתפזר כי החומר די דינמי בקורס הזה. בין המרצים הטובים שהיו לי בתואר בסה\"כ.\n\nשם המתרגל/ת: דביר מארש\nחוות דעת - תרגולים: \nמתרגל מעולה, מכיר את החומר ואת התרגולים טוב, לא מדלג על שלבים והכי חשוב - מרגיש את הכיתה וכל הזמן מוודא הבנה. ממולץ בטירוף לאנשים שלא אוהבים מתרגל שרץ על החומר.\n\nשעורי הבית: \nעמוסים. 10 יבשים לאורך הסמסטר + 3 תרגילים רטובים במטלב (2 מתוכם כבדים מאוד ולוקחים הרבה זמן) + 6 תרגילי גריידר במטלב שגם לקחו זמן. שווה להשקיע את הזמן ולעשות את שיעורי הבית ברצינות כי הם שווים הרבה מאוד נק' בציון הסופי (מגיעים ל28% תקף).\nבוחן אמצע:\nבסמסטרים האחרונים הבוחן אמצע באותות יכול להיות תקף (תלוי בציון הבחינה הסופית), ולמרות שזו מעמסה באמצע סמסטר 4 (יש במהלך הסמסטר בחני אמצע נוספים לחשמלטורים), שווה מאוד ללמוד אליו כמו שצריך ולא לזלזל בו.\nהמבחן: \n עדיין לא הגיעו ציונים אבל בסה\"כ הרגיש שהיה מבחן די הוגן, דגבד לא מבקש להמציא את הגלגל בבחינה, יכולות להיות 10-15 נקודות במבחן שקשה עד קשה מאוד להשיג, אבל מי שלמד טוב לאורך הסמסטר ועשה מספיק בחינות של דגבד, יצליח בה לדעתי.\nהשורה התחתונה: קורס מעניין, מלמד קונספטים ישנים(ממד\"ח ומרוכבות) מנקודת מבט יותר הנדסית, מנוהל טוב ע\"י הסגל, אין הרבה מילים רעות להגיד אליו.", "timestamp": 1689094821376}, {"author": "--", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: הרבה מאוד אוהבים אותו אבל לי הייתה קצת תחושה שהוא מדבר במעגלים ולא מגיע לפואנטה או שלוקח לו המון המון זמן להגיע לפואנטה. יש הרבה דוגמאות שאמורות להוות הסבר למשהו אבל השיטת לימוד הזאת לא הכי מוצלחת בעיניי.\n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: אחלה מתרגלת, מאוד מסודרת ומשתדלת לענות על כל השאלות.\n\n\nשעורי הבית: פשוט סיוט. נכון שמדובר בקורס 5 נקז אבל הכמות זמן שהשיעורי בית לוקחים היא לא פרופורציונלית. 10 יבשים להגשה (שזה עוד סביר ועוזר להבנת החומר) ובנוסף 3 רטובים (השני ארוך בצורה דרסטית) ועוד 6 גריידרים שצר לי לבשר- אבל לא מועילים בשום צורה בהבנה של החומר. זה 100% קאדר שפשוט צריך להגיש בשביל המגן.\n\nהמבחן: \nתכלס היה פיירי, עוד אין ציונים אבל הרוב היה בערך ברמה של מבחנים קודמים ותרגולים.\nהשורה התחתונה:  בסהכ קורס מעניין ומנוהל טוב. הרטובים סיוט ולא תורמים.", "timestamp": 1689101896639}, {"author": "a", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: \nהרבה אנשים עפו עליו לפי כל הביקורות פה ולא ברור כל כך על מה. בכל מה שקשור לצד המנהלי-הוא מחזיק את הקורס לגמרי, כותב את השאלות ונוח מאוד שיש לו את היוטיוב. מצד שני, ההרצאות עצמן לא כל כך מעניינות-המון הוכחות מתמטיות שבמקרה הטוב הוכחנו בקורסים קודמים ובמקרה הפחות טוב לא רלוונטיות לקורס ומאוד קל לאבד את התכלס בין ים של מידע. ממליץ לעבוד עם סיכום טוב תוך כדי ההרצאות, ככה שהחלקים הרלוונטיים יהיו בסיכום ותוכלו לשים את הדגש בדוגמאות/משפטים חשובים ולא באינסוף הוכחות ומתמטיקה מייגעת.\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: \nמתרגלת טובה, מקפידה לענות על שאלות וגם מספיקה את הדברים החשובים. נותנת אינטואיציה ומסבירה טוב. התרגולים עצמם לא מסבירים הכי טוב את החומר אבל נותנים אינטואיציה ראשונית לפני התרגילים.\nשעורי הבית: \nעמוסים. גיליון יבש עם שאלות לא הכי מסובכות אבל גם לא תמיד הכי פשוטות, 3 רטובים שבמיוחד השני שבהם מזעזע וארוך בלי תרומה אמיתית להבנה של החומר, ומטלות גריידר שנועדו כדי לרפרנס ולקבל עוד ציון מגן. שווה ללמוד טוב לבוחן אמצע, סוגר את הפינות הראשונות של הקורס ויכול לעזור מאוד לציון הסופי.\nהמבחן: \nמועד א שלנו היה הוגן, ויאמר לזכות דגבד שהוא כותב מבחנים הוגנים-למעט בודדים פה ושם במבחני עבר הרוב המוחלט של המבחנים הוגן.\nהשורה התחתונה: \nקורס שאם מזככים ממנו את החומר הרלוונטי הוא מאוד מעניין, אבל הוא הולך לאיבוד בין ים של מידע לא רלוונטי ומתמטיקה מעייפת גם כשחשבת שסיימת עם זה כבר. אין הרבה קשר בין התרגולים להרצאות איפושהו מאמצע הקורס.\nמצד שני, יש מגן מאוד גבוה (יכול להגיע ל50 אחוז), אז שווה להשקיע תוך כדי הסמסטר ואפשר להוציא ציון טוב במבחן.", "timestamp": 1689696714185}, {"author": "Yaniv Slor Futterman", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: \nמרצה מעולה\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: \nמתרגלת מצוינת, ממליץ בחום\n\nשעורי הבית: \nגליונות יחסית קלים, אבל זה לא ברמה של המבחן הסופי. צריך לתרגל מבחנים לפני כן\n\nהמבחן: הוגן. \n\nהשורה התחתונה: אחלה קורס. עמוס אבל מעניין", "timestamp": 1689771611789}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: לא המרצה הכי טוב, מתעסק המון בתיאוריה ומדבר בשפה גבוהה. העדפתי לראות את היוטיוב שלו.\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: התרגולים לא בנוים טוב לדעתי, יש הבדל גדול ביניהם לבין המבחן וגם היו עמוסים בטירוף. דפי התרגול ברורים פשוט באנגלית, וחן הסבירה אותם באופן ברור\n\nשעורי הבית: מתישים אבל היבשים מלמדים, הרטובים כמובן מיותרים\n\nהמבחן: המבחן בסופו של דבר פייר. לא להיבהל כשמתרגלים מבחן ראשון והכל סינית, זה בסדר אחרי תרגול. נטו לתרגל ולתרגל.\n\nהשורה התחתונה: קורס לא פשוט אבל כן אפשר להצליח בו", "timestamp": 1689790859716}, {"author": "Grades", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דגב\"ד\nחוות דעת - הרצאות: \nאני לא מבין את כל ההייפ עליו, הרגשתי שההרצאות ברובן משעממות, מעביר את זה בצורה מאוד משעממת.\nכן רואים שלבן אדם יש ידע עצום בכל הנושא הזה, \nאבל סה\"כ עוד מרצה בטכניון, לא מצליח להבין את ההתלהבות.\nגם הייתה לו נטייה שהרבה מהדברים החשובים שמופיעים במבחן הוא כותב בצד בקטן שאף אחד לא רואה, במקום שיהיה במצגות.\n\nשם המתרגל/ת: עומר כהן\nחוות דעת - תרגולים: \nמעולה, מסביר את החומר ממש טוב ואכפת לו מאוד מהסטודנטים.\nהייתי בקבוצה קטנה שלו אז היה לו גם זמן להשקיע בכל אחד\nשעורי הבית: \nהיבשים קצרים ועוזרים בהבנה למבחן, הרטובים חסרי פרופרוציה ולא חשובים בכלל, \nניתן לרפרנס את כולם ולא תרגישו בהבדל בקורס\n\nהמבחן: \nהמבחן שלנו היה קל יותר יחסית לשנים קודמות, \nאבל ממה שנתקלתי המבחנים לרוב בינוניים ברמת קושי, סה\"כ אחרי כמה מבחנים מבינים את הקונספט \n\nהשורה התחתונה: \nבוחן אמצע מאוד חשוב, באמת תורם להבנה ושווה מלא נקודות(12 אחוז תקף ו12 אחוז מגן).\nסה\"כ קורס חביב עם הרבה מושגים שבהתחלה אתה לא מבין מה רוצים אבל בסוף מתחברים.\nהרבה קונספטים חמודים, שיחסית לא דורשים הבנה גדולה מדי, לעומת נגיד מלמ או שדות שבאותו סמסטר.\nאני חושב שאפשר להעביר את הקורס באופן מעניין יותר, אבל בינתיים זה הקורס וזה מה שיש.\nכדי לא לחשוב שאני סתם מריר, סיימתי את הקורס על 97+, אז ההערות שלי הן אותנטיות ורוצות לשים מראה אמיתית על הקורס", "timestamp": 1690036453201}, {"author": "Ron Lebedinsky", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: הקלטות של דגב\"ד\nחוות דעת - הרצאות: אין הרבה מה לומר חוץ מזה שבההרצאות הוא פשוט מקיא עליך מידע אבל אחלה דרך ללכת לישון מהר. יכול להיות ששוה יותר ללכת פרונטלי אבל השעות של דגבד זה מזוכיזם.\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: אם לא היא אין שום סיכוי שהייתי מבין נושא אחד בקורס. היא ממש אחלה.\n\nשעורי הבית: בסך הכל 26% תקף:\n10% - 13 גיליונות יבשים של 3-5 שאלות ברמה של מבחן שהיה צריך להגיש רק 10. אין סיבה להתעקב יותר מידי. הגשה בשותפים.\n12% - 3 רטובים במטלאב ארוכים ממש ששוברים את הראש רק להבין מה רוצים ממכם. אסור להשאיר את זה לרגע האחרון. הגשה בשותפים.\n4% - היה 6 מטלות גרייגר שזה דומה בעקרון לwebwork רק לשאלות שפותרים עם מטלאב. לא ארוכים בכלל. הגשה ביחידים.\n\nבוחן: 12% תקף שהופך ל-24% מגן אם הציון בחינה קטן מהציון בבוחן. כדאי להשקיע אליו בלמידה של יומיים לפחות - לא פשוט בכלל.\n\nהמבחן: מועד א' היה מאוד סביר אבל בבדיקה של המבחנים היה כמה שטויות שעשו שנראה כרגע שמקבלים את הערעורים עליהם. ממולץ להשקיע בלמידה למבחן בלפחות 12 מבחנים עבר - לאחר מכן הדברים פחות או יותר חוזרים על עצמם.\n\nהשורה התחתונה: חומר מעיק שלא מבינים עד שלא מתחילים לפתור מבחנים. סגל סביר+. תודה רבה לchatGPT השותף בפיתוח הסקריפטים במטלאב.", "timestamp": 1690380400762}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: גל מריץ את הקורס כבר שנים ובהתאם מכיר את החומר טוב מאוד וזה ניכר. הלכתי אליו פרונטלית, סך הכל החומר כן עובר בצורה טובה, אבל מדובר במסה די גדולה ככה שלי אישית לפעמים היה קשה לעקוב / לראות את התמונה הגדולה, לי עזר לחזור על החומר שעשינו לפני כדי לחבר בין הדברים. חשוב להגיד שיש גם הקלטות טובות ודי זהות של גל מהקורונה ביוטיוב אז כל עוד לא שינו הרבה אפשר להיעזר גם בהן. \n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: מצויינת. מעבירה את החומר בטובה מאוד ובאווירה טובה עם הסטונדטים. היה אצלה די מפוצץ באמצע הסמסטר שזה הקשה אבל סך הכל אם אפשר ממליץ בחום ללכת אליה.\n\nשעורי הבית: גיליון יבש שבועי שרוב המקרים לא מאוד ארוך, מתבסס בלא מעט שאלות על מבחני עבר אז טוב לעשות את זה.\nלצד היבשים יש 3 רטובים שלא תורמים המון למבחן ונראה שהמטרה שלהם יותר להדגים איך הכלים שלמדנו מיושמים באופן פרקטי. הרעיון עצמו סבבה, אבל הם כן לוקחים הרבה זמן אז לקחת בחשבון.\n\nהמבחן: היה די דומה למבחני עבר, אבל בגלל השביתה והספקים של המרצים יצא שהורידו לא מעט חומר (משתני מצב + חומר מסוף הקורס). מה שכן פרגנו מאוד מאוד בבדיקות ממה שחוויתי ובהתאם יצא ממוצע מאוד גבוה אחרי הערעורים.\n\nהשורה התחתונה: קורס שלי אישית היה מעניין מאוד, אבל חשוב להגיד שבתכלס ברובו זה קורס מתמטי יותר מאשר הנדסי. לעשות את השיעורים לאורך השנה כדי להיות על החומר וקריטי (!) להשקיע בבוחן אמצע, זה יכול להיות ההבדל בין 50 נק' מובטחות בסופי עם כל שאר המגנים ותקפים של השיעורי בית לבין משקולת של 12% אחוז תקף שיכולה להוריד את הממוצע (אם הציון שלו נמוך מהציון מבחן סופי הוא הופך לתקף - על כן כדאי להשקיע בו ולפחות לקבל ציון סביר שלא יוריד את הציון הסופי). הסגל מתחשב ועונה על כל השאלות ונראה שכן מעוניין שנצליח.", "timestamp": 1691297201569}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גל בן דוד \nחוות דעת - הרצאות: \nהיה לי קשה להתרכז בפרונטלי אז עברתי למוקלט שזה גם טוב, בסוף הפסקתי לראות הרצאות בגלל העומס במהלך הסמסטר ובגלל זה הרבה פעמים התקשיתי בהבנת החומר אז חשוב לא לזלזל\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: \nחן מאוד טובה. פשוט התרגולים לא כל כך נעימים וצריך להיות בפוקוס כדי להבין הכל\nשעורי הבית: \nהיבשים סבבה יש לפעמים רפרנס ועובדים בזוגות, הרטובים סיוטטטטט. אל תחכו לרגע האחרון, הרטוב השני היה מאוד ארוך ולא היה רפרנס בכלל אז תנסו לסיים אותם כמה שיותר מהר. יש גם גריידר תקף אבל חלק מהסטודנטים שלחו רפרנס אז לא התאמצתי, לא מוסיפים כלוםםם אם יש רפרנס פשוט תעשו העתק הדבק\nהמבחן: \nאצלנו היה הוגן, עשו הרבה שטויות בבדיקה אבל אחרי הערעורים הציונים היו ממש סבבה. \nבוחן אמצע: חשובבב חשוב חשוב. אצלנו היה קשה ולצערי זה פגע בציון שלי. זה ממש ממש חשוב תלמדו לפחות שבוע לבוחן אל תעשו את הטעות שלי\nהשורה התחתונה: קורס נחמד אבל מתמטי. הרגיש לי כמו מרוכבות והתמרות 2", "timestamp": 1691657992560}, {"author": "יואב", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: \nיתרונות : יש לו המון ידע, אכפת לו שנבין את החומר, יסודי מאוד\nחסרונות: מונוטוני ממש, משעמם, איטי מאוד, מתעכב על כל מעבר מתמטי לא נחוץ, רוב הפעמים לא מגיע לפואנטה מרוב שמתעכב על דברים לא נחוצים. עדיף לראות מוקלט ולחזק בסיכום של עדן גולני בהחלט יעשה את העבודה יותר טוב מהפרונטלי \n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: חן המתרגלת היחידה שטובה בקורס, משקיעה כותבת ברור ומסודר, ללכת אליה או לראות מוקלט\n\nשעורי הבית: היבשים ממבחני עבר, לא קשים יחסית, אין צורך להתעכב יותר מדי אין הבנה עמוקה \nרטובים - זוועת עולם\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: ציפיתי להרבה יותר בקורס הזה, אך רק הנושא האחרון היה נושא הנדסי, כל השאר מתמטי יבש שמועבר בצורה לא טובה בכלל", "timestamp": 1692473626963}, {"author": "נייקוויסט", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גל בן דוד\nחוות דעת - הרצאות: מרצה טוב אבל לפעמים לא מפריד בין עיקר לתפל, זה עניין של טעם וניכר שהוא מאוד משקיע\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: מסביר טוב אבל התרגולים כרגע לא כתובים טוב ועומדים לשנות אותם. כרגע אפשר ללמוד את עיקר הקורס מהתרגולים ולהשלים פרטים מההרצאות, כי הם מאוד חוזרים על ההרצאה\n\nשעורי הבית: היבשים נחמדים למבחן, הרטובים מיותרים\n\nהמבחן: לתרגל מלא מבחנים ולשלוט בחומר ואז זה בסדר גמור\n\nהשורה התחתונה: מתמטית כל הקורס מתחיל בכמה דברים מאוד מהותיים לגבי פורייה ולפלס בשבועות הראשונים, ואז כל הקורס זה לראות טריקים מסביב לדברים האלה. כל החומר הוא בעקרון אותו הדבר עם שינויים קלים. אז אולי עמוס אבל די חוזר על עצמו אם מבינים את הטריק", "timestamp": 1694872707382}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: גל\nחוות דעת - הרצאות: חכמים ממני כבר סיפרו. מרגישים מאוד את ההשקעה שהוא נתן בקורס וזה מאוד מוערך. ממליץ בחום.\nבכל זאת כמה נקודות שפחות אהבתי בהרצאות שלו: הוא מדבר לאט ולפעמים נותן קצת תחושה שאנחנו ילדים קטנים, בשעות הקבלה הוא נותן תשובה סופר ארוכה על שאלה מאוד קצרה וזה גורם לשעת קבלה להיות לא אפקטיבית. חוץ מזה כרגע לא עולה לי עוד משהו.\nשורה תחתונה הוא עדיין מעולה ומומלץ.\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: תרגולים חמודים, בדיעבד הייתי אולי מנסה ללכת למתרגלים אחרים (פשוט היו כמה וכמה פעמים ששאלתי אותה שאלות שהיא לא ידעה לענות לי עליהן, זה קצת הרגיש שהיא הכירה מצוין את מה שהיא העבירה בתרגול אבל לא יותר מזה).\n\nשעורי הבית: גיליון כל שבוע, יחסית קצרים. הם לא כל-כך דומים למבחנים. לדעתי כדאי להוסיף עוד סעיף או שניים לכל גיליון שיהיו יותר דומים לשאלות ממבחנים.\nחוץ מזה היו 3 יבשים שהם יותר ארוכים אבל לא סוף העולם. אם אתם מספיקים לפני תחילת סמסטר, ממליץ בחום ללמוד קצת MATLAB (לפחות syntax ופונקציוות הכי בסיסיות כדי שזה לא יהיה שוק באמצע הסמסטר).\n\nהמבחן: לא קל ולא נוראי. מי שלומד ומתכונן כמו שצריך כל הסמסטר יכול בכיף להוציא ציון גבוה. לא הרגשתי שחיפשו להכשיל אותי כמו בהרבה קורסים אחרים בפקולטה.\n\nהשורה התחתונה: קורס מצוין ומעניין מאוד, הרבה מזה בזכות ההשקעה של צוות ההוראה בתוכן, בש״ב ובלימוד. *ממליץ לקחת אותו גם מי שלא חייב*", "timestamp": 1697091252027}, {"author": "יובל", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דגב\"ד (ד\"ר גל בן דוד)\nחוות דעת - הרצאות: ההרצאות בשעה קשה. לוקח המון זמן לתוך הסמסטר עד שמתחילים לדבר על דברים מעניינים. תחזיקו מעמד, אני עברתי לסרטונים (המצוינים) שלו ביוטיוב. החל מהרצאה 20 (בנושא \"תרשים בודה\") הקורס נהיה מעניין.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: כנ\"ל\n\nשעורי הבית: ברמת קושי משתנה, תבחרו לעשות אותם עם מישהו ששולט במטל\"ב.\n\nהמבחן: הוגן ולא קשה מידי אם יודעים להשתמש בטריקים במקום לעשות מתמטיקה קשה.\n\nהשורה התחתונה: קורס מגניב בסך הכל. אל תשפטו אותו לפי החומר בהתחלה אלא לפי הסוף!", "timestamp": 1715427399395}, {"author": "פורייה", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גאל \nחוות דעת - הרצאות: גל עשוה מאמץ שנבין\nאבל כיוון שכל הקורס בסופו של דבר זה הגדרות מתמטיות והרבה חומר אז בסופו של דבר לא מבינים כלום עליו.\n\nשם המתרגל/ת: אף אחד\nחוות דעת - תרגולים:אמת אמת לא צריך.\n\nשעורי הבית:גועל\nדווקא הרטובים \n\nהמבחן: סביר מאוד\n\nהשורה התחתונה: בסופו של דבר זה נראה קורס עמוס מבחינת חומר אך אפשר דרך למידה של 10 ימים בערך לשבת על החומר לרכז אותו ולתרגל כמה מבחנים וישר תראה שהרעיונות פחות ויותר לא משתנים.", "timestamp": 1715557550460}, {"author": "OG", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דגבד\nחוות דעת - הרצאות: \nמהמרצים הכי אכפתיים שנתקלתי בהם, מאוד אוהב את הקורס ואת החומר (שבעיניי מעניין בחלקו אך משעמם בחלקו האחר). \nהיה מפתה לא לגלוש למוקלטות מהיוטיוב בייחוד שההרצאות היו ב16:30-18:30 פעמיים בשבוע, אבל גל הדגיש שיש פערים מההקלטות ושלדעתו מי שלא יגיע להרצאות יתקשה להצליח ולכן נשארתי. \nשם המתרגל/ת: עומר/ניר/עבד\nחוות דעת - תרגולים: \nהיה קצת סלט עם המתרגלים בעקבות המלחמה ומילואים, הורגש שהמתרגלים לא בדיוק באזור הנוחות שלהם למרות שמאוד השתדלו.\nלדעתי חבל שהרשימות מאוד מיושנות וברמה יחסית נמוכה בהשוואה למבחן, בנוסף לכך שהן באנגלית. עוד משהו שמאוד מפריע ואני מקווה שיתוקן זה שההרצאות במהלך הסמסטר היו בפער אחרי התרגולים יהיו מספר תרגולים שהקדימו את החומר מההרצאה. \nיש ביוטיוב תרגולים מתקופת הקורונה, ממליץ\nשעורי הבית: \nשיעורי הבית היבשים לא היו מאוד קשים אבל יש תרגיל כל שבוע ובסוף זה הצטבר להיות מאוד עמוס. \nהרטובים נוראיים, ארוכים ברמות ודי קשים, כן לומדים מהם לעשות קצת דברים פרקטיים שנוגעים לחומר של הקורס אבל בעיניי לא שווה את ההשקעה. יש בעיה של חוסר סנכרון בין הרטובים לחומר מההרצאה וכך יצא שהרבה מהדברים שלא ממש ידענו ברטובים נלמדו בשלב מאוחר יותר. \nהמבחן: \nסוף סוף מבחן לא אמריקאי בטכניון, באמת לא מבין את ההתעקשות המעצבנת של האוניברסיטה לשלב אמריקאיות שפשוט לא בוחנות את הידע של הסטודנטים אלא את המהירות שבה הם פותרים ולא עושים טעויות בכלל בדרך. \nמבחנים לא קלים בכלל אבל פתירים, המועד שלנו ספציפית היה הוגן+\nהשורה התחתונה: \nקורס חשוב ודי מעניין, לקחת בחשבון שמאוד עמוס", "timestamp": 1716115303376}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גל בן דוד מוקלט\nחוות דעת - הרצאות: סבבה, לא רואים מרצה אז קצת קשה אבל סבבה\n\nשם המתרגל/ת: חן בן פורת\nחוות דעת - תרגולים: היא מדהימה! ממליצה ממש\n\nשעורי הבית: דיי עמוסים. יש בוחן אמצע תקף (אצלנו ניתן בו פקטור) שהוא איזה 12% תקף אם קיבלתי ציון נמוך מהמבחן ו24% מגן אם קיבלת בו יותר, קיצר יכול ממש לדפוק או לעזור לך ולא נותנים בו מועד ב\n\nהמבחן: היה בעיני ממש סבבה\n\nהשורה התחתונה: קורס ממש מעניין בעיני ממליצה", "timestamp": 1717010246166}, {"author": "נייקוויסט", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר גל בן דוד\nחוות דעת - הרצאות: ראיתי מוקלט ביוטיוב, זה די אחלה במקום להגיע להרצאות בערב שזה קשה... קורס מאוד מתמטי, היה לי קצת משעמם לראות את ההרצאות אבל אין מה לעשות.\n\nשם המתרגל/ת: לא יודעת אלו שביוטיוב\nחוות דעת - תרגולים: אחלה ממש, מסבירים די טוב. לדעתי חסר קצת שאלות לתרגול, יותר בסגנון של מבחנים. אין שם ממש בתרגול, אבל זה בכל התרגולים ככה לפי הדפים.\n\nשעורי הבית: גיליון כל שבוע + 3 רטובים. סבבה סך הכל, גם הרטובים בסופו של דבר הם נחמדים ונסבלים ולא כזה סיוט כמו בקורסים אחרים. \n\nהמבחן: אחלה, גל די הוגן ואחרי כמה מבחנים שמתרגלים אפשר לראות מה הנושאים העיקריים שבדרך כלל מופיעים ולהתחזק בהם. אמנם הקורס עמוס ויש הרבה חומר, אבל אפשר להצליח לדעתי.\n\nהשורה התחתונה: קורס נחמד, קצת יותר מידי מתמטי והייתי שמחה ליותר חיבור הנדסי, זה קצת קורה במבחן אבל בהרצאות פחות.", "timestamp": 1717945367380}]}