{"posts": [{"author": "ע", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ליאור קורנבלום\nחוות דעת - הרצאות: מרצה טוב, מסביר את השימושים של החומר הנלמד\n\nשם המתרגל/ת: לי-שי\nחוות דעת - תרגולים: מתרגלת בסדר,\n\nשעורי הבית: תרגיל יבש שבועי, לוקח 1-3 שעות. 5 מעבדות לאורך הקורס בנוסף לשעות ההרצאות והתרגולים. דו\"ח מכין ומסכם לכל מעבדה, המסכמים לוקחים בערך 1-2 ימים. במעבדה עצמה שואלים שאלות בשעה הראשונה אז חשוב להיות על החומר.\n\nהמבחן:  2 שאלות מרובות סעיפים, ברמה גבוהה.\n\nהשורה התחתונה: קורס מאוד עמוס, המעבדות דורשות הרבה עבודה והכנה.", "timestamp": 1645090843757}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ילון עילם\nחוות דעת - הרצאות: \nמרצה טוב וסבלני שרואים שאכפת לו. \nלא מתעצל ומפתח בצורה מסודרת על הלוח את רוב הפיתוחים המתמטיים בקורס תוך הסבר מסודר ודיון על הרבה מהשלבים.\nרואים שהוא מבין ואוהב את התחום וחשוב לו שייצליחו ויבינו.\n\n\nשם המתרגל/ת: לישי שהם\nחוות דעת - תרגולים: \nמתרגלת אחלה. מובנת וסבלנית מסבירה בצורה ברורה ומסודרת.\n\nשעורי הבית: \nגיליון שבועי. לרוב לא לוקח יותר מדי זמן. אך יש 5 מעבדות עמוסות יחסית לרוב עם דוח מכין ודוח סיכום ורובם יחסית ארוכים.\n\nהמבחן: מבחן הוגן לדעתי אין יותר מדי מה לומר. אם על החומר במהלך הסמסטר ומתרגלים מבחנים אז סיכוי גבוה לקבל ציון סביר פלוס לדעתי.\n\nהשורה התחתונה: \nאם אחרי מל\"מ מרגישים צמאים להבין עוד ושרוצים להעמיק את הידע שלכם בטרנזיסטורים. אז בהחלט ממליץ על הקורס. גם אם לא תרצו להתעסק ספציפית בננו אלקטרוניקה, אבל תחום המעגלים משולבים והחומרה מעניין אותכם וגם אוהבים לצלול לעומק של כל הפיתוחים ולהבין מאיפה הכל מגיע אז בהחלט קורס ששווה לקחת. \n\nאם זאת הקורס כנראה לא לכולם, כי לא מעט דווקא ייחשבו שקורס כזה מיותר וסתם מעצבן שנכנס לכל פיפס שלא הסבירו במל\"מ בחלק האחרון של הטרנזיסטורים.", "timestamp": 1677192163869}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  ילון עילם\nחוות דעת - הרצאות: ההרצאות חשובות למבחן ולהביו יותר את החומר בתרגולים לא מועבר הכל. המרצה מסביר טוב וההרצאות כן מעניינות.\n\nשם המתרגל/ת:  סימה\nחוות דעת - תרגולים: אחלה מתרגלת, היא מסבירה החומר בצורה ממש טובה . היא עונה על שאלות ומורגש שהיא שולטת בחומר .\n\nשעורי הבית: היה שתי מעבדות אחת עבור הקבל והשנייה עבור הטרנזיסטור הם כן חשובות ומעניינות לכל אחת יש דוח מסכם ורק לראשונה יש מכין (סה\"כ 3 דוחות-יש רפרנס וכל דווח לוקח כמה שעות) אבל צריך ללמוד טוב למעבדה בחלק הראשון מהמפגש היא שואלת על כל החומר הכל!! ציורים מסקנות הכל היא לא מפספסת נקודה אחת מה שעוזר ללמוד  החומר טוב במהלך הסמסטר.\n לגבי שיעורי בית מדובר בגליון שבועי ממוחזר של שתי שאלות או שאלה אחת.\nהמבחן: סביר,בודק אם אתה מבין את החומר זה קורס ראשון שבאמת בודק הבנה ולא כמה מבחנים ורעיונות ראיתה.\nאם אתה באמת מבין את התופעות ומה גורם להם ועל מה משפיעים אין סיבה לא לקבל ציון טוב.\n\nהשורה התחתונה: הקורס הכי שווה ויפה שעשיתי בטכניון אתה לומד החומר בהרצאות ובתרגולים ואז ממש אותו  במעבדות וכותב עליו בדוחות, ואז תגיע מוכן לבחינה ומספיק לפתור 3 או4 מבחנים.\nמי שעשה מל\"מ והתעניין  בקבלים וטרנזיסטורים מומלץ שייקח את הקורס ( בקיצור בו לומדים על המבנה של כל אחד מהם ומה השפעת המתחים על ההתנהגות שלהם והכי מעניין וחשוב בתעשייה כעת :הגדלים שלהם).\nמומלץ לעקוב טוב בסמסטר ואז מקבלים 90+ בקלות.", "timestamp": 1721644650388}]}