{"posts": [{"author": "Guy Yoffe", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: ליאור (לא זוכר שם משפחה)\nחוות דעת - הרצאות: מרצה סבירה. מרגיש שהיא לא יודעת את החומר פרפקט. לעומת זאת, קולודני היה מפוזר מאוד ודיבר על הכל חוץ מעל החומר, לעומת ליאור שדיברה אך ורק עליו.\nללא ספק עדיפה עליו.\n\nשם המתרגל/ת: ליעד\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: קשים מאוד. בעיקר היבשים, הרטובים פחות.\n\nהמבחן: קשה מאוד.\n\nהשורה התחתונה: קורס קשה מאוד ולא כיפי בכלל.", "timestamp": 1597782058658}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: אבינועם קולודני\nחוות דעת - הרצאות: ההרצאות התנהלו בצורה בזיונית, אבינועם העביר את כל ההרצאות דרך הטאבלט והוא כתב על השקופיות דרך הטאבלט ולא על הלוח. הכל התנהל בצורה מאוד מבולגנת, מאוד לא ידידותית לסטודנטים. כמה שהוא יודע את החומר על בוריו, ככה ההרצאות התנהלו בצורה יותר גרועה.\n\nשם המתרגל/ת: שרון רכניץ\nחוות דעת - תרגולים:  מתרגלת טובה, לא יותר מזה.\n\nשעורי הבית: כל שבוע יש יבש ורטוב להגשה תוך שבוע, לכן יש עומס כי כל שבוע צריך לשבת על תרגילים חדשים. רובם ממוחזרים. אבל הם מאוד חשובים ותורמים להבנה כי הם מקיפים את כל החומר.\n\nהמבחן: 60 אחוז אמריקאיות, רובן טכניות ולכן חשוב לתרגל נושאים שונים ממבחנים שונים ומהקורסים הישנים(מעגלים אנלוגיים ומיתוג), כי התרגולים מדלגים לחלוטין על כל החישובים הטכניים וחבל ליפול באמריקאיות על חישובים. 40 אחוז שאלות פתוחות שדורשות הבנה מההרצאות, לכן חשוב ללמוד טוב מסיכומים כי ההרצאות לא מועברות בצורה טובה.\n\nהשורה התחתונה: תלוי בהוראה של הקורס, אם ההוראה גרועה אז כל הקורס הולך לפח, משעמם ומוריד את הרצון ללמוד שרשרת VLSI.", "timestamp": 1597831018800}, {"author": "nadav david", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: \nמרצה פשוט מלכה, מסבירה הכל בצורה נעימה וטובה.\n\nשעורי הבית: \nפעם בשבוע, לוקח בערך יום.\n\nהמבחן: \n\nהשורה התחתונה: חובה.", "timestamp": 1612365570438}, {"author": "כינוי בבקשה", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nליאור מלכה ואני מאוהבת בה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nעיסה בוחר רקעים נחמדים לזום\n\nשעורי הבית: \nהיו\n\nהמבחן: \nמי יודע\n\nהשורה התחתונה.", "timestamp": 1613139833261}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: עיסא\nחוות דעת - תרגולים: אחלה מתרגל, משתדל לתת אינטואיציות, והכי חשוב מסיים תרגולים בזמן (לא טריוויאלי עם האורך הלא הגיוני של חלקם)\n\nשעורי הבית: לא עמוסים בכלל יחסית לקורס של 5 נק\"ז, גיליון בשבוע, בד\"כ שתי שאלות.\n\nהמבחן: היה זוועה וההיסטוגרמה מדברת בשם עצמה\n\nהשורה התחתונה: קורס מעניין אבל עם המון חומר, מורגש שהוא חדש ואין מספיק מאיפה לתרגל וזה מבאס.", "timestamp": 1614694013333}, {"author": "Gil Sharon", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ליאור לוי\nחוות דעת - הרצאות: יודעת להסביר טוב\n\nשם המתרגל/ת: שרון רכניץ\nחוות דעת - תרגולים: מעל הממוצע\n\nשעורי הבית: תואמים את ההרצאות, לא ברורים מדי פעם\n\nהמבחן: מאוד עמוס אבל הוגן\n\nהשורה התחתונה: קורס מעניין אבל מאוד עמוס", "timestamp": 1614778615752}, {"author": "רון", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר ליאור צברי\nחוות דעת - הרצאות: מרצה טובה, מסבירה את החומר בצורה מובנת ונהירה. ישנן רשימות של דנה שמסכמות 1:1 את ההרצאות שלה. כדאי להדפיס ולכתוב על גביהן במהלך ההרצאות. חשוב לעקוב אחרי המימושים והאופטימיזציות המוצגות בהרצאה, שכן יכולות להופיע שאלות במבחן עליהן.   \n\nשם המתרגל/ת: שרון רכניץ\nחוות דעת - תרגולים: מתרגלת מצוינת. אכפתית מאוד, מסבירה את החומר בצורה טובה ומובנת, ומשקיעה המון כדי שכולם יבינו. \n\nשעורי הבית: שבועיים.  ברוב התרגילים קיים חלק יבש וחלק רטוב (LTspice). לא עמוסים. הם תקפים ומהווים 11% מהציון\nקיימים גם תרגילי הכנה שבועיים תקפים שמהווים 13% מהציון. (סה\"כ 24% תקף).\nהמבחן: \nבודק הבנה. כדאי להתעכב על השאלות של כל התרגולים ולהבין טוב טוב את ההרצאות. המבחן כולל חלק אמריקאי וחלק פתוח. שאלות שמשלבות בין דיגיטלי לאנלוגי. חשוב לזכור את כל ה- Trade-offs שנלמדו בקורס.\nהשורה התחתונה: \nקורס מבוא לעולם תכנון הצ'פים הדיגטליים (רמת המעגל) והאנלוגיים. המון חומר משני העולמות של הדיגטלי והאנלוגי. מומלץ לתרגל כמה שיותר ממבחני הקורס ולדאוג להבין את העניין. \nבהצלחה לכולם!", "timestamp": 1614851688430}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: שרון\nחוות דעת - תרגולים: מסבירה טוב כולל תאוריה. לפעמים קצת מאריכה\\מסבכת הסברים פשוטים לכאורה.\n\nשעורי הבית: יבשים ורטובים כל שבוע\n\nהמבחן: מורכב מחלק פתוח וחלק אמריקאי\n\nהשורה התחתונה: קורס עמוס אך לא קשה במיוחד.", "timestamp": 1616409470079}, {"author": "Roy Mahlab", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליאור לוי \nחוות דעת - הרצאות: \nיש המון מידע בהרצאות שעושה רושם שהוא לא כל כך רלוונטי. משהו כמו 50 עמודים בסיכום של דנה מקלדה (שתואם 1 ל1 את ההרצאות), לא מתורגל. כל החודש האחרון של הקורס מרגיש על רגל אחת. ליאור עצמה הייתה בסדר.\nשם המתרגל/ת: שרון רניץ\nחוות דעת - תרגולים: \nתרגולים חשובים מאוד, מכינים טוב לשיעורי בית ולמבחן עצמו.\nאם זה לא היה בזום כנראה שהייתי הולך למתרגל אחר.\nשעורי הבית: \nיש גיליון כל שבוע שלוקח זמן, אבל אני חושב שהם מכסים טוב את מה שהם באים לכסות. \nהמבחן: \nבמועד א הייתה הפתעה עם השאלה הראשונה שכללה 30 נקודות על משהו שלא קיבל את יחס ההשקעה בהרצאות והתרגולים המתאים. למרות זאת היה ממוצע נורמלי.\nמועד ב היה הוגן והתאים לדפוס.\nהשורה התחתונה: קורס שלוקח זמן, שווה להיות על זה במהלך  הסמסטר", "timestamp": 1616577105946}, {"author": "GiatShoham", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ליאור לוי\nחוות דעת - הרצאות: \nליאור מרצה מעולה. אדיבה, נחמדה, ועוזרת בכל קושי -הבנתי או בירוקרטי. החומר הרבה יותר עניין כשהיא העבירה אותו.\nשם המתרגל/ת: \nשרון רכניץ\nחוות דעת - תרגולים: \nמסבירה בפירוט, לפעמים טיפה יותר מדי ואז התרגול גולש להשלמות אז בסמסטר קורונה זה היה יותר קל בגלל שאפשר לראות את ההקלטה על מהירות כפולה ולחסוך את הזמן על הפירוט המורחב לפעמים. בסה\"כ מתרגלת מעולה ומסבירה טיפים ומלא דברים שעוזרים להבנת החומר.\nשעורי הבית: \nכל שבוע יש גיליון תקף שלוקח זמן + תרגיל הכנה קליל שגם תקף אבל לרוב הוא לוקח כמה דקות ועוזר להבין קצת מבוא למה שעומדים ללמוד.\nהמבחן: \nסביר ביותר, שאל יותר על דברים שראינו בהרצאות ופחות תרגולים טכניים, אז הייתי נותן דגש יותר על התיאוריה עצמה ולהבין את החומר ואיך הוא בא לידי ביטוי ברכיבים המוסברים בסוף הסמסטר\nהשורה התחתונה: קורס קשה ומורכב מהרבה חומר, אבל חומר מעניין למי שמתעניין בחומרה ובתכנון מעגלים ומגברים.", "timestamp": 1617547325232}, {"author": "חן", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: מרצה מעולה, פרקטית למבחן אבל גם מסבירה מה קורה בתעשייה ואיך מה שאנחנו לומדים רלוונטי.\n\nשם המתרגל/ת: שרון רייכניץ\nחוות דעת - תרגולים: מהמתרגלות הטובות שהיו לי, מפרקת הכל לאלגוריתמים בצורה ממש נוחה, עוברת הרבה על התיאוריה (לפעמים על חשבון להספיק את כל התרגילים).\n\nשעורי הבית: בערך פעם בשבוע, לא פשוטים אבל בערך מה שאתה מצפה מקורס של 5 נקז\n\nהמבחן: ארוך מאוד, ובכללי קשה מאוד להיות חדים על הכל כי הקורס מלא בהרבה מאוד חומר. אחרי שעוברים על חומר טוב ופותרים שאלות זה כן מתחיל לחזור על עצמו, אבל קשה להגיע למצב הזה נטו בגלל כמות החומר.\n\nהשורה התחתונה: קורס קשה ועמוס אבל הסגל טוב", "timestamp": 1626934570284}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: \nההרצאות של ליאור לא עזרו לי הרבה להבין את החומר, היא דיי מפוזרת, ומציגה את החומר בצורה די משעממת ומונוטונית\n\nשם המתרגל/ת: שרון \nחוות דעת - תרגולים: \nמתרגלת טובה, בעיה קטנה שהיא אף פעם לא מספיקה את החומר בזמן של התרגול.\n\nשעורי הבית: \nמחולקים ליבשים ורטובים, כשהחלקים של הרטובים לוקחים הרבה זמן ובסוף לא מכינים בשום צורה למבחן.\n\nהמבחן: \nהמבחן שלנו (המבחן הראשון אחרי הקורונה) היה יותר קשה ויותר ארוך ממבחנים בשנים האחרונות וגם ערב לראשונה שאלות על רעש, כשאין מאיפה לתרגל את הנושא.\n\nהשורה התחתונה: \nקורס מעניין שנראה בתחילה כטכני, אבל דורש הבנה ויצירתיות.\nכן לוקח זמן רציני במהלך הסמסטר", "timestamp": 1627363244831}, {"author": "א", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור לוי-צברי\nחוות דעת - הרצאות: נחמדה אך לדעתי לא המרצה הכי מקצועית שראיתי\n\nשם המתרגל/ת: שרון רכניץ\nחוות דעת - תרגולים: מתרגלת טובה בסך הכול\n\nשעורי הבית: יש גליון כל שבוע הכולל חישובים והרצות על LTspice - מעט מייגע\n\nהמבחן: הוגן\n\nהשורה התחתונה: הקורס די כבד - כולל בתוכו הרבה נושאים אך יש בו גם לא מעט עניין", "timestamp": 1627474616486}, {"author": "רותי ביגאוי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור \nחוות דעת - הרצאות: מרצה מצויינת , השיעור מסודר ומעניין \n\nשם המתרגל/ת:שרון  \nחוות דעת - תרגולים: הכי טובה שיש\n\nשעורי הבית: הכל מרופרנס \n\nהמבחן: אמריקאי ברובו ולכן מבלבל אבל בסהכ פייר\n\nהשורה התחתונה:  הקורס חובה גם ככה ו5 נקז ולכן ממליצה להשקיע בזה כי אפשרי לקבל בקורס ציון טוב", "timestamp": 1633946801685}, {"author": "Daniel Stumler", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: מרצה מצוינת. ההרצאות מעניינות וחשובות מאוד למבחן, אי אפשר ללמוד רק מהתרגולים. \n\nשם המתרגל/ת: שרון\nחוות דעת - תרגולים: מתרגלת מעולה. נותנת טיפים ועוד כמה נקודות מעבר למה שרשום בדפי התרגול. \n\nשעורי הבית: עמוסים אבל יש רפרנסים.\n\nהמבחן: עמוס מאוד ויחסית קשה אבל חלק גדול ממנו מרגיש טכני אחרי שפותרים מספיק מבחנים.\n\nהשורה התחתונה: קורס חשוב, עמוס ומעניין.", "timestamp": 1635076732431}, {"author": "lee shukrun", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות:  מרצה מצוינת, מסבירה היטב את החומר והופכת אותו לאינטואיטיבי יותר. לא לוותר על ההרצאות הן מאוד חשובות להבנה של הקורס.\n\nשם המתרגל/ת: עיסא \nחוות דעת - תרגולים: מתרגל מעולה, מספיק את כל התרגילים ומסביר לעניין את מה שצריך. הוא אפילו זמין במייל לשאלות.\n\nשעורי הבית: עמוסים, אך מלמדים. שווה לעבור על החומר טוב לפני שפותרים אחרת הם עלולים לגזול המון זמן.\n\nהמבחן: מבחן עמוס וצריך לתרגל הרבה כדי להספיק לענות עליו ב3 שעות. אך יש בו הרבה דברים טכניים ועם המון תרגול ניתן להסתדר.\n\nהשורה התחתונה: קורס מעולה, נהניתי בו מאוד. חשוב מאוד לסגל שהסטודנטים יצליחו וזה ניכר באופן מאוד משמעותי במידת ההשקעה שלהם.", "timestamp": 1646076323915}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ספיר ביטון\nחוות דעת - תרגולים: מושלמת. גם הקלטות של הסדנה שלה מסמסטר קודם וגם התרגולים הסימסטר היו מצויינים. מסבירה עם הרבה סבלנות ועם חיוך, מוכנה מאוד לשיעורים ומעבירה אותה בצורה מאוד מובנת\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: ללכת רק לספיר !!!", "timestamp": 1646554156206}, {"author": "natan borkowski", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: מעולות!!!\n\nשם המתרגל/ת: שרון\nחוות דעת - תרגולים: תותחית\n\nשעורי הבית: לא נוראיים בכלל ומלמדים המון .כל שבוע יבש+רטוב כל חלק בערך שעה שעתיים\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה:", "timestamp": 1646737444596}, {"author": "RR", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: הרצאות טובות\n\nשם המתרגל/ת: שרון - מוקלט\nחוות דעת - תרגולים: מעולה\n\nסדנאות: \nשווה לראות את המוקלטות של שרון לפני המבחן. במהלך הסמסטר לי הרגיש קצת עמוס ומיותר.\n\nשעורי הבית: כל שבוע חלק יבש ורטוב בספייס (לוקחים 3-4 שעות), הרטובים לא תורמים הרבה והיבשים לפעמים מרגישים גם לא ממש קשורים\n\nהמבחן: הוגן, אבל יש המון לזכור בע\"פ, כל נושא שולי יכול להופיע בצורת 30 נקודות במבחן. \n\nהשורה התחתונה: קורס שכולו טרנזיסטורים. למי שאוהב זה קורס נחמד", "timestamp": 1658999325038}, {"author": "רוי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה:  ליאור צברי\nחוות דעת - הרצאות: ההרצאות לא מעניינות אבל ליאור מלכת עולם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  נתנאל דסטה האחד והיחיד המתרגל הכי טוב בטכניון.\n\nשעורי הבית:  לא עמוסים, לפעמים קצת חופרים אבל הרבה פחות עמוסים ממעגלים חשמליים.\n\nהמבחן:  בדר\"כ הוגן, אבל יש כמויות לא סבירות של חומר אז צריך באמת להכין איזה שבוע אינטנסיבי של למידה ולא לוותר על חזרה על החומר.\n\nהשורה התחתונה: \nקורס הזייה אבל עם סגל מצוין", "timestamp": 1677929911841}, {"author": "1", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: ההרצאות בחלקם מעניינות ובחלקם קצת פחות מה שכן ליאור מעבירה אותם בצורה ממש נחמדה וזורמת,. יש הרבה, אבל מלא בקטע מוגזם, נפנופי ידיים ולכן אין צורך לקחת קשה אם לא מבינים את אחד ההסברים של \"למה הדבר הזה קורה\" אבל הכי חשוב זה לנסות כמה שיותר.  \n\nשם המתרגל/ת: נתנאל דסטה\nחוות דעת - תרגולים: אלוף עולם! ממש ממליץ עליו, מבין את החומר מעולה ומסביר אותו בצורה הבנתית. תלכו אליו, תקשיבו כמו שצריך, תבינו ואין סיבה שלא תקבלו ציון מעולה!\n\nשעורי הבית: שיעורי הבית על הפנים, בזבוז זמן בעיקר החלק הרטוב... החלק היבש עוד איכשהו תורם אבל עדיף היה לעשות רק חלק יבש ולהתמקד בלמידה האמיתית יותר מאשר סתם להעתיק גרפים מספייס ולנסות להבין מה קרה שם.\n\nהמבחן: המבחן די הוגן, בשנים האחרונות נכנסו קצת טריקים שמעידים על ניסיון להוריד ממוצע... תפתרו 6,7 מבחנים כמו שצריך, תנסו לא ליפול בפח ואתם בסדר גמור.\n\nהשורה התחתונה: לא לקחת קשה אם לא הבנתם משהו בהרצאה ושימו דגש על התרגולים!", "timestamp": 1678003149460}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ליאור צברי מוקלט\nחוות דעת - הרצאות: פצצה\n\nשם המתרגל/ת: נתנאל דסטה מוקלט\nחוות דעת - תרגולים: מדהים\n\nשעורי הבית: קצת ארוכים, אין סיבה לדעתי לעשות בלי רפרנס, סתם גוזל זמן, מספיק לעבור עליהם לפני המבחן ולתרגל המון מבחנים וזה מספיק כדי לקבל 85+ (הכל די טכני)\n\nהמבחן: מאוד הוגן. הסמסטר היה טיפה יותר קשה בעיקר בגלל השאלה הפתוחה אבל סהכ סבבה לגמרי. פתרון של מספיק מבחני עבר וחזרה על החומר מההרצאות+תרגולים מספיקה. \n\nהשורה התחתונה: אחלה קורס, חובה אז אין ברירה, אבל מעניין וחשוב לתעשייה לתפקידים מסויימים.", "timestamp": 1678041357463}, {"author": "האקר איראני", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: מרצה טובה מאוד,לפעמים קצת קשה לעקוב כי יש קצת הרבה מלל בקורס שנכתב על הלוח אבל סהכ סבבה.\n\nשם המתרגל/ת: ספיר ביטון ואז דסטה מוקלט\nחוות דעת - תרגולים: לצערי התרגולים מרגישים לא כתובים מספיק טוב, בקורס מעגלים חשמליים הרגיש לי שהם מסודרים יותר אם משווים.\nזה משליך ישירות על טיב התרגול אז עם ספיר מאוד התקשתי לעקוב ולהבין מה עובר (ככה רוב הסמסטר)\nאחכ עברתי למוקלט עם דסטה והיכולת לחזור אחורה ולהשוות מול התרגול הכתוב עזרה מאוד כי אחרת הייתי מפספס הרבה נק' טכניות.\n\nשעורי הבית: גליונות פעם בשבוע - מעיקים רוב הזמן.. עד שהגעתי למבחן הספקתי לשכוח הכל וללמוד הכל מחדש.\n\nהמבחן: טכני מאוד, תתרגלו המון ותשלטו בכל השיטות של המרה לאות קטן והתעסקות עם מגברים ואמור להיות בסדר. המבחן לא קשה רק לא ליפול בקטנות.\n\nהשורה התחתונה: סהכ קורס 5 נקז נחמד מאוד, ממוצעים סבבה, אבל כן הרבה חומר כמצופה.", "timestamp": 1679080888099}, {"author": "H", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: מרצה מהממת, כתב קצת מבולגן וקטן אבל מעבירה את החומר בצורה מעניינת\n\nשם המתרגל/ת: נתנאל דסטה\nחוות דעת - תרגולים: המתרגל הכי טוב שהייתי אצלו! רהוט ומסביר בצורה טובה ועניינית. ממליצה מאוד!\n\nשעורי הבית: לא עמוסים כמו סמסטרים קודמים, עבודה של ערב בשבוע פלוס מינוס\n\nהמבחן: קשה בגלל כמות החומר של הקורס\n\nהשורה התחתונה: זה לא שיש ברירה לקחת אותו", "timestamp": 1679256256701}, {"author": "יערה", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: \nליאור צברי\nחוות דעת - הרצאות: \nליאור מרצה די בסדר, אבל ההרצאות משעממות מאוד לדעתי. בכל הרצאה מסבירים על מלא מעגלים שלא קשורים אחד לשני בערך 10 דקות כל אחד. לא מרגיש שיש אינטואציה או נושאים גדולים שרוצים להעביר אלא אוסף די רנדומלי של דברים קטנים.\n\nשם המתרגל/ת: \nנתנאל דסטה\nחוות דעת - תרגולים: \nמתרגל מלך, אחד הטובים שהיו לי בתואר. תמיד מתחיל בחצי שעה של הסבר על החומר היבש והאינטואיציה ואחר כך פותר תרגילים תכלס. תמיד מעביר את מה שתכלס צריך לדעת בלי חרטאות ונותן מלא טריקים  ושיטות למבחן. האווירה בתרגול שלו גם ממש טובה. \nממולץ מאוד!\n\nשעורי הבית: \nגליון שבועי מציק. הגליון לא דומה בכלל למבחן אז הוא גם לא כזה עוזר. יש חלק רטוב בספייס שסתם לא מלמד כלום וחלק יבש בדרך כלל.\n \nהמבחן: \n60 נקודות אמריקאי ו40 נקודות שאלות פתוחות. לפעמים ליאור מנפיצה 15 נקודות על איזה מעגל שעברנו עליו 10 דקות בהרצאה ובתרגול לא עברו עליו בכלל. אבל לרוב יש לפחות 85 נקודות של דברים שיחסית חוזרים. צריך לתרגל טוב כי יש הרבה חומר ואפשר להוציא בסדר גמור.\n\nהשורה התחתונה: \nקורס לדעתי מאוד משעמם. מלמדים בו אוסף של דברים קטנים שאין בניהם הרבה קשר. לדעתי זה די חבל כי הקורס הקודם בנושא, מעגלים חשמליים של יינון זה לא ככה בכלל. המבחן יחסית לא נורא אז אבל.", "timestamp": 1679257406657}, {"author": "swiftie", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: מצויינת\n\nשם המתרגל/ת: שרון במוקלט\nחוות דעת - תרגולים: מסבירה טוב ודואגת להבנה\n\nשעורי הבית: סבבה אבל יותר מידי שריפת זמן\n\nהמבחן: המבחן בינוני פלוס, צריך ללמוד הרצאות ליאור היטב ולפתור לפחות 8 מבחנים כדי להיות בטוחים לעבור, יש לפחות 3 שאלות הבנה והשאר טכניקה, ניתן לקבל ציון טוב.\n\nהשורה התחתונה: קורס מעניין, אבל כמות החומר אדירה, צריך להכיר הרבה דברים ולשלוט בטכניקת הטרנזיסטורים ומשוואתם", "timestamp": 1690418430339}, {"author": "unknown", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: מסבירה היטב את החומר\n\nשם המתרגל/ת: יואב \nחוות דעת - תרגולים: אחלה מתרגל, נותן מלא טיפים למבחנים ועוזר בלפשט את החומר \n\nשעורי הבית: יש 13 תרגילי הכנה כל אחד הוא 1%. כל שבוע יש גיליון, החלק היבש מלמד וכדאי להשקיע בו. החלק הרטוב מעיק ולא תורם. התרגילים מרופרנסים.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס בסיסי לכל מהנדס חשמל, מלא חומר אבל המבחן הוגן ושואלים רק על מה שחשוב כך שלא צריך להיכנס ללחץ מכמות החומר.", "timestamp": 1691309389602}, {"author": "המשאית", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: \nליאור - יש סיכומים של סטודנטים במודל שהיא מעלה והם ממש אחד לאחד החומר שמועבר.\nמרצה מעולה ומוסיפה מלא אינטואיציות שחבל שלא קיבלנו אותם בסמסטרים קודמים.\n\nשם המתרגל/ת: נתנאל\nחוות דעת - תרגולים: מתרגל בחסד.\nמסביר מדהים, זמין ופתוח תמיד לשאלות (אפילו פתח לי ולשותף זום שעת קבלה ספונטני בחמישי בערב)\nוהסמסטר הוא גם שידר בלייב את התרגולים, הקליט ובוקר למחרת כבר היו זמינים בפנופטו.\n\nשעורי הבית: \nסבירים לקורס כזה.\n\nהמבחן: \nליאור כותבת מבחנים הוגנים סה״כ.\nלהיות על החומר במהלך סמסטר ולתרגל כמה שיותר מבחנים.\n\nהשורה התחתונה: קורס חובה", "timestamp": 1694680995884}, {"author": "אופק דהן", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: \nהתחלתי פרונטלי עם ליאור עד שיצאה לחופשת ילדה ואז עברתי להקלטות שלה. ההרצאות משעממות בקטע כואב, ליאור כשלעצמה מדהימה ומתוקה וזה הופך את זה לקצת יותר נסבל אבל באמת שהתקשיתי ממש לשמור על ריכוז.\nשם המתרגל/ת: ספיר ונתנאל\nחוות דעת - תרגולים: \nהתחלתי פרונטלי עם ספיר, שהרגשתי חוסר בבקיעות שלה בחומר, ואז עברתי לראות מוקלטים של נתנאל שהוא פשוט תותח, עשה לי לגמרי סדר בראש.\nשעורי הבית: \nלא קשים, פשוט מלא, גם יבשים גם רטובים גם תרגילי הכנה, לוקח לא מעט זמן כל העסק.\nהמבחן: \nהמבחן היה הוגן בהחלט לטעמי, מספיק לפתור 5 6 מבחנים וזה שלכם.\nהשורה התחתונה: \nקורס משמים ברמות. הלוואי והוא לא היה חובה.", "timestamp": 1716021981596}, {"author": "a", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ליאור (מוקלט)\nחוות דעת - הרצאות: \nיצאה לחופשת לידה במהלך הסמסטר ככה. עד החופשה הלכתי פרונטלי והתחברתי מאוד, אחר כך המשכתי בהקלטות שלה שלא תמיד באיכות הכי טובה בעולם, או בהכרח רלוונטים לחומר, אבל מבחינת ההעברה של החומר היא מרצה מצוינת שדואגת לוודא שהסטודנטים איתה ולהביא דוגמאות רלוונטיות. ממליץ מאוד.\nשם המתרגל/ת: נתנאל (מוקלט)\nחוות דעת - תרגולים: \nהתרגולים בקורס נהיים ברורים בעיקר כשלומדים למבחן ומבינים שרוב המבחן מבוסס על תרגילים מהתרגולים. נתנאל מסביר את החומר די טוב ומפרט איפה שצריך.\nשעורי הבית: \nקצת חופרים. כל שבוע יבש ורטוב בספייס, שלרוב גם לא מועילים להבנה או משהו של החומר. לרפרנס כמה שיותר.\nהמבחן: \nאצלינו היה הוגן סך הכל, הסוד הוא בעיקר לתרגל כמה שיותר מבחנים (אין המון המון אז אם מצליחים להגיע ל80 אחוז של השנים האחרונות מה טוב), יש כמה שאלות שחוזרות על עצמן כמו מאמץ לוגי או ניתוח של מעגל מסוים שיכולות להיות נקודות מתנה.\nהשורה התחתונה: \nקורס שבעיניי היה די מעניין בשורה התחתונה שלו, והלמידה למבחן היא בסדר.", "timestamp": 1716115447845}, {"author": "5", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ליאור לוי\nחוות דעת - הרצאות: ליאור יצאה לחופשת לידה בשבוע שש או שבע. בשישה עד שבעה שבועות אלו היא לימדה בצורה מעולה. שווה להגיע להרצאות שלה. בשבוע שמונה אלכסיי דיסקין החליף אותה, פחות התחברתי ולכן עברתי להקלטות של ליאור.\n\nשם המתרגל/ת: ספיר ונתנאל מוקלט\nחוות דעת - תרגולים: ספיר בתרגלת נחמדה בסך הכל. בשבוע שבע עברתי להקלטות של נתנאל, הוא מעולה. נתן הרבה טיפים למבחן טמעביר בצורה מעניינת וברורה.\n\nשעורי הבית: לנו היה 11 תרגילים להגשה והאחרון רשות. לרוב זה חלק רטוב וחלק יבש. לפעמים רק יבש או רק רטוב. החלק הרטוב לפעמים נחמד. החלק היבש לרוב מלמד.\n\nהמבחן: המבחן היה לא קשה לדעתי. התנהלות המתרגלים לא הייתה טובה בכלל. בשאלה מסויימת נאמר להתעלם מקבלים פרזיטים ובסוף כן רצו שנתייחס, תקנו בחלק מהכיתות וחלק מהכיתות בכלל לא אמרו משהו. בסוף פקטרו את השאלה אבל הרגיש לי יחס מזלזל.\n\nהשורה התחתונה: קורס נחמד ביותר.", "timestamp": 1716547381270}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: \nמעולה. לימדה רק חצי מהסמסטר ואז עברתי להקלטות שלה (תשאלו קודם מה רלוונטי לסמסטר כי בהקלטות בדרך כלל יש יותר חומר ממה שצריך)\nשם המתרגל/ת: נתנאל דסטה מוקלט\nחוות דעת - תרגולים: \nמדהים מדהים מדהים\nשעורי הבית: \nלא אמורים לקחת הרבה זמן. הספייס קצת מעיק אבל בסדר יש רפרנס (והסגל לא באמת משקיע בבדיקה) \nהמבחן: \nשלנו היה הוגן. לפתור הרבה מבחנים וללמוד את כל הטריקים כדי לא ליפול על שטויות \nהשורה התחתונה: קורס נחמד אבל מלא חומר. זה ייראה קשה במהלך הסמסטר אבל כשמתחילים ללמוד למבחן מגלים שזה דווקא סבבה, פשוט לתרגל המון מבחנים.", "timestamp": 1716711749718}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ליאור צברי\nחוות דעת - הרצאות: ראיתי את המוקלט שלה מהסמסטר עד שהיא ילדה ואז עברתי למוקלט שלה משנים קודמות, בעיני היא טובה\n\nשם המתרגל/ת: נתנאל דסטה (מוקלט)\nחוות דעת - תרגולים: דיי טוב, בחלק מהתרגולים האיכות לא טובה אבל נתנאל מעביר את החומר טוב\n\nשעורי הבית: סבבה היבשים קצת ארוכים אבל לרוב סבבה, הרטובים היו מיותרים בעיני ומייגעים, יש שיעורי בית כל שבוע (אצלנו פתחו את כולם בתחילת סמסטר אז היה אפשר לתקתק) ויש הכנה כזו להרצאה שלוקחת 10-15 דקות כל פעם ומזכה בנקודה לתקף של אחת כזו\n\nהמבחן: היה מבחן ממש סבבה והממוצע יעיד על כך.\n\nהשורה התחתונה: קורס נחמד ממש, ממליצה, ובנוסף הוא חובה אז לא ממש שואלים אתכם", "timestamp": 1716818928812}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: נתנאל\nחוות דעת - תרגולים: צפיתי במוקלט, מסביר טוב\n\nשעורי הבית: לא עמוסים ביחס לקורס של 5 נ\"ז, גליון אחד בשבוע שמכיל שאלות יבש ולפעמים שאלה ב-LTspice. אפשר לסיים תוך כמה שעות ואפשר למצוא רפרנס.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין לדעתי, אינו עמוס אבל יש הרבה חומר שצריך לשנן.", "timestamp": 1716980726836}, {"author": "מצטיין נשיא", "difficultyRank": 2, "generalRank": 4, "semester": "202302", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: מרצה טובה מאוד.\n\nשם המתרגל/ת: ספיר ביטון \nחוות דעת - תרגולים: אחת המתרגלות הטובות שהיו לי בתואר. מפשטת את החומר ונותנת טיפים מעולים.\n\nשעורי הבית: יש לא מעט, אבל לא נוראיים מדי. \n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס עם המון חומר, אבל אפשר לעבור אותו בהצלחה אם יש מספיק זמן ללמידה", "timestamp": 1717780307020}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ליאור\nחוות דעת - הרצאות: הכול מוקלט, סה\"כ ההרצאות בסדר חלקן טיפה מטושטשות. ליאור מעבירה את החומר הנדרש, מקצועית ועונה לשאלות. בכל שבוע נלמד נושא חדש וכמעט לגמרי בלתי תלוי בשבועות שקדמו לו - משמש כיתרון וחסרון.\n\nשם המתרגל/ת: ספיר - זום\nחוות דעת - תרגולים: מתרגלת מעולה לדעתי. היה קצת מאתגר דרך הזום לפעמים אבל סהכ מעבירה את החומר בצורה טובה ומוודאת שכולם הבינו לפני שממשיכה, וגם מביאה טיפים לבחינה.\n\nשעורי הבית: 22 אחוז מגן עבור:\n10 בחנים שבועיים במודל - יחסית קלילים, כל אחד מהם 1 אחוז ולוקח 20 דקות פלוס מינוס\n10 הגשות שבועיות - כ3 שאלות חלקן יבשות וחלקן רטובות בספייס. אורך הגליונות סבירים אך לפעמים מעיקים, בעיקר בשלבים מתקדמים בסמסטר.\n2 בונוס בגלל הסמסטר המקוצר בשבוע.\n\nהמבחן: 3 חלקים לבחינה - חלק של סעיפים פתוחים (40 נקודות) ועוד 2 חלקים של 6 שאלות אמריקאיות כל אחד (5 נקודות לאמריקאית) - בכל חלק נשאל נושא אחר בקורס. זה די RIDE OR DIE - ישנם נושאים שלא נשאלו בכלל בבחינה שלנו, אבל על הנושאים שכן נבחרים יש 6 שאלות אמריקאיות.\nהמבחן שלנו היה קל מוגזם באופן מפתיע ולכן הציונים היו גבוהים, לא קורה בדרך כלל. \n\nהשורה התחתונה: הקורס מאורגן כך שכל שבוע נלמד נושא אחר - מה שיכול לשמש יתרון וחסרון. העומס די גדול.\nלגבי הסגל - היה סעיף אחד שנוי במחלוקת בשאלה הפתוחה - ובגלל הציונים הגבוהים הסגל החליט לשנות את אופן הבדיקה עבור רק עבור אלו שהגישו ערעור ולא לכולם - מה שהיה קצת לא פייר בעיניי. פרט לכך התנהלות הסגל הייתה בסדר גמור.", "timestamp": 1721079808290}]}