{"posts": [{"author": "A", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: הפנה אותנו לראות את הוידאו,הוידאו אחלה ,פשוט משעמם\n\nשם המתרגל/ת: נעמה כהן ויונתן שרעבי\nחוות דעת - תרגולים: נעמה לא עוברת טוב על הבסיס ,עוברת מהר לתרגילים עצמם אבל מספיקה הכל גם אם טיפה נמרח לאחרי השיעור, אצל יונתן זה בדיוק הפוך, מעביר טוב את הבסיס ומתעמק בתיאוריה אבל לא מספיק כלל את התרגילים עצמם\nאם יש זמן ממליצה על שילוב של שניהם,הכין אותי טוב למבחן\n\nשעורי הבית: שיעורי בית יבשים בערך כל שבוע שהפתרונות שלהם מפורסמים מראש ,רחוק מלהיות עמוס\nלקראת סוף סמסטר יש רטוב מהגיהנום שלא ברור מה צריך לעשות בו אז צריך לפנות לו זמן, כל שאר הסמסטר לא עמוס\n\nהמבחן: חוזר על עצמו\n\nהשורה התחתונה:", "timestamp": 1602509704224}, {"author": "alon keselman", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: \nמרצה טוב, שומר על עניין, מעביר את החומר בצורה טובה, ומשלב הדגמות של סימולציות שעוזרות להבנה\nשם המתרגל/ת: \nחוות דעת - תרגולים: רוב התרגול מוקדש למעבר על החומר ולא פתירת תרגילים. המתרגלים טובים \n\nשעורי הבית: לא קלים במיוחד אבל לא נוראיים . מפרסמים פתרון רשמי שבוע לפני ההגשה, זה ממש טוב. יש תרגיל רטוב אחד, לא טירוף אבל לוקח זמן\n\nהמבחן: לא קל\n\nהשורה התחתונה: קורס מעניין , לא קל", "timestamp": 1616449241954}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: לא תמיד פשוטות - אני אישית הייתי צריך לחזור עליהן כמה פעמים עד שנהיו ברורות\n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: מתרגל נחמד\n\nשעורי הבית: יש גליון שבועי יבש ותרגיל מטלב בסוף הסמסטר. לתרגילי הבית היבשים מתפרסמים הפתרונות ב-moodle כמה ימים לפני ההגשה\n\nהמבחן: בסך הכול יחסית הוגן ואפשר להוציא ציון גבוה אם באים מספיק חדים\n\nהשורה התחתונה: קורס מעניין אך לדעתי לא כזה קל לתפוס את הנושאים המועברים בו - לפחות בהתחלה. בדומה לקורסים אחרים, ההבנה באה עם הזמן ובעיקר בלמידה למבחן", "timestamp": 1626266958548}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: \nניכר שגיא משקיע בלהסביר, אבל המונוטוניות של ההרצאה בנוסף לחומר המורכב, הופכות את ההרצאות לדיי חסרות תועלת.\n\nשם המתרגל/ת: עמית שחם וגם קובי\nחוות דעת - תרגולים: \nעמית העביר את התרגולים וקובי את הסדנאות.\nשני המתרגלים מאוד משקיעים בסטודנטים, אבל רמת  תרגולים מאוד נמוכה.\nעמית בעיקר עובר על התיאוריה בתרגולים, קצת בעייתי שהמבחן משלב גם טכניקות.\n\nשעורי הבית: \nלפעמים ברמה יותר גבוהה מהמבחן\nויש תרגיל רטוב רציני בסוף\n\nהמבחן: \nקשהלהוציא במבחן ציון גבוה כי יש תמיד שאלה 1 ( מתוך 3 ) שקשה יותר מה2 האחרות, זה דורש מעבר לתרגול.\n\nהשורה התחתונה: \nקורס חובה, שאם היה מועבר יותר טוב היה יכול לייות יותר מעניין ויותר כיף, אבל כרגע בעיקר עושים אותו רק כדי \"להעיף אותו\"", "timestamp": 1626674614661}, {"author": "Nir Gutman", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות:  היו הרצאות בזום. המרצה השקיע מאוד באפקטים וויזואלים כדי שיהיה מעניין גם בלמידה מרחוק.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא קלים. אבל הסגל פרסם שבוע לפני הדד-ליין את הפתרונות הרשמיים. אז תמיד אפשר היה ל\"רפרנס\" את התשובה הרשמית.\n\nהמבחן: \nצריך הבנה טובה של החומר. הוגן.\n\nהשורה התחתונה: \nקורס חובה ¯\\_(ツ)_/¯", "timestamp": 1628684824887}, {"author": "-ב-", "difficultyRank": 3, "generalRank": 3, "semester": "202003", "text": "שם המרצה:  גיא ברטל\nחוות דעת - הרצאות: מעביר את ההרצאות בצורה יחסית ברורה,  מאוד אכפת לו מהסטודנטים ובא לקרתם .\n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים:  מבין את החומר טוב אבל היכולת הוראה לא משהו, מאוד  עוזר מעבר לתרגולים, עונה למיילים ועוזר בשעות קבלה על כל מה שצריך.\n\nשעורי הבית: ממוחזרים ואפשר לרפרנס בקלות. ממליץ לנסות לפתור לבד כדי להיות על החומר מהלך הסימסטר\nהתרגיל בית הרטוב לוקח המון זמן במיוחד למי שלא חזק במטלב.\n\nהמבחן:  הוגן ולא היה משהו חדש, כל השאלות במבחן הופיע כבר במבחני עבר\n\nהשורה התחתונה: קורס שבמלך הסימסטר לא מבינים כלכך אבל בלמידה למבחן כשנופלים האסימונים מבינים שהוא מאוד טכני.", "timestamp": 1633961134637}, {"author": "Jo", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: מאיר אורנשטיין\nחוות דעת - הרצאות: אם מאיר אורנשטיין מרצה אחראי - להתרחק כמו מאש! הוסיף חומר נוסף והרצאות, אף אחד לא עבר את בחני הכיתה שלו וביטל מגן שיעורי בית והיה רק בוחן אמצע עם ממוצע 65.\n\nשם המתרגל/ת: קובי\nחוות דעת - תרגולים: מתרגל טוב שיודע ומבין את החומר, חלק מהזמן היה צריך להסביר את כל התיאוריה מאפס כי מאיר פשוט לא לימד.\n\nשעורי הבית: לא להגשה\n\nהמבחן: מבחן ארוך מייגע ולא פתיר למרות שמאיר טען ש 'המבחן טריויאלי ובמקום לשפוט את המבחן צריך לשפוט את פערי הידע של הסטודנטים'\n\nהשורה התחתונה:  אם מאיר אורנשטיין מרצה אחראי - להתרחק כמו מאש. הממוצע מדבר בעד עצמו - וזה אחרי פקטור של 12 נקודות למועד א'", "timestamp": 1657878612666}, {"author": "Anonymous", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: בין המרצים הטובים שנתקלתי בהם בפקולטה. מסביר מצויין, מתעכב על כל הפרטים הקטנים, וגורם לכולם להבין את החומר.\nאחד מהקורסים שמועברים טוב בפקולטה.\n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: אחלה מתרגל, מסביר בעיקר את התיאוריה וגורם להבין אותה לעומק.\nהסמסטר פחות שם דגש על התרגילים, חלקם היו לקריאה עצמית ותרמו להבנה, לדעתי חובה לקרוא לבד.\n\nהיו גם סדנאות שיעקב העביר. תרם לא מעט לפיתוח אינטואיציות והבנה. מתרגל טוב מאוד.\n\nשעורי הבית: לא קשים במיוחד, תורמים להבנה.\nמפרסמים את הגיליונות - 8 להגשה חובה מתוך 10, להגשה שבועיים מרגע שפרסמו. אחרי שבוע מפרסמים את הפתרון, ככה שאם לא הצלחתם אז יש רפרנס להיעזר בו. כדאי לנסות לפתור לבד.\n\nהמבחן: אצלנו היה בחלקו לא פשוט ודרש חשיבה, מעבר ללפתור הרבה מבחני עבר.\nחומר פתוח.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1664912679587}, {"author": "ישקי אסקובר", "difficultyRank": 2, "generalRank": 5, "semester": "202103", "text": "שם המרצה: \nגיא ברטל\n\nחוות דעת - הרצאות: \nגיא ברטל מרצה מצויין. לגיא יש מצגות שהוא מעלה למודל שאותם הוא מעביר כבר שנים. גיא יודע להעביר את החומר באופן מעניין מאוד ומעביר את החומר באופן שהוא לא \"יבש\" אלא נותן המון אינטואיציה. גיא גם עונה לכל שאלה שעולה בצורה סופר סבלנית.\nבנוסף, יש הקלטות של גיא בפנופטו שהן לא רעות בכלל, אפשר להשוות את את המצגות שהוא מעביר למה שיש בסמסטר שהוא מעביר במודול, רוב החומר זהה.\n\nשם המתרגל/ת: \nעמית שחם\n\nחוות דעת - תרגולים: \nהתרגולים הם בדרך כלל שעה בשבוע, והם מאוד עמוסים. עמית ברוב התרגולים סיים ביותר מאשר 50 דקות, אני חושב שזה היה בגלל שהיינו בסמסטר קיץ וככה הוא העביר עוד כמה תרגילים כל תרגול. \nעמית אחד המתרגלים הסבלניים שראיתי, נתן המון זמן מעצמו והיה מאוד קשוב לשאלות ובעיות שהיו לנו והתחשב בנו מאוד.\n\nיש בקורס גם סדנאות שמאוד מרוכזות ללמידה למבחן, לדעתי שווה מאוד לראות כחזרה למבחן כי זה מאוד מכוון לזה.\n\nשעורי הבית: \nהיו 2 סוגים של שיעורי בית, גליונות יבשים וגליון אחד רטוב. \nלגליונות היבשים הוציאו רפרנס שבוע לפני ההגשה, ככה שאפשר להשוות ולא להגיש שטויות. סך הכל לא נוראיים ויש רפרנס עדכני מהקורס, עזורים למבחן מאוד לדעתי. \nהתרגיל הרטוב הוא תרגיל מטלאב יחסית ארוך, עושים כי חייב, לא חושב שזה מאוד עוזר להבנה למבחן.\n\nהמבחן: \nלנו בקיץ היה מבחן קשה מאוד שגיא נתן לו 8 נקודות פאקטור. אני חושב שהוא לא היה כל כך מייצג. \nבאופן כללי, במבחן יש 3 שאלות פתוחות עם המון סעיפים כל אחת, המבחן הוא בחומר פתוח. באופן כללי המבחנים של גיא הם קשים, יש לפחות 40 נקודות במבחן שהם על הבנת החומר בלבד. גיא גם תמיד שם 2 סעיפים שלא הופיעו באף מבחן של הבנה. אני חושב שכדי להצליח, מעבר ללעשות המון מבחנים של גיא (יש כמה עשרות), כדי לוודא במשך הסמסטר שמבינים טוב את העקרונות של הקורס כי על זה המבחן תכלס.\n\nהשורה התחתונה: \nקורס מצויין. הצוות אחד המתחשבים שראיתי, מאוד פרו סטודנטים. \nלדעתי זה אחד הקורסים המעניינים מבין הקורסים הפאקולטים שהיו לי. לוקחים את הנושא של גלים וקרינה ונתונים באופן מאוד מלא את התופעות שקורות. בנוסף, מלמדים את הנושא של קווי תמסורת שהוא מאוד חשוב, באופן שמאוד מתחבר למעגליים חשמליים. \nהקורס הוא מאוד פיזיקאלי, והוא גם עובר ככה. חלק מהקורסים הפיזיקאלים עוברים מאוד מתמטי לדעתי, גיא נותן המון אינטואיציה למה תכלס קורה במציאות.", "timestamp": 1665598800746}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: \nגיא מרצה מעולה וממש נחמד. החומר של הקורס קשה, ולא בטוח עד כמה ההרצאות עוזרות. בכל זאת, יש הרבה מה ללמוד מגיא.\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: בין המתרגלים הכי טובים בנתקלתי בהם, מסביר בסבלנות, עושה מעל ומעבר כדי ליצור הבנה. התרגולים שלו כתובים לפרטי פרטים ברמה שכל הסבר וכל הערה קטנה שלו מופיעות בהרחבה ופירוט בכתב. עושה סדר בקורס הלא-קל הזה.\n\nשעורי הבית: גיליון יבש פעם בשבוע, שמפרסמים את הפתרון שלו טרם ההגשה. הם ממש חשובים, גם אם משתמשים בפתרונות, זה מכריח לעבור על התרגול שוב ולהבין אותו לעומק. יותר קשים מרמת שאלות ממבחנים, אבל ממש בונים הבנה טובה.\nבנוסף יש גיליון רטוב אחד שלא ממש עוזר להבנה של חומר הקורס בעיניי, והוא סתם ארוך.\n\nהמבחן: טרם היה, אבל עושה רושם של מבחן הוגן מאוד.\n\nהשורה התחתונה: קורס לא קל, אבל עם התרגולים של עמית ועם שיעורי בית ממש אפשרי לעבור אותו.", "timestamp": 1675322546762}, {"author": "Daniel", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: מרצה טוב מאוד\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגל מצוין! מאוד משקיע בתרגולים ובשעות הקבלה. \n\nשעורי הבית: לא עמוסים ומכינים טוב למבחן\n\nהמבחן: המועד הזה היה הוגן מאוד. \n\nהשורה התחתונה: קורס טוב עם אחלה סגל! כמו שכתבו לפני, ניכר שהסגל מתחשב ומשקיע.", "timestamp": 1677102653205}, {"author": "סטונדט 0", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיא \nחוות דעת - הרצאות: מרצה טוב, עונה על שאלות ומעביר אינטואיציה לחומר.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגל תותח! משקיע המון לטובת הסטודנטים ומסביר ברור.\n\nשעורי הבית: 8 גיליונות יבשים מתוך 10 בשביל 10% תקף. שיעורי הבית מאוד מלמדים והסגל מפרסם פתרונות שבוע לפני ההגשה.\nבנוסף יש עוד 10% תקף של תרגיל מחשב, טיפה מיותר אבל לא מסובך בכלל.\n\nהמבחן: הוגן מאוד, בדיקה מאוד מתחשבת.\n\nהשורה התחתונה: אחלה קרוס עם סגל מצוין.", "timestamp": 1677149691028}, {"author": "אלון אדלשטיין", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: מעולה \n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: וואו המתרגל הכי טוב שקיים \n\nשעורי הבית: מומלץ \n\nהמבחן: היה מאוד הוגן \n\nהשורה התחתונה: אחלה קורס ועמית מעולה", "timestamp": 1677534662876}, {"author": "אימפדנס לא מתואם :(", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: ההרצאות ברורות ומפורטות, הרבה פיתוחים מתמטיים שלא מאוד קריטיים להבנת החומר.\nגיא קצת מונוטוני אבל מאוד נחמד ומסביר פנים\n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: טופ 3 מתרגלים שלמדתי אצלם, ממש משקיע בלהנגיש את כל החומר, מלמד בצורה ברורה ומעמיקה ומאוד בא לקראת הסטודנטים (הייתי בהמון מילואים הסמסטר ועמית נתן לי לבנות לעצמי את לו\"ז ההגשות בקורס)\n\nשעורי הבית: 8 מ10 יבשים שמאוד מכינים למבחן, כדאי לעשות לבד ולהתאמץ. מפרסמים פתרון קצת לפני ההגשה ככה שמשתלם לנסות לבד ומקסימום לבדוק תשובות\nרטוב- שווה 10% תקף, קצת לא מוסיף להבנה של הקורס, אבל קליל יחסית לתמורה שלו\n\nהמבחן: המבחן היה סופר הוגן, עמית אמר שכדאי לחזור על שיעורי הבית וחלק גדול מהמבחן היה אחד לאחד כמו תרגילי הבית\n\nהשורה התחתונה: קורס לא מאוד מעניין בהכרח לכולם- אבל זה קורס חובה, בנוי טוב, מבחנים יחסית הוגנים וסגל סופר נחמד ומתחשב", "timestamp": 1677835777670}, {"author": "חשמלטור", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: ההרצאות טובות יחסית למשוואות המסובכות שמפתחים, סהכ נהנתי. גיא מאוד משקיע ומעוניין שנבין, יש מקום לשאול שאלות והוא תמיד מנסה להיות כמה שיותר ברור ופשטני.\n\nשם המתרגל/ת: עמית שחם המלך\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי בתואר, אכפתי, משקיען ויודע המון המון, שווה לשאול אותו תמיד שאלות על החומר וגם מחוץ לחומר, גם פרונטלית וגם במייל עושה מעל ומעבר כדי להסביר וכדי שתבין.\nחבל שיש רק שעה אחת של תרגול כי בכיף אפשר לעשות את זה שעתיים ועדיין נצטרך עוד זמן לעכל את החומר - לא פשוט.\nהתרגולים כתובים היטב ומעבירים את החומר מסודר מאוד.\n\nשעורי הבית: מרגיש שהרטוב די מיותר, גליונות יבשים הם טובים ועוברים על החומר וגם מהם לומדים טוב.\n\nהמבחן: מועד א' היה הוגן מאוד פרט לעובדה שהיה קצת לחוץ בזמן, אבל היה מקיף וטוב.\n\nהשורה התחתונה: קורס פיזיקלי נהדר, מרגיש שלומדים הרבה וטוב.", "timestamp": 1679079358287}, {"author": "אלון", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גיא\nחוות דעת - הרצאות: המוקלטות מעולה \n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: מתרגל הכי טוב שהיה לי בטכניון \n\nשעורי הבית: שאלות ממבחנים מאוד עוזרים להבנת החומר ומתפרסם תשובות כמה ימים לפני תאריך ההגשה \n\nהמבחן: די הוגן אם מגיעים מוכנים ומתרגלים מספיק סביר להוציא 80+ \n\nהשורה התחתונה: עמית שחם המלך", "timestamp": 1679769155622}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מאיר\nחוות דעת - הרצאות: \nאי פעם ישבתם בהרצאה ואמרתם לעצמכם \"למה אני צריך את הקורס הזה, למה אני צריך את התואר הזה?\" כי מאיר בוודאות יגרום לכם להרגיש ככה. ההרצאות הכי משעממות שנכחתי בהן בחיי.\nשם המתרגל/ת: מתן\nחוות דעת - תרגולים: עדיף לוותר ולראות מוקלט או לקרוא את הדפים פשוט. ניכר שאין לו כוח להעביר את התרגול. \n\nשעורי הבית: \nחלק מהשאלות קשות, אבל לרוב יש רפרנס ואפשר להסתדר.\nהמבחן: \nהמבחן של מאיר היה קשה פי כמה מהמבחנים של גיא. הוא ביקש דברים לא סבירים במסגרת מבחן. בכלל נראה שמאיר מעביר את הקורס כדי להתלונן על הסטודנטים אח\"כ.\nהשורה התחתונה: לא ברור למה הוא לא חלק משרשרת גלים. הוא לא רלוונטי לחיים. לא רלוונטי לתואר. ואם הוא חובה אז לקחת עם גיא. אל תיקחו עם מאיר! הוא יכשיל אתכם!", "timestamp": 1705432368809}, {"author": "5", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גיא ברטל מוקלט\nחוות דעת - הרצאות: מרצה מעולה. גיא בן אדם נעים והוא גם מסביר מעולה.\n\nשם המתרגל/ת: עמית מוקלט\nחוות דעת - תרגולים: מתרגל מעולה.\n\nשעורי הבית: שיעורי בית טובים. שאלות שמזכירות בחינה ולפעמים שאלות ממבחני עבר. כמה ימים לפני ההגשה הם מפרסמים את הפתרון כך ששוה לנסות להתמודד לבד.\n\nהמבחן: ארוך אבל הוגן. לפעמים יש סעיפים קשים.\n\nהשורה התחתונה: קורס מומלץ ומלמד.", "timestamp": 1716547536567}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גיא ברטל\nחוות דעת - הרצאות: גיא יודע על מה הוא מדבר ודואג שכולם יבינו (ברמת הלשאול סטודנט ספציפי שנראה מבולבל מה הוא לא הבין)\n\nשם המתרגל/ת: עמית שחם - מוקלט\nחוות דעת - תרגולים: ממש טוב ומסביר לעומק\n\nשעורי הבית: הגשה אחת לשבועיים כשבשבוע השני הם כבר מפרסמים את הפיתרון (זה יותר כדי שננסה) והם מזכים ב10% מגן (או תקף? לא סגורה) ויש תרגיל מחשב שמזכה ב10% נוספים שהוא קצת יותר כבד משיעורי הבית היבשים (שימו לב שפותחים אותו לפני שלמדתם לענות על כל השאלות אז אל תשברו על זה את הראש ישר)\n\nהמבחן: היה מבחן דיי סבבה והם התחשבו בבדיקה בעיני ובדקו בעין טובה\n\nהשורה התחתונה: קורס נחמד ביותר ולא עמוס במיוחד", "timestamp": 1716819204763}]}