{"posts": [{"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "201901", "text": "שם המרצה: יינון סתיו\nחוות דעת - הרצאות: מעניין, ומשתלב יפה עם התרגולים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דומים לשאלות ממבחנים\n\nהמבחן: לא מסובך\n\nהשורה התחתונה: קורס מעניין ולא עמוס במיוחד", "timestamp": 1597823168602}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מרצה מעולה, מסביר את החומר טוב. התרגולים מספיקים בעקרון אבל אני נהניתי מההרצאות.\n\nשם המתרגל/ת: ג'ומאנה\nחוות דעת - תרגולים: ה-מתרגלת. הכיתה שלה הייתה עמוסה מאוד, מה שלפעמים קצת הקשה על מהלך התרגול, אבל זה שווה את זה, היא תותחית אמיתית. \n\nשעורי הבית: היבשים אלו שאלות ממבחנים, רטובים לא עמוסים אבל כן דורשים זמן. כדאי לפתור את השאלות היבשות לבד, זה נותן מושג טוב לגבי הרמה של המבחן וסגנון השאלות.\n\nהמבחן: לא קשה במיוחד, אמריקאי עם מבנה שחוזר על עצמו.\n\nהשורה התחתונה: אחלה קורס, אפשר להוציא בו ציון גבוה.", "timestamp": 1597832107301}, {"author": "ענבל", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יינון סתיו \nחוות דעת - הרצאות: \nמעולה. מסביר בצורה מאוד ברורה\nשם המתרגל/ת: אורי ריינהרט\nחוות דעת - תרגולים: \nמתרגל מעולה. מומלץ\n\nשעורי הבית: \nעמוסים מאוד. \nהמבחן: \nקשה , אך תואם לחלוטין את החומר של הקורס.\nהשורה התחתונה: \nקורס מעניין , אפשר לוותר על הרצאות כי הן מאוד מפורטות והתרגולים מספקים", "timestamp": 1599212502275}, {"author": "Neta Becker", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אריאל אפשטיין\nחוות דעת - הרצאות: \nממש נהניתי בהרצאות שלו. מסביר מעולה ומדבר בגובה העיניים\nשם המתרגל/ת: אורי ריינדהארט\nחוות דעת - תרגולים: \nמתרגל מעולה, מסביר את החומר בצורה מעולה ומוכן להתעכב על דברים אם יש צורך\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס", "timestamp": 1600864553873}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות:  לא ראיתי\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: תרגולים פצצה מסבירה מעולה.\n\nשעורי הבית: עמוסים \n\nהמבחן: טכני \n\nהשורה התחתונה:", "timestamp": 1601893301104}, {"author": "און", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יינון סתיו\nחוות דעת - הרצאות: מרצה מעולה, מסביר טוב\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: ממש טובה\n\nשעורי הבית: החלק היבש - שאלות ממבחנים ולהכל יש תשובות ורפרנסים. החלק הרטוב - עבודה עם תוכנת LTspice רואים את הסדנה וזה מספיק\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1611393826474}, {"author": "מיכאל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: משה פורת\nחוות דעת - הרצאות: קצת ישנוני אבל נחמד ויותר ברור מינון לדעתי \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: מתרגל מעולה,שולט בחומר,ממש מומלץ!\n\nשעורי הבית: \nהבחינה של שנת 2017 לאורך כל הסימסטר.ברטובים קצת מציק אבל היבש בסדר גמור\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612254817472}, {"author": "ד", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: ארוכות מרחיבות יותר מדי לפי דעתי מיותרות גם\n\nשם המתרגל/ת: נעם\nחוות דעת - תרגולים: מאוד עוזרים להבנת מחומר מתרגלת נחמדה מאוד מעבירה את החומר טוב \n\nשעורי הבית: צריכים קצת השקעה אבל עוזרים להבין את החומר ובמיוחד שדומים לשאלות ממבחנים\n\nהמבחן: עומד זמן צריך לתרגל מבחנים טוב\n\nהשורה התחתונה:", "timestamp": 1613035784939}, {"author": "ביאן", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מרצה נחמד מסביר את החומר בצורה פשוטה וברורה. החומר קצת כבד ויש מלא נוסחאות. אבל יש דף עזר במבחן!\n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: מתרגלת מצטיינת מעבירה את התרגולים בצורה ברורה, מסבירה הכל ולא מדלגת על אף שלב. יש אווירה כיפית בתרגולים שלה!!\nכשהיה זמן מספיק היא עשתה תרגילים ממבחנים.\n\nשעורי הבית: 13 שיעורי בית, רובם בסגנון של 6 שאלות יבש ו-3 שאלות רטוב. (ממוחזרים משנים קודמות).\nצריך להגיש 12 שיעורים והם תקף לציון הסופי.\nלא קשים במיוחד, אפשר לעשות כל תרגיל (יבש + רטוב) תוך 4 - 6 שעות.\n\nהמבחן: מבחן סביר חוץ משאלה אחת שהייתה ממש קשה ולקחה זמן רב. מבחינת זמן היה סביר ומותאם לשאלות.\n22 שאלות, מבחן קצת ארוך אבל יש זמן לרובו.\nצריך לתרגל מבחנים ככל האפשר.\n\nהשורה התחתונה: קורס מעניין, מי שאהב ספרתיות מבטיח שיתעניין בזה גם.", "timestamp": 1614518770473}, {"author": "Fadi Jeries", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד״ר ינון\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: נועם ליבי\nחוות דעת - תרגולים: ממליץ בחום, מקצועניות וחיוכים \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614550085936}, {"author": "ליאור גורליק", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: סתיו ינון\nחוות דעת - הרצאות: \nאישית איבדתי בהן עניין באמצע הקורס, התרגולים מכסים את החומר בעשירית מהזמן. סתיו ינון אחלה מרצה ומסביר בצורה ברורה. \nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: \nהתרגולים מעניינים, מלמדים את החומר באמצעות הקדמה ופתירת תרגלים ממבחנים. נעם מתרגלת מעולה ונחמדה, לפעמים קצת קשה לשמוע אותה בזום אבל מתרגלים.\nשעורי הבית: \nבזוגות, מטלה בשבוע, תרגילים שלקוחים ממבחנים קודמים, ככה שאפשר אפילו להיעזר בפתרונות+ תרגילים בתוכנה בשם LTSpice ממש מכווינים בש\"ב מה לעשות בתוכנה.\nהמבחן: \nאמריקאי, ולחוץ בזמן. יש המון חומר, והמון שיטות, אך התרגולים ותרגילי הבית מכינים טוב למבחנים. המבחן מאוד טכני. אז עם כל מבחן משתפרים. יש כ22-24  שאלות אז גם אם נתקעים על שאלה זה לא הורס את כל המבחן.\nהשורה התחתונה: \nהקורס נחמד, קשה, ומאוד טכני. כלומר עם הכנה טובה למבחן אין סיבה לא להצליח. ש\"ב 24% מהציון שזה נחמד, והציונים יחסית גבוהים בקורס.", "timestamp": 1614590861973}, {"author": "שירי טל", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מעניין ומסביר אחלה, גם נחמד ממש\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: נועם המלככההההה מסבירה מושלם ללכת רק לנועםםםם!!!!!\n\nשעורי הבית: לא עמוסים, והיבשים ממש ממש עוזרים למבחן. הם אשכרה שאלות שלקוחות ממבחנים, אז זאת הכנה מעולה\n\nהמבחן: סבבה, אמריקאי, טריקים שחוזרים על עצמם, ואין התכחמויות מעצבנות לרוב.. \n\nהשורה התחתונה: סגל מעולה שבאמת רוצה שנצליח ולא בא להכשיל, הם ממש מפנים לרפרנס בש\"ב ועוזרים המון בשעות קבלה!", "timestamp": 1614591594325}, {"author": "תבנין - נורטון", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: \nההרצאות הראשונות שלו (עד שבוע 5-6) היו מעולות.\nקשה העובדה שזה 3 שעות ברצף אבל הוא העביר אותם בצורה מעולה, היה המון שיתופי פעולה ושאלונים לבדיקת ידע שתמיד השאירו את השיעור בחיים וזה היה מעולה.\nהחל מהשבוע השישי הקורס נכנס חזק מאוד לפיתוחים מתמטיים והפכו את הקורס למשעמם, ההרצאות הפכו בעייני למיותרות ומספיק היה לעבור על הסיכום וללכת לתרגולים כדי לא לבזבז זמן.\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: \nבפער, המתרגלת הטובה ביותר שאפשר היה לבקש, מה גם שהיא גם המתרגלת האחראית במקצוע והיא הייתה מדהימה.\n\nהתרגולים היו במקום, סופר רלוונטים עם חזרה זריזה על השבוע האחרון בהרצאות והמון שאלות ממבחנים, לנעם היו מצגות משלה שהכילו עוד שאלות שלא היו למרצים אחרים ובאופן כללי נגעו בדיוק לדברים הרלוונטים במטלות הגשה - היה מעולה!\n\nשעורי הבית: \nהשיעורי בית כוללים חלק יבש שלקוח ממבחנים וחלק רטוב שמצריך סדנה לפני שניגשים אליהם.\nהסדנה הייתה מיותרת לחלוטיין ולא תרמה בעייני כלום, במקום שעה שבועית של הסדנה היה עדיף לוותר עליה ולראות ביוטיוב סרטון של 10- 15 דקות שסוגר את הפינה לחלוטיין ויותר מזה.\nהמבחן: \nעמוס בכמות החומר בעייני כי יש 22 שאלות על נושאים לא ממש תלויים אחד בשני ככה שכל נושא שנלמד יופיע בבחינה ויש קצת לחץ של זמן אבל המבחן הוא אמריקאי ולחלוטיין אפשרי להוציא ממנו ציונים טובים.\nהשורה התחתונה: \nנעם מתרגלת מדהימה, צריכה להיות השיבוץ הראשון במערכת וכל השאר להתאים מסביב", "timestamp": 1614603064762}, {"author": "סטודנט מבסוט", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ינון \nחוות דעת - הרצאות: מרצה טוב, אבל ההרצאות מאוד תיאורטיות ומורחבות. אין צורך בכך. התירגולים לגמרי מספיקים. \n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה ממש טוב את החומר ויש לה הרבה סבלנות לשאלות.\n\nשעורי הבית: פעם בשבוע, יבשים שהם שאלות ממבחנים ורטובים הכוללים עבודה עם ה spice.\nהרטובים ממש מיותרים ולא תורמים בכלום להבנה של הקורס.\nהמבחן: מבחן הוגן רוב שאלות אמריקאיות וקצת שאלות הזנה במודל. בסוף יש ממוצע די גבוה.\n\nהשורה התחתונה: קורס שאפשרי להוציא בו ציון גבוה, שווה להשקיע.", "timestamp": 1614622101686}, {"author": "Gil Romano", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: \nמרצה טוב אם כי קצת מפוזר בהסברים.\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: תותח\nשעורי הבית:\nהגשה כל שבוע, לא קשה מידי ולהכל יש רפרנסים. הסימולציות בספייס יכולות להיות קצת מעצבנות וארוכות.\nהמבחן: \nסביר מאד..\nהשורה התחתונה: קורס נחמד", "timestamp": 1614675244749}, {"author": "נורטון", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: משה פורת\nחוות דעת - הרצאות: ההרצאות די מיותרות.לא צריך להתעמק בהם יותר מדי\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים:מתרגל אלוף.שולט בחומר,יודע איך להעביר אותו גם.ממש ממליץ \n\nשעורי הבית: אחלה ש.ב.מלמדים ופתירים\n\nהמבחן: מבחן שאפשר וצריך להוציא בו ציון טוב מאוד.\n\nהשורה התחתונה: בהתחלה הקורס לא מובן אבל לאט לאט הוא אחלה קורס", "timestamp": 1614681313046}, {"author": "כללי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה:ינון  \nחוות דעת - הרצאות: \nמבולגנות ועוסקות הרבה במתמטיקה שמאחורי החומר\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: \nמושקעים ומועברים בצורה טובה, אפילו מספיקים בפני עצמם על מנת להבין את החומר\nשעורי הבית: \nגיליון אחת לשבוע חשוב על מנת להבין את החומר\nהמבחן: \nאמריקאי\nהשורה התחתונה:", "timestamp": 1614835899262}, {"author": "חשמלטור", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: ההרצאות מלוות בקובץ מדויק עם כל פרטי ההרצאה כך שלעתים אפשר גם לעבור בקריאה על הקובץ. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים עוברים בצורה טובה על כל החומר.\n\nשעורי הבית:  ממבחנים, מלמדים. לוקחים די הרבה זמן.\n\nהמבחן: מבחן פייר ומקיף את כל החומר.\n\nהשורה התחתונה: קורס טוב.", "timestamp": 1615024884165}, {"author": "סטודנט כללי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: הרצאות מעולות. מסביר טוב וברור את החומר באמצעות מצגות שבנויות טוב מאוד ומתאימות למהלך הסמסטר.\n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: מתרגלת טובה, אווירה טובה בתרגול ודואגת להסביר ולענות על שאלות של הסטודנטים.\n\nשעורי הבית: \nגיליון מדי שבוע, בנוי בעיקר משאלות ממבחנים ותורם מאוד לחיזוק ההבנה של החומר.\nהמבחן: הוגן ובעיקר טכני.\n\nהשורה התחתונה: קורס חביב מאוד", "timestamp": 1615110857657}, {"author": "יד", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ינון\nחוות דעת - הרצאות:  דיי מיותרות \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: מלאך ותותח\n\nשעורי הבית: יבשים חשובים, רטובים מיותרים ברמות\n\nהמבחן: סופר טכני, חוזר על עצמו.\n\nהשורה התחתונה: קורס חובה, מאוד מאוד טכני", "timestamp": 1615286531510}, {"author": "ביגוס חשמלטוס", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מרצה מעניין מאוד, מסודר ומאורגן. בהרצאות יש המון תיאוריה והן עמוסות מאוד, בפועל אפשרי ללמוד רק מתרגולים, ההרצאות טוב בשביל הקשר שיהיה קצת יותר קל בתרגול. אל תיבהלו מהמתמטיקה שיש בהרצאות זה לא רלוונטי.\n\nשם המתרגל/ת: נעמי אבקסיס\nחוות דעת - תרגולים: מתרגלת מעולה מאוד מומלצת, שולטת בחומר ומעבירה אותו בצורה טובה. רואים שאכפת לה מהבנת הסטודנטים. \n\nשעורי הבית: קצת עמוס שיש אותם כל שבוע באופן קבוע, אבל זה אפשרי והתרגיל היבש טוב ועוזר בהטמעת החומר. התרגילים הרטובים מרגישים מיותרים, פעמים בודדות הרגיש שזה עזר איכשהו בהטמעת החומר, והרבה מידי זמן הוקדש בהתעסקות עם התוכנה ולהבין מה רוצים בשאלות.\n\nהמבחן: קצת לחוץ בזמן, אבל עם אימון אפשר להוציא ציון טוב. להתקל בכמה שיותר סוגים של שאלות לפני.\n\nהשורה התחתונה: קורס מעניין, והארגון שלו הוא מהטובים שראיתי - הסנכרון בין ההרצאות לתרגולים ואז לשיעורי בית, היחס של הסגל לסטודנטים ובכללי ההתנהלות של הקרוס מצוינת.", "timestamp": 1615294587134}, {"author": "שני", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: לא נכחתי/ראיתי/קראתי את ההרצאות\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: מתרגלת מדהימה! מסבירה את החומר בצורה שמאוד מפשטת את הדברים ונותנת דגשים מאוד חשובים. תמיד מתרגלת גם תרגילים ממבחנים וממש מקסימה!\n\nשעורי הבית: יש כל שבוע גיליון די ארוך שכולל חלק רטוב ויבש, הזמן שצריך להקדיש להכל יחד זה יום שלם בשבוע (אלא אם מחלקים עבודה בין השותפים ואז פחות, אם עובדים יחד על הכל צריך להקדיש זמן של יום לפחות במהלך השבוע). השיעורי בית היבשים מאוד חשובים להבנת החומר התאורטי, הרטובים עוזרים להבין גם את הדברים בצורה מוחשית יותר. \nהמבחן: אמריקאי, בסך הכל הוגן, ואם מתכננים נכון את הזמן והאסטרטגיה במבחן (ממש כמו פסיכומטרי) אפשר להצליח. אם לא, ממש קל ליפול בו. להקשיב ולזכור את הטיפים של נועם. הרמה במבחנים די אותו דבר במהלך השנים (קורס מאוד מסודר) ויש פתרונות מלאים להכל במודל.\n\nהשורה התחתונה: קורס עמוס ודורש הרבה במהלך הסמסטר, כמצופה מקורס של 4 נקודות, אבל גם קורס מעניין, מסודר וברור מאוד! מהווה בסיס חשוב לכל תחום עיבוד אותות וחשמל בכללי. לא ראיתי צורך בהרצאות בכלל, התרגול לגמרי מספיק אם מתעמקים ומקשיבים ומתרגלים את שיעורי הבית.", "timestamp": 1616317879235}, {"author": "Bar Gabbay", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מרצה מעולה, מסביר בצורה ברורה ועניינית. ההרצאות הועברו בזום אבל הוקלטו ברמה גבוהה מאוד (גם מצגת וגם לוח)\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: \n\nשעורי הבית: יבשים ממוחזרים ממבחני עבר (לרוב גם כתוב את מס' השאלה והמועד) אבל כן מכינים לדבר האמיתי.\nרטובים מיותרים ולא מלמדים במיוחד בעיניי - מצד שני לא קשים מדי.\nבממוצע - 3-4 שעות עבודה בשבוע\n\nהמבחן: הוגן, לא קל אבל שיקף את החומר בצורה הגיונית (למרות שהתקיים במודל)\n\nהשורה התחתונה: קורס חשוב ומעניין, תרגילי בית תקפים לא קשים מדי.", "timestamp": 1620194613545}, {"author": "Zeev Zukerman", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: ההרצאות יחסית מיותרות, אפשר בכיף לא לצפות בהן, או לחילופין לראות אותן מוקלטות על כפול 2.\n\nשם המתרגל/ת: אורי ריינהרדט\nחוות דעת - תרגולים: מתרגל נהדר! מספיק תמיד את כל התרגול, נותן מידי פעם העשרות, מחזק הבנה מעבר לחומר הנדרש ואם יש צורך הוא מסביר ממש טוב.\n\nשעורי הבית: שיעורי בית שבועיים, לרוב די פשוטים, מכילים חלק יבש, לרוב שאלות אמריקאיות שלקוחות ממבחנים משנים קודמות, וכן חלק רטוב, סימולציות בLTS לא ארוכות מידי.\n\nהמבחן: ניתן להתכונן תוך מספר ימים (בערך 3-4) ולקבל ציון מכובד מאוד, פשוט להריץ מבחנים.\n\nהשורה התחתונה: קורס די קליל, לא דורש הרבה השקעה, דורש תרגול רציני לפני המבחן", "timestamp": 1620722090623}, {"author": "--", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: מסודר ממש. מעשיר.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מקסימה!!! וגם ממש מסודרת ונעימה.\n\nשעורי הבית: יש רפרנס להכל אז זה בסדר. שבועיים - גם רטוב וגם יבש אז זה עמוס. אבל רוב השאלות הם ממבחנים אז זאת רמה טובה של תרגול\n\nהמבחן: קשה והרבה נושאים אז עמוס\n\nהשורה התחתונה:", "timestamp": 1625146414651}, {"author": "Hyunjoon Watterson", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "חוות דעת - הרצאות: \nמיותרות. (אפשר להסתפק בתרגולים) כך שבהתחלת התרגול עוברים על כל הדברים שנצרטך להבנת החומר המבוקש למבחן...  (אפשר לקרוא את דפי ההרצאות מהמודל אם לא סגורים על חומר כלשהו.)\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: פשוט מלכה... מפשטת את החומר בצורה טובה מאוד, דואגת לכל סטודנט, מסבירה בצורה מעניינת ואוהבת את מה שהיא עושה.\n\nשעורי הבית: \nצריך להגיש 13 תרגילי בית בעלי מגן 24% תקף.\nחלק יבש: רוב השאולות ממבחני עבר, ניתן בקלות למצוא רפרנס.\nחלק רטוב: משתמשים בתוכנה נקראת SPICE, לא עוזרת למבחן בכלל. (אולי נותנת קצת אינטואיציה)\n\nהמבחן:  24 שאלות אמריקאיות, לפתור כמה שיותר מבחנים לפני מבחן... ותוציאו 85+ בקלות.\n\nהשורה התחתונה:  קורס מעניין ובסיסי מאוד, סגל מאוד טוב. \nתשאפו לציון גבוה.", "timestamp": 1626291075194}, {"author": "Norton", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: ינון מרצה מצויין, מאוד מעמיק ומבין בחומר. עם זאת, הרבה פעמים הרגשתי שההרצאות היו לי קצת מיותרות, והיו בעיקר פיתוחים מתמטיים שלי לפחות פחות עזרו להבין את החומר.\n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: מדהימה! יודעת להסביר את החומר בקלות ובפשטות ככה שהוא נהיה ממש ברור, ונותנת שיטות מסודרות לפתרון תרגילים.\n\nשעורי הבית: פעם בשבוע, גיליון יבש ורטוב. היבשים הם שאלות ממבחני עבר בעיקר, מאוד תורמים להבנה ולתרגול של החומר. הרטובים לעומת זאת פחות - בדרך כלל הם היו ליצור סימולציה של מעגל שקשור לנושא בחומר שנלמד באותו שבוע, והם היו בעיקר מעיקים.\n\nהמבחן: מועד א סה\"כ הוגן - היו כמה שאלות בעייתיות, אבל הסגל שם לב לזה שהרבה נפלו עליהן ונתן פקטור. העיקר במבחן הוא תרגול - הרבה מהשאלות הן מאוד טכניות, אז ככל שעושים יותר כאלה ומשתפרים בטכניקה מצליחים יותר.\n\nהשורה התחתונה: קורס חובה אז אין יותר מידי מה לעשות, אבל לדעתי אחד מהיותר מעניינים.", "timestamp": 1626291256148}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: \nמרצאה מצויין, יש לו הקלטות משני סמסטרים, מסודר וברור מאוד, וגם יש לו קבצים מסוכמים לכל הרצאה, מומלץ לצפות במהירות x2.\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים:אחלה מתרגלת היא מאוד ברורה וגם מאוד מסודרת ועונה על כל השאלות.  \n\nשעורי הבית: יש גליון יבש וגיליון רטוב , היבש ממוחזר משאלות מבחנים ומאוד מאוד ממולץ לפתור את כולם מאוד עוזרים להבנת החומר, והרטוב היא פשוט משרטטים מעגל בתוכנה LTspice ועונים על כמה שאלות, לפעמים אין רפרנס או משהוא דומה אז קצת לוקחת זמן. \n\nהמבחן:.\n\nהשורה התחתונה: קורס תכני ולא כל כך קשה אבל כן צריך השקעה בפתרון שעורי הבית כדי להבין אותו לעומק.", "timestamp": 1643921276729}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון \nחוות דעת - הרצאות: מלך!!!!\n\nשם המתרגל/ת: נעם \nחוות דעת - תרגולים: מלכה!!!!\n\nשעורי הבית: שיעורי בית די קצרים במיוחד התרגילים הרטובים. מאוד מכינים למבחן כי מבוססים על מבחני עבר. מומלץ בחום.\n\nהמבחן: אמריקאי\n\nהשורה התחתונה: קורס מאוד מעניין ובסיסי בהנדסת חשמל. שווה ללמוד להכיר את החומר טוב", "timestamp": 1644138808193}, {"author": "אא", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: לא הלכתי להרצאות\nחוות דעת - הרצאות: מיותרות\n\nשם המתרגל/ת: נעם\nחוות דעת - תרגולים: מעולה!!! מעבירה את החומר באופן ברור ומלמדת מלא טריקים למבחן. האווירה בתרגולים שלה תמיד נעימה ותמיד דואגת להסביר דברים בדרכים שונות למי שמתקשה.\n\nשעורי הבית: יש גיליון להגשה כל שבוע. החלק היבש עוזר מאוד להטמיע את החומר הנלמד כי הוא נלקח ישר ממבחנים. החלק הרטוב די מעצבן ופחות מועיל אבל עוברים אותו בלי הרבה בעיות.\n\nהמבחן: אמריקאי. השאלות עצמן הוגנות, אבל האורך לפעמים מוגזם - חלק מהשאלות לוקחות 3 דקות של חשיבה ואינטואיציה, וחלק לוקחות 15 דקות ו-2 עמודים של חישובים מעצבנים. זה ממש כמו פסיכומטרי, אז כל עוד מתרגלים מלא מבחנים ונחשפים לכל הטריקים שלהם אפשר להצליח במבחן עם ציון מעולה אפילו.\n\nהשורה התחתונה: קורס מעניין וחשוב, עם מספיק השקעה אפשר לעבור אותו עם ציון גבוה.", "timestamp": 1645972032723}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: לראות מוקלט אם יש זמן עוזר להבנה, לא חובה בכלל\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: מתרגלת מדהימה, מעבירה את החומר בצורה פשוטה וגורמת להבין את הטכניקה\n\nשעורי הבית: היבשים עוזרים לתרגל ממש לקראת המבחן, הרטובים סתמיים לחלוטין\n\nהמבחן: טכני מאוד\n\nהשורה התחתונה: אחלה קורס סך הכל", "timestamp": 1645976313253}, {"author": "סטונדט", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ינון סתיו\n\nחוות דעת - הרצאות: מרצה מצוין\n\nשם המתרגל/ת: נעם לוי\n\nחוות דעת - תרגולים: מתרגלת מעולה, בין הטובות שיצא לי ללמוד איתן עד עכשיו. \n\nשעורי הבית: 12 גליונות חובה של חלק יבש שהוא ממוחזר ממבחנים וחלק רטוב שיחסית מיותר.\n\nהמבחן: אמריקאי וטכני מאוד, לעשות כמה שיותר מבחני עבר ואפשר להוציא ציון גבוה.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1646121952083}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: מרצה טוב אבל מה שחשוב זה התרגולים ולא ההרצאות. יינון מנהל את הקורס בצורה הכי מסודרת שיש וצוות הקורס כולו מאוד בעד הסטודנטים.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מדהימה!!!! ממליצה לראות הקלטות שלה ולא לייב ולעשות סיכומים תוך כדי.\n\nשעורי הבית: ריאליים מאוד ועוזרים להבין את החומר. שיעורי הבית בספייס לא נחוצים אלא רק בשביל המגן.\n\nהמבחן: היה מאוד הוגן וקליל\n\nהשורה התחתונה: אחלה של קורס. מאוד מעניין", "timestamp": 1646123968771}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: מרצה כריזמטי, לפעמים לא הכי ברור, אבל סה\"כ מרצה טוב.\n\nשם המתרגל/ת: נועם לוי\nחוות דעת - תרגולים: מושלמת! המתרגלת הכי טובה שיצא לי ללמוד איתה בטכניון בינתיים. מסבירה את החומר טוב וברור ומחדדת נקודות חשובות. מוסיפה בכל תרגול עוד שאלות חשובות ממבחני עבר.\n\nשעורי הבית: 12 גליונות חובה במהלך הסמסטר (אחד בכל שבוע). מורכבים מחלק יבש ורטוב. חלק יבש חשוב ולא ארוך מדי שכולל שאלות בנושא הרלוונטי לשבוע ממבחני עבר. חלק רטוב בתוכנת spice, מרגיש קצת פחות רלוונטי אבל לא קשה בכלל.\n\nהמבחן: 24 שאלות אמריקאיות. מבחן טכני מאוד וסגנון שאלות שחוזר על עצמו. עם הרבה תרגול של מבחני עבר אפשר להגיע לציון גבוה.\n\nהשורה התחתונה: קורס טוב.", "timestamp": 1646125274772}, {"author": "אמוגאס", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nיינון סתיו\nחוות דעת - הרצאות: \nמרצה מדהים. מעביר את החומר הזה שבבסיס שלו אמור להיות לא כזה מעניין באופן מדהים ומעניין בטירוף. אחד המרצים הטובים שהיו לי בטכניון. \n\nשם המתרגל/ת: \nנתנאל דסטה\nחוות דעת - תרגולים: \nמתרגל מצויין שהעביר את החומר מעולה. נתן מלא טריקים לפתרון והתרגולים באווירה ממש טובה. \nסופר ממומלץ.\n\nשעורי הבית: \n24 אחוז מהציון הסופי. מורכב מחלק יבש שזה פשוט שאלות ממבחנים שלדעתי שווה לעשות ולא לרפרנס כי זה ממש עוזר וחלק רטוב שלוקח ממש מעט זמן על תוכנה שנקראת ספייס. \nסך הכל יחסית לאחוז מגן, הרבה יותר מסבבה.\n\nהמבחן: \nמבחן אמריקאי שנראה אותו דבר כבר יותר מעשור, לתרגל הרבה ואפשר להצליח.\n\nהשורה התחתונה: \nקורס שחשבתי שיהיה ממש משעמם אבל הועבר מעולה והיה מעניין מאוד, שיעורי בית ומבחן סבבה. אחלה קורס.", "timestamp": 1646154885136}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: משה פורת\nחוות דעת - הרצאות: ההרצאות לא מאוד נחוצות לקורס, אבל אם כבר רואים משהו אז אפשר לראות את משה על כפול 2.5 בכיף, הוא מוותר על הפיתוחים המתמטיים ונוגע בעיקר בתכלס ובמה משתמשים וזה בעיני עדיף במיוחד מאמצע הקורס שמתחילים לעשות פיתוחים מתמטיים ארוכים כל הרצאה\n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: המתרגלת הכי מושלמת בטכניון בפער! נחמדה ברמות ומסבירה בצורה פשוטה וברורה הכל. בסוף כל תרגול נתנה דוגמאות ממבחנים ואיך להשתמש בנוסחאות מסויימות ונתנה טיפים כלליים למבחן, הבנתי שהסמסטר הזה היה הסמסטר האחרון שלה אז מומלץ להשיג הקלטות שלה כי היא מדהימה.\n\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: הלכתי אליו בעיקר לשעות קבלה, מתרגל מדהים ותמיד עוזר גם אם זה לא בדיוק שעת הקבלה הקבועה מראש שלו. הסמסטר התרגול שלו היה במקביל להרצאות במרוכבות מה שגרם לאנשים לא ללכת אליו. אם נעם לא מתרגלת, מומלץ ללכת אליו\n\nשעורי הבית: 24% תקף. מחולקים ליבש ורטוב. יבש זה שאלות ממבחנים, מכין למבחן ויש רפרנסים להכל. הרטוב זה תרגילי ספייס, מיותר ומייאש ועושים בשביל הציון. \n\nהמבחן: דומה מאוד לשנים הקודמות, והמבחן בסגנון פסיכומטרי. בניגוד לקורסים אחרים כאן המפתח להצלחה זה לתרגל כמה שיותר מבחנים ולהבין את הטריקים כי הם חוזרים על עצמם.\n\nהשורה התחתונה: קורס נחמד, אפשר להוציא ציון גבוה", "timestamp": 1646221816689}, {"author": "א", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: ראיתי את ההקלטות, מסביר טוב, אבל הרבה תאורייה מתמטית שלא בהכרח נחוצה\n\nשם המתרגל/ת: רזיאל\nחוות דעת - תרגולים: מתרגל סבבה, לפעמים קצת רץ\n\nשעורי הבית: הרבה שיעורי בית, בזוגות, חילקנו שכל פעם אחד עושה את הרטוב ואחד את היבש (הרטוב די מיותר ללמידה..)\n\nהמבחן: רק שאלות אמריקאיות, מאוד טכני, אפשר להוציא ציון טוב\n\nהשורה התחתונה:", "timestamp": 1646254130787}, {"author": "כוכבה שביט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: אחלה של מרצה שבעולם. מצליח להעביר בהתלהבות חומר שיכל להיות מאוד משעמם אם היה מועבר בצורה אחרת. החיסרון היחיד הוא שהרבה פעמים ינון מתפזר ולא מצליח להוביל אותך לפאנצ' של השיעור.\n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: מתרגלת מעולה וניכר שיש לה ניסיון רב. אצלנו היא אמרה שזה הסמסטר האחרון שבו היא מלמדת אבל אם יש לכם אופציה לראות הקלטות שלה, מומלצת בחום. לא הכי נכנסת לעומק של הדברים אבל בקורס הזה גם לא מרגיש שצריך והיא כן מביאה אינטואיציה והסברים טובים. \n\nשעורי הבית: יבש ורטוב במתכונת שבועית. היבשים חשובים וגם אם אתם והשותף מחלקים עבודה חשוב לעשות את כל היבש בשביל עצמכם. הרטובים כנראה חשובים לסגל כדי להעביר מסר, עבורכם ממש לא. אין אליהם כלל התייחסות במבחן וחוץ מלגזול זמן יקר בסמסטר הם לא תורמים יותר מדי.\n\nהמבחן: כמו שנעם אומרת הקושי העיקרי במבחן הוא הזמן. לרוב המסלולים בחשמל יש כ-4 ימים ללמוד אליו וזה מספיק ואפשר להוציא ציונים טובים.\n\nהשורה התחתונה: זה הקורס הכי מאורגן וידידותי לסטודנט שפגשתי עד כה. החומר ברור ומסודר, סגל זמין ואיכותי והכי ניכר זה שההרצאות, התרגולים והתרגילי בית מסונכרנים להפליא וממש מורגש שההבנה נבנית באופן הדרגתי ונכון. \n5 דרקונים.", "timestamp": 1646845160217}, {"author": "ת", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: אחלה הרצאות מוקלטות עושה סדר ומתרכז בדברים החשובים בעיקר, אל תתמקדו יותר מידי בפיתוחים המתמטיים, זו לא המטרה\n\nשם המתרגל/ת: נועם לוי - מוקלטות\nחוות דעת - תרגולים: טובה מאוד ,תרגולים רלוונטיים מאוד למבחן\n\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: הלכתי אליו לשעות קבלה והוא היה שפיץ, הבין ישר את השאלות המוזרות שלי וידע לענות עליהן בצורה מאוד ברורה. ממליץ. (פשוט לא הסתדר במערכת שעות התרגול שלו, ולא היה מוקלט)\n\nשעורי הבית: ארוכים מאוד בהתחלה ואז בהמשך סמסטר קצת מתקצרים, אבל משקיעים בהם (כולל להבין הכל) כמה שעות כל שבוע.\n\nהמבחן: 22-24 שאלות אמריקאיות,דורש תרגול מוקדם אבל עם 4 ימי חרישה על מבחנים אתם תראו מספיק וריאציות ותוכלו להוציא ציון טוב. חורף 22/21 מועד א' היה מבחן הוגן (בלי טריקים מסריחים) אז הממוצע גבוה בהתאם.\n\nהשורה התחתונה: אחלה קורס, בנוי מעולה ומוחזק כמו שצריך ע\"י ינון, הלוואי וכל הקורסים שאני עושה היו בנויים ומועברים ככה.", "timestamp": 1647443795947}, {"author": "1", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יינון \nחוות דעת - הרצאות: ההרצאות בחלקם מאוד מעניינות ומובנות וחלקם לא ממש ברורות ומובנות. יינון מרצה מעולה מאוד ממליץ. \n\nשם המתרגל/ת: נועם \nחוות דעת - תרגולים: מתרגלת מעולה, מאוד ממליץ. \n\nשעורי הבית: ש.ב כולם מבחינות עבר, חשוב מאוד לעשות כדי לתרגל את את החומר הנלמד וליישם אותו. \n\nהמבחן: המבחן רובו חוזר על עצמו, יש כמה טריקים שצריך פשוט ליישם, לא כל כך קשה. \n\nהשורה התחתונה: \nשורה תחתונה תשקיעו בעיקר בלהבין כל דבר בתרגולים ותעשו שיעורי בית, אם לא הבנתם משהו מההרצאות אל תרגישו רע עם עצמכם, אבל בעיקר תבינו את התרגולים.", "timestamp": 1647608462331}, {"author": "Roe", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר בצורה מעניינת. חוץ מרכיבים לא לינאריים ותופעות מעבר שצריך להשקיע יותר, שאר החומר מובן בהרצאות והתרגולים.\n\nשם המתרגל/ת: נעם \nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה ועונה על שאלות ומתעכבת על מה שלא מובן. גם התרגולים במצגות ובדפי עזר עם הסברים מפורטים\n\nשעורי הבית: 13 רטובים בתוכנת ספייס 12 יבשים תקפים התרגילים היבשים מתוך מבחני עבר, אפשר למצוא רפרנסים אבל מומלץ להשקיע ולהבין בעצמכם.\n\nהמבחן: 24 שאלות ב3 שעות, מרגיש כמו פסיכומטרי. חשוב שתהיה אינטואיציה לגבי החומר, חשוב לפתור מבחנים לפני כדי לזהות טריקים שחוסכים זמן פיתרון\n\nהשורה התחתונה: קורס הכי מסודר שנתקלתי בו אפשרי להוציא ציון טוב. כל החומר במצגות ודפי תרגול. 12 תרגילים רטובים ויבשים מעמיסים במהלך הסמסטר אבל שווים את ההשקעה", "timestamp": 1647678394298}, {"author": "לי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: לא הגעתי \n\nשם המתרגל/ת: נעם לוי\nחוות דעת - תרגולים: מתרגלת מעולה, סבלנית וממש אכפתית וגם ממש מצחיקה .\n\nשעורי הבית:  היבש נחמד אבל הרטוב ממש לא, השאלות לא היו כל כך מובנות .\n\nהמבחן: מבחן הוגן לגמרי ועם מספיק תרגול אפשר להצליח.\n\nהשורה התחתונה: קורס ממש נחמד", "timestamp": 1647781577503}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ינון סתיו/ משה פורת\nחוות דעת - הרצאות: בהתחלה הלכתי לינון ההרצאות היו טובות אבל עמוסות פיתוחים מתמטיים. ראיתי את המוקלטים של משה על כפול 2 והבנתי את החומר באותה צורה בלי כל הפיתוחים.\n\nשם המתרגל/ת: אבי קוריאט\nחוות דעת - תרגולים: מעולה. מתעכב על מה שלא מובן, משקיע זמן אישי בכל אחד\n\nשעורי הבית: היבשים חשובים מאוד. כבר מהשבוע הראשון עושים שאלות מהבחינה. הרטובים קצת מציקים, בעיקר עובדים עם תוכנה גרועה ולא מאוד תורמים להבנה אבל אין ברירה כי הכל תקף\n\nהמבחן: המבחן עמוס בשאלות, צריך לתרגל הרבה מבחנים כדי לקבל את האינטואיציה הנכונה ולדעת איפה אפשר לקצר את הדרך. סה״כ דורש השקעה סבירה ואפשר להצליח\n\nהשורה התחתונה: נהנתי מהחומר של הקורס ואפשר למצוא בו הרבה מאוד דברים מעניינים. בנוסף הקורס מסודר מאוד, ש״ב תואמים באופן מלא את ההרצאות והתרגולים.", "timestamp": 1650085879992}, {"author": "------", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: הלכתי לחצי פרונטלי חצי ראיתי אותו מוקלט. למרות שיינון הוא מקצוען, פשוט אדם שדואג שהכל ידפוק כמו שעון ומלמד מאהבה, לא התחברתי. מפוזר, קופץ מנושא לנושא ובכללי קשה לעקוב. \n\nשם המתרגל/ת: נעם\nחוות דעת - תרגולים: מושלמת\n\nשעורי הבית: היבשים זה שאלות ממבחנים שזה מעולה. הרטובים בזבוז זמן לרפרנס אם יש, אין קשר למבחן.\n\nהמבחן: קשה אבל הוגן\n\nהשורה התחתונה: קורס מעניין מינוס, השקעה כל הסמסטר תביא ציון טוב", "timestamp": 1657208987238}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: ראיתי מוקלט. מהשוואה עם חברים לא רואה שיש הבדל מהפרונטלי\n\nשם המתרגל/ת: נועם (מוקלט)\nחוות דעת - תרגולים:  היא מסבירה ממש טוב אם יש לכם מוקלט שלה תראו. \n\nשעורי הבית: 12 גליונות יבש ורטוב (גיליון 13 רשות). אפשר לרפרנס את היבש זה ממש שאלות ממבחנים אבל ממליץ כן לעשות כדי שהחומר ישב טוב. הרטוב חסר משמעות בהתחלה עוד עשיתי אותם אבל מאמצע סמסטר רפרנסתי\n\nהמבחן:  עוד לא עשיתי. נראה שזה המבחן הכי קל בסמסטר 3 ואחרי שפותרים כמה מבחנים יכולים להוציא ציון טוב\n\nהשורה התחתונה:  לדעתי עדיף לעשות את היבש ולא ללכת ישר לרפרנס. רטוב לרפרנס", "timestamp": 1657224702435}, {"author": "אחד ששרד את מועד א כדי לספר", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: מסביר מעולה, הקורס נהיה קצת מתמטי ואפל אפישהו באמצע אבל זה תכלס מגניב כי אשכרה רואים יישומים ראשוניים של כלים שלומדים במד\"ר, מרוכבות ואינפי בהנדסה. ההרצאות לא הכי קריטיות בעולם, אבל כן עזר לי להבנה ובכללי ינון הוא מרצה באמת טוב שאכפת לו. מי שבא לתואר בחשמלציה אם אהבה אמיתית לתחום יהנה בהרצאות\n\nשם המתרגל/ת: ראיתי מוקלט של נועם (היא כבר לא חלק המסגל :-( ), אבל בגדול כולם אחלה, הם עובדים עם המצגות של נועם המסרטונים, אז לכו למי שמסתדר לכם במערכת. רזיאל ונתנל דסטה טובים\n\nחוות דעת - תרגולים: קריטי בטירוף להבין כל פיפס בתרגולים! בחומר האחרון בפרק 13 של מגבר שרת, יש נושא שקוראים לו היסטרזיס, לא עוברים עליו בהרצאות ובתרגולים הזכירו את זה באיזה 10 דק בלי להתעמק. במועד א' היה 2 שאלות בשווי סופי של 8 נק על היסטרזיס! זה רצח את הסטודנטים.\n\n\nשעורי הבית: שאלות ממבחנים עבר בחלק היבש, עזר לי מאוד. הספייס נהיה יותר קליל ביחס לסמסטרים קודמים וזה ממש תרם לי לידע, אז ממליץ לעשות אותם (לא שיש אפשרות אחרת). נראה שנכנסה מחשבה לספייס כי הסימולציות נגעו בחלקים תיאורטיים של הקורס שאין זמן לדבר עליהם בתרגולים אבל הם חשובים לא פחות. חצי מהמטלה זה יבש והשני זה רטוב, סה\"כ 12 מטלות חובה עם 24% תקף\n\nהמבחן: אוי ואבוי מה הלך במועד א... בחיים לא היה מבחן כזה קשה, אתם מוזמנים להשוות עם היסטוגרמות משנים קודמות. היה לנו פקטור של 11 נקודות במועד א. בקיצור לא להתבאס כשאתם מתרגלים את המבחן שלנו. לרוב המבחנים יחסית טכניים, יש תמיד איזה 8 נק' של שאלות יותר קשות ולא ממוחזרות, אבל אם סגורים על החומר ממש טוב אפשר להצליח אותן\n\nהשורה התחתונה: \nקורס מגניב בטירוף, אני ממש אהבתי. הסגל הכי מתחשב שיצא לי לפגוש עד עכשיו בטכניון, האתר מסודר, יש פורום, מלא מתרגלים זמינים לשעות קבלה, המרצה האחראי גבר", "timestamp": 1658073278269}, {"author": "מתי יומהולדת", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אין עניין לראות הרצאות בקורס\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: תותח ממש. מתרגל טוב ונחמד עונה לכל שאלות.\n\nשעורי הבית: עמוסים וארוכים אבל תורמים להבנה\n\nהמבחן: נתנו השנה מבחן קשה בטירוף. מלא אמריקאיות טריקיות ובקושי מספיקים.\n\nהשורה התחתונה: בסהכ אחלה קורס. קוו למבחן נחמד", "timestamp": 1675878177986}, {"author": "ילדת הימוהולדת", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: \nאחלה\nשם המתרגל/ת: עומריקוש לאור\nחוות דעת - תרגולים: \nמושלם, צ'יקן ליטל.\nשעורי הבית: \nקלילים\nהמבחן: \nלמטומטם ממקודם שכתב שהמבחן היה קשה, סתם תפה ותבין מה זה תיאום אימפדנסים יאפס\nהשורה התחתונה: \nקורס נחמד וסגל תותח. אהבתי את שאלות 15 ו 16 במבחן", "timestamp": 1677688696295}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ינון (מוקלט)\nחוות דעת - הרצאות: אין צורך לראות את ההרצאות מלבד הרצון להבין מאיפה הגיעו הנוסחאות.\n\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: אחלה מתרגל. מסביר בצורה ממש ברורה ונותן עצות מעשיות איך לענות על השאלות שיהיו במבחן.\n\nשעורי הבית: גליון יבש וגליון רטוב כל שבוע בזוגות. מחלקים את העבודה בצורה נורמלית וזה יוצא יחסית סביר. בנוסף השיעורי בית 24 אחוז תקף ככה שאין ברירה אלא לעשות אותם\n\nהמבחן: \n24 שאלות אמריקאיות שחייבים להיות בפוקוס על כל שאלה גם אם היא נראית יחסית קלה לוודא שאתה לא נופל בפח ועונה נכון.\nהשורה התחתונה: קורס מאוד מסודר שאפשר להוציא בו ציון טוב פשוט לשים לב לפרטים הקטנים", "timestamp": 1678024402178}, {"author": "Grades", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nסתיו ינון מוקלט\nחוות דעת - הרצאות: \nמשעמם מאוד ולא קריטי, אבל כן יכול לתת טיפה אקסטרה מידע שיגרום להבנה יותר טובה, \nאבל חובה על פי 2 כי הוא איטיייי\n\n\nשם המתרגל/ת:\nנעמי מוקלט \nחוות דעת - תרגולים: \nמלכה, ידעה להסביר הכל מעולה ופשוט כיף לשמוע אותה מסבירה דברים\n\nשעורי הבית: \nלא כבדים במיוחד, 12 יבשים ו12 רטובים( 1 ו1 כל פעם).\nהיבש אפשר להעיף זריז, והרטוב יכול לקחת טיפה זמן.\nהיבש מאוד חשוב למבחן אבל הרטוב טיפה מיותר ושווה לרפרנס, מדי פעם נותן העמקה תיאורתית אבל לא משהו רציני\n\nהמבחן: \nצריך להיות חדים מאוד על כל הנושאים, המבחן זה כמו מרתון שצריך לעלות זריז על הרעיונות.\nסה\"כ רוב השאלות לא ברמה גבוהה במיוחד אבל תמיד יש 2-4 שאלות שהרבה נופלים בהם.\nאצלנו כמעט כולם נפלו ב15-16\n\nהשורה התחתונה: \nקורס חביב, אפשרי מאוד לסיים עם ציון גבוה.\nאני באופן אישי בהתחלה מצאתי עניין בקורס אבל תוך כדי הסמסטר נהיה יותר משעמם.\nסה\"כ, קורס מאוד טכני, טכניקה טובה אמורה להביא לך 85+ די מובטח", "timestamp": 1678950751492}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: עברתי למוקלט שלו אחרי מעט זמן, אבל הוא מנסה להפוך את ההרצאות למעניינות יותר ע\"י הכנסת שאלוים תוך כדי\n\nשם המתרגל/ת: רזיאל יצחק\nחוות דעת - תרגולים: מתרגל ממש משקיע, קבע לנו תרגול נוסף רק כדי לחדד נושאים שהוא הרגיש שפחות נסגרנו בשיעורים, ממש מתוק, מומלץ ממש! ויודע את החומר ממש טוב\n\nשעורי הבית: יש שיעורי בית יבשים ורטובים, לרוב הם בסדר אבל היו כמה ממש כבדים, היה צריך להגיש 12 גיליונות (תקף) הגיליון ה13 לא היה להגשה\n\nהמבחן: מבחן שדורש שליטה ממש טובה בחומר, ויכולת לפתור את השאלות ממש מהר, יש בו 24 שאלות אמריקאיות כאשר 10 מהן הן שאלות הנמקה לשאלה שלפני. \n\nהשורה התחתונה:", "timestamp": 1679381643179}, {"author": "Roberto", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: (לא הלכתי להרצאות)\nחוות דעת - הרצאות: (לא הלכתי להרצאות)\n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: עמוסים קצת. מקור מאוד טוב לתרגול. היבשים הם שראלות מבחנים אז כידאי לתרגל אותם. הרטוב ממש ממש מיותר.\n\nהמבחן: מחולק לנושאים. עם מלא תרגול ניתן להוציא ציון דיי טוב.\n\nהשורה התחתונה: קורס חובה. אבל ניתן להוציא בו ציון טוב.", "timestamp": 1679914233497}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: \nהפסקתי ללכת אחרי הרצאה 3... אבל לפי דעתי דווקא כן כדאי ללכת להרצאות האחרונות כדי להבין מאיפה באים הדברים. בגלל שראיתי רק תרגולים הרגיש לי שאני משננת את החומר ולא באמת מבינה אותו וזה קצת מקשה בזמן הלמידה למבחן. (אבל החומר של תחילת סמסטר כן ניתן להבין לבד)\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: \nקל לאבד אותו ולא תמיד מסביר הכל גם כששואלים אותו, אבל מעביר תרגילים חשובים ונותן טיפים טובים למבחן\nשעורי הבית: 12 גליונות חובה. מעיק מאוד, אבל לפעמים יש רפרנס. כדאי לנסות לפתור לבד כי הם ברמת מבחן.\n\nהמבחן: לא הכי קשה בעולם, אבל גם לא הכי קל.\n\nהשורה התחתונה: קורס קצת משעמם", "timestamp": 1680516434660}, {"author": "~", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: ינון סתיו\nאחלה מרצה. יש כמה נקודות בחומר שהוא קצת פחות ברור עליהן וצריך את המתרגלים שיסבירו עד הסוף, אבל סה״כ לימד מעולה את החומר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עומר\nהרבה מאוד אהבו אותו, לי אישית היה קצת יותר קשה להבין אותו (הוא רץ יחסית מהר על החומר). הייתי פעם אחת בהשלמה של פיראס והוא היה מעולה.\n\nשעורי הבית: לא קשים ולא קלים. חשוב לדעתי לעשות אותם כי זה עוזר לחומר לשקוע, גם את הרטובים.\n\nהמבחן: אני אישית שונא אמריקאיות, ככה שהמבחן לא היה my cup of tea. במועד הראשון הלך גרוע ממש למרות שהרגשתי שידעתי את החומר. יש הרבה שאלות מתחכמות וממש מורגש שמנסים בחלקן להכשיל בכוח. צריך לתרגל מלא מבחנים עד שתופסים את הקטע, אבל עדיין ממליץ בחום במבחן לא למהר לסמן תשובות - הם יודעים טוב מאוד בדיוק איפה אנשים מתבלבלים וככה הם בונים את התשובות, אז לקרוא טוב את השאלה.\nבנימה יותר אופטימית, המועד ב דווקא הלך לי מעולה ככה שיש תקווה.\n\nהשורה התחתונה: \nקורס חמוד, לא הרגשתי שמאוד הרחיב לי את ארגז הכלים אבל זה סיפתח טוב להמשך. אפשר לא ללמוד כל הסמסטר וללמוד רק לקראת המבחן, אבל אני מאוד לא ממליץ לעשות את זה.", "timestamp": 1680779698259}, {"author": "צוריאל ויזל", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהקלטות ביוטיוב, מעולה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהקלטות מעולה\nשעורי הבית: \nלעשות ש\"ב כדי להיות בעניינים , קורס עמוס אבל גם מעניין וחשוב לאותות ומערכות. \nהמבחן: \nעמוס!\nהשורה התחתונה:", "timestamp": 1683625584692}, {"author": "zubi", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: \nמרצה מעולה! בין האהובים עליי מכל התואר. יש גם אחלה הקלטות מעידן הקורונה שמחסות את אותו החומר בדיוק ובאיכות גבוה. לפעמים מעבירים הרבה חומר חסר פואנטה שהוא לא במבחן, אז אם לא מבינים את כל ההרצאה ב100%, לא לדאוג, כנראה שבתרגולים יסגרו לכם את הפינות.\n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: \nבין המתרגלים הכי טובים בטכניון, נותן מלא טיפים למבחן, מה לעשות מה לא לעשות ואיך לגשת לתרגילים. לפעמים בהרצאות החומר לא מובן בכלל והתרגולים ממש עושים סדר, במיוחד עם פיראס. הוא נותן יחס מעולה לסטודנטים ואכפת לו מאוד שתצליחו. 10\\10\n\nשעורי הבית: \nחמודים, לא כבדים מידי, ולמי שממש עצלן יש רפרנס להכל. הם מאוד חשובים להבנת החומר ולא קשים מידי, לפחות רוב השאלות.\n\nהשורה התחתונה: \nמי שנורא אוהב מעגלים עוד מלפני התואר יהנה מאוד בקורס, מוסיפים ומרחיבים עוד הרבה על נושאים חדשים וישנים וסהכ הקורס באמת מעניין!", "timestamp": 1687817067543}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: \nלא באתי אף פעם - מיותר, לכו רק לתרגולים\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: \nאין מילים הוא מצוין למדתי רק ממנו\nשעורי הבית: \nרלוונטיים להבנה של החומר וללהישאר על זה לאורך הסמסטר\nהמבחן: \nסביר \nהשורה התחתונה: קורס משעמם אבל חובה.", "timestamp": 1689497456681}, {"author": "צליל סאטובי", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: ההרצאות ארוכות, 3 שעות ברצף. די חופר, אבל אני אהבתי את ינון. הוא אחלה גבר, מצחיק גם וסתלבטן שזה חשוב שתהיה גם אווירה טובה...\n\nשם המתרגל/ת: אבי (שלומי) קוריאט\nחוות דעת - תרגולים: אבי חמודדדד אבל בלאגניסט (בקטע שפעם בטעות לא בא, לא בלאגן על הלוח). סך הכל מתרגל אחלה, מסביר טוב, בן אדם ממש נחמד.\n\nשעורי הבית: נורא, פעם בשבוע הגשה, קשהההה. חוץ מהלו\"ז הצפוף רוב הזמן השיעורים עצמם בסדר, הם בזוגות אז תנסו להסתדר על זוג לפני. עוזרים להבנה ולהיסגר על החומר, שאלות שכן מזכירות קצת לפעמים שאלות ממבחן.\n\nהמבחן: הוגן, אבל לא היה לנו הסמסטר מספיק זמן להתכונן (3 ימים אחרי מד\"ח). אז לא היה וואו, אבל נקווה שמועד ב' יהיה חביב. \n\nהשורה התחתונה: אחלה סתיו. קורס חשוב של הנדסת חשמל, אל תתפשרו על ציון נמוך... יש תקף גבוה יחסית.", "timestamp": 1690381830357}, {"author": "טרול לא קטן", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: \nינון 🍆 (רמי פורטיס) אחלה מרצה, אבל ההרצאות משעממות מאוד וגם דוחפים בהן כמות הזויה של חומר. תתכוננו ל3 שעות מראש זה לא כיף.\n\nשם המתרגל/ת: אבי קוריאט\nחוות דעת - תרגולים: \nאחד החמודים בטכניון. הוא קצת מעופף אבל אחלה של מתרגל.\nגם ממש אוהב את החומר ויודע על מה הוא מדבר.\n\nשעורי הבית: \nכל שבוע גיליון (רטוב ויבש). דיי מעיק אבל האמת שומר עליכם לא לצבור פער וכן סוגר על החומר\n\nהמבחן: \nלא המבחן הכי נורא שתעשו אבל כן מאוד טריקי וקל מאוד לאבד נקודות. ממליץ לטחון כמה שיותר מבחנים לפני כדי להכיר טריקים וגם טעויות נפוצות.\nהשורה התחתונה: \nקורס נחמד, קצת משעמם אבל אין משהו רע להגיד עליו.", "timestamp": 1690469534410}, {"author": "Tamir Manoach", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: סתיו ינון\nחוות דעת - הרצאות: מרצה טוב.\n\nשם המתרגל/ת: עומר לאור\nחוות דעת - תרגולים: מתרגל טוב, מתעלל בסטודנטים אבל בצורה טובה. מתרגל אחרי גם טוב.\n\nשעורי הבית: כל שבוע, קשה לחלק תפקידים בגלל שהחלק היבש זה 70% מהעבודה.\n\nהמבחן: מבחן הוגן, אבל קשה, אחרי הכל, זה מעוד רנדומלי לגבי המועדים. 24 שאלות אמריקיות\n\nהשורה התחתונה: קורס חובה.", "timestamp": 1691500726432}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ינון\nחוות דעת - הרצאות: המרצה המועדף עלי עד עכשיו, נהניתי מאוד בהרצאות למרות שלפעמים כן היה קשה להשאר מרוכזים עד הסןף, כל הרצאה בערך 3 שעות אבל עם ינון היה עובר מהר \n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים:  פיראס מתרגל הכי טוב שיצא לי להגיע לתרגולים שלו מסביר בצורה מאוד מובנת ומנסה כמה שיותר להסביר בצורה  וקלה להבנה,\n הוא נמצא תמיד למען הסטודנטים בעזרה בכל שאלה, בנוסף שהוא נותן הרבה מהזמו האישי שלו (לא היה חייב) כדי שכל כמה שבועות יעשה לנו שעתיים פתרון שאלות ממבחנים \n\nשעורי הבית: לוקחים המון זמן אבל מאוד רלוונטים למבחן הסופי \nכי להבדל מהרבה קורסים אחרים, לשבת ולפתור את השאלות מאוד עוזר בהבנת החומר ובתרגול ברמה של שאלות מבחן במהלך הסמסטר\n\nהמבחן: הוגן \n\nהשורה התחתונה: אחד הקורסים שאם כןן משקיעים בהם בסמסטר מצליחים בסוף.", "timestamp": 1702475748354}, {"author": "Li shai Avraham", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: בשלב מסויים עברתי להקלטות שלו מנוחות אבל הוא מרצה דיי טוב, מעט איטי אז לי היה יותר נוח בהקלטות\n\nשם המתרגל/ת: רזיאל יצחק\nחוות דעת - תרגולים: מתרגל ממש טוב ואכפתי, אפילו קבע לנו תרגול נוסף כדי לתת דגש על דברים שפחות היו מובנים לנו, ממליצה בחום\n\nשעורי הבית: חשובים, עוזרים להבנה של החומר\n\nהמבחן: מבחן אמריקאי, קשה לעמוד בזמנים שלו (יש 24 שאלות) אצלנו המבחן מועד א היה הוגן לדעתי\n\nהשורה התחתונה: קורס חובה", "timestamp": 1705162165566}, {"author": "מישהו", "difficultyRank": 4, "generalRank": 4, "semester": "202302", "text": "שם המרצה: יינון במוקלט\nחוות דעת - הרצאות: \nלא הייתי בהרצאות, ראיתי רק מוקלט. לדעתי הכי טוב ככה כי ההרצאה מלאה בחומר ולדעתי קשה להתרכז בפרונטלי ככה לאורך זמן. אבל מכיר כאלה שהלכו לפרונטלי וממש היו מרוצים, אז הייתי ממליץ לכם לבדוק מה הכי מתאים ולפעול לפי זה\n\nשם המתרגל/ת: מוקלט של נעמי\n\nחוות דעת - תרגולים: \nאחלה מתרגלת, אמנם אצלי בסמסטר היא לא תרגלה אבל ראיתי מוקלט שלה.\nממש הייתי מרוצה.\n\nשעורי הבית: \nהגליונות לא קצרים, אבל הם בזוגות. ככה שאם מחלקים את העבודה בין השניים זה לא יגזול יותר מדי זמן.\nבכל מקרה אני ממליץ לעשות אותם כי התרגילים שם ברמה של מבחן\\לקוחים ממבחן.\n\nהמבחן: \nהמבחן שלנו היה בסדר לגמרי. אחלה יינון הבחור\nממליץ לתרגל הרבה מבחנים לפני\n\nהשורה התחתונה: \nאחלה יינון הגיבור, אחלה נעמי הגיבורה, אחלה קורס\nמרגיש שהוא נותן כלים לנתח מעגלים מורכבים בצורה הרבה יותר פשוטה מאשר סתם לעשות קירכהוף", "timestamp": 1716406800672}, {"author": "אלן פייר", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: מסביר בצורה טובה מאוד אבל לפעמים קשה להתרכז 3 שעות.\n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים:  בין המתרגלים היותר טובים שיש.\nמאוד מומלץ, מסביר בצורה טובה ומובנת את החומר .\n\nשעורי הבית: קצת עמוסים אבל חשובים.\nחשוב לעשות בעיקר את היבשים זה סוגר פינות וגורם לחומר לשבת בצורה יותר טובה.\n\nהמבחן: המבחן שהיה לנו היה הוגן++.\nבאופן כללי צריך לדעת לתכנן טוב את הזמן כיוון ש24 שאלות זה לא פשוט בכלל. \n\nהשורה התחתונה: קורס מאוד נחמד, שבתאכלס מלמד איך לפתור מעגלים חשמליים במגוון דרכים עם סגל מתחשב ומקצועי.", "timestamp": 1716408800307}, {"author": "אופיר אורן", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: לא נכנסתי להרצאות. יש הכל מוקלט, אבל לא ראיתי רק נכנסתי לתרגולים. עברתי על המצגת של ההרצאה לפני התרגול וזה הספיק. \n\nשם המתרגל/ת: מאיר\nחוות דעת - תרגולים: \nתותח אמיתי. יש לו סבלנות להסביר והוא יודע את החומר מעולה. אם הוא מתרגל אצלכם אז מומלץ!!!!\nשעורי הבית: דיי עמוסים, כל שבוע לפנות לפחות 3-5 שעות. יש חלק יבש וחלק רטוב, יש רפרנסים\n\nהמבחן: במועד שלנו היה הוגן ויחסית בסדר. 80 סטודנטים קיבלו 100. יינון עשה מבחן הוגן בגלל המצב. \n\nהשורה התחתונה: צריך להשקיע", "timestamp": 1716437422625}, {"author": "S", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יינון\nחוות דעת - הרצאות: אחלה מרצה, מסביר ברור \n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: מעולה! מדבר תכלס וממש עושה סדר בחומר\n\nשעורי הבית: יש גיליון בשבוע, חלק יבש וחלק רטוב. החלק היבש חשוב להבנה, החלק הרטוב זה בתוכנה שמורידים והוא בעיקר ארוך ולא רלוונטי\n\nהמבחן: אמריקאי, הוגן. ממוצע ממש גבוה הסמסטר.\n\nהשורה התחתונה: קורס בסיסי, חשוב להמשך", "timestamp": 1716565316817}, {"author": "r", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם הקורס: מלגלים חשמליים\n\nשם המרצה: תודה ינון סתיו\nחוות דעת - הרצאות: די סזיפיות אבל לדעתי משתלם לראות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: פיראס מתרגל מעולה\n\nשעורי הבית: לוקחים זמן\n\nהמבחן: לא צריך ללמוד\n\nהשורה התחתונה: מלג מומלץ ממוצע גבוה", "timestamp": 1716637900229}, {"author": "firas lover", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יינון הקלטות\nחוות דעת - הרצאות: הרבה אנשים אומרים שהרצאות בקורס הזה מיותר וזה בגדול בעיקר בגלל שיינון הרבה פעמים מתעכב על דברים שלא רלוונטים למבחן ופתירת תרגילים ולפעמים גם מפתח נוסחאות המון זמן, וזה באמת בזבוז זמן אבל הרבה פעמים הוא כן נותן אינטואיציה וחשיבה נכונה אז אני דווקא ממליצה כן לא לוותר על ההרצאות הן עזרו לי אישית מאוד\n\nשם המתרגל/ת: פיראס רמדן <3\nחוות דעת - תרגולים:  הבן אדם המתרגל הכי טוב שהיה לי בחיים, גם משקיע המון נותן המון אינטואיציה מסביר מדהים באמת הוא מאוד מכווין למבחן וגם הוא באמת בן אדם טוב שאפשר לדבר איתו אני מאוד ממליצה ללכת אליו כל עוד הוא מתרגל\n\nשעורי הבית: ארוכים מאוד!! (הרטובים פחות) לוקח המון זמן אבל בעיני מכינים טוב למבחן (חוץ מהקונבולציה את זה תרפרנסו ותעברו הלאה אין מה ללמוד מזה)\n\nהמבחן: \n\nהשורה התחתונה: קורס באמת מאוד כיפי ומעניין המשך ישיר כזה של פיסיקה 2ממ אבל בתוך נישה אחרת - לכל אוהבי הפיזיקה זה כיף", "timestamp": 1717104102348}, {"author": "11", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ינון מוקלט\nחוות דעת - הרצאות: בסדר סה״כ, לפעמים מעניין ולפעמים קצת פחות... בכל מקרה לראות על מהירות גבוהה.\n\nשם המתרגל/ת: נעמי מוקלט\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה ממש טוב.\n\nשעורי הבית: ארוכים וקשים, הרטוב מרגיש לא רלוונטי אבל כן לפעמים נחמד לראות את מה שלומדים מתממש, היבש ארוך וקשה אבל מרופרנס.\n\nהמבחן: בדרך כלל קשה, ספציפית במועד א היה ממש קל עם ממוצע של מלג בערך...\n\nהשורה התחתונה: חצי ראשון קצת משעמם וטכני, חצי שני יותר מעניין. קורס חובה אז אין מה לעשות...", "timestamp": 1717511982518}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ינון - מוקלט \nחוות דעת - הרצאות: לדעתי אם אפשר לראות בהקלטה על 1.5, זה ארוך ומעייף אבל ההקלטות ממש מסודרות וברורות. בסהכ אחלה מרצה \n\nשם המתרגל/ת: מאיר \nחוות דעת - תרגולים: מתרגל מעולה! היה מאוד ברור ומובן ונותן אינטואיציה טובה, מומלץ. \n\nשעורי הבית: מעיקים מאוד.  כל שבוע גליון רטוב וגליון יבש. היבש יותר רלוונטי למבחן אבל גם מאוד ארוך, והרטוב ממש לא רלוונטי אני באיזשהו שלב רפרנסתי כבר. \n\nהמבחן: הסמסטר המועדים היו הוגנים מאוד, גם א וגם ב, לדעתי צריך לפחות 5 ימים של רק תרגול מבחנים. \n\nהשורה התחתונה: קורס עמוס אבל מעניין, ובנוסף  מנוהל ממש טוב, עם אחלה צוות ומבחן שאם יש זמן ללמוד אליו הוא בסדר בסוף.", "timestamp": 1718102517088}, {"author": "ליים בת אל", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ינון סתיו\nחוות דעת - הרצאות: אחלה מרצה, יש מוקלטות שלו שהן אחד לאחד מה שהוא אומר בהרצאה, כולל הבדיחות. המוקלטות מסודרות וממש עזרו. בהרצאות יש הרבה מאוד חומר תיאורטי ופחות פרטיקות לפתור שאלות. \n\nשם המתרגל/ת: פיראס רמאדאן\nחוות דעת - תרגולים: מתרגל מעולה, ענייני, מתקצר כל פעם את השיעור הקודם בתחילת השיעור וזה עושה המון סדר בין עיקר ותפל. יודע את החומר ומתורגל לכל שאלה אפשרית של תלמיד. עונה בסבלנות, בקיצור, מומלץ. \n\nשעורי הבית: תרגיל יבש מאוד ארוך, וקשור למבחן. תרגיל קטוב, פחות ארוך אם לא מסתבכים עם התוכנה, אבל לא קשור למבחן. יותר כדי לראות איך ההתנהגות של רכיבים במעגל במציאות. \n\nהמבחן: הוגן מאוד, גם במועד א וגם במועד ב. שווה לתרגל הרבה מבחני עבר לפניו. המרצה והמתרגלים עקביים עם החומר במבחן, והשאלות מסודרות לפי נושאים ככה שלפי מספר השאלה אפשר לשער על מה שואלים. \n\nהשורה התחתונה: קורס עם שתי מטלות שבועיות, הרצאה, תרגול וסדנה, נחשב עמוס בסמסטר. הוגן במבחן. אם זוהר מרצה בסדנה - ללכת !", "timestamp": 1718532651168}, {"author": "מתאם אימפדנסים", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ינון סתיו (מוקלט)\nחוות דעת - הרצאות: אהבתי מאוד. ההרצאות קלילות וינון מצליח לתת מוטיבציה ואינטואיציה טובה להכל. \n\nשם המתרגל/ת: פיראס רמאדן \nחוות דעת - תרגולים: אחלה ממש, חוזר על הנושאים העיקריים מההרצאה ומדגיש נקודות חשובות בכל נושא.\n\nשעורי הבית: היבשים ארוכים אבל חשובים כי הם מורכבים משאלות ממבחנים. הרטובים פחות חשובים, אפשר לרפרנס  אותם אבל הם לא לוקחים יותר מדי זמן.\n\nהמבחן: ניגשתי לשני המועדים, היה הוגן מאוד. הממוצע הסמסטר היה גבוה מבדרך כלל אבל זה לא אומר שהמבחנים קלים. ממליץ לחרוש מבחנים ולראות מגוון גדול של שאלות, הרעיונות מתחילים לחזור על עצמם בשלב מסוים.\n\nהשורה התחתונה: קורס חביב עם סגל מצוין.", "timestamp": 1718628955350}, {"author": "emanuel shemesh", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: סתיו יינון \nחוות דעת - הרצאות: \nאפשר לומר שהם מיותרות ובמידה במסוימת מבלבלות, בעיקר מראה את הפיתוחים של המשוואות \nיש את ההרצאות מוקלטות ב Panopto אם למשהו באמת בה לשמוע את סתיו \n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: \nעל עומר כמתרגל לא אכביר במילים שכן הוא מסיים את תפקידו כמתרגל אחראי ובפרט כמתרגל( מה שכן שמעתי על פיראס דברים טובים אז כנראה ממליץ ללכת עליו עכשיו)\nכן אומר שהתרגולים הם החלק העיקרי של הקורס ומאוד חשובים בין היתר כי המתרגלים עושים סיכום של ההרצאה ב 20 דקות הראשונות של השיעור ואומרים פחות או יותר מה אתה באמת צריך כדי לפתור שאלה \n\n\nשעורי הבית: \nארוכים מאוד בעיקר בגלל החלק הרטוב (ויש לציין מיותר)\nהמבחן:\nהסיבה העיקרית שרשמתי את החוות דעת  \nהשנה לטור המלחמה הייתה הקלת מילואים מוגזמת לדעתי שמסבירה את החציון הקלת המילואים הייתה מבחן שבו הם צריכים לצבור 70 נקודות בשביל לקבל 100 כאשר הם יכולים לענות על כל ה 24 שאלות \nכלומר אם אתה מילואימניק אתה יכל לצבור במבחן 120 נקודות אבל הציון הסופי  המקסימלי שלך הוא 100מה שמסביר את הממוצע הלא נורמלי\nמבן אמריקאי 24 שאלות\nהמבחן השנה היה בערך אותה רמה למבחנים בשנים קודמות . אולי קצת יותר קל מבדרך כלל בשאלות מסוימות כמו מעגלים מסדר ראשון ושני.\n\nהשורה התחתונה: \nקורס שיותר מאפשרי להוציא בו מעל 80\nולא להתייחס לחציון הגבוה ביותר חורף 24", "timestamp": 1718630010391}]}