{"posts": [{"author": "אורן", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nאחלה של קורס.ממש מעניין,ונותן צוהר לעולם היזמות בצורה אמיתית.\nמומלץ מאוד", "timestamp": 1644574445863}, {"author": "1", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דני לנגה\nחוות דעת - הרצאות: \nהרצאות משעממות בלי יותר מידי והסברים מהותיים, הכל באוויר\nויש למתרגל ולמרצה קטע מוזר של וויכוחים תוך כדי השיעור והקנטות אחד של השני \n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nהוא פשוט מיותר בקורס הזה , לא מורגש ולא עושה כלום\n\nשעורי הבית: \nתרגילי הבית לא קשים אבל לא ברור על מה ניתן הניקוד ואין הסבר מהותי מה צריך לעשות. גם אחרי ההגשה ההערות עליה באוויר ולא מובן איך צריך להשתפר להמשך\nהמבחן: \nמטלת סיכום שבעצם אם ההערות של מטלות הביניים היו מובנות הייתה צריכה להיות הצגה של ה\"סטארטאפ\" שלך אחרי שהפנמת את כל התיקונים מההצגות של מטלות הביניים\n\nהשורה התחתונה: \nהציונים הסמסטר ירדו משמעותית , הרגשה של זלזול מהסגל, מבחינת עניין באמת לא תקבלו ערך מוסף זה קורס של נטו נפנופי ידיים\nמבחינת קורס קל - אמנם קל אבל הציונים יכולים להיות נמוכים מאוד בלי הסברים כלל. תמנעו", "timestamp": 1664794611590}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "בגדול הקורס הוא קרב אגו בין המרצה דני למתרגל עידו , שבו דני מנחית על עידו KNOCKOUTS בלי הפסקה. לא הרגשתי שלמדתי המון על עולם הסטארטפים וגם לא יצאתי עם כלים פרקטיים להכנס לעולם הזה . הקורס מספק הצצה לעולם דרך נקודת המבט של דני המרצה , נקודת מבט מאוד מנוסה אבל גם מאוד שחוקה ומקובעת.\nהדובדבן שבקצפת הוא שהציונים בקורס לא גבוהים. במהלך הסמסטר שינו לחלוטין את שיטת הניקוד ובסוף הציון הסופי של הקורס נקבע על פי עמוד אחד שאמור לתאר את ה\"סטארטאפ\" , כמובן שלתת ציון על קורס שלם על פי עמוד WORD אחד היא שיטה אידיוטית ולכן הציונים דיי רנדומליים.\nלסיכום - לא תורם , לא מלמד ועשוי להוריד ממוצע.", "timestamp": 1664800615602}, {"author": "גל אראל", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דני ועידו המתרגל\n\nקורס מוזר ביותר.\nאפשר להגדיר אותו כ\"תולדות חייו של המרצה\" יותר מאשר קורס יזמות. המון מההרצאות מתמקדות בתולדות חייו ובהישגים של המרצה.\nחלק נוסף של הקורס מוקדש לירידות של דני על עידו המתרגל וחלק אחר מוקדש למרצים אורחים שחלקם יזמים, הרצאות די מעניינות.\n\nמטלות: \nהמטלות במהלך הסמסטר הן - להציג פיטצ' של 2 דקות על המיזם שלך. לאחר קבלת ביקורת והסקת מסקנות מהפיצ', להציג רבע שעה את המצגת על המיזם שלך במצגת . מטלות שדורשות קצת השקעה ומחשבה. אבל מאוד מעניינות ונחמד לראות פרויקטים של סטודנטים אחרים.\nואז מסתבר שכל אלו שוות רק 20% מגן. 80% מציון הקורס הוא פשוט על דף בודד ואומלל בגודל A3 שמציג בתקציר את המיזם שלך.\n\nאנחנו קיבלנו המון פידבקים ומחמאות על המצגות במהלך הקורס והיינו בטוחים שאנחנו על הגל. אך לבסוף קיבלנו ציון משפיל(!) על מטלת הדף הסופי עם הביקורת ש - \"כל הרעיון מלכתחילה לא היה נכון\" אחרי כל המחמאות במהלך הסמסטר.\nמה שגרם לנו לסיים עם ציון מינימלי (הכי נמוך בכיתה)\n\nהשורה התחתונה: \nממליץ רק כי זה קל ולא דורש הרבה וגם זה בחירה פקולטית. אבל בואו מוכנים לקבל 80. (עדיין עדיף על קורסים פקולטיים)", "timestamp": 1666114126473}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דני לנגה\nחוות דעת - הרצאות: \nמצוינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nמומלץ מאוד. פותח ראש ומרחיב אופקים.\nאת כל הידע טכנית אפשר למצוא בחיפוש בגוגל, הדבר היותר מעניין בקורס זה דני (שהקים 4 סטרטאפים), והיזמים שהוא מביא", "timestamp": 1674326326641}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דני לנגה\nחוות דעת - הרצאות: מדהים! דני נותן רקע ליזמות טכנולוגית בתור מי שבעצמו ייסד 4 סטארטאפים. ההרצאות מתחלקות לחלקים יותר תאורתיים (מושגים ביזמות / שלבים ביזמות וכו) שדני מעביר בצורה מעולה, חלקים יותר סיפוריים (עם המון קשר למציאות) בהם הוא מספר על החברות שלו ועל הקשיים/כשלונות/הצלחות. מרצה מעולה וחומר מעולה. יש גם הרצאות אורח של יזמים ויש הרצאות שבהן הסטודנטים מציגים.\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: נותן עוד ערך מוסף מעל מה שדני מביא כמי שהתנסה פעם אחת בתהליך יזמות בעצמו. זה לא משנה אם זה הצליח או לא, אפשר ללמוד הרבה מהדרך שבה הוא מספר על זה ומה היה פחות טוב ומה היה יותר טוב. \n\nשעורי הבית: כל משימה לוקחת שעתיים/שלוש. יש 3 משימות בסמסטר. אחת תקפה אבל בלי ציון. אחת (מצגת משקיעים) שהיא מגן 40 אחוז. ואחת תקפה שהיא 40 אחוז עם המגן ו80 אחוז בלי המגן (תכלס על זה נקבע הציון). \n\nהמבחן: אין\n\nהשורה התחתונה: קורס מעולה. מאוד מאוד מעניין למי שרוצה ללמוד על יזמות בין אם הוא רוצה להתנסות בעצמו או סתם להרחיב אופקים. המרצה באמת מעביר את זה בצורה מעולה. הסמסטר עוד לא נגמר ואני בכוונה כותב חוות דעת עכשיו כדי לא להיות מוטה מהציון, כי במהלך הסמסטר זה באמת היה קורס נפלא. (כנראה לא ציוני מל\"ג 95-100 אלא התפלגות 85-100 לפי סמסטרים קודמים).", "timestamp": 1711477936734}, {"author": "קאנגורו", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דני לנגה\nחוות דעת - הרצאות: נחמדות, חלק רלוונטיות יותר וחלק פחות\n\nשעורי הבית: יש שלוש הגשות, אפשר להשקיע ולשרוף עליהן הרבה זמן ואפשר גם לא והציון בסוף בכל מקרה נקבע בלי שום מפתח מסודר (יש 20% מגן על ההגשה הראשונה וזהו, לא מקבלים שום פידבק מסודר על מה הורדו הנקודות בציון הסופי ואין ציון על אף אחת מההגשות).\n\nהשורה התחתונה: חבל שהציונים אקראיים, בסך הכל קורס חביב. מתאים כדי לסגור פינה", "timestamp": 1717248872741}]}