{"posts": [{"author": "צינורית פחמן כועסת", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שמות המדריכים: הילה פדול + ינאי טובי\n- ינאי ממש אחלה בחור הוא עוזר המון והמעבדה זורמת איתו. \n- הילה טיפה הרגיש שהיא בקושי יודעת את החומר ופשוט שיננה את מה שמישהו אחר כתב לה בדו''חות . רואים שהיא לא בקיאה בחומר.\n\nמעבדות: \nמעבדות לא מלמדות כלום, זה סתם ללמוד עצמית את הדוח''ות  של המעבדות (שאגב מנוסחים לא טוב לדעתי) ואז \"להקיא\" את החומר בבוחן הכניסה של המעבדה. \nהמעבדה עצמה פשוט מדידות מתח זרם ממש מיותרות.\n\n\nדוחות:\nואי ואי ואי, מוגזם בצורה בלתי הגיונית. שעות מול שעות לעיבוד המידע בMATLAB ואז לכתוב דו''ח ולהסביר את התוצאות. חורג ממסגרת המעבדה בצורה מוגזמת מאוד!!!\n\nציונים:\nלא הייתה היסטוגרמה משום שהיו פחות מ10 סטודנטים, הציונים היו מנורמלים סביב 90-92. אין בדיקה לדו''חות, אין אכפתיות, ציונים באיחור. \n\nבקיצור:\nמעבדה על הפנים.\nלא מומלץ בכלל, אם אוהבים את התחום קחו מעבדות יותר שוות.", "timestamp": 1716817501421}, {"author": "דיודת שוטקי מאוכזבת", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "*לא לקחת את המעבדה - לא מומלצת*\nשם המדריכים: ינאי והילה \nינאי - רואים שליטה שלו בחומר,\\ מוכן לעזור גם חוץ משעות המעבדה, איכפתי.\nהילה - \"נופלת\" אחרי כמה שאלות, לא שולטת, אחרי כל שאלה מדפדפת בדוחות שיש לה לחפש תשובה ומצפה מהסטודנטים לענות במיידי ונכון....\n\nמעבדות: \nהמעבדה בלגנסטחת מאד. דורשת שעות השקעה רבות גם בהכנה להמעבדה עצמה וגם בדוחות אחרי המעבדה. העומס בכלל לא משקף את 1 הנק\"ז. גם הציונים לא ככ טובים.\nאיכשהו סגל המעבדה הצליח לקחת מקצועות סופא מעניינים ולהפוך אותם לתסכול שלם בדוחות המסכמים. מאוד מאוד ארוכים, מאוד מסתמכים על מטלב כך שכל ההנאה ממש הולכת. בנגד למעבדות אחרות שהדוחות המסכמים שלהן בודקות הבנה של המעבדה ושל החומר זאתי בכלל לא. \nכלומר המעבדות לא עוזרים ולא תורמים בכלל להבנה.\nבמעבדות *רק*  עושים מדידות (הרבה מדידות!) ןלרוב יוצאים לא נכונים או בכלל לא מדויקים ואז מגיע סבל אחר.\n\nבחני כניסה:\n שואלים על דברים שוליים - חסרות כיוון.\n\nדוחות:\nלא, פשוט לא. עבודה שחורה 99% ו1% ללמוד משהו חדש. הרבה התעסקיות במטלב. צריך להשקיע ∞ זמן בהן, זוועה.\n\nלא נותנאים שום פידבק תוך כדי הסמסטר, ופתאום ביום הראשון של הסמסטר שאחריו מפרסמים ציונים סופיים. ללא פירוט איך חישבו איתו, או מה חלוקת הציונים, מה ציון של כל דוח.\n\nשורה תחתונה: \nלא לקחת, יש מעבדות שוות יותר ומענינות ועם ציונים משקפים ועם \"עומס\" והשקעה שבאמת משקף את ה 1 נק\"ז", "timestamp": 1716818885157}]}