{"posts": [{"author": "רעות", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אבישי קולודני, יאיר משה\n\nחוות דעת - הרצאות: \nלדעתי קורס קליל ונחמד שממש פותח את הראש כשאתה בשנה א' בהנדסת חשמל ואין לך מושג לאן התואר הזה ייקח אותך או מה באמת מעניין אותך. הוא מועבר בצורה של \"מדע להמונים\", עם טאץ' טכניוני. עושים מעין סקירה כזו על מהי הנדסה, הנדסת חשמל ונוגעים ממש בקצה המזלג בחלק מהתחומים הקיימים. בנוסף, יש הרצאות אורח של כל מיני מהנדסים ויזמים בוגרי הפקולטה - ממש מעורר השראה. באתי להרצאות נטו מתוך סקרנות, והיה ממש מעניין.\n\nשעורי הבית: יש רק בוחן שבועי במודל, קליל זו לא מילה, של 4 שאלות מתוכן 3 אמריקאיות ועוד אחת פתוחה. ממש צ'יפס, עושים את זה ב-5 דקות. צריך לקבל עובר בשקלול כל הבחנים.\n\nהמבחן: אין, עובר בינארי על סמך הבחנים השבועיים ונוכחות.\n\nהשורה התחתונה: אם את/ה שנה א' (סמסטר א'/ב'), ובא לך קורס שהוא נגיעה ממה שתעשה/י בהמשך התואר - זה המקום בשבילך. אין מה להפסיד! כל מה שנדרש זו שעה בשבוע להיות נוכח.", "timestamp": 1612611656533}, {"author": "Oded Schiller", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבינועם קולודני\nחוות דעת - הרצאות: \nהרצאות חמודות ממש, שעה שבועית על מה זה הנדסת חשמל ולאן יכול לזרוק אותך המקצוע.\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\nשעורי הבית: \nיש 3 שאלות ממש קלות בשבוע, אם היית בהרצאה התשובות קלילות\nהמבחן: אין\n\nהשורה התחתונה: קורס שרק צריך ליות בו שעה בשבוע ולקבל עובר. אני חושב שזה יחסית נחמד ומעניין ודורש 0 השקעה ככה שלדעתי שווה לקחת את הקורס.", "timestamp": 1612994695222}, {"author": "עוד סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אבינועם ויאיר\nחוות דעת - הרצאות: ההרצאות זה פשוט הנאה צרופה בתוך לוז הלימודים.\nלי ולהרבה אחרים זו הייתה שעה אחרונה בשבוע מבחינת מערכת שעות וזה מה שסימן את תחילת הסופש אז תמיד הייתה אווירה קלילה וכיפית.\nההרצאות מעניינות ומדברים על המון תחומים שקשורים לחשמל בשביל לפתוח לך את האופקים ולהראות לך לאן תכלס נכנסת.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: איזשהו גליון אחד בשבוע משהו קליל של 5 דק אם היית בהרצאה.\n\nהמבחן: אין\n\nהשורה התחתונה: הכי מומלץ שיש לסטודנטים חדשים- גם אווירה טובה גם מעניין וגם מדבר תכלס על מה האופציות שלכם בעתיד.\nתעשו לעצמכם טובה ותלכו לזה ואז תגידו תודה רבה ולאבינועם וליאיר.", "timestamp": 1613209418038}, {"author": "-", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבינועם קולודני\nחוות דעת - הרצאות: הרצאה אחת בשבוע, חלקן מעניינות וחלקן מאוד משעממות. נוכחות חובה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בוחן שבועי קצרצר בסיום כל שיעור. לא מצריך יותר מכמה דקות.\n\nהמבחן: אין. עובר בינארי לפי נוכחות ובחנים שבועיים.\n\nהשורה התחתונה: קורס נחמד לשנה ראשונה. בכל שבוע נחשפים לתחום אחר במקצוע הנדסת חשמל. נותן איזשהו מושג בסיסי על התחום ועל המשך הלימודים. לא דורש השקעה.", "timestamp": 1614191254578}, {"author": "ל", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אבינועם קולודני, יאיר משה\nחוות דעת - הרצאות: חלקן מעניינות וחלקן קצת פחות, ישנן שאלוני Kahoot בהרצאה והשתתפות פעילה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: בוחן קצר מאוד לאחר כל מפגש\n\nהמבחן: ציון בינארי על סמך נוכחות והגשת הבחנים\n\nהשורה התחתונה: קורס מומלץ כדי להכיר את התחומים שיש להנדסת החשמל להציע ולמקד להמשך, מומלץ לקחת גם אם להקשיב בחצי אוזן כדי להיחשף לעשיה שלקראתה לומדים את התואר.", "timestamp": 1615837512125}, {"author": "אורי דמרי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מי שיודע לתקתק אותם לוקח 5 דק\n\nהמבחן:  אין\n\nהשורה התחתונה: יש הרצאות משעממות והיו כאלה שלא רציתי שייגמרו, אחלה קורס כדי להבין קצת מה זה הנדסת חשמל (בכלל לא מה שחשבתי)", "timestamp": 1643898817181}, {"author": "Ron Lebedinsky", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אבינועם\nחוות דעת - הרצאות: 13 הרצאות מעניינות שעוברות על נושאים ותחומים עיקריים שנלמדים בעיקר בקורסי בחירה של מסלול הפקולטה להנדסת חשמל ומחשבים. אחלה של קורס כדי להכיר יותר טוב מה באמת האפשרויות שניתנות בפקולטה.\n\nשם המתרגל/ת: אין.\nחוות דעת - תרגולים: אין.\n\nשעורי הבית: כל שבוע היתה מטלה במודל שבעוברת בקטנה על הנושא שהיה באותו שבוע, אין סיבה שזה יקח יותר מ- 45 דקות.\nזה עדיין קורס חדש אז יתכנו שיהיו שינויים כאלה או אחרים.\n\nהמבחן: אין.\n\nהשורה התחתונה: קורס חביב עם נוכחות חובה של לפחות 10/13 שיעורים כאשר כל שיעור הוא שעה בלבד שמביא נק\"ז אחד.", "timestamp": 1644159401805}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "השורה התחתונה: \nהקורס הכי בקטנה שפגשתי. לא משנה מה, תירשמו אליו. מטלת הכנה כל שבוע שלוקחת עשרים דקות בגג, שעה בשבוע בזום שאפשר לעשות כל דבר אחר במקביל. נק\"ז מתנה.", "timestamp": 1644171480562}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבינועם קולודני/יאיר משה\nחוות דעת - הרצאות: מתחילת הקורונה - הרצאה שבועית של שעה בזום. קורס מעניין שנותן רקע טוב על ההיסטוריה של הנדסת חשמל, מה זה בכלל הנדסת חשמל, איך יראה המשך התואר ומה תחומי המחקר המרכזיים בפקולטה. יש הרצאות אורח קצרות של חוקרים מהמעבדות השונות.\n\nשעורי הבית: צריך לקחת בחשבון ששיעורי הבית (לדעתי לפחות) לא תואמים לקורס של נק\"ז אחד. רוב הסמסטר היה בכל שבוע מטלת סיכום, מטלת הכנה, הערכת עמיתים. היו שבועות ששיעורי הבית לקחו מעל שעתיים. כן, הם מעמיקים הבנה והם אחלה העשרה. אבל בשלב מסוים של הסמסטר שעתיים בשבוע זה זמן שפשוט אין. אפשר להפיק מהקורס הזה הרבה ערך מוסף והבנה לקראת מה הולכים, אבל יכול להיות שעדיף במקום זאת לעשות עוד כמה שאלות באינפי...\n\nהמבחן: אין. עובר בינארי על סמך נוכחות, השתתפות בחידוני קהות וציוני שיעורי בית.\n\nהשורה התחתונה: אחלה קורס, אין ספק שיש מאחוריו הרבה השקעה. אבל - זה קורס של נק\"ז, ובניגוד לאינפי - הוא לא קורס חובה.", "timestamp": 1644236936743}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יאיר משה ואחינעם\nחוות דעת - הרצאות: הרצאות מעניינות! (במיוחד לקראת הסוף). חושפות לנושאים שונים בחשמל.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיחסית קלילים. כן דורשים קצת זמן אבל לגמרי שווה את זה.\nכל שבוע עונים על כמה שאלות אמריקאיות ושאלה פתוחה אחת שנושא השיעור.\n\nהמבחן: אין! ציון עובר/נכשל!\n\nהשורה התחתונה: מומלץ!", "timestamp": 1644349944470}, {"author": "אנונ'", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nתלוי נושא, לפעמים מעניין לפעמים פחות- לא באמת יעזור לכם להבין איזה שרשראות כדאי לקחת ואיזה מסלול לבחור\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nכל שבוע יש שיעורים בית מעט מעיקים אבל לא משהו רציני\nהמבחן: \nאין\nהשורה התחתונה: \nקורס חרטא נק\"ז חינם.", "timestamp": 1644369496890}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבינועם ויאיר\nחוות דעת - הרצאות: \nשעה שבועית בזום.\nיש כאלה שהתחברו, אותי זה ממש שעמם והרגיש לי בזבוז זמן.\nיש משחק כהות(KAHOOT) כל הרצאה שככה הם בודקים נוכחות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש כל שבוע, ממליץ לא להשקיע יותר מדי זמן עליהם. בקורס הציון הוא עובר או נכשל. השקעתי עד 10 דקות כל פעם, חבל על הזמן.\n\nהמבחן: \n\nהשורה התחתונה: \nלא דורש הרבה, אבל די תקוע בסמסטר ראשון.", "timestamp": 1645423825116}, {"author": "~~", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אבינועם + יאיר\nחוות דעת - הרצאות: קורס חמוד מאוד שהרעיון מאחוריו להציג באופן כללי מה התחומי עיסוק תחת המטרייה של הנדסת חשמל. בעיניי אירוע די מבורך בהתחשב בעובדה שמניח שרוב האנשים שנרשמים לתואר לא תמיד מבינים עד הסוף מה המקצוע כולל באמת, והקורס מטרתו להראות מה אפשר לעשות מבחינת תחומי העיסוק. הכל מועבר בצורה די קלילה ומעניינת ע\"י אבינועם ויאיר.\n\nשעורי הבית: די קלילים, שעה עבודה גג כל שבוע.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס בינארי של נ\"ז אחד, כן נחמד לחוות את זה בשלב הזה כדי לראות למה נכנסים בהתחשב בעובדה שנתחיל באמת להתעסק בזה רק בשנה שלישית. ממליץ לכל מי שבסמסטר א'.", "timestamp": 1645434650968}, {"author": "גל", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: לרוב מעניינות, יש חובת נוכחות בזום\n\nשם המתרגל/ת: \nאין\n\nשעורי הבית: חצי שעה-שעה בשבוע, אם מרפרנסים מחברים בקורס אפשר לתקתק בכמה דקות\n\nהמבחן: אין\n\nהשורה התחתונה:עובר בינארי, נק\"ז 1 אבל בעיקר הפוגה טובה מהלימודים והמרדף אחרי החומר בסמסטר א", "timestamp": 1645434662895}, {"author": "ל\"א", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבינועם ויאיר\nחוות דעת - הרצאות: הרצאה של שעה בזום, חלק מהנושאים מעניינים וחלק לא\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: מביאים מלא שיעורי בית, ברמה שלא סבבה לקורס שהוא נקודת זכות אחת, טעות לקחת אותו\n\nהמבחן: אין\n\nהשורה התחתונה: מביאים מלא שיעורי בית, ברמה שלא סבבה לקורס שהוא נקודת זכות אחת, טעות לקחת אותו, לא שווה את הזמן שהוא גוזל בסופו של דבר", "timestamp": 1645460220748}, {"author": "גיא דוידוביץ'", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אבינועם קולודני ויאיר משה\nחוות דעת - הרצאות: הרצאות מאוד מעניינות, חושפות קצת מהתחומים השונים בהנדסת חשמל\n\n\nשעורי הבית: קלים\n\nהשורה התחתונה: שעה אחת בשבוע בזום + מקס' שעה לש\"ב, כדאי להכניס למערכת.", "timestamp": 1660728496082}, {"author": "shay", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אבינועם ויאיר\nחוות דעת - הרצאות: חלקן מעניינות, חלקן קצת מתישות. ד\"ר ופרופ' אורחים שמגיעים לרוב השיעורים ברובם מעניינים ומציגים תחומים בהנדסת חשמל (שמסקרנים לגבי מסלולים בהמשך), אך חלקם היו דיי נפילה\nאבינועם ויאיר מרצים נחמדים מאוד\n\nשם המתרגל/ת:ללא \nחוות דעת - תרגולים: ללא\n\nשעורי הבית: לרוב ארוכים ומייגעים ביחס לציפיות מהקורס. זה קורס של נק\"ז אחד והציפייה הייתה ששיעורי הבית יהיו בהתאם... לא כל פעם זה היה ככה אבל ביחס לקורס בעיני הזמן שלוקח לעשות את השיעורים הוא לא סביר\n\nהמבחן: ללא\n\nהשורה התחתונה: מומלץ למי שרוצה להכיר עוד על התחום, מי שדואג מהעומס בסימסטר א ושהקורס יכביד עליו, מציעה לחשוב שוב אם שווה לקחת את הקורס", "timestamp": 1676043022825}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יאיר משה ואבינועם\nחוות דעת - הרצאות: שעה בשבוע, נחמדות. עשו kahoot במהלך ההרצאות כדי לבדוק נוכחות. \n\nשעורי הבית: ארוכים. קצת מעמיסים \n\nהמבחן: לא היה\n\nהשורה התחתונה: קצת מעמיס, וזה מקנה נק\"ז בודד. ממליץ על ספורט במקום", "timestamp": 1678560814745}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יש רק קבוצה אחת\nחוות דעת - הרצאות: בעיקר אהבתי את ההדגמות שבוצעו מידי פעם\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: הרגשתי שהשאלות מנוסחות בצורה מכשילה\n\nהמבחן: אין\n\nהשורה התחתונה: לא מזיק לקחת בסמסטר א' אם אין יותר מידי עומס", "timestamp": 1679337900134}, {"author": "11", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nבגדול משעממות, לפעמים מעניין\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nחופרים, פינת החירטוט השבועית, מרגיש לא קשור לכל מה שאתה עושה\nהמבחן: \nאין\nהשורה התחתונה: \nקורס סביר, מעלה את הממוצע.", "timestamp": 1679516205842}, {"author": "איתמר", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "חוות דעת - הרצאות: לפעמים מעניינות, לפעמים פחות, אבל בסך הכל די נחמד. \n\nשעורי הבית: יש שלושה סוגים של שאלות: אמריקאית שכל מה שצריך בשבילה הוא מוח מתפקד, מטלה לסכם סרטון או מאמר של שלוש פסקאות או חרטוט. הסיכום באמת מיותר ומשעמם, אבל מטלות החרטוט די כיפיות. הן דורשות חשיבה ויצירתיות בשביל להבין דברים שקשורים להנדסת חשמל ובאמת נהניתי לעשות אותן.\n\nהמבחן: אין.\n\nהשורה התחתונה: נק\"ז במתנה, העלאה לממוצע במתנה, והקורס עצמו די נחמד.", "timestamp": 1713694051204}, {"author": "עלמה", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יאיר ואבינועם\nחוות דעת - הרצאות: חוויה של קורס!! מומלץ לכולם. מעניין וכיפי, קליל רצח, באמת לומדים דברים מגניבים ומעניינים ומרחיבים אופקים באפס מאמץ.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקלילים מאד ברמת ה10 דק בשבוע, הציון לפי השב אז לא לזלזל. \nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716837820327}]}