{"posts": [{"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "קורס סבבה.\nנחמד להכיר קצת את המעבדות ולקבל כלים לפרויקט ולעבודת צוות. \nלא דורש הרבה ומקבלים ציון גבוה.", "timestamp": 1625771712661}, {"author": "Isaac N", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: קובי כוחיי\nשם המתרגל/ת: חובב לנדאו\nחוות דעת - תרגולים: ללא\n\nשעורי הבית: שעה בשבוע - גג\n\nהמבחן: ללא - הצגת הפרוייקט בלבד\nהשורה התחתונה: קורס כיפי ושווה במיוחד, תלוי בקבוצה שמתגבשת הקורס יכול להיות מאוד טוב ליצירת קשרים, הבנת החלק של המהנדס בתעשייה, והעומס מאוד לא גדול, שוב, תלוי בחברי הקבוצה וברצון שלהם לתרום את חלקם, מאוד ממליץ גם כשעה שיש בה זמן לנשום, במיוחד אם מדובר בסמסטר עמוס, כמו אחד מהסמסטרים הראשונים", "timestamp": 1644305298443}, {"author": "תומר בירן", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: קובי כוחיי\nחוות דעת - הרצאות: נחמד ונותן כיוון טוב לתחילת התואר\n\nשעורי הבית: לרוב נפגשים עם הקבוצה בערך שעה בשבוע כדי לעבוד על המצגות\n\nהמבחן: אין. רק מציגים 2 מצגות\n\nהשורה התחתונה: קורס נחמד שמעלה את הממוצע. אם הסמסטר עמוס מידי אפשר לוותר על הקורס", "timestamp": 1657180643355}, {"author": "גיא דוידוביץ'", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: קובי כוחיי\nחוות דעת - הרצאות: הרצאות טובות שמכינות אותך להמשך התואר.\n\nשעורי הבית: עבודה בקבוצות על הכנת מצגת ההצגה בפני קהל\n\nהשורה התחתונה: קורס מומלץ ,רק שעתיים בשבוע", "timestamp": 1660737140244}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: קובי וחובב\nחוות דעת - הרצאות: אין יותר מדי להסביר פה.\n\nשם המתרגל/ת: --\nחוות דעת - תרגולים: --  \n\nשעורי הבית: --\n\nהמבחן: --\n\nהשורה התחתונה: טוב בגדול זה קורס מתנה לכל מי שיש לו זמן ומוכן לתת קצת אקסטרה כדי להכיר את הפקולטה ולהיחשף לדברים מגניבים. בקורס עוברים הרבה שיעורים על איך לעבוד בצוות, להציג מול קהל, לעבור תהליך הנדסי וכו'. בסופו של יום אתם עובדים בקבוצה כדי להציג שני פרויקטים. הראשון, פרויקט גמר של סטודנט שנה ד' והשני, פרויקט לגמרי שלכם שאתם מציגים מול כל הקורס וכמה מהנדסים מהפקולטה. שני הפרויקטים זה עניין של לבנות פאוורפוינט ולחקור על הנושאים שצריך (לא צריך לבנות כלום). עם זאת, זה יכול לשאוב לכם זמן אם לא תשימו לב אז צריך לתת מקסימום עבודה ולזכור שזה נק\"ז 1.", "timestamp": 1689315558766}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: קובי וחובב\nחוות דעת - הרצאות: נוכחות חובה שעתיים בשבוע. מעניינות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמצגת אחת שלוקחת שעתיים קבוצתיות.\n\nהמבחן: \nאין מבחן. יש מיני פרויקט.\n\nהשורה התחתונה: \nמאוד מעניין - נחשפים למעבדות הפקולטה (עוזר להבין מה ניתן לעשות בתור מהנדס חשמל).\nעוברים הרצאות בנושאי עבודת צוות, ניהול זמן ופרויקט.\nמעלה ממוצע (רוב הציונים 95+).\nמעבר לשעתיים נוכחות חובה, יש בערך להשקיע עוד שעה בשבוע כשמתחילים את הפרויקט (שליש אחרון לסמסטר) אז זה בכלל לא נורא וגם מכניס עניין.\nממליץ מאוד.", "timestamp": 1689764350881}, {"author": "din alon", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה:  קובי \nחוות דעת - הרצאות: \nשיעורים מעולים, נותן כיוון כללי לתואר והמון כלים פרקטים\n\nהמבחן: \nצריך לעשות מצגת על פרוייקט תיאורטי, בערך שעה בשבוע במהלך הסמסטר וקצת יותר לקראת הסוף, ציונים באזור ה95.\nהשורה התחתונה: \n\nמומלץ בחום, לא להתלבט ולקחת.", "timestamp": 1689865784402}, {"author": "Einbar Dror", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: קובי כוחי \nחוות דעת - הרצאות: מענייין ומלמד, לכל המרצים בקורס יש יכולת העברת מידע וגם חשוב להם שתיישמו את מה שנלמד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nאין\nהשורה התחתונה: קורס חוויתי וחשוב להבין לאן אתה נכנס בעולם הזה של הנדסת חשמל, המטלות פשוטות מאוד ותכלס מלמדות אז שווה, ממליץ", "timestamp": 1716899236203}]}