{"posts": [{"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יאיר משה\nחוות דעת - הרצאות: הרצאות מאוד חשובות ולדעתי מאוד מאוד מעניינות! יאיר מרצה מעולה, מאוד ממוקד ודי מסודר וברור, אך לעיתים קצת איטי ולעיתים קצת רץ. בכל מקרה מרצה מצוין!\n\nשם המתרגל/ת: אמיר אביבי\nחוות דעת - תרגולים: תרגולים חשובים אך אפשר לעבור עליהם לבד למרות שלדעתי מומלץ להגיע אליהם. אמיר מתרגל מעולה ומעביר את התרגולים באווירה טובה וגם דואג שהתרגול יהיה אינטרקטיבי.\n\nשעורי הבית: תרגיל בית 0 מעיק, תרגילי בית 1,2 קצת מוגזמים ודורשים עבודה. תרגילי בית 3,4 גם מצריכים עבודה אבל הרבה יותר קלילים\n\nהמבחן: בדרך כלל דומה לשנים קודמות והפורמט ידוע מראש ככה שאין הפתעות. אם יודעים טוב את החומר אז רק צריך להכיר את סוגי השאלות בצורה טובה ואפשר להוציא ציון סבבה, למרות שיש לא מעט שאלות טריקיות ומאוד מבלבלות. \n\nהשורה התחתונה: קורס מעניין מאוד למי שיש זיקה לתוכנה, אני נהנתי מאוד! לגמרי מומלץ", "timestamp": 1615981571387}, {"author": "שונאOOP", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יאיר משה\nחוות דעת - הרצאות: סביר\n\n\nשעורי הבית:  עמוסים בטירוף ולא מלמדים. תרגיל בית אחרון הוא על ההרצאה האחרונה וחובה להגשה.\n\nהשורה התחתונה: \nקורס בנוי בצורה גרועה,\nתרגילי בית עמוסים בטירוף ולא מלמדים.\nמי שרוצה ללמוד JAVA או OOP, עדיף שיעשה את זה עצמאית ולא לעבור סבל מתמשך שלא תורם לשום דבר.", "timestamp": 1655543604997}, {"author": "NONAME", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "באופן כללי הקורס לא מלמד כל כך תכנות מונחה עצמים, הדבר היחיד שחידש לי זה בdesign של מערכת חדשה וגם נושא זה נמרח מידי..\n\nבסופו של דבר הקורס מתעסק בטפל.. כמות הרצאות מכובדת מתעסקות בתיעוד של הקוד, דבר אשר מובן ולא צריך לבזבז כל כך הרבה זמן על הנושא...\n\nבנוסף התרגילי בית עמוסים ובסוף המשוב עליהם הוא לא על ידי בודק התרגילים..\nככה שהמשוב הוא לא רלוונטי לא משנה מה עשית בתרגילים.\n\nתרגילי בית:\nאמרו בתחילת הקורס שיהיו 2 תרגילים רטובים ו2 יבשים. להפתעתנו בתרגיל האחרון היה קטע קוד גדול מאוד לכתוב. \nבנוסף הרגיש הרבה פעמים בתרגילים שמכווינים לצורת פיתרון מאוד ספציפית אפילו שהיו דרכים נכונות יותר לפתור.\n\nבשורה התחתונה: \nמאוד מאוכזב מהקורס, הרגיש שההתעסקות היא לא בתכנות מונחה עצמים נכון אלא באופן הכללי שקיים נושא כזה תכנות מונחה עצמים תכתבו מחלקות וזהו.\nמרגיש שלמדתי יותר מהאינטרנט מאשר מהקורס עצמו.", "timestamp": 1656071046820}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: מרצה נחמד בסך הכל.\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: תרגולים לא כל כך קשורים לחומר של ההרצאות, אבל כן חשובים לבחינה.\n\nשעורי הבית: ארוכים, וכוללים גם הרבה קוד וגם הרבה שאלות יבשות.\n\nהמבחן: טריקי.\n\nהשורה התחתונה: הקורס לא ממש מלמד תכנות, ולא תכנות מונחה עצמים. הוא מתעסק ברובו הגדול בתכן וכמעט ולא בתכנות. אם רוצים ללמוד לתכנת נכון ולהכיר לעומק את העולם של תכנות מונחה עצמים, מומלץ לקחת את הקורס שיש בתעשייה וניהול בנושא.", "timestamp": 1659448730460}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יאיר משה\nחוות דעת - הרצאות: אני הרגשתי שאין הרבה חומר אז חופרים על דברים מלא זמן וכתוצאה מכך ההרצאות משעממות\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: סבבה אבל אפשר גם לקרוא לבד בתכלס \n\nשעורי הבית: 4 תרגילי בית - לשניים הראשונים צריך גם לעשות code review לשתי הגשות אחרות. העומס בהגשות לדעתי הולך ופוחת (ההגשה הראשונה הכי עמוסה, האחרונה הכי פחות).\n\n\nהשורה התחתונה: רוב הקורס דיי משעמם בעיניי, מדברים המון (המון!) על תיעוד קוד, לומדים קצת ג'אווה (רק בגלל התרגילי בית), ובסוף יש נושא שנקרא design patterns שלומדים ב-3 שבועות האחרונים של הקורס, ולמרות שזה נושא שנחמד לדעת זה לא נושא שנחמד להיבחן עליו (מאוד טריקי ויכול לבלבל). אז השורה התחתונה היא שזה לא מהקורסים המסובכים של השרשרת אבל גם לא מהמעניינים (לדעתי).", "timestamp": 1662191030270}]}