{"posts": [{"author": "תורת האינפורמציה", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: נרי מרחב\nחוות דעת - הרצאות: \nעיקר ההרצאות הוא הוכחת משפטי הקידוד ופיתוח תוצאות עבור דוגמאות בסיסיות. המרצה מצליח להעביר גם את המשמעות והאינטואיציה של התוצאות וגם להבהיר את החלקים הקשים בהוכחות.\n\nשם המתרגל/ת: רן טמיר\nחוות דעת - תרגולים: \nפתרון דוגמאות מתקדמות בעזרת התוצאות והמשפטים שהוכחו בהרצאה. המתרגל מעביר את החומר בצורה ברורה ומוסיף אינטואיציה במקומות בהם זה אפשרי. דואג לענות על כל שאלות הסטודנטים.\n\nשעורי הבית: \n4 הגיליונות הטובים מתוך 5. סה\"כ 30% תקף.\nהגיליונות אינם טכניים, מצריכים מחשבה ומתרגלים היטב את החומר. כל גיליון לוקח יום-יומיים. לא פשוטים.\n\nהמבחן: \nבסמסטר הזה היה מבחן בעל-פה. המבחן נותן דגש להבנה ואינטואיציה של הנושאים ולא כולל חישובים ארוכים או פיתוחים טכניים.\n\nהשורה התחתונה: \nקורס \"חובה\" לכל מי שמתעניין בתחום התקשורת. מומלץ מאוד באופן כללי מכיוון שהמסקנות תקפות להרבה תחומים הנוגעים בעיבוד מידע.", "timestamp": 1626778864272}, {"author": "Tamir Mishali", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שלמה שיץ שמאי\nחוות דעת - הרצאות: \nשלמה מקסים. יש הרבה הוכחות בהרצאות שיש מוכנות בספר קורס אז היה קצת מעיק. לדעתי לא חובה להגיע להרצאות ואפשר להשלים לבד ולהגיע מדי פעם לשעות קבלה.\n\nשם המתרגל/ת: מיכאל דיקשטיין\nחוות דעת - תרגולים: מיכאל חריף. רץ עם החומר. התרגולים מוכנים בPDF אז בעיקר עוברים עליהם ופותרים יחד. \n\nשעורי הבית: קשים מאוד. לא תמיד יש רפרנסים, אבל אם יש לרוב זה ממבחנים בשנים קודמות. הם לא חובה אבל משמשים מגן של 20% מהציון הסופי וזה מומלץ מאוד לא לוותר עליהם.\n\nהמבחן: קשה מאוד. ממציאים את עצמם כל מבחן בעיקר בשנים האחרונות.\n\nהשורה התחתונה: הקורס מעניין וחשוב מאוד להבנה של כל עולם התקשורת ואינפורנציה. ממליץ להגיש את עבודות הבית גם כדי ללמוד וגם לצורך המגן.", "timestamp": 1666430565435}, {"author": "גיבורי ישראל 24", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nנרי מרחב\nחוות דעת - הרצאות: \nמרצה מעולה וממש מתחשב. נרי הוא המרצה הכי אכפתי שהיה לי. הוא הנגיש את הקורס ועזר בכל דבר שצריך, עודד אותנו להתקשר אליו לקבוע שעות קבלה פרטיות. \nההרצאות של הקורס הן סופר מתמטיות, ועמוסות בפרטים. מאוד קשה לעקוב אחרי הכל, בטח בפעם הראשונה. מצד שני אני חושב שההרצאות מרתקות, ומלמדות הרבה מהבסיס שעליו מתבסס התחומים של אותות ולומדות.\n\nשם המתרגל/ת: \nאיתי שופרו\nחוות דעת - תרגולים: \nמתרגל סבבה לגמרי. הנגיש את התרגולים בצורה טובה.\n\nשעורי הבית: \nקשים באופן קיצוני. בחיים לא היה לי דבר כזה. יש 5 גליונות על 30% מהציון וממש צריך לחרוק שיניים והמציא את הגלגל, ולרוב אין רפרנס. כשיצא גליון ידעתי כבר שיהיה שבוע שצריך לשבת עליו כל יום ואולי להצליח חלק ממנו. \nאיתי המתרגל גם בדק את השיעורי בית, ולא ריחם בבדיקה, אז צריך לוודא שעושים אותם נכון.\n\nהמבחן: \nהמבחן ממאדים כמו כל הקורס. השנה נרי לראשונה הפך את המבחן לחומר סגור במקום פתוח, לדעתי זה בא לטובתנו, כי למרות שהיה קשה רצח עדיין לא קרוב לסמסטרים הקודמים.\nהבדיקה זה כבר היה סיפור אחר, הבדיקה הייתה ממש מקלה ונרי פרגן לכל מי שהראה שהוא בגדול מבין את החומר. אני לדוגמא הופתעתי ממש מהציון לטובה כי יצאת מהמבחן שחשבתי שהלך לי ממש ממש גרוע. בסוף העמיד היסטוגרמה ממש אחלה ויצא איתנו ממש ממש גבר.\n\nהשורה התחתונה: \nמצד אחד זה הקורס הכי קשה שעשיתי בתואר. גם החומר עצמו גם השיעורי בית. החומר של הקורס כל כך עמוק שמרגיש שהוא ממש היסודות של כל הקורסים של אותות ולומדות. מצד שני אני חושב שזה קורס ממש מעניין שנותן רקע מעולה לנושא. הייתי לוקח את הקורס הזה רק אם מוכנים לקורס מאוד קשה ומרגישים שרוצים את הרקע עמוק מאוד לנושאים של עיבוד אותות ולומדות.", "timestamp": 1704025610274}]}