{"posts": [{"author": "Guy Yoffe", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: הרצאות מעולות. תומר מרצה מעולה, יודע לשים דגש במקומות הפחות ברורים, לתת אינטואיציה, ולהסביר ביסודיות. תמיד כשאתה שואל את עצמך \"רגע, למה זה נכון?\", הוא מסביר. מרצה מעולה ומעניין מאוד.\n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים: מרצה קצת בנאלי - לא תרם הרבה מעבר לדפים הכתובים. בעיקר קראתי את התרגולים, וכל פעם שהיה משהו טיפה מסובך הסתכלתי בתרגול - והוא לא הסביר אותו. התרגולים כתובים טוב, והוא לא תרם מעבר לזה\n\nשעורי הבית: מרופרנסים, יש פה ושם שאלה רטובה. לא קשים מדי.\n\nהמבחן: מבחן קשה. לא אינטואיטיבי, לא קל בכלל.\n\nהשורה התחתונה: קורס מאוד מעניין ומאוד אהבתי. מאוד מומלץ למי שאוהב שערוך, אותות אקראיים. קורס טוב לשרשרת עיבוד אותות.", "timestamp": 1612391587534}, {"author": "&", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: הרצאות מעולות. מרצה מצוין, מפורט וברור שמסביר את כל המעברים שנעשים (גם אם רק בעפ). כיף להיות נוכח בהרצאות. \n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים: מתרגל די גרוע, לא מוסיף שום ערך מוסף מעבר למה שכתוב בדפים. יש מתרגלת מצוינת בפונפטו, התרגולים שלה לא זהים למה שעבר במהלך הסמסטר אבל מספיק קרובים בשביל שיהיה שווה לראות את התרגולים שלה ולהשלים לבד מה שלא עבר בהם.  \n\nשעורי הבית: מרופרנסים, יש לפעמים רטוב במאטלב (גם מרופרנס).\n\nהמבחן: מבחן קשה, כתלות במועד יכול להיות גם לא פתיר. סהכ לא קל בכלל.\n\nהשורה התחתונה: קורס מאוד מעניין אם כי לא קל בכלל, מומלץ רק למי שנהנה מהחלק של עיבוד אותות אקראיים (השלוש תרגלים האחרונים) באותות אקראיים.", "timestamp": 1615735984515}, {"author": "Roy Mahlab", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: מרצה מעולה מעביר את החומר בצורה טובה, הרגיש לי אחלה קורס\n\nשם המתרגל/ת: דבורה כהן\nחוות דעת - תרגולים: ראיתי תרגולים ישנים בפנופטו שהיו די טובים. בסך הכל תרגולים קצרים מדי לדעתי בקושי עושים בהם שאלה או 2 אבל זה קורס של 3 נקז אז זה מה יש\n\nשעורי הבית: קשים ממש, שאלות ממבחנים הם עושים אבל הרוב כבר מרופרנס.\n\nהמבחן: קשה עם בדיקה רחמנית יחסית\n\nהשורה התחתונה: קורס מעניין ממש לא עמוס מדי אבל קשה מאוד", "timestamp": 1647366951174}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: נרי מרחב\nחוות דעת - הרצאות: מרצה ותיק למדי בעל ידע עשיר מאוד. ההרצאות מעניינות, אך לפעמים הוא עובר עליהן מהר וצריך לחזור עליהן. יחד עם זאת, נרי נחמד ומתחשב בסטודנטים\n\nשם המתרגל/ת: רותם אביב\nחוות דעת - תרגולים: מתרגלת טובה ואדיבה. אין תלונות\n\nשיעורי הבית: מאתגרים, אך בגדול פתירים ומלמדים\n\nהמבחן: מבחן מועד א' היה חישובי למדי והוגן\n\nהשורה התחתונה: לדעתי, הקורס מומלץ מאוד למי שהתחבר ל\"אותות אקראיים\" ומתעניין בעיבוד אותות בכללי", "timestamp": 1678610707533}]}