{"posts": [{"author": "Dolev Shema", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ד\"ר איל זקס\nחוות דעת - הרצאות:\nמועבר בצורה מעניינת וברורה, עם ווידוא הבנה והרבה דוגמאות.\n\nשם המתרגל/ת: עודה סאהר\nחוות דעת - תרגולים: \nברובו חוזר או מעט מרחיב את החומר שבהרצאות, עם פתירה פעילה של דוגמאות בכיתה.\n\nשעורי הבית: 50% מהציון.\n15% יבשים - שאלות מתוך מבחנים.\n35% רטובים - 3 חלקים של פרויקט בו בונים קומפיילר. החלק האחרון לוקח לא מעט זמן (כתיבה של מעל 1,000 שורות קוד) לכן כדאי כמה שיותר מהר להתחיל אותו, גם כשעוד לא בטוחים שיש את כל הכלים בשביל לפתור את כולו.\n\nהמבחן: 4 שאלות בנושאים יחסית קבועים, ברובו לא טכני אלא דורש להראות הבנה של החומר ושימוש בכלים שנלמדו.\n\nהשורה התחתונה: מומלץ. אותי החומר עניין, ובכללי חושב שמועבר בצורה מצוינת.", "timestamp": 1644597040178}, {"author": "רוי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איל זקס\nחוות דעת - הרצאות: ההרצאות בסה\"כ בסדר, איל מרצה ברור ונחמד, אבל רוב הזמן מרגיש שהחומר מועבר בצורה קצת מנופנפת ובאוויר כזה, צריך לשאול שאלות או להציק לאיל עוד טיפה כדי שיפלו אסימונים(בדר\"כ הם נופלים בסוף).\n\nשם המתרגל/ת: סהאר עודה\nחוות דעת - תרגולים: בנאדם נחמד אבל מתרגל סביר, לטעמי לא מצליח להעביר את התרגולים בצורה טובה מספיק וברובם הרגשתי שאני יוצא עם חורים בהבנה שהייתי צריך אחר כך לשבור תראש לבד מול הPDF ולהבין.\n\nשעורי הבית: בסה\"כ - 40% תקף.\n3 יבשים 10% תקף(3% לראשון 3% לשני ו4% לשלישי) בכולם זה שאלות ממבחני עבר, הבעיה העיקרית שבדר\"כ אין רפרנס כי אין פתרונות לאותם מבחני עבר שהם לקחו מהם את השאלה.\n3 חלקים רטובים של בניית קומפיילר - חלק ראשון 5% תקף, חלק שני 5% תקף וחלק שלישי 20% תקף. החלק הראשון והשני לוקחים חצי יום עד יום גג של עבודה והחלק השלישי יכול לקחת גם 5-7 ימי עבודה והוא די לא פתיר בלי רפרנס, בחלק השלישי ממש בונים את הלב של הקומפיילר, מגיעים לבערך 1000 שורות קוד והוא טיפה מתסכל לוקח זמן עד שנכנסים שם לעניינים. היתרון - יש רפרנסים טובים לכל החלקים בדרייב.\n\nהמבחן: מורכב מ4 שאלות בנושאים די קבועים, הם לא משנים את המבנה כבר תקופה ממה שהבנתי, במועד שלי המבחן היה הוגן, לא היו כמעט הפתעות ולמען האמת אפשר להוציא ציון גבוה בקורס הזה. כן יש מועדי עבר עם שאלות טיפה הזויות אבל בממוצע הייתי אומר שהמבחן הוגן בקורס הזה. \nהבעיה - אין כמעט מבחני עבר עם פתרונות או סריקות, יש משהו כמו 4-6 מבחנים רלוונטים עם פתרון\\סריקה אז הלמידה למבחן טיפה מבאסת בקטע הזה. \n\nהשורה התחתונה: אני עשיתי אותו כקורס בחירה בשרשרת מחשבים(מסלול חשמל רגיל) ובדיעבד לא הייתי עושה את זה, הוא פחות מעניין ממה שחשבתי והוא מתמקד בנושאים שלטעמי משעממים יותר(חצי מהקורס מתמקד בשפות פורמליות - רגולריות, חופשיות הקשר וכו' ולדעתי זה סתם חומר משעמם) יש בו מעט מאוד נושאים שתורמים לידע ולהבנה שצריך בתור מתכנת אחר כך בתעשייה.\nמצד שני, רוב האנשים שעושים אותו הם במחשבים תוכנה שזה קורס ליבה אצלם ושאר הקורסי ליבה אצלם נחשבים \"מזעזע\" (שדות\\VLSI\\אקראיים) אז אין להם ממש ברירה אלא להסתפק בקורס הזה.", "timestamp": 1715158590524}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: זקס איל\nחוות דעת - הרצאות: יודע את החומר בצורה חריפה ביותר, הוא מעביר את החומר בצורה טובה מאוד, קצת חבל שיש הרגשת התנשאות קצת מצדו בעת העברת השיעור.\nממליץ מאוד ללכת אליו ולשים דגש לכל מילה שהוא אומר כי זה גם ילמד אתכם את החומר וגם יכסה לכם את התרגול שהמתרגל הוא פשוט לא טוב ולא מובן בכלל.\n\nשם המתרגל/ת: עודה סאהר\nחוות דעת - תרגולים: תקוו כל שיעור שאולי איל יעביר את התרגול.\n\nשעורי הבית: חתיכת סיוט עולם, הרטובים בהתחלה הם קלילים ואפשר לרפרנס בקליל, היבשים הם ארוכים רצח ולפעמים אין רפרנסים. הקושי הגדול הוא בפרויקט, זה חתיכת סיוט והוא ארוך רצח וגם אי אפשר ממש לרפרנס הכל כי הם משנים אותו, בקיצור תהיו חדים על החומר כדי שתוכלו לדעת מה לעשות ואיך להתמודד ותדעו שהוא מגיע בסוף הסמסטר בתקופה הכי לחוצה והוא עמוס בטירוף.\n\nהמבחן: המבחן סביר לגמרי, לדעתי הוגן, גם הבדיקה הוגנת, מה חבל שאין פתרונות למבחנים, סה\"כ הקרן אור בקורס הזה לדעתי זה המבחן.\n\nהשורה התחתונה: לא יודע אם ממליץ או לא, אבל קחו בחשבון שקומפילציה זה לא פשוט map שמתרגם כל מילה בקוד לאסמבלי, זה חתיכת מפלצת עם הרבה תאוריה והרבה שלבים.", "timestamp": 1721023730351}]}