{"posts": [{"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אייל בוקס\nחוות דעת - הרצאות: תיאורטיות ומעניינות. אייל מרצה טוב ומתחשב מאוד.\n\nיחד עם זאת, הקורס מתבסס על החוברת של אייל, ובהרצאות הוא לא מספיק לעבור בצורה מלאה על כל הפרקים המהווים את נושאי הקורס. לקראת המבחן או אפילו במהלך הסמסטר, רצוי לקרוא אותם בצורה מעמיקה יותר ולנסות לעבור על כמה שיותר שאלות המופיעות בפרקים האלו.\n\nשם המתרגל/ת: רועי שטיינברג\nחוות דעת - תרגולים: מתרגל מדהים ובקיא מאוד. מסביר טוב עם הרבה ביטחון.\n\nשיעורי הבית: יחסית פשוטים ומהווים 15% מהציון הסופי. מטרתם לתרגל בצורה בסיסית את מה שהועבר באותו שבוע.\n\nיש גם בוחן אמצע שיכול להקנות 15% מגן.\n\nהמבחן: הוגן. יש בחירה של שלוש מתוך ארבע שאלות. השאלות במבחן אמנם ברמה גבוהה יותר מאלו שבשיעורי הבית, אך הן בהחלט פתירות.\n\nהשורה התחתונה: למי שאוהב/ת מכניקת הקוונטים, ופיזיקה 3ח' לא הספיק לה/לו, כדאי מאוד לקחת את הקורס הזה.", "timestamp": 1677683414131}, {"author": "Operator that doesn't do much", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אייל בוקס\nאם לקחתם טכנולוגיות קוונטיות לפני קורס זה את ההרצאות לא ילמדו הרבה דברים חדשים, טיפה הרגיש כמו נק''ז חינם. \nאייל מרצה מאוד טוב, גם מסביר טוב ולאט וגם מקצועי וגם בא לקראת הסטודנטים.\n\nשם המתרגל: רועי שטיינברג\nמתרגל טוב, בוא לקראת הסטודנטים בבדיקת תרגילי בית ופרסומם. התרגולים עצמם היו טיפה משעממים כי הוא היה מקריא מהדפים של התרגולים. (אנחנו יכולים לקרוא אחי)\n\nשעורי הבית: \nבכל גליון יש שאלה קשה רצח אך השאר ממש פתיר וחשוב לתרגול.\n\nהמבחן: \nכל השאלות שאייל מביא במבחנים שלו הם מהחוברת של הקורס אחד לאחד. \nתעשו לעצמכם טובה ותתחילו לפתוח משאלות אלה כבר מתחילת הסמסטר. (אייל כבר מלמד את הקורס מלפני 2003 והוא תמיד הביא שאלות מהחוברת).\n\nבוחן אמצע:\nהיה לו ממוצע של 80 הוא מתבסס על התרגולים ולא עם החוברת.\n\nחלוקת ציון סופי:\n15% בוחן  אמצע (מגן)\n85% מבחן \n\nהשורה התחתונה: \nנק''ז חינם בשרשרת הקוואנטים!", "timestamp": 1680294053567}, {"author": "סטודנט ממורמר", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אייל בוקס\nחוות דעת - הרצאות: ההרצאות סבירות. אייל אדם מאוד נחמד אבל הוא לא מרצה טוב במיוחד. חשוב לו שכל הסטודנטים יבינו את מה שהוא אומר וכותב, אבל הוא מתעכב הרבה יותר מדי על הוכחות שנמצאות בחוברת ההרצאות.\nאם כבר חוברת ההרצאות - אל תדפיסו את החוברת בתחילת הסמסטר כי אייל מעדכן אותה כל הזמן. אפשר לראות בדף הראשון את התאריך האחרון בה החוברת עודכנה אז לקראת תקופת המבחנים שימו לב לזה.\n\nשם המתרגל/ת: רועי שטיינברג\nחוות דעת - תרגולים: מתרגל מצוין. כותב קצת לא ברור ומסורבל, אבל לא משהו שמפריע במיוחד. הבנתי אבל שהוא לא ממשיך בתחום אז זה קצת באסה למי שייקח את הקורס.\n\nשעורי הבית: שיעורי הבית לא קשים במיוחד. כמו התרגולים, גם הם ברובם שאלות מהחוברת והם מאוד סבירים.\n\nהמבחן: המבחן עצמו די פשוט ולא ארוך, יש בחירה של 3 שאלות מתוך 4 ואייל בודק באופן מאוד רחמן את התשובות, אבל הקטע הוא לא המבחן, אלא הלמידה אליו.\nדרך הלמידה למבחן היא לא פתרון מבחני עבר (כי אייל לא מאמין בזה), אלא פתרון כל (!) השאלות מחוברת ההרצאות. בחוברת יש כמעט 300 שאלות (נכון לעכשיו) שרלוונטיות לקורס וצריך לעבור על כולן.\n הקטע הוא שרוב השאלות הן לא שאלות ברמה של מבחן או אפילו של הקורס, אלא שאלות ברמה של חוקרים בתחום, וסטודנטים בתואר ראשון אפילו לא אמורים להבין מה כתוב שם. השאלות לא מסודרות לפי רמת קושי, ואין אפילו סימון לגבי אילו שאלות הן הקשות, אז צריך לנחש אילו שאלות מספיק פשוטות בשביל שנוכל לפתור ואילו שאלות הן שאלות \"חייזרים\" (מילים של אייל, לא שלי).\nעוד משהו - השאלות גם מעבירות עוד חומר שלא מופיע בחלק הראשי של החוברת! אז אין ברירה אלא לעבור על כל השאלות, מתוך הבנה שאם מדלגים על השאלה הלא נכונה, אנחנו מפספסים חומר שרלוונטי למבחן... \n\nהשורה התחתונה: סגל מאוד נחמד, וקורס עם ממוצע גבוה אבל הלמידה למבחן הייתה אחת החוויות הפחות נעימות שהיו לי בתואר. לעבור במשך שבוע על כל השאלות שיש לאייל בספר, מהבוקר עד הלילה ולהתעכב על שאלות שאפילו לא צריך להתעכב עליהן... אם יש לכם את הזמן בתקופת המבחנים זה אחלה קורס להעלאת הממוצע, אבל אם אין את הזמן, לא הייתי לוקח את הקורס...", "timestamp": 1713640115873}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אייל בוקס\nחוות דעת - הרצאות: \nאייל אולי כבן אדם נחמד, אבל מרצה לא טוב. מאוד מונוטוני, מתרכז כמעט ורק בהוכחות ודגשים מתמטיים ולא היו כמעט אינטואיציות פיזיקליות. בלי פיסיקה 3 ח' לא הייתי יכול להבין כלום פיזיקלי. גם הכתיבה של ההרצאות לא ברורות, מצד שני הוא לא כותב מסודר על הלוח את כל מה שצריך, מצד שני גם החוברת שלו לא ברורה ואם רוצים לעבור עליה זה המון גוגל טרנסלייט בשילוב עם ויקיפדיה ויוטיוב כדי להבין את המונחים הבסיסיים. כמובן שההרצאות לא מעניינות בשום צורה, מרגיש שזה לקחת את כל המתמטיקה שחנה דילגה עליה ב3 ח' כי זה נטו מתמטיקה, ולהוכיח אותה לעומק.\nשם המתרגל/ת: רועי שטיינברג\nחוות דעת - תרגולים: \nמתרגל טוב, בא לקראת הסטודנטים וגם אם החומר בהרצאה לא היה ברור, לפחות מסביר איך אמורים לפתור אותו ולגשת לפתרון. לפעמים עובר קצת מהר על התרגול ובמיוחד על דברים שנראים לו מובנים, אבל אם עוצרים אותו יענה לכל שאלה וגם יחכה אחרי התרגול/יקבע שעת קבלה לפי מה שצריך.\nשעורי הבית: \nגיליון פעם בשבועיים, בין 4 ל5 שאלות שחלקן די פשוטות וחלקן מסובכות ולא ברור מה רוצים ממך. שווה לחפש אותן בחוברת כדי לקבל רעיון כללי (כי אין שם באמת פתרון מלא בדרך כלל...), אבל עניין של 4 שעות לגיליון בערך בממוצע.\nהמבחן: \nהלמידה אליו היא סיוט מתמשך. אייל לא מאמין בלפרסם מבחני עבר, וטוען שכל השאלות ממבחני עבר כתובות בחוברת הקורס. זה אולי נכון, רק שהחוברת היא 400 עמודים באנגלית קשוחה, מחולקים ל9 פרקים כשיש בממוצע בין 40 ל-50 שאלות (בפרקים המתקדמים), והרוב המוחלט של השאלות מזעזעות, הזויות והכי גרוע-תלויות במקרה הטוב רק בשאלות שלפניהן (אז אם אתם רוצים לפתור רנדומלית את תרגיל 20, קחו בחשבון שהוא תלוי בתרגילים 15-19), במקרה הגרוע בתרגילים או בחומר מפרקים מתקדמים יותר ובמקרה הכי גרוע התרגיל תלוי בחומר שאפילו לא במסגרת הקורס!! כמובן שאייל לא טורח לציין מה רלוונטי ומה לא, וחוץ מלהדפיס את כל החוברת ולבוא איתה למבחן אין באמת דרך לדעת מה הוא ישים.\nבסופו של דבר יש בחירה במבחן של 3 מתוך 4, כשיש שאלה אחת שהיא באמת הזייתית ועוד 3 שאם ראית משהו דומה בחוברת/דף נוסחאות כנראה שתצליח לפתור.\nהציונים גבוהים כי בסוף איכשהו מצליחים לעלות על מה הוא רצה במבחן והבדיקה של אייל מקלה מאוד, אבל לא יודע אם זה שווה את הסטרס הנפשי שהיינו בו לפני המבחן (מתוך בערך 20 איש בקורס דיברתי עם 5-6 אנשים שונים, כולם היו בתחושה שאין איך ללמוד ובהרגשה שהכל חייזרי ושיכול להיות מזעזע).\nהשורה התחתונה: \nבעיני קורס לא טוב, עם עטיפה של ציונים טובים ו2 ביקורות לא כל כך קשורות למציאות ששכנעו אותי לקחת אותו. מאוד עניין אותי פיזיקה 3 ח וחשבתי ללכת לכיוון השרשרת של קוונטים, אבל הקורס הזה לא חידש שום דבר מ3 ח, רק סירבל וגרם לי להבין שהשרשרת לא בשבילי ושבשביל עניין יש לי יוטיוב. הלמידה אליו הייתה אחת המתסכלות שהיו לי בתואר. גם אם אתם ממש ממש נעולים על השרשרת של קוונטים, קחו את הקורסי חובה ועוד קורס אחד שאשכרה יעבור נורמאלי ויוסיף לכם תוכן, ולא בצורה משעממת, מתסכלת ושאולי יהיה ציון סבבה בסוף.", "timestamp": 1713864549492}]}