{"posts": [{"author": "Haneen Abu Hamam", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "חוות דעת - הרצאות+תרגולים: צופים בהרצאות מוקלטות, וקוראים סיכומים (+הבהרות/תוספות) במודל לפני מועד המפגש. המפגש מתחיל עם בוחן קצר במודל (לא קשה), לאחר מכן פותרים אותו עם המרצה, עוברים על נקודות חשובות בחומר, ואז מתחלקים לקבוצות קטנות של 3 או 4 סטודנטים breakrooms בZoom, פותרים ביחד תרגילי כיתה ומזמינים את המרצה אם יש שאלות.\n\nשעורי הבית: מגישים את תרגיל הכיתה לאחר שבוע מהמפגש\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס לא קשה, דורש השקעה שבועית, לא לכולם מתאים לעבוד בקבוצות אך ניתן לפתור את התרגילים לבד רוב הפעמים. הייתי ממליצה לרשום מסקנות מהשעורים ומהתרגילים  כל שבוע, ולרענן את החומר כל שבועיים/שלושה.", "timestamp": 1599698436196}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: אחלה של מרצה , הכי חשוב שהוא בא לקראת סטודנטים וחשוב לו מאוד שכל סטודנט שיושב בכיתה מבין את החומר . זה סמסטר ראשון שיובל מעביר את הקורס , אבל זה היה מוצלח בעיניי , הוא מקשר דברים לפיזיקלית כך שיותר קל להתחבר לחומר \n\nשם המתרגל/ת: עמנואל בר\nחוות דעת - תרגולים: לא היה ממש תרגולים גם לא הרצאות , הקורס בגישה של כיתה הפוכה , צופים במוקלט לפני 8 שנים ( סופר מעולה המוקלט של ילון עילם ) ובשיעור מגיעים ל 3 שעות , שעתיים עם המרצה שעה עם המתרגל ותוך כדי פותרים את השיעורי בית ואם יש שאלות אז הם עוזרים ומכוונים \n\nשעורי הבית: כל שבוע יש אחד , ממוחזרים , אבל עדיף לא להסתמך על רפרנסים כי המבחן הוא רמה יותר קלה מהשיעורי בית , השיעורי בית מכוונים יותר להבנת והפנמת החומר , אישית די עזר לי והיו כמה סעיפים במבחן שהן משיעורי הבית \n\nהמבחן: היה די הוגן בעיניי , הסגל מתחשב כך שנכון היה מבחן ארוך יחסית לסמסטרים קודמים אבל נתנו הארכה של חצי שעה והבדיקה הייתה קלה \n\nהשורה התחתונה: קורס סופר חשוב למי שמרגיש שזורם לו בדם ננואלקטרוניקה :)", "timestamp": 1678789457708}, {"author": "natan borkowski", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אילם\nחוות דעת - הרצאות:  כיתה הפוכה- ההקלטות סבבה, האינטקציה עם אילם בכיתה מוספה המון\n\nשם המתרגל/ת: עמנואל\nחוות דעת - תרגולים:  שוב כיתה הפוכה אז יש איטרקציה ישירה-יודע ישר מה לא הבנת , ואיפה טעית . \n\nשעורי הבית: הגשות שבאמת מלמדות את החומר . \n\nהמבחן: חצי חצי...חצי באמת טכני קצת מזורם. ואז יש 2 שאלות טריקיות שדורשות הבנה מעבר לדף נוסחאות\n\nהשורה התחתונה: קורס בנוי טוב, החומר מועבר בצורה מעולה. המבחן צריך הכנה טובה", "timestamp": 1693818089146}, {"author": "---", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יובל יעיש\nחוות דעת - הרצאות: ההרצאות היו במתכונת כיתה הפוכה, ואז באים לשיעור ויובל מסביר את החומר בשעה הראשונה, ואחרי זה פותרים תרגילי הבית. בנוסף, כל שבוע היה בחן קצר שכולל שאלה/שתי שאלות שקשורות לחומר שנלמד בהרצאות המוקלטות של אותו שבוע, ואפשר היה לצבור משהו כמו 11-12% מגן.\nיובל מרצה מצוין, הוא נותן אינטואיציה מאוד טובה לחומר וחשוב לו שהסטודנטים יבינו את החומר, ותמיד מנסה לגרום לסטודנטים לחשוב ולהבין ולא רק לשנן נוסחאות.\n\nשם המתרגל/ת: עמנואל בר\nחוות דעת - תרגולים: לא היה תרגולים פרונטליים, אבל הוא כן ענה על שאלות של הסטודנטים והסביר טוב את החומר.\n\nשעורי הבית: כל שבוע מפרסמים גיליון חדש, ולרוב כל גיליון נראה ארוך עם מלא שאלות אבל בגדול אפשר לסיים אותו תוך 2-3 שעות. כדאי לפתור את תרגילי הבית כי יש שאלות במבחנים שממש דומים לשאלות שיש בשיעורי בית + זה מקנה מגן של 24%.\n\nהמבחן: המבחן היה הוגן בסה\"כ, היו שתי שאלות שדרשו קצת יותר מאמץ בכדי להבין את הרעיון מאחוריהם ולפתור אבל בגדול סבבה. המבחנים דורשים הרבה הבנה של החומר שנלמד, וחלק מהשאלות הן תיאורטיות לכן חשוב להפנים את החומר.\n\nהשורה התחתונה: קורס מאוד מומלץ, קליל ולא עמוס ומי שאהב מל\"מ יהיה לו כיף ללמוד את הקורס הזה, ובהחלט אפשר לקבל בו ציון גבוה אם מבינים טוב את החומר.", "timestamp": 1715900925485}]}