{"posts": [{"author": "itamar priel", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: הרצאות מעניינות. חלק לא מבוטל מהחומר הוא בגדר הרחבה, אבל זה ממש מעניין.\n\nשם המתרגל/ת: שגיא מונין\nחוות דעת - תרגולים: מתרגל פצצה. תרגולים ממש עוזרים להבנה של החומר. לא עמוסים על יתר המידה, מצגות מעולות\n\nשעורי הבית: 4 רטובים לא עמוסים מדי. סדר גודל של תרגילי בית באותות. 6 יבשים ברי ריפרונס. \n\nהמבחן: הוגן לחלוטין\n\nהשורה התחתונה: קורס מעולה", "timestamp": 1625987261323}, {"author": "&", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה:  אמיר רוזנטל\nחוות דעת - הרצאות: מרצה בסדר כזה, הרצאות לא הכי מעניינות וגם לא הכי משעממות. הרבה  פיתוחים והרחבות, הרבה התקנים שלא פוגשים בתרגולים. פעם ראשונה שלו הסמסטר, יכול להיות שהוא עוד ישנה\\יעצב את הקורס בדמותו. \nההרצאות עוברות במצגת, לא הכי נח אבל סהכ בסדר. \n\nשם המתרגל/ת: שגיא מונין\nחוות דעת - תרגולים: מתרגל טוב. יודע את החומר טוב ומסביר טוב. התרגולים במצגת, פותר על הלוח תרגילים ממבחנים. \n\nשעורי הבית: 6 יבשים, רובם מרופרנסים, לא מאוד ארוכים וקשים. 4 רטובים, חלק יותר עמוסים, חלק פחות, רובם מרופרנסים. \n\nהמבחן: חומר פתוח, מבחן ממש בסדר. \n\nהשורה התחתונה: אחד הקורסים שהכי נהנתי מהם בתואר, מעביר חומר מעניין ומאוד פרקטי לכל מי שרוצה למצוא את עצמו בעולם העיבוד אותות אופטי, אם בתעשייה ואם במחקר.", "timestamp": 1627324478171}, {"author": "???", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אמיר רוזנטל\nחוות דעת - הרצאות: טיפונת מוזר אבל סך הכל מרצה ממש טוב. מגיע לפואנטה ומשלב במהלך הסמסטר את ההקשר של כל חומר ואיך משתמשים בו בשביל טכנולוגיות וזה הפך את ההרצאות לממש מעניינות.\n\nשם המתרגל/ת: סתיו לוטן\nחוות דעת - תרגולים: לא התחברתי כל כך, יש הקלטות סבבה אם צריך.\n\nשעורי הבית: צריך להגיש 5 מ7 יבשים ו2 רטובים. היבשים סך הכל סבבה ורובם מרופרנסים. הרטובים טיפה יותר השקעה אבל גם לא נוראים במיוחד התחשב שכל השיעורי בית מהויים 40 אחוז מהציון הסופי שזה מצויין.\n\nהמבחן: סטנדרטי, לא משהו מיוחד.\n\nהשורה התחתונה: ממש אהבתי, אם אתם בקטע של אופטיקה לדעתי חובה.", "timestamp": 1716894711481}]}