{"posts": [{"author": "Kernel panic", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "חוות דעת - הרצאות: \nאין\nחוות דעת - תרגולים: \nאין\n\nשעורי הבית: \nהמעבדה מורכבת מ3 תרגילי בית רטובים בc שמערבים כתיבה לקרנל ומניפולציות על קרנל של מכונה וירטואלית.\nחשוב לציין שהסדר של התרגילים עבר עדכון ועכשיו הם יותר מתכתבים עם סדר החומר שמועבר בקורס מערכות הפעלה.\n\nהתרגיל הראשון: עמוס ובו מתרגלים לכתיבה ודיבוג בקרנל, לוקח בערך שבוע.\nהתרגיל השני: קל יותר ומתבסס על הראשון, כמה ימי עבודה\nהתרגיל השלישי ארוך אבל לא נוגע בקרנל אז האורך שלו מתקזז עם כמות הזמן שמשקיעים על הדיבוג, לוקח גם כשבוע.\n\nסה״כ אם את אתם לוקחים את המעבדה כי אתם במחשבים תוכנה ואתם חייבים, אתם תרגישו שהרטובים ברמת קושי בינונית (יש שלד לכולם), אם אתם לוקחים את המעבדה מכול סיבה אחרת ואתם לא אנשי קוד, אתם תסבלו.\n\nהשורה התחתונה: \nאין סיבה לדחות את המעבדה לקיץ\nרק כי כולם עושים ככה, התרגילים לוקחים אוליי 3 שבועות עבודה סה״כ והטסטים שלהם לא מאוד מציקים (ויעידו הממוצעים). אפשר לקחת במקביל להפעלה ואפילו לפניי הפעלה כי הנושאים שעליהם התרגילים מבוססים מועברים בכמה משפטים לכול היותר בקורס.", "timestamp": 1658952163682}, {"author": "zubi", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חגי קריטי\nחגי נורא חמוד! הוא נורא משקיע באתר של המעבדה, מוסיף תמיד דוקומנטציה ותמיד זמין בפורום במודל, הוא היה עונה ממש מהר לכל השאלות וכמעט תמיד היה זמין לשעות קבלה\\עזרה עם התרגילי בית, אפילו גם במייל. רואים שאכפת לו שתצליחו והוא שם לעזור עם התהליך.\n\nשעורי הבית: \nהמעבדה זה בעצם 3 שאלות לכל הסמסטר, הכל רטוב, ועורכים\\מוסיפים דברים למערכת ההפעלה. זה פשוט עוד עמוד במודל שמידי פעם מוסיף לכם שיעורי בית לעשות במהלך הסמסטר.\nהתרגילים לא קלים, לוקחים זמן לקמפל ומאוד קשים לדיבוג בגלל שאין דיבאגר, רק קובץ לוג שההפדסות שתוסיפו יופיעו שם.\nמי שמתחבר ללינוקס עוד מלפני התואר ובכללי אוהב דברים כאלה נורא יהנה מהמעבדה ואני ממש ממליץ לקחת אותה גם אם לא חייב, למדתי ממנה הרבה על איך מערכת ההפעלה עובדת אפילו יותר מהקורס של מערכות הפעלה! בין הקורסים היחידים שנהניתי לקחת למרות הקושי שלו.\n\nהשורה התחתונה: \nמאוד מומלץ למי שאוהב להתעמק במערכות הפעלה ולהבין איך דברים עובדים לעומק. בדרך כלל לא הרבה אנשים לוקחים את המעבדה ואין רפרנסים או במה להיעזר כל כך כי עורכים מערכת ישנה מאוד אז תשימו לב לזה, מומלץ לקחת עם עוד אנשים שאתם מכירים במקביל כי לשבת רק 2 שותפים על קוד כזה מסובך זה מאוד קשה.", "timestamp": 1687816557394}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם האחראי: חגי קריטי\nחוות דעת - הרצאות: אין \n\nשעורי הבית: הקורס בנוי מ3 תרגילים רטובים במהלך הסמסטר (הרכב הציון 35 אחוז, 35 אחוז ו30 אחוז), שלושתם לא פשוטים ולוקחים זמן, עם זאת די מעניינים, ודי מגניב כשהדברים מתחילים לעבוד. חייב לציין לטובה את חגי שהיה פשוט מדהים, לאורך כל הסמסטר ענה בכיף לשאלות, מאוד מקצועי, זמין.\n\nהמבחן: אין\n\nהשורה התחתונה: עמוס מאוד, אבל מעניין בטירוף בעיניי ודי מלמד וממש צוללים ללב מערכת ההפעלה. קחו בחשבון שיש הרבה לימוד עצמי. ממליץ לקחת לאחר מערכות הפעלה, אני לקחתי במקביל וזה היה קצת קשוח כי העקרונות עדיין לא שקעו", "timestamp": 1690824068083}, {"author": "Avi", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "* לא לקחת את המעבדה, רק אם חייבים!*\nשם המרצה: חגי קריטי\nחוות דעת - הרצאות: חגי תמיד ניסה לעזור ובא לקראתנו. \n\nשעורי הבית: גיהנום של מעבדה.\n3 הגשות שצריך בכל אחת לקרוא ולהבין לעומק את הקוד של Linux . מדובר על מאות קבצי קוד שאתה אמור להבין לבד איזה מהם צריך לשנות.\nואז הנורא מכל- הדיבוג. כל שינוי בקוד צריך לעשות ריסט למכונה וירטואלית, לקמפל, לעשות שוב ריסט, ולהריץ קוד - שבתקווה תספיק לראות איזה שגיאה נזרקת לפני שהכל נתקע. \n\nהשורה התחתונה: מה שבשורה העליונה.", "timestamp": 1703604853996}, {"author": "unknown", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חגי קריטי\nחוות דעת - הרצאות: חגי תמיד זמין למענה על שאלות בפורום ובשעות קבלה. הוא עזר לנו מאוד בהבנת התרגילים ולכן אני ממליצה להיעזר בו. זה יחסוך לכם זמן\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 3 תרגילים רטובים. התרגילים לא פשוטים וארוכים.  אבל מלמדים המון על מערכת ההפעלה ועל תכנות בתוך הkernel.\n\nהמבחן: אין\n\nהשורה התחתונה: אם לא חובה אז אל תעשו, לא נק\"ז קל", "timestamp": 1716982907771}]}