{"posts": [{"author": "anonymous", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: פרופ' אורי וייזר\nחוות דעת - הרצאות: בהתחלה ההרצאות דומים למבנה מחשבים ואח\"כ מתעסקים במערכות לומדות ומבנים שלהם וכו. יש כ- 5 הרצאות ממרצים אורחים. \n\nשם המתרגל/ת: סאמר כורזום , גיל שומרון\nחוות דעת - תרגולים: יש בסה\"כ 6 תרגולים בקורס שהם קלים להבנה ביחס להרצאות \n\nשעורי הבית: יש 3 שיעורי בית יבשים שלרוב לקוחים ממבחנים של סמסטרים קודמים והי שני תרגילים רטובים (אחד היה על systolic array ומשתמשים בסימולטר והשני על quantizationב-python ) אין רפרנסים והשאלות קצת קשות אבל ב-2-3 ימים יספיקו לפתרון ת\"ב\n\nהמבחן: בנוי משתי שאלות כל שאלה 50% ויכילו לא מעט סעיפים , השאלות הם על רוב החומר.\n\nהשורה התחתונה: מומלץ למי שאוהב ארכיטקטורות ונהנה במבנה מחשבים ומתעניין במערכות לומדות.", "timestamp": 1615020005693}, {"author": "וואלק", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אורי וויזר\nחוות דעת - הרצאות: 7 הרצאות רלוונטיות למבחן.\n\nשם המתרגל/ת: שומרון גיל\nחוות דעת - תרגולים: סבירים.\n\nשעורי הבית: מרופרנס אם יש לכם חברים, אין הרבה חומר ברשת.\n\nהמבחן: הוראות לא ברורות מצד אחד, מצד שני אין יותר מדי חומר חדש- הרוב מבנה מחשבים. לומדים מסריקות בודדות בלבד (3-4 שהצלחתי להשיג). \n\nהשורה התחתונה: הקורס בגדול נוראי. כהרגל בקודש, פקולטה לחשמל מוציאה את הטוב מהקורס ומכניסה את הרע- הרצאות משמימות של \"לקרוא בין השורות\". מענה דל מצד המתרגלים לגבי הכל. לעומת זאת אם הסתדרתם טוב במבנה מחשבים יש לכם כבר סביבות 50 במבחן. בקורס ניתנת אופציה להגיש פרויקט במקום מבחן- אלא שזה נתקל \"בקשיים\" בדיבוב המתרגלים, בעיקר האחראי, למשל כדי לברר פרטים טכניים כמו איך לדבר עם השרת של הקורס ושלל דברים אלמנטרים שצפוי לקבל בשאר קורסים נורמלים, למשל מדריך קטן כלשהו או הפנייה לאתר - כל זה לא היה, להוסיף על זה שהמתרגל עונה תשובות \"חכמות\" פעם ביום כשנזכר לענות.", "timestamp": 1615912269174}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי וויזר\nחוות דעת - הרצאות: \nהרצאות מעניינות למי שאוהב מבנה מחשבים, רשתות נוירונים ולמידה.\n\nשם המתרגל/ת: גיל שומרון\nחוות דעת - תרגולים: \nאין יותר מדי תרגולים, רובם טובים ומחזקים את הידע מההרצאה.\n\nשעורי הבית: \n3 יבשים לא ארוכים מדי ולא קשים.\n2 רטובים שהיו הסמסטר היו לא קלים, אבל בערך 3-4 ימי עבודה סוגר אותם.\n\nהמבחן: \nעשיתי פרויקט, היה מהנה ומעניין.\nרק לקחת בחשבון שמתחילים אותו בחודש האחרון בסמסטר והוא נכנס לתקופת מבחנים.\n\nהשורה התחתונה: \nהמבחן לא קל לכן מי שרוצה ציון גבוה כדאי לעשות את הפרויקט.", "timestamp": 1617870060873}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: אורי וייזר\n\nשם המתרגל/ת: נמרוד וסאהר\nחוות דעת - תרגולים: גרוע מאוד\n\nשעורי הבית: גרוע מאוד \n\nהמבחן: לא עשיתי המבחן התנגש לי עם מועד ב אחר, אבל הוא לא מומלץ\n\nהשורה התחתונה: תעשו לעצמכם טובה ואל תקחו \nהקורס לא מתעמק בכלום, הייתי עד סוף הקורס והכל הרגיש באוויר, הקורס הכי מיותר שלי בתואר עד כה", "timestamp": 1645557239271}, {"author": "נמאס", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי ויזר\nחוות דעת - הרצאות: \nאורי מעביר רק חלק קטן מההרצאות. חלק הוא נתן למתרגל סאמר להעביר (שהיה מצוין) וחלק למרצים חיצוניים.\nכל ההרצאות באווירה מחקרית, לא ברורות בכלל ולא חד משמעיות, היו כמה הרצאות מעניינות אבל בגדול כנראה שלא תצאו משם עם ידע מועיל, הכל באוויר ובאופן תיאורטי ומרגיש שלמי שלא עוסק במחקר בנושא זה פשוט מיותר.\nשם המתרגל/ת: סאמר ונמרוד\nחוות דעת - תרגולים: \nסאמר תותח, נמרוד היה פשוט מזעזע\n\nשעורי הבית: \nקצת מייגעים אבל לא נוראים...\n\nהמבחן: הרוב לא ניגשו למבחן ואלו שכן מספרים שהמבחן קשה והבדיקה לא מקלה בכלל. במקום זה לקחנו פרויקט שהיה פשוט סיוט והדבר הכי נוראי ארוך ומיותר שעשינו בתואר. המנחה נמרוד פשוט לא עשה את עבודתו ולא הנחה אותנו אפילו הנחיות בסיסיות והכל היה כמו לירות באוויר ולקוות שמשהו יפגע. \n\nהשורה התחתונה: לא לקחת את הקורס בשום פנים ואופן, פשוט מיותר וגם הפרויקטים סיזיפים משעממים והסגל ישים עליכם קצוץ. פשוט לא שווה את זה. ואם כבר בטעות לקחתם את הקורס תיגשו למבחן ואל תיקחו פרויקט בשום אופן...", "timestamp": 1679516895638}, {"author": "הסובל", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי וויזר\nחוות דעת - הרצאות: ההרצאה הראשונה עוד נשמעת מעניינת אבל אחר כך מגיעה סדרה של הרצאות אורח לא קשורות ולא ברורות עד לרמה שלא מבינים על מה הקורס מדבר ולמה הוא נוגע. רוב ההרצאות דיברו על שיטות מתקדמות להאיץ חומרה של רשתות נוריונים והיו מאוד מבלבלות, והחומר עצמו באיזה שלב הפך להיות מאוד משעמם והיה מאוד קשה להתמיד בהרצאות. שורה תחתונה, אורי העביר הרצאות בודדות ושאר ההרצאות הועברו על ידי המתרגל או הרצאות אורח תלושות ולא ברורות\n\nשם המתרגל/ת: סאמר ונמרוד\nחוות דעת - תרגולים: סאמר משקיע ורואים שחשוב לו אבל נמרוד בכלל לא הראה חשק ועשה טובה שהוא בכלל מגיע לתרגול\n\nשעורי הבית: מאוד לא ברורים ולא קשורים לחומר הנלמד, מעייפים וארוכים. הרטובים בכלל קשים ולא ברור מה רוצים ומה שואלים בכלל.\n\nהמבחן: לקחנו פרויקט. אני מקווה שנשארתם לקרוא עד עכשיו. זה הטעות הכי גדולה שלי בתואר ואני לומד פה לא מעט שנים. הפפרויקט היה פשוט תרמית אחת של הסגל לשחוט בציונים. השקענו לילות כימים וכתבנו דברים עמוקים לאחר עבודה רצינית ומקיפה. במהלך כל הפרויקט לא קיבלנו אפילו מענה אחד למייל, לא עזרה ולא הכוונה (אחרי שהם הבטיחו שיעזרו ויכווינו כי בכל זאת הפרויקט עצמו הוסבר בחמש שורות) ואז הם פשוט שחטו בניקוד על כל השאלות הפתוחות שהצגנו בפניהם ולא ידענו מה לעשות כי לא ענו למיילים. מעבר לזה, לא הקצו חומרה ולא הנחו אפילו ברמה הבסיסית ביותר.\nכמובן שלא פרסמו מפתח ציון והציונים היו לפי רמת \"חדשנות\" בעיניהם, כך שנוצר מצב שפרויקטים קיבלו ציונים מביכים ללא סיבה ניכרת לעין\n\nהשורה התחתונה: אל תקחו את הקורס הזה. ואם תקחו אותו תקפצו לבקר פה במהלך הסמסטר ותבינו כמה הטעות שעשיתם חמורה. ואם מישהו מהסגל קורא את זה, אז זה מוקדש לכם", "timestamp": 1681640197373}, {"author": "~", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי וויזר\nחוות דעת - הרצאות: ההרצאות הראשונות מועברות על ידי אורי, שאר ההרצאות הן הרצאות אורח מיותרות שבהן חוזרים על דברים פעם אחר פעם - מיציתי באמצע הסמסטר את ההגעה אליהן\n\nשם המתרגל/ת: סאמר ונמרוד\nחוות דעת - תרגולים: נראה שלנמרוד אין רצון או כוח להעביר את התרגולים ועל כן הוא העביר מעט מהם - שגם אליהם הגיע ככל הנראה כי הכריחו אותו. לגבי סאמר, התרגולים שהעביר היו טובים.\n\nשעורי הבית: קשים, ארוכים ומיותרים.\n\nהמבחן: לקחנו פרויקט. השקענו ממיטב הזמן והמאמצים שלנו כדי לעשות עבודה מחקרית ברמה גבוהה.לקחנו חופש של כשבועיים מהעבודה. כתבנו סימולטור חומרה, כתבנו מאמר מחקרי, הצגנו בפרזנטציה את התוצאות שלנו. אבל בסופו של דבר קיבלנו ציון מביך ביותר, שלא משקף בשום צורה את כמות העבודה וההשקעה שהפרוייקט הזה לקח מאיתנו. שלא לדבר על כך שסגל הקורס כמעט ולא עזר, היה נראה שהם בכלל לא מכירים את הקוד שהם בעצמם הביאו לנו או את המטרות של הפרוייקט. דבר כזה מוגזם עוד לא קרה לי בטכניון.\n\nהשורה התחתונה: חתול בשק. לברוח כמו מאש! סגל עם אף למעלה, שאומר משהו אחד בתחילת סמסטר ומקיים משהו אחר לגמרי בסופו. אכזבה גדולה וציון שלא משקף את העבודה המופרכת שהפרוייקט דורש.", "timestamp": 1681641185770}, {"author": "***", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי וויזר\nחוות דעת - הרצאות: אורי עצמו מרצה מעניין ואיש חכם, אבל בפועל הוא מעביר אולי 15% מההרצאות. רוב ההרצאות הן הרצאות  אורח או הרצאות שהמתרגל עושה, והסילבוס של הקורס כל כך לא ברור ככה שתצאו מהקורס הזה עם שום הבנה לגבי התחום ובטח שלא תבינו מה הקשר בין השם של הקורס לבין מה שמלמדים בו. בעקרון, ההרגשה הכללית היא שמלמדים בכל הקורס איך מכפילים מהר מטריצות ועושים את זה בליווי הרצאות אורח לא ברורות ותלושות.\n\nשם המתרגל/ת: סאמר ונמרוד\nחוות דעת - תרגולים: סאמר מבין את הנושאים לעומק אבל בגלל שהקורס כל כך תלוש התרגולים לא ברורים בכלל והכל פשוט הזוי. נמרוד בכלל לא מנסה להראות שבא לו לתרגל ועושה טובה שעונה למיילים\n\nשעורי הבית: שיעורי הבית עמוסים יחסית, שאלות ממבחנים. בגלל שהחומר מורכב כולו מהרצאות אורח אין באמת הרגשה של לדעת מה השאלות מנסות להשיג ולכן השאלות תלושות ולא קשורות, קשות וארוכות. הרטובים מאוד ארוכים ומייגעים ונותנים ניקוד די רנדומלי עליהן.\n\nהמבחן: אתייחס לפרויקט. גולת הכותרת של החתול בשק הזה. בתחילת הקורס משדלים לקחת פרויקט, מעודדים ואומרים שילוו אותך לכל אורכו ושמבינים שהרוב המוחלט סטודנטים לתואר ראשון שלא כתבו מאמר או התנסו במחקר. בפועל? לא עונים למיילים כל תקופת ההגשה, מתעלמים מבקשות להקצאת משאבים או כניסה למעבדות, לא עונים לתיאום פגישות ופשוט נותנים לך להתמודד עם תיאור פרויקט של חמש שורות כשצריך לייצר מאמר ופרזנטציה. ההצגה של הפרויקט היא עשרים דקות שמתוכן מתקיפים בשאלות רבע שעה, ולא נותנים להסביר כלום. הציונים הם החלק העצוב -  רנדומליים לחלוטין. הרוב קיבלו ציונים נמוכים מאוד (מתחת ל70) על פרויקטים שדרשו שבועות של עבודה, ויתור על ימי עבודה ומועדי ב'.\n\nהשורה התחתונה: אם אתם לוקחים את זה אחרי כל האזהרות, בהצלחה.", "timestamp": 1681759568927}, {"author": "טעות של קורס לסמסטר אחרון", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי וייזר\nחוות דעת - הרצאות: את מעט ההרצאות שאורי מעביר בעצמו הוא מעביר היטב, אבל רובן עוברות על ידי מרצים אחרים. רבים מהם מרצי חוץ שעושים את זה בצורה נוראית להדהים. כמה מהם היו מהמרצים הגרועים ששמעתי בטכניון. \nבכלל אין הגיון מנחה להרצאות, פשוט אסופת הרצאות סביב נושא מסוים. מלא חזרות על אותו התוכן במילים אחרות ע\"י מרצים שונים. \nממש מרגיש כאילו סגל הקורס לא טרח לשבת רגע לתכנן מה יעבירו, אלא סתם מצאו אנשים למלא את התאריכים. פשוט מבזבזים לכם את הזמן.\nאת כל התוכן שבאמת נלמד אפשר להעביר בשני מפגשים.\n\nשם המתרגל/ת: נמרוד וסאמר\nחוות דעת - תרגולים: שניהם לא טובים במיוחד, אבל לסאמר לפחות אכפת מהסטודנטים אז הוא משתדל להסביר יותר.\n\nשעורי הבית: ארוכים, לא ברורים, לא חוזרים עם בדיקה רצינית ומלמדת. גם כשבאים לשאול את המתרגלים לא מקבלים תשובות ברורות, ואפילו מקבלים תשובות מטעות.\n\nהמבחן: לקחנו פרויקט וקיבלנו ציון סביר. הניקוד של הפרויקט לא ברור בכלל, עבדנו בצורה ממש דומה לזוגות אחרים שקיבלו משמעותית יותר ומשמעותית פחות. אולי הקוד שלנו היה מסודר יותר. השקענו המון בפרויקט, יצא תוצר ממש יפה שבקורסים אחרים היה מקבל יותר, והם סתם החליטו על ציון רנדומלי. אין לי מושג למה דווקא אחרים קיבלו יותר.\nבעבודה על הפרויקט אין הכוונה. כשפונים לסגל מקבלים תשובות חלקיות ובאיחור עצום (אם מקבלים בכלל תשובות).\nבגדול התחושה היא כמו שאר הקורס - אבל לא משקיע בזה מחשבה מראש, ולא באמת אכפת מהסטודנטים.\n\nהשורה התחתונה: פשוט אל תקחו. למרות השם והתיאור שנשמעים טוב, זה קורס מיותר ובזבוז זמן ואנרגיות. \nאפ אתם רוצים להחכים - קחו קורס אחר.\nאם אתם רוצים ציון טוב - קחו קורס אחר.\nאם אתם רוצים לחוות קורס טכניוני במובן הרע של המושג - ברוכים הבאים!", "timestamp": 1683360561859}, {"author": "לא מכבד", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה:  אורי ווייזר\nחוות דעת - הרצאות: ההרצאות היו בהתחלה מרגישות כמו המשך ישיר של מבנה מחשבים אבל אז אדון אורי ווייזר החליט להפוך את הקורס לאסופה של החלטות אורח לא קשורות, לא ברורות וללא שלד, בדגש על משעממות ככה שהקורס הזה הפך להיות סיוט ומשעמם\n\nשם המתרגל/ת: סאמר ונמרוד\nחוות דעת - תרגולים: נמרוד פשוט מתחת לכל ביקורת, סאמר עוד תגובתי אבל גם כן מתנער מאחריות ברגע האמת ומסלף את האמת לטובת הסגל\n\nשעורי הבית: היו ארוכים יחסית, לא ברורים כי החומר של הקורס לא ברור. הם פשוט ממציאים שאלות ובגלל זה המבחנים הזויים\n\nהמבחן: פרויקט. אם כבר לקחתם את הקורס הזה ועשיתם את הטעות הזאת, לפחות אל תעשו פרויקט. הסגל פשוט סילף ועיוות את הדרישות, לא נתן הנחייה וסינן במיילים. בהצגה עצמה לא הפסיקו לצאת עלינו ונתנו ציון רנדומלי (נמוכים מאוד!!!!) ככה שכל ההשקעה שלכם והכתיבה שלכם את הדברים תלך לפח ואף אחד לא יקח את האחריות. אל תתקרבו אל הסגל הזה רק צלקות ישארו\n\nהשורה התחתונה: גם אם התחום סופר מעניין אתכם, הקורס כל כך לא טוב והציונים כל כך רנדומליים ולא יציבים ככה שהממוצע שקרן ובפועל כולם נדפקים מהקורס הזה. אל תקחו כי הוא גם עמוס וגם יביא לכם את העצבים בסוף.\n\nלא לקחת את הקורס הזה !!!!!!!!!!!!!!!!!!!!!!!!!!!!", "timestamp": 1684931006975}, {"author": "Ron", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי ווייזר\nחוות דעת - הרצאות: רוב ההרצאות היו הרצאות אורח, חלק גם מחול על דברים שכביכול קשורים לתחום. בפועל, ההרצאות היו לא כל כך קשורות לחומר והייתה הרגשה כללית שלא ברור בדיוק מה החומר למבחן או בכלל מה לומדים\n\nשם המתרגל/ת: נמרוד\nחוות דעת - תרגולים: מתרגל ממש גרוע. מעביר את החומר בלי חשק, לא עונה למיילים.\n\nשעורי הבית: מבלבלים מאוד, שאלות מממבחנים שלא באמת אפשר להבין מה רוצים בשאלה. לקח לי המון זמן לפתור וגם לא מחלקים שם ציונים טובים כל כך\n\nהמבחן: עשיתי את הפרויקט. הטעות הכי גדולה שעשיתי עד כה בתואר. בהתחלה אמרו שילוו אותנו במהלך הפרויקט, בפועל אפילו לא סיפקו מכונה וירטואלית להריץ עליה, לא ענו לי למיילים ובסוף נתנו ציון ממש נמוך על פרויקט שעבדתי עליו המון זמן. דורשים לכתוב מאמר ארוך, ובסוף בודקים אותו בצורה מזלזלת ונותנים ציון נמוך מאוד. אל תקחו את הקורס כי הם יבטיחו משהו אחד ובפועל יעשו משהו אחר ויתנערו מאחריות. ההיסטוגרמה משקרת\n\nהשורה התחתונה: בדיעבד, לא הייתי לוקח את הקורס. גם לא למדתי ממנו משהו משמעותי כי הכל היה אסופה של הרצאות אורח לא קשורות, וגם השקעתי המון בפרויקט שבסוף לא העריכו, לא ענו לי למיילים במהלך העבודה והכי גרוע הציון היה ממש נמוך ביחס להשקעה המטורפת שהוא דורש. אל תקחו את הקורס, יש קורסים שילמדו אתכם יותר וגם תקבלו ציון טוב יותר...", "timestamp": 1688021175212}, {"author": "אחד בלי אף", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי וייזר\n\nחוות דעת - הרצאות: הרבה מאוד רעש בכיתה, סטודנטים לא הפסיקו לדבר. שאלו מלא שאלות. יחס SNR נמוך.\n\nשם המתרגל/ת: סאמר\n\nחוות דעת - תרגולים: הרצאות קשות, לולא המתרגל סאמר לא הייתי עובר את הקורס. עזר להשלים חומר שחסר לי מלומדות. בא קצת מחוייט מידי לקיץ הישראלי. \n\nשעורי הבית: לא היו\n\nהמבחן: קשה אבל לא מידי. קצת מתבסס יותר מידי על לומדות. שליטה טובה במד\"ח - עוזרת.", "timestamp": 1691064252366}, {"author": "omar shadafny", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה:אורי ויזר/פרידי גבאי\nחוות דעת - הרצאות: ההרצאות של הקורס מעניינות, המשך מורחב למבנה מחשבים, בסוף הקורס (5-6) הרצאות יש מרצים אורחים שגם ההרצאות שלהם טובות\n\nשם המתרגל/ת: אוררי. שוויצר\nחוות דעת - תרגולים: מתרגל מעולה, והתרגולים עצמם טובים לתרגול החומר וגם עזר לנו בפרויקט\n\nשעורי הבית: שיעורי בית לא קשים במיוחד אך לא קלים אבל חשובים להבנת החומר\n\nהמבחן: עשינו פרויקט לא מבחן, בעצם הפרויקט משלב ידע ממבנה מחשבים, בסוף בונים מערכת וחוקרים אותה.\nציונים טובים אם עושים פרויקט טוב ומושקע\n\nהשורה התחתונה: מומלץ למי שאהב מבנה מחשבים ורוצה להתעמק", "timestamp": 1717615217115}]}