{"posts": [{"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ניר וינברגר\nחוות דעת - הרצאות: \nמרצה טוב, החומר של ההרצאות כי זה קורס חדש עוד צריך שיעבדו עליו. אבל בגדול החומר מובן. אחד המרצים שידעו לפגוע עם דוגמאות מצויינות וחדות לעניין הכי שהיה לי בתואר. ובקורס כזה, זה מצוין. בסה\"כ ההרצאות בסדר מוזר ואולי גם זה שווה חידוש ובנייה מחדש.\nאבל למי שלמד מערכות לומדות, אז הקורס יסגור הרבה חורים שם. כי בההרצאות בקורס זה דווקא מלמדים יותר טוב וברור.\nיש הוכחות אבל הן מאוד סבבה ולא ממש מורכבות.\n\nשם המתרגל/ת: בני\nחוות דעת - תרגולים: \nהתרגולים הכי צריכים עבודה ובנייה מחדש בקורס.\nבקורס כזה מתמטי, כמעט לא פתרנו תרגיל אחד במהלך התרגולים בסמסטר.\nהיו יותר מדי תרגולים שפשוט חזרו על שקופיות ההרצאה ואולי הרחיבו אותן. והיו גם תרגולים של 5 שקופיות שלא היה ברור מה הועבר שם. הספר הרבה יותר מספק בהיבט הזה ביחס לתרגולים. גם הש\"ב היו כהבנה של החומר יותר טובים. פשוט לא הרגיש בכללי שזה תרגול. אפילו אם משווים לקורסים אחרים שבהם מוצהר שהתרגול זה עוד שעות הרצאה, זה מנצח באי תרומה להבנה. חייבים לכתוב מחדש את כל התרגולים.\n\nשעורי הבית: \nמתחילים סבבה וקופצים ברמת קושי לא סבירה אבל זו הדרך להבין את החומר.\n\nהמבחן: \nמנוסח מאוד בעייתי ומתסכל.\nאולי אחד המבחנים הכי מתסכלים שהיו לי בתואר.\nכנראה פיקטרו המון או הקלו מאוד בבדיקה, אבל רוב הציון הסופי מחושב בזכות ה30% תקף ש\"ב.\n(חישוב ציון סופי: HW*0.3+Test*0.7)\nבסוף חלקים מהמבחן פתירים.\nאבל כמו כל הקורס הוא צריך עוד עבודה כי הרמה שלו ואופי השאלות לא קשור בכלל לכל הקורס. אפילו לספר.\n\nהשורה התחתונה: \nהקורס עוד בחיתוליו, בעיקר תרגום ותמצות חומר מספר הקורס. מאוד מומלץ לעבוד לבד עם הספר, כי לפעמים שם ההסברים יותר טובים, וכהכנה למבחן כרגע אין יותר טוב ממנו.\nהקורס די לא עמוס, אם כי השיעורי בית יכולים להיות מסובכים או קשים מאוד. ואולי עמוס אחד שניים. אבל בגדול 3/4 גליונות שגם ככה שקולים לפתירת מבחני עבר לכאורה, כי אין מבחני עבר. והם לא תופסים זמן באמת.\nכרגע לא ממש ממליץ על הקורס למרות הממוצע הגבוה כי יש עוד על לעבוד עליו. מבחינת התוכן, מאוד אוסף ומעמיק על הרקע בהרבה נושאים במערכות לומדות.\nיכול להיות קורס מעולה, כי כן עושה עבודה טובה יותר ממערכות לומדות בהרבה רבדים.\nסה\"כ לדעתי יש הגיון טוב בפיצול שעשו בלקחת את החלק של הסקה סטטיזטית מהקורס עיבוד וניתוח מידע, ולהרכיב קורס רגוע ומעמיק יותר שעוסק רק בזה. זה מאפשר להבין יותר טוב את החומר. לתת לו את הזמן שצריך. ואיתו אפשר גם להגיע לרמה גבוהה יותר.", "timestamp": 1714828415735}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר וינברג\nחוות דעת - הרצאות: \nהרצאות סה\"כ מעניינות מועברות בצורה ברורה. הקורס באנגלית וזה קצת גרם לו פחות לזרום, אבל לא נורא. ההרצאות גם מוקלטות שזה אחלה.\n\n\nשם המתרגל/ת: בני פרץ\nחוות דעת - תרגולים: \nהתרגילים לא תמיד היו ברורים, היה חוסר סנכרון לפעמים בין ההרצאה לתרגול. בכל מקרה בני אמר שלא יתרגל את הקורס השנה הבאה.\n\nשעורי הבית: \n30% מגן.\nלא קלים בכלל, אבל נראה שהם לא באמת בדקו אותם, וכל מי שהגיש כנראה קיבל 100.\n\nהמבחן: \nהיה קשה.\n\nהשורה התחתונה: \nמבחינת עניין - קורס מעניין, צולל לתיאוריה שמאחורי הקורסים הבסיסיים בסטטיסטיקה.\nהציונים הסופיים היו סבירים (ממוצע 88), כנראה נתנו פקטור (לא פרסמו ציון נפרד לש\"ב ולמבחן, אבל מהשיחות שלנו וכמות התשובות הנכונות במבחן לא נראה סביר שלא היה)", "timestamp": 1714929965058}, {"author": "רוי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר וינברג\nחוות דעת - הרצאות: ההרצאות סבבה וניר בחור נחמד, הוא מלמד משקפים שזה תמיד מעצבן ולא אינפורמטיבי מספיק אבל ניר משתדל להסביר אותם (לא תמיד עושה את זה הכי טוב אבל משתדל). יש מקום לשיפור באיכות ההרצאות.\n\nשם המתרגל/ת: בני פרץ\nחוות דעת - תרגולים: מתרגל סביר מינוס, יש הרבה חוסר סנכרון בין התרגולים להרצאות וברוב התרגולים בני כמעט ולא פותר תרגילים אלא חוזר על כל מיני מושגים ורעיונות בקורס, בסה\"כ יש הרבה מקום לשיפור בתרגולים. \n\nשעורי הבית: 30% מגן שהם כנראה 100 וודאי לפי מה שבני אמר - כל מי שקצת התאמץ וניסה לפתור יקבל 100.\nאצלנו היו 3 גיליונות להגשה כדי לקבל את ה30%, הגיליון השני היה טיפה ארוך ועמוס אבל גיליונות 1 ו-3 יותר קצרים.\nשימו לב שבני כנראה לא יתרגל את הקורס שנה הבאה אז אלוהים יודע מה תיהיה המדיניות.\n\nהמבחן: מבחן אמנם פתיר אבל לא פשוט, חלק מהקושי בפתירת המבחן נובעת מזה שהקורס חדש ואין ממש מבחני עבר לתרגל + העובדה שהשיעורי בית והתרגולים לא מספיק מכינים אליו. \nהיתרון המשמעותי? - הבדיקה סופר מקלה ובדר\"כ יש פאקטור מסוים שפשוט יוצר ממוצע מטורף(ראו היסטוגרמות), כל מי שקצת הראה הבנה ונכונות לפתור את המבחן יקבל בכיף מעל 80 שזה אחד המשוגעים.\nשוב - לקחת בעירבון מוגבל כי זה כנראה תוצר-לוואי מכך שהקורס חדש והם רוצים לשמור עליו שלא יסגר.\n\nהשורה התחתונה: אותי אישית החומר עניין, אני לקחתי אותו נטו מתוך עניין ורצון להרחיב אופקים בסטטיסטיקה ואני בסך הכול לא מתחרט כי הוא לימד אותי דבר או שניים. אבל העובדה שהקורס חדש ומועבר במצגות מגעילות כאלה מורגשת לצערי.\nבונוס נוסף - יש הקלטות של כל ההרצאות והתרגולים מסמסטרים קודמים שהם מפרסמים חופשי במודל(אני ראיתי את כל הקורס מוקלט).", "timestamp": 1715159596421}, {"author": "סטטיסטיקאי עצלן", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: מעט מונוטוניות. ניר מאוד נחמד ודואג שכולם יבינו. אני אישית די התקשיתי בגלל שהרקע היחיד שלי בתחום הוא הסתברות 1ח' \n\nשם המתרגל/ת: בני\nחוות דעת - תרגולים: שווה להגיע. בני נוטה קצת לצאת מתחומי הקורס, לפעמים זה לטובה ולפעמים זה מבלבל.\n\nשעורי הבית: היו לנו כמה גיליונות, הרוב בגבול ההיגיון ובכל מקרה מקבלים 100 אם רואים שניסיתם.\n\nהמבחן: המבחן לא היה פשוט ודרש הרבה קריאה מהספר של הקורס כדי להתתכונן אבל בסוף הייתה בדיקה די מקילה (הממוצע מדבר בעד עצמו)\n\nהשורה התחתונה: קשוח עבור מי שבא רק עם הסתברות 1ח'. זה אמנם פתוח לתואר ראשון והקדם היחידי הוא הסתברות 1ח' אבל רוב הסטודנטים אצלנו היו בתארים מתקדמים ואחרי קורסים מתקדמים יותר בתחומים של התסברות (עם דגש על אותות אקראיים).", "timestamp": 1718181167221}]}