{"posts": [{"author": "חובב המלך", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חובב גזית\nחוות דעת - הרצאות: חובב מעביר את ההרצאות בצורה מעניינת ומצחיקה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס לא חשוב כל כך, ציונים גבוהים, מרצה אלוף", "timestamp": 1599461845854}, {"author": "ש", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חובב גזית\nחוות דעת - הרצאות: \nמומלץ להקשיב, נותן הרבה דגשים וממש לא חושש לפזר רמזים למה חשוב (ומה לא)\nשם המתרגל/ת: (הרצאות ותרגולים הם ביחד במקצוע הזה)\nחוות דעת - תרגולים: \n\nשעורי הבית: \nאחלה לא עמוסים מדיי, ציונים גבוהים\n\nהמבחן: \nדומה למבחני עבר\n\nהשורה התחתונה: \nקורס כיפי יחסית, לא כבד מדי אבל מלמד עקרונות מעניינים (מקביליות/ביזור/database0ים וכו על קצה המזלג)", "timestamp": 1602616305578}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: \n\nקורס חביב ולא עמוס , חובב הוא המרצה והמתרגל, ובפועל יש רק הרצאות. תמיד השיעור יותר קצר מהזמן המתכונן לשיעור. אם בא לכם לסגור חור במערכת בלי הרבה עומס, זה קורס בשבילכם", "timestamp": 1626336353607}, {"author": "dani rich", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "אחלה מרצה \n\nשעורי הבית: \nחובה בזוגות, בינוניים. בודקים הבנה של כתיבת קוד\n\nהמבחן: \nלא קשה מדי, כן צריך להראות הבנה (ולכתוב יפה)\n\nהשורה התחתונה: \nממליץ מאוד! אישית התעניינתי, הרבה יותר הבנת השפה הנלמדת מאשר תכנות פונקציונלי בכללי.", "timestamp": 1634919692988}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: \nדי משעממות, הוא לא ממש מסביר לעומק נושאים חשובים, ובעיקר מעביר בחוסר חשק את החומר. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nחוזרים על עצמם, אפשר פשוט לרפרנס בקלות\nהמבחן: \nמצד אחד היה קל, מצד שני הוא קוטל הבדיקה מאוד אקראית, יש אנשים שמקבלים ניקוד מלא ועל כמעט אותה תשובה אנשים אחרים מקבלים 0.\nהשורה התחתונה: \nלא ממוצע כל כך גבוהה, ולא מועבר בצורה כל כך טובה. אם אפשר אז להימנע", "timestamp": 1679844796847}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חובב גזית\nחוות דעת - הרצאות: החומר מעניין והמרצה מעביר בצורה מעניינת\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: סבבה\n\nהמבחן: לא כזה קל אבל הוגן\n\nהשורה התחתונה: חובב אלוף, והקורס מעניין ממש. ממליץ.", "timestamp": 1679945519675}, {"author": "1", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה + מתרגל: חובב גזית\nחוות דעת - הרצאות + תרגולים: למעשה ההרצאות והתרגולים בקורס הם ביחד והם פשוט שיעור אחד וחובב אחלה גבר מעביר אותם בצורה מעולה ומעניינת.\nלדעתי ההרצאות ממש מעניינות לכל מי שמתעניין בתחום התוכנה, זה כמו ללמוד עולם אחר של תוכנה (של תוכנה מבוזרת) כי גם מתעסקים בשפה שהיא קצת שונה מהשפות הרגילות שאנחנו רגילים לגעת (פייטון סיפיפי, סי) וגם העולם שלשמו השפה הזאת מיועדת הוא עולם שונה (של מערכות מבוזרות).\n\nשעורי הבית: 3 תרגילים רטובים קלילים שאפשר לרפרנס אבל כדאי להבין אותם.\n\nהמבחן: המבחן מאתגר, בגדול לפתח שיחה עם חובב ולשפוך את כל הידע וההבנה שיש לכם בנושא, סה\"כ מבחן הוגן לגמרי.\n\nהשורה התחתונה: אין לי טעם להמליץ לכם כי זה הסמסטר האחרון שהקורס הזה מועבר :( אבל אם הוא יחזור בעתיד או ווראציה שלו תחזור בעתיד אז אני ממש ממליץ!!!", "timestamp": 1715061480848}]}