{"posts": [{"author": "Omer Laor", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים ערוכים טוב\n\nשעורי הבית: עמוסים יחסית, הרבה לכתוב, לפעמים יש רפרנסים\n\nהמבחן: כותבים הרבה, אבל רק צריך להכיר טריקים\n\nהשורה התחתונה:", "timestamp": 1602064393829}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: מצוין. קצב יחסית מהיר אבל מאוד מובן.\n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים: טוב.\n\nשעורי הבית: מקיפים וקצת מאתגרים.\n\nהמבחן: בשנים קודמות היו מבחני בית של 24 שעות. הסמסטר היה מבחן \"רגיל\" של 3 שעות לראשונה. בפועל זה היה מבחן של 24 שעות שציפו שנפתור ב-3 שעות.\n\nהשורה התחתונה: קורס מעניין, לא בטוח כמה שימושי. לא לקחת עד שיחזור להיות מבחן בית או שלפחות יתחלף המרצה.", "timestamp": 1657824113442}, {"author": "Bellman", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: מרצה מצוין, מסביר מאוד טוב את החומר.\n\nשם המתרגל/ת: יונתן שדמי\nחוות דעת - תרגולים: מתרגל טוב. \n\nשעורי הבית: חמישה גליונות ארוכים יחסית, ביחידים. שאלות מאתגרות אבל עוזרות להבין טוב את החומר.\n\nהמבחן: מבחן ארוך מאוד, מתאים ל24 ולא ל3 שעות (סמסטרים קודמים המבחן היה יום שלם) אבל עם פקטור שמפצה.\n\nהשורה התחתונה: קורס מאוד מומלץ למי שאהבו אותות אקראיים והסתברות ורוצים ללמוד על נושאים מתקדמים בתחום. הוא תאורטי אבל יש לו גם חשיבות לעוד תחומים כמו לומדות", "timestamp": 1658163800051}, {"author": "קשה קושי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רמי אתר \nחוות דעת - הרצאות: הרצאות טובות\n\nשם המתרגל/ת: יונתן שמדאי\nחוות דעת - תרגולים: תירגולים טובים\n\nשעורי הבית: 5 גיליוני בית יבשים ותקפים\n\nהמבחן: בסמסטר אביב 2022 בהיחליטו לעשות את המבחן ב3 שכות במקום 24. זו הסיבה לדעתי שלא פירסמו את ההיסטוגרמה כי הציונים היו ממש יותר נמוכות מסמטרים קודמים שבו הבמחן הייה נעשה במכוון.\n\nהשורה התחתונה: קורס מאוד מעניין ומטמתי. בצורה אישית הקורס ההכי מאתגר בצורה שיכלית שלקחתי (המוסגים הרבה יותר מופשטים מאינפי 1מ ואלגברה למשל). אבל אי אפשר לפתור את המבחן מסוג הזה ב3 שעות.פשוט אי אפשר.", "timestamp": 1675458404112}, {"author": "-", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רמי אתר\nחוות דעת - הרצאות: ברורות, מסודרות, חומר מאוד מעניין. מצד אחד זה מתמטיקה שמתארת מערכות אקראיות פרקטיות כמו שוק ההון, קזינו או מערכות פיסיקליות ומצד שני זו מתמטיקה מאוד מופשטת. השעות קבלה של רמי מאוד עזרו לי.\n\nשעורי הבית: היו 5 גליונות, הם קשים.\n\nהמבחן: קשה אך כשצריך מפוקטר בהתאם.\n\nהשורה התחתונה: קורא נורא מעניין אך גם אחד הכי קשים שעשיתי.", "timestamp": 1704020023033}]}