{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אייל ומרק\nחוות דעת - הרצאות: החומר מאוד מעניין ומאתגר, הרצאות קשות לפעמים להקשיב לאורך זמן במיוחד בנושאים המבלבלים כמו רנדומליות ובלוק צ'יין.\n\nשם המתרגל/ת: איתי צברי\nחוות דעת - תרגולים: מתרגל סביר בסה\"כ, לא יודע מה היה הקטע שלו הסמסטר אבל התנהג כמו ילד קטן ועשה לנו דווקא על כל דבר שביקשנו.\nרצינו שעות קבלה (מה שהוא מחוייב לתת) התנגד.\nשינה את הסילבוס שבועיים לפני סוף הסמסטר וכשהתלוננו על זה דרך הנציגת סמסטר והרכזת הוא סוג של איים שלא נקבל פקטור אם נמשיך ככה במבחן (כמובן שבסוף לא היה פקטור כן?)\nהכי הזוי שהחלוקה הייתה 3 בחנים לאורך הסמסטר ואז במועדיי ב' הוא פשוט החליט לאחד את שלושתם למבחן אחד נגד התקנות.\nקיצור מתרגל בסדר בהסברים אבל בהתנהגות וביחס לסטודנטים חבל שאין ציון שלילי במשאל ...\n\nשעורי הבית: לא עמוסים ומאוד כיפיים בעיניי\n\nהמבחן: הזיה אין מה להגיד \n\nהשורה התחתונה: קורס מעניין, צוות קורס מייצגים את הגישה של הטכניון בקורונה - הסטודנט לא מעניין אותנו", "timestamp": 1616311684540}, {"author": "הליקופטר", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: הרצאות מעולות ומעניינות. עוברים על הרבה נושאים ולא נכנסים לעומק ברובם. מדברים על קריפטוגרפיה, על עקרונות אבטחה, בלוקצ'יין, פרטיות, אימות והרשאות ובסוף הקורס גם לומדים איזה 2 הרצאות על אבטחה בlow-level בחומרה.(SGX,side chanels וכו').\n\nשם המתרגל/ת: רועי \nחוות דעת - תרגולים:  עקב האכילס של הקורס. התרגולים לא באמת מכינים למבחן או מציגים תרגילים על החומר בהרצאה אלא רק חוזרים/מוסיפים עוד חומר תיאורטי או רקע מתמטי להבנת ההרצאה. בנוסף לא אהבתי את צורת ההעברה של רועי, הוא מתרגל חדש כך שאולי זה ישתפר אבל נכון לסמסטר שלנו הוא פשוט הקריא מהמצגת והיה מאוד קשה לשמור על ריכוז(הוא בעצמו התבלבל לא מעט).\n*יש הקלטות שתואמות ב80-85 אחוז את החומר משנה שעברה של איתי והוא טיפה יותר ברור(התרגולים הם אותם תרגולים).\n\nשעורי הבית: 4 יבשים (עם נגיעות רטובות בפייתון) תקפים, סך הכל 30 אחוז. לא קצרים אבל לדעתי מלמדים ועוזרים להפנים את החומר, כדאי להשקיע. התרגילים מחודשים ביחס לשנה שעברה אז הם מרופרנסים חלקית.\n\nהמבחן:לא קשה אבל מאוד רנדומלי, קשה להתכונן כי יש המון חומר שלא נכנסים אליו לעומק וכל שקופית או שניים יכולות להיות סעיף של 5 נק'. הקורס לא מועבר מספיק זמן שיהיו מספיק מבחנים לתרגול אבל עושים מה שאפשר.\nהמבחן שלנו סטה קצת לנקודות מתמטיות שהיו הטריק המרכזי בשאלות אבל בסך הכל היה הוגן. \n\nהשורה התחתונה: אחד הקורסים הכי מעניינים שלקחתי בתואר, עוברים על הרבה נושאים רלוונטים שפותחים את הראש. הקורס לא עמוס כל כך והחומר עצמו (אם להתייחס לכל נושא לחוד) לא קשה. \nמומלץ.", "timestamp": 1675365278186}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  איתי אייל\nחוות דעת - הרצאות: איתי אייל אחלה מרצה. חד מאוד ומדויק במילים שהוא בוחר להשתמש בהם בשביל לא להטעות ולא לומר שום דבר מיותר. תמיד מבין כמו שצריך את השאלות ששושאלים אותו בהרצאה.\n\nשם המתרגל/ת: רועי בר-צור\nחוות דעת - תרגולים: התרגולים בחלקם חוזרים על חומר שנאמר בהרצאה ובחלקם מוסיפים חומר חדש לגמרי (לדוגמה כל הפן היותר פרקטי ומתמטי של חישובי הצפנות ועקומות אליפטיות). היו תרגולים קריטיים לחומר ולמבחן והיו תרגולים שלא בנויים עדיין כמו שצריך ולא ברור מה הפואנטה שלהם. רועי מתרגל חדש בקורס והוא עדיין לא היה משופשף לגמרי על איך נכון להעביר כל תרגול במטרה שהסטודנטים יבינו כמו שצריך, אבל הוא כן יודע את החומר.\n\nשעורי הבית: 4 תרגילי בית שברובם יבשים עם כמה סעיפים רטובים של לסמלץ עקרונות באבטחה בשפת פייתון (נדרש ידע בסיסי, אפשר להשלים אותו לבד תוך כמה שעות). התרגילים מרופרנסים בחלקם. חלק מהתרגילים פילוסופיים על שיטות אבטחה וחלק מתמטיים, לעיתים קצת כבדים יחסית למצופה מראש מהקורס. הקורס דורש ידע בסיסי בהסתברות.\n\nהמבחן: אין הרבה מבחני עבר, ואין עדיין תבנית קבועה של מבחנים ככה שהדרך הכי טובה ללמוד למבחן היא להיות חדים על התרגולים, ההרצאות, ו*כל דבר חישובי שהתבצע בתרגולים*.\n\nהשורה התחתונה: קודם כל, זה לא קורס \"הגנה ברשתות\" או \"תכנות מאובטח\" או משהו כזה. זה קורס שעוסק במבט אקדמי יותר על \"עקרונות וכלים באבטחת מחשבים\". אין פה בכלל עניין של תכנות חוץ מסימלוץ של עקרונות בפייתון. הקורס פותח את הראש ומלמד על המון מונחים ושיטות מעולם האבטחה, אבל כמעט ובלי פרטיקה. זה לא בהכרח רע! אבל תהיו מוכנים לזה.\nהוא מעניין, עם תרגילי בית שלעיתים היו קצת טריקיים, אבל עם סגל טוב שמשתף פעולה ומענה מהיר על שאלות בפורום.", "timestamp": 1676115760851}]}