{"posts": [{"author": "Fini", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גדי\nחוות דעת - הרצאות: ראיתי את המוקלטות, סה\"כ היו די טובות.\n\nחוות דעת - תרגולים: אין תרגולים.\n\nשעורי הבית: כותבים ב-cpp, התרגילים הראשונים פשוטים, אח\"כ זה הולך ומסתבך. בסמסטר הזה עבר קצת פחות חומר ולכן הם היו פחות קשים מסמסטרים קודמים (גם הפרויקט) אבל אני יכול להבין את התגובות בפייסבוק על הקורס באופן כללי.\n\nהמבחן: יש פרויקטון במקום מבחן. אם היה עובר הסמסטר יותר חומר אני לא בטוח אם זה היה שווה את זה. \n\nהשורה התחתונה: מאוד קל לצוף ולא להיות מחובר לקורס, בטח כשבהתחלה הוא לא עמוס בכלל. אם אין רפרנסים לש.ב  אז אני לא ממליץ לקחת כי משתמשים בפקודות מתוך ספריה אזוטרית של אינטל עם מעט חומר ברשת. הערה חשובה: כל קשר לספרתיות מקרי בהחלט. לדעתי, כדי להיות קצת יותר מחובר למה שקורה בקורס צריך לעשות ממ\"ת / מת\"מ.", "timestamp": 1664386091417}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: גדי הבר\nחוות דעת - הרצאות: המרצה הכי גרוע שיצא לי לעבור דרכו. יש תחושה שהוא מזלזל בסטודנטים, מאוד מפוזר, לא ברור, הרבה שאלות סטודנטים שעונה עליהם בגסות ובחוסר סבלנות.\nכמעט כל הקורס אתם תנסו לפרש למה גדי התכוון. \nהיו כ2-3 הרצאות שגדי הבריז מהן בלי לעדכן (עד היום הוא לא הצליח להבין את הקונספט של \"מתכונת יום חמישי\" שהטכניון לפעמים עושה).\n\nשם המתרגל/ת: גדי הבר\nחוות דעת - תרגולים: התרגול הוא בעצם המשך ההרצאה, לא תמצאו כאן הסברים או חזרה על החומר\n\nשעורי הבית: היו 3 תרגילים רטובים סבירים, כנ\"ל לימוד עצמי/רפרנס.\n\nהמבחן: פרויקט גמר בזיוני, מהשניה הראשונה הפרויקט לא הוסבר כמו שצריך והמרצה אפילו לא טרח לעדכן את קובץ הפרויקט כמו שצריך. \nלאט לאט זה פשוט הפך לסיוט. אף אחד בקורס לא הצליח כלום והפרויקט נדחה כל פעם בשבוע, סה\"כ 3 שבועות כך קרה !\nלא תקבלו שום ליווי שיעזור לכם מהמרצה, יש אוירה שהוא עושה טובה שעונה על שאלות ולא תקבלו תשובה ברורה.\nתסכול שאין דברים כאלה. עבדנו על הפרויקט כחודש וחצי כאשר כמעט כל יום שקלנו לפרוש. לבסוף יש פרזנטזיה בזום והציונים היו טובים (חצי נחמה).\n\nהשורה התחתונה: להתרחק כמו מאש !! נכון הקורס מפתה כי הממוצע מדהים ואין מבחן אלא עבודה, אבל זה ממש ממש לא שווה את זה, הקורס הרס לי את הקיץ, הוא דורש ללמוד הכול לגמרי לבד, נמשך הרבה יותר מהזמן של הסמסטר ולא שווה את הנק\"ז והעצבים שלכם (היה עדיף by far לעשות מבחן).", "timestamp": 1696619596942}, {"author": "מקווה שזה יתן קצת פרספקטיבה על הקורס", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גדי הבר\nחוות דעת - הרצאות: מרצה שאולי קצת קשה לעיכול לחלק. יש קטעים שהוא מסביר טוב ויש קטעים שמרגיש לא ברור או אולי קצת מזלזל. הוא מוכן להסביר שוב אבל עם סף הסבר קצר לחלק. ב1 על 1 עוזר מאוד. הוא גם מאוד רוצה שהסטודנטים יצליחו.\nברור שיש מרצים טובים יותר, אבל חד משמעית יש מרצים וחברי סגל הרבה הרבה יותר גרועים ממנו בפקולטה.\nלדעתי 3.5/5 זה ציון הגיוני אם היה במשאל מרצה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: הקורס הזה צריך מתרגל. מי שמעביר את התרגולים זה המרצה. וזו הפגיעה הכי קשה בקורס.\nאם היה מתרגל, זה היה עוד אדם שאפשר לפנות אליו. מערך התרגול היה אולי נבנה יותר ברור וטוב במקום עוד שעת הרצאה שהרצף יוצר אי בהירות לפעמים איפה אתה בחומר הרצאה או תרגול. ולרוב השעה הייתה הופכת לשעת קבלה או שאלות על תרגילי הבית. במיוחד אם היה מסיים את ההרצאות בשעתיים הראשונות.\nמתרגל, היה יותר בא מזווית של סטודנט או חבר הוראה מסודר. וזה היה משפיע המון לטובה. מקווה שהפקולטה תביא מתרגל לקורס. תאמינו לי זה ישנה הכל.\n\n\nשעורי הבית: 3 תרגילי בית + פרויקט.\nהיה אמור להיות תרגיל בית 4 אבל מגלל דחיות הגשה ועיכובים בבדיקה של הבודק ושהתרגיל 4 לא יהיה על מועדי א', הוא אוחד לפרויקט.\nמה שיצר המון באלגן לרוב הקורס, כי גרם לקפיצה קיצונית מדי מתרגיל 3(התרגילים עלו ברמת הקושי מתרגיל לתרגיל) שעוד היה די קל מאוד לפרויקט סביר ולחלק אולי קשה. הפרויקט אפשרי בהחלט. שיעורי הבית לא היו עם משוב מספק בכתב ורק היו עם ציון. אז אם טעית מבחינת מימוש מסוים פחות תדע עד שתברר מול המרצה.\nמבחינת הפרויקט היו מספר מפגשים כלליים יחסית מאוחר מבחינת לוח הזמנים של הפרויקט.\nשם התבהרו מלא אי בהירויות, ונוסח הפרויקט שונה ועודכן תוך כדי קצת.\nבעיות שצצו מגלל תרגיל 4 שאוחד גרמו לרוב להתחיל לעבוד על המשימה האמיתית של הפרויקט באיחור של חודש.\nהקבצים הנתונים גם הם שונו כמה פעמים.\nבמהלך הסמסטר עצמו הקורס מאוד לא עמוס. כל ביקורת שתקראו זה נטו מאיך שהתפתח עם הפרויקט. לדעתי הוא ילמד מאיך שהיה וינסה לתקן. אבל שום דבר לא מובטח. הש\"ב לפני הפרויקט באמת היו קלים מאוד ביחס לפרויקט.\nכמו שנאמר, אם הש\"ב היו יותר מועילים ומסודרים. אם הפרויקט היה מתוחם, ברור, ונבדק היטב לפני פרסומו. היחס היה אחרת.\nאם היה מתרגל, אז בכלל היה אחרת. לטובה. סה\"כ הפרויקט מאוד מלמד. למדתי באמת לא מעט לטובת הפרויקט. ואני בכיף אשתמש בו כדי להציג בקו\"ח.\n\nהמבחן: יש פרויקט במקום מבחן.\n\nהשורה התחתונה: \nקורס שיכול להיות חלק ויכול להיות מאוד מאוד מעניין. הוא מאפשר להבין בצורה הרבה יותר עמוקה ופרקטית נושאים ממבנה מחשבים וחלק ממערכות הפעלה. ומומלץ לבוא לקורס בצמוד או עם מבנה מחשבים כקדם. לומדים הכל מאפס בקורס, אבל חלק לא נלמד נכון או כמו שצריך. וזה אחלה משלים. התרגילים הרטובים בסוף מרחיבים את ההבנה של הנושאים במבנה מחשבים לעומת הסימולציות המגוחכות במבנה מחשבים.\nבסוף, אפשר להצליח. מאוד. אך, צריך להיות מוכן ללמוד הרבה לבד. לשאול כמה שיותר את המרצה מתי שאפשר. לדעת לעבוד מול API מזעזע של הסיפריות העיקריות של הקורס. משתמשים בסיפריות Intel Pin וXED. הם גולת הכותרת של הקורס. המטרות של הקורס זה ללמוד את השימושים שלהם ומעבר. לומדים גם עקרונות בכלל של תרגום ואופטימיזציה.\nאך, עיקר הקורס הוא בפוטנציאל בסביבה הנ\"ל. מי שמתעניין בהנדסת מחשבים/ארכיטקטורה/**שיפור ביצועים**/תוכנה/אסמבלי, יכול מאוד לאהוב את הקורס. ונכון הפרויקט יהיה כנראה מורכב ואולי קשה. אך, כששמים את זה בפרופורציות של קורס 3 נקז וממוצע 94-95. זה הגיוני. תשוו את זה לבין מעבדה ולפרוייקט א'. ואז הקושי מוצדק. יותר רציני מהפרוייקט במעבדה 1א'. אבל פחות מפרויקט א'. \nגם הציונים הנמוכים ביותר ששמעתי שהיו בפרויקט, היו מעל ה90.\nאם אתה סטודנט מפציץ במבחנים ובטוח שתוציא קרוב ל90 או אפילו 85 ומעלה בכל קורס עם מבחן. אז אולי לא כזה כדאי.\nאם אתה מעדיף פרויקטים במקום מבחנים או רוצה לעלות ממוצע. זה אחלה קורס לזה.\n\nהפרויקט נעשה בקיץ בעיקרון.\nזה לא קורס לכל אחד. חד משמעית. אבל מי שכן יתחבר, יאהב. אני כל הקיץ דיברתי על הפרויקט עם חברים ומשפחה, מרוב שזה עניין אותי.\nלמרות כל הביקורות, והתחושות שהסיפרייה מאוד איזוטרית. ויש הגיון בכך כי היא די כן. אך היא סיפרייה עדכנית. והתחום עצמו הוא מאוד מושקע על ידי הרבה חברות. חפשו קצת על Binary Translation או Optimisation. ותוכלו לראות איפה זה מתקשר. מאימולטורים מוכרים כמו BlueStacks ואף מערכות ייעודיות שחברות גדולות פיתחו לטובת שיפור שירותיהן.\nהאם אפשר ללמוד לבד? כן, כמו כל קורס בטכניון.\n\nלסיכום, קורס שבמהלך הסמסטר מאוד לא מעמיס. לא קורס לכל אחד. ואני מחדד על כך. זה נוטה מאוד להיות דכיטומי או שאתה מתחבר או שלא. אם מתחבר, ממוצע 95-94 לקורס בשרשראות עם מלא קורסים מורידי ממוצע. אחלה. באמת. קורס גם שאם אתה לוקח אותו לכיוונים הנכונים אפשר מאוד ללמוד ממנו. הרבה יותר מלא מעט קורסים בפקולטה. אפשר גם לא ללמוד ממנו. כנראה כבר לא יהיה כמו שהיה בשנים לפניכן, קורס להגיע כיף וללכת לכאורה. יהיה קשה יותר משנה לשנה הפרויקט. אבל, זה גם לדעתי בסוף מוסיף. כי הפרויקט נעשה רציני יותר משנה לשנה. תלוי בך.", "timestamp": 1708458799422}, {"author": "~", "difficultyRank": 5, "generalRank": 1, "semester": "202302", "text": "שם המרצה: גדי הבר\nחוות דעת - הרצאות: \nלברוח!!! חתול בשק ענק, קורס עם פוטנציאל מעולה וביצוע פח של מרצה לא מוצלח. לא להתפתות בגלל שאין מבחן, יש פרוייקט ענק בסוף הקורס שהמרצה עצמו לא הצליח לכתוב. הזמן שתשקיעו בלנסות להבין מה הוא רוצה בפרויקט לא משתווה לזמן שתלמדו למבחן. לברוח!!", "timestamp": 1709398178878}]}