{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: משעמם ומונוטוני\n\nשם המתרגל/ת: ליאור זנו\nחוות דעת - תרגולים: בגדול בסדר \n\nשעורי הבית: התרגילים הרטובים לא מובנים ולא מוסברים בכלל, עדיף לרפרנס ולא להשקיע זמן בחרא הזה\n\nהמבחן: מה יש להגיד על מבחן שכל הקורס נכשל? \n\nהשורה התחתונה: קורס זוועה שמעבירים באופן זוועה עם מרצה חרא שחושב שאם כל הסטודנטים נכשלו במבחן אז זה אשמת הסטודנטים והוא מלאך", "timestamp": 1598970204960}, {"author": "Alon Wool", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: איתי אייל \nחוות דעת - הרצאות: מרצה ממש גרוע. לא ברור ומדבר ממש מונוטוני. יכולתי לשמוע אותו רק בכפול 2\n\nשם המתרגל/ת: ליאור זנו\nחוות דעת - תרגולים: מתרגלים מושלמים והיה מסודר. החלק הכי טוב בקורס\n\nשעורי הבית: איום ונורא ובלתי ברור\n\nהמבחן: הכי מזעזע שעשיתי בתואר. מבחן מטעה ודו משמעי ושגיאות בפתרון הרשמי, ממוצע שלושים ופקטור הכפלה ב2 לממוצע 60\n\nהשורה התחתונה: קחו את הקורס של מדמח", "timestamp": 1599452150270}, {"author": "אור כהן", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "מרצה אייל איתי: המבחן היה קטסטרופה עם ממוצע 35 , ופקטור של להכפיל את הציון פי 1.8 (כי קורונה אז המרצה איבד שליטה על עצמו).", "timestamp": 1600588156831}, {"author": "Matti baer", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: מלא חומר די משעמם\n\nשם המתרגל/ת: אלון ברקנשטט\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: רטובים קשים, יבשים חופרים\n\nהמבחן: נורא ואיום, מלא חומר איזוטרי שאי אפשר לזכור את כולו\n\nהשורה התחתונה: חרא קורס", "timestamp": 1602676452070}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: מרצה גרוע בלימודים ולפני יומיים מהמבחן לא היה יודע אם החומר כלול במבחן או לא, תודה למתרגל שיידע התשובה.\n\nשם המתרגל/ת: כולם בינוניים - הידע שלהם מוגבל בחומר - לא יודעים הדברים בחומר לעומק.\nחוות דעת - תרגולים: בגדול בסדר\n\nהמבחן: חחחחח, תשאל את המרצה והמתרגל הם יגידו לך את דעתם. עד עכשיו הם מאשמים את הסטדונטים ולא את עצמם (כל הסטודנטים נכשלו במבחן כולל סטודנטים חזרו על הקורס ויש להם ציונים 75+ לפני)\n\nהשורה התחתונה: לקחת מערכות הפעלה של מדמ\"ח 234123, שם הסגל שתי רמות מעל הסגל של חשמל.", "timestamp": 1603004830738}, {"author": "YG", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "הקורס מלמד כמה נושאים חשובים מאד בתכנות ומקביליות שחובה לדעת, מצד שני חלק גדול מהחומר הוא דיי עיוני ומשעמם ולא רלוונטי לרוב. יש כמות מאד גדולה של חומר בקורס ואין באמת חפיפה בין התרגול להרצאות, יש דברים שנלמדים רק בתרגול ודברים שרק בהרצאה. למשל הנושא של תקשורת ורשתות לא נלמד בהרצאה ויש עליו תרגול אחד שאמור לכסות את כל החומר ואז יש עליו תרגיל רטוב שלם.\n\nשעורי הבית: \n3 רטובים מאד ארוכים עם הוראות לא ברורות שאגב כמעט לא השתנו כבר כמה שנים ולמרות שכל סמסטר יש דברים לא ברורים לא מחדדים אותם, אלא עונים תשובות סותרות בפורום וכל שאלה הופכת לשאלת קיטבג. \nהרטובים לוקחים הרבה מאד זמן, כנראה שחכו שהקורס הזה הוא רק 3 וחצי נקודות ונותנים לכתוב דברים מאפס, אז מבלים 70 אחוז מהזמן בדברים כמו לפרש ארגומנטים מהmain ולבדוק כל מני שטויות, חוץ מבתרגיל הראשון שבו הביאו שלד  לתרגיל שמביאים כבר 5 שנים אבל התרגיל קצת שונה, שם הכשילו בכוונה כשנתנו קוד שמניח אורך קלט מקסימלי אבל שמו טסט שמכשיל את זה בטענה ש\"שאלו בפורום על זה וענינו אז הייתם צריכים לקרוא את כל 50 הפוסטים שהיו בפורום על התרגיל\".\n\nהיבשים דווקא בסדר ודי גורמים ללמוד את החומר טוב\n\nהמבחן: \nעוד לא היה לנו, הסמסטר הוא מקוון ועם חומר פתוח מודפס בלבד\n\nהשורה התחתונה: \nאם אתם בהנדסת מחשבים ותוכנה אין לכם ברירה, אם אתם בהנדסת מחשבים עדיף לקחת את הקורס של מדמ\"ח, הוא יוצא בסופו של דבר פחות עמוס מהקורס של חשמל + מעבדה.", "timestamp": 1612559494461}, {"author": "יעל", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יבשים סבבה יחסית ויש רפרנסים, רטובים סיוט של החיים!! \n\nהמבחן: אמאלהה!! אין קשר לחומר ולשום דבר בכללי! ממוצע 40 שרק עם פקטורים מטורפים מעלים את הממוצע ל70-80 \n\nהשורה התחתונה: תברחו אם אתם לא חייבים לקחת", "timestamp": 1629184228746}, {"author": "Roy Mahlab", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: \nחושב שהוא מרצה טוב בסך הכל כי הוא מצליח להסביר כל נושא בצורה מובנת, אבל כמות החומר והרמה של השליטה שצריך בו מאוד גבוהה. לגמרי צריך להיות 5 נקז כמו שהוא\nשם המתרגל/ת: ליאור זינו\nחוות דעת - תרגולים: \nפשוט עוד שעתיים של הרצאה עם מרצה שקוראים לו מתרגל.\nרק אגיד שליאור ממש טוב\nשעורי הבית: \nלא קלים אבל גם לא קשים מדי. מאוד רלוונטים לתרגולים.\nהמבחן: \nהיו לנו שאלות של הוכחות שלא היו באינפי. פקטור של כפול 1.2 שקצת מראה שהציון הסופי הוא די רנדומלי\nהשורה התחתונה: \nקורס מאוד מעניין וקשה", "timestamp": 1634830001556}, {"author": "swap device", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מרק\nחוות דעת - הרצאות: ההרצאות של מרק טובות, והוא בסה\"כ מרצה טוב\n\nשם המתרגל/ת: ליאור זנו \nחוות דעת - תרגולים: מתרגל נפלא. באמת אחד המתרגלים החזקים שהיו לי בתואר\n\nשעורי הבית: קשים, ארוכים, מייגעים, לא ברורים, לוקחים המון זמן. (טיפה) מלמדים את החומר ומפילים אסימונים.\nהשיעורי בית היבשים קצרים מאוד לעומת זאת.\n\nהמבחן + השורה התחתונה:  נורא. אני חושב שזה סטנדרט של הקורס. באופן כללי אין פשוט אין מספיק זמן לסיים את הבחינה. הרמה בבחינה קשה מאוד וללא ספק זה לא קורס בחירה כיפי במובן הזה. יש אינסוף חומר בקורס ואין באמת תרגולים ( התרגול זה פשוט הרצאה נוספת, לא בהכרח קשור גם למה שעובר בהרצאה)\n\nהסגל היה מאוד מופתע מהציונים (לרעה) וטען שהמבחן היה קל, והאשים אותנו. אני לא יודע מה להגיד, לדעתי היה מבחן קשה כרגיל וחוסר זמן כרגיל.. מעניין אם מתישהו משהו בקורס הזה השתנה.\nעוד משהו אחד קטן : יש סדנאות, שהם לא חובה אבל הם התרגול היחידי בחומר.. לדעתי הסדנאות ברמה סבבה אבל מי שמעביר אותם הרבה לטעות במהלך הסדנא ובעיקר לבלבל אותי.\n\nממליץ על למידה משמעותית וארוכה למבחן, לפחות 8 ימים.\nמי שהתחום מעניין אותו ימצא עניין בקורס אבל כנראה יתאכזב מהמבחן..", "timestamp": 1645605768457}, {"author": "סטודנט ממורמר", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מארק זילברשטיין\nחוות דעת - הרצאות: מארק מקליט הכל אז זה סבבה, וההרצאות זורמות\n\nשם המתרגל/ת: ליאור זנו\nחוות דעת - תרגולים: דיי מסובכים אבל סך הכל עוברים כמו כל קורס אחר\n\nשעורי הבית: רטובים קשים רצח שגורמים לקורס להרגיש 10 נקז במקום 3\n\nהמבחן: קשה מאוד, קורס בחירה עם ציונים של אינפי 1\n\nהשורה התחתונה: לא לקחת במערכת של מעל 16 נקז", "timestamp": 1646400354339}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: מרצה טוב לדעתי, העלה הקלטות שלו למודל משנה שעברה.\n\nשם המתרגל/ת: ליאור זנו \nחוות דעת - תרגולים: מתרגל טוב וותיק, מעביר את הקורס כבר כמה סמסטרים אז הוא מנוסה ויודע את החומר. גם הקלטות של תרגולים משנה שעברה הועלו למודל.\n\nשעורי הבית: 3 רטובים עמוסים מאוד שקשה לעשות לבד, שווים 15% מהציון. בנוסף 5 יבשים ששווים 5% מהציון שהם דיי קלילים.\n\nהמבחן: קשה, ארוך, אין מספיק זמן לפתור את כולו בצורה טובה והסגל יודע את זה. הסמסטר החליטו בפעם הראשונה לעשות אותו עם חומר סגור כדי \"להקל\" עליו (כמובן שלא באמת היה הבדל במבחן עצמו וזה היה מבחן רגיל לחלוטין פשוט עם חומר סגור).\n\nהשורה התחתונה: אומנם יש הרבה חומר משעמם אבל גם לומדים בקורס דברים חשובים כמו תכנות מקבילי למשל, הבעיה שיש *המון* חומר. התרגולים לא מתרגלים את ההרצאות אלא פשוט באים להוסיף עוד חומר. חשוב לדעת את זה כי חלק מהחומר עובר רק בתרגולים וחלק רק בהרצאות. התרגול היחיד שיש בקורס זה הסדנאות (5 פעמים במהלך הסמסטר) והש\"ב היבשים. מעבר לזה קשה לדעת מה הציפיות עד שמתחילים לפתור מבחנים. בקלות הקורס הכי קשה ועמוס שעשיתי בתואר, מבחינת כמות חומר והרמה שלו. אבל כנראה שאם אתם עושים אותו אתם חייבים אז אין לכם ברירה, פשוט כדאי לא לבוא עם ציפיות לציון גבוה.", "timestamp": 1658735408589}, {"author": "אלגוריתם המאפייה", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: איתי \nחוות דעת - הרצאות: מעביר בצורה עניינית וטובה את החומר. חשוב להקשיב בהרצאות שכן יש חומר שמועבר רק שם והיה במבחן.\n\nשם המתרגל/ת: זוהיר\nחוות דעת - תרגולים: מלמד טכניקות שימושיות וממש עוזר לקראת המבחן, מתרגל מומלץ מאוד.\n\nשעורי הבית: עמוס עמוס עמוס 3 רטובים וכמה יבשים.. הרטובים דורשים זמן.\n\nהמבחן: חשוב לדעת את החומר ממש טוב - עדיף לקחת מבנה מחשבים לפני שיעזור בהבנת שאלות Paging וזיכרון..\n\nהשורה התחתונה: קורס חשוב, מלמד המון על הקישור בין החומרה לתוכנה ועוזר גם בתעשייה עצמה.", "timestamp": 1666464159459}, {"author": "הי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מסביר מהר מדי, מצגות הכי לא אינפורמטיביות בטכניון.\nממליץ לסכם אותו במהלך ההרצאה אחרת אין סיכוי ללמוד מהמצגות לקראת המבחן\n\nשם המתרגל/ת: זוהיר\nחוות דעת - תרגולים: מתרגל מעולה!גם בתרגולים יש את אותה בעיה מבחינת החומר הכתוב שהוא לא אינפורמטיבי. בתרגולים לומדים חומר חדש ולא מתרגלים. קחו בחשבון שזה כמו לקחת אינפי רק בלי תרגולים מבחינת כמות חומר ואינטנסיביות.\n\nשעורי הבית: סבירים אבל לא ברי תיקתוק. צריך לשרוף עליהם כמה שעות טובות. ( ימים ) גם הקבצים שמביאים הם לא מעודכנים למאה הנוכחית אז לוקח מלא זמן להתניע אבל מהרגע שמבינים מה רוצים שנממש זה נהיה סבבה.\n\nהמבחן: ההיסטוגרמה מדברת בעד עצמה, ושוב זה כי אין ממה ללמוד . גם הסמסטר היה מבחן עם חומר סגור ובכל זאת שאלו על דברים שלא סביר לבקש שנזכור בעל פה.\n\nהשורה התחתונה: קורס מעניין מאוד שמנוהל באופן לא טוב. לא שווה את הכמות נק\"ז (לדעתי צריך להוסיף לו עוד נק\"ז ולתת להרצאה עוד שעה שבועית ולעשות תרגולים נורמלים , רק שלא שואלים אותי)\nבקיצור קחו את של מדמ\"ח", "timestamp": 1676450036242}, {"author": "king", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שי ברגמן\nחוות דעת - הרצאות: ההרצאות של שי בסדר, קצת קשה להבין חלק מהנושאים לעומק ולכן ראיתי בחלק מההרצאות גם את המוקלטות של מארק. בהרצאות לומדים על רעיונות כלליים ובתרגולים לומדים את המימוש הספציפי בלינוקס, ובסוף במבחן שואלים על הכל. אז ממש כל מילה שנאמרת חשובה. מומלץ לסכם כי המצגות לא מאוד ברורות.\n\nשם המתרגל/ת: ליאור זנו\nחוות דעת - תרגולים: מחזיק את הקורס. הוא אחראי לתרגילי הבית היבשים והרטובים, יודע את החומר יותר טוב מכל שאר הסגל, ועושה רושם שהיחיד שאכפת לו מהקורס ומהסטודנטים. מומלץ ללכת אליו לתרגולים וגם לשעות קבלה.\n\nשעורי הבית: 5 יבשים קצרים, שאלות ממבחנים. בערך שעתיים שלוש כל אחד. 3 רטובים מאוד ארוכים, הם ממוחזרים בגדול אז תלוי כמה נעזרים ברפרנס אבל אם לא אז יכולים לקחת כמה ימים טובים. אבל הם מלמדים ממש טוב את החומר וחשובים לקראת השאלה של הקוד במבחן.\n\nהמבחן: מבחן של מארק. מלמדים ברמה אחת, שואלים ברמה אחרת. המבחן בחומר סגור קצת יותר שפוי אבל עדיין קשה מאוד. הממוצע שרואים במבחנים כאן הוא אחרי פקטור, אצלנו היה 15 נק.\n\nהשורה התחתונה: קורס עמוס וכמו שאר הקורסים של מארק לא ברור מאיפה מצפים שתבין את החומר ברמה ששואלים עליה כי זה לא כתוב במצגות. אבל חוץ מזה, הוא מעניין וחשוב ממש.", "timestamp": 1678642220418}, {"author": "לא כיף", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי ברגמן\nחוות דעת - הרצאות: מדבר נורא מהר אבל מעניין, קשה להבין מה רלוונטי, ומניח שיודעים הרבה דברים מראש כאילו אני מתכנתת מגיל 3\n\nשם המתרגל/ת: ליאור \nחוות דעת - תרגולים: חד מאוד על החומר אבל לא יספר לך אם לא תשאל\n\nשעורי הבית: \n3 רטובים עמוסים ודורשים הרבה זמן, 5 יבשים קלילים\n \nהמבחן: \nיש סיבה לפקטורים \nהשורה התחתונה: לעשות רק אם חייב", "timestamp": 1678790934921}, {"author": "zubi", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: איתי אייל\nחוות דעת - הרצאות: \nהחומר מעניין אבל עם איך שמעבירים אות ובהרצאות וכל הפרטים השוליים שמזכירים לא הגיונית וכתוצאה החומר לא שוקע טוב.\nשם המתרגל/ת: ---\nחוות דעת - תרגולים: \nאין הקלטות לתרגולים, קחו את זה בחשבון אם אתם שוקלים לקחת את הקורס\nשעורי הבית: \nמזעזעים, וזה בא ממישהו שאוהב לתכנת. במקום ללמד את הקונספטים המסובכים, מסבירים קצת על החתימה של הפונקציה ובתרגול ואומרים לכם בהצלחה. השיעורי בית לא הגיוניים לקורס של 3 נקז, ובשביל 15 תקף אחרי עובר.\nהמבחן: \nאיום ונורא, מלא בשטויות בלי תשובות חד משמעיות.\nהשורה התחתונה: \nאם לא חייב לקחת לשמור מרחק. קורס מזעזע.", "timestamp": 1687815796861}, {"author": "sc", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יואב כהן\nחוות דעת - תרגולים: הכי גבר בעולם,אין עליך\n\nשעורי הבית: \n\nהמבחן: \nנקווה שיהיה בסדר,אין ספק שכמות החומר לא נורמלית\nהשורה התחתונה:", "timestamp": 1688498252969}, {"author": "1", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אייל איתי\nחוות דעת - הרצאות: אחלה גבר, הרצאות די בנאליות אבל סה\"כ מאוד נחמד אם משתתפים.\n\nשם המתרגל/ת:  זוהייר\nחוות דעת - תרגולים: אחלה גבר, מעביר את החומר בצורה לא רעה בכלל, מסביר אותו ומאוד נחמד, בנוסף מאוד מומלץ על שי ברגמן (הקלטות) הוא מסביר גם בצורה ממש טובה ומסביר גם את העקרונות ואת ההבנה של הדברים.\n\nשעורי הבית: היו גם תרגילים רטובים וגם יבשים, היבשים לא ממש עוזרים להוריד אסימונים או להבין את החומר וגם הרטובים, אבל מי שאוהב את התחום יהנה מאוד לעשות את הרטובים.\n\nהמבחן: אי אפשר לדעת מה יצא לכם, חבל שלא בוחנים ממש על החומר של הקורס, אבל סה\"כ עם השקעה אפשר להצליח בו.\n\nהשורה התחתונה: מעניין אבל מבחן לא טוב.", "timestamp": 1703789385559}, {"author": "טראומתי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה:מרק \nחוות דעת - הרצאות: הזוי שאנשים כאן אומרים שהוא סביר (או טוב) באיזשהי צורה.\nכנראה שפשוט מניחים שמה שהוא אומר בהרצאות קדוש, מה שלא פרסמו פה זה שהוא אחר כך שולף דברים מהשרוול כאילו היינו איתו כשהוא למד תכנות.\nמרצה כאילו לא בא לו שסטודנטים יבינו בכלל.\nאם הבנתי נכון הוא גם אחראי על המבחנים אז לא פלא שכל סמסטר סטודנטים יורקים דם בשביל 40.\nתסמונת ״המרצה יודע הכל, הסטודנטים מטומטמים ואני גם לא אטרח להסביר להם למה הם מטומטמים״. \nנפלא.\n\nשם המתרגל/ת: יואב\nחוות דעת - תרגולים: מלך\n\nשעורי הבית: עמוסים בצורה מגוחכת\n\nהמבחן: עוד לא\n\nהשורה התחתונה: לאנשים שלא עושים את השרשרת - לא.\nלאנשים שעושים את השרשרת - אל תעשו את השרשרת כדי שלא תצטרכו לעשות את הקורס הזה.", "timestamp": 1710743812715}, {"author": "עייפתי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרק\nחוות דעת - הרצאות: אישית, מאוד אהבתי את מרק, אני יכול להבין מאיפה מגיע הרושם של הדעה לפני, מרק אוהב לשאול שאלות שכנראה שבדר''כ לא תדעו לענות, אבל זו הדרך שלו לנסות להעביר ולשתף אותכם בחומר. הוא מסביר את החומר בצורה טובה, באמת אכפת לו מהסטודנטים והוא מאוד נגיש ונחמד. אוהב אותך מרק\n\nשם המתרגל/ת: יואב\nחוות דעת - תרגולים: מי שמכיר מכיר. אוהב אותך יואב\n\nשעורי הבית: אחלק את זה ל3.\nבודק תרגילי בית - ליאור זנו: למרות שתרגילי הבית היבשים הם רק מגן ואחוז קטן כל אחד, הבנאדם מחפש אותכם על עוד שנייה שגיאות כתיב, מגזים ולא מובן מה המטרה שלו, גם אם כל התשובה נכונה והקונקסט של התשובה נכון, ניסוח לא מתאים של פיפס מסכן יגרור לכם -10 בתרגיל. במיילים מרגיש מתנשא ובאופן כללי ווייב מאוד מוזר סביבו מבלי לפגוש אותו אף פעם, תתאפס על עצמך בנאדם.\nהתרגילי בית רטובים: לדעתי התרגילים הרטובים עצמם לא קשים מדי, הקושי העיקרי שנתקענו בו הייתה ההבנה של מה מצופה מבחינת איכות התוכנה (שזה הרגיש קריטי בתרגיל עם המנעולים).\nהיבשים היו קלילים וזורמים.\n\nהמבחן: כאן פחות אהבתי את מרק, מרק ניסה להרגיע רוחות ולהוריד מהמבחן כאילו זה יהיה הליכה בפארק. אם הכוונה בפארק הייתה לספארי באפריקה עם אריות, אז הוא צדק. המבחן הכיל חומר בכמה מקומות שלא נגענו בו בכלל ואם כן, אולי בדיעבד בכמה מקומות במהלך הקורס. לדעתי החלק התאורתי לא בדק טוב את ההבנה של הסטודנטים בקורס כמו שהיה אמור לעשות. החלק של הקוד בכלל הרגיש הזוי לגמרי, כאילו נתלש ממבחן של קורס אחר, סופר אבסטראקטי וכמו כמעט כל המבחן, לא מנוסח טוב בכלל.\nלקח לי לפחות 6 פעמים לקרוא את השאלת קוד והסבר נוסף מהמתרגל רק כדי להבין מה בכלל הכיוון בשאלה, ומה המטרה של כל מרכיב בה.\nכרגע אין ציונים, אז לא יכול לפרט על זה.\n\nהשורה התחתונה: קשה לשפוט מהסמסטר הזה, מבחינת חומר הרגיש פספוס, וכל הסיפור סביב המבחן עם המבחן עצמו היה מאוד מאוד מוזר. אבל מבחינת סגל זה סגל מעולה, מרק ויואב היו מעולים, שמעתי דברים טובים גם על המתרגל הראשי זוהיר והסנדאות של עדן. אם מדובר בסגל, הזה אני ממליץ.", "timestamp": 1715170716326}, {"author": "מיאו", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מארק זילברשטיין\nחוות דעת - הרצאות: \nמארק מרצה מצוין. הוא אוהב מאוד את החומר ומנגיש את המידע בצורה לא רעה יחסית לקורסי התוכנה. הוא הגון מאוד ומנסה לעזור לסטודנטים (לפחות בסמסטר שלנו - עם הקלות המילואים  במלחמה וכו').\n\nשם המתרגל/ת: זוהיר ג'חשאן\nחוות דעת - תרגולים: אני ראיתי את ההקלטות של זוהיר. ממה שהתרשמתי הוא מתרגל מצוין. אני ממליץ בחום - הוא מסביר את החומר בצורה מעולה בגובה העיניים, ונותן מקום לסטודנטים לשאול שאלות ולהרגיש בנוח.\n\nשעורי הבית: 5 יבשים יחסית קצרים, מרופרנסים\nרטובים מאוד עמוסים (אצלנו היו שניים)\n\nהמבחן: קשה. החומר הוא אינסופי וקשה לדעת / לחזות על מה יישאלו במבחן, בפרט שיש המון סעיפים נישתיים ששווים 2 נקודות לסעיף.\n\nהשורה התחתונה: קורס קשה ועמוס אבל מעניין תכנותית.", "timestamp": 1717362406212}]}