{"posts": [{"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: לא ראיתי כמעט בכלל, רוב החומר החשוב מועבר בתרגולים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טובים, מסבירים את החומר טוב \n\nשעורי הבית: ארוכים, לוקחים הרבה זמן, אבל עוזרים בהבנת החומר\n\nהמבחן: קשה, כדאי להתחיל לפתור תרגילים מראש, יש סגנון מאוד קבוע של שאלות ,צריך לתרגל\n\nהשורה התחתונה: קורס סבבה אבל צורך הרבה זמן", "timestamp": 1603550518973}, {"author": "Hila Manor", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: מעניינות מאוד. פרדי יודע את הדברים לעומקם וגם מה שרלוונטי היום בעולם האמיתי, ואין לו בעיה גם לרדת לעומק הדברים אם שואלים. בלי קשר הוא לא מהמרצים המרדימים, וכיף להקשיב לו.\n\nשם המתרגל/ת: חגי קריטי\nחוות דעת - תרגולים: גבר על. ממש מנסה לעזור להבין כל פרט ופרט, ולתת טיפים טובים כאלה.\n\nשעורי הבית: היו 4 רטובים לא עמוסים, כל אחד זה לממש חלק אחר במעבד ממה שלומדים באותו רגע, אז זה ממש עוזר להבין איך דברים משתלבים. לשים לב למקרי קצה.\n\nהמבחן: היה קשוח. פרדי עושה מבחנים יותר קשים מהשנים שהיו, בסוף אבל הכל מתנרמל בדיוק לממוצע 75. הם הרבה יותר הבנתיים ולהבין את הפרטים הקטנים של כל גישה, והממוצע ירד אצלו מהשנים הקודמות בהתאם. \n\nהשורה התחתונה: קורס מעניין, גם למי שלא ירצה לעסוק במעבדי המחשבים (כי גם לומדים איך זה עובד וזה טוב להבנה כללית לתכנות נכון), אבל קצת התאכזבתי מהציון", "timestamp": 1603620122782}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: \nהוא מאוד משקיע בהסברים אבל יש שם הרבה חומר שלא רלוונטי. חיסרון גדול הוא במצגות- מאוד לא מפורטות ותכלס אין מימה ללמוד למבחן. גם קשה לסכם אותו, ומי שלא מרוכז או שמתקשה ללמוד במסגרת כזו \"נדפק\".\n\nשם המתרגל/ת: בן פרח\nחוות דעת - תרגולים: \nהוא כן משקיע אבל לא תמיד מרוכז. קשה שיש רק שעה אחת של תרגול.\n\nשעורי הבית: \nעמוסים אבל תורמים להבנה.\nבדר\"כ לומדים נושא מסוים והם רוצים שתממש \"סימולציה\" שתדמה את עבודת המעבד. בלי לעשות אותם קשה להבין את החומר.\n\nהמבחן: מאוד קשה ולא מובן. ארוך ומייגע.\n\nהשורה התחתונה: אם לא חובה, אז לא לקחת.", "timestamp": 1611744368892}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: הרצאות מעניינות ומועברות בצורה טובה.\n\nשם המתרגל/ת: בן פרח\nחוות דעת - תרגולים: מתרגל איום, נראה כאילו אין לו כוח לעבודה שלו, לא סיים תרגול אחד בזמן ואין כל קשר בין התרגילים בתרגול לבין התרגילים במבחן (תרגילים ישנים כשהרמה בקורס הייתה שפויה).\n\nשעורי הבית: 4 רטובים, לא נוראיים, כן קצת חופרים, אפס קשר בינם לבין המבחן.\n\nהמבחן: לא נראה רשע כתוב כזה מאז מיין קאמפף.\nמבחן ארוך בצורה לא הגיונית, חלוקה הזויה של ניקוד (סעיף של 5 נקודות יכול לקחת רבע שעה ו-2 דפים) ורמה הזויה שלא קשורה לשום דבר בקורס. כל שאלה מגיעה עם לפחות עמוד של נתונים שצריך לזכור ולהתחשב בכולם. ממבחני עבר נראה שזה ככה בשנים האחרונות, הרמה נהייתה פסיכית ולא ברור למה, עד 2017 הייתה רמה סבירה שאשכרה תאמה את מה שנלמד בתרגולים. \n\nהשורה התחתונה: קורס שהוא חתול בשק, מאוד מעניין ונחמד במהלך הסמסטר, עד שמגיעים למבחן ומופתעים לטובה כמו רמת הגולן ביום כיפור. עם כמה שפרדי מרצה טוב, ממליץ להתרחק כמו מאש כל עוד הוא שם ובן מתרגל.", "timestamp": 1612884881001}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "קורס מעניין מאד והמרצה פרדי ממש תותח.\nאבל! אין פתרונות רשמיים למבחן, והמשוב על הבחינות הסרוקות ממש גרוע (הם מקבלים תשובות לא נכונות ולא מסבירים מה הטעות כשמורידים).\nכתוצאה מכך קשה מאד ללמוד למבחן והציונים בהתאם..", "timestamp": 1613123947192}, {"author": "Amdahl", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: פרדי מרצה בסדר. המצגות לא מדהימות, מאוד קשה ללמוד מהן, ועיקר החומר זה מה שפרדי אומר בעל פה. המזל היה שזה היה סמסטר קורונה והכל היה מוקלט, מה שעזר לפני המבחן.\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: זוועה. הרבה פעמים היה נראה מאוד מבולבל, כאילו הוא לא עבר על התרגול לפני.\n\nשעורי הבית: 4 רטובים, לא מאוד עמוסים. לי עזרו להבנה של החומר עצמו.\n\nהמבחן: לא פשוט, דורש מקסימום ריכוז ויש הרבה היטפלות לפרטים שדובר עליהם בקטנה. יש הרבה סעיפים ככה שכל אחד שווה מעט נקודות, אבל יש המון נתונים שמשתנים בין סעיף לסעיף, אז המבחן מאוד עמוס.\nבסמסטר הזה היה עיכוב של שעתיים וחצי עד לתחילת המבחן, מה שלא עזר לריכוז בכלל.\n\nהשורה התחתונה: אם זה לא קורס חובה, לא ממש מומלץ.", "timestamp": 1613407949767}, {"author": "פרדי נייס טו מיט", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: מעניינות מאוד, מהוות רקע בסיסי לתחום הארכיטקטורה. לדעתי זה קורס חובה לכל מהנדס חשמל, ובכללי כדאי לקחת אותו בשלב כמה שיותר מוקדם כדי לפתוח את הראש לקורסי המשך בתחומים יותר ממוקדים.\n\nשם המתרגל/ת: לינה מדלג'\nחוות דעת - תרגולים: מסבירה את החומר מצוין. קצת רצה עליו כדי להספיק הכל.\n\nשעורי הבית: נחמדים, אם יודעים לתכנת ברמה סבירה זה לא אמור לקחת יותר מיומיים-שלושה, אבל זה לא עוזר למבחן.\n\nהמבחן: הלמידה למבחן מזוויעה ומייאשת. במבחן עצמו מחרטטים כי הוא ארוך ואין זמן. בבדיקה כותבים לך מלא איקסים והערות, לפעמים מורידים לך נקודות ולפעמים לא, בלי איזשהו היגיון. בסוף איכשהו מקבלים ציון סביר.\n\nהשורה התחתונה: לא קורס שלוקחים בשביל להעלות את הממוצע אבל בהחלט קורס חשוב ובסיסי להבנה.", "timestamp": 1613411723057}, {"author": "אלון נמירובסקי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: כנראה שונה משאר הדעות אבל לדעתי הוא מרצה די גרוע. הוא הופך את ההרצאה לשואו אחד גדול במקום להרצאה אינפורמטיבית ועניינית. קשה מאוד לשאול אותו שאלות בלי לקבל תשובה מזלזלת. במהלך ההרצאות הוא מנפנף נושאים ופתאום רואים אותם במבחן. אם הוא מתחמק מנושא מסוים תחשדו.\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: לא בשבילו\n\nשעורי הבית: רטובים חמודים שחשובים להבנת החומר\n\nהמבחן: מבחן לא רלוונטי, מנוסח לא ברור ועמוס ביותר על מנת לפגוע בציונים של הסטודנטים. המרצה לא מעוניין להביא פקטור גם אחרי שהייתה התעכבות של שעתיים בבחינה והממוצע היה נמוך אפילו מהממוצע הנמוך הרגיל.\n\nהשורה התחתונה: קורס מאוד מעניין וחשוב שכל מהנדס חשמל צריך להכיר, לצערי הופכים אותו לבלתי נסבל ברמת המבחן וברמה שחייב ללמוד אותו לבד. אני יוצא ממנו עם רגשות מעורבים.", "timestamp": 1614181874568}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: הרצאות טובות\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: לא התחברתי\n\nשעורי הבית: חשוב לעשות אותם לבד\n\nהמבחן: קשה ולא מובן\n\nהשורה התחתונה: קורס חשוב", "timestamp": 1614183135458}, {"author": "GO", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: מצויינות ומעניינות\n\nשם המתרגל/ת: לינה\nחוות דעת - תרגולים: מצויינת\n\nשעורי הבית: דורשים השקעה אבל לא כל כך עמוסים\n\nהמבחן: גהינום , יש המון פרטים שצריך לזכור או לחשב ואין פתרון רשמי לכן הלמידה מהסריקות, מועד ב ממוצע 48 במבחן וניתן 12 נקודות פקטור .\n\nהשורה התחתונה: קורס מעניין מאוד אבל קשה .", "timestamp": 1615536280633}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: \n\nהמרצה הזה והסגל (במיוחד בן - סותר את עצמו בכל תרגול אפשרי - מי שרוצה רפרנס ניתן להפנות לפנופטו) הם על הפנים (וזה נאמר בעדינות). הם ישחקו אותה מאוד חמודים ונחמדים כל הסמסטר ואז יגיע המבחן ותגלו שאין פתרונות וגם אין הסברים והתשובות שהם נותנים בפורום רק יגרמו לכם לשנוא אותם יותר!\nבקיצור סגל אטום - שלא יבוא לקראתכם בכלום (רק יגידו שהם כן באים לקראתכם).\nחבל כי החומר מעניין - אבל הצורה שבה הקורס מועבר היא ביזיונית!\n\nשם המתרגל/ת: בן פרח\nחוות דעת - תרגולים: \n\nמתרגל שיבלבל אתכם יותר מאשר יתרום לכם. תתרחקו ממנו כמו מאש! הוא סותר את עצמו מספר פעמים בתרגול…\n\nשעורי הבית: אין קשר בין השיעורי בית למבחן.\n\nהמבחן: לא פרופורציונלי! לא הוגן! ולא בודק את הידע! המבחן נועד לבדוק פינות שפרדי בכוונה לא מסביר!\n\nהשורה התחתונה: לא לקחת את הקורס אם יש לכם ברירה!", "timestamp": 1617402601275}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: בניגוד לדעה הרווחת אני דווקא לא חשבתי שהוא היה כזה מעניין, בהחלט לא מהמרצים הגרועים שהיו לי בתואר אבל גם לא עפתי.\n\nשם המתרגל/ת: לינה\nחוות דעת - תרגולים: התחילה טוב וכשדברים התחילו להסתבך - גם היא. קצת מפוזרת ולא מסבירה 100% לדעתי. עדיין היא עדיפה על בן.\n\nשעורי הבית: 4 רטובים שהם 30% תקף, עומס סביר (משהו כמו יומיים-שלושה לתרגיל), במיוחד אם אין לכם עוד קורס עם רטובים כבדים בסמסטר. סה\"כ עוזרים להבנה של איך הדברים עובדים (כי צריך לממש אותם) אבל אין קשר למבחן.\n\nהמבחן: פשוט גיהינום. מרגיש כאילו כתבו אותו ככה שהוא נועד להתעלל בסטודנטים ולא ברור למה לא פשוט לרשום מבחן שאשכרה מותאם לרמה של התרגולים וההרצאות. בחיים לא סבלתי ככה במבחן.\n\nהשורה התחתונה: האמת התאכזבתי, יכול להיות שעם התנהלות נורמלית יותר הייתי יוצאת בתחושה אחרת...", "timestamp": 1626462809379}, {"author": "טירוף!", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: \nינפנף הרבה בידיים, יגרום לכם לחשוב שאתם מבינים מה הולך אבל ימנע מלהיכנס לעומק של הדברים. במבחן תגלו שלא ממש למדתם כלום במהלך הסמסטר (או שמה שכן למדתם הוא ברמה מאוד נמוכה).\n\nשם המתרגל/ת: לינה\nחוות דעת - תרגולים: \nמנסה להיות טובה (לפעמים מצליחה יותר ולפעמים פחות), עדיפה על בן פרח שלא מנסה.\n\nשעורי הבית: \nרטובים לא מסובכים מדי, לא תורמים להבנה של החומר יותר מדי לדעתי. \n(מוזר שאין יבשים שלפחות היו נותנים איזשהי העמקה תאורטית, אבל כנראה שלבדוק תרגילים יבשים זו בקשה מוגזמת מדי מסגל הקורס הזה)\n\nהמבחן: \nהממוצע אצלנו במועד א לפני פקטור היה 49, תעשו אתם את החשבון.\nבאופן כללי המבחן מנוסח ככה שאי אפשר יהיה להבין מה מבקשים בשאלה, מחרטטים משהו בתשובות ומקבלים באופן אקראי ציון סביר.\n\nהשורה התחתונה: \nלא חובה -> לא לוקחים\nכן חובה -> כן בוכים\n\nבהצלחה,", "timestamp": 1627496488094}, {"author": "שלומי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: \nמרצה באמת מרתק ומעניין, מעביר את החומר בצורה די ברורה ומעניינת, למרות שהחומר די מורכב.\nשם המתרגל/ת: בן פרח\nחוות דעת - תרגולים: מתרגל לא ברור כל כך, סותר את עצמו די הרבה ודי משעמם\n\nשעורי הבית: סבירים ומעניינים, עוזרים להבין את החומר\n\nהמבחן: נוראי. פשוט נוראי. במהלך הסמסטר פרדי נותן תחושה שאכפת לו שהסטודנטים יצליחו אבל כשמגיע המבחן, רואים כמה ההפך הוא הנכון.\n\nהשורה התחתונה:", "timestamp": 1635093556237}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: משעמם בצורה לא סבירה, נרדמתי כמה פעמים\n\nשם המתרגל/ת: לא רלוונטי, כולם ממש גרועים\nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית עוזרים להבין את החומר אבל בנויים בצורה מחרידה, בתור סטודנט שלוקח גם קורסים של מדמח, כדאי מאוד שהפקולטה לחשמל תנסה להשתפר וללמוד באיך בונים תרגילי בית.\n\nהמבחן: \n אי אפשר ללמוד למבחן הזה, החומר בכללי לא מובן, פתרונות של שנים שעברו ללא הסברים, לא מובן על מה הורידו ציון ולמה בדברים מסויימים נתנו את מלוא הניקוד\n\nהשורה התחתונה: \n\nכמו שנאמר בסמסטרים שעברו, הקורס הכי גרוע בטכניון כנראה. לא לקחת אלא אם חייבים, אם חייבים לנסות אולי להתכנן למזכירות שיכירו בקורס של מדמח", "timestamp": 1644850787807}, {"author": "מל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פרדי גבא\nחוות דעת - הרצאות: מבחינת החומר עצמו - לדעתי יחסית מעניין ובפועל לא מועבר הרבה חומר (הרבה מידע מסביב שלא באמת רלוונטי למבחן בסופו של דבר).\n\nשם המתרגל/ת: בן פרח\nחוות דעת - תרגולים: עמוסים יחסית, לא תמיד מספיקים לסיים אותם והם די קשים. לא עוברים כמעט בכלל על החומר התיאורטי אלא פותרים תרגילים.\n\nשעורי הבית: 4 רטובים ש-2 מתוכם יחסית כבדים.\n\nהמבחן: הכי נורא שעשיתי. בלתי אפשרי ללמוד אליו כי אין פתרונות, השאלות לפעמים לא קשורות לשום דבר שלמדנו. במהלך הסמסטר יש רק קצת תרגול בתרגולים וזהו (השיעורי בית לא מכינים בכלל למבחן). צריך להגיע למבחן ופשוט להתפלל לגרוף מספיק נקודות כדי שהפקטור בסוף יציל אותך.\n\nהשורה התחתונה: החומר עצמו מעניין, הקורס עצמו מזעזע.", "timestamp": 1646119557443}, {"author": "Roy Mahlab", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פרדי גבאי \nחוות דעת - הרצאות: לדעתי פרדי היה מרצה ממש טוב, הוא מאוד מתלהב מהחומר וזה גורם גם למי שרואה אותו להתלהב.\n\nשם המתרגל/ת: רוברט חנחן\nחוות דעת - תרגולים: רוברט היה ממש טוב לדעתי והוא התעכב עם אנשים אחרי השיעור שלא הבינו מה שצריך עד שהם הבינו\n\nשעורי הבית: נחמדים, לא קשים, מעמיקים הבנה של החומר\n\nהמבחן: מבחן היה קשה ולא כיף.\n\nהשורה התחתונה: זה קורס מעניין אבל המבחן מוריד את רמת ההמלצה שלי", "timestamp": 1647364914848}, {"author": "Tamir Shriki", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: מרצה מעולה\n\nשעורי הבית: \n4 רטובים קלילים יחסית (יום - יומיים עבודה לאחד)\n\nהמבחן: \nלמידה מפרכת. אין פתרונות רשמיים לכל המבחנים, צריך לחלץ סריקות ולשאול הרבה בפורום ואנשים אחרים. המבחן עמוס מאוד וצריך לשלוט בהכל ממש טוב כדי להספיק ולהצליח\nהשורה התחתונה: \nמומלץ למרות הכל. קורס מאוד חשוב", "timestamp": 1647505516642}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פרדי גבאי\nחוות דעת - הרצאות: המרצה מעביר את החומר בצורה טובה ונותן מענה לשאלות הסטודנטים. סה\"כ החומר אינו מסובך וארוך\n\nשם המתרגל/ת: רוברט חנחן\nחוות דעת - תרגולים: מתרגל יחסית חדש, פתוח להערות בנושא העברת התרגולים. העביר את התרגולים יחסית ברור/ מלבד כמה שאלות של סטודנטים עליהן השיב בתרגולים הבאים\n\nשעורי הבית: תרגילי מחשב שבהם בונים סימולציה לפי הכללים הנלמדים בקורס. החשיבה הנדרשת הינה כיצד מיישמים זאת בקוד. הקוד אינו מסובך, שבוע עבודה בהחלט מספיק עבור כל תרגיל (אפשר גם בפחות). התרגילים הללו פחות מלמדים למבחן לדעתי.\n\nהמבחן: עמוס מאוד בזמן ללא מספיק מבחני עבר לתרגול (תבקשו מהמרצה שלפחות למבחנים מהשנים הקודמות יפורסמו פתרונות רשמיים תוך כדי הסמסטר, ולא לפני המבחן!). חשוב להיות עם היד על הדופק בפתרון המבחן ולדעת לדלג על סעיפי מוקש כמו למשל סעיפים אחרונים בשאלות btb או סעיפים עם חישובים לא פרופורציונליים לזמן. כל שאלה מוקדשת לנושא אחר תבחרו את השאלות שאתם טובים בהם יותר. בנוסף, כמעט בכל מבחן הסגל לא מקדיש יותר מדי זמן לניסוח שאלות בצורה ברורה ופתירה, במצב כזה במקום לשרוף זמן תכתבו הנחות שאתם משתמשים בהם לפתירת התרגיל ותמשיכו, הסגל לא מתחשב בבעיות של חוסר זמן עקב ניסוחים גרועים שלהם (שלעיתים סותרים אחד את השני)\n\nהשורה התחתונה: חומר מעניין, יחסית בסיסי ותיאורטי. המבחן לא פשוט ולעיתים לא הוגן", "timestamp": 1648375288342}, {"author": "none", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: \nראיתי הקלטות של פרדי שכיסו כמעט את כל החומר. הרצאות מעניינות והוא מסביר את החומר היטב.\nשם המתרגל/ת: בן \nחוות דעת - תרגולים:\nמתרגל סביר. באופן כללי התרגולים לא כל כך ממצים את החומר פותרים בערך שאלה אחת לתרגול ויש חזרה קצרה על חומר.\nשעורי הבית: \nיש 4 רטובים, הראשון והשני יותר ארוכים שלישי ורביעי די קצרים. ידע בCPP מומלץ, תרגילים לא מאוד קשים.\nהמבחן: \nמבחן די קשה ויש מחסור מאוד גדול בזמן. אין סריקות והסגל לא ממש זמין לשאלות ככה שהלמידה למבחן די נוראית.\nהשורה התחתונה: \nקורס די מעניין אבל ממוצע לא מאוד גבוה.", "timestamp": 1657562957040}, {"author": "TLB", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יואב/פרדי\nחוות דעת - הרצאות: ראיתי את פרדי מוקלט. מרצה טוב.\n\nשם המתרגל/ת: בן/רוברט\nחוות דעת - תרגולים: לפעמים הלכתי לבן ולפעמים הלכתי לרוברט. רוברט מתרגל חדש ולא ממש אהבתי אותו. יותר התחברתי לבן מבחינת הסברים.\n\nשעורי הבית:  4 שיעורי בית רטובים, לא יותר מדי ארוכים אבל גם לא הכי קשים. לדעתי מלמדים את החומר וזה היה בונוס נחמד.\n\nהמבחן: כרגיל לא כיף, שאלה 4 הידועה לשמצה הייתה פשוט הזיה. באופן כללי לא לכל המבחנים יש פתרונות רשמיים ככה שמאוד מאוד מאוד קשה ללמוד למבחן וצריך לשאול שאלות בפורום ולקוות שיענו לך. \n\nהשורה התחתונה: כרגע נראה שפרדי הפסיק להעביר את הקורס אז כביכול המבחנים אמורים להיות יותר סבבה, אבל עובדה שגם הסמסטר היה לא כיפי. בכל מקרה אני נהנתי מהקורס מהמבחן לא כלכך..", "timestamp": 1658003492478}, {"author": "TLB2", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פרדי מוקלט\nחוות דעת - הרצאות: מרצה בחסד.\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים(במיוחד תרגיל 2) וקשים.\n\nהמבחן: ארוך מאוד,למי שאין הארכת זמן מאוד קשה לסיים אותו.\n\nהשורה התחתונה: החומר ממש ממש מעניין.לקחת למרות הכל.", "timestamp": 1658057966474}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב עציון\nחוות דעת - הרצאות: ההרצאות היו בסך הכל מעניינות וטובות. בגלל שמעט אנשים יחסית הגיעו פרונטלית להרצאה הוא טס על החומר וביטל הרצאה אחת במהלך הסמסטר בלי שהיה צורך בהשלמה. בנוסף הוא קצת שינה את הקורס והחליף את שתי ההרצאות האחרונות בנושא GPU בשני נושאים חדשים: חולשות אבטחה Spectre+Meltdown וזיכרון SRAM ו- DRAM. שלושת הנושאים כולל GPU לא הופיעו במועד א' בכלל. ההקלטות של ההרצאות היו לא ניתנות לצפייה בגלל איכות ירודה, אז אם לא הגעתם פרונטלית הקלטות של פרדי הייתה האופציה הסבירה היחידה. בכל מקרה הבנתי שבסמסטר הבא מגיע מרצה שלישי חדש.\n\nשם המתרגל/ת: רוברט\nחוות דעת - תרגולים: מתרגל טוב, התרגולים די סטנדרטיים ומכינים לא רע לקבלת 70-80 במבחן אם שולטים בהם. אם משהו לא מובן הוא לא ימסמס אתכם ויעזור לכם להבין אותו.\n\nשעורי הבית: 4 תרגילים רטובים ברמות קושי שונות. מסמלצים את פעולת המעבד בעזרת שפת C או CPP. לרוב מקבלים ממשק מוכן מצוות הקורס ורק צריך להשלים בו כמה פונקציות ספציפיות, לא צריך להתעסק עם Makefile יותר מדי וזו לא המטרה. מבחינת זמן, כל תרגיל לוקח בערך יום-יומיים עבודה.\n\nהמבחן: החלק הרע של הקורס. קודם כל ההכנה אליו נוראית. אין פתרונות רשמיים כמעט לאף מבחן במודל, וצריך לחלץ סריקות ממבחני עבר. בנוסף, הצוות לא מגיב מספיק מהר ובתדירות מספקת לשאלות במודל, וביום שלפני מועד א' בכלל לא הגיבו יותר לשאלות בפורום למרות שיום לפני זה מן הסתם שיא הלמידה אצל כולם. יש גם שאלות בפורום שהצוות פשוט דילג עליהן ולא ענה. חלקן באמת לא עומדות בפורמט של שאילת השאלות, אבל אצל חלקן זה דווקא נראה שהן כן עומדות ולא ברור למה לא ענו עליהן כי לא נותנים שום הסבר.\nלגבי המבחן: כמו שאמרתי, יש את ה- 70-80 נקודות שאם שולטים בתרגולים אז אפשר לקבל אותן, אבל משם והלאה עוברים לשאלות הבנה והתחכמויות שאין דרך אמיתית לדעת מראש אם תצליחו אותן או לא. הקורס מאוד הנדסי ולכן אפשר לטעון שאם היו עושים מבחן שכולו רק שאלות שחוזרות על עצמן עם נתונים טיפה שונים לא ישרת את הפן ההנדסי הזה, אבל בכל מקרה תהיו מוכנים למבחן שדורש אקסטרה, לא רק ללמוד לפתור כמו תוכי את השאלות הסטנדרטיות, אלא גם להדגים הבנה ולחשוב קצת מחוץ לקופסה. בנוסף, הוא ממש עמוס מבחינת זמנים וכמעט אף אחד לא מספיק בכלל לנסות לפתור את כל הסעיפים, בלי קשר להאם היו מצליחים או לא. בסמסטר הזה במועד א' היה אפשר לסמן על סעיפים \"לא יודע\" ולקבל 20% מהניקוד שלהם.\n\nהשורה התחתונה: הקורס מעניין מאוד, נותן פתח ראשוני לכל עולם ארכיטקטורת המעבדים ובנוסף הוא קורס הנדסי \"proper\". יש פתרונות שונים לבעיות שונות, עם חסרונות ויתרונות לגישות מסוימות, וצורך לאזן בין הדברים. המבחן קצת מבאס בגלל הקושי, אבל הקורס שווה את זה אם אפשר לספוג ציון קצת נמוך יותר (מה שבכל מקרה מאפיין את שרשרת מחשבים).", "timestamp": 1658218883398}, {"author": "Hussam Awad", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פרדי גבאי (מוקלט)\nחוות דעת - הרצאות: \nההרצאות שלו מובנות, הוא מסביר את החומר בצורה טובה לדעתי, ראיתי אותו מוקלט ובלעדיו לא הייתי מצליח את הקורס, לדעתי הוא מסביר הרבה יותר טוב מהמרצה שמלמד פרונטאלית הסמסטר, יואב עציון.\nשם המתרגל/ת: בן פרח ורוברט\nחוות דעת - תרגולים: \nהייתי בתרגולים של שני המתרגילים פיזית וגם בשעות קבלה שלהם, וגם ראיתי את המוקלט שלהם, לדעתי הם טובים\nשעורי הבית: \nיש 4 רטובים נחמדים במהלך הסמסטר, יש כאלה שאומרים שהרטובים לא חושבים להבנה, לדעתי טיעונים אלו חלשים ומנתוקות מהמציאות, הרטובים נחמדים ובאמת חשובים בקביעת לאיזה benchmarks האריכקטורה הנוכחית יעילה, לדעתי זה חלק חשוב מהקורס.\nהמבחן: \nהמבחן ארוך ולא קל, אבל לדעתי מי שלומד במהלך הסמסטר, ובאמת מבין את ההרצאות והתרגולים, אין בעיה להוציא ציון טוב, המבחן שלנו היה באמת בודק הבנת הנושאים המועברים בהרצאות (למשל נושא security) וגם שליטה בתרגולים, והיה צריך גם לחשוב קצת מחוץ לקופסה, כלומר בסכל הכל המבחן היה הוגן לדעתי (שוב, הוגן לא בהכרח אומר קל)\nהשורה התחתונה: \nהקורס מלמד נושאים חשובים מאוד לפי דעתי, וגם החומר מרתק וצוות הקורס נחמד, הייתי לוקח אותו גם אם הוא לא חובה, בהחלט למדתי דברים שימושיים.", "timestamp": 1664298222390}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרדי (מוקלטות)\nחוות דעת - הרצאות: מרצה תותח על! בחור להערצה! מסביר את החומר בצורה מעולה ומובנת!\n\nשם המתרגל/ת: רוברט חנחן/נמרוד\nחוות דעת - תרגולים: נתחיל מזה שהתרגולים עצמם בנויים בצורת מצגת גרוע נוראית ולא מובנת ככה שאי אפשר להבין את התרגול אם לא ממש נמצאים בתרגול עצמו. \nעל המתרגלים עצמם אין לי הרבה מה להגיד חוץ מזה שאני מקווה שעם הזמן הם ישתפרו... \n\nשעורי הבית:  4 תרגילים רטובים שאני אישית נהניתי ממש מכל אחד מהם, אף על פי שאף אחד מהתרגילים האלו לא יתרום לכם יותר מדי מבחינת מבחן.\n\nהמבחן: וואי וואי וואייי, מבחן ארוך בטירוף, מצב קרב ברמות הכי גבוהות שיש. פשוט לתרגל, להאמין בפתרון שלכם ולהתפלל לטוב.... \nתאכלס, זה קורס הנדסי, אין באמת תשובה אחת נכונה לחלוטין, אז תנסו פשוט להפעיל כמה שיותר את הראש. בגלל זה אגב קשה ללמוד למבחן הזה כי זה לא כמו מבחן רגיל שיש דרך או כמה דרכי פתרון הגיוניות לכל תרגיל.\n\nהשורה התחתונה: אם זה לא חובה לכם - ממש אבל ממש לא מומלץ לקחת אותו, כן מאוד מומלץ לבוא בתור שומע חופשי כי בכנות, זה אחד הקורסים המעניינים ביותר שקיימים ופרדי מעביר אותו בצורה מעולה ומעניינת!", "timestamp": 1678004992338}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלעד הדר\nחוות דעת - הרצאות: אלעד מרצה מעולה אבל המצגות של הקורס כל כך גרועות שזה נורא. החצי הראשון של הקרוס מועבר בצורה דיי טובה. החלק השני של ה- multy- threading  וה- GPU מועבר בצורה נוראית ושום דבר לא מובן.\n\nשם המתרגל/ת: רוברט\nחוות דעת - תרגולים: הוא אחלה אבל הוא מהיר ממש ולפעמים לא מובן\n\nשעורי הבית: שיעורי הבית חביבים ועוזרים להבין את החומר וגם לא קשים מידי. הבעיה היא שיש רק רטובים ואין בכלל יבשים ככה שזה לא ממש עוזר למבחן.\n\nהמבחן: המבחן פשוט הזוי. אפשר ליפול על אחד יחסית בסדר ואפשר ליפול על אחד פשוט לא פתיר. הניסוחים שלהם על הפנים והם גם מכחסים ממש בבדיקה.\n\nהשורה התחתונה: קורס יחסית חביב ולחלקינו גם חובה. מומלץ להשקיע בשיעורי בית כדי לקבל שם ציון גבוה כי זה 30 אחוז מהציון.", "timestamp": 1678870190544}, {"author": "חיים", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלעד הדר\nחוות דעת - הרצאות: מרצה מצוין, עד כדי כך שהגעתי מהמרכז רק בשביל ההרצאה שלו באותו יום, אפילו שיש מוקלטות טובות של פרדי גבאי. \nמרגישים שאלעד מדבר מניסיון (ולא בתיאוריה/פורמלי בכלל) והבנה מעשית ופשוט כיף להקשיב לו.\nבנוסף , אלעד מדבר בגובה העיניים והאכפתיות שלו מאוד הורגשה. עד כדי כך שבהרצאה האחרונה, המזגן לא פעל אז מאוורים פעלו במקום וגרמו להרבה רעש - ככה שירד מבמת המרצה והלך עד לכל אחד כדי לשמוע את השאלה שלו/ה בזמן השאלות. אשכרה התרוצץ בינינו. בחיים לא ראיתי מרצה עושה דבר כזה, לחיוב.\nכמו שאתם מבינים, אישית הוא היה אחד המרצים הטובים שהיו לי בטכניון.\n\nשם המתרגל/ת: זאב אברהם צוקרמן \nחוות דעת - תרגולים: \nאצלנו היה סמסטר ראשון שלו כמתרגל. בחרתי ללכת לתרגולים שלו בהתחלה כי מדירוג הביקורות ב-students היה נראה שהוא הכי טוב (לעומת נלסון או נמרוד, לא היו הרבה אופציות), אבל גיליתי אחלה מתרגל. הוא נורא ברור, פרקטי, בגובה העיניים ורואים שהוא מבין כמו שצריך את הדברים, הצליח להוריד לרמה פרקטית את החומר עבורי. \nממש לפעמים הורגש שזה סמסטר ראשון שלו כמתרגל בקורס הזה, אבל זה לא הפחית מזה שהוא היה טוב, ולדעתי בסמסטרים הבאים הבאים רק יהיה עוד יותר טוב.\nבסמסטרים אחרים עם יותר מתרגלים, ממליץ לנסות אותו ואת רוברט (על רוברט גם נראה שאומרים דברים טובים).\n\nשעורי הבית: \n4 רטובים, מאוד עוזרים וחיוניים להבין את החומר, ועזרו לי להבין דברים שלא הצלחתי להבין עד הסוף בהרצאה או בתרגול.\n\nהמבחן: \nפורמט קבוע של 4 נושאים. מומלץ ללמוד רוחבי! מוריד הרבה אסימונים.\nבינתיים היה מועד א' והיה קשה. ממוצע הכי נמוך מזה שנים (65, למה?). המבחן זו הנקודה המבאסת היחידה בקורס הזה, חבל שזה ככה.\n\nהשורה התחתונה: \nקורס מעניין ומעשי-הנדסי, התחברתי ונהניתי, והאמת גם בזכות החומר וגם בזכות הסגל. הבעיה היחידה היא המבחן, וחבל שזה ככה. אפשרי להוציא ציון טוב במבחן, אבל צריך לתרגל טוב טוב.", "timestamp": 1690745691548}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אלעד / פרדי מוקלט\nחוות דעת - הרצאות: אמרו לי בהתחלה לראות רק את ההקלטות של פרדי, אבל היה לי קשה לשבת מול הקלטה. פרדי מרצה נהדר והחומר ממש מעניין אבל באמצע הסמסטר עברתי לאלעד, ההרצאות של אלעד היו ממש טובות הייתה אווירה טובה וניכר שאלעד נהנה להרצות בקורס. ההרצאות גם של אלעד וגם של פרדי מרתקות. כל מי שמתעניין בחומר ורוצה להבין טוב יותר את המעבד המודרני אחרי מה שמלמדים בספרתיות חייב לקחת את הקורס.\n\nשם המתרגל/ת: זאב אברהם צוקרמן\nחוות דעת - תרגולים: התחלתי אצל נמרוד כי הייתה לי הרצאה אחרת על השעות של המתרגל השני. אבל אחרי התרגול השלישי עברתי לקבוצה השנייה. זאב אחלה מתרגל, הוא מסביר מעולה, דואג שכולם יבינו ומסביר את הפרקטיקה ואת המוטיבציה בנושאים שלומדים בקורס. הוא דאג להעביר בצורה טובה את כל החומר ולעיתים כאשר היו נקודות לא ברורות הוא חזר אל הנושא בתרגול הבא ונתן הסבר יותר אינטואיטיבי. ניכר שהוא שולט בחומר. ממליץ בחום מתרגל מלך שזמין מאוד לסטודנטים שלו!\n\nשעורי הבית: חשובים ממש! בקורס יש תרגילים רטובים בלבד שבהם מממשים סימולציות של הרכיבים שלומדים עליהם בהרצאות, התרגילים עוזרים להבין עד הסוף ולסגור פינות במה שלומדים בהרצאות. מה שאהבתי מאוד זה שאין את הבולשיט של קונבנציות הקוד שרואים בממ\"ת או הפעלה, בקורס הזה תכתוב איך שבא לך כל עוד זה עובד.\n\nהמבחן: קשה ממש! צריך לתרגל המון וגם אז הבחינה היא סוג של הימור. אם לא חייב לעשות את הקורס הייתי ממליץ לעשות אותו כשומע חופשי ולא לגשת למבחן למה זה מוריד ממוצע כמעט בוודאות.\n\nהשורה התחתונה: קורס מרתק, סגל מצויין אבל מבחן לא מומלץ", "timestamp": 1691874165372}, {"author": "המשאית", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלעד\nחוות דעת - הרצאות: \nאחד הנושאים המעניינים בתואר.\nמרצה נחמד ומסביר טוב.\nהעובדה שהוא האחראי כבר כמה שנים ולא העביר תיקון לתרגולים למרות כל הביקורות עליהם מעידה עליו קצת לרעה.\n\nשם המתרגל/ת: נמרוד\nחוות דעת - תרגולים: \nבטח כבר קראתם חוות דעת על נמרוד, אין מה לעשות בנושא.\nזה השילוב שלו + התרגולים בקורס הרבה זמן לא עברו עדכון ופשוט מועברים בצורה הכי מכשילה שאפשר.\nשעורי הבית: רטובים ובכלל לא קשורים למבחן.\n\nהמבחן: הסגל לא הסכים לפרסם פתרונות עד לאחרי תקופת הערעורים.\n\nהשורה התחתונה: קורס חובה", "timestamp": 1694681215751}, {"author": "~~", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרדי מוקלט\nחוות דעת - הרצאות: הכריזמה שלו עוברת גם דרך המסך, מומחה בתחום ומלמד בצורה מושלמת\n\nשם המתרגל/ת: נמרוד אדמוני\nחוות דעת - תרגולים: נמרוד אדם מקסים, הוא פשוט לא יודע ללמד או שיותר גרוע הוא לא יודע את החומר. מתבלבל, מרגיש כאילו לא התכונן לתרגול. \nאומרים שזאב יותר טוב אבל ההקלטות שלו באיכות גרועה אז לא שומעים ומבינים טוב. בקיצור בהצלחה..\n\nשעורי הבית: 4 רטובים, מעניינים ומוסיפים להבנה\n\nהמבחן: ראו היסטוגרמות..\n\nהשורה התחתונה: קורס מעניין, בנוי טוב, פרדי אגדה, מבחן כראוי לפקולטה. בגדול ממליץ", "timestamp": 1695468776878}, {"author": "Avi", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרדי גבאי הקלטות\nחוות דעת - הרצאות: הקלטות מעולות של פרדי גבאי שהיו תואמות לחומר שהועבר בפרונטלי. ממליץ. \n\nשם המתרגל/ת: נמרוד אלוני\nחוות דעת - תרגולים: מתרגל סבבה, קצת מרדים\n\nשעורי הבית: 4 הגשות רטובות, שבעקרון די דומות אחת לשנייה.\nאם יש שליטה ב++C אז אפשר לסגור כל אחת תוך 2-3 ימים, אם לא אז יקח קצת יותר.\n\nהמבחן: ארוך, יחסית הוגן וחוזר על עצמו.\n\nהשורה התחתונה: נותן בסיס טוב מאוד למי שרוצה לעסוק בתחום הצ'יפ דזיין. יש התעסקות בפרקטיקה ופחות תאוריה.", "timestamp": 1703604240830}, {"author": "ספקטר", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלעד\nחוות דעת - הרצאות: \nחשוב לו שהסטודנטים יבינו, עונה לשאלות ומחדד נקודות טריקיות. תמיד נשאר אחרי ההרצאה בשביל שאלות.\nיש גם את ההקלטות של פרדי שהן טובות.\n\nשם המתרגל/ת: נמרוד\nחוות דעת - תרגולים: \nרץ על התרגול כל עוד אף אחד לא עוצר אותו לשאלות.\nאם שואלים יסביר מ-0 את הנושא עד שייפול האסימון וזה מעולה.\n\nהמבחן: \nבגדול זה מבחן רב מלל.\nקשה לבנות שאלות שמגדירות היטב את כל המערכת ומתייחסות לכל מקרי הקצה לכן כל עוד תציינו את ההנחות שלכם ותנמקו טוב למה לדעתם יקרה מה שיקרה תקבלו את רוב הנקודות ואולי אפילו את כולן. (זאת הסיבה שבסריקות אפשר לראות תשובות שונות שמקבלות ניקוד מלא)\n\nהשורה התחתונה:\n4 נפצים", "timestamp": 1715723203099}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מוקלט פרדי גבאי\nחוות דעת - הרצאות: דיי טובות ותואמות למועבר הסמסטר\n\nשם המתרגל/ת: חלק מוקלט לנה חלק בזום רוברט\nחוות דעת - תרגולים: התרגולים לא טובים, הרגיש כאילו הם לקחו את תרגולי העבר והורידו את כל ההסברים והפכו אותם להרבה פחות מובנים, לא הרגישו לי שתרמו שהרבה (של לנה עדיין יש הסברים וכו במצגות אז הם הרגישו לי יותר מועילים אבל אין לה לכל התרגולים)\n\nשעורי הבית: בסדר ברגע שמבינים מה הם רוצים, אבל ניסוח זה לא הצד החזק שלהם, אז כנראה שתצאו מהם מתוסכלים. בתכלס ברגע שמבינים לא אמור לקחת יותר מכמה שעות, אבל אצלנו בכל שיעורי הבית יצא שמימשנו כמה פעמים כי לקח זמן עד שענו בפורום והבהירו דברים.\n\nהמבחן: גם פה הניסוח לא חזק. המבחן שהכי סבלתי ללמוד אליו, אין כמעט בכלל פתרונות רשמיים וגם המועדים שיש בהם הפתרונות הרשמיים מלאי שגיאות (ולחלק מהשאלות המתרגלים ענו תשוב שונה בפורום) הרגיש שהציון שלך יותר תלוי במי שנפלת עליו בבדיקה מאשר בתשובה, ממליצה להיכנס לקבוצה פייסבוק ולאסוף משם סריקות כי זו הדרך היחידה ללמוד וגם היא לא וואו תשובות שונות יכולות להתקבל לאותה שאלה או תשובות דומות יתקבלו לחלק ולחלק לא.\n\nהשורה התחתונה: זה זה או תכן אם אתם לוקחים שרשרת מחשבים (וזה חובה לתוכנה) אז בהצלחה לנו. הקורס עצמו מעניין, מבאס יותר ההתנהלות של הסגל והניסוחים הכושלים שלהם.", "timestamp": 1716820890076}]}