{"posts": [{"author": "Aviv Ratzon", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי בית מאוד קלים\nהמבחן: \nמבחן דיי קל, קצת טריקי\nהשורה התחתונה: קורס קליל ומעניין, דורש רקע מאוד בסיסי בעיבוד אותות ותמונה", "timestamp": 1598261832484}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: מעניינות וקלילות.\n\nשם המתרגל/ת: באסל חמוד\nחוות דעת - תרגולים: חוץ מכמה תרגולים בודדים, רובם מיותרים ולא תורמים הרבה.\n\nשעורי הבית: נחמדים וקלילים, לא דורשים הרבה השקעה כלל, הכל מסתכם בכמה שורות קוד במטלב.\n\nהמבחן: המבחן לא מייצג את רמת הקורס במהלך הסמסטר- בשנים האחרונות המבחן עלה מאוד ברמה, שאלות פתוחות ארוכות ושאלות אמריקאיות מבלבלות.\n\nהשורה התחתונה: קורס מעניין בסה\"כ, משלב הרבה תחומים, הרבה הנדסה, אלגוריתמים ועיבוד אותות בנוסף לכימיה והפיסיקה בקורס, אך צריך לבוא מוכן למבחן מבחינת הידע של כל הקורס עד הדקויות הקטנות.", "timestamp": 1628533719155}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גיא גלבוע \nחוות דעת - הרצאות: מרצה סבבה אבל לא תמיד ברור, בעיקר טוב למי שמגיע עם בסיס טוב (סטודנטים לפיזיקה בחלק הפיזיקלי של הקורס, מי שהיה טוב בענת בחלק האלגוריתמי של הקורס) אבל מי שלא אולי יצטרך קצת להשלים. הקורס מעניין מאוד ובנוי טוב. \n\nשם המתרגל/ת: באסל\nחוות דעת - תרגולים: מתרגל מעולה, חלק מהתרגולים מיותרים לגמרי וחלק חשובים מאוד\n\nשעורי הבית: 3 גיליונות רטובים, עמוסים אבל סהכ הקורס לא עמוס\n\nהמבחן: שעה וחצי, חלק אמריקאי וחלק פתוח. חלק מהשאלות מעצבנות, בעיקר קשה כי זה קורס מאוד רחב עם הרבה נושאים אז קשה להיות סגור על הכל. החומר טיפה משתנה מסמסטר לסמסטר \n\nהשורה התחתונה: קורס מעניין למי שבא עם רקע ו/או עניין בתחום, יש בו גם פיזיקה וגם ענ\"ת. הלמידה למבחן מעצבנת.", "timestamp": 1657465803520}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: לפעמים לא הכי מובן אבל מרצה סבבה בסה\"כ\n\nשם המתרגל/ת: באסל חמוד\nחוות דעת - תרגולים: מתרגל טוב, יודע את החומר ועונה תמיד על שאלות\n\nשעורי הבית: 3 רטובים במטלאב, קצת עבודה אבל לא עמוס  \n\nהמבחן: השנה עלה ברמה והיו הרבה תלונות. מהמבחנים שמעצבן ללמוד אליהם כי למרות שהטענה של הסגל היא שצריך להבין את החומר ולא לשנן, יש שאלות במבחני עבר על דברים איזוטריים שהיו עליהם שני משפטים בהרצאה.\n\nהשורה התחתונה: הקורס מעניין וגם במהלך הסמסטר הוא קליל ולא מורגש, אבל למבחן צריך לבוא מוכנים בצורה טובה אחרי שעברתם על כל החומר כולל הכל. נדרשת הבנה עמוקה וזה לא מבחן קליל בכלל. אם המבחן לא היה נוראי כל כך הקורס היה מקבל 5 כוכבים מבחינתי, אבל התחושה היא שבאו להוריד ממוצע.", "timestamp": 1657614750790}, {"author": "יוני", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "לא נכחתי בהרצאות (וזה לא היה מאוד נורא)\n\nשם המתרגל/ת:  בר וייס\nחוות דעת - תרגולים:  בר אחלה מתרגל, הוא באמת השקיע ונתן הרבה טיפים טובים למבחן. לפעמים קצת התקשה להשתיק את הסטודנטים שמרשים לעצמם לשאול יותר מדי, אבל לאורך הסמסטר זה ממש השתפר (וזה יותר אשמתם מאשר אשמתו, תהיו קצת מודעים!).\n\nשעורי הבית:  3 רטובים במאטלאב, ממש לא נוראיים אבל גם לא באמת עוזרים להבין את החומר יותר מדי.\n\nהמבחן: טריקי, הרבה שאלות מתקטננות. 40 אחוז מבחן אמריקאי שבו יש איזה 8 אפשרויות בחירה ואז גם צריך להסביר למה בחרת מה שבחרת. עוד 60 אחוז זה 3 שאלות פתוחות, אצלנו אחת מהן היתה באמת מזעזעת אז בעצם מתחילים על 80.\n\nהשורה התחתונה: אחלה קורס מבחינת הידע שהוא נותן, הוא קצת שטחי מבחינת האספקט הטכנולוגי אבל מצליחים לגעת ככה בהרבה נושאים. אם העניין של טכנולוגיה ורפואה מושך אותך, מומלץ.", "timestamp": 1690994629914}, {"author": "אוקטובר 20", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תומר לצרס\nחוות דעת - הרצאות: \nמעביר את החומר טוב אבל קשה להתרכז, ההומור שלו חודר יותר עמוק מMRI\nשם המתרגל/ת: טל סולר\nחוות דעת - תרגולים: \nמתרגל יחיד אין ברירה , פעם בתרגול הוא רשם חשב שהוא על CAPSLOVK ורשם TAL \nשעורי הבית: \nנחמדים\nהמבחן: \nטל הביא לי תשובות\nהשורה התחתונה: מומלץ", "timestamp": 1695903987014}]}