{"posts": [{"author": "Aviv Ratzon", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה:  דניאל סודרי\nחוות דעת - הרצאות: היה טוב, גם תאורטי וגם פרקטי\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: משקיע מאוד, תרגולים פרקטיים עם קוד ואינטואיציה\n\nשעורי הבית: עוזר מאוד להבין איך לעשות ML בpytorch \n\nהמבחן: \n\nהשורה התחתונה: קורס מומלץ למי שלא חושש מעומס ורוצה ללמוד באופן מקיף ML", "timestamp": 1625933284727}, {"author": "Roy Mahlab", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: \nמאוד מתמטיות וגם מאוד מעניינות, סודרי מרצה טוב\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: \nטל אחלה מתרגל ובתרגולים עצמם רואים מימושים בפייתון של כל הרעיונות שמלמדים בקורס וזה ממחיש את זה בצורה ממש מוצלחת.\nשעורי הבית: \nאחד לרענון ועוד 3 במהלך הסמסטר. החלק של הקוד הוא נחמד כי ממש עושים דברים בו.\nחוץ מזה יש פרוייקט של 30 אחוז מהציון שזה נחמד.\nהמבחן: \nמבחן במתמטיקה, היה קצת קשה ללמוד אליו כי אין מבחני עבר.\n\nהשורה התחתונה:", "timestamp": 1634830505143}, {"author": "יאיר נחום", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: \nמעולה\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים:  מעולה\n\nשעורי הבית: עמוס אבל מעניין\n\nהמבחן: פתיר וסביר\n\nהשורה התחתונה: קחו", "timestamp": 1645369274293}, {"author": "יאיר", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: מצויין. מנסה להקיף המון ושולח לינקים למאמרים בנושאים מתקדמים\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: מעולה! \n\nשעורי הבית: לא מעט. עמוס. עם פרויקטון בסוף\n\nהמבחן: הוגן בהחלט. מי שלמד הצליח\n\nהשורה התחתונה: מומלץ", "timestamp": 1647161657122}, {"author": "Gil Sharon", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: הרצאות מעניינות ורלוונטיות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עמוסים ורלוונטיים, מעודכנים הרבה\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1692884018976}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "השורה התחתונה: אחד הקורסים הקשים שהיו לי", "timestamp": 1714154852818}, {"author": "הסטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: ההרצאות עברו הסמסטר באנגלית. אני אישית צפיתי בהקלטות ופחות התחברתי. יש גם הקלטות בעברית מתקופת הקורונה. המצגות יחסית מפורטות, אבל קשה מאוד להשלים את התתי-נושאים בצורה פרטנית. ההמלצה שלי - לצפות בהקלטות בעברית.\nדניאל מכיר את החומר על בוריו, מכניס לעיתים עדכונים on the fly מהניסיון האישי האקדמי שלו. אחלה מרצה.\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: התרגולים מתעסקים בפן הפרקטי של הנושאים. זה הקורס עם רמת סדר התרגולים הכי גבוהה שראיתי בתואר הראשון ובתואר השני.\nיש גיט מסודר עם מחברות notebook לכל הרצאה. במחברות יש הסבר על הנושאים\\תתי נושאים, כולל הדגמות פרקטיות בקוד (pytorch) כמעט לכל תת נושא.\nטל עובר עליהן במהלך התרגול (הקלטות).\nמעביר את החומר בצורה מצוינת למי שצריך השלמות בעל-פה. לרוב עברתי על החומר ישירות מהגיטהאב ולא הרגשתי פספוס.\nמהמתרגלים היותר איכותיים שיצא לי לחוות בטכניון.\n\nשעורי הבית: 3 תרגילים עם חצי יבש חצי רטוב (פייתון). אפשר להגיש הכל כמחברת notebook. התרגילים מרופרנסים לחלוטין מלבד שאלה אחת יבשה עבור כל תרגיל. מגישים את ש\"ב עם שותף נוסף. מבחינת עומס - אם מרפרנסים הרבה יותר קל, לפתור מאפס יקח לפחות יומיים לתרגיל (כולל הקלדה).\n\nהמבחן: מותר להכניס עד 2 עמודים (4 דפים). יש כ-8 מבחני עבר. המבחן בדיוק באותו סטייל כמו המבחנים הקודמים. לעיתים יש שאלה מרופרנסת ממבחני העבר (כמו שהיה אצלנו ממועד א'). בדיקה הוגנת מאוד - אם היית בכיוון אתה מקבל נקודות, ולא יורידו על קטנות. אתם תראו שהתשובות למבחנים מאוד קצרות - אם אתה מבין את הכיוון, לא צריך להתפלפל ולפעמים מספיקות 2-3 שורות לסעיף, וככה הייתה גם הבדיקה.\n\nממוצע מבחן סביר. מי שלמד לפחות שבועיים עבר. למבחנים 3 שאלות (ניקוד כמעט שווה לשלושתן). היה ניתן לקבל לפחות 30 נקודות משאלה 2+3 רק על בסיס מתמטי ללא ידע מוקדם על החומר.\nעם שאלה מרופרנסת (יש סה\"כ 20 שאלות עבר) זה עובר וודאי.\nכן ממליץ להתמקד באינטואיציה של הנושאים\\תתי נושאים והגישה המתמטית של שאלות עבר עבור הנושאים האלו. אין כאן מתדולוגיית פתרונות קבועות כמו מערכות לומדות שחוזרות על עצמן, אז זה יכול להיות טריקי ולהרגיש שלומדים אבל לא באמת מתקדמים לאנשהו. הכל טוב - תלמדו בעל פה את כל השאלות, תמצאו\\תפתרו את התרגילים הקטנים שיש במהלך המצגות.\n\nפרויקט: 30% מהציון. הזדמנות מצוינת ליישם פרקטיקות מהקורס. ניתן לבחור נושא, או להיעזר במתרגל לבחור. יש בערך שבוע-שבועיים לבצע את הפרויקט (במקביל לשיעורי בית 3). מעלים את הפרויקט לגיט עם readme מסודר. מקליטים סרטון 6 דקות (לעבור על מצגת) להסביר על הפרויקט. מפעילים את ההקלטה הזו ביום מרוכז והמרצה\\מתרגל שואל 2-3 שאלות קטנות על הפרויקט עצמו. מכינים מסמך קצר שמסביר על הפרויקט. רוב הפרויקטים זה לקחת בעיה מסוימת שיש לה דאטה\\מייצרים דאטה, ליישם כמה ארכיטקטורות (הרוב דברים קיימים) ולהראות תוצאות.\n\nהשורה התחתונה: קורס מומלץ. אני אישית פחות התחברתי לפן התאורטי-מתמטי (יורדים כאן לרזולוציות קטנות) אלא יותר לפרקטיקה. הבעיה הכי גדולה זה שכמעט אין שיתוף ידע בקבוצת וואטסאפ - חיסרון ענק של הטכניון. תעודדו שיתוף שם. תשתפו אחד עם השני פתרונות, תעודדו שיח ושאלות תוך כדי הסמסטר. תשתפו סיכומים ודפי נוסחאות. \nאין מה להתבייש זה בשביל כולנו.", "timestamp": 1714724197851}, {"author": "רוני", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: הכי טובות שהייתי בהן.\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: הכי טובים שהייתי בהם.\n\nשעורי הבית: מאוד מאוד מלמדים, חצי תיאורטי וחצי קוד. \n\nהמבחן: תיאורטי בלבד. קשה, צריך ללמוד הרבה אבל בסוף משתלם.\n\nהשורה התחתונה: הכי ממליץ!!!", "timestamp": 1716806000002}]}