{"posts": [{"author": "****", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אריאל אפשטיין\nחוות דעת - הרצאות: \nמרצה מעולה, מנסה להעניק יחס אישי יחסית, ולזכור את השמות של הסטודנטים (קל כשיש מעט כמו בקורס הזה). עובד עם מצגות מפורטות יחסית כשהמשוואות הרלוונטיות תמיד מופיעות ואפשר לחבר את זה למה שקרה בשקפים הקודמים. בתחילת כל הרצאה יש כמה דקות חזרה על מה שהיה בהרצאה הקודמת, וכן גם Polls אינטראקטיביים עם הכיתה.\nבסך הכל הוא מסביר את החומר בצורה יחסית טובה למרות שלפעמים קל לצלול הרבה לתוך המתמטיקה ולפספס את הפואנטה. \n\nשם המתרגל/ת: עמית שחם\nחוות דעת - תרגולים: \nכתב תרגולים מפורטים מאוד, ובצורה מעולה. בשעה קצת קשה לרדת לכל הפרטים של התרגול אבל אין ספק שהוא יודע על מה הוא מדבר ומבין את החומר. מעבר לכך, הוא תמיד היה מוכן לענות על שאלות במייל/שעות קבלה והראה נכונות להסביר את החומר בצורה ברורה גם מעבר לתרגול.\n\nשעורי הבית: \nיחסית עמוסים, לפעמים מסמלצים דברים במטלאב שפשוט קשה מאוד לגרום להם לעבוד, וגם לא היו רפרנסים אז בכלל היה לא פשוט. מה שכן, עמית הראה המון נכונות לעזור בבעיות שעלו עם השיעורים ובהחלט סייע כשהיה צורך, כמו כן גם נתן ציונים גבוהים בכל מקרה.\n\nהמבחן: \nלא היו מבחני עבר רלוונטיים להתכונן אליהם ככה שלי המבחן היה מאוד קשה כי לא ידעתי למה לצפות. הבדיקה היתה מאוד מקלה אז יצאתי עם ציון בסדר. צריך לשלוט בתופעות הפיזיקליות שלומדים אבל גם במתמטיקה של תנאי שפה כמו שלומדים בעיקר בשדות, ככה שהדרישה במבחן יחסית גבוהה. עם זאת, יש חומר פתוח ככה שאני חושב שבסמסמטרים הבאים כשתראו איך נראו המבחנים הקודמים, יהיה יותר ברור למה לצפות ולגמרי אפשר להצליח במבחן (הוא לא מכשיל לדעתי).\n\nהשורה התחתונה: \nאני אהבתי את גלים ומערכות מפולגות ולכן נרשמתי לקורס הזה, למרות שלא לקחתי אף קורס נוסף בשרשרת של אלקטרומגנטיות. הקורס הוא קצת יותר טכני ובו לומדים על מקרים \"מציאותיים\" יותר של מוליכי גלים (למשל - אין שני מימדים אינסופיים בעולם האמיתי - הפתעה!) ובגלל זה הוא גם הרבה יותר פרקטי ממה שלומדים על קווי תמסורת בגלים ומערכות מפולגות.\nאני אישית קצת מתחרט שלקחתי את הקורס כי אני לא רואה אותו עוזר לי יותר מדי בעולמות שאני ממשיך בהם, אבל למי שמתעניין בתחום של אלקטרומגנטיות מדובר בקורס מעולה, הנדסי מאוד, מתקשר מאוד למה שלומדים באנטנות לדעתי, ובכללי לכל מה שקשור בהתפשטות קרינה/הספק במבנים סופיים.\nבסך הכל כן קורס טוב אבל ממליץ רק למי שמתעניין מאוד באלקטרומגנטיות.", "timestamp": 1641474657494}]}