{"posts": [{"author": "Elad K", "semester": "201901", "text": "קורס חשוב. רק המתרגל הציל את הקורס אבל כהרגל חשמל בקודש, הרצאות לקוניות שמתבססות על מצגת כותרות חלולה בתוספת מרצה לא ברור. יש 3 רטובים שרוב הזמן מתעכבים על הבנת החומר, 3 יבשים מרופרנסים. משום מה הם לא דורשים את ממ\"ת\\מתמ כקדם. לדעתי זהו הקדם החשוב ביותר בקורס כי כל הת\"ב בC++ . לעומת זאת הקדמים שכן נדרשים לא חשובים לקורס כמעט בכלל.", "timestamp": 1590920131000}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: הפסקתי לראות באיזשהו שלב, מרצה מונוטוני שלא עוצר גם לשאול אם הכל ברור. יש כמה נושאים שלא מכוסים בתרגולים אבל לא בעיה לעבור עליהם לבד לקראת המבחן\n\nשם המתרגל/ת: מור \nחוות דעת - תרגולים: סה\"כ הוא מתרגל טוב וגם מאוד זמין לשאלות ושעות קבלה, מסביר טוב והתרגולים מכסים את התכלס של הקורס \n\nשעורי הבית: ממש ממש ממש עמוסים, הרגשתי שהם יותר עמוסים מכל הקורסים האחרים שעשיתי. יש 3 יבשים (10%) שהם אחלה ו3 רטובים (40%) שהם השטן. אם לא לקחתם ממ\"ת/אתם לא אוהבים לתכנת - אל תחשבו אפילו בכיוון. הרטובים זה תכנות הארד קור של כמה מאות טובות של שורות קוד. כדי להוציא בהם ציון טוב צריך לשבת עליהם המון זמן ואנחנו בסוף התפשרנו בציון כדי לא לשרוף כל כך הרבה זמן עליהם.\n\nהמבחן: היה דיי פייר \n\nהשורה התחתונה: אל תתפתו לקחת רק בגלל הממוצע הגבוה, הציונים בש\"ב היו דיי נמוכים יחסית ובסוף צריך להוציא ציון טוב במבחן כדי לסיים עם ציון גבוה. בדיעבד לא הייתי לוקחת, החומר דיי שיעמם אותי ובשילוב עם ש\"ב נוראיים יצאתי עם טעם מר.", "timestamp": 1644682050851}, {"author": "טריוד", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אבינועם\nחוות דעת - הרצאות: \nמרצה אגדה, סופר מעניין ומלהיב. ממיסדי התחום לכן מעניין לשמוע ממנו את ההרצאות. מרחיב ומספר על דברים שלא בחומר.\n\nשם המתרגל/ת: מור דהן \nחוות דעת - תרגולים: הgoat של הולסי. ממש אכפת לו מההצלחה של התלמידים והוא מסביר לאט וברור ומחזיק את כל הקורס בידיים שלו. תמיד עזר בנוגע לדחיות שיעורי בית אם הזדקקנו. ועשה הכל כדי שנבין את החומר\n\nשעורי הבית: \nעמוסים פיצוצים. בשיעורי הבית עובדים עם ספריות מוכנות בc++. הסגל כתב מחדש את הספריות ועשה להם דוקומנטציה טובה. הם הקשיבו לתגובות של שנים עברו, וכעת הכל עובד והרבה יותר קל להבין מה לעשות, אבל שיעורי הבית עדיין קשים ומצריכים הרבה זמן, בהתאם ל50% מגן שהם מייצגים\n\nהמבחן: \nמשקף בצורה טובה את רמת החומר הנלמד. יש כמה נושאים מרכזים ששואלים עליהם גם במבחן.\nהשורה התחתונה: \nבקורס לומדים על וריפיקציה דינאמית, פורמאלית וכל מיני מבני נתונים לייצוג של מעגלים לוגים, הקורס הוא מעין המשך של ספרתיות בשילוב עם אלגוריתמים ונגיעה של ממ\"ת.\nאם מעניין אותכם תכן לוגי ואתם אוהבים תכנות הקורס מומלץ\nמומלץ מפה ⭐⭐⭐⭐⭐", "timestamp": 1676641437066}, {"author": "טוב למות למען תות", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אבינועם\nשם המתרגל/ת: מור דהן\n\nשעורי הבית: בשביל מי שלא עשה ממת זה יהיה קשה בערך כמו שיעורי הבית של מבוא לVLSI. בשביל מי שלקח ממת וקצת זוכר תיכנות זה יהיה קשה כמו שיעורי הבית של ממת. למי שעשה שרשרת מחשבים ממש אין סיבה לפחד מהרטובים.\nב2 מ3 מהרטובים באמת מתכנתים כלים עם ערך פרקטי לביצוע סימולציה וביצוע וריפיקציה פורמלית (super tests) של מעגלים לוגיים וזה מגניב.\n\nהמבחן: 50%, אבל משמעותית קל יותר ממבוא לVLSI. באמת מבחן חמוד. צריך ללמוד כמה אלגוריתמים אבל לא הרבה. במבחני העבר יש קצת שאלות שמלמדות דברים מעניינים. הקורס היחיד בתואר שגם שיעורי הבית הרטובים וגם היבשים עוזרים בשאלות במבחנים (ועשיתי שרשרת מחשבים).\n\nהשורה התחתונה: קורס נהדר. ציון טוב, פותח את הראש לתחומים בתעשיה (cad, formal verification), מעניין, ולא עמוס כמו קורסים אחרים עם הגשות 50% אבל זה תלוי בקורסים שעשיתם.", "timestamp": 1679077022062}, {"author": "XOR", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אבינועם קולדני\nחוות דעת - הרצאות: מרצה בחסד עליון ת זכות ללמוד ממנו\n\nשם המתרגל/ת:  מור דהאן\nחוות דעת - תרגולים: מתרגל מעולה , זמין מאוד לעזרה בשיעורי בית\n\nשעורי הבית: עמוסים יותר מכל הקורסים שלקחתי בתואר ביחד , מעניין ומגניב אבל צריך לדעת לתכנת טוב בשביל שיהיה סביר אחרת זה מאות שעות של עבודה . \n\nהמבחן: היה מבחן קל יחסית לכן הממוצע גבוה , לא יודע אם משקף על מה יהיה עתיד \n\nהשורה התחתונה:  \nקורס מעניין מאוד אבל מאוד עמוס , לא להתפתות בגלל ממוצע גבוה בתוך סמסטר עמוס", "timestamp": 1688839464437}, {"author": "י.כהן", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: -\nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: -\n\nהמבחן: -\n\nהשורה התחתונה: אני פה רק להגיד שהבודק תרגילים אחלה גבר שבעולם - אוהבים אותך יניב !", "timestamp": 1705564710155}, {"author": "איריס", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: איתן זהבי\nחוות דעת - הרצאות: \nהמרצה הכי גרוע שהיה לי בתואר, לא מצליח להעביר את החומר, קופץ בין נושאים, גורם רק לבלבול, מורח את השיעור, לא מעניין, לא הבנתי כלום מההרצאה (קריאה עצמית עדיפה)\nשם המתרגל/ת: מור דהן\nחוות דעת - תרגולים: מור הצליח להסביר את כל ההרצאה כולל דוגמה בשעת תרגול אחת :)\n\nשעורי הבית: 3 רטובים, ראשון פשוט, שני עמוס מאוד, שלישי עם הוראות מבלבלות, אין טסטים, הסבר לא מובן, עמוס מאוד ועל סוף סמסטר.\n\nהשורה התחתונה: ממליץ לקרוא הרצאות בריפרוף ולהשקיע זמן בתרגול של מור", "timestamp": 1712221087129}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איתן זהבי\nחוות דעת - הרצאות: לא ממליץ לקחת את הקורס בזמן שהוא מעביר את ההרצאות.\nיש מצב שהבן אדם יודע את החומר בצורה טובה אבל מה שבטוח: ללמד אותו הוא לא יודע, יתר על כן שגם אם נניח והחלטתם לקחת את הקורס בזמן שהוא מלמד ואתם לא תבינו כלום מההרצאה אז תצטרכו לקרוא לבד את שקפי ההרצאות וגם הם לרוב לא מובנים, ואז מה? תגלו ש75% מהמבחן הוא על 3 שקפים שהיו בהרצאה שלא הוסברו כמו שצריך, בקיצור DONT. \n\nשם המתרגל/ת: מור דהן\nחוות דעת - תרגולים: אחלה של מתרגל, אבל: הבן אדם טס ומעביר את החומר בהבנה טובה אבל לא מעבר, יאמר לזכותו שאם היה לי כל קשר לקורס זה היה התרגולים ואני סך הכל לא מאשים אותו כי הוא צריך להעביר חומר של הרצאה של שעתיים ועוד כמה דברים הבנתיים ולכן הוא חייב לטוס ולא ממש להתעמק על החומר ולפיכך הוא עושה את המקסימום.\n\nשעורי הבית: האמת שדוגרי נהנתי מאוד מהתרגילי בית, בגדול זה 3 תרגילים רטובים, הראשון זה להכיר את המודל שעליו הולכים לבצע דברים יותר מעשיים, השני זה לבנות ממש סימולציה ולהוציא דיאגרמת גלים עבור דיזיין מסויים (היה ממש כיף) והשלישי זה ליצור בעיית SAT שזה נושא ממש קליל ונחמד.\n\nהמבחן: ספציפית המבחן של מועד א' היה הזוי, כל מבחני העבר היו הרבה יותר טכניים והתמקדו כמעט בכל השאלות בחומר מהתרגול וזה אחלה של דבר אבל במבחן הזה, היה צריך להוריד ממוצע ולהראות שרירים אז עשו כמעט את כל המבחן על חומר \"שהיה\" בהרצאה (לחזור לחוות דעת - הרצאות) וזה היה סיוט וחבל... \n\nהשורה התחתונה: קורס מעניין מאוד ולדעתי חשוב לכל מי שיש לו קשר לתעשיית הchip design מה שכן חבל שכרגיל הוא לא מועבר בצורה מלמדת במיוחד וגם המבחן בסוף בוחן אותך על אלגברה בוליאנית ועל \"נושאי קצה\" מההרצאה שלא לומדו טוב.", "timestamp": 1716535210759}, {"author": "MMMM", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: זהבי איתן\nחוות דעת - הרצאות: קצת מסורבלות ,יש הרבה מאוד נושאים בקורס ולא בהכרח מסתמכים אחד על השני,מומלץ לקרוא את המצגת לפני השיעור.\n\nשם המתרגל/ת: מור דהן\nחוות דעת - תרגולים: כמו בVLSI מצליח לפשט את הכל הסברים מאוד ברורים היו הרבה נקודות שלא הבנתי בהרצאה ובתרגול שלו נהיו ברורים.\n\nשעורי הבית: זה החלק הכי עיקרי בביקורת פה השיעורים מהווים 50% מן הציון ובצדק,זה 3 תרגילים ארוכים שדורשים מלא דיבאג ומלא טסטים לפני הגשה, 2 דברים:יש סיכוי גדול מאוד שהם ישאבו ממכם המון זמן זה by far היו השיעורי בית הכי עמוסים שהיו לי בסמסטר,דבר שני אל תתקרבו אם אין לכם נכונות להכנס לC++ אני לא ידעתי את השפה כל כך והייתי צריך לרוץ על קורס של שבוע כדי להבין איך זה עובד במיוחד שיש פה שימוש בOOP.\n\nהמבחן: אין חומר פתוח וחצי כח דומה למבחני עבר, בסהכ סביר אבל עדיין יש סיכוי שתותקלו בנושא שולי שדובר עליו בהרצאה.\n\nהשורה התחתונה: הקורס זה בעצם VLSI CAD זה קורס שמלמד על עקרונות האוטומציה של וריפיקציה של מעגלים לוגיים, תחשבו טוב טוב לפני שתקפצו לקורס בגלל שיש לו 50% מגן שיעורי בית, באופן אידאלי זה קורס שאם ממש רוצים אז לשים בסמסטר לא עמוס.", "timestamp": 1717934482896}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nארוכים מאוד, ואין הגשה חוזרת.\nאתה יכול להשקיע 40+ שעות על רטוב ובסוף תקבל ניקוד חסר.\nהמבחן: \nלא קל ולא קשה\nהשורה התחתונה: \nקורס מעניין אבל לא שווה ההשקעה. והסגל לא טוב.", "timestamp": 1718722425887}, {"author": "אם לא לבד אז כואב פחות", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "בדר''כ יש טענה שאם סטודנט ירשום חו''ד שכולה נגד הקורס , מדובר בסטודנט שסתם לא הצליח במבחן, לא חזק מספיק והכל מסולף בתחושות אישיות. \n\nאבל ההתנהלות שחוויתי בקורס הזה היא המעליבה ביותר שראיתי , ומראה על התנהלות של \"המערכת תמיד צודקת\", חוסר מוחלט בהכרה בטעויות ובנזקים שלהם, כאשר הצד התלוי הוא זה שסובל.\n\nממליץ לא לקחת את הקורס בגלל חוסר ייצוג הציון את איכות העבודה והידע בבחינה , למרות שמבחינת תוכן עניין ונושא נלמד, מדובר בתחום שאני חושב שמעניין וחשוב.\n\nמטלות הבית הן שלושה תרגילים רטובים שדורשים ידע מתקדם ב cpp ויכולת הבנה של ספריות חיצוניות שנדרשות לפתרון התרגילים, שכוללות חומר רב ודוקומטנציה דלה שאף לא נלמדת כלל בקורס, או שאם חלקים ממנה מוזכרים , מסתמכים על פתרון מסוים שהביא תוצאות מצופות .\nלהתבסס על פתרון ולא על עקרונות זו דרך שגויה, \nהרי אם כל הפתרונות יהיו זהים יטענו שכולם העתיקו האחד מהשני. \n\nדוגמה , באחד התרגילים – אחת הדרכים לשימוש בפונק' חיצונית תלויה באופן בו התוכנית קוראת לזיכרון , מבלי לדעת זאת, לגיטימי לממש בדרך שכנראה שונה מהפיתרון שעליו מסתמך סגל הקורס , \nרק שהדבר גורם לבאג לא מוסבר שגורם לתכנית לא לעבוד, וכמובן להגיד שמשהו בסביבה לא נכון זה כמו בעת כתיבת קוד בשפה מסוימת, להניח ישר שהבעיה בinclude, import בסיסיים. \nאם סטודנט חזק לא היה מוצא את הבעיה , כנראה שסטודנטים רבים לא היו יכולים להצליח. \nדרישות תרגילי הבית מכילות חוסרים רבים , וזמן לא מבוטל נדרש להשקיע בבירור הדרישות הטכניות של האלגוריתם הנדרש, שלא מוסבר היטב בדרישות.\nתרגילי הבית מבוצעים על מכונה וירטואלית שנדרשת להתקנה, גורמת לתקלות טכניות שהפתרון מצד הסגל לכך הוא לחפור בגוגל. \n\nבהערכת התרגילים חלה חוסר שקיפות , ומניעת יכולת הסטודנטים להיערך לכך, (הגדרת קושי המשימות ופרסום טסטים וכו' אכן נתונה לשיקול דעת הסגל) , \nאבל בכל הסמס' נאמר שיש התחשבות גם בקוד, ברעיון המבוטא ובאלגוריתם , ולשניים משלושת התרגילים נדרש להגיש גם דו''ח. לא מופרך לחשוב שאם זה מה שנאמר, שגם אם תהיה הערכה אוטומטית של טסטים אז שתהיה התייחסות לכתוב. בדיעבד חודש לאחר סיום הסמס' התברר שחלוקת הניקוד היא כ10% לדו''ח, ו80% עבור תוצאות טסטים, 10% לקומפילציה. \nחוסר שקיפות מוחלט. יתרה מכך, חלק גדול שמהווה סיבוך משמעותי בתרגיל האחרון לבסוף כלל לא נבדק. (נכון שגם מבחנים וגם עבודות לא תמיד מכסים את כל החומר), אבל איך תרגישו אם השקעתם בחלק שמסבך את העבודה זמן רב ?  הוא עובד לפי הדרישות בכל דרך שבדקתם, מבטא הבנה בחומר ובדרישות, ולמעשה אם זוג סטודנטים אחר מוותר על כך לגמרי ומגיע לתוצאות PASS/FAIL זהות עבור מס' נבחר של טסטים , ויכול לקבל 100.\nעל חלק מדרישות המסבכות את התרגילים נראה שגם לסגל לא הייתה תשובה. \nתרגילי הבית בקורס נותנים נסיון והבנה של אלגוריתמים ויכולת לניתוח ופתרון בעיות CAD, אבל חבל על הדרך שבה זה מתבצע. \n\nקיימת חוסר קורלציה בין עיקר העיסוק בלמידה במהלך הסמס' , בהרצאות תרגולים ותרגילי הבית,  לאופי השאלות בבחינה ורמת הערכתן. \n\n\nהבחינה : בחורף 23-24 מועד א', \nהייתה די שונה מבחינות עבר בחלק גדול ממנה. בחלקה כללה ניסוח מעורפל ומטעה.\nנראה שיש התנהגות מערכתית שבקורסים עם עבודות בית במשקל גבוה, חייבים לתת מבחן שמראש סיכויי ההצלחה בו נמוכים או לנקד אותו בניקוד נמוך בכוונה, \nאם קראתם עד הסוף, מקווה שהבנתם שלא מדובר סתם ב bias שלילי של סטודנט/ית שלא הצליחו את הקורס.", "timestamp": 1718943988254}, {"author": "Ido Porges", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: קולודוני אבינעם\nשם המתרגל/ת: מור\n\nלא כתבתי ביקורת כשעשיתי את הקורס, ובגדול הוא היה לי קשה אבל בזכות הציון בקורס הזה *ספציפית* קיבלתי ראיון עבודה בformal verification בחברה מאוד מאוד טובה ולאחר שעברתי ראיון טכני ראשון אני יכול להעיד ש*הכל* בקורס רלוונטי עבור מהנדסי formal וcad. זאת תקופה לא קלה לצאת לשוק העבודה ויש מצב שהקורס הזה מניף לי את כל הקריירה.\n\nהOOP של הסימולציה רלוונטי, גם ברמה העקרונית אם תיגעו בתורשה במסגרת verilog וגם ברמה הישירה כי לפי המראיינים כן משתמשים בספריות C++ בשלבים שונים.\nעל הminsat המראיין דיבר כשהוא הסביר על מה שעושים בעבודה עצמה ובהתלהבות יכלתי לספר לו על תרגיל הבית.\nבשאלות ששאלו אותי אלגברה בוליאנית באמת עזרה, פעמיים ביקשו מימני לייעל את הפיתרון והדרך הייתה אלגברה בוליאנית מסובכת שזכרתי רק בזכות הקורס הזה.\n\nהשורה התחתונה: נכון לעכשיו אין עוד קורסים בנושא formal לוגי והקורס פותח את הדלת הזאת בצורה שלא ציפיתי.\nתבואו מתוך עניין, ואל תקשיבו לביקורות קוטלות של קורסים עם ממוצע 80+ זאת בכיינות שאין כמותה. לא כולם חייבים לעוף על הקורס אבל בחיאת קצת פרופורציה עברתם קורסים עם ממוצע 50", "timestamp": 1721318194629}]}