{"posts": [{"author": "alon keselman", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: \nמרצה טוב, שומר על עניין ומקשר לדוגמאות אמיתיות\nשם המתרגל/ת: אביעד נבון\nחוות דעת - תרגולים: מתרגל מצויין מסביר טוב\n\nשעורי הבית: קלים\n\nהמבחן: \nממש נבחנים על החומר , לא על משהו מומצא\nהשורה התחתונה: \nקורס ששווה לקחת, לומדים דברים שמגניב לדעת לגבי איך מערכות חשמל עובדות ברמה ארצית", "timestamp": 1616449056844}, {"author": "itameyer", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: \nההרצאות כתובות בצורה מעולה וכל הדברים מוסברים בצורה הכי גבוהה שיש. אם משהו לא מובן יואש יעצור ויסביר. \nשם המתרגל/ת:  אביעד נבון\nחוות דעת - תרגולים: תרגולים קצרים וקולעים וכתובים מצוין. אחלה מתרגל\n\nשעורי הבית: 5 ש\"ב יבשים ואחד רטוב. הרטוב במאטלאב והוא דיי נחמד, שווה לעשות אותו לבד כי זה עוזר להבין חלק מהקונספטים בקורס. היבשים דיי קצרים ועוזרים להבין את החומר.\n\nהמבחן: מבחן הוגן\n\nהשורה התחתונה: קורס מצוין. הכל מוסבר בצורה הכי גבוהה שיש. אני לקחתי אותו כהעשרה ולמדתי הרבה. כדאי מאוד לקרוא/ לנכוח בהרצאות כי החומר שם חשוב למבחן אבל גם ממש מעניין.", "timestamp": 1644067474548}, {"author": "Dor Akerman", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  יואש לברון\nחוות דעת - הרצאות: מרצה מעולה! הרצאות מעניינות ומוסברות היטב, לרוב לא דורשות 3 שעות גם. קבצי ההרצאה גם הם אינפורמטיביים מאוד והמרצה גם מעלה סיכום של ההרצאה לאחר מכן.\n\nשם המתרגל/ת: אביעד נבון\nחוות דעת - תרגולים: אחלה מתרגל, התרגולים עוברים בצורה טובה על החומר מההרצאה ומתומצתים.\n\nשעורי הבית: \n4 מתוך 5 יבשים ועוד תרגיל רטוב, לא גוזלים יותר מדי זמן וטובים ללמידה.\nהמבחן: הוגן.\n\nהשורה התחתונה: ממליץ", "timestamp": 1644227445105}, {"author": "פנטסטי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: המרצה הכי משקיע ואכפתי שתפגשו בטכניון! מעלה הקלטות, הרצאות כתובות מעולה והמרצה מסביר מצוין. בנוסף, המרצה מעלה בסוף ההרצאה סיכום להרצאה של כמה דפים.\n\nשם המתרגל/ת: אביעד נבון \nחוות דעת - תרגולים: מתרגל מצוין, יש לבקש ממנו (אנו לא הצלחנו) שיעלה את סיכום התרגול שלו גם לאתר הקורס.\n\nשעורי הבית:  סבירים מאוד 2 שאלות לגיליון. הסגל מאמין בתרגול אפקטיבי ולכן כל תרגיל שנראתה בו השקעה גם אם הפתרונות בסוף לא נכונים מקבל ציון מקסימלי של 100. תרגיל המחשב דורש קצת השקעה אך לא מסובך מדי.\n\nהמבחן: בדיוק על מה שנלמד בקורס ודומה למבחנים קודמים (עם כמה שזה מפתיע;)) ובהחלט ניתן לקבל ציון מצוין בקורס בלימוד סביר למבחן. לצערי, אצלנו הסגל לא העלה הסברים על כל טעות במבחן ביחס לפתרון הרשמי והיה צריך לשאול את המתרגל ע\"מ לקבל פירוט נוסף\n\nהשורה התחתונה: קורס מומלץ לכל מהנדס חשמל כקורס פקולטי. לומדים דברים שלדעתי היו חייבים להיות כחלק מקורס חובה כמו למשל מהי מערכת תלת-פאזית וכיצד עובדת מערכת החשמל. יתר על כן, סגל הקורס הינו הכי טוב שנתקלתי בטכניון!", "timestamp": 1648376262565}, {"author": "שלומי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: צפיתי בהקלטות (הוא הפנה אותנו אליהן ואמר שהן זהות להרצאות שהוא יעביר בכיתה). מרצה מעניין וברור, לרוב ההרצאות הן פחות מ3 שעות\n\nשם המתרגל/ת: אביעד נבון\nחוות דעת - תרגולים: כנ\"ל, צפיתי בהקלטות, התרגולים ברורים ומעניינים, ומכסים את רוב החומר אבל לא את כולו, מומלץ לצפות גם בהרצאות\n\nשעורי הבית: לא מסובכים מדי ועוזרים לחומר להתיישב טוב בראש\n\nהשורה התחתונה: קורס מעניין ולא קשה, ורלוונטי לתחום החשמל, שווה לקחת", "timestamp": 1676146605499}, {"author": "_", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: ההרצאות דיי משמימות, יואש מרצה לא רע ובאמת אכפת לו מההבנה של הסטודנטים. בסוף לי הכי התאים פשוט לקרוא אותן, ואם נתקעתי במשהו לראות את החלק הרלוונטי בהרצאה.\n\nשם המתרגל/ת: איתמר קפוזה\nחוות דעת - תרגולים: מאוד רציתי לחבב את התרגולים של איתמר אבל לדעתי הם לא טובים במיוחד, הוא מבלה חלק ניכר מהתרגול בלכתוב על הלוח רק כדי למחוק אותו כמה דקות אחרי בנוסף לא הרגשתי ממנו איזה הבנה עמוקה של החומר או תובנות כלשהן שיעזרו לכם במבחן או משהו.\n\nשעורי הבית: \nהוגנים מאוד, קצרים ולא דורשים הרבה זמן.\n\nהמבחן: \nלדעתי המבחן הסמסטר היה לא סביר, נכון השאלות לא כאלה קשות, אבל כשנאמר במפורש שלא ניגע בחומר מסוים בקורס ואז מופיעה שאלה של 50 נקודות עליו זה לא כ\"כ הגיוני. \n\nהשורה התחתונה: עושים כי רוצים לעשות שרשרת הספק, יש אנשים שיספיק להם שבוע ללמוד את כל הקורס וזה יעבוד להם טוב במבחן (כנראה שלרוב) אבל בעיני יואש ממש מעלה בשנים האחרונות את רמת המבחנים וכן מנסה \"להפיל\" קצת יותר.", "timestamp": 1714935235285}, {"author": "סימה", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יואש לברון\nחוות דעת - הרצאות: מועברות בצורה ברורה, הרבה דילוג על חישובים מתמטיים ועיקר הסבר תיאורטי ותוצאות סופיות\n\nשם המתרגל/ת: הקלטות \nחוות דעת - תרגולים: \n\nשעורי הבית: 5 יבשים קצרים מרופרנסים חובה להגיש אבל כולם מקבלים 100\n\nהמבחן: הסמסטר קשה יותר, במבחן הייתה שאלה שנאמר בפירוש שלא נעסוק בקורס בחומר הזה\n\nהשורה התחתונה: יואש התייאש מלחץ הפקולטה והחליט להקשות על הסטודנטים...", "timestamp": 1714986192283}, {"author": "MMMM", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יואש\nחוות דעת - הרצאות:מסביר טוב ועונה על כל השאלות ומוסיף הסברים שקשורים לאיך שהמערכות עובדות במציאות \n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: לא יכולתי להגיע המוקלט אחלה על מהירות 1.5 1.75\n\nשעורי הבית: קלים ויותר בשבילינו מאשר בשביל ציון כי מספיק להגיש כדי לקבל את הציון\n\nהמבחן: עלה בקושי מועד א הבנתי שהיה קשה מועד ב יותר קל האמת\n\nהשורה התחתונה: אחלה קורס להבין על מערכות הספק ורשתות תלת פאזיות שיש לכולנו בבית", "timestamp": 1716833481442}]}