{"posts": [{"author": "Guy Yoffe", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: אחד המרצים הכי טובים בטכניון. לא יודע איך הוא אחד על אחד, אבל בהרצאות הוא היה המרצה שהכי השקיע בבניית ההרצאה, והיא אכן הייתה הכי מעניינת. הראה מאמרים מעניינים, דיבר בהרבה התלהבות ותשוקה, היה תענוג להקשיב להרצאות שלו.\n\nשעורי הבית: יבשים די מרופרנסים ולא קלים, רטובים ארוכים ולא קלים בכלל.\n\nהמבחן: תלוי בשנה - לפעמים שאלות מאוד קשות, ב2020 (קורונה) היה מבחן די קל. סה\"כ מבחנים שצריך לחשוב בהם מאוד עמוק ובצורה מאוד מעמיקה, ולפעמים יש שאלות מאוד טכניות.\n\nהשורה התחתונה: קורס מעניין מאוד. לא כל כך מה שמצפים ממנו, אבל עדיין מאוד נהניתי.", "timestamp": 1597753641183}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: ההרצאות היו מאוד מעניינות ומרתקות, למרות הקורונה יואב השקיע בהרצאות ודאג להעביר אותן בצורה מאוד מעניינת, מאוד מומלץ להגיע.\n\nשם המתרגל/ת: אביעד אברדם, אלעד הירש\nחוות דעת - תרגולים: שני המתרגלים תותחים, סופר מקצועיים ומבינים בתחום. \n\nשעורי הבית: היבשים בחלקם ממוחזרים וחלקם חדשים, רמה בינונית ועוזרים הרבה להבנת החומר.\nהרטובים היו חדשים ולא ממוחזרים, היו מאוד קשים ומורכבים, היו הרבה מאוד בעיות בהוראות והבנה מה המתרגל רוצה מאיתנו. רצוי להתחיל אותם ממש כשהם יוצאים כי לוקח הרבה מאוד זמן להבין מה רוצים בסוף.\n\nהמבחן: היה מבחן מקוון, סביר, רמת קושי סבירה והגיונית יחסית לקורס, לא משהו מטורף. צריך להבין טוב את החומר מההרצאות של שכנר.\n\nהשורה התחתונה: קורס מאוד מומלץ, מעניין, נותן בסיס טוב לתחום של ראייה ממוחשבת ועיבוד תמונה.", "timestamp": 1597829073097}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: מרצה מעולה!! מסביר בצורה מאוד טובה עם מצגות די קלילות ומאוד מעניינות. יואב מאוד מאמין בסטודנטים וחשוב לו שהם יבינו ויצליחו. חשוב להיות בהרצאות כי הוא יכול לשים דברים במבחן שהראה בהרצאות שלו (שלא בהכרח קשור לקורס בצורה ישירה).\n\nשם המתרגל/ת: אביעד אברדם\nחוות דעת - תרגולים: מתרגל מאוד טוב! מסביר בצורה מאוד עניינית וכיפית. מסביר בגובה העיניים ויש אווירה מאוד כיפית בשיעור. לפעמים טיפה מתבלבל אבל בסה\"כ הוא טוב.\n\nשעורי הבית: היבשים נחמדים (ממוחזרים או ממבחנים של שנים קודמות), הרטובים בחלקם קשים (3 סה\"כ) בגלל שחלקם לא כל כך מובנים.\n\nהמבחן: המועד א' היה די קשה ולא כל כך מובן. גם הייתה התנהלות לא טובה במבחן בגלל הקורונה (דרישות מוגזמות, חיבורים לזום וכו') אבל המועד ב' היה יותר סביר.\n\nהשורה התחתונה: קורס מאוד מעניין ופרקטי.", "timestamp": 1607469013053}, {"author": "אלון נמירובסקי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ישראל\nחוות דעת - הרצאות: הרצאות ענייניות, מועבר בזום בצורה פחות איכותית לדעתי.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: תרגולים טובים\n\nשעורי הבית: תרגילים ממבחני עבר, רלוונטיים להבנה של הקורס ולא לוקחים יותר מדי זמן. יש גם רטובים במאטלב שיכולים להיות מעיקים.\n\nהמבחן: \nהמבחן היה יחסית נוח.\nהשורה התחתונה: קורס מאוד מעניין ומומלץ למי שהתחום קורץ לו.", "timestamp": 1614181561345}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: יואב מרצה מעולה בעיניי, משקיע וממש משתדל להלהיב את הסטודנטים לתחום.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: תותח על\n\nשעורי הבית: 5 יבשים ו-3 רטובים במטלאב. דווקא לא הרגשתי עומס מטורף, הרטובים נחמדים סה\"כ וכיף לראות דברים בעיניים ולא רק לעשות שאלות יבשות.\n\nהמבחן: היה לא קשה אבל כיסחו בבדיקה. סה\"כ ההיסטוגרמה לא משתנה יותר מדיי בשנים האחרונות.\n\nהשורה התחתונה: אהבתי ממש!", "timestamp": 1627023291936}, {"author": "אורם גולדובסקי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות, יואב מרצה טוב. הבעיה העיקרית היא שהוא לא מעלה את המצגות שלו (לפחות מהחלק הראשון של הקורס) ובו זמנית ממש מנסה שאנשים לא יתרכזו בלהעתיק אלא בלהקשיב גם כשיש נוסחאות ופיתוחים שכן צריך להעתיק. \n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: מתרגל ממש טוב, מסביר את החומר בצורה ברורה ונעימה ורמת העניין גם סבבה.\n\nשעורי הבית: לא קשים מדי. יבשים בעיקר ממבחני עבר ויש לרובם רפרנסים אבל שווה גם לנסות לבד. 3 רטובים, השני היה קצת קשה יותר אבל עדיין בסדר הראשון והשלישי ממש קלים.\n\nהמבחן: עשו מבחן קל מדי ואז רצחו בבדיקה, מה שממש מעצבן כי יואב ממש מדבר על איך שמבחנים לא בודקים הבנה והוא לא אוהב את זה ואז פשוט הוריד מלא נקודות על שטויות כדי להוריד ממוצא במועד א וכשמלא ערערו הוא כעס על הנציג סמסטר ואיים שיוריד נקודות אם יהיה ספאם של ערעורים. יכול להיות שבגלל זה יחזור לאיך שהיו המבחנים עד ללפני כמה סמסטרים (הרבה יותר מגעילים וחישוביים מאשר הבנתיים)\n\nהשורה התחתונה: קורס מעניין ומומלץ, יש חסרונות וקצת בעיות אבל בסהכ עדיין שווה את זה", "timestamp": 1628199475227}, {"author": "Roy Mahlab", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: \nהיה די מיותר מבחינת ידע, התרגולים מספיקים וגם מסבירים כמו שצריך כמעט הכל.\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: \nמתרגל מעולה לדעתי, מסביר ברור ובאופן הכללי התרגולים בנויים טוב.\nשעורי הבית: \nמגניב לעשות אותם.\nהמבחן: \nבמבחן היה משהו שהוא דיבר עליו רק בהרצאות, חוץ מזה לא קשה מדי.\nהשורה התחתונה: מאוד ממליץ", "timestamp": 1634829750968}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: ישראל מרצה בסדר ולא יותר מזה. קופץ מנושא לנושא לא כל כך ברור הסדר שבו עוברים הדברים ומה קשור למה. באופן כללי הוא נותן אווירה טובה בכיתה ונראה שבאמת אכפת לו מהסטודנטים.\n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: מתרגל טוב. מסביר את החומר טוב, יש pdf יחסית טובים של התרגולים. \nהתרגולים הרבה פעמים לא קשורים להרצאות, ומלמדים חומר בנוסף להרצאות.\n\nשעורי הבית: 6 תרגילי בית יבשים. לא כל כך ברורים. רובם ממוחזרים ו/או ממבחני עבר.\n3 גיליונות רטובים, הרטוב הראשון ארוך ומעיק, השאר יותר חביבים. גם ממוחזרים.\n\nהמבחן: כל סמסטר החומר שונה, גם ישראל עצמו מעביר בכל חורף נושאים שונים, אז קשה ללמוד למבחן כי אתה נתקל בשאלה ממבחן עבר, וקשה להבין אם אתה לא יודע את החומר או שזה פשוט משהו שלא למדנו.\nבסוף המבחן יחסית קליל ולא מאוד מסובך, אבל מחפשים על מה להוריד.\n\nהשורה התחתונה: קורס אוברייטד ממש. בכל מקום התגובות מהללות אותו, אז לא. קורס חביב ולא יותר. מרגיש שלומדים הרבה נושאים אבל שום דבר לא באמת לעומק. לא מרגיש כמו קורס שהעשיר אותי יותר מידי. לא מרגיש שהרווחתי מהקורס כלים חשובים ושימושיים שאני אקח איתי להמשך.", "timestamp": 1646597403209}, {"author": "--", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: ישראל מרצה מצוין! היה תענוג להקשיב להרצאות שלו. מדבר בתשוקה, בהתלהבות ובעניין רב, משקיע מאוד ומשתדל להלהיב את הסטודנטים לתחום. באמת אחד המרצים הכי טובים בטכניון!\n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: מתרגל מאוד טוב! מסביר בצורה מאוד עניינית וכיפית.\n\nשעורי הבית: 6 יבשים ו-3 רטובים. רלוונטיים להבנה של הקורס ולא לוקחים יותר מדי זמן.\n\nהמבחן: מבחן לא קשה. היה יחסית נוח.\n\nהשורה התחתונה: קורס מעניין מאוד! מרגיש שהרווחתי כלים חשובים ושימושיים שאקח איתי להמשך הדרך!", "timestamp": 1647371707663}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: ישראל מרצה מעולה! מדבר בתשוקה ובהתלהבות, שומר על אווירה טובה, משקיע מאוד ובאמת משתדל להעשיר את הסטודנטים ולתת בסיס טוב לתחום. בנוסף, מאוד אכפת לו מהסטודנטים. חשוב לו שכולם יבינו ויצליחו. בשעות הקבלה הוא עונה באריכות, בפירוט ובשיא האכפתיות.\n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: מתרגל ממש טוב, מסביר את החומר בצורה ברורה ונעימה.\n\nשעורי הבית: מדי. 6 יבשים בעיקר ממבחני עבר ויש לרובם רפרנסים 3 רטובים די קלים.\n\nהמבחן: ברמת קושי סבירה והגיונית. \n\nהשורה התחתונה: קורס מעניין ומומלץ מאוד! אהבתי ממש!", "timestamp": 1647371859855}, {"author": "----", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: מרצה מדהים, מעניין, מאוד משקיע וסבלני. \n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: תותח!\n\nשעורי הבית: 6 תרגילי בית יבשים ו-3 גיליונות רטובים. תורמים להבנת החומר הנלמד.\n\nהמבחן: לא קשה במיוחד. מקשיבים בהרצאות ובתרגולים, לומדים טוב ומצליחים.\n\nהשורה התחתונה: קורס מאוד מעניין ופרקטי, מומלץ ביותר למי שהתחום קורץ לו.", "timestamp": 1647372057641}, {"author": "DFT", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: אם יואב מעביר את הקורס - אל תקחו\nמעבר לזה שהוא מרצה ממש גרוע ומתפזר מאוד, הוא עושה כל מה שאפשר כדי להקשות\nמחק את כל ההקלטות, לא הסכים לשדר בזום, נסע באמצע הסמסטר לשבועיים כשההרצאות גם ככה היו בפער ולא דאג להשלים\n\nשם המתרגל/ת: אלעד הירש\nחוות דעת - תרגולים: מתרגל מעולה\n\nשעורי הבית: יבשים שלוקחים כמה שעות ו3 רטובים בפייתון שכל אחד לוקח 3 ימים\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: לא עם שכנר", "timestamp": 1654784177778}, {"author": "יונתן לונברג", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: \nקורס מאוד מוזר, בהתחלה יש תחושה שלא לומדים כלום, לצורך העניין יואב השקיע איזה 2 שיעורים שלמים להסביר על מה זה לינאריות ועוד כל מיני דברים בסיסיים שלמדנו כבר 20 אלף פעם. ההרגשה בהתחלה היא שפשוט זורקים עלייך פרטי מידע רנדומלים על עיבוד תמונה. הסיבה לכך היא שאין באמת סדר והמצגות של יואב הם לא באמת מצגות. הוא שם לעצמו איזה תמונה כלשהי/משוואה כלשהי שמעירה לו איזה איזור מסויים במוח ומעלה לו איזה זיכרון שלו באיזה נושא מסויים ואז הוא מדבר עליו. אחרי זה מרגיש קצת (דגש על קצת, ממש קצת) יותר מסודר, ונלמדים עוד נושאים בסיסיים בעיבוד תמונה. בקיצור, הוייב מההרצאות הוא שיואב מדבר על איזה נושא ואומר מה שעולה לו בראש באותו הרגע אבל הנושאים כשלעצמם הם חשובים ומעניניים.\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nאחלה\nשעורי הבית: \n3 רטובים, עמוסים מאוד אבל מלמדים מאוד וממש מגניבים, מראים פרקטיקה וממש נוגעים שם בידיים בעיבוד בתמונה.\nיש גם יבשים\nהמבחן: \nקל יחסית\nהשורה התחתונה: \nאולי זה היה נשמע רע, אבל זה קורס בסהכ ממש חמוד, מרגיש קצת כמו מלג, כי יש תחושה של חוסר רצינות. נותן היכרות נחמדה עם עיבוד תמונה קלאסי.\n לדעתי שווה לקחת כי :\n1. זה מכיר לך את המושגים ואת הדברים הבסיסיים בעיבוד תמונה, אפשר אחרי הקורס להבין קצת יותר מה זה עיבוד תמונה ואת הפוטנציאל שיש לזה בתור משהו שימושי.\n2. זה קדם לאלגוריתמים ויישומים בראיה ממוחשבת שהוא קורס שאי אפשר לוותר עליו (מבחינת עניין). שם לומדים עיבוד תמונה כמו שצריך אבל ענת הוא קדם שלו (ולא רק בירוקרטית, עדיף לבוא לקורס כזה אחרי ענת).", "timestamp": 1657666606034}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: \nהרגיש מאוד מיותר, הרבה בזבוזי זמן של ראיית סרטונים ופיתוחים בתעשייה. לא עוזר בהכנה למבחן ונותן רקע מועט לחומר האמיתי שמועבר בתרגולים.\nבנוסף, מתוך איזה עקרון החליט לא לפתוח זום או להקליט כדי להכריח סטודנטים להגיע להרצאות.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nמתרגל מצויין, מעביר את החומר בצורה ברורה מאוד.\nהבעיה היחידה שהרבה מהשאלות בתרגולים מתבססים על הסגנון של השאלות שניתנות בקורס שמועבר בחורף ששונה מאוד מהסגנון של המבחן באביב, מה שיצר פער בין השאלות בתרגולים לשאלות במבחן.\n\nשעורי הבית: \nלא פשוטים בכלל, בתור מישהו עם קצת ניסיון בפייתון, השיעורי בית הרטובים לוקחים שעות עם הרבה עזרה מגוגל.\nהשיעורי בית היבשים סבירים וגם בדומה לתרגולים מתבססים בחלק על שאלות ממבחנים שמועברים בחורף ששונים מאוד בסגנון מהמבחנים שמועברים באביב.\n\n\nהמבחן: \nבין 9 ל13 שאלות קצרות, אורך מבחן של שעתיים.\nלדעתי, לא מייצג בצורה טובה את החומר שלמדנו בתרגולים, עם הרבה אינטואציה וקפריזות של המרצה, אווירה של פסיכמוטרי שאין מספיק זמן להכל.\nהממוצע לדעתי משקר, כי הבדיקה נעשית באופן מוזר כאשר סטודנטים מסוימים כותבים את אותה תשובה לשאלה ומקבלים ציון שונה עליה, ניכר שבבדיקה עושים מאמצים שההסיטוגרמה תצא יפה.\nבנוסף לכל זה הבדיקה מאוד קפדנית.\n\nהשורה התחתונה: \nנכון להיום לא הייתי ממליץ לקחת את הקורס באביב, כי מבנה המבחן השתנה באופן דרמטי ואין באמת דרך להבטיח בו ציון נורמלי כין מספיק מבחנים בסגנון הנ\"ל לתרגול.", "timestamp": 1663236729783}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: לא מבינה מה עפים, לא כזה מרצה טוב בעיני.\nלמרות שבתחילת ההרצאה הוא אומר מה הולכים לעשות היום כדי שיסתדר לנו בראש,\nנראה שהוא לא מבין מה סטודנטים לא מבינים ולא מראה מוטיבציה למה להשתמש בדברים שהוא מראה. לא מסביר את הדברים שנותנים הקשר - כנראה הם נראים לו טריוויאלים\n\nשם המתרגל/ת:  אלעד ואמיר\nחוות דעת - תרגולים: ראיתי מוקלט והם חילקו את התרגולים המוקלטים\nהיו בסדר, הסבירו טוב\n\nשעורי הבית: רטובים עמוסים, במיוחד הראשון\nיבשים בסדר כזה - הם תמיד דופקים שאלה שאין לך מושג איך לפתור אותה (נגיד אלגוריתם שהזכיר בשני משפטים בהרצאה ולא הראה איך וצריך להראות בשיעורי בית)\nלקח לי זמן להבין שכנראה הם רוצים שנחפש באינטרנט ונבין בעצמנו ודברים בסגנון. צאט גיפיטי הוא חבר טוב כאן\n\nהמבחן: סבבה כזה, היו שאלות טריקיות וקשות אבל נראה\nבגדול לומדים מליון נושאים בקורס ושלושתרבעי מבחן על קוונטיזר - מאוד מוזר\n\nהשורה התחתונה: ציפיתי להרבה יותר מהקורס הזה\nבסוף קיבלתי תחושה שלימדו אותי חוברת מתכונים ולא לימדו מספיק למה משתמשים בהם. לא עפתי", "timestamp": 1676575585318}, {"author": "natan borkowski", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: מעביר את ההרצאות בהרבה ניפנופי ידיים , כל התאוריה עוברת ברמת ההסברים ללא דוגמאות למשהו מעשי, ככה שמגיעים להגשות ופתרון מבחנים ואין מושג איך להתחיל\n\nשם המתרגל/ת: אלעד-אמיר\nחוות דעת - תרגולים: אלעד ממש טוב, מעביר את החומר כמה שהוא יכול לרמה שנבין מה לעשות , אבל החומר לא בנוי ככה.\nאמיר פחות מומלץ אם רוצים להבין מה קורה\n\nשעורי הבית: יבשות שאלות ממבחנים, סביר.\nרטובים ארוכים מאוד! ללמוד לבד להשתמש בספריות של עיבוד תמונה בפייתון\n\nהמבחן: פתיר אבל עמוס מאוד,\n\nהשורה התחתונה: קורס עם חומר חביב, לא מועבר טוב", "timestamp": 1676972106314}, {"author": "יובל הופמן", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: מסודר וברור. לא הכי כריזמטי, אבל הסדר מחפה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יבשים ורטובים. עמוס, אבל לא זוועה.\n\nהמבחן: המבחן היה סבבה, הבדיקה פחות :(\n\nהשורה התחתונה: נראה כמו נושא חשוב. שמעתי שיש אנשים שממליצים לקחת באביב - אז כדאי לשקול.", "timestamp": 1678036857488}, {"author": "נפוליאון", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יואב שכנר\nחוות דעת - הרצאות: התיאור הכי מדויק של יואב הוא באחת התגובות הקודמות עם האזורים שנדלקים במוח. קשה להבין מההרצאות במה חשוב להתעמק ומה אפשר להחליק, במיוחד שבערך חצי הרצאה הולכת על שיעורי היסטוריה והרכבים של להקות. אין ברירה מלבוא פרונטלי כי הוא לא מאמין בהקלטות והחומר משתנה( באופן מועט אך מורגש) בין החורף לאביב. סך הכל יש אווירה טובה של מל\"ג לא עמוס.\n\nשם המתרגל/ת: אמיר/ אלעד\nחוות דעת - תרגולים: לא הצלחתי להבין מי עדיף עד סוף הסמסטר. חשוב לציין שהקורס הועבר באנגלית פעם ראשונה והאנגלית של אמיר טובה יותר אך בכל מקרה ניכר שהעברת החומר באנגלית מגבילה את שניהם בהסברים ולכן גם מהתרגולים קשה לצאת עם הבנה מלאה של החומר. מומלץ לחפש הקלטות של אביבים קודמים בעברית, יכול לעשות הבדל משמעותי. יש גם סדנאות אבל לי אישית לא היה זמן ללכת, הבנתי שבעיקר עובדים על קוד פייתון אז זה יכול לעזור בתרגילי בית/ בשאלת פייתון במבחן.\n\nשעורי הבית: 3 רטובים ארוכים, להתחיל מוקדם ככל האפשר ולא להסתבך עם סינטקס, יש gpt.\n\nהמבחן: PTSD לפסיכומטרי עם 9 שאלות מונפצות בשעתיים. יש כאן קושי נסתר של לתרגל הבנה מהירה של שאלות באגלית שפוגשים רק בשיעורי בית ובמבחן. סך הכל שואלים על כל הנושאים לאורך הסמסטר וככל הנראה להרבה שאלות מקבלים הרבה פתרונות, אבל חשוב מאוד לנמק כל מעבר ברמת סמסטר א' כי אולי הפתרון שכתבתם יתקבל אבל ישחטו אותכם על נימוקים ומעברים. יש שאלה לכתוב קוד פייתון והרבה אלמנטים דומים להסתברות ולומדות.", "timestamp": 1695372700255}, {"author": "אורי משהו", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שכנר\nחוות דעת - הרצאות: \nהוא די מצחיק, משמיע גם שירים וקטעים מסרטים תוך כדי, אבל אני לא כל כך הצלחתי להבין מה החומר של הקורס מההרצאות. אולי זה גם בגלל האנגלית שלי.\nשם המתרגל/ת: לא זוכר, אבל הוא היה האחראי\nחוות דעת - תרגולים: \nהוא היה ממש טוב, ממנו הבנתי את כל הקורס. \nשעורי הבית: \nהרטובים מוזרים אבל כשמסיימים אותם הם ממש כיפיים ומגניבים. היבשים גם מוזרים וכשמצליחים אותם הם פחות כיפיים ומגניבים.\n\nהמבחן: \nהיה סבבה, בגלל שהקורס היה באנגלית המבחן גם היה באנגלית ולקח קצת זמן עד שעניתי על כל שאלה.\nהשורה התחתונה: \nאחלה קורס, מצפה לקורס הבא כי בזה לא למדנו הרבה.", "timestamp": 1705346017541}, {"author": "א.ל", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ישראל כהן\nחוות דעת - הרצאות: מסודר. \n\nשם המתרגל: אלעד הירש\nחוות דעת: מתרגל טוב ומאוד סבלני . עונה לכל מייל ששלחתי לו ומסביר טוב.\nהתרגולים עצמם לא נוגעים בהרבה נקודות שיש במבחנים.\n\nשעורי הבית: יבשים ורטובים עמוסים.\nחלק מהיבשים הם שאלות שב וכדאי לעשות אותם . את הרטובים אפשר לרפרנס\n\nהמבחן: מכיוון שהוא מעביר רק בחורף אז כדי לעבור על הרבה מבחנים צריך לפתור מבחנים מלפני כמה שנים ובחלקם יש חומר שלא רלוונטי.\nתתכוננו שבמבחן עצמו יתנו שאלה מונפצת להוריד ממוצע.\n\nהשורה התחתונה: חומר מאוד מעניין . חבל שהפער בין ההרצאות והתרגולים לבין המבחנים הוא גדול. \nזה לא מהקורסים שהעלו לי את הממוצע .", "timestamp": 1716218992158}]}