{"posts": [{"author": "Cobra 1199", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: Aviv Tamar\nחוות דעת - הרצאות: Useful insights, good structure\n\nשם המתרגל/ת: Omer Shalev\nחוות דעת - תרגולים: Good overall, sometimes a bit dry\n\nשעורי הבית: Learned a lot\n\nהמבחן: not done yet\n\nהשורה התחתונה: Denavit Hartenberg :D", "timestamp": 1675532043423}, {"author": "natan borkowski", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: \nהחומר חמוד ולא יותר מדי מסובך למי שמתחבר-\"רואה\" גאומטריה מרחבית. חומר בכללי לא קשור לשום דבר של הנדסת חשמל למעט בקר PID ל2 הרצאות, כל השאר זה הנדסת מכונות ואלגוריתמים לתכנון תנועה=מדמח. \nהמרצה לא מהטובים שהיו לי , אבל בסדר גמור\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: תרגולים מורידים את החומר ממש לפרקטיקה שעוזרת להגשות והמבחנים. ברמה שלפתור תרגיל זה כמעט העתק הדבק מהתרגול\nעומר נחמד ועושה רושם שרוצה להעביר את החומר ברמה הכי טובה\n\n\nשעורי הבית: הגשות יבשות חצי מרופרנסות, וגם מה שלא טכני לגמרי. 3 הגשות רטובות שהראשונה אמורה לתת נחיתה רכה למערכת ROS , אבל ממש לא מצליחה לעשות את זה. כל רטוב ממש ארוך, הוראות לא ברורות ולא באמת מלמד משהו למעט ניסיון מעשי בROS\n\nהמבחן: \nברמה הוגנת לדעתי\n\nהשורה התחתונה: מי שמתעניין ברובוטיקה קורס מומלץ, מי שמחפש קורס לסגור שרשרת לא", "timestamp": 1676971833448}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: עומר (שהיה עד כה המתרגל האחראי בקורס) העביר אותן בצורה טובה, תמציתית ומובנת. בנוסף היה אפשר לשאול אותו שאלות תוך כדי ההרצאות והוא היה עונה תשובות ענייניות. היה שווה להגיע להרצאות שלו.\n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: אחלה בחור ברמה האישית, העביר את התרגולים יחסית מהר ככה שהיה קשה לעקוב אבל כן היה לו מאוד חשוב לעצור לוודא שכולם מבינים את החומר, וזה כן היה ניכר לחיוב.\n\nשעורי הבית: \nהיו 4 יבשים ושני רטובים. הרטובים היו די מבאסים וארוכים (בעיקר השני) והיבשים היו יחסית בסדר (כמה שעות עבודה כל אחד).\n\nהמבחן: כשלמדתי למבחן התכוננתי לקבל נכשל מרוב שהמבחנים משנים קודמות היו הזויים. אבל המבחן במועד א' היה הוגן באופן מפתיע ושאל אשכרה שאלות שהופיעו בחומר של הקורס, ולא מעבר לזה. אני חושב שהסיבה היא שעומר המרצה האחראי, ואם הוא המרצה האחראי גם בסמסטר שלכם יותר סביר שהמבחן יהיה הוגן.\n\nהשורה התחתונה: סך הכל סבבה אבל פחות מעניין ממה שחשבתי שיהיה, החומר עוסק בעיקר בפיזיקה וקינמטיקה של רובוטים מאשר דברים שקשורים לאלגוריתמיקה או בקרה (יש מעט עיסוק בנושא בסוף הקורס).", "timestamp": 1715186005657}, {"author": "Ido", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עומר שליו\nחוות דעת - הרצאות: הרצאות נחמדות מעניינות\n\nשם המתרגל/ת: עדי \nחוות דעת - תרגולים: תרגולים נחמדים, מועברים כמצגת. רק צריך לשים לב אם מביאים נוסחא ללא פיתוח - אז לראות שאתם זוכרים או יודעים איך הגיעו לפתרון. כלומר, חסר בתרגולים פיתוחים מתמטיים. \n\nשעורי הבית: כמעט זהים לסמסטר קודם. השיעורי בית היבשים דווקא תורמים להבנה של החומר, ואילו הרטובים מרגישים כמו בזבוז זמן משמעותי על עבודה בROS.\n\nהמבחן: המבחן מועד א׳ שלנו היה 4 שאלות, כאשר הרגיש יחסית פיירי. היו בו כמה שאלות של בקרה שפחות נגעו בהם בסמסטר, והיו מבוססות על ידע קודם (אותות ומערכות/בקרה 1).\n\nהשורה התחתונה: לא ברור לי איך בבחינות העבר הממוצע היה כה גבוהה. היו מבחנים שבעיניי לא פתירים. בחלק מהתשובות הרשמיות של מבחני העבר יש שגיאות. \nלמי שלא מתעניין או צריך לקחת את הקורס, אני לא ממליץ עליו.", "timestamp": 1715508258903}, {"author": "~", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: עומר שליו\nחוות דעת - הרצאות: עבורי ההרצאות היו מאוד קשות למעקב, אמנם עומר מרצה חביב וקשוב לסטודנטים, אך הוא מאוד מונוטוני באופן העברת החומר וטון הדיבור, עליי זה הקשה על הריתוק להרצאה והבנת החומר.\n\nשם המתרגל/ת: עדי לוי\nחוות דעת - תרגולים: כמו שנכתב מקודם ניכר כי חשוב לעדי שכולם יבינו, עם זאת התרגולים עוברים ברפרוף לפעמים.\n\nשעורי הבית: יש יבשים ורטובים. יבשים עשויים להיות קשים אם לא מבינים את החומר. רטובים מעיקים מאוד, הם מלמדים על עבודה עם ROS ובפועל לא מובנים, ולא ברור איך אפשר להצליח בהם בלי רפרנס צמוד / chatgpt.\n\nהמבחן: סך הכל הוגן.\n\nהשורה התחתונה: למי שמחפש לטעום מעולם הרובוטיקה (ולא מתמטיקה), אני ממש לא ממליץ. הגעתי לקורס במטרה להבין בצורה הנדסית ופרקטית את עולם הרובוטיקה, ונשארתי עם חומר מתמטי לחלוטין ולא מעניין. לא הייתי לוקח את הקורס בדיעבד, לא נתן לי שום ערך ולא נהניתי ממנו לאורך הסמסטר. אם אתם מחפשים טעימה פרקטית מעולם הרובוטיקה - הייתי בודק את קורס \"רובוטים ניידים\", הטענה היא שהוא נותן מבט פרקטי וכנראה מעניין יותר.\nאם אתם כן מחפשים טעימה מתמטית מהעולם הזה - הגעתם למקום הנכון.", "timestamp": 1718685102611}]}