{"posts": [{"author": "Elad K", "semester": "201901", "text": "לדעתי קורס נוראי ביותר. אולי היסטוגרמה טובה אבל ויש אבל גדול- כל צורת העברת החומר היא בגדר ססמאות וכותרות חלולים. סטודנטים אמרו שרק אחרי שקראו מאמרים (wtf זה רק תואר ראשון) הצליחו להבין בקצת. ש.ב תלושים מהמציאות. צוות עם כוונה טובה אבל ביצוע מינוס.", "timestamp": 1590919506000}, {"author": "ג.ג", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ' שחר קוטינסקי\nחוות דעת - הרצאות: \nהנושא מרתק בעיני. לומדים על תחום חם מאוד כרגע הן במחקר והן בתעשייה. במהלך ההרצאות הועברו מספר בחנים לוודא הקשבה במהלכן, מה שמכריח אותנו בתור סטודנטים להישאר על החומר - מאוד מוצלח בעיני. \nבנוסף היו הרבה הרצאות אורח שחושפות אותנו לעוד תחומים ויישומים לממריסטורים. \n\nשם המתרגל/ת: רותם בן חור\nחוות דעת - תרגולים: \nתרגולים במודל כיתה הפוכה, מוצלח מאוד בעיני. בכל תרגול עברנו על סרטון שרותם פרסמה, ואז בכיתה עבדנו בקבוצות קבועות על פתרון התרגול. בצורה הזאת כל הקבוצה למדה hands on במהלך השיעור. \nשעורי הבית: \nהקושי העיקרי הוא ללמוד להתמודד עם וירטוסו. מעבר לכך, לפעמים קצת קשים יותר מהתרגולים או מההרצאות, אבל מלמדים מאוד ומחדדים את הנושא. \nהמבחן: \nלא קשה במיוחד, מומלץ לעבור על ההרצאות והתרגולים לפני פתרון המבחנים (אין יותר מידי מבחנים 5-6 נכון להיום)\n\nהשורה התחתונה: הקורס הכי מעניין שלקחתי בלימודים.", "timestamp": 1614282220436}, {"author": "א.א.", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nאחד המרצים היחידים בטכניון שיודעים ללמד. שיעורים מסודרים, חומר מסודר, סיכומי ביניים שעוזרים לקלוט טוב את החומר, וקאהוטים כל שיעורי בשביל לשחרר לכם דופמין כדי שתרצו להתרכז. בנוסף לכל זה, החומר של הקורס זה בערך החיים שלו אז הוא מלמד בתשוקה. החומר עצמו מעניין מאוד, אמנם יש תחושה שהתחום יותר מחקרי מפרקטי כרגע, עדיין נחמד מאוד ללמוד.\nשם המתרגל/ת: רותם בן חור\nחוות דעת - תרגולים: \nבתרגולים פשוט יושבים ביחד ופותרים שאלות. הראשון היה ארוך מידי וזלג ממסגרת הזמן, וכל השאר היו מאוד קצרים ככה שהיה אפשר לסיים לפני. לפני התרגולים רותם שולחת סרטונים של גג 15 דקות עם חומר מקדים לתרגול. סה\"כ היא ממש אחלה.\nשעורי הבית: \nאחד מהקורסים היחיד בטכניון שמבין שהוא 3 נק\"ז ונותן שיעורי בית בסדר גודל הגיוני. קצת עבודה בוירטואוזו, וקצת לכתוב בוורד. עם רפרנס זה אפילו יותר מהיר, שימו לב שבזה שיש בדרייב יש המון טעויות (אולי זה שתול של הסגל).\nהמבחן: \nחומר פתוח - אולי הכי מיותר שיש, פשוט בזבוז של דיו ועמודים. המבחן יחסית קל, תסתכלו על ההיסטוגרמה. מה שכן הוא די אקראי, שואלים שאלות שלא ברור מאיפה הגיעו. סה\"כ מבחן לא מאיים מידי.\nהשורה התחתונה: \nמל\"ג מומלץ. אולי הבחירה הפקולטית הכי טובה שלקחתי בתואר.", "timestamp": 1648039693123}, {"author": "שחר+עילם 3>", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות:סך הכל טובות.שחר נוטה לרוץ על החומר,אבל זה באמת קורס שמלמד המון.נושאים-זכרונות,לוגיקה וכו'.בהתאם הקצב \nיש הרצאות אורח בקורס,כשאשר אחת מהם של עילם.מסתבר שיש על ההרצאה שלו המון שאלות אז תבינו את ההרצאה שלו טוב ואל תכחישו!\nשם המתרגל/ת: אוריין\nחוות דעת - תרגולים:תרגולים קצת מוזרים אבל זך הכל לומדים מהם.\n\nשעורי הבית:ש.ב 1 או 2 נוראיים.אחכ משתפר.ש.ב לא מרופרנסים ורטובים \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676901332767}, {"author": "ממריסטור לא אידיאלי", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: מרצה גרוע. מעביר את החומר בחפיף. כל המצגות זה גרפים לא ברורים ושום מילה או פירוט, קשה מאוד ללמוד מהן ולחזור על החומר. צריך לסכם את החומר במהלך השיעור, כי אחרת לא זוכרים כלום. כל ההרצאות הן סיסמאות באוויר ולא באמת לומדים שום דבר אמיתי.\n\nשם המתרגל/ת: אוריין ודונא הם התחלפו בין השיעורים אוריין חסר כריזמה ודיקציה, דונא אחלה.\nחוות דעת - תרגולים: תרגולים הפוכים לכיתה של 150 סטודנטים זה פשוט נורא. 20 דקות שהם מדברים על דברים שלא למדו בהרצאה, ואז תרגיל בית תקף שמתחילים בכיתה ומגישים 24 שעות אחרכך. בדיקה ע״י בקרת עמיתים מטענה שאין להם זמן וכוח אדם! זלזול ציני בזמן שלנו, כאילו הזמן שלכם יותר חשוב מהזמן שלנו. גיליונות לא ברורים שמטרתם ״ללמד אותנו את החומר״ שואלים שאלות על דברים שליטרלי לא שמענו אף פעם.\n\nשעורי הבית: בנוסף, 4 גיליונות רטובים בספייס/מטלב. הראשון היה נורא ולא ברור, אחרכך זה קצת השתפר. באופן כללי הניסוח לא היה ברור. סתם לשחק עם הפרמטרים ולראות איזה גרף אפשר להסביר אותו. גיליונות מיותרים.\n\nהמבחן: 65% מהציון ושחר בא לשחוט. מבחן מגעיל, שאלות לא ברורות, ניסוחים לא ברורים. שחר לא נכנס לכיתה אפילו לענות על שאלות, היינו צריכים להעביר דרך פתקים כדי שהוא חלילה לא יזדהם מאיתנו. \n\nהשורה התחתונה: קורס אחד הגרועים שלקחתי בתואר. שחר מרצה מתנשא ולא טוב. הוא לא רוצה ללמד. הוא אמר לנו שהוא התבאס שנרשמו לקורס 150 סטודנטים (קצת טקט אחי).\nבאמצע הסמסטר בשביל לעזור הם פירסמו חומרי עזר - כ-300 עמודים של מאמרים באנגלית. תודה, אבל לא תודה.\nתפעילו זרם חיובי - התנגדות תגדל, תפעילו זרם שלילי - התנגדות תקטן. זהו חסכתי לכם, אתם יודעים ממריסטורים.\nתעשו לעצמכם טובה, ואל תיקחו את הקורס הזה.", "timestamp": 1677013030870}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שחור קוטינסקי\nחוות דעת - הרצאות: \nההרצאות בעייתיות, שחר עובר על המצגת ומדבר על הרבה פיתוחים בתעשייה וגרפים שקשורים לחומר. אבל לא באמת מפתח את המשוואות או את החומר שנובע מן המצגות.\nבנוסף לזה הקול המונוטני שלו, יוצר מצב שהחומר לא נקלט בשום צורה מההרצאות.\nההקלטות אגב אותו דבר (עד שהוא החליט בכלל לשחרר אותן), רק שבהקלטות הכיתוב על הלוח הפוך אז גם שם לא מבינים כלום.\n\nשם המתרגל/ת: אוריאן\nחוות דעת - תרגולים: \nכביכול על הנייר ניסוי ליישם שיטה של כיתה הפוכה בה מעבירים 20 דקות תרגול, ואז 20 דקות עבודת כיתה ואז לאחר מכן המתרגל אמור לפתור את העבודת כיתה ביחד עם כולם.\nבפועל מה שקרה זה שאוריאן דיבר 10 דקות על המצגת במהירות בלי שבאמת מבינים משהו, שלח אותנו לעשות תרגיל בית בכיתה ולא טרח ברוב המקרים לפתור אותו אחר כך ביחד עם הסטודנטים.\nלקראת השבועות האחרונים הגישה השתנתה קצת, אבל זה היה כבר מאוחר מידי, ובאמת ללמוד את החומר צריך היה לעבור על הכל לבד. \n\nשעורי הבית: \nקצת הזויים, שילוב של ספייס ומטלב אם הרבה מלל שצריך לכתוב, כמובן שהכל באנגלית משום מה ושאין רפרנסים.\nלא הייתי אומר שהם קשים, פשוט מעיקים במיוחד לנוכח העבודה שלא לומדים כלום בתרגולים ובהרצאות אז השיעורי בית הופכים לסינית.\n\nהמבחן: \n4 שאלות, 2 שאלות של 30 שאלה של 25 ושאלה של 15.\nהמבחן הכי קשה שעשיתי בטכניון (וזה אחרי מבנה מערכות הפעלה).\nשילוב של שאלות מתקדמות מאוד בחומר ושאלות שלא מבינים  בכלל מה רוצים שנפתור. אין כמעט סעיפים שדורשים טכניקה אלא יצירתיות ופתרון בעיות ממריסטורים ברמה שמתקדמת מהקורס\n נראה שהאחרי ששחר היה מופתע בהרצאה הראשונה שנרשמו לקורס 130 סטונדטים (לא הבנתי למה זה מפתיע) הוא טרח גם להגיד לנו בהרצאה \"שהוא צריך לראות מה הוא יעשה עם זה\". אז בתוגבה הוא החליט להוריד את ממוצע הקורס מ85 בשנים עברו להרבה פחות (אעדכן כשיגיעו בציונים).\n \nהשורה התחתונה: \nפשוט אל תקחו את הקורס לא משנה מה.\nלא רק שהקורס משעמם בצורה לא נורמאלית, הסגל נוראי והמבחן לא פשוט כמו שהוא היה פעם, יש כל כך הרבה קורסי בחירה אחרים שיוכלו באמת לתת לכם כלים משמעותיים לתחומים רלוונטים ולא יורידו את הממוצע שלכם לרצפה.", "timestamp": 1677065502427}, {"author": "unipolar", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: \nלא הצלחתי להבין את החומר לעומק בהרצאות. שחר מעביר את השקופיות על הלוח ומסביר בצורה מאוד שטחית את החומר. \n\nשם המתרגל/ת: אוריאן\nחוות דעת - תרגולים: \nהתרגולים הם בשיטה של כיתה הפוכה. בחלק התיאורטי אוריאן עובר על המצגת במהירות הבזק, אסור אפילו למצמץ.\n\nשעורי הבית: \n4 תרגילי בית רטובים, שהם סבירים מינוס (לא תמיד הכי ברורים)\nיש תרגילי כיתה שהם קלילים ולא משקפים בכלל את מה שיהיה במבחן.\n\nהמבחן: \nנורא. סגל הקורס הראה את פרצופו האמיתי, כל מה שעמד לנגד עיניו היה להוריד את הממוצע, שאילת שאלות בשיטת הפתקים, תוך מענה מינימאלי לשאלות הסטודנטים.\n\nהשורה התחתונה: \nלא מומלץ!!!!!\nבהתחשב בזה שזה קורס בחירה בתוך שרשרת ולא קורס חובה, עדיף לקחת קורס אחר שסגל הקורס בו טיפה יותר מתחשב (לא חסרים קורסים אחרים).", "timestamp": 1677170847771}, {"author": "צ׳ואה", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: מרצה בסדר\n\nשם המתרגל/ת: אוריאן\nחוות דעת - תרגולים: סביר, הסביר את החומר בכמה דקות ואז לא באמת עשה יותר מדי. כיתה הפוכה של 130 סטודנטים.. \n\nשעורי הבית: לא עמוסים. דווקא נחמד שעברו לLtspice, יותר ידידותי מוריטואוזו. \n\nהמבחן: לפני שאדבר על המועד הנוכחי חשוב לי לציין שהלמידה למבחן לא פשוטה כמו שאולי השתמע מביקורות קודמות. נראה שיש מועדים שמורכבים מאוסף של שאלות לא קשורות שעל חלקן הסגל אפילו לא היה בטוח מה התשובה הנכונה בשעות הקבלה לפני המבחן. בנוגע למועד האחרון, אין ספק שהיה קשה יותר במטרה לצמצם את כמות הסטודנטים שיקחו את הקורס בשנה הבאה, זה התבטא בשאלות שלא היו מנוסחות טוב בכלל ושימוש בשיטת הפתקים. באופן לא מפתיע היה נורא.  \n\nהשורה התחתונה: קחו ביקורות שמהללות את הקורס הזה בערבון מוגבל נכון להיום. כנראה בדיקה מקלה + פקטור כשהקורס מספיק קטן. מבחינת עניין, לא ואו, יש קורסים מוצלחים יותר בשרשרת! כדאי לחשוב טוב טוב לפני שלוקחים את הקורס הזה. לדעתי היה אפשר להוסיף קדמים לקורס כמו מבוא לVLSI ומבנה מחשבים בשביל לצמצם את כמות הסטודנטים ולא ״לתקן״ במבחן, מאכזב.", "timestamp": 1677530420567}, {"author": "צ'ואה", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: \nשחר מעביר טוב את החומר, ניכר שהנושא חשוב לו מאוד.\nבתחילת הסמסטר מרגיש שהקורס הרבה באוויר בגלל שנוגעים בצדדים של התאוריה של הממריסטורים, אך לאחר מכן הקורס משתפר הרבה ומדברים על השימושים השונים. \nשחר דואג לדבר הרבה על הקשר של הנושא אל התעשייה, ועל הפתרונות לבעיות שקשורות לארכיטקטורת מחשבים היום.\nשם המתרגל/ת: אוריאן דונא ורותם\nחוות דעת - תרגולים:  \nמתרגלים סבבה, התרגולים בשיטת כיתה הפוכה, לפעמים לא הכי מובן אבל יש נכונות גבוהה מאוד מצידם להשאר ולהסביר.\n\nשעורי הבית: \nחוץ מתרגיל בית 1 שהיה קשוח, שאר התרגילים מלמדים מאוד ודי קצרים.. יום עבודה בערך. סהכ 4 תרגילים.\n\nהמבחן: \nהסמסטר לקחו 130 סטודנטים את הקורס (כנראה חלק גדול בגלל הממוצע של שנים עברו), שחר דאג להגיד כבר בשיעור הראשון שהקורס מיועד למספר קטן יותר אך בחר שלא לחסום את ההרשמה לקורס. \nהעובדה הזו גרמה לסגל לבנות מבחן שבפער יותר קשה משנים עברו.. לבסוף ניתנו 14 נקודות פקטור והממוצע של הציון הסופי לא השתנה בהרבה מסמסטרים שעברו.\nהשורה התחתונה: \nמי שמתחבר לנושאים של מבנה וארכיטקטורות מחשבים ו VLSI, לדעתי קורס חובה. הנושא בשלבי מחקר וכבר יש מספר חברות שנכנסו לתחום. עשוי לפתור בעיות גדולות בתחום של ארכיטקטורות מחשבים. בנוסף הקורס הרגיש כמו \"מסכם תואר\" כאשר יש שימוש במספר תחומים מקורסי עבר.\nבנוסף יש נכונות מאוד גבוהה מצד הסגל לעזור, בין אם זה בהנגשת הקלטות, חומרים נוספים, והמון שעות קבלה שכללו פתרון תרגילי בית קודמים. \nמומלץ מאוד ולא להרתע מהביקורות השליליות, מי שהשקיע לאורך הסמסטר הצליח.", "timestamp": 1678092638689}, {"author": "Tom", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שחר קווטינסקי\nחוות דעת - הרצאות: \nהרצאות מאוד מעניינות. שחר הוא חוקר מאוד חזק בתחום, ומספר על שימושים מאוד מעניינים בממריסטורים.\nשם המתרגל/ת: אוריאן\nחוות דעת - תרגולים: \nתרגולים קצת מבולגנים. מסבירים על החומר כמה דקות (לפעמים יש סרטונים שמבקשים לצפות בהם לפני השיעור), ואז בתרגול עצמו פותרים תרגילים יבשים, לא מאוד מסובכים.\nשעורי הבית: \nבנוסף לשיעורי בית בתרגול, יש 4 תרגילים יבשים, יכולים להיות קצת מבלבלים, אבל בסך הכל לרוב הם סבבה.\nלא מאוד עמוס\nהמבחן: \nבסמסטר הזה הרבה אנשים נרשמו לקורס, והרגיש שהיה ניסיון להוריד את הממוצע כדי שפחות אנשים ירשמו לקורס.\nהמבחן היה מאוד לא טריויאלי, אבל יש מגן גדול ופקטור, כך שבסופו של דבר הציון יצא טוב\nהשורה התחתונה: \nקורס מאוד מעניין, מראה כמה הרבה דברים מגניבים אפשר לעשות עם ממריסטורים, ממולץ (למרות שיש מצב שהמבחן יהיה לא קל)", "timestamp": 1678879279156}, {"author": "לא להתקרב", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שחר קוטינסקי\nחוות דעת - הרצאות: החומר מעניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: גרועים מבולגנים לא עוזרים בכלל \n\nשעורי הבית: חופרים מאוד גם כיתה הפוכה וגם תרגילי בית כמעט שבועיים דורש השקעה רבה מאוד מעבר לקורס של 3 נקז\n\nהמבחן: הכי קשה שהיה לי בתואר - וזה כי רצו להוריד את הממוצע. חבל על כל העצים שנקרטו בשביל להדפיס את כמויות החומר הלא נורמליות למבחן\n\nהשורה התחתונה: להתרחק להתרחק להתרחק הקורס הכי גרוע שלקחתי בתואר", "timestamp": 1679925801693}, {"author": "PCM", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שחר קוטינסקי\nשחר אחד המרצים המובילים בתחום. מלמד לא רע אבל ההרצאות מיותרות לרוב למבחן.\n\nשם המתרגלים: אוריאן ודונא\nהתרגולים היו בסגנון כיתה הפוכה בה פותרים את תרגילי כיתה שמהווים 10% מגן (עם רפרנס מסימיים תוך כמה דקות). \nהמתרגלים מאוד מקצועיים, דואגים לפרסם את הכל בזמן ומתחשבים בסטודנטים. שאפו להם.\n\nשעורי הבית: \nכמו כל עבודה עם מטלב וספייס, זה יקח המון זמן על שטויות אבל סך הכל לא הכי עמוס שיש.\n\nהמבחן: (היה פקטור 14 במועד א' ופקטור 15 במועד ב')\nלא אשקר, המבחן מנותק מהחומר של הקורס כמעט. 70% מחומר המבחן ניתן לפתור על ידי קורסים קודמים כמו מעגלים אלקטרוניים ומעגלים חשמליים. \nכל מה שצריך להבין זה שממריסטור זה נגד אשר משנה את התנגדותו כתלות בזרם שזרם בו ואז להשתמש בחלוקת מתח ומעגלים בסיסיים מקורסים הנ''ל כדי לפתור את השאלה. \n\nחלוקת ציון סופי:\n20% תרגילי בית (תקף)\n10% תרגילי כיתה (מגן)\n5% נוכחות בהרצאות (מגן)\n65% מבחן (תקף)\n\n\nהשורה התחתונה: \nקורס שאין בו חומר... במהלך הסמסטר מנסים לשכנע אותנו שיש את הרכיב הקסם הזה שכולם בתעשייה רוצים להשתמש בו...\n עכשיו במבט מישהו שסיים את הקורס (עם ציון מאוד גבוה כדי לא לחשוב שאני שונא את הקורס חס וחלילה) אני מרגיש שזה קורס ששחר פתח רק כדי לנסות לעשות משהו רווחי ממנו..\nאיך? יש לשחר איזה 7 פטנטים עם זכויות היוצר שלהם והם אגב הדברים שהוא מלמד בקורס הזה (למשל הוא מלמד את Magic Logic בקורס, שזה מימוש שערים לוגים בעזרת ממריסטורים, הוא המציא את זה לפי הפטנט שנמצא באתר שלו) נשמע לא אמין... \nהוא מלמד דברים שרק הוא בכל העולם כתב מאמרים עליהם, וזה נשמע מאוד לא אמין בעיניי... (ולא שיש איזה רעיון פורץ דרך בהם או משהו)\n\nקורס נועד לשיווק של \"המוצרים\" של המרצה, אבל תכלס לא רע לקחת את הקורס כי יש סיכוי גדול לקבל ציון גבוה.", "timestamp": 1680292992683}, {"author": "stdnt", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: הייתי בכל ההרצאות ואני לא חושבת שהנושא מעניין.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מתכונת כיתה הפוכה שבו מקבלים גיליון שאלות שצריך למלא. מי שלא מסיים לענות על התרגול בכיתה צריך להמשיך לענות עליו בבית.\n\nשעורי הבית: דורשים השקעה ועבודה עם LT SPICE\n\nהמבחן:  לא מזכיר את שיעורי הבית או את התרגולים. \n\nהשורה התחתונה: לא לקחת. הקורס מאוד מבולגן בעיני ולכן היה לי מאוד קשה ללמוד למבחן. \nהרמה של המבחן הייתה לא מייצגת והממוצע של הסמסטר שלנו *רק במבחן* היה ככ נמוך (משהו כמו 50~) שהיה פקטור של 14 נקודות. רק בתוספת ש.ב והפקטור הגענו לממוצע 80...\nקורס מאכזב שלקחתי רק בגלל כל ההמלצות כאן מסמסטרים קודמים.", "timestamp": 1684181220895}]}