{"posts": [{"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל נמירובסקי\nחוות דעת - הרצאות: \nהחומר לדעתי מאוד מעניין אבל פחות התחברתי להרצאות של יעל, היא גורמת לדברים יחסית פשוטים להישמע מסובכים והמצגות של מאוד לא ברורות\nשם המתרגל/ת: איתמר פריאל\nחוות דעת - תרגולים: \nמתרגל מעולה, זו השנה הראשונה שהוא תרגל והוא השקיע המון ועזר והסביר בכל מה שצריך\nשעורי הבית: \nקצת ארוכים אבל ממש עוזרים להבין את החומר\nהמבחן: \nהמבחן בדרך כלל מאוד טכני והשנה היה קצת יותר חשיבתי וקשה יותר, עדיין לדעתי המבחן הוא די סביר ביחס לקורסים אחרים\nהשורה התחתונה: \nמי שמעניין אותו הנושא של איך עובד גלאים ובפרט פיקסלים אני מאוד ממליץ", "timestamp": 1678449960964}, {"author": "האקר איראני", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל נמירובסקי\nחוות דעת - הרצאות: יעל מעבירה את הקורס באופן מסורתי כבר שנים, לצערי ההרצאות שלה לא טובות, עוצמת הקול שלה לא מספיק חזקה, הדברים שנאמרים לא מסודרים וברורים, המצגות לא מסודרות עם כפלים בשקופיות ושקופיות שמדלגים עליהם, הגדרות שמופיעות בקורס לא מרגישות מספיק מסודרות - בכל הקשור בהגדרות רעשים בעיקר.\n\nשם המתרגל/ת: איתמר פריאל\nחוות דעת - תרגולים:  מתרגל טוב, התאמץ מאוד לאורך הסמסטר כדי שיהיה כמה שיותר מובן לסטודנטים ולהנגיש את כל הקורס עם הקלטות / הפעלת זום של תרגולים ושל הרצאות.\n\nשעורי הבית: 5 גליונות יבשים שצורכים קצת זמן אבל לא סופר עמוס.\n\nהמבחן: המבחנים חוזרים על עצמם ויש די הרבה מחזור, אז עם מספיק תרגול אפשרי מאוד להוציא 85+ (גם לא עבור מצטייני נשיא)\n\nהשורה התחתונה: הקורס מאוד מאוד רחב בנושאים שהוא נוגע בו אז אין שום נושא שאתה מרגיש שאתה שולט מאוד אבל אני מניח שזו המטרה - חשיפה ראשונה לעולם הגלאים, בנושא הזה הוא עשה עבודה טובה ואני מרוצה שלקחתי את הקורס כי באמת עניין אותי העולם הזה.", "timestamp": 1679080556775}, {"author": "~", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל נמירובסקי\nחוות דעת - הרצאות: מצתרף לתגובות הקודמות. הרצאות מאוד לא ברורות, עם שקפים לא מסודרים ודיבור בקול שממש לא עוזר להשאר מרוכזים.\nאני אחרי 3 שבועות עברתי לראות את ההקלטות\n\nשם המתרגל/ת: איתמר פריאל\nחוות דעת - תרגולים:  מתרגל מעולה. פעם ראשונה שמעביר את הקורס (וכניראה גם ישאר איתו) ועשה את זה בצורה מעולה. ללא ספק עזר לסגור את כל הפינות שיעל לא העבירה בצורה ברורה\n\nשעורי הבית: 5 גליונות לא קצרים אבל גם לא מוגזמים וללא ספק עוזרים להבין את החומר\n\nהמבחן: 80 אחוז טכני, אם פותרים מספיק מבחנים גם בלי להבין אפשר לקבל 80 בכיף, השאר דורש קצת יותר הבנה אבל גם לא משהו מוגזם. מבחן הוגן בסך הכל.\nאצלנו איתמר החליטו קצת להגזים והמבחן היה ארוך מאוד אבל עדיין הוגן.\n\nהשורה התחתונה: קורס חביב מאוד ומאוד נהניתי ממנו. נותן חשיפה ממש טובה לתחום של הגלאים וללא ספק קורס חובה למי שמתעניין בתחום", "timestamp": 1679124001396}, {"author": "1", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעל נימרובסקי\nחוות דעת - הרצאות: להיות כנה, ראיתי את ההרצאות עד שבוע 3 בערך - תסיקו את המסקנות לבד.\n\nשם המתרגל/ת: שלומי בושר \\ איתמר (זה שהעביר לפני שנה)\nחוות דעת - תרגולים: איתמר (מוקלט) - מעביר את החומר בצורה מעולה ומאוד מופשטת ככה שמאוד נוח לקלוט את ההבנה של החומר דרכו.\nשלומי - מעביר את החומר קצת בhigh level ולכן טיפה קשה להבין חלקים מסוימים אבל נותן אחלה של אינטואיציות לפעמים ולרוב מסביר בצורה סבבה.\nאני שילבתי את שניהם במהלך הסמסטר; היה נושא ששלומי היה יותר טוב מאיתמר וההפך...\n\nשעורי הבית: 5 גיליונות, 3 ארוכים בטירוף, 2 יותר סבירים. \nבגדול קיימים להם רפרנסים וניתן לרפרנס בזהירות כי לפעמים מחליפים מספרים.\n\nהמבחן: המבחן זוועת עולם, אל תקשיבו לכל מי שכתב לפני. המבחנים   ק ש י ם   -אבל- ויש אבל גדול בסופו של דבר אם אתם מראים הבנה וגם אם יש לכם טונה טעויות חישוב אתם יכולים להשיג אחלה של ציון וגם בסוף הבדיקה מקלה מאוד עם פקטור (זאת הסיבה לציונים הגבוהים יחסית).\nדיסקליימר: החוות דעת הזאת היא ממשהו שהשקיע 40% במהלך הסמסטר ומתוך ה40% האלו 90% הלכו להבנה של התרגולים והתעמקות ורק 10% לש.ב - כלומר אולי משהו שממש השקיע והגיע לתרגל מבחנים אז יהיה לו יותר קל ויותר סביר. \nאבל בגדול המבחנים שוב אני אומר הם קשים בטירוף עם מלא טריקים ודברים קטנים ומאודדדדדדדד ארוכים.\n\nהשורה התחתונה: בגדול אני ניטרלי אבל קחו בחשבון שאם אתם לוקחים את הקורס הזה, אתם סופר חייבים לצאת מאזור הנוחות שלכם בלמידה למבחן ולהפנים מראש שזו הולכת להיות חוויה קשה ולא נעימה.", "timestamp": 1715062211169}, {"author": "גלאי פוטוני קוונטי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מחזק את מה שנאמר לפני, אישית וויתרתי אחרי ההרצאה השניה\n\nשם המתרגל/ת: שלומי\nחוות דעת - תרגולים:  מתרגל טוב, שולט בחומר. קיימים PDFים לתרגולים שהם מאוד מפורטים ובתכלס למדתי את החומר משם, יש כמה נושאים קטנים שלא מועברים בתרגול אבל למדתי אותם ממבחנים ולא הרגשתי שהיה משהו שחסר\n\nשעורי הבית: 5 גיליונות יבשים, קצת ארוכים, מאוד עוזרים להבנה ובתכלס ברמה דומה למבחן, אז כדאי להשקיע (לא לרפרנס על עיוור כן? הם ידעי ותקבלו 0), 25% מגן\n\nהמבחן: מבחן הוגן, דומה למועדים קודמים, לא אומר שקל, פשוט צריך לפתור הרבה מבחנים ולהבין טוב טוב מה שעושים. בדיקה מקלה.\n\nהשורה התחתונה: קורס טוב , נותן מבוא לתחום מעניין, אני נהניתי, אם מעניין אותכם לדעת כיצד עובדים גלאים\\חיישני תמונה וכו אז הוא סבבה, אחרת אם זה סתם לצבירת נק\"ז אז יש קורסים יותר קלים", "timestamp": 1715240585017}, {"author": "---", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יעל נמירובסקי \nחוות דעת - הרצאות: יעל מרצה מאוד נחמדה ועם מלא ידע שהיא מנסה להעביר, אך הבעיה שלפעמים קשה לא לאבד ריכוז איתה. אבל בהחלט שההרצאות כן תורמות מאוד להבנה ואפשר להיעזר במוקלטים כי גם ממש עוזרים להבין במידה ומפספסים משהו בהרצאה.\n\nשם המתרגל/ת: שלומי בושר\nחוות דעת - תרגולים: שלומי מתרגל מעולה ועם הרבה ידע בתחום, כל מה שלא ברור בהרצאות הוא מסביר בתחילת התרגול והכל נהיה יותר ברור. \n\nשעורי הבית: יש 5 גיליונות, לרוב ממוחזרים עם שינויים קלים ומקנים 25% מגן. כדאי לנסות לפתור אותם כי הם ברוח של שאלות מבחן וגם בגלל שהמגן גבוה אז למה לא. חשוב להדגיש שצוות הקורס בודקים את כל הגיליון וממש מקפידים לבדוק אם היה העתקות לכן אם מתכננים להיעזר ברפרנסים, שימו לב לא להעתיק על עיוור.\n\nהמבחן: מחזקת את מה שנאמר לפני לגבי המבחן. המבחן בכלל לא פשוט וגם מאווווד ארוך, מדובר על 18-20 סעיפים בכל שאלה ויש שתי שאלות. הקושי במבחן הוא להספיק לפתור אותו תוך 3 שעות וגם להבין באיזה סוג גלאי מדובר ומה צריך לעשות. לכן למרות שזה נראה טכני וחוזר על עצמו, הוא כן מצריך הבנה כדי לדעת להשתמש נכון בנוסחאות שנלמדו.\nממוצע המבחן הסמסטר יחסית נמוך בהשוואה לסמסטרים קודמים (67!), אבל הממוצע הסופי גבוה כי נתנו 5 נקודות פקטור וכנראה שבדיקת המבחנים הייתה קלה והתחשבו בתשובות שכללו טעות חישוב כל עוד הדרך נכונה וכמובן בנוסף לציון תרגילי הבית.\n\nהשורה התחתונה: קורס נחמד ונותן ידע כללי על סוגי גלאים שונים. אם יש מספיק זמן ללמוד לקורס הייתי ממליצה לקחת וללמוד טוב ולהתרגל לפתור שאלות מהר ואז אפשר להוציא 80+.", "timestamp": 1715902522595}]}