{"posts": [{"author": "OPTMIZATION", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות: מרצה טוב בסה\"כ מבחינת מוכנות ,אבל קצת קשה לעקוב אחרי ההרצאות , עמוסות בתאוריה וחלק גדול מהם לא רלוונטי למבחן\n\nשם המתרגל/ת: רון דורפמן\nחוות דעת - תרגולים: תותח על ! \n\nשעורי הבית: 4 גליונות יבשים ורטוב אחד , לוקחים זמן עצום גליון היבש לקח לי לפעמים ימים שלמים לשבור את הראש ולפתור אותם , אין רפרנסים להיעזר בהם וזה מקשה יותר ויותר שיעורי בית תרמו לי מבחינת ידע וסדר של הנושאים אבל לא לבחינה לצערי\n\nהמבחן: קשה לא קל בכלל בנוי על טריקים מתמטיים שלא עולים לראש ברגע אחת , פתרתי הרבה מבחנים וזה לא עזר לי בכלל , לפעמים רעיונות חוזרים על עצמם אבל לאוב לא  \n\nהשורה התחתונה: הייתי רשום כשומע חופשי בקורס מבוא לאופטימזציה של מדמ\"ח המבחנים שלהם הרבה יותר קלים מהמבחנים בקורס שלנו וגם יותר פרקטי לכן אני אמליץ עליו בשורה התחתונה", "timestamp": 1625971818115}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות: לדעתי, מעניינות ומועברות לא רע.  לומדים בהן, בין היתר, את המקור המתמטי לכל מיני דברים שמלמדים בקורס \"מערכות לומדות\"\n\nשם המתרגל/ת: רון דורפמן\nחוות דעת - תרגולים: מתרגל מקצוען\n\nשיעורי הבית: היו אצלנו ארבעה גיליונות יבשים ועוד תרגיל מחשב. כל גיליון/תרגיל כזה שווה 5% מגן.\nבכל גיליון יש מדי פעם סעיף קשה, אך רוב הסעיפים הוגנים.\nבסה\"כ סביר\n\nהמבחן: למי שעוקב אחרי ההרצאות והתרגולים ופותר את תרגילי הבית, רמת המבחן סבירה. יחד עם זאת, המבחנים (מועדי א' ו-ב' של הסמסטר הזה) הרגישו ארוכים מדי לשלוש שעות\n\nהשורה התחתונה: הקורס הרגיש לי שהוא בנוי טוב, אך הוא דורש השקעה. בסה\"כ מומלץ. מה שמלמדים בו שימושי להרבה תחומים מלבד למידת מכונה", "timestamp": 1666891040927}, {"author": "רוי", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות: כפיר מרצה סבבה כזה, ההרצאות סה\"כ טובות, החיסרון היחיד שהן מועברות משקופיות שהן לא תמיד הכי אינפורמטיביות ללא הסבר נוסף של המרצה. בנוסף, חלק מההרצאות מועמסות בחומר שלא באמת הולכים לשאול עליו במבחן אבל מבינים את זה רק אחרי שמתחילים לתרגל מבחנים.\n\nשם המתרגל/ת: רון דורפמן\nחוות דעת - תרגולים: מתרגל מעולה, שולט ביד ברמה בחומר ובאופן כללי התרגולים כתובים ממש טוב ככה שאפשר לקרוא לבד את הדפים ולהבין את הרוב, התרגולים טובים מלמדים ורלוונטים למבחן. \nיש בנוסף הקלטות של רון ושל כפיר מלפני שנתיים בערך שהן רלוונטיות ורון נותן גישה לסטודנטים בקורס.\n\nשעורי הבית: 4 יבשים ו1 רטוב, כל אחד מקנה 5% מגן ככה שאפשר להגיע עד 25% מגן.\nהיבשים ברובם אחלה, יש לפעמים סעיפים קשים אבל הם לא אמורים לקחת יותר מיום עבודה, השאלות בהם דומות ברמת הקושי למבחן ועוזרות להטמיע את החומר.\nהרטוב גם לוקח באיזור ה6 שעות בממוצע הייתי אומר והוא סבבה.\n\nהמבחן: רוב המועדים הוגנים, לא נתקלתי במועד שהיה מזעזע אבל כן לפעמים יש סעיף או שניים קצת out of the blue.\nהמועד א' שלנו היה הוגן לחלוטין, ללא הנפצות ומתבסס מאוד על החומר הנלמד בתרגולים.\n\nהשורה התחתונה: קורס מעולה שמועבר טוב עם סגל טוב. אם כי, מאוד מתמטי ומזכיר בחשיבה שלו את החשיבה הנדרשת בחדו\"א 2ת'(אבל ללא אינטגרלים וחישובים של נפחים). לא מומלץ בכלל למי שסובל בקורסים מתמטיים חדוואיים.", "timestamp": 1689768508801}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות:\n\nשם המתרגל/ת: רון דורפמן\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689797009934}, {"author": "Tamir Mishali", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: כפיר\nחוות דעת - הרצאות: \nנותן דוגמאות אמיתיות. מודע מאוד למאמרים שיוצאים ולמה שקורה באקדמיה.\nהמצגות מבוססות על המון פיתוחים מתמטיים ומשפטים שקשה להבין איזה מהם משמעותי ונצטרך אותו הרבה בהמשך ואיזה לא.\nהלכתי להרצאות פרונטליות ובסהכ מרוצה מזה למרות שלהבנתי יש גם מוקלטות מסמסטרים קודמים.\n\nשם המתרגל/ת: רון דורפמן\nחוות דעת - תרגולים: \nרון מאוד מאורגן. לוקח ברצינות את התרגולים. \nמבין ושולט בחומר ברמה גבוה.\nמעבר לזה, ברמה האישית רון היה מאוד מחוייב לסטודנטים. לא היסס להסביר מעבר לשעות התרגול וגם מעבר לשעות הקבלה. ראוי מאוד להערכה!\n\nשעורי הבית: \nקשים וארוכים מאוד. גם אם עושים עם שותף ומחלקים את העבודה, השאיפה היא לפתור הכל לבד כדי לתרגל וללמוד את החומר. לא הייתי רוצה לוותר על תרגילים במסגרת חלוקת תחולות עבודה עם שותף רק כדי שאוכל לעמוד בעומס. \nחלק מהשאלות בעבודות בית מבוססות על שאלות ממבחנים משנים קודמות כך שמייצגות את הרמה. יש חפיפות עם חלק מהתרגילים משנים קודמות.\n\nהמבחן: \n- רמת המבחן: כחזרה גנרלית שמרתי את מועדי א' ו-ב' של תשפ\"ב לפתור יום לפני מועד א' שלי בתשפ\"ג.\nנכשלתי בשניהם (ניקוד עצמי). \nאת המועד שלי, צלחתי יחסית בסדר. לא יודע למה יש פער ככ גדול ברמה אבל המבחן שלנו היה הגון ובסה\"כ משקף את הרמה.\n- תוכן המבחן: רב המועדים מבוססים על כל מני זהויות וטריקים מתמטיים מהפיתוחים המקוריים שהיו בהרצאה. המבחן עצמו עם חומר פתוח אבל עדיין נפלתי סתם על טריקים מתמטיים שלא קלטתי בתרגול ממבחנים מבשנים קודמות.\n\nהשורה התחתונה: \nקורס מעניין. כפיר ורון ממש ממש אחלה ברמת ההסברים, העניין ורצון לטובת הסטודנטים. \nמדובר על עוד רקע לעולם של למידת מכונה ומה שבא לפני רשתות וקצת כניסה לבסיס של התחום הזה.\nחוץ מזה, אולי זה קורס הכנה לקורסים שנותנים יכולת פרקטית אמיתית, אבל הוא כשלעצמו לא הרגיש שנתן לי כלים משמעותיים לבעיות.", "timestamp": 1690866298453}, {"author": "עומר לוי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שעורי הבית:  מכינים טוב למבחן ופתירים אם רואים הרצאות ותרגולים\n\nהמבחן: מבחן ללא הפתעות, מה שעושים לאורך הקורס בשיעורי בית ובתרגולים זה מה שמופיע, יש מבחני עבר ללמוד מהם. לא הייתי אומר קל כי בסוף החומר וההוכחות לא פשוטים.\n\nהשורה התחתונה: \nקורס מעניין שמכניס לעולם האופטימיזציה, סגל מעולה ומבחן הוגן", "timestamp": 1698090118061}]}