{"posts": [{"author": "שי", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: לא ברורות. מצגות. הרבה חומר. דברים מורכבים לא עוברים בצורה טובה כי ענת לא מסבירה מדהים.\n\nשם המתרגל/ת: טל דניאל ודליה אוירבך\nחוות דעת - תרגולים: תרגולים בגופיטר נוטבוק עם מעט תיאוריה ובעיקר הרבה קוד. רואים דברים נחמדים ומגניבים. לרוב זה לא קשור למה שלומדים בהרצאות.\n\nשעורי הבית: רטובים רצחניים\n\nהמבחן: 5 שאלות פתוחות ברמה בסיסית. היה קשה להבין מה הסגל רוצה מאיתנו. מבחנים משנים קודמות לא היו ממש רלוונטים\n\nהשורה התחתונה: אמנם למדנו הרבה ויז'ן אבל תכלס היה קורס מבאס עם סגל קטנוני", "timestamp": 1597849043626}, {"author": "Aviv Ratzon", "difficultyRank": 5, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הסגל הסמסטר הזה התנהל בצורה מאוד מוזרה", "timestamp": 1598261943034}, {"author": "Tomer Orenshtein", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה:ענת לוין\nחוות דעת - הרצאות: מבולגן מאוד, לא ברורה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מאוד מלמדים ומעניינים. האחרון מאו עמוס אבל השאר סבירים מאוד\n\nהמבחן: לא מתחכם ולא חישובי. בדיוק לפי מה שמלמדים בסמסטר\n\nהשורה התחתונה: קורס מומלץ מאוד", "timestamp": 1598792584034}, {"author": "רועי", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: \nההרצאות היו לא טובות בכלל, מבולגן וחסר סדר לחלוטין.\nהקורס עצמו מעניין אבל חבל שמועבר על הפנים\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: \nהוא משקיע המון וזה ניכר אבל נראה שהציפייה הייתה בקורס הזה למשהו אחר, תכננו את תרגילי הבית כאילו כל אחד הוא מיני פרויקט שזה בסדר אבל בתהליך הבדיקה הורידו על דברים שבכלל לא ציינו שנדרשים. בקיצור היו בעיות עם הקורס הזה בסמסטר קורונה.\nשעורי הבית: \nלא קלים, דורשים הרבה זמן אבל מלמדים מאוד.\nהמבחן: \nמתחכם אבל לא משהו שהוא מעל לרגיל בטכניון, הבעיה הייתה שהממוצע בקורס הזה במהלך השנים האחרונות היה 90+ אבל עכשיו עם ענת החליטו להוריד את הממוצע.\nהשורה התחתונה: \nקורס מעניין אבל הועבר לא משהו.", "timestamp": 1602585899568}, {"author": "...", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ענת\nשם המתרגל/ת: דליה וטל \nחוות דעת - תרגולים: ממש טובים אבל מאוד עמוסים\n\nשעורי הבית: קשים וארוכים מאוד אבל מאוד פרקטיים ומעניינים.\n\nהמבחן: לא קשה אבל כדאי לדעת שענת אמרה לנו שהיא לא תתן ממוצע מעל 80. אז כדאי לדעת שזה כבר לא קורס מעלה ממוצע.\n\nהשורה התחתונה: קורס מצוין למי שרוצה לעסוק בתחום, אבל הציון מבאס.", "timestamp": 1602608287747}, {"author": "יאיר", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: מצוין\n\nשם המתרגל/ת: אליאס נחמה\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: מעניינים. עמוס מאוד\n\nהמבחן: סביר\n\nהשורה התחתונה: לקחת", "timestamp": 1627437125976}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: דורשות הקשבה עמוקה. חצי ראשון של הקורס הרצאות יותר מעשיות ומעניינות, והחצי השני מאוד מאוד מתמטי ודורש הבנה.\n\nשם המתרגל/ת: אליאס נעמה וטל דניאל\nחוות דעת - תרגולים: תותחים, בקיאים מאוד בכל החומר. התרגולים מאוד ענייניים ומוסיפים הרבה חומר מעבר לידע היבש של הקורס.\n\nשעורי הבית: עמוסים מאוד מאוד מאוד, צריך לבוא עם הרבה מאוד עצבים וסבלנות. יש 11 תרגילים יבשים קצרצרים אבל 4 תרגילים רטובים שכל אחד יותר ארוך ועמוס מהשני.\n\nהמבחן: מאוד קשה וארוך. הרמה מאוד עלתה בשנים האחרונות. צריך לדעת הכל עד לפרטים הכי קטנים, ברמה של אפילו להכיר את כל הארכיטקטורות של כל הרשתות שנלמדו בקורס, כל סוגי הפרמטרים, כל האלגוריתמים האפשריים שנלמדו, וזה המון המון המון חומר. צריך לעקוב באמת לאורך כל הסמסטר על כל פרט ופרט קטן בקורס.\n\nהשורה התחתונה: קורס מאוד מעניין, מאוד פרקטי, מלמד וגם אפשר להנות ממנו ולקבל כלים לעתיד, אבל צריך לבוא מוכנים לתרגילי הבית המתישים והמבחן הכל כך קשה.", "timestamp": 1628534464602}, {"author": "A", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: חלק מההרצאות בסדר וחלק לא הכי ברורות. המרצה מאד חסרת אמון בסטודנטים ולא מתייחסת אליהם בכבוד. דואגת לציין כל הזמן שסטודנטים לומדים רק לפני המבחן ושהם באו לקורס \"רק בשביל ללמוד על רשתות נוירונים\" למרות שזה לא נכון. \n\nשם המתרגל/ת: אליאס + הילה\nחוות דעת - תרגולים: שני המתרגלים היו טובים, אבל התרגולים היו עמוסים מדי, רובם לא תרגלו חומר מההרצאה אלא לימדו חומר חדש לגמרי. לומדים בתרגולים בעיקר ארכיטקטורות למידה עמוקה של נושאים שנלמדו בהרצאה, אבל לומדים כמות אדירה של חומר בצורה מאד מהירה ושטחית ככה שלא באמת מבינים איך כל דבר עובד.\n\nשעורי הבית: 4 תרגילים רטובים - היו יחסית מעניינים ומלמדים אבל גם מאד ארוכים - צריך לקחת בחשבון שהם מוסיפים עומס. מצד שני הם גם 40% מהציון הסופי שזה דיי מכבד.\n12 תרגילים יבשים \"Quiz\": יש כל שבוע, לא שחררו אפילו פעם אחת ולכל תרגיל יש 6 ימים להגשה, אם לא מסתדר או שיש עומס באותו שבוע (לפעמים העומס נוצר בגלל רטובים בקורס הזה) זה לא מעניין אף אחד. התרגילים אמורים לכאורה לקחת לא הרבה זמן ולתרגל חומר מההרצאה אבל הרבה פעמים הם השאלות היו מנוסחות בצורה לא מובנת או דרשו הרבה מאד זמן של חשיבה ולפעמים אפילו בפתרונות שפורסמו התגלה שיש שגיאות. \n\nהמבחן: המבחן לא מאד קשה. בגלל בקורס נלמדת כמות אדירה של חומר, הוא נלמד בצורה דיי שטחית ולכן לא מגיעים לשאלות עמוקות או מסובכות, לפחות 50% מהמבחן אפשר לפתור עם הבנה בסיסית בחומר והצצה בחומר הפתוח. כמובן שזה מתקזז עם בדיקה קשה במיוחד בסעיפים שהיו לא ברורים כלכך, כדי שחס וחלילה לא יהיה קורס אחד עם ממוצע גבוה.\nבנוסף המבחן עם חומר פתוח, וזה לא סתם חומר פתוח, בקורס הזה יש כמות אדירה של חומר, לפעמים בתרגול של שעה נלמד חומר חדש שמתאים ל4 שעות ולכן יוצא שמי שצמצם בהדפסות צריך להדפיס כמעט 400 עמודים (רק הרצאות ותרגולים מצומצם). תעשו את החשבון לבד כמה עצים זה.\n\nהשורה התחתונה: \nבגדול הקורס מעניין ונותן מבוא לדברים חשובים, חבל רק שמתעקשים להכניס חומר של למידה עמוקה שנלמד בצורה מאד שטחית ולא נותן הרבה במקום להעמיק בחומר הרגיל. הוא עמוס מאד אז למי שלא מתעניין בתחום לא חושב שכדאי לקחת אותו. המרצה לא מתייחסת טוב לסטודנטים אבל יכול להיות שזה ישתנה עם מרצה אחר.", "timestamp": 1644154527704}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: עמוסות מאוד, המרצה בסדר אבל קל לאבד אותה, לי אישית היה בלתי אפשרי לראות בלייב.\n\nשם המתרגל/ת: אליאס\nחוות דעת - תרגולים: מתרגל טוב שיודע את החומר לעומק, אבל התרגולים הם רק שעה וברוב המוחלט מלמדים חומר אקסטרה על ההרצאות, מה שהופך את כמות החומר לעצומה.\nמתעסקים יותר בדיפ ופחות בשיטות הקלאסיות שנלמדות בהרצאה.\n\nשעורי הבית: עמוסים אבל לדעתי מעניינים וגם שווים את המשקל שלהם (40% ל-4 רטובים). יש כל שבוע בוחן על ההרצאה (סה\"כ 5% לכל הבחנים), בד\"כ הם סבבה.\n\nהמבחן: היה פייר בסה\"כ אבל הלמידה אליו הייתה לא פשוטה. כמויות אדירות של חומר כי התרגול הוא פשוט עוד שעה של חומר חדש, אומנם חומר פתוח אבל צריך לדעת להתמצא בו אחרת קל ללכת לאיבוד בין ה500 עמודים שמדפיסים למבחן (ליטרלי 500). בגלל שהחומר פתוח לעיתים השאלות דיי מוזרות ולא בודקות הבנה אלא כל מיני עובדות אקראיות על אלגוריתמים שראינו אז צריך להיות ממש בקיא בפרטים שזה יכול להיות מתסכל.\n\nהשורה התחתונה: קורס נחמד, נותן טעימה ולא הרגשתי שנכנסים לעומק של הדברים, אבל לעשות אותו רק אם התחום מעניין אתכם אחרת אפשר להתמרמר בו ממש.", "timestamp": 1644225580244}, {"author": "Roy Mahlab", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: ההרצאות חשובות למבחן ולשיעורי בית אבל הן מועברות בצורה מזעזעת. כל ההרצאה בין 100-150 שקפים (ואני לא מגזים) של תמונות והיא מדבר על התמונות. לדעתי זה לא רציני וקשה להבין את זה. זה גם ממש מקשה על תהליך של למידה עצמית כי היא פשוט מדברת על הנושאים אז אם אין הקלטות ופספסתם שיעור קשה להשלים. אני גם אוסיף שלדעתי ההסברים לא מובנים במידה מספקת.\n\nשם המתרגל/ת: אליאס נעמה\nחוות דעת - תרגולים: תרגולים נחמדים בסך הכל \n\nשעורי הבית: יש 4 רטובים כבדים מאוד. אני אהבתי אחד מהם ואת השאר לא כל כך. חוץ מזה יש יבשים קצרים כל שבוע שבהם היא \"בוחנת\" אם הקשבתם לה בהרצאה.\n\nהמבחן: לדעתי היה קל יותר משנים קודמות ביחס לשלב שבו החליטו להפוך את זה לקורס קשה. הבדיקה קטנונית מאוד. אני אגיד גם ששיעורי הבית שווים 45 אחוז.\n\nהשורה התחתונה: אני לא כל כך נהניתי מהקורס. חצי מהקורס לומדים לעשות שחזורים תלת מימדים של מבנים מתמונות וזה נחמד אבל לא אהבתי כל כך", "timestamp": 1647366815510}, {"author": "מישהו", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ליהיא מנור\nחוות דעת - הרצאות: מרצה נחמדה ומתחשבת, רואים שהיא מומחית בתחום גם אם לפעמים שוכחת נקודות קטנות בחומר שלומדים (ויש הרבה ממנו אז הגיוני). סה\"כ ממש ממליץ עליה.\n\nשם המתרגל/ת: הילה מנור\nחוות דעת - תרגולים: מתרגלת מצויינת. יש באמת כמות פסיכית של חומר, אלגוריתמים וארכיטקטורות להבין והיא מבינה באופן מרשים בשביל מתרגלת. חוץ מזה נחמדה ממש ואחלה גברת.\n\nשעורי הבית: ארוכים וקשים לפעמים, יש 4 רטובים שחלקם לא רעים וחלקם קשים יחסית. אבל, ממש מלמד וסופר חשוב אם מישהו רוצה לעסוק בתחום. למי שלא יודע פייתון זה מעט מאתגר בהתחלה אבל תוך חודש אתם תשלטו לא רע.\n\nהמבחן: הסמסטר היה קשה בטירוף, ארוך בצורה לא רגילה ומלא באנקדוטות משונות על ארכיטקטורות שבקושי דוברו ובשאלות מוזרות. זה קצת שונה משנים קודמות אבל אולי הקורונה עשתה שינוי בסטודנטים ובמרצים. \nבכל אופן יש תקף גדול אז המבחן לא חורץ גורלות.\n\nהשורה התחתונה: בין הקורסים הטובים שעשיתי בטכניון וחד משמעית הכי רלוונטי לתעשייה, ממליץ בחום לכל מי שאי פעם רוצה להתעסק בלמידה/vision וכו'", "timestamp": 1657622340889}, {"author": "YOLO", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ליהי צלניק\nחוות דעת - הרצאות: היא ללא ספק מבינה בתחום אבל לפעמים הרגיש שלא התכוננה הכי טוב להרצאות. בסך הכל החומר המועבר מאוד מעניין וכתוצאה מכך גם ההרצאות.\n\nשם המתרגל/ת: הילה מנור\nחוות דעת - תרגולים: מאוד רצינית ומשקיעה, בקיאה מאוד בחומר ומעביר את התרגולים בצורה טובה. לפעמים חורגת מהזמן כי מנסים לדחוף כמות עצומה של חומר בתרגולים אבל חוץ מזה התרגולים אחלה.\nמרגיש שהתרגולים הם פשוט השעה השלישית של ההרצאה ופחות תרגול של חומר שנלמד בהרצאה.\n\nשעורי הבית: עמוסים אבל זה 45% מהקורס אז לא בלתי סביר. לפני שלקחתי את הקורס הפחידו אותי מאוד מהמטלות אבל בפועל זה היה בסדר. אסייג ואומר שלי ולשותף היה ניסיון בפייתון ובדיפ ככה שזה הקל בחלק מהמטלות.\n\nהמבחן: מבחן מציק עם מיליון סעיפים והורדת נקודות על ניואנסים מיותרים. לא הספקתי לפתור את כולו (12 נקודות שלא עניתי עליהן כלל, ולא כי לא ידעתי את התשובה אליהן). בסך הכל נראה שהם דואגים לממוצע נמוך שיתאזן עם שיעורי הבית.\n\nהשורה התחתונה: \nהנושאים היו ממש מעניינים בעיניי. בהתחלה הרגשתי שמתמקדים בעיקר בדיפ לרנינג אבל ככל שעבר הסמסטר מצאתי את הקורס יותר ויותר מעניין, יותר משציפיתי. הידע מאוד רלוונטי למיליון יישומים שונים ולכן אני מאוד ממליץ על הקורס.\nאסייג ואומר שאם למישהו יש ממוצע גבוה ושואף להוציא מעל 95 - אז לא, זה כנראה לא יקרה (ראו היסטוגרמות), זה הציון הכי נמוך שלי בקורסי בחירה של חשמל על אף האחוז הגבוה של שיעורי הבית. אני עדיין ממליץ על הקורס כי לומדים דברים מעניינים ולי זה מה שהיה חשוב.", "timestamp": 1657718762534}, {"author": "אוילר", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ליהי\nחוות דעת - הרצאות: הרצאות מעניינות, ניכר שהמרצה רוצה ללמד דברים מעניינים ופחות קונבנציונלית בקטע של ללמוד מספר או להספיק חומר\nשם המתרגל/ת: משה\nחוות דעת - תרגולים: ראיתי בוידאו, מתרגל טוב, ניכר שמשקיע ויש לו הרבה ידע, במיוחד בכל התחום של דיפ לרנינג, כשפניתי אליו גם שלח חומר להעשרה וגם עזר לי ממש להבין בשעת קבלה את שיעורי הבית\nשעורי הבית: די ארוכים, אבל סך הכל מלמדים ולא קשים מידי, יש יש חופשית במימושים וזה די זורם ועם ציון ממש גבוה\n\nהמבחן: \nמבחן ארוך מאד עם קצת טריקים, בסוף יש דברים שלא דיברו עליהם במדוייק בהרצאה או בתרגול, או שלא היו כתובים בתרגול אז גם אם אמרו בעל פה אי אפשר לזכור הכל, אבל הבדיקה נראת הוגנת ועל טעויות קטנוניות הם ויתרו\n\nהשורה התחתונה: ממליץ בחום, קורס מעניין מאד", "timestamp": 1661934332607}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ליהי\nחוות דעת - הרצאות: בסדר. די מבולגנת, לא מעמיקה בכלל במעברים מתמטיים כשיש צורך. \n\nשם המתרגל/ת: הילה \nחוות דעת - תרגולים: מתרגלת טובה, יודעת את החומר ומעבירה אותו בצורה טובה.\n\nשעורי הבית: ארוכים, אך מלמדים .\n\nהמבחן: מחריד. בעבר המבחן היה לגמרי סבבה, כזה שאם למדת אתה תצליח. הסמסטר הם לקחו אותו 8 צעדים קדימה והפכו את ההבחנות לבלתי נסבלת. שאלות מתקטננות על דבר קטן קטן שנלמד אי שם באיזה תרגול אחד. מבחן ארוך, מתיש, מלא בסיפורים על סיפורים שמאוד מקשים על הבנת הפואנטה של השאלה. הסמסטר זה גם היה באנגלית וזה הקשה עוד יותר. \n\nהשורה התחתונה: עם כמה שמעניין, לא זוכר מתי סבלתי ככ במבחן.", "timestamp": 1678281538062}, {"author": "Ben Ajamy", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: מקיפות יריעת חומר מכובדת אבל לא מצליחות להתעמק בדברים.\n\nשם המתרגל/ת: יפתח אדלשטיין\nחוות דעת - תרגולים: כמו ההרצאות מקיפים כמות חומר גדולה ולא מצליחים להבין דברים על כן בצורה ברורה מספיק(מצריך עבודת בית מכובדת).\n\nשעורי הבית: מאוד גוזלי זמן. כמות מכובדת של מטלות.\n\nהמבחן: פיירי להבנתי אבל לי היה מאתגר.\n\nהשורה התחתונה: קורס מאתגר. מומלץ למי שלא יכול בלי אחרת הרבה פחות.", "timestamp": 1692773186397}, {"author": "Ben Ajamy", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תומר מיכאלי\nחוות דעת - הרצאות: מעולות. חומר מעניין ופרקטי.\n\nשעורי הבית: רטובים בפייתון.\n\nהשורה התחתונה: קורס מומלץ", "timestamp": 1704782348317}, {"author": "--", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ענת לוין\nחוות דעת - הרצאות: \nמלמדת בצורה די משעממת. קשה להתרכז תוך כדי. \n\nשם המתרגל/ת:  וואי שכחתי את השם, נראלי יובל? הזה שלא היה מתרגל אחראי\nחוות דעת - תרגולים: תרגולים מעולים. מסביר ממש טוב ומפשט נושאים מורכבים לקלים! ממש טוב!\n\nשעורי הבית: ארוכים, עמוסים, ומסתבר שגם מורידים בהם ניקוד על דברים אז זה לא מגן של 100 כל עוד אתה מגיש. \n\nהמבחן: אז זהו שהמבחן מסריח קצת.\nבכללי הבעיה בקורס היא שהחומר לא באמת נגיד. אפשר להגיע עם חומר פתוח, אבל אין רשימות מסודרות לקורס. יש מצגות להרצאות ולתרגולים, אבל הכל שם בכותרות וראשי פרקים. ומצד אחד מדובר בקורס מבוא לCV אז נוגעים בהרבה דברים כלליים, מצד שני אתה נבחן לפעמים על איזה אנקדוטה שהמרצה העירה על האלגוריתם ככה. אי אפשר להתנהל בצורה הזאת. גם הפתרונות של מבחני העבר לא טובים, למועדי ב הבנתי שהם אפילו לא טורחים לפרסם פתרון במודל. אז זה קורס שממש קשה ללמוד למבחן שלו לבד. \n\nהשורה התחתונה: קורס די מסריח שלא היה צריך להיות ככה. לא הייתי עושה אלא אם אתם רוצים לעבוד בתחום.", "timestamp": 1715625414206}, {"author": "--", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: די משעממת, אין לה רשימות מסודרות, רק מצגות (תכלס גם המצגות חצי מועתקות מסטנפורד).  \n\nשם המתרגל/ת: יפתח\nחוות דעת - תרגולים: מתרגל גרוע. מנסה להיות סחבק אבל רואים שמשהו שם לא בסדר. בדיעבד ראיתי הקלטות של יובל, מסביר ממש ברור. \n\nשעורי הבית: ארוכים, לא קשים מדי אבל לוקחים זמן.\n\nהמבחן: מבחן רע. יש שאלות ממש קלות ויש ממש קשות. לא מנוסחות טוב, הסגל לא טורח לפרסם פתרונות לחצי מהמבחנים, ואלו שכן מאוד חלקיים. יכולים לשאול אותך על איזה אנקדוטה הזויה. \n\nהשורה התחתונה: קורס שיכול להיות טוב אבל מנוהל רע. אין להם רשימות מסודרות, טונה של חומר ובאמת יכולים לשאול על כל דבר הזוי במבחן. פשוט להתפלל לעבור ולקבל את המגן עד לציון נורמלי. קורס לא מומלץ, לפחות לא תחת הסגל הזה.", "timestamp": 1719557134982}]}