{"posts": [{"author": "דקל מירום", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: עדו קמינר\nחוות דעת - הרצאות: ההרצאות ממש מעניינות והועברו בצורה מעולה (אפילו כשזה היה בצורה מקוונת!)\n\nשם המתרגל/ת: עדי ארבל\nחוות דעת - תרגולים: התרגולים עזרו להעמיק בחלק המתמטי ולהבין יותר לעומק איך בפועל לגשת לתרגילים מהסוג הזה\n\nשעורי הבית: אומנם לא קלים, אבל אין הרבה (3 יבשים ורטוב אחד שמחולק ל-2 חלקים), אז סך הכל לא יוצא עמוס\n\nהמבחן: היה הוגן\n\nהשורה התחתונה: קורס ממש מומלץ! לדעתי היה מעניין, פותח כיוון לנושא מרתק, לא עמוס מדי והממוצע אחלה", "timestamp": 1598170554557}, {"author": "Aviv Ratzon", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא ממליץ לקחת ללא רקע קוונטי משמעותי (פיזיקה 3ח לא מספיק לחלק משמעותי מהקורס)", "timestamp": 1598261973488}, {"author": "איתמר גולדמן", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: עידו קאמינר\nחוות דעת - הרצאות: מרצה מעולה, צעביר את החומר בתורה מרתקת ועם קשב לסטודנטים.\n\nשם המתרגל/ת:  עדי ארבל\nחוות דעת - תרגולים: טובים, לפעמים קשה לעקוב אבל רשומים בצורה מאד טובה שאחר כך אפשר לעבור עליהם לבד.\n\nשעורי הבית: ארוכים במקצת ולפעמים קשים אבל מאד מעניינים ומלמדים את החומר.\n\nהמבחן: היה לנו עבודת בית שהייתה מאד מאד ארוכה וגם לאחר 7 שעות לא הצלחתי לפתור הכל. המרצה ידע שהמבחן ארוך והוא פיקטר בהתאם :)\n\nהשורה התחתונה: קורס מאד מומלץ למי שמתעניין בתחום ומרצה מעולה!", "timestamp": 1601364802231}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: \n\nשעורי הבית: \nדי ארוכים\nהמבחן: \nהיה קשה באופן קיצוני והתבסס בעיקר על 2 השיעורים האחרונים של הקורס\nהשורה התחתונה: \nלא מומלץ ללא רקע משמעותי בקוונטית (ולא פיסיקה 3ח זה לא מספיק)", "timestamp": 1626124517460}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: המרצה הכי טוב שהיה לי בפער, מציג את הנושאים בהתלהבות, מעביר את החומר בצורה ברורה ויוצר קשב לאורך כל ההרצאה.\nההרצאות עצמן לפעמים קשות ודורשות מעבר חוזר בבית.\n\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: התרגולים די קשים אבל חשובים כדי להוות סוג של השלמה להרצאות (לאו דווקא פרקטיקה ומענה סטנדרטי על שאלות). \nרון מתרגל לא רע, הוא יודע ממש טוב את החומר אבל לפעמים מעט מונוטוני.\n\nשעורי הבית: יש מעט הגשות שבחלקן משתנות בין סמסטר לסמסטר (כמו כל הקורס שמתעדכן בהתאם לטכנולוגיות החדשות בתחום), אך הרטובים דורשים המון זמן השקעה ולא תמיד קיים רפרנס. בסופו של דבר שיעורי הבית כן מלמדים וההתנסות של לתכנת על מחשב קוונטי מעניינת.\n\nהמבחן: כפי שעידו הבטיח, המבחן היה קשה מאוד וארוך מאוד, אבל הבטיח שגם יהיה פקטור, ככה שלדעתי זה די הוגן. \nאין המון מבחני עבר ככה שזה קצת מקשה.\n\n\nהשורה התחתונה: הקורס מעולה לדעתי ומפתח סקרנות רבה בנושא הזה! \n\nנ.ב.: יש בעיה כללית בקורס של מגוון רחב של רקעים לסטודנטים שמגיעים אליו: חשמל, חשמל - פיזיקה, מדמ\"ח, חומרים ולכן הרבה פעמים יש קושי שנוצר מזה, לא חושב שזו סיבה לא לרחת את הקורס אבל זה כן משהו שעשוי ליצור תחושה לא מעימה ואי הבנות.", "timestamp": 1626161224572}, {"author": "s", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: מרצה מצויין, ההרצאות היו מעניינות.\n\nשם המתרגל/ת: רון ריומי.\nחוות דעת - תרגולים: התרגולים חשובים ומהווים השלמה להרצאות ולא חוזרים על החומר.\n\nשעורי הבית: היו שני גליונות יבשים ושניים רטובים. חוץ מהיבש הראשון כל הגליונות ארוכים אבל בזוגות כך שלא מוסיפים הרבה עומס.\n\nהמבחן: המבחן היה בעיקר על נושא אחד והיה ארוך אבל היה פקטור, כפי שעידו אמר מראש כך שבסה\"כ היה המבחן הוגן.\n\nהשורה התחתונה: ממליץ לקחת לכל מי שרוצה ללמוד על התחום.", "timestamp": 1631199225741}, {"author": "הדר ט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עדו קמינר\nחוות דעת - הרצאות: מרצה מצוין. ניכר שהוא אוהב את החומר, בקיא בו מאוד ולכן מעביר אותו בצורה טובה ומעניינת. הוא נכנס לשאלות הפילוסופיות לפעמים של תחום המכניקה הקוונטית, דבר שאהבתי מאוד.\n\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: מתרגל שאכפת לו. בקיא בחומר ורוצה שכולם יבינו. גם כשהיה לחוץ עם התרגיל הרטוב השני שהיה חדש הוא ועדו התחשבו בסטודנטים ובאו לקראתנו.\n\nשעורי הבית: 2 תרגילים יבשים ו2 רטובים. התרגילים הרטובים באמת נותנים טעימה מטכנולוגיות קוונטיות שיש בזמננו - אחד על המחשב הקוונטי של IBM והשני על מחשב קוונטי פוטוני.\n\nהמבחן: המבחן היה פשוט מלמד. מועד א היה ארוך והתחשבו בכך ע\"י פקטור.\n\nהשורה התחתונה: מי שמתעניין בתחום וגם מי שרק רוצה טעימה, זה פשוט קורס מעולה. בנוי היטב ועם תוכן מעניין.\nאגיד גם שמאחר שהתחום מתפתח עם הזמן, עדו מקפיד לעדכן את תוכן הקורס בהתאם (בעיקר השבועות האחרונים).", "timestamp": 1633782690255}, {"author": "ד", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: \nמעניינות מאוד, עידו מתלהב מהחומר מה שהופך אותן לעוד יותר מעניינות. השפה קצת קשה והרבה מושגים חסר לנו בעיקר אם באת מחשמל ולא מחשמל פיסיקה אבל יש הכל בויקפדיה\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: \nמתרגל מצוין זמין לכל שאלה\nשעורי הבית: \nיש 4 גיליונות במהלך הסמסטר והם די קשים אבל פתירים \nהמבחן: \nהוגן מאוד\nהשורה התחתונה: ממליץ מאוד לכל מי שמעניין אותו הנושא באופן כללי פיסיקה  3 ח הוא לא קדם מספיק אבל אפשר להשלים מויקפדיה הכל", "timestamp": 1634664104683}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "בסמסטר חורף הקורס מתנהל במתכונת כיתה הפוכה - ראינו את ההקלטות מאביב 2021\n\nשם המרצה: עדו קמינר\nחוות דעת - הרצאות: ההרצאות מעניינות מאוד ועדו מסביר לא רע, אך לא פשוט להבין אותן - במיוחד לאנשים בלי רקע משמעותי בפיזיקה.\n\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: רון מסביר בסדר, אך לפעמים גם עליהם צריך לחזור כדי להבין.\n\nהכיתה ההפוכה/תרגילי הכיתה/שיעורי הבית: בתחילת כל שיעור יש בוחן מוכנות עם ציון תקף על ההרצאה והתרגול המוקלטים שצריך לראות עד אותו שיעור. לאחר מכן, שואלים שאלות על נושאים מההרצאה והתרגול ואז מתחלקים לקבוצות ופותרים תרגיל כיתה שאפשר להשלים עד השיעור הבא. תרגילי הכיתה יבשים ברובם, אך בחלקם גם ניתנת הזדמנות לתכנת במחשבים קוונטיים - שזה ממש מגניב\n\nהמבחן: מועד א' היה די ארוך והתמקד משום מה רק בחלק האחרון של הקורס. נוסף פקטור של 10% לציון המבחן.\n\nהשורה התחתונה: לדעתי, קורס מעניין מאוד ומומלץ לכל מי שאוהב פיזיקה ובמיוחד מכניקת הקוונטים. למי שלא לומד תואר בפיזיקה (כמוני), כדאי לדעת שהקורס כנראה לא פשוט ודורש לא מעט השקעה, אך אפשר להצליח בו.", "timestamp": 1646256311322}, {"author": "~", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גפן \nחוות דעת - תרגולים:  לא יודע ראיתי וידואו מוקלט של הסימסטר שהיא לא לימדה בו\n\nשעורי הבית: לא עמוסים במיוחד ועוזרים להסגר יותר טוב על החומר\n\nהמבחן: היה הוגן, דומה לשנים קודמות. המבחנים ממש לא קלים, גם לכאלה שבאים מחשמל פיסיקה.\n\nהשורה התחתונה: קורס לא קל בכלל. מי שלא עשה קורסים בפיסיקה קוונטית הייתי אומר אפילו קשה מאוד. למי שכן עשה זה ממש עושה לראות מימושים למכניקה הקוונטים וללא ספק קורס מאוד מומלץ.", "timestamp": 1661001090817}, {"author": "Tom", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: \nהרצאות מאוד מעניינות, כל הזמן מתעדכנות עם פיתוחים חדשים בתחום, ומאוד קשורות לעולם היום.\nהסמסטר הקורס הועבר במתכונת \"כיתה הפוכה\", כלומר רואים את ההרצאות והתרגולים בבית, ובכיתה יש בוחן במודל (הוא לא קשה, רק מוודא שראיתם את ההקלטות), ואז שואלים שאלות ופותרים את תרגילי הבית, וניתן לפנות לעידו ורון בכל שאלה בשיעור.\nשם המתרגל/ת: רון קוימי\nחוות דעת - תרגולים: \nלדעתי הוא קצת פותר מהר ולא תמיד הכי ברור (הוא מניח שאתם שולטים בחומר, ולכן לא תמיד קל לעקוב אחרי התרגול).\nבסך הכל מאוד נחמד, ותמיד מוכן לעזור:)\nשעורי הבית: \nשיעורי הבית מרופרנסים, אך מאוד עוזרים בהבנת החומר.\nהמבחן: \nקשה וארוך, למרות שיש פקטור והציון הסופי יותר בסדר\nהשורה התחתונה: \nקורס ממולץ ומאוד מעניין למי שאוהב את התחום.\nמאוד עוזר אם באים עם רקע פיזיקלי קודם (פיסיקה 3 לא מספיק, למרות שכן אפשר ללמוד את כל הבסיס בקורס, אבל זה יהיה קשה)", "timestamp": 1678878848619}, {"author": "נמרוד", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עידו קמינר\nחוות דעת - הרצאות: הרצאות מאד מעניינות, עידו מאד מתלהב מהחומר ונכנס גם לנדבחים יותר עמוקים ומעוררי מחשבה מסתם לעשות חישובים על הלוח. ממש קורס מוצלח. יכול להיות יותר קשה למי שלא בא עם רקע בפיזיקה.\n\nשם המתרגל/ת: רון רוימי\nחוות דעת - תרגולים: מתרגל מעולה, מאד קשוב ועוזר לאורך הסמסטר, יודע את החומר מצוין.\n\nשעורי הבית: היו 3 יבשים ו2 רטובים, הרבה מגיעים לקראת סוף הסמסטר כי צריך ללמוד הרבה חומר לפני. היבשים קצת ארוכים אבל די סבירים, בהתחשב בכך שיש רק שלושה הם לא עמוסים מאד. הרטובים יותר מסובכים, כי מתעסקים עם מערכות מחשוב קוונטי מסחריות - והיו לנו בעיות ששינו איך המערכת עובדת כך שמה שביקשו בגיליון כבר לא היה פשוט ודרש הרבה workarounds. מצד שני, זה כן מאד מגניב שיוצא לגעת במערכות האלה בידיים (לפחות דרך הcloud...)\n\nהמבחן: היה הוגן בגדול, קצת שונה משנים קודמות (פעם ראשונה שלא היה חצי מבחן לפחות על JC נושא מסוף הקורס), אבל רק שאלה אחת דרשה חישובים קשים, אחת השאלות הייתה די מתנה ויש בונוסים במבחן + פאקטור לרוב.\n\nהשורה התחתונה: קורס מאד מומלץ, דורש אבל השקעה.", "timestamp": 1690964111417}]}