{"posts": [{"author": "וואלק תקשיבו", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלכס דיסקין\nחוות דעת - הרצאות: משעממות אבל חשובות מאוד למבחן. יש לו מלא הערות צד כאלה שעליהן מתבססות שאלות. בגדול אלכס מסביר יחסית ברור (יחסית לשאר הקורסים בטכניון כמובן).\n\nשם המתרגל/ת: לא זוכר וגם לא רשום בדף מידע (XD) לא נמרוד לצערי\nחוות דעת - תרגולים: רוב הזמן זה מיותר. כן צריך על טכניקות לעבור ברפרוף אבל לא להתעכב מדי.\n\nשעורי הבית: למי שזה מעניין שלא ירפרנס. אחרת - רפרנסו בליינד בכיף.\nהמבחן: יש חומר פתוח, כמעט כל המבחן מבוסס הרצאות ועל מיני תובנות side stories של אלכס. אין ברירה אלא ממש לעבור על ההקלטות (אם יש) או לסמוך על מישהו שיסכם. מבחן לא קל כל כך אבל מי שמכיר את אלכס הוא שואל דברים מאוד ספציפיים מתוך ההרצאה שדורשים מניפולציה קטנה עבור התרגיל במבחן ולכן עצה שלי- לשים סימניות בחומר ולהיות סגורים היטב מה נמצא בהרצאות ואיפה.\n\nהשורה התחתונה: הקורס בסדר. מבחן מועד א' היה סביר ברמת הקושי.", "timestamp": 1627719817786}, {"author": "מוסיף", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "השורה התחתונה: רק רציתי להוסיף שאם איתמר מלמד המתרגל של הקורס - לא לקחת. ממליץ להיכנס סתם לתרגול שלו מתישהו כדי להבין כמה גרוע תרגול יכול לעבור. אחרי החוויה הזו כל מתרגל אחר ייראה ברמה של צנזור.\n\nמעבר לזה התגובה הקודמת מסכמת יפה.", "timestamp": 1658155221915}, {"author": "~", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאלכסיי מרצה טוב, אבל הקורס לא מומלץ למי שלא חי ונושם RF. למי שיש אינטואיציה לדברים האלה הקורס בהחלט יכול לתת ערך מוסף. אם אתם באים בשביל לפתח את האינטואציה הזו אז תעשו לעצמכם טובה והרבה שעות של תסכול ואל תתקרבו לקורס. הייתי בכל ההרצאות ורק להבין מה קרה בשעתיים של ההרצאה לקח לי חצי יום. המצגות בנויות בצורה של \"הנה שקופית עם ארכיטקטורה של מסנן, הנה הפונקצייה תמסורת שלו, בואו נדבר על זה\" וזה קורה במשך 30 שקופיות של כל הרצאה בערך. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nתרגולים כתובים בצורה נוראית, יש אי תאימות של המונחים וההגדרות בין דפי ההרצאות לתרגול. לא תורמים בשום צורה להבנה של החומר ולגמרי אפשר לוותר עליהם(ברמה של אפילו לא להדפיס למבחן-חבל על הדפים). באופן כללי הרגיש לי שהמתרגל רק רצה לסיים וללכת. (לגמרי ייתכן שהוא ירש את הדפים ממתרגל קודם שעשה שם ברדק ואז אין לי טענות כלפי המתרגל הנוכחי)\n\nשעורי הבית: \nהיבשים בסדר, יש רטוב שצריך לתכנן מסננים ברמת הטרנזיסטורים (לקבוע אורך/רוחב/מתחים וכ'), עכשיו זה יכול להיות תרגיל טוב ומלמד אבל לא נוגעים בזה בכלל בקורס אז זה מרגיש מאד מנותק ולא קשור לכלום. אני ויתרתי על לעשות אותו.\n\nהמבחן: \nאם אתם אוכלים RF לארוחת בוקר וזכרתם את כל הסיפורים של אלכסיי מההרצאה(שלא כתובים במצגות) אז לא אמורה להיות בעיה. המבחן אמריקאי שזה טוב כי אפשר לנחש מה הכי הגיוני, אבל פחות טוב כשצוות הקורס לא טורח לעבור על התשובות ומשנה את אחת התשובות (אחרי שעה של מבחן כן) ל\"אף תשובה לא נכונה\" \n\nהשורה התחתונה: \nלקחתי כי שאר הקורסים בשרשרת VLSI מתנהלים ומועברים באופן זוועתי ומסננים נשמע הכי פחות נורא. מסתבר שהוא לא שונה משאר השרשרת. תעשו לעצמכם טובה ותעשו הספק/רשתות/עיבוד אותות במקום.", "timestamp": 1659036026014}, {"author": "Jord", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: הרצאות משעממות וכבדות בפורמט של \" תראו את המסנן ,אלה התכונות שלו\" מלאאאא נוסחאות ותכונות ולא הכל עם הוכחה. תכלס לשבת ולספוג ים מידע כשחלקו מגיע ללא הוכחה ומרגיש חצי רנדומלי \n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: אין ערך מוסף, התרגולים עוברים לא טוב וכתובים לא טוב. הקורס הראשון שאשכרה הכל מההרצאות.\nהמתרגל בעצמו מרגיש שהוא לא חד על החומר חלק גדול מהזמן.\n\nשעורי הבית: \n3 גיליונות + רטוב. \nגליונות ארוכים ורטובים בחלקם הגדול למרות שכאילו בהגדרה יבשים , בנוסף יש תרגיל רטוב בסוף שיצא בזמן הכי לחוץ שיש ומתבסס על ידע קודם מVLSI ואלקטרונים.\n\nהמבחן: \nבונה על זה שאנחנו מגיעים מהעולם תוכן הזה, דברים שנראים טריויאלים לאלכס ולאלו שעובדים בתחום - לא טריויאלים כלל לשאר הקורס והסגל לא מבין למה. \nבגדול - לדפדף באטרף בחומר הפתוח ולקוות שאתה תזכור שקיימת נוסחא קטנה כלשהי איפשהו בחוברת של ההרצאות וגם איפה היא הייתה (כדאי להביא גם נוסחאון של אלקטרוניים)\n\nהשורה התחתונה: \nאם אתם לא מהתחום וסתם מחפשים קורס נחמד לסגור שרשרת וכו' - לא מומלץ!!!!", "timestamp": 1659352896129}, {"author": "הראשונה לשמה", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלכסיי\nחוות דעת - הרצאות: לא ברור איזה חומר רלוונטי ואיזה לא, יש המון סימונים והגדרות מבלבלים שאם לא נסגרים עליהם מתחילת הסמסטר מאוד קשה לעקוב. החומר עצמו די טכני, לא מאוד אינטואיטיבי ונוגע במלא נושאים מבלי להבין אותם לעומק.\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: אחלה מתרגל, חזק על החומר, עונה על שאלות ומאוד עוזר.\n\nשעורי הבית: איום ונורא. תרגילי בית רטובים ויבשים שדורשים המון חישובים וניחושים ועבודה עם ספייס ומטלאב. תרגיל סופי תקף שהכשיל חצי מהקורס ודרש לפחות יום שלם של עבודה.\n\nהמבחן: אמריקאי עם שאלות מכשילות וטריקיות ומלא טעויות שתוקנו באמצע רק אחרי שביקשנו כמה פעמים שיבדקו את העניין (וכמובן שלא פיצו על הזמן). המרצה התייחס בזלזול מוחלט לטענות שלנו. \n\nהשורה התחתונה: לא לקחת! שום דבר לא מצדיק יחס כזה.", "timestamp": 1660513190022}, {"author": "...", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהסמסטר נתן התייחסות ממש נוראית לסטודנטים וכמעט הכשיל את הכל במועד ב למרות שזה קורס שרשרת ולא אמור להיות ברמה כזאת . כל הסמסטר ההקלטות היו עם מסך לבן ולא התייחס לאנשים שצופים ולא יכלו להגיע להרצאות . \nההרצאות שלו כתובות באנגלית בצורה ממש מבולגנת כמו מאמר מדעי או היסטוריה וזה ממש מקשה ללמידה .\nלא משהו בהסברים .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהוא רק קורא מהדף ולא יודע לתקשר עם האנישם בכיתה , לדעתי זה יותר חשוב מלהכיר את החומר וכם מבולגן מאד והתרגולים לא קשורים לחומר ולא לרמה של המבחן\nשעורי הבית: \nממש ארוכות וגם הסמסטר הוא החליט שהפרויקט הוא תקף ולא מגן ומהווה 5% מהציון וגם תיקנו את זה בזהירות ונתנו ציונים נמוכים לרוב הסטודנטים למרות שהוא הסביר בהרצאה ראשונה שלא אכפת לו בדרך כלל ונותנים 100 לכולם וגם התעקש על זה הרבה מול נציג הקוס\nהמבחן: \nמועד א קרוב לרמה של שאר המבחנים שמפורסמים אבל מועד ב הוא לא מפרסם לא מבחן ולא פתרון אפילו בגלל שיש מספר לא גדול של סטודנטים הוא גם לא מפרסם היסטוגרמה . רק שתדעו לכם שרמת מועד ב ממש יןתר קשה ממועד א והוא מתייחס בכל השאלות לנושאים הכי בעייתיים בקורס . \nהשורה התחתונה: \nלא לקחתתת ולא להתקרבב בכלל מאכזב ברמות \nלא כל המלצה בפייסבוק היא מוצדקת", "timestamp": 1665062900985}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אלכסיי דיסקין\nחוות דעת - הרצאות: הרצאות מעולות. החומר עדכני ורלוונטי, קורס חובה למי שמתעניין בתחום. אלכסיי מעדכן כל הזמן את ההרצאות והוא אחד המרצים הטובים בפקולטה. מקפיד להתחיל כל הרצאה בחזרה על החומר מההרצאה הקודמת ולסיים עם סיכום של הדברים החשובים שצריך לקחת מההרצאה.\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאיתמר מתרגל טוב, הוא מסביר ברור, מדהים בחומר ועונה על השאלות וגם הרבה מעבר.\n\nשעורי הבית: \nיבשים לא קשים וממוחזרים, הרטוב גם לא מאוד מורכב אבל כן לוקח יומיים עבודה שלא כזה משתלמים עבור 5% (תקף).\n\nהמבחן: \nאמריקאי שדומה למבחני עבר. לא ניגשתי למועד ב'. יש הרבה שאלות הבנה למרות שזה אמריקאי, וצריך גם לשלוט במעגלים אנלוגיים בסיסיים (CS CG CD קסקוד ומגבר דיפרנציאלי).\n\nהשורה התחתונה: קורס מעולה, מומלץ.", "timestamp": 1672680228174}, {"author": "MM", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה:אלכסי \nחוות דעת - הרצאות: \n\nשם המתרגל/ת:איתמר מלמד\nחוות דעת - תרגולים: מתרגל גרוע מאוד מאוד. בנוסף הוא ממש ממש מזלזל בשאלות של סטונדטים ועונה בצורה מאוד לא מכבדת.\n\nשעורי הבית: עמוס מאוד ביחס ל15% תקף שהשיעורי בית+פרויקט שווים. מלא מטלאבים מעייפים ומייגעים. ושלא נדבר על הפרויקט שצריך איכשהו להסתדר איתו כי המתרגל ממש לא מתפקד ולא עוזר.\n\nהמבחן: מזעזע!!!!!!!!!!!! חישובים מייגעים שנעשו בקורסי עבר והמרצה מצפה שתזכרו איך לעשות. המרצה שואל את כל השאלות השוליות והלא חשבות שנאמרו במהלך ההרצאות וממש מנסה להפיל. הממוצע של המבחן היה נמוך מאודדדד וזה אחרי שהם ניסו לנרמל\nהשורה התחתונה: \nלא לקחת את הקורס הזה!!!!!!!!! ממוצע נמוך, מבחן קשה, ואחוזי תרגילי בית לא מתגמלים בכלל (ומייגעים) פשוט לא שווה את זה!!!!", "timestamp": 1691267393618}, {"author": "MMM", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: אלכס מרצה טוב,יודע להסביר את החומר ואין לו בעיה להתעכב על פרטים קטנים בזמן ההרצאה על מנת שכולם יבינו בנוסף גם מאוד רספונסיבי במייל.\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: קצת בעיה לתת חוות דעת כי 50% מהתרגולים הוא לא היה פשוט והפנה אותנו להקלטות.\n\nשעורי הבית: פה הבעיה הגדולה לדעתי לשיעורי בית צריך להיות משקל הרבה יותר גדול,5 גליונות יבשים כל אחד 1% זה קצת לא תואם את הרמה שלהם,בנוסף הפרוייקט עם הוראות קצת מעורפלות ומהווה 10% אין פרופורציות במשקל של שיעורי בית בקורס הזה לדעתי.\n\nהמבחן: אני חושב שהפעם היה קצת יותר תיאורתי לעומת שנים שעברו שהיו מביאים מסננים מוכרים והיה צריך רק לזהות אותם ולהתאים את הנוסחאות שפותחו בהרצאה,עם זאת היה תיקון לחישוב הניקוד ולי אישית אין תלונות לא יודע מה עם השאר.\n\nהשורה התחתונה: זה לא קורס חפיף יש הרבה דקויות ולכן כדאי להיות על החומר ולהכיר את ההרצאות כי זה החומר הפתוח שלכם בבחינה ,מקווה שירימו את המשקל של השיעורי בית בעתיד כך שיהיה להם יותר חשיבות וגם שיהוו מגן.", "timestamp": 1691319264270}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלכסיי דיסקין\nחוות דעת - הרצאות: ההרצאות עברו בצורה הבאה לרוב, השעה הראשונה בהם החומר מוסבר דיי טוב, ואז בשעה השנייה המרצה קולט שיש עוד עשרים שקפים ולא נספיק את החומר ולכן רץ על המצגת ולא מבינים כלום. ברוב ההרצאה פשוט מפתחים צורה מסוימת של מסנן\\ דברים אחרים שכוללים הרבה מתמטיקה מייגעת. לדעתי זאת לא הפואנטה של המרצה לכן הוא מרגיש חופשי לרוץ עליהן. לדעתי הוא כן מרצה טוב, אבל היחסי אנוש שלו מול הסטודנטים לא מדהימים.\n\nשם המתרגל/ת: אלכס זביאגינצב\nחוות דעת - תרגולים: התרגולים הם פשוט החלק הכי גרוע בקורס, אלכס לא יודע את החומר. לא עובר על התרגולים לפני, הרבה פעמים הערנו לו שיש טעויות בתרגולים (שלא תוקנו מ-2016) אבל לא אכפת לו יותר מידי. ההתנהלות שלו מול הש\"ב הייתה דיי ביזיונית ובכלל נראה שלא אכפת לו מהקורס\\ מהסטודנטים.\n\nשעורי הבית: בתחילת הסמסטר כל תרגיל יבש היה שווה 1%. וזה לגיליונות הכי ארוכים שראיתי בהשוואה לכך אי פעם, גיליון יכול להגיע בכיף ליותר מעשרים עמודים, אין תרגיל כמעט שלא צריך לסמלץ בו (וזה התרגילים היבשים כן?) הם כוללים לא מעט מתמטיקה מייגעת. אחרי תלונות על אורך התרגולים העלו משמעותית את המגן ל-3% לכל תרגיל (ולדעתי שווה לדרוש את זה מראש). במקרה הזה ש\"ב עדיין קצת ארוכים אבל זה לפחות מגן סביר.\n\nהמבחן: המבחן לדעתי היה הוגן מאוד, לא היו בו איזה הפתעות גדולות וניכר שלפחות הסמסטר המרצה רצה לעשות מבחן פתיר. חלק גדול מהמבחן הוא להתאים את התוצאות שקיבלנו בהרצאות לנתונים בשאלה ולפתור. יש גם שאלות הבנה דיי מתחכמות על החומר וצריך לשלוט בדקויות של הקורס כדי להצליח בו.\n\nהשורה התחתונה: בעיני הקורס היה מעניין, אבל הוא סובל מבעיות שיקשו עלי מאוד להמליץ עליו. גם למרצה וגם למתרגל לא נראה שאכפת יותר מההבנה בקורס, ובפרט הייתי ממליץ להתרחק מהקורס כל עוד המתרגל נשאר אלכס. בנוסף המרצה שואל הרבה מאוד שאלות הבנה במבחן שדורשות באמת ידע מעמיק בקורס. \nבסה\"כ אם עולם האנלוג מאוד מאוד מעניין אתכם, אתם לא פוחדים ממתרגל גרוע, ש\"ב ארוכים ולא מובנים לעיתים, ומבחן שיכול להיות גם מזעזע אז יש לכם סיבה לעשות את הקורס, אחרת אין ממש סיבה טובה לקחת אותו.", "timestamp": 1714934755709}]}