{"posts": [{"author": "חמוס קופצני", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  כפיר לוי\nחוות דעת - הרצאות: \nאני פחות התחברתי, והוא לא היה מאה אחוז על כל החומר. יש רשימות טובות באנגלית שאפשר לקרוא במקום.\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: \nהתרגולים עצמם כתובים מעולה, משום מה לקורס מוגדרת שעה ולא שעתיים של תרגול אז טל נאלץ לטוס עליהם ולא להסביר כמעט מעברים.. אני אישית קראתי במקום לראות את הוידאו\n\nשעורי הבית: עמוס בערך כמו שאר הקורסים, יבשים קצת משעממים אבל חשובים למבחן, רטובים מגניבים\n\n\nהמבחן: הוגן סה\"כ\n\nהשורה התחתונה: קורס טוב וחשוב, צריך לעבור על ההרצאות והתרגולים מעבר למה שנעשה פרונטלי", "timestamp": 1612484660445}, {"author": "Guy Yoffe", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: כפיר יהודה לוי\nחוות דעת - הרצאות: לא מדהים. מרגיש שהוא קצת מחפף, קצת לא סגור על הכל, לא תמיד מסביר בצורה מאוד ברורה\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: אחלה מתרגל. קצת מהיר, ולפעמים קצת לא ברור, אבל מאוד מאוד משקיע בסטודנטים ובתרגולים. סה\"כ מתרגל טוב.\n\nשעורי הבית: מרורפנסים, קצת ארוכים, לא מאוד קלים. 3 יבשים ו2 רטובים.\n\nהמבחן: מבחן קשה. הרבה הסתברות, חומר די רחב, מעט מאוד זמן ל4 שאלות כדי לכסות את כל הנושאים בקורס.\n\nהשורה התחתונה: קורס שיכול להיות ממש מעניין, אבל לא נוגע כמעט בכלום, בסופו של דבר לא קורס שהייתי ממליץ עליו.", "timestamp": 1612711983374}, {"author": "&", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות: \nמרצה לא מאוד טוב ולא ממש על החומר. הרצאות די מבולגנות ולא הכי מסודרות. במודל יש סיכומי הרצאות באנגלית לרוב הקורס שעושות הרבה יותר סדר. \n\nשם המתרגל/ת: טל דניאל \nחוות דעת - תרגולים: \nמתרגל מאוד טוב ומשקיע, אוהב את החומר וזה ניכר עליו. התרגולים כתובים במחברות יופיטר מסודרות עם המון הסברים, יש גיט לקורס ומהבחינה הזאת מאוד נח לעקוב אחרי מה שקורה בתרגולים. לא תמיד מסונכרנים עם ההרצאות \n\nשעורי הבית: \n3 יבשים, שני רטובים. עמוס אבל לא הרבה יותר מקורסים אחרים\n\nהמבחן: \nסהכ הוגן, לפעמים יש שאלות קצת מוזרות\n\nהשורה התחתונה: \nמומלץ", "timestamp": 1615735466230}, {"author": "נפגעי כפיר", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: כפיר לוי\nחוות דעת - הרצאות: מבולגנות, לא ברורות בכלל. יש לו יכולת מופלאה לקחת את הנושאים הכי מעניינים/פשוטים ולהפוך אותם למשעממים/מסובכים.\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: מתרגל סבבה, רץ על הדברים אבל פשוט אין מספיק זמן בתרגול\n\nשעורי הבית: 3 יבשים ו2 רטובים מרופרנסים, אבל הרפרנסים לא קלים להבנה בכלל...\n\nהמבחן: יש שאלות שדומות מאוד לחישובים מהתרגול, אבל היו גם שאלות שהקשר בינן לבין חומר הקורס מקרי בהחלט.\n\nהשורה התחתונה: בחיים לא סבלתי ככה בקורס. בשבילי זה כבר היה מאוחר מידי, אבל לכם יש עוד זמן להתחרט", "timestamp": 1616489396945}, {"author": "עידו", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ???\nחוות דעת - הרצאות: מעניינות, לא ברורות לגמרי\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים:  התרגולים בסדר, אבל המתרגל לדעתי לא משהו\n\nשעורי הבית: קשים\n\nהמבחן: לא פתיר, הרבה פקטורים ונרמול מעלה לכיוון סופי ממוצע 80\n\nהשורה התחתונה: לא ממליץ, אלא אם כן אתם טובים בלמידה לבד", "timestamp": 1616582807707}, {"author": "A^^", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רון מאיר\nחוות דעת - הרצאות: \nכמויות של חומר,ופיתוחים מתמטיים שקשה לעקוב אחריהם. חלק גדול מהחומר מופיע רק בהרצאה \nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: התרגולים כתובים טוב ,יש גם הרבה דוגמאות למימושים שמשתמשים בהם אחר כך בתרגילי בית ככה שזה נוח. אבל הם ארוכים ולרוב לא מסיימים אותם. כל תרגול זה חומר שונה וקל מאוד ללכת לאיבוד\n\nשעורי הבית: 2 רטובים ו3 יבשים שבהם יש גם חלק רטוב. לוקחים הרבה זמן ולא פשוטים בכלל\n\nהמבחן: הלמידה למבחן הייתה שינון חומר,כי פשוט יש כמויות לא סבירות שלו. היו צריכים להוריד מעט נושאים ולהתעמק בנושאים היותר חשובים\n\nהשורה התחתונה: יש לקורס הזה עוד הרבה איפה להשתפר. אם לא חובה עבורכם - כדאי לוותר.", "timestamp": 1645368945902}, {"author": "VAE", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רון מאיר\nחוות דעת - הרצאות: החומר של הקורס מעניין וחשוב מאוד בכל הקשור לתחום של מערכות לומדות. חלק מההרצאות עברו בסדר גמור (סטטיסטיקה וגם חלק מהנושאים בהמשך) אבל חלק מהנושאים היו מאוד קשים לעיכול (בעיקר VAE בעיניי) דרך ההרצאות - נושאים מסורבלים מתמטית ולא נראה שהמרצה הצליח לפשט אותם במיוחד.\n\nשם המתרגל/ת: טל (חצי ראשון) ליאור (חצי שני)\nחוות דעת - תרגולים: שניהם יודעים את החומר מעולה. טל הקליט תרגולים קצת יותר ארוכים מה שגרם לזה שהם יהיו יותר ברורים. ליאור קצת טס על החומר מה שמוזר כי גם ככה יש המון חומר בתרגולים. בכל פעם שחשבתי שעברתי על התרגול טוב גיליתי שיש עמודים שלמים שלא הספיקו לכסות כל כך.\nבכל מקרה שניהם מתרגלים בסדר (התחברתי קצת יותר לטל) פשוט התרגולים מאוד עמוסים.\n\nשעורי הבית: \nעמוסים יחסית אבל לגיטימיים בשביל 30%, עזרו במידה סבירה ללמוד את החומר עוד במהלך הסמסטר מה שקצת הקל לקראת המבחן.\n\nהמבחן: \nדורש שליטה גבוהה מאוד בחומר, אסור לפספס שום דבר שעבר בהרצאות/תרגולים לפני המבחן. לפעמים יש שאלה או 2 כמעט ממוחזרות מה שהופך חלקים מהמבחן לפשוטים יותר. בדרך כלל גם שאלה או 2 'יצירתיות' שעושות את המבחן קשה יותר.\nאמנם במועד א' שלנו זה לא היה חלק מהמבחן - אבל גם נדרשת שליטה גבוהה מאוד באלגברה בחלק מהנושאים מה שהקשה מאוד על חלק ממועדי העבר לדעתי, צריך להתעמת עם אלגברה הרבה בלמידה למבחן. (וכמו כל קורס בלמידה - כמובן שחובה לשלוט טוב בהסתברות)\n\nהשורה התחתונה: \nקורס לא פשוט אבל מאוד מומלץ לדעתי. באתי אחרי פרויקט א' שלי שעסק בלמידה, אשכול, וקבלת החלטות (סטטיסטיקה) ואני חושב שאם הייתי עושה אותו אחרי ענ\"מ הייתי מבצע אותו הרבה יותר טוב. גם אם לקורס יש מעט חסרונות, אני כן ממליץ עליו כי לומדים הרבה עקרונות חשובים בתחום, וגם מרחיבים את הידע על אלגוריתמים שונים ועדכניים.", "timestamp": 1645431445599}, {"author": "Roy Mahlab", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רון מאיר \nחוות דעת - הרצאות: השליש הראשון של הקורס והוא על סטטיסטיקה בעיקר והוא די משעמם, לדעתי רון מרצה טוב באופן כללי אבל הרגיש שדווקא את שאר החומר הוא הצליח להעביר פחות טוב מהתרגולים נגיד. אבל עדיין בהרצאות חשובות.\n\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: אחלה של טל דניאל מי שיכול שווה להגיע אליו בלייב לדעתי\n\nשעורי הבית: קשים ומרופרנסים ברובם.\n\nהמבחן: התבסס הרבה על הוכחות מהתרגולים דווקא, היה קל יותר משנים קודמות לדעתי\n\nהשורה התחתונה: קורס ממש מעניין ואני מאוד ממליץ", "timestamp": 1647365095235}, {"author": "תלמדו מהטעויות שלי בבקשה", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רון מאיר\nחוות דעת - הרצאות: \nהחומר מאוד משעמם, זה פשוט הוכחות בהסתברות. בקושי מראים פרקטיקה בהרצאות, ויש תחושה שגם רון עומד להרדם תוך כדי ההרצאה.\nשם המתרגל/ת: טל דניאל\nחוות דעת - תרגולים: \nטל באמת מקסים, הוא חנון מצחיק כזה ורואים את זה בכל הקבצים של התרגולים ושיעורי הבית. יש לו תשוקה לא מוסברת לתחום והוא נקודת האור היחידה בקורס החשוך הזה.\nשעורי הבית: \nמאוד מאוד מאוד עמוסים (על הסף הלא שפוי ללא רפרנס). יש יבשים שהם מאוד לא ברורים (מומלץ לרפרנס ואחר כך לנסות להבין), ורטובים בפייתון שהם באמת לא שפויים.\nהמבחן: \nמקצוע עם מבחנים באמת באמת באמת גרועים. בקושי בוחנים על החומר, בעיקר על הוכחות בהסתברות ואלגברה. אם אתה לא מכיר בע\"פ את כל הטריקים מההרצאה, התרגול, זוכר בע\"פ את כל החומר והשקפים, פלוס יודע חומר שלא מלמדים, סביר להניח שלא תדע לפתור את רוב המבחן. בגלל שהם מנרמלים ממוצע כל מבחן ל80, אבל פקטור זה משפיל מידי לסגל, יש חלוקת ניקוד אקראית לחלוטין ככה שעל מבחן שמגיע לך בו 15-30 נקודות מקסימום, תקבלו 65-75 סופי. לא שווה את הלחץ וההשפלה. בנוסף חשוב לדעת! הקורס הזה הוא תנאי מעבר להרבה אנשים ממכללות שרוצים להתקבל לתואר שני, ובכללי הרבה אנשים מתואר שני לוקחים אותו! הם לוקחים את הקורס הזה בבלעדיות באותו סמסטר, ככה שיש להם הרבה יותר זמן ללמוד ולהעמיק, והם מהווים את החלק העליון של ההיסטוגרמה. מי שבתואר שני, תתכוננו להיות בתחתית שלה!\nהשורה התחתונה: \nנשמות, תשכחו מהשרשרת הזאת, תעברו למשהו יותר שפוי כמו הספק, מיקרו ננו, VLSI. זה לא שווה את זה. השמועה אומרת שלמידה מחיזוקים לא יותר טוב.", "timestamp": 1648039187836}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רון מאיר\nחוות דעת - הרצאות: ההרצאות קשות ולא הכי ברורות.\n\nשם המתרגל/ת: דן הרמתי\nחוות דעת - תרגולים: דן מתרגל ממש טוב, שעוזר מאוד להבין את החומר. התרגולים חשובים מאוד בשביל להבין את הקורס ולהצליח במבחן (שלפעמים שאלות שלו הן כמעט זהות לפיתוחים שעושים בתרגולים).\n\nשעורי הבית: התרגילים היבשים קשים ולוקחים זמן. אבל הם מאוד דומים לדברים שיש במבחן ולכן חשובים.\n\nהמבחן: קשה, מתמטי, ומתבסס על פיתוחים די קשים שרואים במהלך הקורס.\n\nהשורה התחתונה: הקורס מעניין וחשוב למי שרוצה להתעסק ברצינות עם בעיות שיערוך, ML, דאטה וכו'. נוגע בהרבה נושאים מעניינים שטוב להכיר. אבל הוא מאוד קשה ומתמטי וכדאי לדעת את זה מראש.", "timestamp": 1675781189987}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רון מאיר\nחוות דעת - הרצאות: מעניינות, אך מלאות בתיאוריה. לוקח זמן להבין את חלקן\n\nשם המתרגל/ת: ליאור פרידמן/דן הרמתי\nחוות דעת - תרגולים: בסך הכול מתרגלים טובים, אך התרגולים ארוכים מאוד, ולרוב לא מסיימים אותם תוך שעה או שפשוט מדלגים על חלקים מהם\n\nשיעורי הבית: בסדר. רובם לא קשים מדי\n\nהמבחן: לדעתי, הוגן מאוד. רצוי לעבור טוב על התרגולים וגם על ההרצאות במידת האפשר\n\nהשורה התחתונה: קורס מעניין מאוד. אמנם הוא עמוס אך ממש לא בלתי נסבל", "timestamp": 1676807043174}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רון\nחוות דעת - הרצאות: לא מעביר כל כך טוב את ההרצאות. בן אדם מאוד נחמד אבל הוא לא קוהרנטי בדיבור, וזה מאוד מקשה לעקוב אחרי מה שהוא אומר. הבעיה היא שהוא מתחיל לומר חצי משפט, נתקע, ואז ממשיך למשפט הבא בהקשר לא ברור.\n\nשם המתרגל/ת: ליאור + דן\nחוות דעת - תרגולים: ראיתי את שניהם במוקלט. שניהם ממש טובים, ונראים אנשים ממש טובים ביחס שלהם לסטודנטים + מסבירים את החומר ממש טוב.\n\nשעורי הבית: \nהיבשים סבבה, הרטובים קצת עמוסים אבל פתאום לראות איך מודלים גנרטיביים אשכרה עובדים במציאות, ולהבין איך זה עשה את זה היה שווה את כל ההשקעה. מהרטובים הבודדים בתואר שנהניתי מהם נטו כי הם מגניבים.\nהמבחן: \nהרבה יותר טוב והוגן ממה שחשבתי. לא היו שאלות שהיו מחוץ לסקופ של מה שעבר בכיתה, והרמה הייתה סבירה לסטודנטים. הופתעתי לחיוב בפעם הראשונה בתואר.\nהשורה התחתונה: מאוד ממליץ על הקורס, החומר מעניין מאוד והמבחן ממש אחלה. קצת עמוס אבל שווה את זה.", "timestamp": 1714743819483}, {"author": "קרטמן", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nרון מאיר\n\nחוות דעת - הרצאות: \nמרצה טוב בעיניי. מאוד אדיו וסבלני, מסביר לאט יחסית. תחילת הקורס מתמטי מאוד וקשה יותר לעקוב, אבל אם עוברים על הרשימות הסופר מסודרות של רון אפשר להבין. ההמשך סופר מעניין הרבה פחות מתמטי ויותר קונספטואלי. \nבנוסף, שאפו ענק לרון, הקורס כל הזמן מתחדש, הסמסטר נכנס חומר לקורס של איך עובד הchat-gpt ודומיו. הספר שהתבסס עליו ההרצאה יצא ב2023. אז ממש לומדים במשך הקורס את הקאטינג אדג' של התחום שזה ממש מגניב לקורס בטכניון.\n\nשם המתרגל/ת: \nדן הרמתי/ליאור פרידמן\n\nחוות דעת - תרגולים: \nשניהם די טובים. יודעים את החומר ונותנים דגשים חשובים. רשימות התרגול מדהימות מכילות המון פרטים ומימושים של כל הדברים, אפשר מלעבור עליהם להבין המון.\n\nשעורי הבית: \n30% מהציון. 2 רטובים ו2 יבשים. בשביל 30% מהציון ממש ממש סבבה, לא לקח הרבה בכלל. ביחס לקורסי בחירה אחרים בפקולטה זה די מתנה ה30%, רוב הקורסים האחרים שעשיתי היות פי 5 עבודה על 15 או 20 אחוז.\n\nהמבחן: \nמבחן שבודק שבאמת אתם יודעים מה היה בהרצאות ובתרגולים. לדעתי כדאי לעשות מעבר מקיף על החומר ורק אז מבחנים. ספציפית בסמסטר שלנו היה יותר קשה מהרגיל כי היה אלגוריתם שפחות מופיע במבחני עבר.\nסך הכל אפשר עם למידה טובה להצליח, הממוצע גם לא רע. \n\nהשורה התחתונה: \nקורס מעולה. עשיתי הרבה קורסים של אותות ולומדות וזה אחד הכי טובים ורלוונטים. הרגשתי ממש תיקון ממבוא למערכות לומדות, שם הרגשתי שאני לא מבין כלום. אחרי ענ\"מ אני מרגיש שאני הרבה יותר מבין את הנושא של למידה. \nזה קורס ראשון שחושף לנושא של דאטה אנליסיס, בלעדיו אני חושב שהיה לי מאוד קשה להבין את זה, וזה נושא ענק וחשוב. הקורס רלוונטי, רוב האלגוריתמים שלומדים הומצאו ב5 שנים האחרונות, ואלגוריתמים ישנים יותר שמשתמשים בהם המון.", "timestamp": 1717259438457}]}