{"posts": [{"author": "Guy Harel", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אדוארדו מעיין\nחוות דעת - הרצאות: איטי מאוד, מומלץ לראות בוידיאו במהירות כפולה\n\nשם המתרגל/ת: ניקולס\nחוות דעת - תרגולים: לא משהו מיוחד\n\nשעורי הבית: עמוסים מאוד, ודרשו הרבה עזרה שהיה קשה יותר לקבל בסמסטר קורונה\n\nהמבחן: קשה ולא מותאם לזמן, אבל רק 50 אחוז מהציון.\n\nהשורה התחתונה: הנושא יכול להיות מעניין, אבל דורש הרבה יותר ארגון וחידוד של הקורס כדי שיהיה מוצלח.", "timestamp": 1599218029779}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  אדוארדו מעיין\n\nשם המתרגל/ת: ברק הופר \n\nשעורי הבית:  בסמסטר שלנו היו 2 תרגילי מחשב רטובים ו2 תרגילים יבשים לקראת סוף הסמסטר, וסה\"כ 50% מהציון הסופי. לא עמוסים, אך כדי לפתור את התרגילים היבשים צריך להיות על החומר במהלך הסמסטר. בנוסף לנ\"ל, ישנם גליונות שבועיים שאינם להגשה, ושיכולים ללמוד מהפתרונות שלהם.\n\nהמבחן:  ארוך,  ואינו קל לפתרון. במבחן תמיד יש שאלה אחת לפחות שצריך להפעיל בה שיקול הנדסי ולבחור בין אפשרויות, ואין פתרון יחיד לשאלות כאלה. מה שחשוב זה להפגין הבנה ושיקולים נכונים בהתאם לדרישות.  חשוב להדגיש גם על ההרצאות, שכן ישנן שאלות שמתבססות עליהן, ולדעתי התרגול לא מספיק. \nהבעיה היא שאין פתרונות רשמיים למבחני העבר, למעט לשני מבחנים ולשני ת\"ב יבשים שהתבססו על מבחנים קודמים. חוץ מאלה, אין פתרוונות רשמיים וחייבים ללמוד מהסריקות שבדרייב ולשאול את הסגל אם משהו לא ברור. ממליץ בחום להדפיס את המבחנים ולהביאם למבחן. ככל שפותרים יותר, כך  מתרגלים יותר לסגנון המבחן בזמן אמת. \nהמבחן מורכב מ-3 שאלות שעוסקות בתכן קומבינטורי ודומינו, layout ותהליכי ייצור, מערכות סינכרוניות. \n\nהשורה התחתונה:  קורס מומלץ ביותר למי שמתכנן לעסוק בתכן פיזי של vlsi. הלמידה למבחן אינה קלה, ומצריכה חילוץ סריקות ופתרון הרבה מבחנים עד שמתרגלים. \nבהצלחה לכולם!", "timestamp": 1628087295155}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  אדוארדו מעיין\nחוות דעת - הרצאות: \nלדעתי אדוארדו בן אדם נחמד מאוד ויודע להעביר את ההרצאות בצורה ברורה ומובנת. אם יש נושא לא מובן הוא נוהג להסבירו כמה פעמים בסבלנות.\nאבל קל לאבד ריכוז אם לא חוזרים על החומר של הרצאה קודמת כמו שצריך.\n\nשם המתרגל/ת: ברק הופר\nחוות דעת - תרגולים: \nתרגולים בינוניים מאוד, מרגיש כאילו הוא מקריא ממצגת ולא באמת מעביר שיעור מול כיתה שלמה, לעיתים גם לא מסביר לעומק איך פותרים תרגילים ואת הנקודות העדינות שעליהם מורידים נקודות במבחן.\nאבל גם ברק הוא מאוד מקצועי, אם שואלים אותו שאלות בכיתה או בפורום הוא עונה ומסביר בצורה טובה מאוד.\n\nשעורי הבית: \nשיעורי בית ארוכים מאוד, יש 2 תרגילים רטובים ו 2 יבשים. \nהרטוב הראשון יכול לקחת חודש שלם, יש בו הרבה טעויות ודברים לא מובנים ואפשר בכיף להתקע על כל סעיף קטן במשך שעות, זה תרגיל שאכל ממש את הזמן בסמסטר. הרטוב השני היה יותר סביר והיה אפשר לסיים אותו תוך שבוע אינטנסיבי של עבודה.\nהתרגילים היבשים היו מבלבלים ולא פשוטים אבל הם מכינים מעולה למבחן.  זה נראה כמו לקט של שאלות ממבחנים, אבל התרגילים ממש לא פשוטים ולא מספיק יוום יומיים כדי לסייים אותם.\nהבדיקה של תרגילי הבית היא קשוחה מאוד, זה לא כמו בקורסים אחרים שמחלקים מאיות, בגלל ששיעורי הבית מהווים 50% תקף מהציון. אם אתם חושבים לזלזל בתרגילי הבית או לרפרנס זה לא הקורס בשבילכם וזה יפגע בכם מאוד בציון.\nהמבחן: \nמבחן קשה וארוך מאוד, דומה באופיו לתרגילי הבית אבל כאשר יש 3 שעות ולא שבוע לחשוב על כל סעיף יוצא שאי אפשר לענות כמו שצריך על הכל וקל מאוד להתבלבל.\nכמו כן, אין פתרונות למבחנים או לשיעורי הבית כך שהלמידה למבחן היא תהליך לא פשוט.\nאבל קחו בחשבון שהסגל מאוד מתחשב, אין פתרון נכון אחד והרבה תשובות מקבלות כמעט את רוב הנקודות כך שבסוף הציון הסופי יוצא בסדר.\nהשורה התחתונה: \nתתכוננו להשקיע בקורס הזה, באמת קורס מעניין ולומדים דברים חשובים אבל זה מהקורסים שדורשים הבנה עמוקה של ההרצאות והשקעה אדירה במהלך הסמסטר כדי לקבל ציון טוב בעבודות.", "timestamp": 1628857646804}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אדוארדו מעין\nחוות דעת - הרצאות: לדעתי, אדוארדו מסביר בצורה מעניינת, והוא גם נחמד - מוכן לענות לכל שאלה. יש בהן הרבה תיאוריה,\nובמבחן לפעמים שואלים שאלות תיאורטיות מההרצאה. לכן, אני ממליץ להבין את ההרצאות היטב ולסכם את ההערות של אדוארדו.\n\nשם המתרגל: ברק הופר\nחוות דעת - תרגולים: סביר. אולי היה לי יחסית קשה אצלו, מכיוון שהתרגול ישר אחרי ההרצאה.\n\nיש גם סדנאות בקורס. לדעתי, כדאי לראות אותן. פותרים שם כמה תרגילים ומחדדים שם נקודות שהועברו בהרצאות ובתרגולים.\n\nשעורי הבית: 50% תקף. חובה להגיש שני תרגילי מחשב די גדולים ושני תרגילים יבשים. תרגילי הבית לא פשוטים, אך אם משקיעים בהם כמו שצריך, אפשר להוציא בהם ציונים גבוהים מאוד. יש גם תרגילי בית יבשים לא להגשה - למי שיש זמן, מומלץ לנסות לפתור אותם.\n\nהמבחן: עם חומר פתוח. במועד א' היו שלוש שאלות, שלא היו בלתי פתירות, אך היה כמעט בלתי אפשרי לסיים אותן בזמן. זה כנראה האיזון כשהמבחן הוא 50% מהציון הסופי.\n\nהשורה התחתונה: קורס מעניין מאוד המביא בסיס להנדסת חומרה. כדאי לקחת בחשבון שהוא לא ממש מעלה ממוצע, אך עם מספיק השקעה אפשר להוציא בו ציון סופי טוב.", "timestamp": 1645798471929}, {"author": "Tamir Shriki", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אדוארדו מעיין\nחוות דעת - הרצאות: \nמסביר מעולה ולאט, חוזר על החומר אם צריך.\n\nשם המתרגל/ת: ברק הופר\nחוות דעת - תרגולים: \nמיותרים. הוא פשוט מקריא מהמצגת. לא מצאתי בהם ערך מוסף.\nשעורי הבית: \n2 רטובים - הראשון ארוך יחסית (4-5 ימים) \nהשני יותר קצר (יומיים~)\n2 יבשים - שהם שאלות ממבחני עבר\nסה\"כ 50%\nהמבחן: \nמאוד עמוס עם חומר פתוח, גם אין הרבה פתרונות רשמיים..\nהלמידה מצריכה להבין באמת טוב את החומר \nסה\"כ 50%\nהשורה התחתונה: \nמומלץ למרות הכל, קורס חשוב ומעניין למי שרואה את עצמו בתעשיית השבבים", "timestamp": 1647505239795}, {"author": "מאוכזב", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אדוארדו מעיין\nחוות דעת - הרצאות: המרצה מעביר את החומר בצורה לא טובה - מאריך בחלקים פשוטים ומקצר בחלקים חשובים ומתמטיים. יש לו לא מעט הערות על המצגות ומעגלים שונים אותם הוא מצייר, אותם מומלץ להעתיק למחברת/לסיכום של דנה:) הם עשויים להופיע במבחן. הזרימה של נושאי ההרצאות גם לא ברורה. בנוסף, בקורס זה היה מצופה מהמרצה לשלב סרטונים או אולי אפילו סיורים רלוונטיים בתחום vlsi מה שלצערי לא קרה וכנראה לא יקרה...\n\nשם המתרגל/ת: ברק הופר\nחוות דעת - תרגולים: מריץ את התרגולים די מהר ושואל במהלך כל שקף אם יש שאלות. מוטב לעצור אותו במהלך התרגולים כדי להבין, אחרת תסיימו את התרגול ללא הבנת החומר ולפני הזמן...\n\nשעורי הבית: 2 תרגילי מחשב- אחד יחסית ארוך (כ 2-3 שבועות עבודה) ואחד יחסית קצר (כשבוע עבודה) תשתדלו לא להיתקע על בעיות בתוכנה ולשאול מתרגל על כל בעיה שמתעוררת.\n2 תרגילים יבשים לא פשוטים בד\"כ ממבחני עבר, מפורסמים לקראת סוף הסמסטר ללא הפרשי זמן גדולים\n\nהמבחן: מבחן שבונה על כך שלכל סטודנט יש ציון יחסית גבוה של מגן בסך 50%, ולכן נבנה כך שכמעט בלתי אפשרי לסיים אותו בזמן. ההמלצה הכי טובה שניתן לתת הינה להשקיע זמן בשאלות האחרות במבחן קודם שאינן שאלת התכנון. ולבסוף לגשת לשאלת התכנון ולגרוף ממנה כמה שיותר נקודות - בשאלה זו יכולות החרטוט שלכם נמדדות במבחן. הסגל לא מאמין בפרסום מבחני עבר עקב מחזור שאלות מסמסטרים קודמים\n\nהשורה התחתונה: קורס עם חומר מעניין שמועבר בצורה לא טובה וממש לא גורם למשיכה לתחום החומרה:(", "timestamp": 1648374292198}, {"author": "Daniel Stumler", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: ברובן מעניינות, מאוד עמוסות. אדוארדו מרצה מצוין, עוזר מאוד בשעות קבלה.\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: מתרגל טוב, התרגולים די אחד לאחד לפי השקפים אבל מור גם נותן הסברים מעבר. \n\nשעורי הבית: הכי עמוסים שעשיתי בתואר! הרטובים לוקחים נצח, Virtuoso לא כיפית בכלל, היבשים שאלות ממבחנים (או דומים להם) ובקיצור, נוראי ממש אבל הציונים גבוהים והם מהווים 50%. \n\nהמבחן: מבחן קשה וארוך בטירוף, נועד לאזן את ציוני ש.ב. הלמידה למבחן קשה כי כמעט ואין פתרונות שהסגל מפרסם, לומדים בעיקר מסריקות ובדיקת התשובות בשעות הקבלה.\n\nהשורה התחתונה: קורס 3 נקז עם *המון* חומר, יש דברים מעניינים יותר ופחות. נוגעים בכמה תחומים בעולם ה-VLSI אבל התחושה היא שזה קורס backend בפועל. לקחתי ממנו הרבה דברים חשובים ובכל מקרה, הקורס חובה בשרשרת.", "timestamp": 1668015952294}, {"author": "CMOS", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: מונוטוני ומשעמם, אבל בסך הכל סבבה ונראה שהוא כן רוצה לעזור. חצי מההרצאות מרגישות לא רלוונטיות אבל יש הרבה מידע נקודתי שהוא נותן פה ושם, שנתקלים בבהם בשאלות במבחן אז כן חשוב. \n\nשם המתרגל/ת: מור דהאן ואפרת אורדן\nחוות דעת - תרגולים: פעם קיבלנו את אפרת, פעם קיבלנו את מור. לא ברור. שניהם אחלה, ניכר שמור יותר שולט בחומר.  התרגולים בחצי הראשון של הקורס לא תואמים את ההרצאות, וכל מה שעושים זה מחשבים קיבולים והשהיות. התרגולים מאוד עמוסים והם אף פעם לא סיימו את כל המצגת. אבל התרגולים חשובים, הרבה עקרונות שיהיו במבחן.\n\nשעורי הבית: 2 תרגילים רטובים. התרגיל הראשון ארוך ברמה לא סבירה. לקח לנו משהו כמו 50-60 שעות. התוכנה כל הזמן קורסת, נתקעת, זורקת שגיאות לא ברורות. כמות הפעמים שהתחלנו מהתחלה היא עצומה. הרטוב השני הרבה יותר סביר ואפשר לסיים אותו ביום-יומיים. בסוף הציונים יחסית גבוהים.\n2 תרגילים יבשים - ליטרלי העתקה ממבחנים משנים קודמות לכן תרגול נחמד, אבל אין פתרונות, אז בעיקר מתסכל. בסמסטר שלנו רדפנו אחריהם שיפרסמו כבר את יבש 2, לא ברור מה לקח להם כלכך הרבה זמן. בסוף הם פרסמו בשבוע האחרון של הסמסטר, וההגשה הייתה יומיים לפני המבחן. לפחות נתנו רק ציון בינארי.\n\nהמבחן: לא קשה כשלעצמו, אלא ארוך בצורה מחרידה. מלא שאלות, מלא סעיפים. בכל סעיף דורשים לפרט על כל מקרי הקצה וכל הנקודות השונות. באו לאזן את הממוצע עם תרגילי בית שמהווים 50% מהציון.\n\nהשורה התחתונה: בסך הכל קורס חשוב. מלמד הרבה דברים חשובים בתחום, נותן רקע טוב של מה זה צ'יפים. עם זאת, פונה בעיקר לתחום של בקנד ופיזיקל דיזיין.", "timestamp": 1676838653046}, {"author": "מיכאל פופוב", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אדוארדו מעיין\nחוות דעת - הרצאות: \nקצת מונוטוני אבל יודע את החומר היטב מסביר כל שאלה ומעמיק   בפתרון\nשם המתרגל/ת: מור/אפרת\nחוות דעת - תרגולים: מתרגלים טובים שמכירים את החומר ,למרות שיש דיי הרבה חומר.\n\nשעורי הבית:יבשים סבבה קצת חופרים כי יש רק 2 באמצע החיים,הרטובים עמוסים ברמה אבל תורמים המון להבנה של הקורס ואם הנושא מעניין אותכם אפילו יכיולים להיות מעניינים \n\nהמבחן: קשה אבל מהווה 50% מהציון כך שאפשר לקבל ציון טוב עם הכנה סבירה\n\nהשורה התחתונה: קורס מבוא כמו שצריך שמציג בפניכם את התחום המעניין של VLSI", "timestamp": 1677070532108}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמונוטוני אך מסביר סבבה. רואים שאוהב את התחום ויודע בו הרבה. כמו כן עושה רושם שכן אכפת לו שיבינו את החומר.\n\nשם המתרגל/ת:מור דהאן\nאך כל שבוע התחלף עם המתרגלת השניה בקורס. סהכ מסבירים סבבה. בעיקר בהתחשב בזה שהיו צריכים לרוץ די מהר על מצגות יחסית עמוסות.\n\nשעורי הבית: היו 2 רטובים ו2 יבשים להגשה. הרטובים היו קצת עמוסים אבל לדעתי לא משהו חריג. היבשים היו סבירים אך ללא פתרון, עם הרבה חישובים. כמו כן פרסמו יבשים ללא הגשה מדי שבוע לתרגול עצמי. הרבה פעמים היו לא ברורים, עם פתרונות ארוכים בצורה מחרידה ואף עם טעויות לפעמים.\n\nהמבחן: \nלפחות הסמסטר מועד א היה ארוך בצורה מוגזמת. בנוי ככה שזה ברור באופן בוטא שמנסים להוריד ממוצע עקב המגן הגבוה. מה גם הרגיש שבערך 50 אחוז מהמבחן היה אשכרה על חומר חדש ושיקולים שלמדנו מvlsi. והשאר היה סוג של וריאציה מוזרה של תרגילים ממערכות ספרתיות. שבעיקר נועדו לבלבל להעמיס על המבחן.\n\nחבל לדעתי כי ראיתי לא מעט מבחנים משנים קודמות עם יותר שאלות בעלות שיקולים הנדסיים שלמדנו בקורס, שמתרגלים באופן לא רע את כל העקרונות האלה. \n\nהשורה התחתונה: \nמבחינת חומר שנלמד בקורס, אני חושב שממש מומלץ לקחת לכל מי שרוצה ללכת לתחום הצ'יפים בפן החומרתי יותר. בין אם זה לbackend או לכל תכנון ic. לומדים בקורס הזה דברים פרקטיים על צ'יפים שחובה לדעת כדי להתעסק בזה ברמה הפיסית יותר.\n\nעם זאת, במידה ואין זיקה לתחום לא הייתי לוקח את הקורס. מכיוון שבכל מה שקשור לתרגילים שצריך לפתור במהלך הסמסטר, ש.ב ומבחנים הוא יחסית לא מסודר ומעורפל עקב החוסר פרסום של פתרונות מצד הסגל.", "timestamp": 1677226374263}, {"author": "דומינו", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אפרת/מור\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nלדעתי,קורס חובה בעולם החומרה.לא לוותר עליו אם אתם עוסקים בתחום.\nהרטובים אכן ארוכים,אך תעשו לעצמכם טובה-תשיגו רפרנס ותעבדו במקביל-שותף אחד על הכלי ושותף אחד על הוורד.\nדבר שני,יש מגן ל 50 אחוז ומבחן עם מבנה קבוע.\nלא קשה להוציא מעל 75 במבחן הזה(כמובן שקשה לוהציא מעל 90,אבל 80-90 אפשרי בהחלט).", "timestamp": 1679922970220}, {"author": "H", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: סבירות, ממליצה להקשיב כי חלק מהשאלות במבחן הן על דברים שוליים שדיברנו עליהם בהרצאה מילה וחצי\n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: מתרגל מעולה \n\nשעורי הבית: סיוט, 2 רטובים ו2 יבשים חובה. הרטוב הראשון לא מוסבר ברור ולקח לנו כמה שבועות לסיים אותו (כל שבוע למשך חצי יום) בעיקר כי ההוראות לא ברורות. רוב הזמן הלך לנו על להבין מה רוצים ואיך משיגים את המידע.\n\nהמבחן: ארוך ברמה שבלתי אפשרי לסיים כמו שצריך. אין פתרונות למבחנים בכלל (חוץ ממועדים ב 2015,2017) מה שמאוד מקשה על הלמידה\n\nהשורה התחתונה: לא ממליצה בלב שלם, אם לא התעניינתם במיוחד במעגלים אלקטרוניים אין מה לקחת אותו.", "timestamp": 1690443540496}, {"author": "מוכה טראומה ממבוא לולסי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "חשוב לי לציין לפני - אני עדין בניסוח.\n\nשם המרצה: אדוארדו \nחוות דעת - הרצאות: רואים שאדוארדו מבין עניין. זה לא אומר שהוא מרצה טוב. מעביר את החומר בצורה משעממת, מרדימה, אומר הערות צד שאשכרה יש מצב שתיבחנו עליהן - בקיצור כל המרכיבים של מרצה לא טוב.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אחלה מתרגלת, משקיעה ומבינה ומשתדלת שהסטודנטים יבינו על מה מדובר ומה קורה. נקודת האור היחידה בקורס השחור הזה.\n\nשעורי הבית: במילה אחת - מזעזעים. 50% תקף. 2 יבשים 2 רטובים. את הרטובים מעביר איש סגל שאני לא בטוח שהוא מבין בכלל על מה הוא מדבר, כתוב שם שאלות שאומרות משהו אחד, וכששואלים בפורום הוא בכלל רצה שנעשה משהו אחר לגמרי. 3 פסקאות על כל פסיק בתוכנות במקום לשים תמונה פשוטה. מטחנת זמן היסטרית. בקיצור - קטסטרופה.\nהיבשים - לרוב ממוחזרים ממבחני עבר, לפעמים שאלות מונפצות שגם אם תחרשו שעות לא תמצאו פתרון כי פשוט אין כזה - לא מפרסמים ולא יפרסמו פתרונות רשמיים לקורס הזה. שאלות הזויות, לוקח טונה של זמן.\n\nהמבחן: מביך שאנשי הסגל אשכרה חשבו שלגיטימי לתת מבחן כזה. גם 5 שעות לא היה מספיק. לחשב מליון דברים - קיבולים והתנגדויות של 10 קווים ואז לעשות חישוב אלמור על זה (מי שלקח את הקורס והיה במועד א מבין כמה זה מטורף לצפות לזה מסטודנט במבחן) בנוסף נתנו לייאאוט מגוחך של 24(!!!) טרנזיסטורים שצריך לחלץ ממנו סכימה (ואם יש ספק - הקווים מסורבלים ומוצלבים אחד עם השני ולא מחוברים בצורה ״קלילה״)\nזוועת עולם.\n\nהשורה התחתונה: לפני הסמסטר שקלתי לקחת שרשרת ולסי. אחרי הסמסטר ואחרי הקורס הזה כשאני עוד סופר פציעות ירדתי לגמרי משרשרת ולסי כי הבנתי שהקורס הזה הוא רק הכנה לכמה נוראיים שאר הקורסים.\nבתור אחד שאהב* מעגלים אלקטרוניים (כי ראית יש כתבו פה שמי שאהב אז שיקח) - *לא לקחת מבוא לולסי בפרט ואת השרשרת בכלל גם אם זה תלוי בחיים שלכם* - ראו הוזהרתם.\nהחלטה הכי גרועה שלקחתי בתואר - בפער.", "timestamp": 1690460979691}, {"author": "סטונדט 0", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: \nהחומר מעניין אבל אדוארדו מעביר את זה בצורה לא כל כך ברורה ודי משעממת. ראיתי 3 הרצאות במוקלט על כפול 2 וככה היה לי הרבה יותר מעניין ומובן, אבל לצערי הסגל לא משחרר הקלטות. \nשם המתרגל/ת: אפרת ומור\nחוות דעת - תרגולים: הייתי אצל שניהם, שניהם מעולים, שולטים בחומר ומסבירים ברור.\n\nשעורי הבית: יש שני תרגילים רטובים ושני תרגילים יבשים שמהווים 50% תקף מהציון.\n\nהרטובים ארוכים מאוד, הרבה קשיים טכניים עם התוכנות. ברטוב הראשון יש כמה סעיפים יבשים מעצבנים. המענה לשאלות מצד האחראי על הרטובים בזיוני - לא עונה למיילים והתשובות בפורום באות באיחור רב ועמומות מאוד.\n\nהיבשים אלה שאלות ממבחני עבר, אין פתרונות אבל יש מענה בפורום.\n\nהמבחן: \nהלמידה למבחן קשה מאוד שכן אין פתרונות רשמיים פרט לשני מבחנים מ-2015 ו-2017. ממליץ לעבור על השיעורי בית שלא להגשה כי אלה חלקי שאלות ממבחנים עם פתרון. \n\nהמבחן עצמו בזיוני, ארוך ופשוט בלתי אפשרי לסיים אותו בזמן הקצוב, הסגל מודע לזה וזה לא מפריע להם, העיקר שהממוצע הסופי כמו שצריך. \nהשורה התחתונה: חומר מעניין, התנהלות הסגל פחות", "timestamp": 1691009146201}, {"author": "ע", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: משעממות, החומר עצמו מעניין אבל לא מועבר בצורה טובה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא הייתי בתרגולים\n\nשעורי הבית: זוועה. תרגיל יבש 25% תקף שמוסבר באופן נוראי ואין דרך להבין מה רוצים מאיתנו. עוד רטוב 10% תקף יותר קצר אבל הסברים גרועים. שני יבשים סהכ 15% ממבחני עבר ואין דרך למצוא פתרון, לחצי מהשאלות נעזרתי בchatgpt כי אין דרך אחרת.\nעשרות שעות השקעה בתרגילים להגשה, שבערך שליש מזמן יושקע בלהבין איך להתחבר למחשבים של המעבדה בלי שיעפו אתכם, לתפעל את התוכנות ועוד דברים שלא קשורים למה שצריך לעשות בתכלס בתרגיל.\n\nהמבחן: על הפנים, לא ניתן לסיים אותו בזמן. ללמוד למבחן זה פשוט סיוט, יש במודל 2 פתרונות. צריך לחפש סריקות של סטודנטים מהדרייב, על חלקן אין ציון, על חלקן אין הסברים להורדת נקודות וחלקן גם וגם. להוסיף על זה שחלק מהסריקות עם ציונים מאוד נמוכים שקשה להבין מה לעשות אחרת ממה שענו.\n\nהשורה התחתונה: התחושה הכללית ששוררת לאורך הקורס זה \"מה הם רוצים מהחיים שלי\". התחברתי לתחום והייתי צריך את הקורס כדי לסגור את השרשרת אבל למי שלא חייב אותו או מאוד מתחבר לתחום ורוצה לעסוק בו בעתיד, כדאי להתרחק.", "timestamp": 1691042503525}, {"author": "נועה בלי ו'", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אדוארדו\nחוות דעת - הרצאות: ארוכות ומשעממות, החומר העיקרי למבחן (לשם כך התכנסנו) מוסבר בחלק קטן מההרצאה בצורה מפורטת והשאר פשוט דוגמאות והסברים על גבי הסברים לא שלא תורמים בסופו של דבר.\n\nשם המתרגל/ת: אפרת אורדן\nחוות דעת - תרגולים: מועברים בצורה ברורה.\n\nשעורי הבית: ארוכים, מסורבלים, לא ניתנים לפתרון אלא בעזרת מישהו שכבר מכיר\\יודע, אבל כן מעניינים (אם הכל עובד).\n\nהמבחן: כיאה למבחן בטכניון - ארוך, כיסוח בהורדת ניקוד, נראה שלא הושקעה מחשבה בבנייתו מבחינת זמן, ניסיון מוצלח להורדת ממוצע.\n\nהשורה התחתונה: קורס בבסיסו מעניין אבל מועבר בצורה משעממת, ועם מבחן לא סביר. לא מומלץ אם לא חובה, עדיף ללמוד מיוטיוב את אותם עקרונות.", "timestamp": 1703789427261}]}