{"posts": [{"author": "דקל וקנין", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מארק זילברשטיין \nחוות דעת - הרצאות: \nהמשך ישיר של ממ\"ס ומערכות הפעלה, לדעתי צריך להיות קורס חובה בהנדסת מחשבים. \nהקורס עוסק בשלל נושאים בתפר שבין חומרה ותוכנה (הרבה יותר מרק תכנות GPUs):\n- ארכיטקטורות GPUs, תכנות ב-CUDA\n- תכנות ב-Infiniband, פרוטוקול RDMA, טכנולוגיות חכמות כמו Programmable switches ו- Smart NICs\n- מבנה מחשבים (ולא מבנה *מעבדים*, שמלמדים בממ\"ס) - PCI, תקשורת בין התקנים במחשב ועוד\n- מודלי זיכרון (C++ atomics memory models)\n- מאמרים אקדמיים מתקדמים בתחומים של מערכות הפעלה וארכיטקטורות\n\nבנוסף מארק מרצה מדהים. יודע להעביר את החומר בצורה מרתקת, ונהנתי מכל רגע בהרצאות שלו. יש גם הקלטות מהשנים 2020 ו-2021 בפנופטו. \nההרצאות חשובות להצלחה בקורס. המבחן מכסה את כל החומר, ושואלים הרבה על נושאים \"צידיים\" שהועברו רק בהרצאות (ולא בתרגולים / תרגילי בית).  כך שמאוד מומלץ לחזור על ההרצאות לפני המבחן. \n\nשם המתרגל/ת: רון מרכוס\nחוות דעת - תרגולים: \nלא יכולתי להגיע לתרגולים, כך שראיתי הקלטות משנים קודמות. לדעתי התרגולים חשובים בעיקר לתרגילי הבית, ולסגירת פינות של נקודות עדינות מההרצאה. \nבלמידה למבחן פחות הייתי שם עליהם דגש. \n\nשעורי הבית: \nיש 3 תרגילי בית, רטובים, כל אחד 7% תקף מהציון הסופי. \nקשים. \nמסוג הרטובים שבלי הרבה שורות קוד (תרגיל 1 בערך 50 שורות, 2 בערך 300, 3 בערך 500), אבל שדורשים זמן רב כדי להבין, ולחשוב על מימוש שעובד. הקוד שמביאים כתוב די רע, והתיעוד של התרגילים לא משהו. דורש מלא ניסוי וטעייה, deadlocks לא ברורים, ודיבוגים מאוד קשוחים. \nמבחינת זמן שהשקעתי במהלך הסמסטר - בערך פי 2 מ-OOP של מדמ\"ח (!)\nמה שכן- ללא שותף, וללא רפרנס. \n\nהמבחן: \nקשה מאוד. אם ממ\"ס זה 5% הבנה ו-95% טכניקה, כאן זה ההפך. הממוצע סה\"כ סבבה (78+-), אבל מדובר בקורס קטן, שהרבה גדול ממנו סטודנטים מצטיינים / תואר שני / עם זיקה חזקה ל-low level מהתעשייה. \nאיך אפשר להצליח? \nלחרוש הרצאות- לזכור ולהבין היטב את *כל* הנושאים, לא לחפף כאן בכלום. \nמבחנים - יש רק מספר חד ספרתי של בחינות קודמות לתרגל, כך שתוך יומיים אפשר לסיים את כולן. \nתרגולים - רק אם נשאר זמן, לא חובה\nשיעורי בית - בזבוז זמן\n\n\nהשורה התחתונה: \nקורס מצוין, פרקטי בטירוף ומקנה ידע חשוב לתעשייה שקשה ללמוד עצמאית. \nחובה למי שמעוניין לעסוק ב*כל* תחום שנכנס תחת הקטגוריה low level - ארכיטקטורות, מערכות הפעלה, קומפיילרים, חישוב מקבילי יעיל, ועוד. \nבנוסף חובה לכל מי שרוצה לעסוק במחקר בתחומים הנ\"ל. \n\nטיפ למתעניינים בתחומים האלה, לשלב את הקורס עם \"הנדסת מערכות הפעלה\" - שני הקורסים לגמרי משלימים אחד את השני.", "timestamp": 1660844630748}]}