{"posts": [{"author": "Elad K", "semester": "201901", "text": "קורס מדהים! יש רק הגשות, אמנם קשות אבל אפשר להתמודד. ציונים גבוהים. מומלץ לשיפור הממוצע", "timestamp": 1590920277000}, {"author": "טרנזיסטור גדול", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רוני אל בכר\nחוות דעת - הרצאות: \nרוני מרצה מרתק, הלוואי והוא היה מלמד את חצי מהקורסים של VLSI. אין תלונות בכלל.\n\nשעורי הבית:  רצח עם. חוות הדעת בקבוצות הפייסבוק לא משקרות. אל תעשו את הקורס הזה. הוא יבזוז את הכפר שלכם וישרוף את היבול שלכם. אתם תמותו\n\n\nהשורה התחתונה: \nלא", "timestamp": 1646227228191}, {"author": "א.א.", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רוני אל בחר\nחוות דעת - הרצאות: \nרוני אחד המרצים הכי טובים שהייתי אצלם בתואר הזה. מעבר לזה שהוא אחלה גבר, הוא מגיע מהתעשייה והוא מסביר כל הזמן על דברים פרקטיים שהמנותקים מהאקדמיה לא יודעים/שכחו כבר. מאוד נהנתי מההרצאות.\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: \nקצת עייף אבל סהכ מתרגל טוב. הבעיה הכי גדולה בקורס הזה היא שהתרגולים לא באמת עוזרים לתרגילי הבית, ובקורס ללא מבחן, ציפיתי שזה יהיה קצת יותר רלוונטי.\nשעורי הבית: \nהצילו. באמת הצילו. השיעורי בית היו סבל. הגשות ארוכות בטירוף בוירטואוזו, וההנחיות שלהן לוקות מאוד. בקושי היה ברור מה לעשות, ההגשות כמעט תמיד קיבלו הארכה, הייתה תחושה לרוב של אף אחד לא יודע מה הוא עושה. באמצע הסמסטר בתור הגשה תיקנו את הניסוח של השיעורי בית כדי שזה לא יהיה כל כך גרוע סמסטר הבא, מקווה שישתמשו בזה.\nהמבחן: \nאין תודה לאל\nהשורה התחתונה: \nאם יש לכם כל כך הרבה זמן פנוי שאתם נמצאים בים באמצע סמסטר ובא לכם לשבור את הראש למוות על תוכנה שקופים עיצבו את ממשק המשתמש שלה-יאללה מגניב. לכל השאר פחות מומלץ.", "timestamp": 1648040370151}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "למי שקרא עד כה את כל הביקורות שלפניי ולא הבין לאן הוא רוצה להיכנס. הממוצע יכול להראות מפתה, אפילו מפתה מאוד. קורס בלי מבחן עם ממוצע 96+ נשמע כמו חלומו הרטוב של כל סטודנט בטכניון.\nבטח כבר קראתם שההגשות \"עמוסות\" ואמרתם לעצמכם בתמימות ובדיוק כמו שאני אמרתי - כמה כבר עמוס זה יכול להיות?! או - נסתדר! \nאז זהו שלא. אני מחשיב את עצמי כסטודנט שיודע להתמודד עם עומסים, משלב עבודה יומיים בשבוע ולוקח בכל סימסטר 18+ נק\"ז ומצליח להתמודד עם העומס, עד שהגיע הקורס תכן מעגלים אנלוגים. כמות ההגשות והעומס בהן לא פרופורציונלי בשום צורה. אם תקחו רק את הקורס הזה בסימסטר, יהיה לכם סימסטר עמוס מאוד. אם להשוות להגשות של קורס אחר בשרשרת - מבוא לVLSI, זה כמו להשוות בין אינפי 1מ לבין מבחן בגרות ראשון במתמטיקה 3 יחידות. \nזמן עבודה בממוצע לכל הגשה הוא בין 70 ל 100 שעות, משתמשים בתוכנת סימולציה בשם וירטואוזו (למי שלא מכיר, בחברה שפיתחה אותו חשבו איך אפשר לעשות כלי מחורבן, שיקפיץ לכם 200 שגיאות בלי אף הסבר ועם רמת נגישות אפס ואפילו הם לא האמינו שזה יצא כלכך גרוע). כותבים את כל ההגשות בפווארפוינט ובכל הגשה כותבים בין 40 ל80 סליידים, כשכל סלייד גדוש בפיתוחים תאורטים, גרפים, אופטימיזציות ועוד (אצלנו היו 7 הגשות כשהיו אמורות להיות 9 והפחיתו לנו אחרי תלונות למתרגל). \nאם כל זה לא מספיק, אין רפרנסים והקורס רק משדרג את עצמו ונהיה עמוס יותר מסימסטר לסימסטר (היו כמה הגשות שחפפו לסימסטר שלפנינו וגילינו שאצלנו הוסיפו עוד סעיפים).\n\nאסייג ואגיד שרוני מרצה מאוד מעניין וההרצאות רלוונטיות למי שהתחום מעניין אותו בתעשיה. הוא מביא אנשים מהתעשיה, מסבירים על תהליכים שונים והוא כן נותן רקע בעיקר לתכנון מגברים דיפרנציאלים ומעגלי משוב. בנוסף, איתמר המתרגל היה נכון וזמין לעזור, אבל זה לא כלכך עוזר שכמות ההערות בתוכנה הארורה הזו לא מפסיקות ושאין לך מושג איך להתמודד עם הגליונות - כי שום דבר שנלמד בכיתה לא באמת מכין אותך להגשה.\n\nהשורה התחתונה: זה לא חתול בשק, זה אריה בשק.", "timestamp": 1680856683591}, {"author": "stdnt", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רוני\n\nשם המתרגל/ת:  איתמר\n\nשעורי הבית:  עמוסים. ניכר שאיתמר ורוני רצו להקל עלינו והורידו את כמות ההגשות מ-9 ל-7 שזה היה מאוד נחמד מצידם אבל עדיין הקורס היה עמוס מאוד.\n(גם אם יש לכם רפרנס זה עדיין לא הופך את ההגשות לקלות או מהירות)\n\nהמבחן:  אין. 100% מהציון הוא על ההגשות של תרגילי הבית.\n\nהשורה התחתונה:  קורס טוב למי שרוצה להכיר את תחום האנלוג \\ להיות מהנדס אנלוג ולמצוא עבודה בתחום.\nהקורס מאוד קשה מבחינת העבודה עם הוירטואוזו.\nלא מומלץ לקחת את הקורס בסמסטר עמוס כי הוא דורש השקעה של כמה ימים בשבוע.\nלדעתי, הקורס כן מומלץ בסמסטר פחות עמוס. גם בכלל הממוצע הגבוה וגם כדי ללמוד משהו חדש, למרות שזה לא קל.", "timestamp": 1685789212666}]}