{"posts": [{"author": "אורי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אריאל אפשטיין\nחוות דעת - הרצאות: \nקורס מעניין, המרצה גם עושה סקרים במהלך השיעור כדי לוודא שאתם על חומר, לדעתי ממש טוב. \nשם המתרגל/ת: דניס \nחוות דעת - תרגולים: \nלא הייתי, אבל תכלס אפשר ללמוד את רובם לבד\n\nשעורי הבית: \nכל שבוע גיליון, יכול להיות קצת מציק אבל הגיליונות מרופרנסים אז זה לא נורא.\nהמבחן: \nיחסית ברור ואפשר ללמוד אליו ב3-4 ימים אם יש לחץ, והבדיקה גם יחסית סבבה.\nהשורה התחתונה: \nקורס ממש נחמד למי שמתעניין בתחום, ממליץ", "timestamp": 1612357391409}, {"author": "antenna", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אריאל\nחוות דעת - הרצאות: \nמרצה טוב. מעביר את החומר בצורה טובה(ההרצאות הועברו בשפה האנגלית).\n\nשם המתרגל/ת: דניס \nחוות דעת - תרגולים: \nמתרגל טוב. ומסביר בצורה טובה.\nשעורי הבית: \nכל שבוע יש תרגיל בית והם צריך להיות מוקלדים.\nהמבחן: \nהמבחן השתנה מבחינת קושי ביחס לשנים קודמות. עכשיו הוא קשה ומאתגר.\nהשורה התחתונה: קורס מעניין מאד למי שמתחבר לתחום אבל הוא לא קל.", "timestamp": 1646934897925}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אריאל\nחוות דעת - הרצאות: מרצה מעולה. מעביר את החומר בצורה מאוד ברורה ומסודרת\n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: די מבולגן, צריך להבין שרוב החומר שעובר בתרגול לא רלוונטי, בעיקר המון מתמטיקה שאין באמת דרישה להבין אלה רק את השורה התחתונה של כל החישובים \n\nשעורי הבית: גליון כל שבוע, מרופרנס אבל עוזר להבין את החומר (לא כולם, יש כאלה של סתם מלא חישובים בלי להבין מה עושים)\n\nהמבחן: כל שנה המבחנים יותר קשים, והשנה אריאל הגזים במיוחד. יצאתי עם טעם רע בגלל הציון אבל הקורס סך הכל נחמד.\n\nהשורה התחתונה:", "timestamp": 1678350622920}, {"author": "???", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אריאל אפשטיין\nחוות דעת - הרצאות: אחלה מרצה, מערב את הסטודנטים בהרצאה ומביא הרבה נקודות למחשבה תוך כדי ההרצאה.\n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: לא משהו. לא מרגיש את הכיתה ולא מסביר טוב. מתעמק הרבה על דברים איזוטרים ודברים סופר קריטיים מדלג עליהם.\n\nשעורי הבית: גיליון פעם בשבוע. לא נורא, הרבה מתמטיקה לפעמים מעצבן.\n\nהמבחן: אלוהים ישמור. המבחנים בפורמט החדש של אריאל פשוט מדכאים והלמידה מוציאה ממך את כל האנרגיות ופשוט מטישה. לנו, יחסית לשנים האחרונות, היה סביר, אבל בלי הארכת זמן ממילואים לא בטוח הייתי עובר.\n\nהשורה התחתונה: קורס ממש מעניין עם מרצה מצויין, אבל עם מבחן לא פשוט בכלל. אם אהבתם מפל\"ג ואוהבים את התחום מומלץ לדעתי.", "timestamp": 1716894241213}, {"author": "קונדסון", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nאריאל אפשטיין \n\nחוות דעת - הרצאות: \nמרצה מדהים! \nההרצאות בקורס מעולות, ממש מעניינות. אריאל ממש נחמד עונה לכל שאלה ושומר על אווירה טובה. הקורס ממש מרגיש שנותן לך קפיצת מדרגה במה זה קרינה מאיפה היא באה ומה הפרמטרים החשובים בה. בנוסף, גם מדברים על התקנים חלק מהזמן שנמצאים בכל מקום שממש טוב להכיר.\n\nשם המתרגל/ת: \nדניס דיקריוב\n\nחוות דעת - תרגולים: \nדניס די מפוזר, חלק מהתרגולים די מתמטים והרבה פעמיים אפשר לזכור רק את השורה האחרונה. \nבגדול למרות הכל דניס אחלה גבר ושווה בכל זאת לבוא.\n\nשעורי הבית: \n20% מהציון, גיליון שבועי מרופרנס הכל יבש. הגיליונות לרוב לא נוראיים ומאוד עוזרים להבין את החומר. אולי היה 1 או 2 סתמיים אבל השאר אחלה, לא ארוך ומלמד. \nסך הכל ביחס לקורס בחירה פקולטי לא עמוס בכלל ואין רטובים.\n\nהמבחן: \nהמבחנים של אריאל מאתגרים. יש חומר פתוח והוא יכול לשאול על חלקים מוזרים שלו טיפה. \nלמרות שהמבחן ארוך ומאתגר הבדיקה לפחות של המבחן שלי הייתה ממש אחלה, רק חיפשו לתת נקודות בכל מקום שהראתי הבנה. \nמי שעל החומר לדעתי יכול להוציא די טוב.\n\nהשורה התחתונה: \nקורס ממש מומלץ, בעיניי אחד מקורסי הבחירה הטובים בפקולטה!\nכדאי לדעת שהקורס הוא לא רק על אנטנות אלא גם על קרינה (כמו שכתוב בשם) ובגלל זה הוא ממש רלוונטי גם לדברים של אופטיקה ותופעות גלים כלליות. בנוסף, הנושא של אנטנה כהתקן שגם אותו מלמדים סופר רלוונטי, ומרגיש שמקבלים מלא ידע מאוד פרקטי בתחום בקורס.\n\nמי שמתלבט אם לקחת שרשרת פוטוניקה בגלל הקורס המחייב, השם של הקורס מטעה, זה קורס מעולה ורלוונטי, קחו אותו. \n\nמי שמחפש קורס בחירה שאשכרה נותן אינטואיציה, הוא מעניין ומלמד משהו אפילו מחוץ לשרשרת, זה קורס סופר מומלץ.", "timestamp": 1717169160213}]}