{"posts": [{"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יריב ארידור\nחוות דעת - הרצאות: יריב ממש משקיע בהרצאות, ואני חושב שזה קורס חובה לכל מי שרוצה ללמוד על תכנות מקבילי. בנוסף לזה יריב בא מהתעשייה ולכן הוא מקפיד לדבר תכלס. הוא נותן דגש מרכזי בלימוד דברים פרקטיים שיכולים לעזור, ובהצגת נקודות מבט מאוד חשובות בתחום.\n\nשעורי הבית: הדגש בקורס הוא על התכלס. שיעורי הבית לא מתפזרים על מאות שורות כמו בקורסים אחרים. בכל תרגיל בית יש קטע קוד קצר יחסית שצריך להשלים. כן צריך להפעיל את הראש קצת, אבל הדגש הוא על האיכות ולא על הכמות.\n\nהמבחן: המבחן היה עם חומר פתוח. אין סיבה לשנן דברים בעל פה ולזכור כל פסיק בהרצאות. כל עוד הבנת את ההסברים מההרצאות ואת הדוגמאות מהמצגות, אז המבחן לא אמור להוות מכשול בפניך. בגלל שהקורס נלקח על ידי מעט מידי אנשים אז אין היסטוגרמה לקורס(מאילוצי המערכת של ה-grades), אבל נראה שכולם קיבלו ציונים גבוהים כי הממוצע הסופי היה 88 במועד א'.\n\nהשורה התחתונה: אחלה קורס. מומלץ מאוד, במיוחד למי שהולך לעסוק בתכנות מקבילי.", "timestamp": 1692475178187}, {"author": "אסף קליין", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יריב\nחוות דעת - הרצאות: \n\nהרצאות ותרגולים היו מחוברים בלי הפרדה ברורה ביניהם - כמו שצריך. ליריב היו 3 שעות ובו הוא שפך את כל מה שלדעתו חשוב בתכנות מקבילי.\n\nהקורס ענה על הציפיות שלי. נכנסים לעומק למנגנוני סנכרון בין תהליכים ועל העלות בביצעוים של כל מנגנון סנכרון. בנוסף נכנסנו גם לכתיבה נכונה של קוד כחלק מחשיבות הביצועים (גם ללא קשר לסינכרון ותכנות מקבילי).\n\nהקורס הוא קורס בתוכנה ולכן יש נגיעה אבל אין העמקה במנגנונים חומרתיים עבור מקבילות, כמו אופן מימוש פעולות וקטוריות, ופרוטוקולי קוהירנסי.\n\n\nשעורי הבית: סה\"כ יחסית מעניינים, עניין יש כמה שעות עד יום עבודה\n\nהמבחן: מאתגר אבל הוגן\n\nהשורה התחתונה: מומלץ למי שמתעניין בביצועים", "timestamp": 1696082285615}, {"author": "TBB", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יריב\nחוות דעת - הרצאות ותרגולים: ההרצאות מעניינות. יריב מאוד משקיע בהן ומאוד פתוח לשאלות במהלכן. קחו בשחשבון שזה בראש ובראשונה קורס software שמסתכל על שיפור ביצועי החומרה מנקודת מבט של מתכנת, ופחות מנקודת המבט של איש חומרה (אם כי עדיין מתאים למתעניינים בperformance).\n\nשעורי הבית: רטובים עם שאלות יבשות בחלקן. ברובם הוגנים, לא ארוכים. דווקא תרגיל בית 0 היה ארוך מעט (צריך גם לעשות התקנה מעצבנת). אבל לאחר מכן היה מדובר בתרגילי קידוד קצרים יחסית שלכל אחת יש מספר נקודות חשובות. לפעמים צריך לפנות ליריב להבהרות.\n\nהמבחן: הוגן, עם חומר פתוח ואצלנו אפשרו מחשב על מצב טיסה. ישנה יותר התמקדות ברוח הדברים ובנקודות מהותיות, ופחות בנקודות איזוטריות. אם לומדים ומבינים את החומר היטב אפשר להוציא אחלה ציון.\n\nהשורה התחתונה: אחלה של קורס למתעניינים בנושא, מומלץ בחום.", "timestamp": 1697963772451}]}