{"posts": [{"author": "Aviv Ratzon", "difficultyRank": 5, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: משעמם ומתמטי בצורה מוגזמת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nגהנום\nהמבחן: \nגהנום\nהשורה התחתונה: קורס מתמטי בטירוף, אחד הקורסים הכי קשים שעשיתי בתואר וכמעט ללא חלק פרקטי", "timestamp": 1598261895647}, {"author": "EE student", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "חוות דעת - הרצאות: הרצאות לא מובנות בעליל, מתמטיקה הארד קור, אל תצפו לצאת עם ידע פרקטי מזה\n\nחוות דעת - תרגולים: \nתרגולים בלתי נסבלים ומבולגנים מאוד. החומר מאוד מופשט והמתרגלים לא ממש מצליחים לגשר על זה.\nשעורי הבית: \nתתכוננו לשרוף את הזמן שלכם על תרגילי מחשב לא פתירים (כי איך אפשר לנסות לממש אלגוריתם שאף אחד לא באמת טרח ללמד אותך כמו שצריך).\n\nהמבחן: \nקשה, שילוב של חומר קשה בטירוף, עם ניסוחים לא חד משמעיים וברורים באנגלית\n\nהשורה התחתונה: להתרחק", "timestamp": 1600272924598}, {"author": "מיכאל", "difficultyRank": 5, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: טובות מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מבולגנים עדיין. יש טעויות\n\nשעורי הבית: עמוס מאוד\n\nהמבחן: קשה להבנה. ולא ממש בודק את החומר הנלמד\n\nהשורה התחתונה: לא לקחת", "timestamp": 1601561918568}, {"author": "סטודנט מצולק", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: קשות מאוד והמרצה לא עזר לפשט אותן בכלל. ההרצאות מאוד מתמטיות והמרצה לא טורח להסביר אפילו מה כל אות מסמנת.\n\nשעורי הבית: קשים, ארוכים ובכמות לא מבוטלת.\n\nהמבחן: קשה מאוד.\n\nהשורה התחתונה: אלא אם אתם יודעים שזה התחום בו תרצו לעסוק בשארית חייכם, אין שום סיבה הגיונית לקחת את הקורס הזה.", "timestamp": 1602608069524}, {"author": "איתמר גרובר", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: מרצה טוב, החומר ממש לא פשוט ודורש הרבה חזרה בבית כדי להבין\n\nשעורי הבית: קשים, אבל מכינים למבחן\n\nהמבחן: קשה, אבל הוגן ביחס לשיעורי בית. \n\nהשורה התחתונה: נושא מרתק! כניסה ראשונית ללמידה מחיזוקים, נותן בסיסים מצויינים. מצד שני הקורס קשה מאוד, אז רק אני אמליץ עליו לכל מי שלמידה מעניינת אותו, והוא לא נרתע ממתמטיקה.", "timestamp": 1603000515143}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אביב תמר ושי מנור\nחוות דעת - הרצאות: \nרמת הוראה מאוד נמוכה בקורס, אולי הכי נמוכה בפקולטה. ההרצאות גרועות, כל החומר צריך ללמוד אותו לבד מהחוברת של הקורס לפני המבחן כי גם חצי מהחוברת הרצאות לא מכוסה בכלל בהרצאות עצמן, המרצים פשוט מדלגים חופשי על שקפים במצגות וגם ככה אומרים תשלימו לבד.\nעם זאת החומר מעניין, חבל שלא מעבירים אותו כראוי.\n\nחוות דעת - תרגולים: \nלא מספיק מקצועיים, התרגולים הרגישו כמו בזבוז זמן, לא מועבר בהם שום תרגיל אמיתי.\n\nשעורי הבית: \nארוכים מאוד, אבל לפחות מלמדים, רק בזכות השיעורי בית אפשר להבין את החומר.\n\nהמבחן: קשה, אבל יש הרבה התחשבות בבדיקה והרבה מגן.\n\nהשורה התחתונה: \nקורס מעניין עם חומר מאוד רלוונטי שמאוד מתפתח היום, רק הוראה גרועה מאוד.", "timestamp": 1627220978562}, {"author": "Bellman", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: \nמרצה בסדר, עוברים בהרצאות בעיקר על הוכחות ודברים מתמטיים ופחות על אינטואיציה והבנה של למה האלגוריתמים עובדים. יש גם חוברת של הקורס שיש בה כמעט את כל מה שעובר בהרצאה (חוץ משני חלקים בקורס) והיא כתובה טוב יחסית.\nשם המתרגל/ת: חמוד באסל\nחוות דעת - תרגולים: \nמתרגל בסדר, מסביר טוב. בתרגולים לפעמים חוזרים על מה שעשו בהרצאה ואז פותרים שאלות או מלמדים חומר נוסף. אפשר ללמוד גם רק מהתרגולים הכתובים.\nשעורי הבית: \nקשים. חמישה גליונות יבשים יחסית עמוסים אבל עוזרים בהבנת החומר. שלושה גליונות רטובים מאוד עמוסים אבל גם מאוד עוזרים להבין את החומר וגם מיישמים בהם בפועל את האלגוריתמים, דבר טוב בקורס שהוא בעיקר תיאורטי.\nהמבחן: \nמבחן ארוך מאוד ועם הרבה טריקיים מתמטיים. צריך להבין טוב את החומר וגם לשלוט בטריקים של הסתברות.\nהשורה התחתונה: \nקורס מאוד מומלץ, חובה לדעתי למי שרוצה לעסוק בלומדות בהמשך.", "timestamp": 1658051155174}, {"author": "ש", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: ההרצאות מאוד מטמטיות ונותנות בסיס חזק אם מתאמצים להבין. מומלץ לנסות לקרוא את חומר ההרצאה לפניה.\n\nשם המתרגל/ת: באסל חמוד\nחוות דעת - תרגולים: באסל אחלה מתרגל, מעביר תזכורת של ההרצאה.\n\nשעורי הבית: ארוכים\n\nהמבחן: קשה מאוד, אחד הקשים והארוכים ביותר.\n\nהשורה התחתונה: קשה אבל מעניין במיוחר למי שמתעניין בתחום", "timestamp": 1658174447924}, {"author": "טראומתי:(", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אביב תמר\nחוות דעת - הרצאות: \nלא ניתן להבין את ההרצאות מבלי לעבור עליהן לאחר מכן עם ספר הקורס בזמן כפול מזמן ההרצאה לפחות (ומסתבר שזה לגיטימי לפי המרצה! מיותר לציין שזה לא קרה לי באף קורס בהנדסת חשמל שעשיתי בתואר הראשון). המרצה מעביר את ההוכחות וכמו כן את כלל החומר בצורה מאוד מהירה, שאינה ברורה ושאינה מסודרת... נ.ב אם אתם מדפיסים את ספר הקורס במהלך הסמסטר תשתדלו לא לרשום עליו כי במבחן אסור להכניס את ספר הקורס עם ההערות שלכם עליו.\n\nשעורי הבית: שיעורי הבית היבשים קשים מאוד וקשה לפותרם על סמך הנלמד בהרצאות ובתרגולים.\nשיעורי הבית הרטובים ארוכים ודורשים מימוש בפייטון של חומרים שהועברו בזריזות בהרצאה ובתרגול.\n\nהמבחן: קשה מאוד ואינו פתיר בזמן של 3 שעות. זהו מבחן קטלני שדורש חשיבה ברמת אינפי 1מ', אך הזמן שנתון לפתרון הינו זמן שמותאם לתרגילים באלגברה/מד\"ר. בהצלחה:(\n\nהשורה התחתונה: לברוח מהקורס הזה כמו מאש!!! ממליץ לקחת את הקורס המחייב בחורף במקום קורס זה או לנסות למצוא אלטרנטיבות אחרות. אלא אם כן אתם מעוניינים בקורס מתמטי לחלוטין כמעט ללא יישומים פרקטיים ועם מרצה שאינו יודע להעביר אותו...", "timestamp": 1673734217111}]}