{"posts": [{"author": "Guy Yoffe", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: הרצאות כתובות טוב, אני פשוט קראתי משם\n\nשם המתרגל/ת: היו הרבה. ליאור שני היה לדעתי הכי טוב מביניהם.\nחוות דעת - תרגולים: תרגולים די טובים\n\nשעורי הבית: יבשים מרופרנסים אבל עדיין קשים וארוכים. רטובים לא קלים אבל נחמדים ומעניינים.\n\nהמבחן: מבחן סיוט וקשה.\n\nהשורה התחתונה: קורס להתחיל איתו בעולם של לומדות, אבל משהו עדיין חסר.", "timestamp": 1597753820275}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: משעממות נורא, כל ההרצאות הוא רק הקריא את החומר מהPDF וזהו. מיותר ללכת להרצאות ומספיק רק ללמוד מהPDF ולהיעזר בחומר עזר מהיוטיוב להבנה.\n\nשם המתרגל/ת: עומר יאיר\nחוות דעת - תרגולים: התרגולים טובים אבל לא וואו, סה\"כ מקריאים מהתרגולים המוכנים הכתובים בפורמט html\n\nשעורי הבית: רובם ממוחזרים, אבל מדי פעם מכניסים שאלות חדשות. בסך הכל אבל הש.ב היבשים מאוד מאוד קשים, ארוכים ומייגעים, לא להשאיר אותם לרגע האחרון. מומלץ לפתור אותם עצמאית בעיקר לפני המבחן.\nהרטובים נחמדים וקלים, מתקתקים אותם תוך שעתיים.\n\nהמבחן: מזעזע, קשה ברמה קיצונית ומזעזעת. הסגל התנקם בנו לחלוטין גם בגלל העובדה שהבחינה מקוונת ועם חומר פתוח כך ששום חומר פתוח בעולם לא באמת יעזור ויהיה רלוונטי, וגם כי המועד הקודם בחורף היה ברמה מאוד נמוכה עם ממוצע גבוה מאוד.\n\nהשורה התחתונה: הקורס מזעזע, ההתנהלות לאורך כל הסמסטר(וגם במבחן) היתה בזיון מוחלט, יחס מזעזע של הסגל, צריך לבוא מוכן נפשית לעצבים שמקבלים מהקורס הזה. למרות זאת הקורס נורא חשוב כי הוא נותן בסיס סטטיסטי לתחום שהוא רלוונטי לעתיד.", "timestamp": 1597828523786}, {"author": "ר", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "קורס מעניין וחשוב.\nההרצאות לא הכי ברורות כי הן קצת אבסטרקטיות, עוזר לעשות אותן בצמוד לתרגולים או ליוטיוב.\nמבחן חרא", "timestamp": 1597843135523}, {"author": "לה פרופסור", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: דניאל סודרי \nחוות דעת - הרצאות: אין דבר כזה חומר רשות, הכל למבחן\n\nשם המתרגל/ת: ליאור שני\nחוות דעת - תרגולים: ליאור מתרגל טוב, אבל זה לא עזר בסוף\n\nשעורי הבית: \n\nהמבחן: גיהנום\n\nהשורה התחתונה: לא שווה את זה", "timestamp": 1599461744135}, {"author": "...", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: אכזבה גדולה, מצד אחד קורס תיאורטי מצב שני לא הועבר בצורה מתמטית אלא במין רפרוף על החומר. אין פרקטיקה כמעט חוץ מרטובים מעיקים (שלא דורשים הבנה אלא רק שליטה טובה ב-numpy), וגם אין בסיס מתמטי למחקר. \n\nשעורי הבית: ממש לא עמוס כמו שמספרים.\n\nהמבחן: עד כמה שזכור לי שאלה אחת קלה ושאלה אחת שמבוססת על טריקים ופיתוחים מתמטיים. הרמה של המבחן מאוד מפתיעה, הקורס ברמה די נמוכה ביחס אליו.", "timestamp": 1602607662458}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: הרצאות עמוסות אבל מעניינות. דניאל מעביר את ההרצאות בצורה מונוטונית אבל רואים שחשוב לו שהסטודנטים יבינו את החומר\n\nשם המתרגל/ת: ליאור שני\nחוות דעת - תרגולים: מתרגל טוב, לפעמים צריך להיות מאוד מרוכזים בשביל לא לאבד אותו. מעביר את החומר בצורה טובה.\n\nשעורי הבית: היבשים בסדר גמור (ברובם) והרטובים די עמוסים אבל מאוד מעניינים ופרקטיים.\n\nהמבחן: קשה מאוד. שאלות מאוד קשות ולפעמים לא מובנות.\n\nהשורה התחתונה: קורס מאוד מעניין אבל מאוד קשה.", "timestamp": 1607468576254}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ד\"ר דניאל סודרי\nחוות דעת - הרצאות: \nההרצאות הועברו במתכונת קורונה, כך שקצת קשה לשמור על ריכוז לכל אורך ההרצאה\nשם המתרגל/ת: ליאור שני\nחוות דעת - תרגולים: מידי פעם הייתה תחושה של נפנופי ידיים והיה קצת קשה להפריד בין העיקר לטפל.\n\nשעורי הבית: מעניינים ובנויים בצורה טובה\n\nהמבחן: קשה ללמוד למבחן כזה, מעבר על מבחנים בשנים קודמות לא מבטיח הצלחה במבחן\n\nהשורה התחתונה:", "timestamp": 1609751305256}, {"author": "אלון נמירובסקי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: \nההרצאות נעשו בזום והיו בגדול טובות, מאמין שעם הזמן הדברים ישתפרו.\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: תרגולים אפקטיביים וטובים\n\nשעורי הבית: שיעורי הבית היבשים חשובים להבנת החומר והרטובים חשובים להמשך ההתעסקות בנושא.\n\nהמבחן: \nהמבחן היה מאוד ארוך אבל הוגן.\nהשורה התחתונה: קורס שנותן בסיס איתן לתחום מאוד מעניין.", "timestamp": 1614181373969}, {"author": "yiftach edelstein", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עומר יאיר\nחוות דעת - הרצאות: מרצה מדהים, חוויה ללכת להרצאות שלו, נחמד, משקיע, אכפת לו מהסטודנטים ורואים את ההשקעה בקורס מעל ומעבר תחתיו. חוויה בפני עצמה.\n\nשם המתרגל/ת: ליאור שני\nחוות דעת - תרגולים: סופר מקצועי, משקיע, התרגולים ממש טובים אם כי מאוד עמוסים, אבל חשוב מאוד לדעתי ללכת אליהם ולהבין את החומר שמועבר בהם, כי הוא מאוד רלוונטי למבחן\n\nשעורי הבית: היבשים ממש לא טובים ולא מותאמים לקורס(אבל הסגל מודע לעניין ולסמסטר הקרוב משכתב אותם אז זאת לא בעיה שתתמשך), הרטובים מצויינים לעומתם ומשרים הבנה מאוד עמוקה על החומר המועבר, ורואים כי הם עודכנו לחומר החדש. לא עמוסים מדי.\n\nהמבחן: ההתכוננות למבחן הזה היא חוויה בפני עצמה. היסטורית, הקורס הזה והמבחנים שלו היו מלאים באינספור טעויות, וקשה מאוד להבין לפעמים מה הפורמליזציה המתאימה לקורס הנוכחי ומה לא(דבר שעלי לפחות גרר טעויות במבחן שנבעו מתשובות לא נכונות במבחנים), אבל המבחן תחת עומר היה הוגן וסביר, ולחלוטין אפשר להצליח בקורס הזה\n\nהשורה התחתונה: קורס מאוד מעניין ובסיס מאוד טוב לתחום, מומלץ בחום לקחת, במיוחד תחת הסגל הנוכחי", "timestamp": 1615795241229}, {"author": "Daniel Stumler", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: מרצה מצוין, מסביר ברור ודואג שכולם יבינו לפני שהוא מתקדם בחומר. \n\nשם המתרגל/ת: ליאור\nחוות דעת - תרגולים: מתרגל טוב מאוד. התרגולים טיפה עמוסים אבל כתובים טוב. \n\nשעורי הבית: היבשים עמוסים אבל פתירים, הרטובים יותר קלילים.\n\nהמבחן: היה הוגן מאוד. חשוב לציין שהמבחנים הישנים מלאים בטעויות ולא כל הפתרונות מפורטים כך שקשה ללמוד ממבחנים לפני השינוי. \n\nהשורה התחתונה: אחלה קורס, נותן בסיס טוב לתחום. הסגל עשה קצת שינויים בסמסטרים האחרונים כדי שהקורס יעבור בצורה טובה יותר ונראה שהצליח להם.", "timestamp": 1628876490809}, {"author": "יעל", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: מושלם מושלם מושלם!! המרצה הכי טוב שיש בטכניון!! מסביר מעולה, אכפת לו מהסטודנטים, תמיד מחייך וסבלן! מלך אני אומרת לכם מלךך!! ומאז שהוא נכנס לקורס המבחנים נהיו הוגנים ופתירים\n\nשם המתרגל/ת: נעה\nחוות דעת - תרגולים: מתרגלת מעולה! מסבירה טוב קצר ולעניין\n\nשעורי הבית: הרטובים ממש סבבה וכל ההנחיות כתובות בצורה טובה, היבשים עדיין היו שייכים לקורס במבנה הקודם והיו קשים לאללה\n\nהמבחן: הוגן מאוד. מי שלמד מהתרגולים והמהבחנים של עומר יכול להצליח ממש\n\nהשורה התחתונה: הקורס הכי טוב שעשיתי בתואר!! הסגל מעולה, החומר מועבר בצורה מסודרת (חייבת להוסיף שהסגל פירסמו במודל את הסיכומים של כל ההרצאות והתרגולים בצורה מהממת ומסודרת ונשאר רק להקשיב בשיעורים ביחד עם הסיכומים!!) והלוואי וכל הקורסים בטכניון היו נראים ככה", "timestamp": 1629184114528}, {"author": "A", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עומר יאיר\nחוות דעת - הרצאות: אחד המרצים הכי טובים שלימדו אותי! ניכר כמה אכפת לו וכמה הוא משקיע. ההרצאות והתרגולים עברו כתיבה מחדש והם כתובים מעולה!\n\nשם המתרגל/ת: נועה אלקובי\nחוות דעת - תרגולים: מעולה! בנאדם מקסים ,מעבירה את החומר בצורה טובה ועניינית. מסבירה בצורה מעולה ותמיד תשאר להסביר עד שישב כמו שצריך\n\nשעורי הבית: שיעורי הבית היבשים - לא נוראיים אבל מצריכים רפרנס כי לא הכל מובן (חלקם כתובים בצורה בעייתית) מדיבור עם הסגל זה כי הם עוד ישנים ולא עברו את השינוי שהקורס עבר \nהתרגילים הרטובים לא מסובכים - הם בפייתון ורק צריך להשלים חלקים\n\nהמבחן: \nהמבחנים של עומר הוגנים והם משמעותית שונים מהמבחנים הקודמים (לפני סמסטר חורף 2020) הם לא פשוטים אבל הם מתבססים על דברים שראינו\nהשורה התחתונה: נותן בסיס מעולה לעולם של למידה. מומלץ", "timestamp": 1633440865899}, {"author": "Matan Millionshik", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עומר יאיר\nחוות דעת - הרצאות:  מרצה טוב, מסביר בקצב שצריך וכל הזמן מחייך. אהבתי אותו מאוד\n\nשם המתרגל/ת:  נועה אלקובי\nחוות דעת - תרגולים: אחלה מתרגלת, מסבירה בצורה מובנת ורואים שהיא מבינה מה היא עושה\n\nשעורי הבית: סבירים\n\nהמבחן: אין הרבה מבחני עבר כי הם שינו את אופי הקורס כך שקשה להבין מה תהיה רמת המבחן, אבל סהכ המבחן לא קשה או מכיל דברים לא מובנים\n\nהשורה התחתונה: קורס טוב אם תרצו לעסוק בתחום. לדעתי חשוב", "timestamp": 1635319842554}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: כפיר לוי/עומר יאיר\nחוות דעת - הרצאות: הנושא מעניין, וגם כפיר וגם עומר מסבירים לא רע בכלל\n\nשם המתרגל/ת: ליאור שני/נועה אלקובי\nחוות דעת - תרגולים: התרגולים טובים, והמתרגלים מעבירים אותם היטב\n\nשעורי הבית: לא קשים מדי ולא לוקחים יותר מדי זמן\n\nהמבחן: ארוך ומאתגר. דורש שליטה טובה בנושאי הקורס - גם במיומנות של פתרון תרגילים וגם בהבנה\n\nהשורה התחתונה: במהלך הסמסטר הקורס לא קשה מדי, אך צריך להגיע למבחן מוכן מאוד כדי להצליח. לדעתי, קורס מעניין וחשוב", "timestamp": 1647624000277}, {"author": "natan borkowski", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דניאל סודרי\nחוות דעת - הרצאות: שולט בחומר ביד רמה.\n\nשם המתרגל/ת: נועה אלקובי\nחוות דעת - תרגולים: מתרגלת מדהימה!! בזכותה הבנתי כל שבוע את החומר עד הסוף. \n\nשעורי הבית: 6 הגשות רטוב ויבש\nהיבשים הראשונים לא מובנים וסתם לא פתירים, אחכ שמגיעים ליותר חומר ל הקורס פתאום ההגשות מאוד תורמות להבנה של הדברים\nהרטובים זה להשלים קוד שמקבלים , פשוט לראות את האולגוריתם עובד על איזה דטה סט גדול במקום שנראה רק על 4 דוגמאות שאפשר לתת לנו לחשב ביבש. לא תורם יותר מדי להבנה\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קורס מסודר היטב עם צוות טוב, לנושא אחד החמים בתעשייה היום. אל תצפה לצאת מהקורס מומחה AI", "timestamp": 1657451740324}, {"author": "חובב השניצלים", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: חשוב בעיניי לראות את ההרצאות כיוון שבצורה כזו או אחרת מופיע משם חומר במבחן שלא הוזכר בהרצאות. ההרצאות לא מאוד מעניינות, ולמי שאין ידע מקדים בהתחלה הכל נראה כמו ג'יבריש אבל חשוב להבין. \n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: התרגולים מועילים ומועברים בצורה מסודרת מאוד. לאנשים שזו ההיכרות הראשונה שלהם עם החומר אני חושב שצריך להסביר קצת יותר את המטרות של הנושאים וההבדלים כיוון שרוב הזמן הכל מרגיש אותו דבר ולא ברור מה המטרה של כל שיטה.\n\nשעורי הבית: היבשים ארוכים, הרטובים די זריזים\n\nהמבחן: רשע טהור בכתב, עדיף לבדוק כבר עכשיו קריירה אלטרנטיבית-כדורסל או משהו. אין הרבה מבחנים להתכונן מהם והתחושה היא שלא משנה כמה יהיו, תמיד מוצאים נושאים חדשים לשאול עליהם כך שמומלץ ללמוד כמה שיותר ולקוות לרחמי האל. שאלות במהלך המבחן נענות על ידי \"לא מגלה לך\" או \"אתה אמור לדעת את זה\", לאחר שבחרו לשאול במבחן על כופלי לגראנג' ונושאים בסגנון.\n\nהשורה התחתונה: קורס חשוב ויכול להיות אפילו מעניין אבל ברגע האמת יש תחושה של התנשאות מצד הסגל. לא ברורים ההבדלים או מתי להשתמש במה. מצד שני יש חשיפה מאוד גדולה לכלים ונושאים כך שזהו קורס היכרות טוב עם התחום. קורס מומלץ בסך הכל אך אל תפתחו ציפיות לציון מזהיר.", "timestamp": 1668002219350}, {"author": "Tamir Mishali", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לוי יהודה\n\nחוות דעת - הרצאות: נחמדות מאוד. למרות שרב החומר כתוב בצורה דיי טובה במצגות ובאתר קורס, לדעתי היה נחמד להגיע לקבל את האקסטרה פירוט והעשרה. עם זאת, לא מספיק חשוב כדי להגיע אך ורק בשביל זה לטכניון (זה היה הדבר היחידי בלוז שלי באותו היום). \nההקלטות משנים קודמות ממש אחלה והשלמתי את ההרצאות משם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא הלכתי. התרגולים המוקלטים ברמה טובה ולמדתי מהם.\n\nשעורי הבית: \n6 יבשים - 4/5 בקושי. רב התרגילים היו מרופרנסים משנים קודמות (תרגילי בית או ממבחנים)\n5 רטובים בפייתון - רב הקוד כבר היה כתוב, והיה רק צריך להשלים את הקוד בהתאם. הרב ברור עם זאת היו איזה 2 תרגילים שהיה גיהנום לפתור בממשק של Colab ולקחו כמעט יום שלם רק על להסתבך עם משתנים, מימדים וכו'.\n\nהמבחן: ארוך מדיייי. טריקים מתמטיים ששרפו לי לא מעט זמן. היה פאקטור של 5 נק בסוף. למדתי בעיקר ממבחני עבר. \n\nהשורה התחתונה: קורס חמוד מאוד. עמוס למדיי. נותן בעיקר את הרקע המתמטי והתיאורטי. רק טעימה מהפרקטיקה של כתיבת קוד ועבודה עם pytourch.", "timestamp": 1678971644770}, {"author": "רון", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוקלט עומר יאיר\nחוות דעת - הרצאות: מרצה מצוין, מעביר את החומר בצורה נהירה וברורה, נותן אינטואיציה טובה שגם עוזרת במבחנים\n\nשם המתרגל/ת: מוקלט נועה אלקובי\nחוות דעת - תרגולים: מתרגלת טובה, מעבירה את התרגול באופן ברור \n\nשעורי הבית: כל ת\"ב מכיל חלק יבש שהוא ממבחני עבר וכן גם סימולציה ע\"י השלמת קוד בפייתון\n\nהמבחן: המבחן ארוך ומאתגר, מכיל 5 שאלות על כל החומר (2 מרכזיות ו 3 קטנות). בנוסף לטכניקה, צריך שתהיה לכם אינטואיציה טובה שאותה רוכשים רק מההרצאות.\n\nהשורה התחתונה:  הקורס מקנה ידע בסיסי בנושא של בינה מלאכותית, ונכנס לנושאים עקרוניים כמו רשתות נוירונים, חיזוי ואימון מודלים ע\"ס מדגם, הורדת מימד בצורה יעילה ואשכול. \nאני חושב שהוא חובה למי שמעוניין להיכנס לתחום.\nכדאי לפתור המון שאלות ממבחני עבר, וכן לעבוד על אינטואיציה טובה.", "timestamp": 1679876315948}, {"author": "Industrial Quack", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אף אחד לא באמת יודע (מאיר או יהודה)\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רועי בניטה\nחוות דעת - תרגולים: אחלה מתרגל שבעולם וגם ממש חשוב לו שכל סטודנט יבין מה קורה בתרגול\n\nשעורי הבית: 6 יבשים סבירים ו5 רטובים ארוכים בפייתון שעולים ברמת הקושי בהדרגה כל שבועיים. לאחרונים חייב להיעזר ברפרנס אחרת נתקעים על זה שעות.\n\nהמבחן: הכי בזיוני שנתקלתי בו בטכניון. בקושי בודק את הידע שרכשנו במהלך הקורס ומתעסק בעיקר בשיט מציק של אלגברה 1 (משחקים של מעבר בין מטריצות לטורי ווקטורים ועוד חרא דומה). \nמעבר לכך, אני לא רואה איך מישהו ללא הארכת זמן אמור לפתור מבחן כזה בשלמותו; אצלנו דפקו בסוף הבחינה לבנות עץ החלטה שצריך בשבילו איזה 5 עמודים… עבודה של לפחות חצי שעה בשביל פאקינג 7 נקודות!!!!  (אם לא טעיתם כמובן). מפה לשם לא סיימתי את המבחן בכלל.\n\nהשורה התחתונה: אלא אם מעיפים על טיל את מי שכותב את המבחנים לאחרונה, להתרחק בכל מחיר!!! ראו הוזהרתם!!\nבגדול קורס חשוב ומעניין בחלקו ודווקא ההנגשה שלו דרך האתר שלהם מאוד נוחה למשתמש (חוץ מהפורום פיאצה המיותר הזה).\nאבל עוד פעם מזהיר לא שווה לקחת בכל מחיר תבדקו טוב טוב אם המרצה התחלף לפני.", "timestamp": 1691541115161}, {"author": "הסטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לא הגעתי להרצאות\nשם המתרגל/ת: לא הגעתי לתרגולים\n\nחוות דעת - למידת החומר:\nכלל החומר נמצא באתר הקורס (גם כדף WEB, גם כ PDF וגם כמצגות)\nחומר ההרצאות והתרגולים מקיף את האלגוריתמים והפיתוחים השונים.\nקיימות הקלטות מלאות של ההרצאות ושל מספר מתרגלים. \nהמלצה שלי - לתלמידי תואר שני ולתלמידים חיצוניים - אין סיבה להגיע פיזית.\nלקורס מצורף גם פורום פיאזה - בו אפשר לשאול שאלות את המתרגלים ולקבל הודעות מהסגל. ממליץ מאוד לעקוב אחריו במיוחד לקראת המבחן (ולמצוא את הקבוצת וואטסאפ של הקורס).\n\nשעורי הבית: \nאת שיעורי הבית עושים בזוגות.\n6 יבשים 5 רטובים. \nשיעורי הבית היבשים הם בדרך כלל 3-4 שאלות, כאשר אחת מהן חדשה והשאר מרופרנסים מהדרייב של הטכניון.\nסדר גודל של 6-7 שעות השקעה בלפתור את התרגילים עצמם, ועוד ~5 שעות לכתוב לקובץ וורד להגשה (או לאטק)\nסדר גודל של כל רטוב - 3 שעות. מאוד קלים ומודרכים במחברת נוטבוק. לא ארוכים בכלל.\n\nמבנה ציון:\n15% שיעורי בית, 85% מבחן\n\nהמבחן: \nאתם יכולים לראות את החציון. המועד היה קשוח מהממוצע בשנים האחרונות - ולדעתי לא מהסיבות הנכונות.\nאופי המבחן לא היה \"קלאסי\"\nבשנים האחרונות המבחן מורכב מ 5 שאלות. 2 שאלות ראשונות (29 נק' כל אחת), ועוד 3 שאלות בינוניות (~12-14 נק' כל אחת).\nבמבחן הנ\"ל היו הרבה סעיפים שלא בהכרח דורשים ידע בקורס, אלא יותר אלגברה לינארית בסיסית וטריקים מתמטיים לוגיים (ופחות אלגוריתמיקה נלמדת).\n\nהיה מותר להכניס עד 4 עמודים דף נוסחאות. ניתן לדחוס הרבה מאוד מהחומר.\nהמלצה שלי: להכניס אך ורק טריקים + את התרגולים (החלקים שבהם יש פיתוחים \\ תרגילים לדוגמה).\nאין זמן במבחן לדפדף ולקרוא. דף הבחינה יעזור רק בבלאקאאוט לראות איך ניגשים לתרגיל.\n\nלמבחן נתנו פקטור 5 נק'. לפי דעתי - הבדיקה לא הייתה קשוחה וסיזיפית.\n\nמבחינת מבחני עבר - עזר לי לעבור על המבחנים מ 2018.\n2018-2019 כדי ללמוד מהם את החומר, 2020-2023 להשתדל לפתור לבד (אתם תראו שיש הרבה טריקים חדשים - מייבאים עקרונות מחדווא\\אלגברה לינארית רנדומלית)\nבמבחנים יש המון טעויות - יש קובץ טעויות מוכרות באתר הקורס, אך הוא לא מעודכן למבחני 2021+.\n\nהשורה התחתונה: \nבתור סטודנט חיצוני אני ממליץ על הקורס - אין צורך בהגעה פיזית, הכל מרחוק (הפעם היחידה שהגעתי לטכניון היה במבחן).\nהשקעה ממוצעת במהלך הסמסטר.\nהצלחה במבחן דורשת למידה מאוד אינטנסיבית.\nממליץ להרגיש בנוח עם אלגברה לינארית (מטריצות) וחדווא (נגזרות, אינטגרלית) - מקסימום להשלים בתחילת הקורס את הדברים הבסיסיים.\nהחומר מאוד מעניין - סקירה תאורטית של התחום, עם נגיעות פרקטיות. \nהחומר נוגע בהרבה מאוד דברים קטנים ולכן הלמידה למבחן יכולה להרגיש לחוצה.\n\nבהצלחה", "timestamp": 1691588351801}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אין לי מושג עד עכשיו (באמת)\nחוות דעת - הרצאות: אני ראיתי את ההרצאות המוקלטות של יאיר עומר, מאוד מאוד מעניינות, עד לשלב של ההוכחות, שהן קצת מייגעות, אבל סה\"כ מאוד מעניינות.\n\nשם המתרגל/ת: נועה + ליאור (מוקלט)\nחוות דעת - תרגולים: התרגולים די סבבה, ברובם טכניים, מועברים טוב. התרגולים גם כתובים בצורה מאוד מאוד מפורטת ומעמיקה.\nבנוסף בסל יצא אחלה גבר איתנו עם כל שאלה שרצינו באמת נתן הסבר מהלב ועזר כמה שאפשר, שאר המתרגלים לא ממש.\n\nשעורי הבית: ארוכים מאוד, קשים מאוד, אבל באיזשהו מקום עוזרים לקלוט את החומר.\n\nהמבחן: ואוו, ואוווו, פשוט אין לי מילים, אכזבה ענקית אבל ממש ענקית, אתה חורש מבחנים, לומד את החומר לעומק ובסוף על מה שואלים אותך? על אלגברה... אכזבה ענקית, יכול לעודד חלק מכם שאצלנו זה היה חריג משאר הסמסטרים, בחינות מסמסטרים אחרים כן בחנו על החומר והיו פתירים, אצלנו זה היה מבחן פשוט גרוע והממוצע בהתאם.\n\nהשורה התחתונה: באתי מאוד פתוח ומאוד נלהט להיכנס ולהבין את התחום אבל לצערי הראו לי מעט מאוד דברים פרקטיים ומעניינים ויותר תאוריה ובעיקר אלגברה והסתברות.", "timestamp": 1703789043303}, {"author": "שם טוב האבי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nכפיר/יהודה לוי\nחוות דעת - הרצאות: \nההרצאות יש מצגות מוכנות שהם מאוד מפורטות וכפיר מנגיש אותם טוב ועונה על שאלות בשמחה. סך הכל כפיר מרצה לא רע ובא מוכן מאוד לשיעור. \nלמרות כל זה, אני עדיין חושב שההרצאות משעממות ולא בגלל כפיר. איך שעובר הקורס הוא שכל שבוע מלמדים אלגוריתם אחד או שתיים בהרצאה, מסבירים טכנית איך הוא עובד ולא נותן שום אינטואיציה או הבנה עמוקה שלו. מה שיוצא מזה שלומדים על מלא אלגוריתם ברמה של תיאור מאוד רדוד, ולא ברור בכלל איך בקונטקסט של עיבוד ריאלי של מידע אפשר לדעת במה אפשר להשתמש.\n\nשם המתרגל/ת: \nליאור (מוקלט)\nחוות דעת - תרגולים: \nמוקלט מסמסטרים ישנים, ליאור מכיר טוב את החומר ומעביר את התרגול טוב. התירגולים טכנים ולא דומים למבחן שהוא תיאורטי יחסית.\n\nשעורי הבית: \nיש תרגילים יבשים ורטובים. הרטובים קלים רצח בגדול חוץ מגליון אחד מחורבן, היבשים ארוכים ומייגעים.\n\nהמבחן: \nהמבחן מחורבן. דבר ראשון יש בו מלא אלגברה שלא מלמדים בקורס ומצפים שפשוט נדע, למרות שאין לאף אחד מושג. דבר שני למרות שהקורס מלומד טכני לחלוטין, המבחן שואל שאלות ממש עמוקות והבנתיות על האלגוריתמים, למרות שלא מדברים על זה באמת בהרצאה. זה מרגיש כמו מבחן לקורס אחר ממה שלמדנו. בדיקה קשה גם בתוכנת הגריידסקופ.\n\nהשורה התחתונה: \nקורס משעמם. מלמד מלא דברים באופן רדוד ויבש ברמת תיאור בלי הבנה או אינטוציה. ההייפ פה לא מוצדק לדעתי וזה קורס שאפשר לא לקחת, כי אפשר לקרוא על האלגורתמים האלו בויקיפדיה וזה בערך אותו רמת פירוט. לא מרגיש שרכשתי אינטואיציה חדשה לתחום או איזה ידע פרקטי, פשוט איך לחשב כפלי מטריצות.", "timestamp": 1703977642801}, {"author": "יאללה הפועל", "difficultyRank": 4, "generalRank": 5, "semester": "202302", "text": "שם המרצה: יניב רומנו\nחוות דעת - הרצאות: אחלה מרצה, היה לו חשוב שנבין את הדברים וגם המצגות והכל מסודר יפה ונגיש בשביל מעבר נוסף אחרי ההרצאה.\n\nשם המתרגל/ת: רועי בניטה\nחוות דעת - תרגולים: רועי מתרגל מעולה, היה לו ממש חשוב שאנשים יבינו והוא באמת השקיע המון בתרגולים.\n\nבכללי הסגל ממש חמוד, הם היו זמינים לכל שאלה ונתנו מענה הוגן, באמת ממש רצו בטובתנו וזה הורגש.\n\nשעורי הבית: היבשים לא מאוד קלים, חלק אפשר לרפרנס אבל מאוד מומלץ שלא כדי להגיע יותר מוכנים למבחן. הרטובים קצת מוזרים אבל לא דורשים הרבה עבודה.\n\nהמבחן: מאוד עמוס, כי יש המון חומר והמבחן מכסה באופן כזה או אחר הרבה מאוד ממנו. טיפ של אלופים: להתאמן מראש גם על חלוקת הזמן תוך כדי המבחן ולא רק על החומר עצמו.\n\nהשורה התחתונה: קורס די עמוס, אבל מלמד הרבה על גישות שונות שדרכן מתעסקים בכל העולם של מערכות לומדות. קצת שילוב של הסתברות, סטטיסטיקה ואותות אקראיים, עם כל החזאים והמשערכים שיש שם. סה\"כ ממליץ.", "timestamp": 1716905317273}, {"author": "unknown", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יניב\nחוות דעת - הרצאות: יניב הוא אחלה מרצה, יש לו המון תשוקה לתחום וזה מורגש באופן שהוא מעביר את ההרצאות. נותן המון אינטואיציה ומסביר את החומר באופן מעולה. \n\nשם המתרגל/ת: באסל חמוד\nחוות דעת - תרגולים: מתרגל מעולה, נותן המון אינטואיציה ודרכי פתרון. בתחילת כל תרגול עושה חזרה זריזה על כל האלגוריתמים והשיטות שכבר ראינו וככה יותר קל לסטודנטים לעקוב. הוא חד ושולט בחומר, תלכו אליו!\n\nשעורי הבית: יבשים ורטובים (15%). התרגילים היבשים בדר\"כ שאלות ממבחנים ולכן מומלץ לפתור אותם לבד ואז לוודא עם הרפרנס. לגבי הרטובים זה להשלים קטעי קוד בפייתון ולא לוקחים יותר מדי זמן.\n\nהמבחן: המבחן היה הוגן. הוא ארוך וצריך להתכונן אליו ממש טוב כדי להוציא ציון טוב. יש בו כמה טריקים מהסתברות ומאלגברה וכדאי להיות חדים על הנושאים האלה\n\nהשורה התחתונה: הקורס הוא מבוא למערכות לומדות, לומדים על אלגוריתמים לאימון מודלים של AI.  הסגל מקצועי ובא לקראת הסטודנטים, וזה משהו נדיר בטכניון", "timestamp": 1716982341050}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יניב רומנו\nחוות דעת - הרצאות:  אין על יניו. מרצה *מעולה*, מבין התחומו וגם בלהרצות. אישית גרם לי לעוף על התחום וכמובן שלא פיספסתי שום הרצאה. \n\nשם המתרגל/ת: באסל חמוד\nחוות דעת - תרגולים: מרצה לא פחות ממצטיין, ממליצה בחום! שולט בחומר, יודע על מה הוא מדבר, ונותן אינטואיציה. מסביר מצוין. בנוסף די עוזר כשצריכים אותו. \n\nשעורי הבית: סבבה, לרוב יש רפרנסים. \n\nהמבחן: מועד א' היה מאוד הוגן, אשכרה מבחן שבא לבחון את ההבנה נטו ולא מתעללים בך. מועד ב לעומת זאת היה ממש מאכזב ולא ברמת מועד א', אבל הסגל הוא טוב ורוב הסיכויים שיהיה בסדר.  \n\nהשורה התחתונה: אחלה קורס וסגל. ממליצה ממש.", "timestamp": 1718211136014}]}