{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פרופ' עמנואל כהן\nחוות דעת - הרצאות:  מרצה טוב, דואג להסביר את החומר בצורה טובה ושכולם יבינו, עושה סימולציות להבהרת החומר והסברתו\n\nשם המתרגל/ת:  נמרוד גינזבירג\n\nשעורי הבית:  5 ש\"ב יבשים, 2 רטובים. לא עמוסים, מלבד הרטוב האחרון.\n\nהמבחן:  בודק הבנה וידע בנושאים כמו תיאום, הגבר של דרגות בסיסיות ב- RF, יציבות דרגות...\n\nהשורה התחתונה: \nהקורס בעיקר עוסק באיך שמתמודדים עם מעגלים אלקטרוניים עם סלילים. לומדים על רשתות תיאום לצורך העברה אופטימלית של הספק, וגם תכן מעגלים RF בעזרת שימוש בדיאגרמת סמיט', ושיטות לקבלת הגבר מקסימלי...\nזהו קורס בסיסי במעגלים אלקטרוניים שמשמשים לצורך תקשורת, צריך להבין טוב בעיקר את ההרצאות ואת שיטות התיאום, והטופולוגיות השונות המוצגות שם\nמומלץ למי שמעוניין בתכן מעגלים לצורך תקשורת בסיליקון...", "timestamp": 1627294453017}, {"author": "VLSI", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עמנואל כהן\nחוות דעת - הרצאות: \nבשונה ממעגלים אנלוגיים (עד תדרים של ג'יגות בודדות), מעגלי RF כוללים קיבול פרזיטי גדול ומשמעותי של הטרנזיסטורים, וכן גורמים להחזרות כתוצאה מהטבע המפולג שלהם. הקורס מלמד איך להתמודד עם זה:\nעיקר הקורס מתעסק ב-S parameters, רשתות תיאום, עבודה עם smith chart, ובגדול איך בוחרים פרמטרים של מגבר.\n\nעמנואל מאוד מנוסה, אבל בגלל זה רוב הקורס הוא מלמד כללי אצבע , במקום להעביר בצורה טובה והדרגתית את החומר.\n\nאחד הקורסים הכי מבולגנים שעשיתי בתואר. כל הרצאה מפוצצת בשקופיות מתמטיות מבולגנות שעל רובן עמנואל מדלג, אבל למרות זאת בסוף גם לא מספיקים את החומר.\n\nשם המתרגל/ת: איתמר מלמד\nחוות דעת - תרגולים: \nהתרגולים יותר פרקטיים מההרצאות, אבל גם הם לא מכסים הכל. איתמר מלמד בצורה די יבשה, לא מחובר לאווירה בכיתה.\n\nשעורי הבית: \nלנו היו חמישה יבשים, שקצת לא מובנים, אבל לא לוקחים יותר מדי זמן (לרובם יש רפרנסים). יש שני רטובים שכמו הרבה רטובים בשרשרת VLSI, רוב הזמן מתבזבז על זה שלא ברור מה רוצים ממך לעשות\n\nהמבחן: \nקשה ללמוד אליו. בהתחלה כשפותרים מבחנים זה מרגיש כאילו שואלים על דברים שלא התעמקו בהם מספיק בקורס. המבחן עם חומר פתוח (יכולים לשאול על איזו נוסחה נישתית מההרצאה).\n\nהשורה התחתונה: \nקורס שהיה יכול להיות מעולה, אבל כמו הרבה קורסים בשרשרת VLSI, גרוע בגלל בלאגן. חבל.\nלא ממליץ לקחת את הקורס, אא\"כ אין אלטרנטיבה, או שממש חשוב לכם ללמוד על מעגלי RF.", "timestamp": 1692129655002}]}