{"posts": [{"author": "החתול של שרדינגר", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה:  אייל בוקס\nחוות דעת - הרצאות: \nהרצאות מעניינות מאוד למי שאוהב את תחום הקוונטים ולא מפחד ממתמטיקה , אייל משתדל לתת הסברים פיזיקלים אינטואיטיבים ככל הניתן איפה שניתן וזה עוזר מאוד להתחבר \nההרצאות לקוחות מחוברת שהוא כתב ומכילות את כל התוכן עם פירוט מצוין והוכחות מסודרות להפליא כך שניתן ללמוד הכל מהחוברת לבד אם רוצים .\nהקורס הוא המשך ישיר של קורס מכניקה קוונטית שאייל מעביר בפקולטה לחשמל ולכן ישנה התבססות רבה עליו , מומלץ לקחת אותו לפני (אם הוא לא קדם)\nשם המתרגל/ת:  ליאור בר הלל \nחוות דעת - תרגולים: \nתרגולים מעולים , כתובים טוב , ברורים ומכסים את החומר בהרצאות + דוגמאות טכניות שמתרגלות את התוכן שנלמד בהרצאות ולא רק מוסיפות עוד חומר חדש שלא נלמד .\nליאור מעביר את התוכן בצורה מצויינת .\n\nשעורי הבית: \nאין - יש תרגילים לתרגול עצמי בחוברת של אייל כולל פתרונות מפורטים .\n\nהמבחן: \nהיה בוחן אמצע לא קשה בכלל שנותן 30% מגן לקראת סוף סמסטר כך ששומרים על כושר על רוב החומר .\nהמבחן הסופי הוגן , לא מחפש בקטנות ובאמת מרגישים שבא לבדוק הבנה ולא טריקים מתמטיים (מאופן הבדיקה) או שינון כמו תוכי . התרגילים דומים באופי לתרגילים מהחוברת של אייל אך עם טוויסט חדש כלשהו .\nצריך לבחור 3 מתוך 4 שאלות .\nהשורה התחתונה: \nמהקורסים הטובים שלקחתי בתואר , ולדעתי מי שאוהב את תחום הקוונטים הייתי ממליץ עליו בחום .\nלא עמוס בכלל ולכן מאפשר להתקדם בקצב אישי והוא נועד להבין נושאים מתקדמים כמו אינטגרלי מסלול של פיינמן , קוונטיזציה שניה , אינטראקצית אור חומר ועוד..  אשר מהווים בסיס חשוב ליישומים בטכנולוגיות קוונטיות (יש גם קורס כזה)\nעם זאת , החומר לא פשוט בכלל! ומכיל הרבה מתמטיקה ואלגברה וצריך להיות מוכנים לזה נפשית ומקצועית .", "timestamp": 1659282202816}, {"author": "Ori", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אייל בוקס\nחוות דעת - הרצאות: ההרצאות מעניינות מאוד. כמו שנאמר מקודם, הן יחסית מתמטיות, אך אייל משתדל שלא לתת משוואות באוויר מבלי להסביר גם איך הדברים באים לידי ביטוי בפיזיקה\n\nשם המתרגל/ת: עמנואל גרבשטיין\nחוות דעת - תרגולים: תרגולים טובים מאוד. עמנואל מתרגל טוב. מסביר בצורה מובנת ותמיד שמח להסביר ולעזור\n\nשיעורי הבית: קצת מאתגרים, אך מלמדים טוב מאוד ועוזרים להטמיע את מה שנלמד\n\nהמבחן: הסמסטר היה מבחן בית. בסה\"כ הוגן. לא קל, אך לא ניכר שמחפשים להפיל בו\n\nהשורה התחתונה: קורס ממש מעניין. לדעתי, הוא חשוב למי שמתעניין במכניקת הקוונטים ולא למד \"פיסיקה קוונטית 1\" ו\"פיסיקה קוונטית 2\". הקורס אמנם אינו פשוט, והוא בהחלט דורש השקעה, אבל לטעמי זה שווה את זה", "timestamp": 1715277832973}]}