{"posts": [{"author": "סטודנט/ית", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גיא\nחוות דעת - הרצאות: עושה רושם של מרצה טוב אבל הקורס מאוד מבולגן. לא נכנסים לנושאים יותר מדי ולכן קשה לפתח הבנה עמוקה.\n\nשם המתרגל/ת: יוסף\nחוות דעת - תרגולים: משתדל מאוד שהסטודנטים יבינו אבל התרגולים עמוסים מדי לשעה אחת. היה צורך להשלים את התרגולים לבד אבל חלקם לא כתובים טוב.\n\nשעורי הבית: החלק הרטוב - מונפץ ממש, צריך לרפרנס. החלק היבש - יחסית סביר אבל יש שאלות שלא ברור מה הקטע.\n\nהמבחן: עדיין לא היה. כדאי לציין שאין הרבה מועדים של גיא כי הקורס עבר שינוי.\n\nהשורה התחתונה: הקורס לא אפוי, אל תתנו להיסטוגרמות להטעות אתכם. יש הרבה חוסר סדר בחומר, בנוטציות, חוסר תיאום בין המרצה למתרגל ובאופן כללי תחושה מאוד מתסכלת של \"שכונה\". לדעתי יש לקורס פוטנציאל אבל צריך לתת כמה סמסטרים טובים (ורצון מצד הסגל) כדי לעשות סדר.", "timestamp": 1644487435765}, {"author": "הראשונה לשמה", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: המרצה מאוד חביב וההרצאות די קלילות. החומר סבבה - פשוט המשך למבלס. מקנה הבנה טובה יותר לנושאים שנגענו בהם בקטנה במבלס.\n\nשם המתרגל/ת: יוסף\nחוות דעת - תרגולים: לא מאוד ברור, לא מצליח להספיק בזמן של התרגול. התנהלות טכנית מבאסת (קיבלנו ציונים על ת\"ב אחרי המבחן וכו)\n\nשעורי הבית: די מעיקים, אבל לא סוף העולם. החלקים הרטובים מעצבנים יותר. \n\nהמבחן: מביש. היו להם כל כך הרבה טעויות ניסוח ושאלות לא ברורות. לא פיצו על כל הזמן שנשרף לנו. באיזשהו שלב המרצה המליץ לנו ברוב טובו לדלג על אחת השאלות כי היא קשה וחבל על הזמן שלנו. הרמה של המבחן לא הייתה דומה למבחני עבר,\nבטח שלא למבחני העבר של גיא. \n\nהשורה התחתונה: ממש מקווה שהם הולכים להשתפר, כי זה ממש חבל. לקורס באמת יש פוטנציאל. גיא הוא באמת מרצה מקסים, לא מבינה מאיפה הגיע המבחן הזה וההתנהלות הזו.", "timestamp": 1660514611939}, {"author": "אות מסתגל", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: \n\nשעורי הבית: ממוחזרים , אבל מאוד ארוכים ודורשים השקעה , יש אי תיאום מאוד רציני בין תרגילי הבית לחומר הקורס החדש והמבחן , הם עדיין במתכונת הישנה\n\nהמבחן: אני יכול לתאר אותו רק במילה אחת : \"בושה\"\n\nהשורה התחתונה: לא לקחת , הממוצע לא מייצג את רמת הקורס בכלל", "timestamp": 1677581042773}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: מעניינות. גיא מסביר בצורה די מובנת, אך יש לא מעט מקרים שניכרת בהם תחושה של נפנוף ידיים.\n\nאחר כמעט כל הרצאה, הופיעה ב-moodle שאלת מגן של 0.5% בנושא שנלמד (בסה\"כ אפשר היה לצבור מגן של עד 5%)\n\nשם המתרגל/ת: אלכסנדר בלבנוב\nחוות דעת - תרגולים: ניכר שהיה לו קשה, בעיקר בתרגולים הראשונים, אך הוא השתפר עם התקדמות הסמסטר. הוא נחמד ומשתדל לבוא לקראת הסטודנטים. יחד עם זאת, התרגולים ארוכים מאוד, והוא לא הספיק לעבור על הכול\n\nשיעורי הבית: היו ארבעה תרגילי בית להגשה במהלך הסמסטר (חובה - 20% מהציון הסופי). זה לא עמוס במיוחד, אך ניכר שהם לא מעודכנים ולא ממש רלוונטיים למבחן הסופי. לדעתי, אם ימשיכו להעביר את הקורס, צריך לשנות אותם בצורה כזו או אחרת\n\nהמבחן: עם חומר פתוח. בדומה לשנה שעברה, המבחן (גם מועד א' וגם מועד ב') לא פשוט ונדרשת הבנה טובה כדי להצליח בו. בשני המועדים הביאו פקטור של חמש נקודות לציון המבחן\n\nהשורה התחתונה: הקורס מעניין מאוד ומתחיל להיכנס יותר לעומק של עיבוד אות לעומת מבל\"ס. יחד עם זאת, לדעתי, הוא טעון שיפור בתרגולים ובתרגילי הבית", "timestamp": 1678610507103}, {"author": "רון", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרופ' גיא גלבוע\nחוות דעת - הרצאות: נותן אינטואיציה טובה להבנת החומר, בסך הכל די בסדר.\n\nשם המתרגל/ת: אלכסנדר בלבנוב\n\nשעורי הבית: 4 ת\"ב כ\"א עם חלק רטוב+יבש. ארוכים.\n\nהמבחן: \n- המבחן עם חומר פתוח, וכולל שאלות על כל החומר שנלמד. צריך להבין בצורה דיי טובה הן את ההרצאות והן את התרגולים.\nהשורה התחתונה: \nהקורס מתעסק בנושאים מתקדמים בעיבוד אותות, כגון אינטרפולציה ודצמציה, שערוך ולמידה, ייצוג ע\"י בסיסים שונים ובצורות שונות, STFT, WAVELETS , ומערכי מסננים.\nסה\"כ סבבה, אבל המבחן קצת קשה.", "timestamp": 1680248314623}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גיא גלבוע\nחוות דעת - הרצאות: מרצה מעולה, מסביר בגובה העיניים ולא מתעכב על הוכחות שלא צריך\n\nשעורי הבית: שתי מטלות בית 5% תקף כל אחת ופרויקט קטן ששווה 20% תקף. גודל המטלות סביר, לוקח יותר מכמה דקות אבל לא שורף את כל היום\n\nהמבחן: בינוני, קשה ללמוד אליו כי השאלות ייחודיות אבל כשלעצמן הן לא קשות מדי. אם באמת הבנת את החומר יש לך 90, אם פחות השקעת עדיין ריאלי לעבור\n\nהשורה התחתונה: אני מרוצה מהקורס. הוא סוגר פינות פתוחות מקורסי עיבוד אותות קודמים ואינדיקציה טובה לרלוונטיות של החומר המעשי היא שיצא לי להיתקל במושגים מהקורס בפרויקט אמיתי בעבודה.", "timestamp": 1715068909133}]}