{"posts": [{"author": "אור כהן", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "מעניין וחשוב", "timestamp": 1600587984237}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה:  דנה דרקסלר\nחוות דעת - הרצאות: חומר מעניין, חלקו מאוד פרקטי וחלקו (הלא קטן) תיאורטי (P=NP), דנה מלמדת בצורה קצת משעממת (אבל רק קצת) אבל היא מאוד נחמדה ומאוד חשוב לה שהסטודנטים יבינו.\n\nשם המתרגל/ת: גיא גורן\nחוות דעת - תרגולים: מאוד נחמד, מעביר את החומר בצורה מעניינת, נחמד, היו סטודנטים שהעגיפו את שיר (שהיא גם תותחית) אבל אני מאוד ממליץ על גיא.\n\nשעורי הבית: \nבכנות אני כבר לא הכי זוכר, יבשים כמו בלא מעט קורסים, יש רפרנסים ללא מעט מהשאלות בדרייב (אבל לא להכל בדר\"כ), בכל זאת הגיליונות (אחת לשבועיים בערך) לוקחים כמה שעות.\n\nהמבחן: \nמועד א' היה מאוד הוגן, ממוצע מרשים, הורידו קצת חומר במיקוד.\nמועד ב' הממוצע היה נמוך בלא מעט נקודות, ניתן פקטור על שאלה שהרוב לא הצליחו. קשה באמת להשוות בין הממוצעים של המועדים מפני שבמועד ב' נבחנו רק 12 סטודנטים ורוב הסטודנטים שניגשו למועד א לא ניגשו למועד ב'.\n\nהשורה התחתונה: \nמאוד ממליץ.\nמה שכן, סטודנטים רבים מתלבטים האם לקחת את הקורס הזה או את מבנה מחשבים, אז ככה: מבנה מחשבים הוא יותר עמוס יותר פרקטי והוא בכלל תכנותי, מבחינת עניין זה תלוי סטודנט אבל מיכרותי עם סטודנטים הרוב יאהבו יותר את מבנה מחשבים, אם אהבתם את מבנה נתונים ואלגוריתמים יש סיכוי טוב שתאהבו את תכן.", "timestamp": 1610500377596}, {"author": "חמוס קופצני", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: בן אדם נחמד וגם מרצה טוב סה\"כ, לא מראה רלוונטיות של החומר ויש תחושה שהוא מדפדף קדימה במצגת אז טיפה משעמם\n\nשם המתרגל/ת: שיר\nחוות דעת - תרגולים: מתרגלת סבבה\n\nשעורי הבית: גליון בשבועיים עם איזה 5 שאלות קצרות אבל קשות, שווה להשקיע\n\nהמבחן: קשה. הביאו לנו שאלה על איזה אלגוריתם שנגעו בו חצי שעה בהרצאה #2 אז שווה להבין ולזכור הכל..\n\nהשורה התחתונה: חומר מגניב ומעשיר אז ממליץ סה\"כ", "timestamp": 1612484959191}, {"author": "Ben Sarussi", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דנה דרקסלר\nחוות דעת - הרצאות: \nמלאות בהוכחות ולא הכי קלות להבנה\nשם המתרגל/ת: שיר כהן\nחוות דעת - תרגולים: \nתרגולים לא קלים אבל מתרגלת אלופה\nשעורי הבית: \nפעם בשבועיים שישה תרגילים קשים שצריך לעבוד עליהם קשה כדי לקבל ציון טוב\nהמבחן: \nהמבחן קשה כמו כל הקורס \nהשורה התחתונה: קורס לא הכי כיפי בעולם , מתאים למי שאוהב אלגוריתמים.", "timestamp": 1625987680087}, {"author": "נעה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: דנה ממש נחמדה ומסבירה דברים טוב. פשוט ההרצאות מלאות הוכחות וחומר תאורתי אז אותי אישית שיעמם\n\nשם המתרגל/ת: שיר\nחוות דעת - תרגולים: אלופההה!!! אחת המתרגלות הטובות! מסבירה ממש טוב והופכת כל דבר לפשוט..\n\nשעורי הבית: 6 גליונות. יש שאלות קשות יותר וכאלה שקשות פחות אבל הכל זה שאלות ממבחנים!! אז זה אשכרה מכין אותך למבחן ואם באמת משקיעים בהם אז הלמידה למבחן הרבה יותר זורמת... ובדרך כלל גם לרוב השאלות יש רפרנסים אז בכלל סבבה\n\nהמבחן: הוגן, הוא כמו חידות כזה, ואם פותרים הרבה מבחנים זה שאלות הגיון שהרעיון חוזר על עצמו\n\nהשורה התחתונה: אחלה קורס שבעולם למי שאוהב אלגוריתמים", "timestamp": 1626277373133}, {"author": "P=NP", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דנה דרקסלר\nחוות דעת - הרצאות: מרצה ממש טובה.\nבעבר הקורס היה נחשב קשה ולא מובן, אבל ההרצאות של דנה כל כך טובות שהקורס ממש זורם והחומר מובן.\n\nשם המתרגל/ת: שיר כהן\nחוות דעת - תרגולים: מתרגלת מצויינת.\nההשקעה שלה ניכרת, והתרגולים עוברים בצורה נעימה.\n\nהשורה התחתונה: \nמומלץ מאד,\nאחד מהקורסים הכי מעניינים שעשיתי בתואר.", "timestamp": 1626356787721}, {"author": "E", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  דנה\nחוות דעת - הרצאות: דנה מסבירה טוב אבל לדעתי ההרצאות די משעממות. רובן מהפורמט של : הנה אלגוריתם/משפט, בואו נבלה שעתיים עם מיליון טענות עזר ואמ''מ ונוכיח את זה, בהצלחה לעקוב. \n\nשם המתרגל/ת: שיר.\nחוות דעת - תרגולים: מסבירה מעולה.\n\nשעורי הבית: 6 יבשים, לוקחים סדר גודל של כמה שעות ~ 2 ישיבות. לא פשוטים וחלקם אפילו הייתי אומר קשים מאוד אבל מאוד מאוד קריטיים להבנת החומר כי הם ברמת מבחן ודרכם מתבצעת רוב הלמידה לדעתי.\n\nהמבחן: היה טיפה קשה מהרגיל אבל באותו סגנון של שנים קודמות, מכסה את כל החומר עם פילוג נקודות הוגן. נתנו פקטור כדי לאזן את הממוצע לשנים קודמות.\n\nהשורה התחתונה: החומר סביר מבחינת עניין, מאוד דומה למבני נתונים ואלג'(זה ממש המשך ישיר שלו). אישית לא התחברתי להרצאות ובמהלך הסמסטר החומר לא ישב בצורה הכי טובה אבל בסופו של דבר המבחן לא קשה כל כך והעקרונות לפתירה שלו חוזרים על עצמם אז אפשרי לקבל ציון טוב.", "timestamp": 1627420766388}, {"author": "EXP", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: דנה מרצה טובה, אבל ההרצאות פשוט לא מספיק מעניינות. מרביתן הולכות עם הפורמט:\nבוא נחפור על איזה משהו, נוכיח טענות עזר ונוכיח את זה . לא הרגיש לי יותר כיף בלשון המעטה.\n\nשם המתרגל/ת:  שיר\nחוות דעת - תרגולים:  מתרגלת טובה, מסבירה מעולה.\n\nשעורי הבית: קשים, אבל הכי הכי קריטיים.. רק דרכם הבנתי את מה שהולך בקורס הזה. במיוחד בחלק השני.\n\nהמבחן: קשה מהרגיל לטעמי, אבל איזנו עם פקטור..\n\nהשורה התחתונה: אני לא כלכך מרוצה מהקורס. מצד אחד החלק הראשון באמת מעניין ופותח עניים לאן אפשר להגיע ואלגוריתמים מתקדמים ומגניבים, אבל אז מגיע החלק השני של הקורס שהוא בגדול חישוביות. לא התחברתי לנושא, לא נהנתי לנושא. מאוד תיאורטי, מאוד באוויר, בכללי לא נהנתי מהנושא הזה בכלל. לדעתי זה פשוט הרס את החוויה של הקורס.", "timestamp": 1634667179765}, {"author": "פלויד וורשל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יורם\nחוות דעת - הרצאות:\n\nשם המתרגל/ת: שיר\nחוות דעת - תרגולים: \n\nשעורי הבית: לא פשוטים בכלל. שאלות ברמה של מבחן. בסמסטר הזה היו כמה פעמים שפרסמו שיעורי בית ואז אחרי שאתה שובר את הראש שעות על מה רוצים ממך בשאלה אתה מקבל מייל שאופס חלק מהשאלות הן על חומר שעדיין לא למדנו. תנסו להסתכל במבחנים משנים קודמות להשיג רפרנס.\nגם צריך להקליד את התשובות שזה גם יכול לקחת הרבה זמן למי שלא רגיל.\n\nהמבחן: לא פשוט אבל אם עושים מספיק מבחנים מבינים את הרעיון וכמעט הכל חוזר על עצמו.\nבמועד א' אצלנו היו כמה שאלות שהופיעו בשיעורי בית. מועד ב' היה הרבה יותר קשה וגם עם ממוצע נמוך אחרי פקטור של 10 נקודות.\n\nהשורה התחתונה: בגדול הקורס מלמד אותך לפתור בעיות בכל מיני דרכים. לדעתי החומר מעניין וחשוב, גם החלק של החישוביות היה יפה בעיני.", "timestamp": 1647182817673}, {"author": "Eliyahu Wiener", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דר. דנה דרקסלר כהן\nחוות דעת - הרצאות: מסבירה טוב את החומר, יש הקלטות של ההרצאות (כרגע) אז לא חייבים להגיע (היתרון בהקלטות הוא שחלק מהחומר של ההרצאות פשוט יחסית אז אפשר להריץ אותו בהקלטה)\n\nשם המתרגל/ת: משי בשרי\nחוות דעת - תרגולים: אחלה מתרגלת, מסבירה טוב ועונה לשאלות\n\nשעורי הבית: עוזרים לתרגל את החומר, חלק מהשאלות לקוחות ממבחנים אז אפשר לראות משם את רמת הקושי\n\nהמבחן: לא קשה אם שולטים בחומר של ההרצאות (ההוכחות לכל המשפטים והלמות לא כל כך נחוצות) והתרגולים, אבל אין הרבה זמן אז חייבים להתרגל לפתור מהר שאלות\n\nהשורה התחתונה:", "timestamp": 1657605128430}, {"author": "תברחו", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: אחלה מרצה\n\nשם המתרגל/ת: שמי\nחוות דעת - תרגולים: תרגולים טובים שעוברים אחלה על החומר\n\nשעורי הבית: די סטנדרטיים, 5 מתוך 6 גליונות של תרגילים מתוך מבחנים\n\nהמבחן: המבחן היה פשוט לא מחובר למציאות.\nקשה פי 1000 מכל מה שהיה עד היום, עם תרגילים ארוכים, ים סעיפים וניסוחים מבלבלים.\nבנוסף על כך הוסיפו לנו שאלה בחומר של קירובים שלא היה עליו עד היום אף שאלה במבחנים למעט במבחן בודד מ2016, ואחת קלה בשיעורי בית.  \nקורס קלאסי של חשמל שנותן את הרושם שמכוון להוריד את הממוצע בלי שום הצדקה.\nהשורה התחתונה: לא לקחת אם לא חייבים, המבחן הוא רולטה ואנחנו נפלנו לא טוב.", "timestamp": 1657641362054}, {"author": "מבואסניון", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דנה דרקסלר כהן\nחוות דעת - הרצאות: יש הרצאות שמועברות באופן ברור ויש הרצאות שרצים על חומר, יש מוקלטות בסמסטר שאני הייתי בו.\n\nשם המתרגל/ת: בשרי שני\nחוות דעת - תרגולים: מועברים בצורה מובנת אבל התרגילים לא ברמה של המבחן\n\nשעורי הבית: גיליונות עם שאלות שחלקם ממבחנים, רמת השאלות קלה יותר ממבחנים\n\nהמבחן: קשה הרבה יותר משיעורי הבית\\תרגולים, בסמסטר שעשיתי היה יותר קשה לעומת מבחני עבר בכמה רמות\n\nהשורה התחתונה: לא מומלץ כקורס בחירה רק אם אין ברירה", "timestamp": 1657809503230}, {"author": "1", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דנה דרקסלר\nחוות דעת - הרצאות: מרצה מעולה, רואים שאכפת לה מהסטודנטים ומהקורס אבל לצערי הרב ההרצאה לפעמים מכילה הוכחות על משפטים וכדומה שגם לא ממש תורמים יותר מדי להבנת החומר וגם מאוד מייגעים, אז דבר ראשון תלכו או תראו את ההרצאות ודבר שני אל תקחו קשה אם אתם לא מבינים את החלק של ההוכחות, אל תרגישו רע, זה לא יפגע בכם מבחינת מבחן.\n\nשם המתרגל/ת: משי באשרי\nחוות דעת - תרגולים: מתרגלת מעולה, מאוד מאוד ממליץ עליה, מסבירה את החומר כמו שצריך לעניין.\n\nשעורי הבית: ש.ב ארוכים קשים וחשובים. בנוסף היה איזה סעיף אחד רטוב שצריך לממש בו משהו בפייתון אז שימו לב שאם אתם לא יודעים אז כדאי לכם ליפול על שותף שכן יודע קצת פייתון.\n\nהמבחן: המבחן היה קשה מאוד, בסוף נותנים פקטורים אל תתרגשו יותר מדי, תלמדו טוב במהלך הסמסטר, אל תזרקו על הקורס, תפתרו 6,7 מבחנים ואתם סבבה.\n\nהשורה התחתונה: למי שבמסלול מחשבים תוכנה אז אין לכם ברירה, אבל מי שלא ולא חייב לבחור בקורס הזה הייתי חושב פעמיים, אומנם זה קורס שחלקו מאוד מאוד מעניין אבל הוא די קשה, אתם צריכים ממש לאהוב את התחום כדי ללכת על זה.", "timestamp": 1657809908093}, {"author": "יעל", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דנה דרקסלר כהן\nחוות דעת - הרצאות: אני מאוד נהניתי. ההרצאות ברורות ומסודרות, דנה מרצה מעולה.\nשם המתרגל/ת: משי\nחוות דעת - תרגולים: לא ראיתי המון מהתרגולים, בעיקר קראתי את המצגות, אבל כשמשהו היה לא ברור הסתכלתי אצלה והיא מסבירה ממש טוב. \n\nשעורי הבית: מאוד מומלץ לעשות אותם כמו שצריך כדי להפנים את החומר. \n\nהמבחן: היה בסדר, קצת עמוס יחסית לזמן הנתון אבל היה פקטור נדיב בגלל זה.\n\nהשורה התחתונה: אהבתי. בנוי בצורה מסודרת ושיטתית.  מי שהנושא של אלגוריתמים מעניין אותו ואוהב לפתור חידות נחמדות זה אחלה קורס.", "timestamp": 1658648319145}, {"author": "Arnold Cheskis", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: רצה מהר מדי על ההרצאות, בקושי היה זמן לשאלות, אבל העבירה את החומר בצורה מסודרת. פשוט רוב הכיתה לא הייתה מספיקה להבין\n\nשם המתרגל/ת: רועי ?\nחוות דעת - תרגולים:  תותח. מוודה הבנה, מתעכב כמה שצריך, ומעביר בצורה ברורה את החומר\n\nשעורי הבית: 5-6 שאלות בגיליון עם שותף, אבל עלול להיות קשה ולקחת לא מאט זמן\n\nהמבחן: עשו לנו את המוות. מבחן לא הוגן בעליל, אף אחד לא הספיק לסיים, והביאו לנו בסוף 16 נק' פקטור. 5 שאלות ב-3 שעות למבחן שהיה פשוט לא הגיוני\n\nהשורה התחתונה: היה כיף (?)", "timestamp": 1678201418488}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דנה\nחוות דעת - הרצאות: דנה מרצה מעולה. תוך כדי הסמסטר היא משקיעה ממש ועונה לשאלות. מאוד נחמדה ונראה שאכפת לה מהסטודנטים אבל הבעיה היא שזה רק נראה ככה.\n\nשם המתרגל/ת: שיר- מוקלט\nחוות דעת - תרגולים: אחלה תרגולים. החומר נשאר אותו חומר אז הכל טוב. יש רק איזה תרגול בסוף שהוא קצת שונה אז כדאי פשוט לראות את המוקלט של משי שהיא גם ממש אחלה מתרגלת.\n\nשעורי הבית: ארוכים ומייגעים אבל כן עוזרים להכין למבחן.\n\nהמבחן: הוגנות זה לא ממש ערך עליון של הסגל הזה. במועד א' היו 16 נקודות פקטור ובמועד ב' שהיה פי כמה יותר קשה היו 10 נקודות פקטור. מכיוון שזה דבר שקורה אצלם כל סמסטר העניין עם הממוצעים הנמוכים ואז פקטור שכביכול מפצה על זה אבל עדיין הממוצעים נשארים ממש נמוכים אז אפשר להבין שזה לא בטעות ושהיא בכוונה עושה מבחנים מטורפים כדי שהיא תוכל לשלוט בממוצע ממש על הנקודה ורואים את זה. גועל נפש של התנהגות. המון סטודנטים מתוסכלים ממש מהקורס הזה ובצדק. \n\nהשורה התחתונה: הקורס הוא קורס פשוט מצוין. רמת ההוראה של הסגל ממש גבוהה והוא מעניין  וגם ממש חשוב. מצד אחד אני ממליצה עליו כי נורא אהבתי אותו ומצד שני לא יודעת אם העוגמת נפש שווה את זה. בסוף קיבלתי אחלה ציון אבל באמת ששום דבר במבחנים שלהם לא הוגן.", "timestamp": 1678871255852}, {"author": "zubi", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nהיה קשה לעקוב אחריה בהרצאות לפעמים, אבל שרי ממש מתוקה סהכ, אכפת לה מהסטודנטים. הבעיה שהיא נוטה לכסח במבחנים בכל קורס שהיא מעבירה עם השאלות, ואז לפעמים להיות סלחנית בבדיקות, לא מתכון טוב...\nשם המתרגל/ת: אורי גדות\nחוות דעת - תרגולים: \nאורי תותח, הבחור חד אין ויכוח על זה, אוהב שמשתתפים ואוהב לשמוע את הפתרונות שסטודנטים מציעים לתרגילים, אפילו אם זה לא הפתרונות המוצעים. מאוד ממליץ עליו!\nשעורי הבית: \nמזעזעים, כל כך ארוכים, כל תרגיל לוקח עמוד וחצי וחייב להקליד הכל, 6 שאלו תכל גיליון כל אחת מזוויעה יותר מאלו שלפניה\n\nהשורה התחתונה: \nבכנות, יש נושאים מעניינים ממש בחצי הראשון של הקורס. החצי השני משעמם פיצוצים ולא ברור כל כך. לקחת רק אם חייב", "timestamp": 1687816087337}, {"author": "---", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שינולד שרי\nחוות דעת - הרצאות:  מרצה סבבה סך הכל\n\nשם המתרגל/ת:  אורי גדות\nחוות דעת - תרגולים:  אורי מתרגל מהטובים ביותר שראיתי בטכניון, מסביר את החומר בצורה מצוינת ומאוד נחמד.\n\nשעורי הבית:  ארוכים מאוד, חייב להקליד\n\nהמבחן:  עדיין לא היה\n\nהשורה התחתונה:  קורס לא קל, מחולק ל5 נושאים שכל אחד מהם יחסית כבד.", "timestamp": 1689283564704}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: שרי מעולה בדרך שהיא מעבירה את ההרצאות. לא חוסכת על ההבנה מכל הסטודנטים שלה. פתחה אצלנו זום במקביל אבל לא הקליטה חוץ מהשלמה.\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: אורי יודע להסביר את החומר ממש טוב וגם בתרגולים ממש מנסה לגרום לסטודנטים לחשוב על הפתרון עם נתינת רמזים במקומות הנכונים אבל גם יודע מתי להתקדם אם רואה שלא מצליחים. נותן אינטואיציה טובה לגבי הנושאים השונים.\n\nשעורי הבית: 15% תקף - 6 גיליונות שצריך להגיש רק 5 בשותפים. כל גיליון בסביבות ה-5 שאלות שרובם ממבחני עבר אז הם לוקחים זמן בגלל שמנסים לפתור חידות בפעם הראשונה - במיוחד גיליון 1 על תכנון דימני (תעשו לעצמכם טובה ותעזרו ברפרנס אם אתם לא מצליחים לעלות על התשובה בזמן סביר).\n\nהמבחן: שרי בישלה מועד א' ארוך במיוחד לטעמי וטעם שאר הסטודנטים רק הוא היה די קשה אך פיצו בפקטור שורש קליל. פתירה של מבחני עבר היא קריטית אבל השאלות של תכנון דינמי ובעיות NPC הם הימור לגמרי שהאם מבינים או לא.\n\nהשורה התחתונה: חומר במעותו מעניין - פתירת שאלות בעיקר סבל. סגל טוב ואכפתי. החליטו שאני נשאר מאחורה בטיסה מהשאלה של תכנון ליניארי.", "timestamp": 1690381288150}, {"author": "הסובל", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  דנה דרקסלר\nחוות דעת - הרצאות:  ראיתי מוקלט, הרצאות קצת כבדות אבל חשוב לראות אותן לפני התרגולים כדי להבין את התאוריה, היא מסבירה מעולה אבל מהירה מאוד.\n\nשם המתרגל/ת: משי / אורי\nחוות דעת - תרגולים: הם שניהם מעולים, אורי נבחר מתרגל מצטיין ומשי היא פשוט מעולה , צמד מתרגלים הכי טובים שיש.\n אני הייתי אצל משי והיא מסבירה מעולה ונותנת אחלה אינטואיציה לשאלות ולמבחן וגם האווירה אצלה מעולה.\n\nשעורי הבית:  חמישה גיליונות הכי שחורים שתעשו בחיים שלכם, תבנו על זה שכל גיליון זה בערך בין 6-8 שעות עבודה , כמובן מוקלד\nיש תמיד שאלה אחת שמשנים בין סמסטרים אז אל תרפרנסו בליינד.\nמה שכן כמעט כל השאלות שיעורי בית הן ממבחני עבר בגלל זה ממש ,אבל ממש אל תוותרו על זה.\n\nהמבחן: לא רואים בהיסטוגרמה אבל לנו היה 16 נקודות פקטור וככה זה כל סמסטר.\nיש שאלה על כל נושא שנלמד (סה״כ 5 שאלות) .\n\nהשורה התחתונה: לא סתם הקורס הכי קשה בתואר, אני אישית מאוד אהבתי את החומר ומאוד מעניין אבל אם זה לא חובה אז ממש לא ממליץ, תחשבו על זה כמו מבנה נתונים על סטרואידים\n\nואין על התרגולים של משי.", "timestamp": 1716322542168}]}