{"posts": [{"author": "דקל וקנין", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אבי מנדלסון וליאוניד\nחוות דעת - הרצאות: \nברוב ההרצאות נותנים סקירה בסיסית על נושא מסוים באבטחת חומרה, כאשר רוב הדגש הוא side channels. \nלמשל הרצאות על מימוש קריפטו בחומרה, התקפות side channels על AES, התקפות ארכיטקטוניות (כגון תקיפות ספקולטיביות) ועוד. \nלקראת סוף הקורס מדברים על נושאים יותר אקזוטיים כמו reversing לחומרה, למידת מכונה על התקפות side channels ועוד. \n\nרוב ההרצאות ניתנות על ידי אבי והשאר על ידי ליאוניד. שניהם מאוד בקיאים בחומר(ה) - אבל קל לאבד אותם. מה שכן, הם מאוד נחמדים, ומאחר ומדובר בקורס 048*, הם אפילו נתנו את המספר טלפון שלהם במידה ונרצה להתייעץ איתם לגבי החומר / פרויקט. \n\nחשוב לציין - רוב ההרצאות כמעט ולא רלוונטיות להצלחה בקורס. יש סה\"כ 3 הרצאות שרלוונטיות ל-3 תרגילי הבית, ותכלס מספיק להבין אותן היטב בשביל להוציא ציון טוב בתרגילים. \n\nאגב, הסמסטר שלנו היה מוקלט, יכול להיות שיעלו לכם את ההקלטות. אין נוכחות חובה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nיש 3 תרגילים רטובים, כולם בפייתון וקצת C. כל תרגיל מהווה 10% מהציון הסופי. \nהראשון והשני עוסקים בהתקפות side channels על חומרה למימוש קריפטו, והשלישי עוסק ב-reversing לחומרה. \n\nאני חושב שאנחנו היינו המחזור הראשון שקיבל את התרגילים האלו, מאחר והיו לא מעט אי בהירויות במקרה הטוב, ודרישות לא פיזביליות במקרה הרע. \nכל תרגיל לקח לנו בממוצע 4 ימי עבודה מלאים, כאשר רוב הזמן מושקע בלהבין מהי דרישת התרגיל, וכיצד ניתן לעבוד עם הספריות / קוד משובש שסופק.  \nמה שכן - אבי וליאוניד עונים בשמחה ומהר על שאלות, והבדיקה של התרגילים מאוד הוגנת, וגמישים בתאריכים ההגשה. \n\nפרויקט:\nבסיום הקורס, יש לבצע פרויקט של 70% מהציון הסופי של הקורס, באופן שדומה לסמינר. הפרויקט מוגש בסיום תקופת המבחנים. \n\nאפשר לבחור אחד משני סוגי פרויקטים - מחקרי או פיתוחי. \nבמחקרי זה ממש כמו סמינר, צריך לקרוא 2~3 מאמרים מאותו תחום (לבחירתכם), לכתוב עליהם עבודת סיכום, ולהציע רעיון חדשני להרחבת המחקר (25% מהציון הסופי). \nהפרויקט הפיתוחי דורש לממש רעיון מתוך מאמר אחד לבחירתכם. \nבסיום הפרויקט, יש לבצע פרזנטציה במשך ~חצי שעה על מה שעשיתם. \n\nאישית בחרתי פרויקט מחקרי, נטו בגלל שהסיום שלו מובטח. בפרויקט פיתוחי צריך להציג בסוף \"מוצר\" שכתבתם. מהר מאוד זה יכול להתבדר, במידה ובחרתם מאמר קשוח מידי. \n\nהמבחן: אין! שמחה וששון. \n\nהשורה התחתונה: \n\nבגדול זה סמינר על סטרואידים. \nאותם דרישות כמו בסמינר שכולל פרויקט + פרזנטציה,  רק שבנוסף יש הרצאות + 3 תרגילים רטובים לא טריוויאליים. \nהציונים טובים והקורס סה\"כ מעניין. \n\nאם ממילא בא לכם להעמיק בנושא מסוים באבטחת חומרה, זה אחלה קורס לקחת, לעשות את הפרויקט שרציתם, ולקבל 2 נ\"ז על הדרך. \nאחרת, היחס השקעה - תמורה פשוט לא שווה את זה.", "timestamp": 1655532346565}]}