{"posts": [{"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: מעניינות ומעודכנות! לעיתים מעט בתצורת רשימת מכולת\n\nשם המתרגל/ת: קרן\nחוות דעת - תרגולים: עוברים על חלק מהחומר הנלמד בהרצאות אך לא במקום , בנויות מאוד דידקטי, לטוב ולרע.\n\nשעורי הבית: \nשבועיים , אך אינם דורשים מעבר לכשעתיים\nהמבחן: \nמצריך כ3 ימי למידה אם היית על החומר כל הסימסטר\nהשורה התחתונה: קורס מעניין וחשוב מאוד לכל מי שיש לו זיקה לתחום", "timestamp": 1628087316054}, {"author": "אבי", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: הרצאות נחמדות כי היא מביאה הרבה יישומים ודוגמאות\n\nשם המתרגל/ת: קרן\nחוות דעת - תרגולים:  לא ממש הבנתי את מטרת קונספט הסדנא, אם יש לי שאלות אבוא לשאול בשעת קבלה.\n\nשעורי הבית:  5 גיליוניות שלא דורשים הרבה השקעה\n\nהמבחן: הקשר בין המבחן לקורס מקרי, שאלות לא ברורות שלא ברור מה המטרה ומה צריך לעשות, התמקדות בחישובים מתמטיים על אך שהקורס מאוד יישומי.\n\n\nהשורה התחתונה: יש קורסי בחירה טובים יותר בפקולטה... לא מומלץ!", "timestamp": 1657622303244}, {"author": "XXXXXXXXXXXXX", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חבצלת \nחוות דעת - הרצאות: הרצאות מעניינות ומרתקות!\n\nשם המתרגל/ת: קרן דלמר\nחוות דעת - תרגולים: זה למעשה סדנה כזו שבה פותרים עצמאית תרגילים וקרן לפעמים מסבירה, וגם לפעמים לא - לגמרי תלוי במצב הרוח שלה באותו היום... \n\nשעורי הבית: מה שפותרים בסדנה צריך להגיש וזה הש\"ב בעצם.\n\nהמבחן: קשה, מאוד ספציפי- צריך לזכור דברים מאוד קטנים שחבצלת הזכירה בהרצאות, השאלות לא תמיד ברורות והן גם לא מסבירות בזמן המבחן את כוונת המשורר. המבחן לא כ\"כ הוגן לדעתי וצריך השקעה של לפחות שבוע מראש כדי להבין את הטריקים שהן משתילות בשאלות. \n\nהשורה התחתונה: לא מומלץ, יש קורסים שווים הרבה יותר ומעשירים, עם ציונים גבוהים הרבה יותר והרבה פחות השקעה.", "timestamp": 1657630925116}, {"author": "......................", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה:  חבצלת ביאנקו-פלד.\nחוות דעת - הרצאות: מעניינות ומרתקות. עדכניות מאוד.\n\nשם המתרגל/ת: קרן דלמר.\nחוות דעת - תרגולים: בעצם לא היו תרגולים. כל שבוע יש שני סרטונים קצרים מוקלטים של מקסימום רבע שעה כל אחד. צריך לצפות אותם וללכת לסדנה שבה פותרים את שיעורי הבית בנוכחות המתרגלת. היא מסתובבת ועונה על שאלות. מבחינתי הסדנאות היו מיותרות, הן סוג של שעת קבלה.\n\nשעורי הבית: קלילים. יש בערך 5 שיעורי בית. \n\nהמבחן: לא היה מבחן ברמה המצופה. לא ברמה של השנים שעברו. היא שאלה על דברים קטנים שהזכירה בהרצאות פעם אחת. הקורס הוא קורס שרובו תאורטי אך המבחן דורש הרבה חישובים ושימוש בנוסחאות שצריך להתאמן עליהן לפחות 3 ימים שלמים.\n\nהשורה התחתונה: הקורס מעניין אך לפי דעתי הבחינה לא הייתה הוגנת. יש קורסי בחירה פקולטיים טובים יותר שדורשים פחות השקעה.", "timestamp": 1657782996243}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חבצלת ביאנקו-פלד\nחוות דעת - הרצאות: משעממות מתעסקת בדברים שלא רלוונטיים לבחינה\n\nשם המתרגל/ת: קרן דלמר\nחוות דעת - תרגולים: תרגולים מיותרים ברמות כל קשר ביניהם לבין הקורס או הבחינה מקריים בהחלט\n\nשעורי הבית: קלילים לא דורשים יותר מידי מאמץ\n\nהמבחן: מנותק מהמציאות. חבצלת החליטה להיות שטן ולתת מבחן מזעזע לא ברור מה הסיבה. התמקדה בדברים ספציפיים ולא חשובים מהקורס. הקורס הוא קורס תיאורטי אבל בפועל יש המון חישובים ושימוש בנוסחאות שלא תמיד ברור מאיפה הגיעו.\n\nהשורה התחתונה: קורס מאוד לא מומלץץץץץץ. הבחינה לא הייתה הוגנת זה הרגיש כמו לוטו", "timestamp": 1657816061665}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חבצלת ביאנקו-פלד\nחוות דעת - הרצאות: הרצאות מעניינות שמלמדות גם את התאוריה והכלים החישוביים וגם מציגות דוגמאות מהתעשייה והאקדמיה עם דגש על הפן הביולוגי/הביוטכנולוגי- בשונה מקורסי בחירה רבים בפקולטה. החומר של הקורס מעניין ורלוונטי, בהרצאות יש חובת נוכחות. \n\nשם המתרגל/ת: קרן \nחוות דעת - תרגולים: תרגולים בפורמט של 5 סדנאות לאורך הסמסטר שבמהלכן פותרים את \"שיעורי הבית\" והדד ליין להגשה יום למחרת הסדנה. כבר מהסדנה הראשונה פותרים תרגילים ממבחני עבר, פורמט הסדנה מאפשר לפתור תוך הכוונה והסברים מהמתרגלת של הקורס (אין חובת נוכחות ואפשר לפתור גם בבית), צורה שבעיני מסייעת להבנת החומר. קרן ענתה לשאלות באופן מפורט גם מחוץ לשעות הסדנה ולקראת המבחן בפרט. \n\nשעורי הבית: 5 הגשות במהלך הסמסטר בזוגות, פותרים בסדנאות שהם על שעות התרגול במערכת. \n\nהמבחן: מבחן שדומה בסגנון השאלות שלו למבחני עבר, למידה במהלך הסמסטר בהרצאות והסדנאות+ למידה של 4 ימים לפני הבחינה (פיתרון מבחני עבר) ואין הפתעות\n\nהשורה התחתונה: קורס שבעיני מאוד רלוונטי לסטודנטים להנדסה ביוכימית, נוגע בפן הביוטכנולוגי של התואר בשונה מקורסי בחירה רבים אחרים, לא מעמיס ומבחן הוגן.", "timestamp": 1684263203766}]}