{"posts": [{"author": "מאי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: מועילות עד גבול מסוים בו אתה מאבד את המרצה והוא כולו מבסוט עונה על השאלות של עצמו\n\nשם המתרגל/ת: אסיה מתתיהו\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: אין\n\nהמבחן: קשה! דורש למידה של יותר משבוע\n\nהשורה התחתונה: קורס קשה. תתכוננו טוב!", "timestamp": 1613849634267}, {"author": "X", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל לוין\nחוות דעת - הרצאות: לפעמים ברורות ולפעמים בכלל לא. פיתוחים מתמטיים מיותרים. התרגולים מסבירים בסוף הכל\n\nשם המתרגל/ת: אסף ואסיה\nחוות דעת - תרגולים: מתרגלים מעולים שמסבירים מאוד ברור את החומר שיכול להיראות מסובך וכבד בהתחלה \n\nשעורי הבית: פותרים ש.ב במהלך התרגול ויש לקראת הסוף מטלות יחסית קצרות \n\nהמבחן: לא קל אבל עם מפסיק חזרה טובה על החומר וללמוד ממבחני עבר אפשר לקבל ציון טוב\n\nהשורה התחתונה: הקורס בהתחלה לא מובן ומבלבל כי שום נושא לא נראה קשור אחד לשני, אבל בסוף הסמסטר הכל מסתדר אז לא להילחץ שלא ברור בהתחלה", "timestamp": 1647277708714}, {"author": "XAEA -12", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: לא מובנות ועמוסות מאוד, ההרצאות מועברות במתכונת של \"כיתה הפוכה\", צופים בסרטונים בבית משהו כשעתיים, ויש גם עוד הרצאה פרונטלית של שעתיים באותו נושא בה אתם שואלים את המרצה מה לא מובן והוא חוזר על דברים בסיסיים - אני אישית ראיתי ששניהם אותו דבר...\n\nשם המתרגל/ת: אסיה + אסף\nחוות דעת - תרגולים: מובנים וחשובים מאוד, המתרגלים מאוד עוזרים וחמודים\n\nשעורי הבית: אין חובה, אך פותרים בסוף כל תרגול גיליון בזמן התרגול\n\nהמבחן: לא פשוט בכלל! דורש למידה של לפחות שבוע למי שהיה על החומר כל הזמן, וצריך לפתור הרבה מבחנים משנים קודמות, מומלץ כמה שיותר כי יש המון דברים שתתקלו בהם רק בפתיתרת המבחנים, דברים שלא פגשתם לא בתרגולים, לא בהרצאות ולא בשיעורי הבית (או שיטות מחשבה). מי שלא היה על החומר כל הסמסטר ולא עבד מספיק ב-MATLAB לא מומלץ לגשת למועד א. תלמדו טוב!!\n\nהשורה התחתונה: קורס לא פשוט בכלל, בהתחלה נראה לא מובן, ולא תדעו למה אתם לומדים כל הנושאים המורכבים האלה, אך הקורס בנוי בצורת פירמידה, כל חומר חדש מתבסס על החומר שהיה לפני, ולכן תהיו במעקב עם החומר, ותשאלו כל מה שלא מובן, תקדישו זמן לעבור על התרגולים ושיעורי הבית, ועם למידה טובה למבחן יהיה בסדר... בהצלחה!", "timestamp": 1657552445520}, {"author": "XXXXXXXXXXXXX", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: הרצאות במתכונת כיתה הפוכה. \nכדאי ללכת ולהחכים, להבין כמה שיותר.. בתרגולים החומר הופך לברור יותר. דני מתרגל בזמן ההרצאות דוגמאות לשאלות ממבחנים וזה גם מסייע להבין את החומר יותר. \n\nשם המתרגל/ת: ספיר רפפורט ואסיה מתתיהו\nחוות דעת - תרגולים: מתרגלות מצוינות! לא בגדר המלצה אלא בגדר חובה ללכת לתרגולים שלהן. \n\nשעורי הבית: לא חובה, פותרים בתרגולים בקבוצות ונעזרים במתרגלים ובמרצה. מאוד מלמדים ועוזרים להבין את החומר.\n\nהמבחן: מבחן קשה יחסית. אבל עם למידה מספיק טובה טרם המבחן, פתירת מבחנים והתמדה לאורך הסמסטר - ניתן להצליח היטב. \n\nהשורה התחתונה: קורס קשה, אך מלמד. תחילה לא מובן כלל, בשיא הסמסטר מסתבך ונהיה לא ברור עוד יותר. אך לבסוף - הדובדבן שבקצפת פורץ החוצה, הכל מובן והוא הופך להיות הקורס הכי מהנה שיש ושהיה אי פעם בפקולטה. להיעזר כמה שיותר בסגל הקורס, הוא מאוד נכון לסייע בכל שצריך.", "timestamp": 1676795114816}, {"author": "סטודנטית להנדסה כימית", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לוסי ליברמן\nחוות דעת - הרצאות: לא הלכתי להרצאות, אבל ממה ששמעתי מסטודנטים שכם הלכו היא מקסימה ומסבירה טוב מאוד . \n\nשם המתרגל/ת: ספיר רפפורט, ספיר סימון, אסיה מתתיהו . \nחוות דעת - תרגולים: המתרגלות הכי טובות בפקולטה בלי הגזמה! הן יודעות את החומר טוב מאוד ויודעות מה בכללי חולשות הסטודנטים כך שהן מסבירות את החומר בצורה הכי ברורה למרות הקושי . לפני המבחן (שבוע פסח) הן היו זמינות כל הזמן לשאלות במייל וגם בפורום במודל ונתנו תשובות מעמיקות עם מלא השקעה! ההסבר שלהן היה מספיק בשבילי כדי להבין את החומר מבלי ללכת להרצאות . \n\nשעורי הבית: היו שלושה תרגילי בית שהצריכו עבודה במטלאב וסימולינק, חשוב לפתור אותן כדי להגיע מוכנים לשאלת מטלאב במבחן. דורשות השקעה . \n\nהמבחן: הוגן . לא ראיתי משהו חדש שלא היה במבחנים הקודמים של דניאל לוין . \n\nהשורה התחתונה: קורס קשה ומאתגר, חשוב ללכת לתרגולים ולהיעזר במתרגלות ככל האפשר . ללמוד טוב למבחן ולפתור כמה שיותר מבחנים כי המבחן הוא תכלס לרוב טכני .", "timestamp": 1714837928338}]}