{"posts": [{"author": "///", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עופר מנור\nחוות דעת - הרצאות: בזבוז זמן מוחלט. עופר פשוט מבולגן, מדבר איזה שעתיים על איזה 5 עמודים, מה  שלבד לקח לי 25 דקות לקרוא ולהבין יותר טוב.\n\nשם המתרגל/ת: עומר אדיר ואביטל\nחוות דעת - תרגולים: לי היה דיי קשה עם עומר, לדעתי הוא לא ככ מוצלח, הוא מבין טוב את החומר אבל ההסברים שלו על הקודים לא לטעמי, לעומת זאת אביטל מסבירה את הקודים יותר טוב, בסופו של יום עבדתי עם סרטונים של שניהם (סמסטר קורונה וזה)\n\nשעורי הבית: חרטא, בזבוז זמן לא באמת עזר משהו\n\nהמבחן: עכשיו זה הזמן לעבור על השיעורי בית ולהזכר בכל השיטות השונות. אין כ\"כ מבחנים משנים שעברו\n\nהשורה התחתונה: זה מה שיש, קורס חובה, אבל בסוף הציונים בסדר", "timestamp": 1597985078203}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אולס\nחוות דעת - תרגולים: המתרגל האולטימטיבי\n\nשעורי הבית: שבועיים ברובם מרופרנסים\n\nהמבחן: דורש רמה טכנית גבוהה והרבה עבודה שחורה\n\nהשורה התחתונה: קורס חשוב אך נראה שלפעמים אין מחשבה מאחורי עבודה שחורה מיותרת", "timestamp": 1628086779690}, {"author": "L", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: \nלפני ההרצאה הפרונטלית היה צריך לראות את ההרצאות בנושא של אותו שבוע אבל מוקלטות מלפני עשור עם איכות לא משהו ולענות על שאלות במודל תוך כדי. עקבו אחרינו כמו באח הגדול ושלחו מיילים כועסים למי שלא ראה אותם לפני ההרצאה אבל היה לזה רכיב בציון הסופי. רוב ההבנה של החומר הייתה מההקלטות ובהרצאות הפרונטליות הוא חזר על חלק מהחומר של אותו שבוע ופתר שאלות ממבחנים.\nשם המתרגל/ת: אסף וספיר \nחוות דעת - תרגולים: \nכל התרגולים היו בזום. היו מעין סיכום של נושא של השבוע והראו כמה שאלות. לקח משהו כמו שעה. אחרי זה התחלקנו לחדרים בזום ונתנו לנו לפתור שאלות לבד והם היו זמינים לשאלות. דווקא שם היה הלימוד הכי חזק שבאמת יש אפשרות להתמודד לבד עם שאלות למרות שהיה פתרון תוך כדי שאפשר להשוות איתו.\nשעורי הבית: \nלא היו. רק לראות את ההרצאות המוקלטות לפני הפרונטליות.\nהמבחן: \nשלוש שעות, 4 שאלות ואחת מהן הייתה שאלת תכנות במטלב.\nהמבחן היה סביר למי שידע טוב את חומר והיה עם חומר פתוח.\nהשורה התחתונה: \nלהביא שני מחשבונים לפחות וללמוד איך לעבוד איתם במהלך הסמסטר.", "timestamp": 1657983233704}, {"author": "נדב דויטש", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: בתכלס זה כבר לא רולוונטי כי הוא ילמד יותר. עושה הרצאות במתכונת של כיתה הפוכה, בבית רואים הקלטות ישנות של הרצאות שלו ובכיתה הוא חוזר על חומר חשוב מההרצאות ופותר תרגילים. בפועל לא כל כך עבד לו. רוב הסמסטר זה הרגיש כאילו הוא פשוט עושה את אותה הרצאה שראינו בבית שוב בכיתה.\n\nשם המתרגל/ת: ספיר ואסף\nחוות דעת - תרגולים: כוללים משהו כמו חצי שעה הסבר וחזרה על חומר מהרצאת השבוע ושאר הזמן פותרים תרגילי בית כשהמתרגלים עוברים בין הסטודנטים. תירגולים בזום\n\nשעורי הבית: אין תרגילי בית, צריך לראות את ההרצאות המוקלטות ולענות על שאלות ממש קלות תוך כידי הצפייה לפני כל הרצאה\n\nהמבחן: 4 שאלות. שלוש שאלות בפתרונות נומריים לבעיות ושאלה אחת של יישום פתרון נומרי במטלאב. דני בודק את מבחנים בצורה מאוד ישירה: אם התשובה הסופית טובה מקבלים את רוב הנקודות על התרגיל, גם אם יש טעויות חישוב קטנות, אם התשובה הסופית לא טובה אז הוא בודק לעומק. את שאלת המטלאב דני בודק בצורה מאוד שטחית. אם בתשובה יש שימוש או נסיון לשימוש בשיטה שדומה לפתרון אז מקבלים את רוב הנקודות, אם דרך הפתרון שונה מאוד ממה שדני רצה אז לרוב מקבלים 0 או מעט מאוד נקודות\n\nהשורה התחתונה:אני חושב שבסופו של דבר הציונים סבבה גם אם לאורך הדרך רוב הסטודנטים לא היו מרוצים מהתנהלות הקורס", "timestamp": 1659420506183}]}