{"posts": [{"author": "-:)", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: שאדי פראח\nחוות דעת - הרצאות: ההרצאות היו מוקלטות מראש והרגשתי שהיה מאוד מיותר ולא מלמד בכלל. ברוב ההרצאות שאדי הראה סרטונים מהיוטיוב, שלא ממש הבנתי מה הם אמורים ללמד - יותר הרגשתי כמו בסרט קולנוע מאוד מרדים ומתיש. בשלב מסוים הפסקתי ללכת, כי הבנתי שמכל הרצאה שעוברת, זה רק הופך ונהיה יותר ויותר בדיחה. \n\nשם המתרגל/ת: נטע קוטנר \nחוות דעת - תרגולים: בסך הכל מתרגלת טובה. היא מסבירה את החומר ועוברת עליו, היא כותבת הכל על הלוח בצורה מסודרת. לעיתים קצת קרה וחסרת סבלנות כששולחים לה שאלות במייל בנושא שיעורי הבית (ממה שאני חוויתי), אבל בסה\"כ סבירה. \n\nשעורי הבית: יש. הם מהווים 30% מהציון הסופי ולכן כדאי ורצוי להשקיע בהם ולהקדיש להם את תשומת הלב. נטע בכל גיליון השתילה שאלות חדשות, שלא היו בשנים קודמות והפכה את זה למאתגר יותר. אבל אפשר להתמודד... \nמורידים על כל פיפס הכי קטן, לכן לא לחסוך ולא לקצר. \n\nהמבחן: אין. יש פרויקט סופי, מאוד מתיש, ולא מאוד ברור מה שאדי מצפה בו. הם נתנו פולימר כלשהו והיה צריך להכין עליו עבודה. היה מאוד משעמם, מתיש, ארוך מאוד, מייגע, לא מועיל ולא מלמד בשום צורה בעליל. המתכונת הזו הייתה בזום כך שכל קבוצה הציגה פולימר אחר, אולם אני אישית לא למדתי על שום פולימר משום קבוצה והכל היה מאוד כללי ומאוד משעמם. \n\nהשורה התחתונה: לא הייתי ממליץ עליו כי לא למדתי ממנו כמעט כלום בכל הקשור לפולימרים. יותר דברים טכניים ששכחתי לגמרי. אפשר לקבל ציון מאוד גבוה, אבל זה אחרי הרבה מאוד השקעה וסבל, ואת האמת שבכימיה אורגנית לא הייתי צריך להשקיע את אותן השעות שנתתי לקורס הזה.", "timestamp": 1631701932156}, {"author": "זיגלר נטע", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פרופ שאדי פרח\nחוות דעת - הרצאות: \nשאדי מרצה די משעמם, החומר לא מאוד מורכב אבל ההרצאות מאוד מייגעות איתו ולולא ההקלטות זה היה מאוד קשה להקשיב, במבחן דאג לתפוס על הנקודות הכי קטנות ועל דברים שדיבר עליהם בכמה מילים בהרצאה. \nשם המתרגל/ת: נטע קוטנר\nחוות דעת - תרגולים: \nמתרגלת מרושעת, למזלנו מסיימת הסמסטר תואר ולכן סיימה לתרגל, עונה בצורה מאוד לא מפורטת ומזלזלת, מיילים ממנה מאוד עוקצניים וחסרי הבנה, גם בתרגולים ובמבחן דאגה לעקוץ ולתת תחושה רעה ובתרגילי הבית היא הורידה המון נקודות על שטויות קטנות. חד''מ הפכה את החוויה של הקורס להרבה הרבה פחות נעימה.\nשעורי הבית: \nלא מאוד קשים אבל הניקוד קטנוני ביותר ואפילו טעות הכי קטנה גוררת הורדה רבה של נקודות.\nהמבחן: \nארוך מאוד, \"אמריקאי\" אבל כשצריך להסביר את התשובה שבחרת ולמה האחרות לא נכונות! תשובה נכונה לא מלאה מזכה רק בחלק מהנק'.\nחלק נוסף עם שאלה פתוחה בעלת מס' רב של סעיפים.\nניתנו בהתחלה שעתיים והתווספה חצי שעה מאחר ואף אחד לא הגיע אפילו לחלק ב'.\nבנוסף היה פרוייקט מאוד כבד שהיה צריך לעשות על פולימר ולבנות מצגת ברמה מאוד גבוהה ולבסוף להרצות עליו (עד 10 דק' כל אחד גג!) לאחר הפרויקט נשאלו שאלות מתקילות ע''י המרצה, הפרוייקט היה עמוס מאוד ודרש לא מעט זמן וכוח.\nהשורה התחתונה: \nקורס מאוד מעניין בקונספט אבל המבנה שלו והסגל הרסו אותו לחלוטין, דרישות מאוד כבדות ביחס לכולה 2.5 נק''ז, הייתי חושב פעמיים אם לקחת אותו.", "timestamp": 1647001776571}, {"author": "KM", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שאדי פרח\nחוות דעת - הרצאות: אין דגש על הפן ההנדסי בפולימרים, המון דגש על הכימיה. ההרצאות הועברו בצורה לא מעניינת מיוחד\n\nשם המתרגל/ת: נטע קוטנר\nחוות דעת - תרגולים: מתרגלת לא סבלנית כלפי הסטודנטים. מזלזלת בתשובות הסטודנטים בזמן התרגול.\n\nשעורי הבית: לא קשים במיוחד, נטע מורידה המון ניקוד על כל טעות חישוב מינורית.\n\nהמבחן: שאלות אמריקאיות שנדרש לתת הסבר + שאלות פתוחות\n\nהשורה התחתונה: באתי ללמוד על פולימרים ויצאתי מאוכזב. קורס בחירה נוראי. בנוסף למבחן ולשיעורי הבית, חובה להציג מצגת על שני פולימרים בתחום שנבחר עבור כל קבוצה. מצגת שדורשת הרבה עבודה, מס' הנקודות לא שווה את ההשקעה. לא מומלץ!", "timestamp": 1654965342040}, {"author": "אחר", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שאדי פרח\nחוות דעת - הרצאות: הרצאות משעממות ומזעזעות. המרצה מעביר את החומר בצורה מונוטונית וחסרת עניין.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נדמה שהמתרגל פשוט מקריא תשובות לתרגילים מתוך המחברת שלו, מבלי להסביר אותן יותר מדיי.\n\nשעורי הבית:\n\nהמבחן: \n\nהשורה התחתונה: לברוח. קורס לא מומלץ בכלל.", "timestamp": 1708375975784}, {"author": "סטודנטית להנדסה כימית", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שאדי פרח\nחוות דעת - הרצאות: לא היו הרצאות פרונטליות במהלך הסמסטר, העלו הקלטות משנים קודמות (אישית לא עזרו לי). \n\nשם המתרגל/ת: עיד מרגיה\nחוות דעת - תרגולים: תרגולים הם בסדר . העלו הקלטות גם מהסמסטר הזה וגם משנים קודמות שזה היה מאוד טוב ועוזר.\n\nשעורי הבית: היו שיעורי בית שבועיים שרובם מייגעים אבל רוב השאלות ממוחזרות כך שניתן תכלס לפתור אותם. היו גם כן מבדקים אחרי כמעט כל הרצאה, היו הרבה פעמים שלא הבנתי מה הם רוצים ממני בכלל וקשה לחפש ולמצוא תשובות בהרצאות. לדעתי היו הרבה מדי תרגילי בית והגשות במהלך הסמסטר בשביל קורס בחירה. וחשוב לציין שלא בודקים שום הגשה במהלך הסמסטר כך שאף פעם לא ידענו אם אנחנו פותרים בסדר או לא . \n\nהמבחן: אין . יש פרויקט קבוצתי של מצגת ועבודה כתובה על פולימרים ביישום מסוים שצוות הקורס בוחר עבורכם (כל סטודנט בקבוצה אמור להציג על פולימר אחד). דורש הרבה השקעה. שאדי בסוף ההצגה שואל הרבה שאלות תיאורטיות על המצגת כך שחייבים לבוא לא פחות ממוכנים+++ .\n\nהשורה התחתונה: חומר הקורס חשוב ושימושי מאוד גם לעבודה בתעשייה וגם להמשך לתארים מתקדמים, כך שלדעתי חייבים לקחת לפחות קורס אחד על פולימרים במהלך הלימודים, אבל אם אפשר לקחת קורס אחר שיותר מסודר מפולימרים 1 אז יותר עדיף .  תכלס חומר חשוב ושימושי, ציונים יחסית טובים אך דורש הרבה מאוד השקעה .", "timestamp": 1714837378666}]}