{"posts": [{"author": "רבקה שלמה", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה:  חבצלת ביאנקו פלד\nחוות דעת - הרצאות: מעניין מאד\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: קורס נחמד מאד לסמסטר א", "timestamp": 1602959506491}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "201801", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: נותן אינטרו נחמד על מה זה הנדסה כימית בכלל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: מומלץ כי למה לא? 1 נקז בחינם", "timestamp": 1624806139482}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "השורה התחתונה: קורס שמסביר קצת על התואר ועל מה עושים איתו אחר כך. נחמד ממש, נקז בחינם, צריך רק להגיע ולכתוב משוב אחרי כל הרצאה", "timestamp": 1645996987795}, {"author": "דבורית", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: משתנה. מרצה אחראית: חבלצת \nחוות דעת - הרצאות: רוב ההרצאות לא התאימו לסטודנטים סמסטר ראשון, היו הרצאות שישבנו ולא הבנו מילה. מטרת ההרצאות הייתה להציג לנו את אפשרויות התעסוקה בתחום, בעיניי זה היה מוקדם מידי ולא רלוונטי. מצד שני, נקז חינם, נטו לבוא לשבת ולשמוע 50 דקות הרצאה. \n\n\nשעורי הבית:  בסיום כל הרצאה נפתח משוב ל24 שעות שצריך למלא, זה ממש שטויות אבל הבעיה שצריך לזכור לעשות את זה, לפעמים בלחץ של סמסטר זה יכול להתפספס. \n\nהמבחן: אין \n\nהשורה התחתונה: קורס לא מתאים לסטודנטים סמסטר ראשון אבל נקז מתנה אז למה לא.", "timestamp": 1676972610402}, {"author": "Razan", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "חבצלת\nחוות דעת - הרצאות: בהרצאות מביאים לנו אנשי מקצוע שירצו לנו על התחום מהם הם באים וכולם בוגרי הפקולטה (כימית וביוכימית) מן הסתם שיש הרצאות יותר מעניינות והרצאות פחות מעניינות אבל בסה״כ היה חמוד\n\nשם המתרגל/ת: לא רלוונטי\nשעורי הבית: יש משוב שצריך לעשות אחרי כל הרצאה והוא פתוח רק ל 24 זה קצת מעצבן אבל פשוט שמים שעון כל שבוע , במידה ושכחתם אתם יכולים לדבר על חבצלת והיא תפתחו לכם אותו לעוד 24 שעות - אל תגזימו בזה כמובן.\n\nהמבחן: אין , פשוט צריך להגיע לכל ההרצאות - אני פספסתי אחת וקיבלתי עובר\n\nהשורה התחתונה: קורס ממש קליל ונותן נקודת זכות במתנה הוא רק שעה בשבוע ולא דורש מאמצים - תקחו אותו כך גם תכירו יותר מי איתכם באותה פקולטה.", "timestamp": 1679690748851}, {"author": "change2000", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  חבצלת\nחוות דעת - הרצאות: \nחלק מעניינות יותר חלק פחות סך הכל אחלה קורס נקז בחינם מומלץ מאוד רק לזכור למלא חוות דעת בסוף כל הרצאה זה פתוח רק ל24 שעות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nחוות דעת בקצרה מאוד רק צריך לזכור לעשות שזה קצת מעצבן\nהמבחן: \nאין\nהשורה התחתונה: נקז חינם תיקחו", "timestamp": 1713710433468}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: לפעמים מעניינות לפעמים לא\nנוכחות הכרחית, לפעמים היא בודקת מי עושה נוכחות ויוצא, וזה גורר לועדת משמעת :(\n\nשעורי הבית: 10 דקות מקסימום", "timestamp": 1716229895598}]}