{"posts": [{"author": "Lir", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יועד צור \nחוות דעת - הרצאות: בסמסטר קורונה דרש מאיתנו גם לצפות בוידאו מוכן מלפני כמה שנים וגם להיות נוכחים בהרצאות זום שלא הוסיפו בכלום. מרצה לא גמיש בכלל, עקשן במידה לא סבירה, א אפשר לשכנע אותו בכלום גם אם כולם יגידו לו. יחסית משעמם ומדבר לאט, לפחות החומר מעניין.\n\nשם המתרגל/ת: אין ספציפי, היו לנו תרגולים מוקלטים מראש שבהם כל המתרגלים השתתפו.\nחוות דעת - תרגולים: קצרים מאוד (כ30 דקות לתרגול) ומאוד חדים ולעניין. עוזרים מאוד להבין את החומר כי בהרצאות קשה(בעיקר בהתחלה) להבין מה רוצים ממך תכלס. \n\nשעורי הבית: כדאי להשקיע ולפתור לבד או להעזר ברפרנס אבל להבין. יוצא ת\"ב פעם בשבוע.\n\nהמבחן: היה מזעזע באופן בלתי רגיל. היה לנו חומר פתוח שלא עזר בכלום כי זה היה הרבה יותר מתמטי מאשר מבחן בתרמודינמיקה, בניגוד מוחלט למבחנים מאוד סבירים והוגנים שהיו בשנים הקודמות (שהיו פרונטלים- ללא חומר פתוח).  היה חסר זמן, הרבה לא הספיקו/ הבינו ונכשלו. \n\nהשורה התחתונה: כדאי להשקיע במעבדותשעושים בקורס- יכול  להרים את הציון לציון מעולה, כמו גם בשיעורי בית וגם בנוכחות (יש ציון גם על זה אצל יועד). כל אלו הבטיחו אצלנו 35 אחוז מהציון.", "timestamp": 1597742607527}, {"author": "Nir Abramovich", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יועד צור\nחוות דעת - הרצאות: בסמסטר קורונה ראינו סרטוני הרצאות מלפני כמה שנים. החומר מעניין אך בסרטונים יועד הרבה פעמים גולש לדברים אחרים וצריך להבין את האוצר המילים שהוא משתמש בו בהתחלה. חשוב להבין את התיאוריה כי זה עוזר בפתירת התרגילים\n\nשם המתרגל/ת: אין אחד ספציפי. המתרגלים מאוד נחמדים ומסבירים טוב את החומר וזמינים.\nחוות דעת - תרגולים:  היו תרגולים של 30 דקות שהיו ישר ולעניין אבל זה היה מאתגר לחוות ככה תרגולים בלי יחס אישי ושאלות זה רק לשעת קבלה ולא במהלך התרגול\n\nשעורי הבית: קשים. רוב השאלות הם שאלות ממבחנים משנים קודמות ככה שהכי מומלץ לנסות לפתור אותם לבד. יועד מאוד יצירתי בשאלות שלו ולפעמים עושה פיתוחים מתמטיים כדי להתקדם בפתירת השאלה. \n\nהמבחן: קשה. אין איך לנסח את זה בעדינות יותר. יש חלק של שאלות תיאוריה ויש חלק של שאלות חישוביות. יועד טוען שמי שמבין תרמודינמיקה יוכל לפתור את המבחן וזה נכון באיזשהו מקום. הוא דורש חשיבה מחוץ לקופסא במבחנים שלו ופיתוח משוואות. בלי הפיתוחים האלה החישובים די קלים וככה הוא מעלה את הרמה.\n\nהשורה התחתונה: קורס ששווה השקעה וחומר מעניין, להשקיע בש''ב כי זאת הכנה למבחן. זה בין המבחנים הכי קשים שחוויתי עד כה בתואר. להשקיע במעבדות כי זה יכול לעלות ציון סופי", "timestamp": 1598268822673}, {"author": "רז בוזגלו", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יועד צור \nחוות דעת - הרצאות: מאוד חופרות שבשלב כלשהו כבר הפסקתי ללכת. עדיף לקרוא לבד את המצגת, זה מספיק.\n\nשם המתרגל/ת: רינת עטיאס \nחוות דעת - תרגולים: מתרגלת מעולה ! מסבירה היטב את הצעדים לפיתרון, מסכמת את החומר באופן כללי ואת הנושאים. נותנת דגשים חשובים בכל שאלה. \n\nשעורי הבית: יש, הם רק 10% מהציון. כדאי להשקיע בהם. הם מאוד מלמדים. \n\nהמבחן: מאוד הוגן. אבל כן צריך להשקיע ולא לדלג על שום נושא ולהשאיר חורים כי יועד יכול להפתיע בכל דבר במבחן והוא לא צפוי במיוחד, אבל מי שמבין את החומר פותר בצ'יק. \n\nהשורה התחתונה: קורס סבבה, מעניין מאוד. אפשר לקבל ציון גבוה מאוד - צריך להשקיע.", "timestamp": 1631700311337}, {"author": "עדן", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יועד\nחוות דעת - הרצאות: הרצאות מיותרות, יש סיכום להכל. יועד לא אנושי! צורת דיבור מזלזלת. קורס מגעיל בקיצור אבל אין ברירה.\n\nשם המתרגל/ת: רינת\nחוות דעת - תרגולים: רינת מאוד חמודה, מבינה עד כמה הקורס הזה סיוט ומנסה לבוא לקראת הסטודנטים. מומלצת ממש\n\nשעורי הבית: איום ונורא אך יש במבחן שאלה מהם אז הם חשובים למרות שהם מזעזעים.\n\nהמבחן: יועד מזעזעעעעעעע.\n\nהשורה התחתונה:", "timestamp": 1680176831677}, {"author": "מכונת קרנו", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דן מנדלס\nחוות דעת - הרצאות: \nמאד השתדל, אבל לא הגעתי בערך מהרצאה 3. במהלך הסמסטר הסתדרתי טוב עם החומר רק עם התרגולים, אבל במבחן זה התנקם בי שלא הגעתי להרצאות. מאד היה לי קשה לעקוב אחריו, קצת יותר שמחת חיים וכריזמה הייתה מסייעת. \n\nשם המתרגל/ת: רינת\nחוות דעת - תרגולים: אני מאד אוהב את רינת, בעיניי מסבירה ברור ווממוקדת. אני מוצא את זה טוב, כי בסוף בתרגולים אנחנו אמורים לדעת לפתור תרגילים ולא להבין את כל התיאוריה מאחורי התרמודינמיקה. אז עצם זה שהיא הייתה ממוקדת וזמינה בשעות קבלה עזר לי מאד. \n\nשעורי הבית: מעצבן קצת שכל שבוע יוצא גיליון, אבל בסך הכל אפשר להסתדר איתם. כדאי מאד לא לרפרנס יותר מדי, אבל הכל קיים שם והכל אפשר לרפרנס, אם נתקעים ומבזבזים יותר מדי זמן\n\nהמבחן: don't\n\nהשורה התחתונה: קורס חובה אז אין ממש ברירה. במהלך הסמסטר הרגיש בסדר אבל המבחן היה נוראי. בדיעבד הייתי מגיע להרצאות, רק בשביל לקבל איזה מושג לגבי מה הולך להיות במבחן.", "timestamp": 1715018513811}, {"author": "שלגייה", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דן מנדלס\nחוות דעת - הרצאות: חייב ללכת להרצאות, יש שאלות במבחן שרק מי שהיה בהרצאות ידע אותן. דן עצמו ממש חמוד והוא שמח לענות על כל שאלה בנועם וסבלנות, אבל קצת חסר כריזמה, אז קשה להקשיב לו.\n\nשם המתרגל/ת: רינת\nחוות דעת - תרגולים: מתרגלת מדהימה! מאוד מקצועית ורלוונטית לקורס. זמינה לשעות קבלה ושאלות תמיד.\n\nשעורי הבית: \nחייב לעשות אותם! הם תרגול מעולה, עוזרים להיות על זה במהלך הסמסטר והם הכנה מצויינת למבחן. הם קשים מאוד כי הרבה פעמים מביאים שאלות ממבחנים בשיעורי בית, אבל חשוב לעשות.\n\nהמבחן: 2 חלקים. חלק א' 2 שאלות פתוחות. חלק ב' 8 סעיפים של אמרקאי שצריך לנמק. במבחן של דן היו 2 שאלות במבחן משיעורי הבית!\n\nהשורה התחתונה: קורס מעניין, אפשר להוציא בו ציון ממש יפה אם משקיעים לאורך הסמסטר", "timestamp": 1715324128574}, {"author": "גאוס", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דן מנדלס\nחוות דעת - הרצאות: לא הייתי \n\nשם המתרגל/ת: רינת \nחוות דעת - תרגולים: אלופה , רינת מתרגלת ממש מעולה , מסבירה טוב את החומר ומלמדת בצורה מאוד ברורה כך שמבינים ממש איך פותרים את השאלות , אווירה כיפית בתרגולים , אחלה של מתרגלת אין עליה בעולם ממש אחת המתרגלות הכי מדהימות שעברו עלי עד עכשיו \n\nשעורי הבית: סבבה \n\nהמבחן: \nסביר \nהשורה התחתונה: קורס אחלה", "timestamp": 1717756325536}]}