{"posts": [{"author": "Lir", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אלכס לישנסקי\nחוות דעת - הרצאות: בקורונה ההרצאות הועברו בצורה של מצגת מדובבת. לדעתי זה קלי מאוד יעיל ונוח. אלכס ממש אוהב פיתוחים אבל שתדעו שמבחינתכם זו העשרה- לא צריך לדעת לפתח את הנוסחאות שהוא מראה- רק להבין מאיפה הכל בא.\nמצאתי את ההרצאות מאוד מעניינות.\n\nשם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: מוקלטים. טובים לדעתי, שימו לב שבתרגולים שלו יש לו כמה טעויות שלפעמים הוא מתקן בוידאו של ההרצאה הבאה (הוא נוטה להתבלבל ולטעות המון). מצד שני הוא מסביר טוב ופרקטי.\n\nשעורי הבית: כדאי להשקיע ואשכרה לפתור לבד. יוצא ת\"ב פעם בשבוע.\n\nהמבחן: הוגן, אבל לא פשוט אישית הבעיה אצלי היתה זמנים למרות שיש לי הארכת זמן, הפתרונות הם ארוכים ולקח לי זמן להגיע לתשובה. הבנתי שאני לא היחידה ולכן ממליצה לעבוד לפני המבחן על לפתור כמה שיולר במסגרת הזמן שיש להקציב לשאלה.\n\nהשורה התחתונה: קורס ממש ממש מעניין. הכי אהבתי אותו, למרות שהוא לא קליל וצריך להשקיע בו זמן.", "timestamp": 1597743387366}, {"author": "kfir4444", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אלכס לישינסקי\nחוות דעת - הרצאות: שווה לעקוב אחרי המתמטיקה למרות הקושי\n\nשם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: פייר\n\nהשורה התחתונה:", "timestamp": 1602613523047}, {"author": "נדב דויטש", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלכס לישנסקי\nחוות דעת - הרצאות: \nהרצאות לא מעניינות כל כך, אלכס מפתח כל מיני נוסחאות ומשוואות שבסופו של דבר צריך לדעת רק את הנוסחה הסופית.\nהוא כן פותר כל מיני תרגילי הדגמה שעוזרים להבין איך להשתמש במשוואות\n\nשם המתרגל/ת: נוי\nחוות דעת - תרגולים: \nנוי מעביר את התרגולים בצורה טובה מאוד. \nגם לדעת להקריא מדף מוכן צריך לדעת.\nאם יש שאלות שקשורות להבנה תיאורטית של החומר הוא לא הכתובת כל כך\n\nשעורי הבית: \nעמוס עמוס עמוס.\n12 גליונות שכולם היו חובה להגשה עם ציון תקף.\nבסוף לקחו רק את ה 11 הטובים ביותר.\nלרוב התרגילים יש רפרנסים, אבל כמעט בכל גליון הייתה שאלה אחת שהייתה חדשה.\nהגליונות לא הוחזרו עם פידבק\nהמבחן: \nמבחן עמוס.\nשלוש שאלות שמתוכן שתיים הן שאלות סבירות+\nשאלה אחת שאלה שהיא הרוע בהתגלמותו.\nהציון במקצוע הזה נמוך כי אלכס פשוט שוחט בבדיקה.\n6 נקודות מתוך 15 ירדו על שתי טעויות חישוב וזה רק בסעיף אחד.\nהשורה התחתונה: \nקורס חובה, אז אין ברירה\nצריך להיכנס לראש של אלכס ופשוט לעבור", "timestamp": 1627194778982}, {"author": "עמרי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: \nמעביר את החומר בצורה יבשה ומקריא הרבה מהמצגת, אני לא הלכתי להרצאות בגלל שהן היו מאוד משעממות ולא הרגשתי שזה יצר פער שלא היה יחסית קל לצמצם\nשם המתרגל/ת: נוי\nחוות דעת - תרגולים: \nמתרגל טוב, יודע את החומר ברמה מאוד גבוהה\nשעורי הבית: \nקשים, הרבה שאלות ממבחנים ישנים, אם עושים אותם במהלך הסמסטר זה יכול להוריד הרבה עומס מהלמידה בתקופת מבחנים\nהמבחן: \nהוגן, ברמה של השיעורי בית", "timestamp": 1664801868413}, {"author": "eden", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: משעממות ולא מועילות בשום צורה. להדפיס אותם למבחן כי הוא עם חומר פתוח\n\nשם המתרגל/ת: נוי\nחוות דעת - תרגולים: קצת איטי אבל עוזר בהבנת החומר והרבה\n\nשעורי הבית: מייגעים ומייאשים מרוב אורכם. אבל כדאי לשבת ולהביון אותם לעומק כי מגיעים למבחן כמעט מוכנים\n\nהמבחן: קשה אבל לא בלתי אפשרי \n\nהשורה התחתונה: קורס כבד מאוד, צריך להשקיע במהלך הסמסטר", "timestamp": 1666520649249}, {"author": "דנ״א פולימרז דלתא", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלכס \nחוות דעת - הרצאות:\n בשלב מסוים כבר נהיה קשה להבחין מה באמת קריטי ורלוונטי למבחן. \nשם המתרגל/ת: צפיתי בתרגולים של מוחמד \nחוות דעת - תרגולים: \nההקלטות מאוד טובות בעיני, בתחילת כל תרגול יש בדרך כלל קצת רקע ש״מכניס לעניינים״ ולי זה מאוד עזר. הרבה מהשאלות בתרגולים לקוחות ממבחנים! אז שימו לב שאתם מבינים עד הסוף.\nשעורי הבית: יש גליון להגשה כל שבוע. הרוס המוחלט של השאלות הן ממבחני עבר ולכן מאוד מאוד חשוב להשקיע! זו הכנה טובה למבחן.\nהמבחן: \nהיו 2 שאלות שהיו סבבה לגמרי ואחת שהייתה יחסית \nקשה. בעיני מבחן די עמוס ל3 שעות. חשוב להגיע מאוד מתורגל ולשלוט בחומר. תפתרו כמה שיותר מבחנים ויהיה בסדר (:\n השורה התחתונה: \nקורס מאוד מעניין בעיני, על אף שהוא באמת לא קל, ועמוס.\nבהצלחה !", "timestamp": 1690468527068}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלכס לישנסקי\nחוות דעת - הרצאות: קורס מניין מאוד ,  קצב עולה עם ההתקדמות בסמסטר, בד״כ אלקס מרצה טוב, אך לפעמים מאוד מהיר והרבה דברים מבחינתו צריכים להיות מובנים מאיליו. חשוב לעקוב בפרק הדינמיקה ומט׳ המאמצים כי גיליתי שרוב החומר בהמשך מתבסס עליו, פשוט מי שלא מבין את זה , ימצא קושי רב בהבנת החומר אחר כך וקשה להשלים. המלצה : לכו להרצאות, חשוב להבין למרות הקושי, אלכס בוחן על הבנה גם כן.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: \nעדיף לא להסתמך על המוקלט, אישית היתי מעדיף פרונטלי אל היתה התנגשות. חשוב לשאול ולהבין כל דבר. במוקלט יש כמה טעויות ..\nשעורי הבית: שאלות ממבחנים קודמים, תעשו אותם לבד.\n\nהמבחן: מועד א קשוח, מועד ב יותר סביר ביה. חשוב לפתור הרבה מבחנים ושאלות. שני המועדים היו משוחזרים (בדיוק אותם שאלות ממבחני עבר אך  אף אחד לא עלה על זה..)\n\nהשורה התחתונה: קורס עמוס, הקצב עולה עם ההתקדמות בסמסטר, השתמשתי בספר הקורס כדי להבין את העקרונות, חשוב לשלוט בחומר לפני שמתקמים לנושא הבא, אחרת תאבדו את עצמכם בקלות.", "timestamp": 1703179955460}, {"author": "סטודנט להנדסה", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: \nדי מיותר. באיזשהו שלב הקצב נהיה מהיר מדי ולא ברור. למרות זאת, כדאי וחשוב לקרוא את המצגות על מאזנים, זרימה למינרית מפותחת, אנליזת מימדים וזרימת ברנולי. למעשה אם הסמסטר היה מתמקד בנושאים החשובים האלו לכל אורכו, החומר היה ברור יותר.\nשם המתרגל/ת: נוי\nחוות דעת - תרגולים: מתרגל מעולה, עושה קצת סדר בבלאגן. תמיד עונה על כל השאלות בסבלנות.\n\nשעורי הבית: קשים, ממש חורקים שיניים כדי לפתור. כדאי מאוד לפתור לבד ולהיעזר ברפרנס באופן מינימלי.\n\nהמבחן: בשונה משנים קודמות, הסמסטר מועד א' היה ממש בלתי פתיר. בשאלה עם הניקוד הגבוה ביותר, למי שלא עלה על הטריק בסעיף א' לא הייתה אפשרות להתקדם, לכן חשוב לשים לב לפרטים הקטנים בהרצאות. מה שכן, השאלות היו ממוחזרות אם מחפשים טוב והיה פקטור.\n\nהשורה התחתונה: נורא וחבל כי זה קורס מעניין וחשוב להמשך.", "timestamp": 1704489211001}]}