{"posts": [{"author": "אסץי", "semester": "201802", "text": "ההרצאות ממש מיותרות, אין מה ללכת. כל שבוע יש גיליון להגשה אבל החומר די מעניין", "timestamp": 1563613873000}, {"author": "Li", "difficultyRank": 3, "generalRank": 3, "semester": "201901", "text": "שם המרצה: גדעון גרדר\nחוות דעת - הרצאות: ארוכות] משעממות, לדעתי די מיותר להגיע\n\nשם המתרגל/ת: ענת קרלין\nחוות דעת - תרגולים: מסבירה טוב\n\nשעורי הבית: יוצאים פעם בשבוע. קלים וכדאי לעשות לבד כדי שההתכוננות למבחן תהיה מהירה יותר. סך הכל לא קשה.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס בסיסי ויש בו לפעמים הרבה חישובים משעממים ואורכים אבל לא קשים או מאתגרים, אחר כך לומדים בקורסים המתקדמים א הדברים האלו עם יותר הבנה והעמקה וזה מתחיל להיות מעניין יותר.", "timestamp": 1597745264327}, {"author": "Rom", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: גדעון גרדר\nחוות דעת - הרצאות: גדעון נחמד וקשוב, אך לדעתי ההרצאות קצת ארוכות ומייגעות.\n\nשם המתרגל/ת: ענת קרלין\nחוות דעת - תרגולים: מסבירה סביר, יכולה להיות לפעמים לא סבלנית כלפי שאלות. \n\nשעורי הבית: עמוסים, הגשה כמעט כל שבוע.\n\nהמבחן: הוגן, אבל מורידים של שטויות. הסגל לא מפרסם מבחנים עם פתרונות מלאים. \n\nהשורה התחתונה: לא מומלץ כקורס בחירה. למי שאין ברירה, זה עובר.", "timestamp": 1613599659024}, {"author": "Mohammad A'.A'zab", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גדעון גרדר\nחוות דעת - הרצאות: \nארוכות ומשעממות, רוב החומר בהן לא קשור לחומר הבחינה, אלה זה מידע כללי על מה זה הנדסה כימית, והרבה דוגמאות הנדסיות. למי שרק רוצה 100 הייתי אומר אפשר בלי, אבל לסטודנט הנדסה כימית שנה א שרוצה להכיר את מקצועו בסדר ללכת אליהן, אבל לא לפחד אם לא מבינים, גם כך זה לא קשור.\nגידי חמוד מאוד.\nשם המתרגל/ת: ענת קרלין\nחוות דעת - תרגולים: \nלדעתי מתרגלת מצטיינת. מסבירה ממש טוב, ורואים שהיא מנוסה וגם מוכנה לשיעורים. לפעמים, אין לה תשובות מדויקות על השאלות כי ככה הקורס הזה, הוא הרבה יותר טכניקה מאשר הבנה. \nשעורי הבית: \nפעם בשבוע, יש רפרנסים, אבל כדאי לנסות לפתור לבד. למבחן, לא כ\"כ צריך לחזור עליהן (חוץ מ2 אחרונות אולי), הן יותר בקטע של הבנת חומר, ולפתור מבחנים יותר יעיל.  \n\nהמבחן:\nבכללי 3 שאלות פתוחות: 1-שאלה מחומר הרקע, 2-שאלת מאזן חומר, 3- שאלת מאזן אנרגיה. מאזן לא עמיד מופיע כסעיף באחד מהן בדרך כלל. כל מבחן יש בו טריק או שתיים חדשים, אבל העיקרון אותו דבר. מורידים הרבה נקודות על טעויות במספרים, כי זה בעצם מה שצריך לקחת מהקורס, אז לשים לב. \nלא מפרסמים פתרונות למבחנים באתר (רק תשובות סופיות) שזה מעצבן ולדעתי צריך להשתנות, וגם לא מפרסמים את כל המועדים.\nכדאי להסתכל על מישהו פותר מבחן וככה יודעים איך לפתור.\nהשורה התחתונה: \nמה שטוב בו החומר לא גדול מדי, והקורס טכני, ואז צריך להבין פעולות מסוימות כדי להשיג ציון גבוה. מומלץ כבחירה גם. לא לזלזל.", "timestamp": 1613735007846}, {"author": "**", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: גדעון \nחוות דעת - הרצאות: לא נכחתי בהרצאות כי הן מיותרות \n\nשם המתרגל/ת: איציק\nחוות דעת - תרגולים: מבחינתי הוא אחלה מתרגל , מסביר טוב את השאלות דואג לנו והוא ממש מתרגל מצטיין לדעתני \n\nשעורי הבית: סבירים וטובים \n\nהמבחן: עוד לא עשיתי \n\nהשורה התחתונה: קורס נחמד , לכו לאיציק הכל יהיה טוב", "timestamp": 1626710329919}, {"author": "עלמה ינאי", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: גידי\nהייתי ב5 הרצאות ראשונות הן היו מעניינות אבל לא מספיר ממוקדות ואז הגעתי להבנה שאפשר להגיע רק לתרגולים ועדין להצליח את שיעורי הבית.\n\nשם המתרגל/ת: ענת\nחוות דעת - תרגולים: \nמסבירה טוב את המצגות, עונה על כל שאלה שיש תוך כדי ההרצאה וגם זמינה במייל. \nשעורי הבית: יש גיליון כל שבוע, ממש מומלץ לעבוד כמה דקות על התרגול ולהיזכר מה היה בו ואז לפטור, יש רפרנסים ממש טובים אבל ממש מומלץ לפטור לבד ואז להשוות בסופו של דבר הציון הוא בינרי. \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626849458245}, {"author": "ליאור", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nהרצאות קצת ארוכות לטעמי. \nשם המתרגל/ת: איציק +ענת \nחוות דעת - תרגולים: \nמסכמים את ההרצאות באופן יפה ודוגמאות המסייעות בשיעורי הבית. \nתרגולים \nשעורי הבית: דורשים השקעה\nומאוד מלמדים ומכינים. \n\nהמבחן: \nהוגן. \nהשורה התחתונה: דורש השקעה אבל לא קורס כבד כלכך.", "timestamp": 1658941495054}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה:לא הייתי\nחוות דעת - הרצאות: ממש מיותרות\n\nשם המתרגל/ת: איציק\nחוות דעת - תרגולים: \nאיציק הוא מתרגל ממש מעולה,מסביר טוב את החומר,בתחלית כל תרגול הוא עושה חזרה על החומר הנלמד בהרצאה והוא ממש מכסה את כל החומר,עונה על כל שאלה,גם עושה אווירה נעימה בכיתה לכו לאיציק אחלה מתרגל\nשעורי הבית: כל שבוע גיליון ממש מומלץ לפתור \n\nהמבחן: הוגן,אפשר להוציא ציון טוב\n\nהשורה התחתונה: קורס סבבה ודי טכני", "timestamp": 1666125987760}, {"author": "סטודנט להנדסה", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: משעממות ומיותרות, אפשר להצליח בגדול גם בלעדיהן\n\nשם המתרגל/ת: איציק\nחוות דעת - תרגולים: רק איציק\n\nשעורי הבית: עמוסים כי צריך להגיש גיליון כל שבוע גם לא מעלים לציון הסופי כמעט כלום. אבל בגדול מאוד מלמדים. יש בוחן אמצע בקורס, שווה להשקיע בו.\n\nהמבחן: השנה היה מאתגר.\n\nהשורה התחתונה: בין קורסי החובה שאפשר להצליח בהם", "timestamp": 1666575275121}, {"author": "סטודנטית להנדסה ביוכימית", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: לא הייתי בכולן, היו ארוכות לטעמי\n\nשם המתרגל/ת: איציק\nחוות דעת - תרגולים: אחלה של מתרגל- מסודר, דואג שכולם יבינו. הבנתי שגם ענת מעולה אבל לא הייתי.\n\nשעורי הבית: יש כל שבוע גליון ורובם דורשים השקעה. *המפתח להצלחה בקורס הוא פתרון שיעורי הבית והשקעה בהם* \n\nהמבחן: סביר, יש בכל מבחן סעיף או שניים שהם לא פשוטים ומפילים את הרב אבל בגדול זו בחינה שמי שלומד אליה מצליח.\n\nהשורה התחתונה: תשקיעו בשיעורי הבית כי זה קורס די טכני שצריך להגיע לבחינה שלו מאוד מתורגלים. מי שישקיע- הציון ישתלם\nבהצלחה!", "timestamp": 1666788750482}, {"author": "Razan Zheralden", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: בהרצאות מביאים לנו אנשי מקצוע שירצו לנו על התחום מהם הם באים וכולם בוגרי הפקולטה (כימית וביוכימית) מן הסתם שיש הרצאות יותר מעניינות והרצאות פחות מעניינות אבל בסה״כ היה חמוד\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: \n\nשעורי הבית: יש משוב שצריך לעשות אחרי כל הרצאה והוא פתוח רק ל 24 זה קצת מעצבן אבל פשוט  שמים שעון כל שבוע , במידה ושכחתם אתם יכולים לדבר על חבצלת והיא תפתחו לכם אותו לעוד 24 שעות - אל תגזימו בזה כמובן.\n\nהמבחן: אין , פשוט צריך להגיע לכל ההרצאות - אני פספסתי אחת וקיבלתי עובר \n\nהשורה התחתונה: קורס ממש קליל ונותן נקודת זכות במתנה הוא רק שעה בשבוע ולא דורש מאמצים - תקחו אותו כך גם תכירו יותר מי איתכם באותה פקולטה.", "timestamp": 1679690513715}, {"author": "RH", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חבצלת ביאנקו פלד\nחוות דעת - הרצאות: זה הייתה הפעם הראשונה שחבצלת מעבירה את הקורס הזה וזה מורגש. ההרצאות היו מועילות במידה מסוימת, אבל ממש לא חובה, ובמיוחד עם חבצלת שהיא אמנם בעלת שליטה טובה מאד בחומר, אבל חסרה בה קצת כריזמה כשהיא מרצה. מה שכן כמעט כל הרצאה יש כל מיני סקרים כאלה שעושים אונליין כדי שנהיה מעורבים בהרצאה, זה לפעמים עוזר לפקס אותך (בכל זאת 3 שעות של המקצוע הזה...)\n\nשם המתרגל/ת: רינת\nחוות דעת - תרגולים: רינת מתרגלת מעולה, מסבירה נקודות לא ברורות ויודעת בדיוק איפה הקשיים שלנו כסטודנטים ועל מה צריך להתעכב. באופן כללי, מומלץ מאד מאד לא לפספס אפילו תרגול אחד. חייב את התרגולים כדי להצליח בקורס הזה. \n\nשעורי הבית: כל שבוע גיליון. רובם די טכניים, אם מבינים מה עושים ולא מחרטטים. יש כמה שדורשים יותר חשיבה. עם זאת, זה כן יכול לגזול זמן, במיוחד שזה גיליון כל שבוע. ממליץ לפתור כמה שיותר סמוך לתרגול כשהחומר עוד טרי בראש. \n\nהמבחן: במועד א' לא היו איזה הפתעות חדשות, הכל היה די דומה למה שעשינו כל הסמסטר אז נוכחות טובה בתרגילים והתעקשות על פתרון מעמיק של שיעורי הבית אמורה להביא אותכם לציון מעולה\n\nהשורה התחתונה: קורס חובה פקולטי, לא לקחת כבחירה כי החומר לא הכי מעניין אבל בסופו של דבר זה הבסיס לכל שאר המקצועות בהנדסה כימית...", "timestamp": 1690865675446}, {"author": "NR", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: ארוכות וקצת מייגעות, לא חייבים להגיע כדי להצליח\n\nשם המתרגל/ת: ענת\nחוות דעת - תרגולים: ענת מושלמת! מסבירה את החומר מעולה. המצגות מסודרות ומועילות ממש\n\nשעורי הבית: כל שבוע, כדאי לשבת כמו שצריך ולפתור לבד\n\nהמבחן: מומלץ לעבור כמו שצריך על התרגולים ושיעורי בית המבחן עצמו היה מאתגר\n\nהשורה התחתונה:", "timestamp": 1690881187413}, {"author": "דבורית", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חבצלת\nחוות דעת - הרצאות: הרצאות ממש משעממות, הקשבתי בחלק ובחלק האחר עשיתי חדווא. בעיניי לא מועיל בכלל ומשעמם. \n\nשם המתרגל/ת: רינת \nחוות דעת - תרגולים: מושלמת אין מה להגיד, עוברת בקצרה על החומר ועל נוסחאות בתחילת התרגול ואז פותרת שאלות. ממליצה לא להפסיד אף תרגול כי שיעורי הבית דומים מאוד לתרגול. אחלה מצגות עם פתרונות מלאים.\n\nשעורי הבית: כל שבוע מתפרסם גיליון, חלק יותר קשה וחלק פחות אבל השעורי בית זה מה שיביא להצלחה בקורס. \n\nהמבחן: הקורס עבר שינויים, מרצה חדשה, סדר החומר שונה ולכן המבחנים ובחני האמצע מהעבר לא בדיוק מתאימים לסדר החדש מה שמקשה על הלמידה למבחן. בוחן האמצע היה הוגן לחלוטין. המבחן עצמו היה קשה מעבר למצופה אך למרות זאת אפשרי.\n\nהשורה התחתונה:", "timestamp": 1691752407665}]}