{"posts": [{"author": "X", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שמעון ברנדון\nחוות דעת - הרצאות: בהרצאות הוא בעיקר מתעסק בפיתוח המתמטי הארוך לכל המשוואות. לעתים הוא מכניס תיאוריה קצת מאחורי המשוואות \n\nשם המתרגל/ת: נוי חן\nחוות דעת - תרגולים: מתרגל מעולה. מסביר את החומר מאוד טוב ויורד לפרטים הקטנים. הבעיה שלפעמים השאלות בתרגול לא מתייחסות לכל מיני פרמטרים שצריכים להיעזר בהם בטבלאות עזר בשיעורי בית, וזה חבל. לומדים את זה דרך ההרצאה או תוך כדי פתירת ש.ב \n\nשעורי הבית: לעתים פשוטים ולעתים מאוד קשים. יש מטלות כתיבה שהן מעיקות.\n\nהמבחן: קשה מאוד.  מחולק ל2 בחנים 40% תקף.שמעון כותב מבחנים עם הבנה תיאורטית שהוא בעיקר יודע וצריך להיכנס לראש שלו כדי להבין את כוונת המשורר. מבינים לאט לאט תוך כדי פתירת מבחנים\n\nהשורה התחתונה: קורס שיכל להיות יותר פשוט ממה שהוא אבל מסבכים אותו יתר על המידה בלי לתת הרבה כלים. דורש השקעה כדי להצליח בסוף בבחנים", "timestamp": 1610803878359}, {"author": "XXXXXXXXXXXXX", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שמעון ברנדון\nחוות דעת - הרצאות: הרצאות מאוד מעניינות וחשובות. חובה ללכת אליהן עם השקפים מודפסים ולרשום את ההסברים של שמעון. אם יש משהו לא מובן, מוטב להתעכב ולשאול עד להבנה כי הבחינה ברובה היא מאוד תיאורטית. שמעון מסביר בסבלנות והוא אחד מהאנשים הסבלניים והאכפתיים שפגשתי עד כה בטכניון. אחד המרצים שהכי אהבתי הסמסטר, מרתק בשיעורים עם הרבה אנרגיה ומוטיבציה ומעבר לכך שהחומר מאוד מעניין, לשם שינוי -:). \n\nשם המתרגל/ת: נוי חן\nחוות דעת - תרגולים: מתרגל מצוין, התרגולים מעמיקים את ההבנה אך לא רלוונטיים למבחן. כל תרגול נוי פותח בחזרה על החומר ומעמיק את ההבנה וכותב הכל מסודר בלוח. חובה ללכת. \n\nשעורי הבית: בזבוז של זמן ויש שתי מטלות קריאה, עוד יותר בזבוז של זמן. מאוד מעיק ולחינם, לא תורם בבחינה הסופית.\n\nהמבחן: מדובר בשני בחנים, לא פשוטים בכלל. מדובר בבחינה עם חומר פתוח ונוכחות ההרצאות הן קריטיות מאוד. כדאי להדפיס כל *כל* מבחני העבר עם פתרונות שמפורסמים מכיוון שלעיתים קרובות, בייחוד בשאלה הפתוחה, שמעון חוזר על עצמו ולכן זה מאוד עוזר ומציל. ברגע שפותרים בחנים הרעיון מובן אך מאוד מבלבל ומתקיל. \n\nהשורה התחתונה: קורס קשה ומאתגר ובו בזמן גם מומלץ ומעניין.", "timestamp": 1644689525987}]}