{"posts": [{"author": "///", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דני\nחוות דעת - הרצאות: הסרטונים דיי ברורים\n\nשם המתרגל/ת: אורן/אסף\nחוות דעת - תרגולים: אני ממש ממליץ על אורן, הוא בא ומסביר לעומת זאת אסף דיי שבוז והסביר רק כששאלו\n\nשעורי הבית: יש רפרנסים, אבל בחייאת זה לא כזה קשה וזה סופר חשוב לדעת להשתמש בתוכנה טוב לקראת סמסטר הבא, יש פרויקט שלם שמבוסס על התכנה.\n\nהמבחן: אם עושים את כל השיעורים דיי קל, אין מה ללמוד יותר מידי, פשוט לרוץ על מבחנים שהיו\n\nהשורה התחתונה: קורס קליל וחביב", "timestamp": 1597984846033}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: אסף סימון וספיר ליפשיץ\nחוות דעת - תרגולים: התירגולים הם עצמאיים עם פתיח של כ20 דקות מסכמות של השבוע הקודם. לא שמים מספיק דגש על הבנה רחבה שתאפשר יישום והתאמה במקרים עתידיים - החיסרון העיקרי בקורס\n\nשעורי הבית: \nכ8 בחני מודל לאורך הסימסטר ו3 הגשות לאורך הסימסטר - כשעתיים נוספות בשבוע מעבר לתירגולים\nהמבחן: אינו תואם לרמה לאורך הסימסטר בעת הלמידה אליו חשוב להשאיר זמן לתרגול מבחנים משנים קודמות - ישנם פתרונות לרוב מלאים וניתן ללמוד מהם המון (רובם נכונים)\n\nהשורה התחתונה: קורס עם נקודת זכות יחידה אך דורש מעבר בעיקר בהגשות ובמבחן", "timestamp": 1628086698249}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דני לוין\nחוות דעת - הרצאות: אין הרצאות\n\nשם המתרגל/ת: אסף סימון\nחוות דעת - תרגולים: במהלך התרגול יש הסבר קצר בתחילתו ולאחר מכן מתחלקים ל breakout rooms וצופים בסרטונים ומתנסים בתוכנת ה unisim ואם יש בעיות קוראים למתרגל. אסף מתרגל מדהים\n\nשעורי הבית: בשיעורי הבית צריך להשתמש בתוכנה ולהוציא ממנה כל מיני פרמטרים. במהלך הסמסטר יש מספר \"פרויקטים\" קטנים שהם פשוט שיעורי בית קצת יותר ארוכים. \n\nהמבחן: אצלנו המבחן היה פעם ראשונה דרך המחשב בלי קשר לקורונה, הוא היה פחות או יותר ברמה של הפרויקטים של השיעורי בית. היו שאלות אמריקאיות כמו בשנים קודמות ובנוסף היה צריך לבנות משהו ביוניסים. \n\nהשורה התחתונה: קורס סבבה בסך הכל", "timestamp": 1639915612135}, {"author": "A", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אסף סימון\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: ידידותיים , קליל , לא דורש הרבה השקעה\n\nהמבחן: בזום , שאלות רגילות + משתמשים ביוניסים. נחמד\n\nהשורה התחתונה: קליל", "timestamp": 1640025878116}]}