{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: חוסאם חאיק\nחוות דעת - הרצאות: ההרצאות בוידאו גם כשאין קורונה, אפשר לראות בזמנכם החופשי. לא הכי ברורות בעולם אבל אפשר לקרוא בספר הקורס במקום, זה די אותו דבר. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש כל שבוע בוחן במודל שיש אליו רפרנסים בדרייב. בנוסף יש 2 עבודות כתובות במהלך הסמסטר ופרויקט סופי בקבוצות של 4. \nהמבחן: \nהציון הסופי נקבע ע\"י 10% עבודה כתובה 1, 20% עבודה כתובה 2, 30% בחנים במודל ו- 40% פרויקט סופי. \nהשורה התחתונה: הקורס כן דורש קצת השקעה אבל הציונים גבוהים אז זה שווה את זה.", "timestamp": 1610011808241}, {"author": "רז בוזגלו", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חוסאם חאיק \nחוות דעת - הרצאות: מיותרים. עדיף להסתכל על ספר הקורס, הוא די מקריא את הכל ממנו מילה במילה. \n\nשם המתרגל/ת: ויויאן דרסה\nחוות דעת - תרגולים: אין באמת תרגולים. המתרגלים שם כדי לענות על שאלות אם יש ולבדוק את העבודות. \n\nשעורי הבית: זה בחנים כאלה כל שבוע. קלילים, מהווים 30% מהציון. יש להם רפרנסים.\n\nהמבחן: אין.\n\nהשורה התחתונה: קורס קל עם 3 עבודות שצריך להגיש לאורך הסמסטר. כן להשקיע קצת בעבודות, בפועל הציונים גבוהים במיוחד.", "timestamp": 1631700434296}, {"author": "סטודנט מאוכזב", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חוסאם חאיק\nחוות דעת - הרצאות: הרצאות נוראיות ולא מובנות. ישנם סרטונים מוקלטים כל שבוע שצריך לראות וחוסאם מצליח להפוך נושא מעניין למשהו משעמם בקלות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: בחנים שצריך לענות עליהם כל שבוע, מרופרנסים ומעפנים. יש 3 עבודות להגשה במהלך הקורס ו 2 מתוכן אפשר לתת לתלמיד כיתה י' לעשות, עבודה שלישית בקבוצות קצת יותר דורשת.\n\nהמבחן: אין\n\nהשורה התחתונה: הקורס מועבר בצורה נוראית, אבל לא דורש השקעה גדולה מדי והציונים גבוהים. אם מצליחים איכשהו להבין משהו מההרצאות אולי זה גם מעניין. הקורס מועבר באנגלית.", "timestamp": 1651426273363}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חוסאם\nחוות דעת - הרצאות: הרצאות מוקלטות באנגלית. רמת ההקלטות נמוכה מאוד, האנגלית של חוסאם לרוב לא ברורה מספיק. אין צורך לראות את ההרצאות באמת.\n\nשם המתרגל/ת: ויויאן וג'ון\nחוות דעת - תרגולים: אין תירגולים סדירים, יש שלוש עבודות הגשה.\n\nשעורי הבית: יש לכל שבוע שאלון מודל של 9-11 שאלות בערך. מרופרנס לחלוטין, אין מה להשקיע בזה.\nעבודות ההגשה הן לא קשות מידי. שתי עבודות פרטניות, אחת של 300 מילים ואחת של 3 עמודים. לא משהו מסובך אבל לזכור שזה קורס גם לתארים מתקדמים אז יש כל מיני דרישות שלא מפורטות בתיאור המטלה וכדאי לשאול.\nהעבודה האחרונה היא בקבוצה של עד 4 חברים שהיא כבר 10 עמודים. תאריך ההגשה אצלנו היה בסוף סמסטר קיץ בערך\n\nהמבחן: אין\n\nהשורה התחתונה: מי שרק רוצה ציון יחסית גבוה, שיקח את הקורס. לא לומדים יותר מידי בקורס הזה והוא די בזבוז של זמן למי שבאמת רוצה ללמוד על ננו-חיישנים", "timestamp": 1659421025446}, {"author": "eden", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חוסאם חאיק\nחוות דעת - הרצאות: לא רלוונטיות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש רפרנס לכל השאלות במודל (אמרקאיות)- לא צריך ללמוד את החומר. היו שתי עבודות במהלך הסמסטר שדורשים יום של השקעה וזהו.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מומלץ מאוד, מעט השקעה (יומיים בשבוע) עם ממוצע מעל 90", "timestamp": 1666521009066}, {"author": "גטסבי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חוסאם חאיק \nחוות דעת - הרצאות: מעלה הקלטה כל שבוע , אין הרצאה בכיתה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל שבוע גיליון עם רפרנסים מלאיםהיה ס\"כ 10 30% מהציון הסופי.\n3 מטלות כתיבה, הראשונה והשניה עושה אותם לבד. והם 10% ו 20% מהציון הסופי. והמטלה האחרונה היא ב חמישיות 40% מהציון הסופי.\nהמבחן: אין\nהשורה התחתונה:\nלא למדתי כלום מהקורס הזה, לקחתי אותו כדי לשפר את הממוצע, אל תשתמשו ב AI. המטלה הראשונה היו מלא אנשים שהתמששו ב Chatgpt ותפסו אותם. חבל.\nס\"כ מומלץ אבל תשקיעו במטלת הכתיבה כי הם מורידים נק, סתם.\nס\"כ מומלץ", "timestamp": 1690373713542}, {"author": "ננו", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: חוסאם\nחוות דעת - הרצאות: יש מוקלט, לא לראות זה סתם בזבוז זמן\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: יש בודקי מטלות והן עונות למייל שנשלח בתחילת הסמסטר בסמסטר הבא - מזעזע.\n\nשעורי הבית: יש 3 מטלות ושימו לב שצריך ממש להשקיע בהם אני אישית סבלתי מזה כי הפעם החליפו את הבודקים והציונים ממש מעפן הפעם\n\nהשורה התחתונה: נראלי פעם היה הקורס הזה ממולץ, אבל עכשיו הם נותנים ציונים די נמוכים על ההגשות ובסוף יוצא קורס לא משתלם. מי שפעם קיבל 100 עכשיו מקבל 70 (מכיר מלא אנשים שלקחו רעיונות מאנשים שקיבלו 100 ואז הציונים שלהם היו בין 70-90)\nלהתרחק מהקורס הזה כרגע..", "timestamp": 1691242057201}, {"author": "is", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: \n\nשעורי הבית: אצלנו ממש קטלו מי שהשתמש בchatgbt אז ממש להיזהר\nבכללי אני חושבת שבסמסטר הזה ממש קטלו בבדיקה \n\nהמבחן: אין\n\nהשורה התחתונה: לא דורש הרבה והציונים בכל זאת גבוהים", "timestamp": 1695372883400}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות:  מזה?\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אמריקאי 30%, 3 עבודות מעיקות, אבל לא נוראיות. אנשים השתמשו בchatGPT ובכו שעלו עליהם. הסגל נתן לכל עבודה רשימה וסעיפים של מה צריך להופיע, ומי שלא התייחס הורידו לו נקודות (לעיתים הרבה). אחלה קורס, חציון 95 אומר הרבה יותר ממתי שמתבכיין. \n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס, צריך לשים לב שעושים את ההגשות כמו שצריך.", "timestamp": 1706367465671}]}