{"posts": [{"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב\nחוות דעת - הרצאות: ההרצאות מעט משעממות אבל יואב מסביר מאוד ברור והסרטונים נחמדים\n\nשם המתרגל/ת: שירה \nחוות דעת - תרגולים: התרגולים דיי ברורים אבל שירה לא זמינה לשלאות ולא לגמרי יודעת לענות עליהן שזה חבל\n\nשעורי הבית: ממש בקטנה, קלילים מאוד ויכולים לעזור להבנת החומר\n\nהמבחן:לא תמיד לגמרי קשור למה שלומדים, צריך סיכום טוב, להבין את החומר וגם קצת מזל לא יזיק \n\nהשורה התחתונה: קורס נחמד", "timestamp": 1660402947928}, {"author": "גטסבי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יואב \nחוות דעת - הרצאות: משעממות לגמרי קשה להירכז בכל מה שיואב אומר ב 3 שעות. צריך סיכום ממש טוב. \nחוץ מזה יואב ממש נחמד ומסביר טוב. \nשם המתרגל/ת: קריסטינה \nחוות דעת - תרגולים: היא מעולה, מסבירה טוב את החומר התאורטי לפני התרגול. תרגולים לא קשים במיוחד. לא עוברים על כל חומר ההרצאות, אז ממליץ לא רק ללכת לתרגולים כי יש מלא חומר בהרצאות.\nשעורי הבית: \nלא קשים, היה רפרנס לכמה שאלות. בחרו ב 6 מ 8 תרגילי בית \nהמבחן: \nחלק אמירקאי של יואב, חלק פתוח של דגנית\nהשורה התחתונה: \nממליץ מתחילת הסמסטר לעשות את משימות הבונוס כי זה ממש עוזר לציון סופי. קורס מעניין שעוסק בחומרים שנעבוד בהם בתחום התעשייה.", "timestamp": 1689258305892}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ליבני ודגנית\nחוות דעת - הרצאות: דגנית מיותרת אפילו לא הגיעה למבחן ולא יודעת מה היא כן לימדה ומה לא. ליבני חמוד אבל 3 שעות זה בלתי אפשרי. מזל שיש הקלטות להכל.\n\nשם המתרגל/ת: קריסטינה\nחוות דעת - תרגולים: בדר\"כ סיימה תוך 20 דקות ותכלס אין פואנטה לתרגולים האלו. זה רק רענון לזיכרון או עדכון על החומר למי שלא רואה הרצאות.\n\nשעורי הבית: משוחזרים ב-100%.\n\nהמבחן: היה מוזר. ליבני יצירתי ממש בשאלות אבל הוגן. החלק של דגנית לעולם לא נדע (מי יודע אם היא תביא בכלל ציונים בזמן). \n\nהשורה התחתונה: מיותר אבל חובה.", "timestamp": 1690012642905}, {"author": "ס.נ", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יואב ליבני, דגנית דנינו\nחוות דעת - הרצאות: נושאים לא פשוטים בכלל, לי אישית היה משעמם, יואב מאוד מסודר ומנסה להנגיש את החומר כמה שיותר, דגנית מפוזרת ולא ברורה. \n\nשם המתרגל/ת: קריסטינה זיידל\nחוות דעת - תרגולים: בסדר גמור, אני אהבתי. השתדלה להסביר למי שלא מבין, לא מיותר בעיניי, כן מכניס את החומר לראש בצורה יותר טובה\n\nשעורי הבית: 20% מהציון. ממוחזר. שווה לנסות לעשות אותם בלי רפרנסים בשביל שזה באמת יישב כמו שצריך.\n\nהמבחן: 80% מהציון, כאשר 80% ממנו שאלות של יואב ו-20% ממנו שאלות של דגנית. קשוח, אבל אפשרי למי שלומד. החלק של דגנית יותר מבלבל ולא ברור, קצת כמו ההוויה הכללית שלה, אבל באמת סך הכל אפשרי.\n\nהשורה התחתונה: קורס עמוס, לא קל, אבל עם הבונוס אפשר להשיג ציון גבוה עם השקעה סבירה. הוגן, בעיניי.", "timestamp": 1696361122450}]}