{"posts": [{"author": "אני", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: איילת ועומר\nחוות דעת - הרצאות: לפעמים ההרצאות בסדר, לפעמים משעממות מאוד\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: ממש בקטנה, הגשת ערך בויקיפדיה ושיעורי בית בתוכנת צמרת, לא קשה בכלל ולא גוזל הרבה זמן\n\nהמבחן: לא קל במיוחד, הרבה שאלות מעט זמן. חלק ממוחזר\n\nהשורה התחתונה: לא הקורס הכי מעניין בעולם אבל מלמדים דברים חשובים", "timestamp": 1653149356372}, {"author": "walker", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: שווה להגיע כדי להבין אבל הכל כתוב בסיכום.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: לא לוקחים זמן (לענות על שאלות במאמר) ולהוציא ערכים מתוכנת צמרת\n\nהמבחן: יהיה טוב\n\nהשורה התחתונה: כמו כימיה של מזון", "timestamp": 1675669587681}, {"author": "גטסבי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עומר ואיילת \nחוות דעת - הרצאות: \nהרצאה 3 שעות, ממש משעממות, אבל עוזרים להבין את החומר. כל החומר היה בסיכום. \nשם המתרגל/ת: אין\nחוות דעת - תרגולים: היה תרגול על צמרת אחד. ואחרכך מעזיבים אותך להתמודד עם תרגילי בית לבד. \nהיה 4 תרגילי בית יחד. 10% תרגילי בית 90% מבחן.\nהמבחן: \nתבינו את החומר. לשנן את הפרטים הקטנים כי שואלים על דברים מאוד ספיציפיים. \nמבחן של 22 שאלה אמירקאית. 8 שאלות נכון, לא נכון. ושתי שאלות פתוחות.\nהשורה התחתונה: \nקורס מעניין מלמדים דברים חשובים להמשך.", "timestamp": 1678465010569}, {"author": "ה", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: איילת+ עומר (? נראה לי שזה השם שלו)\nחוות דעת - הרצאות: הייתי חלקית, אבל כל עוד אתם נושמים בסמסטר הזה תגיעו\n\nאין תרגולים\n\nשעורי הבית: 4 הגשות קלות, תעשו זה חשוב לציון סופי \n\nהמבחן: עוד מבחן מבית היוצר של איילת- שעה וחצי של אמריקאיות+ נכון לא נכון+ פתוחות, מבחן קשה תכלס שהממוצע בו קבוע 70 אם לא פחות . שידור חוזר של כימיה של מזון.\n\nהשורה התחתונה: לסחוב את ההרצאות של החלק הטכני על גלאים זה קשה מנשוא, כבוד למי שהצליח- ממליצה לעבור על סיכום טוב+ לעשות כמה שיותר מהשחזורים בדרייב, הם ממחזרים חלק . קחו את ה70 שלכם ותמשיכו הלאה", "timestamp": 1716812797744}]}