{"posts": [{"author": "אנונימית", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "מעבדה חביבה ביותר, זורעים חיידקים על צלחות בכל מיני דרכים ואז מאפיינים את מה שגדל.. זה בגדול\nיש קצת עומס בגלל כמות המפגשים והניסויים שמתפרשים על פני כמה וכמה מפגשים. הדוחות מעיקים אבל סבילים", "timestamp": 1598222431170}, {"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "מעבדה אחת לשבוע, צריך ללמוד אליה כדי להצליח בבחן בתחילת המעבדה (שלטעמי אף פעם לא היה קל ותמיד הורידו נקודות על שטויות, אז שווה ללמוד טוב). המעבדה עצמה נחמדה - מלא זריעות חיידקים, צפיה במיקרוסקופ, צפיה בגידול שלהם וניתוח מושבות. בסך הכל היא מעניינת, הסגל ברובו נחמד ועוזר. צריך להגיש 3 דוחות סך הכל כשהדוח האחרון מורכב משני חלקים לכן לדעתי אפשר להגיד שמדובר ב-4 דוחות, לא אשקר הדוחות לא כיף גדול והמבנה שלהם מוזר בעיני - הכל חוזר על עצמו- התקציר,המבוא,התוצאות והדיון הכל הרגיש לי כאילו אני כותבת את אותו הדבר 15 פעם במילים שונות. אבל היי לפחות אין הרבה מהם ואפשר לקבל בהם ציון טוב אם משקיעים.\n\nהשורה התחתונה: תבחרו שותף שיהיה לכם כיף לעבוד איתו ואתם סומכים עליו בכתיבת הדוחות, תלמדו טוב לבחנים לפני המעבדה ותפציצו, בהצלחה!", "timestamp": 1627978505532}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: סימה ירון\nחוות דעת - הרצאות: לא רלוונטי, מידי פעם נכנסה למעבדה להגיד היי ולתת מהידע שלה.\n\nשם המתרגל/ת: הרבה מאוד מתרגלות.\nחוות דעת - תרגולים: כולן מאוד נחמדות ורוצות שנצליח, אבל האווירה לרוב מלחיצה. הן בוחנות ממש ומורידות ניקוד על דברים מוזרים. בתחילת כל מעבדה יש בוחן שכל שאלה שווה הרבה מאוד נקודות ,אז מספיק לטעות בשאלה אחת ומקבלים 50.\n\nשעורי הבית: 3 דו\"חות מייגעים ותמיד 2 דו\"חות במסווה של 1. מחפשים קצת להוריד ניקוד ולא נותנים משוב בזמן הגיוני (כבר מעל חודש אנחנו מחכים לציון של אחד הדו\"חות). \n\nהמבחן: רק חיפשו איפה להוריד בבוחן מעשי, ירדו לאנשים על שטויות של מבט לכיוון הלא נכון אז לא באמת משקף משהו.\n\nהשורה התחתונה: הקורס הזה שווה הרבה יותר מ1.5 נק\"ז!!! התעללות נפשית, השקעה עצומה של זמן ועצבים ובסוף רק נק\"ז וחצי. הדבר הכי מתסכל בקורס הזה שהוא פחות ממל\"ג.", "timestamp": 1657809608812}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: -\nחוות דעת - הרצאות:- \n\nשם המתרגל/ת:- \nחוות דעת - תרגולים:- \n\nשעורי הבית: דפי הכנה לכל מעבדה על חיידקים חדשים מהפרוטוקול. לא קשה להכין\nהמבחן: היה מבחן מעשי, תתרגלו טוב את השיטות של הצביעה והזריעה, ותחזרו טוב על תכונות החיידקים.\n\nהשורה התחתונה: לגבי הדוחות, כל שנה מוסיפים ניסויים חדשיםמ ושונים, יש השקעה בדוחות של המעבדה הזאת, אבל סבבה לגמרי.\nבוחני המעבדה יש משקל טוב מהציון הסופי, אז אני ממליץ בחום להשקיע בבחנים, היה 35% מהציון הסופ.", "timestamp": 1658139473964}, {"author": "ה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "השורה התחתונה: מתחיל סבבה, נגמר פחות . הדו\"ח האחרון בסוף תקופת מבחנים יושב כמו עצם בגרון שאי אפשר להוציא ואל תשכחו לקרוא למתרגלת שתסתכל עליכם עושים דרגלסקי במבחן מעשי (כן, גם אם היא עומדת מעליכם וכבר מסתכלת, תקראו לה, חבל על הנק')", "timestamp": 1692522749070}]}