{"posts": [{"author": "רירי", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יובל שוהם\nחוות דעת - הרצאות: מסביר טוב.\n\nשם המתרגל/ת: אור ומיכל\nחוות דעת - תרגולים: מתרגלים מדהימים, דואגים שכל סטודנט יבין את החומר טוב.\n\nשעורי הבית: 8 גליוניות במהלך הסמסטר, חובה להגיש 7 מתוך 8, מקבלים 100 אטומטית על הגשות אך המתרגלים בודקים את הפתרונות ונותנים משוב.\n\nהמבחן: 20 שאלות פתוחות וקצרות, 3 שעות. מומלץ ללמוד ממאגר השאלות שיש במודל וממבחני עבר כי כמעט כל השאלות ממחזורות.\n\nהשורה התחתונה: פחות התחברתי לקורס הזה כי זה נטו שינון. אפשר לקבל +95 בקלות אם לומדים כמו שצריך ועוברים על מאגרי השאלות שיש במודל.", "timestamp": 1614253696639}, {"author": "Lio Samueli", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: \nקורס מעניין מאוד\nשם המתרגל/ת: מיכל סקיטל/אוק וילינגר\nחוות דעת - תרגולים: \nהחליפו בינהם במהלך הסמסטר.\nשעורי הבית: \nההרצאות רלוונטיות מאוד לשיעורי בית, מי שמקשיב ימצא את התשובות שם.\nהמבחן: \nהמבחן פתוח כולו, צריך לזכור בעל פה לצייר כמה דברים. חוץ מזה, מי שהבין את החומר לא יצטרך לזכור שום דבר בעל פה אבל המבחן נוגע בכל החומר ומצריך הבנה של דברים מסויימים\nהשורה התחתונה: \nקורס נחמד מאוד, מי שהקשיב בשיעורים והבין את החומר הצליח במבחן.", "timestamp": 1615137075257}, {"author": "מ-", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יובל שוהם\nחוות דעת - הרצאות: המרצה נחמד, לפעמים היה קצת משעםםוהעדפתי לצפות במוקלט במהירות מוגברת.\n\nשם המתרגל/ת: מיכל+אור\nחוות דעת - תרגולים:  באמצע הסמסטר מחליפים מתרגל. התרגולים מאוד מרוכזים וחוזרים על הנושאים החשובים שנלמדו בהרצאות.\n\nשעורי הבית:  שיעורי בית קלילים,לרוב הגדרות מוסגים.\n\nהמבחן: המבחן אינו קשה,יש הרבה שאלות ממוחזרות.\n\nהשורה התחתונה: קורס לא קשה דורש השקעה בינונית -  במהלך הסמסטר.3 ימים של חרישה למבחן מניבה ציון מעולה.", "timestamp": 1615146490295}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יובל שוהם\nחוות דעת - הרצאות: אחלה הרצאות, הוא מאוד קשוב לסטודנטים ורגיש למצב שלנו (שיחרר מוקדם לעיתים או חזר על דברים בלי שביקשו). הרצאות מאוד מעניינות ומרצה נחמד.\n\nשם המתרגל/ת: מיכל סקיטל ואור וילינגר\nחוות דעת - תרגולים: מיכל נתנה את החומר תכלס אבל הרגיש שהיא לא יודעת מעבר, היא לא הגורם שיביא עוד מידע להעשרה. ההגשות שלה היו קלות, פשוט העתק הדבק מהתרגול. אור מקסים וחכם ותמיד מעניין איתו ונותן העשרות והוא מצפה להרבה מהסטודנטים. ההגשות דרשו חשיבה, שזה טוב ומעניין אבל זה היה הפתעה ולא מה שציפינו אליו אחרי שחצי סמסטר היו הגשות מאוד קלות.\n\nשעורי הבית: שעתיים שלוש בגג על כל הגשה. עזרו מאוד לחזור על החומר.\n\nהמבחן: לא קל אבל מאוד הוגן, כלל את כל החומר של הקורס. \n\nהשורה התחתונה: אחלה קורס מבוא", "timestamp": 1644758337167}, {"author": ".,", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יובל שוהם\nחוות דעת - הרצאות: הרצאות עמוסות במידע, אבל מאוד מאוד מעניינות. יובל עובר על החומר במהירות יחסית גבוהה כדי להספיק את הכל, אבל מבחינתי זה היה מצוין (יותר קל להתרכז לדעתי בחומר ככה). ממליצה לא לוותר על ההרצאות.\n\nשם המתרגל/ת: מיכל ואור\nחוות דעת - תרגולים: מיכל מתרגלת את החלק הראשון של הקורס. החלק הזה הוא טכני ברובו, ובהתאם לכך ההסברים בתרגול יחסית טכניים. מיכל טסה על החומר בתרגולים כדי להספיק הכל. לי אישית זה היה מצוין, אבל יש סטודנטים שזה הפריע להם. אור מתרגל את החלק השני של הקורס. הוא פשוט מתרגל מצוין. הוא סופר אכפתי וממש חשוב לו שנבין את החומר לעומק.\n\nשעורי הבית: הסמסטר ניסו איתנו קונספט חדש. כל שבוע-שבועיים קיבלנו כמה שאלות אמריקאיות ושאלה פתוחה. יש מספר ניסיונות בלתי מוגבל לפיתרון השאלות האמריקאיות, ועל השאלה הפתוחה מקבלים 100 כל עוד התשובה מנומקת (גם אם היא לא נכונה). במילים אחרות, מקבלים 100 על הגשת שיעורי הבית, אז ממש חבל לפספס את זה. אם אני לא טועה הש\"ב הם 20% תקף, אז ממש חבל לוותר עליהם.\n\nהמבחן: 20 שאלות פתוחות, חלקן מחולקות לסעיפים. צריך לדעת את החומר של הקורס טוב טוב בשביל להצליח במבחן, כולל חומר שלא תורגל בתרגולים (היו במבחן שלנו לפחות 2 שאלות שבכלל לא דיברנו עליהן בתרגול). הבדיקה במבחן מאוד קפדנית, ומורידים נקודות עם חסרים פרטי מידע, לפעמים גם אם לא היה מצוין בשאלה במפורש שצריך להתייחס אליהם (זה בולט במיוחד בשאלות בחלק של מיכל). הציונים אצלנו לא היו גבוהים במיוחד, אז קיבלנו פקטור נדיב מאוד של תוספת 15% לציון.\n\nהשורה התחתונה: קורס סופר מעניין, לא דורשת הרבה השקעה במהלך הסמסטר מבחינת ש\"ב, אבל מומלץ להשקיע בהבנת החומר תוך כדי הסמסטר כדי להקל על הלמידה למבחן, שכאמור מצריכה למידה של המון חומר לפרטי פרטים.", "timestamp": 1678267970578}, {"author": "אמא אני בטלויזיה", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל שוהם\nחוות דעת - הרצאות: \nבגדול טוב, לא סוחף אבל עובר על הכל ומתעכב שכולם יבינו\nבבירור רוצה בטובת הסטודנטים בהרצאה\n\nשם המתרגל/ת: מיכל\nחוות דעת - תרגולים: \nכל מי שחשב שחבל שאי אפשר לשים אנשים במציאות על 1.5 לא פגש את מיכל. המתרגלת הכי מהירה שראיתי\nהמהירות הגבוהה שלה מאפשר לכסות המון חומר והכריחה אותי להיות מרוכז מה שעזר מאוד בתרגולים.\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: \nאלוהים אדירים איזה משקיען\nאור תותח על, משקיע בטירוף ומסביר מובן ולעניין עם הדגשים הנכונים\n\nשעורי הבית: \nחצי שעה - שעה פעם בשבוע ולא קשורים למבחן\n\nהמבחן: \nמזעזע. מקבלים מהצוות רשימה של כ500 מושגים לשנן וכל המבחן זה 20 שאלות של לפלוט כל מה שיודעים על X\nהדבר הכי מוזר? אפילו יובל המרצה אמר שהוא מצפה שנשכח הכל ברגע שנצא מהמבחן\n\nהשורה התחתונה: \nבמהלך השנה קורס קליל עם צוות אוהב שיגרום לכם להוריד מגנים ואז מכה חזקה בבטן עם מבחן בפורמט שינון בלבד שראוי שיוחלף", "timestamp": 1678471394131}, {"author": "ה", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יובל נראה לי\nחוות דעת - הרצאות: הייתי חלקית, מודה שלא הצלחתי להקשיב ברובן אבל כן שואלים במבחן על דברים שיש רק בהרצאות\n\nשם המתרגל/ת: אור ומיכל\nחוות דעת - תרגולים: שניהם חמודים מאוד ומסכנים שיש להם רק שעה אחת להספיק 55 שקופיות במצגת לכן כדאי לבוא דרוכים וקשובים לתרגול כי הם רצים . הם בכללי חמודים מאוד וקשובים לבעיות/ בקשות של הסטודנטים וכדאי להעזר בהם\n\nשעורי הבית: קלים בצורה קיצונית ולא מייצגים ממש למבחן\n\nהמבחן: אמור להיות קל אבל בסופו של דבר הוא מבחן שינון לכל דבר . תשבו ותשננו טוב טוב כל מילה בסיכום של עדן ניסטור (המלכה) . הם שואלים על כל פרק קטן ומונפץ .\n\nהשורה התחתונה: אחלה קורס, מבחן שינון אז תשננו", "timestamp": 1689426076202}, {"author": "עומר", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יובל שהם\nחוות דעת - הרצאות: \nאני התעניינתי בהרצאות, יובל מעביר את החומר בצורה מובנת, יש דברים שמוסברים יותר בהרצאה מאשר בתרגול אז חשוב ללכת.\nשם המתרגל/ת: אור וינגר ועדן ניסטור \nחוות דעת - תרגולים: היו מעולים, עשו גם חזרה טובה לפני המבחן\n\nשעורי הבית: קלים\n\nהמבחן: היה קצת קטנוני בירידה לפרטים אבל אם משקיעים בלמידה אפשר לקבל ציון טוב\n\nהשורה התחתונה: אחלה קורס, אחד האהובים עליי עד כה", "timestamp": 1714490048855}]}