{"posts": [{"author": "אנונימית", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "מי שחושב שילמד במסגרת המעבדה על ביוכימיה או כימיה של מזון צפוי להתאכזב.\nעבודה מדכאת על דוחות, חישובי שגיאות וחיפוש מחט בערימה של שחת בגוגל סקולר.\nתכינו את עצמם ללילות לבנים עם אפס עניין והרבה תסכול.\nטיפ חשוב - כשאתם שולחים מייל עם שאלות למדריכים חשוב לנסח את השאלות בצורה שלא תאפשר להם להתחמק מלענות לעניין.", "timestamp": 1598222215042}, {"author": "anonymous", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "הקורס הכי גרוע שתתקלו בו במהלך התואר. נקודה שורה חדשה.\nסך הכל היו 4 מעבדות אבל גרמו לי להתחרט על התואר הזה. צוות המעבדה התיחסו אלינו כאילו אנחנו דוקטורנטים וביקשו דו\"חות ברמה מאוד מאוד גבוהה", "timestamp": 1601199404343}, {"author": "Reut laufer", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אסתי ברון הולץ\nחוות דעת - הרצאות: לא היו הרצאות\n\nשם המתרגל/ת: מתרגלת אחראים מיטל\nחוות דעת - תרגולים: רוב התרגולים היו בסדר גמור, אבל בגלל שלא כל התרגולים עם על ידי אותו מתרגל חלקם היו לא ברורים\n\nשעורי הבית: הדוחות ארוכים וקשים \n\nהמבחן: \n-\nהשורה התחתונה: \nעמוס", "timestamp": 1626693397055}, {"author": "אני", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "מעבדה אחת לשבועיים שצריך ללמוד לפניה כדי להצליח בבחן בתחילת המעבדה, על המעבדה צריך להגיש דוח מסכם, סה\"כ 6 דוחות. נשמע שיותר קליל מזה לא יהיה נכון? אז זהו שלא :( המעבדות מאוד מעניינות לדעתי, ממש נוגעות בנושאים שנלמדו עד עכשיו - אתם תתנסו בהרצת חלבונים בג'ל אלקטרופורזה, תבחנו מהירויות ריאקציות, תבדקו באיזה מזונות יש יותר ויטמין C, תסווגו סוכרים ועוד. המעבדות נחמדות והסגל מאוד עוזר וסבלני אבל המעבדה עצמה מאוד ארוכה ומתישה בעיקר בגלל העובדה שאין הפסקות מסודרות (אפשר כמובן לצאת לשתות ולשירותים) אבל בפועל כמעט ולא יוצאים כדי לסיים את המעבדה בזמן ולכן אלה 5 שעות אינטנסיביות ומתישות למדי. הדוחות מאוד קשים בעיקר בדוחות הראשונים, צריך ללמוד לבצע את החישובים המעיקים, לחפש הרבה יותר מדי מקורות ספרות בגוגל סקולר ולכתוב דיון ברמה שלא תבייש עבודת דוקטורט. בניקוד הדוחות ההרגשה הייתה שחיפשו להוריד נקודות על שטויות, כל אי דיוק הכי קטן יורדת נקודה. לגמרי אפשרי לקבל ציון טוב אבל דורש המון השקעה שגוזלת זמן יקר בטירוף משאר המקצועות. לי באופן אישי כל דוח יחד עם השותפה לקח להערכתי כיומיים-שלושה של עבודה אינטנסיבית ושבועיים לשיפצורים.\n\nהשורה התחתונה: אפשר לקבל ציון טוב, דורש הרבה מאוד השקעה, העצה הכי מועילה שתקבלו - תתארגנו על שותף שהוא גם חבר, בנאדם שאתם סומכים עליו ויודעים שישקיע לא פחות ממכם. בהצלחה!!", "timestamp": 1627977123021}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "מעבדה נוראית משעממת ומעייפת. צריך להשקיע מלא זמן בכתיבת הדוחות (ימים שלמים) ובבדיקה מורידים נקודות על כל שטות. בתחילת כל מעבדה יש בוחן שצריך להתכונן אליו ברצינות, לא כדאי לזלזל בבחנים האלו כי יש להם משקל די גדול בציון הסופי. \nכל תרגול הוא עם מתרגל אחר והרוב לא יודעים להסביר את החומר בצורה ברורה", "timestamp": 1631875196081}, {"author": "*", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: לא היו הרצאות היה תרגול פעם בשבועיים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלכל מעבדה היה מתרגל אחר שהיה אחראי עליה. חלק הסבירו את החומר יותר טוב חלק פחות והייתה אחת שלא ידעה מה היא עושה.\n\nשעורי הבית: \nהמתרגלים דרשו דוחות ברמה גבוהה, הם היו קטנוניים בבדיקה. כל דוח לוקח המון זמן תתכוננו לכתוב דוחות במהלך כל הסמסטר הזה כי זה מה שתעשו. \nלפני המעדה צריך ללמוד לבוחן מעבדה כי יש לו משקל גבוה בציון הסופי. \n\nהמבחן: \n\nהשורה התחתונה: \nקורס מעבדה נוראי. כל הסמסטר כתבתי דוחות בלי ללמוד לשום דבר אחר. אם תמצאו את האיזון ספרו לי", "timestamp": 1635276049592}, {"author": "בושה וחרפה", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא היו\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהיה תרגול פעם בשבועיים\nשעורי הבית: \nהדבר הכי נוראי שיש \nהמבחן: אין\n\nהשורה התחתונה: \nהתנהלות מביישת ומזלזלת של כלל סגל הקורס בניצוחו של בועז מזרחי אחראי הקורס. בועז לא מגיע למעבדות בכלל ומגלה 0 התחשבות בסטודנטים. \nהקורס לא מלמד כלום ופשוט מתייחסים לסטודנטים כמו אל חיילים בטירונות. מנסים ללמד דרך הפחדה ולא דרך לימוד החומר. כלל המתרגלות מתנהגות בזלזול וחוסר כבוד. \nהקורס הזה הוא דוגמא חריפה לזלזול בזמן הסטודנטים ולאטימות של המערכת.\nלא מומלץ בלשון המעטה!!!", "timestamp": 1657185437343}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: -\nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: כל מעבדה מתרגלת שונה\nחוות דעת - תרגולים: היו עוברים על נושא המעבדה בתרגול על נקודות חשובות ודגשים.\n\nשעורי הבית: -\n\nהמבחן: -\n\nהשורה התחתונה: דוחות משוחזרים משנים קודמות אבל הציוד שמשתמשים בו שונה, קשה לקבל ציון 90+ בדוחות, מסתכלים על דברים ממש קטנים ואין להם משמעות.\nמעבדה פעם בשבועיים, מתרגלות נחמדות ועוזרות תוך כדי המעבדה, תבוא למעבדה מוכנים ורגועים והכל יהיה סבבה.\nיש בוחן בתחילת כל מעבדה, ממליץ להשקיע ולקבל ציון בבחנים כי הם מהווים משקל טוב מהציון הסופי.", "timestamp": 1658139829877}, {"author": "ה", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "השורה התחתונה: מעבדה עמוסה מאוד, כרגיל שקר הנק\"ז, אתה משקיע את כל נשמתך בהכנה למעבדה, להיות המעבדה או לכתוב את הדו\"ח מעבדה ומקבל על זה נק\"ז של מל\"ג .. פשוט תעשו כל מה שצריך ותשתמשו בדו\"חות מהדרייב", "timestamp": 1692522540848}]}