{"posts": [{"author": "אני", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יואב ליבני\nחוות דעת - הרצאות: הרצאות קצת משעממות אבל אפשר לעקוב, יואב מנסה לגוון עם הרבה סרטונים, זה נחמד. יש בונוס 10 נקודות לציון הסופי לכל מי שעושה שני סרטונים, זה לא קשה והרבה לא עשו את זה מעצלנות וממש פיספסו (במיוחד בהתחשב בזה שהמבחן בסמסטר שלנו היה ממש קשה), ממליצה לעשות את הסרטונים, לגמרי שווה את זה!\n\nשם המתרגל/ת: ירדן ואורן\nחוות דעת - תרגולים: מתרגלים פצצה, מסבירים בקצב טוב ובצורה ממש ברורה.\n\nשעורי הבית: לא קלים, אבל תורמים להבנה\n\nהמבחן: לא פשוט בכלל, שווה ללמוד טוב טוב\n\nהשורה התחתונה: קורס לא קל, קצת מרגיש כמו שידור חוזר של כימיה פיסיקלית (אבל אולי קצת יותר נחמד), בהצלחה!", "timestamp": 1653149098534}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יואב ליבני\nחוות דעת - הרצאות: הרצאות די מונוטוניות, אבל אם נכנסים לזה החומר באמת מעניין ושווה להקשיב. מה גם שבמבחן עצמו יש שאלות שנוגעות לדברים שיותר עוסקים בהרצאה.\n\nשם המתרגל/ת: אורן וירדן\nחוות דעת - תרגולים: מתרגלים מקסימים ובאמת מנסים כמה שיותר להספיק ולהסביר לעומק את התרגילים. מאוד תגובתיים למיילים.\n\nשעורי הבית: מסכמים טוב את החומר שווה לעשות אותם ולא לסמוך על השותף להגשות\n\nהמבחן: תבואו מוכנים עם חומר פתוח טוב כי השאלות לא תמיד טכניות\n\nהשורה התחתונה: קורס חובה אבל אם הנושא מעניין אפשר ללמוד הרבה", "timestamp": 1676966524680}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דן ברכה\nחוות דעת - הרצאות: מאוד מונוטוני והחומר קשה ולעיתים משעמם אז קשה היה לעקוב.\n\nשם המתרגל/ת: עדי וקרוליין\nחוות דעת - תרגולים: שתיהן מסבירות טוב אבל דחסו את כל התרגולים הקשים עם כל כך הרבה תרגילים להספיק שלא היה זמן להתעכב להסברים על החומר. בתרגולים שלא היה דחוס היו הסברים מאוד טובים.\n\nשעורי הבית: כל שבוע יש הגשה, מאוד עמוס בסמסטר וקשה למצוא זמן כמעט לדברים. התרגילים עצמם קשים, דורשים השקעה וחשיבה. לוקחים כמה שעות לפחות. לרוב לשתי שאלות יש רפרנס, אבל אם לא מנסים אותן לבד אז החומר לא מתיישב טוב.\n\nהמבחן: מבחן קשה דורש הבנה עמוקה של החומר ולא מספיק ריכוז של נוסחאות. לוקח זמן להבין מה הכוונה שלהם ולאן צריך ללכת בחומר. יש חומר פתוח בלי תרגילי בית ובלי מבחני עבר.\n\nהשורה התחתונה: קורס קשה, דורש הרבה העמקה, תשקיעו לאורך הסמסטר!", "timestamp": 1715627105876}, {"author": "ה", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דן ברכה\nחוות דעת - הרצאות: לא הייתי, הרגיש לי מיותר\n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: חשובים מאוד, ממליצה להגיע לכולם\n\nשעורי הבית: 2 שאלות ממוחזרות ואחת חדשה . השיעורים אמנם חשובים להבנת החומר ואני ממליצה שתעשו לבד (ורק תגישו את של אחד מבני הזוג) אבל זה סמסטר קשה- תרפרנסו עם הבנה (ואם אתם לא מבינים משהו תתעקשו)\n\nהמבחן: קשה, אין לדעת מה יפול עליכם במבחן . ממליצה לעבוד על החומר פתוח שלכם לאורך כל הסמסטר ולהכיר אותו לעומק, זה יעזור . תיגשו למבחן אמצע .\n\nהשורה התחתונה: תרפרסנו שיעורי בית עם הבנה, תגשו למבחן אמצע, תלמדו חזק למבחן סוף עם חומר פתוח טוב ותקוו לטוב", "timestamp": 1716812631001}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nפחות חשובים מהתרגולים אבל לדעתי כן חשוב להיות בהן כי זה עוזר להבין את החומר יותר\nשם המתרגל/ת: עדי שלם וקרוליין \nחוות דעת - תרגולים: \nחשובים ועוזרים לפתור תרגילי הבית\nשעורי הבית: \n3 שאלות ששתיים מהם רפרנס ואחת חדשה, הן קצת קשות ודורשות המון שעות לסיים אותם אבל זה שווה כי עוזר בלהבין את החומר\nהמבחן: \nלא קשה מדיי אבל גם לא קל. לפתור תרגולים, תרגילי בית ומבחנים משנות קודמות ויהיה בסדר\nהשורה התחתונה: קורס לא קל, אבל ניתן לקבל בו ציון אם משקיעים בו בסמסטר ובלמידה למבחן. \nהקורס מורכב מ-40% מגן: שיעורי בית ובחן, ו-60% מבחן סופי. כדי להשקיע בה-40% כי זה מקפיץ לכם את הציון בסוף", "timestamp": 1717225167835}]}