{"posts": [{"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניצן פוריה\nחוות דעת - הרצאות: ההרצאות של ניצן מצד אחד מרתקות, מצד שני קשה לעקוב, אצלינו ההרצאה הייתה ב16:00 וזאת כבר לא שעה שקל להתרכז בה.\n\nשם המתרגל/ת: נופר וצילה\nחוות דעת - תרגולים: צילה קצת יותר ברורה מנופר, נופר מסבירה טוב סך הכל ומאוד זמינה לשאלות אבל החומר קשה ולא פשוט להבין הכל בתרגול.\n\nשעורי הבית: לא קלים בכלל, דורשים מחשבה אבל הם לגמרי ברמת מבחן.\n\nהמבחן: בעיני לא קל, שאלות מאתגרות \n\nהשורה התחתונה: קורס קשה אבל מעניין מאוד", "timestamp": 1653148852577}, {"author": "גטסבי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צחי \nחוות דעת - הרצאות: \nהרצאות ממש מענייינות, חומר שממש חשוב להמשך התואר, המרצה הייתה הפעם הראשונה שמעביר הקורס. הייתה מצגות רק תמונות והוא היה מסביר הכל, היה הקלטות של סאונד בלי תמונה. אז ממש ממליץ ללכת להרצאות ולכתוב מלא הערות כי לא היה סיכום. ההרצאות ממש חשובות.\nשם המתרגל/ת: נופר\nחוות דעת - תרגולים: \nמתרגלת מעולה, ממש עוזרת. ממליץ ללכת לתרגולים כי היא ממש מבינה החומר לעומק. ממליץ לשאול מלא שאלות וללכת לשעות קבלה.\nשעורי הבית: \nהגשת תרגילי בית.ו 4 משימות מי שמגיש היה מקבל בונוס על הציון הסופי.\nהמבחן: \nהיה 5 שאלות פתוחות כל שאלה מ 3-4 סעיפים. הייתה שאלה אמירקאית אחת . קיבלנו 5 נק פקטור במבחן. קיבלנו חתי שעה תוספת זמן. מ 2.5 שעות ל 3 שעות. היה חומר פתוח אבל בלי שאלות מהתרגול או תרגילי בית.\n80% מבחן סופי, 20% משימות.\nהשורה התחתונה: \nקורס ממש מגניב עם חומר מעניין מאוד. קשה להבין אבל כיף ללמוד.", "timestamp": 1676728063719}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה:ד\"ר צחי רייזל\nחוות דעת - הרצאות: בהתחלה היה קצת קשה לעקוב, החומר הוא לא קל ולכן צריך להיות בקשב. לאורך הסמסטר היה שיפור בהרצאות והמצגות היו יותר מתומללות. ממליצה לבוא לכל ההרצאות ולסכם על גבי המצגות.\n\nשם המתרגל/ת: יארא זיבק/ נופר יהודה\nחוות דעת - תרגולים: התרגולים מאוד תרמו להבנת החומר, הסמסטר התחלק בין יארא לנופר. שתיהן העבירו את התרגולים בצורה מאוד ברורה והביאו הרבה דוגמאות להבנה של החומר. מאוד חשוב לבוא לתרגולים כי לפעמים בהרצאה לא מבינים את הדברים והתרגולים עושים סדר.\n\nשעורי הבית: שיעורי הבית לא היו חובה אבל מומלץ לעשות אותם כדי להצליח לעקוב אחרי חומר הקורס ולהבין את הדרישות. היו 4 שיעורי בית למגן הגשה בזוגות והיו גם תרגילי בית ללא חובת הגשה ביחידים. \n\nהמבחן: המבחן לא קל, היה חומר פתוח אבל נדרשה הבנה של החומר וידע ליישם. \n\nהשורה התחתונה: קורס מעניין לומדים הרבה דברים מאוד רלוונטיים. החומר קשה, חשוב להשקיע במהלך הסמסטר ולבוא להרצאות ולתרגולים כדי לעקוב אחרי החומר.", "timestamp": 1679166658729}, {"author": "אינדוסבילי, קונסטיטוטיבי ומה שביניהם", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: צחי רייזל\nחוות דעת - הרצאות: פעם שנייה שצחי מעביר את הקורס. יכול להיות שהופקו לקחים מהפעם הקודמת, אבל המצגות והחומר היו קשים להבנה יחסית. בהתחלה כן הייתה תשומת לב ודגש על מושגים חדשים (שזה מעולה), אבל בהמשך הקורס ניתן קצת פחות דגש עליהם ודגש חלקי על דברים פחות חשובים. כל מיני \nטבלאות מסכמות על שיטות, ביקורות, במה ומתי משתמשים היה עשוי להיות מועיל ביותר. מעבר לזה - להשתמש כל הזמן במונחים לועזיים עוד יותר תורם לתחושת ה\"ללכת לאיבוד\", כי גם ככה זה מקשה על ההבנה (למרות שמשתמשים במושגים האלה בצורה נרחבת, כמו אינדוסבילי וכו').\n\nשם המתרגל/ת: שלומי אדרי (חצי ראשון), נופר יהודה (חצי שני) ודורית הירשברג (בודקת שיעורי בית + בחנים ומבחנים)\nחוות דעת - תרגולים: אין לי מושג מה קרה עם המתרגלים הסמסטר, אבל נראה שהיה מחסור בדוקטורנטים להוראה. שלומי הסביר את החצי הראשון של הקורס (הפשוט יותר). היה מעט יותר מסודר מנופר לדעתי, אבל אחרי התרגולים שלו הוא נעלם ולא שמענו ממנו יותר. לגבי נופר - רואים שהיא יודעת את החומר, אבל להרגשתי - צורת ההעברה של החומר לוקה בחסר. בסך הכל תרגול אמור לבוא ולחדד דברים חשובים יותר שנאמרו בהרצאה, ואולי גם להרחיב על דברים נוספים מעבר. במצגות של נופר הרקע ניתן הרבה יותר בעל פה, וגם בקצב מהיר. כמעט בלתי אפשרי לכתוב את הכל (כי זה לא כתוב במצגת שלה) ויחד עם זאת להבין, וככה פשוט נשארים בחצי השני של התרגול עם פה פתוח בתדהמה של \"מאיפה היא הביאה את זה\". בנוסף, בחלק מהשאלות - הפתרון מאוד תמציתי, ואם היה מוסף הסבר נוסף - אולי זה היה עשוי לשפר את ההבנה.\n\nשעורי הבית: הזויים ברמות קשות ביותר. בהתחלה עוד איכשהו פתירים (והכוונה לתרגילים 1-2 מתוך 9), ואחר כך אתם לא מבינים מאיפה הגיעו לכל המגילה הזאת (משאלה של 3 שורות מרחיבים חצי עמוד - הגיוני סך הכל). ועל אף התיאורים הארוכים - מקשים על ההבנה ותורמים מעט למענה על המבחן.\nיש שני בחני אמצע מגנים, קצת יותר עוזרים בהבנה של איך נראית שאלת מבחן, אבל רמת הניסוחים די מזעזעת (ברמת סימני פיסוק). בבוחן השני נעשה שיפור, אבל עדיין מבלבל ביותר.\n\nהמבחן: דווקא היה סביר ביחס לתחושה הכללית מהקורס, אבל רק לאחר שקראתי 3 (!) סיכומים שונים, כמעט מבלי להסתמך על ההרצאות ו/או התרגילים (שכאמור, בנויים לא טוב לדעתי), הרגשתי שאני על החומר, לפחות חלקית. חוץ מזה, המבחן היה מתוך 110 נקודות (שני סעיפי בונוס של 5 נקודות כל אחד), ובסעיף אחד ניתן לכל הסטודנטים ניקוד מלא (עקב מענה לא נכון של רוב הסטודנטים), כשהבעיה הגדולה הייתה שדורית וצחי לא היו מסונכרנים מבחינת פירוש של אחת מהשאלות, כך שדורית ענתה תשובה אחת, כעבור רבע שעה צחי משנה לכולם את התשובה למשהו אחר, וכעבור עוד רבע שעה הוא נכנס בשביל לומר שצריך לענות חצי לפי מה שהוא אמר והחצי השני לפי איך שדורית אמרה. מזה אפשר להסיק שלא היה סנכרון עוד מלפני המבחן בנוגע לאופן המענה על השאלות, עוד פרט שמעיד על התנהלות לא נכונה. לפחות צחי הוסיף עוד חצי שעה לפתרון המבחן, אבל בתחושה הכללית - זה לא מצטייר כאחראי, לדעתי. \n\nהשורה התחתונה: מצד אחד - החומר של הקורס כן מאוד מעניין, ולדעתי חשוב מאוד להמשך (התואר/התעשייה). מצד שני - זה הרגיש כמו אחד הקורסים הכי קשים שלקחתי בטכניון, בעיקר בגלל הזמן שדרוש להבנת החומר וחוסר היכולת להבין מה רוצים ממני. מאוד מתסכל, במיוחד גם שאין כמעט דרך לתרגל למבחן, כי לא מפורסמות שאלות חזרה (רק הבחנים).", "timestamp": 1716412995094}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ד\"ר צחי רייזל\nחוות דעת - הרצאות: מרצה מעולה, מסביר בצורה טובה, נעימה וברורה. ההרגשה הכללית בכיתה היא שההבנה של הסטודנטים חשובה לו.\n\nשם המתרגל/ת: נופר ושלומי\nחוות דעת - תרגולים: התרגולים בעיניי עזרו להטמעה של החומר והיו חשובים. אם יש שעה של תרגול אל מול 3 שעות של הרצאה כל שבוע אז מן הסתם שהתרגול יהיה עמוס ובקצב מהיר, אבל עם השקעה ואחרי זה מעבר נוסף על ההקלטה של התרגול אני חושבת שזה תרם מאוד להבנה. בתרגולים בפעם הראשונה נתקלנו ביישום החומר התיאורטי שנלמד בהרצאות, אבל אין טובה מנופר כדי לרכך את המעבר הזה ולהסביר כל אי הבנה קטנה כדי שכל סטודנט יבין ויצליח לעקוב בין אם זה תוך כדי התרגול/ במייל/ בשעת קבלה.\n\nשעורי הבית: בחצי השני של הקורס הם ללא ספק עלו רמה אבל עם השקעה והתעמקות בחומר הם אפשריים. \n\nהמבחן: הוגן מאוד, הבנה אמיתית של החומר היא קריטית, וגם מאוד עוזר סיכום טוב וסידור של החומר בצורה נוחה אז חשוב להיות על זה במהלך הסמסטר. \nהיו גם שני בחני מגן במהלך הסמסטר שעליי אישית אפילו לא הגנו אבל הם ללא ספק עזרו לי להתכונן למבחן בצורה טובה יותר אז כדאי לא לוותר עליהם בעיניי.\n\nהשורה התחתונה: אין ספק שהקורס עמוס בחומר ושגם החומר עצמו לא הכי קל להבנה בשמיעה או בקריאה ראשונית, אבל גם אין ספק שזה הקורס שהכי עניין ולימד אותי בתואר עד כה. \nבלי אחריות אישית שכרוכה בהשקעה, כמובן שלא יהיה קל להצליח אבל עם השקעה במהלך הסמסטר ולא רק לפני המבחן אפשר להצליח ואפילו בגדול. \nהסגל של הקורס היה מדהים ותמיד היה מוכן לעזור והאווירה הכללית הייתה טובה. \nממליצה לפי מה שנוח לכל אחד לשמוע יותר מפעם אחת את ההרצאות והתרגולים/ לכתוב הערות תוך כדי ואז לסכם/ לקבוע שעות קבלה תוך כדי הסמסטר אם משהו לא מובן/ להכין בעצמך את הטבלאות המסכמות עם הביקורות- ואז אפשר ממש להצליח :)", "timestamp": 1719318432491}]}