{"posts": [{"author": "גלעד בר", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שמות המרצים: אורי לזמס ודפנה פסקוביץ'\n\nחוות דעת - הרצאות: היה מאוד מעניין ומעשיר! בחצי הראשון של הסמסטר מדברים על הנדסת מזון, באמצע מתחילים לדבר על פרויקט הפוסטרים (המבחן), ובמחצית השנייה מדברים על הנדסת ביוטכנולוגיה.\n\nבפרויקט הפוסטר מחולקים לקבוצות, ובסוף הסמסטר מציגים פוסטר שמציג פתרון לבעיה בתחום המזון/פתרון ביוטכנולוגי לבעיה מסויימת. אתם צריכים לחשוב על רעיון בעצמכם, אבל אפשר לשאוב השראה ממקורות אחרים.\n\nאמנם יהיו הרבה מושגים שעדיין לא תכירו, אבל לפחות זאת הצצה ראשונית לתחום הנדסת הביוטכנולוגיה והמזון\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: בעיקרון אין, אבל יש את הפוסטר, שלפעמים דורש הרבה שעות של חיפוש אחרי מידע שאתם לא מכירים, אבל אפשר להתמודד עם זה\n\nהמבחן: שנה ראשונה שהצגת הפוסטרים מתבצעת בזום - כל קבוצה קיבלה בערך 10 דקות להצגת הפוסטר. בסך הכל היה ממש בסדר, כן מומלץ לחשוב על נקודות תורפה בפוסטר, כי יכולים לשאול על זה, וכדאי להכין תשובה מראש.\n\nהשורה התחתונה: הקורס די חוויתי, אבל למצוא רעיון לפוסטר היה אחד הדברים היותר מתישים שאפשר לחוות בסמסטר ראשון, כי ברוב הפעמים - או שהרעיון שמצאתם לא כל כך בר ביצוע, או שכבר חשבו עליו. אבל, מהרגע שמצאתם רעיון, הכל יזרום לכם הרבה יותר בקלות.", "timestamp": 1612254648870}, {"author": "Lidor Bibi", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nאורי למזס ודפי חוות דעת - הרצאות: \nמעניינים ומחברים לפקולטה של ביוטכנולוגיה ומזון\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nאין\nהמבחן: \nפוסטר מדעי בנושא ביוטכנולוגיה או מזון ומציגים אותו בפני המרצים \nהשורה התחתונה: \nקורס מעניין בלי חובת הגעה", "timestamp": 1613375275587}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אורי לזמס\nחוות דעת - הרצאות: \nאין חובת נוכחות ברוב ההרצאות, חלקן מעניינות אבל התחושה היא שזה קורס שנותן טעימה מעולם הביוטכנולוגיה מבלי באמת ללמד משהו לעומק.\n\nשעורי הבית: אין.\n\nהמבחן: אין מבחן, יש הצגה של פוסטר מדעי בנושא לבחירתנו (בקבוצות אקראיות). התחושה הייתה שהניקוד היה רנדומלי, ולא קיימים פרמטרים ברורים לציון שקיבלנו, או דרישות קונקרטיות למה היה אמור להיות מוצג בפוסטר. במהלך ההצגה המרצה שואל שאלות על הפוסטר (ולפעמים השאלות אקראיות ולא מאוד קשורות לנושא ההצגה). בסופו של דבר המון קבוצות השקיעו בפוסטר זמן רב, והתאכזבו לקבל ציון נמוך מ90 על אף ההשקעה.\n\nהשורה התחתונה: \nלא מומלץ למי שלא לומד במסלול ביוטכנולוגיה, לא לקחת כבחירה חופשית.", "timestamp": 1614076998609}, {"author": "Chen Gal", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רועי עמית, אורי לזמס\nחוות דעת - הרצאות: בסדר סך הכל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הציון היה מורכב רק מעבודה אחת לא ברורה בקבוצות של ארבעה שחולקו רנדומלית על ידי המרצים\n\nהמבחן: \n\nהשורה התחתונה: קצת מיותר", "timestamp": 1647698354731}, {"author": "עדן הוכלר", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי ורועי\nחוות דעת - הרצאות: רועי- חזר על אותו חומר במשך 4 הראות בערך, המצגות באנגלית ולא מכילות כל כך חומר, היה נראה שלא מתייחס לקורס ברצינות כל כך. אורי- היה יותר מסודר ומאורגן במצגות, היה נראה שמתייחס לקורס יותר ברצינות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: יש פרויקט- הציונים היו לא ברורים כי זה לשיקול דעת המרצה, הרגיש כאילו סתם המציאו ציונים. הציונים היו לא נמוכים (85-95 וקבוצה אחת של מאה)\n\nהשורה התחתונה: קורס לא עמוס בכלל, הפרויקט בקבוצות שהמרצים חילקו מראש - יכול להיות לא מוצלח במיוחד או ממש סבבה- תלוי במזל.", "timestamp": 1648457970080}, {"author": "אושרת חניא", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רועי ויפעת\nחוות דעת - הרצאות: \nההרצאות של יפעת מעניינות (מתוך העדפת תחום המזון:)\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1672135568163}, {"author": "-", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי ויפעת\n\nחוות דעת - הרצאות: \nהאמת שבאיזשהו שלב הפסקתי ללכת. אין נוכחות חובה (חוץ משתי הרצאות) ומה שמועבר בהרצאות נותן טעימה של התחום (ביוטכנולוגיה אצל רועי ומזון אצל יפעת). אם יש זמן אפשר ללכת, אם אין- לגמרי אפשר לוותר.\n\nשעורי הבית: אין\n\nהמבחן: \nאין מבחן, יש עבודה קבוצתית של הצגת פוסטר (חצי מציגים על ביוטכנולוגיה וחצי על מזון). הקבוצות מחולקות רנדומלית אז יכול להיות שתהיו עם קבוצה טובה ויכול להיות שפחות, תלוי במזל. העבודה על הפוסטר יכולה לקחת זמן ולהיות קצת מעיקה (לחפש רעיון, לעצב את הפוסטר ולחלק את העבודה בין כולם) אבל הציונים בסוף היו מאוד גבוהים ככה שזה קורס שבהחלט יכול להעלות ממוצע.\n\nהשורה התחתונה: \nאין השקעה במהלך הסמסטר, מצד שני גם ההרצאות די מיותרות. אבל זה קורס חובה ככה שאין ברירה- לפחות הציונים גבוהים.", "timestamp": 1677596686066}, {"author": "ביו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יפעת\nחוות דעת - הרצאות: מאוד עוזר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678129449551}, {"author": "nitzanL", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עמית רועי\nחוות דעת - הרצאות: לא התחברתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: פרויקט, הכל תלוי עם מי אתם כי זה הגרלה, תכלס chat gtp יכול לעשות את העבודה\n\nהשורה התחתונה: תהנו עם עוד 2 נקז", "timestamp": 1679222941256}, {"author": "L", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי ועמית\nחוות דעת - הרצאות: \nההרצאות ללא נוכחות חובה מלבד 3 בהם דיברו על הפוסטר\nבשאר ההרצאות דיברו על דברים שקשורים לתואר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אין\nיש פוסטר\n\nהשורה התחתונה: \nהפוסטר לוקח די הרבה זמן אבל למדנו מזה הרבה\nיש גם הוצאה כספית לא גדולה על הדפסת הפוסטר \nותחרות בין הפוסטרים", "timestamp": 1713527500390}, {"author": "ביוטכנולוג", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצים: רועי ואורי\nחוות דעת - הרצאות: ממליץ להיכנס להרצאות ולשמוע מאחר שהן נותנות רקע כללי לקראת המעבדות והקורסים שאנו עתידים ללמוד ולהעמיק בהם בהמשך התואר. מעבר לזה יש הרצאה אחת חשובה שבה מראים איך לזקק מידע חיוני ממחקרים, ועוד איזה הרצאה וחצי שהן נטו על הפוסטר.\n\nהפוסטר: דורש הרבה עבודה, וזה נופל בעיקר על השליש האחרון של הסמסטר. אבל יש תחושת סיפוק והרגשה שבאמת למדתי משהו מכל התהליך וההעמקה בנושא.\n\nיום הצגת הפוסטרים: מאחר שהיינו הרבה קבוצות אז המרצים לא יכלו לעבור על כולם. בעקרון יש 2 נושאים: ביוטכנולוגיה של רועי, ומזון של אורי. נניח שיש 28 קבוצות: 14 ביוטכנולוגיה ו14 מזון. אז שתדעו שהמרצים ככל הנראה יעברו על הפוסטרים מ7 הקבוצות הראשונות מכל נושא, ועל ה7 האחרונות מכל נושא יעבור אתכם עליו איזה חבר צוות אורח מהפקולטה. אם אתם נופלים עם האורח אז הסיכוי שלכם להיות מעל לחציון די נמוך. חלוקת הציונים היא לפי פעמון גאוס כאשר רק קבוצה אחת מקבלת 100. רק תקוו שהמרצים יכריזו על הפוסטר שלכם כראוי לשבח כאנחת רווחה שקיבלתם ציון גבוה, מאחר שהציונים מגיעים מאוד מאוחר...\n\nהשורה התחתונה: התוכן מרתק, הביצוע חוויתי ומקנה ידע, קורס תחרותי, השיפוט לא מוצלח במיוחד.", "timestamp": 1713726548507}, {"author": "אנונימית 3>", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורי ורועי\nחוות דעת - הרצאות: מיותרות לחלוטין ולדעתי משעממות, אני בתכלס מתחרטת שלא התחלתי לא להגיע אליהם יותר מוקדם בסמסטר. יש רק 3 חשובות ש 2 עם נוכחות חובה ואחת שעובדים על הפרוייקט. \n\nשעורי הבית: אין\n\nהמבחן: הפרוייקט די מעיק בסוף הסמסטר בשיא של כל שאר ההגשות גם, לוקח כמה שעות לחפש מידע וממש תעדיפו לעשות משהו יותר חיוני מזה אבל בסוף כשיודעים מה רוצים לשים בפוסטר זה די מהר, אבל ממש טוב שנפתרים מזה לפני תקופת המבחנים.\n\nהשורה התחתונה: קורס חובה למי שלוקח אז אין מה לעשות אבל בתכלס בתקופת המבחנים ממש טוב שאין לך עוד מבחן לדאוג לגביו. הציונים גבוהים בין 86 ל99 היה הסמסטר אבל בכנות לא ברור איך הם מחליטים על ציון כי באמת שכל פוסטר על אותה רמה טובה וכולם חקרו והשקיעו על הנושא שלהם אבל הציונים מאוד שונים בקטע הזה.", "timestamp": 1714595294092}, {"author": "Shahar", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רועי או אורי\nחוות דעת - הרצאות: זמן נמנום טוב\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין, יש פרוייקט, עובדים בקבוצות של 4-5, מקבלים ציונים טובים. \n\nהשורה התחתונה: לא לדאוג", "timestamp": 1716829275996}, {"author": "בני", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שעתיים בשבוע הרצאה על הנושא. \nאין שיעורי בית, יש \"\"\"נוכחות חובה\"\"\", אין מבחן, מחלקים אתכם לקבוצות וכל קבוצה עושה פוסטר מדעי (על מזון או על נוגה), סביר להניח שתקבלו 90", "timestamp": 1718764238968}]}