{"posts": [{"author": "ד.", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דגנית\nחוות דעת - הרצאות: בסך הכל לדעתי הנוכחות בהרצאות תורמת, אבל ההרצאות עצמן נורא מבולגנות, עמוסות ומערבבות עיקר וטפל, ההמלצה שלי היא לעבור על המצגות פעם או פעמיים לפני ההרצאה כדי לשמור על סדר הדברים במהלך ההרצאה.\n\nשם המתרגל/ת: אור וילינגר\nחוות דעת - תרגולים: מתרגל מדהים אם הוא מתרגל אתכם אז זכיתם\n\nשעורי הבית: יש גיליון כל שבוע עם תרגילים קשים מאוד, אבל מעבר לזה שזו הכנה טובה למבחן זה גם בדרך כלל ציון תקף אז לא כדאי לא להכין..\n\nהמבחן: לא פשוט, תמיד יש הפתעות\n\nהשורה התחתונה: קורס קשה ועמוס, מומלץ לעשות הכל \"לפי הספר\" ולא ללמוד עצמאית לפני המבחן בלבד", "timestamp": 1598221431403}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דגנית דנינו\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  אור וילינגר\nאחלה של מתרגל, מסביר היטב את החומר. בסמסטר שלנו הוסיפו גם שעה שבועית של \"סדנא\" על מנת לעזור עם שיעורי הבית\nשעורי הבית:  לוקחים בין 3-10 שעות שבועיות, תלוי בנושא. לא קלים בכלל\n\nהמבחן: \n3 שאלות פתוחות, לא קל בכלל\nהשורה התחתונה:  קורס מעניין וקשוח, אבל בעזרת ש\"ב ובונוסים שנאספו מהבוחן אמצע אפשר לקבל ציון סופי טוב.", "timestamp": 1602510595047}, {"author": "סטוקס", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דגנית דנינו\nחוות דעת - הרצאות: מעודדת שאלות אבל מסבירה לא כל כך ברור. התרגולים תרמו לי הרבה יותר להבנה מההרצאות.\n\nשם המתרגל/ת: אור ווילינגר\nחוות דעת - תרגולים: המתרגל הכי טוב שנתקלתי בו בטכניון. מסביר מצוין, זמין כל הזמן לשאלות ומתעקש שהסטודנטים יבינו. משקיע מאוד ואכפתי, עוזר גם בשיעורי בית ושווה להגיע לסדנאות.\n\nשעורי הבית: עמוסים מאוד, דורשים יומיים שלמים. תמיד יש 2 שאלות משנים קודמות עם רפרנס ושאלה אחת חדשה. \n\nהמבחן: \n\nהשורה התחתונה: קורס עמוס מאוד, וגם מעניין מאוד.", "timestamp": 1603013428258}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דגנינו\nחוות דעת - הרצאות: ההרצאות משעממות מאוד אין קשר בין ההרצאות לשיעורי בית. כמו כן המרצה לא ברורה בעליל לא יודעת להסביר כלום ובנוסף גם לא עונה לשאלות ומצפה שאנחנו נענה אחד לשני, מלבד זה המרצה החליטה שדלתא זה התחלה פחות סוף משתמע מכך שגם מתמטיקה היא אינה יודעת. בקיצור הרצאות מאוד לא טובות שווה לעבור על המצגות בלבד וגם זה בזבוז זמן.  \n\nשם המתרגל/ת: דני ענבר ולאוניד \nחוות דעת - תרגולים: \nענבר העבירה את החומר בצורה טובה יחסית הייתה נכונה לענות על שאלות וגרמה להבנה של הסטודנטים. לאוניד ודני העבירו חומר קצת יותר קשה ועדיין דאגו לענות על כל השאלות גם אם חזרו על עצמן אך בסדנא היינו צריכים ללחוץ מאוד על מנת לקבל פיסת מידע הם אינם הבינו שהגענו על מנת ללמוד ולדעת איך לפתור בדרך הנכונה אחרי שהשענו לא מעט שעות לבדנו בניסיון לפתור את תרגילי הבית. סך הכל מתרגלים טובים\nשעורי הבית: 2 תרגילים ממוחזרים ואחד חדש. שיעורי הבית היו עמוסים מאוד, ודרשו ישיבה של כמה שעות טובות בהמלך השבוע, בסוף מכניקה הוא המבחן האחרון בסמסטר ומגיעים אליו בלי רצון וכוח ובטח ללא זיכרון של ההשקעה במהלך הסמסטר \n\nהמבחן: מבחןהכיל ארבע שאלות פתוחות. \n\nהשורה התחתונה: קורס נוראי", "timestamp": 1658678449887}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דגנית דנינו\nחוות דעת - הרצאות: חמודה ממש, אבל לא רלוונטית כל כך. כן חשוב להגיע להרצאות כדי להיות מוכנים לתרגול לדעתי אבל היא לא תורמת הרבה כל כך. מרגיש שהיא מעבירה את הקורס כבר שנים ונמאס לה.\n\nשם המתרגל/ת: ענבר, לאוניד ודני.\nחוות דעת - תרגולים: ענבר הייתה לזמן קצר לפני לידה אז היא הייתה קצת באס\"ק. לא מצליחה כל כך להתשלט על הכיתה ועם קול חלש שבקושי שומעים. לאוניד מעביר את החומר היטב ומאוד מתחבר לסטודנטים, היה כיף להגיע לתרגולים אבל הוא לא הצליח כל כך להשתלט על הכיתה. דני היה המתרגל הכי טוב שהיה לי הסמסטר, ידע את החומר היטב והעביר אותו מעולה, השתלט על הכיתה והיה נחמד אלינו בטירוף.\n\nשעורי הבית: 10 הגשות חובה + 2 שהן בונוס של 2 נקודות לציון הסופי. בכל הגשה שתי שאלות ממוחזרות ועוד שאלה חדשה. הוגנים סה\"כ אבל דורשים הרבה מאוד זמן.\n\nהמבחן: היה מפתיע וקשה יותר משנים קודמות. רק דני ולאוניד הגיעו לענות על שאלות (ולא היה צריך מעבר). נתנו עוד 20 דקות מעבר ל-3 שעות כי הרוב לא סיימו את המבחן. הייתה בדיקה מקלה אבל זה עדיין היה המבחן עם הממוצע הנמוך ביותר.\n\nהשורה התחתונה:", "timestamp": 1659983604610}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דגנית\n\nחוות דעת - הרצאות: \nנחמדה אבל משעממת. כן רואים שחשובה לה ההבנה של הסטודנטים אבל היא מבולגנת והרבה פעמים הולכת לאיבוד בינה לבין עצמה ככה שקשה להיות \"על זה\" בהרצאה.\n\nשם המתרגל/ת: לאוניד\n\nחוות דעת - תרגולים: \nמתרגל טוב, ברור ותמיד עונה על שאלות.\n\nשעורי הבית: \nגיליון כל שבוע, 2 שאלות ישנות ואחת חדשה. לוקחים המון המון זמן (גם השאלות המרופרנסות ארוכות מאוד ולוקחות נצח). שווה להשקיע כי זה 15% אבל הם יכולים להיות מאוד מתסכלים.\n\nהמבחן: \nנוראי. היה ארוך מדי, הוסיפו עוד רבע שעה (שזה כמובן לא הספיק). השאלות היו קשות ומאוד מורכבות, הרבה מעבר לרמה שהייתה עד עכשיו. גם עם פקטור של 10% הממוצע היה נמוך יותר משנים קודמות.\n\nהשורה התחתונה: \nקורס קשה, דורש המון השקעה במהלך הסמסטר.", "timestamp": 1693666303324}, {"author": "ה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דגנית\nחוות דעת - הרצאות: הייתי במעט מאוד הרצאות שלה, השתעממתי מאוד והרגיש לי לא רלוונטי .\n\nשם המתרגל/ת: לאוניד כפרה עליו \nחוות דעת - תרגולים: מתרגל פצצה, לא היו הרבה סטודנטים בתרגול שלו וזה היה מעולה. מתרגל מצוין,  95% מהדברים הרלוונטים נאמרים בתרגולים .\n\nשעורי הבית: חשובים, תעשו הכל, גם מה שרפרנסתם-לפחות תבינו .\n\nהמבחן: קשה מאוד . בוחן על כל החומר של תרגול 5 כולל והלאה, לטעמי אין לכם מה ללמוד למבחן את מה שלפני, במיוחד אם היה לכם מבחן אמצע .  תלמדו הרבה (כמה שיש לכם, תנצלו כל יום), תעשו כמה שיותר מבחנים ותשקיעו בחומר פתוח, תרשמו בו כל טריק אפשרי שנתקלתם בו במבחנים .\n\nהשורה התחתונה: אם תעשו כל מבחן עד 2020 כולל, מאמינה שתהיו בסדר . בנוסף אני עשיתי שני שיעורים פרטיים עם אור וילינגר המלך, היה שווה כל שקל .", "timestamp": 1704792466373}]}