{"posts": [{"author": "מיקרוביולוגיה", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: סימה ירון (חלק א'), עודד בז'ה (חלק ב')\nחוות דעת - הרצאות: לביולוגים היה די משעמם, מרצים טובים אך החומר לא מחדש כמעט. קורס קליל וקצת משעמם, שזה חבל כי הנושא עצמו חשוב ועם פוטנציאל להיות מעניין נורא (אבל זה גם נחמד שיש קורס שלא צריך לדאוג ממנו!). \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 2 תרגילי בית להגשה בזוגות, הראשון יותר רציני בעוד השני היה לכתוב שיר על וירוס.. שזה נחמד אבל קצת מפתיע, בגדול. לא דורש השקעה מטורפת, בכ\"מ. \n\nהמבחן: סבבה לגמרי. \n\nהשורה התחתונה: קורס קליל וקצת משעמם.", "timestamp": 1600361099362}, {"author": "רירי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: סימה ירון ועודד בזה\nחוות דעת - הרצאות: מעניינות, החומר מועבר בצורה יפה. החלק של סימה מופנם יותר טוב כי בקורס המעבדה אנחנו מיישמים את החומר שנלמד בהרצאות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 2 שיעורי בית. הראשון דורש השקעה אך השני סההב, לצייר וירוס ו לכתוב עליו שיר.\n\nהמבחן: הוגן ומשוחזר מאוד מאוד מאוד. ממליצה ללמוד ממאגר השאלות שיש בדרייב.\n\nהשורה התחתונה: קורס יפה ומעניין.", "timestamp": 1606840632808}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עודד וסימה\nחוות דעת - הרצאות: המרצים ממש טובים בעיני, בסמסטר היברידי האפשרות להריץ מהר הרצאות עוזרת ממש. גם סימה וגם עודד מסבירים בצורה ברורה ומעניינת.\n\nשעורי הבית: מוזרים, חלקם הרגישו כמו שיעורי בית בבית ספר יסודי שרק ביזבזו זמן ולא הרגשתי שלמדתי מהם, הייתה עבודה אחת רצינית להגשה שהייתה לא קשה אבל לקחה לא מעט זמן.\n\nהמבחן: לא קליל אבל מאוד הוגן, מי שלמד טוב יצליח.\n\nהשורה התחתונה: קורס שדורש השקעה אבל לא יותר מדי, מאוד מאוד מעניין! מי שלוקח את המעבדה במקביל זה יעזור לו להבין את החומר עד הסוף...בהצלחה לכולם!", "timestamp": 1626004421464}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: סימה ירון ועודד בז'ה\nחוות דעת - הרצאות:  קצת איטיים אבל חמודים ממש, משרים אווירה נעימה בהרצאה. החומר של הקורס מעניין, קצת החלק של הסוף של עודד מייגע כי זה פשוט רצף של הרבה חיידקים אבל קורס כיפי.\n\nחוות דעת - תרגולים: אין.\n\nשעורי הבית: התחלק באופן שרק נתן מגן לסטודנטים. היו 4 הגשות ממש מוזרות עם משוב ממש מוזר, אבל ציונים טובים ונבחרו ה-3 עם הציון הכי גבוה בתור המגן. היו 4 \"מיני בחנים\" במודל של 5 שאלות על נושאי תחילת הקורס, גם נלקחו ה-3 הכי טובים. נתנו ססה\"כ מגן ממש גבוה של 35% לשני החלקים.\n\nהמבחן: \nאין מבחנים משנים קודמות אז זה ללמוד רק על בסיס שחזורים. בעבר המבחנים היו מאד שינון של החומר אבל הסמסטר הזה הפתיעו עם שאלות קצת יותר הבנתיות שזה נחמד ונתן לסטודנטים מקום להפעיל חשיבה ואופציות לתשובות מגוונות. היה פקטור של 4 נקודות למי שלא מערער, מי שמערער מאבד אותו. אף אחד לא קיבל 100.\n\nהשורה התחתונה: קורס סבבה לגמרי.", "timestamp": 1657809411876}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: סימה, עודד\nחוות דעת - הרצאות: \nהרצאות מאוד מעניינות, חומר הקורס הזה עוזר עם מעבדה של מיקרוביולוגיה.\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: היו מוזרים, אבל כדאי להשקיע בשיעורי בית כי יש להם משקל מהציון הסופי.\n\nהמבחן: שאלות אמיראקיות ושאלות פתוחות, אם לא מבין החומר לעומק קשה לקבל ציון טוב.\n\nהשורה התחתונה:", "timestamp": 1658138270144}, {"author": "ה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרופ' סימה ירון +עודד\nחוות דעת - הרצאות: לא ממש הייתי, רק באלה שהיה חייב כי היה בוחן מודל כזה (אווירת ביולוגיה 1) בתחילת השיעור\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: עושים אותם בכיתה, אין ממש שיעורי בית לבית\n\nהמבחן: היה פייר ודי קליל, יש האומרים גם ממוחזר . תעשו כמה שיותר מבחנים ותעברו על הלומדות של סימה ופשוט תלמדו כמה שתוכלו, 3 ימים זה מור דאן אינף .\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1692522678438}]}