{"posts": [{"author": "כימיה של מזון", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: איילת פישמן, בועז מזרחי\nחוות דעת - הרצאות: \nהחומר מעניין והם מסבירים סופר ברור אם כי לפעמים מדברים לאט מדי וקשה לשמור על קשב\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nעד חצי יום על כל גליון\nהמבחן: \nהמבחן מאוד קטנוני ונישתי ביחס לכמות החומר בקורס, השאלות הן על נקודות קטנות מהמצגות ועל דברים שהם הסבירו בחצי שנייה ולעולם לא הייתם מתארים לעצמכם שהם חשובים מספיק בשביל לשאול עליהם במבחן. ממוצע 63 לפני פקטור בקורס של שינון נטו מעיד על מידת האתגר.\nהשורה התחתונה: \nלתמלל כל מילה שהם אומרים - אין דבר שהוא לא חשוב", "timestamp": 1597746314723}, {"author": "ד.", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אילת פישמן ובועז מזרחי\nחוות דעת - הרצאות: ההרצאות של אילת מעניינות מאוד ומועברות בצורה ברורה ונעימה. ההרצאות של בועז הן בסדר אבל ניכר שהוא לא מתחבר לתוכן..\nמומלץ להגיע לכל ההרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שלושה תרגילים במהלך הסמסטר, הפורמט הוא לקרוא מאמר אקדמי (שהם מביאים) ולענות על שאלות אחריו, לא מסובך מדי. \n\nהמבחן: מסובך מדי. צריך לחרוש ממש טוב על כל החומר כי יש יחסית הרבה שאלות על דקויות אז תתארגנו על סיכום טוב. המבחן בדרך כלל רוב אמריקאי ומעט שאלות פתוחות ונדיר למצוא מבחנים משנים קודמות.\n\nהשורה התחתונה: בעיניי זה קורס נחמד ומעניין, המבחן קשה מהצפוי.", "timestamp": 1598221777652}, {"author": "Rawaa Nijem", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה:  אילת פישמן+בעז מזרחי\nחוות דעת - הרצאות: ההרצאות הועברו בצורה מעניינת וברורה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 3 גליונות, צריך לקרוא מאמרים ולענות על שאלות\n\nהמבחן: מועד ב היה 10 שאלות פתוחות עם 4-6 סעיפים לכל שאלה, די פשוטות אבל לוקחות הרבה זמן. מוגבל לשעה וחצי שזה בכלל לא מספיק \n\nהשורה התחתונה: הקורס הכי יפה שלמדתי בטכניון!", "timestamp": 1614608705121}, {"author": "Reut laufer", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איילת פישמן ודפי\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות אבל קשה להבדיל בין עיקר וטפל, במבחנים שואלים על דברים שנראו זניחים במהלך ההרצאה ולא עיקריים כלל.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: \nשיעורי הבית קלים \nהמבחן: מבחן קשה \n\nהשורה התחתונה:", "timestamp": 1626693318433}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איילת ודפנה\nחוות דעת - הרצאות: ההרצאות מעניינות בסך הכל, מתמקדים בעיקר בשומנים וסוכרים.\n\nשעורי הבית: 3 מאמרים עם שאלות- לא קשה במיוחד אבל לוקח זמן, צילום סרטון בקבוצות של ניסוי על איזה נושא שתבחרו - קליל אבל בסוף הסמסטר זה קצת לחוץ, וביקורות עמיתים - שוב, קל ממש אבל בסוף הסמסטר זה ממש תקוע.\n\nהמבחן: לא קשה במיוחד אבל איכשהו אף פעם הממוצע לא גבוה, הרבה מאוד שאלות ביחס לזמן - מרגיש קצת כמו פסיכומטרי, יש למיטב זכרוני כ-20 שאלות אמריקאיות, 5 שאלות נכון לא נכון ו כ-3 שאלות פתוחות עם תת סעיפים, כל התענוג בשעה וחצי.\n\nהשורה התחתונה: קורס מעניין למדי, בבחינה הסופית שואלים שאלות על הפרטים הקטנים אז שווה להקשיב טוב ולהתארגן על סיכום שמכיל הכל. לדעתי אפשר גם להצליח בלי להקשיב בהרצאות ורק ללמוד מסיכום מפורט. בהצלחה!!", "timestamp": 1627976232354}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איילת פישמן ובועז מזרחי\nחוות דעת - הרצאות: הרצאות מעניינות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: שני מאמרים ושאלות עליהן לבחור סרטון על החומר הנלמד שורה תחתונה שיעורי בית לא תורמים ללמידה אין שום עניין. \n\nהמבחן: מכיל 20 שאלות אמריקאיות 7 שאלות נכון לא נכון ו6 שאלות פתוחות קצרות עם סעיפים. המבחן עצמו מתעסק רק בדברים הכי קטנים שנאמרו ללא להתייחסות בכלל מלבד האמירה. הוא מכיל הרבה גרפים ושאלות הקשורות בזה אין מאיפה ללמוד מלבד שחזורים שכמובן שום דבר לא היה משוחזר. תכלס מבחן קטנוני בלי הרבה זמן שעה וחצי למרות שנאמר שזמן לא תיהיה הבעיה תכלס הוסיפו לנו חמש דקות לתענוג \n\nהשורה התחתונה: קורס מעניין לא מומלץ לקחת למי שלא צריך אחד המבחנים הנוראיים שראיתי", "timestamp": 1657780587127}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איילת, בועז\nחוות דעת - הרצאות: חומר מעניין ( שמנים, ח\"ש, ח\"א,ליפידים...), אבל ההרצאות היו משעממות (3 שעות) קשה לעקוב אחר הכל.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים:- \n\nשעורי הבית: שאלות על מאמרים באנגלית שמכילים חומר שלמדתם עליו. לא קשה במיוחד\n\nהמבחן: מבחו נורא, שאלות סגורות ופתוחות, שואלים על דברים ספיציפיים שנשאלו בהרצאות. מלא דברים לזכור ומאוד חשוב להבין לעומק. המבחן מכיל הרבה ששאלות הבנה.\n\nהשורה התחתונה: קורס סבבה מבחן נורא", "timestamp": 1658139074498}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איילת בועז\nחוות דעת - הרצאות: היו משעממות לגמרי, אבל החומר מעניין.\nאל תסמכו על סיכום משנים קודמים.\nשעורי הבית: שאלות על מאמרים באנגלית\nהמבחן: \n\" הבחינה לא צריכה להיות \"מתנה \"שבה הממוצע 90+ והכל זהה לשאלות חזרה \" \nהשורה התחתונה: בחינה קשה ונורא, מצפים לזכור כל מה שנאמר בהרצאה.", "timestamp": 1658140101288}, {"author": ".", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: בועז מזרחי ואיילת פישמן.\nחוות דעת - הרצאות: נוראיות. לכל אחד במהלך הסמסטר יש את הנושא שלו שהוא מעברים והם פשוט מלמדים בזמנים שנוח להם. אם מתאים להם שיום אחד איילת ואחרי זה בועז הם יעשו את זה, וכל אחד מלמד נושא שונה לחלוטין אז אין רצף למידה בכלל. דיי זלזול בזמן של סטודנטים. מדברים כל כך הרבה במשך 3 שעות שלא ברור מה תפל ומה העיקר. לא אכפת להם מהזום ובטח שלא מקלטים או מעלים הקלטות עבר. \n\nשעורי הבית: שני מאמרים עם שאלות ועוד הגשה של ביקורת עמיתים, הגשות קצרות וציונים טובים.\n\nהמבחן: נורא ואיום. שאלות שלמות על נושאים שנאמרו במשפט קצר ועל פרטים קטנים. זה דורש שינון ולא הבנה ותכלס זה מבחן שבא להוריד ממוצע תואר לסטודנטים. חציון 71 דיי עצוב. \n\nהשורה התחתונה: קורס נורא ולא מומלץ בכלל. למי שזה חובה - המלצה חמה להקליט אותם או משהו בהרצאות או ממש לתמלל מילה מילה שהם אומרים. הדבר היחיד שלמדתי זה איך לאחסן יין ושמן זית נכון.", "timestamp": 1658215268675}, {"author": "סטודנט שלא זכר גרף ספציפי שציירו ל30 שניות על הלוח", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: בועז מזרחי איילת פישמן\nחוות דעת - הרצאות: אין טפל, צריך לדעת כל מילה שהמרצים אומרים וכל דבר שכותבים על הלוח. מומלץ לתמלל את ההרצאות ולצלם כל פעם שכותבים על הלוח.\n\n\nשעורי הבית: לנתח שני מאמרים ולמצוא סרטון שקשור לחומר המלמד. בקלות מקבלים 95.\n\nהמבחן: נוראי, שאלות על מולקולה שהזכירו פעם אחת. שאלה על גרף שאיילת ציירה פעם אחת בתחילת סמסטר. אין עיקר וטפל הכל חשוב למבחן.\n\nהשורה התחתונה: קורס חובה אז אין לכם ברירה תקשיבו טוב ותנסו להנות בכל מקרה", "timestamp": 1659374974188}, {"author": "ללא", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: בועז מזרחי ואיילת פישמן\nחוות דעת - הרצאות: \nהטעות הכי גדולה שעשיתי היא לא להקשיב לכל מילה שהוציאו מהפה בהרצאה. זה קורס שאסור להיות שאננים ומומלץ אפילו להתחיל לשנן את החומר לפני שנגמר הסמסטר. כל מילה וכל פיפס קטן במצגת חשוב.\n\nשעורי הבית: \nלא באמת קשורים לחומר ובטח שלא עוזרים בהכנה למבחן.\n\nהמבחן: \nלא בוחן הבנה אלא שינון מוגזם של כמות מאוד גדולה של חומר. \n\nהשורה התחתונה: לשנן לשנן לשנן", "timestamp": 1663927692407}, {"author": "ה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אילת ובועז ברוטציה\nחוות דעת - הרצאות: אחלה הרצאות נהנתי מאוד האמת\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 3 הגשות במשך הסמסטר, ראשונה מעצבנת והשאר צ'יפס, שימו לב לא להגיש בקובץ WORD במקום PDF, סתם נק' לפח\n\nהמבחן: היה קשה מאוד . בעיני מוכוון להכשיל, נותנים שעה וחצי למבחן שהוא הרב אמריקאי אבל גם דורש הרבה מחשבה וירידה לפרטים קטנים ... ממוצע נמוך מאוד . אין לי מה להגיד פשוט תשננו הכל הכל הכל הכל, כל מילה שיוצאת להם מהפה בהרצאה ותתפללו לטוב\n\nהשורה התחתונה: אחלה קורס במהלך הסמסטר, מבחן רע", "timestamp": 1692522484383}, {"author": "ס.נ", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: איילת פישמן ובועז מזרחי\nחוות דעת - הרצאות: מעניינות, אני פחות בתחום של המזון ואפילו אני אהבתי\n\nשעורי הבית: 3 ש.ב ששווים רק ל-10% מהציון. הראשון מבאס וארוך, השני והשלישי יותר הגיוניים. \n\nהמבחן: מכשיל בכוונה, נכנס ממש לקטנות. אני הייתי ממש בטוח שאני הולך על 80-90 וקיבלתי נכשל. צריך לשנן כל פיפס מהמצגת!\nבנוסף, שימו לב שהם שמו שאלה של 6 נקודות על המאמר משיעורי הבית במבחן כשאף אחד לא ציפה לזה, אז תלמדו גם את זה למבחן. המאמר עם השמנים מברזיל וספרד.\n\nהשורה התחתונה: קורס \"דברים מגניבים להגיד להורים על אוכל בארוחת שישי\", בגדול. ומבחן אלים. אני 5 שנים באקדמיה, מצטיין, וזה המבחן הראשון שאשכרה נכשלתי בו.", "timestamp": 1696361838732}]}