{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אסתי סגל ומאיה פנחס דוידוביץ\nחוות דעת - הרצאות: \nהרצאות מעניינות ועמוסות. חשוב לעקוב אחר כל פרט.\n\nשם המתרגל/ת: עופר ונטע\nחוות דעת - תרגולים: \nממש מועילים והכרחיים בשביל השיעורי הבית והמבחן.\nשעורי הבית: \nלא קלים, בד\"כ שאלה אחת משנים קודמות ואחת חדשה.\nהמבחן: \nאצלנו היה הוגן. שואלים על חומר מההרצאות (שקופית מהרצאה), מומלץ להביא את כל החומר של הקורס למבחן.\nמבחן לא קל אבל עם השקעה לאורך הסמסטר אפשר להוציא ציון טוב.\nהשורה התחתונה:", "timestamp": 1626170601764}, {"author": "ליאור אלמליח", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מאיה דוידוביץ פנחס ואסתר סגל\nחוות דעת - הרצאות: \nאסתי מאוד נחמדה ומסבירה עד שהכל מובן כמו שצריך.\nמאיה מסבירה טוב\n\nשם המתרגל/ת: נטע ועופר\nחוות דעת - תרגולים: \nנטע מסבירה תכלס במהלך ה-6 התרגולים הראשונים ואחרי זה עופר נכנס ליותר פרטים אבל הוא עושה את זה בצורה טובה מאוד מאוד פנוי לשאלות של סטודנטים בכל זמן שרוצים ומאוד עוזר במיילים.\n\nשעורי הבית: \nלא עמוסים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1629712013166}, {"author": "חומר", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "תיזהרו מעופר. במיוחד בשיעורי בית.", "timestamp": 1637164268087}, {"author": "RL", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: בעיני היה מעניין ומצחיק\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמתרגלים מעולים ואיכפתיים\nשעורי הבית: \nשיעורי בית מכינים מצויין למבחן, לא קשים מדי גם\nהמבחן: המבחן היה פיירי, מי שעשה שיעורים לא נתקל בהפתעות\n\nהשורה התחתונה: אהבתי את הקורס :)", "timestamp": 1657176865317}, {"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אסתי ומאיה\nחוות דעת - הרצאות: פחות התחברתי להרצאות, לדעתי ממש לא היה צורך להגיע אליהן כדי להבין את החומר (קצת כמו בתופעות מעבר חום), החומר לא קל ולכן לא הייתי מזלזלת בקורס, שיעורי הבית לא מאוס קשים אבל לוקחים זמן. סך הכל קורס נחמד\n\nשם המתרגל/ת: נטע ועופר. \nחוות דעת - תרגולים: את נטע לא הצלחתי להבין, מעבירה את התרגולים מהר מדי לטעמי אבל זמינה לשאלות. עופר מדהים ומסביר בצורה הכי טובה שאפשר\n\nשעורי הבית: דומים לתופעות מעבר חומר, 3 שאלות כשאחת או שתיים עם רפרנס. לוקח כמה שעות ותורם להבנת החומרץ\n\nהמבחן: השאלות האמריקאיות מאוד מבלבלות אבל סך הכל המבחן הוגן\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1660376788759}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מאיה ואסתי\nחוות דעת - הרצאות: חמודות ממש, נעים להיות איתן בהרצאה. אני כן רואה חשיבות בלהגיע להרצאות כדי להבין את החומר. \n\nשם המתרגל/ת: נטע וליחן\nחוות דעת - תרגולים:  אין על שתיהן! מתרגלות מהממות, מדברות עם סטודנטים בגובה עיניים, ברורות וממש חמודות. \n\nשעורי הבית: קשים, דורשים זמן אבל מלמדים. גם תמיד המתרגלות זמינות לכל שאלה ועונות מהר אז אפשר לצלוח הכל עם הבנה גבוהה.\n\nהמבחן: היה עמוס בטירוף. רק השאלה הראשונה לקחה לרוב מעל שעה וחצי אז לא היה זמן לשאלה האחרונה. הן לא נתנו הארכת זמן ונוצר מצב שלאנשים ירד מלא ניקוד בשאלה האחרונה. לא סתם הממוצע היה 66. וואלה באסה בקורס הזה לקבל ציונים כאלו נמוכים. היה מבחן מאוד עמוס והן לא מודות בטעותן. \n\nהשורה התחתונה: קורס חובה מה נעשה. מזל שיש אחלה סגל סה\"כ.", "timestamp": 1690012514945}]}