{"posts": [{"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מאיה\nחוות דעת - הרצאות: מאיה מעבירה את החומר בצורה יחסית מעניינת, אפשר להתעלם מכל פיתוחי המשוואת שלא קריטיים למבחן ולדעתי אפשר גם להצליח יופי במבחן בלי להגיע להרצאות.\n\nשם המתרגל/ת: ענבר ונטע\nחוות דעת - תרגולים: ענבר מסבירה בצורה ממש ברורה, לאט ועד שכולם מבינים. לדעתי, נטע פחות ברורה אבל עדיין אפשר לעקוב והיא זמינה לשאלות.\n\nשעורי הבית: 3 תריגלים כאשר 2 ממוחזרים ואחד חדש. לוקח כמה שעות אבל לא לוותר עליהם, לומדים מהם הרבה.\n\nהמבחן: בסך הכל מאוד הוגן, אם מתרגלים טוב מבחני עבר רואים שהחומר חוזר על עצמו ולא קשה, במיוחד עם חומר פתוח.\n\nהשורה התחתונה: קורס סבבה לגמרי, בהצלחה!", "timestamp": 1653148698398}, {"author": "גטסבי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מאיה\nחוות דעת - הרצאות: \nמרצה ממש טובה ומנסה שהכל יבין את החומר. המצגות באנגלית וקשה לעכוב אחרי כל המושגים. תתרכזו\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: נטע מהירה, אבל מעבירה החומר והשאלות בצורה מעולה. כמה פעמים לא הספקנו לעבור על כל השאלות בתרגולים, בגלל חוסר זמן.\nשעורי הבית: \nשתי שאלות ממוחזרות, אחת חדשה לגמרי, הגשה בזוגות. לוקחות זמן, שאלות ברמת המבחנים שממש עוזרים להבין את החומר בצורה יעילה.\nהמבחן: \n3 שאלות עם 3-5 סעיפים.\nהיה ממש ארוך שכולל את כל החומר, בלתי אפשרי ב 3 שעות.\nקיבלנו הארכת זמן של 15 דקות, אבל עדיין לחלק גדול לא היה מספיק. \nהשורה התחתונה: \nקורס סבבה אבל מבחן בעייתי", "timestamp": 1675696929892}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מאיה\nחוות דעת - הרצאות: הרצאות מעניינות, מקשרים את החומר  לכל מיני תופעות ביום יום כך שיותר קל להבין מה קורה. מאיה מעבירה את החומר בצורה טובה וכיף להקשיב לה. \n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: \nמתרגלת מעולה, מאוד ברורה ועוזרת לפשט את החומר.\nשעורי הבית: 3 שאלות, 2 ממוחזרות. מאוד עוזר להבנת החומר.\n\nהמבחן: מאתגר, צריך להבין טוב את החומר\n\nהשורה התחתונה: דורש זמן והשקעה אבל ממש נחמד", "timestamp": 1676393471117}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מאיה \nחוות דעת - הרצאות: מרצה מדהימה, מעבירה את ההרצאות בעניין ויודעת למשוך את התשומת לב של הסטודנטים. גורמת להבנה טובה ומתעכבת על נושאים חשובים.\n\nשם המתרגל/ת: עמית נלקין\nחוות דעת - תרגולים: מתרגל טוב, יודע להסביר את החומר ועוזר עם שאלות שעלו משיעורי הבית. מאוד אכפתי כלפי הסטודנטים. \n\nשעורי הבית: יש תרגיל בית כל שבוע וזה מאוד עמוס וקשה. תרגילים קשים שדורשים חשיבה אך מי שעובד עם התרגול יכול לפתור את רוב התרגיל בעזרתו. שתי שאלות שיש להן רפרנס הן רק חובת הגשה ואחת להגשה עם ציון. חשוב לפתור את השיעורים כדי לבנות הבנה של החומר במהלך הסמסטר ולהתמודד עם הנושאים הקשים וגם כדי ללמוד איך לחשוב בהתאם לדרישה של הקורס.\n\nהמבחן: מבחן קשה, מאיה מבטיחה שיהיה דברים שלא ראיתם ולגמרי מקיימת. המבחן עם חומר פתוח אבל הוא דורש חשיבה עמוקה. מאוד עמוס ומתיש ותכינו את עצמכם לזה שייתכן ולא תסיימו אותו.\n\nהשורה התחתונה: קורס ממש מעניין, מאיה גורמת לאהוב את הנושא של מעבר חום, אבל באותה נשימה הוא קורס קשה עמוס ומתיש. בהצלחה!", "timestamp": 1715627529084}, {"author": "maya shulman", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מאיה פנחס דוידוביץ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נטע מתרגלת מ צ ו י נ ת\n\nשעורי הבית: קשה\n\nהמבחן: קשה מאוד \n\nהשורה התחתונה: בהצלחה", "timestamp": 1716215815185}, {"author": "-", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מאיה\nחוות דעת - הרצאות: מרצה טובה ומעבירה את החומר בצורה מאוד מעניינת, המצגות באנגלית ומאוד עמוסות אז הרבה פעמים קשה לעקוב.\n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: מהירה אבל ממש טובה (וגם תמיד מורידה את הקצב כשמבקשים ועונה על שאלות). מעבר לזה גם מאוד זמינה מחוץ לשעות התרגול.\n\nשעורי הבית: הגשה כל שבוע, שאלה חדשה ושתיים ממוחזרות. קשים ולוקחים המון זמן (גם השאלות הממוחזרות).\n\nהמבחן: קשה מאוד. היהמבחן מאוד ארוך ועמוס שכל שאלה בו שילבה כמה נושאים והייתה מחולקת לכמה סעיפים. הוסיפו עו רבע שעה וזה כמובן לא הספיק (בכל זאת ממוצע 66 אחרי פקטור)..\n\nהשורה התחתונה: קורס מאוד קשה אבל מעניין ואפשר גם להצליח אם מתרגלים הרבה ושולטים טוב בחומר.", "timestamp": 1716553644631}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מאיה \nחוות דעת - הרצאות: לא התחברתי למרצה בכלל מההרצאה הראשונה היא מדברת על המבחן ועל זה שיהיה קשה אז היא תמיד נתנה תחושה של אי נוחות.\nאבל הנרצאות חשובות מאוד, גם כי עוזרות להבין את החומר וגם כי יש נוסחאות חשובות שמופיעות רק בהרצאות ולא עוברים עליהם בתרגולים, בנוסף היתה שאלה בבחן אמצע שהיא שאלת הבנה מחומר ההרצאות  \nשם המתרגל/ת: עמית ונטע שמעוני\nחוות דעת - תרגולים: עמית אחלה מתרגל אבל נטע הייתה מעבירה את החומר בצורה מובנת יותר אבל היא די מהירה אז הייתי מצפה בהקלטות שלה וזה היה מצוין\n\nשעורי הבית: \n3 שאלות ששתים מהם רפרנס ואחת חדשה. שיעורי הבית חשובים מאוד ועוזרים להבין את החומר בצורה טובה יותר. הם ארוכים ודורשים מחא זמן אבל בסך הכל לא כלכך קשות וצוות המתרגלים עוזר מאוד \nהמבחן: היה מאוד מאוד קשה, פתרתי מבחנים מ2016 ולא ראיתי מבחן כזה קשה. המבחן היה קשה ומאוד ארוך והם בקושי נתנו 15דק׳ הארכת זמן שלא עזרה בכלום ואף אחד לא סיים בזמן\n\nהשורה התחתונה: קורס לא קל אבל חובה, לכן צריך להשקיע הו המון במהלך הסמסטר", "timestamp": 1717225785071}]}