{"posts": [{"author": "אני", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חזי\nחוות דעת - הרצאות: חזי מקסים, הוא באמת משתדל, עם זאת קצת קשה לעקוב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: המעבדה קצת חופרת כמו כל מעבדה, יש כמה דוחות ארוכים אבל לא הרבה.\n\nשעורי הבית: \n\nהמבחן: ממוחזר והוגן\n\nהשורה התחתונה: קורס חמוד ומעניין מאוד", "timestamp": 1653149221255}, {"author": "גטסבי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חזי\nחוות דעת - הרצאות: \nמאוד משעממות, אתה לא יכול לעקוב אחרי הכל, אבל חזי מאוד נחמד. סיכום טוב מומלץ מאוד לקורס זה.\n\nשם המתרגל/ת: מתרגלות מעבדה\nחוות דעת - תרגולים:\n מאוד נחמדים, עוזרים להכל, מעולים.\nשעורי הבית: אין\n\nהמבחן: חלק מהשאלות ממוחזרים, אבל אל תסמכו על זה! \nהיו שאלות חדשות, מעודכנים, על נושאים ספיציפיים בהרצאה ועל הסיור. תשימו לב לדברים אלו.\n\nהשורה התחתונה:", "timestamp": 1675199478036}, {"author": "עדי קיקוזאשוילי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חזי\nחוות דעת - הרצאות: היה לי מאוד משעמם ומונוטוני\n\nשם המתרגל/ת: יש מלא מתרגלות במעבדה, רובן מקסימות אבל תמיד קשובות\nחוות דעת - תרגולים: מעבדה משעממת לטעמי\n\nשעורי הבית: אין\n\nהמבחן: שינון שינון שינון\n\nהשורה התחתונה:", "timestamp": 1676707185293}, {"author": "shmoo מסוג אלפא", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חזי\nחוות דעת - הרצאות: ההרצאות בסדר גמור, יש מעניינות יותר ומעניינות פחות. אותי אישית עניינו יותר ההרצאות על שימוש במיקרואורגניזמים במזון (בירה, יין, גבינות וחמוצים). אפשרי גם לקרוא הכל בסיכום האגדי של עדן ניסטור. \nבסוף הסמסטר יש יום סיור במפעלי מזון (אין חובת הגעה). לקחו אותנו למילודע (מספקת בדיקות איכות למוצרי מזון שנשלחים אליה מחברות שונות), מפעל תנובה ומפעל טמפו (משקאות). מעבר לחריגה מלוחות הזמנים, הסיור היה מעולה, מומלץ בחום!\n\nשם המתרגל/ת: מתרגלות מעבדה\nחוות דעת - תרגולים: חצי מהקורס כולל גם מעבדה, חלק מהניסויים הם על חומר שנלמד בהרצאה (כמו כבישה וזיהוי פטריות ועובשים). המעבדות סבירות, עדיין מרגיש שמחפשים אותנו על קטנות (לא תקף עבור כלל המתרגלות).\n\nשעורי הבית: השנה ביטלו לנו את דוח תסיסה (שכולל יותר חישובים), ונשאר רק דוח כבישה מפלצתי אחד (שכולל את התוצאות של כלל הקבוצה, במקום רק של הניסוי שלכם). עזבו את זה שכמות ההחרגות/חישובים/ממוצעים/סטיות/מה שתרצו מוגזמת ממש, שני המתרגלים שהיו אחראיים על בדיקת הדוח (הילה ומוחמד) לא היו מסונכרנים בעליל בתשובות שלהם. העיקר רצו שנדפיס את הדוח (לצורך הגשה, במקום במודל), אבל דו צדדי (לשמור על איכות הסביבה..).\nמעבר לזה היה גם פרויקט בסוף הסמסטר - המתרגלות מביאות לכם דוגמת מזון שמתפצלת ל-2 שקיות, ובאישון ליל מזהמות אחת מהן בחיידק בעייתי. המטרה של שאר השבוע היא בסופו של דבר לגלות איזו דוגמה הזדהמה. דורש הגעה לפסקי זמן קצרים בכל יום בשבוע (גג רבע שעה). סביר, עדיין מחפשים על קטנות. בסוף יש גם הצגה במצגת על תוצאות הפרויקט + נושא שנבחר לכם שקשור לחיידק, כמו דרכי זיהוי, איזה מחלות הוא גורם, איך אפשרי לטפל בו וכו'. עם קצת (הרבה) השקעה - אפשר לקבל ציון טוב.\n\nהמבחן: חלק ממוחזר, אומרים שצריך ללמוד את כל הנושאים של כללללל המצגות, בפועל שואלים בעיקר על הפרוטוקולים לזיהוי של החיידקים. תכלס דומה למיקרו כללי, אז לא להילחץ.\n\nהשורה התחתונה: קורס סבבה, דורש הרבה יותר מדי השקעה בגלל שילוב של קורס + מעבדה תחת 3 נק\"ז מסכנים, תנשמו עמוק ותעברו את זה.\nולא לשכוח שרק שמו מסוג אלפא ומסוג a יכולים להיפגש, חשוב!", "timestamp": 1716408281835}]}