{"posts": [{"author": "רירי", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: אבי שפילגמן\nחוות דעת - הרצאות: מאוד מעניינות, מועברות בצורה מעניינת, מלמדים חומר שקשור לחיי היום יום\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: קל והוגן, דורש הבנה עמוקה ובנושאים מסוימים צריך ללמוד בעל פה.\nהשורה התחתונה: קורס יפה מאוד שיגרום לכם לחשוב על מסלול הנדסת מזון!", "timestamp": 1598992634735}, {"author": "Lio Samueli", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: \nההרצאות עברו בצורה נחמדה, ההרצאות על חלב קצת יותר משעממות\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \n\nשעורי הבית: \n-\nהמבחן: \nהמבחן עצמו קל, השאלות משוחזרות והממוצע גבוה.\nהשורה התחתונה: \nקורס חובה, קורס נחמד לאנשים שעוד מתלבטים בין שני המסלולים, למי שסגור על מסלול הביוטכנולוגיה יהיה משעמם.", "timestamp": 1615136767693}, {"author": "מ-", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אבי שפיגלמן\nחוות דעת - הרצאות :  מאוד נחמד ומסביר את החומר בצורה ברורה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  אין תרגולים\n\nשעורי הבית:  אין שעורי בית.\n\nהמבחן: גם אם לא הייתם עוקבים 100% במהלך הסמסטר,ניתן לקבל ציון גבוהה. רוב השאלות ממוחזרות.\n\nהשורה התחתונה: קורס נחמד וקליל.", "timestamp": 1615145983904}, {"author": "walker", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אבי שפיגלמן\nחוות דעת - הרצאות: קצת מיותרות, הוא מציג הרבה סרטונים ולפעמים קשה להבין \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: משננים את הסיכום ומגיעים למבחן מוכנים, 30 שאלות מהן 10 נכון לא נכון ו 20 אמריקאיות , נחשב כקל אני קראתי את הסיכום , הדגשתי את הדברים \"החשובים\" וכתבתי אותם וקיבלתי 96 \n\nהשורה התחתונה: הקורס הכי קל שנתקלתי בו", "timestamp": 1644670909912}, {"author": ".", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי שפיגלמן\nחוות דעת - הרצאות: ההרצאות הכי משעממות שחוויתי בחיי. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: בגלל שההרצאות היו משעממות, לא היו הגשות ולא היו תרגולים אז לא נכחתי כל הסמסטר. הסיכום היה משעמם כמו ההרצאות והיה קשה מאוד ללמוד לזה. התבטא במבחן שהסיכומים לא תכללו הכל והיו הפתעות. מזל שזה אמריקאי והניחושיאדה הייתה רצינית.\n\nהשורה התחתונה: קורס משעמם, חבל שהוא חובה.", "timestamp": 1644758448922}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אבי שפיגלמן\nחוות דעת - הרצאות: יש נושאים שהיו משעממים בטירוף ויש מעניינים \nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: המבחן לא מצריך הבנה לחומר, הוא נטו שינון.  ולא צריך להיות נוכח בהרצאות כדי להבין את החומר ולהצליח. \nבמבחן יש שאלות ממוחזרות אך לא להסתמך על זה כי הרוב היו שאלות חדשות.\nהדרך הכי טוב ללמוד למבחן היא שפשוט לשנן את הסיכום טוב טוב ולעבור על מצגות ההרצאות והשחזורים מהדרייב ולא יהיה בכלל הפתעות. \nהשורה התחתונה:  תשנן = תצליח בקלות", "timestamp": 1678057211674}, {"author": "..", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אבי שפיגלמן\nחוות דעת - הרצאות: הרבה חומר יבש, לפעמים קצת עובדות מעניינות. סך הכל מסביר טוב את החומר, רק שלטעמי החומר לא היה מעניין במיוחד.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\nשעורי הבית: אין\n\nהמבחן: מכיל שאלות אמריקאיות ושאלות נכון לא נכון. בגדול צריך לקרוא את כל החומר ולזכור אותו טוב טוב. לי הספיקו יומיים של למידה. אבי לא מפרסם מבחני עבר אז ניתן להתבסס רק על שחזורים של סטודנטים מסמסטרים קודמים (אל תשכחו לשחזר את המבחן שלכם לטובת אלה שיגיעו אחריכם!), וממש מומלץ לעבור עליהם כדי להבין את סגנון השאלות. אוהבים להגיד שחצי מהמבחן ממוחזר אבל אני חייבת להגיד שאני לא חושבת שהייתה אצלנו שאלה אחת ממוחזרת. סך הכל המבחן פייר ואם עברתם על החומר כמו שצריך ופתרתם שיחזורי מבחנים אין סיבה שלא תצליחו. אבי גם הסביר לנו שאם יש שאלות שהוא רואה שאחוזי ההצלחה בהם היו נמוכים במיוחד הוא לפעמים מבטל אותן.\n\nהשורה התחתונה: לא קורס הכי מעניין לדעתי אבל מה לעשות הוא חובה. פשוט לומדים טוב את החומר למבחן ומסתדרים.", "timestamp": 1678268365307}, {"author": "ה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: אני הייתי ממש סבבה בהרצאות שלו, אפילו הקשבתי . אבי נחמד והכל והמקצוע הזה הוא מבוא נחמד למקצוע של הנדסת מזון.\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: ממוחזר . תעברו על המבחנים הממוחזרים בדרייב, כל מה שאתם לא יודעים תעשו קונטרול F בסיכום של עדן (שגם בדרייב) וככה תלמדו לאט לאט . אין הפתעות ממש ולא בא להכשיל\n\nהשורה התחתונה: אחלה קורס מבוא", "timestamp": 1689426209707}, {"author": "-", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: אני אישית נהניתי מההרצאות של אבי. נותן רקע לתעשיית המזון ובסך הכל היה לי מאוד מעניין.\n\nהמבחן: יותר קשה ממה שחשבתי שיהיה. שאלות בודדות מאוד היו ממוחזרות והשאר התבססו על ידע ועל סרטונים שהוא הראה במהלך הקורס אז חשוב לעבור באמת על כולם ולזכור פקטים חשובים (כמו טמפ' פסטור של נוזל ביצים)..\n\nהשורה התחתונה: קורס מעניין וקליל, אפשר להוציא ציון לא רע עם כמה ימים של למידה", "timestamp": 1716553377396}]}