{"posts": [{"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מרסל\nחוות דעת - הרצאות: החומר מאוד מעניין ורלוונטי, אבל המצגות יחסית ישנות והסמסטר בוטלו כמה הרצאות. לפעמים מרגיש שחסר עומק. לא צריך רקע ביולוגי עשיר. \n\nהמבחן: \"לשפוך\" חומר. אם יודעים את החומר אז אפשר לקבל ציון טוב (הממוצע לא מדהים לקורס בחירה). אפשר להעביר סמינר ולקבל מגן (לא חובה). \n\nהשורה התחתונה: קורס מעניין ורלוונטי, כדאי למי שרוצה מבוא של התחום (הקורס לא מכסה עומק משמעותי).", "timestamp": 1616313573103}, {"author": "הנדסת רקמות", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרסל מחלוף\nחוות דעת - הרצאות:  הקורס מהווה מבוא בסיסי מאוד לעולם הנדסת הרקמות. ההרצאות מעניינות אך יורות לכל הכיוונים ולרוב נוגעים בצורה מאוד שטחית בהמון מושגים ונושאים מכל מיני תחומים ככה שבסוף נותרת הרגשה שלא נשאר משהו באמת ביד לאחר הקורס.\n\nשעורי הבית: \nאין שיעורי בית. יש סמינר שמהווה 25% מהציון והוא בדרך כלל חובה אך השנה בגלל הקורונה, נחשב כמגן למי שרצה לעשות. \nלדעתי הוא לא מומלץ כי אין קווים מנחים ברורים מדי למה נדרש שיכיל ולכן גוזל יותר זמן ממה ששווה להשקיע בו, וזה במידה ומצליחים לקבל מענה במייל.\n\nהמבחן: \nמבחן של נטו שינון - \"שפוך חמתך על הגויים\".\n3 שאלות פתוחות וכל אחת יכולה לדרוש כתיבה של 2 עמודים לפחות בכדי לכסות את כל הפרמטרים. הבדיקה קטנונית, הורדת נקודות שרירותית, מקשה ומחמירה במידה וחסרות מילים ספציפיות. דורש המון ימי למידה ושינון ביחס לקורסי בחירה אחרים ובסוף הציונים לא גבוהים, כאשר הציון המקסימלי שניתן לקבל בקורס הוא 98.\n\nהשורה התחתונה: קורס מעניין שמטרתו היא לפתוח את התיאבון ולהכיר את המושגים הבסיסיים בתחום במידה ורוצים להמשיך בכיוון. למראת זאת בגלל ההשקעה הרבה הנדרשת עבור המבחן והסמינר והממוצע הנמוך יחסית לקורסי בחירה אחרים לדעתי זה אחד מקורסי הבחירה הלא מומלצים.", "timestamp": 1620564942707}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "קורס כללי מדי, דרישות גבוהות מצד מרסל, הרבה הרצאות התבטלו בהודעה של הרגע האחרון.", "timestamp": 1624955720210}, {"author": "אני", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרסל מחלוף\nחוות דעת - הרצאות: התגובות פה בצ'יז פורק לא עושות עם הקורס חסד וחבל. בסמסטר שאני לקחתי את הקורס לא הגיעו הרבה אנשים בכלל ולדעתי התגובות פה זאת אחת הסיבות. הקורס מרתק! כנראה הכי מעניין שתיקחו בתואר. מרסל מספרת על הנדסת רקמות, איך עושים את זה בכלליות ובעיקר מה הקשיים. זה הבייבי של מרסל וזה מורגש, היא מדברת ואי אפשר להפסיק להקשיב לה. הנושא מעניין, צורת העברת ההרצאות מעניינת, הדוגמאות שמרסל מביאה מעניינות. קשה לי מאוד להקשיב בהרצאות וזאת אחת הפעמים הראשונות שהייתי מורכזת בכל ההרצאות ולכל אורכן. כל מי שהיה איתי בקורס הסכים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: עבודה אחת להגשה שההנחיות אליה לא כתובות ולא מאוד ברורות. בעיקרון צריך להכין מצגת על כשלושה מאמרים בתחום הנדסת רקמות ולהסביר מה הם עשו ואיך אפשר לשפר. זה אומנם רק מגן אבל למרסל מאוד חשוב שכולם יעשו אותו והוא דורש השקעה וקצת קשה למצוא מאמרים טובים.\n\nהמבחן: אכן דורש שינון. אבל לא של המון חומר וזה גם לא כמו אימונולוגיה, זה לא שינון של ציטוקינים, זה שינון של רעיון... שינון של הקשיים, שינון של מה צריך בשביל להנדס רקמה. זה דורש השקעה אבל היופי הוא שבסוף ברגע שמשננים ויודעים את החומר אין איך להפתיע אתכם. יש בערך 15 שאלות אפשריות שמרסל יכולה לשאול ואתם מוכנים לכל שאלה. הציונים היו נהדרים, ממש כמעט כולם קיבלו מעל 90. שמעתי שמועות שמרסל בודקת את המבחן בקשיחות ומורידה נקודות על שטויות - אני לא מסכימה עם זה.\n\nהשורה התחתונה: אחלה של קורס, לא לפחד. אם מעניינת אותכם הנדסת רקמות רוצו לקחת ואל תקשיבו לביקורות רעות חסרות בסיס.\nבהצלחה :)", "timestamp": 1678961273220}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרסל מחלוף\nחוות דעת - הרצאות: הרצאות מעניינות ממש. מרסל מרתקת, מעבירה את החומר בצורה מעניינת ועניינית, נותנת המון דוגמאות אמיתיות מהמעבדה שלה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: סמינר קצר, לתואר ראשון הוא מגן של 25%. בוחרים נושא מתוך רשימה ובונים עליו מצגת, מוצאים 2-3 מאמרים בנושא ומציגים אותם בצורה ביקורתית- למה הם בחרו חומר מסוים או שיטה מסוימת, מה אפשר היה לעשות יותר טוב.\n\nהמבחן: בדרך כלל 2 שאלות ממוחזרות ואחת חדשה. אין מה לפחד מהמבחן.\n\nהשורה התחתונה: אחד הקורסים הכי מעניינים שלקחתי בתואר. מומלץ מאוד!!", "timestamp": 1679825787439}]}