{"posts": [{"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אסתי סגל ואבי \nחוות דעת - הרצאות: הקורס עצמו התחיל בצורה טובה אבל משם רק הלך והתדרדר, דבר ראשון יש פרזנטציות, הם חושבים שבשנה רביעית זה בסדר לחלק אותנו לקבוצות כאילו אנחנו עדיין מחפשים חברים, זה ממשיך כשאין שום תיאום בין אסתי לבין המתרגלות כל אחד אומר שיש לשים דגש על משהו אחר בפרזנטציה ככה שאנחנו הגענו למצב שיומיים לפני ההצגה בשעת הקבלה הם החליטו לשנות לנו את כל המצגת וכמובן שזה לא מה שאסתי רצתה וקיבלנו על זה לא מעט היערות, בשעת הקבלה ליזה אפילו לא חיכתה להגיע לשקופית חמש לפני שהיא באה ואמרה שהמצגת גרועה, זה המשיך בזה שיש שתי קבוצות הצגה ככה שכל אחת מגישה את המצגת יום לפני ההצגה דבר שיוצר חוסר שיוויון מוחלט בין הקבוצות כי הקבוצה השנייה לומדת מההערות וכמובן זוכה לציון טוב יותר, והכי גרוע היה שאסתי החליטה שאנחנו לא יודעים לקבל ביקורת כי כשאמרנו לה שהמצגת הייתה בנויה לפי ההנחיות באתר ושונו בדיוק בהתאם לרצון המתרגלות היא החליטה שאנחנו אשמים במצב ליזה החליטה לומר שהדברים במצגת שונו לא בעקבות השעת קבלה ואנחנו בעצם לא הבנו את מה שהם רצו להעביר, למרות שהכל היה כתוב בהנחיות ובחרו להתעלם מזה גם שאמרנו לה שזה לא הרצון של אסתי, שורה תחתונה זרקנו עלינו את כל האחריות הציונים היו בהתאם נמוכים בהרבה משנים קודמות. כמובן שאסתי לא אחת שנשארת אדישה למצב שבו באנו להגיד לה שהטעות היא לא שלנו והדבר בא לידי ביטוי במבחן עצמו שהיה ארוך בשאלה ממבחנים בשנים קודמות. ואסתי עצמה מרצה מעניינת מאוד במהלך השיעורים אבל חוץ מזה זה לא יוביל לשום מקום. \nאבי היה פחות עיקרי בקורס הרצאות נחמדות יחסית מעניין.\nבגלל המצב היו פחות תרגולים מבשנים קודמות אבל כמובן שבטכניון כמו בטכניון לא יוותרו על משהו ופשוט דחסו 2 תרגולים לאחד, לא עברנו על כל השאלות וגם על מה שכן זה היה מהיר מאוד ולא שם דגש על הרבה דברים.\nהעבודה על הפרזטנציה מאוד עמוסה ומעיקה המתרגלות עצמן לא בטוחות מה הם החומרים שמהם עשויים המוצרים ככה שצריך לנבור בספרות וגם שם לא כתוב כלום והכל בגדר השערות שגם אותן הם לא אוהבים, מביאים את העבודה כחודש לפני ההגשה אבל זה לא מספיק כיוון שהיא דורשת השקעה רבה ובאמצע סמסטר אין באמת הרבה זמן להתעסק בה. \nשם המתרגל/ת: ליזה וסתיו\nחוות דעת - תרגולים: \nסתיו תרגלה את הקורס בפעם הראשונה וניכר שהיא ממש השקיעה על מנת להעביר את החומר בצורה טובה יותר ודאגה שכולנו נבין את החומר על הצורה הטובה ביותר. מתרגלת טובה מאוד אבל פחות מתאימה לסגל כי היא חמודה מאוד. ליזה לעומת זאת אוכל להגיד לטובתה שבאמת העבירה את החומר בצורה טובה אבל הרבה פחוות סבלנית מסתיו, וכמובן לא לוקחת אחריות על דברים שהיא אומרת.\nשעורי הבית: \nאם מקשיבים בתרגולים שיעורי הבית ממש קלים לא דורשים ישיבה ממושכת. \nהמבחן: \nהמבחן היה ארוך בשאלה מהמבחנים בשנים קודמות וכלל תתי סעיפים רבים בכל שאלה, היה קשה יותר עם שאלות מתקילות. השאלה החישובית בצורה מאוד מיוחדת הצליחה להכיל את כל החומר של כל הסמסטר בשאלה אחת מסכנה שכמובן כללה את כל הטריקים האפשריים. \nשורה תחתונה ממוצע נמוך בערך ב7 נקודות. \n\nהשורה התחתונה: \nשורה תחתונה הקורס מעניין אבל לא שווה את המאמץ העבודה מאוד מעיקה וארוכה כמובן שעם אנשים שלא בחרנו, המבחן קשה.\nמי שלא חייב לקחת אל תעשו את זה לעצמכם.", "timestamp": 1716890149839}]}