{"posts": [{"author": "superunknown", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: הרצאות די חסרות תועלת, אני אישית לא נהניתי בכלל ורק קראתי סיכומי הרצאות.\nמה שכן הוא נורא נהנה להביא בשב דברים מההרצאות.\nלסיכום:שווה לעבור על סיכומים, לא יודע עד כמה שווה לראות.\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: התרגולים הועברו בצורה בזיונית, להעתיק ולהדביק מספר הקורס גם אני יודע.\n\nשעורי הבית:חסרי קורולוציה לרמה הנלמדת. גוגל וויקיפדיה עבדו קשה. \n\nהמבחן: עדיין לא נבחנתי\n\nהשורה התחתונה: תנסי/ה לתת דגש על חומר מהספר, הם נורא אוהבים אותו.", "timestamp": 1612277742009}, {"author": "אוטומוטו", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוסך לפקוביץ'\nחוות דעת: ג'ו מרצה טוב ומאוד נחמד, מסביר טוב אבל ההרצאות לא עזרו מאוד באופן כללי\n\nשם המתרגל/ת: עמרי חמו\nחוות דעת: מזעזע. \n\nשעורי הבית: אורך שיעורי הבית סביר והגיוני עבור הקורס, אבל לא ניתן מספיק זמן לפתור אותם בכלל (פחות משבוע) \n\nהמבחן: ארוך ומייגע בצורה לא סבירה\n\nהשורה התחתונה: חומר שיכול להיות מעניין, לא עם הסגל הזה. עדיף ללמוד הכל מהספר", "timestamp": 1613643860452}, {"author": "רין קרוט", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוסף לפקוביץ\nחוות דעת - הרצאות:  מרצה שמאוד משתדל וחשוב לו שאנשים יפנימו את החומר. נותן הרבה דוגמאות להבהרה במהלך ההרצאות. ההרצאות עמוסות למדי בגלל כמות החומר ומומלץ להשתתף בהן.\n\nשם המתרגל/ת: עמרי חמו\nחוות דעת - תרגולים: התרגולים לא חשובים יותר מדי. שאלות החזרה והסיכום שבספר הקורס מספקות אותו ידע בפחות זמן(למרות שכדאי לעבור על הקבצים). המתרגל קורא מהPDF כך שהליכה לתרגולים לא עדיפה על קריאת רשימות התרגול.\n\nשעורי הבית: שיעורי הבית עמוסים מאוד ולוקחים כמה שעות לכל הפחות. צוות הקורס שם דגש על הכנת שיעורי הבית והבדיקה קפדנית מאוד.\n\nהמבחן: מבחן ארוך מאוד. בלתי אפשרי לעשייה בזמן המוגבל\n\nהשורה התחתונה: קורס חובה עם המון חומר תיאורטי שצריך לזכור, ושימוש בהמון מיומנויות חישוב טכניות לאור כל הקורס", "timestamp": 1613758874726}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: מרצה רציני ואכפתי, שמשקיע מאוד בקורס וחשוב לו שהסטודנטים יבינו את החומר.\nההרצאות מתעסקות בעיקר בתאוריה ופיתוחים, ולא מאוד קריטיים לפתרון תרגילים.\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: כנ\"ל רציני וחשוב לו שידעו את החומר. משקיע מאוד בבדיקת התרגילים ובמשוב שלהם.\n\nשעורי הבית: ארוכים ומקיפים, מהווים חלק משמעותי מאוד בקורס.\n\nהמבחן: היה ארוך ולא פרופורציונלי לזמן שניתן, מתוך ידיעה שמהווה חלק קטן יחסית בציון הסופי וצריך להוריד את הממוצע.\n\nהשורה התחתונה: קורס חשוב ומעניין, ומועבר על ידי סגל רציני מאוד שמשקיע הרבה.", "timestamp": 1614092026487}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  גו לפקוביץ'\nחוות דעת - הרצאות: \nברורות\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: בינוניים - לא הכי מובנים אבל גם לא נורא\n\nשעורי הבית: השיעורים עצמם בסדר- הבדיקה שלהם מוגזמת שלא לצורך\n\nהמבחן: לא הגיוני בעליל- מבחן בלחץ זמן לא אפשרי, כמות שאלות ל6 שעות בזמן של 3 שעות בלבד\n\nהשורה התחתונה:  מאוד מאוכזב מסגל הקורס", "timestamp": 1614541688841}, {"author": "מ", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות:  הרצאות חשובות להבנת החומר ושיעורי הבית. מועברות באנגלית. \n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: מתרגל טוב, רושם בקובץ PDF מסוכם את כל החומר שצריך מההרצאה בפשטות ובעברית. עונה על שאלות וגם אם מותקל בתרגול עונה אחרכך מפורט\n\nשעורי הבית: לא פשוטים, דורשים זמן והבנה טובה של התאוריה ואולי השיעורי בית היחידים שבאמת נבדקים לעומק בטכניון\n\nהמבחן:  המבחן היה בלתי אפשרי לפתרון ונועד להוריד את הממוצע בגלל שיטת הניקוד של הציון הסופי (50% ש.ב תקף 20% בוחן אמצע 30% מבחן סופי). כנראה לא יקרה שוב סמסטרים הבאים\n\nהשורה התחתונה: קורס מאוד מעניין חשוב ומבלבל באותה נשימה. דרוש השקעה במהלך הסמסטר להבנה", "timestamp": 1614802452970}, {"author": "תקשיבו לי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "מדובר על סמסטר קורונה!!!!!!!!!!!!\n\nשם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: ממש חדגוניות ומייאשות, ראיתי את ההקלטות בקצב של פי 3, לא הרגשתי שהם תרמו ללמידה.\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: התרגולים עצמם על הפנים-פשוט הקראה מדף,אבל הקובץ עצמו בסדר כך שניתן להסתדר עם זה באופן סביר.\n\nשעורי הבית: משאבות זמן,קשים ומייגעים-מצד שני היו אצלנו כמגן של בערך 50 אחוז.\n\nהמבחן: לא פייר בכלל, כמות שאלות לא הגיונית לזמן המבחן, מצד שני ניתן במועד א' 24 נקודות בונוס לציון בחינה.\n\nהמלצה-שווה לעבור על הקורס המוקלט במקרה והוא חופף, לשבת על התרגולים וסיכומי הרצאות יותר מועיל לפעמים מההרצאה עצמה.\n\nהשורה התחתונה:", "timestamp": 1626826276067}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: \nהרצאות מועברות באנגלית. ג'ו די מסודר בהסברים שלו. ההרצאות מלאות בהרבה מאוד תיאוריה על החומר ולכן יכולות להיות קצת מייגעות.\nשם המתרגל/ת: גיא ארד לוי\nגיא מתרגל רציני ובעל מוטיבציה רבה ללמד.\nחוות דעת - תרגולים: \nהתרגולים חיוניים להבנת החומר ותיאוריה מההרצאות.\nשעורי הבית: \nהשיעורים הם בהחלט חלק מרכזי בקורס. לא סתם הם מהווים 30% מהציון הסופי. חשוב מאוד להשקיעה בתרגילי הבית וגם להתרגל לבדיקה הקפדנית שלהם.\nהמבחן: \n\nהשורה התחתונה:\nקורס מעניין וחשוב להמשך אך גם בעל המון חומר תיאורטי יחסית.", "timestamp": 1643981834915}, {"author": "אויילר", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גו לייפקוביץ\nחוות דעת - הרצאות:  מרצה טוב, מלמד ממש מהספר ככה שלא חייב לבוא אבל סהכ בסדר גמור\n\nשם המתרגל/ת: דוד חסין\nחוות דעת - תרגולים: מתרגל טוב מעביר את החומר כמו שצריך ומחדד את ההרצאות\n\nשעורי הבית:  לוקחים טיפה זמן, לא קשים מידי, אבל קולעים לעניין ותורמים להבנה של החומר\n\nהמבחן:  הוגן מאוד, הציון מורכב גם מחמישים אחוז מגן שמורכב מ30 שב ו 20 מבחן אמצע ככה שניתן להוציא ציון גבוה בקורס\n\nהשורה התחתונה:  קורס קשה, אבל לא מידי, מעניין מאוד ומהווה קורס פותח למקצועות ההנעה", "timestamp": 1645635386292}, {"author": "~", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: הרצאות באנגלית, 3 שעות של חומר תיאורטי שהרבה פעמים לא באמת נחוץ ודי משעמם, אבל בכל זאת מומלץ לבוא להרצאות.\n\nשם המתרגל/ת: גיא ארד לוי\nחוות דעת - תרגולים: מלך, תמיד מוכן לעזור, מסביר ברור, והייתה אווירה טובה בתרגולים שלו\n\nשעורי הבית: פעם בשבוע גיליון קצת ארוך שגם נבדק בקפידה, אבל 30 אחוז מגן אז הגיוני\n\nהמבחן: היה בוחן אמצע של 20 אחוז שהיה קליל אבל קטלו בבדיקה, המבחן כבר היה יותר קשה (במיוחד האמריקאיות)\n\nהשורה התחתונה: קורס בסדר, יש כאלה שאפילו יאמרו שמעניין", "timestamp": 1646383724186}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: \nההרצאות היו יחסית מעניינות. לימד בצורה יחסית מתמטית ופחות ניסה להראות את הדברים כמו שהם בעולם האמיתי. אחלה מרצה, היה מאוד ברור אף על פי שההרצאות היו באנגלית.\nשם המתרגל/ת: גיא ארד לוי\nחוות דעת - תרגולים: \nמתרגל נהדר, הגיע מוכן לכל התרגולים וידע להסביר טוב. ידע על מה להתעכב כי זה נושאים שמסבכים את הסטודנטים וסך הכל הכין אותנו היטב לבחינה. מעבר לזה גם היה מאוד זמין לשאלות.\nשעורי הבית: \nעל בסיס שבועי. הגיליונות לרוב לקחו לא מעט זמן, אבל היו מאוד רלוונטיים.\nהמבחן: \nמועד א' היה הוגן. החלק האמריקאי לא היה קל במיוחד, הפתוחות היו יותר קלות.\nהשורה התחתונה: אחלה קורס, מעניין ממש", "timestamp": 1647426415554}, {"author": "סטודנט עייף", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: \nג'ו מרצה נהדר, הוא מסביר מעולה, למרות השפה האנגלית, יש לו קבצי הרצאות במודל והוא כותב על הלוח בעזרתם - נוח מאוד!\nשם המתרגל/ת: חיים ברוד\nחוות דעת - תרגולים: \nקצת חסר כריזמה אבל בן אדם נחמד, מאוד רצה בהצלחתנו ועזר תמיד כשביקשו ממנו.\nשעורי הבית: \nעל בסיס שבועי, מייגעים אבל מלמדים מאוד, דרך נהדרת ללמוד טוב את החומר במהלך הסמסטר.\nהמבחן: \nהמבחן היה קשה מהמצופה אבל בסופו של דבר הוגן אחרי פקטור של 4 נקודות בודדות.\nהשורה התחתונה: \nקורס מעניין - והסימפטי ביותר בסמסטר הזה.", "timestamp": 1677777181117}, {"author": "מי רוצה לשתות אנטרופית?", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ג'ו לפקוביץ\nחוות דעת - הרצאות: \nג'ו מרצה סבבה, ההרצאות יכולות להרגיש קצת איטיות ואין לו הכי הרבה רגש אבל הוא מגלה המון עניין והבנה בחומר. בהרצאות עוברים לפעמים על כמה דברים חשובים שלא מופיעים אחר כך בתרגולים או שיעורי בית אבל חשובים למבחן- מומלץ ללכת. (לא לשכוח שההרצאות מועברות באנגלית!)\n\nשם המתרגל/ת: שגיא דיניסמן\nחוות דעת - תרגולים: \nשגיא מתרגל בסדר גמור, לא רץ מהר מידיי עם החומר ומסביר באופן ברור. התרגולים עוזרים ושימושיים לפתרון שיעורי הבית והבנת החומר אבל אפשר גם להסתדר עם הרשימות במודל ולא לבוא פיזית. \n\nשעורי הבית: \nגיליון כל שבוע, כשיש חלון זמן של שבוע אחד להגשת כל גיליון. אורך הגיליונות נע בין קצר וקל יחסית לארוך ומייגע מה שיוצר לפעמים עומס (תאמינו לי כשאני אומר שמי שרושם עם עט ודף לא יהנה מכמות הכתיבה). עם זאת הגיליונות עוזרים מאוד להבנת החומר וחשובים כדי להתכונן למבחן ומהווים 20% מהציון הסופי כמגן.\n\nהבוחן אמצע:\n4 אמריקאיות ושאלה אחת פתוחה, שעה וחצי. בסה\"כ סבבה, קצת עמוס כי יש הרבה כתיבה אבל עוזר מאוד להבנת החומר. מהווה כסוג של מגן- כ30% מהציון הסופי אם אתם משיגים בו ציון גבוה יותר מהמבחן אז כדאי להשקיע לקראתו כי זה חתיכת גלגל הצלה.\n\nהמבחן: \nאצלנו היו 8 אמריקאיות ו2 פתוחות ארוכות. המבחנים בסמסטר שלנו הפתיעו לרעה-המבחנים במודל משנים קודמות של ג'ו (לא שיש כל הרבה כן) היו לא רעים בכלל עם שאלות פתוחות שדורשות חשיבה אבל גם לא ארוכות מידיי, אז קיבלנו רושם שהמבחן יהיה נחמד אבל בסוף זה לא קרה. במועד א' השאלות הפתוחות היו ארוכות וקשות בהשוואה לשנים אחרות ובמועד ב' האמריקאיות היו קשות יותר ובנוסף באחת השאלות הפתוחות היה סעיף שאף אחד לא הצליח לענות עליו שגרם לכל מיני סיבוכים עם שאר השאלה.\n\nהשורה התחתונה:\nלמרות המגרעות של המבחנים הקשוחים מהרגיל שהיו לנו ושיעורי בית די עמוסים בזמנים, הקורס הזה דווקא יותר סימפטי ממה שאתם חושבים- הציון הסופי בנוי ככה שאם מוציאים בבוחן אמצע והשיעורי בית ציון טוב אז המבחן יהיה רק 50% מהציון הסופי! אתם יכולים לקבל ככה ציון ממש טוב שזה נהדר לקורס של 4 נק\"ז. הסגל גם ממש אחלה בכל מה שקשור להעברת החומר וזמינות למענה לסטודנטים. לסיכום, זה לדעתי הקורס הכי מעניין בסמסטר שגם חשוב להבנה לקראת המשך הלימודים.", "timestamp": 1679339869707}, {"author": "יוחאי יהב", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מועבר בצורה הכי טובה שאפשר מרצה מעולה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: שגיא מסביר ברור קצר וקולע\n\nשעורי הבית: לא כל כך מפורטים\n\nהמבחן: \n\nהשורה התחתונה: קורס מעניין אם מרצים מעולים", "timestamp": 1713342328086}, {"author": "Mordechai Sambol", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוסף (ג'ו) לפקוביץ\nחוות דעת - הרצאות: מאוד טובות. ג'ו מאוד מסודר וקל לעקוב אחריו. הוא עושה דברים בצורה מאוד מתמטית - מפתחים הרבה נוסחאות, ולא תמיד מתמקדים במשמעות של הדברים. זה היה לי קצת חסר, אבל כל עוד מצליחים לעקוב אחרי המתמטיקה, אפשר ממש להישאר איתו ולהבין את החומר. הוא גם מרצה מאוד נחמד, דואג לסטודנטים ותמיד מוכן לענות על שאלות ואפילו אם זה אומר שהוא נשאר בכיתה אחרי סוף ההרצאה.\n\nשעורי הבית: יש גליון כל שבוע וצריך להקדיש לו את הזמן. הגליון מבוסס על הדברים שנלמדו בהרצאה, אבל בכל זאת לא תמיד קל לעבור מהעקרונות לפתירת התרגילים. לוקח שעתיים-שלוש כל שבוע.\n\nהמבחן: הרגיש ארוך וקשה, אבל אפילו אחרי בדיקה די מדקדקת רוב האנשים קיבלו ציון טוב בקורס.\n\nהשורה התחתונה: קורס קשה, אבל מאוד מעניין. מומלץ להשקיע בו, וכשעושים יותר מידי מתמטיקה אז גם לשאול שאלות כדי שיסבירו את הרעיונות מאחורי דברים.", "timestamp": 1716138383371}]}