{"posts": [{"author": "גולן שמי", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: \nהרצאות טובות ומובנות עם הרבה מלל ולא רק משוואות מתמטיות. המרצה לפעמים מתבלבל משאלות וצריך קצת זמן לאסוף את עצמו. סך הכל די טוב.\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים: תרגולים מעולים, עוזרים וחיוניים להבנה. מתן מדהים, סבלני מאוד ועונה על כל שאלה בשמחה. גם במייל.\n\nשעורי הבית: בינוני\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612379577449}, {"author": "רין קרוט", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: ההרצאות ארוכות ומעט מייגעות ומלאות בפיתוחים מתמטיים של החומר מההתחלה ועד הסוף. המרצה נותן דגשים עיקריים בכמה מקומות.\n\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים:  מתרגל מעט איטי אך עם גישה מאוד חיובית ומקנה כלים להבנת החומר ומיומנות פתירת שאלות.\n\nשעורי הבית: שיעורי בית יחסית מרופרנסים, ארוכים במקצת אך לא נוראיים\n\nהמבחן: מתמטי כמו הקורס, ברמה הוגנת ובדיקה קפדנית\n\nהשורה התחתונה:", "timestamp": 1613759112543}, {"author": "itai freeman", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ואדים\nחוות דעת - הרצאות: לא טובות, נוח לראות אותו מוקלט כפול 2\n\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים: מדבר לאט אבל מסביר מעולה\n\nשעורי הבית: \n\nהמבחן: קשה\n\nהשורה התחתונה: קורס קשה", "timestamp": 1614011638078}, {"author": "roni shapiro", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: קצת משעממות אבל ברורות\n\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים: מעולים- הסברים טובים\n\nשעורי הבית: סבירים\n\nהמבחן: מבחן יחסית הוגן אם כי דורש גם שליטה בקורס מדר ובטריגו\n\nהשורה התחתונה:", "timestamp": 1614541782903}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות:\nהרצאות די ברורות. מלאות בפיתוחים מתמטיים על החומר אבל יש גם דוגמאות\n\nשם המתרגל/ת: תומר בן אשר\nמעט מבולגן אבל עם גישה חיובית ללמד את החומר כמו שצריך ומוטיבציה לענות לשאלות.\nחוות דעת - תרגולים: \nהתרגולים חיוניים להבנת החומר, שם לומדים את הפרקטיקה של טכניקות לפתרון בעיות.\nשעורי הבית: \nהשיעורים זהים לחלוטין לשיעורים של סמסטר שעבר\nהמבחן: \nמבחן די סביר\nהשורה התחתונה:\nקורס מאתגר, לא פשוט אבל מאוד מעניין וחשוב להמשך. חשוב מאוד לא לצבור פערים בקורס.", "timestamp": 1643981500302}, {"author": "אויילר", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: משעממות,ארוכות,ללא טעם. הרבה מן ההרצאות זה פיתוחים שבסופם פשוט תסיימו במסקנה משלוש שעות של פיתוח, ואין שום דרישה להבין או לדעת את הפיתוחים. את החומר האמיתי שתיבחנו עליו הוא בקושי מתרגל.\n\nחוות דעת - תרגולים: אחד טוב השני קצת פחות בכל אופן גם שם אפשר לשפר למרות אליהם חשוב לבוא כי זה הרגע היחיד בו באמת לומדים משהו שימושי למבחן.\n\nשעורי הבית:  מעטים מידי לקורס כזה, קשים אבל לא יותר מידי.\n\nהמבחן:  הוגן, אם כי קשה.\n\nהשורה התחתונה:  קורס קשה מאוד שלא מועבר טוב.", "timestamp": 1644156306348}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: 3 שעות שרובן פיתוחים מתמטיים. לא קל בכלל ובתכלס לא הכרחי כדי לדעת את החומר, אבל מי שהקורס מעניין אותו יאהב לדעת מה עומד מאחורי כל הנוסחאות שמגיעים אליהן\n\nשם המתרגל/ת: יורן מיץ\nחוות דעת - תרגולים: יורן בא בגישה מאוד חיובית ללמד ולהסביר, ובדרך כלל גם הצליח להביא את זה לידי ביטוי\n\nשעורי הבית: 5גליונות ממוחזרים, חלקם נבדקו באמת וחלקם לא\n\nהמבחן: מועד א היה הוגן סה\"כ אבל עדיין לא פשוט\n\nהשורה התחתונה: כדאי להבין טוב את החומר ולא לאלתר לפני המבחן", "timestamp": 1646384229668}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: \nלרוב יחסית משעממות, אבל הכרחיות כדי לעקוב אחרי החומר.\nשם המתרגל/ת: יורן מיץ\nחוות דעת - תרגולים: \nלא תמיד הגיע מוכן עד הסוף, התבטא בעיקר בשאלות על החומר או על התרגילים שפתרנו שלא ידע לענות עד הסוף. \nשעורי הבית: \n5 גליונות, לא קלים במיוחד אבל אם יושבים עליהם קצת אז אפשרי ממש לפתור אותם.\nהמבחן: \nמועד א' היה מאוד הוגן. מועד ב' היה קשה ברמה קיצונית.\nהשורה התחתונה: סך הכל חומר מעניין, גם אם לא תמיד מעבירים אותו ככה", "timestamp": 1647426608604}, {"author": "David Karabut", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי בן אשר\nחוות דעת - הרצאות: יוסי מסביר לאט לאט את החומר ולפעמים הוא מתעכב על שטויות שלדעתו חשובים אבל תכלס כןלם הבינו ואז מאבדים את הריכוז\n\nשם המתרגל/ת: מירון דואר\nחוות דעת - תרגולים: מירון בנה קבצים חדשים לתרגולים וזה מדהים תכלס אפשר אפשר ללמוד רק מהם. מירון ממש משקיע ואכפת לו מהסטודנטים הוא ליטרלי עשה שעת קבלה לפני המבחנים בה במשך 7 שעות רצוף עשה סיכום על החומר והדגיש דברים חשובים ששם לב שאנשים עושים בשיעורי בית. התרגולים בהתחלה היו עמוסים אבל עם הזמן הוא הבין את זה והשתפר. בקיצור ממש ממליץ ללכת אליו\n\nשעורי הבית: היו 5 גליונות. כאשר ה5 היה לצורך שיפור ציון .השיעורי בית היו ארוכים וקשים אבל מאוד עוזרים להבנת החומר \n\nהמבחן: המבחן היה הוגן ותכלס אם למדת אליו טוב והשקעת זמן בלהבין את הדברים הקטנים אפשר להצליח בו.\n\nהשורה התחתונה: קורס קשה אבל באותו הזמן גם מאוד מעניין", "timestamp": 1676485829337}, {"author": "סטודנט ששרד כדי לספר", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יוסי בן אשר\nחוות דעת - הרצאות: \nמרצה טוב, נלהב מאוד, אך לצערנו הקשר בין ההרצאות לתרגולים ושיעורי הבית היה מקרי בהחלט, שלא לדבר על הבחינה.\nשם המתרגל/ת: מירון דואר\nחוות דעת - תרגולים: \nהגיע מהנדסת מכונות והחליט לבנות את הקורס מאפס, היו הרבה טעויות בדפי התרגולים שלו, השיעורי בית היו קשים להחריד. הוא גם בנה את המבחן והוא היה קשה מעבר לכל מה שדמיינו שיהיה ולא חסר קושי בקורס הזה.\nשעורי הבית: \n4 גליונות במהלך הסמסטר ו1 במהלך תקופת המבחנים לשיפור ציון. רמה קשה ולחלקם לא היו רפרנסים. הבדיקה הייתה מוקפדת יתר על המידה.\nהמבחן: \nבטוח שמעתם דברים רעים על דינמיקה - תכפילו בחמש סדרי גודל ותקבלו את המועד א' שהיה לנו. היו אלמנטים בבחינה שלא נגענו בהם במהלך הקורס, המרצה אמר על המבחן דברים מצד אחד, בפועל המתרגל כתב את הבחינה והופיעו דברים אחרים. במהלך הבחינה הסגל הבהיר דברים שרק גרמו לבלבול נוסף והם התעקשו על כך שהמבחן נוסח באופן הכי ברור שיש - לא מחוברים למציאות, מזעזע! היה פקטור עצום שהציל הרבה סטודנטים.\nהשורה התחתונה: \nלעבור ולשכוח - קורס נוראי!", "timestamp": 1677777500601}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי בן אשר\nחוות דעת - הרצאות: מרצה שמאוד אוהב ללמד ופנוי לכל שאלה לא מובנת.\n\nשם המתרגל/ת: מירון דור\nחוות דעת - תרגולים: מירון הוא כנראה המתרגל הכי אכפתי שיצא לי לפגוש, זה אומר שהוא נותן את כל הלב שלו לנו הסטודנטים, זה מתחיל בזה שהוא נותן המון שעות קבלה של שעות על גבי שעות, ונגמר בזה שלקח לו חצי יממה לבדוק את מועד ב'. מירון ללא ספק דורש יותר משנים קודמות אבל זה לא דבר אסור אלא אפילו מבורך אם זה בא ביחד עם השקעה מצידו ורצון אמיתי שנצליח.\n\nשעורי הבית: לא קלים\n\nהמבחן: מועד א מאוד קשה, ב' יותר נורמאלי\n\nהשורה התחתונה:", "timestamp": 1678863163890}, {"author": "יוחאי יהב", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי \nחוות דעת - הרצאות: מעניינות וטובות מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשין\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713342377140}]}