{"posts": [{"author": "ניר טורק", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: חיים אברמוביץ'\nחוות דעת - הרצאות: ההרצאות ארוכות ומייגעות\n\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים: מתרגל מצויין. יודע להעביר את הנושא כמו שצריך ומשכיל לתמצת את ההרצאות ולהגיש הכל באופן מעולה.\n\nשעורי הבית: 5 גיליונות שלוקחים כשעה כל אחד\n\nהמבחן: מבחן סביר לחלוטין. שאלה אחת קלה יחסית ושאלה אחת קשה\n\nהשורה התחתונה:", "timestamp": 1597920432378}, {"author": "itai freeman", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מעטים כמעט להכל יש רפרנס\n\nהמבחן: עמוס\n\nהשורה התחתונה: קורס בסדר על לבוחן אמצע ואחריו מתחיל להיות עמוס", "timestamp": 1602069164181}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: חיים אברמוביץ\nחוות דעת - הרצאות: משעמם מעט, לעיתים אולי לא מובן אבל מרצה בסדר בסהכ\n\nשם המתרגל/ת: מתן שטיינר\nחוות דעת - תרגולים: נחמד ומסביר, לפעמים איטי\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602483382431}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חיים אברהומוביץ\nחוות דעת - הרצאות: איטי, משעמם, חבל. עדיף ללמוד לבד את החומר יש מלא הרצאות נהדרות באינטרנט שיחסכו זמן ושפיות.\n\nשם המתרגל/ת:  תומר\nחוות דעת - תרגולים: מתרגל שאכפת לו.\n\nשעורי הבית: שואפים לאפס, בהחלט חסרון בהכנה לבחינה\n\nהמבחן: מבחן הוגן.\n\nהשורה התחתונה: קורס מעניין, סגל שחסרה לו המוטיבציה.", "timestamp": 1625755300244}, {"author": "אנונימוס", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: ארוכות ולא מאוד מעניינות, אבל חיים נחמד סהכ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין הרבה ולא מאוד קשים\n\nהמבחן: הבוחן אמצע יחסית בסדר, למבחן צריך ללמוד טוב\n\nהשורה התחתונה:", "timestamp": 1625822076167}, {"author": "123", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: אפס קריזמה-לא יודע ללמד. מקריא מצגת \n\nשם המתרגל/ת: גרגורי\nחוות דעת - תרגולים: לא שולט בחומר- יותר מבלבל מעוזר\n\nשעורי הבית: לא נותנים שיעורי בית לכן אי אפשר לדעת מה המצב שלך בחומר.\n\nהמבחן: \n\nהשורה התחתונה: להסתמך עד כמה שפחות על התרגולים או הרצאות. להשתמש במבחנים בישביל להבין מה הרמה המבוקשת", "timestamp": 1626088962960}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חיים אברמוביץ'\nחוות דעת - הרצאות: ההרצאות משעממות וארוכות. החומר עצמו לא מסובך כלכך אבל הוא מאוד לא אינטואיטיבי ולוקח קצת זמן להבין אותו\n\nחוות דעת - תרגולים: התחושה בקורס היא שהמתרגלים לא רוצים לתרגל את החומר או שהם פשוט לא יודעים אותו כמו שצריך\n\nשעורי הבית: היו 3 גליונות, לא כלכך ארוכים. הבעייה הייתה שהם כיסו רק את החומר של הבוחן אמצע ונושא אחד מהמבחן אז הם כמעט לא עזרו בהפנמה של החומר. \n\nהמבחן: מאוד טכני, עדיף להבין מה לעשות מאשר להבין את החומר. צריך להסתכל על כמה שיותר מבחנים משנים קודמות וללמוד מספיק זמן מראש כדי לדעת את כל השיטות שהם רוצים שתשתמש בהן.", "timestamp": 1626103323977}, {"author": "The truth.", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: פרופ' חיים אברמוביץ'\nחוות דעת - הרצאות: הרצאות מאוד אבל מאוד משעממות - אבל לא בגלל החומר עצמו אלא בגלל הצורה שבה מלמדים אותה , פשוט 3 שעות של קריאת מצגת של אוסף תרגילים שנלקחו מאיזה ספר באנגלית אי שם בשנות השבעים ובזה מסתכמות ההרצאות של הקורס הזה. עצה שלי אל תלמדו מהם בכלל - פשוט תראו את Jeff hanson ביוטיוב לי הוא עזר ממש בעיקר לקראת הבוחן אמצע\n\nשם המתרגל/ת: גרגורי\n\nחוות דעת - תרגולים: ביזיון. רמת מקצועיות וידע ששואפת לאפס - באיזשהו שלב הרגשתי באופן אישי שאני יכול להחליף אותו והמצב רק היה יכול להשתפר - כי להעתיק מה שכתוב בדף התרגול ללוח ולקרוא בקול לא באמת מלמד ועוזר להבין - ולראייה בכל פעם שמישהו שאל שאלה הוא פשוט לא ידע מה לענות - דיבר על זה משהו ככה בעקיפין במקום לענות כמו שצריך. בדיעבד ממליץ לכם ללכת לתומר אם אלה האופציות שלכם (לא חסר על מה להתלונן גם אצלו אל תדאגו)\n\nשעורי הבית: עוד יותר ביזיון. פרסום 3 גיליונות ללא סדר מסוים. למשך כמעט חודש הקורס הזה היה פשוט מושתק ולרגע הרגשתי שאני בכלל לא לומד אותו הסמסטר. חוסר השקעה בבניית הגיליונות , ליטרלי העתקה של כמה תרגילים מאיזה ספר באנגלית ואפילו לא טרחו לתרגם אותו  ברמה הבסיסית באחד הגיליונות. 3 גיליונות שלא כיסו את כל החומר למבחן, ואף אחד לא בודק אותם רק מסמנים לכם 100 שהגשתם וזהו, ופשוט מעלים פתרונות למודל שבתכלס זה פשוט הרפרנסים שעוברים בין סטודנטים גם ככה - והפתרונות האלה זה פשוט התשובות בספר שלא תחשבו שיש פה איזה משהו מטורף- בקיצור אל תבנו על תרגילי הבית בתור משהו שאפשר ללמוד ממנו למבחן.  \n\nהמבחן: לא הכי קשה שיש -פשוט לדעת איך לפתור כל תרגיל בצורה הכי יבשה שיש.\n\nהשורה התחתונה: דבר אחד טוב שייאמר לזכות הסגל, זה הבדיקה הרחמנית מאוד במבחן. בהצלחה!", "timestamp": 1626639265494}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חיים אברמוביץ\nחוות דעת - הרצאות: \nארוכות בלי צורך מרצה מאוד איטי ועוצר כל רגע \n לראות את ההקלטות אם יש ורק במקרה שלא מבינים משהו בתרגול או בשיעורי בית \nעדיף לקרוא סיכום של מישהו \nשם המתרגל/ת: תומר בן אשר \nחוות דעת - תרגולים: \nמתרגל מזעזע שלא יודע את החומר אבל מרגיש שכל הקורס הזה לא יודעים את החומר וממציאים תוך כדי\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1647351550513}, {"author": "ריקי", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: מתיש וחסר התחשבות. ההרצאות מתקיימות בערב מחמש עד שמונה, במשך שלוש שעות עם הפסקה קצרה באמצע, חוסר בתחשבות בסטודנטים, שעות הזויות.\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: הציל את הקורס, בנאדם אחד נורמלי\n\nשעורי הבית: 3, לא מיפו את החומר בכלל\n\nהמבחן: קשה מאוד, המרצה החליט לשים שאלה במבחן ברמה גבוהה כל כך שהרסה את כל המבחן (היו שלושה שאלות)\n\nהשורה התחתונה: קורס שיכל להיות מעניין אם הצוות, בעיקר המרצה היה מתחשב בסטודנטים, ומלמד פחות משעמם.", "timestamp": 1662299371160}, {"author": "...", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ספדי מחמוד\nחוות דעת - הרצאות: מרצה מתחת לכל ביקורת, בזבז זמן יקר על דברים בסיסיים ולא רלוונטים לקורס, ולכן לא סיימנו את הסילבוס בזמן, מחמוד קבע עובדה שתהיה הרצאת השלמה לאחר סוף הסמסטר, שזה דבר לא תקין בפני עצמו, וכמובן לא עדכן לגבי ההרצאת השלמה ופשוט נעלם. כל שבוע על בסיס קבוע היה מושך את כל הקורס בממוצע לפחות 15 דקות נוספות אחרי השעה 20:00 כשגם ככה שעות ההרצאה היו לא סבירות (17:00-20:00), העובדה שלא סיימנו את הסילבוס פגעה בנו במבחן. חוסר תיאום מקצועי בין המרצה למתרגלים ברמה שמאוד מפריעה ללמידה למבחן, מבחן לא הוגן בשום צורה, יותר מ80 אחוז מהקורס לא הצליחו שאלה ששווה 34 נקודות ולא הייתה שום התחשבות, חוסר מענה לשאלות במיילים מצידו של מחמוד, ונכון להיום שלושה ימים לפני המועד ב, עדיין אין תשובות לערעורים על מועד א.\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא רלוונטי בכלל כאשר המרצה האחראי הורס את כל הקורס\n\nשעורי הבית: \n\nהמבחן: \nלא הוגן \nהשורה התחתונה:  כל יום שמחמוד ממשיך להרצות רק יפגע במצב הגם ככה גרוע.", "timestamp": 1664277410023}, {"author": "איפ", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עילם.\nחוות דעת - הרצאות: הוא מנסה, הוא נחמד סך הכל, אבל באמת שאי אפשר להבין אותו בכלל. לא מנהל את הקורס, יודע את החומר אבל לא יודע איך להעביר אותו. חפשו חומר ביוטיוב באמת.\n\nשם המתרגל/ת: שחף\nחוות דעת - תרגולים: מי שם סטודנט לתרגל קורס כזה כבד? בטוח שהוא מבריק ועם כוונות טובות אבל כאילו באמת. מלא טעויות, רמת התרגולים לא תואמת את רמת השיעורי בית (שלא נדבר על רמת הבוחן). והמתרגל השני גרגורי - זה באמת בדיחה. באיזה שהוא שלב הפסקתי לבוא לתרגולים וקראתי רק מהרשימות של התרגולים ובאמת לא הרגשתי חוסר.\n\nשעורי הבית: קשים, לוקחים זמן. קשה להבין משהו בקורס הזה ושיעורי הבית זה הדרך היחידה ללמוד משהו. כמעט הכל לקוח מספר הקורס אז יש רפרנסים.\n\nהשורה התחתונה: איזה קורס סיוט באמת. אם היה מנוהל טוב ועם סגל סביר כנראה שהיה קורס חביב לדעתי.", "timestamp": 1689348157250}, {"author": "לא תודה", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עילם אמיר\nחוות דעת - הרצאות: אפשר לספור את כמות הסטודנטים שהקשיבו לו בהרצאות על חצי יד. מאוד אבל מאוד משעמם, ויותר מזה די מבולגן ולא מובן. עושה גם לא מעט טעויות. יחד עם זאת הוא כן בקיא בחומר וכן אכפתי כלפי הסטודנטים, רק חשוב ללמוד את החומר ממקור אחר.\n\nשם המתרגל/ת: שחף היימן\nחוות דעת - תרגולים: מי יודע אם בכלל ימשיך לתרגל, אבל במידה וכן, מאוד מומלץ. ברור, מסודר ויסודי.\n\nשעורי הבית: הכי קלים שבעולם. אפשר גם לרפרנס למי שבאמת אין כח, ואפילו אין הרבה סיבה שלא - הקורס בנוי כך שאפשר ללמוד כל חלק של החומר בכל זמן. ממליץ בכל זאת לא לרפרנס, רק כדי שלא יווצרו פערים...\n\nהמבחן: מועד א היה הוגן. די חישובי, אבל נותנים את הפיתוחים המעצבנים באמת, אז לא נורא מדי. אם מתרגלים מספרי הלימוד (ורק מהם/מהקבצים שעילם עורך מהם! מבחני עבר בכלל לא רלבנטיים) אפשר להוציא עובר עם חיוך, ועם השקעה והבנה גם 80+ זה לא חלום.\n\nהשורה התחתונה: משמים במהלך הסמסטר. אם אתם עמוסים וחייבים להוריד גז מלמידה במהלך הסמסטר - הנה לכם קורס כזה.", "timestamp": 1690996248499}]}