{"posts": [{"author": "אביחי בוכריס", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: פרופ' דניאלה רווה\nחוות דעת - הרצאות: ראיתי את ההרצאות בוידאו שגם שם דניאלה מלמדת. לדעתי היא מרצה מעולה וכיף להקשיב להרצאות שלה. הנקודה הבעייתית היחידה היא שיש לה קול יחסית נמוך אז צריך לבוא עירניים להרצאה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן ברמה סבירה\n\nהשורה התחתונה: קורס מעניין וחובה למי שחושב להתעסק בתחום האוירונוטיקה", "timestamp": 1599652520456}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: דניאלה רווה\nחוות דעת - הרצאות:\nהרצאות זורמות, המרצה מאוד נחמדה ופנויה לענות לשאלות רבות תוך כדי ההרצאות ולא חוסכת זמן על זה. הייתה הרצאת אורח אחת.\n\nשם המתרגל/ת: נועם לייטנר\nחוות דעת - תרגולים:\nהמתרגל תירגל אצלנו פעם ראשונה. מאוד אכפתי כלפי הסטודנטים ומאוד רוצה לעזור, אך חוסר הנסיון ניכר והתרגולים היו מעט מסורבלים ולא מובנים.\nעם זאת, אני בטוח שאם הוא יתרגל פעם נוספת את הקורס, לא מן הנמנע שיהיה טוב יותר ושווה להיות נוכח בתירגולים עם מתרגל שאכפת לו ממך.\n\nשעורי הבית: \nדומים מאוד לשנים קודמות. אך גם ללא שימוש ברפרנסים לא דורשים יותר מכמה שעות בודדות עבור גיליון.\n\nהמבחן: \nהוגן מאוד, מי שחד על החומר במהלך הסמסטר ופותר את הגליונות לבד אין סיבה שלא יצליח במבחן(אין הפתעות)\n\nהשורה התחתונה: \nקורס חביב, קליל. שווה גם בתור קורס בחירה עבור מי שבוחר באשכול אסטרונאוטיקה", "timestamp": 1603098726359}, {"author": "Ori pikcles", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: מעניינות סהכ\n\nשם המתרגל/ת: צוף\nחוות דעת - תרגולים: מסבירים טוב את החומר\n\nשעורי הבית: לא קשים מידי ותורמים להבנה\n\nהמבחן: ברמה הגיונית\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1613649688083}, {"author": "Ori pikcles", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1614954309911}, {"author": ":)", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nספציפית היה מבחן לא קל אבל לרוב רמת קושי סבירה ופתירה\n\nהשורה התחתונה: \nאחלה קורס נותן מושג", "timestamp": 1645736120541}, {"author": "פניה מתואמת", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאלה רווה\nחוות דעת - הרצאות: \nדניאלה מרצה טובה אבל מומלץ לשבת בשורות הראשונות או להביא מכשיר שמיעה.\n\nשם המתרגל/ת: צוף ג'ואלס\nחוות דעת - תרגולים: \nצוף מתרגל שנע בין טוב למעצבן. עוד לא החלטתי לגביו.\n\nשעורי הבית: \nמיותרים. שווה לחפף אותם בשביל המגן.\n\nהמבחן: \nקל אבל בדיקה לא אחידה.\n\nהשורה התחתונה: \nקורס קצת משעמם כי כמעט כולו חוק שני של ניוטון. למי שזוכר ש F=ma זה קורס טריוויאלי ברובו.", "timestamp": 1646084547874}, {"author": "t", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאלה רווה\nחוות דעת - הרצאות: מרצה מעולה שמסבירה את החומר כמו שצריך. מדברת אל הסטודנטים בגובה עיניים ותמיד יש אווירה טובה בהרצאות\n\nשם המתרגל/ת: צוף יואלס\nחוות דעת - תרגולים: צוף הוא מתרגל מעולה. חשוב לו שהסטודנטים יבינו את החומר ויתחברו לחומר. ההסברים שלו מובנים והוא תמיד עונה על שאלות ומסביר מעבר לקורס. חוץ מהערה אחת שנאמרה בצחוק והתפרשה באופן שגוי, תמיד הייתה אווירה טובה בכיתה. הוא מעלה הקלטות של התירגולים ולא משדר בלייב.\n\nשעורי הבית: נחמדים, לא עמוסים מידי ובאמת עוזרים להבין את הקורס טוב יותר.\n\nהמבחן: המבחן היה מנוסח באופן לא הכי מובן אבל סך הכל הוגן לגמרי, לא היה שום דבר שלא היינו אמורים לדעת שם (מדובר על המועד א').\n\nהשורה התחתונה: קורס נחמד ומעניין מאוד שלא מעמיס יותר מדי על סמסטר עמוס בצורה לא הגיונית.", "timestamp": 1646088045780}, {"author": "The Dude", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ויטאלי\nחוות דעת - הרצאות: \nהיו כאלה שממש אהבו, היו כאלה שממש לא, אשאיר לכם לגלות לבד.\n\nשם המתרגל/ת: אופיר ואקנין.\nחוות דעת - תרגולים: \nתרגולים נהדרים, לרוץ לשמוע ולמרקר כל דבר שייצא לו מהפה, תותח אמיתי בתחום.\nשעורי הבית: \nחמודים אך לא מספיק לתרגל רק אותם לפני הבחינה.\nהמבחן: \nמועד א' שואה.\nמועד ב' מאוד מאוד הוגן.\n\nהשורה התחתונה: \nמי שרוצה ליבה אווירו חייב, אבל צריך להבין שהקורס לא בהכרח נותן הרבה.", "timestamp": 1680271450051}, {"author": "פלופ >> פרופ", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ויטלי\nחוות דעת - הרצאות: \nהאיש הכי חייכן ושמח בפקולטה האפורה הזאת. ישות אינטיליגנטית וצעירה שמדברת איתך בגובה העיניים ורוצה בהצלחתך ואחד העתודאים הטובים ביותר בחייל האוויר.\nויטלי עושה 2 תחקורים על ההתנהלות שלו בסמסטר, עושה תחקור בנפרד למבחן ומוודא שהסטודנטים באמת מרוצים ושטוב לנו. אין מרצים כאלה לא תמצאו.\nכל ההרצאות הן ממצגות נהדרות שאוספות בתוכן את כל הדברים שצריך לדעת. אין הרבה או בכלל פיתוחים, זה הכל הבנה.\n\nשם המתרגל/ת:  אופיר\nחוות דעת - תרגולים: \nהמתרגל הכי טוב בפקולטה בפער!! עזבו בפקולטה, בבית הטכניון. אין מישהו שמשקיע יותר ממנו, אין מישהו שיודע יותר טוב ממנו. הוא תמיד פנוי לשאלות, הוא תמיד מתחשב בכולם, הוא תמיד פותח זום ולא מוותר על אף אחד. הוא יודע להסביר  את הדברים עד שתבינו. הוא הכי טוב שיש. והוא לא ממשיך לתרגל סמסטר הבא אז באסה לכם. הוא כל כך טוב שאתה מתחיל לרצות להיות מתרגל בעצמך ושואב ממנו השראה. זאת הרמה. דפי התרגול המצויינים שלו שבהם יש את עיקר החומר ותרגילים מעולים ישארו איתנו לנצח נצחים.\n\nשעורי הבית: \n6 גיליונות שמסדרים קצת את המוח\n\nהמבחן: \nלא לעשות ולא לגעת במועד א 2023 המרושע. לא תעשו לא תתחרפנו. הוא לא מייצג, הוא טעות, הוא בדיה.\nהמבחן הוגן מאוד, בנוי טוב, מוסבר יפה ורציני. אם עושים המון מבחני עבר ועוברים על החומר שוב אתם תהיו מתואמים ומיוצבים.\n \nהשורה התחתונה: \nהקורס חובה הכי פגז והכי טיל", "timestamp": 1715240967927}]}