{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גיל יודילביץ'\nחוות דעת - הרצאות: מועברות על ידי מצגות. בתור מישהו שישב בכיתה היה הרבה יותר קל להקשיב מאשר אנשים שהקשיבו בזום, למרות שרוב ההרצאות הן משעממות מאחר ובעיקר לומדים המון מושגים לא מובנים בכל נושא. החלקים הכי מעניינים בהרצאות היו כשגיל התחיל לספר על דברים שקרו לו בעבודה ואיך הם מתקשרים למה שאנחנו לומדים. גיל הוא אחלה מרצה סך הכל, מסביר את החומר באופן מובן כמה שאפשר ותמיד נותן דוגמאות לאיך החומר קשור בעבודה במציאות.\n\nשם המתרגל/ת: צוף יואלס\nחוות דעת - תרגולים: התרגולים חשובים יותר מההרצאות וכמעט ואין חפיפה ביניהם. בתרגולים באמת מחשבים דברים בניגוד להרצאות. צוף מתרגל מצוין שאכפת לו מהסטודנטים ורוצה שנבין את החומר על הצד הטוב ביותר.\n\nשעורי הבית: היו ברמת התרגול או קצת מעבר. מי שמקשיב בתרגולים יכול לפתור תוך כמה שעות את הגיליונות הארוכים. היו כמה גיליונות שדרשו מאטלב אבל ברמה בסיסית של לשרטט גרפים בעיקר.\n\nהמבחן: המבחן היה מחולק 80 נקודות מחומר התרגולים ו-20 מההרצאות. היו 3 שאלות על התרגולים והן היו מושלמות. השאלות היו מעשיות ולקוחות מהמציאות ולכן היה ניתן להתחבר אליהן ולהבין אותן.\nשאלות ההרצאה היו 10 שאלות אמריקאיות על מושגים והגדרות שנאמרו בהרצאות. הן בודקות אם אתה זוכר את השקפים בהרצאה ומה כתוב בהן, אך על רוב השאלות היה ניתן לענות בעזרת היגיון ולא רק שינון המצגות.\n\nהשורה התחתונה: הקורס הוא יותר פרקטי מאחרים ולומדים בו כיצד דברים עובדים במציאות, אך זו גם הבעיה העיקרית שגורמת לרוב ההרצאות להיות משעממות שכן בתור סטודנטים \n רובנו עדיין לא התנסינו בלעבוד בתור מנהלי פרויקטים. בתרגולים עובדים בעיקר עם הסתברות, אך בניגוד לקורס הסתברות כאן הדברים נהיים מובנים יותר כאשר משתמשים בכלים האלה. בתור סטודנט שלקח את הקורס בסמסטר 4 במקום 6 הייתי אומר שאני לא מתחרט על כך, כיוון שבסופו של דבר הקורס לא מעמיס יותר מידי עליו.", "timestamp": 1627467921170}, {"author": "אויילר", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גיל יודלביץ\nחוות דעת - הרצאות: גיל מרצה טוב, יש לו ניסיון של שנים ורואים את זה בצורה שבה הוא מדבר, הוא יודע מה הוא אומר ומביא דוגמאות הרבה פעמים מנסיונו העשיר. ההרצאות עצמם מעט משעממות שכן אין מה לעשות החומר של הקורס הזה קצת פחות מלהיב ומעניין את רוב הסטודנטים.\n\nשם המתרגל/ת: צוף\nחוות דעת - תרגולים: צוף מתרגל אחלה, הוא מסביר טוב את החומר ונותן את צורת המחשבה שדרושה לפתרון נכון של התרגילים.\n\nשעורי הבית: לא קשים ולא לוקחים הרבה זמן, תרגול טוב למבחן.\n\nהמבחן: הוגן לרוב, בשנה שלנו היה צורך למצוא ערכים עצמיים ווקטורים עצמיים של ארבע מטריצות שלוש על שלוש, מה שהפך את המבחן למבחן באלגברה. חוץ מהעובדה הזו, המבחן הוגן , אם חזרתם על התרגולים והשיעורי בית טוב הרי לכם 80 נקודות. אם אתם טובים בלזכור את המידע שגיל מעביר בעל פה ובמצגות, אז הרי לכם ה20 הנוספות, לכן ממומלץ ללכת להרצאות למרות שאם תלכו כנראה תהיו בין היחידים שם.\n\nהשורה התחתונה: קורס לא קשה, נחמד, נותן עוד נקודת מבט על הנדסה, מצאתי שהוא מעשיר מאוד.", "timestamp": 1659006792173}, {"author": "The Dude", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גיל יודילביץ'\nחוות דעת - הרצאות: \nהיה הרצאות? לא נכחתי\nשם המתרגל/ת: צוף\nחוות דעת - תרגולים: \nבחור נחמד ומוכשר, חשוב להבין את התרגולים\nשעורי הבית: \nחביבים, שווה לפתור\n\nהמבחן: \nבעבר היה קשוח סתם לא לצורך עם המון נקודות מהדוקו של גיל על איך היה ברפאל וסתם נקודות נידחות מהחומר.\nשווה להתכונן ולהבין כל נקודה.\nהשורה התחתונה: סיימתי את הקורס ועדיין לא מצליח לעשות מערכת בטכניון, מה עשיתי בזה?", "timestamp": 1678829007645}, {"author": "למה???", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: \nלא מעניינות במיוחד. יש דברים שנכנסו למבחן.\nשם המתרגל/ת: מיכאל אושקוב\nחוות דעת - תרגולים: \nסבבה.\nשעורי הבית: \nמרופרנסים\nהמבחן: \nהיה 40 נקודות על ההרצאות שדפקו לי את המבחן. מעבר לזה די טכני.\nהשורה התחתונה: \nמיותר אבל חובה.", "timestamp": 1692000623204}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מישהו מתעשייה אווירית\nחוות דעת - הרצאות: לא הייתי, השלמתי לבד מהמצגות כי היה משעמם בכיתה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1705321721800}]}