{"posts": [{"author": "Avital Gaft", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: משה אידן\nחוות דעת - הרצאות: הרצאות מעולות, מסודרות ומועברות באופן מקצועי ביותר \n\nשם המתרגל/ת: לירז מודריך\nחוות דעת - תרגולים: מובן ויסודי\n\nשעורי הבית: גליון כל שבוע, דומים מאוד לתרגולים\n\nהמבחן: רמה קצת יותר קשה מהתרגולים אבל בגדר ההגיון\n\nהשורה התחתונה: קורס מעניין עם מבחן הגיוני", "timestamp": 1603118978639}, {"author": "שקד", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקלילים ויש רפרנסים\nהמבחן: \n\nהשורה התחתונה: מעבדות ארוכות מדי ודורשות הכנה רצינית יותר משנדמה. כדאי להתכונן בהתאם. קורס שמתבסס על מטלאב מבלי ללמד כ\"כ", "timestamp": 1626121532034}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: משה אידן\nחוות דעת - הרצאות: \nמעניינות. לא קשות מורכבות או מהירות מידי.\nשם המתרגל/ת: לירז מודריק\nחוות דעת - תרגולים: \nהוא לא סתם זכה בתואר מתרגל מצטיין כל כך הרבה פעמים. ברור, מסביר היטב, מעניין, הוגן, זמין לשאלות וכל דבר אחר טוב שאפשר להגיד על מתרגל.\nשעורי הבית: \nהרבה. כל שבוע. משאבת זמן טיפה. אבל לא מסובכים ועוזרים בהבנת החומר.\nההוראות למעבדות לא תמיד הכי מובנות אך חשוב להתכונן היטב לפניהן הבנתית ונפשית ולא לבזבז זמן על שטויות במעבדות עצמן. אם יעילים אפשרי לחלוטין להצליח בהן היטב.\nהמבחן: \nשלנו היה קשה יחסית לשנים קודמות אבל סך הכל הוגן\nהשורה התחתונה: \nהתמרת לפלס", "timestamp": 1628196708460}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: משה אידן\nחוות דעת - הרצאות: מעניינות וחשובות, משה מרצה טוב אבל חבל שאין כמעט דרכים להשלים הרצאות דרך המודל אז כדאי לבוא.\nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: גלב מתרגל בסדר בסה\"כ. לפעמים בתרגולים מוסיפים כמה נקודות לחומר שלא הועברו בהרצאה, ולפעמים מרגיש שנדחס יותר מידיי חומר לשעת תרגול ככה שיש תרגולים (בעיקר לקראת סוף הסמסטר) שיוצאים מהם עם חוסר הבנה. כמו ההרצאות כדאי להיות נוכח כי אין איך באמת להשלים דרך המודל וגם חשובים בשביל להצליח בשיעורי בית.  \nשעורי הבית:\nגיליון כל שבוע עם שבוע ימים להגשה. ארוכים ומאוד מעמיסים אבל תורמים מאוד להבנת החומר. בהמשך הסמסטר יהיו גיליונות שמשלבים מטלאב בנוסף לשאלות חישוביות \"על הדף\". \nמעבדות:\nאצלנו היו 3 מעבדות ולכל אחת דו\"ח מכין משלה. הדוחות המכינים לא הכי ברורים ויכולים להיות ארוכים אבל חשוב להבין אותם כדי להתכונן למעבדות כמו שצריך. במעבדות עצמן הדוחות נכתבים ישר אחרי הניסוי והם לא ארוכים מידיי אבל כן יש הגבלת זמן אז תהיו מוכנים ללחץ שרק הולך ומחמיר כשהמדריך מעבדה יתחיל לצעוק עליכם, בקיצור תהיו מוכנים ל-4 שעות של סבל.\nהמבחן:\nבסה\"כ הוגן, למרות שכמה שאלות כללו כמה \"טריקים\" לא הוגנים לדעתי שהעלו קצת את הקושי ביחס לשנים קודמות. גם חבל שנוסף חומר חדש לגמרי לקורס בשבועיים האחרונים שלו ככה שלא היה מאיפה לתרגל אותו לקראת המבחן. מהווה 70% מהציון הסופי, אז כדאי להפציץ בשיעורים ובמעבדות.\nהשורה התחתונה:\nמבין הקורסים היותר עמוסים שכנראה ייצא לכם לעשות בסמסטר שזה חבל בגלל שהוא רק 3 נק\"ז. כדאי לדעת מראש שיש הרבה שימוש במטלאב ולא באמת מעניקים איזושהי היכרות עם השפה לפני. למרות כל זאת, זה דווקא קורס מהמעניינים יותר בסמסטר ולא קשה מידיי להבנה שגם פותח עיניים לתחום הבקרה.", "timestamp": 1690648024398}, {"author": "כיף לי כיף לי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: משה\nחוות דעת - הרצאות: \nהרצאו חשובות מאוד לבוא לכולן, אין להן תחליף. הן נהדרות מכל הבחינות. משה יודע הכל בבקרה הוא ממש חכם. הוא מדבר לאט וברור עד!- ל15 דקות האחרונות של השיעור שבהן הוא רץ בחומר כמו באפקט מנהור. ההרצאות מאוד מעניינות וגורמות לך לרצות להתעסק בבקרה עד!- שהוא אומר שבקרה זה מתמטיקה שימושית וזה מוריד לך רצח. \nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: \nגלב הוא אחד האנשים הנחמדים שהכרתי בחיי. הוא נעים הליכות וחברמן. תמיד מוכן לעזור ונשאר לשאלות. הוא מלמד גם דברים בתרגול שמשה לא נוגע בהם בהרצאה. הדברים שהוא מלמד חשובים מאוד בעיקר בסוף הסמסטר. \nשעורי הבית: \nמשיעורי בית 4 מתחילים להתעסק במטלאב. הקורס הזה מלמד בין השאר גם לכתוב קוד במטלאב ולהתעסק איתו ועם סימולינק. שיעורי הבית מעולים!! הם לימדו אותי לכתוב קודים במטלאב כמו בהייטקס.\n\nהמבחן: \nצפוי והוגן. רק אל תעשו טעויות חישוב טיפשיות כי מורידים על זה ביג טיים.\n\nמעבדות:\nניתן לתאר את המעבדות בדרך אחת: מאסטר שף של מהנדסים.\nיש 3 מעבדות בכל הסמסטר.  לכל אחת מהן אתה מגיע עם רעיון למנה (עברת על ההכנה לדוח) ואז במשך 4 שעות אתה נמצא בתוך קן של לחץ, היסטריה, אכזבה, הצלחה, ושיגעון טוטאלי להספיק לסיים את המעבדה ולענות על השאלות שלה. (להגיש את המנה) תוך כדי שאתה עושה את כל זה אתה צריך לקבל צעקות ועלבונות מדמיטרי (חיים כהן) שגורמות לך לרצות לחזור לרחם של אמא שלך ולפרוש מהתואר (ברמה שדמעתי). אם אתם רוצים לשרוד את 4 השעות של הלחץ הטהור בשלום תתכוננו ממש על הההכל מראש ואל תסתכלו לדמיטרי בעניים ואל תצרו איתו קשר. וכשאתם שומעים חברים, 15 דקות להגשה - תהיו חזקים.", "timestamp": 1691596256397}, {"author": "נייקוויסט", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: משה\nחוות דעת - הרצאות: \nהרצאות חמודות. משה בחור חביב סך הכל ומסביר סבבה ולאט את החומר. ממליץ להגיע להרצאות לשם שינוי אבל אפשר בכיף לקרוא סיוכמים משנים קודמות וזה יעבוד. לנו היה גם חומר חדש בסוף הקורס שלא מופיע בסיכומים משנים קודמות אבל מי שקורא את זה נמצא בעתיד אז פחות בעיה (איך שם בעתיד? נגמרה המלחמה כבר?)\n\nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: \nהתרגולים בקורס ממש חשובים כי הם מלמדים חומר חדש לגמרי בקורס שלא הועבר בהרצאות, מה שגם אין רשימות או הקלטות שלהם אז תבואו (או שלא, אני לא שוטר)\n \nשעורי הבית: \nכל שבוע. לפעמים קלים לעיתים מציקים כי יש תרגילי תכנות במאטלב. \n\nסיבוב בונוס: מעבדות:\nזה היה הכי מבאס בקורס. יש דוח מכין ויש את המעבדה עצמה. 3 כל הסמסטר, 4 שעות כל אחת. \nלמרות השם שיכול להטעות, זאת לא מעבדה אמיתית (למי שיצא לו לעשות מעבדה כבר) - מגישים את הדוח בסופה ותכלס זה די נוח פשוט המדריך מעבדה יוצר אווירה די לחוצה ולא נעימה שנובעת בעיקר מזה שהוא לא יודע להסביר דברים, או עברית. אבל אם תגישו דוח חצי אפוי בסוף עדיין תקבלו ציון סבבה (המעבדות זה ציון תקף כמובן)\n\nהמבחן: \nקל. ממוחזר. \n\nהשורה התחתונה: \nקורס חמוד ומעניין, המעבדות הורסות אותו קצת אבל אתם תסתדרו (או שלא, אני לא נביא)", "timestamp": 1704493179838}]}