{"posts": [{"author": "החללן מהמלין", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ויטלי שפרמן\nחוות דעת - הרצאות: \nההרצאות היו בזום, די ברורות ואינפורמטיביות ובלי פיתוחים מיותרים. היו סרטונים שמדגימים את העקרונות וסה\"כ היה אחלה.\nשם המתרגל/ת: מיכל פושקוב\nחוות דעת - תרגולים: \nהתרגולים היו ברורים וענייניים. מיכל השתדלה שנבין את החומר ולא ניסתה לרוץ עליו, והייתה זמינה לשאלות במהלך הסמסטר.\nשעורי הבית: \nרמת שיעורי הבית תאמה את רמת החומר, הם לא היו קשים במיוחד. היו חמישה תרגילי בית ורובם היו ב-Matlab.\nחוץ מתרגילי הבית היה פרויקט גמר, גם הוא ב-Matlab, תקף 20%. הוא ארוך, אבל לא קשה במיוחד.\nהמבחן: \nהמבחן היה ברמה תואמת לרמה של  הקורס, לא הרבה מעל ולא הרבה מתחת. סה\"כ מבחן הוגן.", "timestamp": 1615807712033}, {"author": "~אחת שיודעת?", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פיני\nחוות דעת - הרצאות: \nהרצאות באפס התלהבות מוחלטת. זוועה.\nשם המתרגל/ת: עומרי\nחוות דעת - תרגולים: \nפשוט אל תגרמו לי לדבר עליו.\nשעורי הבית: \nקלילים-אבל עומרי תופס בקטנות.\nהמבחן: \n\nהשורה התחתונה: \nלקחתי רק כי זה קדם לדברים בחלל.", "timestamp": 1644086845335}, {"author": "האנומליה האמיתית", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פיני גורפיל\nחוות דעת - הרצאות: \nמרצה נהדר, שווה לבוא להרצאות.\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: \nכבר קורס שלישי אצלו, מתרגל מעולה וחלל זה גם ממש התחום שלו. זמין תמיד לשאלות ויש לו סבלנות. עומרי תמיד שמח לענות על שאלות גם אם הן מעבר לחומר הקורס ויש לו ידע רב מאוד - בונוס ענק לחובבי העשרות.\nלעתים טיפה מונוטוני, בעיקר הקטעים בתחילת התרגול שבהם הוא מסביר בעזרת PDF ומנסה לדבר גם לאלה שבזום וגם לאלה שבכיתה וזה לעתים פחות עובד. להמתין בסבלנות וכשהוא פותר את השאלות דברים ברורים יותר ומעניינים יותר.\n\nשעורי הבית: \nלא ארוכים, לא קשים, אך בהחלט משקפים ותורמים להבנה.\nבדיקה קפדנית ומעמיקה שתשקף את בדיקת המבחן. זה לעתים מבאס לקבל ציונים לא מזהירים על גיליון, אבל עומרי הוגן. הוא לעתים מוריד על דברים \"שוליים\", אבל לא ממציא והוא הוגן מאוד בבדיקה.\nהפרויקט מפחיד בעיקר בגלל הכותרת \"פרויקט\" אך בפועל מדובר בערך בעוד גיליון.\n\nהמבחן: \nלא קשה. שתי שאלות \"טכניות\" ושאלה \"מחשבתית\"\n\nהשורה התחתונה: \nאחלה קורס, קליל ומעניין מאוד לאוהבי החלל.", "timestamp": 1644866067680}, {"author": "קורט רין", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פנחס (פיני) גורפיל\nחוות דעת - הרצאות: ההרצאות יחסית משעממות, אבל ניכר שפיני אוהב את התחום והוא יוצא מגדרו כדי לבדר את הקהל ולהעביר ידע. ההרצאות חיוניות במידה מה לשיעורי הבית ולמבחן, אבל לא יקרה שום דבר אם תלמדו מסיכום ההרצאות במקום ללכת פיזית.\n\nשם המתרגל/ת: עמרי חמו\nחוות דעת - תרגולים: בין המתרגלים הגרועים שפגשתי בטכניון. לא לוקח את התפקיד שלו ברצינות בשום צורה, בין אם מדובר בבדיקת עבודות הבית בצורה עניינית ומקיפה, ועד לצורה שבה הוא מעביר את התרגולים(יושב מול מחשב ומקריא מהPDF את התוכן, וקם ברבע השעה האחרונה כדי לפתור תרגיל על הלוח).\n\nשעורי הבית: 6 גיליונות ופרויקט. לא קצרים במיוחד, בחלקם נומריים, ובחלקם אנליטיים. הגיליונות דורשים זמן, אך לא מסובכים במיוחד וכדאי להשקיע בשניים-שלושה האחרונים כיוון שהם משקפים את השאלות שיכולות להופיע במבחן.\n\nהמבחן: המבחן שהיה במועד הא' היה ממוחזר ברובו(3\\2) ולכן הממוצע היה גבוה מהרגיל. 2 שאלות חישוביות ושאלה שלישית שקצת יותר מבוססת על הבנה מתמטית.\n\nהשורה התחתונה: קורס קליל וחביב, אך לוקח זמן ורץ עם סגל לא איכותי במיוחד.", "timestamp": 1645722640099}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: Pini Gurfil\nחוות דעת - הרצאות: Pini is nice and likes to crack jokes with the students, but he really doesnn't seem like he wants to be there whenever he's giving a lecture. I understand that he is accomplished in his field, but the course would be much more enjoyable if the lecturer was more charismatic and could match the energy of the students (who are always excited because the topics are quite cool).\n\nשם המתרגל/ת: Omri Hemo\nחוות דעת - תרגולים: Omri is fine as TA, he just reads from the tutorial notes on the computer for the most part (which are very detailed and helpful), but he also lacks a bit of charisma and he graded the homeworks and project quite harshly.\n\nשעורי הבית: Six relatively easy homeworks (mostly involving MATLAB), Omri did a lot of nitpicking with the grading though. There was a small project in the end, which was basically another homework with more MATLAB, and graded even more harshly.\n\nהמבחן: Easy and straightforward, matched the level of all of the past exams. Study for a few days and you will be fine.\n\nהשורה התחתונה: The material is super interesting and relevant for everyone interested in space, and a very easy course overall. The staff could be a bit better, but other than that I definitely recommend it.", "timestamp": 1657558786251}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פיני גורפיל\nחוות דעת - הרצאות: משעמם ממש, מומלץ לצפות מוקלט פי 3\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: גם די משעמם אבל pdf טובים, תעשו לבד ותבינו יותר טוב \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: חבל שההקדמה למה שרציתי ללמוד בתואר הייתה בין הקורסים המשעממים יותר שעשיתי (בעיקר בגלל הסגל) אבל בסהכ קורס חשוב ואינפורמטיבי", "timestamp": 1679266721379}]}