{"posts": [{"author": "אביחי בוכריס", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: פרופ' גיל יוסילבסקי\nחוות דעת - הרצאות: גיל מענייו מאוד בהרצאות ושופע ידע. במהלך ההרצאה קשה לעקוב בגלל עומס המתמטיקה והחומר הקשה. הקורס עצמו מעניין ברמות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחנים של גיל בד\"כ קשים מהרגיל וצריך להשקיע בהם יותר זמן.\n\nהשורה התחתונה: קורס מעניין, מרצה קשוח ומעניין.", "timestamp": 1599652666985}, {"author": "Ori pikcles", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: גיל\nחוות דעת - הרצאות: משמימות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בסדר\n\nהמבחן: בגלל מתכונת הקורונה היה בתמכונת רעה לסטודנטים\n\nהשורה התחתונה:", "timestamp": 1614954392245}, {"author": "leead gillon", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: חומר קשה אבל המרצה ממש טוב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן קשה במיוחד לאור הדבר הכי נורא בסמסטר הזום , מבחן של תשובות סופיות בלבד ללא הסתכלות על הסריקות גם לא לערעורים. עיגלת קצת לא טוב ויכולה ליפול על זה שאלה שלמה.\n\nהשורה התחתונה:", "timestamp": 1614979300143}, {"author": "Avital Gaft", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: גיל יוסילבסקי\nחוות דעת - הרצאות: \nהרצאות משעממות מאוד, גיל לא נותן שום אינטואיציה על החומר ומסביר בצורה מאוד יבשה ונוסחאתית.\nשם המתרגל/ת: עמית וינרב \nחוות דעת - תרגולים: \nהתרגולים ברמה קצת יותר נמוכה מהמבחן, ההסברים של עמית הרבה פעמים לא מובנים. \nשעורי הבית: \n5 גליונות, כולם חובה. לא קשים מידי, אבל צריך להבין הרבה מאוד לבד כי ההרצאות והתרגולים לא מכסים את כל המקרים האפשריים\nהמבחן: \nמבחן ברמה גבוהה, עם שתי שאלות די סטנדרטיות ושאלה מפתיעה שלא בהכרח הועברה בצורה מובנת בתרגולים. \nהשורה התחתונה: \nקורס לא עמוס אבל גם מועבר בצורה מאוד לא ברורה", "timestamp": 1615559622257}, {"author": "Ae", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: גיל יוסילבסקי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עמית וינרב\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nלא למדנו מנהרות רוח כמעט בכלל\nפותחים מועד א שאלה על מנהרת רוח 80 נקודות\nהשורה התחתונה: קורס חשוב, ציון רע", "timestamp": 1621263753971}, {"author": "גל הלם", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: \nנהדרות. מרתקות. מיכאל מסביר טוב והפיתוחים בקורס מרתקים.\n\nשם המתרגל/ת: ליאור פופלינגר\nחוות דעת - תרגולים: \nליאור השקיע והיה זמין לשאלות במהלך הסמסטר. התרגולים חשובים בתחילת הקורס, לאחר מכן ברגע שמבינים את הקונספט זה טיפה חוזר על עצמו ואפשר לוותר ולתרגל לבד לדעתי אך חשוב לתרגל.\nיש גם עוד תרגולים בפנופטו ושם יש שעתיים תרגול במקום שעה על כל נושא. מומלץ לתגבר באמצעותם את הנושאים הראשונים.\n\nשעורי הבית: \nבמודל. לא קשים. יש 3 נסיונות ולפניהן יש אינסוף נסיונות בתרגיל הכנה שזה תכלס אותה שאלה. בשאלות יש המון מקרים שונים אז שווה לפתור הרבה פעמים כדי להכיר את כולם.\n\nהמבחן: \nלא מאוד קשה אך חשוב להיות חדים (אני לצערי לא הייתי מאוד חד). יש בוחן אמצע שיכול להיות אחלה מגן.\n\nהשורה התחתונה: \nקורס מהמרתקים בתואר. אשכרה זרימה על קולית. פיתוחים יפייפיים.", "timestamp": 1646084932221}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: ההרצאות לא מסודרות בכלל, לא ברור אילו פיתוחים הם סתם בשביל הספורט ואילו פיתוחים הם משהו שמצופה לדעת לבצע לבד. יתרה מזאת, נראה שהמרצה בעצמו לא לגמרי סגור על החומר, וכתוצאה מכך יום לפני המבחן, בעקבות עירנות של סטודנטים, התגלה כי הייתה טעות קריטית במה שהוא רשם על הלוח. כל פיתוח שהוא מבצע על הלוח מכיל טעויות כלשהן שלפעמים מתוקנות תוך שהשיעור מתקדם ולפעמים גם לא. ההרצאות לא מועברות בצורה מעניינת, אבל לפעמים מביא סרטונים ותמונות להמחשה ונראה שחשוב לו מאוד שנתחבר לחומר הנלמד.\n\nשם המתרגל/ת: ליאור פופלינגר\nחוות דעת - תרגולים: מוברים בצורה מסודרת, והמתרגל מובן למדי. יחד עם זאת, התרגולים לא מגרדים אפילו במעט את רמת הקושי של המבחן או תרגילי הבית.\n\nשעורי הבית: מקוונים ומבוצעים בצורת שאלון במודל. אפשר ליפול על עניין של דיוק הספרות אחרי הנקודה, מה שהופך אותם למעצבנים במיוחד. יחד עם זאת, יש אופציה של תרגול עצמי לפני ביצוע התרגיל האמיתי, שזה מצוין.\n\nהמבחן: לטעמי המבחן היה קשה, הופיעו בו שאלות עם דקויות תיאורטיות שבכלל לא נלמדו בהרצאות ובתרגולים. לא פייר בעליל.\n\nהשורה התחתונה: מדובר בקורס חובה כך שאין הרבה ברירה אלא לגשת אליו, אבל שתדעו שזה לא קורס שסגור על עצמו, ואיכות ההוראה לא דומה למה שמצופה במבחן.", "timestamp": 1647618772469}, {"author": "דחיס", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיגאל קרפ\nחוות דעת - הרצאות: מלמד מצויין, משקיע מאוד וזמין לסטודנטים. משקיע ומביא הרבה דוגמאות מעבר וגם מלמד פרקטי \n\nשעורי הבית: הוגנים, חשוב לעשות אותם כי משקפים את הרמה בבחינה\n\nהמבחן: מבחן מאוד הוגן, ומועדים דומים. שאל רק על מה שלימד והרוב הופיע בהרצאה ובתירגול ככה שהשאלות החדשות שלא פגשנו היו מעטות. כמובן שצריך לעבור על החומר.\n\nהשורה התחתונה: קורס יפה עם פיתוחים יפים. מבחן הוגן מאוד אם לומדים במהלך הסימסטר ולא רק יומיים לסוף", "timestamp": 1647814024919}, {"author": "דחיס", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: המרצה הכי הוגן שקיים ומעלה את כל המבחנים מהעבר שהיו למודל ואחרי כל מבחן מעלה את הבחינה ופיתרון מלא שלה.\n\nהמבחן: מבחן הוגן רק על דברים שנילמדו\n\nהשורה התחתונה: קורס שווה בטירוף והחומר מאוד מעניין ועושה חשק לקחת עוד קורסים בתחום", "timestamp": 1647814281003}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: \nתותח, אין דברים כאלה. רואים שהוא שולט בתחום ולא סתם איזה מרצה שנתנו לו להעביר קורס רק כדי שיקבל מימון למחקר שלו. עונה על הכל בין אם זה בפורום או במייל. ההרצאות מאוד מעניינות ומיכאל משתדל להביא הרבה דוגמאות/תמונות/סרטונים אמיתיים. אחד הקורסים היחידים שההרצאות באמת תורמות להבנה של החומר ולמבחן.\n\n\nשם המתרגל/ת: ליאור פופלינגר\nחוות דעת - תרגולים: סה\"כ בסדר גמור. אין משהו מיוחד להגיד. זמין במייל ועונה על שאלות. אני אישית יותר התחברתי לתרגולים בפנופטו.\n\nשעורי הבית: מרופרנסים\n\nהמבחן: 80 נקודות פייריות לגמרי, ה-20 האחרות קצת מתחכמות. סה\"כ בסדר.\n\nהשורה התחתונה: קורס שווה, לא עמוס מבחינת ש\"ב אבל מאוד עמוס מבחינת חומר, במיוחד כשמדובר ב-2.5 נק\"ז.", "timestamp": 1678125273544}, {"author": "אוילר", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: מיכאל מרצה טוב שאכפת לו מהתלמידים ומתעניין מהחומר. אומנם הוא לא הכי מסודר ואין לו רשימות מפורסמות אבל שווה להגיע כדי להקשיב ולהבין.\n\nשם המתרגל/ת: ליאור פופלינגר\nחוות דעת - תרגולים: ליאור מעביר בסדר את התרגולים. אבל לדעתי התרגולים בגדול לא טובים, רצים על תרגילים מהר מדי בלי לעצור להבין. כל תרגול איבדתי אותו מהר מאוד ולא הצלחתי לעמוד בקצב, התרגולים נתנו לי הרגשה שאני לא מבין כלום, למרות שזה לא היה המצב.\n\nשעורי הבית: קצרים, קל לרפרנס אם באמת צריך. אבל הם אימון טוב וברמה של מה שישאלו במבחן.\n\nהמבחן: לא קשה לא קל, תבינו את החומר, תהיו על זה כל הסמסטר ואתם תצליחו.\n\nהשורה התחתונה: קורס מעניין מאוד וכיפי, עבורי היה קורס מדהים עם חומר מעניין בטירוף.", "timestamp": 1678532226164}, {"author": "חיים", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מיכאל קרפ\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: אליה מילמן\nחוות דעת - תרגולים: סביר\n\nשעורי הבית: היו שיעורי בית במודל, הקונספט בעיני לא טוב, צריך לשים מספרים סופיים כתשובה ועל פי זה הציון נקבע, בדרך זו קשה להבין מה נכון ומה לא נכון בדרך ובכיוון, התהליך לתשובה לא תמיד ברור, גם אחרי פרסום התשובות במודל והסבר לדרך זה היה כתוב בצורה לא ברורה.\nכשיש תרגילים בכתב יש הרבה יותר מקום להבין מה הכיוון הנדרש לפתרון ולדעתי זה יותר מלמד ממה שהיה לנו הסמסטר\n\nהמבחן: מעט קשה, המבחן היה שונה מ2 השנים הקודמות וזה הקשה קצת על הפתרון\n\nהשורה התחתונה: קורס מעולה ומגניב בסופו של דבר", "timestamp": 1713449834383}, {"author": "פרנטל מאייר", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: קרפ\nחוות דעת - הרצאות: \nבכל הרצאה יש רגעים שאתם תאבדו ריכוז כי תשאבו לתוך עינייו הבוהקות, תפסיקו להקשיב ותדמיינו שאתם בבורה בורה שותים מקוקוסים במקום למצוא איפה גל ההלם שלכם ממוקם.\nיש לו צאט מטורף שהוא קורא לו הכו את סגל ההוראה שבזכותו החיים שלי היו טובים יותר. הוא ממש השקיע בזה וענה על הכל ממש מהר כאילו אין לו דברים אחרים בחיים שלו חוץ מהצאט הזה.\nשם המתרגל/ת: איליה\nחוות דעת - תרגולים: \nלא היה לי כיף או מובן. באמצע הסמסטר הפסקתי להגיע. התרגולים לא בנויים לפיתרון רגיל כאילו זה מדח פה. הם צריכים להיות על ההבנה של הדרך, אז כששמים דגש על המספרים במקום על ההבנה זה לא הולך. עדיף לשבת לפתור לבד.\nשעורי הבית: \nפשוט נוראיים, מפלצתיים, זדוניים, מטומטמים, רעים, שפלים ומגעילים. לא תלמדו מהם כלום חוץ מזה שאתם לא יודעים את כל האופציות למיקום הגל, אתם לא יודעים איך לפתור תרגיל אמיתי ואין לכם זמן לעשות את זה.\nהמבחן: \nעכבר. איכ ופיכ, לא יפה לקרפ להתחפש למרצה המרושע. מתאים לו יותר להתחפש לחתול השחור מהסדרה \"החיפושית המופלאה\". אני חושבת שזה נקמה על מה שחוללנו בצאט האהוב שלו.\nהשורה התחתונה:  מאוד מעניין, כיף כשמבינים. שיעורים מזעזעים וכושלים, מבחן שלא מכבד את קרפ", "timestamp": 1714068543173}]}