{"posts": [{"author": "itai freeman", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602069414460}, {"author": "אמנון שיינמן", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ולאד זאק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אמנון שיינמן\nחוות דעת - תרגולים: \n\nשעורי הבית: קשה אבל הוגן. מענה לשאלות במייל.\n\nהמבחן: לא התקיים השנה- ציון ניתן ע\"ס שעורי הבית\n\nהשורה התחתונה:", "timestamp": 1606983934382}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ולדימיר זאק\nחוות דעת - הרצאות: מוקלטות, ארוכות ומשעממות.\n\nחוות דעת - תרגולים: מאוד עוזרים להבנה של החומר ולפתרון של התרגילים\n\nשעורי הבית: חלק משמעותי בקורס. לוקחים הרבה זמן. חשוב מאוד להקפיד על כל החוקים שמלמדים בהרצאות והתרגולים כדי לא להפסיד סתם נקודות", "timestamp": 1626103476463}, {"author": "$$", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ולאד\nחוות דעת - הרצאות: ארוכות, משעממות, רובן לא רלוונטיות\n\nשעורי הבית: ארוכים מאוד, לא ברורים, די מייאשים\n\nהמבחן: די ממוחזר\n\nהשורה התחתונה: קורס לא ידידותי עם צוות מזעזע", "timestamp": 1629380596613}, {"author": "קרוט רין", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ולאד זאק\nחוות דעת - הרצאות: ההרצאות די משעממות ויבשושיות, קשה להישאר מרוכז לאורך ההרצאה, וההרצאות הופכות להיות יחסית מיותרות לאחר החומר של הגאומטריה התיאורית. \n\nשם המתרגל/ת: אמנון שיימן\nחוות דעת - תרגולים: התרגולים נחוצים מאוד להבנת החומר והיכולת לפתור את שיעורי הבית. מומלץ מאוד להקדיש להם חשיבות ולהיעזר בהם כשנתקלים בבעיה בשיעורי הבית.\n\nשעורי הבית: שיעורי בית שדורשים זמן רב, לעתים קשים מאוד ומתסכלים ולפעמים סבירים למדי. בסמסטר האחרון בניגוד להנחיות הם הכניסו גיליון שיעורי בית לתוך תקופת המבחנים וזה היה לא נעים בלשון המעטה.\n\nהמבחן: המבחן היה הוגן, עם מחזור מהמבחנים לדוגמה שולאד מפרסם במודל. מועד הב' היה מאוד ממוחזר ממועד א' ומהמבחנים לדוגמה.\n\nהשורה התחתונה: קורס חובה שדורש זמן, ממליץ להיות על חומר התרגולים לאורך הסמסטר ולעשות את שיעורי הבית ברגע שהם יוצאים.", "timestamp": 1634988695052}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: מאוד משעמם ולא מועיל, ההרצאות העשרה לא קריטיות בכלל לדעתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלראות הקלטות תוך כדי שעושים את השיעורים\nשעורי הבית: \nארוכים ומתישים תפנו יום בשבוע לשרטוט אולי אפילו יום וחצי\nהמבחן: \nיש שתי שאלות לשרטט שאין איך להתכונן אליהן אם אין לך את התפיסה המרחבית לציור אתה לא תסדר כל השאר באמת שינונים ושטויות\nמבחן ממוחזר חלקית אז שווה להקדיש זמן לחפש מבחני עבר מאנשים \nהשורה התחתונה: קורס נורא עמוס ולא מעניין אבל אפשר להוציא ציון סבבה בגלל המגן הגבוה", "timestamp": 1647351406151}, {"author": "חנה רובינס", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: טל רום\nחוות דעת - הרצאות: ארוך, אבל חלק גדול חשוב\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: מעבירים את הפרקטיקה, של איך לעבוד. חשוב\n\nשעורי הבית: לרוב לא קשים אבל לוקחים הרבה זמן\n\nהמבחן: לא קשה. דורש הבנה\n\nהשורה התחתונה:", "timestamp": 1658322592723}, {"author": "כיף לי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: טל רום ושולייה שלו\nחוות דעת - הרצאות: \nמה אפשר להגיד על טל רום (והשולייה שלו), קודם כל שאין להם מושג מה עושים בקורס ומה הסדר שלו. טל החליט לזרום עם הקורס וללמד ישירות את הקריאו (תוכנה מטונפת) ללא שום רקע בסירטוט הנדסי ידני. טל מסביר את כל הקורס עד לקטע של אסמבלי ומשם נכנס השולייה שלו שעד יום זה אינני יודעת מה שמו. הוא מסביר את כל החלק השני. שניהם ביחד צמד חמד מעבירים את שלל ההרצאות. עד לאסמבלי לא צריך להגיע אליהן והם מיותרות לחלוטין. \nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: \nאלכס חמוד מאוד מאוד אבל לא יעזור לכם מאוד אם תצטרכו עזרה קצת מעבר למה שמלומד בקורס. כל התרגול הוא למעשה מופע אחד גדול של אנשים שמגיעים ללוח ומסבירים על שיעורי הבית שלהם. אין באמת תרגול אמיתי ואתה פותר אותו לבד אם אתה רוצה. אתה מחכה לתור שלך להציג ואז בורח.\nשעורי הבית: \nשיעורי הבית היו מורכבים מ4 הגשות באחוזים שונים. אבל הטריק הוא שאתה לא יודע איזה הגשות. טל והשולייה אמרו שמכל מקבץ של בערך 3 שיעורי בית אחד התרגילים ברנדומליות יהיה הציון הנכנס. אז למעשה יצא שמה שהצגת בלוח בתרגול לא נחשב בכלל ועשית את זה לחינם. סיפורי עלילות והבטחות כזב.\nהמבחן: \nלקראת סוף הסמסטר טל והשולייה החליטו להודיע לנו שבסוף לא יהיה מבחן והציון שלו יוחלף בפרוייקט של רכבלית. וזהו, זה מה שאני זוכרת. אל תשאלו אותי מה היה שם כי מחקתי את כל הטראומה הזאת מציר הזמן של החיים שלי.\nהשורה התחתונה: \nסבל. והתוכנה קריאו היא תוכנת הCAD הכי לא אינטיליגנטית שראיתם בחייכם. היא נוראית, בזויה ומגוחכת. עד היום הזה התוכנה המרופטת לא יודעת לעשות סימטריה בין 2 קווים.", "timestamp": 1691590092312}]}