{"posts": [{"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: יעקב אושמן\nחוות דעת - הרצאות:\nמרצה מעניין מאוד, קשוב לשאלות ומצליח להקדיש זמן ראוי למתן תשובות הולמות. \n\nשם המתרגל/ת: לירז מודריק\nחוות דעת - תרגולים:\nהמתרגל נהדר. מתחשב וקשוב לסטודנטים. אך עקב הקצבת שעת תרגול בודדת בשבוע הוא נאלץ לרוץ על החומר ולפעמים זה מהיר מידי על גבול הבלתי אפשרי.\n\nשעורי הבית:\nגליונות שבועיים , לא קצרים (לוקחים בממוצע יום שלם רק למקצוע הזה עבור ההגשה). הגליונות כמעט ולא התשנו משנים קודמות אך עדיין דורשים עבודה וזמן עבור הבנתם. בנוסף, הגליונות מכסים את החומר בצורה טובה מאוד ומומלצים על מנת לא לאבד את הקצב בסמסטר.\nהיה גם פרוייקט דיי ארוך (כמה ימים שלמים רק עבור העבודה עליו) .\nיש גם 3 מעבדות שדורשות הכנה של כחצי יום אך במעבדות עצמן מורגש חוסר בזמן אשר בה לידי ביטוי בסופו של דבר בציונים.\n\nהמבחן: \nמועד א היה במתכונת דומה מאוד לתרגילים שראינו בתרגילי הבית (כלומר מי שפתר את הגליונות לבד ידע מה לעשות במבחן). אך כפי שנאמר, הגליונות לקחו זמן רב ולכן עדיין המבחן היה לא פשוט במסגרת הזמן שניתן.\n\nהשורה התחתונה: \nצוות ההוראה נהדר, הקורס מאוד מעניין, חשוב להשקיע זמן להבין את פתרונות גליונות שיעורי הבית.\nהמעבדות+הפרוייקט קוץ גדול בתחת - דורשים זמן רב ולא תורמים להבנה יותר מידי.", "timestamp": 1603098062775}, {"author": "Ori pikcles", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: זלזו\nחוות דעת - הרצאות: משעממות, הנושא עצמו מעניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים ועוזרים להבנת החומר, אבל יותר מידי\n\nהמבחן: במקום מבחן היה פרויקט ארוך ל 3 ימים, הוא היה נראה סביר\n\nהשורה התחתונה: קורס מעניין, אך מרצה שלא מתחש בכלל בסטודנטים, במיוחד בתקופת הקורונה", "timestamp": 1614954616535}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאל זלזו\nחוות דעת - הרצאות: \nחומר מרתק עם הרצאות לא מעניינות במיוחד, החומר מועבר עם שקופיות די משעממות ויבשות. דניאל מאוד מתלהב מבקרה. \nחוסר ההתחשבות מצידו שהסמסטר שלנו חווה ממנו היתה מבזה ביותר. \nאל תאמינו לחיוך הרחב שלו בתחילת הסמסטר\nשם המתרגל/ת: לירז מודריך\nחוות דעת - תרגולים: \nמתרגל מצוין! מלמד בצורה מעמיקה ביותר, מכסה את כל המקרים, מסכם את הכל צורה מאורגנת ועניינית ביותר. מאוד זמין במיילים לשאלות. \nשעורי הבית: \nגיליון שבועי, כולם חובה. דומים לנעשה בתרגולים. די ארוכים אבל לא נוראיים.\nמעבדות:\nמעבדות מעניינות אבל מאוד דורשות. אצלנו היו מעבדות בית אשר הובטחו לקחת 3-4 שעות ובפועל לקחו 3-4 ימים רצופים. \nהמבחן: \nבסמסטר קורונה היה פרויקט לא קשה במיוחד שהקיף את כל החומר הנלמד. היה מאוד ארוך!\nהשורה התחתונה: \nקורס מעניין וחשוב עם מתרגל מצוין, חבל רק שהמרצה חסר לב", "timestamp": 1615560328124}, {"author": "MU", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל זלזו\nחוות דעת - הרצאות: הרצאות שמועברות דרך מצגות, עליהן דניאל רץ כי הסמסטר הקורס הועבר באנגלית לכן, קשה להבין מה באמת חשוב לשיעורי הבית והמבחן ומה ״העשרה״. חומר מעניין ודניאל מנסה להראות את הרלוונטיות שלו למקצוע שלנו.\n\nשם המתרגל/ת: לירז מודריק\nחוות דעת - תרגולים: מתרגל מעולה! עושה סדר בהרצאות של דניאל ושם דגש על הדברים החשובים באמת.\n\nשעורי הבית: 12 גליונות, 11 חובה. לא קשים במיוחד ויוצאים כל שבוע מה שתורם לעקיבה אחרי הקורס במהלך הסמסטר.\nמעבדות: לא עמוסות ביוחד למרות שדניאל מלחיץ לגביהן ומאוד רציני עם היחס שלו כלפיהן.\n\nהמבחן: מועד א - אמריקאי עם הרבה שאלות ממוחזרות ממבחנים קודמים.\n\nהשורה התחתונה: קורס עמוס , בגלל התדירות של שיעורי הבית והמהעבדות, אך לבסוף משתלם לעקוב אחרי הקורס במהלך הסמסטר.", "timestamp": 1644320900876}, {"author": "~אחת שיודעת?", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: זלזו\nחוות דעת - הרצאות: \nלא הייתי, שואל דברים במבחן משם\nשם המתרגל/ת:  לירז מודריק\nחוות דעת - תרגולים: \nמלך, שווה להבין לעומק תרגולים לפני פתירת שב.\nשעורי הבית: \nאם לא מרפרנסים לא הכי מהירים. לא רפרנסתי וזה לקח יחסית זמן מכובד. שווה להתחיל גיליון איך שהוא יוצא ואז אתה על החומר כל הסמסטר.\nהמבחן: \nחלק מחזור ומשמש של דברים משנים עברו, אמריקאי בלי התחשבות בחישובים. פסיכומטרי בבקרה. לנו היו 30 שאלות-10 נכון לא נכון, 20 אמריקאיות טהורות עם 4-5 אופציות.\nעשיתי קצת פאשלות אז יחסית נפלתי במבחן.\nהשורה התחתונה: \nקורס מאוד מעניין שווה לקרוא ולהבין בספר של אוגטה דברים, מבחן לא בהכרח משקף ידע.", "timestamp": 1644428067415}, {"author": "PID", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל זלזו\nחוות דעת - הרצאות: \nבאנגלית ממצגות, המרצה לא כותב כלום על הלוח, מדבר במהירות של ראפר או של צנזור על כפול 2.5 בערך. לא עזר לבקש ממנו להאט את הקצב והייתה מלחמה נורא קשה במהלך הסמסטר כדי לא לאבד את הקצב של ההרצאות שהן חשובות.\nדניאל מתלהב מאוד מהחומר.\n\nשם המתרגל/ת: לירז מודריק\nחוות דעת - תרגולים: \nלירז מלך וזה כבר ידוע לכל. שווה ללכת אליו לשעות קבלה מתחילת הסמסטר על כל דבר קטן שלא מבינים. בזכותו לא איבדתי את הקורס.\n\nשעורי הבית: \nארוכים וקשים אבל מלמדים. אם זה היה הקורס היחיד שהייתי עושה הסמסטר זה היה סמסטר עמוס.\nלירז ודניאל החל מאמצע הסמסטר הנחילו מנהג של שאלת בונוס מחשבתית יותר בכל גיליון. זה היה נחמד ומלמד וגם אחלה בוסט לציון הסופי.\n\nהמבחן: \nאמריקאי, ארוך, הרבה מאוד טריקים. אך הוגן, מי ששולט בחומר ויודע לראות את הדברים ולמצוא טריקים כדי לא לחשב הכל, יכול להוציא ציונים גבוהים.\n\nהשורה התחתונה: \nקורס מעניין, חשוב אבל עמוס.", "timestamp": 1644864730173}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ואדים אינדלמן\nחוות דעת - הרצאות: ההרצאות סך הכל בסדר. הגעתי לחלקן והן עזרו לקלוט את החומר, אבל בגלל האופי הנורא טכני של הקורס התרגולים היו יותר משמעותיים.\n\nשם המתרגל/ת: גלב מרקולוב\nחוות דעת - תרגולים: מתרגל מעולה! העביר את החומר בצורה מסודרת וברורה ונתן מענה איכותי לשאלות. קבצי התרגול המוקלדים עשו סדר בקורס ועזרו לפתור את תרגילי הבית ולהתכונן למבחן.\n\nשעורי הבית: גליונות שבועיים שכמעט ולגמרי מרופרנסים. הגליונות ארוכים ולוקחים המון זמן. בסך הכל מרגישים שזה ממש משתלט על הלו\"ז עם כמות ההגשות בקורס הזה. \n\nהמבחן: היה חלק אמריקאי ושתי שאלות פתוחות. כל המבחן היה מאוד הוגן (ואולי אפילו יחסית קל) והציונים היו גבוהים.\n\nהשורה התחתונה: דורש המון זמן במהלך הסמסטר, אבל המבחן עצמו יחסית קליל. אחלה קורס", "timestamp": 1677147344402}, {"author": "אוילר", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ואדים\nחוות דעת - הרצאות: לא. ואדים לא מרצה טוב לדעתי, והקורס הזה לא שונה משאר הקורסים שהוא מעביר, הוא זורק, לא מתעניין בחומר, ובכללי נראה שדוגל בטקטיקת אפס מאמץ. לדעתי לא כדאי אפילו לבוא.\n\nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: גלב מתרגל טוב סה\"כ, אם כי לפעמים קשה קצת להבין אותו, אבל כדאי ללכת.\n\nשעורי הבית: ארוכים ומאתגרים, הם יקחו לכם הרבה זמן מכל שבוע.\n\nהמבחן: מועד א בזיון, היו לי מלגים עם ממוצעים יותר נמוכים. רק משקף את החוסר עניין של הסגל. כמובן שלנו הסטודנטים זה טוב אבל אל תתרגלו.\n\nהשורה התחתונה: מעניין, אם כי הסגל לא מזהיר.", "timestamp": 1678532567142}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ואדים\nחוות דעת - הרצאות: מעניין פלוס מינוס, מסביר מאוד ברור\n\nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: מתרגל טוב \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679266418229}, {"author": "-", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ואדים\nחוות דעת - הרצאות: ואדים מסביר באופן מאוד מונוטוני ויש שיגידו שקצת משעמם. עם זאת הוא טורח לוודא ולברר שכולם מבינים את מה שהוא מסביר במהלך ההרצאה. החומר עצמו מעניין ומשלב מצגות שעוזרות להמחיש מושגים ורעיונות שזה מאוד מוערך.\n\nשם המתרגל/ת: גלב\nחוות דעת - תרגולים: גלב מתרגל בסדר, לא כל דבר שמועבר בתרגול גם מועבר בהרצאות ולהיפך, אבל התרגולים קריטיים להצלחה בשיעורי בית ובמבחן.\n\nשעורי הבית: סבירים. גיליון כל שבוע, לא ארוכים או קשים מידיי. משלבים גם מטלאב לפעמים אבל גם הוא לא ארוך או קשה. בסך הכל תורמים מאוד להבנת החומר.\n\nמעבדות: 3 מעבדות עם דו\"ח מכין לכל אחת. כל דו\"ח מכין הרבה יותר מעיק וארוך מגיליון של שיעורי בית ולכן אתם תראו שמהר מאוד ייווצר הרבה עומס בגלל השילוב של השניים. למרות זאת הדוחות המכינים פשוט הכרחיים למעבדות שבהן אתם בתכלס בודקים את מה שעשיתם בדוח המכין ומשווים בין תוצאות בניסוי עצמו לסימולציות תוך כדי שמדריך המעבדה יצעק עליכם שאתם לא מהנדסים טובים ולא שווים כלום ברקע. כן אציין שהמעבדה האחרונה ממש כיפית ומעניינת ואפילו קצת מסוכנת ( אתם כבר תגלו לבד (;  ).\n\nהמבחן: המועד א' היה ממש הוגן וההיסטוגרמות מדברות בשם עצמן מכיוון שהמבחן רק 65% מהציון הסופי. היו כמה חלקים מרכזיים בחומר שפשוט לא הופיעו בבחינה בכלל שזאת הייתה ברכה אבל אל תצפו שהנס הזה יקרה שוב.\n\nהשורה התחתונה: מי שעשה מערכות דינמיות יגלה אווירה ומטווה למידה דומים מאוד בין הקורסים, החומר מעניין ולא קשה להוציא בו ציונים גבוהים אבל עמוס מאוד ביחס לקורס של 3 נק\"ז בלבד.", "timestamp": 1715251368542}]}