{"posts": [{"author": "Ori pikcles", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: גיל\nחוות דעת - הרצאות: נוראיות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים ולא תורמים, יש רפרנסים בדרייב\n\nהמבחן: ארוך מאוד\n\nהשורה התחתונה:", "timestamp": 1614954498673}, {"author": "נורא ואיום", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: גיל \nלא הייתי בהרצאות.\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: \nמתרגל טוב, יודע את החומר לעומק ונותן דוגמאות מציאותיות. הדפים של התרגול מסבירים את התרגילים כמו שצריך.\nשעורי הבית: \nמתישים, ארוכים, ובלי רפרנס קשה להצליח לבד.\nהמבחן: \n\nהשורה התחתונה: \nהקורס הכי בזיוני שלקחתי בטכניון, יש מליון סתירות בין מה שנאמר בתרגולים ובהרצאות, יש מליארד דברים קטנים שאם לא זוכרים או לא רושמים אז אפשר לא להצליח תרגילים בקלות. יש בערך 350 שקופיות (אומנם חלקן תמונות) אבל כל דבר קטן שנרשם שם שיכול להראות לא רלוונטי לפעמים, חשוב וישאלו עליו במבחן. סיוט.", "timestamp": 1645362458903}, {"author": "בורג", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: גיל יודילביץ'\nחוות דעת - הרצאות: \nלא יודע, לא הייתי. מספיק לקרוא מצגות\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: \nהשעה הייתה באמצע הלילה אז להתרכז לא היה פשוט. הם רלוונטיים במידת מה.\nאור מנסה להסביר את הדברים תכלס שזה טוב. מידי פעם מביא כל מיני מכשירים כדי להדגים על דברים שלומדים איתם באותו התרגול.\n\nשעורי הבית: \nקשים, ארוכים ובעיקר בעיקר מרופרנסים. הרפרנס מלא טעויות שנחמד לעלות עליהם אבל אף אחד לא יודע מה התשובה הנכונה וגם אף אחד לא הולך לבדוק ברצינות 10 עמודים של פתרון לאיזו שאלה.\n\nהמבחן: \nסיוט של 3 שעות. ארוך בטירוף. משעמם כמו כל הקורס.\n\nהשורה התחתונה: \nהקורס הכי משעמם שעשיתי בתואר.", "timestamp": 1646084327747}, {"author": "t", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גיל יודילביץ'\nחוות דעת - הרצאות: בתור אחד הבודדים שהיה בהרצאות ההרצאות אותי אישית עניינו מאוד. גיל תמיד מראה ומסביר כיצד דברים נעשים בפועל ולא רק בחישובים על דף ומספר על חוויות אישות שלו שמוסיפות לחומר הנלמד.\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: מתרגל מעולה, מעביר את החומר באופן ברור ותמיד יש אווירה טובה איתו בתירגולים. מדבר אל הסטודנטים בגובה העיניים ותמיד מסביר מעבר לחומר עצמו.\n\nשעורי הבית: קשוחים ממש, לרפרנס זו תכלס הדרך ואז כשלומדים למבחן מבינים שזה לא כל כך נורא אלא פשוט בגלל העומס של סמסטר 5 נראה לא אפשרי(חוץ משאלה אחת בגיליון גלים).\n\nהמבחן: המבחן היה בסדר(מועד א'). הבעיה העיקרית הייתה של לחץ זמן.\n\nהשורה התחתונה: אני כנראה היחיד במחזור שלי שיגיד שהקורס הזה היה באמת מעניין הרבה יותר מכל הקורסים האחרים(אולי חוץ מטיס ושיטניס שגם זו לא הדעה הכי מקובלת). בסופו של דבר הקורס הזה שונה משאר הקורסים וצריך לבוא אליו עם גישה שונה מבדרך כלל. אם באים לקורס הזה עם גישה שונה מהרגילה הוא באמת אחד היותר מעניינים בתואר עד סמסטר 5, אבל מי שמצפה לחישובים ומשוואות אנליטיות וחד משמעיות כמו תמיד סביר להניח שלא יתחבר.\nההרצאות והתירגולים רק הוקלטו ולא שודרו בלייב.", "timestamp": 1646089605552}, {"author": "מה למלא פה?", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: גיל יודילביץ'\nחוות דעת - הרצאות: \nנכחתי עד שבוע 3 והחלטתי שאני יכול לקרוא שקופיות לבד, ייתכן שיעזור לכם, אם כי אישית, לא מצאתי טעם.\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: \nזורק אחושילינג, מלמד סביר, מרפרנס תרגילים מנורטון, עונה בדילאיי למיילים, לפחות גברי בנוגע למנהלות.\nשעורי הבית: \nלא התחברתי לקונספט של הסבל, בגדול, הצבה להצבה למול מצגת למול נורטון למול דף נוסחאות למול עיניים דומעות.\nהמבחן:  \n\nהשורה התחתונה: \nחובה, מבאס, והכי מבאס שאין מבחנים רשמיים ( גם לא בחנות חוברות)\nהטיפ שהייתי נותן לעצמי בתחילת סמסטר הוא לשבת על כל השקופיות יום אחד, עם הפסקות, אבל באופן רציף, ולנסות להבין את הקונספט ולחפש ביוטיוב פלייליסטים מוצלחים, אמנם הקורס לא הכי מהנה, אבל השקופיות מאוד מאוד מאוד אינפורמטיביות.", "timestamp": 1646589214356}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גרגורי קליין\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: בתרגולים בסדר, כדאי ללכת אבל אין עם מי לדבר מחוץ להם\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: זרקו עלינו ממש, למדנו לבד למבחן, מלא טעויות קטנות בתרגולים שתדעו\nאבל קורס חשוב ומעניין בסהכ", "timestamp": 1679266560024}, {"author": "תזמינו לי אמבולנס", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גריגורי\nחוות דעת - הרצאות: \nהרצאות אם יש כזה דבר, במתכונת הפרוייקט, בכלל לא רלוונטיות לכם ועקרונית כתוב שיש הרצאות רק כדי שלגריגורי יהיה תפקיד פורמלי כלשהו בקורס הזה. לא להתקרב, מזללת זמן.\n\nהפרוייקט:\nלא באמת יבדקו לכם את הפרוייקט. אתם הולכים לעבוד על הפרוייקט הזה כל הסמסטר ולתת את הנשמה שלכם בשביל ה3.5 נקז היקרים הללו, אבל למעשה מה שאתם לא יודעים זה שאתם מספר הגרלה בתוך כדור לוטו ענק שמסתובב לו בצורה אינרציאלית שכזאת ככה שהציון שיוגרל לכם ישתלב בצורה מופתית, אקראית, רנדומלית ושרירותית מושלמת בתוך פעמון גאוסי מופלא.\nהעקרון הוא הנראות של הפרוייקט, רמת היכולת שלכם בוורד לעשות אייקונים יפים, והיכולת שלכם לאו דווקא למצוא את האמת והתשובה הנכונה - שדרך אגב לא קיימת - אלא להראות משהו שגוי עם רמת פוטושופ גבוהה.\nלאורך כל הסמסטר לא תדעו מה אתם צריכים להגיש, כשתלכו לברר תקבלו עוד מטלות ועוד משימות שחובה לעשות שלא כתובות בדף הרשמי.\nאין אמת לאופן החישוב, אין הגדרות, אין כללים, אין חוקים, אין קורס. אתה לבד עם עצמך שוקע לתוך יגון מפואר העשוי מפלדת אל חלד עם מספר שבחרת בלית ברירה כי מישהו אמר לך שהוא טוב.\nהסיכוי היחידי לשפיות הוא חברי הקבוצה שלצידכם, אז תבחרו בחוכמה. בסוף לא תקבלו פידבק ולא הסברים למה קיבלתם את ציונכם הארור, כי הרי זה הוגרל בבירור.\n\nהשורה התחתונה: \nלהכין מראש - כדורים לחרדה, רמת כתיבת מיילים טובה, משפטי חנופה, ממחטות טישו, מייקרוסופט טימס, גרון לצעקות, טבליות וואבן 30 מיליגרם וקללות שלא מפרקות חברויות.", "timestamp": 1715242736723}]}