{"posts": [{"author": "Avital Gaft", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: המון חומר בזמן קצר מאוד, אבשלום רץ על הכל, הרבה פעמים לא מובן עד הסוף ולפעמים לא נותן מקום לשאלות\n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: מובנים, החומר מתאים להרצאות ולמבחנים, עובר ביסודיות \n\nשעורי הבית: גליון פעם בשבועיים, קשים מהתרגולים\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס קשה ולא מובן", "timestamp": 1603118761426}, {"author": "M", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה:  אבשלום מנלה\nחוות דעת - הרצאות: קשות ולא מובנות. אבשלום זרק מלא מושגים לאוויר ו\"ניסה\" להסביר את החומר. כל החומר היה צפוף ודחוס והוא אף הוסיף כמה שעות נוספות בשביל לסיים את החומר.\n\nשם המתרגל/ת: ירון בן עמי\nחוות דעת - תרגולים: מתרגל תותח \n\nשעורי הבית: לא הכי נחמדים אבל ברמה סבירה\n\nהמבחן: מקרי לחלוטין עם שיעורי הבית וממש לא נחמד.\n\nהשורה התחתונה: קורס זרימה ראשון בתואר שכדאי ממש להיות עליו", "timestamp": 1604667250542}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: \nאבשלום מרצה אנרגטי ומעניין שאוהב את מה שהוא מלמד. רוב ההרצאות הן פיתוחים שחשובים מאוד גם למבחן. הפיתוחים מסובכים מאוד וקשה מאוד לעקוב אך שווה מאוד להתאמץ, לנסות לסגור פערים ולחזור על החומר לפני ההרצאה (עד כמה שמצליחים, סמסטר 4 עמוס).\nמלבד ספרים באנגלית יש גם ספר לא מוכר בעברית \"תורת הזרימה\", בספריה מתויג כ\"וסר532.5\"שכתוב בעברית ומכסה את רוב החומר ויכול לעזור מאוד להבנה.\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: \nחשובים לשיעורי הבית. יש תרגולים מוקלטים של ירון בן עמי מ 2017 שהם מעולים ועוזרים מאוד לסגור פינות או לחזור על דברים לא מובנים לחלוטין מהתרגול.\nשעורי הבית: \nקשים מאוד. אמנם רפרנסים קיימים לחלק גדול אך מומלץ מאוד לשבור עליהם את הראש לבד ורק להיעזר ברפרנסים כשממש תקועים וזה עלול לקחת זמן. שווה לנסות לראות שוב את התרגולים תוך כדי על מנת להיזכר.\nהמבחן: \nלא קל כפי שההיסטוגרמות מדברות היטב בעד עצמן. חשוב להיות חדים מאוד על החומר בדגש על הפיתוחים וההסברים לדברים. הרבה שאלות דומות מאוד לשאלות ממבחנים ישנים אז שווה לפתור כמה שיותר כאלה. הוא הוגן אבל קשה מאוד אז צריך ללמוד מאוד מאוד חזק למבחן הזה.\nהשורה התחתונה: \nמהקורסים הכי קשים אך גם מהכי מעניינים. וספוילר: ושני פאי :)", "timestamp": 1627393213634}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: בעיני ההרצאות הכי מעניינות בסמסטר רביעי. החומר לא קל, צריך להספיק הרבה וגם ההסברים לא תמיד הכי מובנים. אבל בסופו של דבר ההרצאות היו נורא מעניינות בעיניי ומי שמשקיע מעבר לזמן של ההרצאה בלהבין את החומר גם יצליח להבין אותו.\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: סך הכל מתרגל אחלה ממש. מסביר את החומר בצורה הכי פרקטית שלו ולא נכנס לדיונים עמוקים על החומר. מסביר כמו שצריך איך לפתור את השאלות.\n\nשעורי הבית: היו לנו שישה גליונות. הראשונים באמת לקחו מעט זמן ופתרנו אותם עצמאית. את הגליונות האחרונים היה כבר קשה יותר לפתור עצמאית והם לקחו יותר זמן. סך הכל שווים 10% תקף.\n\nהמבחן: היה מבחן קשה. אבל ככה זה במקצוע הזה...\n\nהשורה התחתונה: קורס מעניין ממש. לא קל. אבל מעניין.", "timestamp": 1658909003135}, {"author": "אויילר", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: אבשלום אחלה מרצה, מעניין מספיק כדי שתקשיבו לשלוש הרצאה ברצף. ההרצאות עצמם עמוסות מידי, כמות החומר שנזרקת שם היא לא נורמלית, אין באמת הבנה של החומר מההרצאות, ולכן הקורס מחייב למידה רצינית בבית וחזרה על החומר, כדאי להתייחס ברצינות לכל דבר שנאמר בהרצאות שכן כל פיתוח יכול להופיע כשאלה במבחן, כדאי לחזור על ההרצאה הקודמת לפני ההרצאה הבאה.\n\nשם המתרגל/ת:  אור אבני\nחוות דעת - תרגולים: אור לא מתרגל טוב, יש הקלטות משנים שעברות של מתרגל אחר, תצפו בהם ותחסכו לכם הליכה לפקולטה.\n\nשעורי הבית: קשים, לוקחים זמן, אך מלמדים , כדאי לנסות לפתור לבד בלי רפרנס.\n\nהמבחן: באופן גורף המבחנים של מנלה קשים, מכיוון שהקורס כזה עמוס בחומר אין לדעת אילו שאלות יופיעו במבחן ומנלה יכול לתת הכל , אפילו להוכיח זהות מתמטית שיותר תזכיר מבחן בחדוא 2, ולכן צריך דעת את החומר היטב, הרצאות תרגולים ושיעורי בית צריך לדעת טוב, בדגש על הבנה, זה מקצוע שלפתור הרבה מבחנים לא בהכרח עוזר, צריך הבנה אמיתית של החומר.\n\nהשורה התחתונה: עמוס מידי, צריך לפרק אותו מיד לשני קורסים או לתת לו הרבה יותר נקז מ 3.5. הוא לא קל, ומצריך שקידה רצינית, אפשר להצליח, עם קצת מזל והמון למידה. אבל בסופו של דבר, בין הקורסים היותר מעניינים בתואר.", "timestamp": 1659007332395}, {"author": "The Dude", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: \nההרצאות טובות, אבל חשוב מאוד לדעת אותם מאוד מאוד טוב, שליטה והבנה בדף הנוסחאות מתחילת הסמסטר (לשאול ולהבין כל נוסחה והסקה) תניב הבנה בקורס.\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: \nהתרגולים של אור בסדר, למדתי אישית מהמוקלט. (אותו מערך תרגול)\nשעורי הבית:\nלא מאתגרים, אבל עם כמה שעמוס מאוד חשוב לפתור אותם לבד. על גבול ההגיוני כמובן. \n\nהמבחן: \nהוגן, אבשלום נותן הרבה ודורש הרבה, לדעת הוכחות ולהבין את הקורס מאוד מהותי במבחן, ההתכוננות דרשה המון ממני באופן אישי.\nהשורה התחתונה:", "timestamp": 1678828887958}, {"author": "♡", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: חשוב ללמוד טוב בהרצאות.\n\nשם המתרגל/ת: אור אבני\nחוות דעת - תרגולים: המתרגל לא מבין בחומר. אם שואלים אותי שאלה הוא ימצא כל דרך לא לענות. בן אדם חסר ידע ולא אכפתי.\n\nשעורי הבית: סבירים אבל לא נבדקים באמת.\n\nהמבחן: קשה אבל אפשרי. חשוב ללמוד מההרצאות. החומר מעניין אך לא מלמדים אותו טוב", "timestamp": 1689202706032}, {"author": "כיף לי מאוד", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מנלה\nחוות דעת - הרצאות: \nההרצאות הכי מצחיקות מרתקות וטובות שראיתם בחייכם. מנלה הוא פשוט פנומן גדול ואיש מעניין. הוא תמיד אומר שאין אפילו שנייה לבזבז בקורס ואז במשך 10 דקות הוא מספר סיפורי אלף לילה ולילה על היותו סטודנט צעיר בפקולטה. ההרצאות חשובות מאוד מאוד. לראות את כל הקורס פעמיים. לראות את ההקלטה לפני הרצאה או אחרי ההרצאה, רק ככה אפשר להבין כי בהרצאה הוא מדבר בקצב שתאי המוח לא מסוגלים לקלוט. כל מילה שיוצאת לו מהפה היא חשובה מאוד. האיש הוא אגדה.\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: \nאור נחמד מאוד. הוא תמיד עונה לשאלות , הוא לא יודע לענות עליהן בצורה טובה כל כך אבל הוא תמיד עונה. \nשעורי הבית: \nבשיעורי הבית לעבוד צמוד לדף נוסחאות. לאורך כל הסמסטר לשלוט בדף. הוא הדף הכי חשוב שיש והוא כתוב בצורה המסובכת ביותר שיש אז לפשט אותו.\nהמבחן: \nהמבחן היה הוגן לקורס. יש שאלות בונקר שמנלה שם. גם את המילה האחרונה שהוא אומר בקורס ללמוד טוב כי הייתה עליה שאלה במבחן.\nהשורה התחתונה: \nהקורס הכי מעניין.", "timestamp": 1691591040936}, {"author": "ברנולי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מנלה\nחוות דעת - הרצאות: \nהן בסדר סך הכל האמת. מנלה קצת מציק אבל סך הכל חמוד. הפיתוחים בכיתה קלים והוא לוקח את הזמן להסביר אותם. בחלק השני של הקורס הוא פשוט מגדיר כל חצי שעה זווית תקיפה מחדש ושם אתם תבינו שאפשר להפסיק להקשיב.\nיש הקלטות אגב שזהות להרצאות אפילו בבדיחות \n \nשם המתרגל/ת: שכחתי את השם אבל מרגיש לי שמתחיל באות א'\nחוות דעת - תרגולים: \nמנסים לעשות תרגול של שעתיים בשעה וזה מורגש. המתרגל לא בקיא בחומר ברמה מספקת לטעמי. אפשר לקרוא את התרגולים ולחסוך זמן לעצמכם (מוטיב חוזר בפקולטה לחדי הבחנה)\n\nשעורי הבית: \nמנלה טוען שהם אפשריים וחשוב לעשות אותם לבד כדי להצליח. אני טוען שתרפרנסו הכל כי לא בודקים אותם בכלל והם די קשים וזה לא משפיע על ההצלחה בסוף \n\nהמבחן: \nקל. ממוחזר. תבואו מוכנים למועד א וככה לא תעשו שאלות על החלק האחרון בקורס שהוא הכי מציק \n\nהשורה התחתונה: \nהחצי הראשון של הקורס מעניין, השני חופר \nכולם מזהירים מהקורס הזה בפקולטה ונוצרה לו הילה של קורס מסנן ומכשול מרכזי בתואר. לפי דעתי אנשים מגזימים, זה קורס סביר ברמת קושי והעומס ואפילו מביאים לכם דף נוסחאות מפורט במבחן. בקיצור התאכזבתי never meet your heroes", "timestamp": 1704492345751}]}