{"posts": [{"author": "Ori pikcles", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: בגלל הקורונה היו משעממות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הרבה שיעורים קשים יחסית\n\nהמבחן: מועד א סביר, מועד ב קשה\n\nהשורה התחתונה:", "timestamp": 1614954456954}, {"author": "Avital Gaft", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעקב כהן \nחוות דעת - הרצאות: \nהרצאות ארוכות אבל מעניינות, יעקב משקיע זמן בהבנה של החומר ובמתן אינטואיציה. מראה גם הרבה סרטונים שמדגימים את כל התופעות שנלמדות במהלך הסמסטר.\nיש הרבה פיתוחים מתמטיים. \nשם המתרגל/ת: אייל דדו\nחוות דעת - תרגולים: \nתרגולים מאוד מושקעים וצמודים לחומר, עוזרים מאוד להבנה של המה שנלמד בהרצאות. אייל מאוד קשוב ועוזר במהלך הסמסטר.\nשעורי הבית: \n11 גיליונות 10 חובה. מאוד דומים למה שנעשה בתרגולים. לא קשים אבל לפעמים ארוכים.\nהמבחן: \nמבחן רמה מעל התרגולים, היו שאלות מאוד מפתיעות שלא נראה הסגנון שלהן לא בהרצאות ולא בתרגולים. דורש הבנה מעמיקה של החומר ושימוש של כל הנוסחאות. \nהשורה התחתונה: \nקורס מאוד מעניין שמועבר בצורה טובה מאוד, המבחן די קשה", "timestamp": 1615559879040}, {"author": "MU", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה:איאן ג׳קובי\nחוות דעת - הרצאות: איאן מרצה מעולה! הרצאות מאוד מעניינות אך כוללות הרבה פיתוחים מתמטיים ולכן קל לאבד אותו במהלך ההרצאה.\n\nשם המתרגל/ת: עידן צ׳אושו\nחוות דעת - תרגולים: עידן השתדל מאוד הסמסטר ותרם מאוד להבנת החומר.\n\nשעורי הבית: יש מעבדת בית קלילה שמהווה 15% מהציון הסופי.\n\nהמבחן: מועד א-  לא פתיר, ממוצע 38.\n\nהשורה התחתונה: קורס מאוד מעניין , למרות שהמבחן קשה מאוד הציון הסופי בקורס בסדר.", "timestamp": 1644320430358}, {"author": "לובריקציה", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: איאן ג'קובי\nחוות דעת - הרצאות: \nמרצה טוב שדוגל במתן אינטואיציות, חובב גדול של הנחות והזנחות, בעל שיטת הוראה מיוחדת. יש סטודנטים שהתחברו, אני אישית מעט פחות.\n\nשם המתרגל/ת:  עידן צ'אושו\nחוות דעת - תרגולים: \nמתרגל טוב, משקיע, מסביר ברור, מדבר מהר לעתים מידי. תותח על ומקצוען רציני.\n\nשעורי הבית: \nאין כאלה חוץ ממעבדת בית בסוף הקורס. זה לא טוב כי אז מאבדים את הקורס ולא מבינים כלום עד התקופת מבחנים ואז שיהיה בהצלחה חחחחחחחח\n\nהמבחן: \nקשה. מאוד. איאן דוגל במבחנים בלי דף נוסחאות (מבחינתו יש 4 משוואות בסיסיות שצריך לדעת), הרבה הנחות שצריך לעשות.\nאיאן גם דוגל בממוצע שנע בין 30 ל 50 אבל אחר כך מנרמל ל 75 סופי.\n\nהשורה התחתונה: \nקורס לא הכי כיף, אבל חשוב מאוד לאווירונאוטים", "timestamp": 1644865157497}, {"author": "מה למלא פה?", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איאן יעקובי\nחוות דעת - הרצאות: \nנורא התחברתי ועוזרות, המחזור שלי פחות התחבר.\nאיאן מחשיב כל שאלה ומתייחס אליה בכובד ראש, מעודד מאוד לשאול שאלות להבנה.\nשם המתרגל/ת:  עידן צ'אושו\nחוות דעת - תרגולים: \nגאון!\nהמתרגל הכי טוב שהיה לי אי פעם, שיגעתי אותו בשאלות והוא תמיד ענה באדיבות.\nעצם זה שיש לו רקע כזה מטורף בזרימה מאוד עזר להבנה של הקורס גם דרך קבצי התרגול וגם לאורך ההתכוננות לבחינה.\nשעורי הבית: \nאי פרט למעבדה ששווה לעשות מהר, שווה גם לפתור את התרגולים ושיעורי הרשות שמפורסמים החל מתחילת הסמסטר.\nהמבחן: \nקשה, אבל הוגן אם מתכוננים באמת.\nהשורה התחתונה: \nקורס מאוד מעניין ואני אישית ממליץ עליו בחום כאחד הפיקים של התואר, במיוחד עם איאן.", "timestamp": 1649587686497}, {"author": "שקר כלשהו", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: איאן\nחוות דעת - הרצאות: \nיש הקלטות שלו בעיקרון אז אין לי מה להגיד\n\nשם המתרגל/ת: נעמה\nחוות דעת - תרגולים: חלק מהתרגולים חשובים בקטע של ללמוד טכניקה איך לגשת לתרגיל וכו'\nחלק מהתרגולים מכילים שאלות באורך של 8 דפים שאין באמת סיכוי שיהיה משהו כזה במבחן אז אין טעם ללמוד אותם\n\nשעורי הבית: כנל\n\nהמבחן: לא פשוט, אבל אם לומדים את הדרך הגנרית לפתרון אפשר בכיף להוציא 75+\n\nהשורה התחתונה: קירוב לובריקציה", "timestamp": 1677272204925}, {"author": "אוילר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איאן\nחוות דעת - הרצאות: מרצה טוב מאוד, מתעכב על כל דבר ככה שאי אפשר לא להבין אם באמת מקשיבים, רשימות מסודרות. הוא יכול ללמד ילד ביסודי זרימה צמיגה.\n\nשם המתרגל/ת: נעמה\nחוות דעת - תרגולים: כנראה לא תמשיך סמסטר הבא, בשביל לתרגל קורס כזה חייב לבוא עם רקע עשיר והבנה עמוקה. לא מספיק לצערי לקבל 100 בבחינה כדי לתרגל את הקורס והרגישו את זה.\n\nשעורי הבית: קשים, בלי רפרנס קשה עוד יותר. אבל משקפים בערך את הרמה\n\nהמבחן: שלנו היה קל יחסית משנים שהיו, עם כי ככלל קשה מאוד. אפשר להצליח, אם לומדים קשה אבל זה מאוד מאתגר.\n\nהשורה התחתונה:  קרוס מעניין, אם כי קשה. בכל אופן שווה מאוד שכן החומר עצמו רלוונטי לתואר ומעניין מאוד.", "timestamp": 1678532411043}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: איאן\nחוות דעת - הרצאות: מרצה מעולה נהניתי מכל הרצאה, אכפת לו שנבין את החומר\n\nשם המתרגל/ת: לא רלוונטי יותר כנראה\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס חשוב ומאוד מעניין", "timestamp": 1679266625692}, {"author": "W", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איאן ג'קובי \nחוות דעת - הרצאות: \nאיאן מרצה מעולה, לא חוסך פרט מהסטודנטים. ההסברים ברורים והחומר מעניין ומועבר בצורה מסודרת.\nהעניין הוא שלפעמים קשה להתרכז בגלל המונוטוניות של איאן. ההרצאות הן 3 שעות ומלאות בפיתוחים ארוכים ומסובכים ולכן זה יכול להיות קשה מאוד להתרכז בו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמפורטים, אפילו מפורטים מדי. שווה להתרכז ולהבין את הפיתוחים שם כי זה לב העניין בקורס.\n\nשעורי הבית:  \nקשים מאוד, מרופרנסים לחלוטין.\nסטודנטים שבאמת חדים על החומר יכולים איכשהו לפתור לבד את חלק מהסעיפים.\nנוסף על שיעורי הבית הייתה לנו מעבדת בית, לא מאוד קשה.\n\nהמבחן: \nאיאן ידוע לשמצה בקטע של המבחנים.\nהם קשים מאוד, הכי קשים שתעשו בתואר,\nאבל שיטת הבדיקה של איאן היא הוספת בין 2.5 ל10 נקודות על כל דבר נכון שאתם כותבים, ואז לתת פקטור לכולם כדי שהממוצע יהיה סביב 75.\nבמילים אחרות, אפשר לקבל 70 בבחינה ו100 בציון הסופי.\nטיפ: לתרגל המון מבחנים לקראת המבחן.\n\nהשורה התחתונה: \nקורס מרתק ששווה מאוד להיות חד עליו במהלך הסמסטר. עם מספיק תרגול לפני המבחן אפשר להוציא ציון גבוה מאוד.", "timestamp": 1679469293913}]}