{"posts": [{"author": "Avital Gaft", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 2 גליונות, כולל עבודה על מטלב. פרויקט מסכם- קוד מטלב ארוך ומסורבל, דוח פרויקט ארוך ומיגע, הדוח נבדק בקפידה רבה\n\nהמבחן: 2 שאלות דומות לשיעורי בית, תרגולים וחוברת מבחנים, 2 שאלות שונות לגמרי הדורשות הבנה של החומר\n\nהשורה התחתונה: החומר קל, ההרצאות לא כל-כך מובנות, המבחן בעל קושי בינוני", "timestamp": 1603118636381}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יובל דגן\nחוות דעת - הרצאות: \nיובל מרצה מעולה. ההרצאות מעניינות, מגניבות ויחסית פשוטות למי שחזק בטורי טיילור ובמתמטיקה.\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: \nהתרגולים לא תמיד הכי מעניינים כי הם מאוד טכניים אך הם מסכמים היטב את הנושאים וחשובים לשיעורי הבית ולמבחן אז שווה להיות חדים עליהם.\nעומרי מתרגל מעולה שתמיד זמין לשאלות ומשקיע בסטודנטים.\nשעורי הבית: \nשני גליונות ארוכים יחסית, בדגש על שאלות הקוד. עם חדים על החומר ועל תכנות במטלב זה יכול לחסוך הרבה זמן יחסית.\nלא קל להוציא מאיות אך הבדיקה הוגנת ומי שמשקיע בהחלט יכול לקבל מעל 90. חשוב להקפיד על כל ההנחיות ולא לפספס אנקדוטות. כל פרט חשוב בקורס הזה.\nבנוסף יש פרויקט ארוך בו מגישים קבצי מטלב ודו\"ח. בשניהם חשוב להשקיע. כמו כן רצוי להשקיע בו גם על שיפור זמן הריצה שעשוי להתארך לדקות ארוכות.\n\nהמבחן: \nהוגן. מי שלומד טוב לחלוטין יכול להצליח\nהשורה התחתונה: \nאחלה קורס", "timestamp": 1626953546445}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יובל דגן\nחוות דעת - הרצאות: \nהרצאות בסדר, הרצתי פי 2.5 זה היה די אכיל וכיף, חשוב לראות שמבינים, ממש מומלץ לקרוא ולראות שהבנתם.\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: \nלדלעת יש יותר כריזמה ויכולות הוראה.\nפשוט תראו את התרגולים, ותפתרו תרגילים מהחוברת ומהתרגולים, אני לא התחברתי אליו כמתרגל.\nשעורי הבית: \nשתי גליונות\nחלק רטוב-בסדר, בא יותר להקנות השתפשפות במטלב.\nחלק יבש-כיף ממש, מקנה ביטחון טוב בחומר.\nהגליונות לא מכסים את כל החומר!!!!\nחשוב מאוד לפתור מהתרגולים או חוברת תרגילים בכדי לצבור ביטחון ויכולות לפני הבחינה.\nהפרוייקט בסדר וכיף לעשות אותו בזוגות, טיפ חשוב זה לכתוב קוד כמו בנאדם ולא כמו חמור, ולפרק דברים ליחידות קטנות.\nברגע שנסגרתם על מימוש של שיטה נומרית כלשהי, תהיו מודעים למגבלות שלה.\nתתחילו לפתור את הלב של הפרוייקט לפני התקופת מבחנים שהיא לא תתחרבן לכם.\nהמבחן: לא הוגן נטו כי הבטיחו פחות שאלות ויותר בחירה, אבל היה סבבה.\nלעומרי יש סיסטם:\nלפרגן בשב מבחינת אחוזים, לתפוס ממש בקטנות על כל דבר-אז תגרמו לכך של יהיה לו על מה לתפוס.\nאחרי שיש לכם ציון סביר פלוס בשאר האחוזים המבחן יותר בא להוריד את האחוזים, אז תתנו גם שם בראש, זה אפשרי.\nהשורה התחתונה: \nכיף, שימושי, פותח את הראש, עומרי לא מתרגל טוב. (הוא בנאדם ממש אחלה, אבל פחות התחברתי אישית, אולי תאהבו...)", "timestamp": 1642633933571}, {"author": "אויילר", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יובל דגן\nחוות דעת - הרצאות: הוא מעביר את החומר בצורה טובה, לא הרגשתי שההרצאות הם חובה להבנת החומר ושאפשר לוותר עליהם. יובל מרצה מאוד נחמד שנהנה ללמד. \n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים:  עומרי מקריא מדף התרגול, לא נותן אינדיקציה נוספת או ערך מוסף, רוב התרגולים הוא אפילו לא קם מהכיסא. אתם יכולים לקרוא לבד בבית את הדפי תרגול כנראה בצורה אף יותר טובה ממנו.\n\nשעורי הבית: לוקחים זמן, מאתגרים, אך מספקים ומלמדים מאוד.\n\nהפרוייקט: לוקח הרבה זמן, תתחילו ותסיימו לפני התקופת מבחנים כדי שתוכלו להתרכז במבחנים, הוא מאתגר אבל גם פותח את הראש.\n\nהמבחן: הוגן פלוס, אם עברתם על התרגולים והתרגילים מהחוברת תרגילים אתם לא תופתעו למצוא משהו שלא פתרתם כבר במבחן.\n\nהשורה התחתונה: קרוס קליל, חמוד, מהווה פתיחה לקורסי המשך.", "timestamp": 1659006539468}, {"author": "אחד שהתחבר יחסית לנומרית", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יובל דגן\nחוות דעת - הרצאות: בסדר קצת משעממות \n\nשם המתרגל/ת: עומרי חמו\nחוות דעת - תרגולים: בסדר קצת משעממות\n\nשעורי הבית: 2 הגשות + פרויקט עומרי בודק אותם בצורה ממש קפדנית אז לשבת על הפרטים הקטנים\n\nהמבחן: בסדר בגדול, יובל ממחזר את סגנון השאלות שלו\n\nהשורה התחתונה: קורס סבבה יחסית לדעתי", "timestamp": 1691598777714}]}