{"posts": [{"author": "Avital Gaft", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: דן גבעולי\nחוות דעת - הרצאות: מובנות מאוד, מועברות ביסודיות לפירוט, עם קישורים לתעשייה ולחיים מעבר למשוואות\n\nשם המתרגל/ת:\nחוות דעת - תרגולים: \n\nשעורי הבית: גליון כל שבוע, לא קשים, מאוד דומים לתרגולים\n\nהמבחן: אמריקאי, לא קשה מידי \n\nהשורה התחתונה: קורס מעניין שמועבר בתורה מקצועות, המבחן הגיוני מאוד", "timestamp": 1603118855592}, {"author": "שקד לוי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nפבל מרצה מקסים, לא כ\"כ מבינים את כוונתו לפעמים בגלל הפער בשפה. חוץ מזה, אנושי וממש משקיע וסבלני.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמיכל מדהימה ומסודרת\nשעורי הבית: \nקלילים\nהמבחן: \nדי הוגן, אבל שונה מתרגילי הבית\nהשורה התחתונה:", "timestamp": 1626121585554}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פבל גליץ'\nחוות דעת - הרצאות: \nמרצה נחמד ומתחשב שנהנה מללמד סטודנטים. פערי השפה יכולים להיות קשים ומי שמתקשה באנגלית מומלץ להיעזר בסיכומים בעברית. הרצאות לא רלוונטיות כל כך לשיעורי הבית אך כן לבחינה ולכן מומלץ להגיע אליהן.\nשם המתרגל/ת: מיכל פושקוב \nחוות דעת - תרגולים: \nמתרגלת מעולה. תרגולים מסכמים היטב את הנושא של אותו השבוע ושיעורי הבית מתבססים עליהם.\nשעורי הבית: \n10 גליונות, אחד כל שבוע בעשרת השבועות הראשונים. לרוב לא מאוד קשים או ארוכים ואחוז גבוה יחסית מהציון\nהמבחן: \nשונה משיעורי הבית. אמריקאי עם חומר פתוח חשוב להיות חדים גם על אנקדוטות. אפשרי להצליח בו\nהשורה התחתונה: \nקורס חביב", "timestamp": 1626952901420}, {"author": "ברכות", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פבל גליץ'\nחוות דעת - הרצאות:  מתוק, אבל לא הכי ברור, איש טוב אבל כדאי ללמוד מסיכומים במקביל אליו.\n\nשם המתרגל/ת:  מיכל פושקוב\nחוות דעת - תרגולים:  מיכל מדהימה, מסודרת ומאורגנת, מתרגלת טובה וזמינה למיילים במהלך הסמסטר.\n\nשעורי הבית: עוזרים להבנה מאוד! חשוב לעשות לבד ולא מעמיסים\nהמבחן: \nהמבחן יותר טריקי מאשר מראה על ידע, חשוב לתרגל ממבחני עבר כי בשיעורי בית יש יותר את החומר ולא את הסגנון.\nהשורה התחתונה: אפשר להגיע לציון טוב בהשקעה סבירה", "timestamp": 1633878252792}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פאבל גאליץ'\nחוות דעת - הרצאות: פאבל נחמד ממש. למי שלא דחוף להגיע אפשר להשלים מדפי ההרצאה שהוא מעלה וזה ייקח הרבה פחות זמן.\n\nשם המתרגל/ת: אופיר וקנין\nחוות דעת - תרגולים: מתרגל מעולה! מסביר את הנושאים כמו שצריך ופותר את התרגילים בצורה ברורה ומסודרת. בנוסף העלה דפי תרגול מעולים שעזרו לפתרון שיעורי הבית.\n\nשעורי הבית: גיליון כל שבוע. הגיליונות מרופרנסים אבל שווה לפתור אותם עצמאית. לא דורשים יותר מדי זמן למי שהיה בתרגול או שהשלים אותו מהדפים.\n\nהמבחן: המבחן היה עם חומר פתוח. הטופס היה באנגלית, למרות שלא טרחו לעדכן על זה לפני. שתי שאלות פתוחות, אחת קלילה והשנייה נוראית. בדיעבד כנראה שבדקו אותה בצורה מאוד מקלה כדי שהממוצע לא ירד ל-60. חוץ מזה 14 אמריקאיות שהיו כמעט מרופרנסות למרות שבכל אחת שינו משהו קטן בשאלה. כמעט בכל שאלה זה שינה לגמרי את התשובה הסופית אז מי שפשוט העתיק את התשובה מהטפסים של שנים קודמות או לא קרא טוב את השאלה יכל ליפול בזה.\n\nהשורה התחתונה: קורס קליל, נחמד, פותח את הראש לקראת בחירה של אשכולות ויכול לתת מושג כללי על הכיוון לגבי אשכול מבנים.", "timestamp": 1658908764216}, {"author": "אויילר", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פאבל גליץ\nחוות דעת - הרצאות: פאבל מקסים, לפעמים יש קושי בלהבין אותו. ההרצאות עצמם די משעממות החומר עצמו לא מלהיב ולכן הרוב וויתרו על ההרצאות, הם לא חובה והתרגולים הם למידה מספקת לבחינה.\n\nחוות דעת - תרגולים:  לא משנה למי תלכו, רוב המתרגלים לא יודעים באמת את החומר, אלה חזרו עליו כמה שעות לפני התרגול. תחסכו את זה, ותלמדו מהתרגולים לבד.\n\nשעורי הבית:  מלמדים, אך ללא קשר מהותי לבחינה.\n\nהמבחן:  שונה מעט מהתרגולים והשיעורי בית, אך הוגן. מי שלומד טוב יכול להוציא ציון גבוה.\n\nהשורה התחתונה: קורס קליל, לא הכי מעניין, סגל לא משהו.", "timestamp": 1659006980492}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פאבל גאליץ'\nחוות דעת - הרצאות: הועברו באנגלית. ניתן היה לקרוא את סיכומי ההרצאות ולהסתפק בזה אבל סך הכל היה מעניין.\n\nשם המתרגל/ת: אופיר וקנין\nחוות דעת - תרגולים: אחלה מתרגל, העביר את התרגולים בצורה ברורה ולימד את מה שהיה צריך לדעת תכלס\n\nשעורי הבית: קלילים יחסית ומרופרנסים. שווה היה להשקיע ולבצע עצמאית כי זה עזר להבין את החומר\n\nהמבחן: שתי שאלות פתוחות. הראשונה הייתה מאתגרת אבל בדקו בצורה יחסית מקלה כנראה. השנייה ממש סבבה ושאר השאלות היו אמריקאיות. בדקו בעיקר את היכולת לשים לב להבדלים הקטנים בין השאלות במבחן לבין השאלות משנים קודמות ואיך זה ישפיע על התשובה. חומר פתוח והמבחן היה באנגלית.\n\nהשורה התחתונה:", "timestamp": 1659538834433}, {"author": "פחות כיף לי", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  גליץ'\nחוות דעת - הרצאות: \nההרצאות מבלבלות יותר משעוזרות. הלכתי חצי סמסטר אליהן ולא למדתי כלום. דפי התירגול מעולים ומלמדים את כל החומר שצריך במקום ההרצאות. פבל מלחיץ מעצם היותו קיים ומעצם כתיבת כותרות נושא באורך של לוח כיתה שלם.\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nאלעד מתרגל נהדר! הוא הכי נחמד שיש! הוא עונה תמיד על שאלות אחרי התרגול ומעביר את התרגול בצורה נהדרת. גם נעים מאוד להקשיב לו. יש לו קול נעים ולא מלחיץ כמו של פבל. הוא יודע את החומר וגם דפי התרגול פשוט מושים.\nשעורי הבית: \nשיעורי הבית לא ממש תורמים להצלחה בבחינה ולא תמצאו שם שאלות כמו במבחנים. אבל הם חובה. \nהמבחן: \nממוחזר כמעט כולו אבל מנסה להכשיל ולא עקבי עם מה שלמדנו בתרגולים ובהרצאות. היו בו גם טעויות בשאלות שלא החזירו עליהן נקודות!\nהשורה התחתונה: \nקורס פחות כיפי ממה שהוא צריך להיות.", "timestamp": 1691593354496}, {"author": "אחד שהתחבר יחסית לתורת האלסטיות", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: משעממות תחת \n\nשם המתרגל/ת: גרגורי\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון הסלוגן נניח נזניח ונצליח זה ההגדרה של האיש\n\nשעורי הבית: יש רפרנסים\n\nהמבחן: סבבה חומר פתוח, לרשום הערות על נושאים שהוא דיבר כיתה \n\nהשורה התחתונה: קורס חובה אז מה אתם קוראים את החוות דעת בכלל", "timestamp": 1691598919998}, {"author": "גוש פלסטלינה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הרוסי הזה\nחוות דעת - הרצאות: \nמועברות באנגלית, אחרי השביתה באמצע הסמסטר הפסקתי לבוא כי הבנתי שהן מיותרות. תלמדו מהטעויות שלי ואל תגיעו מההתחלה\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nהתרגולים כתובים טוב ומסכמים בדיוק מה צריך לדעת בקורס. אלעד היה סבבה אבל לא הייתי טורח לבוא לתרגולים, פשוט תקראו את התרגול זה לוקח 10 דקות \n\nשעורי הבית: \nמרופרנסים. קלים. \n\nהמבחן: \nבניגוד לשנים קודמות היו שאלות פתוחות ולא אמריקאיות. עדיין לא היה יותר מדי קשה - השאלות אותן שאלות. הייתה קצת התחכמות בשאלות נכון/לא נכון אבל סביר סך הכל. אה והייתה טעות תרגום באחת השאלות אז אם אתם יודעים רוסית אולי כדאי לבקש מהמרצה את הגרסה המקורית \n\nהשורה התחתונה: \nבדרך כלל מלגים זה רק 2 נקז", "timestamp": 1704491552362}]}