{"posts": [{"author": "אשפת חלל", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוד משנה\nחוות דעת - הרצאות: \nההרצאות היו די משעממות וכללו בעיקר פיתוחים מתמטיים. כשנשאלו שאלות הוא כן ענה עליהן והסביר אותן טוב ובסבלנות.\nשם המתרגל/ת: עידן צ'אושו\nחוות דעת - תרגולים: \nתרגולים ממש ברורים ומסודרים, עידן הסביר טוב והיה זמין לשאלות לאורך כל הסמסטר. לפעמים הוא מדבר קצת מהר אבל הוא ממש שיפר את זה במהלך הסמסטר כשביקשנו.\nשעורי הבית: \nתרגילי בית שבועיים, לא קשים במיוחד אבל גם לא תמיד קצרים. לרוב דורשים מטלב.\nהמבחן: \nמורכב משלוש שאלות - שתי שאלות של 35 נק\"ז ואחת של 30. לרוב יש שאלה אחת יחסית קלה. המבחן על החומר שנלמד והוגן בד\"כ.\nהשורה התחתונה: \nקורס קצת עמוס אבל ציונים טובים, בטח אם משקיעים. למי שמעניין אותו חלל ורוצה לעסוק בנושא - אין מה להתלבט בכלל, קורס חשוב ומעניין.", "timestamp": 1626784381280}, {"author": "~אחת שיודעת?", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ולדימיר מרטינושי\nחוות דעת - הרצאות: \nלא נכחתי משבוע 3, פחות מצאתי תועלת כשיש את כל ההרצאות של דוד משנה.\n\nשם המתרגל/ת: אור נחום\nחוות דעת - תרגולים: \nאם הוא מעביר את הקורס, פשוט תיקחו. המתרגל הכי טוב שהיה לי בכל התואר.\nשעורי הבית: \nמורידים את החומר לידיים, שבועיים, עוזרים ונחמדים\n\nהמבחן: \nלא פשוט\nהשורה התחתונה: \nההיסטוגרמה משקרת?", "timestamp": 1657739904478}, {"author": "J2", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ולדימיר מרטישיוני\nחוות דעת - הרצאות: \nמרצה ממש נחמד אך טיפה מבולגן ומלמד באנגלית. הרצאות טיפה מיותרות כי כל החומר מוסבר היטב בתרגולים.\n\nשם המתרגל/ת: אור נחום\nחוות דעת - תרגולים: \nאור מתרגל נהדר. מסביר טוב, סבלני, משקיען. התרגולים די מספיקים אך גם בהם החומר לא מסובך ולא בלתי אפשרי ללמוד מה PDF הנורא מסודרים של אור ומהקלטות אם יהיו.\n\nשעורי הבית: \nלא פשוטים, לא קצרים ועלולים להעמיס טיפה אך מכינים היטב לבחינה ומבהירים היטב את החומר.\n\nהמבחן: \nאם עושים את השיעורי בית לא קשה במיוחד. חומר פתוח. מידי פעם המרצה שם שאלות לא ברורות וזה עלה לי בכמה נקודות אבל סך הכל מבחן לא קשה ויחסית הוגן\n\nהשורה התחתונה: \nקורס חביב", "timestamp": 1657974921683}, {"author": "---", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ולד מרטינושי\nמרצה נחמד מאוד ומאוד מעורב ע הכיתה\nחוות דעת - הרצאות: קצת משעממות ולא תמיד רלוונטיות למבחן\n\nשם המתרגל/ת: אור נחום\nהמתרגל הכי טוב שהיה לי, משקיע ועוזר ויודע את החומר טוב. \nחוות דעת - תרגולים: מענייניים וקצרים ומעוברים היטב\n\nשעורי הבית: יש הרבה שיעורים אבל לרובם לא לקוח הרבה זמן ובדרך כלל יש רפרנס שיכול למקד\n\nהמבחן: יש מלא חומר ללמוד ממבחני עבר עם פתרונות מושקעים \nיש מבחנים קלים וטובים ויש כאלה עם קושי \n\nהשורה התחתונה: לקחת את הקורס לכל אוהבי החלל", "timestamp": 1690191913599}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ולאדימיר\nחוות דעת - הרצאות: לא ממש ברור מה הוא מנסה להשיג בהרצאות, לפעמים מעניין ולרוב מיותר\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: ממש טובים\n\nשעורי הבית: \n\nהמבחן: הוגן, צריך להבין טוב את הטכניקות והחומר הלא מאוד תאורטי של הקורס\n\nהשורה התחתונה: מבט כללי על מכניקה בחלל", "timestamp": 1705321867269}]}