{"posts": [{"author": "yos", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: צבי נדלר, אוקסנה סטלנובה\nחוות דעת - הרצאות: שניהם מרצים מושלמים במלוא מובן המילה. למרות שלפעמים ההסבר של החומר לא מובן הם תמיד יענו על שאלות במייל ובוואטסאפ (הם פתחו קבוצה לקורס איתם). שניהם אוהבים מאוד את מה שהם מלמדים והדבר עוזר להקשיב.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: היו שלושה גיליונות בעלי ארבע שאלות שבהם צריך היה להוציא מידע ממאמרים במודל. את הקורס עושים בקבוצות של ארבעה ולכן הדבר לא מעמיס וממש פשוט כאשר מחלקים את העבודה.\nהיו גם שני דוחו\"ת גדולים על ניסויים שביצענו. הדוחו\"ת יותר קשוחים מהשיעורי הבית אבל גם הם לא נוראיים בשום צורה. הדו\"J בניסוי של צבי  הוא פשוט יותר ומובן יותר. הדו\"ח שאוקסנה מבקשת קשוח יותר אבל לומדים ממנו הרבה, בנוסף אוקסנה גם תמיד עונה על שאלות בוואטסאפ או אומרת להתקשר אליה גם בשעות הערב. (אצלי היא אפילו עשתה שעת קבלה בשמונה בערב אצלה במשרד כדי להסביר כמה דברים).\n\nהמבחן: אין\n\nהשורה התחתונה: חד משמעית לקחת", "timestamp": 1664294669958}, {"author": "איש זרימה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: צבי נדלר\nחוות דעת - הרצאות: הרצאות מובנות מאוד. חלק לא מבוטל מהקורס הוקדש לסיורים במעבדות, והיתר הוקדש לניתוח מעמיק של תוצאות הניסויים שבוצעו שם. \nבהחלט מורגש כי צבי נהנה מהחומר, והוא מעביר את החומר בצורה סופר מקצועית וברורה.\nהוא דאג לפרסם הקלטות משנים עברו ואף הציע לנו להיפגש עמו בזום בכדי לענות על שאלות/להשלים הרצאות בהן היינו חסרים. מרצה תותח ובנאדם זהב במלוא מובן המילה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: ארבעה גיליונות פשוטים וקצרים שעושים אותם בקבוצות של שלושה. אין שם שום דבר חדש, מי שהבין את ההרצאות יצליח לעשות אותם ללא כל בעיה. הבדיקה הוגנת מאוד ובונה, צבי דואג להשאיר מספר רב של הערות בכדי שנלמד מהטעויות שלנו. הציונים בד\"כ גבוהים-גבוהים מאוד. \n\nהמבחן: אין\n\nהשורה התחתונה: קורס נהדר ומרצה עוד יותר נהדר. הציונים גבוהים מאוד אם יודעים מה לעשות, ובכללי הקורס כלל לא עמוס.", "timestamp": 1677491059027}, {"author": "---", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ציבקה נדלר\nחוות דעת - הרצאות: קליל ומעניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש 4 מטלות שלכולם הוא נותן ציון טוב\n\nהמבחן: אין\n\nהשורה התחתונה: מעבדה הכי טובה שיש", "timestamp": 1679236307226}, {"author": "The Dude", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: צבי כפרעליו\nחוות דעת - הרצאות: \nמושלם, מפוצץ מערבולות בלב.\n\nשם המתרגל/ת: אוקסנה סטלנוב.\nחוות דעת - תרגולים: \nסטלנוב. כן. כן.\nשעורי הבית: \nסבירים מאוד.\n\nהשורה התחתונה: \nמומלץ ומלמד.", "timestamp": 1689595243340}, {"author": "eric", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: צבי\nחוות דעת - הרצאות: \nההרצאות של צבי באמת מלמדות דברים פרקטיים לגבי אוירודינמיקה. מאוד ממליץ להקשיב לו - יש לו המון תשוקה ואהבה לתחום גם אחרי שהוא מלמד מלא שנים. סופר נחמד ונגיש גם מחוץ להרצאות, עונה למיילים וניתן תמיד לשאול אותו דברים והוא יענה בשמחה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: 4 מטלות יחסית סבבה בקבוצות, באמת לא הרבה עבודה. לי אישית לקח סביבות ה-יום עבודה פר חלק שלי במטלה, סהכ סביבות ה4 ימים שמוקדשים לקורס הזה בכל הסמסטר.\n\nהמבחן: אין, יש רק את המטלות\n\nהשורה התחתונה: קורס סופר מומלץ מכל הבחינות - מלמד חומר מעניין וחשוב, פרקטי וכולל ניסויים במנהרות רוח וניתוח תוצאות, מרצה סופר נחמד, לא עמוס בכלל, ממוצע גבוה. מה עוד אפשר לבקש?", "timestamp": 1717753862264}]}