{"posts": [{"author": "~אחת שיודעת?", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פבל גליץ'\nחוות דעת - הרצאות: \nדי מונוטונויות, אבל פבל שמח להסביר אם שואלים.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nהיינו הפעם הראשונה שהקורס הועבר, אז היה קצת קשוח ומעניין לפתור את השב. שאב יחסית זמן בסמסטר\nהמבחן: \nשיטת ההערכה הייתה פרוייקט, מומלץ להיות בקבוצות קטנות של תואר ראשון עם מאסטר, יכול להקל.\nהשורה התחתונה:", "timestamp": 1644428264897}, {"author": "קורט רין", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פאבל גליץ'\nחוות דעת - הרצאות: \nההרצאות היו מבוססות על הספר 'מכניקה של חומרים רכים' של וולך, בתוספת פרק על חומרים פונקציונליים(אלקטרו ומגנטו אלסטיים) בסוף הקורס. בהתאם לכך, ההרצאות היו עמוסות מאוד בתוכן, כאשר בשבועות הראשונים הועבר חומר מתמטי טהור(אלגברת טנסורים), ואחר מכן בפיתוחים מתמטיים עבור חומרים שונים.\n\nשעורי הבית: \nשיעורי הבית היו לא פשוטים מאחר והיה צורך להוכיח קשרים מההרצאה, דבר שהיה לא אינטואיטיבי ממבט ראשון. מצד שני, הם לא היו ארוכים, ולא הכבידו בצורה משמעותית על הלמידה בסמסטר.\n\nהמבחן: יש פרויקט במקום מבחן. פאבל נותן יד חופשית בכל מה שקשור לבחירת הנושא, ומגלה רצינות ואחריות בקשר עם הסטודנטים במטרה לתת להם הזדמנות לבצע את המטלה על הצד הטוב ביותר. \n\nהשורה התחתונה: \nקורס מאוד מתמטי, הרצאות לא פשוטות ופרויקט שלוקח זמן רב. מומלץ לכל מי שנהנה להבין מהי המתמטיקה שמאחורי הקלעים. פאבל מרצה חדש, אבל הוא מלא ברצון להעביר את הקורס בצורה טובה ככל שתתאפשר.", "timestamp": 1645723643553}, {"author": "מה למלא פה?", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: פבל\nחוות דעת - הרצאות: \nתקראו את הספר בלבד\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nגרוגורי בדק שב\nשעורי הבית: \nלא פשוטים אבל בסדר\nהמבחן: \nהיה פרוייקט שפתחו אותנו ובנוסף שיטת ניקוד מבזה\nהשורה התחתונה: \nלא שווה את ההשקעה, לברוח מפבל!", "timestamp": 1651578097436}, {"author": ":)", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאין צורך באמת להיות בהרצאות על מנת להבין את החומר יש ספר שהוא עוקב אחריו מילה במילה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nאפשר למצוא פתרונות באינטרנט להכל וגם אם לא די קלים\nהמבחן: \nאין מבחן יש פרויקט שבו פאבל מחלק ציונים בצורה די אקראית ואל עניינית\nהשורה התחתונה:", "timestamp": 1667122026912}]}