{"posts": [{"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: המרצה מנסה להכניס לראש של מהנדס, שיקולים שצריך לקחת, בהתחלה קצת קשה להבין את הקשר לניטור עצמו, הוא מנסה להיות מסודר אבל בסופו של דבר דברים קצת מתבלגנים. הוא מתחשב מבחינת הגשות. אם מחברים לדרך ההוראה שלו נהנים מאוד ולומדים הרבה מהקורס. אם לא, כנראה שלא תצליחו לסבול את ההרצאות. \n\nשעורי הבית: 4 גליונות, שונים מש\"ב אחרים שרואים באוניברסיטה. הוא שואל שאלות של דעה אישית ואיך אנחנו הבנו את הנושא, מבקש לנתח תופעות ולהסביר מושגים. הם לא קשים יותר מידי, קצת לא מובנים אבל בסופו של דבר ציונים טובים. \nיש פרויקט אמצע: בוחרים חיישן מתארים אותו, עושים בעד ונגד. בסוף, עושים כיתה הפוכה וכל זוג מציג את החיישן שלו. לא דורש יותר מידי עבודה. \n\nהמבחן: יש פרויקט, בוחרים כשל כלשהו מתארים אותו ומתכננים מערכת לניטור המבנה כדי למנוע את הכשל.\n\nהשורה התחתונה: המרצה עם גישה מיוחדת שמנסה להכניס לעולם ההנדסה, אם מתחברים לדרך שלו נהנים מאוד מהקורס אבל אם לא, הוא יכול להיות מעצבן. הקורס עצמו לא קשה מאוד, לא עמוס מידי וציונים די טובים.", "timestamp": 1626895885702}, {"author": "מרינה", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ברוך קרפ\nחוות דעת - הרצאות: הרצאות חובה, 3 שעות בשבוע - ממש קשה לשרוד\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית מעניינים אבל לא תמיד ברור מה המרצה רוצה\n\nהמבחן: אין\n\nהשורה התחתונה: \nקורס לא רע, הבעייה זה המרצה, הוא מרצה אורח, הוא לא מכיר את החוקים של הטכניון, או שפשוט מתעלם מהם. נותן תרגילי בית עמוסים שנופלים על תקופות מבחנים, לוקח לו ים זמן לאשר נושא לעבודת סוף.\nבמהלך ההרצאות מנסה להעביר איזשהי פילוסופיה שאם אתה לא מתחבר יהיה מאוד קשה בקורס.\nשורה תחתונה - לא מומלץ", "timestamp": 1627230780517}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  ד\"ר ברוך קרפ\nחוות דעת - הרצאות: חובת נוכחות, מבולגנות ולא קוהרנטיות. מנסה לשלב פילוסופיה אישית בנושאים מורכבים כגון תנודות, אותם הוא מלמד בצורה שטחית מאוד. מצפה לדיון, אך בניגוד לדיונים רגילים, מומלץ לקלוע למה שהמרצה מצפה לשמוע. סה\"כ ההרצאות משעממות, מייגעות, והכי חשוב - לא מלמדות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nארוכים. לא קשורים להרצאות, ולא מלמדים כלום חוץ מלחפש בגוגל ולכתוב הרבה, תוך נסיון לקלוע לכוונת המרצה. דורשים הרבה חיפושים שגוזלים הרבה זמן. הרבה התפלספות מילולית לשאלות שאינן מוגדרות היטב, וכמובן שצריך לקלוע למה שהמרצה מתכוון. הבדיקה מזלזלת, מתן הציונים שרירותי וללא משוב מספק. סתירות בדרישות - לדוגמה: תמציתיות, לא לעבור ארבע שורות לתשובה, ואח\"כ בבדיקה כתוב שלא פירטתי מספיק. למשובים לוקח הרבה זמן לחזור, או שלא חוזרים בכלל. אני לא קיבלתי משוב לאחד מתרגילי בית (מתוך ארבעה ארוכים)  ולעבודת אמצע (בעלת משקל גדול בציון הסופי), ופעם ראשונה שראיתי את הציון היה בעת מתן הציון הסופי, למרות תזכורות בע\"פ ובמייל למרצה.  לאחר מכן, כשביקשתי לראות משוב ובדיקה לתרגילים אלה המרצה סירב, והתעלם מהבקשה לקבל הסברים והאשים אותי (למרות הוכחות כתובות בצורת מייל שהוא התעלם ממנו) שלא תזכרתי אותו. \n\nהמבחן: עבודת גמר. המרצה אישר את נושא העבודה שבחרתי, כביכול לאחר שבדק אותו בעצמו וראה כי הוא מתאים, אך לאחר מכן בבדיקה הוא כתב כי הנושא לא מתאים, ופסל את העבודה, עם 3 הערות לא ענייניות סה\"כ (לעבודה של עשרים ומשהו עמודים). הבדיקה היתה מזלזלת, ולא ניתן היה להבין מה לא טוב. לאחר שביקשתי מספר פעמים להיפגש כדי להבין מה היה, והוא התעלם, הגשתי ערעור מפורט, והתגובה שלו שוב היתה לא עניינית לא התייחס לנקודות קונקרטיות (עם הוכחות כתובות, שלא היו לו נוחות), למה שכן התייחס, עשה בצורה מעורפלת, לא עניינית, ומזלזלת.\n\nהשורה התחתונה: לא מומלץ בכלל. לא מלמד, לא מעניין, עם השקעת זמן ואנרגיה לא פרופורציונאליות. המרצה לא הגון, וההתנהלות בקורס ממש לא בסדר (משובים מאוחרים, חסרים, מזלזלים, סתירות בדרישות, אישור לנושאים ואז פסילתם תוך הסרת אחריות). \nלמי מכם ששמע שזה \"מל\"ג פקולטי\", זה ממש לא, ולא כדאי להתפתות לממוצע הגבוה.", "timestamp": 1637690467901}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ברוך קרפ\nחוות דעת - הרצאות: מאוד משעממות, ברוך מכריח לבוא להרצאות וגם בהרצאות עצמן דורש הקשבה פעילה. לא מאשר פלאפון או מחשב בזמן ההרצאה ומתקטנן על כל דבר.\nלברוך יש תסביך אלוהות, והוא לא מוכן לשמוע דעה שונה משלו, ומי שמתווכח איתו ו/או מנהל דיון שלא לרוחו, זה מתנקם בו אח\"כ בציונים.\n\n\nשעורי הבית: ארוכים ולא מובנים. ברוך דורש שנענה בדיוק כמו שהסביר בכיתה, והשאלות מאוד לא ברורות. \nהוא כותב הערות על ההגשות אבל לא כותב על מה הוריד.\n\nהמבחן: עבודת גמר שבה חוקרים מקרה כשל בתעופה. יכול להיות נחמד לראות פרק מתעופה בחקירה.\nיש גם עבודת אמצע על ניתוח חיישן מסוים.\n\nהשורה התחתונה: מאוד לא מומלץ. יכול להיות ציון גבוה אבל לא שווה את זה.", "timestamp": 1657608050838}, {"author": "המנטר", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ד\"ר ברוך קרפ\n\nחוות דעת - הרצאות: \nההרצאות מנוהלות בצורה מאוד פתוחה, המרצה מלמד נושא מסוים ומעודד את הסטודנטים בכיתה לנהל עליו דיון. הקורס טיפה שונה מקורסים ולא תראו הרבה משוואות על הלוח.\n\nשיעורי הבית: \n4 עבודות בית (20% מהציון הסופי) ועבודת אמצע בהיקף של 8-10 על חיישן כלשהו שחוקרים (30% מהציון הסופי) ואחר כך מציגים בכיתה.\n\nהמבחן: \nעבודת גמר (50% מהציון הסופי) על חקר כשל בתעופה שמנתחים בראיה של ניטור בריאות מבנים. המרצה צריך לאשר את הנושא אבל אפשר לבחור נושאים מאוד מעניינים.\n\nהשורה התחתונה: \nאחד הקורסים שהכי נהניתי בהם בתואר, המרצה אוהב לנהל דיון בשיעורים והיה לי מאוד מעניין.\nההגשות לא תמיד הכי ברורות אבל המרצה שמח לעזור לסטודנטים עם כל שאלה שהייתה.", "timestamp": 1672828694085}]}