{"posts": [{"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "201901", "text": "שם המרצה: ערן שר\nחוות דעת - הרצאות: \nמרצה מדהים! המרצה הכי מעניין והכי אכפתי בפקולטה(בוודאות) וסביר שבין הטובים בכלל בטכניון. שווה לקחת כל קורס שהוא מעביר(כל עוד הוא מעביר קורסים)\nהחומר לא מעניין יותר מידי, אך עדיין ההרצאות מרתקות בזכות המרצה.\n\nשעורי הבית: \nשיעורי בית לא עמוסים מידי - על החומר שהועבר בהרצאה הסמוכה. לא דורש יותר מידי מאמץ .\nתרגילי הבית אינם נבדקים ואינם מזכים בציון אך אי הגשתם גוררת הורדת ציון.\n\nהמבחן: \nמבחן עם חומר פתוח (ללא תרגילים פתורים). ב-5 שנים האחרונות ניתן למצוא כ-6 שאלות שונות ממבחנים אשר חוזרות על עצמן ועוד כ-20-40 על חומר תיאורטי שגם דיי חוזר על עצמו כך שניתן להצליח רק מפתרון תרגילים ממבחנים קודמים.\n\nהשורה התחתונה: \nמרצה מדהים ששווה לקחת כל קורס שהוא מעביר. קורס קליל ומבחן לא קשה. ציונים מאוד גבוהים", "timestamp": 1603099436892}, {"author": "Amit Elharar", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ערן שר\nחוות דעת - הרצאות: מעניינות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: תקפים, לא נכללים בציון, כל תרגיל בית שלא עושים יורדות שתי נקודות מהציון הסופי. רמה סבירה, בדיוק מה שרואים בהרצאות.\n\nהמבחן: מבחן נחמד, כמעט תמיד ממוחזר.\n\nהשורה התחתונה: אחלה של קורס, קליל ומומלץ.", "timestamp": 1612691878394}, {"author": "טלומיר", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ערן שר\nחוות דעת - הרצאות: \nערן מעביר את ההרצאות בצורה מאוד מרתקת וסוחפת. עיקר הלמידה בקורס זה לטעמי מתרחש בכיתה ובדיונים. ערן מאוד מכבד כל סטודנט וכיף ללמוד אצלו. הקורס לא דורש כמעט מאמץ.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nפשוטים יחסית. אם מרגישים שלא הועבר החומר, לפנות לערן ואולי יסביר לכולם איך לפתור.\nהמבחן: \nמבחנים די זהים אחד לשני.\nהשורה התחתונה: קורס כיף ממש, עם אחד המרצים הכי תותחים בטכניון.", "timestamp": 1647975070047}, {"author": "טורבוצארגר משוגע", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ערן שר האגדי\nחוות דעת - הרצאות: \nתחילה אבקש לומר שאם הקורס מועבר תקחו אותו בהול כי אנחנו לא יודעים לעוד כמה זמן הוא יועבר. ברמה שממש שנה הבאה יכול להיות שלא יהיה מי שיעביר את הקורס.\nשר הוא אגדה מהלכת. בן אדם מבריק עם לב טוב שמעביר את ההרצאות מתוך שליחות לדור הבא של המהנדסים כדי שיהיו טובים ולא יהרסו את כל מה שהוא בנה במדינה ובתעשייה.\nפורמלית ההרצאות הן 3 שעות, בפועל בכיתה זה שעתיים, מעשית בבית לבד זה פחות מחצי שעה.\nשווה לכתוב על המצגות את הדברים שהוא אומר כי זה טוב אחר כך למבחן.\n\nשם המתרגל/ת: פורמלית יש. מציאותית אין\n\nשיעורי הבית:\n9 גיליונות ברמת המבחן שלא בודקים אותם באמת כי למתרגלים יש חיים יפים יותר משלנו.\n\nהמבחן: \nמבחן רגיל שלו שאמור להיות ממש קל והוא כן. הנקודות שלכם יפלו בנכון לא נכון אז תעשו לעצמכם טובה ותכינו הכל מראש כי הרוב ממוחזר. זה קצת תרמו לי אני אגיד לכם את האמת.\n\nהשורה התחתונה:\nבקורס הזה טמפ סטנדרטית בגובה פני הים זה 298K.", "timestamp": 1715239506683}]}