{"posts": [{"author": "G", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ולאד מרטינוסקי\nחוות דעת - הרצאות: מאוד מאוד לא מסודרות.. ולאד דוגל בלפתח *עם* הסטודנטים, ולא משתמש בדפי הרצאה. כך יוצא שיש שעות שלמות שמתבזבות על לנסות למצוא את הטעות בפיתוח שנעשה לפני שעה, ואתה בתור סטודנט מאבד את כל הסדר וההבנה שיש לך בחומר.. הוא מאוד מחפש השתתפות סטודנטים, אבל לרוב אין לכיתה מושג על מה הוא מדבר ונשארים בשתיקות מביכות.. מאוד לא נוח וקשה לעקוב אחרי החומר\n\nשם המתרגל/ת:  אין\nחוות דעת - תרגולים:  אין\n\nשעורי הבית: מטלות הקורס משתנות כל הזמן.. בתחילת הסמסטר פורסם שיהיו 3 שב+פרויקט+מבחן.. בסוף היה גליון שב אחד, ומבחן הסוף הומר בפרויקט [לאור הגל החמישי של הקורונה]\nברגע שמבינים מה המרצה רוצה, שיעורי הבית לא קשים בכלל ודורשים עבודה אלגברית פשוטה ועבודת מטלב פשוטה עוד יותר\n\nהמבחן: הפרויקט כמו השב\n\nהשורה התחתונה: קורס מעניין, שיכול לעבור בצורה יותר מסודרת ואז גם הרבה יותר טובה.. מומלץ לחפש סיכום משנים קודמות ולעקוב אחריו במקביל להרצאות", "timestamp": 1645170540551}, {"author": "דניאל כהן", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ולד מרטינושי\nחוות דעת כללית:\nההרצאות היו קצת מבולגנות ולפעמים היה קשה להבין לאן המרצה חותר. היה שימוש נרחב במייפל כדי לחסוך חישובים על ההלוח. עד למתן שיעורי הבית (הייתה רק הגשה אחת) לא היה מובן מדוע לומדים את מה שלומדים אבל לאחריהן היה הרבה יותר מובן.\nלקראת המבחן המרצה פירסם אוסף שאלות הכנה, הרמה בהן הייתה תואמת לרמת המבחן.\nהמבחן היה יחסית קל (במיוחד עם שאלות ההכנה) ודרש בעיקר ידע מתמטי ופחות הבנה פיזיקלית. המבחן היה עם חומר פתוח מלא כולל מחשב, אינטרנט ואפילו תוכנת מייפל (המרצה אמר שמי שפותר בעזרת מייפל במבחן שיראה את חישובי העזר).\n\nהשורה התחתונה:\nקורס שעלול להיות לא מובן במהלך הסמסטר אבל בסוף הכל מסתדר ומגלים שאפילו הוא דיי קליל.", "timestamp": 1679224608194}, {"author": "אוילר", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ולדימיר מרטינושי \nחוות דעת - הרצאות: מבולגנות, לא ברורות. ולאד יושב מול המחשב בכיתה מנסה לפתח במייפל או כותב פיתוחים, בפועל הוא מפתח הכל בעצמו על הדרך, התוצאה: הרבה מאוד זמן שמתבזבז על טעויות או הסברים חסרי פואנטה. חיסינו בסוף אולי חצי מהחומר בסילבוס, בעוד שאנשים לא טרחו לבוא.\n\nשעורי הבית: סבירים, אם כי בדיקה לא לעניין. מכירים את זה שרוב הסטודנטים לא טועים ולכן כדי להוריד נקודות צריך להמציא כל מני קריטריונים מופרחים כמו נראות גרפים וציון של עובדות איזוטריות בדוח? מעולה, זה כאן.\n\nהמבחן: אין, יש פרויקט. פרויקט בין הבזיוניים שלקחתי, מפוצץ בטעויות ולוקח לסגל בערך שבועיים לתקן אותם. הגענו למצב שאנחנו הסטודנטים עשינו סקר בספרות ומצאנו את המשוואות הנכונות, פשוט בזבוז של זמן. שנה שעברה למשל, הטעויות בכלל לא נמצאו, סטודנטים הגישו פרוייקטים לא נכונים בעליל, אבל בגלל עצלנות של הסגל הם לא נבדקו וכולם קיבלו מאה.\n\nהשורה התחתונה: אז הקורס נע בין : לא לבדוק ולזרוק, לבין לבדוק ולהוריד נקודות על שטויות. מה שכן יחס רציני אין, והוא טעון שיפור משמעותית. בכנות האם למדתי משהו? אולי.", "timestamp": 1716788575845}]}