{"posts": [{"author": "Kn>>1", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: \nכולם כבר מכירים את מנלה מבלד\"ח. מרצה טוב, הרצאות מעניינות מאוד אך מתמטיות מאוד ולא פשוטות לעיכול או הבנה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nיש פרויקט בסוף של לפתור בעיה יחסית פשוטה (שום דבר לא באמת פשוט). דד ליין גמיש.\n\nהמבחן: \nעם חומר פתוח. חלקו הגדול מופיע בסיכומי ההרצאות אך עדיין לא פשוט בכלל.\nלא הרבה סטודנטים לקחו את הקורס והרבה מאלה שכן לקחו הם סטודנטים מצטיינים וסקרנים כך שהממוצע יכול להטעות.\n\nהשורה התחתונה: \nקורס מעניין ופותח את הראש למי שמתעניין בתחומי הזרימה. מעניין לראות איך מגיעים למשוואות הזרימה (או צורה דומה להן) מהסתכלות על חלקיקים.", "timestamp": 1659644160506}, {"author": "איש זרימה", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבשלום מנלה\nחוות דעת - הרצאות: למי שמתעניין בתחום הזרימה במובן התיאורטי יותר, לדעתי יתעניין מאוד בנושא ובפרט בהרצאות. ההרצאות עמוסות ומתמטיות מאוד, כך שהייתי ממליץ להיעזר בכתבי ההרצאות של סטודנטים שלקחו בעבר את הקורס, להגיע איתם לשיעור ולהוסיף עליהם הערות של המרצה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים:  אין\n\nשעורי הבית: אין שיעורי בית וחבל שכך. הקורס עמוס ומתמטי מאוד, וללא תרגילי בית קשה מאוד לא לאבד את המרצה במהלך הסמסטר. לכן, מי שבכל זאת לוקח את הקורס - עצתי החמה היא להיות עם יד על הדופק לאורך הסמסטר, ולחזור על ההרצאות הקודמות לפני השיעור. \n\nהמבחן: המבחן לא קשה במיוחד ועם חומר פתוח. על מרבית השאלות ניתן לענות ישירות מדפי ההרצאות. עם זאת, חשוב מאוד לעבור לפני הבחינה על כתבי ההרצאה, בכדי להבין איפה כל דבר נמצא ולמה הוא מתקשר. \nהמבחן מהווה 50 אחוז מהציון, ה-50 אחוז הנותרים מוקדשים לפרויקט סיום במהלכו אתם פותרים שאלה מסוימת (שאבשלום מביא בד\"כ) באמצעות הכלים שרכשתם בקורס. הפרויקט לא פשוט בכלל, ואין לו דד ליין מוגדר (לפחות בשנה בה לקחתי את הקורס). \n\nהשורה התחתונה: קורס סופר מעניין למי שאוהב את תחום הזרימה. למי שלא - להתרחק. המבחן לא מאוד קשה. הפרויקט קשה אבל אין לו הגבלת זמן 'קשיחה'. **להשתדל להיות עם יד על הדופק במהלך הקורס!**.", "timestamp": 1679764011049}, {"author": "ניקולס האדג'יקונסנטינו נ״י", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אבשלום\nחוות דעת - הרצאות: מעניינות.\nהכי כיף שיש ;) \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: הצחקתם אותי.\n\nשעורי הבית: אין...\n\nהמבחן: תמיד שואל את אותן שאלות:\n1. משהו על אינטראקציה מולקולרית, דינמיקה מתחילת הקורס.\n2. משהו ארוך על אינטגרלים שנוגע למשוואת המודל BGK. \n3. ניסוח בעיה בסיסית בחד מימד -- תנאי שפה, תנאי התחלה, תנאי דעיכה באינסוף. \n\nהשורה התחתונה: קלוששששים!!!!", "timestamp": 1699900841477}]}