{"posts": [{"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מרינה בוגמולוב\nחוות דעת - הרצאות: הרצאות מעולות. בין הקורסים היחידים שאתה מגיע להרצאה ואשכרה מבין הכל. המצגות מאוד ברורות ויש הרבה דוגמאות במהלך ההרצאה. מרינה מסבירה את החומר בצורה מעולה, ותמיד עונה לכל שאלה. תקשיבו טוב לשאלות שלה במהלך ההרצאה כי הבנת השאלה והתשובה חשובה מאוד למבחן.\n\nשם המתרגל/ת: עידו גרינס\nחוות דעת - תרגולים: מתרגל שהוא תותח. סופר מקצועי ורואים שהוא מבין את החומר ברמה מאוד גבוהה. מעטים המתרגלים שהם כל כל חדים ויודעים לענות לכל שאלה מיד, ואפילו לנתח אותה ולתת עוד כיוון חשיבה. כל תרגיל הוא פותר בלי להסתכל בכלל בדף התרגול והוא נותן מלא אינטואיציה לחומר וזה ממש חשוב. יכול לומר ששאלה שהוא הסביר לנו בתרגול, ונתן לנו את דרך הפתרון שלו אליה, הופיעה במבחן. ממליץ בחום לא תתחרטו \n\nשעורי הבית: לא הייתי אומר שהם קשים ממש אבל כן דורשים הרבה מאמץ. גיליון לוקח יום עבודה עליו בערך אז תקדישו לזה יום בשבוע. לא מיותרים בכלל וממש מכינים למבחן, תשקיעו ואל תרפרנסו.  \n\nהמבחן: המבחן היה מאוד הוגן לטעמי. היו שאלות שהיו יותר קשות מבדרך כלל והיו שאלות שכבר ראינו משהו מאוד דומה בתרגול או בתרגיל בית. כדאי שיהיה לכם דף נוסחאות ממש טוב לידכם כי אחד כזה יכול בקלות לסדר לכם 10-15 נקודות קלות.  יש גם הרבה קוד של R אז כדאי שתכניסו קטעי קוד לדף נוסחאות גם כן.\n\nהשורה התחתונה: קורס ממש חשוב ומועבר בצורה מעולה.", "timestamp": 1644505647623}, {"author": "ניק", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרינה מקסימה באמת, תמיד מחייכת, תמיד רוצה לעזור. אותי באופן אישי ההרצאות מעט שעממו ולפעמים היה לי קשה לעקוב.\nמה שכן נותנת המון דוגמאות ומתעכבת על כל חומר כדי שכל הסטודנטים יבינו.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: נדיה מתרגלת פשוט מעולה, מקצועית, יודעת את החומר מושלם ותמיד נותנת הסברים הכי מובנים שיש. חבל שהתרגול הוא רק שעה וזה לא מספיק אז יש הרגשה שהיא רצה על הכל.\n\nשעורי הבית: זוועה פשוט. שיעורי בית שבועיים בזוגות אבל הבעיה הגדולה יותר שכל גליון יותר גרוע מהשני, לפעמים צריך לכתוב גם קוד ב-R. השיעורים לוקחים פשוט המון זמן וזה הרבה יותר מדי. \n\nהמבחן: 20 שאלות אמריקאיות מכל הנושאים שבקורס. כל מבחן מצליחים להביא שאלות עם טריקים שונים אז חשוב לפתור הרבה כדי להגיע מוכנים.\nיש גם בחן אמצע עם 10 שאלות אמריקאיות שהוא אחלה הכנה וחזרה על החומר.\n\nהשורה התחתונה: קורס חשוב, כל הנושאים קשורים אחד לשני אז כדאי להיות על הקורס ולא לאבד את זה.", "timestamp": 1644920320836}, {"author": "סטטיסטי הסדר", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מעניינות מאוד וחשובות מאוד בקורס\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nתרגולים חשובים למבחן ולהבין את הקוד בR\nשעורי הבית: ארוכים מאוד, קשים ומעצבנים אבל חשובים כדי להבין את החומר\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה:", "timestamp": 1646578153554}, {"author": "MarinaLover445", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרצה מדהימה!!!!\n\nשם המתרגל/ת: עידו גרינס\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: בסדר\n\nהמבחן: בסדר\n\nהשורה התחתונה: מדהים", "timestamp": 1646578816418}, {"author": "רווח סמך", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרצה מעולה! מסבירה טוב את החומר וחוזרת שוב כשלא מבינים.\n\nשם המתרגל/ת: עדו גרינס\nחוות דעת - תרגולים: ראיתי את ההקלטות והיה ממש טוב, מסביר לאט וברור, חוזר כשלא מבינים ובתרגול המוקלט מספיק את כל השאלות שבדף של התרגול.\n\nשעורי הבית: יש כל שבוע בערך גליון לא קשה מידי, זאת חזרה מעולה בעיני על החומר אז תנסו לא לרפרנס (יש לרוב השאלות רפרנס בכל מקרה)\n\nהמבחן: המועד א' היה סבבה (ממוצע 80+ אם אני לא טועה), מועד ב' היה קשה (והממוצע בהתאם...)\n\nהשורה התחתונה: אחלה קורס, הצוות מאורגן מאוד, תשתדלו להצליח במועד א'.", "timestamp": 1646773484916}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מאד איטיים ומשמעממים. מומלץ ללראות הקלטות. אבל היא ממש חמודה, פשוט מתעכבת על דברים לא חשובים.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: אחלה \n\nשעורי הבית: ארוכים מאד מאד מאד מאד. לוקחים כל כך הרבה זמן - לא פרופורציונלי למשקלם בציון הסופי. מה שכן, שווה לעשות אותם, הרבה שאלות/ראיונות במבחן אומצו מהתרגילי בית.\n\nהמבחן: היתה העלת רמה ב4 סמסטרים האחרונים, ולכן הבמבחן לא פשוט ודורש הבנה של הנושאים מעבר לחישובים וטכניקות. בכל זאת, עם שבוע שלם של הכנה אפשר להגיע לרמת מוכנות מאד גבוהה ולהוציא ציון באמת טוב.\n\nהשורה התחתונה: אחלה קורס סה\"כ ומאד חשוב", "timestamp": 1648466926458}, {"author": "Idan Peretz", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי בית ברמה לא פרופורציונלית לנקודות הזכות שהקורס מקנה. 10 שעות בשבוע על שיעורי בית. כל שבוע. חובה להגיש 9/11.\n\nהמבחן: \nקשה אך הוגן.\n\nהשורה התחתונה:", "timestamp": 1676276090175}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נדיה מוקלט\nחוות דעת - הרצאות: מומלץ ממש. ההקלטות ממש טובות והחומר זהה. סטטיסטיקה זה מסוג ההקלטות שבכיף אפשר להריץ על כפול 2 אז זה ממש טוב\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: גם כמתרגלת היא תותחית\n\nשעורי הבית: גיליון שבועי בזוגות מעיק ברמות אבל ממש עוזר להבין את החומר\n\nהמבחן: היה מועד א סבבה, קצת קשה יותר מבדר\"כ ויש עליית רמה בשנתיים האחרונות. היה ממוצע 70 בערך\n\nהשורה התחתונה: קורס עמוס ומעניין לפרקים. חשוב לקורסי המשך בלמידת מכונה ולקורסי חובה אחרים", "timestamp": 1676404712722}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרינה  \nחוות דעת - הרצאות: אחלה מרצה וממש נחמדה. היא כל הזמן מחייכת וצוחקת ויש אווירה ממש טובה בכיתה שלה. קצת איטית ומתעכבת על שאלות אבל מעבירה את החומר מעולה.\n\nשם המתרגל/ת: נדיה \nחוות דעת - תרגולים: מתרגלת מעולה. התרגולים מועברים ברמה גבוהה ובאווירה מעולה בכיתה, גם מומלץ ביותר.\n\nשעורי הבית: 11-12 גיליונות שבועיים לאורך הסמסטר. לא קשים יותר מדי אבל סופר ארוכים, ולרוב בכל גיליון יש גם חלק רטוב של R שהוא לא קצר בכלל. לוקחים המון זמן, מומלץ לא לדחות אותם. מה שכן הם ממש עוזרים להפנים את החומר, מומלץ לדעתי לפתור לבד את היבש אפילו שזה בזוגות.\n\nהמבחן: 20 שאלות אמריקאיות ב3 שעות. יש עליית רמה בשנים האחרונות אבל רוב המבחן יחסית בסדר. צריך הרבה תרגול והפנמה של החומר כי המבחן ממש לא מסתכם בטכניקה. אומרים שמועדי ב' בקורס הזה קשים יותר ממועדי א' אבל מהתחושה האישית שלי דווקא המועד א' שלנו היה ממש קשה והמועד ב' הרבה יותר סבבה. \n\nהשורה התחתונה: קורס מאוד מעניין וחשוב לדעתי להמשך. ידע רלוונטי מאוד גם לתואר וגם לחיים כנראה, ובהחלט לומדים בקורס הזה המון. אחד הקורסים שהפקתי מהם הכי הרבה עד עכשיו בתואר, והסגל ברמה ממש גבוהה, אז באמת היה מעולה.", "timestamp": 1678363755375}, {"author": ";", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה + מתרגל: נדיה ועידו\nאוהבת ומחוברת לחומר, נותנת טיפים מדי פעם לדברים שיכולים להופיע במבחן ועונה על שאלות, מציירת מלא על הלוח ובסוף גם ציירתי לעצמי במבחן בכמה שאלות וגיליתי שזה עוזר. 3 שעות ברצף יכולות להיות קצת מתישות והרבה עברו למוקלט במהלך הסמסטר\nהתרגולים חשובים מאוד ונותנים בסיס חשוב לגיליונות\nעידו סבבה, היינו כיתה קטנה אז היה דיי משוחרר, לרוב סיימנו על הדקה והסוף היה לחוץ, אבל הם מעלים תשובות לשאלות מהתרגולים\n\nשעורי הבית: שבועי, בזוגות, הרבה מאוד פרקטיקה, חשוב ממש כדי להבין את החומר, רעיונות דומים שהופיע בגיליונות חזרו במבחן ובבוחן אמצע\nהכניסו את החלק של R גם למבחן בסמסטרים האחרונים מאז ששינו את הקורס וצריך להבין מה קורה שם, אז מומלץ באמת לסמלץ כדי להבין מה רוצים ממך\nיש רפרנסים לרוב השאלות\n\nהמבחן: 20 שאלות אמריקאיות, חלקן פרקטיות וחלקן יותר לפן ההבנתי, יש הרבה מבחנים לתרגל, השאלות מבלבלות ותמיד שתגיעו לתשובה לא נכונה היא תופיע באחד הסעיפים אז צריך לשים לב לכל דבר קטן, השאירו ממוצע דיי נמוך אבל לפי מה שהבנו באמת התכוונו להעלות את רמת הקושי של הקורס\n\nאסיים עם ציטוט של עידו במבחן: \"אני לא יכול להגיד לך איך עושים אינטגרל\"", "timestamp": 1678467196590}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מרינה \nחוות דעת - הרצאות: \nמרינה מרצה מעולה, מבינה את החומר ומסיברה אותו מאוד טוב. לפעמים מתעקבת יותר מדי על נושאים מסוימים, או מסבירה משהו טריוויאלי במשל הרבה מאוד זמן.\n\nשם המתרגל/ת: עידו \nחוות דעת - תרגולים: \nמתרגל מעולה, מבין טוב מאוד את החומר, ופותר את כל השאלות מאפס. ממליץ למי שיכול\nשעורי הבית: \nמאוד ארוכים, מזל שעושים בזוגות. כדאי לשבת עליהם מהר אחרת הם נהיים מעמסה לא כיפית.\nהמבחן: \nאמריקאי, בדרך כלל שאלות שחוזרות על עצמן. לנו נתנו מבחן יחסית קשה.\nהשורה התחתונה: קורס חשוב למי שרוצה ללמוד סטטיסטיקה.כדאי לא להאבד באמצע הסמסטר.", "timestamp": 1679227281990}, {"author": "אנונימוס", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נדיה\nחוות דעת - הרצאות: \nמרצה חמודה ממש, חייכנית ומסבירה ממש טוב\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים:\nפותר על הלוח למרות שיש את כל הפתרון בדף ועובר שאלה שאלה. אחלה מתרגל \n\nשעורי הבית: \nהגשות שבועיות בזוגות, תמיד יש את השאלה שמוציאה ממך את החיים אבל סהכ סבבה. לעבור על התרגול לפני שמתחילים כי הם קשורים אחד לשני כמעט תמיד\n\nהמבחן: \nאמריקאי, יש לפעמים שאלה שצריך לזכור הערה קטנה אבל שאר השאלות זה נושאים שהם אותו דבר כמו שנים קודמות. לחלק מהשנים הקודמות אין פתרון מלא אז הייתי שומרת את אלו לסוף. מועד ב לא מפרסמים שתדעו מראש, רק מועד א, מעבר לזה אין הרבה מה לומר \n\nהשורה התחתונה: \nקורס סבבה והתכנות שיש בו זה בעיקר אותו קוד כמו בהרצאה רק עם שינויים מספריים", "timestamp": 1681636968946}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרינה מעולה, מאוד נחמדה, ומסבירה הכל תוך כדי לתת אינטואיציות טובות\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מעולה, מאוד בקיאה בחומר \n\nשעורי הבית: ארוכים אבל מאוד מלמדים וחשובים\n\nהמבחן: יש עליית מדרגה בשנים האחרונות\n\nהשורה התחתונה: סגל קורס מעולה, מאוד נהניתי", "timestamp": 1688660827671}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נדיה\nחוות דעת - הרצאות: מרצה מצויינת, ומאד ברורה\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: גם בתור מתרגלת, נדיה מצויינת\n\nשעורי הבית: ארוכים מאד, אבל חשובים כדי להבין את החומר. מומלץ כן לעשות אותם טוב ולהשקיע בהבנה (למרות שהם רק 10% תקף). שווה לעבור עליהם גם לפני המבחן - אצלנו היו עקרונות דומים שעזרו בפתרון שאלות בבחינה.\n\nהמבחן: קשה, אבל הוגן.\n\nהשורה התחתונה: קורס מעניין, אבל צריך לקחת בחשבון שתרגילי הבית השבועיים לוקחים חצי יום.", "timestamp": 1690870887755}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202203", "text": "שם המרצה: נדיה בורדו\nחוות דעת - הרצאות: נדיה אחלה מרצה, נחמדה ממש ובן אדם טוב שזה חשוב לדעתי כאיש סגל. היא ידעה להעביר את החומר בצורה טובה ככה שכולם יבינו והיא בעצמה הייתה מאוד בקיאה בחומר.\nהיא הייתה גם מרבה לדבר איתנו על קורסים מתקדמים ולאן עוד אפשר להרחיב את הידע בתחום, נראה שבאמת יש לה תשוקה למקצוע.\n\nשם המתרגל/ת: נדיה בורדו\nחוות דעת - תרגולים: התרגולים היו ישר אחרי ההרצאות, כמו ההרצאות התרגולים היו מובנים לגמרי, ולא משעממים היא דאגה שנבין את החומר.\n\nשעורי הבית: \nהשיעורים בית ארוכים מאוד בקיץ, ברמה שאפשר לשבת על זה יום שלם ולסיים רק חצי מזה (מזל שזה בזוגות).\nהמבחן: \nהמבחן לדעתי היה ברמה סבירה יחסית לשאר המבחנים האחרונים בקורס, נדיה לימדה אותנו את כל מה שהיה צריך בשביל להצליח במבחן ובכל השאלות.\nהשורה התחתונה: \nנדיה אחלה מרצה ומתרגלת, קורס מעניין הוא באמת פותח למקומות חדשים בתואר, ומראה איך הכל מתחבר, כל החומר התיאורטי שלמדנו בהסתברות.\nהקורס יחסית עמוס בקיץ, אבל לדעתי עדיף לעשות את הקורס בקיץ.", "timestamp": 1705163170719}, {"author": "אמיר מנשר", "difficultyRank": 4, "generalRank": 4, "semester": "202203", "text": "שם המרצה: נדיה\nחוות דעת - הרצאות: מרצה מעולה! אווירה טובה, תמיד עם חיוך ודואגת לכל אחד ואחת.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: אותה גברת חייכנית\n\nשעורי הבית: \nדיי קשים אבל עוזרים להבנת החומר לעומק, לגבי התכנות בR פחות בא לידי ביטוי במבחן חוץ מהחלק בסוף של הרגרסיה\nהמבחן: טיפה טריקי ואפשר בקלות לפספס נקודות, אז אם שאלה נראת קלה כדאי שתסתכלו עלייה פעמיים\n\nהשורה התחתונה:", "timestamp": 1705270305982}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202203", "text": "שם המרצה: נדיה\nחוות דעת - הרצאות: ראיתי הקלטות, מרצה מעולה\n\nשעורי הבית: גליון בשבוע, דיי קשים אבל מאוד עוזרים בלהבין את החומר. \n\nהמבחן: אמריקאי. אם חורשים מספיק מבחנים לפני אז אפשר להוציא ציון טוב, יש שאלות לפעמים דיי טריקיות אז להיזהר. \n\nהשורה התחתונה: \nקורס חשוב, נותן הבנה טובה סטטיסטיקה. לא קשה מדי אם אתה על החומר.", "timestamp": 1707217837167}, {"author": "سميح", "difficultyRank": 2, "generalRank": 5, "semester": "202203", "text": "שם המרצה: נדיה בורדו\nחוות דעת - הרצאות: נדיה היא מותק של בן אדם. נותנת ומסבירה מכל הלב.\n\nשם המתרגל/ת: נדיה בורדו\nחוות דעת - תרגולים: מסבירה את הכל בצורה ממש מובנת ותמיד עונה על הבאלות ומוודאת שכולם מבינים.\n\nשעורי הבית: שיעורי הבית בקיץ הם ממש ממש ממש ארוכים אבל ממש עוזרים להבנת החומר ולהכנה למבחן הסופי.\n\nהמבחן: ממש הוגן, כל מה ששם הוא ברמה של התרגוליםת ההרצאות והתרגילי בית.\n\nהשורה התחתונה: קורס ממש נחמד שמכסה את הבסיס של סטטיסטיקה, לבוא עם ראש פתוח ללמוד דרך חשיבה טיפה שונה.", "timestamp": 1711131420441}, {"author": "התפלגות t", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פרופ' מרינה בוגומולוב\nחוות דעת - הרצאות: מרצה מקסימה. כל שבוע חיכיתי להרצאות איתה, והיה כיף. ניכר שיש לה תשוקה לחומר וזה בא לידי ביטוי בצורות הכי טובות שיש. המצגות מפורטות ויש בהן את כל החומר, ובנוסף בסוף כל הרצאה מרינה שולחת מייל שבו רשום באילו הקלטות ניתן לצפות כדי להשלים את ההרצאה.\nכלומר, אפשר ללמוד את הקורס גם מבלי להגיע להרצאות, אבל אני מאוד ממליצה ללכת להרצאות של מרינה.\n\nשם המתרגל/ת: עידו גרינס\nחוות דעת - תרגולים: בחצי הראשון של הסמסטר הלכתי לתרגולים שלו אבל בחצי השני נמאס לי וויתרתי עליו. לפני התרגולים מתפרסם pdf שאפשר להשלים ממנו את התרגולים יופי יופי. מנקודת המבט שלי עידו לא מוסיף כל כך להם אנקדוטות מעשירות, ובנוסף התרגול אורך רק כשעה כך שהוא לחוץ ולא משאיר מקום לשאלות כל כך.\nחוץ מזה, היו פעמים שבהן הוא ביקש מאיתנו להגיע משהו כמו שלוש דקות מוקדם יותר כדי לעבור בקצרה על החומר של ההרצאה, ולעניות דעתי מתרגלים שחורגים מחלון הזמן שלהם זה סימן לא כל כך טוב.\n\nשעורי הבית: גיליון בכל שבוע, 8 מתוך 11 ציונים טובים ביותר. הם מאוד עוזרים להבנת החומר, אבל לוקחים טיפה זמן ומעמיסים על השבוע.\n\nהמבחן: מבחן אמריקאי, לנו הסמסטר היו 18 שאלות. סה\"כ מבחן הוגן ונחמד.\n\nהשורה התחתונה: קורס מעניין אבל יש טיפה מקום לשיפור.", "timestamp": 1713694583465}, {"author": "נורמלי לא סטנדרטי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרצה מעולה! מסבירה מכל הלב, נשארת אחרי ההרצאות בשביל להסביר לסטודנטים. רואים שהיא אוהבת ויודעת את המקצוע.\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: תותח! מסביר ברור, נותן מלא טיפים במהלך התרגולים. לקראת המבחן ראיתי שעת קבלה מוקלטת של נדיה ולדעתי מסבירה הרבה פחות טוב ולכן לדעתי פחות מומלצת כמתרגלת. לרוב עידו מספיק להעביר את כל תוכן התרגול בזמן המוקצב, מקסימום גולש כמה דקות שזה בסדר גמור יחסית לאחרים.\n\nשעורי הבית: היו הסמסטר שיעורי בית מאוד קלילים, לא לקחו יותר מידי זמן. מומלץ להשקיע בשביל להבין טוב את החומר. פה ושם היו סעיפים \"מאתגרים\" יותר, אבל לא הרבה.\n\nהמבחן:  מאוד הוגן הסמסטר. מי שלמד טוב היה יכול להצליח בגדול!\n\nהשורה התחתונה: קורס יחסית \"קליל\" לעומת הסתברות , מאוד מעניין וסגל מעולה. 2 טיפים חשובים מאוד. לגבי רפרנסים, אם אתם צריכים הם נמצאים בתיקייה של \"מבוא לסטטיסטיקה\" יש תיקייה של סטטיסטיקה 1 שיש בה רק את הסמסטר קיץ האחרון(בלבל הרבה סטונדטים אצלנו ). דבר שני, ממש, אבל ממש לא מומלץ לעשות את הקורס כסמסטר קיץ! שיעורי הבית שלהם היו עמוסים בכמה רמות משלנו, תסתכלו בעצמם בגיליונות ועד כמה הם שונים. בנוסף, המבחנים של נדיה הרבה יותר קשים משל מרינה. בדרכ מרינה מלמדת בחורף קחו בחשבון.", "timestamp": 1713706278587}, {"author": "סטטיסטי מספיק בקושי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פרופ חבר מרינה בוגמלוב\nחוות דעת - הרצאות: \nסבבה, אבל די איטיות. מוזר יחסית לקצב שרגילים לו בטכניון, אבל עדיף ללכת אליהן, אישית לי זה היה מוסבר מובן מאוד. אפשר להשלים אותם מאוד מהר אבל יכול להיות טוב להגיע.\nשם המתרגל/ת: ד\"ר נדיה בורדו\nחוות דעת - תרגולים: \nתרגולים טובים מאוד, עוברים על החומר ואחריהם די מבינים. נדיה מתרגלת מאוד מנוסה ורואים את זה.\nשעורי הבית: \nשבועיים, אבל לא עמוסים מדי. עושים אותם בזוגות ואם מחלקים זה לא לוקח הרבה זמן. התרגול היחיד במהלך הסמסטר אבל לא דומים במיוחד למבחן.\nהמבחן: \n20 שאלות אמריקאיות ב3 שעות, קשה אך אפשרי וסה\"כ לדעתי הוגן. מספיק לתרגל כמה מבחנים כדי לקלוט את השיטה אך לצערי אין תשובות מלאות לרובם אז קודם לעבור על החומר לפני שמתחילים לפתור.\nהשורה התחתונה: \nקורס יחסית קל, שלא מצריך להגיע לשיעורים באמת. הייתי ממליץ למי שאהב הסתברות אבל לדעתי זה חובה לכל מי שלוקח. מרגיש שנותן הבנה על החומר.", "timestamp": 1713728104922}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: \nמרינה נחמדה וסבלנית לטעמי מבולגנת \nשם המתרגל/ת: נדיה \nחוות דעת - תרגולים: \nנדיה מתרגלת וגם מרצה שולטת בחומר ובעלת יכולות הוראה גבוהות (מה שלא טריוויאלי בכלל בטכניון) מומלץ.\nשעורי הבית: \nהוגנים ומלמדים , למי שכבד לו ממליץ לא להיתקע על הR כי כתיבה  לא באה לידי ביטוי במבחן (להגיע לרמת הנבנה של מה שכתוב)\n\nהמבחן: \nהוגן מאוד. כן התשובות לפעמים מבלבלות אבל אם מכירים את החומר טוב אפשר להוציא ציון גבוהה. לקחת בחשבון בלמידה שאמריקאי ולא צריך להוכיח כלום ..\nהשורה התחתונה: \nקורס הוגן ומעניים ולדעתי מאוד פרקטי. סגל נעים ואכפתי מאוד משפיע על החוויה . להשקיע בקורס הזה יכול לעלות ממוצע בקלות.", "timestamp": 1714298781422}, {"author": "עובר ועוד אפסילון", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרצה מקסימה שאוהבת את החומר. מרגישה קצת איטית ולפעמים מתעכבת על דברים לא רלוונטים לכמה דקות וקל לאבד ריכוז\nסך הכל שווה לבוא להרצאות \n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: בהנתן השעה הבודדת שנתנו לתרגול עידו עושה עבודה מצויינת מסביר את החומר וקצת אינטואיציה. קשה להעביר הרבה עומק בשעה.\nהרגיש לי שהוא מקריא את התרגול בעל פה אבל הוא נותן קצת עצות ונקודות מבט שעזרו לי קצת להפנים יותר את החומר \n\nשעורי הבית: ארוכים, יש רפרנס כדאי לא להמרח איתם\n\nהמבחן: בעיניי הוגן, הרבה תרגילים יפילו אתכם כי הם נותנים את המסיחים הנכונים אז חשוב לוודא מה עשיתם עד הסוף. בגדול לא הולם בדיוק את העומק שעברנו בסמסטר הרגיש לי שחשוב לפתור מלא מבחנים ולהבין מה רוצים שתדעו לפתור\n\nהשורה התחתונה: קורס חמוד יש בו עניין בעיקר בסוף שהכל מתחבר", "timestamp": 1716796693166}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: פשוט מקסימה! רואים כמה היא אוהבת את מה שהיא עושה וכמה היא נהנית ללמד את הסטודנטים. נכון, היא יכולה קצת להתפזר לפעמים אבל היא באמת מרצה מעולה. \n\nשם המתרגל/ת: עידו \nחוות דעת - תרגולים: אחד המתרגלים הטובים ביותר שנתקלתי בהם. תמיד מאורגן ומסודר, יודע בדיוק מה הוא רוצה להסביר וללמד - שזה ממש חשוב כי יש לו רק שעה. אווירה מעולה בכיתה ועזר לסדר את כל הדברים שלא ישבו הכי טוב אחרי ההרצאה.\n\nשעורי הבית: הגשה שבועית של גיליונות ארוכים ועמוסים מאוד. חשוב לא להימרח איתם אבל הם כן חשובים להבנת החומר.\n\nהמבחן: אין מה לומר, המבחן היה די הוגן מבחינת זה שכל השאלות הן על החומר הנלמד, וחלק מהשאלות גם היו די קלות. אבל אם לא עליתם על הטוויסט שיש בלא מעט מהשאלות, לא ילך לכם. מבחן אמריקאי עם מסיחים שנבחרו בקפידה, כך שאם אתם לא יודעים עד הסוף איך להגיע לתשובה, בהצלחה :)\n\nהשורה התחתונה: \nסגל קורס מדהים, אולי הכי טוב שנתקלתי בו.\nמבחן קשה אך הוגן.", "timestamp": 1716875762496}, {"author": "—", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: פרץ \nחוות דעת - הרצאות: לא משעממות ולא ממש כיפיות, בין לבין. אהבתי שתוך כדי ההרצאות הוא הרבה פעמים מנסה להכניס נושאים ואינפורמציה שלא ידענו מחיי היומיום!\n\nחוות דעת - תרגולים: פרץ כבר פותר שאלות ממבחנים בכל הרצאה, לכן הרגשתי שללכת לתרגולים היה מיותר \n\nשעורי הבית: אין\n\nהמבחן: רמה יחסית טיפה גבוהה מהרגיל, היו רעיונות חדשים שמצרכים הבנה עמוקה בחומר!\n\nהשורה התחתונה: ללכת / לצפות בכל ההרצאות ובאמת להבין אותן, ותוך כדי שהוא פותר את השאלות בהרצאה תנסו לפתור אותן בעצמכם. חייב לתרגל כמה שיותר שאלות לקראת המבחן. מומלץ להדפיס כמה שיותר מבחנים ולחלק אותן לפי מקצועות (כדי להכניס אותן למבחן)", "timestamp": 1716974091566}, {"author": "ללללי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: משעמם. לא הלכתי לחצי בערך והרוב אפשר להשלים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמשעמם גם. קורס משעמםםם\nשעורי הבית: \nחשובים להבנת החומר! ממליצה להשקיע\nהמבחן: \nתיזהרו ממועד ב' הוא משמעותית יותר קשה ממועד א' והנמיך לי אל הציון מאוד טרגי:'((((\nהשורה התחתונה: קורס חשוב משעמם", "timestamp": 1716987051920}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: \nהקצב מרגיש איטי מידיי, מרינה מאוד דואגת לסטודנטים\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: \nנדיה אלופה עושה סדר בחומר ואחרי התרגול הכל נראה פשוט\nשעורי הבית: \nחשובים להבנת החומר אבל בגלל שהמבחן אמריקאי מרגיש שהם רמה מעל השאלות במבחן\nהמבחן: \nאמריקאי לנו היה 18 שאלות, הרבה שאלות טכניות של חישובים ופה ושם שאלות של הבנה \nהשורה התחתונה: \nלתרגל הרבה מבחנים לקראת המבחן כי הטריקים חוזרים על עצמם", "timestamp": 1717403910338}, {"author": "S", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרינה מתוקה ממש, אכפת לה מהסטודנטים והיא רוב הזמן מסבירה סבבה. הבעיה היא שהיא לפעמים חוזרת על אותו דבר הרבה פעמים עד כדי כך שזה כבר מבלבל וגם לא מתקדמים. היא גם לפעמים מתעכבת על הוכחות מיותרות (המבחן אמריקאי).\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: נדיה הייתה המתרגלת שלנו למרות שלפעמים היא בעצמה מעבירה את הקורס- לטוב ולרע. היא יודעת את החומר פרפקט ומסבירה אותו בצורה די אינטואיטיבית אבל מצד שני כשהיא עושה את זה הכל נראה קל. יש לה סבלנות לענות על שאלות ולהסביר שוב ושוב. \n\nשעורי הבית: כל שבוע גליון, בחלק מהשאלות צריך לתכנת בR, שזה לא נורא, רק צריך לשים לב לסינטקס. שני החלקים חשובים כי יש על שניהם שאלות במבחן. להרבה שאלות יש רפרנסים. \n\nהמבחן: בעיקרון השאלות יותר קשות מהגליונות והתרגולים. יש במבחן 18 שאלות אמריקאיות- לחוץ מאוד בזמן. אם המבחן היה פתוח הם לא היו מעיזים לעשות אותו יותר מ4 שאלות, וגם את האמריקאי צריך לפתור כמו שאלה פתוחה. מה גם שאין פתרונות מלאים למבחנים אז זה מקשה עוד יותר על העניין. בגדול צריך לנסות לתרגל כמה שיותר ולהבין גם איזה טריקים הם שמים במבחנים- שגם יקצרו את דרך הפתרון (כן, ללכת לפי התשובות עצמן כמו בפסיכומטרי יכול לעזור)\n\nהשורה התחתונה: קורס לא קל ברמת התוכן, אבל הסגל כן עוזר.", "timestamp": 1718880354785}, {"author": "הוכחה פורמלית", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: חמודה, מסבירה טוב\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: לקראת הסוף הגליונות נעשים יותר קשים ועמוסים\n\nהמבחן: אמריקאי עם מלא מוקומות ליפול בחישוב.\n\nהשורה התחתונה:", "timestamp": 1718902109803}]}