{"posts": [{"author": "SR", "difficultyRank": 3, "generalRank": 3, "semester": "201802", "text": "שם המרצה: -\nחוות דעת - הרצאות: אני אישית חושב שההרצאות בקורס הזה ממש מיותרות, מספיק לעבור על הסיכומים המוקלדים.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: המתרגל בווידאו ממש מעולה, ממליץ בחום.\n\nשעורי הבית: יש גיליון מדי שבוע והם יחסית ארוכים. שווה להשקיע בהם כי זה עוזר להיות על החומר.\n\nהמבחן: המבחן היה יחסית סביר, ממליץ לתרגל כמה שיותר מבחנים קודמים (וכדאי בעיקר של המרצה האחראי)\n\nהשורה התחתונה: סה\"כ קורס מעניין לדעתי למרות ששיעורי הבית השבועיים די חופרים.", "timestamp": 1597749764558}, {"author": "Ofek Glick", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אורן לואידור\n\nחוות דעת - הרצאות: \nההרצאות עברו באופן מקוון ונתנו אופציה לצפייה בהרצאות מוקלטות של אבנר הלוי משנים קודמות. מתוך קורס של 200+ אנשים הגיעו רק 7 אנשים להרצאות בלייב מאחר והם הועברו בצורה יבשה ולא מסודרת. אבנר לעומת זאת היה נהדר ומעניין לצפייה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:\nברמת קושי הגיונית מאוד, מאוד עוזרים לחידוד החומר לאורך הסמסטר\n\nהמבחן: \nקשה בצורה לא פרופורציונלית לרמת הקורס. בעיקר כי המבחן אמריקאי (למרות שכאשר הוא עבר באופן מכוון הוא היה פתוח אך נדרשנו רק לתוצאה סופית). שאלות שדורשות המון המון טריקים אבל עם מספיק תרגול משתפרים.\n\nהשורה התחתונה: \nקורס מעניין מאוד, כיפי לאורך הסמסטר אך ללמוד המבחן קשוח מאוד ולא פשוט בכלל.", "timestamp": 1597913448100}, {"author": "אוהב תקזינו", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nאורן לואידור,מרצה אגדה מרצה שמבין לעומק ומסביר בצורה עמוקה מאוד,המרצה קצת מתקשה בהיגוי של מילים,אבל אם נותנים לו צאנס ומתעלמים מזה הוא תותח בנוסף הוא גם אח יקר ובן אדם מדהים.\n\nהשורה התחתונה: קורס חשוב ,גם בתואר עצמו,וכמובן שחשוב כשתהיו מיליונרים ותהמרו בקזינו ... :)", "timestamp": 1598044153209}, {"author": "ittay alfassi", "difficultyRank": 4, "generalRank": 2, "semester": "201901", "text": "שם המרצה: דמיטרי יופה\nחוות דעת - הרצאות: הוידיאו של הסתברות ת הרבה יותר טוב. רק ללכת להרצאות בשבועיים האחרונים כי החומר משתנה.\n\nשם המתרגל/ת: חנה מטטוב\nחוות דעת - תרגולים: מלכת על. שווה מאוד ללכת אליה.\n\nשעורי הבית: שבועיים, לא מאוד קשים אבל נוכחים.\n\nהמבחן: לא לזלזל במבחן. צריך לתרגל הרבה מאוד.\n\nהשורה התחתונה: אם אתם על הקורס כל הסמסטר, כנראה שתאהבו את הקורס. אחרת, בהצלחה.", "timestamp": 1601652173118}, {"author": "Me", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: מלמד טוב ומעניין. מבאס שלקח את הסתברות לצד היותר תיאורטי-מתמטי ופחות חישובי לאור העובדה שהקורס אינו מיועד למתמטיקאים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עוזרים מאוד להבין את החומר. אבל הם בניגוד להרצאות מאוד חישוביים.\n\nהמבחן: היו בו שאלות תיאורטיות שלא תרגלנו לא בתרגולים לא  בשיעורי הבית ולא במבחני עבר, זה היה מכשיל. \n\nהשורה התחתונה: קורס קשה.", "timestamp": 1613030858984}, {"author": "Noam Chen", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: הרצאות מרתקות, מרצה שיודע להעביר את החומר וכן עונה לשאלות של סטודנטים. לפעמים יכול להיות טיפה עמוס.\n\nשם המתרגל/ת: רעות אפל\nחוות דעת - תרגולים: התרגולים אצל רעות עוברים בצורה יחסית מונוטונית, החיסרון העיקרי שהיא התעכבה על כל שאלה שנשאלה ולפעמים זה מרח את התרגול.\n\nשעורי הבית: ממוחזרים\n\nהמבחן: סה״כ הוגן מאוד\n\nהשורה התחתונה: קורס עמוס, לא פשוט בכלל, צריך להשקיע ולהיות על החומר במהלך הסמסטר כדי להצליח בבחינה. בנוסף חייבים לתרגל הרבה מבחנים לפני הבחינה עצמה. שימו לב שאם יוחאי המרצה אז המבחן שלו (כנראה) יהיה יותר דומה לזה של הסתברות ח׳.", "timestamp": 1613243846940}, {"author": "מבין עניין", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nמעביר את החומר באופן מעניין ובכל נושא נותן כמה דוגמאות. לצערי בגלל שהסמסטר היה מקוון הוא לעתים רחוקות ענה על שאלות בזום, אבל סה\"כ אחלה של מרצה.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nמתרגלת מעולה שמספיקה לפתור את כל התרגול + שאלות רשות ועדיין לסיים רבע שעה מוקדם יותר. \n\nשעורי הבית: \nכל שבוע מפורסם גיליון וצריך להגיש 9 מתוך 11 (ציון תקף). לרובם יש רפרנס מלא, והם מבוססים באופן גס על החומר שהועבר בתרגול באותו שבוע, ככה שאפשר תוך יום-יומיים לסיים אותם בלי לשבור את הראש.\n\nהמבחן: \nהיה לנו אמריקאי עם 10 שאלות, מאוד קליל יחסית לסמסטרים קודמים. בשביל להצליח במבחן צריך לפתור כמה שיותר מבחני עבר, להשתמש בדף הנוסחאות מהדרייב, ואתם מסודרים.\n \nהשורה התחתונה: \nקורס מעניין, לא הייתי ממליץ לקחת אינפי 2מ במקביל כי כבר מאמצע הסמסטר רואים דוגמאות על נושאים שנלמדים רק בסוף אינפי 2מ.", "timestamp": 1613297009203}, {"author": "Noam Wolf", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  יוחאי מעיין\nחוות דעת - הרצאות:  מרצה די מעניין, אך מתמקד בחומר התיאורתי הרבה, והרבה פעמים אינו מצליח להתחבר לסטודנטים.\n\nשם המתרגל/ת: חנה מטטוב\nחוות דעת - תרגולים: תרגולים טובים, היא טובה\n\nשעורי הבית:  קשים אך לרוב ממוחזרים\n\nהמבחן:  היה די תכני ופשוט\n\nהשורה התחתונה: קורס תכני יותר ממתמטי, ניתן להוציא בו ציון גבוהה", "timestamp": 1613309714547}, {"author": "amir alkalay", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: יותר מדיי תיאורתי\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: התרגולים תורמים הרבה \n\nשעורי הבית: כל שבוע גיליון מעצבן. נוראיים.\n\nהמבחן: על הנייר מגעיל, אבל נפלתי בסמסטר מופלא עם ממוצע בשמיים. אבל בדרך כלל מגעיל. \n\nהשורה התחתונה: קורס זוועה, אם לא חובה לא לקחת.", "timestamp": 1613313656984}, {"author": "Ido", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: לא חיוניות לקורס, לא הייתי באף אחת מהן ולא היה לי בעיה עם המבחן\n\nשם המתרגל/ת: רעות אפל\nחוות דעת - תרגולים: תרגולים בסדר גמור, אפשר לדעתי ללמוד רק מהתרגולים והתרגילי בית\n\nשעורי הבית: יש כל שבוע, אבל הם עוזרים מאוד להבין את החומר \n(10% מהציון סה\"כ)\nהמבחן: המבחן שלנו היה די קל יחסית, במיוחד בהשוואה לשנים שעברו\n\nהשורה התחתונה: הקורס הרגיש לי קל יחסית, אבל נראה לי שהסמסטר שלנו יוצא דופן", "timestamp": 1613459920154}, {"author": "student", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nגולש לחומר מתמטי תיאורטי ופחות מלמד הסתברות כמו שמלמדים בדר\"כ, קצת מעיק על הקורס, במיוחד שבמבחן בסוף השאלות היו חישוביות כמו תמיד.\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מעולה- הכי טוב שיש.\n\nשעורי הבית: רגילים, גליון פעם בשבוע, לוקח 3-4 שעות לסיים את רובם ובודדים לוקחים קצת יותר. שווה לעשות ולא לרפרנס כדי להיות על החומר, רלוונטיים למבחן.\n\nהמבחן: \nהמבחן היה הוגן, שונה מהפורמט הרגיל של 10-16 שאלות אמריקאיות וכלל המון סעיפים של נכון/ לא נכון.\n\nהשורה התחתונה: קורס חובה, אז אין יותר מידי חשיבות להמלצה או דיס המלצה, אבל סה\"כ נהנתי, מתמטיקה יחסית \"פרקטית\" שמשתמשים בה בקורסים אחרים בהמשך.", "timestamp": 1613551437890}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: לא תמיד הכי סימפטי, אבל העביר את החומר בצורה טובה (והכתב שלו ממש מסודר). מה שכן, הוא התעכב יותר מידי על נושאים תיאורטיים שהמתרגלים בקושי הכירו, ולכן לא הספיק ללמד חלק מהחומר שנלמד בסמסטרים קודמים (שזה הפריע בשלב הלמידה למבחן כשאתה שובר את הראש על שאלה ואז מבין שהיא בכלל לא בחומר).\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: כל שבוע העלו הקלטה של מתרגל אחר בסמוך ליציאת תרגיל הבית. אני הכי התחברתי לתרגולים של רעות.\n\nשעורי הבית: גיליון פתוח פעם בשבוע שניתן לפתור בכמה שעות. די טכני ומזכיר שאלות מהתרגולים, אבל פחות קשור להרצאות.\n\nהמבחן: קל יותר ביחס לסמסטרים קודמים, אבל ההתנהלות לפני המבחן ובעיקר אחרי המבחן עם הציונים הייתה נוראית.\n\nהשורה התחתונה: קורס חובה, מתחיל נחמד אבל נעשה קשה יותר במהלך הסמסטר. חשוב להיות על החומר ולפתור מבחני עבר. הסגל לא הכי נחמד/מתחשב.", "timestamp": 1613723481881}, {"author": "....", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: יוחאי זה יוחאי, שינה חלק לא קטן מהחומר ואישית לא התחברתי \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: ניקה מעולה, הייתה מסיימת את כל שאלות התרגול לפני הזמן ולפעמים פותרת עוד תרגילים שלא מופיעים בדפי התרגול\n\nשעורי הבית: היו 11 כל אחד היה לוקח חצי יום או אפילו יותר למי שלא מסתכל על הרפרנסים \n\nהמבחן: באופן מאוד מפתיע היה מבחן קל והוגן\n\nהשורה התחתונה:", "timestamp": 1613932477261}, {"author": "Alon Kitin", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי ממן\nחוות דעת - הרצאות: \nהרצאות מכאיבות, פלשבקים לאינפי 2מ\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: התירגולים יותר רלוונטיים מההרצאות\n\nשעורי הבית: חשובים מאוד להבנה וגם קלים\n\nהמבחן: קליל\n\nהשורה התחתונה: מלג לא מומלץ", "timestamp": 1613998969481}, {"author": "Elad Kay", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: מאוד נכנס למתמטיקה ברמת העמקה יותר גבוהה מבעבר. אישית אהבתי, אבל ברור לי שזה לא לכולם. לא מאוד מתחשב כמרצה אחראי, מתחמק משאלות טכניות. לוקח לו הרבה זמן לענות במייל. לזכותו יאמר שהוא לא שאל במבחן על נושאי ההעמקה.\n\nשם המתרגל/ת: רעות אפל \nחוות דעת - תרגולים: מתרגלת מצוינת! מומלץ מאוד. כמה חבל שיוחאי והמתרגלים לא תיאמו ביניהם כלום ונוצר מצב שהמתרגלים לא יודעים מה יוחאי לימד ואיך הוא לימד, במיוחד לאור חומר ההעמקה הנוסף שיוחאי הוסיף לקורס.\n\nשעורי הבית: גיליון כל שבוע, לא סופר קשה\n\nהמבחן: יוחאי עשה מבחן מאוד קל. ממוצע אסטרונומי. בטח לא מייצג. לא מקנא במועד ב\n\nהשורה התחתונה: קורס טוב למי שאהב אינפי", "timestamp": 1614858574346}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: ההרצאות היו לא קשורות לתרגולים ברובן, כמעט ולא היה זמן לשאלות, ולא היה ברור מה מידת הרלוונטיות של נושאים קטנים שהוספו לנו (לעומת סמסטרים קודמים).\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מתרגל מאוד טובה, אך לא פעם התחברתי (לזום) לשעות קבלה והיא לא הופיעה.\n\nשעורי הבית: סבירים - לא קשים מדי, כן רלוונטיים.\n\nהמבחן: המבחן שלנו היה לא קשור בעליל למבחני עבר. הממוצע שלו היה 86, רוב הסטודנטים אומרים שזה בגלל העתקות. לדעתי המבחן היה בנוי פשוט לא טוב, ברמה שהיה בלתי-אפשרי להוציא 100 כמו שבלתי-אפשרי להוציא פחות מ-60. היה עדיף מבחן קשה ורלוונטי כמו תמיד, ולא מבחן בו בודקים את החדות שלך אם שמת לב שכתוב \"בלתי-תלויים\" או לא.\n\nהשורה התחתונה: אהבתי מאוד את החומר, אך הוא הועבר בצורה נוראית בסמסטר הזה (ספציפית).", "timestamp": 1616235229039}, {"author": "123", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מעיין יוחאי\nחוות דעת - הרצאות: מרצה טוב סה\"כ, לפעמים חסרות קצת אינטואיציה ודוגמאות, ולכן המוקלט של ד\"ר אבנר הלוי סוגר פינות. יוחאי מעביר את הקורס בדגש רב על המתמטיקה, ולכן למדנו פחות חומר משנים קודמות, אבל התעסקנו הרבה בתיאוריה והוכחות. \nהבעיה המרכזית היא חוסר התיאום בין ההרצאות לתרגולים, כיוון שההרצאות שונו ביחס לססמטרים קודמים אך מערך התרגולים נשאר זהה.\n\nשם המתרגל/ת: אפל רעות\nחוות דעת - תרגולים: מתרגלת מצוינת, מסבירה הכל לעומק, עונה על שאלות וסבלנית מאוד. כותבת מהר (לפחות בזום).\nלפעמים פותרת בשיטות אחרות מדפי התרגול המפורסמים.\n\nשעורי הבית: חלקם מרופרנסים מסמסטרים קודמים וחלק חדשים.\n\nהמבחן: מקוונים, סמסטר קורונה. \nמועד א' היה יחסית קל והממוצע הגבוה מעיד על כך. בעיקר שאלות נכון/לא נכון וגם קצת שאלות של חישובים (תשובות סופיות). התנהל במודל.\nלי אישית הסתדר לגשת רק למועד ב' שהיה שונה לחלוטין ממועד א' - מבחן פתוח לחלוטין והוכחתי מאוד, מזכיר יותר מבחן אינפי מאשר הסתברות.", "timestamp": 1616313662632}, {"author": "יקיר אוזן", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nמרצה מעולה, הלוואי שיהיה מרצה בכל הקורסים\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמצוינת ומתוקתקת\nשעורי הבית: \nתרגיל כל שבוע, לא קצרים, מעט קשים ומקיפים את החומר בצורה טובה\nהמבחן: \n\nהשורה התחתונה: אחלה סגל, החומר לא פשוט", "timestamp": 1626329674879}, {"author": "יקיר אוזן", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מרצה תותח מעביר את החומר בצורה מעניינת מאוד, סבלני ולא נותן לסטודנט אחד לא להבין את החומר\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: כן אשתו.. מתרגלת מעולה מסבירה את הנלמד בצורה ברורה.\n\nשעורי הבית: כל שבוע תרגיל בית, קצת מתיש אבל מי שעושה הכל מבין בסופו של דבר את החומר\n\nהמבחן: צריך לדעת הרבה טריקים.. קשה \n\nהשורה התחתונה: אחלה צוות אבל חומר עמוס", "timestamp": 1627643685053}, {"author": "הילי סגל", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: יוחאי מעביר את החומר בצורה ברורה, בודק שכולם מבינים את מה שהוא מסביר ועונה על כל השאלות של התלמידים. בכללי ההרצאות ארוכות והחומר לא הכי מעניין, אבל יוחאי מרצה תותח. \n\nשם המתרגל/ת: רעות אפל \nחוות דעת - תרגולים: מסבירה את החומר באופן ברור, בקצב טוב, ויש לה גם כלבה שנמצאת בכיתה במהלך התרגולים. \n\nשעורי הבית: דורשים זמן , לפעמים יותר מדי ארוכים. \n\nהמבחן: קשה מאוד, דורש הרבה עבודה וללמוד את הטריקים. \n\nהשורה התחתונה: קורס קשה, אז כדאי לבחור מרצה ומתרגל שמסביר את החומר בקצב שמתאים לך ולחרוש לפני המבחן.", "timestamp": 1627650344157}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: מאוד מאוד מאתגרות. אני לומד הנדסת נתונים ואנחנו לומדים הסתברות במקביל לאינפי 2. לכן, המון דברים שאנחנו לומדים רק באמצע הסמסטר באינפי כמו טורים וכדומה, בהסתברות משתמשים בזה על ההתחלה. זה מאוד משעשע שהם כל פעם מופתעים מזה שאנחנו לא מכירים את החומר, בזמן שעוד לא למדנו אותו. מדמח לעומת זאת לוקחים הסתברות סמסטר שלישי והם כבר באים עם הידע הדרוש. בנוסף, אורן הוא מרצה מאוד מאתגר, שכן הוא לרוב לא מובן כי ההסברים שלו מאוד תיאורטיים וגם אין רציפות בהסברים שלו. הוא עובד עם סיכום שהוא הכין מראש ומפרסם לכולם אותו. כן ממליץ לכתוב במהלך ההרצאות אבל רק את התכלס ואת המשפטים, אל תהרגו את עצמכם עם כתיבת ההוכחות. בנוסף, רוב החומר בהרצאות מאוד מאוד מיותר, ולומדים באמת רק בתרגולים. כן שווה לבוא להרצאה אבל רק כדי לשמוע את החומר בפעם הראשונה לפני התרגול.  \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת תותחית. לא לימדה ישירות מדף התרגול שמתפרסם, אלא מראה לנו את האינטואיציה מאחורי הדברים ואיך היא חשבה על זה. המון פעמים היא פישטה את ההסברים הגרועים והפורמליים שרשומים בדפי התרגול כדי שנבין את זה. מה שכן, תרגול פעם בשבוע לא מספיק כי יש המון חומר אז יצא שלרוב היא רצה עם תרגילים. כמעט בכל תרגול, אף מתרגל לא הספיק את כל התרגילים.\n\nשעורי הבית: פעם בשבוע מתפרסם גיליון של 5 שאלות לרוב. כל גיליון עמוס ודורש השקעה. בהתחלה השאלות עוד מתרגלות את החומר בצורה ממש טובה, ממליץ לכם לא לקרוא רפרנסים כדי שתוכלו באמת להבין מה הולך. לקראת אמצע סוף הסמסטר התחילו להכניס שאלות תיאורטיות שמה שהולך שם אלוהים אפילו לא רוצה לראות. פשוט שאלות מזעזעות שמוציאות המון תסכול מכם, והמלצה אישית שלי, חכו שמישהו יפרסם את הפתרון שלו ותשבו עליו כמה אנשים, ותנסו להבין מה הולך שם על ידי זה שתפתרו במקביל. אין מה להתאבד על שאלות כאלה הן סתם באות להתקיל.\n\nהמבחן: חחחחחחחחח אני בחיים לא ראיתי כמות כזאת של סטודנטים מתוסכלים כמו שהיו אחרי המבחן הזה. וואו. זאת השנה הראשונה שהמבחן שונה למבחן פתוח עם חלק קטן של שאלות אמריקאיות. לא היה לנו מאיפה לתרגל, ובנוסף, כשבדקו את שיעורי הבית שלנו לא החזירו שום משוב, אלא רק הורידו נקודות. לכן, לא ידענו למה לצפות מבחינת הדרישות של הסגל מהתשובות. לחלקנו היו רק 4 ימים ללמוד. יש המון המון חומר והוא לא מרגיש מסודר בכלל, הכל מפוזר ואין לך מושג איך ללקט הכל. אורן נתן שאלה שרוב האנשים מנתונים לא ידעו לענות בצורה הכי טובה, כי מדמח כן למדו גרפים וידעו את הרקע לשאלה ואנחנו לא. בסוף אורן נתן פקטור של בערך 20 נקודות וזה לא מפתיע כי הוא נתן מבחן ממש קשה. תתכונו יהיה קשוח.\n\nהשורה התחתונה: קורס עמוס שברובו אתם תרגישו מבולבלים מהסגל ומדרך ההוראה שלו. תלמדו מהגיליונות ותשבו עליהם כמה שאפשר. החומר מההרצאות לרוב לא יעזור סתם חפירות מיותרות.", "timestamp": 1628427263538}, {"author": "YT", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nיוחאי היה מרצה של הסתברות ת אבל נתנו לנו את האופציה ללכת אליו. יוחאי אחלה מרצה, מעביר את החומר בצורה טובה ומאד ברורה. \nהמרצה האחראי שלנו היה אורן לואידור. להתרחק כמו מאש. גרוע וזוועה. מעדיף לא להוסיף מעבר לזה.\n\nשם המתרגל/ת: מעיין הילה\nחוות דעת - תרגולים: \nאחלה מתרגלת למרות שהרבה מאד פעמים מתבלבלת בדברים וקצת מבולגנת. היא מאד ניסתה להעביר את החומר בצורה שסטודנטים יבינו ולשים דגש על הנקודות החשובות. \nגם חנה מתרגלת נחמדה.\n\nשעורי הבית: גיליון שבועי, לא עמוס ולא קשה במיוחד. איזור ה6-8 שעות. הרוב מרופרנס חוץ מכמה שאלות תאורטיות שהוסיפו לנו הסמסטר. חוץ מ2-3 שאלות תיאורטיות שהיו ממש לא פתירות ומוגזמות היה בסדר.\n\nהמבחן: ממוצע 44 על הטופס אומר הכל. לדעתי זה שמגיעים לממוצעים כאלה כאשר אורן מרצה אחראי פעם אחר פעם זה פשוט זלזול בסטודנטים בכל דרך אפשרית. בסוף ניתן פקטור של קרוב ל20 נקודות וזה עדיין לא מספיק בכלל. חציון 63 סופי. יש סטודנטים רבים שקיבלו ציון שממש לא משקף כלום.\nהמבחן החל מהסמסטר שלנו עבר למתכונת פתוחה, שינוי מבורך מאד סך הכל ואני מקווה שהם יתאפסו על עצמם במבחנים הבאים.\n\nהשורה התחתונה: הקורס היה לי מאד מעניין במהלך הסמסטר ואני חושב שלומדים בקורס דברים מאד חשובים. לצערי, המבחן ובאופן כללי ההכנה למבחן בקורס הזה הייתה מאד מייאשת והרסה את זה.", "timestamp": 1628510337511}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: לא מובן. דיי מבולגן במהלך ההרצאה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: הילה מעיין\nפרקטית (!), מסבירה תכלס.\n\nשעורי הבית: \nקצת מעיק, פעם בשבוע מפורסם גיליון. \nהמבחן: לא הוגן.", "timestamp": 1628960028821}, {"author": "סטודנט מתוסכל", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: הרצאות ארוכות ולא מעניינות. אורן הוא המרצה הגרוע ביותר שפגשתי עד כה בתואר, אטנו חכול להציג את עצמו מול קהל וההרצאות איתו מאוד מאוד משעממות. ממליץ ללכת למרצה אחר\n\nשם המתרגל/ת: חנה מטטוב\nחוות דעת - תרגולים: מתרגלת פשוט מעולה, מסבירה הכל בצורה מעניינת ומאוד ברורה וקל לעכוב אחריה. הסיבה היחידה שהבנתי מה קורה בקורס הוא התרגולים שלה.\n\nשעורי הבית: מציקים וארוכים, הגשה בכל שבוע ללא משוב עם טעויות, רק הורדת נקודות בלי הסברים\n\nהמבחן: מאוד לא הוגן, מבנה המבחן השתנה לראשונה ל4 שאלות רב בחירה וחלק פתוח. לא היה חומר לתרגל ממנו למבחן, והסגל הבהיר שהם לא מעוניינים לשחרר חומר לתרגל לחלק פתוח. סה\"כ כ60 אנשים עברו הבחינה. סגל מאוד מטומטם בגישה למבחן ועדיין מאמין שהמבחן היה הוגן למרות שנתנו 20 נקודות פקטור\n\nהשורה התחתונה: תכלס אל תקחו הקורס אם לא חייבים", "timestamp": 1633614913229}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  אורן לואידור\nחוות דעת - הרצאות: \nמרצה לא כריזמטי. עוצם עיניים כשהוא חושב/עונה תשובה לסוודנט/מדבר.\nשינה את המבנה של המבחן לצורה שונה לגמרי\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמדהימה! בזכותה למדתי\n\nשעורי הבית: \n\nהמבחן: \nאביב 2021 מועד א - 30% עברו (לפני פקטור). זה מדבר בעד עצמו.\n\n\nהשורה התחתונה:", "timestamp": 1634610400610}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: הייתי רואה את ההרצאות המוקלטות של אבנר במקום. לא בטוח שזה היה החלטה נבונה אבל גם ככה אף אחד לא הבין את אורן\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מדהימה מסבירה מצוין, עוזרת לרכוש אינטואיציה, טריקים, טיפים\n\nשעורי הבית: קשים אבל חשובים. לוקחים זמן. אחד כל שבוע\n\nהמבחן: קשה בהגזמה. היה אפשר לעשות את כל המברחנו עבר שקיימים ולא להצליח את המבחן הזה. הממוצעים לפני פקטור מדברים לעצמם (40 ומשהו בשני המועדים\n\nשורה התחתונה: חבל כי הקורס מענייני חומר חשוב ומרתק, פשוט חבל להשקיע כל כך הרבה בקורס אם גם ככה לא תקבל תוצאה מספקת", "timestamp": 1635152318167}, {"author": "ניקי מינאז'", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: לא מובן כל כך, מפוזר ולא מצליח לקשר בין נושא אחד לאחר אלא פשוט זורק הגדרות, משפטים והוכחות לאוויר. יש הקלטות של יוחאי מסמסטרים קודמים שעוזרים להבין את רוב הנושאים בצורה יותר ברורה.\n\nשם המתרגל/ת: אסף גנדלר\nחוות דעת - תרגולים: מתרגל מעולה, לא מוריד את החיוך מהפנים ומסביר בצורה טובה ומרגיעה את החומר המבולגן מההרצאות.\n\nשעורי הבית: לא קשים מדי, חשובים ורלוונטים כדי להשאר בעניינים.\n\nהמבחן: פייר.\n\nהשורה התחתונה: קורס קשה אבל לא מדי, דורש שבוע של למידה למבחן כדי להצליח בו. מרצה לא וואו אבל לא בא לדפוק ומבחן הוגן שלא מחפש קטנות אלא הבנה בסיסית וטובה של החומר.", "timestamp": 1644572800206}, {"author": "טראומות מיוחאי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות:\nכמרצה הוא לא משהו: כותב מאוד לא ברור ומאוד מבולגן, לא ברור על מה הוא מדבר ולמה מה שהוא כותב על הלוח עכשיו קשור, כותב משפטים עם ניסוחים לא ברורים, שוכח להגדיר לנו כל מיני דברים, ואפשר עוד להמשיך... אבל צריך להגיד שהוא מאוד השתדל, ענה כמעט על כל השאלות ששאלו גם אם זה לקח את כל השיעור, התאמץ להסביר שוב ושוב עד שמובן. התייחס לכולם בצורה מכבדת ועניינית. חשוב לו שנבין ושנלמד.\n\nשם המתרגל/ת: חנה\nחוות דעת - תרגולים: \nתותחית ברמות שאי אפשר לתאר. מאוד מסודרת, כותבת פתרונות מלאים ומאוד מנומקים, אחרי כל תרגיל מסכמת מה כדאי לזכור ממנו. מתקדמת די מהר, לרוב מצליחה לסיים את השאלות בזמן ולפעמים אפילו לפני הזמן. מאוד ממליץ.\nבנוסף חייב להמליץ גם על אסף ונווה - שניהם ממש תותחים, באופן כללי המתרגלים בקורס ברמה מאוד גבוהה.\n\nשעורי הבית: \nכל שבוע אבל הם לא נוראיים. השאלות הרעות לרוב מרופרנסות או שאפשר למצוא פתרון באינטרנט. אבל רוב הגליונות לקחו לי ערב לסיים.\n\nהמבחן: \nהוגן, מה שאי אפשר להגיד על מבחנים של יוחאי.\n\nהשורה התחתונה: \nלדעתי קורס במתכונת החדשה עדיף: אמנם הוסיפו חומר אבל הורידו את הפדנטיות המיותרת של יוחאי, הקורס עכשיו הרבה יותר הסתברות מאשר אינפי 2. גם החומר שהוסיפו נחמד ולא מאוד קשה אחרי שתופסים על מה מדובר.", "timestamp": 1644847291153}, {"author": "ע'", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: \nממש נהנתי אצל אביתר בהרצאות.\nהוא נותן מוטיבציות ודוגמאות לכל נושא והכניס חומר חדש ומעניין לקורס.\nממש מתחשב ומסביר דברים לעומק עד שכולם מבינים.\nהוא מלמד מהר אבל בסוף נשאר הרבה זמן שהוא פותר תרגילים וזה ממש שווה את זה.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים:\nמתרגלת מעולה. אחת הטובות שראיתי בטכניון. מסבירה הכל לפרטי פרטים ונותנת דרכים שונות לפתרון תרגילים. \n\nשעורי הבית:\nתקפים.\nגיליון באורך סביר כל שבוע.\nברמה של המבחן.\n\nהמבחן: \nסביר והוגן  אבל מאוד מוזר, כי 40% מהמבחן היה קומבי ובאמת שווה ללמוד קומבי ולא לבוא חלוד.\nכדאי גם להשקיע בלהבין את ההגדרות השונות של ההתכנסויות.\n\nהשורה התחתונה:\nקורס מעניין וחשוב להמשך התואר של מדמחיסטים", "timestamp": 1645026260718}, {"author": "Ziv Mor", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: רוב הסמסטר לא אהב אותו, אני מסמפט אותו. ההרצאות נעימות, אביתר לא לוקח את עצמו יותר מידי ברצינות. בלימודים: לא למסכמים כרוניים. כותב מעט מאוד על הלוח ואם לא עוקבים אחרי כל מילה שהוא אומר מאבדים אותו בקלות. משתמש בסימונים קצת שונים ממה שרגילים אליהם באינפי אבל זה כולה סימונים לא צריך לחטוף שבץ על זה.\n\nשם המתרגל/ת: חנה מטטוב\nחוות דעת - תרגולים: אחלה חנה. מסבירה מעולה ואכפתית. רוצו לראות.\n\nשעורי הבית: כל שבוע ברמה משתנה. לפעמיים שעתיים עבודה, לפעמים 8. לרוב יש רפרנסים.\n\nהמבחן: לא קל, כן הוגן\n\nהשורה התחתונה: זה לא שיש לכן ברירה אבל לא להיבהל", "timestamp": 1645342253954}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: מזעזע, לא מובן, מבולגן\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: הצילה לי את הסמסטר, מתרגלת מצוינת\n\nשעורי הבית: גיליון בשבוע, לפעמים קליל לפעמים מתיש\n\nהמבחן: הוגן באופן מפתיע\n\nהשורה התחתונה: אביתר לא מרצה טוב בכלל בעיניי, כל שאר הקורס בסדר", "timestamp": 1645352861847}, {"author": "לארה", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביתר פרוקצה\nחוות דעת - הרצאות: נכחתי בכל ההרצאות בזום החומר היה מעניין, אך אי אפשר היה להתעלם מכישורי הצילום המדהימים של הבחור שאחז בשלט, הרגשתי לא רק כאילו הייתי בהרצאה אלא כאילו אני הייתי המרצה עצמו.\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: בסדר סך הכל.\n\nשעורי הבית: קלילים, לא עמוסים\n\nהמבחן: המבחן לא כלל שום דבר שלמדנו אחרי שבוע 5, ואני סתם משנן את משפט פאטו.\n\nהשורה התחתונה: אחלה קורס, זה לא שיש לכם ברירה.", "timestamp": 1645368677927}, {"author": "צפרדע אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: \nאביתר לא מרצה מסודר. ההרצאות שלו די מבולגנות וכדי להבין את החומר, הייתי צריך לשבת בערך כשעה אחרי ההרצאה ושעה לפני ההרצאה הבאה, כדי להפנים את מה שהוא אומר, מאוד לא פשוט. הרבה התייאשו באמצע הקורס ועברו להקלטות של יוחאי. בסוף הסמסטר, אביתר הוסיף חומר חדש לקורס, מזכיר קצת אינפי, ולמי שאוהב זה ממש נחמד. החומר יחסית טכני (כמו אינפי, צריך לתרגל מלא עד שנהייה טכני) אבל סביר לחלוטין ולדעתי הופך את הקורס למעניין מאוד. סה\"כ הוא לא המרצה הכי טוב שיש אבל עצם ההתמודדות העצמית עם הבנת ההרצאות שלו, עזרה לי מאוד להבין את הקורס ואפשר לומר שאפילו נהניתי. \n\n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: \nמדהים עם הסתייגות קלה. עזרה לי מאוד בהבנת הנושאים הראשונים, שבהם אביתר בלבל וסיבך וזה מאוד פישט הכל. זה עזר לי להתמודד עם תרגילי הבית וזה היה מדהים. הילה עזרה מאוד בחלק הראשון של הקורס (החלק המקורי) אך כשאביתר הוסיף חומר נוסף, אפשר היה לראות שהיא קצת מסתבכת איתו (ומי לא, זה בכל זאת לא חומר פשוט) אבל בסה\"כ, בזכותה לא הייתי מגיע עם הבנה מלאה בסוף הסמסטר.\n\nשעורי הבית: גיליון פעם בשבוע, לא נוראי, אפשר גם לרפרנס (חוץ מהגיליונות על החומר החדש אבל רובם בסגנון הדברים שאביתר עושה בהרצאות, אז אפשר לסיים אותו אחרי שעתיים-שלוש).\n\nהמבחן: הוגן עד כדי מאוד. אפשר לומר הרבה על אביתר, אבל הוא יצא הוגן מאוד בבחינה. כן, מודה שזה היה מוזר שהיה 3 שאלות מהשלושה שבועות הראשונים של הסמסטר, שאלה מסכמת אחת בחומר המקורי של הקורס ועוד שאלה אחת בחומר החדש ואכן הורגשה חוסר פרופורציה במבחן בנוגע לחומר הנשאל. חוץ מזה, זה כלל את כל הטריקים שאביתר אוהב והוא לא הביא שום דבר שלא ראינו קודם, אפשר היה לגמרי לדעת למה לצפות.\n\nהשורה התחתונה: קורס מעניין, שנאתי הסתברות בכל אינטרקציה שהייתה לי איתה טרם הקורס וקיבלתי נקודת מבט מעניינת. מאוד אהבתי את החומר החדש, לא להירתע ממנו גם אם אין מאיפה לתרגל- זה מאוד מוסיף לקורס.", "timestamp": 1645369667596}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: \nאחד המרצים היותר טובים שראיתי.\nהאווירה קלילה ויש לו חוש הומור טוב.\nהוא מעביר את ההרצאות באופן מאוד חווייתי עם דוגמאות מציאותיות, לא כמו מרצה רגיל. לא יודע אם זה מתאים לכל אחד אבל אני ממש נהנתי.\nמאוד חשוב לו שכולם יבינו.\nאני חושב שבהרצאה שלו צריך לשבת, ליהנות ולעקוב אחרי ההסברים שלו ופחות לנסות להבין את הכתב שלו כי זה מייגע וחבל.\n \nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nפשוט תותחית, מסבירה כל צעד שהיא עושה ועדיין מספיקה כמעט תמיד את כל התרגילים. מתקדמת בקצב אידיאלי.\n\nשעורי הבית: \nגיליון תקף כל שבוע, לא קשה מדי.\nהבדיקה מקלה.\n\nהמבחן: \nממש סביר, בא לבדוק הבנה בהסתברות ולא אינפי.\nאין יותר מדי התחכמויות ולא מחפשים להכשיל.\n\nהשורה התחתונה: \nקורס מתמטי עם אופי יותר פרקטי.\nאפשר ליהנות ממנו גם אם לא הכי אהבתם אינפי.", "timestamp": 1645429993811}, {"author": "פוקא'צה עם רוזמרין", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביתר פרוקאצ'ה\nחוות דעת - הרצאות: הצטפתי להרצאות של אביתר לקראת אמצע הקורס, עד אז ראיתי הקלטות של אבנר מתעו\"ן שאני ממליץ מאוד לעשות. אביתר מרצה בסדר סך הכל, לעיתים הוא מסביר קצת לא ברור וזה גורר הרבה שאלות, אבל הוא עונה לכולן בכבוד אז זה משהו. מרצה סבבה.\n\nשם המתרגל/ת: מרצה פנופטו + אסף גנדלר\nחוות דעת - תרגולים: המרצה בפנופטו מטורף!!!!! כל מה שהוא מעביר שחופף עם הקורס שלכם תראו אצלו, הוא באמת ברמה אחרת. אסף גם מקסים, הוא הסביר את החומר החדש בצורה יסודית וניכר שהוא לקח את הזמן להבין אותו ליסוד כי הוא גם נתן אינטואיציות שעזרו ללמוד.\n\nשעורי הבית: 12 גיליונות שמתוכם צריך להגיש לפחות 10, הקושי משתנה, בגדול הם לא מסובכים מדיי, אבל אם עושים אותם בצורה יסודית ולא מעתיקים הם יקחו לכם כמה שעות.\n\nהמבחן: \nהמבחן היה סטנדרטי לגמרי, שינו את הפורמט ככה שיש רק שאלות פתוחות והוכחות, רוב השאלות היו דברים שלמדנו בכיתה באופן ישיר, המבחן לא היה מפתיע אבל מצד שני לא קל לשחזר כל מיני דברים. מעט לחוץ בזמן. כל עוד אביתר מעביר את הקורס תחזרו טוב מאוד על קומבי גם! היה סעיף שלם שהוא פשוט שאלה בקומבי.\nהשורה התחתונה: \nקורס חובה, אם לא באים ראש בקיר אפשר לעבור אותו בכבוד. אם תבחרו להילחם במרצה הראשי ובגישה שלו יהיה לא להיט.", "timestamp": 1645569237225}, {"author": "ג'ייק", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "הקדמה: חשוב לציין שהמבנה של הקורס השתנה - גם מבחינת המיקוד שלו וגם מבחינת החומר של 2 השבועות האחרונים בקורס. בעבר הקורס היה הרבה יותר חישובי ועכשיו הפך להיות הרבה יותר תיאורטי במידה מסוימת ומתבסס יותר על הבנת הסתברות ולא אינפי. בעיניי כל השינוי הזה הוא טוב ומוצלח.\nהבעיה המרכזית הסמסטר הייתה שלא היה תיאום טוב בין המרצה למתרגלים והייתה תחושת בלבול כללית לאורך כל הסמסטר שיצרה הרבה פאניקה מיותרת.\n\nשם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: אביתר אדם טוב, אבל לא מרצה טוב במיוחד. הרבה מההרצאות שלו הרגישו מאוד מבולגנות והיה קשה לעקוב. גם כשהוא ניסה לתת דוגמאות נוספות לרוב זה לא עזר. כן שווה להגיד שהוא העלה גם את רשימות ההרצאה שלו מראש והן התעדכנו כל הזמן - ממליץ להיות עם הרשימות בטאבלט/מחשב תוך כדי ההרצאה - מוריד את הלחץ של להבין מה הוא כותב בלוח וממש עוזר!\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מתרגלת מצוינת, רצה על החומר כדי להספיק אבל מצליחה להסביר כל דבר ולתת טיפים חשובים. כשזה הגיע לחומר האחרון שהיה חדש גם לה הרגיש שהיא קצת אבודה.\n\nשעורי הבית: גליון כל שבוע (היו 12), 10 עם ציון גבוה - תקפים. זמן גליון תלוי ברמת ההבנה שלכם ובגליון הספציפי - אצלי נע בין 4 שעות ליום וחצי.\n\nהמבחן: פעם ראשונה שהמבחן הפך להיות כולו פתוח ומדובר בהצלחה! כולנו ציפינו למבחן קשה מאוד, אבל הופתענו לגלות מבחן סך הכל הוגן עם ממוצע סביר. בדק באמת הבנה מעמיקה בהסתברות עצמה (ולא באינפי כמו בעבר, כן נדרש לא מעט קומבי). אם אתם עם אביתר, ממליץ מאוד לעבור על תרגילי הבית, התרגולים וההרצאות - המבחן היה מאוד ברוח הסמסטר.\n\nהשורה התחתונה: עמוס, בעיקר מבולבל ניהולית, אבל בסוף חומר מעניין ומבחן הוגן", "timestamp": 1645646292146}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: נוראי. לא יודע להעביר חומר או לעמוד מול קהל, מעביר תחושה שלא אכפת לו מהסטודנטים \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מדהימה. הסיבה היחידה שאיכהשהו הצלחתי להבין את החומר\n\nשעורי הבית: גליון כל שבוע, מסתכם ל10% תקף. ארוך. הסמסטר אביתר התערב והכניס אפילו יותר שאלות מהרגיל, כאילו זה הקורס היחיד שאנחנו צריכים לעשות.\n\nהמבחן: מועד א היה הוגן מאוד, ואז במועד ב וג הוא נכנס לקריזה. שאלות קשות ותלושות, וההיסטוגרמות בהתאם\n\nהשורה התחתונה: איכס.", "timestamp": 1650020717556}, {"author": "מרקוב", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: נוראי. אביתר מרצה גרוע כל כך שהוא הדוגמה המובהקת לבחור שמבין את החומר ולא יודע להעביר אותו. אביתר בעל כתב יד מזעזע ובמשך כל זמן ההרצאה רק מנסים לפענח את כתב החרטומים שלו. זאת ועוד, בגלל הקורונה, ניתנה האפשרות לגשת למועד ג' וממוצע הציון הסופי היה 50 לאחר 2 נק' פקטור. עשרות של נכשלים בגלל שגעון של מרצה *לא* אחראי. \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מצויינת. יודעת להסביר למופת ונקודת האור היחידה בקורס.\n\nשעורי הבית: ארוכים מסמסטרים אחרים. חשובים מאד כדי להבין את החומר לעומק ומקור טוב לתרגול עצמי, אך גם לפתור את כולם לבד לא עזר במיוחד במבחן.\n\nהמבחן: מועד א' הוגן, ב' ו-ג' לא הוגנים.\n\nהשורה התחתונה: אם יש אפשרות, למרות שהוא במומלצת - לא לקחת את הקורס אם מנוהל ע\"י אביתר. אזכיר גם פה שהוא מרצה נוראי. בהצלחה לכולם.", "timestamp": 1650368472725}, {"author": "ברנולי רביולי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: מאוד מבולגן, ברוב ההרצאות היה זורק לאוויר הגדרות בלי להסביר יותר מדי. בנוסף, בגלל שהסמסטר הסילבוס שונה ונלמד חומר שלא הועבר בשנים קודמות, לא הייתה אפשרות ללמוד מאף מקור אחר את הקורס. אביתר העלה אמנם רשימות מההרצאה, אבל הן היו פשוט בלתי קריאות (וזה עוד אחרי שבהרצאה אחת הוא השוויץ בזה שהוא יודע להשתמש בLyX טוב)\n\nשם המתרגל/ת: הילה מעיין/אסף גנדלר\nחוות דעת - תרגולים: הנקודות אור היחידות בקורס לפי דעתי.\nהילה הסבירה את החומר בצורה מעולה ועשתה המון סדר בבלאגן.\nאסף הקליט את התרגולים במהלך הסמסטר, ועל אף שהתרגולים שלו היו לטעמי פחות מוצלחים, הוא עדיין מתרגל מעולה וההקלטות בהחלט עזרו\n\nשעורי הבית: קשים על גבול הבלתי נסבלים. יוצא גיליון אחת לשבוע והיו גם גיליונות עם 7-8 שאלות לא קצרות בכלל. אמנם הגיליונות חשובים להטמעת החומר, אבל אל תרגישו רע אם אתם מגיעים למצב בו אתם צריכים לרפרנס. הרבה שאלות הרגישו יותר אינפי מהסתברות (הוכחות משפטים למינהם)\n\nהמבחן: הביזיון הכי גדול שראיתי. בתור התחלה הסמסטר לראשונה המבחן עבר למתכונת של שאלות פתוחות, אז לא היה כמעט מאיפה לתרגל שאלות כאלה למעט ממספר שאלות מצומצם מסמסטר קודם ועוד כמה מבחנים שאביתר כתב באנגלית, ואפילו לא פרסם פתרון.\nמועד א' של המבחן היה הוגן אמנם, אבל במועדי ב' וג' היו בשני המועדים ממוצעי 48 ו44 בטפסים עצמם. במועד ב' עוד ניתן פקטור של 10 נק',אבל במועד ג' הממוצע לאחר פקטור של 2(!!!) נק' היה 50.למעשה 60 אחוז ממי שניגש נכשל בקורס ויאלץ לחזור עליו.\nקיוויתי שלמדו לקח מסמסטר אביב הקודם, אבל נראה שלמרות שהפקולטה מודעת שזה המצב בקורס, לא נעשה אף שינוי.\n\nהשורה התחתונה: \nלמי שלומד הנדסת נתונים ומידע-זה אחד הקורסים היותר חשובים שיש במהלך התואר. הבעיה שהוא מנוהל בצורה זוועתית, עם מרצים מגלומנים שהקשר בינם לבין טובת הסטודנטים הוא בלתי תלוי. אין לי מה לומר חוץ מתחזיקו חזק ותקוו לטוב", "timestamp": 1650984573388}, {"author": "אורן יודע 150 ספרות של פאי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: אורן אח יקר, מרצה לבבי ועזבו שטויות הוא גילה את הפי\"מ!! תחשבו איזה מטורף זה. תשאלו אותו \"אורן בחיאאאאת אורן איך גילית?\" ותשמעו תשובות מרתקות. \nבנוסף אורן רשם פטנט בכוכב גזורפזורפ על כפכף לרגל עם שתי בהונות ככה שאם תתחברו אליו תקבלו אחוזים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחן מחר\nאורן תהיה אח אם אתה קורא את זזה תרחם עלי בבדיקה מסמן לך את המבחן שלי בסקיצה של כפכף עם שתי בהונות\n\nהשורה התחתונה:", "timestamp": 1658570921527}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: אורן לא המרצה הכי טוב בעולם, זה ניכר החל מההרצאה הראשונה. עם זאת אפשר להתרגל אליו, והוא לא כל כך גרוע אם נותנים לו צ'אנס ומתרגלים לסגנון שלו (למרות שלגמרי מובן אם לא מתחברים אליו). הבעיה היא שכל סמסטר חומר הקורס משתנה, ולכן הקלטות משנים קודמות לא בהכרח רלוונטיות (בעיקר בשבועות האחרונים של הקורס) אז יוצא שהמרצה הנוכחי הוא די ברירת המחדל.\n\nשם המתרגל/ת: נווה פורת\nחוות דעת - תרגולים: נווה מתרגל מדהים. שולט בחומר ברמה גבוהה וגם יודע להעביר אותו מעולה. האווירה אצלו בתרגולים מעולה וממש נהנתי ללמוד אצלו במשך הסמסטר.\n\nשעורי הבית: גיליון כל שבוע. הגיליונות כבדים ומתישים אבל חשובים כדי להטמיע את החומר. יש רפרנסים להרבה שאלות אבל מומלץ לנסות בכל זאת לפתור לבד.\n\nהמבחן: היה נוראי. המבחן שקיבלנו היה לא פתיר. מאז שהמבנה של המבחן שונה מ16 שאלות אמריקאיות לשאלות פתוחות הרמה די עלתה, אבל אורן החליט לשנות שוב את המבנה של המבחן ובחר 4 שאלות פתוחות עם 5 סעיפים כל אחד כשהם ברמת קושי עולה. המבחן היה קשה בהרבה מעבר למבחני עבר, וממש לא דומה להם בשום צורה. לא עזר יותר מדי שהמתרגלים הבטיחו לפני שלא יהיו שאלות עם הרבה אינפי במבחן, ואורן החליט לשים בכל זאת כמה. הקונצנזוס הכללי של הקורס היה שזה היה פשוט לא הוגן, לא מייצג את הקורס ולא באמת בודק את הידע והשליטה בהסתברות כמו שצריך.\n\nהשורה התחתונה: כמו שאפשר לקרוא ממשובים קודמים, הקורס מנוהל רע כבר כמה שנים וחבל שזה המצב ולא מטפלים בזה. כנראה שהשיטה היא מבחן מכשיל ופקטור בשביל לסנן תלונות עליו, וחבל שזאת הגישה של המרצים כי הסתברות זה באמת נושא מאוד מעניין וחשוב, ונהנתי ללמוד אותו במהלך הסמסטר. באופן כללי אם אתם לא מדמח או נתונים אל תתקרבו לקורס הזה, עדיף שתקחו הסתברות של חשמל או מתמטיקה. אם אתם מדמח או נתונים - שיהיה בהצלחה, אתם תצטרכו אותה.", "timestamp": 1659123755244}, {"author": "פיצול פואסון", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: לא מרצה מי יודע מה. אחרי 3 הרצאות בערך הבנתי שאני מבזבז את הזמן שלי על לבוא להרצאות שלו, ובמקום זה עברתי על הסיכומים שלו עבור ההרצאות. חוץ מזה שהיה איזה משהו קטן שהוא הוסיף לחומר, הכל נשאר אותו דבר, וזה הפך את ה-3 שעות הרצאה אצל אורן לחצי שעה, ובסופו של דבר זה לא שינה כלום אז ממליץ בחום.\n\nשם המתרגל/ת: חנה מטטוב\nחוות דעת - תרגולים: מעולה, ונותנת דגשים חשובים שלה עבור כל נושא בקורס, מה שעוזר באספקט הטכני של פתרון התרגילים.\n\nשעורי הבית: גיליון תקף כל שבוע. הגיליונות טיפה קשים אבל פתירים, ויש רפרנסים לרוב אבל ממליץ לנסות לשבת עליהם לבד.\n\nהמבחן: מזעזע. 4 שאלות כל אחת 5 סעיפים בדרגת קושי עולה. סעיפים א' ב' היו קלים ופתירים, סעיף ג' קשה ופתיר, אבל ד' ו-ה' בחלק מהשאלות היו מאתגרים בצורה קיצונית, ובחלק היו בלתי פתירים. לפחות הפקטור על המבחן נתן איזה 15-20 נקודות מה שהפך את הממוצע לסביר.\n\nהשורה התחתונה: הקורס יחסית טכני, ובעיקר דורש לזכור את ההגדרות הבסיסיות שלומדים בקורס ואת התכונות של ההתפלגויות השונות. השיעורי בית מעמיסים קצת על הסמסטר, אבל לא משהו נורא מדי.", "timestamp": 1659453604337}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורן ליאודור\nחוות דעת - הרצאות: אורן הוא לא מרצה מאוד טוב. ניכר שגאון אבל למרות שהוא מנסה הוא מתקשה להעביר את ההרצאות. מתלבט בינו לבין עצמו כל הזמן מה לומר, מה לכתוב על הלוח. לכן אין סדר בהרצאות למרות שהוא מנסה להיות מסודר. מאוד קשה להקשיב לו במשך 3 שעות בערב.\n\nשם המתרגל/ת: גילי בילואוס\nחוות דעת - תרגולים: מתרגלת טובה סך הכל. היא מתרגלת אחראית ויש תרגולים מוכנים מראש. רוב הזמן לא לאט מידי ולא מהר מידי ודואגת לתת אינטואיציה\n\nשעורי הבית: 12 גיליונות מתוכם צריך לעשות 10. בדרך כלל 6 תרגילים מתוכם 4 היו בסמסטרים קודמים ו2 חדשים. רוב התרגילים סבירים אבל אם יש משהו לא נורמלי חופשי לרפרנס\n\nהמבחן: חחח מבחן לא נורמלי. לא יודע מה אורן חשב כשהוא כתב אותו אבל הוא לא באותו ראש עם הסטודנטים בכלל. 4 שאלות מתוכם אחת לא פתירה בלי ידע של משהו ספציפי ועוד 3-4 סעיפים לא פתירים בשאלות אחרות. בסוף נתנו פקטור עצום כך שהציון יצא בסדר למי שלמד טוב. תזכרו שאם הולך לכם רע אולי הולך לכולם רע\n\nהשורה התחתונה: קורס לא קל, אני אישית חושב שרוב החומר מעניין, חבל שההרצאות היו כל כך משעממות", "timestamp": 1659518757805}, {"author": "מג\"מ", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: עשר דקות לתוך ההרצאה הראשונה מבינים שאורן לא מרצה משהו. הרבה פעמים הוא לא בטוח בעצמו מה לומר ואיך להגדיר דברים, וזה לא בגלל שהוא לא יודע את החומר, אלא בעיקר בגלל שהוא פשוט לא טוב בלהרצות (למרות שניכר שהוא משתדל). בכל זאת אם ממש רוצים אפשר ללמוד מההרצאות שלו, אבל היו כאלה שגם פשוט קראו סיכומים וזה עבד להם אז תעשו מה שאתם רואים לנכון.\n\nשם המתרגל/ת: נווה\nחוות דעת - תרגולים: מלך. מתרגל מעולה וחד על החומר שיודע להסביר נהדר ולפשט כל קונספט מורכב. נותן אינטואיציה טובה לחומר ודואג לעבור בתחילת כל תרגול על התיאוריה לפני שקופצים לתרגילים. בלי קשר לזה בנאדם סופר נחמד ומתחשב שכיף ללמוד אצלו.\n\nשעורי הבית: היו 12 גיליונות לאורך הסמסטר. יש קשים יותר יש קשים פחות אבל רובם סהכ בסדר. לא כאלה קצרים אבל לא משהו יותר מדי נורא (נע בין 4 ל6 תרגילים). חשובים כדי להטמיע את החומר, לא מומלץ לרפרנס לדעתי למרות שיש הרבה רפרנסים.\n\nהמבחן: היה מבחן זוועה. אורן שינה את המבנה והחליט על 4 שאלות כשהסעיפים ברמת קושי עולה בכל שאלה. היה מבחן קשה מאוד שדרש היכרות עם הדקויות הכי איזוטריות של החומר, וזה לא היה דומה לאף מבחן עבר (לפחות לא כזה שראיתי, ועשיתי את רובם). בגלל זה היה פקטור ממש מפנק. הכפילו את הציון ב1.15 והוסיפו 10 נקודות, זה יוצא משהו כמו תוספת של 20 נקודות, אז הציון כן יצא סבבה בסוף למי שבאמת למד ובא מוכן למבחן סטנדרטי ולא לזוועה הזאת. בכל זאת צריך לחרוש, זה קורס מתמטי מורכב ודורש המון תרגול.\n\nהשורה התחתונה: אם אורן מעביר תקורס תהיו מוכנים למבחן קשוח ותקוו לפקטור. סהכ נהנתי מהקורס ואני חושב שהחומר כן מעניין וחשוב. בסוף בגלל הפקטור גם הציון יצא סבבה.", "timestamp": 1659544404276}, {"author": "תמיד עדיף רציף", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: ממש ניסיתי להגיע להרצאות ולהבין אבל פשוט לא הצלחתי, ההרצאות של אורן מאוד מבולגנות והתקשיתי להבין מה הולך בהן, אז ראיתי הקלטות של הסתברות ת' של אבנר הלוי (הוא הכי מושלם בארץ) ואני ממלית בחום.\n\nשם המתרגל/ת: נווה \nחוות דעת - תרגולים: אמאלה, באמת המתרגל הכי מלך בעולם, אין לי מילה אחת רעה להגיד עליו ובזכותו הבנתי את החומר בהסתברות. \n\nשעורי הבית: 12 גיליונות ארוכים מאוד ומאוד חשובים לצורך ההבנה של החומר בהסתברות, ממליץ לעשות את כולם ולהילחם עליהם, אבל לא להימנע משימוש ברפרנסים כי הם הצילו איזה 95 אחוזים מהסטודנטים.\n\nהמבחן:  זה פשוט היה ביזיון אחד גדול, מבחן עם 4 שאלות וחמישה סעיפים בכל שאלה כאשר רמת הקושי עולה עם העלייה במספר הסעיף. המבחן מלא בטריקים ברמה הכי גבוהה שיש, התפרס על אולי 20 אחוזים מהחומר בהסתברות והממוצע בהתאם - 46 על טופס הבחינה, ניתן על הבחינה הזו פקטור עצום (ציון הבחינה*1.15 + 10). הטיפ שלי לבחינה הזאת - להגיע למלחמה ולנסות למצות את כל הסעיפים ברמת הקושי הסבירה.\n\nהשורה התחתונה: קורס מעניין, צוות מתרגלים מעולה, ממליץ לוותר על הרצאות פרונטליות (אנשים שדיברתי איתם שהיו בהרצאות לאורך כל הסמסטר אומרים שזה לא עזר בדבר).", "timestamp": 1659711459992}, {"author": "ניק", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: כאדם אורן אדם ממש נחמד, והוא לא פוץ כמו מרצים אחרים. היחס ממנו ממש טוב ובשעת הקבלה הוא ממש נחמד ומנסה שתבין את החומר.\nמבחינת ההרצאות הוא לא מובן, לא באמת אפשרי להבין אותו. אם הולכים אליו בהפסקה הוא מנסה לגרום לך להבין את החומר, אבל ממש מיותר. יש לו רשימות שהוא מפרסם שאפשר להבין את החומר מהם פחות או יותר - ויתרתי באמצע והסתכלתי נטו על הרשימות שלו ועל התרגולים.\n\nשם המתרגל/ת: אסף/נווה\nחוות דעת - תרגולים:  שניהם ממש מלכים. מומלץ בחום להגיע לשעת הקבלה של אסף עם שאלות שלא הצלחתם לפתור מהש.ב כי הוא יפתור אותם איתכם פחות או יותר.\nנווה קצת יותר קשוח ולא ייתן לכם את התשובה - אבל שניהם מעבירים את החומר בצורה מעולה כולל אינטואציות וכאלה. באמת שהמתרגלים הכי טובים שהיו לי בתואר\n\nשעורי הבית: \nקצת קשים, הם משתדלים להמציא שאלה פעם בגיליון כדי שלא הכל ירופרנס. שווה לנסות לשבור קצת את הראש ולהבין לפני שמרפרנסים - הם הכנה טובה למבחן\nהמבחן: \nמה עוד ניתן להגיד על המבחנים של אורן שלא נאמר כבר? המבחנים לא אנושיים אבל הפקטור מחזיר את הממוצע לנורמלי פחות או יותר. שווה לא לוותר על אף סעיף כי הם בודקים בצורה קלילה ונותנים פקטור מפנק\nהשורה התחתונה: \nכל מה שקשור לאורן (השאלות במבחן וההרצאה) להתרחק\nכל מה שקשור למתרגלים ממש מעולה.", "timestamp": 1665737630796}, {"author": "Aviel Kapchits", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: הוא כתב תימלול של ההרצאות והעלה אותו בכתב יד לפני כל הרצאה. התימלול זהה לחלוטין להרצאה, ולמרות כתב היד המסובך שלו הוא הרצה בקצב יחסית איטי ככה שבהרצאות פשוט קראתי את התימלול ולרוב יצאתי שעה לפני סוף ההרצאה לפחות. לרוב הוא היה מעלה את אותו הסיכום מוקלד שבועיים אחרי ההרצאה, ככה שלקראת המבחן אפשר ללמוד במוקלד. \n\nשם המתרגל/ת: נווה\nחוות דעת - תרגולים: נהדרים. היה מסביר הכל בצורה טובה וברורה, הייתה אווירה נחמדה בשיעורים והוא עודד השתתפות, שאלות והבנה אמיתית של החומר. בשיעור האחרון מקבלים עוגיות:)\n\nשעורי הבית: ברמה של מבחן ונותנים תירגול טוב, יש רפרנסים זמינים לרוב אבל שווה לנסות לפתור הכל לבד ולהשתמש ברפרנסים רק במקרה של אי הצלחה בשאלה מסוימת או חוסר זמן. יש גיליון לשבוע כאשר כל גיליון כלל 5-6 שאלות, בדרגת קושי עולה. \n\nהמבחן: היה יחסית קשה, דורש לימוד טוב של הפורמליקה שלא עוברים עליו מספיק בתרגילי הבית (לימוד טוב יכול לחסוך זמן במבחן, להרגשתי). היה פקטור נדיב כך שלרוב המבחן אמור להיות קל יותר מאשר המועד הנוכחי. ניתן ללמוד רק מהתרגולים, שמסוכמים בצורה ברורה ונוחה באתר הקורס. \n\nהשורה התחתונה: קורס מעניין, עם סגל שמשקיע יחסית (אולי זה קשור לזה שהוא לא מטעם הפקולטה למדמ\"ח...). דורש הרבה עבודה בשביל באמת ללמוד, אבל זה ידע שימושי בעיני בהרבה תחומים.", "timestamp": 1666426454637}, {"author": "שישקבב", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: \nאלוהים ישמור, רק מוקלט של יוחאי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nסבבה סהכ\nהמבחן: \nהמבחן קשה רצח ודי בלתי פתיר במסגרת הזמן אבל זה היה ידוע מראש ולכן פקטרו בהתאם ובנדיבות, סה״כ בסדר\nהשורה התחתונה: קורס נחמד", "timestamp": 1667130884348}, {"author": "No one", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: יש לו כוונות טובות, ומרגישים שאכפת לו מהסטודנטים. מתעכב על שאלות של סטודנטים, וכתוצאה מכך די קל לאבד אותו. החומר לא קל ולא מועבר בצורה הכי מוצלחת, אבל אם עוברים על ההרצאות שוב (וחשוב לעבור) ומגיעים לשעות קבלה, הכל מסתדר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מסודרים וחשובים. \n\nשעורי הבית: חשוב לפתור. לוקחים מחצי עד יום וחצי כתלות בקצב האישי שלכם. \n\nהמבחן: המבחנים של אביתר הסמסטר היו הוגנים, ומועד א' היה קל. צריך להשקיע בהרצאות, תרגולים ות\"ב. במועד א הוא אשכרה הביא שאלות שלמות שהיו העתק הדבק מהתרגולים, ת\"ב והדוגמאות שהוא עשה בכיתה.\n\nהשורה התחתונה: אם אביתר הוא המרצה, כנראה שתצטרכו להשקיע יותר במהלך הסמסטר, אבל אם תשימו דגש על החומר המבחן יעבור בקלות. כמובן, אם יש לכם זמן תפתרו מבחני עבר של אביתר. בדיעבד לא הייתי מבזבז זמן על מבחני עבר של מרצים אחרים כי הסגנונים מאוד שונים.", "timestamp": 1667486270545}, {"author": "פרידמן", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביתר פרוקצה\nחוות דעת - הרצאות: לא משהו. אבל אצלנו הוא היה המרצה היחיד ואין הקלטות. אפשר להבין מלקרוא את הסיכום וזהו.\n\nשם המתרגל/ת: ניתאי סוויסה\nחוות דעת - תרגולים: אחלה, ממש נחמד. התרגולים ממש חשובים להבין את החומר ועיקר הקורס זה בהם.\n\nשעורי הבית: גיליון פעם בשבוע. כמה שעות כל פעם. לפעמים ובעיקר בהתחלה ממש ארוך בהמשך בדרל כלל לא נורא.\n\nהמבחן: לא פשוט. צריך להתכונן טוב בעיקר על החלק האחרון של הקורס. לבוא מוכנים מאוד כי בוחנים הבנה של החומר.\n\nהשורה התחתונה: מל״ג מומלץ", "timestamp": 1676035472278}, {"author": "גאמא", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nמאיפה מתחילים בכלל? איך אעביר את המסר כדי שתבינו שמדובר במרצה שהוא לא רק בעל יכולת פדגוגית שאינה קיימת אלא גם בן אדם לא הוגן?\n\nכבר מההרצאה הראשונה ידעתי. ידעתי שמדובר במרצה שהולך למרר לי את הסמסטר. בנוגע לכל נושא חשוב שאביתר מנסה ללמד, אתה שם לב שהוא מלמד אותו רק אחרי כמה שיעורים שמדברים עליו בתרגולים. למה? כי אביתר לא כותב כותרות, הוא לא כותב מסודר, כלומר אין שום כותרת \"טרנספורמציה\" / \"משתנים מקריים בלתי תלויים\", כל ההרצאה היא פשוט רצף של קשקושים לא ברורים על הלוח, בלי יכולת שלך הסטודנט להבין באיזה ציר זמן כרונולוגי אתה נמצא. אז מה קורה בפועל, איך משלימים את הפערים האלה? קל מאוד, הופכים את הקורס מ4 נק\"ז ל10 נק\"ז (לפחות במקרה שלי). מה שעשית היה לחזור על כל הרצאה שאביתר לימד באמצעות צפייה בהרצאה של מרצה אחר באותם נושאים של ההרצאה ש\"הועברה\" על ידי אביתר. כשהגענו כבר לאמצע הסמסטר הרגשתי אבוד לגמרי בחומר, ומה שקרה בפועל זה שהשקעתי כמו זמן לא פרופורציונלית על הקורס הזה רק בגלל מרצה גרוע (כל כך גרוע שהוא מקום שני מהסוף במשאל המרצה בכל הטכניון....). החומר לא קל מלכתחילה - זה נכון - אבל מרצה שהופך אותו לעוד יותר קשה בגלל רמת הוראה מזוויעה זה כבר באמת משהו אחר. בעקבות ההשקעה הבלתי פוסקת שלי להבין את נושאי הקורס לאורך הסמסטר ובמיוחד מאמצע הסמסטר כשאני קולט שאוטוטו המבחן ואני לא על החומר - אלגברה מודרנית דיי נזרקה לפח. שכחתי לציין שאביתר החליט להעלות את רמת הקושי של הקורס, זאת הייתה הודעת הפתיחה שלו אלינו בהרצאה הראשונה. לא הבנו אם זה אומר שרמת המבחן תעלה או שלא, מסתבר שכן, ובהרבה, למרות הממוצעים העלובים מהמסטרים הקודמים במקצוע הזה. על המבחן אפרט בהמשך. הדבר הכי נורא בקורס הזה לדעתי זה החומר החדש שאביתר הכניס - התכנסות של משתנים מקריים (בקיצור אינפי 2 על סטרואידים) ועוד כל מני דברים בתורת הקבוצות שלא הועברו אף פעם בקורס ואין עליהם כמעט מידע באינטרנט בעברית. יש באנגלית ומסתבר שזה חומר של קורסים מתקדמים בהסתברות ובחיים לא של קורס שהוא קורס ראשוני של סטודנטים בנושא הסתברות. אביתר הסביר את הנושא הזה בצורה הכי עלובה, בזיונית, גרועה, לא מלמדת, ואפשר לבחור עוד מילים שיתארו את החרפה הזו. חומר קשה מאוד, שמוסבר רק בשבועיים האחרונים של הקורס (!!!) והיה 32 אחוז (!!!) מהמבחן שלנו. אביתר אולי עשוי במהלך הסמסטר להרגיש לכם כ\"אדם חביב\", אבל כשתגיעו למבחן אתם תבינו עד כמה הוא לא אדם חביב ואפילו מגלומן. כל החביבות הזו לא שווה כלום כשהממוצע שלכם מונח על הכף.\n\nשם המתרגל/ת: הלכתי לשני מתרגלים/ות\nחוות דעת - תרגולים: \nלא אציין את שם המתרגלים/ות. אף אחד מהם לא באמת היה טוב בהסתברות - זאת האמת. שניהם הקריאו מדף ורואים שהם לא באמת חדים על החומר. זה היה נוף מאוד חריג בשבילי בטכניון, התרגלתי עד כה שהמתרגלים הם תותחים ויכולים לפתור הכל ולהסביר הכל בצורה מאוד מאוד טובה. אני חושב שהמתרגלים בקורס (אולי חוץ מ1-2) לא היו מקבלים יותר מ75 (עם פקטור) בבחינה של הקורס. היו שמועות שהמתרגלים הטובים בחרו לא לעבוד עם אביתר (מסיבות מובנות כאמור).\n\nשעורי הבית: \nמתישים. מאוד מאוד ארוכים. חלק מהגליונות היו פרויקטים של 10 (!!) שאלות. הם כן תרמו להבנה כי בסופו של דבר אתה חייב לעשות את זה, אבל היה מצב של עומס רציני בקורסים אחרים (מבני נתונים) שגרם לרפרנס כמה גליונות. לא יודע על מה דיבר הבחור הקודם פה בביקורת שהם לוקחים \"רק כמה שעות\", אל תאמינו לזה. \n\nהמבחן: \nידענו שתהיה שאלה אחת שתכיל שאלות אמריקאיות. אף אחד לא אמר לנו את הדבר הבא: השאלה האמריקאית הכילה 5 שאלות, ובנוגע לכל אחת מהן, אם אתה לא עונה נכון, מורידים לך 4 נקודות (!!). זאת אומרת השאלה הזאת יכולה להוריד לך 40 נקודות מהציון. המון המון אנשים, וגם אנשים שהיו ממש טובים על החומר לא קיבלנו עליה כמעט ניקוד בעקבות טעויות. חשוב לציין שלא נאמר לנו בשום שלב שזה יהיה הנוהל, ורק כשפתחתנו את דף הבחינה, בשיא הלחץ, אנחנו גילינו את זה. המון אנשים לא הבינו תכלס כמה יפגע בהם לנחש בשאלה הזאת וספגו פגיעה קשה בציון שלהם בעקבות השאלה הזאת. בנוגע לשאר השאלות, שאלה אחת הייתה דומה לאחת מהשאלות מהגליון, אבל הבעיה היא שיש 12 גליונות כשכל אחד מהם מכיל בממוצע 8 שאלות. שאר השאלות היו קשות, יותר קשות ממה שהיה בשנה שעברה כשאביתר העביר את הקורס. חשוב לשים לב שהשאלות שיש במבחנים של אביתר מטקסס לא דומות בשום צורה ברמת הקושי שלהם למה שתפגשו בקורס. ניכר שבאמת הועלתה הרמה של הקורס, שגם ככה קשה מבחינה מחשבתית, הקורס נהיה קשה יותר, הגליונות נהיו ארוכים יותר, והמבחן נהיה קשה יותר. כמובן גם המרצה גרוע אז זה מה שהופך את זה לפשוט שילוב קטלני שיצרוך לכם כמות שעות אדירה מהמערכת.\n\nהשורה התחתונה: המרצה הכי גרוע שהיה אי פעם בטכניון ובנוסף בן אדם לא הגון שמשיקולים מגלומניים (בואו נעשה תוחלת 0 לכמות הנקודות שסטודנט יכול לצבור בעקבות ניחוש בשאלות אמריקאיות מה שלא עושים באף קורס אבל אני אעשה כי אני מבין בהסתברות ולא אתן לסטודנטים הקטנים האלה לקבל נקודות שלא מגיעות להם!) שם שאלות בבחינה שיכולות להזיק לציון שלך בצורה קיצונית - וזאת בלי שום הודעה מראש על השאלה הזאת! בקיצור, אין תקווה. אולי עדיף לשקול לעשות את הקורס באביב כשאורן לואידור מעביר אותו, למרות ששמעתי שגם הוא צרה.", "timestamp": 1676053842092}, {"author": "כריס", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: סה\"כ מעביר את החומר כמו שצריך באופן מובן, תמיד יש אווירה טובה בהרצאות, אם באים מרוכזים ועוקבים אחרי כל מה שהוא כותב על הלוח מבינים הכל ומרגישים ניצול יעיל של הזמן. \n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: סה\"כ הייתה בסדר, הסבירה כמו שצריך והספיקה הכל. תמיד אבל בתחילת תרגול יחסית מתעכבת על חזרה על החומר התאורטי שהועבר בהרצאות ככה שאפשר לאבד ריכוז מהר. \n\nשעורי הבית: לפעמים חתיכת תיק, במיוחד שהם שבועיים, אבל בסופו של דבר הם הדרך היחידה להבין ולהטמיע את החומר ובמיוחד הדרך היחידה להצליח במבחן עם כמות כזו של חומר לא קל. כדאי לקבוע זמן קבוע במהלך השבוע לשבת עליהם, לרוב גיליון לא לוקח יותר מארבע חמש שעות. ממליץ מאוד לעשות אותם כמו שצריך לפחות עד שבוע 12/13 תוך כדי מעבר על התרגולים הרלוונטיים לאותו גיליון.\n\nהמבחן: הבעיה היחידה שמוציאה שם רע לקורס הזה. ביחס למבחנים קודמים שאביתר כתב, לא היה קל בכלל ותחת הדרישה של הזמן המבחן כמעט בלתי אפשרי. \n\nהשורה התחתונה: סה\"כ חומר מאוד מעניין ומהנה לדעתי, כמו רוב הקורסים ההנאה והעניין יכולים לבוא עליך בהפוכה במבחן. לעקוב אחרי ההרצאות, התרגולים והגיליונות ויהיה בסדר.", "timestamp": 1676378778911}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nאין מספיק מילים בשביל לתאר כמה המרצה הזה לא יודע ללמד, ולא מתחשב בסטודנטים. הכתב שלו נוראי, לצערכם אין ממש מה לעשות עם זה, תנסו אולי לשבת מקדימה. כל הרצאה מחדש הוא בא עם טוש שלא כותב וחושב שזה מצחיק.\nהיה לנו איזור שממנו לא רואים את החלק של הלוח, סטודנטים עדיין חייבים לשבת שם כי רוב הזמן האולם מלא, מאחר ולצערנו אין אופציה למרצה אחר, יש שינוי בחומר, אז חייבים להיות נוכחים, ולמרות שביקשנו ממנו לא לכתוב באזור הזה , הוא תמיד היה כותב שם ( כי לא אכפת לו).\nהיה לי בעיה רפואית במהלך הסמסטר, שלא הייתי יכול לקום מהמיטה, נסיתי לבקש ממנו לפתוח זום, והוא בתגובה:\n\"אתה יכול לנסות להגיע בכיסא גלגלים , ברכבת יש אנשים שעוזרים, ולבקש מהטכניון עזרה עם הנגישות, אבל זה לא רעיון ממש אופטימלי\" - באמת שהייתי סותם את הפה ולא אומר דבר כזה, הרגשתי כל כך נורא בכלל שהוא אמר דבר כזה.\nאני מקווה שהבנתם את הרעיון.\n\n\n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: \nשגב מתרגל טוב, אבל עצלן - גם לו, כנראה שלא תופתעו, לא אכפת מהסטודנטים.\nנסיתי לתפוס אותו לשעת קבלה , בשביל לנסות להבין את החומר, ורק בשבוע 6 של הסמסטר הצלחתי.\nכל פעם היה נותן תירוץ אחר.\nהתירוץ שלו העיקרי זה לגבי המייל שלו - עצה שלי - תשלחו לשני המיילים, ככה לא יהיה מה לתרץ לכם ( עשיתי את זה אבל עדיין ענה לי אחרי שבועיים).\n\n\nשעורי הבית: \nשיעורי בית רלוונטים להבנת החומר וחשובים, אבל הם מגזימים עם כמות השאלות, ובכלל לא מתחשבים בסטודנטים ( כרגיל).\nבממוצע היה 8 שאלות לתרגיל בית, שצריך להגיש תוך שבוע.\nביקשנו לרוב הערכה בגלל כמות הגדולה של השאלות, אבל כמובן, שלא נתנו, והעדיפו שסטודנטים יעתיקו. (רוב הסטודנטים זה מה שהם עשו, לי היה סמסטר יחסית סבבה ולא עמוס ,  אז כן הספקתי לפתור)\n\n\n\nהמבחן: אם כל מה שתיארתי עד עכשיו היה נורא, אז המבחן עוד יותר.\nאם אתם לומדים עם אביתר, לפתור את המבחנים שלו באנגלית , זה כמו לא לעשות כלום, כי אין באמת דימיון. המבחן שלנו הסמסטר , בכלל לא היה דומה ברמת קושי לסמסטרים קודמים, הייתה שאלה על גרפים, שהיא בכלל לא קדם לקורס, ויש כאלה שלא הבינו מה באמת רוצים, או איך ממש לחשב.\nשאלה אמריקאית נוראית, שאם טועים יורדים לכם 4 נקודות, ואם צודקים מקבלים 4, כלומר אפשר לקבל בין מינוס 20 על התרגיל לבין 20. יותר מגעיל מזה לא ראיתי עדיין.\n\nהשורה התחתונה: \nאולי הייתי ממליץ לא להקשיב לסגל, שהטעה אותי ללמידה במבחן, שלפיו ( צריך לדעת להוכיח כל טענה מהתרגול, תרגילי בית, והרצאות ) ובכלל לא הייתה שאלה של הוכחה במבחן. סתם בזבז לי כמה ימים של למידה.\nובכלל , אם אתם עושים מבחנים , רק מחורף 2021 זה יהיה רלוונטי עבורכם. ( לפחות לחומר החדש שנוסף )", "timestamp": 1676808810419}, {"author": "די כבר", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: \nמאיפה להתחיל?\nקודם כל אגיד שזו הביקורת הראשונה שהרגשתי דחף לכתוב, באמת כשירות לציבור, וגם כפריקה.\nבתחילת הסמסטר הייתי תחת הרושם שאביתר אדם נחמד. בהתחלה היו בעיקר הגדרות ודברים שעוד איכשהו אינטואיטיבים, אז התעלמתי מכל נורות ההזהרה והתעקשתי שמי שמשקיע מספיק בקורס מצליח. בואו נגיד שהמחשבה הזו עברה לחלוטין כשנכשלתי במבחן. הכשלון הגיע למרות שהייתי יושבת וחורשת את ההרצאות, חוזרת על התרגולים, עושה שיעורי בית... הכל. באמת הכל. כל מה שעבד לי מעולה עד כה והביא אותי למאיות ול-99-יות בכל הקורסים המתמטים שאיכשהו קשורים למקצוע הזה.\nאביתר לא מוכן להתגמש מעבר למה שהוא רואה לנכון, וברוב הזמן, זה בסוף פוגע בכם.\nאין הקלטות כי הוא מאמין שככה הסטודנטים לא יגיעו, וכמובן לא משליך מהעובדה שסטודנטים לא מגיעים על כך שאולי הוא לא מלמד טוב.\nהיינו מתחננים שיפרט יותר ושיסביר יותר לעומק שלבים שהוא רשם על הלוח, אבל אביתר היה בטוח שמבחינתו הדברים שהוא רושם הם טריוויאלים, גם אם למדתם את ההגדרה הרלוונטית לפני חמש דקות. קשה מאוד להבין את ההרצאות שלו אלא אם התכוננתם מראש עם הרצאות של MIT, סיכום קודם, וכדומה. \nוהדובדבן שבקצפת, אביתר שינה את חומר הקורס. כך שכל מבחן עבר בערך לא הכין אותי לזוועות. איתי עוד אנשים שהצטיינו בסמסטרים קודמים, פשוט נפלנו כמו זבובים.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: אני אישית אהבתי. היא מסבירה בצורה שקצת מקרקעת את ההגדרות היבשות ואת הדיבור הזחוח של אביתר. \n\nשעורי הבית: לעיתים לא מרגישים בכלל קשורים לחומר ולעיתים בכלל לא נראה שהסגל עבר עליהם לפני שפרסם את הגליון. אבל, הם בערך הדרך היחידה להשאר על זה.\n\nהמבחן: \nוואו.\nקודם כל, בשאלה הראשונה היו חמישה היגדים שעליהם צריך לכתוב נכון/לא נכון. ההיגדים היו על שאלות הוכחה קשות ולא טריוויאליות, ככה שכבר הרעיון של לדחוף אותן לשאלה בפורמט כזה הוא הזוי בעיניי. על היגד שעליו עניתם נכון תקבלו 4 נקודות, אבל אם עניתם לא נכון, ירדו לכם 4 נקודות. כן כן, יכולתם לסיים את השאלה הזו במלואה ולהתחיל את המבחן מ-60. מהפחד עניתי רק על סעיפים שהצלחתי להוכיח, מה שהשאיר אותי עם חור ענק בציון כבר בהתחלה. כמובן, שאר הסעיפים היו או תלושים מהמציאות או שנאמרו מתישהו בכיתה, ואני ברוב טיפשותי לא שיננתי את כל הדוגמאות, כמו שטריוויאלי לעשות הרי בכל מקצוע, כי כמובן רק משינון של דוגמאות איזוטריות לומדים, לא ככה? וכן, יש קורסים שדורשים שינון, אבל יש הבדל עצום בין לשנן הוכחות כמו וויירשטראס והיינה לבין לזכור דוגמה סופר ספציפית שלא חזרה על עצמה בשום מקום אחר.\nשלוש השאלות הבאות היו עוד איכשהו הוגנות, אבל היו קשות בהרבה ממבחני עבר, ואחת מהן כללה גרפים - שאלה שהייתה קשה גם לאלו שכן עשו קומבי, וכמובן הייתה עוד יותר קשה לאלו שלא (למרות שעדיין אפשרית עבורם).\nהשאלה האחרונה כמובן גם היא הייתה על התכנסויות, החומר הכי קשה והכי לא מובן, והייתה תלושה ולא מחוברת לחלוטין לגליון או לכל דבר שיכולנו לתרגל ממנו.\nבקיצור, ובאמת שאין לי מילים להסביר כמה אני לא אומרת את זה לרוב - מבחן לא הוגן בכלל. בכלל בכלל. לעבור ולברוח.\n\nהשורה התחתונה: \nתאחזו חזק בסיכום טוב, תסכמו בעצמכם כל עוד תוכלו, תראו סרטונים מקדימים ותתכוננו כמה שאפשר. כל החומר שקשור להתכנסויות - פשוט תשננו כל מילה, כל דוגמה, כל שיט שנאמר בשיעורים, כי אם לא, תסיימו כמוני, סטודנטית שלרוב מצטיינת אבל כנראה לפי אביתר היא כושלת בהסתברות.", "timestamp": 1676842685641}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "בקצרה - מרצה לא טוב, מבחן מגעיל, פקטור לא מספיק גבוה.\n\nשם המרצה: אביתר (אין ברירה)\nחוות דעת - הרצאות: \nאביתר פשוט לא יודע ללמד, צריך יכולות על כדי לעקוב אחריו במהלך ההרצאות כי יש לו נטייה לא להסביר מעברים/חישובים ואז אחרי שהוא כותב על הלוח הוכחה לא ברורה נתקעים 10 דקות עם שאלות על מה שהוא כתב שם, כי גם הכתב וגם המעברים לא ברורים. באיזשהו שלב במהלך הסמסטר החלטתי לצפות בתרגולים המוקלטים של אותו שבוע לפני ההרצאות מה שעזר לי לעקוב אחריו במהלך ההרצאה אבל גם אז היה מאוד קשה להבין אותו. לא ברור מתי זאת הוכחה, מתי דוגמה מתי מתחילים נושא חדש. הכל מבולגן מאוד ולא ברור. \n\nשם המתרגל/ת: מוקלט של אסף גנדלר\nחוות דעת - תרגולים: \nהמתרגלים הסמסטר היו לא משהו ובנוסף כמו שכתבתי למעלה הבנתי שהדרך הכי יעילה להפיק משהו מההרצאות היא לצפות בתרגולים לפניהן. אז הפסקתי ללכת לפרונטליים ומצאתי תרגולים מוקלטים מחורף שעבר של אסף גנדלר שחופפים לסילבוס של אביתר. אסף מתרגל טוב והתרגולים שלו ממש עזרו לי להשאר על החומר במהלך הסמסטר.\n\nשעורי הבית: \nצריך להגיש 10 מתוך 12 גיליונות, בממוצע של 8 תרגילים לגיליון. סהכ הגיליונות הם 10% תקף. \nחלק מהתרגילים ממש מיותרים (הוכחה של משפט ההכלה וההדרה) וחלקם תרגילים חשובים שהיו במבחני עבר. זאת הדרך העיקרית להיות על החומר במהלך הסמסטר אבל בגלל שהגיליונות כל כך ארוכים כמעט בלתי אפשרי להצליח לפתור אותם בלי לרפרנס כי פשוט אין זמן. באופן אישי הגיליונות שניסיתי לפתור לבד עם מעט רפרנסים לקחו לי חצי יום עד יום עבודה בערך.\n\nהמבחן: \nמבחן מגעיל, כמו שפרטו בחוות דעת לפניי הייתה שאלה אמריקאית בקונספט מגעיל שכל טעות בה היא קנס כפול של הורדת נקודות. \nהייתה גם שאלה ממש קשה ולא סטנדרטית בנושא החדש של ההתכנסויות, שונה מכל מה שהיה במבחני עבר, גיליונות ותרגולים, לא ברור למה לשים דבר כזה.\nשאלה שלמה עסקה באיזה טריק איזוטרי שקשור לפונקציות יוצרות מומנטים.\nשאלה נוספת הסתמכה לא מעט על ידע קומבינטורי והייתה מסובכת ביחס לשאלות אינדיקטורים ממבחני עבר. \nסתם מבחן מגעיל ולא מאוזן מבחינת החומר שנשאל עליו. למי שתהה, קיבלנו רק 10 נקודות פקטור על הזוועה הזאת.\n\nהשורה התחתונה: \nבפירוט - סיימתי את הקורס הזה עם ציון טוב יחסית רק בזכות זה שלאורך כל הסמסטר בנוסף להרצאות של אביתר צפיתי גם במרצים מוקלטים אחרים על החומר של תחילת הקורס שיש בו חפיפה (אבנר של הסתברות ת). הקורס הזה גזל ממני כמות אדירה של זמן כי הייתי צריכה גם להגיע להרצאות כדי לא לפספס את הדברים החדשים של אביתר וגם לצפות בהרצאות אחרות כדי להבין מה קורה. פשוט סבל ובזבוז זמן אדיר.", "timestamp": 1676875891750}, {"author": "המילטון", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר פוקצ'ה\nחוות דעת - הרצאות: \nהמרצה לא טוב, כתב לא ברור+בלאגן+דילוג שלבים מובילים ביחד לחוסר הבנה. הבעיה היא שהוא שינה את הקורס שיתאים לו ולכן אין המון חומר אחר. למביני אנגלית ממליץ לעבוד עם הספר שהוא כתב, שמה הוא לפחות מוקלד וקצת בברור.\n\nשם המתרגל/ת: אנה זוצ'נקו + בוגדנוב\nחוות דעת - תרגולים: \nהייתי אצל שתיהם, שתיהם סבבה. ממליץ ללכת לכיתה הקטנה יותר כי ככה אפשר לשאול יותר שאלות.\n\nשעורי הבית: \nצריך לעשות עשרה גליונות (מ12) תקפים שכולם לוקחים זמן, צריך לפנות ערב\\ערב וחצי רק בשביל הסתברות (למי שפה אחרי שהסתכל על מבני, כן זה באמת לא הולך ביחד).\n\nהמבחן: \nצריך להיות ממששש חדים על החומר, במיוחד של השבועיים האחרונים. לעבור על מבחנים של אביתר (לשאר אין משמעות), אין הרבה כאלו אז תעברו על כל אחד טוב טוב.\n\nהשורה התחתונה: \nקורס רע, קשה וחובה, עוברים וממשיכים.", "timestamp": 1676884544740}, {"author": "Gilian Bensoussan", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: אני אישית התחברתי לאביתר ההרצאות שלו ברורות הוא לוקח זמן רב לענות לשאלות ולמרות זאות עומד בזמן. גם ככה אין מרצים אחרים אז כדאי להתחבר אליו כמה שיותר כדי שהסמסטר יהי הכי מוצלח שיש.\nרוב האנשים בקורס הגיעו עם דעה רעה עליו וסבלו כל הסמסטר.\n\nשם המתרגל/ת: ניתאי סוויסה\nחוות דעת - תרגולים: היה הסמסטר הראשון שלו כמתרגל ועדיין היה בא מוכן לתירגולים, מכיר טוב את החומר ומלמד בצורה ברורה. ממליץ \n\nשעורי הבית: ארוכים בטירוף איזה 8 שאלות כל שבוע וזה גם תקף. אך יש רפרנסים.\n\nהמבחן: חוץ משאלה אחד שהיה אמראיקאית עם ניקוד שלילי כלומר כל טעות מוריד לך 4+4 נקודות השאר היה יחסית סבגר שאלות דומות למבחני עבר שלו.\n\nהשורה התחתונה: הקורס הזה 4 נק''ז צריך להתייחס אליה בידיוק כמו אינפי 2 (יש גם חפיפות בחומר) זו קורס לא קל אבל אם אתם רציניים כל הסמסטר ותגיעיו להרצאות ולתירגולים אז יהי בסדר", "timestamp": 1676897117012}, {"author": "markov", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות:\nוואלה לא אשקר, אביתר מרצה די טוב ואדם נחמד שיודע להקליל את האווירה בהרצאות מה שדי עוזר בקורס כזה. אבל, יש שמועות די רעות עליו כמרצה שללא ספק השפיעו על איך כמה אנשים תפסו אותו כמרצה וזה היה ניכר. בסופו של יום לדעתי זה היה קורס מעניין מאוד וקורס די חשוב, אבל מה נעשה הקורס לא משחק ילדים והוא קשה. וזה מרגיש כאילו היה מאוד נוח להמון להפיל את זה על אביתר כי הוא המרצה היחיד. \nבסופו של דבר אביתר מרצה ממש סבבה והוא גם סיים את החומר שבוע מוקדם ותרגל שאלות ממבחנים מה שממש עזר להכנה למבחן בלי קשר לזה שיש לו סטייל מבחנים מאוד מובהק. אבל על זה יותר בהמשך.\n\nשם המתרגל/ת: אלי\nחוות דעת - תרגולים: \nמתרגל אחלה הוא הסביר את החומר כמו שצריך וזה ללא ספק עזר, והיה לתרגולים שלו ערך מוסף. דבר אחד שכן טיפה הפריע בהם זה שהם הרבה פעמים חרגו מהזמן הרגיל וזה היה טיפה לא נוחאבל בסך הכל מתרגל מומלץ מאוד.\n\nשעורי הבית: \nארוכים בטירוף והמון אבל יש רפרנסים ויש 2 שאפשר לא להגיש ווואלה טיפה מוגזמים אבל סך הכל לא כזה נורא.\n\nהמבחן: \nהמועד א שאותו עשיתי היה סך הכל סטנדרטי לגמרי של מבחני עבר של אביתר, כאילו אותו סטייל שאלות עם שינויים קטנים, שאלה 4 בתכלס הייתה שאלה ברמה של בגרות והייתה חביבה לגמרי. \nהקאץ היה שאלה 1 היה אפשר לקבל ניקוד שלילי אם טועים, אבל כשלוקחים בחשבון שהיה רק שתי אופציות של נכון לא נכון זה הגיוני במקום מסויים וזה חוסך פורמליות. יש לציין שאת 2 הסעיפים הראשונים היה ניתן לפתור די בקלות עם הדף התפלגויות והאחרים הופיעו בהרצאות.\nקיצר מבחן סבבה לגמרי שכן הייתה בו שאלה טריקית אבל לא מעבר.\n\nהשורה התחתונה: \nקורס חשוב ומעניין שעובר אחלה", "timestamp": 1676908996463}, {"author": "מעריץ של הסופר", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ׳ה\nחוות דעת - הרצאות: \nלא ממליץ.\nההרצאות קשות להבנה, כתב היד לא ברור, אין חומר עזר מוקלד.\nהפסקתי ללכת להרצאות, ולמדתי רק מהתרגולים, לא הרגשתי חסך / פער בהבנה ביחס לשאר החברים.\n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: \nממליץ. \nהתרגול באורך שעתיים ולכן מספיק גם לעבור ולהסביר את ההגדרות והמשפטים שנלמדו בכיתה, וגם לפתור את התרגילים ביחד עם הסטודנטים. \nמסודר ויסודי.\n\nשעורי הבית: \nקשוח. \nגליון כל שבוע, וגם הרבה שאלות הן ברמה גבוה/טריקיות מאוד, מרגיש קצת מנותק מהקורס ומהרמה של המבחנים.\nיש רפרנס. אם יש שאלה חדשה, כנראה שהיא מאחד המבחנים האחרונים. \nחשוב בכל זאת לנסות את השאלות הסבירות כדי להפנים את החומר.\n\nהמבחן: \nבעייתי.\nמורכב מ 5 שאלות. \nתמיד יש שאלה אחת על הנושא שלומדים בשבוע האחרון של הקורס שהוא שונה מאופי הקורס עד אז, ולכן מאוד קשה להצליח (פירוט בהמשך). בנוסף הסמסטר הייתה שאלה נוספת, שחלקה על אותו הנושא, ואפילו יכולה להקנות ניקוד שלילי.\n\nשאר המבחן (3 שאלות) בסך הכל הוגנות מינוס.\n\nהשורה התחתונה: \nלדעתי יש שני מכשולים בקורס: \n1) ההרצאות של אביתר, שקשה להבין אותן.\nלנסות למצוא את הדרך שעובדת בשבילכם להבין באמת את החומר, בשבילי התרגולים בלבד עזרו.\n\n2) בשבועיים האחרונים לומדים שני נושאים (התכנסויות של סדרות של מאורעות, התכנסות משתנים מקריים), שהם שונים מאופי הקורס והם לגמרי אינפי. אין כמעט איך לתרגל אותם (משום שהם חדשים בקורס), לא מספיקים להפנים אותם כי הם בסוף הסמסטר, וכל מבחן של אביתר יש שאלה על הנושא הזה. \nממליץ אולי לקחת שיעור פרטי בנושא אם הוא לא מופנם אצלכם עד הסוף.", "timestamp": 1677051543622}, {"author": "פואסון קולמוגורוב", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\n\nחוות דעת - הרצאות: \nאני יודע שאני בדעת מיעוט (אל תלחצו מהביקורות הרעות על הקורס!) אבל אביתר הוא מרצה מעולה. מסביר טוב ולעניין, נכון שלפעמים מעט לא ברור אבל לא יותר מאשר כל מרצה אחר בקורס מתמטי די מסובך. יענה לכם לכל שאלה שתשאלו ובסבלנות, ומבחינתו כמה שיותר שאלות יותר טוב. ישאר גם שעה ויותר אחרי ההרצאה אם צריך כדי להסביר דברים שלא היו מובנים לכם.\n\nשם המתרגל/ת: אלי בוגדנוב\nחוות דעת - תרגולים: אין מה לומר חוץ מזה שהוא המתרגל הכי טוב שהיה לי מכל הקורסים שלקחתי בטכניון ובכללי בנאדם זהב. לכו אליו!!! \n\nשעורי הבית: \nחשובים מאוד בשביל להבין את החומר ובמיוחד בשביל להגיע מוכנים בצורה סבירה לכמה ימים הבודדים שיהיו לכם ללמידה למבחן, אם אתם לוקחים את הקורס בסמסטר חורף.\n\nהמבחן: \nלא קל אבל לא הכי קשה, פשוט בודק הבנה טובה. בהחלט הוגן ברמת הקושי.\n\nהשורה התחתונה: \nקורס מעניין בטירוף עם הרבה נושאים מרתקים ומפתיעים, במיוחד למי שאוהב מתמטיקה (יותר לכיוון אינפי אבל עם עובדות משוגעות על החיים, במיוחד בחצי השני של הקורס).", "timestamp": 1677065655917}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nשיעורים מאוד מבולגנים וקשה מאוד לעקוב, אין חומר עזר מסודר, הרחיבו הרבה לפני. עם זאת, ההשחרה עליו קצת מוגזמת לדעתי, כמעט כל שיעור הוא נשאר עם סטודנטים ששאלו שאלות והגישה שלו היתה די טובה לסטודנטים. ברמה הפרקטית- הסתובב אצלנו בסמסטר סיכום הרצאות מוקלד. ממליצה להגיע איתו ולא להשקיע זמן בלהעתיק את הכתב הלא ברור של אביתר תוך כדי השיעור. זה גם יעשה לכם סדר כי אביתר לא מאמין בכותרות. תשקיעו את כל המאמצים בלהקשיב, עם הסיכום המוקלד זה יהיה הרבה יותר קל. אם אתם רואים שאתם בכל זאת לא מצליחים לעקוב, תשקלו לוותר ולהגיע לתרגולים בלבד, לא מעט סטודנטים עשו את זה.\n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: \nלמזלנו התרגולים ממש טובים, יש סיכום נוסחאות מסודר- עוברים עליו בתחילת כל תרגול ואז פותרים תרגילים, לא ברמה גבוהה ממש. תגיעו לתרגולים בריכוז שיא וזה יסדר אתכם. שגב מלך ואני ממליצה עליו ממש. הייתי גם אצל ניתאי איזה פעמיים והיה גם אחלה\n\nשעורי הבית: \nכמו שכתבו לפני, ארוכים ומציקים, לפעמים רמה גבוהה מדי ביחד למבחן ומרופרנסים ברובם. למרות העומס, ממליצה להשקיע בהם כי אחרת עם רמת ההרצאות ממש אפשר ללכת לאיבוד. אנחנו קבענו יום שני הסתברות ברזל ולא יצאנו מהספריה עד שסיימנו, לרב יום אחד מספיק, תלוי בקצב שלכם וגם כמה מהר אתם נכנעים לרפרנס.\n\nהמבחן: \nשאלה 1 עם הניקוד השלילי בזיונית והופתעתי שחוקית בכלל. שאלות 2-4 סבירות, אחת מהן ממש סבבה. בנוגע לשאלה 5- על החומר של השבועיים האחרונים. ממליצה לסמסטר הבא ללחוץ על אביתר שישחרר מבחנים נוספים לדוגמה בנושא. החומר הזה מועבר בשבועיים האחרונים, לא מתורגל כמו שצריך, אין אותו ממש במבחני עבר, והוא תפס איזה 40 אחוז מהמבחן.\n\nהשורה התחתונה: \nלא נהניתי :(\nאבל אל תילחצו מהביקורות, עם קצת יותר מאמץ מבקורס רגיל אפשר להצליח", "timestamp": 1677104661073}, {"author": "Markov", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: מרצה בסדר.. מצד אחד קצת מבולגן על הלוח ולא מסביר הכי טוב, מצד שני משתדל להסביר בכמה צורות ומנסה להבין את החסמים של הסטודנטים בהבנה.\nיש לקראת האמצע כמה נושאים שקצת קשה להבין בהתחלה, מה שלי היה בעיקר חסר זה המחשה ויזואלית של מה שאנחנו לומדים (מ\"מ, התפלגויות, שונות...). יש קורס מקביל ב - MIT עם סרטונים שפותרים את הבעיה הזאת.\nיש לאביתר רשימות בעברית בכתב יד (וגרסה מוקלדת בדרייב) ויש גם רשימות שלו באנגלית שהן מאוד מסודרות ומפורטות. ממליץ לבקש ממנו אותן ולהיעזר בהן.\nאביתר לא היה מוכן להקליט וגם לא היה מוכן שהמתרגלים יקליטו מתוך אמונה שהנוכחות בהרצאות תורמת להבנה. בגלל שבסמסטר שלנו ההרצאות יצאו רק על ראשון וחמישי, כאלה שלא יכלו להגיע לאחד מהם בכלל, דיברו איתו ומצאו פתרון. הנושאים האחרונים (התכנסויות משתנים מקריים) מכילים חומר חדש מתחום המחקר של אביתר. חלק מהחומר לא פשוט, מבלבל ודורש הבנה עמוקה. מציע להיות כמה שיותר על החומר לקראת הסוף ולנסות להבין בעזרת כל מקור מידע..\n\nשם המתרגל/ת: שגב שלומוב\nחוות דעת - תרגולים: מאוד טובים. מתחילים בחזרה על החומר ודגשים ואחר כך פתרון שאלות. שגב חזק בחומר, נותן אינטואיציה ודגשים ועונה על שאלות. יש כמה קטעים מבלבלים בקורס והתרגולים עזרו לעשות סדר.\n\nשעורי הבית: גיליון שבועי של כ - 8 שאלות.\nלרוב פתיר ודומה עד רמה מסוימת לתרגול. מאוד מומלץ לעשות ולא לרפרנס כדי להישאר על החומר. רוב החומר בנוי אחד על השני. אביתר משתדל להימנע מחישובים מורכבים עד כמה שאפשר אז רוב הש\"ב דורשים הבנה של החומר ולא חישובים ארוכים.\nאצלנו היה שבוע להגשה לכל גיליון.\n\nהמבחן: חוץ מהנושא של הורדה בניקוד על טעות בשאלה 1 שבטח כבר נכתב עליו, לדעתי היה מבחן יחסית הוגן.\nאביתר לא מרצה הרבה זמן בקורס ולכן הביא לנו לתרגל מבחנים שהוא כתב בארה\"ב.. תזהרו מזה, זה טוב לתרגול אבל זה לא אותו דבר כמו המבחנים שלו בטכניון.\nיש כמה דפוסים שחוזרים על עצמם כמעט כל מבחן (חישוב תוחלת מבוסס אינדיקטורים, חישוב ארוך של שונות, נוסחת ההחלקה...).\n\nהשורה התחתונה: החומר לדעתי מעניין ורלוונטי (יש כמה נושאים פרקטיים ממש). הסגל קשוח בנהלים מתוך רצון לשמור אותנו על החומר. קצת עמוס עם הגיליון השבועי ועם נושאים יותר קשים שדורשים חזרה על החומר.", "timestamp": 1677926282529}, {"author": "א.ב.", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: \nקשה. אביתר מנסה שיהיה מובן, אבל בפועל מאוד קשה לעקוב. השקעתי הרבה מעבר לשעות של ההרצאה כדי להבין את הקורס כמו שצריך. אבל ברור שאביתר אוהב את החומר, ולי אישית זה מוסיף המון.\n\nשם המתרגל/ת: אלי בוגדנוב\nחוות דעת - תרגולים:\nאלי משתדל לעבוד יחסית סכמטי - הוא לא נותן המון אינטואיציה, או שיטות מתוחכמות, אלא בעיקר מלמד איך לעבוד בצורות הכי קלאסיות, שאיתן פותרים את רוב התרגילים.\n\nשעורי הבית:\nיחסית עמוס וקשה.\n\nהמבחן:\nאני אישית הרגשתי שהמבחן הוגן - החומר של הקורס קשה, אבל מי שמבין יכול לעבור את המבחן בצורה טובה. אבל בהחלט היה מבחן קשה.\n\nהשורה התחתונה:\nקורס לא פשוט, אבל גם מעניין - מתחילים בדברים די טריוויאליים, ומגיעים לחומר הרבה יותר מורכב ומעניין.", "timestamp": 1678054235961}, {"author": "היה פה אסון", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביתר \nחוות דעת - הרצאות: אחלק את החווד לשתיים.\nאביתר המרצה - כל מה שנאמר לצערי נכון, אממה הוא בקיא מאוד בחומר.\nאבתיר הבן אדם - בעל תכונות שאביתר המרצה לא ניחן בהן. הוא סופר אדיב, שמח לענות על כל שאלה בסבלנות ובפירוט ומקצוען בתחומו.\n\nשם המתרגל/ת: תומר וולק\nחוות דעת - תרגולים: אני נהנתי. כל תרגול מחדש עשה ליסדר בנושאים של השתיים שלוש הרצאות האחרונות. לא עמוס מידי ולכן אפשר להשתתף בחופשיות ולקטוע לשאלות כשצריך והוא עונה בשמחה.\nנקודה לרעתו היא שרמת ההכנה שלו לתרגולים לא הייתה מספיק טובה, הרבה פעמים הרגיש שהוא פותר את השאלה תוך כדי. לקראת סוף הסמסטר הוא התחיל להתבלבל בפתרונות לעתים תכופות יותר ואז זה קצת העיב על התרגול וגרם לבלבול. בנוסף הוא קיים שעת קבלה מיד אחרי אז מי שיכול אני מליץ להשאר ולהעזר בו בשאלות קשות מהגליון או סתם דברים מההרצאה שלא היו ברורים. \n\nשעורי הבית: גליון בית שבועי עם ציון תקף. פיתרון השאלות שם עוזר מאוד להטמעה של החומר ולכן טוב לדעתי שחייבים לעשות. בנוסף חשוב מאוד לרשום תז בראש כל עמוד.\nבתחילת הסמסטר אביתר אמר שהוא מתכנן להעלות את הרמה בתרגילי הבית כדי להעלות את הממוצע במבחן. אני הרגשתי שהגלינויות היו הוגנים. כמו כן יום אחרי ההגשה היו עולים פתרונות.\n\nהמבחן: היה הוגן בסך הכל. התבסס בעיקר על החומר בחלק השני של הקורס עם הרבה מאוד דגש על הנושא של התכנסות סדרות מאורעות ומ\"מ. בגלל שהוא היה אחרון הוא לא תורגל הרבה ואני גם דילגתי על שני הגליונות האחרונים. זו הייתה טעות ואני לא ממליץ. בנוסף הבדיקה הייתה קשוחה מאוד, הכי קשוחה שנתקלתי בה עד כה. חשוב להיות מדויקים בתשובות.\n\nהשורה התחתונה: החומר ברובו מעניין אבל נהיה מורכב יותר ויותר ככל שמתקדם הסמסטר. חשוב להיות עם אצבע על הדופק ולא לזנוח אותו לרגע כדי להצליח.", "timestamp": 1678532017860}, {"author": "BaronCabbage", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: בתור בן אדם - הוא ממש נחמד אדיב וחברמן\nבתור מרצה - פחות התחברתי והייתי מוצא את עצמי אבוד כמעט כל הרצאה, העובדה שההרצאות היו בראשון וחמישי בלי בחירה וללא הקלטות זמינות לא באו לטובתינו בכלל. הכתב יד שלו לא ברור גם ברשימות וגם בכיתה, עדיף להסתמך על הסיכום המוקלד או על הדפי תרגול המוקלדים\n\nשם המתרגל/ת: ניסיתי את כולם חוץ משגב\nחוות דעת - תרגולים: מרגיש שכולם קוראים מהדף, לא באים מוכנים לשיעור מראש ופותרים את התרגילים איתנו במהלך השיעור, רובם כן בקיאים בחומר ולמעט בלבולים פה ושם כן מסתדרים בסוף. הדף של התרגול מפורסם אחרי התרגול וזה מעולה כי אפשר לעבור עליו אחרי שוב ולא צריך לכתוב\n\nשעורי הבית: כל יום ראשון בערב היה יוצא גיליון לשבוע אחד. בכל גיליון 8 שאלות בממוצע. לי אישית היה לוקח שעות להבין את החומר ולפתור את הגיליונות. עם זמן קצר והרבה שאלות זה היה יוצר דיי הרבה עומס במהלך השבוע והייתי מוצא את עצמימשקיע בזה יותר זמן מדברים אחרים\n\nהמבחן: הייתה שאלה של 20 נק' במתכונת סיבירית שרק דפקה את רוב הסטודנטים. כמעט חצי מבחן היה על החומר של התכנסויות - של השבוע האחרון בקורס שלא היה לו תרגול מתאים בכלל. יש בדרך כלל שאלה אחת שהיא בדיחה וכל השאר צריך להתאמץ ממש בשבילם.\nמבחני עבר של אורן לא היו רלוונטיים בכלל\nמבחני עבר של אביתר באנגלית מזמנו באוניברסיטה בטקסב הם ב30% מהרמה בעברית\nאז המבחנים היחידים שהיו רלוונטיים היו מלפני שנה כלומר רק 3 מבחנים סה״כ...\nחשוב גם לציין שזהו קורס של שנה שנייה עם ממוצע של קורס מסנן של שנה ראשונה.\n\nהשורה התחתונה: עוד בתיכון שנאתי הסתברות, דעתי על זה לא השתנתה ועדיין הוא קורס חובה אז לעבור ולשכוח מבחינתי", "timestamp": 1678658055552}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nלא ברור איך הוא מרצה אחראי בקורס אקדמי שמועבר במוסד שמכבד את עצמו. מקווה שהפקולטה ל\"קבלת החלטות\" תעשה בדק בית מעמיק ותקבל כמה החלטות קשות אחרי כל החרא שאכלנו ממנו הסמסטר ובמבחנים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nרוב המתרגלים מקריאים מדף התרגול, התרגולים הם הדבר היחיד שיכול לעזור להבין את החומר בקורס הזה, רק חבל שהתרגילים בהם לא מגרדים את הרמה של הגיליונות ובטח שלא את הרמה של המבחן.\n\nשעורי הבית: \nכל שבוע גיליון עמוס שלוקח הרבה יותר מידיי זמן. באינפי 2 לא הייתי צריכה להשקיע כל כך הרבה בתרגילי בית.\n\nהמבחן: \nבכל מועד אביתר השאיר \"הפתעות\" לא נעימות. \nהוא שם בשני המועדים שאלה אמריקאית שמורידה אקסטרה ניקוד, אף אחד לא הודיע לנו לפני מועד א שיהיה דבר כזה. \nבמועד ב הוא החליט פשוט להעלים חלק מהנוסחאות שהיו בדף נוסחאות שפורסם לנו לפני המבחן!!! \nנראה שהוא פשוט נהנה להתנהג בצורה לא הגונה ובא לרעת הסטודנטים בכל פרמטר אפשרי.\nהמבחנים היו קשים, הרבה יותר מהגיליונות, הרבה יותר מהתרגולים והרבה יותר מהמבחני בדיחה שהוא נתן לסטודנטים שלו באוניברסיטת טקסס.\n\nהשורה התחתונה: \nהחומר לא קל והמרצה פשוט מזעזע. לא רק מחוסר יכולות הוראה אלא גם בגלל התנהגות מחפירה ולא הגונה.", "timestamp": 1678709054747}, {"author": "צדיקה", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "אתחיל את הביקורת בברכת הודיה לה׳ שסיימתי עם העינוי השוודי הזה (באומץ רב כי רק הרגע יצאתי ממועד ב) : ברוך אתה ה אלוקינו מלך העולם שהחיינו וקיימנו והגיענו לזמן הזה!!!\n\nשם המרצה: פוקצ׳ה\nחוות דעת - הרצאות: מה לא נאמר על אביתר שלנו?\nיש הגורסים כי אביתר אדם טוב נחמד, מתחשב ורחב לב- לא יודעת מי האנשים האלה, לא שוללת את דעתם, אבל לא הרגשתי את זה בכלל. להפך. המון פעמים במהלך הרצאות הוא ענה בחוסר חשק לשאלות, לגלג על בקשות שלנו (כמו לא לכתוב בצל!), הוא היה מאוד נחוש לא להקליט, כי זה הרבה יותר נחמד שמעל מאה אנשים מצטופפים חנוקים בכיתה, ולקראת כל הרצאה עומד עדר של אנשים שנואשים לשבת בשורות הראשונות (שלא תטעו, גם אני לא תמימה קטנה, הייתי חלק מהעדר כי לצערי אי אפשר לשמוע משהו מהשורה החמישית ואחורה). בקיצור לא הייתי מתארת אותו כאדם מתחשב אבל שיהיה.\nנקודה לזכותו (כי אני לא ממש רעה), הוא היה די זמין רוב הסמסטר.\n\nשם המתרגל/ת: אלי בוגדנוב הנסיך\nחוות דעת - תרגולים: כמו שכבר כתבתי, אלי הוא נסיך. אף פעם לא נתקלתי במתרגל שכל כך אכפת לו מהסטודנטים. תמיד התעניין, תמיד וידא מולנו שהכל מובן, היה זמין לשאלות (בניגוד לרוב חברי הסגל). הוא עונה לשאלות של אנשים בחיוך ובסבלנות, ומסביר מעולה.\n\nשעורי הבית: גליון שבועי עם 8-10 שאלות בממוצע. חלקן מרופרנסות וחלקן לא. מאוד הקשה והעמיס במהלך הסמסטר…. המייל השבועי מגילי די עשה לי לבכות בכל ראשון מחדש, אבל אולי זה כן היה שווה את זה. חשוב מאוד לתרגל המון את החומר בהסתברות כדי להטמיע אותו כמו שצריך בראש.\n\nהמבחן: שאלה 1 משדרת וייבים של שנאת אחים. לא אפרט כי פירטו כבר לפניי… מהלך מאוד זדוני כלפינו. בנקודה זו אציין שאני מאוד מאוכזבת מהסגל שיצא רופס מול אביתר- אני בטוחה שרובו לא הסכים עם הרעיון המטורלל הזה. חוץ מזה מועד א היה סביר, צריך להיות מאוד חדים על הנושא האחרון בקורס (מה שרובנו לא היינו, כי בקושי תרגלנו אותו). מועד ב היה סביר מינוס מינוס. מלא חישובים מסובכים ופלאשבקים לאינפי2.\nהערה חשובה- מבחני טקסס הם ברמה עלובה מאוד לעומת מה שיתנו לכם בפועל, אז כדאי לא להסתמך עליהם.\n\nהשורה התחתונה: אפשר להצליח בקורס, אבל צריך להשקיע הרבה (ולהתפלל לשאלות עם ניקוד אי שלילי בלבד).", "timestamp": 1678713875036}, {"author": "בחור/ה טוב", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nסה״כ בחור נחמד עד המבחן.\nכל הסמסטר אתה לומד וחושב שזה רלוונטי ואז מגיע המבחן ו....\nלא קשור לכלום.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nסבבה לגמרי, קלים אפילו.\nאבל לא קשור למבחן בכלל.\nהמבחן: \nאביתר כנרא עשה סיאנס אם היטלר וסטלין ושלושתם ביחד חשבו על המבחן.\nכי אדם שפוי לא היה עושה/חושב על דבר כזה לבד.\nהשורה התחתונה: \nמל״ג מומלץ מאוד", "timestamp": 1678721601797}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר \nחוות דעת - הרצאות: אביתר מבריק כשזה מגיע להסתברות אבל טיפש כשזה מגיע ללהעביר את הידע שלו הלאה. לא מסביר, לא נותן אינטואיציה, חסר כריזמה, פשוט מניח שכולם מבינים וכולם איתו והכל סבבה, בפועל יצאנו מבולבלים מכל הרצאה מחדש.\n\nשם המתרגל/ת: תומר וולק\nחוות דעת - תרגולים: פה ושם הוא נראה שהוא לא שולט בחומר אבל הוא סה\"כ מסביר מאוד טוב ויש אווירה טובה בתרגולים והוא נכון מאוד לעזור לנו גם מעבר לשעות המחייבות. (בכל מקרה כל זה לא רלוונטי כי הוא כבר לא יתרגל יותר)\n\nשעורי הבית: גיליונות תקפיים שבועיים. הגיליונות ארוכים אבל לחלק גדול מהם יש רפרנס. בכל מקרה מומלץ מאוד לעשות אותם ברצינות כדי להטמיע את החומר, ועוד יותר מומלץ ללכת לשעות קבלה על שאלות שנתקעים עליהן.\n\nהמבחן: גיהינום. קשה בהרבה מהגיליונות והבדיקה שוחטת. וזה בלי לדבר על כל מיני מהלכים מלוכלכים של הסגל כמו קנס על טעויות והשמטת נוסחאות רלוונטיות מהדף נוסחאות.\n\nהשורה התחתונה: הקורס שהיה לי הכי קשה עד כה בתואר אבל התחברתי לחומר אז עבור אנשים כמוני זה נסבל.", "timestamp": 1678778483557}, {"author": "אנה גרגוריבקר", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nאביתר נראה בהתחלה בן אדם נחמד, אבל כמרצה הוא נוראי, לא מובן, עונה בצורה מתחכמת ולא ברורה על שאלות, כתב מזעזע. אם אתם לומדים איתו ממליצה על הסיכום המוקלד של ההרצאות שלו, אחרת נורא קשה להבין מה הולך.\nשם המתרגל/ת: אלי \nחוות דעת - תרגולים: מקסים סובלני ומשקיע , לפעמים קצת מתבלבל ולא סגור על עצמו אבל זה פעם ראשונה שהוא תרגל את הקורס אז מאמינה שהוא ישתפר.\n\nשעורי הבית: \nגיליונות ארוכים בין 6 ל10 שאלות פעם בשבוע, הרוב לא קשה חלק דרשו שעות קבלה, לקח כמה שעות כל גליון. \nהמבחן: \nמבחן קשה לקורס לא קל בכלל, אל תסתמכו על מבחני עבר של אביתר בטח לא אלה שמטקסס, ממש הרגיש כאילו טמנו לנו מלכודת איתם. חוץ מיזה קחו בחשבון שיכולים פתאום להפתיע אותכם עם המבנה של המבחן, או פתאום להעלים לכם חלק מהנוסחאות בדף נוסחאות, בקיצור אל תסמכו על אביתר בשום צורה. \nהשורה התחתונה: נראה שאין דבר כזה מרצה נורמאלי להסתברות, שיהיה לכם בהצלחה.", "timestamp": 1678803637707}, {"author": "גבריאל", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: המרצה הכי גרוע שראיתי בחיים שלי, לא מסביר כלום בפתרונות המבחן, פותר אותה שאלה עם שתי תוצאות שונות, אי אפשר לקרוא מה שהוא כותב, הכל מבולגן, בלי הסבר. אני לא מבין למה הוא עדיין מרצה ומלמד. בבקשה תעשו משהו שהוא לא ילמד עוד.\n\nשם המתרגל/ת: אלי\nחוות דעת - תרגולים: ממש בסדר.\n\nשעורי הבית: ארוכים \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678805159768}, {"author": "הלב כואב", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: מרצה צריך לדעת ללמד את החומר אבל אביתר לא קשור לנושא הזה בכלל\n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: בכללי סבבה\n\nשעורי הבית: גיליון כל שבוע \n\nהמבחן: כנראה אביתר אהב את הרעיון להפתיע את הסטודנטים לרעה במועד א ידענו שיש ניקוד שלילי ובמועד ב עשה שינויים בדף נוסחאות מבלי להגיד. וגם תוך כדי המבחן ההתייחסות שלהם פשוט מזלזלת בסטודנטים.\n\nהשורה התחתונה: קורס חובה אין מה לעשות אבל להתפלל שאביתר לא יהיה קשור בשום צורה לקורס.", "timestamp": 1678810542445}, {"author": "סטטיסטיקאי שאינו שיכור", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביתרוש \nחוות דעת - הרצאות: וויתרתי מהר מאוד על ההרצאות מכיוון שאביתר לא ברור במיוחד ויש לו כתב נוראי [ומי שאומר את זה הוא לא בעל כתב יפה בעצמו אך לפחות קריא almost surely ] , בנוסף בקורס שהוא בבסיסו מאוד מתמטי ,מין הראוי שיסבירו את המעברים ואת הנוסחאות כמו שצריך ואני לא אצטרך לשבור את הראש על נוסחא על מנת להבין אותה [ לחכות לקריעת ים סוף יותר קל ] , אבל אם אנחנו רוצים לחפש נקודה טובה א יש אפילו שתיים : הוא זמין והוא בעל הומור [לפעמים על חשבוננו ] \n\nשם המתרגל/ת: ניתאי סוויסה\nחוות דעת - תרגולים: סך הכל מתרגל נחמד אבל לא נותן יותר מדי אינטואציה ובעצם כמו כולם [ אבל חשוב להבהיר שכולם נחמדים ורוצים לעזור ] \n\nשעורי הבית: גיליון שבועי של שבע שאלות בממוצע , לא נורא כל כך ולכל היותר יש רק שתי שאלות ללא רפרנס והשאר ניתן לרפרנס , למרות שלא מומלץ וגם לא קשה. [אבל בסמסטר עמוס זה הופך להיות מעמסה מעצבנת ]\n\nהמבחן: מועד א , למעט \"המתנה\" המדהימה שאביתר סידר לנו של ניקוד שלילי מדובר היה במבחן הוגן .מה שמביא אותי למועד ב שבו אני בטוח שאביתר ישב ועישן ביחד עם צנזור כי רוב המבחן היה מבחן שהרגיש יותר כמו אינפי ולא הסתברות ולא עשיתי אפיילו ככה אינטגרלים  באינפי\n\nהשורה התחתונה: בסוף מדובר בקורס מתמטי שלפחות לדעתי הוא גם הקורס המתמטי הכי חשוב ביחד עם קומבי כי הוא מהווה בסיס ללא מעט מהתחומים של מדעי המחשב ונתונים ולפחות בעיני כן נהנתי מהחומר ואפשר להגיד שהוא הקורס המתמטי האהוב עליי מבחינת החומר שמועבר בו רק חבל שעושים מבחנים [מאז אביב 2021 ] שגורמים לרוב האנשים לשנוא את החומר [ אלא אם מדובר בחומר שאביתר עישן כי אני גם רוצה ]", "timestamp": 1678889727447}, {"author": "הייטקס", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: מינוסים - כותב בצל של הלוח ואז לא רואים, כתב נוראי לא מובן כלום, מרגיש כאילו הוא בא לדפוק את הסטודנטים מלכתחילה, כותב מבחנים עם העט של הפרופסור הרעה מהארי פוטר, מוריד נוסחאות מדף נוסחאות מבלי להודיע מראש, כותב שאלות של 20 נקודות כאשר בפועל הן 40 נקודות. \nפלוסים: זרק בדיחה מצחיקה בהרצאה. \nבלי צחוק, אני מניח תפילין כל יום כדי לא לפגוש אותו שוב בסמסטר חורף הבא שבו אני חוזר על הקורס. \n\nשם המתרגל/ת: אסף גנדלר מוקלט\nחוות דעת - תרגולים: תרגולים מעולים, עובר על החומר, פותר תרגילים. באמת מומלץ. \n\nשעורי הבית: שבועיים בין 7 ל-10 תרגילים. מעמיס בטירוף. \n\nהמבחן: מבחן מועד א' היה יחסית בסדר מעבר לזה ש80 אחוז מהמבחן היה על החומר של שתי ההרצאות האחרונות. \nמועד ב' היה זוועה, נגרם לי להרגיש שאם באים לשפר ציון זה חטא והעונש הוא מוות. ניגשתם למועד א', מספיק, לא לשפר. קיבלתי במועד א 69 במועד ב' 56 (תןדה אבייתרוש שהסכמת לי לפחות לא להכשל). \n\nהשורה התחתונה: טפייייי", "timestamp": 1678982575758}, {"author": "almost surely", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\n\nהשורה התחתונה: \nכל הסמסטר שפטתי את הקורס הזה לכף זכות. הרגשתי שמרבית הסטודנטים מתלוננים על המרצה כי זה חלק מהספורט. אז נכון, כמעט אף מתרגל לא יודע את החומר כמו שצריך, ונכון המרצה מתנגד נחרצות להקלטות או כל אמצעי לימוד שישמש את הסטודנטים. אבל הרגשתי שזה לא כזה נורא ולפחות החומר מעניין.\n\nבמבחן נוכחתי לגלות עד כמה הזלזול בסטודנטים יכול לעלות מדרגה. מרצה שמשקר פעם אחר פעם על דברים שהוא אמר ובפועל לא אמר. מגיעים למבחן עם דף נוסחאות שונה ממה שפורסם במודל והטענה \"גם ככה הוא לא יעזור לכם\". בסריקות גם מגלים שהם מורידים נקודות בלי לסמן איפה טעית, אין איקס, אין עט אדום שמדגיש איפה שגית, פשוט ככה (4/10). התנהלות מחפירה, מקווה שלא אתקל בסגל הזה שוב.", "timestamp": 1679310202851}, {"author": "מה הטעם?", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: \nהגעתי ל-2 הרצאות הסמסטר והשתדלתי לא להרדם (לא הצלחתי)\nמהר מאוד הבנתי שאם אני רוצה להבין את החומר אני צריך ללמוד אותו לבד. אביתר מקריא את מה שרשום ברשימות שלו, אז במקום לשמוע אותו מקריא אותן, קראתי אותן בעצמי.\nשם המתרגל/ת: .....\nחוות דעת - תרגולים: \nלא הגעתי לתרגולים. בדומה להרצאות, מקריאים פשוט מדף מוכן מראש, ומצאתי שעדיף לי לקרוא את הדף במקום לשמוע אותם מקריאים ממנו\nשעורי הבית: \nהגשה כל שבוע, מכסה חלק גדול מהחומר. חשוב לעשות (גם עם רפרונס פה ושם) כדי להבין את החומר\nהמבחן: \nאמריקאי מהגיהנום (לא בגלל הרמת קושי של השאלות, בגלל שתשובה לא נכונה מורידה 8 נקודות ותשובה נכונה מוסיפה 4)\nשאר המבחן די הגיוני וסטנדרטי לאביתר (אביתר של הטכניון, לא של טקסס)\nהשורה התחתונה: \nאחד הקורסים היותר חשובים (בתחום של דאטה, פחות בתחומים אחרים), חבל שמעבירים שצורה משעממת ויבשה, ואפילו יותר חבל לגלות אחרי הקורס שיש הרבה חומר אלמנטרי וחשוב שבחרו לא ללמד", "timestamp": 1679378434721}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר\nחוות דעת - הרצאות: כתבו כבר מספיק בביקורות שלפניי לגבי עד כמה ההרצאות שלו גרועות. מה שיש לי להוסיף הוא שמדובר באדם שהוא פשוט שקרן, שפשוט מזלזל בסטודנטים כל פעם מחדש. במועד א' קיבלנו הפתעה עם שאלות עם ניקוד שלילי. אביתר שיקר בכך שאמר שהוא אמר את זה באחד משיעורי החזרה המוקלטים - שזה שקר כי הוא לא אמר את זה באף אחד מהם. הבדיקה במועד א' הייתה פשוט מזלזלת ומגעילה במיוחד, לאנשים הורידו נקודות על כל הסעיף בזמן שלאחרים הביאו על אותם נימוקים, אין הסבר על מה מורידים נקודות. במועד ב' אביתר הוריד מהדף נוסחאות שלנו כמה נוסחאות בלי להודיע על כך מראש, לכאורה זה היה אמור לעזור לסטודנטים להבין שאסור להם להשתמש בנוסחאות אלא לפתח מההגדרה. יחד עם זאת בסעיף הבא שאחריו הורידו לאנשים נקודות למרות שלא נכתב להם שאסור להשתמש בנוסחאות. חשוב לציין שלכל תלונה אביתר התייחס בזלזול, מבחינתו הוא תמיד צודק ונציגת הקורס לא יכלה לעשות שום דבר מולו כשיש בן אדם שלא מוכן בכלל לשמוע את האחר. במועד ב' הוא הביא שאלה שלמה שחצי ממנה נפסל כי לא היה תקין, והחצי השני שלי היה פשוט אלגברה ולא הסתברות. המבחנים שאביתר מביא לנו לתרגול מהזמן שלו בטקסס הם מבחנים טובים ונורמלים, אבל הם כלום לעומת החרא שהוא האכיל אותנו במבחנים הסמסטר. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679506135753}, {"author": "~", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר פרוקצ'ה\nחוות דעת - הרצאות: מרצה מזעזע, אין פואנטה בללכת להרצאות שלו, הוא לא יודע להסביר שום דבר וגם לא אכפת לו מהסטודנטים בשום צורה\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: אחלה מתרגלת, עוזרת מאוד להבין את החומר. אם אביתר מלמד בסמסטר אז מומלץ מאוד ללכת לתרגולים, בלי זה קשה להבין את החומר\n\nשעורי הבית: שיעורי בית ארוכים מאוד וקשים כל שבוע- במיוחד לקראת הסוף, עוזרים אבל להבנה ודי חשובים\n\nהמבחן: מבחן מגעיל, אביתר שם שאלות אמריקאיות שמורידות ניקוד אם טועים. היה אבל פקטור לא רע בסוף אז בסהכ אפשרי לקבל ציון סביר \n\nהשורה התחתונה: קורס שהיה יכול להיות לא יותר מדי נורא אם לא היה את אביתר. אין יותר מדי מה לומר, קורס לא מעניין כל כך אבל הוא חובה", "timestamp": 1679771896447}, {"author": "מיסם", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר פוקצ'ה\nחוות דעת - הרצאות: המרצה לא דואג שהסטודנטים יבינו, הוא לא מתייחס לתלונות של הסטודנטים ועושה את אותם דברים שכבר התלננו עליהם מלא בעבר, למשל לכתוב בטוש לא טוב, לא להסביר חלקים מסובכים באופן איטי... אין לו רשימות קריאות, ולא דואג להעולת מבחני עבר ברמה טובה (או דומה למה שיהיה במבחן האמיתי). אבל הוא מצחיק :)\n\nשם המתרגל/ת: תומר וולק\nחוות דעת - תרגולים: הוא טוב, מנסה להביר לאט ומובן, אבל הוא לא מתכונן לפני, הוא לפעמים מופתע ממה שכתוב בפתרון שהוא מקריא\\מכתיב, אולי זה מביטחון עצמי מופרז.\n\nשעורי הבית: ארוכים אבל מלמדים מאוד\n\nהמבחן: לא קרוב למה שתירגלנו, מפתיע ולא דומה למבחני עבר שהעלו לנו. יש נושאים ששאלו עליהם במבחן שלא פתרתי עליהם שאלה אחת אפילו במהלך הסמסטר. מאוד מאוד מתשמש בכלים של אינפי 2 במבחנים שלו\n\nהשורה התחתונה: תתרגלו מעבר למה שהם מעלים, במיוחד מבחנים של מרצים אחרים.", "timestamp": 1681316555501}, {"author": "סלים", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביתר פורקצה\nחוות דעת - הרצאות: אביתר נותן לך וייב שהוא אחלה גבר, אבל אל תיפלו למלכודת דבש הזו. הוא בן אדם דיי קטן בעיניי שנהנה לדפוק סטודנטים. ברמה המקצועית הוא לא יודע להסביר רעיונות מורכבים, הוא מניח שאנחנו הסטודנטים מבינים מה הוא אומר בזמן שכולם בשוק טרור בקהל. בנוסף יש לו כתב מזעזע והרשימות שלו ברורות כמו הכתב שלי בכיתה א' ואני דיסלקט.\nמעבר לכך הוא משפיל סטודנטים, סטודנט א שואל אותו שאלה לגיטימית ותשובה של אביתר היא בסגנון הבא:\" דיברנו על זה שבוע שעבר מה לא הבנת\" פשוט מחסל אנשים.\nולגראנד פינלה המבחנים שלו. הבן אדם נתן מבחן במועד א' באיזה 4~5 רמות מעל מה שהיה בש\"ב או בתרגולים. אנשים התפללו לאל שייתן תשובות למה לסטודנט הממוצע אין שום סיכוי. הוא שבר אותנו. אז לסיכום הוא מרצה הכי חלש שהייתי אצלו ever בהצלחה כי תצטרכו את זה\n\n\n\nשם המתרגל/ת: ניתאי סויסה\nחוות דעת - תרגולים: ניתאי הוא אחד המתרגלים הגבריים ביותר שלמדתי אצלם. הוא תותח על מסביר בצורה ברורה, סבלני. ממליץ ממש ללכת אליו. לא שזה יעזור לכם להצליח במבחן אבל זה ייתן לכם תחושה שאתם \"על\" \n\nשעורי הבית: ארוכים אבל כן מלמדים \n\nהמבחן: זבל גדול הסברתי למלא. תבואו מוכנים למה אתם הולכים לבכות. \n\nהשורה התחתונה: בשורה התחתונה הוצאתי 80+ אחרי שני מועדים בפוקס ככה שאני לא מדבר מתסכול על הציון. חבל ממש שיש מרצה כזה גרוע בקורס כזה חשוב ויפה. הרס לי את כל החוויה לברוח כמו מאש", "timestamp": 1684859657734}, {"author": "בנאי נתונים", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: \n\nטובות מאוד בעיני למרות התדמית הבעייתית שלו.\n\nחוות דעת - תרגולים: לא הייתי :)\n\nשעורי הבית: \n\nלא מאוד מאוד קשים אבל כן ארוכים ומוודאים שהסטודנטים על החומר. לא להתפתות לרפרנס מהר מדי.\n\nהמבחן: עוד נראה\n\nהשורה התחתונה: \n\nקורס מעניין וחשוב, עם הרבה אינטגרלים מסריחים בסוף", "timestamp": 1689408631579}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביתר\n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: הכי טוב\n\nשעורי הבית: \nגיליון חדש כל שבוע\n\nהשורה התחתונה: שגב", "timestamp": 1689419825541}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nאורן מרצה מעולה, הוא מבין את החומר כל כך לעומק ומסביר את הדברים בצורה מאוד מובנת ודואג שהסטודנטים יבינו. סטודנטים נוטים לא לתת לו הזדמנות וישר מביעים דעות שלא כל כך תואמות את זו עליו, אך כל מה שצריך זה לתת לו הזדמנות ובאמת להקשיב ולהתעלם מאם הוא לוקח קצת זמן לחשוב ודברים דומים אחרים וישר מבינים שהוא באמת מרצה כל כך תותח.\n\nשם המתרגל/ת: תם/שגב\nחוות דעת - תרגולים: \nשניהם מאוד מעולים, מסבירים בצורה טובה ודואגים שכולם יבינו.\n\nשעורי הבית: \nיש גליון פעם בשבוע, היו גליונות הקשים יותר מאחרים, אך בכללי הם מאוד עוזרים להיות על החומר ולהבין מה קורה בקורס. ממליץ מאוד לנסות לפתור אותם לבד הם ממש עזרו לי להבין הכל!\n\nהמבחן: עוד לא היה.\n\nהשורה התחתונה: הקורס מאוד מעניין וחשוב לתואר אז כן חח", "timestamp": 1689955035772}, {"author": "Tal Benjo", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאורן\nמרצה על הפנים, בכוונה סוטה מהדפים היחידים שיש לו.\nלא מסודר.\nדוחף את הדעות הפוליטיות שלו דרך המייל הכלל קורסי.\nשם המתרגל/ת: \nשגב, אחלה מתרגל מעביר הכל בבהירות.\nחוות דעת - תרגולים: \nחשוב לבוא, עושה המון סדר בהגדרות ותמיד פותרים כמות יפה של תרגילים.\nשעורי הבית: \nמאתגרים לפעמים אבל שווה לשבת על התחת כדי לא לחטוף במבחן.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1690471789665}, {"author": "o", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nבסך הכל אורן אחלה מרצה, הוא לפעמים טיפה איטי ולחלק קצת קשה איתו אבל אני הייתי בהרצאות והרגשתי שהבנתי הכל ואפילו היה מעניין\n\nשם המתרגל/ת: תם יובילר\nחוות דעת - תרגולים: \nאחלה מתרגל, לפעמים קצת איטי ומתעכב על מעבר על החומר בהתחלה מה שגורם לכך שלא תמיד מספיקים את כל השאלות אבל בסך הכל מתרגל טוב!\nשעורי הבית: \nאמנם עמוסים כי יש כל שבוע אבל התחושה היתה שהרמה שלהם נמוכה בהרבה מהרמה של המבחנים\nהמבחן: \nשלנו היה הוגן מאוד+ פקטור אז היתה הזדמנות להוציא ציון מעולה\nהשורה התחתונה: \nקורס מעניין, אמנם מרגיש שיש פער בין הרמה של התרגולים והתרגילי בית למבחן- שהוא כמה רמות מעל", "timestamp": 1691735612444}, {"author": "נגה", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: בתחילת הסמסטר ניסיתי לעקוב אחרי ההרצאות, אבל אורן פשוט מרצה בלתי נסבל. הוא מאבד ריכוז הרבה ונעשה עצבני בגלל זה, מה שגורם לו לאבד ריכוז... הוא אומר \"ששש\" בסביבות ה - 50 פעמים בהרצאה של שלוש שעות (אני ספרתי) ובכללי הוא בן אדם לא סימפטי. היתה הסמסטר שביתה של הסגל הבכיר ואורן שבת חצי סמסטר, בזמן שהוא שבת הוא לא הסכים לשלוח הקלטות או אפילו רשימה של החומר שצריך להשלים ולא הרשה למתרגלים לתרגל, מה שגרם לזה שהיינו צריכים להשלים את החומר של סוף הסמסטר לבדנו אחרי סוף הסמסטר. בתקופת המבחנים אורן שבת (שוב), ולא ענה לשאלות במייל, הפעם בגלל הרפורמה. ובנוסף ניסה להפלות סטודנטים על בסיס עמדה פוליטית (הוא הודיע שיאפשר לסטודנטים שמשתתפים בהפגנות נגד הרפורמה לקבל מועד מיוחד, אחר כך הוא כמובן התנצל ואמר שהוא \"התכוון להפגנות משני צידי המחאה\", ברור...)\nבקיצור, לא ממליצה בחום. אפשר לעבור את הקורס רק עם התרגולים, ההרצאות מיותרות.\nשם המתרגל/ת: יואב\nחוות דעת - תרגולים: יואב מתרגל ממש נחמד, הוא עונה לכל השאלות בסבלנות (גם לשאלות הממש סתומות).\nמכירים את הסדרת דיוקנות של האומן שחלה באלצהיימר? שהציורים שלו נעשו יותר ויותר אבסטרקטים עם הזמן? קצת הרגשתי שככה היו התרגולים. בתחילת הסמסטר יואב כתב את הכל על הלוח בצורה מסודרת, ולקראת סוף הסמסטר הוא כתב רק חלקי משוואות ומושגים ברחבי הלוח, מה שהקשה על ההבנה. צריך פשוט לבוא לתרגולים עם הדפים של התרגול הרלוונטי כדי להבין על מה מדברים ולא לבוא בכוונה ללמוד מההעתקה מהלוח.\n\nשעורי הבית: קצת מגעילים, אבל לא נורא\n\nהמבחן: נורא. אבל היה פקטור של 33%, אז היה אפשר לפתור רק את הסעיפים היותר קלים של כל שאלה ולקבל ציון סביר.\n\nהשורה התחתונה: החומר לא נורא מדי, עד שעוברים ממשתנים בדידים לרציפים, אז נכנסים לתמונה אינטגרלים כפולים וכל מני דברים מגעילים כאלה...", "timestamp": 1692008807876}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות: לא ראיתי אבל קראתי את הרשימות שלו והן מדהימות. מפתחות את ההבנה ואת האינטואיציה מהבסיס וממש מקיפות.\n\nשם המתרגל/ת: אסף גנדלר (הקלטות)\nחוות דעת - תרגולים: מעולים ואסף תותח אבל התרגילים ממש לא ברמה של מבחן.\n\nשעורי הבית: גיליון שבועי די ארוך (בערך יום עבודה). תרגילי הבית חשובים אבל ברמה יותר נמוכה משל מבחן.\n\nהמבחן: נראה שזה הרבה עניין של מזל, שני סמסטרים קודמים היו מבחנים מזעזעים (אני עצמי מנפגעי אביתר, חזרתי על הקורס הסמסטר). הסמסטר היה מבחן הוגן לגמרי + פקטור מטורף\n\nהשורה התחתונה: אורן יצא ממש גבר שהתחשב בנו בגלל המחאות של המרצים ובגלל המצב הפוליטי וככה יצא במועד א הממוצע הכי גבוה בקורס אי פעם.\nלעניין הקורס והחומר עצמו, בעיניי זה אחד הקורסים הכי חשובים ומעניינים שיש בתואר, ועם זאת אחד הקורסים הכי קשים שיש. כדי באמת הוא דורש הבנה מאוד מעמיקה גם בחומר של הקורס עצמו וגם לא מעט באינפי. כל עוד יש מרצה שיודע להעביר את החומר כמו שצריך וגם מבחן הוגן אז הכל טוב, הרוב יסיימו עם ציון סביר וימשיכו הלאה בחיים. הגאונים יסיימו עם ציון מדהים כבר במועד א', העקשנים (כמוני), ישקיעו שעות על גבי שעות כדי להשיג הבנה באמת טובה ולסיים עם ציון מכובד, לפעמים גם במחיר של קורס חוזר.", "timestamp": 1692030981567}, {"author": "משהו", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: אורן גאון ,ההרצאות לא פשוטות אך מי ששומר על קשב עם אורן יבין ויצליח\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שעורי בית לא פשוטים אך מלמדים את הנדרש.\n\nהמבחן: מבחן לא פשוט בכלל ,שילוב של אינפי אלגברה ודיסקרטית \n\nהשורה התחתונה: קורס קשה מאוד", "timestamp": 1695275447796}, {"author": "OBL", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nחוויה קשה מאד. אורן מעביר את ההרצאות מהראש בלי דפים, ובעיניי עושה פשוט סלט על הלוח. אותי בלבל מאד, ברמה שהפסקתי ללכת להרצאות ואני מרגיש שזה רק עזר לי.\n\nשם המתרגל/ת: בת-שבע\nחוות דעת - תרגולים: אין עליה. מסבירה היטב, בקיאה בחומר מאד, חוזרת במסודר על החלקים הקריטיים מההרצאה (שזה היה חשוב פה מאד בגלל בלאגן שהיה בה). ניסתה להסביר גם את תהליך החשיבה, ולמה דברים מפתיעים קורים\n\nשעורי הבית: \nגליונות שבועיים, חלקם קלילים חלקם קשים. עוזר מאד בעיניי להנמה לאורך הסמסטר\n\nהמבחן: טרם.\n\nהשורה התחתונה: קורס סבבה, הרצאות רעות", "timestamp": 1715280693803}, {"author": "וקטור", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות:  עם ה-\"שש\" שלו אי אפשר לעקוב אחריו, תמיד מוציא מהריכוז הוא מה\"שש\" 50 + פעמים ב-3 שעות אז תתכוננו לזה. ולא רוצה להזכיר איך שהוא מוחק את הלוח ומשכתב מלא פעמים. אבל תכלס הוא די סבבה.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: די סבבה\n\nשעורי הבית: קלים יש לפעמים שאלה אחת קצת קשה, אבל לא ממש.\n\nהמבחן: עוד לא היה.\n\nהשורה התחתונה: החומר מאוד מאוד מעניין וכיפי, נהניתי בפתירת הגליונות ובלמידה למבחן. הסגל אחלה", "timestamp": 1715448682955}, {"author": "עד מתי טכניון", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: אחד המרצים הגרועים שתפגשו בטכניון, בנאדם טוב אבל מרצה גרוע, לא מובן, הרצאות מבולגנות.\n\nשם המתרגל/ת: לא משנה\nחוות דעת - תרגולים: כל המתרגלים מקיאים את הדף תרגול, אין ערך מוסף, עדיף לעבור על הדפי תרגול + תרגילים שלא מופיעים בתרגול עצמו כי אין זמן\n\nשעורי הבית: גליון אחת לשבוע, עמוס וקשה אבל יש רפרנסים\n\nהמבחן: כל המטרה שלו היא להכשיל ולא לבדוק ידע בהסתברות, מורכב מאינסוף טריקים וחישובי אינפי מיותרים שלא באים לבדוק ידע בקורס\n\nהשורה התחתונה: קורס בזיוני וכנראה אחד הגרועים שיש לטכניון להציע עם ממוצע מזעזע מרצים גרועים וחומר שמועבר בצורה הכי לא ברורה שאפשר.", "timestamp": 1715941899122}, {"author": "מה זה המבחן הזה???", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "המבחן: איך אפשר לבנות מבחן כזה קשה באלוהים??? כל המטרה של המבחן הזה להוריד את הממוצע של סמסטר שעבר ואנחנו נדפקנו. מבחן לא פתיר בשום צורה, לא קשור למה שנלמד בהרצאות ולא בתרגולים רמה אחרת לגמרי, לא ראיתי שום מבחן במודל ברמה הזו, באמת הזיה. צריך וקטור 40 נקודות!!!\nולמי שבדק את רמת הבחינה ואמר שהיא ברמת קושי מתאימה, שיעשה בדק עצמי למה זה לא בסדר.\n\nהשורה התחתונה: אכזבה אכזבה, נהניתי מאוד מהחומר עד שהגיע המבחן למה למה להכשיל סטודנטים? מה יש להם? מה עוד בתקופה הזו!!\nאם יש מרצה או מתרגל אחראי שמלמד בטכניון ורואה את התגובה הזו, בבקשה תפסיקו להכשיל סטודנטים על כלום ושום דבר, תביאו מבחן הוגן ברמת ההרצאות והש\"ב.", "timestamp": 1715949078637}, {"author": "דייייי", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורן \nחוות דעת - הרצאות:  רואים שהוא בן אדם טוב אבל היה לי מאודדד קשה לשמור על ריכוז בהרצאות שלו. מאוד. \n\nשם המתרגל/ת: שגב\nחוות דעת - תרגולים: מתרגל טוב מאוד מסביר את החומר בתכלס ועוזר לפתח אינטואיציה (לא שזה יעזור לכם במבחן) \n\nשעורי הבית: ארוכים ועמוסים (גליון בכל שבוע חובה) \nאתם תחשבו שהם הדבר הכי גרוע עד שתגיעו למבחן הסופי\n\nהמבחן: זוועתי ולא בודק הבנה. הניסוח מבלבל ברמות בלתי נסבלות והמשיכו לתת הבהרות גם בחצי שעה האחרונה במבחן!!!! מה שמעיד על כמה שהמבחן היה בזיוני \n\nהשורה התחתונה: חומר נחמד אבל קורס מועבר בצורה מגעילה", "timestamp": 1715954733578}, {"author": "אורן", "difficultyRank": 3, "generalRank": 1, "semester": "202302", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: אורן לא יודע ללמד בכלל הבן אדם מבין את החומר אבל לא יודע להעביר אותו.\n\nשם המתרגל/ת: שגב\nמתרגל מעולה \nשעורי הבית: \n\nהמבחן: \nאני נשבע לכם שהמתרגלים של הקורס לא יודעים לפתור את המבחן, הם בכלל לא מסוגלים ואין להם את ההבנה והכלים לפתור אותו כולם חלשים בחומר ובסוף מצפים ממנו לפתור מבחן כזה\nהשורה התחתונה:", "timestamp": 1715967823069}, {"author": "הלורד", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: ניכר שאורן ממש שולט בחומר, רוב ההרצאות הוא יורה הכל על אוטומט בלי לפתוח דפי סיכום. אורן סלעי לשאלות רוב הזמן די מובן, סה\"כ ממליץ\n\nשם המתרגל/ת: מוקלטות משתנה\nחוות דעת - תרגולים: בתפזורת של ההקלטות הסמסטר שלל המתרגלים היו אחלה, מאוד חשוב לראות כי הם פותרים תרגילים שמפשטים את מה שמועבר בהרצאות.\n\nשעורי הבית: תקף 10% ומרופרנס כמעט לגמרי. אני השקעתי את הזמן לנסות לפתור לבד, לדעתי חשוב מאוד.\n\nהמבחן: לא פתיר וממש מנותק מהמציאות, פקטור עצום מעיד על הרמה. רמת המבחן משתנה ממש בין סמסטרים.\n\nהשורה התחתונה: לוקחים כי אין ברירה, כמו קומבי רק יותר נורא", "timestamp": 1716554322406}, {"author": "בקושי עובר את הקורס", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לואידור אורן\nחוות דעת - הרצאות: \nמלמד מפוזר. הרבה פעמים הוא מוחק וכותב מחדש משפט אחד כמה פעמים, כל מילה חמישית שלו זה \"שששששש\" (הכיתה לא כזאת רועשת). בנוסף אורן ממהר מאוד והרבה פעמים פשוט לא עונה על שאלות אז קשה לעקוב ולסכם. הייתי הולך למרצה אחר אבל הוא היה היחיד. לא עזר גם שההרצאות היו בחקר בניה 1, שזה אולם עם כיסאות שמשאירים אותך עם כאבי גב אחרי ההרצאות 3 שעות של אורן. \n\nשם המתרגל/ת: בת-שבע\nחוות דעת - תרגולים: \nמתרגלת מצויינת, מסבירה טוב ועונה על שאלות. ממליץ מאוד.\n\nשעורי הבית: \nגיליון כל שבוע, 10% תקף. התרגילים קלים.\n\nהמבחן: \nמבחן זוועה לגמריי. חצי מבחן לא הצלחתי או לא הספקתי. רמת הקושי פי 20 מתרגילי הבית ולא ראליסטי בכלל לפטור דבר כזה בשלוש שעות. גם עם הפקטור הגדול שהיה, זה הציון הכי גרוע שלי בתואר עד כה. אם היה ברור שזאת תהיה הרמה, כמו שבאינפי זה ברור, אז מילא, אבל הרמה גבוהה בהרבה מכל תרגיל שמצופה מאיתנו לפתור כהכנה למבחן, כולל מבחני עבר. \n\nהשורה התחתונה: \nהחומר סבבה, המרצה לא משהו, והמבחן קשה ברמה דפוקה. סה\"כ קורס רע. לא מאחל לאף אחד לחוות קורס כזה.", "timestamp": 1716561017915}, {"author": "בר ציפורי", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: היחידי, אז חייבים ללכת. אציין שיש סיכום מוקלד של ההרצאות שלו שדי עושה את העבודה, כך שאפשר לראות מוקלט ולהסתכל על הסיכום.\n\nשם המתרגל/ת: תום\nחוות דעת - תרגולים: בגדול סבבה. סגל הקורס מפרסם את התרגולים עם הפתרון המלא, כך שגם דברים לא מובנים אפשר להשלים מהפתרונות (זה מומלץ).\n\nשעורי הבית: תקף 10%. לא באמת יצילו אתכם, אבל כן חשוב לעשות.\n\nהמבחן: טוב אז לגבי המבחנים של אורן, יש כמה דגשים:\n\n1. המבחנים שלו יותר קשים מהממוצע. אל תצפו לניסים.\n2. כשאורן מוריד חומר (נותן לכם הקלות), המבחן נשען על הבנת הנקרא, קומבי, קצת אינפי 2 (אינטגרלים) ובעיקר על החלק הראשון של הקורס. במצב כזה המבחן הופך ל*שונה* ממבחני עבר.\n\n*אם הסמסטר שלכם הוא סמסטר מלחמה או סמסטר הקלות כלשהו, שימו לב לפתור מבחנים מהסמסטרים שאורן היה בהם מרצה אחראי, והיו בהם הקלות (כרגע אביב 23, חורף 23-24). כך ייראה המבחן. כל מבחן אחר שאתם פותרים פשוט לא יהיה רלוונטי.*\nהמבחן שלנו היה לא מובן, עם כמה תיקונים קריטיים במהלכו. זה דרש מאורן להיות \"יצירתי\" עם הפקטור. כמו שאמרתי, אל תצפו לניסים. \n\nהשורה התחתונה: זה הציון מהנמוכים שלי בתואר. פשוט תעברו ותמשיכו הלאה.", "timestamp": 1716591318413}, {"author": "היפר גאומטרית", "difficultyRank": 4, "generalRank": 3, "semester": "202302", "text": "שם המרצה: אבנר מוקלט (מלפני 5 שנים, חפשו בפנופטו 094411s: 094411 - הסתברות ת' - הרצאה - אביב)\nחוות דעת - הרצאות:  הייתי בהרצאה הראשונה של אורן והבנתי שמשם לא אבין. צפיתי במהלך הסמסטר בהרצאות של אבנר. אמנם אלו הרצאות של הסתברות ת ולא מ, ולפעמים החומר לא בדיוק באותו הסדר, אבל לגמרי עדיף להבין משם מאשר לשבת 3 שעות בכיתה ולא להבין.\nאבנר נותן הרבה דוגמאות במהלך ההרצאות וכותב ממש ברור. \nההוכחות עוזרות לפעמים להבין אינטואיציה לדברים, אבל בניגוד לאינפי אין שאלות הוכחתיות במבחן אז קחו בחשבון שלא דרמה אם לא הבנתם אותם.\n\nשם המתרגל/ת:  בת שבע.\nחוות דעת - תרגולים: מתרגלת מצוינת! מגיעה כמה דק לפני השיעור כדי לכתוב את הסיכום של ההרצאה על הלוח וגם בהפסקה מכינה את הלוח לשעה הבאה. יש לה כתב מושלם:) ובתחילת כל שיעור היא מסבירה את החומר התיאורטי שהיה בהרצאה לפני שניגשים לפתור תרגילים.\nלאחר התרגול האחרון באותו שבוע מתפרסם פתרון רשמי מוקלד במודל. \n\nשעורי הבית:  גיליון שבועי. 10% תקף, נלקחים בחשבון 9 הגיליונות עם הציון הכי גבוה, הבדיקה לא מאוד קפדנית ואפשר לקבל מאיות.\nרוב השאלות מרופרנסות משנים קודמות, יש אולי שאלה או שתיים חדשות. \nשיעורי הבית באמת עוזרים להטמיע את החומר.\nשעות הקבלה של יואב דניאלי היו מעולות, הוא מתרגל הרבה שנים בקורס וזוכר את השאלות.\n\nהמבחן: וואו, היה קשה עם שאלות לא ברורות. יחסית הקלו בבדיקה על טעויות נגררות ונתנו פקטור מטורף (77 זה 100 ו33 זה 55)\n\nהשורה התחתונה: לא לשכוח לגמרי מאינפי 2...", "timestamp": 1716735082108}, {"author": "עוד אחד", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורן בהקלטות מהסמסטר הנוכחי.\nחוות דעת - הרצאות: אורן באמת באמת גאון, על אף כל התלונות שיש לאנשים הוא באמת מתאמץ להנגיש את החומר והוא בסך הכל מרצה בסדר גמור. אני ראיתי אותו על 1.4 כי היה קשה להפריד בין המילים במהירות גבוהה יותר והרצתי קדימה את הגמגומים, וזה אפשר לי לראות את ההרצאות בשעתיים, לגמרי נסבל.\n\nשם המתרגל/ת: תם\nחוות דעת - תרגולים: תם מקסים, מתרגל מעולה ומעביר את החומר בצורה מעולה, ומוודא הבנה אחרי כל צעד גדול. באמת באמת ממליץ עליו. \n\nשעורי הבית: גיליון אחת לשבוע, לוקח כמה שעות (תלוי בכמה אתם על החומר). ראוי לציין שרמת הגליונות נמוכה מרמת המבחן.\n\nהמבחן: המבחן אצלינו היה קשה מאוד אבל הפקטור היה נדיב. ממליץ להתחיל ללמוד למבחן מספיק זמן מראש כדי להתאקלם לסוג השאלות והרבה, כי הגליונות לא מדמים.\n\nהשורה התחתונה: אני חושב שהחומר בקורס מעניין מאוד ורלוונטי, אך עם זאת קשה ורמת הביצוע הנדרשת במבחן גבוהה מאוד. זה קורס חובה אז אין יותר מדי ברירה, אבל מקווה שהתוכן יעניין אתכם.", "timestamp": 1716884387856}, {"author": "E", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: הסגל מפרסם דפים שמסכמים את החומר של התרגול וגם את השאלות והפתרונות המלאים אליהם, והם מאוד טובים לפי דעתי. הרגיש לי שהדפים האלה די סיכמו לי את החומר ושהאינטואיציה בעה מפתירת התרגילים שם ובשיעורי בית.\n\nשעורי הבית: יבשים אבל די עמוסים. הם יחסית ממוחזרים אז אפשר להיעזר ברפרנסים וזה מאוד עוזר להבנה.\n\nהמבחן: די קשה. פשוט לפעמים נתקעים על כל מיני עניינים של אינפי (הגיוני סך הכול שהקורס ירצה את זה, אבל זה מרגיש יותר מידי)\n\nהשורה התחתונה: חומר שמתחיל די בסדר וה-3 שבעות האחרונים (לפחות בסמסטר שלי) נהיה מאוד קשה. קורס חובה, ובשביל להוציא ציון גבוה צריכים להיות טובים באינפי.", "timestamp": 1717580373825}, {"author": "gg", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לואידור מוקלט\nחוות דעת - הרצאות: \n3 שעות שבועיות של שיעמום מוחלט ובלבולי מוח בתוספת ששש ששש ששש ששש\nלא מומלץ אבל אין אלטרנטיבה.\nשם המתרגל/ת: תם\nחוות דעת - תרגולים: \nאחלה תם מסביר מאוד ברור ופותר בצורה מסודרת שגם עוזרת ללמוד את החומר. לרוב גם עובר על הדברים הרלוונטיים שראינו בהרצאה וזה עוזר להבין את החומר.\nשעורי הבית: \nגיליון שבועי, דיי צ׳יל ומרופרנס.\nהמבחן: \nהזיה מוחלטת, אבל פקטורים בהתאם אצל לואידור\nאצלנו על ציון x על הטופס הציון הסופי היה 1.15x+12 ולאחר מכן עוד 10 אחוז מגן\nהשורה התחתונה: \n60 וממשיכים", "timestamp": 1718041148411}]}