{"posts": [{"author": "Tamir Shazman", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: גרגורי גורן \nחוות דעת - הרצאות: \nמרצה בנוני מינוס\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהמבחן לא קשה מבחנית רמת הקושי, אבל מבחינת הזמן הוא לא סביר. מרגיש כמו פסיכמוטרי\nהשורה התחתונה:", "timestamp": 1600929710232}, {"author": "מוחמד עזאיזה", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: גרגורי גורן\nחוות דעת - הרצאות: \nהקורס מעניין מאוד וחושף את הסטודנט בקטנה לכל מיני נושאים ידועים בעולם הדאטא סיינס כמו קלסטרינג, אחזור מידע, ומערכות המלצה. ההרצאות מעניינות מאוד, וזה אולי הקורס היחיד בתואר שאפשר להגיד שלא השתעממתי אף פעם באף הרצאה בו, אך הקושי הטמון בקורס הוא בזה שלאור העובדה שהקורס מנסה ללמד נושאים שההתעמקות בהם מצריכה ידע שנרכש מאוחר יותר בתואר (ידע בסטטיסטיקה למשל ובאלגברה יותר מתקדמת מאלגברה א'), יוצא בסוף שיש המון היוריסטיקה במה שמלמדים את הסטודנט ולא תמיד קל להתמודד עם ההבנה של זה, או אפילו להבין מאיפה זה נובע. קרה לי מספר פעמים שמצאתי את עצמי נאלץ לקבל דברים \"כפי שהם\" בחומר בקורס מבלי להתעמק, כי קל מאוד ללכת לאיבוד בחומר אם מנסים למצוא הסברים באינטרנט עליו.\nהחומר עצמו לא עמוס במיוחד, אך מצריך חזרה עליו כדי להבין אותו היטב, לא תמיד מבינים היטב בפעם הראשונה או השנייה.\nבנוגע למרצה עצמו- גרג מרצה טוב מאוד, מעביר את רוב החומר בבירור, ולדעתי מצליח להעביר את החומר בדרך כך שהסטודנט נשאר מפוקס ולא הולך לאיבוד בעומק של החומר, אשר קל מאוד ללכת לאיבוד בתוכו כפי שצויין למעלה.\nשם המתרגל/ת: איתי הראל\nחוות דעת - תרגולים: \nהתרגולים בקורס לא עוסקים בנושאי ההרצאות בדיוק, אלא מלמדים את שפת פייתון ופקודות וספריות בה אשר משומשות לצרכים של הקורס. המתרגל איתי מלמד טוב בסך הכול, והתרגול סביר ואולי לפעמים משעמם קצת, אבל כשהתרגול הוא על פקודות של שפת תכנות, יש גבול לכמה זה יכול להיות מעניין, בלי קשר למי מתרגל את החומר. התרגולים לא עמוסים מדי אבל גם לא קלים, יש כמות מכובדת של חומר בתרגולים, אולם לא כולו רלוונטי למבחן, אך כולו כן רלוונטי לתרגילי הבית.\n\nשעורי הבית: \nשיעורי הבית עמוסים בקורס ברמה לא נורמלית ביחס לקורסים אחרים, מדובר על 35% ציון תקף אשר 30% מהם מחולקים ל4 תרגילי בית רטובים (עם חלק יבש קצר), שכמעט כל אחד מהם לוקח בכיף שני ימים וחצי של עבודה במצטבר, ואולי 3, תלוי בכמה דיבאגינג צריך לעשות. התרגילים, בעוד שהם יכולים להיות יחסית כיפיים לביצוע (לא כולם), יכולים גם להיות מייגעים ברמה לא נעימה כל-כך. התרגילים מפורסים פעם בשבועיים וחצי בערך.\nוה5% האחרים הם  הגשת 5 מתוך 6 תרגילי מעבדה אשר גם הם מייגעים ברובם, כמות העבודה הדרושה בשבילהם, בעוד שברוב המעבדות היא פחות מכמות העבודה הדרושה לתרגילי הבית, היא עדיין לא פרופוציונלית למשקל (המגוחך) שניתן לתרגילים הללו, הלוא הוא 1% עבור כל מעבדה, אשר תדרוש בערך יום עד יומיים עבודה, והציון בה בינארי, כלומר או 0 או 1.\n\nהמבחן: \nהמבחן זה החלק הכי קשה בקורס, כיוון שהוא לא מודד ידע כפי שהוא מודד זריזות, מהירות, ואת התנהלות הזמן של הסטודנט תוך כדי בחינה. מבחינת חומר, הבחינה תדרוש מהסטודנט לדעת טוב מאוד את חומר ההרצאה ברמה של לזכור הערות קטנות ולהבין בערך כל פיפס קטן בחומר ההרצאה, בנוסף לזה דרושה מיומנות טובה בכתיבה בפייתון, כי במבחן תמיד יש שאלת פייתון שקשורה לחומר ההרצאה, בה צריך לממש בסעיפים פונקציות פייתון, וצריך להיות מהיר כי זה החלק שלוקח הכי הרבה זמן במבחן. המבחן עצמו הוא שעתיים, אבל בפועל צריך בין שעתיים וחצי ל3 שעות כדי לפתור אותו במלואו עבור הסטודנט הממוצע. מעטים הם אלה שיסיימו את כל המבחן בזמן המוקצב. אם ניגשים עם מטרה לציון טוב אך לא בהכרח 100, עדיף תוך כדי המבחן לבחור סעיף שפתרונו ארוך ואין עליו יותר מדי נקודות, שמוותרים עליו מראש.\nעוד נקודה לציון היא שהציון בבחינה גם ממש תלוי-מרצה, למשל גרג היה הוגן בבדיקה, בעוד שמרצים קודמים (אורן קורלנד למשל) הרבה יותר קשוחים בבדיקה, וסטודנט שמקבל ציון טוב אצל מרצה אחד, עלול עבור אותה בחינה בדיוק לקבל ציון גרוע אצל מרצה אחר. זה קורה כיוון שהשאלות על החומר במבחן לא כל-כך ברורות במובן שאין בדיוק \"תשובה נכונה\" ברורה לרוב השאלות, זה יותר לפי שיקול הדעת של המרצה, מה שנותן גמישות למרצה בבדיקת המבחן.\nהשורה התחתונה: \nקורס מעניין מאוד, אך עמוס מדי מבחינת תרגילי הבית שנותנים בו, הרבה יותר מדי. כמו כן, המבחן טריקי מאוד וקל לקבל בו ציון שלא משקף באמת את רמת הידע של הסטודנט בקורס, רק בגלל התנהלות זמנים לא אופטימלית במבחן/ מרצה ששוחט בבדיקת המבחנים.", "timestamp": 1604374102767}]}