{"posts": [{"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: מרוחות אבל חומר מעניין\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: לא מובנים אבל לא כל כך חשובים\n\nשעורי הבית: הרבה, תכנות\n\nהמבחן: לא קשה בהגזמה אבל מורידים נקודות עבור כל טעות \n\nהשורה התחתונה: קורס מאד מעניין וחשוב, מנוהל בצורה נוראית וההשקעה הנדרשת בכלל לא משקף את הנק\"ז (הוסיפו מעבדות לצפייה בבית כולל עבודה להגשה כל שבועיים)", "timestamp": 1626355861935}, {"author": "לא כיף לי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: גיא/ אורן? מי יודע\nחוות דעת - הרצאות: \nאחרי איזה 2 הרצאות אורן נהיה חולה לשאר הסמסטר וגיא החליף אותו הרצאות של שעה בשבוע אז לא נורא אבל לגיא לא היה מושג מה החומר יקרה את החומר של ההרצאה מהאינטרנט אז לא היה מובן.\n\nשם המתרגל/ת: לירון טומרקין\nחוות דעת - תרגולים: \nהוא ממש משעמם ולא עונה על שאלות באמת קשה להקשיב לו הוא דופק על השולחן הרבה אבל המחברת תרגול שלו נוחה.\n\nשעורי הבית: \nממש ממש מממממש לא פרופורציונלי לקורס של נקז וחצי עבדנו על זה יותר מכל דבר אחר בערך יש מלא עבודות ורובן בסדר המעבדה הראשונה נוראית ולא קשורה לשאר החומר.\n\nהמבחן: \nלא טוב בכלל 20 שאלות אמריקאיות תשובה נכונה 5 נקודות תשובה לא נכונה מינוס 2, השאלות על החומר של התרגול היו בסדר אבל על החומר של ההרצאות היו מבלבלות ולא ברור איך הלך.\n\nהשורה התחתונה: \nהתעללות ממש לא פרופורציונלית לקורס של נקז וחצי..", "timestamp": 1626468312716}, {"author": "המינוס 40", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות:  ההרצאות נורא מעניינות ומרצה יחסית סבבה הבעיה היחידה זה היחס לסטודנטים\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: מתרגל ממש טוב משקיע ורוצה לעזור לכולם\n\nשעורי הבית: שיעורי בית זה מילה קטנה לעומת העומס שהיה בקורס. הקורס עצמו בסך הכל נקז וחצי והיו בו יותר משימות שהיו בכל הקורסים בסמסטר יחד. \n\nהמבחן: מבחן פשוט מעצבן  מבנה המבחן היה מבחן סיבירי כלומר על כל שאלה שאתה צודק זה פלוס חמש וכל טעות היא מינוס שתיים. ולכל מי שחשב שזה אומר שהציונים נעו בין 60-100 טועה ובענק כי הציונים נעו בין מינוס 40 ל100.\n\nהשורה התחתונה: קורס מעניין, עמוס והמבחן לא הוגן בקיצור כמו 99% מהקורסים בטכניון", "timestamp": 1626617884861}, {"author": "פופ סמוק", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: כל המצגות באנגלית מוגזמת. יש טעויות דקדוק באנגלית אז למה להשתמש בכזו שפה גבוהה?\nהמרצה איחר באופן קבוע לשיעורים , בעל ניסיון גדול ואיש רציני אבל איחר לנו כל פעם\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: הקראה מדף שנכתב בגוגל COLAB , לא לומדים יותר מדי בתרגולים , בעיקר קוראים פייתון. מי שאין לו ניסיון יהיה לו מאוד קשה\n\nשעורי הבית: מוגזמים. קורס של 1.5 נק\"ז שכל שיעורי בית לוקחים 3 ימים ואין שום הקדמה לכך בשיעורים עצמם\n\nהמבחן: בסדר\n\nהשורה התחתונה:", "timestamp": 1626678537548}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: אורן מרצה עם ניסיון בתחום, אבל מורגש כאילו הוא מרחף מעל הסטודנטים. לא מדבר בגובה עיניים אבל הוא כן יודע להעביר את החומר. \n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: התפקיד שלו היה בסך הכל להקריא ממחברת תרגול באינטרנט. לא מרגיש שהוא עשה משהו מעבר.\n\nשעורי הבית: בתור אחד עם ניסיון טוב בפייתון, זה לא לקח לי הרבה זמן. אבל, וזה אבל גדול, לאנשים בלי רקע זה הולך להיות סיוט. פרוייקטים ארוכים מאוד, שדורשים המון השקעה. מה שכן, ההוראות מאוד ברורות אז אם הולכים שלב אחר שלב יהיה בסדר. \n\nהמבחן: אין כמעט מאיפה לתרגל, חוץ מהחלק של פייתון שכן נתנו שאלות חזרה. שאלות תיאורטיות מורכבות וכן דורש מעבר על המצגות והבנה עמוקה של החומר.\n\nהשורה התחתונה: קורס מוגזם מאוד ביחס ל1.5 נק\"ז. חומר מאוד מעניין אבל סגל שמנהל אותו כאילו זה בדיחה עבורם.", "timestamp": 1626711215229}, {"author": "-40", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: החומר הועבר בצורה ברורה. בסמסטר שלנו, למשך כמה הרצאות מרצה בשם גיא החליף אותו שהיה פחות מובן.\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: למידת סינטקס בפייתון. חשובים למי שאין לו רקע.\nעם זאת, תרגולים לא מעניינים, הקריא ממחברת\n\nשעורי הבית: כמות גדולה של עבודות בית. עומס גדול מאוד ביחס לקורס של נק\"ז וחצי.\n\nהמבחן: היה מבחן אמריקאי טריקי ביותר, שכל טעות מורידה בנוסף למשקל השאלה עוד מינוס 2. מבחן לא קל, לחוץ מבחינת זמנים.\n\nהשורה התחתונה: קורס לא קל שדורש הרבה מאוד השקעה. מרגיש שצוות הקורס לא בא לקראת הסטודנטים ומחפש \"להפיל\" אותם.", "timestamp": 1626897652856}, {"author": "בא לי שנצ", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  קורלנד\nחוות דעת - הרצאות: \nלא נדבר על זה שחצי מהסמסטר הוא לא היה פה אבל לא עושה לחומר צדק, מקשקש על השטויות שלו שוב ושוב\nחושב את עצמו מרצה של מינימום אינפי 5 ממ לוקח תקורס יותר מדי ברצינות \n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: \nמשעמם לא הרבה מעבר\nשעורי הבית: \nפתירים אבל רוב החומר שמשתמשים בו כדי לפתור הם מפרופסור גוגל וכמות שיעורי הבית לא תואמת את הנקז של הקורס המסכן הזה\nהמבחן: פחחחחחחח מינוס שתי נקודות על שאלה לא נכונה(יעני אפשר להגיע לציון שלילי) רוב המבחן דיבר על ההרצאות האחרונות \n\nהשורה התחתונה: לפי כמות הנקז של הקורס כל מה שיש לי לומר זה שלוש מילים:\nמלג לא מומלץ", "timestamp": 1626898369357}, {"author": "השכנה הקרובה ביותר", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: קורלנד/ גיא\nחוות דעת - הרצאות: ההרצאות של אורן היו מעניינות ובקצב טוב. ההרצאות של גיא גם היו די מעניינות אבל מאוד איטיות, הרגישו שקצת הפילו עליו את הקורס הזה בזמן שקורלנד היה צריך הפסקה. חבל, אבל זה כנראה הייתה בעיה רק של הסמסטר שלנו אז אתם תהיו בסדר.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: התרגולים של לירון היו מיותרים לחלוטין, וגם משעממים. חוץ מזה, לירון היה מאוד לא נחמד בהתנהלות מולו. אפשר לוותר על התרגולים לחלוטין, להיעזר בגוגל (את זה בכל מקרה תצטרכו לעשות), ולחזור על מחברות התרגול שלו במשך שעתיים לפני המבחן. \n\nשעורי הבית: קשים, לוקחים הרבה זמן, במיוחד התרגיל הראשון של bash (לקח לנו יומיים) אבל גם שאר התרגילים לוקחים זמן במיוחד לנו שבאנו בלי כל כך הרבה רקע תכנותי.\nאין כמעט מקורות למידה חוץ מגוגל, וזה גם מקשה מאוד.\n\nהמבחן: חצי נוגע לחומר של הקורס, חצי חידות פייתון מתחכמות כאלה שלירון המציא. מבחן שמאוד מבוסס על הבנת הנקרא, הציון די רנדומלי :(\n\nהשורה התחתונה: אחד הקורסים המעניינים שהיו לי הסמסטר! באמת, כיף ללמוד סוף סוף את המקצוע שאנחנו הולכים לעבוד בו. זה קורס שמרגיש מאוד פרקטי. עם זאת, דורש המוןןןן עבודה קשה והסגל לא מאוד עוזר.", "timestamp": 1626900280018}, {"author": "הארי סטיילס", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  אורן / גיא\nחוות דעת - הרצאות: אורן מרצה סבבה לגמרי, גיא הגיע באמצע סמסטר, לא ידע את החומר והיה ממש משעמם. מבחינת יחס לסטודנטים היה בעיקר חוסר התחשבות וזלזול מצד שניהם.\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: משעמם, מזלזל ובעיקר מיותר. אנשים עם רקע - תקראו את המחברת תרגול בזמנכם הפנוי. אנשים בלי רקע (כמוני) - לכו ליוטיוב וגוגל. התרגולים היו בעיקר שעתיים משעממות שבהן לירון מקריא את המחברת ולכל שאלה הוא עונה שיש לנו את המחברות ונבדוק לבד. באופן כללי התרגול הרגיש יותר כמו תזכורת לאנשים שיודעים פייתון על דברים שהם למדו, ואפס ניסיון ללמד את מי שלא. מאוד מתסכל!!\n\nשעורי הבית: חסרי פרופורציה לגמרי! היו 4 תרגילי בית ו5 מעבדות, וזה אחרי שהורידו לנו תרגיל בית אחד ומעבדה אחת. המעבדה הראשונה בבאש לא קשורה לשום דבר ולא יעילה בכלל. היה גם תרגיל בית שהציון ניתן ביחס לסטודנטים אחרים. תרגילי הבית בקורס הזה לקחו לי יותר זמן מאינפי + הסתברות + כל קורס אחר. שלא לדבר על זה שעשינו מעבדות ותרגילים על חומר שעוד לא למדנו ולמרצים / מתרגלים כמובן לא היה איכפת. \n\nהמבחן: אמריקאי עם 20 שאלות, אבל מורידים 2 נקודות נוספות על כל טעות. היה בסוף פקטור של 8 נקודות. המבחן היה בשני חלקים: חלק תיאורטי על ההרצאות שהיה מאוד מבלבל וטריקי. לא הספיק לעבור על ההרצאות והשאלות הרגישו כמו ניחושים. החלק השני היה בפייתון (על התרגולים) - גם כאן טריקים קטנים ודברים שלאו דווקא הקדשנו להם זמן בתרגול.\n\nהשורה התחתונה:  קורס שהיה יכול להיות מעניין מאוד אבל הצוות הצליח להפוך אותו לקורס נוראי שמוציא חשק מהתואר.", "timestamp": 1626963486403}, {"author": "Unknown", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן/ גיא\nחוות דעת - הרצאות: בתחילת הסמסטר אורן היה המרצה, וגיא החליף אותו לרוב הסמסטר . אורן הרבה יותר מקצועי ועם שליטה בנושאים שהוא מעביר, אבל מזלזל מאוד בסטודנטים, עונה בחוסר נעימות על שאלות ופשוט עושה אוירה לא נעימה בהרצאות.\nגיא לעומתו עשה כל מאמץ להסביר ולענות על דברים שלא הבנו.\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: השעתיים הכי מיותרות שיש לכם במערכת. כל מה שהוא עושה זה להקריא לנו כל מיני פקודות בפייתון, דברים שבהחלט אפשר (ואפילו רצוי) ללמוד לבד. \n* אציין שיש גם מעבדות, אנחנו ראינו הקלטות של המעבדות מסמסטר קודם שליאור הקליט. באופן כללי הנושאים שמועברים במעבדות הם מה שכבר עברנו עליו בהרצאות, אז די מיותר . \n\nשעורי הבית: יש גם שיעורי בית וגם מעבדות, כמעט בכל תרגיל הגשה היו נושאים שעוד לא הגענו אליהם בהרצאות. \nכמות השיעורי בית לא פרופורציונלית ביחס לעובדה שזה קורס של 1.5 נקז, כל תרגיל בית לוקח המון זמן\n\nהמבחן: 20 שאלות אמריקאיות, מינוס 2 נקודות על כל טעות. קיבלנו במועד א' פקטור של 8 נקודות \nהשאלות בחלק הראשון היו תאורטיות וקשורות להרצאות, בהחלט היו שאלות הזויות שלא הייתה דרך סבירה לענות עליהן. בחלק השני היינו צריכים לנתח פלט של קוד בפייתון (די מנותק ממה ש\"למדנו\" בתרגולים)\nוהשיא- לא מעלים את המבחן או הפתרון שלו למודל, ככה שאם לא הולכים לפתיחת מחברות, אין דרך לדעת איפה טעינו\n\nהשורה התחתונה: חבל שזה היחס של הסגל לקורס מבוא בתואר, שיש לו פוטנציאל להיות מעניין אבל הפך להיות בלתי נסבל ומועקה. \nתהיו חזקים", "timestamp": 1627123509496}, {"author": "אורי גלר", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: יודע את החומר מצוין ורץ עליו, אם הוא היה רוצה שהסטודנטים ידעו את החומר ולא רק לעשות את המינימום הנדרש ממנו אולי יכל להיות קורס מעניין\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: רובוט שמקבל פקודות, בתרגולים הקריא לנו רשימות של ספריות בפייתון ולכל בעיה שצצה לאורך הקורס סיפק תשובה שבלונית וחסרת משמעות\n\nשעורי הבית: דורשים ידע שפשוט לא מלמדים בהרצאות והתרגולים וגם מה שכן מופיע בהרצאות מופיע יום או יומיים לפני תאריך ההגשה, מה שגורם לכך שבתכלס למדנו הכל לבד וקורס של נקז וחצי דרש יותר זמן מכל הקורסים האחרים ביחד \n\nהמבחן: מבחן אמריקאי בקריאת מחשבות, כל שאלה מנוסחת בצורה יותר גרועה מזאת שקדמה לה ולנו נותר רק לנחש מה הייתה כוונת המשורר, זה בנוסף לכך שפשוט אין שאלות לתרגל מהן, כל קשר בין שיעורי הבית למבחן מקרי בהחלט, אין מבחני עבר כי קורלנד מחביא אותם והשאלות לתרגול לקראת המבחן הועלו ביום שלפני המבחן וללא פתרונות רשמיים.\n\nהשורה התחתונה: בהצלחה למנחשים", "timestamp": 1627489927162}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: החומר מעניין מאוד, וסוף סוף מתחילים להבין על מה התואר. חבל רק שהמרצה לא טוב בכלל. \nיש לו ידע רב בתחום אבל הוא נורא בלהעביר את החומר ולא אכפת לו מהסטודנטים. באמצע הסמסטר נעלם לנו וגיא החליף אותו. לגיא אין נסיון רב בתחום, אבל הוא השתדל שנבין.  \n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: הוא פשוט קורא ממחברת התרגול, לא כריזמטי והתרגולים די משעממים. \n\nשעורי הבית: דורשים הרבה יותר מדי עבודה בשביל נקז וחצי. יש גם תרגילי בית וגם מעבדות, המעבדות די קלות אבל התרגילי בית דורשים הרבה שעות עבודה.\n\nהמבחן: הורידו לנו 2 נק' נוספות על כל טעות... enough said\n\nהשורה התחתונה: בכללי החומר מעניין מאוד, חבל שלסגל לא אכפת מהסטודנטים ושהם הרסו את ההתלהבות שהיה לנו בהתחלה.", "timestamp": 1627652277831}, {"author": ":)", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: נושאי ההרצאה מעניינים בטירוף. הבעיה היא שזו פעם ראשונה שאנחנו נחשפים למידע מהסוג הזה, והמונחים נוחתים יחסית מהר ובאופן מאוד לא ברור. מה גם שהמצגות באנגלית, והמרצה מדבר בעברית וממש מתרגם אותה בזמן שמנסים לקרוא, מה שבסה\"כ מקשה. ניכר שאורן מבין את החומר טוב, אבל זה קצת ג'יבריש למי שלא מגיע מהעולם בשיעורים הראשונים.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: לא קשורים לחומר ההרצאה באף צורה. מקריא ממחברת על פייתון.. בטוח שיש ללירון מלא מה לתת, אבל החומר לא מאפשר כל כך.\n\nשעורי הבית: לא פרופורציונליים לעובדה שהקורס הזה הוא נק\"ז ובמבה\n\nהמבחן: להקיא ממנו. מנסים להכשיל בכוח כעקרון - שאלון אמריקאי שמורידים בו נקודות על תשובה שאינה נכונה. מה גם שלא יצא יותר מדי להשתפשף עם שאלות אבל אני מקווה שזו לא תהיה בעיה יותר לקורסים הבאים..\n\nהשורה התחתונה: 1.5 נק\"ז שמתאמצים להיראות כמו 15. מעיק", "timestamp": 1630239361497}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופרה אמיר\nחוות דעת - הרצאות: סהכ היו בסדר. עופרה מנסה לגרום לחומר להישמע מעניין ובתכלס הוא חשוב כי זה באמת היכרות ראשונית עם כל הנושא של התואר אבל אפשר גם לא להגיע. הרוב המוחלט של הלמידה בקורס זה תרגולים ואפשר להסתפק בלקרוא את המצגות של ההרצאות כדי לסמן על זה וי.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: רוב התרגולים של לירון מסתכמים בזה שהוא מקריא מהמחברות פייתון וקצת מהמצגות, ועונה מדי פעם על שאלות. מלא פעמים הוא עונה \"תנסו לבד\" או \"תחפשו בעצמכם\" ומרגיש שזה קצת מתחמק. התרגולים כן חשובים כי את הקורס לומדים כמעט רק מהם.\n\nשעורי הבית: היו שלושה תרגילים בפייתון שמגישים בזוגות. לוקחים זמן וזה לכתוב הרבה קוד אז רצוי לא לדחות אותם לרגע האחרון כי לפעמים יש באגים ובעיות שלוקח זמן לתקן. העבודה עם הVM הייתה די סיוט כי גם לא טורחים להסביר איך לעבוד עם זה אם לא באים לשעת קבלה ושואלים ספציפית, אז ממליץ לכם בתחילת סמסטר ללכת לאיזו שעת קבלה ושהמתרגל יעזור לכם לסדר את הVM.\n\nהמבחן: מרגיש די מחורטט. 20 שאלות אמריקאיות, רובן די טריקיות והניסוחים מבלבלים. מרגיש שאין להם מה לשאול במבחן אז הם מנסים סתם להוסיף קושי בצורה מלאכותית.  הסגל באופן עקבי כבר כמה סמסטרים לא מפרסם את המבחנים/הפתרונות אז גם אין מאיפה לתרגל שאלות, שזה מבאס. בכל זאת זה קורס של נק\"ז וחצי אז כל עוד עברתם הציון לא ידגדג לכם את הממוצע.\n\nהשורה התחתונה: קורס סבבה, אבל לא פרופורציונלי לכמות הנק\"ז שלו ביחס לכמה זמן צריך להשקיע בתרגילי בית (שהם תקף 20%). המבחן די מציק.", "timestamp": 1658235790822}, {"author": "קלסתרון", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עפרה עמיר\nחוות דעת - הרצאות: \nמרצה מעולה, ההרצאות היו יותר שיתופיות עם הסטודנטים והייתה הרגשה פעילה במהלך ההרצאות. בנוסף עפרה עצמה מאוד נחמדה, ומהבנתי מסמסטרים קודמים, היא עדיפה בהרבה על קורלנד\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: \nלירון אמנם ניסה להעביר את התרגולים בצורה מעניינת, אך בפועל רוב ההרצאות התמקדו בקריאת קוד ממחברת colab, כך שבאיזשהו שלב זה הרגיש מעט מיותר\nשעורי הבית: \nלמיטב הבנתי העומס של הקורס ירד משנים קודמות, וטוב שכך, אבל אף על פי כן, כמות ההשקעה שניתנה לכל תרגיל בית לעומת המשקל הכולל שלה (ושל הקורס באופן כללי) לא פרופורציונליים בכלל. לדעתי האישית הקורס הרבה יותר כבד מלא מעט קורסים אחרים בתואר, והמשקל שלו צריך להיות בהתאם \nהמבחן: \nאמריקאי, אין מבחני עבר ללמוד מהם (הסגל שומר על המבחנים של הקורס בצורה שלא הייתה מביישת ארגון ביון), לכן במהלך הלמידה למבחן הייתה תחושה של גישוש באפלה.\nהמבחן עצמו היה מבלבל, אבל עם מספיק שינון של המצגות והמחברות מהתרגולים אפשר להצליח\nהשורה התחתונה: \nקורס מאוד מעניין, ופה פעם ראשונה באמת מבינים מה המשמעות של הנדסת נתונים. אמנם המשקל שלו הוא אפסי (פחות ממל\"ג), אבל הנושאים עצמם מאוד רלוונטים, וכן מומלץ להתעמק בנושאים הנלמדים", "timestamp": 1658380218287}, {"author": "איש", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עפרה עמיר\nחוות דעת - הרצאות: מרצה טובה. מסבירה את הקונספטים בעניין ונותנת הרבה דוגמאות להמחשה שמסייעות. לפעמים מתעכבת קצת לדיונים מיותרים שמאטים את הלמידה של החומר.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: סה\"כ סבבה אבל מהיר קצת מהיר מדי, בעיקר בחלק של הפייתון שבו למי שלא היה ממש ידע קודם צלל למים העמוקים. בתכלס הקורס הזה מושתת לגמרי על התרגולים, חשוב מאוד להבין אותם.\n\nשעורי הבית: שיעורי הבית אצלנו היו שלושה פרויקטים רטובים שמתבססים על מודלים שנלמדו בהרצאה. הפרויקטים לא קשים במיוחד אבל כן דורשים זמן והשקעה, מזכירים את הסגנון של הנדסת תוכנה. לחלוטין לא משקפים רמת השקעה של 1.5 נק\"ז.\n\nהמבחן: לא נורא מדי, אבל כן בעייתי. אצלנו היו 20 שאלות אמריקאיות, ולא נתנו מבחנים משנים קודמות בפורמט דומה כדי להתאמן עליהם. ללא ספק הממוצע היה גבוה יותר אם היו משחררים תרגילים בסגנון. הבנתי שהקורס די משתנה מסמסטר לסמסטר מבחינת אופני ההערכה שלו ולכן קשה לדעת מה יהיה בעתיד.\n\nהשורה התחתונה: קורס חמוד, חשיפה מעניינת לנושא האמיתי של התואר, אבל לחלוטין שווה יותר מ-1.5 נק\"ז וקצת מבולגן.", "timestamp": 1658394303781}, {"author": "יוסי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: לא\n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: לא\n\nהמבחן: גם לא\n\nהשורה התחתונה: עדיין לא", "timestamp": 1658661432628}, {"author": "kfir eliyahu", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עפרה עמיר\nחוות דעת - הרצאות: בהרצאות שהייתי הייתה אחלה. מעבירה את החומר די לאט אבל בצורה ברורה. מדי פעם העלתה דיונים בכיתה. יש את המצגות של ההרצאות במודל ובשלב מסוים עברתי אליהן ולא הרגשתי יותר מדי חיסרון. הייתי עובר אליהן ואם משהו לא היה ברור הייתי שואל את המתרגל.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: עשה הכי טוב שהוא יכול עם הזמן שהקצו לו. לדעתי שעתיים תרגול לא מספיקות בשביל הקורס והוא די הוכרח לרוץ על החומר כדי להספיק הכל. עבדנו בעיקר עם colab והוא די רץ על המחברות שם. היו שני תרגולים שנקראו \"מעבדות\" ובהן כתבנו את הקוד של התוכנית לתרגול ההוא וממש עזרו להבין את החומר.\n\nשעורי הבית: 3 תרגילים במהלך הסימסטר. קשים ולוקחים לפחות יום-יומיים למי שלא מכיר פייתון לפני אבל מאוד מאוד חשובים להבנת החומר. צריך להתקין VM וחצי קורס הסתבך עם ההתקנה לתרגיל 1.\n\nהמבחן: אמריקאי עם 4 אופציות לכל שאלה. 20 שאלות ו5 נק' לשאלה. עפרה שינתה את הנוסח הנוראי של שנה שעברה עם מינוס נקודות לסימון תשובה שגויה. השאלות היו די מבלבלות ואין מבחנים במבנה דומה לתרגל כי גם אלו שהיו דומים הסגל לא שיתף כדי שנוכל לתרגל מהם. בסופו של דבר קיבלו עוד 2 תשובות בשאלות האמריקאיות במבחן לאחר שהתגלו כבעייתיות ובחלק הזה הסגל באמת לא עשה בעיות ושיתף פעולה. לא העלו היסטוגרמות אבל היה ממוצע 77.6 וחציון 80 לקורס.\n\nהשורה התחתונה: הקורס הכי מעניין הסמסטר בפער. פותח את ההתחלה של ההבנה בנושא. חבל שרק נק\"ז וחצי כי הוא גם מרגיש כמו 3 לפחות.", "timestamp": 1658856524221}, {"author": "ע", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: \nעפרה מאוד חמודה ומסבירה טוב, אבל איטית ומקדישה יותר מדי זמן לשאלות של הסטודנטים כך שלרוב לא היינו מספיקים לסיים מצגת קצרה תוך שעת הרצאה. באמצע הקורס פשוט התחלתי לעבור על המצגות ולדעתי זה עדיף \n\nשם המתרגל/ת: לירון + עומר\nחוות דעת - תרגולים: \nלירון לא ככ גרוע כמו שרושמים פה, הוא לא מסביר הכי ברור אבל באמת מנסה. קצת לא ברור איך בתור מתרגל אחראי יחסית צעיר (עדיין בתואר ראשון) הוא לפעמים לא מבין את הקשיים של הסטודנטים כאילו הוא נולד עם הידע איך להתקין VM או לכתוב קוד בפייתון\n\nאבל עומר הרבה יותר מובן אז אם יש לכם אפשרות לכו אליו\n\nשעורי הבית: \n3 תרגילים די ארוכים, כולם באותו סגנון, לממש בפייתון אלגוריתמים שלמדנו בקורס. אם יודעים פייתון זה כנראה לא כזה קשה\n\nהמבחן: יחסית פשוט אבל עם הרבה שאלות מבלבלות, גם אין כמעט מבחנים קודמים לתרגל. ממוצע באזור 80 אחרי שקיבלו עוד 2 תשובות בשאלות שונות ועדכנו ציונים פעמיים. מרגישים שלירון כתב את המבחן.\n\nהשורה התחתונה: קורס מעניין אבל אם יש לכם זמן תלמדו פייתון לפני, זה מאוד מאוד יעזור ויחסוך זמן בשיעורי בית. קורס יחסית עמוס לנקז וחצי", "timestamp": 1659954915360}, {"author": "KNN", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עפרה עמיר \nחוות דעת - הרצאות: ההרצאות בקורס הן סה\"כ שעה בשבוע והן לא כל כך עמוסות, ומהוות יותר אינטרו לכל הנושאים בקורס שנלמדים בתרגולים. עפרה העבירה את החומר די טוב וניכר שיש לה המון ניסיון אבל הקצב שלה די איטי ולפעמים היא מתעכבת על כל מני שאלות ודיונים לא חשובים שעולים בכיתה. לגמרי אפשר להסתפק בלקרוא את המצגות ולשאול בתרגולים מה שלא מובן.\n\nשם המתרגל/ת: לירון טיומקין\nחוות דעת - תרגולים: כמתרגל לירון בסדר. הוא משתדל להעביר את החומר בצורה ברורה אבל מנגד הרבה פעמים מתחמק מלענות על שאלות ומסתפק בלהקריא מהמצגות/מחברות colab. סהכ הקורס הזה נלמד נטו מהתרגולים, אז הם כן חשובים.\n\nשעורי הבית: יש שלושה תרגילי בית רטובים בפייתון, שהם בעיקר לממש את המודלים שנלמדים בהרצאות ובתרגולים ולהפעיל אותם על דאטאסט נתון. לוקחים הרבה זמן ודי מאתגרים אם אתם לא מגיעים עם ידע קודם בפייתון, אז אל תדחו אותם לרגע האחרון. בנוסף העבודה בהם היא עם Virtual Machine או VM, שכל הקורס בערך הסתבך עם ההתקנה שלו, אז מומלץ לבוא לשעות קבלה ולקבל שם עזרה עם זה.\n\nהמבחן: מבחן ממש מוזר ומעצבן. 20 שאלות אמריקאיות על החומר, כשהן בעיקר מנסות לבלבל ולהכשיל. סגל הקורס מסרב במשך כמה סמסטרים לפרסם את המבחני עבר מסיבה לא ברורה, אז אין כמעט איך לתרגל מעבר ללשנן את המצגות ולעבור עליהן פעם אחר פעם. סהכ זה קורס של נקז ובמבה אז המבחן הזה לא משנה כלום אבל עדיין ללמוד אליו די מציק.\n\nהשורה התחתונה: הקורס סבבה. החומר מעניין וזה היכרות ראשונית עם התואר בתכלס. פרקטי וגם מלמד על מה זה בתכלס על מה זה דאטא סיינס, אז סהכ השיג את המטרה שלו.", "timestamp": 1660316767640}, {"author": "D", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: ההרצאות היו שעה בודדת בשבוע. אפשר לקרוא את המצגות וזה סבבה לגמרי אבל באמת שעפרה מרצה טובה ומעניינת למרות שלפעמים קצת נגררת לדיונים. אם זורם לכם תבואו, אם לא - לא כזה נורא\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: התרגולים משעממים אין מה להגיד. היו 2 תרגולים שהיו \"רטובים\" כלומר כתבנו קוד בעצמנו תו\"כ התרגול ויכלנו להיעזר בעומר וזה היה סופר שימושי. סהכ מתרגל טוב וסבלני מאוד.\n\nשעורי הבית: היו 3 מטלות גדולות במהלך הסמסטר כשכל אחת מהן לקחה לי ולשותפה שלי בין 2 ל-3 ימים מאומצים (אנחנו ללא רקע בפייתון). מטלות די חופרות עם מעט מאוד קשר למבחן בסוף\n\nהמבחן: 20 שאלות אמריקאיות בשעה וחצי. הממוצע היה איזה 80 ומשהו. למידה קלילה של 3 ימים לפני\n\nהשורה התחתונה: קורס בסדר גמור-בסדר גמור", "timestamp": 1663498361506}, {"author": "מדואיד", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: גישה לא נעימה. אווירה של טירונות, טוב שלא עמדנו בשלשות לקבלת המרצה. לא מעביר את החומר טוב ומשרה אווירה שלא מעודדת שאילת שאלות, מה גם שההרצאות מאוד קצרות.\n\nשם המתרגל/ת: אורי מירז\nחוות דעת - תרגולים: אורי מעביר את החומר סבבה, זמין ונשאר אחרי לשאלות כדי להסביר מה שלא ברור. התרגולים די סבבה למי שיש לו רקע בפייתון, קצת פחות למי שאין כי הקצב די מהיר. ממליץ לעבור על השפה לפני שלוקחים את הקורס עם סרטוני יוטיוב.\n\nשעורי הבית: ארוכים מדי וגם לא מכוונים את הסטודנט טוב מבחינת הבנה של התיאוריה שהיא עוקר הקורס.\n\nהמבחן: המטרה היא שתכשל, כנראה מישהו מרוויח מאחוז נכשלים גבוה.\n\nהשורה התחתונה: באנו להנות, חטפנו סטירה מצלצלת.\n\nאיחלתי לחייל בהצלחה.", "timestamp": 1690286688315}, {"author": "nDCG", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: אורן הוא המרצה הכי גרוע שנתקלתי בו עד עכשיו. אמנם הוא חזק בתעשייה בנושא הזה, אבל בתור מרצה הוא פשוט עצלן תחת ורע. נתחיל מזה שבהרצאות שלו חצי מההרצאה הוא מדבר אל המצגת ולא אל הקהל. חוץ מזה הוא כמובן דואג להתנשא על סטודנטים כשהם שואלים אותו שאלות, וכל המצגות שלו באנגלית, כלומר העיבוד הדו-שלבי של החומר שמועבר, בעיקר למי שנתקל בזה בפעם הראשונה, מקשה על הריכוז. הסמסטר הייתה לנו שביתה של שלושה שבועות, ובזמן הזה לא שמענו כלום מאורן, לעומת מרצים אחרים שלפחות דאגו לעדכן אותנו. מה גם שאורן קבע הרצאת השלמה לכל אחת מההרצאות שפספסנו לאחר השביתה, אבל נראה שהוא קבע אותן רק כדי לקחת את הזמן יותר ברוגע, כי עדיין פיגרנו בחומר בשלושה שבועות בסוף הסמסטר. חוץ מזה, בהרצאה האחרונה הוא גם איחר עשר דקות וגם נתן לסטודנטית כלשהי לא מהקורס לעשות לנו ניסוי עם שוקולד במשך עשר דקות. כל דבר שהמרצה הזה עושה רק מראה עד כמה לא אכפת לו מהסטודנטים ומהקורס. הדבר שעוד יותר מרגיז - למרות כל התועבה הזאת, הוא מתנהג כאילו הקורס הזה הוא קורס של 4 נק\"ז מבחינת החשיבות שלו. בפועל זה קורס ששווה פחות נק\"ז ממל\"ג. אז מה עשינו פה בעצם?\nעכשיו, שלא תבינו אותי לא נכון, החומר נהדר ומהמם ואני מתה עליו. גם הכרתי אותו לפני, ומן הסתם שהוא מאוד חשוב ובסיסי לתואר. אבל לא חשבתי שאפשר לפקשש את העברת החומר הזה עד כדי כך. צריך להיות מוכשר בעצלנות וברוע כדי להיכשל כל כך בהעברת קורס כזה פשוט.\n\nשם המתרגל/ת: אורי מירז\nחוות דעת - תרגולים: אורי מתרגל נהדר. הוא מהיר, עונה על שאלות, והעביר את החומר בעזרת מצגות ומחברות גוגל קולאב שעוברות על כל החומר. היו כמה פעמים שבהן סיימנו לפני הזמן ובכל זאת התרגול הרגיש מאוד אפקטיבי. מה שכן, עבור מי שאין לו רקע, זה עלול להיות מאתגר מאוד זה שמנחיתים פתאום על הראש מלא פייתון.\n\nשעורי הבית: בגלל כל העניין עם השביתה היו לנו רק שלושה תרגילי בית, לדעתי די פשוטים אבל השניים הראשונים לקחו קצת זמן. נדמה לי שבעיני חלק מהסטודנטים זה גם מוגזם לקורס של נק\"ז וחצי.\n\nהמבחן: מגעיל. נבנה כדי להכשיל, כמובן. מה אפשר לצפות עוד מקורלנד? המבחן היה אמריקאי עם 20 שאלות, כשכל תשובה שגויה מענישה ומזכה את השאלה במינוס שלוש נקודות. כלומר - ענית על הכל נכון חוץ משאלה אחת? 92. יש שאלות שבהן עדיף לא לענות בכלל מאשר לקח את הסיכון שהתשובה תהיה שגויה. חוץ מזה, אורן שאל על נישות כל כך קטנות של החומר, שחלקן הועברו פשוט במשפט בהרצאה. בחיים לא נתקלתי בכזה מבחן. הסטטיסטיקה מדברת בעד עצמה. מערכת המבחנים באקדמיה היא מערכת הימורים והמרצה הזה והקורס שלו הם דוגמה חיה לכך.\n\nהשורה התחתונה: חבל שזה המרצה. שינוי אחד קטן והקורס היה יכול להיות נהדר.", "timestamp": 1690286760061}, {"author": "liaaa", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גורלנד\nחוות דעת - הרצאות: \nהרצאות גרועות, היה אולי 3 כל הסמסטר שעניינו אותי ובכללי מרגישים מהמרצה שלא כזה אכפת לו מהקורס והוא מאוד מנסה להכשיל יותר מאשר לעזור לסטודנטים לעבור.\nשם המתרגל/ת:  עומר נחום\nחוות דעת - תרגולים: \nאחלה מתרגל, מסביר את החומר בצורה טובה וברורה וגם עונה על שאלות.\nשעורי הבית: \nדי קלילים, תדאגו לשים לב להגשה בפורמט הנכון כי הם לא מתביישים לתת 0.\nהמבחן: \nנתנו ניקוד שלילי על שאלה לא נכונה. מבחן שממש מנסה להכשיל- וגם לא נתנו מבחני עבר, נתנו רק 10 שאלות חזרה בלי תשובות (!!!) ככה שהיה די קשה ללמוד למבחן. סה\"כ שאלות לא באמת קשות כי החומר קל אבל פשוט מרגישים שניסו להכשיל אותנו.\nהשורה התחתונה: \nהחומר מעניין אבל ההרצאות פשוט הורידו לי ממש. לפחות הוא קליל", "timestamp": 1690978995763}, {"author": "לעבור פקולטה", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: \nההרצאות היו לא אחידות בקרב חומר, היו הרצאות שלימדו מעט מאוד והיו הרצאות שהוא דחף חומר כמה שיותר. לא באמת לימדו משהו.\nשם המתרגל/ת: אורי מירז\nחוות דעת - תרגולים: \nמיותרים. לקרוא אותם בבית יותר מהיר ויותר מובן. גם האווירה בתרגולים הייתה קצת מעצבנת.\nשעורי הבית: \nבגלל השביתה היה פחות ממה שתכננו, ההבדל בין להצליח בהם בגדול לבין להיכשל כל כך קטן ולא קשור לחומר אז בהצלחה.\nהמבחן: \nעם ניקוד שלילי, היה פקטור של 19 נקודות, מתתי מצחוק, היו כבר עושים אמריקאי עם פקטור כזה וזהו. \nהשורה התחתונה: \nבקורס אין חומר ללמד ולכן המבחן לא אנושי, לא ברור למה הקורס קיים ככה. המסקנה היחידה לעבור מסלול כל עוד אפשר", "timestamp": 1691225811883}, {"author": "שומשומית", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: התוכן של ההרצאות מאוד מעניין. ניכר שלמרצה יש הרבה ידע בתחום. \nהמרצה מאחר לכיתה (הרצאה של שעה).\nהשאלות מהסטודנטים נערכות קצת כמו מסיבת עיתונאים - שואלים שאלה ואין מקום לדייק את השאלה, ישר עוברים לבן אדם הבא.\n\nשם המתרגל/ת: עומר נחום\nחוות דעת - תרגולים:  תוכן התרגולים נמצא במחברת google colab ויש בה קטעי קוד רבים. לא מספיק מתעמקיםם בהם בשיעור מבחינת סינטקס, את זה עושים בשיעורי בית. קשה לקרוא קוד מהמקרן בכיתה במשך שעתיים.\n\nשעורי הבית:  קצת עמוסים מידי לקורס של נקז וחצי. בעקבות השביתות הסמסטר היו לנו רק שלושה תרגילים שהאחרון בינהם בינארי.\n\nהמבחן: החלק המבאס בקורס. 20 שאלות אמריקאיות בשעה וחצי. הכנה למבחן - לעבור על החומר, להכיר טוב מושגים, לפתור את מעט שאלות החזרה שצוות הקורס מעלה במודל (בלי תשובות).\nאצלנו רוב השאלות היו מהצורה: \"איזו מהטענות הבאות נכונה\", עם חמש אפשרויות שאפילו לא בהכרח באותו נושא של הקורס. יש שם גם שאלות טריקיות קצת.\n\nהשורה התחתונה:  הקורס גרם לי להבין שבחרתי את התואר הנכון. הנושאים מאוד מעניינים, המבחן מבאס.", "timestamp": 1691411827177}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורן \n\nחוות דעת - הרצאות: תחליף מקצוע או שתעשה ויפאסנה של חודשיים בטיבט בחופשת הקיץ. תודה\nועכשיו ברצינות- אורן מקצועי ומעביר חומר מאוד מעניין אבל בן אדם לא נעים שמשרה אווירת מלחמה בכיתה וכל הגישה שלו מסתכמת במילה אחת- סמכותנות. \n\nשם המתרגל/ת: עומר נחום\n \nחוות דעת - תרגולים: מתרגל נהדר. יודע את החומר יודע להסביר וגם מכבד סטודנטים ועונה על כל השאלות \n\nשעורי הבית: לא קשים. שימו לב שאתם מגישים בדיוק לפי הפורמט, לפעמים מה שכתוב שם מאוד לא ברור או אפילו משתמע לשני פנים אז שווה את שלב ההגשה להשוות עם כמה זוגות ולוודא שכולכם הבנתם אותו הדבר.\n\nהמבחן: מכשיל סתם. כל שאלה מערבת לפחות 4 נושאים. ניקוד שלילי. אבל בתכלס לא קשה. אין מבחני עבר ללמוד מהם כי אורן לא רואה את טובת הסטודנט כרלוונטית. הלאה.\n\nהשורה התחתונה: קורס של נקז וחצי קחו באיזי.. החומר מעניין המרצה קצת יצור אבל לא סיבה להכשל.", "timestamp": 1691650626798}, {"author": "משהו", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: מונוטוניות \n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: עומר מתרגל סה\"כ בסדר \n\nשעורי הבית: שעורי הבית ע\"פ דעתי לא לימדו את הנדרש בקורס\n\nהמבחן: המבחן עצמו פיירי לגמרי אך התנאים בהם נבחנים קיצוניים ,מדובר במבחן אמריקאי כך שאם טועים יורד ניקוד ,יתר על כן קבלנו מבחן וחצי לתרגול.\n\nהשורה התחתונה: הקורס עצמו אינו קשה אך תנאי הלמידה נתונים ע\"פ דעתי אינם מאפשרים למידה טובה ,בנוסף ע\"פ דעתי קורס זה לא מלמד פייטון ולו טיפה", "timestamp": 1695275659912}, {"author": "סטודנט עצוב", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: קורלנד \nחוות דעת - הרצאות: פח ממש אבל. מרצה שחושב שהוא מינימום הרמטכל כשהוא סהכ מלמד קורס של נקז וחצי, לא עונה על חלק מהשאלות כשלא מתחשק לו, מאחר, מתנשא, ודי אדם שלא כיף להיות לידו או בקרבתו באופן כללי.\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: נחמדים ומועילים, נקודת אור בקורס. \n\nשעורי הבית: מציקים אבל לא קשים ברגע שמבינים את הפרוצדורה של אופן ההגשה.\n\nהמבחן: קסום :). מבחן אמריקאי עם ניקוד שלילי בלי שפרסמו מבחני עבר או כל חומר למידה מעבר לדף שאלות אחד, שאלות שמערבבות בתשובות את כל החומר, התחייבות של המרצה שלא יהיו שאלות שדורשות ידע בפייתון ואז שאלה על סדר הדפסה של פקודה מסוימת. חוויה מומלצת לכל\n\nהשורה התחתונה: לברוח בלי להסתכל לאחור, אם זה לא חובה לא לשקול את זה בכלל, בהצלחה", "timestamp": 1700586324365}]}