{"posts": [{"author": "סטודנט", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אסף לוין \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא קשים כל כך, אחת לשבוע. מקבלים 100 אוטומטית על עצם הגשת השיעורי בית.\nהמבחן: \nהיה עם חומר סגור, שאלת חובה לתאר מהלך אלגוריתם + 2 מתוך 3 שאלות לבחירה שהיו דומות לשאלות שיעורי בית.\nהבדיקה הייתה של אסף והוא רצח אותנו, אחרי שכלול ציון שיעורי בית הממוצע היה 53 והחציוני 46. ביזיון שנותנים לאסף ללמד סטודנטים. מרצה שרק רוצה להכשיל.\nלא נתן פקטור על אף הממוצע הנמוך!\nהשורה התחתונה: להימנע בכל מחיר", "timestamp": 1626794324286}, {"author": "קרוסקל", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אסף\nחוות דעת - הרצאות: קורס לא פשוט להבנה ונוסף על כך המצגות שמלוות את ההרצאות באנגלית. אסף לא מסביר ברור ומרצה בצורה מונוטונית. צריך להשלים את הנלמד באופן עצמאי כי לא מבינים כלום.\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: חשובים. חוזרים על הרעיון חלק מהאלגוריתמים שנלמדו בהרצאה ומריצים אותם על קלטים. \n\nשעורי הבית: אין רפרנסים ואין תשובות באינטרנט גם לא באתרי אינטרנט שונים. מקבלים 100 על עצם ההגשה בלי לקבל חוות דעת.\n\nהמבחן: קשה. דומה לשיעורי הבית רק מוגבל בזמן של שעה וחצי לשלוש שאלות ולכן רמת הקושי סופר גבוהה. קשה לחשוב ולנסח אלגוריתם בזמן כל כך קצר. אין ניקוד ביניים- אם לא פתרת את השאלה כמו שאסף התכוון ירדו לך כל הנקודות.\n\nהשורה התחתונה: הקורס לא יותר מדי עמוס. דורש יכולות הבנה ולמידה עצמית ברמה גבוהה. מה שגורם לקורס להיות זוועתי הוא המבחן המזעזע של אסף.", "timestamp": 1627393876142}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אסף לוין\nחוות דעת - הרצאות: סבירות\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: המתרגלת יוצאת מנקודת הנחה שאת יודעת הכל\n\nשעורי הבית: אם מגישים מקבלים 100 בלי בדיקה\n\nהמבחן: אסף מכסח בבדיקה, כל טעות קטנה מינוס 20 (לפחות) ולא מוכן לתת פקטור, הגיע עד לדיקן לימודי הסמכה ועדיין לא אושר פקטור.\n\nהשורה התחתונה: מבחן מזעזע, מי שזה לא קורס חובה שייברח! אסף משחק עם הממוצע כדי שיהיה סביר (50-60), לכל מי שהוא מכשיל הוא נותן 52 כדי שהממוצע יעלה.", "timestamp": 1641809049336}, {"author": "24", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אסף \nחוות דעת - הרצאות: מהמרצים עם הדיבור המונוטוני וחסר ההתלהבות , אותי הוא שעמם והיה לי מאוד קשה בהרצאות שלו \nהמצגות בקורס הן באנגלית ככה שהם לא עוברות חלק כמו מצגות בשפת האם שלך מה גם שלפעמים חסר בהן פיסות מידע של אלגוריתם כלשהו שאתה לא ממש יכול למצוא במקום אחר אם לא היית בהרצאה (חלק מהאלגוריתמים ממומשים שונה מהמימוש בכל מקום אחר ) \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יעל \nבסדר \nעושה את העבודה שלה בגדול \n\nשעורי הבית: גיליון כל שבוע מקבלים 100 על הגשה בלי פידבק וחבל , כי הקורס קשה להבנה וכל פידבק או הכוונה כלשהי הייתה עוזרת \n\nהמבחן: המבחן עצמו היה די פייר לומר את האמת \nאבל הבדיקה של אסף פשוט לא הגיונית אין לי דרך אחרת לתאר את זה הוא נתפס על דקויות שלא חושב ששום מרצה היה מסתכל עליהם בכלל \nואין אצלו אמצע , לא פתרת את השאלה בדיוק כמו שהוא רצה הוא חותך את הציון בחצי  \n\n\nהשורה התחתונה: אין לי מושג מה חשב מי שקבע שהקורס הזה הוא קורס של 2.5 נק\"ז\nאם הוא לא חובה אל תחשבו אפילו לקח אותו", "timestamp": 1659035050360}, {"author": "-", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אסף\nחוות דעת - הרצאות: נתחיל מזה שכל המצגות באנגלית. חשבתי שזה לא יהווה בעיה יותר מדי אך זו בהחלט בעיה כשגם ההסברים של אסף לא מובנים בעליל. מהר מאוד הבנתי שהדרך היחידה להבין משהו בקורס הזה זה ללמוד את כל החומר לבד, מה שכבר מעלה משמעותית את העומס והקושי של קורס קשה מלכתחילה. \n\nשעורי הבית: קשים מאוד ודרשו חשיבה אלגוריתמית שפשוט לא קיימת אצלנו, ואסף לא עשה שום דבר באמת כדי לפתח אותה כמו שהוא טוען שרצה.\n\nיש רפרנס אבל בשלב כלשהו בסמסטר כל הקורס קיבל מייל זועם על כמה שזה לא בסדר להעתיק. אם הייתם מלמדים את החומר בצורה נורמלית אולי אנשים לא היו צריכים להעתיק מהרפרנס מילה במילה....\n\nהמבחן: שאלת החובה האמת הייתה סבבה אבל שאלות הבחירה היו לא אנושיות. לא ראיתי שום קשר בין מה שלמדתי במאמץ כל כך גדול לאורך כל הסמסטר לשאלות ששאלו אותי במבחן.\n\nהשורה התחתונה: להבנתי זו פעם אחרונה שמעבירים את הקורס הזה אבל באמת שעדיף היה ללמוד מבני נתונים ואלגוריתמים. אמנם יותר נק\"ז ויותר עבודה אבל לפחות מלמדים את החומר בצורה ברורה והמבחנים הוגנים יחסית.", "timestamp": 1691065142285}]}