{"posts": [{"author": "מור בורשטיין", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: די משעממת ומסבירה מעט מאוד באופן שלא עוזר למבחן. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1599927435308}, {"author": "24", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גלית \nחוות דעת - הרצאות: \n0 ביחסי אנוש \nשם המתרגל/ת: אביגיל \nחוות דעת - תרגולים: \nאחלה מתרגלת \nמעבירה את החומר בצורה טובה , שם בשביל הסטודנטים כשהם צריכים הכוונה או עזרה (מעבר לשעות הקבלה )\nיש קטע מוזר בקורס שאני לא יודע כמה הוא legit\nיש אפשרות לסטודנטים לקבל 2 נקודות בציון הסופי במידה ויבדקו שאלה אחת בעבודה אחת שהגישו כל הסטודנטים בקורס \n- לא רואה איך זה תורם להבנה שלנו או משקף משהו שאפשר לתת עליו הערכה כלשהי \nפשוט מביאים לנו 2 נקודות בציון הסופי כדי שנעשה את העבודה של המתרגלת (אין תלונות פשוט מוזר)\n\nשעורי הבית: \nגיליון כל שבוע , בדיקה מעמיקה של הגיליון \nשיעורי הבית מהווים 20% מהציון הסופי \nהמבחן: \nמרגיש מבחן שבה להכשיל \nאמנם אורך המבחן הוא 3 שעות אבל המבחן ארוך בצורה לא פרופורציונלית אני מוכן להתערב ש90% לא סיימו את כל השאלות במבחן \nבוחן מהירות כתיבה ומחשבה בדיוק כמו שהוא בוחן את ההבנה של החומר \nהשורה התחתונה: לא לקחת אם לא חובה \nלא שווה את זה", "timestamp": 1659035609878}, {"author": "O", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה:  גלית\nחוות דעת - הרצאות:  לגלית יש את כל הנתונים להיות מרצה טובה:  מראה אכפתיות, מצגות מסודרות, אפילו שחררה הקלטות משנים קודמות ועדיין- משהו לא עובד שם...\nבגדול ההרצאות בסדר - נורא חופרות כי יש פיתוחים של דברים והסברים אבל בסופו של דבר צריך להבין את הדברים ומי שיסתמך רק על הצבה בנוסחאות יילך לאיבוד מהר מאוד בסמסטר הזה\n\nשם המתרגל/ת:  השגתי הקלטות מסמסטר קודם\nחוות דעת - תרגולים:  מה שהיה בהקלטות די בסיסי השאלות של התרגולים דיי קלות לדעתי\n\nשעורי הבית:  חלק רפרנס, חלק קשים\nטיפ זהב- אם אתם לא מוצאים רפרנס בדרייב תחפשו את שאלות במבחנים משנים קודמות\n\nהמבחן: בניגוד למה שהרבה חושבים הוגן.\nצריך לדעת את החומר טוב- לדעת לעשות את הדברים מהר ובלי להימרח. אפשר להוציא אחלה ציון. \n\nהשורה התחתונה: \nקורס נחמד. לא מדהים ולא גרוע\nגלית נתנה לנו הסמסטר מלא אפשרויות לבונוסים תדאגו לנצל \nלהישאר על החומר\nלא להגיד בהתחלה זה קל זה רק להציב בנוסחה\nיהיה בסדר", "timestamp": 1660727652347}, {"author": "0000", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: ברורה מאוד מתאימה את הקצב לכתה ומשתפת את הסטודנטים בשאלות אינטויציה ולא משעממת בכלל\n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: חמודה מאוד ועונה על כל השאלות בזמינות ומוכנות \n\nשעורי הבית: לא פשוטים אבל מאוד מסייעות בהבנת החומר\n\nהמבחן: לא קשה אבל ארוך וצריך להיות זריז כדי להספיק את כל השאלות\n\nהשורה התחתונה: לא לקחת כבחירה אבל אם זה חובה , תשקיעו תקבלו ציון טוב", "timestamp": 1689703374110}, {"author": "Nina Kahn", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גלית יום-טוב\nחוות דעת - הרצאות: לדעתי גלית אחלה מרצה והחומר מעניין, אבל צריך להבין שזה בהחלט קורס מתמטי. ההרצאות חשובות וגלית מאוד מוכנה לענות על שאלות ולחזור על דברים שלא מובנים.\n\nשם המתרגל/ת: נועה ליקוורניק\nחוות דעת - תרגולים: אין על נועה! ממש עשתה סדר בחומר והעבירה לנו את השלבים שצריך כדי לפתור באופן ברור. הדיבור שלה קצת מהיר אבל.\n\nשעורי הבית: שבועיים, אבל סה\"כ בסדר (אם עקבת בשיעור) למרות שיש תמיד איזה שאלה יותר מאתגרת. יש קטע שאפשר לבדוק שאלת שיעורי בית ל2 נקודות בונוס וכדאי!\n\nהמבחן: קשה, אבל אפשרי להצליח אם אתה מספיק על הדברים במהלך הסמסטר.\n\nהשורה התחתונה: קורס שהוא לא קשה כמו הסתברות, אבל דורש השקעה.", "timestamp": 1691865916993}]}