{"posts": [{"author": "Yonathan Mizrahi", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nvery bad teachers\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: hard\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597852810389}, {"author": "Ofek Glick", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: פרופ' עופר שטריכמן\nחוות דעת - הרצאות: \nבסמסטר הקורונה לא היו הרצאות פרונטליות אלא הרצאות במתכונת \"כיתה הפוכה\" - אנחנו נדרשנו לראות את ההרצאות המוקלטות שלו מסמסטר שעבר בזמן שבשעת ההרצאה הוא רק ענה על שאלות של דברים לא ברורים מההרצאה.\nאני אישית הסתדרתי עם הקונספט אך עצבן אותי שרוב החומר שנלמד בקורס לא ייושם בשום צורה לא בשיעורי בית ולא במבחן מה שהקשה מאוד על לדעת מה חשוב ועל מה לשים את הפוקוס\n\nשם המתרגל/ת: נועם כהן\nחוות דעת - תרגולים: \nנועם כהן הוביל רק את תרגילי הבית במערכות הפעלה ולא בארגון מחשב.\nהתרגולים בארגון מחשב היו פשוטים מידי וללא קושי רב.\nהתרגילים במערכות הפעלה היו תלושות מהחומר של הקורס, קשות יתר על המידה ולפי דעתי לא בעלות ערך לימודי כ\"כ, מעבר ללדעת ללכת לגוגל למצוא פתרונות דומים.\n\nשעורי הבית: ארגון מחשב: חביבים, מערכות הפעלה: קשים לרמת הבלתי פתירים.\n\nהמבחן: המבחן שלנו היה מקוון ובסופו של דבר קיבלנו עליו 21 נק' פקטור, בערך 10% מהחומר הנלמד היה במבחן ובאופן כללי הוא לא היה מייצג עבור הקורס הזה.\n\nהשורה התחתונה: קורס מעניין, סגל קצת קשה (פרט לנועם שהרגיש לי שעושה המון בשביל הסטודנטים) ומבחן קצת קשה אבל באופן כללי קורס אפשרי לחלוטין להוציא בו 85+", "timestamp": 1597997580527}, {"author": "מור בורשטיין", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: יחס מחפיר לסטודנטים, מזלזל, לא מלמד כמעט, ממש מרצה גרוע בכל קריטריון.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מרצה לא מחובר לחומר הקורס, לא רלוונטי בכלל למבחן.\n\nשעורי הבית: לא רלוונטיים לקורס.\n\nהמבחן: מבחן ביזיון, לא קשור בכלל לחומר הנלמד בקורס.\n\nהשורה התחתונה: קורס מזעזע, רק אם חובה לעשות", "timestamp": 1599927516060}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: בהרצאות עצמן הוא מרצה טוב מבחינת הסברים בוידאו , אבל לא אכפת לו מסטודנטים והוא נותן לסטודנטים הרגשה מזלזלת לאורך רוב הזמן. עדיף להמנע מאינטרקציה.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: היה אחראים רק לתרגיל בית במערכות הפעלה, נכון לעזור, אבל לא הכי מחובר לנעשה בקורס.\n\nשעורי הבית: ארגון המחשב: פתירים\nמערכות הפעלה: קשים ברמה כמעט בלתי פתירה,בעיקר הפרויקט בסוף שלקח המון זמן.\n\nהמבחן: בגלל שהקורס נוגע לכל כך הרבה תחומים קשה לדעת על מה לשים דגש, אבל השקעה לאורך הסימסטר יכולה להביא לציון טוב במבחן\n\nהשורה התחתונה: לא ממליצה לעשות את הקורס אם לא חייבים(למרות שהחומר מעניין), אבל אם עושים, להשקיע בלהבין טוב לאורך הסימסטר את החומר של הקורס, כי לקראת המבחן קשה להחליט במה להתמקד בבחינה, ואצלנו המבחן היה על תתי תחומים שהרגישו יחסים שוליים בקורס, לכן עדיף בסיס טוב בכל החומר.", "timestamp": 1601383031885}, {"author": "Tal", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עופר שטריכמן\n\nשעורי הבית: כל תרגילי הבית בזוגות. תרגילי הבית היבשים דורשים הבנה והשקעה אבל לא יותר מכמה שעות עבודה. תרגילי הבית הרטובים דרשו הרבה מאוד שעות - באזור ה-60 שעות לכל תרגיל.\n\nהמבחן: לא מקיף וכולל חלק מן הנושאים השונים בקורס - בעיקר הנושאים הכבדים והגדולים יותר. דורש הבנה עמוקה של הנושאים.", "timestamp": 1602152929606}, {"author": "Elon Amram", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: \nמהמוקלטות נחמד\nשם המתרגל/ת: כארם ונעום\nחוות דעת - תרגולים: סביר מינוס\n\nשעורי הבית: מזעזע\n\nהמבחן: ממוצע 38.....\n\nהשורה התחתונה:", "timestamp": 1603113539793}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: \nמשעממות נורא, מרצה לא מתחשב בעליל\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מעופף אבל סהכ מוכן לתת המון לסטודנטים\n\nשעורי הבית: מערכות הפעלה: לא פתיר בכלל, אל תתאמצו לחשוב- לכו לגוגל\n\nהמבחן:  לא קשור לרוב החומר בכלל מתוך קורס שלם המבחן היה על עשירית מהחומר שלמדנו (בעיקר על C מאיזשהי סיבה)\nהממוצע היה 30 ומשהו ונירמל בלמעלה מ20 נק'.\nהשורה התחתונה: תעברו לאונ' תל אביב עדיף", "timestamp": 1609673868715}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: הרצאות מוקלטות מובנות וברורות - לא יצא לי לראות אותו בלייב. עופר לא אדם נחמד, בכל זאת דאג לנרמול הציון ולפחות יצא פייר.\n\nשם המתרגל/ת: כארם\nחוות דעת - תרגולים: ראיתי רק הקלטות שלו, לפעמים מבולבל ולא מובן, לפעמים סבבה, באופן כללי לא הכי מומלץ.\n\nשעורי הבית: בחלק הראשון (ארגון המחשב) תרגילים סבבה טובים לוידוא הבנה של החומר. בחלק השני (מערכות הפעלה) נוסף באביב 20 תרגיל רטוב מסויט, המון המון שעות ולא מרגיש שבאמת מלמד הרבה אבל אין ברירה.\n\nהמבחן: מבחני עבר שפתרתי היו סבבה יחסית, המבחן המקוון באביב 20 היה על מעט מהחומר והרבה על סינטקס, היה לפחות פקטור סבבה אז הציונים בסדר.\n\nהשורה התחתונה: קורס לא קשה בסה\"כ, עמוס בעיקר בתרגיל בית השני, אין מה לחשוש ממנו למרות השמועות הרעות.", "timestamp": 1611324810141}, {"author": "חיית קודש", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עופר שטריכמן\nבן אדם עם לב מפויח,ממורמר גס רוח,משפילן,עצלן,מחרחר ריב בקיצור מחכה לו סוויטה ליד לוציפר במעמקי השאול.\n\nשם המתרגל/ת: נועם וכארם\nנחמדים טובים .\n\nהשורה התחתונה: אם לא הייתה חובת נירמול באותו סמסטר,היה משאיר את הממוצע 38 ומתמלא באושר שחור .\nתקוו שהוא לא יהא המרצה שלכם .", "timestamp": 1613859558920}, {"author": "אביב 2021", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: לרוב משעממות ומתישות, מלא חומר שלא ברור מה חשוב ומה לא, בתכלס כמעט הכל חשוב\n\nשם המתרגל/ת: סרגיי\nחוות דעת - תרגולים: מסביר טוב אבל לפעמים קשה להבין אותו\n\nשעורי הבית: מצריכים מחשבה אבל לא נוראיים\n\nהמבחן: לעומת סמסטרים קודמים המבחן היה די הוגן \n\nהשורה התחתונה: תשקיעו טוב במהלך הסמסטר בהבנה של הדברים וזה יחסוך לכם לקראת המבחן", "timestamp": 1626888014838}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: עופר מרצה שיודע את החומר ומסביר אותו בצורה טובה. לא אומר שבצורה הכי מעניינת או כזאת שתלהיב את הקהל, אבל ההסברים שלו די ברורים. אין מה לצפות מבחינת צחוקים בהרצאה ואווירה קלילה, הוא אדם די רציני. ההרצאות מאוד ארוכות ועמוסות חומר, לא ממליץ לכתוב ולסכם במחברת, אולי להקליד במחשב גג. רובנו הורדנו את מצגות ההרצאה ורשמנו עליהן. יש הרבה חומר והוא ממש יבש אז תתכוננו. את המצגות לא ניתן להוריד כpdf בצורה ישירה מהמודל, אז תורידו למחשב מראש ואז תעלו לדרייב. \n\nשם המתרגל/ת: שחר דקל\nחוות דעת - תרגולים: שחר נסיכה, והלוואי שכל המתרגלים היו משקיעים ככה מבחינת יחסי אנוש עם הסטודנטים. השקיעה במצגות והוסיפה הרבה תמונות והפכה את התרגולים לקלילים ממש. לפעמים זה קצת הוריד את רמת הלמידה ולא הייתה הרגשה רצינית, אבל זה ממש בקטנה. היינו השנה הראשונה שבה היא תרגלה לכן היא עדיין למדה במהלך הסמסטר ולפעמים גם טעתה, אבל זה לגיטימי לחלוטין והיא תותחית, אני בטוח שהיא תשתפר עם הזמן. \n\nשעורי הבית: פעם בשבועיים. לא ממש ארוכים אבל כן צריך להשקיע בהם. בניגוד לשאר הקורסים ששם ידוע מה מצופה וכמה מורידים, פה היו המון אנשים שהכינו תרגיל בית ובסוף הורידו להם מלא נקודות. תשקיעו בכתיבה ובמלל ובכל הסבר, אחרת יורידו לכם הרבה נקודות. הציון של שיעורי הבית קריטי כי הוא תקף - חלק ממשי מהציון שיכול גם להוריד אותו אם הוא נמוך. שווה לכם להשקיע בהם כי הם מהווים 20 אחוז מהציון הסופי. 2 תרגילי הבית האחרונים מאוד עמוסים ולא מובנים בעליל, שכן אלו תרגילי בית רטובים במערכות הפעלה. המון תסכול כי הסגל לא עונה בצורה ברורה, תחפשו סרטונים באינטרנט של זה\n\nהמבחן: וואו. המבחן היה ממש ממש הוגן ואפילו קל. המבחנים של עופר ידועים לשמצה וכנראה שזה לא יחזור על עצמו. תכינו דף נוסחאות עמוס בכמה שיותר מידע, זה יכול להעניק לכם הרבה נקודות מתנה. שווה להתכונן כמו שצריך מראש, למרות שבסוף כנראה שחלק גדול מהחומר לא יופיע.\n\nהשורה התחתונה: קורס עמוס ומלא חומר יבש, תתכוננו.", "timestamp": 1627390723750}, {"author": "סמפור", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: אני מאוד נהניתי בהרצאות של עופר, וחשוב לי לכתוב את זה בניגוד לכל חוות הדעת השליליות שיש פה עליו - נכון שהוא קצת יבש לפעמים, אבל הוא מעביר חומר שיכול להיות מאוד מעניין אם נכנסים ל-state of mind הנכון, והוא מעביר אותו בצורה מופתית. חוץ מזה, לעופר יש חוש הומור שאני אישית התחברתי אליו. לי ההרצאות היו מאוד מעניינות וגרמו לי ממש להתלהב.\n\nשם המתרגל/ת: שחר\nחוות דעת - תרגולים: פחות התחברתי. הרגישה לי לא מספיק סגורה על החומר.\n\nשעורי הבית: 5 סה\"כ. צריך להשקיע בהם ולהיות מדויקים כי הבדיקה כי קטנונית. יש בסוף הקורס את תרגיל 5 על מערכת ההפעלה XV6, שכדאי להכין עבורו לפחות יומיים של למידה.\n\nהמבחן: אצלנו ספציפית היה מבחן קל, כנראה לא יחזור על עצמו לצערי. צריך לחרוש.\n\nהשורה התחתונה: קורס שאני אישית נהניתי ממנו מאוד. אתם הרי בכל מקרה צריכים לעשות אותו, אז תנסו להתעניין בחומר - ברגע שנכנסים לזה זה עולם ומלואו.", "timestamp": 1627401532664}, {"author": "XV6", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: מרצה רציני שיודע טוב מאוד את החומר. עשוי להיות די מונוטוני לפעמים אז כדאי לשתות קפה לפני השיעור\n\nשם המתרגל/ת: שחר דקל\nחוות דעת - תרגולים: מנטליות של טינאייג'רית בת 14, אבל סה\"כ נראה שהיא מבינה עניין\n\nשעורי הבית: מתחיל קליל עם 3 גליונות יבשים שלא דורשים יותר מדי מאמץ. שתי ההגשות האחרונות הן במערכת הפעלה XV6 ש(לדעתי) הופכות את שיעורי הבית לסיוט מתמשך\n\nהמבחן: סה\"כ מבחן הוגן, שאלות ברמה סבירה, אין יותר מדי הפתעות. יש גם דף נוסחאות שאפשר להביא אז מומלץ לדחוף לתוכו כמה שיותר חומר.\n\nהשורה התחתונה: אני אישית פחות התחברתי לחומר הקורס, רוב הנושאים היו די משעממים. בפועל הקורס די קל אם באים בגישה הנכונה ויודעים איך להתמודד עם כמות החומר הגדולה הזאת שיש בו. כדאי מאוד לבדוק לפני המבחן אם מועבר פק\"ל של אמיר!", "timestamp": 1627513825039}, {"author": "נועה קילה", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: משעמם\n\nשם המתרגל/ת: שחר\nחוות דעת - תרגולים: שחר היא הדבר הכי טוב שקרה לי הסמסטר. היא הצליחה להפוך את התרגולים על החומר הכי משעמם שיש לחוויה שבועית. כל הסמסטר היא השקיעה ממש בתרגולים והייתה זמינה לסטודנטים אשכרה 24/7. הלוואי כל המתרגלים היו רבע ממנה. פשוט מתרגלת ובן אדם מדהים!\n\nשעורי הבית: בארגון הם סבירים, במערכות הפעלה כל הקורס חייב תודה לסרטון של 8 דקות של הודי ביוטיוב שפותר את התרגיל אחרת אף אחד לא היה מצליח את זה עד היום.\n\nהשורה התחתונה: קורס משעמם וקצת מתסכל, אבל הייתי לוקחת אותו שוב רק בשביל להיות בתרגולים של שחר.", "timestamp": 1627571962060}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: עופר שטריכמן \nחוות דעת - הרצאות: בסך הכל ההרצאות משעממות. עופר לא מצליח להעביר את החומר בצורה שיעניין את הסטודנטים ומרגיש שלא כזה אכפת לו מהם. \n\nשם המתרגל/ת: שחר דקל \nחוות דעת - תרגולים: מתרגלת מדהימה! הצליחה להצחיק אותנו במהלך התרגולים ולהעביר את החומר בצורה מעניינת, ומובנת. רואים שאכפת לה מהסטודנטים ותמיד כיף להגיע לתרגולים שלה. \n\nשעורי הבית: בארגון המחשב הם בסדר, דורשים קצת הבנה אבל לגמרי פתירים. במערכות הפעלה השיעורי בית לא מובנים בכלל, ודורשים הודי ביוטוב שיגיד לך בדיוק מה לעשות ואיך. \n\nהמבחן: לנו היה מבחן מאוד הוגן, אבל בשנים קודמות המבחנים היו קשים. לא נראלי שעופר יתן מבחן כזה הוגן בהמשך אז כדאי לחרוש לפני המבחן ולקוות לטוב. \n\nהשורה התחתונה: קורס משעמם, אבל שחר תציל אותכם.", "timestamp": 1627651112242}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: באמת לא גרוע כמו שאומרים, נכון הוא די מונוטוני והוא לא בדיוק אחד לשבת איתו על בירה, אבל הוא מאוד יסודי, המצגות שלו ממש ממש טובות והוא בעיני מאוד מובן.\n\nשם המתרגל/ת: שחר דקל\nחוות דעת - תרגולים: הגבול אצלה בין אווירה טובה בתרגול לתרגול לשכונה היה מאוד דק, אבל היא תמיד באה מוכנה, היא אחלה בן אדם והפכה הרבה נושאים מהגיהינום לסבילים פלוס\n\nשעורי הבית: בארגון המחשב יש סך הכל 3, לא מאוד קשים אבל דורשים כמה שעות טובות. בסה\"כ עוזרים להבין את החומר.\nבמערכות הפעלה: גוגל הוא חברו הטוב של האדם\n\nהמבחן: בסמסטר שלנו קרה נס והיה פי 10 יותר קל משנים קודמות, אבל כעיקרון הוא די טריקי ודורש בקיאות ברמה יחסית גבוהה, הדף נוסחאות *מאוד* עוזר.\n\nהשורה התחתונה: קורס די משמים וסגל סביר פלוס, פשוט תעשו מה שיבקשו מכם ואפשר לדפדף אותו עם 80 פלוס", "timestamp": 1628791685838}, {"author": "שחר המלכה", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: משעממות, עדיף לראות מוקלט על מהירות 2, רק ככה אפשר להצליח להתרכז.\n\nשם המתרגל/ת: שחר\nחוות דעת - תרגולים: שחר מלכה! הצילה לי את הקורס! תמיד באה מוכנה לתרגולים ובקיאה בחומר, האווירה בשיעורים מעולה (קורעת אותנו מצחוק) והיא אשכרה מנסה לגרום לנו להתחבר לחומר בקורס ולאהוב אותו.\n\nשעורי הבית: לוקחים שעות ושוחטים בבדיקה.\n\nהמבחן: אצלנו בסמסטר היה הוגן בגלל שסמסטר לפני כן הממוצע נפל ל 38, ככל הנראה לא יקרה שוב.\n\nהשורה התחתונה: קורס חובה אין מה לעשות. להגיע לתרגולים של שחר ולקוות לטוב.", "timestamp": 1628797010828}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: כמרצה עופר סהכ בסדר. יש לו ידע רחב מאוד בנושאים של הקורס, והוא יודע להעביר את החומר ולשים דגש על העקרונות של הקורס. הבעיה מתחילה בזה שהוא בנאדם די רציני וכבד (וגם כשהוא מנסה להצחיק, לא עובד לו) ושהוא יכול לפעמים די לקטול סטודנטים ששואלים שאלות. האווירה אצלו לא משהו בהרצאות ואני לא חושב שהרבה מרגישים בנוח להשתתף במהלך השיעור. ככה או ככה זה לא משנה כי הקורס הזה הוא עופר ועופר הוא הקורס הזה.\n\nשם המתרגל/ת: נגה הרלב (ארגון המחשב) + נועם כהן (מערכות הפעלה).\nחוות דעת - תרגולים: נגה מתרגלת אחלה. יודעת לשים דגשים על נקודות לא מובנות בחומר, עונה על שאלות בצורה בהירה ובאופן כללי התרגולים איתה היו ממש סבבה, מה שאי אפשר להגיד על נועם. כמתרגל נועם לא משהו. חסר כריזמה ולא מעביר את החומר (הבמילא משעמם) בצורה שאיכשהו תעניין את הסטודנטים. מעבר לזה הוא גם חסר אחריות (ביטל את התרגול של יום ראשון בבוקר בלי להודיע ככה סתם ביום בהיר), וזה מתבטא בעיקר בתרגילי הבית שהוא כתב.\n\nשעורי הבית: היו חמישה תרגילים. התרגילים בארגון המחשב הם לא סיפור כזה גדול ועוזרים להטמיע את החומר, אבל הבדיקה די קפדנית אז אל תמהרו להגיש. התרגילים במערכות הפעלה הם סיוט. הם בXV6 שלא קשורה לחומר של המבחן או למה שלומדים בהרצאות, ונועם כתב אותם וכתב אותם כל כך לא מובן ולא ברור שכל הקורס היה צריך להגיע לשעות קבלה רק בשביל מושג איך להתחיל לגשת אליהם. בנוסף הם ניתנו בשבועות האחרונים והכי עמוסים של הסמסטר והגודל שלהם (במיוחד של ת\"ב 5) היה ממש מוגזם. אחרי פנייה מנציגי הסמסטר הסגל כן הקטין את הנפח שלהם אבל עדיין היה קשה ובעיקר לא מלמד את החומר.\n\nהמבחן: עופר נתן מבחן ממש הוגן. לא נכנס יותר מדי לדקויות ולפינות קטנות אבל כן כזה שצריך לשלוט טוב במושגים של הקורס ובטכניקות שנלמדו בו בשביל לפתור. הדף נוסחאות מאוד עוזר, תנסו להכניס לתוכו כמה שיותר חומר.\n\nהשורה התחתונה: קורס בסדר, משהו שעושים רק כי זה קורס חובה. הייתי אומר שהיה אפילו סבבה+ אבל התרגילי בית הורידו לי יותר מדי שנים מהחיים בשביל להגיד את זה בלב שלם.", "timestamp": 1659456768330}, {"author": "מאמא מיא", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: לא אהבתי\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: \nטוב מאוד \nשעורי הבית: \nארגון המחשב : בסדר אבל בבדיקה מורידים הרבה\nמערכות הפעלה : בלתי אפשריים \nהמבחן: \n מי שחושב שהמבחן היה סבבה הוא טועה , אם פותרים שוב בבית מגלים שטעיתים\nהשורה התחתונה:", "timestamp": 1659651539861}, {"author": "Round Robin", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: מצד אחד כמרצה עופר אחלה, באמת יודע להסביר טוב את החומר וניכר שיש לו ניסיון של שנים בכל מה שהקורס עוסק בו, אבל מצד שני כבר בהרצאה הראשונה קולטים שלא בא לו ללמד בשיט, ושהוא לא מסמפט סטודנטים או להרצות. כשהוא לא עסוק בלהשפיל אנשים בגלל שהם שאלו שאלה לגיטימית הוא דווקא סבבה, אז כל עוד אתם לא שואלים שאלות קיטבג שמעצבנות אותו יהיה בסדר אצלו בהרצאות.\n\nשם המתרגל/ת: נגה בארגון המחשב ונעם במערכות הפעלה\nחוות דעת - תרגולים: על נגה אין לי מילה אחת רעה להגיד. אחלה מתרגלת, מעבירה את החומר במדויק והתרגולים אצלה היו סבבה.\nעל נעם יש לי הרבה מאוד דברים להגיד, אבל חלקם רלוונטים יותר לשיעורי בית. כמתרגל הוא לא משהו אבל גם לא כזה נורא, איפשהו באמצע.\n\nשעורי הבית: התרגילים בארגון המחשב סבירים ומלמדים טוב את החומר. הביזיון שנקרא שיעורי הבית במערכת הפעלה לא. כל תרגיל שנעם כתב בסמסטר היה יותר הזוי ובעייתי מהקודם. שני התרגילים במערכות הפעלה לא קשורים בכלל לחומר של הקורס ולא מלמדים כלום, ארוכים, מתישים וכתובים מזעזע. כל הקורס היה צריך להגיע לשעות הקבלה של נועם שגם הן לא עזרו יותר מדי, ובסהכ אפשר לסכם בזה שהם השיט הכי גדול שיש בסמסטר.\n\nהמבחן: עופר נתן מבחן ממש הוגן. לא יותר מדי מורכב וכזה שאפשר להוציא בו אחלה ציון אם פשוט לומדים ממש טוב את המצגות והניואנסים בחומר. אומרים שיש לו היסטוריה של מבחנים קשים אבל לדעתי המבחן שקיבלנו היה ממש בסדר וגם הממוצע שלו היה לדעתי סביר לגמרי לקורס 3.5 נק\"ז של שנה א'. סהכ הפתיע לטובה.\n\nהשורה התחתונה: הקורס הזה סבבה עד שמגיעים לתרגילים במערכות הפעלה. הסגל לא משהו אבל מסתדרים. ממליץ פשוט לא לזלזל בו ולהשקיע איזה ארבעה ימים מרוכזים לפני המבחן ויהיה בסדר.", "timestamp": 1659733367298}, {"author": "עופר", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות:  באמת בן אדם מזעזע אבל מרצה סביר, כלל האצבע הוא שאם רוצים לשמור על הכבוד העצמי לא שואלים אותו כלום\n\nשם המתרגל/ת:  הקלטות של שחר דקל\nחוות דעת - תרגולים:  סביר כזה\n\nשעורי הבית: שני תרגילים ראשונים זה שערים לוגיים וחישובים של ייצוגים בינאריים, נחמד כזה. תרגיל שלישי באופטימיזציות קצת פחות סימפטי ודורש הרבה זמן. התרגילים של מערכות הפעלה - ח ר ד ו ת. באמת פשוט חכו שמישהו אחר יעשה את זה ותקבלו קצת הכוונה כי זה היה פשוט נורא\n\nהמבחן:  אחלה מבחן, לי אישית הלך פחות טוב מסיבות אישיות אבל חד משמעית מבחן סבבה.\n\nהשורה התחתונה:  קורס סביר, נותן רקע מאוד בסיסי במבנה המחשב, לא יעשה אתכם מהנדסי מחשבים לא לדאוג, מערכות הפעלה - פשוט ביזיון.", "timestamp": 1659734055898}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: מרצה סביר.בנאדם קשה,באמת אני משתדל כמה שפחות לשון הרע,אבל הבנאדם ממש קשה,ושונא אנשים.\nעובר כמעט על כל תקנה של הטכניון מול הסטודנטים-לא מפרסם את המבחן אחרי הציונים,לא מפרסם את הסריקה אחרי הציונים,כמעט ולא מעלה חומר ללמידה לMOODLE,לא מציין מה אחוז השיעורי בית מהציון עד סוף הסמסטר,ובגדול משתדל להיות כמה שיותר מנותק ולא לעזור לסטודנטים להצליח בקורס.ממש ככה,ואני אומר את זה בצער רב ולא בעצבים.עצוב שמרצה כזה נמצא המון שנים בטכניון והפקולטה לא שוקלת אפילו להחליף אותו.מה שנקרא,פני הפקולטה כפני המרצה-ביזיונית.\n\nשם המתרגל/ת: נועם ושחר\nחוות דעת - תרגולים: מעולים\n\nשעורי הבית: עד לחלק של מערכות הפעלה היה מעולה ופייר.\nמשם הכל התדרדר עד לרמה שכל הקבוצה בווטאספ עשתה יד אחת ועשתה את כל התרגיל ביחד\n\nהמבחן: ברובו פייר,למעט שאלה מספר 4 שבה הוא נתן להתאים משפטים מתוך טבלה להגדרות במקצוע-והוא פשוט התקטנן על המילים הכי קטנות ושלא נלמדו בקורס בכלל.פשוט שאלה שבאה להוריד ממוצע,אומר מכל הלב.הבנאדם נתן שאלה פשוט מרוע לב.\n\nהשורה התחתונה: הקורס אמור להיות בינוני פלוס,ועופר הופך אותו לשנוא נטו מיחסי האנוש שלו.לא שופט אותו,הבעיה היא בטכניון ובפקולטה שלא אכפת לה שיש מרצה כזה.", "timestamp": 1659807241271}, {"author": "S", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: בן אדם קשה אין מה לומר. צריך לא לקחת ללב ובכל זאת להעז לשאול בהרצאות, הוא בטוח שאנחנו יודעים את החומר מראש ואז מבחינתו שאלות הן לא לגיטימיות. אבל שוב, לא להתבייש לשאול.\n\nשם המתרגל/ת: נגה ונועם\nחוות דעת - תרגולים: נגה מעולה. מהרגע שנועם נכנס לתמונה הקורס הפך ללא ברור- לא מבחינת שיעורי הבית ולא מבחינת הלמידה בתרגולים. בן אדם מהתעשייה שאמנם יש לו ניסיון רב אבל ללמד במסגרת הקורס בעיניי פחות מתאים.\n\nשעורי הבית: עד שהגענו למערכות הפעלה היו הוגנים. השיעורים של מערכות הפעלה פשוט לא ברורים, מצפים מהסטודנטים ללמוד לבד להתעסק עם מערכת שלא יצא להשתמש בה אף פעם בטווח זמן לא הגיוני ושנייה לפני תקופת מבחנים. קבוצת הווצאפ של הקורס געשה מעצבים ותסכול של סטודנטים. מקווה שיום יבוא ומישהו בפקולטה יבין שמשהו לא בסדר בהתנהלות אחרי שכל שנה סטודנטים מתלוננים.\n\nהמבחן: ברובו הוגן, הייתה שאלה שהייתה מנוסחת בצורה מאוד קטנונית שבעיניי באה לגרום לסטודנטים להיכשל\n\nהשורה התחתונה: צוות הקורס לא תומך בסטודנטים שיצליחו. תתמכו בעצמכם ואחד בשני. מה שהחזיק אותי בעיקר זה שהחומר עניין אותי.", "timestamp": 1659905897273}, {"author": "L", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: \nנראה קצת מר נפש אבל תכלס הוא אחלה צריך לבוא בראש פתוח ותנסו כמה שיותר להקשיב ולכתוב כי הוא אומר דברים חשובים (סבבה גם ההקלטות הוא אומר אותו דבר)\nשם המתרגל/ת: נגה\nחוות דעת - תרגולים: \nמתרגלת פצצה מסבירה ממש טוב\nשעורי הבית: \nשיעורי בית אחלה עד החלק של מערכות הפעלה תחזיקו חזק למה אתם הולכים לחטוף עצבים\nהמבחן: \nהיה סבבה סך הכל, ממליצה להתאכזב על כל מושג שהוא אומר בהרצאות גם אם הוא לא מופיע במצגות כי הוא שואל על זה במבחנים\nהשורה התחתונה:", "timestamp": 1659967827694}, {"author": "?????", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: משעמם, קריאה ממצגת\n\nשם המתרגל/ת: נוגה\nחוות דעת - תרגולים: אלופה\n\nשעורי הבית: ארגון המחשב- אחלה, מערכות הפעלה- סיוט מתמשך\n\nהמבחן: קשוח, 4 שאלות בלבד, מספיק שאתה לא יודע אחת ונפלת\n\nהשורה התחתונה: קורס קשוח, צריך לא מעט השקעה", "timestamp": 1660036262190}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: סך הכל מסביר ברור, אבל האווירה אצלו לא מהנה יותר מדי. די מונוטוני וגם קוטל אנשים בשאלות שלהם. ההרצאות המוקלטות שלו לגמרי עושות את העבודה.\n\nשם המתרגל/ת: וידאו\nחוות דעת - תרגולים: נחמד\n\nשעורי הבית: ככה ככה. מע' הפעלה נורא, לא קשור בכלל לחומר שלומדים בהרצאות/בתרגולים. ממש לכו תסתדרו לבד.\n\nהמבחן: סך הכל הוגן מאוד, חוץ מהשאלה הרביעית שנוסחה באופן מבלבל ולא הוגן במטרה להכשיל. בין אם זה על דקויות של \"רכיב שנמצא במעבד\", כשגוגל אומר כן, אבל עופר אומר לא, ובין אם זה על דברים אחרים שנאמרו בחצי משפט בהרצאה. הביזיון האמיתי היה שהמבחן נבדק בכל כך קלות דעת, וחוסר תשומת לב (וגם לא פורסמו סריקות כן), אז אנשים שרצו לערער היו צריכים להגיע לטכניון לאחר סוף תקופת המבחנים. בבדיקה של שאלה אחת, אם הורידו לכם נקודות, בין אם 2 או 11, וגם כשהפתרון היה נכון לחלוטין, פשוט רשמו ? מבלי להסביר מעבר, ואז כשעופר הסתכל על זה הוא לא הבין באמת למה היה צריך להוריד. ודרך אגב גם טעו בבדיקה של שאלה אמריקאית. קצת יותר התחשבות בסטודנטים לא תזיק.\n\nהשורה התחתונה:", "timestamp": 1660732908992}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטריכמן \nחוות דעת - הרצאות: \nעופר מרצה טוב, ורואים שהוא מבין היטב את החומר. הוא קצת אפור ומשמים, אבל כדאי ללכת להרצאות שלו.\n\nשם המתרגל/ת: נגה\nחוות דעת - תרגולים: \nמתרגלת ממש טובה, מסבירה את החומר מצוין. הכיתה שלה בדרך כלל מפוצצת אז צריל לבוא טיפה לפני\n\nשעורי הבית: \nהקורס מחולק ל-2 - ארגון המחשב, ומערכות הפעלה. הש\"ב של ארגון יחסית קלים, אבל של מערכות קשים רצח. דורש הרבה מאוד עבודה והסתכלות על הודים ביוטיוב בשביל להבין מה רוצים ממנו.\nהמבחן: \nדיי קל.לפעמים הוא דופק שאלות רנדומליות רצח, אבל בדרך כלל המבחן בסדר.\nהשורה התחתונה: \nעופר הוא התגלמות המרצה למחשבים.", "timestamp": 1679228525740}, {"author": "סטודנט מאוכזב", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "*הביקורות הזאת מסכמת גם ביקורות קודמות משנים קודמות שנכתבו על הקורס.\nשם המרצה: עופר \nחוות דעת - הרצאות: הכל נאמר. יחסי אנוש שואפים לאפס, משעמם מונוטוני. כל הרצאה קשה לשרוד, עדיף לצפות בהקלטות זה אותו הדבר.\n\nשם המתרגל/ת: זיו ולפעמים יונתן\nחוות דעת - תרגולים: התרגולים מקיפים חלק קטן מאוד מהחומר. הידע של המתרגלים דליל מאוד, לפעמים הם גם מטעים. לא יודעים לענות על חומר של ההרצאות אם שואלים אותם.\n\nשעורי הבית:  בדיקה קשוחה מאוד, בודק בשם עידו שמחפש אותך בנרות(שמעתי שגם בקורסים אחרים הוא מחפש על מה להוריד בכוח). שני התרגילים האחרונים הם במערכת הפעלה שנקראת XV6(נשמע כמו חללית או המצאה) ומדובר בסיוט של כל סטודנט כמו שנאמר שבביקורות קודמות.\nהדרך לעבור את שניהם זה לראות הודים ביוטיוב. מי שהיה אחראי עליהם במקור הוא נועם כהן שמי שעבר סדנת C מכיר טוב. נועם ידוע בתור כותב שאלות ארוכות ולא ברורות וכך גם התרגילים האלה שהוא \"ברא\".\nכדאי לקחת ברצינות ולהשקיע כי הם חלק \"כבד\" מהציון. קחו בחשבון שעופר לא מפרסם את אחוז הש.ב מהציון עד סיום הלימודים, אבל נראה לפי ביקורות קודמות ולפי הסמסטר שלנו שזה חלק נכבד.\n\nהמבחן: \nמבחן \"שטני\". המתרגלים אמרו שהמבחן \"הוגן\". אני מניח שאם אתם תלמידי שנה א' אז כנראה אתם תמימים. אז מעכשיו אל תהיו כאלו. אם מתרגל אומר שיהיה הוגן , אז לא יהיה הוגן. היו אלמנטים במבחן שדומים לתרגילי הבית, אבל:\n1. היה ניקוד שלילי- ז\"א שאם טעית, קיבלת 0 על השאלה ועוד הורידו לך נקודות נוספות.\n2. היו שאלות שנכנסו לקטנות ולא נוסחו כמו שצריך(יש תלונות על זה גם בביקורות קודמות)\n3.כהכנה למבחן- עופר לא מפרסם כמעט מבחנים משנים קודמות, למעט איזה שני מבחנים מ2009 ואולי 1 מאוניברסיטת בן גוריון(למה לעזעזל מבחן משנת 2004 מבן גוריון???), כאילו שחסרים לו מבחנים לפרסם(כנראה ממחזר, כמעט בלתי אפשרי להשיג את המבחנים שלו מסתבר... אין סריקות ואין כלום), המבחן בסוף לא היה דומה(הפתעה אה...)לזה היה לנו.\n4. המבחן שלנו, היה \"דליל\" כמעט לא היו שאלות, לא היה צריך להראות דרך רק תשובות סופיות ויכול להשפיע קריטית על הניקוד.\n5. לגבי רמת הקושי- בקצרה: לפי הביקורות הקודמות בשנתיים האחרונות היו יחסית מבחנים קלים(לפי ציונים + מה שאנשים רשמו), אי אפשר להסתמך על זה, המבחנים שלו רנדומליים רצח ולא מקיפים את כל החומר, בתאכלס אולי הוא שאל אצלנו במבחן על 30 אחוז מהחומר במקרה הטוב.\n6. יכול להיות שיהיה פקטור זה תלוי איך הלך לאחרים ומה יהיה הממוצע (בעת כתיבת שורות אלו המבחן עדיין לא נבדק ולא היו ציונים).\nהשורה התחתונה: \nקורס זוועה, סגל זוועה(לא איכותי בכלל מבחינת רמת הידע ושיתוף הפעולה עם הסטודנטים). אין ברירה זה קורס חובה.\nתעשו את המקסימום שלכם ואני מקווה שתשרדו. בהצלחה", "timestamp": 1690885554436}, {"author": "הייתי צריך ללמוד בב\"ש", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: \nעופר מדבר בקצב כל כך איטי\nאלוהים ישמור איזה איטי\nתראו הקלטות על x2\nבגדול מסביר בסדר\nחצי מהחומר לומדים במגמת אלקטרוניקה בבצפר ככה שגם לא קשה\n\nשם המתרגל/ת: מר תמיר זיו\nחוות דעת - תרגולים: מתרגל אחלה בגדול\n\nשעורי הבית: \n3 תרגילים ראשונים קלילים בארגון המחשב\nקצת להמיר בין בסיסים\nקצת ייצוג Flot\nלא דברים בעייתים\nמערכות הפעלה קצת יותר קשה במיוחד כי לא מסבירים כלום איך לעשות את זה, בסוף נעזרים בגוגל ומסתדרים\n\nהמבחן: \nהחומר קל אבל מפיל ממש\nעופר אוהב שאלות עם מינוסים (נניח שאלה אמריקאית פלוס 16 מינוס 6) ומנסה להפיל על הפרטים הקטנים\n\nעופר לא מפרסם מבחני עבר ומעתיק מהם הרבה אז כותב פה מה שזוכר מהמבחן:\nשאלה 1 - קיבלנו טבלה שבה היינו צריכים להמיר כל מיני ערכים מייצוג IEEE ממשתנה בעל 16 סיביות (7 אקספוננט ו8 מנטיסה). כולל הכי גבוה, הכי נמוך, הכי נמוך de-norm, אפס ומינוס אינסוף\nשאלה 2 - cache, קטע קוד C וצריך להגיד כמה cache miss יש ואמריקאי מה ישפר אותו\nשאלה 3 - XV6, קיבלנו קטע קוד מתוך שיעורי הבית כשבפעולה הראשית שינו את עדיפויות התהליכונים המוזנים למערכת\nשאלה 4 - הרבה משפטי נכון לא נכון\n\nהשורה התחתונה: קורס חובה, לא הרבה השקעה במהלך השנה ואז שלושה ימי למידה למבחן\nמפיל בפרטים הקטנים\nהחומר מאוד מעניין אבל מועבר בצורה שטחית/ נלמד כבר בבית הספר", "timestamp": 1691313090733}, {"author": "מארגנת מחשב", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עופר \nחוות דעת - הרצאות: \nהייתי ברוב ההרצאות שלו, לעיתים עברתי למוקלט. הוא מדבר ממש לאט ומונוטוני אז זה לא לכולם. ממש סבבה לראות הקלטות (בהן יש לו טיפה יותר כריזמה על כפול 2 או 2.5). לפעמים יש תחושה שלא מאוד כיף לו לענות על שאלות אבל כשהוא עונה הוא עונה לעניין. בכללי גם רואים שהוא ממש שאוהב את החומר ושולט בו בצורה יוצאת דופן. \nשם המתרגל/ת: יונתן \nחוות דעת - תרגולים: \nיונתן אחד המתרגלים הכי טובים שנתקלתי בהם. מאוד אכפת לו מהסטודנטים והוא שומר על אווירה מאוד מכבדת וקלילה בתרגולים. הוא בא לפני השיעור כדי להיות מוכן עם דברים על הלוח. הוא עונה על כל השאלות ולא מוותר על אף תלמיד בכיתה. באמת אכפת לו שנהיה על זה. הוא בכללי נותן תחושה שהוא מבין אותנו ולא נותן לנו להרגיש טיפשים אם חומר שהוא יחסית אינטואיטיבי לאנשים אחרים, לא בא לנו בקלות. \nשעורי הבית: \nשיעורי הבית מתחלקים ל2 חלקים:\nהחלק הראשון בו היו גיליונות להגשה בכתב של החומר שיותר קשור לארגון המחשב, שם הייתה תחושה שמאוד מחפשים על מה להוריד (כמו על פורמט הגשה לא נכון), אבל זה כנראה כי החומר הזה יותר קליל מהחלק השני. בכללי לדעתי מה שהיה בגיליונות האלה היה טיפה יותר קשה מהמבחן עצמו אז אתם במקום טוב גם אם לא הצלחתם הכל.\nבחלק השני זה יותר התמקד בלהמציא המצאות שקשורות לXV6 משהו שלא ממש עברנו עליו ולא ידענו איך לעשות. בואו נגיד שתודה לאל שיש הודים בעולם ואנשים שכבר היו בקורס לפניי שרפרנסתי מהם. באמת שלא הבנתי בכלל איך לעשות את העבודה (וככה גם רוב הסטודנטים בקורס) אבל בקשר לתרגיל בית 5, חשוב שתבינו מה קרה שם כי לנו הייתה שאלה במבחן על זה שהיא הייתה 16 נק ו6 נקודות ניקוד שלילי אם טעינו והיא באמת הייתה שאלה מתנה. \nבכללי בחלק השני הבדיקה לדעתי הייתה פחות קפדנית, כל מה שהיה להם אכפת זה שיעבוד וזהו.\n\n\nהמבחן: \nלגבי התכוננות למבחן אין הרבה דרכים לעשות את זה כי עופר לא מפרסם הרבה מבחנים לדוגמא כי הוא אוהב למחזר.\nאני לא יודעת אם אני תואמת לדעת הרוב אבל לדעתי המבחן היה מאוד הוגן. מי שידע את החומר ולמד טוב אפילו היה לו קל. מי שלא היה לו יותר קשה. הדבר היחיד שהיה קצת לא פייר אבל קצת איזן את הרמה של המבחן שבשתי שאלות היה ניקוד שלילי על תשובה לא נכונה אבל זה היה בסדר סהכ. הוא לרוב הסתמך על תשובות סופיות שזה לטוב ולרע. בכללי חשוב לדעת שיש דף נוסחאות בדרייב שהוא די נתן תשובה לכמעט חצי מהשאלות. \n\nהשורה התחתונה: \nקורס די מעניין אם הנושא מדבר אליכם, מבחן יחסית הוגן (מי שבא מוכן יצליח אין איך לברוח מזה). אם אתם יחסית על זה בסמסטר תצליחו לעבור ואפילו עם ציון טוב כי זה באמת לא הרבה חומר. אם יונתן או דן מתרגלים תלכו אליהם. בכללי לבוא לשעות קבלה זו לא מילה גסה וזה עוזר במיוחד בהגשות של תרגילי בית. אם עופר מרצה אחראי תשקלו לעשות את המוקלט שלו כי 3 שעות רצוף כבד עליי.", "timestamp": 1691321815707}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: שטרייכמן\nחוות דעת - הרצאות: רק הקלטות. חומר משעמם נורא", "timestamp": 1691393871462}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עופר\n \nחוות דעת - הרצאות: \nקצת מונוטוני אבל יש לו הרבה ידע ונסיון בהוראה שמפצים על זה. אפשר בכיף לשלב את ההרצאות המוקלטות שלו ולחסוך זמן (הוא מדבר לאט) למי שזה מתאים. \nמבחינת יחס כלפי הסטודנטים לדעתי, הלא פופולארית, הוא די אחלה- 1. נותן תשובות לשאלות רלוונטיות (אבל צריך לקחת בחשבון שהוא לא בדיוק עדין נפש אז אם את/ה מפחדים לקבל בראש מול כל הכיתה ייעוץ מקדים עם החבר שליד יעזור).\n2. במהלך השביתה הוא המשיך לתת הנחיות ללמידה מהוידיאו (ובכללי זה שהוא מאפשר גישה חופשית לוידיאו זה, לצערי, לא מובן מאליו). וגם התרגולים המשיכו כך שהקורס לא נפגע. \n3. נתן לנו שעת קבלה אקסטרא לפני המבחן.\n\nשם המתרגל/ת: יונתן+זיו לסרוגין \n\nחוות דעת - תרגולים: אחלה אנשים אבל לא יודעים את החומר מספיק טוב כדי לתרגל אותו. \n\nשעורי הבית: חשובים ורלוונטיים כדי לשלוט בחומר למבחן, האחרונים לא נלמדים בקורס וצריך עזרה מכוח עליון/ יוטיוב כדי לפתור אותם. לא ממש פייר אבל זה מה יש והם תקפים בציון...\n\nהמבחן: החסרון הכי גדול של עופר ושל הקורס לדעתי זה שהוא לא מפרסם מבחני עבר. המחזור מעיד על עצלות וחוסר רצינות אבל לסטודנטים זה יכול להועיל בטווח הקצר אם אתם מצליחים לדוג שחזורים מחברים. המבחן עצמו נוסח בצורה גרועה, אם מישהו מהסגל קורא את זה- בבקשה שימו דוגמא בהתחלה של שאלה כמו שאלה 1 וזה יחסוך לכם Umax סטודנטים ששואלים אותה שאלה כי הניסוח שלה היה פשוט מחורבן.\n\nהשורה התחתונה: לא להיט וגם לא נורא", "timestamp": 1691650068603}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: \nמונוטוני, איטי ומשעמם. אפשר לראות הקלטות על פי 2 וזה בול אותו דבר. \n\nשם המתרגל/ת: זיו \nחוות דעת - תרגולים: \nזיו חמוד ומאוד ניסה לעזור, אבל תכלס לא הייתה לו כל כך שליטה בחומר. הרבה פעמים הוא לא ידע לענות לנו על שאלות, בטח על דברים שקשורים להבנה עמוקה יותר של החומר. מספיק לקרוא את המצגת בשביל להבין את הרעיון.\n\nשעורי הבית: \nבארגון הגיליונות די קלים, חלק מהשאלות ממש טכניות של המרות בין בסיסים וכאלה, ברגע שיודעים את הטכניקה זה רץ. במערכות הפעלה זוועה. התרגיל הרטוב דורש יכולות וידע שבכלל לא לומדים בקורס ומצפים שנלמד לבד. כולם לקחו פתרון של הודי מיוטיוב. בסוף עופר דפק שאלה של איזה 20 נקודות במבחן שקשורה לתרגיל הזה אז חשוב כן להבין פחות או יותר מה קורה שם לפני המבחן. \n\nהמבחן: \nלא קשה מידי וקצר. טכני. צריך לשלוט בטכניקות של ההמרות כי יש לא מעט נקודות על זה. הרבה שאלות על מושגים ופרטים קטנים אז כדאי לעבור טוב על סיכום, ולהכניס מה שלא זוכרים לדף נוסחאות. אפשר לקבל אחלה ציון גם אם לא חדים על החומר במהלך הסמסטר. היו לנו הרבה שאלות של ניקוד שלילי במבחן. \n\nהשורה התחתונה: \nקורס די משמים והסנכרון בין ההרצאות לתרגולים גרוע. נחמד להבין קצת יותר טוב מה קורה מאחורי הקלעים של המחשב", "timestamp": 1695067058759}, {"author": "Sahar Shabi", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עופר\nחוות דעת - הרצאות: מונוטוניות ,לסמן וי \n\nשם המתרגל/ת: זיו תמיר\nחוות דעת - תרגולים: זיו תותח ,מכיל ותמיד חם לסטודנטים ,אלוף!\n\nשעורי הבית: שעורי בית פיירים \n\nהמבחן: פייר לגמרי ,מי שלמד בסמסטר יצליח\n\nהשורה התחתונה: קורס לא קשה מדי", "timestamp": 1695275299213}, {"author": "בועז בלומו", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: \nהרצאות קצת מתישות כי עופר נכנס לפרטים הקטנים בכל הנושאים, אבל בכותרות החומר מעניין וטוב לדעת אותו. החלק של המערכות הפעלה קשה משמעותית יותר, ולא קשור לארגון המחשב, אז צריכים להיות מוכנים למעבר החד.\n\nשעורי הבית: \n3 הגליונות הראשונים הם בסדר, ה2 האחרונים לא אפשריים, תמצאו רפרנס טוב באינטרנט - גיטהאב של אנשים שעשו את הקורס/ סרטוני יוטיוב וכו'.\nשווה להשקיע בזה, זה בסוף המון אחוזים מהציון הסופי.\n\nהמבחן: \nלא מאוד קשה אך קטנוני. הוא לא מפרסם מבחנים קודמים אז צריך ממש לחזור על החומר. לא לבקש ממנו את המבחנים הקודמים או לשאול על שלאלות מהם כי הוא לא יתן .\n\nהשורה התחתונה: \nקרוס קצת מעצבן מבחינת המטלות, אך החומר בכללי מעניין ואפשר להוציא ציון טוב", "timestamp": 1696398717433}, {"author": "בעיות אב בכמות גדולה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יונתן\nחוות דעת - הרצאות: הבנאדם רוצה למות, אין לו כוח ללמד ואין לו כוח לראות אותנו\n\nשם המתרגל/ת: זיו\nחוות דעת - תרגולים: סבבה לגמרי. במצגות יש כבר את כל ההסברים.\n\nשעורי הבית: החלק הראשון, סבבה לגמרי. כמגיעים לשיעורי הבית במכונה וירטואלית מגיע הסיוט. זה חומר שאמורים ללמוד לבד והוא חלק מהמבחן. סיוט להבין מה רוצים ממך, וגם כשיש סרטונים שמסבירים איך לפתור את זה, עדיין לא מובן מה צריך לעשות.\n\nהמבחן: הוא סביר... השאלה של המכונה אמריקאית קשה.\n\nהשורה התחתונה: אין מה להגיד על הקורס, אם לא היה את המכונה הוירטואלית אז היה קורס סבבה.", "timestamp": 1698325283745}]}