{"posts": [{"author": "שליחי הדודה", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: מרצה מעולה ומרתק, הרצאות ממש מעניינות בתחום תורת המשחקים וגורמות לחשיבה.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: גרוע ומיותר להגיע אליו בכלל. לא עוזר בכלל עושה שב קודמים ולא מסביר טוב.\n\nשעורי הבית: קלים לא דורשים הרבה זמן בכלל\n\nהמבחן: מבחן מאוד הוגן, לא קשה בכלל\nהשורה התחתונה: קורס מעניין, מרצה מעניין ומעולה, מבחן הוגן וציונים גבוהים", "timestamp": 1602579891327}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איתי אריאלי\n\nחוות דעת - הרצאות: \nנכון לסמסטר זום:\nהמרצה עובד עם מצגת בזמן השיעור ועובר ללוח מחיק ווירטואלי בחלק השני של השיעור. המרצה מאוד לא ברור בכל נושא חדש, אומר דברים שלא מופיעים במצגת ומתעלם מחלק מהדברים שיש במצגת. המצגות עצמן מרגישות שהם בנויות באופן חלקי מאחר וכל שיעור הוא מוצא מס' לא קטן של טעויות בסימונים שגורמים לבילבול רב.\nכל הרצאה באורך 3 שעות, כאשר השעה הראשונה מוקדשת לחזרה כמעט מוחלטת על החומר של השעה האחרונה של ההרצאה שקדמה לה (מיותר ומשעמם).\nבנוסף המרצה מדבר מספיק לאט כך שבצפייה הרצאה מוקלטת אפשרי לשים אותו על x2 ללא בעיה בכלל (לפחות מקצר את זמן הצפייה).\nבאופן כללי עקב חוסר היכולת של המרצה להסביר את עצמו באופן מובן הקורס קשה יתר על המידה למרות שהחומר מרגיש לא מסובך ככ.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: \nכל שבוע התרגול שמועלה (משמע - לא מועבר בזום אלא רק מוקלט ומועלה לצפייה אחר כך) פשוט פותר את שיעורי הבית של שבוע קודם, רמת ההסברים מרגישה כללית ולא צוללת לעומק של החומר אלא בעיקר ניפנופי ידיים.\n\nשעורי הבית: \nהשיעורי בית הם שבועיחם, בד\"כ השיעורים לא קשים וגם לא לוקחים הרבה זמן, אך עקב המרצה הלא ברור וחוסר התרגול על החומר אחרי ההרצאה (מקבלים את התרגול רק אחרי שמגישים את התרגיל) וההתנסחות הגרועה של שיעורי הבית יש הרבה התברברות עד שפותרים ומבינים את שיעורי הבית.\n\nהמבחן: \n\nהשורה התחתונה: \nקורס שיכל היה להיות מאוד מעניין ומאוד קליל הפך להיות העול של הסמסטר.", "timestamp": 1608820427143}, {"author": "~", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: \nהמרצה מעניין סך הכל אבל די מפוזר ולפעמים שוגה בסימונים או בעברית, אבל ברגע שמעירים לו על זה הוא מתקן ויסביר פעם נוספת אם צריך. לא הייתי אומר שהוא מרצה מושלם אבל רואים שחשוב לו שהסטודנטים יבינו, שזה מצויין בעיני.\nשם המתרגל/ת: עומר ציסלסקי\nחוות דעת - תרגולים: התרגולים הקלטו מראש ובהם המתרגל פתר שאלות משיעורי הבית הקודמים וקצת עבר על הגדרות וסימונים. כן היה יעיל לעבור עליהם ברפרוף ובעיקר אם היה פיתרון לא מובן בשיעורי הבית. אני חושב שאם היה ניתן להשתתף בתרגולים זה היה מועיל הרבה יותר.\n\nשעורי הבית: שיעורי בית שבועיים מרופרנסים לחלוטין. רמת השאלות לא קשה מדי, מדי פעם יש איזו שאלה שבאמת לא ברור איך אמורים לגשת אליה.\n\nהמבחן: \nהמבחן היה בתכלס שאלה אחת בעייתית ונקודות די מתנה, לא דרש הרבה התכוננות לפני.\nהשורה התחתונה: קורס נחמד וקליל שפותח את כל הנושא של תורת המשחקים, צוות אכפתי לצרכי הסטודנטים גם אם לפעמים יש בעיות ואי הבנות.", "timestamp": 1614777597761}, {"author": "JFK", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: כל הסמסטר הייתה הרגשה שאיתי מגיע לא מוכן להרצאות, כל הרצאה התחילה בשעה של חזרה על החומר, ובשאר הזמן נראה שהוא מאלתר. הדוגמאות שהוא הביא לפעמים היו לא נכונות וזה גרם למצב שהיה ממש קשה להבין את החומר.\n\nשעורי הבית: שבועיים, רלוונטיים לחומר.\n\nהמבחן: לא קשה אבל נבדק בצורה לא הוגנת.\n\nהשורה התחתונה: לקורס יש פוטנציאל להיות קורס מאוד מעניין אבל בגלל הסגל הוא הפך לקורס מעיק.", "timestamp": 1614981233413}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: מפוזר ולא ברור\n\nשם המתרגל/ת: עומר ציציאלסקי\nחוות דעת - תרגולים: המתרגל הכי גרוע בטכניון, כל הזמן אומר \"אמממ\" ומאוד לא ברור בהסברים שלו, אולי זאת תופעה של הקורונה ושלא ראו אותו בכלל אבל ככה יצא.\n\nשעורי הבית: קלים\n\nהמבחן: מאוד לא ברור, לא חושב שהמרצה הבין מה הלך שם בכלל, בדיקה הזויה\n\nהשורה התחתונה: קורס מאוד לא מומלץ, לברוח ממנו אם זה לא חובה, תורת המשחקים זה בטוח שלא.", "timestamp": 1635512601637}, {"author": "אחד שיודע", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: לרוב, ממש ארוכות וחסרות פואנטה. לא אומר שכל ה3 שעות הן בזבוז זמן למרות שפה ושם היו הרצאות מיותרות לגמרי. איתי מאוד מעופף לפעמים ומאבד את חוט המחשבה תוך כדי הוכחה \\ הסבר והדבר מקשה מאוד על מהלך ההרצאה. לא נצמד למצגות שלו ולא בא עם דוגמאות מוכנות אלא ממציא על המקום. כן אומר שהיו תרגילי בית שהיה צריך להוכיח משהו דומה למה שהוא עשה בהרצאה אבל לא בעיה לראות את המוקלט ולהבין משם. \n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: עומר לרוב היה ברור. אין מה לעשות זה קורס מבלבל וגם המתרגלים התקשו לפעמים להסביר את הדברים עד הסוף. הוא כן השתדל ותמיד ענה על שאלות. בשעות קבלה הוא ידע לרוב להסביר את הדברים.\n\nשעורי הבית: לא עמוסים בכלל. כן תשתדלו לענות בעצמכם על התרגילים כי להעתיק מהרפרנס על עיוור לא מועיל, הם משנים את השאלות ומלא אצלנו העתיקו פשוט שאלות לא נכונות. רוב התרגילים, לפחות עד השבועיים האחרונים, חישוביים אז זה לא המון עבודה.\n\nהמבחן: לא סתם הממוצע ירד ב10 נקודות לעומת שאר הסמסטרים. שאלת הוכחה מבין 3 שצריך לשנן, שאלת שיעורי בית ועוד 3 שאלות.\nבניגוד מוחלט לשאלות שהתמודדנו איתן במהלך הקורס (חישובים נטו ופה ושם הוכחות קטנות), החליטו פתאום לדחוף שאלה תיאורטית של 22 נקודות (מודל רובינשטיין תלמדו מהאינטרנט) שרק 10% מהסטודנטים הצליחו אותה, בלי סעיפים. יש במבחן הרבה תיאוריה אז תהיו מאופסים על כל ההגדרות. קשה ממש ללמוד למבחן כי יש ממש קצת מבחנים לתרגל מהם והסגל לא שחרר לכל המבחנים פתרונות.\n\nהשורה התחתונה: קורס שמרגיש שולי ואתה אומר לעצמך וואלה קליל מעלה ממוצע, ובסוף אתה מקבל 70. לא נורא אבל עדיין הסגל ממש מפוזר וזה מתיש. אם אפשר לראות את ההרצאות מוקלט עדיף תחסכו לעצמכם זמן יקר. 2 הנושאים האחרונים מועברים בצורה נוראית ובסוף לומדים את זה לבד.", "timestamp": 1645459950696}, {"author": "סכום אפס", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: משעמם ביותר, לא ברור ומיותר\n\nשם המתרגל/ת: עומר ציציאלסקי\nחוות דעת - תרגולים: בחיים לא נתקלתי במתרגל כל כך רע, הוא פשוט נקמן ומנסה לעשות רע לסטודנטים. לא מבין את החומר ובשעת קבלה לפני המבחן רק נפנופי ידיים... לא פתר שאלה אחת כמובן מחוסר ידע של החומר, מביך.\n\nשעורי הבית: לא רלוונטים כי הבדיקה היא בינארית ולכן קשה להצליח במבחן\n\nהמבחן: כל כך לא ברור, בדיקה הזויה וקפדנית בטירוף - שקול לאינפי... מורידים על כל שטות קטנה למרות שלמתרגלים אין מושג איך לפתור את התרגילים האלה... בקיצור אפשר ממש להצליח במבחן או ממש לא להצליח כתלות במצב רוח של הבודקים. \n\nהשורה התחתונה: קורס מאוד מאוד מיותר, לברוח כמו מאש כל עוד הסגל הנוכחי קיים פה. אם לא קורס חובה, להתרחק!", "timestamp": 1646294211052}, {"author": "אנונימי אנונימוסס", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: מצגות לא רלוונטיות להרצאה בהינתן התרגולים ההרצאות קצת מיותרות\nמאוד מפוזר\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: עזר מאוד להבין את החומר שלא ברור בהרצאות, מסביר טוב נותן טיפים למבחן עונה לכל השאלות בפירוט רב\n\nשעורי הבית: לא תמיד קלים אבל עוזרים בשעות הקבלה ווזה בינארי בלי בדיקה\n\nהמבחן: הוגן עם בדיקה לא הוגנת\n\nהשורה התחתונה: סביר לא מומלץ יותר מידי", "timestamp": 1646386307452}, {"author": "סוכן מפוזר", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: איתי אדם מאוד נחמד. סך הכל באמת רואים שהוא יודע את החומר ורואים שהוא מנסה להעביר אותו. הבעיה שזה נשאר בגדר המנסה. מהרגע שהגענו למשחקים עם אינפורמציה לא מלאה הוא איבד את זה לגמרי עם הסימונים והחישובים. סך הכל לאורך כל הקורס הוא באמת ניסה להסביר ולגרום לנו להבין על מה הוא מדביר. לכל מי שהייתה שאלה יכל להגיע אליו לשעת קבלה ולקבל עליה תשובה מספקת.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: עומר מתרגל נהדר. במהלך התרגול קצת קשה לעקוב אחריו כי הוא קופץ מלוח ללוח אבל הוא באמת יודע את החומר ומצליח להסביר אותו מצוין. בלעדיו כנראה הייתי מסיים על ציון חד ספרתי.\n\nשעורי הבית: השיעורי בית מאוד קלים, לפעמים קצת ארוכים ומעיקים אבל סך הכל באמת סבבה\n\nהמבחן: מועד א הייתה שאלה לא פתירה של רובנשטיין (עד היום לא סגור מה זה) אבל סך הכל מבחן פייר והוגן. אני כן חושב אולי שאת השאלה הלא פתירה היה אפשר להוריד או להחליף במשהו טיפה יותר חביב כדי שלא כולם יתחילו את המבחן מ78 ויתפללו לפקטור (לא היה) אבל סך הכל באמת היה מבחן הוגן.\n\nהשורה התחתונה: תכלס אחלה קורס, קצת מרגיש כיאילו כל החומר הזה מונפץ ולא שווה כלום אבל תאמת שזה קורס מעניין ואם מקשיבים בתרגולים (הרצאות זה בגדר המלצה) אפשר להוציא בו ציון גבוה.", "timestamp": 1646577921560}, {"author": "שחקן ממקסם", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: לא הרגשתי שהיה ערך מוסף, יצאתי מבולבלת מכל הרצאה. התרגולים מספיקים.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת- לי הרגיש שהוא מאוד נצמד לדף התרגול שלו ולא ידע לענות על שאלות נוספות, השאלות בתרגולים ממש ברמת שיעורי הבית שזה נחמד\n\nשעורי הבית: לא קשים, לוקחים גג שעתיים\n\nהמבחן: המבחן מחולק ל-5 שאלות שמתוכן 2 ממש קשות ו-3 שאלות שהן הוכחת משפט/שיעורי בית/ ועוד שאלה ברמת שיעורי הבית (לפחות ככה היה במועד ב).\n\nהשורה התחתונה: קורס די נחמד, תלמדו טוב את החומר של סוף הקורס, מודל רובינשטיין!", "timestamp": 1647362976205}, {"author": "לא רציונלי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: רוב ההרצאות לא ברורות, לא מתייחס ככ לחוסר ידע של הסטודנטים\nאין לו דרך טובה להסביר את החומר ובמיוחד את המתמטיקה פשוט לא ברור. קשה לו להסביר והוא לא מודע לזה. קורס מאוד מתמטי\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: מתרגל ממש ממש סבבה,מרגיש שהוא נותן אקסטרה בשביל הסטודנטים. התחשב מאוד בקטע של ההקלטות למרות שלא תמיד זכר להעלות בזמן ולקח לו זמן לפעמים\n\nשעורי הבית: לא מאוד קשים חשוב לראות את התרגולים ואז מאוד דומה. אני אישית חושבת שלעשות את התרגילים עם התרגול פתוח ואז זה עזר מאוד\n\nהמבחן: מבחן סופר דופר קשה אפשר לקבל עובר בקלות כי יש שאלות הוכחה (שינון נטו אין אלמנט של ידע) ושאלה מהשיעורים אבל יש שתי שאלות קשות יחסית, צריך לגרד שם נקודות\n\nהשורה התחתונה: בסך הכל מעניין אבל ההרצאות מקשות", "timestamp": 1647371892756}, {"author": "דן על הגרבר", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: איש נבון שיודע את החומר בצורה מושלמת, חבל שהוא לא יודע איך להעביר את החומר בצורה טובה.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: עומר מתרגל מעולה, עזר לי להבין את החומר הרבה יותר מההרצאות.\n\nשעורי הבית: לרוב קלים וממש עוזרים בהבנת החומר.\n\nהמבחן: בניגוד למה שנאמר למעלה על המרצה הוא יודע לכתוב מבחנים הוגנים, מי שיודע את החומר צפוי לקבל 80+, קשה לקבל 100, בדיקה לא משהו ולא מאוד מוסברת.\n\nהשורה התחתונה: תרגול, תרגול, ולהירדם בהרצאה.", "timestamp": 1647983043202}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: המרצה הכי לא משכנע שפגשתי. הוכיח דברים ושאל אותנו אם הוא הוכיח בסדר. לא מובן, לא כיף\n\nשם המתרגל/ת: עומר ומשה\nחוות דעת - תרגולים: משה מתרגל מצויין. קצת איטי, אבל לקראת סוף הקורס זה ממש טוב ועוזר.\nעומר יודע להעביר חומר בקורה מעולה. חבל שהוא נלחם להוריד את ממוצע הוקס ב10 נקודות, ממש סתם. לא ברור לי איך בן-אדם שכל הסמסטר שיחק אותה כאילו הוא לטובתנו מתעקש למרצה שהוא לא יפקטר. מה נראה לא? חושב שהוא מינימום ראש מסלול ככה שמחליט מה ממוצע ראוי בקורס, הוא כולו מתרגל בן 21. \n\nשעורי הבית: מלמדים ולא ארוכים מדיי\n\nהמבחן: קצת לא ברור. לא קשה בטירוף אבל גם בכלל לא קל\n\nהשורה התחתונה: הבעיות העיקריות בקורס הם 1. רמת ההוראה בהרצאות. 2. לא מפרסמים פתרונות לכלום. לא לתרגילי הבית, לא למבחני עבר, לא לכלום. ממש היינו חייבים להתחננן עבור כל פתרון לכל סעיף שלא הבנו. לא ברור מה כואב להעלות פתרונות, זה היה סיות ללמוד למבחן כשלא יודעים אם בכלל הגעת לפתרון הנכון. גישה מסריחה מאד. הכל פשוט חבל כי הקורס מעניין, חומר חביב. סגל פשוט מסריח.", "timestamp": 1648466590800}, {"author": "fun guy", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: נחמד סך הכל, לא קל בהרצאות\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: מדהים מדהים מדהים!\n\nשעורי הבית: לא ארוכים\n\nהמבחן: מועד ג היה קליללל ציונים גבוהים\n\nהשורה התחתונה: לכו רק למועדי ג של איתי", "timestamp": 1649010821369}, {"author": "מאוכזב", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: לא רלוונטי בעליל\n\nשם המתרגל/ת: עומר ציציאלסקי\nחוות דעת - תרגולים: איש רע, אין מילים אחרות לתאר איך עתודאי שחושב שהטכניון זאת הממלכה שלו והוא שולט בכל הסטודנטים פה ויכתיב להם ממוצע חדש בקורס... עד עכשיו הממוצע בקורס עמד על 83 בערך, עומר החליט להוריד במעל 10 נקודות את הממוצע ולהיות רע כהרגלו. יופי שמח שהכסף של הטכניון הולך על מתרגלים ברמה גבוה של נקמנות, פקולטה בזיונית\n\nשעורי הבית: קלים\n\nהמבחן: לא רלוונטי גם ככה יכנסו בכם בכל דבר שתכתבו במיוחד אם איתי יבדוק לכם את השאלה או חס וחלילה עומר\n\nהשורה התחתונה: מי שזה קורס חובה עבורו, בהצלחה! מי שלא חייב, שלא יקח", "timestamp": 1649428372891}]}