{"posts": [{"author": "anon", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: קונספט קצת שונה משאר הקורסים. סה\"כ 8 מפגשים כל אחד 4 שעות. כל המפגשים מסתיימים לפני מאי, מה שאומר - בחלק מהשבועות יש שני מפגשים בשבוע מה שיוצא מאד עמוס. ההרצאות והמפגשים מועברים כולם בזום באנגלית ולכן אין טעם להירשם אם האנגלית שלך נמוכה (ברמת דיבור וכתיבה). \nמבחינת התוכן שמועבר - כל הרצאה מכילה תכנים של משפטים + תכנים של data science כאשר המטרה היא להכיר לסטודנטים של data science תכנים של אתיקה ומה החוק אומר בנושא, והמשפטנים לומדים על עולם התכן שלנו (מאד High level). הסגל מורכב ממרצים מהטכניון, ועוד אוניברסיטאות בעולם, חלק מהמרצים בתחומי משפטים וחלק בתחומי הדאטא. בתחילת הסמסטר מחלקים אתכם לקבוצות של 4-5 סטודנטים והן מה שמכריע בסופו של דבר איך יהיה לכם הקורס. הקבוצות מורכבות מסטודנטים למשפטים ומדעי המחשב/דאטא סיינס. בכל שיעור יש משימה בקבוצות שעושים והמטרה זה שכל אחד ייצג את הצד שלו. חלק מהמשימות מובנות וחלק יותר חופשיות, ובסוף כל שיעור יש דיבייט/ mock trial על המשימה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: היה בערך 4 תרגילים, כל אחד לקח חצי שעה- שעתיים. האופן שבו הם בנויים - כהכנה לשיעור הבא. בחלק מהתרגילים מבצעים משימות שצריך להציג בשיעור הבא בפני הקבוצה. התרגילים עצמם כוללים לרוב קוד - מביאים לך מחברת jupyter ואתה צריך לענות על סעיפים על גביהם. תרגילים קלילים וחמודים. \n\nהמבחן: אין, במקום זה יש עבודה. הציון מורכב מ- השתתפות בשיעורים שכוללת הצגה של סוגיות אתיות + עבודה. בסה\"כ עבודה לא מאד עמוסה אם נפלת על קבוצה טובה, רוב העבודה היא על הסטודנטים למדעי מחשב/data science, ולכן אם אתם במקרה נפלתם לבד ושאר הקבוצה משפטנים אז כנראה שתעשו את הרוב אתם. \n\nהשורה התחתונה: קורס עמוס בקונספט מאד שונה מכלל התואר (לטובה ולרעה) אבל ציונים גבוהים ואם נפלת על קבוצה טובה אז ניצחת בגדול. בסה\"כ מומלץ.", "timestamp": 1657350328756}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "קורס בפורמט שונה מכל מה שיצא לי לקחת עד היום. בקורס משתתפים סטודנטים שלומדים DS וסטודנטים למשפטים עם סטודנטים מהארץ ומחו\"ל, מחלקים את הסטודנטים לקבוצות (לא נתונות לבחירה) ואלו הקבוצות שרצות יחד כל הקורס. הקורס מועבר כולו בזום, יש שתי הרצאות שבועיות של 4 שעות כל אחת - קצת מעיק ותופס די הרבה מקום במערכת. היתרון המשמעותי - כבר באמצע הסמסטר הקורס נגמר סופית ואז מתפנות 8 שעות בלו\"ז. הקורס מועבר כולו באנגלית אז צריכים לדעת גם להבין וגם לדבר ברמה יחסית גבוהה. בהרצאות עצמן מציגים נושא מעולם המשפט ומקשרים אותו לעולם ה- DS וכל קבוצה עושה פעילויות שקשורות לנושא הזה ביחד.\n\nשעורי הבית: יש שיעורי בית נפרדים לסטודנטים של DS ולמשפטנים, ובנוסף יש שיעורי בית לכולם (קריאה של בערך 15-20 דקות). לגבי שיעורי DS, מדובר במחברת עם קוד וצריך לענות על שאלות בהתאם לנושא הספציפי של המחברת, זה יכול לכלול משחקים עם pandas או אפילו לבנות מודל שמגיע לרמת דיוק מסוימת. בפועל - השיעורים שכללו קריאה של כתבות היו יחסית מיותרים, אף אחד לא באמת בדק את זה. זה יכול לעזור קצת בהרצאות כשיודעים מראש למה נכנסים אבל זה לא הכרחי בכלל.\n\nהמבחן: פרויקט בקבוצות. כל קבוצה מקבלת נושא מתוך מאגר של נושאים וצריך ליצור/להמציא קייס משפטי בנושא זה ולחקור מערכת AI שלוקחת חלק בתהליך. קצת חופר (וקצת מעיק כשצריך לחלק עבודה בין 6 אנשים מאזורי זמן שונים) אבל לא נורא.\n\nהשורה התחתונה: קורס עם נושא מעניין, יש קצת אווירה של מל\"ג, מסיימים תוך חצי סמסטר והציונים ממש אחלה. אם לא צפוי הרבה עומס מקורסים אחרים בתחילת הסמסטר - מומלץ.", "timestamp": 1683653959048}, {"author": "מציל סטודנטים", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אבי גל (למרות שבפועל זה שילוב של כמה מרצים מהארץ ומהעולם)\nחוות דעת - הרצאות: יחסית מעניין, כל שיעור יש איזשהו נושא אתי שקשור ללמידת מכונה ויש דיון ומטלת שיעור סביב העניין.\n\nבמהלך ההרצאות יש גם עבודה בקבוצות מעורבבות מכל האוניברסיטאות.\n\n\nשעורי הבית: לפני כל שיעור יש מטלה קצרה שהיא בדר\"כ לקרוא מאמר קצר ממש (~10 דק) ולמלא מחברת קולאב קצרה.\n\nהמבחן: אין מבחן יש פרוייקט סופי שבו צריך להציג נושא אתי משלנו לפי נושא שאנו בחרנו, ולבנות סביב הנושא הזה case משפטי שלם כמו הדברים שהם הציגו לנו במהלך השיעור.\n\n\nהשורה התחתונה: \nבקורס כזה, התחושה והחוויה שתקבלו תלויים לחלוטין בקבוצה שהוגרלה לכם, אם יש בקבוצה שלכם סטודנטים עצלנים (כמו שלי היה) אכלתם אותה ותעשו את רוב העבודה בעצמכם (אם לא את כולה)\n\nבתכלס, הקורס נגמר באמצע הסמסטר ממש לפני שהעומס האמיתי מתחיל (איזור שבוע 6) והוא ממש מרענן מבחינת זה שלא באמת לומדים בצורה סטנדרטית חומר כמו בשאר הקורסים הרגילים.", "timestamp": 1689174741703}]}