{"posts": [{"author": "מור בורשטיין", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: בר גינוסר\nחוות דעת - תרגולים: מתרגל מעולה ומאוד עוזר\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מאוד מעניין אך קשה", "timestamp": 1599927410820}, {"author": "שליחי הדודה", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "שם המרצה: אביגדור\nחוות דעת - הרצאות: מרצה משעמם מאוד. חומר לא הכי מעניין והרבה תיאוריה.\n\nשם המתרגל/ת: בר גנוסר וקורל \nחוות דעת - תרגולים: מתרגלים מדהימים. עוזרים מאוד להבנת החומר, מאוד נחמדים ואכפתיים.\n\nשעורי הבית: ארוכים אבל נחמדים ומעניינים לעומת הקורס המשמים.\n\nהמבחן והבוחן לא הוגנים בכלל. מרצה שלא בוחן ידע אלא רק מי כותב יותר שטויות. מרצה לא הוגן ולא מתחשב. בונה את המבחנים בצורה דפוקה. אין פתרונות למבחנים קודמים.\n\nהשורה התחתונה: קורס מעניין חלקית. מרצה גרוע ולא מתחשב. מתרגלים מדהימים שהופכים את הקורס ליותר מהנה ויותר קל.", "timestamp": 1602580183706}, {"author": "אבגד", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: בר / קורל\nחוות דעת - תרגולים: \n\nשעורי הבית: 4 גליונות קצרים (ולא קשים) במהלך הסמסטר ופרויקט בשני חלקים החל מאמצע הסמסטר (קצת עמוס אבל לא מסובך יותר מדי). בנוסף יש מעבדות (לא חובה) בחלק מהשבועות כדי לתרגל את הנושאים הטכניים של הקורס (HTML, PHP, SQL)\n\nהמבחן:\n\nהשורה התחתונה: קורס כמעט ולא עמוס והמבחן לא כזה נורא, אבל סגל הקורס כמעט ולא מספק שאלות נוספות לתרגול והטמעת החומר אז חלק לא מבוטל מהקורס כולל למידה עצמית", "timestamp": 1612343145173}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: לא משהו, מאד משעממות ולא קשורות למבחן\n\nשם המתרגל/ת: בר/קורל\nחוות דעת - תרגולים: מתרגלים מעולים, עונים על כל שאלה ויש הרבה שעות קבלה במהלך הסמסטר ולקראת המבחן\n\nשעורי הבית: לא קשים מדי ולא מעמיסים בכלל, יש הרבה מעבדות שהן לא להגשה אבל מחזקות את ההבנה של החומר\n\nהמבחן: ברמה סבירה, מה שכן - תמיד מוצאים על מה להוריד וקל לאבד נקודות סתם\n\nהשורה התחתונה: החלק של הSQL מאד רלוונטי להמשך כל שאר החומר פחות מעניין או רלוונטי", "timestamp": 1614517902813}, {"author": "---", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: ההרצעות המוקלטים עושים עבודה טובה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טובים ויש גם תרגילים לתרגול עצמי. חובה לעזות אותם וללכת לשעת הקבלה אם לא אצלחתם. \n\nשעורי הבית: מעניינים (בניית אתר אינטרנט בסיס למשל). אין רפרנס אבל לא קשה. \n\nהמבחן: הוגן ושווה מעט בציון הסופי\n\nהשורה התחתונה: קורס מאוד מעניין וחשוב", "timestamp": 1614753003104}, {"author": "--", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: רועי שרגא\nחוות דעת - הרצאות: מרצה מעניין, הקליט את ההרצאות מראש ככה שלא ענה על שאלות אבל יחסית מובן.\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: מתרגל מעולה, מסביר מצויין.\n\nשעורי הבית: יש די הרבה אבל לא מאוד קשים ודי נחמדים\n\nהמבחן: מבחן קשה מאוד, צריך להיות מאוד על החומר ולבוא לשעות קבלה.\n\nהשורה התחתונה: קורס מעניין וחשוב אבל עמוס וקשה.", "timestamp": 1615195695610}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביגל \nחוות דעת - הרצאות: די בסדר - יש חלק באמצע שלא מבינים מה קורה אבל פשוט לשרוד אותו. משעממות אבל סבירות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חשובים\n\nשעורי הבית: למי שלא מכיר - לוקח זמן. להיכנס לסביבת עבודה ולהבין מה רוצים ממך. אבל חוץ מזה סבירים לגמרי. \n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס הוגן בסך הכל", "timestamp": 1615712961898}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: הרצאות די מעניינות, בתיה מסבירה את החומר כהוגן, עונה בסבלנות ובענייניות על כל שאלה. באה מוכנה לכל הרצאה.\nסך הכל מרצה טובה מאוד, במיוחד בהתחשב בזה שהעבירה את הקורס בפעם הראשונה.\n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים: \nבר המתרגל הכי טוב שהיה לי אי פעם- בקיא בחומר בטירוף, תמיד עוזר, מנסה להבין לעומק מה הסטודנטים לא הבינו נכון ומנסה לענות להם בהתאם לכך, שנון ומדבר בגובה העיניים ובהערכה לכל סטודנט.\n\nשעורי הבית: \nיש פרוייקט בסוף הקורס שלוקח קצת זמן אבל בסה\"כ מלבד זה שיעורי הבית השוטפים גם לא רבים וגם ברמה הגיונית ולוקחים זמן סביר בהחלט.\n\nהמבחן: \nהמבחן הסמסטר היה הוגן מאוד\n\nהשורה התחתונה: אחלה קורס, בין הכיפיים שהיו לי עד כה", "timestamp": 1635109361404}, {"author": "גל", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: טובות וענייניות. חשוב להבין את הרעיון במהלכן ולהיכנס לפורמליזציה יותר לקראת נמבחן\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: מתרגל מדהים שמעביר את החומר בצורה חלקה וטובה, הצלחתי במבחן הרבה בזכותו\n\nשעורי הבית: חשוב לעשות בעיקר את התרגיל php שתרם לי המון להבנה בקורס. עומס בינוני\n\nהמבחן: \nבעיניי הרמה ירדה ממבחנים של שנים קודמות אבל צריך לחרוש כמו שצריך כדי להצליח\nהשורה התחתונה: קורס מעניין עם אחלה סגל", "timestamp": 1635832034434}, {"author": "Lightning Shepard", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: \nככה\"נ בתיה מבינה מאוד את החומר שהיא מעבירה, אבל זה לא בא לידי ביטוי בהרצאות שלה\nהיא יודעת לעמוד מול כיתה ולהעביר חומר, אבל מעבירה את הקורס בחוסר עניין, ורצה מאוד, מה שלא מאפשר להבין את החומר כמו שצריך (על אף שהחומר לא כזה מסובך סך הכל ביחס לקורסים אחרים).\nשם המתרגל/ת: בר גינוסר\nחוות דעת - תרגולים: \nבר מתרגל מדהים, וכל מילה נוספת מיותרת.\nשעורי הבית: \nההגשות בזוגות, והן יכולות להיגרר. בסוף הסמסטר אף לא התביישו לתת 2 הגשות שונות במקביל.\nחלקן קשורות להרצאות, חלקן קשורות רק לתרגולים.\nמורידים נקודות בהגשות אז שווה להשקיע ובעיקר לשים לב להוראות הגשה כי יש הגשות שנבדקות אוטומטית ואז מספיק שכתבתם את שם הקובץ לא נכון והכל נזרק לפח.\nהמבחן: \nנכון לכתיבת שורות אלו - לא היה עדיין.\nהשורה התחתונה:\nלכאורה קורס יותר רלוונטי לשוק העבודה כי לומדים SQL, אבל בפועל זה רק 2 תרגולים (ו0 הרצאות) אז אפשר להתווכח כמה זה באמת היה משמעותי..\nחלק מהחומר תלוש וממש באוויר, וחלק מהחומר יותר רלוונטי.\nסה\"כ קורס חובה ממילא.", "timestamp": 1641982747492}, {"author": "הוא שאינו יודע לשאול שאילתות", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: לדעתי האישית, ההרצאות לא מועילות כלל. מאוד ממליץ ללמוד את החומר התאורטי בצורה עצמאית - מתיישב בצורה הרבה יותר מובנת וגם הפרמול הרבה יותר נגיש לאחר מכן.\n\nשם המתרגל/ת: עומר שובי\nחוות דעת - תרגולים: מתרגל מדהים, אכפתי, רוצה שיבינו את החומר ומחכה לשאלות. גם במעבדות, נותן את הזמן לכל סטודנט על מנת שהחומר ישקע ואם יש צורך חוזר עליו שוב. מיותר לציין שעומר אחלה גבר!\n\nשעורי הבית: לא קשים מדי, מאוד מומלץ ללמוד SQL בצורה עצמאית בנפרד מהקורס, יחסוך המון זמן :)\n\nהמבחן: הוגן לגמרי!\n\nהשורה התחתונה: קורס חמוד וחשוב להמשך - חבל שלא עובר בצורה יעילה בהעברת החומר. מומלץ להעמיק בדברים גם מעבר לקורס וללמוד יותר דברים עצמאית :)", "timestamp": 1646036033172}, {"author": "המנהל", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: הרצאות מרגישות לא רלוונטיות באף צורה לא רואה סיבה להגיע אלה אם כן רוצים לקבל הבנה עמוקה של החומר (לא נחוצה בכללללל)\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: מתרגל מדהים. יודע להעביר את החומר ברמה מאוד גבוהה ורוצה שכולם יצליחו\n\nשעורי הבית: קשים, דורשים הרבה עבודה אבל מאוד חשובים לקורסים עתידיים ולעבודה בעתיד\n\nהמבחן: פייר לחלוטין, המבחן היה סבבה לגמרי \n\nהשורה התחתונה: קורס חשוב מאוד להמשך הדרך, שווה מאוד לקחת ולנסות להוציא בו ציון טוב", "timestamp": 1646578067673}, {"author": "ג'אנגו חסר מעצורים", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: על הפנים. כל הסבר שלה מבלבל הרבה יותר, עדיף לקרוא את המצגות לבד. היה גרוע מאוד.\nיש גם קטע ש2 נושאים מהקורס לומדים בכיתה הפוכה- לראות את ההקלטה, ואין צורך לבוא לכיתה ההפוכה, מיותר לחלוטין.\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: לא יודעת מה כולם מתלהבים ממנו, הוא אמנם בחור נורא נחמד אין ספק, אבל חופר ברמות, כל הסבר שלו 800 מילים, לא יודע לתת הסבר קצר וקולע, איך אפשר להתרכז בהסבר כזה? עד שהוא מסיים להסביר שכחתי מה הייתה השאלה.\nלא כותב כלום על הלוח, כל ההסברים והחישובים עושה בעל פה, סיוט לבעלי הפרעות קשב מינימליות, כמעט בלתי אפשרי לעקוב אחריו.\nוגם הרבה מהתרגולים מתארכים 15-20 ואף יותר מעבר לסוף זמן התרגול. \nקיצר בר ממש נחמד וזוכר את השמות של כולם, אבל לא מומלץ לדעתי כמתרגל...\nהתרגולים עצמם חשובים מאוד להבנת החומר בקורס.\n\nשעורי הבית: בזוגות, לא קשים, להבין איך לעבוד עם ג'אנגו יכול לקחת אז הזמן שלו, ובתרגולים זה ממש לא ברור, צריך ללמוד את זה פחות או יותר לבד, אבל חוץ מזה רמה לא ממש גבוה בתרגילי בית. ג'אנגו לא בחומר למבחן, ככה שרק אחד השותפים תכלס צריך ללמוד לעשות את זה...\n\nהמבחן: מבחינת הרמה היה הוגן, אבל מאוד עמוס, הרבה מהסטודנטים אמרו שלא הצליחו לסיים את כל השאלות בזמן. אבל הבדיקה יחסית מקלה לסטנדרט בטכניון אז גם אם לא עושים הכל טוב עדיין אפשר לקבל ציון סבבה.\n\nהשורה התחתונה: החומר של הקורס סופר חשוב, אבל הסגל די מעפן.", "timestamp": 1646761266051}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: וואו מתרגל מדהים. יודע להתעכב כשצריך ולרוץ בזמנים מתאימים גם כן.\n\nשעורי הבית: לוקחים את הזמן, אבל ממש מועילים להבנה של החומר.\n\nהמבחן: הוגן בהחלט, לא צריך יותר מ3-4 ימים ללמידה\n\nהשורה התחתונה: קורס אחלה", "timestamp": 1646820634902}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: ממש לא כיף. מזל שאין בהרצאות חומר שלא נלמד בתרגול, אז פחות חשוב להגיע\n\nשם המתרגל/ת: עומר שובי\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב וממש אכפתלו ומנסה לעזור. בתכלס כל המתרגלים הם טובים מאדץ יש גם קטע של מעבדה שמתנסים בדברים תוך כדי התרגול והמתרגל מסתובב ועוזר, ממש מלמד ומאד מומלץ להגיע לזה \n\nשעורי הבית: דורשים זמן אבל מלמדים מאד  וגם פתירים. מרכיבים חלק מכובד של הציון (בעיקר הפרויקט שזה סתם תרגיל בית ארוך יותר), אז לפחות משתלם להשקיע בהם.\n\nהמבחן: הוגן ופתיר אבל פשוט לחוץ נורא בזמנים. ניהול זמן זה הדרך להצלילח. חומר פתוח אז סבבה\n\nהשורה התחתונה: אחלה קורס, חשוב, מלמד, רלוונטי, ואין תחושה שמנסים לדפוק את הסטודנטים בכל פינה. מאד אהבתי", "timestamp": 1647500205550}, {"author": "יכיח ולא נובע", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: בחיים לא פגשתי מרצה כזאת. ניתן בכל פעם שאחד הסטודנטים שואל שאלה לראות את הפחד בעיניים שלה.זה הגיע למצב שסטודנט א שואל שאלה, היא אומרת לו שהוא טועה וקופץ סטודנט ב אחר עם הסבר מאוד לא מבריק אבל נכון, ומשכנע אותה. ברור לי שאף מרצה לא מושלם בהבנה שלו של החומר אבל זה כאילו חצי שעה לפני ההרצאה היא עברה ברפרוף על המצגת פעם ראשונה תוך כדי שהיא אכלה צהריים. ממליץ להביא בירה\\XL\\חומר משנה תודעה כלשהו איתכם אם אתם מתכננים להגיע ללייב שלה. לא מומלץ.\n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים: בלא מעט נושאים, אתה מוצא את עצמך לא מבין כלום בהם בהרצאות ורק לאחר ההסבר המעולה והסבלני של בר אתה מבין. בחור חד רצח, יש לו תשובה עניינית לכל שאלה כמעט ואינטואיציה מעולה למה בדיוק הסטודנט שמולו לא מבין. עם מבט לאחור הייתי מוותר על הביזיון שנקרא ההרצאות של בתיה ומגיע רק לתרגולים של בר.\n\nשעורי הבית: מלמדים המון, הבודקים הוגנים מאוד בבדיקה. 40 אחוז מגן\\תקף מתנה אם עובדים נכון\n\nהמבחן: מועד א היה מאוד הוגן. גם הבדיקה מקלה. מספיק 3 ימים ללמוד אליו\n\nהשורה התחתונה: נהנתי מאוד מהקורס הרבה בזכות בר שמעביר את החומר מעולה. עבודות מאוד מלמדות ומהנות. קורס חשוב לתחום ויחסית קל להוציא בו ציון גבוה", "timestamp": 1648076137646}, {"author": "ג'אנגו רלציוני", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: פשוט קוראת מהמצגת,לא נותנת אינטאיציות לחומר הנלמד כמעט בכלל,ובאופן כללי מורגש שהקורס קצת נפל עליה מהשמיים.\npro tip- יש בפנופטו הקלטות של ההרצאות של אבי גל שמעבירות את אותם נושאים בדיוק כמו בהרצאה רק בגישה הרבה יותר טובה ומובנת. חפשו 094240 וזה אמור למצוא את ההקלטות (אמנם הקלטות בני יותר מעשור אבל כמעט כל החומר זהה לחלוטין)\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: המתרגל הכי טוב ואכפתי בטכניון. וואו.\nהיינו בסביבות ה150-200 סטודנטים בקורס,ועדיין בר התאמץ ודאג לזכור את השם של כל אחד מהסטודנטים שפנו אליו.\nמעבר לכך,הוא מעביר את נושאי התרגולים בצורה מדהימה, וברוב המקרים שימש גם כמרצה בפועל של הקורס,וכל זה מתוך רצון אישי בלבד.\nלכל בעיה או שאלה שהייתה לי במהלך הסמסטר הוא דאג לנסות ולמצוא פתרון, ובעיניי זה דבר שהוא בכלל לא מובן מאליו. זכות גדולה ללמוד ממנו\n\nשעורי הבית: \nאני חושב שזאת פעם ראשונה שממש נהניתי במטלה כלשהי בתואר. אמנם לא תרגילים קלים, ויש נושא שלם של django שדי למדנו בצורה עצמאית, אבל התחושה הייתה שבאמת מתעסקים בתכלס של התואר, והלמידה העצמית נתנה לי הבנה מעמיקה על החומר. מה גם שאחוז התרגילים בציון יכול להגיע ל40 אחוז,אז בכלל שווה להשקיע בהם\n\nהמבחן: \nהרמה של המבחן די סבירה ביחס לחומר,הבעיה היחידה זה זמן.\nזמן המבחן הוא שעתיים וחצי,וזמן כל שאלה הוא במקרה הטוב 40 דקות, ככה שאין זמן להתעכב על דברים. מומלץ מאוד לעבוד מההתחלה על זמנים כשלומדים למבחן ולא להמרח בפתרונות\n\nהשורה התחתונה: \nקורס מעניין מאוד, וחשוב מאוד לעתיד המקצועי בתחום הדאטה. מומלץ בחום גם למי שרוצה קורס בחירה לפי דעתי,אם כי הוא לא בהכרח קורס קל", "timestamp": 1648366430920}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: קוראת מהמצגת ולא מעבר. כל שאלה מעבר לטקסט לא בהכרח נתנה תשובה מספקת לכן אל תתרגשו אם אתם לא מבינים משהו מההרצאה.\nמוכרח לציין שהמצגות בקורס הזה מאוד כבדות עם מלא שקפים ומלל ובקלות אפשר לאבד את זה בהרצאה ולא להקשיב ובאמת שזה בסדר. עוברים על החומר אחרי זה בתרגולים אז לא לפחד.\nהחומר עצמו לפעמים ממש מעניין ולפעמים יבש ברמות אז תיהנו\n\nשם המתרגל/ת: בר גינוסר\nחוות דעת - תרגולים: המתרגל הכי טוב שיצא לי להכיר. בן אדם שהוא תותח, גם יודע את החומר בצורה עמוקה וגם כל כך אכפתי ומנסה להעביר אותו בצורה שכולם יבינו. אין מה לומר באמת שאתם תפסידו אם לא תלכו אליו.\nמעביר גם את החומר הפרקטי וגם את החומר התיאורטי בצורה מובנת, מאוד ברור כשהולכים אליו בשעת קבלה ועונה על כל שאלה בצורה הכי מדויקת שיש. תותח על וחבל שהוא לא מתרגל בעוד קורסים שאנחנו לוקחים.\n\nשעורי הבית: לנו היו 4 תרגילי בית ופרויקט ב2 חלקים. שיעורי הבית היו הוגנים. תשקיעו מאוד בכולם ובפרויקט כי זה 60 אחוז מהציון הסופי שלכם (שיעורי בית מגן ופרויקט תקף). חראם על כל נקודה שתרד לכם כי לא קשה לקבל 100 בהכל, רק לוודא לפני שמגישים שהכל עובד ושהנימוקים מספיק משכנעים ונכונים.\n\nהמבחן: אני ניגשתי למועד א והמבחן עצמו היה מאוד הוגן, אמנם קצת עמוס בגלל הזמנים. מבחני העבר מלמדים מאוד וממליץ לכם ללמוד טוב אליו. כמו שאתם רואים הרוב המוחלט יצא עם ציון של 80+ מהקורס כי באמת שאם לומדים כמו שצריך במהלך הסמסטר אז הלמידה למבחן לא מאוד קשה. נקודה חשובה: הייתה לנו במבחן שאלה של 5 נקודות שהופיעה בשאלות הבונוס שהתפרסמו במהלך הסמסטר. למי שפתר היה את הפתרון מול העיניים והרוויח 5 נקודות קלות, אז ממליץ כן לפתור את שאלות הבונוס שהסגל מפרסם, או לכל הפחות לפתור אותן לקראת הלמידה למבחן\n\nהשורה התחתונה: קורס מאוד מעניין עם חומר שחשוב להכיר, מה גם שחברות מחפשות עובדים עם ידע ב sql ומהקורס הזה יוצאים עם ידע מספיק.", "timestamp": 1653665781712}, {"author": "Idan Peretz", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nבתיה מרצה מעולה. מלמדת את החומר בצורה ברורה. כריזמטית ושומרת על הסטודנטים עירניים ומעורבים בשיעור.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא מכיר את המתרגלים האחרים אבל תעשו לעצמכם טובה ולכו לתרגולים של בר גנוסר.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676276032234}, {"author": "אינדקס לא מקובץ", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: בתיה בסה\"כ מקריאה מהמצגות הלא מאוד אינפורמטיביות שלה (שהן בכלל מהקורס המקביל במדמ\"ח). לא חושב שהייתה פעם אחת שמישהו שאל אותה שאלה בזמן הרצאה והיא נתנה לו תשובה מספקת, לרוב היא פשוט חוזרת על מה שהיא אמרה או עונה משהו לא קשור. באופן כללי ההרצאות לא משהו, הן נורא משעממות ובתיה עצמה לא באמת תורמת להבנה של הסטודנטים.\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: כמתרגל בר באמת מדהים. הוא מסביר נהדר ומאוד מחובר לסטודנטים. הוא יודע לתקוף טוב בדיוק את הנקודות שקשה להבין בחומר. בלי קשר לזה, הוא ממש נחמד ומתחשב, ויש אצלו אווירה מעולה בתרגולים. זה מאוד מוסיף שהוא פשוט זוכר את השמות של כולם אחרי שבועיים, הוא תותח.\n\nשעורי הבית: חופרים ברמות ומתישים ברמות. עם זאת, דורש השקעה כי הם סה\"כ 40 אחוז מהציון אז צריך לתת להם את הזמן שלהם.\n\nהמבחן: הבדיקה ממש מפרגנת, ולמבחן עצמו מספיקים כמה ימי למידה. גם אם אתם לא פותרים הכל נכון, סיכוי לא רע שתוציאו ציון טוב בסוף, וגם אם לא, הוא רק 60%.\n\nהשורה התחתונה: קורס נורא משעמם מבחינת החומר, שהחשיבות שלו מוטלת בספק. רובו תיאוריה משמימה של מסדי נתונים שלא באמת עושים משהו בשביל לקשר אותם לפרקטיקה, רק החלקים הפרקטיים שלו של SQL וDjango מועילים למשהו, אבל הם רק שבועיים וחצי מתוך 13. קורס חובה אז אין מה לעשות :(.", "timestamp": 1677161180149}, {"author": "אינדקס לא מקובץ", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: לא התחברתי. שעתיים שבהן היא בעיקר מקריאה ומתרגמת את מה שכתוב במצגות שלה. כשמישהו שואל אותה שאלה, היא לרוב לא באמת עונה על מה שהוא שאל, אלא בעיקר חוזרת על דברים שהיא כבר אמרה. אמנם היא לא מגמגמת ומונוטונית, אבל מרגיש שאין הרבה ערך להסברים שלה, ועיקר הלמידה שלי נעשתה בתרגולים.\n\nשם המתרגל/ת: בר גנוסר.\nחוות דעת - תרגולים: בהמשך לכל מה שאמרו על בר, הוא באמת תותח (ויפה שהוא זוכר את השמות של כולם). עם זאת, בתור זה שבפועל מנהל את הקורס, אני חושב שהוא קצת מפריז בדרישות מהסטודנטים, בעיקר בקטע של לראות אקסטרה הקלטות ולהשלים אקסטרה חומר בנוסף לתרגולים ולהרצאות. עדיין הוא מתרגל מעולה, לכו אליו.\n\nשעורי הבית: יש חלקים טובים יותר או פחות. באופן אישי התחברתי רק לחלקים של SQL ושל Django (אם אתם שואלים אותי, הם גם הדבר הטוב היחיד שהקורס מלמד). כל השאר חופר ומאוד משעמם, אבל חייבים להשקיע כי זה 40% מהציון הסופי. ממליץ לדחות את זה כמה שפחות, לקראת סוף סמסטר זה מאוד מכביד.\n\nהמבחן: אם להיות כנה כשלמדתי למבחן הרגשתי ממש לא על החומר, למרות שלא היו לי פערים בסמסטר. בכל זאת אחרי כמה ימים של התכוננות כשניגשתי הלך לי טוב יותר משציפיתי ובהרבה. הטיפ שלי - הרבה אצלנו לא סיימו את הבחינה כי היא מאוד ארוכה, אני החלטתי שאני מסיים את כל השאלות גם במחיר של לא לפתור הכל פרפקט וזה השתלם. הבדיקה לדעתי די מקלה בקטעים האלה, ככה שתתעדפו כמות על איכות ותעבדו על זמנים, כי הבחינות באמת די ארוכות אבל לגמרי אפשר להצליח.\n\nהשורה התחתונה: הקורס היה סביר סה\"כ. החלק של SQL באמת מאוד רלוונטי להמשך לדעתי וגם היה אחלה, כנ\"ל Django. כל השאר, ובמיוחד החלקים התיאורטיים של הקורס, לא מעניינים בכלל, לא מרגישים רלוונטיים לכלום וגם לא נעשה שום ניסיון להראות איך משתמשים בהם באופן פרקטי, סתם מלא לוגיקה מונפצת שלא מסובכת יותר מדי אבל גם לא מעניינת בשיט. היה נחמד אם הקורס היה לוקח כיוון יותר פרקטי.", "timestamp": 1677189255282}, {"author": "SR", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: מזעזע, קוראת ממצגות בעלות 100 שקופיות חומר שהוא כנראה מיותר, אחרי 3 הרצאות אף אחד לא הגיע יותר במיוחד שרוב החומר מועבר בתרגולים. נדמה שממש לא מעניין אותה ללמד במיוחד שהמתרגל בר לוקח על עצמו את הקורס הזה כולל המבחן\n\nשם המתרגל/ת: בר גינוסר\nחוות דעת - תרגולים: הרוב ממש ממליצים עליו, קחו בחשבון שהוא מדבר ממש מהר רץ עם החומר כי הוא מלמד גם את החומר של ההרצאות כי אף אחד לא באמת הולך אליהן. בעקרון הוא מסביר ברמה ממש גבוהה ככה שלפעמים צריך לנסות לפשט לעצמך את החומר, היו תרגולים שלו שראינו 2/3 לקראת המבחן. מה שכן הוא כריזמטי וכיף לשבת בהרצאה שלו אתה לא מרגיש שאתה נרדם.\n\nשעורי הבית: יש פרויקט חלק א וב ו4 מטלות קורס מאוד עמוס מבחינת מטלות מצד שני הן יוצאות 40% מהציון הסופי\n\nהמבחן: פשוט לא פייר, שעתיים וחצי ועמוס ממש, בסמסטר שלנו הוסיפו עוד קטע למבחן שאלת דיגאנגו בקטע של הSQL. איזה שני אנשים סיימו את המבחן ולא נתנו פקטור. ממש אכזו אותנו.\n\nהשורה התחתונה: חומר הקורס חשוב לפרקטיקה תשקיעו בו לאורך הסמסטר מה שכן לא יהיה לכם ברירה כי יש מלא מטלות.", "timestamp": 1677614609748}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: משעמם, חצי מהכיתה יוצאת באמצע, אי אפשר לעקוב, גם המצגות משעממות ולא קריאות. הפסקתי ללכת להרצאות די מהר, אפשר ללמוד את החומר הזה לבד לקראת המבחן או לראות הקלטות משנים קודמות.\n\nשם המתרגל/ת: עומר שובי\nחוות דעת - תרגולים: מסביר מעולה, רגוע, ברור וקשוב לסטודנטים מתרגל מעולה!\n\nשעורי הבית: השיעורי בית לוקחים זמן! בעיקר הפרוייקט והתרגילים התכנותיים, מומלץ להתחיל ישר כשהם יוצאים וללכת לשעות קבלה של המתרגלים.\n\nהמבחן: נורא, המבחן עצמו לא קשה מידי אבל הוא בנוי ל4 שעות וניתן רק לשעתיים וחצי. אף אחד לא סיים ולא היה פקטור. ממוצע המבחן היה די נמוך, אומנם הוא רק 60% והפרוייקט בדרך כלל מעלה אבל פשוט חבל שזה בנוי כך.\n\nהשורה התחתונה: קורס חשוב לעתיד, מלמד המון וגם מעניין ופרקטי (לפחות החלק שמועבר בתרגולים ;) )", "timestamp": 1677674493636}, {"author": ":)", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: בתכלס מסתפקת בלתרגם את המצגות (הגרועות ממש) שלה שמוקרנות על הלוח. כמישהו שואל אותה שאלות, היא יכולה לענות לו תשובות לא קשורות בכלל או לחזור על מה שהוא שאל אותה ולקרוא לזה \"תשובה מספקת\". אני באמת לא חושב שלומדים משהו בהרצאות, ולא נראלי שרואים בהן משהו שלא רואים בתרגולים אז הן ממש מיותרות.\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: מצד אחד בר כמתרגל מעולה. ההסברים שלו קולעים בול, והוא בתכלס זה שמלמד את החומר ומטמיע אותו, והוא עושה את זה באמת מעולה. מצד שני בר הוא גם בתכלס האחראי בפועל של הקורס וזה שמארגן ומנהל הכל, ובזה יש לי הרבה ביקורת עליו, בעיקר בקטע של לזרוק על הסטודנטים אקסטרה דברים לעשות במהלך הסמסטר שלא בScope של הנק\"ז כמו עוד הקלטות וכיתות הפוכות ומה לא. לי אישית הרגיש כמו זלזול בעומס שלנו.\n\nשעורי הבית: בזוגות, משלבים בין יבש לרטוב. סה\"כ 40% (מתחלק בין מגן לתקף) מהציון אז הם כן חשובים. הבדיקה עליהם לוקחת שנים וקיבלנו ציונים לדברים גם הרבה אחרי סוף מועדי א'. לא ברור לי למה מקצים לקורס כזה בודק תרגילים אחד, זה ממש לא בסדר.\n\nהמבחן: צריך לבוא למבחן הזה עם טקטיקה נכונה. בעולם מתוקן היו נותנים לזה שלוש שעות, בפועל זה רק שעתיים וחצי. במקום לנסות לפתור הכי טוב שאתם יכולים, לדעתי נכון יותר לנסות לפתור כמה שיותר ולחפף  בהסברים איפה שזה לא הכי קריטי. המון אצלנו לא סיימו את המבחן פשוט מחוסר הספק. בר כל הזמן מפמפם בתרגולים שחבל לא להוסיף הסברים כי אז מאבדים נקודה או שתיים מהשאלה, אבל עזבו אתכם מהחרטא הזאת, הבדיקה שלהם מקלה ממש והיו פתרונות שכתבתי במבחן ואני אישית הייתי מוריד לעצמי הרבה וקיבלו הרבה נקודות. \n\nהשורה התחתונה: מאוד לא מסכים עם כל מי שכותב שהקורס פרקטי ומלמד דברים חשובים. צריך לצאת מהקורס הזה רק עם דבר אחד והוא ידע בSQL (ואולי גם Django). כל שאר הנושאים לא רלוונטים לדעתי לכמעט כלום ולא תורמים לכלום, למעט אם אתם רוצים להמשיך במחקר של מסדי נתונים או דברים כאלה. סה\"כ נע בין סביר למעיק, אבל אפשרי לצאת עם ציון טוב אם משקיעים.", "timestamp": 1678567188320}, {"author": "חחחחח", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: לא ללכת, חבל על הזמן\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: רבות נאמר על בר. משקיע ללא ספק. אני למדתי את הקורס אך ורק בעזרתו ובעזרת הסיכום של ירין בן שטרית (נמצא בדרייב הפקולטי). על התרגולים של ג'נגו אפשר לדלג כי בר לא ככ מלמד את הנושא טוב ואז לקראת הפרוייקט כולם לומדי הכל לבד מהיוטיוב גם ככה.\n\nשעורי הבית: שווים השקעה ושוקלים 40% מהציון הסופי. בסוף כל מה שלמדנו מהשב הופיע במבחן\n\nהמבחן: קצר מאוד בזמן אז צריך להיות מאוד חדים ומהירים ולכן באמת מומלץ להשקיע בשב כדי לא להיות בהלם בתקופת מבחנים.\n\nהשורה התחתונה: באמת שאל תלכו להרצאות. יש הרבה תוכן קצת מיותר בקורס אבל למזלנו לא מעמיקים פה בכלום אז הכל נשאר ברמה יחסית בסיסית. לא להתפתות לרפרנס שיעורי בית.", "timestamp": 1678716772773}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: \nיש כאלה שממש אוהבים את בתיה ויש כאלה שממש לא. היא מרצה בסדר, אבל היא נוגעת בהרבה מאוד חומר תיאורטי שבדרך כלל לא רלוונטי. בנוסף לכך ההרצאות שלה דיי משעממות, ולפעמים כדאי להשלים בהקלטות או לא ללכת.\n\nשם המתרגל/ת: בר גנוסר\nחוות דעת - תרגולים: \nכמו שכולם כותבים, בר הוא מתרגל מצוין. מאוד אכפת לו מהסטודנטים, והא משתדל לדעת את השמות של כולם בשביל להכיר אותם טוב יותר. בנוסף הוא מעביר את החומר בצורה מאוד טובה, ולדעתי אפשר כבר באמצע הסמסר ללכת רק אליו ולהיות בסדר.\nשעורי הבית: \nפרויקט שמחולק ל-2 ו-4 גליונות יבשים. הם דורשים עבודה, אבל בעיקר כי לומדים שם דברים חדשים כמו Django ו-SQL.\nהמבחן: \nלחוץ מאוד בזמן. אצלינו במועד א רוב הניגשים לא סיימו את המבחן בזמן, אז כדאי לשים לב לזה שמתכוננים. יש חומר פתוח. \nהשורה התחתונה: \nקורס חשוב מאוד לדעתי, מלמד אותך את הבסיס של SQL, וקצת BACKEND עם  DJANGO.", "timestamp": 1679227867262}, {"author": "adir blajwas", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: ראיתי הכל מוקלט אבל ההרצאות באופן כללי לא כל כך נחוצות לקורס. התרגולים של בר הם מספקים בעיני. בכל מקרה היא לא מסבירה טוב את החומר בהרצאות\n\nשם המתרגל/ת: בר גינוסר\nחוות דעת - תרגולים: מתרגל מצוין ומנהל את הקורס עונה על כל שאלה וההקלטות שלו ברורות.  \n\nשעורי הבית: \nיש כמה תרגילים יבשים שהם מגן . הם לא ארוכים מדי בסביבות 4 תרגילים. ויש שני פרויקטים של תכנות שלוקחים המון זמן \nהמבחן: \nלא קשה במיוחד מבחינת הבנה אבל ארוך מאוד וקשה להספיק את הכל. \nהשורה התחתונה: \nקורס שאמור להיות רלוונטי אני חשבתי שהוא נורא משעמם ונלמדים בהם דברים מיותרים לחלוטין.", "timestamp": 1679561341114}, {"author": "סטודנט מיואש", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: משעממת \n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים:  מתרגל טוב\n\nשעורי הבית: עמוסים מאוד\n\nהמבחן: מזעזע, ביקשו מהם להוריד ממוצע אז מבחן של 4 שעות הפך להיות שעתיים. \n\nהשורה התחתונה: קורס חשוב, סגל לא מתחשב", "timestamp": 1679590310084}, {"author": "אנונימוס", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בתיה\nחוות דעת - הרצאות: \nכל המצגות באנגלית, לי היה הרבה יותר נוח לסכם לבד במקום לכתוב על המצגות כי יש מצגות ארוכות מידי. כן הרגשתי שזה הועיל לי לבוא להרצאות אבל היא לא הכי רגילה בלעמוד על במה וזה הורגש. בנושא האחרון של חישוב סיבוכיות היה קצת קשה להבין אבל יש תרגול\n\nשם המתרגל/ת: בר \nחוות דעת - תרגולים: \nמתרגל טוב, יכול לקפוץ בין נושאים ברגע שנזכר במשהו אבל מסביר טוב ונותן המחשות טובות\n\nשעורי הבית: \nתלוי הגשה, הם סבבה אבל דורשים זמן לרוב. בפרויקט החלק של הDjango אותי בלבל והתיש אז פשוט לבוא לשעות קבלה ברגע שמשהו לא עובד או לדבר עם מישהו שמכיר כי יש דברים בתרגולים שבלבלו לגמרי\n\nהמבחן: \nתחרות נגד הזמן, ממש ממליצה להתחיל מהנושאים שהכי יושבים על הההתחלה ולהתחיל מהדברים הקטנים, את הERD ממליצה לשמור לסוף כי לרוב הסיפור לא משפיע על השאול המשך וזה פשוט סיפור של עמוד וחבל לקרוא את כולו ולהתקע עליו.\n\nהשורה התחתונה: \nקורס מעניין אבל יקח חלק לא קטן בכלל מהסמסטר. למבחן לעבוד על עמידה בזמנים כמה שיותר", "timestamp": 1681635962587}, {"author": "None", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: בתיה, אביגדור גל\nחוות דעת - הרצאות: \nלא הלכתי להרצאות, ראיתי את ההקלטות של גל אביגדור. הוא מסביר את החומר בצורה מאוד ברורה! \nשם המתרגל/ת: עומר שובי\nחוות דעת - תרגולים: \nמתרגל מצוין. מאוד נהנתי בתרגולים שלו. רוב האנשים הלכו לתרגולים של בר, ככה שבדרך כלל בתרגולים של עומר היו רק 5-10 אנשים. הוא עשה תרגולים פעילים. כלומר פתר את רוב השאלות על הלוח יחד עם הסטודנטים. זה מאוד עזר להבנת החומר. הוא ידע את השמות של רוב הסטודנטים שהגיעו לתרגולים שלו. מאוד עודד שאלות והיה מאוד מסודר. \nשעורי הבית: \nהיו 2 תרגילי בית יבשים, 2 רטובים ופרוייקט ב2 חלקים. התרגילים היבשים היו מאוד קלים. הרטובים היו טיפה יותר מאתגרים, אבל לא מאוד קשים. לדעתי תרגיל בית 3 על Django היה מאוד מעניין ומאוד עזר בפרוייקט. פרוייקט היה נחמד, לא לקח יותר מידי זמן. \nהמבחן: \nרוב האנשים אמרו שהמבחן היה יותר קשה מהמבחנים בשנים הקודמות. אני אישית הרגשתי שהוא היה פחות או יותר באותה הרמה. המבחן מאוד עמוס. היה מאוד קשה לסיים אותו בזמן. אני החלטתי לא להתעכב על ההסברים והצלחתי לסיים. בבדיקה בדקו רק את ההבנה של החומר, לא הורידו הרבה ניקוד על אי-דיוק וחוסר נימוקים.\nהשורה התחתונה: \nקורס מאוד חשוב ומעניין", "timestamp": 1681638353504}, {"author": "נסיכת האופל", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: \nסה\"כ מרצה טוב, אולי טיפונת מונוטוני בדרך ההסבר שלו, אני אישית אוהבת יותר רגש ודרך הסבר יותר מעניינת אבל ווייבים, אין תונות חוץ מזה. \n\nשם המתרגל/ת: בר המלך\nחוות דעת - תרגולים: \nהייתי רוצה שהוא יתרגל כל קורס שיש לי, זוכר את שמות **כל** הסטודנטים שאי פעם הייתה לו אנטראקציה איתם, מה שגרם לי להרגיש יותר בנוח להשתתף, לשאול ולהגיע לשעות קבלה.\n יודע את החומר מעולה, עשה את הקורס, החומר שלו, התרגילי בית, המצגות והכל הרבה יותר מסודר ומעניין.\nנסיכת האופל מאשרת.\n\nשעורי הבית: \nתרגילי הבית שהם לא פרויקטים הם סבבה סה\"כ.\nהפרויקטים ארוכים אבל חשובים, במיוחד פרויקט חלק א.\nשונאת Django ו-HTML אז לא התחברתי לפרויקט חלק ב, אבל כמו שאני תמיד אומרת: \"לא מתחברים להכל בחיים אז הכל בסדר\".\n\nהמבחן: שאלות 1-3 סבבה לגמרי, שאלת האופטימיזציה הייתה וחבל שכך, שאלת הDesign Theory הכי קשה מבין כל המבחנים שראיתי וחלוקת נקודות בין הסעיפים מזעזעת, ניסוח השאלה היה יותר מזעזע מהכתב של אורן בהסתברות.\n\nהשורה התחתונה: מעניין. מלהיב. נחמד.\nנסיכת האופל אומרת תקחו.", "timestamp": 1715598513829}, {"author": "וואי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: \nלא הלכתי, קראתי רשימות והם היו קריאות\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \nלא קראתי גם \nשעורי הבית: \nשיעורי הבית הם הכנה טובה, לא שווה הקרבה אך כדי ללמוד דרכם\nהמבחן: \nלא עשיתי מועד א בגלל איראן ומועד ב היה קשה ממש\nהשורה התחתונה: \nאל תתנו לאיראן לתקוף יום לפני המבחן שלכם", "timestamp": 1716233547801}, {"author": "ללללי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: דווקא התחברתי, הוא לא הכי מרגש אבל החומר מעניין \n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: די מהיר, פחות היה לי קל לעקוב אחריו והרבה מהתרגולים חזרתי שוב אחר כך במוקלט. התרגולים מאוד חשובים אבל כי מראים טריקים שמשתמשים גם במבחן וגם בש.ב\n\nשעורי הבית: קשים דורשים השקעה ומחשבה אבל הם הכנה מעולה למבחן. השקעתי מלא בפרויקט וקיבלתי ציון לא משהו בסוף לא היה שווה את זה יותר מידי. \n\nהמבחן: יחסית קל יותר משנים שעברות וגם בדקו אותו באופן די הוגן.\n\nהשורה התחתונה: קורס מעניין וחשוב.", "timestamp": 1716987173727}, {"author": "רז אמזלג", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: \nמעביר את החומר בצורה הכי משעממת שיש, מתנשא ושחצן\nשם המתרגל/ת: קורל\nחוות דעת - תרגולים: \nאחרי שהתחלתי אצל בר ונגיד בצורה נעימה שלא התחברתי בכלל עברתי לקורל, הנקודת אור היחידה שהייתה לי בקורס הזה\nשעורי הבית: \nסבירים ורלוונטים לחומר הנלמד\nהמבחן: \nגם היה בסדר\nהשורה התחתונה: \nקורס פרקטי שמעניין שמנוהל בצורה מזוויעה על ידי מרצה ומתרגל אחראי עם אפס יחסי אנוש", "timestamp": 1718562179996}, {"author": "הוכחה פורמלית", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: גל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים: סוציאופט. אבל אין מה לעשות אי אפשר להחליף מתרגל בגלל המערכת\n\nשעורי הבית: זוועה. פרויקט חמוד\n\nהמבחן: לא משהו, הזמן מהווה אינדיקטור.\n\nהשורה התחתונה: תקחו את הקורס כשבר לא מתרגל אחראי", "timestamp": 1718902823423}]}