{"posts": [{"author": "י.ח.", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ירון חושקובר\nחוות דעת - הרצאות: הרצאות די משעממות\n\nשעורי הבית: בערך חצי שעה-שעה כל אחד, יש רפרנסים אבל הוא מחליף מספרים כל פעם\n\nהמבחן: דומה למבחנים ישנים והוא לא מפרסם את הטופס אז אי אפשר לדעת מה היה שנים קודמות, רוב המבחן היה לקוח ממבחנים מהדרייב עם שינויים קלים. היה צריך דוח רווח והפסד\n\nהשורה התחתונה: מספיק לעבור הרבה על הסיכום בסוף סמסטר ולפתור את המבחנים מהדרייב", "timestamp": 1658833771329}, {"author": "סמסטר אביב 2022", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ירון חושקובר\nחוות דעת - הרצאות: משעממות מאוד! עד כדי כך שקשה לשמור על ריכוז אבל כן יש הקלטות. מרצה גרוע!\n\nשעורי הבית: הרוב בסדר כי יש רפרנסים אבל לא להכל.\n\nהמבחן: לא הוגן. מזכיר בחלקו מבחנים משנים קודמות אבל עם טריקים חדשים שלא ראינו. היה גם חלק של הגדרות של מונחים שהיינו צריכים לזכור בעל פה (מליון מונחים מכל הסמסטר). גם היה צריך לנתח דוח כספי ביחידים של חברה מסוימת לבחירתנו. כמעט ולא נתן הנחיות ולא היה מוכן להסביר מה עלינו לעשות מעבר ל3 משפטים שהיו בהנחיות. העבודה דרשה השקעה מאוד גדולה וניתוח מאוד מעמיק ובסופו של דבר נתן לכולם 100. זה נתן תחושה שהזמן שלנו לא רלוונטי עבורו. בעיני זה ממש לא מכבד.\n\nהשורה התחתונה: אם אתם אוהבים את התחום, תיקחו קורס עם מרצה אחר. ואם אתם לא מתחברים לתחום, להתרחק!", "timestamp": 1689252662027}, {"author": "סטודנטית ממוצעת", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ירון חושוקובר\nחוות דעת - הרצאות: מדבר בצורה מונוטונית וממש קשה לעקוב אחרי מה שהוא אומר. אם שאלת משהו בהרצאה על הרצאה קודמת תצפה לתשובה של \"דיברתי על זה כבר ואני לא חוזר, תסתכל בהרצאה\". לא ניכר שאכפת לו מהסטודנטים. פרסם סיכום הרצאות מראש אבל בדברים החשובים הוא בכותרות ואת השאר הוא מוסיף במהלך ההרצאה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: סבירים, אם מקשיבים לכל מה שהוא אומר בהרצאה אפשר לעשות אותם גם בלי רפרנס. יש פרויקט של ניתוח דוח כספי. כשביקשנו הוראות ואיך הוא צריך להיראות קיבלנו 3 שורות מאוד מצומצמות ולא מובנות. בסוף כולם קיבלו 100..\n\nהמבחן: המבחן...אווו המבחן..אין שאלות לתרגל, אין מבחנים קודמים. שאלנו את ירון איך ללמוד והוא אמר \"מי שיודע לפתור את תרגילי הבית מוכן למבחן\".בפועל המבחן בגדול יצא מנקודת הנחה שמי שפותר אותו הוא רואה חשבון עם 10 שנות ניסיון..\n\nהשורה התחתונה:", "timestamp": 1690285835985}, {"author": "-", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ירון חושקובר\nחוות דעת - הרצאות: משעממות ברמה לא סבירה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: יש רפרנסים, קלים וקצרים. אבל הרפרנסים לא מפורטים ולכן אם לא הבנת למה זה ככה- באסה לך.\nחוץ מזה יש פרוייקט שאתה קורע את התחת עליו ובסוף מגלה שנותנים לכולם 100- מסקנה- אל תתאמצו.\n\nהמבחן: מזעזע. לא הוגן, היו שם דברים שלא למדנו בוודאות. מבחן שבוחן את הבנת הנקרא, חצי מהמבחן אתה מנסה להבין מה רצו ממך בשאלות, הניסוחים לא ברורים בכלל.\nהרמת שאלות פי אלף יותר קשה מהתרגילי בית. מבחן שנועד להקשות סתם מעבר למה שצריך. פשוט מעצבן. ואין מבחני עבר ללמוד מהם, אלא רק שאלות שעוברות מדור לדור ורובן בלי פתרון ולא עוזרות.\n\nהשורה התחתונה: ירון מרצה נוראי. בהתחלה פתח קבוצת וואטסאפ איתנו אז היה נראה שאכפת לו- ממש לא. לא עונה למיילים, מגזים במבחן, לא נותן אינפורמציה על מה יהיה במבחן, לא עונה ברור על שאלות, נתן תרגיל בית לתקופת מבחנים!! ועם יכולת התנסחות של ילד בן 7. פשוט היה סיוט.", "timestamp": 1690322708668}, {"author": "סטודנטית ממוצעת", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ירון\nחוות דעת - הרצאות: \nמאוד מאוד מבולגנות, מקצוע שצריך לדעת איך ללמד, במיוחד לאנשים שבאים בלי רקע...\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש רפרנסים, לא מועילים יותר מדיי\nהמבחן: \nקשה, ולא בגלל החומר אלא בגלל שאין מספיק חומר ממנו אפשר ללמוד, לתרגל.... זה חומר שדורש המון המון תרגול, חבל שהוא לא מנוהל כמו שצריך.\nהשורה התחתונה: אם הקורס היה מנוהל כמו שצריך הייתי ממש ממליצה ללמוד אותו, זה חומר שכל אחד צריך לדעת או לפחות להכיר. החומר מועבר בצורה לא ברורה מבולגנת בלי שום אפשרות לתרגל על מנת להבין.. ירון לא נחמד במיוחד, נראה שהכריחו אותו להיות שם.. מה גם שיש פרוייקט של 10% שסתם נועד לבזבז את הזמן, מה גם שכולם מקבלים 100 אף אחד לא בודק לכם אותו.", "timestamp": 1695907142023}]}