{"posts": [{"author": "סטודנט 2021", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ד\"ר חובב פרץ\nחוות דעת - הרצאות: \nמרצה גרוע, אולי הכי גרוע שהיה לי בתואר. נראה שהוא השלים עם העובדה שסטודנטים פשוט קונים STUDIES ובמקום להשתפר פשוט זורם עם זה. מציע לא ללכת להרצאות או תרגולים בכלל, פשוט תקנו STUDIES. אם לא חייבים לעשות את הקורס מציע להמנע.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  אין\n\nהמבחן:  יש מבחנים קשים יותר וקשים פחות. המרצה לא משתף היסטוגרמה אם הממוצע ממש נמוך, כנראה כדי למשוך סטודנטים לקורס.\n\nהשורה התחתונה:  אם לא חייבים לא לגשת, ואם נגשים אז לקנות STUDIES.", "timestamp": 1628159418202}, {"author": "---", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: \nהרצאות סבירות, כמו כל קורס של חובב - הוא מלמד לפתור את השאלות שיש במבחן.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: מבחן רגיל של חובב, מלא טריקים אבל אם מתכוננים כמו שהוא רוצה אפשר לקבל אחלה ציון\n\nהשורה התחתונה: קורס רגיל של חובב, אם יודעים מה הטריקים מקבלים אחלה ציון אבל לא לומדים כלכלה", "timestamp": 1629704857662}, {"author": "שרון סגל", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: \n\nאין תרגולים, יש שעות קבלה שבועיות עם חובב על סמך תרגילים שהוא נותן וזה מעולה!\n\nש.ב: תרגילים שהם בגדר המלצה, ומאוד מומלץ לעקוב ולפתור\n\nהמבחן: אמריקאי 7 שאלות וסה''כ 17 סעיפים. פיר, מי שיודע את החומר יכול להוציא ציון מצוין\n\nהשורה התחתונה: קורס מומלץ אם אתם מתכוונים להיות \"על החומר\", חובב מרצה מעולה", "timestamp": 1629886140308}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: שיטת לימוד מצוינת שחבל שלא מיושמת בשאר הקורסים בטכניון. כל ההרצאות מועברות בזום ומוקלטות ובמקום תרגולים יש שעות קבלה בהן חובב פותר תרגילים ממבחנים. הקורס עצמו מתמקד יותר בהיבט המתמטי של התיאוריה הכלכלית ופחות בהיבטים פרקטיים\n\nשעורי הבית: אין\n\nהמבחן: חומר פתוח, דומה מאוד למבחני עבר", "timestamp": 1657654256880}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: קלאסי חובב, מלמד איך לפתור את המבחן, מקליט את כל ההרצאות וכל השעות קבלה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: לא היו\n\nשעורי הבית: אין, יש תרגילים שהוא נותן ופותר בשעת קבלה\n\nהמבחן: אמריקאי, ברובו טכני אבל לא פשוט. יותר קשה מעקרונות הכלכלה. \n\nהשורה התחתונה: אני לא התחברתי, לא מומלץ בתור קורס בחירה.", "timestamp": 1658759382158}, {"author": "מיקרו חלחלה 1", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: אני בן אדם פשוט. אני רואה את חובב מלמד קורס, אני לוקח את הקורס. גם אם חובב היה מלמד קורס על גידול דשא הייתי לוקח את זה. הכל מוקלט.\n\nשם המתרגל/ת: אין תרגולים (למרות שרשום במערכת שיש). במקום זה יש את הנוהג הרגיל של חובב - שעות קבלה שבהם פותרים את תרגילי הבית. חשובים מאוד.\n\nשעורי הבית: דורשים קצת יותר השקעה מעקרונות החלחלה אבל לא משהו נורא. \n\nהמבחן: למרות שמבחינת מורכבות החומר מיקרו הוא קורס יותר קשה מעקרונות, המבחן של מיקרו הרגיש לי הרבה יותר הוגן, במובן הזה שהוא פחות מנסה להכשיל אותך עם טריקים קטנוניים. הרמה גם די נשארה זהה בשנים האחרונות בניגוד לעקרונות. \n\nהשורה התחתונה: אחלה קורס סך הכל. הרבה יותר מעניין מעקרונות, דורש השקעה אבל בהחלט ניתן להוציא ציון טוב. נתראה במיקרו חלחלה 2.", "timestamp": 1689502567415}, {"author": "***", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: \nההרצאות בסדר גמור, חובב מסביר את החומר כמו בכל הקורסים שלו, יש ש\"ב לא חובה שהוא פותר בשעות קבלה . \n\nהמבחן: \nהקורסים של חובב כבר לא בדיחה כמו שהם היו, צריך ללמוד הרבה בשביל להצליח. למדתי שבוע וחצי באינטניסיביות ועדיין במבחן לא קיבלתי ציון כל כך טוב, למרות שהשקעתי בפתרונות של השעות קבלה וגם סיכמתי את כל ההרצאות במהלך הסמסטר. כל פעם עושה טריקים חדשים לגמרי במבחן.\n\nהשורה התחתונה: \nזה קורס אחלה אם רוצים נק\"ז שישלים לכם את התואר בלי יותר מידי השקעה במהלך הסמסטר (אין חובת הגעה/שב להגשה) אבל כן צריך ללמוד הרבה מאוד למבחן.", "timestamp": 1704611327747}]}