{"posts": [{"author": "תתת", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מחמוד קעאדן\nחוות דעת - הרצאות: הרצאות מעניינות ממש\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מומלץ מאוד!", "timestamp": 1634476497348}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מחמוד קאעדן\nחוות דעת - הרצאות: ההרצאות מבולגנות, ולמרות שיש סיכומים טובים של המרצה לכל אחת מההרצאות הוא לא עוקב אחריהם לפי הסדר וזה יכול להיות מבלבל.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש שיעורי בית כמעט כל שבוע, הם לא בהכרח קלים והרבה פעמים יש שם דברים שלא בהכרח ראינו בהרצאות. אבל- מספיק שמגישים משהו מספיק טוב (לא בהכרח הכל צריך להיות נכון), מקבלים 100 על ההגשה\n\nהמבחן: קשה. 21 שאלות אמריקאיות, הרבה מהן מבלבלות, והציונים לא גבוהים במיוחד\n\nהשורה התחתונה:", "timestamp": 1647174645049}, {"author": "סטודנט ממורמר", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מחמוד קעדאן\nחוות דעת - הרצאות: יש הקלטות אבל גם בכיתה ממש סבבה. המרצה מעולה בעיניי, ההרצאות מעניינות והיה לי כיף להגיע\n\nשם המתרגל/ת: רונן\nחוות דעת - תרגולים: \nלא הכרחיים אבל נחמד להגיע\nשעורי הבית: לא קשים, ממליץ לעשות כדי להיות \"על\" החומר במהלך המבחן\nהמבחן: \nלא קשה ויש שיגידו שאף קל. ממליץ לתרגל כמו שצריך מבחנים ולבוא מסונכרן עם חומר פתוח (אפשר לבוא גם רק עם חוברת הרצאות מודפסות).\nהשורה התחתונה: \nמומלץ מומלץ מומלץ מומלץ מומלץ מומלץ", "timestamp": 1648926310921}, {"author": "May", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "מבחן חצי מרופרנס עם חומר פתוח\nאין תלונות", "timestamp": 1649683772531}, {"author": "סוחר בשוק אבל חסר הון", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מחמוד קעדאן\nחוות דעת - הרצאות: מרצה טוב, שמביא דוגמאות (המון) מאתרים פיננסיים מהארץ ומכל העולם. יש הרצאות עמוסות, עם הרבה חומר להספיק, ויש כאלו שיותר זורמות.\n\nשם המתרגל/ת: רונן.\nחוות דעת - תרגולים: פותרים רק את שיעור הבית, ואין חומר לתרגולים. יחסית מבאס, כי בקורס שלא מפרסמים מבחני עבר כל טיפת תרגול ושאלות יכולה לעזור, ובמקרה הזה אין חומר לתרגולים.\n\nשעורי הבית: לא קשים, כן ממוחזרים ויש רפרנסים להכל.\nהגליונות הראשונים תיאורטיים וחופרים יחסית. הגליונות שאחריהם יותר חישוביים, ומכילים לפעמים כמה שאלות שחוזרות על עצמן, ודורשות לבצע חישובים דומים שוב ושוב.\nשיעורי הבית הם תקף 20 אחוז, והבדיקה הייתה (אמנם לא רשמית) בינארית. מי שהגיש קיבל 100, גם עם התשובות היו שגויות.\n\nהמבחן: מאוד קשה, ביחס למבחנים לדוגמה שפורסמו.\nהיו שאלות מאוד מסובכות שדרשו זמן חישוב והבנה עמוקה, והיו שאלות שנטפלו לדברים הכי קטנים בחומר (כמו כל כמה זמן משנים את הדירוג במדד ת\"א).\nאמנם הבחיה עם חומר פתוח, אבל למצוא את התשובות לשאלות התיאורטיות זה כמו לחפש מחט בערימת שחט, וכמעט ובלתי אפשרי. גם לשנן זה לא אפשרי, כי אלו פרטים ממש שוליים בחומר.\nניתן פקטור של 6 נקודות, בנוסף לזה שהיו 2 שאלות בונוס (סך הכל 22 שאלות אמריקאיות שכל אחת היא 5 נקודות), אבל הממוצע עדיין היה נמוך בקצת משנים קודמות.\n\n\nהשורה התחתונה: הקורס נתן אווירה שאפשר לזרוק עליו יחסית במהלך הסמסטר, וגם אם יושבים טוב על החומר ופותרים את מעט השאלות לתרגול, לא באים מספיק מוכנים למבחן הקשה שהיה.\nלקחת רק אם אתם מתעניינים בניהול פיננסי (אג\"חים ומניות), וגם אז לחשוב טוב אם באמת זה שווה.", "timestamp": 1676037933111}, {"author": "אס אן פי 500", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מחמוד קעדאן\nחוות דעת - הרצאות: \nלא היו הרבה קורסים בטכניון שנהנתי ככה מההרצאות, מחמוד הסביר הכל באופן מובן, בהומור, בגובה העיניים והביא מלא דוגמאות אקטואליות מהעולם שהפכו את הנושאים (גם כאלה שיותר \"חישוביים\") למעניינים.\nבנוסף, כל ההרצאות כתובות בפרטים בPDFים שהוא מפרסם במודל ככה שאפילו אין צורך לכתוב, פשוט לבוא ולהקשיב.\nשם המתרגל/ת: רונן\nחוות דעת - תרגולים: \nאחרי כמה תרגולים (שבהם הוא פותר את שעורי הבית) מבינים שזה בזבוז זמן.\nשעורי הבית: \nתכלס יש רפרנס והם מביאים לכולם 100 על השב גם ככה אבל חשוב לראות שמבינים תוך כדי הקורס כי יש יחסית הרבה נושאים.\nהמבחן: \nהמבחן עם חומר פתוח, הוא היה טיפה יותר קשה מהמבחנים שפורסמו לדוגמה אבל עדיין חצי מהשאלות היו דומות (ואולי אפילו זהות) לשאלות במבחנים שהוא פירסם + שתי שאלות בונוס על סרט וסדרה בנושא מניות שהוא המליץ לראות במהלך הקורס ועוד כמה שאלות שפשוט היה צריך לחפש את התשובה בהרצאות המודפסות. בקיצור, אם אתם די על החומר במהלך הסמסטר ויודעים איפה לחפש, אפשר להוציא ציון יפה.\nהשורה התחתונה: \nאם הנושא מעניין אתכם אפילו טיפה - קורס מומלץ ביותר.", "timestamp": 1677121337772}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: צפיתי בהקלטות של ה4 הרצאות הראשונות, אחרי זה איבדתי את הקורס. למרות זאת למדתי לקראת המבחן במשך שבוע בעזרת קריאת הPDFים של ההרצאות תוך כדי שאני מנסה לפתור בעצמי את הדוגמאות ולבסוף קיבלתי מעל 90. התבקשנו גם לראות סרט וסדרה קטנה בנטפליקס שמאוד נהנתי מהם ויש עליהם שאלות במבחן.\n\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים: לא הייתי\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: ממליץ בחום", "timestamp": 1679566758262}, {"author": "S&P 500", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מחמוד\nחוות דעת - הרצאות: \nראיתי בזום ובמוקלט הרצאות מעניינות רציתי להגיע לכיתה אבל לא התאים הלוז שלי \nשם המתרגל/ת: לא יודעת \nחוות דעת - תרגולים: \nאחרי תרגול 3 הבנו שהתרגולים מיותרים \nשעורי הבית: \nסבבה לא משהו תשקיעו שעה עד למקסימום שעתיים בשבוע והכל טוב\nהמבחן: \nמבחן סביר \nקורס סביר ומחמוד בן אדם מתעניין בחומר ומסביר אותו  בצורה מהממת אהבתי לשמוע את ההרצאות\nהשורה התחתונה:", "timestamp": 1717257111317}]}