{"posts": [{"author": "שרון סגל", "difficultyRank": 3, "generalRank": 2, "semester": "201901", "text": "שם המרצה: רון\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חשובים ופרקטים\n\nשעורי הבית: \n\nהמבחן: מאוד קשה\n\nהשורה התחתונה:", "timestamp": 1597851378180}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רון\nחוות דעת - הרצאות: היו בזום, מסביר בסך הכל בסדר, קצת משעמם, לראות רק מוקלט אין טעם לבוא לייב\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: ברמה הרבה יותר נמוכה מהמבחן\n\nשעורי הבית: 4 גליונות לא קשים במיוחד, בלי ציון רק הגשה\n\nהמבחן: סביר. חוזר על עצמו בסופו של דבר אחרי הרבה מבחנים אותם רעיונות.\n\nהשורה התחתונה: קורס נחמד, נותן ידע פיננסי כללי שכל אחד צריך להכיר", "timestamp": 1613253250157}, {"author": "אל תגידו למיכל פן היי,היא תכיש", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: רון לביא\nמרצה הכי אבל הכי גרוע שתיתקלו בתואר לא יודע ללמד המצגות לא מספיק מלאות בידע וברמה בשביל להכין אותך למבחן,בעבר המומצע בקורס היה ממש גבוה עד שיום אחד הדיקן/מיכל פן הגועלית,ביקשו ממנו להוריד את הממוצע והשפוט הפחדן הסכים להוריד ל70,כשיש לו חופש אקדמי להחליט מה שבא לו (הוא סיפר לנו את זה) .\n\nשם המתרגל/ת: \n יונתן מתרגל מעולה מאוד עוזר ומשקיע !\nהמבחן:קשה פצצות \nהשורה התחתונה: אמן שיחליפו אותו ותלמדו חזק במהלך הסמסטר !!", "timestamp": 1613776566285}, {"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה בצורה ממש מעניינת קורס מאוד משעמם\n\nשם המתרגל/ת: יונתן וגנר\nחוות דעת - תרגולים: בקיא בחומר אך מתרגל בצורה ממש משעממת \n\nשעורי הבית: חובב מפרסם דפי תרגילים ופותר אותם בשעת הקבלה, לא נכנס לציון.\n\nהמבחן: הוגן וברמה שנלמדה, תבניתי כמו שחובב אוהב.\n\nהשורה התחתונה: אם חובב מעביר שוב חובה לקחת את הקורס!! הפך קורס סיוט לקורס מעולה עם ממוצע גבוה", "timestamp": 1645268415737}, {"author": "ללא שם", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה מצויין.\nמעביר הכל בצורה מאוד מסודרת, לפני כל הרצאה מעלה דפי ״שלד״ עם עיקרי הדברים של ההרצאה ככה שאפשר לרשום עליהם או לחכות לסוף ההרצאה והוא מעלה את הדפים עם ההערות שהוא כתב במהלך השיעור.\n\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: עוזרים להבנה של החומר, השאלות בנויות שונה מהשאלות שחובב מנסח.\n\nשעורי הבית: \nלא כל שבוע, ולא להגשה.\nחובב מעלה תרגילים ואחר כך פותר אותם בשעות הקבלה שלו, ומקליט את שעות הקבלה.\nמומלץ לראות את שעות הקבלה, חובב נותן דגשים חשובים לפתרון התרגילים.\n\nהמבחן: \nהוגן מאוד ולא קשה.\nסוג השאלות והמבנה ידועים מראש.\nהמבחן עם חומר פתוח.\n\nהשורה התחתונה: \nקורס לא עמוס ואפשר בקלות להצליח ולקבל ציון גבוה.", "timestamp": 1645602283075}, {"author": "ירדן", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: ההרצאות היו נחמדות ומלמדות. חובב לימד את החומר בצורה ברורה.\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: התרגולים היו טובים אבל אני חושב שהיה אפשר טיפה להאריך אותם (בפועל תמיד היה מעט מדי תרגילים והיינו מסיימים הכל בחצי שעה).\n\nשעורי הבית: לא היה\n\nהמבחן: סביר +\n\nהשורה התחתונה: קורס מעניין ונחמד", "timestamp": 1647850904455}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעניינות, מלמדות ומעשירות את הידע. חשוב להשתתף די להגיע מוכנים למבחן\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין שיעורי בית להגשה, אבל חובב נותן תרגילים לתרגול ופותר אותם בשעת הקבלה השבועית שלו. ממש מומלץ לפתור ולעלות לשעות הקבלה\n\nהמבחן: הוגן ויחסית קליל למי שלמד לאורך הסמסטר. \n\nהשורה התחתונה:", "timestamp": 1647957335091}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: לצערי בניגוד לחוות הדעת הקודמות התאכזבתי מהקורס. חובב כן מרצה מאוד מסודר ומעלה מראש שלד להרצאה כך שמאוד נוח לעקוב אחרי מה שהוא אומר, אבל בעייני הוא היה מאוד מונוטוני ובשלב כלשהו הפסקתי להגיע פרונטלית וצפיתי בהקלטות.\n\nשעורי הבית: אין\n\nהמבחן: סביר\n\nהשורה התחתונה: ציפיתי לקורס מעניין יותר והתאכזבתי... חומר משעמם ולא פשוט בכלל להבנה, במיוחד בסוף.", "timestamp": 1676547908764}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב קלאסי. מעלה מראש שלד הרצאה למודל ואחרי ההרצאה מעלה את כל מה שהוא כתב ומפרסם גם הקלטה של השיעור\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: תרגולים טובים, יודע טוב את החומר ומסביר מעולה\n\nשעורי הבית: אין, הוא מפרסם תרגילים שכדאי לפתור לקראת המבחן והוא פותר אותם בשעות קבלה (וגם שם מקליט ומעלה למודל)\n\nהמבחן: תבנית שמאוד דומה למבחני עבר בקורס - שאלות מאוד דומות למעט שינוי מספרים ואולי קצת שינוי נוסח. מספיק לתרגל 3-4 מבחנים ואפשר להוציא ציון מעולה במבחן\n\nהשורה התחתונה: קורס לא קשה ולא מעמיס, ואפילו מעניין אם הנושאים מדברים אליכם. נק\"ז קל עם ציון גבוה", "timestamp": 1676576785876}, {"author": "ארביטראז", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מלך מה שיש בהרצאות ובשעות קבלה שלו זה המבחן\n\nשם המתרגל/ת: גוני\nחוות דעת - תרגולים: לא צריך ללכת ביזבוז של זמן המבחן לא בתבנית הזאת\n\nשעורי הבית: אין\n\nהמבחן: תבניתי ולא קשה בכלל\n\nהשורה התחתונה:", "timestamp": 1677433799066}, {"author": "אין", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: \nחובב מקליט ו מעלה כל ההרצאות ו שעות הקבלה אז אין על זה אבל לדתי ההרצאות מעניינות אז נוכחתי \nשם המתרגל/ת: אין צורך \nחוות דעת - תרגולים: אבל ברומן אמליץ לכם לצפות בשעת הקבלה קצרות ו מאוד עוזרות \n\nשעורי הבית: אין יש משימות אני ממליצה לעשות אותם אז לא תהיו לחוצים בזמן המבחן\n\nהמבחן:90+ מאוד אפשרי \n\nהשורה התחתונה:", "timestamp": 1677686277763}, {"author": "Nina Kahn", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: חובב משדר בזום וגם מעלה הקלטות שזה אחלה, אבל זה בא על חשבון הסטודנטים שכן רוצים להגיד פרונטלית. לפחות חצי מהשיעורים במהלך הסמסטר הועברו רק בזום וסטודנטים שלא היו בבית היו צריכים להסתדר בדקה 90. סה\"כ, הקורס הועבר בעצלנות.\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: לא רלוונטים כי הם לא תואמים להרצאות. יותר חשוב ללכת לשעות הקבלה של חובב, שם הוא פותר תרגילים בסגנון של המבחן.\n\nשעורי הבית: לא להגשה. יש רק את התרגילים שחובב מעלה פעם בשבועיים וכדאי לנסות אותם לבד לפני שמגיעים לשעת הקבלה.\n\nהמבחן: תבניתי מאוד. אין סיבה ללמוד ממבחנים שהם לא של חובב. חבל שהמבחן בנוי ככה כי זה יוצר מצב שלא לומדים באמת ניהול פיננסי. מספיק 3-4 ימים ללמוד.\n\nהשורה התחתונה: נורא התייאשתי מהקורס.", "timestamp": 1678188930551}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: הוא מקליט שזה נחמד \n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: לא הלכתי ופתרתי בעצמי את התרגילים. בדיעבד גם לפתור את התרגילים לא היה צריך \n\nשעורי הבית: אין (חובב מרפסם 5 תרגילים שהם לא להגשה שזה סתם שאלות ממבחנים שהוא פותר בשעת קבלה מיוחדת לזה)\n\nהמבחן: חומר פתוח, תמיד אותם שאלות שבו הוא משנה את המספרים. הדרך המנצח ללמוד זה פשוט לפתור את המבחנים של חובב רק, להבין טוב את הפתרונות, ולהביא אותם למבחן. זהו\n\nהשורה התחתונה: קורס סביר ולא מרגש לטוב ולרע. ממליץ למי שלא חייב לקחת אם החומר מעניין אותך או יש צורך בו כקדם לשוק ההון", "timestamp": 1678776164009}, {"author": "י.ל", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מאמין בהוראה היברדית ומנגיש את כל החומרים, כדאי לראות את ההרצאות ושעות הקבלה ולא רק לקרוא את החומר\n\nשם המתרגל/ת: יוני מוקלט\nחוות דעת - תרגולים: למרות הדעה הרווחת לדעתי התרגולים תורמים להבנת החומר ועושים סדר בנוסחאות הרלוונטיות\n\nשעורי הבית: אין \n\nהמבחן: מבנה של מבחני עבר עם חומר פתוח\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1714374230325}, {"author": "-", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: גם כאן, כמו בעקרונות הכלכלה, ההרצאות נמרחות בטירוף. מוקלט על 1.75 לגמרי עושה את העבודה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא רלוונטי בשום צורה ולפעמים סתם מבלבל\n\nשעורי הבית: אין שיעורי בית להגשה אלא שאלות לפתור לשעת קבלה של חובב. מאוד מאוד חשוב להבנת החומר כי השאלות באמת ברמת מבחן.\n\nהמבחן: טכני וחזרתי אבל כמובן, גם כאן תמיד יהיה טריק חדש שחובב המציא שיכול להפיל שאלה שלמה.\n\nהשורה התחתונה: יכל להיות קורס טכני ופשוט. הטריקים של חובב כל מבחן מחדש הופכים אותו לבלתי נסבל.", "timestamp": 1715758934522}, {"author": "א", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה:חובב \nחוות דעת - הרצאות: \nכמו כל הקורסים של חובב, הכל מוקלט ואין שיעורי בית \nלראות את כל השעות קבלה וההרצאות הן בעיקר לחבר את כל המושגים \n\nהמבחן: \nאפשר לסיים את המבחן שעה לפני הזמן ולהוציא ציון טוב רק להזהר לא ליפול בהפתעות של חובב. \nהשורה התחתונה: \nקורס קליל עם ממוצע גבוהה", "timestamp": 1717404060323}, {"author": "S", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מעביר הכל גם בזום ומקליט כל הרצאה, שזה טוב תמיד. אני מצאתי את החומר די מעניין (מניות, השקעות וכו') והוא לא מורכב מדי להבנה. \n\nשם המתרגל/ת: יונתן וגנר במוקלט\nחוות דעת - תרגולים: עוזר להבין את החומר טוב אך בסופו של דבר את המבחן צריך לפתור לפי הדרך של חובב, לכן יכול לבלבל. אפשר לוותר. \n\nשעורי הבית: אין. יש אחרי כל שיעור דף משימות רשות- שאלות ממבחני עבר שהוא מציין איזה בדיוק לפתור ואז עושה על זה שעת קבלה בזום ופותר אותן.\n\nהמבחן: בניגוד לקורס אחר של חובב, המבחן הזה הרבה יותר טכני ורובו תקתוקים במחשבון. הרגיש לי שאין הרבה קשר בין החומר בהרצאה, שחלקו כן היה פרקטי ולא רק תיאורטי, למבחן עצמו. צריך לפתור בדיוק בדרך שחובב פותר כל שאלה ואתם מסודרים. מומלץ לראות את השעות קבלה לפני המבחן או תוך כדי הסמסטר כדי להבין את השיטה. חשוב לציין שכל סמסטר הוא מוצא דרך להקשות פה ושם או טריקים נוספים אז כן כדאי להגיע עם הבנה של החומר ולתרגל מבחני עבר. אמריקאי עם מסיח מכשיל של \"יותר מתשובה אחת נכונה/אף תשובה\". \n\nהשורה התחתונה: אחלה קורס, מעט מאוד השקעה במהלכו וציון גבוה. לא כדאי לזלזל בו כי אפשר ליפול בקלות.", "timestamp": 1718881296921}]}