{"posts": [{"author": "Masha Rossisnky", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חובב ואלייקים \nחוות דעת - הרצאות: \nהרצאות מעולות, המרצה מסביר מעולה ומדגים כל דבר\nשם המתרגל/ת: אלייקים \nחוות דעת - תרגולים: \nלא היו תרגולים \nשעורי הבית: \nאין שיעורי בית, ניתנות מטלות לתרגול עצמי ללא צורך בהגשה \nהמבחן: \nבעקבות הקורונה - מבחן בעל פה כל סטודנט נשאל שאלה אחת \nהשורה התחתונה: \nבמידה ומגיעים להרצאות באופן שוטף ומתרגלים הקורס לא מאוד קשה", "timestamp": 1612458759114}, {"author": "א", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חובב פרץ ואליקים\nחוות דעת - הרצאות: חצי קורס נושאים כלליים במאקרו כלכלה(אליקים), חצי סמסטר סודוקו של משתנים כלכליים עם מעט מאוד הבנה כלכלית\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: סמסטר קורונה: מבחן בע\"פ לא מאוד הוגן- הוריד נקודות לפי מספר גמגומים ולא בהכרח לפי ידע. בסמסטר רגיל אמריקאי לא קשה במיוחד.\n\nהשורה התחתונה: קורס סביר שלא מלמד הרבה, אבל ציון לא רע במעט מאוד מאמץ.", "timestamp": 1615218047364}, {"author": "ירדן", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: ההרצאות מעניינות ונחמדות מאוד. תכלס לא חומר עמוס.\n\nשעורי הבית: חובב נותן פעם בשבוע כמה תרגילים לפתור בבית ומקיים עליהם שעת קבלה\n\nהמבחן: היה מבחן בעל פה עם שאלות הרבה יותר קשות מהמבחנים אבל בסוף היה בסדר גמור.\n\nהשורה התחתונה: אחלה קורס, נהניתי.", "timestamp": 1616255385888}, {"author": "סטודנטית עייפה", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: הרצאות טובות, הוא מסביר טוב את החומר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אם זה סמסטר מקוון - לא מומלץ בכלל. המרצה נותן תחושה רעה בין אם הלך טוב ובין אם לא.\n\nהשורה התחתונה:", "timestamp": 1616311133426}, {"author": "שרון סגל", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חובב\nחוות דעת - הרצאות: מעניינות\n\nשעורי הבית: אין\n\nהמבחן: בגלל הקורונה היה בע''פ, מי שלא נכח בהרצאות המבחן אבוד לו", "timestamp": 1616535374216}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: חביבות, לצערי לא מדברים הרבה על כלכלה אלא יותר טכני.\nחצי מההרצאות עם אליקים שממש מיותר ללכת אין למה שהוא אומר שום קשר למבחן וגם לא למציאות.\nהחצי השני לומדים לפתור את המבחן.\n\nשעורי הבית: אין אבל יש תרגילים לא חובה שכדאי לפתור.\n\nהמבחן: אחרי שמבינים את העיקרון קל ואפשר להוציא 100 בקלות.\n\nהשורה התחתונה: אחלה קורס קליל ואחלה ציונים.", "timestamp": 1647611498159}, {"author": "O", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה:  אליקים \nחוות דעת - הרצאות: \nמצגות משעממות באנגלית. אליקים מספר סיפורים על כספומטים בסין ורעידות אדמה בטיזי ולא באמת מלמד את החומר\nמספר סיפורים כללים שדורשים הבנה כלכלית כלשהיא שלדעתי פשוט אי אפשר לרכוש בקורס של 3 שעות בשבוע למשך כמה שבועות. \nבשלב מסוים הפסקתי לצפות בהקלטות ( פרסם)  כי לא הבנתי מילה ולא הצלחתי לעקוב . אולי הוא אדם חכם אבל הוא לא מרצה טוב ולא הצליח להעביר את החומר.\n\nלא היה זמין לשאלות במייל ופשוט סינן שפנינו עם שאלות או בקשה לשעת קבלה. \nששואלים אותו שאלה קונקרטית על החומר הוא מתחיל שוב בסיפורים כללים על כלכלת העולם ופשוט לא עונה על מה ששעלו. \nהקורס שהייתי בו הכי לא על החומר בכל התואר שלי וזה נטו בגללו . \n\nשם המתרגל/ת:  גם אליקים \nחוות דעת - תרגולים:  נורא טכניים. בחלקם היו טעויות אלגבריות שפשוט לא נכונות מתמטית ואליקים לא תיקן. \nבתכלס היו מובנים אבל לא היה שום קשר בין התרגולים לבין המבחן פרט לאולי שאלה אחת באמת.\n\nשעורי הבית:  לא היו\n\nהמבחן: \n20 שאלות אמריקאיות כלליות כמו \" הפרחים נבלו מה קורה לריבית העולמית ולשער הדולר \" . חומר פתוח כולל אפשרות להביא מחשב או אייפד ( אסור להקליד במהלך המבחן- לא שזה עזר .... ) \nאין שום קשר לחומר שנלמד בתרגולים או למה שהצלחתי להבין בקורס\nהיה איזה שהוא פקטור שאנחנו לא יודעים מה בדיוק הוא וזאת לדעתי הסיבה היחידה שהיה ממוצע סביר. \n\nהשורה התחתונה: \nלא ממליצה. לא להתרשם מההסיטוגרמה היפה של חובב בעבר. המון תפילות לאלוהים. מבחן שהוא 90% ניחושים של לוטו", "timestamp": 1676811995609}, {"author": "*******", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אל תקחו את הקורס !!!!!!!!!!!!!!!!", "timestamp": 1677499461668}, {"author": "הנגיד", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אליקים\nחוות דעת - הרצאות: \nניכר שאליקים חובב ומתעניין בתחום. אך לצערי, הקורס מהרעים שניתקלתי בהם בפקולטה, ועשיתי קורסים. צורת ההוראה לא טובה. יש עומס של חומר ונושאים שלא באמת מכסים ולומדים אותם כמו שצריך בהרצאות. בנוסף, הזמינות שלו במייל לשאלות לא הייתה טובה, לפעמים הרגשתי זלזול מצידו שכנראה נבע מזה שלא היו מגיעים סטודנטים להרצאות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: גם התרגולים לא טובים. הקראה מהPDF, חומר בחלקו שונה מבהרצאות (כך שצריך ללמוד חומר נוסף). \n\nשעורי הבית: אין\nהמבחן: \nקשה, מצריך אינטואיציה כלכלית וקצת מזל בגלל שאין קשר ישיר בין התוכן הלא מובן של ההרצאות לשאלות עצמן. בנוסף, בעת המבחן כששאלתי אותו שאלה טכנית ניסוחית תשובתו הייתה מזלזלת ולא באה לעזור. \nיתכן והוא נפגע מהנוכחות הדלה בשיעורים. \nהשורה התחתונה: \nכל עוד הקורס מועבר על ידי אליקים, מומלץ להימנע. \nמי שרוצה לעשות את תוכנית המיינור בכלכלה שייקח בחשבון שזה קורס שיצריך הכנה רצינית לפני המבחן ולא מעט עצבים שגם ככה לא חסר בתקופת מבחנים (:", "timestamp": 1677517421790}]}