{"posts": [{"author": "Dudi", "difficultyRank": 3, "generalRank": 5, "semester": "201802", "text": "שם המרצה:  עפרה אמיר\nחוות דעת - הרצאות: עפרה מדהימה ואכפתית מאוד!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית רלוונטיים ופרקטיים\n\nהמבחן: היה מעט ארוך מדי אבל לא הלם את החומר הנלמד\n\nהשורה התחתונה: קורס מעולה שנותן כלים פרקטיים ושימושיים לתעשייה.", "timestamp": 1601284480575}, {"author": "Yonathan Mizrahi", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nתותחית\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nרפאל הוא תותח מסביר טוב מאוד \nשעורי הבית: \nכייף\nהמבחן: \nלא קשה\nהשורה התחתונה: קורס מאוד מעניין וכייף", "timestamp": 1608620091878}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: עופרה\nחוות דעת - הרצאות: מצוינת,  מאוד ברורה מאוד עניינית חשוב להגיע להרצאות בשביל להכיר ולהבין את כל המושגים, בתרגולים עובדים יותר על קוד.\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מתרגל מצוין מתקדם בקצב טוב לרוב מסיים לפני הזמן.\n\nשעורי הבית: שיעורי הבית כוללים לרוב חלק גדול של קוד (פייתון), הקוד לא קשה ומשמש ככלי לניתוח דאטה בהתאם למושגים הנלמדים. \nהתרגילים דורשים השקעה וזמן אבל בהחלט פתירים.\n\nהמבחן: באביב 20 נבחנו בע\"פ על הפרויקט בשונה מסמסטר רגיל, ממבחנים שתרגלתי המבחן סבבה וגם תמיד יש ממוצע יפה.\n\nהשורה התחתונה: אחלה קורס, מאוד מעניין מומלץ כבחירה אם מתאפשר.", "timestamp": 1611329008957}, {"author": "אוקיי :)", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עופרה\nחוות דעת - הרצאות: עבדנו בשיטה בה קודם רואים סרטונים בבית ואז מדברים עליהם בכיתה. הסרטונים טובים, חלקם אפילו מעניינים. החלק בכיתה היה 90 אחוז מהפעמים מיותר ( סמסטר היברידי )  \n\nשם המתרגל/ת:  אורי\nחוות דעת - תרגולים: אחלה. תרגולים חשובים בעיקר לפרויקט ולשיעורי בית.\n\n\nשעורי הבית: לפעמים קלים לפעמים חופרים. ממליצה ללכת לשעת קבלה ישר אם משהו לא מסתדר בקוד במקום לשבור על זה את הראש שעות.  הרבה העתק הדבק מהתרגולים \n\nהמבחן: דעה לא פופלרית: מאוד הוגן ואפילו קל\nאצלנו במחזור כולם חשבו שזה קורס קל כי ההיסטוגרמות של השנים הקודמות היו עם ציונים גבוהים אז כולם זלזלו\nמאוד חשוב לסכם את ההרצאות ולהקשיב להם טוב.\nמי שיהיה על החומר כל הסמסטר- יקשיב ויסכם זה מבחן מתנה שלא צריך ללמוד אליו יותר מידי ואפשר להוציא ציון ממש יפה\n\n\nהשורה התחתונה: נהנתי למדתי וקיבלתי אחלה ציון", "timestamp": 1635940928278}, {"author": "היי:)", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: \nנחמדה מאוד, מדברת קצת חלש. מבחינת ההרצאות יש לרוב סרטונים שצריך לראות לפני וזה במקום שעה של הרצאה פרונטלית. בהרצאה עצמה לרוב חוזרת וטיפה מעמיקה על הנושאים שהיו בסרטונים. יש הרצאות אורח שזה נחמד\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: \nהיה מצוין, הסביר ממש טוב. מעודד לחפש מידע גם באינטרנט ולפעמים עושה את זה בעצמו בתרגולים. \n\nשעורי הבית: \nהיה סבבה, זה בזוגות ויש סהכ 4\n\nהמבחן: \nקצת לא הכי ברור איך ללמוד למבחן, מאוד ממליצה לסכם במהלך השיעור גם אם זה נראה מיותר כי פשוט אין הרבה בשר בקורס אז שואלים על קטנות קצת\n\nהשורה התחתונה: \nקורס חביב ביותר ותזכרו שקורולציה לא גוררת סיבתיות", "timestamp": 1658416373542}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: כפי שכבר ציינו לפני, צפינו בסרטונים לפני ההרצאה ובמהלך ההרצאה עפרה חידדה נקודות מסוימות ממה שלמדנו. מרצה נחמדה ומאוד מתחשבת. מדברת קצת חלש למרות שהיא מאוד משתדלת אז הייתי ממליצה לשבת יותר קרוב :)\n\nשעורי הבית: 4 מטלות להגשה בזוגות. האמת, כל המטלות זה הרבה ניסוי וטעיה וחיפושים בגוגל..\n\nהמבחן: חלק מהשאלות היו הוגנות מאוד ואפילו קלות אבל בחלק הורגשה קפיצת רמה משמעותית משנה שעברה. כמו שאמרו כאן כבר, שואלים ממש על קטנות אז חשוב לסכם טוב במהלך ההרצאה/להשיג סיכום מפורט מאוד.\n\nהשורה התחתונה: אחלה קורס אבל היו לי ציפיות מאוד גבוהות ממנו שלא כל כך התממשו...", "timestamp": 1658505899310}, {"author": "?????", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: עפרה מרצה מעולה, אבל ההרצאות קצת מונטוניות ולפעמים חסרות תועלת\n\nשם המתרגל/ת: אלכס ורפי\nחוות דעת - תרגולים: אחלה מתרגלים, התרגולים לא קשורים להרצאות אלא יותר לשיעורי בית והפרוייקט.\n\nשעורי הבית: נחמדים וכיפים לביצוע, חוץ מתרגיל 2 שהיה סיוט\n\nהמבחן: קשה, כולם ציפו למבחן קליל אך הופתעו מרמת הקושי- בנוסף קשה להתכונן כי אין תשובות למבחני עבר\n\nהשורה התחתונה: קורס מעניין מאוד למי שאוהב את הנושא", "timestamp": 1660036634525}, {"author": "לללא", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עפרה\nחוות דעת - הרצאות: הרצאות מעניינות\n\nשם המתרגל/ת: רפי\nחוות דעת - תרגולים: \nהסביר טוב כששומעים ההסבר בפעם הראשונה לא כל כך מבינים אבל כשחוזרים על זה נראה לי שבסדר\nשעורי הבית: 4 שיעורי בית לא משהו שלא פתיר אבל דורשים השקעה \n\nהמבחן: \nציפינו למבחן קל בגלל מבחני עבר אבל המבחן היה קשה אבל המיני פרויקט ו שיעורי הבית ו חלוקת הציון הסופי עזרו לשיפור הציונים\nהשורה התחתונה:  לפעמים סרטוני יוטיוב עזרו להבנת ההרצאות", "timestamp": 1664548899100}, {"author": "השערת האפס", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שעורי הבית: העתק הדבק מהקוד בתרגול בלי יותר מדי להבין מה עושים כי הסגל חוזר על המנטרה של \"המטרה של הקורס היא לא לדעת לתכנת\" אבל בסופו של יום 99% מזמן העבודה על תרגילי הבית הלך על תיקוני קוד והבנת הנקרא של השאלות שלפעמים כמעט כל הסטודנטים הבינו הפוך ממה שהסגל התכוון.\n\nהמבחן: בהנחה והמבחן יהיה דומה למבחנים בשנים קודמות אז צריך לקוות שבעזרתו יתברך אפשר יהיה להוציא ציון ראוי כי במהלך הסמסטר כמעט ולא תורגלו שאלות ברוח השאלות שמופיעות במבחני עבר. אז נוצר מצב של למידת מרתון למבחן במקום למידה שוטפת, תרגול והטמעת החומר הנלמד.\n\nהשורה התחתונה: בתור אחד שהגיע לכל השיעורים, סיכם, בא לשעות קבלה אני לא מרגיש   שאני מוכן למבחן.", "timestamp": 1688845557638}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות: סך הכל מרצה סבבה ונחמד, ואין המון חומר תיאורטי. ראיתי מדי פעם גם מוקלטים שלו שהעלה וזה אחד לאחד אותו הדבר. מה שפחות אהבתי הוא שהרבה מהמונחים הוא מסביר באנגלית באמצעות מונחים אחרים שהם פחות ברורים לסטודנטים. רואים שהוא יודע היטב את החומר אמנם לעיתים ההסברים לא היו הכי ברורים.\n\nשם המתרגל/ת: ניב ברדס\nחוות דעת - תרגולים: ניב אחלה, אבל התרגולים ברובם הם סתם לעבור על קטעי קוד וללמוד מהם פעולות. \nבאופן כללי, הרגיש שיש חוסר סנכרון על המושגים בין פלונסקי למתרגלים. הרבה פעמים היינו שואלים על מושגים שנלמדו והם היו עונים תשובות שונות ממה שנלמד.\n\nשעורי הבית: החלק הכי קשה בתרגילי הבית היה העברית וההוראות. הם היו מנוסחים בצורה בזיונית ברמה של למצוא תרגיל מאנגלית, להדביק אותו בגוגל טרנסלייט ולשלוח לנו. תרגילי הבית עצמם לא בהכרח קשים ואפשר להעתיק הרבה רעיונות מהקודים שרואים בתרגולים עצמם. רוב השעות הלכו על פענוח כוונת המשורר...\n\nהמבחן: היה מבחן הוגן שכלל כמעט את כל החומר התיאורטי של הקורס. אפשרי לגמרי להוציא ציון טוב תוך 3-4 ימי למידה.\n\nהשורה התחתונה: קורס חביב סך הכל עם לא המון חומר תיאורטי, יכול לעזור לממוצע...", "timestamp": 1689536613598}, {"author": "סטטיסטיקאי שאינו שיכור", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: הייתי בפרונטלי וראיתי גם הקלטות , אורי אחלה מרצה שיודע להעביר את החומר בצורה מובנת וטובה , ובנוסף הוא אחלה בנאדם \n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: כעיקרון כל המתרגלים הם אחלה אבל אני חושב שלפחות אצלנו לא היה צורך בתרגולים כי הכל היה כתוב בצורה ברורה והיה צריך רק להבין את הקוד וזה לא קשה אבל כן אציין שכל שאלה ששאלתי את המתרגלים הם ענו לי (ככל שניתן להם ) \n\nשעורי הבית:  שיעורי הבית לא קשים או עמוסים אבל לפעמים הם מנוסחים באופן בעייתי וגם מאבדים לא מעט אם לא מגישים כפי שהם רוצים אז צריך לשים לב לזה \n\nהמבחן: מאוד הוגן , אפשר להגיד שהמבחן בוחן על כל החומר של ההרצאות ולכן צריך לדעת את ההרצאות ברמה טובה (בדרך כלל גם יש איזו שאלת קוד ששווה 5-8 שלא צריך לכתוב קוד אבל חשוב להבין את הקודים ) \n\nהשורה התחתונה: אחלה קורס אני נהנתי ממנו ומהחומר שנלמד בו , זה הרגיש כמו פרומו לקורסים הבאים אז סך הכל מדובר בקורס טוב מאוד בעיני מומלץ (ועם הסגל הזה אז בכלל )", "timestamp": 1689920946166}, {"author": "S", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות: אורי חמוד, מסביר די טוב ובעיקר מביא דוגמאות וסיפורים אמיתיים ושדיברו אלינו. המצגות שלו באנגלית והרבה מושגים הוא גם מסביר באנגלית כי הוא לא יודע איך לתרגם לעברית (בקטע מתנשא). לרוב זה סבבה ומבינים מההקשר, אבל לפעמים זה מבלבל כי רגילים להגיד את המושגים באנגלית, ובסוף המבחן והמטלות הם בעברית. (היה אפשר להיבחן אצלנו באנגלית אבל אז צריך גם לענות באנגלית...). המלצה- לתרגם את הכותרות ואת רוב השקופיות רק כדי שהעברית תקפוץ לכם בעין כשאתם עוברים עליהן אח\"כ. חוץ מזה הוא עונה על שאלות ומסביר לאט דברים מורכבים.\n\nשם המתרגל/ת: ניב ברדס\nחוות דעת - תרגולים: חמוד ומסביר אחלה אבל מתבלבל הרבה בכל מה שקשור בקוד עצמו ובמושגים של הקורס (שעליהם המבחן). כל דבר שתשאלו איך לעשות בקוד הוא ישלח אתכם \"לבדוק בדוקומינטציה\" של הספריות בפייתון אז קצת הרגיש מיותר. בכללי התרגולים כן מכניסים לעניינים ובעיקר עוזרים להבין מה לעשות במטלות מבחינה פרקטית (להלן:)\n\nשעורי הבית: יש 4 מטלות הגשה בזוגות, ופרויקט סוף. המטלות לא קשות כי רוב הקטעי קוד שצריך לרשום שם לוקחים מהתרגול. צריך כן להבין את המשמעות וזה תכלס עוזר להבין את החומר טוב (והן גם ציון תקף ומהוות ביחד 20% מהציון). רוב האנשים קיבלו ציונים גבוהים (90+). החלק הכי קשה היה להבין את הניסוח בעברית של השאלות- הן היו ברמת גוגל טרנסלייט הודי וההבהרות של הסגל היו מתחמקות כדי לא לגלות לנו מה לעשות. הפרויקט גם בזוגות והוא להגשה אחרי תקופת מבחנים- בעיקרון כולל את כל החומר של המטלות רק שאתם צריכים להעלות את השאלות שרוצים לחקור. כדאי להשקיע בו כי הוא גם בעצמו 20% מהציון. \n\nהמבחן: ארוך מבחינה מילולית ופיזית. צריך קודם להבין את הסיפור והנתונים ואז להבין מה שואלים. המבחן הוא על כל החלק התיאורטי של ההרצאות ומכיל שאלה אחת בדר\"כ של קוד קצר קיים שצריך לענות על שאלות בנוגע אליו- לא כותבים קוד בעצמכם במבחן. רוב השאלות היו סבבה, צריך לדייק במושגים ולהבין מה ההבדל בין נושאים דומים. הרבה סעיפים של 2-3 נקודות. \n\nהשורה התחתונה: אני אהבתי את הקורס ברמת התוכן. סופסוף משהו שקשור במקצוע ולא עוד תיאוריה תלושה של קורסים בשנה הראשונה. כדאי לעקוב אחרי ההרצאות כי זה חוסך חרישה למבחן. אפשר ללמוד אליו 3-4 ימים ולהוציא ציון אחלה (שגם הוא רק 60% מהסופי).", "timestamp": 1690136304027}, {"author": "סטודנט א'", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד\"ר אורי פלונסקי\nחוות דעת - הרצאות: מעביר את ההרצאות באופן די מעניין תוך שילוב של סוגיות מאקטואליה.\n\nשם המתרגל/ת: ניב ברדס \nחוות דעת - תרגולים: מאוד סבלני ומעודד לשאול כמה שיותר שאלות עד שמבינים. לוקח אחריות גם אם טעה במשהו שאמר ומרגיש שמאוד אכפת לו מהסטודנטים.\n\nשעורי הבית: ניסוח לא טוב במיוחד של השאלות בתרגילי הבית.\nמומלץ להשתמש בפורום/ללכת לשעות קבלה ולא להסס לשאול אם לא מבינים משהו.\n\nהמבחן: מאוד ארוך, אולם גם מאוד מייצג את הנלמד בקורס.\nכולל שאלות שנוגעות להרצאות בעיקר, אולם יש 1-2 שאלות של הבנה של קוד בלבד.\n\nהשורה התחתונה: קורס מאוד מעניין ומעשיר, אולם לפי דעתי עדיף היה שנלמד לאחר מבוא לסטטיסטיקה על מנת שיהיה יותר ברור להבין את המושגים הסטטיסטיים שמועברים בקורס.", "timestamp": 1692479925388}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות: די מעניינות, מביא הרבה דוגמאות מהעולם, מרשתות חברתיות ומדברים שקורים. מטמיעות את החומר די טוב, בעיקר בפן התיאורטי. עונה על שאלות וזמין בפורום ובמייל. \n\nשם המתרגל/ת: ניב ברדס\nחוות דעת - תרגולים: \nניב ממש קשוב ורוצה לעזור לכל סטודנט, נשאר גם אחרי התרגול לענות על שאלות. לרוב גם עזר באמת להבין. התרגולים התמקדו בחלק הפרקטי של לתרגל את השימוש במחברת. הרבה פעמים הרגיש קצת מיותר כי עברנו על המון פיצ'רים קטנים בכל תרגול שאף אחד לא זוכר אחרי זה, חשוב רק להבין את הרעיון הכללי של איך מיישמים את הנושא בשביל השיעורי בית. \n\nשעורי הבית: \nבאיזור ה5 תרגילים בסמסטר ופרויקט מסכם. ממש דומה למה שעושים בתרגולים ובהרצאות אז להשתמש בהם ברמת ההעתק הדבק. בדיקה הוגנת ומשקפת את מה שלומדים בקורס. \n\nהמבחן: \nהמבחן היחידי עד כה בטכניון שאני יכולה להגיד עליו שמשקף בדיוק את מה שלמדנו בקורס. מי שהיה בהרצאות ועשה את השיעורי בית יכול להוציא 80-85 בכיף. צריך ללמוד ולדעת את המושגים טוב אבל לא מבחן קשה. גם שאלות תיאורטיות על המושגים וגם הרבה מקרי בוחן. פעם אחת לעבור על הסיכום ולתרגל כמה מבחנים קודמים סוגר את הפינה. \n\nהשורה התחתונה: \nאחלה קורס. די מעניין גם בלי קשר לתואר, לא קשה מידי וסגל קשוב סך הכל.", "timestamp": 1695065226378}, {"author": "סטטיסטי המבחן", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורי\nחוות דעת - הרצאות:  סבבה ולא יותר מזה\n\nשם המתרגל/ת: ניב\nחוות דעת - תרגולים: נחמד, אבל עם נחמד לא מצליחים במבחן. חסרה לו שליטה בחומר התיאורטי. המתרגלים בדרך כלל מתחלפים כל שנה אז לא בטוח שתפגשו אותו.\n\nשעורי הבית: שיעורי הבית לפעמים היו מנוסחים בצורה לא מובנת. לא היו קשים מידי. יש פרויקט בסוף שמומלץ להשאיר לסוף ולא לערבב עם המבחנים. הוא באמת לא קשה ואפשר להוציא אחלה ציון.\n\n\nהמבחן: מבחן שיחסית מקיף את כל החומר. מי שלמד בהרצאות וטיפה נתן פוש לפני המבחן היה יכול לקבל 80 פלוס.\n\nהשורה התחתונה: \nקורס שברובו מעניין ולא יותר מזה.", "timestamp": 1695309516838}, {"author": "בועז בלומו", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "חוות דעת - תרגולים: \nהחומר בתרגול לרוב לא רלוונטי בכלל למבחן, רק לתרגילי בית. בשלב מסויים התרגולים הם רק איזה 20 דק, אז עדיף לעשות אותם בסוף היום ולא על הבוקר אם בכלל.\n\nשעורי הבית: \nלא לפחד לעבוד עם GPT, הוא עושה פלאים.\nהעומס האמיתי מגיע מהפרויקט ששהוא נותן רק אחרי שהסמסטר נגמר\n\nהמבחן: \nלא קשה מדיי, אבל צריך להבין טוב את המונחים\n\nהשורה התחתונה: \nאחלה קורס להעלות ממוצע", "timestamp": 1696398913714}, {"author": "בעיות אב בכמות גדולה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה:  פלונסקי\nחוות דעת - הרצאות: הרצאות מעניינות. החומר הועבר בצורה יחסית ברורה\n\nשם המתרגל/ת: ניב\nחוות דעת - תרגולים: לא הקשבתי בתרגולים. כאשר ההרצאות הן יותר חומר עיוני של למידת מושגים התרגולים הם איך להשתמש בjupyter. \nלא כזה ממליצה על ניב, הוא טיפה לא איתנו. תמיד מתבלבל בין המושגים, מטעה בשעות הקבלה על השיעורי בית. יש שאלות לכו שאלו מתרגל אחר.\n\nשעורי הבית: צריך מילון בעברית בשביל להבין מה רוצים. נראה כאילו רשמו את השיעורי בית באנגלית ואז השתמשו בגוגל תרגם לעברית. קיבלתי שבץ מוחי לנסות להבין  את העברית שם.\n\nהמבחן: הוא סבבה. החומר הוא נטו הרצאות ואולי איזה שאלה אחת קלילה על jupyter. בעיה עיקרית: המצגות באנגלית והמבחן בעברית, כולל מושגים. לנסות לתרגם את זה לא הדבר הכי קל. היה פקטור של 2 נק'.\n\nהמיני פרויקט: אחלה פרויקט. יש בו הרבה חופש פעולה, החל מאיזה סט דאטה לקחת ועד לאיזה מסקנות סופיות להגיע. הרגיש שהשיא של הקורס הוא בפרויקט הזה, לוקחים את כל הידע ומנסים לתחקר סט דאטה.\n\nהשורה התחתונה: קורס נחמד ביותר. ניתן להוצא ציון מעל 90.", "timestamp": 1698323779268}]}