{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: \nהרצאות ממש משעממות\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת מעולה ומקצועית\n\nשעורי הבית: ניתן לרפרנס ומקבלים 100 על ההגשה, חוץ מ2 גיליונות שהם לבדיקה מלאה והם חדשים כל סמסטר\n\nהמבחן: \nקשה ולא הוגן. בוריס לא מפרסם מבחנים ישנים ובטח לא את הפתרונות. ממוצע די נמוך לקורס לא קשה בכלל.\nהשורה התחתונה:  אם לא חובה אין סיבה לקחת.", "timestamp": 1645268053397}, {"author": "ללא שם", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: נחמדות, בוריס קצת מונוטוני וקשה לשמור על ריכוז למשך כל ה3 שעות אבל סך הכל זה סביר.\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת בסדר, לא מעבירה הרבה מעבר למה שעושים בהרצאה, פשוט פותרת תרגיל ארוך בנושא ההרצאה.\n\nשעורי הבית: 10 גליונות, רק 2 לבדיקה מלאה, כל השאר בינארי על הגשה. רובם לא קשים במיוחד. לרוב יש רפרנסים.\n\nהמבחן: מזעזע!\nלא תואם לרמה שנלמדה בכלל. שיעורי הבית והתרגולים לא משקפים את רמת הבחינה. ארוך מאוד ואין באמת סיכוי שנסיים אותו ב3 שעות.\n\nהשורה התחתונה: לצערי לא מומלץ. במהלך הסמסטר הקורס בסדר גמור לא מעיק מידי ויחסית מעניין. אבל המבחן פשוט רע!", "timestamp": 1676039097387}, {"author": "O", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה:  בוריס \nחוות דעת - הרצאות: \nמצאנו הקלטות.  הרצאות סבבה. אפשר לראות בכייף על 1.5 ולעצור אם יש משהו חשוב .\n\nשם המתרגל/ת:  אירנה \nחוות דעת - תרגולים: מצאנו הקלטות. ראיתי מוקלט\nמתמצת את החומר \n\n\nשעורי הבית:  רפרנסים ונהנים. יש גליונות לבדיקה שהם ממבחני עבר וחלק לא לבדיקה\n\nהמבחן:  היה קשה מאוד אבל נבדק ברחמנות \n\nהשורה התחתונה: סבבי לא לפחד יהיה בסדר", "timestamp": 1676812304845}, {"author": "CONWIP", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: בוריס איש נחמד מאוד אבל לצערי היה לי קשה להישאר ערה מול ההקלטות שלו. פשוט מונוטוני מאוד ולא ברור למה לומדים את מה שלומדים. אבל! זה עניין של טעם אישי\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: אירנה די מחזיקה את הקורס על כתפיה, התרגולים מאוד תמציתיים אבל אירנה עצמה אכפתית ומוכנה לעזור.\n\nשעורי הבית: לא עמוסים בכלל, שתי הגשות חובה בלי רפרנס (בדיקה רחמנית) וכל השאר גם עם רפרנס וגם ציון בינארי על ההגשה. \n\nהמבחן: קשה עד מוות. אין מבחני עבר ללמוד מהם. לא ברור איך אבל הוצאתי בו ציון טוב, מה שמראה לדעתי שהדבר המרכזי החשוב הוא להסתמך על דף הנוסחאות של אדוה ויונטה ולנסות לחרטט בביטחון.\n\nהשורה התחתונה: לא לקחת אם לא חייבים, קורס די משמים. אבל הצוות אכפתי.", "timestamp": 1713642457773}]}