{"posts": [{"author": "שרון סגל", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: מעניינות\n\nשם המתרגל/ת: איל\n\nהשורה התחתונה: קורס די מעניין ושחשוב להבין, המבחן של שהם מאוד הבנתי", "timestamp": 1597851283841}, {"author": "Noam Ben Moshe", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דר' שמרית שטרן\nחוות דעת - הרצאות: היה מעניין, הסבירה את החומר טוב\n\nשם המתרגל/ת: טל שוסטרמן\nחוות דעת - תרגולים: הסבירה טוב.\n\nשעורי הבית: שיעורי בית פעם בשבוע, ההגשה בזוגות \n\nהמבחן: המבחן היה בתחילת מועדי א' של סמסטר קורונה. היה לחוץ בזמן אבל יכול להיות שזה כי הם עוד לא ידעו איך להתאים את המבחן באופן מיטבי לזום.\n\nהשורה התחתונה: קורס נחמד מאוד", "timestamp": 1602579235305}, {"author": "mawada omar", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חבר שהם\nחוות דעת - הרצאות: חשובות להבנת החומר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חשובות לתרגול החומר והבנה לעומק\n\nשעורי הבית: ארוכות \n\nהמבחן: \n\nהשורה התחתונה: בסדר", "timestamp": 1613405683698}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: מרצה מדהים!!! משקיע ואכפתי כלפי הסטודנטים שלו. מסביר בצורה מעניינת ומובנת. ממש נהניתי לקחת את הקורס איתו. \n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: מתרגל טוב. \n\nשעורי הבית: לא כבדים מידי, עוזרים לתרגול והבנת החומר. \n\nהמבחן: מאתגר אבל הוגן.\n\nהשורה התחתונה: לקחת רק עם נדב!!!!", "timestamp": 1635101845877}, {"author": "****", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: נדב \nחוות דעת - הרצאות: מרצה מעולה, מסביר את החומר בסבלנות ובהשקעה רבה, קשוב ואדיב לסטודנטים\n\nשם המתרגל/ת: אייל \nחוות דעת - תרגולים: \nמתרגל מצויין, עוזר בשעות קבלה ומסביר מעולה את החומר\nשעורי הבית:", "timestamp": 1635108509001}, {"author": "כליל אופיר", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  שולמית\nחוות דעת - הרצאות: נוראיות ומיותרות\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: מעולים!! וברורים\n\nשעורי הבית: יחסית קשים וארוכים אבל יש רפרנסים\n\nהמבחן: קשוח\n\nהשורה התחתונה: קורס סביר דורש השקעה", "timestamp": 1646685283636}, {"author": "ללא שם", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: לא תמיד ברורות אבל כן הרגיש שחשוב להיות בהם. \n\nשם המתרגל/ת: יגור\nחוות דעת - תרגולים: מתרגל טוב, תמיד מסביר הכל עד שמבינים ועוזר בכל מה שצריך.\n\nשעורי הבית: \nארוכים מאוד, לא ממש קשים אבל דורשים השקעה.\nלרוב יש רפרנסים.\n\nהמבחן: \nקשה מאוד.\nלא תואם לרמת תרגילי הבית.\n\nהשורה התחתונה: \nבמהלך הסמסטר קורס נחמד מאוד, דורש השקעה אבל מובן בסך הכל. המבחן רע מאוד.", "timestamp": 1648578562286}, {"author": "k", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: מבולגנת מאוד, קשה לעקוב אחריה. כאילו לדעתי ההרצאות לא באמת נחוצות בדיעבד אבל יש איזשהי אווירה של צריך להיות שם\n\nשם המתרגל/ת: יגור\nחוות דעת - תרגולים: לב זהב, מתרגל ממש טוב עם מלא רצון טוב, קצת מהיר מידי \n\nשעורי הבית: שבועיים ומעיקים אבל לרוב יש רפרנס \n\nהמבחן: המבחן היה ממש פייר סה\"כ\n\nהשורה התחתונה: קורס לא קל אבל גם לא מאוד קשה ואפשר לקבל בו ציון יפה", "timestamp": 1676732582281}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: הרצאות חשובות מאוד, שמרית מעבירה את החומר באופן רהוט\n\nשם המתרגל/ת: יגור\nחוות דעת - תרגולים: מתרגל קשוב ואכפתי, רץ מהר על החומר אבל יענה על כל שאלה ואם צריך ישאר מעבר לזמן התרגול\n\nשעורי הבית: לא קלים, מלמדים מאוד, על בסיס שבועי (לרוב מרופרנסים)\n\nהמבחן: מעל הרמה הנלמדת, עם הבנה עמוקה ותרגול טוב אפשר להצליח\n\nהשורה התחתונה: קורס קשה אך מלמד, בעיקר למי שרוצה להמשיך בתחום האופטימיזציה", "timestamp": 1676990781951}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שימרית\nחוות דעת - הרצאות: מסבירה טוב. \n\nשם המתרגל/ת: רותם\nחוות דעת - תרגולים: קצת מהיר לפעמים, אבל אם עוצרים אותו הוא משתדל להתחשב. יודע את החומר מעולה ומסביר אחלה.\n\nשעורי הבית: עוזרים מאוד להבנה של החומר משבוע לשבוע. \n\nהמבחן: הוגן, מתחשבים בבדיקה בזה שיש המון מקום לטעויות חישוב.\n\nהשורה התחתונה: קורס חובה, לא קל אבל גם לא נוראי. אם תעשו את השיעורי בית ותבינו את החומר משבוע לשבוע תסתדרו.", "timestamp": 1677675553791}, {"author": "אין", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: \nלרוב לא הבנתי כלום \nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: מהמם ! אין מלים הוא זה שגרם לי להבין את החומר לדעת המתרגל הטוב ביותר אבל הוא עוד לא יתרגל אז הפסדתם אבל היה לו הקלטות העלה לנו אחת פעם אם תמצאו אותם אז כדאי  \n\nשעורי הבית: קלים לדעתי כמו סגנון השאלות התרגולים אין הפתעות גם יש רפרנס ו המתרגלים זמינים במיילים לקחו לי כמו 3-4 שעות בשבוע שזה סביר יחסית \n\nהמבחן: לדעתי היה מבחן הוגן אבלללל שאלה 1 אני לא אומר שהיא קשה אבל לא היתה שאלה דומה במבחני עבר השיטה הזו לא תרגלנו עליהָ שאלות מבחנים אז מי שלחוץ (כמוני) פיספס חצי זמן המבחן עליהה ו אז נזכר שיש עוד שאלות אבל ציון טוב זה אפשרי בקורס הזה \n\nהשורה התחתונה:", "timestamp": 1677685612651}, {"author": "Nina Kahn", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: שמרית מרצה טובה, והיא מוכנה להסביר ולענות על שאלות כמה פעמיפ עד שהסטודנטים מבינים. ההרצאות הן 3 שעות ובסוף זה מתיש עם כל ההוכחות.\n\nשם המתרגל/ת: אייל\nחוות דעת - תרגולים: רק אייל!! בזכותו הצלחתי בקורס.\n\nשעורי הבית: שבועיים, בזוגות. יש תרגילים סבבה ויש תרגילים קשים שצריך ללכת לשעות קבלה כדי לקבל טיפים (ממש מומלץ). תמיד רמה אחת מעל התרגולים.\n\nהמבחן: מאתגר אבל אפשר להוציא ציון סבבה. אצלנו הבדיקה היתה מקלה.\n\nהשורה התחתונה: קורס חובה אז אין ברירה, אבל לא נורא כמו הסתברות וחדו\"א. תשקיעו בשיעורי בית ובלמידה למבחן ויהיה בסדר.", "timestamp": 1678189249943}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: מרצה טובה, אך לא תמיד מראה תמונה גדולה בהרצאות מה שמקשה לעקוב אחריה ולהבין מה הרעיון הכללי. הרבה פעמים נכנסת למצב של המון הגדרות בלי קונטקסט.\n\nשם המתרגל/ת: איגור\nחוות דעת - תרגולים: מתרגל מעולה ותמיד רוצה לעזור\n\nשעורי הבית: סבירים\n\nהמבחן: מועד א' היה הוגן וגם הבדיקה הייתה מקלה יחסית, מועד ב' היה ברמה גבוהה יותר בהתאם למועדי ב' אך הבדיקה הייתה רצחנית - הפוך לגמרי ממה שהיה במועד א'\n\nהשורה התחתונה: לנסות לפתור כמה שיותר מבחנים ולקוות לטוב.", "timestamp": 1680352607579}, {"author": "Joseph Mechaly", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שמרית  \nחוות דעת - הרצאות: חייבים ללכת. אין הקלטה ושמרית מסבירה הכל בצורה מעולה \n\nשם המתרגל/ת: יוני  \nחוות דעת - תרגולים:  לדעתי אחד המתרגלים הטובים בפקולטה. ממש אכפת לו מהסטודנטים והתרגולים שלו טובים מאוד\n\nשעורי הבית:  שבועיים. חשובים להבנה. חלק גדול מרופרנס\n\nהמבחן: מועד א היה הוגן מאוד אבל לחוץ בזמן \n\nהשורה התחתונה: אחלה קורס אבל דורש השקעה", "timestamp": 1717967004408}, {"author": "anonymous", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שמרית שטרן\nחוות דעת - הרצאות:\nמרצה טובה. אם פונים אליה עם שאלה ספיציפית היא עוזרת מאוד. \nאין הקלטות, לכן עדיף להקשיב בהרצאות במקום להתעסק בטבלאות ו... \nאם מתקשים בהבנת הוכחות לא להתעקב. מה שיותר חשוב זה התרגולים לדעתי. \n\nשם המתרגל/ת: יונתן וולך\nחוות דעת - תרגולים: \nהתרגולים חשובים מאוד!\nכסטודנט שנה שלישית ולמרות היותו מתרגל פעם ראשונה, יוני הוכיח את עצמו בתור מתרגל השולט בחומר והצליח לתת מענה לכל השאלות תוך מתן יחס לכל הסטודנטים, והיה מוכן לשאר לאחר סיום התרגול (אפילו שעת הקבלה לפני המבחן נמשכה בין 4-5 שעות עד שנתן תשובות לכל השאלות ועוד זה לאחר שעות הקבלה של המילואמניקים!!)\nתכלס מתרגל מומלץ ואחד הטובים בטכניון.\n\nשעורי הבית: \nשיעורי בית שבועיות, הגשה בזוגות. לפעמים עמוסות אך חשובות להבנת החומר - במיוחד שאלות ההוכחה/הפרכה.\nאפשר שתחלקו שאלאות בין השותפים אם אתם לחוצים אבל *תמיד* לעבור על הפתרון הרשמי של כל השאלות!\n\nהמבחן: \nהאמת: לא קשה, אבל לא היה מספיק זמן.\n\nהשורה התחתונה: \nקורס מעניין וניתן לקבל ציון, אבל *אסור לוותר* על התרגולים. ותלכו אצל יוני.", "timestamp": 1717967691935}, {"author": "בעיות אב בכמות גדולה", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: זוועה, באה להרדים אותך ועל השעה האחרונה דוחפת הוכחה. נתקו אותי\n\nשם המתרגל/ת: יהונתן\nחוות דעת - תרגולים: בחור חמוד, לא יודע\n\nשעורי הבית: סבבה יש רפרנס להכל\n\nהמבחן: רמה בסדר הבעיה העיקרית זה מחסור בזמן\n\nהשורה התחתונה:", "timestamp": 1718901884434}, {"author": "o", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: שמרית\nחוות דעת - הרצאות: אישית, העדפתי ללמוד דרך הסיכומים שיש וממש אפשר להבין הכל דרכם. שמרית בחרה הסמסטר לא להעלות הקלטות לא מהסמסטר ולא מסמסטרים קודמים, אבל נראלי שהיא פיספסה שמה שטוב באקדמיה זה שניתן ללמוד בדרך האישית שהכי נוחה ויעילה לכל אחד, ואני לא בן אדם שיכול ללכת להרצאה ולהישאר מרוכז ובאמת להבין. \n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: אין על יוני!! יכול להיות שהוא טיפה מהיר אבל אם לא מבינים משהו ניתן לשאול והוא יענה בכל שמחה (ואם לא אז הוא בטח יעזור בשעת הקבלה). \n\nשעורי הבית: הגשות בשותפים, לפעצים צריכים טיפה יותר זמן אבל בסה\"כ הם מהווים רק 10% מהציון (ז\"א 1% לכל תרגיל בית)\n\nהמבחן: מפתיע טיפה שמועד ב הגיע פחות או יותר ברמה של המועד א! (למעט שאלת כתיבת בעית תכנות:(  ) . בבדיקה לא מתייחסים לטעות נגררת כטעות נגררת, ואפילו ההערות שקיבלתי לא היו מוצדקות (בעיניי). כמו למשל לרשום את הרעיון שיש לי ואז שורה מתחת להגדיר משתנים (או לבצע חישובים) ולרשום לי הערה של: \"לא הבנתי בשביל מה זה\" כאילו מה נסגר אני ליטרלי שורה למעלה הסברתי!!\n\nהשורה התחתונה: ניתן למצוא לא מעט מקורות מידע לחומר באינטרנט, אך עדיף לא לפספס את התרגולים של יוני! אם לא מבינים משהו אז ללכת לשעות הקבלה. תמיד בקבצי הרצאות ותרגולים לנסות לפתור את השאלה לפני שבאמת מסתכלים על הפתרון (ממש עוזר). להיעזר גם בדרייב יש שם חומר, יש את הספר שממש תואם את קבצי ההרצאות.", "timestamp": 1719485295769}]}