{"posts": [{"author": "rita ibrahim", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: רון\nחוות דעת - הרצאות: 4/5\n\nשם המתרגלת: טלי\nחוות דעת - תרגולים: 4/5\n\nשעורי הבית: ממליצה מאוד לנסות לפתור, עזרו לי הרבה!", "timestamp": 1598093650976}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: רן\nחוות דעת - הרצאות: מרצה טוב, קצת מבולגן וכתב לא הכי קריא, מומלץ להקשיב טוב ולעקוב אחריו אחרת קל לאבד את ההרצאה.\n\nשם המתרגל/ת: תום\nחוות דעת - תרגולים: מתרגלת טובה, ברורה, תמיד מוודאת הבנה.\n\nשעורי הבית: לא מאוד קשים, שווה לעשות לא רק בשביל המגן אלא גם כדי להתאפס על החומר.\n\nהמבחן: סביר, היה גם פקטור של כמה נקודות, שונה במתכונת ממבחנים מלפני חורף 19-20, בכל זאת שווה לפתור מבחנים ישנים כהכנה.\n\nהשורה התחתונה: קורס נחמד, רובו לא מאוד קשה, לא מפחיד כמו שאומרים שהוא.", "timestamp": 1611324487896}, {"author": "Anat Geyfman", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רן סמורדינסקי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: יסודי וטוב\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612355101755}, {"author": "מאי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רן\nחוות דעת - הרצאות: \nטיפה קשה לעקוב אבל בסך הכל בסדר, הוא באמת משתדל פשוט החומר נורא\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: \nמושלםםם עושה סדר בכל מה שרן מסביר בהרצאות\n\nשעורי הבית: \nמחולקים ל-2 חלק אחד במודל וחלק אחד שאלות פתוחות להגשה\nבתכלס זה פשוט בונוס של 5 נקודות לציון הסופי וההגשה היא בינארית אז זה ממש שווה את זה \nהמבחן: \nהיה מבחן אמריקאי לגמרי, ואיזשהו קונספט חדש של מבחן אמון, רמה גבוהה יותר מכל השנה אבל בסך הכל סביל\nהשורה התחתונה:", "timestamp": 1613823754517}, {"author": "דיסקרטי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: רן\nחוות דעת - הרצאות: \nלא כותב ברור, אבל בסה\"כ ניכר שהוא כן רוצה ליצור עניין, עושה לנו קוויז בזום ופותח לנו חדרים כדי שנפתור שאלות.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: אנה מעולה, מגיעה לכל תרגול מוכנה, עוברת על החומר ומסבירה הכל, מלמדת את הדברים מתוך הבנה ולא מתוך שינון של נוסחאות (שאגב אין בבחינה)\n\nשעורי הבית: \nמתיש, כל שבוע עבודה להגשה כתובה בציון עובר בינאי ובוחן מודל. אבל וואלה שווה את ה5 נקודות בונוס. \nהמבחן: זוועה, מלא תיקונים שנכתבו בצ'אט של זום ולא קריאים, בלגן אחד שלם. \nהשורה התחתונה: תקוו לעבור במועד א'", "timestamp": 1614015259286}, {"author": "Salwa Khafaga", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: רן סמורודינסקי \nחוות דעת - הרצאות: מקשה על הסטודנטים בהגזמה, צריך להתמיד ולעבור כל הזמן על החומר. לדאוג למקורות חיצוניים כדי שהחומר יישב טוב בראש. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס כבד מאוד, צריך הרבה השקעה", "timestamp": 1614605279934}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רן\nחוות דעת - הרצאות: מסביר בצורה טובה מאוד\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: מצוין\n\nשעורי הבית: יש גליון כל שבוע וצריך להגיש בהקלדה מה שהופך את העסק לקשוח ביותר אבל תורמים מאוד להבנה של החומר\n\nהמבחן: הוגן\n\nהשורה התחתונה: החומר הרבה פעמים נראה מפחיד אבל אחרי שמתרגלים הוא הרבה יותר מובן", "timestamp": 1615505854237}, {"author": "נ.ה", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רן\nחוות דעת - הרצאות: סך הכל אחלה מרצה. למרות שהכתב שלו לא ברור ומאוד קל לאבד אותו [במיוחד שאתה כבד שמיעה או בעל הפרעות קשב וריכוז] אך רואים שהוא מנסה לייצר עניין ולגרום לאחרים להנות מהחומר שהוא לא בהכרח הכי מהנה\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מצוינת . מסבירה בצורה טובה ומובנת. לפעמים מתבלבלת , וסך הכל עושה את עבודתה\n\nשעורי הבית: לטעמי שיעורי הבית חשובים להבנה של החומר \n\nהמבחן: סך הכל הוגן \n\nהשורה התחתונה: קורס לא קל אך לא נורא כמו שעושים ממנו , וסך הכל ניתן להצליח בו בצורה נחמדה רק חשוב להיות במעקב כל הזמן", "timestamp": 1615661125062}, {"author": "ניק", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רן סמורדינסקי\nחוות דעת - הרצאות:  הרצאות ארוכות, רן מאוד משתדל ותמיד מנסה לבוא לקראת הסטודנטים אך ההרצאות ברמה מאוד מאוד גבוהה שמקשה על ההבנה.\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: תרגולים עניינים ורלוונטים שנכתבים מראש עם מושגים מההרצאה, עוזר מאוד להבין כל מה שלא הבנת בהרצאה.\n\nשעורי הבית: נוראי.\nגליון הגשה שבועי + עבודה במודל.\nהיינו מחוייבים להקליד את הגליון במחשב וזה פשוט לקח שעות.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1621973930537}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: מאוד ארוכות וקצת קשה לעקוב. בהתחלה כל השיעורים התנהלו כשהמרצה רושם על הלוח וכמעט שום הסברים נלווים. לאחר שיחות איתו קיבלנו את סיכום השיעור והיה ככה יותר קל לעקוב\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מנסה לעשות סדר בבלאגן, מסביר טוב ומנסה להנגיש את החומר הזה כמה שיותר לסטודנטים\n\nשעורי הבית: מאוד עמוס, יש כל שבוע גיליון להגשה. כדאי להגיש כי זה ממש עוזר להבין את החומר.\n\nהמבחן: \n\nהשורה התחתונה: חומר לא פשוט אבל לנסות כמה שיותר להקשיב בהרצאות ובתרגולים ולתרגל לבד", "timestamp": 1643980553146}, {"author": "סטודנטית ממוצעת", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: ואו. הרצאות ארוכות של 3 שעות. קשה להיות \"על זה\" לכל אורך ההרצאה. כותבים המון! המרצה כותב המון על הלוח. \n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: מלך! \n\nשעורי הבית: קשים וארוכים. מתפרסם כל שבוע גיליון בהפרשי זמנים להגשה לא סבירים. \n\nהמבחן: \n\nהשורה התחתונה: קורס קשוח!", "timestamp": 1644938454354}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  נדב\nחוות דעת - הרצאות: נדב היה מאוד זריז בשיעורים, בהתחלה קצת קשה לעיכול. לא תמיד נתן מענה בשיעורים אבל נתן מענה בשעת קבלה והיה אדיב. דיסקרטית מקצוע שקשה ללמד והרבה היה נשען על לשבת בבית ולשבור את הראש על החומר. \n\nשם המתרגל/ת: עידו.\nחוות דעת - תרגולים: עידו היה קצת מפוזר, לרוב לא הספיק את התרגילים בתרגולים. לא תמיד ענה על השאלות בצורה קונקרטית וברורה.\nמבחינת יחסי אנוש המתרגל הכי נחמד שפגשתי בסמסטר. אווירה טובה בתרגולים, אבל הם לא תמיד הורגשו יעילים כל כך.\nהתגבורים של איציק טובים ויעילים מאוד.  \n\nשעורי הבית: \nקשים אבל זה טוב שמחייבים אחת לשבוע - ככה באמת \"מאלצים\" ללמוד את החומר.\nהמבחן: \nהוגן, העיקר לעבור\nהשורה התחתונה: קורס קשה אבל אם מספיק מתעקשים על השיעורי בית במהלך הסמסטר או חזרה על תרגולים זה יכול להספיק", "timestamp": 1645695050541}, {"author": "( :", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: קשות לעיכול\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: אחלה מתרגלת, מסבירה טוב אם כי קצת מהירה מדי.\n\nשעורי הבית: גליון כל שבוע, שואב הכי הרבה זמן מבין כל המקצועות בסמסטר.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס קשה, תשקיעו בשיעורי בית כי הם תורמים הרבה להצלחה.", "timestamp": 1646396151662}]}