{"posts": [{"author": "--", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שמעון\nחוות דעת - תרגולים: \n\nשעורי הבית: גיליון אחת לשבועיים~, 5 תרגילים בכל גיליון, חלק מהשאלות מבוססות על תרגילים שנראו בתרגול, עם זאת השאלות לא פשוטות בכלל ואפשר לשבת על גיליונות כמה ימים טובים. בנוסף יש תרגיל תכנותי (JAVA) די עמוס שנפתח באמצע הסמסטר עד לסוף הסמסטר\n\nהמבחן: (סמסטר קורונה) מבחן אמריקאי במודל עם חומר פתוח וללא אפשרות לחזור לשאלות קודמות אחרי שעוברים עמוד, 3 שעות\n\nהשורה התחתונה: קורס שדורש הרבה יצירתיות וחשיבה מחוץ לקופסה, עם דגש על ניסוחים מתמטיים מדויקים. קורס חשוב מאוד להמשך אבל לא מהנה בכלל", "timestamp": 1612342725881}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: מתן-אל\nחוות דעת - תרגולים: מתרגל מדהים מדהים! עונה על כל שאלה ומוודא שכולם מבינים, בשאלות עם פתרון מסובך הציע גם פתרונות שלא נכללים בתרגול הרשמי שהם \"אלגנטיים\" יותר, הוסיף גם קהות לבודא שהבנו את החומר. מומלץ ביותר\n\nשעורי הבית: עמוס, רצוי להקדיש יותר מיום בשבוע\n\nהמבחן: \n\nהשורה התחתונה: קורס עמוס אבל מעניין", "timestamp": 1612530452313}, {"author": "Ofek Glick", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: \nמרצה טוב, ההרצאות בלייב כמעט זהות להרצות המוקלטות.\nכרגיל חלקן מעניינות חלקן מרדימות אבל חומר סה\"כ סבבה.\n\nשם המתרגל/ת: שמעון\nחוות דעת - תרגולים: \nהמתרגל בין הכי טובים שיצא לי ללמוד אצלו, מראה שליטה מטורפת בחומר ויודע לענות גם על השאלות הקשות. הוא סופר מתחשב ורוצה לעזור.\n\nשעורי הבית: קצת רוצחים בבדיקה אבל לא קשים מידי (כמובן שלא קלים מידי)\n\nהמבחן: \nמבחן בסמסטר זום, מבחן ממש לא קשה, אבל תנאי היבחנות מזוויעים. 11 שאלות אמריקאיות כאשר אתה עונה על אחת אתה לא יכול לחזור אליה, מקשה מאוד על תכנון זמנים.\n\n\nהשורה התחתונה: עוד קורס קאדר שצריך להעיף", "timestamp": 1612796412457}, {"author": "mawada omar", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: הרבה הגדרות והוכחות \n\nשם המתרגל/ת: שמעון\nחוות דעת - תרגולים: עוזרים הרבה להבנה ותרגול החומר\n\nשעורי הבית: לוקחות הרבה זמן \n\nהמבחן: קשה \n\nהשורה התחתונה: קורס עמוס וקשה וצריך השקעה", "timestamp": 1613405583888}, {"author": "מעשים טובים לנצח .", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יובל עמק \n\nהמבחן:(סמסטר קורונה)הכי הזוי שהיה לי בתואר אם טעית נקנסת ב15 נקודות בנוסף אסור היה לחזור אחורה כלומר נגעת נסעת\nהוא פחד שנעתיק אז התחיל להמציא חוקים חדשים להיבחנות.\nהיה בן אדם שקיבל 10- שזה סיפור לספר לנכדים אגדה של בן אדם \n\nהשורה התחתונה: מבחינה ערכית,מרצה סדום ועמורה,עוזר לחזקים ומחליש את החלשים,תסתכלו על ההיסטוגרמה  .", "timestamp": 1613775795612}, {"author": "---", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: מרצה בקיא בחומר \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: שמעון המתרגל החראי תותח. מאוד האבתי את מתן-אל מתרגל צעיר ונחמד מאוד\n\nשעורי הבית: 5 יבשים + 1 תכנותי קשה. בדיקה עזויה וללא רפרנס כמעט\n\nהמבחן: השנה היה מבחן המריקאי שאין אפשרות לחזור על השאלות שנענו. תשובה נכונה נותנת 9 נק ותשובה שגויה מורידה 7נק (כלומר -16 בתכלס). מי שטועה שלוש שאלות נכשל... \n\nהשורה התחתונה: קורס חשוב מאוד לתואר ולאזרחות צריך להשקיע עמון וחומר לא פשוט.", "timestamp": 1614752864895}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יובל מלק\nחוות דעת - הרצאות: המרצה משעמם, לא כלכך מובן, גס רוח לסטודנטים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נוגה מדהימה. \n\nשעורי הבית: קשים בצורה לא הגיונית, ובדיקה רצחנית. \n\nהמבחן: \nפשוט לא הוגן. \nהשורה התחתונה: \nקורס נורא עם מרצה נורא שבא פשוט להפיל סטודנטים.", "timestamp": 1615713017981}, {"author": "BT", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מבחינת החומר המרצה מעולה, מבין את החומר ברמה שנדירה גם למרצים. אבל מבחינת יחס לסטודנטים הוא נורא ואיום. אני לא אפרט יותר מדי, אבל הכלל הוא שאם זה לא כתוב במפורש בתקנון - זה לא מעניין. אצלנו למשל הממוצע במועד ב' היה 17 נק' פחות מבמועד א' והוא לא נתן אפילו נקודה פקטור.\n\nשם המתרגל/ת: שמעון ביטון\nחוות דעת - תרגולים: מלך עולם. מעביר את החומר מעולה, מסביר כמה פעמים שצריך לכל מי שמבקש (גם אם זה ממשיך לשעת קבלה). \nרק אם רואים את ההקלטה, ממליץ לראות על X2 ;)\n\nשעורי הבית: \nבערך 5 יבשים (מגנים 5% כל אחד בנפרד, עד 15% סה\"כ) ו1 רטוב (תקף, 10%). קשים אבל לא מדי. יש גם רפרנסים לרוב השאלות.\n\nהמבחן: אצלנו זה היה בזום אז כל המבנה היה שונה, לא יודע יותר מדי לגבי הפרונטלי.\n\nהשורה התחתונה: קורס מעניין, מועבר טוב, אם הייתה לי אופציה הייתי לוקח קורס מקביל בפקולטה אחרת, רק בגלל המרצה.", "timestamp": 1617562790307}, {"author": "ניק", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: לא משהו בכלל, בלי כריזמה, בשלב מסויים בקורס כולם כבר עברו לראות הקלטות. אבל כבנאדם הוא אחלה.\n\nשם המתרגל/ת: לירן \nחוות דעת - תרגולים: בחור נחמד אבל הגיע לא מוכן לתרגולים ונראה שהיו לו פערים בלענות לנו על השאלות. ובקורס כמו מבני זה מאוד מאוד משמעותי והרגשנו את זה בלמידה למבחן.\n\nשעורי הבית: 5 גליונות יבשים למגן כל אחד אינדיבידואלית. בך הכל התרגילים בסדר, ברמת קושי גבוהה אבל מכין למבחן.\nיש תרגיל בית תכנותי שהוא חתיכת פרוייקט לא נורמלי, שעות על גבי שעות של עבודה וזה פשוט לא שווה את זה.\n\nהמבחן: נוראי, הבדיקה הכי קפדנית שראיתי. על כל טעות קטנה קוטלים את כל השאלה. היה 9 פקטור במועד א שלגמרי לא הספיק\n\nהשורה התחתונה: קורס קשה בטירוף, בסוף אנשים שלא הבינו כלום בחומר קיבלו יותר מאנשים שהבינו אותו", "timestamp": 1644920692155}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: המרצה הבין את החומר אבל היה קשה לו להעביר את החומר בהרצאות פרונטליות. עברתי להקלטות של יובל עמק, ממליצה!\n\nשם המתרגל/ת: לירן\nחוות דעת - תרגולים: ממש היה חשוב ללירן שהסטודנטים יבינו את החומר והיה מתעכב על שאלות. סופר נחמד!\n\nשעורי הבית: \nשיעורי בית סבבה, לרוב יש רפרנסים. הבעיה היחידה היא שהם קוטלים בבדיקה שזה מבאס!", "timestamp": 1645351110261}, {"author": "דייקסטרא", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל עמק\nחוות דעת - ההרצאות המוקלטות ממש אחלה \n\nשם המתרגל/ת: שמעון ביטון\nחוות דעת - תרגולים: התרגולים המוקלטים מעולים, הוא מתעכב על דברים שלא מבינים וקל לעקוב אחריו\n\nשעורי הבית: קשים. לרוב השאלות יש רפרנס, הבעיה העיקרית היא הבדיקה המאוד מאוד קפדנית ככה שאני ממליצה לכם לרפרנס אם אתם לא ממש בטוחים בעצמכם כדי שלא יפגע לכם הציון. כמעט שכחתי את הפרויקט הנוראי בג'אווה שנותנים באמצע הסמסטר ולוקח לילות לבנים שלמים והמון תסכול וכאב לב גדול אז ממש ממליצה שאם אתם קוראים את זה תזכרו כשהוא יגיע לא לדחות אותו לרגע האחרון כמוני!! \n\nהמבחן: קשה אבל היה הוגן.\n\nהשורה התחתונה: קורס יחסית בסדר (חוץ מהחלק מהמתסכל של הפרויקט שהזכרתי מקודם) אפשרי לגמרי להוציא ציון טוב תלמדו את השיעורי בית בע\"פ (כי יש שאלת ש.ב מתנה) ויהיה סבבה", "timestamp": 1645641694369}, {"author": "מבקר פורש מינימלי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: ההרצאות בלייב היו סבירות וניכר כי המרצה מעמיק בהסברים לשאלות הסטודנטים. עם זאת, ההרצאות המוקלטות של יובל עמק היו הרבה יותר מועילות ורלוונטיות\n\nשם המתרגל/ת: שמעון ביטון\nחוות דעת - תרגולים:  התרגולים היו מוקלטים והיו ברמה מאוד גבוהה. החל מחזרה יעילה על החומר ועד לירידה לפרטים הכי קטנים והמחשת טענות וחומר תאורטי בצורה פרקטית. מאוד מאוד מומלץ!\n\nשעורי הבית: קשים, לוקחים זמן, בדיקה מאוד מוגזמת של השאלות וקטילה בניקוד - מי שרוצה להוציא ציון גבוה מומלץ לרדת לכל הפרטים הקטנים שנראים מיותרים. יש רטוב אחד שניתן בתחילת הסמסטר וללא ספק לוקח *המון* זמן, מניסיון, עדיף לדחות כמה שפחות ולהתחיל אותו כבר בשלבים המוקדמים של הקורס (התרגיל משתמש בחומר מתחילת הקורס יחסית)\n\nהמבחן: המבחן היה הוגן, עם זאת משקף חלקית את הבנת החומר - מאוד תלוי בנושאים עליהם נשאלים. גם כאן, בדיקה מאוד קפדנית וללא מתן הסברים מפורטים.\n\nהשורה התחתונה: קורס חשוב, חומר מעניין, אבל קשה :)", "timestamp": 1646035836182}, {"author": "סטודנט דינאמי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל גיל\\עמק\nחוות דעת - הרצאות: \nהתחלתי בהרצאות לייב של יובל גיל,אבל מהר מאוד עברתי להקלטות.לא שיובל גיל בנאדם רע או משהו,אבל ההרצאות בלייב הועברו בחוסר כריזמה ברמה שהייתי יוצא אחרי 3 שעות בלי להבין כלום ממה שדיברו עליו. במוקלטות של יובל עמק החומר מועבר בצורה הרבה יותר מעניינת וניכר כי יש לו זיקה הרבה יותר חזקה לנושא\n\nשם המתרגל/ת: שמעון ביטון\nחוות דעת - תרגולים: גם כאן, ההקלטות של שמעון היו הרבה יותר ענייניות ויותר עזרו בהטמעה של החומר לדעתי. עם זאת\nהייתי רוצה לציין לטובה את אדם המתרגל האחראי, שכן דאג לעזור לכל מי שרצה בשעות קבלה והיה קשוב לסטודנטים במהלך הסמסטר, ושאפו ענק על כך\n\nשעורי הבית: \n5 גיליונות יבשים+ פרוייקט תכנותי כבד ממש. הגיליונות היו סבירים בסך הכל, אבל הבדיקה הייתה מתחת לכל ביקורת. קרה לי יותר מפעם אחת שהבודק הוריד לי ניקוד על שגיאת כתיב בהקלדה (ברמת הפסיק) ניקוד. זה קורס שלחלוטין עדיף לרפרנס בו מאשר להגיש מה שאת\\ה כתבת, ולו רק בגלל הבדיקה הבזיונית הזו. כן מומלץ לפתור לבד בהתחלה כיוון שיש שאלת שיעורי בית במבחן,אבל מבחינת הגשה? לא שווה את המאמץ.\nהתרגיל התכנותי קשוח ממש, וקיבלנו קרוב לחודשיים כדי לסיים אותו. מומלץ מאוד להתחיל את הפרוייקט כמה שיותר מהר, כיוון שבסוף הסמסטר יש אלף הגשות אחרות ולא יהיה זמן לסיים הכל (מניסיון)\n\nהמבחן: \nהרגיש מבחן די הוגן בסך הכל, אבל מפתח הניקוד מאוד מוזר. אפשר לקבל על תשובה במבחן רק ניקוד ספציפי מתוך מפתח הניקוד, כלומר על שאלה של 20 נק' אפשר לקבל או 2 נק' או הכל, ואין אמצע.\nאפשר לבוא עם מצגות ההרצאות והתרגולים למבחן, אז אל תנסו לשנן דברים יותר מדי אלא בעיקר להבין לעומק חומר\n\nהשורה התחתונה: \nקורס חשוב ומעניין בהגדרה שלו, אבל הסגל לפעמים מוציא את החשק ממנו. בכל מקרה קורס חובה אז אין יותר מדי ברירות, אבל כן שווה להשקיע בו כיוון שהוא חשוב לראיונות עבודה בהמשך", "timestamp": 1646556901758}, {"author": "מאסתי", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: מאוד קשה לעקוב בהרצאות, ההסברים לא מובנים \n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: מרגיש כיאילו אדם לא שם על הסטודנטים שהוא מלמד ולא אכפת לו שלא יצליחו בקורס\n\nשעורי הבית: קשים עד כדי בלתי פתירים. התרגיל התכנותי מרגיש פשוט לא נחוץ וסתם שם כדי לגרום לך לזכור שאתה לא רוצה להיות בקורס הזה\n\nהמבחן: השם ישמור\n\nהשורה התחתונה: שיהיה בהצלחה רק תעברו", "timestamp": 1646578276896}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: הלכתי להרצאה אחד של יובל גיל. הוא דיבר כאילו זה היה המקום האחרון בעולם שהוא רוצה להיות. עברתי להקלטות של יובל עמק, ממליץ מאד, הוא מלמד בצורה טובה מאד לדעתי\n\nשם המתרגל/ת: נגה\nחוות דעת - תרגולים: ניסיתי את כל  המתרגלים כולל המוקלט של שמעון, בסוף שניתי את כל הלוו\"ז להישאר אצל נגה. הכי טובה בפער גדול, מפשיטה את הבעיות ומתעקשת שנבין\n\nשעורי הבית: 5 + רטוב. היבשים מאתגרים אבל הם דומים לשאלות ממבחנים אז שווה להשקיע בהם. הם לוקחים זמן להקליד אבל מתרגלים לזה, שווה את ה10 בונוס על הקלדה כי הם בודקים ממש קשוח. הרטוב לא קשה בהגזמה אבל ארוך מאד. \n\nהמבחן: מועד א היה הוגן מאד לדעתי, מועד ב זוועה. שווה לתרגל הרבה, למי שבאמת על הדברים אפשר להוציא בו ציון טוב, אבל פתרון שלא כתוב בדיוק כמו שהוא מופיע בפתרון מורידים לו הרבה נקודות סתם\n\nהשורה התחתונה: קורס חשוב, שווה להשקיע", "timestamp": 1646658609260}, {"author": "סטודנט שניסה לפתור פעמיים ונכשל", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: לא הראה רצון רב להיות מרצה.\n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: לא ברורים. מוקלטות של שמעון ביטון - מעולים.\n\nשעורי הבית: בדיקה של סגל שרוצה שסטודנטים ייכשלו. אם קיבלתם 60 וערערתם - ימצאו לכם טעות אחרת ויצדיקו 60 בכל מקרה.  \n\nהמבחן: תענו על שאלת שיעורי בית, תכתבו \"לא יודע\" על כל השאר - ותעברו. כל מה שלא כתוב בדיוק כמו שהסגל החליט - פשוט יקבל 0. חבל. \n\nהשורה התחתונה: חומר מעניין מאוד ושימושי, מבחנים ובדיקות מצלקות.", "timestamp": 1646662823563}, {"author": "KCAH", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: הרצאות משעממות, אבל הסברים ברורים בהחלט. מומלץ לראות את ההקלטות למי שקשה לא להירדם.\n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: מתרגל מדהים. יודע להסביר את החומר, ולפשט אותו כמו שצריך. עוזר מאוד להבנה של פתרון בעיות. מציג את התבניתיות בסוגי השאלות, וכל הזמן מנסה לשפר את ההסברים שלו.\n\nשעורי הבית: עוזרים מאוד להבנת החומר. דורשים הרבה מאוד עד שנופל האסימון, אבל שווה לפתור לבד (למרות שמותר להגיש בזוגות).\n\nהמבחן: מועדי ב' חד משמעותית קשים מדי, אבל מועדי א' דווקא סבבה לרוב. מומלץ לפתור את המבחני העבר (יש מספיק).\n\nהשורה התחתונה: אחלה קורס, אפשר לראות מוקלט בכפול 2 לפחות.", "timestamp": 1646820931398}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל גיל לכאורה אבל בפועל יובל עמק\nחוות דעת - הרצאות: רק הקלטות של יובל עמק. יובל גיל מדבר בטון מאוד מונוטוני והדבר מקשה על הריכוז. ההקלטות מעולות\n\nשם המתרגל/ת: שמעון ביטון (מוקלט)\nחוות דעת - תרגולים: אחלה תרגולים, שמעון מאוד מקצועי ויודע להעביר את החומר בצורה מעולה\n\nשעורי הבית: 5 גיליונות (שבועיים לכל גיליון) + פרויקט תכנותי. שיעורי הבית קשים ולוקחים הרבה זמן. מכסחים בבדיקה וחשוב להיות מאוד פורמלי ומדויק. פרויקט תכנותי מאוד עמוס, ולא פשוט. יש הרבה מחשבה מאחורי כתיבת הקוד והוא לא נכתב בריצה. הרבה אנשים אצלנו קיבלו בסוף 0 כי אחרי 40,000 שורות של הטסט צצה שגיאה. אז ראו הוזהרתם וכדאי שתשקיעו הרבה בפרויקט כי הוא 10 אחוז תקף.\n\nהמבחן: חוק ברזל במבני: לא לגשת למועד ב בחיים. ההיסטוגרמות מדברות בעד עצמן אבל אני ניגשתי למועד ב ונכוויתי. פשוט מטורף ההבדל בין מועד א, שהיה יחסית הוגן לבין המועד ב. דברים ברמת קושי גבוהה ובלי קשר הסגל לא בא לקראת הסטודנטים בכלל, ומבחינתם שיהיה ממוצע 55 בול עם 47 אחוז נכשלים כאילו זה נורמלי לקורס כזה חשוב ובעל משקל גדול מבחינת קורסי ההמשך שלו.\n\nהשורה התחתונה: קורס מאוד מאוד חשוב בתואר ובאופן כללי לתעשייה כשתחפשו עבודה. \nהסגל ממש רע ומתנכל לסטודנטים בציונים. תתאמצו בשיעורי הבית ובפרויקט ושלא תעזו לוותר על מועד א.", "timestamp": 1646839480892}, {"author": "נוף", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: דידקטי, לא הכי כריזמטי אבל עדיין מרצה טוב \n\nשם המתרגל/ת: אדם \nחוות דעת - תרגולים: סבבה, מתרגל מנוסה, מאוד מוכוון מבחן וזה טוב \n\nשעורי הבית: קשים, מלמדים, בדיקת תרגילים הייתה קצת מחמירה אבל זה היה מועיל\n\nהמבחן: \n\nהשורה התחתונה: אחלה בחלה של קורס, עשוי היטב, מאוד קונסטרוקטיבי ועקבי, מאוד ברור ובהיר מה הנושא ומה מטרות הלמידה לאורך הקורס", "timestamp": 1647537525005}, {"author": "מתגעגעים ליובל סוג א", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יובל סוג ב\nחוות דעת - הרצאות: תחילת סמסטר נכנסתי לכמה הרצאות בודדות של יובל והיה נורא משעמם. ההרצאות המוקלטות של יובל1.0(עמק) מעולות והוא מעביר את החומר בצורה מאוד מובנת. אל תתביישו להעביר חלק מהשאלות שנשאלות במוקלט, בייחוד שאלות של בחורה אחת מאוד ספיציפית. \n\nשם המתרגל/ת: שמעון ביטול\nחוות דעת - תרגולים: התרגולים בקורס הזה סופר קריטיים בעיני וגם נלמד בהם חומר חדש לפעמים. ממליץ מאוד על המוקלטות של שמעון ביטון.\n\nשעורי הבית: תרגילים יבשים מאוד כיפיים וגם מאוד רלוונטים לסוג השאלות שנשאלות במבחן. הבדיקה בקורס כמו שנאמר מאוד קשוחה ומורידים מלא נקודות. תרגיל בית הרטוב מאוד כבד אך מלמד בעיני. ממליץ מאוד לעבוד כמה שיותר יסודי על מנת לחסוך דיבוגים מיותרים בהמשך. \n\nהמבחן: מועד א משמעותית יותר קל ממועד ב. מרגיש לי שהסגל מעריך יותר סטודנטים שכותבים \"אני לא יודע\" מכיוון שזה חוסך להם זמן בדיקה. יש מפתח ניקוד לכל שאלה וכמעט ולא מקבלים הסבר ללמה ירדו לך נקודות. בסופו של דבר במבחן הזה שי אלמנט של מזל במובן שאתה יכול להביא פתרון לא נכון אבל הוא מאוד דומה לפתרון שהם רוצים לראות בסגנון ותקבל כמעט את רוב הנקודות. בדיקה של המבחנים מרגישה מאוד לא עקבית. בנוסף, הרגיש לי שסגל הקורס התנקם בסטודנטים על כך שלא הגיעו ללייב והציונים הנמוכים יחסית לסמסטרים קודמים מעיד על כך. \n\nהשורה התחתונה: קורס מאוד מעניין וחשוב, סגל הקורס בסמסטר הזה מאכזב מאוד.", "timestamp": 1648077819383}, {"author": "Hash", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יובל גיל/עמק\nחוות דעת - הרצאות: עברתי למוקלט מטעמי נוחות אבל היה סבבה גם בפרונטלי מהפעמים שהייתי\n\nשם המתרגל/ת: אדם/שמעון\nחוות דעת - תרגולים:  הייתי רק בשעת קבלה של אדם - עוזר וידע להסביר טוב. התרגולים המוקלטים של שמעון טובים ,אפשר להריץ על מהירות 2\n\nשעורי הבית: קשים אבל חשובים. בדיקה רצחנית אז חשוב לקבל את הבונוס על הקלדה. פרויקט רטוב עמוס\n\nהמבחן: קשה, בעיקר מועד ב הזיה לא ברור מה קרה שם\n\nהשורה התחתונה: אין תרקדו", "timestamp": 1648842810382}, {"author": "איפה דייקסטרה?", "difficultyRank": 4, "generalRank": 3, "semester": "202103", "text": "שם המרצה:  יובל גיל\nחוות דעת - הרצאות: האליאקספרס של ההרצאות המוקלטות של יובל עמק. הצטרפתי בהתחלה לכמה הרצאות והבנתי שאין טעם ועברתי להקלטות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: המוקלטים של שמעון, מעביר חומר נוסף בתרגולים ועובר בזריזות על החומר של ההרצאות. התרגילים שהוא פותר אותם רלוונטים מאוד ומסביר אותם בצורה טובה. אם אתם רוצים לראות את ההקלטות של שמעון אני ממליץ לראות את התרגולים שלו מלפני הסמסטר קורונה.\n\nשעורי הבית: קשים אבל ניתן לרפרנס הכל כמעט. אם השאלה לא הופיעה בשב של שנים קודמות, רוב הסיכויים שהיא הופיעה באחד ממבחני עבר.\n\nרטוב: לא קשוח במיוחד ובעיקר חופר.\n\nהמבחן: הזוי. השאלה הראשונה היא שאלת תרגיל בית.\nשאר המבחן היה נראה כאילו המרצה שכח שלמדנו חומר אחרי הרצאה 7. כל החומר והבשר של הקורס (האלגוריתמים) פשוט לא היו במבחן, הרגיש שכל הלמידה למבחן הייתה חסרת משמעות והמבחן עצמו בדק הבנה בגרפים.\n\nהשורה התחתונה: עשיתי את הקורס פעם ראשונה הסמסטר בקיץ, אז הדעה שלי יכולה להיות מוטעה לגבי ההרצאות והתרגולים אבל המבחן הרגיש כמו הטלת מטבע. כל המבחנים של סמסטרים קודמים עד המבחן של הסמסטר המקוון נראו הוגנים יחסית וכל מבחן שנעשה אחרי היה הזוי לחלוטין.\nלמדתי למבחן במבני, קיבלתי מבחן בקומבי.", "timestamp": 1666519154757}, {"author": "MST", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: כמרצה יובל די סבבה. הוא מסביר את החומר די טוב ומההתרשמות שלי הוא גם בנאדם די נחמד. הוא אפילו ביטל הרצאה בשביל שכולם יוכלו לעודד את ארגנטינה בגמר המונדיאל. החומר יכול להיות לפעמים ממש משעמם אז יש כמה הרצאות די כבדות אבל סה\"כ היה די בסדר לדעתי.\n\nשם המתרגל/ת: ההקלטות של שמעון\nחוות דעת - תרגולים: תרגולים ברמה גבוהה, מאוד ממליץ לראות את ההקלטות. לא הלכתי לאף תרגול מאילוצי מערכת ובדיעבד זאת הייתה החלטה טובה, חומר הקורס כמעט ולא השתנה וההסברים של שמעון בהקלטות מעולים.\n\nשעורי הבית: יש חמישה תרגילים יבשים + תרגיל תכנותי רטוב.\nהתרגילים היבשים לא קלים בכלל, יש כמה שאלות ממש קשות, אבל החלק הבעייתי הוא שהבדיקה עליהם שוחטת בקטע קיצוני. מורידים המון נקודות על שטויות, אפילו באינפי 1 לא מחמירים ככה עם הבדיקה והפורמליות.\nהתכנותי סתם תרגיל חופר ומעצבן, שבתכלס לא באמת מלמד כלום, הוא בעיקר לתכנן ולממש מבנה נתונים יותר מורכב ממה שרואים בתרגולים, סתם תיק שצריך להעיף ברגע שהוא משתחרר.\n\nהמבחן: היה לדעתי מבחן די הוגן. אף שאלה לא הייתה בלתי פתירה, ועם כמה ימים טובים של הכנה ממבחני עבר אפשר היה להגיע לאחלה ציון. עם זאת לדעתי זה נורא תלוי באיזה נושאים יש בבחינה, כי היא לא מכסה את כל החומר (יש רק 3 שאלות). הסגל התיר להכניס לבחינה רק הדפסות של המצגות של ההרצאות והתרגולים, בלי שום דבר כתוב עליהן מחשש ש\"סטודנטים יקודדו פתרונות לשאלת שיעורי בית בבחינה\". די הזוי לדעתי, במיוחד כשלהדפיס את זה עולה לא מעט, וזה ממש הזוי להיבחן עם שתי חוברות מלאות בדפים כשכמעט ולא השתמשתי בהן (רק כדי להיזכר בקוד מקור של BFS, לא מעבר). בנוסף, מההתרשמות שלי מלפתור מבחני עבר, מועדי ב' בקורס הזה קשים יותר ממועדי א' די בעקביות, קחו את זה בחשבון.\n\nהשורה התחתונה: סה\"כ קורס בסדר. יכול להיות די מעמיס בסמסטר ולא הכי מעניין שיש אבל כן עושה תעבודה שלו. הקטע שצריך לשלם איזה 50 שקל בשביל להדפיס את כל החומר לבחינה קצת מציק, אם בסמסטר שלכם מתירים להשתמש בתדפיסים של סמסטרים קודמים לבחינה תעשו את זה.", "timestamp": 1677076824280}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: יובל מעביר את החומר בצורה יחסית ברורה וטובה, עם זאת ההתנהלות של הסגל לאורך הסמסטר משדרת שהם שמים אפס אכפתיות על הסטודנטים, לפני מועד א הייתה רק שעת קבלה אחת עם מתרגל אחד, אחרי המבחן פרסמו צופן להבנה איך הם בדקו לנו את המבחן שמכיל אותיות במקום ניקוד ובלי שום הערות לצד פתרון תמציתי כשבהרבה מקרים סטודנטים שפתרו באופן ממש דומה לפתרון הרשמי לא קיבלו נקודות על הפתרון שלהם וגם לא קיבלו איזשהו הסבר על מה ירד להם ניקוד בגלל השיטה המוזרה והמתחכמת שלהם. בשורה התחתונה הסגל מעודד לרשום \"אני לא יודע\" במקום לרשום תשובה שאתה בטוח בה רק ב80 אחוז כי יורידו לך עליה את רוב הנקודות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 5 תרגילים יבשים חלק מרופרנס, בדיקה קטנונית ממש כמו כל הקורס הזה. תרגיל רטוב אחד כבד\n\nהמבחן: מועד א יחסית הוגן\n\nהשורה התחתונה: קורס חשוב, סגל טעון שיפור", "timestamp": 1677593777273}, {"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: סה\"כ היו בסדר. יובל מרצה יחסית סבבה, ויש גם הקלטות שלו למי שלא אוהב פרונטלי. בהקשר של ניהול הקורס והאחריות עליו, טיפה פחות סבבה.\n\nשם המתרגל/ת: ההקלטות של שמעון\nחוות דעת - תרגולים: אחלה הקלטות, זהות לגמרי לתרגולים. אפשר לראות על 1.5 בכיף, שמעון מסביר מעולה בהן.\n\nשעורי הבית: חמישה תרגילים יבשים ותרגיל תכנותי.\nהתרגילים היבשים ברמה די גבוהה. יש בכל גיליון שאלה אחת שהיא ממש סיפור, והאחרות ברמת קושי משתנה. הבדיקה עליהם קפדנית ברמה קצת הזויה. לא חושב שבאף קורס נטפלים כל כך על קטנות כמו פה.\nהתרגיל התכנותי מתיש ומעייף וגם קיבלנו עליו ציונים ממש באיחור (אחרי תקופת המבחנים).\n\nהמבחן: עקרונית המבחן היה ממש הוגן. לא היו שאלות שדורשות רדוקציות גאוניות או  מעברים מטורפים. עם זאת (ואני אומר את זה למרות שקיבלתי ציון טוב) ההתנהלות סביבו ממש לא הוגנת כלפי הסטודנטים. אף אחד מהמתרגלים למעט יובל המתרגל האחראי לא קיים שעת קבלה, והבדיקה של המבחן די בזיונית. יש מפתח ניקוד מוזר שלא חורגים ממנו בפיפס, ובבדיקה עצמה אין אף הערה על המבחן, רק סימוני המפתח (ככה שאם הפתרון לא טוב, אי אפשר לדעת איפה הטעות). הסגל גם מוסיף לכולם 2 נקודות \"בונוס\" שיורדות אם מערערים ערעור לא מוצדק, וגם אוסרים לערער על מפתח הניקוד, ככה שבייסיקלי אי אפשר לערער בכלל בקורס הזה. יש להם נוהל חומר ממש הזוי בבחינה, אפשר להכניס רק את המצגות של הקורס בלי שום דבר כתוב עליהן מחשש שסטודנטים יצליחו לדחוף תשובות לתרגילי בית כי יש שאלת ש\"ב במבחן. באמת באופן אובייקטיבי - אחד המבחנים הכי הזויים שהיו לי.\n\nהשורה התחתונה: הקורס לא הכי מעניין שיש וההתנהלות של הסגל ממש לא משהו, אבל זה קורס חובה והוא כנראה גם חשוב להמשך, אז אין מה לעשות ממש. תשקיעו במהלך הסמסטר ותלמדו טוב למבחן.", "timestamp": 1677622260216}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מדבר מעניין, קל להקשיב. לעומת זאת 3 שעות הרצאה גם קל ללכת לאיבוד, יש הקלטות אחד לאחד לפעמים יותר נוח לצפות בזה בקצב שלך. מומלץ ללמוד עם הסיכום שיש בדרייב בעברית. לי היה קשה המעבר בין השפות עם מלא מושגים חדשים כי המצגת על הלוח באנגלית אבל יובל מדבר בעברית ולכן הסיכום עזר לי מאוד.\n\nשם המתרגל/ת: נגה\nחוות דעת - תרגולים: מתרגלת מעולה אין מה לומר. חשוב להבין כל תרגיל שנפתר בתרגול כי שאלה במבחן יכולה להתבסס על זה.\n\nשעורי הבית: \nנוראיים, חייב להיות מדויק בכל מילה שאתה כותב וגם אז כנראה ירדו לך נקודות. \nהתרגיל הרטוב לוקח המוווון זמן, וגם עליו הבדיקות לא מקלות. \nהמבחן: עוד יותר נוראי.\n\nהשורה התחתונה: בהצלחה :)", "timestamp": 1677675252849}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  יובל עמק\nחוות דעת - הרצאות: הרצאות טובות, באמת יודע למצוא עניין בעבור הסטודנטים\n\nשם המתרגל/ת: נגה \nחוות דעת - תרגולים: מתרגלת מעולה, מכירה את הסטודנטים יודעת איך לגשת אליהם ואיך להסביר דברים. אין ספק שהיא נקודת האור בקורס הזה. \n\nשעורי הבית: עמוסים, חסרי פורפורציה בבדיקה שלהם, אתם יכולים לקבל 0 על משהו נכון כי לא כתבתם את זה בדיוק כמו שרצו \n\nהמבחן: לרוב קשה, אבל מה שיותר קשה זה הנבוט שתקוע לצוות קורס הזה אתם יודעים איפה, הם מחשיבים את עצמם,  הם יזיינו לכם את הציון, לא משנה כמה הידע שלכם רחב, לא כתבתם תשובה בדיוקקקקקק כמו שהם רצו? 0 \nהגיע הזמן שהטכניון ירצה אותנו ולא לפקטר אותנו ולא לגרום לנו לעבור טלטלה נפשית עבור כל מבחן, אם המטרה שלכם לקדם אותי ואת הידע שלי ואת האהבה שלי למקצוע שבחרתי בו - תפסיקו להתייחס אלינו כאילו אנחנו gpt, אני מפתח מוכשר והמבחן שלכם לא מדד לשומדבר. \n\nהשורה התחתונה: אין ברירה עם הקורס הזה, מקווה שיחליפו את המרצה האחראי הוא פשוט איש מר", "timestamp": 1678188387652}, {"author": "לא נעים", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מסביר טוב ומובן. רק שקל לאבד את זה ב-3 שעות הרצאה. עדיף הקלטות שלו.\n\nשם המתרגל/ת: נגה הרלב\nחוות דעת - תרגולים: מסבירה את החומר טוב ומובן, רק שהיה קל להירדם בתרגולים. עברתי להקלטות באמצע הסמסטר, גם עבד. העיקר לא ללמוד לבד, כי המצגות באנגלית לגמרי.\n\nשעורי הבית: 5 גיליונות יבשים בסדר, שקל לרפרנס.\nתרגיל בית רטוב עמוס וענק שנתנו לנו אליו חודשיים מרוב שידעו שהוא ענק. אמנם לא קשה, אבל עמוס ולוקח מלא זמן לדבג.\n\nהמבחן: מועד א' לא היה קשה יותר משאר השנים, אבל הבדיקה הייתה רצחנית. גם אם הפתרון היה נכון, אם לא רשמת בדיוק כמו שהם רוצים, יורידו לך נקודות. גם לא כותבים הסבר בכלל, ולא פרסמו אפילו פתרון מלא למבחן, ככה שלא ידענו איך לערער.\n\nהשורה התחתונה: קורס זוועה. לצוות לא אכפת מהסטודנטים, רק רוצים לעבוד כמה שפחות.", "timestamp": 1678218058786}, {"author": "._.", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: סבבה סה\"כ. יש יותר מעניינות ויש פחות אבל היה בסדר. זה לא שיש הרבה ברירות כי יובל המרצה היחיד וההקלטות היחידות שיש הן גם שלו.\n\nשם המתרגל/ת: שמעון במוקלט\nחוות דעת - תרגולים: פצצה. לא רואה סיבה ללכת לפרונטלי, התרגולים לא השתנו כבר שנים וההקלטות מעולות (ממליץ על אלה שלפני הקורונה ולא של הסמסטר זום).\n\nשעורי הבית: חמישה תרגילים יבשים ותרגיל תכנותי רטוב. הכל בזוגות. היבשים לא קלים אבל מה שבאמת מקשה זאת הבדיקה הלא הוגנת בעליל. נראה כאילו מחפשים בכוח איפה להוריד נקודות, וכשלא מוצאים אז מחרטטים סיבה לא מוצדקת בעליל להוריד נקודות ומורידים בכל זאת. התכנותי מעיק בעיקר, ממליץ לסיים איתו כמה שיותר מוקדם כי הוא חופר ולא מלמד כלום בעקרון.\n\nהמבחן: הסמסטר היה יחסית הוגן. מבחני עבר מכינים בסדר אבל אין באמת דרך להתכונן למבחן בלי פשוט להשקיע כל הסמסטר בלהבין טוב את החומר. יש גם שאלת שיעורי בית ששווה 30 נקודות אז ממליץ לפתור שוב את התרגילי בית ולבוא חדים על הפתרונות כי אחרת חבל שילכו נקודות. ממליץ מאוד לפרט ולנמק כמעט כל מעבר שאתם עושים גם בהתכוננות למבחן, כי רמת הריגורוזיות והלוגיקה שדורשים פה כנראה עוקפת גם את אינפי 1. אם תעשו את זה ותבואו מוכנים חד משמעית אפשר להצליח.\n\nהשורה התחתונה: קורס סביר. הסגל קשה וההתנהלות מולם קשה, והם בהחלט הופכים קורס עם חומר לא הכי מעניין לעול במהלך הסמסטר. לא מעט סטודנטים נכוו קשות מהמבחן ומההתנהלות סביבו כי היא די לזרוק על הסטודנטים בכל מובן. עדיין אפשרי להצליח, אבל ידרוש מכם לא מעט.", "timestamp": 1678566223810}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: \nמרצה ממש טוב. שולט בחומר, מעביר אותו בצורה טובה מאוד, ובכללי הוא מרצה מאוד ידיודתי לסטודנטים. מי שיכול שילך אליו או יראה הקלטות שלו.\n\nשם המתרגל/ת: יובל גיל\nחוות דעת - תרגולים: \nמתרגל בסדר. לא משהו יוצא מן הכלל\nשעורי הבית: \nבזוגות, 5 גליונות + רטוב. הגליונות קשים, וצריך לשבת עליהם הרבה זמן אם לא רוצים לרפרנס. ברטוב דפקו אותנו ממש ונתנו ציונים זוועה. כדאי לבדוק אלף פעמים שהכל עובד לפני שמגישים.\nהמבחן: \nיובל עמק ריחם עלינו ונתן לנו מבחן יחסית קל מהשנים הקודמות. אבל בכללי צריך הבנה מאוד טובה של החומר אם רוצים להוציא ציון טוב\nהשורה התחתונה: \nקורס חובה אז אין מה לעשות. הולכים ליובל עמק ומקווים לטוב", "timestamp": 1679227515566}, {"author": "adir blajwas", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: ראיתי כמעט הכל מוקלט וההקלטות שלו מצוינות . מסביר ברור וגם המצגות ברורות בעיני מאוד. \n\nשם המתרגל/ת: נגה \nחוות דעת - תרגולים: נגה מסבירה מצוין ומאוד נחמדה \nשעורי הבית: שיעורי הבית קשים.  דורשים המון זמן. ומורידים המון נקודות על טעויות מאוד קטנות. מה שפוגע במגן מאוד.\nהמבחן: \nקשה וחייבים להיות מאוד טובים באיך בדיור להוכיח כל דבר כמו שהם רוצים שתוכיח. \nהשורה התחתונה: \nקורס מאוד חשוב וסהכ גם מעניין אבל קשה ודורש", "timestamp": 1679561505084}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יובל עמק מוקלט\nחוות דעת - הרצאות: מעולות, תואם את מה שהועבר בהרצאות הפרונטליות.\n\nשם המתרגל/ת: שמעון מוקלט\nחוות דעת - תרגולים: נהדר. יש מעט מאד שאלות שהשתנו מאז שהקליטו את התרגולים. בכל מקרה אפשר להשוות עם המצגות שמועלות למודל.\n\nשעורי הבית: קשים, אבל זו הדרך היחידה להבין מה באמת מצפים מאיתנו לכתוב במבחן. הרעיון הוא שלא מספיק שהתשובה תיהיה נכונה/ שהכיוון יהיה ברובו נכון, אלא צריך לכתוב את הפתרון + ההוכחות הנדרשות ממש כמו באינפי. \nשווה לפתור אותם ולהבין על מה ירד ניקוד.\n\nהמבחן: מועד א קל. במועד ב עברו פחות ממחצית מהסטודנטים שניגשו (!!!)\n\nהשורה התחתונה: *לא להגיע למועד ב!* המועדי ב בקורס הזה תמיד קשים יותר.", "timestamp": 1679948298015}, {"author": "אנונימוס", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: \nהרצאות מעניינות, דורש אבל לשבת אחרכך על החומר מחדש.\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מסביר טוב, היינו קבוצה קטנה וזה עזר כי היה יחס אישי וזמן להתעקב על שאלות.\n\nשעורי הבית: \nהפתרונות שמפרסמים הם הגרעין של הרעיון ודורשים להוכיח נכונות וסיבוכיות אז לפי הרפרנסים לא תמיד יודעים מה חסר אבל לגמרי להשתמש בהם כדי לוודא שהתייחסתם להכל. ההגשות בזוגות או שלשות.\nהפרויקט לא קטן וממש ממליצה איך שמפרסמים להתחיל איתו\n\nהמבחן: \nדורש יצירתיות ותשומת לב לפרטים הקטנים כדי להבין לאיזה נושא השאלה באמת מתעסקת (נראה כמו תכנות דינמי יכול להיות בסוף MST או BFS) ולדעת איך להוכיח את הטענה שלכם. אין הערות על תשובות, יש רק מכוון לכמה נקודות קיבלתם בכל שאלה אבל בלי הסבר למה הורידו. ממליצה לא לוותר על מועד א כי ב' הוא לרוב קשה יותר. \n\nהשורה התחתונה: \nקורס חשוב אבל עמוס ודורש זמן. לעבוד על הוכחות כי זה כל הקורס בסוף מעבר ללהכיר מבנים ואלגוריתמים", "timestamp": 1681636531424}, {"author": "*", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל גיל -מקווה שתקראו!\n\nחוות דעת - הרצאות: אני כאן כדי לכתוב שיובל גיל הוא הדבר הכי טוב שיכול לקרות לסטודנט שצריך הסברים מפורטים, קצת יותר סבלנות, ואת התחושה שהמרצה באמת רוצה לעזור לך. התגובות שנכתבו כאן בעבר עלו במחשבות שלי לאחר כל הרצאה וצרמו לי מאוד- כי לא יכולתי להסכים איתן ולו במעט!!! \nאנחנו סמסטר שמשולב עם אנשים שחוזרים על הקורס, וכאלה שעושים אותו בפעם הראשונה. \nבתור מי שניגשת לקורס בפעם הראשונה, אני יכולה להגיד שיצאתי מכל הרצאה מבינה ה-כ-ל, לפחות את הרוב- איך? יובל גיל עונה בסבלנות מדהימה, מנסה באמת להבין מה המכשול שמונע מהסטודנט להבין, מדבר ברור, יחס מדהים לסטודנטים וכל זה ב*קצב מעולה* (את רוב ההרצאות סיימנו תוך שעתיים במקום שלוש), ואם לא הבנת משהו- הבן אדם תמיד קיבל באווירה טובה בשעת הקבלה והיה מוכן להסביר לך לעומק גם חומר שעשינו בתחילת הסמסטר. לדעתי הוא צריך להיות מהמרצים היותר מוערכים. אני חושבת שהדעות כאן הרבה יותר מידי מוטות ואנשים מושפעים, באים עם ביקורת עוד לפני שהתחילו ללמוד איתו. בתחילת הסמסטר המליצו לי ללכת ישר להקלטות (ומי המליץ? כאלה שלא למדו איתו בכלל, שתבינו את הבדיחה ולמה כולם מוטים מראש), החלטתי ללכת אליו פרונטלית וזו ההחלטה הכי טובה שעשיתי הסמסטר וזה הקורס האהוב עליי בעיקר בזכות הבן אדם הזה. תתנו צ'אנס, תשתתפו בשיעור, תשאלו שאלות כדי שבאמת תבינו מה הולך- והוא באמת יתן לכם את המענה הכי טוב. תבואו לאורך תקופה ותרגישו באמת את מה שאני מרגישה לאחר סמסטר שלם. \n\n+לגבי התגובות המגעילות: אנשים כאן רשמו \"סוג ב\"/\"יובל מעלי אקספרס\" בחסות זה שאפשר לכתוב באנונימיות - דבר ראשון זה לא נכון וזה אפילו בזיוני. יובל גיל בעיני היה מרצה מעל ומעבר, ואם לראות הקלטה/לא לקבל מענה בזמן שאתם בהרצאה זה מה שקונה אתכם- שיבושם לכם, אבל אם יש לכם רצון אמיתי ללמוד טוב ולקבל מענה מכבד ויובל גיל מלמד בסמסטר שלכם- אל תהססו אפילו לרגע ותלכו.\nאל תשכחו בצ'יזפורק מי שיכתוב הוא כנראה מי שמאוד מבסוט או מי שמאוד מתוסכל- אני מבסוטה ולפי החוויה בכיתה נראה שגם כל מי שמגיע:)\n\nשם המתרגל/ת: אורי \nחוות דעת - תרגולים: \nמתרגל מעולה, גם מאוד סבלני ומשתדל לענות לעומק. כתב שאלות שיעורי בית משלו- שאלות מאוד מעניינות ומאתגרות ולפי דעתי זה מוערך במקום שישר יהיה רפרנס ללכת אליו. אקטים כאלה הם אקטים של אכפתיות מסטודנטים נטו וצריך להעריך את זה.\n\nשעורי הבית: מאתגרים מאוד ולוקחים הרבה זמן אם יושבים עליהם באמת.\n\nשורה תחתונה: השילוב של יובל גיל ואורי פרקש יצר קורס מדהים!", "timestamp": 1687515323072}, {"author": "בועז בלומו", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל גיל\nחוות דעת - הרצאות: \nהרבה אנשים מעדיפים לוותר על ההרצאות ופשוט לראות את ההקלטות של יובל עמק, זה לחלוטין אפשרי, אבל יובל גיל מעביר את החומר מצויין. צריך לשים לב שלא מאבדים ריכוז אם רואים את ההקלטות, חשוב להבין טוב את מה שקורה שם. באופן אישי ממליץ ללכת להרצאות פרונטלי.\n\nחוות דעת - תרגולים: \nראיתי רק הקלטות של תרגולים והיה בסדר גמור\n\nשעורי הבית: \nמאוד קשים, מאוד עוזרים להבין את החומר ולהגיע מוכנים למבחן. בדר\"כ יש 5 שאלות בגליון (דו שבועי), 2 שאלות חדשות ו3 מגליונות קודמים. שווה להשקיע ולפתור לבד, אבל אם יש לחץ תבדקו מה אפשר לרפרנס לפני שתתחילו.\n\nהמבחן: \nקשה , דגש על כתיבת הוכחות פורמאלית. שווה לעבור על כמה שיותר מבחנים קודמים כי יש טריקים שחוזרים על עצמם כמו שכפול גרפים ברדוקציה. צריך לוודא שיש מספיק זמן ללמוד למבחן הזה בתקופת מבחנים\n\nהשורה התחתונה: \nקורס לא קל בכלל, אבל יכול להיות מעניין. בהרבה משרות מבקשים לראות אם עשו את הקורס הזה אז שווה להשקיע בו.", "timestamp": 1696399322834}, {"author": "BFS", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: כבדות. 3 שעות רצוף בחלק המאוחר של היום עם חומר שלא קל להבין בפעם הראשונה שנחשפים אליו. המצגות עמוסות במלל באנגלית ולדעתי חסרות עוד המחשות, שרטוטים והכוונה לאינטואיציה. יובל נורא רהוט ומדויק, אבל לפעמים גם קשה לשמור על ריכוז במשך כל ההרצאה ואז בסוף ההרצאה הוא שם משהו ממש כבד וחבל. מה שכן, מאוד אכפת לו מהסטודנטים.\n\nשם המתרגל/ת: נועם זאיל\nחוות דעת - תרגולים: אווירה קלילה ונעימה אבל מהיר מדי. הוא מקריא מהמצגות מהר ובזמן שאני מנסה לעכל את מה שרשום הוא כבר עובר לשמוע פתרונות מהסטודנטים. מרגיש כאילו נכחתי בתרגולים אבל לא כל כך הפנמתי הכל.\n\nשעורי הבית: 5 גליונות יבשים (אחת לשבועיים), ותרגיל רטוב לקראת סוף הסמסטר. הכל מגן. הגליונות מאתגרים אבל עוזרים להפנים את החומר. על התרגול הרטוב לא יצא לי לעבוד כי חליתי אבל ממה ששמעתי הוא לא היה שווה את העבודה והיה קשוח.\n\nהמבחן: נתראה במועד ב'\n\nהשורה התחתונה: קורס עמוס ואישית מאתגר מבחינה הבנתית. פחות התחברתי, אבל אלה כלים ששווה לדעת וזה קורס חובה", "timestamp": 1714646186287}, {"author": "ערימה", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פרופ. יובל עמק\nחוות דעת - הרצאות: \nיובל מרצה טוב אבל אף פעם לא הרגשתי סיבה להיות בהרצאות, מוכיחים מלא משפטים שאף אחד לא ידרוש להוכיח במבחן וההוכחות לפחות לי לא נתנו אינוטאיציה לשום דבר\nשם המתרגל/ת: אורי פרקש\nחוות דעת - תרגולים: \nמתרגל טוב סה\"כ, ומאוד נחמד, אישית היה לי לפעמים יותר נוח פשוט לקרוא את השאלה מהתרגול אבל חשוב להגיע. שימו לב שבקורס הזה התרגולים הם כמו הרצאות ומצפים מכם לדעת מה קרה גם שם.\nשעורי הבית:\nמשום מה החליטו הסמסטר לעשות שהזוגות בשני התרגילים הראשונים מוגרלים אבל אם אתם בסמסטר 3 בתואר רוב השותפים יהיו סבירים אז זה לא כזה מפתיע \nהשיעורים יכולים להיות די קשים אבל יש מספיק זמן לפתור אותם ולרוב גם יש רפרנס, חשוב מאוד לנסות לפתור לבד כי זה התרגול היחיד לפני המבחן.\nבנוסף היה פרויקט תכנותי שבניגוד לשנים עברו היה מגן (אני חושב שזה רק בגלל המלחמה ולא הייתי בונה על כך סמסטר הבא), וגם בסה\"כ היה יחסית פשוט, מה שכן הצריך ידע בג'אווה וניכר שמי שכתב את הפרויקט לא זכר ג'אווה \nהמבחן: \nמועד א בקורס הזה תמיד הרבה יותר סביר ממועד ב. הפעם החליטו לעשות שליש אמריקאי, שליש פתוח ושליש שאלה משיעורי בית (ובחרו את השאלה הקלה ביותר שהם נתנו בש\"ב). סה\"כ היה מבחן ממש הוגן\nהשורה התחתונה: קורס נחמד והוא קדם בערך להכל. קחו אותו ברצינות כי יש המון הזדמנויות לקבל ציון טוב עם כמות הש\"ב.", "timestamp": 1715370848458}, {"author": "סטודנט ממוצע", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מסביר טוב את החומר ומנסה ליצור אינטואיציה טובה לגבי האלגוריתמים שלומדים בקורס\n\nשם המתרגל/ת: אורי פרקש\nחוות דעת - תרגולים: אי אפשר לוותר על התרגולים בקורס הזה כי הם חלק אינטגרלי מהבחינה. אבל, חד משמעית אני ממליץ לראות את ההקלטות של שמעון הישנות. אורי מדבר סופר מהר ובשביל בן אדם רגיל קשה להבין הכל בתרגול דחוס. שמעון בהקלטות הישנות נותן אינטואיציה הרבה יותר טובה ולדעתי מסביר הרבה יותר ברור מאורי. למרות זאת, יש לאורי כוונות טובות והוא באמת מנסה לעזור. שימו לב שבתרגולים 4 ו-11 יש שינויים יחסית גדולים ולכן עדיף לכם להגיע. לא חושב שבקורס הזה תהיה השפעה גדולה מידי אם תגיעו או תראו הקלטות. מילה טובה על אורי זה שהוא שולט פרפקט בחומר ומרגישים שהוא אוהב אותו. מילה רעה זה שהוא השתדל כמה שפחות לעזור בשיעורי הבית ולפני הבחינה עשה שעת קבלה שכל התרגילים שפתר בה לא היו רלוונטיים לבחינה(לא שזה חובה, אבל תאכלס הוא בזבז לנו זמן שזה לא יפה בכלל)\n\nשעורי הבית:  קשים ביותר. רמת הפורמליות והחשיבה שנדרשת מאוד גבוהה והם יכולים לקחת שעות. שאלה אחת בבחינה היא משיעורי הבית ולכן חשוב להשקיע, מעבר לזה שזה התרגול היחיד שיהיה לכם עד תקופת המבחנים. שיעורי הבית היבשים הם 15 אחוז תקף. יש תרגיל תכנותי בגאווה שכדאי לעבוד עליו תוך כדי הסמסטר ולא להשאיר לסוף אחרת תתקעו. לא היה קל, אבל גם לא מטורף. אני מאוד ממליץ שבשלב שאתם מקבלים אותו תעשו תרגילים ממבחנים שעוסקים רק במבני נתונים- תוכלו לקבל הרבה רעיונות משם כי הם מאוד דומים לתרגיל התכנותי. אצלנו כל שיעורי הבית היו מגן, כנראה שזה לא יחזור על עצמו.\n\nהמבחן: \nלדעתי , חוץ מהשאלה הראשונה שהייתה בין היותר קלות שהיו בשיעורי הבית, לא קל בכלל. נתנו לנו פקטור של נוסחה מסויימת שכנראה העלה את הציונים באיזור ה13 נק שזה בין הפקטורים היותר גבוהים במקצוע הזה. רק מראה שהיה יותר קשה מהרגיל. היו 3 שאלות אמריקאיות כבדות ולא קלות בכלל. השאלה השנייה בבחינה התמקדה רק בערמות ובדרכ אין שאלה שלמה שמתמקדת רק בזה והיא הייתה מאוד קשה. יש הבדל מאוד גדול בין הבחינה של שנה שעברה שהייתה מאוד קלה ביחס לבחינה שלנו וזה כנראה נובע מזה שאורי בנה את הבחינה.\n\nהשורה התחתונה: קורס מאוד קשה, לדעתי בין הקשים שהיו עד עכשיו בתואר. מצד שני, מאוד מעניין ואני מרגיש שלמדתי המון. החיסרון הגדול שמרגישים מאוד בקורס הזה עד כמה אנחנו מספר וציון בסוף. תשקיעו ותשרדו. אה ואל תיגשו למועד ב בחיים במקצוע הזה.", "timestamp": 1715868232228}, {"author": "סטודנט מאוכזב", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: שמו לנו את ההרצאות בשעות מאוחרות ממליץ על ההקלטות במקום, הרבה יותר נוח במיוחד שהנושאים כבדים, הקורס באמת מלמד המון צורות מחשבה והחומר יכול להיות מרתק כשמבינים אותו, מפתח חשיבה ונותן באמת תחושה של התקדמות.\n\nשם המתרגל/ת: נועם \nחוות דעת - תרגולים: מתרגל פשוט מושלם מוודא שכולם מבינים ומתעכב לטובת כל אחד, דואג לכולם ובאמת חשוב לו שכולם יבינו.\n\nשעורי הבית: שיעורי הבית מאתגרים וארוכים אבל כן מלמדים מאוד את החומר, כניראה הדרך היחידה של סטודטנים להבין את מה שנלמד. היה גם פרויקט תכנותי אבל בגלל המלחמה הוא לא היה חובה וטוב שכך, עמוס מאוד בתקופה עמוסה מאוד ולא באמת אפשרי לעשות אותו בצורה טובה, לטעמי גם לא באמת מלמד משהו יותר עושה חזרה על ג'אווה.\n\nהמבחן: המבחן עצמו היה סביר נתנו שאלת שיעורי בית יחסית קלה, שאלה 2 הייתה טריקית וארוכה ושאלה 3 אמריקאית לא נוראית פשוט לרוב לא נשאר הרבה זמן אחרי 2 שזה חבל אבל לא נורא.\nאממה.\nהבדיקה של המבחנים מזעזעת, באמת ניראה שלסגל הקורס עומד מלקטול סטודנטים על הטעויות הכי מינוריות ברמת הטעות חישוב מובילה לאפס עגול על כל הסעיף מבלי לחשוב פעמיים. אין הסברים על למה הורידו לכם ניקוד רק כמה הירוגליפים שמובילים לטבלה של כמה נקודות קיבלת, כי הרבה יותר קל לרשום WC מאשר 0\nמאכזב מאוד הסגל, הרגיש מצויין ושוב אציין לטובה את נועם ופשוט אכזה תהומית מקלות היד בבדיקה ומההסברים הלוקים (מאוד מאוד מאוד) בחסר על מה הורד בכלל ניקוד כדי שלא תוכל לערער אפילו, כמו כן יש שתי נקודות בונוס לתלמיד שלא מערער ככה שניראה שהסגל יעשה הכל כדי שהתלמידים יפחדו בכלל לחשוב שהם צודקים.\n\nהשורה התחתונה: באמת חבל לי, זה היה קורס כל כך מעניין אבל הבדיקה של המבחן פשוט מזעזעת שאין שום דרך להמליץ על הקורס הזה.", "timestamp": 1716106274916}, {"author": "הוכחה פורמלית", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: נראה שבחור נחמד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא פשוטים אבל עוזרים להבין את החומר. פרויקט נחמד למדי\n\nהמבחן: שלוש שאלות במבחן, 3 סעיפים של אמריקאיות והשאר פתוח. שאלה אחת משיעורי בית. בדרך כלל מועד א' שאלה אחת בנושא של תכנון מבנה נתונים (שאלה פשוטה למדי) ואילו במקום שאלה זו במועדי ב' שמים שאלה קשה ברמה של שיעורי בית.\nהסמסטר היה הפוך, הבחור התבלבל בין המועדים כנראה.\nמותר להביא את המצגות המודפסות מההרצאות והתרגולים.\nלא נדרש הרבה במבחן, בדרך כלל זה לקח אלגוריתם שנלמד לפני ולעשות בו שינוי מינורי ולהסביר את זה.\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1718902454244}]}