{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו.\nחוות דעת - הרצאות: לא ברור בכלל. מלמד על בסיס מחברת עם הרבה טעויות שנכתבה אי שם מתישהו.\n\nשם המתרגל/ת: אנה זוצנקו, סאהר חורי\nחוות דעת - תרגולים: משתדלים מאוד אך ניכר כי הם בעצמם לא שולטים טוב בחומר, אז על אחת כמה וכמה שאינם יכולים ללמדו ולתרגלו.\n\nשעורי הבית: ממוחזרים משנים קודמות. אפילו שאלה חדשה אחת לא נכתבה.\n\nהמבחן: טרם היה.\n\nהשורה התחתונה: לצערי, אין לי משהו חכם לומר חוץ מ- תרכשו גול, זה לא מאוד יקר, ותנסו לפתור את שיעורי הבית. לא מתקרב לרמת הלימוד של שאר המקצועות המתמטיים.", "timestamp": 1612226126750}, {"author": "רועי אזואלוס", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: \nהמרצה לא מובן בכלל. במהלך כל הסמסטר המרצה פשוט הקריא מסיכום(שיש בו לא מעט שגיאות, והמרצה מודע אליהן כבר יותר מסמסטר),וניכר היה שהוא לא הגיע מוכן להרצאות, ומבחינתו זה היה סימון וי. מומלץ למצוא חומר עזר חיצוני בקורס זה\nשם המתרגל/ת: אנה \nחוות דעת - תרגולים: \nלא טובה. גם כאן נראה כי היא בעיקר קראה סיכום של תרגילים ולא העבירה את החומר בצורה טובה.\nשעורי הבית: \nלא פשוטים,אך הגליונות מועתקים משנים קודמות,לכן יש רפרנסים בשפע\nהמבחן: \n\nהשורה התחתונה: \nאם זה לא קורס חובה,לא מומלץ לקחת", "timestamp": 1612340857986}, {"author": "~~~", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב בבינצקו\nחוות דעת - הרצאות: לא מעניינות. הפסקתי ללכת אליהם אחרי כמה הרצאות\n\nשם המתרגל/ת: אנה זוצנקו\nחוות דעת - תרגולים: מתרגלת מעולה! מספיק ללכת רק לתרגולים שלה בלי הרצאות\n\nשעורי הבית: דף עבודה פעם בשבוע\n\nהשורה התחתונה: הרבה נושאים שלא מסבירים מה הקשר בניהם. חלק נחמדים אם קולטים אותם וחלק לא.", "timestamp": 1612434264481}, {"author": "Aleph 0", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: הרצאות לא רלוונטיות ולא מסבירות את החומר. מלומד על בסיס מחברת סרוקה מרובה בטעויות. מומלץ להיעזר בחומרים חיצוניים כל עוד הוא המרצה. \n\nשם המתרגל/ת: אנה זוזצ'נקו\nחוות דעת - תרגולים: ראיתי את המוקלטים. עוזר בהבנת החומר ביחס להרצאות, אך משאיר מבולבל ולעיתים גם יש טעויות במהלך התרגול (שמתבררות בהמשך כטעויות). \n\nשעורי הבית: הדבר היחיד שיכול להשאיר מחובר לחומר לדעתי. מומלץ לעשות.\n\nהשורה התחתונה: המון בהצלחה, ממליץ למצוא גורמים חיצוניים ללמוד מהם.", "timestamp": 1612981374937}, {"author": "kantor", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב בביצנקו\nחוות דעת - הרצאות: המרצה לא מובן, מלמד ממחברת עם טעויות משנים קודמות, כשהוא מודע לטעויות האלו כפי שניתן לראות מהקלטות בשנים קודמות אבל לא טרח לתקן אותן השנה.\n\nשם המתרגל/ת: סאהר חורי \nחוות דעת - תרגולים: תרגולים עזרו להבין את החומר לכן מומלץ ללכת. סאהר מתרגל אכפתי, ניכר שאכפת לו מהסטודנטים ועושה מאמץ להסביר את החומר.\n\nשעורי הבית: \nגיליון פעם בשבוע, רפרנסים משנה שעברה. מומלץ לנסות לפתור לבד ואז להשוות עם הרפרנסים כדי להבין את חומר הקורס ולהישאר בקצב\n\nהמבחן: \n\nהשורה התחתונה: \nהיה יכול להיות קורס מאוד מעניין אם ההרצאות היו מועברות בצורה מוצלחת יותר.", "timestamp": 1613123291537}, {"author": "א0", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: יעקב\nלקנות GOOL מהר \n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: \nכנל\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: GOOL", "timestamp": 1613131425274}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: ההרצאות מתבססות על מחברת סרוקה מרובה בטעויות, ולכן ההרצאות לא כל כך רלוונטיות ועוזרות בהבנת החומר.\n\nשם המתרגל/ת: סאהר\nחוות דעת - תרגולים: התרגולים שלו ממש טובים, עזרו לי הרבה בהבנת החומר, פותר שאלות ומסביר הכל. \nמומלץ מאד ללכת לתרגולים שלו.\n\nשעורי הבית: דף עבודה פעם בשבוע\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613288751973}, {"author": "ניקול ראידמן", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב בביניצקו\nחוות דעת - הרצאות: אמממממממ, אההההה, אהההההההמממ...\nלא ממליץ לראות את ההרצאות שלו כי זה כל מה שתשמעו.\nמגמגם, לא ברור לא יודע להסביר מה הוא עושה מעבר ללהקריא את הדף שהוא מסתכל עליו.\nבנוסף, אם שואלים שאלות, הוא לא יודע לענות ומסכם את התשובה ב\"הרגשתי לעשות ככה\" אם שואלים להסבר יותר מפורט, נקבל את התשובה \"אמממ\"+חילוף נושא מהיר.\n\nשם המתרגל/ת: אנה זוזנצקו\nחוות דעת - תרגולים: כל שאלה שתשאל, תסתכם בדומה ליעקב ב\"אממממ\" או ב\"לפי הלמה של קנטור\", נוהגת לגרד בראשה באופן מסיח דעת. לא מבינה את החומר הנלמד ולא יודעת לענות בזמן אמת לשאלות שלא כתובות לה בדף.\nמאוד חביבה, מאפשרת להגיש מטלות באיחור ומתחשבת באילוצים של קורסים אחרים.\n\nשיעורי הבית: הכל משנים שעברו, אין חדש תחת השמש\n\nהמבחן: \n\nהשורה התחתונה: עדיף ללמוד מגוגל", "timestamp": 1613339362829}, {"author": "angel69", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יעקוב\nחוות דעת - הרצאות: לוקח קצת זמן להתרגל להסברים שלו,\nאבל בסופו של דבר כן עוזר להבין את החומר. מאוד חכם וניכר שמבין בעצמו ועוזר לתת אינטואציות לפתירת התרגילים.\nיעקוב עונה בשמחה על כל שאלה.\n\nשם המתרגל/ת: אנה \nחוות דעת - תרגולים: ממש מקסימה וניכר שאכפת לה שהסטודנטים יבינו, תמיד אפשר לשאול שאלות ולקבל תשובה.\nמקדישה זמן גם מעבר לשעות התרגול לסטודנטים ותמיד עונה מהר בפורום.\n\nשעורי הבית: מאתגרים אך פתירים\n\nהמבחן: \n\nהשורה התחתונה: קורס קשה אבל בעזרת הצוות הוא די סבבה", "timestamp": 1613340800623}, {"author": "..", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: מלא לא התחברו אליו, אני דווקא כן, ניכר ממש שהוא מבין מה הוא אומר ואוהב את מה שהוא מלמד, קצת מבולגן ולא תמיד הכי קוהרנטי אבל יש לו *המון* סבלנות לסטודנטים ויענה לכם על כל שאלה שהיא.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: ממש נחמדה, אפשר לעבור על התרגולים לבד ולא יהיה הרבה הבדל. אל תחפשו בתרגולים שלה כללי אצבע וטיפים למבחן.\n\nשעורי הבית: מאתגרים, להכל יש רפרנסים, חלק גדול ממנו ממבחנים של שנים קודמות.\n\nהמבחן: משקף את הרמה של ההרצאות (פחות של התרגולים)\n\nהשורה התחתונה: קורס מגוון וקצת אחר מהמתמטיקה היבשה שתראו באלגברה ובאינפי, יש כמה רעיונות לא ברורים וקשים לתפישה, אני אהבתי", "timestamp": 1613464101522}, {"author": "עוצמת הרצף", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: ביעקב יש מן קסם כזה - מצד אחד ההרצאות שלו מבולגנות מאוד, ולדעתי היה אפשר להוסיף עוד דוגמאות או לתת לנו עוד מתודות לפתרונות, אבל מצד שני יעקב עצמו בן אדם ממש חביב, וחכם מאוד. נהניתי ללמוד איתו כי הוא מאוד השתדל לגרום להרצאות להיות מעניינות, ועבורי הוא עזר לי לראות את הכיף במתימטיקה דיסקרטית.\nאבל כן, היו הרצאות שסיימתי לראות והייתי כזה \"מה לעזאזל קרה פה עכשיו\".\nלסיכום - מרצה לא דידקטי, אבל מאוד מעניין.\n\nשם המתרגל: סאהר ח'ורי\nחוות דעת - תרגולים: אם יש לכם אפשרות, לכו לתרגולים של סאהר או תראו את התרגולים שלו במהירות כפולה. הוא הפגין גם ידע וגם סבלנות כלפי השאלות הרבות שהיו לנו, והרבה פעמים הוא הוסיף את הידע שיעקב העביר בצורה לא מספיק טובה. ממש ממליצה עליו.\n\nשעורי הבית: כמו שהבנתם ממני ומפידבקים של אנשים אחרים, הצוות של הקורס מאוד חמוד אבל לא 100% מתפקד. בגלל זה חשוב מאוד (מאוד!!!) שתעשו את שיעורי הבית בעצמכם ולא בעזרת רפרנסים, כי בתכלס זאת הדרך שלכם לראות האם הבנתם את השיעורים של יעקב. אם אתם לא מצליחים גיליון שלם, כנראה שיש בעיה בהבנה הבסיסית של החומר, ואתם צריכים להשלים את ההבנה מהיוטיוב של \"הטכניון מלמדים\" או מהרצאות מתק\"א של מדמ\"ח. אל תוותרו על שיעורי הבית, למרות הרפרנסים שזמינים.\n\nהמבחן: הבנתי שלאנשים הוא היה קשה. לי האמת הוא היה סביר, בעיקר כי יעקב נתן לנו שעתיים ו-45 דקות בשביל מבחן שהיה מתוכנן לשעתיים. שימו לב שאתם יכולים ללמוד גם ממבחנים ממש ישנים, זה לא שהחומר של דיסקרטית משתנה עם השנים. אני פשוט חרשתי.\n\nהשורה התחתונה: סה\"כ ביחס לשאר קורסי המתימטיקה שנתונים ומידע לומדים (אינפי ואלגברה) אין ספק שדיסקרטית היה הכי קל עבורי. הסגל של דיסקרטית היה ללא ספק הסגל הכי מתחשב שנתקלתי בו. אני מרגישה שאם ההרצאות של יעקב היו קצת יותר מסודרות, עם מצגת שמלווה אותן ומקורות ללמידה נוספת, זה היה יכול להיות בקלות הקורס האהוב עליי.\nאבל עדיין, אהבתי את הקורס גם עם המגרעות שלו.\nטיפ ממני - נתונים ומידע בכל מקרה צריכים לקחת את הקורס הזה, אז תנסו לראות את מה שכיף בו :)", "timestamp": 1613740514308}, {"author": "Me", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקוב בביצ'נקו\nחוות דעת - הרצאות: באופן חד משמעי אי אפשר להבין מההרצאות של יעקוב משהו. החומר שהוא מעביר לא קשור לגמרי למה שיש במבחן, הוא מאוד מבולגן בצורת הוראה שלו. למדנו בסמסטר קורונה בזום, וההרצאות הועברו על ידי הקראה של דף שהוא כתב מראש (בדף יש כמות לא סבירה  של טעויות).\nשורה תחתונה- ההרצאות לא תרמו בכלום.\n\nשם המתרגל/ת: אנה זוצ'נקו וסאהר חורי\nחוות דעת - תרגולים: אנה יודעת לענות אך ורק על שאלות שהכינה מראש, אם \"מתקילים\" אותה בשאלה שהיא קצת שונה משאלה בתרגולים או בשיעורי בית, היא ישר מהססת ולא בטוחה בתשובה. \nבאמצע הסמסטר עברתי לתרגולים של סאהר- בהחלט הסיבה היחידה שהצלחתי לקבל ציון סביר במקצוע, אבל גם הוא לא בטוח בעצמו הרבה פעמים ויש המון מקום לשיפור.\n\nשעורי הבית: אחת לשבוע. השיעורי בית לא משקפים בכלל את הרמה של המבחן, המבחן ברמה גבוהה יותר.\n\nהמבחן: סביר. אני חושבת שהוא היה בערך ברמה של מבחנים משנים קודמות, אני גם חושבת שבגלל שיטת ההוראה הכושלת בסמסטר הנוכחי- הממוצע היה נמוך בפער (ההיסטוגרמה היא אחרי פקטור של 10 נקודות במבחן)\n\nהשורה התחתונה: תלמדו מספרים של הפתוחה, או מכל ספר לימוד אחר שאתם יכולים (גם גול עובד)\nכי כמעט בלתי אפשרי ללמוד מהסגל של הקורס.", "timestamp": 1614684295325}, {"author": "Ori Meiraz", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: אכפת לו מהסטודנטים אבל הוא מאוד מבולגן, יש לו טעויות בסיכום שהוא לא מתקן עוד מהסמסטר הקודם ובכללי אין הרבה ארגון בקורס.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת טובה \n\nשעורי הבית: לא יותר מידי קשים, עוזרים ללמוד יותר מאשר ההרצאות\n\nהמבחן: המבחן היה רק עם תשובות סופיות אז אם הייתה טעות אחת, יורדות אוטומטית 5-10 נקודות, גם אם זו סתם טעות חישוב. זה היה בגלל הקורונה אז אולי ישתנה בהמשך\n\nהשורה התחתונה:", "timestamp": 1614710774622}, {"author": "סטודנט שעבר את זה", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: מלבד 3 הרצאות חשובות, שאר ההרצאות בעיניי מיותרות. הוכחות שלא צריך לדעת, והעמקה מאוד מיותרת. לומדים בקורס הזה מהתרגולים.\n\nשם המתרגל/ת: אנה זינצ'נקו\nחוות דעת - תרגולים: פותרת הרבה תרגילים בתרגול. רוב ההבנה עליך, כי ההסברים שלה לפעמים לא ממש מובנים... לפעמים עושה טעויות בתרגול. כן תראו את התרגולים אבל הרוב זה למידה עצמאית.\n\nשעורי הבית: גליונות ללא ציון עם חובת הגשה כדי לקבל מגן. מתפרסמים כל יום ראשון. אפשר לסיים כל אחד תוך יום גג יום וחצי, אני אישית העדפתי לסיים איתם קודם כדי להתפנות לקורסים היותר עמוסים. המלצה חמה - אל תסתכלו ברפרנסים! למרות שאלו פתרונות רשמיים, לא פעם מצאתי טעות שם, ואחרי זה המתרגלת הודתה שיש שם טעות, ובכל אופן הרפרנסים ממש הורסים את ההבנה. בעיקר בקומבינטוריקה. בעוצמות עוד סבבה, אבל בקומבינטוריקה תשבו לבד על זה עד שייצא עשן ותבינו לבד. סופר קריטי להצלחה שלכם בקורס.\n\nהמבחן: 2 שאלות קשות ולא דומות למה שעשינו במהלך הסמסטר, ובסוף קיבלנו פקטור של 10 נקודות (כלומר העלאה לכולם ב10 נקודות), אז תבינו אתם מה זה אומר על רמת המבחן ואיך שהם הכינו אותנו אליו.\n\nהשורה התחתונה: קורס מתסכל מצד הסגל, הציון נטו עליכם", "timestamp": 1615449380012}, {"author": "ארבל", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: ראיתי מוקלטות, חשוב לשים לב שיש הרבה טעויות גם בדפים הסרוקים שהוא טען שהוא יתקן\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מוקלטים, גם פה יש טעויות, ההסברים לפעמים לא ברורים ומטעים. \n\nשעורי הבית:  לא מאוד מסובכים \n\nהמבחן: קשה. המבחנים של יעקב שונים מאוד מהמבחנים של שנים אחרות ויש מעט מאוד פתרונות סרוקים מה שמקשה על ההכנה לקראתם\n\nהשורה התחתונה: קורס שהיה יכול להיות טוב אבל נופל חזק בגלל הסגל.", "timestamp": 1615802232259}, {"author": "על הפנים", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: אני לא יודע מי חשב על זה שלהעביר הרצאה זה לקרוא חומר כתוב מהדף. היה עדיף לתת לכל סטודנט ספר ועמודים לקרוא בכל שבוע . \nלא אפשרי לקרוא למה שהיה בסמסטר הזה הרצאה, החומרים הכתובים היו עם לא מעט טעויות וכל הרצאה היה קושי רב על מנת לנסות ולעקוב אחרי הסיפור שיעקב קורא.\nבתור בן אדם , יעקב סבלני ועונה על שאלות בצורה טובה סהכ אבל שוב - מה שהוא העביר לא נקרא הרצאה וכמעט ואין לו שום מוערבות במה שקורה בקורס (\"המרצה האחראי\").\n\nשם המתרגל/ת: אנה וסאהר\nחוות דעת - תרגולים: אנה נחמדה אבל לא לגמרי מקצועית לדעתי ,טועה לא מעט במהלך התרגול. השתמשה בחומר שהיא כתבה על התרגולים המוקלטים והציגה לנו אותו בתרגול , כלומר , כל התרגילים פתורים כבר בתרגול והיא עוברת על מה היא כתבה שם - בדומה לעקרון ב''הרצאה'' .\nסאהר - הכי מקצועי לדעתי מכל הסגל . בתרגולים שלו פותר מ-0 ומציג דרך חשיבה מההתחלה עד להגעה לפתרון שכלכך הייתה חסרה אצל אנה.\n\nשעורי הבית: בשום צורה לא משקפים את המבחן. אי אפשר לדעת קומבינטוריקה אחרי פתירת 4 שאלות בשבוע. \nתצטרכו לשלם עבור גול על מנת לתרגל מספיק ולהצליח.\n\nהמבחן: בשום צורה לא מתקרב לתרגולים או לשיעורי הבית . למי שקנה גול לפני מועד א' ותרגל איתו הצליח באופן יחסי את מועד א'. \nמועד ב' בשום צורה לא קשור לקורס הזה, רק מראה את חוסר החיבור של המרצה לסטודנטים, רוב השאלות דורשים טריקים והמצאות שלא הוצגו באף שלב בקורס וגם באף מבחן שראיתי (מ2013...).\n\nהשורה התחתונה: על הפנים. הקשר של ההרצאות לתרגולים מקרי בהחלט פרט לכך שהם עוסקים בגדול באותם נושאים, סימונים שונים להרצאה ולתרגולים,מושגים שמוזכרים בהרצאה לא מועברים כלל בתרגול.\nמועד א' היה הוגן למי שקנה ותרגל מגול , מועד ב' לא הוגן באף קנה מידה.\nהחומר בקורס מעניין לדעתי וזה היה יכול להיות אחלה של קורס ושבירת שגרה לקורסים מתמטיים התחלתיים אחרים , חוסר החיבור של הסגל לסטודנטים וחוסר התיאום שלהם בינם לבין עצמם פשוט מביך לקורס שמועבר בטכניון.\nשיהיה בהצלחה.", "timestamp": 1615804298064}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יעקוב \nחוות דעת - הרצאות: ההרצאות ברמה מאוד נמוכה. יעקוב מקריא מדפים ישנים שיש בהם עדיין טעויות, ולדעתי לא מעביר את החומר בצורה קלה להבנה.  \n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: אנה קוראת גם מדפים, ונותנת הרגשה שהיא לא יודעת את החומר ברמה מספקת. היא לא עונה על שאלות בצורה ברורה.\n\nשעורי הבית: \nברמה סבירה, הקושי הוא בהבנה של החומר שמועבר על ידי הצוות, על מנת לפתור את השיעורי בית.\nהמבחן: \nיש מבחנים הוגנים ויש מבחנים שבהם רמת ההתחשבות בסטודנטים מאוד נמוכה, והניסוח של השאלות לא ברור.\nהשורה התחתונה: \nקורס שאינו קשה, אבל צריך ללמוד להתמודד עם הצוות", "timestamp": 1616664479556}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: הרצאות לא מובנות בכלל ובקושי קשור לחומר\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת מאד אכפתית שרוצה את טובת הסטונדטים ומוכנה תמיד לשמוע ולעזור. אבל מעבירה את החומר ברמה לא מספקת וקשה להבין\n\nשעורי הבית: גליון אחד בשבוע, לא ארוך ולא קשה מדיי, מועתק מסמסטרים קודמות.\n\nהמבחן: מזעזע. לא קשור לחוומר שנלמד ולא בוחן את ההבנה ושליטה בחומר. סתם חידות ממש קשות\n\nהשורה התחתונה: התנהלות לא טובה של הסגל. חומר מעניין ונחמד אבל קורס מסוכן", "timestamp": 1616686660793}, {"author": "הארי פוטר", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: מאוד תיאורטי אבל מעניין. לא הייתי ממליצה לוותר לגמרי אבל בהחלט אפשר רק לקרוא את רשימות ההרצאה.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: ממש מנסה להסביר ולעזור אבל לא תמיד חדה על החומר, מומלץ ממש לבוא לשעות קבלה / לשאול בפורום. מאוד מתחשבת.\n\nשעורי הבית: פעם בשבוע עם ציון בינארי. ממש חשובים להבנה של החומר - לא מומלץ לרפרנס (חוץ מגיליון אחד שכלל חומר שעוד לא נלמד וכולנו שברנו עליו את הראש).\n\nהמבחן: דרש הבנה טובה של החומר והיה מורכב מתשובות סופיות בלבד - לכן הציונים היו נמוכים. \nהדרך היחידה ללמוד אליו היא לפתור כמה שיותר תרגילים ולעבור על דוגמאות מההרצאה.\nהיה פקטור של 10 נק' בשני המועדים.\n\nהשורה התחתונה: יש כאלה שמתחברים ויש כאלה שפחות. בסה\"כ קורס מעניין ולא דורש יותר מידי השקעה, אבל חשוב לוודא כל שבוע שהבנת את החומר לעומק אחרת קל מאוד להאבד.", "timestamp": 1616793253996}, {"author": "מתן", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: מזעזע\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: קשה ללמוד ממנה\n\nשעורי הבית: \n\nהמבחן: לא הוגן\n\nהשורה התחתונה:", "timestamp": 1617553664753}, {"author": "אחת שיודעת", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: קשה לראות את הקשר בין ההרצאות לשיעורי הבית ולתרגילים בפועל, אבל מעבר לזה, יעקב מרצה מאוד אנושי ונחמד, מתחשב בבקשות התלמידים ונשאר שעות אקסטרה בשביל לענות על כל השאלות.\n\nשם המתרגל/ת: אנה זוצ'נקו (אחראית), סאהר חורי\nחוות דעת - תרגולים:  סגל מאוד מתחשב ונחמד. תמיד מתייחסים למיילים ולבקשות התלמידים ומקדישים זמן נוסף בהסברים לאחר השיעור.\nסאהר מתרגל חד מאוד, עונה על שאלות של תלמידים מתוך הבנה עמוקה של החומר, שהוא מצליח להעביר גם בתשובותיו.  \n\nשעורי הבית: קשים \n\nהמבחן: קשה ודורש הרבה חשיבה מחוץ לקופסא, ופחות טכניקה. מדי פעם ניתן לזהות טריקים שלמדנו בתרגולים ובש\"ב שזה נחמד.\n\nהשורה התחתונה: בהצלחה חברים, תהיו חזקים", "timestamp": 1619469886101}, {"author": "D", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: הפסקתי להגיע באמצע הסמסטר להרצאות ובמקרה הטוב ריפרפתי על הרשימות יום לפני התרגול בשביל הקשר ולא הרגשתי שינוי לעומת שבועות שבהם נכחתי בהרצאות. יעקב מדבר בעיקר לעצמו.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים:  רואים שהיא ממש יודעת את החומר אבל לא יודעת ככ להעביר אותו. בקומבי הייתה משמעותית יותר מובנת מאשר בתורת הקבוצות. מאוד נחמדה ומפעילה את הזום למי שזה רלוונטי.\n\nשעורי הבית: קל לרפרנס. יש להם מעט מאוד קשר למה שרואים בהרצאות ובתרגולים אבל הכל ממוחזר משנים קודמות\n\nהמבחן: נגלה בהמשך\n\nהשורה התחתונה:", "timestamp": 1643991116313}, {"author": "Anonimi", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: רואים שיעקב הוא אדם מאוד חכם ומאוד שולט בחומר ואוהב אותו, אבל הוא מרצה לא משהו בעיניי. הרבה מאוד פעמים נותן דוגמאות לא מובנות ואת רוב ההוכחות שהוא מראה בהרצאות שלו לא באמת צריך בשביל לפתור תרגילים. זה בשילוב העובדה שההרצאות תקועות בשני אחה\"צ והן 3 שעות גורמות להרבה פשוט להפסיק להגיע או לא להקשיב. לא הרגשתי ברוב המקרים שההרצאות חשובות יותר מדי כדי להבין את החומר.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מרגישים שהיא לא שולטת בחומר, ולא חדה עליו מספיק בשביל לענות על שאלות שעולות בתרגול. לא מסבירה טוב וקשה ללמוד ממנה, ובנוסף לכך התיאום בינה לבין יעקב אפסי (יכולים ללמד אותו דבר בשתי דרכים שונות שנראות לא קשורות). סה\"כ לא אהבתי את התרגולים, והסיבה שהלכתי אליה ולא למתרגל האחר הייתה רק בגלל אילוצי מערכת. \n\nשעורי הבית: היו משהו כמו 11 גיליונות להגשה עם ציון לא בינארי שנחשבים כ10% מגן, שניתנו כל שבוע. כל הגיליונות למעט אחד בקומבי שהיה קשה היו די קלילים ואפשר לשבת על גיליון כמה שעות ולסיים אותו, אבל הבעיה העיקרית הייתה שיש פשוט הרבה יותר מדי מהם וזה מעמיס באיזשהו שלב על הסמסטר. רוב השאלות גם מנוסחות ממש גרוע (קשה לפעמים להבין מה רוצים בגלל ניסוח לא מדויק של השאלה). מה שכן יש רפרנסים בשפע בדרייב הפקולטי של נתונים וכמעט הכל ממוחזר משנים קודמות.\n\nהמבחן: די רנדומלי, בהצלחה.\n\nהשורה התחתונה: קורס די מעיק, הפך מהר מאוד לבדיחה של המחזור שלנו. הלמידה היא נטו עליכם, אז תשקיעו כמה שצריך ויהיה בסדר.", "timestamp": 1643992009249}, {"author": "kfir eliyahu", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: די מבולגנות אבל יש רשומות של יעקב שדי עזרו לי. יש אחלה אווירה בשיעור ואצלי לפחות יעקב הצליח די להקליל את ה3 שעות רצוף האלה אחר הצהריים. רוב החומר של הקורס די מעניין ואני מאמין שמי שהצליח להתחבר והשקיע במהלך הסמסטר יכול לקבל אחלה של ציון.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: יש לה תרגולים עם הפתרונות במודל ולגמרי רצוי להיעזר בזה במהלך הסמסטר. לפעמים יש חוסר תיאום בינה לבין יעקב בדרך העברת החומר אבל בסופו של דבר שתי שיטות הלימוד מתקבלות כפתרונות אז פחות קריטי. \n\nשעורי הבית: מעמיסים מאוד, יש גיליון כל שבוע וצריך לעשות את כולם בשביל 3 נקודות בונוס בציון הסופי וזה המון. יש גיליונות קלים יותר ויש כאלו שפשוט לא פתירים והרבה מעבר לרמה של המבחן. הרוב ממוחזר משנים קודמות אז כדאי להיעזר ברפרנס.\n\nהמבחן: די קשוח, הרוב שם הוא יחסים, קומבינטוריקה ועוצמות שהם שלושת הנושאים הגדולים של הקורס. יש מלא טריקים שצריך לעלות עליהם בשביל לענות על השאלות אז חשוב להיות חד ולהקשיב בהרצאות ובתרגולים כדי להבין איך לעלות על הטריקים של השאלות.\n\nהשורה התחתונה: קורס קשוח, ממוצע יחסית נמוך אבל אפשר לעבור בציון גבוה אם משקיעים בערך חצי ממה שתשקיעו על אינפי", "timestamp": 1646214454856}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nאמ;לק: מיותר\nחחחחחח הפסקתי ללכת כשהוא אמר את המילה עוצמה. עכשיו ברצינות, יעקב יודע על מה הוא מדבר והוא ללא ספק יודע את החומר אבל היכולת שלו להעביר את החומר לאדם אחר היא אפסית, הוא פשוט חכם מידי ולא מבין את הקשיים של האדם הפשוט. דברים שנראים לו טריוויאליים לא נראים כך לתלמידים, מה גם שניכר שהוא לא כלכך מעוניין להיות בעמדת המרצה. מאוד קל לאבד את ההרצאה, במיוחד כשההרצאה היא באורך שלוש שעות בזמן הכי מעייף ביום (15:30-18:30), כל פעם מצאתי את עצמי מתפלל לסיומה. לגבי החומר שמועבר בהרצאה יש ספקות לגבי מידת החשיבות שלו.\n\nשם המתרגל/ת: אנה \nאמ;לק: סביר מינוס\nחוות דעת - תרגולים: אנה באמת אחלה והיא באמת מנסה שכולם יבינו את החומר שמועבר בתרגולים, אבל לקרוא מדף גם אני יכול ולא לשם זה אני קם מהמיטה והולך לתרגול. באופן יחסי התרגולים יותר מועילים מההרצאות ושם קורית הלמידה בקורס, אם אפשר לקרוא לזה למידה.\n\nשעורי הבית:\nאמ;לק: נאה דורש ולא מקיים\nהקורס השני במידת העומס בשיעורי הבית - שני בלבד לאלגברה, גיליונות עם שאלות ברמה משתנה, מאוד מעמיסים על הסמסטר אבל בונוס שווה אז תעשו את כולם ותשקיעו.\n\nהמבחן: \nאמ;לק: לא יודע הרגיש לי מבחן בקומבי\nקיצר קנו GOOL ותקוו לטוב \n\nהשורה התחתונה: \nמישו פה נזכר קצת מאוחר (ללמוד תקורס) וזה דווקא כן אני.", "timestamp": 1646228176773}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: בקצרה סיוט. ביותר פירוט: מלא הוכחות לא חשובות לחומר, הסברים כבדים ומבלבלים ובאופן כללי יעקב לא יודע להעביר הרצאה כמו שצריך. יאמר לזכותו שהוא שולט בחומר ברמה סופר גבוהה, הוא פשוט לא יודע להעביר אותו לסטודנט הפשוט. ממש חבל כי החומר כן מעניין והיה פה פוטנציאל לקורס איכותי שמראה צד אחר במתמטיקה ממה שחווים בשאר הקורסים של הסמסטר הראשון.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: פשוט מקריאה מהדף את התשובות לשאלות. לא באמת מדגימה את דרך החשיבה שצריך בשביל אשכרה להיות מסוגל להתמודד איתן. מרגיש שהתרגול סתמי ולא באמת מטמיע את החומר טוב. הלמידה זה נטו אתם והתרגילי בית.\n\nשעורי הבית: לא קשה אבל עמוס ממש. כל שבוע גיליון שלוקח כמה שעות לסיים. אמנם הם לא יותר מדי מסובכים אבל מתפרסמים בתדירות הזויה שמעיקה במיוחד בשבועות היותר עמוסים של הסמסטר כשיש הגשות גם בשאר הקורסים. הבדיקה של השיעורי בית ממש הזויה בנוסף. אין באמת משוב על הגיליונות ואני מוכן לשים כסף שלא באמת בודקים לעומק אחרי הגיליון השלישי אלה סתם רואים שיש הכל. יוצא שפשוט משקיעים לחינם.\n\nהמבחן: לא ברור לי איך קרה שנושא שלומדים במשך שני שליש קורס לא מופיע במבחן אבל כנראה שIt is a thing בשביל יעקב. כל המבחן היה רק קומבינטוריקה וזה אחלה בשביל מי שטוב בזה אבל אני שהנושא העיקרי שהייתי טוב בו היה עוצמות שלא הופיע בכלל במבחן די אכלתי אותה וזה מה ששולח אותי למועד ב'. באופן כללי המסקנה מהמבחנים של יעקב היא שהם רנדומליים ממש והמבנה שלהם משתנה כל שנה, אז חוץ מלקוות לטוב, לפתור מבחני עבר בשביל כן להבין את החומר ולהתבאס שלא לקחת מתק\"א במקום הקורס הזה אין יותר מדי מה לעשות. אני כן אגיד שריאלי להשיג ציון טוב אם אתם שולטים בכל החומר של הקורס, אבל יש מועדים שבהם גם המתרגלים לא מצליחים לפתור את המבחנים כשבאים לשעות קבלה שלהם.\n\nהשורה התחתונה: קורס מבאס, עם סגל על הפנים. באופן אישי הייתה לי תקרית עם אחת ההגשות של הש\"ב באמצע הסמסטר שמנעה ממני בסופו של דבר לקבל את הבונוס שהובטח על להגיש את הכל. משהו שיכל להיפתר בקלות ולא באמת היה בעיה כלשהי אבל נתקלתי באפס התחשבות מצד הסגל מה שהוביל לכך שלא קיבלתי שום בונוס בעוד ששאר הקורס קיבל. זה רק מקרה אחד שמראה עד כמה לסגל לא באמת אכפת מהקורס או מהסטודנטים, אין לו רצון להעביר את החומר בצורה טובה או באמת לטפל בבעיות שחוזרות על עצמן בסמסטרים על גבי סמסטרים. נתונים חייבים לקחת את הקורס במילא אז זה לא באמת משנה מה אני או שאר המחזור שלי נגיד בביקורות, אבל ממש חבל שזה הרושם הראשוני שאנחנו מקבלים מהפקולטה שלנו. רק גם לי לתהות אם ההחלטה ללכת לתואר הזה ולא למדמ\"ח הייתה ההחלטה הנכונה.", "timestamp": 1646242052090}, {"author": "שלא נדע", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nיעקב גאון, וזאת בדיוק הבעיה.\nנושאים ורעיונות שמאוד מובנים מאליהם עבורו כ-על אדם אינם מובנים מאליהם עבור סטודנטים שנכנסים לראשונה לעולם הזה, ולכן בעיני החומר מועבר באופן מאוד שטחי ולא מעמיק. \nבנוסף, ברוב ההרצאות אין מתודולוגיה. פשוט מן מישמש של הוכחות שיעקב כותב על הלוח. קופצים מהוכחה להוכחה בלי לקבל איזושהי תמונה גדולה או הקשר של מה הוא בעצם מנסה ללמד אותנו. \nחשוב לומר - האווירה בהרצאות עצמן בסה\"כ נעימה, פשוט לא  מלמדת במיוחד. אין כאן מניע זדוני של יעקב או חוסר רצון שלו ללמד, הוא פשוט לא טוב בזה. \n\nשם המתרגל/ת: סאהר\nחוות דעת - תרגולים: \nרואים שסאהר יודע את החומר וטוב בו. \nבתרגולים עצמם כן חסר בעיני יותר עומק ופירוט במהלך פתרון שאלות (בהשוואה לקורסים כמו אינפי ואלגברה).\nבאופן כללי הרגיש שהתרגולים וההרצאות מנותקי קשר.\n\nשעורי הבית: מתישים ומעיקים, אבל תעשו ותקבלו את כל הבונוסים שאולי יצילו אתכם ממועד ב'.\nממליצה מאוד ללכת לשעות קבלה של סאהר סביב חורים בהבנה שיש לכם בשיעורי הבית. הוא מאוד אכפתי ומסביר מעולה אחד על אחד. \n\nהמבחן: \nמבחן בלתי צפוי שמורכב מ\"חידות\" קשות. לא באמת דומה למה שרואים בתרגולים והמבנה והחומר שמופיעים בו אקראי. מסוג הקורסים שבעיני אם עוברים במועד א', עדיף לא להסתכן בלשפר במועד ב', כי who knows מה ימציאו (וחלילה תמצאו את עצמכם חוזרים על הקורס).\n\nהשורה התחתונה: \nבאסה שהקורס הכי פחות מלמד ואיכותי בסמסטר הראשון ללימודים הוא זה שמועבר על ידי הפקולטה שלך.", "timestamp": 1646249235760}, {"author": "DS", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  יעקב\nחוות דעת - הרצאות: \nיעקב מאוד חכם ורואים שהוא מבין ושולט בחומר. הבעיה היא שהוא מעביר אותו בצורה יחסית משעעמת, ולשבת בהרצאה של 3 שעות איתו זה דבר קשה. ממליץ למי שיכול פשוט לראות את ההרצאות המוקלטות לחסוך לעצמו קצת זמן מהחיים.\n\nשם המתרגל/ת: אנה וסאהר \nחוות דעת - תרגולים: \nבחצי סמסטר הראשון הייתי אצל אנה. היא בסדר, אבל לפעמים מתבלבלת ולגעתי לא מעבירה את החומר בצורה טובה. גם היא בעיקר מקריאה מדף התרגול עם התשובות ולא עושה הרבה פתרונות לבד.\nסאהר לעומת זאת מסביר את החומר הרבה יותר טוב, מנסה שתבין אותו ופותר כל תרגיל מאפס. ממליץ\n\nשעורי הבית: \nגליון אחד כל שבוע. מרגיש קצת עמוס אבל אין מה לעשות, זה 10% מהציון. הגליונות לא קשים במיוחד, אבל צריך לשבת קצת זמן בשביל לפתור אותם. לנו עשו גם שמי שמגיש את כל הגליונות מקבל 3 נק בציון סופי.\nהמבחן: \nלא ברור מה יעקב חשב לעצמו שהוא לא נתן במועד א חצי מהחומר שנלמד. המבחן היה קשה, ומי שלא היה מוכן לחומר נפל קשה. בנוסף השאלות דיי לא קשורות לתרגולים או לשיעורי בית, וזה שאלות שיעקב ממציא כל שנה שצריכים טריקים שלא לומדים. המועד ב היה יותר קל, אבל המועד א היה זוועה.\n\nהשורה התחתונה:\nקורס נחמד, רק שהמבחן לא פרופורציונאלי למה שהיה כל הסמסטר. ממליץ למי שיכול לקחת פשוט Gool של דיסקרטית, כי רואים שמי שלקח קיבל ציון הרבה יותר טוב.", "timestamp": 1648622608464}, {"author": "Tom Bijaoui", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: יעקב בביצ׳נקו \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אנה ז׳וצ׳נקו\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1649657039361}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יעקב בביצ'נקו (העץ)\nחוות דעת - הרצאות: מרצים מתחלקים ל2 קבוצות : אלו שיודעים להעביר את החומר ואלו שנמצאים באותה קטגוריה עם יעקב.\n\nשם המתרגל/ת: אנה זוצנקו\nחוות דעת - תרגולים: התפוח לא נופל רחוק מהעץ.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: למצוא מקור אחר", "timestamp": 1653432083064}, {"author": "דיסקרטי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nדעה לא פופולרית אבל לדעתי מלכלכים על יעקב בצורה לא פרופורציונלית בכלל. הוא נותן אינטואיציה טובה לחומר, מסביר בהמון סבלנות והסיכומים שלו אמנם לא הכי אסתטיים אבל מסודרים ומאורגנים היטב. בנוסף ולא פחות חשוב הוא מעביר את החומר הזה בצורה שלדעתי יחסית מעניינת ועם המון דוגמאות. אין בקורס תחושת מרתון של חומר בכלל וזו אווירה נחמדה.\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: כנ\"ל לגבי הלכלוך המוגזם. אצל אנה אני כן רואה יותר מקום לשיפור מבחינת יותר עניין והבנה מעמיקה. היו מקרים שהיא התקשתה לענות על שאלות או לא נתנה תשובות מספקות. סה\"כ סבלנית, נחמדה, ועושה את עבודתה בצורה טובה. \n\nשעורי הבית: גליון שבועי, לא נוראי אבל גם לא מאוד דומה לשאלות ממבחנים.\n\nהמבחן: דומה למבחני עבר. אפילו אם מבינים את החומר נהדר- שווה להשקיע לא מעט בלהבין את סוג השאלות של יעקב. הרעיונות חוזרים על עצמם, ומצד שני הם לא פשוטים לשליפה מהמותן. בהצלחה ברקורסיה.\n\nהשורה התחתונה: מבוא חביב לכל מיני נושאים מעניינים במתמטיקה.", "timestamp": 1665000686161}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nניכר שיעקב אדם טוב ומשכיל מאוד. הוא משתדל לענות לכל סטודנט על השאלות גם אם זה על חשבון ההפסקה שלו או אחרי השיעור. לצערי כל ההרצאות מתנהלות בחוסר סדר קיצוני- לא ברור מה נלמד כהעשרה ומה בסילבוס, הרשימות שלפיהן הוא מלמד מלאות טעויות וכתב היד שלו לא ברור לא ברשימות ולא בלוח. גם האווירה בכיתה לא מאפשרת למידה כי הסטודנטים מהר מאוד מאבדים אותו ושואלים אחד את השני או כבר לגמרי מפסיקים להתעניין בשיעור. ההקלטות שלו במודל דווקא בסדר גמור, שם השיעור עובר בסדר הגיוני ולי היה יותר קל לעקוב אחריו.\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: \nאיתי מסביר מעולה את השאלות הכי קשות. תותח רציני בכל הקשור לחומר הנלמד.\nמצד שני לוקה בחסר בכל נושא הסדר והארגון- בטח כבר נאמר הכל על הטושים שלו... בנוסף כתב יד לא הכי קריא ולא בגודל אחיד ובכללי לוח לא מאורגן שעושה כאב ראש אחרי שעתיים של תרגול. תכלס הכי הפריע לי שאיתי קצת נחמד מידי מרגישים שהוא מתבייש להעיר לסטודנטים ויש מצבים שהכיתה רועשת מאוד בתרגולים שלו. כסטודנט אני מצפה ממנו לנהל את הכיתה ביותר אסרטיביות ואני לא חושב שדרוש המון ממנה בסוף כולנו ילדים גדולים (ועתודאים) שמספיק הערה אחת לסטודנט שמפריע כדי להשתיק את כולם.\nבשורה התחתונה אחרי שהייתי אצל כל המתרגלים אין לי ספק שאיתי הכי שולט בחומר ומעביר אותו בצורה הכי מובנת וזה מה שחשוב.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nתחום מרתק בעיני. ממליץ בחום לסטודנטים הבאים להעזר באתר קמפוס il בקורס של הטכניון \"מתמטיקה דיסקרטית למדעי המחשב\" לצד צפייה בשיעורים המוקלטים של יעקב. כמו להגיע לתרגולים", "timestamp": 1674325073094}, {"author": "שומשומית", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעקב בביצ'נקו (The one and only option:)\nחוות דעת - הרצאות: יעקב יודע את החומר טוב מאוד, להעביר אותו קצת פחות. באמצע הסמסטר בערך עברתי להרצאות המוקלטות במודל מהקורונה ובעיני זה יותר מוצלח. יש רשימות בכתב יד שהוא מעלה ובמוקלט הוא ממש עובר עליהן לפי הסדר ויודעים מה קשור למה, לעומת זאת בכיתה זה לא בדיוק לפי הסדר וקשה לעקוב. מה גם שההרצאה 3 שעות ברצף שזה בכלל מקשה על הריכוז.\n\nעוד בעיה היא שבמהלך התרגולים נשאלות לעיתים שאלות על ההרצאות ומהתרגל עונה שזה לא באמת חלק בחומר אלא העשרה שיעקב נתן כדי שנבין יותר טוב נושא מסוים (לפעמים זה באמת נדרש אבל לפעמים מיותר ומעצבן).\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: איתי יודע טוב את החומר, ורואים שהוא גם מתכונן לשיעור. הטושים שלו, הסדר וארגון על הלוח וכתב היד הקטן מקשים על הבנת התרגול, שגם ככה מאוד רועש.\n\nאיתי בא לקראת הסטודנטים. נוצר מצב שכל מי שלומד נתונים לא יכול להגיע לשעת קבלה לאחר השיעור כי יש שיעור אחר, אז איתי כמעט בכל שבוע הגיע קצת לפני השיעור כדי לענות על שאלות של הסטודנטים.\n\nיש רשימות לתרגולים שנכתבו במחשב בהן יש חזרה על החומר הרלוונטי בהרצאה והתרגילים.\n\nשעורי הבית:  שיעורי בית שבועים. אפשר לא להגיש 3 גיליונות אבל מאוד מומלץ כי כל ש\"ב נוסף שמגישים מעבר לנדרש זאת נקודה אחת תוספת לציון המבחן.\nשיעורי הבית מאוד חוזרים על עצמם משנים קודמות, ויש כמה רפרנסים (אם כי חשוב לשים לב שלא תמיד הם נכונים).\nשאלה אחת משיעורי הבית נבקת (לא בקפדנות יש לומר), ומקבלים ציון מספרי.\n\nהמבחן: עוד לא היה, אבל מההתרשמות שלי  מספיק להם לראות שהבנת את החומר ולא מדקדקים נגיד אם התחלת את הסיגמה מ0 במקום מ1 (מה שנגיד באינפי מאוד משנה).\n\nהשורה התחתונה: GOOL של דיסקרטית נחמד מאוד ויש סרטונים ביוטיוב \"מתמטיקה דיסקרטית למדעי המחשב\" עם הסברים טובים (אך לדעתי לא מספיקים).", "timestamp": 1675246491434}, {"author": "yanis", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nלא מצליח להבין את המרצה כלכך.. \n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: מתרגל מדהים. מעביר את החומר בצורה אינטואיטיבית \n\nשעורי הבית: הגליונות יותר קשים מהחומר הנלמד בתרגולים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675937116144}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעקב בביצ׳נקו\nחוות דעת - הרצאות: \nהילד גאון, אין מה להגיד, אבל גאון לא בהכרח אומר שהוא יודע ללמד. ההרצאות של יעקב היו לא ברורות. מאוד קשה לעקוב אחרי מה שהוא אומר והוא נוטה לקפוץ מדבר אחד לשני ללא הקשר. מהרצאה להרצאה ראו איך כמות האנשים שמגיעים אליה יורדת. ממליץ לעבור לצפות ביעקב בזום, גם ככה הוא לא מובן באותה המידה, אז לפחות זה קצת יותר מסודר.\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: \nאצל איתי האווירה הייתה טובה, אבל לא הרגשתי שהוא תמיד נותן לי אינטואיציה לפתירת התרגיל, אלא פשוט פותר את התרגיל בעצמו. לאיתי גם תמיד הייתה בעיה שלא היו לו טושים כותבים ובקושי. בתור סטודנט, זה נראה לי הכי המינימום שלו הוא צריך לדאוג. מעבר לזה, קיבלתי את הרושם שאיתי היה המתרגל הטוב ביותר מבין המתרגלים האחרים.\n\nשעורי הבית: \nלא בהכרח הולמים את מה שקורה בתרגולים עצמם ויכולים לקחת כמה שעות. כשהחומר נהיה קשה יותר מצאתי את עצמי מסתכל בדרייב עצמו על התשובות, לא כדי להבין את התשובה, אלא להבין מה השאלה בכלל רצתה.\n\nהשורה התחתונה: \nקורס נוראי. בעייני אם הסגל שלו היה יותר טוב ומשופף בהעברת החומר לאנשים שלא נולדו גאונים כמו יעקב, דברים היו נראים אחרת.", "timestamp": 1675980137750}, {"author": "liaaa", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: יעקב נחמד סה\"כ אבל לא ברור מאוד ולא תמיד מציע פתרונות מדויקים ומתמטיים לבעיות שמציג בכיתה.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: הייתי אצל כמה מתרגלים לפני אופק והוא חד משמעית הכי ברור. הוא דואג לעבור על חומר ההרצאה לפני שקופץ לתרגילים וזה מאוד עזר לי להתמיע את החומר- ממליצה בחום!!!!!\n\nשעורי הבית: לא קשים מדי, לרוב סיימתי אותם תוך 2-3 שעות\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676377706343}, {"author": "קנטור שרדר ברנשטיין", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: יעקב בחור מבריק ובאמת איש מקסים אבל בפן האישי קצת לי קשוח לשבת בהרצאה ולספוג את החומר ממנו עם קבוצה גדולה של סטודנטים \nחומר הקורס מבלבל ולפעמים ההסברים לא הכי מובנים אבל בעזרת האינטרנט וקצת עזרה מחברים הכל אפשרי \n\nשם המתרגל/ת: נועם \nחוות דעת - תרגולים: שרוף לבחור על הנשמה מסביר טוב וסבלני גם עם השאלות המטופשות (והיו לי הרבה)\nממליץ מאוד \nמתוך אילוצים של הקורס בסי יצא לי ללכת גם ל\n\nאיתי : שגם מסביר מעולה מאוד ממליץ \n\nשעורי הבית: מבלבלים מאוד אבל עוזרים לתרגול וחשוב לתרגל לא ממליץ לרפרנס יותר ממה שחייב כי זה מה שמכין באמת למבחן \nתשקיעו הרבה על עוצמות אוי ואבוי לי  \n\nהשורה התחתונה: קורס מענין, מבלבל, מסריט ולעיתים עוזר לשנצים והכי חשוב לזכור שלא לכולם \"קל לראות\" וזה בסדר לשאול שוב ושוב עד שתבינו ועל הז** כולם", "timestamp": 1676463464582}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: ליעקב יש ידע נרחב במתמטיקה ולפעמים כששואלים אותו שאלות שלא קשורות לנושא הנלמד הוא יכול להתפזר קצת וכדאי לדעתי להשאיר אותו בתחומי החומר הנלמד כי גם בלי להתפזר זה קורס לא כל כך פשוט.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מתרגל מעולה שמבין ומסביר את החומר בצורה פשוטה ועניינית.\n\nשעורי הבית: קשים \n\nהמבחן: \n\nהשורה התחתונה: קורס מהיותר קשים של הסמסטר הראשון צריך להשקיע המון", "timestamp": 1677582460983}, {"author": "מ ר", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: לא תענוג גדול. מעביר חומר בצורה לא אינטואיטיבית, מפוזרת ומסובכת יתר על המידה. ההרצאות גם ארוכות ובשעות לא כיפיות. שלא נדבר על העובדה שהוא המרצה היחיד בקורס.\n\nשם המתרגל/ת: אופק אברהם\nחוות דעת - תרגולים: מתרגל נהדר. בתחילת כל תרגול חזר קצת על החומר, ידע לענות על שאלות ולהסביר מה שצריך, סבלני וברור. נתן גם תרגילים רלוונטיים ותרגילים ממבחנים.\n\nשעורי הבית: גיליון פתוח אחת לשבוע. את האמת שהגליונות היו לרוב נחמדים.\n\nהמבחן: נורא. היו 5 שאלות שזה מוגזם ביחס לשנים קודמות וגם סטודנט אחר אמר לי שבאחת ההרצאות יעקב אמר בכלל שיהיו 4 שאלות.\n\nהשורה התחתונה: החומר מעניין, אבל הקורס לא מועבר בצורה הכי טובה בעיקר בגלל ההרצאות.", "timestamp": 1677699532407}, {"author": "דיסקרטי", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: מבולגן, לא יודע להעביר את החומר לסטודנטים(רק לגאונים שביניהם). הכל די נאמר בביקורות הקודמות.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים:  אחלה מתרגל, הייתי אצל פעמיים וגם הוא היה אחלה. הבעיה בתרגולים זה שהם ממוחזרים משנים קודמות ולא כל כך מותאמים לרמה של המבחן/ההרצאות. \n\nשעורי הבית: ממוחזרים משנים קודמות, הראשונים קלים וככל שמתקדמים בחומר הם קשים יותר. רובם מועתקים ממבחנים של המרצים הקודמים בקורס ולא כל כך מותאמים לרמה העדכנית ולדרישות של יעקב.\n\nהמבחן: היה נוראי! \n\nהשורה התחתונה: קורס קשה מאוד, הלוגיקה מאוד שונה מקורסים אחרים במתמטיקה ודרך החשיבה היא יותר בצורה של \"לפתור חידות\".  אם עברתם במועד א' לא חושב שכדאי לנסות לשפר...", "timestamp": 1677744527700}, {"author": "אלף שתיים", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nהוא מרצה סבבה, אבל ההרצאות די נמשכות הרבה זמן כשאפשר לראות אותן הרבה יותר מהר בהקלטה, וחוזרים על החומר בתרגול. כן הייתי ממליץ לעבור על ההרצאות במיוחד בנושאים האחרונים.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: \nמתרגל ממש טוב, מסביר טוב את החומר. בהתחלה עשה קצת טעויות אבל הוא הפסיק. התרגולים די זהים ברמה לשיעורי הבית אז כדאי ממש לראות אותם ולהיות בהם.\n\nשעורי הבית: \nלא קשים בכלל, וגם אם הם קשים הם ממוחזרים ממש, פשוט מספיק לקרוא את הפתרון של התרגול כדי להבין מה לעשות. ממליץ לתרגל טיפה יותר אחרי שיעורי הבית כי הם די קטנים ולא מכסים את החומר בכלל.\n\nהמבחן: \nדומה לרמה של מבחנים קודמים אבל קצת יותר מתחכם, הזהות הקומבינטורית הייתה טיפה יותר קשה ממה שהיה קודם, וחבל שלא היה מקום לתרגל דברים דומים לזה. \n\nהשורה התחתונה: \nקורס נחמד ומאוד לוגי, מרגיש קצת מאולץ אבל יכול להיות ממש כיף. רק תתרגלו טיפה יותר אחרי השיעור.", "timestamp": 1677746514643}, {"author": "למה אכלתי אמא", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: רוב ההרצאות על הפנים. יעקב יותר מידי חכם והוא לא מבין שמה שלו ברור ומובן לנו צריך להסביר. \n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: סה\"כ מתרגל סבבה אבל רץ יותר מידי וקשה לעקוב אחריו.\n\nשעורי הבית: גליון בשבוע. בהתחלה הגליונות ממש סבבה. אבל הגליונות האחרונים כמעט ולא פתירים.\n\nהמבחן: קשה כמו כל שאר המבחנים של יעקב. הוא תמיד מצליח להמציא שאלות חדשות כל מבחן כך שאי אפשר לעשות השערה של אילו נושאים יחזרו על עצמם. \n\nהשורה התחתונה: מבינה את החשיבות של הקורס אבל הקורס צריך להיות מותאם לרמה נורמטיבית.", "timestamp": 1677837685831}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעקב \nחוות דעת - הרצאות: זוועת עולם, לא יודע להרצות לא יודע להעביר את החומר. יש הקלטות שלו משנים קודמות אז אפשר לא להבין כלום בX2 לפחות.\n\nשם המתרגל/ת: אישית הייתי עם איתי אבל חד משמעית על כל המתרגלים הם נקודת האור היחידה בקורס הזבל הזה.\n\nשעורי הבית: לא משקפים שום רמה לא עוזרים להשתפר.\n\nהמבחן: יעקוב כהרגלו בנה מבחן לא מובן עם סעיפים לא פתירים שרק אנשים שהתמזל מזלם לרשום דברים דומים בדף נוסאחות הצליחו לפתור.\nהציון הסופי של המבחן מחושב בצורה הכי מפגרת שיכולה להיות:\nבעקרון 90 אחוז מבחן סופי, 10 אחוז ממוצע שיעורי בית + 3 נקודות למי שהגיש את כל התרגילים למרות שלא חובה.\nיעקוב \"הגאון\" החליט לשלב את ה10 אחוז הללו והשלוש נקודות לפני שהוא הסתכל על הפקטור של המבחן ורק לאחר השילוב של כל הנתונים האלה להעלות בהתאם לממוצע \"נורמלי\" המצב שיוצא בעצם שהעשר אחוז \"מגן\" של השיעורי בית הוריד לכולם עשר אחוז מהממוצע שאמור להיות במבחן ועל כן גם הוריד את הפקטור שהיה דרוש למבחן הזה (כמובן גם ללא חישוב 3 הנקודות. בקיצור זיין את כל מי שהכין הכל וזיין עוד יותר את מי שלא. \n\nהשורה התחתונה: רק בגלל הקורס הזה שווה לעבור פקולטה", "timestamp": 1678507368937}, {"author": "Bob", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: יעקוב \nיעקוב הכי גבר בעולם בלא להרצות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: רפרנסים \n\nהמבחן: הוגן וקל מאוד \n(ליעקב)\n\nהשורה התחתונה: קל לראות שכדאי לברוח", "timestamp": 1678651510385}, {"author": "סוודנט מנפגעי יעקב מוכר מביטוח לאומי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות:  אין\nשם המתרגל/ת: \nחוות דעת - תרגולים: gool\n\nשעורי הבית: gool\n\nהמבחן: החזר כספי מGool\n\nהשורה התחתונה: קצבה מביטוח לאומי", "timestamp": 1678712541084}, {"author": "o.k", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: יעקב לא כזה גרוע כמו שהרבה אומרים, בסך הכל אם תהיו מרוכזים בהרצאה ותקשיבו לכל מילה שלו תוכלו להבין פחות או יותר את החומר,הוא כן טיפה מתבלבל לפעמים ורץ בחומר אבל אפשרי להקשיב ולהבין בהרצאות.\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: איתי מתרגל נהדר, ממליץ מאוד.\n\nשעורי הבית: בגדול שיעורי הבית ברמה טיפה גבוהה יותר מהמבחן ובגלל זה גם הם כל כך חשובים, מה גם שמקבלים בונוס של 3 נקודות אם מגישים את כולם.\n\nהמבחן: זה טריקי , זה תלוי באיזה מצב רוח יעקב קם ביום שכתב את המבחן, יש מבחנים שאפשר לקרוא שאלה ולא להבין מה רוצים ממך ויש מבחנים יחסית קלים. \n\nהשורה התחתונה: קורס מעניין מאוד,עוזר לפתח את החשיבה ובנוסף כנראה הקורס המעניין ביותר מבין כל קורסי סמסטר א', ובנוסף ז גם קורס שאפשר בהחלט להוציא ציונים גבוהים מאוד , ממליץ להשקיע.", "timestamp": 1679329098759}, {"author": "קנטור שרדר ברנשטיין", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "המבחן: \nעשיתי מועד א היה טרגי וטראומתי \nהסקתי שיותר גרוע מזה לא יכול להיות \nאוי כמה שטעיתי \nקורס קשוח אפשרי אבל ממש קשה הפתרונות לא פותרים כלום במבחנים תצעדו בזהירות \nהשורה התחתונה: \nמי שעוד לא נרשם לקורס לדעתי שווה לבדוק את האופציה של לעשות את הקורס בפתוחה ולעץהעביר את הציון לפה החומר מועבר יותר טוב יש בחירה בין נושאים ומקבלי את הציון כבינארי של עשה/לא עשה ובשביל הממוצע שלכם זה מעולה שם זה ממוצע 80 90 \nבדקו את הנושא טוב טוב לפני הבחירה שלכם\nהלוואי היתי יכול לחזור ולעשות את זה בעצמי", "timestamp": 1679386635607}, {"author": "מקופף הבורקסים", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: שאלוהים ישמור אותכם מהמפגן של חוסר כריזמה משולב עם חומר מזעזע שאין דרך ללמוד אליו חוץ ממזל שיעקב קם על הצד החיובי שלו וכתב מבחן פייר.\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: לא וואו אבל אצלו עוד מבינים את החומר רק לא רואים את החומר כי הטושים לא עובדים באופן שיטתי אצלו.\n\nשעורי הבית: לא משהו מיוחד פשוט די מעצבן. המלצה שלי לא לדחות לסוף מנסיון שזה נגרר עד לשנייה האחרונה וגילוי עצמי של חוסר ידע ותסכול בעקבותיו.\n\nהמבחן: תתחילו להתפלל מעכשיו כי זה לפי מצב הרוח של יעקב.\n\nהשורה התחתונה: כל החומר שאמרו טוב אין מה להכניס לאלגברה או לאינפי או למדמח אמרו יאללה כוסאומו נפתח דיסקרטית. ליבי איתכם.", "timestamp": 1679502590239}, {"author": "הרוכל היהודי", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעקב \"אבל זה טריוויאלי\" בביצ'נקו\nחוות דעת - הרצאות: הרצאות מחרידות בצורה מפחידה. קל לראות שבביצ'נקו הוא פשוט אדם גאון בעל כריזמה של נעל וחסר כל יכולת לימודית. ההרצאות אצלו כוללות חומר מעורפל ולא ברור, ואחרי מספיק זמן שאנשים לא מבינים הוא טורח לחזור על הדברים שלכאורה היו \"טריוויאליים\", או להוסיף דברים שלא קשורים לחומר סתם כדי לבלבל את כולם. הקורס הזה גורם לי לרצות להיחנק מבורקס.\n\nשם המתרגל/ת: איתי הדר\nחוות דעת - תרגולים: איתי מתרגל בסדר סך הכל, הוא חייב לקנות חבילת טושים נורמלית, אבל חוץ מזה הוא אחלה.\n\nשעורי הבית: לא נחמדים במיוחד אבל לא זוועתיים. גליון אחד בשבוע, ופרט לזה שבביצ'נקו ניסה לעשות שטויות עם הציון של המטלות, לא היה נורא יותר מדי.\n\nהמבחן: מגעיל, מזוויע, מחריד ומעורר חלחלה. לא פתיר בשום אופן. סתם בשביל לסבר את האוזן, יש סוג שלם של שאלות שהדרך היחידה לפתור אותן היא בעזרת המצאה של סיפור, כי היחיד שיכול לפתור אותן אלגברית זה בביצ'ינקו, ואת זה אמרו המתרגלים..\n\nהשורה התחתונה: אין מילים בפי רק שאריות של בורקס. לברוח דחוףףף", "timestamp": 1679502938184}, {"author": "S", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעקב \nחוות דעת - הרצאות: מה עוד נותר לומר. קורס קשה, חומר קשה, סינית. עד כאן לגיטימי בטכניון. הבעיה מתחילה כשיעקב לא מבין שאנחנו לא חושבים כמוהו ולא \"קל לנו לראות\" בכלל שום דבר. זה לא אישי, הוא פשוט לא יודע ללמד. תראו את ההקלטות שלו, זה אחד לאחד אותו דבר. וקחו בחשבון שהרשימות שלו מלאות בטעויות שהוא מתקן תוך כדי השיעור אבל לא מעלה חדשות.\n\nשם המתרגל/ת: נועם זאיל\nחוות דעת - תרגולים: בהתחלה לא התחברתי לנועם (יחד עם ההלם מהחומר של הקורס). עם הזמן כמות הסטודנטים פחתה וגם גיליתי שנועם באמת אחלה, הוא עונה על כל השאלות וזורם עם הסטודנטים. תכלס הוא עשה מה שהוא יכול ביחס לקורס הנוראי הזה, וביחס לפעם ראשונה שהוא מתרגל זה היה סבבה.\n\nשעורי הבית: כל שבוע גליון- מעיק של החיים! תנסו לרפרנס למרות שלא הכל נכון שם, וגם רוב השאלות לא היו ממוחזרות והם בנו גליונות מקוריים. בסוף זה כן עוזר להבנה אבל כמה כבר אפשר להבין דיסקרטית? (אולי רק עתודאים, לא יודעת)\n\nהמבחן: קשה עד בלתי פתיר. פיתחו לנו ציפיות כשאמרו שהיו נותנים בו פקטורים גבוהים בעבר. בפועל בשני המועדים היה 7 נק פקטור למרות שהממוצע היה רחוק מעובר במועד ב. במועד ב הם גם קטלו בבדיקה ולא נתנו אפילו חלקי נקודות אם צדקת חלקית. \n\nהשורה התחתונה: תפילות לכל האלים והפסלים, פק\"ל ונשימות עמוקות", "timestamp": 1680555026964}, {"author": "סטודנט א'", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד\"ר נדב חלק\nחוות דעת - הרצאות: מאוד מסודר, הולך לפי רשימות שהעלה למודל. אין לו בעיה להתעכב לענות על שאלות של סטודנטים במהלך ההרצאה ורואים שאכפת לו מאיתנו.\n\nשם המתרגל/ת: אופק אברהם\nחוות דעת - תרגולים: אופק ונדב מאוד דומים בשיטת ההוראה, רק שהתרגול הוא יותר פרקטי בשביל התרגילי בית והמבחן.\nאופק נהג לדבר אלינו בגובה העיניים והשקיע בנו, גם אם זה אומר שהוא יצטרך להישאר לשעות קבלה ואפילו מעבר ולפתור תרגילים שלא יתכונן עליהם.\n\nשעורי הבית: בהתחלה בסדר, אולם אחרי שלומדים עוצמות זה מתחיל להסתבך.\n\nהמבחן: המבנה של המבחן של נדב שונה מאוד מזה של יעקב. המון סעיפים שמצד אחד זה טוב כי ניתן ככה לאסוף נקודות, אולם מצד שני המבחן מרגיש מאוד עמוס וקשה לסיים אותו בזמן.\n\nהשורה התחתונה: הקורס נותן בסיס לשפה המתמטית שמשתמשים בה כנראה כמעט בכל קורס שנעשה בתואר שלנו, אז מומלץ להפיק ממנו כמה שיותר. למשל, כבר בקורס הנדסת תוכנה רואים שימוש ביחסים שנלמדו בדיסקרטית.", "timestamp": 1692948789374}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: מסביר טוב ומסודר\n\nשם המתרגל/ת: אופק אברהם\nחוות דעת - תרגולים: מעולה, מעביר את התרגולים בצורה טובה ונותן יחס לכל שאלה וסטודנט\n\nשעורי הבית: קשים אבל לא כל כך ארוכים, יש רפרנס כמעט להכל\n\nהמבחן: קשה ברמות לא סבירות, ארוך מדי בלתי אפשרי לסיום, כשקוראים את השאלות במבט ראשון הן נראות בסדר ואז שבאמת מנסים לפתור הן קשות מאוד. רק הסעיפים הראשונים סבירים אבל הם גם קצת נקודות אז זה לא ממש עוזר. \n\nהשורה התחתונה: קורס קשה והמבחנים בשנים האחרונות קשים ולא מובנים כלל", "timestamp": 1703785230360}, {"author": "Aaa", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: \nמרצה מטורף\nשם המתרגל/ת:\nחוות דעת - תרגולים: \n\nשעורי הבית: \nלפעמים היו קצת קשים\nהמבחן: \n\nהשורה התחתונה: המרצה הכי טוב שהיה לי הסמסטר", "timestamp": 1714036636297}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גל מנדלסון המלך\nחוות דעת - הרצאות: הרצאות מעולות, גל פשוט תותח על ומגיע לו כל הקרדיט שבעולם. \n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: היה אלוף, אחלה תרגולים\n\nשעורי הבית: כבדדד. כל שבוע גיליון שלוקח ים זמן. אבל להגנתם זה חומר שממש קשה להפנים עד שלא יושבים עליו כמה שעות טובות\n\nהמבחן: \n\nהשורה התחתונה: \nאחלה קורס", "timestamp": 1714746865291}, {"author": "AAA", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: מרצה הכי טוב בפער שהיה לי הסמסטר  פשוט תותח על בלהסביר ובלהיות נחמד ואכפתי.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: \nמתרגל כמו המרצה, הכי טוב שהיה לי הסמסטר מלמד בגובה העיינים ומסביר דברים מורכבים בפשטות בצורה שזוכרים איך לגשת לתרגילים אחרי זה.\nשעורי הבית: חשובים, גיליון לוקח יום אז תפנו לזה יום בסופש לדעתי . הם די קלים עד עוצמות, בשביל לא להרגיש לחץ בעוצמות הייתי ממליץ לתרגל גם מבחנים משנים קודמות כבר קצת שתתרגלו לרמה וגם לחזור שוב על התרגולים ולהשקיע בחלק הזה. \n\nהמבחן: \nשונה שנים קודמות, ארוך ולא קל אבל כן הוגן.\nהשורה התחתונה: \nהקורס האהוב עליי עם המרצה והמתרגל האהובים עליי.", "timestamp": 1715925641449}, {"author": "..", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: מרצה מעולה. אכפת לו מהסטודנטים והוא משתדל שיהיה מעניין. מומלץ להיות בהרצאות גם אם הסיכומים שהוא מעלה טובים. (פרוטיפ: אם עוצמים עיניים הוא נשמע בדיוק כמו יונתן ברק)\n\nשם המתרגל/ת: אופק אברהם\nחוות דעת - תרגולים: היה מתרגל מעולה, הסביר יפה איך לפתור שאלות.\n\nשעורי הבית: קצת מייגעים אבל לא גרועים מדי, יש רפרנסים\n\nהמבחן: לא קל אבל הוגן\n\nהשורה התחתונה: כנראה הקורס הכי מעניין בסמסטר א'", "timestamp": 1715950964506}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: מרצה מעולה, סופר נחמד ואכפתי ומנסה שכולם יבינו. הוא חדש וחסר ניסיון אז לא תמיד הוא הסביר טוב (נגיד קומבינטוריקה) אבל אני בטוח שהוא ישתפר ככל שיהיה לו יותר ניסיון\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים:  מתרגל מדהים, כל מה שלא הבנתי או פספסתי בהרצאות הוא הסביר בתרגול, נתן שיטות וטריקים לפתרון ודגשים\nשעורי הבית: לא מאוד קשים, חוץ מהגיליון השני של עוצמות שהיה סיוט. יש רפרנסים להכל והחל מהגיליון השביעי הם לא בדקו בכלל לדעתי ונתנו 100 אוטומטי לכל מי שהגיש\n\nהמבחן: מפחיד וארוך, אבל אם נלחמים ולא מוותרים אפשר להצליח הכל \n\nהשורה התחתונה: אחלה קורס, אחלה סגל", "timestamp": 1716113127695}, {"author": "abc", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: גל מרצה מדהים, הוא ממש השקיע בקורס במצגות ובשעות קבלה שהוא עשה ועזר מאד להבין את החשיבה שנדרשת לקורס.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: אופק היה מתרגל מדהים, הכי טוב שהיה לי הסמסטר, הסביר מעולה את החומר וסגר פינות מההרצאה שלא ישבו עד הסוף\n\nשעורי הבית: די קשים וארוכים, גיליון כל שבוע\n\nהמבחן: המבחן לא היה פשוט ודי ארוך אבל סה\"כ הוגן\n\nהשורה התחתונה: קורס באמת מרתק ועם צוות כמו גל ואופק בכלל חוויה", "timestamp": 1717015156085}, {"author": "נתונים", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: גל היה המרצה הכי טוב שהיה לי הסמסטר. אומנם הוא חדש יחסית ולקח לו הרבה זמן להבין איך משתלטים על כיתה, אבל הוא עושה את מיטב המאמצים להנגיש את החומר, להסביר כל דבר, מפרסם רשימות לפני ההרצאה. אכפת לו מהתלמידים מעבר לקורס שלו ספציפית, והוא הקדיש מספר שיעורים לדבר איתנו על דרכי למידה, היערכות לתקופת מבחנים וכד'.\n\nשם המתרגל/ת: נעם זאיל\nחוות דעת - תרגולים: נעם מתרגל מעולה, חושב שאין הבדל משמעותי בינו לבין אופק אבל בפועל היינו 15 איש בתרגולים שלו והיחס האישי עושה את כל ההבדל לעומת התרגולים המפוצצים של אופק.\n\nשעורי הבית: מתחילים סבבה, אבל בערך מת\"ב 6 לא קלים בכלל. ממליץ להשקיע בהם כי בודקים אותם באמת, וזאת הדרך הכי טובה להפנים את החומר.\n\nהמבחן: לא קל אבל סה\"כ הוגן, כנראה הפער העיקרי היה זמן - הרבה אנשים לא הספיקו לסיים אותו. בנוסף גל נתן 10 נקודות פקטור כי הממוצע היה 45.\n\nהשורה התחתונה: קורס לא קל אבל לא הכי קשה, ממה שמספרים ההבדל בין גל לבין מרצים בשנים קודמות משמעותי ואני שמח שיצא לי ללמוד ממנו.", "timestamp": 1717048864695}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  גל מנדלסון\nחוות דעת - הרצאות:  מרצה מעולה!! מעביר את החומר בצורה הדרגתית ועונה לשאלות בסבלנות ובצורה מעמיקה.\nאכפתי מאוד לסטודנטים והעביר לאורך כל הסמסטר שתי שעות קבלה כדי שכלל הסטודנטים יוכלו להגיע. \n\nשם המתרגל/ת:  אופק אברהם\nחוות דעת - תרגולים:  אופק מתרגל מצויין, יודע לפשט גם את החומר הכי מורכב ומסביר בכמה אופנים עד שהרוב מבינים. \n\nשעורי הבית: \nהיו המון הגשות - הגשה כל שבוע והשיעורים היו קשים מאוד \nהמבחן: \nהמבחן היה קשה מאוד מאוד ושונה מאוד במבנה  משאר המבחנים (זו הייתה השנה הראשונה של המרצה)\nהשורה התחתונה: \nקורס קשה מאוד אבל אפשר לעבור אותו אם מקשיבים בהרצאות ובתרגולים, פותרים את הגיליונות כל שבוע ומגיעים לשעות קבלה באופן קבוע.", "timestamp": 1717070329842}, {"author": "nn", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גל מנדלסון\nחוות דעת - הרצאות: \nמרצה ממש טוב, עונה לשאלות בכבוד ומסביר ומבין את החומר מצוין, חלק מהמצגות המושקעות ביותר שראיתי, מחזק כמה באמת היה אכפת לו מהסטודנטים\nשם המתרגל/ת: \nאופק-חזר לצבא אז לא ככ רלוונטי, אבל מתרגל ממש טוב, עוזר לחומר לשבת בראש בצורה ברורה\n\n\nשעורי הבית: \nלא כאלה קשים, לרוב נופלים על טעויות כתיבה וכאלה, אך לא לזלזל חשוב לעשות אותם להבין את החומר!\n\nהמבחן: \nבניגוד לרושם מההיסטוגרמה, אם הבנתם את החומר של הקורס אין סיבה לא לקבל בו מעל 85, המבחן היה הוגן וכיסה את כל החומר של הגוף, בצורה דומה למבחני עבר. \nדגשים לאנשים שקוראים את זה לקראת המבחן:\nתכינו דף נוסחאות טוב, כולל את כל הנושאים בקורס\nתמיד יהיה שאלה עם הכלה והפרדה, תבדקו את עצמכם\n\nהשורה התחתונה: \nקורס נחמד, נותן בסיס כמעט לכל שאר הקורסים", "timestamp": 1717317500058}, {"author": "αβγδ", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גל\nחוות דעת - הרצאות: המרצה הכי טוב שהיה לי\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי \n\nשעורי הבית: כל שבוע יש גיליון , יש רפרנס להכל \n\nהמבחן: היה מבחן קשה יחסית ומאוד ארוך, יש להתכונן למבחנים ארוכים שלא נגמרים \n\nהשורה התחתונה: חרא של קורס, אבל הסגל הוא אחלה", "timestamp": 1718363870472}]}