{"posts": [{"author": "בנימין ידיד השם", "difficultyRank": 2, "generalRank": 4, "semester": "201901", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה טוב מקצועית, לא סימפטי ולא מתחשב בכלל. ההרצאות מאוד מעניינות אבל רובן קשות להבנה.\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: מתרגל גרוע, עדיף לקרוא לבד את התרגול,. המתרגל לא מועיל בכלל, לא עוזר ולא יודע את החומר\n\nשעורי הבית: חשובים, מעניינים אבל יש שאלות קשות\n\nהמבחן: קשה! לא הוגן אין זמן לעשות את כולו, המרצה לא מתחשב בכלל\n\nהשורה התחתונה: קורס עם חומר מאוד מעניין אבל קשה עם סגל קורס לא מתחשב. המרצה מסביר טוב אבל המתרגל גרוע", "timestamp": 1597829612756}, {"author": "מישהו", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות:\n\nסמסטר זום:\nבתור מרצה הוא מעביר את החומר טוב, מוסיף עניין ואוהב לחבר אותנו למשמעות של הנושאים המאוד (מאוד) לא פשוטים.\nהבנתי מסטודנטים שלקחו אצלו קורסים בסמסטר רגיל שהכתב שלו הוא האתגר הענקי.\nבאופן כללי, יש הרצאות מעניינות יותר ויש פחות. בממוצע שמחתי להגיע לשיעורים כי רמת ההוראה הייתה גבוהה. \n\nשם המתרגל/ת:  עידו\nחוות דעת - תרגולים:\nלדעתי התרגולים קצת פיספסו את הפואנטה שלהם, בתרגול אתה אמור לחזור על החומר ולראות קצת התחכחות עם תרגילים. במקום אנחנו קיבלנו משפטים נוספים וחומר נוסף שלא הוזכר כלל בהרצאה. \nהתרגילים שכן פתרנו היו ברמה נמוכה מאוד ולא משתקפת בכלל בשיעורי הבית או בהתכוננות למבחנים. \n\nשעורי הבית: \nמי שמצליח את השיעורי בית לבד לגמרי כנראה מצטיין נשיא, קשים מאוד וכמעט תמיד יש תרגיל אחד לפחות שאין סיכוי לפתור. מרגיש שלפתור אותם דורש נסיון של כמה סמסטרים טובים מלאים באלגברה לינארית בשביל להצליח.\n\nהמבחן: \nקשוח מאוד, ודורש הבנה עמוקה מאוד\nהשורה התחתונה: קורס מעניין מאוד ולפי תחושתי הרגיש לי כם חשוב מאוד. קשה קשה אבל צריך לגמור איתו", "timestamp": 1612796201950}, {"author": "~", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: ההרצאת עמוסות בחומר ודן באמת עושה הרבה בשביל להעביר אותו בצורה טובה. מרגיש שיש פער בין מה שהוא מצפה שנדע מאלגברה 1 למה שרוב הסטודנטים יודעים וזה גורם לתסכול כשהרבה פעמים דדברים מבחינתו טריוויאליים.\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: התרגולים לפעמים באים בנוסף להרצאה ולא בשביל לתמוך בהרצאות ונוצר פער שגר אצלנו לתרגול נוסף במהלך הסמסטר. עידו מעביר את החומר בצורה ברורה ועונה לשאלות של הסטודנטים\n\nשעורי הבית: \nעמוסים ולפעמים עם משימה תכנותית שלרוב לא קשה אבל כן דורשת זמן\nהמבחן: \nהיה מבחן קשה מאוד ואחרי פקטור של 21 נקודות עדיין הממוצע על עובר בקושי (57)\nהשורה התחתונה: קורס עמוס מאוד, קשה אבל חשוב", "timestamp": 1614076734318}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה בצורה טובה מאוד, למרות שיש המון דברים שנראים בעיניו כטריוויאלים מאוד למרות שבפועל הם קשים מאוד להבנה.\n\nשם המתרגל/ת: עידו בוצר\nחוות דעת - תרגולים: מתרגל נחמד במוכן לעשות המון ולהשקיע בסטודנטים, אבל עם כל הרצון הטוב, בתכלס התרגולים לא הועילו יותר מידי\n\nשעורי הבית:  קשים מאוד ולוקחים דיי הרבה זמן, מומלץ מאוד(!) לפתור אותם לבד ובלי רפרנס כי בסמסטרים רגילים בערך 30 נק מהמבחן הם שאלות ש.ב.\n\nהמבחן: קשה בטירוף, אין זמן לכלום, תצטרכו להחליט על איזה שאלות לענות ועל איזה לוותר- בסמסטר שלי היה ממוצע של 57 בערך אחרי פקטור ענקי של למעלה מ20 נק'.\n\nהשורה התחתונה:  קורס קשה מאוד, אם הוא לא חובה במומלצת שלכם אל תתקרבו", "timestamp": 1625129986130}, {"author": "Lightning Shepard", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nדן מאוד בקיא בחומר, גורם לחומר סופר מתמטי להיות מעניין, ומסביר טוב קונספטים מורכבים.\nחשוב לציין מנגד שיש לו באופן קבוע טעויות במצגות שלו, שנראה שאינו מתקן בין שנה לשנה, וזה מאוד מבלבל ולעיתים מעכב את השיעור. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עידו בוצר\nעידו לא הורגש כל כך.\nהתרגולים קצרים ולא מוסיפים במיוחד, ועידו לא מספיק כריזמטי ליצור עניין.\n\nהמבחן: \nלא קרה עדיין, נקווה לטוב...\n\nהשורה התחתונה: \nשיטות קורס מעניין ודן מרצה מעולה. הבעיה שהקורס מנוהל ממש ממש רע.\nהבעיה העיקרית היא ההגשות, הן בנויות מזעזע (ועם לא קצת שאלות פגומות, כלומר שיש טעויות בתוך השאלות). הרמת קושי של השאלות ממש גבוהה, והן לרוב ניתנות ללא הדרכה או חלוקה לסעיפים, אז אלא אם אתם גאוני הדור, גם אתם כמו כולם בשלב מסוים תתחילו ללמוד מהרפרנס.\nממליץ לקחת את הקורס במקביל ללמידה חישובית 1, שכן באופן מפתיע, הרבה מהעקרונות של הקורס יותר קלים להבנה עם חומר שנלמד בלמידה חישובית 1.\nאם באמת אכפת לכם להבין את המתמטיקה לעומק, שימו לב שיש נקודות מסוימות שבמקרה הטוב מועברות באופן מבלבל, ובמקרה הרע באופן שגוי לחלוטין (אם מועברות בכלל), אז לרוב תצטרכו לעשות double check להרבה מהמונחים וההגדרות באינטרנט. \nבהצלחה.", "timestamp": 1642284974132}, {"author": "סטודנטית מיואשת", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מעולה, החומר באמת מרגיש חשוב ורלוונטי לתואר,  ודן מעביר אותו באופן ברור.\n\nשם המתרגל/ת: אור מרקובצקי\nחוות דעת - תרגולים: מתרגלת טובה, חשוב לה שיבינו את החומר ותמיד מוכנה להסביר מעבר. הבעיה היחידה זה שהתרגולים הם רק שעה, וזה לא מספיק זמן בשביל קורס כזה כבד. \n\nשעורי הבית: קשים מאוד, הרפרנס הוא החבר הכי טוב שלך. \nדורשים הרבה הבנה של החומר. \n\nהמבחן:  המבחן מאוד קשה, דן דורש הבנה עמוקה של החומר ואין מספיק זמן כדי לענות על הכל. \n\nהשורה התחתונה: קורס חשוב אבל קשוח", "timestamp": 1643705007179}, {"author": "מטריצה נשלטת אלכסונית", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן מלך על (יש קטץ'), מעביר את החומר בצורה מאוד מעניינת, ובכללי החומר באמת מעניין מאוד. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אפס רלוונטיות של התרגולים למבחן. כמעט כל התרגולים התיחסו לחישובים ובפועל במבחן מועד א חורף 2022 היו 0(!) תרגילים שדרשו משהו חישובי שנלמד בתרגול. הם חשובים אבל עם ספק. \n\nשעורי הבית: וואעליה. \nמכירים את זה שאומרים אל תרפרנסו כי זה יפגע בכם במבחן כי הוא מתבסס עליו וחארטה כזה או אחר? אז לא כאן! תרפרנסו בלי להתבייש! גם הטובים ביותר שפתרו הכל לבד כל הסמסטר וגם אלו שרפרנסו- נפלו כמו זבובים. לכן חבל על הזמן שלכם, הרפרנס באמת יהיה יד ימינכם.\n\nהמבחן: וווווווווווווווווווווווווווווווווווווווואו. מה זה החרא הזה. \nכאילו כל מחזור מישהו קם ובוכה והמחזור מתחת בא ואומר 'נו באמת איזה מחזור חלש כמה בכי עברנו אינפי 1מ נעבור גם את זה' אז תוציאו את הראש מהתחת שלכם, אם אלונים בכו ופרסמו ממים בקבוצה של כישלון מוחץ אז תבינו מה קורה. מדובר במבחן שגם אנשים עם ממוצע 99 בתואר והארכת זמן לא יסיימו. אני מדברת איתכם על ממוצע 25-35 בטופס. \n\n\nהשורה התחתונה: תשקיעו בהבנה בהרצאות!!! \nתרפרנסו את חייכם ואל תמותו כי לא הבנתם איך פתרו תרגיל מסוים. \nאם יש לכם שאלות שיעורי בית במבחן ואתם תוהים לעצמכם- \"אה, השאלה הזו בטח לא תהיה\"- היא תהיה!!!!!!!!!!!!!!!!!!! מרפי.\nבקיצור, קורס קשוח מאוד אבל הכי מעניין עד כה בתואר. הכינו את עצמכם לנורא מכל.", "timestamp": 1643818416589}, {"author": "נורמת פורביניוס", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות:  יש האומרים שהוא מרצה טוב, אבל בעיני מרצה נמדד בין היתר ביכולת כתיבת המבחן שלו והיא ללא ספק מזעזעת\n\nשם המתרגל/ת: עידו בוצר/אור \nחוות דעת - תרגולים: לא מספיק מעמיקים בחומר\n\nשעורי הבית: קשים מאוד, מתוך גיליון של 5 שאלות אפשר לעשות 2 בלחץ בלי רפרנס\n\nהמבחן: \nכל קשר בין מה שנלמד בקורס למבחן מקרי בהחלט.\nלהתרחק מהקורס הזה כמו מאש אלא אם הוא חובה ואז באסה.\nכבר ראינו מבחנים קשים בטכניון, ראינו קורסים קשים, אבל במשהו כזה עוד לא נתקלנו. אפילו היסטוגרמה לא העלו  כדי לא להראות את התפלגות הציונים המזעזעת. מישהו בפקולטה לתעשייה וניהול צריך לעשות בדק בית רציני כי לא ייתכן שהקורס ממשיך להתנהל בצורה כזאת.\nהשורה התחתונה: \nבהצלחה למנחשים", "timestamp": 1644842454043}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מבחינת איכות ההוראה, הוא ממש טוב. המצגות שלו מסודרות יחסית למעט טעויות מתמטיות פה ושם והוא יודע להסביר את החומר. יש הרבה מעברים מתמטיים שאם לא שואלים הוא לא מסביר אז תדאגו לעקוב אחרי מה שהוא אומר\n\nשם המתרגל/ת: אור מרקובצקי \nחוות דעת - תרגולים: אחלה מתרגלת. יודעת את החומר ותמיד נתנה את האינטואיציה כדי להבין אותו טוב יותר.\nאין מספיק שעות תרגול (רק שעה בשבוע) וזה גורם לזה שלא מספיקים את התרגול או שפשוט טסים על החומר ואז הרבה אנשים יוצאים מבולבלים. מציע לכם להשלים פערים בשעות הקבלה. ה PDF של התרגולים פשוט מזעזע, בתרגולים שלנו לא נגענו בו כי יש בו מלא טעויות. \n\nשעורי הבית: עמוסים מאוד וקשים מאוד. אין מה לרפרנס מהפתרונות ה \"רשמיים\" משנים קודמות כי או שיש בהם טעויות שהוכנסו בכוונה כדי לבדוק מי מעתיק ומי לא או שאתה לא מבין בכלל את המעברים שם. \n\nהמבחן: מזעזע. היו מבחנים קשים בטכניון ועברנו אינפי 1 ו 2 והכל טוב ויפה. עד שהגיע המבחן בשיטות. לא קשור בכלל למה שלמדנו, פי כמה וכמה רמות מהתרגולים ובקיצור גם התותחים אצלנו הוציאו במבחן יבש רק איזה 50 גג. ההיסטוגרמה תדבר בעד עצמה אבל הפקטור שנתנו לנו היה פסיכי: חלק מהשאלות הכפילו ב1.4 את הניקוד וחלק 1.2. בנוסף לזה הוסיפו 8 נקודות וגם יש 15 אחוז תקף שיעורי בית. \n\nהשורה התחתונה: מצד אחד הקורס מאוד מעניין כי הוא מדבר על דברים שעושים בתעשייה. מצד שני, הוא קשה מאוד ועמוס אז תשקיעו בו. הסגל לא מתואם ודן לפעמים סותר דברים שנאמרים בתרגול או להפך וזה מתסכל. תהיו על החומר כל הסמסטר ותחזרו על ההרצאות כל סופש, ואל תתבאסו אם ילך לא טוב במבחן, קרה לכולנו.", "timestamp": 1645267458629}, {"author": "דוד", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דן\nחוות דעת - הרצאות: ארוכות וקשות. מרצה סבבה לא עונה יותר מידי לשאלות.\n\nשם המתרגל/ת: אוק מרקובאצקי\nחוות דעת - תרגולים: מתרגלת גרועה, יודעת להעביר רק מה שרשום לה בדף, שואלים אותה יותר לעומק ואין מענה רציני. לא הכנה טובה למבחן.\n\nשעורי הבית: קשים וארוכים יש רפרנס\n\nהמבחן: קשה! ולא הוגן!\n\nהשורה התחתונה: קשה!", "timestamp": 1646385979113}, {"author": "KCAH", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מעולה, מסביר טוב את החומר. החומר מאוד מעניין. מזהיר משימוש יתר במונח \"קל לראות\" ו/או \"טריוויאלי\".\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מתרגלת מושללמממתת, כל הזמן דואגת שנבין את החומר.\n\nשעורי הבית: פשוט לא פתירים. את חלק מהשאלות הייתי צריך שיפתרו איתי כמה וכמה פעמים עד שהצלחתי לפתור לבד.\n\nהמבחן: אני חושב שפקטור כפלי של 1.3 (בממוצע) ואדטיבי של 8 מדבר בעד עצמו.\nיש במבחן גם חלק שאלות שיעורי בית (לא שהן קלות מי יודע מה, אבל אפשר לשנן בהחלט).\n\nהשורה התחתונה: חומר מעניין, סגל טוב, מבחן שמרגיש כמו קובץ שאלות פתוחות במתמטיקה.", "timestamp": 1646821198646}, {"author": "מנצחים את גרבר", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מעניין ברמות. דן מעביר את ההרצאות עם התלהבות רבה והחומר אומנם קשה להבנה ומתמטי מאוד אך מאוד יסודי לעולם של MACHINE LEARNING. אין הרבה מרצים ששווה לקום להרצאה שלהם ב8:30 בבוקר, אך דן אחד מהם. חשוב לציין שההקלטות שלו הרבה פחות טובות בעיני. \n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: קורס מאוד מאוד קשה לתרגל,וליבי עם אור. שעה תרגול רק בשבוע שבו לומדים חומר חדש לרוב. במבט לאחור התרגולים לא מאוד חשובים מכיוון שמעובר בהם חומר יותר טכני שבדרך כלל לא מופיע במבחן. בכל מקרה, אור מעולה ומאוד חדה על החומר. מיוזמתה לקראת המבחן עשתה תרגולים של שעתיים. לא מובן מאליו בכלל ומאוד מוערך. \n\nשעורי הבית: גליונות יבשים של הוכחות מתמטיות עם תרגילים בודדים בפייתון. הגליונות מאוד קשים אך פתירים בסופו של דבר. מה שיפה מאוד בקורס הזה שחלק מהבעיות שמופיעים בתרגילי הבית מופיעות לפני כן בהרצאה וככה הם מקבלים מקום מאוד רלוונטי. לחזור על ההרצאה הרבה פעמים מאוד עוזר להבנה של החומר ולפתירה שלהם. בנוסף היו כמה תרגילי תכנות בפייטון שמאוד מגניבים וחבל שאין יותר תרגילים כאלה. \n\nהמבחן: מבחן נורא קשה. צריך להחליט על מה אתה עונה ומה לא. אני מאוד ממליץ אם יש לכם זמן לחזור על ההרצאות שוב לפני המבחן. אין המון מבחני עבר אך כל מבחן עבר לוקח בערך 5 שעות לפתור אם לא יותר. בסוף תענו כמה שיותר במבחן ותשלשלו חופשי, קונים את זה בקורס הזה. \n\nהשורה התחתונה: קורס נורא מעניין אך נורא מאתגר", "timestamp": 1648077106282}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דן\nחוות דעת - הרצאות: יכלות למידה של דן סה\"כ בסדר, עוד יותר ביחס לפקולטה \n\nשם המתרגל/ת: אור \nחוות דעת - תרגולים: מתרגלת ממש טובה, קצת רצה אבל מה לעשות, אין מספיק זמן תרגול. מאד רוצה לעזור \n\nשעורי הבית: קשים מאד אבל הרוב זה שאלות ממבחנים אז לפחות זה מכין \n\nהמבחן: קשה מאד מאד תמיד. העיקר שיש פקטור כך שאף אחד לא מגלה שכל מבחן הוא עם ממוצע 30 וחצי מבחן לא פתיר בשום צורה\n\nהשורה התחתונה: הקורס הוא באמת חשוב. הבעיה פה היא שיש פשוט יותר מדיי חומר, אז בהרצאות אין דוגמאות, וגם לא מספיקים הכל. אז השעה היחידה לתרגול מוקדש להוכחת עוד משפטים שלא הספיקו להרצאה, ואז אין הזמנות לא לראות דוגמאות ולא לתרגל. אז ההזדמנות היחידה לתרגל זה תרגילי בית, שהם ברמה של המבחנים, ואז פשוט לא מבינים כלום. אז באים למבחן, קורסים ויש ממוצע 30. סה\"כ כיף", "timestamp": 1649575879072}, {"author": "פניקס", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מאוד טוב, בין הטובים בפקולטה מבחינת ידע ורמת הוראה. חומר מאוד חשוב ומעניין. מפריז בשימוש המילה טריוויאלי שקצת פחות טריוויאלים לסטודנטים בתחילת התואר. במצגות יש פה ושם טעויות קטנות שצריך לשים לב\n\nשם המתרגל/ת: עידו בוצר במוקלט / PDF\nחוות דעת - תרגולים: לא מספיקים לכלום, לרוב יש צורך להשלים לבד מPDF שיש בהם המון טעויות שנגררות משנה לשנה ללא תיקונים. \n\nשעורי הבית: קשים, לרוב גם בפתרונות שמועלים יש הרבה טעויות מה שמאוד מקשה על הלמידה מש.ב ולמידה למבחן.\n\nהמבחן: קשה מאוד וארוך מאוד. פקטורים משמעותיים.\n\nהשורה התחתונה: קורס מאוד חשוב, יש אווירה קצת מבולבלת בגלל ריבוי הטעויות בחומר הרשמי, מאוד מערער בלמידה למבחנים וחבל שכך. הביעו כוונות לתקן לעתיד, נקווה שאכן ההבטחה הזו תתקיים", "timestamp": 1649682654020}, {"author": "יוסי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דן גרבר (קל לראות)\nחוות דעת - הרצאות: הרצאות נחמדות מאוד קלילות, הכל מובן ועובר חלק, חומר לא קשה בכלל הכל אינטואיטיבי\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מתרגל מצויינת מסבירה הכל יושבת על חומר טוב\n\nשעורי הבית: עבודות בית קלות, לוקח בערך שעה\nעוזרים הרבה בלהבין את החומר\n\nהמבחן: קל מאוד, אם עוקבים עם ההרצאות כל הסמסטר קל להוציא 100 \n\nהשורה התחתונה: מלג 3 נק מומלץ בחום", "timestamp": 1658661880821}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: טובות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס מעניין אבל יש מלא טעויות בחומר שבמודל. מה שבעיקר מציק זה שיש טעויות לא רק בפתרונות של המבחנים שיש במודל אלא גם במבחנים עצמם - ביקשו להוכיח משהו לא נכון.", "timestamp": 1675862719151}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  דן גרבר\nחוות דעת - הרצאות: וואו. ההרצאות מעניינות לאללה, מעברים מתמטיים מאוד אבל מאוד מסובכים, רמת קושי מאוד גבוהה, בסופו של דבר דן מחבר את הכול ומראה איך משתמשים בכלים האלה לדאטה סיינס ואני מאוד התחברתי \n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים:  פחות הצלחתי להבין אותה, התרגולים בקורס בנויים ללפחות שעתיים וכשדוחסים הכול לשעה התוצאה לא מדהימה. בכללי התרגולים פחות רלוונטיים לתכלס של הקורס שזה ההוכחות.\n\nשעורי הבית: רמה פסיכית, מבקשים לחשוב על פתרונות לדברים שבקורסים אחרים יכולה להיות חצי הרצאה עליהם, אם עושים אותם לבד מבלי לרפרנס אפשר לשבור את הראש יומיים על גיליון בקלות.\n\nהמבחן: קשה, מאוד אבל לא כמו מבחן רגיל של דן גרבר. אפשרי לפתור את כל המבחן הזה אם אתה ממש ממש חד על החומר, זה בניגוד לבחינות אחרות של דן שפשוט לא פתירות באופן אבסולוטי. \n\nהשורה התחתונה: הקורס מדהים ומאוד רלוונטי מבחינת תוכן, ההתנהלות בקורס לעומת זאת טעונת שיפור. אם אתם לא מנתונים אני לא חושב שלקחת אותו כקורס בחירה זה צעד חכם בתמונה הכוללת. אם אתם נתונים, תסתכלו על התמונה המלאה ותנסו להנות מהקורס גם אם הציונים ברצפה.", "timestamp": 1676402280390}, {"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: ההרצאות מעולות וברמה ממש גבוהה. לדעתי עד לנקודה הזאת בתואר -  זה החומר הכי מעניין וההרצאות הכי מעניינות שעברתי. הקורס הוא אמנם קורס מתמטי מאוד מורכב וקשה, אבל יכולות ההוראה של דן באמת טובות והחומר גם נורא מעניין. דן אוהב לקשר את החומר והמתמטיקה לשימושים פרקטיים בדאטא סיינס, וחייבים לפרגן ולהגיד שאין הרבה הרצאות ששווה לקום בשבילן בבוקר לפרונטלי, אבל חד משמעית שלשיטות כן.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: ההפך הגמור מההרצאות. אני חושב שהבעיה המרכזית של התרגולים היא שהם רק שעה, וזה פשוט לא מספיק. יש המון חומר,  והרבה פעמים גם בתרגולים לומדים חומר חדש ככה שבפועל לתרגל אין הרבה הזדמנויות, וחבל כי החומר באמת קשה וצריך להפנים אותו.\n\nשעורי הבית: ברמה גבוהה. הם מאוד חשובים כי זאת ההזדמנות היחידה בערך לתרגל את החומר וזה קריטי להבנה. התרגילים עצמם ברמה מאוד גבוהה ויש שאלות מאוד קשות שבקלות שוברים עליהן את הראש כמה שעות. אני חושב שאפשר להפיק מהם הרבה אם מנסים לפתור למרות הקושי, אבל למקרה הצורך כן יש רפרנסים. התרגילים הרטובים בפייתון ממש טובים וחבל שאין יותר כאלה, זאת הזדמנות לראות איך המתמטיקה עובדת על דאטא ברמה הפרקטית וזה ממש חוויתי לדעתי.\n\nהמבחן: בשנים קודמות המבחנים היו בלתי פתירים בעליל, אבל השנה דן פחות או יותר הבין איך לכתוב מבחן שהממוצע בו יהיה בין 50 ל60 ככה שהוא לא יצטרך לתת פקטור. המבחנים סופר קשים, אבל כן פתירים. אין פתרון קסם, חייבים להיות ממש חדים על החומר בשביל ציון סבבה וגם אז זה ממש קשה. אפשרי, אבל דורש המון.\n\nהשורה התחתונה: הקורס הכי טוב לדעתי שעושים עד לנקודה הזאת בתואר. מלמד המון, מאוד רלוונטי ומעניין בטירוף. המבחן משאיר טעם רע וידוע לשמצה בצדק, אבל אם מוציאים את זה מהמשוואה, מאוד נהנתי ואני חושב שזה אחד הקורסים החשובים שיש בתואר. אם זה לא חובה tho - אל תיקחו, חבל על הממוצע שלכם :(", "timestamp": 1679212182263}, {"author": "404notfound", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: האיש והאגדה. כמרצה הוא מעולה, ככותב מבחנים קצת פחות. ההרצאות שלו באמת פצצה, והחומר סופר מעניין ורלוונטי, אבל מרצה לא נמדד רק ביכולת שלו להרצות, ותכלס בכל מה שלא קשור לזה דן מאוד מזלזל בסטודנטים ובקורס וזה מורגש.\n\nשם המתרגל/ת: עטרה קפלן\nחוות דעת - תרגולים: התרגולים לא משהו. עטרה לא מסבירה כל כך טוב את החומר, וזה לא עוזר שהם רק שעה שגם לומדים בה חומר חדש והתרגילים בה ברמה נמוכה יותר מהגיליונות ומהמבחנים. מאוד מקשה על להבין מה הולך.\n\nשעורי הבית: קשים וארוכים. התרגילים ממש חשובים כדי להיות על החומר אחרת מאבדים את הקורס מהר, אבל יש אתגר לא קטן. יש המון שאלות ברמה מאוד גבוהה והמעברים המתמטיים שצריך לשלוט בהם מאוד לא טריוויאלים. מאוד ממליץ לפתור כשבמקביל ההרצאות פתוחות אצלכם ברקע ולעבור עליהן תוך כדי, כי הרבה פעמים צריך לשלוף איזשהו משפט מההרצאה שמקדם אתכם בפתרון ובלעדיו אי אפשר. \n\nהמבחן: לא פשוט וזה אנדרסטייטמנט. צריך לשלוט ממש בכל המעברים, התכונות והנוסחאות שרואים בקורס, ולדעת את המשפטים ומתי להשתמש בהם. דורש המון הכנה ותרגול ודף נוסחאות טוב ומפורט. המבחנים מאוד קשים ולא הוגנים ומעבר לזה הם מנוסחים וכתובים רע. במועד ב' הממוצע היה 43 על הטופס, דן החליט \"לפרגן\" רק ב7 נקודות פקטור. אני אומר את זה בתור אחד שקיבל ציון סביר אחרי המון השקעה - אם אתם לא רוצים שזה ידפוק לכם תממוצע, תחרשו לזה לפחות שבוע ותחרשו חזק, אין לדעתי דרך אחרת.\n\nהשורה התחתונה: הקורס הכי מעניין שעשיתי עד עכשיו בתואר ובאמת שהוא פותח את הראש לעולם של דאטא סיינס מאוד. המוניטין שלו מאוד מוצדק, והוא דורש המון וקשה. ההתנהלות מול הסטודנטים על הפנים מצד דן וזה ניכר, מבאס אבל אין מה לעשות. תשתדלו להפיק ממנו כמה שיותר.", "timestamp": 1679216324780}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nדן מרצה מצוין, ואם מצליחים לשמור ראש בהרצאות שלו כנראה תוכלו להבין מה הוא רוצה מכם. חבל שהוא נותן מבחנים קשים רצח. \n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: \nמתרגלת בינונית ותו לא. התרגולים טיפה משמעממים והיא מריצה קצת את החומר, אבל אין מה לעשות שיש שעה תרגול על 3 שעות הרצאה.\n\nשעורי הבית: \nארוכים וקשים . \nהמבחן: \nקשה כמו כל מבחן של דן. לקוות לטוב ולפקטור.\nהשורה התחתונה: \nקורס חובה אז אין מה לעשות. מי שאוהב אלגברה זה הקורס בשבילו", "timestamp": 1679228057454}, {"author": "adir blajwas", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דן גרבר \nחוות דעת - הרצאות: הרצאות של דן מצוינות הוא מסביר מעולה חומר מורכב \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש כמה שיעורי בית בקורס שהם קשים אבל אפשריים מאוד.\n\nהמבחן: \nקשה מאוד מאוד ושונה בין כל סמסטר\nהשורה התחתונה: \nקורס מאוד קשה אבל מעניין", "timestamp": 1679561594929}, {"author": "דביר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: רץ מהר על החומר, קשה לעקוב\n\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: ממש עוזרת להבין את החומר טוב, משקיעה ומביעה יחס אישי\n\nהמבחן: שמעתי דברים זוועה על המבחן בקורס הזה, אבל היה הוגן יחסית למה ששמעתי מאנשים שעשו את הקורס לפניי\n\nהשורה התחתונה: אם עושים תלכו לתרגולים של חיה", "timestamp": 1679831756577}, {"author": ":):", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן מסביר ממש ברור את החומר, שהוא לא פשוט בכלל לעיכול. הופך את ההרצאה למעניינת. מה שכן, הוא איחר בשני המועדים בהחזרת הציונים, משוכנע שכולם מרפרנסים שיעורי בית ובכללי לא כל כך תופס מהסטודנטים. בסוף, זאת קצת נבואה שמגשימה את עצמה.\n\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: חיה מתרגלת ממש אחלה, נותנת יחס אישי ומסבירה סבבה, אך מתבלבלת לפעמים וזה קצת תוקע את השיעור. התרגולים נמצאים שם כדי להוסיף עוד חומר, לכן שעה אחת של תרגול בהחלט לא מספיקה.\n\nשעורי הבית: \nשיעורי הבית די קשים אבל הם בדיוק ברמה של המבחן. יש 6 או 7 תרגילי בית ואת אחד הציונים לא מחשיבים. בד\"כ הם אלגבריים ממש אבל מידי פעם יש שאלה תכנותית. אמנם הם לוקחים זמן (2-3 ימים על 6-9 שאלות) אבל מאוד מומלץ לא לרפרנס ולהתאמץ לפתור אותם תוך מעבר על ההרצאות, זה באמת משתלם בסוף.\n\nהמבחן: \nהמבחן קשה ממש. הוא משתנה משנה לשנה ויש הרבה שאלות ברמה של שיעורי הבית. קשה לעלות בחצי שעה על פתרונות שלקחו לך בשיעורי בית 3 שעות, אבל בשלב מסוים זה טיפה חוזר על עצמו. תמיד יש שאלות הזויות והממוצע מעיד הכי טוב על המבחן. יש כמה שאלות שיעורי בית, שזה אחלה. כמו שאמרתי, הכי מומלץ לחרוש על השיעורי בית לאורך הסמסטר, זאת הדרך הכי טובה בעיני ללמוד לקורס הזה.\n\nהשורה התחתונה: \nקורס קשה אבל מעניין ממש. פותח צורת הסתכלות חדשה על דאטה ובכללי לומדים כמה דברים מגניבים (שדן אומר שממש שימושיים, נגלה בעתיד אם זה נכון)", "timestamp": 1681509452236}]}