{"posts": [{"author": "נסיכת האופל", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: אוי ואבוי.\nלנסות ולהשיג מוקלט בכל הכח כדי לברוח מהסיוט של לשבת בכיתה כשהוא מלמד.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: מתרגלת ממש נחמדה וחכמה, מסבירה טוב אבל צריך להתרכז ולהקשיב.\n\nשעורי הבית: ארוכים ממש אבל אם שוברים את הראש עליהם זה ממש עוזר.\n\nהמבחן: \n\nהשורה התחתונה: להתרחק מדן גרבר.", "timestamp": 1711131558577}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות:דן\nההרצאות של דן מאוד טובות אבל הן גם הדרך היחידה האמיתית ללמוד את הקורס כי אין אלטרנטיבה. אפשר לקרוא את השקופיות (וגם עשיתי זאת זה לא נורא) אבל זה לא משתווה ללכת להרצאה שלו. בהרצאה הוא כמעט אך ורק מוכיח משפטים שלא תידרשו להוכיח יותר אז יותר תתמקדו במעברים ופחות בלהבין למה המשפט נכון כי זה לא חשוב.\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: \nחיה מתרגלת טובה ולכן התרגולים שלה היו די מלאים. גם לתרגולים מומלץ מאוד להגיע.\nשעורי הבית: \nמגן, היה צריך להגיש 5 מתוך 6. רוב ש\"ב היו מרופרנסים אך היו גם כמה שלא שמעתי שרופרנסו. הש\"ב הם הדרך היחידה לתרגל בקורס כי קשה למצוא תרגילים טובים של זה במקום אחר ואין הרבה מבחנים. בנוסף במבחן יש שאלות ש\"ב במשקל של בערך 20 נקודות. הייתי ממליץ לעשות ש\"ב אבל לא למות עליהם ולרפרנס במידת הצורך.\nהמבחן: \nהמבחנים בשנים האחרונות הרבה יותר פתירים במסגרת הזמן ממה שהיה לפניהם. כן היה סעיף אחד לא פתיר בעליל אבל חוץ מזה כל השאר היה פתיר, תעברו טוב על הש\"ב כי מבאס ליפול בהם.\nהשורה התחתונה: קורס מעניין מאוד ואחד המעניינים ביותר שהיה לי עד עכשיו אבל גם קשה כי מועברים בקורס רק משפטים גדולים וקשה לעבור מהם לתרגול. קורס לבחור אם אתם חייבים אלגברה לינארית כדי להציל את חייכם אחרת לא כדאי.", "timestamp": 1715371225724}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מצוין, יחסי אנוש- פחות.\nהחומר מעניין, אבל קשה.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: מצוינת! מסבירה באופן מאד מסודר.\n\nשעורי הבית: חשוב לעשות אותם. יש רפרנס לרוב.\n\nהמבחן: קשה, אפילו מידיי (וללא פקטור כללי במועד א).\nלמילואימניקים שעשו מספיק ימי מילואים ניתן פקטור כפלי מראש.\n\nהשורה התחתונה: קורס חובה, זה מה יש.", "timestamp": 1716654944640}, {"author": "פירקו אותי ספקטרלית", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: לטעמי ההרצאות היו מעניינות ממש. פחות התחברתי לנגיעות לא נגיעות באלגוריתמים וסיבוכיות אבל אין מה לעשות. מה שכן, היחס מדן לא משהו בכלל.\n\nשם המתרגל/ת: חיה נחימובסקי\nחוות דעת - תרגולים: הגעתי לתרגול הראשון. היא עשתה שם כמה טעויות שנגררו להן קצת מבחינת האורך וזה תמיד מסיח דעת כשזה קורה. אז קלטתי שאני מעדיפה לעבור פשוט על ה-pdfים בעצמי והפסקתי להגיע. מה שכן, בתרגולים יש חומר נוסף להרצאות לפעמים וצריך לדעת גם אותו למבחן, אז חשוב לעבור עליהם.\n\nשעורי הבית: גיליון מאתגר פעם בשבועיים. שווה לפתור גם כי זה מגן וגם כי זה עוזר להטמיע את החומר. חוץ מזה יש שאלת שיעורי בית במבחן.\n\nהמבחן: נוראי. לא יכולתי להגיע למועד א' ולא נתנו לי מועד מיוחד אז היה לי רק את מועד ב', והוא היה קשוח יותר מא'. במועד א' היה פקטור של 16 נקודות(!!) אז אפשר רק לדמיין בינתיים מה יהיה בב' עד שיגיעו הציונים.\n\nהשורה התחתונה: חומר מעניין אבל L+סגל לא חזק במיוחד+ מבחן שעושה חשק להקיא", "timestamp": 1716664525773}, {"author": ":)", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דן\nחוות דעת - הרצאות: \nחשוב היה לי לכתוב שבניגוד לשאר הדעות פה אני חושבת שדן מרצה מצויין, יודע להסביר את החומר (הלא פשוט בכלל), ולהרגשתי היחס שלו לסטודנטים היה מכבד. חשוב ללכת להרצאות ולא להתפתות לקרוא את המצגות.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: \nמאוד מסודרת ולטעמי גם ברורה, אבל קל לאבד אותה\n\nשעורי הבית: \nקשים קשים קשים, אבל אין מה לעשות באמת חשובים. אצלנו היו 2 שאלות מהתרגילי בית במבחן ובכנות הם הצילו להרבה אנשים את הציון..\n\nהמבחן: \nנורא. אמנם הוא היה פתיר אבל הבדיקה היתה קשוחה בטירוף, אם לא ענית 100% מה שציפו הורידו את כל הנקודות בסעיף. 16 נקודות פקטוררררר!!! ואין מה להוסיף.\n\nהשורה התחתונה: באסה לנו. סתם לא נורא, הקורס באמת מעניין", "timestamp": 1716962010343}, {"author": "שולסקי ימח שמו", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן יודע את החומר מצוין, חבל שהסטודנטים לא.\n\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: אחלה מתרגלת, אכפת לה מהסטודנטים, חבל שאין לה הקלטות.\n\nשעורי הבית: ארוכים וחשוכים כמו מנהרה בח'אן יונס.\n\nהמבחן: דן החליט שהוא כותב ספר לכבוד המועד ב', לא הספקתי לקרוא את כולו בזמן שהוקצב לבחינה.\nבכל מקרה, כל שאלה היא כמו מתקפת טילים איראנית, ב-3 חודשים אין לסטודנט זמן לפתח את מערכות ההגנה הנדרשות. יוצאים בידיעה שצריך פקטור כדי לעבור...\n\nהשורה התחתונה: \n1. דן אם אתה קורא את זה, אז לא נהניתי בכלל!\n2. הקורס מומלץ למזוכיסטים בלבד.\n3. לשים עובר בינארי כל עוד אתם יכולים.\n4. נקודה חיובית- היה פקטור נדיב 1.25 למילואימניקים.", "timestamp": 1717535140547}]}