{"posts": [{"author": "מאי כרמל", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות:  המרצה מאוד חביבה, הרבה ניסויים לדוגמא והשתתפות של סטודנטים. \nכל הרצאה עוברים על חומר שונה ולכן יש סה\"כ הרבה נושאים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עוברים באווירה השתתפותית ונחמדה\n\n\nשעורי הבית: \nפרוקיט שנבנה לאורך כל הסמסטר , מעניין ויש עזרה מצד המרצה והמתרגלת\nהמבחן: \n\nהשורה התחתונה: סה\"כ מומלץ", "timestamp": 1612259232695}, {"author": "אלברט הקטן", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ורד\nהרצאות מעניינות,המרצה מותק \n\nשם המתרגל/ת:רינה \nמתרגלת מעולה\nשעורי הבית: \nפרוייקט הוגן ומעניין ממוצע גבוה \nהמבחן: \nאם תלמד טוב תקבל/י ציון גבוה ! זה לא דיסקרטית שלא משנה כמה תלמד,שאלוהים יעזור :-)\nהשורה התחתונה: קורס קליל,מעניין מאוד וכיפי.\nfun fact:אסור לומר למיכל פן היי כששולחים לה הודעה,היא מכישה אז תיזהרו מהמכשפה !", "timestamp": 1613858815329}, {"author": "שרון סגל", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: \nאם מגיעים ומצליחים להתרכז אז כדאי\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: \nחשובים ותורמים מאוד\nשעורי הבית: \nאין, יש פרויקט והוא לא פשוט\nהמבחן: \nסמסטר קורונה- טריקי מאוד\nהשורה התחתונה: \nקורס חמוד אבל לא מעלה ממוצע כמצופה", "timestamp": 1614936833124}, {"author": "מור בורשטיין", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ורד ערב-יהנה\nחוות דעת - הרצאות: הרצאות מעניינות\n\nשם המתרגל/ת: רינה שטיין \nחוות דעת - תרגולים: תרגולים נחמדים וחשובים למבחן.\n\nשעורי הבית: אין, יש עבודה גדולה במהלך כל הסמסטר.\n\nהמבחן: מבחן טריקי, די קשה למי שמתקשה ברבי מלל. חשוב לזכור את ההערות הקטנות שהן אומרות בעל פה בהרצאות ובתרגולים.\n\nהשורה התחתונה: קורס מעניין יחסית אבל מבחן קשה ועבודה די מעצבנת.", "timestamp": 1615193494469}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: \nמעניינות וחווייתיות, אם אפשר להגיע אליהן וגם לסכם תוך כדי מה שנאמר ולא מופיע בשקפים, הייתי ממליצה כי הן רלוונטיות למבחן.\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: מעניינים, עושים בהם כל מיני ניסויים לפעמים שזה נחמד, וגם הם חשובים לבחינה כי יש הרבה שאלות בסגנון הבחינה.\n\nשעורי הבית: \nאין, יש עבודה במקום, עבודה לא פשוטה ודי מייגעת למי שלא אוהב מקצועות רבי מלל.\n\nהמבחן: \nלא פשוט, אבל אם מגיעים לכל ההרצאות, בתוספת יומיים למידה לפני לדעתי אפשר לקבל בו ציון טוב\n\nהשורה התחתונה: \nקורס מעניין ולא מעמיס מדי לאורך הסיסמטר, אבל כדאי להיות נוכח בהרצאות ובתרגולים כדי להבין טוב את החומר לבחינה.", "timestamp": 1616054806973}, {"author": "שרון סגל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: די משעמם\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: אחלה תרגולים\n\nשעורי הבית: אין, יש פרויקט\n\nהמבחן: מתחכם\n\nהשורה התחתונה: קורס נחמד, חבל שהמבחן והסגל לא באים לקראת הסטודנטים", "timestamp": 1616535147600}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: אין את כל החומר שהיא אומרת בעל פה במצגת אז צריך להקשיב ולכתוב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חומר שונה מההרצאות \n\nשעורי הבית: אין שיעורי בית, יש פרויקט בקבוצות.\n\nהמבחן: טריקי ומתחכם, צריך לשנן ממש את כל החומר גם של ההרצאות גם של התרגולים וגם של ספר הקורס. שואלים על פרטים קטנים וחסרי משמעות.\n\nהשורה התחתונה:", "timestamp": 1625909068754}, {"author": "ללא", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ורד ערב \nחוות דעת - הרצאות: הרצאות נחמדות, ורד מקסימה ומביאה שוקולדים. אבל לא מספיק להיות נוכח בשביל להצליח במבחן, \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין שיעורי בת. פרויקט ומבחן פלוס להשתתף בניסויי קרדיט. הפרויקט ממש נחמד בקבוצות גדול של 7 אנשים.\n\n\nהמבחן: המבחן שעתיים, 33 שאלות אמריקאיות חשוב לקרוא מהספר יש שם המון מידע שלא עוברים עליו בהרצאות וכן צריך אותו למבחן.", "timestamp": 1657725855768}, {"author": "ניק", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: רואים שהיא מאוד מנסה לשמור על רמת עניין גבוהה. אני אישית ממש לא התחברתי והפסקתי ללכת להרצאות והיה קל מאוד להשלים את החומר\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: החומר בתרגולים שונה מהחומר בהרצאות וגם הוא למבחן אז חשוב להבין אותן.\n\nשעורי הבית: אין שיעורים יש רק את הפרוייקט\n\nהמבחן: 33 שאלות אמריקאיות, חלקן הקטן ממוחזר אבל לא מעט שאלות טריקיות מאוד שצריך להבין כל מילה שהיא אמרה כדי לענות. אצלנו היו הרבה שאלות כאלה אז נתנו 6 פקטור\nסך הכל מספיקים 3 ימים כדי ללמוד\n\nהשורה התחתונה: הפוגה נחמדה למי שמתחבר להומני", "timestamp": 1658407191684}, {"author": "לוקל מקסימה", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ורד (הקלטות)\nחוות דעת - הרצאות: צפיתי בהקלטות מאביב 2021 , החומר לא השתנה כמעט מאז, פה ושם יש ניואנסים קטנים. ורד מעבירה את החומר בצורה ברורה ומעניינת. ההרצאות נוטות להימרח בדיונים מיותרים, היתרון בהקלטות שאפשר לדלג קדימה.\n\nשם המתרגל/ת: רינה (הקלטות)\nחוות דעת - תרגולים: גם ההקלטות של רינה עושות את העבודה. פחות נמרחות מההרצאות.\n\nשעורי הבית: כפי שנאמר יש עבודה להגשה בשני חלקים. שימו לב שבסמסטר חורף הקבוצות הן של 3-4 סטודנטים לעומת 6-7 באביב. העבודה לא עמוסה מדי כך שאין לזה יותר מדי השפעה, אפשר לסיים כל חלק ב4-5 שעות של עבודה יעילה. יש הצגה של העבודה בסוף הסמסטר. ספויילר: בסוף כולם מקבלים על ההצגה 100.\n\nהמבחן: כמו מקצוע הומני סטנדרטי זה מבחן זיכרון. חלק קטן מהשאלות גם בודקות הבנה יותר מעמיקה. יש לא מעט שאלות ממוחזרות, מומלץ להתכונן עם השחזורים בדרייב.\n\nהשורה התחתונה: בכיתי לקחתי קורס בפסיכולוגיה. ראיתי נתוניסט לוקח הגורם האנושי. אמרתי תודה לאולוהים.", "timestamp": 1676742884015}, {"author": "Nina Kahn", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: משקיענית ומתוקה. המצגות שלה קצת מבלבלות אז חשוב להגיע ולהבין ולכתוב הערות.\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: ראיתי מוקלט כי זה התנגש לי עם שיעור אחר. היה אותו דבר.\n\nשעורי הבית: אין שיעורי בית, אבל יש פרויקט לאורך כל הסמסטר. רינה קטנונית בבדיקה ומורידה נקודות בלי להבין בעצמה למה.\n\nהמבחן: טריקי בטירוף. אפילו אם אתה יודע טוב את החומר, לא מובטח ציון טוב במיוחד.\n\nהשורה התחתונה: מעניין אבל המבחן/פרויקט לא בודקים את הידע שלך כמו שצריך.", "timestamp": 1678189803508}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: אני דווקא אהבתי, מעניינות למי שמעניין אותו פסיכולוגיה. היא באמת נתנה את הנשמה וניסתה לעשות כל מה שיכלה שיהיה מעניין. באמת אכפת לה וזה לא מובן מאליו.\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: התרגולים ברורים וטובים, רינה אחלה, אבל בכל הנוגע למענה במיילים- זוועה. לא עונה ולא עוזרת.\n\nשעורי הבית: יש פרוייקט מסיבי שלוקח הרבה זמן ורק למצוא לו נושא למחקר זה חתיכת תיק, ורינה לא הפכה את זה לקל. לא להקל בזה ראש- זה דורש זמן והשקעה.\n\nהמבחן: מבחן אמריקאי. גם אם תלמדו את החומר מושלם זה לא יספיק בהכרח. מבחן טריקי ומתקיל מאודדד שמקשה סתם יותר מידי ומאכזב שהן עושות את זה. הפתיע לרעה מאוד ולכן צריך להיות מוכנים מראש ולהתכונן עם כמה שיותר שאלות מראש ולשנן כל פאקינג פרט קטן שיש. ויש הרבה מאוד לשנן.\n\nהשורה התחתונה: לא להיות שאננים ולחשוב שקורס חמוד, המבחן לא בדיחה וממש לא מעלה ממוצע בהכרח.", "timestamp": 1690323003616}, {"author": "?????", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ורד\nחוות דעת - הרצאות: אחלה מרצה, מאוד אכפת לה מהסטודנטים\n\nשם המתרגל/ת: רינה\nחוות דעת - תרגולים: יש גם במוקלט אותו דבר בדיוק.\n\nשעורי הבית: אין, יש פרויקט בקבוצות של 4.\n\nהמבחן: אמריקאי, חלק משוחזר, ורד נותנת הרבה טיפים במהלך ההרצאות והדברים באמת מופיעים.\n\nהשורה התחתונה: קורס מעניין בסך הכל, מרגיש קצת לא קשור לתואר אבל בסך הכל לומדים דברים די מעניינים לחיים.", "timestamp": 1691741304109}]}