{"posts": [{"author": "Naveh Porat", "difficultyRank": 2, "generalRank": 4, "semester": "201802", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: קבוצה קטנה, המרצה לא לגמרי מחובר לכיתה. סך הכל מעניין אבל מזל שאין תרגילים כי קשה להבין לעומק מה הולך.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: תרגיל אחד באמצע הסמסטר. אפשר להגיע עד 120 נקודות.\n\nהמבחן: עבודה בשני חלקים, עם המון מקום אישי. חוויה חיובית סך הכל.\n\nהשורה התחתונה: קורס נחמד בתור העשרה, לא המון השקעה.", "timestamp": 1599644664829}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: ההרצאות מועברות באגנלית. הן גם ארוכות, לא מעניינות במיוחד, ולפעמים גם קשות להבנה. רשף לא לגמרי מחובר לכיתה, אבל כן עונה על כל שאלה ומנסה להסביר בצורה הכי ברורה. \n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: התרגולים הם עצמאיים, יש דף של תרגילים שכל אחד מנסה לפתור לבד והמתרגל שם כדאי לעזור במידת הצורך. ג'וני מקסים, ושמח להסביר ולעזור למי שצריך. \n\nשעורי הבית: היו לנו 3 תרגילי בית, ורק ה2 עם הציונים הגבוההים ביותר נחשבים. התרגילי בית על גבול הקשה. צריך להבין את החומר טוב כדי לפתור אותם. מומלץ להיעזר בשעות קבלה, ואל תשמשמו בchat gpt! זה רק יביא לכם טעויות. \n\nהמבחן: יש פרויקט - הפרויקט מורכב מ2 חלקים, בחלק הראשון בוחרים מאמר מסבירים עליו ומנתחים אותו קצת. החלק השני הרבה יותר מורכב, צריך להמשיך את המאמר, כלומר לבחור נושא מתוך המאמר ולהרחיב אותו איכשהו (כולל הוכחות וכו). נראה שרשף לא בודק בצורה מקלה, אבל נראה בקרוב. \n\nהשורה התחתונה: קורס לא קל, ודורש השקעה. מתאים למי שאוהב את הנושא של תורת המשחקים.", "timestamp": 1689107630201}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: \n\nרשף לקח נושאים יחסית עדכניים בתורת המשחקים ולימד אותם בכיתה באנגלית, לי אישית היה מאד קשה לעקוב אחרי מה שקרה שם, לרוב השיעור היה מתמקד באיזו הוכחה ארוכה ולא תמיד היה מובן למה היא תורמת.\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: \n\nמנסים לפתור שאלות לבד בכיתה.\n\nשעורי הבית: \n\nאחת החוויות היותר קשות שהיו לי בתואר, כמעט ואין חומר רלוונטי באינטרנט, GPT לא הבין מה רוצים ממנו והשאלות היו רעות. גם הבדיקה לא הייתה מקלה ולא לקחה בחשבון את רקע הסטודנטים.\n\nהמבחן: \n\nעבודה מסכמת, שני חלקים, בחלק הראשון בחירת מאמר וניתוח שלו ובחלק השני מנסים \"להרחיב\" את המאמר איכשהו. גם פה הבדיקה לא הייתה פיירית לדעתי.\n\nהשורה התחתונה: \nאם הוכחות מתמטיות ארוכות עושות לכם את זה -  זה הקורס בשבילכם אבל אם לא, הייתי מתרחק מהקורס הזה כמו מאש.", "timestamp": 1695119834392}]}