{"posts": [{"author": "אלי", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: \nהרצאות עמוסות יחסית בחומר כאשר כל שבוע יש שאלות מודל (שמביאות בסוף בונוס 2 נקודות לקורס בלי קשר לציון) שכדאי לעשות כדי להיות על החומר. כדאי לבוא עם ידע בתורת המשחקים לפני אבל לא חובה \nשם המתרגל/ת: יונתן וגנר ועודד סלטון\nחוות דעת - תרגולים: \nלא הכי מוצלחים ולא ממש תורמים למבחן. ממליץ לעבור לבד על התרגולים ולהבין לעומק\nשעורי הבית: \nצריך לעשות 2 מתוך 3 תכנותיים כבדים כאשר הש\"ב בלי הוראות ברורות ולפעמים סותרות. לא מומלץ להתחיל מוקדם כי צפויים הרבה תיקונים ושינויים לתרגיל (למרות שלא כדאי להשאיר לרגע האחרון)\nהמבחן: \nלא קשה מדיי בדר\"כ ואם יודעים את החומר בהחלט אפשרי לקבל 100, במיוחד בהתחשב בזה שלוקחים 5 הטובות מתוך 6. בדר\"כ אין פקטור\n\nלא נכון לסמסטר קורונה*\nהשורה התחתונה: \nקורס שיכול להיות מעניין", "timestamp": 1597741381132}, {"author": "g", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: כמעט כל הרצאה נוגעת בנושא שונה. ההרצאות די מבולגנות ולא מאוד ממוקדות, אך עם זאת המרצה משתמש בשיטות לימוד שונות ומגוונות כדי להעביר את החומר.\n\nתרגולים: מתבצעים באופן אקטיבי- נותנים זמן לנסות לפתור את השאלות ואז מדברים ופותרים יחד.\n\nשעורי הבית: צריך להגיש 2 מתוך 3 עבודות בית. העבודות הן תכנותיות וכוללות גם חלק תחרותי, ודורשות הרבה זמן והשקעה.\nחוץ מזה יש בחנים במודל אחרי כל הרצאה- הגשה של כולם נותנת בונוס (בינארי) של 2 נקודות לציון הסופי. \n\nהמבחן: מבחן עם שאלות מסוגים שונים שנוגעות כמעט בכל החומר הנלמד. שאלות קצת קטנוניות שנכנסות לדקויות שלא תמיד ברורות מההרצאות.\n\nהשורה התחתונה: קורס מעניין מאוד אבל המעטפת לעיתים מתסכלת.", "timestamp": 1598100825334}, {"author": "None", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: \nמרצאה טוב, אך מרגיש כי ההרצאות מיושנות ולא עוסקות בטכנולוגיה שקיימת כיום. ההרצאות הם לא אשר מחיקוי זול של קורס מערכות הפעלה של מדמ\"ח, כל ההרצאות שתראו בקורס זה לא יקדמו אתכם בהרבה בתחום, ותשארו אולי אם הרעיון התיאורתי של המימוש אך בלי היכולת לממש זאת.  \nשם המתרגל/ת: אפיק בר\nחוות דעת - תרגולים: \nהתרגולים קצת יותר רלוונטים, אך לא נותנים להם מספיק זמן בשביל להבין באמת את החומר החשוב להמשך (Spark)\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס חייב לעבור שינוי. מרגיש שיש שתי נושאים עיקריים שהקורס מנסה להעביר אך הוא לא משיג את שניהם. מי שלא חייב לקחת את הקורס שלא יקח , ואם נרשמים לקורס בשביל להכיר את Spark מומלץ בחום לקחת קורס אינטרנטי בנושא", "timestamp": 1624553139835}, {"author": "None", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: \nמרצה נחמד מאוד, אך לא נראה שבאמת אכפת לו להעביר את החומר של הקורס. \nשם המתרגל/ת: כל המתרגלים(גוני, צביאל וקטרינה)\nחוות דעת - תרגולים: \nצוות המתרגלים הכי בזיוני שפגשתי, מש\"ב שכתבו שלא מוגדרים זוועה עד כדי טעיות לוגיות והגדרות מטמטיות לא נכונות, ועד חוסר ידע בנושא התרגול.  \nשעורי הבית: \nנוראיים, לא מבחינת קושי (החומר ממש קל להבנה ) אלא מבחינת כתיבה. התענייתי ביכולת של המתרגלים להפוך חומר כל כך פשוט למסובך להחריד.\nהמבחן: \n\nהשורה התחתונה: קורס נוראי, פשוט בושה שיש התנהלות כזאת בטכניון.", "timestamp": 1624553511161}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות:  המרצה מעביר חומר שאפשר להגדיר בתור מעניין, יחד עם זאת, לאור העובדה שהוא מעביר אותו בצורה כל כך לא ברורה, ויותר דומה להרצאות טד מאשר הרצאות באוניברסיטה, נוצרת סביבת למידה לא נעימה. ההרצאות לא עוזרות בשום צורה למבחן או לתרגולים העצמיים. מלבד זאת רשף כן נותן הזדמנויות להעלאת הציון - תרגולים עצמיים, בונוסים ועוד. אבל מרגיש שזה קיים בתור ניסוי חברתי ולא בשביל הצלחת הסטודנטים.\n\nשם המתרגל/ת:  ג'וני/קטיה/צביאל\nחוות דעת - תרגולים: מבחינת דירוג מתרגלים - ג'וני באופן מובהק המתרגל הכי גרוע, אחריו קטיה שלא יודעת את החומר, וצביאל שמסביר בצורה שטחית ולא מנסה להבין את הפערים, אצל הסטודנטים. \n\nשעורי הבית: לא ברורים,  ניסוח מזעזע, לא קשורים לחומר וגוזלים זמן לא פרופורציונלי.\n\nהמבחן: טרם היה, אבל הלמידה למבחן + שעות קבלה מתסכלות שבהם המתרגלים עוברים על שאלות ממבחנים, מסבירים אותן בצורה שטחית, כאשר ניכר מההסברים כי הם בעצמם לא יודעים את החומר. \n\nהשורה התחתונה:  מומלץ לדחות לסוף התואר ולעבור קודם את הקורסים : תורת המשחקים/סוכנים רציונליים, אחזור מידע, סטוכסטיים, למידה חישובית.", "timestamp": 1625823130543}, {"author": "מחיר שני", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: מרצה לא מעניין במיוחד\n\nשעורי הבית: 3 הגשות במהלך הסמסטר, 2 חובה. בדיקה זוועתית\n\nהמבחן: חלק מהשאלות ממוחזרות (עד כדי כמה סעיפים קטנים בתוך השאלה), אחרי שמבינים את הקונספט לא קשה להוציא ציון טוב\n\nהשורה התחתונה: יחסית מעניין", "timestamp": 1626105906583}, {"author": "חבר בקבינט", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: \nרשף משתדל לנסות להרצות בצורה מעניינת אבל ההרצאות מאוד מייגעות ולא מעניינות בשום צורה. אין שום קישור בין הרצאה אחת לבאה אחריה, בסך הכל לומדים בקורס 13 נושאים שאין ביניהם שום קשר.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nסגל המתרגלים הכי בזוי בטכניון, פשוט לא יודעים את החומר של הקורס בעצמם, לומדים אותו בזמן התרגול. התרגולים מלאים בטעויות ורדודים בטירוף לעומת הרמה הנדרשת במבחן. למתרגל האחראי אין שמץ של מושג מה הולך אצלו בקורס ולמרות שיש לו כמויות של חומר ושאלות שהוא יכול וצריך להעביר בתרגול הוא מסיים תרגולים לפני הזמן. באמת מביכים.\nשעורי הבית: \n3 שיעורי בית רטובים ולא קשים מדי, הבעיה היא שהם מלאים בטעויות, הגדרות סותרות, ניסוחים מבלבלים ולא תואמים למה שנלמד בהרצאה. שיעורי הבית לא יעזרו לכם בכלל במבחן.\nהמבחן: \nהמבחן היה ניסיון להמציא את הגלגל מחדש, לא מותאם לרמה שבה נלמד החומר בקורס. לדעתי בסבירות גבוהה כל אחד מהמתרגלים היה נכשל במבחן הזה.\nהשורה התחתונה: אם אתה סטודנט לתואר שני ואתה שוקל את הקורס הזה הייתי מציע לבדוק קורסים אחרים. אם אתה בתואר ראשון וזה קורס חובה בשבילך אז בהצלחה :)", "timestamp": 1626120379838}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: הרצאות מבולגנות ולא מובנות, לא ברור מה החומר של הקורס.\n\nשם המתרגל/ת: קטיה\nחוות דעת - תרגולים: נקודת האור בקורס הבזוי הזה. עונה לכל השאלות ומנסה לעזור לסטודנטים להבין באמת את החומר.\n\nשעורי הבית: 3 תרגילי בית, 2 חובה, לא קשורים בשום צורה לחומר הנלמד\n\nהמבחן: מבחן לא מובן וקשה מאוד.\n\nהשורה התחתונה:", "timestamp": 1626165437939}, {"author": "Ofek Glick", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: \nמרצה חביב סה\"כ, חלק מההרצאות מעניינות יותר וחלק מעניינות פחות, הנושאים בוודאות מעניינים. יש הרבה הרצאות שקשה שלא לאבד ריכוז בגלל כל הדוגמאות ועצם העובדה שלא נשארים על הנושא.\n\nשם המתרגל/ת: צביאל\nחוות דעת - תרגולים: \nמתרגל טוב, מרגיש שיודע את החומר ולהסביר כמו שצריך. שווה לבוא זה עוזר בתרגילי בית ובהכנה למבחן\n\nשעורי הבית: \nכל שבוע יש תרגול בית לא חובה אבל אם עושים את כולם מקבלים 1-3 נק' בונוס לסופי.\nמעבר לכך יש 3 גיליונות שכולם קוד והם ארוכים מאוד ודורשים הרבה השקעה. מחוייבים להגיש 2 מתוך 3 כאשר כל אחד מהם 15% ואם מגישים גם את השלישי הוא מהווה 10% מגן\n\nהמבחן: \nמבחן הוגן סה\"כ, לא הכי ברור ומתקיל.\nהשורה התחתונה: \nלא הקורס הכי נורא הסמסטר, יש חלקים מעניינים ויש חלקים קאדרים. סהכ נחמד", "timestamp": 1626356087169}, {"author": "האביר האפל", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: קופץ מנושא לנושא כשאין קשר ואין שום רצף בין השיעורים..  \n\nשם המתרגל/ת: ג׳וני\nחוות דעת - תרגולים: סביר\n\nשעורי הבית: לא קשים במיוחד, 3 תרגילי בית רטובים. \n\nהמבחן: הזייה אחת גדולה, מאחר בלתת ציונים..\n\nהשורה התחתונה: קורס חרא אבל חייב לקחת", "timestamp": 1627414695680}, {"author": "DDos", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nרשף מאיר\nחוות דעת - הרצאות:\n \nמרצה הזיה.... לוקח נושאים סקסיים והופך אותם לשעמום אחד גדול- אי אפשר לשמוע אותו זה באמת מזעזע.\nהמרצה היחיד בעולם שמתנהג כאילו הוא נער במכינה שחזר ממסלול בנחל ציפורי מבחינת לבוש, אני לא יודע אם הוא לא מסוגל להרצות כמו כולם בגלל סיבה כלשהי, אבל הבן אדם  מעביר הרצאה בישיבה תוך כדי שהוא מתחבא מאחורי מסך המחשב.\n\nשם המתרגל/ת: \nג'וני וצביאל\nחוות דעת - תרגולים: \nהמתרגלים עשו חצי סמסטר כל אחד.\nג'וני- מתרגל חביב נראה עייף, התרגולים לא ברורים כל כך.\nצביאל- מתרגל מזעזע, קצת הכנה מראש- מה כבר ביקשנו...\n\nשעורי הבית: \nלדחות לסוף, סגל שלא מסוגל להסביר מה הוא רוצה בכלל, ולא תלוש מהמציאות שיש טעות בכל תרגיל שהם מוציאים.\nבדיקת התרגילים לקחה כמה חודשים.\nכל תרגיל בית לוקח יומיים עבודה בערך, עם הסגל הזה יכול לקחת גם שבוע.\n\nהמבחן: \nרשף מאיר כנראה לא התחבר למחזור הזה, נתן מבחן שלא קשור לכלום, לא דומה למבחני עבר בכלל, ופיקטר כך שהעלה את צבירת הנקודות במבחן ל 138 נקודות! עדיין היה ממוצע 75.\n\nהשורה התחתונה: \nקורס שכל אדם אחר היה מעביר והיה עושה ממנו את ה- קורס של התואר, בסופו של דבר מדובר נושאים שמעניינים את כולם, אבל באמת יכולת הוראה וההתנהלות של הסגל הזה מזעזעת ושוברת שיאים.\nכל עוד רשף מאיר מעביר את הקורס, לא ממליץ לקחת בכלל.\n\nעד כאן DDos", "timestamp": 1627894168223}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: ההרצאות די מעניינות, הוא מעביר חומר תיאורטי ולא מתרגל ממש שאלות בנושאים. \n\nשם המתרגל/ת: יונתן וגנר וצביאל\nחוות דעת - תרגולים: התרגוליםהועברו בזום, המתרגלים ידעו בעיקר לפתור לפי הפתרון הנתון. השאלות מתרגלות חומר דומה למה שהשאלות במבחן והתרגולים מועילים.\n\nשעורי הבית: 3 תרגילי בית רטובים בזוגות, די קשים ולוקחים הרבה זמן (בין 7 שעות ליומיים-שלושה). \n\nהמבחן: לנו היה מבחן ממש קשה, לא במבנה של השאלות מהמבחנים הקודמים אבל היה הרבה פקטור ואיך להגיע לציון סביר.\n\nהשורה התחתונה: קורס מעניין, רק חבל שהוא מכיל הרבה נושאים שעוברים עליהם ממש בקצרה.", "timestamp": 1629704487034}, {"author": "שליחי הדודה", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רשף מאיר\nחוות דעת - הרצאות: מרצה גרוע. הרצאות משעממות מאוד. כל שבוע נושא חדש, הרמה של כל נושא מאוד נמוכה. קורס לא רלוונטי\n\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: כל המתרגלים לא טובים\n\nשעורי הבית: שב לא ארוכים מידי, רמה מאוד נמוכה\n\nהמבחן: המבחן טכני ולא קשה\n\nהשורה התחתונה: קורס פח, לא מעניין והסגל לא טוב", "timestamp": 1630885198020}, {"author": "ש\"מ", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מתנשאת מאוד על הסטודנטים, מסרבת לעזור ובשעות קבלה למבחנים לא רוצה לענות על שאלות ממבחנים קודמים. בשיעורי הבית נראה שהיא לא מנסה לעזור ולקדם את הסטודנטים ומתנהגת כאילו זה קורס של סימסטר א'. חבל.\n\nשעורי הבית: מוזרים מאוד.\n\nהמבחן: מחזיקים אצבעות חזק חזק שלא נקבל ממוצע של אינפי 1מ\n\nהשורה התחתונה: קורס שיכול להיות מעניין.. בפועל, סתם קורס מעיק", "timestamp": 1656948090438}, {"author": "בנדיט", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: הייתי במעט הרצאות אבל התרשמתי בהן לטובה מעומר. הבעיה היחידה שלי איתו היא שבאופן אירוני, דווקא בקורס שעוסק בעולם האונליין יש מרצה שמתנגד ללמידה אונליין. מתנגד ברמה כזאת שאפילו כשאחד המתרגלים כבר העלה הקלטות משנה שעברה, הוא דאג למחוק אותן מהר מאוד.\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מתרגלת לא רעה אבל לדעתי לא מוסיפה יותר מדי מעבר לפיתרון הכתוב. ייאמר לזכותה שהקליטה את התרגולים שלה, למרות שהאיכות שלהן לא משהו רוב הזמן.\n\nשעורי הבית: 3 תרגילים תכנותיים, שהציון בהם הוא 100% תחרות בין הסטודנטים. התרגילים היו מעניינים בסגנון של העולם האמיתי, אבל קשים ולוקחים המון זמן (חוץ מהשלישי שהקלו עליו מאוד כי פישלו בבדיקה של השניים הראשונים). מבוססים על חומר הקורס אבל לא מכינים כמעט בכלל למבחן.\n\nהמבחן: הוגן, ברובו טכני אבל בודק הבנה. חלק ממנו נראה שנלקח מהקורס במודלים סטוכסטיים.\n\nהשורה התחתונה: קורס מעניין ולא קשה במיוחד. למי שמסתדר עם אנגלית אני ממליץ בחום לקרוא את ספר הקורס (אפשר למצוא באינטרנט), הוא פשוט מצויין, זה ספר שהייתי קורא לפני השינה בלי קשר לקורס.", "timestamp": 1657205219157}, {"author": "בא לי מאה", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עומר בן פורת המלךך\nחוות דעת - הרצאות: הרצאות מעניינות, חומר קליל ואפילו קצת מציק אבל עומר גורם להכל להישמע מעניין, רואים כמה הוא משקיע ושהוא באמת רוצה ללמד ולא סתם מסמן וי\n\nשם המתרגל/ת: גוני\nחוות דעת - תרגולים: \nאור גורמת להכל להישמע סתם מסובך, לכו לגוני הוא מסביר הכל בפשטות\n\nשעורי הבית: לא רלוונטיים למבחן אבל מאוד מעניינים ופרקטיים\n\nהמבחן: השאלות בכל נושר יחסית קלות, הבעיה היחידה היא שיש הרבה נושאים ורוב השאלות מזכירות משהו מהסתברות\n\nהשורה התחתונה: אם עומר מעביר את הקורס תירשמוו", "timestamp": 1657213312904}, {"author": "בא לי מאה", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "תיקון****\n\nהמבחן: המבחן היה אנטישמי ופקטור צעצוע שנועד סתם ליפות את הממוצע\nתברחו\nפויה", "timestamp": 1657488818126}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות:  עומר מאוד כריזמטי ומעביר את ההרצאות בצורה מעניינת. מרצה פשוט מעולה. החומר רלוונטי לעולם הנתונים אבל לרוב תאורטי. \n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: ג'וני מעביר את התרגולים בצורה מעולה, ומסביר באופן פשוט וישיר איך לפתור תרגילים ( מאוד חשוב כי ההרצאות תאורטיות ).\n\nשעורי הבית: יש 3 תרגילי בית תכנותיים. 2 מהם תקפים ואחד מגן. התרגילי בית מעניינים מאוד, אך מאתגרים ודורשים השקעה וקצת יצירתיות. הם מבוססים על מה שנלמד בהרצאות אך אינם רלווטנים כל כף למבחן. כל התרגילי בית תחרותיים.\n\nהמבחן: המבחן הוגן אבל לא קל. הוא מכיל הרבה נושאים שונים וקשה ללמוד את כולם בצורה טובה עד המבחן. חלק מהשאלות היו טכניות אבל היו גם שאלות שדרשו חשיבה והבנה של החומר.\n נתנו פקטור שבקושי עזר לסטודנטים אז אל תצפו ליותר מדי\n\nהשורה התחתונה: קורס מעניין אך מכיל בתוכו מלא נושאים אז קצת קשה ללמוד למבחן.", "timestamp": 1657549696339}, {"author": "ניק", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: חייב לתת פה קונטרסט לדברים שכתבו פה עליו. עומר אמנם עם כריזמה וחוש הומור אבל היו איתו בעיות מרכזיות. 1. הרגשה של התנשאות מסויימת על סטודנטים שנבעה בעיקר מהדרך שבה או בוחר לענות (או לא לענות ברוב המקרים לסטודנטים). 2. רוב הזמן הוא היה עסוק בלדבר מסביב (על פיצה פאפא ג'ונס למשל) וכשהגיע לחלקים של התכלס הוא פשוט הריץ את זה בלי להסביר כמו שצריך\n\nשם המתרגל/ת: אור מרקובצקי\nחוות דעת - תרגולים: אז יכול להיות שיש לה פערים קטנים בחומר אבל היא מעבירה אותו מצוין והתרגולים עברו ברמה גבוהה.\n\nשעורי הבית: 3 תרגילי בית רטובים בפייתון שמבוססים על תחרות בין הסטודנטים. סך הכל זוועה, עבדנו שעות על גבי שעות על התרגילים, הלכנו לכל שעות הקבלה האפשריות ולא קיבלנו עזרה אמיתית ובסוף הציונים יכלו להיות גם נמוכים מאוד לחלקנו. \nאפשר לעשות ביחידים או זוגות.\n\nהמבחן: 5 שאלות, סך הכל הוגן אבל עומר עשה מבחן טריקי מאוד שכלל חלקים רבים שלא באמת נלמדו כנושאים בקורס. היה פקטור נוראי שנתן עזרה רק לנכשלים (שהעביר אותם לנכשל אחר).\n\nהשורה התחתונה: קורס שמלמדים בו הרבה נושאים מאוד מעניינים ויכול לעבור באופן מוצלח יותר. מרגיש שלומדים בו לקט של קורסים אחרים (למידה חישובית, תורת המשחקים ועוד)", "timestamp": 1658407488023}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: בסך הכל מרצה טוב, כן מעביר את החומר בצורה שאפשר להבין. עם כמה שאני מעריך את הנסיון שלו ליצור אווירה טובה בהרצאה, ברוב המקרים זה גורם לנושא שיכול לעבור ב 20 דקות לעבור בשעה וחצי וממש ממש קשה לשמור על ריכוז ככה. \n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: אחלה מתרגלת.\n\nשעורי הבית: במקום להביא תרגילים נורמליים שאשכרה עוזרים לתרגל את החומר כל תרגיל הרגיש כמו האקתון ויצא ככה שככל שהשקעת יותר הצלחת פחות. התרגילים עצמם כן מגניבים פשוט לא קשורים לחומר בשום צורה ולאף אחד אין סבלנות לחשיבה מחוץ לקופסה שהם דורשים בלחץ של סמסטר. \nבקיצור תחכו שמישהו גאון יעלה על הטריק ותעתיקו.\n\nהמבחן: זוועה. מוזר מאוד, רובו המוחלט רק תשובות סופיות ופקטור שלא עזר לאף אחד חוץ מטיפה להעלות את הממוצע.\n\nהשורה התחתונה: קורס מגניב עם נושאים מעניינים, אבל המזכרת שהוא משאיר היא בעיקר עצבים וציונים נמוכים.", "timestamp": 1658733892411}, {"author": "משפיענית רשת", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: 3 שעות קשות ולא מעניינות במיוחד, אף על פי שהנושאים כידע כללי מעניינים. הרבה חומר תיאורטי והוכחות מתמטיות שלא קשורות לחיים. קשה לעקוב, אבל יש אחלה סיכומים בדרייב.\n\nשם המתרגל/ת: אור / ג'וני\nחוות דעת - תרגולים: שניהם לא משהו. עדיף לקרוא לבד  \n\nשעורי הבית: יש מעין וורקבוקים במודל כל שבוע, עוזרים להיות קצת על החומר אבל רחוקים שנות אור מהרמה של המבחן. אם עושים את כולם מקבלים 2 נקודות בונוס. יש 3 תרגילים תכנותיים בפייתון, השניים הראשונים גיהנום עלי האדמות והשלישי סבבה. כל אחד 10% \n\nהמבחן: חשבתם שמבני קשה? תתכוננו להיות מופתעים. \n\nהשורה התחתונה: תאגרו כוחות נפשיים (או שותף מנתונים) לתרגילים התכנותיים + למבחן הכי קשה שעשיתי בתואר עד כה, אולי חוץ מלמידה חישובית אבל שם לפחות היה פקטור יפה", "timestamp": 1659100461419}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: מרצה כריזמטי מאוד שכן השקיע ב \"להקליל\" את החומר קצת ובא עם אווירה טובה. לפעמים זה הקשה על ההבנה קצת כי ההרצאה נמרחה בגלל בדיחות שנזרקו לאוויר ולפעמים זה הרגיש שהוא רוצה את האהדה יותר מאשר לימוד החומר. בסך הכל אהבתי את ההרצאות אבל היה אפשר למקד אותן יותר בחומר מאשר במופע.\n\nשם המתרגל/ת: אור מרקובצקי\nחוות דעת - תרגולים: אחלה מתרגלת אבל אין לה מה לעשות יותר מדי כשהמבנה של התרגולים פח אשפה. סתם זורקים שאלות שיש כאלו שהפתרון שלהן הוא שורה וכאלה שנכתבו באנגלית קיצור בלגן שלם. לקראת סוף הסמסטר החומר מסלים ואז התרגולים נהיים יותר משמעותיים. בהתחלה מרגיש כמו בזבוז זמן\n\nשעורי הבית: 3 תרגילי בית תכנותיים + וובוורקים במודל. \nהוובוורקים כן מועילים להבנת החומר היותר יבש בקורס כי אתה מתרגל את הפתרון של הדברים שנלמדו.\nתרגילי הבית התכנותיים ארוכים מאוד ואפשר לשבת על זה שבועיים וחצי בכיף. דורש יצירתיות אבל לא להגזים בסוף אנשים שעשו יותר מדי קיבלו ציון יחסית נמוך.\n\nהמבחן: לא קשור כל כך לחומר. 3 שאלות שעוד איכשהו נגעו לחומר הקלאסי שנלמד ו2 שאלות סתמיות שאחת מהן נשאלת בראיונות עבודה ואחרת קשורה נטו להסתברות. עומר הלהיב אותנו לממוצע גבוה ו100 לכולם אבל המציאות היא שהממוצע בסוף נמוך משנים קודמות והסגל אפילו אמר שהם כיוונו ל70. מבאס. \n\nהשורה התחתונה: קורס שנוגע בנושאים מעניינים אבל יכול להיות ברמה הרבה יותר גבוהה מאיפה שהוא נמצא היום.", "timestamp": 1659336910011}, {"author": "בדיחה", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: מרצה מזעזע... מה קשור אהדת קהל תגיד לי? באת להיות סטנדאפיסט או מרצה? בקיצור לא נהנתי והפסקתי להגיע תוך כמה הרצאות כשהבנתי לאן הרוח נושבת\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: על הפנים.. מתנשאת על הסטודנטים ולדעתי התרגולים מועברים בצורה לא טובה בכלל ולא תורמת להצלחה בקורס או מבחן כלל\n\nשעורי הבית: 3 תרגילי בית - פשוט סתם... לא ברורים ולרוב אין קשר לחומר אלא סתם נסיונות מסכנים בפייתון\n\nהמבחן: מבחן בזיון אין קשר לחומר אבל מה ציפינו מתעשייה וניהול?\n\nהשורה התחתונה: קורס בלאי לגמרי... העיקר עומר יצא בהצהרות שיהיו ציונים טובים אבל מה לעשות? בסוף אתה מרצה בתעשייה וניהול למה שתעמוד במילה שלך? תודה רבה על כלום", "timestamp": 1663317761298}, {"author": "חוק החזקה", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: מרצה פשוט אפס אין לי מילה אחרת לתאר. חושב שהוא מלך על סטודנטים, חש את עצמו בהרצאות כאילו הוא מינימום מייסד האינטרנט, ובמבחנים הוא פשוט בא להשחיל חזק את כולם. מרגיש כאילו הוא היה ילד כאפות בבית הספר ועכשיו זה הזמן שלו להראות לכולם חזרה. \nשם המתרגל/ת: אור\nחוות דעת - תרגולים: לא עוזרת, מתנשאת על סטודנטים, עושה טובה שהיא מתרגלת, אין טעם לבוא לתרגולים שלה בכלל.\n\nשעורי הבית: זוועה, ארוכים ולא מועילים להבין את החומר\n\nהמבחן: הזוי ולא קשור לחומר באף צורה\n\nהשורה התחתונה: הסגל הרס את הקורס", "timestamp": 1664400324815}, {"author": "סוכן רציונלי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: \nסה\"כ בסדר, כריזמטי וניסה להעביר את הקורס בצורה יותר זורמת. מצד שני לא ברורה ההתעקשות על פרונטלי בלבד כשהיו הקלטות של הקורס שנשאר ברובו זהה לשנה שעברה. (הוסיף נושא אחד בסוף סמסטר שדווקא היה מעניין אבל למה למנוע פרסום הקלטות לשאר 95% של הקורס). הקורס מכסה הרבה מאוד נושאים, יכול להרגיש עמוס\n\nשם המתרגל/ת: אור\\ג'וני\nחוות דעת - תרגולים: סה\"כ בסדר, התרגולים האחרונים היו יותר רלוונטיים. יאמר לזכותה של אור שהיא הקליטה את רוב התרגולים מבין אלה שכן העבירה. היה נראה שהמתרגלים לא הכי מחוברים למבחן \n\nשעורי הבית: לדעתי היו בסדר גמור, תכנותי תחרותי ורק 3 במהלך סמסטר. לא תמיד ברורה חלוקת הציונים עבור החלק התחרותי - הרגיש די מבולגן לפעמים \n\nהמבחן: \nנוצרה אווירה של חוסר בהירות לגבי המבחן לאורך הסמסטר עם הבטחות לשינויים בתוכן ומבנה ומצד שני אמירות של \"אל תדאגו\". היה מדאיג.\n\nהשורה התחתונה: קורס חובה מה לא תקחו?", "timestamp": 1665513441453}, {"author": "מכרז מכיר שישי", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עומר בן פורת \nחוות דעת - הרצאות: עומר מרצה כריזמטי אבל סה\"כ לדעתי הקורס משעמם. רוב החומר לא מעניין או לא קיים וההרצאות מרגישות די מרוחות\n\nשם המתרגל/ת: אור מרקובצקי\nחוות דעת - תרגולים: תרגולים סבירים. לא בנויים כזה טוב וחלקם מיותרים אבל סה\"כ אור סבבה\n\nשעורי הבית: 3 תרגילים רטוביפ בפייתון עם ציון תחרותי. תרגילים הזויים שמלמדים אותך שלפעמים עדיף לא לחשוב. (ברצינות בתרגיל בית 3 מישהו הגיש תקוד שהם נתנו ללא שינוי וקיבל 90 כי זה הגיע למקום 2 ). בנוסף שיעורי הבית לא מאוד קשורים לחומר ולא קשורים בכלל למבחן. יש גם בחנים שבועיים במודל שאם עונים על כולם מקבלים 2 נקודות בונוס. מומלץ לענות בשביל הבונוס וגם כי הם קצת עוזרים ליזור על החומר\n\nהמבחן: מבחן לא מאוד קשה אבל די מנותק מהחומר\n\nהשורה התחתונה:", "timestamp": 1666727733787}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: מעביר חומר בצורה סבירה, לפעמים נשחף בלעשןת אוירה טובה בכיתה ולהיות מצחיק ולא מגיע ללמד חומר. בהחלט המרצה הכי מעניין וכריזמטי שהיה לי בטכניון\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מלכה, אין עליה\n\nשעורי הבית: קשים, עמוסים, ציון תחרותי, אבל אין הרבה, והסגל מאד התחשבו בעומס הקורס והקלו מאד לקרטת תקופת המבחנים\n\nהמבחן: קשה ורק קשור לחומר הקורס בצורה מאד חלשה. לא היה איך ללמוד למבחן שבאמת מכין\n\nהשורה התחתונה: קורס מאד מאד מעניין לדעתי אבל דורש השקעה ומזל לקבל ציון טוב", "timestamp": 1667386484889}, {"author": "שודד רב זרועות", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: \nנראה שעומר נהנה ללמד, הוא משקיע בהרצאות ובהסברים ובא מוכן עם דוגמאות מהעולם.\nרוב הזמן הוא מנסה לשעשע את הסטודנטים ולהעביר את החומר בצורה מעניינת, לפעמים גולש לשיחות לא קשורות על קורסים שונים בפקולטה.\n\nשם המתרגל/ת: אור מרקובצקי\nחוות דעת - תרגולים: \nהעבירה את התרגולים כמו שהם מהדף, לא הוסיפה הבנה מעבר.\n\nשעורי הבית: \n3 תרגילים תכנותיים, לוקחים זמן.\n\nהמבחן: \nהכל טוב ויפה עד כאן נכון? אבל המבחן... \nעומר כל הסמסטר אמר לנו \"לא לדאוג\" \"ושיהיה בסדר\". אבל היינו צריכים לדאוג. לפני המבחן גם הוא וגם המתרגלת חזרו מספר פעמים על כך שהמבחן יהיה קל ועומר אפילו אמר שלא היה מביא מבחן כזה לסמסטר גדול יותר (כי הוא קל מדי). בסופו של דבר כמו המבחנים הקודמים שלו, המבחן לא היה מותאם לרמת הקורס והממוצע לפני פקטור היה (שימו לב) 51, בסופו של דבר קיבלנו פקטור שהעלה את הממוצע ל61 ובסוף הוא עוד פירסם \"מסקנות מהמבחן\" שבהן טען (בשורה התחתונה) שהסטודנטים אשמים כי לא התכוננו כמו שצריך. \n(מדובר במועד א בלבד)\nהשורה התחתונה: \nהרצאות מהנות, קורס מעניין ועומר באמת מרצה טוב, המבחנים לא הוגנים.", "timestamp": 1676412669077}, {"author": "מועד א", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עומר בן פורת \nשם המתרגל/ת:  אור מרקובצקי\n\nשעורי הבית: קשים וארוכים \n\nהמבחן: מי שיש לו רקע טוב בקורסי תורת המשחקים והסתברות , יהיה לו קל ללמוד למבחן כי יש מלא חומר שחוזר על עצמו מהסתברות ותורת המשחקים אז חוסך לו זמן בלמידה, מבחינתי המבחן לא היה הכי קשה וניתן לפתור אותו ולקבל ציון ממש טוב למרות שהממוצע היה נמוך יחסית , מי שמבין את ההרצאות והתרגולים מספיק לו יום/יומיים לחזור על מבחנים , מי שעושה עם עומר , פתירת מבחני עבר של רשף לא כל כך יעזרו לו ( אפשר לתרגל שאלות כמו ש\"מ.. ) . \nעדיף לפתור את התרגולים לבד ולהבין אותם טוב ולפתור מבחני עומר ולהבין את הטריקים שלו , ואת דרך החשיבה שהוא רוצה . \n\nהשורה התחתונה: הרגשתי שהקורס הוא קורס הסתברות ותורת משחקים וקצת מסחר אלקטרוני , מי שטוב בהסתברות ותורת המשחקים יהיה לו קורס לא קשה . קורס לק קל אבל לא קשה כמו שעושים ממנו . חומר ממש מעניין .", "timestamp": 1677239198569}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עומר \nחוות דעת - הרצאות: מרצה מצויין, משתדל מאוד לבנות את ההרצאות בצורה כמה שיותר מעניינת ואינטראקטיבית. לפעמים קשה לעקוב אחרי הוכחות מסויימות אבל זה בסדר. נותן מוטיבציה לנושאים הנלמדים. יש גם הרצאות אורח מהתעשייה אבל הן לא כאלה מדהימות.\n\nשם המתרגל/ת: רותם (איזה 3-4 תרגולים אור)\nחוות דעת - תרגולים: התרגולים בנויים בצורה טובה שמחזקת את ההבנה של החומר\n\nשעורי הבית: \nיש בחנים עצמיים במודל שעשייה של כולם חוץ מ-2 מזכה ב2 נקודות בונוס- במהלך הסמסטר ניתן להגיש ריק ולהגיש שוב עם התשובות, אחר כך פותחים אותם שוב לפני המבחן ואלה התרגילים הכי חשובים שעשיתי לפני המבחן. ממש מחזקים את ההבנה של החומר\nבנוסף יש 4 תרגילי בית עם ציונים שעובדים באופן שאם מצליחים להגיע לרפים מסויימים מקבלים לפחות 70 או 80 ואז שאר הציון הוא תחרותי ויכול להגיע גם ל-140 נקודות. בתחילת הסמסטר יש יותר זמן להשקיע בתרגילים התחרותיים וזה ממש נחמד. אם אין זמן בתרגילים האחרונים אפשר די בקלות להגיע לציון סביר תוך השקעה ממש מינימלית. (את תרגיל הבית האחרון שחררו שבוע לפני סוף הסמסטר, עומר נתן רמז בהרצאה שמישהו הבין תוך יום ושלח לכולם והביא לציון גבוה בכמה דקות עבודה)\n\nהמבחן: \nקודם כל, המבחן היה היום וכבר שחררו ציונים, סגל שאשכרה אכפת לו מאתנו (לעומת כמה מקצועות בהם כבר 3 שבועות אין ציונים).\nמבחן שרובו הוא תשובות סופיות למעט 2 שאלות הוכח/הפרך בהם אפשר לכתוב \"לא יודע\". לא מבחן פשוט, אבל רוב המבחן ממש הוגן, טכני ודומה לתרגולים, לבחנים העצמיים ולמבחן של שנה קודמת. שאלה אחת יותר מסובכת שנראה לי שלא ממש הצלחתי (עוד אין סריקות), אבל אפשר להוציא ציון 70-80 עם מעט התכוננות יחסית\n\nהשורה התחתונה: \nקורס חביב ורלוונטי בסמסטר קשוח", "timestamp": 1690739416537}, {"author": "מוני 1 ומוני 2", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: איש מעייף ובלתי נסבל. בהתחלה כולנו נשבנו בקסמו וביעני כריזמה, אבל ככל שהסמסטר התקדם גילינו שהוא סתם פופוליסט שמחפש שכל הסטודנטים יאהבו אותו. לרוב זה יוצא עקום, על סף המעיק, מתנשא וגורם לך לחשוב פעמיים לפני שתשאל משהו כי אולי יגחך מהשאלה. ישבתי בהרצאות והתעצבנתי מכמה שהוא מתאמץ להצחיק ולשחק אותה חלק מהחבר'ה. קורס מיותר, עדיף אולי לקרוא לקורס תורת המשחקים 2. נושא שמרח על 3 שעות הרצאה השלמתי אחר כך ברבע שעה. כל הסמסטר אומר \"סמכו עליי\" ותמיד גרם להבין שהוא הבן אדם האחרון לסמוך עליו. הביא איזה תרגיל בית שלטענתו \"קל\" וסטודנטים בפועל ישבו עליו מעל שבועיים והוא והמתרגלים היו בשוק שכמעט כל הקורס הגיעו לשעת קבלה. חוסר מודעות, אטימות והתנשאות לשמה.\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: סך הכל מתרגלת סבבה אבל התרגול די שטחי לעומת סגנון התרגילים שיש במבחן. עזרה להטמיע ברמה בסיסית את החומר ולצערי לא מעבר לזה. בשעות קבלה ממש ניסתה לעזור לכולם.\n\nשעורי הבית: קאדר ברמות. 4 תרגילי בית תכנותיים תחרותיים. את כל האנרגיות הסמסטר השקעתי בתרגילי בית האלה ולפעמים ככל שתתאמץ יותר תקבל פחות. \n\nהמבחן: ארוך ברמות לסטודנט הממוצע. היו שאלות מתקילות ומוזרות. \n\nהשורה התחתונה: אם לא חובה אז פשוט לא. חבל על העצבים שלכם.", "timestamp": 1690744885491}, {"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: דוגרי, פחות התחברתי. אמנם עומר בנאדם מאוד כריזמטי ורואים עליו שנהנה ללמד, אבל מרגיש לי שהוא מאוד מורח את ההרצאות, וביותר מדי מקרים מזגזג בין להעביר את החומר לבין סטלבט על אנשים/דיון לא כל כך קשור לנושא. היה לי קשה להתרכז ככה במשך 3 שעות הרצאה כשמרגישים שהיה אפשר לסכם אותם בשעה אם הלמידה הייתה באמת ממוקדת.\n\nשם המתרגל/ת: אור ורותם\nחוות דעת - תרגולים: שניהם פחות או יותר תרגלו באיזשהו שלב את כל הקבוצות, ושניהם היו סבבה והעבירו את התרגולים אחלה. \n\nשעורי הבית: בסמסטר לא עמוס הם יכלו להיות מעניינים, כי אלה תרגילים שהעיקר בהם זה להיות יצירתיים ולבנות מודלים חדשים על סמך החומר שלומדים, אבל בסמסטר עמוס זה חונק וביחס לתרומה שלהם לציון הסופי (5% כל תרגיל) זה גם מרגיש מאוד חסר תועלת בדיעבד.\n\nהמבחן: ציפיתי שהמבחן יהיה אוסף חידות הגיון לא קשורות לכלום כמו שאר המבחנים משנים קודמות, אבל באופן מפתיע לטובה היה מאוד הוגן. מי שבא שולט בחומר ומבין אותו יכל בכיף להוציא אחלה ציון. עומר הפתיע לטובה.\n\nהשורה התחתונה: לא התחברתי באופן כללי אבל היה סבבה סה\"כ, וגם ככה זה קורס חובה אז הדעה שלי לא באמת משנה.", "timestamp": 1690744981419}, {"author": "מנקה שוק", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: בחיים לא ראיתי מישהו שמסוגל למרוח חומר של שעה גג על שלוש שעות באופן שבועי. עומר מסוגל לדבר כל כך הרבה על משהו בלי להגיע לפואנטה שזה על גבול המרשים. ההרצאות סופר מעיקות והניסיון הלא מוצלח לבדר את הסטודנטים בכל משפט שני רק הופך את זה לגרוע יותר.\n\nשם המתרגל/ת: אור ורותם\nחוות דעת - תרגולים: סה\"כ היו טובים אבל התרגולים עצמם מרגישים די כמו גרסה מתומצתת של ההרצאות עם איזו שאלה או שניים בנושא. אין הרבה העמקה.\n\nשעורי הבית: ארבעה תכנותיים תחרותיים וכבדים. קונספט מעניין אבל בפועל חופר ומתיש, ומאוד תקוע בגרון בסמסטר עמוס. המוטיבציה של עומר \"להכין אותנו לסיטואציות אמיתיות בתעשייה\" נחמדה אבל לא פרקטית כשהתרגילים כל כך מעמיסים על הסמסטר.\n\nהמבחן: תכלס זה היה החלק היחיד בקורס שהפתיע ממש לטובה. היה מבחן סבבה לגמרי שבאמת בחן שליטה בחומר של הקורס, הסגל בהחלט הפתיע לטובה (ובדקו מהר מאוד, החזירו ציונים כמה שעות אחרי המבחן עצמו).\n\nהשורה התחתונה: מעיק במהלך הסמסטר ודוגרי לא כל כך מעניין, הקורס הוא די מישמש של מלא נושאים שאין המון קשר בינהם (עומר מציין את זה בעצמו). נחשפים בHigh Level להרבה דברים אבל זה באיזשהו שלב ממצה את עצמו.", "timestamp": 1690784998677}, {"author": "?????", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עומר\nחוות דעת - הרצאות: \nסך הכל הרצאות מעניינות, אין הקלטות. לפעמים מתעסק בהוכחות ארוכות ומייגעות שאין להן הרבה משמעות.\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: \nמצוינת\nשעורי הבית: תחרותיים.\nאל תשקיעו יותר ממה שצריך, בסוף הציון הוא לפי תחרות ואם תעברו את הסף תקבלו אחלה ציון.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין, שיעורי בית מעייפים ולא קשורים למבחן בשום צורה.", "timestamp": 1691741100621}, {"author": "דווקא הוצאתי סופי גבוה בסוף", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עומר \nחוות דעת - הרצאות: לא להגיע. להסתכל במצגות מה הנושאים ולחפש סרטוני יוטיוב בנושא\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: בסדר נחמדה סוגרת קצת פינות על החומר בעיקר אם הברזתם מההרצאה\n\nשעורי הבית: חייבים שותף טוב. לא מומלץ להשקיע יותר מידי. אמנם אם תשקיעו ממש תקבלו 130 ואפילו 150 על התרגיל, אבל האם זה שווה את המחיר הנפשי? אפשר גם להסתפק ב95-100, אין צורך לקפוץ מהגג רק כי עומר אמר לקפוץ מהגג\n\nהמבחן: הסתדרתי עם 3-4 ימי למידה\n\nהשורה התחתונה: עומר מלא בכוונות טובות וניסיון לייצר קורס משמעותי אבל הפואנטה קצת התפספסה... בעיקר יצאו הרצאות מרוחות ותרגילי בית מנופחים יתר על המידה. קחו את העניין בפרופורציה", "timestamp": 1696347569712}]}