{"posts": [{"author": "0000", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נירית\nחוות דעת - הרצאות: פעם ראשונה זה הועבר, נירית חכמה מאוד ומקצועית בתחום הוux אבל לפעמים לא הבנתי למה היא מתכוונת בהערות שלה\nההרצאות קצת משעממות (3 שעות ראשון בבוקר ), אם הייתה עושה כתה הפוכה: לפרסם סרטונים ולצפות בהם ואז לעשות שעה וחצי הרצאה היה יותר יעיל מ3 שעות הרצאה!\nיש ציון על השתתפות פעילה בהרצאות , היא נותנת מטלה בזמן ההרצאה ומקדישה זמן של 10-20 דקות לסטודנטים לעשות את המטלה בקבוצות ואז להציג בקטנה\nיש שתי עבודות משקל כל אחת מהם 30%(בקבוצות) להגיש תוך כידי הסמסטר בנוסף לתרגילי בית.\n\nשם המתרגל/ת: גם נירית\nחוות דעת - תרגולים: התרגולים היו כמו שעת קבלה , ענתה בהם על שאלות בנוגע לתרגילי בית ועבודות .\n\nשעורי הבית: תרגילי בית שבועיות שממש לא דורשים יותר משעה (אפילו חצי שעה) .\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: קורס חמוד , למצוא שותפים רציניים ומקבלים אחלה ציון", "timestamp": 1689703895533}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נירית\nחוות דעת - הרצאות: נירית מאוד חמודה אבל לא כל כך כריזמטית. החומר של הקורס ממש מעניין ורלוונטי אבל הוא מועבר בצורה די משעממת, 3 שעות שבדרך כלל כוללות הסבר קצר של נירית מהמצגת, ואז היא מראה לנו סרטונים מהאתר של מעצבי UX של ישראל שזה כמו הרצאות TED בעברית על חוויות משתמש ואז נותנת לנו איזה משימה לעשות בקבוצות בזמן ההרצאה ומי שרוצה מציג. 10% ציון תקף אם הצגתם לפחות פעם אחת בכל הקורס. נוכחות כביכול חובה אבל היא אף פעם לא בדקה\n\nשם המתרגל/ת: נירית\nחוות דעת - תרגולים: תכלס אין באמת, זה כמו שעות קבלה למי שצריך על התרגילי בית\n\nשעורי הבית: כל שבוע יש תרגיל בית- צריך לראות איזה סרטון TED כזה ולענות על שאלה. בהתחלה קלילים ובהמשך הקורס נהיים יותר חופרים. 100 בדרך כלל מובטח אם כתבתם משהו הגיוני. המסה העיקרית זה 2 עבודות קבוצתיות, צריך להמציא איזשהו מוצר/מערכת או שיפור למוצר קיים ואז לאפיין אותו מבחינת חוויית משתמש וליישם את כל מה שלמדנו. העבודה השנייה היא המשך של הראשונה ושתיהן חופרות באותה מידה סטייל הפרויקטים בעקרונות השיווק. תמצאו קבוצה טובה וכנראה תקבלו מעל 90\n\nהמבחן: אין\n\nהשורה התחתונה: התוכן של הקורס מעניין ורלוונטי, פרויקט חופר אבל לא עמוס, ציונים גבוהים, סה\"כ קורס בחירה משתלם ממליצה", "timestamp": 1691066960794}, {"author": "ניק", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נירית\nחוות דעת - הרצאות: הרצאות מעט ריקות מתוכן. המצגות לגמרי לא אינפורמטיביות. מה שכן החומר עצמו מאוד מעניין ונירית מבינה הרבה בעניין אז צריך לגמרי להיות איתה בראש ולנסות לעקוב.\n\nשם המתרגל/ת: שעות קבלה\nחוות דעת - תרגולים: התרגולים בעצם היו שעות קבלה אחרי ההרצאות. בכל שבוע הייתה משימה קטנה של לצפות בסרטון ולענות על שאלה או 2 (לוקח עד חצי שעה).\n\nשעורי הבית: שני תרגילים גדולים שבגדול אפיון המערכת וחוויית משתמש. יש חלק קבוצתי ויש חלק אישי, כדאי למצוא שותפים טובים.\n\nהמבחן: אין.\n\nהשורה התחתונה: אחלה קורס, צריך להיות בראש של נירית ואז אפשר להבין ולהצליח", "timestamp": 1691667653858}, {"author": "Nina Kahn", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נירית גביש\nחוות דעת - הרצאות: לא מאוד ברורות, והיתה הדרדרות עם הזמן. לדעתי הגעה להרצאות חשובה להצלחה בפרויקטים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: שומשו כשעות קבלה עם נירית לפרויקט. עזר להגיע ולשאול ולקבל הכוונה, בפציפית כי ההנחיות וההרצאות קצת עמומות, וזה גם מראה השקעה בקורס.\n\nשעורי הבית: שני פרויקטים יחסית כבדים, חלק מהעבודה בקבוצות וחלק יחידני. בנוסף, כל שבוע היה צריך לראות סרטון ולעשות מטלה (אסינכרוני).\n\nהמבחן: אין\n\nהשורה התחתונה: מעלה את הממוצע.", "timestamp": 1691866279877}]}