{"posts": [{"author": "אליעזר שלומי", "difficultyRank": 5, "generalRank": 2, "semester": "201902", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: \nהרצאות עמוסות, כל מילה של המרצה חשובה. כדאי להבין טוב את החומר בשביל המבחן\nשם המתרגל/ת: אפיק בר\nחוות דעת - תרגולים: \nמתרגל סבבה, כשיש חומר חדש בתרגולים כדאי להקשיב כי זה יכול להופיע במבחן (MRJOB, SPARK)\nשעורי הבית: \nהיה פרויקט עם 4 חלקים כאשר כל חלק עם יבש ורטוב כאשר היבש בדרכ היה במבחן של שנה קודמת. מומלץ לנסות להשיג את המבחן עם פתרון של שנה לפני. הרטוב יחסית ארוך ונגרר עד אחרי הסמסטר \nהמבחן: \nיש 2 בחני אמצע במקום מבחן, מומלץ להבין את החומר התאורטי מההרצאות ולהשתפשף טוב טוב ברטוב\nSQL יכול להופיע וגם הופיע\nהשורה התחתונה: \nקורס לא כל כך מעניין ועמוס", "timestamp": 1597741706440}, {"author": "שליחי הדודה", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: הרצאות לא קשות ויחסית מעניינות\n\nשם המתרגל/ת: נוגה\nחוות דעת - תרגולים: תרגולים קצרים ולא הכי מועילים\n\nשעורי הבית: שב יבשים לא קלים ויש שאלות קשות וארוכות. הסטודנטים בודקים לעצמם. שב רטוב לא רלוונטי לחומר בכלל, סתם מציק אבל לא ארוך מאוד.\n\nהשורה התחתונה: מרצה מאוד הוגן. לומדים כלים חשובים ורעיונות מעניינים, דרך חשיבה חדשה", "timestamp": 1597748998419}, {"author": "אווטאר אנג", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אפיק בר\nחוות דעת - תרגולים: \nמתרגל לא יעיל, התרגולים יחסית בזבוז זמן והחומר לא מועבר במלואו. הוא שינה את התרגולים למשהו שנראה יחסית טוב אך הם הרבה פחות טובים והיה טוב לו היו נשארים בצורתם המקורית.\nפחות או יותר מלמד את עצמו.\nשעורי הבית: \nקשים ומפרכים, צריך להיזהר כי הם תמיד ימצאו על מה להוריד ועדיף שיהיה כמה שפחות\nהמבחן: \nהיו 2 בחני אמצע עם ממוצע יחסית סביר ומפוקטרים. בגלל שהמבחן היה בסמסטר קורונה הוא הוסיף חלק רטוב למבחן שצריך להגיש קוד מתקמפל\n\nהשורה התחתונה: \n\nלא לקחת אם לא חייבים", "timestamp": 1598801175494}, {"author": "שליחי הדודה", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: אביגדור\nחוות דעת - הרצאות: מרצה משעמם ונוראי, לא מתחשב בכלל, חומר משעמם ולא בהכרח רלוונטי.\n\nשם המתרגל/ת: אפיק\nחוות דעת - תרגולים: מתרגל גרוע, לא עוזר, לא יודע בכלל את החומר. התרגולים לא עוזרים בכלל, צריך ללמוד הכל לבד איך להתמודד עם הפרוייקט או עם הבחנים. רק לקרוא את התרגולים, המתרגל נוראי.\n\nשעורי הבית: פרוייקט הזוי לא לומדים כלום בקורס, הכל לומדים לבד מהאינטרנט.\n\nהמבחן: בחנים שלא בוחנים ידע. מרצה שלא בוחן ידע ולא מתחשב בכלל.\n\nהשורה התחתונה: הקורס הכי גרוע שיש. אם יש אפשרות אז לא להתקרב. צוות קורס זוועה, לא מתחשב והמתרגל ביזיון. לא לומדים כלום מהקורס. קורס לא מעניין ולא רלוונטי לכלום. לא מפיקים ממנו תועלת בכלל.", "timestamp": 1601387623426}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: מרצה טוב מאוד, מעביר את התכנים בצורה מאוד ברורה ומשתדל המון להביא דוגמאות מהחיים האמיתיים בשביל לחבר אותך על החומר. בנוסף בשעות קבלה הוא עוזר מאוד.\n\n\nשם המתרגל/ת: אפיק בר\nחוות דעת - תרגולים: \nהמתרגל על הפרצוף בלהעביר את החומר שהוא רוצה אל הסטודנטים. התרגולים היו בעיקר על תכנים רטובים (spark, nosql, streaming וכו...) ורובם היו ביזבוז זמן, עדיף היה ללמוד לבד מאשר להשקיע את הזמן בכיתה.\n\n\nשעורי הבית: \nשיעורי בית לא ברורים בכלל. מנסים לתת לך חופש פעולה בפתירת תרגילי הבית ולגרום לך להפעיל יצירתיות אבל בפועל נוצר מצב של הנחיות לא ברורות (ולעיתים סותרות בין 2 המתרגלים) שגורמות לתסכול רב.\nהמתרגלים לא מתואמים בינם לבין עצמם ונוצר מצב שבזמן פתירת ש\"ב אף סטודנט לא בטוח ב100% מה נדרש ממנו וצריך לנסות להבין מסטודנטים אחרים שגם הם לא בטוחים 100% מה קורה.\nלשאול את המתרגלים זה סיכון בפני עצמו כי אתה יודע שכאשר אתה שואל שאלה אתה מסתכן בכך שלמחרת המתרגל השני יענה ההפך.\n\nהמבחן: \n2 בחנים במקום מבחן, הסמסטר הזה הבוחן חרק מהנורמה של מבחנים משנים קודמות והיה פקטור לא קטן, אך באופן כללי הבחנים עוזרים מאוד להבין את החומר התיאורטי.\n\nהשורה התחתונה: \nקורס עם תכנים מעניינים, חבל שהתרגילי בית והפרוייקט ככ לא ברורים כך שהם לוקחים פי 3 מהזמן שאמור היה לקחת רק בגלל הנחיות סותרות ומתחדשות.", "timestamp": 1623915596023}, {"author": "מסד נתונים מבוזר", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אביגדור גל\nחוות דעת - הרצאות: מרצה נהדר, חבל שהחומר שהוא מלמד לא מעניין במיוחד.\n\nשם המתרגל/ת: אפיק בר וקורל שרף\nחוות דעת - תרגולים: אפיק אחראי על התרגולים המעשיים (Spark וכו') וקורל על התרגולים התיאורטיים. שניהם לא ברורים בעליל, מה שבא לידי ביטוי בציוני הבחנים ובפרויקט.\n\nשעורי הבית: שני תרגילי בית המכילים שילוב של שאלות תיאורטיות ומעשיות, 3 'מעבדות' להתנסות בכתיבה בטכנולוגיות הנלמדות במהלך הסמסטר, ופרויקט עמוס במיוחד בשני חלקים. כל אלו לא משקפים בכלל את הרמה הנדרשת לבחנים.\n\nהמבחן: אין מבחן סופי, יש שני בחנים במהלך הסמסטר. מכילים שאלות תיאורטיות ברמה גבוהה עד כדי לא הגיונית ושאלות תכנות ב- SQL וב- MapReduce/Spark.\n\nהשורה התחתונה: קורס שאמור להוות אבן דרך משמעותית ואמור ללמד עקרונות חשובים ושימושיים ביותר להמשך, אבל מועבר בצורה גרועה, ממש כמו כמו הקורס הקודם לו. חבל ש(כמו בקורס הבסיסי) לא מאפשרים לסטודנטים ללמוד בצורה אפקטיבית שפות חשובות כמו SQL ו- Spark ופשוט 'זורקים אותנו למים' עם שאלות לא הגיוניות בבחנים ועם גליונות שיעורי בית שהם פשוט בדיחה גרועה.", "timestamp": 1625651567503}, {"author": "סטודנט מאוכזב", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "הרוב כבר נאמר בחוות דעת קודמות - קורס המועבר בצורה מבישה כקונצנזוס. בהרצאה הראשונה למרצה היה חשוב לציין כי הוא מודע לחוות הדעות השליליות יחסית שנרשמו כאן לגבי הקורס, ואם זאת אני בטוח שהסמסטר הקורס הועבר בצורה מזעזעת שוברת שיאים.\nמצער מאוד שזה קורה במיוחד בקורס ליבה כמו הקורס הנ\"ל, בו היינו אמורים ללמוד הרבה כלים פרקטיים אותם דורשת התעשייה.\nעול - לא לקחת אם אין צורך, ואם כבר לוקחים - לא להעז לבזבז זמן על התרגולים של אפיק בר.", "timestamp": 1626102638350}, {"author": "DDos", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: פרופסור אביגדור גל\nחוות דעת - הרצאות: \nכשהאבטלה הסמויה חוגגת באוניברסיטאות, הסגל של מבוזר הינו בדיוק ההגדרה המדויקת לכך.\nקורס עם פוטנציאל אדיר אבל עם סגל כושל שכל אחד יותר גרוע מהשני בתחומו שלו.\nפרופ' אבי גל, מגיעות לך מחיאות כפיים על שני בחנים שלא קשורים לחומר הנלמד עם ממוצעים מזעזעים, אתה בטח ישן טוב בלילה כשאתה יודע שאתה מחלטר סמסטר שלם חומר של יום למידה אחד ובוחן על דברים אחרים.\nמבחינת יכולות הוראה- לראות רק מוקלט אי אפשר להקשיב לו.\nשם המתרגל/ת: \nאפיק בר וקורל.\nחוות דעת - תרגולים: \nאפיק בר- אין מה להוסיף, התגלגל לפה במקרה, ואם הוא לא היה בפקולטה לתעשייה בניהול הוא כנראה היה נגד לוגיסטיקה בצה\"ל. \nקורל- אין מה להגיד גם כן, לוקחת חלק בקורס הכי בזיוני בתואר.\nשעורי הבית: \nלא ברורים, חבל על הזמן שלכם. ללכת לשעת קבלה? יהיה עוד יותר לא ברור. \nממליץ לדחות לסוף את העבודה עליהם, כי הסגל בעצמו לא יודע מה הוא רוצה מאתנו והם מוסיפים דברים כל הזמן (בהתאם לשאלות של אנשים נודניקים שנותנים להם רעיונות ולא קולטים סיטואציה של סגל חלטוריסט)\nהמבחן: \nמה אפשר לצפות מסגל כזה נוראי... שני בחנים עם ממוצע נכשל, הבחן השני עם ממוצע 20 ומשהו, מי שחרטט יותר ניצל יותר, עצוב להגיד אבל פשוט לחרטט הם בעצמם לא יודעים לפתור.\n\nהשורה התחתונה: \nהקורס הכי בזיוני בפקולטה, מנוהל על ידי חבורה של אנשים שכל אחד מהם מביא לשולחן את הביזיון שלו. לא מלמד כלום (אולי כי הם לא יודעים בעצמם?...)\n\nעד כאן DDos", "timestamp": 1627892223191}, {"author": "סטודנט מבואס", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאבי גל- הרצאות משעממות, לא מראה רלוונטיות של החומר לתחום המקצוע, יש הרגשה שניתן ללמד את כל החומר התיאורטי בקורס ביום יומיים.\nהקורס התנהל בצורה ביזיונית לאורך הסמסטר, ולמרות שהם פירסמו לו\"ז בתחילת הסמסטר הם לא עמדו בו אף פעם.\nבדיקת שיעורי הבית קרתה רק לאחר 3 חודשים ואף אחרי המועד ב, וגם שם הם התקטננו נורא. \nשם המתרגל/ת: \nקורל- תרגולים מיותרים, בתרגילי בית הרגיש שהיא לא יודעת להסביר מה הם בעצמם רוצים מאיתנו בכלל.\nאפיק בר- אמור היה ללמד אותנו ספארק, אמור זאת בדיוק ההגדרה, חבל כי זה נושא שמאוד חשוב לעתיד המקצועי.\n\n\nשעורי הבית: \nביזיוניים למדי, ציון אפס ביכול התבטאות לסגל הזה. כל תרגיל יותר לא ברור מהשני. בשעות הקבלה הם רק יוצרים עוד יותר בלגן, ובעקבות שאלות של אנשים תמיד נוספות הנחיות חדשות עד לשנייה \nהמבחן: \nנתחיל מזה ש-10 ימים להחזרת ציון בבחן זה המלצה אצל הסגל הזה, זה הגיע למצב שכולם מיואשים מהאיטיות שהוא עובד בה כך שאפילו ביום ה-10 אחרי המבחן אף אחד לא שאל מה עם הציונים בכלל.\nשני בחני אמצע מזעזעים עם ממוצעים נמוכים מאוד ופקטורים הזויים.\nלא בחנו על מה שהם לימדו, ונתנו נקודות למי שחירטט יותר.\nחבל שאי אפשר לבחון בצורה הוגנת כאשר מנסים בכוח להוריד את ממוצע הקורס.\nהשורה התחתונה: \nהקורס הכי ביזיוני בפקולטה לתעשייה וניהול- מי שיכול שייקח את הקורס המקביל בפקולטה למדעי המחשב.\nקורס שיכל ללמד  המון, וסיים כשהוא תקוע בגרון.", "timestamp": 1628014474718}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמשעמם קשות, לא מתחבר לכלום, אין קשר בין המשפטים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאפיק- ממש משתדל אבל קשה להבין מה הוא אומר, לא הצלחנו ללמוד כלום\nקורל- מנסה להעביר ולענות על שאלות, אכפתית, עדיין קשה להבין\n\nשעורי הבית: מחרידים. מנוסח בצורה מחפירה, כאילו תורגם מגוגל טרנסלייט מאינדונזיה. בדיקה דקדקנית. לא ברור מה שואלים. עברו 4 חודשים מהגשת התרגיל וטרם נבדק.\n\nהמבחן: \nשני בחנים מגוחכים. ממוצעים של פחות מ40. בדיקה מטורללת. \nפרויקט- היקף הזוי. לא ברורים. אין הוראות. גרוע ומשעמם\nהשורה התחתונה: \nלברוח ממש מהר אם אפשר. עדיף לוותר.\nדורש כל כך הרבה יותר ממה שזה שווה. לא מלמד את החומר החשוב והרלווטי, עדיף לקחת קורס אינטרנטי.", "timestamp": 1629027422973}, {"author": "מסד נתונים מבוזר", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "חייב להשאיר המשך לחוות הדעת שלי כי הקורס הזה מתנהל בצורה פשוט מחפירה שלא נראתה כמותה בשום קורס אחר בטכניון, או אפילו בשום מוסד אחר בארץ.\nבכל זאת נתחיל עם הפלוסים: לקורס הזה יש חשיבות רבה לסטודנטים במסלול נתונים ומידע ולומדים בו דברים ממש חשובים להמשך. וגם אבי גל אחלה מרצה (למרות שלפעמים הוא עשוי להעביר את החומר בצורה די מונוטונית ומשעממת).\nועכשיו למינוסים:\n1. הבחנים בקורס הזה לא משקפים *בכלל* את החומר המועבר בהרצאות והתרגולים. הסגל הצליח לכתוב בחנים כל כך מחרידים שגרמו לכולם לצאת עם פה פעור ולהגיע לממוצע נכשל. הניסיון של הסגל לנרמל את הציונים ('פעמיים שורש ההפרש ממאה ועוד 9 נקודות', אם זה לא היה עצוב הייתי צוחק מרוב זה מגוחך) במקום לטפל בשורש הבעיה הוא פשוט פתטי. ובנוסף לכל זה, החזרת ציונים בפרק הזמן המוכתב בתקנון הוא לגמרי בגדר המלצה.\n2. ממש כמו בקורס הבסיסי - מדברים כל כך הרבה על החשיבות של ההיבטים הפרקטיים אבל בפועל לא מלמדים כלום ושום דבר במהלך הסמסטר. סגל הקורס ציפה שנצא מהקורס הבסיסי בתור אשפי SQL אבל בפועל כמעט ולא לימד דבר, ועכשיו ההיסטוריה חוזרת על עצמה עם Spark. במקום לתת תרגול/תרגילי בית ברמה סבירה וכמות הגיונית (שאשכרה יכולים להעשיר את הידע של הסטודנטים ואולי אפילו לגרום להם להפיק משהו מהתהליך), שיעורי הבית שקיבלנו היו בקושי תרגיל וחצי בכל נושא. איך אפשר לצפות שסטודנטים יצליחו ללמוד ככה את חומר הקורס ועוד יצליחו לפתור שאלות במבחנים? וזאת הזדמנות מצוינת לפנות באופן אישי לאפיק בר - להיות מתרגל זה לא בשבילך אחי. אני בטוח שאתה מנסה לעשות את המיטב, אבל כולנו (ללא יוצא מהכלל) יצאנו מהתרגולים שלך יותר מבולבלים ממה שהגענו אליהם, וה'עזרה' שלך בכל הנוגע לפרויקט (על שני חלקיו) רק מסבכת את העבודה עוד יותר.\n3. ואם כבר מדברים על זה, הפרויקט. הסגל פשוט לא סגור על הדרישות שהוא עצמו קובע, כל שאלה חדשה שנשאלת בפורום או בשעות קבלה גוררת שינויים בדרישות. בעוד שכמות שיעורי הבית בקורס ממש ממש מזערית, הפרויקטים הם בסדר גודל עצום וגוזלים המון זמן כי סגל הקורס פשוט לא מואיל בטובו להעביר את החומר הדרוש ואשכרה זורק אותנו למים - לכו תלמדו Spark בעצמכם ושיהיה בהצלחה. והחלק הכי גרוע, בעוד שבסמסטרים קודמים כל צוות קיבל שרת בדיקות משלו, בסמסטר הזה כל הסטודנטים קיבלו שרת *יחיד* שאפילו לא פועל 24 שעות. אז עכשיו אנחנו אפילו לא יכולים לבדוק על השרת אם מה שעשינו הוא נכון כי יש תור של לפחות 20 אנשים שכל אחד מבצע הרצה של חצי שעה מינימום. אה וגם הפרויקט נפתח *בזמן תקופת המבחנים* ככה שזמן העבודה עליו כבר נעשה יותר קצר, כי מי עומד לשבור את הראש על ההנחיות הלא הגיונות האלה שמפילים עלינו במקום להשקיע את הזמן בלמידה למועדי א'.\n\nסגל הקורס, ההתנהלות שלכם בסמסטר הזה הייתה מחפירה ומזלזלת ברמות שבחיים לא נתקלתי בהן בטכניון ואני לא מאחל לאף סטודנט לעבור את מסכת העינויים שעברנו איתכם.", "timestamp": 1629061953792}, {"author": "מחזור ד'", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אבי גל \nחוות דעת - הרצאות: \nהיכולת של המרצה לדבר על כלום במשך המון זמן היא פשוט יוצאת דופן. \nהרצאות משעממות, כמעט ולא קשורות באמת לקורס. \n\nשם המתרגל/ת: אפיק / קורל \n\nחוות דעת - תרגולים: \nשניהם אולי אנשים סבבה, אבל כמתרגלים - פחות. \nקשה לעקוב, קשה להבין. וגם אם הבנת - לא סביר שזה יהיה פרקטי ובאמת יעזור. \n\nשעורי הבית: \nקשים ולוקחים זמן. בטח עם ההורדות של החבילות השונות וspark. הם לא מורכבים, אבל יכולים לקחת המון זמן. \n\n\nהמבחן: \nבחני אמצע - מזעזעים. נועדו כדי להוריד את הממוצע. \nאני עד היום מחכה שאבי גל יסביר לי איך פותרים את אחת השאלות מבוחן שהיה. \n\nפרויקט - \nבמבט לאחור - לא מטורף. \nבמהלך הסמסטר - מזעזע. גם היה דחייה של תאריך ההגשה לתוך תקופת המבחנים, גם לא היה אמצעים ראויים לעבודה (השרת היה עמוס, ההמתנה הייתה מאוד ארוכה והריצות גם). \nההסבר של הפרויקט היה נוראי, לא היה תיאום בין המתרגלים על מה היה צריך לעשות. \n\nוגם - קיבלנו את הציונים בשבוע שלפני תחילת ססמטר חורף (על ת\"ב 1!!) \n\nהשורה התחתונה: \nהסגל נורא, והם גורמים לקורס להיות נורא. \nהחומר חשוב, וחלקו מעניין ובאמת רלוונטי. \nלקחת הרבה נשימות עמוקות תוך כדי הסמסטר.", "timestamp": 1635346366319}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: קורל\nחוות דעת - הרצאות: \nקשה לעקוב, כדאי מאוד לעבור על התוכן לבד עם סיכומים.\nשם המתרגל/ת:  דניאל\nחוות דעת - תרגולים: \nמעניינים מאוד, פרקטי, מקנה יכולות לעבוד עם סביבת עבודה חדשה.\nשעורי הבית: \n3 מעבדה, 2 שיעורי בית, 2 חלקי פרויקט. פרויקט שדורש המון זמן - מתבסס על כך שתלמדו לבד איך לתכנת בSPARK באינטרנט. \nהמבחן: \nהוגן ומובן. שונה משנים קודמות.\n\nהשורה התחתונה: כלים מעולים, נושאים מעניינים, דורש השקעה וזמן בכדי לקבל ציון מאוד גבוהה. מבחן סופי היה שווה 24% מבציון הסופי.", "timestamp": 1658063174932}, {"author": "Lightning Shepard", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: קורל\nחוות דעת - הרצאות: מרצה לא מדהימה.. ברחתי להקלטות של אבי וגם זה לא עזר.\nבכללי ההרצאות בקורס הזה מרגישות מאוד תלושות, לא מעניינות, לא רלוונטיות, פשוט מיותרות.\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: מראה לכם קוד. יכולים באותה מידה לגגל pyspark וללמוד מהאינטרנט, אין יותר מדי ערך מוסף.\nחסר מאוד תרגול של שאלות על החומר התיאורטי שנלמד בהרצאה. כתוצאה מכך, שאלות תיאורטיות בש\"ב הופכות למצעד חרטוטים ורפרונסים, והממוצע של המבחן נראה כמו שהוא נראה.\nאם לקורס היו שעתיים תרגול כמו מסדי, והיה מתרגל גם את הנושאים התיאורטיים, המצב הכללי של הקורס היה הרבה יותר טוב.\nבמשפט - הקורס צריך את בר גינוסר (או פשוט מתרגל שבאמת בא להשקיע ולתקן את הקורס)\n\nשעורי הבית: \nיש 3 מעבדות בתחילת הקורס -הן רק 6% אבל כנראה הדבר שעבר הכי טוב בקורס. קודים לא ארוכים מדי שעוזרים לכם לתרגל את הsyntax של Map Reduce וpyspark\n2 הגשות, כל אחת 10%(!), בכל אחת חצי קוד חצי תיאורטי.\nשווה לציין שגם אחת ההגשות וגם חלק ב' של הפרויקט מתבססים קצת על ML, אז עדיף לקחת למידה חישובית 1 לפני/במקביל (תכלס לא ברור למה הכניסו ML, סתם).\nפרויקט ב-2 חלקים - כל חלק 25%!!! חלק א' נותן ניסיון טוב בData Analysis לאלו ללא ניסיון קודם, וחלק ב' נותן ניסיון באימון מודל ML על dataset נתון. \nבחלק ב' אחת השאלות דרשה מהסגל לפתוח שרתים, משימה שהוא כשל בביצועה, ובמקום לעשות את הצעד הבוגר ולפסול את השאלה, הם החליטו באופן הזוי לדחות את ההגשה לסוף הקיץ! (אחרי המבחנים).\n\nהמבחן: המבחן 24% אז מראש המצב די מגוחך... עדיף שיגרטו את המבחן או שיעלו לו את המשקל, כי מה שקרה הוא שכולם למדו רק יומיים, והממוצע היה 65 אחרי פקטור, ולרוב האנשים (בצדק) לא אכפת מספיק כדי לשפר.\nבכללי גם לא היה אפשר ללמוד למבחן כמו שצריך, כי מעולם לא תרגלנו שאלות תיאורטיות (ראו לעיל), ולמבחנים שהעלה הסגל לא היו פתרונות רשמיים.\n\nהשורה התחתונה: קורס בזוי מהמעלה הראשונה. הייתם מצפים שאחרי הביקורות שנתנו שנה שעברה, זה שהמרצה האחראי השתנה, וזה שיש מתרגל מאתו מחזור שחוו את הביזיון של הקורס, המצב ישתפר - אבל לא.\nכנראה שהחומר רלוונטי לתעשייה, אבל בגלל איך שעבר, כשתצאו מהקורס תרגישו שזה היה מיותר כמו חישוביות וסיבוכיות", "timestamp": 1658494061279}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: קורל שרף\nחוות דעת - הרצאות: הרצאות על הפנים. \nעמוסות במידע ומלל וההרצאה מרגישה כמו נצח. \nקשה להתרכז בכל העומס מידע הזה ובאמת שלא מובן מה התכלס של מה שהסגל מנסה להעביר. \nאל תלכו להרצאות פרונטליות סתם בזבוז זמן.\n\nשם המתרגל/ת: דניאל יחזקאל\nחוות דעת - תרגולים: בגדול התרגולים היו בסדר. דניאל עובד עם spark והוא יחסית מבין את השפה אבל רוב התרגול הוא הקראה ממחברת פייתון ונקודות קטנות שהוא מוסיף בעל פה. \nלא קיבלתי ערך מוסף מהגעה פרונטלית לתרגולים.\n\nשעורי הבית: 3 מעבדות + 2 תרגילי בית + פרויקט ב2 חלקים.\nאני אתחיל ואומר שהתנהלות הסגל בשיעורי הבית מזעזעת ונוראית. \nמעבדות: ליישם את הנלמד בתרגולים בצורה קצת שונה. מרגישים אבודים בהתחלה אבל עם קצת מאמץ מסתדרים.\n2 תרגילי הבית: יש חלק תיאורטי מההרצאות וחלקים תכנותיים. החלקים התכנותיים סבבה לא קשים מדי.\nהחלקים התיאורטיים לעומת זאת.......\nאף אחד מהמתרגלים לא ידע לענות כמו שצריך על השאלות שלנו כי הם בעצמם לא מבינים כל כך את הנושא.\nחלק מהדברים שהם אמרו גררו הורדת נקודות אבל כמובן שאחרי ערעור החזירו לנו אותם.\nבנוסף זה לא באמת מה שנלמד בהרצאה אלא איזו נישה שהסגל ראה לנכון להעמיס עלינו סתם.\nבקיצור תרגילי הבית מתישים ברמה בלתי נסבלת.\nהפרויקט: הביזיון של התנהלות הסגל ממשיך גם כאן והוא מכה בענק.\nאף אחד מחלקי הפרויקט לא נוסח בצורה טובה וגרר המון המון שאלות.\nבנוסף, הסגל מצא איזה משהו שנראה טוב באינטרנט והחליט לזרוק אותו עלינו בלי להתעסק עם המידע בעצמם!\nאנחנו מצאנו המון טעויות במידע שהביאו לנו ודברים שתקעו אותנו ימים שלמים ובסוף אנחנו הבאנו לסגל את הפתרונות שיפרסמו לכולם!!! באיזה עולם סגל לא מסוגל להתמודד עם פרויקט שהוא עצמו הביא?!\nוהנה הפאנצ'ליין של הסגל: החלק האחרון בפרויקט שהוא עבודה עם שרתים על מידע שמגיע בצורה דינמית.\nהסגל לא מבין מושג ואפילו חצי מושג במה שהולך שם ולא הצליחו לעזור לנו עם אף שגיאה. הם נתנו לנו פקודות שלא עובדות טוב ואנחנו נאלצנו לשרוף כמעט חודש כדי להצליח לפתור את זה - והחודש הזה היה בקיץ!!!!!!!\nהם לא הצליחו להעמיד את השרתים בזמן (בשבועיים האחרונים של הסמסטר) לכן כל העבודה על השרתים זזה לאמצע אוגוסט עד אמצע ספטמבר. \nבקיצור הפרויקט הזה יעלה לכם בבריאות הנפשית יותר מפעם אחת.\n\nהמבחן: יחסית לשנים קודמות היה יותר ברור. 2 חלקים: אחד שקשור לתכנות ב spark והבנת השפה והשני קשור לחומר ההרצאה. המבחן בסך הכל 24% אז הציון שלו לא קריטי בכלל. קבלו 60 וקפלו את הבסטה אין מה להתרגש.\n\nהשורה התחתונה: בושה וחרפה של קורס.", "timestamp": 1663155120570}, {"author": "ספארק", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: קורל\nחוות דעת - הרצאות: לא הייתי כל כך בהרצאות\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: תותח! רואים שהוא מבין בספארק והוא מאוד  קשוב ורוצה לעזור לסטודנטים\n\nשעורי הבית: 3 מעבדות, 2 תרגילי בית, פרויקט בשני חלקים\n\nהמבחן: בדיחה מהלכת... בדיקה הזויה וכרגיל מנסים לנרמל לנו את הציונים\n\nהשורה התחתונה: \nקורס בזיון... מומלץ בחום להתרחק כל עוד אפשר (אבל אי אפשר) הבדיקה בתרגילי הבית הזויה וכרגיל עומר ציצילסקי האגדה תורם רבות לנרמול הציונים כלפי מטה... לא מבין מה כואב לו, אנחנו לא במלחמה איתך על הציונים חבר! תהיה בן אדם גם אתה היית סטודנט במצבנו פעם לא ככה?\nקורס עמוס ומיותר, לא תורם לתעשייה ובטח שלא לרמת המשכל שלנו, אז תעשו לעצמכם טובה ואל תתרגשו מאף תרגיל בית ומאף פרויקט כי גם ככה יבוא בודק התרגילים המהולל ויתן לכם ציון נמוך בטענות הזויות", "timestamp": 1663317502117}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: קורל\nחוות דעת - הרצאות: ראיתי חלק מוקלט, הן מאוד תאורטיות וחלק מהמבחן מבוסס עליהן. כדאי להבין את החומר המעובר. \n\nשם המתרגל/ת: דניאל \nחוות דעת - תרגולים: מתרגל מאוד נחמד, תמיד מוכן לעזור. התרגולים מאוד קצרים, ולעניין, אבל לא מרגיש שהן יותר מדי עוזרות להבנה. יש שם דוגמאות שעוזרות בתרגילי בית. \n\nשעורי הבית: יש 2 עבודות, פרוייקט שמורכב מ2 חלקים מופרדים ומעבדות. הכל בזוגות חוץ מהמעבדות. העבודות לא קשות מדי, ולא דורשות יותר מדי השקעה. יש 3 מעבדות קטנות אשר יכולות להיות טיפה מבלבלות אבל הן לא קשות. הפרוייקט מורכב מ2 חלקים נפרדים, ודורש הרבה זמן והשקעה. הבודקי תרגילים עלולים גם להוריד ניקוד על כל דבר קטן.  הוא מהווה את רוב הציון. \n\nהמבחן: המבחן מהווה רק 24% מהציון של הקורס ולא חייב לעבור אותו כדי לעבור את הקורס. קורל מרצה חדשה ולכן המבנה שלו שונה ממבחני עבר וגם השאלות שונות. הוא כולל חלק תאורטי (חומר מההרצאות) וחלק יותר פרקטי עם כתיבת קוד בספארק, וגם שאלות על ספארק. \n\nהשורה התחתונה: קורס שכדאי להשקיע בו, בעיקר כי העבודות מהוות את רוב הציון.", "timestamp": 1664746652200}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: קורל\nחוות דעת - הרצאות: מסבירה סביר\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: המתרגל הכי לא נעוניין שהיה לי אי פעם\n\nשעורי הבית: עמוסים, ולא עוזר שהסגל גם לא מבין מה הם רוצים מהתרגילים\n\nהמבחן: מאד מזכיר מסדי, אבל כיף כי הוא רק 24% מהציון ולא צריך לעבור אז אין לחץ\n\nהשורה התחתונה: קורס בזיון אחד גדול. צריך לסגור אותו. זלזול מוחלט בסטודנטים, פרויקט לא פתיר שנגרר עמוק לתוך המועדי ב' של אביב!!! יחס נוראי, קורס מגעיל, איכס", "timestamp": 1667386274806}, {"author": "אורן יודע 150 ספרות של פאי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: על הפנים. חושב שהשמש זורחת לו מהתחת, פגשנו אותו 4-5 פעמים במהלך הסמסטר (4-5 הרצאות) בגלל השביתה\\הוא טס לחול\\החליט שאין לו כוח אז קידר את קורל להעביר הרצאה) ומבחינתו הכל בסדר ואנחנו צריכים להשלים את החומר מההקלטות (כולל הקלטה שהיא רק הקלטה של קול). \nחבר שככה נראים מרצים בפקולטה (ועוד מרצה שאחראי על המסלול של נתונים ומידע)\n\nשם המתרגל/ת:  יאיר זיסו\nחוות דעת - תרגולים: אכפתי מאוד ותמיד רצה לעזור. היה מאוד זמין.\n\nשעורי הבית: הלוואי והיו סגורים על עצמם מה הם רוצים מהתרגילים. בכל תרגיל משנים את ההוראות 1000 פעם כי הסגל לא מכיר את התרגיל (הביאו אותו מאיפשהו באינטרנט ואפילו לא הקדישו זמן לעבור עליו כמו שצריך כדי להתאים אלינו). זה גרם לפרוייקטים להיות ארוכים בטירוף כי כל פעם היה צריך לשנות\n\nהמבחן: עדיין לא היה\n\nהשורה התחתונה: מה אני אגיד לכם.. הסמסטר עדיין לא נגמר אבל הרגשתי צורך לפרוק. קורס זוועהת מרצה זוועהת סגל שלא סגור על עצמו וקיבלתם נוסחה (סגורה!!) לקורס הגרוע בפקולטה. תוסיפו על זה שבהרצאות מדברים על כלום ושום דבר, הכל תיאורתי שאפשר לחשוב על זה לבד ולא צריך לבזבז שעתיים בשבוע בשביל לדבר על הכלום הזה", "timestamp": 1687430307790}, {"author": "חחחחחח הבנתם? כי הקורס בדיחה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: חחחחחחחח\n\nשם המתרגל/ת: יאיר\nחוות דעת - תרגולים: יאיר נשמה אבל בכללי חחחחחחחחחחחחחחחחחחחחחחחח\n\nשעורי הבית: חחחחחחחחחחחחחחחחח\n\nהמבחן: חחחחחחחחחחחחחחחחחחחחחחחחחחחחחח\n\nהשורה התחתונה: חחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחח", "timestamp": 1690021510422}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: סופר איטי ולא מאוד מעניין לדעתי. ממליץ לקרוא מהסיכום וללכת לשעות קבלה במקום. בסוף זה רק אחוז נמוך מהציון באמת ואפשר להסתדר בלי לשמוע את אבי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רוב התרגולים זה פשוט הם מקריאים ממחברת שאני בטוח שלא הם יצרו ולא ממש מבינים\n\nשעורי הבית: 2 פרויקטים מאוד כבדים אבל פה באמת לומדים את הקורס. יש עוד איזה 2-3 תב שגם עוזרים לעשות recap על החומר שפספסתם בהרצאות.\n\nהמבחן: 24%\n\nהשורה התחתונה: spark כלי טוב לתעשייה, שווה להשקיע בפרויקטים וללמוד את השפה הזאת כמו שצריך.", "timestamp": 1690128300070}, {"author": ":)", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: איזה חצי מההרצאות בסמסטר התבטלו בגלל בלתמים ובלגאן שלא קשור לאבי עצמו, ככה שלא היו איתו הרבה הרצאות, אבל ההרצאות שהיו דווקא היו בסדר. הוא לא המרצה הכי מלהיב שיש והחומר מאוד משעמם, אבל סובלים את זה.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: ברגע שהבנתי שהתרגולים הם רק סינטקס של Spark. הפסקתי ללכת אחרי חודש וקראתי את המחברות של כל תרגול לקראת העבודה על הפרויקטים.\n\nשעורי הבית: \n6% מעבדות - היה נחמד וקצר מאוד\n20% תרגילי בית - קצת כבד ודורש זמן אבל סביל ואם משקיעים ועושים את זה טוב אז מקבלים בזה גם ציון טוב.\n50% פרויקט בשני חלקים - חלק א' היה די ביזיוני וכל פעם שמישהו שאל שאלת קיטבג את המתרגלים שינו את ההנחיות. העבודה עליו לקחה המון זמן שרובו הלך על לנסות לפענח את ההנחיות במקום אשכרה לעבוד. חלק ב' היה יותר סבבה, אבל עדיין קצת מציק עם ניואנסים שלא היו ברורים בכלל.\n\n\nהמבחן: 24% מהציון, פשוט צריך לדפדף אותו ולהיפרד לשלום מהקורס המתיש והמעיק הזה.\n\nהשורה התחתונה: אחד הקורסים המשעממים בתואר, והמוניטין של הפרויקט בהחלט מוצדק. עושים כי חייב.", "timestamp": 1690457362116}, {"author": "AG", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אבי גל\nחוות דעת - הרצאות: איכשהו יצא מצב שכל הקורס עבר באיזה 5-6 הרצאות כי כל הרצאה שנייה התבטלה מסיבה כזאת או אחרת, ועדיין לא נראלי שמישהו הרגיש שזה השפיע על משהו. החומר של ההרצאות מאוד משעמם ואפשר להשלים אותו לפני התרגילי בית והמבחן כי זה גם ככה לא כזה חשוב. אבי כמרצה סביר, לא ממש טוב אבל גם לא הכי נורא שיש.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: כל התרגולים הם רק סינטקס ופקודות בSpark שבמילא לומדים טוב יותר מהתרגילי בית. הסתפקתי בלקרוא את המחברות קוד שפרסמו ולעבור קצת על דברים במהלך הפתרון של התרגילי בית וזה הספיק.\n\nשעורי הבית: התרגילי בית והמעבדות הם די סבבה ואפשר לתקתק אותם מהר, אבל הפרויקט באמת חופר ומעלה לפעמים את הסעיף כשמשנים את ההנחיות כל פעם שמישהו שואל שאלה. כל מה שכתבו בכל ביקורת אחרת ממש נכון, ובנוסף לכך להחזיר ציונים בזמן (או בכללי לעמוד בתקנון של הטכניון) בשביל סגל הקורס זה בגדר המלצה בלבד (כלומר זה אף פעם לא קורה).\n\nהמבחן: 24% מהציון, באמת שזה משהו להשקיע בו את המינימום. קיבלתי 60 על הטופס ו90 בציון הסופי של הקורס. זה הכי מבחן של 60 וממשיכים, רק תשקיעו בתרגילי בית ובפרויקט כי הם 70% מהציון הסופי ויהיה בסדר.\n\nהשורה התחתונה: משעמם מאוד, כמעט לא מלמד ובעיקר התנהלות ביזיונית אבל במבט לאחור לא כזה טראומטי, דפדפו אותו ויהיה בסדר.", "timestamp": 1693655697097}, {"author": "B", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה:  אבי גל\nחוות דעת - הרצאות: לא הלכתי, ראיתי את ההקלטות שאבי פרסם משנים קודמות, בגדול החומר של ההרצאות משעמם בלשון המעטה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נושאי התרגול הוא בעיקר \nSpark ו MapReduce-  עשה רושם שהמתרגל יודע חלקית את החומר שהוא מלמד וחבל. בכל מה שקשור לחומר התיאורטי שאבי מעביר בהרצאות אין על מה לדבר בכלל ועדיף שלא נרחיב (אולי קצת בהמשך)\n\nשעורי הבית: מעבדות קלילות ונחמדות\n2 תרגילי בית קצת יותר עמוסים - בעיקר על החלק התיאורטי - לא קלות כל כך אבל לא עמוסות מדי\nפרוייקט שמורכב מ 2 חלקים: עמוס בטירוף, לא כי רמת הקושי של השאלות בשמיים - אלא כי השאלות מתחלפות תוך כדי הפרוייקט: קונספט חדש שהמציאו צוות הקורס הנהדר. אתם יכולים לסיים כמעט את כל הפרוייקט ולקראת הסוף הם יכולים לשנות את הנוסח של חלק מהשאלות שביצעתם כבר, זאת לאחר שאלות הקיטבג שנשאלות בפורום. כמו גם שכל שאלה משתמעת בכמה אופנים, כמובן שהם יורידו לכם כמות נכבדת של נקודות אם לא תצליחו לנחש בזמן למה התכוון המשורר שכתב את השאלה. שאלה שכתובה בבירור שחור על גבי לבן - מבחינתם - זה לבן על גבי שחור והפוך לגמרי ממה שכתוב.\nלסיכום - לא משנה כמה תתאמצו על הפרויקט הצוות כבר יוריד לכם נקודות ויחרטט למה ירדו הנקודות בשביל שלא יהיה ממוצע גבוה מדי אז תעשו את החושבים שלכם כמה להשקיע\n\nהמבחן: מורכב מחלק שהועבר בתרגולים על Spark ו MapReduce : חלק חמוד תנסו למקסם את הנקודות שם כי שאר המבחן שיהיה לכולם בהצלחה.\nהחלק השני הוא תיאורטי: על החומר שהועבר בהרצאות, אי אפשר להתכונן בצורה טובה לחלק הזה כי המבחנים שהועלו למודל לא מפרסמים להם תשובות רשמיות,  הלמידה לחלק הזה הרגישה בעיקר תפילה לכך שבזמן מבחן יכולות החרטוט שלכם תעשה את העבודה בתקווה שתפגעו בתשובה הנכונה.\nניתן לוודא את כל המתואר כאן על ידי הממוצע הנמוך לאחר פקטור נכבד שנוסף לנו על המבחן\n\nהשורה התחתונה: בזיון ונשמור על זכות השתיקה.\nלא יודע מי אחראי על הקורס הזה אבל צריך דחוף לעשות בדק בית למה שקורה פה.\nנ.ב כמובן שאין ציונים סופיים כי לא החזירו תשובות על ערעורי סטודנטים על מבחן מועד א ועל הפרוייקטים, תכף מתחיל סמסטר חדש ועדיין מחכים לערעורים על מועד א שהיה לפני כשלושה חודשים, זאת לאחר שקיבלנו את ציוני המבחן רק לאחר חודשיים. \nנסיים בציטוט משעת קבלה לפני מבחן: כל מה שנאמר עד עכשיו, אם אבי אמר משהו אחר בהרצאות קבלו את מה שאמרתי כמבוטל, בהצלחה במבחן - פה נכנסנו לדד לוק רציני. \nחייב לציין שאהבתי מאוד את הכנות שבאמת לא רואים הרבה כמותה בימינו.", "timestamp": 1695913008147}]}