{"posts": [{"author": "noname", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אחיקם\nחוות דעת - הרצאות: ההרצאות היו דברים כלליים בפיננסיים... אין ממש חומר שמועבר או מצגות. המרצה די שולף מהמותן מה שיש לו בראש באותו רגע\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין, יש \"פרוייקט\"-כמה שאלות, חלקן קוד וחלקן תיאורטיות. השאלות נכתבו באופן שברור שהמרצה לא מבין מה התשובה שהוא עומד לקבל, ודי נשלפו מהמותן.\n\nהשורה התחתונה: אני בטוח שהמרצה חכם מאוד אבל די לא מבין נהלים של קורסים, לא מגיע לחלק מההרצאות בזמן ולא לימד כמעט שום חומר במהלך הסמסטר.\nהפרוייקט די קליל (לוקח יום-יומיים) וזה כל המטלות לכל הסמסטר.", "timestamp": 1629705716083}, {"author": "חוזה בפינטק", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אחיקם (אריק) בן ארצי\n\nחוות דעת - הרצאות: \nההרצאות היו לא ממש מעניינות עבורי, אבל נראה שהיו כאלו שכן התחברו. חשבתי שהן יתעסקו יותר בבלוקצ'יין, ביטקוין ודומיו אבל ההתעסקות בנושאים אלו לא הייתה יותר מדי גדולה, והוא יותר התעסק בכלכלה, ניהול פיננסי ומטבעות באופן כללי ויחסית יבש.\nאת החומר עצמו הוא די \"המציא\" תוך כדי ושלף את הכל מהמותן. היו שיעורים בהם הוא אמר שידבר על משהו אחד, אבל בעקבות שאלה של סטודנט הוא העביר שעתיים הרצאה על נושא אחר שקשור למה ששאלו ולא למה שהוא תכנן להעביר (אם הוא באמת תכנן משהו).\n\n\nשם המתרגל/ת: אחיקם\n\nחוות דעת - תרגולים: \nרוב התרגולים לא התקיימו. אלו שכן התקיימו, היו במתכונת (צולעת לחלוטין) של עבודה על הפרויקטים. הוא עבר (או לפחות ניסה לעבור) בין הקבוצות, לשמוע את הרעיונות של כולם כמה שאפשר ולאורך הסמסטר לשמוע על ההתקדמות שלנו. בפועל, הרוב הגדול לא הגיעו לתרגולים והלכו ישר אחרי ההרצאה (אם בכלל הגיעו אליה) ולא עבדו על הפרויקט במסגרת זמן התרגול.\n\n\nשעורי הבית: בתחילת הסמסטר הוא אמר שיהיה תרגיל בית של 20 אחוז על החומר. בפועל, הוא שכח ממנו לחלוטין עד שמישהו הזכיר לו שבוע לפני סיום הסמסטר. הוא אמר משהו בעל פה ועל כך שזה יהיה מגן. בפועל, הוא מעולם לא הוציא מסמך ואני בספק רב שיש מישהו שעשה את העבודה, או שידע מה עושים בה, או אפילו ידע שיש אחת כזו.\n\n\nהמבחן: אין מבחן, יש פרויקט.\nהוא תכנן בהתחלה שנציג את הפרויקטים בכיתה, אבל שבוע לפני סוף הסמסטר הזכירו לו שהסמסטר עוד רגע נגמר, והוא החליט שההצגות יהיו רק מולו, ודרך הזום.\nהיה צריך לשלוח לו מייל וזימון ליומן, ולמרות זאת להרבה סטודנטים הוא פשט הבריז ולא הגיע.\nלאלו שהוא כן התחבר לזום והגיע, הוא היה על השתק ובלי מצלמה כל הזמן.\nההצגה של הפרויקט לקחה בין חצי שעה לשעה ורבע, כתלות בקבוצה ובנושא שלה. את חלק מהקבוצות הוא של הרבה שאלות, ואת חלק רק מעט.\nהוא בעיקר אהב להתקיל בשאלות שהוא כן שאל ולהכנס לפרטים. למשל, אם תיארו לו איזשהו אלגוריתם כללי שייעשה בו שימוש בתכנון, הוא ניכנס לקטנות לגבי אופן הפעולה שלו ואיך ולמה זה יעבוד, למרות שההצגה הייתה בעיקר ברמה התיאורטית ולא היישומית.\n\n\nהשורה התחתונה: קורס שווה אם אתם יודעים לחרטט פרויקט ולהציג אותו במשך כמה שיותר זמן (בשביל שיתרשם וישאל כמה שפחות שאלות).\nהציונים פורסמו שלושה חודשים אחרי סוף הסמסטר (ממש רגע לפני תחילת סמסטר חורף). הממוצע ירד ב-4 נקודות, ולא הייתה אפילו לא קבוצה אחת עם 100, וזה משמעותי - תסתכלו על ההיסטוגרמה של שנה לפני זה (אביב 2021).\nאנשים פנו אליו לערעורים (כי הציון הגיע בלי שום הסבר על הורדת הניקוד, ונראה שהוא בעיקר הגריל את הציונים) והוא רצה להפוך כל ערעור לשיחה בזום.\nכנראה נמאס לו אחרי כמה פניות, והוא החליט להוסיף לכולם 3 נקודות כדי לאזן את הממוצע ולקרב אותו לשנה שעברה (ובעיקר כנראה כדי להשתיק אותנו).\n\nסך הכל, מומלץ לקחת אם אתם יודעים לחרטט את הפרויקט ולהיראות בטוחים בעצמכם במהלך ההצגה. אפשר להשקיע בפרויקט שבוע-שבוע וחצי ולקבל 93 לפחות.", "timestamp": 1666883193564}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אחיקם (אריק) בן ארצי\nחוות דעת - הרצאות: ההרצאות ארוכות, לא מעניינות במיוחד והכל מתקיים בזום. בכל זאת, למרצה אכפת מהסטודנטים, ועונה על כל שאלה שעולה במהלך ההרצאה. רוב הסטודנטים בקורס בחרו לא להגיע להרצאות. \n\nשם המתרגל/ת: עופרי ושגיא\nחוות דעת - תרגולים: אין תרגולים, אלא אם כן מבקשים במפורש (חוץ מ3 תרגולים שהתקיימו בכל מקרה), לרוב יש רק שעות קבלה - מאוד מומלץ להגיע אליהם, המתרגלים עוזרים מאוד בהבנת ופתירת השיעורי בית. \n\nשעורי הבית: היו לנו 4 תרגילי בית, כל אחד 2 שאלות. לא קשות במיוחד, אבל מומלץ להגיע לשעות קבלה כדי להבין את השאלות בצורה טובה יותר וגם לקבל רמזים לדרך פתרון. נוטים גם לשנות את הניסוח שלהם לאחר שמוציאים, אז כדאי גם לחכות קצת כדי לפתור אותם וללכת לשעות קבלה. \n\nהמבחן: אין\n\nהשורה התחתונה: קורס לא מעניין, אבל אפשר לקבל בו ציון מאוד גבוה עם לא יותר מדי השקעה.", "timestamp": 1689107010761}, {"author": "Gony Idan", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: אחיק מרצה בעייתי. ההרצאות הועברו בזום והוקלטו שזה היה נהדר. אבל אחיק היה מאודד מבולגן והיה קשה מאוד לעקוב\n\nשם המתרגל/ת: עופרי חפץ\nחוות דעת - תרגולים: תרגולים מסודרים וברורים, מאוד הותאמו לשיעורי בית ועזרו להבהיר את הבלאגן של ההרצאה\n\nשעורי הבית: \n4 שיעורי בית. לא עמוסים בכלל. צריך להיעזר בתרגולים בשביל להצליח. השעות קבלה בכלל עזרו להבין את הכל.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס קל, הרצאות מיותרות ותרגולים חשובים", "timestamp": 1689244504131}, {"author": "אי שיוויונים", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "אמ;לק: למרות שאני הולך לטנף על הקורס הזה מפה ועד להודעה חדשה, במתכונתו הנוכחית הוא עדיין העקיצה הגדולה ביותר שנראתה בטכניון מאז ימי קורסי השחייה בזום בקורונה. תרשמו אליו בלי לחשוב פעמיים.\n\nשם המרצה: אחיקם בן ארצי\nחוות דעת - הרצאות: אתחיל עם הדברים הטובים. קודם כל ולפני הכל, אחיק הוא אגדה. תגגלו את השם שלו ומיד תבינו למה. בנוסף הוא תמיד בא לקראת הסטודנטים ונתן מענה. הבעיה היא שבתור מרצה הוא פשוט לא טוב.  בתחילת הסמסטר הוא עוד היה בא עם מצגות, אבל כמעט לא השתמש בהן והתעקש להסביר את הכל בwhite board , או יותר גרוע - בדיבור בלבד. אחרי כמה שבועות אף אחד כמעט לא הגיע להרצאות, גם כשהובטחו נקודות בונוס למשתתפים, מכיוון שהתרגולים הפכו לתקציר הרבה יותר ברור של ההרצאה.\n\nשם המתרגל/ת: שגיא ועופרי\nחוות דעת - תרגולים: לאחיק יש מזל גדול שהוא קיבל שני את שני המתרגלים האלו. הם הצילו לו את הקורס מקריסה מוחלטת. בהתחלה התרגולים היו במבנה של מענה על שאלות מההרצאה, אבל סטודנטים לא הבינו כלום ולא היה להם מושג בכלל מאיפה להתחיל לשאול. אז הם הפכו את התרגולים לסיכום של ההרצאה וזה עבד נהדר. הם עשו מעל ומעבר בשביל הסטודנטים, אפילו גילו את התשובות לתרגילי הבית. הם גם הפכו את הקורס לקליל יותר עם מימז והומור עצמי על מצב הקורס שזה ראוי לשבח. מקווה שימישכו להיות מתרגלים למרות החוויה הקשה בקורס הזה כי הפקולטה צריכה עוד מתרגלים כמוהם.\n\nשעורי הבית: איך אפשר ליצור שיעורי בית מאתגרים בקורס שלא לומדים בו כמעט כלום? פשוט מאוד. יוצרים שאלות לא ברורות. אני לא יודע אם זה היה בכוונה או לא, אבל כמעט כל השאלות היו לא מובנות בצורה כלשהי. וכשתרגילי הבית מהווים 100% מהציון, זה יוצר לא מעט תסכול. עם הזמן התברר שהדרך להצליח בהם היא לחכות לשעות קבלה ולחלץ מהמתרגלים את הפתרונות או לפחות רמזים כבדים. הבדיקה לא היתה קפדנית מדי וממוצע 95 מעיד על זה.\n\nהמבחן: אין\n\nהשורה התחתונה: השם של הקורס הוא הטעייה גמורה. החיזוי היחיד שהיה פה זה לנסות לחזות איזה תשובה מצפים לקבל בתרגילי בית. למעשה, למרות שלמידה חישובית 1 מהווה קדם לקורס הזה, לא אוזכר אפילו ברמז משהו שקשור ללמידה חישובית. יכול להיות שזה קשור לזה שאחיק נגע רק ב-20% מהחומר בסילבוס. אז מה היה לנו פה? בעיקר הקורס מבוא לניהול פיננסי. החצי הראשון של הקורס התמקד בריביות ואג\"חים שמכוסה כולו בנפ\"ס. לפי הסילבוס זה היה אמור להיות חומר של שבוע-שבועיים, אבל בגלל ההתנהלות הביזיונית בתחילת הקורס הנתוניסטים לא הבינו מה רוצים מהחיים שלהם (לא באשמתם כמובן). אחר כך עברנו לדבר על אופציות. בתור מי שעשה את הקורס שוקי אופציות במקביל לקורס הזה, לא האמנתי כמה החומר מועבר בצורה רדודה. לצורך ההמחשה, למרות שיש נוסחה פשוטה ואינטואיטיבית לתמחור אופציה במודל הבינומי, בקורס הזה היא לא הוזכרה בכלל ובמקום זה השתמשו בחישוב ידני של המחיר בכל צומת בעץ בתהליך מייגע ומיותר להחריד. אפילו יותר מזה, בתרגיל הבית נשלחה לנו הבהרה שלא נעז להשתמש בנוסחה הזאת. רק בשבוע האחרון יצא לי ללמוד משהו חדש על מודלים של סיכון אשראי.\n\nבקיצור מבחינה לימודית הקורס הזה הוא אכזבה מאוד גדולה ובושה לפקולטה. לדעתי נפ\"ס חייב להיות קדם שלו (זה לא אישי נתוניסטים). \n\nלמרות כל זה, עדיין אתן לו 5 כוכבים על הממוצע הגבוה וההשקעה הנמוכה יחסית.", "timestamp": 1689319369884}, {"author": "#$#$#$#", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אחיק\nחוות דעת - הרצאות: \nלא רלוונטיות בשום צורה לתרגילי הבית, וברוב הזמן לא מובן מה החומר שמנסים להעביר\n\nשם המתרגל/ת: שגיא לוי & עפרי חפץ\nחוות דעת - תרגולים:  שגיא ועפרי פשוט מדהימים, עוזרים לסטודנטים מעל ומעבר ודאגו שהקורס יעבור בצורה טובה ואיפשרו אשכרה להפיק משהו מהקורס הזה\n\nשעורי הבית: 4 תרגילי בית קלים\n\nאין\n\nהשורה התחתונה: אם אתם מחפשים ללמוד משהו, הקורס הזה הוא לא המקום, אם באלכם ציון קל אז מצאתם את המקום הנכון.", "timestamp": 1690550266373}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אריק\nחוות דעת - הרצאות: לקח לו חצי סמסטר להסביר מה זה ארביטראז', ואז הוא לא מבין למה אף אחד לא מגיע  \n\nשם המתרגל/ת: שגיא/עופרי\nחוות דעת - תרגולים: אחלה, אין תלונות\n\nשעורי הבית: זה היה המרכיב היחיד של הציון לכן כן חיפשו קצת איפה להוריד, אבל כולם מקבלים מעל 90 אז הכל בסדר\n\nהמבחן: אין\n\nהשורה התחתונה: קורס לא קשור. לא ללחיזוי, לא לפינטק, ולא לכלום. סתם חבל על הזמן, אבל יוצאים עם ציון טוב במינימום הקשעה. אבל לא לומדים כלום.", "timestamp": 1691395084749}, {"author": "ניק", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אחיק\nחוות דעת - הרצאות: הרבה כבר כתבו לפניי אז לא אחפור ורק אכתוב שאחיק עם מלא כוונות טובות ועונה על כל שאלות הסטודנטים אבל הייתה בעיה רצינית בהוראה וזה בגדול מה שגרם לכל הסטודנטים בקורס לא להגיע ולהסתפק בהקלטות שהוא פרסם (רוב הסטודנטים אפילו לא ראו הקלטות)\n\nשם המתרגל/ת: עופרי ושגיא\nחוות דעת - תרגולים: הצילו את הקורס, הסבירו את החומר (הלא ברור) שהועבר, עשו תרגולים אקסטרה וים שעות קבלה כדי לעזור להתמודד עם הכאוס שנוצר.\n\nשעורי הבית: 4 תרגילי בית, לא קשים בכלל. הבעיה הייתה שאף פעם לא היה אפשר להבין למה הם באמת התכוונו, תמיד היו חסרים נתונים, תמיד היו דברים סותרים או שמשהו לא הסתדר. פותרים את זה עם המון שעות קבלה והשוואות, אל תוותרו על זה.\n\nהמבחן: אין\n\nהשורה התחתונה: יצאתי מהקורס הזה בלי ידע רציני אבל עם ציון אחלה.", "timestamp": 1691668051391}]}