{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אבי פרוש\nחוות דעת - הרצאות: יש דברים מעניינים ויש רגעים שמסבירים דברים משעממים או חוזרים על אותן נקודות שוב ושוב. \n\nשם המתרגל/ת: רון בן עוז\nחוות דעת - תרגולים: כמעט ולא מלמדים משהו מעבר להרצאות. בעיקר חידודים להרצאות ועזרה בת.ב. \n\nשעורי הבית: לא קשים מדי אבל קצת ארוכים. בדיקה קצת קטנונית וממש צריך לעקוב במדויק אחרי ההגדרות שלהם בהרצאות\n\nהמבחן: מבחן קל\n\nהשורה התחתונה: קורס משתלם.", "timestamp": 1626783974824}, {"author": "שליחי הדודה", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אבי פרוש\nחוות דעת - הרצאות: מרצה מאוד מאוד משעמם. הוא גם לא טוב במיוחד. אומר דברים חשובים כדרך אגב. ההרצאות חוזרות על עצמן מאוד. אפשר להעביר את כל חומר הקורס בשעתיים.\n\nשם המתרגל/ת: מר רון בן עוז\nחוות דעת - תרגולים: לא יודעת בעצמה את חומר הקורס. התרגולים בקורס הזה -> הדבר הכי מיותר בתואר.\n\nשעורי הבית: שב הזויים עם בדיקה קטנונית חוזרים על עצמם מאוד.\n\nהמבחן: מבחן אמריקאי לא קשה במיוחד\n\nהשורה התחתונה: קורס משעמם מאוד ולא רלוונטי ככ לכלום. אם לא חובה לא מומלץ לקחת.", "timestamp": 1630886029342}, {"author": "סטודנט ממורמר", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אבי פרוש\nחוות דעת - הרצאות: \nהפסקתי ללכת אחרי הרצאה 1. אפשר לקרוא סיכומים וזהו.\n\nשם המתרגל/ת: רון בן עוז\nהיא נחמדה בסה\"כ, שואפת לעזור ועוזרת בתרגילי בית\n\nחוות דעת - תרגולים: \nלא ממש הייתי אבל יחסית מסכמים וגם לפעמים מוחלפים בשעות קבלה לתרגילי בית. כדאי להתייעץ כי הש\"ב חלק קריטי מהציון.\n\nשעורי הבית: \nהשותפים שלי עשו אבל תחפור טוב יהיה טוב. יותר עמודים יותר נקודות.\n\nהמבחן: \nקליל, אפשר להצליח בו גם בלי ללמוד מהחומרים בדרייב (אבל תסתכלו שם, חשוב!! אשמח לקורבן תודה אחרי).\nהשורה התחתונה: \nקורס קליל שאישית לא מאוד אהבתי אבל יש כאלה שיכולים להתחבר\n\n\nאני זוכר שרציתי לכתוב עוד משהו ממש חשוב אבל לא עולה לי לראש אז הפסד שלכם.\n\n#יתנו יקבלו לא יתנו לא יקבלו\n#דווקא נתניהו", "timestamp": 1634755456951}, {"author": "-", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: קורס מרדים, מרצה מרדים. לא ברור למה זה קורס חובה. ראיתי הקלטות והפסקתי אחרי שתי הרצאות.\n\nשם המתרגל/ת: תום\nחוות דעת - תרגולים:  לא יודע, לא הגעתי לאף תרגול\n\nשעורי הבית: 3 עבודות במהלך הסמסטר. ליצור גרפים/דאשבורדים ובעיקר לחרטט והרבה. סטייל הגורם האנושי. בדיקה נוראית\n\nהמבחן: אמריקאי קליל עם בחירה, סטייל מל\"ג\n\nהשורה התחתונה: סביר. 10-", "timestamp": 1659004458593}, {"author": "Parachute", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אבי פרוש\nחוות דעת - הרצאות: הרצאות לא מועילות.\n\nשם המתרגל/ת: תם \nחוות דעת - תרגולים: תם נחמד, אבל החומר שמועבר בתרגולים גם הוא לא באמת מועיל.\n\nשעורי הבית: שלוש עבודות שעושים על אותם נתונים שאתם בוחרים בתור קבוצה, אז כדאי לבחור dataset עם בשר, אחרת אין על מה מספיק לחרטט (אבל יש אפשרות להחליף בין עבודות)\n\nהמבחן: אמריקאי עם קצת בחירה, ממוחזר בחלקו, אפשרי להוציא מעל 90 בלי ללכת להרצאות ותרגולים ורק ללמוד מאחד מהסיכומים בדרייב. חומר פתוח.\n\nהשורה התחתונה: סביר. -10", "timestamp": 1659508974793}, {"author": "ג", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: סבבה בסך הכל, לא הרגשתי שמאוד היה חשוב להקשיב בהרצאות - בעיקר לקרוא את הסיכום\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: המתרגל תם עזר לנו המון, היה ממש אחלה!\n\nשעורי הבית: קצת מעיקים וארוכים אבל לא קשים\n\nהמבחן: קליל, מותאם לחומר הנלמד, למדתי כ-4 ימים וזה הספיק\n\nהשורה התחתונה: קורס לא עמוס מדיי", "timestamp": 1660546500220}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: אף אחד לא הלך להרצאות, בזבוז זמן מוחלט.\n\nשם המתרגל/ת: אין לי מושג, נראלי טום.\nחוות דעת - תרגולים: לא נראלי שמישהו הלך לתרגולים.\n\nשעורי הבית: מעיקים אבל סך הכל קלילים.\n\nהמבחן: קליל וממוחזר.\n\nהשורה התחתונה: קורס עם ציונים גבוהים, אבל מיותר לחלוטין ולא קשור בשום צורה לתואר שלנו.", "timestamp": 1668330423790}, {"author": "מציג מידע קוגניטיבי", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אבי פרוש\nחוות דעת - הרצאות: הרצאות מאוד משעממות. ההרצאות היו מאוד איטיות, ועל נושאים לא מעניינים - איך להציג גרפים, מה מותר ומה אסור, פסיכולוגיה של אנשים ושל גרפים, עקרונות פסיכולוגיים ועוד שלל זוועות לא מעניינות.\n\nשם המתרגל/ת: טום\nחוות דעת - תרגולים: התרגולים היו לא מעניינים, והיה נראה שטום לא בקיא בחומר ויותר מחרטט (אבל אולי זה פשוט כי הנושאים עצמם מחורטטים).\nחלק מהתרגולים היו קשורים לנושא של ההרצאה, ובחלק בכלל לא ברור מה הלך בהם.\nהיו הרבה תרגולים גם שבוטלו, ולדעתי היה סך הכל בערך 6 או 7 תרגולים.\n\nשעורי הבית: מעיקים ומיידעים. דורשים פשוט לחרטט בלי סוף ולהיות כמה שיותר מדויקים על כל פיפס שנלמד בהרצאות. יכול להיות הסבר יפה עם גרף מהמם, ועדיין ימצאו על מה להוריד.\nהבדיקה של רות לבב הייתה פשוט מזעזעת. היא הורידה בערך על כל מילה. היו אשכרה עבודות שחזרו עם משוב \"סביר, -10\" ואפילו \"סביר, -15\". זה ציטוט מדויק של ההערות, בלי שום שינוי.\nזה הרגיש שהיא פשוט באה להוריד ציונים ולהוריד ממוצע, והיא רק חיפשה להוריד על כל שטות. \nכשערערנו לטום, הוא בדק את כל העבודה מחדש, וגם הוא מצא על מה להוריד *עוד*, בנוסף למה שרות הורידה.\nהיו 3 עבודות, כשהשלישית הייתה הכי גדולה והיא הייתה להגשה אחרי תקופת הבחינות של מועד א'.\nהעבודות כללו ליצור גרפים, וגם לחרטט עליהם בלי סוף (מעל עשרה עמודים על 3 גרפים). בנוסף, הייתה הצגה בסרטון של העבודה - צילום סרטון של כמה דקות (הם היו נוקשים מאוד לגבי האורך) שבו מציגים את הגרפים ומדברים עליהם. היו קבוצות שהשקיעו כמה שעות רק בסרטון מושקע בטירוף, והיו קבוצות שפשוט דיברו למצלמה בלי שום פואנטה ובסוף לדעתי כמעט כולם קיבלו את רוב (אם לא כל) הנקודות על הסרטון, ולכן לא באמת שווה להשקיע בזה.\n\nהמבחן: \nהיה טריקי בחלקו. מכיל 35 (בערך) שאלות אמריקאיות, מתוכן תריך לבחור 33. המבחן בסך הכל 30 אחוז מהציון הסופי.\nהסטודנטים התבקשו לכתוב שאלות, וזה היה 5 אחוז מהציון הסופי, ולכן היו במבחן בערל 5 או 6 שאלות שסטודנטים כתבו. מאוד מומלץ לשתף עם כולם את השאלות לפני הבחינה. הבחינה גם עם חומר פתוח, ולכן מומלץ להביא ת כל השאלות של הסטודנטים (עם פתרונות) למבחן.\nלהבדיל משנה קודמת, אצלינו לא היו שאלות ממוחזרות בכלל, אולי רק שאלה 1 שנלקחה מבחינה ישנה, ולכן לא היה ממש פשוט, והממוצע ירד משנה קודמת, בו המבחן היה ממוחזר ב-100 אחוז מלפני שנתיים.\n\nהשורה התחתונה: קורס פשוט משעמם. לקחת רק בשביל הציון, אבל תתכוננו לחירטוטיאדה של החיים בעבודות הבית.", "timestamp": 1675620840253}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: מקוונות, משעממות ממש אבל תכלס לא חובה לראות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין ככ תרגולים, אני לא הגעתי\n\nשעורי הבית: שבועיים, מטלה בטבלאו, די מעיק אבל לא לוקח הרבה זמן\n\nהמבחן: אין, יש פרויקט, טיפה עמוס אבל אם יש לכם שותפים טובים זה אחלה\n\nהשורה התחתונה: קורס קצת חופר אבל מומלץ", "timestamp": 1689349879080}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יעל אלבו\nחוות דעת - הרצאות: הקורס הועבר במתכונת שונה (אסינכרונית). היה דדוקא נמחד שלא היה חובת הגעה לשום דבר, והזמן שלקח לראות את ההקלטות היה הרבה פחות משעתיים. בכל זאת, חומר משמעם נורא.\n\nחוות דעת - תרגולים: התרגולים היו שעות קבלה, כי חלק ממהרצאות המוקלטות היה מטלת תרגול. מטלות חופרות קצת אבל לא קשות.\n\nשעורי הבית: מטלה מתגלגת לאורך הסמסטר (3 הגשות סה\"כ). חופרות מאד, אבל זה סתם להקיא את החומר של ההרצאות.\n\nהפרויקט (אין מבחן): היה דווקא מגניב לבנות דשבורד מאפס, אבל כמובן יש מסמך של חפירות שצריך להוסיף לזה.  \n\nהשורה התחתונה: יכולת חשובה, ובאמת יש ניסיון מצד הסגל שיהיה מעניין ומלמד, אבל החומר התיאורטי לא קשור וחופר", "timestamp": 1691394276436}, {"author": "אורן יודע 150 ספרות של פאי", "difficultyRank": 4, "generalRank": 1, "semester": "202302", "text": "איייןןןן מעיקיייםםם כאלהה איןןןן\nאיזה קורס מעיק שמועבר ע\"י אנשים מעיקייםם", "timestamp": 1720951415702}]}