{"posts": [{"author": "אלי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות:  ההרצאות מעניינות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש שניים, לא מאוד קשים, אבל דורשים זמן הרבה זמן (השני הוא פרויקט של 10 ימים). יש גם בנוסף פרויקט סוף - תכנון ניסוי\n\nהמבחן:  קשה בצורה לא סבירה. נדרש גם קריאה מעמיקה של 4 מאמרים והמרצה דורש לזכור פרטים קטנים מההרצאות ומנמאמרים.\n\nהשורה התחתונה: לא מומלץ. אני הגעתי לקורס מתוך עניין בנושאים האלו. הקושי והציונים הנמוכים הוציאו לי כל חשק.", "timestamp": 1662372930743}, {"author": "יאללה ביי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות: ההרצאות מועברות בצורה מעניינת, אורי מסביר בבירור והחומר גם יחסית אינטואיטיבי (ברובו). המרצה גם שם דגש על השתתפות פעילה של סטודנטים בהרצאה ויצירת דיון מדי פעם.\n\nשם המתרגל/ת: דנה זייף\nחוות דעת - תרגולים: התרגולים ברורים אבל קצת מרוחים, לרוב נגמרו לפני הזמן. כן חשוב לעבור על החומר שלהם כי הם מוסיפים על ההרצאה ויש שאלות גם מהחומר של התרגולים במבחן.\n\nשעורי הבית: היו שני תרגילים לאורך הסמסטר (5% כל אחד) ופרויקט סיום להגשה אחרי מועדי א (30%). התרגיל הראשון היה בזוגות/שלשות והיה צריך להביא דוגמאות מהחיים שקשורות לחומר בקורס ולנמק. התרגיל השני היה לבד, היה צריך לתכנן ולתעד ניסוי עצמי (ברעיון של לשפר את עצמך לדחוף את עצמך לעשות משהו שלא מקפיד אבל רוצה). התרגיל הראשון לקח קצת יותר זמן השני בקושי, ובשניהם אפשר להוציא 100 עם השקעה סבירה.\n\nהמבחן: 50% מהציון. היינו סמסטר ראשון שאורי מעביר אז לא היו מבחני עבר רלוונטיים, הוא פרסם מבחן לדוגמא כשהמבחן האמיתי (מועד א׳, לא יודע לגבי ב׳) היה מאוד דומה, רק קצת יותר ברמה. מבחן 25 אמריקאיות עם 4 תשובות אפשריות לכל שאלה. הרוב זה לזכור פרטים ומקרים מההרצאות/תרגולים/מאמרי קריאה למבחן, כשבהרבה מקרים גם אפשר עם הבנה לייצר אינטואיציה טובה. היו גם כמה שאלות יותר טריקיות אבל סה״כ מבחן סבבה שגם היה בסוף עם פקטור 8 נקודות למבחן.\n\n הפרויקט: הפרויקט בזוגות או שלשות והוא בעצם לתכנן ניסוי, דורש השקעה של כמה ימים במצטבר וצריך לפני סוף הסמסטר להציג את ההתקדמות (אין ציון על ההצגה) - ההצגה מול הכיתה המרצה והמתרגלת ומקבלים הערות שעוזרות לשפר את הפרויקט (להתייחס לכל מה שהמרצה מעיר!). בפרויקט צריך לעשות סקירה ספרותית, להציע הליך ניסוי ולהתייחס למצבים אפשריים, מזכיר את החצי הראשון של הפרויקט במבוא לפסיכולוגיה. הוא מצפה לנמק כל דבר היטב, אנחנו גם נעזרנו בו בשעות קבלה. היה ממוצע 88 בפרויקטים. היה גם אפשר לקבל בונוס של עד 15 נקודות לפרויקט יצירתי וכו׳ שנראה שאף אחד לא קיבל.\n\nהנוכחות: אין נוכחות חובה וההרצאות הועברו בזום והקולטו, אבל יש רכיב ציון על נוכחות והשתתפות שהוא 13% מהציון (חוץ מזה יש 90% ככה שאפשר להגיע ל103 סה״כ). כמות ההרצאות היחסית שהגעתם מהווה חצי מהציון הזה (כשעד 2 חיסורים לא פוגע בציון הזה), החצי השני של הציון הזה הוא סובייקטיבי של המרצה והוא קובע אותו לפי רמת ההשתתפות שלכם (נראה שמי שחפר ודיבר הרבה קיבל ציון גבוה בזה, כנראה מי שהמרצה הכי זוכר).\n\nהשורה התחתונה: קורס מאוד מומלץ, במיוחד אם אתם יכולים להיות נוכחים בהרצאות. החומר הוא כלכלה התנהגותית ככה שזה מהווה אחלה ברייק מכל המתמטי. לא עמוס במיוחד ובאמת עובר באווירה סבבה והסגל ממש אחלה.", "timestamp": 1662378967483}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עידו ערב\nחוות דעת - הרצאות: הרצאות גרועות מאד. עד שבוע 5 היה חומר מעניין, אבל אח\"כ זה הפך ל-\"אני אציג את כל המחקרים שעשיתי אי פעם ובתחום ואראה למה זה כל כך טוב יותר מכולם\". זה גם היה באנגלית, אולי זה מה שגרם להרצאות ולבלתי נסבלות.\n\nשם המתרגל/ת: עדן הלפרין \nחוות דעת - תרגולים: מלך עולם, הציל את הקורס.\n\nשעורי הבית: אין\n\nהמבחן: סביר מאד, אמריקאי. 50% מהציון. היה אפשר לצבור עד 15 נק' בונוס על הגעה להרצאות, שזה המון.\n\nפרויקט: 60% של ציון הפרויקט היה על הסבר סביר על המודל שבנית. שאר הנקודות היו על כמה טוב המודל שלך חזה לעומת שאר הכיתה, אבל יחד עם ה15 בונוס על נוכחות, היה אפשרי להגיע למקום אחרון בקורס ועדיין לקבל 90+\n\nהשורה התחתונה: חבל מאד כי היה יכול להיות מעניין מאד וקורס מגניב, ולא היה. עם זאת, בלי הרבה השקעה אפשר לקבל ציון מטורף.", "timestamp": 1691394904705}, {"author": "Nina Kahn", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עידו ערב\nחוות דעת - הרצאות: הועברו באנגלית בזום והיו על הפנים. אני דוברת אנגלית שפת אם ועדיין לא הצלחתי להבין עד הסוף. עידו לא מסודר בשום צורה וזה מקשה מאוד.\n\nשם המתרגל/ת: עדן הלפרין\nחוות דעת - תרגולים: הציל את הקורס! התרגולים היו קלילים יותר ויותר מובנים.\n\nשעורי הבית: יש פרויקט שהוא 50% מהציון, שגם הוא לא ברור.\n\nהמבחן: בסוף היה יחסית קל, ועם 15% בונוס על השתתפות בשיעורים, אנשים די הצליחו.\n\nהשורה התחתונה: קורס לא מומלץ.", "timestamp": 1691866084068}]}