{"posts": [{"author": "שליחי הדודה", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: מרצה מעולה, הרצאות מעניינות\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: מתרגל מאוד אכפתי, מסביר היטב את החומר ועוזר מאוד ללמידה. תרגולים מעולים שעוזרים להבנת החומר\n\nשעורי הבית: שב ארוכים ולא קלים אבל רואים את כל מה שצריך בתרגולים\n\nהמבחן: מבחן הוגן\n\nהשורה התחתונה: קורס מעניין מאוד, צוות קורס מעולה", "timestamp": 1597739920291}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: ההרצאות היו מצוינות ולשהם אכפת מהסטודנטים ורוצה שכולם יבינו. מומלץ להשתמש בקבצים שהוא מפרסם ולהוסיף אליהם את מה שהוא כותב על הלוח.\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: התרגולים היו ממש טובים ועזרו להבנת החומר. אייל היה מצוין וראו שהיה לו אכפת מהסטודנטים ושנבין את החומר.\n\nשעורי הבית: לא קלים ודורשים זמן אבל קשורים לחומר ועוזרים להבין אותו יותר טוב.\n\nהמבחן: לא קליל אבל הוגן.\n\nהשורה התחתונה: החומר מעניין וצוות הקורס מצוין. הקורס דורש השקעה אבל יש תמורה.", "timestamp": 1641295710068}, {"author": "Assaf Mushkin", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: סבאח שהם\nחוות דעת - הרצאות: מרצה טוב, מסודר, מסביר היטב. \n\nשם המתרגל/ת:  אייל גור\nחוות דעת - תרגולים: מתרגל מאוד מסודר, בא לקראת הסטודנטים, מעביר את החומר היטב\n\nשעורי הבית: שבועיים, טיפה קשים.\n\nהמבחן: די קשוח.\n\nהשורה התחתונה: לוקחים כי חייבים, מה לעשות", "timestamp": 1657793741234}, {"author": "מציל סטודנטים", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שהם\nחוות דעת - הרצאות: אחלה מרצה, מסביר מעולה ומסודר מאוד. תמיד זמין לשאלות ולשעות קבלה. \n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: תותח, מסביר מעולה ומאוד מסודר.\n\nשעורי הבית: 10 טובים ביותר, קשים וארוכים. מלמדים מאוד טוב למבחן אז להשתדל לא לרפרנס או לפצל יותר מידי בין השותפים. לפי דעתי הרמה של המבחן נמוכה מהרמה של שיעורי הבית\n\nהמבחן: הוגן מאוד, לא רואים בו משהו שלא ראינו בשיעורי הבית ובתרגולים.\n\nהשורה התחתונה:", "timestamp": 1658065474879}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: מרצה מצוין! מעביר את החומר בצורה מאוד מעניינת ו3 שעות הרצאה עברו לי כמו כלום.\nנותן המון דוגמאות תוך כדי ההרצאה ומערב את הסטודנטים בכך שהוא שואל שאלות ומתקיל (בקטע טוב) בדברים שלא היינו חושבים עליהם לבד. נהניתי מאוד.\nמומלץ להוריד את שלד ההרצאה שלו ולכתוב על זה במהלך ההרצאה, כי הוא משאיר מקום להוכחות ופתרון דוגמאות. \n\nשם המתרגל/ת: אייל גור \nחוות דעת - תרגולים: מקצועי ברמות ובעיניי מועמד להיות המתרגל הכי טוב שהיה לנו עד כה. \nיש לו ידע עצום ולא תצליחו להתקיל אותו בשאלה שהוא לא ידע לענות עליה תוך כמה שניות. הוא מקדיש זמן לשאלות ודואג שהכל יהיה ברור ויכול להישאר גם אחרי התרגול בכיף.\nהתרגולים מאוד מסודרים וקשה לפספס בהם משהו.\n\nשעורי הבית: שיעורי הבית ברמה גבוהה אבל לא מוגזמת ומכינים מאוד לבחינה. אצלנו אפילו הופיעה שאלה כמעט זהה לאחת מהשאלות בגיליונות. תשתדלו לפתור אותם לבד כי אם חושבים על התרגיל מספיק (לא כמו שיטות כן) אז מגיעים לפתרון.\nיש גם שאלות תיאורטיות וגם תכנות אבל הוא לא ברמה מאוד גבוהה לרוב זה לממש אלגוריתמים שנלמדו בתרגול או בהרצאה\n\nהמבחן: הוגן מאוד בעיניי. הייתה רק שאלה אחת שאם לא זכרת את הטריק (העתקות לינאריות) לא יכלת לפתור 2 סעיפים בה אבל חוץ מזה ועוד שאלה קצת מורכבת הוא היה בסדר גמור. \nתפתרו כמה שיותר מבחנים, כי הם מכינים בצורה טובה מאוד.\nעוד משהו קריטי הוא לחזור על השאלות שהיו בתרגול, יש דברים שלא מופיעים בבחינות הרבה ושווה לחזור עליהם שוב שם.\nהשורה התחתונה: הסגל מכוון לכך שמי שמבין את החומר במהלך הסמסטר יצליח. תהיו על החומר תשאלו שאלות אם אתם לא בטוחים ותפתרו את הגיליונות לבד.", "timestamp": 1658067389024}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: אחד המרצים הטובים בפקולטה. מסודר ממש, יודע לנהל את הזמן בצורה מושלמת ויהיה מוכן להתעכב כמה שצריך עם כל סטודנט עד שכולם יבינו.\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: מתרגל מעולה, מדגיש כל טריק ונקודה רגישה (שרובן באמת מופיעות במבחנים). לפעמים לא מספיק את כל התרגול אבל זה לא היה כזה מורגש גם אם לא עברתם אחר כך על השאלות בבית.\n\nשעורי הבית: חלק יבש וחלק תכנותי. התכנותי בעיקר חופר, בעיקר תורם ללהבין איך בסוף מה שלומדים קורה בפועל, אבל זה לא כזה מלמד. החלק היבש כן עוזר.\n\nהמבחן: מבחן פייר ממש, השנה ספציפית היו קצת יותר טריקים שאם לא זכרת אותם לא היה לך הרבה סיכוי ואני אישית נדפקתי מזה, אבל המבחנים ממש פיירים ומתכתבים עם החומר של הקורס (מה שלא טרוויאלי בפקולטה שלנו)\n\nהשורה התחתונה: אחד הקורסים המאורגנים והטובים בפקולטה. החומר לא סופר מעניין אבל צוות הקורס ממש משקיע וזה ניכר.", "timestamp": 1658734234161}, {"author": "הדואלי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: אחלה מרצה. מסודר מאוד ומסביר את החומר בצורה טובה ועם הרבה דוגמאות.\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: תרגולים טובים שמאוד עוזרים. אייל מתרגל מצויין ומעביר אותם טוב מאוד \n\nשעורי הבית: גיליון שבועי. הגיליונות לא קלים אבל גם לא סופר קשים בדרך כלל. רוב השאלות בגיליונות הן שאלות יבשות שמכינות למבחן ויש גם שאלה בממוצע בכל גיליון של תכנות בפייתון\n\nהמבחן: מבחן הוגן מאוד. מי שעקב אחרי החומר של הקורס בהחלט יכול לקבל ציון טוב.\n\nהשורה התחתונה: קורס שמועבר בצורה ממש טובה ומהווה אחלה קורס מבוא לאופטימיזציה. גם אם החומר לא תמיד הכי מעניין, הסגל משקיע ורוצה שהסטודנטים ילמדו וזה ניכר", "timestamp": 1666728012814}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שהם\nחוות דעת - הרצאות: שהם מרצה סביר. לא טוב אבל לא רע. הוא ממש רוצה שסטודנטים יבינו וכן אכפת לו, גם מכין אחלה קבצי הרצאה שבנויים להדלמת ההוכחות ואפשר לעשות הכל מסודר\n\nשם המתרגל/ת: אייל\nחוות דעת - תרגולים: המתרגל הכי לא כריזמטי בפקולטה, מתחרה רק עם שטרייכמן. הוא מקצוען, מבין את החומר ממש טוב ומסביר סבבה, אבל כל תרגול נותן תחושה שלאט לאט אתה מת יחד איתו\n\nשעורי הבית: הגשות שבועיות ארוכות, תמיד יש שאלה 1 חדש שאי אפשר לרפרנס. יש חלק תכנותי וחלק יבש, והם ארוכים. מלא זמן\n\nהמבחן: דווקא סימפטי ביחס למה שהוא יכול להיות\n\nהשורה התחתונה: החומר מאד קשה והקורס מאד עמוס. בהצלחה", "timestamp": 1667222550322}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: מרצה מעולה, משקיע מאוד בהבנה של החומר ובמהלך ההרצאה שותל המון דוגמאות קונקרטיות שיכולות לעזור בהבנה של החומר.\n\nשם המתרגל/ת: אייל גור\nחוות דעת - תרגולים: אחד המתרגלים היותר טובים שיצא לי להיתקל בהם אם לא ההכי טוב. עוזר בכל מה שאפשר, מוכן לעשות שמיניות באוויר בשביל שתבין את החומר, ומוכן להישאר גם לאחר שעת הקבלה במידה והוא לא יודע לענות על השאלה שלך.\nמעביר את החומר בצורה מעולה ויש לו ידע עמוק בנושא.\n\nשעורי הבית: לא עמוסים מאוד, אבל כן חשובים מאוד להטמעה של החומר. הם גם לא קשים אז אני ממליץ באמת לשבת עליהם ולהשקיע.\n\nהמבחן: אחלה מבחן, מאוד הוגן. מורגש שמי שלמד הצליח.\n\nהשורה התחתונה: קורס חשוב מאוד, בסיסי מאוד, ובסך הכל לא מסובך מאוד. מומלץ מאוד אבל בתכלס אם אתם נתונים אז אף אחד לא שואל אותכם אם אתם רוצים לעשות אותו.", "timestamp": 1668332040219}, {"author": "פותר KKT דואלי בלי לפחד", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שהם סבאח\nחוות דעת - הרצאות: \nשהם מרצה מעולה. החומר ברמה מאוד מאוד גבוה, אבל את הרוב הוא מעביר בצורה מובנת. מאוד אכתח לו מהסטודנטים, ורואים שהוא רוצה שהם יצליחו.\nמשהו אחד שהוא היה פחות נחמד לגביו זה ההקלטות - הוא דאג למחוק כל זכר שהיה קיים להקלטות של הקורס, ואם מישהו פספס הרצאה מסיבה מוצדקת אז הוא נתן לו קישור להקלטה לכמה שעות בלבד ואחר כך הוא מחק את הגישה לאותו סטודנט.\n\nשם המתרגל/ת: אייל גור.\nחוות דעת - תרגולים: מתרגל מעולה, שממש אכפת לו מהסטודנטים. נשאר לפעמים גם קרוב לשעה אחרי התרגול רק כדי לענות על שאלות (אפילו לא על דברים שקשורים לקורס עצמו), למרות שזו לא הייתה שעת קבלה מוגדרת.\nהוא ניסה לעזור כמה שאפשר ולהנגשי את החומר בצורה כמה שיותר מקלה, דבר שלא פשוט בכלל כשהחומר ברמה כזו גבוהה.\nנקודה נוספת - התרגולים הם ממש ברמה של בחינות, ואשכרה לומדים שם דברים שאפשר לראות בבחינות - לא מובן מאליו. חשוב להקשיב, כי בבחינה הייתה שאלה שאפשר לפתור רק על סמך משפט שראינו התרגול בלבד ולא הוצג בכלל בהרצאה.\n\nשעורי הבית: לרוב מאוד קשים, אבל חייבים להבין אותם כדי להצליח במבחן. אמנם לחלק יש רפרנסים, אבל בלי לפתור את התרגילים ולהבין אותם כדי להצליח במבחן.\nהחלקים הרטובים של כל גליון פחות רלוונטיים, והם גוזלים הרבה מאוד זמן. אצלינו נתנו אפשרות לבחור בין פייתון למאטלב לצורך ההגשה של החלקים הרטובים.\nהגליוניות הם שבועיים, וצריך להגיש 10 מתוך 12 או 13 והם 20 אחוז תקף.\nכל שבוע יצא לי להשקיע על הגליון מעל 25 שעות.\nהיו שני בודקים לקורס, אחד יותר חיפף ופרגן בציונים ואחד היו ממש נוקשה (לפעמים אפילו ברמה של להוריד 20 נקודות על טעות פיצית או 20 נקודות על זה ששם הקובץ לא תואם את הוראות ההגשה).\n\nהמבחן: \nקשה, אבל לא מש מכיל דברים שלא ראינו קודם. חשוב מאוד להשקיע במהלך הסמסטר ולהיות על החומר. לקראת הבחינה פשוט לחרוש ולפתור כמה שיותר מבחנים ושאלות מסוגים שונים, כי חלק מהדברים נהיים טכניים וצריך לעשות אותם מאוד מהר (לחשב בעיה דואלית, לכתוב ולפתור מערכת תנאי KKT ועוד שלל קללות).\n\nהשורה התחתונה: קורס מאוד עמוס. לא יותר מדי מעניין, אבל גם לא לא מעניין. מכיל אוטימיזציה על שלל גווניה, ויכול לעניין אנשים שנמשכים לתחום הזה וליישום של זה בפייתון/מאטלב.\n\nאם אתם מנתונים ומידע, אז לכם ברירה (מקווה בשבילכם שיהיה טוב גם כששהם בשבתון עכשיו).\nאם אתם ממערכות מידע, לא יודע אם זה עדיף על פני סטטיסטיקה 2 (או מודלים גרפיים, שהבנתי שאפשרי גם במקום). הסגל היה נקודת האור של הקורס, ואם לא הם זה היה קורס פשוט מזעזע ובלתי עביר לדעתי.", "timestamp": 1675617282905}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: על הפנים, אם יש לכם אופציה להיות עם שוהם או הקלטות או כל מרצה אחר תעשו את זה.\n\nשם המתרגל/ת: דן\nחוות דעת - תרגולים: די בלאגן \n\nשעורי הבית: גליון שבועי מעיק, מרופרנס, אבל הרבה פייתון שזה לפחות פרקטי.\n\nהמבחן: נדב נתן מבחן לא פרופורציונלי\n\nהשורה התחתונה: קורס תורם מאוד, בעצם זה קורס באופטימיזציה, חומר חשוב ונחמד בסופו של דבר. די פרקטי גם כי נכנסים להרבה מתמטיקה של למידת מכונה.", "timestamp": 1690128622729}, {"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: לא משהו אבל די התרגלתי במהלך הסמסטר כי לא הייתה אלטרנטיבה טובה. נדב די מונוטוני וגם הכתב שלו מאוד לא קריא, ומדי פעם הוא מסתרבל בהוכחות אבל סהכ אפשר להתמודד עם זה. אם אתם משיגים את ההקלטות של שהם הן עדיפות.\n\nשם המתרגל/ת: דן גרינשטיין\nחוות דעת - תרגולים: גם לא משהו, למרות שניכר שדן כן התאמץ, אבל הוא פשוט לא כל כך טוב בלהעביר חומר. היה די קל לאבד אותו בתוך הפתרונות של התרגילים, והרגשתי שרוב הלמידה מהם נעשתה כשקראתי את התרגול אחר כך לפני שהתחלתי לפתור את התרגילי בית.\n\nשעורי הבית: גיליונות שבועיים, משלבים בין ישב לרטוב. השאלות הרטובות שהן מימוש של שיט שרואים בהרצאות ובתרגולים בפייתון ממש חופר ומציק, תרפרנסו חופשי. את הרטוב תנסו לפתור לבד, לא קל אבל פתיר ודי עוזר להיות על החומר.\n\nהמבחן: תכלס היה חרא. היו כל כך הרבה פשלות עם המבחן הזה שביקורת מסכנה בצ'יזפורק לא תצליח להכיל הכל, אבל בקצרה היה לא פתיר ב3 שעות ולא הוגן. היה פקטור כפלי של 1.25 משהו כזה שכן נתן קצת בוסט לציונים אבל ההיסטוגרמות מדברות בעד עצמן.\n\nהשורה התחתונה: עם כל החרא שהיה בקורס, החומר עצמו מעניין. הסגל היה על הפנים והמבחן משאיר טעם רע, אבל כן אהבתי את החומר ואולי בסמסטר שהסגל יהיה קצת יותר מקצועי הקורס יעבור יותר בסבבה.", "timestamp": 1692306557413}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: החומר עצמו מעניין (לדעתי) אבל ההרצאות לא ממש. נדב די מונוטוני אבל בעיקר קשה לעקוב אחריו כי הכתב שלו על הפנים והוא כותב בכתב יד כל הוכחה שעושים. אם יש לכם גישה להקלטות זה עדיף.\n\nשם המתרגל/ת: דן גרינשטיין\nחוות דעת - תרגולים: דן עקרונית די השתדל אבל התרגולים פשוט לא היו מלמדים, כי הוא לא ממש יודע איך להעביר טוב חומר.  לא ממש הרגשתי שזה תורם למשהו, לקרוא את הpdf עושה את אותו אפקט רק ביותר סבבה.\n\nשעורי הבית: גיליונות שבועיים, יש גם תרגילים וגם חלק תכנותי. תרפרנסו את התכנותי חופשי זה חופר ומעצבן ולא ממש עוזר למשהו, אבל תשקיעו בפתרונות עצמם כי זה די הדרך היחידה להישאר על החומר של הקורס במהלך הסמסטר.\n\nהמבחן: די בדיחה (בקטע רע). היה מבחן לא פרופורציונלי בשיט, יותר מדי ארוך ומסובך (וההיסטוגרמה מראה את זה) ולא פתיר ב3 שעות (ישמצב גם ביותר). מעבר לזה גם איחרו באיזה חודש בהחזרת הציונים שלנו בקטע ביזיוני. לפחות נתנו פקטור שאיזן קצת את הדברים (למרות שאפשר להתווכח על האם הממוצע לגיטימי עדיין). אחד המבחנים הכי הזויים שעשיתי בתואר עד עכשיו.\n\nהשורה התחתונה: החומר מעניין ומאוד חשוב (חשוב להרבה נושאים בML) אבל הסגל על הפנים, ההתנהלות לאורך הסמסטר ותקופת המבחנים הייתה גרועה ממש, אז תקוו לעשות את הקורס עם סגל נורמלי ויהיה בסדר.", "timestamp": 1692534382487}]}