{"posts": [{"author": "שליחי הדודה", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: מרצה גרוע, מאחר קבוע לשיעורים, עושה הפסקות של חצי שעה. לא מסביר טוב, לא עונה לשאלות\n\nחוות דעת - תרגולים: לומדים עוד חומר אין באמת תרגול \n\nשעורי הבית: עמוסים וארוכים\n\nהמבחן: מבחן די קל\n\nהשורה התחתונה: קורס מאוד חשוב לתואר, הרבה רעיונות חשובים וכלים שימושיים שחובה ללמוד לבד מהאיטרנט או מספר הקורס המצויין כי המרצה נוראי.", "timestamp": 1597823460220}, {"author": "טכניון", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: לא ללכת להרצאות, מרצה מבולגן (יותר מאיתי אריאלי). אחד הגרועים בטכניון.\nשעורי הבית: קשים\nהמבחן: סביר\n\nהשורה התחתונה: לקרוא ספרים על החומר", "timestamp": 1597829204798}, {"author": "111", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: המרצה לא מבין כלכך את ההוכחות בעצמו, השיעור נגמר תמיד לפני הזמן \nכל השיעורים לא מבינים כלום אבל בסוף לא כזה נורא\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nעוזרים להבין קצת מה הולך בקורס הזה\nהמבחן: \nהממוצע גבוה , המרצה לא מנסה להכשיל שזאת התחלה טובה\nהשורה התחתונה:", "timestamp": 1612259306233}, {"author": "חרשן אש מגיל שש", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: תמיר חזן האלוף !! \nחוות דעת - הרצאות: \nקשות ולא מובנות אני באופן אישי,לפני כל הרצאה קראתי כשעה וחצי את ההרצאה וזה ממש עזר לי !\nחוות דעת - תרגולים: \nהמתרגלים אחים ונחמדים ממש\nשעורי הבית: \nארוכים אבל ישנם ציונים טובים לכולם \n\nהמבחן: קל הוגן והוא מאוד ותמיר מאוד חנון בהורדת נקודות\n\nהשורה התחתונה: קורס פצצה במיוחד עם תמיר,מאוד הלחיץ אותי הקורס בהתחלה,אבל באמת שזה קורס מומלץ ! כי זה קורס שאם תשקיע,ולא יותר מידי תתוגמל ב90+ תמיר אח יקר.", "timestamp": 1613775179389}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: מרצה שמתקשה בלהסביר את החומר אבל בסך הכל סביר, לדעתי אפשר להצליח במבחן גם בלי  ללכת להרצאות אם קוראים אותן לבד, אבל הן עדיין טובות למי שאוהב לקבל אינטואיציה לחומר\n\nשם המתרגל/ת: בר/תום\nחוות דעת - תרגולים: תרגולים ממש טובים וממוקדים בחומר ועושים סדר, כדאי ללכת אליהם.\n\nשעורי הבית: 6 תרגילי בית שמתוכם היינו צריכים להגיש 5, ארוכים ולא פשוטים, לוקחים לא מעט זמן ודורש השקעה אך רלוונטיים למבחן\n\nהמבחן: קליל בסך הכל\n\nהשורה התחתונה: קורס מעניין מבחינת תוכן, דורש הרבה השקעה בזמן הסימסטר אבל בסוף הציונים מתגמלים.", "timestamp": 1614674362785}, {"author": "no", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: הרצאות משעממות ולא מובנות בכלל.\n\nשם המתרגל/ת: תום רון\nחוות דעת - תרגולים: מתרגל מצויין, עונה לשאלות, מעניין יחסית.\n\nשעורי הבית: יש 5 תרגילים ארוכים. \n\nהמבחן: חלק מהשאלות ממוחזרות, חלק חדשות\n\nהשורה התחתונה: קורס נחמד עם חומר חשוב. המרצה גרוע אבל אפשר להתמודד.", "timestamp": 1615193598680}, {"author": ".,", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: חובה ללכת להרצאות, אי אפשר להשלים רק מתרגולים \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רק עוברים על החומר עצמו ולא באמת מתרגלים את החומר. תרגול של שעה ממש לא מספיק בקורס הזה\n\nשעורי הבית: די ארוכים וקשים\n\nהמבחן: לא מחובר למה שנלמד בכיתה בכלל, לא פרופורציונלי למבחני עבר\n\nהשורה התחתונה: לקחת את הקורס עם כל מרצה אחר רק לא עם דן גרבר!!!", "timestamp": 1627794900822}, {"author": "DDos", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nדן גרבר\nחוות דעת - הרצאות: \nדן גרבר האיש שלא חלם להיות מורה- אל תדאג רואים זאת טוב טוב.\nהמרצה הכי מזעזע בפקולטה לתעשייה וניהול, מרצה עם רגשי נחיתות מורגשים ביותר אשר חי וניזון מלעשות שרירים על סטודנטים תמימים בשנה ב' בפקולטה לתעשייה וניהול.\nאדם בלתי נסבל אשר לא יודע לקחת אחריות, ורק נוטה להאשים את הסטודנטים בכל מה שלא טוב.\nמתנהג כאילו הוא רוק סטאר בתחומו, אך בפועל....\n\nשם המתרגל/ת: \nראני\nחוות דעת - תרגולים: \nהמתרגל חביב, רואים שהוא השקיע ורצה להעביר את החומר בצורה הטובה ביותר, אם המבחן היה תואם את הרמה שהוא לימד אז הייתי אומר שהוא היה אפילו יותר טוב, אבל להראות לנו איך לצייר קו בשאלות ממבחנים בתרגול ואז לשאול על כל דבר אחר .... \n\nשעורי הבית: \nבסדר גמור, זורמים ואפשר לסיים כל גיליון ביום עבודה.\nבסמסטר רגיל (בלי דן) הייתי אומר אפילו שהם חשובים כדי להצליח במבחן.\nהמבחן: \nדן גרבר עשה שיטות אלגבריות, הרס והשחית קורס שכל מחזור אחר נהנה ממנו מאוד הן בפן הלימודי והן מבחינת ציון: הוריד את אחוז שיעורי הבית, לקח את הבחירה במבחן, הוסיף שאלות, שאל שאלות ברמות קושי הזויות שאין להן קשר אלינו- מבחן עמוס שרוב האנשים לא סיימו לענות עליו בכלל.\nהעיקר הוציא הודעה בסוף המבחן שלטעמו המבחן היה קל למדי- שרירים על סטודנטים תמימים כבר אמרנו?- מה שעושה לך טוב דן גרבר העיקר לסיים עם כל קורס שאתה מעביר .\n\nדן גרבר \nהשורה התחתונה: \nלא לקחת *בחיים* קורס שדן גרבר מעביר, תשאירו את העונש הזה לאנשים אחרים.\n\nקורס שאמור ללמד הרבה, בפועל מבוא להנדסת נתונים עדיין לימד הרבה יותר ב1 נק\"ז.\n\nעד כאן DDos", "timestamp": 1627893331758}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nבתור מרצה הוא נהדר ממש, בתור כותב מבחנים הוא קוטל.\n\nשם המתרגל/ת: ראני חורי\nחוות דעת - תרגולים: \nמתרגל נהדר, מעביר את החומר בצורה ברורה ועונה על שאלות בצורה מאוד עניינית. מתרגל שמחפש איפה הוא יכול לעזור לסטונדטים שבאים ללמוד אצלו. מומלץ מאוד.\n\nשעורי הבית: \n6 תרגילי בית שכוללים הוכחות מתמטיות וכתיבת קוד. ההוכחות המתמטיות זה בגדול להעתיק הוכחות שראינו בהרצאה והכתיבת קוד לא נוראית בכלל \n\nהמבחן: \nהמבחנים של דן לעומת תמיר חזן לא ברי השוואה בכלל. הסמסטר דן כתב מבחן שהשאיר את רוב מי שלקח אותו פעורי פה. אם יש אפשרות לקחת שתמיר מעביר את הקורס אז עדיף רק בשביל רמת המבחנים של דן.\n\nהשורה התחתונה: \nאחד הקורסים היותר רלוונטים וחשובים שעשיתי בתואר, דריסת רגל ראשונה בעולם של machine learning.", "timestamp": 1628325217411}, {"author": "א", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nמשעממות, הוכחות בעיקר\nשם המתרגל/ת: ראני\nחוות דעת - תרגולים: הרצאתיים, לא פותרים תרגילים אלא עוברים על החומר של ההרצאות\n\nשעורי הבית: קלילים, דורשים זמן סביר לגיליון של אחת לשבועיים\n\nהמבחן: \nמחריד ולא קשור לחיים, לא דומה למבחנים של תמיר\nהשורה התחתונה: לחכות לסמסטר שתמיר מעביר את הקורס ולהתרחק מדן", "timestamp": 1628848474851}, {"author": "Ophir Carmeli", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nבמילה אחת - שעמום! מרצה בצורה מאוד מבולגנת ולא ברורה, שם דגש על הוכחות המתבססות על קורס שיטות אלגבריות - קורס אשר אינו מהווה קדם לקורס הנ\"ל וכל מסלול הנדסת מערכות מידע לא למד את הקורס. יוצר פער ואי נעימות למסלול הנדסת מערכות מידע שבחלק גדול מההרצאות יושב ולא מבין מה הוא רוצה. בגדול חבל שנתקלתי בו.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמעיקים, אבל לא מאוד קשים.\nהמבחן: \nבמילה אחת - זוועה.\nהשורה התחתונה: חבל שלקחו קורס כל כך מעניין ולימדו אותו בצורה הכי משעממת ומבאסת שיש.", "timestamp": 1629188191380}, {"author": "pac", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: הנושאים בקורס מעניינים אבל דן גורם להם להיראות כמו קורס המשך של אינפי. משתדל להעביר את החומר בצורה מעניינת אבל הכל מלווה בהוכחות מתמטיות מסורבלות שמסיחות את הדעת מהתכל'ס. בנוסף הוא כנראה כותב את המצגות שלו ב- 12 בלילה אז לא תמצאו מצגת שאין בה טעויות, ואם לא שמתם לב לטעות נדפקתם\n\nשם המתרגל/ת: ראני ודניאל\nחוות דעת - תרגולים: מסבירים בצורה טובה\n\nשעורי הבית: השאלות התיאורטיות הן המשך ממש המשך ישיר לקורס שיטות אלגבריות (שבאופן מפתיע, הוא לא קדם של הקורס הזה). השאלות התכנותיות לא מסובכות במיוחד אבל למי שאין רקע קודם בספריות כמו pandas, matplotlib, scikit-learn יהיה די קשה\n\nהמבחן: מועד א' מנותק מהמציאות, לא דומה לאף מועד קודם כשדן לא העביר את הקורס, ממוצע זוועתי, פקטור בשמיים. ממש כמו שאר הקורסים בפקולטה הזאת, כשחושבים על זה.\n\nהשורה התחתונה: קורס מעניין וחשוב להמשך אבל מתמקד בתפל ולא בעיקר. עדיף לא לקחת כשדן מעביר אותו", "timestamp": 1631134038974}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: \nהרצאות משעממות, לוקחים נושאים שיכולים להיות מעניינים והופכים אותם לכבדים ומשמימים. \nבפועל רוב ההרצאות אלו הוכחות של משפטים.\n\nשם המתרגל/ת: ראני\nחוות דעת - תרגולים: \nראני היה מקסים ואדיב והסביר טוב אך התרגולים עצמם לא מספיק משמעותיים ועוזרים. בפועל רוב מה שעושים זה לחזור על החומר מההרצאה ולא נותנים בכלל כלים או שאלות לדוגמא ששוות לרמה כלשהי במבחן.\n\nשעורי הבית: \nרוב התרגילים יותר תיכנותיים (בפייתון או בג'ופיטר) וכן דורשים זמן\n\nהמבחן: מבחן קשה-גם מועד א' וגם מועד ב', עם הכלים שניתנו לנו במהלך הסמסטר יש אפס סיכויי הצלחה, טרם התקבלו ציוני מועדי ב' אך היה פקטור מטורף בשל המבחן הלא הוגן בעליל שהתקיים הסמסטר, דן ידוע בתור אחד שנותן מבחנים לא הוגנים (והוא אפילו לא מודה בזה, טוען שהיה מבחן קל)\n\nהשורה התחתונה: לא לקחת עם דן את הקורס הזה, אם אפשר לקחת עם מרצה אחר- עדיף.", "timestamp": 1635109034314}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שלייט\nחוות דעת - הרצאות: מרצה טוב, רואים שמעניין אותו החומר. מרגישה שנתן הסתכלות פרקטית על החומר התיאורתי וחיבר אותה לאיך עושים את הדברים גם בפועל. \n\nשם המתרגל/ת: אלדר\nחוות דעת - תרגולים: אחד המרצים הכי מתוקים שיש! התחיל כל תרגול עם נשימות, ניסה להסביר הכי טוב שאפשר. \nבאופן כללי הרגיש שהתרגולים חוזרים על החומר של ההרצאות עוד פעם ולא תמיד חידשו הרבה, אז בעיניי היו די משעממים ולא תמיד נחוצים, אבל אלדר כמתרגל היה מקסים\n\nשעורי הבית: \nיחסית קלילים, לא מאוד מורכבים אבל כן מוודאים הבנה של החומר. \nהמבחן: המבחן שלנו היה מאוד שונה מהמבחנים הקודמים. מבחן על מהירות עם הרבה הגדרות, לא מאוד ברור מה יצא ממנו. \n\nהשורה התחתונה: קורס חשוב, צריך להפיק ממנו את המירב", "timestamp": 1645009973802}, {"author": "KCAH", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: החומר מעניין מאוד ומועבר בצורה טובה גם כן. הקורס דורש ידע מתמטי מאוד נרחב (יותר מהקדמים שלו) וקופץ מהר מדי לנוטציות קשות. מומלץ לעבור היכרות עם החומר קצת לפני הקורס.\nהמרצה מעולה, יודע להסביר את החומר ומביא דוגמאות טובות. \nמדי פעם המרצה רץ מהר מדי על ההרצאה ומסיים מוקדם, בלי שאף אחד הבין.\n\nשם המתרגל/ת: אלדר\nחוות דעת - תרגולים: לדעתי חשוב מאוד להגיע לתרגולים, שכן בתרגולים מועבר החומר בצורה פרקטית יותר (לעומת הצורה המתטית של ההרצאות). \nאלדר מתרגל מעולה, יודע להעביר את החומר בצורה מעניינת, ואפילו מצחיקה.\n\nשעורי הבית: ארוכים וחשובים, מומלץ לפתור בזוגות\n\nהמבחן: ארוךךךךךך מאוד, אבל לא קשה במיוחד. מומלץ להצתייד בדף נוסחאות שמחסה את כל החומר (כולל הוכחות)\n\nהשורה התחתונה: אחלה קורס, מאוד מעניין. \nחשוב להגיע להרצאות ולתרגולים.", "timestamp": 1646821597985}, {"author": "adaboost", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: מרצה מעולה, מעביר בצורה מאוד טובה את החומר, תמיד נותן זמן ומקום לשאלות ובכללי נותן אחלה יחס לסטודנטים.\n\nשם המתרגל/ת: אלדר\nחוות דעת - תרגולים: מתרגל שהוא תותח, נותן זווית קצת אחרת על החומר שמאוד עוזרת להבין, התרגולים הם פשוט חזרה על ההרצאות אבל לפחות לי הם מאוד הועילו.\n\nשעורי הבית: קצת מעיקים כי לפעמים יכולים לקחת זמן, אבל בסך הכל המשימות די מגניבות וקצת מורידות לקרקע את החומר המאוד תיאורטי של ההרצאות.\n\nהמבחן: ארוך ברמה שהוסיפו לנו עוד זמן ועדיין זה היה על הקשקש, **תקחו דף נוסחאות טוב** צריך לחזור על הוכחות מההרצאה והגדרות שאין הרבה סיכוי לשחזר כמו שצריך אם זה לא כתוב לכם לפחות בראשי פרקים. \n\nהשורה התחתונה: אחד הקורסים המעניינים עד עכשיו בתואר, אחלה סגל, ממליץ", "timestamp": 1646997218266}, {"author": "Hard SVM", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: הצטייר במרצה נחמד, מסביר את החומר בצורה סבבה.\n\nשם המתרגל/ת: אלדר\nחוות דעת - תרגולים: המתרגל הכי טוב בכל הפקולטה בפער, מפשט את החומר בצורה מדהימה, מדבר בגובה העיניים, חשוב לו שהסטודנטים יבינו והוא תמיד נכון לעזור ולהסביר מעבר! שאפו אלדר, היה תענוג\n\nשעורי הבית: 5 גליונות חובה, כל גליון מכיל חלק רטוב וחלק יבש, הרוב ממוחזר, החלקים הרטובים של הש\"ב מעניינים ופרקטיים מאוד!\n\nהמבחן: מ-ז-ע-ז-ע, הממוצע של מועד א' היה 65 וממוצע של מועד ב' 60, אורי לא נתן נקודה פקטור, המבחן היה שונה לגמרי מכל המבחני עבר שקיימים, דרש שנדקלם הוכחות מההרצאה וגם להוכיח משפטים שהוא לא הוכיח לנו.. מבחן וממוצעים מאכזבים מאוד.\n\nהשורה התחתונה: לברוח מאורי שליט, פשוט עשה מבחנים לא הוגנים בעליל. לא לברוח מאלדר, הוא מעולה!", "timestamp": 1647184278115}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: אחד המרצים הטובים בפקולטה. מסביר את המעברים המתמטיים ברמה ברורה למרות שיש פה ושם טעויות במצגות. חלק מההרצאות עמוסות במעברים מתמטיים ומי שלקח שיטות עם דן אז המעברים יהיו לו ברורים יחסית עד כדי טריקים שרואים פעם אחת ומבינים. בסך הכל המצגות ברורות ובנויות בצורה טובה.\n\nשם המתרגל/ת: אלדר אברהם ועומר נחום\nחוות דעת - תרגולים: בעיני התרגולים די מיותרים. הם בסך הכל עוברים על החומר של ההרצאה שוב ולא מחדשים כלום (אולי מוסיפים 2 שאלות בסוף אבל לרוב לא מגיעים אליהן). \nאלדר מנסה לפשט את החומר ולהנגיש אותו אבל למי שהבין את החומר זה מרגיש מיותר ברמות.\nעומר מצד שני מסביר את הדברים בגובה העיניים ובצורה מאוד מדויקת ולא חופרת. \n\nשעורי הבית: 6 תרגילי בית ומתוכם חובה לעשות 5. \nכל תרגיל מורכב מחלקים תכנותיים וחלקים תיאורטיים אבל החלקים התיאורטיים לרוב מאוד פשוטים (להעתיק מעברים מההרצאה \\ משהו קל מאוד).\nהחלקים התכנותיים קשורים לנלמד בהרצאה ומיישמים את כל האלגוריתמים שאנחנו לומדים. היו כמה תרגילי בית שהיו עמוסים מהרגיל ברמת הקוד אבל זה לא נורא בכלל.\nאפשר לסיים את רוב הגליונות ביום.\n\nהמבחן: היה מבחן הוגן מאוד. הייתה שאלה מועתקת ממועד ג של סמסטר קודם ועוד 2 שאלות לא מורכבות שמי שידע את החומר יכל לענות עליהן בלי להסתבך בכלל. שאלה אחרונה הייתה קצת יותר מאתגרת אבל הרבה אנשים שאני מכיר הוציאו 80+ על הטופס.\nהזדמנות של פעם בחיים המועד הזה!\n\nהשורה התחתונה: קורס חשוב מאוד ויוצאים ממנו עם כלים שמשתמשים בהם בתעשייה.", "timestamp": 1660039257222}, {"author": "ניק", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה רהוט וטוב ומסביר את החומר בצורה טובה. הבעיה היא שהמעברים הם באמת ברמה מאוד מאוד מאוד גבוהה וקל לאבד אותו ואז קשה מאוד לחזור אז צריך לנסות באמת להקשיב. \n\nשם המתרגל/ת: עומר נחום\nחוות דעת - תרגולים: מסביר את החומר בצורה טובה ומדויקת ונותן להבין את החומר כמו שצריך. קצת מונוטוני מדי לטעמי.\nהתרגולים מתמקדים בלחזור על החומר של ההרצאה ולא מספיק בלעשות תרגילים.\n\nשעורי הבית: 6 תרגילי בית בזוגות (5 חובה). משולבים הוכחות תיאורטיות ושימוש מעשי של החומר (בפייתון). לרוב יש רפרנסים אחרת קשה מאוד.\n\nהמבחן: קשה מאוד. 4 שאלות עם סעיפים, לא פשוט בכלל. הקורס עמוס בחומר אז גם ההכנה למבחן לא קלה בכלל.\n\nהשורה התחתונה: קורס קשה שצריך להבין לעמוק כדי להצליח בו.", "timestamp": 1660067854496}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה טוב, שקופיות מעולות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1666787486553}, {"author": "מסווג הפפאיות האולטימטיבי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות (הקלטות משנה שעברה): דן מרצה מצוין, מעבר לזה שהסכים לשחרר הקלטות הוא גם מעביר את החומר בצורה מאוד מעניינת וכריזמטית. בזכותו הקורס הזה, שרמת המתמטיקה וההבנה הנדרשת בו מאוד גבוהה, לא היה כל כך נורא.\nהערה היחידה שלי היא שלפעמים הוא מדלג מאוד מהר על הצגת הנושא של השיעור וקופץ מהר מאוד למשפטי אנליזה מורכבים שגוזלים כמעט את כל השיעור. אם לא הייתה לי אפשרות לעצור את ההקלטה בשביל לראות הסברים נוספים על הבסיס שעליו מדברים, לא הייתי מבין כלום. טיפ: לפני ההרצאה תצפו בסרטונים של StatQuest ביוטיוב על נושא השיעור, יגרום לכם להבין הכל בהרצאה.\n\nשם המתרגל/ת: אלדר אברהם\nחוות דעת - תרגולים: אחלה מתרגל למדיטציה, ללמידה חישובית קצת פחות. לא באשמתו, כי  80% מהתרגולים זה חזרה על ההרצאה (פה ושם יש תרגילים קטנים), ואי אפשר להשוות רמה של מרצה לרמה של מתרגל.  בדיעבד הייתי מדלג עליהם ופותר שאלות ממבחנים במקום, הרבה יותר יעיל.\n\nשעורי הבית: מהווים 30% מהציון, בזוגות, בדר\"כ חצי יבשים וחצי רטובים. ארוכים אך לדעתי לא קשים במיוחד, המבחן מאתגר יותר. החלק הרטוב לא יכין אתכם למבחן, אז תתאמצו ביבש ותרפרנסו את הרטוב.\n\nהמבחן: בניגוד לדעה הרווחת אני חושב שהמבחן בקורס הזה לא קשה במיוחד. הבעיה הגדולה היא שאין כמעט תרגול של שאלות מורכבות במהלך הסמסטר (פרט לתרגילים בודדים בש\"ב) ולכן קשה מאוד להגיע לרמת מוכנות גבוהה לקראת המבחן בכמה ימי למידה. צריך לתת לחומר לשקוע כדי להצליח בקורס הזה, אז כמו שכתבתי מקודם כדאי להשקיע אקסטרה ולפתור מבחנים במהלך הסמסטר.\n\nהשורה התחתונה: קשה יש רק ב-SVM. המבין יבין.", "timestamp": 1667143681366}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דן\nחוות דעת - הרצאות: דן מרצה מעולה לדעתי, סתם נותן לעצמו שם רע בגלל קושי המבחנים שהוא כותב\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: בזבוז זמן, לא פותרים תרגילים, סתם עושים תקציר להרצאות, חוץ מהתרגול על עצים.\n\nשעורי הבית: מרופרנסים ומחלקים 100. נחמד. יש אחד כל שבועיים שיש חלק יבש וחלק רטוב\n\nהמבחן: קשה, אך לדעתי לא קשה כמו של דן רגיל. יש שמועות שהוא לא כתב את המבחן, כי הוא היה בהחלט פתיר.  בכל זאת, לא קל כמו מבחנים של תמיר/אורי\n\nהשורה התחתונה: סביר, שווה להשקיע בו כי זה קורס בסיס לכל הML", "timestamp": 1667221048558}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: קצת רץ, לא תמיד הכי ברור במיוחד עם המתמטיקה וההוכחות הכבדות שיש בהרצאות \n\nשם המתרגל/ת: משה זיסר\nחוות דעת - תרגולים: אחלה מתרגל, אין תלונות. עוזר לסדר את הבלאגן של אורי\n\nשעורי הבית: הוגנים, מרופרנסים \n\nהמבחן: דף נוסחאות 10 עמודים, הרבה שאלות שאפשר לענות רק איתו \n\nהשורה התחתונה: קורס מלמד וטוב, מתמטיקה מאוד קשה", "timestamp": 1676457648293}, {"author": "Hard SVM", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nאורי שליט מרצה מעולה טיפה ממהר מסביר מדהים!\n\nשם המתרגל/ת: \nעומר נחום - אסרטיבי יורד לפרטים ומפשט את ההרצאות\n\nשעורי הבית: \nמרופרנסים בעיקר שאלות שהן לא קוד קריטיות כי הן ממבחנים אז כדאי כן לשבור עליהן את הראש\nהמבחן: \nעמוס מבחינת הזמן וחשוב דף נוסחאות טוב !\n\nהשורה התחתונה:", "timestamp": 1677433485694}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן מרצה מצוין ומעביר את החומר ברמה מעולה. הוא מאוד בקיא בו ולדעתי ההרצאות היו מאוד מעניינות, אבל יש פה ושם הוכחות די כבדות שקצת קשה לעקוב אחריהן, וכן לדעתי צריך לחזור על החומר לפני ההרצאות בשביל להיות מסוגלים לעקוב אחרי כל מה שדן מעביר.\n\nשם המתרגל/ת: אופק אברהם\nחוות דעת - תרגולים: תותח על, התרגולים היו ברמה מאוד גבוהה. רוב התרגולים די מסכמים את ההרצאה בצורה יותר מקוצרת ואופק הרבה פעמים נתן אינטואיציות טובות לחומר שעזרו להבין אותו. פה ושם גם עושים תרגילים מבחינות ומקבלים קצת מושג לאיך לגשת לשאלות מבחינה. \n\nשעורי הבית: חמש מטלות שעושים בזוגות, משלבות בין יבש לרטוב. החלק היבש הוא די סטייל של דברים שמופיעים בבחינה (חלקו גם לקוח מהבחינות) והוא חזרה טובה על החומר התיאורטי של הקורס. הרטוב זה בעיקר מימוש מודלים שראינו בהרצאה ואנליזה שלהם בעזרת כל הספריות הכי נפוצות בתחום בפייתון. השתי תרגילים הראשונים קצת מאתגרים כי עוד לא משופשפים בזה, אבל אחריהם הכל הופך לממש סבבה, יש גם מטלות שהן לא יותר משעתיים/שלוש עבודה אם עובדים יעיל. הם 30% תקף אז כדאי להשקיע.\n\nהמבחן: מבחן דן גרבר קלאסי, ממוצע 45 על הטופס ופקטור של 20 נקודות. מי שידע טוב תחומר אמנם לא באמת יכל להוציא מעל 85 על הטופס, אבל כן לעשות מספיק נקודות בשביל שהפקטור יסדר אותו, אז אולי המבחן לא הוגן אבל סה\"כ יצאו איתנו די סבבה.\n\nהשורה התחתונה: קורס מעולה, מאוד נהנתי לאורך הסמסטר ותכלס גם חשוב מאוד כי זה צעד ראשון בעולם של ML.", "timestamp": 1691597148047}, {"author": "?????", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: סך הכל דן מרצה מעניין, מעביר את רוב החומר בצורה ברורה ומעניינת, הוכחות מסורבלות וקשות.\n\nשם המתרגל/ת: אופק\nחוות דעת - תרגולים: אחלה מתרגל, אכפתי מאוד לסטודנטים שלו.\n\nשעורי הבית: מרופרנסים\n\nהמבחן: לא היה דומה לאף מבחן עבר, מצריך הבנה עמוקה מעבר למה שלמדנו בהרצאות והתרגולים. לא פשוט בכלל.\n\nהשורה התחתונה: קורס מאוד מעניין ופרקטי, מבחן קשוח.", "timestamp": 1691741453430}, {"author": "פרספטרון רב שיכבתי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  אורי שליט\nחוות דעת - הרצאות: \nאורי מלמד את הקורס נהדר, מסביר את החומר בצורה ברורה, נותן אינטואיציה ומאד מנסה לעזור לסטודנטים להבין הכל. מוכן להשקיע ולענות על כל השאלות שיש לנו.\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: \nיודע את החומר ומסביר אותו אבל בגישה מאד מתמטית, לי אישית היו חסרים קצת הסברים אינטואטיביים.\nנראה היה שזה סמסטר ראשון שהוא מתרגל והוא קצת ביישן, אבל ברגע שיהיה לו נוח ללמד מול כיתה הוא יכול להיות מתרגל מעולה. סה\"כ בסדר גמור, קצת חסר ניסיון בשלב זה.\n\nשעורי הבית: בנויים טוב, מראים את הטריקים והחשיבה שמנסים להקנות בקורס.\n\nהמבחן: היה בסדר גמור, היו בו גם חלקים חישוביים וגם חלקים שדרשו הבנה של החומר ואינטואיציה.\n\nהשורה התחתונה: קורס בסיס טוב שכל מי שרוצה לעשות ב-DS/ML צריך לעבור", "timestamp": 1715780328058}, {"author": "Koren Greenberg", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לא זוכר\nחוות דעת - הרצאות: מועברות היטב עם דגש נכון על הרקע המתמטי\n\nשם המתרגל/ת: לא הייתי\nחוות דעת - תרגולים: לא הייתי\n\nשעורי הבית: דורשים זמן והשקעה\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מוצלח", "timestamp": 1716450907091}]}