{"posts": [{"author": "שרון סגל", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ג'קי\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מאוד מובנים ועוזרים\n\nשעורי הבית: גיליון לשבוע, לא קשים\n\nהמבחן: בגלל הקורונה היה פרויקט (קשה)\n\nהשורה התחתונה: נחמד", "timestamp": 1616535300352}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ג'קי\nחוות דעת - הרצאות: סוג של המשך של סטטיסטיקה רק פחות תיאורטי ויותר פרקטי. ג'קי ממש חמודה אבל קצת מעופפת ולא הכי ברורה. היא מאוד מנסה שנבין את העקרונות ולדעת דברים מבלי לחשב פיזית - זה מגיע גם במבחן, אז כדאי להקשיב בחלקים האלה של האינטואיציה.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מעולה, ממש עושה סדר בחומר של ההרצאות.\n\nשעורי הבית: 9 גיליונות להגשה בזוגות, לא קשים בכלל, כמעט להכל יש רפרנס ואם לא, די ברור מהתרגולים איך לפתור.\n\nהמבחן: 20 שאלות אמריקאיות. לא פשוט אבל גם לא קשה מידי. לא תיאורטי ברמת מבוא לסטטיסטיקה אבל כן צריך להבין את הדברים ולא רק לדעת לחשב טכנית.\n\nהשורה התחתונה: קורס סטטיסטיקה קלאסי, p-value וכל החברים, אבל לא מכביד על הנשמה כמו מבוא", "timestamp": 1645193042345}, {"author": "סתיו נקי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ג׳קי אשר\nחוות דעת - הרצאות: \nחמודה, רוצה שנצליח, אבל גם באמת רוצה שנבין את החומר עד הסוף. קשה לעקוב כשהיא על הjmp... לא פשוט, קיצור\nשם המתרגל/ת: נעם בן משה\nחוות דעת - תרגולים: \nמתרגלת שהגיעה, לדבריה, ״בשביל לתרגל את האנגלית שלה״ ו ״כי המרצה ביקשה״. בחורה חמודה ועושה רושם שמבינה את החומר אבל קרינג׳ית כשמנסה לספר על חיי היום יום שלה באופן מפורט (״השותפים בדירה שלי נורא הרעישו אז לא ישנתי הלילה סליחה על האיחור״ איך אנחנו אמורים להגיב כפרה יש גבול). קיצור לכו לנדיה.\n\nשעורי הבית: בהתחלה קליל, בהמשך נהיה די קשה, אבל בעיקר חופר שצריך אשכרה כל שבוע להגיש\n\nהמבחן: \nלא קל בכלל. רק מי שבאמת מבין את המאחורה של החומר יכול להשיג מעל 80-85.\nהשורה התחתונה: קורס קשה אבל שניתן להצליח בו. דווקא יש שם דברים שהם בעיניי די רלוונטיים, למשל כל העניין של anova, ancova, multiple regression. וגם דברים שקצת פחות. לא סתם קורס חובה בפקולטה להנדסת ביוטכנולוגיה ומזון, תואר שני.", "timestamp": 1680290354403}]}