{"posts": [{"author": "סטודנט ממורמר", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: \nמרצה מעולה אבל קצת אוברייטד. הרצאות קשוחות, צריך לחזור על החומר כל שבוע (אורן גם מניח שאתם עושים את זה ימצטיינים) כדי להבין מה הולך בקורס וגם עם זה שיהיה לכם בהצלחה. \nבנוסף, יש עתודאים ב\"אלונים\" שבאים עם ידע מקדים ע\"י זה שהם עושים פרויקט עם אורן לפני ובקורס התחרותי הזה זה כן מהווה פקטור. \nשם המתרגל/ת: אילון שיטרת\nחוות דעת - תרגולים: \nמתרגל סבבה שמסביר טוב כשהוא טורח להעלות את התרגול. ההקלטה התפקששה לו? בהצלחה לכם עם המצגת בלבד או רק הסאונד.\nשעורי הבית: \nמעצבנים ועמוסים. משתמשים ב Indri, תוכנה שמותקנת על המכונה כדי שיהיה אפשר להריץ שאילתות/בניית אינדקס לכל המסמכים. \nהמבחן: \nלא עשיתי עת כתיבת שורות אלו אבל אורן מבטיח שיהיה קשה :)\nהשורה התחתונה: \nקורס נישתי, מעצבן ולא מתגמל. אם אתם לא מעוניינים בקריירה באחזור מידע כדאי לכם לשקול את הצעדים שלכם בחוכמה. \nאגב, גם אם אתם כן רוצים קריירה באחזור מידע, תהיו מוכנים לזה שאורן ייקח את הטובים מבין אלו שיצליחו בתחרותי השני בו צריך ליצור מודל שיאחזר את המסמכים הנכונים כמה שיותר גבוה (נותנים לכם רק חלק, train ו test שלהם..)", "timestamp": 1609713026849}, {"author": "Wizohar", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורן \nחוות דעת - הרצאות: מרצה טוב שמסוגל להחזיק עניין אפילו בזום בנוסף הוא תמיד נותן 15 דק הפסקה. ההרצאות מאוד עמוסות ולכן די מתישות בנוסף צריך לעשות חזרה על החומר לפניהן כדי להיות מסוגלים לעקוב ולמעשה אורן מניח שהסטודנטים עושים את זה. חייבים לראות את ההרצאות כדי להבין טוב את החומר\n\nשם המתרגל/ת: אילון\nחוות דעת - תרגולים: התרגולים עוזרים מאוד להבנה והם מאוד לעניין. לפעמים היו בעיות עם ההקלטה.\n\nשעורי הבית: גליונות לא מאוד ארוכים או קשים והחלק התיאורטי בהם מאוד עוזר להבנה אבל החלק המעשי הוא בindri ויש שם הרבה התעסקות מייגעת.\n\nהמבחן: מבחן שלא סביר לפרק הזמן שניתן כדי לפתור אותו. בנוסף אין כלכך מבחני עבר כי אורן מאוד קנאי לזכיויות היוצרים שלו עליהם ולא מפרסם אותם ולכן אין הרבה ממה להתכונן. אבל לפחות יש הרבה הזדמנויות להשיג נק בונוס למבחן ויש כאלה שמגיעים גם ל20 נק בונוס\n\nהשורה התחתונה: קורס עמוס תיאורטית, אני מוצא את הנושא מעניין אבל אם אתם לא חושבים שהנושא מעניין אז הוא לא מומלץ", "timestamp": 1613350453038}, {"author": "שליחי הדודה ובינימין ידיד השם", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ אורן קורלנד האגדי\nחוות דעת - הרצאות: המרצה הכי טוב בטכניון בפער. מסביר מעולה, עונה לכל השאלות בצורה מפורטת וסבלנית ומעביר את החומר בצורה מעניינת מאוד ועניינית מאוד. תמיד נכון לעזור. מרצה מרתק וחומר הקורס נהדר. רלוונטי להמון תחומים. חומר מעניין שמשלב המון תחומים מקורסים שונים. המרצה שובה את לב הצופים בצורה יוצאת דופן, פשוט פנטסטי. \n\nשם המתרגל/ת: אילון שטרית\nחוות דעת - תרגולים: מתרגל שלא יודע את חומר הקורס ולא מחובר למה שקורה בו. לא נחמד בכלל, שחצן, מזלזל בסטודנטים כשהם לא מבינים וכשהם שואלים שאלות. בתרגולים שלו הוא מדבר לסטודנטים כמו לילדים על הרצף. פשוט זוועה. המזל הוא שהתרגולים מיותרים ביותר. ההרצאות מכילות את כל החומר ברמה מאוד גבוהה ומועברות בצורה נהדרת.\n\nשעורי הבית: שיעורי בית יבשים ברובם המוחלט וברמה יחסית נמוכה. לא לוקחים הרבה זמן. שיעורי הבית לא עוזרים להבנת החומר ולהתנסות במימוש החומר הנלמד.\n\nהמבחן: מבחן מאוד מאוד הוגן! שאלות לרוב לא קשות ושאלות שהיה להן מענה בהרצאות (רק הזמן דוחק). הבדיקה הזויה וקיצונית. ניתן לצבור בקורס נקודות בונוס במהלך הסמסטר, דבר שמאזן את הבדיקה.\n\nהשורה התחתונה: קורס מומלץ עם מרצה מדהים! לא ללכת לתרגולים. קורס שרלוונטי לתחומים רבים ומשלב ידע מקורסים אחרים.", "timestamp": 1614123370725}, {"author": "nono", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: המון מתמטיקה וקצב גבוה. שקפים לא מי יודע מה שקצת מקשים לעקוב.\n\nשם המתרגל/ת: איילון שטרית\nחוות דעת - תרגולים: תרגולים טובים\n\nשעורי הבית: שלושה או ארבעה תרגילים, לא קשים מדי. יש פעילויות בונוס שגם לא דורשות המון השקעה.\n\nהמבחן: מבחן נורא. הממוצע לפני בונוס הוא לכל היות 60. לאורך הסמסטר יש פעילויות בונוס שבפועל משמשות כפקטור (שזה קטע די מסריח).\n\nהשורה התחתונה: קורס קשוח ומלא בחומר. לא לצפות לציון גבוה.", "timestamp": 1615995345966}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורן קורלנד\nחוות דעת - הרצאות: סבבה סך הכל.\nפה ושם יש הזדמנות לזכות בכמה נקודות בונוס עם שאלות שהוא שואל במהלך ההרצאה ככה שזה מעורר חשיבה.\nלא מפסיק לדבר על הקורס המתקדם תוך כדי ההרצאה וזה נהיה מעיק בשלב מסוים.\n\nשם המתרגל/ת: חיה נחימובסקי\nחוות דעת - תרגולים: תרגולים שחוזרים על ההרצאה. אין מה ללכת ואפשר לעבור על המצגות לבד אחרי זה.\n\nשעורי הבית: 3 שיעורי בית שהראשון מביניהם תכנותי נטו. לא עמוסים יותר מדי וכמעט כל השאלות ממוחזרות.\n\nהמבחן: מבחן הוגן מאוד. אין הרבה מאיפה לפתור אז כדאי לעבור על השאלות שהם מפרסמים ולפתור אותן עם כמה אנשים ואז להשוות.\n\nהשורה התחתונה: קורלנד יודע ללמד את החומר בצורה טובה אבל ספציפית בסמסטר שלנו עם כל השביתה וזה הרגיש שהוא קצת זרק. קורס חשוב מבחינה תיאורטית אבל לא יוצאים עם שום דבר פרקטי.", "timestamp": 1694297057033}]}