{"posts": [{"author": "נועה ישראלי #חיים_מתוך_מחלוקת", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ד\"ר יבגני ברזק (הגברמלך)\nחוות דעת - הרצאות: \nההרצאות עצמן עלולות להיות קצת מונוטוניות לעיתים מבחינת החומר שמועבר, אבל יבגני התותח הקפיד לשלב אנקדוטות ובדיחות וממים ודברים אקטואליים שקשורים לנושא וגם השתתפות קהל לפעמים וזה ממש הקפיץ את האווירה. בגדול כמו ששמתם לב אנחנו חושבים שהוא מרצה טוב ואחלה איש בכללי. \n\nשם המתרגל/ת: חצי מהתרגולים רפאל טיקוצ'ינסקי, חצי עומר שובי (גם שניהם גברימלכים)\nחוות דעת - תרגולים: \nהתרגולים היו באמת חמודים מכל הבחינות. שני המתרגלים נהדרים, מסבירים את החומר לאט וברור ומקפידים לענות על שאלות. חלק מהתרגולים כללו גם התנסות מעשית (למשל עם ביטויים רגולריים בפייתון) וזה עוזר לתרגילי הבית. הקורס נותן בין היתר גם קצת אינטואיציה ומבוא בקטנה לכמה מודלים של למידה עמוקה במידה ולא פגשתם עדיין (אין התנסות פרקטית).\n\nשעורי הבית: \nהרוב המוחלט של תרגילי הבית עזרו להבנה של החומר, היו מפוקסים ולעניין. גם לא עמוסים מדי במידה והקשבתם בשיעור. היו גם שאלות יבשות אבל בחלקים הרטובים הסגל הכין מחברות פייתון (על google colab) שכבר מימשו את כל העניינים הטכניים המשעממים וביקשו מאיתנו רק לכתוב קוד (או לא תמיד קוד) שאשכרה קשור לחומר שלמדנו. זה הרגיש כמו נשימה של אוויר רענן ביחס לקורסים אחרים.\n\n*כל זה חוץ מהתרגיל השני שהיה בשבילנו עמוס בבעיות טכניות והתעסקות מיותרת ב-preprocessing (ככל הנראה בלי כוונה של הסגל וייתכן שבסמסטר הבאים זה כבר לא יהיה ככה)\n\nהמבחן: \nאין מבחן, לנו היה פרויקט בזוגות שהיה קשור לנושא שלמדנו בשבועות האחרונים בקורס. הפרויקט היה מורכב משלושה חלקים, ברמת חופש עולה. החלק האחרון היה כמו מיני-מחקר איכותני כזה, בנושא לבחירתנו (תחת מטריית הנושאים שהוצעה). אצלנו תאריך ההגשה היה היום האחרון של הסמסטר, לכן מוסיף קצת עומס לקראת סוף הסמסטר אבל מוריד עומס מתקופת מבחנים.\n\nהשורה התחתונה: \nהחומר היה יחסית מעניין ונהנינו מהפרויקט (בסוף השגנו תוצאות מגניבות), אבל מה שהופך את הקורס למומלץ בטירוף הוא הסגל. סגל פצצה נקודה", "timestamp": 1674514724589}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יבגני \nחוות דעת - הרצאות: ההרצאות מאוד מעניינות, יגבני מסביר על נושאים מעניינים, ניסויים אמיתיים וכו. יש נוכחות חובה, אבל אפשר להחסר מ2 הרצאות ללא צורך באישור. \n\nשם המתרגל/ת: רפאל ועומר\nחוות דעת - תרגולים: בסדר סך הכל, המתרגלים מאוד נחמדים ומוכנים לעזור ולהסביר כל דבר. בכל זאת, הרגשתי שהתרגולים לא הכרחיים להבנת החומר. \n\nשעורי הבית: היו לנו 3 תרגילי בית (תכננו 5 אבל שביתה). תרגילים לא קשים בכלל, מקבלים מחברת כבר עם הנחיות על מה בדיוק לעשות. כל התרגילים תכנתויים. \n\nהמבחן: אין, יש פרויקט - צריך לבחור נושא אחד מתוך 2, והפרויקט מורכב מ3 חלקים. ל2 החלקים הראשונים יש ממש קווים מנחים, החלק השלישי הוא פתוח, ותוכלו לעשות מה שתרצו כדי לנתח ולהבין את הדאטא. בסוף מגישים רק \"מאמר\" בו מסבירים על כל הפרויקט, מוסיפים גרפים , הבחנות וכו. פרויקט שדורש קצת השקעה, אבל לא חייב להיות קשה, מאוד תלוי בנושא שתבחרו. \n\nהשורה התחתונה: קורס מעניין, לא קשה בכלל, וסך הכל נהניתי ממנו.", "timestamp": 1689108103252}, {"author": "Gony Idan", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: הרצאות דיי משעממות. יבגני בגדול מרצה טוב ועם כוונות טובות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ביטלו לנו שניים מהתרגילי בית. תרגילי בית דיי סבירים. החלק של הקוד מגיע עם מחברת גופיטר שמאוד מכווינה איך לבצע את הדברים. לא קשה\n\nהמבחן: אין. יש פרויקט.\nממש לא מסובך, יש שני חלקים מובנים עם הסברים שדיי קל לבצע. יש חלק יצירתי שאתה מעלה שאלת מחקר שאתה רוצב לבדוק ורץ איתה. הם מאוד פתוחים לרעיונות השונים ואפשר ללכת על משהומיחסית פשוט\n\nהשורה התחתונה:", "timestamp": 1689244061372}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יבגני\nחוות דעת - הרצאות: החומר לא הכי מעניין בעולם, אבל יבגני ממש אוהב את החומר ומנסה לערב את הסטודנטים בצורה טובה. אין תלונות. \n\nשם המתרגל/ת: רפאל/שובי\nחוות דעת - תרגולים: כמעט ולא היו, אבל גם פה אין תלונות.\n\nשעורי הבית: מאד מסודרים, לא מחפשים אותך ומעמיקים את ההבנה של החומר. סה\"כ מעולה.\n\nהמבחן: אין\n\nהפרויקט: לא דרש יותר מדיי השקעה, היקף סביר מאד, ומאד מעניין עם הרבה חופש ביטוי.\n\nהשורה התחתונה: קורס מועבר בצורה מצוינת, מעניין, מאד ממליץ", "timestamp": 1691395273387}, {"author": "n gram", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יבגני\nחוות דעת - הרצאות: \nהרצאות לפעמים מאוד מעניינות לפעמים פחות מעניינות אבך יבגני מרצה מאוד מקסים ומנסה ליצור ענין בכיתה\nשם המתרגל/ת: רפאל + עומר\nחוות דעת - תרגולים: \nחשובים, עוזרים להבין את הש.ב ובאחד על אחד שני המתרגלים מאוד נחמדים\n\nשעורי הבית:  מעניינים ומלמדים\n\nהמבחן: אין, יש פרויקט. לצערי יצאנו בטעם רע מהקורס. לאורך הסמסטר הקורס היה די מעניין וסך הכל אווירה חיובית, אבל בסמסטר הזה הסגל התבקש להוריד ממוצע (יבגני אמר את זה בגלוי בהרצאה הראשונה) והדברים אכן באו לידי ביטוי בציונים של הפרויקט. היו הורדות ניקוד לא הגיוניות על דברים שמעולם לא דוברו או נלמדו בכיתה. הפרויקט היה מן סוג של כתיבת מאמר מדעי, כאשר הייתה הורדת נקודות חריפה על אופן כתיבת מאמר מדעי - דבר שמעולם לא דובר בכיתה. במקום להתייחס לתוכן העבודה לרעיונות וטיעונים שהוצגו הסגל בחר להוריד ניקוד על \"כותרות לא מספיק אינפורמטיביות\" ועל הצגת נתונים באחוזים מתוך טענה שזה \"לא קונוונציונלי להציג מדדים באחוזים\" בקיצור מלא שיט כדי להוריד ניקוד ואת הממוצע בקורס.\n(שימו לב שכל הביקורות החיוביות על הפרויקט נכתבו לפי שניתנו עליו הציונים בפועל) הפרויקט באופן כללי כן מעניין בעיני.\n\nהשורה התחתונה: לא מאוד מומלץ כמו שנראה, קצת חתול בשק, אמנם כתוב ממוצע 95 אבל נכון לסמסטר הנוכחי הממוצע הוא יותר לכיוון ה80 - שזה לא רע אבל לקורס בחירה אבל זה גם לא טוב בקיצור לא מאוד מומלץ", "timestamp": 1693343756322}, {"author": "עלייתו של לוחם הצדק", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יבגני \nחוות דעת - הרצאות: \nהרצאות משעממות של איש שאינו ממש נחמד.\n\nשם המתרגל/ת: עומר+רפאל.\nחוות דעת - תרגולים: \nעוד אנשים שאינם ממש נחמדים לאוסף.\n\nשעורי הבית: \nהיו אמורים להיות חמישה השנה שניים בוטלו והיו שלושה. שיעורים מתישים וארוכים עם הנחיות לא ברורות. לא מפתיע בהתחשב בחוסר הנחמדות הפושע של צוות הקורס.\n\nהמבחן: \nאין מבחן יש פרויקט. לא משנה מה תעשו, תקבלו ציון לא טוב. הצוות יוריד לכם נקודות בלי להסביר. לערער יהיה כמו לנסות לדבר עם קיר. ביזיון רציני.\n\nהשורה התחתונה: להתרחק כמו מאש!!!!! \nאנשים ממש ממש לא נחמדים, כל אחד ואחד מצוות הקורס. נראים אכפתיים והכל אבל זה הצגה טובה ותו לא.\nקורס ביזיוני שלא אמור לקרות באוניברסיטה מתוקנת. הצוות נהנה להוריד נקודות ללא סיבה בפרויקט ובשיעורי הבית. הם יגידו משהו אחד בשיעור ויבדקו לפי משהו אחר. צוות שאין מילה לתאר אותו חוץ מלא כל כך אמינים.  \nעדיף לקחת כל קורס אחר.\n\n*ביקורת זאת צונזרה ע\"י כוחות הרשע.", "timestamp": 1711364274313}]}