{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: בתיה מקסימה אך ההרצאות די מבולגנות ולא ברורות. בהרבה מהמקרים הורגש שהיא יוצאת מנקודת הנחה שלכולנו יש ידע מוקדם מסוים, כשבפועל רק לחלק יש, ולכן קשה לעקוב אחרי החומר ולהבין מה עומד מאחורי הדברים שהיא מראה. היא מאוד נכונה לעזור בשעות קבלה.\n\nשם המתרגל/ת: אין תרגולים\nחוות דעת - תרגולים: אין תרגולים\n\nשעורי הבית: שיעורי בית קשים, לוקח הרבה זמן רק להבין מה היא רוצה שנעשה בהם, וההוכחות לפעמים לא טריויאליות. היו אמורים להיות 5 תרגילי בית ובפועל היא הספיקה לפרסם רק 4, אחד מהם עם חלק תכנותי (קליל). הציונים לתרגילי הבית ניתנים על ידי סטודנטים מהקורס (בונוס של 3 נקודות לציון הסופי למי שבודק) ולכן יחסית גבוהים. הציון הסופי של הקורס מתבסס רק על תרגילי הבית.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: חומר הקורס רלוונטי אבל הקורס עצמו קשה ומתסכל, ועם זאת הסתיים עם ציונים גבוהים.", "timestamp": 1628351582771}, {"author": "שליחי הדודה", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: בתיה מרצה נהדרת. מגיעה מוכנה לשיעור, המצגות שלה מאוד מסודרות ומאורגנות והיא נכונה לעזור ועונה לכל שאלה. היו חלקים קשים בהרצאות כך שהיה צורך בשעות קבלה.\n\nשעורי הבית: שב קשים יחסית וארוכים לרוב. מאוד עוזרים להבנת החומר וללמידתו. השב בונים את הידע שלוקחים מהקורס.\nציון הקורס מבוסס על השב.\nהשורה התחתונה: קורס מצויין, מרצה מעולה ולומדים בקורס הזה המון חומר שרלוונטי להמון תחומים. מומלץ מאוד.", "timestamp": 1630885424687}, {"author": "-----", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: \nהרצאות קשות ועמוסות אבל מדברות על חומר שיכול להיות שימושי.\nבתיה רצה על החומר ומניחה יודע קודם שאין להרבה אנשים בקורס. מפרסמת בסילבוס על אילו פרקים בספר היא בונה את ההרצאה ולעבור על הספרים לפני השיעור יעזור מאוד להבין את החומר של השיעור.\n\nשם המתרגל/ת: אין\n\n\nשעורי הבית: 4 מטלות לאורך הסמסטר, לא פשוטות בכלל אבל פתירות. יש מטלה אחת רטובה שהיא יחסית קלילה.\n\nהמבחן: אין, ציון 100% שיעורי בית\n\nהשורה התחתונה: קורס לא קל אבל אפשרי מאוד להשיג בו ציון טוב", "timestamp": 1658329447608}, {"author": "רוני", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: בתיה קניג\nחוות דעת - הרצאות: אחלה הרצאות. בתיה מרצה מעניינת ונחמדה. ממליץ. בודקי תרגילים היו מתחשבים וגם בתיה עם מועדי ההגשה.\n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: איו \n\nשעורי הבית: לא קשים מידי, די מעניינים ומייצגים את החומר בצורה מעולה. לפעמים יש קוד, אבל לא קיצוני והרוב תיאורטי.\n\nהמבחן: \nאין\nהשורה התחתונה: ממליץ לקחת", "timestamp": 1716805868007}]}