{"posts": [{"author": "שליחי הדודה", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מרינה בוגומולוב\nחוות דעת - הרצאות: מרינה מקסימה! עוזרת ועונה לכל שאלה. מרינה מגיעה מוכנה לשיעורים ומעבירה את ההרצאות מצויין. חומר רלוונטי לרפואה. הרצאות מעניינות מאוד. יש רמה מתמטית גבוהה בחלק מהן. מרינה נהדרת.\n\nשעורי הבית: שב מאוד ארוכים אבל לא מאוד קשים. מרינה עוזרת מאוד.\n\nהמבחן: מבחן הוגן ולא קשה במיוחד.\n\nהשורה התחתונה: מרינה מרצה מדהימה. קורס מומלץ לחובבי הסטטיסטיקה ובפרט לחובבי הסטטיסטיקה ברפואה.", "timestamp": 1630885789908}, {"author": "סטטיסטיקאי בלב", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מרינה בוגומולוב\nחוות דעת - הרצאות: הרצאות מבולגנות ולא מובנות בכלל המצגות לא רלוונטיות ולא אינפורמטיביות\nאי אפשר להבין ממנה כלום היא לא מבינה את השאלות ולא מסבירה מובן בכלל\n\nשעורי הבית: ארוכים לא ברורים ולא מובנים\n\nהמבחן: ארוך באורך לא נורמלי והוא גם לא מובן\n\nהשורה התחתונה: מרצה לא טובה במיוחד לא מבינים כלום בקורס\nלהתרחק כמו מאש", "timestamp": 1657523670005}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מרינה בוגלומוב\nחוות דעת - הרצאות: מתישות, מצגות לא מספיק אינפורמטיביות, מבולגן מאוד במהלך ההרצאה וגם בכתיבה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים בטירוף, לא מובנים לפחות בחצי מהם.\n\nהמבחן: דומה לשנים קודמות, ארוך מאוד, נבדק יחסית עדין אבל לא כיף בכלל\n\nהשורה התחתונה: עדיף שלא", "timestamp": 1659539986946}, {"author": "רועי אברהם", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה:  מרינה\nחוות דעת - הרצאות:\nמרינה מסבירה מעולה ואכפת לה שכולם יבינו, יש קו מחשבה כללי בקורס לגבי טיפול בהשוואות מרובות שחוזר בנושאים שונים.  ממליץ להגיע להרצאות - מרינה שחררה כמה הקלטות כדי שנוכל להשלים ולדעתי קצת קשה ללמוד דרכם.\n\n-אין תרגולים \n\nשעורי הבית: \nארוכים אבל פתירים בסופו של דבר\n\nהמבחן: ארוך אבל לא קשה- הקורס לא עמוס בחומר אבל כן צריך להקדיש זמן כדי ללמוד למבחן.\n\nהשורה התחתונה: \nיש אווירה טובה ואפשר ליישם את הכלים שלמדנו במחקר או בעבודה- סה\"כ נהניתי. אחרי הקורס יואב אמר שהוא מרגיש אשף לסטטיסטיקה היותר בסיסית שזה גם פלוס", "timestamp": 1689769557676}]}