{"posts": [{"author": "לא הקורס להבין איך עושים כסף", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דורון בלט\nחוות דעת - הרצאות: \nמבולגן. \nמדבר לתוך הטאבלט שלו. \nמקריא בתוך הספר משפטים נבחרים, מה שגורם להכל להשמע מבולגן ולא ברור.\nבאיזשהו שלב פשוט מאבדים אותו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהיו רק 5 תרגולים לא מועילים במיוחד\n\nשעורי הבית: \nשיעורי בית לא קשים אם מבינים על מה מדובר\nהמבחן: \nפרויקט סיום במקום מבחן לא ברור בכלל בהתחשב באיך שהקורס הועבר (לא ברור גם לחזקים יותר)\nהשורה התחתונה: \nלא מומלץ", "timestamp": 1659965913271}, {"author": "מציל סטודנטים", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דורון\nחוות דעת - הרצאות:  מבולגנות מאוד, ראיתי רק שלוש הרצאות ראשונות במלואן, בכל השאר לא שרדתי יותר מרבע שעה.\nתמיד אומר שיעלה את הדברים שכתב בזמן השיעור, בפועל לא העלה אף פעם חוץ מההרצאה הראשונה.\n\nשם המתרגל/ת: בר עיני\\תומר וולק.\nחוות דעת - תרגולים: כמעט כולם לא היו רלוונטים ונגמרו לאחר 5\\6 תרגולים.\n\nשעורי הבית: \nחצי מהשיעורים הם תאורטיים וחצי הם לכתוב קוד. השאלות קוד יחסית פשוטות מאוד ולגב השאלות התיאורטיות- רק אגיד שזה לא בעייתי למצוא את התשובות שלהן.\nהמבחן: אין, במקום יש הצגת מאמר ופרוייקט. הצגת המאמר היא קצת כאב ראש, יכולים לשאול שאלות תיאורטיות על ההצגה וכו אז צריך להיות חדים על זה, (לרקורד- עברו חודשיים בערך מאז שהצגנו מאמרים ועדיין לא קיבלנו ציונים). הפרוייקט גם קצת מציק אבל סביל.\n\nהשורה התחתונה: אם ממש אין לכם קורס אחר לקחת ואתם צריכים נקז שיהיו רגועים במהלך הסמסטר אבל לשבת הרבה אחרי התקופת מבחנים אז זה הקורס בשבילכם, אחרת אין לכם מה לחפש פה.", "timestamp": 1661073231749}, {"author": "שארפ", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דורון\nחוות דעת - הרצאות: \nקשה לעקוב אחריו, החומר דווקא יכול להיות מעניין אבל קל מדי לאבד אותו, הרצאות מתמטיות\n\nשם המתרגל/ת: תומר וולק / בר עיני\nחוות דעת - תרגולים: \nהיו רק 5 תרגולים בערך וגם הם התחלקו בין שניהם. תרגולים לא תורמים המון. בר יודעת לקרוא מהמצגת יפה מאוד, מעבר לזה נראה שאין קשר בינה לבין חומר הקורס.\nתומר יותר מבין עניין והיה נראה שהוא היה אחראי על התרגילים הרטובים אז היה צורך להתייעץ איתו לגבי בעיות והבנה של התרגילים\nשעורי הבית: \nסבירים, חלק תאורטי יבש וחלק רטוב. 5 תרגילים לא ארוכים מדי בתחילת הסמסטר\n\n פרויקט והצגת מאמר - \nמאמר- תלוי איזה מאמר בחרתם, יכול להיות קליל ויכול להיות עמוס \nפרויקט סביר, אבל עם חלק תחרותי לפי ביצועי המודל שלכם על השוק לאורך חודש\nהשורה התחתונה: סהכ בסדר, עמוס בעיקר בתחילת סמסטר ובקיץ בעבודה על הפרויקט", "timestamp": 1667243855449}]}