{"posts": [{"author": "hamin", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: מעניינות\n\nשם המתרגל/ת: יעל טרוויס-לומר\nחוות דעת - תרגולים: מתרגלת מעולה. מקצועית, מגיעה מוכנה לשיעורים. תמיד עונה על שאלות ואפילו מביאה תשובות לשאלות שנשאלו שבוע לפני. הלוואי שכל המתרגלים היו כמוה\n\nשעורי הבית: כל שבוע יש גליון המכיל 2-3 שאלות קצרות לרוב. מתוך 11 גליונות היה מספיק להגיש 8. רובם קלים\n\nהמבחן: הוגן\n\nהשורה התחתונה: מדובר בקורס סבבה פלוס עם עומס מועט במהלך הסמסטר", "timestamp": 1656842307550}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: קצת מבולגן ולפעמים קצת לא ברור אבל סך הכל מרצה טוב\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: מתרגלת מצוינת, תמיד מגיעה מוכנה ועונה לכל שאלה\n\nשעורי הבית: הגשות שבועיות, 3-4 שאלות בגיליון, שילוב של תרגילים יבשים ורטובים בפייתון. ההגשות הרטובות לא קשות בכלל, 99% מהן זה להעתיק את הקטע קוד הרלוונטי מהמחברת שהייתה בתרגול. רק התרגילים היבשים רלוונטיים למבחן והם ברמה הוגנת, לפעמים הפתרון הוא פשוט להשתמש באותו טריק שהיה בתרגול הרלוונטי או להציב בנוסחאות המתאימות\n\nהמבחן: הוגן לחלוטין, דומה מאוד למבחני עבר. בנוסף יש חומר פתוח \n\nהשורה התחתונה: אחלה קורס למי שרוצה להעלות ממוצע, פחות מומלץ למי שממש רוצה ללמוד לעבוד עם סדרות עתיות, כי הקורס שם יותר דגש על התיאוריה הסטטיסטית ופחות על הפרקטיקה.", "timestamp": 1656950580158}, {"author": "Null", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יאיר \nחוות דעת - הרצאות: \nיאיר נחמד, אבל ההרצאות לא משהו. לא ברור למה הוא מתעקש לכתוב על הלוח במקום להשתמש במצגת, הסימונים והכתב שלו לא עיקבים ולכן קשה לפעמים להבין למה הוא רצה להתכוון.  \n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: \nיעל מתרגלת מעולה, מסודרת וברורה. תמיד עושה סדר אחרי הבלאגן שיאיר משאיר מההרצאה.\nשעורי הבית: \nקלים, חלק יבש שלרוב הוא למסובך בכלל וחלק רטוב שהוא פשוט להעתיק את התרגול\n\nהמבחן: \nמבחן הוגן לחלוטין, לא קשה, רק צריך לדעת להציב למשוואות.\n\nהשורה התחתונה: \nקורס בשביל לצבור עוד נק\"ז, בחרתי אותו בגלל שהוא היה נשמע לי מעניין אבל בפועל הוא התגלה כקורס לא פרקטי ולא רלוונטי. היתרון בקורס שהוא לא דרש הרבה", "timestamp": 1657184368586}, {"author": "שליח הדודה", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: ההרצאות מעניינות ובעלות אופי מתמטי וסטטיסטי מובהק. יאיר כותב על הלוח וזה מצוין כי כך ניתן לעקוב אחרי כל מעבר ואחרי כל טריק שהוא משתמש בו. יאיר מרצה מצוין, מובן מאוד, מסביר נהדר ועונה לכל השאלות בהרחבה. בנוסף, יאיר גם בחור חביב מאוד ונחמד מאוד מעבר לכך שהוא מקצוען ברמה הגבוהה ביותר. \n\nשם המתרגל/ת: יעל טרוויס לומר\nחוות דעת - תרגולים: התרגולים בנויים בצורה של מענה על שאלות בנושא החומר שהועבר בהרצאה. בדרך כלל השאלות יחסית פשוטות אבל חשוב לראות את דרך הפתרון של יעל. יאמר לזכותה של יעל שהיא מעבירה את התרגולים בקצב גבוה מאוד ומספיקים הרבה שאלות. יעל מקסימה, נחמדה מאוד, עונה לכל שאלה ועוזרת מאוד לסטודנטים. בכל שבוע בו היו שאלות שנשאלו בשבוע שעבר היא הביאה דוגמאות וענתה עליהן בהרחבה ובפירוט רב. יעל גם עזרה מאוד בשעות הקבלה והשקיעה רבות מזמנה על מנת לעזור לסטודנטים.\n\nשעורי הבית: שיעורי הבית יחסית קלים, פשוטים ולא ארוכים. החלקים התיאורטיים היו דומים מאוד לשאלות שנראו בתרגול והחלקים הרטובים היו מביכים לרמה של כל סטודנט. התרגילים נבדקו בצורה הוגנת והוחזרו עם משוב ראוי ומקצועי שעזר מאוד לקראת הלמידה למבחן.\n\nהמבחן: המבחן היה קל מאוד, השאלות חוזרות על עצמן משיעורי הבית, מהתרגולים ומבחינות העבר.\n\nהשורה התחתונה: הקורס הזה מאוד חביב, החומר התיאורטי המועבר בו מעניין מאוד וסגל הקורס מקצועי ומתחשב. בנוסף, הציונים גבוהים יחסית ואפשר להשיג ציון גבוה בקלות וללא השקעה גדולה. \nעם זאת, לקורס יש חיסרון גדול שהוא לא מהווה קורס הכנה לשימוש בנושאים הנלמדים בעולם האמיתי. החלק הפרקטי בקורס ברמה מאוד נמוכה ואין שימוש רציני בקוד או בשיטות הנלמדות בקורס על נתונים חדשים.", "timestamp": 1657495112747}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: בתחילת הקורס עוד היה אפשר לעקוב אחרי ההרצאות, עם הזמן זה הלך והדרדר והיה מאוד קשה להבין מה קורה שם.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: לא היו\n\nשעורי הבית: היו 10 גיליונות להגשה כל שבוע, בגלל שלא היו תרגולים הכל התבסס על ההרצאות (הדוגמאות לתרגילים חישוביים בהרצאות היו מאוד בסיסיות ולא עזרו). למזלנו היו רפרנסים \n\nהמבחן: לא היה מבחן, היה פרויקט תכנותי שכולל דברים שלמדנו\n\nהשורה התחתונה: במהלך הסמסטר היה קצת מעיק עם כל ההגשות, לא מורגש שלמדנו באמת משהו רלוונטי. לגמרי אפשר לשפר את התכנים ואיך שהם עוברים בקורס כי בסוף זה נושא ממש חשוב. אבל זה קורס של 2.5 נקז עם ציונים גבוהים", "timestamp": 1716899815356}, {"author": "גולד סטודנט שיודע", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: הרצאות ממש טובות שנותנות רקע כללי וידע מסביב, לא נכנס לעומק. מרצה מסביר מצוין\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: אז לא היו תרגולים אבל הוא עזר ממש בשעות קבלה בסמסטר ובזמן העבודה על הפרויקט. עונה על הכל ממש טוב ומפורט ומחווין טוב בעבודה\n\nשעורי הבית: כל שבוע תרגיל שהיה קצת טכני ועזר יותר להבין את ההרצאה. היה טוב אם היה תרגול שעושה משהו דומה לפני התרגיל\n\nהמבחן: אז היה פרויקט סיום די עמוס אבל חופשי מבחינת העבודה ככה שהיה ממש טוב לעבוד עליו תרם הרבה ציונים גבוהים\n\nהשורה התחתונה: קורס ממש נחמד מעניין ציון גבוה וצוות טוב ומתחשב", "timestamp": 1718571668950}]}