{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "חוות דעת - הרצאות:  \nבגדול הן בסדר אבל באיזשהי מידה אני מרגיש שנושאים טריוויאליים יחסית מועברים באופן דיי מפורט ונושאים מסובכים יותר מועברים באופן שאינו מספיק אינטואיטיבי.\n\nשיעורי הבית: \nמזעזעים ודורשים רמה הרבה יותר גבוהה ממה שנלמד. רצוי להתחיל מוקדם כי מדובר בקודים לא פשוטים. ממליץ להשקיע בתכנון טוב מראש (מונע בעיות אחר כך), ולעבוד בזהירות. טעויות יכולות להיות קשות לזיהוי ולגרום לתיסכול רב.", "timestamp": 1613180791380}, {"author": "סטודנט ממורמר", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ארז כרפס\nחוות דעת - הרצאות: \nמרצה קצת משעמם, הסביר סבבה מינוס. לקראת האמצע מתחילים נושאים קשים.\nשם המתרגל/ת: אלכסנדר טואיסוב ורונן ניר.\nרונן מתרגל טוב אבל אלכס האחראי והרוב הולכים אליו משום מה. אלכס דיי זורק כל הסמסטר\nחוות דעת - תרגולים: \nתרגולים דיי מובנים שעוזרים להבנה, פחות חשובים לקורס מההרצאות.\nשעורי הבית: \nקשים, ארוכים ומעצבנים (הראשון היה דיי קל)\nממליץ להיצמד למה שיש בהרצאות מבחינת הפריימ בת\"ב 2 ו 3 ולעקוב אחרי פורום השאלות (כן זה קריטי לציון שלכם)\nכרגע אין ציון ממשי ולא ידוע מתי יהיה כי כמו שאמרתי, המתרגל זורק\nהמבחן: \nהיה בוחן אמצע ומבחן בית תכנותי. \nבוחן האמצע היה כמו מבחני עבר, חומר תיאורטי דיי מציק אבל הוא מחזר הכל ואמר חומר אינטרנטי פתוח אז מפה לשם ממוצע 90. בדר\"כ יותר קשה אז ממליץ ללמוד טוב את החומר של ההרצאות אם אין מבחן בית תכנותי כמו לנו (סמסטר קורונה).\nמבחן הבית היה דיי קשה, אנשים לא ממש עשו אותו לבד ופה ושם היו התייעצויות. לא היה קל זה בטוח. לא להאמין לכל מילה שיוצאת לארז מהפה. 44 אנשים מתוך 160-170 קיבלו 100 והשאר 0-75\nהשורה התחתונה: \nקורס עם ת\"ב דיי קשים (2 ו 3 כמו שאמרתי) עם תחרותיים. היה יכול להיות יותר מעניין אם ת\"ב היו פחות קשים/אם מבינים איך לגשת מהר ולא מבזבזים זמן. יכול לתת מוטיבציה לנושאים חשובים (MDP, RL וכו')\nתבואו עם שותפ/ה טוב/ה לקורס\n\nאל תצפו שיהיה קל", "timestamp": 1613940419028}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ארז כרפס\nחוות דעת - הרצאות: ההרצאות היו בסדר גמור, הרגיש שהיו נושאים שהוא קצת חיפף אבל בגדול מסביר מה שצריך.\n\nשם המתרגל/ת: אלכס טואיסוב\nחוות דעת - תרגולים: די ברורים, ויחסית מחוברים ומסונכרנים עם ההרצאות\n\nשעורי הבית: 3 ת.ב. קשים מאוד, לא ניתן ציון על שום תרגיל בית חודש אחרי סוף סמסטר\n\nהמבחן: היה כבודת בית של 24 שעות, היה קשה ומלחיץ \n\nהשורה התחתונה: החומר עצמו די מעניין ומועבר בסדר אבל הזריקה של הצוות מאוד מעצבנת", "timestamp": 1614954507505}, {"author": "no", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ארז כרפס\nחוות דעת - הרצאות: הרצאות מעניינות, המרצה עונה לשאלות.\n\nשם המתרגל/ת: רונן ניר\nחוות דעת - תרגולים: מתרגל נחמד, עונה לשאלות.\n\nשעורי הבית: 3 תרגילים תכנותיים די קשים, הבעיה העיקרית הייתה שהם התבססו אחד על קודמו ולא החזירו ציונים גם חודש אחרי המבחן על אף אחד מהם.\n\nהמבחן: הסמסטר היה מבחן בית של 24 שעות של תכנות. מבחן די קשה אבל מי שיודע לתכנת זה לא בעיה בשבילו\n\nהשורה התחתונה: קורס מעניין ונושאים חשובים. מי שאוהב לתכנת זה מתאים לו", "timestamp": 1615193961054}, {"author": "נועה", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ארז כרפס\nחוות דעת - הרצאות: הרצאות לקוחות ממצגות משנים קודמות, די מונוטוני. היחס של המרצה לסטודנטים אטום ומזלזל, התנהלות לא מסודרת של כל הסגל. חבל, חומר הקורס מעניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 3 תרגילים תכנותיים בפייטון בנושאי הקורס,הגשה בזוגות, רמת קושי בינונית גבוהה, לא התקבלו ציונים על התרגילים במהלך הסימסטר ובתקופת המבחנים!\n\nהמבחן:מתכונת שונה בעקבות סימסטר קורונה, בוחן אמצע מגן של כ30%, מבחן בית תכנותי של 24 שעות שייזכר לדורות לכל מי שעשה. לא היה מועד ב'. \n\nהשורה התחתונה: הקורס עצמו מעניין, לא לצפות להתחשבות הסגל.", "timestamp": 1616322757286}, {"author": "Antwan Shahtoot", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ארז כרפס\nחוות דעת - הרצאות: ההרצאות בסדר, מדבר מהר אך ברור\n\nשם המתרגל/ת: רונן ניר\nחוות דעת - תרגולים: ברור ונותן תשובות על השאלות בצורה ברורה\n\nשעורי הבית: צריכים השקעת זמן, אבל יש אפשרות שלא תקבלו ציונים באותו סמסטר\n\nהמבחן: קורונה הפך את זה לאיום (a crime against humanity)\n24 שעות עם מבחן של כתיבת קוד ברמה גבוהה.\n\nהשורה התחתונה: קשה, אפשר לקבל ציונים. המרצה לא יודע להתנהל במצב סגר.", "timestamp": 1616325700755}, {"author": "סטודנט מייצג", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "הסגל הכי גרוע בעולם, זילזול מוחלט בסטודנטים, הבטחות ללא כיסוי והתנהלות ביזיונית.\n\nאלכס וארז, אתם לא ראויים לשקל אחד של שכר מהטכניון. בושה.", "timestamp": 1616341196132}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס \nחוות דעת - הרצאות: ההרצאות שלו יותר מדי מתמקדות בהוכחות ולא בחומר עצמו שיהיה במבחן, מיותר\n\nשם המתרגל/ת: אלכס/רונן\nחוות דעת - תרגולים: שעה של תרגול שלא מספיקה ממש לכלום, סתם עוברים על החומר ולא באמת מתרגלים אותו ואז מגיעים למבחן ולא יודעים לפתור אשכרה תרגילים על החומר\n\nשעורי הבית: 3 תרגילים תכנותיים ש2 מהם בכלל לא קשורים לחומר הנלמד, סתם להתעסק בבאגים של סינטקס ולשבור את הראש עליה. אין תרגילי בית תיאורטיים שזה מה שיש במבחן אז בעצם כל הסמסטר לא מתרגלים איך לפתור את החומר \n\nהמבחן: אותו דבר כמו שנים קודמות - אין פתרונות מלאים או רשמיים אז צריך ללמוד לבד איך פותרים תרגילים שבחיים לא נתקלנו בהם \n\nהשורה התחתונה: קורס זוועה שלא מועבר טוב בכלל", "timestamp": 1644469030748}, {"author": "מישהו אחר", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלכס שלייפמן\nחוות דעת - הרצאות: \nסה\"כ אלכס נראה מרצה סבבה סה\"כ אבל כבר אחרי 2 שיעורים אצלו רוב הקורס עבר להרצאות המוקלטות של ארז בגלל שאלכס לא הצליח לשמור על קצב שיעור שמתאים לרמה של כל הכיתה אלא בחר להתעכב על נושאים יחסית פשוטים.\n\n\nשם המתרגל/ת: אלכס טויסוב\nחוות דעת - תרגולים: \nמתרגל נהדר, אין מה להגיד פשוט תבואו לתרגולים שלו והחומר ישב טוב.\n\nשעורי הבית: \n3 תרגילי בית תכנותיים, לא הכי קשורים לחומר של הקורס ולא מלמדים אותו בצורה כלשהי, אלא בעיקר דורשים ממך לנחש פתרון טוב ולקוות לטוב ביותר.\nכל תרגיל בית הוא 80% האם הקוד עובד ו20% כמה טוב הוא עובד ביחס לכיתה.\nכל תרגיל הוא משאבת זמן ואם יש לך את הזמן והכוח להשקיע אז יכול להיות שתצליח להגיע לתוצאות טובות אבל בזמן סמסטר עמוס זה לפעמים לא שווה את המאמץ.\n\nהמבחן: \nכמו שנים קודמות, קשה ולא הכי מובן, אבל אם מספיק תרגול אפשרי להוציא ציון סבבה.\n\nהשורה התחתונה: \nקורס מעניין וחשוב, אבל דיי עמוס וקשה להבנה", "timestamp": 1644951802415}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלכס שלייפמן\nחוות דעת - הרצאות: \nרגיל, כמו בשאר הקורסים\nשם המתרגל/ת: רונן/אלכס\nחוות דעת - תרגולים: \nראיתי הקלטות של שניהם.\nהתרגול הוא שעה, חלק מהתרגולים נותנים רקע למבחן חלק לא בגלל שלא כיסו מספיק. בכל זאת לא הייתי מוותר על לראות אותם\nשעורי הבית: 30% מהציון הסופי, 3 תרגילים בית. יחסית דורשים עבודה והשקעה. הש.ב קשורים בצורה כלשהי לחומר אבל לא חייב לדעת את מה שהועבר בתרגולים והרצאות כדי לפתור אותם.\n\n\nהמבחן: \nדורש למידה טובה ממבחני עבר והבנה של החומר\nהשורה התחתונה: \nהקורס מחולק לכמה נושאים מרכזיים בערך 4 ממליץ ממש שברגע שמסיימים חלק להתסכל על מבחני עבר ולנסות ללמוד מהם כבר במהלך הסמסטר זה יחסוך הרבה מסוף הסמסטר", "timestamp": 1645120505060}, {"author": "student", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה:אלכס \nחוות דעת - הרצאות: על הפנים .. היו הרבה דברים לא מובנים והוא לא הבין את השאלות ששאלו בכיתה .יש הרצאות מוקלטות של ארז לדעתי הכי טוב לשלב בין ההרצאות המוקלטות להרצאות של אלכס ולוודא שמבינים הכל\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: יש הכל מוקלט והתרגולים דיי עוזרים בהבנת החומר , מומלץ לראות אחרי שעוברים על ההרצאה \n\nשעורי הבית: לא פשוטים בכלל , היו שלוש שיעורי בית - שיעורי בית 1 היו קשים ולקחו יותר משבוע - המלצה שלי לא למרוח את זה .. אם הקוד רץ מקבלים את כל ה70 נקודות ולרוב גם אם התוצאות לא מרהיבות כן מקבלים מעל 80 (עם התחרותי) אז לא לשבור את הראש כי אפשר לבזבז על זה גם חודשים שלמים(הרעיון הוא לשפר את האלגוריתם כל פעם גם בזמני ריצה וגם בכמות הפעולות שהאלגוריתם מפעיל כדי לפתור את הבעיה וכל שינוי קטן בקוד יכול להוביל לתוצאות שונות לגמרי אז לגמרי אפשר להיסחף עם זה )\nשיעורי בית 2 ו3 קצת פחות קשים והם מסתמכים על שיעורי בית 1\n\nהמבחן: בשביל לקבל ציון טוב במבחן היה צריך לדעת את כל החומר וזה דרש מעבר על כל התרגולים וההרצאות  , \nהרבה שאלות בדקו הבנה של האלגוריתמים שנלמדו אז שווה לעבור על כולם ולנסות לשנות כל פעם שורה באלגוריתם ולראות איך זה משפיע \n\nהשורה התחתונה: בקיצור - צריך לוודא שמבינים הכללל ולהיכנס גם לדקויות", "timestamp": 1647947095946}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: הקלטות של ארז\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: \nהכרחיים ברובם, פותרים שאלות בחלק מהקורס, מבינים מה שלא מבינים בהרצאות\nשעורי הבית: \nתכנותיים לא קלים, אבל הציונים טובים למרות החלק התחרותי\nהמבחן: \nבדיקה מקלה למדי, אבל לא קל\nהשורה התחתונה:", "timestamp": 1653397451716}, {"author": "Csp", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: \nלא סגור על ההרצאות , כל המצגות של ארז כרפס .\nהוסיף בשבוע 10 חומר שלא היה שהמתרגלים לא ידעו על מה מדובר . \nשם המתרגל/ת: אלכס טואיסוב\nחוות דעת - תרגולים: \nמאוד מנסה לפשט את החומר בcsp לא ידע על מה מדובר חוסר סנכרון\nשעורי הבית: \nקשים ברמות חייבים אותם כדי לסיים יפה את הקורס\nגיליון שבועי במודל שהוא אומר שעליו מתבסס המבחן וזה אפילו לא קרוב והשאלות מלאות בטעויות\nהמבחן: \nקשה תיבות המוות \n\nהשורה התחתונה:", "timestamp": 1677433701916}, {"author": "ביקורת כמעט קריטית", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ארז (הקלטות)\nחוות דעת - הרצאות: ההקלטות של ארז טובות מאוד, אבל הסמסטר רשף הכניס חומר חדש על CSP שלא מכוסה בהן. יש ספר קורס נחמד מאוד שהמצגות מבוססות עליו, ממליץ להסתכל עליו אם משהו לא ברור עד הסוף.\n\nשם המתרגל/ת: אלכס (הקלטות)\nחוות דעת - תרגולים: בתרגולים בעיקר מחדדים את החומר של ההרצאה עם דוגמאות, אין כמעט פתרון של שאלות וחבל. \n\nשעורי הבית: שלושה תרגילים תכנותיים, כל אחד מהם היה אמור להוות 15% ציון תקף, אבל בסוף החליטו להפוך את השלישי לסוג של מגן אחרי שהצוות התעכב עם השחרור שלו עד לשבועיים האחרונים של הסמסטר.\nכל אחד מהתרגילים האלו הוא פרויקט של מאות שורות קוד, מאוד קשה ושורף המון המון זמן, תמצאו שותף טוב ואל תחכו לרגע האחרון. ציונים הוחזרו רק אחרי כמה חודשים, וגם אז בלי שום משוב. אולי בגלל שבודק התרגילים החליט באמצע הסמסטר להפוך למתרגל.\n\nהמבחן: רשף לקח את הקונספט של המבחנים שלו במסחר אלקטרוני והביא אותו לקורס הזה. מבחן ארוך בצורה לא הגיונית, קשה (36 נק' הוקדשו לנושא החדש!). בנוסף היה צריך לרשום את התשובות בתיבות קטנטנות, מי שיש לו כתב יד גדול אכל אותה. \n\nהשורה התחתונה: קורס שציפיתי אליו כל התואר, אבל אזכור אותו לרעה בגלל המבחן ושיעורי הבית האכזריים. וגם בגלל שהוא הרגיש רוב הזמן כמו מתמטיקה דיסקרטית על סטרואידים.", "timestamp": 1678142689160}, {"author": "R.A", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "אמ;לק-כל עוד הקורס רץ עם הסגל הנוכחי, להתרחק כמו מאש. הבריאות הנפשית שלכם לא שווה את זה\n\nשם המרצה: רשף מאיר\nחוות דעת - הרצאות: \nכל פעם אני נפעם מחדש איך יכול להיות שמבין שורות החוקרים בעלות השם העולמי שיש למוסד הזה להציע, תמיד יוצא שאת הקורסים הכי מעניינים מעבירים חדלי אישים כמו רשף. לאורך כל הסמסטר הגעה להרצאות שלו הרגישה כמו גזרת שמיים או עונש על קארמה רעה, אחרת אין הסבר למה שהלך בהרצאות שלו. חצי מהזמן הלך על שאלוני קאהוט ממוחזרים (כולל הטעויות שלהם יש לציין), והחצי השני הלך על כל מיני גיבובי מילים שרשף הוציא. הבנאדם הצליח להפוך את אחד הנושאים הכי חמים של המאה ה21 לשיעמום וסבל טהור לנוכחים בהרצאות שלו. באיזשהו שלב עברתי (ולדעתי גם שאר המשתתפים בקורס) להקלטות משנים קודמות, ואני באמת חושב שמי שקיבל את ההחלטה להפסיק עם ההקלטות בקורסים לא ישב בהרצאה של רשף, ולא מבין כמה קריטי היה שהיו הקלטות עבר של ארז כרפס.\nברבע האחרון של הסמסטר רשף החליט לדחוף נושא שלם שלא נראה לפני כן בקורס (כולל המתרגלים שלא ידעו להסביר אותו, אבל עוד נגיע אליהם) שהיה תלוש לחלוטין מכל הנושא של בינה מלאכותית, והתעסק יותר בנושאים איזוטריים של מבני נתונים. אה וכמובן שיותר משליש מבחן היה על הנושא הזה.\nבנוסף, רשף מחזר לנו בחני חזרה במודל משנים קודמות, שעל פניו זה רעיון יפה שנועד לעזור בהכנה למבחן. אלא שהסתבר שברוב המוחלט של השאלות היו טעויות שאלמלא הפריצה למערכות המחשוב של הטכניון והצורך לעבור על כל הבחנים מחדש כדי לפרסם פתרונות אליהם, רשף אפילו לא היה שם לב לנושא והיה משאיר את הדברים ככה.\nאני יכול להמשיך ולפרט עוד על מסכת העינויים שרשף העביר אותנו הסמסטר ( כמו למשל לפרסם ציוני תרגיל בית 1 שבועיים *אחרי* מועד א'),אבל נראה לי הבנתם את הרעיון הכולל\nשם המתרגל/ת: רונן\\דביר\nחוות דעת - תרגולים: \nבחצי הראשון של הקורס רונן העביר את התרגולים. מתרגל יבש מאוד, אבל עשה את העבודה שלו בגדול.\nבאמצע הסמסטר רונן פשוט נעלם בלי שום הסבר, ואז דביר החליט (על דעת עצמו או שלא) להיכנס כמתרגל במקומו.\nלמען ההגינות, דביר בהחלט ניסה לעזור לנו בכל צורה אפשרית, בין עם זה שעות קבלה אקסטרה בהן הוא פותר שאלות ממבחנים, לענות לנו על שאלות בווצאפ ולערוך מחדש מצגות בנושאים מסוימים.\nאמנם באופן אישי פחות התחברתי לדרך ההוראה שלו, אבל מרגיש לי שמבין כל הסגל של הקורס, הוא היחיד שלפחות ניסה לבוא לקראת הסטודנטים וזה מוערך.\nהבעיה היחידה שהוא גם הבודק תרגילים, ונכון לכתיבת שורות אלו, עדיין לא קיבלנו את ציוני כל תרגילי הבית (מועד ב' עוד שבועיים ומדובר על 15 אחוז מהציון)\nשעורי הבית: \n3 תרגילי בית תכנותיים, כל אחד 15% מהציון. זה הדבר הכי נורא שעברתי בטכניון עד היום, וזה אפילו לא תחרות.\nתרגיל בית 1 עוד איכשהו היה פתיר, אבל תרגיל בית 2 נכתב כאילו בידי השטן עצמו. לקחו נושא שלם שהיינו צריכים ללמש בפייתוןבכמה מאות שורות קוד, רק כדי לקבל עליו 20 אחוז ציון. השאר היה תחרותי (כי ברור שזה יהיה) התרגיל עצמו לא היה ברור, ורוב הקושי היה בלתקן שגיאות סינטקס נוראיות. אני לא צוחק שאני אומר שהתרגיל בית הזה גרם לי להזדקן ב5 שנים לפחות. תעשו לעצמכם טובה, ותמצאו שותפ\\ה שמתמצא טוב בנושא הזה, כי אחרת כל הדבר הזה הופך לעינוי שלא ניתן לתאר.\nבסוף קיבלנו עוד שבועיים הארכה בערך עליו, וזה עדיין לא הספיק לחלק מהאנשים.\nבנוסף,כתוצאה מכך תרגיל בית 3 פורסם שבוע וחצי לפני סוף סמסטר, ואחרי הרבה שכנועים מהנציג סמסטר (ופה מגיע פרגון ענק לדניאל מריח שהיה לו את הסבלנות המדהימה להתעסק עם הסגל הבזיוני הזה), הוחלט שתרגיל 3 יהיה מגן, ורמתו תורד.\nהמבחן: \nהסמסטר לראשונה המבחן היה עם דף נוסחאות, ובגלל הפריצה לטכניון רשף החליט לתת לנו 3 דפי נוסחאות דו\"צ במקום 2. יכול להגיד לכם שגם עם היה לכם את גוגל וchatGPT ביחד במבחן,זה לא היה משנה.\nמבחן הזוי שלא ראיתי כמוהו עוד בטכניון, שבודק בעיקר תרגילי קומבינטוריקה ואת כל הנושא של csp שרשף לימד בסוף הקורס. מצטייני נשיא יצאו בוכים מהמבחן הזה, ובצדק. הרגיש שיכולתי ללמוד למבחן הזה שעה או שבוע, וזה לא היה משנה.\nכמו שכבר הבנתם, לוחות זמנים בשביל הסגל זה המלצה בלבד,וגם זה בקושי. ציוני מועד א' שוחררו כמעט שבועיים אחרי המבחן, בזמן שכבר התחילו להגיע ציוני מועד ב' בחלק מהקורסים. הפקטור היה הזוי לחלוטין, ברמה שגם אחרי אינפי 2 אני לא בטוח שאני יודע איך לחשב אותו לגמרי. אה והציון המקסימלי במבחן הועלה ל121,ועדיין מעל 30% נכשלים. פשוט כיף גדול\n\nהשורה התחתונה: \nבחיים שלי לא שמחתי כל כך לסיים עם קורס כמו עכשיו. ממליץ בחום ובלי טיפת ציניות- או שתעברו למדמ\"ח\\חשמל ללמוד את הקורס המקביל, או שתברחו מהטכניון כל עוד אתם יכולים למכללה\\אוניברסיטה אחרת, כי זאת החוויה הכי נוראית שחוויתי כסטודנט, ועדיף בריאות נפשית על יוקרה סתמית", "timestamp": 1678173349847}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: משעמם למות, על אף שרשף השתדל עם הקהותים והכל.\n\nשם המתרגל/ת: רונן (מוקלט)\nחוות דעת - תרגולים: סתם חוזרים על חומר ההרצאות, לא פותרים תרגילים אז בכלל לא עוזרים.\n\nשעורי הבית: 3 תרגילים, החרון פורסם באיחור ולכן היה רשות. תרגילים עמוסים, קשים נורא, עם ממוצע של כל התרגילים 71 (בזיון). ציונים לתרגילים קיבלנו רק בתקופת מבחנים ו1 מהם אחרי המבחן. לא ברור איך נותנים לתרגיל בית ציון של 50 אחרי שאשנשים השקיעו בו מלא זמן ומאמץ, בגלל שנפל בכמה מקרי קצה. \n\nהמבחן: לא סביר בשום הבנה, לא מובן בכלל איך בדקו אותו, לקח לרשף שבועיים לעשות את האקסל המוגזם שבודק את המבחן, הכל התנהל שם בצורה בזיונית. \n\nהשורה התחתונה: קורס בזיון מנוהל בצורה נוראית, לאף אחד מהסגל לא אכפת מהסטודנטים (חוץ מדביר), וגם החומר בכלל לא מעניין. לא לעשות אם לא חייבים אלא אם כן זה ממש ממש מעניין אותך ויש לך סיבולת להתנהלות בזיונית.", "timestamp": 1678696413486}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: מועברות בצורה מאוד לא ברורה. בשלב מסוים התחיל לשנות את סדר הלימוד ממה שהיה נהוג, מה שיצר המון בלגן וחוסר הבנה. בהרצאות האחרונות הוא הוסיף עוד חומר חדש, שלא היה ברור מה הקשר שלו בכלל, וגם הוא עבר בצורה מזעזעת (וגם המתרגלים בקושי יכלו להסביר אותו).\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מתרגל סבבה סה\"כ, כן מנסה להסביר, אבל לדעתי המבנה של התרגולים לא טוב ולא באמת מתרגל את החומר, ופשוט לא מתאים למה שמצופה במבחן בשום צורה.\n\nשעורי הבית: קשים, ארוכים, והציונים די נמוכים. יש 3 תרגילי בית תכנותיים. ההוראות הרבה פעמים לא מוגדרות היטב / סותרות, והרבה זמן מתבזבז על להבין את זה. בנוסף, לא ברור בכלל הצורה שהם נותנים ציונים. לקח להם למעלה מ-3 חודשים להחזיר ציון על תרגיל בית 1, ועד עכשיו (שבועיים לסמסטר אביב) עדיין לא קיבלנו תשובות על ערעורים בו.\n\nהמבחן: לא קשור למציאות, היו 2 שאלות על הנושא שרשף המציא (מתוך 6). לא ברור מה הוא רוצה, וגם לא ברור הפקטור שהוא נתן- פיקטר כל סעיף בנפרד כתלות בכמה ענית עליו משהו לא ברור.\n\nהשורה התחתונה: מאוד לא ממליצה לקחת (אלא אם זה חובה ואז באסה). מה שהכי מתסכל זה היחס של הסגל. אין מענה לבעיות, ונראה שהם מנסים לעשות כל מה שאפשר כדי להקשות כמה שיותר. לצערי לא למדתי הרבה בקורס הזה כי בעיקר היה צריך להתעסק עם דברים טכניים ושטויות של הסגל.", "timestamp": 1680439884708}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: על הפנים. אף אחד לא מבין מה רשף אומר, וגם כשמבינים מה הוא אומר לא מבינים מה הוא רוצה. המון זמן מתבזבז על שטויות לא רלוונטיות. אני די בטוח שבפועל כולם צפו באיזה הקלטות משנים שעברות.\n\nשם המתרגל/ת: לא יודע, לא הלכתי\nחוות דעת - תרגולים: רק קראתי אותם, מהפעמיים שהלכתי אליהם הבנתי שאין הבדל למעט בזבוז זמן כשאתה הולך לתרגול.\n\nשעורי הבית: ארוכים ומתישים. איכשהו יצאנו עם ציון ממש גבוה, אבל להבנתי הממוצעים היו פח.\n\nהמבחן: קטנוני, לא קשור לקורס, לא בודק על החומר, ועם שיטת ניקוד מוזרה שאף אחד לא הצליח לפענח. חשוב לציין שהעובדה שהוא בחר לפרסם את הציונים באקסל מסורבל עם מיליארד עמודות גרם לחוסר הבנה על מה ירד לך ציון, ובגלל שברוב הסריקות לא רשמו כלום לא היה אפשר להבין בכלל על מה לערער. ביזיוני לחלוטין.\n\nהשורה התחתונה: תקראו את חוות הדעת של R.A, הוא יודע על מה הוא מדבר.", "timestamp": 1681328533920}, {"author": "דווקא נהניתי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רשף\nחוות דעת - הרצאות: הרצאות בסדר. עשה הרבה קהוטים בנסיון שנשתתף ונהיה פעילים - חלקם היו טובים והצליחו וחלקם פחות.\n\nשם המתרגל/ת: דביר.\nחוות דעת - תרגולים: דביר תרגל בערך בחציו השני של הסמסטר. התרגולים היו טובים. הוא ערך הרבה מהמצגות, הביא חומרי עזר (כמה שהיה אפשר) שעזרו לתרגיל בית וענה על כל שאלה ששאלו בתרגולים. החומר הועבר בצורה טובה וברורה, והוא ניסה לשתף אותנו על ידי זה ששאל שאלות.\n\nבנוסף, דביר העביר לכל אורך הסמסטר שעות קבלה בהן הוא פתר שאלות ממבחנים. אמנם מבנה המבחן השתנה, אבל החזרה הזו לאורך הסמסטר מאוד עזרה לי להצליח במבחן ולהיות חד על החומר במהלך הסמסטר - דבר חשוב בקורסים שאין בהם תרגילי בית יבשים שבהם מתרגלים את החומר ופותרים שאלות. בכל שבוע הוא פתר שאלות בנושא אחר, ובנושאים הגדולים הוא התמקד גם שבועיים.\n\nשעורי הבית: לא פשוטים, והיו חלקים שדרשו לא מעט חשיבה על ליישם אותם. היו 3 תרגילים רטובים, כהשלישי היה מגן והשניים הראשונים היו תקפים. התרגילים דרשו ליישם את מה שראינו בהרצאות ובתרגולים.\n\nהמבחן: עמוס, אבל ברובו לא קשה. מועד א' היה יותר בעייתי כי היו דברים שנוסחו בצורה לא ברורה, אבל מועד ב' היה הרבה יותר קל.\nאמנם היו שאלות על הנושא החדש שרשף לימד (CSP) אבל למי שישב לפני זה בבית והבין לעומק את הנושאים האלו השאלות לא היו יותר מדי קשות.\nלפני מועד ב' התפרסם גם אלגוריתם שהיה בבחינה, במטרה לעזור לנו ושנוכל לראות אותו ולעשות איתו משחקים כבר כמה ימים לפני הבחינה.\n\nהשורה התחתונה: קורס מהנה עם חומר חשוב. אחד הקורסים היותר מהנים מבחינת החומר. נותן את הבסיס לבינה מלאכותית, אלגוריתמים ולמידה ששונה מחישובית 1 וגם מעמוקה.\nלכו לתרגולים, תבינו את החומר ותלכו לשעות הקבלה של דביר.", "timestamp": 1682850731520}, {"author": "MiseryDisgustPain", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "לקחתי את הקורס הזה שנה שעברה ויצאתי להפסקת סמסטר באמצע ולקחתי אותו שוב הסמסטר, שום דבר לא השתנה.\nתקראו את חוות הדעת של R.A, ההבדל היחיד שמועד ב לא היה יותר נומרלי ממועד א.\n\nאם אתם לוקחים את הקורס הזה עם רשף או מישהו מהסגל הנוכחי, אני משתתף בצערכם, אתם תצאו עם יותר ידע בלקרוא ולהבין excel מאשר בינה.\n\nמי יתן ותצליחו לקבל אישור לעשות את האחד של מדמח.\nתהיו חזקים וסעו לשלום, אבא אוהב אותכם.", "timestamp": 1717848440873}]}