{"posts": [{"author": "אוהב אופטימיזציה", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מעולה שמשקיע מאוד בחומר של הקורס. כל החומר מופיע במצגות שדן מפרסם לפני השיעור. המרצה מצפה שיש לכם רקע באופטימיזיה ובאלגברה לינארית, במידה ואין לכם אל תתקרבו לקורס.\n\nשם המתרגל/ת: אין תרגולים\n\nשעורי הבית: בקורס אין מבחן והציון נקבע רק לפי 3 תרגילי הבית. בכל תרגיל יש כמה שאלות הוכחה וחלק תכנותי. שאלות לא טריוויאליות אבל לגמרי פתירות. בנוסף בתרגיל בית 3 יש פרוקיט קטן.\n\nהמבחן: אין\n\nהשורה התחתונה: מתאים למי שמתעניין באופטימיזציה וחושב שסוגיל לפתור את השאלות שדן נותן.", "timestamp": 1626798543222}, {"author": "פה ושם", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: ההרצאות בנויות טוב. מסודרות והחומר אמור להיות מעניין. \nבפועל מרגישים שהמרצה לא מעוניין להעביר את הקורס. \nהרבה הרצאות התבטלו או נדחו בצורה משמעותית בגלל התנהלות לא רצינית של המרצה. \n\nשעורי הבית: גרועים במיוחד. לא עוזרים להבין את החומר. יש שם שאלות קשות מאוד שהדרך היחידה לפתור אותם היא או לרפרנס או למצוא מאמר רלוונטי ולחקות את ההוכחות שלו. בזבוז זמן ענקי.\n\nהשורה התחתונה: קורס שהוא פספוס.", "timestamp": 1690152479141}, {"author": "שליחי הדודה עושים קאמבק?", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה בסדר בגדול. עם זאת, ניכר שהוא לא מלמד \"מכל הלב\". היו הרבה ביטולים רבים של הרצאות והעביר את החומר בחצי חשק.\nבאופן כללי, הוא בונה את המצגות שמלאות בהמון טריקים ומעברים אלגברים, ללא איזשהו קושי מהותי מלבד כמות המעברים. \n\n\nשעורי הבית: לא קלים. בסמסטר שלנו היו 3 תרגילי בית כאשר חלק מהשאלות היו בלתי פתירות ברמת השקעה סבירה והיה צורך לחפש במאמרים עדכניים כיצד לפתור אותן. לא הרגשתי ששיעורי הבית תרמו בהבנת החומר בעקבות הקושי שלהם.\n\nהמבחן: לא היה\n\nהשורה התחתונה: קורס לא מומלץ בעיניי. לא מלמד הרבה חוץ מתחום מאוד ספציפי וקטן (מניח שזה מה שקורה בקורסי אופטימיזציה מתקדמים).", "timestamp": 1691831635882}, {"author": "Olga Soldatenko", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: מרצה רץ מאוד מהר על החומר שהוא די קשה (מדלג על חלקים בהוכחות), אבל המצגות די מסודרות. הרבה הוכחות מאט שימוש אמיתי.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: ---\n\nשעורי הבית: תרגילי בית קשים וגדולים, אין רפרנסים.\n\nהמבחן: היה אמור להיות מבחן בעלפה, בסוף לא היה כי מרצה אמר שמנוחחות נמוחה והעתקות רחבות של שיעורי בית הוא מניח שהרבה אנשים לא יעברו את המבחן וחבל לו על הזמן.\n\nהשורה התחתונה: לא ממליצה, לקחתי כי הייתי צריכה קורס באופטימיזציה. קורס סתם קשה ותיאורתי", "timestamp": 1694441867672}]}