{"posts": [{"author": "מור בורשטיין", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: איתי קולר\nחוות דעת - תרגולים: מתרגל ביזיון, לא מוכן לתרגולים ולא מוציא אותם בזמן\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מעניין אבל ניהול זוועתי", "timestamp": 1599927553115}, {"author": "רובינשטיין המתמקח", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: נראה שבסך הכל הוא יודע את החומר, אך ההרצאות נורא מבולגנות. קופצים מנושא לנושא קדימה ואחורה, ויש בלאגן יחסית גדול בהעברת החומר ובמתן דוגמאות.\n\nשם המתרגל/ת: איתי קולר\nחוות דעת - תרגולים: מתרגל בצורה מבולגנת. התרגולים נעשו על ידי שיתוף מסך של התרגילים והפתרונות שנכתבו בכתב יד על ידי איתי (גם כאשר התרגול היה היברידי ונערך בכיתה), מה שמקשה על המעקב אחרי התרגול שכן הוא פחות פתר את התרגילים ויותר הקריא פשוט את מה שרשם, ועל חלק הוא דילג מפאת חוסר זמן.\n\nשיעורי הבית: יחסית קלים, אבל יש מלא שאלות שחוזרות על עצמן ובודקות את אותו דבר בדיוק, מה שגורם להם להיות ארוכים ומעצבנים. השיעורים הם בינאריים וניתן להגיש רק חלק מהם ורק חלק מכל גליון.\n\nהמבחן: היה מבחן יותר קשה מן השנים האחרונות. לשם השוואה, לאחר פקטור של 8 נקודות הממוצע עמד על 68, בעוד בשנים האחרונות הוא עמד על 80. בנוסף, נאמר בתרגולים כי תמיד מנרמלים ל-80 אך זה לא קרה הסמסטר.\n\nהשורה התחתונה: קורס שמועבר בצורה מאוד(!) מבולגנת. החל ממעברים קדימה ואחורה בחומר ובדוגמאות, דרך הקלטת הרצאה שנמחקה ולא שוחזרה מעולם, קביעת תרגולים והרצאות על ימי חופש והפסקות לימודים (בסוף הם הבינו את הטעות שלהם כאשר הגיעו לכיתה והיא הייתה ריקה) ועד ציונים לבחינה שהגיעו שבועיים ומשהו אחרי המבחן.\nלמרות הכל, הקורס יחסית קל ורוב הנושאים בו מובנים וקלילים (באופן יחסי לפחות).", "timestamp": 1629801568674}, {"author": "Roman Shamsutdinov", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעקוב\nחוות דעת - הרצאות: מבולגן מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מתבלבל מלא בתרגילים\n\nשעורי הבית: קלים עם רפרנס\n\nהמבחן: לא קל\n\nהשורה התחתונה: קורס חובה אז אין ברירה", "timestamp": 1658735509349}, {"author": "איום לא אמין", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות (ראיתי הקלטות משנה שעברה): אחלה מרצה, נהניתי להקשיב לו. אמנם הוא מתבלבל לפעמים או מתעכב על שטויות (נגיד לשרוף 10 דקות על מערכת של 3 משוואות עם 3 נעלמים) אבל הוא מעביר את החומר בצורה ברורה ומעניינת, וזה מה שחשוב.\n\nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים (צפיתי בהקלטות שהוא העלה): עומר העלה כל שבוע הקלטות שלו שבהן הוא עובר בקצרה על הגדרות ופותר תרגילים. עומר מסביר באופן ברור ונותן את האינטואיציה שלו, אז סך הכל אני ממליץ. טיפ: תורידו את הסרטונים ושימו על מהירות 1.5 ומעלה.\n\nשעורי הבית: עוזרים מאוד להבין את החומר, אין בדיקה.\n\nהמבחן: יש עלייה ברמה בשנתיים האחרונות וזה מתבטא בממוצע (אצלנו 69 אחרי 7 נק' פקטור). למרות זאת אני חושב שהוא היה הוגן.\n\nהשורה התחתונה: קורס מעניין וקל יחסית לקורס של 3.5 נק' זכות. מומלץ לקחת אותו לפני או במקביל למודלים במסחר אלקטרוני, חלק מהחומר חופף.", "timestamp": 1658752642481}, {"author": "שייגמר כבר", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: ראיתי הרצאה וחצי מוקלטת בלחץ אז אין מה להרחיב\n\nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים: אחלה מתרגל שבעולם, מסביר הכל כמו שצריך עם אינטואציה + יש הקלטות מפורטות ממש. \n\nשעורי הבית:  4 תרגילים צריך להגיש 3, 10% תקף, תרגילים ברמה סבירה מינוס, לרובם יש רפרנס.. \n\nהמבחן: ממוצע מועד א' היה ממוצע סופי של מועדי א' 69 אחרי פקטור של 7 נק' לא כיף בכלל.\n\nהשורה התחתונה: לא נהניתי", "timestamp": 1658849229025}, {"author": "ניק", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  יעקב בביצ'נקו\nחוות דעת - הרצאות: מרצה שלגמרי בא לקראת הסטודנטים ומנסה להתחשב עד כמה שאפשר. שחרר הקלטות משנה שעברה אז בהרצאות היו רק 20 סטודנטים בערך מתוך 160 אז האווירה הייתה טובה. ההרצאות די מבולגנות והוא כל פעם עוצר באמצע ולא ממשיך בשיעור הבא אז לפעמים נושאים לא יושבים טוב.\n\nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים: עומר מאוד חינני ובאמת עושה השתדלות מעל ומעבר אבל התרגולים היו מאוד מאוד מבולבלים ובגדול זה בעיקר היה לפתור תרגילים והרגשתי שאין ערך מוסף. בהרבה תרגילים הפתרון הוא פשוט ניחוש של התשובה ולא היה ברור איך להגיע לזה.\n\nשעורי הבית: 4 גליונות לא קצרים עם 5 שאלות בכל אחד. צריך להגיש רק 3 ובכל אחד מספיק להגיש חצי מהשאלות והציון הוא בינארי אז זה לא מעיק בכלל.\n\nהמבחן: 5 שאלות פתוחות עם סעיפים. אצלנו הייתה גם שאלת הוכחה שהפילה הרבה אנשים ועוד סעיף הוכחה. מבחן הוגן לדעתי שדיי עובר על כל החומר בקורס (הרגיש לי לא עמוס).\nאצלנו היה 7 פקטור.\n\nהשורה התחתונה: קורס שיכול להיות לגמרי מעניין עבר אצלנו דיי כדי לסמן וי ולהמשיך הלאה.", "timestamp": 1659104596941}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: הרצאות מבולגנות, לפעמים קצת קשה לעקוב כי הוא מזגזג בין נושאים. אבל ניכר כי יודע טוב את החומר, עשה כמה משחקים/תחרויות עם בונוסים בחלק מההרצאות מה ששדרג את ההרצאות והוסיף עניין.\n\nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים: עומר נסיך! מאוד אכפתי ולקראת המבחן העביר כמה שעות קבלה, ענה למיליון מיילים ובאמת לגמרי בא לקראת הסטודנטים. \n\nשעורי הבית: 4 גיליונות מתוכם 3 חובה וציונים בינאריים. ממש לא עמוס אבל גם לא קל- כדאי לפתור לבד/ לנסות להבין במהלך הסמסטר כי משקף מאוד את הרמה והחומר של המבחן.\n\nהמבחן: לא קל, קצת ארוך אבל אפשרי לסיום.", "timestamp": 1660213068076}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יעקוב \nחוות דעת - הרצאות: החומר לא קשה .\n\nשם המתרגל/ת: עומר מדמון \nחוות דעת - תרגולים: הוא נחמד ועוזר מאוד , התרגולים היו מסודרים עם הקלטות של פתרונות לשאלות , הוא פתר את כל השאלות בצורה ברורה .  \n\nשעורי הבית: יש ריפרינס , לפעמים השאלות מצריכות רמת הבנה עמוקה כדי לפתור .\n\nהמבחן: הכייייייי קשה שיש , רמה מאוד גבוהה צריך הבנה לעומק מועד א היה עם ממוצע 69  ,מועד ב היה ממש ממש קשה אפילו ברמה יותר גבוהה ממועד א . היה מלא טריקים ושאלה עם סוג חדש שלא ראינו מקודם .\" יעקוב חושה שאנחנו ברמת פרופיסור כומוהו בגלל זה רמת המבחן קשה מאוד\" . \n\nהשורה התחתונה: מי שלא חובה אצלו לא יקחחחחחחחח .", "timestamp": 1664797364307}, {"author": "שיווי משקל פרפקטי", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: הבעיה העיקרית בהרצאות של איתי זה שהן נורא מבולגנות. רואים שהוא לא מגיע מוכן להרצאות, ודי מאלתר מהראש שלוש שעות והתוצאה בהתאם. הייתה הרצאה אחת אייקונית שבה הוא ניסה להביא דוגמה למשהו מהראש, נתקע על זה 10 דקות ואז שחרר להפסקה של רבע שעה. כל הבעיות יכלו להיפתר אם הוא רק היה מתכונן לפני, וחבל.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: תותח על, התרגולים שלו ממש מעולים והוא מסביר ממש טוב. לא ממש רלוונטי כי הוא מסיים אבל אם יש הקלטות שלו תצפו בהן, הן ממש טובות.\n\nשעורי הבית: לא כבדים יותר מדי, אפשר לעשות גיליון ביום. רובם ממש טכניים.\n\nהמבחן: יש עליית רמה וירידת ממוצע משנים קודמות שהיא מאוד ניכרת. אצלנו במבחן הייתה שאלה אחת שהייתה די מורכבת ולא ממש מזכירה שאלות באותו נושא משנים קודמות והרבה נפלו בה, אבל השאר היה סביר. תמיד יש שאלה שהיא להוכיח את אחד המשפטים שרואים בקורס אז צריך לשנן. אלה הוכחות סופר כבדות וארוכות עם ים סימונים ומעברים שפשוט צריך לזכור בעל פה, תתחילו לשנן אותן שבוע לפני המבחן בשביל לחסוך זמן בלמידה.\n\nהשורה התחתונה: קורס לא ממש מעניין, ההרצאות היו על הפנים אבל התרגולים היו אחלה. מאוד לא ממליץ אם זה לא קורס חובה. זה מאוד רחוק מהתדמית שיש לתחום של תורת המשחקים למישהו שלא למד את הנושא.", "timestamp": 1677773641897}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: מרגיש קצת כמו בזבוז של זמן אבל אני לא יודע אם הייתי מבין את התרגולים בלעדיהן. ההרצאות נוראיות ומאוד קשה להבין מה הולך בהן.\n\nשם המתרגל/ת: עומר ציצלסקי התותח\nחוות דעת - תרגולים: מתרגל מעולה, מעביר את החומר בצורה סופר ברורה ומאוד משקיע בתרגולים, באמת לא הייתי מבין כלום בלעדיו. \n\nשעורי הבית: רמה סבירה למעט כמה שאלות יוצאות דופן שהיו יותר קלות. לרוב אפשר לשבת ולהעתיק את הפתרונות מהתרגולים.\n\nהמבחן: שאלת הוכחה של משפט מהמשפטים שנלמדו - האמת זה היה ממש סביר, אחרי פעמיים שקוראים את ההוכחות ובאמת מבינים אותן, לזכור את ההוכחות זה אפשרי.\nהייתה שאלה נוספת ומאוד טכנית של מציאת שיוויי משקל - ארוך אבל גם סבבה. שאר השאלות בבחינה היו קשות מאוד. הייתה קצת אווירה של זריקה על הסטודנטים לקראת מועד א. זה שפורסמו טפסי בחינות עבר זה נחמד, אבל זה לא כלכך מועיל אם אין להן פתרונות. מה שכן סגל המתרגלים עשה הרבה שעות קבלה וזה כן עזר עם המצב.\n\nהשורה התחתונה: הקורס הזה קצת מזכיר את מתמטיקה דיסקרטית מבחינת רמת המופשטות (או איך שאני קורא לזה - רמת חוסר ההבנה בהרצאות). לא הייתי לוקח את הקורס כקורס בחירה, כקורס חובה זה מרגיש לא רלוונטי כלכך לרוב הסטודנטים במסלול.", "timestamp": 1677798744174}, {"author": "עמית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: הרצאות לא מובנות. נעזרתי בסטאדיס כדי להבין את החומר.\n\nחוות דעת - תרגולים: התרגולים מצוינים.\n\nהמבחן: לא פשוט. \n\nהשורה התחתונה: קורס לא קל. קצת עמוס. מאוד מתמטי.", "timestamp": 1678103920310}, {"author": "אנונימוס", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרופסור איתי אריאלי\nחוות דעת - הרצאות: מרצה מאוד נחמד ומקצועי אבל ההרצאות לא מאוד ברורות. קשה לעקוב אחרי כל הסימונים שלו והיו הרבה שונים היו הרצאות ארוכות מאוד עם הוכחות קשות וארוכות ולא תמיד הכל מובן. החוצר מאוד מתמטי ויש דברים קשים לקראת ההרצאות בסוף שלא מבינים את  כל החומר עד למבחן\n\nשם המתרגל/ת: עומר ציצלסקי המלךךךך\nחוות דעת - תרגולים: התרגולים בנויים בצורה מאוד טובה בהתחלה עושים חזרה על ההרצאה ומבינים את כל מה שחשוב ואז עושים תרגילים גם ומבינים מה צריך לעשות בקורס. עומר תמיד עזר לי והייתי אצלו עם מלא שאלות ומלא שעות קבלה ותמיד ענה בסבלנות יתרה והסביר טוב. עזר לנו להבין את החומר מההרצאות טוב יותר.\n\nשעורי הבית: גיליון כל שבוע לא ארוך בכלל ואפשר לעשות בשעתיים שלוש של עבודה שאלות חדשות ואין פתרונות אז לפעמין היה קשה אבל זה חזרה טוב למבחן.\n\nהמבחן: מבחן שיש בו שאלה אחת של הוכחה שראינו בהרצאה פשוט לשנן שזה טוב אבל ארוך ועוד 3 שאלות היו 2 קלות/סבירות ועוד אחת קצת יותר קשה אבל הבדיקה הייתה ממש טובה \n\nהשורה התחתונה: קורס סבבה לא ברור איך הוא קשור לתואר כל כך אבל לא עמוס והתרגולים מעולים", "timestamp": 1678450009191}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: \nמרצה קצת מבולגן. רואים שהוא יודע את החומר, אבל הוא מעביר אותו בצורה מפוזרת מאוד.\n\nשם המתרגל/ת:  עומר ציצלסקי\nחוות דעת - תרגולים: \nמתרגל מצוין. מסביר את החומר בצורה מאוד טובה, עונה על שאלות, ועושה אווירה טובה. רואים שאכפת לו מהסטודנטים.\n\nשעורי הבית: \nאחד בכל שבוע. לנו היה חובת הגשה על 9 מהם. רוב השיעורי בית לא קשים אם מבינים טוב את החומר, אבל לפעמים יש גם שאלות הוכחה מאוד רנדומליות.", "timestamp": 1679227054088}, {"author": "ד", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איתי\nחוות דעת - הרצאות: לא להגיע, לצפות בפלייליסט של game theory 101 של וויליאם ספניאל \n\nשם המתרגל/ת: עומר מוקלט\nחוות דעת - תרגולים: אחלה תרגולים, ממש מנחים לש״ב גם\n\nשעורי הבית: גיליון שבועי לרוב מאוד פתיר ולפעמים יש שאלות אינפי3 רנדומליות. יש רפרנסים אבל באמת שווה לפתור עצמאית כי שאלות המבחן די מאותו סגנון. \n\nהמבחן: יש במבחן הוכחה אחת מבין 3 - משפט ההפרדה, משפט המינמקס, משפט נאש. תעשו לעצמכם טובה ותלמדו אותם כבר במהלך הסמסטר. חוץ מזה שאלות יחסית בסגנון השב רק עם יותר תעלולים לכן חשוב לשלוט בשאלות ובפתרונות שלהן\n\nהשורה התחתונה: אין. לא התרשמתי.", "timestamp": 1679475984971}, {"author": "adir blajwas", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: \nארוכות מאוד ובלי הרבה תוכן עצמו שצריך לדעת למבחן . יכול להיות מאוד מעניין אבל משעמם מאוד. \nשם המתרגל/ת: עומר ציצלנסקי\nחוות דעת - תרגולים: \nמסביר מצוין חד ותכליתי\nשעורי הבית: \nלא קשים בכלל יש כל שבוע וצריך רק ציון עובר בשביל לקבל את המגן\nהמבחן: \nלא קשה במיוחד. לפעמים מערב את הנושאים מסוף הסמסטר שחשוב לחזק בשעות קבלה כי אין מספיק תרגולים עליהם\n\nהשורה התחתונה:", "timestamp": 1679561770274}, {"author": "סטודנט ממוצע", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: מאוד לא מסודרות ובעיקר מאוד לא ברורות אבל כשאין ברירה אז אין ברירה ומנסים להבין. בנוסף הוא מעביר את החומר די משעמם לנושא שאמור להיות \"סקסי\".\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: חד משמעית ללכת לעומר. עושה הרבה סדר.\n\nשעורי הבית: לא עמוסים ודי סבבה. \n\nהמבחן: קשה. ממוצע נמוך. חשוב ללמוד את ההוכחות מראש כי אחת כן הופיעה במבחן.\n\nהשורה התחתונה: אין על סטאדיס. הרימו קורס מושקע ומובן. חבל שעדיין לא כולל את כל החומר אבל כן שווה להיעזר במה שיש להם כי הם גם מעבירים את זה מובן וגם נותנים אחלה שיטות (במיוחד באסטרטגיות מעורבות, די הצילו אותי שם).", "timestamp": 1683045098405}, {"author": "שחקן שורות", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה:יעקב \nחוות דעת - הרצאות: מבולגן וכותב על הלוח, מצד שני מסביר טוב\nהחסרון למרות שבערך לא היה חודש הרצאות, התעקש לדחוף חומר של חודשיים בשלושה שבועות\nהשיעורי חזרה שלו למבחן מעולים (מוקלטים)\nבכללי אחלה בן אדם ומתייחס בכבוד לסטודנטים\n\nשם המתרגל/ת:עומר מדמון \nחוות דעת - תרגולים: \nאחלה מתרגל, אכפת לו מאד מהסטודנטים, מסביר מעולה, גמיש,ראש בוגר ובגובה בעיניים לגמרי\nכל התרגולים שלו היו מוקלטים והועלו למודל ברמה גבוהה ומפורטת\nהקורס עצמו לא כזה פשוט, אבל תמיד יש לאן לחזור אם מסתבכים \nשעורי הבית: \nבאופן רגיל מגישים בסמסטר אצל יעקב בין 4-5 גליונות, שזה כבר שפוי ונותן זמן להתאפס על החומר ולא סתם להגיש גליונות בקבלנות\nחוץ מזה, לאור שינויים כאלו ואחרים בגלל שביתות הסגל נתן הארכות להגשות ודרש להגיש רק שני גליונות, כן ירבו סגלים כאלו\nהמבחן: \nמבחן ברמת קושי מאתגרת +, רוב המבחן זה הוכח\\הפרך\nעם זאת (לעומת קורסים אחרים בטכניון) המבחן הוא אשכרה על חומר שנלמד בהרצאות והתרגולים ובאמת בודק שליטה בחומר\nהשורה התחתונה: \nיש איפה להרים את הרמה של הקורס מבחינת סדר בהרצאות (מצגות לחומר התיאורטי למשל) אבל בכללי קורס מעניין, דורש השקעה אבל בראש יחסית טוב", "timestamp": 1689236550730}, {"author": "סטטיסטיקאי שאינו שיכור", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: יעקב גאון אבל הוא פחות יודע להעביר את החומר בצורה מובנת אבל הוא אחד האנשים הכי נחמדים שפגשתי וזה מבחינתי לא פחות חשוב אם לא יותר\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: אחלה גבר שבעולם  ואחלה מתרגל \n\nשעורי הבית: בסמסטר רגיל יש 4 גיליונות וצריך להגיד 3 , אצלנו בגלל השביתות ועוד היה צריך לעשות 2 \n\nהמבחן:  המבחן הוגן ובעיקר בודק את הידע וההבנה של הסטודנט \n\nהשורה התחתונה: אחלה קורס שבעולם אני נהנתי וניתן באמת להצליח בקורס הזה", "timestamp": 1689276897177}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  יעקב (מוקלט)\nחוות דעת - הרצאות: חזרתי על הקורס אחרי שעשיתי עם איתי ולדעתי מעביר אותו בצורה הרבה יותר טובה ובסדר הרבה יותר הגיוני. לפעמים הוא מתפזר או סתם מתעכב על פתרון משוואות- ממליץ לדלג\n\nשם המתרגל/ת: עומר (מוקלט)\nחוות דעת - תרגולים: מתרגל טוב, מעלה לכל תרגול תיקייה עם הקלטות של פתרון התרגילים. חורג בדרך כלל בהקלטות מעבר לזמן התרגול אבל שווה לראות לדעתי\n\nשעורי הבית: היו 4 גיליונות מתוכם צריך להגיש 3 (לנו היה 2 בגלל השביתה), ממש בסדר\n\nהמבחן: שאלה אחת מתוך ארבע ממש בלתי אפשרית לדעתי, יעקב מצפה שתהיה לנו אינטואיציה לדברים שאין לנו. שאר השאלות היו ממש הוגנות אז אפשר להוציא ציון סביר אחרי פקטור קטן ומגן. לעומת המבחנים של איתי לא צריך לשנן הוכחות, מה שלי לפחות מאוד עזר", "timestamp": 1689936147867}, {"author": "משפט בראור", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: תכלס סתם כותב על הלוח ובין לבין קצת מסביר. לא יודע כמה תרם לי להגיע אבל הרגשתי צורך להמשיך לבוא. סך הכל אחלה בן אדם\n\nשם המתרגל/ת: עומר ויואב\nחוות דעת - תרגולים: מה שהיה נחמד זה שהיו לעומר תרגולים מוקלטים ואפשר לעבור עליהם בקצב שלך. בתרגול של שעה פרונטלי לא מספיקים כמעט כלום\n\nשעורי הבית: בגלל השביתה היו רק 2 תרגילים חובה מתוך 4 וזה היה עובר בינארי. אפשר לסיים אותם תוך כמה שעות, לא מורכב מדי\n\nהמבחן: בהשוואה לשנים קודמות חוץ משאלה אחת כל המבחן היה הוכח/הפרך, קיים/לא קיים והיה צריך להמציא דוגמאות וממש להבין את החומר לעומק ולא סתם לחשב דברים. היה לא פשוט. קיבלנו 7 נקודות פקטור\n\nהשורה התחתונה:", "timestamp": 1690585861617}, {"author": "?????", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: מרצה מעניין, קצת מבולגן.\n\nשם המתרגל/ת: עומר מוקלט\nחוות דעת - תרגולים: מפורט ומובן בסך הכל\n\nשעורי הבית: דומים למבחנים\n\nהמבחן: לא פשוט כי רובו בנוי על נכון/לא נכון (לפחות לנו היה ככה). כן דומה למה שלמדנו במהלך הסמסטר ולשיעורי הבית.\n\nהשורה התחתונה:", "timestamp": 1691741674480}, {"author": "K", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יעקוב \nחוות דעת - הרצאות: אחלה בסה\"כ, היו הקלטות מסמסטרים קודמים. קראתי סיכומים לרוב.\n\nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים: תותח, העביר את התרגולים בצורה טובה ומסודרת בהקלטות ובשעות הקבלה לפני המבחן. נחמד ומנסה לעזור.\n\nהמבחן: היה פורמט שונה משנים קודמות בשני המועדים, לא יודע כמה זה מייצג\n\nהשורה התחתונה: קורס חובה מה לא תקחו", "timestamp": 1709394164322}, {"author": "די", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: \nלא הלכתי, כרגיל אצל יעקב עושה הרצאות ארוכות ואז בכל התרגילים שפותרים באים לידי ביטוי רק התרגולים ושיעורי הבית. \nשם המתרגל/ת: עומר מדמון\nחוות דעת - תרגולים: \nמתרגל סבבה, אפשר פשוט לקרוא את התרגולים\nשעורי הבית: \nהיו רק 4 אז לא באמת היה תרגול של החומר, מועתקים משנה לשנה\nהמבחן: \nבמבחן היה טריקים אבל היה יחסית הוגן וכלל את הנושאים לדעתי לפחות היותר קלים בקורס\nהשורה התחתונה: לא הורידו חומר למרות שירד שבוע ופשוט הורידו את השבוע חזרה", "timestamp": 1716217996845}, {"author": ":)", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יעקב\nחוות דעת - הרצאות: לא הגעתי, ראיתי מוקלט. אם ראיתם מוקלט בדיסקרטית אין מה להתלבט - אותו קונספט.\nהוא בן אדם מקסים, אבל לי אישית קשה לראות אותו פרונטלית. \n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: לא הגעתי, ראיתי מוקלט. הרעיונות די חוזרים על עצמם אז אפשר להריץ את ההקלטה\n\nשעורי הבית: \nבקטנה ממש, מרופרנסים\n\nהמבחן: \nהוגן, יעקב כהרגלו תוחם את המקום שבו אפשר לענות את שאלות, ודי מצפה מאיתנו לתמצת. היה לרובנו יומיים להתכונן למבחן ועדיין היה ממוצע יפה מאוד.\n\nהשורה התחתונה: למרות שזה אמור היה להיות קורס מעניין מאוד, לא הרגשתי את זה בכלל האמת.. אבל מעבר לזה היה נחמד", "timestamp": 1716962445480}]}