{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמלאות במלל, המרצה מסתירה חלק מהשקופיות ואח״כ מכניסה את מה שהיה שם למבחן.\nלבוא מוכנים להמון חפירות, המון סרטוני פרסומות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלוקחת מקרה כללי מההרצאה ועושה עליו את התרגיל בית. לא כזה קריטי.\nשעורי הבית: \nצריך להגיש 10 תרגילי בית, אם לא מגישים אז יורדים 2% מהציון הסופי, אבל אם מגישים אז זה בינארי.\nהתרגילים חוזרים עם הערות ואח״כ עוזרים לבנייה של הפרויקט.\nהפרויקט בבדיקה קפדנית- אז לעשות עם שותפים ששמים משהו על ציונים.\nהמבחן: \nנתון למיליון פרשנויות, צריך ללכת עם הדעה של המרצה או שמקבלים נכשל.\nהשורה התחתונה: \nקורס חופר, פרסומות נחמדות", "timestamp": 1627473665818}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ליאת לבונטין\nחוות דעת - הרצאות: הרצאות מעניינות, חייב להקשיב להכל כי המבחן ממש על דברים קטנים שהיא מזכירה בהרצאות\n\nשם המתרגל/ת: מעורבב\nחוות דעת - תרגולים: המתרגלות היו חמודות אבל אין צורך להשתתף באופן פעיל בתרגולים\n\nשעורי הבית: אצלנו השיעורי בית היו חלקים קטנים מהפרוייקט שמגישים כל שבוע. קצת בעייתי שהן נותנות בערך 3-4 ימים להגשת תרגילי הבית אבל בפועל זה לוקח לא הרבה זמן (בערך 20 דק' עד שעה) ומאוד עוזר בשביל הפרוייקט סיום.\n\nהמבחן: מבחן על נקודות קטנות שהוזכרו בהרצאה, ככה שחשוב להקשיב לה ולסכם.\n\nהשורה התחתונה: קורס מעניין מאוד, כיפי וקליל. לא בהכרח משהו שיועיל לתעסוקה בהמשך אבל נחמד שיש משהו כזה בתואר", "timestamp": 1629704774388}, {"author": "סטודנט מיואש ומשועמם", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עטר הרציגר וליאת לבונטין.\n\nחוות דעת - הרצאות: הרצאות משעממות - הקורס מאוד לא מעניין. כל הרצאה מכילה כ-30% של צפייה בפרסומות. חלקן סבירות, אבל זה נהיה מייאש כבר אחרי ההרצאה השנייה או השלישית. הקורס מכיל הרבה חומר, ומתקטננים בו המון על שטויות. יש המון נושאים שנתונים לפרשנות, אבל מבחינת המרצות והמתרגלות, מה שהן לימדו זה קדוש, ואפילו אם משהו נשמע נכון אבל הן אמרו אחרת אז הן אלו שצודקות. הקורס מכיל הרבה מושגים לא מעניינים מעולם השיווק, מושגים שלא נפגוש בחיים (ככל הנראה, לפחות מי שמגיע ממערכות מידע). לפעמים יש מושגים שהשם שלהם הוא הפוך לחלוטין מהמשמעות שלהם, וצריך לשנן את הכל, בלי ללכת אחרי הגיון מסוים.\n\nשם המתרגל/ת: שיר ונלי\nחוות דעת - תרגולים: תרגלו שבוע-שבוע: כל שבוע מתרגלת אחרת. התרגולים מרגישים מיותרים לחלוטין, אולי חוץ מתרגול וחצי בהם מדברים על משהו שלא ראינו בהרצאה. כל תרגול הוא פשוט \"שעת יצירה\" בגן - מתחלקים לקבוצות ודנים על משהו שראינו בהרצאה, כמו פלחי שוק או מיצוב ועוד על מני דברים לא מעניינים בעליל.\nהמתרגלות היו לא כריזמטיות, ולפעמים זה הרגיש שליאת הכריחה אותן לתרגל את הקורס יותר מאשר שהן רצו לתרגל אותו.\n\nשעורי הבית: כל שבוע יצא תרגיל, והיו שלושה ימים לעשות אותו (כולל שבת, ושומרי שבת לא קיבלו הארכה או התחשבות מינימלית כלשהי). התרגילים הם בינאריים. חלק מהתרגילים לקחו חצי שעה, וחלקם כמה שעות. כל תרגיל עסק בנושא אחר, ותרגילי הבית היו אמורים להוות הכנה לפרויקט. בפועל, הם היו יותר קוץ בישבן מכל דבר אחר. בשנה שעברה לפחות התרגילים היו על המוצר של הפרויקט הסופי, ואז הם היו יותר חשובים והסטודנטים קיבלו משוב ראשוני על חלקי הפרויקט השונים עוד לפני ההגשה בסוף הסמסטר. הפעם, הרגיש כאילו רצו לדפוק אותנו והחליטו שאסור לעשות את המוצר של הפרויקט, וגם לא מוצרים אחרים של אותה החברה, כך שבפועל עשינו שני פרויקטים שונים.\nהפרויקט הסופי הוא 30% מהציון, והבדיקה קטנונית לחלוטין. גם מפחיד לערער על הציון, כי הערעור יוביל לבדיקה של הפרויקט אצל המרצות, שיעברו על הכל מחדש, ובטח רק ימצאו על מה עוד להוריד.\n\nהמבחן: קשה ומכיל המון מושגים קטנטנים שנזרקו לפעמים בתור הערת שוליים, והוזכרו בהקשר של שקופיות שהיו מוסתרות - המרצות מעלות רק חלקים מכל מצגת של ההרצאה ואת השאר מסתירות מאיתנו, והמתרגלות בכלל לא מעלות את המצגות של התרגולים. היה קשה ללמוד, כי בנוסף לזה, לא פירסמו שום מבחני עבר ואפילו לא תרגילי חזרה כלשהם. לא ממש היה אפשר לדעת למה לצפות חוץ מלהסתמך על כמה שחזורים מהדרייב או מבחנים מלפני עשרים שנה.\nהמבחן עצמו היה מסובך והתקטננו מאוד על מושגים וגישות שלמדנו בקטנה.\nהמבחן ללא שום חומר עזר, מה שהפך את השינון לבלתי נסבל בעליל - היה צריך לשנן כל גישה וגישה וכל פיפס שהוזכר בהרצאות ובתרגולים, וכמו שהזכרתי, אי-אפשר ללכת עם ההגיון כי יש המון דברים שהם איזורים אפורים ודו-משמעיים, אבל מבחינת המרצות והמתרגלות רק מה שהן לימדו נכון.\n\nהשורה התחתונה: הקורס הכי משעמם שקיים בפקולטה, ואולי גם בטכניון - וזה נרשם לאחר לקיחת קורסים לא מעניינים כמו הצגת מידע חזותי, כלכלה וניהול פיננסי. מנסה להבין מי החליט שסטודנטים למערכות מידע צריכים לקחת את הקורס הזה ולמה זה חשוב שנלמד דברים כל כך משעממים שלא נתעסק בהם בחיים, ואין להם אפילו לא אפסילון במשותף עם התואר. הלוואי והוא לא היה חובה ולא היינו צריכים לעבור את הסיוט הזה.\n\nלסיום: מי שזה לא חובה עבורו - תברחו! מי שזה כן חובה עבורו (בעיקר מערכות מידע) - משתתף בצערכם. תשננו את כל הקורס לפני הבחינה ותתפללו לעובר.", "timestamp": 1659353986222}, {"author": "סטודנטית מאוכזבת", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עטר\nחוות דעת - הרצאות: מדברת ומדברת ומדברת.... חלק מהדברים באמת מעניינים אבל מאוד מהר מאבדים עניין/ריכוז. בכל זאת 3 שעות שתקועות באיזה ערב של יום רביעי לכן לא באמת אפשר להתרכז. מה גם שחוץ מכותרות ותמונות של קוקה קולה לא כתוב במצגות שלה כלום.\n\nשם המתרגל/ת: קים ושיר\nחוות דעת - תרגולים: \nהמלאך והשטן שיר וקים, האחת מבינה שמדובר בקורס מעלה ממוצע השנייה חושבת שמדובר באינפי 2 . תתפללו שמי שתבדוק את הפרויקט שלכם זו שיר בקיצור. (תרגולים לא מועילים יותר מדיי).\nשעורי הבית: \nנתנו 5 תרגילי בונוס שמעלים 5 נקודות לציון המבחן, תעשו אותם אתם תצטרכו את זה.\nהמבחן: \nמ ח ר י ד. שאלות לא ברורות ותשובות שמשתמעות ל2 פנים. \nאחרי למידה אינטנסיבית למבחן רובם הכולל של הקורס קיבל בין 50-60. לא היו מבחני עבר רלוונטים לתרגל מהם והדרך למידה למבחן היא לעבור על מצגות שלא כתוב בהם כלום ועל ספר הקורס שמורכב מ1000 עמודים.\nהשורה התחתונה: קורס חרטה שנועד להוריד לכם את הממוצע, מי שלא חובה לברוח!!!!!!!!!!!!!!\nיש פרוייקט (50% מהציון הסופי) שאם אתם חושבים שהוא יציל לכם את הציון הגרוע של המבחן אתם ממש טועים.", "timestamp": 1690982672688}, {"author": "ניק", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עטר\nחוות דעת - הרצאות: הרצאות מעניינות אבל עטר עושה אותן קצת פחות מעניינות. המצגות לא טובות ובכלל לא אינפורמטיביות (אוסף תמונות) ובגלל זה צריך ממש להקשיב לה כי היא שואלת אחר כך במבחן. לא ברור כל כך מה העיקר ומה התפל וחבל כי זה יכל להיות ממש מעניין.\n\nשם המתרגל/ת: שיר וקים (שבועיים שבועיים בקורס הזה) \nחוות דעת - תרגולים: התרגולים הם העשרה של החלקים החשובים מההרצאה אבל בעיקר התפקיד שלהם זה להכין לקראת העבודה על הפרוייקט. התרגולים מתומצתים ודיי טובים, המתרגלות חמודות ממש ועוזרות המון המון על הפרוייקט וכדאי להיעזר בהן. חבל שבסוף למבחן יש המון דברים שלא נגעו בהם בתרגולים.\n\nשעורי הבית: עבודה על הפרוייקט לאורך הסימסטר. תרגיל בית כל שבועיים שמכסה שני נושאים בכל פעם (אחד מכל שבוע). סך הכל ממש לא ארוך ולא קשה (בינארי בגדול) ומכין לפרוייקט. \nיש פרוייקט שהוא 30% מהציון ובגדול מלווה את העבודה של כל הסימסטר, אצלנו היה בשלשות וממש לא היה קאדר.\n\nהמבחן: טריקי ברמות. אצלנו זה היה נראה כאילו היא מנסה להוריד ממוצע בכוח (וזה משתקף בציונים). המון שאלות מנושאים קטנים. שאלות טריקיות שאפשר להבין ב-4 דרכים ופשוט צריך לקלוע למה שהיא התכוונה.\nתנסו להוציא ציון טוב בפרוייקט.\n\nהשורה התחתונה: קורס שיכל להיות אחלה ובסוף יצאנו ממנו בהרגשה רעה וסתם חבל", "timestamp": 1691667178404}, {"author": "Nina Kahn", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עטר\nחוות דעת - הרצאות: שוברות שגרה מהקורסים הכבדים של התואר, החומר אחלה ולדעתי חשוב להגיע להרצאות ולכתוב כי במצגות לא רשום יותר מדי\n\nשם המתרגל/ת: קים ושיר (הן עשו חצי-חצי)\nחוות דעת - תרגולים: במקום ללמד חומר חדש, בתרגולים ממש עושים תרגילים עם החומר. זה מאוד עוזר עם הפרויקט, ובכללי טוב לבוא ולשאול שאלות, וכך המתרגלות גם מכירות את הפרויקט שלך ורואים שאתה משקיעץ\n\nשעורי הבית: הגשות בינאריות שהן חלק מהפרויקט, מקבלים פידבק וחשוב מאוד במהלך כל הסמסטר לחזור לפרויקט ולתקן דברים כדי להקל על ההגשה הסופית שהיא ענקית.\nבנוסף היתה לנו אופציה לעשות 5 תרגילי בונוס ל5 נקודות במבחן (צריך להגיש את כל ה5), ובסוף זה יכול להציל את הציון אז כדאי לעשות אותם.\n\nהמבחן: קשה מאוד. אני הגעתי לכל ההרצאות, הקשבתי והשקעתי, ועדיין לא הצלחתי. החומר של הקורס חד משמעי כל שמבחן אמריקאי הוא לא פשוט.\n\nהשורה התחתונה: קורס חובה שהוא נחמד עד שמגיעים למבחן :(", "timestamp": 1691865565585}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עטר\nחוות דעת - הרצאות: הוראה טובה, בבניית מבחן נוראית. \n\nשם המתרגל/ת: קים ושיר מתחלפות כל שבוע\nחוות דעת - תרגולים: מיותרים, תתכוננו שהיא והמרצה יגידו דברים שונים, הן לא מתואמות איתה וסותרות אותה לפעמים אפילו במונחים שהיו במבחן. בסוף המרצה קובעת את המבחן והן את הפרויקט. הפרויקט היה 60% בשבועיים האחרונים לסמסטר, לא יכולנו לסיים את הפרויקט עד הימים האחרונים לסמסטר (המרצה סירבה לעשות שיעור השלמה והייתה שביתה של שבועיים) היה מגעיל מצידה.\n\nשעורי הבית: היו אמורים לעזור לנו לבנות את הפרויקט, בפועל ההערות שנתנו לא עזרו כי בפרויקט נתנו הערות חדשות על אותם חלקים מהש\"ב, זה היה ביזיון!!! פרויקט לא ברור, ולא ברור מה הן רוצות לראות בעבודה, ממליץ להשתמש בהרבה ממושגי הקורס בכתיבה ולקוות לטוב, לנו העירו שחלקים מסויימים קצרים מידי אפילו שכמעט חרגנו ממגבלת העמודים בפרויקט, דברים שהם לא אמרו בשב, לא ידוע מי יבדוק את הפרויקט תקוו לשיר, עם קים נתקלתי בשיחות עם בחוסר ידע והבנה למה שרשמנו על גבולות המצחיק והעצוב. \n\nהמבחן: אמריקאי, ביזיון ציון הכי גבוה 88, ממוצע 68, אחרי זה היה פקטור של עוד תשובות כי עטר ניסחה בצורה לא ברורה את השאלות, ועשו לנו סיוט ביחס לערעורים, מנסים לא להפיץ את המבחן שלא תלמדו ממבחני עבר.\n\nהשורה התחתונה: החומר יכל להיות ממש מעניין ורלוונטי אבל הסגל, אופן ההתנהלות עם הפרויקט והמבחן היו בזיוניים ברמה שביישת. יש עומס לקראת סוף הסמסטר עם הגשת הפרויקט אפילו מכללה סוג ז'.", "timestamp": 1693044655371}]}