{"posts": [{"author": "R", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: רוב ההרצאות לא ברורות, לא מתייחס הרבה שחצי מהקורס בלי ידע קודם ברשתות.\nאין לו דרך טובה להסביר את החומר ובמיוחד את המתמטיקה פשוט לא ברור. קשה לו להסביר והוא לא מודע לזה. \nכדי להבין את החומר צקיך לחפש מקורות אחרים באינטרנט.\n\nשם המתרגל/ת: איתי וגיא\nחוות דעת - תרגולים: בינוניים\n\nשעורי הבית: עמוסים וקשים במיוחד\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612948857859}, {"author": "Fishononymous", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: \nמרצה לא וואו, מסביר דיי גרוע, עובר על דברים מהר, אם אפשר כדאי להסתמך על חומרים אחרים. לשים לב למה הוא מלמד כי לפעמים הוא מלמד דברים מאוד חדשים וזה יכול להיכנס למבחן. \n\nהוא מביא גם למאסטרנטים/דוקטורנטים שלו ללמד, לפעמים זה נחמד ומעניין ולפעמים מאבדים בזה\nשם המתרגל/ת: איתי גת וגיא לורברבום.\nחוות דעת - תרגולים: \nאפילו יותר לא הכי וואו, תרגולים של 25 דקות כשבמערכת אמורים להיות שעתיים. מחפפים ודיי זורקים בסהכ. גיא זורק פחות לדעתי אם זה עוזר אבל שניהם זורקים. לפעמים הם עוזרים במיילים בש\"ב\nשעורי הבית: \nתרגיל 1 - לא קשה, דיי עוזר להבנה אפילו\nתרגיל 2 - VQA, היה מטורף, במיוחד למי שבא בלי רקע מוקדם. תרגיל נהדר אם יש לך בסיס טוב. הגזימו עם הקושי.\nתרגיל 3 - GAN/VAE, היה אפשר לרפרנס כמעט בחצי מה tutorial של PyTorch ועדיין התרגיל לא היה כזה קליל.\nהמבחן: \nמבחן לא קל אבל הציונים גבוהים. המתרגלים בדקו ומבחינתם יכלת לכתוב שטויות וכל עוד כתבת את הדבר הנכון קיבלת את הניקוד. יכולים להוריד בקלות נקודות וגם לא להבחין בטעויות (משעשע קצת).\nהשורה התחתונה: \nקורס מעניין אבל עמוס. ממליץ בסה\"כ למרות הכל, אולי כדאי לשקול לקחת את הקורס המקביל בפקולטה של מדמח.", "timestamp": 1615926507286}, {"author": "מציל סטודנטים", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: מבולגנות מאוד, אי אפשר לעקוב אחריו בכלל, הוסיף חומר והוכחות תאורטיות יותר משנים קודמות.\n\nשם המתרגל/ת: נעמה\\איגור\nחוות דעת - תרגולים: נעמה נחמדה מאוד, תרגולים סבבה. איגור קצת זורק על הסטודנטים, לא עונה במייל ואף פעם לא מעלה את הקבצי הרצאות למודל למרות שביקשו ממנו כמה וכמה פעמים.\n\nשעורי הבית:  עמוסים מאוד, ולא פשוטים. כשלוקח חמש או שש שעות לאמן מודל אז ההתקדמות היא איטית והתרגיל לא קצר.\n\nהמבחן:  עוד לא היה, לפי השמועות הוא יהיה תיאורטי מאוד (אף אחד לא הצליח לעקוב אחריו בהוכחות של הסמסטר) וזה לא יהיה קליל כמו בשנים קודמות.\n\nהשורה התחתונה:  עמוס, פחות מומלץ, עדיף לעשות תקורס המקביל במדמח", "timestamp": 1656405693860}, {"author": "null", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: מבולגנות אבל בסה\"כ מעניינות, הביא גם דוקטורנטים שלו שהעבירו חלק מהתכנים. ההרצאות המתמטיות היו קשות להבנה אבל לא היו הרבה מהן\n\nשם המתרגל/ת: נעמה/איגור\nחוות דעת - תרגולים: מתרגלים מעולים, מסבירים מעבר למצגות וידעו לענות על כל שאלה שנשאלה. \n\nשעורי הבית: 3 תרגילים לא קשים בכלל. \n\nהמבחן: אחד המבחנים הקלים שהיו לי בתואר. היה מתמטי אבל ברמה ממש סבירה. \n\nהשורה התחתונה: קורס מעולה לא משנה מה יגידו אל תקחו את של מדמח", "timestamp": 1658941558608}, {"author": "לא לקחת!!", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: תמיר חזן \nחוות דעת - הרצאות: מרצה פשוט ביזיון. זורק על הסטודנטים באופן ניכר וברור. מגיע לא מוכן ופשוט לא מעניין אותו כלום. זורק כמה מילים על כל נושא לא נכנס לעומק ולא מסביר כלום כמו שצריך.  אי אפשר ללמוד ממנו כלום, חבל על הזמן של ההרצאות פשוט מיותר, לראות הכל ביוטיוב. מסיים הרצאות לפני הזמן סתם כי פשוט אין לו כוח.\n\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: כל המתרגלים היו עם יחסי אנוש טובים אבל לא טובים מקצועית. גם להם לא היה אכפת כל כך מהסטודנטים.\n\nשעורי הבית: זורקים אותכם למים ובהצלחה.\n\nהמבחן: מביך בקטע טוב, רמה פשוט נמוכה ללא כל חשיבה או משהו יצירתי\n\nהשורה התחתונה: לא ראיתי קורס כזה הזוי עם סגל ביזיוני וארגון גרוע", "timestamp": 1659826605719}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "בפורמט שהיה בסמסטר הזה, הקורס היה פשוט ביזיון. תמיר לא לימד כלום ושום דבר, נטו התעקש להוכיח דברים על הלוח וטעה כל מעבר שני במקום להשתמש במצגת, ואפילו הפסיק הוכחות באמצע (!) ועבר לנושאים אחרים. פשוט לא ייאמן איך אפשר לדבר על כלום ושום דבר במשך סמסטר שלם. הקשר בין חומר הקורס ללמידה עמוקה מקרי בהחלט. לקראת הלמידה למבחן - שעת קבלה הייתה רק כשטרחנו להזכיר לרכזים האקדמיים שהסגל פשוט לא שם עלינו. תרגילי הבית לא כל כך קשים אבל די כבדים ומעיקים, היו רק שתי הגשות ובאחת מהן הורגש שהסגל פשוט רוצה שנעשה ניסויים בנושא שבכלל לא למדנו עליו - הפנו אותנו לגיט קיים וביקשו שנשתמש במימוש קיים ונדון עליו בלי שלמדנו את הנושא של התרגיל.\nבקיצור - לא מומלץ. אם כל כך דחוף לכם להכיר את התחום עדיף לעשות את זה עצמאית או דרך קורסים אחרים, כי הקורס הזה הוא פשוט בזבוז זמן מוחלט", "timestamp": 1676374826756}, {"author": "אחד שיודע", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "אם תמיר חזן מלמד - לברוח ולא לקחת !\nהקורס הכי בזיוני שלקחתי בכל התואר.\nבן אדם שלא סגור על החומר וכל מעבר מתמטי שהוא עושה פשוט לא נכון.\nבנה מבחן ש3 סעיפים התבטלו בו כי החומר לא נלמד בקורס!!! פקטור של 23 נקודות ניתן לציון המבחן כאילו זה שיטות אלגבריות אלוהים.\nבושה וחרפה ואני מקווה שהפקולטה תפנים שאם היא רוצה להיות פקולטה נחשבת היא חייבת דחוף לתקן את העוול הזה.", "timestamp": 1677148169603}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: אני חושב שתמיר מצקוען ומלמד סבבה כשהוא יודע מה הוא רוצה ללמד. אבל בוא מבולגן בטירוף, שוכח מה הוא רוצה ללמד ואיך זה בכלל קשור לקורס, אין מצגות ולא כיף\n\nשם המתרגל/ת: איתי \nחוות דעת - תרגולים: לא היו תרגולים, שבעייני זה בזיון\n\nשעורי הבית: ביטלו את הת.ב. האחרון בגלל שהשני היה כל כך לא פציר הוסיפו הארכה על גבי הארכה, לא לימדו את הפן התכנותי בכלל בקורס אך התרגילי בית היו תכנותיים, ובכלל ביקשו דברים שממש לא היו קשורים לכלום, הכל מגוגל.\n\nהמבחן: שאל על דברים שהוא לא לימד, שינה לחלוטין סעיפים אחרי שהבין שלא היו פתירים ולא הוסיף זמן למבחן. לא היו הערות על הסריקות ולא נתנו אפשרות לערער אז מרגיש שמאד הגרילו ציונים. \n\nהשורה התחתונה: התבסאתי מאד על הקורס. זה אמור להיות אחד הקורסי דגל של הפקולטה, קורס יסודי וחשוב, אבל בקושי למדנו למידה עמוקה, וההתנהלות לאורך כל הסמסטר ובמיוחד סביב המבחן היה כל כך בזיוני, דברים שלא ראיתי עד עכשיו בתואר, ובפקולטה לחלטות ראיתי הרבה מאד דברים ביזיוניים.", "timestamp": 1678775846071}]}