{"posts": [{"author": "שליחי הדודה", "difficultyRank": 3, "generalRank": 1, "semester": "201902", "text": "שם המרצה: רועי רייכרט\nחוות דעת - הרצאות: שולח לראות הרצאות מהאינטרנט באנגלית. לא מלמד כלום. מרצה עצלן לא מתחשב לא עושה פגישות עם הסטודנטים בכלל. מרצה גרוע.\n\nשם המתרגל/ת: חן בדלר\nחוות דעת - תרגולים: מתרגלת פשוט גרועה. לא יודעת את החומר בעצמה. לא עונה לשאלות ולא מבינה שאלות ששואלים אותה. בודקת את השב בצורה קטנונית ולא מקצועית. התרגולים שהיא עשתה היו קצרים ורק יצאה ידי חובה.\n\nשעורי הבית: שני שב די ארוכים, לא קשים במיוחד אבל לומדים לבד את החומר כי צוות הקורס גרוע.\n\nהמבחן: בוחן אמצע קל. יש פרוייקט סופי במקום מבחן. הבדיקה שלו מאוד קטנונית ולא מקצועית ורצינית. מרצה גרוע ולא מתחשב בכלל גם בבדיקה.\n\nהשורה התחתונה: קורס גרוע לומדים הכל לבד. צוות קורס נוראי ולא מתחשב. את כל החומר של הקורס לומדים גם ככה בקורסים אחרים ולכן הוא מיותר.", "timestamp": 1602499032096}, {"author": "---", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: הרצאות משעממות בטירוף. הוא נתן לראות 2-3 שעות כל שבוע כ\"שיעורי בית\" (למרות שהיו שיעורי בית בנוסף) של הרצאות לא מובנות מקורסים אחרים ואפילו מאוניברסיטאות אחרות בחו\"ל, לא נתן לשאול אותו שאלות במהלך ההרצאה הפרונטלית שלו ככה שגם אם ראית, לא הבנת ואין לך מה לעשות עם זה.\nבמהלך ההרצאות הוא עבר על שאלות ואי אפשר כמעט להבין מה הוא אומר, היה מקליט באיכות נמוכה כל כך כדי שכל מי שלא איתו בלייב לא יכול בעצם לקחת את הקורס. \n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: המתרגלת יודעת להקריא מהדף ולכתוב את מה שמודפס לה בכתב גדול על הלוח. \n\nשעורי הבית: היו 2 תרגילי בית ממש ארוכים ובהרבה מאוד מעל לרמה שלמדנו את החומר (אם הבנת משהו ממה שנלמד).\n\nהמבחן: אין מבחן יש פרויקט סיום, בלי שום הכוונה, הוראות מצומצמות ל3 עמודים לפרוייקט גדול שאין לך מושג מה מתכוונים שתעשה.\n\nהשורה התחתונה: כל הקורס היה מנוהל בצורה מזעזעת ועצלנית. עובדים ממש קשה בשביל 3.5 נקז 7-8 שעות כל שבוע לא כולל תרגילי הבית ופרויקט במהלך חופשת סמסטר. מרצה שזורק ומתרגלת שעושה הכל כדי להתחמק מלתרגל.", "timestamp": 1629705170384}, {"author": "סטודנט ממורמר", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: \nהוא עשה כיתה הפוכה. נתן לראות שעתיים-שלוש שעות (!!) הרצאה מוקלטות של רועי רייכערט ואז בכיתה פתר שאלות על החומר, כמובן שהוא ציין שזה רלוונטי לבוחן האמצע התקף. (אה כן, יש בוחן אמצע תקף.). \nאישית לא הלכתי לכיתה חוץ מהקלטה אחת שהיה ממש חייב לראות על VC ואפשר להצליח בו גם בלי ללכת לכיתה ההפוכה.\n*הבוחן אצלנו הפך למגו\n**היו הרצאות סטודנטים ומי שהרצה קיבל בונוס 2 נקודות לסופי או משהו (קצת מתחרט שלא עשיתי)\nשם המתרגל/ת:  חן בדלר\nחוות דעת - תרגולים: \nהייתה דיי טובה בסה\"כ אם כי יש כאלה שפחות התחברו. \nשעורי הבית: \n2 תרגילי בית ממוחזרים\nפרויקט סופי, אתם בוחרים את הנושא והוא צריך להיות קשור לחומר הקורס. נכון לעת כתיבת שורות אלו אין ציון על הפרויקט.\nהמבחן: \nהיה בוחן אמצע אבל זהו.\nהשורה התחתונה: \nאפשר ללמוד במקומות אחרים אבל הפרויקט הוא אחלה הזדמנות להעמיק", "timestamp": 1634754492382}, {"author": "ג", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: כוונותיו של תמיר כנות וחיוביות, הוא רוצה שנבין ולתת לנו את הכלים להצליח, אך מודע לכך שצורת ההוראה אינה מיטבית והרבה חומר פשוט לא מובן לסטודנטים\n\nשם המתרגל/ת: איתי גת\nחוות דעת - תרגולים: סבלני וענה על כל השאלות\n\nשעורי הבית: מאתגרים במיוחד כי החומר בשיעורים לא הכי מובן ואז קשה ליישם בשיעורים\n\nהמבחן: הפך לנו לעבודה שטרם התחלנו אותה\n\nהשורה התחתונה: צוות אדיב שרוצה בטובתנו אך החומר לא מובן במהלך הסמסטר, נופלים קצת אסימונים בסוף שחוזרים על כל החומר", "timestamp": 1644135069130}, {"author": "Null", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: \nתמיר חזן הוא בן אדם נחמד וחביב אשר בסופו של דבר ידאג לכך שהממוצע לקורס יהיה טוב, אך אם הגעתם לקרוס בשביל ללמוד משהו ולא בשביל הממוצע כדאי שתוותרו. תמיר אומנם מכיר באופן סביר את החומר שהוא מעביר אך בגלל שהחומר מסובך ותמיר לא מתכונן (בכלל) לפני ההרצאות לא מבינים כלום ממה שהוא מסביר (אבל כלום לגמרי, בהרצאות של איתי אריאלי מבינים יותר). הוא נתקע בהוכחות ולא יודע איך להמשיך ואומר שהוא ישלים את ההוכחה שיעור הבא ולא משלים אותה. מרגיש כאילו רוב הסגל בעצמו לא מבין את החומר הנלמד, אני לא מאשים אותם, החומר באמת מסובך אבל זה מביך \n\nשעורי הבית: \nלא כאלה קשים אם לומדים מהאינטרנט, סך הכל החומר הנלמד מאוד מסובך אבל השאלות קלות מאוד ובסיסיות. ידע בסיסי ממש בPytourch\n\nהמבחן: \nהיה פרוייקט\n\nהשורה התחתונה: קורס בשביל הממוצע, אם הגעתם בתקווה ללמוד כדאי לכם להחליף קורס (או לפחות לא להיות עם תמיר חזן) הנקודות אור היחידה היא ידע בסיסי ב-Pytorch ומבואות מאוד מינמלים (עד כדי מל\"ג) לכל מיני נושאים מעניינים שקשורים ב-ML וDEEP-LERANING", "timestamp": 1644159627040}, {"author": "אלמוני", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: \nבתור מורה ההרצאות שלו לא הכי ברורות, מתבלבל הרבה בנוטציות שמלחתכילה לא כלכך ברורות ועקביות אבל באופן כללי החומר מעניין מאוד ותמיר מעביר את השיעורים בכיף.\nמוקדש 3 שעות במערכת אבל הוא משתדל לסיים בגג שעתיים שזה תמיד נחמד והוא סופר מתחשב בכל מה שנוגע לציונים וצרכי הסטודנטים.\n\nשם המתרגל/ת: הדר סיני\nחוות דעת - תרגולים: \nמתרגל ממש אחלה, חזק מאוד על החומר ומאוד מאוד עוזר ועונה לשאלות. מעביר תרגולים בצורה מאוד נחמדה. מומלץ מאוד.\n\nשעורי הבית: \nאצלנו היו 4 תרגילי בית שכללו גם הוכחות מתמטיות וגם כתיבה של קוד, הכתיבה של הקוד לרוב יכולה להיות מועתקת מהתרגולים כמעט במלואה אבל למי שרוצה להכיר PyTorch אז מומלץ לנסות לעשות לבד.\nההוכחות המתמטיות ברמת קושי בינונית פלוס.\n\nהמבחן: \nלא היה מבחן, היה פרויקט כהערכה חלופית למבחן.\nצריך לבחור מאמר מתוך רשימה של מאמרים שניתנו לנו מהסגל שקשורים לנושאי הקורס ונדרש להסביר אותם בצורה מפורטת ולבחור האם ליישם את העקרונות של המאמר בעצמך או להציע הצעות לשיפור למאמר.\nפרויקט ממש אחלה אם הצלחת לתפוס מאמר סבבה.\n\nהשורה התחתונה: \nלאורך הסמסטר הקורס לא כלכך מובן ומרגיש שעסק בנושאים שהיו יכולים להיות הרבה יותר מובנים אם היינו באים אם הרקע המתאים, אבל סה\"כ מאוד מעניין וקורס של תמיר בד\"כ מסתיים עם ציון טוב.", "timestamp": 1644951434912}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: \nהרצאות בסדר אקראי עם נושאים שמעניינים אותו. זה היה נחמד כי נתן היכרות לנושאים רבים.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nסבירים\nשעורי הבית: \nביחידים, סהכ סבירים אבל לא קלילים\nהמבחן: \nהיה פרויקט, סיכום ואימפלמנטציה של מאמר. כיף וציונים טובים\nהשורה התחתונה:", "timestamp": 1653397368958}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: הרצאות מאוד מבולגנות, המצגות לא מוכנות עד הסוף, יש המון טעויות. קשה מאוד לעקוב. יחד עם זאת בעל יחסי אנוש טובים ומוכן לענות על כל שאלה. \n\nשם המתרגל/ת: הדה\nחוות דעת - תרגולים: היא מקסימה, מעבירה את החומר שצריך לדעת מהמצגות, היא שקטה מאוד אז לפעמים קצת קשה לעקוב אך תמיד פנויה לחידודים ושאלות. בדרכ אחרי התרגולים הבנתי יותר טוב את החומר. \n\nשעורי הבית: 3 תרגילים שהיו לנו לאורך הסמסטר. לא קשים במיוחד אפשר להעזר בתרגולים, ובפתרונות קיימים באינטרנט. \n\nהמבחן: המבחן מאוד תיאורטי בדרכ רוב הדברים כתובים בתוך דף הנוסחאות. היו המון טעויות במבחן ותיקונים. קצת מתסכל.\n\nהשורה התחתונה: תגיעו להרצאות ותנסו כמה שיותר לכתוב ולהבין. לדעתי עדיף לבקש מתמיר לעבור לכתוב על הלוח ולא מצגות.", "timestamp": 1675762067942}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: הרצאות מבולגנות מאוד לרוב. לא סגור על עצמו מבחינת האם לכתוב על הלוח או האם להקריא את ההוכחה מהמצגת (שמלאה בנוטציות מבלבלות וטעויות). עונה על כל השאלות ומשרה אווירה טובה בהרצאה אבל הקורס יכל להיות ברמה הרבה יותר גבוהה אם ההרצאות היו קצת יותר רציניות ורשמיות.\n\nשם המתרגל/ת: איתי גת\nחוות דעת - תרגולים: מתרגל שיודע את החומר בצורה טובה. התרגולים חצי תיאורטיים וחצי פרקטיים עם מחברת וקוד.\n\nשעורי הבית: 3 תרגילי בית שמהווים 30 אחוז מגן. הקוד לוקח קצת זמן למי שלא בא עם רקע של deep או לוקח קורס שמתעסק בנושא במקביל אבל לא נורא זה להעתיק מהתרגול את הבסיס ולבנות מעליו. השאלות התיאורטיות לא קשות בכלל.\n\nהמבחן: פינוק של מבחן בהנחה ויש לכם דף נוסחאות עם כל החומר. 2 שאלות שכמעט כל הניקוד שלהן זה להקיא מהדף נוסחאות ו2 שאלות של יותר חשיבה עצמאית. בחירה של 3 שאלות מ4. מבחן עם תמיר - תכניסו את כל הקורס כולל כל הפיתוחים הקטנים בתרגולים וההוכחות מההרצאה לדף ואתם מסודרים עם 90+ מובטח.\n\nהשורה התחתונה: הסמסטר הכניסו את כל החלק הפרקטי של הקורס למידה עמוקה אבל תרגילי הבית לא היו ברמה גבוהה בכלל. הקורס באופן כללי נוהל בצורה לא טובה בעיניי אבל חייב לציין לשבח את הדה המתרגלת שכן הייתה קשובה לנו וניסתה לתת מענה לבעיות שצצו. מקווה שהפקולטה תעשה סדר במערב הפרוע של תמיר.", "timestamp": 1676047410700}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: לא מובנות\n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: לא מועילים\n\nשעורי הבית: סבירים\n\nהמבחן: פעם היה אחלה, היום יותר תיאורטי וקשה \n\nהשורה התחתונה: החומר מאוד מעניין, חבל רק שמלמדים אותו ככה. אם לא חובה - לא מומלץ", "timestamp": 1676728186886}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: מבולגנות ולא לגמרי ברורות, אבל עונה על שאלות במידה ויש (אם מצליחים להבין מה לשאול)\n\nשם המתרגל/ת: הדה \nחוות דעת - תרגולים: מקסימה ומסבירה כל מה ששואלים\n\nשעורי הבית: היו שלושה תרגילים במהלך הסמסטר, כן לקחו זמן והשקעה.\n\nהמבחן: במהלך המבחן התגלו טעויות בטופס הבחינה (כמעט בכל שאלה), ונתנו לכולם חצי שעה נוספת בגלל כל הטעויות.\nבפועל, עם דף נוסחאות מספיק טוב מאוד קל לקבל ציון גבוה.\nהבדיקה הייתה מאוד מקלה - אפשר לראות לפי ההתפלגות ציונים.\n\nהשורה התחתונה: קורס עם ממוצע גבוה, תמיר מתפאר בממוצעים הגבוהים שלו אבל בתכלס- לא מלמד המון.\nאם הנושא מעניין אתכם, מומלץ ללמוד מעבר - לקרוא על החומר או לראות סרטונים נוספים להסבר . (רוב הקורס מבוסס על קורס של סטנפורד שעובר ברמה משמעותית גבוהה יותר).", "timestamp": 1676828317124}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: מאד מבולגן אבל אווירה טובה, מקשיב לסטודנטים ומקצוען, גם אם לא הכי ברור. \n\nשם המתרגל/ת: איתי/הדה\nחוות דעת - תרגולים: מבחינת מקצועיות ורמת הוראה, איתי ממש טוב, אבל בלי הדה כל הקורס היה קורס כמו בעמוקה\n\nשעורי הבית: 3 תרגילים עם שאלה ריבשה ושאלות רטובוץ תרגילים לא הכי ברורים וכבדים, אבל יש רק שלושה, והאחרון היה יותר קצר\n\nהמבחן: דף נוסחאות טוב = ציון טוב. מבחן פשוט ולא דורש המון השקעה\n\nהשורה התחתונה: הקורס עבר שינוי הסמסטר - נהיה קורס בלמידה עמוקה ולא כל כך קשור לקורס בשנים קודמות, אז הוא קורס חשוב, ובאמת סבבה.", "timestamp": 1678695988326}, {"author": "אורן יודע 150 ספרות של פאי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: איש טוב עם כוונות טובות, אבל המרצה הכי פחות טוב בפקולטה. הוא אומנם יודע את החומר, אבל לא יודע ללמד, המצגות מבולבלות, סדר הנושאים לא ממש ברור, ובגדול מבזבזים את הזמן בלי ללמוד כלום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחנים של תמיר עם ממוצע יחסית גבוה\n\nהשורה התחתונה: מאוד לא מומלץ למי שרוצה ללמוד למידה עמוקה, שזה אחד הנושאים החשובים בתואר. בדיעבד הייתי לוקח את הקורס \"למידה עמוקה\" של חשמל, עליו יש חוות דעת מעולות. הממוצע אמנם קצת נמוך יותר, אבל בעיניי לגמרי שווה ללמוד באמת חומר ולא לבזבז זמן על כלום במהלך סמסטר", "timestamp": 1711398222623}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: תמיר אחלה בנאדם אבל מרצה לא משהו. הוא מאוד מבולגן וקשה להבין אותו ולעקוב אחרי ההוכחות שהוא מעביר, וכשהרוב המוחלט של הקורס הוא מתמטיקה כבדה מאחורי מודלים, די מהר מאבדים אותו. יחד עם זאת, היה ניכר שאכפת לו, הוא כן עונה על שאלות ויש לו קטעים שהוא מסביר סבבה (גם אם זה לא עקבי). מבחינת יחס לסטודנטים, הייתי שמח שמרצים אחרים בפקולטה היו מאמצים את הגישה שלו.\n\nשם המתרגל/ת: זיו תמיר\nחוות דעת - תרגולים: זיו תותח על! עזר מאוד להבין את החומר שלכולם התפספס בהרצאות של תמיר, העביר את התרגולים מעולה והיה חד על שאלות. עשה עבודה מצוינת.\n\nשעורי הבית: שלושה תרגילים, יש קצת חלקים יבשים אבל הרוב רטוב. בעיקר עבודה עם PyTorch ומימוש המודלים שנלמדים בכיתה. לא משהו מורכב מדי אחרי שלומדים קצת לעבוד עם Torch, שזה מאוד חשוב לכל מי שהולך להתעסק ברשתות נוירונים, אז מהבחינה הזאת ממש עושים את העבודה שלהם ומלמדים את התכלס.\n\nהמבחן: היה קצת בולשיט וקשה יותר משנים קודמות, הרבה שאלות שדורשות הבנה ואינטואיציה שלאו דווקא היו עליהן דגשים. אחת מהשאלות הייתה ממש לשחזר הוכחה שתמיר עשה בהרצאה, ככה שמומלצת להכניס את ההוכחות ואת עיקרי הדברים לדף נוסחאות. \n\nהשורה התחתונה: תכלס הקורס די מעפן אבל כן לומדים Deep Learning ונוגעים קצת בGenAI, למרות שכנראה למידה של הנושאים האלה מקורסים באינטרנט הייתה יותר טובה. תכלס אם תמיר היה קצת יותר מסודר הקורס היה קופץ בכמה רמות.", "timestamp": 1713730154434}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: תמיר בן אדם חמוד שמאוד מבין בחומר אבל ההרצאות לא טובות. בהרצאות הראשונות שעוסקות ברשתות נוירונים הרגיש שהוא פשוט העביר שקפים, התלהב מתרשימים שהיו בשקף, ואמר לנו ״איזה יפי! זה עובד!״. אני אישית הבנתי את הנושאים בחלק זה מהקורס שיטות בעיבוד שפה טבעית שעשיתי במקביל. בחלק השני של הסמסטר הוא השתמש במצגות שנבנו מתישהו עם הוכחות מתמטיות שנעו בין הרבה יותר מידי מתמטיקה בשקף להרבה מעט מידי. הוא בדרך כלל הוסיף או כתב מחדש את ההוכחה על הלוח. לפעמים הוא חשב שהוא שכח משהו בשקפים, כתב הוכחה מלאה על הלוח ואז גילה לאחר שני שקפים שמה שהוא הראה מופיע, כלומר הוא לא עבר על ההרצאות לפני. כן אציין שהוא ענה לכל שאלה ששאלו בהרצאות והיה מאוד נחמד אלינו, פשוט קצת זלזל בהוראה של המקצוע\n\nשם המתרגל/ת: זיו תמיר\nחוות דעת - תרגולים: מתרגל טוב, עזר להבין דברים שהיו לא מובנים בכלל בהרצאה\n\nשעורי הבית: 3 תרגילי בית כל אחד 10%, כולל נקודות בונוס בראשון. בודקים בקפדניות אבל אין בעיה להוציא ציון גבוה. דורש קצת עבודה אבל לא יותר מידי עבודה.\n\nהמבחן: בהרצאה האחרונה תמיר הסביר לנו שעל מנת לשמור על ממוצע גבוה, עבור כל תשובה, אם יש משהו קצת קשור לתשובה הוא נותן את רוב הנקודות. הוא המליץ לכתוב משהו כתשובה לכל שאלה ובשום פנים ואופן לא להשאיר ריק כי אז הוא לא יכול לתת נקודות. על פי הביקורות משנה שעברה היה כתוב שעם דף נוסחאות טוב אפשר לקבל ציון טוב. אז השתמשנו בדפי נוסחאות שכללו את כל החומר. בסוף הם לא עזרו כמו שחשבנו והיה מבחן עם שאלה אחת שהתבססה על הוכחה מסוימת מההרצאה שהייתה בדף נוסחאות ו3 שאלות קשות - היה צריך לבחור רק 3 שאלות כך שלא כל כך נורא. בסוף מה שכנראה הציל אותי היה שהקשבתי להמלצה של תמיר. עכשיו קיבלנו ציונים אז עוד לא ראיתי את הסריקה אבל יצאתי מהמבחן בתחושה שאני נכשל והוצאתי מעל 90 (עם פקטור) אז אני מניח שכמו שתמיר אמר ״איזה יופי! זה עובד!״\n\nהשורה התחתונה: קורס חשוב מאוד בתואר שאחריו בגדול מתמקצעים בלמידת מכונה ומכירים את המודלים החשובים. חבל שההרצאות מועברות בצורה מבולגנת ובעייתית", "timestamp": 1713731081351}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: \nמרצה לא משהו אבל פגשתי מרצים יותר גרועים בפקולטה. חייב לציין שגם מבחינת הסילבוס הנושאים מעניינים וחשובים. אם היו עוברים על המצגות ומתקנים את הטעויות המתמטיות רמת הקורס הייתה עולה.\nשם המתרגל/ת: זיו תמיר\nחוות דעת - תרגולים: \nמתרגל מעולה, מאוד עוזר לקבל זווית שונה על הנלמד בהרצאה \nשעורי הבית: \nלטעמי די עמוסים וחופרים ודי מחפשים על מה להוריד אבל זה הגיוני בהתחשב בזה שהם 30 אחוז\nהמבחן: \nהיה לנו מבחן די קשה וחריג בהיסטוריה של הקורס אבל לא משהו לגמרי לא סביר וגם פיקטרו \nהשורה התחתונה: \nלדעתי אם לומדים את הקורס בתוספת סרטונים מהאינטרנט אפשר לדעת deep בצורה די טובה ובהתחשב בביקורות משנים קודמות חל שיפור בקורס אבל בלי למידה עצמית אי אפשר ללמוד בקורס הזה משהו.", "timestamp": 1713763514589}, {"author": "עייפתי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה בתאוריה: תמיר חזן\nחוות דעת - הרצאות: כולם מדברים כאן בחוות דעת על זה שתמיר אחלה בחלה של בחור, אני מסכים שמורגש ש\"אכפת לו\" מהסטודנטים בגלל שהוא מדבר בגובהה עיניים, אבל אני רואה את זה בדרך אחרת, האם למרצה שלכם באמת אכפת ממכם אם הוא בעצמו קורא את המצגת להרצאה של 3 שעות ביחד איתכם תוך כדי ההרצאה? כשהוא בעצמו לא בטוח לפעמים על מה הוא מדבר ומספק בעיקר חומר שהוא שווה ערך לאיזה טיקטוקר שעושה reaction content על השקופיות? \"זה ממש מגניב, זה עובד!\" \"זאת הייתה תקופה שהטרנד היה בה להמציא פונקציות אקטיבציה, צחוקים\" \"אחלה שקופית, סבבה\". ניכר כי תמיר כן בקיא בחומר, חבל שאתם ככל הנראה לא תהיו אם תלכו רק להרצאות.\n\nשם המתרגל + מרצה בפועל:  זיו תמיר\nחוות דעת - תרגולים: זיו היה האור בקורס החשוך הזה. על זיו נפלה העבודה הקשה של להרים את הקורס בתרגול של שעה אחרי שלוש שעות של שלשול מילולי מתמיר. הוא יצא מדרכו כדי לנסות לגרום לקורס הזה לעבוד, מלסדר שקופיות, לספק מענה זריז לשאלות ועד ללהשאר עם הסטודנטים הרבה מעבר לשעות שהיה צריך כדי לעזור ולהתעמק בחומר יותר. העביר את החומר בצורה הכי טובה שניתן בהינתן המצב עם תמיר ותמיד הגיע מוכן לתרגולים.\n\nשעורי הבית: לא קשים, לא קלים, כל המטרה של הקורס לדעתי הייתה אמורה להיות בלהתעסק בידיים עם החומר וזה אכן קרה בשעורי הבית, לא מספיק אבל יש בעיות רציניות יותר בקורס.\n\nהמבחן: ביחס למבחני עבר היה קשה יותר (בהרבה), לא הייתי אומר שלא פתיר אבל ההיסטוגרמה מדברת בעד עצמה (הציונים הם אחרי פקטור), חלק מהסטודנטים קיבלו פקטור של 20 נקודות אם בחרו את השאלות שפקטרו, אחרים קיבלו פחות, פקטור מוזר שלא ברור למה חושב בצורה שבה חושב.\nתמיר דיבר המון על זה שפשוט לקחת את כל ההוכחות יעזור המון במבחן, בפועל נגעתי בדף הנוסחאות פעם אחת בדיוק בכל המבחן.\n\nהשורה התחתונה: בפועל, לומדים לבד את החומר ומקווים שזיו יכוון אותכם למה שרלוונטי יותר בקורס, חבל שזה המצב כשחומר הקורס הוא פרקטית הבסיס להמון תחומים שרלוונטים לרוב הסטודנטים בפקולטה.\nבתכלס, ההתנהלות של תמיר לא מכבדת לא אותכם בתור סטודנטים שרשומים לקורס הזה ולא אותו בתור מרצה\\חוקר בפקולטה, שזה פשוט מביך, אבל לא מפתיע בפקולטה הנהדרת הזו. אם תמיר מעביר את הקורס הזה, לא הייתי ממליץ לקחת אותו (אלא אם כן זיו מתרגל בו).", "timestamp": 1713885113636}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: כמו שאמרו הרבה, נראה לתמיר אכפת מהטודנטים, אבל חבל שההרצאות שלו כאלה גרועות. נראה שהוא מסתכל איתנו פעם ראושנה על המצגות של ההרצאה (שבעצמן ממש גרועות), ומלא זמן מההרצאות הוא פשוט מדבר על דברים שבאמת לא חשובים או מוכיח מלא זמן איזה משפט. לדעתי לא צריך להגיע להרצאות, במיוחד שכמעט ולא לומדים משהו שלא תלמדו בתרגול/אינטרנט\n\nשם המתרגל/ת:  הדה אינדלמן\nחוות דעת - תרגולים: מתרגלת אחלה, קצת יבשה אבל בסדר סך הכל. ראיתי את ההקלטות והייתי ממש בסדר.\n\nשעורי הבית: 3 ש\"ב במהלך הסמסטר, כאשר בכל אחד מהם יש איזה חלק יבש, ורוב הש\"ב זה תכנות.בעיקרון פשוט מתכנתים כל מיני מודלים שלמדנו במהלך הסמסטר, והרבה מאוד מהקוד שצריכים לכתוב נמצא כבר בתרגולים אז זה יחסית בסדר. בתרגיל השני הם ביקשו שנעשה משהו שלא כל כך למדנו בקורס (ייצוג של מילים כוקטורים), ומי שמקבל עיבוד שפה טבעית ידע מה לעשות אבל השאר היו צריכים לחפש איך לעשות את זה לבד.\n\nהמבחן: שונה מאוד ממבחני עבר. המועד א שלנו היה מאוד טכני, עם מלא הוכחות ומתמטיקה רנדומלית כזאת. נתנו פקטור יחסית גדול ולכן הממוצע עוד נראה סביר.  צריך לחרוש את החומר ולהבין מאוד את הדברים. \n\nהשורה התחתונה: קורס חשוב מאוד מהבחינה שכנראה זה פעם ראשונה שתילמדו על נושאים חשובים ב-ML, שבאמת רלוונטים לחיים האמיתיים, רק חבל שההרצאות מועברות בצורה כל כך גרועה, ואת רוב החומר באמת הבנתי מעיבוד שפה טבעית שמיקבלתי תוך כדי. בסופו של דבר פשוט צריך ממש להשקיע לפני המבחן ולקוות לטוב", "timestamp": 1714032309191}, {"author": "\"תחליף את D בקדוש ברוך הוא\"", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: תמיר\nחוות דעת - הרצאות: כתבו פה הרבה לפניי על תמיר, אז רק אסכם ואומר שהוא באמת אחלה בן אדם, אבל כמרצה הוא ממש לא משהו. יש אווירה ממש טובה ואחלה בדיחות (למרות שלא תמיד יודעים אם לצחוק או לבכות), אבל ללמד זה לא הצד החזק שלו. וזה שרוב המצגות בנויות על הפנים לא עוזר לעניין.\n\nשם המתרגל/ת: הדה וזיו\nחוות דעת - תרגולים: שניהם מצוינים. בתרגולים אפשר אשכרה להבין את החומר.\n\nשעורי הבית: 3 תרגילים, כל אחד 10% מהציון. בכל תרגיל יש חלק יבש שאפשר למצוא לו בדר\"כ תשובות באינטרנט, ואת הרטוב, שהוא מימוש של מודלים שראינו, אפשר לעשות די בקלות עם קוד מהתרגולים ו-GPT. הבדיקה הייתה קצת קטנונית, אבל סך הכול אין תלונות.\n\nהמבחן: שנה שעברה כתבו פה שהמבחן היה הזוי במובן הטוב של המילה. השנה הוא היה הזוי במובן הרע של המילה. אם משווים את המבחן של שנה שעברה למבחן של השנה, זה כמו בגרות 3 יחידות במתמטיקה מול 5 יחידות. אני אישית יצאתי מהמבחן בתחושה ש-50 יהיה נס, בסוף קיבלתי מעל 80. הסיבה היא שמעבר לפקטור, הבדיקה הייתה סופר דופר אקסטרה רחמנית. האמת העצובה היא שחרטטנים טובים יכלו להוציא אחלה ציון, כי גם אם הקשר בין התשובה למציאות היה מקרי בהחלט נתנו את רוב הנקודות. שלא נדבר על זה שהיה מותר להכניס רק דף נוסחאות אחד, שצריך לדחוס אליו את כל הקורס עם כל ההוכחות המסורבלות שבו (וזאת מכיוון שתמיד יש שאלה של להוכיח משהו מההרצאות). כואבות לי העיניים רק מהמחשבה עליו.\n\nהשורה התחתונה: עוד ביזיון מבית היוצר של הפקולטה למדעי התיונים והחליטות. ועוד בקורס דגל. מי שממערכות מידע ושוקל לקחת את שרשרת למידה חישובית - שיחשוב פעמיים אם זה שווה את זה לאור הביקורות פה. באמת שעדיף ללמוד את החומר עצמאית או בפקולטה פחות ביזיונית.", "timestamp": 1715701289107}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: תמיר חזן\nחוות דעת - הרצאות: נראה שלתמיר אכפת מהסטודנטים אבל המצגות ממש לא מסודרות והוא לא סגור בכלל על מה קורה שם, לרוב הוא קורא את המצגת תוך כדי השיעור ביחד איתנו\n\nשם המתרגל/ת: זיו תמיר\nחוות דעת - תרגולים: סחב את הקורס גרם לכולם להבין מה קורה בקורס וניכר שהשקיע והיה אכפת לו שכולם יבינו מה הולך בקורס\n\nשעורי הבית: די מלמדים ורלוונטיים ולא מאוד קשים וארוכים, יחסית סבבה\n\nהמבחן: המבחן היה יותר קשה משנים קודמות אבל היה תוספת נקודות כמעט לכל שאלה במבחן והבדיקה הייתה יחסית מקילה ככה שהיה אפשר להוציא ציון טוב, בניגוד לשנים קודמות היה צריך באמת להבין את החומר ולא רק להקיא מהדף נוסחאות\n\nהשורה התחתונה: יש הרבה מקום לשיפור בעיקר בסדר וארגון של ההרצאות אבל השיעורי בית מלמדים והמתרגלים טובים", "timestamp": 1717363569045}]}