{"posts": [{"author": "nono", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: הרצאות מעולות ומעניינות\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: תרגולים טובים\n\nשעורי הבית: שלוש הגשות די קלות, לא כמות מוגזמת של השקעה\n\nהמבחן: פרויקט מאוד חופשי ופתוח, יכול להיות מאוד מעניין\n\nהשורה התחתונה: אחלה קורס, מומלץ", "timestamp": 1615995192963}, {"author": "הם מפחדים", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: מרצה מצוין אם רואים אותו לפני שינה. משעמם מאוד. מלמד 4 נוסחאות ב13 הרצאות. התנהלות ביזיונית אין למי לפנות אם צריך עזרה. החזיר ציונים אחרי חצי שנה.\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: סביר +, נחמד מאוד\n\nשעורי הבית: שב קלילים \n\nהפרויקט: קליל\nהשורה התחתונה: קורס שאמור להיות מענין. ההרצאות פח", "timestamp": 1630884818136}, {"author": "-----", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: \nבמהלך הסמסטר המטלות של הקורס מאוד קלילות וקשה היה להבין מה רלוונטי יותר ומה רלוונטי פחות מההרצאות. ההרצאות עצמן יכולות להיות מעניינות ויכולות להיות טיפה פחות מעניינות אבל אורי כמנהל קורס בנאדם אדיב, נחמד ומתחשב.\nכאשר מגיעים בסוף הסמסטר אל הפרויקט המסכם מבינים מה היה רלוונטי יותר ומה פחות ואפשר לחזור אל ההרצאות בשביל להעזר בהם והם עוזרות.\nאורי העביר את השיעורים בזום אבל לא הסכים להקליט.\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: \nמתרגל ממש טוב, יודע את החומר ממש ממש טוב ומעביר בדיוק את החומר שעוזר לפתור את השיעורי בית. התרגולים מפסיקים לאחר אמצע הסמסטר.\n\nשעורי הבית: \n4-5 תרגילי בית (5 באופן רשמית, 4 בפועל כי אחת מהמטלות זה לראות הרצאות מוקלטות ולדווח \"ראיתי\")\nלא קשים בכלל, עוזרים להיות על החומר של הקורס שקל מאוד ללכת לאיבוד בו.\n\nהמבחן: \nאין מבחן, יש פרויקט סופי עם יד מאוד חופשית, בוחרים שאלה מחקרית כלשהי בהקשר של השפעה סיבתית ומנסים להשיג תוצאות. אורי ורום מאוד מאוד עוזרים.\n\nהשורה התחתונה: \nקורס שלא מעמיס באמצע הסמסטר, והפרויקט בד\"כ להגשה אחרי סוף הסמסטר.\nקורס חביב מאוד, סה\"כ מומלץ", "timestamp": 1660387140932}, {"author": "קובי ברק", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: ההרצאות היו בסדר אבל לא משהו יוצא דופן. אפשר היה גם ללמוד את החומר בשליש מהזמן בבית (וזה מצוין שיש הכל ביוטיוב).\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: גם כאן לא היה שום דבר יוצא דופן בדיוק כמו בהערה הקודמת.\n\nשעורי הבית: סבירים, תרגילי הבית לא יוצאי דופן אבל מלמדים במידה סבירה. אין פידבק על תרגילי הבית כלל וזה דיי נראה כאילו הגרילו את הציונים עליהם.\n\nהמבחן: אין מבחן אלא פרויקט, שלוקח לא מעט זמן ומציגים בסשן שנקבע מעט זמן לפני כן. בכל מקרה גם כאן אין משוב כלל.\n\nהשורה התחתונה: הגעתי לקורס עם ציפיה לקורס מעניין ומלמד והציפיות שלי לא נענו. החומר כן מעניין אבל נראה שזה יותר מטלה על סגל הקורס מאשר עניין אמיתי ללמד. חבל כי תקשורת ופידבק זה החלק הכי חשוב בהוראה.", "timestamp": 1664275205542}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: מאוד נהנתי. אוהב את איך שאורי העביר ובגללי קורס מאוד מעניין וחשוב בעיניי\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: סבבה לגמרי, רום מתרגל לעניין ומעביר טוב את החומר.\n\nשעורי הבית: סבבה לגמרי, לא עמוס\n\nהמבחן: אין מבחן, יש פרויקט. הפרויקט מעט עמוס אבל לא מטורף\n\nהשורה התחתונה: ממליץ בחום על הקורס", "timestamp": 1679566866312}, {"author": "נוף", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אורי שליט\nחוות דעת - הרצאות: נחמדות\n\nשם המתרגל/ת: רום גוטמן\nחוות דעת - תרגולים: סבבי, מחדדים את החומר, לא מאוד קריטיים\n\nשעורי הבית: דורשים היכרות בסיסית \\ בסיסית+ עם החומר\n\nהמבחן: פרויקט\n\nהשורה התחתונה: קורס מעניין, ונוח", "timestamp": 1679850106820}]}