{"posts": [{"author": "הדר סיני", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רועי רייכרט\nחוות דעת - הרצאות: עשיתי סמסטר קורונה ולכן היו רק הרצאות מוקלטות (לא של רועי, של אוניברסיטאות אחרות), ההרצאות מורכבות ממספר סרטונים ולרוב לוקחות שעתיים ומעלה, החומר מעניין מאוד.\n\nשם המתרגל/ת: נדב עובד\nחוות דעת - תרגולים: התרגילים של נדב לעיתים היו ארוכים ומייגעים, אך לרוב הם עזרו מאוד בהבנה של החומר ולתת דגש על החלקים הקריטים.\n\nשעורי הבית: שני תרגילים עמוסים ומאתגרים\n\nהמבחן: לא היה \n\nהשורה התחתונה: הקורס עמוס מאוד. החומר מאוד מעניין, וניתנת זווית רחבה על התחום, עוסקים גם במודלים ישנים יותר וגם במודלים חדשים יותר (למידה עמוקה). \nמומלץ לקחת את הקורס אחרי/במקביל לקורס בלמידה עמוקה, מאחר ויש תרגיל בית בלמידה עמוקה ולא מלמדים אותו לעומק.", "timestamp": 1599559965736}, {"author": "הוא מממלך לכו אתם", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: רועי רייכרט\nחוות דעת - הרצאות: מרצה גרוע. לא מלמד כלום זורק להרצאות באנגלית באינטרנט, לא אכפת לו מכלום ולא עושה פגישות עם הסטודנטים בכלל.\n\nשם המתרגל/ת: נדב עובד ואייל בן דוד\nחוות דעת - תרגולים: מתרגל טוב שעוזר להבנה מאוד. התרגולים שלו ארוכים ולא מכילים את כל הידע מההרצאות. גם אייל מצוין ועוזר ומתחשב.\n\nשעורי הבית: מאוד ארוכים וקשים. פרוייקטים שדורשים המון זמן מהסמסטר.\n\nהמבחן: אין יש פרוייקטים ושב יבשים גם לא קלים בכלל עם בדיקה מאוד קטנונית.\n\nהשורה התחתונה: קורס שהחומר עליו הוא בנוי מאוד מעניין. כולל רשתות נויירונים. לא ממליץ לקחת את הקורס כי המרצה הוא לא אכפתי ובכלל לא עוזר ונפגש עם סטודנטים אז ללמוד לבד מהאינטרנט אפשר בלי הקורס הזה. ממליץ למידה של החומר לבד הקורס הוא מעטפת לא הכרחית ומיותרת.", "timestamp": 1602499632935}, {"author": "Michal", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: הרצאות מאוד מעניינות. מרגישים שאייל התכונן והכין את החומר הכי חדש ורלוונטי מהתחום. הוא מאוד ברור, מכיר את החומר על בוריו ומעביר אותו בצורה מובנת מאוד.\n\nשם המתרגל/ת: תומר ועילם\nחוות דעת - תרגולים: התרגולים משלימים את מה שהוסבר בהרצאות עם דוגמאות וקצת קוד, המתרגלים נכונים לעזור וזמינים לענות לכל השאלות. \n\nשעורי הבית: יש בסהכ 4 הגשות. 3 פרוייקטים לאורך הסמטר ופרוייקט אחד גדול בסוף הקורס. הפרוייקטים לא קלים דורשים זמן ומאמץ. יש חלקים תחרותיים בחלק התכנותי. בנוסף בכל תרגיל בית יש גם חלק יבש עם שאלות על התיאוריה שלמדנו. יחד עם זאת התרגילים התכנותיים עוזרים להתנסות עם פתרון בעיות מתחום הNLP ולצבור קצת ניסיון. \n\nהמבחן: אין\n\nהשורה התחתונה: קורס עמוס דורש הרבה השקעה בשיעורי הבית קחו זאת בחשבון אבל מאוד מעניין ושווה את זה.", "timestamp": 1675761734090}, {"author": "-", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "כנראה הקורס הכי עמוס שהיה לי בתואר, תרגילי בית (עם חלק יבש+רטוב) ופרויקט שלוקחים יותר מדי זמן עם בדיקה שלפעמים מרגישה ממש קטנונית, ובנוסף בכל תרגיל יש חלק תחרותי עם אחוז די משמעותי מהציון. *עם זאת* זה הקורס הכי מעשיר שלקחתי, רואים שאייל והמתרגלים (תומר ועילם) שוחים בחומר ומעבירים אותו בצורה מעולה (ובהינתן שלא נתקלתי באף מרצה אחר בפקולטה שיודע להעביר חומר של דיפ בצורה טובה, כנראה שזאת הברירה היחידה אם רוצים ללמוד את הנושא הזה). לקחת רק אם הסמסטר יחסית פנוי, או שאתם בקטע של מזוכיזם.", "timestamp": 1675807459025}, {"author": "מעבד שפה טבעית ומלאכותית", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אייל בן דוד\nחוות דעת - הרצאות: מרצה מעולה.\nמעביר בצורה טובה וברורה חומר מאוד קשה. שולט בחומר ומאוד אכפת לו מסטודנטים.\n\nשם המתרגל/ת: עילם שפירא ותומר וולק\nחוות דעת - תרגולים: התרגולים עושים בעיקר חזרה על מה שאינו בהרצאה. לפעמים הם מראים יישומים של זה דרך מחברות קוד, אבל לדעתי לא מספיק, והתרגולים יחסית יבשים.\n\nשעורי הבית: 3 תרגילי בית עמוסים בצורה פסיכית, כל אחד עם חלק יבש, חלק רטוב ודו\"ח.\nהחלק היבש פשוט משעמם ומרגיש כל כך לא הכרחי לקורס. מכיל שאלות שאפשר לחשוב עליהן כמה שעות, שאלות על דברים שאפשר לענות ברגע על סמך ההרצאה ושאלות חישוביות - לחשב ידנית פלט של רשת נוירונים ועדכון משקולות, שפשוט הרגיש כמו זריקה מצד המתרגלים שבאו בגישה של \"אין להם מספיק מה לעשות, בואו נדחוף להם עוד שאלות\". הייתה גם הוכחת סיבוכיות של אלגוריתם שהייתה מעיקה.\nהחלק הרטוב בכל תרגיל היה פשוט עצום, וכל מטלה הרגישה כמו פרויקט בפני עצמה. יכלת לשבת עשרות שעות רק כדי לנסות להבין איך לממש את מה שהם רוצים וגם אז להגיע לתוצאות לא טובות.\nהחלק הרטוב גם הכיל חלק ענק (!!!) תחרותי (20 ו-30 אחוז באחד התרגילים), וזה די בזיוני שבקורס בלי מבחן אפשר לאבל 25 נוקודת מהציון הסופי על חלקים תחרותיים.\nכל חלק רטוב לווה בדו\"ח מעיק של תיאור מה שעשינו.\n\nהבדיקה הייתה פשוט מזעזעת. המתרגלים נטפלו לכל פיפס שרשמו בדו\"ח ובחלק היבש וזה הרגיש שהם רק מחפשים איך להוריד את הממוצע של הקורס.\nבנוסף, הם חילקו קנסות על ימין ועל שמאל לכל הגשה שלא הייתה נראית להם טוב בעין (כבר אמרתי שהם חיפשו להוריד מממוצע?). הבדיקה הייתה חסרת התחשבות בכך שכל נקודה פוגעת בסופי כי אין מבחן, והקנסות שנתנו פשוט פגעו מאוד בציונים.\nאמנם ציונים סופיים יהיה עוד המון זמן, אבל ברור לכולם שהממוצע ירד בהרבה ביחס לשנים קודמות, שהבנו שבהן הבדיקה הייתה מקלה והיו פחות עבודות ופחות לחץ.\n\nהמבחן: אי מבחן, יש פרויקט להגשה עד תחילת סמסטר אביב.\n\nהשורה התחתונה: קורס עמוס בצורה לא פרופורציונלית ל-3 נק\"ז. אמנם אין מבחן, אבל זה לא אמור לגרור עבודות כאלו ענקיות ופרויקט מטורף.\n\nלקחת רק אם אתם אוהבים את התחום, ולא \"סתם\" כבחירה פקולטית. אמנם הסגל טוב, אבל העומס והבדיקה הקפדנית גורעים מזה לחלוטין.\nמקווים שהממוצע יהיה טוב.", "timestamp": 1676032431242}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אייל בן דוד\nחוות דעת - הרצאות: מרצה שהוא תותח. יודע להעביר את החומר בצורה מאוד ברורה. אייל יודע לעשות הפרדה ברורה בין מה אנחנו צריכים לדעת לבין חפירות מתמטיות לא הכרחיות והוא הרבה פעמים חסך מאיתנו פיתוחים סופר מורכבים כדי שנספיק להבין טוב יותר מבנה של אלגוריתם או רשת. הוא ידע להלהיט אותנו על החומר ככה שלמרות שההרצאות הועברו ב17:30 בערב עדיין היה אפשר להתרכז במה שהוא אומר. תותח.\n\nשם המתרגל/ת: עילם שפירא. \nחוות דעת - תרגולים: מתרגל שהוא בקיא מאוד בתחום וניתן לראות את זה עליו. התרגולים סוג של חוזרים על ההרצאה ומוסיפים קוד שממש את הנושא. כמעט בכל תרגיל בית הקוד בתרגול ממש עוזר ואפשר לקחת חלקים ממנו וליישם את שאר הדברים. חשוב לבוא לתרגולים.\n\nשעורי הבית: 3 תרגילי בית שיש להם חלק רטוב וחלק יבש. בחלק היבש יש מספר שאלות תיאורטיות טובות שמחדדות את ההבנה התיאורטית שלנו בחומר. החלק הרטוב כבד מאוד ויש בו כתיבת קוד ברמה גבוהה. הוא מצריך הרבה השקעה. יש בו גם חלק תחרותי גדול מאוד ושם נופלות רוב הנקודות בסוף. אבל, לעומת קורסים אחרים בהם התחרות מרגישה לא קשורה למציאות ויש בסוף פיזור רנדומלי של ציונים, כאן התחרות מתגמלת. מי שמשקיע יותר - מקבל יותר.\n\nהמבחן: אין מבחן יש פרויקט סוף שהוא 40% מהציון. הפרויקט שלנו היה להשתמש במודל שפה מאומן ענק (מבחינת גודל) ולהתאים אותו למשימה החדשה שהיא תרגום פסקאות מגרמנית לאנגלית. הפרויקט היה מאוד מעניין והרגיש לי שהוא היה פחות עמוס מתרגילי הבית. מי שהבין את המימושים הסתדר. \n\nהשורה התחתונה: הקורס הכי טוב שלקחתי בתואר. זה באמת היהלום של הפקולטה ומי שמסיים כאן תואר בלעדיו - מפספס. הנושא כל כך חם עכשיו בתעשייה שאתם חייבים ללמוד על כל התהליכים האלה בתואר ועוד עם סגל כזה מקצועי ומיומן.", "timestamp": 1680947190265}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אייל בן-דוד\nחוות דעת - הרצאות: מעולות. אייל מרצה מעולה, מעביר את החומר בצורה מקצועית לחלוטין תוך כדי שהוא מצליח לשמר אווירה קלילה. הוא מאוד מתחשב גם בשאלות של סטודנטים במהלך ההרצאה ותמיד מראה נכונות לעזור גם אחרי שעות ההרצאה.\n\nשם המתרגל/ת: תומר וולק\nחוות דעת - תרגולים: מתרגל טוב, ענייני ולא נמרח על שטויות.\n\nשעורי הבית: מסייעים להבנה של החומר. לדעתי זה פייר לגמרי בהתחשב בעובדה שאין מבחן, ובסופו של דבר גם הפרויקט שהיה בתכלס תרגיל בית עצום לא היה מאוד קשה ולא דרש יותר מידי זמן.\n\nהמבחן: לא היה, הפרויקט מחליף אותו.\n\nהשורה התחתונה: קורס מעולה. קצת עמוס מבחינת הגשות אבל לא משהו מטורף. כן חשוב לציין שהקורס עמוס בידע, ובמידה ואין ידע בדיפ אז אייל לגמרי עובר על הרעיונות בכל מודל, אבל אולי כדאי להשלים לבד את הידע של דיפ לפני שלוקחים את הקורס.\nקורס סופר חשוב ורלוונטי, שמעניק כלים פרקטיים וגם מלמד איך להשתמש בהם בפועל ולא רק בתיאוריה.\nסגל הקורס מתחשב מאוד, ככל הנראה הסגל הכי טוב שיצא לי לחוות בקורסי בחירה.", "timestamp": 1681380433390}, {"author": "OOV- Out Of V(tears to cry)", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "אמלק - עשו שינוי דרסטי במודל ההערכת ציונים בקורס, הראו דרגות לא נורמליות של עצלנות, תרגילי בית עם 40% תחרותי ופרוייקט עם קשר מקרי לחלוטין לNLP. בבוחן הורגש שכל אדם בסגל הקורס ראה את הבוחן פעם ראשונה ביום הבחינה, והחומר של קורס באופן כללי הרגיש מאוד לא רלוונטי בגלל שלא התעכב על דברים שבאמת רלוונטים היום. מאוד מאכזב למרות שאהבתי מאוד את החומר בחלק השני של הקרוס.\n\nשם המרצה: אייל\nחוות דעת - הרצאות: אייל מרצה טוב לטעמי ואולי הכי טוב שפגשתי בפקולטה. יודע להעביר את החומר טוב, נותן זמן לשאלות ויודע היכן להתעכב וכמה. החלק השני של הקורס לקוח כמעט לגמרי מסטנפורד, שם לדעתי עדיף פשוט לראות ישירות את המקור במקום אייל, שום דבר נגד אייל, פשוט הוא חותך הרבה דברים מאיזורים שונים שלדעתי היה יותר טוב לראות בקונטקסט המלא שלהם (עוד לגבי זה בהמשך).\n\nשם המתרגל/ת:  איתי נאקש\nחוות דעת - תרגולים:  איתי היה מעולה, ידע לגשת לדברים היותר רלוונטים מההרצאות והסביר אותם בצורה ברורה.\n\nשב:\nהסמסטר הם הורידו את אחד התרגילי בית והשאירו את ה2 הראשונים בלי החלק היבש בכל אחד מהם, אבל הוסיפו בוחן במקום. בשני השעורי בית היה חלק תחרותי של 40% (!!!) כשכל שב הוא 20% תקף. אני לא יודע מי הפסיכופט שאישר את הדבר הזה וחשב שזה לגיטימי. אנשים שחוזרים על הקורס או שיש להם יותר זמן במהלך הסמסטר פשוט רמסו את שאר הסטודנטים.\nהתרגילים עצמם לא שונים בהרבה מסמסטר קודם, רמת קושי לא מטורפת אבל בזבזנו אולי כמה ימים לבנות את המודלים ושבועות שלמים בלנסות לשפר אותם אחרי שראינו את הציונים של תרגיל בית 1. כשאתה רואה עתודאים נכווים מהתחרותי, אתה יודע שמשהו לא בסדר.\n\nהבוחן:\nהסמסטר הם החליטו להכניס בוחן לכל הסיפור שהוא 20% תקף, בוחן אמריקאי על ה8 שבועות הראשונים. הם החליטו להביא לסטודנטים את האפשרות לרשום שאלות לבוחן בפורם יעודי, אלא מה, לאף אחד בסגל לא היה כח לעבור על הפורום הזה ולתקן שאלות עם תשובות לא נכונות. מה שהביא למצב שסטודנטים שהחליטו לנסות לפתור שאלות מהפורום יכלו בטעות ללמוד דברים שהם פשוט לא נכונים, ואפילו לבוחן של מועד א הכניסו שאלה עם טעות מהפורום. הבוחן של מועד ב היה יותר קשה ממועד א, לדעתי בהרבה, הם רשמו בו שאלות על נושאים שלמדנו בשבוע 9, אופסי (הם עשו damage control בזמן הבוחן וגם בזה כשלו והשאירו מושגים שראינו רק אחרי שבוע 8). כמעט כל שאלה בבוחן הייתה ניתנת לפירוש שונה והתשובות שהם סיפקו בזמן הבוחן רק בילבלו יותר (אולי כי גם להם לא היה מושג ו0 תיאום בינהם). הסגל בזמן הבוחן לא היה בכלל סגור על מה רשום בבוחן עצמו, תלוי במי הייתה שואל, הייתה מקבל אינטפרטציה שונה לשאלה שמנוגדות לחלוטין בינהם. חלק מהסגל (אולי כולו) ראה לייב פעם ראשונה שאלות בבוחן... בזמן הבוחן. שוב עצלנות שפשוט אפשר לראות מקילומטר. \n\nהפרויקט:\nפרקטית עילם החליט שלא באלו להתעסק יותר במחקר שלו אז הפך את הסטודנטים בקורס לעובדים שחורים שהם ינסו לעשות אופטימיזציה למודל במחקר שלו. עבודה על קוד ונושא שעילם סיפק מראש, הכיוונים הראשיים שהם סיפקו בתור דברים שאפשר לעשות עליהם את הפרוייקט קשורים לNLP בצורה מקרית לחלוטין.\nאציין שהם נותנים את האפשרות לקחת את הפרוייקט לכיוונים שונים מעבר למה שהם סיפקו, שבתאוריה הם יכולים להיות מעניינים כתלות ביצרתיות של הסטודנטים בהינתן המחקר של עילם (שעדיין לדעתי זה פשוט מפגר, תנו כמה מחקרים לבחור מהם) ותלוייה בכמות הזמן שיש לכם בתקופת מבחנים של החורף.\n\nחומר הקורס:\nלדעתי הדגש בחומר בקורס לא טוב, הנושאים שהם באמת מעניינים ועדכניים לא מועברים בצורה טובה (אם בכלל) וחפפו אותם לגמרי.  אבל דברים שכנראה אף אחד מאיתנו לא יתעסק בהם בחיים הועברו בצורה מעמיקה בטירוף למשך 3 שבועות. כל החלק המעניין והחומר הרלוונטי לעולם היום נדחף לשבועיים מסכנים בקורס (אם בכלל) כשאחד מהם הוא הוא העשרה.\n\nשורה תחתונה:\nנכון לעכשיו אין ציונים לתרגילי בית 2 או הפרויקטים, אבל את כל מה שאפשר לראות כבר ראינו. לצערי מאוד חיכיתי לקורס הזה, אני נכנס לפרויקט עם טעם מר בפה. היה סופר מאכזב ואפס התגמשות מהסגל בנוגע לבעיות שהועלו מולם לגבי הפרויקט והשיעורי בית. על פני השטח הרגיש שלסגל מאוד אכפת מהסטודנטים, אבל כשהגיע באמת להביא פתרונות ולעשות דברים כמו שצריך מבחינה מעשית לא הורגש שום דבר מהם, ובצורה מסויימת רק הגביר את האכזבה בכל הסיפור. כל סטודנט שדיברתי איתו על הקורס והפרוייקט היה מאוד מאוכזב וחלק אפילו זרקו את הקורס אחרי שגילו מה עושים בפרוייקט.", "timestamp": 1712424723706}, {"author": "שותף לדוקטורט של עילם", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "אמל\"ק: כמו הביקורת הזאת, בהתחלה נראה אחלה ואז כשנגמרת תקופת השינויים מגלים שלא.\n\nשם המרצה: אייל בן דוד \nחוות דעת - הרצאות: \nההרצאות מאוד מעניינות. מרצה מאוד טוב וכריזמטי. נראה שאכפת לו שהסטודנטים יבינו מה קורה בכל רגע.\n\nשם המתרגל/ת: איתי נקאש\nחוות דעת - תרגולים: \nמתרגל מעולה ואכפתי, מסביר ברור ומנסה ממש לעזור לסטודנטים להבין את החומר ואת המטלות.\n\nשעורי הבית: \nפרויקט (יזכה לחלק משלו בהמשך) ו2 תרגילי בית רטובים.\nסגל הקורס החליט להוריד את הממוצע ולנרמל את ממוצע הציונים ל82 ואת זה כולם גילו רק אחרי שהגישו תרגיל בית 1 ושלושה ימים לפני הגשת תרגיל בית 2. בסך הכל שני תרגילי בית רטובים לא קצרים שבכל אחד מהם חלק לא קטן של ציון תחרותי ככה שאתם יכולים לעשות עבודה מאוד טובה אבל לקבל ציון בינוני.\n\nהבוחן: \nקורה באמצע סוף הסמסטר.\nשאלות מבלבלות, לא מנוסח טוב, נמצאו טעויות בחלק מהשאלות\n\nפרויקט: \nביזיון אחד גדול.\nלסגל נראה הגיוני שבתקופת מבחנים מה שאנחנו נעשה זה לעזור לעילם המתרגל בדוקטורט שלו. 40 אחוז מהציון הולך לשפר את המודל שלו, משימה שלא קשורה כל כך למה שלמדנו. צריך לקחת קוד לא מובן מהגיט שלו, לנסות להבין מה הולך בקוד, לנסות לשפר אותו ועוד לכתוב על זה מאמר באנגלית כדי שהוא יוכל להעתיק ולשים אצלו (ועוד הוא אומר כדי לעודד אותנו שהוא ישים ציטוט עם השם שלנו במאמר שלו אם נביא ביצוע מספיק טוב כאילו שמעניין אותי להופיע שם). גבר תתעורר על עצמך ותסיים את הדוקטורט זה לא תפקיד שלי. \n\nהשורה התחתונה: \nחומר מעניין שמועבר בצורה טובה אבל חבל. הפקולטה לנתונים וחירטוטים יודעת קורסים עם התנהלות נוראית יותר (בינה ויום יבוא ואכתוב גם שם, מעולם לא נשרו לי כל כך הרבה שערות אחרי תרגיל בית) אבל עדיין\nאם אתם מחפשים קורס בחירה כדי לעזור למישהו לסיים דוקטורט בשביל 82 סופי לכו על זה ולא תתאכזבו.", "timestamp": 1712446755842}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אייל בן דוד\nחוות דעת - הרצאות: ממש טובות, אייל מסביר את החומר מצוין, נותן דוגמאות קונקרטיות ועונה טוב על השאלות. יש קצת טעויות במצגות אבל בשלב הזה של התואר כבר רגילים.\n\nשם המתרגל/ת: איתי נקאש\nחוות דעת - תרגולים: איתי מלך ובאמת אחד המתרגלים הטובים בפקולטה. תמיד עזר איפה שיכל, העביר תרגולים מעולים והיה מאוד זמין לסטודנטים.\n\nשעורי הבית: שני תרגילים רטובים תחרותיים (40% תחרות כל אחד), כל אחד מהם 20% מהציון. העובדה שהם תחרותיים די מבאסת כי זה באמת מקום לאבד המון נקודות, אבל כתרגילים בפני עצמם הם די טובים בלהדגים שימוש בכלים שנלמדים בקורס והם דורשים השקעה, ככה שהם כן משיגים את המטרה שלהם. באופן כללי הסגל הצהיר שהם קיבלו הוראה להוריד את ממוצע הקורס ככה שזה ההסבר ללמה הם קשים ומכילים כל כך הרבה אחוז תחרותי.\n\nהמבחן: בוחן אמצע ששווה 20% מהציון, אמריקאי 15 שאלות. גם המועד א' וגם המועד ב' היו די גרועים. היו לא מעט שאלות שנוסחו רע ולא מעט שאלות שהיו צריכים לקבל בהן יותר מתשובה אחת נכונה. הסגל גם אפשר לסטודנטים להציע במהלך הסמסטר שאלות לבחנים במודל ומי שהשאלה שלו נבחרה קיבל בונוס 10 נקודות לבוחן. אנשים ניצלו את זה כדי להספים שאלות בלי לבדוק אם מה שהם כותבים נכון בכלל ובסוף שאלה עם טעויות נכנסה לבוחן ונפסלה. מקווה שהסגל יזנח את הרעיון הזה בעתיד.\n\nהפרויקט: 40% מהציון. פרויקט שהאופי שלו הוא יותר מחקרי וקשור לדוקטורט של עילם (המתרגל האחראי). הוא לא תחרותי והדגש בו הוא בעיקר על יצירתיות ובדיקה של כיווני מחקר שעילם לא ניסה במאמר המקורי, ואפילו שהוא לא משימת NLP קלאסית, אני כן חושב שהוא מדגים לא רע אפליקציות של NLP שרלוונטיות לעכשיו והעובדה שניתן המון זמן לפרויקט (ההגשה הרבה אחרי סוף תקופת המבחנים) מראה שלסגל כן אכפת לדעתי. יש אנשים שאולי לא יתחברו אבל לדעתי זאת חשיפה נחמדה למחקר וכן מדגים איך לוקחים כלים שהשתמשנו בהם בקורס ומיישמים על בעיה אמיתית שלאו דווקא קשורה לעיבוד שפה (שזה תכלס מה שעושים היום בתעשייה ובמחקר).\n\nהשורה התחתונה: אפילו שהציונים לא משהו ביחס לקורס בחירה, מבחינת הידע שרוכשים בקורס, חד משמעית קורס שחובה לקחת (בעיניי גם צריך להפוך לקורס חובה במסלול של נתונים). לומדים כלים, אלגוריתמים ומודלים שהם מאסט בעבודה עם דאטא טקסטואלי ועם כל כמה שLLMs די משתלטים על העולם, זה ידע שחייבים שיהיה. קשוח ועמוס אבל אחד הקורסים היותר מלמדים בפקולטה.", "timestamp": 1712495448729}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "אמלק - להתרחק! ציפיתי לקורס הזה בקוצר רוח אחרי ששמעתי את ההמלצות משנה שעברה + העובדה שהנושא סופר מעניין, אבל בדיעבד אם הייתי יודע שזה מה שיהיה לא הייתי לוקח את הקורס הזה בחיים. כ\"כ הרבה שעות של השקעה שפשוט הלכו לפח ולא השתקפו בציון, בשילוב עם אטימות וחוסר התחשבות מוחלטת של הסגל.\nשעורי הבית: מזעזעים. החליטו לתת משקל של 40% לחלק התחרותי (במקום 20% בשנה שעברה) והוא גם חושב על מנת לדפוק את הסטודנטים בצורה המקסימלית - כל אחד מקבל מתוך ה-40 נקודות ציון יחסית למרחק שלו ממי שהשיג את התוצאות הכי טובות. בפועל יכול להיות שסטודנט אחד הצליח לעקוף את כולם ב-5% ב-accuracy נגיד, וכתוצאה מכך כולם חוץ ממנו יקבלו 70 ומטה. זה פשוט הפך לתחרות למי יש יותר זמן פנוי לשחק עם הפרמטרים, אז אם אתם עובדים למשל כדאי לוותר מראש (או לקחת שבועיים חופש מהעבודה לכל תרגיל בית). בנוסף למרות שלא נכתב על זה שום דבר בהנחיות התרגיל הסגל משום מה החליט לבטל את הציון של החלק הבסיסי לכל מי שלא הגיע לציון מינימלי מחורטט כלשהו בחלק התחרותי על אף העמידה המלאה בכל הדרישות לחלק הבסיסי, כדי לדפוק אותם עם ציון 5 במקום 60. בקיצור - באו להוריד ממוצע בכל מחיר וקבעו את כל הספים כדי שיסתדרו לפי הממוצע שאליו הם כיוונו. מעבר לזה חוסר התחשבות מוחלט, לא הסכימו להאריך הגשות גם כששוקף להם שכל הקורס בקריסה, אין דרך להבין למה נפלת בתוצאות ובקיצור- אטימות מוחלטת. כל הטוב הזה בשילוב זה שיש רק שבועיים לכל תרגיל בית שכמובן נופלים גם על הזמנים הכי עמוסים בסמסטר (וכפי שציינתי למעלה, אין עם מי לדבר על הארכה...) \nהמבחן: פרויקט מסכם, שכל מטרתו הוא לנצל את הסטודנטים בקורס לשפר את התזה של המתרגל האחראי. כל קשר ל-NLP מקרי בהחלט, כי רוב התזה בכלל התמקדה בתורת המשחקים. מה שהכי מצחיק זה שכל הסמסטר הובטח שבשונה מתרגילי הבית הפרויקט לא יהיה תחרותי, אבל אז הכניסו סעיף בניקוד על מקוריות ויצירתיות ביחס לסטודנטים אחרים. היה גם בוחן אמצע, תאם לגמרי את ההרגשה הכללית שקיבלתי מהקורס - מבולגן, מבלבל וכל מטרתו היא לנרמל ציונים בהתאם לממוצע הרצוי.\n\nהשורה התחתונה: לכו לקורס NLP של מדמח, עדיף.", "timestamp": 1712698835364}, {"author": "Mr", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "השורה התחתונה: להתרחק כמו מאש, אמנם לומדים חומר חשוב בכל הקשור לעיבוד שפה, אך ממש לא שווה את ההשקעות האינסופיות על תרגילי בית,\n(הציונים כמובן אצל רוב הסטודנטים לא משקפים את ההשקעה שלהם) הבוחן עם שאלות מכשילות ואת הציון שמקבלים בסוף.", "timestamp": 1712828704168}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "פשוט אל תעשו את הקורס הזה. השקעתי בקורס הזה יותר זמן ואנרגיה מאשר כל קורס אחר מאז תחילת התואר, מה שכמובן לא התבטא בשום צורה בציון.\nצוות הקורס בא במטרה שהממוצע של הקורס יירד, ולכן העלו את אחוזי התחרות בתרגילי הבית ובפרויקט והורידו את הגליונות היבשים. אם לא מנצחים את התחרות במקום הראשון, אין סיכוי לקבל ציון סביר לתרגיל.\nהסגל (ובעיקר עילם) לא רגיש ונראה שהם באמת עושים הכל בשביל שיהיה כמה שיותר מסובך ומיותר.\nתחסכו לעצמכם ותלמדו את הקורס של סטנפורד ביוטיוב במקום, בכל מקרה כל החומר מועתק משם ואז לא צריך לשרוף עשרות שעות על פרויקט מיותר שבקושי קשור לעיבוד שפה טבעית.", "timestamp": 1716562223294}, {"author": "רוני", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אייל בן דוד\nחוות דעת - הרצאות: \nהרצאות מעניינות, חומר מועבר היטב, סה\"כ כיף להגיע ולהקשיב. מתעסק לא מעט בהיסטוריה של NLP ולא רק בעכשווי, שבעיני זה דווקא די נחמד.\n\nשם המתרגל/ת: עילם שפירא \nחוות דעת - תרגולים: \nהתרגולים עצמם בסדר- קצת קוד וקצת תיאוריה. המתרגל אמנם קבע הרבה שעות קבלה עבור הפרויקט, אבל הפרויקט היה הזוי ולא קשור לתחום בשום צורה- כל המטרה שלו היתה להעשיר את המחקר של המתרגל. מאוד לא מרוצה מהיחס של המתרגל לסטודנטים ולגישה בה נקט בפרויקט הסיום וגם בבוחן אמצע. \nשעורי הבית: \nארוכים נוראאאא, כמעט לא יאמן ביחס לנק\"ז. בנוסף, הציון מנורמל ביחס לשאר ויש תחרות שהיא פשוט לא הוגנת כשיש עתודאים מאלונים (ובמיוחד ברקת שהתבססו עמוק באחוזון העליון של הציונים). תצפו להשקיע שבועיים על כל ש\"ב ולקבל 80 במקרה הטוב, כאשר מה שהכריע את הציון התחרותי הוא שיפורים קטנים וקטנוניים. \n\nהמבחן: \nלא היה מבחן, היה בוחן אמצע, שהיווה 20 אחוז מהציון הסופי ו20 אחוז מהרצון שלי לחיות. אמריקאי, מאוד מבולגן, עם טעויות שהוסברו במהלך או אחרי הבחינה, וכלל לא משקף את הבנת החומר. \nהשורה התחתונה: חומר מעניין מאוד שמועבר היטב, בכל הנוגע ליחס לסטודנטים נראה שהדבר היחיד שמעניין את הסגל הוא התפלגות הציוניים היקרה שלהם שחס וחלילה הממוצע יהיה מעל 84. המתרגל אמר בפומבי שציוני פרויקט הסיום ינתנו בצורה שתציג את הממוצע הרצוי (ולא ביחס להשקעה של התלמיד שעובד קשה!!).", "timestamp": 1716805620394}, {"author": "שימו לב!", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אייל בן-דוד\nחוות דעת - הרצאות: מרצה יהיר שמתנשא על סטודנטים. מלמד בצורה טובה וחומר חשוב, אבל רובו לא מתמקד בנושאים העכשווים של עיבוד שפה טבעית. \n\nשם המתרגל/ת: עילם\nחוות דעת - תרגולים: אחסוך מכם את האיחולים שלי אליו... אסור לבן-אדם חסר הרגישות הזה להיות חלק מכל סגל קורס כלשהו. אני מקווה שיפסיק ללמד כדי שאחרים לא יצטרכו לסבול את האישיות הנוראית שלו.   \n\nשעורי הבית: זוועות עלינו שמשון. לא משנה כמה תשקיעו, הציונים מנורמלים והתחרות בין הסטודנטים הורסת את הכיף ללמוד בכלל. הפכו נושאים כל כך יפים ומעניינים לנטל המלווה בתחושות תסכול בגלל השקעה רבה וציונים נמוכים.  \n\nהמבחן: יש בוחן \"אמצע\" שמתרחש לקראת סוף הסמסטר על כל החומר של הקורס. אוסיף כי הוא מנוסח מזעזע כמו סגל הקורס. החלק הארי של הציון מורכב מפרויקט שהקשר בינו לבין הקורס מקרי בהחלט. יתרה מכך, הוא נועד אך ורק כדי לסייע לעילם המתרגל להצליח במחקר שלו, מבלי להביא ערך מוסף ללימודים.   \n\nהשורה התחתונה: להתרחק. להתרחק. להתרחק. לקחת את הקורס של מדמ\"ח במקום. באתי לקורס עם מוטיבציה בשמיים ויצאתי מאוכזב מאד. חשוב להדגיש: הרבה מאד סטודנטים עזבו את הקורס במהלכו, לאחר שקיבלו ציונים נמוכים בתרגילי הבית, בגלל הסגל ולא בגלל חוסר השקעה או בידע. לכן הממוצע גבוה ממה שהיה אמור להיות.", "timestamp": 1717017116642}, {"author": "a", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: a\nחוות דעת - הרצאות: a\n\nשם המתרגל/ת: a\nחוות דעת - תרגולים: a\n\nשעורי הבית: a\n\nהמבחן: a\n\nהשורה התחתונה: a", "timestamp": 1717523222974}, {"author": "P.o.p", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מעביר את החומר מעניין \n\nשם המתרגל/ת: איתי ועילם\nחוות דעת - תרגולים: איתי אחלה גבר\n\nשעורי הבית: ארוכים ומתישים, ציונים לא גבוהים שמותאמים להשקעה\n\nהמבחן: היה בוחן אמצע עם שאלות מבלבלות ודו משמעיות בחלקן\n\nהשורה התחתונה: קורס בחירה שלא כדאי לקחת.", "timestamp": 1719510242289}, {"author": "Micky", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אייל בן-דוד\nחוות דעת - הרצאות: מרצה נחמד, מובן, אבל אם מעבירים מצגת זהה ביוטיוב ע״י סטנפורד - זה כנראה עדיף.\n\nשם המתרגל/ת: עילם שפירא\nחוות דעת - תרגולים: בינוני מאוד, היה תרגול שהוא התעקש שאלגוריתם מסויים של תכנות דינמי הוא גרידי בלי להסביר למה הוא מתכוון (הרי תכנות דינמי מוצא את הפתרון הטוב ביותר), ככל שעבר הזמן יותר אנשים הצביעו ושאלו את זה והוא המשיך לענות תשובות מטופשות ולהתעצבן.\n\nשעורי הבית: החלק הכי גרוע בקורס:\nדד-ליין של שבועיים של דברים שרצים על שרת בעייתי שיכול לגרום לאיבוד של כמה ימים (מריצים ואז מגלים שהפסיק לרוץ), בנוסף - התרגילים ממוחזרים מצד אחד, מצד שני הציון הוא יחסי-תחרותי והמתרגל הנ״ל מאיים על מי שיעתיק, אז אם אתם לא מעתיקים, הציון הוא דיי רנדומלי בחלק הנמוך של ההיסטוגרמה (גם אם אתם עובדים במחקר ב nlp ובסוף תואר מתקדם). כנראה שהחלק העליון של ההיסטוגרמה זה בעיקר אנשים עם מספיק חברים שלוקחים את הקורס שיכולים לשתף מידע לגבי מה עובד טוב... מי שהולך לנסות בעצמו עד שימצא מה עובד כנראה יתחרט שלקח את הקורס (הרבה זמן בשביל ציון יחסית נמוך). במיוחד שמי שלא מעתיק עשוי לעבוד עם באג שפוגע בהצלחה, לכן חשוב שיהיה עם מי להשוות.\nספציפית מה שחשוב:\nבתרגיל הראשון זה לדעת באיזה פיצרים להשתמש, אז אפשר לנסות להריץ המון דברים ולקבל ציון לא משהו או לרפרנס מהמקום הנכון ולקבל ציון טוב.\nבתרגיל השני, החלק הכי קריטי זה הייצוג של המילה, יותר מזה, הייצוג שאומן מראש ומתאים עבור המטלה הזו (אמפירית), אז שוב אפשר לנסות מלא דברים או לרפרנס ולקבל ציון הרבה יותר טוב ולנצל את הזמן כדי לשפר את שאר הדברים.\nמ.ש.ל. - הכי חשוב זה לרפרנס בקורס הזה, אם לא - משקיעים הרבה זמן עבור תוצאה גרועה.\n\nהמבחן: בחן תקף - שאלות רנדומליות מוזרות, אל תסמכו על המתרגל הנ״ל שלא יכשיל אתכם אם תנסו להוציא ממנו תשובה.\nהיה פרוייקט, לא למדתי ממנו משהו שקשור לקורס, הם ניצלו אותו כדי שנבצע הרצות שעשויות לשפר מאמר שהמתרגל הנ״ל כתב. בנוסף, הפרוייקט אמור להיות אחרי הסמסטר, אבל חצי ממנו היה בשבועות האחרונים של הסמסטר, כדי שאת תקופת המבחנים ננצל להמון הרצות.\n\nהמלצה לסגל:\nעדיף מבחן נחמד על החלקים החשובים של הקורס מאשר תרגילים שלא יביאו אף אחד לשום דבר. בתור ״פשרה״ - אפשר מבחן + תרגילים סבבה ללא תחרות, מה בדיוק יוצא מהתחרות הזאת? בזבוז זמן v חוסר שיתוף פעולה => לימוד פחות טוב v חוסר הוגנות v ...\n\nהשורה התחתונה: החלק השני של הקורס זה החלק המעניין ולצערי לא למדתי אותו לעומק כי רוב ההשקעה הולכת על החלק הראשון. \nאם ממש חשוב לכם להיכנס לתחום אז תשקלו לקחת, הבעיה שאין כמעט מנחים טובים בתחום הזה, אז זה הימור כי יותר קל למצוא עבודה בתחום מאשר מנחה טוב. בשביל ציון פר השקעה הייתי בוחר בקורס אחר.", "timestamp": 1719526811537}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אייל \nחוות דעת - הרצאות:  מרצה מקסים, מעביר את החומר בצורה טובה \n\nשם המתרגל/ת: איתי נקש \nחוות דעת - תרגולים: \nמתרגל עם לב ענק, מסביר את החומר מעולה והכי חשוב תמיד בשעות קבלה שלו נותן אינטואיציות לתרגילי הבית. \n\nשעורי הבית: \nקצת קשים, לא אהבתי את העניין של התחרות, במיוחד שהציונים נמוכים \nהמבחן: \nהיה בוחן אמצע ממש סבבה אבל חבל שלא ראינו מבחני עבר\n\nהשורה התחתונה:  הפרויקט בקורס מזעזע, מטלה מתגלגלת חסרת משמעות ועוד לעזור לאחד המתרגלים במחקר של עילם, תגידו לי מה מה הקשר לתורת המשחקים וNLP למה הייתי צריך לעשות את החרא הזה בנושא הכי משעמם בעולם. לא לגעת בקורס הזה אם לא משנים אותו!", "timestamp": 1719657911182}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אייל בן דוד\nחוות דעת - הרצאות: כעקרון אייל אחלה מרצה והחומר מועבר בצורה די טובה, אבל החומר של ההרצאות מרגיש מאוד לא עדכני ורוב הקורס לא סובב סביב LLMs מודרניים שהם הכי רלוונטיים היום אלא יותר יש בילדאפ עד שמגיעים לזה ממש בשבוע-שבועיים האחרונים של הקורס ולא מאוד מתעמקים בזה. צריך לעדכן את התוכן של ההרצאות לדעתי.\n\nשם המתרגל/ת: איתי נקאש\nחוות דעת - תרגולים: תותח על, התרגולים שלו היו מעולים וברמה מאוד גבוהה. היה מאוד אכפתי ועזר המון במהלך הסמסטר.\n\nשעורי הבית: שני תרגילים רטובים עם חלק תחרותי מאוד גדול. מאבדים בתחרותי די הרבה נקודות והציונים בתחרותי מנורמלים לפי Min-Max Scaling אז מי שלא נמצא באחוזון המאוד עליון של התוצאות די חוטף פגיעה קשה. צריך שותף שסומכים עליו, להשקיע המון ולהתחיל את התרגילים כמה שיותר מוקדם כי הם מאוד כבדים ודורשים הרבה זמן וגם אז הציון והאחוז שלו לא פרופורציונלי לרמת ההשקעה (בקטע רע).\n\nהמבחן: יש בוחן אמצע אמריקאי. הבוחן היה לא משהו עם שאלות די מבלבלות וגם היו בו לא מעט טעויות אבל אם מספיק חורשים את המצגות של הקורס אז אפשר להוציא בו ציון טוב.\n \nהפרויקט: עקרונית הסמסטר זה היה פרויקט מחקרי שהתלבש על הדוקטורט של עילם המתרגל האחראי. למרות שהיה בו אספקט של עיבוד שפה, רובו לא היה קשור לזה כמעט וזה מרגיש לא קשור בכלל לקורס. הציונים היו סבבה אבל זה יותר מרגיש שפשוט ניסו לנרמל בעזרת זה את הממוצע של הקורס למה שהם כיוונו מאשר שבאמת ניסו לתת פרויקט שימחיש וידגים מה עושים היום בתחום של NLP. \n\nהשורה התחתונה: גם אם הקורס היה די גרוע, אין ברירה אלא לקחת אותו כי פשוט לומדים שם דברים חשובים מדי בשביל לדלג על זה. אי אפשר לסיים תואר בדאטא סיינס בלי לדעת מה זה טרנספורמר או לדעת Deep Learning ואלה כן דברים שהקורס מקנה. הם כן צריכים לשפר אותו ברמת התוכן וברמת ההערכה והציון. סבבה עם זה שרוצים להוריד ממוצעים אבל יש דרך לעשות את זה והם עשו את זה בדרך די גרועה.", "timestamp": 1719667878755}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מובנות וברורות\n\nשם המתרגל/ת: עילם\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: קשים מאוד!!! דורשים המון זמן במהלך הסמסטר היו צרכים להיות 3 תרגילים אבל בגלל המלחמה זה השתנה ל2 ובוחן אמצע אמריקאי. שיעורי בית תחרותיים והציונים לא תואמים לרמת ההשקעה.\n\nהמבחן: אין. פרוייקט סוף מוזר של הרחבה וניסיון לשפר את המאמר של המתרגל לא מעניין במיוחד \n\nהשורה התחתונה: ציפיתי ליותר עיניין ולהתעסק עם דברים יותר מעניינים, בסוף היה המון עיסוק בטכניקות NLP ישנות יחסית והסגל מאוד קשוח בבדיקה ובחלקים התחרותיים", "timestamp": 1722344691567}]}