{"posts": [{"author": "שליחי הדודה", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: שי קוטין\nחוות דעת - הרצאות: מרצה מדהים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלים עם בדיקה הזויה וקפדנית\n\nהמבחן: \n\nהשורה התחתונה: קורס לא מעניין במיוחד אבל ציון קל", "timestamp": 1597739749046}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: חלק מההרצאות היו מאוד טכניות ומשעממות, אבל רובן היו, לפחות בעיניי, די מעניינות. עופר מעביר את החומר בצורה מאוד טובה לדעתי ומשתדל לענות בצורה הטובה ביותר שהוא יכול. החומר שעובר בתרגולים הוא בעיקר תאורטי (משפטים וכו) ולא מראה כיצד משתמשים במשפטים. \n\nשם המתרגל/ת: עופר גוטמן/רזיאל\nחוות דעת - תרגולים: תרגולים סבבה, חשובים להבנת החומר ולשיעורי הבית, אבל כמעט תמיד דרך הפתרון לא תהיה פורמלית לגמרי ופשוט חלק מהדברים הם יסבירו בנפנופי ידיים ''מפאת חוסר זמן''.. דבר שפוגע בעשיית שיעורי הבית ובהכנה למבחן כי לא תמיד יודעים לאיזה רזולוציה צריך לרדת בפירמול.\nבתרגולים לומדים תחלק הפרקטי של התאוריה מההרצאה.\n\nשעורי הבית:  6 תרגילים קשים מאוד עם בדיקה קפדנית מידי ביחס לאיכות שהראו בתרגולים. בסמסטר שלנו הייתה החלטה להגריל את הבדיקות בין הסטודנטים- מי שנבחר להיבדק בתרגיל מסויים יקבל ציון תקף של 5%, מי שלא נבחר- החמש הולכים למבחן, ומי שלא הגיש מקבל ציון תקף של 0 ב5%. יצא שלכל אחד בערך נבדק תרגיל אחד, שניים ולא יותר מזה\n\nהמבחן: \n\nהשורה התחתונה: קורס קשה להבנה בהתחלה אבל סביר, לא הכי מעניין, אם הוא לא חובה אין סיבה מיוחדת לקחת אותו", "timestamp": 1627245153468}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: \nמובנות בגדול, לא מראים מבנה סטנדרטי של הוכחה, אז צריך ללמוד מהספר או מהרפרנסים של תרגילי הבית.\nשם המתרגל/ת: עופר גוטמן\nחוות דעת - תרגולים: מוזר, לא מסביר טוב, צריך לעבור עליהם 8 פעמים לפני שבאים לתרגול כדי להבין.\n\nשעורי הבית:  קשים. סגל הקורס עצלן אז הם ממחזרים משנים קודמו + שאלה או סעיף חדש בכל תרגיל.\nבדיקה מאוד קפדנית, מורידים על כל פיפס בערך\n\nהמבחן: \nללמוד אליו לפחות שבועיים לפני.\nטריקי ומבלבל\n\nהשורה התחתונה: לא יודעת, לא נהניתי", "timestamp": 1627473829524}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות: קצת מונוטוני אבל מסביר בצורה טובה. רוב ההוכחות הועברו בצורה לא פורמלית\n\nשם המתרגל/ת: עופר גוטמן\nחוות דעת - תרגולים: מסביר טוב, יש לו תשוקה לחומר הקורס אבל חלק לא מבוטל מהתרגילים הועברו בצורה לא פורמלית, מה שהקשה על פתרון תרגילי הבית\n\nשעורי הבית: 6 גליונות חובה, אולי ייבדקו ואולי לא, ואם כן ירדו נקודות על כל נקודה שלא במקום. מרגיז ומתסכל, אבל הם המקור הכי טוב להעמקת החומר\n\nהמבחן: הועלו למודל 6 מבחנים משנים קודמות כתרגול לקראת המבחן. בפועל המבחן היה הרבה יותר מאתגר (אבל אפשרי).\n\nהשורה התחתונה: קורס די מעניין אבל מורגש שלא שמים דגש על פורמליזם בכלל", "timestamp": 1627514486660}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: \nבתור מרצה הוא אחלה, בונה טוב את השיעורים ומעביר את הקורס באופן טוב. \n\nשם המתרגל/ת: עופר גוטמן\nחוות דעת - תרגולים: \nהתרגולים עצמם בנויים באופן טוב ומרגיש שהם חוזרים על החומר ועוזרים סהכ. עופר עצמו טיפה גורם לחומר להישמע יותר קשה ממה שהוא.\n\nשעורי הבית: \nיש 5-6 גיליונות (לנו היה 6) לא פשוטים אבל הכרחיים להבנה של החומר.\nהבאסה הכי רצינית זה שהסגל בוחר באופן רנדומלי דוגמית קטנה מאוד של מטלות לבדוק ורק אם נבדקת המטלה שלך היא נחשבת כ5% מגן. ובאופן כללי לקראת המבחן היית רוצה לקבל משובים מהסגל לגבי איכות הפתרון שלך ואתה מקבל את זה על כמות קטנה מאוד של החומר.\n\nהמבחן: \nעם מספיק זמן למידה אפשרי להוציא בו ציון טוב בתקווה שאתה חד מספיק לזהות את כל הטריקים על ההתחלה של המבחן\n\n\nהשורה התחתונה: \nקורס סביר בהחלט. מרגיש קצת מנותק בתוכן שלו משאר עולם התוכן של המסלולים בפקולטה אבל קורס לא ככ נורא", "timestamp": 1628324815432}, {"author": "Ophir Carmeli", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: \nמרצה זחוח כרגיל. רוב הסבריו אכן אינפורמטיביים ומעניינים, אבל נוטה לאבד כיוונים בהוכחות, דבר אשר מקשה על ההבנה.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין בכלללל משוב ראוי, ובכללי תהליך ביזיוני. תרגילי הבית הוגרלו לבדיקה ובכל פעם שהוגרלת תקבל 5 אחוז לציון תקף. לא שיוווני בין הסטודנטים, אם היו גיליונות שהרגשתי יותר חזקה בהם יכול להיות שם כלל לא יבדקו. ביזיון גדול, אין מילים. לא פירסמו פתרונות רשמיים, לא היה מאיפה ללמוד בכלל למבחן.\nהמבחן: \nבאסה, אין מילה אחרת. כראוי לעופר המבחן לא תאם את רמת הלמידה. לא פורסמו פתרונות לאף אחד מהמבחנים ובגדול כל המבחן והקורס היה הימור ענק.\nהשורה התחתונה:", "timestamp": 1629188425845}, {"author": "אם M עוצרת על x, לך לכלא ואל תעבור בדרך צלחה", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות (ראיתי הקלטות משנה שעברה): לדעתי עופר הוא מרצה טוב מאוד מבחינת איכות ההוראה שלו. החומר לא פשוט ולא תמיד אינטואיטיבי אבל בסוף תמיד יצאתי מההקלטה בתחושה שהכל מובן. אי אפשר לוותר על ההרצאות.\n\nשם המתרגל/ת: עופר גוטמן\nחוות דעת - תרגולים: מתרגל לא רע, לפעמים רץ מהר מדי אבל לא באשמתו, התרגולים מאוד עמוסים. היה טוב אם היה מוסיף יותר את האינטואיציה שלו לפתרון תרגילים, הרבה פעמים הוא פשוט מקריא מהמצגת. \n\nשעורי הבית: 6 גיליונות מאוד עמוסים, אפשר להגיש ביחידים או בזוגות, אבל תאמינו לי שאתם לא רוצים לעשות גיליון לבד. הבדיקה מאוד קפדנית, אבל בסופו של יום לרוב בדקו 2 מתוך 6 והמשקל של כל אחד הוא 3.33% , אז לא נורא. בסמסטר הזה סטודנטים מאוד התעצבנו על אופן הבדיקה וכ\"פיצוי\" הצוות הציע להפוך את משקל התרגילים ל-15% תקף. אם גם לכם יציעו אל תיפלו בפח! זה יבוא על חשבון הפקטור. אין מתנות חינם.\n\nהמבחן: המבחן קשוח אבל ברמה נסבלת. צריך לשנן המון טריקים ושטיקים לקראת המבחן ולזהות אותם במבחן עצמו, וזה לא פשוט. טיפ: מכיוון שאין כמעט מבחני עבר זמינים ללמידה למבחן, אני ממליץ להיעזר במבחנים וסריקות מקורס די דומה \"תורת החישוביות\" 236343 של מדמ\"ח.\n\nהשורה התחתונה: אל תתנו לשם הקורס להטעות אתכם. בשבועות 1-7 הקורס עוסק באוטומטים ושפות פורמליות- זה סתם קוץ בתחת (וגם החלק היחסי של החלק הזה במבחן נמוך), הדבר האמיתי (חישוביות וסיבוכיות) מתחיל בשבוע 8, החלק הזה הרבה יותר חשוב ומעניין.", "timestamp": 1659471714225}, {"author": "student", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות: הרצאות מוקלטות אמורות להיות זהות, צפיתי במוקלטות. החומר בהרצאות לא מכיל מספיק דוגמאות רלוונטיות, ולכן המון הרחבה של חומר (בעיקר בנושאים האחרונים) זולגת לתרגולים. מועבר בצורה משעממת\n\nשם המתרגל/ת: עופר גוטמן\nחוות דעת - תרגולים: התרגולים עצמם ארוכים ועמוסים מאוד בחומר, בסכ\"ה בנויים לא רע, מומלץ לחזור על התרגולים מספר פעמים לפני המבחן\n\nשעורי הבית: מייגעים!!! כ50% ממוחזרים ו40% ניתן למצוא פיתרון בספרים או באינטרנט. כמות ההשקעה לא סבירה לאחוז הציון. לרוב הסטודנטים בדקו 2-3 תרגילים מתוך 6 שהם חובה להגשה, שמהווים עד כ9% ציון מגן לשעותתת של עבודה\n\nהמבחן: לסטודנט הממוצע - עוברים וממשיכים. עופר מנסה להמציא את הגלגל, מכוון לממוצע 70 אחרי פקטור, כשיש גאונים שמעלים את הממוצע ובפועל המון מגרדים את העובר. אי אפשר לעבור בלי השקעה של שבועיים לפחות, מומלץ מאוד לפתור מבחנים כמה שיותר מוקדם.\n\n\nהשורה התחתונה: קורס של 2.5 נק\"ז שמשתלט על תקופת מבחנים, יחס מזלזל של הסגל- החזירו ציונים אחרי חודש בלי פקטור, תקשורת לקויה עם הסטודנטים, גם חומר שאמור להיות מעניין הופך לסיוט בגלל יחס מגעיל . קורס חובה שהלוואי שיעבור מתיחת פנים", "timestamp": 1662848387829}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עופר שטרייכמן\nחוות דעת - הרצאות:\nרק מוקלט! עופר השקיע וצילם את כל הקורס עם מצלמה והכל והחומר הפרונטלי תואם ב100 אחוז למוקלט. \nההרצאות מצוינות ועופר מאוד ברור בהסברים שלו.\n\n\nשם המתרגל/ת: מתן סולומון\nחוות דעת - תרגולים: מועמד להיות המתרגל הטוב ביותר שהיה לנו בתואר. בקורס כל כך יבש מבחינת החומר על סף המשעמם, מתן בא עם מלא אנרגיות ויוזמות והעיף את התרגולים באוויר באמת. הוא צייר על הלוח לוז תרגול ומראש אמר מה אנחנו הולכים לעשות כך שבכל התרגול היינו על החומר וידענו מה קורה. גם כשהגענו לנושאים המורכבים לקראת סוף הקורס הוא נתן הסברים כל כך טובים שהחומר נהיה כבר לא כזה מורכב על אף היותו מאוד מופשט.\n\nשעורי הבית: מתישים. נתחיל מזה שלא כל תרגיל בית נבדק וגם אם נבדק הוא שווה כ3 אחוזים של תקף. בנוסף הם מאוד ארוכים ויש שאלות נוראיות שלוקחות 4-5 עמודים של פורמליות מיותרת. 2 התרגילים האחרונים מאוד חשובים כי הם על החומר האחרון של הקורס (סיבוכיות) ועליו גם מבוסס רוב המבחן. \n\nהמבחן: הוגן מאוד. מי שידע את החומר בצורה טובה סיים עם 80+ ואפילו יותר. הייתה בו פורמליות שראינו בעבר וכל כיווני ההוכחה הופיעו בתרגולים.\n\nהשורה התחתונה: קורס שלא קשור כל כך לתארים שלנו אבל נחמד כי זה פותח את הראש לדברים אחרים. \nתהיו על החומר במהלך הסמסטר ותשקיעו ממש בעיקר בסוף הקורס כשנכנסים לסיבוכיות.", "timestamp": 1663150773856}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עופר \nחוות דעת - הרצאות: כדאי לראות מוקלט בפי 2. עופר מעביר את החומר בצורה טובה ומובנת. \n\nשם המתרגל/ת: מתן \nחוות דעת - תרגולים: מתן תותח. תמיד עם חיוך, מעביר את החומר בצורה מעולה ומוכן לענות על שאלות ולעזור כמה שהוא יכול. מאוד עוזר להפוך את הקורס לפחות משעמם. \n\nשעורי הבית: יש 6 גליונות יבשים. התרגילי בית לא קלים, דורשים זמן והשקעה. עופר החליט שיבדקו רק חלק מהגליונות בכל פעם ולכן יצא שלכל זוג בסוף יבדקו לו 2 גליונות מקסימום. סך הכל כל גליון שנבדק מוסיף רק 3% מגן. מאוד מבאס ולא תואם את ההשקעה ואת הזמן המוקדש לפתרון התרגילי בית. יש גם בוחן אמצע שמהווה 15% מגן אז אם אתם רוצים מגן  כלשהו כדאי מאוד להוציא שם ציון טוב.\n\nהמבחן: היה לנו מבחן הוגן בסך הכל, אך היו סעיפים קשים ושאלה ארוכה במיוחד. לקוות לפקטור. \n\nהשורה התחתונה: קורס לא מעניין מאוד, אז כדאי לעבור אותו עם מתן", "timestamp": 1664747156253}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: שטרייכמן\nחוות דעת - הרצאות: מזל שיש הקלטות\n\nשם המתרגל/ת: מתן סולומון\nחוות דעת - תרגולים: מתן אחלה מתרגל! מאד מומלץ, ממש איכפת לו והוא אחלה גבר\n\nשעורי הבית: ארוכייים ובודקים קשה מאד\n\nהמבחן: צרה. לעבור ולסיים.\n\nהשורה התחתונה: להתרחק רחוק מאד אלא אם כן מחוייבים לעשות. אז תשתדלו לעבור עם כמה שפחות מאמץ", "timestamp": 1667386614426}, {"author": "רדוקציה לשפיות שלי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: שי\nחוות דעת - הרצאות: \nהלכתי לכמה מן ההרצאות אבל ויתרתי באמצע כשהבנתי שהעמקה והסבר לא יהיו שם.\nההקלטות של עופר לא רעות אבל גם לדעתי לא מלמדות את רמת ההבנה המצופה מסטודנטים.\n\nשם המתרגל/ת: עופר\nחוות דעת - תרגולים: \nאני חושב שעופר באמת מתרגל בסדר, אבל ניכר כי אין זמן בתרגולים והוא מדבר בhighlevel כמעט על כל דבר, ושולח יותר מחצי מהתרגולים לקרוא לבד בפתרונות\\לפתור לבד.\nשמעתי שמתן מעולה.\n\nשעורי הבית:\nברובם ממוחזרים עם שאלה חדשה בסטייל דומה. בדיקה קטנונית ורואים כי מחפשים להוריד על שטויות, במהלך הסמסטר אפילו לא נתנו את האופציה לערער במודל והיה צריך לשלוח מייל לבד למתרגל כדי לבקש לערער, בדיחה גרועה.\n(עד שבסוף יצאו המון סטודנטים על תרגיל בית מסוים בגלל ציונים נמוכים מדי ופתחו ערעורים על ה-3 שב אחרונים)\n\nהמבחן:\nקשה אפילו להגיד מה הוא מצפה מהסטודנטים להבין. החומר מועבר בדרך אגב 90% מהקורס ואז במבחן מבקש להוכיח משפט שמלמדים תרגול שלם בקורס החופף של מדמח.\nהמבחן הרים וגבעות מעל הרמה בה מועבר הקורס.\nגם לא עוזר שהם לא מעלים פתרונות למבחנים, ופתרון המרצה לסוגיית הלמידה למבחן היא, כמו שהוא רשם במייל: \"כשאני הייתי סטודנט השתדלתי ללמוד במהלך הסמסטר, לא לדחות לבחינה, ובתקופת הבחינות הקפדתי ללכת לקומדיה לפני הבחינה\", כי הקורס הזה לא בדיחה מספיק טובה מסתבר.\n\nהשורה התחתונה:\nשי טוען שעל הסטודנטים להעמיק ולהבין לבד מעבר לקורס כדי להצליח כי \"זה המטרה של הטכניון\" ותוך כדי מצפה ממכם להיות טיורינג 2.0.\nאומר שהוא יהיה זמין במייל לשאלות ולא ענה על מייל אחד כל הסמסטר.\nבמודל יש פורום לשאלות כשהשאלה האחרונה שנענתה הייתה בתחילת הסמסטר.\nה2.5 נקז האלה זה מספר מצוץ שלא מספר כלום על הקורס הזה.\nהקורס מבוסס על 2 קורסים במדמ''ח שגדי מעביר.\nזה הקורס השני שאני נקל בו בפקולטה שהם מחליטים לקחת שני קורסים כבדים ממדמ''ח ולעשות מהם ילד מוטציה שאף אחד לא רוצה תוצרת ביתית של הפקולטה ל\"החלטות\" הגרועות ביותר בהיסטוריה.\n\nאם הייתה לי את האופציה לחזור לאחור, הייתי משחק ראש קטן, שובר את הראש רק על המוקלט של עופר וחוסך את כל האכזבה והאוול שבא עם הקורס מההשקעה מעבר. גידלתי מספיק שיערות לבנות בגלל רשף בבינה.\n\nאם אפשר, לא לקחת.\nאחרת תנסו לברוח משי ולכו לתרגולים עם מתן.", "timestamp": 1690307784044}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: הקלטות של עופר שטריכמן\nחוות דעת - הרצאות: ההקלטות של שטריכמן ברמה ממש גבוהה והיו אחלה. לא משנה אם אהבתם או לא סבלתם אותו בארגון, בקורס הזה כשאפשר לשים אותו על X2 הוא באמת מעביר את החומר מעולה.\n\nשם המתרגל/ת: מתן סולומון\nחוות דעת - תרגולים: מתן מדהים! אחד המתרגלים הטובים שהיו לי בלי ספק. כל תרגול היה מסודר, מאורגן והועבר מעולה ובאווירה טובה, ומתן תמיד ענה על שאלות ודאג שכולם יבינו. לקראת המבחן קיים כמה שעות קבלה לא קצרות בכלל (למרות שלא היה מחויב) כולל שעת קבלה גדולה שהייתה חזרה על כל חומר הקורס ודגשים לשאלות. באמת מתרגל מעולה מכל בחינה והיה מדהים ללמוד אצלו.\n\nשעורי הבית: 6 גיליונות יבשים בזוגות. הבדיקה די קפדנית, לפעמים קפדנית מדי ומורידים הרבה בלי סיבה. ממליץ לשים דגש על פורמליות מאוד ולהשוות עם אנשים לפני שמגישים כי לא לכל השאלות יש רפרנס. די מכינים למבחן טוב לדעתי.\n\nהמבחן: היה לדעתי ממש הוגן. לא מבחן קל והיה מנוסח קצת מוזר אבל סה\"כ לא היה משהו שלא ראינו מתישהו בקורס, והתכוננות טובה של כמה ימים הספיקה. הסגל לא מפרסם פתרונות למבחני עבר אבל בקורס הזה די יודעים אם הצלחתם לפתור את השאלה או לא אז זה לא כזה משנה.\n\nהשורה התחתונה: מתחיל קצת משעמם אבל החצי השני של הקורס (על מכונות טיורינג) נהיה ממש מעניין ולקראת הסוף מאוד התחברתי, היה אחלה ואפילו שזה לא קורס שמאוד קשור לתואר בצורה ישירה, זה כן ידע שחשוב שיהיה.", "timestamp": 1691471753349}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עופר שטריכמן (הקלטות) \nחוות דעת - הרצאות: \nעושה את העבודה לגמרי\n\nשם המתרגל/ת: עופר גוטמן \nחוות דעת - תרגולים: \nמצוין, מאוד פורמלי ומדויק\n\nגם מתן היה מאוד טוב ונחמד\n\nשעורי הבית: \nלרוב מעיקים וארוכים אבל מאוד חשובים בשביל הלמידה \n\nהמבחן: \nהיה בסדר חוץ משאלה אחת שאף אחד לא הבין מה הייתה הכוונה בה. תשובות זהות לחלוטין פעם התקבלו ופעם לא, ניסוח מאוד מבלבל, נאמרו הערות במהלך המבחן לגבי איך ניתן לפרש את השאלה ואז בסופו של דבר לא התקבלו תשובות שאמרו במבחן שאפשר ככה לפרש. התייחסות לערעורים לא הייתה מספקת אצל רבים, והשיחה עם המרצה הייתה מלווה בנימה מזלזלת עם כל מיני משלים ודימויים שלא ברור מה הקשר שלהם לתוכן הערעור. הגישה הייתה שרק מה שהם התכוונו נכון, למרות שהשאלה לא הייתה מוגדרת היטב, מבלי להודות בטעות שהם עשו ולקבל מספר תשובות בשאלה שבה ברור שרוב האנשים לא הבינו מה התכוונו בה. השאירו ממוצע נמוך ללא פקטור או בונוס על אותה שאלה הזויה של 18 נקודות.\n\nהשורה התחתונה: קורס מעניין שדורש פורמליות ויצירתיות ודורש השקעה. חבל שבקורס כזה שמוגדר כמתמטי מביאים מבחן שהשאלות שלו לא מנוסחות היטב, ושהתשובות לערעורים בו לא מתייחסות לטיעונים מתמטיים אלא לרעיונות מופשטים", "timestamp": 1693860784331}]}