{"posts": [{"author": "הדודה", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות:מרצה מדהים, הרצאות מעניינות מאוד \n\nשם המתרגל/ת: אורון מדמון\nחוות דעת - תרגולים: תרגולים שפחות מועילים לחומר ולהבנה אבל מתרגל מאוד נחמד ואכפתי\n\nשעורי הבית: שיעורי הבית קלים מאוד\n\nהמבחן: היה פרוייקט הוגן, קצת ארוך אבל די קליל עם עזרה לכל אורך העבודה עליו מצוות הקורס\n\nהשורה התחתונה: צוות קורס מדהים!! עזרה אינסופית ויאיר מרצה מדהים. קורס בהחלט ממולץ משלב ידע ממספר קורסים קודמים. מאוד מעניין", "timestamp": 1597739278123}, {"author": "סטודנט ממורמר", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: \nפרסם הקלטות דיי טובות בסה\"כ. ממליץ לנסות לעקוב במהלך הסמסטר ולפני המבחן לראות הכל מחדש כמו שצריך, לדעתי זה יכול לעבוד טוב. לא חושב שהכיתה הפוכה הכרחית. בדר\"כ הוא מתחשב אבל לא מאוד אהבתי את המבחן.\n\nשם המתרגל/ת: אורון מדמון, בחור דיי נחמד אבל הוא כבר מסיים אז לא אפרט יותר מידיי ברשותכם (תודה על ההסכמה חח)\nחוות דעת - תרגולים: \nיכולים להיות תרגול סביר, יכול להיות נחמד כדי להשלים ידע. אישית לא הלכתי ובאיזשהו שלב בסמסטר הפסקתי לראות את ההקלטות. ההרצאות מספיקות לדעתי.\nשעורי הבית: \n7 גליונות שצריך לעשות 5. מה שלא רטוב החל מגיליון 2 רלוונטי למבחן וגם וריאציות של השאלות (אחת או שתיים) יופיעו במבחן. לרוב מרופרנסים\nפרויקט בחלקים מתגלגל (5 חלקים). \nהפרויקט בעיקר רטוב, דיי מציק ולא ממש רלוונטי למבחן.\nהמבחן: \nבדיקה קצת מגעילה אבל לא מבחן קשה מאוד. אם למדתם כנראה תצליחו. מומלץ לחפור שם במבחן\nהשורה התחתונה: \nקורס טוב למי שרוצה להמשיך בסטטיסטיקה וחקר ביצועים. לא מאוד התחברתי אבל אני מכיר בזה שהידע הנרכש חשוב.", "timestamp": 1634758040734}, {"author": "pvalue", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: הרצאות מעט איטיות אבל יאיר מרצה בסה\"כ טוב. עונה על שאלות כשצריך והכל מאד ברור. \n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: וואו! איזה מתרגל מדהים, יודע את החומר לעילא ולעילא, תרגולים בנויים בצורה מעולה כך שהם מסדרים את כל החומר של ההרצאות בצורה תמציתית ולעניין ועם אינטואיציה נהדרת\n\nשעורי הבית: היו באזור ה6 תרגילי בית להגשה, ממש קלילים ועוזרים להבנה של החומר, בן ממש עוזר בשעות קבלה ובמיילים ונותן הכוונה ורואים שהוא באמת רוצה שנבין. היו גם 5 חלקי פרויקט מחולקים במהלך הסמסטר והפרויקט היה באמת מרווח  והיה עיקר הקורס. מאד חשוב לבחור דאטא-סט טוב!!\n\nהמבחן: היה מבחן בע\"פ - פורמט נהדר לבחינה!! בלמידה למבחן התרכזנו באמת בהבנה של החומר והמבחן היה מאד הוגן - כלל 3 שאלות (קלה, בינונית וקשה) שהוגרלו ממחסן שאלות.\n\nהשורה התחתונה: אחלה של קורס אם רוצים ללמוד מעבר לסטטיסטיקה 1, מלמדים הרבה חומר שבאמת רלוונטי לתעשייה (מונטה קרלו, הרחבה על מבחנים, p-hacking)", "timestamp": 1647411604117}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יאיר גולבדרג\nחוות דעת - הרצאות: הרצאות מעניינות, המרצה איכפתי ועונה היטב לשאלות.\n\nשם המתרגל/ת: בן פילארסקי \nחוות דעת - תרגולים: בן מתרגל מדהים, מסביר הכל ממש טוב (רק לפעמים יש יותר מדי חומר והוא לא יכול להספיק את הכל). כדאי מאוד לקבוע איתו שעות קבלה זה ממש מועיל.\n\nשעורי הבית: יש הרבה אבל לא מאוד קשים.\n\nהמבחן: אצלנו היה מבחן בעל פה שהיה יותר קל וגם הביא להבנה יותר טובה של החומר.\n\nהשורה התחתונה: קורס מעניין אבל מאוד מאוד מאוד עמוס בשיעורי בית ובפרוייקט.", "timestamp": 1647611599704}, {"author": "-----", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: \nמרצה אחלה סה\"כ, הרצאות קצת איטיות אבל יש הרצאות מוקלטות משנים קודמות שאפשר לשים עם מהירות גבוהה יותר.\nבתור מנהל קורס הוא מאוד אחלה, מאוד מתחשב בסטודנטים.\nאני אישית העדפתי את ההקצאות המוקלטות אבל זה משיקולי מערכת, אם היה מתאפשר הייתי מעדיף להגיע להרצאות.\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: \nמתרגל פשוט מלך, גם מסביר מעולה וגם מעביר תירגולים בצורה כיפית.\nמומלץ בחום.\n\nשעורי הבית: \nיש בקורס הזה גם שיעורי בית וגם פרויקט בחלקים.\nכל שבוע יוצא מטלה, שבוע אחת תרגיל בית שבוע אחרי זה חלק של פרויקט. התרגילי בית חופרים ולרוב לא מעניינים. הפרויקטים גם משעממים ולא מעניינים כלכך. המטלות היו דיי מעיקות.\nבסוף הסמסטר יש אפשרות להציג את הפרויקט ולהגדיל את הנפח שלו מאחוז הציון הסופי. (למרות שבפועל בגלל הערכה חלופית בגלל קורונה זה הפך להיות חובה).\n\nהמבחן: \nהערכה חלופית בגלל הקורונה. במקום מבחן בכתב 70% הייתה בחינה בע\"פ 40% והצגת הפרויקט שנעשה במהלך הסמסטר 30% (והשאר כמו שהיה).\nהמבחן בע\"פ היה משתנה מאדם לאדם, אני קיבלתי שאלות יחסית פשוטות למרות שאנשים אחרים קיבלו שאלות יותר מאתגרות.\n\nהשורה התחתונה: \nקורס קצת מעיק בגלל ההגשות השבועיות, בנוסף החלק הראשון קצת איטי כי החומר שמועבר כבר מוכר מקורסים אחרים (רגרסיה לינארית, רגרסיה לוגיסיטית, וכו..).\nאבל מרגיש כמו קורס מאוד חשוב.", "timestamp": 1647631601364}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: קצת איטי, אבל ביחס לכמות החומר שיש בקורס הזה, מרצה איטי זה בדיוק מה שצריך כדי להבין כמו שצריך. מסביר מעולה ונותן אינטואיציות ודוגמאות טובות. רואים שהוא ובן משתדלים לבוא לקראת הסטודנטים -- פלוס ענק\n\nשם המתרגל/ת: בן\nחוות דעת - תרגולים: מתרגל מעולה, לפעמים מתגלות טעויות בקבצים שהוא מכין לתרגולים אז לשים לב\n\nשעורי הבית: מתחלקים לשני חלקים:\n1. הגשות יבשות על בסיס (כמעט) שבועי, די עמוס (והתרגילים לא תמיד פשוטים) אבל הם תורמים להבנה טובה של החומר. בדיקה די קטנונית ומעצבנת (אהמציצלסקיאהמ).\n2. פרויקט מתגלגל בחמישה חלקים על דאטהסט לבחירתנו. עשוי להיות די מעיק כי לפעמים השאלות לא מוגדרות בצורה מדויקת והמשימות עצמן די ארוכות, אבל הפרויקט מאוד חשוב כדי ליישם בפועל את כל החומר התיאורטי שלומדים בהרצאות.\nיש אפשרות להכין מצגת סיכום פרויקט שתהיה שווה 10% מהציון הסופי.\n\nהמבחן: סמסטר חורף תשפ\"ב, אחרי סקר שינוי אופן הערכה הוחלט לשנות את אופן ההערכה בקורס למבחן בע\"פ + מצגת סיכום פרויקט. בפועל השאלות במבחן בע\"פ היו על מושגים די בסיסיים ועל הבנה יחסית שטחית של החומר (מה זה המושג X, מה עושה תהליך Y, מתי נשתמש באלגוריתם Z וכו').\n\nהשורה התחתונה: הקורס עמוס (מאוד!) מבחינת שיעורי בית ופרויקט מתגלגל, אבל מאוד חשוב (הרבה יותר ממבוא לסטטיסטיקה)", "timestamp": 1647699394278}, {"author": "May", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "עמוווווס\nשיעורי בית גם יבשים וגם פרויקט בפייתון להגשה\nבנוסף למבחן בסוף הסמסטר", "timestamp": 1649683721466}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: \nאיטיות מאוד, אבל מוסיף תרגילים שמאוד עוזרים \nשם המתרגל/ת: בן\nחוות דעת - תרגולים: \nמתישים, לא מתרגלים בהם כמעט כלום, אבל בן מאוד נחמד\nשעורי הבית: \nיותר מדי. עמוס. כשיש שבוע עם הגשה של הפרויקט אין ש\"ב אבל פשוט לא מתרגלים את החומר הזה ומדלגים שבוע אחרי לחומר הבא.\nהמבחן: \nהיה בעל פה, די קל. \nהשורה התחתונה:", "timestamp": 1653397244120}, {"author": "דארק ביט", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יאיר (הקלטות)\nחוות דעת - הרצאות:\nההקלטות מחולקות \nלהרבה סרטונים קצרים לפי נושאים, עם שאלות סיכום, סה״כ מרצה טוב\n\nשם המתרגל/ת: עמית \nחוות דעת - תרגולים: \nלהתרחק!!!!\nגישה מחורבנת, עסוקה בכמה אנשים הגיעו או לא הגיעו לתרגול שלה ובלהתייחס מגעיל לסטודנטים במקום בלעזור לסטודנטים להבין את החומר יותר טוב.\nשעורי הבית: \nהגשות שבועיות די עמוסות אבל עוזרות להבין את החומר \n\nהמבחן: \nמבחן ארוך, שבוחן הרבה דברים שלא קשורים לסטטיסטיקה בנוסף לחומר הנלמד והבדיקה הייתה קטנונית\n\nהשורה התחתונה: \nתשיגו הקלטות של ציצלסקי אחרת תצטרכו לסבול את המתרגלת הכי מעצבנת שקיימת.", "timestamp": 1676454890836}, {"author": "אנמ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: מרצה נהדר, נכחתי בהרצאות הפרונטליות והוא היה ברור מאוד ומעניין מאוד, נותן המון אינטואיציות וחומרי עזר כדי לעזור לסטודנטים להבין את החומר טוב מאוד. רואים שאכפת לו, והוא מתאמץ לתת כמה שיותר דוגמאות מחיי היומיום כדי להוריד את החומר לקרקע.\nספר הקורס מעולה והקורס מבוסס עליו, אז שווה להיעזר בו.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: וואו, איזה מתרגלת. הסברים ברורים, רמה מקצועית מאוד גבוהה וחדה, ועושה מעל ומעבר כדי שהסטודנטים שלה יבינו. אבל מעבר לזה - היא פשוט אדם אכפתי ומקסים, שנכון להתגמש עבור הסטודנטים כדי לעזור להם. אחת המתרגלות הטובות שהיו לי בפקולטה. \n\nשעורי הבית: דורשים זמן, נחוצים להטמעה של החומר. לא היו רפרנסים במחזור שלי וזה היה קצת קשה. הפרויקט מאוד עמוס, לא לזלזל.\n\nהמבחן: לא היו לנו מבחנים קודמים ללמוד מהם וזה הקשה מאוד. למבחנים המועטים שהיו, לא היו פתרונות. טיפ - לפתור את השאלות מההרצאות של יאיר, ולפתור מחדש את התרגולים. סך הכל המבחן היה קשה אבל כן היה פקטור של 12 נקודות... אז בסדר\n\nהשורה התחתונה: קורס מעניין מאוד, דורש השקעה, במיוחד לקראת הסוף. הצוות מקסים ועושה כמיטב יכולתו בשביל הסטודנטים באופן מעורר הערכה.", "timestamp": 1676491841677}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: מרצה מצוין שמסביר את החומר בצורה מאוד נינוחה ככה שהכל נהיה מובן בסופו של דבר. עונה על כל השאלות והוא מאוד בקיא בחומר.\n\nשם המתרגל/ת: עמית ברקוביץ'\nחוות דעת - תרגולים: מתרגלת טובה שידעה את החומר לעומקו וענתה לכל שאלה מיד. לפעמים קצת רצה אז צריך לעקוב אחרי כל המעברים. כן השקיעה באופן שבו היא מעבירה את התרגולים וכתבה על הלוח מה אנחנו הולכים לעשות היום בתרגול וקווי מתאר איפה אנחנו עומדים. \n\nשעורי הבית: 6 תרגילי בית יבשים ו5 משימות פרויקט של קוד. תרגילי הבית מאוד מלמדים על החומר התיאורטי בעוד שמשימות הפרויקט מלמדות יישומים פרקטיים של החומר הנלמד וכן מרעננות את הזיכרון מבחינת השימוש בנוסחאות שמציבים וכו'. בסך הכל שווה להשקיע בתרגילי הבית ובפרויקט כי הם מלמדים וכי הם מהווים ביחד 30 אחוז תקף.\n\nהמבחן: בסך הכל יכול לומר שהמבחן היה הוגן. פעם ראשונה שלא היה דף נוסחאות והם ציפו שנזכור מלא דברים בעל פה. היה קצת קשה להתכונן כי אמרו שמבחני העבר לא רלוונטיים כל כך ועדיף להתמקד בלקרוא את ההרצאות ולהבין את החומר לעומקו. מי שזכר כמה שיותר דברים הרוויח בסוף. היה פקטור של 12 נקודות ובכל זאת הממוצע נמוך ביחס לשנים קודמות עם 50 נכשלים מתוך 130 ניגשים. הופתענו. \n\nהשורה התחתונה: אחלה קורס והוא מעמיק את ההבנה הסטטיסטית שלנו בתואר. הרבה קורסים נעזרים בדברים שלמדנו בקורס הזה אז כדאי להשקיע.", "timestamp": 1676744883512}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יאיר גולדברג (מוקלט)\nחוות דעת - הרצאות: ההקלטות היו מעולות, קצרות משמעותית מהזמן של ההרצאה בכיתה ומובנות\n\nשם המתרגל/ת: עמית ברקוביץ'\nחוות דעת - תרגולים: מתרגלת ממש טובה, מסבירה לעומק כל שאלה ועונה על שאלות אם יש לנו. לפעמים קצת רצה, אבל תמיד אפשר לעצור אותה ולבקש הסברים.\n\nשעורי הבית: עמוסים, יש הגשה כל שבוע של תרגיל בית או פרויקט. מתבססים באופן מלא על החומר מההרצאות והתרגולים.\n\nהמבחן: הסמסטר לא היה דף נוסחאות והייתה ציפייה לא ברורה מהסגל שנזכור כל דבר קטן שראינו (אף על פי שהם אמרו שהמבחן יהיה מותאם לכך שאין דף נוסחאות - מה שכמובן לא קרה), לכן המבחן בחן זיכרון וממש לא מעבר לזה.\nהציונים היו די ביזיוניים ביחס לשנים קודמות עם כמות מכובדת של נכשלים, אחרי פקטור. חשוב גם לציין שהבדיקה לא הייתה מקלה בכלל\n\nהשורה התחתונה: לא ברור אם הסגל רוצה שנבין סטטיסטיקה או נלמד סתם דברים בעל פה, כדי שיום אחרי זה נשכח אותם.", "timestamp": 1676827903095}, {"author": ",_,", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יאיר גולדנברג\nחוות דעת - הרצאות: מרצה מאוד טוב. הייתי בהקלטות שלו והכל מוסבר ומועבר טוב מאוד. נותן המון דוגמאות בהרצות וזה נותן אינטואיצה. יש נוסאים לא הכי ברורים תמיד אבל בתרגולים או בפיזי מסבירים\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: מדהים נסיך אמיתי מקצוען ברמות. מעביר את החומר בהתחלה מההרצאה \nואז עושה תרגילים לחזרה. התרגולים באווירה טובה תמיד. דאג לסטודנטים והקליט את כל התרגולים בסמסטר שזה עזר.\n\nשעורי הבית + פרויקטים: ארוכים הרבה ומתישים בעיקר לקחו לנו המון זמן וזה די שבועי אז לחוץ וצפוף. לא למדתי מהם המון אבל קצת עזרו לחזרה על החומר\n\nהמבחן: המבחן הוגן בסך הכל. מועד ב היה קשה יותר בפער ממועד א הוא היה קצר יותר אבל הם הורידו את השאלות הקלות בכוונה. המבחן הוא בסהך\n\nהשורה התחתונה: קורס מומלץ החומר מעניין והסגל מצוין. מבחן קשה ולךעמים קשה לקבל ציון גבוה בפרויקטים", "timestamp": 1678651520838}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: אריתי את המוקלט שלו, הם ממש טובים, ברורים ומובנים.\n\nשם המתרגל/ת: עמית \nחוות דעת - תרגולים: מקצועית, מעבירה את החומר בצורה טובה מאד, אולי מצפה קצת יותר מדיי מהידע של הסטודנטים. \n\nשעורי הבית: שבועיים, חלק תכנותיים (פייתון) וחלק יבשים.\n\nהמבחן: מאד קשה (ראו היסטוגרמה לעומת שנים קודמות) ופצאום הורידו דף נוסחאות ללא סיבה טובה חוץ מהלוריד את הממוצע ולהתקשות על הסטודנטים. הטענה היתה שהמהחן יהיה יותר קל והבנתי אך זה לא היה המצב. גם אין פצרונות למבחנים המועטים שיש, המקשה ברמות על הלמידה.\n\nהשורה התחתונה: אני אישית אובה סטטיסטיקה, אבל כל ההתנהלות עם המבחן משאיר טעם רע הפה, כי זה מאד סתם.", "timestamp": 1678696637941}, {"author": "נציג לא רשמי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: ראיתי בעיקר את המוקלט. סה\"כ מעביר את החומר בצורה טובה אם כי בהקלטות לא תמיד יורד לפרטים המלאים בהוכחות (\"ככה זה\")\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: מתרגל מדהים. תמיד עוזר ומסביר בצורה מעולה. צריך עוד מתרגלים כמוהו בפקולטה.\n\nשעורי הבית: יש גיליונות של ש\"ב ושל פרויקט מתגלגל לאורך המסמטר. בש\"ב חצי תיאורטי חצי מימוש (בפייתון). הפרויקט מיותר לחלוטין. חוזר על המימושים מהש\"ב ולא תורם בהבנת החומר.\n\nהמבחן: מבחן לא קל. היה יחסית עמוס אבל סה\"כ הוגן. השנה פעם ראשונה היה ללא דף נוסחאות. מצד שני, פתיר בשעה וחצי עם דף נוסחאות...\n\nהשורה התחתונה: קורס נחמד שמראה עוד שיטות סטטיסטיות.", "timestamp": 1678778325214}, {"author": "תכלס תכלס", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: מרצה סבבה אם רואים מוקלט, ועל הפנים אם באים פרונטלי. לא אכפת לו מהסטודנטים בכלל, רק להעביר את הקורס.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: חד משמעית המתרגלת הכי הכי גרועה שפגשתי בחיים שלי, ביטלה בכוונה פתרונות של תרגולים בגלל קטנוניות של כמה מגיעים לתרגולים שלה. בוהה באוויר כשמדברים איתה, וחד משמעית אפס יכולת ללמד.\n\nשעורי הבית: \nממש ממש עמוסים, הקורס עצמו לא בנוי טוב בכלל\nהמבחן: \nההיסטוגרמה מדברת בשם עצמה\nהשורה התחתונה: \nלברוח הכי רחוק שאפשר מהסגל ההזוי הזה בלי קשר לקורס", "timestamp": 1679222155751}, {"author": "מהמר במרוצי גמלים", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יאיר גולדברג\nחוות דעת - הרצאות: ראיתי את הסרטונים המוקלטים משנים קודמות. השנה יאיר הקליט גם את השיעורים הפרונטליים, דבר שעזר לפעמים אם משהו לא היה ברור מהסרטונים. מרצה מצוין, מסביר באופן ברור ומעניין, ומראה המון התחשבות בסטודנטים.\n\nשם המתרגל/ת: עומר ציצלסקי ואבישג נבו\nחוות דעת - תרגולים: בסמסטר עצמו הלכתי לתרגולים של עומר שהתקיימו בזום. מתרגל מעולה, אחד הטובים בפקולטה. לא מדלג על כלום ומסביר עד שהכול ברור לכולם, גם אם צריך להמשיך את השיעור מעבר לזמן. לקראת המבחן צפיתי בהקלטות של אבישג והיא ללא ספק גם תותחית. \n\nשעורי הבית: 5 תרגילי בית ו-5 תרגילי פרויקט זהים למבנה בשנה שעברה. הש\"ב היבשים סבבה, הפרויקט סופר מתיש. גם אם אתם מתכוונים לרפרנס עדיין תצטרכו לעבוד קשה. לפחות הבדיקה לא קפדנית במיוחד ממה שראיתי.\n(ובהזדמנות זאת - תודה לצדיקים שמעלים את הפרויקטים שלהם לדרייב)\n\nהמבחן: המבחן השנה היה מורכב מ-15 שאלות אמריקאיות, עם 3 חלקים של 5 שאלות כל אחד. היה לא פשוט אבל הוגן לדעתי. ניתן פקטור שאפשר לצבור עד 124 נקודות במבחן, וביטלו את הדרישה לעבור את המבחן כדי לעבור את הקורס.  הקושי העיקרי הוא לא שהחומר קשה במיוחד (בהשוואה לסטטיסטיקה 1), אלא שהיה סיוט להתכונן אליו - מבחני העבר מבוססים על שאלות פתוחות, ואין להם פתרונות או אפילו סריקות. לכן מומלץ להתכונן ע\"י פתירה מחדש של התרגולים, ש.ב., ותרגילים מספר הקורס (הועתקו ממנו כמה שאלות במבחן). טיפ, אם גם לכם יהיה מבחן אמריקאי, תשיגו מחשבון טוב שאפשר לחשב אתו שברונים וצפיפות של התפלגות נורמלית.\n\nהשורה התחתונה: אם אתם ממערכות מידע וחושבים לקחת את הקורס כחלק משרשרת למידה חישובית, תעשו לעצמכם טובה ותרשמו בזמן למודלים גרפיים הסתברותיים (בניגוד אליי). חבל על הממוצע שלכם ועל ההשקעה העצומה שהקורס דורש, שבקלות מרגיש כמו 5 נק\"ז.\nאם בכל זאת להגיד כמה דברים טובים:\n1. צוות הקורס מדהים ואכפתי מאוד. יש הקלטות להכול.\n2. הקורס הרגיש לי הרבה יותר מעניין ופרקטי מסטטיסטיקה 1.\n3. הקורס עזר לי להבין נושא וחצי שמשותפים לו וללמידה חישובית 2 שלקחתי במקביל.", "timestamp": 1715240605811}, {"author": "איש", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה:  יאיר\nחוות דעת - הרצאות: המוקלטות שלו הוא זהב טהור\n\nשם המתרגל/ת:  אבישג\nחוות דעת - תרגולים: מתרגלת מעולה במהלך הסמסטר, מסבירה דברים עם הרבה מוטיבציה לתחום, לקראת סוף הסמסטר לא תיקשרה ובשעת הקבלה לא היה ערך מוסף כלל. \n\nשעורי הבית:  מרופרנסים\n\nהמבחן: מזעזע, מבחן אמריקאי שלא בדק שומדבר, 9 אפשרויות לכל שאלה וכשמעולם לא ראינו את מבנה המבחן הזה. הציון זה משתנה מקרי מ0 עד 128.5 כי היה פקטור, ביטלו את הצורך לעבור את המבחן בשביל לקבל ציון בקורס. מזעזע, אל תקחו את הקורס הזה אין לו ערך מוסף והוא פשוט משחק התעללות של המתרגלים והמרצה בסטודנטים שלהם.\n\nהשורה התחתונה: לא לגעת, קורס מזוויע גרפים הסתברותיים של בתיה עדיף.", "timestamp": 1715244861136}, {"author": "נתי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יאיר \nחוות דעת - הרצאות: הרצאות מעניינות \n\nשם המתרגל/ת:  אבישג\nחוות דעת - תרגולים:  תרגולים טובים\n\nשעורי הבית:  עמוסים\n\nהמבחן:  לא הוגן, הגעתי למבחן מוכן אחרי כל מבחני העבר- לא הצלחתי דבר, קיבלתי את הציון הכי נמוך בתואר שלי, מבחן לא מייצג, מבחן אמריקאי מזוויע שלא קשור לשומדבר שראינו במהלך הסמסטר, אף לא דוגמה אחת.\n\nהשורה התחתונה:  לא לגעת! הצוות בקורס צוות מקסים ומתחשב, היה חומר פתוח למילואמניקים, בתור מילואמניק שאשכרה נלחם בעזה ונכנס למבחן הזה עם חומר פתוח, לא היה לי סיכוי. תפסיק לחפש דרכים קלות יותר לבדוק מבחנים על חשבוננו. לא מאמין שזה פעם שניה שאני עושה את הקורס המזוויע הזה, תבדקו את מה שלימדתם! לא מעבר! די!!!", "timestamp": 1715247775767}, {"author": "שי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה:  יאיר\nחוות דעת - הרצאות:  מרצה מאוד מעניין אני מאוד נהנתי בקורס הזה איתו \n\nשם המתרגל/ת: אבישג \nחוות דעת - תרגולים: לא ממליץ לשאול שאלות במיבחן היא יכולה להטעות איתכם, לא ברור לי מה זה מתנשאת ככה עלי אחרי סמסטר שהיה נפלא\n\nשעורי הבית: בסדר\n\nהמבחן:  קשה מאוד במתכונת חדשה לא בודק את הידע שלמדתי בקורס וגם כשהמרצה מסכים איתי שמשהו לא בסדר בשאלה אמריקאית אני לא מקבל את הניקוד וצריך לעשות מועד ב' עוד הפעם נ\n\nהשורה התחתונה: לא אהבתי", "timestamp": 1715519962012}, {"author": "קיבלתי עובר", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות:  הקלטה סבבה ממש מסביר טוב\n\nשם המתרגל/ת: אבישג\nחוות דעת - תרגולים:  וואלה אין לי מילה רעה לומר אבל מרגישים שזה סמסטר ראשון שהיא מתרגלת, אחלה כשאנחנו לומדים אבל המטרה שלנו זה לעבור את המבחן ולא היה ערך מוסף, להראות לנו מעברים על מצגת כשאנחנו צריכים זיכרון שריר לא באמת מלמד. עדיף מוקלטים שנתנו הסמסטר משנה שעברה ציצלסקי כותב הכל על הלוח\n\nשעורי הבית: וואלה לא קשורים למבחן בשיט \n\nהמבחן: אמריקאי,  לא ברור מי חשב שבקורס כזה אפשר לבחון אותך במבחן עם תחומים. זה לא משאיר מקום לאנושיות, אנשים יצאו מהמבחן הזה כמו אחרי ה7 באוקטובר, בהלם, בתדהמה, ולא מבינים איפה היה צה\"ל.\nהשורה התחתונה: קיבלתי בדיוק עובר בקורס, לא נוגע בחרא הזה בחיים שלי, ממתי מבחן כזה בודק משהו", "timestamp": 1715521312319}, {"author": "אורן", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: ראיתי מוקלט היה בסדר\n\nשם המתרגל/ת:  עומר מוקלט ואבישג \nחוות דעת - תרגולים: במהלך הסמסטר נכנסתי לאבישג כשהייתי בפקולטה, אני אישית לא מתחבר ללעבור על מצגת בתרגול בשביל זה יש הרצאה. עדיף מישהו שיכתוב על הלוח ויפתור איתי.\n\nשעורי הבית: עמוס מאוד אבל 30 אחוז מגן \n\nהמבחן: לא יודע אני קיבלתי במבחן גם חומר פתוח גם 9.25 לכל שאלה ויצא שניחשתי את הרוב המוחלט של השאלות, קיבלתי בדיוק נקודה מעל עובר\nלא שלטתי בכלום במהלך המבחן, כאילו המבחן הזה לא נרשם בשביל הקורס הזה בכלל. מה אני צריך לזכור עכשיו מעבר ספציפי מבין מאות שקופיות? \nכאילו סבבה אמריקאי והצבות אבל מתי בדיוק למדנו את זה במהלך הסמסטר? מתי ראיתם מישהו מהסגל כותב משהו על הלוח? הגעתי לפתיחת מחברות לגלות שפתרתי דברים אחרת לגמרי מהפתרון האמיתי ובמבחן לא ידעתי איך לפתור כלום, הכל בדיעבד היה טריקים לא טרוויאלים מהתרגולים, בזבוז זמן של קורס,  העיקר הסגל צועק 80 אחוז עוברים, כן, כשצריך לפתור 4 שאלות במבחן בשביל עובר מתוך 15 שאלות כנראה שיהיה לך הרבה עוברים מר סטטיסטיקה.\n\nהשורה התחתונה: אין לי מה לומר, מביך ותודה לאל שאני לא צריך מועד נוסף בזה", "timestamp": 1716240539151}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יאיר\nחוות דעת - הרצאות: ראיתי רק הרצאות מוקלטות שהמרצה הכין שזה היה נוח החומר היה ברור בסה״כ וממש מסודר המרצה מסביר בסבלנות ולא רץ\n\nשם המתרגל/ת: אבישג\nחוות דעת - תרגולים: הסבירה ממש טוב ונתנה המון אינטואיציה\nהעלתה פתרונות שלה (והשתמשה בהם בתרגול) ובסוף הסמסטר גם את ההקלטות של כל התרגולים\n\nשעורי הבית: הגשות כל שבוע השב היו ארוכים אז רפרנסתי איפה שהיה אפשר למרות שלא היה נראה קשה\n\nהמבחן: מזכיר את המבחן בסטטיסטיקה 1. מבחן אמריקאי טכני ברמות שאלו דברים די אחרים ממה שראינו בתרגול והיו המון חישובים והמון מקומות להתבלבל, גם לא היו מבחנים מפעם שמכינים אותך לזה אז לא היה זמן לסיים את כל המבחן והיה פקטור גם\n\nהשורה התחתונה: תקחו את הקורס אם אתם חייבים או אם אתם מאוהבי סטטיסטיקה", "timestamp": 1716376928195}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יאיר \nחוות דעת - הרצאות: הרצאות מוקלטות מעולות \n\nשם המתרגל/ת: אבישג\nחוות דעת - תרגולים: מתרגלת עם המון מוטיבציה, בחורה אהובה מאוד \n\nשעורי הבית: עמוסים אבל קל לרפרנס\n\nהמבחן: בהתחלה היה מבחן מזעזע, מועד א' באמת היה מבחן קל והוגן אבל לא ידענו איך לאכול אותו, לא הגענו מוכנים אליו בכלל, התכוננו על מבחני עבר ולא היה לנו מושג מה יהיה, את מועד ב' עשינו אחרי תחקור מעמיק של מועד א' וזה היה מבחן הוגן לחלוטין. אני חושב שצריך לנטוש את השיטה של מבחן אמריקאי במקצוע הזה\nהשורה התחתונה: לא קורס להיט, בין הקורסים שגרמו לי להכי הרבה לחץ בתואר, לא בגלל שלא הבנתי, מהפחד לטעות במבחן האמריקאי. וכל כך הרבה חומר.", "timestamp": 1717260304647}]}