{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: מסביר בסדר, סה\"כ מעניין בתור ידע כללי. הרבה חשמל ואלקטרוניקה. מי שלא מתחבר לנושאים האלה ישתעמם מאוד. כדאי לסכם במהלך ההרצאות כי הוא אומר הרבה דברים בע\"פ שמופיעים בבחנים.\n\nשם המתרגל/ת: יוחאי\nחוות דעת - תרגולים: הרבה זמן לא נתקלתי במתרגל כל כך גרוע\n\nשעורי הבית: יש תרגילים שמתחילים במעבדה אבל אף פעם לא מסיימים אותם והם נמשכים למהלך השבוע, כמו עצם בגרון, אין עם מי להתייעץ ויש רק את גוגל כי הסגל לא עוזר בשיט. מתאים למי שטוב באלקטרוניקה - אדרואינו וכו'.\n\nהמבחן: אין, יש פרויקט עם שותפים שעובדים עליו בחודש האחרון בסמסטר. דורש ידע בניתוח נתונים לפני. מעיק ומציק וכמובן שאין עזרה מהסגל. יש 3 בחני אמצע שמהווים 5% מגן. הם אמריקאים וקלים אם לומדים אליהם, זה תמיד החומר של 3 ההרצאות האחרונות. בכללי הקורס מתנהל כשכונה, אין הנחיות ברורות והכול צריך לנחש, או להציק במיילים.\n\nהשורה התחתונה: קורס בחירה גרוע!! אלא אם אלקטרוניקה זה בדם שלכם, אם לא תוותרו זה חתיכת כאב ראש", "timestamp": 1626619695838}, {"author": "קיפי הקיפוד", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: שלומי מעביר את החומר בצורה טובה, דואג להביא דוגמאות ומשלב הסברים וסרטונים טובים מהאינטרנט, הזמין מרצים אורחים, הסביר על תחום העבודה שלהם מהמעבדה.\nשם המתרגל/ת: יוחאי ואדם\nחוות דעת - תרגולים: מעבדות, מגיעים בהתחלה לסימולציות של ארדואינו, וממעבדה 3 בערך להתקדם בפרויקט בכל שבוע. עיקר העבודה היא לבד עם עזרה פה ושם מהמתרגלים. בהתחלה לרוב מסיימים הכל בזמן המעבדה, בהמשך זה נגרר גם לעבודה בבית.\n\nשעורי הבית: עבודה על הפרויקט, הגשה של עבודה מהמעבדה כל שבוע\n\nהמבחן: פרויקט - מציגים בסוף הסמסטר את הפרויקט הסופי, ניתוח נתונים ופרזנטציה של עבודת המערכת שבניתם.\nרוב העבודה מתנקזת לסוף הסמסטר אז יכול להיות קצת עמוס עם שאר ההגשות האחרונות, מאוד מאוד מומלץ לסיים כמה שיותר מוקדם.\nצופים בכל קבוצה מציגה את הפרויקט שלה, מצגת של 15 דק.\n\nהשורה התחתונה: חומר מאוד מעניין,קורס קצר וקולע שנותן טעימה ומן \"מבוא\" להמון נושאים מחשמל. מאוד נהניתי בתור סטודנט להנדסת נתונים עם זיקה לחשמל. קליל למי שיש לו נסיון עם ארדואינו/ רספברי פיי.", "timestamp": 1628539288104}, {"author": "בואי שרל'ה הולכים", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: הרצאות מאוד משעממות. המרצה מדבר על כפול 4 והוא מאוד לא ברור. הוא מניח שכולם יודעים חומר של חשמל ושל חומרה ברמה מאוד גבוהה.\n\nשם המתרגל/ת: אדם ואדים גולדברייך\nחוות דעת - תרגולים: מתרגל זהב!\n\nשעורי הבית: המעבדות והבחנים די קלים והוגנים.\n\nהפרויקט: פרויקט עם ראש פתוח. נחמד מאוד.\nהשורה התחתונה: קורס טוב מבחינת התוצר ומבחינת הפרויקט. מבחינת החומר התיאורטי מאוד לא מומלץ", "timestamp": 1630886231115}, {"author": "יובל חי הירש", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: מתרגל מעולה, אדם בכל תרגול עובר בכיתה ועוזר למי שרק צריך, הוא מאוד רוצה שאנשים יבינו ויצליחו לבצע את המשימות של התרגול בפרט ושל הקורס בכלל\n\nשעורי הבית: \nאת שיעורי הבית מתחילים כבר בתרגול וממשיכים אותם אחרי, בהתלה הם סבבה אבל הם הופכים להיות כבדים ממש עם התקדמות הקורס.. אדם אמנם הבין את זה וניסה לצמצם את כמות שיעורי הבית אבל עדיין הם לא היו הכי פשוטים\nהמבחן: \n\nהשורה התחתונה: \nבמידה ואין לכם סמסטר עמוס הקורס מומלץ, הוא מעניין ממש אבל צריך להיות מוכן לעבוד בו", "timestamp": 1657180541460}, {"author": "זאתי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: הרצאות מתחילות אחלה ולאט לאט מגיעים לחומר מורכב של חשמל אם התמרות פוריה וכאלה - החומר אמור לעזור לפרוייקט ויש 3 בחנים ש-2 מהם תקפים\n\n\nשם המתרגל/ת: מיכאל\nחוות דעת - תרגולים:  פשוט איש מדהים, היה שם לכל אורך הפרוייקט תמך , הבין ,הכיל .\n\nשעורי הבית:  מתחילים קל ולאט לאט נעשים קשים , האחרונים לוקחים שעות ארוכות, אבל הם בסיס לפרוייקט. \n\nהמבחן: \nיש 3 בחנים שמהם 2 תקפים משהו כמו 10%\nהשורה התחתונה: הפרוייקט מאוד מאוד עמוס בעיקר לקראת סוף הסמסטר.", "timestamp": 1658121209043}, {"author": "-----", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: \nהרצאות מעניינות אבל לא הכי קריטיות להצלחה בפרויקט, אם יש רקע בחשמל זה עוזר מאוד. שלומי מרצה מאוד מאוד מתחשב ונחמד מאוד.\n\nשם המתרגל/ת: מיכאל קופרמן\nחוות דעת - תרגולים: בחצי הראשון של הסמסטר יש מעבדות בזמן התרגולים שמלמדים דברים על חומר שנלמד בהרצאה ודברים שיעזרו אח\"כ לפרויקט, לרוב מסיימים הכל בזמן המעבדה אבל לפעמים צריך להשלים בבית. נוכחות חובה במעבדות. לקראת סוף המעבדות עושים דברים שישמשו את הפרויקט לכן כדאי להקשיב.\nמיכאל מלך.\n\nשעורי הבית: אין שיעורי בית, רק המעבדות\n\nהמבחן: אין מבחן\nהציון נקבע 20% בחנים בכניסה למעבדות, בחנים לא קשים 5 שאלות אמריקאיות ואורך הבוחן הוא בערך 5-10 דק'. יש שלושה בחנים סה\"כ ולוקחים את הציון של השניים הטובים ביותר.\n80% ציון זה הפרויקט, פרויקט בבניית רכיב IOT ואפליקציה באנדרויד. פרויקט לא פשוט אבל שובר שגרה רציני וסהכ הקורס היה דיי מהנה. נחפשים לחומרים שלא נתקלים בהם בד\"כ.\nההגשה של הפרויקט זה למעבדה האחרונה של הסמסטר אז הקורס נגמר גם יחסית מוקדם לקורסים אחרים שזה נחמד.\n\nהשורה התחתונה: קורס מומלץ, דורש השקעה", "timestamp": 1658329950481}, {"author": "שייגמר כבר", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: לא הייתי באף הרצאה, רק ראיתי לקראת הבחנים. הנושאים מאוד מעניינים, הסמסטר לא איפשר להתעמק בהם יותר מדיי.\n\nשם המתרגל/ת: אדם גולדבראיך\nחוות דעת - תרגולים: אדם בן אדם זהב, עוזר במה שאפשר, עושה הכל כדי שהקורס יהיה מעניין ותוך כדי המעבדות גם עובר אחד אחד לראות שכולם מסתדרים והבינו את מה שמועבר. גם ברמת הפרויקט שמגישים אפשר להתייעץ איתו ויש לו פתרונות מאוד טובים ויצירתיים. ממליץ בחום!\n\nשעורי הבית:  מעבדות שלפחות בהתחלה מסיימים הכל כבר בכיתה ולאט לאט זה נהיה טיפה יותר מורכב, צוות הקורס מאוד משתדל שזה לא יהיה עמוס מדיי, וגם מוריד ברמת החומר אם צריך.\n\nהמבחן: אין, יש פרויקט להגיש.\n\nהשורה התחתונה:  קורס מאוד מומלץ ומעניין, נוגע בהמון נושאים גם בחשמל וגם בדברים שכנראה לא תגעו בהם בתואר לדוג' Arduino, תכנות אפליקציה באנדרואיד, עבודה עם Firebase ועיבוד אותות.", "timestamp": 1658849815710}, {"author": "מתכנתת את האינטרנט", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: הרצאות לא מעניינות. מתחילות בקצת מידע על חשמל ברמה יותר פשוטה מבגרות, ומשם הולך ונהיה יותר משעמם ויותר הזוי כשמגיעים להתמרות פורייה ולדברים כאלו.\nהרגיש כאילו הוא מנסה לדחוס לקורס אחד עם שעתיים הרצאה בשבוע חומר של תואר שלם בהנדסת חשמל (ללא הגזמה).\n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: התרגולים מתחילים נחמד, וגם הם הולכים ומתדרדרים משבוע לשבוע. יש מטלות שמתחילות בסדר, ואחרי כמה שבועות הן כבר יוצאות מכל פרופורציה ודורשות שעות על גבי שעות של עבודה.\n\nשעורי הבית: כל שבוע יש מטלה של המעבדה. מתחילים במטלות קטנות שמסיימים תוך 10 דקות, ומשם זה ממשיך למטלות ענקיות בארדואינו ובאנדרואיד סטודיו, שלוקחות כמה שבועות טובים (ונתנו לנו הארכות על גבי הארכות כי פשוט אף אחד לא הספיק כלום). פשוט לא פרופורציונלי לקורס של 3 נק\"ז.\n\nהמבחן: אין מבחן, ויש פרויקט.\nהדרישות מהפרויקט היו בשמיים. זו הייתה השנה הראשונה עם אנדרואיד סטודיו, והדרישות שלהם פשוט היו מטורפות ולא פרופורציונליות בשום צורה לקורס של 3 נקודות.\nהיה צריך גם לפתח אפליקציה (ככשום דבר לא הכין אותנו לזה, ונדרשנו ללמוד עצמאית ולראות עשרות שעות של סרטונים ביוטיוב), ללמוד איך לעבוד עם ארדואינו ועם מלא מכשירים שונים ולחבר את הכל ביחד עם מד תאוצה ומד צעדים.\nהייתה גם דרישה ליצור את מד הצעדים (סופר צעדים ומסווג הליכה וריצה) וליצור מודל כלשהו על סמך דאטא כיתתי. בפועל, פחות מ-40 אחוז מהקבצים שהועלו היו תקינים ובאמת היה אפשר לאמן עליהם מודל כלשהו (שלא נדבר על מודל של למידה עמוקה, שלא היה אפשרי בכלל) וזה היה פשוט בזיוני.\n\nבסוף אנשים שהשקיעו המון קיבלו ציונים נמוכים, ונראה שהוטל מטבע כדי לקבוע את הציונים.\n\nכל כמה שבועות היו בחנים - בסך הכל שלושה, ובוחרים מהם את השניים הטובים, כל אחד 5 אחוז. הראשון היה פשוט, ואחרי זה הם נהיו קשים לפתרון, ובגלל שזה בוחן של 10 דקות עם 5 שאלות, קל מאוד להוציא 60 ומטה בכל אחד מהם.\n\nהשורה התחתונה: פשוט לברוח. לא שווה את ההשקעה, והציונים לא גבוהים ביחס להשקעה הגדולה שכרוכה בזה.\nראיתי שהסמסטר (אביב הבא) יש 5 קבוצות, ואני מציעה למי שרשום וקורא את זה לברוח וללכת לחפש קורסי בחירה/נתונים אחרים.", "timestamp": 1675621772446}, {"author": "מציל הסטודנטים", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: יש על ההרצאות בחנים במהלך הסמסטר, בפועל הרוב לא הלכו לאף הרצאה השקיעו שעה ללמוד לכל בחן והוציאו מאיות.\n\nשם המתרגל/ת: אדם גולדבראיך\nחוות דעת - תרגולים: אלוף אמיתי, אחלה מתרגל, תומך עוזר ומבין את הסטודנטים.\n\nשעורי הבית: יש 7 הגשות שבועיות של מעבדות ופרויקט סופי דיי עמוס ובלי הרבה זמן לעשות אותו\n\nהמבחן: אין מבחן יש פרוייקט עמוס\n\nהשורה התחתונה: קורס עמוס (העיקר לקראת סוף הסמסטר) אבל מעניין שלומדים בו דברים שונים מאוד ממה שיש בתואר שלנו (פיתוח אפליקציות, תכנות בקרים)", "timestamp": 1688114342625}, {"author": "לפחות זה מאחורינו", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: \nמיותר\nשם המתרגל/ת: גבריאל\nחוות דעת - תרגולים: \nגבריאל - עונה על מיילים אחרי שבוע המתרגל האחר אדם לא ענה בכלל... בהערכה אישית שותפים שלי קיבלו הרבה יותר ממני למרות שאני עשיתי 90% מהעבדות ו80% מהפרויקט אז אין לי מושג על סמך הוא נותן ההערכה החרטה הזו. קיצר לא עזר גם ששלחנו לו מיילים ותמיד התשובה שלו הייתה: לשיקולכם\nשעורי הבית: מעבדות - קושי המעבדות גדל באופן אקספ' \nפרוייקט עמוס מאוד \nהמבחן: אין מבחן יש 4 מבדקים מיותרים במהלך המסמטר\n\nהשורה התחתונה: לא מומלץ קחו קורס עם ממוצע גבוה אחר ! זה קורס עם עומס מטורף ללא הצדקה!", "timestamp": 1689178167013}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: משעממות, לא מועילות ותכלס נכנסנו רק לאיזה 2.\n\nשם המתרגל/ת: גבריאל גוזל\nחוות דעת - תרגולים: בסדר סך הכל. בכל מעבדה יש משימה שצריך לעשות. הוא מסתובב בין הקבוצות ועונה על שאלות. לא עשה יותר מדי.\n\nשעורי הבית: יש משימה בכל מעבדה שצריך לעשות בזמן המעבדה (ההגשה אחרי). את המשימות הראשונות מסיימים בשעתיים של המעבדה אבל הנפח של המשימות האחרונות גדול יותר. המשימות הראשונות חמודות - חיבור חוטים וחיישנים ואחרי זה עוברים לפיתוח אפליקציה ב android studio. אפליקציה די בסיסית אבל היא מהווה את הבסיס לאפליקציה של הפרויקט.\n\nהמבחן: יש 4 בחנים במהלך הסמסטר ופרויקט גדול בסוף הסמסטר. הבחנים על החומר של ההרצאה אבל תכלס לומדים שעה לפני ומוציאים 100. הפרויקט הוא החלק הכבד בקורס.לפרויקט יש 2 חלקים:\nבחלק הראשון תיעדנו הליכה/ריצה באמצעות האפליקציה שבנינו במעבדה 6 ואז על סמך הנתונים של כולם בנינו מודלים שיחזו את סוג הפעילות ואת כמות הצעדים. בחלק השני בונים מוצר שכולל סיפור ואפליקציה (אצלנו הנושא היה פעילות גופנית). הפרויקט עמוס ולוקח זמן. צריך לכתוב דו\"ח, לבנות מצגת ופרזנטציה, וכמובן להשקיע מאוד באפליקציה.\nבסוף בסביבה הקרובה שלי כולנו קיבלנו באיזור 94 ככה שזה משתלם.\n\nהשורה התחתונה: קורס נחמד ששובר שגרה בתואר הסטטיסטי/תכנותי שלנו. \nמפתחים אפליקציה, מעצבים ומבחינת חומר אמיתי אין פה הרבה ללמוד.\nבמהלך הסמסטר לא כבד בכלל אבל הוא נהיה עמוס בחודש האחרון של הסמסטר אז קחו את זה בחשבון.", "timestamp": 1689259170763}, {"author": "Iot", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: מאוד מיותרת, לעבור על המצגות לפני המבדקים וזה ממש מספיק.\n\nשם המתרגל/ת: גבריאל גוזל\nחוות דעת - תרגולים: \nהיה אחראי מעבדה, מאוד מקצועי ידע להעביר את החומר בצורה ברורה והיה זמין לעזור עם תקלות.\n\nשעורי הבית: 7 מעבדות, 5 מתוכן ממש קלילות, 2 האחרונות קצת יותר כבדות אבל גם בגדר הסביר. עדיף לבוא עם רקע חזק בJAVA . הפרויקט גמר מאוד תובעני וזה בפער הדבר שהשקעתי עליו הכי הרבה זמן כל הסמסטר.\n\nהמבחן: אין מבחנים, רק מבדקים אמריקאים, קליל מאוד.\n\nהשורה התחתונה: קורס שדורש הרבה השקעה אבל רק לקראת סוף סמסטר, רוב הציון הוא על הפרויקט הסופי שחלק גדול מהציון שלו ניתן על יצירתיות וההגשה של המצגת בסוף הסמסטר. סה\"כ קורס נתונים מומלץ", "timestamp": 1689611609628}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: הרצאות משמעמות ובסוף לא צריך אותם \n\nשם המתרגל/ת: גבריאל\nחוות דעת - תרגולים: גבריאל מדהים, ממש עוזר ואכפת לו מאד. \n\nשעורי הבית: עד שבוע 7 (כולל) יש מעבדה שעושים בזמן התרגול, אבל אף פעם אין מספיק זמן לסיים בזמן התרגול ולכן זה הופך להיות מטלה ביץ זה הופך את הקורס למאד עמוס.\n\nהמבחן: 5 בחנים שמהווים חלק קטל של הציון (15% אם אני זוכר נכון). בחנים קצרים וקלילים.\n\nפרויקט: 70% מהציון, מבין הפרויקטים הכי מעניינים שעשיתי בתואר אבל דורש המון השקעה.\n\nהשורה התחתונה: הקורס עמוס מאד, אבל שונה מכל דבר אחר שיש לפוקלטה להציע. זה מגניב להתעסק עם חומרה ולהרגיש מהנדס אמיתי. ממליץ אבל קחו בחשבון את העומס.", "timestamp": 1691394537630}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: מיותרות לחלוטין ורלוונטיות רק לבחנים. אין מה לבוא, לגמרי מספיק לעבור על המצגת.\n\nשם המתרגל/ת: גבריאל\nחוות דעת - תרגולים: מאוד חשובים (מעבר לכך שיש נוכחות חובה), לומדים שם את החומר שבאמת חשוב. מתרגל אגדי ומאוד מתחשב.\n\nשעורי הבית: שיעורי בית די קלילים, עיקר העבודה היא לבצע את האינטגרציה בין החלקים השונים (לדוגמא לגרום לאנדרואיד סטודיו לתקשר עם ה-esp).\nבגדול לרוב מספקים קטעי קוד מוכנים שרק צריך לשנות אותם קצת או לשלב ביניהם, מספיק חיפוש זריז בגוגל.\n\nהמבחן: אין מבחן, יש בחנים במהלך הסמסטר ופרויקט. הבחנים קלילים ורק צריך לעבור על המצגות הרלוונטיות יום לפני ולזכור פרטים יבשים. הפרויקט כבד ומצריך השקעה של זמן בשביל להביא תוצאה טובה, רוב הזמן הולך על עבודה שחורה של לגרום לדברים להצליח לעבוד.\n\nהשורה התחתונה: קורס לא הכי קליל בתואר (זה פינטק), אבל הוא ממש סבבה עם ציונים גבוהים והוא נחשב עתיר נתונים. הוא גם היחיד בתואר שאשכרה עוסק בפרויקט פיזי, ממליץ לקחת.", "timestamp": 1711005261153}, {"author": "low pass filter", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: לא הלכתי, באמת שאין צורך בהמשך למה שרשמו פה לפניי.\n\nשם המתרגל/ת: גבריאל גוזל\nחוות דעת - תרגולים: אי אפשר לבקש מתרגל יותר טוב, תמיד עזר בכל בעיה שהיא עם חיוך. גם נתן פקטור לבחנים הקשים :)\n\nשעורי הבית: המעבדות והפרויקט היו אותו פורמט בדיוק מהסמסטר הקודם. הראשונות קלילות, האחרונות מאוד כבדות (לא מבחינת הקושי, בעיקר עבודה שחורה). האמת היא שאין צורך להשקיע יותר מדי במעבדות שהן רק 10% מהציון, עדיף לעשות את המינימום הנדרש ולשמור כוחות לפרויקט שהוא 65%.\n\nפרויקט: אותה מטלה מסמסטר קודם - חלק 1 זה עבודה עם דאטה קבוצתי של נתוני הליכה וריצה, צריך לחזות עבור קלט מסוים אם הוא ריצה או הליכה ולתת פרדיקציה למספר הצעדים. זה החלק הקל (מסתמך על ידע מחישובית 1).\nחלק 2 הוא עיקר העבודה- האפליקציה שבונים עם חיישן תאוצה. מדובר בתכנות מסוג שונה מכל מה שהכרנו בתואר, מומלץ לעבוד צמוד עם chatGPT. מעבר לזה יש אינסוף בעיות טכניות (גרסאות לא מתאימות, חומרה לא תקינה, וכו' וכו'). הבדיקה היא בעיקר על סמך הצגה של כ-15 דקות שכל קבוצה מציגה בשבוע האחרון של הסמסטר.\n\nמבדקים: היו לנו 5 מבדקים שמתוכם לקחו את ה-4 הכי טובים, כולם יחד מהווים 15% מהציון. הרבה שאלות בודקות זיכרון של פרטים קטנים מההרצאה (נגיד \"מה התדר שbluetooth משדר בו?\") וזה לא 100 קליל. מי שלא הולך להרצאות צריך להקדיש כמה שעות ללמידה.\n\nהשורה התחתונה: מבחינת עניין ופרקטיקה זה באמת קורס בחירה מצוין ומאוד רלוונטי למערכות מידע. הבעיה שכל העומס מתנקז לשבועות האחרונים של הסמסטר. אבל סך הכל לדעתי זה שווה את ההשקעה.", "timestamp": 1713090888895}, {"author": "נועה ישראלי #חיים_מתוך_מחלוקת", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: קצת משעממות, אבל שלומי מתלהב ממה שהוא מעביר ומשלב סרטונים והדגמות בכיתה. יש הרצאה אחת שהוא מביא מלא מלא חיישנים ומעביר בין הסטודנטים ומסביר על כל אחד. מבחינת ציון - רלוונטי בעיקר לבחנים ויכול להיות שאיכשהו בפוקס יעזור לכם בפרויקט / ייתן לכם השראה. מבחינת עניין - זה בגדר ידע כללי שהוא nice to have.\n\nשם המתרגל/ת: עידו יוטקו\nחוות דעת - תרגולים: רוב התרגולים הם בפורמט מעבדה - מתחילים במצגת קצרה ואז עבודה עצמית בה המתרגל עובר בין הקבוצות ועוזר. עידו רציני ומכיר את החומר, ניכר שהוא מתכונן היטב לפני כל שיעור ועובר (לפעמים גם מכין מחדש ומשדרג) על המצגות. בחור כריזמטי וגם שומר על אווירה טובה בשיערו יחד עם המקצועיות. תמיד שמח ומנסה לעזור, זמין מאוד וזריז אפילו במקרים שיש בעיה ברכיבים. הדבר היחיד שקצת חבל הוא שנתקלים בד\"כ בבעיות טכניות ספציפיות - ששם למתרגל אין אפשרות לעזור בלי לעבור על הקוד לעומק או להכיר בדיוק באיזה מערכת השתמשנו, אבל זה לא באמת אשמת עידו אלא פשוט טבע הדברים.\n\nשעורי הבית: \nיש כמה מעבדות קצרצרות שנועדו להכיר את הרכיבים והמערכות - הרגיש שממש עזר להרגיש בנוח עם הרכיבים והתוכנות החדשות. עבור שיעורי הבית האמיתיים הקורס בנוי בתור פרויקט מתגלגל - כל מטלה נבנית על הקודמות ובסופו של דבר אפשר להשתמש בקוד שכתבתם עבור מטלה קודמת בתור בסיס למטלה הבאה ובסוף לפרויקט. בנוי טוב וחכם - נוח מאוד ללמוד ככה. מה הבאסה - קושי ענק בלדאבג. יש פה מערכות שרוב הסטודנטים לא נגעו בהן בחיים וצריך לקרוא יחסית הרבה באינטרנט כדי באמת להבין מה קורה. היתרון - בסוף אפשר לצאת כמעט מומחים באנדרואיד. או לפחות עם ראש שבור וכואב כמו של מומחים באנדרואיד.\nכדי להימנע מבעיות וודו טכניות מומלץ להיעזר בשלד קוד של מישהו שזה כן עובד לו - אבל את הקוד עצמו לכתוב לבד. לפעמים פוגשים דברים הזויים שאין סיבה שלא/כן יעבדו, והגיון זה רק חלום רחוק עבור מי שמפתח אפליקציות.\n\nהשורה התחתונה: \nקורס סופר מיוחד, עם נושאים והתעסקות בחומרה אמיתית שלא תפגשו בשום מקום אחר בתואר. אני ממש נהניתי מהעבודה עם הרכיבים ומההרגשה של אשכרה ליצור מוצר מגניב מ-0 שעובד ועושה רעיון שחשבנו עליו לבד בעצמנו. כדי להגיע לתוצר מגניב כן נדרשת השקעה וזמן כדי לפתור באגים של מאגיה שחורה, ומפני שזה כזה כיף (ותרצו להשקיע) ההמלצה היא לקחת את זה בשנה האחרונה מתי שפחות עמוס ואפשר להשקיע במהלך הסמסטר ולקבל את כל מה שיש לקורס לתת. בנוי טוב וממש מעניין אם יש לכם אפילו קצת סקרנות לגבי אלקטרוניקה.", "timestamp": 1714041068892}]}