{"posts": [{"author": "-----", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שלומי לויפר \nחוות דעת - הרצאות: \nקורס סטייל סמינר, כל שבוע 2 זוגות מציגים 4 מאמרים.\nבגדול הקדמים לקורס הזה לא קשורים לראייה ממוחשבת בצורה מסויימת, לכן חלק לא קטן של המאמרים היו קצת מעל רמת היכולת של הכיתה ורוב המוחלט של ההרצאות לא היו ברורות בכלל. לא מפיקים הרבה מההרצאות.\nבסוף כל הרצאה יש בוחן קצר עם 3-4 שאלות על אחד מהמאמרים שהוצגו, ציונים בין 80-100 בכולם.\n\nבנוסף, רוב התוכן של הקורס הוא שיטות ניורוניות לראייה ממוחשבת (בגדול איזה רשתות ניורונים היום עובדות טוב על משימות של vision) שזה מצד אחד אחלה, מצד שני התחום עצמו הרבה יותר גדול מרק רשתות ניורונים אז מרגיש שאם רוצים ללמוד על ראייה ממוחשבת בצורה יותר מקיפה כדאי לקחת קורסים בחשמל.\n\nשם המתרגל/ת: אדם גולדבראיך\nחוות דעת - תרגולים: \nאם יש דבר כזה מתרגל מושלם אז אדם מתקרב להגדרה הזאת מאוד.\nהמתרגל הכי מתחשב שיש בפקולטה בפער. בונה תרגילים איכותיים ומלמדים מאוד(!).\nבקורס יש 2 תרגילי בית ופרויקט מסכם (אך עקב עומס, אדם הסכים לבטל את אחד מתרגילי הבית).\nתרגילי בית פרקטיים מאוד עם אספקט מחקרי. התרגילים  ברמה גבוהה ומלמדים מאוד. קצת עמוסים אבל שווה את זה בשביל לצאת עם ידע פרקטי מהקורס.\n\n\nהמבחן:  אין מבחן, רק פרויקט סיום\n\nהשורה התחתונה: \nקורס עמוס כשמשחררים תרגילי בית, כשאין הוא מאוד רגוע.\nסה\"כ קורס יחסית עמוס אבל בכל זאת ממליץ מאוד לאנשים שרוצים דריסת רגל בראייה ממוחשבת.", "timestamp": 1675772482245}, {"author": "רואה, מחשב ומנתח בחדר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: אין באמת הרצאות, זה סמינר. בכל שבוע הציגו 4 סטודנטים כמה מאמרים בתחום. ההצגות הן בזוגות. היו הרבה מאמרים שקשורים לראייה ממוחשבת וללמידה עמוקה, אבל היה גם דגש ענק על החלק הרפואי של חדרי ניתוח. אישית פחות נמשכתי לחלק הרפואי ועשיתי את הקורס כדי להתנסות בראייה ממוחשבת - זה הקורס היחיד בפקולטה שנוגע בזה.\n\nשם המתרגל/ת: אדם\nחוות דעת - תרגולים: אין תרגולים. ברבע שעה הראשונה של כל תרגול היה בוחן על אחד המאמרים שהוצגו, כדי לראות שהקשבנו ולא סתם היינו בכיתה ובהינו בקיר. היו בחנים בסדר, אבל פעם בכמה בחנים היו שאלות שהיה מאוד קשה לענות עליהן אם לא הבנת טוב מאוד את מה שהציגו בכיתה. אחרי הבוחן הלכנו, אבל לפעמים היו שעות קבלה לתרגיל/לפרויקט. \n\nשעורי הבית: תרגיל בית אחד, מאוד גדול, בעיקר למי שזו התנסות ראשונה שלו בראייה ממוחשבת (שזה לדעתי 99 אחוז מהסטודנטים, כולל כאלה מתואר שני). היינו צריכים להשתמש ב-YOLO כדי לבצע זיהוי לכלי+יד שבשימוש בניתוח.\nהיה אמור להיות תרגיל נוסף, אבל בגלל העומס הענקי של התרגיל הראשון, התרגיל השני בוטל והאחוזים שלו הועברו לתרגיל הראשון.\n\nהמבחן: אין מבחן, יש פרויקט. הפרויקט היה חופשי יחסית, והיינו צריכים לבצע Gesture recognition לסרטונים. יכלנו להשתמש בכל מודל שנרצה, וזה כבר היה יותר נחמד מאשר תרגיל הבית. עם זאת, ההנחיות לפרויקט היו לא ברורות, כי לא יצא שום מסמך רשמי חוץ מאשר מצגת עם כמה שקפים שמציגה את הדאטא ומספר מצומצם של דרישות שהדו\"ח צריך לכלול. בגלל זה, היה קל ללכת לאיבוד בלי הסבר של מה אדם רצה שנעשה בפרויקטים.\nלמזלנו, בנוסף לדאטא הגולמי קיבלנו דאטא שכבר עבר עיבוד והתאים מאוד לעבודה נוחה עם הרבה מהמודלים, ובלעדיו הפרויקט היה הרבה יותר קשה.\n\nהציונים הסופיים היו בסדר, אבל לא קיבלנו ציון ו/או משוב על הפרויקט, ולא היה לנו מושג מה עשינו טוב, מה עשינו לא טוב ועל מה ירדו נקודות.\n\nהשורה התחתונה: קורס שכדאי לקחת רק אם יש לכם משיכה גדולה לעולם הרפואה. בנוסף, הקורס הוא מאוד מתקדם, והוא לא ממש מומלץ למי שאין לא ידע בלמידה עמוקה, ואולי גם לא ממש למי שלא לקח קורס כלשהו בראייה ממוחשבת (למרות שאין אחד כזה בפקולטה). הוא מלמד מודלים מאוד מתקדמים רק דרך המאמרים שלהם, ולא באמת לומדים ראייה ממוחשבת מהבסיס.\nתואר ראשון צריכים להגיש בקשה מיוחדת כדי ללמוד את הקורס, ולא בטוח שזה שווה את המאמץ.", "timestamp": 1682943617654}]}