{"posts": [{"author": "Hanoch Egyes", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nאלעד\nחוות דעת - הרצאות: \nכל ההרצאות היו בזום אז היה קשה מאוד להתרכז. אלעד מנוסה והוא מתאמץ שיבינו\nשם המתרגל/ת: \nגרשון\nחוות דעת - תרגולים: \nתרגולים מאוד עוזרים להבין את החומר\nשעורי הבית: \nדומה לחדוא 1מ2 ברעיון.\nהמבחן: מאתגר אבל הוגן\n\nהשורה התחתונה: \nפחות נורא מחדוא 1מ2", "timestamp": 1692084212449}, {"author": "סטודנט א'", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד\"ר אולג קליס\nחוות דעת - הרצאות: מאוד השקיע בנו ונתן זמן לשאלות, ואיכשהו גם הצליח לרוץ בחומר. מאוד ממליץ ללכת אליו.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: בן אדם מדהים קודם כל. אומר לך שלום גם מחוץ לכיתה ומרגיש שבאמת אכפת לו ממך. מעביר את התרגולים באופן די כייפי איכשהו חחח\n\nשעורי הבית: די סבבה סך הכל, חוץ מזה שקרה לרוב שהש\"ב פורסמו לפני שכל קבוצות התרגול הספיקו ללמוד את הנושאים הרלוונטיים.\n\nהמבחן: סך הכל, די הוגן, אולם יש המון חומר ומעט זמן ללמוד למועד א'. ממליץ על הפק\"ל של חן הררי.\n\nהשורה התחתונה: קורס חשוב שמקנה יסודות בחדוא שכבר רואים בהתסברות וסטטיסטיקה את החשיבות שלו.", "timestamp": 1692480889285}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: הקלטות של צנזור חדוא 2 ת\nחוות דעת - הרצאות: \nצנזור מדהים, החומר כמעט תואם לגמרי לסילבוס של 2מ, אבל האיכות של הסרטונים ביוטיוב על הפנים. \n\nשם המתרגל/ת: אילה נטלי\nחוות דעת - תרגולים: \nמאוד נחמדה לסטודנטים, התחיל רגוע ואז היא הגבירה את הקצב קצת יותר מידי לטעמי. מתרגלת טובה ומסבירה את החומר טוב אבל בדיעבד הייתי הולכת להילה מעין. \n\nשעורי הבית: \n5 גיליונות לאורך הסמסטר. יש רפרנסים אבל הם לא ארוכים כמו בחדוא 1 אז אפשר לפתור לבד. לא קלים אבל לא קשים מידי. \n\nהמבחן: \nלא פשוט אבל די אותו קונספט כל פעם. השאלות הפתוחות ממש דומות ממבחן למבחן, באמריקאיות יש יותר הפתעות. לתרגל כמה שיותר מבחנים קודמים ולהיות חדים על הדיוקים וההבדלים בין המשפטים השונים, בוחנים על זה. \n\nהשורה התחתונה: \nיותר קליל מחדוא 1, עולם קצת אחר עם כל הוקטורים והצורות המוזרות, מתישהו נופל האסימון. החומר תכלס מסתכם בסוף לכמה משפטים וטכניקות שצריך לשלוט בהם", "timestamp": 1695066465120}, {"author": "בעיות אב בכמות גדולה", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אולג \"אתם איתי?\"\nחוות דעת - הרצאות: אחלה מרצה.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל טוב.\n\nשעורי הבית: חלק בסדר חלק פחות. לקראת סוף הסמטר יש עומס בנושא הזה.\n\nהמבחן: קשה. רובו אמריקאי.\n\nהשורה התחתונה: אין מה לעשות צריך לקחת את הקורס.", "timestamp": 1698324045347}, {"author": "יעקוביאן", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה:  אולג קליס\nחוות דעת - הרצאות:  אולג מרצה מעולה. רואים שהוא שולט בחומר. \n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים:  מתרגל טוב , אבל מאוד איטי. אם חשוב לכם כמות התרגילים הוא לא בשבילכם. \n\nשעורי הבית: \nWW יחסית בסדר, רק השאלות בסוף קצת ארוכות ולא תמיד מהוות אינדיקציה להבנת החומר.\nגיליונות פתוחים ברמה רגילה וכמעט ולא נתקלים בקושי\n\nהמבחן: \nניגשתי לשני המועדים. א' היה דחוק בזמן, אז היה קשה יותר להוציא בו ציון גבוה, אבל הרמה שלו הייתה בינונית.\nב' היה קצת יותר קשה, אבל היה הרבה יותר זמן ללמוד אז היה אפשר לשפר יפה וגם ניתן פקטור 5 נק.\n\nהשורה התחתונה: \nקורס מאוד \"קליל\" ביחס לחדווא 1מ ועם חומס שלדעתי מאוד מעניין. הוא כן עמוס מאוד בחומר, אבל החומר לא כל כך קשה.", "timestamp": 1703746312063}, {"author": "--", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דורון אלעד.\nחוות דעת - הרצאות: מרצה מעולה, עם רצון גבוה שהסטודנטים יבינו בהרצאות, אך הם היו בזום זאת הבעיה היחידה.\n\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: פשוט המתרגל הכי טוב בקורסי המתמטיקה שלקחתי, ממש מסדר את החומר בראש אחרי כל התיאוריה בהרצאות.  \n\nשעורי הבית: ww רוב השאלות הולכים לרפרנס ישר, לא ממש מועילות אלא מבלבלות את המוח.\nשיעורי בית פתוחים לא קשים, מאוד חשובות להבנת החומר.\n\nהמבחן: מועד א היה הוגן ולא קשה, אך הבעיה שהוא לחוץ בזמן בלוח מבחנים(היה 5 ימים).\nמועד ב היה מאתגר אך פתיר היה גם 5 נקודות פקטור, לדעתי היה בסדר רק שתי שאלות אמריקאיות מאתגרות מאוד עם טריקים.\n\nהשורה התחתונה: לדעתי הקורס המתמטי הכי יפה שלקתי בטכניון, יותר קשה מחדוא 1מ2 אך יותר יפה זה מה שמקל אותו, סך הכול קורס צריך הבנה ועומק בעיקר באינטגרליים והמשפטים בסוף, לפתור כמה שיותר מבחנים אפילו גם מחדוא 2 לא רק 2מ,ואין על מה לפחד, צריך המון השקעה בעיקר בסוף הקורס, בהצלחה", "timestamp": 1703797401144}, {"author": "דוד", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nלעומת חדווא 1 הקורס יותר טכני, ויותר קל להצליח בו.\nכן יש מושגים חדשים שצריך להפנים.", "timestamp": 1703891104991}, {"author": "חנן דראושה", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאני אישית לא עזרו לי ההרצאות, לפי  דעתי התרגולים מספיקים\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nהילה מעיין היא פשוט מדהימה!!! הלכתי לתרגולים שלה בקורס חדווא 2מ1 וגם 2מ2 , היא מהמתרגלים שלא אשכוח בחייים\nשעורי הבית: \nסבבה ויש גם רפרנס (אבל תנסו לבד אין רפרנס במבחן (:  )\nהמבחן: \nמועד א היה בסדר יחסית רק החלק הראשון היה מאתגר קצת\nהשורה התחתונה:\nאני גם למדתי למבחן מחשבוניה של גרשון אני מאוד מאוד ממליצה, בתכלס קןרס חמוד ואפשר להוציא ציון מעל 85+ אם תשקיעו בצוקה הנכונה", "timestamp": 1704363269526}]}