{"posts": [{"author": "אנונימית", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: \nמרצה מעולה, איטי קצת, סיכומים נהדרים\nשם המתרגל/ת: עמית ווינטראוב \nחוות דעת - תרגולים: מקליד את הכל, סיכומים נהדרים, מדבר מאד מהר ושיטות פיתרון לא אינטואיטיביות\n\nשעורי הבית: פעם בשבועיים 2 גליונות, רמה בסדר\n\nהמבחן: יחסית לשאר יותר סביר, את מאד מקפידים על דיוק ככה ששוחטים בנקודות על כל שטות\n\nהשורה התחתונה:", "timestamp": 1601061828364}, {"author": "ךםך", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה\n\nהמבחן: סבבה\n\nהשורה התחתונה: קורס מעניין ונחמד. קצת יותר עמוס מאינפי 1. הסיכומים של רוזנטל טובים מאוד.", "timestamp": 1604071250829}, {"author": "vais nathan", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אמיר יהודיוף\nחוות דעת - הרצאות: \nמצוין\nשם המתרגל/ת: \nרן קירי\nחוות דעת - תרגולים: \nמושלם. מסביר טוב את הכל ממליץ בחום גבוה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615759772335}, {"author": "OG", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nהרצאות מאוד נחמדות, מסביר ברור ובצורה שלא מרדימה אותך.\nלדעתי לפעמים לא היה מספיק פורמלי.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמתרגל מצויין, מסביר ברור את מה שהולך והעלה קובץ עם כל התרגילים שהיו בתרגול ותרגילים נוספים שהחליט לדלג אליהם.\n\nשעורי הבית: \nהיו 8 גליונות 7 להגשה ומתוכם תקף לפי 8 הכי טובים.\n בכמעט כל גליון היו כמה שאלות ממש טריוואליות, ועוד שאלה אחת באמת יותר קשה שדורשת חשיבה. ממליץ לנסות את הגליונות לבד לפני שקופצים לרפרנס כי זה יכול לעזור מאוד לבנות הבנה יותר עמוקה של החומר לפעמים.\n\n\nהמבחן:\nהיה בינוני מבחינת רמה, הרגיש מאוד ארוך והיו שאלות שמבחינת  פתרון היו קלות אבל לנסח פתרון פורמלית היה מציק. \n\n\nבנוסף אני ממליץ לנסות לבוא עם בסיס חזק באינפי אחד כי אחרת הקורס עלול להיות מאוד בלתי נסבל.\nשורה תחתונה-\nהקורס יכול להיות מצויין עם עוקבים טוב אחרי החומר לכן חשוב לעקוב אחריו.", "timestamp": 1625826673571}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: רוס מרצה מדהים מדהים מדהים!!! הכי טוב שהיה לי בתואר. מסביר בצורה מעניינת, לא רץ ונותן אינטואיציה טובה. בנוסף, רוס מעולה ברמה האישית, מצחיק ועונה על כל השאלות בסבלנות ובאדיבות.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מתרגל מעולה, מאוד נחמד ונותן כלים פרקטיים לגשת לתרגילים.\n\nשעורי הבית: גיליון פעם בשבועיים. הגיליונות מרגישים מאוד פתירים, וההוכחות בהם מסתדרות ממש יפה כשמבינים את הרעיון. מאוד עוזרים לסגור פינות בראש מבחינת החומר.\n\nהמבחן: היה הוגן מאוד ביחס למבחני עבר, התמקד יותר בחישובים מבהוכחות.\n\nהשורה התחתונה: רוס ורן הם איש הים ונער הפלא של החשבון האינפיניטיסמלי. הם הפכו את אינפי בשבילי מהקורס הכי שנוא לקורס שאני מחכה להרצאות ולתרגולים שלו כל שבוע. ממליץ מאוד לקחת אינפי 2 איתם, ובכלל כל קורס שהם מעבירים.", "timestamp": 1625838465730}, {"author": "נמרוד סלור פוטרמן", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות:  רוס ממש חמוד ומרצה מוצלח מאד. ממש כיף ללמוד אצלו ויש אווירה טובה בכיתה ובשעות קבלה וכדומה. הוא יכול להיות קצת מפוזר והוא קצת איטי אז הוא לא בשביל כולם, אבל אני מאד נהנתי ממנו.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל פצצה, הכי טוב שהיה לי בכל קורס עד כה. מסביר ממש ממש טוב, יש לי רשימות מסודרות ממש וטובות מאד. מומלץ מאד.\n\nשעורי הבית: סבירים לחלוטין. היה כל שבועיים, הרבה שאלות, אבל לרוב לא נוראיות בכלל, ורוס אהב לתת רמזים לתרגילים היותר מסובכים, כך שלא לקח המון זמן לסיים את השיעורים. הם כן כתובים באנגלית, אבל מתרגלים מהר\n\nהמבחן: היה הוגן ממש. צריך לעבוד הרבה ללמוד לקראת, אבל אפשרי לחלוטין\n\nהשורה התחתונה: קצת עמוס כי זה בכל זאת קורס גדול, אבל עומס השיעורים קטן מברוב שאר הקורסים הגדולים, והרמה עצמה לא קשוחה מידי.", "timestamp": 1625934438388}, {"author": "האצ'ר", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: לא יודע לא הייתי\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רק התרגול של הטופולוגיה שווה \n\nשעורי הבית: לא תורת הפונקציות\n\nהמבחן: אם היה לי כזה במקור לא הייתי צריך לחזור על הקורס\n\nהשורה התחתונה: העומס תלוי מאוד מי המרצה. לא לצייר קוואזי מעגלים במבחן.", "timestamp": 1626024617345}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nרוס מרצה נהדר, הרבה רגש. נותן אחלה אינטואיציה לרוב הדברים ולא מוסיף יותר מדי שטויות. הוא גם ממש נחמד\nשם המתרגל/ת: אלעד גל\nחוות דעת - תרגולים: \nבחור מאוד מוכשר, התרגולים שלו התמקדו יותר בלהבין את החומר ולקבל אינטואיציה כדי לפתור את התרגילים יותר מאשר לקבל אלגוריתם לפעול על פיו. הוא עונה על שאלות ונותן לדיונים לזרום כי ממש חשוב לו שההבנה של ההגדרות ישבו טוב, אישית לי זה היה אפילו יותר טוב מללכת לרן קירי\n\nשעורי הבית: \nלא פשוטים אבל סבבה\nהמבחן: \nהמבחן של רוס שונה ממבחנים אחרים, יש לו מיקוד קצת שונה. אני חושב שהם קצת יותר קשים. \n\nהשורה התחתונה: \nאחלה סגל קורס מעניין", "timestamp": 1626072646072}, {"author": "א.א.", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: מרצה מעניין וברור מאוד. כיף ללמוד איתו ולשבת בהרצאות. נוטה לפעמים קצת להתבלגן, אבל שווה את זה בסופו של דבר. מה שכן - להנמיך ציפיות מהבוחן אמצע...\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מדהים בחסד, ברור ומסודר. סיכום התרגולים מלא ומפורט ברמה של לשלוח לבית דפוס.\n\nשעורי הבית: 6 גליונות, עומס סביר מאוד ביחס לקורסים אחרים.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס חובה (מן הסתם), אבל גם מעניין. כמות חומר סבירה יחסית, וסגל נהדר.", "timestamp": 1626121405404}, {"author": "רציפה וחסומה = אינטגרבילית", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \n54% R\n44% טלי פינסקי\n12% השלמות\n\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: \n47% לא בר תבור\n35% רז פירנקו\n10% גלעד סופר\n5% הילה מעיין\n3% סתיו ברמן\n\nשעורי הבית: \n100% לא תורת הפונקציות\n\nהמבחן: \n34% רון רוזנטל\n30% לא אור שליט\n25% לא יוחאי מעיין\n11% לא אמיר יהודיוף\n\nהשורה התחתונה: 94% אנליזה 6% לוגיקה", "timestamp": 1626195334074}, {"author": "מידה 0", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nההרצאות מאוד זרמו, רוס נהנה ללמד ומרגישים את זה.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמשקיע מאוד ולהוט על החומר, היו תרגולים כיפים ויעילים.\n\nהמבחן: \nהוגן מאוד, לרוס יש סטייל ייחודי שווה לחזור על מבחני העבר שלו במיוחד. לדעת איך לחשב את קוסינוס של ארקטנגנס 2 בלי מחשבון.\n\nהשורה התחתונה: \nאינפי1++", "timestamp": 1626268970573}, {"author": "זיו ד.", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nאחלה מרצה,ממש כיף ללמוד אצלו והחומר מאוד מובן כשלומדים אצלו,הוא מאוד מתחשב בסטודנטים ואם היה צריך במהלך הסמסטר הוא גם הקליט השלמות בשבילנו על חשבון הזמן הפנוי שלו כדי שנהיה בקצב של החומר במקום שהוא פשוט ירוץ על החומר מהר בכיתה.\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: רן קירי,אין מה להרחיב.\nשעורי הבית: היו ממש סבבה,למרות שהיו באנגלית ,אבל בגלל שרוס היה נותן לנו גם את השמות באנגלית זה לא היה קשה מדי להבין מה כל דבר אומר.\nהמבחן:  מועד א' הוגן בהחלט.\nהשורה התחתונה: אחלה קורס,למרות שבחלקים שלו הוא מעט עמוס,ובחלקים אחרים טיפה פחות,בטורים ובאינטגרלים  מוכללים לדוגמא, זה פשוט חוזר על עצמו (כולל הכפולים),היו משפטים ספציפיים שלקח לי זמן לעקל,בסוף הכל יוצר הגיון. אשמח לקחת קורסים מתקדמים יותר עם רוס ורן ביחד  ו/או בנפרד בעתיד.", "timestamp": 1626353588345}, {"author": "לייבניץ", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי המלך\nחוות דעת - הרצאות: מרצה מדהים, אם כי לפעמים כותב קצת מבולגן/מדלג על מעברים ולוקח רגע להבין שיש פער בין הפורמליות בהרצאה לפורמליות שמצופה מהסטודנטים\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: הלוואי וכל המתרגלים בטכניון היו רן קירי. מושלםםם\n\nשעורי הבית: טכניים בטירוף, רוס כתב אותם (באנגלית) והוא אוהב חישובים\n\nהמבחן: טכני בטירוף, שאלות שסבבה יחסית להבין מה לעשות בהן אבל צריך לשים לב שלא טועים בדרך (הארוכה) ועושים שטויות [  :(  ]\n\nהשורה התחתונה: יותר חומר מאינפי 1, יותר מעניין. חשוב לבוא חדים על אינפי 1. ממש אהבתי את הקורס כי באמת מתרכזים בללמוד מתמטיקה ולא בלהילחם באפסילונים (עדיין יש, הם פשוט נחמדים יותר) ובכתיב פורמלי, אבל עדיין עושים את זה בצורה מדוייקת מאוד", "timestamp": 1626439920322}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: מרצה מעולה, מסביר את החומר בצורה טובה עם דוגמאות והאווירה הכללית בכיתה טובה מאוד. מומלץ בחום!\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מעולה שמסביר את החומר בצורה טובה וברורה. הרשימות שלו מאוד מסודרות ומכילות גם את עיקרי החומר שעובר בהרצאות ומומלץ ללמוד מהן למבחן\n\nשעורי הבית: יש כמעט כל שבוע גיליון ברמת קושי משתנה, יכול לקחת עד כמה שעות עבודה והגיליונות עוזרים להבנת החומר\n\nהמבחן: היה מבחן הוגן שמדד הבנה של החומר.\n\nהשורה התחתונה: הסגל של רוס ורן קירי היה מדהים. קורס קשה ועמוס", "timestamp": 1626762421805}, {"author": "Ori Kachanov", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nמרצה מדהים. \nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי בטכניון.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626789918250}, {"author": "היייייי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: הרצאות מעניינות, קצת בלאגן על הלוח ובהוכחות, אבל חוץ מזה מלמד ממש טוב ועושה אווירה טובה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מדהים!!! גם הרשימות גם התרגולים וגם השעות קבלה\n\nשעורי הבית: קשים אבל פתירים \n\nהמבחן: סבבה\n\nהשורה התחתונה:", "timestamp": 1626867107732}, {"author": "Lidor", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רוס פינסקי \nחוות דעת - הרצאות: מרצה מעולה, הרצאות בקצב טיפה איטי והכתב שלו לא הכי מסודר על הלוח בלשון המטה אבל הוא מסביר כל דבר שהוא עושה בצורה מפורטת ומוכיח הכל. בנוסף הוא גם אדם מקסים \n\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: המתרגל הכי טוב שיש בטכניון למתמטיקה (בוודאות, אפשר להוכיח את זה), מגיע מוכן לתרגולים, מפרסם סיכום של כל החומר לפני כל תרגול, מסביר את כל הניואנסים הקטנים ואיך לגשת לתרגילים, ואפילו נותן רוגע ושקט נפשי  \n\nשעורי הבית: תלוי במרצה, אצלנו היה קל יחסית, גיליון כל שבועיים\n\nהמבחן: נפלנו על מבחן קל מאוד יחסית לשנים קודמות. ממליץ לא ללכת למועדי ב של רוס. באופן כללי מבחני עבר הם באותה רמה של אינפי 1 \n\nהשורה התחתונה: מי שיצא לו לעבור את הקורס עם הסגל הזה זכה בלוטו.", "timestamp": 1627394470459}, {"author": "שם או כינוי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איתי שפריר\nחוות דעת - הרצאות: היה מגניב, איתי מרצה טוב וברור. פתוח לשאלות (אולי קצת יותר מדי) ונותן אינטואיציה. נחמד לבוא להרצאות.\n\nשם המתרגל/ת: רן קירי.\nחוות דעת - תרגולים: זה רן קירי, תנחשו... הוא מתרגל מעולה. מסביר ברור, עם אינטואיציה. נותן דגש על איך אשכרה לפתור שאלות, בלי לוותר על פורמליות. כששאלתי אותו על חומר מקורסים אחרים ואיך הוא מתקשר הוא באמת עזר לי, ופתח את הראש שלי ממש עם מתמטיקה מעניינת.\n\nשעורי הבית: די הרבה.\n\nהמבחן: לגמרי בסדר, אבל הרגיש לי ארוך. \n\nהשורה התחתונה: אחלה קורס. לא אבסטרקטי בכלל. היה לי סגל מעולה.", "timestamp": 1644938971459}, {"author": "אורי ב", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איתי שפריר\nחוות דעת - הרצאות: ההרצאות אמנם היו מעט לא מסודרות אבל בהחלט עברנו על החומר בצורה טובה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מעולה,מסביר בבהירות\n\nשעורי הבית: שיעורים מורכבים יחסית לרוב אבל הסגל מאוד קשוב ועוזר\n\nהמבחן: המבחן שלנו היה מאוד הוגן,הן ברמה והן בבדיקה\n\nהשורה התחתונה: קורס חובה אבל בהחלט בהרכב הנ״ל מאוד מומלץ לקחת,איתי מרצה מצוין ולפעמים שעת הקבלה שלו התארכה לשלוש וארבע שעות תוך שהוא עונה בסבלנות ובהירות,כנל לרן\nקורס קשה אך מעניין מאוד,אין מה לעשות אבל חשוב ליפול על המרצה והמתרגל הנכונים", "timestamp": 1645635596253}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איתי שפריר \nחוות דעת - הרצאות: \nמרצה מעולה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nרן ממש נחמד ויודע להסביר את החומר ממש טוב. אבל התרגולים לא התמקדו בעיקר החומר אלא באינטגרלים \"מגניבים\" ובמשפטים מסובכים שלא באמת השתמשנו בהם בסוף. \nשעורי הבית: \nהיו ממש כבדים, לקחו המון זמן ולא היו דומים בשום אופן לבוחן או למבחן הסופי\nהמבחן: \nהוגן וקליל\nהשורה התחתונה:", "timestamp": 1647596443898}, {"author": "\\אינטגרלכפולמוכלל", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איתי שפריר המלך!!!\nחוות דעת - הרצאות: רק איתי! אלוף! יודע את החומר, מסביר ברור, הכל מובן, עוזר בשעות הקבלה. אדם קליל ונחמד מאוד! מומלץ בחום.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן הוא יחיד ומיוחד. מתרגל תותח שיודע את החומר, דואג שכולם יבינו ומנגיש את החומר ככה שכולם יבינו שזה מאוד חשוב.\n\nשעורי הבית: קשים ועמוסים.\n\nהמבחן: כנראה שהוגן? אולי קשה... תלוי , יש מלא חומר שצריך לצמצם ל5 שאלות במבחן של 3 שעות.\n\nהשורה התחתונה: תשקיעו תצליחו. לא תשקיעו לא תצליחו. תלמדו אצל מרצה אחר - הפסד שלכם. ללמוד רק עם איתי!", "timestamp": 1647869909327}, {"author": "…", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nלא!\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא", "timestamp": 1648559219622}, {"author": "THE MOGDOM", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: מרצה מדהים, לדעתי רון לימד את אינפי 2 בצורה מעולה\n\nשם המתרגל/ת: גל אלעד\nחוות דעת - תרגולים: חוץ מהבעיות שהיו במהלך הסימסטר עם הדברים הטכנים בתרגולים כמו הקלטות אלעד היה מתרגל מאוד טוב ועבר על דברים מאוד שימושיים\n\nשעורי הבית: שיעורי בית מאוד טובים, שאלה אחת מאוד סבירה להגשה והשאלות לתרגול עצמי מאוד מאתגרות \n\nהמבחן: אחד המבחנים הקשים בקורס, רון רוזנטל מתמטיקאי אמיתי אז לא לצפות לשאלות טיפיקליות ממבחנים, או להוכחת משפט קל מההרצאות\n\nהשורה התחתונה: חמישי דוקר שישי נודר שבת שומר", "timestamp": 1657565514086}, {"author": "random", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: \nמרצה מדהים, מביא דוגמאות טובות, מתעקב איפה שצריך והכי חשוב - יש לו את הרשימות הכי מעמיקות ומקיפות שאי פעם ראיתי\nשם המתרגל/ת: גל אלעד\nחוות דעת - תרגולים: \nמעבר לבעיות טכניות סבבה לגמרי\nשעורי הבית: \nשאלה אחת חובה מכל גיליון כל בערך שבוע. לדעתי זה לא טוב שיש רק שאלה אחת חובה כי הרוב (מודה באשמה) לא מגישים את השאר וזה הרבה חומר שמתפספס עד סוף הסמסטר\nהמבחן: \nקשה. קשה. קשה.\nגרם לי לשקול לבקש הארכת זמן, אפילו שלדעתי מי שהיה על החומר הספיק לסיים את רובו בהצלחה (חוץ משאלת הוכחה מהגיהנום)\nהשורה התחתונה: \nקורס חשוב, קורס יפה, מומלץ לחזור *במהלך* הסמסטר על כל החומר ועל ההרצאות (אולי אפילו להגזים ולפתור תרגילים ממבחנים) כדי לקבל פחות שוק לפני המבחן.", "timestamp": 1658009163626}, {"author": "Yaniv Slor Futterman", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון\nחוות דעת - הרצאות: מרצה מאוד טוב. יסודי ועם רשימות פשוט מטורפות. רק מה, הוא מלמד מהר ורוב הכיתה ויתרה על הניסיון לכתוב תוך כדי שהוא מדבר והתבססה רק על הסיכום שלו. הוא לעיתים רץ מהר ולא נותן מספיק זמן לפיתוח אינטואיציה (כמו שצנזור למשל עושה)\n\nשם המתרגל/ת: אלעד גל\nחוות דעת - תרגולים:  לא מתרגל משהו. הוא בחור חמוד ומסביר בקצב סבבה ולא מהיר מידי. אבל הוא לא מספיק המון, הכתב שלו מאוד לא קריא, הוא לא כזה מסודר ורואים שהוא מתרגל חדש שעוד לא מספיק מנושא בזה. ליטל יותר מומלצת. היא מאוד יסודית ופותרת לעט ובאופן ברור\n\nשעורי הבית: גליונות חובה אבל רק שאלה אחת חובה להגשה. למרות זאת, מאוד מאוד מאוד מומלץ לפתור הכל ולא לוותר על זה. הקושי הגדול בקורס זה שאין מספיק תרגול של פתירת שאלות ועם פותרים רק את שאלות החובה אז בכלל זה נהיה בעייתי.\n\nהמבחן: \n\nהשורה התחתונה: קורס קשה מאוד אך מעניין ועם מורה טוב יכול להיות יחסית סבבה.", "timestamp": 1658682885431}, {"author": "4114", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: פשוט מרצה מדהים, אין מה להוסיף.\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: אחלה מתרגלת בסך הכל. מסבירה טוב ומגיעה מוכנה לתרגולים.\nעם זאת היא דיי לא נחמדה. לעיתים לא יודעת לענות על שאלות מהכיתה (וזה המקרה הקל...). בקיצור לא לשבת שורה ראשונה.\n\nשעורי הבית: לא קשים, שאלה אחת בגיליון חובה להגשה. שאר הגיליון שהוא רשות הוא גם סביר ברמת הקושי.\n\nהמבחן: לצערנו, 5 רמות מעל השיעורי בית. אבל הייתה בדיקה מקילה בסוף ככה שהצלחתי לעבור\n\nהשורה התחתונה: קורס קשה מאוד אבל מאוד מעניין", "timestamp": 1659171822150}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: \nרון מרצה מעולה, אבל רץ על החומר וכותב מאוד מהר על הלוח \nככה שקשה לעמוד איתו בקצב, יאמר לזכותו שממה שהבנתי ברוב הסמסטרים לא מספיקים ללמד את כל החומר של הקורס והוא הצליח בנוסף לחומר של סמסטר קודם שלא הספיקו ללמד אותנו\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nמסבירה טוב את החומר אבל חסרת יכולות חברתיות, לא פעם שהיא צעקה על סטודנטים כי ישבו בשורה הראשוהנ(עם מסכה) או כי רצו שתסביר שוב את שאלה ולא היה לה זמן\nשעורי הבית: \nקשים ולוקחים זמן, אבל חשובים מאוד להפנמת החומר\nהמבחן:  קשה \n\nהשורה התחתונה: \nקורס קשוח עם המון חומר", "timestamp": 1665404919468}, {"author": "N", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: \nרון מרצה אחד הטובים שהיו לי, מלמד את החומר בצורה נגישה ומשקיע בדוגמאות ומצליח להכניס אינטואיציה, חיסרון אחד הוא שלפעמים הוא רץ וקשה לעקוב אחריו, אבל למי שמצליח זה משתלם מאוד.\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nאחלה מתרגלת, הייתה מעירה לא מעט על שאלות שהיא לא הבינה וזרקה הערות של תבין לבד ותחזור אליי, אבל חוץ מזה מעבירה את החומר מאוד מסודר וברור.\nשעורי הבית: \nלא פשוטים, אבל הייתה שאלה חובה אחת רק בכל גיליון אז העומס הופחת, בכל זאת עדיף לפתור את כולן כדי לתרגל כמו שצריך בכל הסמסטר.\nהמבחן: \nהוכחה של משפט מהסיוט, מבחן לא פשוט בכלל אבל הבדיקה יחסית מקלה וגם החומר הועבר ברמה גבוהה אז די התאזן\nהשורה התחתונה: \nקורס מעניין, רוזנטל מעביר אותו מעולה אבל לבוא מוכנים מראש למבחנים שלו כי הם ברמה מאוד גבוהה.", "timestamp": 1666766960383}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איתי שפריר \nחוות דעת - הרצאות: איתי מרצה טוב. מעביר את החומר בצורה ברורה אבל לעיתים קרובות נסחף לשיחות מעבר לחומר שגורמות לבלבול, שלו ושל הסטודנטים\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מתרגל מעולה! יש לו רשימות שבהן הוא מסביר לפרטי פרטים את התרגולים וגם תרגילים שלא בהכרח היו בכיתה. גם כשהוא מעביר את זה בכיתה הכל מסודר ומאוד ברור\n\nשעורי הבית: \nהיו כמה שאלות טריקיות אבל בסהכ סבירים \nהמבחן: \n\nהשורה התחתונה: ממליץ על איתי ורן יחד אם אפשרי..", "timestamp": 1683548586533}, {"author": "נפגע שפירא 2.0", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: לא ברורות. טעויות רבות במהלך ההרצאות, אשר מרגישות כמו חוסר שליטה בחומר הקורס. הייתה התמקדות יתרה על נושאים לא חשובים(נורמות שנלמדות באלגברה ב בכל מקרה) וחוסר התמקדות בנושאים חשובים(דיפרנציאביליות בשני משתנים שהוכחתה הופיעה בתור שאלה במבחן הסופי).\n\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: נוראיים. מלאים בטעויות והתבלבלות בלתי פוסקת של המתרגל. חוסר אינטואיציה לפתירת שאלות שנעשה באמצעות פתיחת דסמוס להדגמת הפתרון ונסיון אלתור מוחלט על מנת להצדיק מתמטית את הנעשה(יש לציין שתרגול זה היה על טורי פונקציות, אשר הופיעה בתור שאלת שיעורי בית של 33 נקודות במבחן הסופי). יאמר לזכותו כי הוא בא לטובתנו, ואף ארגן תחרות חידות מוצלחת עם פרסים וציון מגן לקורס, אך זה לא מכפר על חוסר ההבנה של הקורס.\n\nשעורי הבית: מלאים בטעויות. לצד כל גיליון התפרסם תיקונים לגיליון, שגם אז לא הכיל את כולם(חלקם הושארו וחלקם נמחקו מהפתרון הרשמי). מבחינת הרמה, חלק מהגיליונות היו סבירים ברמתם, וחלק היו בלתי פתירים בכלל.\n\nהמבחן: ממוחזר כולו משאלות ש\"ב והוכחות כיתה. מי ששינן את הכל בעל פה הצליח, והשאר פחות(ראה היסטוגרמת מבחן מועד א שהיא קיצונית לשני הצדדים). יתכן שגם הבדיקה הייתה קשוחה, אך הסריקות טרם הגיעו.\n\nהשורה התחתונה: לא לקחת את הקורס עם הסגל הנוכחי, אלא אם שינון של אינספור תרגילי בית(שחלק מהגיליונות מכילים 18 עמודים של *הצעה לפתרון רשמי*) והוכחות כיתה בלי הבנה בהכרח זאת שיטת הלמידה המועדפת עליכם.", "timestamp": 1689353124945}, {"author": "מיכאל", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאורי מרצה מעולה, קצת מחפף אבל סך הכל הכל ברור, רק כדי לדעת כיצד הוא בונה את המבחן כי זה די שונה ממרצים אחרים לפחות שאני פגשתי\n\nשם המתרגל/ת: ניקה  \nחוות דעת - תרגולים: \nמעולה , הכל ברור ויש לעניין\nשעורי הבית: \nכדי לעשות, לפחות במקרה עם אורי שפירא\nהמבחן: \nהוגן אם ידעתה איך להתכונן מלפני\nהשורה התחתונה: \nקורס כיפי ממש נחמד.", "timestamp": 1689495650012}, {"author": "מתמטיקאי אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nאורי מרצה מצוין. הוא תמיד ניסה לתת אינטואיציה מאחורי כל דבר שלימד. הוא גם אוהב את השתתפות הקהל בהרצאה ותמיד היו מתפתחים בכיתה דיונים מעניינים על הנושאים שנלמדים שבסופו של דבר עזרו לנו להבין יותר טוב את החומר. למרות שאורי די נצמד לרשימות של רון רוזנטל, ההרצאות לא מרגישות כאילו הוא מעתיק חומר מהרשימות אל הלוח, אלא שהוא מפתח את התורה וההוכחות ממש תוך כדי השיעור.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: \nאלון מתרגל די מפוזר. אבל מרגישים שיש לו תשוקה ללמד ומאוד רוצה שנבין את החומר, והוא תמיד ניסה לתת לנו אינטואיציות גיאומטריות לשאלות על ידי גרפים במחשב של שאלות תוך כדי שאנחנו פותרים אותם, כדי שנצליח לקשר את המושגים המופשטים של אינפי למשהו שרואים בעיניים. אני החלטתי ללכת לתרגולים שלו כי הרגשתי שמאוד אכפת לו מאיתנו והוא רוצה שנצליח. הוא גם ארגן תחרות חידות מטורפת שהייתה ציון מגן אבל גם הייתה כיפית בטירוף.\n\nשעורי הבית: \nקשים מאוד! אבל אפשר לא להגיש את כל התרגילים (מילולית כתוב שצריך לעשות \"מאמץ ניכר\" - אפשר לפרש את זה גם בלעשות חצי מהתרגילים). יש גם שאלות אתגר והעשרה. סה\"כ פעם בשבוע שיעורים קשים בטירוף אבל מי שמצליח אותם יכול להיות בטוח שהוא שולט בחומר.\n\nהמבחן: \nלפני המבחן אורי אמר לנו שלא יהיו שום הפתעות במבחן - הכל יילקח או מהספר (הוכחת משפטים ודוגמאות לדברים), או מההרצאות, או מהבוחן אמצע לתרגול שפורסם במודל, או משיעורי הבית או מהתרגולים. וכך היה - לא הייתה שאלה אחת במבחן שלא ראינו בעבר.\nהיו בו גם 2 שאלות בונוס - אחת לקוחה משיעורי הבית ואחת מחומר העשרה שהיה אפשר לקרוא מהספר. סהכ היו 114 נקודות במבחן.\nהשאלות היו קשות, במיוחד הוכחת משפטים. הוא ביקש להוכיח משפט יחסית מורכב. כך שאני ממליץ לקרוא את כל הספר מא' ועד ת' לקראת המבחן. עם אורי אין טעם לפתור מבחני עבר כי זה סגנון מאוד שונה של שאלות.\n\nהשורה התחתונה: \nנהניתי מאוד, קורס קשה, ש\"בים קשים, מבחן קשה ושונה ממה שאתם רגילים.", "timestamp": 1689520525576}, {"author": "נורמה לא נורמלית", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nרוב הזמן הרגשתי שאורי מעביר את החומר ברמה די גבוהה ונותן אינטואיציה טובה לחומר. הבעיה של אורי היא שהוא לא יודע מתי להתעכב ומתי להזדרז, וככה נוצר מצב שלפעמים מתעכבים הרבה זמן על נושאים יותר שוליים (לפעמים בעידוד שאלות ספק-פילוסופיות ספק-רלוונטיות מהקהל) ואז הוא מנסה לדחוס כמה שיותר דברים בדקות האחרונות של ההרצאה (ואז הוא מעלה ממש את הקצב וטס על דברים שלפעמים הם יותר חשובים ודווקא צריך להתעכב עליהם). או יותר גרוע, הוא לא מספיק לעבור על נושאים / הוכחות ושולח אותנו להשלים לבד את החומר מהרשימות (הוכחה אחת שהוא שלח אותנו ללמוד מהרשימות הופיעה במבחן כסעיף של 17 נקודות).\nחוץ מזה הוא לפעמים מנסה להתעכב על דברים כדי לעשות לעצמו ולנו סדר בראש, אבל בסוף הוא מבלבל את עצמו ואת רוב הכיתה, אז כדאי תמיד לנסות לסנן מתי הוא מתעכב על משהו חשוב ומתי הוא נכנס ללופ מיותר.\nבנוסף ההספק היה לא טוב ולא דיברנו כמעט בכלל על פונקציות במספר משתנים (אבל כן הקדשנו שיעור שלם כדי להגיד שכל הנורמות שקולות ב-R2).\nסה\"כ מרצה בסדר, יש טובים יותר וטובים פחות.\n\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: בחור חביב עם כוונות טובות שבאמת מנסה להשקיע בסטודנטים, אבל ממליץ להימנע מהתרגולים שלו אם יש אפשרות. קודם כל הכתב שלו לא כל כך קריא והוא כותב די מבולגן. הוא כמעט ולא פתר תרגילים כמו שצריך מההתחלה ועד הסוף, ותכלס הלוח נראה יותר כמו דף טיוטה. הוא לא תמיד מספיק פורמלי (לפעמים הוא אפילו מכריז שהוא הולך לנפנף בידיים), ולפחות פעם אחת בכל תרגול יש תרגיל שהוא לא מצליח לפתור או שהוא טועה בדרך ועוצר. ייאמר לזכותו שהוא תמיד מעלה רשימות מוקלדות של התרגול לאחר מכן ושם הוא מתקן את הפתרון (לפעמים התיקון גם לא נכון, אבל לרוב זה בסדר). אני לא אהבתי את התרגילים שהוא בחר, הם היו טכניים מדי וכמעט ולא שמו דגש על התאוריה, וגם הפתרונות שלו היו הרבה פעמים מסורבלים שלא לצורך.\nבקיצור, למרות הכוונות הטובות לדעתי הביצוע לא טוב.\n\nשעורי הבית: היו ממש סיוט. קודם כל רוב הגיליונות היו ארוכים בצורה לא פרופורציונלית לגיליון שבועי (לפעמים היו 7-8 שאלות כבדות שלחלקן מספר סעיפים, כשכל סעיף יכול היה להיות שאלה בפני עצמה). בנוסף היה דגש גדול על דברים טכניים כמו לחשב אינטגרלים ולקבוע התכנסויות ולי אישית ממש היו חסרות שאלות תאורטיות יותר שעוזרות להפנים את החומר, וגם עוזרות להבין איך כותבים הוכחה עם הכלים של הקורס. כן היו פה ושם שאלות כאלה אבל באמת לא מספיק.\nבנוסף, הגיליונות עלו באופן (כמעט) קבוע עם טעויות, ולרוב לא מדובר היה בטעויות קטנות שאפשר ישר להבין מה הטעות, אלא טעויות שלא אפשרו לפתור את התרגיל (פעם אחת אפילו בוטלה שאלה כי הייתה לא פתירה). כמובן שהתיקונים לא עלו מספיק מהר וככה שרפתי הרבה זמן על שאלות שלא יכולתי לפתור גם ככה. בנוסף הפתרונות של אלון (שגם כתב את הגיליונות) לא קריאים, הם אמנם מוקלדים אבל הם ארוכים ומסורבלים וכוללים מעברים שלא ברור מה הייעוד שלהם ולמה הם נכונים. \n\nהמבחן: אורי אמר מראש שהוא הולך לבנות את המבחן על בסיס הרשימות של רון רוזנטל (שאליהן נצמדנו רוב הסמסטר) ועל בסיס הגיליונות. בתכלס המבחן היה פשוט שחזור של דברים שעשינו, כלומר שאלות שהיו בגיליונות / בוחן אמצע והוכחות והגדרות שראינו בכיתה (או ברשימות). לדעתי במובן הזה המבחן היה הוגן כי אורי אמר שזה מה שהולך להיות, אבל אין ספק שהמבחן לא בדק מספיק הבנה ובעיקר בדק מי זוכר יותר.\n\nהשורה התחתונה: קורס עם לא מעט חומר, יש חלקים מעניינים יותר (אינטגרלים, טורי פונקציות, פונקציות בשני משתנים) ומעניינים פחות (טורים, פיהוק). אם אתם לוקחים את הקורס עם אורי (או כל קורס אחר עם אורי) כדאי כבר במהלך הסמסטר לשנן כמה שאפשר את ההוכחות (או למי שלא אוהב לשנן, \"להבין איך לשחזר\") ולהכיר טוב את הגיליונות. קורס מומלץ לחובבי אינפי, ולמי שלא אוהב זה גם ככה חובה אז אין מה לעשות. השילוב של אורי ואלון לא מומלץ.", "timestamp": 1689590663610}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nאינטגרלים הוא העביר בצורה טובה ומעמיקה. כשהגענו לטורים הוא התפזר לגמרי נמרח על שטויות, ובסוף על החלק של טורי חזקות שאמור להיות החיבור של כל הפרק הוא עבר ברבע הרצאה. \nבנוסף הוא החליט שהוא לא משלים חומר מהשביתה ודיבר על נורמות רבע מהזמן שהוא הקדיש לפונקציות ב2 משתנים\nבסך הכל שהוא ממוקד הוא מסביר מעולה, לצערי הוא חלק גדול מהזמן לא...\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: \nעל הפנים, מסביר בנפנופי ידיים ומסביר הכל בצורה לא ברורה שאמורה להיות אינטואיטיבית אבל בעיקר לא מסודרת ולא ברורה  \nשעורי הבית: \nעמוסים ועם שאלות מוזרות \nהמבחן: \nכל השאלות נלקחו משיעורי בית, הוכחות כיתה ובוחן אמצע לדוגמה. הבדיקה הייתה נוקשה מדי\nהשורה התחתונה: \nשאורי רוצה וממוקד הוא מרצה מעולה אבל כנראה שהוא צריך להרצות לקורס שיותר מעניין אותו. בסך הכל החומר בחלקו מעניין מאוד אבל עמוס", "timestamp": 1689595460440}, {"author": "בועז מונטיליה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אוריאל שפירא\nחוות דעת - הרצאות: \nמרצה קצת מפוזר, ואיטי, ומתעכב על שאלות, דבר שלפעמים בא על חשבון השלמות בדיעבד מהרשימות.\nעם זאת, הבנה גבוהה, תמיד כשבאים עם שאלות אקסטרה יש הסברים מעמיקים ומעניינים, ובבירור יש הבנה.\nאני מאוד נהניתי ממנו, אבל לא מתאים לכולם.\nלצערי בגלל השביתה נחתך הרבה חומר שבכל מקרה אמור להיות מוסבר באינפי 3\n\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: \nמאוד אכפתי ונחמד, אבל מפוזר ולא מסביר הכי טוב. מאוד חשוב לו מהתלמידים.\n\nשעורי הבית: \nארוכים מאוד ודורשים הרבה זמן, אבל אם עושים את כולם (במיוחד שאלות אתגר) זה מפתח גם מיומנות וגם הבנה.\n\nהמבחן: \nבדק שינון של החומר שנלמד בכיתה.\n\nהשורה התחתונה: \nקורס מאוד טכני, מתמקדים הרבה בטכניקות וטריקים לאינטגרלים במקום יותר להתמקד בטופולוגיה או טורי חזקות.\nקורס חובה אז אין מה לעשות עם זה", "timestamp": 1690132696879}, {"author": "q", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: איתי שפריר \nחוות דעת - הרצאות: איתי מרצה מצויין ובן אדם מאוד נגיש וחביב, עונה בנעימות לכל פניה, ובמקביל גם חד ויודע לבנות קו אחיד בהרצאה בלי להגרר לפינות שנובעות משאלות של תלמידים.\nממליץ על (להדפיס או לפתוח בטאבלט) את הסיכום של רון רוזנטל לקורס ולשבת מולו בשיעורים, במקום לכתוב. אפשרי גם ללמוד מהסיכום המצויין ולא לבוא בכלל להרצאות.\n\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: פחות התחברתי לסגנון תרגול של אלון, הייתי רוצה יותר הסברים ואינטואיציה במקום \"מופע קסמים\". מעבר לכך, התרגולים היו סה\"כ טובים, אלון העלה את כל התרגולים כתובים ומודפסים כך שהיה ניתן לחזור בבית אחרי ההסברים ולהבין בצורה טובה.\n\nשעורי הבית: ארוכים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1711086194662}, {"author": "רועי מנחם", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: איתי שפריר\nחוות דעת - הרצאות: אחלה גבר מסביר כמו שצריך חמוד מאוד ועונה על כל שאלה בסבלנות\n\nשם המתרגל/ת: אלון שכטר\nחוות דעת - תרגולים: מרצה תותח יש לו תמיד זמן זמין במייל באופן מיידי בשעות קבלה הוא ממש חמוד עוזר תמיד\n\nשעורי הבית: \nהעומס היה סבבה רק בסוף הסימסטר הביא הרבה שיעורים כדי להספיק את הכל\nהמבחן: \nהיה אחלה מבחן טוב והוגן\n\nהשורה התחתונה: \nאיתי ואלון זה שילוב מנצח לדעתי", "timestamp": 1713635484197}, {"author": "שם או כינוי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: איתי שפריר\nחוות דעת - הרצאות: מרצה סבבה, העביר את המוצר באופן מובן וברור. \n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: אפשר לראות שהוא אוהב את החומר ומשקיע, הרבה פעמים הרבה דוגמאות יכולה בdesmos כדי להמחיש. כותב לפעמים קצת מבולגן ולא ברור על הלוח.\n\nשעורי הבית: כל שבוע היה גליון שיעורי בית חובה חוץ משבוע אחד בסוף שהיה גליון לא להגשה. זה היה הרבה עומס, אבל עזר להבין את החומר טוב.\n\nהמבחן: סך הכל הוגן, שאלה 1 במועד א הייתה קשה יותר מהרגיל לדעתי אבל השאר היה מאוד פיר.\n\nהשורה התחתונה: קורס מעניין שאני מרגיש שיצאתי ממנו עם הבנה טובה של החומר.", "timestamp": 1715355560974}]}