{"posts": [{"author": "Lidor Bibi", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לידיה פרס הררי\nחוות דעת - הרצאות: כיף ללמוד איתה\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: הכי טובה שיש\n\nשעורי הבית: המון\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1613375334949}, {"author": "יניב גיטלמן", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשה מאוד\n\nהשורה התחתונה:", "timestamp": 1613403698129}, {"author": "abd assi", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מתרגלת מאוד חזקה אבל מהירה. ממליץ כי היא מספיקה הרבה שאילות\n\nשעורי הבית: ממליץ לפתור. בפרט את הwebwork.\n\nהמבחן: מי שהשקיע כל הסמסטר ופתר כל שיעורי בית. יהיה המבחן מאוד מאוד קל\n\nהשורה התחתונה:", "timestamp": 1613479249510}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: אחלה מרצה, נותנת תחושה נעימה בשיעור ודורגת שכל אחד יבין. מסתדרת היטב עם הזום ודואגת שהשיעור יהיה מסודר וללא התפרצויות. יתרון שמעלה את מה שהיא כתבה בשיעור למודל.\n\nשם המתרגל/ת: רבקה אביטל.\nחוות דעת - תרגולים: מהירה בטירוף, מי שמנסה להספיק לכתוב באמת בהצלחה. יתרון שהיא מעלה הכל למודל לכן ניתן להקשיב בזמן התרגול ופשוט להסתכל אחר כך במקום לכתוב.\n\nשעורי הבית: קשים אבל מומלץ לעשות - אחלה תרגול.\n\nהמבחן: זמנים לא הגיוניים! שעה לכל חלק - לחץ זמן מטורף ואין זמן לבדוק את עצמנו. בדיקה שונה בין הבודקים. מאוד מאכזב סה\"כ.\n\nהשורה התחתונה: אין ברירה, קורס שחייבים לעשות.", "timestamp": 1613481963667}, {"author": "נ.א.", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שוקי ארושס\nחוות דעת - הרצאות: מרצה הכי טוב שהיה לי אי פעם!!!! \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת מדהימה רק תמיד ממהרת, קצת קשה להישאר מרוכז בקצב שהיא מלמדת אבל היא שמה את כל התרגולים שלה בdropbox שבוע לפני התרגול, אז אפשר רק להקשיב לה בלי לכתוב, היא מסבירה ממש טוב.\n\nשעורי הבית: לפעמים לוקחים הרבה זמן אבל מהווים מגן מכובד ולא קשים בכלל. הסגל גם פותר חלק מהתרגילים בשעות קבלה אם תבקשו. יש 5 תרגילי בית פתוחים ו12-14 ובוורקים\n\nהמבחן: היה 2 חלקים עם שאלה שדומה לתרגילי הבית. לא קשה בכלל, היה הוגן. \n\nהשורה התחתונה: קורס לא קשה בכלל, וגם 5 נקודות אז מאוד משפיע (לטובה) על הממוצע הסמסטריאלי.", "timestamp": 1613747904202}, {"author": "'", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: מרצה מעולה! מסבירה הכל בצורה נעימה, ורואים שהיא נהנית מאוד מהנושאים. אמנם לא הקליטה, אבל כן העלתה את כל סיכומי השיעורים שלה למודל, וזה בהחלט מספיק. בקיצור - ללמוד רק איתה. \n\nשם המתרגל/ת: נוי חן\nחוות דעת - תרגולים: אחלה מתרגל, דואג שכולם מבינים את החומר, ועוזר מאוד בשעות קבלה ובמיילים.\n\nשעורי הבית: וובוורקים סבירים ושיעורי בית להגשה טיפה קשים יותר. ממליץ לפתור את שיעורי הבית להגשה ביחד.\n\nהמבחן: לא פשוט - שני חלקים עם שתי שאלות פתוחות בכל אחד. בהשוואה לשנים קודמות - מבחן קשה יותר.\n\nהשורה התחתונה: קורס לא הכי פשוט, אבל לגמרי סביל. תתנחמו שאתם לא לוקחים אינפי :)", "timestamp": 1616229706538}, {"author": "noam nissim", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לודה מרקוס\nחוות דעת - הרצאות: מרצה מעולה ומסבירה טוב, עזבה לתל אביב\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מצויינת, עושה כשפים כל הזמן ומסבירה טוב.\n\nשעורי הבית: דורשים הרבה עבודה, 5 גליונות להגשה וכל השאר וובורק, חלקם קשים\n\nהמבחן: היה מאוד פייר יחסית אבל קשה\n\nהשורה התחתונה: קורס שדורש הרבה עבודה בעיקר מאמצע סמסטר וקדימה.", "timestamp": 1616260054169}, {"author": "ל", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דר יוסי כהן\nחוות דעת - הרצאות: \nמרצה לא מתחשב בכלל,במהלך כל הסמסטר הרגשנו שהוא מתנקם ורוצה להכשיל את הסטודנטים למרות שזה קורס חוזר כמעט לכולם\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nקשה,שונה מאוד במבנה וברמה משנים קודמות\nהשורה התחתונה: יש לי טראומה מהקורס הזה בגלל המרצה הזה", "timestamp": 1636580083247}, {"author": "דניאל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רדואן ניזאר\nחוות דעת - הרצאות: לא ללכת, מרצה שלא רוצה ללמד ולא יודע ללמד. ללכת למרצה אחר או לראות מוקלטות משנים קודמות\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת תותחית, אי אפשר להעתיק מהלוח ולעקוב אחרי החומר, היא לרוב שמה קישור במודל ששם היא מעלה את הדפי תרגול שלה לפני שתוכלו לרשום הערות ומה שצריך, מומלץ! יש לה גם הקלטות\n\nשעורי הבית: חייב לעבור טוב על החומר מהתרגולים ומהרצאות כי בלי זה זה מאוד קשה לפתור את התרגילי הגשה והוובוורק, ובכללי הם לוקחים המון זמן אז כדאי להתחיל אותם הרבה זמן לפני מועד ההגשה\n\nהשורה התחתונה: קורס עמוס וחשוב מאוד להבין את כל החומר כי הכל מתבסס על הכל בסוף, להתחיל הגשות מוקדם.", "timestamp": 1643908525229}, {"author": "גל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה טוב, לפעמים מתפזר. לא תמיד מסביר טוב או עונה על שאלות באמת, אבל הוא היה הכי טוב מבין מי שהיה.\n\nשם המתרגל/ת: איריס \nחוות דעת - תרגולים: מדהימה, מעלה מראש את הדפים שלה ומסבירה מעולה. בלעדיה לא הייתי מבין בחיים.\n\nשעורי הבית: סבירים, לוקחים לא מעט זמן אבל פתירים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644061062557}, {"author": "יוסי המלך", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: מלך! מרצה מצויין, מצחיק וכיפי, בהתחלה נראה קצת שבוז ולא אכפתי אבל מהר מאוד מכירים אותו וקולטים אותו. עונה על כל השאלות בכיתה וגם בקבוצה בווצאפ\n\nשם המתרגל/ת: רבקה ואיריס\nחוות דעת - תרגולים: הרבה ממליצים על איריס אבל לדעתי מפוזרת הרבה יותר מדי ואחר כך בשיעורי בית יש סלט בראש ולא מצליחים כלום (שלא נדבר על המבחן..). לקראת אמצע הסמסטר עברתי לרבקה והיא פשוט תותחית! אמנם גם יחסית רצה אבל הכל מסודר וברור, מוכוון אחד לאחד לשיעורי בית, הכי טובה! חבל שלא עושה חדוא 2 סמסטר הבא...\n\nשעורי הבית: בסדר. 13 וובוורקים סבירים, 5 גיליונות הגשה ארוכים ויחסית דחוסים לקראת סוף הסמסטר. למי שאצל רבקה אין שום בעיה איתם.\n\nהמבחן: מפתיע! יוסי מרצה אחראי יחסית חדש והסגנון שלו מאוד שונה ממה שהיה בשנים האחרונות.. הפציץ עם המון שאלות מהחודש האחרון (אינטגרלים וטורים, אפילו טורי חזקות שהיו ממש בחצי שעה האחרונה של הסמסטר) ועוד כל מיני שאלות של דקויות בלי משפטים בכלל... מאמין שעם הזמן כשיצטברו יותר מבחנים שלו יהיה יותר טוב..\nעם זאת ייאמר לזכותו שהבוחן אמצע היה מאוד הוגן על גבול הקל ככה שיש מגן טוב.\n\nהשורה התחתונה: הקורס הכי מעניין בסמסטר א' אבל די מתעתע, חשוב להיות על החומר כל הסמסטר ולהתחיל מוקדם הגשות. ללמוד טוב למבחן ולא בהכרח להתמקד בדברים הקלאסיים. ההרצאות של יוסי כיף גדול, רבקה תותחית", "timestamp": 1644308623776}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שוקי ארושס\nחוות דעת - הרצאות: \nשוקי בלי להקטין אף אחד כנראה המרצה הכי טוב לחדווא/אינפי  וממליץ בחום לבוא להרצאות שלו. אין הפסקות אבל יש כמות גדולה של דוגמאות וטיפים ששוים המון.\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מעולים מאוד! רבקה מתרגלת בחסד גדול והתרגולים שלה מאוד ממוקדים למבחן.\n\nשעורי הבית: \nמאתגרים. חשוב לא לפספס שום גיליון ולא לזלז בוובוורקים כי רק בזכות תרגול אפשר להצליח.\nהמבחן: \nהמבחן היה ברובו על החומר של השבוע האחרון, היות וחדווא בנוי ככה שמתחילים בקל ומסיימים בקשה אז המבחן היה לא פשוט אבל אפשרי היה להוציא ציון טוב.\n\nהשורה התחתונה: \nקורס פרקטי מאוד שדורש השקעה פרופורציונלית לנק\"ז שלו. חשוב לבחור מרצים ומתרגלים טובים.", "timestamp": 1644938640695}, {"author": "hila", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניזאר ארדואן\nחוות דעת - הרצאות: רע מאוד . ניזאר מתוק אמיתי, יש לו רק כוונות טובות אבל הוא מפוזר מאוד וקשה לשמור על קשב . ממליצה שתמצאו לעצמכם מתרגל פצצה .\n\nשם המתרגל/ת: אולג \nחוות דעת - תרגולים:  מלך מלך מלך אין לי מילים נוספות . עברתי את הקורס הזה בזכותו .\n\nשעורי הבית: הוובוורק היו סבבה . ההגשות היו לא קלות אבל סבבה \n\nהמבחן: קשה מאוד ! ממוצע לפני פקטור 45 . יוסי, המרצה אחראי הגזים לחלוטין, לא דומה לשום מבחן קודם שיש במודל לתרגול\n\nהשורה התחתונה: קורס עמוס ולחלוטין הקשה יותר לעומת אלגברה . ממליצה מאוד על מתרגל טוב", "timestamp": 1645527770182}, {"author": "..", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: נכון אמרו לכם פעם שיש באקדמיה מרצים לא הכי הכי כי הם לא באמת רוצים להרצות והכריחו אותם? אז ניזאר. רואים שהוא יודע את החומר מצוין, אבל הוא לא ממש יודע להסביר אותו ולא מבין את השאלות ששואלים אותו. הייתי בהרצאות אצלו ולא אצל מרצה אחר נטו משיקולי מערכת, אם יש לכם אופציות ללכת למרצים אחרים אז כדאי..\n\nשם המתרגל/ת: אולג קליס\nחוות דעת - תרגולים: מתרגל טוב סך הכל. עובר על כל מיני תרגילים ומסביר בצורה ברורה, אבל מרגיש לי שביחס למתרגלים אחרים (כמו רבקה ואיריס) הוא לא נותן ערך מוסף ייחודי (אין הבנה עמוקה של הרציונל מאחורי פתירת תרגילים או תרגילים מתוחכמים)\n\nשעורי הבית: לא חסר. 5 גליונות בכתב ברמה די גבוה, שמומלץ מאוד לעשות כתרגול למבחן, והמון המון וובוורקים.\n\nהמבחן: יוסי בנה מבחן שכולל בעיקר חומר שנלמד בסוף הסמסטר. בערך חצי מהציון הוא על שאלות אמריקאיות ונכון לא נכון (או שהרווחת את כל הנקודות או שאיבד את כולן). החצי השני שאלות פתוחות שבודקים בצורה קפדנית בהגזמה. הממוצע היה די נמוך אבל פינקו אותנו בפקטור של 15 נקודות.\n\nהשורה התחתונה: קורס לא קל. רוב החומר מובן בסופו של דבר, אבל נדרשת לא מעט השקעה. בסופו של דבר, עם קצת מזל והרבה שכל אפשר להוציא ציונים סבבה לגמרי.", "timestamp": 1646572118615}, {"author": "Hay Zagory", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nלא הלכתי לאף אחד, ראיתי בפונפטו (מרצים נוראיים)\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: \nאלופה\nשעורי הבית: \nחופרים מאוד אבל כדאי לעשות אם רוצים לבוא מוכנים \n\nהמבחן: \nקשה מאוד כמצופה מחדווא, אבל אם משקיעים מאוד בסמסטר אפשר לצאת מזה השלום\n\nהשורה התחתונה: קשה כצפוי, הוראה ברמה נמוכה ביותר.\nמזל שהמתרגלים טובים", "timestamp": 1646687567512}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: מפוזר, לא ברור, לא סגור מה החומר שאותו הוא צריך ללמד. התחלנו ללמוד אצלנו כ 100 איש והיינו 30 שהפסקתי להגיע להרצאות שלו.\nממליץ בחום לא להגיע להרצאות שלו.\n\nשם המתרגל/ת:  איריס שפירא\nחוות דעת - תרגולים:  נחמדה אבל  מאוד מפוזרת, קשה מאוד מאוד להבין אותה.\n\nשעורי הבית: רמה מאוד גבוה לוקחים המון זמן אך חשובים\n\nהמבחן: קשה מאוד, כל התרגילים היו ברמה מאוד גבוהה. לא היה הרבה חומר לתרגל כי יוסי מרצה אחראי חדש.\n\nהשורה התחתונה: קורס קשוח מאוד שדורש המון המון השקעה.", "timestamp": 1646906667066}, {"author": "שיר", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: ראיתי הקלטות בפנופטו, לא היו מרצים נורמליים הסמסטר.\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת ממש טובה אך רצה בחומר ולפעמים מתפזרת. יש אווירה ממש טובה בתרגולים, מאוד קשובה ואכפתית לסטודנטים ודואגת להעלות את דפי התרגול ואת ההקלטות כדי שנוכל לעקוב אחרי החומר ולא להעתיק תוך כדי השיעור\n\nשעורי הבית: \nהגשות בכתב- פעם בשבועיים בערך אבל כל גיליון לוקח די הרבה זמן ואין כל כך רפרנסים. רמה קשה יחסית\nוובוורק- קצת חופר ומעיק ולוקח זמן לעשות. יש וובוורקים קשוחים ממש ויש גם סבבה\n\nהמבחן: עקב מרצה אחראי חדש הרמה במבחן עלתה מעט ומבנה המבחן טיפה השתנה ולכן פתרון מבחנים של שנים קודמות לא היו הכי אפקטיביים\nחלק נכבד מהמבחן במועד א' היה בנוי על 2-3 התרגולים האחרונים שהיו עמוסים ברמות ולא היה זמן לעבור כמו שצריך על נושאים בגלל סוף סמסטר ותחילת מבחנים. נתנו פקטור של 15 נקודות (לפני הפקטור הממוצע היה 45)\nמועד ב'- טיפה יותר נחמד אך ללא פקטור.\n\nהשורה התחתונה: מאוד ממליצה לעשות רענון פונקציות לפני התרגול הראשון (יש באתר של הקורס קישור לרענון החומר)  לא לוותר על שעות קבלה, לנסות כמה מתרגלים עד שתמצאו את מי שמתאים לכם. להיעזר בdesmos ו- symbolab בהגשות.", "timestamp": 1647192782173}, {"author": "Emi", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: הרצאות לא ברורות, מפוזרות, קשה להבין ומבולגן מאוד. במילה אחת - להתרחק.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: מתרגלת מהממת, מסבירה כל מה שצריך, תרגולים חשובים מאוד ותורמים, מה שכן קצת איטית, היינו בפער של שבוע מההרצאות וזה הקשה מאוד\n\nשעורי הבית: קשים, סיזיפיים אבל תורמים\n\nהמבחן: פשוט נורא. אין מילה אחרת לתאר.. לקחת פקלים לחזור טוב על טורים..\n\nהשורה התחתונה:", "timestamp": 1647249318401}, {"author": "Chen Gal", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: לא טוב, מתקשה מאוד ללמד\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: נהדרת, משקיעה מעל ומעבר, נראה שהציונים של מי שהגיע לתרגולים שלה היו יחסית גבוהים \n\nשעורי הבית: הרבה\n\nהמבחן: קשה, פקטור משמעותי\n\nהשורה התחתונה: יוסי כהן המרצה האחראי ניהל לא טוב את הקורס, לא היה ברור לגמרי מה הדרישות", "timestamp": 1647698238236}, {"author": "shir", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניזאר\nחוות דעת - הרצאות: כיף ומצחיק איתו אבל הוא לא יודע ללמד לצערי\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מדהימה, מעבירה את החומר בצורה מעולה ועושה מעל ומעבר\n\nשעורי הבית: סבבה\n\nהמבחן: לא קשור בעליל לרוב החומר שלמדנו\n\nהשורה התחתונה: לא כיף", "timestamp": 1647872087670}, {"author": "עדן הוכלר", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ניזאר\nחוות דעת - הרצאות: לא מסודר,לא תמיד מובן, צריך לצעוק לו לפעמים כמה פעמים כדי שישמע בכלל את השאלה (אחרת הוא מתעלם). לא מומלץ בזום. לא מומלץ באופן כללי- רק בגלל אילוצי מערכת הייתי אצלו.\nהייתי רואה הקלטות של יוסי וסרטונים של צנזור של חדווא 1 ת' כדי להבין חלק מהדברים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רבקה אביטל- מעולה! עוברת מהר על תרגילים ברמת קושי מספקת לקורס (לא קל מידי) צריך להיות איתה וזה קצת קשה אם מעתיקים תוך כדי.\nאולג- מעולה! יותר מסביר ועושה תרגיל ברמה בינונית-קלה ואחד בינוני-קשה בתרגול לעומת נגיד 5 בינוני-קשה אצל רבקה אבל מסביר כ כך טוב שממש מבינים הכל.\nאיריס- מצוינת וחמודה, מעלה את הסיכום שיעור והקלטות גם ככה שאין צורך ממש להעתיק למי שנוח להתסכל אחרי זה על הגפים שלה. מסבירה מצוין וישלה שיטות טובות לזכור.\n\nשעורי הבית: לפעמים קשים בצורה חריגה ונראה שלא מתאימים כל כך לקורס. היו שאלות ששאלנו מתרגלים וגם הם הסתבכו.\n\nהמבחן: רמת קושי לא תואמת לקורס בכלל, קשה ברמות ואל סתם הממוצע נמוך. גם תרגול דל מבחנים רבים לפני לא עזר במיוחד. יוסי שהיה המרצה האחראי סירב לומר מה החומר לקורס (על אף שכל מרצה לימד אחרת) ולא קיבל הגדרות של מרצים אחרים (כי לא מדויק והוריד על זה בבחינת מגן).\n\nהשורה התחתונה: קורס קשה ומעיק , מלמדים בשיעור א', מתרגילים א'+ב' והשיעור בית בכלל ג'+ד'. היחס של המרצים או המתרגלים אחד על אחד היה סבבה אבל כקורס הורגש שלא אכפת להם בכלל.", "timestamp": 1648457424426}, {"author": "EK", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  ניזאר\nחוות דעת - הרצאות: אישיות 100ממת, אך לא מעביר את החומר בצורה הברורה ביותר\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: אין עליה בעולם, מתרגלת אגדית שחוזרת על החומר של ההרצאה בכל תרגול. מלמדת את הכל, מסבירה לפרטים את העיקר ושמה דגש על החומר שיהיה במבחן. מכירה כל מרצה אחראי ואת שיטות הבחינה שלו, ומתרגלת בהתאם. כל הסיכומים של בתרגולים היא מעלה לבוקס שלה. איריס מלכה!! יצאנו לדרך\n\nשעורי הבית: לא תואמים את המבחן, תלוי במרצה האחראי. \n\nהמבחן: תלוי מרצה אחראי. אם זה יוסי, זה יהיה ברמה של חדווא 2מ'\n\nהשורה התחתונה: קורס תלוי מרצה אחראי, אין על איריס היא מכינה את הסטודנטים לתרחישים הכי גרועים!", "timestamp": 1654549274695}, {"author": "M", "difficultyRank": 2, "generalRank": 4, "semester": "202103", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מדהימה אכפתית וקשובה\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: חמודה וקצת קשה להבנה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1656934960149}, {"author": "אושרת חניא", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שוקי\nחוות דעת - הרצאות: מרצה טוב, ממליצה לכתוב פחות ולהקשיב יותר\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: \nהתרגולים כתובים כך שקל לעקוב אחריה\nשעורי הבית: סבירים\n\nהמבחן: סביר\n\nהשורה התחתונה: מומלץ", "timestamp": 1672135501653}, {"author": "איליה כץ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שוקי ארושס\nחוות דעת - הרצאות: מרצה מצוין, מצליח לשמור על הקשב של הכיתה. עובר על החומר ביסודיות ונותן שפע של דוגמאות. החיסרון היחיד זה שאין אצלו הפסקה באמצע, אבל זה משתלם בטווח הארוך.\n\nשם המתרגל/ת: ד\"ר אולג קריס\nחוות דעת - תרגולים: יודע אילו דוגמאות לתת ועל מה לשים את הדגשים, אם מקשיבים ויודעים על מה הוא מדבר- התרגולים עוזרים מאוד\n\nשעורי הבית: 5 גליונות הגשה ידניים, 12-13 גליונות ממוחשבים. לא פשוט, אבל נותן חזרה טובה ויישום של החומר בהרצאות\n\nהמבחן: עוא לא היה, בוחן האמצע היה הוגן\n\nהשורה התחתונה: קורס לא קל, אבל חובה. אם משקיעים ופותרים את הגליונות בלי רפרנסים- החומר יישב טוב.", "timestamp": 1673949369377}, {"author": "אדוה פפו", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר' שוקי ארושס\nחוות דעת - הרצאות: ההרצאות היו טובות, לקח קצת זמן להתרגל לעובדה שהוא מרצה לאורך שני הסלוטים בלי ההפסקה באמצע, אבל היה ברור שהוא עושה את זה על מנת שהוא יוכל לענות על כמה שיותר שאלות. באופן כללי הוא היה סבלני והסביר הכל באופן מסודר וברור, מרצה מעולה סך הכל. \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: איריס מסבירה הכל בצורה ברורה, הקצב דיבור שלה אומנם מאוד גבוה אבל של התרגולים עצמ לא, היא עונה על שאלות ומסבירה את הדברים בצורה טובה ובנוסף על כך היא נותנת דגשים על איפה אפשר ליפול ואיפה עלוים לטעות ולמה כדאי לשים לב, שזה מאוד מוסיף ומחדד את הדברים. \n\nשעורי הבית: היו לא מעט מהם, אבל זה הגיוני עבור קורס של 5 נקודות, היו מידי פעם שאלות מאוד מורכבות, אבל סך הכל הם היו סבירים וניתנים לפתירה בלי יותר מידי קושי. \n\nהמבחן: המבחן עצמו היה די הוגן, לא הודיעו מראש מה יהיה מבנה המבחן, אז הייתה קצת תחושה שמנחשים במה הולכים להיתקל, ובנוסף לזה שוקי היה המרצה האחראי בפעם הראשונה אז לא ממש היה אינדיקציה למה לצפות מהשאלות, סך הכל הוא לא היה מאוד מפתיע או מורכב, אבל עוד לא חזרו הציונים... הבוחן אצמע היה הוגן מאוד, לא מורכב, בדיוק במבנה הרגיל של בחני אמצע והם הודיעו על המבנה מראש, הממוצע היה 65.\n\nהשורה התחתונה: זה קורס גדול וכבד, הוא לא פשוט אבל סך הכל התנהלו בצורה טובה, לא היה עומס מיותר או שיעורי בית עודפים ומאוד השתדלו להיות הוגנים איתנו ולענות על שאלות או בקשות שעלו.", "timestamp": 1675672920657}, {"author": "nitzanL", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שוקי\nחוות דעת - הרצאות: רץ מהר מדי, לא נותן הפסקות\n\nשם המתרגל/ת: אירס\nחוות דעת - תרגולים: מהממת! כותבת הכל ומעלה לבוקס, לא צריך להעתיק\n\nשעורי הבית: קשיםםםם\n\nהמבחן: קשה, בדקו הוגן\n\nהשורה התחתונה: צריך לקחת אין ברירה", "timestamp": 1679222664006}, {"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שוקי ארואס\nחוות דעת - הרצאות: מרצה מעולה, דואג שיהיה מעניין ושמי שיושב בכיתה באמת יבין ולא יפחד לשאול שאלות\n\nשם המתרגל/ת: אולג\nחוות דעת - תרגולים: מתרגל טוב באווירה קלילה, ממליץ מאוד\n\nשעורי הבית: רמה גבוהה יותר מהמבחן\n\nהמבחן: הוגן\n\nהשורה התחתונה: צוות הקורס טוב ואכפתי, ולי אישית גם עזר הקורס אונליין של סטאדיס, יש שם כל מה שצריך לקורס וזה לדעתי חובה למי שרוצה להוציא ציון טוב", "timestamp": 1684666705272}]}