{"posts": [{"author": "דוד", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ניר לזרוביץ\nחוות דעת - הרצאות: פשוט מרתקות , אין מילה אחרת...\n\nשעורי הבית: מאתגרים ודורשים חשיבה ומדיטציה, אבל עומס לא גדול מבחינת כמות\n\nהמבחן: הוגן\n\nהשורה התחתונה: סופר מומלץ לאלו שהתחברן לרעיון הכללי של מטרו (פה אין ממש את כל הדקויות והפורמליזם), מקבלים בקורס המון אינטואיציה טופולוגית, והוא נורא מעניין.", "timestamp": 1599385895473}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות: הרצאות מעניינות, לפעמים קשה לעקוב אז חשוב ממש לשאול שאלות ולא להתבייש \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית קשים אבל מלמדים טוב. יש ארבעה גיליונות, צריך להגיש שלושה מהם ומותר להגיש אחד באיחור של שבוע בלי לבקש.\nאם מגישים את ארבעתם מקבלים בונוס די גבוה למגן. באופן כללי ממש ממש מומלץ לעשות אותם כי את רוב הקורסים לומדים בעבודה עם הידיים ולא רק מלהקשיב להרצאות ולקרוא\n\nהמבחן: \nהיתה שאלה אחת לא פתירה במבחן, אבל חוץ מזה היה יחסית הוגן\n\nהשורה התחתונה: קורס ממש ממש מעניין אבל דורש השקעה ביחס לנק\"ז שלו", "timestamp": 1626423664365}, {"author": "משטח לא אוריינטבילי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: אני הייתי מאוד מרוצה מההרצאות. טלי אחלה מרצה. אני אישית גם מעריך מרצה שלא נצמדת לדפים ולרשימות אלא מנסה להעביר את החומר לפי האינטואיציה והידע שלה. מצד שני זה עשוי לגרום לה לפעמים לא להיות מסודרת. \n\nשם המתרגל/ת: טלי פינסקי.\nחוות דעת - תרגולים: תרגולים בטופולוגיה? זה אפשרי. טלי העבירה סדנה - שעה שבועית במקום הרצאה. אפשר היה ללמוד הרבה מהסדנאות וזה היה כיף לא נורמלי לעבוד בכיתה עם חבר'ה ולחשוב ביחד.\n\nשעורי הבית: הסדנאות הם שיעורי הבית שעושים בכלל בכיתה.\n\nהמבחן: אז פה התברר שהמבחן היה קשה אבל ניתן לצלוח בשלום יחסי. במבחן ראינו שאלות דומות למה שהיה בסדנה, אבל בדיעבד אני חושב שהייתי צריך לתרגל יותר דוגמות ולפתור יותר שאלות.\n\nהשורה התחתונה: מומלץ, במיוחד כשזה עם טלי. לקחתי טופולוגיה בשביל ההעשרה ונהניתי. לדעתי היה אפשר להקיף יותר חומר בהרצאות, ולוותר על הפרק בגיאומטריה היפרבולית שזה חביב אבל זה לא טופולוגיה והפרק הזה נמצא גם בסילבוס של קורס אחר בגיאומטריה. היינו יכולים להכיר יותר נושאים והגדרות בטופולוגיה (לא דיברנו על בקבוק קליין, לא דיברנו על אופרטור wedge). \nהיה חסר לי גם: עוד גיליונות הגשה של שיעורי בית עם יותר דוגמות קונקרטיות לשימוש במשפטים ורעיונות שלמדנו, כדי להתכונן טוב יותר למבחן. תירגעו, אני בעד שזה יהיה מגן, לא חובה.", "timestamp": 1659437571932}, {"author": "הומוטופי לנקודה", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר לזרוביץ\nחוות דעת - הרצאות: \nמעניין בטירוף!ניר אלוף בלהסביר את הדברים כמה ויזואלית שאפשר ופשוט מנגיש את הקורס להבנה מרחבית,וכל זה בלי לוותר אפילו על גרם של פורמליות מתמטית\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין,יש סדנאות שהן פתירת תרגילים בקבוצות כשהמרצה נמצא ועוזר\nשעורי הבית: \nקשים מאוד אבל מפתחים את ההבנה בכל הקשור לקורס,חשוב מאוד לעשות\nהמבחן: \nהוגן מאוד,לא שום דבר שלא ראינו\nהשורה התחתונה: מומלץ מאוד!", "timestamp": 1714485717636}]}