{"posts": [{"author": "Noam", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: לירן רותם\nחוות דעת - הרצאות: מרצה מצוין. העביר טוב את החומר וידע להתחשב במצב המיוחד של סמסטר קורונה ראשון ובקשיים שנובעים מכך.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: קצת קשים ולא ממש ברורים. אני אסייג ואגיד שיכול להיות שזה בגלל השתתפות נמוכה בשיעור ולכן היא לא ידעה מה הקצב של הסטודנטים.\n\nשעורי הבית: פעם בשבועיים. יחסית קשים\n\nהמבחן: קשה יחסית. צריך להשקיע בלמידה\n\nהשורה התחתונה:", "timestamp": 1602579444645}, {"author": "Arex 36", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אדי\nחוות דעת - הרצאות: כל קורס עם אדי זה קורס טוב\n\nשם המתרגל/ת:  שקד לייבזירר\nחוות דעת - תרגולים: מלמד סבבה, אם יעלה את סיכום תרגולים למודל יהיה מושלם\n\nשעורי הבית: קצת קשוחים\n\nהמבחן: אדי תמיד הוגן, דורש הבנה מלאה", "timestamp": 1612349318224}, {"author": "JFK", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אדי מאיר-וולף\nחוות דעת - הרצאות: אדי מרצה מעניין, לפעמים יש הרגשה שהחומר בכל שבוע לא קשור לשאר השבועות ובעצם למדנו 13 נושאים חצי קשורים.\n\nשם המתרגל: שקד לייבזירר\nחוות דעת - תרגולים: שקד מתרגל טוב, מרגיש שאין מספיק שעות תרגול לקורס.\n\nשעורי הבית: קשים מאוד\n\nהמבחן: קשה והוגן ברובו\n\nהשורה התחתונה: קורס קשה ומעניין, עוד שעת תרגול תתקבל בברכה.", "timestamp": 1614981984013}, {"author": "Itay Tal", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אדי מאיר וולף\nחוות דעת - הרצאות: \nמאוד ברור ומעניין, כיף ללמוד איתו.\nשם המתרגל/ת: שקד לייבזירר\nחוות דעת - תרגולים: \nתרגולים מאתגרים ומעניינים. השאלות קשות ומספקות הכנה טובה למבחן.\nשעורי הבית: \nלא מסובכים, ההגשה בזוגות עוזרת עם הלחץ.\nהמבחן: \nלא קל בכלל. \nהשורה התחתונה: \nקורס קשה אך יפה.", "timestamp": 1615747780834}, {"author": "אינדיקטור", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אדי מאיר-וולף\nחוות דעת - הרצאות: נחמד מאוד ומסביר טוב, אבל לצערי בשבועיים האחרונים של הסמסטר רץ על החומר (הכי קשה) ממש מהר כי לא הספקנו. היה קשה להתכונן ככה למבחן\n\nשם המתרגל/ת: שקד לייבזירר\nחוות דעת - תרגולים: מתרגל מעולה ומסביר טוב מאוד (ומצחיק!), אבל שעת תרגול אחת בשבוע זה ממש ממש ממש לא מספיק בשביל הקורס.\n\nשעורי הבית: \nעמוסים מאוד (9 גליונות קשים). כדאי לעשות את כולם כדי להתכונן למבחן. אפשר בזוגות אבל לא יודע אם הייתי ממליץ, מקסימום להשוות פתרונות עם חבר..\n\nהמבחן: \nלא קל בכלל, מערב נושאים מכל הסמסטר ובוחן על ההבנה של כולם. יחד עם זאת, הוגן. אפשר להצליח את מבינים הכל ומתכוננים מספיק. כדאי להתכונן במיוחד על זמנים, במתכונת של המבחן שלנו (6 שאלות נכון/לא נכון ו4 שאלות פתוחות) היה לי עמוס מאוד ובקושי הספקתי לסיים. (וחלק מהנכון/לא נכון ניחשתי לפי אינטואיציה..)\n\nהשורה התחתונה: \nהקורס הכי קשה שהיה לי הסמסטר, אבל אולי גם הכי מעניין ומספק. בסוף גם זה נגמר...", "timestamp": 1616398631817}, {"author": "א.ו", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: לירן רותם\nחוות דעת - הרצאות: באתי בציפיות נמוכות כבר בהרצאה הראשונה הבנתי שטעיתי ההרצאות הכי מעניינות שהיו לי בתואר עד כה תחילת הקורס מלא במושגים והגדרות אך לירן מסביר את האינטואיציה שעומדת מאחורי ההגדרות וחושף את היופי שלהן לקראת סוף הקורס רואים תוצאות מפתיעות שעושות חשק ללמוד עוד על התחום הענק שנקרא הסתברות.\nאת כל הקורס הוא מסביר בהתלהבות וריגוש כך שקשה לא להתרכז במהלך ההרצאות.\nהוא מעודד שאלת שאלות במהלך ההרצאות ותמיד גם מביא תשובות מאוד מספקות.\n\nשם המתרגל/ת: שקד לייבזירר\nחוות דעת - תרגולים: לרוב השאלות עם סיפור רקע מצחיק מה שעושה אווירה טובה במהלך התרגול, תרגילים מאוד עוזרים כדי להבין איך ניגשים לשאלות בהסתברות ומראים את הכוח של המשפטים שרואים בהרצאה.\n\nשעורי הבית: מאוד מאוד חשובים להבנת הקורס ולא לוקחים יותר מידי זמן \n\nהמבחן: \nהמבחן היה פייר לא מאוד קשה בלי חישובים יותר מידי כמו שאני אוהב ואת החישובים הבודדים שהיה ניתן היה לקצר אותם באמצאות טריקים הסתברותיים. לצערי לא היה בורל קנטלי אבל לא נורא\n (המלצה למבחן כאשר אתם מוצאים פונקציית צפיפות תבדקו אם באמת האינטגרל יוצא 1 כדי לחסוך טעויות נגררות)\nהשורה התחתונה: אחלה בחלה של קורס למזלי עשיתי אותו עם לירן ושקד שהם שניהם מצוינים+.  הקורס שינה לי את איך שאני חושב על הסתברות ועל מתמטיקה בכלל", "timestamp": 1628075567213}, {"author": "יוראי", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דר. לירן רותם\nחוות דעת - הרצאות: ממש טובות, היה רישום מסמסטר אביב שנה לפני וההרצאות ממש דומות. היכן שהן שונות לירן ציין זאת.\n\nשם המתרגל/ת: מר שקד לייבזירר\nחוות דעת - תרגולים: התרגולים נחשבים ל\"קשים\" אבל ממש מכינים למבחן.\n\nשעורי הבית: שיעורי הבית ששקד ולירן הביאו היו מלמדים מאוד. וכדאי לפתור אותם הקפדנות אך לשים לב לא לבזבז יותר מידי זמן. מכינים מאוד למבחן.\n\nהמבחן: קיבלתי 86 כי לא ידעתי לענות על שאלה של 10 נק'. לא ראיתי את שני ההרצאות האחרונות בזום המדברות על משפט הגבול המרכזי. תראו את כל ההרצאות.\n\nהשורה התחתונה: רק עם לירן. יש גם רישימות של הרצאות. לירן מקסים ועונה על שאלות תמיד ומנסה להסביר אינטואיציה בלי לחרבש לך בשכל ומציין למה כדאי לשים לב ולמה לא.", "timestamp": 1630578999323}, {"author": "שוקובו", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: דה בסט אוף דה בסט\n\nשם המתרגל/ת: נוי סופר אהרובנות\nחוות דעת - תרגולים: אני מאוד אוהב, היא דיי מסודרת וגם מאוד אדיבה ונחמדה. מומלץ מאוד\n\nשעורי הבית: לא נוראיים במיוחד, היו פעם בשבועיים גיליון ועם מלא רמזים\n\nהמבחן: רוס אוהב למחזר שאלות, היה מועד א הוגן לדעתי. הוא נתן המון רמזים בשעת קבלה יום לפני\n\nהשורה התחתונה: אין לכם ברירה לקחת אותו", "timestamp": 1643896154625}, {"author": "1", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nהרצאות מעניינות \nרוס רצה נפלא ומסביר טוב מאוד\nאך קיימות הרבה בעיות טכניות בזום\n\nשם המתרגל/ת: \n\nחוות דעת - תרגולים: \nלא מתרגלת טובה\n\nשעורי הבית: \nעוזרים מאוד להבנת החומר לפעמים לא קשורים\nוהם באנגלית\n\nהמבחן: \nהיו שאלות חוזרות\nושאלות קשות\nאך בסכ מבחן הוגן\n\nהשורה התחתונה: \nנחמד מאוד", "timestamp": 1643902321494}, {"author": "Yonez", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לירן רותם\nחוות דעת - הרצאות: \nההרצאות היו מעניינות ומאוד ברורות ומסודרות עם הרבה דוגמאות, רוב החומר בקורס הוא הגדרות אבל החומר מעניין ולא מאוד קשה. \nלירן הוא מרצה מצוין ומאוד אכפתי\nשם המתרגל/ת: יואב דניאלי\nחוות דעת - תרגולים: התרגולים היו קצת לא מובנים, עם תרגילים קצת קשים מדי\n\nשעורי הבית: חלקם היו קצת ארוכים ומאתגרים אבל סהכ עזרו להבין את החומר\n\nהמבחן: המבחן היה הוגן, למרות שבהשוואה למבחני עבר של לירן הוא היה קשה יותר משמעותית.  מי שיעשה איתו את הקורס שיקח בחשבון שהמבחנים מלפני אביב 22 קלים מדי ולא לקחת אותם כדוגמה\n\nהשורה התחתונה: קורס מעניין ולא עמוס במיוחד ולירן מרצה ממש טוב", "timestamp": 1659704269381}, {"author": "עידן", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ד\"ר לירן רותם\nחוות דעת - הרצאות: \nהמרצה הכי טוב שהיה לי בטכניון עד כה. מסביר מעולה, מעביר אינטואיציה על כל דבר, מתמקד במה שחשוב, קשוב לסטודנטים, ומשקיען רציני. גם שידר בזום והעלה הקלטות לאורך כל הסמסטר, מה שממש עזר ללמוד.\nשם המתרגל/ת: יואב דניאלי\nחוות דעת - תרגולים: \nמשקיע ומעלה רשימות מסודרות. לפעמים ההסברים שלו לא היו לי הכי ברורים, אבל ההקלטות עזרו לסגור את הפינה ולחשוב על הדברים אחרי זה לבד בבית. השקיע בבדיקת שיעורי הבית ולדעתי רוב הפידבקים שנתן היו יחסית מועילים. סה\"כ מומלץ.\nשעורי הבית: \nתרגיל בית כל שבועיים, כאשר יש שבוע להגיש אותו מהרגע שהוא מתפרסם. הם היו לי די קשים במהלך הסמסטר, ומהעומס נאלצתי לרפרנס הרבה. אח\"כ אכלתי אותה במועד א', ורק אחרי שפתרתי באופן רציני את רוב שיעורי הבית לפני המועד ב' הצלחתי לקבל ציון סביר. נסו להשקיע בהם מספיק זמן, זה באמת קריטי למבחן (לפחות להצליח לפתור את הרוב לבד, לפעמים יש שאלות ברמת קושי גבוהה מהמבחן)\nהמבחן: \nבעיניי מועד א' לא היה נורא קשה, ובמועד ב' הרמה עלתה. בכל מקרה צריך לתרגל הרבה לפני המבחן, מה שגם שני המועדים היו קשים יותר מהמועדים הקודמים של לירן, אז עזר לי אישית גם לעבור על התרגילי בית שוב, וגם לפתור מבחנים של מרצים אחרים.\nהשורה התחתונה: קורס מעניין, אבל די קשה בעיניי. היה לי מאתגר להצליח לעבור אותו עם ציון סביר מינוס.", "timestamp": 1665395996833}, {"author": "Canteli", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: Ron Rosenthal\nחוות דעת - הרצאות: אין על רון רוזנטל בעולם כולו. ההרצאות באנגלית היו קשוחות, רון לא רץ, הסביר והשקיע בקורס ובנו. \nבכל מקרה זה קורס קשוח, מפוצץ בחומר ובנושאים, אין אינטואיציה בכלל לחומר.\n\nשם המתרגל/ת: נוי סופר.\nחוות דעת - תרגולים: אני לא ממליץ בכלל.\n\nשעורי הבית: קשים בטירוף, וברובם פשוט ביטלו שאלה כי היה בה שימוש בחומר שלא למדנו. מאוד מבאס.\n\nהשורה התחתונה: קורס קשוח, לא ממליץ לקחת באנגלית", "timestamp": 1677453524279}, {"author": "Nobody", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: \nטוב, אין בכלל ספק שרון המרצה הכי טוב בפקולטה, אכפת לו מאד מהקורס ומהסטודנטים והקורס מועבר ברמה גבוהה.\nהרשימות שלו הן בעברית והקורס מועבר באנגלית, אז היה צריך קצת לתרגם במקרה הצורך.\nשם המתרגל/ת: נוי סופר אהרונוב\nחוות דעת - תרגולים: \nהרגיש שלא היה ככ תיאום בין רון לנוי, נוי תירגלה איתנו דברים שבכלל לא למדנו בהרצאה, והיה לפעמים בלבול גדול בתרגולים שלה.\nשעורי הבית: \nהשיעורי בית היו קשים וארוכים.\nיש 5-7 שאלות כל שבוע להגשה, ועוד מספר דומה לא להגשה, ויש שאלות שמצריכות כמה שעות טובות של מחשבה.\nלענ\"ד חשוב מאד לעשות אותם כי זה קורס שדורש המון תרגול ושעות התרגול לא מספיקות בכלל.\nהמבחן: \nמבחן לא קל, הייתה שאלה שלמה על התכנסויות, שזה חומר שלמדנו עם מרצה אחר בכלל.\nהמזל היה שזה היה עד 110 נקודות ורון בדק בדיקה מקלה מאד, ולכן הממוצע מאד גבוה.\nהשורה התחתונה: \nהקורס הזה שונה מאד מכל מה שראינו עד עכשיו בתואר, ולכן הוא די קשה לעיכול.\nחוץ מזה, לא מבין מי החליט שדווקא את הקורס הזה, עם הכי הרבה מלל, החליטו לעשות באנגלית.", "timestamp": 1678718483932}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עמנואל מלמן\nחוות דעת - הרצאות: \nקודם כל רואים שחשוב לו ללמד טוב. אבל וזה אבל גדול, הדרך שלו נוקשה ואכזרית. בשלב מסוים הרבה פחדו לשאול שאלות בגלל היחס הלא נעים והערות לא נעימות. הקורס מרתק אבל פיתחתי אנטי רק בגלל המרצה. אולי יותר טוב בקורסים אחרים, כאן לא להתקרב.\n\nשם המתרגל/ת: נוי סופר\nחוות דעת - תרגולים: \nמאוד מפוזר ומבולגן. התקשתי לעקוב. עברתי לצפות בתרגולים ביוטיוב.\nשעורי הבית: \nארוכים אבל בזוגות. \nהמבחן: \nארוך, ״תסיימו עם הלשון בחוץ״. אישית, המבחן היה מלחיץ ברמה קיצונית, נעשו טעויות שטותיות, בטעויות המרצה הוסיף הערות ביקורתיות ושליליות שלא תורמות לדבר. \n\nהשורה התחתונה: \nהסגל הרס לי את כל החוויה של הקורס.", "timestamp": 1704879127056}, {"author": "השיכור המהלך", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: רוס מרצה נהדר. כל חומר שהוא מסביר הוא מסביר טוב ובאופן אינטואיטיבי, לא חוויתי חוסר העמקה, אבל גם לא עשיתי את הקורס תחת מרצה אחר\n\nשם המתרגל/ת: לא הלכתי לתרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה לגמרי.\n\nהמבחן: היה מבחן הוגן יחסית, בחן את  החומר שנלמד ולא מעבר.\n\nהשורה התחתונה: נושא מעניין, רוס מרצה ממש טטב", "timestamp": 1716318310635}, {"author": "איפכא מסתברא", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: רוס אחלה מרצה ויודע להעביר את החומר בצורה מעניינת. גם הוא זוכר את השמות של בערך כל התלמידים בקורס שזה די מגניב ומראה על אכפתיות שלו.\nמבחינת החומר שהועבר בהרצאות אז זה היה די קליל ולא באמת היו הוכחות כבדות או דברים שלא יחסית מיידיים מהגדרות/אינטואיציה. לא ברור לי אם זה בגלל איך שרוס העביר או שזה ככה בקורס הזה באופן כללי, אבל משמועות ששמעתי אז רוס בדרך כלל \"מקליל\" קצת קורסים שהוא מעביר.\n\nשם המתרגל/ת: יואב דניאלי\nחוות דעת - תרגולים: יואב אחלה מתרגל והעביר את החומר בצורה טובה. גם אם אני לא טועה הוא בנה את התרגולים שהיו מאוד טובים ורלוונטים וגם היו לנו זמינים במודל עם פתרונות. בשלב מסויים בקורס קלטתי שיותר מהיר לי וגם זאת למידה יותר אקטיבית פשוט לנסות לפתור את השאלות של התרגולים בעצמי במקום להגיע לתרגולים, אבל זה לא כי יש לי טענה נגד יואב אלא פשוט כי התרגולים היו כתובים כמו שצריך וזמינים לנו.\nהוא גם נכנס לקבוצת וואטספ שלנו כדי לענות על שאלות שלדעתי זה יפה ומראה על אכפתיות.\n\nשעורי הבית: משהו כמו 6 גליונות, ברמה לא קשה מדי ורלוונטים לחומר שלמדנו.\n\nהמבחן: סביר לגמרי, רוס יחסית עושה מבחנים דומים למבחני עבר שלו אז מומלץ לפתור אותם (וגם יש איזה חוברת מבחנים ישנה שיש שם איזה שני מבחנים שלו מתחילת שנות ה2000 אם אתם מצליחים למצוא אותה)\n\nהשורה התחתונה: חומר יחסית מעניין, רוס אחלה מרצה, יואב אחלה מתרגל, לא קשה מדי. ממליץ", "timestamp": 1716491253450}, {"author": "צ'בישב", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: רוס מרצה מעולה, מסביר טוב את החומר ותמיד יש אווירה טובה בהרצאות. בנוסף רואים שאכפת לו מהסטודנטים והוא רוצה שכולם יצליחו.\n\nשם המתרגל/ת: יואב דניאלי\nחוות דעת - תרגולים: סבבה, לדעתי בשעה תרגול קשה לתת הרבה ערך אבל כן היו תרגילים נחמדים שעזרו להבין את החומר.\n\nשעורי הבית: היו 6 גליונות, רוב השאלות היו ממש בסדר ובעיקר בדקו הבנה בסיסית. פה ושם היו שאלות קצת יותר טריקיות. סה\"כ לא מאוד עמוס וגם היו הרבה שעות קבלה אז אפשר תמיד ללכת לשאול אם נתקעים.\n\nהמבחן: מאוד הוגן, היו שאלות שמוחזרו ממבחני עבר של רוס וגם שאר השאלות היו בסדר.\n\nהשורה התחתונה: קורס מאוד מעניין, הרגיש לא עמוס מדי ולא קשה מדי אבל זה כנראה בהשפעת הסגל ובעיקר רוס. בנוסף אהבתי את זה שהקורס עבר באנגלית כי יותר קל ככה לחפש מידע באינטרנט כשמכירים את המושגים באנגלית.", "timestamp": 1716702345399}]}