{"posts": [{"author": "SR", "difficultyRank": 4, "generalRank": 5, "semester": "201801", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ראיתי את צנזור בווידאו, וכמו באינפי 1מ, גם כאן הווידאו מאוד מומלץ ומסודר. מה שכן, לשים לב שבסמסטרים האחרונים יש מרצה אחראי חדש, ולכן יכול להיות שיש לו דגשים אחרים, ולכן חשוב לוודא שאין הבדלים.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: בסמסטר שלי המתרגלים לא היו כל כך טובים, ולכן בשלב מסוים פשוט למדתי מסיכומים של תרגולים מסמסטרים קודמים. אם יוליה מתרגלת אני ממליץ עליה, הייתי איתה באינפי 1מ והייתי מאוד מרוצה.\n\nשעורי הבית: שיעורי הבית בערך באותה רמת עומס וקושי כמו של אינפי 1מ. חשוב מאוד להשקיע בהם את הזמן, ובמידת הצורך להיעזר בשעות קבלה / רפרנסים כשהתרגילים לא פתירים.\n\nהמבחן: בסמסטר שלי היו 2 מבחנים - מבחן אמצע על החלק הראשון של הקורס, ומבחן בסוף הסמסטר שהיה על החלק השני של הקורס. אני חושב שהחלוקה הייתה מאוד נוחה, כי יש הבדל די רציני בין 2 החלקים של הקורס. סה\"כ המבחנים היו די הוגנים.\n\nהשורה התחתונה: כנראה שמי שאהב את אינפי 1מ, יאהב גם את הקורס הזה. עמוס ומאתגר, אבל אני נהניתי.", "timestamp": 1597746580282}, {"author": "מבין עניין", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nאחלה מרצה, אוהב להרחיב טיפה מעבר לסילבוס הקורס.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמתרגל מאוד מסודר, ככה שרוב הפיתרונות שלו הם פורמליים כמו שצריך למבחן.\nשעורי הבית: \nיש מגן מטורף של איזה 25% רק משיעורי הבית, שלרובם יש רפרנס.\nרוב הגיליונות מאוד פתירים, פרט לשאלה אחת או שתיים שדורשות טריק שלא נלמד בתרגול.\nהמבחן: \nהמבחן בסמסטר הזה היה מאוד קל יחסית לסמסטרים קודמים (כנראה בגלל הקורונה) אבל כן דרושה הבנה של כל גיליונות הבית (והמתנט) וצריך לדעת להוכיח משפטים חשובים (או משפטים עם הוכחות קצרות)\nהשורה התחתונה: \nקורס לא פשוט, בסוף הסמסטר יש בערך 150 משפטים שצריך לזכור (+הוכחה) אבל אם לומדים ומתרגלים במהלך הסמסטר כמו שצריך, אין בעיה להוציא ציון גבוה. הייתי ממליץ לנסות לזכור משפטים כבר במהלך הסמסטר.\nרוב השאלות במבחן הסופי הן מאוד טכניות אחרי שפותרים כמה מועדים.", "timestamp": 1597828436331}, {"author": "יונתן נחום", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nמרצה סביר\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרצה מאוד מהר בתרגולים, למי שרוצה לראות הרבה סוגי תרגילים אבל אחרי התרגול לעבור על הכל כדי להבין לגמרי היא מתאימה\n\nשעורי הבית: \nכמו באינפי 1מ\nהמבחן: \n\nהשורה התחתונה: \nקורס לא קל בכלל, הקושי הולך ונבנה ככל שהקורס מתקדם", "timestamp": 1597852380835}, {"author": "א", "difficultyRank": 2, "generalRank": 2, "semester": "201902", "text": "לדעתי זאת פשוט ירידה מאינפי 1מ', גם עבור מישהו שאהב את אינפי 1מ' ונהנה ממנו (או יכל לראות למה המתמטיקה יפה). פה פשוט דוחסים משפטים בשביל להספיק חומר (או לפחות כך הייתה התחושה)\n\nשם המרצה: יוחאי מעיין ומיכל קליינשטרן\nחוות דעת - הרצאות: בגלל הקורונה הרצאה אחת בשבוע הועברה ע\"י יוחאי והשנייה ע\"י מיכל. שניהם מרצים בסדר, הבעיה היא שהם דוחסים הרבה משפטים בפרק זמן קצר בלי לתת אינטואיציה. לא יודע אם זה מעיד משהו עליהם כמרצים או על החומר בקורס שעליו אחראי יוחאי.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מצויין, סיפר את האינטואיציה בהרבה מקומות שבהם יוחאי ומיכל לא סיפקו ומאוד עזר להבנת החומר\n\nשעורי הבית: גיליון פעם בשבועיים, לא מאוד עמוס אבל מאתגר\n\nהמבחן: קשה כמו באינפי 1מ'.\n\nהשורה התחתונה:", "timestamp": 1598988842616}, {"author": "סאמי", "difficultyRank": 4, "generalRank": 2, "semester": "201901", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: קשוח, קשה לעקוב. הוא גם מאוד אוהב להיכנס לפרטים הקטנים אז הוכחות הופכות לארוכות ומסורבלות וקשה לעקוב אחריו. הוא גם כותב המון ומהר, אז קל מאוד לאבד אותו באמצע העתקה (אם אתם החלטתם להעתיק). גם אי אפשר להקשיב ולהעתיק בו זמנית אז אם כן החלטתם להעתיק אתם תמצאו את עצמכם חוזרים על כל מה שכתבתם אחרי השיעור (מניסיון). חובה גם להגיע להרצאות כי הוא משנה את החומר כל סמסטר (או שלפחות שהמקור שממנו תשיגו את המידע שלכם יהיה מבוסס על ההרצאות שלו). הוא גם שואל ספציפית על דברים שהוא לימד וצנזור לא.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: קצת זריזה אבל היא מוכנה להתעכב אם תתעקשו על זה. סה\"כ מסבירה די טוב ודי נחמדה.\n\nשעורי הבית: חלקם לא פשוטים אבל אם תגיעו למספיק שעות קבלה יהיה טוב.\n\nהמבחן: די קשה אבל מן הסתם זה גם אינפי, ולכן זה לא ברור אם יוחאי הוא הסיבה לכך שזה הרגיש קשה.\n\nהשורה התחתונה: בהצלחה.", "timestamp": 1603652713873}, {"author": "Roni", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מלמד בקצב מהיר מאוד, ממליץ לא לקחת הרבה קורסים באותו סמסטר אם הוא מלמד את החומר. הוא מוכן לענות לשאלות אבל הקצב כל כך מהיר שאי אפשר לדעת איזה שאלה לשאול קודם\n\nשם המתרגל/ת: יוליה \nחוות דעת - תרגולים: אחלה מתרגלת, מלמד בהספק וקצב גבוה אבל מסבירה טוב\n\nשעורי הבית: עמוסים, גיליון בשבוע והרמה קשה\n\nהמבחן: נקווה לטוב, סמסטר שעבר הוא היה הוגן\n\nהשורה התחתונה: קורס עמוס מאוד אם לוקחים אותו עם יוחאי,  הוא נשען על המון ידע קודם שלא בהכרח יש לסטודנטים והוא לא נדיב כשזה נוגע לקצב הגיליונות ובאופן כללי לבקשות הסטודנטים", "timestamp": 1612542991408}, {"author": "Tomer Bitan", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוחאי מעין\nחוות דעת - הרצאות: \nהסברים כצת מסורבלים\nשם המתרגל/ת: יוליה \nחוות דעת - תרגולים: \nעוברת מאוד מהר על החומר עם מעט הסבר יחסית\nשעורי הבית: גליון כל שבוע 4 שאלות בערך 5 שעות לגליון\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612628768361}, {"author": "ס", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: לדעתי ההרצאות היו מצוינות. לפעמים הוא קצת רץ, אבל העירו לו והוא ידע גם לקבל ביקורת בעניין הזה. תמיד היה מוכן לענות על שאלות בזמן ההרצאה או בהפסקה. הרבה אנשים יפחידו אתכם מיוחאי, אבל אני חושב שהוא מעביר את הקורס בצורה מעולה ואני ממש יצאתי עם תחושה שאני מבין את החומר. בסוף היה גם מבחן הוגן ממש.\n\nשם המתרגל/ת: יוליה קצוב\nחוות דעת - תרגולים: \nהספק מטורף, מנצלת כל שנייה בתרגול ורצה על ההסברים אז צריך לבוא מוכנים לתרגול.\n\nשעורי הבית: \nהיה גיליון של 4-5 שאלות כל שבוע. השקעה לא קטנה (תלוי כמה נעזרים באחרים כמובן). הייתי אומר השקעה ממוצעת של 4-6 שעות שבועיות בגיליון.\n\nהמבחן: \nהיה מבחן פייר לגמרי, חצי שאלות הוכחה פתוחות וחצי שאלות אמריקאיות אבל שבודקות הבנה ולא חישוב טכני. יותר קל משנים קודמות.\n\nהשורה התחתונה: \nקורס קשה אבל מעניין. אם אתם אוהבים מתמטיקה אתם תיהנו.", "timestamp": 1612946886777}, {"author": "koshi shwartz", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \n1.טס בהרצאה, נכנס לנקודות שלא מועילות להטמעה ולהבנה של החומר, בעיקר בהוכחות מסורבלות ומיותרות (לא כולן).\n2.על הנייר מעודד למידה פעילה, בפועל אחוז קטן מאוד עוקב אחריו במהלך ההרצאה, והוא ממשיך לטוס בגלל פידבק חיובי מ 2 סטודנטים באופן קבוע שעונים על השאלות שלו.\n3.כן עונה על השאלות כשיש זמן לזה, בעיקר בהפסקה בדרך כלל.\n4. כן הוריד את הקצב לקראת סוף הסמסטר.\n5. הוא כן עובד מסודר ומנסה לייצר אינטואיציה ועניין בחומר הנלמד אך זה לא תמיד עובד כי הוא באמת מהיר מאוד - תגיעו מוכנים להרצאות אחרת חבל על הזמן שלכם.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nשימו בצד את זה שהיא לא נחמדה לדעתי, היא יכלה למנוע לא פעם שאלות של סטודנטים אם הייתה טיפה מתאמצת מראש להסביר דברים שאינם טריוויאליים.\nעוברת על המון תרגילים ולא מתמקדת בעקרונות אלא בעיקר בפתירת תרגילים. צריך לפרש אותה ולדובב אותה כדי שתסביר מעברים שאינם טריוויאליים ועקרונות כלליים בגישה לפתירת התרגילים.\nלדעתי, היא כן המתרגלת הכי מקצועית באופן יחסי שהייתה לנו באינפי הסמסטר ולכן הלכתי אליה, אבל לצערי הידע הרב שלה לא בא לידי ביטוי ברובו עקב היכולת הלוקה בחסר שלה להעביר אותו.\n\nשעורי הבית:  כל שבוע גיליון של 4-5 שאלות לא פשוטות, דרש המון השקעה במהלך הסמסטר. לרוב הפתרון של הגיליונות עזר מאוד להבין ולהטמיע את החומר כמו שצריך.\nגם הוובוורק עזר מאוד להטמיע את החומר.\nאין פתרונות רשמיים לגיליונות וזה מקשה מאוד את הלמידה מהם.\n\nהמבחן: המבחן לא היה קשה ולא קל,  כן היה קל ביחס למבחני עבר של יוחאי, בסך הכל מבחן הוגן.\n\nהשורה התחתונה: החומר בקורס מעניין מאוד, עמוק ומאתגר, אם אתם לא מבינים את יוחאי בהרצאות אז תזכרו שתמיד אפשר לראות את צנזור ביוטיוב, לרוב הוא סוגר את כל הפינות בהבנה , בהצלחה :)", "timestamp": 1613337211388}, {"author": "YT", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nכמה דברים נאמרו עליו, אבל לדעתי לא צריך להקשיב לשמועות. הוא באמת מרצה בסדר גמור, מסביר את החומר כמו שצריך, עונה על שאלות כמו שצריך אחרי השיעור/בשעות קבלה.תמיד מנסה להתאים את עצמו ורואים שמאד אכפת לו. כן יש רגעים שמרגישים שהוא טס בחומר אבל אני חושב שהבעיה היא במי שכתב את סילבוס הקורס והחומר שדרוש מהמרצה להעביר בו. בקיצור, לבוא בראש פתוח. \n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: חכמה מאד וחדה מאד, יודעת להסביר הכל כמו שצריך. כן, לפעמים רצה אבל אם מעכבים אותה ושואלים היא חוזרת ומסבירה שוב. \n\nשעורי הבית: קשים מאד, 12 גיליונות שכל אחד מהם גוזל יום שלם ו12 וובוורקים שכל אחד גוזל חצי יום, אז לקחת בחשבון שזה קורס שיכול לקחת יותר מיומיים בשבוע.. \n\nהמבחן: לנו היה מבחן די בדיחה.. בכללי המבחנים בקורס לא קלים\n\nהשורה התחתונה: קורס קשה בצורה מחרידה והיקף החומר בו גם כן מחריד, פשוט לקוות לטוב ולהשקיע המון, זה משתלם.", "timestamp": 1613771004010}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יוחאי מעיין / מיכל קלרנשטיין\nחוות דעת - הרצאות: היה קצת בלאגן עם המקוון כי עשינו החלפה של מיכל ויוחאי כל הרצאה שנייה. אבל די אהבתי את דרך ההרצאה של יוחאי\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: תרגולים מצויינים, הכל גם מוקלד לכן אפשר לעבור על התרגילים והפתרנות בקלות לאחר מכן. מה שכן הוא מביא תרגילים מאוד קשים עם טריקים ומראה איך לפתור אותם אבל בתרגול לבד בדרך כלל לא הייתי מצליח לפתור והם היו ברמה מאוד גבוה.\n\nשעורי הבית: פעם בשבועיים גיליון לא קל אבל לא נורא.\n\nהמבחן: היה מקוון והיה יותר סבבה מסמסטרים קודמים. צריך ללמוד לא מעט אבל בסוף לא היה מאוד קשה.\n\nהשורה התחתונה: אני נהנתי", "timestamp": 1615983819797}, {"author": "איתי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: יוחאי\n\nיוחאי מרצה סולידי. יותר מסודר מצנזור ופחות נרקסיסיט.\nהוא יענה על כל שאלה שתשאלו אותו. הקאץ׳ הוא ששיעורי הבית הסמסטר קשיים. זה יכול להיות טוב כהכנה למבחן אבל תתכוננו ללשבור את הראש על הש״ב בכל שבוע. כמה דרגות מהרמה שמוצגת בכיתה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רבקה.\n\nגם כן מתרגלת סולידית. בוחרת תרגילים מאתגרים בקפידה כהכנה לשיעורי בית ולמבחן. מסבירה טוב. עונה על שאלות. מסודרת. סך הכל מרוצה.\n\nשעורי הבית: \nקשששיים. אבל מפתחים אם נלחמים ולא מוותרים לרוץ ישר לרפרנס.\n\nהמבחן: \nלא יודע מקווה שיהיה טוב. אבל יש מגן טוב מאוד כנראה אם עשיתם את כל הש״ב.\n\nהשורה התחתונה: \nקורס סבבה.", "timestamp": 1621068532845}, {"author": "Uriya Hubara", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות:  מרצה מדהימה, מסבירה את החומר בצורה ברורה ובקצב טוב, עונה על כל השאלות בסבלנות ובצורה נעימה.\n\nשם המתרגל/ת:  \nחוות דעת - תרגולים: \n\nשעורי הבית: יחסית קצרים, רמת קושי סבירה, עוזרים מאוד למבחן\n\nהמבחן: חשוב לזכור ולהבין את כל המשפטים טוב טוב ולדעת כל מיני טריקים לחישובי טורים ואינטגרלים\n\nהשורה התחתונה:  קורס מעניין, קצת יותר קל מאינפי 1מ והמגן גבוה מאוד (יכול להגיע עד 36%) אז חשוב מאוד לפתור את כל הגליונות והwebworks כי זה יכול להוסיף הרבה לציון הסופי", "timestamp": 1625935542950}, {"author": "Gilad Freidkin", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשה\n\nהשורה התחתונה: דורש השקעה רבה", "timestamp": 1626006985461}, {"author": "Bob Bobinson", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מיכל קליינשטיין\nחוות דעת - הרצאות: מרצה מעולה, שגם מסבירה את החומר טוב וגם באמת זוכרת ונותנת יחס אישי לתלמידים - דבר שלא ראיתי שמרצים אחרים בטכניון עושים. ממולצת מאוד.\n\nשם המתרגל/ת: גיא סלומון\nחוות דעת - תרגולים: מתרגל ממש טוב. מסביר את כל החומר שנלמד בהרצאות ומעבר לו, בוחר שאלות מאוד קשות שעוזרות אחר כך בשיעורי הבית ובמבחן ומעביר את התרגול בצורה חביבה עם בדיחות וסיפורים. ממולץ מאוד\n\nשעורי הבית: שיעורי הבית עמוסים ביותר - גיליון+webwork כל שבוע, כשהגיליון בדרך כלל קשה בהרבה מהתרגילים בהרצאות או התרגולים. כל גיליון הוא 2% מגן בפני עצמו, אז בהשוואה לקורסים אחרים שלא צריך להגיש את כולם, כאן כל אחד שמפספסים פוגע במגן. יש גם למידה עצמית בגיאומטריה שיכולה לקחת כמה שעות. אחד קורסי המתמטיקה הכי עמוסים מבחינת שיעורי בית.\n\nהמבחן: המבחן שונה בסמסטר האחרון ל-5 שאלות אמריקאיות ו-3 פתוחות. השאלות האמריקאיות גם כוללות לפעמים חישובים ארוכים, שטעות בהן יכולה להפיל את כל השאלה (8 נק'). יש כמות עצומה של חומר בקורס, אז מאוד קשה להתכונן אליו וכמעט בטוח תהיה שאלה שלא פגשתם משהו דומה לה בעבר.\n\nהשורה התחתונה: קורס מאוד עמוס במהלך הסמסטר והלמידה למבחן, לא מעניין במיוחד ועם המון חומר", "timestamp": 1626078367611}, {"author": "גלעד אל-דור", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: \nמרצה טוב, השלמתי מעט אינטואיציה מצנזור ביוטיוב.\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: תרגולים מעולים, מסבירה ברמה גבוהה, לעיתים לא מביאה את התרגילים המתאגרים באמת בתרגולים.\n\nשעורי הבית: \n12 גיליונות להגשה בערך כל שבוע, מאוד מאוד עמוס, וכל הגשה היא חובה ככה שזה כבד מאוד.\nהמבחן: \nהמבחן היה יחסית הוגן, 5 שאלות אמריקאיות ו3 שאלות פתוחות כששום דבר לא נחת מהירח.\nהשורה התחתונה: \nקורס שגוזל המון זמן מהסמסטר, אבל סך הכל היחס לסטודנטים הוגן לגמרי.", "timestamp": 1626100474265}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: ממש חמודה ומאוד מתאמצת להסביר באופן ברור ולהביא דברים מנקודת המבט שלה. קצת מבולגנת אבל לי זה לא מאוד הפריע. בסך הכל אחלה לדעתי, בעיקר אם רוצים ללמוד בכיתה קטנה יחסית.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: סופר מסודר, נותן תרגילים טובים ואינטואיציה טובה. מסביר מעולה. עם זאת הוא לא מספיק הרבה תרגילים, לפעמים השלמתי עוד קצת תרגילים מהתרגול של רבקה בנושאים שהרגשתי שהיה לי חסר. הוא גם קצת איטי (לטוב או לרע).\n\nשעורי הבית: קשים בטירוף. יוחאי הביא תרגילים שלפעמים לוקחים שעות ועמודים שלמים, אי אפשר בלי לרפרנס. לפעמים תרגילים אלגבריים או שצריך טריק אלגברי בשבילם ולא ברור לי מטרת התרגיל. לא הרגשתי שהם עזרו לי להבין את החומר לעומק יותר.\n\nהמבחן: קשה. אין לי מה להוסיף, זה מבחנים של יוחאי.\n\nהשורה התחתונה: קורס באמת מעניין אבל עמוס וקשוח. תרגילי בית לוקחים המון זמן, מבחן שאלא אם אתה הטופ של הכיתה, לא תצליח בו יותר מדי. קורס חובה אז אין יותר מדי מה לעשות.", "timestamp": 1626254071482}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: עם כל מה שאומרים עליו, הוא אמת מקצוען ומרצה מעולה\n\nשם המתרגל/ת: גיא סלומון\nחוות דעת - תרגולים: טיפה איטי, אבל מסביר בצורה מדהימה ומשתף את כולם, מתרגל זהב\n\nשעורי הבית: קשים אבל לא ארוכים בהגזמה, פעם בשבוע גיליון פתוח וwebwork\n\nהמבחן: קשה\n\nהשורה התחתונה: לא קורס לכיף", "timestamp": 1626356388579}, {"author": "...", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: אחלה מרצה, מסודר ויסודי. לא תמצאו אצלו הרבה אינטואיציה, הרבה דברים מרגישים לא קשורים, אבל בסך הכל אחלה מרצה.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מתרגלת טובה, מספיקה כמו שצריך, עונה ממש בכיף וביסודיות על שאלות\n\nשעורי הבית: קשים בדיוק כמו שהייתם מצפים שהם יהיו, אבל גם עושים סדר בחומר\n\nהמבחן: קשוח מאוד, הכמות חומר פסיכית אז אין סיכוי לכסות את כל הרעיונות והטריקים. החלק האמריקאי שהתווסף מצריך להיות מאוד טוב בחישובים.\n\nהשורה התחתונה: קורס קשה ומכביד, אבל יש בו רעיונות מעניינים", "timestamp": 1626376540820}, {"author": "~", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יוחאי מעין\nחוות דעת - הרצאות: \nיוחאי העביר את ההרצאות בצורה טובה ולא משעממת, היה קצת מבולגן אבל בסה\"כ היה מרצה טוב. יש לו גם סיכוי הרצאות שממש עזרו ללמידה למבחן.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: הכי אהבתי אותה מכל המתרגלים הסמסטר, קצת מהירה אבל ענתה על כל השאלות כל פעם ששאלתי, הציגה הרבה שאלות והסבירה באופן ברור.\n\nשעורי הבית: \nממש עמוסים, וחלקם בקושי פתירים. חבל שלא הביאו שאלות יותר נורמליות כדי באמת לתרגל את החומר ולא לשבור את הראש שעות ואז להעתיק מהרפרנס.\n\nהמבחן: מועד א - המבחן שלנו היה יותר קשה משאר המועדים לדעתי, אבל מההתכוננות למבחן נראה שאצל יוחאי לא עושים מועד ב.\n\nהשורה התחתונה: קורס עמוס מאוד, הוא נדחק קצת לצד בגלל מתמ בחלק מהפעמים, במבחנים של יוחאי הוא יותר טכני לעומת המבחנים של צנזור לדעתי. שורה תחתונה - קורס חובה, לא הכי מעניין והעיקר שהוא נגמר.", "timestamp": 1626702896832}, {"author": "אחד שיודע", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: יוחאי המרצה שאני הכי מכבד מבין כל המרצים שהיו לי עד עכשיו. הוא באמת תותח. הבן אדם עומד ומרצה שעתיים בלי דפים בכלל, ובאופן מאוד מסודר ומובן. תמיד יישמח לענות על שאלות ואף ייתעקש להסביר למישהו אם הוא לא הבין עד הסוף. יש לו סיכום הרצאות מעולה עם כל הדגשים.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: רבקה תותחית. אמנם קצת מהירה, אבל היא מביא תרגילים מעולים וקשים ממבחני עבר, וככה מכינה אותנו בצורה טובה. מי שקצת יותר איטי ומתקשה עם החומר לא ממליץ ללכת אליה. \n\nשעורי הבית: כל שבוע גיליון, לרוב עם 5 שאלות. היו שאלות סבבה אבל היו הרבה מאוד קשות. גליונות עמוסים. בנוסף יש גם webwork שהוא גם שבועי לרוב. תתכוננו להרבה עבודה, ותנסו לפתור כמה שיותר לבד, זה בונה את ההבנה.\n\nהמבחן: מועד א מאוד מאוד הוגן. שיחזר חלק מהשאלות ומי שפתר את המבחנים שלו והבין את הפתרון בצורה טובה, יכל להצליח. מועדי ב אצל יוחאי ידועים לשמצה, אז תשתדלו להצליח במועד א.\n\nהשורה התחתונה: קורס עמוס, ולאו דווקא יותר קל מאינפי 1. ברובו יש חישובים אבל עדיין יש הרבה תיאוריה. תשקיעו.", "timestamp": 1626710488212}, {"author": "Unknown", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  יוחאי מעיין\nחוות דעת - הרצאות: יוחאי מרצה מעולה בעיניי, הוא מסביר טוב, חוזר על מה שלא ברור ומתעקש שמי שלא הבין - יבין את הנושא עד הסוף. הוא מאוד נחמד ומנסה לעזור כמה שיכול (בשונה מאביב צנזור)\n\nשם המתרגל/ת: גיא סולומון\nחוות דעת - תרגולים: לדעתי מבזבז קצת יותר מדי זמן על הסברים וחזרה על החומר, מעבר לזה מסביר מעולה ומפשט את הדברים כמה שיותר\n\nשעורי הבית: גיליון כל שבוע, הגיליונות קשים בפער מהמבחן הסופי לדעתי. \n\nהמבחן: לא קל, אבל גם לא בלתי פתיר \n\nהשורה התחתונה: אפשר לקבל ציון טוב בקורס בגלל שיש 36% מגן שתקפים מכל ציון במבחן \nתשקיעו, 5 נקז שבאמת אפשר לקבל בהם אחלה ציון", "timestamp": 1626798243549}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מרצה מעולה, בגללו אהבתי את הקורס למרות הקושי.\n עונה על כל השאלות,נותן אינטואיציה בכל נושה ומעביר את החומר בצורה הכי טובה ויעילה שאפשר.\n\nשעורי הבית: 12 שיעורי בית כל אחד מגן 2%(לא תקף),כל שבוע מפרסמים אחד. חלק מהתרגילים קשה אבל פתיר,כדאי לעשות כל התרגילים ולהשקיע בהם,עוזרים בהבנת החומר.\nתרגילי ה webwork מהווים 10% מגן,לא קשים, יותר תכניים.\n\nהמבחן: מועד א היה סביר.\n\nהשורה התחתונה: קורס עמוס ולא קל, אבל ניתן לקבל ציון גבוה אם עושים כל תרגילי הבית וה webwork (ניתן לצבור 36% מגן)", "timestamp": 1626856884003}, {"author": "Ofer Nissim", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nיוחאי מרצה מצוין, מסביר כל נושא באופן ברור ומתעכב על הבנת הרעיונות המרכזיים של המשפטים וההגדרות, דואג להציג דוגמאות שימושיות וזמין תמיד לשאלות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nגיא מתרגל מעולה, שם דגש על הבנת החומר והמחשה מקיפה באמצעות דוגמאות. רבקה מומלצת עבור הכרת סוגים מגוונים של טכניקות ותרגילים בכל נושא. \n\nשעורי הבית: \nגיליונות הגשה מאתגרים וקשים ביחס לתרגולים,\nשווה להשקיע ולשבור קצת את הראש כדי להבין טוב יותר ולהשתפר בניסוח ההוכחות. שווה להשקיע ולהגיש הכל - מצבטר למגן משמעותי בציון הסופי.\n\nהמבחן: \nמבחן לא פשוט בכלל, אבל בהחלט משקף את הבנת החומר הנלמד ואת רמת הקורס, סך הכל הוגן (מועד א).\n\nהשורה התחתונה: \nקורס מומלץ ומעניין, דורש השקעה.", "timestamp": 1627106766416}, {"author": "--", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: מרצה מעולה, תמיד מנסה להסביר את הרלוונטיות של מה שאנחנו לומדים ולתת דוגמאות מהחיים לשימושים. יש לו נטייה לפעמים להתעכב על הוכחות ובגלל זה לקראת סוף הסמסטר היינו מעט בפיגור בחומר והוא הפסיק להוכיח דברים בכלל.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מתרגלת סבבה, מסבירה קצר ולעניין. בד\"כ יוליה טסה בחומר אבל אם למישהו יש שאלות היא תמיד תעצור לענות עליהן, אז לא לפחד לשאול.\n\nשעורי הבית: קשים. גיליון שבועי עם 4 שאלות בד\"כ ואין רפרנסים לכל השאלות, אבל מאוד חשוב לעשות אותם(חפשו בגוגל מה שאתם נתקעים בו) כי זאת חזרה מצויינת על החומר. השאלות ברמה של מבחנים ובנוסף זה נותן מגן רציני למבחן.\nיש גם WW שבועי שיותר פשוטים בד\"כ, בעיקר חישובים ופחות הוכחות. \n\nהמבחן: היה הוגן, אבל עדיין קשה. מי שמתכונן מספיק ועשה את כל הגיליונות והWW יעבור בלי בעיה. \n\nהשורה התחתונה: קורס מתמטי סופר עמוס, חייבים להיות עליו כל הסמסטר אחרת הולכים לאיבוד בחומר מהר מאוד.", "timestamp": 1627372050734}, {"author": "טל פאר", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: לא רואה ממטר את צנזור. הכי מסודר שתפגשו\n\nשם המתרגל/ת: גיא סולומון\nחוות דעת - תרגולים: אני מאוהבת הלוואי תעשה לי ילדים כבר\n\nשעורי הבית: קשים אך חשובים, להשתדל לרפרנס כמה שפחות\n\nהמבחן: הוגן, בגדול השמועה אומרת לעשות הכל כדי להצליח במועד א' של יוחאי. \n\nהשורה התחתונה: חובבי הז'אנר יהנו. ולמי שלא הצליח אף פעם לצייר תיבה בשאלון 807- שיהיה בהצלחה", "timestamp": 1627395249902}, {"author": "לי", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: אם יש לכם אופציה לבחור, אז מרצה מעולה. הרשימות שלו מצוינות\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: סך הכל בסדר, טיפה ממהרת אבל מובנת.\n\nשעורי הבית: קשים, אבל חשובים\n\nהמבחן: הוגן, קשה אבל פתיר\n\nהשורה התחתונה: חשוב להשקיע", "timestamp": 1627395408718}, {"author": "jlo", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: הרצאות של צנזור ביוטיוב\nחוות דעת - הרצאות: כשיוחאי אחראי הקורס, יאמרו לכם לא לראות את צנזור כי יוחאי מתמקד בכוונה בדברים שונים. אבל- אם תראו את צנזור ובמקביל תעברו על הסיכומים של יוחאי, אין סיבה שלא תצליחו. \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: אחלה מתרגלת, חמודה וברורה, דואגת שהכל יהיה מובן.\n\nשעורי הבית: קשים ועמוסים, אבל יש המון רפרנסים. כדאי לא להכחיש ולנסות לבד\n\nהמבחן: קשוח.\n\nהשורה התחתונה: אין סיבה לקחת את הקורס אם לא חייב. בכל אופן שווה להשקיע במהלך הסמסטר, כי קשה להינעל על החומר במהלך המבחנים.", "timestamp": 1627395766082}, {"author": "lb", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: -יוחאי מעיין\nחוות דעת - הרצאות:  מרצה ממש טוב, רואים שיישם לקחים מסמסטרים קודמים ודאג לחזור ולהסביר כשלא היה מובן (ואפילו קיצצו לנו כמה דברים מהחומר כנראה כתוצאה מכך), נותן אחלה דוגמאות ומסביר נפלא בשעת קבלה, אני אשמח ללכת לקורסים שהוא מעביר בעתיד. חשוב לציין שיש הרצאות ספציפיות שהייתי צריכה לצפות בהן פעמיים כדי שדברים ישקעו כמו שצריך.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים:  לדעתי יוליה מתרגלת מעולה, יש שיאמרו שהיא קצת ממהרת אבל היא כן עוצרת כשצריך, התרגילים שהיא נותנת ברמה גבוהה מאוד ולדעתי (כן, ניסיתי לצפות בוידאו של מתרגלים אחרים הסמסטר) ברמה הכי גבוהה, והיא מספיקה הרבה מהם. ברור לי שזה סטייל שלא מתאים לכולם, אבל לדעתי חשוב לנסות, כמו כן זה יתרון שהיא מתרגלת אחראית כי ללכת לשעת קבלה שלה אומר שהיא אשכרה יודעת איך לעזור בתרגילי הבית ואיזה שאלות יש בהם \n\nשעורי הבית: עמוס. מאוד! אני חושבת שעדיין יש פער רציני בין הרמה של תרגילי הבית לרמה של התרגולים, התרגולים נותנים דגש פרקטי בזמן שבשיעורי הבית יש דגש על הוכחות (וזה גם חלק שמן הסתם קשה יותר), לא לפחד להיעזר ברפרנס אחרי ששוברים את הראש. ה-WW קצת מעיקים אבל חשוב לעשות גם אותם כדי להשתפשף (אם כי גם אחרי אינפי 2מ אני לא בטוחה אם אני יודעת לפתור אינטגרלים). בקיצור, זה הקורס הכי עמוס שלקחתי הסמסטר במובן הזה, אבל כדאי להיפטר מהם כמה שיותר מוקדם ולא לדחות. בסוף המגן שלהם תורם (מאוד!) לציון הסופי אז חשוב לעשות הכל \n\nהמבחן: מבחן לא קל, אבל גם הוגן, לא הרגשתי צורך לשנן הוכחות מההרצאות וגם המבחן לא נכנס לדקויות כאלה, ההוכחה שקיבלנו לעשות היא מבין הפשוטות בקורס, חשוב פשוט לעבור על הרשימות של יוחאי טוב לפני המבחן. 40% היה אמריקאי ו-60% פתוח, כמו אינפי 1מ' כדאי לפתור הרבה מבחני עבר ולשמור את האחרונים לסוף כי הם באמת היו בסטייל שהכי דמה לסטייל של המבחן הסופי שהיה (ולהסתכל על המועד ב של חורף 2019 בעירבון מוגבל, כוחות שחורים היו מעורבים שם)\n\nהשורה התחתונה: קורס עמוס, קשה אבל לא בלתי אפשרי עם הרבה השקעה, אם הסתדרתם עם אינפי 1מ אין סיבה שלא תסתדרו איתו", "timestamp": 1627498089639}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: אחלה \n\nשעורי הבית: כל שבוע גליון\n\nהמבחן: אינפי\n\nהשורה התחתונה: חובה", "timestamp": 1627633322335}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: מיכל מדהימה. אכפת לה מאוד מההצלחה של הסטדונטים. טיפה מבולגנת אבל בסך הכל מעבירה את החומר באופן ברור. \n\nשם המתרגל/ת: גיא \nחוות דעת - תרגולים: מתרגל תותח! מסביר את החומר באופן ברור ומשקיע מאוד ברשימות שלו. במהלך התרגולים עונה על שאלות ומשתדל שכולם יבינו את התרגילים. \n\nשעורי הבית: השיעורי בית מהווים מגן למבחן אז מאוד מומלץ לעשות אותם. יש בסך הכל 12 תרגילי בית, והם לא קלים ודורשים עבודה.\n\nהמבחן: מבחן קשה, יוחאי לא מבין שכל שאלה אמריקאית היא שאלה גדולה (וכמו שאלה פתוחה) מפני עצמה. מרגיש שאין מספיק זמן לפתור את הכל. מזל שיש מגן גבוה. \n\nהשורה התחתונה: בקורס אפשר לצבור עד 36% מגן אז מאוד מומלץ לעשות את כל העבודות כדי לקבל מגן גבוה. המבחן קשה, כדאי מאוד לתרגל ממבחנים ולעבור על התרגולים כדי ללמוד את כל הטריקים.", "timestamp": 1627652871770}, {"author": "דורון", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: מעניין מאוד\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: רבקה עוברת על אמון תרגילים ממש מכינה למבחן\n\nשעורי הבית: לא כזה חשוב לפי דעתי ww לא עוזרים לפתור מבחנים ותרגילי בית קשים מידיי.\n\nהמבחן: המועד א פייר לפי דעתי\n\nהשורה התחתונה:", "timestamp": 1627902596365}, {"author": "אינפי 2 לא עושים פעמיים", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מעניינות יחסית, יוחאי ממש משתדל לשמור על איכות גבוהה של הרצאה. עדיין חסרה אינטואיציה בהעברת החומר אבל גם אין באמת אלטרנטיבות. החומר די קריטי לידע התיאורטי שצוברים בתואר.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מהירה כמעט כמו יוליה, אבל מסבירה טוב יותר. לשם שינוי זכרתי את מה שהיה בתרגול אחרי התרגול שזה סימן נהדר\n\nשעורי הבית: עמוסים, לפעמים יש שאלות בלתי פתירות. לא לוותר על הגשות כי לקראת סוף הסמסטר מפסיקים לבדוק אותם לעומק וכל טיפה של מגן קריטית בטירוף- ראו ערך \"המבחן\"\n\nהמבחן: או. זה הקאצ'. ליוחאי יש שיטה- לכוון את המבחן לממוצע 50 מינוס, אבל להבטיח מגן של 30%, ובצורה כזאת- לא צריך פקטור. תסתכלו על ההיסטוגרמות- זאת התפלגות פעמון כמעט מושלמת. הרוב נתקעים באיזור ה60-70 ומפחדים לנסות לשפר כי זה קורס קדם לכל דבר אפשרי.\nמועדי ב- נוראיים יותר, לא מומלץ לגשת.\n\nהשורה התחתונה: הרשע בהתגלמותו. בהצלחה", "timestamp": 1628008917236}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: אדם מדהים שרק רוצה שנבין ונהנה מהחומר כמוהו. ממש משתדלת לגרום לכולם לחוות את הקורס בצורה נחמדה ונעימה. ברמה המקצועית יש איזושהי בעיה עם ארגון ועקביות (במיוחד במעבר בין נושאים), אז הייתי ממליץ אולי לא לכתוב, ולעבור על איזה סיכום אחר כך כדי לסגור פינות ולוודא הבנה.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: פותרת בעיקר תרגילים שהשטן ויתר עליהם. מסבירה מעולה אבל הרבה הרגישו שהיא מהירה מדי בקצב. ממליץ לצפות בה במוקלט אם אפשר, ואם לא - אז להתעקש לשאול שאלות.\n\nשעורי הבית: די מסורבלים אבל אחלה מגן. ממליץ למי שעקשן בקורס הזה לא להילחם בהם. זה בזבוז טהור של זמן ועצבים, שגם ככה לא מלמד הרבה.\n\nהמבחן: ארוך מאוד.. דורש בעיקר עבודה טכנית עם השאלות האמריקאיות. חשוב ממש לתרגל לפני.\n\nהשורה התחתונה: מעניין בטירוף אבל מוציא את המיץ.", "timestamp": 1630240318440}, {"author": "Ziv Mor", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: אני נהנתי. לא לוקח את עצמו יותר מידי ברצינות, מסביר טוב, דואג שהמזגן יעבוד.\n\nשעורי הבית: גיליון כל שבוע. בכיף 6-8 שעות עבודה כ\"א.\n\nהמבחן: לא קל, המועד ב' תמיד קשה יותר אבל לא בהמון. המבחנים של צנזור מאוד שונים בגישה וברמת הקושי, לשים לב כשמתרגלים.", "timestamp": 1634114356880}, {"author": "Lotan Amit", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: היו טובות אבל בסוף במועד ב' עברתי לצנזור\n\nשם המתרגל/ת: גיא סלומון\nחוות דעת - תרגולים: מצוין, באמת תותח\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס נוראי ממליץ בחום", "timestamp": 1634668737183}, {"author": "SH", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מרצה ממש טוב. הרצאות מעניינות וקורס מהנה. יוחאי גם פרסם רשימות של ההרצאות שלו שהוא עדכן במהלך הסמסטר; הן היו נוחות מאוד (והכילו גם קצת חומר מעבר למי שהתעניין).\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת נהדרת. לגמרי מעבירה טוב את הטכניקה.\n\nשעורי הבית: עמוסים וקשים יותר מהמבחן אך חשובים: מסייעים רבות בפיתוח הבנה של החומר.\n\nהמבחן: קשה אך אפשרי.\n\nהשורה התחתונה: קורס מאוד מעניין ועמוס. מבחן לא קל.", "timestamp": 1635197816368}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: טובות, בסוף במועד ב' עשיתי את צנזור והעדפתי אבל גם יוחאי מצוין.\n\nשם המתרגל/ת: גיא סלומון\nחוות דעת - תרגולים: תותח, משקיע ממש ומסביר מאוד מובן\n\nשעורי הבית: \n\nהמבחן: מועד א' היה קשה קצת, מועד ב' היה יותר הוגן\n\nהשורה התחתונה: אין לכם יותר מדי בחירה אם לקחת את הקורס או לא אז....", "timestamp": 1638799693902}, {"author": "Adan", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מדהימה אבל קצת מהירה\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מביאה תרגילים טובים אבל לא מסבירה הכי טוב\n\nשעורי הבית: ברמה מתאימה לקורס 5 נקודות\n\nהמבחן: קשה ו מבלבל ו בטח מפתיע, אבל הוגן, זאתי בעייתי ו בעיית שאר הסטודנטים כי לא חשבנו שהחומר שלא דיברנו עליו יותר מ-10 דקות בהרצאות לא יבוא במבחן ו זה הפתיע אותנו הרבה, אבל היינו צריכים לחזור עליו בלמידה למבחן ו לא עשינו אז זאת בעייתנו ו המבחן היה הוגן\n\nהשורה התחתונה: קורס בסדרת צריך להשקיע לאורך כל הסמסטר ו לא רק שבוע לפני המבחן.", "timestamp": 1644575422945}, {"author": "Alon Eitan", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: ממש אחלה. היא מפרסמת סיכומים כתובים של ההרצאות לפני כל הרצאה ונשארת בהפסקות/אחרי הרצאות לענות על שאלות. ממש נחמדה בתוך ומחוץ להרצאות.\n\nשם המתרגל/ת: ניקה \nחוות דעת - תרגולים: סבבה. עונה על שאלות וצריך להיות ערניים בתרגולים שלה כי היא עושה טעויות מדי פעם\n\nשעורי הבית: די קשים אבל בשביל זה יש רפרנסים\n\nהמבחן: קשה וקצת מפתיע, יכולים לשאול על דברים שהזכירו פעם אחת אבל חוץ מזה שאלות הוגנות.\n\nהשורה התחתונה: קורס קשה אבל הצוות ממש מוכן לעזור", "timestamp": 1644867087126}, {"author": "catto", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן (אבל האמת היא שצנזור ביוטיוב)\nחוות דעת - הרצאות: כשמרצה מגלה שרוב הכיתה מעדיפה לראות הקלטות של מרצה אחר, עומדות בפניו 2 אופציות:\n1) להשתפר, ולנסות להנגיש את החומר בצורה ברורה/מעניינת יותר\n2) לכעוס על הסטודנטים שהעזו לא להגיע, להיעלב, ולהתנקם בהם במבחן\n\nלצערי מיכל בחרה באופציה השנייה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מסביר ברור ודואג לענות לכל השאלות\n\nשעורי הבית:  קשים מאוד, אבל חשובים להטמעה של החומר. לרוב קשים בקצת מהמבחן, שזה הכנה טובה\n\nהמבחן: לא אשקר, הפתיע אותי לראות כסעיף של 10 נקודות שאלה על נושא שדובר עליו 15 דקות בכיתה.\n\nהשורה התחתונה: קורס מאוד מעניין ובסיסי להמשך התואר. חבל שצנזור כבר לא מעביר אותו", "timestamp": 1645393921744}, {"author": "דודי דרבו", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: סה\"כ אחלה. יש פעמים שבהם הדברים נהיים קצת יותר מבולגנים, אז זה לא לכולם, ולפעמים הייתי רואה הקלטות של צנזור כדי לסגור את הפינה.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: תותח על. מסביר דברים בצורה ברורה, מסודר מאוד, אצלנו העלה את הסיכומי תרגולים למודל וזה נורא עזר, ובאופן כללי עזר מאוד לכל הסטודנטים שפנו אליו.\n\nשעורי הבית: הגיליונות קשים, לא בושה לרפרנס. לא שווה לשבור עליהם את הראש יותר מדי, מקסימום שעה לתרגיל, לא יותר מזה.\nיש גם וובוורקים, שהרמת קושי בהם משתנה, אבל סה\"כ פחות מאתגר מהגיליונות.\nסה\"כ היה לנו 25% מגן, די נחמד.\n\nהמבחן: המבחנים היו הוגנים (ניגשתי למועד א' וב'), אם כי היו דברים מעטים שנכנסו למבחן שבקושי דיברנו עליהם בהרצאה, והמבחנים היו קצת יותר יצירתיים לדעתי מהמבחנים שהיו אצל יוחאי.\nיש מלאאאאא חומר, לכן לדעתי צריך להתחיל ללמוד לפחות שבוע מראש, עם לא יותר, ושלא יהיו מבחנים אחרים שמפריעים ברקע, כלומר שבוע לפחות שלומדים רק אינפי (זאת הסיבה שנכשלתי במועד א'...)\n\nהשורה התחתונה: הקורס הרבה פחות תיאורטי מאינפי 1מ, כשרוב התאוריה היא בתחילת הקורס, כשלומדים על אינטגרביליות. שאר החומר הוא הרבה יותר טכני (לומדים משפטים,איך משתמשים בהם, וחוזר חלילה).\nבתור בן אדם שלא בדיוק התחבר לחומר של אינפי 1מ, אבל כן חשבתי שהחומר היה מעניין, התחברתי עוד פחות לחומר של אינפי 2מ, והדבר המרכזי שחשבתי עליו זה פשוט לסיים את הקורס.", "timestamp": 1646676370228}, {"author": "למדתי הכל מMIT", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: זאת הפעם הראשונה שמיכל היתה אחראית, לדעתי היא עשתה שינויים מיותרים בחומר ביחס למה שצנזור עושה בוידאו. למשל ניסוחים שונים של משפטים, שמות שונים למושגים ושינוי משמעותי בסדר של הלימוד.\nמיכל לא היתה בעד הקלטות למרות שהשיעור היה מועבר בזום. היא אהבה להתלונן על זה שלא באים להרצאות שלה וזה יצא על מי שניגש למועד א' (ראה ממוצע).\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מתרגל חריף. יודע לענות על שאלות במהירות אבל הרגשתי שהוא רץ עם החומר טיפה מהר מדי ושהשאלות שהוא הביא היו בדרך כלל מקרים מיוחדים.\nבכל זאת היתה חוויה טובה כי הכל מוקלט ואפשר היה לחזור ולראות.\nרן גם כותב רשימות והכל שם אבל לדעתי מאוד כבד לשבת ולקרוא אותם.\n\nשעורי הבית: מיותרים, פשוט חידות שצריך לפתור ולבזבז זמן. בדרך כלל אין קשר לשאלות שיהיו בבחינה.\n\nהמבחן: מועד א' לא ניגשתי כי ידעתי שהולך להיות בלאגן ואכן היו שאלות קשות בלי פקטור גדול.\nמועד ב' היה הוגן כנראה בגלל הפידבק שהצוות קיבל מהמועד הקודם.\n\nהשורה התחתונה: צנזור חוזר להיות מרצה אחראי אז הולך להיות כיף למי שייקח את הקורס מעכשיו.", "timestamp": 1647243174517}, {"author": "איניגו מונטויה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל מרצה מעולה. מאוד ברורה אבל גם רצה בחומר אז צריך להחזיק ראש בהרצאה. היא גם העלתה את רשימות ההרצאה שלה אז זה עזר ממש כדי לחזור על ההרצאות. \n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מתרגל מדהים! מסביר מעולה ונותן אינטואיציה שזה סופר חשוב. \n\nשעורי הבית: קשוחים, כל שבוע גיליון שלוקח מלא זמן. אבל בסופו של דבר כן מטמיעים את ההבנה של החומר. \n\nהמבחן: יחסית הוגן, החלק של השאלות אמריקאיות קשוח ממש. \n\nהשורה התחתונה: קורס לא קל שדורש השקעה, אבל ממש אפשרי להצליח בו", "timestamp": 1647421907731}, {"author": "קושי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל היא אדם מדהים (!) ומרצה מאודדדד אכפתית.היא מעניקה יחס אישי לכל סטודנט (אפילו זוכרת את השמות שלנו!! איפה עוד תמצאו מרצה כזו???) ומאוד חשוב לה ש*כל* סטודנט יבין את החומר. גם רואים שהיא מבינה את החומר בצורה עמוקה, בלי צורך לשנן דברים, והיא גם יודעת להעביר את זה לסטודנטים. כשהיא עושה את זה. כי הבעיה העיקרית עם מיכל היא שלפעמים היא ממש רצה על החומר. לדעתי זה קורה בגלל שהיא מתעקשת להוכיח כל משפט, גם כאלה שההוכחות שלהם מאוד ארוכות לא משתמשים בהם כמעט בהמשך הקורס (למשל נוסחת הסכימה של אבל) ואז מה שקורה זה שיש לה פחות זמן לעבור על החלק העיקרי של הקורס = פחות זמן להסביר את הדברים המהותיים. \nהיא גם שינתה קצת את הסדר של החומר, למשל בפונקציות שני משתנים היא התחילה קודם מרציפות ואז עברה לגבולות, וזה סתם בלבל לפי דעתי. \n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: תותח על מהחלל. מתרגל אש מגיל שש. \nמתרגל מושלם. מסביר מעולה את החומר, עונה על שאלות ומשקיע הרבהההה מעבר למה שהוא צריך. הוא העלה למודל חוברת סיכומים של התרגולים שלו עם הסברים ממש מפורטים, הקליט את כל התרגולים ענה במייל לשאלות ששלחו לו (למרות שחפרו לו הרבה), העביר את שעות הקבלה הכי מועילות ובכללי תמיד מוכן לעזור. גם בתחילת כל תרגול הוא עשה חזרה קצרה על ההגדרות והמשפטים שנלמדו בהרצאה וזה ממש עזר. הרבה פעמים דברים שלא הבנתי בהרצאה התבהרו לי בתרגול. \nהבעיה בתרגולים היו התרגילים עצמם. הרבה פעמים הרגיש לי שהם לא באמת בודקים הבנה של החומר אלא היכרות עם איזשהו טריק חישובי או פונקציית עזר מאוד ספציפית. כאילו תרגילים מאוד נישתיים. ואני חושב שהיה עדיף אם למשל היינו מתרגלים יותר שלילה של תכונות, כמו אינטגרביליות או התכנסות במידה שווה. \n\nשעורי הבית: קשים. יותר מהמבחן. רן לפחות הקפיד לעשות בתרגולים שלו גם תרגילים שקשורים לאלו שיש בגיליונות. אז ההמלצה שלי היא לא לקחת אותם ברצינות רבה מדי. לא להתבאס אם לא מצליחים ולא להילחם בהם יותר מדי. \n\nהמבחן: הוגן יחסית. אז נכון שבמועד א' הייתה שאלה אחת קשה יותר מבדרך כלל, ונכון גם שהייתה עוד שאלה על משהו שמיכל דיברה עליו רק דקה אחת בהרצאה - אבל היא נתנה קווים כלליים להוכחה בדקה הזו, ולמי שהבין את החומר זה לא היה מסובך מדי. מועד ב' היה הרבה יותר קל, ובגלל זה אף אחד לא התלונן. \nמה שכן לפי דעתי הגיע הזמן להוריד את השאלות האמריקאיות. זה די מבאס שאתה יכול לדעת  80% מדרך הפתרון אבל להגיע לתשובה לא נכונה בגלל טעות בחישוב או שאתה נתקע בשלב האחרון ובסוף אתה לא מקבל אפילו נקודה אחת :(\n\nהשורה התחתונה: קורס הרבה יותר עמוס וקשה מאינפי1 . תהנו.", "timestamp": 1647777719620}, {"author": "אורגו", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: סבבה סהכ\n\nשם המתרגל/ת: רן\nחוות דעת - תרגולים: עשה לי את הקורס, פשוט תותח על\n\nשעורי הבית: כמו אינפי 1\n\nהמבחן: זוועה, החלק הפתוח על טופולוגיה שבקושי לומדים, החלק האמריקאי זוועה גם כן לא ניגשתי למועד ב והוא היה עם ממוצע וחציון 10 נקודות מעל\n\nהשורה התחתונה:", "timestamp": 1647802810377}, {"author": "כריס", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: הרצאות מוקלטות נהדרות. מומלצות מאוד\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מדהימה, יודעת להספיק כמה שיותר תרגילים ברמה הכי גבוהה בלי לאבד את הכיתה \n\nשעורי הבית: לפעמים קשים אבל פתירים בהחלט ומאוד שווים את הסיפוק\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: אחלה קורס. להשקיע ולהילחם כמה שאפשר במבחן עצמו", "timestamp": 1657537347737}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nמרצה שיודע להעביר את האינטואציה ואיך לחשוב על להוכיח דברים, אבל בעניין הפורמליות של הוכחות והגדרות הוא כמעט ולא נותן הגדרות פורמליות אפילו לא בהרצאה , לכן ממליץ להעזר בספר של רון רוזנטל על מנת להסתכל על הגדרות פורמליות ואיך באמת כותבים הוכחה, כי על זה בסוף נבחנים\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: יוליה מתרגלת מעולה, היא עושה תרגילים קשים שמכינים בצורה טובה למבחן. היא ממש רצה על החומר , ולכן אם לא הבנתם משהו אתם עלולים לאבד אותה.\nהמלצה שלי , אם לא הבנתם לגמרי תרגיל שהיא פותרת , תסמנו מה לא הבנתם ותשאלו בהפסקה.\nבאופן כללי היא עוצרת בשביל לענות.\n\nשעורי הבית: 12 גיליונות , לוקחים זמן ומתישים.\nלפעמים יש שאלות קשות יותר וקשות פחות , באופן כללי לקח לי די הרבה זמן לפתור אותם.\nנראה לי מספיק להקדיש גג שעה - שעתיים על שאלה , ומה שלא מבינים לשאול או להסתכל ברפרנס\n \n\nהמבחן: \nהמבחן היה הוגן לפי דעתי , מבחינת רמת השאלות, אבל לא היה תקין.\nהייתה בעיה באחת מהשאלות בתשובות שהיא לא הופיעה בפתרון , ואז חלק גדול מהסטודנטים  ניסו להבין אפה הם טעו .\nרק אחרי שעה מהמבחן הם הגיעו והוסיפו 2 פתרונות על הלוח שזה גם היה בעיה, כי היו טורים שונים ולפי מה שהבנתי זה בלבל את מי שהתשובות שהן הוסיפו לא היו נכונות בשבילהם.\n\nהשורה התחתונה: \nממליץ להתכונן למבחן בצורה הבאה:\n1. לאורך הסמסטר להיות על ההגדרות והמשפטים ולוודא שמבינים את כולם ויודעים לנסח אותם\n2. לפתור מבחנים , להקדיש יום יומיים על מבחנים שלמים , ואז לראות אפה אתם הכי הרבה טועים , לי ספיצפית זה היה שאלות אמריקאות ולכן השקעתי יום נוסף בפתרון רק שאלות אמריקאיות\n3.לשנן הוכחות של משפטים טענות ואת כל התרגילים מהגיליון.\n\nבגדול קורס קשה\nבהצלחה", "timestamp": 1657539046448}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: כמו באינפי 1 גם פה צנזור מרצה נהדר. חד על החומר ויודע להעביר אותו בצורה ברורה וגם באופן כללי כיף להיות בהרצאות הפרונטליות שלו. אם הוא מעביר את הקורס כשאתם לוקחים אז ככל הנראה שההרצאות וההקלטות שיש ביוטיוב יהיו כמעט חופפים אז מי שמעדיף לראות מוקלט גם זאת אופציה. הוא באמת מרצה מעולה.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: יוליה מתרגלת מעולה. גם היא ממש חדה על החומר ופותרת תרגילים ברמה מאוד גבוהה. הסגנון שלה הוא יותר להתעמק בהיגיון ובלוגיקה של התרגיל והיא פחות מבזבזת את הזמן על חישובים ומעברים שכל מי שעבר אינפי 1 אמור להכיר, ולכן היא מספיקה הרבה תרגילים וגם פותרת תרגילים ברמה מאוד גבוהה. הקצב שלה מהיר מאוד ולא כולם יתחברו אבל למי שזה מתאים לו באמת שהיא מתרגלת נהדרת שגם יודעת לתת כלים ואינטואיציה להבין את החומר.\n\nשעורי הבית: יש גיליון כל שבוע. כמו באינפי 1 הרמה היא מעבר לרמת המבחן למרות שהיו גיליונות קלים יותר ופחות. הסמסטר אצלנו הם היו להגשה והם מכינים טוב למבחנים. יש פה ושם שאלות קצת לא פתירות אז לא להתבאס מזה ואם לא מצליחים שעה-שעתיים אז אפשר לנסות להבין את הרפרנס או לשאול אנשים, אבל בכללי חשוב מאוד לעשות אותם. יש גם וובוורקים שמקנים 5% מגן.\n\nהמבחן: אצלנו היה מבחן הוגן. היה שאלות פתירות אבל לא קלות מדי והיה נדרש שליטה טובה בהגדרות ובדקויות של החומר בשביל לפתור אבל זה לא היה בלתי אפשרי. כן הייתה להם פשלה עם אחת השאלות האמריקאיות אבל אני לא חושב שזה חירב את המבחן או משהו, סה\"כ היה הוגן וכמו שצריך להיות. ממליץ כשלומדים לתרגל גם הוכחות אבל גם טכניקה. בסוף זה אולי קורס תיאורטי אבל מצפים ממי שלוקח אותו להיות מסוגל לחשב דברים מורכבים כמו אינטגרלים כאלה ואחרים או נגזרות וכו', אז חשוב לא להזניח את זה.\n\nהשורה התחתונה: מי שהסתדר באינפי 1 לדעתי יסתדר גם פה. הקורס קשה ודורש הרבה השקעה אבל בהחלט אפשר לעבור את זה.", "timestamp": 1657543421141}, {"author": "פריאל חזן", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nצנזור\nחוות דעת - הרצאות: \nלראות מוקלט זה אותו חומר\n\nשם המתרגל/ת: טל בן יהודה\nטל בן יהודה תותח מסביר כמו שצריך\n\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657548828693}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אביב צנזור מוקלט\nחוות דעת - הרצאות: \nהמוקלטים כמעט זהים לפרונטלי, בפרונטלי הייתה הגדרה אחת שהוא ניסוח קצת שונה וכמה הוכחות שאין במוקלט אבל לא הבדל דרמטי. \n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nבאופן אישי מאוד נהנתי ללמוד עם רבקה, אכפת לה מהסטודנטים, יש לה הרבה הומור (מגלים עם הזמן) ובכללי יש איתה אווירה נעימה. היא מאוד מאוד מהירה, אבל תעצור ותענה על כל השאלות שתשאלו אותה.\nמבחינה מקצועית רבקה תותחית, היא מתרגלת שנים ויש לה שיטות שעובדות, טיפים טובים, והמון דוגמאות טובות. היא מביאה תמיד תרגילים מאתגרים (רמת מבחן/גיליונות) ואין אצלה בתרגול דקה מבוזבזת. צריך לקחת בחשבון שאם הולכים לרבקה צריך להיות תמיד 100% על החומר, היא לא מהמתרגלים שבתחילת כל תרגול חוזרים על החומר ומסבירים אותו שוב אלא מתמקדת בפתירת תרגילים (והרבה מהם).\n\nשעורי הבית: \nיש גיליונות קשים יותר ויש קשים פחות. בגדול לדעתי בקורס הזה הגיליונות יותר רלוונטים בהשוואה לאינפי 1 אבל גם פה תתקלו בתרגילים הזויים ולא פתירים מידיי פעם. חשוב לציין שבסמסטר שלנו היה צריך להגיש 9 גיליונות כדי שתהיה אפשרות תקבל אחוזי מגן על שאלת שיעורי הבית במבחן.\n\nהמבחן: \nלדעתי החלק הפתוח היה הוגן יחסית והזכיר מבחנים של צנזור מ2017-18. היו גם שאלות אמריקאיות שהזכירו את האמריקאיות של יוחאי מעיין (הן לא היו בסגנון של שאלות צנזור קלאסיות).\n\nהשורה התחתונה: \nאם רוצים ציון גבוה חייב להשקיע בקורס לאורך כל הסמסטר. הקורס הרבה יותר עמוס מאינפי 1, יש הרבה יותר משפטים, המשפטים ארוכים יותר, ההוכחות מסובכות יותר ויש נושאים שלוקח זמן לעכל. בנוסף להוכחות, באינפי 2 מצפים מכם גם לדעת לחשב לא מעט דברים כמו אינטגרלים מורכבים ונגזרות מגעילות במיוחד אז מי שקשה לו עם חישובים צריך לעבוד על זה.", "timestamp": 1657554237014}, {"author": "Meowster", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: הרצאות מעניינות, בגדול קורס מעניין וכיף. רק קצת עצוב לי שבניגוד לאינפי 1 לא מוכיחים הכל, אלא סתם זורקים לפעמים משפטים באוויר ומשתמשים בהם ללא הוכחה.\nאבל אני יכול להבין כי בכל זאת יש הרבה יותר חומר מאינפי 1, ובניגוד לאינפי 1 יש חלק מאוד חישובי וטכני שאין באינפי 1, הקטע של 'וואו אני יכול לחשב את הדבר הזה!' מוסיף לכיף של הקורס.\n\nשם המתרגלת: יוליה פייגין\nחוות דעת - תרגולים: הייתי ב2 התרגולים הראשונים, הייתה אווירה קלילה, טובה וכיפית. לפי דעתי מתרגל טוב צריך לדעת ללמד גם בהומור, ויוליה לגמרי יודעת לעשות את זה. אפשר לראות שיוליה שולטת בחומר ובטכניקה וגם נהנת מהנושא. אני מרגיש שמי שרואה את ההקלטות של צנזור יכול לוותר על התרגולים מכיוון שהוא מראה המון דוגמאות לאורך ההרצאות.\n\nשעורי הבית: לרוב 3-4 שאלות קצרות שבודקות הבנה בסיסית של לכתוב הוכחות קצרות או קצת עבודה טכנית.\n\nהמבחן: המבחן היה הוגן. השאלות הפתוחות בדקו הבנה והכרה של המשפטים, רק קצת חבל העניין שהוסיפו תשובות לשאלה האמריקאית. אני הייתי בטור שהוספת התשובות לא הייתה רלוונטית לו, אבל בגלל שהוסיפו תשובות התבלבלתי וכבר לא היה לי בטחון בתשובה שלי (כי למה שיוסיפו 2 תשובות לא נכונות לשאלה אמריקאית עם כבר 5 תשובות) ולאחר טעות חישוב שבמקרה יצא לי משהו בתשובות החדשות, עברתי אל זה ואני מרגיש שזה קצת דפק.\n\nהשורה התחתונה: קורס כיף, ממש נהנתי בו, אולי אפילו יותר מאינפי 1.", "timestamp": 1657558055271}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הבחור אגדה וכל מילה נוספת מיותרת. תקוו שילמד את הקורס כשאתם לוקחים אותו.\n\nשם המתרגל/ת: יוליה פייגין + המוקלדים של טל בן יהודה.\nחוות דעת - תרגולים: יוליה מתרגלת מעולה. שולטת ברמה גבוהה בחומר ומעבירה את התרגולים בקלילות. במקום להתעכב על כל הניואנסים המיותרים שכל מי שעבר אינפי 1 אמור להכיר היא מתמקדת בתכלס של התרגילים ולכן גם הקצב מהיר, וזה טוב למי שמתחבר לזה. בנוסף היא גם פותרת תרגילים ברמת מבחן ויודעת לתת כלים וטיפים איך להבין את החומר יותר טוב לעומק.\nבנוסף צריך לציין את הסיכומים של טל בן יהודה. סיכומים מפורטים על המשפטים ועל הנוסחאות שלומדים וזה ממש עושה סדר ועוזר לקרוא את זה כשחוזרים על החומר.\n\nשעורי הבית: היו 12 גיליונות. חלק מהשאלות ברמת מבחן וחלק ברמה מעבר. סהכ חשוב ממש לעשות, גם כי יש שאלת ש\"ב במבחן וגם כי אם לא עושים אז אין סיכוי באמת להצליח לעמוד בקצב של הקורס ובאמת להגיע למבחן מוכנים. זה ממש חשוב (אצלנו הם גם היו להגשה עם ציון בינארי).\n\nהמבחן: היה מבחן הוגן מאוד לדעתי. החלק של השאלות הפתוחות היה הוכחות שקשורות להגדרות ולמשפטים והיה צריך לשלוט טוב בהם כדי להצליח לפתור אבל סהכ לא היו שאלות לא פתירות ולא היו טריקים הזויים סטייל אינפי 1, אלא הרבה יותר מתמקד בהבנת התיאוריה מאחורי החומר.\nהחלק של האמריקאיות גם כלל הבנה של תיאוריה אבל היה יותר חישובי והיו נגזרות כפולות ואינטגרלים כפולים די מסובכים. כשלומדים למבחן ממש חשוב לתרגל את זה כי בסוף זה עניין שהוא טכני וחבל סתם לאבד על זה נקודות.\n\nהשורה התחתונה: זה קורס עמוס, יש בו יותר חומר מאינפי 1 והחומר יותר מורכב אבל בגלל שבאים אליו אחרי קורס אינפי כבר יודעים לעכל את מה שהולך שם יותר טוב. זה תלוי במי המרצה אבל החומר אפילו יכול להיות מעניין. צריך ממש להשקיע כל הסמסטר כדי להצליח במבחן אבל זה באמת אפשרי, בין אם הצלחתם באינפי 1 או שלא.", "timestamp": 1657565533579}, {"author": "ש", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אותה רמה כמו אינפי 1. ראיתי את כל ההרצאות המוקלטות וגם הלכתי פרונטלית ויש הבדלים קטנים. יש חומר שהוא החליט להעביר לתרגולים מההרצאות כדי לחסוך זמן (ההקלטות הראשונות) ולפעמים הוא שינה את הסדר שבו הוא מעביר את החומר. בסך הכל למרות ההבדלים האלה אפשר לראות רק את ההקלטות ולא ללכת פרונטלי. \n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: אם חשוב לכם להיות בכתה קטנה, להיות מסוגלים לשאול שאלות ולהרגיש שהמתרגל מעביר לכם את החומר ולא לעצמו, תלכו למתרגלים אחרים. באופן כללי בתרגולים היו מוצגות בעיקר שאלות חישוב.\n\nשעורי הבית: 12 גליונות, מתוכם צריך להגיש 9 (בניגוד לאינפי 1 ששמה הגליונות לא היו להגשה, לפחות אצלי). הרמה בהם גבוהה מהמבחן בדרך כלל, לפעמים יש שאלות שלקוחות ישירות ממבחנים. בשיעורי הבית יש בעיקר שאלות הוכחה.\n\nהמבחן: לנו היה הוגן. 5 שאלות אמריקאיות, 3 שאלות פתוחות.\nהשאלות האמריקאיות הן שאלות חישוביות, והשאלות הפתוחות הן שאלות כמו אינפי1: הוכחה/הפרכה, ציטוט משפט/הגדרה והוכחת משפטים. אין דף נוסחאות או מחשבון.\n\nהשורה התחתונה: קורס הרבה פחות טוב מאינפי 1 לדעתי. הקורס שם דגש כבד יותר על חישובים וזה דבר שאני אישית לא אוהב. יש הרבה יותר דברים שפשוט צריך לשנן כמו מבחני התכנסות ושיטות לפתירת אינטגרלים. כמות הדברים שצריך פשוט לזכור היא הרבה יותר גדולה מאינפי 1 לדעתי.", "timestamp": 1657640176614}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: פשוט מצוין כמו שכבר נאמר עליו אינספור פעמים. יש לו הבנה עמוקה של החומר והוא מסוגל להעביר אינטואיציה במהלך ההרצאות בצורה יוצאת דופן, שעוזרת לפתח הבנה, וזה חשוב במיוחד בחלק השני של בקורס. הייתי בזום ובפרונטלי לסירוגין לאורך הסמסטר ונהניתי מאוד. \n\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: אני באופן אישי נהניתי בתרגולים של מיכל, היא יכולה להיות מבולגנת לפעמים ואולי להתעכב מידי פעם בגלל זה אבל בסך הכל היא אחלה מתרגלת, היא תמיד עונה על השאלות ומנסה לשתף את הסטודנטים כמה שאפשר, אפילו אלה שבזום, ויש אווירה טובה בתרגולים שלה. בנוסף התרגולים שלה די ריקים אז זה מרגיש כמו שיעור פרטי בקבוצה קטנה יותר מאשר תרגול.\n\nשעורי הבית: לא הכי פשוטים אבל בהחלט פתירים. הם לא הכי עמוסים אבל דורשים כמה שעות טובות של עבודה כל שבוע. אצלנו היה צריך להגיש 9 גיליונות מתוך 12 כדי לקבל מגן וזה לא היה כזה נורא (במיוחד בהשוואה לקורסים אחרים הסמסטר). מה שכן, לדעתי חשוב להיות עם היד על הדופק ולוודא שמצליחים גם גליונות שלא פותרים עד הסוף, כי הם עוזרים לעכל את החומר ולהתכונן למבחן.\n\nהמבחן: היה מאוד הוגן, במיוחד בהשוואה למבחנים קודמים כמו אלו של יוחאי. הייתה להם פשלה באחת השאלות האמריקאיות אבל הם עלו ותיקנו שעה מתחילת המבחן. בסך הכל השאלות האמריקאיות היו סבבה, אבל דרשו המון חישובים ולכן חשוב לפתור לאט ולבדוק כל צעד. השאלות של ההוכחות היו ממש סבבה, סטייל אינפי 1, כוללות ציטוטים של משפטים והגדרות והוכחות סטנדרטיות.\n\nהשורה התחתונה: אני נהניתי בקורס לאורך הסמסטר, מרגיש שהצוות אכפתי ורוצה לעזור לסטודנטים להצליח. כמובן שחייבת להיות משמעת עצמית וצריך לתרגל לאורך הסמסטר כדי להצליח במבחן, אבל זה ממש לא בלתי אפשרי. מה שכן הקורס הרבה יותר עמוס מאינפי 1, יש הרבה יותר חומר וצריך לא רק לדעת לכתוב הוכחות אלא לדעת טכניקה לפתרון של דברים מסובכים כמו אינטגרלים או נגזרות מגעילות. אבל בסך הכל, קורס מעניין וכיפי.", "timestamp": 1657708104674}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אישית מעדיף את ההרצאות הפרונטליות, אבל הן בול אותו דבר כמו המוקלט אז כל אחד יכול לעשות לפי איך שהוא מעדיף\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: מתרגלת יחסית טובה, מרגיש שהתרגילים שעוברים בתרגול אבל הם ברמה יחסית נמוכה ביחס למה שיופיע במבחן\n\nשעורי הבית: שאלות יותר קשות ממה שיש במבחן לרוב, אם נתקעים שווה לחפש רפרנס ולא לבזבז זמן\n\nהמבחן: הוגן, צנזור שואל על מה שהוא שם דגש בהרצאה ומאוד שמים לב לזה\n\nהשורה התחתונה: קורס מעניין אבל לא בהכרח קשור יותר מדי למדמח... בכל מקרה זה חובה", "timestamp": 1658061002849}, {"author": "ש", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nצפיתי במוקלט שלו והיה סבבה\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nמתרגלת מעולה מכסה ברבה סוגים של שאלות מאוד ממליץ\nשעורי הבית: \nהגשה לא חובה אך מי שמגיש 9 יכול לקבל מגן באחת השאלות במבחן\nהמבחן: \nהשאלות הפתוחות היו מאוד הוגנות האמריקאיות דרשו קצת עבודה אבל בכללי יצא סבבה\nהשורה התחתונה:", "timestamp": 1658066029546}, {"author": "לא יודע מה זה רלוונטי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור בהקלטות (ובמבחן)\nחוות דעת - הרצאות: מסביר את החומר ברור וטוב.\n\nשם המתרגל/ת: יוליה פיגין-קצוב\nחוות דעת - תרגולים: מתרגלת מעולה. עובדת בקצב קצת מהיר אבל בעייני העבירה את החומר ברור. הייתה המתרגלת האחרית לכן תמיד הסבירה דברים רלוונטים כלליים לקורס (הקשר לשיעורי בית, דברים על המבחן) מה שהיה מוצלח בעייני.\n\nשעורי הבית:  נראה לי לקחו לי סהכ פחות מאינפי 1מ, אבל אני לא בטוח.\n\nהמבחן:  אצלנו היה מחבחן יחסית הוגן אבל זו בחינה קשה, לקח הרבה מאד תרגול להגיע לרמה סבירה.\n\nהשורה התחתונה:  קורס לא קל אבל מה תעשו.", "timestamp": 1658174024292}, {"author": "ירוק עולה", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nעניין של טעם וריח, אני לא אהבתי בכלל. הוא מרצה טוב כל עוד לא פונים אליו, אבל רבים ספגו ממנו אש על שאלות (לגיטימיות לדעתי) בכיתה. מכיר הרבה חברים שהלכו להרצאות של מיכל קליינרשטיין רק כדי לא להיכנס לכיתה שלו. \nמבחינת מקום בהרצאות זה לא כמו באינפי 1מ' שצריך להגיע מוקדם כדי לתפוס מקום נורמלי, אפשר להגיע שלוש דקות לתחילת ההרצאה ועדיין לשבת איפה שתרצו.\nכנראה שמי שהיה מדבר איתי במציאות על אביב היה שומע דעה גסה הרבה יותר ממה שכתבתי כאן שמלאה באיחולים וברכות לנדון, לפחות ביוטיוב הוא נחמד.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל מתמקד מאוד במתן שיטות אינטואיטיביות לפתרון תרגילים, מה שבא לפעמים על כמות התרגילים הנפתרים בתרגול. הוא מספק סיכומים מושקעים מ-א-ו-ד, הם דורשים קצת עריכה \n והגהה אבל הם לחלוטין יכולים להחליף את הצורך לסכם בהרצאות.\n\nשעורי הבית: \nיש גיליון שבועי, כדי לקבל מגן צריך להגיש 9 מתוך 12. אין רפרנסים זמינים (חוץ משל עמיתים לכיתה) כי כל סמסטר הם כותבים את הגיליונות מחדש וזה סיוט לחפש בגיליונות ישנים אם בכלל השאלה נמצאת שם. יחד עם ה-WebWork מקבלים שיעורי בית יחסית עמוסים. ממליץ לעשות את ה-WW טוב טוב בגלל הנקודה להלן (שאלות אמריקאיות במבחן).\n\nהמבחן: \nקשה מאוד, הסמסטר שמו דגש ענק על השאלות האמריקאיות, שלא ניתן לפסול תשובות בהן - ממליץ לכל הניגשים לתרגל טוב מאוד את השאלות מהסגנון הזה. בנוגע לשאלות הפתוחות, אחת מהן (כ-10 נקודות) היא שאלת שיעורי בית. בנוגע ליתר, מי שהצליח את האמריקאיות כנראה יקבל ציון יפה בקורס, סומך עליכם שתסתדרו.\n\nהשורה התחתונה: \nאיזו ברירה יש לכם חוץ מלקחת את הקורס הזה?", "timestamp": 1658248188313}, {"author": "BaronCabbage", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: צנזור (הקלטות)\nחוות דעת - הרצאות: הקלטות של צנזור זה קלאסי\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: אחלה מתרגלת, מתמצתת את החומר הרלוונטי ועושה הרבה תרגילים בקצב מהיר\n\nשעורי הבית: גיליונות שבועיים, לוקחים בערך 4 שעות הממוצע כל אחד, וובוורקים קלילים שנותנים מגן וכל מיני שטויות של צנזור שנותנים עוד מגן\n\nהמבחן: היה סה\"כ מבחן הוגן, שאלות לא מונפצות מידי, האמריקאיות מאתגרות מטבען אבל היו דיי לקוחות ממבחנים ישנים. סהכ מי שמתרגל מספיק מבחנים של המרצה שכותב את המבחן מצליח.\n\nהשורה התחתונה: הקורס זה באמת המשך ישיר של אינפי 1מ ומעבר לזה שהוא מעט יותר טכני הוא לא שונה מקודמו בכמעט כל המובנים. הסגל מעולה ומתפקד מצויין.", "timestamp": 1658386705711}, {"author": "ניצן חיים ליסטמן", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מרצה מעולה, להרצאות המאוחרות הגעתי פרונטלית ובמוקדמות הצטרפתי מהזום. מאוד נהנתי הוא מעביר את החומר בצורה ממש טובה.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים:  היו בשעות מוקדמות אז ראיתי מהזום. טל מתרגל מאוד לאט ומקפיד לעבור על החומר לפני שהוא מתחיל לפתור תרגילים, לפעמים זה חצי תרגול הסבר וחצי באמת תרגילים. מי שקולט את הקמצוע מהר יכול להיות שישתעמם אצלו, אבל מי שכמוני מתקשה אני מאוד ממליץ עליו. יש לו בעיית איחורים אבל הוא כמעט תמיד מפצה על זה, ובכללי הוא מאוד מסור. הייתי הולך קבוע לשעות הקבלה שלו והוא היה נשאר הרבה פעמים שעה - שעתיים נוספות כדי לסגור את כל השאלות. אחלה טל.\n\nשעורי הבית: גליון + וובוורק כל שבוע. אני הייתי מתחיל מהוובוורק שלרוב יותר פשוט וטכני ואז עובר לגליונות. הגליונות בדרך כלל 4 שאלות, לקחו לי כמה שעות טובות כל אחד. בדיעבד לא חושב שהם הכינו אותי לשאלות במבחן, רק ההוכחות משם רלוונטיות. אבל זה מגן אז שווה לעשות\n\nהמבחן: צנזור החליט הסמסטר שיהיה רעיון טוב לשלב שאלות אמריקאיות. אני לא התחברתי ונפלתי שם חזק, מספיק טעות חישוב קטנה כדי לאבד את כל השאלה, לא כיף.\nמבחינת השאלות הפתוחות הן היו הוגנות מאוד. \n\nהשורה התחתונה: אהבתי יותר מאינפי 1מ, בעיקר את החלקים הטכניים של החישובים, אבל הקורס לא קל ומאוד עמוס.", "timestamp": 1658566364525}, {"author": "Me", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: צנזור יוטיוב\nחוות דעת - הרצאות: מעולה כרגיל, אין תלונות.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: הכי טובה שיש. מהירה בטירוף. כמו לראות על כפול 1.5. פותרת תרגילים ממש טובים שעוזרים ממש בגיליונות ובהחלט ברמה שנדרשת בניגוד למתרגלים אחרים לדעתי.\n\nשעורי הבית: הוובוורקים בחלק מהמקרים (וקטורים וצורות תלת מימדיות) מהמקרים לא רלוונטיים בכלל ושווה להתעלם. הגיליונות יותר קרובים למבחן מאינפי 1מ.\n\nהמבחן: השאלות הפתוחות אצל צנזור תמיד סבירות, האמריקאיות לא האירו לנו פנים.\n\nהשורה התחתונה: אהבתי.", "timestamp": 1658626888823}, {"author": "פריאל חזן", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: אביב צנזור מוקלט\nהכי טוב המוקלט, חומר זהה לזה שבכתה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טל בן יהודה\nמתרגל תותח שמכין סיכומים להכל, מומלץ.\n\nשעורי הבית: \nדומה לאינפי 1מ בקושי כזה, אולי קצת יותר.\n\nהמבחן: \nסבבה, מזכיר את סגנון השאלות של אינפי 1מ אבל יותר קשה\n\nהשורה התחתונה: \nהמון חומר", "timestamp": 1658990288920}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: המתרגל הכי טוב לאינפי, נקודה. אם יש לכם את הזכות והוא מתרגל את הסמסטר שלכם, אל תחשבו פעמיים. (או שתראו הקלטות זו גם אופציה).\n\nשעורי הבית: גיליונות כמו באינפי1. חשוב ממש לעשות, אבל לא לשבור את הראש יותר מדי שעות, לדעת לשים גבול. אה וללכת לסדנאות.\n\nהמבחן: היה הוגן לגמרי. לפחות בסמסטרים של צנזור, בעיקר חשוב לדעת טוב הוכחות.\n\nהשורה התחתונה: עברתם אינפי1 תעברו גם את זה.", "timestamp": 1659097855586}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: נאמר כבר הכל...\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: ממליץ מאוד למי שאוהב קצב גבוה (לא גבוה מידי).\n\nשעורי הבית: גיליון פעם בשבוע. חלקם קצרים מהמצופה. הרוב ממוצעים כמו באינפי 1מ'.\n\nהמבחן: היה הוגן. היה לנו קטע לא סבבה שהוסיפו תשובות לשאלה אמריקאית ורק בדיעבד הבנו שהיו טורים לבחינה, ככה שהרבה חשבו שאחת התשובות שנוספה היא התשובה הנכונה, אבל בפועל זה היה נכון רק לטור מסוים.\n\nהשורה התחתונה: קורס מעניין. ממליץ לנסות להבין את ההגדרות כמה לפרטים הכי קטנים.", "timestamp": 1661074988310}, {"author": "אלחנן בלוך", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: כמובן, צנזור מסביר הכי טוב שיש... בד\"כ הוא גם נותן אינטואיציה שמאוד עוזרת להבין.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מעולה. מאוד תכל'סי. כלומר - אם אתם יחסית טובים בחומר, יוליה ממש מומלצת. אם לא, עדיף לחפש מתרגל שמסביר יותר לאט.\n\nשעורי הבית: קשים, ודורשים הרבה השקעה. אבל גם מכינים בצורה מאוד טובה למבחן (הם ברמה קצת יותר גבוהה מהשאלות במבחן), והכרחיים כדי להפנים את החומר.\n\nהמבחן: קשה, אבל הוגן.\n\nהשורה התחתונה: אני ממש נהניתי בקורס. חומר מעניין, ואפילו מגניב. אבל צריך הרבה השקעה כדי להבין (וליהנות...)", "timestamp": 1664654143219}, {"author": "טל", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nמומלץ ברמות, יודע להעביר את החומר בצורה מושלמת ובשפה שבאמת אפשר להבין\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nהמתרגל הכי טוב לאינפי, יושב על תרגילים ומסביר את צורת החשיבה שלו לעומק, לאט ויש לו סיכומים ודוגמאות שמאוד עוזרים\nשעורי הבית: \nסבירים\nהמבחן: \nסביר\nהשורה התחתונה:", "timestamp": 1665249655337}, {"author": "yanis", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: מתרגל מדהים! מסביר את החומר הנלמד בצורה אינטואיטיבית ובאמת אכפת לו מהסטודנטים \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675937048193}, {"author": "Adan Wattad", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיכל קלינשטיין\nחוות דעת - הרצאות: מובנות ומסודרות לפעמים קצת מהירה אבל מסתדרים בסוף.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: צריכים הרבה זמן, מומלץ לחלק אותם וללכת לשעות הקבלה.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677755911692}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: אכפת לה מכל סטודנט וסטודנטית. בסוף הסמסטר הייתה מהירה כדי להספיק את החומר אבל הייתה מתעכבת אם היו שאלות. בסמסטר שלנו הכינה מבדק עצמי שהייתה מטרתו נטו לבחון את עצמנו שזה מעולה (השאלות היו ממש ממבחני עבר ולכן זה ממש עזר לדעת למה לצפות).  \n\nשעורי הבית: קשים. מי שמשקיע ופותר בד\"כ יסתדר במבחן אבל לא בהכרח. \n\nהשורה התחתונה: \nזה קורס עמוס וכן קשה. יותר נחמד מאשר אינפי 1מ אבל עדיין ממש קשוח. \nתשקיעו אפילו בדברים הכי קטנים שיש בקורס הזה. אל תעשו הנחות לגבי מה שכן יופיע במבחן ומה שלא. ממש תבינו את הכל ואת כל הדוגמאות \"שנראות שוליות\" . זה ישתלם בסוף.", "timestamp": 1677766680890}, {"author": "ITZIK", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: מיכל\nתראו צנזור עדיף, רק תוודאו שאתם על החומר ומשלימים עם צריך כי לפעמים היא עושה קצת שונה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יוליה\nדי מהירה אבל האופציה הכי טובה שראיתי\n\nשעורי הבית: גיליונות ארוכים אבל חשובים\n\nהמבחן: יש הרבה שאלות אמריקאיות אז זה די מקל\nחוץ מזה קורס מאתגר אין מה להגיד אבל עם הרבה עבודה אפשר גם לקבל 100 בלי להיות אייזיק ניוטון\n\nהשורה התחתונה: \nתהיו חזקים\nהאמת יש בקורס גם דברים יפים ומגניבים", "timestamp": 1679088621889}, {"author": "מתאכזב מתוך 10", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nבחלק הראשון של הקורס היה סבבה והיא מסבירה טוב ואחלה של מרצה.\nבחלק השני (פונקציות של שני משתנים) היה פשוט הזוי, הייתה ממהרת כי לא נשאר מספיק בסמסטר ואי אפשר היה להבין עליה והיה צורך להשלים ולהבין לבד, לא עשתה עבודה טובה בחלק זה. \nשורה תחתונה: בלגן בחלק השני.\n\nשם המתרגל/ת: יוליה + טל\nחוות דעת - תרגולים: \nכן, הלכתי אצל שניהם לכל מהלך המסמטר, לא היו מסודרים עם המרצה והיו הרבה טעויות מצד שני המתרגלים, אך כל אחד מהם תרם דברים אחרים שהשני לא הסביר ו*ביחיד ולא לבד* הצלחתי להבין (כלומר היית מפסיד חומר אם לא הלכת לשניהם), אך קצת הזוי ללכת לשני מתרגלים כדי להבין, לא?.\n\nשעורי הבית: עמוסים ולא מסבירים הכל בפתרונות רק נותנים רעיון ואין הרבה פורמליות, כאילו לא כבר חשבנו על השאלות והיה לנו רעיון איך לפתור, לדעתי היו אמורים לרשום פתרונות מלאים ולפחות לא להתלונן שאין מספיק פורמליות במבחנים.\n\nבוחן אמצע:\nלא היה אך היה מבדק עצמי בלי ציון בשבילנו.\n\nהמבחן: נבחנתי בשני מועדים\nמועד א: מבחן כמעט סביר חוץ משאלה אחת (3) בלתי פתירה ולדעתי היה ניתן לקבל ציון גבוה אלמלא הבדיקה הלא קלילה\n\nמועד ב: הזוי\nאנשים ניגשים למועד ב לשפר את הציון, אין אפשרות כזאת עם מיכל.\nממוצע 53 הפך ל 55 אחרי פקטור נדיב של ״4״ נקודות עם ציון מקסימלי 89 !! אין ציון מעל ל 90 וממוצע נכשל. עשתה משהו דומה באינפי 1מ הסמסטר שעבר במועד ב והיא עכשיו ממשיכה את מסורת, היא לפעמים שוכחת שיש בני אדם שנבחנים ולא איכפת לה במועדי ב.\nותוסיפו על זה הבלגן שהיא עשתה בסוף, מאכזב שזה המצב במכון שמכבד את עצמו.\n\nהשורה התחתונה: אל תעשו מועדי ב עם מיכל! תעשו הכל לסיים במועד א כשהיא אחראית כי היא לא מתחשבת.", "timestamp": 1679245245416}, {"author": "טור מספרים מתבדר", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל קליינשטרן + אורי אליאש בהקלטות\nחוות דעת - הרצאות: \nניכר שלמיכל יש כוונות מאוד טובות, והיא מאוד נכונה לענות על שאלות של אנשים בזמן ההרצאות.\nבחצי הראשון של הקורס גם היה די נעים ללמוד אצלה;\nאבל החצי השני של הקורס (פונקציות בשני משתנים) היה בלתי נסבל.\n\nהיעדר כמעט מוחלט של הוכחות, speedrun מוגזם ולא הגיוני לחומר שלא מאפשר כל סיכוי להבין באמת את הנושאים, מעבר לשינון סטייל תיכון.\n\nהחצי הראשון היה נחמד מאוד, מאוכזב מהחצי השני. לדעתי צריך לשנות משהו בשיטת ההוראה.\n\n(שימו לב שבמהלך הסמסטר כתבו סיכום שמתמלל את ההרצאות של מיכל, שווה לבדוק אם אתם ניגשים בסמסטר שבו היא אחראית.\nשווה גם לבדוק את ההרצאות המוקלטות של אורי אליאש, שהן יחסית בסגנון של מיכל ולפעמים אפילו מוצלחות יותר)\n\nשם המתרגל/ת: טל בן יהודה (פרונטלי), רן קירי (הקלטות)\nחוות דעת - תרגולים: \nטל בן יהודה המתרגל הטוב ביותר שיצא לי להיתקל בו בטכניון.\nרמת האכפתיות שהוא מגלה לסטודנטים והנסיון להראות לסטודנטים את היופי מאחורי הקונספטים והרעיונות, פשוט אין שני להם.\nהיה עורך שעות קבלה באורך 3~4 שעות ולא עוזב עד אחרון הסטודנטים.\nהייתי ממליץ ללכת אליו פרונטלית בלי לחשוב פעמיים. הרבה יותר טוב מיוליה מבחינתי.\n\nלפעמים חיזקתי את התרגולים של טל עם הקלטות של רן קירי, שהוא לפעמים נותן תרגילים קשים יותר שמתאימים יותר לסגנון של מיכל.\nטל מלמד בסגנון יחודי משלו, שלא תמיד מתכתב עם ההרצאות של מיכל.\n\nשעורי הבית: עמוסים ובאופן כללי סבל גדול.\nתרגילים לא כיפיים בלשון המעטה, והחשיבות היחידה שלהם לדעתי היא הסיכוי שמי מהם יופיע במבחן.\nבכל מקרה כדאי לנסות לפתור לבד, אבל לא הייתי נתקע יותר מדי.\n\nהמבחן: הקונספט של שאלות אמריקאיות במשקל 8 נקודות כל אחת הוא אבסורד מבחינתי, שכן זה בערך המשקל של סעיף בשאלות הפתוחות, ואין כל התחשבות בדרך ובהבנה של החומר. הייתי מציע לסגל לשנות את זה ובמהרה.\n\nמועד א׳ היה יחסית הוגן למי שהיה חזק בחומר, חוץ משאלה מספר 3 שעסקה בנוסחת הסכימה של אבל (אחרי שמיכל אמרה שלא יופיע במבחן), שהייתה הזויה ממש ולא קשורה למבחן.\n\nמועד ב׳ היה לדעתי קשה יותר משמעותית (במיוחד השאלות האמריקאיות), אישית הסתדרתי איכשהו.\n\nהשורה התחתונה: קורס מעניין מאוד עם הרבה שימושים בהמשך התואר, אבל מבחן קשוח מאוד שאסור לזלזל בו.\n\nהייתי ממליץ להתייחס להרצאות כתרגול נוסף, ולעבוד לבד בבית על מיומנות ואינטואיציה. מי יתן ולייבניץ יהיה אתכם.", "timestamp": 1679250429660}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: מוקלט של צנזור\nחוות דעת - הרצאות: ראיתי הקלטות של צנזור ותוך כדי קראתי סיכומים ששלחו בקבוצה של מיכל כדי לדעת מה שונה\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: יוליה מתרגלת טובה בסהכ אבל קצת קשה לשמור על ריכוז איתה, היא די רצה על החומר וזה לא מתאים לכולם \n\nשעורי הבית: גליונות כמעט כל שבוע, ברמה מאוד גבוהה. לא להכל יש רפרנסים אז להתחיל לפתור אותם כמה שיותר מהר כי רוב הסיכויים שזה יקח לכם זמן\n\nהמבחן: קשה רצח. מועד ב ממוצע סופי 55 אחרי פקטור 4 נק - זה כבר אומר הכל לדעתי\n\nהשורה התחתונה: קורס חובה אז אין הרבה מה לעשות איתו. קורס קשה וחופר מאוד (אומרת את זה בתור מישהי שאהבה אינפי 1מ, הקורס הזה הרבה פחות מעניין לדעתי והרבה פחות מובן)", "timestamp": 1679772929920}, {"author": "Adam Liberov", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: משעמם\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: פשוט מלך ורואים שאכפת לו מהסטודנטים\n\nשעורי הבית: יותר קשים מאינפי 1 בעיקר הרגשה של תסכול\n\nהמבחן: המבחן מחר וזה מה שאני במקום ללמוד\n\nהשורה התחתונה: קורס משעמם רצח , אולי כי צנזור לא מרצה הפעם אבל אין מה לעשות זה חובה", "timestamp": 1689243017323}, {"author": "~", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא ממש מעניינים, אלון קצת מבולגן ולא מרגיש שהסקתי משהו מכל ההוכחות שעשינו. עברתי להקלטות של צנזור וקראתי סיכומים באמצע השני של הסמסטר ומתחרט שלא עשיתי את זה בהתחלה\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: בסדר, כמו אינפי 1, טל שם יותר דגש על אינטויציה, מעמיק בכל תרגיל אז לא מספיקים לעשות הרבה.\n\nשעורי הבית: ארוכים, מרגיש לי יותר קשים מאינפי 1\n\nהמבחן: מבחן בסופו של דבר יותר פרקטי ופחות תיאורתי,\nאבל הלך ממש גרוע. איזה כיף לאבד 8 נקודות על כל שאלה אמריקאית\n\nהשורה התחתונה: מאכזב. זה אמור להיות קורס ממש מעניין אבל לא אהבתי צורה שבה מלדמים אותו. מקדישים יותר מדי זמן על הוכחות רנדומליות קטנות, ועל חלקם סתם מדלגים. הקלטות של צנזור או של אליאש הרבה יותר טובים אבל יש שינוים.", "timestamp": 1689332812587}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: המרצה סבבה אל תקשיבו לכל הליצנים שאומרים שהיא מעבירה את החומר לא בסדר, אין להם מושג על מה הם מדברים. כל התלונות על המבחן מגוכחות כי מיכל ממש אמרה באחת ההרצאות שהקורס כל כך קריטי שלא היא כותבת את המבחנים בכלל אלא הפקולטה ואני קיבלתי ממנה תמיד וייב שכן אכפת לה מהסטודנטים. \n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים:  המתרגל הכי טוב בטכניון!\n\nשעורי הבית: קשים, לא חובה אבל מאוד מומלץ\n\nהמבחן: קשוח, אבל אם לומדים כדי להבין את החומר ולא לשנן פתרונות עבר אז הוא פתיר.\n\nהשורה התחתונה: קורס קשה אבל חובה אז... בהצלחה", "timestamp": 1689337616222}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכל קלינשטרן\n\nחוות דעת - הרצאות: \nבתחילת הסימסטר היו יותר מסודרות וברורות, בהמשך במעבר לאינפי בשני משתנים הורגש קושי מסויים בהעברת החומר. בסך הכל מרצה טובה בעיני, באמת איכפת לה מהסטודנטים, נותנת תחושה נעימה לפנות אליה בשעות קבלה בשאלות בכיתה או בכללי ברחבי הטכניון. לחלק מהסטודנטים זה פחות מתאים אולי מכיוון שהם סיימו תיכון אתמול והם מנצלים את האווירה הטובה כדי לבלבל את השכל בלי הפסקה במהלך ההרצאות באופן מעיק. יהיה הרבה יותר נחמד לדעתי אם מיכל תהיה קצת פחות נחמדה. \nעוד פלוס זה הסיכום המוקלד של הרצאותיה שדומה מאוד למה שהולך בכיתה עד רמת הדוגמאות, עוזר למי שמתקשה בהעתקה מהלוח או סתם אם פספסת שיעור.\n\nשם המתרגל/ת: טל + רבקה. נכון שנותנים לכם רק שעתיים תרגול באינפי 2 אבל תאמינו לי אתם  צריכים עוד 2 וככל שתבינו את זה מהר יותר כך סיכוי טוב יותר שתצליחו בקורס. חשוב לבחור שני מתרגלים שמשלימים זה את זה ועושים תרגילים שונים. בעיני טל ורבקה הם השילוב המושלם של קצב איטי ולימוד התיאוריה באופן לא מתפשר יחד עם קצב גבוה והספק פתרון שאלות של תת מקלע \n \nחוות דעת - תרגולים: \nטל- האמא של מתרגלים. מסביר את החומר יותר טוב מכל מרצה שנתקלתי בו, נותן אינטואיציה, סיכומים ובעיקר את הנשמה שלו לסטודנטים. כל שעת קבלה הוא מאריך פי 2 ואחרי כל תרגול נשאר עוד כמה זמן שנדרש עד שכל הסטודנטים קיבלו מענה לשאלות. אל תנצלו את טוב הלב שלו, בחייאת תקראו סיטואציה ותנו לבן אדם ללכת מתישהו...\nרבקה- אלופה, פותרת מהר וממקדת אותנו בעיקר. נותנת דגשים וטריקים לפתרון מהיר של בעיות חוזרות. אין טעם לדעתי לנסות להעתיק מהלוח (וגם לא אפשרי אם בא לכם להבין מה קורה) בסוף כל שיעור היא שולחת פתרון של כל השאלות שהספקנו ואיך שהו תמיד יש עוד שלא הגענו אליהן\n\nשעורי הבית: קשים אבל פתירים. בכל גליון יש איזה שאלה או 2 שלא תצליחו לפתור לבד וזה בסדר גמור. בשביל זה יש שעות קבלה או חברים מי שמעדיף. רק ממליץ לוודא שאתם מבינים את הפתרונות גם של השאלות הקשות כי זה ניואנסים שחוזרים במבחנים. \n\nהמבחן: שלנו היה קשה והוגן לדעתי. השאלות הסגורות היו דומות לשאלות מבוחן האמצע שמיכל העלתה למודל. השאלות הפתוחות היו קשות ושונות משאלות עבר שנתקלתי בהן אבל לא בלתי הגיוניות למי שהתכונן ברצינות\n\nהשורה התחתונה: קורס ומעניין. אבל מה זה משנה השורה התחתונה?? אף אחד לא לוקח אינפי 2 מרצונו החופשי..", "timestamp": 1689412690955}, {"author": "אא", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: הכל לא מובן אצל מיכל \nראיתי סרטוני צנזור ביוטיוב\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: הייתה מעולה\n\nשעורי הבית: קשים אבל עוזרים מאוד למי שפותר במהלך הסמסטר\n\nהמבחן: קשה מאוד ואפילו מי שלומד כל הסמסטר עובר בקושי\nמיכל לא יודעת ללמד ולא יודעת לעשות מבחנים הוגנים רמת הקושי גבוהה אפילו מתרגילי הבית \n\nהשורה התחתונה: אם זה לא קורס חובה לא הייתי נוגעת בו..", "timestamp": 1689417611203}, {"author": "תחום אינטגרציה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: מאוד נהניתי אצל אלון. לדעתי אלון די מסודר, והוא יודע להסביר הכל כמו שצריך. הוא גם נותן אינטואיציה מאוד טובה והוא תמיד רוצה שהסטודנטים יבינו את מה שהוא מסביר. תמיד עונה על שאלות במידת הצורך ופשוט סך הכל מרצה נהדר :)\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: את האמת שלא הכי חיבבתי את התרגולים של טל. טל בן אדם עם לב זהב, אבל התרגולים שלו הרגישו לי קצת חופרים. הוא ניסה לתת אינטואיציה לכל מיני דברים, שלפעמים עזרה, אבל לפעמים היא הייתה כל כך ציורית ואבסטרקטית יתר על המידה שזה רק הפריע לי להבין את הנושא. הרבה פעמים הייתה תחושה של לחץ בזמן ולרוב הוא שחרר אותנו להפסקה או מהתרגול מאוחר יותר ממה שצריך.\n\nשעורי הבית: בערך גליון פתוח אחד לשבוע ווובוורק אחד לשבוע, כמו באינפי 1. הגליונות נורא קשים. זה נכון שאם שוברים עליהם את הראש זה מאוד תורם להבנה של החומר, אבל בסמסטר כזה עמוס שבו יש מיליון ואחת מטלות אחרות, לדעתי אין זמן לשבת ולשבור את הראש על הגליונות האלה במשך ימים, ולכן הרבה פעמים רפרנסתי ווידאתי שאני מבינה את הרפרנס כדי לייעל את התהליך. לפרוטוקול, הגליונות לרוב אמורים להיות קשים יותר משאלות מבחן, לכן אין לכם מה להתרגש אם אתם לא מצליחים לפתור איזושהי שאלה. לגבי הוובוורקים - הם מאוד עזרו לי להטמיע את החומר, ולדעתי הם המגן הכי שווה שיש בקורס, יותר מהגליונות, כי זה מגן בטוח שאפשר להוציא בו \nציון מקסימלי, לעומת הגליונות, שהם מקנים רק את האפשרות לקבל מגן על שאלה אחת במבחן.\n\nהמבחן: איכס. גם החזקים סבלו. אם יש לכם ברירה, תנסו להימנע מהקורס כשמיכל אחראית עליו.\n\nהשורה התחתונה: החומר מאוד מאוד מעניין. אני אישית אהבתי. אבל הקורס ממש קשה ועמוס והמבחן זוועתי. פשוט תנסו כמה שיותר לעבור את זה", "timestamp": 1689426009329}, {"author": "עובר ועוד אפסילון", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכל \nחוות דעת - הרצאות: מיכל מאיצה ככל שמתקדם הקורס אז תתכוננו. מי שעובר על החומר כראוי בין הרצאות יבין מה מיכל אומרת ורוצה אחרת ברוכים הבאים לארבע שעות שבועיות של בלבול ופאניקה.\nמרצה בסדר סך הכל עדיף לנסות להבין את הלך הרוח ולתת את ההשקעה התרגולים וגיליונות\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: מדהים, השקעה נהדרת אינטואיציה מעולה והסיבה שיש היגיון בחומר. ממליץ לשלב עם רבקה\n\nשעורי הבית: חצי סביר חצי לא, כדאי לנסות להבין כי זה קונספטים חשובים\n\nהמבחן: האמריקאיות תמיד באות לבחון אם זוכרים איזה פרט מידע קטנטן וחוץ מלעשות מלא ולקוות ליפול על אמריקאיות שלמדתם לפתור. הפתוחות הוגנות (אם ישר חושבים על התשובה) רק חבל שלזכור תשובות בעל פה יותר פשוט מאשר להבין את החומר \n\nהשורה התחתונה: לכתוב הוכחות ולהבין", "timestamp": 1689514589428}, {"author": "מתבדר", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ד\"ר אלון דמיטריוק\nחוות דעת - הרצאות: \nהרצאות ארוכות ומייגעות, המרצה מוכיח מעל ומעבר למה שדרוש ויוצא שמשפט אחד מוכח למשך שעתיים ואפילו יותר, כך שהדברים החשובים לא מקבלים כמעט זמן. כשמסתכלים על מה שעשתה המרצה הראשית, רואים שרוב מה שהוא עשה  לא בחומר בכלל, וסתם היה ארוך ללא סיבה. באמצע הסמסטר הפסקתי ללכת ואני מתחרט שלא הפסקתי קודם.\n\nשם המתרגל/ת: גב. רבקה אביטל\nחוות דעת - תרגולים: נרשמתי לרבקה במקרה באינפי 1מ ולא הפסקתי ללכת שנה שלמה, מתרגלת מעולה, פותרת מלא שאלות בקצב מהר ומכינה מאוד טוב לחומר, שמה דגש על הדברים החשובים ועוזרת אחר כך לפתור שאלות. המתרגלת הכי טובה אין מה לעשות.\n\nשעורי הבית: \nארוכים מאוד, מומלץ לנסות לפתור אותם כי יש שאלת שיעורי בית במבחן אז עדיף לבוא מוכנים. גם אם לא פותרים לקרוא את הפתרונות כי זה עוזר להבין את החשיבה אחר כך.\n\nהמבחן: \nמבחן באינפי אין מה לעשות, עם בקושי פקטור אם בכלל, השאלות הסגורות בטור שקיבלתי היו משונות ולא כל כך קשורות לחומר, אחת פתרתי עם זהויות טריגו מהתיכון. הפתוחות גם היו משונות כי הדגשים היו על נושאים קטנים במקום על נושאים גדולים. אבל סך הכל היה סביר.\n\nהשורה התחתונה: \nקורס ממש מעניין עם המרצה הנכון, חבל שהקורס קצת מאבד כיוון מהיופי של אינפי 1מ אבל עדיין מאוד מעניין, היה יותר נחמד אם היו שמים יותר דגש על הצד החישובי שבו נשתמש בתואר במקום בלדעת לעשות הוכחות מסובכות, למרות שיש לדעתי התקדמות בכייוון הנכון.", "timestamp": 1689846328449}, {"author": "המספר האינפיניטסימלי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאלון דימיטריוק- \nאחלה בחור, מרצה טוב, מסביר קצת אינטואיטיבית לאן חותרים בהוכחה ומתחיל להוכיח, גורם להרצאה להיות יותר מעניינת.\nשם המתרגל/ת: \nלא יודע, עברתי בין מתרגלים, בהתחלה יוליה ואז טל ואז ניקה.\nחוות דעת - תרגולים: \nיוליה הולכת מהר והרבה לא אוהבים את זה לפעמים אבל היא סבבה, טל מסביר את החומר אינטואיטיבית מעולה גורם לנו להיכנס לראש שלו ומה הוא חושב כשהוא פותר תרגילים, אבל לפעמים הולך טיפה לאט אז אם אתה מהיר ממליץ לנסות ולהחליט אם מתאים, ניקה פחות אהבתי יצא שרוב החומר היא מקריאה מטאבלט אבל רואים שיש לה ידע בתחום וכולם מבינים בסופו של דבר.\nשעורי הבית: \nגיליונות בהתחלה זוועתיים 5-6 ראשונות כמעט לא פתירות אומר כמי שפתר את הגיליונות באינפי 1מ אחר כך נהיה יותר סבבה אבל לא כאלה קלים, הרבה שם ממוחזר ממבחני עבר.\nהמבחן: \nהמבחן היה גבולי.\nהרבה טענו שהיה קשה ממש, אבל הממוצע מדבר בעד עצמו שהוא יותר גבוה מסמסטרים גבוהים.\nהיו דברים פחות ברורים מאליו במבחן לדעתי יותר קשה בהוכחות משנים קודמות האמריקאיות לא קשות, אבל האמריקאיות כמעט תמיד לא קשות לפעמים יש רק איזה שאלה אחת מתוכן שבאמת קשה.\nהשורה התחתונה: \nקורס נחמד, מעניין, הייתי לוקח גם אם לא היה חובה ואם היו ממוצעים יותר גבוהים אבל אולי זה רק אני.", "timestamp": 1689847190559}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכל קליינשטרן + צנזור מוקלט\nחוות דעת - הרצאות: \nמיכל מרצה ממש נחמדה אבל לי הרגיש שהיא טיפה מבולגנת ולי היה קשה לעקוב אחריה בשיעור, באמצע הסמסטר עברתי למוקלטות של צנזור, מסביר מאוד ברור וטוב. צריך לשם לב שחלק מהמשפטים שהוא מנסח טיפה שונים בתנאים ממה שמיכל מנסחת בהרצאות אז מומלת לעבור גם על הסיכום מההרצאות באותו סמסטר. חוץ מזה החומר מקביל להרצאות.\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל מתרגל ובן אדם מדהים. \nתמיד מסביר את האינטואיציה מאחורי הדברים.\nבנוסף יש לו רשימות ממש מסודרות שאני ממליץ להשתמש בהן.\nלדעתי הוא בין המתרגלים הכי טובים בטכניון ממליץ מאוד.\nשעורי הבית: \nיש גליון כל שבוע-שבועיים במומצע ווובורק כל שבוע.\nהוובורקים סבירים, גליוניות יש כאלה יחסית קלים שלוקחים לא יותר מ4 שעות ויש כאלה ממש קשים שלוקחים יותר מיום.\nמומלץ מאוד עשות מכין טוב למבחן\n\nהמבחן: \nלדעתי היה מבחן יחסית הוגן, הפתוחות היו קצת קשות אבל האמריקאיות היו ממש סבירות והוגנות, צריך לתרגל מלא בסוף מתחילים להבין.\n\nהשורה התחתונה: \nיותר חישובי מאינפי 1 בא לידי ביטוי גם במבחן 40 נקודות על שאלות חישוביות.", "timestamp": 1689857133839}, {"author": "o.k", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: בגדול מרצה טובה , חצי ראשון של הקורס היה מאוד בסדר אבל בחצי השני היא מיהרה לגמרי ובקושי הוכיחה דברים.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: לדעתי שיעורי הבית קשים יותר מהשאלות מבחן, איו מה לבזבז עליהם יותר מדי את הזמן אפשר לנסות לפתור ולא לפחד לרפרנס אם לא מצליחים(העיקר שתבינו את הפתרון) \n\nהמבחן: המבחן היה די הוגן, יש הרבה מבחנים לתרגל מהם, לדעתי חשוב ממש לחזור ולראות הרבה סוגים של שאלות אמריקאיות כי אלו שאלות עם הרבה טריקים מעצבנים כאלה, ובשביל השאלות הפתוחות כדאי פשוט לחזור על הגיליונות(גם כי יש שאלה שלמה שדומה לאחת מהשאלות בגיליונות).\n\nהשורה התחתונה: קורס נחמד מאוד שלדעתי יותר חשוב וטוב יותר מאינפי 1מ'", "timestamp": 1689858513027}, {"author": "Роман Джапаридзе", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nAlon is the best\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nRecrodings from winter 2022 are much better then any practicant on this semester\nשעורי הבית: \nVery difficulty\nהמבחן: \nFair but you need to know all the defenistions\nהשורה התחתונה:", "timestamp": 1689862457157}, {"author": "NONE", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל ללא ספק מנסה מאוד להיות מרצה טובה (ואהובה...), אבל לא תמיד מצליח לה. יש לה כוונות טובות והיא משקיעה לא מעט - אבל בכל זאת מאוד קל לאבד את ההרצאה, ההסברים לא תמיד מאוד טובים והרבה פעמים מרגיש שקצת מבזבזים הרבה זמן על הדברים הלא חשובים ורצים על מה שחשוב ורלוונטי.\nודוגרי, למרות שמיכל עשתה כל מה שאפשר כדי להבהיר שלא כדאי להסתמך על המוקלט של צנזור - בסוף הוא מסביר מצוין ומלמד יותר טוב בפער.\nמקווה בשביל דור העתיד שצנזור יקליט את הקורס בצורה מעודכנת.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: סיכומי תרגול מושלמים. מאוד משקיע ומאוד חשוב לו. רק קצת שקט ובגלל זה קצת קשה להשאר מרוכזים הרבה זמן.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1690298833984}, {"author": "Eli", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: צנזור (מוקלט)\nחוות דעת - הרצאות: צנזור כהרגלו מסביר באופן האינטואיטיבי כך שאחד האדם יוכל להבין את החומר. לפעמים החומר מבלבל וישנן הוכחות שמיכל עושה והוא מדלג עליהן, ולחילופין יש הוכחות שמיכל לא עושה וצנזור כן עשה בוידאו ולכן שווה להיות עם יד על הדופק.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מספיקה היקף מכובד של תרגילים בתרגול שלה, ותוך כדי עוצרת ועונה לשאלות ולא מדלגת כשנשארו שאלות בקהל.\n\nשעורי הבית: בהחלט מאתגרים ומכינים למבחן.\n\nהמבחן: \n\nהשורה התחתונה: קורס שצריך להשקיע בו, ומי שמשקיע יקבל בהתאם ציון יחסית טוב. מי שלא משקיע במהלך הסמסטר כנראה יתקן בקשיים להשלים פערים בהמשך.", "timestamp": 1690703817239}, {"author": "Srp", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל קליינשטרן \nחוות דעת - הרצאות: \nמיכל אישה מקסימה, אבל אין מה לעשות היא לא טובה עם כיתה גדולה וקשה לעקוב אחריה בקורס הזה. בסופו של דבר עברתי ללקרוא את הסיכום של השיעורים שלה (מישהו סיכם ורץ בקבוצות) ובמקביל לראות צנזור ביוטיוב למרות שטוענים שזה לא מדוייק. זה מספיק מדוייק ועם הסיכום ממש יודעים מה צריך לראות.\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: ניקה מעולה, היא מאוד מסודרת ועונה על שאלות ומספיקה את הכול בדרך כלל. מוצאת את האיזון ביניהם והיא גם מסבירה מאוד טוב.\n\nשעורי הבית: גיליון בשבוע\n\nהמבחן: מיכל אוהבת לעשות מבחנים עם שאלות \"יפות\" שהן בעצם לא כל כך פתירות, אז צריך להכיר את הסגנון שלה כדי לא להיות מופתעים בבחינה. \n\nהשורה התחתונה: קורס חובה מה נעשה", "timestamp": 1690880753093}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נעמי\nחוות דעת - הרצאות: \nמרצה טובה, מלמדת בקצב הרבה יותר טוב ממיכל. באמת יש זמן לסכם בזמן ההרצאות לעומת מיכל. טיפה מפוזרת אבל זאת לא בעיה.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: \nמה שכבר נאמר אליו נכון, מתרגל מצויין ומעביר את החומר בצורה מעולה.\n\nשעורי הבית: לי אישית יותר קלים מאינפי 1מ אבל יש כאלה שאמרו שהם יותר קשים. שווה לבוא לשעות קבלה כדי לקבל משוב אמיתי על התרגילים, רק ככה לומדים.\n\nהמבחן: קשה. צריך לשנן מלא משפטים ובמדוייק כי יש שאלות של לצטט משפט, וללמוד הרבה טריקים. במועד א' השאלות האמריקאיות לא היו קשות במיוחד, אבל הפתוחות כן.\n\nהשורה התחתונה: \nקורס קשוח, אם לא היה חובה לא הייתי מתקרב אליו. יותר מדי משפטים לזכור, מלא חומר ללמוד, כמו אינפי 1מ רק לא תמיד יש אינטואיציה גרפית.", "timestamp": 1691488337247}, {"author": "*", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמרצה נחמדה ורואים שהסטודנטים חשובים לה ושהיא אוהבת את הנושאים האלה. קצת מבולגנת, לא ברור אם היא מוכיחה או נותנת דוגמאות, מתבלבלת לפעמים בהוכחות ומסבירה קצת לא ברור. לדעתי גורמת לחומר להיראות יותר מסובך ממה שהוא באמת.\n\nשם המתרגל/ת: ניקה פת \nחוות דעת - תרגולים: \nמתרגלת מושלמת! מהירה אבל עוצרת לשאלות, מאוד בקיאה בחומר ומסבירה טוב.\n\nשעורי הבית: \n12 webwork ו-9-10 גליונות קשים (כבד). בפועל זה לא באמת המון מגן אבל לדעתי חשוב לעשות כדי להישאר על החומר במהלך הסמסטר, שעות קבלה ממש עוזרות.\n\nהמבחן: \n3 פתוחות ו-5 אמריקאיות. אחת מהפתוחות היא שאלת ש\"ב. לדעתי היה קשה מאוד אבל הולם את הרמה של הגליונות והקורס, לא ציפיתי לפחות.\n\nהשורה התחתונה: \nקורס קשה ועם הרבה עומס, חשוב לא לאבד אותו במהלך הסמסטר.", "timestamp": 1691506819269}, {"author": "bashar assaf", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מרצה שאפנית, בעלת יכולת ללמד חומר קשה, אך ההרצאות שלה אינן מסודרות , ההוכחות אינן קוהרנטיות ונדרש ללמוד את הסיכום שלה -ורק שלה- מחדש\nלא ממליץ לוותר על ההרצאות אלא לעבוד פעמיים גם להגיע להרצאות וגם ללמוד לבד\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מלכת האינפי, חדה ,מסודרת, מוכנה לענות על כל השאלות בצורה ברורה, משקיעה בשאלות שמעבירה בתרגולים וגם מעבירה את קבצתי התרגול\nשורה תחתונה: מומלצת במיוחד, אך ראוי לציין כי קצב הלימוד מהיר מאוד ולפעמים צריך להביא קסדה כי היא טסה!\n\nשעורי הבית: קשים, להשקיע תוך כדי שימוש ברפרנס\n\nהמבחן:\nקשה - ולדעתי מבחני חורף 2023 של מיכל היו קשים במיוחד אז לא להיבל", "timestamp": 1694162309313}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nמאוד לא מסודרת. מסבירה לפי האינטואיציה  שלה (מאוד שונה מהאינטואיציה של הסטודנטים בדרכ) ולא באופן פורמלי. מאוד מקשה על למידת הקורס\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nמדהים. מסביר את החומר מצוין. נותן יחס אישי. יש לו סיכומים נהדרים שמסבירים את כל החומר. ממליצה בטירוף.\nשעורי הבית: הסמסטר היו קשים ולא ככ קשורים לחומר הנלמד.", "timestamp": 1696071687599}, {"author": "aa", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: צינזור יוטיוב\nחוות דעת - הרצאות: בהתחלה הלכתי למיכל, מפוזרת, הרגיש לי מיותר ובזבוז של זמן. ולבסוף ראיתי את צינזור ביוטיוב עם סיכום מיכל בצד, אין דברים כאלה ידוע מי זה צינזור לא צריך לפרט.\nהערה: ניכר שמיכל יש לה אכפתיות כלפי הסטודנטים, ומנסה לבוא כמה שיותר לקראתנו.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מלכת האינפי\n\nשעורי הבית: קשים, אבל זה אינפי מובן \n\nהמבחן: לא קל, אבל הוגן\n\nהשורה התחתונה: קורס עמוס וקשה, וסה\"כ מיכל אחלה מרצה", "timestamp": 1696172163187}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכל ואז אלון\nחוות דעת - הרצאות: מיכל מסבירה סבבה אבל מפוזרת, קצת קשה לעקוב אחרי ההרצאות שלה. באמצע הסמסטר עברתי לאלון, מסביר טוב וברור, ממליצה עליו.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: אמנם עונה ברור ומסביר טוב, אבל הוא לא יודע מתי להפסיק לענות על השאלות ולהמשיך בתרגול. זה יוצר מצב שהוא איטי ולא מספיק לעבור על הרבה מהחומר. אני פחות התחברתי. מה שכן יש לו סיכומי תרגול ממש טובים.\n\nשעורי הבית: קשים, זה בסדר לרפרנס אם לא מצליחים. חשוב לעשות כדי להיות על החומר במהלך הסמסטר.\n\nהמבחן: קשה ממש!!\n\nהשורה התחתונה: קורס חובה אז אין מה לעשות", "timestamp": 1704923358161}, {"author": "זוהר ארגוב", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  מיכל\nחוות דעת - הרצאות:  מיכל בן אדם מקסים (עם חוש סטייל לא פחות מקסים!) ,יכולות הוראה לא רעות בכלל, ואכפתיות כלפי הסטודנטים. אומנם היא לא צנזור, אבל צנזור יש רק אחד :)\n\nשם המתרגל/ת:  ניקה\nחוות דעת - תרגולים:  מתרגלת מעולה, ברורה וקשובה לסטודנטים. הייתי ממליץ לסגל להוריד קצת מכמות השאלות בתרגול כי היא מעט מוגזמת.\n\nשעורי הבית:  לא הייתה חובת הגשה לשאלות פתוחות הסמסטר משום מה, אלא רק וובוורק מעיק כרגיל.\n\nהמבחן:  הסמסטר מיכל שינתה את הפורמט של המבחן, ובמקום 5 שאלות אמריקאיות היא הוסיפה שאלה אחת פתוחה במטרה להקל עלינו עקב תלונות על עצם קיום השאלות האמריקאיות מהסמסטרים הקודמים. בפועל זה יצר יותר בלבול מאשר שזה תרם, והייתה שאלה אחת במבחן שנשאלה על נושא שתמיד מופיע כשאלה אמריקאית - דבר שיצר קושי ברור אצל הסטודנטים שפתרו מבחני עבר. תוסיפו לכך את העובדה שהמבחן התבצע לפני הסיום הרשמי של הסמסטר ותקבלו מתכון לממוצע זוועתי במבחן. הסיבה היחידה שהוצאתי ציון טוב במועד א' היא נטו כי חזרתי על הקורס ויכולתי לחרוש על מבחנים כבר במהלך הסמסטר, פריווילגיה שלא הייתה לרוב שותפיי ללימודים.\n\nהשורה התחתונה: משמעותית יותר קשה בעיניי מאינפי 1 אבל מעניין באותה מידה, מיכל מקסימה אבל במבחנים הרבה פחות. לא לחשוב שבגלל שהלך לכם טוב באינפי 1 ילך לכם גם טוב באינפי 2.", "timestamp": 1713124370717}, {"author": "דריכלה", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nהייתי רוצה לומר שההרצאות מיותרת אבל החומר השתנה בגלל המלחמה אז צריך לדעת את כל הדברים והשינויים שהיא עשתה. אפשר לשלב הרצאות של מיכל עם הקלטות של צנזור, אבל אני שם לב שהרבה חומר שהיה פעם ירד.\nבכל מקרה, מיכל מרצה מתלהבת מאוד מהחומר אבל צריך להתאמץ כדי להבין אותה.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: \nיופי של תרגולים, עונה לשאלות ופותרת את התרגילים באופן מדויק ותמציתי. יישר כוח!\nהתרגולים סופר חשובים, שכן הייתה שאלה במבחן שהתבססה על חומר שנלמד רק בתרגול האחרון.\n\nשעורי הבית: הם לא היו חובה להגשה על מנת לקבל מגן הסמסטר, אבל הם מאוד חשובים להבנה של החומר, הם בדרך כלל ברמה יותר גבוהה אז כדאי לחזור על החומר טוב טוב לפני שפותרים את תרגילי הבית, או לחלופין לפתור שאלות יותר קלות באותו החומר ממקורות אחרים ורק אז לנסות אותם. \nלפני המבחן לשנן את כל השאלות כי שאלה אחת מהש\"ב תופיע במבחן.\n\nהמבחן: \nמועד א קשה. גם ללא השאלות האמריקאיות הוא היה מבחן קשה ושמו שאלה של חקירת פונקציה ב2 משתנים.  משהו הזוי ומגעיל. גם השאלות על אינטגרלים כפולים ועל אינטגרלים במשתנה יחיד היו מזעזעות. אבל היי, אפשר לשכוח לברוח :)\n\nהשורה התחתונה: \nקורס קשה מאוד. יותר קשה מאינפי 1 זה בטוח. אם לא היה חובה הייתי צוחק לכל אדם בפרצוף אילו היה אומר לי לקחת אותו.", "timestamp": 1716556922910}, {"author": "לאפר דלף", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: אני אוהבת את מיכל ממש. מרצה אנושית מאוד. חשוב לה מאוד שהסטודנטים יצליחו. זוכרת את השמות שלהם. נכון, היא פחות מסודרת מצנזור, אבל חבל שמשווים אותה אליו. בכל מוסד אחר בו היא לא הייתה מושווית למישהו כל כך מוכשר כמו צנזור היא הייתה מרצה טובה בפני עצמה. אישית זה שהרגשתי שאכפת לה ממני מאוד נתן לי מוטיבציה להגיע וללמוד. לא כולם מתחברים אליה, אבל למי שחשוב קשר אנושי עם מרצה - מיכל זה הכתובת. \n\nשם המתרגל/ת: מוקלט שבועי של ניקה. \nחוות דעת - תרגולים: אין באמת מתרגלת טובה בקורס. כולן מאוד מוכשרות בחומר אך לוקות בקללת הידע - הן בטוחות שכולנו שולטים בכל פרט קטן בחומר וכל מי שלא מפגין בקיאות די שקוף מבחינתן. זה די מופגן אצל יוליה וניקה, ולכן העדפתי לצפות בתרגולים שהוקלטו כל שבוע. באופן כללי התרגולים חשובים והייתי ממליץ לכם לעבור עליהם שלוש פעמים (מה שלא עשיתי, אבל בדיעבד) לפחות כבר במהלך השנה כדי שכל השטיקים שלומדים שם יחרטו לכם טוב בראש. תודו לי אחר כך. \n\nשעורי הבית: לא עשיתי, לא היה חובה. התבאסתי לקראת המבחן כי הרגשתי שלא היה לי מספיק אימון. בסוף הלך לי טוב במבחן למרות שלא עשיתי שיעורים, אבל היה לי מזל (אפרט בפסקה הבאה). ממליצה בחום לעשות שיעורים וגם אם זה מפחיד פתאום לנסות לפתור דברים שמצריכים לזכור דברים מאינפי 1, זה יחסוך לכם הרבה זמן ומאמץ, גם בלהבין את החומר הנלמד במהלך הסמסטר יותר טוב, וגם יחסוך לכם בכך שתוכלו ישר להתחיל לתרגל מבחנים במקום להתחיל מאפס בלמידה למבחנים.\n\nהמבחן: לא ניגשתי למועד א כי המבחן היה שבוע לפני שנגמר הסמסטר ולא הרגשתי מוכן וגם רציתי להשקיע בקורסים אחרים. בסוף מועד א היה יחסית מאוד קל והתבאסתי שלא ניגשתי. למדתי שבועיים למועד ב, לא הייתי מוכן בשיט. עשיתי רק 6 מבחנים של מיכל. התכונני טוב מאוד לשאלת שיעורי הבית (25 נקודות), שאלת הנגזרת/רציפות שהיא די טכנית, והתכוננתי לרע מכל ביחס לשאלת האינטגרל הכפול ושאלת ההוכחה (זה היה המבנה של מועד ב ביחס למועד א). בסוף המבחן במועד ב היה מאוד קל והורכב משאלת שיעורי בית יחסית פשוטה, שאלת הוכחה שאיכשהו הצלחתי לפתור כמעט מושלם, שאלה *שלמה* ממבחן עבר של מיכל שנכלל באחד המבחנים שכן עשיתי וזכרתי אותו, ושאלת אינטגרל כפול והחלפת גבולות אינטגרציה שגם הייתה מאוד פשוטה. בתכלס הרגשתי שמיכל ריחמה עלינו (ומאוד שמחתי על כך) אבל הרבה התלוננו שהיה להם קשה אז אני מניח שהיה לי מזל שעברתי בדיוק על הדברים האלו. בסוף קיבלתי ציון ממש גבוה (עשירון עליון) אבל באמת שלא היה מגיע לי ואם הייתי לומדת אצל צנזור קל שהייתי מקבלת 30. המוסר השכל שלי בשבילכם: תעשו שיעורי בית, תשננו משפטים, תעשו הרבה מבחנים מהעבר, תשננו טוב את התרגולים. לאחר מכן, תתפללו לכל האלים שאתם מכירים ותחזיקו אצבעות חזק - מזל משחק פה תפקיד משמעותי. \n\nהשורה התחתונה: קורס כבד מאוד, אבל קשה לתאר איזה כיף זה לשחרר את אנחת הרווחה כשמסיימים איתו. התחושה של לסגור 80 כרטיסיות? אלוהית. תחושת החילול המנטלי שהייתה לך כאשר מאות משפטים מתמטים מזוויעים נחרטו לך בראש במהלך של אונס עצמי מאולץ אך מתוחכם? נעלמת לאט-לאט ומשאירה אחריה חור שחור. החדשות הטובות? מפה אפשר רק לעלות. אם תמלאו את החור השחור בדברים רעים? הוא יישאר חור שחור. אממה, תוכלו למלא אותו גם בדברים טובים. ירוק של טבע, כחול של שמיים, ובגדול כל מה שהוא לא אינפי 2. אני יכול בכנות להגיד לכם שאני נושמת טוב יותר מאז שסיימתי עם הקורס הזה. תחושת הקבס היומיומית נעלמה. אל תתיאשו, גם אתם תגיעו לשם. בת'כלס, הכל עובר.", "timestamp": 1718043410747}]}