{"posts": [{"author": "שגיאת עיגול", "difficultyRank": 2, "generalRank": 1, "semester": "201901", "text": "שם המרצה: איימי נוביק כהן\nחוות דעת - הרצאות: לא מרוצה\nהרגשתי שקורס מעניין מאוד ורלוונטי למתמטיקה שימושית פשוט היה מפוספס לגמרי. המרצה מעבירה את החומר בצורה מונוטונית מאוד, וקל מאוד לאבד את הקשב כי זה מועבר לאט, בכתב קטן, לפעמים תחושה שמדברת ללוח ולעצמה. \nשם המתרגל/ת: איימי נוביק כהן\nחוות דעת - תרגולים: לא מרוצה. חבל שלא הביאו מתרגל אחר כדי לתת זווית ראייה שניה על החומר. \n\nשעורי הבית: זורמים מאוד לדעתי. לא קשים בכלל. \n\nהמבחן: אעה. היה יכול להיות יותר טוב. \n\nהשורה התחתונה: לכו לאלגוריתמים נומריים של מדעי המחשב, קורס ללא זיכוי נוסף ושווה פי כמה מבחינת הרלוונטיות, העניין ואיכות ההוראה.", "timestamp": 1610242229389}, {"author": "uri yakar", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  דים נדב\nחוות דעת - הרצאות: \nמרצה מאוד נחמד וקשוב לסטודנטים,\nלכל הרצאה הוסיף קובץ המכיל את החומר מוקלד באנגלית ונתן דוגמאות בכיתה לכל נושא.\n\nשם המתרגל/ת: ודים דרקץ'\nחוות דעת - תרגולים: \nמסודר ומעלה לכל תרגול את קובץ השקופיות אותן יעביר בתרגול, אבל בתרגול הרגיש כאילו הוא פשוט קורא מהשקופיות ולכן היה קשה לעכוב.\n\nשעורי הבית: \nלפעמים קצת קשים אבל עם שותף טוב לא עמוסים מדי.\n\nהמבחן: \nהמבחן היה מאוד הוגן וכלל שאלות טכניות ותאורתיות\n\nהשורה התחתונה: \nלדעתי קורס לא מאוד מעניין אבל אין כל כך ברירה לעשות אותו.", "timestamp": 1647703964802}, {"author": "פולינום אינטרפולציה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: נדב דים \nחוות דעת - הרצאות: \nהמרצה הכי מלך בעולם. מאוד אכפתי וקשוב, מעביר את ההרצאות באווירה כיפית ועניינית וכל זה בלי לפגוע אף לא טיפה בהבנת החומר מההרצאה.\nבנוסף יש לו גם רשימות של ההרצאות באנגלית.\n\nשם המתרגל/ת: ודים דרקץ\nחוות דעת - תרגולים: \nמאוד אכפתי וקשוב. התרגולים מועברים דרך מצגת שהוא מפרסם כבר מלפני התרגול עצמו ככה שמאוד קל לחזור אל החומר אחכ. \n\nשעורי הבית: מגן.\n6 גליונות לאורך הסמסטר, לוקח זמן לעשות אותם והם לא פשוטים. אם תהיו עם שותף/ה טובים אפשר  בכל אחד מהם יש גם שאלה של מימוש בMATLAB.\n\nהמבחן: \nהמבחן הכי הוגן שהיה לי בתואר. משקף באמת את הנלמד בהרצאות, התרגולים והגליונות ובלי שום נסיון להכשיל או לרמות אותך.\n\nהשורה התחתונה: \nלדעתי קורס מאוד מעניין מבחינת החומר. השילוב של נדב וודים פשוט מעולה, מעבירים את הקורס בצורה עניינית ונחמדה למרות שיש הרבה חומר.\nממליץ לכל אחד שיכול לקחת את הקורס כשהוא איתם.\nללא ספק הקורס הכי טוב שלקחתי בתואר (חוץ ממלגים כמובן)", "timestamp": 1680526276349}]}