{"posts": [{"author": "פולינום אינטרפולציה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: נדב דים\nחוות דעת - הרצאות:\nהמרצה הכי מלך בעולם. מאוד אכפתי וקשוב, מעביר את ההרצאות באווירה כיפית ועניינית וכל זה בלי לפגוע אף לא טיפה בהבנת החומר מההרצאה.\nבנוסף יש לו גם רשימות של ההרצאות באנגלית.\n\nשם המתרגל/ת: ודים דרקץ\nחוות דעת - תרגולים:\nמאוד אכפתי וקשוב. התרגולים מועברים דרך מצגת שהוא מפרסם כבר מלפני התרגול עצמו ככה שמאוד קל לחזור אל החומר אחכ.\n\nשעורי הבית: מגן.\n6 גליונות לאורך הסמסטר, לוקח זמן לעשות אותם והם לא פשוטים. אם תהיו עם שותף/ה טובים אפשר בכל אחד מהם יש גם שאלה של מימוש בMATLAB.\n\nהמבחן:\nהמבחן הכי הוגן שהיה לי בתואר. משקף באמת את הנלמד בהרצאות, התרגולים והגליונות ובלי שום נסיון להכשיל או לרמות אותך.\n\nהשורה התחתונה:\nלדעתי קורס מאוד מעניין מבחינת החומר. השילוב של נדב וודים פשוט מעולה, מעבירים את הקורס בצורה עניינית ונחמדה למרות שיש הרבה חומר.\nממליץ לכל אחד שיכול לקחת את הקורס כשהם מעבירים אותו.\nללא ספק הקורס הכי טוב שלקחתי בתואר (חוץ ממלגים כמובן)", "timestamp": 1680526467551}, {"author": "DFT", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נדב דים\nחוות דעת - הרצאות: די ברורות, ואם יש משהו לא ברור לנדב חשוב לחזור על זה כדי שכולם יבינו. מעביר את ההרצאות באווירה טובה וצחוקים מדי פעם שזה נחמד. אחלה מרצה, מומלץ, אפילו נתן \"מיקוד\" בחומר לקראת המבחן (בעיקר הוכחות שהוא לא ישאל עליהן במבחן). מעלה רשימות באנגלית של החומר אחרי כל שיעור.\n\nשם המתרגל/ת: ודים דרקץ'\nחוות דעת - תרגולים: מתרגל נחמד, מעלה מצגות מסודרות אם כי חלק מהסימונים לא תאמו לגמרי להרצאה שזה קצת בלבל אותי באופן אישי, אבל אם מבינים לעומק רואים שזה באמת אותו דבר כמו בהרצאה. יחסית ברור אם כי לא תמיד, והקצב בעיניי היה קצת איטי מדי וגרם לי לאבד פוקוס. בכל זאת, סך הכל אחלה מתרגל שהתאמץ להסביר דברים בבירור וגם לרוב זה היה ברור.\n\nשעורי הבית: סבירים, גיליון של ~6 שאלות כל שבועיים כולל שאלת קוד רטובה בפייתון. כל גיליון לקח לי בערך יומיים עבודה. היו שאלות מאוד קשות אבל הרוב לא היו כאלו, ובשאלות האלו נעזרתי באחרים.\n\nהמבחן: אחלה מבחן, הממוצע מדבר בעד עצמו. צריך לדעת טוב את ההוכחות שהיו בהרצאה ואת האלגוריתמים הבסיסיים, וכן את השיעורי בית ובמיוחד השאלות הקשות שהיו בהם.\n\nהשורה התחתונה: חובה למתמ\"ח אבל ממליץ לכולם לעשות עם נדב וודים.", "timestamp": 1718439212516}]}