{"posts": [{"author": "sari hleihil", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רום פינחסי\nחוות דעת - הרצאות: המרצה מכנה הרבה אינטואיציה גיאומטרית, אבל זה בא על חשבון הפורמליות, לדעתי שילוב של ההרצאות שלו וקריאת הסיכום של אור שליט מכה את החוויה הכי טובה.\nבסמסטר הזה המרצה לא השקיע בשום צורה בקורס וזה כמובן השפיע שלילית על החוויב שלנו, אבל זה סמסטר הקורונה אז אני לא יכול להשליח מסקנות באופן כללי.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: נחמד, ומדגיש על אינטואיציה, התרגולים רילווטים וחשובים והוא מבהיר את החומר וחוזר בקצרה על ההרצאה וזה לדעתי יוצר קשר חזק ומעצים את התועלת מהקורס.\n\nשעורי הבית: 9 גליונות, לרוב פעם בשבוע אבל לפעמים שבועיים (בתחילת ובסוף הסמסטר)\n\nהמבחן: המבחנים של רום שונים בהרבה משל מרצים אחרים הוא מדגיש הרבה יותר על חישובים, וכמעט 0 הוכחות ובטח לא הוכחות מסובכות ופורמליות, זה לא בהכרח יותר או פחות טוב, אבל צריך להיות מודעים לזה כדי לתרגל בהתאם.\n\nהשורה התחתונה: קורס מדהים, יכול להיות מאוד חישובי או מאוד פורמלי וזה תלוי במרצה, לוקח זמן אבל לא יותר מדי.", "timestamp": 1600772822704}, {"author": "סטודנט מבואס", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: בעייתיות בלשון המעטה. ההרגשה היא שההתמקדות של המרצה היא לא בעיקר אלא בטפל. משרה אווירה לא טובה שבה אנשים מפחדים לשאול שאלות. בשלב מסוים בסמסטר הוא התעצבן עלינו ודי שיבש כמה שיעורים כתגמול. עוד נקודה שחשוב לשים לב אליה היא שהוא לא מוכיח כלום כמעט אלא רק מדבר על ההיגיון המסדר, שזה דבר שיש אנשים שיתחברו אליו יותר ויש אנשים שפחות. אהבתי את אינפי 1, אהבתי את אינפי 2 ובאינפי 3 סבלתי למרות שהוא אמור להיות הקורס הכיף מבין השלושה. גם יש נושאים מהותיים בסילבוס שלא נלמדו\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: חד משמעית הציל לי את הקורס, בלעדיו לא הייתי מחזיק מעמדב\n104295 - חשבון \n\nשעורי הבית: דורשים עבודה ולא תמיד ברמה שסביר לפתור (הייתה שאלה אחת באופן ספציפי שהייתה בלתי סבירה בעליל וסגל הקורסהיו צריך קודם לתת לה הדרכה ואז לצמצם אותה ממקרה כללי לפרטי כשהם הבינו את המצב.\n\nהמבחן: סביר בסך הכל, לא אסון\n\nהשורה התחתונה: ממליץ בחום לחכות לאור שליט כמרצה (גם לא מבין את הטענות שהמבחנים של אור שליט קשים, הם לגמרי סבירים)", "timestamp": 1612369142128}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: \nהרצאות לא מאוד מובנות, באופן אישי אחרי כל הרצאה נעזרתי בסיכום של אור שליט על מנת להבין בצורה טובה את החומר\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמתרגל מצויין משקיע ואכפתי, לפני כל תרגול העלה סיכום תרגול מוקלד\nשעורי הבית: \nשיעורי הבית היו כל שבוע כאשר שאלת חובה אחת בכל פעם, היה עמוס אבל לרוב אם אתה יודע את החומר טוב אז לא לוקח הרבה זמן\nהמבחן: \nהמבחן היה חצי פתוח (שהיה לא מאוד קשה) וחצי אמריקאי מה שלדעתי היה קצת לא הוגן בהתחשב בזה שטעות חישוב נחשבה כטעות מוחלטת (האמריקאי היה משמעותית יותר קשה).\nהשורה התחתונה: \nממליץ על הקורס כי הוא מעניין אבל לדעתי שווה לחכות למרצה שידוע כמרצה טוב וברור", "timestamp": 1613479780318}, {"author": "עוודאאל", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מיכאיל בוליאק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: היה כיף מיעוד\n\nשעורי הבית: היה קשה לא פייר\n\nהמבחן: היה חצי אמריקיאי וחצי שאלות פתוחות, היה קשה מיעוד אם היה טעות בחישוב לא הי הנעים הבכלל\n\nהשורה התחתונה: היה פלגן", "timestamp": 1614015101163}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות:\nלא יודע להעביר את החומר כמו שצריך, מבולגן וקופץ מנושא לנושא, מאוד קשה לעקוב אחריו. התעלם מזמני הפסקות בין השיעורים, וכשהעירו על כך וביקשו שישחרר בזמן להפסקות הוא החליט לשים את כולם על מיוט באופן קבוע ושלא יהיו שאלות. התייחס בזלזול רב לסטודנטים, וההרצאות שלו היו לא נעימות ולא מובנות.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nנקודת האור בקורס הזה. מתרגל מצוין ומסודר, ומכין רשימות מוקלדות לפני כל תרגול. היה ניכר שחשובה לו ההצלחה של הסטודנטים בקורס, ודאג להסביר ולענות על כל שאלה לפרטי פרטים עד שהכל מובן - גם בתרגולים, גם בשעות הקבלה וגם בפיאצה.\n\nשעורי הבית: \nהתפרסם גיליון פעם בשבוע, 15% תקף. שיעורי בית לא קלים ולוקחים זמן, אבל לא נוראיים מדי בדרך כלל. \n\nהמבחן: \nחלק אמריקאי וחלק עם שאלות פתוחות. מבחן לא פשוט, שבעקבות הסמסטר בזום והחשש מההעתקות היה שונה לגמרי מכל מבחן אחר שהועבר אז קשה להתכונן מראש. בוחן הבנה עמוקה של החומר ולא תרגול שאלות באותה התבנית.\n\nהשורה התחתונה: \nקורס עם חומר מעניין שהיה יכול להיות מועבר בצורה הרבה יותר טובה עם מרצה אחר.", "timestamp": 1614185009735}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: העביר את החומר לא טוב. התעכב על הנושאים שלא צריך ולא הרחיב על הדברים הקשים. התנהג אלינו בצורה בריונית ומגעילה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מושלם!\n\nשעורי הבית: לא קשים. הגשה של תרגיל אחד (מתוך גליון) כל שבוע\n\nהמבחן: קשה והמועד ב' קשה מאוד. הממוצע נמוך ולא נתנו פקטור\n\nהשורה התחתונה: קורס קשה ולחכות למרצה אחר", "timestamp": 1615486878460}, {"author": "סטודנט שחשוב לו שהמורה יהיה טוב", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: מיכאל הוא האסון של ההוראה בכללי ושל המתמטיקה בפרט. ברוב הקורס לא ניתנה הוכחה לשום דבר באופן פורמלי וזה משהו שהיה לי מאוד קשה איתו, מצאתי את עצמי מנסה לזכור דברים בעל פה ולא באמת מבין מאיפה הם באו. וגם נוצר מצב שסטודנטים מפחדים לשאול שאלות כי הם לגמרי יכולים להרגיש ״מושפלים״ מהתגובה שתהיה למרצה, ואני באמת לא מגזים.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: הוא המתרגל הכי טוב שלמדתי איתו, נותן המון אינטואציה לחומר וגם מעלה סיכומים מפורטים מאוד לתרגולים. מקווה שהוא יהיה המרצה בעתיד הקרוב מאוד כדי שהוא יציל את הקורס בכללי.\n\nשעורי הבית: קשים אבל פתירים\n\nהמבחן: חצי אמריקאי וחצי פתוח\n\nהשורה התחתונה: תחכו למרצה טוב שמעביר את הקורס כדי שתהנו מהקורס כמו שצריך. אינפי 3 לא קדם לאף קורס (על פי הבדיקה שלי ייתכן שאני טועה) אז ממליץ לקחת חוות דעת על המרצה שמעביר לפני שאתם לוקחים את הקורס (יש קבוצה של מתמטיקה בטכניון שאתם יכולים שם לקחת חוות דעת מסטודנטים)", "timestamp": 1615538514012}, {"author": "..", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: פוליאק\nחוות דעת - הרצאות: הסמסטר עבר מזעזע, בעיקר בגלל האווירה בכיתה שהייתה מאוד לא נעימה בלשון המעטה. \nאבל יש רשימות של פוליאק ושל אור שליט שהן יחסית עוזרות. הפער הוא שמרצים שונים יכולים לשים דגש מאוד אחר על הנושאים הנלמדים בכיתה אז חשוב להבין איך המרצה הנוכחי מעביר את החומר ולא להישען רק על רשימות של מרצה אחר. \n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: ממש אחלה! תרגולים טובים ומושקעים, בא מאוד מוכן ותמיד עונה על שאלות בצורה נעימה. \n\nשעורי הבית: הסמסטר היה צריך להגיש רק תרגיל אחד בשבוע, אז היה מאוד לא עמוס. עם זאת לדעתי חשוב לתרגל יותר מתרגיל אחד במהלך הסמסטר, זה פשוט לא מספיק כדי להטמיע את החומר. אז חשוב לתרגל עצמאית גם אם לא נותנים לכם עוד תרגילים. \n\nהמבחן: מועד א היה די הוגן. \n\nהשורה התחתונה:\nזה קורס עם חומר ממש יפה, אבל מומלץ לעשות אותו עם מרצה שמתחברים לסגנון ההוראה שלו, ושנעים ללמוד איתו כדי להנות כמו שצריך.", "timestamp": 1615799441663}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: רום פנחסי\nחוות דעת - הרצאות: \nנתן לנו לראות הרצאות מוקלטות אשר הוקלטו בסמסטר קודם לכן. הקלטות ברמה סבירה מינוס - גם מבחינת האיכות וגם מבחינת רמת ההוראה. כמות שעות ההרצאה המוקלטות שראינו הייתה גדולה למדי (בערך 6 כל שבוע במקום 4 שעות הרצאה קבועות במערכת).\n\nשם המתרגל/ת: רום פנחסי\nחוות דעת - תרגולים:\nהתרגולים הועברו באופן היברידי כאשר האיכות בזום הייתה ירודה מאוד, בנוסף הוא סירב להקליט את התרגולים בטענה שזה יביא לכיתה יותר אנשים (מה שכמובן לא קרה).\n\nבאופן כללי: הדרך בה הוא העביר את החומר בהרצאות ובתרגולים לפי מה שהבנתי מאוד שונה ממרצים אחרים - הוא מתמקד הרבה יותר בהקשרים הגאומטריים ובחישובים והרבה פחות בהוכחות הפורמליות ובריגורוזיות של התנאים של כל משפט.\n\nשעורי הבית: \nהיו 12 גיליונות (להגשה כל שבוע), בסה\"כ זה היה קצת עמוס יחסית אבל טוב שהיה את ההתנסות הזו.\n\nהמבחן: \nמלא בראיה גאומטרית וטריקים שצריך לעלות עליהם, היה מאוד קשה (ממוצע 50 לפני פקטור) וחבל מאוד שזה ככה, ממש הרגיש כאילו הוא מתנכל אלינו במהלך כל הסמסטר ואז גם במבחן.\n\nהשורה התחתונה: \nלא להתקרב אל רום פנחסי, אפילו אם הראיה הגאומטרית והחישובים הם הדברים שיותר מושכים אתכם.", "timestamp": 1625921226822}, {"author": "מר קומבי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: רום פנחסי\nחוות דעת - הרצאות: הרצאות סבירות\nמוקלטות מראש\nקצת נמרח \n\nשם המתרגל/ת: רום פנחסי\nחוות דעת - תרגולים: \nהתרגולים היו מעניינים אך לא ככ קשורים לקורס\nהמבחן נורא מסתמך עליהם\nמומלץ בקרב לב להגיע\n\nשעורי הבית: קשים במיוחד\nדורשים הרבה מדיטציה\n\nהמבחן: \nדורש הרבה אינטואיציה גאומטרית\nמי שלא רואה את הדברים גיאומטרית יצרך לעבוד הרבה עם הידיים \nסה\"כ יחסית קשה וקיבלנו פקטור של 15%\nהשורה התחתונה: \nרום מרצה לא מוצלח במיוחד\nהיחס מדי פעם מרגיש מזלזל\nאך הקורס עם רום מקנה הרבה כלים גיאומטרים\nחשובים לא פחות \nסה\"כ לא מומלץ במיוחד למי שלא מתחבר לגישה הגיאומטרית", "timestamp": 1626009742270}, {"author": "אין כינוי תרקדו", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רום פנחסי\nחוות דעת - הרצאות: \nרום המרצה הכי מזעזע שפגשתי בטכניון כולו. כותב מאוד מבולגן על הלוח, מסביר בצורה מאוד לא ברורה, מגיע לא מוכן לשיעור, נתקע על דברים לא חשובים\nשם המתרגל/ת: רום\nחוות דעת - תרגולים: פשוט חזר על הדברים שעשה בהרצאות הגרועות שלו\n\nשעורי הבית: כל שבוע, די חופרים, לא מאוד קשורים למבחן\n\nהמבחן: מ-ז-ע-ז-ע. בגדול אם לא זוכרים את הטריקים שהוא לא רושם אז לא מאוד פתיר\n\nהשורה התחתונה:", "timestamp": 1626115170220}, {"author": "דניאל", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: רום פנחסי\nחוות דעת - הרצאות: הרצאות זוועתיות, אינו נכנס להוכחות רק מביא אינטואיציה גיאומטרית, רוב הזמן מתבלבל ובוהה בלוח, הרצאות מוקלטות.\n\nשם המתרגל/ת: רום פינחסי\nחוות דעת - תרגולים: נוראי, לפעמים הוא חוזר על מה שהוא אומר בהרצאות, ואז התרגול פשוט מיותר. ולפעמים הוא יוצר חידות שפותרים בעזרת אינפי 3 (שזה משמעותית יותר מעניין), אבל אז הוא לרוב מנופף בידיים\n\nשעורי הבית: לא פופורציונאליים למה שלומדים בכיתה, אי אפשר לא להגיש אותם כי הם סופר חשובים, אבל הרבה פעמים הוא לא מודע לכך שהשאינטגרלים שהוא נותן לא פתירים בכלל. \n\nהמבחן: המועד הראשון היה זוועה, והממוצע בהתאם. נראה מה יהיה עכשיו עם מועד ב\n\nהשורה התחתונה: לא ממליץ לקחת את הקורס איתו אם אין לכם אהבה לחידות כי זה חלק לא קטן מהקורס.", "timestamp": 1626691726574}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רום פנחסי\nחוות דעת - הרצאות: לא פורמלי בכלל, לא מוכיח כמעט כלום, מאד טכני, מאד שונה מהשאר\n\nשם המתרגל/ת: אין, זה רום\nחוות דעת - תרגולים: \n\nשעורי הבית: בסדר\n\nהמבחן: זוועה. מתנקם בסטודנטים, לא רצה לעשות שעת קבלה לפניי מבחן לטובת הסטודנטים, מתנגד להקליט מתוך עקרון, בדק תעודות זהות לראות שמי שהגיע פרונטלית עבר את המבחן, ממוצע של 50 עם חציון 49, כשהציון הכי גבוה 82, ואין מגן,  לאחר מכן פקטור אחוזים כדי לעזור רק למי עבר\n\nהשורה התחתונה: בקורס הזה אין מבחר מרצים, כולם נוראיים", "timestamp": 1626893327614}, {"author": "קבוצה קמורה", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: \nאני כנראה לא אחדש לכם דבר כי לפי הביקורות עליו הבנתם שהיו מספר בעיות עם המרצה. סמסטר זום - הוא לא אהב את הפורמט, מתישהו גם הפסיק לאשר שאלות מהסטודנטים בבית. יכול להיות שהוא היה מרצה טוב יותר בכיתה פיזית. אבל גם בלי קשרל זום - ההרצאות מבולגנות, כותב ומוחק, ולדעתי גם מסביר לאט מדי ומתעכב לפעמים על שאלות (כשעוד היה אפשר לשאול) זמן רב מדי.\nהקורס חובה אז מה זה משנה אם מומלץ או לא? ככה זה גם נראה באופי הלימוד שלו מטעם המרצה.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמתרגל אגדי. נאמר שאם היה מתרגל את כל הקורסים במתמטיקה ומשאיר אחריו מורשת של חוברות תרגולים מודפסים ומפורטים, אזי היינו יכולים להמליץ עליו להדלקת משואה בטקס יום העצמאות או משהו. בקיצור התרגולים שלו, שהם מפורטים מאוד, מעניינים מאוד ומצביעים גם על קורסים מתקדמים - עזרו ותרמו להבנת החומר יותר מההרצאות אפילו.\nשעורי הבית: \nדרשו להגיש שאלה אחת בשבוע, שאר השאלות תרגול עצמי. אני לא אהבתי את הפורמט הזה וההסבר מפתיע - בגלל שידענו איזו שאלה היא להגשה, אז אני מניח שהרוב פתרו רק את השאלה הזו והתעלמו מהשאר. לבסוף היה צורך להכיר גם את השאלות האחרות, וזה הרבה יורת קשה לחזור ולפתור אותם בזמן קצר מאוד עד הבחינה.\nהמבחן: \nקשה. לא היה מספיק זמן להתכונן, זה היה המבחן הראשון בקורס. זה לא הזיז את הזרת של המרצה. הממוצע יעיד על כך. אבל לפחות לא זוועה כמו שצפיתי בהיסטוגרמה של רום פנחסי.\nהשורה התחתונה: אין מנוס. הקורס אינפי 3 מועבר על ידי 3 מרצים ברוטציה. אף אחד מהם לא יחוס על הסטודנטים במבחנים. אור שליט אוהב לכתוב שאלות ממש קשות. פוליאק לא מעניין אותו שאין זמן להתכונן לבחינה, ניסח מועד ב עוד יותר קשה ממועד א'. ורום פנחסי.. אין מה להוסיף תקראו לבד את הביקורות. נסו לקרוא את התרגולים של רן קירי המלך שהם מוסברים ומפורטים עם אינטואיציה הרבה יותר ברורה איך לגשת לפתור שאלות.", "timestamp": 1627933506265}, {"author": "Jared Goldberg", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: מבולגנות, איטיות, לא ענייניות, ולפעמים דרמטיות וילדותיות. למרצה חסר כל זכר של מקצועיות, אומנם בקיא בחומר אך מעביר אותו בצורה מאוד מעורפל. בנוסף, חובה להדגיש שהוא לא הוכיח כמעט אף משפט בקורס, ועוד יותר חריג: לא הספיק את החלק הכי חשוב בחומר שהוא משפט סטוקס והמשפטים הנלווים לו. אסון\n\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: מאוד משקיע, מאוד איכפתי. אני פחות מתחבר לצורת חשיבה שלו אבל אין ספק שהוא מתרגל מעולה. די הציל את הקורס הזה מבחינת יחס הסגל וגם דאגה להבנת הסטודנטים \n\nשעורי הבית: די רלוונטים בסהכ. \n\nהמבחן: מועדים א וב מזעזעים. שאלות אמריקאיות חישוביות נורא מסובכות אשר התשובות האפשריות כמעט זהות אחת לשנייה ובאות להכשיל ברמה לא סבירה. \n\nהשורה התחתונה:", "timestamp": 1635059268764}, {"author": "מי זה מי זה מי זה", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכאל פוליאק\nחוות דעת - הרצאות: הוא לא מוכיח הרבה ולא ממש ריגורוזי אבל אני מרגיש.ה שלמדתי הרבה.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: לדעתי היא ממש מעולה. קצת מטורללת אבל בסדר\n\nשעורי הבית: 15% מגן. שאלה אחת להגשה מתוך הגיליון שמצהירים עליה מראש.\n\nהמבחן: לא עוד היה. מקווה שלא ידפוק אמן סלה.\n\nהשורה התחתונה: קורס חובה מה יש לעשות. כנראה עדיף מרום פינחסי ממה ששמעתי.", "timestamp": 1644563239357}, {"author": "ג'ורג' גרין", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: בפן האישי - אין על לידיה.\nבפן המקצועי - פעם ראשונה שלידיה מעבירה את הקורס, וזה הורגש. הקורס עובר עם המון מלל (מילים), הרגיש מאוד טכני ולא מה שציפיתי מאינפי 3.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: אמן וגלעד היה מתרגל אותי בכל מקצוע, וגם אחרי התואר\n\nשעורי הבית: הרבה חישובים ומספרים, בלי יותר מדי הוכחות.\n\nהמבחן: דיי הוגן.\n\nהשורה התחתונה: בסוף היה אחלה עם לידיה. אומרים שעם מרצים אחרים זה אבסטרקטי למות - אז אולי זה לטובה.", "timestamp": 1677452844717}, {"author": "שוקובו", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nמאוד חמודה ונותנת יחס אנושי, מצד אחד היא דורשת הרבה מאוד עבודה, כלומר לעשות את כל הוובוורקים וכל העבודות הפתוחות. היא לא מוותרת כמעט על אף הוכחה, אין נפנוף ידיים וכל מה שהיא עושה בהרצאה צריך לדעת למבחן. מצד שני היא ממש טובה במה שהיא עושה, והיא מאוד זמינה לעזור ולשאלות.\n\nשם המתרגל/ת: ליטל שמן\\גלעד סופר\nחוות דעת - תרגולים:\nליטל- היא מבינה את החומר טוב ובוחרת תרגילים דיי קלים כדי לבנות את הטכניקה. מצד אחד אחרי תרגול שלה כנראה לא יהיה לך בעיה להשתמש במשפטים ולעשות את הוובוורק(חשוב!) מצד שני לא יהיה לך שמץ איך לגשת לתרגילים תיאורתים.\nמבחינה אישית אחרי שבוע הבנתי שהיא *ממש* לא בקטע של לעזור מעבר לשעות התרגולים, לא הבן אדם הכי סימפטי בעניי\n\nגלעד- רק השתמשתי ברשימות שלו ואני התרשמתי שהוא ממש משקיע ובוחר תרגילים מאוד טובים. אם הייתי יכול מבחינת מערכת כנראה שהוא מתרגל עדיף, הוא גם עונה על שאלות במייל ומאוד נחמד.\n\nשעורי הבית: \nרק הוובוורק תרמו למגן, לא פשוטים אבל הם חובה כדי לדעת את החלק הטכני של הקורס\nהגיליונות הפתוחים כאמור היו \"רשות\" , היה תרגיל במבחן מהגיליונות הפתוחים אבל גם ככה שווה לעשות אותם בזמן הפנוי.\n\nהמבחן: קשה אבל פייר\n6 שאלות, הראשונה היא הוכחה(או מקרה פרטי) מההרצאה, הבעיה היא שיש 100000 הוכחות ואי אפשר לדעת באמת מאיפה זה יבוא.\nשאר השאלות היו ממש מכל הנושאים שנלמדו אז באמת אי אפשר לוותר על אף חלק.\nהשורה התחתונה: \nקורס קשה אבל אין ברירה אבל אם אפשר עדיף עם לידיה. לפחות תצאו עם הרגשה שאתם יודעים את החומר.", "timestamp": 1677684888734}, {"author": "ferberonix", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ד\"ר לידיה פרס-הרי\nחוות דעת - הרצאות: זו פעם ראשונה שלידיה מרצה בקורס הזה וזה ניכר בהרצאותיה. כבר בהרצאה הראשונה היא אמרה לנו מה הולך להיות מבנה המבחן וכמה שהיא לא אהבה אינפי 1 ואינפי 2 אבל אינפי 3 היא הכי אהבה בתואר. לידיה מאוד חביבה, אדיבה, משקיעה ומוכנה לשבת ולענות לשאלות גם אחרי ההרצאה. מאוד התרשמתי ממנה כמרצה ואין ספק שאם היא תרצה שוב בקורס תחוו אותו עוד יותר טוב מאיתנו. החיסרון האמיתי היחיד הוא שלידיה כותבת המון בהרצאות ומהר יותר ממטוס קרב. אפשר לאבד אותה תוך שנייה אבל היתרון בכך הוא שאתה לומד לכתוב מהר מאוד וזה חשוב ביותר בתואר. בפן האישי חסרון נוסף שהרגשתי הוא שהקורס היה יותר מידי טכני וחסר אפסילונאוטיקה. נדמה ששכחנו לגמרי כמעט מקושי, לגראנז וחבריהם בכת האפסילונים המרושעים. \nאפשר לומר שעשינו פשוט חדו\"א 2 (איכס) שנמרח על יותר זמן עם תרגילים קצת יותר קשים, או כפי שלידיה אומרת, כל החומר שלמדנו בקורסים קודמים ובקורס הזה הוא ברמת \"גן הילדים\".\n\nדעו לכם שהרגע המרגש ביותר בקורס הוא הוכחת המשפט על החלפת משתנים שלוקחת 4 שעות, ו-10 עמודים במחברת. בהצלחה!\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: ליטל מתרגלת לא הכי נחמדה. רואים שהיא מבינה את החומר טוב מאוד אבל התרגילים שלה לא ברמה גבוהה מספיק כלל. יצא לי לעבור על רשימות המתרגל השני (גלעד) ונוכחתי לדעת שהוא משקיען לא קטן (אפילו הופיע תרגיל שלו בבחינה) ובדיעבד היה שווה ללכת לתרגוליו ולא לגברת שמן.\n\nשעורי הבית: לידיה יצרה לנו 11 גיליונות חדשים מ-0 עם תרגילים שלה. פוגשים שם קצת יותר תיאוריה וזה נחמד ביותר ואכן עוזר להטמיע את החומר טוב יותר. מומלץ ביותר לעשות אותם!\n\nהמבחן: הוגן ביותר. הכי הוגן שהיה לי בכל קורסי המתמטיקה עד עתה. אומנם הממוצע נמוך קצת אבל אי אפשר להאשים את לידיה. זה היה מבחן שמתעלם לחלוטין מסוף הקורס (משפטי סטוקס וגאוס) ומהמרחב- Rn והרגיש כמבחן בחדו\"א 2.\n\nהשורה התחתונה: סיום מתוק לקורסי האינפי שכולם כל כך מתעבים ואין לי שמץ של מושג למה. עדיין הכי אהבתי אינפי 2 אבל אינפי 3 חביב ביותר.", "timestamp": 1678054800547}, {"author": "פוביני", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: \nמועברות די טוב בעיניי, מלבד העניין שהיא רושמת מאוד מאוד מהר ונורא קשה לעמוד בקצב. אחרי כמה שבועות ויתרתי והסתמכתי על סיכומים של אחרים, ואז המצב נהיה הרבה יותר ברור.\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nמסבירה טוב מאוד, אבל התרגילים שנעשו בכיתה היו די פשוטים לרוב. קצת מתעכבת לפעמים על דברים לא חשובים כמו חישוב של איזה מערכת משוואות.\nשעורי הבית: \nכל שבוע וובוורק וגיליון של 3-4 שאלות, די עמוס.\nהמבחן: \nכל פעם שלא מצטטים את התנאים המדויקים למשפט ומסבירים בדיוק למה הם מתקיימים יורד ניקוד. חוץ מזה, רוב השאלות לא היו נורא קשות. (במועד א')\nהשורה התחתונה: קורס שהועבר בצורה מעניינת בעיניי אבל עם המון המון חומר וקצב לימוד מהיר בהרצאות, ויחסית עמוס בשיעורי בית.", "timestamp": 1678791308237}, {"author": "דיברגנץ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לידיה פרס הררי\nחוות דעת - הרצאות: לידיה מרצה עם לב ענק. מההרצאה הראשונה ראו שחשוב לה שהסטודנטים יצליחו. מצד שני, זאת היית הפעם הראשונה שהיא העבירה את הקורס ולפי דעתי היא בחרה להפוך אותו למאד טכני מה שגרם שפגע בחווית הלמידה שלי.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: ליטל מעבירה את התרגולים בפעם המי יודע כמה, ככה שהם נוגעים בדיוק בנקודות שהסטודנט הממוצע נוטה להתבלבל. עם זאת, היא לא \"גמישה\" בדרך הפתרון ומסרבת לקבל הצעות שונות מהדרך שהיא תכננה להציג.\n\nשעורי הבית: לא להגשה אבל כן מלמדים. אם כי מאד טכניים.\n\nהמבחן: מההרצאה הראשונה כבר ידענו את מבנה המבחן. לדעתי היה מאד הוגן (כולל שאלת בסגנון שיעורי בית שאם הצלחת ב75% ממנה התווספו 5 נק' בונוס לציון הסופי כמגן) אם כי הבדיקה היית מחמירה וקטנונית.\n\nהשורה התחתונה: אני לא יודע איך הקורס מועבר בדרך כלל אבל ציפיתי ליותר עניין.", "timestamp": 1678818597414}, {"author": "קוף לגרנז'", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רועי משולם\nחוות דעת - הרצאות: מרגיש שהוא באמת מנסה שכולם יבינו, אבל יש לו חסם כשלהו מול קהל ככה שפשוט משלב מסוים של חוסר הבנה לא יכולת להתאפס חזרה, אבל מאוד השקיע בתלמידים\n\nשם המתרגל/ת: ליטל בן שמן\nחוות דעת - תרגולים: מתרגלת מעולה! אמנם מאוד חשוב לה שהשאלות בתרגול תהיינה לא ממש באמצע משפט שלה אבל אם חציתם את המשוכה הזאת קיבלתם מתרגלת מעולה שמסבירה את החומר על הצד הטוב ביותר\n\nשעורי הבית: ליטל פרסמה בכל שבוע כמה שאלות בנושא כאשר רק אחת מהן חובה, לא העמיס מדי והיה מעולה לתרגול\n\nהמבחן: משולם מאוד הוגן ומקפיד לעשות שעות קבלה ושיעורי חזרה לפני המבחן, ועדיין אין למה לצפות שיהיה קל, זה המקצוע\n\nהשורה התחתונה: מקצוע מעניין ומעשיר, חשוב לקחת עם מרצה שמסביר בצורה מרחבית ולא המתמטיקה יבשה", "timestamp": 1689448940391}, {"author": "~", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: רועי משולם\nחוות דעת - הרצאות: רועי בן אדם זהב ואחד המרצים היותר נחמדים ומתחשבים שיצא לי להיתקל בהם. זוכר את השמות של הסטודנטים ומשקיע הרבה. רועי ללא ספק יודע את חומר הקורס מצוין אבל לא תמיד מצליח להעביר אותו לסטודנטים באופן ברור. הרבה פעמים הוא יכול לדלג על הרבה שלבים או לא להסביר מעברים כלשהם, ממליץ להיות חדים בהרצאות ולא להסס לשאול אם משהו לא ברור. הרשימות שלו סבבה, אבל אפילו פחות מפורטות מההרצאות אז אני ממליץ כן להגיע אלא אם אתם ממש עילוי מתמטי.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: ליטל מתרגלת מקצועית מאוד, ואפילו הייתה נחמדה יחסית הסמסטר בניגוד לניסיון העבר שלי איתה (אולי בגלל שהיינו מעט אנשים בכיתה). מומלץ להקפיד על נהלי פנייה במייל ועל נושא ונשוא בשאלות אם לא רוצים לקבל נזיפות. \n\nשעורי הבית: שאלה להגשה כל שבוע ועוד 5 לתרגול עצמי. חלק מהשאלות היו ממש טובות ועזרו להטמיע את החומר אבל חלק נכבד מהשאלות שהיו חובת הגשה דווקא היו ממש מיותרות או לא קשורות לחומר. בנוסף, ליטל מסרבת באופן תקיף לפרסם פתרונות לתרגילי הבית ככה שמאוד קשה באמת ללמוד מטעויות או בכלל לדעת אם הפיתרון שלך נכון בשאלות שהן לא להגשה. לכן, אני חושב שעדיף להגיש רק את השאלות חובה בגיליון ואם רוצים תרגול נוסף במהלך הסמסטר, אז לחפש מבחני עבר או שיעורי בית/תרגילים מתרגולים של סמסטרים שלהם אולי יש פתרונות.\n\nהמבחן: המבחנים של רועי עמוסים בטריקים, אבל החדשות הטובות הן שמדובר באותם טריקים פחות או יותר שחוזרים על עצמם ולכן אפשר ללמוד באפקטיביות ממבחני עבר שלו.\n\nהשורה התחתונה: פה ושם היו דברים מעניינים אבל בגדול לא קורס מרתק במיוחד. החלק של האנליזה הוקטורית הרגיש לי קל יותר מהחלק הראשון (רקע בפיזיקה עוזר). רועי ממש חמוד אבל בסופו של דבר רוב העומס מהקורס היה לעבור פעמיים שלוש על כל הרצאה בשביל להבין מה קרה (בעיקר בחצי הראשון של הקורס).", "timestamp": 1690224152971}, {"author": "0=(F×∇)⋅∇", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nבהרבה הוכחות לידיה עברה על שלבי ההוכחה במהירות רבה, דבר אשר גרם לחוסר הבנה שלה אצל רוב האנשים.\nבלתי אפשרי לעמוד בקצב הכתיבה של לידיה.\nבחלק האינטגרלי קצב ההתקדמות היה איטי במיוחד והפסקתי להגיע בשלב זה להרצאות, אך כנראה כי הרקע בפיזיקה גרם לכך.\n\nשם המתרגל/ת: יואב סנדנר/עמית ויינטראוב/רן קירי\nחוות דעת - תרגולים: \nהייתי אצל יואב תרגול אחד.\nלא היה ברור מה הוא ניסה להעביר, ובעיקר דיבר לעצמו וללוח ולכן הפסקתי להגיע אליו.\nעברתי לעמית שהיה מתרגל בסדר אבל משמעותית טוב יותר מיואב. נטה לפעמים לברוח לאלגברה ב אבל חוץ מזה היה בסדר.\nכשרן חזר מהמילואים, עברתי לתרגולים שלו הבנתי על מה ההייפ.\nהתרגולים הכי ברורים שהיו לי עד עכשיו בתואר, וברור למה רן קירי נחשב למתרגל כ\"כ טוב.\n\nשעורי הבית: \nרוב שיעורי הבית היו הוובוורקים של לידיה.\nהם מאוד ארוכים ומייגעים, ולא מרגיש שנצברת למידה עמוקה מהם, אבל הם 10% מגן אז כדאי לעשות.\nהיו 11 גליונות שבועיים שהם ללא מגן בכלל.\nחלקם היו סבירים ברמה, וחלק מהשאלות לא היו ברורות במיוחד (במיוחד בחלק הדיפרנציאלי).\n\nהמבחן: \nהרמה סבירה, אך העומס של הבחינה מטורף.\nהרגיש כאילו הבחינה לא התאימה לזמן סביר, ואני נאלצתי להגיש אותה רק בסוף תוספת הזמן אחרי שויתרתי על תיקון של 2 סעיפים בבחינה.\nבמבחן לא הורגשה בחינה על ההבנה המתמטית אלא רק חישובים מייגעים וציטוט בלתי פוסק של קיום תנאי משפטים.\n\nהשורה התחתונה: \nקורס שבנוי רע לדעתי, אבל לצערי זה קורס חובה.\nמומלץ לקחת את הקורס עם מרצה שמתמקד בפן התיאורטי יותר, ופחות באינספור חישובים של אינטגרלים משולשים ונגזרות מסדר גבוה.", "timestamp": 1713721815291}, {"author": "יריעה חד צדדית", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מאוד אכפתית ובעלת יכולת הוראה. אך ההרצאות היו בייסקלי חדווא 2 עם קצת הוכחות. לא עברנו כמעט את R3 וכשכן זה היה כהערה צדדית. הוכחות כמעט ולא היו וכשכן עשו הם היו בR2 או R3\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: אלוהים שם את רן להתהלך פה על האדמה כדי שיעזור לסטודנטים והוא אכן עושה זאת \n\nשעורי הבית: \n\nהמבחן: ארוך במידה בלי נסבלת 90% מהקורס היו עם הארכת זמן ולא סיימו את המבחן. עבדכם הנאמן ללא הארכה בקושי הספיק לכתוב את המבחן וגם ככה כנראה היו טעויות מלחץ של זמן ולא היה אפשרות לעבור על המבחן לוודא \n\nהשורה התחתונה: קורס שציפיתי לו רבות. אכזב נורא", "timestamp": 1714672053455}, {"author": "שדה משמר", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: הצד החיובי - לידיה כותבת על הלוח הכל במסודר, ככה שאם מעתיקים / לוקחים סיכומים ממישהו שמעתיק אז נוח לחזור אחר כך על החומר. חוץ מזה היא כתבה את הגיליונות בעצמה אז יש קשר טוב בין מה שנלמד בהרצאה לבין מה שמתרגלים בשיעורי בית. הצד הפחות חיובי - לידיה כותבת מאוד מהר ובכללי הקצב בהרצאות מהיר, ככה שלא קל לעקוב. בנוסף היא נותנת יותר דגש על הצד הפרקטי והטכני של החומר ופחות על הצד התאורטי, ככה שבעיניי ההרצאות לא תמיד היו מעניינות על אף שהחומר עצמו מאוד מעניין. בנוסף היא לא תמיד מוכיחה הכל, וגם כשכן אז ההוכחות שלה בסגנון קצת פחות אינפי קלאסי.\n\nשם המתרגל/ת: יואב סנדנר / רן קירי\nחוות דעת - תרגולים: יואב היה מתרגל בזמן שלמדנו את החלק הדיפרנציאלי של הקורס. התרגולים היו בקצב מאוד איטי והיה לפעמים קשה להתרכז בגלל זה. לא תמיד ההסברים היו כל כך מובנים, והשאלות לא כל כך היו קשורות לשיעורי בית. סה\"כ לא וואו אבל גם נתקלתי במתרגלים פחות טובים. רן תרגל אותנו בחלק האינטגרלי של הקורס, תרגולים מעולים עם שאלות טובות מאוד. ההסברים שלו מפשטים את החומר ובנוסף יש לו רשימות מושקעות מאוד, אם כי לדעתי קצת עמוסות במלל וקשה לקרוא אותן לפעמים.\n\nשעורי הבית: כל שבוע (לפחות) וובוורק אחד + גיליון פתוח. הוובוורקים לוקחים זמן אבל ממש עוזרים להיות על החומר. הגיליונות יותר קצרים, אבל השאלות שם לפעמים קשות יותר ממה שנראה בהתחלה. מומלץ ללכת לשעות קבלה ולוודא את הפתרונות שלכם כי עם לידיה יש שאלת שיעורי בית במבחן שנותנת בונוס יפה.\n\nהמבחן: 6 שאלות, הוכחה של משפט מההרצאה + שאלת שיעורי בית (ממה שהבנתי תמיד יש את זה במבחנים של לידיה), בסמסטר שלנו היא גם הוסיפה שאלה טכנית \"בסגנון וובוורק\" כתחליף לבוחן אמצע וחצי מהניקוד שקיבלתם בשאלה היה מגן. חוץ מזה יש 5 נקודות בונוס למי שעונה נכון על שאלת שיעורי בית, ויש גם ציון מגן על הוובוורקים. כל המגן והבונוסים בסוף מאפשרים להוציא ציון יפה בקורס, אבל המבחן עצמו היה ארוך ולא קל בכלל, וכן היו בו חישובים שגרמו לאיבוד נקודות (כי רובנו לא רובוטים וטועים בחישובים פה ושם).\n\nהשורה התחתונה: חומר מעניין ומגניב, לצערי עבר בצורה משעממת רוב הזמן. מומלץ למצוא מקורות מידע נוספים כדי להצליח להנות מהחומר יותר. מה שכן, תצאו מהקורס עם לידיה כשאתם יודעים לפתור אינטגרלים ולהשתמש בחומר שלמדתם (למי שזה רלוונטי לו להמשך).", "timestamp": 1715684676947}, {"author": "הכופל של לגראנז’", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: לידיה מרצה מאוד טכנית, ומרגיש שאין לה שליטה עמוקה בחומר, בכמה הרצאות שונות מצאנו טעויות שנאמרו ולפעמים אפילו לא תוקנו. משלב מסוים הפסקתי ללכת להרצאות \n\nשם המתרגל/ת: לא הלכתי לתרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: לא עשיתי וובוורקים, גליונות הבית היו ברובם מעניינים\n\nהמבחן: הרגיש די הוגן, בהתאם ללידיה היה מאוד טכני\n\nהשורה התחתונה: קורס שאמור להיות מאוד מעניין ולשבור את הראש בn מימדים והתברר כאכזבה, אולי עם מרצה אחר כן עומד בציפיות", "timestamp": 1716316376377}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: \nמאוד מאוד טכנית לא הוכיחה את הרוב המוחלט של החלק האינטגרלי\nהספיקה את החומר וגם השלמות של אינטגרלים כפולים שלא הועברו באינפי 2\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nמדהים אין מה להוסיף\nשעורי הבית: \nהגיליונות לא להגשה ולא מקשים. הוובורקים אינסופיים אבל כן תורמים לדעת לחשב אינטגרלים\nהמבחן: \nהיה הוגן, הבדיקה הייתה קצת קטנונית אבל בסך הכל הוגן\nהשורה התחתונה:", "timestamp": 1716387585092}, {"author": "אינפיונר", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: בשבילי הן היו מהירות מדי בשביל שאצליח באמת לעקוב כמו שצריך בזמן אמת אבל לידיה מרצה טובה. היא הספיקה הרבה מאוד חומר (כולל השלמות מדברים שהיו חסרים מאינפי 2), ונותנת הרבה דוגמאות כדי להפוך את החומר לקונקרטי. רואים שאכפת לה מהתלמידים ומההצלחה שלהם וניסתה להבין לאורך הקורס מה היא יכולה לעשות למעננו. אנשים אמרו שזה היה קורס מאוד טכני - אני לא הרגשתי את זה וחשבתי שאנשים סתם קשוחים עם לידיה אבל יכול להיות שעם מרצים אחרים זה באמת קורס יותר אבסטרקטי.\nכן היו כמה הוכחות שהיו בהן \"עיגולי פינות\" או דברים שהרגישו קצת מוזרים בלי הצדקה מלאה (יכול להיות שהיא קיימת פשוט היא לא ניתנה לנו).\n\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: מדהים, מומלץ בחום. אין לי עוד מה להוסיף.\n\nשעורי הבית: היו אזור ה11 גליונות פתוחים שלא התקבל עליהם ציון אלא רק משוב למי שהגיש, ועוד לא מעט וובוורקים. אם הייתי עושה את הגליונות לאורך הסמסטר יכול להיות שזה היה מוסיף עומס משמעותי אבל עשיתי רק את הוובוורקים (בגלל עומס בקורסים אחרים) וזה יצא משהו כמו שעתיים-שלוש בשבוע בממוצע. הוובוורקים קצת חופרים לפעמים.\n\nהמבחן: לדעתי הוגן. הייתה שאלת הוכחה אחת, שאלה אחת דומה לשיעורי הבית (שהתקבל עליה גם בונוס של כמה נקודות למי שהצליח לקבל בה ציון גבוה), עוד שאלת סגנון בוחן אמצע (כי התבטל הסמסטר) שגם חלק מהציון שלה הפך למגן, ועוד 3 שאלות. בהחלט היה אופי יחסית טכני למבחן בלי הוכחות כל כך מעבר לשאלת הוכחה.\nכן הלמידה למבחן הייתה קשוחה כי יש בקורס הזה באמת מלא חומר.\n\nהשורה התחתונה: בתכלס לא היה מעניין מדי אבל לדעתי קורס סבבה ובהחלט חשוב (נראה לי) להמשך התואר", "timestamp": 1716490724664}, {"author": "Hello there", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nהיה מאד מעניין ואני נהנתי מכל רגע.\nשם המתרגל/ת: וינטראוב עמית\nחוות דעת - תרגולים: \nאחד המתרגלים הכי טובים שהיו לי בקורסי אינפי עד כו. מבין את החומר לעומק ותמיד מנסה לקשר בינו לבין אלגברה, סופר מעניין.\nשעורי הבית: \nמומלץ מאד לעשות ועוזרים להבין את החומר.\nהמבחן: \nמועד א הוגן מאד עם בדיקה קפדנית.\nהשורה התחתונה: \nקורס נהדר שסוגר את השרשרת של אינפי לפני הקורסים היותר מתקדמים.", "timestamp": 1717303542849}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \n\nמשעמם, אבל מאוד ברור.  \nהייתי רוצה שיהיו יותר הוכחות. \n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \n\nאין מה להגיד, מתרגל מעולה.\n\nשעורי הבית: \nפתירים\n\nהמבחן: \nהוגן מאוד\n\nהשורה התחתונה: \n\nהיה משעמם קצת, למי שמתעניין, לא ממליצה", "timestamp": 1717508746328}]}