{"posts": [{"author": "Noam Ben Moshe", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלכסנדר זסלבסקי\nחוות דעת - הרצאות: \nהיה מאוד לא ברור (כלומר, היה קשה להבין את המילים שהוא אמר). אולי בפרונטלי המצב יותר טוב אבל אני בספק\nשם המתרגל/ת: עידן ורסנו\nחוות דעת - תרגולים: \nהתרגולים טובים מאוד. למדתי רק מהם במהלך הסמסטר וזה הספיק. עידן אחלה מתרגל, מסביר טוב ועונה על שאלות.\nשעורי הבית: \nשש גיליונות בסך הכך\nהמבחן: \nממוחזר משנים קודמות.\nהשורה התחתונה: הקורס די משעמם. אפשר להוציא בו ציון טוב בקלות בלי יותר מידי השקעה במהלך הסמסטר אם לומדים לפני המבחן כמו שצריך", "timestamp": 1626631906957}, {"author": "רם הנדסת מכונות", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ד\"ר אלכסנדר זסלבסקי\nחוות דעת - הרצאות: \nהמרצה מעלה את הרשימות הרצאה שלו למודל,אז לא חייבים לבוא להרצאות\nשם המתרגל/ת: ד\"ר ודים דרקץ'\nחוות דעת - תרגולים: \nמתרגל תותח על יש לו מצגות מסודרות ומאורגנות עם החומר התיאורטי ותרגילים שדומים לתרגילים הטכניים שיש במבחן.\nתכלס הידע שלי מהקורס התקבל רק המתרגולים\nשעורי הבית: \nיש 6 גיליונות שלוקחים את ה5 הגבוהים ,שהם מהווים 10 אחוז מגן.\nאפשר לא לעשות שיעורי בית בכלל,אבל אז לומדים פחות מהקורס לפי דעתי.\nרוב הגיליון ממוחזור מידי פעם יש שאלה חדשה אבל לא קשה מידי.\nהמבחן: \n70 נקודות שאלות טכניות שאני יכול ללמד את סבתא שלי לפתור ב3 ימים(בוא נגיד שסבתא שלי במתמטיקה ברמה של תיכוניסט עם 5 יחידות)\n30 נקודות שאלות הוכחה סופר ארוכות וקשות שלוקח המון זמן לשנן(מומלץ שבוע לפחות,אני אישית למדתי חודש וחצי הוכחות מספר הקורס ומרשימות של המרצה אבל אני רציתי 100 לא משנה מה הוא נותן בשאלות הוכחה)\nהשורה התחתונה: \nאופטימיזציה זה תחום עם ישומים רבים מאוד כמו: רובוטיקה,בקרה,תורת המשחקים,למידה עמוקה,כלכלה,חקר הביצועיים ועוד...\nלכן הידע מהקורס הזה חשוב למהנדסים ולא רק למתמטיקאים.\nהקורס לא דורש הרבה במהלך הסמסטר,ומי שרוצה להוציא בין 55 ל70 מספיק לו שלוש ימים למבחן ופיניטו.\nמי שרוצה להוציא  בין 70 ל100 בוודאות זה דורש השקעה גדולה לפני המבחן של שינון ולמידה של הוכחות ולא התמודדתי עם אתגר מהסוג הזה מאז קורסי היסוד של סמסטר ראשון (חדוא1\\אינפי1) וכמובן שההוכחות יותר קשות ויותר ארוכות כי זה קורס של סמסטר 4 בפקולטה למתמטיקה.", "timestamp": 1657569546073}]}