{"posts": [{"author": "Arex 36", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: גרשון וולנסקי\nחוות דעת - הרצאות: ממש משעמם\n\nשם המתרגל/ת:  ערן אגרא\nחוות דעת - תרגולים: מלא טעויות בסיכומים לא הצלחתי להקשיב שנייה בלייב\n\nשעורי הבית: לא ברורים, היה תקף, הבודק קטל\n\nהשורה התחתונה: החומר כן מעניין וחשוב, נפלתי על סגל פח....", "timestamp": 1612349127326}, {"author": "אא", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעמוסות בטירוף, המרצה רץ על החומר תוך הנחה שכולם סיימו אתמול אינפי 2 ו 3 , מטרו וחבורות בהצטיינות למרות שרק אינפי 2 הוא קדם. כמות החומר הנוספת לכל מה שציינתי היא עצומה. הסיכום של המרצה היה כמעט 200 עמודים .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמסביר מעולה, מעלה פתרונות לשיעורי בית ורשימות התרגולים טובות אבל מגזים עם השיעורי בית \nשעורי הבית: \nעמוסים מאד לוקח יום יומיים לגיליון(לסטודנט ממוצע) וזה סהכ קורס של 3.5 נקז \nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644225131072}, {"author": "Jared Goldberg", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: מעט לא מסודרות לשם שינוי עם רון, אבל החומר עבר בצורה מספיק טובה גדי לקבל את מה שצריך לקבל. הבנתי שלרון היו קצת בעיות אישיות, וצריך לקחת בחשבון.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מאוד פופולרי, ואכן בקיא מאוד בחומר וכן משקיע המון בתקפקידו. לדעתי הוא לעטים קרובות בוחר תרגילים לתרגולים וכן לשיעורי בית שקצת לא רלוונטים - זה לרוב בגדר \"העשרה,\" וזה בא על חשבון לתרגל את החומר. סך הכל אבל הוא מתרגל טוב.\n\nשעורי הבית: שוב, לעטים קרובות יש בהם דברים שהם תכלס העשרה, אבל היו סבירות ורלוונטיות גאשר לא היה ככה. \n\nהמבחן: מאוד הוגן. אף שאלה לא הייתה מתקילה או עם טריקים מגעילים. גם מעט לא אפייני למרצה. \n\nהשורה התחתונה: קורס מאוד חשוב שהועבר קצת עקום אבל בסה\"כ מספיק טוב.", "timestamp": 1647436084578}, {"author": "Cauchy", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: \nיש קצת אווירה טובה וצחוקים, וגם הוא מסביר לא רע. הכתב לא הכי ברור והסדר על הלוח לא הכי-הכי אבל סה\"כ סבבה של הרצאות.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nהשם מדבר בעד עצמו, אבל האמת שלי אישית לפעמים קשה לעקוב אחריו, היה ככה בחלק מהקורס הזה וגם בחלק מאינפי 2. מתרגל משקיען וסה\"כ טוב מאוד אבל אני לא תמיד הצלחתי להיות איתו במשך כל השיעור.\nשעורי הבית: \n5 תרגילי בית לאורך כל הסמסטר כשהיה צריך להגיש 4, די פנאן.\nהמבחן: \nלא נורא, 6 שאלות מתוכן סעיף שהיה די דומה להוכחה מהכיתה. קחו קורסים עם רוס כי הוא מחבר מבחנים פתירים ביותר.\nהשורה התחתונה:", "timestamp": 1678795258831}, {"author": "קושי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: איליה \nחוות דעת - הרצאות: \nאיליה מרצה מעולה ! הוא עושה הרבה מאוד בשביל הסטודנטים שלו - 3 שעות חזרה על החומר לפני המבחן למשל בסמסטר שלנו. משתדל להביא את ההסברים וההוכחות שיהיו הכי נגישים וקלים לסטודנטים להבין. באמת נותן הרבה מעבר.\nכן צריך לציין שהכתב שלו על הלוח לא תמיד ברור וקצת קשה לעקוב בהרצאה ככה אבל מעבר לזה באמת מרצה מעולה.\n\n\nשם המתרגל/ת: יובל \nחוות דעת - תרגולים: \nתרגולים טובים מאוד. גם מעלה סיכומי תרגולים מוקלדים לאתר, כך שנוח להשלים \n\nשעורי הבית: \n5 גיליונות היה לנו הסמסטר מתוכם צריך להגיש 3 בשביל לקבל את המגן.\nמתחילים קל ומהר מאוד הופכים לקשים מאוד. מובאים מתוך ספר לימוד בנושא, קשה להבין את הרפרנסים באינטרנט (אם יש בכלל) והרמה גבוה מאוד ! יותר גבוה מהמבחן.\n\nהמבחן: \nיש בוחן אמצע בקורס בנוסף למבחן. שניהם היו מאוד הוגנים. איליה הוא מהמרצים הבודדים בפקולטה למתמטיקה שמחברים מבחנים הוגנים ולא מצפים מסטודנטים להמציא את הגלגל במהלך בחינה של 3 שעות - מה שהוא שלימד זה גם מה שהוא שואל.\n\nהשורה התחתונה: קורס שהעומס העיקרי נובע משיעורי בית לא קלים בכלל. מעבר לכך המבחן והבוחן אמצע הוגנים בהחלט ונהניתי מאוד מהאווירה בכיתה והיחס של הסגל", "timestamp": 1691480326224}, {"author": "אסקולי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אריאל רפפורט\nחוות דעת - הרצאות: \nמאוד שבלוניות,נכנס לעומק של כל הוכחה, חשוב להחזיק ראש במהלך ההרצאות.\nשם המתרגל/ת:יובל יפרח במהלך רוב הסמסטר,רן קירי בתרגולים האחרונים \nחוות דעת - תרגולים: \nרן מדהים כהרגלו,אצל יובל ראינו תרגילים שלפעמים היו לפני ההרצאות או שאלות שחצי קשורות שלא כל כך עזרו להבנה\nשעורי הבית: \nסבירים ועוזרים\nהמבחן: \nשבלוני בדיוק כמו מבחנים של אריאל\nהשורה התחתונה: נחמד מאוד,דיי קשה", "timestamp": 1713190992175}, {"author": "ציקלו-הקסן חוף מתקפל", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אריאל רפפורט\nחוות דעת - הרצאות: לא הייתי פיזית, רשימות מפורטות ונהדרות, אבל באנגלית\n\nשם המתרגל/ת: בהתחלה יובל משהו, ואז רן קירי, יובל היה מתרגל סביר מינוס, רן קירי ממש טוב, חבל שהיו רק שני תרגולים\n\nשעורי הבית: השיעורים שכתב יובל היו מבולבלים ולפעמים שאלו על דברים שעוד לא למדנו, בקיצור לא הכי טובים, תרגילי הבית של רן היו מעניינים ואשכרה פיתחו את המחשבה\n\nהמבחן: מראש נשלח מייל מדויק עם מבנה המבחן, דבר שהקל על הלמידה\nהיה מבחן מאוד שינוני - 40 נקודות של רק לצוטט במדויק הגדרות ומשפטים, ולאורך כל המבחן נדרשנו לצוטט במדויק כל משפט בו השתמשנו, עם זאת גם היו 3 שאלות נכון/לא נכון עם פירוט, שבדקו הבנה של החומר.\n\nהשורה התחתונה: הקורס הועבר סבבה, החומר עצמו ממש מרתק ולפעמים מרגיש כמו קסם, ממליץ בחום על הקורס!", "timestamp": 1716320682984}, {"author": "קושי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אראל רפפורט\nחוות דעת - הרצאות: אחלה, קצת מונוטוני ומשעמם והיה קשה ללמוד איתו 3 שעות בלי להירדם אבל הוא מסביר טוב ויש לו רשימות \n\nשם המתרגל/ת: יובל ורן\nחוות דעת - תרגולים: יובל מזעזע!!! באמת המתרגל הכי גרוע שהיה לי. רן הגיע מהמילואים רק בסוף הסמסטר אבל כמו תמיד רן מעולה!! ודאג לנו לשיעור חזרה מעולה לפני המבחן\n\nשעורי הבית: עשיתי רק את שיעורי הבית שיובל כתב שהיו לא רלוונטים לנלמד ומזעזעים!!! בכתב יד לא ברורר!! אפילו לא התאמץ לכתוב שורות ישרות היה כותב עקום! רן נתן שני גליונות בסוף שעשיתי רק כלמידה למבחן והם היו סבבה\n\nהמבחן: הוגן מאוד, הוא פירסם את המבנה במדויק לפני המבחן\n\nהשורה התחתונה: סבבה מה אני אגיד, אם רן היה מתרגל מהתחלה כנראה שדעתי על הקורס הייתה קצת יותר חיובית", "timestamp": 1716983833222}]}