{"posts": [{"author": "Daniel Leza", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ' רון אהרוני\nחוות דעת - הרצאות: מסביר אינטואיציה היטב, לא מאורגן כל כך בהוכחות, אדם מאוד נחמד, בנוסף איכות הסאונד בזום (תקופת קורונה) לא הייתה כל כך טובה אבל זה לא קשור למרצה\n\nשם המתרגל/ת: אלן לאו \nחוות דעת - תרגולים: מסביר טוב, קבצי התרגול מסודרים וכתובים היטב\n\nשעורי הבית: מצוינים, גם בודק התרגילים היה מעולה\n\nהמבחן: לא ניגשתי עדיין למבחן\n\nהשורה התחתונה: נהניתי מהקורס, מומלץ", "timestamp": 1614002711606}, {"author": "זבוב על הקיר", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אמיר יהודיוף\nחוות דעת - הרצאות: \nלאמיר יש גישה מיוחדת להעביר את החומר, הוא מאוד עוסק בלתת אינטואיציה וההוכחות הם מאוד ציוריות, הדרך שלו להגדיר לפעמים יותר קלה להבנה אבל לאו דווקא מדוייקת\nסך הכל מרצה מאוד נחמד, מעלה את כל המצגות לפני השיעור\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: \nאחלה מתרגלת, ממש אישה נחמדה וגם מסבירה מעולה את החומר. השאלות בתרגול מאוד רלונטיות לשאלות במבחנים\n\nשעורי הבית: \nלא להגשה אבל מאוד ממליץ לעשות כחזרה לפני המבחן\n\nהמבחן: \nקשה, בעיה מאוד קשה של מבחני עבר ללמוד מהם- חסרים פתרונות\n\nהשורה התחתונה: לעשות רק עם אוהבים חידות מתמטיות", "timestamp": 1627220900646}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רועי משולם\nחוות דעת - הרצאות: מעביר את החומר בצורה מאוד טכנית ולא מעניינת, המון נוסחאות וחישובים ארוכים במקום אינטואיציה.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: התרגולים עצמם בסדר אבל ההתנהלות לא. מתעלם ממיילים, ולא עשה שעת קבלה לפני המבחן למרות המון בקשות מסטודנטים.\n\nשעורי הבית: סבבה.\n\nהמבחן: קשה, חבל שאין דף נוסחאות.\n\nהשורה התחתונה: עם הסגל הזה הקורס היה קשה, אבל יכול להיות יותר מעניין ונחמד בכללי.", "timestamp": 1644054965499}, {"author": "מעיין", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  רועי משולם\nחוות דעת - הרצאות:  \nלי היה מאוד קשה בהתחלה, להבין את הראש, את ההוכחות, את הדרך ה \"פורמלית\" ...\nבמבט לאחור, אני חושבת שחלק מהדברים יכלו להסביר בטיפה יותר ממשיות כך שיהיה קל להבין, אבל בכל זאת, רועי מרצה טוב והציון שלי הוכיח שגם אם בהרצאות לא מבינים הכל , אפשר להגיע לתוצאות טובות!\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nחייבת לומר שבהתחלה גם כן היה קצת קשה, אבל סתיו באמת עזר ממש, שעות הקבלה שלו הצילו אותי ואיכשהו הוא ידע להסביר לי ולרב הצלחתי להבין אותו...\nבלעדיו הקורס היה חד משמעית נראה אחרת!!\n\nשעורי הבית: אני עשיתי אותם לרב עם עוד אנשים כך שלא היה קשה, אבל מי שמתמודד איתם לבד לדעתי הם לא קלים אבל שווים ממש את המאמץ...\n\nהמבחן: אני באמת הופתעתי לטובה, רועי נתן כמה שאלות \"מתנה\" כי הן חזרו המון במבחנים שלו אבל עם זאת הייתה שאלה אחת לא מובנת בכלל ומוזרה קצת... \nתמיד יש שאלות קלות אבל בכל זאת תמיד גם יש את השאלה או השאלות שהורסות הכל... \n\nהשורה התחתונה: \nהנוסחה שלי שעבדה יפה כדי להצליח היא: להכנס לשעות הקבלה, לא לוותר על שיעורי הבית, לעבור שוב לפני המבחן על ההרצאות, ולפתור מבחנים של המרצה! \nאם תעשו את אלה ותתאמצו אתם תצליחו לגמרי... (ואל תזלזלו בקורס, הוא לא כזה קל)", "timestamp": 1644586840817}, {"author": "THE MOGDOM", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון הולצמן\nחוות דעת - הרצאות: רון מרצה יחסית לאט אז זה מאוד עוזר לעקוב אחריו בזמן ההרצאה, חבל שאין שום דרך אחרת לראות את ההרצאות מלהגיע פרונטלית אבל רון הוא הקומבינטוריק\nנ.ב הוא עשה 2 מאמרים עם ארדש מהמשפט ארדש סקרש\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: אחלה מתרגל, אין ממש מה להרחיב\n\nשעורי הבית: לפעמים הם היו ממש קשים ולפעמים הם היו לגמרי בסדר\n\nהמבחן: עוד לא היה אבל יש לי תחושה שרון הולצמן יכתוב אותו במצב רוח קרבי\n\nהשורה התחתונה: כל מפה אפשר לצבוע ב4 צבעים", "timestamp": 1657565845543}, {"author": "עידו ראובן", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רון הולצמן\nחוות דעת - הרצאות: רון מרצה מעולה, הוא מסביר לאט וברור, ולמי ששם לב יש לו גופן אחיד בכתב. בכל מקרה הוא מצליח לשמור על העניין בחומר לאורך הסמסטר, מראה הוכחות לשאלות מורכבות עם תוצאות לא כלכך טריוויאליות (לא טריוויאליות בעליל)\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: הוא מוכיח הרבה משפטים שקשורים להרצאה של אותו שבוע. בשורה התחתונה הוא מתרגל טוב, אבל יש לו בעיה שהוא עושה קפיצות לוגיות בהוכחות ואחרי זה מאוד קשה להבין את הכוונה שלו. מומלץ לעקוב אחרי דרך הפעולה שלו (לעומת שכתוב חסר מודעות למחברת) ולעצור אותו על כל פיפס לא מובן בזמן אמת.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1665230030743}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רון הולצמן\nחוות דעת - הרצאות: \nמרצה מדהים\n\nשם המתרגל/ת: סתין ברמן\nחוות דעת - תרגולים: \nמבין מאוד את החומר ויודע להסביר, הרגיש שזרק על זה אבל\n\nשעורי הבית: \nלא סוף העולם בכלל, בדיקה עמוקה שזה נחמד. חשוב לעשות על מנת להפנים את החומר\n\nהמבחן: \nהוגן\n\nהשורה התחתונה: \nפשוט עוד קורס", "timestamp": 1665405181785}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רון הולצמן\nחוות דעת - הרצאות:\nהרצאות מאוד מעניינות, רון מרצה יחסית לאט, אך זה יכול לעזור להבין מכיוון שהוא מנמק ומסביר באופן ברור כל מעבר.\nאפשר להרגיש שהוא מאוד נהנה להעביר את החומר בהרצאות ושהוא אוהב את מה שהוא עושה, ואני מרגיש שזה עוזר לו להיות מרצה מצויין.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים:\nמתרגל טוב, עונה על השאלות ומעלה רשימות.\n\nשעורי הבית: \nסבבה, יש יותר קלים ויותר קשים אבל כולם ברמה הוגנת.\n\nהמבחן: \nהוגן\n\nהשורה התחתונה: \nקורס שלמרות שאין בו המון חומר, יכול להרגיש מלא בחומר בגלל שהוא שונה מאוד ממה שלומדים בקורסים אחרים, מאוד נהניתי.", "timestamp": 1666702912711}, {"author": "*", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רון הולצמן\nחוות דעת - הרצאות: \nרון מרצה מדהים, מסביר לאט וברור חבל מאוד שהוא פורש כי הייתי מאוד רוצה לקחת איתו קורסים נוספים.\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nלא משקיע בתרגולים, קצת אפאטי לסביבה וקצת הרס מהיופי של הקורס הזה לטעמי.\nשעורי הבית: \nלא פשוטים אבל מעניינים, לשים לב שהם לא תואמים את המבחנים יותר מדי אז צריך לא לפתור רק אותם ולחשוב שיהיה טוב.\nהמבחן: \nזה היה המבחן הראשון בטכניון אצלנו עד כה שהיה שעתיים וחצי, לדעתי היה חשוב להבהיר את זה מראש כי הרבה מאוד אנשים התייחסו למבחן כאל 3 שעות וזה גרם לתכנון לקוי של הזמנים.\nהשורה התחתונה: \nקורס מדהים, התוכן שלו יפה מאוד ולא ייעשה יותר עם הולמן וחבל שכך.", "timestamp": 1666768243684}, {"author": "סטודנט כלשהו", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רועי משולם\nחוות דעת - הרצאות: \nההרצאות באמת ממש מעניינות, אבל לא להמעיט בקורס - זה לא קורס קל בכלל. ממש קשה להיתרגל לדרך החשיבה. באמת לדאוג שאתם מבינים כל שלב שרשום בהרצאות.\nשם המתרגל/ת: עומר מויאל\nחוות דעת - תרגולים: \nהתרגולים מהנים, מובנים, ברורים, לא לפחד לשאול שאלות - זה רק מבורך. כל מה שמועבר בתרגולים מופיע בתרגילי בית אבל לא להיסתמך רק עליהם מבחינת חומר - כי במבחן מופיעים דברים גם מההרצאות!\nשעורי הבית: \nעוברים על כל דבר שלומדים, מאוד מקיפים ובסגנון המבחן הסופי. לא קלים, לא קשים. תמיד יש או טריק נחמד לעלות עליו או עבודה שחורה. סה\"כ בין שעתיים ל4 שעות של עבודה - עבור התרגילי בית הקשים יותר.\nהמבחן: \nלא מבחן קל, אבל בהחלט מבחן הוגן. 5 שאלות - כולן על נושא שונה, ותמיד יש לפחות נושא אחד שחוזר על עצמו כל שנה. אין שם משהו מפתיע. המבחן באמת לרוב בסגנון של שנים קודמות - אז מומלץ לפתור אותם.\nהשורה התחתונה: \nלא קורס קל - אבל באמת מעניין. תדאגו לבוא לשעות קבלה, להרצאות, לתרגולים, להכל. לשאול תמיד שאלות אפילו אם זה \"שאלה דפוקה\" או \"אני אחזור על זה בבית\" - פשוט תשאלו ותהיו בטוחים שהבנתם ושלא תצטרכו לסגור פערים - כי זה כמעט בלתי אפשרי.", "timestamp": 1678023340841}, {"author": "מישהו", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: חיים אבן זוהר, מוקלט רון הולצמן\nחוות דעת - הרצאות: \nאני לא נהנתי מההרצאות, לדעתי היו עמוסות בחומר ומסורבלות, הקצב טיפה מהיר. למדנו דברים שלא הופיעו במבחנים משנים קודמות והיו מעט מאוד תרגילים עליהם ואם אני זוכר נכון לא היה תרגול עליהם. \n\nשם המתרגל/ת: עומר מויאל\nחוות דעת - תרגולים: מדהים. מעביר את החומר בצורה מעניינת עונה לכל השאלות ועושה תרגילים שמופיעים אחרי זה בתרגילי הבית\n\nשעורי הבית: קשים, אבל מכינים אותך למבחן..\n\nהשורה התחתונה: 5/10, קורס עם עליות וירידות.", "timestamp": 1688568297219}, {"author": "שם או כינוי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רועי משולם\nחוות דעת - הרצאות: לא הבנתי את החומר מהמרצה. בהרצאות הוא תמיד דיבר לתוך הלוח ולא דיבר עם הכיתה בכלל, עבר על הכל ממש מהר ופשוט לא היה מובן. הייתה הרצאה אחת שהוא ניסה לחשוב על איך להוכיח משהו במשך 20 דקות. אני לא מגזים, במשך 20 דקות הוא עמד שם וניסה להוכיח משהו ולא הצליח. לדעתי אם הוא היה מגיע עם הערות ברורות לגבי מה שהוא רוצה ללמד בהרצאה זה היה עוזר לו, וגם לנו.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: מרצה תותח. בגללו הבנתי את החומר. מסביר עם מלא אנרגיה, ונותן מלא דוגמאות טובות. באמת המתרגל הכי טוב שהיה לי עד עכשיו, הוא לבד עשה שהקורס יהיה מובן.\n\nשעורי הבית: היה גליון כל שבוע, אבל הגליונות לא קשים ולרוב הייתי יכול לפתור אותם תוך שעתיים כזה.\n\nהמבחן: השנה היה מבחן יותר קל בהרבה מהממוצע\n\nהשורה התחתונה: קורס שיכול להיות מעניין, אבל אם לוקחים אותו צריך לוודא שזה עם מרצה אחר כי רועי פשוט לא היה מובן.", "timestamp": 1715356207327}]}