{"posts": [{"author": "Dotan Tobol", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גדי אלכסנדרוביץ'\nחוות דעת - הרצאות: \nמרצה מעניין, נותן קונטקסט לתרגולים וגם מראה כל אלגוריתם בקוד פייתון שקל להבנה ונחמד לראות\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: \nעדי מקסימה, מעבירה את החומר לפעמים לאט מדי אבל בצורה מעמיקה ומוודאת שכולם מבינים\nשעורי הבית: \nגיליון בערך פעם בשבוע, רוב התרגילים סבירים או קלים, חשוב לעשות\nהמבחן: דומה לשנים שעברו ושם דגש על חשיבה\n\nהשורה התחתונה: אחלה מרצה ומבחנים הוגנים", "timestamp": 1626704686220}, {"author": "OG", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גדי אלקסנדרוביץ\nחוות דעת - הרצאות: \nהחומר בהרצאות מאוד משעמם, היו הרבה הוכחות מאוד ארוכות שהרגישו מאוד מיותרות; גדי עזר יחסית להבין את הרעיון הכללי של האלג' לפני כל ההוכחות הארוכות אז אפשרי לא להקשיב לגמרי (אך עדיין לשים לב מה הולך) ולהבין את רוב החומר\nשם המתרגל/ת: עדי וולף\nחוות דעת - תרגולים: \nפורמט התרגולים השתנה פעם או פעמיים במהלך הסמסטר אבל הם היו מאוד יעילים, לקראת סוף הקורס היה חומר בתרגולים שלא העובר בהרצאות לכן היו חשובים גם כן.\nשעורי הבית: \n6 גליונות לא קשים מידי ברובם אפשר היה לעשות אותם בזוגות, ממליץ לעבור ולדעת לפתור גם אם בוחרים לא להגיש כי יש שאלות דומות לפעמים במבחן (הייתה אחת לפחות כזו אצלנו)\nהמבחן: \nמבחן קל יחסית 2/3 שאלות דומות לשיעורי בית, שאלה שמאוד דומה לשאלה מהתרגול ולפי איך שזה נראה (לפני קבלת הסריקות יכול להיות שאני טועה) הבדיקה גם הייתה רחמנית\nהשורה התחתונה: \nקורס חמוד, הרצאות מאוד מעייפות.", "timestamp": 1627313103800}, {"author": "Dotan", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה:  גבי אלכסנדרוביץ'\nחוות דעת - הרצאות: מושלם, ממש מעניין ודאג לגבות כל אלגוריתם עם קוד בפייתון שנוכל להריץ\n\nשעורי הבית: גיליונות הוגנים שעוזרים להבין את החומר\n\nהמבחן: קליל, צריך לדעת את כל החומר לעומק\n\nהשורה התחתונה: אם הוא מעביר את הקורס ממליץ בחום", "timestamp": 1640181412520}, {"author": "דייקסטרא", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חיים אבן זוהר\nחוות דעת - הרצאות: חיים מאוד לא מסודר ומאוד היה לי קשה לעקוב אחריו. הוא הפך את הקורס  להרבה יותר עמוס וקשה ממה שאמור להיות קורס של 3.5 נקז. \n\nשם המתרגל/ת: סבה\nחוות דעת - תרגולים: \nמזעזע. ההספק בתרגולים מאוד נמוך והוא נוטה להיות מאוד מבולגן. אני לא מרגיש שהתרגולים תרמו לי במשהו.\n\nשעורי הבית: לא סבירים בעליל. בשום קורס שעשיתי בתואר לא נתקלתי בגליונות כל כך ארוכים וקשים(אחד הגליונות לקח לי 30 עמודים!). חיים לא מודע לרמה של השאלות אותן הוא כותב וזה הופך את הקורס להרבה יותר עמוס ממה שהוא צריך להיות באמת. כמו כן סבה בדק את הגליונות בצורה מאוד מחמירה והוריד הרבה מאוד נקודות על שטויות, כך שהמגן על הגליונות לא היה גבוה במיוחד.\n\nהמבחן: לא פתיר כמו הגליונות.\n\nהשורה התחתונה: לעשות אלגוריתמים 1 של מדמ\"ח אם אפשר. אם לא, אז עדיף לעשות את הקורס עם סגל אחר.", "timestamp": 1657401303386}, {"author": "---", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חיים אבן זוהר \nחוות דעת - הרצאות: החומר של הקורס מעניין ברמות , ומי שמתעניין באלגוריתמיקה יאהב את הקורס הזה גם.\nלגבי חיים, בחור נחמד, אבל לדעתי (וזו דעתי בלבד, יש שיחלקו עליי) , לא קיבלנו מספיק הבנה בחומר מחיים , הוא לפעמים מתעצל לכתוב דברים על הלוח ולכן הוא אומר את הדברים בעל פה, תכתבו כל דבר כזה/ תבקשו בכל זאת שיכתוב על הלוח , הוא שואל על הדברים האלה אחכ בשאלות בגליון ואם זה לא יהיה כתוב אתם תשכחו את זה כמעט בטוח.( ואלה תמיד התרגילים היותר קשים ) \n\nחוות דעת - תרגולים: סבה (וסבולד רקיטה) \nסבה בחור נחמד מאוד, אבל הוא קצת רץ מהר מדי לפתרון ולא נותן מספיק אינטואיציה, במכלול אין לי יותר מדי טענות נגדו , הוא היה הוגן מאוד כלפינו בקורס במהלך הסמסטר . קצת עקשן עם הבדיקות שלו אבל סהכ סביר והגיוני.\nתפקידכם כסטודנטים בקורס זה לבקש דברים שיעזרו לכם במבחן, תדרשו ממנו שיפרסם לכם את התרגול מוקלד/כל דבר שיעזור לכם להבין את החומר בצורה יותר טובה, אתם לא מבינים כמה זה יעזור במבחן.\n\nשעורי הבית: אני לא אגזים אם אומר שהיו שם שאלות בלתי פתירות, ברמה שכמה ימים לפני המבחן ועדיין חלק מהשאלות בגליון 1 ו -2 על גבול הבלתי אפשריות( אבסורדי לחלוטין), תפיסת העולם של חיים היא שאנחנו צריכים לעבוד קשה ולשבור את הראש,  אפילו שעתיים שלוש על *סעיף* בגליון(כשיש לפחות 2-3 כאלה בגליון במקרה והוא קם על הצד הנחמד שלו בבוקר), כל מי שרואה את זה, אם חיים עושה את זה שוב, תלחמו איתו עד חורמה שיפרסם פתרונות *להכל* ושייתן לכם גליונות הגיוניים, הוא לא בודק את עצמו ונותן דברים שקשים אקספוננציאלית ממה שהוא חשב שהם יהיו.\n אל תחכו לגליון 4 כדי להגיד לו את זה, מהגליון הראשון , אם אתם רואים שאתם נתקעים יותר משעתיים על סעיף ואתם חושבים שאתם מבינים את החומר, לא להסס, זה יהיה שווה את זה בסוף.\nעצה שלי - לא לרפרנס בקורס הזה, במיוחד עם חיים, זה מאוד מפתה , אבל  זה פשוט יהרוס לכם!. אתם לא תבינו כלום בסוף הקורס.\n\nהמבחן: היו שאלות שכמעט אף אחד לא הצליח לפתור, מבחן קשה מאוד לכל הדעות.\n\nהשורה התחתונה: קורס יפה, אבל חיים קצת הרס לי", "timestamp": 1657444475251}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  חיים \nשם המתרגל/ת: וסבולד\nשעורי הבית: \nגיליונות כמגן, ניתנו 5 במהלך הסמסטר והוציאו אחד נוסף לא להגשה על נושא נוסף כדי להתכונן לבחינה.\nהמבחן: \nהמועד ב היה לקוח כמעט במלואו מהוכחות או דוגמאות מההרצאות, או מהגיליונות.\nחיים אוהב חסמים הדוקים.\nניתן פקטור במועד א' ובמועד ב' כך שהממוצע הסופי יהיה 67/66.", "timestamp": 1665577697387}, {"author": "חוסיין עזקי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חיים אבן זוהר\nחוות דעת - הרצאות:  נחמד סך הכל, מאמין בלשבור את הראש\nעל כל דבר. מלמד כמו קומבינטור\\ מתמטיקאי ולא כמדמחיסט.\nשם המתרגל/ת: \nחוות דעת - תרגולים: יורם\\הילל\nהוחלף לנו מתרגל באמצע סמסטר עקב בעיות רפואיות של יורם, יורם מעולה ומאוד יסודי וכנל הילל, ממש נהנתי.\n\nשעורי הבית: \nקשים במידה בלתי סבירה, דמעות ודם.\nהמבחן: לדעתי הוגן, משום מה הממוצע היה 47 לפני פקטור \nכנראה הבדיקה הייתה קיצונית.\nהשורה התחתונה: קורס חובה למת\"ח", "timestamp": 1692626721517}, {"author": "חסם הדוק", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: שעמום מוחלט, התעסקות בפרטים איזוטריים ולא חשובים. בנוסף חצי מההרצאה זה חיים כותב על הלוח פסודו קוד לא מובן במקום להשתמש במצגת.\n\nשם המתרגל/ת: הלל\nחוות דעת - תרגולים: תרגולים לא משהו, אם נשווה בין התרגולים של אלגוריתמים 1 לתרגולים שלנו הבדל שמיים וארץ.\nגם פה חצי מהתרגול זה כתיבה מהלוח במקום להשתמש במצגת.\n\nשעורי הבית: בודדות השאלות שבאמת קשורות לקורס, רוב השאלות קשורות לחסמים. וגם אחרי כל הבזבוז זמן הזה לא קיבלנו באמת פידבק על הגיליונות.\n\nהמבחן: מבחן מוזר מאוד, אבל ייצוג מושלם של כמה ביזיון הקורס הזה היה.\n\nהשורה התחתונה: מהקורסים היותר גרועים שיצא לי לקחת בטכניון. כל מי שמחכה לקורס הזה, אל. אתם סתם תתאכזבו, זה פשוט אינפי 1 + קצת קומבי + קצת מבוא למדמח.", "timestamp": 1693209005812}, {"author": "Meowster", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חיים אבן זוהר\nחוות דעת - הרצאות: \nחיים מרצה טוב, הוא מעביר את החומר בצורה טובה אבל כן טיפה משעממת. אם החומר מאוד מעניין אתכם אז זה לא אמור לפגוע. \n\nשם המתרגל/ת: הלל רז\nחוות דעת - תרגולים: \nזה הסמסטר הראשון שהלל תרגל בו ולדעתי הוא היה מצויין. הוא בא מוכן מראש לכל התרגולים וניהל אותם בצורה טובה, עזר לסטודנטים בתרגילי בית אם הם ביקשו עזרה בשעות הקבלה וגם עזר להתכונן ולפתור שאלות לפני המבחן.\n\nשעורי הבית: \nכשחיים מעביר את הקורס אז תרגילי בית הם קשים מאוד. לפי דעתי שווה לפתור אותם לא רק בגלל שזה מביא מגן טוב, אלא בגלל שלשבור את הראש על תרגילי מאוד מפתח את החשיבה האלגוריתמית שצריך לקורס ובסופו של דבר כדי לפתור את המבחן שחיים יתן. במקרה שלנו גם היה סעיף במועד א' שנלקח מתרגיל בית.\n\nהמבחן:\nלפי דעתי מועד א' היה הוגן, אבל הבדיקה של חיים הרגישה לי קפדנית באופן קיצוני ואני חושב שזה מתבטא בהיסטוגרמה.\n\nהשורה התחתונה: \nכנראה אחד הקורסים האהובים עלי מבחינת החומר, דורש המון השקעה אם חיים מעביר, אבל אם תשקיעו ובעיקר תעשו את שיעורי הבית, בסופו של דבר תצליחו.", "timestamp": 1705176523981}]}