{"posts": [{"author": "ג'נקינס", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה:\n ז'יטו\nחוות דעת - הרצאות: \nלי לא היה ברור\nשם המתרגל/ת: \nעידן\nחוות דעת - תרגולים: \nטיפה ברור\nשעורי הבית: \nהזיה.\nנדרשנו לבחור שאלות מהספר לבחירתנו ולהגיש כל שבוע.\nהתרגילים עוזרים להבין את החומר והמגן סביר (15%).\nהמבחן: \nקשה רצח הולישיט ראה הסטוגרמה\nעם חומר פתוח שכולל מחשב עם אנטרנט\nהשורה התחתונה: \nההרצאות עוקבות אחרי ספר הקורס שמכיל את כל החומר.\nמלג מומלץ למי שסבבה לו ללמוד לבד .", "timestamp": 1626971181034}, {"author": "וורונסקיאן של פעם", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לודה\nחוות דעת - הרצאות: \nמצוינת. סמסטר זום - ההרצאות ניתנו על מחברת של note10 כך שלא היה אפילו צורך לכתוב שום דבר. החומר מועבר בצורה ברורה, מפורטת ומסודרת.\nשם המתרגל/ת: ניקה פת.\nחוות דעת - תרגולים: לא הייתי נוכח בתרגולים של הזום בזמן אמת אלא צפיתי בהקלטות. התרגולים ברורים גם, בזום.\n\nשעורי הבית: הרבה. גם שיעורי בית באתר האינטרנט וובוורק וגם הגשת גליונות במודל. עוזר מאוד לתפוס את החומר אבל מרגיש יותר מדי חזרה על טכניקות בעוד שהמבחן עצמו עשוי להיות יותר בדגש על הוכחות.\n\nהמבחן: \nהוגן עם כוכבית. היה שם פיתוח של טור גיאומטרי שהאמת שלא יצא לנו בכלל להיתקל בו בשיעורי בית כך שמי שלא זכר עובדה זו מאינפי 1 במקרה או לא הבין שהטור שהוא קיבל זה טור גיאומטרי - אכל סרט רע במבחן. כל השאר היה סביר למדי.\nהשורה התחתונה: קורס נחמד, טכני ברובו. עמוס למדי.", "timestamp": 1627932647374}, {"author": "Yonez", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות:\nההרצאות  היו די מעניינות אבל עם הרבה הוכחות טכניות.  לידיה מרצה טובה והיא מלמדת את החומר בעניין רב. \n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nקצרים מדי, יש שעה תרגול על 4 שעות הרצאה.  בתרגולים בעיקר עוברים על החלק הטכני של הקורס שזה פתרון מדר.  יוליה עשתה את החובה שלה כמתרגלת ולא מעבר... לא שמחה לענות על שאלות ובכללי נראה שהיא באה להעביר את התרגול וללכת. \n\nשעורי הבית: \nבקורס עם לידיה יש גם וובוורקים שהם חובה וגם תרגילי בית פתוחים שאינם חובה.  השיעורים לא קשים מדי ועוזרים להפנים את החומר\n\nהמבחן: \nהמבחנים של לידיה מלאים בהמוווון חישובים שגוזלים טונה זמן.  חוץ מזה המבחנים שלה הוגנים ולא קשים במיוחד.  צריך לדעת להוכיח משפטים למבחן וזה בערך החלק הכי קשה \n\nהשורה התחתונה: \nקורס מעניין ומאוד יישומי.  ממליץ לקחת אותו עם לידיה", "timestamp": 1646932563231}, {"author": "אבל", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: טלי פינסקי \nחוות דעת - הרצאות: די אחלה, לא באתי לכולן כי מוקדם בבוקר \n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: לא באתי מאותה הסיבה אבל רן קירי הוא הגואט, מעלה סיכומים מעולים לתרגולים שמכסים גם הרבה מהרצאות \n\nשעורי הבית: היו דווקא בסדר\n\nהמבחן: מאוד הוגן, לא מאוד מדר\"י באופי שלו אז זה חסך פתירת משוואות ודברים לא נחמדים\n\nהשורה התחתונה: קורס לא מאוד מעניין, אבל חובה, ובסוף המבחן התמקד בחלקים היותר בסדר", "timestamp": 1674896066374}, {"author": "פיקארד", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: טלי חביבה, נחמדה, ותמיד שמחה לענות על שאלות. מצד שני ההרצאות נראות כאילו היא ממציאה אותן בזמן אמת (אולי זה לא כאילו). אולי היא משחקת עם עצמה \"האם אצליח לפתח בעצמי את התאוריה של מד\"ר \". לפעמים זה עובד נחמד ולרוב מבולגן. אבל כפרה עליה. \n\nשם המתרגל/ת: מד\"רן קירי\nחוות דעת - תרגולים: שמו הולך לפניו. משקיען אמיתי. כיף של מתרגל. \n\nשעורי הבית: עשו עלינו ניסוי של \"בדיקת עמיתים\". בפאן הטכני זה עבד חרא אבל הקונספט מגניב ועוזר באמת ללמוד משיעורי הבית ולא רק לסמן עליהם V בשביל המגן. היה בקורס 15% מגן בלתי תלוי במבחן שזה חביב.\n\nהמבחן: סביר בהחלט אבל הוא היה בטיימינג נהדר של יום (!) אחרי סיום הסמסטר. לא קשור לסגל הקורס כמובן, והם עשו כמיטב יכולתם כדי להכין אותנו ובשבוע האחרון בקושי היה חומר חדש.\n\nהשורה התחתונה: ההוכחה של קיום ויחידות באמת יפה. הרבה דברים אחרים בקורס לא כאלה מרגשים. הקורס היה עם הקשר פיזיקלי רחב כיאה למד\"ר.", "timestamp": 1676104163737}, {"author": "THE MOGDOM", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: לא צריך אפילו להגיד כלום, מתרגל תותח\n\nשעורי הבית: שיעורי בית ישר לנקודה, עובר על הנושאים שצריך ולא יותר מדי לחוץ\n\nהמבחן: מבחן מאוד בסדר\n\nהשורה התחתונה:", "timestamp": 1676165590872}, {"author": "-", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: מבולגנת, לא מפוקסת והרבה פעמים לא ברורה בכלל, אבל נחמדה מאוד ובאה ממקום של אינטואיצה ולא יבש מדי. בסוף לא הספקנו הרבה חומר, אבל גם למדנו כמה דברים שלא למדו בסמסטרים אחרים.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מיותר להגיד. כולם יודעים שרן קירי הוא אגדה ושחייב לקחת אותו איפה שאפשר. חבל שהיתה רק שעה של תרגול בשבוע, היה צריך עוד\n\nשעורי הבית: בסדר, לא נורא בכלל. היו רק 8 גיליונות, והוובוורקים היו רק לתרגול עצמי לפני המבחן ולא להגשה.\n\nהמבחן: די קל יחסית, אבל בכל זאת איכשהוא הציונים בסוף לא משהו\n\nהשורה התחתונה: הקורס לא בנוי מספיק טוב, יותר מדי מועד לפורענות. הבלאגן של טלי רק החמיר את העניין, אבל רן הצליח לכפר על זה קצת", "timestamp": 1676311393448}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: \nמאוד מאוד מאוד ! מבולגנת, באתי לכל ההרצאות ללא יוצא מן הכלל ופשוט אי אפשר לעקוב אחריה! מרגיש שהכריחו אותה ללמד את הקורס והוא כלכךךך לא מעניין אותה, מנסה לדחוף מטרו איפה שאפשר רק כדי ללמד דברים שהיא מכירה, סך הכל היה לי ממש לא כיף בשיעורים, היא מאוד חמודה ומאוד מנסה לעזור אבל לדעתי היא פשוט לא יודעת ללמד את הקורס.\n\nשם המתרגל/ת: רן קירי aka המלך\nחוות דעת - תרגולים: \nבאמת שאין צורך לכתוב כלום, מי שלא מכיר את רן משום מה ולא היה בתרגולים שלו מפסיד.\nתרגולים ברורים והוא מוכן אליהם מראש, עונה בפיאצה על כל שאלה, תמיד שמח לעזור וכמו כל קורס שרן מתרגל היו רשימות מושלמות \n\nשעורי הבית: ממש אחלה, מלמדים ולא ארוכים מדי, המערכת של הבדיקת עמיתים די דפוקה.\n\nהמבחן: מבחן הוגן מאוד ולא מד״רי אבל הבדיקה של טלי הייתה מזעזעת הורידה נקודות על דברים סתם, עירערתי והיא הוסיפה לי 8 נקודות בלי לבדוק לדעתי, מבאס שההרגשה היא שלא בדקו טוב\n\nהשורה התחתונה: אחלה קורס, אם רן מתרגל תקחו ל משנה מי המרצה, אם לא אז חכו ללידיה שתעביר שוב", "timestamp": 1677177554156}, {"author": "פואנקרה", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: טלי\nחוות דעת - הרצאות: בבין אישי - אמן וכל המרצים שלי היו נחמדים ובעלי רצון לעזור כמו טלי.\nבהרצאות - היה לה מאוד קשה לשלוט בהרצאות, היא לא תמיד הצליחה להגיע לפואנטות שלה וחבל.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מתרגל מצוין! אבל לצערנו הייתה נפילה בתיאום בינו לבין טלי. בין התרגולים והשיעורי בית לבין המבחן - שמיים וארץ.\nעם זאת, חייב להגיד - מתרגל לא פחות ממצוין, מסביר מצוין גם בתרגולים, גם בשיעורי בית, וחבל שלא כל המתרגלים פותחים פיאצה ובעלי רצון לעזור לסטודנטים כמו רן.\n\nשעורי הבית: בול התרגולים.\n\nהמבחן: נראה היה שטלי לא מיקדה את הקורס בלפתור מד\"ר אלא לחקור בצורה איכותית, מה שלצערנו לא בדיוק תורגל בקורס.\n\nהשורה התחתונה: בראייה רחבה - אחלה קורס.", "timestamp": 1677453774875}, {"author": "שוקובו", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: \nמושלם אין מה לומר, לוקח זמן להתרגל לדרך שבה לומדים את החומר כי הוא לגמרי שונה ממה שרגילים אבל בסוף נהיה מעניין. טלי גם קצת מנפנפת בידיים אבל זה באמת כי היא עושה רק את מה שחשוב ופרקטי כדי להבין את החומר. טלי גם מאוד נחמדה וכיף לבקש ממנה עזרה בשעות קבלה וכו.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nאחלה מתרגל הביא תרגילים שהיו בדיוק ברמה כדי להבין את היישום של החומר וגם לראות טריקים למבחן. יודע טוב את החומר והסביר אותו. השעות קבלה שלו אחלה.\nשעורי הבית: \nרוב התרגילים לא היו קשים במיוחד, היה בדיקת עמיתים וזה עובד חרא אבל בסופו של דבר מרוויחים יותר מאשר מ \"בדיקה\" של בודק תרגילים.\nהמבחן: \nפייר רצח, הם בנו מועד א כמעט בכלל בלי חישובים כדי שלא ירדו נקודות סתם. אבל לגמרי צריך להבין ולדעת לפתור מדר\nהשורה התחתונה: \nאחלה קורס, ממש נבהלתי ממנו בהתחחלה אבל בסוף הוא דיי קליל כי הוא לא עמוס ממש בחומר או במשפטים כבדים.", "timestamp": 1677685234642}, {"author": "נולקלינה", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: טלי העבירה את הקורס בפעם הראשונה וזה ניכר בהרצאות של תחילת הסימסטר (נראה גם שהיא די שונאת את הקורס). לדעתי בסופו של דבר היא העבירה את החומר בצורה המעניינת ביותר - לא יותר מידי חישובי ולא יותר מידי \"ניחושי\". בנוסף, טלי מדהימה בבין אישי וזה התבטא מאד בהרצאות ובשעות הקבלה ויצר אווירה לימודים נעימה מאד.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן מסביר מעולה. בנוסף הוא דאג להעלות רשימות מסודרות מאד של התרגולים, אם כי לדעתי עמוסות מידי. הבעיה היחידה היית חוסר תיאום בחומר בין התרגול וחומר והורגש שרן וטלי לא מדברים את \"אותה השפה\". \nרן, פותח פיאצה וזאת פלטפורמה מעולה שבה אפשר לשאול שאלות והוא או סטודנטים אחרים עונים בה יחסית מהר.\n\nשעורי הבית: כמו רב הגיליונות של רן, התרגולים מכווינים אל הגיליונות. לפעמים יש טעויות בגיליונות אז כדאי לחכות שיעלו עליהם לפניכם או לדבר עם רן.\n\nהמבחן: מאד הוגן. הקושי העיקרי היה ללמוד אליו כי החומר לא תאם אף קורס קודם. \n\nהשורה התחתונה: קורס ממשיך של לאינפי 1 ו2.", "timestamp": 1678869913446}, {"author": "THE MOGDOM", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nשם המתרגל/ת: רן קירי \nחוות דעת - תרגולים: ליטרלי אגדה\nהמבחן: היה פייר מאוד\n\nהשורה התחתונה: לא קורס כיף במיוחד אבל גם לא קשה במיוחד", "timestamp": 1679052207812}, {"author": "ממדרים בכיף", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: דניאל אחלה מרצה ויש לו רשימות מעולות, אך לפעמים עשה טעויות בהרצאה שתמיד היה מתק בהרצאה לאחר מכן.\nבכללי קורס די סבבה. \n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: יוליה מתרגלת מעולה, עם הספק סביר ומאוד מובנת, אך אם שואלים אותה שאלה היא קודם תרד עליכם ורק אחר כך תענה.\n\nשעורי הבית: היו מלאים בטעויות וכדי לפתור אותם הרגיש שצריך שרץ של יצירתיות, אך בסוף מכסים די טוב את החומר.\n\nהמבחן: נקווה לטוב\n\nהשורה התחתונה: קורס מעניין, לא קשה בשום צורה. ממליץ לקחת עם מישהו שהוא לא ז׳יטו בשביל באמת לדעת לפתור מדר", "timestamp": 1714320241243}, {"author": "המטריצה היסודית", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה קצת משעמם ואיטי, הפסקתי לבוא להרצאות באמצע הסמסטר ועברתיל רשימות. הקורס שם דגש כל כך גדול על יכולת פתירת מדרים שלא באמת ראינו הוכחות לרוב הדברים, בהכרח מאכזב ואם היה מסתדר לי סמסטר הבא הייתי לוקח עם ז’יטו במקום\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: סבבה, היו כמה שאלות מעניינות תאורטית וכמה שאלות טכניות של בדיקת יכולת עלייה על טריקים\n\nהמבחן: שאלה 2 שייכת בכלל לאינפי 1, שאלות 3-5 מדר קלאסי, שאלה 1 שאלה שבאמת הייתי רוצה לראות בקורס מדר א, חבל רק שהקורס עצמו הועבר כמדר מ ולכן פותחו ציפיות לא תואמות למבחן.\n\nהשורה התחתונה: לא מומלץ, חבל שהוא חובה", "timestamp": 1716319286140}, {"author": "מודריץ'", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: סך הכל די סבבה, לדעתי מאוד איטיות (לקראת סוף הסמסטר קלטתי שאני יכול בשעתיים של לקרוא את הרשימות להספיק מה שמספיקים בכמה שבועות בקורס). ההוכחות היו קצת קשות למעקב בהרצאות כי הרגשתי שאין מספיק הסבר מעבר לשלבי ההוכחה של דניאל על למה מוכיחים את טענת העזר הזאת או איך מה שאנחנו עושים עכשיו נכנס בהוכחה הכללית, אבל זה לא קורס שכל כך משנות בו ההוכחות אז זה לא כזה קריטי. לזכות דניאל אגיד שהוא פרסם רשימות מוקלדות שהן מעולות ומכילות את כל החומר שהועבר בהרצאות (ומעבר) וזה היה מאוד נוח. גם בסך הכל יש אווירה טובה בהרצאות.\n\nזה גם לא הקורס הכי מעניין אבל לא נראה לי שזה קשור למרצה, פשוט כי החומר יחסית טכני (למרות שחלק מההוכחות היו כן נחמדות דווקא)\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: מבחינה מקצועית תרגולים מעולים עם שאלות רלוונטיות והסברים טובים של הפתרונות. כן לפעמים ענתה לשאלות בצורה לא הכי נעימה.\n\nשעורי הבית: קלילים, לא הרבה עומס בכלל.\n\nהמבחן: לדעתי הוגן, אם כי היה מפתיע בגלל שציפינו למבחן הרבה יותר טכני (לפי הדגש שהיה בהרצאות) של לפתור מד\"רים ודווקא היו במבחן הוכחות שחלקן יותר קרובות לאינפי 1 מלמד\"ר. מצד שני אני כן חושב שלמי שעשה את כל התרגילי בית (גם אלה שלא היו חובה להגיש) אז זה היה צריך להיות מבחן סביר. \n\nהשורה התחתונה: קורס בסדר, לא מעניין במיוחד אבל חובה לחלק מהמסלולים ושימושי אם נתקלים במד\"רים. דניאל סבבה, גם יוליה, ממליץ ללמוד מהרשימות אם אתם מסתדרים עם זה.", "timestamp": 1716489960685}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \n \nוואו איך היה אפשר להמציא מבחנים כאלה מזעזעים בקורס כזה קל. מאוד א עוד היה פתיר, מועד ב מזעזע.\n\nמרצה מאוד נחמד שמכשיל סטודנטים עם חיוך.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \n\nהיה לי קשה להתרכז בתרגולים, אם זאת מתרגלת טובה.\n\nשעורי הבית: \n קושי בינוני\n\nהמבחן: \nמזעזע, נורא, לא סביר\n\nהשורה התחתונה: \nאל תקחו קורסים עם רבייב", "timestamp": 1717508138374}]}