{"posts": [{"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי ממש מעולה, לוקח קצת זמן להתרגל לסגנון שלו אבל באמת אכפת לו שהסטודנטים יבינו, הוא עונה בקבוצות וואטסאפ גם בשעות הזויות ובהרצאה גם משתדל להסביר שוב מה שלא מובן. אם משהו לא יושב טוב ממליצה להסתכל בסרטונים של צנזור ביוטיוב למרות שזה אינפי כי זה הרבה פעמים מסדר דברים בראש \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: היא חמודה ממש ומסבירה טוב אבל הקצב שלה מאוד מקשה לעקוב כל התרגול (גם אם אתם מאלה שרואים דברים על מהירות פי 2)\n\nשעורי הבית: סבירים, צריך זמן לשבת עליהם\n\nהמבחן: קשה אבל הוגן, האמריקאי די נוראי\n\nהשורה התחתונה: תכלס הקורס שהכי נהניתי ממנו בסמסטר", "timestamp": 1675673400514}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה מעולה! בתחילת הסמסטר פתח קבוצת ווצאפ איתנו וענה על שאלות בקבוצה באופן קבוע עד סוף הסמסטר. מאוד מובן, ברור ומסודר. מסכם מעולה את החומר. ממש היה קל ללמוד מהסיכומים שנכתבו בהרצאות. אווירה טובה בכיתה, נותן לשאול שאלות ועונה בצורה שקל להבין.\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: לא הלכתי לתרגולים במהלך הסמסטר. ראיתי הקלטות שלה מהקורונה חודש לפני המבחן. היא מאוד נחמדה ועוזרת ומתחשבת. יש לה דפי סיכומים שכדאי מאוד להדפיס או להוריד למחשב ולבוא איתם לתרגול. ככה אפשר להקשיב בשקט ולהוסיף הערות על דפי הסיכום שלה.\n\nשעורי הבית: גליונות - לא יודע, לא עשיתי. וובוורק - קשה מאוד חשוב לעבוד עם אנשים. או לפחות להיות פעיל בקבוצות ווצאפ. לא להתבייש לבקש עזרה. כולנו צריכים עזרה.\n\nהמבחן: מועד א' היה הוגן. קשה, אבל דומה למבחנים משנים קודמות. לכן מומלץ מאוד לפתור הרבה מבחנים.\n\nהשורה התחתונה: קורס קשה שצריך לעבור. חשוב להישאר אופטימי להשקיע ולסחוט כל נקודה מהמבחן.", "timestamp": 1675768341783}, {"author": "סטודנטית מן המניין", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: יוסי מרצה מעולה, מאוד ברור וחשוב לו שהסטודנטים יבינו. צריך להתרגל לשיטת הוראה שלו אבל שמתרגלים הוא מאוד מסודר ומובן, חוץ מזה עונה בקבוצה בוצאפ על כל שאלות ומתייחס להכל. \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת מעולה, באה עם דפי תרגול לשיעור ככה שלא צריך להעתיק. אבל, הקצב שלה הוא מהיר ולא מתאים לכל אחד. אני חושבת שהסטודנטים מאוד חשובים לה והיא משתדלת לתת הרבה דוגמאות וטיפים למבחן. הקצב שלה מכריח להישאר מרוכז כל השיעור. \n\nשעורי הבית: גליונות שחלקם יותר קלים וחלקם פחות, יש רפרנסים להכל אבל כן חשוב לעבור ולהבין שמבינים את העניין המרכזי בכל תרגיל. וובורקים שטובים להבנה הטכנית של הכל. \n\nהמבחן: מבחן הוגן לגמרי. \n\nהשורה התחתונה: קורס עמוס אבל ללמוד טוב במהלך הסמסטר ולדרוש להבין ויהיה בסדר.", "timestamp": 1675772163743}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nהרגיש קצת תיאטרלי, צריך להתרגל לסגנון שלו אבל סה\"כ אחלה מרצה.\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מהירה מאוד אבל אין עליה. קשובה, מעבירה ברור ופותרת תרגילים מכל כיוון אפשרי. \n\nשעורי הבית: גיליונות לא עמוסים מאוד אחת לשבועיים (לא רמה מטורפת), וובוורקים אחת לשבוע בערך.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: קורס נחמד סה\"כ, טכני יחסית, דיי עמוס", "timestamp": 1675879584415}, {"author": "Harry", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל\nחוות דעת - הרצאות: \nרוב האנשים לא עמדו איתו בקצב חלק הפסיקו להגיע\nאבל היו כאלה שגם מאד התחברו אליו\nחשוב לו שיבינו והוא עונה על כל השאלות אבל לפעמים הוא קצת לא מודע לזה שהרוב המוחלט איבדו אותו\n\nשם המתרגל/ת: איילה\nחוות דעת - תרגולים: \nמהירה מאד אי אפשר להעתיק עדיף לשבת להקשיב ולהבין, אם מבקשים ממנה לחזור על משהו היא עושה את זה באיטיות ויוצא שלא תמיד מספיקים הכל וצריך תרגולי השלמה, התרגולים שלה יחסית ריקים, סהכ ממליץ עליה בגדול למדתי חדווא בתרגולים ובבית \n\nשעורי הבית: \nבסופו של דבר הם מגן ואם לא עוברים את הקורס זה לא מעניין ולא יכול לפגוע\nאז הייתי ממליץ לא לריב איתם יותר מדי\nהוובוורקים מלמדים מאד\n\nהמבחן: הרגיש הוגן למרות שאין לדעת \n\nהשורה התחתונה: רוב המבחן יהיה מהחלק השני של הסמסטר אז הייתי משקיע בו במיוחד ומנסה להכנס לכמה שפחות פערים", "timestamp": 1676037669231}, {"author": "Hanoch Egyes", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: לא מדהים במיוחד אחרי שמתרגלים לרמה של צנזור בסרטונים\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים:עוזרים מאוד \n\nשעורי הבית: עוזרים מאוד להבין את החומר\n\nהמבחן: קשה ורובו על הנושאים של סוף הסמסטר\n\nהשורה התחתונה: קורס קשה", "timestamp": 1676215637636}, {"author": "תמר", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: ליוסי יש את הניואנסים שלו אז צריך ללמוד להתחבר אליו, אם הוא המרצה האחראי כן רצוי בעיניי ללכת להרצאות שלו כי זה מלמד המון על מה שהוא אוהב לשים במבחנים ודגשים שלו. אם הוא לא מרצה אחראי, ממליצה בחום ללמדו אצל מישהו אחר. \n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: ההחלטה הכי טובה שתעשו בחיים שלכם. ללכת אליה בכל מחיר! תרגולים עמוסים לקחת בחשבון. \n\nשעורי הבית: קשים ולא כל כך ברור איך לעשות אותם אם לא הולכים לתרגולים ושעות קבלה", "timestamp": 1676287513715}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nלברוח.\nאם אתם רוצים להיות בעינינים ולא להשלים חומר לבד בעזרת אתרים חיצוניים כמו גול וחשבוניה כי לא הצלחתם להבין כלום מההראצה אז כמו שאמרתי קודם, לברוח.\nשם המתרגל/ת: אילה\nחוות דעת - תרגולים: \nטיפה מהירה אבל מאוד נחמדה ועם הרבה רצון טוב ותשוקה\nנותנת תשובות על כל שאלה בסבלנות \nשעורי הבית: וובורקים לא קשים במיוחד\nגליונות חלק קל וחלק לא\n\nהמבחן: \nיחסית הוגן\nהשורה התחתונה:", "timestamp": 1676401001030}, {"author": "סטודנט ממוצע", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: חאפר לא נורמלי. לפחות הוא מצחיק ושולף בדיחות מהמותן ומעביר את ההרצאות בצחוקים. אם הוא לא המרצה האחראי לא ממליץ\n\nשם המתרגל/ת: יואב סנדנר\nחוות דעת - תרגולים: אחלה מתרגל. נותן אינטואיציה טובה על החומר. היינו קבוצה קטנה והיה ניתן לשאול שאלות. נתן מעצמו 100 אחוז\n\nשעורי הבית: גיליונות ווברוק שבועיים שיכלו לקחת שעות, מעצבנים ולא תמיד מרגישים קשורים לחומר. גליונות פתוחים דו שבועיים שהיו סבבה\n\nהמבחן: היה קל ואני לא סתם אומר. הממוצע היה די בינוני, אבל יוסי לקח שאלות בסיסיות כמעט בכל החומרים, לא תרגלתי מבחנים קודמים בכלל, רק שאלות בודדות וקיבלתי ציון יחסית גבוה. מאמין שאם יוסי יהיה המרצה האחראי בעתיד הוא יעלה את הרמה.\n\nהשורה התחתונה: קורס קשוח, שואב הרבה זמן, יש חלקים מעניינים, בעיקר פולינום טיילור, ערך הביניים וכל מיני טריקים באינטגרלים, כל השאר מיותר. בהצלחה", "timestamp": 1676747671722}, {"author": "e", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: דואג שכל אחד יבין את החומר וחוזר על הסברים במידת הנדרש, בא לקראת הסטודנטים במידת האפשר\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מספיק הרבה תרגילים בתרגול אבל לא מורגש כי ממהר, מסביר בצורה ברורה עם זאת עדיפות להגיע לתרגול לאחר שיודעים מה החומר\n\nשעורי הבית: כדאי מאוד לפתור לבד\n\nהמבחן: תואם לרמת הקורס\n\nהשורה התחתונה: ללמוד כל הסמסטר", "timestamp": 1676804127520}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי ממש שולט בחומר מרצה כבר הרבה שנים בטכניון ויודע לשמור על אנרגיה טובה ושמחה בהרצאות רק שהוא שונא שמדברים לו בהרצאה וכל רעש קטן מפריע לו.\n\nשם המתרגל/ת: יואב\nחוות דעת - תרגולים: מתרגל מעולה היינו כיתה קטנה וזה הרגיש כמו שיעור פרטי\n\nשעורי הבית: הרבה וברמה גבוהה\n\nהמבחן: לא פשוט\n\nהשורה התחתונה: קורס לא פשוט שמצריך הרבה השקעה", "timestamp": 1677582594569}, {"author": "למה אכלתי אמא", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: לא אהבתי אותו בכלל. הוא לא תמיד נותן לך את כל המשפטים שאתה צריך לדעת וכשמבקשים ממנו דוג' למשהו נותן את הדוג' הפשוטה ביותר. \n\nשם המתרגל/ת: יואב\nחוות דעת - תרגולים: בהתחלה הבנאדם לא היה איתנו אבל כנראה עשו לו נונו ואשכרה התחיל לעשות לנו תרגולים מעולים.\n\nשעורי הבית: בשני הגליונות שראשונים הייתי צריכה להיעזר בחברים כי היה קשה להבין איך לפתור רק עם מה שנלמד עם יוסי. אבל שאר הגליונות היו די בסדר.\n\nהמבחן: הוגן מאוד, מה שלא ציפינו מיוסי אחרי המבחן אמצע הקשה. אם אתה מבין את החומר אתה יכול להצליח בגדול במבחן.\n\nהשורה התחתונה: למצוא מרצה ומתרגל טובים. וגם מאוד עוזר להשתמש בסטאדיס (יש שם סרטונים חינמים על הקורס הזה). הסיכומים במודל של אלון גם מעולים אם לא הבנתם על דיברו בהרצאה.", "timestamp": 1677838546000}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nההרצאות שלו ממש חשובות, אל תפספסו אף הרצאה. הוא מסביר בצורה מצויינת וחוץ מזה מלמד בצורה כיפית.\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: \nמתרגל מצויין , מעביר את התרגול בצורה מובנה וזה עוזר לכם להבין את החומר של ההרצאה עוד יותר , נותן טיפים וכלים חשובים שיכולים לעזור לכם ולהקל עליכם.\nשעורי הבית: \nשיעורי בית ממש דומים לתרגולים , יש מהם קשים ולוקחים המון זמן.\nהמבחן: סביר", "timestamp": 1677840835940}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: אני כאן כדי להגיד- אם אתם לראשונה בהרצאה ותוהים לעצמכם מה זה לילילירקרקרק- זה קטע מעבר לנושא הבא\nשמחתי לעזור", "timestamp": 1678369288331}, {"author": "Happy", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: בהתחלה היה לי ממש קשה ללמוד אצלו בהרצאות, מכיוון שלפעמים היה מבולבל מעט. בהמשך למדתי להסתדר בהרצאות שלו והבנתי שהוא עושה הרבה לטובת הסטודנטים, אם לענות לנו בוואטצאפ לשאלות וכדומה. ההרצאות חשובות והוא אוהב שדברים כתובים בדיוק בדרך שלו.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין מה להגיד הציל לי את הסימסטר וגרם לי להצליח, מהיר מאוד אבל מקיף בצורה שלא חשבתי שאפשר להגיע אליה. עברתי אליו בדבוע השני וזאת ההחלטה הכי טובה שעשיתי בסימסטר. יש לו רשימות מודפסות של התרגולים שלו שבזכותם לא חייב לכתוב.\n\nשעורי הבית: דורשים זמן, אבל חשובים מאוד לומדים מהם הרבה והם תורמים רבות להבנה של החומר במהלך הסימסטר.\n\nהמבחן: יוסי עשה מבחן קל יחסית, למרות שהממוצע היה יחסית נמוך. הוא נתן תרגילים מאוד בסיסים ולא ניסה להקשות על הסטודנטים. מאוד ניסה לתת לאנשים להצליח במבחן. (הבוחן לעומת זאת היה נורא ואיום!)\n\nהשורה התחתונה: קורס חובה, אז אין לכם כל כך ברירה פשוט באמת חשוב לתת פוש כל הסימסטר ולא להשאיר את המקצוע הזה לרגע האחרון… לוקח זמן עד שהחומר מתעכל.", "timestamp": 1678704606574}, {"author": "נ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: דניאל ממש נעים, מסביר ונתן הרבה מקום לשאלות- בלי ליצור פיגור בחומר. אחלה הרצאות. לפעמים הרגיש לי שההסברים שלו מתאימים יותר למי שכבר יש לו מעט רקע בשפה המתמטית כי הוא מאוד בתוך זה ולא כל ההסברים ממש עממיים\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: תותח תותח, מדייק להתנסח, דוגמאות מעולות, מפשיט את החומר ומספיק המון בשיעור (למי שרוצה לכתוב תוך כדי זה קצת מאתגר אבל אפשרי) \n\nשעורי הבית: הוובוורקים ממש עוזרים להבין את החומר. הגליונות בסדר, יש יותר סבירים ויותר בלתי אפשריים\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1678879581848}, {"author": "Leeyam bat el", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: מרצה עם המון נכונות להיות נוכח בשביל התלמידים, אבל לפעמים לא מסביר מדויק ועקבי מספיק במהלך ההרצאות. לפעמים מתבלבל ואז מתקן (מה שיכול לבלבל כשרואים חומר חדש). \n\nשם המתרגל/ת: אחסאן עבד אלפתאח \nחוות דעת - תרגולים: מתרגל טוב, מסודר, עובר על כל השלבים ועונה לשאלות בסבלנות. לגמרי מומלץ. חשוב לציין שהכיתה שלו תמיד מלאה, ותמיד יש \"קרב\" על מקומות, זה לא נרגע במהלך הסמסטר רק נעשה יותר גרוע. \n\nשעורי הבית: \nמטלות להגשה ו-וובוורק, אורך הוובוורקים משתנה, קושי המטלות להגשה והאורך שלהן די עקבי (ארוך). \n\nהמבחן: \nשני המועדים היו הוגנים לדעתי. לא היו הפתעות.\nיש רשימת משפטים שיכולים להופיע במבחן וצריך לשנן את ההוכחה שלהם.\n\nהשורה התחתונה: \nקורס שווה להשקיע בו במהלך הסמסטר כדי לא ליפול במבחן. שווה לתרגל הרבה מבחנים לפני, בדגש על הנושאים של:\nעה\"ב \nאינטגרלים\nטורים \nמספר פתרונות למשואה (רול לגראנז)", "timestamp": 1678946503780}, {"author": "S", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי נשמה טהורה, באמת אכפת לו מהסטודנטים, והוא דואג להכניס קצת הומור וצחוקים בהרצאות. מבחינתו מי שמתאמץ ומגיע, יכול גם לקבל את העזרה שלו אח\"כ (בערעורים למשל). מה שכן- לדעתי קשה ליוסי ללמד כיתה ככ גדולה. היינו כל פעם אודיטוריום של 300 איש בערך, וחוץ מזה שהדיבורים משגעים אותו (בצדק), הוא פחות מצליח ללמד טוב ככה. (הייתי איתו גם באלגברה, שם היינו בערך 30 וההבדל היה מהותי). לכו לשעות קבלה אם צריך.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אחסאן סבבה לגמרי, מעביר את התרגול מסודר ומזכיר הגדרות וחוקים חוץ מתרגילים. לעומת מתרגלים אחרים שטסים הוא די איטי, שזה מצד אחד טוב כי ככה מבינים, ומצד שני לא מספיקים הרבה תרגילים מכל נושא בשיעור, כי הוא רוצה לעבור על כמה שיותר נושאים, אז זה בסוף אינדבידואלי.\n\nשעורי הבית: מעמיסים וקשים. הוובוורקים לוקחים סתם זמן, שלפעמים באמת יש שם שאלות מיותרות (יוסי אפילו הסכים איתי בנושא). בתכלס הם נועדו לתרגל טכניקה, והגליונות את הדבר האמיתי. הגליונות גם לא קלים בכלל.\nבסוף שיעורי בית באמת עוזרים להבין את החומר אבל הם מעמיסים בקטע קיצוני, כי רוב הקורסים שלוקחים איתם גם ככה בדרכ.\n\nהמבחן: הבוחן אמצע- יוסי התפרע והיה יצירתי מאוד, משמע המון אנשים לא עברו אותו (לא מפתיע). לא להתרגש.\nהמבחן- המועד א היה הוגן לגמרי, אם כי לא קל (בכל זאת- חדוא). המועד ב היה יותר קשה. תלמדו את ההוכחות שצריך בע\"פ ולפחות יהיה לכם איזה 12 נקודות מתנה להתחיל מהם.\n\nהשורה התחתונה: קורס קשה לכל הדעות, מומלץ ללכת לשעות קבלה, ואפילו לשני תרגולים בשבוע, כדי להמשיך לעקוב ולהבין מה הולך שם.", "timestamp": 1680553943704}, {"author": "Yarin Katan", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה:יוסי כהן\nחוות דעת - הרצאות:מרצה טוב יודע את החומר \nבגלל שהקורס עמוס הוא חייב לרוץ בהרצאות על החומר אבל מאפשר לשאול הרבה שאלות ומסביר כמה שצריך\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמה שהציל אותי במבחן  זה הפקל של חן הררי, אפשר למצוא אותו באתר: https://studies.co.il/mathematics/technion\nחן עושה פקלים לחדוא בטכניון כבר בערך 15 שנה, הוא יודע את החומר ברמה הגבוהה ביותר ומכיר את כל המבחנים של יוסי ושל אלון מכל השנים האלה ולכן עוזר להתכונן לכל תרחיש שעלול להגיע במבחן בפקל באמת מומלץ בעיקר למי שצריך שיפקסו אותו לעיקר שצריך כדי להצליח במבחן.\n\nהשורה התחתונה: קורס די עמוס אבל אפשרי\nבעיקר כשהולכים לפקל של חן", "timestamp": 1684401974035}, {"author": "אוהד וולף", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים \n\nהמבחן: סהכ בסדר \n\nהשורה התחתונה: לקחתי את הפקל של חן כדי להשלים את רוב החומר כי ההרצאות לא היו כל כך ברורות", "timestamp": 1684851844421}, {"author": "אלון ספיר", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: \nזה לא סוד שאלעד דוקוב ידוע יותר כמרצה של מקצועות הומניסטיים בתחום היהדות. בהתחלת הסמסטר אי אפשר היה למצוא עליו בצ'יזפורק ביקורת על קורס מתמטי שיצא לו להעביר. אבל השעות היו מאוד נוחות ואסור לשפוט את הקנקן אלא את מה שבתוכו, אז הלכתי עליו.\nבדיעבד, ככל הנראה הייתי עובר לאלון דמיטריוק: מבחינת האישיות כנראה שאלעד הוא האנטי תזה המושלמת של אלון כי הוא משתדל שהאווירה בהרצאה תהיה הכי נעימה שיש, וגם בשעות הקבלה הוא מאוד עוזר ומשקיע. הוא גם זמין במיילים ואפשר לשלוח לו שאלות. הוא משלב המון העשרה בהרצאה, בעיקר על מתמטיקאים יהודים מימי הביניים, וזה הוסיף לי אישית המון.\nכמרצה, אלעד, עם כל הצער, ברמה דיי נמוכה: קל מאוד לאבד את אלעד, שבעצמו מתבלבל לעיתים מאוד קרובות. אתה לא מרגיש שאתה יוצא מההרצאה כשאתה מבין את החומר, עד שאתה מגיע לתרגול ושם מסדרים לך את הבלגאן.\nמה גם שצריך לקחת בחשבון שאלון דמיטריוק שם בכל מבחן שאלות הוכחה, ואח\"כ כשלא הייתם בהרצאה של אלון וסיכמתם את אופן ההוכחה כמו שהוא העביר בהרצאה זה הרבה יותר קשה להשלים את זה אח\"כ מצנזור, ארז שיינר(מאודדדד מומלץ, תחפשו אותו ביוטיוב), סטאדיס או חשבונייה, אם כי ככל הנראה השימוש באחד מאלו בקורס הזה הוא בגדר בלתי נמנע.\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: \nבואו נתחיל מזה שהתרגולים בקורס הזה קריטיים\nהילה מעין היה המתרגלת המושלמת לקורס הזה! היא מתרגלת מאוד ותיקה, בפרט כמתרגלת אחראית של אלון, והיא יודעת איך להכין סטודנטים למבחן, ברמת האיך לפרמל שאלה במבחן. היא יודעת להעביר חומר בצורה מאוד מאוד טובה ואינטואיטיבית. החיסרון הוא המהירות המאוד מאוד מאוד גבוהה שלה, שמקשה מאוד על העתקה בזמן התרגול. אבל זה ככל הנראה מתחייב בקורס הזה, כי כמות החומר לתרגול של שעתיים מאוד גבוהה ואתם באמת רוצים שיראו לכם כמה שיותר גישות פתרון לתרגילים.\nאני ממליץ כן להיכנס לשני תרגולים בשבוע. אני אישית מצטער על כך שרק לקראת סוף הסמסטר בחרתי להיכנס לתרגולים של גרשון, ועוד בתרגול פחות עמוס שלו.\nבנוסף, חשוב מאוד ללכת לשעות קבלה בקורס הזה. המתרגלים מאוד עוזרים, בפרט הילה מעין ששעות הקבלה שלה הסמסטר היו בצה\"ד והיו מפוצצות בכיתה באולמן אבל היא עדיין הצליחה לענות על כל השאלות ברמה גבוהה וגלינה ליטבינוב, האישה שכולה לב ובאמת רואה בכם בני אדם ורוצה שתצליחו.\nשעורי הבית: \nכקורס מתמטי, יש הרבה מאוד תרגילים- פתוחים ו-וובוורק. הוובוורק לפחות נגמר בשלב יחסית מוקדם עם 7/12 שנכנסים לציון, אבל בפתוחים אתם חייבים להשקיע כי הם מה שיעזרו לכם להבין את החומר ולהטמיע אותו.\nרק חבל שבגיליון הראשון נתנו לנו כאילו בכוונה שוק ובדקו בצורה מאוד מאוד קפדנית על סף הלא הוגנת.\nהמבחן: \nבסופו של דבר, המבחנים של אלון תבניתיים ואפשר ללמוד אליהם בצורה שתאפשר לצלוח את המבחן הזה. תתרגלו המון מהתחלת תקופת המבחנים\nהשורה התחתונה:\nזה קורס של סמסטר ראשון שהוא תקוע לסטודנטים להנדסה כמו עצם בגרון, וזה הכי לגיטימי שיש. אתם לא הראשונים ולא האחרונים שתסבלו בקורס הזה לאורך כל הסמסטר ואפילו יותר בתקופת המבחנים. תהיו עירניים עם הקורס הזה לאורך כל הסמסטר ותתרגלו המון. בנוסף, מאוד מומלץ להכין לעצמם דף עם רשימת המשפטים שהועברו בהרצאה והוכחו בה, כי אלון מאוד אוהב לשאול את זה. אני כן מקווה בשבילכם שיוסי כהן יחזור להיות האחראי של 1מ2, כי הוא מרצה אחראי שלפי מה שמעתי יותר אנושי.", "timestamp": 1713354447957}, {"author": "ליאור רומנו", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: \nיתרון: הכי מדויקת שיש שזה מאוד חשוב בחדוא.\nחסרון: הבנאדם רובוטריק. 0 ביחיסי אינוש. כששואלים אותו שאלה הוא ינסה קודם לסתור את ההיגיון הפנימי שבה לפני שיענה עליה.\nמה שכן - הוא עדיף מאוד על פני אלעד דוקוב שהוא סופר מפוזר ולא מדויק. על אף שנחמד מאוד ורוצה לעזור.\n\nשם המתרגל/ת: גרשון\nגרשון הוא אבי המתרגלים, הוא כנראה נועד לתפקיד הזה. \nיתרון: זורק טיפים למבחן, טריקים, מספיק המון תרגילים.\nחסרון (יחסי): מהיר מאוד. לא מתעכב על אלגברה למשל.\n\nהמבחן: \nלא קשור כל כך לחומר של הקורס. \nחובה! לתרגל הרבה מבחנים להיכנס לראש של המבחן. אבל הטריקים שלו סופיים בהחלט. \nהצ'יטים למבחן זה להבין \"צורת התנהגות של פונקציות\" - מאפשר פתרון מהיר ולא רשמי לשאלות האמריקאיות.\n\nהשורה התחתונה: have fun", "timestamp": 1714207647485}, {"author": "AAA", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  הרב אלעד דוקוב\nחוות דעת - הרצאות: \nאלעד מרצה מעולה מסביר טוב את החומר,  נעים לשבת בהרצאות ולשאול שאלות. הרבה יותר טוב מאלון לדעתי וסתם תפסו אותו על קטנות בהרצאות ובגלל זה הוא לא נחשב מומלץ. \nשם המתרגל/ת:  הילה מעיין\nחוות דעת - תרגולים: \nגרשון אובררייטד לכו להילה מעיין\n\nשעורי הבית: \n\nאל תשמשו ברפרנסים תבקשו רמזים מחברים אם צריך אבל שברו את הראש וככה תדעו שאתם על החומר\nהמבחן: \n\nלחרוש לחרוש מבחנים של אלון ואז אין הפתעות.  תתחילו לפחות שבוע קודם להתמקד רק במבחן הזה.\nהשורה התחתונה: \n\nקורס לדעתי הכי יפה הסמסטר ואל תתנו לאנשים להפחיד או להלחיץ אתכם, מי שמשקיע מצליח, וגם אם נלחץ במועד א מצליח במועד ב.", "timestamp": 1714581554466}, {"author": "RHT", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ד\"ר אלעד דוקוב\nחוות דעת - הרצאות: \nבניגוד לדעה הרווחת עליו, אלעד מרצה מצוין לדעתי, הוא מסביר טוב את החומר ונותן אינטואיציה טובה. הוא כן מתבלבל לפעמים כשהוא כותב על הלוח ולא תמיד הכי פורמלי אבל אני כן הצלחתי להבין אותו והוא עזר לי לצלוח את הקורס הזה.\n\nשם המתרגל/ת: ד\"ר אולג קליס\nחוות דעת - תרגולים: \nאולג מתרגל מעולה, יש לו אנרגיות טובות שעזרו לא להירדם בתרגולים ב8 וחצי בבוקר. הוא מסביר מעולה את החומר ונותן דוגמאות טובות (שמופיעות גם בתרגילי בית). ממליץ מאד.\nהייתי גם בתרגול אחד עם הילה מעיין ואני ממליץ מאד \n\nשעורי הבית:  יש 5 תרגילי בית די ארוכים ומתישים, בחלקם יש שאלות קשות אז ממליץ להיעזר בחברים או ברפרנסים במידת הצורך ולא לשבור את הראש שעות על אותה שאלה כי זה מיותר. \nכל שבוע מתפרסם וובוורק חדש, צריך לעשות רק 7 כדי לקבל 100, לדעתי אין סיבה לעשות יותר. בהתחלה הוובוורקים קלילים וקצרים אז כדאי לעשות, בהמשך זה פשוט נהיה ארוך ומתיש אז ויתרתי.\n\nהמבחן: \nהמבחנים של אלון מאד תבניתיים ועם למידה מספיק טובה אליהם ותרגול שאלות ממבחני עבר של אלון אפשר לקבל ציון מעולה. השאלות האמריקאיות טריקיות לפעמים אז כדאי לשים על זה את הדגש בלמידה.\n\nהשורה התחתונה: הקורס מאד מעניין לדעתי והוא גם קורס חובה אז תבואו אליו בגישה חיובית ואל תפחדו מהמילה חדו\"א", "timestamp": 1714581826049}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: הרוב התחילו אצל אלעד דוקוב וזה היה אסון, מאוד מאוד לא ממליץ לכל מי שרוצה לעבור את הקורס. מהר מאוד כולם עברו לאלון. היה בסדר גמור, לא משהו שבאים במיוחד בשבילו מחו״ל אבל סה״כ חדו״א. תראו צנזור ביוטיוב ותהיו בסדר.\n\nשם המתרגל/ת:  הילה מעייו\nחוות דעת - תרגולים:  הילה המלכה, בהתחלה קצת קשה לעמוד בקצב שלה. לדעתי עדיף פשוט לא לכתוב, לצלם את הלוח ופשוט להקשיב למה שהיא אומרת. אחת המתרגלות המעולות.\n\nשעורי הבית: \n\nהמבחן: \nמבחן של אלון זה מבחן של אלון, מצד אחד לא קל מצד שני יש מלא מבחנים שלו במודל אז הרעיון הכללי נשאר אותו דבר\nהשורה התחתונה: אין לכם ברירה כל כך", "timestamp": 1714746724181}, {"author": "מ", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nבהתחלה הלכתי לאלעד, היה על הפנים.. אחר כך ראיתי את ההרצאות של אלון במוקלט, זה סבבה אבל לפעמים לא הכי ראו את הלוח והיו כל מני בעיות טכניות. בכל מקרה אלון ממש רץ על החומר אז אני ממליצה לא לכתוב בשיעורים שלו ולקחת סיכום מאנשים אחרים אחרי או לצלם את הלוח, כי גם לכתוב וגם להבין אצלו זה די בלתי אפשרי.\nסך הכל בסוף כולם רואים צנזור.\nשם המתרגל/ת: אולג\n\nחוות דעת - תרגולים: \nאולג באמת המתרגל הכי טוב שהיה לי הסמסטר. היה מעביר לנו את כל החומר בצורה הכי ברורה וטובה, כותב הכל וגם מסביר. הוא לא מהמתרגלים שאפשר לשאול אותם אותה שאלה שוב ושוב כי הוא מצפה לרמה מסויימת של הבנה אצלו בתרגולים, אבל אם באמת מקשיבים אז אפשר להבין. הלכתי גם כמה פעמים לגרשון ואני חד משעמעית ממליצה על אולג הרבה יותר, וגם הכיתה לא הייתה מפוצצצת אז לא היה צריך להקדים לתרגולים.\n\nשעורי הבית: \nלא כייפים אבל עוזרים להבנה של החומר, צריך לעשות רק שבעה וובוורקים מתוך המיליון בערך שיש, והם הולכים ונהיים ארוכים וקשים יותר אז אני ממליצה ממש להתאמץ לקבל מאה בשבעה הראשונים אחרת זה יהיה כאב ראש. \nהתרגילי בית קשים ולא תמיד מפרגנים בציון, צריך להגיש 4 מתוך 5 אז אין מה לעשות זה חובה. \n\nהמבחן: \nהמבחנים של אלון די חוזרים על עצמם אז פשוט כדי לתרגל מלא מלא מבחנים שלו ובסוף אפשר להבין את הקטע. לא מבחן קל בכלל אבל בסך הכל היה די הוגן לדעתי. היה לנו פקטור של חמש נקודות במועד א. כל המבחן היה על השלושה שבועות האחרונים של הקורס.\nהשורה התחתונה: \nקורס חרא שמכביד על כל הסמסטר כי יש מלא מלא שיעורי בית וגם אני הרגשתי במהלך הסמסטר שאני לא מבינה כלום כל הזמן ואני מאחורה. אבל אין מה לעשות זה קורס חובה. אין לי משהו מעודד להגיד.", "timestamp": 1714982443363}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: אלון מרצה מאוד מסודר ויחסית למרצים האחרים היה נוח ללמוד איתו (מבחינת רשימות הרצאה וכו'). הוא לא ממש מסביר את החומר אלא יותר אומר אותו וזה לפעמים מקשה. אצלנו לא היו אלטרנטיבות טובות יותר.. \n\nשם המתרגל/ת: אולג\nחוות דעת - תרגולים: מתרגל מעולה! מסביר את החומר בצורה ממש טובה ונותן תרגילים מצוינים שעוזרים לפתור את השיעורי בית.\n\nשעורי הבית: די קשים, המבחן לא ממש משקף את הרמה של השיעורי בית. כדאי להשקיע אבל אין מה לשבור את הראש.\n\nהמבחן: מאוד חוזר על עצמו, האמריקאיות מבלבלות ויכולות להפיל את הציון בקלות. כדאי לעבור על כמה שיותר מבחנים.\n\nהשורה התחתונה:", "timestamp": 1715094271100}, {"author": "hamode", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: בן אדם מדויק לא אוהב כששואלים שאלה לא מדויקת , רץ בחומר ,ממליץ לא לכתוב בהרצאה שלו כי אז לא תבינו כלום . ניסיתי את כל המרצים בעיני הוא הכי טוב בין כל המרצים.\n\nשם המתרגל/ת: גרשון +אחסאן\nחוות דעת - תרגולים: אחסון מסביר לאט לאט וזה ממש עוזר כשיש חומר שאתה לא 100% , גרשון האגדה טס כמו מטוס פותר מליון שאלה בשיעור וזה קטלני אם אתה מבין את החומר ולומד בבית ועושה שיעורי בית .\n\nשעורי הבית: עמוס\n\nהמבחן: סבבה\n\nהשורה התחתונה: כמה שיותר לפתור שאלות אמריקאיות", "timestamp": 1717270306863}]}