{"posts": [{"author": "yam alaluf", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: ההרצאות היו פשוט הוא מדבר לעצמו וכותב באייפד סהכ ההסברים היו טובים אבל צריך לראות אותו מינימום ב1.75 \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת ממש טובה אבל עונה ליותר מדיי שאלות והתרגול מתבזבז על מעיקים במקום להפנות אותם לשעת קבלה \n\nשעורי הבית:  \n\nהמבחן: המבחן היה הוגן מאוד \n\nהשורה התחתונה: יותר סבבה מחדוא 1", "timestamp": 1602950070423}, {"author": "נ.א.", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  גיא סלומון\nחוות דעת - הרצאות: מרצה מעולה, מסביר מצויין ועושה את הכל כדי שכולם יבינו. היא מכין מצגות וגרפים מראש ופשוט כיף ללמוד איתו. \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת ממש ממש טובה אבל היא קצת ממהרת. היא תמיד שמה את התרגולים שלה בdropbox ו, ממליצה שתדפיסו אותם ורק תרשמו הערות אם צריך כי קשה גם לכתוב וגם לעקוב אחריה בתרגול. \n\nשעורי הבית: יש 5 תרגילי בית פתוחים ו12 תרגילי ובוורק. הכל מגן אבל מאוד ממליצה לפתור את הכל, זה מאוד יעזור.\n\nהמבחן: 10 שאלות אמירקאיות ו-2 שאלות פתוחות. היה קצת קשה אבל די הוגן ולדעתי היה ניתן לקבל ציון טוב אם מבינים את החומר. \n\nהשורה התחתונה: יש הרבה חומר בקורס, הוא די כבד אבל לא קשה. ממליצה לעשות סיכום בסוף כל נושא כי בסוף הסמסטר קשה לזכור מה למדתם בתחילתו. כמה נושאים האחרונים צריכים קצת יותר זמן להבין אותם.", "timestamp": 1613747555285}, {"author": "מבחן נורא", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: היה לא נעים לשאול אותו שאלות, היה גורם לסטודנטים להרגיש שזה לא בסדר לשאול, בגלל זה היה שקט מופתי בהרצאות שלו. השתפר לקראת סוף הסמסטר. מזל שיש את הכל מוקלט ואפשר לראות על 1.5.\n\nשם המתרגל/ת:  גרשון אברהם\nחוות דעת - תרגולים: הגרשונייה, תמיד מציל אותנו למרות שהתרגול היה בשעה מאוחרת. עוברת על החומר בצורה מלאה ונותן אחלה דוגמאות.\n\nשעורי הבית: בדיוק מה שצריך לניסיון. לעיתים מאוד ארוכים אבל הפקולטה למתמטיקה יודעים מה טוב.\n\nהמבחן: נורא ואיום. 7 שאלות אמריקאיות על אינטגרלים שאין שני אנשים שיכולים להגיד שיצא להם מה שיצא באופציות. שתי שאלות פתוחות שמי שלא שולט במשפטים על אינטגרלים חבל עליו.\n\nהשורה התחתונה: קורס קשה שישב לי על העורק כמו עלוקה.", "timestamp": 1626159246175}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nמרצה מאוד לא נעים, פעם ראשונה שלו בתור מרצה אחראי של הקורס הזה (היה של קורסים יותר מתקדמים), לא נתן תחושה בטוחה לשאול שאלות בהרצאות ונתן תחושה מזלזלת בסטודנטים.\n\nשם המתרגל/ת: אילה נטלי אביגדור\nחוות דעת - תרגולים: \nחמודה מאוד, מסבירה באופן ברור ועונה על כל השאלות. רושמת את כל דרך הפתרון בצורה מפורטת על הלוח.\nממליצה מאוד.\n\nשעורי הבית: \nנהיים יותר קשים לקראת סוף הסמסטר, אבל יש רפרנסים להכל.\n\nהמבחן: \nהיה מבחן קשה, מעבר לרמה של המבחנים משנים קודמות, אלון לא רצה לפרסם את מבנה הבחינה מראש.", "timestamp": 1626184070201}, {"author": "שם", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: חומר לא פשוט והוא לא תמיד הועבר בצורה ברורה.\n\nשם המתרגל/ת: אילה אביגדור+ רבקה אביטל\nחוות דעת - תרגולים: רבקה מפשטת את הדברים ולגמרי אפשר להסתמך רק עליה ללא תרגולים. אילה פותרת שאלות ממבחנים וממש כותבת כמו שצריך לכתוב במבחן אז זה ממש טוב.\n\nשעורי הבית: \nיש 6 הגשות לא קשות או ארוכות בערך 5-7 שאלות בהגשה.\nהמבחן: \nאלון היה המרצה האחראי. הוא בונה מבחנים דיי סבבה השאלות מכווינות לדרך פתרון אבל חשוב לשלוט בכל האינטגרלים.\nהשורה התחתונה: אין ברירה זה קורס חובה.", "timestamp": 1626617418790}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דורון \nחוות דעת - הרצאות: דורון מדהים. מלמד הכל בצורה מאוד ברורה והאווירה נעימה. תמיד עונה על שאלות לא משנה כמה מטומטמות. המרצה האחראי אלון לעומת זאת נותן הרגשה מזלזלת כששואלים שאלות. לא ממליצה ללכת להרצאות של אלון.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין על גרשון. מסביר את התיאוריה והתרגילים מעולים.\n\nשעורי הבית: בתחילת הסימטר היו מאוד פשוטים ונהיו קשים יותר לקראת סוף הסימסטר. \n\nהמבחן: קשה מאוד. היה הרבה אינטגרלים וכמעט ולא היה התמקדות על 3/4 החלק הראשון של הקורס.\n\nהשורה התחתונה: מבחן לא הוגן וקשה.", "timestamp": 1626814201121}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דורון אלעד \nחוות דעת - הרצאות: \nהרצאות ברמה טובה מלמד קצת מעבר בהוכחות (לדעתי חשוב מאוד) אווירה טובה .\nשם המתרגל/ת:  רבקה אביטל\nחוות דעת - תרגולים: \nמתרגלת מעולה באמת נותנת את הכלים כדי להצליח בקורס \nשעורי הבית: \n\nהמבחן:  המבחן היה קשה לדעתי התעסק בעיקר בהבנה ולאו דווקא מי שפתרת הרבה תרגילים יצליח.\n\nהשורה התחתונה:", "timestamp": 1626863033167}, {"author": "11", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות:  אחלה מרצה. בגלל שהיה היברידי אז היינו כיתה קטנה והוא היה ממש קשוב וושם לב למקומות בהם פחות הבנו את החומר\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל מאוד טוב וברור. קצת רץ לי\n\nשעורי הבית: כל שבוע \n\nהמבחן: המרצה האחראי היה אלון. המבחן היה הרבה יותר קשר מהשיעורי בית להגשה \n\nהשורה התחתונה:", "timestamp": 1626881688996}, {"author": "ח", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מרצה סבבה אבל מאוד קשוח לא ממש עונה על צרכי הסטודנתים אבל מבחינת חומר הוא מצוין\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: המתרגלת הכי טובה עם רמה מעולה \n\nשעורי הבית: ארוכים וצרכים השקעה\n\nהמבחן: מאוד קשה ולא סביר קבלנו פאקטור של 8 נקודות \n\nהשורה התחתונה: קורס יחסית קשה וצריך הרבה זמן והשקעה", "timestamp": 1626965369939}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה:\nאלון דמטריוק \n \nחוות דעת - הרצאות: \nאלון מנסה לגרום לכולם להיכשל בעזרת הרצאות לא מובנות בעליל, ומבחן ברמה גבוהה מאוד.\nעושה טובה שהוא עונה לשאלות, ושם רקעים מכוערים בזום\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: 1-4 סבבה, 5-6 קשים כמו ללמוד עם אלון\n\nהמבחן: דמיטריוק\n\nהשורה התחתונה: קורס קשה עם אחראי קורס קשה", "timestamp": 1627294321133}, {"author": "מחמד פוקרא", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: איום ונורה מזלזל בנו כך שךמשך כל ההרצאות דממה מוחלטת מכיוון שאינו עונה על השאלות ולא המרצה החמוד\n\nשם המתרגל/ת:רבקה \nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: \nסבירים \nהמבחן: יאאאא חבחבי\nהקורס הזה מלא בחומר אך אלון משום מה החליט שכל המבחן יתמקד באנטגראלים המבחן היה קשה מאוד ולא סביר \nמבנה המבחן גם הוא לא נוח\nומי שחושב כמוני לפתור 15 מבחנים הוא מוכן אז יחשוב פעמיים עם אלון אין שום דבר מספיק\nבתור מישהו שקיבל בחדווא 1 93  ובחדווא 2  72 עם פאקטור של 8 נקודות ממליץ לכם להתכונן טוב\n\nהשורה התחתונה:", "timestamp": 1627412917095}, {"author": "student", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: מרצה לפעם ראשונה לקורס. ההרצאות היו כמו שיעור להעתקת מילים שאף אחד לא מבין כולל המרצה:) ... \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: היה רק מתרגל אחד אז סמכנו עליה להבין את החומר. כדאי ללכת לשעות קבלה\n\nשעורי הבית: 5 גיליונות פתוחות ו10 webwork. הגיליונות כדאי לנסות לפתור לבד -רמה של שאלות מבחן. הWW רע וארוךךך  \n\nהמבחן: מבנה הבחינה שונה מזה שהיה כל השנים האחרונות (במקום שילוב בין שאלות אמריקאיות ופתוחות אז הוא הביא הכל פתוח - לא חושבת שיימשך מבנה כזה עם מרצים אחרים) יש ללמוד היטב ולהבין לעומק את החומר לא רק לדעת לפתור כמה שאלות.  \n\nהשורה התחתונה: קורס של 5 נק'.. יש להשקיע המון במהלך הסמסטר על הבנה עמוקה ולפתור שאלות כמה שאפשר.", "timestamp": 1644407541422}, {"author": "אנונומי", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שוקי\nחוות דעת - הרצאות: המרצה הכי טוב של חדווא!!!!!! ללכת אך ורק אליו.נותן דוגמאות בכיתה בלי סוף ברמה גבוהה,ולא מתקדם הלאה עד שכולם מבינים,מהצד השני,אין הפסקות בהרצאות שלו\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: דורשים חשיבה ומסכמים ברמה גבוהה מאוד את החומר הנלמד\n\nהמבחן: יוסי היה מרצה אחראי.מועד א היה מורכב ברובו המוחלט בחומר שלמדנו ב3 שבועות האחרונים של הקורס.היה קשה\n\nהשורה התחתונה: דורש השקעה!!", "timestamp": 1647363061899}, {"author": "מידע גרפי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מלכה, כרגיל. הכי הרבה מרץ שראיתי במתרגלת, מי שיכול לעקוב (קצב מהיר) יפיק המון מתרגול איתה\n\nשעורי הבית: כמצופה\n\nהמבחן: בדיוק כמו השאלות מההרצאות, והשאלות הנוספות שהוא נתן לתרגולים. \n\nהשורה התחתונה: קורס לא פשוט, חלק מהחומר לוקח הרבה זמן לעכל, בעיקר המון חומר, ובסוף: להשקיע באינטגרלים!", "timestamp": 1647705929561}, {"author": "שיר", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלעד דורון\nחוות דעת - הרצאות: גם המרצה האחראי הסמסטר. מרצה תותח, מאוד מסודר ומסביר פצצה. מאוד אכפתי קשוב וסבלני.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: אחלה מתרגלת, ברורה וכותבת מסודר, אפשר להעתיק ולהקשיב בו זמנית\n\nשעורי הבית: ארוכים ברמות. הגיליונות חשובים להבנה ומכינים טוב למבחן, וובוורקים סתם מתישים (רק בשביל המגן אולי שווה)\n\nהמבחן: קשה, לחרוש טוב למבחן, ממש מכסים את כל החומר במבחן.\n\nהשורה התחתונה: אינטגרלים!! לפתור אינטגרלים עד זוב דם", "timestamp": 1658159952776}, {"author": "גאוס", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nמרצה מעולה, אנרגטי, נותן דוגמאות מעולות שמשלימות את התרגול מאוד טוב, קשוב ואכפתי. \nשם המתרגל/ת: אירנה \nחוות דעת - תרגולים: \nמתרגלת מעולה\nשעורי הבית: \nקל מאוד לרפרנס, תעשו לעצמכם טובה ותשקיעו ותלמדו מהם כמה שיותר. תשקיעו המון המון באינטגרלים!!!\nהמבחן: \nהמבחנים הוגנים, יש חלקים ממש קלים שהופיעו בתרגולים/שיעורים בשינויים קלים ועוד מספר שאלות בודדות שמבדילות בין ה90 ל100.\nהשורה התחתונה: \nקורס עמוס עם מגוון נושאים מאוד רחב, צריך ללמוד בצורה רציפה כל הסמסטר וככה להצליח", "timestamp": 1658401545235}, {"author": "...", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דורון אלעד - מרצה אגדה\nחוות דעת - הרצאות: עושה הכל כדי שנבין בצורה הטובה ביותר. באמת ההרצאות הן חוויה.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: קצת רץ, התרגול מתאים בעיקר למי שעבר על החומר לפני. מי ששכח את החומר - גרשון לא ימתין ויסביר מחדש עבורו. אני רואה את זה כיתרון ו\"בוסט\" עבורנו לעבור על החומר לפני התרגול.\n\nשעורי הבית: לא נוראיים\n\nהמבחן: קשה וארוך כמו הגלות. לא סיימתי אותו בכלל, אך קיבלתי ציון בסדר.\n\nהשורה התחתונה: קורס לא פשוט בכלל, לא לזלזל!", "timestamp": 1658750723645}, {"author": "עומר", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות:  מרצה טוב, מסביר ברור\n\nשם המתרגל/ת: קרואן \nחוות דעת - תרגולים: קצת מהירה אבל אם לא כותבים היא מעולה! פותרת המון שאלות בכל תרגול.\n\nשעורי הבית: ארוכים ומתישים. וובוורק- לא להתקע על השאלות שנראות מומצאות- זה לא סוג השאלות במבחן.\nהגליונות רלוונטיים ברובם.\n\nהמבחן: קשה יותר מהמבחנים של דורון בשנים קודמות ועמוס, היה ארוך מידי בשביל הפרק זמן שהוקצב לנו. \nנתנו פקטור של 3 נקודות לציון הסופי, הממוצע במבחן היה 54 עם 45% נכשלים...\n\nהשורה התחתונה: קורס קשה, צריך ללמוד טוב במהלך הסמסטר. לחזור על החומר לפני הרצאה ותרגול.", "timestamp": 1658941106450}, {"author": "הילה", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה טוב, אפילו מאוד . מעביר את החומר בצורה ברורה מאוד . \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מדבר מהר מאוד, עסוק בלסמן וי על כל מה שצריך להעביר ובו זמנית מקפיד לגלגל עיניים על שאלות שמעכבות אותו בדרך למטרה זו . לצערי, לא הייתה אלטרנטיבה טובה יותר .\n\nשעורי הבית: חשוב לעשות, כדי לנסות להבין בכלל מי נגד מי, עם זאת, מזל שהיה רפרנסים ברמה הגבוהה ביותר להכל .\n\nהמבחן: היה 7 רמות מעל מבחנים אחרים שדורון כתב בשנים הקודמות והממוצע יעיד על כך . אני השתמשתי בשירותיו של חן הררי, שמעביר פק\"ל אינטרנטי בשביל לעבור את המועד א בשלום . ממליצה מאוד .\n\nהשורה התחתונה: קורס קשה, הפק\"ל של חן עזר מאוד לעבור אותו, תעשו הגשות כמה שיותר לבד .", "timestamp": 1659093010243}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה מצוין! מסביר את החומר לעומק, ולרוב בצורה תאכלסית. נותן דוגמאות מצוינות לחומר הנלמד.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: יותר טוב מחלק מהמתרגלים בקורס, אבל עדיין יש מקום לשיפור. נותן תרגילים ברמה יחסית בסיסית ביחס לש\"ב ולמבחן. הוא מפרסם מראש דפי עזר עם הסברים על החומר בתרגול ועם התרגילים של התרגול והפתרונות. מצד אחד זה יתרון שהכל נגיש, מצד שני זה חיסרון משמעותי אם אתם בונים על לכתוב בעצמכם את התרגילים מהתרגול - בגלל שהכל כתוב הוא רץ על זה, מדלג על שלבים ומתייחס להכל כאילו זה מובן מאליו. אם אף אחד לא יעצור אותו ויבקש הסבר הוא פשוט ימשיך לרוץ על החומר.\n\nשעורי הבית: הרבה שיעורי בית, כיאה לקורס בסיס במתמטיקה. בערך כל שבוע נפתח גיליון בWEBWORK, חלקם ארוכים. במהלך הקורס היו לנו 6 גיליונות להגשה בכתב ברמה הוגנת. כל גיליון 2% מגן.\n\nהמבחן: דורון בנה מבחן פייר אבל ברמה גבוהה. המבחן הקיף כמעט את כל החומר שלמדנו בקורס. הבעיה הייתה שהוא היה מאוד עמוס ביחס לכמות הזמן שהוקצתה למבחן, אז לא היה זמן לנשום, והרבה סטודנטים אפילו לא הספיקו לגמור אותו. מומלץ לא להשאיר את השאלות הפתוחות לסוף, כי פשוט לא יהיה לכם זמן.\n\nהשורה התחתונה: חומר קצת מוזר לתפיסה. לא מתקטננים על שטויות כמו בחדו\"א 1.", "timestamp": 1662363472507}, {"author": "Itai David", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: \nההרצאות של דורון הן מאוד מפורטות, *מאוד*, וכל פרט קטן חשוב. לכן מומלץ להקשיב להן בגרסתן המוקלטת ולהבין ולהעתיק כל פרט\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nמאוד נחמדה ובאמת מקדישה זמן להסביר אם יש לך איזשהי בעיה\nשעורי הבית: לא לזלזל בהם בשום פנים ואופן! מאוד מפתה שיש את התשובות אבל חשוב להבין גם\n\nהמבחן: מאוד קשוח, דורש לא רק ידע בסיסי אלא גם הבנה\n\nהשורה התחתונה: זה לא המתמטיקה שאתם מכירים בכלל, לא מהתיכון או המכינה, תקדישו לזה תשומת לב, לא רק כדי לעבור את המבחן, אלא גם כי הקורס הזה משנה את הדרך שבה אתם מסתכלים על מתמטיקה בכללי", "timestamp": 1664441449174}, {"author": "Chen Gal", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: לא משהו, פותר תרגילים בסיסיים בלבד. ניתן למצוא את התרגולים שלו באינטרנט\n\nשעורי הבית: לא מעט, ברמה טובה\n\nהמבחן: מעט קשה\n\nהשורה התחתונה: קורס חובה", "timestamp": 1666286975660}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה מעולה, אולי טיפה מתנשא אבל זה בקטע ציני. הוא ממש שולט בחומר ועונה בפירוט על כל שאלה. מרצה מסודר ומאורגן. מומלץ מאד. \n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת מעולה, הכל ברור ומובן, תמיד מסבירה ומפרטת ועונה על כל שאלה. \n\nשעורי הבית: לא פשוטים אבל קריטיים להבנת החומר\n\nהמבחן: מבחן הוגן עם שאלות ברמה סבירה. מי שבא מוכן ולא עושה טעויות מפגרות יצליח\n\nהשורה התחתונה: קורס שדורש השקעה והבנה עמוקה, אבל אפשרי", "timestamp": 1666953452112}, {"author": "adam shhady", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: \nההרצאות ממש העתקה מדף וההסברים שלו לא כל כך טובים למרות שהוא מלמד בצורה שמראה שהוא מתעניין בחומר ובממתמטיקה ופיזיקה אבל תחלס ההסבר שלו לא ברור והוא לא כל כך יודע אך לענות לסטודנטים (למרות שהוא מתיחס והכל) הוא גם מהיר ממש ומקריא הרבה כשאין לו חושק לכתוב על הלוח\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: \nאיטית ולוקחת את כל הזמן שלה להסביר דברים קטנים או לענות על סטודנטים\nשעורי הבית: \nלא קשיים ופתורים\nהמבחן: \nקשה קצת וצריך הרבה הבנה והעמקה להחומר (החומר ממש ארוך ) מומלץ לרשום את כל ההוכחות בדף נפרד ולעבור עליהם לפני  המבחן ולתרגל הרבה תרגולים בכל הנושאים \n*לא להשקיע כל כך בהוכחות זה סתם 15 נקודות אם אתה לא חזק בשאר הדברים אז לא להשקיע בהוכחות\nהשורה התחתונה: \nקורס ארוך לוקח זמן והתרגוים לא טובים ...", "timestamp": 1676291043482}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה:קליס אולג\nחוות דעת - הרצאות: אם באפשרותם ללכת למרצה אחר ת אז עדיף . ואם כ מרצה אחראי בינו לאחר תבחרו באחר . ההרצאות שלו לא מובנות . מורגש שהוא רק מעתיק מהלוח ולא מבין . מצד שני הוא מתעולל בסטודנטים שלא צופים בהרצאות שלו בזה שבמבחן הוא מביא דברים ש הזכיר בהרצאה או הוכחות . תכלס מרצה מוזר ולא מובן  \nשם המתרגל/ת: גלינה \nחוות דעת - תרגולים: חמודה ת מסבירה טוב בכללי אבל השאלות שלה ברמה נמוכה יחסית לקורס ולמבחן ולחומר\nהיא כאילו משעמם לה היא באה לסיים את שתי השעות וזהו לא כלכך מתעניינת בדברים\nשעורי הבית: בסדר 5 גליונות ברמת מבחן עדיפים מ ווב וורק הזוי\n\nהמבחן: מבחן מוזר כמו המרצה הלא מובן בהרצאות שלו ו ב אישיות שלו ת כל המבחן שאלות פתוחות . ורמה לא קלה כמו בשנים האחרים שך המרצה הזה ת 15 נקודות על ציטוט והוכחות . בסוף שני שליש נכשל עם ממוצע 44 ונאלץ לתת פקטור לא שווה ל כולם ש גם \"מוזר\" עד שהגיע הממוצע ל 56\n\n\nהשורה התחתונה: אל תיקחו עם המרצה המוזר הזה", "timestamp": 1676558936365}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלקס\n למה לעשות מבחן בסגנון של אלקס אם אפשר לעשות אותו בסמסטר אביב עם ציון גבוהה \nמה לא נשאר מרצים בטכניון? זה לא הגיוני, הוא והמבחן שלו ותרגלי הבית\nאם יש פער יותר מ 25 נקודה בין ממוצע אלקס ובין מבחן רגיל, זה אומר שהסטודנטים הם הבעיה?\nכל המבחן הוכחות מהנולולו\nהשורה התחתונה: אל תיקחו עם אליקס נקודה שורה חדשה.", "timestamp": 1677612181103}, {"author": "וו", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: קליס אולג\nחוות דעת - הרצאות: רעות ברמה \nהרצאות של העתקה חבל על הזמן\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מאוד משעממות ולא מעילות בכלל\n\nשעורי הבית: \nמאוד קשה לפתור, צריכות הרבה זמן \nהמבחן: לא הומוגני, הרוב נכשל או לא השלים \nהממוצע של הקורס בדכ טוב אבל אצל אולג עם פאקטר היה ב 50\nצריכים תואר במתמטיקה לפתור\n\nהשורה התחתונה: אל תכחו קורס כשאולג המרצה האחראי", "timestamp": 1679042674922}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: המרצה הזה הוכיח שהטכניון עושה מ טפשים מרצים. לא יודע להסביר , ההרצאות שלו שעמום הכל לא מובן , תכלס אל תיקחו איתו , מבחן טפש כמו המרצה שעשה אותו  , כל המבחן פתוח, נכשלו רוב הסטודנטים , ובסוף נתן פקטור כמעט 10 נקודות והממוצע נשאר על חמשים \n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: \nסבבה , השאלות שלה לא רמה אבל בכללי בסדר\nשעורי הבית: ברמת מבחן , סך הכל בסדר\n\nהמבחן: מבחן טפש כמו המרצה שעשה אותו  , כל המבחן פתוח, נכשלו רוב הסטודנטים , ובסוף נתן פקטור כמעט 10 נקודות והממוצע נשאר על חמשים \n\nהשורה התחתונה: אל תקחו עם המגעיל הזה", "timestamp": 1680340961852}, {"author": "Noam Almog", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nלא מעביר את החומר בצורה מעניינת וקשה ללמוד את החומר ממנו, אבל מצחיק ונעים הליכות\nשם המתרגל/ת: שוקי ארואס\nחוות דעת - תרגולים: \nשוקי הוא הקלף הכי חזק בפקולטה למתמטיקה\nשעורי הבית: \nלוקחים זמן, דרושים להבנת החומר\nהמבחן: \nפייר\nהשורה התחתונה: חדו\"א 2 מה נגיד", "timestamp": 1689666299460}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: יותר כמו שיעור הכתבה אבל יוסי באמת אחלה של בן אדם ורואים עליו שיש לו לב טוב.\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: המלכה של היקוםםם קצת מהירה אז היא לא מתאימה לכולם אבל תמיד יש אווירה טובה והיא משתדלת שכולם יבינו.\n\nשעורי הבית: לא קשים מדי אבל גם לא קלים\n\nהמבחן: יוסי היה ממש הוגן לדעתי המבחן היה אפילו קל למרות שלא ידעתי עד הסוף את החומר.\n\nהשורה התחתונה: לא קורס פשוט, קצת פחות אינטואיטיבי אבל ממש אפשרי.", "timestamp": 1689666422496}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: הרצאות מעניינות, יוסי אוהב לזרוק מדי פעם בדיחות קלילות כדי להשאיר את הכיתה בקשב.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מדהימה! יודעת על איזה חומר לשים יותר דגש ומה יותר טכני. מראה בתרגולים שפע דוגמאות ושיטות לפתירה.\n\nשעורי הבית: 10 גליונות WW מתוך 12, 6 תרגילי בית פתוחים. ממליץ להשקיע ולפתור עצמאית, ולרפרנס רק אם באמת אין ברירה.\n\nהמבחן: הוגן מאוד, שאלות אמריקאיות ופתוחות. חלק מהשאלות לוקחות 2 דקות וחלק חצי שעה.\n\nהשורה התחתונה: קורס חובה, אבל עם המרצים והמתרגלים הנכונים (והשקעה בשיעורי הבית!), אפשר להוציא ציונים לא רעים בכלל.", "timestamp": 1689698862663}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד\"ר יוסי כהן\nחוות דעת - הרצאות: אני התחברתי לדרך העברת החומר של יוסי, דאג לתת זמן להעתיק וענה על שאלות של סטודנטים. ההרצאות עברו קצת בתחושה של הכתבה אבל האווירה בכיתה הייתה טובה ויוסי אחלה של בן אדם. ביטל לנו מספר וובוורקים לאור העומס והיה מאוד מתחשב בצרכים של הסטודנטים\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מתרגלת מצוינת, מעבירה את החומר בצורה טובה וברורה. הייתה בשעות קשות אבל עדיין הצליחה לשמור על הכיתה מרוכזת. קצת קשוחה אבל בסך הכל מתרגלת טובה ומסודרת.\n\nשעורי הבית: בהתחלה היו אמורים להיות 12 וובוורקים כשחייבים להגיש 10, שינו את זה ל10 וובוורקים כשלוקחים את ה8 הטובים ביותר, בנוסף ל-6 תרגילים להגשה - ציון על ה5 הטובים ביותר.\nהעבודות בית לא היו קשות מידי אבל כן לקחו הרבה זמן, בגלל זה עזר מאוד שהורידו חלק מהוובוורקים שהיו ארוכים מאוד.\n\nהמבחן: 7 שאלות אמריקאיות שמתוכן היה צריך לענות על 6 ו-3 שאלות פתוחות. היה מבחן טכני והוגן מאוד, השאלות האמריקאיות בעיקר היו מאתגרות אבל סך הכל אין תלונות\n\nהשורה התחתונה: הקורס הכי נחמד שהיה לי הסמסטר, הרבה יותר נחמד וקליל מחדוא 1, יוסי אחלה מרצה והאווירה בקורס הייתה טובה.", "timestamp": 1690118325932}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: לא ממש מועילות\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: מושלם! מאוד רוצה שנצליח, ממליצה גם לבוא לשעות קבלה שלו.\n\nשעורי הבית: כמויות מוגזמות\n\nהמבחן: קשההההה\n\nהשורה התחתונה:", "timestamp": 1691437800978}]}