{"posts": [{"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: ככה ככה.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מסבירה מצוין.\n\nשעורי הבית: די טכניים. מדי פעם יש שאלות קצת מאתגרות.\n\nהמבחן: בגלל אילוצי המגפה, המבחן היה מקוון עם חומר פתוח. יחסית מאתגר בהשוואה לסמסטרים קודמים.\n\nהשורה התחתונה: לא קורס קל מדי אך לא קשה מדי. אילוצי המגפה הפכו אותו לקשה יותר מבדרך כלל.", "timestamp": 1602405998556}, {"author": "י", "difficultyRank": 2, "generalRank": 4, "semester": "201903", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: בהתחלה הוא נתן לנו הרצאות מוקלטות ממצגת של 10 דקות, זה היה זוועה, לא הבנתי כלום מההרצאות בכלל בכלל. אחרי שדיברנו איתו הוא עשה הרצאות בלייב שהיו משמעותית הרבה יותר טובות וברורות. בסה\"כ שלומי הוא מרצה נחמד ומאוד קשוב לסטודנטים שזה דבר טוב. \n\nשם המתרגל/ת: מרינה \nחוות דעת - תרגולים: התרגולים היו מוקלטים, והם היו התרגולים הכי טובים שהשתתפתי בהם! מכילים המון חומר, כולל חומר תיאורטי, פשוט תענוג. היא קיימה שעות קבלה ועזרה לכל אחד ואחד והיא בכללי הייתה ממש מעולה\n\nשעורי הבית: בקיץ יש 5 גליונות, אני מניח שבמהלך סמסטר רגיל הוא פורס יותר גליונות, קשים, אבל פתירים ומלמדים.\n\nהמבחן: היה מבחן מאוד הוגן לדעתי ( היה גם חומר פתוח בגלל הקורונה)\n\nהשורה התחתונה: קורס חשוב, אפשר להוציא בו ציון טוב!", "timestamp": 1602593252291}, {"author": "Yazan Naser", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: מסבך את הכל אבל סבבה\n\nשם המתרגל/ת:מרינה גרוזד  \nחוות דעת - תרגולים: אין מילים המתרגלת הכי נחמדה,עושה הרבה שיעורי השלמה אבל שווים ללכת אליהן,ממש מסכמת המון דברים מההרצאות אחלה של מתרגלת.\n\nשעורי הבית: יחסית סבירים לפתור שאלה אחת כל שבוע\n\nהמבחן: אין לי מושג\n\nהשורה התחתונה:", "timestamp": 1612294351812}, {"author": "טמ", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מומלץ בחום - מסודר מאוד ומסביר מובן ולעומק\n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים:  מרינה מתרגלת ותיקה ומעולה מומלץ בחום\n\nשעורי הבית: קלים וממוחזרים\n\nהמבחן: \n\nהשורה התחתונה: חומר משעמם וטכני", "timestamp": 1612615596215}, {"author": "לפלס", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: ההרצאות היו מובנות ומוסברות בצורה ממש מעניינת. אם לא חוזרים על החומר לפני כל הרצאה או לפני כל כמה הרצאות, ממש קל להתעכב על דברים הזויים.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: אין על מרינה. \nנותנת \"אלגוריתמים\" לפתרון בעיות מוסברות לכל מקרה.\n\nשעורי הבית: שאלה כל שבוע אך מאוד מומלץ לפתור את כולם, כי לפעמים השאלות המעניינות (שיכולות להופיע במבחן) הן אלה שלא להגשה.\n\nהמבחן: זה תלוי בכל סמסטר ומועד. זה יכול להיות ממש ממש קשה וצריך לחשוב טוב, באותה מידה שזה יכול להיות טכני. תהיו מוכנים למבחן תיאוריטי וקשה וזה יהיה בסדר. \nבמקרה שלנו זה היה טכני וקליל (גם עם חומר פתוח).\n\nהשורה התחתונה: קורס ממש מעניין (ספיציפית החלק של טורי פורייה), מצריך השקעה של Spaced-Repetitions. \n\nלחברה של ביורפואה, אין מה לדאוג עבור \"התכנסות במ\"ש\" זה לא יהיה קשה, אבל מומלץ לתת לזה קצת זמן כדי להבין את הרעיון בגדול.", "timestamp": 1613409587011}, {"author": "לפלסיאן", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: \nמאורגן עם מחברת הרצאות- מהדברים שגרמו לי מלכתחילה לראות אותו.\nכותב בנוסף עם לוח אלקטרוני דברים שהוא רוצה להתעכב עליהם - מוסיף מימד שלא קוראים רק את הסיכום.\nבסך הכל מרצה טוב אבל קשה להתעלם מהפער העצום מהתרגולים - הרגיש לא פעם שאפשר לוותר על ההרצאות ולראות רק תרגולים עם כמה שהחומר תיאורטי בהרצאות.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nמתרגלת וותיקה ומעולה.\nלא עבדה עם מחברת תרגולים אבל אפשר לסלוח.\nמדי פעם נתנה בסוף תרגול שאלה של מבחן לנסות לבד כמה דקות וחזרה לפתור - אהבתי.\n\nשעורי הבית: \nכל שבוע גיליון של 3-4 שאלות, רק 1 להגשה, לוקח כלום זמן לפתור ומומלץ לפתור את תרגילי הרשות כדי להעמיק (במבחן יש בדרכ שאלת ש\"ב)\nהמבחן: \nבנוסח קורונה 3 שעות עם חומר פתוח במחשב (כולל וולפראם ודסמוס), המבחן היה הוגן מאוד ונתן נפח של הבנה וטכניקה.\n(כפוף לכך שהציון עדיין לא פורסם)\n\nהשורה התחתונה: \nקורס חובה שאפשר להגיע איתו לציונים גבוהים עם השקעה לא יוצאת מגדר הרגיל.\nהש\"ב משאירים אותך בלופ בגלל שכל שבוע יש שאלה להגשה.\n4 דרקונים", "timestamp": 1614181794507}, {"author": "און פביאן", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מסביר מהר, מומלץ מאוד לעבור על ההרצאה לפני ההרצאה הבאה אחרי זה קצת בשוק\n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: טובה, מסבירה הכל מפורט ומשקיעה.\n\nשעורי הבית: קצרים, תרגיל 1, מומלץ לעשות את כל הגליון ולא רק השאלת הגשה\n\nהמבחן: היה פייר, בדיקה קשוחה, אפשר להצליח בקלות\n\nהשורה התחתונה: דורש השקעה", "timestamp": 1614283796044}, {"author": "סטודנט כללי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: יוחאי מרצה ברור, מתנהל בצורה נעימה ומכבדת. הקורס מכיל הרבה דוגמאות, חיושבים ומשפטים אז לעיתים יכול להיות קשה לעקוב אך זה משתלם.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת מעולה, מעבירה את כל הידע הנדרש כדי להתמודד עם בעיות בקורס.\n\nשעורי הבית: 8 גיליונות חובה שמתוכם רק תרגיל יחיד בכל אחד להגשה. לא עמוד, למי שיש זמן מומלץ לפתור גם את התרגילים שאינם להגשה בכל גיליון.\n\nהמבחן: לא מעט טכניקה אך גם חשיבה והוכחות. מאתגר אך הוגן.\n\nהשורה התחתונה: קורס נחמד.", "timestamp": 1614284656128}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אבי ואז יוחאי\nחוות דעת - הרצאות: בהתחלה התחלתי אצל אבי ובהמשך עברתי ליוחאי. אבי מרצה נעים מאד, נחמד ועונה על כל השאלות, אבל יש לו קול מאד מונוטוני ולי היה מאד קשה לעקוב אחריו. הוא מקריא מתוך סיכומים מוכנים מראש ולא באמת טורח לכתוב ולעשות דוגמאות אלא רק מראה אותן, ועל הרבה דברים טכניים הוא אומר שאין מה להתעכב על זה כי אפשר לקרוא אחר כך בסיכומים. בנוסף מדלג על משפטים חשובים בקורס. צריך לקחת את זה בחשבון - מי שבוחר להיות עם אבי, צריך להקדיש זמן מה במהלך הסופש על מנת לעבור על הסיכומים שלו ושל המרצה האחראי (אצלנו זה היה שלומי) ולוודא שלא התפספסו משפטים או דוגמאות חשובות. לקראת סוף הקורס כבר איבדתי את אבי לחלוטין ועברתי ליוחאי, ההבדל היה ממש שמיים וארץ.\n\nשם המתרגל/ת: ליטל ואז מרינה\nחוות דעת - תרגולים: שתיהן מתרגלות טובות מאד ומאד הפקתי משתיהן. הסיבה למעבר היא שההרצאות של יוחאי היו על שעות התרגול של ליטל. ליטל שמה המון דגש על דברים קטנים שיכולים להפיל סטונטים במבחן - מאד עוזר, מאד דוגלת בלהבין מה עושים מאשר לזכור את הקורס כמתכון. מאד התחברתי לגישה הזו. מרינה קצת יותר בגישה השניה.\n\nשעורי הבית: מאד קלים, מרופרנסים. עדיף להשקיע קצת יותר במהלך הסמסטר ביותר תרגול מאשר מה שנותנים בשיעורי הבית.\n\nהמבחן: היה לנו חומר פתוח וגישה לדסמוס וולפרם. המבחן כלל היבטים טכניים מאד וגם קצת הוכחות - לא קשה מאד.\n\nהשורה התחתונה: קורס נחמד, מעניין, ניתן להוציא ציון טוב בהשקעה במהלך הסמסטר", "timestamp": 1614332523875}, {"author": "ביאן", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מעין יוחאי\nחוות דעת - הרצאות: מסביר החומר בצורה טוב, החומר ארוך וקשה ויש מלא שלבי פתרון.\n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: מתרגלת טובה, מעבירה את התרגולים בצורה ברורה ומסכמת חומר מההרצאות. עושה תרגילים כלליים כך שנהיה מוכנים להכל.\n\nשעורי הבית: לא קשים ולא עמוסים, (בסמסטר קורונה) היה צריך להגיש תרגיל 1 מכל גליון.\nגליון אחד (כל התרגילים שבו) לא לוקח יותר מ-3 שעות ומומלצץ לפתור את כל הגליון כדי להכניס את שלבי הפתרון בכל נושא לראש.\n\nהמבחן: המבחן היה סביר מבחינת זמן אבל שאלה של 40 נק' לא הייתה הוגנת עקב אי-הבנה של משפט מההרצאה (הרבה סטודנטים נפלו בזה)\n\nהשורה התחתונה: קורס קשה קצת וחובה אבל עם תרגול עצמי יהיה סבבה.\n(בסמסטר קורונה היה אפשר להכניס חומר עזר)", "timestamp": 1614519328125}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות:  מעביר טוב את החומר, עונה על שאלות מדגים את רוב הדברים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שאלה פעם בשבוע, ממולץ לפתור כהכנה למבחן ובשביל המגן.\n\nהמבחן: המבחן עם חומר פתוח, היה מבחן לא קשה אבל הבדיקה הייתה קשוחה מידי.\n\nהשורה התחתונה:", "timestamp": 1614622288863}, {"author": "כללי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוחאי  \nחוות דעת - הרצאות: \nמעביר את החומר בצורה ברורה ואיכותית\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: \nמעבירה את התרגולים מאוד מהר, לא מבצעת הבחנה בין מקרים פרטיים לכלליים\nשעורי הבית: \n-\nהמבחן: \n-\nהשורה התחתונה:", "timestamp": 1614836039138}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: מעולה. ענייני ומקיף טוב את החומר. נותן טיפים ודוגמאות מעולות. \n\nשעורי הבית: יבש אחת לשבוע. מומלץ לעשות כדי להיות בעניינים ובנוסף יש במבחן תרגיל משיעורי בית.\n\nהמבחן: תלוי במצב רוח של מרצה אחראי. סמסטר חורף 2021 היה פייר לגמרי ואפילו קל יחסית לשנים קודמות\n\nהשורה התחתונה: קורס חובה", "timestamp": 1616409633316}, {"author": "SG", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: שלומי בחצי הראשון, ניזאר בחצי השני\nחוות דעת - הרצאות: ההרצאות של שלומי היו על הפנים. ההרצאות היו בזום בלבד (אולי בצורה פרונטלית הוא יותר מוצלח), ושלומי היה מאוד לא ברור. חייב לציין שדווקא הרגשתי שהוא כן מנסה להשתפר - שלח סקרי הוראה במהלך הסמסטר כדי להבין איפה הבעיות, ואפילו אימץ כמה הצעות ששלחו, אבל זה לא ממש עזר, ובאמצע הסמסטר עברתי לניזאר (היברידי), שהיה יותר מוצלח.\n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: מדהימה. מאוד מסודרת, מסבירה סופר ברור.\n\nשעורי הבית: גיליון יחסית מרופרנס כל שבוע, אצלנו המגן היה על ה8 הטובים ביותר.\n\nהמבחן: על הפנים. מועד א' היה מאוד קשה ברמה, מועד ב היה ברמה הוגנת אבל ארוך בצורה לא נורמלית. \n\nהשורה התחתונה: קורס חובה :(", "timestamp": 1634566520328}, {"author": "-", "difficultyRank": 5, "generalRank": 3, "semester": "202003", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: ההרצאות היו ממש לא טובות. הוא דיבר לעצמו ולא הוכיח שום דבר למרות שבמבחן צריך לדעת את ההוכחות. עברתי לראות הרצאות מוקלטות של יוחאי מסמסטר חורף שהן בפער יותר טובות והסבירו את כל החומר בצורה ברורה וחבל שלא עשיתי את זה מתחילת הקורס.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת טובה, סבלנית ומסבירה ממש הכל בצורה מפורטת. העלתה גם תרגולים מוקלטים שלה מקיץ קודם באולפן שהיו ממש טובים ומסבירים. חיסרון יחיד שהיא מהירה בטירוף אז צריך להתכונן.\n\nשעורי הבית: קיץ זה סמסטר קצר, אז היו 5 גיליונות עם 3-5 תרגילים בשבוע. די אינטנסיבי ועמוס אבל יש רפרנסים.\n\nהמבחן: המבחן היה משולב עם מועד ב' של האביב. ארוך בצורה מוגזמת והכניסו אליו נושאים שבפירוש נאמר שלא יהיו במבחן.\n\nהשורה התחתונה: קורס די טכני ואפשר להצליח בו עם הרבה תרגול, נחמד לעשות בקיץ ולהוריד עומס מסמסטר חורף אבל אם המרצה האחראי לא טוב אז חבל לבזבז את הזמן.", "timestamp": 1640623914334}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: \nלא מומלץ. אמנם הוא מרצה אחראי בכל הסמסטרים האחרונים, אבל הוא מרצה לא טוב, ויסכימו איתי הרבה אנשים שלמדו איתי. הוא לא מסודר, אין קישור בין משפטים שהוא אומר, לא נותן אינטואיציה לרוב. בדיעבד הייתי הולכת להרצאות של אבי או רואה את ההרצאות המוקלטות של יוחאי מעיין.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nאיטית מאוד יחסית למתרגלים אחרים, מספיקה הרבה פחות. כן נותנת אינטואיציה טובה לדברים ומביאה דוגמאות קשות וארוכות, אבל כנראה שבקורס הזה עדיף לראות הרבה תרגילים ברמה של מבחן במהלך התרגולים מאשר תרגילים כמו שהיא הביאה. בדיעבד הייתי הולכת לגיא או למרינה.\nשעורי הבית: יש רק תרגיל הגשה אחד בשבוע, ועוד כמה שלא להגשה. ממליצה ממש לעשות גם את התרגילים שלא להגשה, אם מספיקים, כי תרגיל אחד פשוט לא מספיק כדי להבין את החומר במהלך הסמסטר, שמסתבך בחצי השני של הסמסטר.\n\nהמבחן: \nעוד לא היה כשאני כותבת שורות אלו, אבל ממבחני עבר של שלומי הוא יחסית טכני, אך ארוך.\nהשורה התחתונה: \nלמרות ששלומי מרצה אחראי והרבה ממליצים על ליטל, בעיניי עדיף לראות מרצה ומתרגל אחר.", "timestamp": 1644744460873}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: לא הייתי. תחפשו מספר קורס בפנופטו ותמצאו הרצאות של יוחאי. בכל מקרה, החומר מטורף ומגניב אבל מועבר בצורה משעממת. חוץ מזה, הסגל מכריח אותך \"לפתור כמו תוכי\" ויש 0 דגש על הבנה ואינטואיציה.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: ספר מתכונים\nתזכרו ככה, תזכרו פה, תזכרו שם \n\nשעורי הבית: יש גיליון שבועי, תרגיל אחד. לפתור כמו תוכי, להסתכל ברפרנס לראות שהבנת נכון באיזה מתכון להשתמש ולהמשיך בחיים\n\nהמבחן: ביחס לרמה הביזיונית של הקורס הוא מותאם טוב. לפעמים צריך קצת להזיע ולחשוב יצירתי, אבל ממש קצת\n\nהשורה התחתונה: אם מישהו שואל למה הטכניון מאבד מהיוקרה שלו, תראו לו מה לומדים במדח וטורי פורייה", "timestamp": 1645203834877}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: התחלתי עם שלומי אבל הוא מאוד מבולגן וההסברים שלו לא ברורים אז עברתי לראות את יוחאי מוקלט והיה בסדר.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: היא משקיעה יותר זמן על לפתור \"תרגילים\" כמה שיותר כללי,ומכינה מאין מתכונים של מה לעשות, אני פחות מתחבר לזה בתרגול אני צריך לראות בתכלס איך פותרים כי באופן כללי יש בהרצאה לכן השתמשתי גם ברשימות של גיא בעיקר לקראת המבחן והן אחלה.\n\nשעורי הבית: \n12 גיליונות של שאלה אחת להגשה בכל גליון והשאר תרגול עצמי. צריך 11 גליונות בשביל 4 נקודות תוספת לציון הסופי. לרוב לא לוקח הרבה זמן אבל לא מלמד יותר מידי. חלק מרופרנס.\nהמבחן: מועד א היה הוגן ממש. לתרגל מספיק מבחנים של ומזהים דפוס חוזר.", "timestamp": 1645716611586}, {"author": ".", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: פשוט זוועה. הוראה באיכות מאוד ירודה. לא יודע להסביר שום דבר ואף אחד לא מבין אותו.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מצוינת!\n\nשעורי הבית: אין הרבה אבל גם המגן הוא פשוט כלום.\n\nהמבחן: כיסחו ממש במבחן באופן מאוד לא הוגן. התנהלות זוועתית של המרצה האחראי לאורך כל הסמסטר וכמובן גם בבחינה.\n\nהשורה התחתונה:", "timestamp": 1645720720270}, {"author": "ראש צבע אפרון", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nאבי לוי \n\nחוות דעת - הרצאות: \nמרצה ממש טוב, מסביר מעולה את החומר ונותן מלא הבנה על מה שקורה בקורס, למרות שזה קורס שמכסה מלא חומר. אבי גם מאוד נעים וקשוב לשאלות של הסטודנטים. \nהחיסרון היחיד זה שהוא טיפה לא מסודר לפעמים, אבל הוא מפרסם רשימות מוקלדות של הקורס אז אפשר לקרוא מקסימום. ממולץ.\n\nשם המתרגל/ת: \nגיא בר-שלום\n\nחוות דעת - תרגולים: \nמתרגל מצויין, מסביר באופן מאוד פרקטי איך פותרים כמעט כל סוג שאלה שיכול להופיע. מספיק מלא תרגילים והמון טריקים לפתרון, בנוסף מתרגל ממש מכוון למבחן שזה מעולה לדעתי. \n\nשעורי הבית: \nשאלת הגשה אחת בשבוע, אם עשיתם את כולם (אולי כולם חוץ מאחת) 4 נקודות תוספת לציון, שזה ממש מעולה שזה לא באחוזים. שווה לעשות לדעתי כדי להשתפשף עם החומר גם מה שלא להגשה\n\nהמבחן: \nהמבחן בעיקר בודק אם באופן פרקטי אתם יודעים את הטכניקה של פתירת מד\"ח, שאלות הבנה או תאורטיות יש קצת אבל זה מיעוט הנקודות באופן יחסי. \nצריך לתרגל המון כדי להיות ספץ על הטכניקה, אבל אפשר להוציא ציון די בסדר. אם תרגלתם אצל גיא לדעתי יהיה לכם יותר קל כי ראיתם כבר מראש את רוב הטריקים שחוזרים.\n\nהשורה התחתונה: \nקורס מעניין יחסית לדעתי. יש באמצע שלו עצירה של חודש של חומר שצריך באופן תאורטי שלא למדנו באלגברה, שזה די מוזר. אבל גם זה וגם החומר של מד\"ח וטורייה פורייה לדעתי נחמד ממש. קורס לא כזה מזעזע יחסית לקורס מתמטי חובה.", "timestamp": 1645735866938}, {"author": "אא", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: סביר. לדעתי לא כזה גרוע כמו שאומרים, אבל גם לא הייתי ממהר ללכת להרצאות שלו.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: סבבה. פותרת שאלות ברמה הכללית ביותר אבל פחות מתמקדת באיך תכלס לפתור שאלות מציאותיות שזה די באסה.\n\nשעורי הבית: לא לוקח יותר מידי זמן, וגם נותן 4 נקודות בונוס לציון, שזה נחמד כי זה לא באחוזים. רק תוודאו שבאמת הגשתם את כל הגיליונות שצריך כדי שלא תקבלו בטעות רק 3 במקום 4 (חוויה אישית לצערי).\n\nהמבחן: הוגן. יחסית למבחנים של שלומי היה די קשה. כיסחו בבדיקה אבל.\n\nהשורה התחתונה: קורס מעניין, במיוחד בחלק של טורי פוריה.", "timestamp": 1645959395898}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: בהתחלה היה איטי בצורה מחרידה וענה על כל שאלה שנשאלה גם אם היא לא הייתה קשורה בכלל והתעכב על כל שטות קטנה, אחרי זה היה יותר בסדר\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: מגן נחמד ומתרגלים טוב\n\nהמבחן: היה מאוד מאוד הוגן\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1645976684887}, {"author": "ש", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: על הפנים, הייתי אצלו חודש ראשון של המסמטר ואחרי חודש הבנתי שאני לא יודע כלום.\nמבולגן מאוד, מדבר באוויר וקופץ מנושא לנושא, פשוט לא הצלחתי לעקוב .ברחתי.\n\nשם המרצה: מוקלט של יוחאי מעיין\nחוות דעת - הרצאות: מדהים, הציל לי את הסמסטר בקורס הזה , נותן אינטואיציה ועניין בלימודים וגם עובר מאוד מאוד מסודר, כותב הכל ונותן דגשים-ממליץ מאוד בקיצור.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: דוך אלייה בלי שאלות, זה הקורס שלה והיא יודעת מה טוב לכם.\n\nשעורי הבית: שאלה בשבוע לא עמוס בכלל, תתרגלו ותעשו את כל הגליון ולא רק אותה - יעזור לכם.\n\nהמבחן: מבחן טכני חשוב מאוד לתרגל המון לפני, בסוף הדברים חוזרים על עצמם. תראו שאתם עובדים מול דך סיכום של כל הוריאציות כי יש באמת המון כיוונים והמון חומר בקורס.\nחורף 21/22  מועד א' היה יותר קל ממועדים אחרים.\n\nהשורה התחתונה: קורס עמוס עם המון חומר, אבל יכול להיות עם ציון מתגמל אם אתם משקיעים ומתמסרים אליו (בניגוד למרוכבות).", "timestamp": 1647444193153}, {"author": "מאור", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: כותב כמו רופא אבל יש לו רשימות סבבה שהוא עובד איתם רוב הזמן אז זה עושה את העבודה. קצת מחפף לפעמים ומרגיש שהוא חושב שהוא מדבר עם כיתה שכבר מכירה את החומר שהוא מלמד. הייתי בוחר מרצה אחר\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: קצת מהירה אבל יחסית סבבה, יסודית, עונהעל שאלות, יש רשימות של התרגולים שלה שהיא עוברת עליהם כמעט במדוייק אז זה ממש נוח. \n\nשעורי הבית: לא עמוסים, רמה סבירה לקורס\n\nהמבחן: ממוצע במועד 52... היה פקטור 5 נק\n\nהשורה התחתונה: קורס חובה מה נעשה", "timestamp": 1647508914823}, {"author": "Majd Mansour", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: האמת לא הייתי צופה בהרצאות, רק קורא את הסיכום שלהן\n\nשם המתרגל/ת: מרינה גרודז \nחוות דעת - תרגולים: מתרגלת טובה מאוד, מעבירה הרבה שאלות בדומה למבחן, ההשקעה שלי הייתה בתרגולים לרוב.\n\nשעורי הבית: להגיש רק שאלה כל שבוע \n\nהמבחן: מועד ב' יותר קשה מ א' אך היו בסדר\n\nהשורה התחתונה:", "timestamp": 1647527313227}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: אמנם הוא המרצה האחראי אבל מומלץ להתרחק. מסביר לא ברור בעליל, להבין למה הוא מתכוון זה מקרי בהחלט.\n\nשם המתרגל/ת: ליטל \nחוות דעת - תרגולים: סה\"כ מתרגלת טובה, מסבירה ברור את החומר עם אינטואיציה מוחשית לדברים. קצת קשוחה לפעמים, לא תמיד יש מקום לשאלות.\n\nשעורי הבית: שאלה אחת בשבוע, לרוב לא דורש הרבה זמן. למי שעושה את הכול נוספות 4 נקודות לציון הסופי, יחסית לכמות ההשקעה זה יפה. \n\nהמבחן: מועד א' חורף 22 היה יחסית הוגן. \n\nהשורה התחתונה: לראות הרצאות אחרות לא של שלומי. אני במהלך הסמסטר לא הבנתי כלום ודברים הסתדרו רק לקראת המבחן וזה לא כדאי...", "timestamp": 1647541562985}, {"author": "1", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: אני מאוד התאכזבתי מרמת ההוראה, באיזשהו שלב פשוט לא יכולתי להמשיך ועברתי לראות את יוחאי מוקלט ולא חסר לי כלום. \n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת בסדר גמור, לפעמים קצת לא ברורה אבל סה\"כ היא בסדר ומומלצת. \n\nשעורי הבית: ש.ב סתם עבודת ידיים ולא הרבה הבנה אבל זה בגדול המקצוע הזה. \n\nהמבחן: פשוט לעבור על כל סוגי הבעיות האפשריות ולהבין איך לפתור ולא אמור להיות בעיה", "timestamp": 1647609240263}, {"author": "לי", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: ההרצאות אצלו היו משעממות, במיוחד לקראת הסוף כשעברנו לזום.\nצריך להכניס קצת יותר עניין לשיעור.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת טובה, פותרת תרגילים חשובים ומלמדת בדיוק מה שצריך. \nעשתה לנו מלא תרגולי השלמה לקראת הסוף ככה שלא הגעתי מוכנה למבחן .\n\nשעורי הבית: קלילים ממש\n\nהמבחן: מבחן הוגן, קצת קשה להגיע מוכנים עם החומר שלומדים בסוף הקורס, אבל ככה זה כמעט בכל הקורסים.\n\nהשורה התחתונה:", "timestamp": 1647781428997}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: בלייב בעיניי הוא לא טוב, מרגיש שהוא זורק משפטים באוויר בלי קשר ביניהם. מתישהו בסמסטר עברנו ללמוד בזום בגלל הקורונה וזה היה עולם אחר כי את הכל הוא כתב במחשב ולא אמר בע\"פ, הוא הסביר מדהים את החומר והכל היה כזה זורם ומובן.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: הבנאדם פשוט מושלם. מסביר כל כך ברור וכזה תכלסי, חוזר בקצרה על החומר שהיה בהרצאות אבל בתמצית של מה שבאמת צריך לדעת. יש גם הקלטות שלו משנה שעברה שממש עזרו לי לפני המבחן.\n\nשעורי הבית: גליון פעם בשבוע אבל מגישים רק שאלה או סעיף בדר\"כ, ממליצה כן לקחת את הזמן ולעשות את הגליון המלא כי זה קורס שצריך לתרגל בו כדי להבין את החומר.\n\nהמבחן: בגלל קורונה ניגשתי ישר למועד ב' של שלומי והוא היה נורא! ידעתי שמועדי ב' שלו קשוחים אבל לדעתי זה היה המבחן הכי קשה שהוא עשה אי פעם בפער, ממליצה לתרגל את המועד המונפץ הזה לפני שניגשים למבחן ואם אפשר אז לגשת רק למועד א' של הקורס כי הוא הרבה יותר הוגן.\n\nהשורה התחתונה: מל\"ג לא מומלץ", "timestamp": 1648372990708}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: \nההרצאות היו משמימות, שלומי פתר לפעמים תרגיל אחד בשיעור, מד״ח+טורי פורייה הם אחד מהכלים הכי משמעותיים בקורסי המשך. חבל שאין ניסיון להראות את המשמעות מלבד זו המתמטית\nשם המתרגל/ת: מרינה גרזוד\nחוות דעת - תרגולים: מדהימה, ברמה שאפשר להבין את כל החומר מהתרגולים שלה בלבד. מה שכן היא מהירה מאוד. אם יש הקלטות שווה לראות שוב\n\nשעורי הבית: \nשאלה אחת מתוך גיליון, אז לא עמוס בכלל\nהמבחן: \nלדעתי היה הוגן, המבחן מחולק להרבה תתי סעיפים כך שהיה הרבה מקומות לקבל בהם נקודות. השאלות תאמו את החומר\nהשורה התחתונה: קשה, צריך לפתור הרבה מבחנים כדי להגיע לרמה הסופית כי הקורס עצמו לא מכין אליה. אבל בסה״כ קורס שרובו טכני", "timestamp": 1650038495673}, {"author": "Avi Cohen", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: מרצה מאוד נחמד וחביב, אולם לעיתים די משעמם ומרדים (יש שאוהבים יותר יש שפחות). בסמסטר שלי הוא היה קצת חלש אבל הבנתי שבסמסטרים אחרים הטוא דווקא מצחיק ונחמד, וההרצאות עוברות טוב.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: ראיתי הקלטות, מתרגל מצוין שמסביר את כל מה שצריך לדעת ומראה תרגילים מאוד רלוונטים ללמידה למבחן והבנה והטמעה של החומר. ממליץ מאוד לעבור עליהם תוך ניסיון לפתור את התרגילים איתו!\n\nשעורי הבית: \n\nהמבחן: טכני מאוד, לא באתי לרוב ההרצאות ופשוט עשיתי בינג׳ לתרוגלים של גיא ב3 ימים שהיו לי לפני המבחן והצלחתי את המבחן.\n\nהשורה התחתונה: קורס קצת משעמם אבל טכני, לא צריך לפחד מהחומר אלא לתרגל הרבה כדי להצליח.", "timestamp": 1656325180526}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פורפסור חבר רם בנד\nחוות דעת - הרצאות: מעניינות ומעשירות, הקורס הזה הוא משהו בין פיסיקה למתמטיקה. הרגשתי שאני עושה מתמטיקה של גדולים בפעם הראשונה משהו שיש לו שימושים. הצוות היה מאוד מסונכרן. \n\nשם המתרגל/ת: מרינה גרוזד ואז גיא במקולט \nחוות דעת - תרגולים: מרינה מתרגלת מצויין אבל היא רצה, רצה ובמקביל נתקעת על דברים תיאוריתיים שלא חייבים כדיי לפתור תרגילים. לפניי המבחן עשיתי מרתון על המוקלטות של גיא וזה סידר לי את הראש. \n\nשעורי הבית: 10 גליונות של שאלה, אם עושים את כולם מקבלים +4 לציון הסופי. \n\nהמבחן: \nהמבחנים של שלומי דיי חוזרים על עצמם, אז אחריי שעושים כמה מתחילים להבין מה קורה. אבל אז קורים דברים כמו שאלה אחת של 40 נקודות.. \n\nהשורה התחתונה: קורס חובה, לא עמוס במהלך הסמסטר, לא יודע אם אפשר לוותר על ההרצאות, אבל מרתון תרגולים לפני המבחן הוא מה שמשנה.", "timestamp": 1658254889454}, {"author": "Almog", "difficultyRank": 4, "generalRank": 2, "semester": "202103", "text": "שם המרצה: דורון\nחוות דעת - הרצאות: דורון מרצה מעולה, מסביר הכל כמו שצריך, משתדל לא להיות יותר מידי מתמטי (כמה שאפשר), נותן יחס אישי בהרצאות, מאוד נחמד ורוצה לעזור חסטודנטים\n\nשם המתרגל/ת: מרינה קרוש ברם\nחוות דעת - תרגולים: אחרי התרגול הראשון עברתי להקלטות של מרינה גרוז\n\nשעורי הבית: היו 6 גיליונות, בכל אחד שאלה או שתיים להגשה. הראשונים קלילים יחסית והאחרונים מאוד ארוכים.\nשווה חעשות את כל השאלות, גם אלו שהן לא להגשה. במבחן שלנו הופיעה שאלה מהגיליון\n\nהמבחן: הוגן מאוד, ארוך אבל הגיוני. הייתה שאלת הוכחה של בערך 10 נקודות שבשבילה היה צריך ללמוד את כל ההוכות בקורס. השאלות היו מנוסחות כמו שצריך והבדיקה הייתה מאוד הוגנת. דורון נתן פקטור של 4 נקודות. סך הכל אפשר להצליח במבחן.\n\nהשורה התחתונה: אין ברירה.. שווה להשקיע כל הסמסטר ואם אתם עם דורון- הרווחתם", "timestamp": 1666174317808}, {"author": "ויברח", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nדורון אלעד תותח\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמרינה גרוזרד, אחלה מתרגלת\nשעורי הבית: \nארוכים אבל מלמדים\nהמבחן: \n\nהשורה התחתונה: \nכל עוד רבייב מרצה אחראי, לברוח כמה שיותר מהר. הבן אדם הזה סיוט", "timestamp": 1676908865149}, {"author": "Tamir Manoach", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה סבבה\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת מאוד טובה\n\nשעורי הבית: חלקם ממוחזרים, אלב לא הכל\n\nהמבחן: סבבה\n\nהשורה התחתונה: הקורס נסגר", "timestamp": 1678260797841}, {"author": "לא חשוב", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאל\nחוות דעת - הרצאות: במדח לא מרצה סבבה כמו המרוכבות\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: אחלה מתרגלת\n\nשעורי הבית: עוזרים מאוד להבנת החומר\n\nהמבחן: אוי אבוי מה קרה במועד א, מבחן די מזעזע\n\nהשורה התחתונה: קורס מעניין מאוד חבל שדניאל האחראי", "timestamp": 1678639996556}, {"author": "המיינד גובלין", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה מצוין, הייתי אצלו פרונטלי אבל יש גם מוקלטות שלו מסמסטר קיץ, יותר טוב בפער מרבייב וניזאר לדעתי. ההרצאות חשובות אבל לא קריטיות להצלחה במבחן לדעתי, דורון מודע לזה ומשתדל להכניס כמה שיותר תרגילים לתוך ההרצאות כדי שנדע בפועל מה לעשות.\nנ.ב. יש לו הומור חריף מאוד, מאוד נדיר בפקולטה למתמטיקה ומוערך מאוד :)\n\nשם המתרגל/ת: גיא בר שלום\nחוות דעת - תרגולים: המתרגל הכי גבר שראיתי מהפקולטה למתמטיקה, צ'אד רציני, רוצו לראות (יש הקלטות + סיכומי תרגולים שלו, שניהם מצוינים).\n\nשעורי הבית: \nשאלה להגשה כל שבוע, חשוב לעשות כדי לראות שאתם על הדברים, זה באמת מבחן שהשקעה בשיעורי בית במהלך הסמסטר תשרת אתכם ממש טוב לקראת המבחן.\n\nהמבחן: \nמועד א' של רבייב היה מוזר ביחס לבחינות בשנים קודמות ויחסית קשה לדעתי, אבל בסופו של יום המבחן במקצוע הם די סבירים בד\"כ, הם דורשים שתדעו טוב את החומר אבל לא דורשים שתמציאו את הגלגל בבחינה. תעשו 15 מבחנים לקראת המועד ויהיה בסדר.\nהשורה התחתונה: \nקורס ממש מעניין בעיניי ביחס לקורס מתמטי, שימושי מאוד לקראת ההמשך לכל מי שמתעסק בחשמל, סה\"כ אחד הקורסים היותר סבבה בסמסטר 3.", "timestamp": 1679227312939}, {"author": "דנאל", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה האחראי: דניאל רבייב\nחוות דעת - הרצאות:  הייתי בהתחלה אצל דורון אלעד אבל היה אצלו צפוף ברמה קיצונית. מהר מאוד עברתי ליוחאי ופשוט גיליתי שאין עליו.  \n\nשם המתרגל/ת:  גיא בר-שלום\nחוות דעת - תרגולים: מתרגל תותח, באמת מסביר את החומר בצורה טובה. יש לו רשימות בדרייב ואצלנו לפחות הוא העלה אותם אפילו למודל. הרשימות אחד לאחד מה שיש בתרגול.\n\nשעורי הבית: במילה אחת - אוף. בשתי מילים - אוף גדול. הסבר: לא מחלקים קווים מנחים לפתרון ולא ניתן לערער על ציון שיעורי בית אם זה לא ישירות מול ליטל. לא מעניין אותה שאתה לא מסוגל להגיע לשעת קבלה שלה כי יש לך שיעור באותו הזמן. לכן אסכם ששיעורי הבית לא שונים ברמה מקורסי מתמטיקה שונים, רק שהסגל הזה הראה פחות אכפתיות לסטודנטים אם בכלל.\n\nהמבחן: לדעתי מבחן לא הוגן. האמריקאיות היו ברמה הגיונית אבל בשאלות הפתוחות היו שאלות שלדעתי לא שיקפו את הידע במד\"ח. המבחן שונה במאוד מהמבחנים של שלומי ולכן הרבה חטפו כאפה במבחן.\n\nהשורה התחתונה: אני נהנתי מתוכן הקורס . תודה לאיראנים שדחו את המבחן", "timestamp": 1679336078769}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: הקלטות של יוחאי\nחוות דעת - הרצאות: חובה לראות את יוחאי!! \n\nשם המתרגל/ת: גיא בר שלום\nחוות דעת - תרגולים: מתרגל מעולה, ממש מבין את הראש של הסטודנטים והתרגילים שלו עוזרים לפתרון השיעורי בית.\n\nשעורי הבית:\n\nהמבחן: רבייב כמו רבייב חייב להביא את הטאץ׳ האישי שלו. אין דמיון בין המבחנים שלו לבין שאר מבחני עבר, תתרגלו הרבה את הגליונות להגשה, הוא שואב משם השראה.\n\nהשורה התחתונה:", "timestamp": 1679659960063}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: ראיתי הרוב מוקלט, היה דיי סבבה חוץ מאיכות ההקלטות\n\nשם המתרגל/ת: מרינה גרוזד \nחוות דעת - תרגולים: מתרגלת מדהימה! היחידה שבאמת הכווינה בצורה טובה לשיעורי הבית והמבחן, רק אצלה פתרנו נושאים מסויימים שהופיעו הן במבחן והן בשיעורי הבית למרות שהמרצה האחראי (דניאל רבייב) אמר שהנושא של תרגילים אלו לא בחומר, בקיצור מומלצת ממש, אל תלכו לאף מתרגל אחר\n\nשעורי הבית: אחת לשבועיים מגישים 2 שאלות ובודקים אחת, לא נתנו פתרונות או קווים מנחים (למרות שרוב השאלו נלקחו משנים קודמות בהן כן נתנו קווים מנחים, אז הם לא באמת היו חייבים לרשום קווים מנחים חדשים ולבזבז זמן עלינו אך הם עדיין סירבו בטענה שכדי שיתנו לנו קווים מנחים המרצה האחראי או המתרגל האחראית (ליטל שמן) צריכים לרשום אותם על חשבון זמנם הפרטי)\n\nהמבחן: המבחן היה לא הוגן הוא שם נושא שהוא אמר שלא יהיה בחומר במבחן (כמו שאמרתי היחידה שלימדה אותו היא מרינה שעשתה בו תרגיל אחד) ונושא זה לא היה בכלל במבחני עבר, הרבה נפלו בשאלה זו ממש, אך עדיין הוא סירב להביא פקטור/ להתחשב איכשהו בזה שהשאלה הייתה על חומר שלא נלמד בכיתה ואף נאמר לנועל ידו שלא יהיה בחומר\n\nהשורה התחתונה: אם זה עם רבייב וליטל שוב כאחראיים עדיף לברוח.\nהקורס עומד להיסגר בכל מקרה אז זה בתכלס לא כזה משנה", "timestamp": 1679666534155}, {"author": "Grades", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nדורון אלעד( או אלעד דורון באמת אין לי מושג)\nחוות דעת - הרצאות: \nסה\"כ כיף אצלו, בחור מעניין וכיף לשבת אצלו בהרצאות.\nלא הרגשתי שמבחינה לימודית אני יוצא כשאני מבין ממש את החומר אבל הוא היה הכי טוב הסמסטר וסה\"כ נחמד אצלו אז לא היה רע כלכך\n\nשם המתרגל/ת: \nמרינה גרוזד\nחוות דעת - תרגולים:\nהיא רצה בטירוף, לא מבינים כלום כמעט תוך כדי אבל היא עושה כלכך הרבה תרגילים שרובם תרגילים טובים שמלמדים אז מומלץ לפחות שיהיה את הקובץ המוקלד של התרגולים שלה.\nהתרגילים שלה עזרו לי מאוד בש.ב ובמבחן.\nהרגיש לי שהיא היחידה בקורס שיודעת באמת להכווין לש.ב ולמבחן עם התרגילים שהיא מעבירה\n\nשעורי הבית: \nסה\"כ סבבה, לא מסובכים מדי ורוב הפתוחות במבחן היו מבוססות על הש.ב אז אם אתם לוקחים קורס עם רבייב ממליץ ממש לעבור על הש.ב\n\nהמבחן:\nהיה יותר קשה מרוב השנים האחרונות, לא חושב שהיה קשה בצורה קיצונית, אבל היה קשה והמבחן היה בסגנון שונה עד עכשיו אז הנפילה במבחן הייתה הגיונית.\nהיה חשוב מאוד לעבור על הש.ב, מי שידע אותם טוב הצליח להוציא את כל הניקוד מהפתוחות\n\nהשורה התחתונה: \nקורס יחסית משעמם, צריך לתרגל מלא מבחנים ועם רבייב להבין טוב את ההגדרות ולהיות חזקים על הטריקים", "timestamp": 1679737692627}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: \nמאוד נחמד לסטודנטים נותן הרבה יחס וחוזר על החומר אם הוא לא מובן. ההרצאות לצערי נהיות משעממות אבל אין מה לעשות. לא הרגיש לי קריטי לראות הרצאות.\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nנותנת תרגילים ממש טובים וברמת מבחן, אבל טסה ולפעמים מאבדים אותה. יש בדרייב את כל התרגולים שלה מאוד מומלץ לחזור עליהם לפני המבחן וחובה להבין כל תרגיל.\nשעורי הבית: לא עמוס.\n\nהמבחן: רבייב שינה את כל מבנה המבחן וחבל. מאוד קל לטעות באמירקאיות וזה 7 נק׳ על כל טעות. אבל עדיין לא ברמה של מרוכבות. מועד א׳ היה מאוד טריקי, לא הכי קשה בעולם אבל עדיין קשה. מועד ב׳ היה הוגן, אבל מאוד מאוד מאוד ארוך ותיקנו לנו הרבה שאלות.\n\nהשורה התחתונה: קורס לא נעים אבל ניתן להוציא ציון טוב אם לומדים טוב מאוד את התרגולים. חוץ מדורון, סגל על הפנים.", "timestamp": 1680426765560}, {"author": "צוריאל ויזל", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהקלטות מעולה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהקלטות מעולה\nשעורי הבית: \nכדאי לעשות.\nהמבחן: \nקשה, ללמוד טוב.\nהשורה התחתונה: \nלוקח קצת זמן עד שמבינים אצת הרעיון של הקורס ומה רוצים ממך. קצת טכני. יש לזכור משפטים", "timestamp": 1683625712643}, {"author": "בוכרי בדימוס", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nממש אהבתי בתחילת הסמסטר, לקראת הסוף כבר נהיה ממש מבולגן והיה קשה להבין ולהקשיב.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nאחלה מרינה, אבל התרגולים שלה נורא קשים. באופן כללי רואים בתרגולים הרבה דברים חדשים שלא רואים בהרצאות, ומרינה פשוט רוצה להראות כמה שיותר אז הרבה פעמים התרגול מרגיש יותר מדי עמוס. יוצאים עם כאב ראש.\n\nשעורי הבית:  גועל נפש, אבל שאלה בשבוע וכדאי לעשות אותם כדי להיסגר על החומר\n\nהמבחן: \nנורא נורא פחדתי מהמבחן. לדעתי בין הקשים שחשמלטורים עושים. בסופו של דבר היה בסדר אבל חושב שבאמת המבחן נורא.\n\nהשורה התחתונה: \nמזל שהקורס מתפצל, הוא באמת הזוי במתכונת הנוכחית\nאגב, זה לא קורס של 4 נקודות בחיים.", "timestamp": 1690204471180}, {"author": "OG", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nבעיניי רבייב מרצה בסדר, יש כאלו שפחות מתחברים. הולך אחד לאחד לרשימות המוקלדות שלו ובסך הכל מסביר בצורה די ברורה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nתרגולים של מרינה, אחלה מתרגלת ומכסה את כל החומר של הקורס, רצה מאוד מהר ככה שמי שרוצה לכתוב בעצמו ימצא את עצמו רודף אחריה (יש רשימות מוקלדות גם שלה). \n\nשעורי הבית: \nדי קשים לפתור בעצמך, לדעתי שווה את המאמץ (בנוסף הכל די מרופרנס).\n\nהמבחן: \nרבייב נוטה לחשוב שהסטודנטים להנדסת חשמל/ביו רפואה שלוקחים את הקורס הם מתמטיקאים, לצערנו זה לא המצב. מבחנים מאוד טכניים שדורשים הבנה מתמטית עמוקה, המועד שלנו היה עם פתוחות די סטנדרטיות ואמריקאיות די קשות, בגלל לחץ מבחנים עם מרוכבות ומעגלים חשמליים ניגשו מעט מאוד למבחן, לדעתי הממוצע גבוה מהצפוי בגלל שרק מי שהיה מוכן ניגש\n\nהשורה התחתונה: \nלחרוש למבחנים כי חבל לחזור על הקורס, בהצלחה!", "timestamp": 1690296094954}, {"author": "קווזי הלינארית", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: אחלה דנייל, מרצה טוב לדעתי. לקראת סוף הקורס התחיל קצת יותר להתבחבש ולהיות פחות ברור, אבל רוב הזמן היה טוב. החסרון - חושב שדברים שלא קל לראות אותם הם ברורים לסטודנטים. \n\nשם המתרגל/ת: מרינה גרדוזה\nחוות דעת - תרגולים: פצצה, מרינה עושה טוב מד\"ח. תרגול עמוס רצחח מלא חומר, גם חומר חדש שלא לומדים בהרצאות. קשה לי\n\nשעורי הבית: די קשים, אבל לא יותר מידי אינטנסיביים. שאלה אחת פעם בשבוע, הגשה כל שבועיים. מומלץ לעשות את כל השאלות סתם בשביל תרגול עצמי...\n\nהמבחן: נוראי, אבל עוברים את זה, מה נעשה... יש לנו ברירה?\n\nהשורה התחתונה: בתור טיפוס מד\"חי אני אוהבת מד\"ח, אבל הקורס לא כל כך מוצלח ובטח שלא המבחן... אגב מה נסגר עם ליטל הזאת? להיות נחמד לא עולה כסף... ביי", "timestamp": 1690381531386}, {"author": "unknown", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: הפסקתי ללכת באמצע הסמסטר. היה לי קצת קשה לעקוב אחריו\n\nשם המתרגל/ת: גיא בר שלום\nחוות דעת - תרגולים: מצויין, נותן מלא טיפים לפתרון שאלות, מפרסם את קובץ התרגולים שלו כך שרק צריך ללכת ולהקשיב\n\nשעורי הבית: צריך להגיש 5 מתוך 6. מחזירים משוב ראוי על השאלה שבודקים אך לא מפרסמים פתרון לתרגילי בית.\n\nהמבחן: השאלות הפתוחות היו הוגנות. האמריקאיות היו טיפה מבלבלות \n\nהשורה התחתונה: קורס חובה, לרוב טכני אבל צריך להבין את התיאוריה", "timestamp": 1691309743853}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  דניאל רבייב\nחוות דעת - הרצאות: \nתלכו - במבחן תמיד יש משהו שהוא רק אמר בהרצאה ולא רשום בשום מקום\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: \nאל תלכו - לא אכפת לה מאף אחד \nשעורי הבית: \nזורמים - תרפרנסו\nהמבחן: \nלעבור על שיעורי בית - השאלות בנויות על זה\nהשורה התחתונה: \nסלמתק", "timestamp": 1694528081516}, {"author": "אייל גולן", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: תמיד אהבתי את רבייב עד המבחן של מועד ב שהיה , מבחן הזוי ולא פתיר , כאילו הוא התכוון לזה שכולם ישתמשו בעבר בינארי כדי שלא יחזרו על הקורס שוב .\nאגב , אני בספק לעבר אפילו.\n\nהשורה התחתונה: טוב שנסגר הקורס המכוער הזה.", "timestamp": 1703101705579}, {"author": "לא חשוב", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דניאל רבייב\n\nהשורה התחתונה: מי שלפניי צודק ב 100% !\nאין מה להוסיף .", "timestamp": 1703232275976}, {"author": "ROBERT", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: גרוע ביותר, זה פשע שנתנו לו להיות אחראי בתקופה שעומד הקורס להיסגר. משחק אותה \"שכפת לו\" בפועל ממש לא. הולך יד ביד עם ליטל שמן ועושים הורור לסטודנטים. שניהם עושים את המאקסימום האפשרי לתת את המינימום האפשרי.\nאני לא אומר שהם לא יודעים את החומר ולא שולטים בו, להפך. אך בהוראה לא כל כך. \n\nשם המתרגל/ת:  ליטל בהתחלה ואז מרינה גרוזד.\nחוות דעת - תרגולים: \nליטל - ממש לא, גם להיות נחמד לסטודנטים לא עולה כסף. התחלתי ללכת לה ואז עברתי למרינה גרוזד.\nמרינה - מלכה, הצילה לי את הקורס, איכפתית, תותחית, יודעת את החומר ויודעת איך להעביר אותו (לא טרוויאלי בכלל). מודה לה.\n\nשעורי הבית: מייגעים, ארוכים, חופרים. לדעתי חשובים לקראת המבחן ועוזרים להבין את החומר במיוחד אם יש להם זמן. עברתי עליהם תוך הלמידה שלי למבחן והרגשתי שעזרו לי.\n\nהמבחן: יחסית תכני, יש בו קושי, צריך ללמוד טוב לפתור מבחנים ולסיים אותו.\n\nהשורה התחתונה:  קורס חובה, אין מה לעשות. לנסות לא לפול עם רבייב.", "timestamp": 1712742384143}]}