{"posts": [{"author": "א", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ניק\nחוות דעת - הרצאות: \nהרצאות עם ניק הן באנגלית.\nלא מאורגן, לא מסודר, לרוב עושה טעויות קטנות בהרצאות, ולראיה היו גם כאלה במועד א' (לפחות 4).\nאם לא סטודנט שסיכם את הקורס, לא היה סיכוי כלשהו להבין את הקורס.\nלזכותו יאמר שהוא הקליט את ההרצאות.\nשם המתרגל/ת: יובל\nחוות דעת - תרגולים: \nעשה תרגולים שהכין המתרגל הקודם בקורס (שהוא אגב תותח ממש, עמית), ללא ערך מוסף מצידו. השתדל (והצליח!) לזלזל כמה שיותר בסטודנטים (בתרגולים ובמיילים), וכמה שפחות להשקיע בקורס.\nהמבחן: \nלדעתי מבחן קשה + 5 טעויות בנוסח הבחינה.\nהשורה התחתונה: \nלדעתי זה קורס מעניין, אבל הצוות הצליח להרוס כל חלקה טובה בו.", "timestamp": 1643999058145}, {"author": "שם או כינוי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לירן רותם\nחוות דעת - הרצאות: טובות, לירן מרצה מאוד נחמד, ורואים שאכפת לו מאוד מהסטודנטים. עשינו פחות חומר ממה שעושים בסמסטר רגיל עד כמה שהבנתי\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: לא הגעתי לרובם פיזית כי השעה מאוחרת, הוא מעלה רשימות מהתרגולים, אבל מרגיש שהוא הרבה פעמים מתעסק בתרגילים ונקודות שפחות רלוונטיות לקורס במידה, ויותר אזוטריות. בכל מקרה, גם הוא מאוד מאוד אכפתי וקשוב לסטודנטים\n\nשעורי הבית: לא קלים, גיליון כל שבועיים\n\nהמבחן: אולי המבחן הכי קל שראיתי לממשיות, בתוספת פקטור 8 נקודות\n\nהשורה התחתונה: בגדול קורס מאוד מעניין, פותח את הראש ומלמד חומר חשוב מאוד, הוא כן קשה יחסית אבל עם כזה מבחן אין אלא להודות לאלוהים (וללירן)", "timestamp": 1677492864081}, {"author": "מידת לבג", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רותם לירן\nחוות דעת - הרצאות: הרצאות ברורות, מרצה אנרגטי שיודע להעביר את החומר בצורה דידקטית. יחס מצוין לסטודנטים למרות כיתה גדולה ועמוסה.\n\nשם המתרגל/ת: אלון שפירא.\nחוות דעת - תרגולים: היה קשב לעקוב אחריו, הוא קופץ מרעיון אחד לאחר, מתחיל להגיד משהו, עוצר ואז עובר לדבר על משהו אחר. אבל באמת שהוא ניסה בכל מאודו להסביר לנו ולגרום לנו להבין, הייתה לו סבלנות אדירה לכל שאלה והבהרה, והתרגולים הכתובים שלו היו בהחלט מצוינים ותרמו להבנת הידע. זה מסוג המתרגלים שעדיף לוותר על התרגול בכיתה אבל כן לשבת על התרגול הכתוב שמנוסח ומסודר הרבה יותר ממה שקורה בכיתה.\n\nשעורי הבית: עמוסים ודי קשים אבל חשוב מאוד לתרגול לקראת הבחינה.\n\nהמבחן: יחסית לשנתונים אחרים אומרים שהמבחן היה קל. אני חושב שהוא היה בסדר והוגן. לא היה לי קל באופן כללי. פשוט לא היה מספיק זמן ללמוד למועד א' אבל הסתדרתי. ויתרתי על מועד ב'.\n\nהשורה התחתונה: הקורס מעניין, מאתגר וקשה.", "timestamp": 1678619745603}]}