{"posts": [{"author": "תמר", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רן קירי \nחוות דעת - הרצאות: לא לחשוב פעמיים! כנראה המרצה הכי טוב שלמדתי אצלו. מסביר ממש טוב ובהתלהבות, היחיד שאפשר לשבת אצלו בהרצאה ב16:30 ולא להירדם. קצת מהיר אבל מספיקים את כל החומר בזמן ואין לחץ בסוף הסממטר. \n\nשם המתרגל/ת: רועי בר און \nחוות דעת - תרגולים: רועי מתרגל מעולה, עונה לשאלות וממש נותן אווירה שהכל בסדר. מה שכן לא ממש מספיק לעשות תרגילים ברמה גבוהה ולהראות טריקים וזה ממש חשוב. \n\nשעורי הבית: גיהנום צרוף, וובוורקים ראשונים קשים בטירוף ואז קצת מתמתן, גיליונות אוי ואבוי. \n\nהמבחן: כותבת את הביקורת לפני המבחן אבל בטוחה שיהיה גיהנום צרוף נוסף, מקווה לא לפגוש את רן שוב סמסטר הבא. \n\nהשורה התחתונה: קורס קשה בטירוף צר לי :(", "timestamp": 1689152220676}, {"author": "Rebecca", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה שצריח להתרגל אליו אבל סרגה שמבינים את השפה שלו הוא באמת מעולה, מסביר כמו שצריך אם כי יש הרצאות מסוימות שאף אחד לא מבין מה קורה אבל אסימונים נופלים בסופו של דבר.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: פשוט מעולה אין מילים. מתרגלת מטורפת מסבירה מעולה קצת טיפה מהיר אבל שולחת בסוף כל תרגול את כל מה שפתרנו אז לא חייב לכתוב תוך כדי\n\nשעורי הבית: וובוורקים קצת מעצבנים ומעייפים. גיליונות בכתב השניים הראשונים קצת מפחידים ואז מתרגלים \n\nהמבחן: היה הוגן. לא דומה במבנה למה שהיה במודל ללמוד ממנו אבל לא היו הפתעות מבחינת החומר\n\nהשורה התחתונה: קורס לא קל", "timestamp": 1689259235758}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות: מרצה מעולה! הוא מסביר הכל בקצב ממש טוב ובמידה והוא קצת מהיר יש לו רשימות הרצאה שעוזרת להשלים את הפערים בכיתה. דואג לענות על השאלות של כולם וסה\"כ לפעם ראשונה שהוא הרצה הוא היה ממש טוב.\n\nשם המתרגל/ת: רועי בר-און\nחוות דעת - תרגולים: אחלה מתרגל, דואג שכולם יבינו את הטכניקות ומסביר את החומר בצורה טובה. הוא גם עובר בשיעורים עם מצגת אז נורא נוח לעקוב ולרשום הערות ובמידה ולא הבנת משהו הוא יפרסם פתרון אחרי זה. ממליץ מאוד!\n\nשעורי הבית: לידיה הייתה מרצה אחראית אצלנו ואין ספק שאלו היו הגיליונות הכי קשים שקיבלנו הסמסטר בכל המקצועות. כל גיליון סופר מורכב וארוך ובסוף גם שוחטים ממש על הציון ככה שאל תצפו לעשות את זה בשביל המגן אלא בשביל הלמידה מהגליון.\n\nהמבחן: המבחן היה מאוד פייר לדעתי, לא היה משהו שבחיים לא ראינו וסה\"כ מי שתרגל ברמה גבוהה יצליח להוציא ציון טוב.\n\nהשורה התחתונה: קורס חובה, עם זאת מאוד טכני ומובן (גם אם באמצע הסמסטר מרגישים אבודים). ממליץ מאוד על הספר של אורי אליאש, הוא באמת עשה לי סדר בכל הנושאים, במיוחד לקראת ההכנה למבחן.", "timestamp": 1689315313321}, {"author": ":)", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: נניח שנתון בית. דניאל מבין את החומר טוב מאוד, ויודע להסביר אותו, אבל מאוד אוהב לפלפל לחומר נושאים מתקדמים יותר, ובכך לפעמים נתקע על התפל של הקורס.\n\nשם המתרגל/ת: רועי בר און\nחוות דעת - תרגולים: לא רלבנטי כי הוא עוזב לפוסטדוק, אבל הוא מצוין.\n\nשעורי הבית: הגליונות הכתובים מאוד מאוד קשים וארוכים. הוובוורקים העתק הדבק משל מדר ח. ראו הוזהרתם: נאמר לנו שתהיה שאלה על בסיס הגליונות הכתובים במבחן, בסוף הקשר הזה לא עזר מאוד לפתור אותה.\n\nהמבחן: מועד א׳ היה הרבה יותר טכני מתיאורטי. היו הרבה מקומות ליפול בהם אבל לא היו טריקים איומים שהוזכרו פעם אחת במהלך הסמסטר.\n\nהשורה התחתונה: קורס קשה. כדאי מאוד להיות על החומר שלו במהלך הסמסטר, ולתרגל את הטכניקה לא מעט.", "timestamp": 1689431798639}, {"author": "E", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות:  מאוד ברור שדניאל מבין מה הוא עושה אבל הוא לא מסביר לעומק, וצריך להתרגל אליו.. אם הייתה לי הזדמנות הייתי הולכת למרצה אחר.\n\nשם המתרגל/ת: ליטבינוב גלינה\nחוות דעת - תרגולים: גלינה נחמדה, היא פותרת מלא תרגילים אבל הקול שלה מאוד מונוטוני! רק השעה הראשונה מהתרגול מספיקה כדי לשעמם אותי... אם הייתה לי הזדמנות הייתי הולכת לרבקה (:\n\nשעורי הבית: ארוכים מאוד וקשים!\n\nהמבחן: צריך לפתור מלא מלא שאלות ומבחנים, כי יש מלא חומר וצריך לזכור הכל ולדעת במה צריך להשתמש ואיפה, ורק אז המבחן יהיה הוגן.", "timestamp": 1689509906094}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות: מושלם בכל רמה אפשרית, כותב מסודר וברור, מסביר לעומק ועונה על שאלות תוך כדי שהוא עושה קצת כיף וצחוקים בכיתה. יחסית מההרצאות הראשונות התחיל לעבוד עם רשימות ככה שלא צריך לכתוב ואפשר להקשיב לו ב100% ולא ללכת לאיבוד יותר מידי\n\nשם המתרגל/ת: רועי בן און אהוב ליבי\nחוות דעת - תרגולים: השעתיים היחידות ביום שחיכיתי להן, עובר על החומר בקצרה לפני שהוא מתחיל את התרגול ובדומה לרן, עבד עם מצגות והעלה אחר כך פתרונות מלאים למודל עם הסברים מפורטים. רואים שאכפת לו מאוד וזה ניכר גם בשעות הקבלה שלו. ממליצה בחום\n\nשעורי הבית: יותר מידי פיזיקה פחות מידי מד\"ר. הגליונות לא הרגשתי שרלוונטים מידי למבחן כי הם היו קשוחים מידי ועוד הם מהווים רק 5%. הווב וורק חלקם זוועתים חלקם נחמדים ויש רפרנסים מפורטים ממש כמעט לכל שאלה אם צריך.\n\nהמבחן: לא הרגשתי שהקורס קשור למבחן, השאלות לא היו דומות למשהו שתרגלתי בעבר.\n\nהשורה התחתונה: קורס נחמד סך הכל, אם קצת השקעה אפשר להוציא ציון ממש גבוה", "timestamp": 1689696284711}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: ניר כנראה אחד המרצים הכי מעניינים בטכניון. הוא מרים את הקול מלא אבל זה כי הוא חירש באוזן שמאל והוא הכי שמח שיש לענות על שאלות ולהסביר שוב ושוב - לא להירתע מהצעקות (שוב, הוא חצי חירש).\nהחיסרון היחיד הוא שהוא לא המרצה הכי קוהרנטי שיש.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: מתרגלת ממש ממש טובה, גם מסבירה מעולה וגם מראה את כל הדרכים שאלות. עונה על שאלות בצורה ברורה מאוד ועוזרת להבין את החומר.\n\nשעורי הבית: סיוט מוחלט. כל וובוורק מרגיש כמו נצח וכל גיליון מרגיש כמו חמישה נצחים. השקעתי בשיעורי הבית של מדר יותר זמן משהשקעתי בכל שיעורי הבית של כל שאר הקורסים יחד. הבדיקה יכולה להיות ממש קשוחה ופדנטית בגליונות אז שימו לב להיות כמה שיותר מנומקים שאפשר.\n\nהמבחן: היה די הוגן, לא ממש דומה במבנה למבחנים במודל אבל לא היו דברים תלושים מהחומר או מהגליונות.\n\nהשורה התחתונה: היה יכול להיות קורס סבבה אם לא הגליונות. אני לא מגזים שהם ממש מחרידים. מומלץ מאוד כי חשוב לדעת מד\"ר וכי קורס חובה.", "timestamp": 1689780868986}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: לא קוהרנטי בכלל ואוהב לצעוק הרבה. רוב ההרצאות היה אפשר לעקוב למרות הצעקות אבל היו כאלו שאי אפשר להבין כלום עד שעושים את הנושא בתרגול\n\nשם המתרגל/ת: אולג קליס\nחוות דעת - תרגולים: ממש מובן, מסכם את ההרצאה בלוח אחד בדרך שקל להבין את הקטע ומסביר את דרך הפתרון ממש טוב\n\nשעורי הבית: הגליונות ארוכים וכדאי מאוד להתחיל אותם ביום שמקבלים אותם. הווב וורק יחסית מציק ולפעמים מלמדים בהם נושאים חדשים אז חשוב לעשות\n\nהמבחן: המבחן היה הוגן\n\nהשורה התחתונה: קורס סביר ויכול להיות מעניין לפעמים.", "timestamp": 1689780998323}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nבהתחלה לא התחברתי אך אחרי שתרגלתי אליה הבנתי שזה כבוד ללמוד אצלה, היא מסודרת ברמה בלתי מובנת כך שאין צורך להעתיק מהלוח אפשר פשוט לצלם וזה אחלה\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nמת על אפרת. \nרוצו אליה היא מדהימה!!\nשעורי הבית: \nהכי קשים בפער!!!\nהמבחן: \nהיה הוגן לגמרי, לא היו בו טריקים ולא הפתעות. הופתעתי כמה שהיה פשוט אך היה ארוך מדי\nהשורה התחתונה: \nתלמדו טוב טוב את החומר בסמסטר ויהיה לכם ממש ממש סבבה!", "timestamp": 1689781632993}, {"author": "11", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה מעולה, מסבירה מאוד ברור ומסודר. למרות שההרצאות היו בקצב גבוה ולא חומר קל תמיד הרגיש לי שבגלל שהיא מעבריה כ\"כ מסודר אני יכול לחזור על הסיכום אחרי זה ולהבין אם היה לי פער כלשהו.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה טוב ונותנת כלים טובים להתמודד עם השיעורי בית לבד. לפעמים אולי הייתה טיפה איטית אבל לי זה הרגיש שעדיף לעשות אולי קצת פחות תרגילים אבל לעשות את הכול בצורה שיטתית ומסודרת שנותנת לי כלים להתמודד לבד.\n\nשעורי הבית: \nקשים מאוד. וובוורקים די קשים יש כאלה יותר וכאלה פחות. גיליונות כתב קשים וארוכים מאוד, תתחילו לעשות אותם כמה שיותר מהר כי הם לוקחים זמן.\nהמבחן: תכלס היה די הוגן, לא היה קל והיה הרבה מקומות ליפול בהם (בעיקר באמריקאי) אבל ממש לא כמו סיפורי הזוועות על לידיה.\n\nהשורה התחתונה: קורס קשה אבל חובה אז תנסו להנות ממנו.", "timestamp": 1690144087407}, {"author": "נתי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות: כפרה עליו!! בין המרצים הטובים שהיו לי בטכניון עד כה. קסם של מרצה, מנגיש את החומר, מביא מלא דוגמאות, וגם יש לו רשימות ברמה גבוהה ביותר- כל הכבוד לו על כל ההשקעה.\n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: \nמתרגלת סבבה, לא היינו הרבה אצלה בתירגול ככה שהרגיש יותר ביתי. היא קצת איטית אז לא הספקנו המון תרגילים יחסית למתרגלים אחרים, אבל כל תרגיל היא התעכבה עליו עד הדגש האחרון. \n\nשעורי הבית: שיעורי בית קשים מאוד!! שימו לב שכמו שהם קשוחים בשיעורי בית, הם ככה קשוחים גם במבחן. \n\nהמבחן: היה מבחן יחסית טכני, לא היה משהו שלא ראינו לפני. היה הוגן, אך הבדיקה היתה קשה מאוד והרבה קיבלו פחות ממה שהם ציפו לו.\n\nהשורה התחתונה: קורס לא קל אך לא נורא, יחסית טכני אז לא קשה מאוד להצליח בו.", "timestamp": 1690233981212}, {"author": "שנורקל", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות: מרצה מעולה, מאוד אוהב את המקצוע מתמטיקה ומלמד עם תשוקה אמיתית. תמיד משאיר הרבה זמן לשאלות ומדבר בגובה העיינים ולא כמו מרצה מרוחק.\n\nשם המתרגל/ת: איגור קליס\nחוות דעת - תרגולים: מתרגל סבבה. לא ברור לפעמים אבל כן חוזר על הנקודה עד שכולם אמרו שהם הבינו\n\nשעורי הבית: קשים מאוד, ארוכים עם קשר קטן מאוד למה שפותרים בתרגולים וההרצאות\n\nהמבחן: הגון אבל קשה. מאוד תיאורתי ובדיקה קפדנית מאוד ביחס לקורסים אחרים בפקולטה למתמטיקה שעשיתי (חדואות למינהם). \n\nהשורה התחתונה: קל זה לא", "timestamp": 1690446553388}, {"author": "Michelle", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרופסור רן קירי\nחוות דעת - הרצאות: הרצאות מדהימות, המרצה הכי טוב שהיה לי בטכניון\n\nשם המתרגל/ת: אפרת אווירה\nחוות דעת - תרגולים: אווירה עם אפרת אבירם, תרגולים מעולים בול על הנושאים החשובים, היה יותר נחמד אם היא הייתה פחות מתמקדמת באלגברה\n\nשעורי הבית: גיליונות ארוכים אבל מעניינים מאוד\n\nהמבחן: הוגן מאוד, דומה למבחנים של מד\"ר אינפי\n\nהשורה התחתונה: SLAY", "timestamp": 1690746887761}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דר דניאל רבייב\nחוות דעת - הרצאות: אדם נחמד, חוץ מיזה אין לי הרבה דברים חיוביים לומר, הוא מגיע לא מוכן להרצאות לא קוהרנטי, לפעמים אומר בהרצאה דברים לא נכונים שמורידים עליהם במבחן, ודי מפוזר\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת מתרגלת נהדרת שמעבירה את החומר טוב\n\nשעורי הבית: מאוד קשים \n\nהמבחן: קשה\n\nהשורה התחתונה: קורס שלא עושה חיים קלים", "timestamp": 1690895623206}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: המרצה הכי טובה בפער! היא מעבירה את החומר בצורה מדהימה, רואים שאכפת לה מהסטודנטים ומההצלחה שלהם והיא פשוט מקסימה. החסרון היחיד הוא שהכיתות שלה מפוצצות ולפעמים זה יצר אווירה לא נעימה בכלל בכיתה בגלל ריבים על מקומות אבל עדיין שווה להגיע אליה לדעתי.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מתרגלת מצוינת! היא מביאה תרגילים מעולים וברמה גבוהה ופשוט כיף ללמוד אצלה\n\nשעורי הבית: ארוכים ודורשים השקעה \n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1691073437907}, {"author": "ללניה", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nבהתחלה היה ממש לא ברור, כל החלק של האינפי טורי התכנסות וכו. כשהגענו למד''ר נהיה הרבה יותר ברור.\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: \nאחלה גלינה, לפעמים קצת מדלגת על חישובים בסיסיים ואז אתה עלול לאבד את האחיזה בתרגיל, אבל היא פותרת בצורה מאוד ברורה סה''כ ומסבירה לעומק למי ששואל. ממליץ בחום\nשעורי הבית: \nקשים מאוד. את רובם לא הצלחתי לבדי. גם בדקו את הגיליונות כמו במבחן. מצד אחד זה מוריד את המגן, מצד שני זה מבהיר מה הדרישה מתשובה בשאלות בנושא ולכן אני רואה זאת כמשהו חיובי.\nהמבחן: \nלא נפלתי מהרגליים. סהכ הוגן אבל לא פשוט.\nהשורה התחתונה: יהיה בסדר הכל עובר", "timestamp": 1691481234812}, {"author": "מיכאל חזן", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nכמה רמות מעל מבחנים קודמים( המבחנים מקורסים אחרים שמראים במודל)\nהשורה התחתונה:", "timestamp": 1691613330166}, {"author": "שניר חן", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות:  מרצה מדהים מאוד חד, מלמד בהרבה תשוקה ואהבה למקצוע ונותן הרבה אינטואיציה לכל נושא. \nלעיתים אבל יכול להיות טיפה מהיר (אם מבקשים ממנו הוא מאט את הקצב).\n\nשם המתרגל/ת: אפרת.\nחוות דעת - תרגולים:  מדהימה, הרבה ניסיון בלימוד קורס זה (בנושאים שזהים לזה שבמד\"ר אינפי) ומסבירה מעולה.\n\nשעורי הבית: ה-WebWork היה סטנדרטי, אך הגיליונות היו לפעמים יחסית ארוכים ומסורבלים שלא לצורך.\n\nהמבחן: רמת המבחן הייתה סבירה. בגלל שזה היה פיילוט לא היה ידוע מראש באילו נושאים ובאיזה סדר יהיה שאלות אמריקאיות ומתי לא. היה קשה לעשות חלוקת זמנים מראש. \n\nהשורה התחתונה: קורס טכני ויחסית אינטואיטיבי.\nהיה קשה להבין לפעמים מתי צריך להבין רק את הטכניקה ומתי להבין לעומק את התיאוריה ואת המשפטים והתנאים.", "timestamp": 1693321942664}, {"author": "s", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מעבירה את החומר בצורה מאוד מסודרת ובסה\"כ טובה, לא תמיד הכי הבנתי את ההסברים שלה עד הסוף אבל הייתה טובה\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: כמובן רבקה מהירה בטירוף אבל גם מקצועית ברמות, היא מסבירה טוב אבל לדעתי לפעמים לא הסבירה מספיק דקויות שכן חשובות\n\nשעורי הבית: הכי קשים בכל הסמסטר! לא תדרכו אותנו בכלל לרמה הזו בתרגולים ובשיעורים וכל הזמן נעזרנו בשעות קבלה. בדיקה קפדנית מאוד שמורידה את המגן אך מכינה טוב למבחן... וובוורקים גם לא קלים\n\nהמבחן: הרמה של המבחן הייתה קשה אך לא משהו קיצוני, הבדיקה לעומת זאת הייתה מאוד קשוחה והורידו על טעויות נגררות/ טעויות של חוסר תשומת לב כמעט את כל הנקודות בתרגיל אז שימו לב טוב טוב.\n\nהשורה התחתונה: קורס חובה, אם אתם סטודנטים ממוצעים ממליצה לפנות זמן בלוז לשעות קבלה עם מרצה/ מתרגל טוב.", "timestamp": 1695287154830}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דניאל רבייב ולאחר מכן הקלטות של יוחאי מעיין \nחוות דעת - הרצאות: לא התחברתי לדניאל כמרצה, מאוד מבולבל ומדבר לעצמו, בשיעורים הראשונים לא הבנתי כלום לכן עברתי להקלטות של יוחאי מעיין מד\"ר אינפי - בדיעבד הייתי הולכת ללידיה, הסיכומים שלה מצוינים למדתי מהם למבחן. \n\nשם המתרגל/ת: אפרת \nחוות דעת - תרגולים: אפרת מתרגלת מעולה, בקצב גבוה אבל מאוד ברורה והכל כתוב בשלבים ומסודר. ממליצה \n\nשעורי הבית: קשים מוגזם, היה נראה שהגליונות היו בשביל להתעלל בסטודנטים, דבר שמאוד מבאס כי הם חשובים להבנה של החומר. \n\nהמבחן: המבחנים בסה\"כ הוגנים, רוב החומר הוא טכני ואם עושים מספיק מבחנים זה הרמה, הבדיקה של המבחן די קפדנית אמנם. \n\nהשורה התחתונה: קורס שמפחיד בהתחלה אבל המבחן עצמו לא כזה נורא. לתרגל מספיק לפני ולוודא הבנה של החומר בסמסטר עצמו.", "timestamp": 1697365281192}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רן קירי\nחוות דעת - הרצאות: \nמרצה מעולה מסביר את החומר בצורה מובנה ומצליח להשאיר אותנו בעניינים למרות שההרצאות היו בזמן פחות טוב + יש לו אחלה סיכומים\nשם המתרגל/ת:  אפרת\nחוות דעת - תרגולים:  יש לה הרבה ניסיון מתרגלת מעולה ממליצה מאוד\n\nשעורי הבית:  הגליונות היו זוועה אבל מתרגלים לזה אחרי 2 גליונות -מומלץ לפתור אותם\n\nהמבחן:  היה פייר אם משקיעים כל הסמסטר ופותרים מלא מבחנים זה די חוזר על עצמו\n\nהשורה התחתונה:", "timestamp": 1697393386017}, {"author": "א.ב.", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: \nאני ממש אוהב את ההרצאות! ניר מסביר בצורה מעניינת, ותמיד מנסה שנבין את הרקע, ולא נדע רק את הטכניקה. הדבר העיקרי שכיף לי בהרצאות זה שברור שניר ממש אוהב את החומר (ומנסה להלהיב גם אותנו). ובלי קשר, הוא גם מצחיק, וגם זה עוזר להתרכז, לעקוב ולהבין.\nלפעמים כשניר מנסה להסביר בזריזות רקע תיאורטי הוא מנסה לדחוף הרבה במעט זמן וזה יוצא לא כ\"כ ברור.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nיוליה תמיד מציגה את החומר בצורה חדה. בדרך כלל יש כמה תרגילים שהפתרון שלהם הוא יישום יחסית ישיר של החומר (וזה נצרך כדי לפתור תרגילים בסיסיים), וכמה תרגילים שיוליה פותרת בעזרת טריקים, או גישה בדרך מקורית לבעיה, וזה מלמד איך לגשת לתרגילים יותר קשים וטריקיים.\n\nשעורי הבית:\nלא פשוטים, אבל הוגנים, ומכינים היטב למבחן.\n\nהמבחן:\nלא קל, אבל מאוד הוגן - לא יהיו שאלות בלתי פתירות.\n\nהשורה התחתונה:\nאחלה קורס. הצטרפתי רק באמצע הסמסטר (במקום מד\"ר א או מד\"ר ת), ואני ממש שמח שבחרתי את הקורס הזה - האיזון המנצח בין פורמאליות יתר לטכני ויבש.", "timestamp": 1711534935821}, {"author": "שטורם ליוביל", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רן קירי \nחוות דעת - הרצאות: מרצה מדהים! יש לו את הרשימות הכי מסודרות שיצא לי לראות. קצב ההרצאות גבוה, אבל רן מסביר את החומר ממש ברור, ודואג שכל הסטודנטים מבינים. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מבין כל התרגולים עם אפרת הסמסטר, זה בעיני היה הקורס עם התרגולים הכי טובים שלה. אפרת כרגיל מסודרת מאוד, וסוגרת את כל הפינות הלא ברורות מההרצאה. מומלץ מאוד! \n\nשעורי הבית: הוובוורקים סבבה, עוזרים להבין את החומר ומכינים אותך טוב לגיליונות הפתוחים, שנעים ברמת הקושי שלהם בין סבירים לבלתי פתירים. \nלפחות רוב המגן מגיע מהוובוורקים.\n\nהמבחן: קשה אבל הוגן מאוד.\n\nהשורה התחתונה: קורס מעניין וקשה.", "timestamp": 1713421626046}, {"author": "שוסי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nמרצה סביר, יש טובים יותר ויש טובים פחות. ההסברים שלו טובים אבל הוא נוטה להתעכב על דברים מינוריים ומוכיח מלא דברים מיותרים. בנוסף, הוא לא ממש אוהב לענות על שאלות של סטודנטים.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nמתרגלת מצוינת, מסבירה ממש טוב ומראה את כל הטריקים שיש במבחנים. הקצב שלה ממש מהיר אבל לדעתי לגמרי שווה את זה.\n\nשעורי הבית:  הוובוורקים קצרים ונחמדים. הגליונות הפתוחים ארוכים אבל לא יותר מדי קשים. לעיתים פה ושם יש שאלה מעצבנת אבל סך הכל סבבה לגמרי.\n\nהמבחן:  מבחן קל באופן מפתיע, יותר מהוגן. אלון ידוע לשמצה בזה שהמבחנים שלו ממש קשים. אבל כנראה בגלל המלחמה הוא הביא מבחן ממש קל.\n\nהשורה התחתונה: קורס נחמד ולא עמוס יותר מדי. חשוב מאוד להרבה נושאים בהנדסה.", "timestamp": 1715845031096}, {"author": "סטודנט לינארי מסדר n עם מקדמים קבועים", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: אלון מרצה טוב, הוא מעביר את החומר בצרורה ברורה אך לפעמים קצת ארוכה ויש לו נטייה להתעכב על דקויות או הוכחות שהן לא העניין המרכזי. קשה לשאול אותו שאלות כי בדרך כלל זה נראה כאילו הוא לא מבין מה שואלים כי \"הכל כתוב על הלוח כבר\". אם יש אפשרויות אחרות, הייתי ממליץ אבל זה לא סוף העולם אם אין.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: רבקה מתרגלת מנוסה ומצויינת, חדה ברמות שמביאה המון תרגילים עם המון טריקים שמופיעים במבחנים. יש לה נטייה לטוס עם התרגילים ולפעמים להשמיט טיפה מהפתרון שאפשר להשלים לבד אבל זה ממש משתלם כי זה אומר שהיא מספיקה המון. אם מצליחים לעמוד בקצב, מומלץ מאוד.\n\nשעורי הבית: הוובוורקים היו לפעמים קצת מעצבנים אבל בסך הכל סבבה ועוזרים לעבור שוב על הטכניקה היבשה. \nהגליונות היו מאוד נחמדים בדרך כלל ועזרו להבין עקרונות בפתרון של בעיות. יוצא שיש כמות מכובדת אבל הוגנת של שיעורי בית אבל ככה יש גם כמות סבירה של ציון מגן.\n\nהמבחן: אלון החליט לתת מבחן מפתיע מבחינת החומר הנשאל אך הוגן בהחלט. יש לא מעט נושאים וקצת טכניקה שצריך לזכור אבל את רוב הדברים שעושים מתוך שיקולים מפוקפקים ואז קשה לנמק בד\"כ דוחפים באמריקאיות ואז זה יוצא נחמד. \n\nהשורה התחתונה: זה קורס מאוד חביב, עם כל מיני תוצאות יפות שמתקשר לשאר קורסי המתמטיקה בסמסטר ועוזר לתת תחושה של משמעות לחומר הטיפה אבסטרקטי שמסביב.", "timestamp": 1715850755098}, {"author": "E", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלון דימטריק\nחוות דעת - הרצאות: לא הייתי. \nצפיתי במוקלט פעם אחת ולא אהבתי. מאוד מבולגן על הלוח ולא מובן.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אפרת מדהימה!\nהכל ברור, מאוד מסודרת על הלוח ומסבירה הכל עם שלבים.\n\nשעורי הבית: לוקחים זמן.\n\nהמבחן: המבחן היה הוגן מבחינת רמה, אבל חלוקת הנקודות זה סיוט! 10 נק על כל שאלה אמריקאית (היה 5 שאלות כאלה) כלומר 50 נק על החלק הסגור! \n\nהשורה התחתונה: קורס טכני, אהבתי אותו.", "timestamp": 1715853338313}, {"author": "אוכף לא יציב", "difficultyRank": 4, "generalRank": 4, "semester": "202302", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nההרצאות היו מבולגנות וההסברים לא היו ברורים.\nאלון מדבר בצורה לא מכבדת כלפי הסטודנטים והרבה מהם מרגישים לא בנוח לשאול שאלות. מספר הסטודנטים שהגיעו להרצאות מעיד על כך.\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nאפרת מתרגלת מדהימה. \nעוזרת להפנים את החומר ומגשרת על כל הפערים שנוצרים במהלך ההרצאות. \nמעבר לזה, אכפת לה מאוד מהסטודנטים ונעים להיות בתרגולים שלה. \n\nשעורי הבית: \nעוזרים להפנים את החומר.\n\nהמבחן: \nמועד א' היה הוגן אבל חלוקה לא הגיונית של נקודות: כל שאלה אמריקאית 10 נקודות.\n\nהשורה התחתונה: קורס מעניין בסך הכל וגם פרקטי. מומלץ להגיע לתרגולים של אפרת.", "timestamp": 1715857533349}, {"author": "פופו", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: קצת דמיטריוק הרבה אליאש (יוטיוב)\nחוות דעת - הרצאות: דמיטריוק בחור מיוחד מאוד שדואג להזכיר לי כל פעם בהרצאה הראשונה שלו בקורס חדש שנפתח למה אסור לבוא יותר להרצאות שלו. בקיצור - אליאש המלך חפשו אותו ביוטיוב\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מלכה, רק תרפרפו עשר דקות על החומר לפני התרגול אחרת לא תצליחו לעקוב אבל אין על רבקה.\n\nשעורי הבית: וובוורק די זוועתי אבל לא חובה לעשות את כולם, 5 גליונות יבשים להגשה- הראשון והשני נלקחו על ידי דמיטריוק באופן אישי ישירות מהגהינום כל השאר סבבה.\n\nהמבחן: שני המועדים היו הוגנים\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1719004587099}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מי שמכיר את אלון כבר יודע, מבחינת הרצאות לדעתי הוא בסדר אבל מעמיס בהרבה הוכחות שפחות רלוונטיות לקורס הזה. \n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: אין על רבקה, רצה על החומר אבל מספיקה לעשות הרבה סוגים שונים של תרגילים, מה שעוזר גם להתמודד עם השיעורים שאלון נותן.\n\nשעורי הבית: גיליונות ארוכים מאוד, היו מתישים. בסוף הגיליונות עוזרים ללמידה למבחן.\n\nהמבחן: מועד א' היה הוגן (במיוחד ביחס למבחנים של אלון) מועד ב' היה קשה יותר. באופן כללי פחות מומלץ ללכת למועד ב' עם אלון. אם לוקחים איתו את הקורס רצוי לתרגל את כל המבחנים שלו כי יש לו סגנון משל עצמו.\n\nהשורה התחתונה: קורס שבהתחלה נראה קשה, אבל עם תרגול הופך למאוד טכני ואפשר לקבל ציון טוב.", "timestamp": 1719206024080}]}