{"posts": [{"author": "SR", "difficultyRank": 2, "generalRank": 4, "semester": "201802", "text": "שם המרצה: -\nחוות דעת - הרצאות: לא הייתי בהרצאות ופשוט עברתי על הסיכום, בעיניי זה מספיק.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: לא הייתי בתרגולים ופשוט קראתי מהסיכום, בעיניי גם כאן זה מספיק.\n\nשעורי הבית: לא עמוסים. מה שחופר בעיקר זה המתנטים הארוכים בטירוף. בנוסף, בסמסטר שלנו היה 5 גליונות יבשים לא ארוכים.\n\nהמבחן: המבחן בסמסטר שלנו היה יותר טכני מסמסטרים קודמים, ולכן זה קצת פגע בממוצע. כדאי להכיר את המרצה ולדעת מה סגנון המבחנים שלו.\n\nהשורה התחתונה: על אף שהממוצע מעט ירד בסמסטרים קודמים, אני עדיין חושב שזה קורס מתמטי הכי טוב שאפשר לבחור במדמ\"ח.", "timestamp": 1597749617534}, {"author": "מיכאל", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מרצה מעולה.\n\nשם המתרגל/ת: אולג קליס\nחוות דעת - תרגולים: סבבה, אבל קצת זורק.\n\nשעורי הבית: היבשים קלילים אבל לא תורמים במיוחד למבחן. בסמסטר הזה הם רופרנסו מבראודה ולא היו קשורים למבחנים שניר כותב.\nיש גם את המתנטים שהם כן שווים את המגן כי הם תורמים להבנת החומר.\n\nהמבחן: לטעמי לא היה קשה מידי, אבל היה בסגנון של ניר (עקיצות כאלו שמי שיודע את החומר בערך נופל בהם) וחצי ממנו היה אמריקאי שלטעמי זה חסרון.\nהבעיה הגדולה היא שניר חושב שגם לקורסי בחירה זה לגיטימי ממוצע 69 ולא נתן פקטור.\n\nהשורה התחתונה: אם באת ללמוד את הקורס במהלך הסמסטר מבלי לזלזל, קח/י אותו עם ניר ותצליח/י. אם באת ללמוד למבחן בלבד, לעשות כשניר מרצה אחראי יהיה טעות.", "timestamp": 1597760660928}, {"author": "...", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: מרצה לא רע, מעדיף לצפות במוקלט של צנזור.\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: קלים \n\nהמבחן: המבחן היה קשה לעומת המבחנים הקודמים \n\nהשורה התחתונה:", "timestamp": 1613932107121}, {"author": "סטוקס", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: \nלא ראיתי ואין צורך.\nיש צנזור חדוא 2ת והוא עדיף.\nהמון נושאים חשובים יורדו מהחומר וזה חבל למי שבאמת צריך לדעת אנליזה וקטורית בשביל המשך התואר.\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nיוליה is love , הכי טובה שיש!\nשעורי הבית: \nיבשים קלים\nwebworkים ארוכים וחשובים\nעדיף לא לרפרנס, זה קורס שהשליטה בטכניקות בו היא חשובה.\nהמבחן: \nרובו אמריקאי\nקשה אך הוגן\nהשורה התחתונה: \nחדוא לבוצדמים", "timestamp": 1615157466155}, {"author": "Sujud abu atta", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דמיטריק\nחוות דעת - הרצאות: לר מסביר כל כך טוב לטעמי, הייתי צריכה לראות כמה סרטונים מצנזור כדי באמת להבין דברים, אבל בסך הכל בסדר.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מצוינת\n\nשעורי הבית: \n\nהמבחן: \nהזוי ממש!!!! היה עם ממוצע 67. מלא שאלות היו לא פתירות, או שהן דורשות המון זמן. בסך הכל ממליצה מאוד מאוד לק לעשות את הקורס עם אלון\nהשורה התחתונה:", "timestamp": 1618774632665}, {"author": "אסף פתיה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר בן דויד\nחוות דעת - הרצאות: ניר מרצה טוב, הוא כן מעביר סיקור של הוכחות אבל לא עד הסוף - לא צריך לדעת באמת את ההוכחות, ומביא גם דוגמאות טובות בהרצאות.\n\nשם המתרגל/ת: אולג \nחוות דעת - תרגולים: אולג באמת אחלה, אבל שמוקצה רק תרגול אחד של שעה אחת בשבוע הוא לא יכול באמת להכיל את כל החומר הנלמד.\n\nשעורי הבית: שיעורי בית פתוחים קלים ומרופרנסים מבראודה.\nיש רפרנסים לWW בקבוצה בפייסבוק.\nהWW די קשים ולוקחים לא מעט זמן. הם די חשובים\n\nהמבחן: למרות שהממוצע מאוד נמוך, המבחן היה בסדר גמור, הוא ממש העתיק 2 שאלות ממבחן קודם שלו, וכל השאר היה בחומר שלנו(אולי חוץ משאלה אחת)\n\nהשורה התחתונה: זה קורס טכני לחלוטין. כמו כל קורס טכני בטכניון עם שעה תרגול, צריך לקבל את הטכניקה לבד.\nאני עבדתי עם GOOL כל הסמסטר כדי להישאר בעניינים, \n5 ימים לפני המבחן נרשמתי לאתר חשבוניה ויש שם פתרונות מלאים למבחנים וזה באמת הציל אותי במבחן הזה כי לא מלמדים טכניקה כמו שצריך - שוב כי אין זמן.\nבסכ\"ה, הבחירה הכי טובה שאפשר לבחור מרשימת בחירה של מתמטיקה למדמח.", "timestamp": 1628413173990}, {"author": "Bob Bobinson", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי מרצה טובה. היא מעבירה את החומר בצורה ברורה, ומשלבת מדי פעם בדיחות ורפרנסים. החומר של הקורס מאוד טכני, אז בדרך כלל ההרצאה מספיקה כדי להבין אותו ואין כמעט בכלל הוכחות.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: ניקה מתרגלת מאוד טובה. היא עוברת על החומר ממש מהר ומספיקה הרבה בכל תרגול, אבל עדיין עונה על שאלות ומסבירה ברור. בתרגולים אין כמעט בכלל חומר, וכל מה שעושים שם זה לפתור תרגילים. \n\nשעורי הבית: הגיליונות הפתוחים יחסית פשוטים רוב הזמן ויש לכל אחד שבועיים, אז הם לא עמוסים בכלל. ה-WebWorks קצת יותר עמוסים, גם להם יש שבועיים אבל הם יותר ארוכים וממש טכניים. שיעורי הבית מאוד עוזרים אבל בלמידה למבחן - ה-WebWorks לשאלות האמריקאיות, והגיליונות לשאלות הפתוחות.\n\nהמבחן: המבחן מורכב מארבע שאלות אמריקאיות (28 נקודות סה\"כ) ושלוש פתוחות (72 נק' סה\"כ). הסמסטר פעם ראשונה היה ללא דף נוסחאות. הבעיה העיקרית היא שיש משפטים שצריך לצטט במדיוק וכל מיני שלבים פורמליים שצריך לזכור, אבל עם מספיק למידה אפשר להסתדר.\n\nהשורה התחתונה: אישית, לא ממש נהניתי מהקורס - החומר היה מאוד טכני ודי משעמם, בעיקר המון (אבל המון) אינטגרלים. למרות שהקורס קל יחסית, לא הייתי בוחר בו (אבל לא לכולם יש בחירה...)", "timestamp": 1647266459559}, {"author": "לייבניץ המציא תחדווא", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: לגבי עדי - חושב שזה כבר ידוע אבל עדי מרצה ברמה הכי גבוהה שיש בטכניון. נותנת דוגמאות שממש מביאות אינטואיציה, מדברת עם הסטודנטים בגובה העיניים, עוזרת המון במייל ובשעות קבלה. לגבי ההרצאות - ראינו הרבה דוגמאות ואזהרות שממש הופיעו במבחן. ההרצאות קריטיות.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: קצת מהירה, אבל אין ברירה כי יש רק שעה לתרגול. התרגולים מאוד עוזרים לפתור את הוובוורק.\n\nשעורי הבית: וובוורק שאפשר לפתור לפי התרגולים ולפי רפרנס בדרייב. הפתוחים היו יותר קשים והצריכו יצירתיות/שעות קבלה. היה גם פרוייקטון קטן שהיה ממש נחמד ונתן 5% מגן.\n\nהמבחן: טכני, לעשות הרבה מבחני עבר ולהיות חדים על הזמנים. אצל עדי - להיות מאוד חדים על הדוגמאות והאזהרות מההרצאה. מורידים נקודות אם לא מצטטים משפטים במדוייק, אז להיות חדים על כל התנאים (למשל של גאוס ושל גרין)\n\nהשורה התחתונה: קורס נפלא למדמח-פיזיקה, או למי שצריך לקחת קורסים בפיזיקה. עדי אומרת שזה גם מאוד עוזר לתחום של אופטימיזציה. מתוך היכרות די טובה עם שאר הבחירות המתמטיות של מדמח, זה חד משמעית הקורס הכי מומלץ (גם הכי קל, חוץ ממדר ת אולי). הממוצע נמוך כנראה כי אנשים חושבים שהוא קל מדי - צריך להקשיב טוב בהרצאות, לעשות תרגילי בית ולתרגל מבחני עבר. אין חוכמות. אבל כן חשוב להדגיש שבקורס כמעט ואין הוכחות, ורב העבודה היא חישובית. רב הזמן פותרים אינטגרלים.", "timestamp": 1647283617714}, {"author": "א.ב.", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  ניר בן-דוד\nחוות דעת - הרצאות:\nאני ממש אוהב את ניר. הוא מסביר טוב, ובאופן כללי מצחיק ועושה אווירה טובה. זה גם עוזר להבין. הקורס יחסית טכני, אבל ניר שם דגש על אינטואיציה (לפעמים הוכחות ממש, ולפעמים רק להסביר מאיפה הטכניקות מגיעות).\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מהיר בצורה מפחידה. אבל למי שמצליח לעמוד בזה, זה מכין הכי טוב למבחן. כמו שרבקה אמרה: \"את הכי קשה כבר ראיתם...\".\n\nשעורי הבית:\nגליונות – גם רמת הקושי וגם העומס בינוניים.\nוובוורק – לפעמים זה מאוד קשה, וגוזל המון זמן.\n\nהמבחן:\nקשה אבל הוגן. אצל ניר המבחן לא יכול להיות רק טכני, תמיד הוא יביא שאלות שמכריחות גם להבין טוב את החומר והתיאוריה.\n\nהשורה התחתונה:\nבסך הכל ממש נהניתי בקורס. גם מניר, וגם מהחומר!", "timestamp": 1678035416239}, {"author": "משפט גרין", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: נב\"ד הוא נב\"ד וכל מילה אחרת מיותרת\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: וואו. תעשו מתיחות לפני כי לא דפקתם ספרינט כזה בחיים שלכם. אולי בעצם הכנה טובה למבחן בלוגיקה\n\nשעורי הבית: גיליון דו-שבועי, מתחיל קשה ולא מובן אבל בהמשך הקורס מסתדר. וובוורקים מעיקים, אבל בזכות דארקביט כולנו קיבלנו מאה\n\nהמבחן: לא קל אבל הוגן ועם תרגול של מבחני עבר אפשר להוציא ציון טוב. חצי מהמבחן אמריקאי, במועד שלנו היו כמה שאלות מרופרנסות ממבחנים קודמים.\n\nהשורה התחתונה: אחלה קורס! חבל שהממוצע 56 ולא נותנים פקטור", "timestamp": 1679135430587}, {"author": "דוד אבא של ניר", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: לא קריטיות כלל, תרגולים יותר ממספיקים מה שגם ניר בן דוד  בכלל לא מובן, חצי מהזמן הדגים אינטגרלים בצורה מצחיקה ונתן רושם מוטעה לרמה של הקורס\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מרגלת מדהימה! עשתה לנו סדר בכל החומר, מה שכן צריך לבוא מאוד מרוכזים כי בשעה היא פותרת המון תרגילים ומאוד מהר. אם היה לה תרגולים מוקלטים, כנראה הייתם שמים על 0.75 מהירות\n\nשעורי הבית: הWW מרופרנסים בעיקר, עוזרים להבנה ולוקחים אותך צעד צעד הרבה פעמים בפתרון. הגליונות גם דיי סבבה, אבל שניהם ביחד כל שבוע שבועיים לוקחים 6-7 שעות אז להתחשב בזה.\n\nהמבחן: המבחן הסמסטר היה קשה יותר ממה שהיה בעבר, 3 שאלות מהאמריקאיות היו ממוחזרות אבל השאר קשה וגם נתקלנו בקונספטים שכמעט לא תורגלו. לא מבחן קל בכלל מה שגם הממוצע הסמסטר היה הכי נמוך שהיה אי פעם בוקטורית, כשבמקביל באלגברה במ היה ממוצע 80. \n\nהשורה התחתונה: לא לקחת עם ניר בן דוד, בכללי לא לקחת שום קורס איתו. לא מובן בהרצאות, ובמבחנים רק מחפש איפה להוריד ממוצעים בלי מודעות עצמית בכלל לרמה ולמה שהוא מצפה בקורסים שלא קריטיים לרוב מי שלוקח אותם. מי שאוהב קורסים טכניים, תקחו את הקורס ותתרגלו המון מבחנים ותוודאו הבנה טובה של גאוס, גרין ושדות משמרים אבל תקחו עם מרצה נורמלי. הציון הכי נמוך שלי בתואר אי פעם וכנראה שאחזור עליו בהמשך בלב ברירה. אם אתם אחרי נומריים, עדיף אלגברה במ(לא עם ניר בן דוד)", "timestamp": 1679144826491}, {"author": "noon", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גיא+ניר\nחוות דעת - הרצאות: גיא היה המרצה הסמסטר, הלכתי לכמה הרצאות בתחילת הסמסטר,מרצה די סבבה ,אין באמת מה להגיד\nבאמצע הסמסטר נטשתי את הקורס ובין מועדי א ל ב ראתי המוקלט של ניר כדי ללמוד לבחינה,מה שאהב את ניר מקורסים קודמים יאהב אותו גם פה,ומ שלא התחבר לשיטת הלימוד(דיבור אפילו)שלו לא יתחבר\n\nשם המתרגל/ת: מוקלט של אולג\nחוות דעת - תרגולים: אולג מתרגל די טוב, פתר תרגילים שהסבירו רעיונות שלא היו ברורים עבורי ,הקושי בשבילי בקורס הזה היה לצייר את הגרפים התלת מימדיים ולהבין מה רוצים  ממני,הוא עזר לי להבין איך לגשת לתרגילים .ממליצה\n\nשעורי הבית: עשיתי רק את הראשוניים, הוויבורקים עמוסים וקשים, כמו שאמרתי קודם היה קשה עבורי להתעסק עם גרפים תלת מימדיים ולכן שיעורי הבית היו קשים,לא הגשתי חוץ מהראשונים(אגב שחזרתי לשיעורי הבית אחרי שראיתי מוקלטות ניר ואולג והבנתי יותר את החומר נהיו הרבה יותר קלים אז בגדול הם לא קשים אם מבינים-וזה המצב הנורמלי חח-)\n\nהמבחן: עשיתי רק את מועד ב, ולומר את האמת הם לא קשים אמ מתכננין ולומדים, אני למדי לבחינה יומיים(פתירת מבחנים וחזרה על החומר כי עבר זמן מאז שצפיתי במוקלטות לבין שהתחלתי ללמוד בגלל המלחמה)אז לא השקעתי המון זמן אך קבלתי ציון סביר, אז אם באמת פותרים מבחנים ולומדים לא קשה לקבל ציון גבוה\n\nהשורה התחתונה: קורס חמוד, שווה את 2.5 נקודות בדיוק כי לא עמוס וברובו/כולו טכני אז אין לשנן הוכחות ובלגן כזה, לא יודעת איך ניר כותב מבחנים אבל אם לוקחים אותו עם גיא,תהיו על החומר במהלך הסמסטר,ו 4 ימים של פתירת מבחנים(ותעשו ש\"ב כי זה מגן) ותצאו בציון מכובד", "timestamp": 1704697431758}, {"author": "וקטור", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה די בסדר, מסביר בצור טובה את החומר את ההרצאה מעביר אותה בצורה כיפית עם בדיחות פה ושם, מבחינת הוראה הוא אחלה מרצה.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: ואללה זאת רבקה כולם מכירים אותה תותחית.  חבל שיש רק שעת תרגול אחת, בשעה הזו לא מספיקים כלכך תרגילים.\nהערה: יש הקלטות לחדוא 2ת מסמטר אביב23 של רבקה, השאלות שהיא פותרת שם אחד אחד לחומר שלנו ממליץ מאוד.\n\nשעורי הבית: 5 גליונות -8 וויבורקס\nהגליונות די קלים ובסיסיים, הווברקים יותר רלוונטים וקשים.\n\nהמבחן: ואי ואי מועד א' היה קשה, שתי השאלות הפתוחות לא פתירות ניר הצליח לשים את כל הטריקים בהם, האמריקאיות היו יחסית בסדר חלקם ממוחזרים אם לא כולם.\n\nהשורה התחתונה: ניר נתן הרגשה שזה קורס קל אבל לא זה ממש לא, אל תפלו לזה, המבחנים מאוד קשים וצריכים הבנה עמוקה של החומר ולא רק לפתור שאלות ולהבין את השיטה. מבחינת עומס, הקורס לא עמוס ולא דורש המון זמן למידה בסמסטר. החומר נחמד מאוד, אישית אהבתי, ועוזר מאוד בפיסיקה 2\\2ממ וכל צאצאיו.\nהערה: ניר הוא מרצה חכם מאוד, לפעמים יש לו צפי גבוה מהסטודנטים וזה מתבטא במבחנים הקשים שהוא כותב אז למי שלוקח את הקורס עם ניר תצפו להיות בהלם באמצע המבחן. בהצלחה:)", "timestamp": 1715071771187}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות של ניר בן דויד מי שאוהב את ניר יאהב מי שלא לא, לדעתי לא מסביר הכי טוב.\nיש הקלטות של צנזור של חדווא 2ת מצויינות מקיפות הרבה יותר מהחומר אבל מסבירות ממש בפירוט ובצורה טובה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nרבקה מהירה מידי לדעתי, כותבת בצורה מבולגנת ולא מפרטת, לנסות תרגולים מוקלטים של חדווא 2ת \n\nשעורי הבית: \nגיליונות קלים וובארקס ארוכים\n\nהמבחן: \nמאוד תבניתי\nהשורה התחתונה: \nאהבתי את החומר מאוד מעניין", "timestamp": 1715762425852}, {"author": "בסמסטר מצחיק במבחן בא לך למות", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nניר מצחיק ומלמד בצורה חוויתית ומנסה להדגים ולפתח אינטואיציה בכיתה, אולם כשניגשים לחומר מבינים שהוא לא באמת מסביר טוב\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nרצה ממש אבל אם תשאלו אותה שאלה היא תשמח לעצור ולהסביר, יש לה רשימות שאפשר לבקש ואפשר גם פשוט לצלם את הלוח כדי להספיק ולהיות בקצב. אפשר ללכת אליה לשעות קבלה לא רק בשעות שרשומות והיא תעזור, היחידה שמנסה לעשות סדר בקורס הלא מוגדר הזה.\nשעורי הבית: \nהגיליונות סבירים וחשובים למבחן, חלקם שאלות ממבחנים, כדאי להתעכב ולהצליח לפתור ואולי אפילו ללכת לשעת קבלה *אצל רבקה* אם אתם מרגישים שיש דרך קלה יותר לפתור - כנראה שיש.\nהוובורק פחות.\nהמבחן: \nכמו כל המרצים ניר אמר שיתחשבו בהתאם למצב הסמסטר, התוצאה היא הממוצע הכי נמוך שהיה אי פעם. הפתוחות היו קשות בצורה לא פרופורציונלית ולא היה מספיק זמן למבחן. רק 47% עברו. מרגיש שניר פשוט נותן חידות שמעניינות אותו וגורם לסטודנטים להישאר עם טעם רע ולשנוא מתמטיקה.\nהשורה התחתונה: \nהקורס לא מוגדר לחלוטין ויכול להסתמך על דברים שאתם אמורים לזכור מאינפי פתאום (המשפט היסודי) או מגאומטריה בתיכון (משפט הקוסינוסים) כדי לפתור שאלה למרות שיש מספיק חומר שנלמד ולא ברור למה, אולי מחוסר הבנה של הסגל או סתם אטימות.\nמשפט זה נכתב בדם:\nאם אתם לא חייבים לקחת את הקורס הזה אז תקחו אלגברה במ' בחיים אל תקחו את הקורס הזה - זה פשוט לא שווה את זה.", "timestamp": 1715847966674}, {"author": "אל תקחו עם ניר, מתחנן", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ההוראה שלו בסדר, ואף בכיתה מצחיק איתו.\n\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: חזקה, אין עליה, לפחות היא מתרגלת טובה ואכפתית\n\nשעורי הבית: גליונות קלים מדי, וויבוררקס יותר רלוונטיים\n\nהמבחן: ואללה ניר לא יודע איך הוא חושב, איזה מבחן קשה הוא הביא, ומה עוד טען שהמבחן הזה יותר קל מקודמיו, אך ההיסטוגרמה מראה אחרת!!! המבחן עם הממוצע הכי נמוך אי פעם, יותר מ-50 אחוז נכשלו בסופי, איך לעזאזל זה מבחן יחסית קל? למי הוא השווה? למבחנים עם ממוצע 70+-? הוא טען שנתן פקטור 5 נק' \"רק בשביל לשפר את הסטטיסטקה\" שבכל מקרה הסטטיסקה הזו נשארה די נמוכה ביחס לשאר הסמסטרים!\n\n\n\nהשורה התחתונה: אל תקחו עם ניר!, תחכו לסמסטר שבו ניר לא אחראי, שלחנו לו הודעה על כך שהמבחן היה בלתי סביר והרוב נכשל, לא עניין אותו התייחס לזה בזלזול, חבל לכם לקחת איתו. תתרחקו כל עוד אתם יכולים להתרחק, אני לא מכיר את המרצים האחרים שלוקחים את הקורס, אבל מבטיח לכם שאיתם יותר טוב מניר.\nניר לא אכפת לו משום סטודנט, הוא חושב שאנחנו רק מספרים. לא יודע מה אפשר עוד להגיד על ניר, אבל תתרחקו!!!!\nואיך שהוא אומר, כל טוב.\n\n\nאם אין חובה לקחת את הקורס, אל תקחו, למרות שהחומר מאוד מעניין וכיפי. אבל חבל להכאיב את הראש.", "timestamp": 1715949704700}]}