{"posts": [{"author": "ירדן פלאש", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: אגדה!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597742654417}, {"author": "מיתר סעדה", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מדהימה!! מעניינת ומעבירה את החומר בצורה טובה.\n\nשם המתרגל/ת: חירייה\nחוות דעת - תרגולים: רצה על החומר ולא אוהבת ששואלים שאלות אבל מתרגלת ממש טובה\n\nשעורי הבית: סבירים\n\n\nהשורה התחתונה: קורס סבבה, דורש תרגולים וללכת רק לעליזה.", "timestamp": 1610812082745}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  לודה מרקוס\nחוות דעת - הרצאות:  \nמועברות מעולה ובצורה רציפה ומובנת\nשם המתרגל/ת: אילה נטלי אביגדור\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה שיש\nשעורי הבית: \nקלים- בינוניים\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612725088877}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לודה\nחוות דעת - הרצאות: המרצה הכי טובה בפער, מאוד מסודרת ומעבירה את החומר טוב\n\nשם המתרגל/ת: אילה נטלי אביגדור\nחוות דעת - תרגולים: מתרגלת פצצה\n\nשעורי הבית: הוגנים, דומים לשאלות בתרגול\n\nהמבחן: מאתגר\n\nהשורה התחתונה:", "timestamp": 1612776906725}, {"author": "ענת זיידמן", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לודה (לודמילה) מרקוס\nחוות דעת - הרצאות: \nמרצה מדהימה! מסודרת מאד, סבלנית, מסבירה מעולה\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nמתרגלת מעולה, נותנת סוגים שונים ורבים של תרגילים וטיפים רבים איך לפתור אותם, מסבירה טוב מאד.\nשעורי הבית: \nהתרגילים מעט חוזרים על עצמם בכל נושא אך תורמים להבנה.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612858318739}, {"author": "אופיר ביננטל", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לודה מרקוס\nחוות דעת - הרצאות: מרצה מעולה!! נעימה ומסבירה בהירות ועונה על שאלות בסבלנות\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: הקצב של התרגול מאוד מהיר, באיזשהו שלב הבנתי שעדיף רק לרשום את הנקודות החשובות שנאמרות ולא את כל התרגול. הוא מעלה את הכל בקבצי PDF מאוד נוחים ומסביר את צורת החשיבה לפתירת תרגילים בצורה מצויינת, ברורה ופשוטה\n\nשעורי הבית: יחסית קלים\n\nהמבחן: יותר קשה מהש\"ב\n\nהשורה התחתונה: קורס אפשרי", "timestamp": 1612952710539}, {"author": "Lidor Bibi", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לודה \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \n\nשעורי הבית: המון\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1613375364822}, {"author": "יניב גיטלמן", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1613403683890}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מושלם! מסביר הכל בצורה מעולה!\n\nשעורי הבית: עוזרים להבין את החומר ולהתכונן לבחינה, לא עמוסים\n\nהמבחן: רמת קושי סבבה לגמרי. הסמסטר המבחן בזום היה מעט לחוץ מידי בזמנים (יותר מידי שאלות ופחות מידי זמן) \n\nהשורה התחתונה: חומר מעניין ואם משקיעים במהלך הסמסטר בהחלט אפשר להצליח במבחן", "timestamp": 1614104865158}, {"author": "אייל מעוז", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nעליזה מרצה מושלמת. היה סמסטר בזום, ואפילו אז האווירה בכיתה הייתה כל כך נעימה וכיפית. הייתי רוצה לדעת איך זה בשנה נורמלית. החומר מעניין ובמובן מסוים כיפי.\n\nשם המתרגל/ת: גרשון אברהם\n\nחוות דעת - תרגולים: \nגרשון מתרגל מדהים. הוא בקצב טוב, ועונה לכל השאלות ששואלים אותו. בנאדם נעים.\n\nשעורי הבית: \nיש יחסית הרבה, אבל לא רצחניים.\n\nהמבחן: \nאישית, לי היה יחסית פשוט. שמעתי אחרים שהיה להם קשה, אבל סה\"כ מבחן הוגן. אין ניסיון להכשיל\n\nהשורה התחתונה: \nקורס מעניין, ומרגיש רלוונטי להמשך התואר", "timestamp": 1615126644231}, {"author": "Naor Mahani", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: דרך העברת החומר מאוד עניינית והחומר נקלט יחסית טוב אבל לקראת הסוף מתחיל קצת להסתבך אז לא לקחת כמובן מאליו.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: אם לא מובן משהו בהרצאות, רבקה תמיד מוכנה לרדת לפרטי פרטים כדי להבטיח הבנה מוחלטת של החומר. מסבירה מעולה והדוגמאות בדרך כלל מכסות את רוב החומר שצריך לדעת.\n\nשעורי הבית: בסיסיים, עוברים על רוב החומר שנלמד באותו השבוע וממצים את החומר די טוב.\n\nהמבחן: בסמסטר שלי החלק הראשון היה סבבה והוגן אבל החלק השני היה לחוץ מאוד בזמן, לא כדאי להיות שאננים במבחן, יש הרבה לכתוב.\n\nהשורה התחתונה: סך הכל אחלה קורס, אחלה מרצים, אחלה מתרגלים.", "timestamp": 1615161997900}, {"author": "andrey", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לודה מרקוס\nחוות דעת - הרצאות: מרצה מעולה!!! חבל שעזבה לתל אביב\n\nשם המתרגל/ת: רבקה/גרשון\nחוות דעת - תרגולים: שני המתרגלים מעולים!!!\nגרשון עושה סדר בחומר\n\nשעורי הבית: לא קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס נחמד אבל דורש השקעה", "timestamp": 1615885352275}, {"author": "----", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: לודה\nחוות דעת - הרצאות: מדהימה! מרצה מעולה, עונה לכל שאלה עם סבלנות רבה ורצון אמיתי לעזור כדי להגיע להבנה.\n\nשם המתרגל/ת: איילה\nחוות דעת - תרגולים:  בזכותה הצלחתי במקצוע. מתרגלת מעולה! מעבירה את התרגולים בצורה ברורה, דואגת לשתף את הסטודנטים ( למרות הקושי של הזום- התגברה עליו בצורה מעולה). מסבירה כמה פעמים שצריך עד שכולם מבינים. אכפתית מאוד.\n\nשעורי הבית:  לא קשים במיוחד. \n\nהמבחן: המבנה של השנה שונה משנים קודמות, המבחן עצמו לא מסובך אבל קצת לחוץ בזמן. מי ששוחה בחומר יכול לקבל בקלות רבה מעל 80.\n\nהשורה התחתונה:", "timestamp": 1615924371185}, {"author": "noam nissim", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לודה מרקוס\nחוות דעת - הרצאות: מרצה מעולה.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת טובה מאוד\n\nשעורי הבית: וובורק וגליונות הגשה, בסדר גמור אם משתמשים ברפרנס\n\nהמבחן: מבחן בסדר גמור\n\nהשורה התחתונה: קרוס קצת אבסטרקטי אבל בהחלט אפשר להוציא ציונים טובים", "timestamp": 1616260352774}, {"author": "Gilad sella", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  ד''ר לודמילה מרקוס\nחוות דעת - הרצאות:  מרצה מעולה!!!! ממש חבל שעזבה את הטכניון, מסבירה מעולה את החומר, אבל היה לעיתים קצת משעמם, כנראה בגלל סמסטר קורונה. ניסתה להעביר כל שיעור כך שהסטודנטים ייהנו.\n\nשם המתרגל/ת:  איילה נטלי אביגדור \nחוות דעת - תרגולים:  מבחינתי התרגול שלה היה העמקה והבנה של החומר שנלמד בהרצאות, די מהירה אבל מאוד חרוצה וחשוב לה להעביר תרגולים גם כאשר ישנן בעיות.\n\nשעורי הבית:  מחולקים לשניים - webwork ותרגילי הגשה סרוקים. הסרוקים יחסית קלים ויש רפרנס, אבל ה- webwork מאוד קשים ורמה מעל ההרצאות והתרגולים, אבל כאששר מבינים את הרעיון הכללי ניתן לצלוח אותם.\n\nהמבחן:  היה בנוי נוראי - שני חלקים בני שעה ורבע ושעה זוז הייתה הבעיה העיקרית בו. רמתו הוגנת וממליץ אישית לתרגל מהספר של עליזה מלק על מנת להבין את הנושא כי השאלות שם ברמה של מבחן.\n\nהשורה התחתונה:  לא מאוד עמוס או קשה, יכול להיות מעניין אבל תלוי מרצה ומתרגל", "timestamp": 1616362988318}, {"author": "אוהד קטרי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר לודמילה מרקוס\nחוות דעת - הרצאות: עזבה את הטכניון וכואב הלב.\nפייר המרצה הכי טובה שיש\n\nשם המתרגל/ת: איילה נטלי-אביגדור\nחוות דעת - תרגולים: מאוד מסורה לתפקיד שלה כמתרגלת.\nנוטה לטוס על החומר אבל ניתן להבין אותה, אפילו להבין טוב\n\nשעורי הבית: מלא שיעורי בית, כי יש לא מעט נושאים והרבה מה לחסות בהם.\nלא להשתמש ברפרנסים (!!!!) למרות שזה מפתה, זה יהרוס לכם במבחן\n\nהמבחן היה פשוט איום ונורא מבחינת המבנה שלו, במקום מבחן של 3 שעות היה מבחן בשני חלקים של שעה ורבע והשני שעה...\nמחסור פסיכי בזמן למרות שהרמה הוגנת.\nאם גם לכם זה ככה- לא להתקע על שאלות כי זה מאכיל סרטים ואין זמן\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1616439592564}, {"author": "אביב", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה מעולה. לפעמים קצת מבולגנת אבל סה\"כ מאוד מתלהבת מהחומר וכיף לשבת בשיעורים שלה.\n\nשם המתרגלת: חייריה מסרווה\nחוות דעת - תרגולים: מסבירה הכל ממש טוב, הייתי מחכה לתרגולים איתה בשביל שהחומר יתבהר לי כמו שצריך.\n\nשעורי הבית: חשוב להשקיע כדי שהחומר יוטמע כראוי\n\nהמבחן: הוגן", "timestamp": 1617543363649}, {"author": "ניר", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מושלמת.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: המפתח להצלחה בכל קורס מתמטי\n\nשעורי הבית: הוובוורקים יותר קשים מהגיליון, בגיליון תשוו מול הרפרנס\n\nהמבחן: המבחנים של דניאלה בסדר אבל הפקטור מאוד נדיר אז זה בעייתי\n\nהשורה התחתונה: \nתבינו את כל הנושאים יש פשוט כל כך הרבה שאלות שאפשר לשאול ואם משהו קטן לא ידוע אז אין לכם סיכוי כל כך", "timestamp": 1627214825272}, {"author": "דניאל", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה תותחית וידועה מאוד, היא די רצה אז מי שמתקשה עם הקצב שלה כדאי שילך למרצה אחר.\n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים: מתרגל תותח, בלתי אפשרי גם להעתיק מהלוח וגם להקשיב לו, ממליצה להוריד את תוכן התרגולים מהאתר שלו \"חשבוניה\" רוב התרגילים שהוא פותר נמצאים שם, יש כאלה שאין להם פיתרון אז לשים לב\n\nשעורי הבית: תרגילי בית סבירים עד קלים, וובורקים טיפונת יותר קשים.", "timestamp": 1643908973703}, {"author": "Dor Katz", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: מלכת עולם, מסבירה את החומר מעולה. קצת מתעכבת אבל עושה שיעור השלמה אחד ואז זה מתאזן. באמת מצויינת\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מלך\n\nשעורי הבית: \n\nהמבחן: הוגן סך הכל\n\nהשורה התחתונה:", "timestamp": 1644505605505}, {"author": "אבישג.ד", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nילנה לא מובנת בכלל ומלחיצה מאוד. לא ממליצה ללכת אליה אם אתם עושים פעם ראשונה אלגברה לינארית או רוצים הבנה מלאה. לכו לעליזה במקום. מה שכן ילנה נותנת לשאול שאלות ולא צפוף אצלה אז קחו לשיקולכם.\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: \nגלינה היא מקסימה מאוד ונחמדה. היתה כמו חברה טובה בקורס. יותר טובה מהמרצה. ממליצה מאוד ללכת אליה. היא מסבירה נפלא ואפשר לשאול אותה מה שאתם רוצים. עוזרת גם בשיעורי הבית. ממליצה עליה ולא על עטרה שנראה כאילו היא למדה את החומר חמש דקות לפני השיעור.\nשעורי הבית: \nשיעורי הבית בוובוורק הם מעייפים, מתישים ובעיקר מעצבנים. אבל הם נותנים הבנה התחלתית ובסיס טוב אז ממש כדאי לעשות אותם. השיעורים בכתב הם טובים יותר מהוובוורק. הם נבדקים בקפידה. ממש יורידו לכם נקודות על כל דבר קטן אז תעשו אותם בדיקדוק.\nהמבחן: \nהמבחן של דניאלה מאוד צפוי ומאוד הוגן. תתרגלו כמה מבחנים שלה ותראו שזה ממש אותו הדבר. מבחן טוב.\nהשורה התחתונה:\nקורס טוב אם בוחרים מרצה טוב.", "timestamp": 1644960794227}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ילנה פוגרבניאק \nחוות דעת - הרצאות: מקצועית, אדם נעים, לא רצה בחומר ונותנת המון דוגמאות ולא רק תאוריה, אווירה מאוד נעימה בכיתה, מתחייסת בכבוד לכל שאלה של סטודנט ותסביר בסבלנות גם 20 פעם את אותה דוגמא אם צריך. מלמדת באהבה.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין משהו להוסיף על גרשון שלא נאמר כבר. מומלץ מאוד, יודע להעביר את התכלס שצריך לדעת, השיטות והצורת חשיבה של המבחן. מדבר מאוד מהר ורץץץ קשה מאוד לעקוב ולהעתיק מהלוח כמעט בלתי אפשרי אפילו.\n\nשעורי הבית: הוובורקים האחרונים קשים \n\nהמבחן: הוגן ולא מכשיל\n\nהשורה התחתונה: אפשרי להצליח בציון טוב אפילו. להשקיע ולהיות על זה כל הסמסטר. לא לצבור פערים ולגלות מאוחר מדי שיש רק שלושה ימים ללמוד למבחן כי הוא ישר אחרי חדוא שזה כבר סיפור בפני עצמו", "timestamp": 1644961000742}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nשמה הולך לפניה! מרצה מדהימה שמסבירה מעולה ומשקיע המון בזה שכולם יבינו. קצת מבולגנת אבל המקצוע הזה דורש המון ריכוז ככה שקשה להאשים אותה.\nשם המתרגל/ת: חירייה\nחוות דעת - תרגולים: \nמתרגלת תותחית שבתור מתרגלת אחראית לא פעם התחשבה בנו והזיזה את המועדים של ההגשות. כל שעת קבלה שלה נראית כמו עוד תרגול והיא בכל זאת משקיע ואכפת לה מכל אחד שמגיע. \nשעורי הבית: \nהוובוורק קריטי מאוד לטכניקה. הוא ללא ספק כמה וכמה רמות מעל הנדרש אבל ככה לומדים. גליונות- להשקיע כי זה שאלות ממבחנים וזאת הדרך הכי טובה ללמוד.\n\nהמבחן: \nלמבחן יש מבנה שחוזר על עצמו. אם פותרים מספיק מבחנים אפשר לתקתק את השאלות הפתוחות מאוד מהר ולהתמקד בשאלות הסגורות שיכולות להיות טריקיות.\n\nהשורה התחתונה: \nקורס שדורש השקעה שאפשר להוציא בו ציונים טובים.", "timestamp": 1645024487379}, {"author": "sahar", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: סובלנית ועונה על כל השאלות שנשאלו. מסבירה מדהים ונעימה לכיתה\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל תותח אבל מהיר מידי ולא מבין שלוקח זמן לעכל את החומר.\n\nשעורי הבית: \nבכמות שמתאימה לנקז\nהמבחן: \nדניאלה ממחזרת מבחנים / מבנה של מבחן. פתירה של כל המבחניםש לה מכינה למבחן האמיתי.\n\nהשורה התחתונה: תהיו על החומר בסמסטר ולא להזניח כי מרגיש קל לרגע.", "timestamp": 1645051679579}, {"author": "יהיה בסדר", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה \nחוות דעת - הרצאות: אלופה! עליזה מסבירה את החומר בצורה טובה ושמה דגש בעיקר על הטכניקה (שזה מה שצריך למבחן), ככה שרוב ההרצאות הרגישו כמו עוד תרגול. ההרצאות שלה מפוצצות אז אולי עדיף להתחבר מהזום (אם עדיין יש את האופציה) במקום לתפוס מקום חצי שעה מראש לפחות.\n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: גם תותח, סוגר את כל הפינות שאולי נשארו פתוחות מההרצאה. ולגמרי אפשר לוותר על לכתוב בתרגולים שלו כי הכל מופיע בקבצים שלו שבאתר החשבונייה.\n\nשעורי הבית: \nהגיליונות קלים, מהירים ומאוד חוזרים על עצמם. הwebwork קצת יותר קשים לרוב, אבל מאוד תורמים להבנה של החומר. לא להילחם על 100 בכל webwork!\n\nהמבחן: \nמאוד הוגן ולדעתי נוטה לכיוון הקל. דניאלה שומרת על המבנה של השנים האחרונות לכן כמה ימים לפני המבחן לחרוש על המבחנים שלה ואמור להיות בסדר.\n\nהשורה התחתונה:\nקורס נחמד, טכני בעיקר. הנושאים בקורס מאוד נבנים אחד על השני, אז רצוי להיות על החומר במהלך הסמסטר, ואז לא אמורות להיות בעיות בלמידה למבחן. \nאם מתכוננים כמה ימים ושומרים על ההבנה במהלך הסמסטר, ציון גבוהה אפשרי.", "timestamp": 1645101691890}, {"author": "צ", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: מרצה לא טובה, לא ברורה, עדיף ללמוד לבד מאשר להגיע להרצאות. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל מצוין מסביר מאוד טוב, כדאי להגיע.\n\nשעורי הבית: קלילים רק להגיש בזמן ויש מגן טוב\n\nהמבחן: מבחן ברמה מאוד נחמדה, עם חזרה טובה מצליחים, קורס להוציא בו ציון טוב.\n\nהשורה התחתונה: קורס נחמד שאפשר להוציא ציון טוב בלי הרבה השקעה.", "timestamp": 1645384500062}, {"author": "hila", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות : הרבה יותר שקטות ועם פחות אנשים לעומת עליזה . אני אהבתי מאוד, ברורה מאוד .\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: גם היא, כפרה עליה, לא במיינסטרים של המתרגלים, אבל היינו 15 סטודנטים מקס' בתרגול וזה נתן את האפשרות לעבור את התרגול בצורה הטובה ביותר . אני ממליצה\n\nשעורי הבית: הוגנים מאוד ויש רפרנסים מעולים\n\nהמבחן: פייר בצורה קיצונית, מי שלא הצליח זה כי הוא לא למד/ לא פתר מספיק מבחני עבר .\n\nהשורה התחתונה: אחלה קורס, אחלה סגל", "timestamp": 1645527922974}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: פשוט מדהימה! מסבירה הכל בצורה ממש טובה, נותנת המון דוגמאות, עונה לכל השאלות ותסביר שוב ושוב עד שמבינים.\n\nשם המתרגל/ת: ראואן\nחוות דעת - תרגולים: לא רצה על החומר, מסודרת וכותבת הכל על הלוח\n\nשעורי הבית: סבירים לגמרי, אפשר להוציא מגן טוב בקלות\n\nהמבחן: פייר\n\nהשורה התחתונה: באמת שאחלה קורס, להיות על החומר במהלך הסמסטר (פשוט לעשות את השיעורי בית) ואפשר להוציא אחלה ציון", "timestamp": 1645996235795}, {"author": "...", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה מצוינת. מלמדת בגובה העיניים. הבעיה היא שהיא כל כך מצוינת שהכיתות שלה מפוצצות. סטודנטים ממש שבו על הרצפה בתחילת הסמסטר. בסמסטר שלנו היא העבירה את ההרצאות במקביל גם בזום ועשתה את זה בצורה טובה, אז הרבה עברו לצפייה בשיעורים מהזום והעומס בכיתה ירד.\n\nשם המתרגל/ת: ראואן\nחוות דעת - תרגולים: מתרגלת בסדר, אבל ממש לא הכי טובה בצוות. מרגיש שהיא לא הכי בטוחה בחומר שהיא מתרגלת, ויותר מידי שאלו על החומר יכולות לערער אותה, אבל סך הכל היא מסבירה את החומר טוב.\n\nשעורי הבית: וובוורק וגיליון על כל נושא. הרבה עומס של שיעורי בית, אבל הרמה שלהם לא קשה מידי. לדעתי מאוד כדאי לעשות אותם כדי לתרגל את החומר ולהבין אותו עד הסוף.\n\nהמבחן: מבחן הוגן\n\nהשורה התחתונה: בשביל מישהו שאוהב מתמטיקה הקורס יכול להיות מעניין. מצריך השקעה, אבל לא קשה באופן חריג.", "timestamp": 1646572560172}, {"author": "Hay Zagory", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: עליזה תותחית, קורס מאוד עמוס\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון בוודאות\n\nשעורי הבית: אחלה ממש\n\nהמבחן: נבחנים על הרבה חומר וידע, אבל נפלנו במועד א לפחות, על מבחן מאוד מאוד הוגן\n\nהשורה התחתונה: הרבה יותר ידידותי מחדווא", "timestamp": 1646687665556}, {"author": "שיר", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: תותחית אך ממליצה רק לסטודנטים בעלי קליטה מהירה. לי היה מאוד קשה לעקוב אחריה.\n\nשם המתרגל/ת: ראואן טרבייה\nחוות דעת - תרגולים: מסבירה ממש טוב, סה\"כ אחלה\n\nשעורי הבית: הגיליונות היו קלים עד בינוניים. הוובוורקים טיפה יותר קשים.\n\nהמבחן: הוגן למדי\n\nהשורה התחתונה: הקורס הרבה יותר ידידותי וטכני מחדוא, אך יש המון חומר וצריך לזכור די הרבה משפטים. אפשר לעבור אותו בהצלחה.", "timestamp": 1647193262265}, {"author": "Emi", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  דניאלה אבידן\nחוות דעת - הרצאות: מרצה מצויינת, הסברים ברורים, הוכחות רלוונטיות. לא היו המון סטודטנים בהרצאה אז היה טוב, היא המרצה האחראית וכותבת את המבחן אז ידעה על מה לתת דגש ומה לא. לפעמים קצת חסרת סבלנות בנוגע לשאלות, כדאי לקרוא את סיכום ההרצאה הקודמת לפני כל הרצאה כי אין מקום לשאלות יבשות על החומר.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל פשוט מצויין, בתרגולים עושה חזרה זריזה על החומר, מביא שאלות ברמת קושי עולה ושאלות ממבחנים, עונה על שאלות ובכלל היה טוב מאוד!! ממליצה.\n\nשעורי הבית: מכינים טוב, בדיקה רנדומלית וסימון וי בלבד\n\nהמבחן: הוגן מאוד, אפילו לא היה מתחכם. דניאלה מצויינת. ממה שהסתכלתי, מועד ב היה מעט קשה יותר.\n\nהשורה התחתונה: דניאלה ואחסאן שילוב מנצח", "timestamp": 1647249186360}, {"author": "שלי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: לא כל כך התחברתי אליה, היה עמוס והיא זרמה עם בדיחות של אנשים וזה שרף מלא זמן מהשיעורים ואז היה צריך הרצאת השלמה, היא רצה מהר על החומר ולא כל כך מובן \nמה שכן היא עושה הרבה תרגילים לדוגמא והרבה פעמים זה דברים שאחר כך יש במבחנים אז היא כן עוזרת בלתת את הטכניקה וכל מיני שיטות\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nגרשון אלוף אבל הוא ממממש רץ על החומר ממליצה לעבור על החומר לפני התרגולים שלו ולהיות איתו ואז זה יעיל\nשעורי הבית: \nגליונות הגשה סבבה אבל וובוורק סיוט אל תתקעו על זה יותר מידי זמן זה בכלל לא קרוב לרמה של המבחן(המבחן הרבה יותר קל)\nהמבחן: מבחן ממש פייר, דניאלה מרצה אחראית טובה והיא לא מנסה לדפוק מה שכן הבוחן אמצע היה סיוט וממוצע ממש נמוך אז אולי ניסו לאזן אבל בכל מקרה לעשות כמה שיותר מבחנים של דניאלה ואתם מסודרים\n\nהשורה התחתונה: קורס עמוס ולדעתי לא קל, אבל בסוף הנושא האחרון הוא הכי חשוב ואם עושים הרבה מבחנים אפשר לקבל ציון ממש גבוה", "timestamp": 1647344432159}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: תותחית , מסבירה טוב , נותנת דוגמאות , מזהירה מטעיות נפוצות , אוהבת מה משיא עושה , לפעמים קצת מסבכת , לא אשמתה , הקורס טכני  צריך לחזור הביתה וללמד לבד מה שהיה בהרצאות\n\nשם המתרגל/ת: חירייה מסארוה\nחוות דעת - תרגולים: מעולה , ממליץ , השאלות שנותנת ברמה גבוהה ומאתגרות , דומות למבחן\n\nשעורי הבית: לדעתי שצריך לשבור את הראש בלפתור בוובוורק שווה זה יסדר טוב את כל הרעיונות שיש אבל לא להילחם על מאה , העיקר ללמד טוב , הגליונות כתב כלים יחסית ויותר נעימים\n\nהמבחן: \n\nהשורה התחתונה: קורס צריך השקעה אבל בסוף הכי כל בלצבור ציון גבוה", "timestamp": 1647389569621}, {"author": "Chen Gal", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ילנה פוגרבניאק\nחוות דעת - הרצאות: בסדר\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מתרגלת אחלה קצת איטית\n\nשעורי הבית: די הרבה\n\nהמבחן: מועד א קל מאוד\n\nהשורה התחתונה: בסדר", "timestamp": 1647698084538}, {"author": "Shir", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עלזיה\nחוות דעת - הרצאות: מדהימה \n\nשם המתרגל/ת: ראואן \nחוות דעת - תרגולים: סבירה\n\nשעורי הבית: \n\nהמבחן: בסדר\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1647883463306}, {"author": "עדן הוכלר", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: מעולה ! קצת מבולגנת אבל אני הצלחתי להבין אותה כמעט תמיד. ההרצאות באווירה טובה והיא עונה על שאלות בדר\"כ. מאוד (!) עמוס אצלה ברמה שכדי לתפוס מקום בשורות הראשונות היה צורך להיות באולם כ40 דק לפחות לפני תחילת ההרצאה.\n\nשם המתרגל/ת: חירייה\nחוות דעת - תרגולים: מצוינת, מאוד עמוס אצלה וצריך להגיע מוקדם.\n\nשעורי הבית: סבירים ממש, יש רפרנסים , אני השתמשתי בהם רק לבדיקת התשובות שלי לפני הגשה , מומלץ לא לרפרנס . הווברקים היו לפעמים הזויים ולא קשורים לתרגול/להרצאה ולקחו מלא זמן.\n\nהמבחן: היה ממש סביר גם כן, תרגול של מבחנים משנים קודמות ממש עזר היות וחלק לא קטן של התרגילים ממש חוזר על עצמו.\n\nהשורה התחתונה: קורס קצת עמוס , יש 2 3 נושאים יותר קשים להבנה אבל סבבה יחסית", "timestamp": 1648458231277}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: עליזה מרצה מעולה , מלמדת עם הרבה דוגמאות וחשוב לה שנבין. הייתי גם במספר הרצאות של דניאלה. היא מקסימה ומאוד אוהבת סטודנטים ומשתדלת להתחשב בהם\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל מעולה\n\nשעורי הבית: לא קשים כל כך , חשובים כדי להבין את החומר ולהצליח בבחינה\n\nהמבחן: \nהוגן מאוד. דניאלה חוזרת על המבנה , אם מתרגלים מבחנים לפני כן אפשר להוציא ציון מעולה.\nהשורה התחתונה:", "timestamp": 1648739342586}, {"author": "malek igbaria", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: אישית לא צפיתי באף הרצאה מהשבועות ב 4 האחרונים וקיבלתי מעל 90\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: גרשון הכי טוב לקורסים טכניים\n\nשעורי הבית: גליונות ברמת מבחן, ויבוורק ברמה הרבה יותר גבוהה\n\nהמבחן: מספיק לפתור 3 מבחנים, הכל חוזר על עצמו\n\nהשורה התחתונה:", "timestamp": 1650719560315}, {"author": "Shirel Gavrielove", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  ילנה פוגרבניאק\nחוות דעת - הרצאות: מרצה מהממת! מאוד מסודרת ועוברת על החומר ביסודיות. גם כאשר לא מובן היא לא מוותרת ומסבירה גם בדרכים אחרות. \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל מושלם. נותן את כל הדרכים להצליח. \n\nשעורי הבית: ארוכים ודורשים מחשבה אבל לא קשים ממש. \n\nהמבחן: פתיר והרבה פעמים מאוד טכני. כמעט תמיד אותו מבנה ואותם עקרונות לפתרון. תרגול של המון מבחנים מבטיח ציון טוב.\n\nהשורה התחתונה: קורס עם הרבה נק\"ז שיכול להעלות ממש את הממוצע.", "timestamp": 1663318742128}, {"author": "אושרת חניא", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: אחת מהמרצות הטובות שיש לטכניון\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: ממליצה ממש, יודעת שיש עדיפות לגרשון אבל ניקה לא נופלת ממנו ומסבירה ממש קוהרנטי\n\nשעורי הבית: רמת קושי סבירה\n\nהמבחן: גבוהה מהשיעורים\n\nהשורה התחתונה: ממליצה על עליזה וניקה כמתרגלת", "timestamp": 1672135372571}, {"author": "איליה כץ", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה אבידן המושלמת!\nחוות דעת - הרצאות: מרצה מדהימה, מסבירה באופן ברור ועם שפע של דוגמאות. כותבת ה-מ-ו-ן, חלק אולי לא יתחברו לזה (אני אישית אהבתי כי זה עזר לי לחזור על החומר לתרגולים)\n\nשם המתרגל/ת: ד\"ר ילנה פורגבניאק\nחוות דעת - תרגולים: מתרגלת טובה מאוד, מסבירה כמה פעמים שצריך עד שיבינו. מאוד מונוטונית וכותבת יחסית מהר, אז לא כולם הקשיבו לה באופן מלא\n\nשעורי הבית: חלק קלים, חלק קשים יחסית. יש 9 גליונות הגשה ידניים ו-11 גליונות בוובוורק, בגליונות ידניים השאלות הן ממבחנים של שנים קודמות. הוובוורק מכסה את ההרצאות טוב.\n\nהמבחן: בוחן אמצע סביר אבל טריקי. מבחן עוד לא היה\n\nהשורה התחתונה: קורס עמוס, אבל אם מגיעים להרצאות ולתרגולים ופותרים את כל שיעורי הבית לא קשה להוציא ציונים גבוהים.", "timestamp": 1673949920603}, {"author": "iGGor", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ד\"ר רונית מנסור\nחוות דעת - הרצאות: מרצה על רמה, לא יותר גרועה מעליזה. מסבירה מובן ולא מהר, תמיד מביאה הרבה דוגמאות ולא מתעכבת על מה שלא רלוונטי. מאוד נחמדה אבל בגלל זה עושים אצלה בלאגן לפעמים (רעש ועוד...). תמיד עונה לשאלות ועוזרת לסטודנטים.\n\nשם המתרגל/ת: ראואן טרביה\nתרגולים טובים אבל ברוב התרגולים לא יצא לי להיות כי היה מפוצץ\nחוות דעת - תרגולים: המתרגלים מצוינים אבל התרגולים עמוסים מאוד, לפחות 40 איש בתרגול, אצל גרשון בכלל מפוצץ ומגיע ל-70 או 80 איש ולא כזה שווה ללכת אליו כי הוא רץ בחומר ומלמד כמו מכונה.\n\nשעורי הבית: הרבה גיליונות בכתב אבל הם ממש סבירים ובדרך כלל משקפים את הרמה של הקורס. הוובוורקים מזוויעים ולפעמים מגיעים לרמות קושי הרבה יותר גבוהות מהגליונות, לא שווה לשבור את הראש.\n\nבוחן אמצע: בדרך כלל בחני אמצע סבירים אבל הפעם נתנו בוחן אמצע מתחכם ומגעיל קצת (ומי שאומר אחרת מדחיק את העובדה שהוא נכשל), ממוצע 50 והרבה יותר קשה ממבחני עבר ובחני עבר בכללי.\n\nהשורה התחתונה: עד שמגיעים לבסיס ומימד הקורס סבבה. אחר כך נעשה מאוווד תיאורטי ומסובך אבל הסגל סך הכל מצויין", "timestamp": 1673973146930}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: ממש מעולה, בקצב טוב ועוצרת לוודא שכולם מספיקים להעתיק. עונה על שאלות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מאוד טוב, תשתדלו להיות בתרגולים הריקים שלו כי אז הוא בקצב טוב, בתרגולים הגדולים הוא נוטה לרוץ בחומר\n\nשעורי הבית: לוקח זמן למחשבה אבל לא מלא לעומת קורסים אחרים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675343502531}, {"author": "איזה אחד", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רונית מנסור.\nחוות דעת - הרצאות: בסך הכל טובה, אבל לפעמים מתבלבלת, בעיקר אם שואלים שאלות לא במקום או מציעים פתרונות לא נכונים לתרגיל. מדי פעם מוסיפה איזו בדיחה, וזה נותן להרצאות אווירה נחמדה.\n\nשם המתרגל/ת: גרשון אברהם.\nחוות דעת - תרגולים: מלמד ממש טוב.\n\nשעורי הבית: לא קשים במיוחד, מאוד טכניים.\n\nהמבחן: טכני.", "timestamp": 1675372244428}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן( הקלטות)\nחוות דעת - הרצאות: מרצה מעולה!\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מתרגלת תותחית! קשובה, עונה לשאלות בסבלנות ורואים שחשובה לה ההצלחה של הסטודנטים. נהנתי בתרגולים!\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס עמוס במושגים חדשים, אבל הצוות מעולה.", "timestamp": 1675808352123}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רונית מנסור\nחוות דעת - הרצאות: לפעמים מרגיש שהיא בעצמה לא יודעת מה היא מלמדת. אל תלכו\n\nשם המתרגל/ת: ראוון טרביה\nחוות דעת - תרגולים: שולטת בחומר ומסבירה ברור\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675854247375}, {"author": "A", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: \nעליזה מעולה אבל לפעמים רצה וקשה לעקוב למרות שהחומר לא תמיד מסובך \nיש לה סרטונים ביוטיוב 1 ל1 ההרצאות מומלץ \n\nשם המתרגל/ת: גרשון/ראואן\nחוות דעת - תרגולים: \nגרשון מעולה לוקח את התרגילים מהאתר שלו החשבונית אישית למדתי משם והרגשתי שזה שימושי\nעברתי לראאון בגלל העומס אצל גרשון מתרגלת מעולה רהוטה \n\nשעורי הבית: יש רפרנסים להכל אבל חשוב לעשות לבד קודם \n\nהמבחן: לא פשוט בכלל \n\nהשורה התחתונה: לעבור על מבחנים קודמים כולם באותו נוסח סגנון שאלות דומה\n לחלק זמן למידה לפי המשקל של מה שנמצא במבחן", "timestamp": 1676036332343}, {"author": "לכסינה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nדניאלה מאד מסודרת בהרצאות שלה, הכל כתוב בצורה מאד ברורה והיא מאד מאורגנת, אהבתי את זה מאד. היא גם המרצה האחראית וכל המבחנים שלה מהשנים האחרונות נראים בדיוק אותו דבר - מי שמתרגל מספיק לא צריכה להיות סיבה שלא יצליח\nשם המתרגל/ת: ילנה פוגרובניאק\nחוות דעת - תרגולים:  סהכ התרגולים די תרמו, אני חושב שלא כל אחד יתחבר לילנה אבל מאד חשוב לה שנבין, תמיד עונה לכל השאלות ואם משהו לא ברור לא מוותרת ומסבירה שוב ושוב. בכל תרגול ותרגול גם פתרנו שאלה מהגיליון להגשה לאותו שבוע, ככה שבאמת הרגיש שהספקנו הרבה בתרגולים. בקיצור - מומלץ\n\nשעורי הבית: לא קשים ולרוב די טכניים, פשוט יש לא מעט מהם. המזל הוא שלא חייבים להגיש את כל הגיליונות.\n\nהמבחן: הוגן מאד\n\nהשורה התחתונה: קורס חובה, אפשרי להעביר אותו בכיף, ממליץ להגיע לכל ההרצאות והתרגולים ולהקפיד להכין את שיעורי הבית וזה אמור להספיק כדי לקבל ציונים מעולים.", "timestamp": 1676057199232}, {"author": "מטריצה הפיכה", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מרצה מעולה, מסודרת ומביאה המון דוגמאות. מאוד חשוב לי אישית שהיא רושמת את כל מה שנאמר על הלוח, כך שלפני המבחן והבוחן הכל מסודר. ממליץ מאוד ללכת אליה!\n\nשם המתרגל/ת: ילנה\nחוות דעת - תרגולים: מתרגלת אכפתית, מביאה דוגמאות ממבחנים ומשיעורי הבית, כך שתופסים את החומר מאוד טוב איתה. מומלצת.\n\nשעורי הבית: סבבה לגמרי. יש 9 גליונות כתובים, שלוקחים גג שעתיים-שלוש ועוד 11 גליונות ממוחשבים שממצים את כל החומר.\n\nהמבחן: הוגן וחוזר על עצמו משנים קודמות. ככל שתתרגלו יותר מבחנים הסיכוי להצליח גדל.\n\nהשורה התחתונה: צוות מעולה, מרוצה מאוד.", "timestamp": 1676195603045}, {"author": "Hanoch Egyes", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: טובה אבל רצה מהר\n\nשם המתרגל/ת: חירייה מסרווה\nחוות דעת - תרגולים: מאוד מהירה אבל מסבירה טוב ויש לה הרבה ניסיון\n\nשעורי הבית: מאוד עוזרים להבין את החומר \n\nהמבחן: מאוד צפוי הוגן, צריך לשבת וללמוד ומי שעושה את כל שיעורי הבית יגיע במצב טוב יחסית\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1676215786836}, {"author": "Anonymous", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רונית/עליזה\nחוות דעת - הרצאות: שתיהן מצוינות, כמובן שעליה הרבה יותר עדיפה אך מחוסר מקום החלפתי לרונית שגם היא מרצה מאוד טובה שעונה על כל שאלה ונותנת יחס טוב לכולם. היא כנראה חדשה בטכניון לכן חסר לה עדיין קצת ביטחון עצמי וזה מתבטא במענה קצת מוזר לפעמים על שאלות ששואלים אבל בכללי היא מצויינת\n\nשם המתרגל/ת: רואן טרביה\nחוות דעת - תרגולים: \nמתרגלת תותחית ונחמדה מאוד ממליץ בחום\nשעורי הבית: \nקלים\nהמבחן: \nקל מאוד למי שפתר 5-10 מבחנים לפני\nלהיזהר מטעויות חישוב הן האויב העיקרי במבחן\nהשורה התחתונה: \nקורס מאוד נחמד עם יחסית הרבה נקז שיכולים להעלות את הממוצע", "timestamp": 1676400863739}, {"author": "Yehonatan Or-hof", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: עליזה מדהימה. אם היא מלמדת ללכת אליה זה חובה \n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: כמו עליזה. רץ על החומר אבל מסביר רהוט וברור\n\nשעורי הבית: יש הרבה שיעורי בית אבל קל להוציא בהם 100 ולקבל מגן טוב. \n\nהמבחן: מאתגר אבל אפשר לגמרי להוציא ציון טוב. חשוב ממש שכל דבר שאתם כותבים יהיה, וגם אם נראה לכם ברור אז להוכיח. בעקרון אפשרי מאוד להוציא ציון טוב\n\nהשורה התחתונה:", "timestamp": 1676880317949}, {"author": "דבורית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות:  הרצאות מועילות, היא כותבת הכל על הלוח ויחסית מסודר, מי שמתאים לו שכותבים רבה אז מומלץ. טיפה מהירה צריך לדעת לעמוד בקצב שלה. ההרצאות לא היו מפוצצות כמו אצל עליזה אז זה טוב למי שלא רוצה לריב על מקום.\n\nשם המתרגל/ת: ילנה\nחוות דעת - תרגולים: היא מקסימה, מלמדת בקצב הגיוני, לא מהיר מידי, היינו סביב ה20-30 סטודנטים בתרגול שזה בונוס. למרות שהיא לא מלמדת בקצב מהיר סיימנו את התרגולים לרוב עשר דקות- רבע שעה לפני הזמן.\n\nשעורי הבית: לא עמוס במיוחד למי שעל החומר במהלך הסמסטר, הוובוורקים היו כאלה יותר קשים וכאלה שפחות, הגליונות באמת שטויות ויש חוברת פתרונות של הגליונות.\n\nהמבחן:  המבחן היה פייר לגמרי, אפילו דיי קל לעומת סמסטרים אחריםץ\n\nהשורה התחתונה: קורס באמת אחלה.", "timestamp": 1676969871459}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רונית\nחוות דעת - הרצאות: מרצה טוב, מאוד נחמדה ועונה על שאלות בסובלנות\n\nשם המתרגל/ת: ראואן\nחוות דעת - תרגולים: ממש חמודה ומסבירה מעולה. מראה המון שיטות וטריקים שימושיים למבחן\n\nשעורי הבית: הוגנים\n\nהמבחן: מי שלמד במהלך הסמסטר, המבחן לא יביא הפתעות איתו\n\nהשורה התחתונה: קורס סבבה לגמרי, חשוב לעבור על החומר כול הזמן", "timestamp": 1677882629122}, {"author": "Eli", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: \nבסך הכל בסדר גמור. ההרצאות מעוברות בקצב טוב, יש זמן להעתיק הכל והיא עונה על שאלות במקרה שיש אי הבנות. היא מהירה בחומר אך לא בצורה מורגשת כך שהרבה פעמים הקדמנו כיתות אחרות ובהרצאה האחרונה כבר רק תירגלנו. יש הקלטות שלה שהיא מלמדת ממש כמוהן ככה שאפשר להתכונן להרצאות דרך ההקלטות או לצפות באחת במקרה שפספסת הרצאה\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nמתרגל מעולה. \nאם אתם בתרגול מפוצץ שלו, הוא ירוץ בחומר אבל בתרגולים הקטנים יותר הוא מסביר הכל ועונה על כל השאלות ובכל זאת בדרכ גומר מוקדם. \nמסביר ממש טוב ומאוד ברור\nשעורי הבית: \nיש גיליונות ווואבוורקים, בוואבוורק יש בדרך כלל אינסוף ניסיונות והוא יותר קשה מהגיליונות. הגיליונות עצמם לא קשים, שום דבר שאי אפשר לפתור אם היית בהרצאות\nהמבחן: \nממש הוגן, דומה מאוד לכל המבחני עבר אז ממש אפשר לדעת למה לצפות\nהשורה התחתונה: \nקורס חובה אז אין לכם באמת אופציה אבל הוא ממש סבבה", "timestamp": 1678786906423}, {"author": "וו", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: הכי יפה וטובה וחמודה שיש\n\nשם המתרגל/ת: חירייה\nחוות דעת - תרגולים: מהממת לא מבינה איך היא לא מרצה בטכניון\n\nשעורי הבית: מאוד טובות וממומלצות\n\nהמבחן: המבחנים של דניאלה תמיד אותו סגנון\nתפתרו המון מבחנים ותצליחו\n\nהשורה התחתונה:", "timestamp": 1679042913256}, {"author": ",", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nדניאלה מרצה באופן מאוד ברור ומסודר. אני ממש ממליצה לראות את ההרצאות המוקלטות שלה. הן כמעט מילה במילה מה שקורה בהרצאה עצמה אז זו גם אחלה דרך להשלים אבל אני הרגשתי שלהגיע להרצאה אחרי שכבר שמעתי את החומר פעם אחת עזר לי לקלוט אותו יותר טוב ולשאול שאלות רלוונטיות על מה שבאמת לא ישב לי טוב בראש.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: גרשון מעולה פשוט יש לו נטייה לרוץ בחומר אם לא עוצרים אותו כדי לשאול שאלות\n\nשעורי הבית: הוגנים והגיוניים, לא היה משהו ששאלות שממש לא ראינו קודם בהרצאה או בתרגול. ממליצה לעשות אותם בלי רפרנס, זו ההכנה הכי טובה למבחן\n\nהמבחן: ממש הוגן. ברמה של התרגילי בית\n\nהשורה התחתונה: אחלה קורס, אני ממש נהניתי", "timestamp": 1679135948139}, {"author": "nitzanL", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מהממת \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: אמאלה ואבאלה איזה טובה היא\n\nשעורי הבית: נותנים תחושת ביטחון מוטעת\n\nהמבחן: מגלחים נקודות על ימין ועל שמאל\n\nהשורה התחתונה: היה קשה העיקא נגמר", "timestamp": 1679222467322}, {"author": "יוחאי יהב", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מעולה מומלץ מאוד מרצה משכמה ומעלה  \n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: מעולה מומלץ מאוד\n\nשעורי הבית: הוגן והגיוני\n\nהמבחן: הוגן \n\nהשורה התחתונה: קורס מדהים בעייני", "timestamp": 1679346049373}, {"author": "איתיאל דודקביץ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מאליס\nחוות דעת - הרצאות: ההרצאות ברמה טובה\n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים:  מסביר פשוט וטוב\n\nשעורי הבית:  עמוס\n\nהמבחן:  בינוני\n\nהשורה התחתונה: .", "timestamp": 1679379655736}, {"author": "matan arad", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רונית מנסור\nחוות דעת - הרצאות: נחמדה אבל מתבלבלת כל הזמן\n\nשם המתרגל/ת: לא הייתי בתרגולים אז לא זוכר\nחוות דעת - תרגולים: הייתי באחד, הבנתי שאין פואנטה ולא באתי יותר\n\nשעורי הבית: קלים\n\nהמבחן: קל מאוד\n\nהשורה התחתונה: קורס קל, מתנה אם אתה לומד נורמלי", "timestamp": 1679497424581}, {"author": "לג", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: \nהמרצה הכי טובה לדעתי. מאוד התחברתי לשיטה שלה וממש היה לי כל להתרכז איתה. בנוסף שיש לה סרטונים ביוטיוב אז אפשר לצפות אם מפספסים משהו. פשוט אלופה\nשם המתרגל/ת: חייריה/ גרשון\nחוות דעת - תרגולים: \nגרשון היה ממש עובר מהר על הכל ממש אפשר לראות שהוא רק רוצה להעביר חומר ולפעמים היה מתרגל דברים שעדיין לא למדנו בהרצאה. אז עברתי לחייריה והיא הייתה מעולה. בגדול לא חוזרת על החומר אבל מסבירה תוך כדי תרגילים ונותנת תרגילים ממש טובים\nשעורי הבית: \nלא קשים במיוחד עוזרים להבנת החומר\nהמבחן: \nבסך הכל סביר \nהשורה התחתונה: קורס שאפשר להנות ממנו", "timestamp": 1679501682113}, {"author": "Razan", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: ניסיתי גם את דניאלה וגם את עליזה. דניאלה טובה אבל לא אהבתי את הוויב שלה והיא כזה בשיעורים הראשונים לחלק מהשאלות אמרה חברים אתם בטכניון תפסיקו לשאול שאלות של 5 יחל מתמטיקה וזה היה סמסטר ראשון ויש אנשים שבאים אחרי צבא אז קצת לא אהבתי ועברתי לעליזה והיא פשוט תותחית על היא מסבירה את החומר כלכך טוב -לא סתם האולם של 250 איש היה אצלה מלא גם עם זום בלייב. חשוב לציין שדניאלה תמיד הייתה מקדימה את עליזה בהרצאות ולפעמים הייתה דורשת מהסטודנטים שלה להגיע לפני השיעור על מנת להספיק את החומר. כמובן שבסוף עליזה הדביקה את הפער איכשהו אבל על עליזה ניתן להבין הרבה יותר לדעתי.\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: הלכתי לחייריה בהתחלה והכיתה שלה הייתה ממש עמוסה + לא הבנתי עליה כלום כי היא טסה , ניסיתי את רונית - אף אחד לא מכיר אותה משום מה אבל היא תותחית על , היא מסבירה את החומר כלכך טוב ומלמדת באמת מכל הלב ואכפת לה שנצליח , בנוסף היא מביאה הרבה שאלות טובות במיוחד שאלות של הוכח או הפרך שדורשות יותר חשיבה - היא גם זריזה ממש וכמעט אי אפשר להעתיק איתה אז פשוט עברתי לצילום הלוח וזה ממש עבד לי.\n\nשעורי הבית: יש להם פתרון בכל דרייב אבל ממש חשוב לעשות אותם כדי להבין את החומר הנלמד אחרת הולכים לאיבוד - הם חביבים.\n\nהמבחן: הם בודקים את המבחן ממש בדייקנות וזה לא היה צפוי כי בפתרונות של המבחנים שנשלחים מהמרצה האחראית - דניאלה מאוד לא מנומקים אבל מסתבר שצריך הרבה יותר. אבל ניתן להוציא ציון טוב בקורס הזה. \n\nהשורה התחתונה: קורס לא כלכך עמוס פשוט מלא במושגים חדשים.", "timestamp": 1679694009716}, {"author": "Avivi Halfon", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: עליזה אחלה של מורה, היא מצחיקה, חברותית ובכללי כיף להיות נוכחים בשיעור שלה. \nכן יש פעמים שהיא יכולה להיות קצת מפוזרת אבל היא הייתה המרצה שהכי הצלחתי להבין.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: גרשון הוא אחלה! כל התרגולים שלו כבר נמצאים מסוכמים באתר שלו \"החשבוניה\" אבל אני אישית פחות הצלחתי לעמוד בקצב שלו, הוא בעיקר מסתמך שסטודנטים ישתמשו בחשבוניה - ויש כאלה (כמוני) שמבינים באמצעות כתיבה ופתירה של התרגילים - אין באמת אפשרות להעתיק להיות איתו בקצב.\n\n\nשעורי הבית: \n\nהמבחן: מבחנים פיירים לחלוטין! כל עוד אתם על החומר תו\"כ הסמסטר, יהיה בסדר.\n\nהשורה התחתונה: קורס שכל הנושאים הנלמדים נבנים אחד על השני (בשונה מחלק מהקורסים בסמסטר הראשון), כך שאם יש משהו שלא מובן - אתם חייבים להשלים את הפער בהקדם.", "timestamp": 1679845442345}, {"author": "איתיאל דודקביץ", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: מוצלח\n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: עמוס\n\nהמבחן: קשוח אבל הוגן\n\nהשורה התחתונה:", "timestamp": 1685952677444}, {"author": "ניצן כהן", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רונית\nחוות דעת - הרצאות: \nקצת מתפזרת עם שאלות של תלמידים אבל מעבירה את החומר בצורה ברורה. \nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: \nמדהימה. מסדרת את כל החומר ומתרגלת תרגילים רלוונטיים לשיעורי הבית ולמבחן.\nשעורי הבית: \nיש רפרנסים להכל. רמת קושי סבירה לחלוטין.\nהמבחן: \nמבחנים דומים לשאלות הפתוחות.\nהשורה התחתונה: \nקורס סבבה לגמרי, מתחיל קל מאוד ולקראת הסוף הכל נבנה על הדברים שלפני כן אז ללמוד טוב את הבסיס.", "timestamp": 1686753673560}, {"author": "~", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nדניאלה מרצה נהדרת, מסבירה את החומר לעומק ונותנת המון דוגמאות ברמה של המבחן (במיוחד בשיעורים האחרונים לסמסטר). אם לא מסתדר לכם להגיע אליה פרונטלית ההקלטות שלה מעולות ובגדול מכסות מילה במילה את מה שהיא מעבירה פרונטלית רק כמעט בלי שאלות של סטודנטים כי זה צולם בקורונה ואנשים בבירור לא רצו לשאול בזום.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nגרשון אחלה מתרגל אבל הוא רץ עם החומר. אם אתם מצליחים להבין את החומר מההרצאות אז תצליחו לעקוב אחרי הקצב שלו אבל אם משהו לא יושב לכם עד הסוף מאוד קל לאבד אותו. אישית הרגשתי שעזר לי מאוד לעבור על הרשימות מההרצאה לפני התרגול ואם הספקתי אז העדפתי להקשיב מחדש לפחות לחלק מההקלטות לפני התרגול כדי שהחומר ישב לי ממש טוב ואצליח לעקוב אחרי מה שהוא עושה על הלוח.\n\nשעורי הבית: \nתרגילי הבית היו ממש בסדר, בגדול ברמה של השאלות שעברו בתרגולים ובהרצאות ומאוד דומים לרמה של המבחן. הוובוורקים היו פחות כיפים אבל נראה לי שזה בעיקר כי אני פחות אוהבת וובוורק ותסכל אותי מאוד כשלא הבנתי באיזה שלב בפיתרון שלי היתה הטעות\n\nהמבחן: \nהיה סופר הוגן וברמה של התרגילים של דניאלה בכיתה. לא היה קל במיוחד אבל גם ניכר שלא ניסו להכשיל למרות שזה קורס בסיס ומבוא.\n\nהשורה התחתונה: \nקורס סביר, לא מדהים ודי עמוס אבל גם לא היה מאוד מסובך ואחרי שמקשיבים לחומר כמה פעמים וגם עושים תרגילים הוא ממש שוקע ולקראת הסוף אפילו נשמע לי ממש הגיוני. בכל מקרה לי יודעת כמה יש לכם ברירה, זה קורס חובה אז מסתדרים", "timestamp": 1689569473102}, {"author": "איתן 67", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ד\"ר ח'ירייה מסרווה\nחוות דעת - הרצאות: ח'ירייה מעבירה את החומר בצורה נהירה וברורה. היא לא ממהרת מדי (אם כי בשיעור הראשון והשני בסמסטר מעט הרגשתי כי כן). היא זורקת בדיחות מדי פעם וכיף ללמוד איתה.\n\nשם המתרגל/ת: מר גרשון אברהם\nחוות דעת - תרגולים: גרשון מעביר את החומר באופן ברור ונותן טיפים טובים לפתרון שאלות. הוא טיפה ממהר ואפשר לאבד אותו אם לא מאזינים לשנייה, אבל סך הכל הוא מתקדם בקצב טוב ומתרגל הרבה תרגילים מגוונים.\n\nשעורי הבית: לא קשים במיוחד וקיימת חוברת תשובות רשמית כדי להשוות פתרונות סופיים.\n\nהמבחן: לא יודע, לא עשיתי עדיין. אערוך את זה אם אזכור.\n\nהשורה התחתונה: סך הכל נהניתי והחכמתי, וזה חומר שימושי באופן כללי במתמטיקה לאחר מכן.", "timestamp": 1710767077514}, {"author": "אלון ספיר", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ד\"ר עליזה מלק\nחוות דעת - הרצאות: כנראה שכל הדברים הטובים כבר נאמרו על עליזה, ובמקרה שלה- זה ממש לא אוברייטד: עליזה מסבירה בצורה הכי אינטואיטיבית שיש בלי לרוץ על החומר, עונה על כל שאלה שנשאלת בהרצאה ועל הדרך גם משלבת בדיחות במינון הנכון. מורגש שעליזה אוהבת להרצות ולא באה להרצאות כדי לסמן וי ותו לאו. גם בשעות הקבלה שלה היא עוזרת מכל הלב. רק בשעות הקבלה? גם בהרצאות עצמן היא עונה עד אחרונת השאלות, ונשארת אחרי כל הרצאה לענות על שאלות. מה שכן, העומס בהרצאות מאלץ לבוא ב7:30 כדי לתפוס מקום בסגו אפילו כשההרצאות מוקלטות, ואפילו במאייר צריך לבוא מוקדם כדי לתפוס מקום. אבל זה שווה את זה, וגם אם אתה יושב מאחורה עליזה דואגת שתראה מהלוח הכל.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת מתרגלת מושלמת לקורס מתמטי שצריך להטמיא בו מונחים חדשים ושיטות עבודה טכניות: היא מעבירה תרגול בקצב סבבה לגמרי- לא מהר מידי ולא לאט מידי, שזה מצרך נדיר בקרב מתרגלים למתמטיקה. היא מביאה לתרגולים שאלות ברמה מאוד גבוהה, לרבות ממבחנים ושיעורי בית כתובים, ובונה אינטואיציה בצורה ממש נוחה. יש קו ישיר בין תרגול לתרגול, למרות שזה לא חייב להיות ככה. על הדרך, אפרת גם כן משלבת בדיחות והומור בתרגולים. בשעות הקבלה שלה היא עוזרת מכל הלב ממש.\n\nשעורי הבית: מצד אחד כן קורס עמוס בשיעורי בית- הן מטלות כתובות והן וובוורקים, ובניגוד לקורסים אחרים כאן העומס הוא עד סוף הסמסטר כי חייבים להגיש מטלות כתובות גם על נושאים מהחצי השני של הסמסטר, ויחד עם זאת, שיעורי הבית הם במידה הנכונה לקורס עם ידע מתמטי שנבנה מאפס שלב אחרי שלב, כשכל נושא קשור לזה שבא אחריו. חשוב לעשות את כל שיעורי הבית כדי לבוא מוכנים למבחן. בודקי שיעורי הבית הכתובים בקורס בודקים בצורה מאוד הוגנת. למותר לציין שזה מגן, אז שווה להשקיע גם מהשיקול הזה.\n\nהמבחן: עוד לא היה, אערוך בהמשך\n\nהשורה התחתונה: זה רק נשמע קורס מפחיד בחסות הפקולטה למתמטיקה. בפועל, זה קורס מאוד נחמד עם הסגל הכי נחמד ואנושי שיש בסמסטר הראשון בטכניון. געגועים לעליזה ואפרת.", "timestamp": 1712606545241}, {"author": "ניקיטה וליקודני", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אליזע מלק\nחוות דעת - הרצאות: כל הרצאה שלה קצת הצגה. אליזע מאוד הבעתית ומביאה וייב אימאי חזק. אם זאת, היא יודעת להיות על החומר ולהשלים כל מה שצריך ללמד בזמן, יודעת להחזיק את קשב הקהל. עונה על כל שאלה, אם יש זמן.\nהקצב של הרצאות הוא מעולה. לפעמים לא מספיקים להעתיק, בגלל כמות החומר, אבל עליזה תמיד תרחיב על הנקודות הלא מובנות.\n\nשם המתרגל/ת: אילה אביגדור\nחוות דעת - תרגולים: מתרגלת טובה וקשובה לסטודנטים. יודעת להגיש את הנושא בצורה ברורה. תמיד תוכל להסביר אם לא הבנת. המינוס היחיד הוא שהתרגול שלה היה בקומה 6 של אולמן, אז למי שמגיע ישר מההרצאה, כמעט תמיד, יהיה מקום רק מאחורה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713265734351}, {"author": "Margarita Birchanskiy", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עליזה מלק +חירייה מסראווה\nחוות דעת - הרצאות: עליזה מאוד נחמד ואימטראקטיבי אבל תמיד מפוצץ כי כולם באים אליה. חירייה נחמד ומסבירה בצורה טוב באותה מידה. עם זאת קרה כמה פעמים שאחש הסטודנטים שאל שאלה בערבית והיא התייחסה אליה בלי לתרגם או להסביר לשאר הכיתה. \n\nשם המתרגל/ת: איילה נטלי אביגדור\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה בצורה טובה, מעבירה את השיעור בנימה נעימה.\n\nשעורי הבית: ממש בסדר, הוובוורק טיפה מעיק אבל בסך הכל בסדר\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713536455916}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חירייה \nחוות דעת - הרצאות: שנה ראשונה שהיא מרצה (היתה מתרגלת) וחד משמעתית מרגישים בקטע הכי טוב שיכול להיות. המרצה הכי טובה שלימדה אותי הסמסטר! מביאה לשיעורים תרגילים בכל נושא ככה שמתרגלים ישר באותו רגע את החומר, מסודרת מאוד ויש לה שיטות ודרכי פיתרון מאוד ברורות. ממליץ\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: לא יודע לא הייתי (עד כדי כך חירייה טובה)\n\nשעורי הבית: וובוורק ופתוחים, שניהם אחלה לגמרי ולפתוחים יש רפרנסים אז בקטנה\n\nהמבחן: עוד לא היה \n\nהשורה התחתונה: הקורס שהכי עניין אותי הסמסטר, אחלה", "timestamp": 1714000061992}, {"author": "איתן 67", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ד\"ר ח'ירייה מסארווה\nחוות דעת - הרצאות:\nח'ירייה מעבירה את החומר בצורה נהירה וברורה. היא לא ממהרת מדי (אם כי בשיעור הראשון והשני בסמסטר מעט הרגשתי כי כן). היא זורקת בדיחות מדי פעם וכיף ללמוד איתה.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים:\nגרשון מעביר את החומר באופן ברור ונותן טיפים טובים לפתרון שאלות. הוא טיפה ממהר ואפשר לאבד אותו אם לא מאזינים לשנייה, אבל סך הכל הוא מתקדם בקצב טוב ומתרגל הרבה תרגילים מגוונים.\n\nשעורי הבית:\nשיעורי הבית יחסית קלים ויש פתרונות סופיים בחוברת התשובות. הם עוזרים לתרגל את החומר הנלמד.\n\nהמבחן:\nהוגן מאוד ויש היאמרו אפילו קל.\n\nהשורה התחתונה: קורס חביב ביותר.", "timestamp": 1714580628427}, {"author": "ח", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עליזה מלק \nחוות דעת - הרצאות: \nמרצה מעולה ומצחיקה- הבעיה ההיא שהשם שלה מושך הרבה סטודנטים (שרובם גם די חופרים) וזה גורם שיש הרבה רעש בהרצאות ואין הרבה מקום לשאול שאלות\nשם המתרגל/ת: אילה \nחוות דעת - תרגולים: \nבחיים שלי לא ראיתי מישהו שיכול לכתוב יותר מהר מאילה, אבל עדיין לא מרגישים כאילו היא עוברת על החומר מהר. בתרגולים אילה עברה על כל דוגמה אפשרית, ואם לא הקשבתם בתרגול אבל דאגתם לרשום את כל מה שהיא כתבה אתם תהיו הרבה יותר מבסדר.\nסך הכל אילה היא מתרגלת מצוינת שמסבירה את החומר בצורה טובה.\nשעורי הבית: \n\nהמבחן: \nפייר, כל שנה יש אותו קונספט\nהשורה התחתונה: \nקורס לא קשה עם מבחן אפילו קל אפשר להגיד, אבל עם חומר די משעמם. אלגברה ליניארית הוא נושא מאוד מעניין ויש הרבה מה ללמוד עליו, אבל הקורס אלגברה ליניארית מ׳ הוא קורס די טכני שלא דורש ככ הבנה תאורטית.\nתתרגלו מבחנים ויהיה בסדר.", "timestamp": 1714593793710}, {"author": "נטע", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה מלק!!\nחוות דעת - הרצאות: לא יודעת אם יש עוד מה להוסיף. הראות מעניינות, עונה על השאלות שיהיו לך, עוד לפני שעלו לך בראש. בקצב הכי נורמלי מבין כולם ואין דבר כזה שהיא לא מספיקה את החומר. נשארת אחרי הרצאות לענות על *הכל*.\n\nשם המתרגל/ת: ראואן טרביה \nחוות דעת - תרגולים: בעיניי, מהממת. מתרגלת ברמה גבוהה, דואגת להביא תרגילים ברמה גבוהה מתחילת הסמסטר, שמפעילים את גלגלי המוח, שזה בדיוק מה שצריך להצלחה במבחן. הקצב מהיר! אני יודעת שזה מה שאני צריכה, אם אתם צריכים לאט לכו לאפרת.\n\nשעורי הבית: היו שיעורי בית על כל נושא, שנפתחו בהתאמה לקצב ההרצאות והתרגולים (אם במקרה ולא- מייל למתרגלת האחראית וטופל בלי בעיות). אני ממש הרגשתי שהם עוזרים לי להבנת החומר ומחדדים את ההבנה. בנוסף, לאורך כל השנה ממש פותרים שאלות ברמת המבחנים, ככה שאין הפתעה שבוע לפני המבחן כשפותחים מבחן לראשונה.\n\nהמבחן: כל המבחנים של דניאלה אותו דבר! תתרגלו מבחנים שלה, שזה כל המיליון שנה האחרונות ותהיו בסדר גמור. 2 שאלות פתוחות שהן טכניקה לחלוטין (מלבד סעיף אחד של הבנה, אבל גם זה די חוזר על עצמו) ברגע שמבינים את הקטע שהיא מחפשת, לא תהיה לכם בעיה. שאלות הוכח והפרך- מספיק תרגול ואין בעיה. שוב, כשמבינים את הקטע, אתם יכולים להגיע למבחן עם מאגר של דוגמאות בראש שלכם (רוב הפעמים אפילו הדוגמאות של להפריך חוזרות על עצמן)\n\nהשורה התחתונה: בעיניי, קורס הוגן לחלוטין. אם אתם טובים בטכניקה יש לכם 4.5 נ״ז מתנה. ומומלץ ממש לעשות את שיעורי הבית (לא לוקחים הרבה זמן מהשבוע).", "timestamp": 1715150514668}, {"author": "ו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: הרצאות מעניינות, עליזה חמודה ופשוט רוצה להסביר כמה שיותר ברור ובעניין. עונה על כל השאלות בכיף ואם מפספסים או לא מבינים יש את ההקלטות שלה בקמפוס IL\n\nשם המתרגל/ת: אילה\nחוות דעת - תרגולים: מאוד מאוד מהירה, תרגול איתה מרגיש כמו מרתון אבל שווה את זה כי היא מסבירה טוב ובכיף\n\nשעורי הבית: בעיקר עמוסים וחופרים יותר מקשים אבל שווה לעשות \n\nהמבחן: דניאלה המרצה האחראית כותבת מבחן מאוד מכשיל, יותר קשה מהשיעורי בית זה בטוח\n\nהשורה התחתונה: קורס נחמד לא קשה מדי אבל מבחן מכשיל", "timestamp": 1715179828059}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ח'ירייה\nחוות דעת - הרצאות: \nח'ירייה מעולה! קצב בינוני-מהיר ורואים שהיא הייתה מתרגלת כי ההרצאות שלה מלאות בתרגילים ודוגמאות שממש עוזרות להבין איך לגשת לתרגילים.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nהפסקתי לבוא אחרי שבועיים, התרגולים היו מאוד עמוסים אבל אני לא מבינה את ההתלהבות, הוא מאוד מאוד מהיר ואני לפחות לא ממש הצלחתי להבין תוך כדי מה הוא עשה, היה לי הרבה יותר מועיל ונוח פשוט לקרוא את התרגול שלו ממישהו שהיה שם או את התרגולים שלו מחשבונייה. אולי בהמשך הסמסטר זה השתפר אבל לא הרגשתי צורך לבדוק.\n\nשעורי הבית:\nהגיליונות הכתובים ממוחזרים מתוך חוברת כזאת של מבחני עבר, יש רפרנסים להכל ואני ממליצה לפתור אותם גם בעצמכם כי הם ברמה רלוונטית למבחן וטובים כדי לראות אם הבנתם את החומר.\nלפעמים יש בוובוורק תרגילים לא קשורים, קשים ומוזרים אבל זה נקודתי.\n\nהמבחן:\nמאוד דומה לשנים קודמות, עניין של תרגול. ככל שתחשפו ליותר מבחנים הציון שלכם יעלה, יש הרבה טכניקה ופשוט לזכור דוגמאות. לדעתי המבחן היה הוגן.\n\nהשורה התחתונה:\nאחלה קורס בשביל 4.5 נ\"ז ולפי מה ששמעתי גם המרצות האחרות טובות אז בכללי צוות מרצים טוב!", "timestamp": 1715290442245}, {"author": "כמובן שלא", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חירייה\nחוות דעת - הרצאות: \nחירייה מרצה ממש טובה. הייתה מתרגלת המון זמן, והשנה התחילה להרצות ומבחינתי הייתה כנראה המרצה הכי טובה שהייתה לי הסמסטר. תמיד דואגת אחרי חומר תאורטי להראות תרגילים בנושא או דברים ששואלים עליהם במבחן, היו הרצאות שזה ממש הייתה הרגשה של תרגול ולי הרגיש שהיא ידעה איך לשלב את זה בצורה מאוד מדויקת. עליזה ודניאלה גם מרצות מעולות אבל אם אתם מעדיפים ללמוד עם פחות אנשים וברמה לא פחות טובה אז חירייה זאת האופציה בשבילכם.\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nהמתרגל האולטימטיבי. תמיד מספיק לעבור על כל החומר (לא מעט פעמים סיימנו רבע שעה לפני סוף התרגול). מראה כמה שיותר תרגילים לדאוג רק לא לאבד אותו כי הוא רץ יחסית מהר על החומר\n\nהמבחן: \nהפואנטה של המבחנים של דניאלה פחות או יותר חוזרת על עצמה. היה מבחן קצת מעיק עם הרבה כתיבה אבל בסך הכל הוגן.\nהשורה התחתונה: \nהסגל אולי הכי טוב בטכניון. זה מקצוע טכני וכדאי להיות חדים עליו במהלך כל הסמסטר כי כל שבוע נבנה פחות או יותר על הקודם.", "timestamp": 1715291082820}, {"author": "אנונימית 3>", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: היו ממש סבבה, הרוב המוחלט היה ברור במהלך ההרצאה, חוץ מזה שדניאלה חמודה ממש היא מסבירה מושלם ונותנת את כל התיאוריה פלוס דוגמאות והוכחות לכל דבר והכל בקצב טוב לא ממש איטי אבל היא גם לא כזה מהירה. כותבת הרבה, הכל וממש מסודר. אתה מורגל לסגנון כתיבה שלה בהרצאות ובגלל שהיא המרצה האחראית, בתקופת מבחנים כשפותרים מבחנים קל להבין את הפתרון הרשמי שלה (כי דווקא בפתרונות מבחנים היא פחות כותבת בפירוט לפעמים), ואת הסגנון כתיבה. סהכ נהנתי ממש בהרצאות שלה, גם ממש מרגישים שהיא אוהבת ללמד. החיסרון היחיד זה שהיא הייתה חסרה חודש במהלך הסמסטר ככה שמי שהחליף אותה היה נאדר (מרצה בחדווא 1מ) שהוא היה ממש על הפנים בהשוואה לדניאלה (בקושי כתב, לא עשה כמעט דוגמאות בכלל וכל כמה דקות מאמצע שום מקום היה מוציא את הטלפון ובודק דברים איזה חצי דקה או פשוט בוהה בנו דקה בלי לעשות כלום. ממש מורגש כיאילו הוא שונא ללמד ולא רוצה להיות שם יותר מאיתנו. אם המרצה מתנהג ככה זה פשוט משדר מסר לא טוב לסטודנטים ולא גורם לנו לרצות להיות שם גם. בקיצור לא ממליצה). בתקופה הזאת עברתי לראות הקלטות שלה מתקופת הקורונה והן די אחד לאחד איך שהיא מלמדת בכיתה ככה שמתי שהיא חזרה וגם אני חזרתי לא הרגשתי שפיספסתי כלום.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: הוא מתרגל מצויין. הוא מלמד איך פותרים שאלות ישר ולעניין. הוא כן מהיר (הרבה יותר מדניאלה נגיד) אבל אני יכולה להעיד על עצמי שלגמרי אפשרי לעמוד בקצב שלו פלוס לכתוב הכל. אני הבנתי שאחרי התרגולים שלו כדי מאוד לעבור על החומר שכתבת במהלך התרגול ככה שאם לא הבנת עד הסוף משהו בגלל הקצב, כשעוברים על התרגול שוב אתה מבין. לשיעורי בית גם נעזרים במה שכותבים בתרגול ובגלל שגרשון מהיר הוא מספיק לעשות מגוון של דוגמאות שבסופו של דבר עוזר לך במגוון הרחב של תרגילים שנותנים בגיליון או בוובוורק (לדעתי עדיף מתרגל שמספיק יותר בקצב מהיר מאשר פחות בקצב רגיל).\n\nשעורי הבית: הגיליונות הם סבבה, הכל שאלות ממבחני עבר (ממש עבר אבל) יש רפרנסים עליהם וכן עוזרים להבנת החומר. בתכלס לא לוקחים הרבה זמן בכלל, רק יכול להיות 2 או 3 נושאים במהלך הסמסטר שיכולים להיות יותר קשים להבנה לדעתי לקחת יותר זמן אבל חוץ מזה הכל בסדר. הוובוורקים קצת מעצבנים, בהתחלה הם קלים אבל בשליש האחרון של הסמסטר יכולים להיות יותר קשים ולדרוש ממך יותר זמן סתם. בכל זאת כדי לעשות גם כי קל לקבל בהם 100 למגן וגם כי בסוף הם עוברים על הבסיס מהקל לקשה של כל נושא ככה שאם יש נושא שלא מובן לכם בכלל שאלות ברמת מבחן כמו הגיליונות, אפשר לחזור לוובורק ולפתור אותו והוא הולך איתכם בשאלות קלות קודם ורק בסוף קשות ולא ישר קשות.\n\nהמבחן: לא הייתה שום הפתעה במבחן (אולי חוץ מסעיף אחד), המבחנים של דניאלה על אותו עיקרון כולם, ככל שתפתרו יותר תתרגלו לפתור את השאלות מתוך שינה גם מרוב שהכל בתכלס אותו דבר. \n\nהשורה התחתונה: 4.5 נקז מתנה לדעתי, קורס טכני שאם אתה לומד במהלך הסמסטר ופותר כמה מבחנים בתקופת מבחנים יכול להעלות את הממוצע פלאים. בתקופת מבחנים נעזרתי גם בסרטונים של עליזה מלק ביוטיוב בתתי נושאים קטנים שהרגשתי שאני צריכה חיזוק בהם, אז גם זה מומלץ.", "timestamp": 1715874482362}, {"author": "change2000", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה אבידן ונאדר אגא\nחוות דעת - הרצאות: בתחילת הסמסטר הייתי במילואים לכן צפיתי בהקלטות שלה הן פשוט אחד לאחד כמו בשיעור זה מדהים אפילו הבדיחות.. בכל מקרה מרצה מעולה! במיוחד בשנה הראשונה היא מנחיתה אותך לאט בטכניון וזה ממש נחמד. היא נותנת לכל נושא המון דוגמאות עד שמבינים. \nבאמצע הסמסטר היא נאלצה לעבור ניתוח לכן נאדר המרצה מחדוא החליף אותה. נאדר היה מדהים. אלגברה זה התחום שלו ובתור אחד שלמד איתו גם חדוא זה היה מאוד מורגש. הוא היה יותר שמח ללמד וראו שהוא אוהב את החומר שהוא מלמד. נאדר הוא מרצה מאוד תיאורתי עם פחות דוגמאות לכן לא מתאים לכולם והכיתה הצטמצמה מאוד (עוד פלוס). לאחר 3 שבועות דניאלה חזרה והיא זאת שכתבה את המבחן בסוף.\n\nשם המתרגל/ת: איילה\nחוות דעת - תרגולים: מלכהה!!! משלימה את דניאלה כמו כפפה ליד. לכו אליה! מה שכן היא כותבת המון ומהר לא ברור איך אין לה התכווצויות ביד. צריך לסנן 60 אחוז ממה שהיא כותבת כי בעצם כותבת את כל מה שהיא אומרת שחלק גדול מזה פשוט מובן מאליו ואין צורך לכתוב אותו.\n\nשעורי הבית: הכתובים קלים מאוד הוובוורק קצת מעצבן אבל פתיר קשה לא לקבל 100\n\nהמבחן: דניאלה לא מקורית במיוחד כל המבחנים שלה מאוד דומים אבל היה מאתגר ומעט מכשיל בעיניי\n\nהשורה התחתונה: קורס מעניין וקל יחסית", "timestamp": 1715895382388}, {"author": "חן השילוני", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ח'ירייה\nחוות דעת - הרצאות: ח'ירייה מעבירה את כל המידע ש\"צריך\" לדעת בצורה דיי הגיונית, אבל היא לא ממש מצליחה לעזור לבנות אינטואציה לחומר... סה\"כ מרצה לא רעה, פשוט צריך לתרגל בבית יותר אם הולכים אליה\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים:  מתרגל מדהים, כל פעם שהתקשתי בהבנה של משהו בהרצאה הוא פשוט סידר לי את החומר בראש. מכין אותך לבול מה שיהיה במבחן, כל שאלה בתרגול חשובה ויכולה להופיע במבחן אפילו. אבל התרגולים שלו דיי מפוצצים, אז אל תצפו ליחס מידי לכל שאלה שיש לכם. \n\nשעורי הבית: שב כל שבוע, גם באינטרנט וגם להגיש בכתב. למרות זאת, כל אחד בפני עצמו דיי קליל, והם באמת עוזרים לתרגל את החומר \n\nהמבחן: מאוד הוגן, לדניאלה (מרצה אחראית) יש מבנה מאוד ספציפי שחוזר על עצמו בכל מבחן שהיא עושה בקרוס הזה, והיא מרצה אחראית בו כבר איזה 10 שנים. כל עוד עוברים מספיק על מבחני עבר המבחן מאוד אפשרי\n\nהשורה התחתונה: קורס חובה דיי עמוס, אבל הסגל ממש יודעים ללמד כמו שצריך ואם מצליחים להבין את החומר לעומק, אין בעיה בלעבור אותו", "timestamp": 1715959184978}, {"author": "עילום שם מרוב בושה", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דניאלה / חירייה\nחוות דעת - הרצאות: הייתי אצל דניאלה עד שהיה לה ניתוח, החליף אותה נאדר, נאדר היה נוראי, אצל עליזה היה מפוצץ תמיד, אז נשאר חירייה. דניאלה הייתה ממש טובה, חירייה פחות לטעמי\n\nשם המתרגל/ת: גרשון הקינג\nחוות דעת - תרגולים: מלך, מדוייק, מהיר, אין הרבה מה להגיד\n\nשעורי הבית: חובה ובאסה, הרוב מיותר לקראת המבחן, רק ב3-4-5 שיעורים האחרונים באמת לומדים מה שחשוב\n\nהמבחן: קליל\n\nהשורה התחתונה: חובה ובאסה, אבל מה לעשות", "timestamp": 1716297526480}, {"author": "ערפילית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מסארוה ח'ירייה\nחוות דעת - הרצאות: מאוד מקצועית ונעימה. דואגת לדוגמאות מעשיות ומתקדמת בקצב מהיר ומספק.\n\nשם המתרגל/ת: אבירם אפרת\nחוות דעת - תרגולים: תרגולים הם כן חשובים, כדי להעביר את הטכניקה לדעתי. בעיקר החל מהשלישי בערך. אפרת היא down to earth כזו ומוכנה לענות על שאלות. \n\nשעורי הבית: בכתב מאוד חביבים ואף קלים. בווברק (הממוחשבים) בדרך כלל הגיליון ארוך. \n\nהמבחן: ללא מחשבון (המספרים הם פשוטים). שאלות פתוחות וסגורות. להקפיד לנמק כל צעד.\n\nהשורה התחתונה: קורס ידידותי למשתמש.", "timestamp": 1716392226746}, {"author": "אאאאלף", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nעליזה פשוט אדירה. רואים שהמתמטיקה וההוראה זורמות לה בדם. היא בקצב די גבוה, אבל חוזרת ומבהירה דברים אם מבקשים ממנה. ממש עמוס בהרצאות שלה אבל בעיניי זה היה שווה את זה, כי היא באמת מלמדת ממש ממש טוב. בתחילת הסמסטר לא היה מקום בהרצאות שלה בכלל עד שעברנו לאולם גדול יותר, אז אם אתם אוהבים לשבת מקדימה (או בכמה מקרים, לשבת באופן כללי) מומלץ להגיע לפחות להרצאות הראשונות מוקדם.\n\nשם המתרגל/ת: ילנה פוגרבניאק\nחוות דעת - תרגולים: \nאיטית מעט. רוב הזמן היא הייתה אחלה, אבל מדי פעם היא הייתה עושה טעות ולא תמיד עולה עליה. ברוב התרגולים היינו עושים תרגיל או שניים מתוך שיעורי הבית, מה שחסך עבודה.\n\nשעורי הבית: \nהוובוורק היה לא פשוט לעתים, אבל בסך הכול סבבה. שיעורי הבית הכתובים הלכו ונהיו קלים יותר ככל שהסמסטר התקדם, לרוב היה אפשר לסיים אותם תוך שעתיים במקסימום.\n\nהמבחן: \nהוגן. המבנה הכללי די נשמר משנה לשנה, ואפשר לתרגל אותו לפני. הפתרונות כתובים ביד, אז לפעמים קשה להבין עד הסוף איך פתרו.\n\nהשורה התחתונה: \nאחלה קורס. לנו היו מרצות מעולות (עליזה, דניאלה וחייריה) ובאופן כללי הרגיש שזה קורס שבנוי טוב ומועבר טוב", "timestamp": 1716404396177}, {"author": "סטודנט באוויר", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: \nההרצאות של דניאלה הן טובות, היא קודם כל מסבירה הרבה ואז נותנת זמן לשאלות. בהתחלה הרגשתי שאני נאבד אבל לאט לאט הבנתי את החומר. \nהפסדתי המון ימים בתחילת הסמסטר בגלל מילואים ודניאלה עזרה לי להשלים את החומר וחזרה על החומר כל פעם שבקשתי - מאוד מתחשבת במילואנימיקים \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nגרשון פנתר, מסביר בצורה פשוטה מאוד, מאוד לא ממליץ להפסיד את התרגולים איתו כי הוא ממש מביא את הכל לתלכס והוא נעצר על כל תרגיל עד שאין שאלות. השעות קבלה שלו עמוסות.\n\nשעורי הבית: \nשיעורי הבית מאוד מאוד הוגנים וגם מכינים למבחן \nהמבחן: \nהמבחן הוגן, פחדתי ממנו מאוד כי הייתי במילואים והוא שומר על מבנה של מבחני עבר\nהשורה התחתונה:", "timestamp": 1716496469072}, {"author": "אבי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חירייה  \nחוות דעת - הרצאות: מושלמת! מרצה חדשה יחסית אחרי שהייתה מתרגלת, קצב קצת מהיר אבל מבחינתי היה מושלם. היא גם מריצה תרגילים בכיתה במהלך ההרצאות אז לא היה לי צורך אפילו בתרגולים  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלילים ואפשר להגיש אותם במהירות\n\nהמבחן: הוגן\n\nהשורה התחתונה: להשקיע מהתחלה לעשות שב ובעיקר לתרגל מלא מבחנים וילך טוב", "timestamp": 1716630522882}, {"author": "Shahar", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה אבידן (ונאדר לחלק מהזמן) \nחוות דעת - הרצאות: \nדניאלה מזעזעת. קודם כל היא מבולגנת על הלוח, הכתב שלה לא תמיד ברור, והיא רעה אל כל מי שלא יושב בשורה ראשונה או שנייה (והיא גם אמרה את זה בעצמה). \nנאדר החליף אותה לחלק מהסמסטר והיה ממש טוב איתו, גם היה מצחיק וגם התקדמנו הרבה בחומר. \n*אציין שההקלטות של דניאלה כן טובות כי שם היא מסבירה ברור ואין לה הזדמנות להיות בריונית לאף אחד אז זה כן מומלץ. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: ספציפית באלגברה היה לי בסדר איתו, הוא רץ ממש בחומר אבל יש את כל הסיכומים שלו באתר חשבונייה, אז כתבתי רק חלק מהזמן ובשאר יכולתי להקשיב והוא באמת ברור והגיוני.\n\nשעורי הבית: באמת בסדר\n\nהמבחן: היה הוגן, אבל ממש חיפשו להוריד בניקוד על הכל אז צריך לשים לב\n\nהשורה התחתונה:", "timestamp": 1716829426659}, {"author": "Tom", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: אין על עליזה! מה שכן ההרצאות מפוצצות עד אפס מקום. בעיניי זה כן שווה את זה כי היא מעבירה את החומר מעולה\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון. כדאי לעבוד עם הקבצים שהוא משתמש בהם מהאתר שלו (חשבוניה) כדי לא לנסות לעמוד בקצת הכתיבה שלו. מהיר אבל יסודי ומקיף\n\nשעורי הבית: שאלות ממבחנים קודמים שזה מעולה. לא גוזל יותר מידי זמן ובדיוק מספיק בשביל לתרגל ולהבין יותר טוב\n\nהמבחן: כל שנה המבחן אותו דבר בדיוק אז פשוט לתרגל מספיק מבחנים ואתם מסודרים. מה שכן להקפיד לנמק כל פיפס\n\nהשורה התחתונה: הקורס הכי טוב שהיה לי בסמסטר", "timestamp": 1716834285089}, {"author": "גוד לאק צ'ארלי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גב' דניאלה אבידן\nחוות דעת - הרצאות: מסבירה את החומר בצורה מועילה. הכיתה בתחילת הסיסמטר הולכת להיות עמוסה, אך אל דאגה- במודל יש הקלטות של דניאלה מימי הקורונה, כך שכל החומר מועבר באיכות די טובה חוץ מזה שההרצאות הפרונטליות חדות ערכיות עם ההקלטות, אפילו אותן הבדיחות. \n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים: גרשון מעולה ומבהיר כל דבר שלא ישב טוב בראש. טיפה רץ בחומר אבל זה תרגול בליניארית אז בהצלחה למצוא מישהו שלא.\n\nשעורי הבית: סבילים. במקרה הצורך תעזרו ברפרנסים. \n\nהמבחן: אותו מבנה כל שנה. לפתור מבחנים ישנים. לפתור מבחנים ישנים. לפתור מבחנים ישנים!!! אין סיבה לא לעבור בהצלחה וזה גם 4.5 אז בכלל. \n\nהשורה התחתונה: אל תזניחו את הקורס יותר מידי ויש לכם את זה.", "timestamp": 1716928188665}, {"author": "hamode", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: עושה את כל מה שביכולתה כדי שנבין את החומר אישה מקסימה ודואגת ממליץ !\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אגדההההה , לכל מי שרוצה לראות כמה שיותר תרגילים גרשון רץ בחומר ממליץ לחברה שלומדים בבית ובאים מוכנים .\n\nשעורי הבית: לא עמוס\n\nהמבחן: סבבה ובגלל שהוא סבבה הורידו נקודות על ימין ושמאל ולא בצדק ולפני שנערער דניאלה שלחה מייל כדי להפחיד אותנו שאם נערער יש מצב שתוריד נקודות \n\nהשורה התחתונה:", "timestamp": 1717269457255}, {"author": "בני", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חירייה\nחוות דעת - הרצאות: \nאחלה סה\"כ\n\n\nשעורי הבית: הפתוחים נחמדים, יש רפרנס להכל\nהוובוורק יכול להיות קצת מסרטן. \n\nהמבחן: \nעמוס יחסית כי שינו את המבנה שלו \"לטובתנו\", \nהפתיע אותי במועד א', במועד ב' באתי מוכן יותר אליו והפצצתי.\nאל תבזבזו זמן במבחן הזה, כל דקה חשובה.\n\nהשורה התחתונה: \nקורס נחמד, וובוורק מעצבן", "timestamp": 1718765115282}]}