{"posts": [{"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nמרצה מצוין, מסביר את החומר בצורה מעניינת, גם אם לעתים הוא נוטה להיות מאוד אבסטרקטי. ספר הקורס עוזר להשלים חומר שלא הובן כמו שצריך.\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nהמרצה הכי טוב שהיה לי הסמסטר, אנרגטי ומסודר, עונה לשאלות ומשקיע בתלמידים. מעלה רשימות טובות של התרגולים שלו.\nשעורי הבית: \n12 גיליונות מתוכם 10 להגשה.\nלי לפחות הם לקחו בערך 6 שעות בממוצע לגיליון, אחלה דרך לוודא שאתם מבינים את החומר אז חשוב לעשות אותם כמו שצריך אפילו שהציון הוא רק על סמך ההגשה ולא לפי הנכונות של התשובות (שזה מעולה, הסגל רוצה שנפתור בעצמנו בשביל לדעת ולא נעתיק סתם בשביל לקבל ציון גבוה). לפעמים יש שאלות קשות במיוחד, ממליץ לא לשבור עליהן את הראש יותר משעה שעתיים ולהיעזר בחברים.\nהמבחן: \nשונה ממבחני העבר בגלל שזאת השנה הראשונה שהקורס עובר במתכונת הזאת. המבחן היה מורכב כמעט כולו מציטוט של הגדרות ומשפטים ומחזרה על הוכחות שעשינו בהרצאות, בתרגולים ובשיעורי הבית. בסך הכל היה הוגן למי שהתמקד בדברים הנכונים בלמידה (הסגל די הדגיש שככה המבחן יראה וגם פרסם מבחן לדוגמא).\nהשורה התחתונה: \nקורס מעניין, מתמקד מאוד בתאוריה ופחות בפרקטיקה, אם אתם לומדים אותו עם אורי וגלעד זכיתם.", "timestamp": 1644342118691}, {"author": "סטודנט למתמח", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: אורי מאוד משקיע ועושה המון מעבר. ההרצאות שלו היו בסדר בסך הכל אבל הוא מעביר את החומר בצורה מאוד מאוד אבסטרקטית ולא מביא מספיק דוגמאות. שולח המון לקרוא את הרשימות שלו כדי להשלים חומר שלא הספיק/כדי לבוא מוכן להרצאה הבאה.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: פשוט מדהים, מעביר את החומר בצורה מעולה ודואג לערב את הכיתה תוך כדי על מנת לשמור על הערנות, עושה המון מעבר למה שדרוש ממנו ומעלה גם את הרשימות שלו למודל כדי שתוכל ללמוד מהם. באמת אם הוא מתרגל זכיתם.\n\nשעורי הבית: קשים, יש גיליון כל שבוע וזה לוקח זמן אבל חשוב מאוד מאוד לעשות אותם על מנת להפנים את החומר.\n\nהמבחן: כרגע עשיתי רק אחד, היה לא פשוט בכלל. בגדול אם תעברו על הרשימות של אורי מספיק לפני אתם תצליחו ואם לא אז לא\n\nהשורה התחתונה: קורס חובה אז אתם תקחו אותו לא משנה מה, אבל אם גלעד המתרגל אתם חייבים ללכת אליו", "timestamp": 1644432883680}, {"author": ";", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nאכפת לו מהסטודנטים ומשקיע ברשימות שלו, אבל מלמד באופן מאוד תיאורטי, לפעמים לא שם לב לכך שאף אחד לא עוקב אחרי מה שהוא עושה ומניח שמה שברור לו מאליו גם ברור לכולם. שולח המון פעמים לרשימות עבור דברים שאין לו כוח להסביר וכך יוצא שלומדים הרבה יותר חומר והמון באופן עצמי ממה שבפועל לומדים בהרצאות.\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nמתרגל מדהים, אכפת לו מאוד מהסטודנטים מביא שאלות ברמה טובה תוך כדי הסמסטר וכך משתדל שתמיד נשמור על רמה גבוהה, מסביר על המון שיטות לפתרון שאלות ואיך לזכור דברים, בגדול אם אפשר אז ללכת אליו.\nשעורי הבית: \nיש 12 גיליונות, לפעמים יש שאלות קומבינטוריות פתאום שחייב לחשוב מחוץ לקופסה עבורן אבל רוב השאלות טכניות/תאורטיות.\nחשוב מאוד לעשות את כל השיעורי בית להבנת החומר.\nהמבחן: \nאני אישית מאוד לא אהבתי את איך שהמבחן היה מסודר, התבסס המון על הרשימות שלו וכמה שאלות שהיו עם טריקים כלשהם שאם לא פתרת את השאלה לפני המבחן ועלית על השיטה אז אתה יכול לשבור את הראש במבחן ועדיין לא להצליח.\nהרמה של המבחן גבוהה הרבה יותר מכל מבחן שהיה במידה ואתה לא מכיר את הטריק הספציפי שהוא רוצה, אפילו במבחן לדוגמה שהוא העלה לפני המבחן (כי כמעט כל המבחני עבר לא רלוונטיים אם לומדים איתו) היה משמעותית יותר קל מהמבחן עצמו.\nבגדול למי שלא הכיר את הטריקים הספציפיים של השאלה אז יכול ליפול בגדול.\nהשורה התחתונה: \nקורס לא קל, אורי הופך אותו לעוד יותר קשה ובתור בוחן הוא בכלל לא טוב לדעתי כי זה המבחן לא בהכרח מעיד על הבנה אלא על שינון של מה שהוא רוצה ספציפית.\nגלעד אחלה מתרגל אם יש לכם את האופציה.", "timestamp": 1644532194747}, {"author": "אלגברה", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \nלא מומלץ בכלל, אם יש מרצה אחר כדאי ללכת אליו, חושב שכולם מבינים את החומר כמוהו ושולח להשלים מלא חומר מהרשימות שלו, מה שלוקח מלא זמן להשלים וללמוד לבד.\nבנוסף , מעביר את החומר בצורה מאוד תיאורטית, ובקושי מביא דוגמאות בכיתה בשביל להבין את הבסיס של החומר. ( מן הסתם צריך להשלים אחרכ מהרשימות שלו).\n\nשם המתרגל/ת: גלעד\nחוות דעת - תרגולים: \nהמתרגל הכי טוב שהיה לי מבין כל המקצועות, מתרגל מדהים, מאוד אכפתי ועוזר , ועושה המון מעבר.\n\nשעורי הבית: \n12 גליונות שכדאי לעשות את כולם, עוזרים להבנת החומר .\n\nהמבחן: \nממש לא פייר, הייתה אמורה להיות שאלה מהשיעורי הבית, ואורי פשוט החליט לקחת שאלה משם ולשנות אותה. \nציפה שנזכור את כל הרשימות שלו בע\"פ ( 217 עמודים) ופשוט לבוא לבחינה ולכתוב לפי שינון.\nלא באמת משקף איזושהי הבנה.\nפשוט כתבתי את מה שאני זוכר מהרשימות שקראתי 10 פעמים\n\nהשורה התחתונה: \nקורס חובה סמסטר א , אם גלעד הוא מתרגל של הקורס ממולץ ללכת אליו, בנוסף מאוד ממליץ ללכת לשעות קבלה עם שאלות על הגיליונות או שאלות כלליות על החומר", "timestamp": 1644566554179}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: אורי מאוד אוהב את האבסטרקטיקה, הוא בא עם גישה של \"ללמד את האלגברה לינארית בצורה שלו\" ורואים את זה בכל צעד ובכל משפט - הוא חושב באיזה צורה ובאיזו דרך ללמד ולמה.\nכסדטודנט בשנה הראשונה לתואר קשה להכנס לראש שלו, אבל ברגע שהבנת אותו אז הלמידה היא באמת מעמיקה ורצינית.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מצוין, השלים את אורי בכל משפט ועזר מאוד לכל הסטודנטים. עשה מעל ומעבר.\n\nשעורי הבית: קשים ודורשים לא מעט זמן.\n\nהמבחן: קשה מאוד - המרצה רצה שנשנן את הרשימות שלו כמו תוכים.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1645391562928}, {"author": "shelly klimovitsky", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: חומר מעניין, ההרצאות הועברו באופן מאוד אבסטרקטי (הופך ליותר מעניין אבל יותר קשה)\nהקושי העיקרי מגיע מהעובדה שאורי חושב שכולם חיים בראש שלו וחושבים בול כמוהו. אם לא הבנת - בהצלחה\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מגיע מוכן, עם אהבה למקצוע ומנסה להשרות אותה בך. אכפת לו, ועושה סדר אחרי אורי.\n\nשעורי הבית: ברמה טובה אם טובים בחומר.\n\nהמבחן: קשה להחריד. כל מי שלא בקיא ב100% מהחומר - נכשל או קרוב לכך. מומלץ לשנן בעל פה את הרשימות של אורי.\n\nהשורה התחתונה: לפי אורי סטודנטים למתמטיקה הם חלשים יותר. נראה שהוא יעשה הכל כדי להוכיח זאת על אף שזה פשוט שקר. מומלץ לברוח ממנו.\n\nגלעד מתרגל מדהים ומילים לא יסבירו את הצורות בהן הוא הפך את הקורס לסביר ביחס לזוועה שאורי הפך אותו.", "timestamp": 1645455175669}, {"author": "-", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nמאוד באוויר, אבסטרקטיות, אבל כן מאוד משקיע, מסביר כמה שצריך, מעלה רשימות שכדאי לעבור עליהן לפני ההרצאה וללמוד מהן למבחנים. אם משהו דמיוני מידי, ממליצה להכנס ל3blue1brown וזה נותן הרגשה מאוד מוחשית ועוזר לדמיין להבין ולפתח אינטואיציה.\nתתארגנו על קפה או ריטלין לפני הרצאה כי הכל מאוד מסובך אבל מעניין. \n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nממש מסודר, אבל גם ממש מהיר. מתעקש שיבינו. מעלה גם רשימות וגם מומלץ אחרי תרגול לפתור לבד ולהשוות עם פתרון פורמלי ומלא.\n\nשעורי הבית: \nגליונות מהשטן אחת לשבוע. לקחו לי חיים מהשנים.\n\nהמבחן: \nקורס חדש אז לא ברור לגמרי אבל המבחן שואתי. ארוך ומלא סעיפים מה שגורם שלא יהיה זמן באמת, בדיקה מאוד נוקשה. \nממליצה לתרגל כתיבה פורמלית טובה כבר מהיום הראשון ובגליונות.\n\nהשורה התחתונה: \nקורס חובה אין הרבה ברירה. בהצלחה. רק לעבור ולא לחזור גם בעד שלום.", "timestamp": 1645470013091}, {"author": "אפסי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: החומר בהרצאות היה אבסטרקטי מאוד, אפשר להבין את ההרצאות רק אם עוברים על החומר שלו במודל מלפני.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: כיף בתרגולים שלו, הוא מעביר את החומר בצורה מאוד מעניינת ונותן כלים פרקטיים שחסרים מאוד בהרצאות \n\nשעורי הבית: \nקשים. \nהמבחן: \n\nהשורה התחתונה: החומר מעניין, המבחן הוגן וצריך להשקיע הרבה מאוד זמן בשיעורים ובתרגולים. ושווה להשקיע שעה לפני כל הרצאה על מעבר על הספר קורס שבמודל.", "timestamp": 1645576749520}, {"author": "i++", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nלברוח מהבן אדם הזה כמה שניתן, בוחן נוראי, מנסה להוכיח כל הזמן שרק הוא צודק וכל שאר המרצים והסטודנטים טועים, לאחר שביקשנו ממנו פקטור על ממוצע באזור 55 במבחן ובדיקה מאוד נוקשית הוא זרק את זה עלינו בזלזול וטען שאנחנו לא מספיק טובים, למרות שבקורס נמצאים המסלולים עם הסכמים מהגבוהים בטכניון (רוטשילד, פיזיקה מדמח, מתמטיקה מדמח\\מדמח מתמטיקה וכולי), משמע הטענה שלו חסרת כל בסיס מציאותי.\nאם ניתן לבחור אם להיות איתו בקורס כלשהו אז הייתי בורח כמו מאש.\nנקודת אור אחת בו שכן חשוב לציין זה שהוא באמת ובתמים חושב שזו הדרך והוא לא מנסה לעשות את זה בכוונה או משהו, משקיע ברשימות שלו (למרות שהן לא מובנות בעליל) ופשוט צריך שמישהו ייפקח לו את העיניים כדי שיבין שזו לא הדרך לבחון וללמד את החומר.\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \n מתרגל תותח, אכפת לו מאוד מהסטודנטים ומלמד בשיטות מאוד נגישות את החומר האבסטרקטי של אורי.\nשעורי הבית: \nלא פשוטים אבל ניתן לעשות אותם בהשקעה של מספר שעות טובות, לקראת האחרונים אפילו יותר.\nהמבחן: \nלא הוגן בעליל, אם אתה לא יודע את הרשימות שלו (ורק אותן כי אין באמת מבחנים לתרגל) כמו שלומדים למבחן בהיסטוריה אז יהיה לך מאוד קשה.\nהשורה התחתונה: \nאם הקורס עם אורי לחכות סמסטר.", "timestamp": 1645620459303}, {"author": "Nobody", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה:אוריאל שפירא \nחוות דעת - הרצאות: \nמצד אחד, הרצאות היו ברמה גבוהה ומאד מעניינות, מרגיש כאילו מתחו לי את המוח בכל הרצאה, ובאמת הצלחנו להגיע להבנה מעמיקה של החומר.\nמצד שני, ההרצאות לא קלות, חייב לעבור על החומר לפני ואחרי.\nבנוגע למרצה, רואים שאכפת לו מאד מהתלמידים ומהקורס ברמה המקצועית, אבל בסמסטר א זה נותן קצת שוק, והייתה צריכה להיות יותר הבנה של הצד של הסטודנטים.\n\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מדהים, אחד המתרגלים הטובים שיש!!ממליץ ללכת אליו בכל מחיר.\n\nשעורי הבית: היו חלק משמעותי גם בהבנה של החומר וגם במבחן.\nלא היה ככ באלנס ברמה שלהם, היו גליונות שהיו די פשוטים והיו גליונות שלקחו לי את הסופש.\n\nהמבחן: במועד א' היה דגש (לדעתי הרבה יותר מדי) על הרשימות של המרצה, ולא על הבנה של החומר.את כל השאלות ראינו בצורה כזאת או אחרת במשך הסמסטר ולכן מי שלמד מהרשימות קיבל פור גם אם הוא לא בהכרח הבין את החומר כמו שצריך.הממוצע היה ברצפה בגלל דגשים של כתיבה וניסוח.\nמועד ב' לדעתי היה יותר הוגן.\n\nהשורה התחתונה: \nאחלה קורס, מעניין מאד, והסדר של הלימוד נתן הבנה הרבה יותר טובה של החומר מאשר בקורס המקביל א\"מ(לפחות ככה זה היה נראה).", "timestamp": 1646654595066}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: מרצה טוב אבל מדבר בשפה מאוד מתמטית ולא נותן הרבה דוגמאות מספריות אז אם זו פעם ראשונה שנתקלים במושגים קצת קשה לעקוב. יש ספר קורס בהתהוות שמכיל את כל החומר, מומלץ לקרוא לפני השיעור. עם זאת, מאוד חשוב לו שהסטודנטים יצליחו, בין היתר מאפשר לשלוח לו תרגילים לבדיקה ומפרסם סרטון בדיקה של התרגיל.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מתרגל מצויין. מלמד את החומר בצורה ברורה ומובנת, נותן תרגילים טובים ועונה על שאלות במייל מאוד מהר ובפירוט.\n\nשעורי הבית: מאתגרים אך בסדר.\n\nהמבחן: המבחן הוגן אך הבדיקה קצת מחמירה\n\nהשורה התחתונה: קורס טוב ומעניין, גרסה יותר תאורטית של הקורס המקורי, פחות נוגעים במטריצות, לא למדנו דטרמיננטה כמעט בכלל.\nאם כבר נתקלתם במושגים לפני יהיה לכם מעניין, אם לא מומלץ להתכונן טוב לשיעורים.", "timestamp": 1646774605481}, {"author": "Yaniv Slor Futterman", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי שפירא\nחוות דעת - הרצאות: \nאורי בסך הכל אחלה בחור ומאוד חכם, רואים שמבין את החומר. אבל הוא מלמד בצורה מאוד מבלבלת ואבסטרקטית. לא נותן דוגמאות קונקרטיות. אצלנו הוא עבד בצמוד לספר שהוא כתב. הספר הוא המפתח לקורס, אורי מת עליו. צריך לקרוא בו לפני כל שיעור, ולקראת המבחן מאוד מומלץ לשנן כל, אבל באמת כל הוכחה שכתובה שם. כן זה מבאס לשנן במקום לתרגל, וכן זה מבאס לשנן 217 עמודים של PDF, אבל זה שווה את זה ורק ככה אפשר להצליח במבחן הקשה שלו.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nגלעד המתרגל הכי טוב שהיה לי בכל קורס בכל הסמסטר. בחור פשוט נפלא ומורה מציון. מוריד את אורי לקרקע ומציל אותך ממנו. לא יודע מה הייתי עושה בלי גלעד, מאוד מומלץ בעיקר למי שמתקשה בקורס.\n\nשעורי הבית: \nיחסית קשים אבל טובים. זה תרגול טוב של החומר. בקורס הזה התרגילים והמבחנים מאוד הוכחתיים. זה לא כמו לינארית של מהנדסים, זה יותר דומה לאינפי. \n\nהמבחן: \nקשה מאוד. חובה לשנן את הספר לפני המבחן. אצלנו גם היו תרגילים משיעורי הבית וגם מהתרגול. הדרך הכי טובה ללמוד היא לא לנסות לפתור מבחנים משנים קודמות (גם אין כמעט מבחנים של אורי) אלא פשוט לשנן לשנן לשנן. לשנן את הספר, לשנן את כל הגליונות החל מהחצי השני של הקורס, ולשנן את התרגולים ולעשות זאת בסדר הזה: קודם ספר, אז גליונות ואז תרגולים.\n\nהשורה התחתונה: \nכן קורס מעניין ופותח חשיבה. גם מבינים לעומק לינראית ומה זה יותר טוב מהחברים בהנדסה, אבל קורס מאוד מאוד קשה וצריך לדעת איך ללמוד ספציפית עבור אורי.", "timestamp": 1647349692376}, {"author": "טל משיח", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: לא מומלץ בכלל\n\nשם המתרגל/ת: גלעד\nחוות דעת - תרגולים: מושלם, משלים את כל מה שאורי לא מספיק ונותן המון מעבר מומלץ מאוד\n\nשעורי הבית: קשים \n\nהמבחן: לא אפשרי\n\nהשורה התחתונה: קורס מזעזע עדיף לחכות סמסטר ולעשות אותו עם מרצה אחר", "timestamp": 1647430984972}, {"author": "Anonymous", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: אני אישית מאוד אהבתי את מיכאל כמרצה, למרות שלא כולם יסכימו. הוא מאוד מסודר, יש לו רשימות הרצאות שהוא מעלה למודל, יש שם את כל החומר שצריך בקורס, מאוד מסודר.\nהוא שולט מאוד בחומר, וזה באמת לא מובן מאליו. לפעמים הוא היה מסביר על דברים קצת מעבר כדי שנבין מאיפה הם מגיעים וזה מאוד עוזר. \n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: כנראה בין המתרגלים הכי טובים שיהיו לי בתואר. מסביר מעולה, מתרגל מעולה. \n\nשעורי הבית: מאוד עוזרים להבנה של החומר, מאוד. ממליץ לעשות את כולם.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: מאוד אהבתי את ההרכב של מיכאל + גלעד. הקורס מעוד מעניין, ומאוד חשוב להמשך התואר.", "timestamp": 1657448485789}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: מיכאל מאד משתדל להיות נגיש אבל הוא מעביר את החומר בצורה מבלבלת ולא ממש ברורה. קשה לעקוב אחריו\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: גלעד מתרגל ממש מעולה והוא מסביר את החומר בצורה מדהימה ומאד נגישה. הוא ממש משתדל לעשות הכל להיות מתואם עם מיכאל ולעזור לסטודנטים.\n\nשעורי הבית: עמוסים\n\nהמבחן: המבחן היה סביר, מי שחזר על הקורס הצליח משמעותית בצורה טובה יותר.\n\nהשורה התחתונה: קשה אבל אפשרי.", "timestamp": 1663142392236}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא הלכתי להרצאות \n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nפשוט מושלם, צריך לדעת להשתיק טיפה כשמאבדים ריכוז ומפריעים לו יותר מידי אבל באמת מתרגל מושלם\nשעורי הבית: \nלוקחים זמן וחשובים\nהמבחן: \nמלא בטריקים, לא קשור בכל דרך למבחני עבר של אלגברה אמ\nהשורה התחתונה: \nקורס כבד שלוקח זמן", "timestamp": 1665405276412}, {"author": "מד-מתיקאי מתוסכל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: הוא בבירור לא טוב בללמד חומר, קשה לו מאוד לתקשר את המחשבות שלו ולדבר מול כיתה. בכל ההרצאות הוא מקריא וכותב בדיוק את מה שרשום בסיכומים שלו שנמצאים כבר במודל, אחד לאחד. שגם הם, לא מאוד ברורים\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: אחלה מתרגל, מצליח ללמד את מה שמיכאל לא. יודע להסביר דברים בגובה העיניים\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1667239494008}, {"author": "איזומורפיזם", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: לא הבנתי מילה כל הסמסטר. פרשתי מההרצאות בשבוע 2.\n\nשם המתרגל/ת: גיא שמש\nחוות דעת - תרגולים: מתרגל מעולה. עוזר להשלים את החומר מההרצאות.\n\nשעורי הבית: לא יודע, רק רפרנסתי\n\nהמבחן: נגלה בקרוב\n\nהשורה התחתונה: קורס שאמור להיות קליל וכיף, הפך לזוועה", "timestamp": 1675607900492}, {"author": "א", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: אם אתם עם מיכאל אני ממליץ לכם למצוא מראש פתרון אחר במקום ללכת להרצאות שלו\n\nשם המתרגל/ת: גיא שמש\nחוות דעת - תרגולים: סבבה לגמרי\n\nשעורי הבית: לפעמים השיעורי בית מרגישים לא קשורים או לא מציאותיים ביחס למה שנלמד באותו הרגע בכיתה (כלומר העיתוי שלהם לא מתאים לנושאים בנלמדים באותו הרגע)\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: לברוח ממיכאל", "timestamp": 1675617560439}, {"author": "מטריצה מייצגת", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: מיכאל בחור חביב, אבל מרצה לא טוב (לעניות דעתי). הוא מדבר בטון חלש וקשה לשמוע אותו, כמעט ולא מסתכל על הסטודנטים אלא עסוק בעיקר בהעתקת הסיכומים שלו (שנמצאים במודל) מילה במילה אל הלוח. ההסברים שלו לא הכי ברורים. עם זאת, הוא מאוד מסודר והמבחנים שלו די סבבה. \nאם הוא מעביר את הקורס, ממליץ להגיע בהתחלה כדי לראות אם מתאים לכם (יש כאלה שדווקא הסתדרו איתו), ואם לא אז לעבור להרצאות מיוטיוב. \n\nשם המתרגל/ת: גאי שמש\nחוות דעת - תרגולים: מתרגל מצוין, עשה סדר בכל הבלבול שנוצר במוח אחרי ההרצאות. \n\nשעורי הבית: סבירים\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קורס לא קשה מדי, כל עוד תתמידו בלמידה יתגלו יחס רציני. לא הצלחתי לפתח עניין אמיתי בחומר מההרצאות.", "timestamp": 1675696441014}, {"author": "ע", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנבסקי\nחוות דעת - הרצאות: לא משהו. הגעתי ל2 ההרצאות הראשונות, ולא התחברתי אז הפסקתי להגיע. בתחילת הסמסטר היה למרצה קצת קשה לדבר מול קהל, אז הוא דיבר אל הלוח ואל הדפים שלו במקום לדבר לסטודנטים. אני למדתי מהרשימות שהוא העלה למודל - אחד לאחד החומר שעבר בכיתה. הרשימות לפעמים קצת קשות לפענוח אבל כל החומר שם. שימו לב שהקורס עבר שינוי בחומר בשנה האחרונה אם אתם רוצים ללמוד מהקלטות ישנות.\n\nשם המתרגל/ת: גאי שמש\nחוות דעת - תרגולים: תרגולים טובים מאוד. השלים את הפער שנוצר אצל אלה שלא הבינו בהרצאות (כמות גדולה מאוד של אנשים). לפעמים התבלבל קצת במהלך התרגול וקיבל תיקונים מהקהל, אבל זה היה בעיניי חלק מחווית הלימוד.\n\nשעורי הבית: מתאימים לחומר וחשובים.\n\nהמבחן: הוגן. שונה מאוד ממבחנים של חורף תשפ\"ע ולפני, אז אין הרבה מאיפה לתרגל.\n\nהשורה התחתונה: למדתי את כל החומר מהתרגולים ומהרשימות של חנבסקי.", "timestamp": 1676819659405}, {"author": "גאוס", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: מיכאל סה\"כ כן רוצה בטובת הסטודנטים, הוא מפרסם רשימות הרצאה, עונה תמיד על שאלות, הקליט סרטון של טעויות נפוצות אחרי הבוחן אמצע ועונה על שאלות בזמן הבחינה (תשובות מספקות לדעתי). הבעיה שהוא מסבך את החומר ויוצר קצת בלאגן בראש. הרבה עברו ללמוד ממקורות אחרים. לדעתי לגמרי אפשרי ללמוד ישירות ממיכאל, פשוט זה דורש קצת יותר מאמץ ויותר זמן. אם חוזרים על החומר לפני ואחרי ההרצאה ולא נלחצים שלא מבינים הכל תוך כדי אז אין צורך במקורות מידע נוספים. אני חושב שמי שהגיע להרצאות שלו הרוויח במבחן.\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: ממש אחלה, מלמד בקצב איטי אבל מתעכב על התאוריה ומוודא שהיא מובנת לפני שעובר לפתור תרגילים. נותן שעות קבלה בהתאם לצורך שלנו ובאופן כללי מלמד טוב.\n\nשעורי הבית: היו פה ושם שאלות שלדעתי היו יכולות להיות מנוסחות יותר טוב, אבל סה\"כ שיעורי בית ברמה טובה בשביל להבין את החומר. לא דורשים יותר מדי זמן אבל גם לא קלילים. לדעתי לא הכינו טוב למבחן מבחינת צורת החשיבה הנדרשת (כלומר \"טריקים\" אחרים ממה שהיה במבחן).\n\nהמבחן: לדעתי למי שהגיע כל הסמסטר להרצאות של מיכאל והתחבר לסגנון החשיבה שלו, מבחן די הוגן. השאלות שהיו בתרגולים הכינו קצת יותר טוב למבחן מאשר הגיליונות. ממליץ להכיר טוב את כל המשפטים שנלמדו בקורס, ויש הרבה כאלה, וגם לקלוט את סגנון ההוכחות של מיכאל. אין צורך לשנן הוכחות. הוא מאפשר להביא דף עזר של עמוד אחד לבחינה.\n\nהשורה התחתונה: קורס נחמד, יש דברים מעניינים יותר ויש שפחות. כדאי להבין טוב את התאוריה ולא להתעכב רק על דברים טכניים.", "timestamp": 1677973497585}, {"author": "בועז מונטיליה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: מיכאל מדבר חלש אז קשה לשמוע מה הוא אומר, דבר שמקשה על למידה בכיתה, בשיחות אחד על אחד הוא מפרט ומסביר, וברור כי הוא מבין את החומר לעומק.\n\nשם המתרגל/ת: גיא שמש\nחוות דעת - תרגולים: גיא מתרגל נהדר, מבין לעומק ומסביר תכלס איך לגשת כמו שצריך לשאלות, הוא קצת מפוזר ולפעמים מתבלבל, אבל גם כאן ברור כי הוא מבין את החומר\n\nשעורי הבית: סבבה. חלקם קצת סיזיפיים וחישוביים, אבל לרוב בודקים הבנה של החומר לעומק.\n\nהמבחן: המבחן בודק הבנה לעומק של החומר ומשמעותו.\n\nהשורה התחתונה: המרצה לא משהו, אבל החומר מרתק! אחד הקורסים הכי טובים שלקחתי הסמסטר", "timestamp": 1679166974895}, {"author": "א׳", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אני מניח שמי שמגיע ללמוד מתמטיקה בטכניון יודע מי הוא צנזור. עם זאת שמעתי עליו דברים לא כל כך טובים מסטודנטים למדמח לפני הסמסטר, אך לבסוף הוא היה סופר נחמד. ראו שהוא ממש נהנה ללמד כיתה קטנה של 30 סטודנטים, והיה יחס די אישי לכל סטודנט (לפחות מהתחושה שלי). יש בדרייב של מתטיקה סיכום של הקורס שהוא אחד לאחד מה שהוא רשם במהלך ההרצאות בסמסטר, ככה ששווה לעקוב משם. למיטב הבנתי הוא גם מעביר את הקורס סמסטר הבא ככה שגם מי שמתחיל סמסטר הבא זוכה.\nשם המתרגל/ת: גאי שמש - אחד המתרגלים הטובים ביותר בפקולטה למתמטיקה, ויותר מזה הוא בנאדם טוב. מרגיש שיש מידהו שניתן לדבר איתו ולא איזהשהו רובוט (כמו חלק מהמתרגלים האחרים).\nחוות דעת - תרגולים: \nהיו מצוינים, שווה לבוא חדים על ההגדרות והמשפטים מההרצאות כדי להבין יותר טוב את החומר שמועבר.\nשעורי הבית: לא ארוכים מדי, אך יש כמה וובוורקים שעשויים לשתות זמן, בכללי די סבבה.\n\nהמבחן: עוד לא היה.\n\nהשורה התחתונה: קורס סופר מעניין, בעיניי הרבה יותר מאינפי, לוקח זמן עד שמבינים מה באמת עושים, ולזה מגיעים רק בשבועיים האחרונים של הקורס. כאשר הכל מתחבר הקורס נהיה מאוד מעניין. בנוסף שווה להיות חד על ההגדרות והמשפטים על מנת לא לתפוס פער במהלך הסמסטר כי בסוף הכל נבנה על הכל.", "timestamp": 1690093363638}, {"author": "barak shencar", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אין על צנזור (x3 במהירות)\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: תותח, מדבר בגובה העיניים, מסביר מעולה, קטלני כשצריך ועושה צחוקים.", "timestamp": 1714047991324}, {"author": "לילך", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור  \nחוות דעת - הרצאות: מה עוד אפשר לומר על צנזור שלא נאמר, הרצאות מעולות\n\nשם המתרגל/ת: גלעד  \nחוות דעת - תרגולים: מתרגל מעולה, סופר סבלני ומסביר מעולה. מבין מה זה להיות סטודנט בסמסטר א ומבין איך להנגיש את החומר בצורה פשוטה וישירה. \n\nשעורי הבית: הגליונות היו בסדר ברמת הקושי, הוובוורקים לקחו לא מעט זמן ועצבים\n\nהמבחן: לא היה קל, אבל היה הוגן ובהחלט אפשרי למי שחרש כמות מבחנים נאה לפני\n\nהשורה התחתונה: אחלה קורס, בהשוואה לקורסים אחרים בסמסטר ממנו נהנתי הכי הרבה כנראה", "timestamp": 1715145718860}, {"author": "Evyatar Reif", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nהיה אחלה, צנזור זה צנזור\n\nשם המתרגל/ת: גלעד סופר.\nחוות דעת - תרגולים: \nגלעד מתרגל מעולה. יודע להסביר ולהנגיש את החומר בצורה מעולה, הוא בכללי פשוט בחור מקסים ובקיצור 10/10 נהניתי מכל רגע בתרגול שלו.\nשעורי הבית: \nהוגנים מאוד ומפרסמים פתרונות.\n\nהמבחן: הוגן\n\nהשורה התחתונה: מומלץ", "timestamp": 1715715304665}, {"author": "אנונימז", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nאין הרבה מה להגיד כולם יודעים מי זה אביב צנזור.\nהדרך שהוא מסביר בה את החומר פשוט מעולה, ומאוד חשוב לו שהתלמידים שמולו באמת יבינו את החומר. הרגשתי ממש בנוח לשאול אותו שאלות.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nמדבר ממש בגובה העיניים ומסביר בצורה מעולה את התרגילים.\nהסיכומים שלו מאוד עוזרים כי לפעמים התרגול רץ קצת מהר.\n\nשעורי הבית: \nלא קשים מדי, עוזרים להבין את החומר שנלמד בהרצאה באופן מוחשי.\n\nהמבחן: \nהיה מאוד מאוד פייר.\nאם עוברים על סיכומים של תרגולים (עברתי על של גלעד) ופותרים הרבה מבחנים לפני, זה אמור להספיק בשביל להצליח במבחן.\n\nהשורה התחתונה: \nקורס מעולה ומעניין מאוד.", "timestamp": 1715807503743}, {"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: טוב זה צנזור\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: הוא הפסיק לתרגל לדעתי אז זה לא ממש רלוונטי. בכל מקרה אני אהבתי. הרבה פעמים הוא התקדם בחומר או פתר רק עם סטודנטים שכבר יודעים חומר שעוד לא למדו שזה די מבאס.\n\nשעורי הבית: גיליון כל שבוע, לא הייתה חובת הגשה, מתואם עם ההרצאות. \n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס מעניין.", "timestamp": 1716824640165}, {"author": "me", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מצוין. יכול לגרום אפילו לדירוג מטריצות להשמע מעניין\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מלא מוטיבציה, מסביר מאוד טוב, חשוב לו שיבינו את החומר\n\nשעורי הבית: סמסטר מלחמה, אז היו גליונות בלי חובת הגשה\n\nהמבחן: מאוד שונה ממבחנים של מרצים אחרים לאלגברה, הרבה יותר קרוב למבחנים של אינפי\n\nהשורה התחתונה: הסגל עשה את הקורס, לא יודע מה היינו עושים בלעדיהם", "timestamp": 1717004229293}, {"author": "חתול פולינומיאלי", "difficultyRank": 3, "generalRank": 4, "semester": "202302", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אין יותר מדי מה לומר כי כולם מכירים את צנזור. באופן כללי, מרצה טוב ואחלה בן אדם. אני פחות מת עליו כי הוא נוטה לחזור על עצמו הרבה פעמים כדי לוודא שכולם הבינו את החומר, שזה מאוד נחמד אבל משעמם ומוציא מריכוז אם כבר הבנת על מה הוא מדבר. לפעמים נוטה לרוץ ישר לשלב ההוכחות בלי לספק יותר מדי אינטואיציה, אבל בסך הכל אחלה. 8/10. \n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: לא יודע, לא הייתי\n\nשעורי הבית: סבירים. מתרגלים את החומר כמו שצריך. \n\nהמבחן: היה קשה, אפילו בהשוואה לרמת המבחנים מהשנים האחרונות. עם זאת, לא קשה בצורה מוגזמת. מי שלמד כמו שצריך יכל להוציא ציון טוב. \n\nהשורה התחתונה: קורס חביב, לא מעניין כמו אינפי אבל עדיין נחמד.", "timestamp": 1717576471474}, {"author": ":(", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מרצה טוב\n\nשם המתרגל/ת: גלעד, מלמד טוב אבל קל לאבד אותו \nחוות דעת - תרגולים: לא דומים למבחן\n\n\n\nהמבחן: מועד ב היה קשה והיו כל כך קשים בבדיקה, ממוצע של 47 ו21 נכשלו מתוך 28 ולא התייחסו לזה (היה פקטור של 4 נקודות אבל מה זה משנה)\n\nהשורה התחתונה: קורס חובה אבל לא התחברתי הסגל המלמד האלגברה של המדמח יותר טובים מאיתנו עם מבחנים פייר יותר", "timestamp": 1717668806082}]}