{"posts": [{"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  דניאלה ונתן\nחוות דעת - הרצאות: שניהם מרצים מעולים, הרבה לא התחברו לדרך שנתן מלמד, אני חושב שהוא מרצה מצויין שיורד לפרטים מאוד ונותן דגש על תיאוריה ופחות דוגמאות.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מצויין מסודר הכי טוב שהיה לי הסמסטר\n\nשעורי הבית: וובורקים לוקחים זמן, לפעמים עדיף פשוט לא לעשות או רק להבין את העיקרון ולדלג כי זה חלק קטן מהמגן סך הכל\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713281685499}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nמרצה נהדרת, יסודית, עונה תמיד על שאלות, אכפתית.\nקצת מהירה וצריך להיות בקצב וקשובים אבל מספיקה הכל ויותר, מלמדת עם התלהבות.\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: נחמד, עונה על שאלות, קצב קצת איטי לטעמי אבל מספיק הכל.\n\nשעורי הבית: \nאין הרבה והם די הוגנים\nהמבחן: \nהוגן, לא בא להכשיל בסופו של דבר\nהשורה התחתונה: קורס בעיקר טכני, קצת משעמם, אבל נחמד", "timestamp": 1713914644683}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: \nמרצה טובה וברורה, לא הכי התחברתי לצורת לימוד ולאווירה אבל בהחלט מסבירה ברור ומומלצת הרבה יותר מלשבת בצפיפות אצל עליזה.\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nמתרגלת מושלמת. מביאה מצגות ברורות שהכינה עם החומר ועם שאלות לדוגמא, מסכמת את החומר נהדרת ומוודאת שכל סטודנט בכיתה מבין את החומר כמו שצריך. רואים שהיא אוהבת ללמד, נחמדה ונגישה. מי שרוצה להצליח באלגברה- ללכת לויויאן.\nשעורי הבית: \nבסדר גמור, לא ארוכים מידי, לא קשים מידי. הוגנים.\nהמבחן: \nאלגברה זה הרבה טכניקה, מי שתרגל מספיק יצליח. לא דורש יותר מידי חשיבה, בעיקר עבודה טכנית ולדעת את הטריקים. חשוב לתרגל הרבה כדי להצליח.\nהשורה התחתונה: \nקורס הוגן, נחמד, חובה לרוב הסטודנטים.", "timestamp": 1713967887655}, {"author": "a.b", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות:\nעליזה מעולה. נכון, היא יותר מובנת ביוטיוב אבל בעיניי אין תחליף לפרונטלי שם היא נותנת יותר את התכלס שלה, נותנת טיפים ומסבירה טוב.\nיש לה הרצאות יותר מובנות ויש הרצאות פחות מובנות אבל מי שכתב שהיא אוברייטד כנראה לא חווה מרצים אחרים.\nממליץ בחום, אין על עליזה\n\nשם המתרגל/ת: \nאחסאן\nחוות דעת - תרגולים: \nהמלך הבלתי מעורער. המתרגל הכי טוב שהיה לי הסמסטר. בול במידה. \nמסודר, יודע את החומר נהדר, עובר ביסודיות על מה שצריך ועל מה שלא לא מתעכב, מסביר ברור ממש ולא נותן לך לנחש שלבים, הכל על הלוח. עונה לשאלות אם צריך.\nהסדר שלו לפעמים יכול להיראות מונוטוני או איטי, אבל יש לו בסוף הספק טוב ועובר על כל הדברים החשובים.\nחוץ מזה אין על ההומור שלו.\nהוא המלך\n\nשעורי הבית: \nלוקחים זמן אבל הוגנים ונותנים לך להבין. הוובוורק בסוף כבר חופרים\n\nהשורה התחתונה: \nאחלה קורס, מעניין, לפעמים טכני אבל נהניתי סהכ", "timestamp": 1714168043085}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עליזה מלק\n \nחוות דעת - הרצאות: \nעליזה מרצה טובה, מעבירה את החומר בצורה כיפית אבל לדעתי דרך הסרטונים שלה ביוטיוב מבינים יותר את החומר\n\nשם המתרגל/ת: אחסאן\n\nחוות דעת - תרגולים: \nאחסאן מעולה, מהמתרגלים הטובים שנתקלתי בהם. קצת איטי אבל מסביר מצוין ודרכו הצלחתי להבין את החומר יותר לעומק\nבהכנה למבחן צפיתי בהקלטות של ויויאן והיא גם נהדרת\n \nשעורי הבית: \n7 גיליונות, הגיליונות שנחשבים למגן מחולקים ככה שאפשר להגיש בסוף רק 5. הגיליונות לא הכי קשים ויש כמות של רפרנסים אז אם לא מסתדרים יש לאיפה לפנות. \n \nהמבחן: \nהמבחן שלנו היה ארוך מאוד ודרש הרבה זמן לפתור, בנוסף היה רעש במבחן לרוב האנשים ככה שזה הקשה על הריכוז, הם ניסו לעזור לנו עם תוספת זמן של חצי שעה אבל בכל זאת כמעט ואף אחד לא סיים לפני שלוש שעות וחצי.\n \nהשורה התחתונה: \nקורס יותר טכני משאר הקורסים, חייב השקעה, בעיקר שאלות של מבחנים כי השאלות והרעיונות חוזרים על עצמן", "timestamp": 1715380331043}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: דניאלה מקסימה היא מעבירה את החומר בצורה ברורה ומעניינת והיה שווה ללכת אליה ולא להצטופף אצל עליזה \n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: אין עליה! התרגולים שלה בנויים מסקירה קצרה על החומר התיאורטי ואז תרגילים. אני חושבת שזה עזר לי להבין לעומק את החומר וגם לדעת איך לגשת לכל תרגיל שיש.\n\nשעורי הבית: הwb חפרו לפעמים סתם חישובים מגעילים, הגיליונות היו חשובים מאוד להצלחה במבחן והפנמה של החומר. יש מלא רפרנסים אז אין צורך לשבור את הראש אם לא הבנתם או הצלחתם לפתור משהו. \n\nהמבחן: תבניתי מאוד, השאלות די חוזרות על עצמן אין יותר מדי הפתעות. לעשות סקירה קצרה לפני המבחן על החומר התיאורטי לתרגל מספיק מבחנים והצלחתם\n\nהשורה התחתונה: קורס חביב, מעט טכני, מבחן הוגן. קורס חובה שאפשר לעבור בציון יפה!", "timestamp": 1715519218163}, {"author": "לכסין", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרים ולך\nחוות דעת - הרצאות: \nמרים מרצה מעולה, תמיד נותנת זמן לשאלות , יש אווירה טובה איתה בכיתה .\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: \nמתרגלת מצוינת , מתמצתת את החומר ועוברת על מלא תרגילים ומסבירה מעולה , היא ממש מהירה אך מצוינת.\n \nשעורי הבית: 12 וויבוורק, בדר\"כ טכני לתרגול החומר , ו 7 גליונות שהם סבירים יחסית .\n\nהמבחן: הוגן , דומה למבנה של מבחנים של שנים קודמות , אז עם הרבה תרגול של מבחני עבר וחזרה על החומר ניתן לעבור את הקורס בציון טוב.\n\n\nהשורה התחתונה: קורס טכני עם הרבה מושגים , לכן חשוב לא לפספס דבר כי זה די נבנה אחד על השני , בסך הכול קורס סבבה.", "timestamp": 1715556654035}, {"author": "חדוו''א 1ת'", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: תותחית על. אין עליה. מומלץ בחום לצפות גם בסרטונים שלה ביוטיוב (פיילוט של אלגברה לינארית)\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אלוף. באמת מסדר את הראש עוזר להבין את ההרצאות לעומק. מומלץ בחום להגיע לתרגולים האחרונים שלו במיוחד.\n\nשעורי הבית: לא מאוד קשים ולא מאוד ארוכים. אבל חשוב מאוד לעשות אותם ולהיות עדכני על החומר לאורך כל הסמסטר.\n\nהמבחן: אם תתאמנו טוב על מבחני עבר, תצליחו במבחן. המבנה חוזר תמיד. \n\nהשורה התחתונה: קורס סבבה סך הכל, תתרגלו הרבה ותצליחו במבחן.", "timestamp": 1715970373038}, {"author": "m.s", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה \nחוות דעת - הרצאות: אין באמת מה להגיד על עליזה היא מעולה! אפשר גם להסתפק בסרטונים בערוץ היוטיוב( כמעט אחד על אחד ואפילו יש דברים נוספים) החסרון היחיד הוא שמפספסים את הבדיחות והאקשן של עליזה במהלך ההרצאה ;) \n\nשם המתרגל/ת: הילה מעין \nחוות דעת - תרגולים: הקצב שלה מהיר אבל בקורס הזה עם תרגול אחד בשבוע זה מה שצריך, ותמיד הטריקים שלה עוזרים בדיוק בשאלות המסובכות  בתרגילי הבית ובמבחן מה שהופך אותם לקלות וגם כן קשה יותר ליפול בטעויות הנפוצות. \n\nשעורי הבית: בהשוואה עם קורסים אחרים שיעורי הבית לא באמת ארוכים, להגשות בכתב כמעט ויש רפרנס לכולם, למרות זאת לא לסמוך עליהם ולנסות לעשות אותם באופן עצמאי מאוד עוזרים להבנת החומר וכשמתחילים לתרגל לקראת המבחן מרגישים את זה. \n\nהמבחן: המבחן עצמו לא קשה אם מתרגלים מספיק. המבנה חוזר על עצמו קל מאוד לשלוט בשתי השאלות הראשונות , החלק הקשה הוא החלק האמירקאי ומאוד קל להתבלבל, צריך להיזהר ולקחת את הזמן.\n\nהשורה התחתונה: מבחינתי היה הקורס הכי מעניין וכיפי במהלך הסמסטר.", "timestamp": 1716202386717}, {"author": "ד", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: מקסימה! מסבירה ממש טוב ובקצב טוב ומספיקה את כל החומר עם דוגמאות.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: תרגולים טובים עם הרבה תרגילים בדרך כלל עושה תרגיל משיעורי הבית\n\nשעורי הבית:  \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716247605093}, {"author": "i", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה ונתי\nחוות דעת - הרצאות: דניאלה מרצה מדהימה טסה בחומר אבל מרבה להסביר באמצע הסמסטר נתי החליף לפרק זמן אישית לא התחברתי למרצה שקורא לי דברים ממצגת את זה אני יכול לעשות לבד בבית אבל שדניאלה חזרה הייתה אפילו יותר טובה \n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אחסאן מתרגל נהדר משלים את כל החומר והדקויות מההרצאה ובמיוחד שנתי היה כאילו לימד את החומר מאפס מספיק המון תרגילים בכל תרגול ומסביר לכולם \n\nשעורי הבית: הרבה גיליונות אבל לא עמוסים במיוחד ולא ארוכים במיוחד מקבלים זמן אפילו להגיש מראש ככה שאם מוצאים זמן אפשר לתקתק \n\nהמבחן: המבחן פייר אין מה לחדש בדיקה נוקשה \n\nהשורה התחתונה: קורס נחמד שיעורי בית סבירים דניאלה מרצה נהדרת ואחסאן מתרגל נפלא", "timestamp": 1716366358289}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה - הקלטות\nחוות דעת - הרצאות: רגלי לא דרכה פעם אחת באולם ההרצאה של עליזה וצפיתי בה נטו מהקלטות במודל או מההקלטות שלה ביוטיוב במקרה של תקלות, וזה באמת עשה את העבודה. ואין על הטיפים שלה לפתרונות תרגילים, במיוחד לקראת המבחן, הם מעולים ורלוונטיים.\n\nשם המתרגל/ת: ויויאן \nחוות דעת - תרגולים: מתרגלת אנדרייטד ברמותתת!!! המתרגלת הכי טובה שהייתה לי בסמסטר א, היא מקצועית, נחמדה, אוהבת ללמד והיינו אצלה בקבוצה קטנה עם אווירה טובה. היא מספיקה גם לעבור על תרגילים טובים באופן מסודר וגם לחזור על החומר מההרצאות מחדש באופן מתומצת ורלוונטי. כן מומלץ להגיע פיזית אבל גם מקליטה הכל אז אפשר לשחק עם זה. לקראת המבחן יש לה הקלטות מכל מני שנים שכל פעם היא פתרה סוג אחר של תרגילים מהמבחן - ככה שבסך הכל יש לכם מבחן שלם לעבור עליו כתרגול וזה מדהים! זה עזר לי מאוד להצליח. קיצר היא מומלצת ממש.", "timestamp": 1716565152084}, {"author": "וקדימה לפיזיקה 2ממ", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה \nחוות דעת - הרצאות: \nעליזה נהדרת, מעבירה את ההרצאות בצורה ברורה, מקצועית אבל גם נעימה, קלילה וכיפית. כשהחומר התחיל להסתבך ואיבדתי קצב השלמתי את החומר בעזרת הסרטונים המוקלטים שלה ביוטיוב והם מצוינים - מחולקים לפי נושאים ותתי נושאים, עם הוכחות מלאות ודוגמאות מפורטות. החסרון היחיד הוא שבעקבות כך הם ארוכים ואין זמן להתעכב יותר מדי ולכן חזרתי מהר מאוד להרצאות. \nלפעמים יש פער בין התיאוריה לבין הפרקטיקה, אבל עליזה השתדלה כל הזמן לתת מוטיבציה לכל נושא והראתה איך הכל מתחבר להכל, רואים שהיא מתחברת לחומר, בקיאה בו ברמות ואוהבת ללמד.\nשם המתרגל/ת: ויויאן מוקלט\nניסיתי כמה מתרגלים פרונטליים שפחות התחברתי, עד שנתקלתי בהקלטות של ויויאן (התרגול עצמו נפל על ההרצאה ולכן לא הגעתי פרונטלי). ויויאן פשוט מעולה, כל תרגול מתחיל בחזרה על עיקרי הנושא הקודם, מעבר זריז על התיאוריה והמשפטים ואז פותרת תרגילים רלוונטים. היה תענוג לצפות, סידרה לי את הראש הרבה פעמים.\nחוות דעת - תרגולים: \n\nשעורי הבית: גליונות ארוכים אבל לא קשים, יש רפרנסים להכל אבל ממש כדאי לרפרף על תרגילים דומים ואת הגליונות לפתור לבד.\nוובוורקים ארוכים עם טריקיים מעצבנים, אבל מכסים את כל הטכניקות השונות.\n\nהמבחן: הוגן לחלוטין, בלי שטיקים מתחכמים. מי שעקב במהלך הסמסטר ועבר על מבחנים לפני המבחן לגמרי יכל להצליח.\n\nהשורה התחתונה: לפעמים משעמם ולפעמים קשה, בעיניי הקורס עצמו היה סך הכל מעניין וכיפי, עולם חדש של מושגים ורעיונות והכל התחבר להכל בסופו של דבר. עליזה מלכה. בהצלחה!", "timestamp": 1716570120397}, {"author": "Ar No", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דניאלה + נתן\nחוות דעת - הרצאות: \nדניאלה הייתה ממש אחלה. קצת רצה בחומר אבל מסבירה דברים טוב ויש אווירה טובה אצלה בהרצאות. אצל נתן לא הייתי מסוגל להקשיב - הוא ממש נחמד וממש רוצה לעזור ויכול להיות שבשעות קבלה הוא יותר טוב, אבל בתור מרצה היה קשה מאוד אצלו בשיעורים.\n\nשם המתרגל/ת: אחסאן + יארה\nחוות דעת - תרגולים: \nשניהם מעבירים בסדר אבל הכיתה של אחסאן עמוסה בהרבה. \nשעורי הבית: \nלא קשים מדי, לא קלים מדי, תמיד קצת תקועים בין המקצועות המאתגרים יותר, בעיקר משהו שאתם רוצים לסמנב ולהמשיך הלאה.\nאם עליזה מרצה אחראית, יש לכם מראש את כל התרגילים של שיעורי הבית ורפרנסים לכולם, ככה שאם אתם רוצים לחסוך לעצמכם עומס במהלך הסמסטר וחושבים שתצליחו ללמוד את כל החומר בתקופת מבחנים ומלשבת בהרצאות, אתם יכולים להכין הכל מראש ואז להגיש כל פעם שפותחים תיבה.\nהמבחן: \nהמבחן די הוגן, לא מצריך המון זמן של למידה כדי להוציא ציון סביר, רוב השאלות הן ברמה של הצבה לנוסחה וחלק קטן מהן גם מוסיף את האתגר של איזו נוסחה.", "timestamp": 1716743158311}, {"author": "Ran Gil", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: \nמרצה טובה ומנוסה מאוד.\nמתקדמת יחסית מהר על התאוריה כדי להראות הרבה דוגמאות, סגנון שהתחברתי אליו. \nלפעמים קצב מהיר מדי וקשה לעקוב.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nמתרגלת מעולה!!\nמגיעה מסודרת עם מצגות מעולות שעושות סדר בראש.\nחזרה תאורטית ואז התרגילים הנדרשים.\nברורה, עונה לכל שאלה.\nבקיצור 100%!\n\nשעורי הבית: \nהגיליונות לא מסובכים יותר מדי.\nפה ושם תרגילים שאין ברירה לרפרנס.\nוובוורק טוב. \n\nהמבחן: \nקשה מאוד. יש לחץ זמן.\nממליץ לא להתעכב יותר מדי על דברים קטנים…\n\nהשורה התחתונה: \nקורס קשה אבל חשוב להמשך ולתפיסה המחשבתית.", "timestamp": 1716830688136}, {"author": "עלמה", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה מדהימה! מלאת תשוקה לחומר, שומרת על עניין וקלילות לאורך כל ההרצאה, אכפתית בטירוף ובאמת משתדלת להסביר בצורה הכי טובה שיש!\n\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: היה ממש נחמד אצל אלון, היה לו חשוב להסביר לנו למה אלגברה זה חשוב וגם רואים שיש לו זיקה לחומר.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716837023560}, {"author": "Einbar Dror", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: דניאלה מעולה! ביד אחת כותבת ויד אחת מוחקת.. כלומר הספק גבוהה, זמינה מאוד ואפילו דוחפת שתגיעו לשעות קבלה\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: הילה דקדקנית ומובנת מאוד, כותבת הרבה אבל ההסבר שווה את הכאב יד\n\nשעורי הבית: קשים, לבוא לשעות קבלה\n\nהמבחן: קשה, לפתור מבחני עבר כי הם דומים\n\nהשורה התחתונה:לא לפחד לשאול שאלות עד שהאסימון נופל", "timestamp": 1716902999161}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מרים וולך\nחוות דעת - הרצאות: מעולה! היא מסבירה טוב, כותבת מאוד ברור ויפה על הלוח והכל בקצב סביר לגמרי (ובלי צורך בהרצאות השלמה)\nגם היה כיף בשיעורים שלה יש אווירה טובה, אני ממש ממליץ עלייה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: המתרגלת הכי טובה שהייתה לי, פותרת בקצב מהיר אז קשה להספיק להעתיק אבל עדיין אפשר להבין ומספיקים מלא בתרגולים שלה \nיצאתי מכל תרגול בהרגשה שלמדתי דברים חדשים שעזרו לי לפתור את השיעורי בית\nהיא גם מצד אחד מסבירה לעומק ומהצד השני נותנת הרבה טיפים חשובים למבחן\nהחסרון היחיד זה שהיא כותבת בקטן על הלוח והכיתה מלאה, אז אם נתקעים מאחורה יכול להיות קשה לראות\n\n\nשעורי הבית: עמוס אבל בסדר ל5 נק\"ז, יש גם וובוורקים וגם גיליונות\nהוובוורקים יחסית קלים וכדאי לפתור אותם לפני הגיליונות בשביל להבין יותר טוב את החומר\nהגליונות ברמה סבירה, וגם יש רפרנסים\n\nהמבחן: הוגן. אם פותרים מספיק מבחני עבר אז השאלות מאוד חוזרות על עצמן וכנראה לא יהיה משהו שיפתיע אתכם.\nעם זאת הוא מאוד ארוך, אז חשוב לא להוריד קצב כי יכול להיגמר הזמן.\n\nהשורה התחתונה: אני ממש אהבתי את הקורס, החומר לדעתי מאוד מעניין וגם לא ממש מסובך.\nהסגל ממש אחלה וגם תמיד יש את ההקלטות של עליזה ושל צילג ביוטיוב לגיבוי.\nגם אהבתי במקצוע זה שבסוף כל הנושאים מתקשרים אחד לשני ומשתמשים ממש בכל נושא שלומדים בקורס, למשל כשלמדנו דטרמיננטות לא הבנו למה צריך את זה אבל אחרי זה מבינים (במיוחד גם בקורסי המשך).", "timestamp": 1717685028443}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרים\nחוות דעת - הרצאות: מרצה טובה, מסבירה טוב ועם הרבה דוגמאות. יש לה טעויות במצגת לפעמים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה נראה לי\n\nהמבחן: קשוח אבל פייר\n\nהשורה התחתונה: לא הכי קל ולא הכי קשה בשנה א", "timestamp": 1719072983532}]}