{"posts": [{"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "201901", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: \nעדיף לקרוא ספר על הנושא מאשר ללכת להרצאות . מהלך ההרצאות מאוד דומה לספר שלו גם השאלות לדוגמא .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: היו כמה שאלות מרופרנסות ממבחני עבר \n\nהשורה התחתונה: קורס נחמד ומתאים ללמידה עצמית אבל כן מומלץ ללכת לתרגולים  \n(הרצאות הן בזבוז זמן)", "timestamp": 1598594680019}, {"author": "Nitzan Haviv", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: ההרצאות היו לא מסודרות ו80% מהחומר הועבר בחמשת ההרצאות האחרונות.  לא הייתי ממליץ עליה כמרצה טובהץ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס לא דורש יותר מידי זמן.", "timestamp": 1613387542182}, {"author": "רין קרוט", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מרינה קרש-ברש\nחוות דעת - הרצאות: הרצאות זוועתיות בלשון המעטה. כלב שנובח במהלך ההרצאה, רעשים אקראיים במהלכה. סדר וארגון כמעט ולא קיים והרגשה כללית של זלזול\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית סבירים בהחלט, לוקחים זמן בינוני ותורמים להבנה של החומר\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613759252998}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קרוש-ברם\nחוות דעת - הרצאות: \nהרצאות מבולגנות  לא מובנות ויבשות. חצי מהזמן הכלב שלה  נובח ברקע והיא פשוט ממשיכה ללמד כאילו  הכל בסדר.מורגש כאילו לא אכפט לה מהקורס בשום צורה שהיא\n\nשם המתרגל/ת: אבירם יעקביאן\nחוות דעת - תרגולים: מתרגל טוב מעביר את החומר בצורה מובנת \n\nשעורי הבית: דורשים קצת השקעה אבל לא משהו מוגזם\n\nהמבחן: מבחן הוגן יש שאלת שיעורי בית ושאלת הוכחה מרשימת הוכחות שהיא מפרסמת מראש.  \n\nהשורה התחתונה: קורס משעמם  שמועבר בצורה גרוע אבל לא קשה מדי", "timestamp": 1614169607365}, {"author": "דגחגדכ", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קרוש-ברם\nחוות דעת - הרצאות: מרצה עם כריזמה של נעל בית. אבל מעבר ליכולות הרטוריות המולדות הרעות שלה שאינן בשליטתה, היא גם זילזלה בצורה מופגנת בקורס ובסטודנטים. במשך חלק ניכר מההרצאות היה כלב נובח שהפריע להתרכז, ורעשים שונים כמו דיבורים בבית ושטיפת כלים. זאת, בנוסף לאיחורים כמעט מדי הרצאה. \n\nשם המתרגל/ת: אבירם יעקוביאן\nחוות דעת - תרגולים: מתרגל טוב וברור. עונה בפירוט לשאלות של סטודנטים. נוטה לאחר מעט לתרגולים. בתרגול אחד הוא לא הגיע בלי הודעה מוקדמת בגלל מחלה (לגיטימי), אך מן הראוי היה להודיע לסטודנטים כדי שלא יחכו סתם. \n\nשעורי הבית: ארוכים להחריד ביחס למשקל הקורס, אך ברורים ותורמים להבנת החומר. \n\nהמבחן: מעט קשה מהרגיל. בדיקה פשוט שערורייתית, חלק ניכר מהסטודנטים איבדו סעיפים שלמים על טעויות מינוריות. בנוסף התנהלות המבחן עצמו הייתה מבולגנת להחריד עם בלאגנים בפתיחת הקובץ ורעש בלתי פוסק מצד המשגיחים שניסו בקול רם לפתור את בעיות הגישה של חלק מהסטודנטים לקובץ (במקום לדבר איתם בצ'אט)\n\nהשורה התחתונה: חומר מעניין ולא עמוס מדי, אבל התנהלות נוראית של הסגל שהוציאה את כל הכיף", "timestamp": 1614173018450}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: היא מאד השתדלה. לפעמים יותר מדי. במהלך הסמסטר ענתה על כל שאלה הכי קטנה שצצה במהלך ההרצאה עד כדי עיכוב של הרצאות שלמות. יצא שרוב החומר של הקורס נלמד בשבועות האחרונים. כן הייתה הרגשה ממנה שהיא מאד רוצה שנצליח, ארגנה הרבה שעות קבלה. לעומת זאת לא הייתה זמינה בכלל במיילים למעט מקרי קיצון.\nההרצאות עצמן היו נוראיות, הייתה מקריאה ממצגת ולעיתים לא היה ככ ברור מה הקונספט שהיא מנסה להעביר.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: ניסיתי בהתחלה קצת ללכת ללייב של התרגולים והם לא תרמו בכלום מבחינתי. החלטתי לא ללכת לתרגולים אלא לעבור על התרגולים המוקלדים (קיימים בדרייב), בדיעבד התגלתה כהחלטה טובה מכיוון שהרבה שאלות שיעורי בית היו בתרגולים המולקדים. כתובים בפירוט ומאד תרמו להבנה שלי לאחר ההרצאות.\n\nשעורי הבית: לא מאד קשים, תורמים להבנה גם כן. שווה להשקיע בהם.\n\nהמבחן: לא קשה\n\nהשורה התחתונה: קורס מעניין עם קונספטים מעניינים שנלמדו בצורה לא טובה וחבל. יכלו לעשות את זה יותר טוב", "timestamp": 1614333091404}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מרינה קדוש-ברם\nחוות דעת - הרצאות: לא ממש ברורות\n\nשם המתרגל/ת: מוחמד אבו חמד\nחוות דעת - תרגולים:  מוסברים היטב\n\nשעורי הבית: דורשים חשיבה אך לא נוראים\n\nהמבחן: מאתגר- ממליץ לתרגל הרבה לפני\n\nהשורה התחתונה:", "timestamp": 1614542085198}, {"author": "קושי גורסה", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קדוש ברם\nחוות דעת - הרצאות: \nמרינה לא ברורה בכלל, לא מסבירה טוב, לא זמינה במייל, ובמבחן מתעללת.\nשם המתרגל/ת: יעקוביאן\nחוות דעת - תרגולים: \nמסביר יותר טוב משאר המתרגלים אבל התרגולים עצמם לא משתווים בכלל לרמה של המבחן ולא מאוד תורמים.\nשעורי הבית: \nשיעורים לא קלים בכלל, לא בקנה מידה למה שנלמד בהרצאה ובתרגולים\nהמבחן: \nמבחן קשה ומתקיל.\n\nהשורה התחתונה:", "timestamp": 1615813734374}, {"author": "אופיר שוקרון", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: \nמעולה.\n\nתעשו לעצמכם טובה ותורידו את הpdf של מרוכבות והתמרות אינטגרליות של רבייב. אני למדתי ממנו במהלך רוב הקורס, שם יש הוכחות מלאות ומשפטים באופן מובן עם דוגמאות.", "timestamp": 1620248933798}, {"author": "Eilon Zohar", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: לא הייתי. יש אחלה סרטונים ביוטיב \n\nשם המתרגל/ת: לא הייתי\nחוות דעת - תרגולים:  \n\nשעורי הבית: לא קלים אבל מכינים טוב למבחן אם עושים אותם כמו שצריך\n\nהמבחן: ארוך\n\nהשורה התחתונה:  משהו בין חדוא 1 ל2, מי שהיה טוב בדברים האלה אמור להיות לו ממש קל. המבחנים מפתיעים, לא רק השנה. הרוויח 2.5 נקודות ביושר.\nבכל מקרה מעניין וסופר שימושי (בעיקר השבועיים האחרונים)", "timestamp": 1644157582137}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: רץ טיפה בהרצאות אבל אין מה לעשות, ככה זה כשהקורס 2.5 נקז ויש יחסית הרבה חומר. באופן כללי אחלה של מרצה ובן אדם.\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: חריף מאוד ומעביר בצורה מעניינת\n\nשעורי הבית: \nלא קשים ומרופרנסים ברובם\n\nהמבחן: \nפעם ראשונה שאבי בונה מבחן להבנתי. המבחן לא תאם בכלל מבחנים משנים קודמות. היה סיוט וחבל...\n\nהשורה התחתונה:", "timestamp": 1644737396904}, {"author": "יובל לוי", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: \nסה\"כ בסדר גמור, מדבר ברור ולא מהר, די צמוד לקבצים מוקלדים שהוא מעלה לאתר.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nניסיתי כמה, לא התחברתי לאף אחד אז הפסקתי ללכת.\nשעורי הבית: \nגליון ארוך פעם בשבועיים בערך, הרוב מרופרנס.\nהמבחן: \nזוועה, לא דומה בכלל למבחני עבר ככה שאי אפשר היה להתכונן אליו כמו שצריך, ממוצע נמוך בהרבה משנים קודמות.\nהשורה התחתונה:", "timestamp": 1645598537408}, {"author": "אויילר", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: משעמם, בסוף פרשתי מההרצאות ולא באמת חייב להיות שם כי אפשר ללמוד מספיק טוב מהרשימות והתרגולים\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: מתרגל מצויין \n\nשעורי הבית: לא קשים ולא ארוכים\n\nהמבחן: זוועת עולם, קשה באופן לא פרופורציונלי לתרגולים והשב, בשביל קורס של 2.5 נקז זה הרגיש כמו חדוא , רמת ההבנה העמוקה שהיה צריך כדי להצליח באופן סביר מאוד גבוהה. חבל.\n\nהשורה התחתונה:  אם המבחן היה נורמלי כמו שנים קודמות קורס לא רע, אבל בגלל המבחן, קורס נוראי.", "timestamp": 1645635152917}, {"author": "Einav Bublil", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: מחייך בהרצאות אבל בפועל הכניס לנו אחת במועד א\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: בסדר, קצת ממהר אבל זה כי יש רק שעה אחת של תרגול וזה לא מספיק\n\nשעורי הבית: חלק בסדר חלק קשים\n\nהמבחן: מזל שזה רק 2.5 נק\"ז \n\nהשורה התחתונה: תברחו", "timestamp": 1645955095861}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: \nקורס מתמטי, מי שאוהב את התחום מאוד יתעניין. קבצי ההרצאה שהוא העלה כיסו די את הכל, ומי שמצליח להבין לבד את המעברים המתמטיים יכל להסתדר גם איתם וללמוד עצמאית. היה נחמד מאוד במהלך הסמסטר, במבחן טיפה פחות.\nשעורי הבית: \n6 הגשות לאורך הסמסטר, בזוגות. הגשות לא קצרות בכלל שלוקחות לא מעט זמן, במיוחד אם לא יושבים טוב על החומר. לפתור במקביל לקבצי ההרצאה עזר ממש. בשביל ההוגנות, פתחו כל הגשה כזאת הרבה זמן מראש  אז היה זמן לעשות את זה כמו שצריך.\nהמבחן: \nמועד א' היה קשה. אחרי פקטור לא קטן עדיין הממוצע היה נמוך משנים קודמות בלא מעט נקודות. גם מבנה המבחן היה שונה משנים קודמות והקשה.\nהשורה התחתונה: מי שאוהב מתמטיקה, יהנה ממש. השאר, פחות", "timestamp": 1647427068308}, {"author": "שוגי בוגי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אופיר\nחוות דעת - הרצאות: \nאופיר הוא ממש חמוד. מן דובון אכפת לי כזה. בהרצאות הוא נותן את החומר ממש לאט ובהרחבה עם מלא דוגמאות. וזה נראה ממש קל בהרצאות שלו. רק נראה. הוא לא רוצה שהסטודנטים ילמדו רק למבחן אז הוא נותן משימות לא חובה לתכנות הפונקציות כי הוא הגיע אלינו מההייטקס. \n\nשם המתרגל/ת: מרינוש\nחוות דעת - תרגולים: \nנותנת תרגילים במהירות האור. אם מצמצת אתה תפספס את כל ההסבר. כל התרגולים הם בהפרש של 3 תרגולים ממה שצריך. אבל התרגילים טובים והם ממש דומים לשיעורים.\nשעורי הבית: \nהשיעורים מעולים. תרגילים ברמת מבחן. ובמבחן הסופי יש תרגיל אחד מתנה משיעורי הבית אז זה ממש טוב. תעשו אותם אל תתעצלו.\nהמבחן: \nאופיר אמר לנו שהמבחן יהיה טוב והוא יעשה אותו הוגן. הוא בילף אותנו:( השאלות לא נחמדות. לפתור טריליוני תרגילים.\nהשורה התחתונה: \nאחלה קורס", "timestamp": 1675286962556}, {"author": "מדיטציה- הפיתרון לסבל", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "אופיר אחלה של מרצה\nקורס יחסית קל\nבסוף הקורס שלומדים על אינטרגלים רואים את השימוש בו", "timestamp": 1675583481718}, {"author": "C1", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אופיר דוד\nחוות דעת - הרצאות: \nהמרצה מאד אכפתי ורואים שהוא מאד אכפת לו מהתלמידים ומהחומר. לפעמים ההסברים הם ב4 מימדים, ולא ממש מבינים (אבל יכול להיות זה גם השעה😅). בסוף הקורס לומדים חישובי אינטגרלים ואז מבינים למה צריך את הקורס.\n\nשם המתרגל/ת: מרינה גוורווד (יש 2 מרינה בקורס זה)\nחוות דעת - תרגולים: \nמסבירה טוב, די מהיר, והיה רועש בכיתה\n\nשעורי הבית: \nיש 6 עבודות, ממש סבבה, לוקח שעתיים לעשות. בוחרים 5 טובות מבינהם והם שוות 15 אחוזים מגן.\nבנוסף יש שאלה מש.ב (אז מתחילים מ20 נקודות)\n\nהמבחן: \nמבחן קשוח, אבל הוגן\n5 שאלות אמריקאיות - כל אחת 5 נקודות\n4 שאלות פתוחות - כל אחת 20 נקודות (אחת מש.ב)\nלשים לב לניסוח באמריקאיות ולתרגל מלא מלא (בעיקר מקובץ ההכנה לבחינה)\n\nהשורה התחתונה: נחמד, מזכיר קצת אינפי, אתם כנראה תבינו מה מטרת הקורס רק בשיעור 10 ואז יותר נחמד", "timestamp": 1676537508364}, {"author": "אורן ברגמן", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אופיר גורסה \nחוות דעת - הרצאות: כמו שעת סיפור לפני השינה עם דודו פארוק, כזה בפאנן לא רציני בכלל\n\nשם המתרגל/ת: מרינה משהו\nחוות דעת - תרגולים: וואו זה גרוע. כמה שמספיקים לעשות בקורס הסבתרות בתרגול של שעה לעומת המעט כמעט כלום שהספקנו פה - תתרגלו לבד בבית פשוט.\n\nשעורי הבית: זניחים מאוד. קצת כמו עבודה בזוגות בבית ספר (עושים אותם בזוגות)\n\nהמבחן: קצת לא מייצג את שאר הקורס במונחים של תרגולים ושיעורי בית אבל פשוט מבינים את הקטע ממבחנים קודמים ומסתדרים, מאוד הוגן\n\nהשורה התחתונה: קורס באינטגרלים.", "timestamp": 1678542184241}, {"author": "מרינה מרגז", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אופיר גורסה\nחוות דעת - הרצאות: \nהיה בסדר, עדיף להריץ את אורי אליאש הגדול מכולם ביוטיוב כי ההרצאות מאוד לא מתמטיות וזה מרגיש קצת כמו קורס לתלמידי תיכון, לפחות למי שעשה קורסים באינפי (אווירו תאכלו תחת)\n\nשם המתרגל/ת: מרינה גרוזג\nחוות דעת - תרגולים: \nמלמדת מהר אבל לפי דעתי טוב סך הכל, זה גם שעה אחת אז כמה באמת אפשר להספיק. החיסרון הגדול בתרגול היה לא אשמת מרינה אלא אשמת הסטודנטים (אתם יודעים מאיזה פקולטה) שלא הפסיקו להרעיש, זה היה ממש מביך ומקומם לראות איך לא נותנים לה לדבר לפעמים - הרגיש קצת כמו כיתת מב\"ר\n \nשעורי הבית: \nממש קלים ועוד הייתה אפשרות להגיש בזוגות, לפעמים היה רק תרגיל 1 להגשה אז לא ברור בכלל איך אמורים לעשות אותו 2. בכל מקרה בדיחה \n\nהמבחן: \nהמבחן היה לא נורא אבל אופיר מרצה חדש והמבחן לא תאם מבחני עבר כל כך. בסך הכל מבחנים של מרוכבות חוזרים על עצמם ודי קלים אז פשוט תעשו מבחנים \n\nהשורה התחתונה: \nקורס קל, מעניין ויפה סך הכל אבל הוא רק 2.5 נקז אז אין צורך להשקיע לאורך הסמסטר", "timestamp": 1679904055260}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה ממש טוב, אווירה נחמדה בהרצאות ומעביר את החומר בצורה טובה ומסודרת. חבל בעיניי שלא נכנסים טיפה יותר לעומק של הדברים וחלק גדול מהקורס מסתכם בלזכור בעל פה.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמתרגלת סה\"כ טובה ומסודרת.\nשעורי הבית: די סבבה.\n\nהמבחן: \nהיה מעצבן בעיקר\nהשורה התחתונה:", "timestamp": 1712392186993}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: \nבא להעביר את החומר בצורה הכי טובה שהוא יכול, כתב מזעזע אבל אם מבינים אותו החומר ברור מאוד\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nטסה על החומר היה לה קשה להספיק בשעה של תרגול כי יש מלא חומר\nשעורי הבית: \nמתחילים נחמד ואז הופכים לבלתי אפשריים. קיבלנו ציונים על התרגילים הראשונים שבועיים לפני המבחן\nהמבחן: קשה, מלא בטריקים קטנים שנתנו להם 5 דקות בהרצאה. \n\nהשורה התחתונה:  קורס שאמור להיות 4 נקז נדחס ל2.5", "timestamp": 1712474521429}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: הרצאות מיותרות, דניאל רק מוכיח משפטים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יורם מתרגל אחלה\n\nשעורי הבית: \n\nהמבחן: אם דינאל רבייב המרצה- מיותר ללמוד, הכל רק טריקים, אין קשר לחומר, ואין פקטור\n\nהשורה התחתונה: עובר בינרי", "timestamp": 1713465900818}, {"author": "R", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דורון\nחוות דעת - הרצאות: מרצה אחלה\n\nשם המתרגל/ת: מרינה קרש\nחוות דעת - תרגולים: מתרגלת טובה, קצב סביר שאפשר להבים במהלך התרגול\n\nשעורי הבית: קשים, לרוב רפרנסים\n\nהמבחן: עוד יותר קשה, סגנון ההשאלות לא דומה לש\"ב או מה שעשינו בתרגול ולא דומה למבחני עבר בקושי, בסוף נתנו פקטור מינמלי כדי להעלות את אחוזי ההצלחה מ 40% ל 80% \n\nהשורה התחתונה: מבחינת חומר הקורס מעניין אבל המבחן במועד א היה ברמת קושי לא סבירה, אם המרצה אחראי אצלכם רבייב אז תהיו מוכנים לממוצע דומה", "timestamp": 1713908432913}, {"author": "קומסי קומסה", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: סך הכל ההרצאות היו סבבה לדעתי. דניאל יודע את החומר כמו שצריך והצליח להעביר אותו די טוב.\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: משקיע ממש, רואים שחשוב לו שנבין את החומר. הוא מתעכב הרבה על כיווני חשיבה לבעיות, ולא ישר רץ לפתור. לפעמים נותן גם טיפים לחיים. מומלץ בחום!\n\nשעורי הבית: גיליון שבועי, רק שאלה או שתיים להגשה. די סימפטי, לא לוקח יותר מדי זמן. ממליץ לעשות את הפרוייקט אם יש - הוא נותן מגן נוסף שכן לוקח זמן אבל לדעתי זה שווה את ההשקעה.\n\nהמבחן: המבחנים של דניאל ידועים כקשים, והמבחן הסמסטר לא היה שונה מהבחינה הזו. היה הרבה אלגברה מגעילה סתם, וחבל. לדעתי היה הוגן, אבל לא נחמד במיוחד.\n\nהשורה התחתונה: קורס נחמד, מבחן מציק.", "timestamp": 1713990128465}, {"author": "זועזעתי", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \n לא יודע את החומר בקטע מביך.\nוהדוגמאות שלו שהוא מתעקש להמציא על המקום כל הזמן לא עובדות כדי ללמד את מה שהוא רוצה. בזבוז זמן, נצלו את ההרצאות שלו כדי להשלים שעות שינה ותלמדו מספר או משהו\n\nשעורי הבית: \nלא נורא\nהמבחן: \nלא בודק הבנת חומר, אלא טריקים חסרי פואנטה של רבייב, אחר כך בבדיקה מורידים נקודות על הוכחות נכונות ולא מקבלים ערעורים. \nכנראה שלרבייב יש אגו שברירי\nהשורה התחתונה: \nהחומר מעניין לו רק היה מרצה אחראי עם שכל היה יכול להיות קורס אחלה, חבל מאוד.", "timestamp": 1714509294679}, {"author": "2", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מה יש להגיד שעוד לא נאמר? אחלה של הרצאות אבל מבחנים קשים\n\nשם המתרגל/ת: נסים ברנאסי\nחוות דעת - תרגולים: תרגולים מעולים, מספיק את כל התרגילים בצורה מובנת\n\nשעורי הבית: שאלה אחת או שתיים כל שבוע, מייגע אבל מכין יחסית למבחן\n\nהמבחן: קשה אבל בצורה אחרת ממה שחושבים. יש נטייה להקשות בדברים שלא קשורים לחומר עצמו, אלא אלגברה שמסבכת/מספרים לא נוחים שמאריכים את הפתרון.\n\nהשורה התחתונה: קורס חובה, החומר מעניין אבל לא פשוט.", "timestamp": 1715155366265}, {"author": "))):::", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: בין המרצים הגרועים שנתקלתי בהם. החומר מעניין אבל הוא מעביר אותו בצורה הכי משעממת שיש, עדיף ללכת לדורון במקום או לצפות בפקל של אלחנדרו! \n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: בינוני\n\nשעורי הבית: אחלה\n\nהמבחן: עדיף שלא אדבר\n\nהשורה התחתונה: קורס עם פוטנציאל להיות מעולה רק שחבל שדניאל הוא האחראי", "timestamp": 1715696706311}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nאוי ואבוי \n\nשם המתרגל/ת: נסים\nחוות דעת - תרגולים: \nיש רשימות מודפסות של יורם אין על יורם\n\nשעורי הבית: \nלא דורשים יותר מדי זמן\n\nהמבחן: \nסדר גודל של בלתי אפשרי. רק עובר בינארי\n\nהשורה התחתונה: \nאיכס פשוט איכס", "timestamp": 1715753657755}, {"author": "Mordechai Sambol", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אופיר דוד\nחוות דעת - הרצאות: ממש טובות. בניגוד למרצים אחרים שלימדו בצורה מאוד חדואית, אופיר ממש השקיע בלהסביר את הרעיונות והעקרונות מאחורי כל דבר. וגם איך ולמה בכלל הגיעו לאותו דבר. לא צריך את כל ההגדרות המתקטננות כי בסוף משתמשים בעיקר במשפטים המרכזיים, ואם מבינים אותם אז כל החומר יכול להתיישב ממש טוב. נהניתי בהרצאות ואהבתי את צורת הלימוד והישירות.\n\nשם המתרגל/ת: דר. קרוש-ברם מרינה\nחוות דעת - תרגולים: תרגולים מעולים. בהחלט הוסיפו ועזרו לי לעבור מהחומר שבהרצאות לפרקטיקה שבפתירת תרגילים.\n\nהמבחן: היה קשה מאוד, ממוצע 54 ונתנו פקטור רק של 5 נקודות. \n\nהשורה התחתונה: קורס מאוד מעניין. כדאי להשקיע בהבנה של המשפטים המרכזיים, אבל גם חשוב עבור כל דבר שלומדים לראות שאתם יכולים לעשות את אותו דבר (כמו פיתוח לטור לורן) ולא רק יודעים מה הנוחסה.", "timestamp": 1716139089319}, {"author": ".", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוחמד אבו חאמד\nחוות דעת - הרצאות: \nטוב מאוד! מסביר בבירור ובסבלנות. מכיר את החומר לעומק. הרצאות שעוברות בטוב\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמבולגנת ומסבירה במעגלים לפעמים, אבל טובה.\nשעורי הבית: \nלא ארוכים ולא כל כך קשים.\nהמבחן: \nמאוד מאוד טריקי. ההרגשה הייתה שנבחנו יותר על טריקים של החומר מאשר על ידע.\nהשורה התחתונה: הרבה חומר ביחס ל 2.5 נק\"ז. עם סגל אחראי יותר אולי הקורס היה עובר בשלום...", "timestamp": 1716199941797}, {"author": "לניה", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מעולה בהרצאות, איום במבחנים. לא ברור לי איך פיצלו את הקורס הזה מקורס משולב עם פורייה לקורס ברמה של 2 נקז שמרגיש כמו 5 נקז.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: לא ניגשתי למועד א' אך שמעתי שהוא היה קשוח.\nכן ניגשתי למועד ב' והוא היה זוועה. רבייב ממציא את הגלגל מחדש כל פעם שהוא כותב מבחן.\nניפגש בקורס חוזר\n\nהשורה התחתונה: עושים כי צריך, לא כי רוצים.", "timestamp": 1716363203953}, {"author": "-", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה:  מוחמד אבו חומד\nחוות דעת - הרצאות:  שולט היטב בחומר, יודע מה הוא עושה. \n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מאוד טכניים.\n\nשעורי הבית: סבירים\n\nהמבחן: \nאין קשר בין המבחן לתרגול. הרוב המוחלט זה טריקים ושטיקים, כמו פיתוח טור, הרבה מאוד אלגברה ופחות דברים שנותנים עליהם דגש. בסופו של דבר ד\"ר רבייב בונה את המבחן איך שהוא רוצה.  \n\nהשורה התחתונה: מומלץ לעבור על הרשימות של רבייב. \n*לא מומלץ כקורס בחירה*", "timestamp": 1716365873889}, {"author": "קורסמתעתע", "difficultyRank": 3, "generalRank": 1, "semester": "202302", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: אז אני אנסח את זה ככה, בהתחלה דניאל נותן רושם של בן אדם נחמד שאוהב את הסטודנטים. ואחרי המבחן אתה מבין שדניאל לא רק לא נחמד, הוא לא אוהב אף סטודנט ומחפש להכשיל אותו. לא הגיוני שלומדים סמסטר שלם חומר של **מרוכבות** ובסוף בוחנים אותך על טריקים מסריחים שלא קשורים לחומר\nפשוט אני לא מבין את הבן אדם הזה, יש כל כך הרבה דברים שאפשר לשאול במבחן אבל הוא בוחר לבדוק אותך על נישות קטנות ומגעילות\nשלא נדבר שהבדיקה של הסגל הייתה פשוט בושה\nעל כל דבר קטן מורידים ניקוד\nאתה יכול לעשות שאלה פתוחה פרפקט מושלם ברמה כאילו פורייה וגאוס באו ופתרו אותה בעצמם, ועדיין הם יחפשו על מה להוריד לך\nהחומר לדעתי ממש נחמד ומעניין, אבל האופן שהקורס נוהל גרם לו להיות מבאס, בדגש על האופן שהמבחן נבדק\n\nשם המתרגל/ת: יורם בזום\nחוות דעת - תרגולים: יורם בסמסטר שלנו עשה גם זום\nלא אהבתי אותו בכלל\nהבן אדם דופק לפעמים הרצאות על כל מני דברים שלא קשורים לתרגול עם \"העצות לחיים שלו\" כאילו הוא מינימום עכשיו איזה פסיכולוג הוא דוקטורט.\nהוא נתקע על כל דבר קטן ושולי שעה, ובקושי מתרגל שאלות בתרגול בגלל זה (שגם ככה קצר). שלא נדבר על זה שהוא מרשה לעצמו להמשיך את התרגול 20 דקות אחרי כאילו אין קורסים אחרים\nקיצר יותר מדי בעיות עם הבן אדם\nהדבר היחיד שאהבתי אצלו זה הסיכומי תרגול שלו שלדעתי ממש טובים\nמסכמים את המשפטים ושאלות שמשפרות הבנה\n\nשעורי הבית: לא ארוכים\n\nהמבחן: \nלדעתי תלוי מי המרצה שלכם, פתרתי מבחני עבר והם היו מאוד הוגנים ובודקים הבנה של החומר. המבחן שלנו היה שונה לחלוטין, בדק טריקים קטנים אלגברים שנועדו להוריד ממוצע ולא מעבר\n\nהשורה התחתונה: קורס עם פוטנציאל להיות אחלה, בסוף יצא פח", "timestamp": 1716408216855}, {"author": "ֶ;", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: \nמרגיש כמו חדוא 3. יש איזה איזון מסוים בין תאוריה לפרקטיקה שמרגיש מהבחינה הזו בין חדוא 2 לחדוא 1 בקטע הזה. \n\nסה״כ די מעניין ומועבר סבבה. \n\nשם המתרגל/ת: נסים  \nחוות דעת - תרגולים: \nמסביר סבבה אבל רץ על החומר, כותב קטן ובמלא צבעים אז אם איבדת לשניה מה הוא אמר התרגיל אבוד ועדיף לא להתאמץ ולחכות להבא. \n\nהרשימות של התרגולים בסדר אבל מדלגים על מלא שלבים בהסברים אז זה קצת עבודת מחקר להבין מה הם חשבו שכל-כך קל לראות שהם אפילו לא ציינו אותו. \n\nשעורי הבית: \nלא מאוד עקביים ברמת הקושי, יש שיקחו 40 דק ויש שיקחו שעות. אין לדעת. \n\nאפשר להגיש בזוגות \n\nהמבחן: \nצפינו שיהיה לא צפוי אבל עדיין הופתענו מכמה לא צפוי הוא היה. במועד א מחזר 2 אמריקאיות ממבחנים של מרוכבות והתמרות אבל את כל השאר המציא מחדש. בתכלס הרגיש שכמעט כל שאלה ראינו בעבר אבל הוא מצא דרך לסבך אותה \n\nהשורה התחתונה: \nקורס שעוד צריכים להבין איך מעבירים אותו כמו שצריך, לא אפוי מספיק", "timestamp": 1716453092667}, {"author": "s", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  דניאל רבייב\nחוות דעת - הרצאות: \nרבייב מרצה טוב יחסית, יש רשימות הרצאה\n\nשם המתרגל/ת: יורם /נסים\nחוות דעת - תרגולים: בהתחלה אצל נסים, אחרי זה אצל יורם\nהתרגולים של יורם תמיד נגמרים באיחור, הוא מסביר טוב ועוזר בשיעורי בית אבל לא מספיק המון\nנסים מסביר טוב אבל היה תמיד חצי תרגול מאחור בחומר וזה ממש הקשה בפיתרון שיעורי בית\n\nשעורי הבית: \nסבירים ביותר שאלה/ 2 בשבוע. \nהמבחן: \nהיה לנו מבחן מזעזע, שאלות פתוחות שונות ממה שראינו בדר\"כ וגם אמריקאיות מלאות בחישובים מוגזמים\nאפילו המעט שהצליחו לפתור הכל לא קיבלו את כל הניקוד כי הבדיקה הייתה מכסחת  \nהשורה התחתונה: הקורס נחמד, כנראה קצת מיותר אבל הוא בפוטנציאל סבבה.\nרצוי לא להיות עם רביייב כמרצה אחראי כי הוא מכסח בבדיקה ומוציא את כל מה שטוב בקורס", "timestamp": 1716555310468}, {"author": "קושי גורסה", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוחמד \nחוות דעת - הרצאות: \nלדעתי מוחמד העביר את החומר בצורה הכי טובה שאפשר. רוב הזמן הוא נצמד לרשימות של רבייב, אבל מדי פעם היה מוסיף הסברים משלו שמאוד עזרו לקבל אינטואיציה. עם זאת, בסוף הוא היה צריך בעיקר ללמד כפי שרבייב החליט - בצורה חפיפה שזורקת עליך מלא טענות עמוקות בלי באמת לטרוח לתת הסברים מספקים. אני יודע שמדובר בקורס מתמטי למהנדסים אבל עדיין הרגשתי שאין מספיק רמה. אני בטוח שמוחמד היה מעביר את החומר בצורה הרבה יותר מוצלחת תחת מרצים אחראיים אחרים וזה חבל.\n\nשם המתרגל/ת: נאסים \nחוות דעת - תרגולים: \nמתרגל טוב, מסביר ברור\n\nשעורי הבית: סבירים, מדי פעם היו מעצבנים\n\nהמבחן:\nניגשתי לשני המועדים ושניהם היו מוגזמים, הרבה מהשאלות דרשו פעלולים מתמטיים מעצבנים ולא קשורים, לא ממש הרגשתי שאני נבחן על החומר. רוב התרגילים שרואים בתרגולים ובגיליונות לא מתקרבים לרמה של המבחן, אם אתם רוצים להצליח במבחן של רבייב במרוכבות, לדעתי הכי חשוב לעבור על הדוגמאות ברשימות שלו ולתרגל מבחני עבר שלו, במיוחד את שני המועדים במחזור שלנו.\n\nהשורה התחתונה: אם יש אופציה - מאוד מומלץ לא לקחת את הקורס עם רבייב.", "timestamp": 1716720584658}, {"author": "שניר חן", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלעד דורון\nחוות דעת - הרצאות: מרצה ממש מומלץ - מאוד אכפתי ומאוד חד. הוא גם יחסית צעיר אז יש איתו אווירה נחמדה וכיפית. \n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: יורם הוא דמות..הוא בחור מצחיק עם אמירות השויות לפעמים יש כאלה שמתחברים ויש שפחות אני אבל מאוד אהבתי. הוא מאוד נכנס לאינטואיציה ולמשמעות של דברים ואוהב להסביר הכל באופן ויזואלי עם גרפים, שרטוטים וכו' מה שהופך את הקורס שיחסית למאוד הבנתי ומעניין.\n\nמה שכן הוא אוהב לגנוב כמה דקות בסוף כל תרגול\n\nשעורי הבית: הוגנים\n\nהמבחן: היה מבחן ממש קשה לתקופה של מלחמה וקורס פיילוט (ממוצע 54 אחרי פקטור). \n\nהשורה התחתונה:", "timestamp": 1716744918606}, {"author": "snir Rozner", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אופיר דוד\nחוות דעת - הרצאות: \nאופיר מרצה מצוין. בהתחלה היה לו חשוב ממש שנבין את המשמעות של הדברים וזה תרם לזרימה של החומר בהמשך. לאופיר היו רשימות הרצאה מוקלדות מסודרות נהדרות ואפשר היה להקשיב כמו שצריך במהלך ההרצאה. \nשם המתרגל/ת: \nגיא\nחוות דעת - תרגולים: \nאתחיל בזה שהתרגול היה ביום שני כשההרצאה בחמישי ובשמונים אחוז מהקורס זה גרם לזה שהוא הקדים את ההרצאה (הסמסטר התחיל ביום שלישי) - זה הפך את התרגולים לדי מיותרים מבחינתי כי פשוט לא היה לי מושג על מה המתרגל מדבר מהסיבה הפשוטה שעוד לא למדנו את זה. \nעל סמך התרגולים שהייתי (ומהפומו הייתי כמעט בכולם) גיא ממש נחמד אבל היה קצת מבולגן לטעמי. בתרגול של שעה שגם ככה לחוץ, הבלאגן רק גורע ובקושי הספקנו שאלות. גיא לא עבד עם קבצי התרגול של המתרגל האחראי והיה קצת קשה לעקוב. הוא העלה את המצגת עם השאלות (שאת רובן בכלל לא הספקנו לפתור בתרגול) ואת טיוטת הפתרון שלו אבל לא מעט פעמים היו טעויות בטיוטה…\nשעורי הבית: \nיש גיליון להגשה כל שבוע. מתוך 5 שאלות ברוב הגיליונות הייתה שאלה אחת להגשה. בסה״ה הגיליונות היו סבירים אם היינו מספיקים יותר משאלה אחת בלחץ בתרגול. היה ממש קשה לגשת לתרגילים בגיליון כשפשוט לא ראינו תרגילים לפני… בהרצאה עושים מעט דוגמאות וגם הן ממש בסיסיות ובתרגול פשוט לא מספיקים כלום. \nהמבחן: \nזוועה וזיוועון. דבר ראשון המבחן היה *לפני* סוף הסמסטר כשעוד היו לנו מטלות חובה להגשה בקורסים אחרים. ועכשיו לעניין המרכזי - לא ראיתי רמה כזו של זלזול בסטודנטים באף קורס אחר שעשיתי. המבחן היה לא קשור בכלל למה שלמדנו והוא בדק את היכולת לעשות טרינום עם מספרים מזעזעים או להבין שצריך להסתמך בשאלה 3 על מה שהוכחנו בסעיף 2 (?!) ולא על לדעת את החומר של הקורס. המבחן היה לא דומה בכלל לשום מבחן בקורס מרוכבות והתמרות שהיה לפני למרות שזה אותו מרצה אחראי והיה ביזיוני. \nהשורה התחתונה: \nאם דניאל רבייב מרצה אחראי להתרחק כמו מאש.", "timestamp": 1716829046628}, {"author": "נפגעי רבייב", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מונוטוני ומשעמם ולא הרגשתי שמה שהוא עשה היה רלוונטי לחיים שלי בשום צורה\n\nשם המתרגל/ת: נסים\nחוות דעת - תרגולים: הוא באמת בן אדם טוב וחמוד אבל שום דבר ממה שהוא לימד לא היה רלוונטי למבחן (פיזית כלום) בעיני אין מה ללכת לתרגולים או הרצאות רק תראו את הפקל של אלחנדרו כל הסמסטר ואתם תהיו מוכנים למבחן (אם יש חומר תיאורטי שלא יושב לכם תחפשו הרצאות של אליאש ביוטיוב זה בדיוק אותו חומר)\n\nשעורי הבית: סבבה\n\nהמבחן: אני מקווה שקרמה היא אמיתית כי יום יבוא ורבייב יקבל את מה שמגיע לו.\nאתה יכול להגיע למבחן ספץ בחומר מבין הכל יודע לפתור את כל התרגילים ואת כל הטריקים ואז רבייב יביא לך שאלה מהגיהנום ותצטרך לשבת ולהנדס לאחורה מה הוא רוצה ממך בכלל ואיך לפתור את הפלא הזה.\nהבן אדם לא בוחן על החומר הוא בוחן על כמה אתה נכנס לראש של רבייב אם אתם מצליחים להגיע לפרק של הפיגמות ולמצוא את התעלה לראש של רבייב במקום טל מוסרי אתם תצליחו במבחן\n\nהשורה התחתונה: זוועה זוועה זוועה באמת הכל בגלל רבייב", "timestamp": 1716969517644}, {"author": "(:", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: סך הכל טוב לבוא להרצאות, מעביר את החומר בצורה יחסית יבשה אבל זה עוזר להבין את הקורס \n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: ראיתי את התרגולים מוקלטים, עוזר לעשות פאוזים כשהקצב מהיר מדי. סך הכל עוזר\n\nשעורי הבית: \n\nהמבחן: מבחן לא קל בכלל ולא תמיד קשור לתרגולים והשיעורים\n\nהשורה התחתונה: קורס קשה יותר וגוזל יותר זמן מקורס ממוצע של 2.5 נקז", "timestamp": 1717102051471}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דורון\nחוות דעת - הרצאות: אחלה דורון\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: \nאחלה מתרגל\nשעורי הבית: \nסבבה\nהמבחן: \nהמבחנים קשים אבל זה מילא, מעבר למבחן עצמו שמאוד קשה הבדיקה מאוד לא הוגנת, כשעל טעויות קטנות שהן לא קונספטואליות מורידים את כל השאלה למרות שזה לא טעויות שקריטיות לפתירת השאלה, במועד ב זה היה מוגזם בכל קנה מידה ובגלל זה זה גרם גם ל9 פקטור (שזה קיצוני למבחן מועד ב) ועדיין עם ציונים ברצפה, כשמראש המבחן היה מאוד טריקי והרבה יותר קשה ממועד א, וכשבכל השאלות הפתוחות היית צריך \"להמציא את הגלגל\" וואלה מבאס איך שהתנהלו המבחנים אצלנו ומאחל לכם אחרת\nהשורה התחתונה: \nלא מלג מומלץ", "timestamp": 1717138312450}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nסתם מרצה גרוע, באמת כאילו רק לקרוא את הסיכום של ההרצאה וזה יהיה הרבה יותר טוב מאשר להגיע לשמוע מרצה כזה גרוע (שאר המרצים גם מתנסים או סתם גרועים).\nשם המתרגל/ת: נסים בראנסי\nחוות דעת - תרגולים: \nאחלה מתרגל, באמת משקיע ונותן מעצמו ועונה על שאלות ברצון ללמד.\nשעורי הבית: \nשיעורי בית ברמה רגילה ולא קשורים בשום צורה למבחן.\nהמבחן: \nשני המועדים היו מונפצים ברמה פסיכית, מי פגע ברבייב שהוא רוצה ככה לעשות בסטודנטים.\nהשורה התחתונה: \nאני לא מבין מי נתן לרבייב הזה לבוא ללמד פה בטכניון, הוא גם לא יודע להרצות וגם לא יודע לכתוב מבחנים וגם לא יודע לבדוק אותם (אולי אפילו הוא לא יודע לפתור אותם, הוא לא נתן לנו פתרון רשמי וכשביקשנו הוא ענה לנו שהוא לא חייב לנו כלום).", "timestamp": 1717315217941}, {"author": "סובל", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מרצה נוראי סבלתי מכל רגע ממליץ ללמוד לבד מסיכומים\n\nשם המתרגל/ת: יורם הרשע\nחוות דעת - תרגולים: חושב שהוא מינימום פרויד\nבמקום ללמד עושה roast לסטודנטים שהם לא רוצים להבין מהבטן\n\nשעורי הבית: קלים\n\nהמבחן: לא מבייש את השילוב של פסיכומטרי עם מבחן קבלה להארוואד\n\nהשורה התחתונה: קורס נחמד כל עוד רבייב ויורם לא מקבלים שם החלטות\nשבוע טוב", "timestamp": 1717545005596}, {"author": "ליים בת אל", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: מרצה סביר, יש לו רשימות שפשוט מנצחות כל מרצה אחר, והוא גם זה שכותב את המבחן. אם לא הולכים אליו אין למה לגשת למבחן. \n\nשם המתרגל/ת: יורם יחיא \nחוות דעת - תרגולים: אחלה תרגולים אבל לא קשורים לתרגילים של המבחן. כן קשורים לתרגילים של הגיליונות. \n\nשעורי הבית: קשים וקצת לא ברורים, אצלנו היו הרבה טעויות, זו פעם ראשונה שהקורס רץ. \n\nהמבחן: לא הגיוני ולא קשור לחומר שנלמד (הלוואי והייתי צוחקת). במועד ב באתי יותר מוכנה וקיבלתי פחות. \n\nהשורה התחתונה: ללכת להרצאות של רבייב, אם לא אין למה ללכת. אין לאף אחד אחר השפעה על המבחן, אז להסתמך גם רק על הרשימות שלו. ובהצלחה לכל המשתתפים.", "timestamp": 1718532995604}]}