{"posts": [{"author": "Lir", "difficultyRank": 3, "generalRank": 3, "semester": "201901", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: הרצאות שלה לא הכי ברורות לדעתי ודי מבולגנות. אני אישית התקשתי קצת להבין אצלה, אבל מכיוון שזה מרצוע לא קשה בכלל הסתדרתי. יש מצב שאפשר לוותר על להגיע וללמוד מסיכומים. אינ נעזרתי בכמה נושאים בוידאו של אליאש מיוטיוב, אמנם ישנים ושל קורס מדר אחר אבל יכלים לחדד לכם כמה דברים.\n\nשם המתרגל/ת: ילנה פוגרבניאק\nחוות דעת - תרגולים: מסבירה מאוד טוב. נותנת תרגילים טובים. אהבתי.\n\nשעורי הבית: רק במתנט, קלילים יחסית.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: הבעיה עם מרינה בתורמרצה אחראית זה שהיא לא מנהלת טוב את הקורס. מגיעים לתרגילים במתנט בנושאים שלא תורגלו עדיין ולפעמים גם לא נלמדו בכיתה. כל מתרגל מלמד משהו אחר ואין תיאום בכלל בין צוות הקורס.", "timestamp": 1597745090264}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "201901", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: מרצה טוב. מסביר את החומר בצורה ברורה. פותר תרגילים בהרצאות, מוכיח משפטים בצורה ברורה ונוחה. בסוף הסמסטר, עשה גם שיעור חזרה על כל החומר.\n\nשם המתרגל/ת: רועי בר און\nחוות דעת - תרגולים: מתרגל שיודע להעביר במדויק את מה שצריך כדי להצליח ולהבין את החומר. אכפתי ורציני. מומלץ מאוד! לפני המבחן העביר שיעור חזרה שכלל פיתרון של מלא תרגילים קשים במד\"ר. \n\nשעורי הבית: 10 הגשות במתנט מגן. 7 מספיק כדי לקבל את המגן. מעל 75 במתנט מקנה ציון 100. יש גם שיעורי הכנה קלילים ונחמדים. \n\nהמבחן: הוגן. לתרגל מספר מבחנים כמה ימים לפני המבחן, לשלוט בכל הטכניקות ומוציאים ציון גבוה. \n\nהשורה התחתונה: קורס קל יחסית. להשקיע בקטנה לאורך הסמסטר, ואפשר לצלוח בציון גבוה", "timestamp": 1597862734968}, {"author": "Yaakov L.", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nמרצה מעולה, כיף להיות אצלו בשיעורים\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה למתמטיקה בטכניון\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347672748}, {"author": "רותי שושן", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: המצגות מאוד מובנות\n\nשם המתרגל/ת: אפרת אברהם\nחוות דעת - תרגולים: מדהימה! הופכת את החומר לפשוט וברור.\n\nשעורי הבית: \nברמה ובכמות סבירה\nהמבחן: הוגן ממוחזר ברובו\n\nהשורה התחתונה:", "timestamp": 1600931254755}, {"author": "רוניה", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אפשר להסתדר רק עם תרגולים בלי הרצאות ולהוציא ציון סבבה ממש. פשוט לזכור מתכונים לפני המבחן", "timestamp": 1601882431247}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אין סיבה להיות בהרצאות, ממליצה על התרגולים המוקלטים של מרינה\nקורס מאוד טכני", "timestamp": 1602483467749}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: המרצה משתדלת ומעודדת שאלות אבל החומר לא מועבר בצורה ברורה (סמסטר מקוון- מצגות) למעשה מאמצע הסמסטר הפסקתי ללכת להרצאות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: תותח, כאמור משלב מסוים עברתי על התרגולים המוקלטים שלו בלבד וזה הספיק לי לקבל 100 במבחן\n\nשעורי הבית: דעה לא פופולרית- מיותר, לא עשיתי מתנ\"ט בכלל, לא רואה סיבה לשרוף על זה זמן, לקחתי תרגילים של מתרגלים אחרים (אפרת ומרינה) ופתרתי אותם לאחר התרגול המוקלט.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: אל תלכו להרצאות!!!", "timestamp": 1603193925354}, {"author": "Idan", "difficultyRank": 2, "generalRank": 1, "semester": "201902", "text": "שם המרצה: ילנה,יוסי\nחוות דעת - הרצאות: \nמיותר לגמרי. יש משפט אחד בקורס, מלבד זה אין ערך מוסף להרצאות, כל השאר זה תרגול.\n\nשם המתרגל/ת: אפרת, גרשון\nחוות דעת - תרגולים: בחצי שעה של תרגול בשבוע מלמדים הרבה יותר טוב ממה שמלמדים בשעתיים של הרצאה. כמעט הכל זה נוסחאות וטכניקה\n\nשעורי הבית:10% מגן  גליון פעם בשבוע - הגליונות נפתח בלי סנכרון להתקדמות בקורס והם מאוד אנכרוניסטים, לא תורמים לידע לדעתי. מעל 75 מקבלים 100 ואפשר לרפרנס בלי להבין יותר מידי.\n\nהמבחן: \n\nהשורה התחתונה:  קורס זוועה, הרסו את הסילבוס, ומנוהל גרוע מאוד.", "timestamp": 1610553175829}, {"author": "חיים", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: לא לומדים כלום בהרצאות, בתרגולים אפשר ללמוד את כל החומר בפחות זמן וזה הרבה יותר ברור. \n\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: תרגולים מעולים ובן אדם מאוד נחמד, אפילו עושה תרגולי הכנה למבחן. בקורס השנה התרגילים שהוא עשה במהלך הסמסטר ובהכנה למבחן לא היו דומים בכלל למבחן עצמו, קצת סנכרון עם המרצה היה מאוד עוזר. \n\nשעורי הבית: לא באמת מסונכרנים עם הקורס. נורא מעצבן וגם מאוד לא מלמד לעבוד במערכת האינטרנטית שלהם. סימון וי של הסגל.\n\nהמבחן: \nהיה מבחן שלא קשור בכלל למד\"ר, אין מחשבון ודף נוסחאות אבל כן מצפים מהסטודנטים שיזכרו בעל פה וישננו מלא דברים כמו אינטגרלים שונים וכו'... המבחן יותר עסר בהתעסקות באלגברה מאשר הבנה במד\"ר. תחושה שבאו להתנקם בסטודנטים בלי סיבה. המבחן היה הרבה יותר קשר משנים קודמות וכל התשובות היו מתחכמות גם אם פתרת את המד\"ר. \nהשורה התחתונה: \nקורס גרוע, מרצה ממש לא טובה, מבחן לא הוגן ולא קשור לנושא או לתרגילי הבית\\תרגולים. אין סנכרון בין חברי הסגל.", "timestamp": 1613466780930}, {"author": "נדב דויטש", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מבולבלת מאוד. לא העבירה את הקורס הזה הרבה שנים והיה לה קשה להסתגל לשינויים שנעשו בחומר\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: כל עוד רבקה עדיין מתרגלת, תנצלו את זה\n\nשעורי הבית: לא קשה מידי. צריך להגיש 10 מתוך 12 גליונות בוובוורק\n\nהמבחן: \nהמבחן היה חריג ברמת הקושי שלו. 10 שאלות אמריקאיות עם הרבה מסיחים\nהשורה התחתונה: \nאין מה לעשות, זה קורס חובה", "timestamp": 1613496316651}, {"author": "Lio Samueli", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: \nסמסטר מקוון, לא ראיתי בלייב, הרצאות סבירות קצת מיותרות\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרבקה מתרגלת מדהימה לא הרגשתי צורך לחזור להרצאות, מראה בדיוק איך לפתור תרגילים שיופיעו במבחן (לא שזה עזר לנו עם המבחן שנתנו לנו)\nשעורי הבית: \nWEBWORK קלים יחסית, לא לוקחים הרבה זמן\nהמבחן: \nהמבחן שלנו היה מזעזע, 10 שאלות אמריקאיות, רובם על התיאוריה ולא קשורות למה שעשינו בתרגולים. \nהשורה התחתונה: \nבתכלס זה היה אמור להיות קורס קל, החליטו להיות קשים איתנו בסמסטר הזה אבל אין מה לעשות קורס חובה", "timestamp": 1615136285503}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: ההרצאות מתעסקות בעיקר בתיאוריה של החומר, מי שפחות מתעניין לגמרי יכול להסתפק בתרגולים כדי ללמוד את הקורס. יוסי בסך הכל מעביר את החומר בסדר ולא מעבר, אבל כיף להיות אצלו בהרצאות.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה. אם הולכים אליה לתרגולים לגמרי אפשר לעבור את הקורס בקלות\n\nשעורי הבית: גליונות בוובוורק, חלק ממש ארוכים (כמה שעות) וחלק אפשר גם לסיים ברבע שעה. מאוד טכניים, אבל זה כל מה שצריך בקורס הזה.", "timestamp": 1626104421320}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "הרצאות: לא הייתי בהרצאות\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מעולה. מסבירה בדיוק את מה שצריך לדעת ועושה את זה בצורה מסודרת ומובנת לגמרי.\n\nשעורי הבית: לפעמים מעצבנים, אבל סך הכל לא קשים מדי ולא מעמיסים. \n\nהמבחן: ברובו המוחלט הוגן לגמרי, מספיק לבוא רק לתרגולים בשביל להבין את החומר ולהצליח במבחן.\n\nהשורה התחתונה: קורס נחמד מאוד, לא עמוס ולא קשה מדי.", "timestamp": 1627980003253}, {"author": ":)", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "הקורס: הקורס טכני בטירוף.\n\nחוות דעת - הרצאות: \nהרצאות במד\"ר - בגדר המלצה. יש העמקה בחומר שהיא די מיותרת ולא רלוונטית כלל למבחן. מי שאוהב את \"המעבר\" - בהצלחה. אם כבר לראות הרצאות, הרשקוביץ' ביוטיוב נהדר ויוסי כהן מאוד מומלץ אם לא מתחברים.\n\nשם המתרגל/ת: רועי בר-און\nחוות דעת - תרגולים: מתרגל פשוט אלוף. מסכם את החומר ומעביר אותו בצורה ברורה מאוד. בסוף הסמסטר עושה תרגול חזרה מקיף ומחלק סיכום שלו עם כל השיטות לכל סוג של מד\"ר שלומדים.\n\nשעורי הבית: וובוורקים שוטפים כל שבוע ששוברים את הראש ולא מספיקים להבנת החומר.\n\nהמבחן: אם יודעים טוב את השיטות ואת סוגי המד\"רים אין הפתעות.\n\nהשורה התחתונה: ללכת להרצאה הראשונה כדי להבין שהן מיותרות, להקפיד על התרגולים ועל הוובוורקים ולתרגל המון לפני הבחינה.\n\nהמלצה: לקנות את הקורס של גרשון המתרגל בחשבונייה. כל החומר נמצא שם ומסוכם עם דוגמאות ממבחנים, ככה שאפשר ממש ללמוד למבחן בכמה ימים בלי ללכת להרצאות ולהשקיע יותר מידי על הוובוורקים.", "timestamp": 1627980647986}, {"author": "A.A", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "הרצאות: לא ללכת! חבל על הזמן שלכם.\n\nשם המתרגל/ת: רועי בר און + אפרת אבירם\nחוות דעת - תרגולים: רועי מתרגל תותח - בכל תרגול לומדים טכניקה חדשה ופותרים מספר תרגילים מאותו סוג. בסוף הסמסטר הוא מעביר תרגול חזרה שבו הוא פותר תרגילים מתקדמים ומחלק סיכום של כל השיטות לפתרון.\nגם אפרת מתרגלת מעולה (לפעמים הכיתות שלה עמוסות אז שווה לבדוק את רועי) \n\nשעורי הבית: 10 גיליונות WebWork בינאריים (מעל 70 בכל גיליון מקנה 100 אוטומטי). הגליונות ארוכים ומייגעים, אך שווה לעשות את רובם כדי להיות על החומר. שימו לב שלפעמים יוצאים גליונות על חומר שעדיין לא נלמד, אז תציפו את זה בפני סגל הקורס\n\nהמבחן: טכני להחריד. כדאי לתרגל כמה שיותר מבחני עבר ולשלוט בכל הטכניקות. אפשר להוציא ציון גבוה מאוד עם 3 ימי למידה.\n\nהשורה התחתונה: לא להשקיע יותר מדי זמן במהלך הסמסטר - אפשר להוציא ציון גבוה עם כמה ימי חרישה.", "timestamp": 1628182312656}, {"author": "איתמר זייד", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: מדבר לא ברור ונורא מפוזר\n\nשם המתרגל/ת: רועי בר און\nחוות דעת - תרגולים: מסביר את החומר טוב\n\nשעורי הבית:  לא משקפים את הרמה הנלמדת ולא ברורים\n\nהמבחן: \nקשה\nהשורה התחתונה: קורס מזעזע", "timestamp": 1631170302730}, {"author": "ג", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: לא מסביר את החומר מדהים, מאוד קשה לעקוב. מצד שני ההרצאות באמת קצת מיותרות והוא יותר טוב מהמרצים האחרים.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: קצת מפוזרת בהסברים שלה לדעתי, אבל היא כותבת מסודר עם פירוט נהדר של שלבים. אני ממליץ עליה.\n\nשעורי הבית: יחסית לקורסים אחרים של מתמטיקה לא עד כדי כך קשים.\n\nהמבחן: טכניקה טכניקה טכניקה, תפתרו כמה שיותר תרגילים ומבחני עבר לפני ויהיה טוב.\n\nהשורה התחתונה: צריך קצת לחרוש, אבל במבחן אין יותר מדי הפתעות.", "timestamp": 1634644183999}, {"author": "RE", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניזאר\nחוות דעת - הרצאות: סביר, לעיתים קרובות קשה להבין.\n\nשם המתרגל/ת: הקלטות של רבקה\nחוות דעת - תרגולים: מדהימה, תכלסית, ממליץ בחום!\n\nשעורי הבית: Webwork - חופר ולא מאוד קשור לסגנון תרגילים שיש במבחן.\n\nהמבחן: היה מאתגר אבל בסך הכל בסדר, אפשר להוציא ציונים גבוהים, 100 זו לא מילה גסה.", "timestamp": 1635236287552}, {"author": "Ameer Arraf", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: מסודר מאוד ת ממליץ עליו\n\nשעורי הבית: ארוכים\n\nהמבחן: עדיין לא הגשתי\n\nהשורה התחתונה:", "timestamp": 1646564507470}, {"author": "mip", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: לא הלכתי להרצאות- היה משעמם וקשה לעקוב, יש סיכום של כל הרצאה אז מומלץ לראות הקלטה על מהירות מתאימה עם הסיכום.\nקל לזלזל בהרצאות לאורך הסמסטר\n\nשם המתרגל/ת: רועי בר און\nחוות דעת - תרגולים: מתרגל מעולה! מעלה בסוף כל תרגול את קובץ התרגול, מסביר ומפרט את השיטות בצורה ברורה ומסודרת, הוא מעולה גם בזום!\n\nשעורי הבית: לרוב אין לך מוזג מה לעשות, להיעזר ברפרנס וללמוד ממנו, חבל להיתקע\n\nהמבחן: הוגן\n\nהשורה התחתונה: אפשר להצליח", "timestamp": 1658763340285}, {"author": "io", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל מעולה!\n\nשעורי הבית: לא קשורים בכלל לחומר.. מלא שאלות ממש לא קשורות \n\nהמבחן: הוגן\n\nהשורה התחתונה: אני לא למדתי כל השנה כי השיעורי בית הזויים ולא מלמדים, אבל לדעתי צריך להקדיש למבחן מינימום 5 6 ימי למידה כדי שהחומר באמת יקלט טוב", "timestamp": 1658815504462}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: לא הייתי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: רץץץץ ועושה מלא תרגילים אבל לא מתעכב על הבנה עמוקה \n\nשעורי הבית: קליל\n\nהמבחן: קליל, די ממוחזר\n\nהשורה התחתונה: מומלץ", "timestamp": 1659081838691}, {"author": "L", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nההרצאות היו די בסדר מבחינת הבנת החומר\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת נפלאה, מסבירה את נושאים בצורה טובה. בעלת רצון לעזור לסטודנטים ולהספיק את נושאי קורס\n\nשעורי הבית: לא עמוסים לעומת מקצועות אחרים \n\nהמבחן: סבבה הלך\n\nהשורה התחתונה: יש בקורס שעת תרגול אחת שזה חיסרון בו.", "timestamp": 1659109113798}, {"author": "Webos", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ילנה נופברי\nחוות דעת - הרצאות: \nהרצאות קצת מבלבלות ואיטיות, מי שחסר ניסיון בתכנות בכלל שילך להרצאות, מי שלא אפשר לעבור על המצגות של ההרצאה וללכת רק לתרגולים. מי שיתפתה וינסה ללמוד מהקלטות יגלה שילנה מצלמת מגובה הפופיק ורואים 3/4 לוח ככה שקשה ללמוד מהקלטות משהו.\n\nשם המתרגל/ת: עדי שמחי \nחוות דעת - תרגולים: \n10/10, מעולה, מדהימה, מתרגלת שמסבירה ברור ודואגת שכולם יבינו.\nשעורי הבית: \nיש 7 תרגילי בית להגיש, 3 ראשונים די שטויות, קפיצה ברמה, תרגיל 5 ארוך וקשה ו6 קצת פחות קשה אבל הוא על רקורסיה.\nהמבחן: \nיש לרוב 4 שאלות, אחת על הדפסות- שאלות טריקיות של דקויות בשפת פייתון. שאלה על כתיבת פונקציות/פונקציה ומימוש, שאלה על חיפוש בינארי ושאלה על רקורסיה. סה\"כ אפשר לעבור ואם משקיעים אז גם בציון טוב.\n\nהשורה התחתונה: \nקורס חשוב שיכול להיות מעניין.", "timestamp": 1659258263156}, {"author": "אחד שיודע", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nחלק יגידו שההרצאות מיותרות. אני הלכתי לכל ההרצאות וכן הרגשתי את התרומה שלהם להבנת החומר ולהבנת התרגול. \nשם המתרגל/ת:  גרשון\nחוות דעת - תרגולים: \nגרשון רץ בחומר (יש רק שעת תרגול אחת בשבוע...) והתרגול בנוי בצורה כזו של להספיק יותר תרגילים (יותר משאר הקבוצות) ופחות כניסה לעומק של הנושאים. התרגילים השונים שהוא מביא עוזרים להבנת החומר ולפתירת שיעורי הבית.\nאם לא הייתי הולך להרצאות וכל הדברים האלה היו נופלים עליי בפעם הראשונה בתרגול - כנראה שהתרגול היה לא אפקטיבי בגלל הקצב המהיר.\nשעורי הבית: \nארוכים מאוד, לא מסודרים בצורה טובה, לא הכי רלוונטים למבחן.\n\nהמבחן: \nמבחן צפוי והוגן מאוד. קורס מאוד טכני - לתרגל הרבה מבחנים זה סוד להצלחה.\nהשורה התחתונה: קורס שהרגיש מוכחש עד שפתאום נשאר 3 ימים ללמוד למבחן ומקבלים כאפה. לנסות להיות על זה במהלך הסמסטר...", "timestamp": 1659381716051}, {"author": "א", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: הייתי רק באחת. די מיותר אבל אם הוכחות ופיתוחים עוזרים לכם להבין ולזכור אולי שווה ללכת. בתכלס עוברים על כל שיטות הפתרון בתרגול אבל לא מפתחים ולא מוכיחים אז באמת עניין של טעם.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: תותחית. עוברת על הרבה תרגילים בקצב מאוד טוב וסוגרת אותך על כל החומר הדרוש. מאוד ממליץ.\n\nשעורי הבית: וובוורקים מנוסחים בצורה מאוד לא ברורה וכל הזמן דורשים כל מיני חישובי ביניים כדי להראות דרך ולא תמיד ברור מה הכוונה. יש רפרנסים מאוד טובים אבל.\nממליץ לעשות את המינימום הדרוש ולשכוח (8/10 וובוורקים כל אחד 75%).\n\nהמבחן: הוגן לגמרי. צפוי וחוזר על עצמו. תעשו מעבר יסודי על החומר לפני ותפתרו כמה מבחנים ואתם מסודרים. לא צריך יותר מיומיים שלושה של למידה בתכלס.\n\nהשורה התחתונה: קורס מאוד טכני ולא מאוד מאתגר. אני הייתי על החומר כל הסמסטר והבנתי הרוב בלי יותר מדי השקעה אבל תכלס רוב הלמידה העמוקה הייתה בכמה ימים לפני המבחן. מאמין שהייתי יכול לעבור גם עם אותו ציון בלי להקשיב בכלל כל הסמסטר ולחרוש לפני המבחן.", "timestamp": 1659385703011}, {"author": "(;", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לא הייתי \nחוות דעת - הרצאות: לדעתי חבל על הזמן, אין באמת טעם.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין על גרשון. \n\nשעורי הבית: מזעזעים ולא קשורים לשאלות מבחן. יש אחלה רפרנסים וחבל לשרוף על השיעורים האלו יותר מידי זמן.\n\nהמבחן: מאוד הוגן ומאוד חזרתי. לדעתי 3/4 ימי למידה מרוכזים לגמרי אמורים להספיק.\n\nהשורה התחתונה: אישית התעלמתי מקיום הקורס במהלך הסמסטר וסיימתי עם אחלה ציון בעזרת שלושה ימי חרישה, ואני לגמרי לא לבד..", "timestamp": 1659448662410}, {"author": "Is", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: לא הייתי בהרצאות\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: ממש ממש טוב!! הוא עושה את זה מהר אבל תכלס לא צריך להתעכב על כל שטות\n\nשעורי הבית: לרפרנס!!! הם לא קשורים בשום צורה למבחן או לחומר ואין סיבה להתעכב עליהם\n\nהמבחן: ממש סבבה והוגן\n4 5 ימי לימוד ואתם מסודרים, פשוט לתרגל הרבה עד שנכנס לראש\n\nהשורה התחתונה:", "timestamp": 1665229596470}, {"author": "adam shhady", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nלא הלכתי אבל קראתי את הסיכומים היו סבבה למרואת שהרבה אמרו לי שההרצאות סתם בזבוז זמן אבל גילתי שדפקה ללכת אז תנסה בשבעות הראשונים ללכת ולחליט בעצמכם אם זה עוזר לכם או לא\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: \nמתרגל מצוין המצגות שלו מעולות עם פתרונות מלאים והוא תמיד עונה ומשתף פעולה עםהסטודנטים בן אדם מעולה!\nשעורי הבית: \nלא קשים מספיק ציון 75 , הם לא אחד על אחד מול המתרגילים\nהמבחן: \nעדיין לא עשיתי בוטל\nהשורה התחתונה: \nקורס סבבה לא עמוס במהלך הסמסטר", "timestamp": 1676290636503}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: \nסבבה סהכ, נותן יותר דוגמאות משאר המרצים וזה מרגיש כמו עוד תרגול לחומר- מעולה למקצוע כל כך טכני.\nשם המתרגל/ת: \nרועי\nחוות דעת - תרגולים: \nמתרגל מעולה, אין תלונות.\nשעורי הבית: \nשכונה.. לא עוזרים ללמוד בכלל והכל מרופרנס כי הניסוחים של הוובוורקים לא מובנים. \nהמבחן: \nממוחזר וטכני, מעל 75 זה לא בעיה להוציא. \nהשורה התחתונה: \nטכני שצריך איזה כמה ימים טובים של תרגול לפני המבחן והיה בסדר.", "timestamp": 1678914308310}, {"author": "Shira Hanuka", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nההרצאות כן עוזרות להיות על הדברים במהלך הסמסטר למרות שלעיתים הן מאוד תיאורטיות.\n\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: \nרועי מתרגל מעולה ואדם מקסים שמאוד בקיא בחומר ורוצה לעזור לסטודנטים להבין. עם זאת, התרגול בקורס הזה הוא רק שעה ולכן לא מספיקים מספיק שאלות.. רועי נותן שאלות בית- ממליצה בחום לעשות אותן\nשעורי הבית: \nגליונות Ww שחלקם ארוכים מאוד ולא ממש קשורים למבחן\n\nהמבחן: \nהוגן מאוד ויש המון מוטיבים חוזרים. צריך לקחת כמה ימי למידה מלאים ולהטמיע טוב טוב את כל הטכניקות - מי שלומד מצליח בקורס הזה מאוד !\nהשורה התחתונה: \nאחלה קורס ,  התרגול קצר מדי וזה החסרון היחיד", "timestamp": 1679437415523}, {"author": "לפלס", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לא יודעת\nחוות דעת - הרצאות: לא הלכתי\n\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: מושלם,בזכותו עברתי את הקורס\n\nשעורי הבית: לרפרנס חברים\n\nהמבחן: הוגן מאוד חזרתי\n\nהשורה התחתונה: קורס חמוד,תפתרו כמה שיותר מבחנים,כשהתפרסמו הציונים נבהלתי מהציון שלי,הסתכלתי על הסריקה והייתה בדיקה ממש לא הוגנת,היגשתי ערעור,הוא התקבל ועליתי 12 נקודות,אז לא לפחד להגיש ערעור במידה ואתם חושבים שמגיע לכם יותר", "timestamp": 1682427123833}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ילנה \nחוות דעת - הרצאות: יחסית מונוטוניות, אבל אם לא מבינים את החומר עד הסוף כדאי ללכת להקשיב.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מתרגלת מושלמת! רצה על תרגילים ומדגימה בעיקר את הטכניקה מאחורי פתרון של כל מד\"ר. חבל שיש רק שעת תרגול אחת בשבוע.\n\nשעורי הבית: וובוורקים, 10% מגן, 8 מתוך 10, גיליון עם מעל ל-75 מקבל 100. טכניים אבל עוזרים להטמיע את החומר כמו שצריך.\n\nהמבחן: ממוחזר בחלקו הגדול. אם שולטים בטכניקות- אפשר לקבל 80+ בקלות.\n\nהשורה התחתונה: קורס טכני מאוד, חבל שיש שעת תרגול אחת בשבוע.", "timestamp": 1690374008917}, {"author": "Josef Hoene-Wronski", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דר. ילנה פוגרבניאק \n(יש גם את דניאלה)\nחוות דעת - הרצאות: \nבניגוד למה שרשמו פה על שנים קודמות, ההרצאות היו מאוד רלוונטיות. ילנה מדברת בשקט ומונוטוניות אבל עוברת על החומר בקצב הכי מהיר, ולא מתעכבת על שטויות והוכחות. סיימנו 13 הרצאות של חומר ב11.5 הרצאות, בלי לוותר על כלום. מה שכן, ילנה לא אוהבת שאלות של סטודנטים (ואני יכול להבין למה) אז היא יכולה לענות בצורה קצת עוקצנית אבל מצחיקה (\"מניפולציות אין במתמטיקה. מניפולציות יש רק בבנק\"). בגלל זה אין אצלה הרבה אנשים.\nאצל דניאלה לא הייתי אבל שמעתי שהיא מתעכבת על הוכחות ושכל העתודאים מאווירו-חלל הולכים אליה אז יש שם בלאגן של שאלות...\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמה שלא מבינים בהרצאה- מבינים בתרגול. מרינה מסבירה כל מה שצריך ורלוונטי בצורה מדהימה ואפילו נותנת טיפים אקסטרה. באמת שאין לי שום דבר רע להגיד על התרגולים.\nשעורי הבית: \nוובוורקים, 8 הטובים מתוך 10, ואם מקבלים 75< אז זה אוטומטית מעוגל ל-100. הוובוורקים הראשונים, בעיקר 3-4, הם מאוד מתישים וחשיבתיים אבל בהמשך הם נהיים מאוד טכניים וקלים. מה שכן הם די עוזרים להבנה של התרגילים אבל מי שלא רוצה יכול לרפרנס.\n\nהמבחן: \nהיה היום. 3 שאלות פתוחות של 20 נק כל אחת, והשאר אמריקאי. בניגוד לחדוא (1/2/מ) הוגן לגמרי,  ולדעתי הכי קל מתוך 4 מבחנים שעשיתי בסמסטר הזה. מי שפתר וובוורקים והגיע לכן ההרצאות והתרגולים אוכל אותו בשעתיים. היו אפילו לפחות שני תרגילים ממבחנים קודמים, אפילו עם אותם תשובות.\n\nהשורה התחתונה: \nקורס מתנה, מעלה ממוצע. תהיו רציניים כל הסמסטר ותוציאו 90+ במבחן", "timestamp": 1690375436900}, {"author": "Aviva Peimer", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  דניאלה אבידן\nחוות דעת - הרצאות: מלמדת בצורה קצת מבולגנת, אני אישית העדפתי לא להגיע להרצאות\n\nשם המתרגל/ת: מרינה גרוזד\n\nחוות דעת - תרגולים: ממש ממש טובים. מתרגלת מצויינת, ממליצה\n\nשעורי הבית: אין הרבה אבל הם לא ממש מובנים או קלים לפתירה בדר״כ, ממליצה להיעזר ברפרנסים ולשים דגש על לימוד החומר במקום פתרון התרגילים בוובוורקים.\n\nהמבחן: פייר מאוד\n\nהשורה התחתונה: אחלה קורס שאפשר להוציא בו ציון טוב. לא לרפרנס כל הסמסטר וללמוד הכל לטובת המבחן כי זה סתם רעיון גרוע. החשבונייה של גרשון מומלצת כרגיל", "timestamp": 1690440052331}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: בניגוד לכול הנאמר על ילנה, אני אישית התחברתי להרצאות שלה. היא כן קרה, מונוטונית ומדברת חלש אז אני ממליצה לשבת בקדימה כדאי לשמוע אותה. היא כן מוכנה לענות על שאלות אם באים אליה אחרי השיעור או בשעת קבלה, היא סבלנית מאוד ומוכנה להסביר 100 פעם. אבל במהלך השיעור היא לא סבלנית לשאלות שהיא ענתה עליהם במהלך ההרצאה. אז אם משהו באמת לא ברור תשאלו, אבל אם זה משהו לחזור עליו עדיף שתבואו אחרי השיעור. סך הכול היא מסבירה מצויין, לא מבזבזת זמן על הוכחות ופשוט מביאה מלא דוגמאות. אני חושבת ששווה לכם ללכת אליה בהתחלה ולשפוט אותה בעצמכם :) \n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מדהימה!! ממש סבלנית, מסבירה מעולה ופשוט תותחית!! רק בזכותה אני מבינה את המקצוע! נונת טיפים לבחינות שזה היה ממש יעיל.\n\nשעורי הבית: מסבירים בשאלה ממש יפה על דרך פיתרון. אם מקבלים מעל 75 זה נחשב 100 שזה נחמד, שווה להשקיע כדאי להבין את החומר.\n\nהמבחן: המבחן עצמו הוגן ביותר, ילנה ממחזרת שאלות, לעיתים גם אותם ערכים. מי שעבד קשה ולמד, יכול להוציא במבחן ציון מעולה. \n\nהשורה התחתונה: קורס לא עמוס במיוחד, אבל דורש השקעה במיוחד מאמצע הסמסטר אז לא לזלזל בו!!", "timestamp": 1690580193234}, {"author": "Tamar seidenwar", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר \nחוות דעת - הרצאות: לפעמים קצת קשה להבין ולרדת לסוף דעתו. אבל בסך הכל הרצאות מעולות. ניר מסביר טוב ומצליח להעביר בצורה נגישה את החומר. \n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: בגלל שרבקה מתרגלת וותיקה לפעמים נשמעת כמו תקליט שבור. ועם זאת אין לי מילה רעה להגיד עליה. מתרגלת מעולה.\n\nשעורי הבית:  לדעתי חשוב ומומלץ לעשות את הגיליונות בלי לרפרנס\n\nהמבחן: לא פשוט אבל אפשרי, להבין את החומר לעומק ואז לתרגל טכניקה עד צאת הנשמה.\n\nהשורה התחתונה:", "timestamp": 1690648897936}, {"author": "ברנולי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ילנה \nחוות דעת - הרצאות: הגעתי להרצאות עד אמצע הסמסטר, ואז הבנתי שאפשר גם בלי. לא הייתי מגדיר את זה כ\"מיותר\" - כן ממש ממליץ להגיע לתרגול כשכבר נחשתפם לחומר, בין אם בהרצאה ובין אם במוקלט (יש מלא אופציות ביוטיב ובפנופטו אבל לא תמיד החומר תואם ב 100 אחוז לתרגול). אם אתם מסתדרים עם ספרים, אז הספר של מד\"ר של אורי אליאש ממש מקיף וכולל הרבה דוגמאות שעוזרות להבין. כנ\"ל ספר אלקטרוני של סמי זעפרני עם מלא תרגילים שאפשר לתרגל משם\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים:  וואו אין לי מילה אחת רעה להגיד עליה! מסבירה ממש ברור, ממוקדת, מביאה אינספור דוגמאות ודואגת שכולם יבינו. אם אפילו מישהו אחד עושה פרצוף קטן של הלם היא תחזור שוב על ההסבר אפילו בלי שביקשנו. היא גם הייתה מאד קשובה במהלך הסמסטר ולפעמים שאלה אותנו איזה נושאים אנחנו רוצים לשים עליהם יותר דגש. בקיצור, אם יש לכם אפשרות מומלצת בחום, התרגול הכי מועיל שהייתי בו בטכניון.\n\nשעורי הבית: *אין קשר בין הוובורקים למבחן* אני חוזר, *אין קשר בין הוובורקים למבחן*. הוובורקים לא תורמים כהוא זה להבנה האמיתית של החומר, וכל גיליון הוא מאבק ממושך. ממליץ לכם מאד במקום לתרגל ממקורות אחרים, הרבה יותר חשוב. מה שכן, כדאי לפתור / לרפרנס אותם רק כי ציון מעל 75 נותן אוטומאטית 100 שזה מפרגן.\n\nהמבחן: לא היה לי הרבה זמן ללמוד אליו (יומיים וחצי) וזה לגמרי מספיק. השאלות טכניות, חוזרות על עצמן, ממוחזרת, ואם הייתם \"על\" (ותכלס, אפילו אם לא) במהלך הסמסטר אין שום סיבה לא להוציא מעל 90.", "timestamp": 1690866315079}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דניאל \nחוות דעת - הרצאות: הרצאות מבולגנות, הפסקתי ללכת בשבוע 3 ולמדתי את כל הקורס מהחשבוניה. סיימתי עם ציון גבוה ממש. במהלך הסמסטר הקורס מרגיש ממש מסובך אבל במבחן הכל מתהב ובסוף מאוד טכני  \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מלך.\n\nשעורי הבית: יש רפרנרסים אש, לא ללכת על עיוור אבל להבין איתם מה קורה\n\nהמבחן: קל. ממוצע 80, 10% קיבלו 100 עגול \n\nהשורה התחתונה: אחלה מדר", "timestamp": 1690988811042}, {"author": "וי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לא הלכתי \nחוות דעת - הרצאות: הייתי בהרצאה וחצי והבנתי שזה לא מאוד רלוונטי. הסתדרתי נהדר גם בלי. יש רשימות של הכל.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מדהימה. מצליחה להיות גם בקצב איטי שמאפשר זמן לעכל ולכתוב ולשאול שאלות וגם מספיקה לעבור על הכל עם כמה דוגמאות.\n\nשעורי הבית: החלק הקשה כנראה של הקורס (והם קלים). אם אתם החלטתם לא להשקיע בקורס, כן הייתי ממליצה להבין מה הולך בשיעורי בית ולפתור כי הם באמת עוזרים ללמוד את החומר.  \n\nהמבחן: המבחנים מאוד חזרתיים. המבחן קל וקצת השקעה מביאה לתוצאה מאוד גבוהה.\n\nהשורה התחתונה: קל. אבל לא לזלזל עד הסוף כי בסופו של יום צריך לזכור לא מעט שיטות פתרון וחור קטן בידע יכול להיות ההבדל בין 100 ל80.", "timestamp": 1691956495448}, {"author": "התפלגות בינומית שובבה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nסה\"כ, עוזרות להבנה בסיסית. אם במקרה יהיו לכם הרצאות מוקלטות חדשות יותר, אולי שווה לראות במהירות כפולה, ולדלג מדי פעם על הוכחות. הכל בקורס הזה הוא פרקטיקה ותרגול.\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: \nקצרים ביותר, אולי שווה ללכת לתרגול נוסף במהלך השבוע. חייב להודות, לא הבנתי יותר מדי בתרגולים מה קורה, אבל זאת התחלה לכיוון החומר. לדעתי, אין קשר באמת לגלינה, היא מאוד קשובה ומשתדלת שכולם יבינו, והאופי של הקורס מאפשר את זה. בקורס הזה, לא מנסים להטריל או לחפש אתכם בנקודות קשות, רק שתדעו לפתור מדרים, ובגלל זה (לדעתי) שווה בתרגולים להתעכב על תרגיל, גם אם מספיקים לפתור פחות (כמו במקרה של גלינה).\n\nשעורי הבית: \nקצרים, וובורקים שצריך לקבל בהם 75 שמתעגל ל-100. מלמדים את רוב החומר ויסודיים.\nהמבחן: \nהוגן מאוד, דומה לשנים קודמות.\nהשורה התחתונה: \nבמהלך הסמסטר אף אחד לא מבין מה קורה. לקראת המבחן מתחילים לפתור תרגילים ולתרגל, ורק אז ברור שהקורס הוא קצת מגוכח. אם אתם רואים בתקופת מבחנים שיש לכם 4 ימים לפחות ללמוד, אפשר להזניח קצת במהלך הסמסטר ולהפציץ במבחן.", "timestamp": 1692374437495}, {"author": "נעה", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: הייתי פעם אחת והפסקתי ללכת \nשם המתרגל/ת: גלינה \nחוות דעת - תרגולים: גלינה מודעת לזה שאנשים לא הולכים להרצאות ומסבירה את החומר מההתחלה.\n\nשעורי הבית: וובוורק לא קל אבל יש רפרנסים מסודרים מאוד. \n\nהמבחן: אפשרי ממש למי שלמד \n\nהשורה התחתונה: אני הזנחתי את הקורס ממש והיה לי 8 ימים בתקופת מבחנים ללמוד אליו ופשוט למדתי אותו מאפס לבד מסיכומי התרגולים של גלינה והוצאתי ציון גבוה, זה ממש אפשרי ואם יש לכם סמסטר עמוס זה הקורס להזניח", "timestamp": 1695187440582}, {"author": "Tim Manor", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ילנה פוגרבניאק\nחוות דעת - הרצאות: \nהייתי בחצי הרצאה אחת ויצאתי. היא פשוט הקריאה מדף, שגם ככה נמצא במודל, אז אמרתי שאת זה גם אני יכול לעשות לבד. נאמר לי יותר מאוחר בקורס שהיא השתפרה אבל אני לא חזרתי ללכת להרצאות אז לא יודע אם זה נכון.\nשם המתרגל/ת: מריקה קרוש-ברם\nחוות דעת - תרגולים: \nמתרגל ממש נחמדה ומעבירה את החומר בצורה מובנת. לא רצה מהר מדי ומספיקה הכל\nשעורי הבית: \nצריך לענות על 75% מהשיעורים כדי לקבל בהם ציון של 100 ואת כמעט כולם רפרנסתי.\nהמבחן: \nממש סבבה\nהשורה התחתונה: \nאני אחרי חצי סמסטר הבנתי שאני כנראה לא אגש למועד א' כדי שיהיה לי זמן ללמוד למבחן אחר, ככה שאני אגש רק למועד ב'.\nבדיעבד זו הייתה החלטה טובה, מועד ב' היה טיפה יותר קשה, אבל לא ממש למי שעשה מספיק מבחנים. המבחנים די חזרתיים אז אחרי 10 מבחנים כבר די מכירים את כל הטריקים.", "timestamp": 1704703744650}]}