{"posts": [{"author": "Segev", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nהרצאות מעניינות, מרצה מצוינת מאוד מסודרת\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nתירגולים חשובים מאוד , מעט ביחס להיקף החומר.\nשעורי הבית: \n5 גיליונות פתוחים, מתנט די פשוטים. עמוס אבל לא מוגזם.\nהמבחן: \nמבחן מחולק ל2 מועדים.\nהשורה התחתונה: \nקורס לא פשוט, דורש השקעה לאורך כל הסמסטר.", "timestamp": 1598098962411}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה:  דר. לידיה פרס-הרי\nחוות דעת - הרצאות: אחלה מרצה! קצב לימוד ממש סביר, מסבירה את החומר בצורה מעניינת מאוד!\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: קצב לימוד קצת מהיר אבל התרגולים מצויינים, רבקה מסבירה את המשפטים ומתרגלת אותם ממש טוב.\n\nשעורי הבית: לא קשים מדי, עוזרים בהבנת החומר.\n\nהמבחן: מבחן סביר, לידיה ממש מתחשבת.", "timestamp": 1598273136490}, {"author": "מדר אינפי", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: הרצאות מעולות, הרבה דוגמאות פרקטיות לחיים\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מהירה מאוד אבל עוברת טוב על החומר שצריך למבחן. מי שקל לו עם מתרגלים מהירים שילך, שווה.\n\nשעורי הבית: קשים יותר מתרגילים הנפתרים בכיתה ותרגילים ממבחנים, אך עם טיפה שבירת ראש מצליחים. \n\nהמבחן: המבחן הוגן. לעשות מבחני עבר, ולעבור על שיעורי הבית היטב, אין סיבה לא להצליח.\n\nהשורה התחתונה: אחלה קורס.", "timestamp": 1598287542646}, {"author": "ב", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: מרצה מעולה! מסבירה הכל בצורה ברורה ומעניינת במיוחד החלק של האינפי.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: רבקה מהממת, אבל הקצב שלה בהעברת התרגילים מהיר במיוחד אך מסתדרים.\n\nשעורי הבית: רמה בינונית, צריכים השקעה של יומיים (לא שלמים) בד\"כ.\n\nהמבחן: \nבתקופת קורונה; מבחן של שעה בחלק של מד\"ר ושעה של אינפי 2.\nבכל חלק, היתה שאלה \"דומה\" לאחת משאלות שיעורי בית אבל עם שינוי קטן שבפועל עשה שינוי גדול בפתרון.\nהשורה התחתונה: קורס מעניין אבל קשה ודורש השקעה והבנה במהלך הסמסטר כי רוב הנושאים קשורים לקודמיהם...", "timestamp": 1598530586951}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: די מהירה, אך מאוד מסודרת.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מסבירה מהר, אך די ברור.\n\nשעורי הבית: מאתגרים ומאוד עוזרים להבנת הנושאים המועברים בקורס.\n\nהמבחן: צפוף. הקושי העיקרי בו זה הזריזות.\n\nהשורה התחתונה: קורס לא קל, אך מעניין.", "timestamp": 1602406327310}, {"author": "יצחק ספוקויני", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: לידיה מלכת העולם. חריפה, קשובה ומסבירה היטב. \"קורס למתחילים\" לשיטתה אז לא צריך לסבך\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מתנטים קצת מעיקים אבל בסדר, הגליונות קשים יותר מהשאלות במבחנים\n\nהמבחן: \nהוגן, ברמה שאפשר לצפות\nהשורה התחתונה: \nהקורס מפוצל בין מד\"ר לאינפי (יום ככה ויום ככה). ממש מרגישים במבחנים שבעצם נבחנים על חצי חומר.", "timestamp": 1603212537631}, {"author": "לורד וולדמורט", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: לידיה פרס\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרלת מעולה\n\nשעורי הבית: קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: עושים כי צריך", "timestamp": 1603570451114}, {"author": "yg", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה מעולה, מסבירה את החומר באופן טוב.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מלמדת את החומר לאט ובאופן מובן, ולכן מבחינתי הייתה עדיפה על רבקה אבל לא עוברת על כל כך הרבה תרגילים.\n\nשעורי הבית: קשים, אין רפרנס וצריכים כמה ימים של עבודה.\n\nהמבחן: הקושי העיקרי זה חוסר הזמן.\n\nהשורה התחתונה: קורס המהווה בסיס לקורסים הבאים אז כדאי להיות חדים על החומר.", "timestamp": 1613429064116}, {"author": "מדהים, נכון?", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה טובה, מאוד מסודרת, מסבירה את החומר בצורה ברורה.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: אני פחות התחברתי, רבקה בעיני לא מסבירה כזה טוב ורצה מאוד מהר על התרגילים.\n\nשעורי הבית: יש WW שהם די בסדר (15% מגן), ותרגילי בית פתוחים שהם קשים ממש (ו5% מגן). חשוב לעשות את כל הפתוחים ולהבין ממש טוב, כי אחת השאלות במבחן היא בהשראתם. \n\nהמבחן: מזוויע. בגלל הקורונה קוצר לשעה במד\"ר ושעה באינפי, כשיש 2 שאלות בכל חלק. האורך כלל לא התאים לרמת השאלות, ולהרבה הזמן לא הספיק בכלל (הממוצע במועד א באינפי היה 24/50 נקודות, ובמדר 30/50, כשבמד\"ר היה פקטור של 4 נקודות).\n\nהשורה התחתונה: קורס חובה אז אין יותר מידי מה לעשות.", "timestamp": 1614242817320}, {"author": "סטודנטים שלי", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: לידיה מעבירה את החומר בצורה טובה ומסודרת.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: לדעתי מהירה מדי.\n\nשעורי הבית: לא פרופורציונאליים למגן הזעום שהם נותנים, גליון אחד יכול לקחת יותר משבוע, והסמסטר זה היה במכוון על פי רמיזות של הסגל.\n\nהמבחן: פשוט מזעזע, המבחנים קוצרו לשעה בגלל הקורונה, ממוצע 24 באינפי ו30 במד״ר אחרי פאקטור 4 נקודות מסכן, ללידיה ממש לא אכפת שהממוצע נכשל. אם הקורסים היו מפוצלים לא היו נותנים לדבר כזה לעבור, אבל זה מה יש, אטימות קלאסית מבית היוצר של הפקולטה למתמטיקה.\n\nהשורה התחתונה: קורס 5 נק״ז שמבחינת עומס בקלות שווה 7 נק״ז, עם מרצה שמבחינתה ממוצע 24 באינפי זה בגדר הרגיל ולא מצריך שום דבר מיוחד, לידיה נחמדה, זה בטוח, אבל נראה אם תחשבו ככה גם אחרי המבחן שלה.", "timestamp": 1614585498274}, {"author": "סטודנט כללי", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: לידיה מרצה מעולה!. שולטת כמאסטרים בחומר ובשיטת הלימוד.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: התרגולים בסדר, לרבקה קצב שיכול בהחלט לסחרר ראשים אז לא קל לעקוב.\n\nשעורי הבית: גיליונות פתוחים ומתנטים. הגיליונות לא קלים ורמתם לעיתים גם גבוהה מהמבחן. \n\nהמבחן: \nמחולק למד\"ר ולאינפי בשני ימים נפרדים, לדעתי עזר למיקוד בחומר.\nהשורה התחתונה: קורס נחמד (בעיקר החלק של מד\"ר) ולא נשכח להגיד תודה וברכה לגדול מכולם פרופסור אליאש.", "timestamp": 1615483076920}, {"author": "דביבון", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: מרצה טובה מאוד\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת טובה, בוחרת תרגילים קשים מהרגיל ומעט קשה לעקוב\n\nשעורי הבית: נוראיים!!! קשה לא לרפרנס כי קשה להגיש בזמן.\n\nהמבחן: זוועה!!! החליטה המרצה לתת לנו 60% על חומר שלא נלמד בתרגולים או בשיעורי בית ורק נלמד תוך עשרים דקות בהרצאות. שאר ה40% שאלת שיעורי הבית הקשה ביותר.\n\nהשורה התחתונה: לא מומלץ אבל מה יש לכם לעשות...", "timestamp": 1616048826459}, {"author": "גבי", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: לידיה מרצה טובה בסך הכל, מעבירה את החומר בצורה די מעניינת ובאמת אוהבת את מה שהיא עושה. הבעיה שבמבחן היא בוחנת בצורה אכזרית, וכל החמידות שלה עפה מהחלון. אבל אין לנו ברירה אלא לקחת את הקורס הזה...\n\nשם המתרגל/ת: רבקה (אינפי) ואפרת (מד\"ר)\nחוות דעת - תרגולים: התרגולים המוקלטים של אפרת מעולים, עזרו ממש להבין ולתרגל את רוב החומר.\nרבקה מתרגלת שרצה קצת מהר על החומר, אבל מלמדת טריקים ושיטות טובות. עוברים על מה שהיא לימדה שוב, ויש שם הרבה פנינים שיעזרו במבחן.\n\nשעורי הבית: מאוד קשים, דורשים הרבה עבודה ולא בהכרח משתקפים מבחינת ציון המגן שהם נותנים (או כמה שהם עוזרים למבחן עצמו).\n\nהמבחן: מומלץ להתפלל טוב טוב בלילה שלפני. לידיה באה לחסל - וגם אם יודעים את החומר בצורה טובה, עדיין אפשר למצוא את עצמך עובר בקושי (אם בכלל). מומלץ להתחיל עם מבחני עבר כמה שיותר מוקדם בלמידה.\n\nהשורה התחתונה: קורס עמוס עם מבחן קשה. אבל אין ברירה! אז בהצלחה :)", "timestamp": 1616272092182}, {"author": "ניר אלפסי", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מעניינות מאוד , לידיה מסבירה מעולה את החומר\n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: מושלמת\n\nשעורי הבית: קשים מאוד וארוכים כמו הגלות\n\nהמבחן: מועד א היה קשה מאוד ומועד ב' היה כפליים, מאכזב מאוד אחרי סמסטר שלם שנקרעים בעבודות בית בלתי נגמרות .\n\nהשורה התחתונה: אכזבה", "timestamp": 1616361866480}, {"author": "חוזר", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: הרצאות מאוד מעניינות , לידיה מרצה בחסד עליון\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: טסה ברור , מעבירה תרגילים ברמה של מבחן\n\nשעורי הבית: ארוכים מאוד ומקיפים , תעשו לבד\n\nהמבחן: אין זמן לפתור את התרגילים\n\nהשורה התחתונה: דורש את רוב הזמן הפנוי שיש בסמסטר ולא מאוד מתגמל בציון", "timestamp": 1616362499884}, {"author": "הילה", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: עדיף ללכת למישהו אחר או הכי טוב לראות הרצאות של צנזור של החומר שחופף\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nמתרגלת בחסד. פשוט מדהימה.\nשעורי הבית: קשים בטירוף ולא הוגנים ובציונים מכסחים ממש.\n\nהמבחן: \nקשה\nהשורה התחתונה: אם אין ברירה אז אין ברירה", "timestamp": 1625739305574}, {"author": "עוד סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: אמ;לק: בעייני לידיה מרצה ממש לא טובה.\nהסמסטר היה מעורב זום ופרונטלי, ובמשך סמסטור שלם לא שמענו אותה, בכיתה- הקול שלה היה די חלש ורק כשהיא דיברה לתוך מיקרופון זה עזר ובצורה מוגבלת, בזום בכלל אין מה לדבר שמענו ביעקר רעש סטטי כל לאורך כל הסמסטר (שלא לדבר על בעיות טכניות בכל שיעור כמעט).\nמעבירים שעות על גבי שעות של הוכחות מיותרות שרק מסבכות את ההבנה שלך ולא באמת מועילות לשום דבר שנוגע לתכלס.\nוהכי גרוע- בכיתה לומדים חומר \"וטריקים\" ברמה מאוד נמוכה, ואז מגיעים שיעורי הבית והמבחן שבהם מופיעים תרגילים ברמה אחרת לחלוטין מכל מה שראית, במקום להכין אותך ובאמת ללמד אותך דברים אני יצאתי בהרגשה מהקורס הזה שלא הייתי צריך לבוא בכלל להרצאות, להפך סתם דחפו לי חומר מיותר למוח.\n\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים:  רבקה טובה ומהירה כמו שכבר כתבו, חבל ששעתיים של תרגול לא באמת מספיקים, ושוב, המבחנים ושיעורי הבית קשים יותר ממה שעושים בתרגולים.\n\nשעורי הבית: הכי ארוכים והכי מוגזמים (מתישים,מציקים,מגעילים) שפגשתי עד כה, מי שבונה אותם מגזים בצורה פרועה.\n\nהמבחן: שלנו היה בסדר עד כה (חלק של אינפי), שנים אחרות היה הזוי לחלוטין.\n\nהשורה התחתונה: קורס מגעיל שהיה יכול להיות ממש טוב ( החומר נחמד סהכ )", "timestamp": 1626380151386}, {"author": "יוסי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  יוחאי מעיין\nחוות דעת - הרצאות: מרצה מעולה! גם מעניין גם מסביר ברור, מלך!\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים:  קצת משעמם אבל לדעתי מסבירה בצורה הטובה ביותר מי כל המרצים וגם עושה תרגילים ברמת קושי של המבחן ועוברת עליהם מאוד טוב\n\nשעורי הבית:  עמווווססססססססססססססס\n\nהמבחן: המבחן באינפי היה הוגן, מדר עוד לא עשיתי\n\nהשורה התחתונה: קורס עמוס יותר מרגיש כמו איזה 7-8 נקז", "timestamp": 1626693158640}, {"author": "מישהו", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: מרצה נהדר, מסביר בצורה ברורה את החומר אבל לעיתים קצת איטי.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מה יש לומר, אם היא מתרגלת לכו אליה. כן היא מהירה אבל היא עושה תרגילים מצויינים וברמה גבוהה מאוד שמשקפים את הרמה במבחן תוך כדי שהיא מסבירה מצויין.\n\nשעורי הבית: הזויים, ארוכים כמו הגלות לידיה קמה בבוקר ומחליטה להתעלל בסטודנטים!\n\nהמבחן: נכון לשעה זו, עשיתי רק את החלק של האינפי, המבחן היה הוגן ובהתאם לחומר הנלמד. חשוב מאוד לפתור כמה שיותר מבחני עבר ואם אין הזמן אפילו רק לקרוא את הפתרונות כי לידיה ממחזרת רעיונות\n\nהשורה התחתונה: קורס עמוס אבל בהחלט סביל", "timestamp": 1626782820954}, {"author": "Michal Maya", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: תותחית על! מסיברה מעולה ונותנת מלא עצות טובות ןטריקים לאיך לפתור שאלות \n\nשעורי הבית: קשים \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1627292415364}, {"author": "אופק גינת", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה לבבית מאוד, לא מסבירה טוב כמו צנזור אז למדתי מצנזור ביוטיוב ובמקביל מרשימות ההרצאה של עדי כדי להיות במעקב שהחומר חופף\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: אין צורך להכביר במילים רבקה המתרגלת הכי טובה שאפשר לבקש בכל הקורסים המתמטיים של השנה הראשונה\n\nשעורי הבית: גליונות פתוחים ברמה טובה מכינים למבחן טוב\n\nהמבחן: קשה קיצוני, עדי ידועה לשמצה במבחנים שלה\n\nהשורה התחתונה: קורס מעניין ביחס לקורס חובה מתמטי זרם לי ממש במהלך הסמסטר", "timestamp": 1628092422713}, {"author": "שלום היפיוף", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nיוחאי מעיין\n\nחוות דעת - הרצאות: \nמרצה מדהים, עם רשימות מעולות. מסביר את החומר מעולה נותן מלא אינטואיציה. מעביר גם מעניין למרות שבאופן בסיסי החומר לא כל כך מעניין. ממולץ ממש!\n\nשם המתרגל/ת: \nניקה פת\n\nחוות דעת - תרגולים: \nמתרגלת טובה, מאוד מנוסה ונותנת אחלה שיטות וטריקים. אם אתם רוצים מישהי טובה אבל שפותרת בקצב שניתן לעקוב אחריו, ניקה ממש אחלה.\nשעורי הבית: \nהגליונות ארוכים וטכניים מאוד ותכלס מבאסים. הווברקים סבבה.\n\nהמבחן: \nמד\"ר מקצוע טכני בסופו של יום, לעשות הרבה מבחנים. אינפי המבחנים קשים אבל חוזרים על עצמם, לעשות הרבה מבחנים ויהיה בסדר. \n\nהעצה הכי טובה שאני יכול לתת זה לקרוא את הרשימות של יוחאי לפני המבחן, נותן מלא ידע.\n\nשורה התחתונה: \nקורס חובה מתמטי שבנוי די מוזר, ולא ממש מעניין מבחינת נושאים תלכו ליוחאי זה יהיה סביל.", "timestamp": 1628094090363}, {"author": "[", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: לידיה \nחוות דעת - הרצאות: \n\nקורס יחסית למתמטיקה לא כזה קשה וניתן להצליח בו יותר למי שלא אהב אינפי 1מ, אבל הדרך שמעבירים אותו מקשה פי כמה וכמה, עדיף ללמוד בו לבד מהקלטות בקטע הזה \n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: מעולה, ונחמדה להבדיל מהרבה מרצים ומתרגלים בטכניון \n\nשעורי הבית: ארוכים בצורה קיצונית, וובוורקים טכניים שעוזרים אבל נותנים לשבור את הראש בלי להסביר את כל הניואנסים שצריך שם בהרצאות /תרגולים. \n\nהמבחן:  כביכול כולל 6 נק' בונוס ש\"ב, אבל אלה לא באמת שאלות מש''ב לרוב , ואת הנק' בונוס כביכול, מתקנים בבדיקה קיצונית כך שכל טעות קטנה ביותר ואם נגררת יכולה בכיף להרוס את הציון. \n\nהשורה התחתונה: מכסחת בערעורים ובודקת הכל מחדש- לא מומלץ !", "timestamp": 1628787011493}, {"author": "אופק גינת", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: יוחאי אחלה מרצה, משקיע וסבלני\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: קורסים מתמטיים של השנה הראשונה רק רבקה!\n\nשעורי הבית: ארוכים וקשים בקטע מזעזע, אבל יש שאלת שיעורי בית במבחן אז חשובים\n\nהמבחן: קשה אבל פתיר.\n\nהשורה התחתונה:", "timestamp": 1628793330255}, {"author": "אלו", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  דניאל רבייב\nחוות דעת - הרצאות: נחמד מאוד.\nאינפי - משעמם למות (ואני מחסידי אינפי 1)\nמד\"ר - מגניב. תכלס לא לומדים שם שום דבר, רק אומרים כל מיני דברים ואתה אומר אהה ואללה איזה קטע\nנורא אינטואיטיבי\n\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: לא רע. ללכת אליו לכיתה, פחות עובד בזום\n\nשעורי הבית: מופרכים. אין קשר ביניהם לבין מה שהולך בהרצאה\n\nהמבחן: קל אבל שוחטים בבדיקה. שימו לב לכל מילה שאתם כותבים שם\n\nהשורה התחתונה: רק יוחאי", "timestamp": 1629096815263}, {"author": "רוי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: לידיה פרס-הרי\nחוות דעת - הרצאות: בחורה מדהימה, מאוד חביבה מצחיקה ומעבירה את השיעור ממש בכיף לדעתי, יכולת העברת החומר שלה בסך הכול טובה אך מכיוון שהיא מעבירה את הקורס כבר 14 פעם, נוצר מצב שהיא \"יורה\" את החומר לפעמים בקטע מוגזם ושוכחת שהסטודנטים נחשפים אליו פעם ראשונה.\nעונה ל100% מהשאלות(גם במייל), מאוד מאוד מאוד אכפת לה מהסטודנטים, נותנת הערות ודוגמאות נורא חשובות שלא בהכרח תראו אצל מרצים אחרים.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: גם פה, מכיוון שהמרצה כל כך מנוסה ומעבירה את הקורס בפעם ה100 בערך, נוצר מצב שהיא יורה את התרגולים, אבל חוץ מזה אין לי דבר רע להגיד עליה, נורא מקצועית עונה לכל השאלות ונותנת תרגילים קשים בטירוף ככה ששום דבר לא יפתיע אותך בהמשך.\n\nשעורי הבית: לפעמים קצת ארוכים אבל הוגנים, לפעמים יש תרגילים קצת קשים אבל לגמרי לגיטימיים. סביר לגמרי בקיצור לא משהו חריג.\n\nהמבחן: הבחינה באינפי לטעמי קצת יותר קשה מהבחינה במד\"ר, אבל שתיהן הוגנות לחלוטין. מד\"ר אפילו קליל.\n\nהשורה התחתונה: קורס קצת \"דחוס\" בחומר אבל מעבירה אותו מרצה מאוד שקולה והגונה ככה שאין סיבה לא להצליח בו.", "timestamp": 1630334053808}, {"author": "ל", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: נהדרת ומומלצת\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: אחלה יוליה שבעולם, תרגילים ברמה גבוהה ושיעורים שכיף להיות בהם\n\nשעורי הבית: ארוכים ומייגעים קצת עם זאת חשובים להבנת החומר\n\nהמבחן: טכני מאוד, פותרים מבחנים לפני והכל מתחיל לחזור על עצמו. לא נדרשות הברקות מטורפות\n\nהשורה התחתונה:", "timestamp": 1634895988232}, {"author": "Sf", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: טוב. מאוד. מסודר ונעים\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: מדהימה. \n\nשעורי הבית: חביבים, חשוב להקפיד להבין למה הכל נכון.\n\nהמבחן: מפוצל, סה\"כ הגון.\n\nהשורה התחתונה: מד\"ר חשוב", "timestamp": 1641193029945}, {"author": "Y", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מסביר את החלק של האינפי טוב,מד''ר פשוט לא,הרצאות מוקלטות של יוחאי מומלצות\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים:  אחלה תרגולים,קלים יחסית\n\nשעורי הבית:  תחת דניאל,שיעורי בית מאד קשים באינפי 2, מד''ר קלים\n\nהמבחן:  לא דומה לשום מבחן שלידיה עשתה,לא כדאי לקחת את הקורס כשהוא מעביר אותו,מבחן מאד קשה,לא משהו שנצפה בתרגולים ,בשיעורי הבית או במבחנים קודמים\n\nהשורה התחתונה:  אם דניאל מעביר את הקורס ,לא לקחת", "timestamp": 1645634481155}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מאוד מסודר. עבדתי עם הקובץ שהוא כתב בסמסטר קורונה וזה מאוד עזר. בהסברים במדר הוא התבלבל הרבה ובאינפי היה יותר מוצלח. אם יש מוקלט תלמדו משם\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת בין הטובות במתמטיקה. מעבירה תרגילים קשים וגם הספיקה הרבה.\n\nשעורי הבית: 6 מתוך 8 גליונות פתוחים ואחרי \"מאבק\" 12 מתוך 14 בוובוורק. הוובוורקים קשים ולוקחים הרבה זמן. הגליונות יש כאלה טכניים ויש כאלה עם שאלות הוכחה שלוקחים יותר זמן. בסה\"כ רמת השאלות גבוהה בשניהם והם דרשו ממני הרבה זמן בסמסטר.\n\nהמבחן: אחרי הרבה שנים שלידיה הייתה מרצה אחראית קיבלנו את רבייב שכתב מבחן שונה לגמרי שמורכב מהרבה שאלות הוכחה. מבחן קשה צריך ללמוד אליו הרבה זמן.\n\nהשורה התחתונה: קורס עמוס וקשה, לדעתי הכי קשה בסמסטר ב.", "timestamp": 1647211537351}, {"author": "1", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: \nמרצה מעולה מאוד ממליץ, לצערי הוא כבר לא מרצה אבל אם יש מוקלט אז מאוד מומלץ\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה שיש. \nשעורי הבית: ש.ב לרוב ממוחזרים ממבחנים או חלקים מהשאלות, מומלץ מאוד להשקיע השיעורים ברמה הולמת ועוזרים בהכנה למבחן\n\nהמבחן: \nהמבחנים של לידיה בסדר גמור למעט מבחנים יוצאי דופן. \nהשורה התחתונה: \nלרוב אין ממש בחירה אם לקחת או לא אבל קורס שביחד עם השקעה הולמת ניתן בהחלט לקבל ציון יפה.", "timestamp": 1647608232653}, {"author": "Netanel", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: המרצה היחיד שהיה. \nמאוד מדויק, פדנט ונצמד להגדרות. \nמומלץ להשלים חומר פחות מובן בעזרת יוחאי מעיין והחוברת שלו מהדרייב. \nדי רץ מהר על החלק של המדר והרוב למדנו עצמאית. \n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מעולה אבל בקורס הזה לא הגיעה לרמה שרבייב ציפה מאיתנו. \n\nשעורי הבית: קשים ושונים משל לידיה\n\nהמבחן: מאוד חזק על תיאוריה\n\nהשורה התחתונה: יוחאי ורבקה ילמדו אתכם הכי טוב", "timestamp": 1647934311907}, {"author": "Roberto", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה   : דאנייל רבייב\n\nחוות דעת - הרצאות:   שלקחתי אותו לא היה מישהו אחר ללכת אליו, יודע את החומר מאוד טוב אך פשוט לא מצליח להעביר את החומר לסטודנטים כמו שצריך. הכל זה \"קל לראות\" \"ברור ש\" \"ניתן לראות בקלות\" הוא מנסה לענות על השאלות ולהסביר אבל לפעמים לא מצליח.\n\nשם המתרגל/ת: מוקלט של רבקה אביטל.\nחוות דעת - תרגולים: מדהימה ברמות! מלמדת את הכל טוב עם אחלה שיטת לפתור את התרגילים. חוזרת ומסבירה תרגלים ארוכים מההתחלה גם אף אחד שאל ודואגת שהכל יהיה מובן ועונה על השאלות מאוד טוב. מתרגלת תותחית. חבל שלא לימדה בסמסטר הזה (למרות שהיתה האחראית).\n\nשעורי הבית:   (עם רבייב) ארוכים. קשים. ללא תעולת. בודקים דברים שהקורס לא מיועד לבדוק אותם. לא יודע אם היה כידאי להשקיע בהם או לא.\n\nהמבחן:    הגיע רבייב והיה האחראי לפעם ראשונה מאז שהקורס קיים. והתחיל את הסלט: מתקון שונה אין מבחנים דומים. כמעט בלתי פתירים. \"קל לראות\" מההסטוגראמה שיש משהו לא נכון (זה עם תוספת 7 נק' בונוס במועד א' ו ב' לדעתי) \nבודק טריקים אלגברים ודברים שממש לא אכפת לאף אחד מהם!!\n\nהשורה התחתונה: קורס חובה. אך אם רבייב הוא האחראי אז \"ברור ש\" עדיף לדחות אותו!!!", "timestamp": 1649683329438}, {"author": "טיילור", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: זוועה. היה מרצה אחראי ויחיד אצלנו. באינפי היה משעמם, בניגוד לשאר הקורסים שלו אין לו רשימות מסודרות לקורס הזה והוא ממציא הוכחות מהראש. במד\"ר כבר לא הלכתי אליו כי באמת לא ראיתי סיבה לעשות לעצמי את זה.\n\nשם המתרגל/ת: הקלטות של רבקה\nחוות דעת - תרגולים: אפרת היתה מתרגלת יחידה בסמסטר, אישה באמת נחמדה ממש אבל לא התחברתי אליה. תרגילים די קלים ואין רשימות. ראיתי הקלטות של רבקה מהסמסטר הקודם - היא מדהימה, יודעת את העבודה, מביאה תרגילים טובים ושולטת בטריקים.\n\nשעורי הבית: לא קשורים לקורס, למבחן או לכדור הארץ. לא ברור מה רבייב רוצה\n\nהמבחן: פוגרום. שום קשר למבחני עבר (של לידיה), דגש על חומר תיאורטי איזוטרי, שאלות אמריקאיות הזויות וכמובן פתרון רשמי חלקי בלבד.\n\nהשורה התחתונה: אם רבייב מרצה אחראי, תברחו", "timestamp": 1649862823799}, {"author": "Bar David", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: רק הקלטות של יוחאי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  אחלה אפרת\n\nשעורי הבית: עמוסים, לפעמים הגליונות זה סתם לבוא לריב \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657163755203}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "השורה התחתונה: אני פה רק כדי להשחיר אתכם ולספר לכם שבמבחן הסופי תצטרכו לגזור איזה 5 פעם לפחות פונקציות של סינוס קוסינוס ואקספוננט, בהצלחה :)", "timestamp": 1658747421684}, {"author": "סטודנט לחשמל", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יוחאי מוקלט\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: אפרת בלייב השלמות מהקלטות של רבקה\nחוות דעת - תרגולים: אפרת טובה במהלך הסמסטר, לקראת המבחן ראיתי הקלטות של רבקה וככה נחשפתי להרבה תרגילים.\n\nשעורי הבית: \nווב וורק עוזרים להטמעת החומר ולוקחים זמן סביר.\nגיליונות מתישים ומעיקים. יש שאלות טובות ויש שאלות ארוכות בצורה קיצונית שלא באמת תורמות אלא בעיקר שורפות המון זמן. ככה שקשה לתרגל הרבה במהלך הסמסטר ולהפנים את החומר טוב, כי הזמן הולך סתם על הגיליונות.\n\nהמבחן: ארוך. הרבה שאלות התבססו על רעיונות מהגיליונות (ולא רק שאלת ש.ב.) ככה שמומלץ בחום לחזור על הגיליונות לקראת המבחן ולהבין את הרעיונות של רוב השאלות (אולי חוץ מהשאלות התלושות והארוכות בהגזמה שציינתי מקודם).\n\nהשורה התחתונה: לא פשוט ובעיקר מעייף ועמוס", "timestamp": 1659181821328}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה ממש אחלה, נותנת כיוון לאיך החומר יכול להיות משומש בהמשך התואר. ההרצאות מעניינות ונעימות איתה. ממש מתחשבת בכל הסטודנטים שלה.\n\nשם המתרגל/ת: רבקה (הקלטות)\nחוות דעת - תרגולים: רבקה מלכה בכל מובן, היא ממש מהירה אם לא ידעתם כבר מאינפי 1מ או אלגברה אבל יש רשימות שלה בדרייב של חשמל וככה אפשר להיות מרוכז בתרגילים.\n\nשעורי הבית: 7 גיליונות מדר ו-7 גיליונות אינפי בwebwork, רובם סבירים ולא ארוכים יותר מידי (הסמסטר היה צריך 10 בכללי בשביל 10 אחוז מהציון הסופי). \nהיו גם 5 גיליונות פתוחים של שש שאלות שקורעים את התחת (לידיה ממציאה את הגליונות מחדש כל פעם שהיא אחראית על הקורס) ונותנים 5 אחוז מהציון הסופי כאשר מחשיבים את ה-4 הכי טובים.\n\nהמבחן: המבחנים הם מאוד קשים לכן יש צורך עז בפתירה של הרבה מהם כהכנה. מועד א של אביב 2022 לדעתי היה מאוד הוגן אבל המומצע עדיין עומד על 59 (אחלה טכניון).\n\nהשורה התחתונה: קורס מאוד מעניין, מחולק לחלק של אינפי 2 וחלק של מדר. מדר מאוד טכני אבל מעניין, אינפי ברובו ניחושים של פתירה של אינטגרלים מוכללים וטורי פונקציות. תקוו שלידיה במצב רוח נדיב בבחינה שלא תביא דברים לא פתירים.", "timestamp": 1659708278931}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: לא מגיע מוכן להרצאות, מתעקש להכין דוגמאות על המקום.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, נותנת דרכים ושיטות מדוייקות לפתרון תרגילים\n\nשעורי הבית: קשים\n\nהמבחן: סביר. מישור הפאזה תמיד במבחן אבל לא בתרגולים\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660736802140}, {"author": "a", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: לידיה פרס הרי באינפי/יוחאי בהקלטות\nחוות דעת - הרצאות: \nאין ספק שלידיה באמת אוהבת את המקצוע. יחד עם זאת, לדעתי מרצה לא טובה שלא מסבירה את החומר ברור, מתעכבת על דברים לא רלוונטים ורצה על נושאים ש\"למדתם באינפי 1מ\" אבל זה לא קרה מעולם.\nדי מהר עברתי למוקלטת של יוחאי במדר ואצל לידיה נשארתי בגלל הfomo באינפי, שזאת טעות. בסוף הסמסטר הרגשתי שמד\"ר אני יודע ברמה די טובה (הצלחתי את רוב השאלות במבחן) ואינפי אני בקושי יודע (לא הגעתי לחצי מהניקוד על אינפי).\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nמתרגלת סבירה. מצד אחד עונה על שאלות, אווירה טובה וכן מנסה להספיק תרגילים, מצד שני לא מפרטת או מסבירה מספיק טוב או בכלל-ככה שהרבה פעמים צריך להסתכל בתרגולים של אחרים (מוקלטים של אפרת לדוגמה). מצד שלישי, התרגול הוא שעה מדר שעה אינפי שזה מספיק אולי כדי להגיד משאוות דיפרנציוליות רגילות וחשבון אינפינטסימלי 2 ח ואז כבר נגמר התרגול.\nשעורי הבית: \nגיליונות הזייה בכל קנה מידה. סופר קשים, ואין רפרנסים כי לידיה כותבת אותם כל פעם מחדש. מידי פעם גם מתגלה איזה טעות בגיליון. תכינו את התחת, את הראש ואת הזמן לשעות קבלה, כי אחרת אי אפשר באמת להצליח אותם. \nהוובוורקים סבירים, יש יותר קשים ויש יותר קלים.\nהמבחן: \nכמו שאפשר לראות בממוצע, כל ציון מעבר לעובר זה בונוס.\nהשורה התחתונה: \nקורס הזייה שלדעתי גם אמורים לבטל, אין סיבה או קשר לעשות ביחד מדר ואינפי 2.", "timestamp": 1660737644721}, {"author": "Grades", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: לידיה \nחוות דעת - הרצאות: משקיעה ורואים שחשוב לה שהסטודנטים יבינו, אני מתישהו אבל עזבתי כי יש סיכומים מעולים שכתוב שם אחד לאחד מה שהיא מעבירה בכיתה\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: סה\"כ סבירה ומספיקה כמות טובה של תרגילים, אבל בדיעבד לפני המועד ב' הבנתי שביחס למבחנים וש.ב התרגילים שלה לרוב יותר קלים\n\nשעורי הבית: זוועה.\nארוכים ולידיה ממציאה את עצמה מחדש כל פעם אז אין רפרנסים\n\nהמבחן: קשה.\nמועד א' היה סביר(חבל שלא הייתי מוכן) אבל המועד ב' היה רמה אחד מעליו עם תרגילים שחלקם היו ממש סבירים אבל עם 2 תרגילים שבאמת היו רמת קושי יחסית יותר גבוהה ממה שהיה דרוש בשנים האחרונות.\nאם מתרגלים הרבה אז 75+ מובטח אבל תמיד יכולים להביא תרגיל ששווה 25 נקודות שפשוט לא יהיה לך כיוון\n\nהשורה התחתונה: קורס חובה, לא אהבתי במיוחד למרות שהחלקים האחרונים של אינפי(מסדרות פונקציות עד טורי חזקות) יותר מעניין בעיניי.\nהשילוב הזה של מד\"ר ואינפי 2 לא הולך טוב, ומזל שמבטלים את הקורס בקרוב", "timestamp": 1665259504859}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: ממש אכפתית בהרצאות ומסבירה בצורה מאוד נחמדה ומעניינת את החומר, ממליץ ללכת אליה אם יש מקום.\n\nשם המתרגל/ת:  רבקה (מוקלט)\nחוות דעת - תרגולים:  רבקה מספיקה הרבה תרגילים ויודעת להבדיל בין העיקר לתפל, עזרה לי להפנים את החומר בצורה טובה.\n\nשעורי הבית: היו 5 גיליונות להגשה, לידיה כותבת אותם מאפס כל פעם מחדש אז כנראה לא יהיה שום רפרנס אליהם. השאלות קשות אבל עוזרות להפנים את החומר. היו 14 גיליונות webwork כאשר 7 אינפי ו7 מדר, נותנות בעיקר תרגול טוב על החומר כי כן יש טכניקה בפתירת מדר ואינטגרלים מוכללים.\n\nהמבחן: מתפללים לאלוהים שהחלק של אינפי פתיר, רמת קושי של השאלות היא גבוהה מאוד ולכן מאוד מומלץ לעבור על כמה שיותר מבחנים לפני, יש תרגילים שלא תראו את הדרכים לפתרון שלהם בשום מקום אחר.\n\nהשורה התחתונה: חומר מעניין אבל המבחן זה הימור שרוב הזמן מפסידים בו, בהצלחה למי שחובה.", "timestamp": 1666294842431}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לידיה פרץ הרי\nחוות דעת - הרצאות:\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן כמו תחת שלי\n\nהשורה התחתונה:", "timestamp": 1666538837038}, {"author": "D", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: לידיה \nחוות דעת - הרצאות: היא מרצה טובה ואיכפת לה מהסטודנטים, אבל היא טסה מהר מדי לטעמי ובנוסף לא היה מקום בהרצאות ולנסות לעקוב בזום היה זוועה ולא סיפק את הסחורה, מומלץ פרונטלי בלבד.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אפרת כובשת כהרגלה אבל בגלל הבניה המוזרה של הקורס לא הספקנו הרבה תרגילים.  \n\nשעורי הבית: מאוד מאוד קשים.\n\nהמבחן: לא פשוט ונתנו לנו להיבחן במדר ואינפי באותו מועד מה שגרם ללמידה להיות לא רציפה.\n\nהשורה התחתונה: לא מובן למה מאחדים שני קורסים שלא אמור להיות בניהם קשר לאחד של 5 נק\"ז, זה סתם גורר מצב שלא מצליחים להתעמק בכל קורס כמו שצריך, ומדר שאמור להיות קורס טכני, הפך להיות עמוס ולא ברור בגלל הצורה שבה הוא הועבר.\n לפחות המחזור הבא יחזור לעשות מדר בנפרד.", "timestamp": 1667166723348}, {"author": "AmZu12", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: \nתראו מוקלט של מישהו אחר\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: תותחית סופר מומלצת!! יש לה גם אחלה הקלטות\n\nשעורי הבית: \nארוכים באופן מוגזם\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675348672584}, {"author": "איריס שורות", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: \nמי נתן לאלון להיות מרצה אחראי? אין כוחות... מלמד לא ברור ויחסי אנוש יותר גרועים משל החתול שלי. \nהחומר בגדול מעניין אבל אי אפשר ללמוד ככה...\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nאהבת חיי רבקה. לא יודעת איך הייתי שורדת את הקורס הזה בלעדיה... את כל מה שלא הבנתי אצל אלון הבנתי אצלה והיא סגרה לי את כל הפינות החסרות. רבקה מראה הרבה תרגילים, הקצב אצלה מהיר, אבל תמיד תענה על שאלות לא ברורות ותעזור לסטודנטים שמבקשים. רבקה מכירה את המרצים האחראיים יותר טוב מכולם, אז שווה ללכת אליה, יש טיפים שווים אצלה. \n\nשעורי הבית: ארוכים, קשים ומסריחים.\n\nהמבחן: חרא של דבר. פשוט לא היה זמן לסיים אותו... כיסחו רצח בבדיקה. והיו לנו אמריקאיות שזה די חרא... \n\nהשורה התחתונה: טוב שסוגרים את הקורס הזה...", "timestamp": 1676999340915}, {"author": "Tian Han Shen", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ד\"ר אלון דמיטריוק\nחוות דעת - הרצאות: הרצאות הם מובנות , אבל לא מספיקות.\nהדוגמאות שהוא הראה בהרצאות בסדרי גודל יותר פשוטים לעומת השאלות במבחן , ושאלות בשיעורי בית.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: טובות בסך הכל , מאוד עוזרת השעה קבלה\n\nשעורי הבית: \nקשות , וללא רפרנס קיימים בדרייב.\nהמבחן: קשה מאוד , החומר מורכב מיד , וכולל בתוכו יותר מידי דברים כדאי שתוכל לחסות במלאו את הכל חורים של הבנה , והמרצה שואל ספציפית על החורים בהבנה.\n\nהשורה התחתונה:", "timestamp": 1677684159508}, {"author": "Samantha H", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים וצריך השקעה \n\nהמבחן: אם לוקחים את זה עם אלון, תתכוננו למבחן טכני וארוך. \n\nהשורה התחתונה: לא אהבתי את הקורס, טוב שהוא לקראת סיום\nאבל חובה", "timestamp": 1678092768737}, {"author": "ץץ", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "השורה התחתונה: סגל הקורס פשוט לא רוצים שהסטודנטים יצליחו החומר לא כל כך קשה אבל המבחנים קשים מאוד וגם הmoodel של הקורס מזעזעת אין חומר אין מוקלט אין פתרונות מלאים להמבחנים", "timestamp": 1678531149258}, {"author": "טיפוס הומוגני", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק 😑\nחוות דעת - הרצאות: \nפשוט לא.\nהוא כן יודע את החומר טוב, אבל יחסי האנוש הם ברצפה. ברמה שלא נעים לשאול שאלות בכלל. לא אלכלך יותר מדי וגם הבנתי שכבר לא תהיה אופציה אחרת מלבדו עד שסוגרים את הקורס, אז בהצלחה לכם.\n\nשם המתרגל/ת: ד\"ר רבקה אביטל 😇\nחוות דעת - תרגולים: \nמתרגלת כל כך טובה. תעזור לכם להבין את כל הקונספטים המורכבים של הקורס ותתן כללי אצבע טובים. בלי קשר אין על רבקה, הכי חמודה בטכניון.\n\nשיעורי הבית: RUN\n\nהמבחן: \nמי שלוקח אצל אלון... שאלוהים יעזור לכם. האמריקאיות שלו קשות במיוחד, הפתוחות לא הכי קשות אבל המבחן שלו לוקח המון זמן, נורא קשה לסיים את הכל כמו שצריך ב3 שעות לדעתי\n\nהשורה התחתונה: \nקורס ממש הזוי, תכלס לומדים שני נושאים שונים שהקשר ביניהם מקרי בהחלט, ובסוף נבחנים עליהם יחד. מזל שסוגרים את הדבר הזה.\nבהצלחה!", "timestamp": 1678880258175}]}