{"posts": [{"author": "Lir", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: בסמסטר זה הועבר בזום עם מצגת מוכנה מראש. ההרצאות של מרינה דלות והיא מעבירה את החומר לא טוב לדעתי. בנוסף, בתור מרצה אחראית היא על הפנים מבחינה של תיאום והתנהלות אדמינסטרטיבית של הקורס. מצד שני היא מתחשבת וגמישה, אז אם יש לכם נציגי סמסטר טובים הם יכולים די בקלות לקבל ממנהדי בקלות הקלות מסוימות (יש לציין שנדרשו בגלל התנהלות לקויה שלה).\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: הוידאו המוקלט שלה מעולה והיא מסבירה ממש טוב. יש לקחת בחשבון שההקלטו שלה ארוכות בהרבההה ממה שזה אמור להיות בתרגול כיתתי פרונטלי. לוקח ים זמן, מצד שני מאוד ברור.\n\nשעורי הבית: חלקם ממוחזרים משנים קודמות. לא פשוטים כל כך, אבל מאוד מזכירים תרגילים שיש במבחן ולכן כדאי להשקיע בהם ולפתור גם כמה שיותר מהם ומתרגילי הרשות לקראת המבחן יחד עם הפתרון הרשמי.\n\nהמבחן: הוגן\n\nהשורה התחתונה: מקצוע לא קל ודורש המון השקעה. יש הרבה הוכחות, נוסחאות ומשפטים לדעת. אמנם הוא טכני אבל לא טכני קל.", "timestamp": 1597742031099}, {"author": "itai freeman", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: טובה\n\nשם המתרגל/ת:  גרשון\nחוות דעת - תרגולים: מתרגל מצוין\n\nשעורי הבית: ארוכים אבל לא מאוד קשים\n\nהמבחן: פייר\n\nהשורה התחתונה:", "timestamp": 1602069332243}, {"author": "Niv Ben arie", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: אין משהו חשוב בהרצאות מלבד הוכחות של משפטים\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים:  תרגולים של גרשון מאוד חשובים\n\nשעורי הבית: ארוכים מאוד אבל חשובים להבנה של החומר\n\nהמבחן: מפספס את המטרה\n\nהשורה התחתונה:", "timestamp": 1613929076483}, {"author": "....", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: \nלא הייתי\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מסביר מאוד מהר. בהתחשב לשאר האופציות נראה לי שהוא היה הכי טוב מביניהן....\n\nשעורי הבית: בסדר. יש שאלת שב במבחן אז כדאי להשקיע בשלב מסויים\n\nהמבחן: לא פשוט\n\nהשורה התחתונה: קורס לא כיפי", "timestamp": 1614182385175}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מרינה קדוש-ברם\nחוות דעת - הרצאות: לא ברורות ככ\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מעולים- מסבירים הכל\n\nשעורי הבית: דומה לתרגולים\n\nהמבחן: עמוס אך אפשרי\n\nהשורה התחתונה:", "timestamp": 1614541937229}, {"author": "לפלס", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: מרינה קדוש ברם\nחוות דעת - הרצאות: \nלא מסבירה טוב, לא זמינה, ולא הוגנת.\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: \nמסביר טוב את החומר\nשעורי הבית: \nלא קלים בכלל ולרוב לא הולמים מה שנלמד בהרצאה.\nהמבחן: \nמבחן קשה מאוד\nהשורה התחתונה: קורס קשה מאוד, דורש הרבה השקעה", "timestamp": 1615813848985}, {"author": "נדב דויטש", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אבי לוי\nחוות דעת - הרצאות: \nאבי מרצה סביר, בטח ביחס למרינה שלא הצלחתי להבין מילה אחת שלה.\nהוא די מבולגן על הלוח ולא תמיד הכי ברור, אבל אם לא מבינים ומבקשים הסבר הוא מסביר עד שמבינים או מתייאשים.\nיש לו חוברת הרצאות מסודרת ששווה לעבור עליה\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nגרשון מתרגל שהיה מעולה, עכשיו הוא קצת עייף.\nיש לו חוברת עם כל התרגולים ששווה לעבוד יחד איתה.\nיש לו אתר שנקרא חשבוניה ששם הוא מסביר בסרטונים את כל הקורס (ועוד קורסים אחרים), אבל עולה כסף\nשעורי הבית: \nגליונות מהשטן. 4 גליונות חובה מתוך 6 (ציון מגן)\nאחת השאלות מהמבחן היא שאלה שדומה לשאלה משיעורי הבית שאם עונים עליה 75% נכון מקבלים בונוס של 5 נקודות למבחן.\nשווה לעשות אותם הם עוזרים להבין את החומר\n\nהמבחן: \nארוך, קשה ונורא.\n5 שאלות \"אמריקאיות\" לכל שאלה יש 2 תשובות נכונות שצריך לבחור מתוך 8 אופציות.\n4 שאלות פתוחות שמתוכן אחת זה משיעורי הבית, אחת זאת שאלת הוכחה ועוד שתיים שהן \"חופשיות\" שכנראה שגם באחת מהן תהיה הוכחה.\nמרינה פרסמה רשימה של הוכחות שצריך לדעת לשאלת ההוכחה, אבל במבחן הייתה שאלת הוכחה נוספת של משהו שלא היה ברשימה הזאת.\n\nהשורה התחתונה: \nקורס חובה, אין ברירה.", "timestamp": 1627195448840}, {"author": "אני", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מרינה\nחוות דעת - הרצאות: בחצי הראשון של הקורס הלכתי להרצאות של אבי, הוא מאוד נחמד אבל לא אני ולא החברים הבנו מילה ממה שהוא מנסה להסביר, הכל מאוד מובן עד שנגמר השיעור ומבינים שלא הבנת כלום. אז ניסיתי לראות את ההרצאות של מרינה ולחלוטין לא הבנתי למה היא לא מוערכת מספיק, אומנם צפיתי בהרצאות במהירות 1.75 אבל היא סופר ברורה ומובנת, מדברת תכלס ומסבירה בצורה מעולה. עדיין לא מבינים כלום אבל ההסברים טובים יותר ;)\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין על גרשון, מתרגל פשוט נפלא, ניכר שהוא לא מת על המקצוע אבל אי אפשר להאשים אותו, בכל זאת הוא מסביר את החומר בצורה ברורה ומנגיש אותו היטב לסטודנטים המבולבלים. גם מרינה מתרגלת מעולה, לי הרגיש שגרשון הוא יותר \"תכלס\" ומרינה מקיפה את החומר מכל כיוון אפשרי, כל אחד וההעדפה שלו.\n\nשעורי הבית: שלא נדע. 6 גיליונים שבפועל רק 3 מתוכם נחשבו לציון הסופי, כל גיליון משוחרר בזמן יותר מוזר מהגיליון הקודם לו - או שנה לפני שהחומר נלמד או שנה אחרי ולקינוח משוחררים כ-3 גליונות ביחד בסוף הסמסטר, לא ברור.. בסמסטר אביב נכתבו שאלות חדשות אז לא היה רפרנס להיעזר בו (הפחד הכי גדול של כל סטודנט), כשפותרים את התרגילים חושבים שהם ברמה מוגזמת ולמה זה מגיע לי בכלל אבל כשלומדים למבחן מבינים שזה הרמה פחות או יותר לכן, כן הייתי מציעה להשקיע בגליונות, שאלה אחת מתוכם תופיע במבחן (כ-15 נקודות + 5 נקודות בונוס למי שיקבל 75% מניקוד השאלה)\n\nהמבחן: ארוך בצורה מוגזמת, רמת קושי בינונית פלוס - מי שלמד טוב יכול להצליח. כל סמסטר המבנה של הבחינה קצת משתנה אבל אצלינו הוא כלל 5 אמריקאיות שצריך להקיף 2 תשובות נכונות מתוך 8 אפשרויות ו-4 שאלות פתוחות (2 שאלות פתירה, הוכחה אחת ושאלת שיעורי בית)\n\nהשורה התחתונה: ההמלצה שלי - בהתחלה כנראה לא תבינו כלום, גם תוך כדי הסמסטר כנראה שלא תבינו הרבה, אל תילחצו - לקראת הסוף כל העסק נהיה קצת יותר ברור. אם יש לכם זמן הייתי מציעה ללכת גם לתרגול של גרשון וגם לשל מרינה וגם שעות קבלה תמיד עוזרת, המון בהצלחה!", "timestamp": 1627978008907}, {"author": "רז בוזגלו", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ד\"ר מרינה קרוש ברום\nחוות דעת - הרצאות: סבירות. היא כן משקיעה בלהסביר את התיאוריה, אך לא תמיד התיאוריה ברורה עד הסוף ומועילה. הכי טוב זה פשוט לדעת את הטכניקה איך לפתור \n\nשם המתרגל/ת: מרינה גרוזד \nחוות דעת - תרגולים: מתרגלת מעולה ! מסבירה ומכסה את מירב הדוגמאות בכל נושא. \n\nשעורי הבית: יש. הם 10% מהציון וכן צריך להשקיע בהם, הם מאוד מלמדים. שאלה אחת מתוכם מופיעה אחר כך במבחן. \n\nהמבחן: סביר והוגן. אפשר לקבל בו ציון די גבוה אבל צריך להשקיע. \n\nהשורה התחתונה: קורס מעניין מאוד ומאתגר את המוח. מתרגלים טובים. עם השקעה טובה - אפשר לקבל גבוה", "timestamp": 1631701130488}, {"author": "*", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הלכתי להרצאות, בהתחלה ניסיתי ללכת לאבי ואז הבנתי שזה חסר טעם עבורי. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: לא אוהב את הקורס הזה בכלל אבל עדיין מלמד אותו בצורה הטובה ביותר. לא מספיק את רוב הדברים שרוצה לעשות לכן ממליצה להשלים עם הדפים שלו. אם אתם מסתמכים על התרגולים בלבד תדעו שהוא לא מלמד לפלס בעיגול וזה בדרך כלל שאלה פתוחה קבועה במבחן לכן כדאי להשלים את זה ממרינה המרצה.\n\nשעורי הבית: \nמזעזעים, לוקחים המון זמן. אצלנו המרצה כל הזמן דחתה ודחתה את ההגשה שלהם כי היא לא הספיקה ללמד את החומר.\n\nהמבחן: \nאם חשבתי שהשיעורי בית נוראיים אז המבחן קיבל רמה גועל נפש. המבחן נמשך 3 שעות כאשר בתכלס צריך 5 שעות. הוא מורכב מחלק אמריקאי וחלק פתוח. יש 4 שאלות פתוחות כאשר  3 מהן הן השאלות הכי קשות, מסובכות וארוכות שהיא יכלה למצוא ואחת מהן שאלת הוכחה (המרצה שחררה רשימת הוכחות לפני המבחן ואפשר פשוט לשנן את כולן, לא שזה משנה כי לא יהיה לכם זמן לכל השאלות הפתוחות). \nבסופו של דבר בשביל לעבור את המבחן הזה הייתי צריכה לעבוד עם סטופר כמו בפסיכומטרי וזה לא משנה שלא סיימתי שאלה אחת כי חייב לעבור לשניה אחרת לא נספיק כלום.\n\nהשורה התחתונה: \nלצבור נקודות במבחן זאת הדרך לעבור", "timestamp": 1635268960338}, {"author": "אויילר", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: הוא לא רע, הקורס עצמו טיפה משעמם אבל בתור מרצה הוא בסדר גמור\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מהירה מאוד, אבל אם אין לכם בעיה לעמוד בקצב של מתרגלים מהירים היא מאוד טובה.\n\nשעורי הבית:  לא טובים, מתוך גליוניות של כמה שאלות צריך להגיש רק 1 למרות שחלק נכבד מהחומר הוא בשאלות לבחירה. היה בסדר אם היו מפרסמים פתרונות מפורטים ולא תשובות סופיות.\n\nהמבחן:  הוגן.\n\nהשורה התחתונה:  קורס טכני, לא קשה מידי.", "timestamp": 1645635268852}, {"author": "Mamuka", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלומי ג(ו)בר\nחוות דעת - הרצאות: אחלה שלומי באמת\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: אני אוהבת אותך \n\nשעורי הבית: בכלל לא קשים , מספיק לראות פעם אחת תרגול בנושא ואז זה זורם\n\nהמבחן: הוגן. לא היה משהו יוצא דופן או חריג\n\nהשורה התחתונה: קורס סביר ביותר, מאוד טכני ופחות דורש הבנה מעמיקה", "timestamp": 1645954731749}, {"author": "א", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: לא טוב. אם יש לכם אופציה אחרת תעשו את זה כי שלומי חמוד אבל בהסברים לא שיא המרתק בלשון המעטה.\n\nשם המתרגל/ת: ליטל, גיא, מרינה\nחוות דעת - תרגולים: כל מתרגל זה עולם ומלואו . כדאי ללכת לכל התרגולים כי כל מתרגל מסתכל על הקורס הזה מזווית אחרת ומביא איתו תרגילים אחרים. \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: סה״כ קורס טכני אבל גם קצת תיאורטי. יש אופציה לקבל ציון טוב .", "timestamp": 1646259597766}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: לא מעניין במיוחד אבל מדבר לעניין ובדיוק מה שצריך לדעת\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: אלופה, מכסה הרבה חומר שממש עוזר בשיעורי בית\n\nשעורי הבית: קלילים וקצרים \n\nהמבחן: הוגן, טכני מאוד ומזכיר את תרגילי הבית, השתמשתי גם בקורס של גרשון בחשבוניה שבו יש פתרונות מפורטים למבחנים משנים קודמות וזה ממש עוזר כי מאפשר לכסות את כל הנושאים. \n\nהשורה התחתונה:", "timestamp": 1646658891523}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שעורי הבית: \nעל בסיס שבועי, לא הרגיש שניתן משוב רציני אז היה קשה להבין משם אם החומר הובן. רוב הגיליונות היו יחסית קצרים, בסוף היו כמה ארוכים במיוחד.\nהמבחן: \nסך הכל מבחן הוגן. מאוד מתמטי, לא נדרשה הרבה הבנה אלא בעיקר לתרגל טכניקות של פתרון תרגילים שחוזרות על עצמן.\nהשורה התחתונה: \nקורס נחמד סך הכל. הרבה מתמטיקה", "timestamp": 1647426111585}, {"author": "המשמיד", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: \nלא הייתי בהרצאות, היו מאוד מיותרות. המקצוע טכני מאוד כמו מדר, פשוט הצוות קורס שהיה לנו לא היה זהה לזה של מדר, אז היה מלא סיבוכים וכאבי ראש.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמתרגלת סבבה, מאוד רצה על החומר- אז מי שמתאים לו, מה טוב. לצערי לא היה לנו את אפרת אבירם או את גרשון אברהם, אבל אם הם אצלכם, לכו אליהם בעיניים עצומות.\n\nשעורי הבית: \nבהשוואה לשנים קודמות הקורס היה מאוד נוח מבחינת שב עם שלומי. כל שבוע היה עלינו לפתור שאלה אחת ולהגיש- לעומת שנים קודמות שהיו בהן כמות שאלות ארוכות ולא הגיוניות. השב עצמם דיי נבדקו בצורה בינארית, ככה שאם את רוב התרגיל פתרתם, תקבלו 100 עליו. הרמה הייתה סבירה מאוד לשב.\n\nהמבחן: \nשלומי חיבר מבחן מאוד מאוד מאוד פייר, ייאמר לזכותו שהמבחן היה מאוד טכני ופרקטי, כך שאם למדת בסוף את החומר ותרגלת קצת, הציון שלך יהיה אחלה. היו לנו 4 שאלות פתוחות, שהניקוד ביניהן חולק בצורה לא שווה. הבדיקה של המבחן גם הייתה מאוד הוגנת. שימו לב שאם שלומי לא מרצה אחראי, יש סיכוי למבנה בחינה שונה. \n\nהשורה התחתונה: \nקורס טכני מאוד, לא דורש השקעה במהלך הסמסטר. ממליץ פשוט לשים 200 שח על החשבונייה של גרשון (עם הסרטונים) ואתם תיהיו פיקס על כל החומר (90+ בבחינה)", "timestamp": 1647432108463}, {"author": ":)", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: נראה חמוד, אכפתי כלפי הסטודנטים, אבל לצערי משעמם וקשה לעקוב אחריו.\n\nשם המתרגל/ת: קבוצה ריקה\nחוות דעת - תרגולים: אם גיא צברי מתרגל, לכו אליו. הוא אח יקר ונותן את הרקע הפיזיקלי שהקורס פספס לתת עליו את הדגש, שלטעמי מאוד עוזר להבין מה באמת עושים בקורס. בלעדיו, הקורס אפור מאוד ולא סימפטי בכלל.\n\nשעורי הבית: קלילים. גליון עם שאלה בודדת בשבוע, אם כי לא באמת מקבלים פידבק עליהם (אז ללכת לשעות קבלה לשאול אחלה אופציה) ובגלל שמבקשים שאלה אחת אז קל לזרוק עליהם. \n\nהמבחן של שלומי: הוגן, טכני ולא נכנס לפינות חשוכות בחומר. 70% מהבחינה זה הפרדת משתנים אז מומלץ לתרגל הרבה מאוד את הטכניקה.\n\nהשורה התחתונה: קורס שקשה מאוד לעקוב אחריו במהלך הסמסטר, קל לזלזל ולהמעיט בערכו, אך הוא חשיבות גבוהה להמשך. ההכנה הטובה ביותר למבחן - האתר של גרשון. סוגר את הפינה, ואפשר (עם קצת מזל ובהנחה והמבחנים של שלומי שומרים על אותו סגנון) ללמוד את הקורס ולהתכונן לבחינה בפחות משבוע. לנועזים/להרפתקנים אמליץ ללמוד רק ממנו במהלך הסמסטר ולהיות צמודים לסילבוס. בראייה לאחור, חבל שלא עשיתי זאת.", "timestamp": 1648080407006}, {"author": "ג", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: מרצה לא רע, אבל קשוח במבחנים.\n\nשם המתרגל/ת: מרינה קרוש ברם\nחוות דעת - תרגולים: הכי סבירה שמצאתי... נוטה לדלג על הרבה מהחומר, ועדיין מסבירה יותר בסדר מהמתרגלים האחרים שראיתי.\n\nשעורי הבית: ארוכים כמו הצרות שלי, אבל זה מד\"ח. התרגיל עצמו לא קשה, אבל לך תזכור את ה700 שלבים.\n\nהמבחן: תבואו עם ראש פתוח.", "timestamp": 1649882027213}, {"author": "123", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: \nמרצה מזעזע לא הבנתי כלום ממה שהוא אמר. הוא היה מתרגל אחראי ולא היה שו תיאום בין המרצים למתרגלים וזה עשה המון בעיות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n7 מטלות לא ארוכות\nהמבחן: \nמועד א' היה קשה מאוד ולא דומה לשנים קודמות \nהשורה התחתונה: \nעדיף לקנות חשבוניה או ללכת לתרגולים של גרשון כי בהרצאות לא מבינים כלום", "timestamp": 1659023863821}, {"author": "sa", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: לא באמת עזר לי להצליח במבחן \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הוגנים ומכינים למבחן, ממליץ לעשות אותם ברצינות כי זאת הדרך הכי  יעילה ללמוד במהלך הסימסטר\n\nהמבחן: עשה לנו מבחן לא פרופורציונלי לשנים קודמות, היה קשה בטירוף, ידעתי את החומר טוב וקיבלתי 58, אפילו אחרי פקטור זה הממוצע הכי נמוך בשנים האחרונות, בקיצור אם אתם עם שלומי שיהיה בהצלחה, אוהב לתת הוכחות כשזה קורס שאמור להיות יחסית טכני.\n\nהשורה התחתונה: ממליץ ללמוד מהחשבוניה של גרשון את הטכניקה לפתור את התרגילים, הדרך הכי יעילה ללמוד את הקורס הזה.\nלגבי ההוכחות ששלומי תקע שיהיה בהצלחה.", "timestamp": 1659434442591}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: דיי משעמם אבל אכפת לו\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מעבירה את התרגול כאילו זה מונולוג מהמגה שהיא מעבירה שנים. אבל בסופו של יום, מעבירה את החומר טוב מאוד ולא הייתי עוברת את הקורס הזה בלעדיה.\n\nשעורי הבית: ארוכים ולוקחים הרבה מאוד זמן מהחיים.\n\nהמבחן: למי שלמד טוב היה בסדר, חלק מהשאלות היו רעיונות שחזרו על עצמם ממבחנים משנים קודמות. חלק אחר של השאלות היה יותר הבנתי ודרש חשיבה. מזל שהיה פקטור.\n\nהשורה התחתונה: קורס חובה שמאוד מעיק על הסמסטר עצמו. מזל שאפשר לרפרנס הכל וממליצה שיהיה שבוע למידה לפני המבחן.", "timestamp": 1659983240355}, {"author": "Dana Dayan", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: שלומי מעביר את ההרצאות בצורה די מעניינת, יש הרבה הוכחות אבל הוא גם מקפיד לנסות להראות את הצד היישומי של החומר, מה שממש עוזר להבנה שלו.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: המתרגלת הכי מסורה שנתקלתי בה בטכניון, מאוד חשוב לה שיבינו את החומר כך שהיא מוודאה הבנה הרבה פעמים, ולכן גם לא אוהבת לחזור על חומר שהיינו אמורים כבר להבין. משתדלת להספיק כמה שיותר בתרגול, תמיד מביאה תרגילים ממש ארוכים שדי מקיפים כל מה שצריך לדעת, קצת קשה לשמור על ריכוז בתרגול שלה.\n\nשעורי הבית: בעיקרון מקבלים תרגיל בית כל שבוע, עם מספר שאלות משתנה, צריך להגיש רק שאלה אחת והיתר לתרגול. בפועל בערך באמצע הסמסטר הם די שכחו לפתוח לנו תרגילים, אז פתחו בחלק מהשבועות שני תרגילים. באופן כללי מקבלים פידבק על שיעורי הבית, אבל אם רוצים להבין במה טעית באמת, כדאי ללכת לשעת קבלה כי את המידע הזה לא מקבלים בהערות של הבדיקה.\n\nהמבחן: מועד א׳ היה שונה מיתר המבחנים של שלומי, היה תיאורטי עם \nדי הרבה הוכחות מה שלא ככ עוברים עליו בתרגול. מועד ב׳ היה הוגן מאוד.\nהשורה התחתונה: אחלה קורס בעיני, כן צריך להיות עם היד על הדופק במהלך הסמסטר כדי להצליח, כן ללכת להרצאות זה עוזר להבנה בעיני.", "timestamp": 1666254614391}, {"author": "eden", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: מיותרות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: חשבוניה, חשבוניה, חשבוניה! סוגרת את החומר בצורה הכי טובה.\n\nשעורי הבית: ארוכות במיוחד אבל רלוונטיות למבחן\n\nהמבחן: קשה אבל ניתן להוציא ציון טוב\n\nהשורה התחתונה: קורס מעפן( בסוף זה מתמטיקה כן?) אבל עם קצת השקעה ניתן להוציא אחלה של ציון", "timestamp": 1666521147992}, {"author": "מדחיסט", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גרשון - חשבונייה\nחוות דעת - הרצאות: \nהיחיד שיסביר את החומר בצורה טובה ושמכינה למבחן \nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: \n\nשעורי הבית: כל שבוע גיליון, לא פשוטים אבל חשובים\n\nהמבחן: \nסהכ היה הוגן, תמיד יש שאלה בלתי פתירה \nהשורה התחתונה: \nרק חשבונייה", "timestamp": 1668502949086}, {"author": "א.", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: לא הלכתי, מיותר\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מסבירה ממש טוב\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: רק עם החשבוניה של גרשון!!", "timestamp": 1677430594288}, {"author": "S", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מרינה קרוש-ברם\nחוות דעת - הרצאות: אין תלונות. לא סופר מרתק אבל יותר מעניין ומועיל מהרצאות במד\"ר. ממליץ לתת צ'אנס לפחות. קצת איטית ויצא כמה פעמים שהתרגולים השיגו אותה והיו בבעיה כי עוד לא למדנו את החומר.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: מעולה, הייתי איתה גם במד\"ר. כמות ידע מטורפת ויודעת ממש להכין לשאלות של שיעורי בית/מבחן ולתת טיפים שימושיים. קצב מאוד מהיר.\n\nשעורי הבית: די קלילים. קצת פחות משאלה 1 לשבוע להגשה. לרוב לוקח שעה גג שעתיים לעשות. כדאי מאוד לעשות בשביל להשתפשף קצת על החומר במהלך הסמסטר ולא לשכוח טכניקות שלומדים בתרגול.\n\nהמבחן: די צפוי אבל זה לא אומר שהוא קל. הרבה טכניקה. הרבה מד\"רים. הרבה אינטגרלים. \n\nהשורה התחתונה: קורס קצת פשטני אבל לא עמוס במיוחד מבחינת עבודה בבית. מכיל הרבה נושאים. לדעתי יותר קל ממד\"ר.", "timestamp": 1677498749595}, {"author": "ins", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא הלכתי (ומאוד ממליצה לא ללכת!)\nשם המתרגל/ת: מרינה שהיא לא המרצה האחראית\nחוות דעת - תרגולים: ממש טובה!!! אני הייתי בתרגול שלה בשעות הבוקר והיא הייתה ממש סבלנית ומסבירה מעולה אבל הבנתי מהתרגולים אחרה\"צ שכבר אין לה כוח והיא קצת פחות סבלנית\n\nשעורי הבית: די בקטנה, הבעיה שהם לא מלמדים אותך כלום, אם יש זמן מומלץ לקחת את החשבוניה או לעשות את התרגילים הנוספים שהם לא להגשה\n\nהמבחן: הקורס מאוד מאוד חזרתי!! רק בלמידה למבחן הבנתי שכל השאלות הן אותו דבר בדיוק רק עם תנאים שונים, למרות זאת כן צריך לפחות 4 ימי למידה לדעתי\n\nהשורה התחתונה: סבלתי ממנו במהלך הסמסטר אבל בתקופת מבחנים פתאום הכל מתבהר, מומלץ להיות ותר על  זה במהלך הסמסטר (לא מבחינת הרצאות אלא מבחינת לפתור שאלות)", "timestamp": 1677507806766}, {"author": "L", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מרינה קרוש ברם\nחוות דעת - הרצאות: \nמסבירה בצורה איטית את נושאי הקורס אך בצורה מובנת.\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nמסבירה את חומר בצורה מעמיקה על ידי תרגלים ארוכים\nשעורי הבית: \nבכל שבוע נתנו שאלה 1 לש\"ב לפעמים על חומר שלא נלמד, אז היה צריך לדחות את תאריך הגשה שלו.\nהמבחן: \nערוך ודורש השקעה.\nהשורה התחתונה: קורס מתמטיקה חשוב", "timestamp": 1677536546244}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מרינה קרוש- ברם\nחוות דעת - הרצאות: לא נכחתי בהרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא נכחתי בתרגולים. \n\nשעורי הבית: מהווים 15% מהציון הסופי, צריך להגיש 8/10 וההגשה אפשרית גם בזוגות וגם כיחיד. שיעורי הבית ארוכים מאוד ובגלל זה מתוך הגליון תמיד צריך להגיש רק שאלה אחת שהם רושמים לכם איזה.\n\nהמבחן: ארוווך מאוד אך הוגן, הוא כיסה כל החומר ולא היה קשה למי שלמד טוב. אני לא נכחתי בהרצאות ולא בתרגולים, מתחילת הסמסטר קניתי הקורס מחשבוניה והייתי לומדת הנושאים משם במהלך כל הסמסטר, ולמבחן גם למדתי הכל משם ופתרתי מבחנים.\nהשורה התחתונה: הקורס לא קשה וניתן להביא בו ציון טוב, בהתחלה מרגיש שהוא קשה כי כל שאלה לוקחת המון זמן לפתור וצריך לשים לב לדברים קטנים, אך בסוף כל התרגילים חוזרים על אותו רעיון.", "timestamp": 1678058006844}, {"author": "שוגי בוגי שיגועים", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שלומילה\nחוות דעת - הרצאות: \nהייתי ב2 הרצאות בלבד. לא נחוץ בכלל. הוא ממש ממש נחמד אבל הוא מראה את התיאוריה של כל היווצרות המתמטיקה מההתחלה. חשוב לשים לב שבסוף הסמסטר לא עוברים על לפלס בטבעת ובעיגול בתרגולים ולכן צריך את זה מההרצאות שלו.  גם את אינטגרל האנרגיה לת\"ש נוימן יש רק בהרצאות אז המלצה שלי לבדוק לפני מה מלמדים רק שם.\nשם המתרגל/ת: מרינוש\nחוות דעת - תרגולים: \nכרגיל מרינה רצה לה בחומר במהירות של 0.9C. האורות בכיתה שלה כל כך חזקים שהעניים שלי נעצמו כדי שלא ישרפו. היא מהממת ומקסימה. התירגולים ארוכים ומייגעים. חשוב מאוד ללכת אליהם ולרשום או לקחת ממשהו את מה שעושים כי זה ממש עוזר גם למבחן וגם לשיעורים.\nשעורי הבית: \nהשיעורים נהדרים ועוזרים מאוד לעשות את כולם אל תתעצלו! הם גם לא ארוכים זה רק תרגיל אחד.\nהמבחן: \nהמבחן הוא חתיכת מסע ארוך ומפרך. אתה מתחיל אותו ומסיים כבן אדם אחר. מלא תרגילים לזמן מאוד מועט. לטחון מבחנים זאת הדרך היחידה.\nהשורה התחתונה:\nקורס מפוצץ חומר אבל מאוד כיפי כשמסיימים אותו. לא להישבר במהלך הסמסטר.", "timestamp": 1678475496722}, {"author": "B.K.", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לא יודע\nחוות דעת - הרצאות: לא הייתי \n\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים: לא הייתי\n\nשעורי הבית: קלים ברמה אחרת\n\nהמבחן: לא נוכחתי באף הרצאה או תירגול, מספיק לצפות בקורס הדיגיטלי של גרשון בחשבוניה ותוך 5 ימים אפשר להוציא ציון 80+ באפס מאמץ.\n\nהשורה התחתונה: חומר הקורס נורא מעניין ושימושי ממש עבור מי שלומד הנדסה, ההרצאות והתירגולים חסרי תועלת, כל מה שמועבר בשעתיים הרצאה/ תירגול אפשר לכסות בחצי שעה.", "timestamp": 1678544964706}, {"author": "ה", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לא זוכרת\nחוות דעת - הרצאות: הייתי באחת וזהו\n\nשם המתרגל/ת: לא זוכרת\nחוות דעת - תרגולים: הייתי בתרגול אחד ושם זה נגמר\n\nשעורי הבית: הם לא קלים אבל בסדר בסך הכל, כל שבוע תרגיל אחד שהציון שלו הוא 1 או 0 . זה עוזר בעד 4 נק' לציון הסופי ושווה להשקיע לעשות אותם\n\nהמבחן: היה פייר מאוד, העקרונות די חוזרים על עצמם, תלמדו את כל החומר עם גרשון בחשבוניה, תעשו את כל השאלות מבחן איתו ואז תתרגלו כמה שיותר מבחנים ויהיה בסדר\n\nהשורה התחתונה: קורס שאפשר להוציא בו ציון מעולה אבל *רק עם גרשון בחשבונייה* , תעשו לעצמכם טובה, בתחילת הסמסטר תקנו חשבונייה, במקום לבזבז את הזמן בתרגולים והרצאות לא מובנות תשבו על החשבונייה בשעות האלה ותלמדו במקביל לסמסטר ותעשו לפני המבחן את השאלות חזרה למבחן איתו ומבחנים וזהו ! אתם יכולים להוציא ציון פצצה", "timestamp": 1692522352951}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מרינה\n\nחוות דעת - הרצאות: \nלדעתי הייתה טובה סה\"כ, הייתה ברורה וענתה על שאלות. \n\nשם המתרגל/ת: מרינה\n\nחוות דעת - תרגולים: \nמעולה!! ממליצה בחום ללכת אליה. היא מאוד מהירה אבל התרגילים שהיא מביאה הם ברמת מבחן וכוללים ממש את כל החומר ואת כל מה שצריך לדעת. מאוד מאוד עזרה לי להבין את החומר בצורה טובה במהלך הסמסטר.\n\nשעורי הבית: \nלא קלים (גם לא מרופרנסים) אבל בסופו של דבר צריך להגיש רק שאלה אחת כל שבוע והם נותנים בונוס של 4 נקודות (אם מגישים את כולם) ככה שמאוד שווה להשקיע בהם.\n\nהמבחן: \nהוגן סה\"כ. אצל שלומי כל שנה יש מבחן בסגנון אחר (כל פעם מספר השאלות משתנה) אז אי אפשר לדעת ב-100% למה לצפות, אבל לא היו הפתעות מיוחדות.\n\nהשורה התחתונה: \nקורס לא קל, דורש השקעה. בשונה ממה שכתבו פה, אני כן הרגשתי שההרצאות והתרגולים עוזרים לי ולא הסתמכתי רק על החשבונייה.", "timestamp": 1693665860500}, {"author": "ליה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: שלומי ממש אחלה, מאוד נעים.\nחשוב חשוב חשוב ללכת להרצאות. \n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: היא ממש מותק, אבל לא ממליצה לקשיי קליטה כמוני להיות אצלה, היא טסה במהירות האור.\n\nשעורי הבית: חשובים להבנת החומר. אולי יותר קשים מהמבחן\n\nהמבחן: המבחן קשה. וקשה להיות על כל החומר בשליטה מלאה, ולכן הממוצע הוא כזה. מועד א היה יותר סביר ממועד ב הסמסטר. \n\nהשורה התחתונה: לי היה מאוד קשה להיות עלזה בקורס, לא הבנתי את הלך הדברים ולאן נושבת הרוח. אני נעזרתי בחשבוניה של גרשון, חשוב להדגיש שאין התאמה מלאה בין תוכן הקורס לחשובניה, תעזרו בהקלטות של שלומי (במידה והוא המרצה האחראי) ותחרשו לקראת המבחן ויהיה בסדר", "timestamp": 1703666960684}, {"author": "סטודנט להנדסה", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שלומי - הקלטות\nחוות דעת - הרצאות: לדעתי שלומי אחלה מרצה, כמו כן בסמסטר הזה הוא היה המרצה האחראי ולכן כדאי היה ללכת דווקא אליו - הוא פחות טכני ומלמד בגישה חוקרת יותר.\n\nשם המתרגל/ת: גרשון ומרינה גרוזד\nחוות דעת - תרגולים: גרשון הוא מתרגל מוכר לכולנו ולכן מי שמתאים לו מתאים לו. דווקא לקראת סוף הסמסטר התחלתי להגיע גם למרינה ויותר אהבתי. כמו כן, התרגול שלה בלפלס ממש עושה סדר לקראת המבחן.\n\nשעורי הבית: יחסית סבירים, תרגיל בשבוע, חשוב מאוד להבנת החומר. כמו כן שיעורי הבית באמת תורמים לציון הסופי ומוסיפים 4 נק'. \n\nהמבחן: מועד א' היה די הוגן, היו מספר שאלות על נושאים קלים יותר שבדרך כלל לא מופיעים במבחנים. נקודת התורפה של הקורס היא לפלס מאחר וזה הנושא האחרון והוא נלמד במהירות. מי שילמד לפלס כמו שצריך יצליח. מי שלא לא. חשוב לזהות את הפער ולפתור את הבעיה לפני המבחן.\n\nהשורה התחתונה: קורס סבבה, לא יודע כמה רלוונטי להמשך.", "timestamp": 1704489729562}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: שלומי\nשעורי הבית: המרצה סותם אוזניים לבקשות סטודנטים ומגלה אפס הבנה\n\nהמבחן: שאלות סבירות אבל בדיקה מזעזעת. מוסיף הערות לא הגיוניות ונטפל לפרטים קטנים\n\nהשורה התחתונה: המרצה בנאדם לא סימפטי בכלל וזה ממש משפיע על ההרגשה בקורס", "timestamp": 1704879514320}, {"author": "צור", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  לא הלכתי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  לא הלכתי\nחוות דעת - תרגולים: \n\nשעורי הבית: \nקצרים ולא מסובכים יותר מידי\nהמבחן: \n\nהשורה התחתונה: תעשו מנוי לחשבונייה וקחו חיזוק לפעמים מהקלטות של מרינה", "timestamp": 1713362879520}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: \nמאוד נחמדה מאוד מנסה לבוא לקראת הסטודנטים: בגלל המלחמה ביטלה את המבחן ובמקום היה עבודה להגשה- עם ממוצע יותר גבוה משנים קודמות, הורידה את מספר תרגילי הבית שהיינו צריכים להגיש, גם יש תרגילי בונוס קלים במהלך ההרצאה עצמה\nחוץ מזה שמתחילה כל הרצאה במימז והרבה פעמים מביאה עוגיות להפסקה\nהיא פשוט לא קריזמטית והרבה פעמים החומר שהיא עוברת עליו בהרצאה מאוד פשוט גם אם בשיעורי בית זה לא תמיד משתקף\nשם המתרגל/ת: אחת לכמה הרצאות תרגול עם מיטל\nחוות דעת - תרגולים: \nלא שונה במיוחד מההרצאות עצמן, בדר\"כ פותרים שאלה דומה מאוד לשיעורי בית של אותו שבוע\nשעורי הבית: \nמאוד לא קונסיסטנטים, חלק ממש קלילים וחלק קשים ממש. הבודק מאוד קשוח ומוריד הרבה נקודות גם על שטויות\nהמבחן: \nהייתה עבודה להגשה, מאוד כללית אבל בסה\"כ לא לקח מלא זמן והיה אפשר לעשות בזוגות ושלישיות\nהשורה התחתונה:", "timestamp": 1715017076486}, {"author": "אא", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שלומי גובר (מוקלט)\nחוות דעת - הרצאות: \nדומה למדר מבחינת הרצאות מרגיש שכל מה שצריך לדעת זה לפתור.\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמטוס סילון פראייר לידה. טסה על התרגילים וכולם עם פרצופים מבולבלים\n\nשעורי הבית: \nלא קלים בכלל, לא בושה לרפרנס\nהמבחן:\nמזכיר מדר או שיודעים לפתור או שלא יודעים. אי אפשר להתחיל משהו וראות לאן זה הולך.\nהשורה התחתונה: \nתעשו לעצמכם טובה תקנו חשבונייה ו5 ימים לפני המבחן תראו את הכל ותפתרו מבחנים", "timestamp": 1715516829890}, {"author": "Iohannes Magnvs", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר שלומי גובר(אחראי, לא מרצה בפועל).\nבפועל- ד\"ר מרינה קרוש ברם\nחוות דעת - הרצאות: מאוד לא מובנות ואבסטרקטיות אבל לאו דווקא בגלל מרינה אלא בגלל שמה שהיו אמורים ללמד בהרצאות זה מאוד תאורטי. זה סמסטר 3 שלי ופעם ראשונה שהפסקתי ללכת להרצאות. רוב האנשים החליטו לממן לגרשון את החופשה הבאה וקנו קורס בחשבוניה אבל אני חושב שמי שכן נכח בכל ההרצאות הבין יותר. חשוב לציין שההקלטות של ההרצאות של שלומי דווקא היו ממש טובות ודווקא שווה ללכת להרצאות שלו אם הוא מרצה בפועל ולא רק אחראי.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: אני מכיר את מרינה עוד ממד\"ר, ואם שם היא הייתה מתרגלת מעולה פה היא מתרגלת פנטסטית. מעבירה ב10 דקות מה שלא הצליחו ללמד בהרצאה בשעתיים, ונותנת דוגמאות מאוד טובות ברמה של מבחן ואפילו יותר. חשוב להזהיר: מרינה טסה על החומר במהירות מטורפת אז למי שיש בעיה לעקוב עדיף ללמוד מההקלטות שלה.\n\nשעורי הבית: כל שבוע שאלה או 2, ברמה דיי סבירה. שאר השאלות בגיליונות די טובות כהכנה למבחן, למרות שהן די קשות. \n\nהמבחן: ממש סביר, באופן מפתיע. אפשר לומר שמי שהיה על החומר ולמד כמו שצריך קיבל 45 נקודות מתנה.  הייתה שאלה של לפלס במלבן חצי אינסופי שהייתה מאוד מוזרה, אבל עם קצת מחשבה אפשר היה לפתור אותה. מה שכן אני לא ממליץ להתכונן עם הגרשוניה אלא לפתור מבחנים ושאלות מגליונות/ תרגולים, כי שם הרמה מאוד דומה לזו של המבחן ששלומי ייתן לכם (במידה והוא מרצה אחראי)\n\nהשורה התחתונה: קורס שאמור להיות פרקטי אבל מעבירים אותו כמו אינפי... אבל אין מה לעשות זה קורס חובה.", "timestamp": 1715516975546}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: לא הייתי, אין שום סיבה בעולם להגיע להרצאות בקורס הזה\n\nשם המתרגל/ת: גיא צברי\nחוות דעת - תרגולים: גיא מתרגל טוב שהופך את הקורס לחביב. הוא מסביר את הדברים גם מבחינה פיזיקלית מה שלפעמים עוזר. אבל הוא קצת מסורבל ולא מסודר על הלוח ובהסברים.\n\nשעורי הבית: בסדר גמור, עוזרים להבנה, יחסית זריזים.\n\nהמבחן: היה לנו מבחן הוגן, לא שונה מהרמה של המבחנים שתרגלתי.\n\nהשורה התחתונה: לא ללכת להרצאות, ללכת לתרגולים. ללמוד חזק בערך שבוע למבחן וזה מספיק בשביל לקבל ציון סבבה ולסיים עם הקורס הזה.", "timestamp": 1715614133218}, {"author": "Mordechai Sambol", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תפארת סעדון\nחוות דעת - הרצאות: לפעמים קצת איטיות, לפעמים קצת מהירות. בממוצע הן היו טובות. לא מעט מההרצאות היו ממש כמו תרגול - כמעט כל ההרצאה הוקדשה לפתירת כמה תרגילים, ועל ידי התרגילים העבירו את החומר. קצת קשה לעקוב אחרי כל המתמטיקה, אבל בפועל יש שלבים מאוד מוגדרים לכל בעיה. הרבה אנשים אומרים שאפשר לעשות הכל רק בתרגולים, אבל אני דווקא העדפתי ללמוד רק מההרצאות.\n\nשעורי הבית: יש גליון כל שבוע. אם לא הבנתם מה נעשה בכיתה - אין לכם סיכוי. אבל אם הצלחתם לעקוב, ולא רק אחרי התרגיל אלא גם אחרי השלבים לפתרון, אז שיעורי הבית הם די ישירים ולא מתקילים.\n\nהמבחן: לא קשה מידי. תבינו טוב את החומר לפני ומה רצף השלבים לפתרון של כל סוג של שאלה. בעיקר אל תעשו טעויות מתמטיות מפגרות, ואתם ממש יכולים להוציא ציון טוב.\n\nהשורה התחתונה: חלק מהקורס נראה מאוד מפחיד ועם הרבה מתמטיקה. בסוף המתמטיקה היא לא ברמה כזאת גבוהה, הפתרונות הם פשוט ארוכים ולכן צריך להיזהר לא לעשות טעויות שיגררו.", "timestamp": 1716138704632}, {"author": "מר אמאדו סגוביץ'", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אחראי- שלומי, בפועל מרצות- תפארת ומרינה (ק\"ב)\nחוות דעת - הרצאות: \nהלכתי רק לראשונות של מרינה, וחוץ מהמון תאוריה ובלבול אין סיבה ללכת. הבנתי שתפארת מרצה יותר טובה (והיא ממש נחמדה) אבל לצערי לא יכולתי ללכת אליה. יש בפנופטו הקלטות של שלומי (וביוטיוב של פינצ'ובר) ושניהן טובות. \nבתכלס אם שלומי מרצה אצלכם בפועל אז תלכו אליו. או שתראו את ההרצאות בגרשוניה אם יש לכם תקציב לזה...\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nבניגוד להרצאות השאלות לדוגמה בגרשוניה הן ברמה נמוכה מאוד, ובשביל זה יש את מרינה. למי שיכול, תתחילו לאמן את היד בסמסטר לפני שאתם ניגשים לקורס כי מרינה רצה מהר מאוד על החומר, אבל אם אתם מצליחים להתרכז- תחשבו שעברתם את המבחן כי היא מסבירה מאוד טוב וברור ומלמדת טריקים ושיטות פתרון בצורה מאוד יעילה.\n\nשעורי הבית:\nשאלה או שתיים בשבוע, בערך פי 1.2 קשות יותר מהמבחן. אבל שווה לעשות בשביל 4 נקודות לציון הסופי. \n\nהמבחן: \nממש לא קשה, כמובן שהרבה יותר קל משיעורי הבית. הבעיה שלכם לא תהיה המבחן בקורס הזה אלא הבדיקה שלו, כי היא פשוט מזעזעת. יכולים להוריד לך \"סתם\" חצי סעיף על זה שלא רשמת בדיוק את מה שהם רצו, גם אם הוכחת להם את כל חדו\"א 1 ו-2 ביחד. ואז נותנים \"פקטור\" של 5 נקודות כדי שלא יבואו אליהם בטענות שהממוצע נמוך.\n\nהשורה התחתונה: \nקורס טכני בתחפושת זוועתית, סגל בינוני + (מרינה גרוזד FTW), לא באמת מועיל מי יודע מה להמשך", "timestamp": 1716903953048}, {"author": "לפלס בטבעת", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: תפארת\nחוות דעת - הרצאות: לא הייתה לי הכי ברורה, אבל נחמדה מאוד ותמיד מוכנה להסביר שוב ולענות על שאלות. \n\nשם המתרגל/ת: גיא צברי\\מרינה גרוזד\nחוות דעת - תרגולים: גיא הוא הנכס של הקורס הזה, נותן אינטואיציה פיזיקלית לגבי המתמטיקה המעייפת של הקורס הזה וגם יש לו קבצים מאוד מסודרים עם פתרונות של התרגולים. בלי קשר לזה שהוא מלך וישב איתי על חשבון זמנו הפנוי אחרי שחזרתי ממילואים.\nבתקופת הלמידה למבחן צפיתי בתרגולים המוקלטים של מרינה שהיו מצוינים, היא נותנת לכם את האלגוריתם לפתרון בלי יותר מידי בלבולי מוח. מהירה מאוד.\n\nשעורי הבית: קשים, עשיתי כמה שיכולתי. ממליצה לעשות רק כדי להבין מה הולך בסמסטר. \n\nהמבחן: קשה \n\nהשורה התחתונה: תתייחסו לקורס הזה כאל קורס שצריך ליישם בו מספר סופי של שיטות פתרון ויש מצב שיהיה בסדר.", "timestamp": 1718713954357}]}