{"posts": [{"author": "שם", "semester": "201902", "text": "קורס קשה ועמוס.\nהמלצות: אירנה גורליק מרצה מדהימה אם אפשר - לכו להרצאות שלה\nכנ\"ל אפרת אבירם לתרגולים. אם אי אפשר להגיע לתרגולים שלה - בואו לשעות קבלה.\nהגשות: אם דניאל רבייב המרצה האחראי ההגשות יהיו קשות וארוכות (באביב 2020 עשינו סכומי ריימן ב2 הגשות שונות ובאחת מההגשות עשינו סכומי ריימן לכמעט כל סעיף). אל תבזבזו את הזמן יותר מידי על ההבנה - לכו לשעות הקבלה.\nהמתנטים (שעורי הכנה ותרגול) מוסיפים למגן אך מתנט תרגול דורש הרבה זמן - חלקם עוזרים להבנת החומר, חלקם סתם מבזבזים את הזמן.", "timestamp": 1597243380000}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: ראיתי את ההרצאות המוקלטות של צנזור למרות שרבייב אמר שלא כדאי. היה מעולה. המוקלט מאוד דומה למה שרייב מעביר, דאגתי להתעדכן בהרצאות של רבייב, ולא היו לי שום חוסרים. \n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: רבקה נהדרת. אבל מהירה מאוד. התרגולים איתה זה מרתון, אתה יוצא מתנשף. היא מביאה תרגילים ברמה מאוד קשה, לסטודנטים יותר מתקשים אמליץ ללכת למתרגלים אחרים כמו אפרת, שעושים פחות תרגילים בשיעור, אבל מסבירים יותר.\n\nשעורי הבית: הגיליונות של רבייב היו נוראיים. לא מובנים, מלא טכניקה אלגברית של כיתה ט', גוזלים מלא זמן.\nWW נחמד, רצוי לעשות, מסדר את החומר בראש.\n\nהמבחן: עשיתי את המבחן המקוון בסמסטר קורונה, מבחן של 3 שעות שהומר ל-2 חלקים של שעה כל אחד, כל חלק עם 2 שאלות. נוראי. אין זמן לחשוב. אם לא הצלחת שאלה אתה מתחיל מ-75. לא פשוט בכלל.\n\nהשורה התחתונה: בסך הכל אהבתי את הקורס. החומר מעניין ושימושי לקורסי פיסיקה. חשוב להשקיע ולהיות על החומר לאורך כל הסמסטר. אפשר להוציא ציון טוב.", "timestamp": 1597738064814}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "* שם המרצה: עדי וולף\n  חוות דעת - הרצאות: מרצה מהממת!! מסבירה הכל בצורה מעניינת, קצב לימוד סביר מאוד.\nsweetest most genuine lecturer ever\n\n* שם המתרגל/ת: רבקה אביטל\n  חוות דעת - תרגולים: קצב לימוד סביר (אולי קצת מהיר אבל \n  אישית הצלחתי לעקוב), מסבירה בצורה מעניינת.\n\n* שעורי הבית: לא קשים מדי, עוזרים בהבנת החומר.\n\n* המבחן: מבחן סביר מאוד, רוב השאלות דומות לתרגילי בית.", "timestamp": 1598272889156}, {"author": "חדוא 2ת", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מסביר טוב מאוד, יורד לפרטים הנכונים כשצריך.\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: מתרגלת מעולה, יודעת איזה תרגילים להעביר, נוגעת בדיוק בנקודות החשובות בחומר. קצת מהירה לפעמים ולא מתעכבת על שאלות \"שטותיות\".\n\nשעורי הבית: לא הכי תורמים לפתירת שאלות ממבחנים אבל פרקטיים לחיים האמיתיים.\n\nהמבחן: קשה יותר מן התרגילים הנפתרים בכיתה, אם דניאל מרצה אחראי שווה לעבור טוב טוב על המבחנים שלו.\n\nהשורה התחתונה: קורס עמוס מאוד, אבל נורא טכני. מאידך, המבחנים של דניאל דורשים הבנה עמוקה של החומר, אז אי אפשר לצפות רק להיות טובים בטכניקה.", "timestamp": 1598287715126}, {"author": "Adi Haim", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה נהדר, דיי פדנט\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים אבל בסך הכל בסדר\n\nהמבחן: הוגן, אף פעם לא מכיל את כל הנושאים בקורס\n\nהשורה התחתונה: קורס עמוס בשיטות אלגבריות, לא קשה מידי", "timestamp": 1598507022007}, {"author": "ב", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שעורי הבית: \nעמוסים מאוד, לא ברורים ולוקחות הרבה זמן! (מספר ימים)\n\nהשורה התחתונה: \nקורס יפה , אבל עבודות הבית המתנטים והתרגילים הפתוחים לוקחים יותר מדי זמן והיו טכניות מאוד בד\"כ.", "timestamp": 1598531345441}, {"author": "און פביאן", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: דניאל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רבקה\n\nשעורי הבית: בסדר\n\nהמבחן: סבבה\n\nהשורה התחתונה:", "timestamp": 1600879374921}, {"author": "יצחק ספוקויני", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מעביר ממש ביסודיות, וחשובים לו הסטודנטים. קצת איטי לפעמים אבל אם יש הקלטה מריצים :)\n\nשם המתרגל/ת:  רבקה\nחוות דעת - תרגולים: אלופת העולם. ממש מסבירה איך לפתור כל דבר ומה הטריקים שחשוב לדעת\n\nשעורי הבית: ווב וורק מעולים, הגליונות של רבייב נוראים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1603212392798}, {"author": "הארי פוטר", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: דינאל רייבב\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: סבירים\n\nהמבחן: סביר\n\nהשורה התחתונה: עושים כדי כי צריך, אין זמן להתכונן לקווידיץ'", "timestamp": 1603570560289}, {"author": "ביגוס חשמלטוס", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מאוד מסודר ומאורגן, מביא גם סיכום מצוין של החומר שהוא בעצמו כתב. אכפת לו מהבנת הסטודנטים.\n\nשם המתרגל/ת: עדי וולף\nחוות דעת - תרגולים: מתרגלת נהדרת, מסבירה בצורה טובה, אווירה טובה בתרגולים, ורואים שהיא משקיעה הרבה ולא מובן מעליו.\n\nשעורי הבית:  המגן עם משקל מכובד מאוד, גיליונות סהכ אם מגישים לא חושב שלא מקבלים 100. קצת מתחכמים ולפעמים לא ברורים, אבל לא מרגיש מנותק לגמרי מהחומר. הוובוורקים עמוסים אבל טכניים בלבד.\n\nהמבחן: סטנדרטי, לא קליל אבל לא בשמיים, יש בעיית זמן. \n\nהשורה התחתונה: החומר נחמד מרגיש שימושי מאוד.", "timestamp": 1605000358057}, {"author": "ש", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות:  מסביר טוב, לא סבלני לשאלות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מסביר טוב, קצב גבוה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1608985332050}, {"author": "m", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: אלכס מרצה מעולה - מסביר בפשטות ובאופן ברור. היה קצת קשה בגלל שלמדנו מקוון - הכתב שלו לא היה הכי ברור, והוא מחק את הלוח (כתב על הwhiteboard של הזום) מאוד מהר אחרי שנגמר לו המקום.\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מדהימה!!! המתרגלת הכי טובה שהייתה לי בפער. מעבר לזה שהיא מנוסה מאוד ומסבירה מדהים, היא לגמרי בעד הסטודנטים, וממש הרגשתי שאכפת לה מאיתנו ושנצליח. מה שכן, היא מאוד אנרגטית ורצה על החומר, וזה לא מתאים לכל אחד (לי זה עבד יופי).\n\nשעורי הבית: יש webwork-ים בערך פעם בשבוע, הרבה מהם ארוכים וקצת מייאשים אבל הם עוזרים לתרגל את הטכניקה. הגיליונות הפתוחים הם בערך כל שבועיים, והם קצת יותר עמוסים (הסמסטר השאלות היו ממש בסדר, הרבה מהן גם היו מתוך הספר של אלכס).\n\nהמבחן: הוגן לגמרי - התאים לזמן, השאלות היו הוגנות ובדיוק ברמה שנלמדה בהרצאות/תרגולים/תרגילי בית (אם כבר, בתרגולים הרגשתי שהיו שאלות קשות יותר).\n\nהשורה התחתונה: זה קורס חובה (די עמוס) אז אין יותר מידי מה לעשות, אבל אם המרצה האחראי יהיה אלכס אז הקורס יהיה הוגן לגמרי.", "timestamp": 1614637269284}, {"author": "סטודנט כללי", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה סביר, ברור ומובן בסך הכול. לעיתים מבזבז יותר מדי זמן על נראות הלוח הוירטואלי ועל חישובים מייגעים.\n\nשם המתרגל/ת: עדי וולף\nחוות דעת - תרגולים: מתרגלת מעולה, ברורה, עניינית ומסבירה טוב. \n\nשעורי הבית: \nמסייעים להטמיע את השיטות שנלמדות בקורס.\nהמבחן: \nמועד א היה פצצה ומועד ב היה סביר.\nהשורה התחתונה:", "timestamp": 1615482555140}, {"author": "ניר אלפסי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: מרצה מעולה , נותן הסברים גאומטרים שעושים חיים קלים\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: המתרגלת הכי טובה שהייתה לי במהלך התואר , מלמדת בקצב מהיר אבל גורמת לחומר להראות קל בצורת חשיבה שלה\n\nשעורי הבית: וובוורקים מייגעים מאוד\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס נחמד , מומלץ לקחת אותו לפני פיזיקה 2ממ", "timestamp": 1616361757383}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: מרצה טוב, מסביר אחלה, נחמד וסבלני אבל קצת מבולגן מבחינת הסיכום של החומר על הלוח בזום\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: ממש ממליצה. איריס מתרגלת מדהימה שעשתה לי את הקורס הזה הרבה יותר טוב. מומלץ לבוא גם לתרגולים בלייב וגם לשעות קבלה\n\nשעורי הבית: עמוסים. גם WW שכדאי לעשות כדי להכנס לחומר, וגם גליונות פתוחים שלוקחים זמן.\n\nהמבחן: היה הוגן", "timestamp": 1617109828290}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: החומר מועבר בצורה ברורה לחלוטין. בעד הסטודנטים, ותמיד נכונה לענות על כל השאלות. קצב  מאוד איטי, אבל ההספק בהרצאה תואם את הדרישות של המבחן. מומלץ מאוד ללמוד אצלה אם היא המרצה האחראית, הרבה אלמנטים ששמה עליהם דגש בהרצאה ומופיעים במבחן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בדיוק במידת הטעם הטוב. הגליונות לא ארוכים. מומלץ מאוד כן לעשות את כל הוובוורקים, חלק מהתרגילים בהם ממש ברמת המבחן וגם אלו שלא, מאוד עוזרים להטמיע את הטכניקה.\n\nהמבחן: דורש הרבה תרגול. המבחן מאוד עמוס בהיבט הזמנים, דורש תקתוק. אבל השאלות טכניות, חוזרות על עצמן ועל הדגשים של המרצה האחראית.\n\nהשורה התחתונה: קורס שאין סיבה לא לעבור בהצלחה, כל עוד מתמידים ומתרגלים לאורך כל הסמסטר.", "timestamp": 1626432568934}, {"author": "Nikol Seleznev", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף \nחוות דעת - הרצאות: היה לי קשה מאוד להקשיב לה בזום, לא הבנתי כלום ואז עברתי למוקלטות של צנזור ביוטיוב והיה מצוין \n\nשם המתרגל/ת: אחסאן \nחוות דעת - תרגולים: מתרגל ממש טוב \n\nשעורי הבית: המון שיעורי בית לא פשוטים אבל מכינים למבחן.\n\nהמבחן: המבחן עצמו היה פייר \n\nהשורה התחתונה: לא משנה כמה תשקיעו במהלך הסמסטר מה שקובע זה מועד המבחן וכמה זמן יש ללמוד אליו. צריך לפחות שבוע מלא שלומדים אך ורק למבחן הזה ולא לשום דבר אחר. סהכ הקורס עצמו מעניין", "timestamp": 1626601492798}, {"author": "סתם לנסות", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אחלה של מרצה, יודעת מה ואיך להסביר, הרצאות מתוכננות ומספיקה מה שרוצה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: בכל קורס שהיא אחת מהמתרגלות - לכו אליה! מתרגלים אחרים אולי מספיקים לפעמים יותר, אבל היא מסבירה מעולה כל דוגמה שמביאה.\n\nשעורי הבית: webwork חשוב לתרגול הטכני של הקורס, גיליונות גם חשובים ועוזרים ממש להבנת החומר\n\nהמבחן: היה הוגן, אבל נכשלתי במועד א.\n\nהשורה התחתונה: קורס יחסית טכני, צריך ללמוד ולתרגל מספיק ואז המבחן לא אמור להיות בעיה רצינית ממש. לא מתקטננים על כל חצי מילה כמו באינפי, אבל קורס ארוך ועמוס. חשוב להיות על הקורס במשך כל הסמסטר", "timestamp": 1626651870574}, {"author": "יוסי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: דיי משעמם אבל מסבירה טוב ולאט\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: אין מספיק מילים טובות בעולם הזה בשביל להעיד על איריס, פשוט תענוג, מאוד מצחיקה מסביה מעולה ומאוד אכפת לה מהתלמידים.\nהיא ממש טסה אבל לדעתי היא עושה את זה בצורה הטובה ביותר\n\nשעורי הבית: ארוכייםםםםם\n\nהמבחן: הוגן סך הכל\n\nהשורה התחתונה: קורס חשוב מאוד, לא ככ נורא בהשוואה לאינפי", "timestamp": 1626693059845}, {"author": "Eden Ninary", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: הקלטות של צנזור\nחוות דעת - הרצאות: הוא מעולה וכיסה את כל החומר\n\nשם המתרגל/ת: אחסן\nחוות דעת - תרגולים: אין בן אדם שמסביר יותר טוב מאחסן \n\nשעורי הבית: לא הצלחתי לפתור את הגליונות לבד\n\nהמבחן: סביר לגמרי \n\nהשורה התחתונה: תלוי מרצה אחראי", "timestamp": 1626867604132}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אחלה מרצה, מסבירה ברור ולעניין\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: פשוט אלוף, מתרגל תותח שהספיק המון תרגילים, ולא על חשבון הסברים מובנים. בסוף הסמסטר נשארו לנו שעתיים אקסטרה אחרי שסיים לכסות את כל החומר, ופתר איתנו מבחן לדוגמא. מומלץ ביותר\n\nשעורי הבית: הגליונות הפתוחים היו בסדר, לא עמוסים במיוחד. הוובוורקים מזעזעים, המון אינטרגלים בלתי פתירים\n\nהמבחן: הוגן בהחלט\n\nהשורה התחתונה: נחמד להבין מה זה אינטגרל משטחי אחרי שסמסטר שלם משתמשים בו בפיזיקה בלי לדעת מה זה", "timestamp": 1626873897144}, {"author": "רועי", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \nהרצאות מסודרות ומובנות - הועברו בזום כשעדי רושמת באייפד, עם גישה להקלטות ולרשימות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nגיליונות פתוחים - 4 הטובים מבין 5.\nוובוורק-ים 12 וובוורקים - שימו לב לציון סף על מנת לקבל מגן.\nממומלץ לפתור את הוובוורקים - עוזרים להבין את החומר,\nהמבחן: \n3 שעות - 7 שאלות. קשה ללמוד אליו ב-4 ימים.\n\nהשורה התחתונה: \nקורס חובה - תשקיעו במהלך הסמסטר, לוודא שיש מספיק זמן ללמוד למבחן.", "timestamp": 1626948726416}, {"author": "Hanan Krasna", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \nמרצה נהדררת, מסבירה הכל מאוד בבירור, מכינה חומרי עזר כדי שלסטודנטים יהיה מובן ובאופן כללי השיעור כיף ואינטרקטיבי\nשם המתרגל/ת: יוליה \nחוות דעת - תרגולים: רצה על התרגילים להספיק כמה שיותר. אני אישית מאוד מתחבר וזה כבר קורס שלישי שאני עושה איתה.\n\nשעורי הבית: WW מאוד מאוד טכני וארואך.\nגיליונות פתוחים פתירים בהחלט וחשובים למבחם\n\nהמבחן: קצת עמוס ביחד ל3 שעות שמוקצבות לו, אבל הוגן ותואם את הדגשים מהסמסטר.\n\nהשורה התחתונה: קורס עמוס אבל לא מסובך מבחינת הבנה", "timestamp": 1626951834685}, {"author": "עוד סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה סבבה מאוד. מסבירה ברור ועונה לשאלות, מאוד מתחשבת בסטודנטים. \n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מספר אחת! המתרגלת הטובה ביותר. עושה תרגילים ברמה של מבחן ועושה הרבה מהם תוך כדי שהיא מסבירה מצויין ועונה לשאלות פשוט מעולה.\n\nשעורי הבית: ווב-וורקים אורכים ועם הרבה חישובים מסובכים ומעצבנים אבל בשביל להבין את הטכניקה הם חשובים.\nהגליונות הפתוחים סבירים, אם עדי מרצה אחראית אז התרגילים הם ברמה של מבחן (חלקם באמת ממבחנים) ויש רפרנסים לחלקם. \n\nהמבחן: קצת עמוס ל-3 שעות אבל בגדול הוגן מאוד.\n\nהשורה התחתונה: כשעדי מרצה אחראית הקורס הוגן מאוד ולא מחפשים את רעת הסטודנטים", "timestamp": 1626957494235}, {"author": "הילה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מתרגלת מדהימה\n\nשעורי הבית: ברמה הגיונית\n\nהמבחן: במועד א היה לא סביר בכלל. הרמה היתה הגיונית אבל כמות השאלות היתה לא הגיונית ביחס לזמן וכיסחו ממש בבדיקה.\n\nהשורה התחתונה: קורס נחמד מבחן דיי קשה.", "timestamp": 1627060989467}, {"author": "Caspi", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: נחמדה ואכפתית\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: ברורה ועניינית, אבל התרגולים עמוסים מדי לטעמי מבחינת כמות הסטודנטים.\n\nשעורי הבית: בשונה מרוב הקורסים, פה יש לWW משקל יותר כבד מלגליונות בין אם בציון ובין אם בחשיבות להבנת החומר הנלמד.\n\nהמבחן: לא מטורף מבחינת הקושי אבל עמוס. אותי שחטו בבדיקה.\n\nהשורה התחתונה: הקורס הכי טכני בטכניון!", "timestamp": 1627265179251}, {"author": "Michal Maya", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מתןקה ברמות ומסבירה ברור\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מושלמת. משקיעה ממש בהסברים והכנה ומסבירה ממש ברור וטוב.\n\nשעורי הבית: חופרים\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס ממש עמוס והרבה חומר לא מעניין במיוחד", "timestamp": 1627292520174}, {"author": "המעצבן הזה שעושה רעש בכיתה מאחורה", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nאירנה מרצה טובה, מאוד מסודרת ובאה מוכנה מאוד. הייתה מקידמה על כולם מבחינת ההרצאות, שזה עזר מאוד לשיעורי בית.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: \nהמתרגל הכי טוב שהייתי אצלו. גם היה הכי מתקדם בחומר והספיק מלא תרגילים, גם אווירה ממש טובה בתרגולים אצלו והכי חשוב נתן מלא הבנה של החומר. ממש ממש מומלץ \n\nשעורי הבית: \nהגליונות סבבה לא ממש תורמים להבנה לדעתי. הוובוורקים יותר חשובים וקשים. לפעמיים מוגרלים אינטגרלים או תרגלים ממש קשים טכנית שם, לא התעקב על זה אם זה סתם קשה אלגברית. \n\nהמבחן: \nהמבחן ארוך, ותכלס דורש לדעת את החומר בשליפה או שלא תספיקו הכל.\n\nהשורה התחתונה: \nקורס בסדר בשביל קורס חובה, חשוב מאוד לוודא במהלך הסמסטר שהחומר יושב ממש טוב, אם לא ללמוד במהלך הסמסטר. בלי לדעת בשליפה את החומר, המבחן ממש קשה, צריך לדעת את החומר ממש טוב בשביל ציון טוב.", "timestamp": 1627371683190}, {"author": "לא יודע", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה גורליק \nחוות דעת - הרצאות: מותק של מרצה , מסבירה טוב מאוד ,אכפת לה שכולם יבינו ,נותנת זמן לשאלות והכי חשוב מצחיקה ממש \nשם המתרגל/ת:אפרת אבירם  \nחוות דעת - תרגולים: שמה הולך לפניה ,פשוט ואו\n\nשעורי הבית: חופרים ,הוב וורקים ארוכים מדי .\n\nהמבחן: קל מאוד \n\nהשורה התחתונה: קורס טכני ,תלמדו כמו מטורפים ויהיה אך ורק  טוב במבחן", "timestamp": 1627388840964}, {"author": "א.א.", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מעולה, מסבירה היטב.\n\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: מתרגל מלך, תמיד יש אווירה נעימה בתרגולים שלו (לפחות בזום) והוא משקיע בזה (אומר שלום לכל מי שנכנס ומדליק מצלמה וכו'). תמיד כיף להיות אצלו, והוא כמובן גם מתרגל טוב את החומר\n\nשעורי הבית: גיליונות סבירים, WW ארוכים ומייגעים אבל המשקל שלהם גדול אז שווה להשקיע בהם.\n\nהמבחן: יחסית למועדים קודמים של רביב, די זוועה (ארוך ושחטו בבדיקה). אבל השאלות עצמן היו הוגנות, אז אני מאמין שאם תשקיעו בהכנה למבחן יהיה בסדר.\n\nהשורה התחתונה: עדי ואחסאן מעולים, וחומר טכני ויחסית מעניין. לא שיש לכם ברירה כי זה קורס חובה...", "timestamp": 1627496539337}, {"author": "הדר", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות:  הרצאות שלה טובות, ממליץ לראות הקלטות במהירות כי לי היה קצת איטי\n\nשם המתרגל/ת:  איריס שפירא\nחוות דעת - תרגולים: ץעשו לעצמכם טובה ולכו אל איריס, עשתה לי את הסמסטר.\nגם אווירה בשיעוריפ וגם מתרגלת לעניין בלי בלבולי מוח.\n\nשעורי הבית: מועילים וטובים ביחס לשאר הבולשיט בקורסים האחרים\n\nהמבחן: הקטע בחדוא 2ץ שכל מרצה עושה מבחן בסגנון שלו והם שונים מאוד מאחד לאחד, אז צריך בעיקר להתרכז במבחני עבר של אותו מרצה ומשם זה נהיה הרבה יותר קל ופחות מפתיע במבחן עצמו, היה הוגן. (למי שהתכונן על המבחנים של עדי)\n\nהשורה התחתונה: אחלה קורס, טכני וכיף, אפשר מאוד להצליח!", "timestamp": 1627897695139}, {"author": "חארבו דארב", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אייל פרג'\nחוות דעת - הרצאות:  מרצה מצויין שידע לההעביר את החומר ברמה גבוהה וברורה מבלי לבלבל יותר מידי בניסוחים פורמלים \n\nשם המתרגל/ת: אחסן\nחוות דעת - תרגולים:  מתרגל מצויין שנתן הרבה בטחון\n\nשעורי הבית: מעיקים אבל מייצירים הבנה. במיוחד הWW \n\nהמבחן: לא תמיד קשור לגליונות בית , מאוד טכני יחסית לשאר הקורסים.\n\nהשורה התחתונה:  קורס שכדי לקחת לפני הקורסים שממליצים לקחת בצמוד לממולצת, ובכללי כדי לזורק את המומלצת לפח .", "timestamp": 1629014498067}, {"author": "אלו", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אייל \nחוות דעת - הרצאות: שועל קרבות. החומר מגניב אבל יש מלא חומר ולא מוכיחים כמעט כלום שזה באסה\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: פשוט מלך\n\nשעורי הבית: מכות בכלא. מלא אלגברה מלוכלכת \n\nהמבחן: בגרות באזרחות, לשנן, להגיע ויהיה בסדר, לא קשה מידי\n\nהשורה התחתונה: לזכור בעל פה", "timestamp": 1629097141335}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מאוד מאוד אכפתית כלפי הסטודנטים, לא מובן בכלל בתור מרצה אחראית\n\nשם המתרגל/ת: יולה\nחוות דעת - תרגולים: תרגולים ברמה גבוהה, חדה מאוד, ממליץ.\n\nשעורי הבית: הרבה שיעורי בית אבל גליונות לא ארוכים בדרך כלל, WW לפעמים מתסכלים.\n\nהמבחן: הוגן סה\"כ\n\nהשורה התחתונה:", "timestamp": 1629278542333}, {"author": "משה", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: \nאני בחרתי לצפות בהרצאות בכיכובה של עדי וולף, שכן היא גם הבמאית של הסרט. אין ספק שעדי יודעת לקחת את החומר ולהפיח בו חיים. מבדיחות חנוניות קטנות להקשרים קטנים בחיים. עדי יודעת לקשר את הצופה בבית אל מה שהיא מנסה להעביר. זהירות, מכאן ספויילרים! \nהחומר של הקורס מתחיל רגיל, אך לאט לאט הקצב עולה והצופה נאלץ לעשות בחירה - האם להיאבד ולאבד את עצמו, או לנסות לאחוז ברכבת ההרים הזו. מי שבוחר להמשיך ולהחזיק, חווה עליות ומורדות ובסופו של יום גם צחוק (שנובע מתסכול). בסופו של יום - אין ספק שבזכות עדי הסרט מקבל אצלי 5 דרקונים. בהצלחה בסרטי ההמשך.\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nשחקנית מצויינת, קצת איטית אבל מצליחה להעביר את המסר.\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1629308156784}, {"author": "רוי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מקסימה בתור בנאדם, פחות \"מתאימה\" לדעתי לקורס כזה אבל בסך הכול מעבירה בסדר גמור את החומר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: נורא מסודרת, בחירת תרגילים די איכותית, מקצועית.\n\nשעורי הבית: גיליונות פתוחים לא ארוכים ורובם גם לא קשים לטעמי, הרבה מהשאלות לקוחות ממבחני עבר של המרצה.\nהוובורקים יותר קשים אבל גם יותר מלמדים ומפתחים אינטואיציה.\n\nהמבחן: הקטע בקורס הזה שלכל מרצה יש את הסגנון *הקבוע* שלו, המבחן שלנו היה די ממוחזר ממבחני\\תרגילי עבר של עדי, לא היו בו שום הפתעות, הכול היו תרגילים שכבר תירגלתי 500 פעם בקורס. \n\nהשורה התחתונה: קורס ממש חביב, פותח את הראש מרחבית, הכלים שהוא נותן מגניבים ממש ופתאום מבינים כמו שצריך דברים שרואים בפיסיקה ונראים כמו סינית בהתחלה.\nחשוב לציין שחדוא 2ת' הוא גרסא \"קלה\" \\ \"טכנית\" יותר מהקורס הרשמי \"אינפי 3\", שימו לב שהקורס מאוד טכני, כמעט ולא מוכיחים דברים שלוקח 4 שעות לפחות להוכיח אותם כמו שצריך באינפי 3.", "timestamp": 1630333071488}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: נהדרת. היא יכולה להיות טיפה מונוטונית אבל היא מאוד ברורה וקשובה לשאלות, מספיקה דוגמאות ודואגת שתהיה אווירה נעימה בשיעור, מכינה מאוד למבחן.\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: המתרגלת הכי טובה בכל המתמטיקות בלי להתבלבל לרגע. מאזנת ממש טוב בין להספיק הרבה תרגילים לבין שאלות ובכללי פשוט מלמדת בצורה כיפית\n\nשעורי הבית: יש 5 גליונות בכתב שהם יחסים קלילים אבל המון המון וובוורקים של תרגילים קשים וארוכים. הווובורקים מכינים מאוד טוב למבחן ויש רפרנסים מאוד מפורטים שלהם בדרייב ואפשר ללמוד משם מעולה איך לפתור תרגילים, במיוחד כל החלק של אינטגרלים.\n\nהמבחן: מאוד מפוקס אינטגרלים ויש הרבה נקודות מתנה על נושאים שאפשר לסגור מהר (פונקציות סתומות וכו'). יש הרבה תרגילים שחוזרים על עצמם בקונספט ואפשר עם מאמץ להוציא פה ציון גבוה מאוד לקורס של 5.5 נק\"ז.\n\nהשורה התחתונה: אחלה קורס סה\"כ, מנוהל טוב.", "timestamp": 1634109311158}, {"author": "-סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מדהימה!! אכפתית מאוד, מצחיקה, מסבירה בצורה ממש טובה. החיסרון היחיד הוא שהיא כותבת טיפה מבולגן אבל מעבר לזה מסבירה מעולה\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: שמה הולך לפניה. אמנם קצת התעכבה בתרגולים מבחינת ההרצאות, אבל היא מסבירה בדיוק את מה שצריך למבחן, את כל הטריקים ואת כל הסגנונות של התרגילים. מדהימה גם מבחינה מקצועית וגם מבחינה אישית\n\nשעורי הבית: תואמים את מה שנלמד בהרצאות ובתרגולים, ברמה טובה ומלמדת, לא ארוכים מדי\n\nהמבחן: היה פייר לגמרי, בדיוק ברמה שנלמדה. מה שכן היו הוכחות, אז צריך לשים לב שיודעים להוכיח הכל (לא את המשפטים אלא דוגמאות שהראו בכיתה של תרגילים)\n\nהשורה התחתונה: היה לנו סגל מדהים, עדי וולף המרצה האחראית הייתה הוגנת ואכפתית כלפי הסטודנטים וזה ניכר גם במבחן וגם בהתנהלות הסגל", "timestamp": 1634483311306}, {"author": "ל", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה טובה, מנגישה את החומר ומפשטת אותו מאוד גם למי שפחות חזק, עם זאת פחות נותנת אינטואיציה. כותבת הרבה מאוד, איטית וקצת משעממת\n\nשם המרצה: לידיה פרס\nחוות דעת - הרצאות: עברנו אליה באמצע הסמסטר - מומלצת מאוד, מעניינת מאוד, מלמדת מובן ונותנת אינטואיציה על החומר. קצב טיפה מהיר - למי שמתאים היא תהיה נהדרת\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: אחלה יוליה שבעולם, תרגילים ברמה גבוהה ושיעורים שכיף להיות בהם\n\nשעורי הבית: לא מסובכים ותורמים להבנת החומר\n\nהמבחן: טכני יחסית, לתרגל הרבה ואז אמור להיות בסדר\n\nהשורה התחתונה: קורס מועבר טוב, לא מאוד אינטואיטיבי ולכן מי שיכול ממליץ ללכת ללידיה", "timestamp": 1634895808171}, {"author": "Hili Davidov", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: המרצה ממש בקיאה בחומר ועונה על שאלות בכיף תמיד, כותבת באופן ממש מפורט על הלוח כך שבסוף כל הרצאה אפשר לקרוא את ההרצאה ולהבין ממש לעומק\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה!!\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1635348515614}, {"author": "סתם מישהו", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מעולה. גם בזום וגם פרונטלי, מרצה טובה וסבלנית לכל שאלה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אחלה מתרגלת! עשתה תרגולים מקוונים ושיתפה איתנו את המחברת שלה שבה הוסיפה גם סיכומים קצרים על התיאוריה וגם תרגילים מקיפים על כל החומר\n\nשעורי הבית: חשוב לעשות אותם בשביל באמת להבין את החומר. בנסוף, יש שאלת שיעורי בית במבחן שעזרה מאוד לציון למי שידע\n\nהמבחן: הוגן לגמרי. אם לומדים כמו שצריך אפשר להצליח\n\nהשורה התחתונה: קורס של 5.5 נקז, העומס והרמה בהתאם אבל הוא אפשרי לגמרי.", "timestamp": 1635360726847}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מצויינת, לא מהירה מידי ובתור מרצה אחראית מתחשבת בסטודנטים ברמות. הכל כתוב באייפד שהיא משתפת והיא מעלה גם את הסיכומים וההרצאות ממש מהר. כל מה שנתנה עליו דגש בהרצאות היה במבחן אז לדעתי אם היא מרצה אחראית כדאי ללכת אליה.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: מושלמת ברמות, קצת מהירה אז מתאים רק אם מצליחים לעקוב. מספיקה מלא סגנונות של תרגילים וגם מסבירה את החומר. הרבה מהתרגילים שהיא פותרת מופיעים בוריאציות בשיעורי בית וזה נותן אינטואיציה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מדהימה. ראיתי אותה כדי לחזור על החומר לקראת מועד ב' ופשוט מסבירה כל דבר לאט ובצורה ברורה ונותנת טריקים איך לפתור תרגילים.\n\nשעורי הבית: WW עמוסים ממש וצריך לקבל מעל 85 בכל WW כדי שיחשב למגן, ממש קשוח ולוקח המון זמן. גיליונות פתירים ואם עדי מתרגלת אחראית אז הכל קונספטים של שאלות שהיו במבחני עבר שלה. מכינים טוב למבחן.\n\nהמבחן: מועד א' היה לא הגיוני בכלל, כיסחו בבדיקה והזמן לא הספיק לעומס השאלות. מועד ב' היה סביר הרבה יותר.\n\nהשורה התחתונה: קורס חובה אז אין מה לעשות, צריך לפחות שבוע מלא ללמוד למבחן.", "timestamp": 1640600442752}, {"author": "....", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דר.לידיה\nחוות דעת - הרצאות: \nמאוד מסודרת וממחישה את החומר עם דוגמאות.\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nמאוד ברורה, קצב קצת מהיר, פותרת שאלות דומות לשיעורי הבית.\nשעורי הבית: \nארוכים, דורשים השקעה ועוזרים להבנת החומר.\nהמבחן: \nבדרך כלל קשה אבל די טכני כדאי לפתור הרבה מבחנים לפני המבחן (צריך כשבוע של למידה אינטנסיבית לבחינה).\nהשורה התחתונה: \nקורס חובה שמצריך הרבה השקעה אבל נתן להוציא ציון יפה.", "timestamp": 1646387266634}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מסבירה טוב אבל לפחות אני אישית הבנתי ממש את החומר רק אחרי התרגול. \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: מתרגלת מדהימה. מספיקה לפתור הרבה תרגילים. היינו קבוצה קטנה אז הייתה יותר אפשרות להתעכב על דברים שלא מובנים.\n\nשעורי הבית: 6 מתוך 7 גליונות פתוחים ו10 מתוך 12 וובוורקים. לוובוורק יש רפרנס ממש מפורט בדרייב והפתוחים לא ברמת מבחן אבל לא פשוטים.\n\nהמבחן: פעם ראשונה שלידיה מרצה אחראית. היה מבחן מאוד ארוך אבל לאו דווקא קשה. ממוצע מאוד נמוך ביחס לשנים קודמות. ללמוד כמה ימים טובים לפני.\n\nהשורה התחתונה: קורס שמורכב ממלא חומר וצריך לזכור מלא דברים בעל פה אבל מאוד טכני. טיפ: גם אם רואים שלא מבינים בהרצאה שווה לחכות לתרגול כי הקורס מאוד טכני ולפעמים בהרצאה דוחפים דברים תאורטיים יותר שלא חשובים למבחן.", "timestamp": 1647210880447}, {"author": "Tt", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דר. לידיה \nחוות דעת - הרצאות: קורס מעניין,  היא מעבירה אותו בצורה ברורה היא שולטת בחומר ובקורס היא מתכוננת מראש ויודעת מה היא עושה. \n\nחוות דעת - תרגולים: רלוונטיים לקורס ולפתירת תרגילים ושיעורי בית.\n\nשעורי הבית: יש רפרנסים מאוד מפורטים לכל הוובוורקים, הובוורקים ממש ממש קשים. שיעורי הבית הפתוחים הם ברמת מבחן ורלוונטיים מאוד כהכנה אליו.\n\nהמבחן: השנה שלנו הייתה הראשונה שבה לידיה הייתה מרצה אחראית. מועד א היה ארוך וקשה עם ממוצע סופר נמוך. זה לווא דווקא מייצג את הקורס. אבל תמיד המבחן דורש המון למידה. \n\nהשורה התחתונה: קורס חובה, אבל אני נהנתי החומר מאוד רלוונטי", "timestamp": 1647549344992}, {"author": "--", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: סבבה, מרצה טובה. ניתן ללמוד גם לבד.\nשעורי הבית: הגיליונות חשובים כי הם מופיעים במבחן בשאלה עסיסית\n\nהמבחן: המבחן במועדי א ו ב' היה ממש ארוך! ולא פיקטרו. נחנקנו טכניון, נחנקנו. \n\nהשורה התחתונה: לעשות גיליונות ש\"ב ולתת דגש עצום על משפטי האינטגרציה (לפחות אצל לידיה).", "timestamp": 1647613600044}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: קצת קשה לעקוב אחריה. \nההקלטות של צנזור וספר הקורס עוזרים למלא את החסר.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מעולה, אבל מהירה. יש הקלטות ורשימות שרצות. מקל מאוד את החיים.\n\nשעורי הבית: \n\nהמבחן: \nלידיה החליטה שבא לה להתעלל ב\"סטודנטים היקרים שלי\" עם ממוצע הזוי. הפוקלטה למתמטיקה זרקה את המתלוננים מכל המדרגות.\nנקווה שזה יהיה הסמסטר האחרון שלה בקורס.\n\nהשורה התחתונה:", "timestamp": 1648104902117}, {"author": "פיזיקאי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: הקלטות עדי \nחוות דעת - הרצאות:  מסבירה ומסכימה את החומר מאוד טוב\n\nשם המתרגל/ת: הקלטות רבקה\nחוות דעת - תרגולים:  עושה סיכום מאוד טוב ומביאה תרגלים מאוד טובים להבנת החומר\n\nשעורי הבית: לדעתי הווב וורק מאוד חשוב לתרגל את החומר\n\nהמבחן: מאוד הוגן\n\nהשורה התחתונה: קורס קל יחסית אבל עם מלא מלא מלא חומר וצריך לחזור על החומר הרבה במהלך הסמסטר ולא ללמוד לו לפני שבוע. זה היה קורס המתמטיקה הכי מעניין שלקחתי אי פעם", "timestamp": 1658070615744}, {"author": "דנאל", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מעבירה את החומר מצויין. רושמת את מה שצריך בשלבים נוחים להבנה ובנוסף מצויינת בשעת קבלה.\n\nשם המתרגל/ת:  אפרת\nחוות דעת - תרגולים: מתרגלת מצויינת אך מעט איטית.\n\nשעורי הבית: הגיליונות סבבה לגמרי, הוובוורקים יכולים טיפה להעיק עם אינטגרלים ששורפים זמן\n\nהמבחן: היה מאתגר. לרוב המבחנים מאוד טכניים ואצל עדי היה פחות דגש על טכניקה ויותר דגש על הבנה עמוקה.\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1658126805355}, {"author": "doja cat", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עדי\nחוות דעת - הרצאות:  אחלה מרצה\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מתרגלת ותיקה עם הרבה נסיון, יש לה דרכים יפים בהסבר החומר, מאוד ממליץ!! \n\nשעורי הבית: סבירות\n\nהמבחן: נשברה לי היד אחרי המבחן מרוב הכתיבה, היה דורש הרבה כתיבה, לא היה פשוט.\n\nהשורה התחתונה: קורס מעניין ויפה, תאכלו את החומר לפני ההגעה למבחן תוציאו ציון טוב", "timestamp": 1658160101392}, {"author": "Amjad Okasha", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירינה\nחוות דעת - הרצאות: אחלה מרצה.  מסבירה בצורה מאוד מאוד טובה ו מעניינת ונותנת הרבה זמן לשאלות הסטודנטים\n\nשם המתרגל/ת: עבד אלפתאח אחסאן\nחוות דעת - תרגולים: אחסאו סבבה\n\nשעורי הבית: לא קשים ולא קלים\n\nהמבחן: עמוס בשאלות, הרבה טכניקה והיה צריך  הבנה עמוקה לחומר.. עדי החליטה השנה לעשות מבחן שונה מבחינת רמת הקושה , מועד א לא היה קל! תכלס אכלנו חרא \n\nהשורה התחתונה: קורס עמוס אבל נחמד ומעניין", "timestamp": 1658168382864}, {"author": "השטן", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: אין על אירנה, היא מרצה מעולה. עונה בסבלנות על שאלות ומעבירה את החומר בצורה ברורה.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אהבתי את אפרת מאוד. הקצב שלה הוא יחסית איטי, אבל אני מעדיפה שזה יהיה ככה, וחוץ מזה היא בן אדם מקסים ממש.\n\nשעורי הבית: הוובוורקים חופרים ממש עם חישובים מייגעים בטירוף. לקראת סוף הסמסטר פתרתי את מה שצריך עד ציון של 80% וויתרתי מבלי לסיים אותם. הם כן אבל עוזרים לסדר את החומר בראש. תרגילי הבית היבשים הם יותר בסדר והם הכנה טובה למבחן\n\nהמבחן: המרצה האחראית של הסמסטר הייתה עדי ובמבחנים הקודמים שלה היה נראה שהיא ממחזרת המון, אבל המבחן שלנו היה עם תרגילים חדשים והוא היה יחסית קשה אז זה תפס אותנו לא מוכנים. בגדול אבל אפשרי לפתור אותו ולדעת הוא היה בסדר.\n\nהשורה התחתונה: קורס עם חומר לא מאוד מסובך, נורא טכני ולא כזה מעניין, אבל הוובוורקים גורמים לך לשקול להחליף קריירה", "timestamp": 1658172512286}, {"author": "Israel Bareketh", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  צנזור ביוטיוב\nחוות דעת - הרצאות: צנזור מסביר נהדר, אין מה להרחיב. מיועד בעיקר למי שהתרגל לראות דברים על מהירות כפולה ולא רוצה לחזור לפרונטלי.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אפרת מתרגלת מהממת. מלא אנרגיות, צחוקים, ומעבירה את כל החומר. ממליץ בחום.\n\nשעורי הבית:  הוגנים.\n\nהמבחן: קשה אבל הוגן.\n\nהשורה התחתונה: קורס חובה, אבל כנראה קורס המתמטיקה הכי חשוב בתואר הזה. כדאי להבין באמת ולא רק לעבור.", "timestamp": 1658232505802}, {"author": "Igal V", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי חמודה ונהדרת, וההרצאות שלה באמת סבבה, אפילו ביחס לצנזור ביוטיוב. דואגת להקליט ולהעביר בזום.\n\nשם המתרגל/ת: ניקה פת/ אפרת אבירם\nחוות דעת - תרגולים: את התרגולים של ניקה ראיתי מההקלטה מלפני שנה וחצי - מאוד נח ומכסה בערך 90% מהחומר. היא קצת לא על החומר של שיעורי הבית ולא תמיד יודעת לעזור בשעת קבלה.\nאפרת טובה למי שרוצה מתרגל שעובר על החומר לאט וחוזר על הכל ועונה על כל שאלה. החסרון הוא תרגילים שאינם ברמת המבחן ושיעורי הבית, וזה שבקושי מספיקים את החומר.\nשעורי הבית: \nלא קל, אבל כדאי לעשות. גם בשביל המגן וגם בשביל ההבנה. הפתוחים קצרים מאוד אבל לפעמים יש שאלות שהן כאב ראש\nהמבחן: השאלות כשלעצמן לא קשות מדי, אבל צריך להיות חד על הזמנים וגם על סגנון השאלות של עדי. יש המון שאלות זהות לשנים קודמות עם קצת שינוי בנתונים\n\nהשורה התחתונה: קורס מעולה עם צוות נחמד, במיוחד ביחס לאלון. המבחן לא קל כי זה חדווא, אבל לפחות הדרך מהנה.\nלעבור על כל המבחנים של עדי שלוש פעמים, להיות חד על שאלות שיעורי הבית הפתוחים - והציון יהיה סבבה.\n\nתעברו על כל מבו", "timestamp": 1658600987590}, {"author": "doja cat", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מעולה ומסבירה טוב\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: רצה לאט על החומר אבל מתרגלת נהדרת!\n\nשעורי הבית: לא קלים, ושורפים זמן רב\n\nהמבחן: הזוי בכל המובן של המילה, הבדיקה הזויה וקשוחה, אין בכלל התחשבות בסטודנטים במהלך המבחן, גועל נפש של מבחן, מקווה שמועד ב יהיה יותר הוגן\n\nהשורה התחתונה: קורס תלוי מאוד במרצה האחראי, הייתי פעם אצל לידיה והפעם עדי, כל אחת מתנקמת יותר מהשנייה מהסטודנטים", "timestamp": 1658602211732}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה נהדרת. מסבירה ברור ומראה על כל נושא דוגמא ממבחן עבר. יש רשימות הרצאה מצויינות שלה למי שמעדיף לא לסכם.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מצד אחד הקצב לא מהיר מדי, הצלחתי גם לסכם וגם להבין, ומצד שני כן מספיקים לראות מגוון תרגילים שמייצג יחסית טוב את התרגילים בוובוורקים ובגליונות. התרגולים מאוד עזרו לחדד הבנה.\n\nשעורי הבית: מורכבים מוובוורקים ומגליונות פתוחים. \nהוובוורקים יכולים להיות די טכניים עם חישובים שלוקחים הרבה זמן, אבל עוזרים עם הטכניקה.\nהגליונות הפתוחים טובים ודי תואמים את הרמה של המבחנים לדעתי, אז כדאי לעשות אותם.\n\nהמבחן: סה\"כ הוגן. אם עדי מרצה אחראית, אז לתרגל את כל מבחני העבר שלה, כולל מבחני הדוגמא, ולעבור קצת על דוגמאות מהרצאות.\n\nהשורה התחתונה: קורס שעוזר להבין בדיעבד את החומר של פיסיקה 2ממ.", "timestamp": 1658661016742}, {"author": "אורן ברגמן", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nמלך\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nבת של מלך\nשעורי הבית: \nקלים. אל תקשיבו לכולם. וזה לא כי אני דוקטורנט בפיזיקה.\nהמבחן: \nחרא של מבחן, אבל ככה הכי טוב. זבל של בדיקה, לא מבין מה כל ההערות האדומות שיש לי, זבלים.\nהשורה התחתונה: \nמותק של קורס, מה אתם קוראים ביקורות בציזפורק אם אתם תעשו אותו בכל מקרה? מטומטמים.", "timestamp": 1658687355667}, {"author": "Roy", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: בכללי אירנה מושלמת. בפרט ההרצאות שלה מסודרות, והיא מסבירה ברור ומקפידה לתת דוגמות טובות שעוזרות להפנים את החומר. בנוסף היא מעבירה שעות קבלה מוצלחות במיוחד, גם אם אתם לא הולכים אליה להרצאות אני ממליץ להגיע לשעות קבלה שלה כדי לעזור לחומר לשקוע, רווח מובטח.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אחסאן מתרגל מעולה, מעביר את התרגולים באוירה טובה ועם הומור ייחודי. הוא יכול לפעמים להיות קצת איטי ולוקח הרבה פאוזות דרמטיות בזמן התרגול אבל בסה\"כ הקצב יוצא סבבה והוא נותן תרגילים טובים.\n\nשעורי הבית: \nוובוורק כל שבוע פחות או יותר. קצת מעייף אבל לרוב תרגול לא רע.\nהגליונות הפתוחים סבירים. קצת ארוכים ולרוב מאוד טכניים, אבל פתירים למי שיודע את החומר ויושב עליהם מספיק. עוזרים לתרגל ולרוב כוללים שאלות סטייל מבחן וכוללים טריקים שצפויים להופיע במבחנים.\n\nהמבחן: כל מרצה בחדוא והטריקים שהוא חובב, המבחנים נוטים להיות לא קלים במיוחד, והממוצעים בהתאם. צריך לעשות הרבה מבחנים מראש כדי להכיר את כל הטריקים שהם רוצים ולקוות לטוב.\n\nהשורה התחתונה: אני אהבתי, אבל לא יודע אם זו דעה פופולרית במיוחד. בכל מקרה חובה אז אין מה לעשות.", "timestamp": 1658736510489}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי מרצה מוצלחת וחביבה, מסבירה את החומר בצורה די ברורה. \n\nשם המתרגל/ת: רבקה אביטל (הקלטות)\nחוות דעת - תרגולים: פשוט להכיר את כל סוגי התרגילים. רבקה גם בתחילת כל נושא עושה סוג של סיכום קצר של כולו שזה גם עושה סדר בראש לקראת מה הולכים וגם עוזר לעבור על זה לפני המבחן. היא מלמדת בקצב די מהיר, אז יש המון שה פחות מתאים להם. אישית היה לי נוח בהקלטות כי אפשר להריץ שאלות של סטודנטים (ויש המון) או לעצור כדי להדביק את הקצב.\n\nשעורי הבית: וובוורקים וגליונות פחותים, כדאי לעשות כדי ללמוד לעשות מהר את העבודה השחורה של האינטגרלים\n\nהמבחן: קשה, אבל אם לומדים מספיק טוב לפני אפשר להוציא ציון טוב, לא בלתי אפשרי.", "timestamp": 1658995242065}, {"author": "a", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה קצת איטית, אבל עם כוונות טובות ומנסה לייצר אווירה נעימה בהרצאה. למי שמסתדר עם הקלטות, עדיף את ההקלטות שלה מהזום-מסבירה שם ברור ומעולה ואפשר להריץ בכיף. אחלה רשימות בדרייב. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: המתרגלת הכי טובה שיש. מסבירה הכל בצורה הכי ברורה שיש, כיף ללמוד אצלה, עונה על כל שאלה והכי חשוב-מפרטת בגובה העיניים ונותנת שלבים ברורים לפתרון בעיות.\n\nשעורי הבית: \nהגיליונות הפתוחים עוזרים להבנה וכמעט תמיד יש רפרנסים, ואם ממש חרוצים אז מגלים שכמעט כל שאלה הייתה במבחן עבר ואפשר גם לקרוא שם את הפתרון (גיליתי את זה כשפתרתי מבחנים), אבל שווה לעשות לבד.\nהוובוורקים בחלקם בסדר וברובם הגדול במיוחד לקראת הסוף מעיקים נוראיים ומלאים בחישובים מיותרים שהופכים את המחשבון אינטגרלים לחבר הכי טוב שלכם.\nהמבחן: אם פותרים מספיק מבחנים הרבה דברים חוזרים על עצמם ומתחילים להבין את הקונספט (חוץ משל רבייב הוא החליט להמציא מתמטיקה חדשה בשם \"קל לראות\" אל תתכוננו ממבחנים שלו אלא אם כן הוא המרצה האחראי, ואז באסה לכם).\nהמבחן שלנו לטעמי היה קצת יותר קשה וטריקי מבדרך כלל, אבל יש מגן יחסית גבוה שעוזר לתקן ציון (וגורם לזה שלא יהיה פקטור).\n\nהשורה התחתונה: קורס שהוא גם חובה אבל גם חשוב, אפשר להוציא בו ציון טוב יחסית למקצוע מתמטי, אבל הוא גם מאוד טריקי.", "timestamp": 1659213202236}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: אם הייתם אצל אירנה שאינפי או אלגברה לפני כן אתם יודעים שהיא מרצה אחלה, פה אותו סיפור. יש הקלטות של עדי אם יותר זורם מאשר פרונטלי.\n\nשם המתרגל/ת: רבקה (הקלטות)\nחוות דעת - תרגולים: עברה על הרבה תרגילים שעוזרים להבין את העשייה של החומר שנלמד. יש רשימות של התרגולים בדרייב של חשמל אם זה משהו שיכול לעזור לכם להיות יותר מרוכזים השיעור עצמו.\n\nשעורי הבית: 12 גיליונות webwork שברובם סבבה אבל יש כאלה שסתם אוהבים לגרום לסבל.\nהיה 6 גיליונות פתוחים בעלי רמה כמו של שאלות ממבחנים (מומלץ מאוד לפתור ולראות איך אתם עם החומר)\n\nהמבחן: רוב הרעיונות של השאלות חוזרות על עצמם ממבחנים קודמים לכן ממולץ מאוד לפתוח כמה שיותר לפני (תתכוננו למשבר נפשי מהמבחנים של רבייב אם החלטתם לפתור אותם). יש לצפות לשאלות עם \"טריקים\" מיוחדים שלא בהכרח נראו לפני כן.\n\nהשורה התחתונה: קורס מעניין שנותן את הכלים המתמטיים לפיסיקה 2ממ, כדאי מאוד לוודא במהלך הסמסטר שאתם באמת מבינים את החומר ואיך ליסם אותו בתרגילים ואם יש פער תעזרו בסגל כמה שיותר.", "timestamp": 1659709395598}, {"author": "DB", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלון דימטריוק ואז יוחאי מוקלט\nחוות דעת - הרצאות: \nמדובר במידע שרלוונטי לסמסטר של לידיה (בחורף 2023 אלון אחראי קורס אז לקחת בעירבון מוגבל):\nדיסהמלצה חריפה על אלון. הייתי אצלו במד\"ר עד שבוע 3 ובאינפי עד סוף הסמסטר, ואת כל מה שלמדתי עם אלון הייתי צריך ללמוד מחדש בשבוע לפני המבחן. הוא מלמד את המקצוע בצורה מאוד תאורתית ומלאה בהוכחות שלפחות בנוגע למבחן ולשיעורי הבית של לידיה פשוט לא רלוונטית. בהכנה למבחן גיליתי שיש כמה משפטים מרכזיים בקורס שהוא הזכיר כהערה למשפט אחר בזמן שיוחאי בהקלטה דיבר על הנושא הזה בערך שעה - שעה וחצי.\nבשורה התחתונה - אם אתם לומדים אצל אלון, תעזרו בהקלטות של יוחאי כי אני הרגשתי שהיה קשה לי להבין מה קורה בשיעור כשאלון העביר אותו.\nשם המתרגל/ת: ניקת פת\nחוות דעת - תרגולים: \nמתרגלת מצוינת.\nיודעת להעביר את התרגול בצורה חדה ומהירה, מתעכבת על הדברים שצריך ויודעת מה פחות רלוונטי למבחן. הצילה אותי בחלק של אינפי.\nשעורי הבית: \nWW - יש 5 גיליונות חובה בכל נושא (10 בסה\"כ). הם לא קצרים אבל חשובים כדי להפנים את החומר ולהבין על מה מדברים, ונותנים 10% מגן שמצטבר יפה בסופו של דבר.\nגיליונות פתוחים - לידיה לא ממחזרת אף שאלה בגיליונות שלה והם קשים וארוכים בצורה מוגזמת. תשקיעו בלנסות לעשות אותם אבל תעזרו ברפרנסים של אחרים מהמחזור כי לפעמים באמת יש שם דברים שנראים מופרכים בפעם הראשונה שנתקלים בהם.\nהמבחן: \nטרור. לעשות ולברוח\n\nהשורה התחתונה: אני מאמין שמדובר בקורס חשוב, אבל חורף 2023 הוא הפעם האחרונה שהוא יועבר במתכונת הנוכחית אז כנראה שראו לנכון לשנות אותו. החלק של המד\"ר יהיה מאוד שימושי בהמשך התואר.", "timestamp": 1659795776635}, {"author": "Omry Maor", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: \nמשעממות מאוד. עדי בן אדם מקסים אבל לא המרצה הכי מוצלחת שנתקלתי בה, בכלל. המבחן הסתמך על ידע תאורטי יחסית מעמיק, בניגוד להרצאות שבהן כמעט אף פעם לא הסבירה מאיפה דברים מגיעים. \n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nמתרגלת מעולה, יכולת הסברה מדהימה\n\nשעורי הבית: \nגליונות: אחלה תרגול. WW: היו כאלה מזעזעים מבחינת כמות החישובים והזמן שגזלו. להבין מתי לרפרנס ומתי לרפרנס יותר\n\nהמבחן: עמוס בהשוואה למבחני עבר אחרים. \n\nהשורה התחתונה: קורס אופייני בטכניון", "timestamp": 1659879201536}, {"author": "עומר", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: מעולה אבל לראות הקלטות.\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: בזבוז זמן\n\nהמבחן: נורא\n\nהשורה התחתונה: לוותר על הWW, לפתור את העבודות והתרגולים ובעיקר מבחני עבר", "timestamp": 1660058609612}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: מרצה מעולה. יש לו רשימות מסודרות שעוברות על כל החומר.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מעולה. מעבירה את התרגולים מהר מאוד\n\nשעורי הבית: סבירים\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660737032435}, {"author": "Arie Creson", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: מעולה וריגורוסית, ממליץ מאוד על ההרצאות\n\nשם המתרגל/ת: פת ניקה\nחוות דעת - תרגולים: מומלץ מאוד להגיע! אצלה התרגולים היו מעולים, נותנת אוויר לנשימה ומסבירה מעולה. \n\nשעורי הבית: 18% מגן למיטב זכרוני. חשוב לעשות אותם בזמן הסמסטר ולא לדחוף לסוף.\n\nהמבחן: מה אני אגיד, לא היו הפתעות גדולות. תשננו את המשפטים היטב.\n\nהשורה התחתונה: קורס חובה במסלול, כיפי בהשוואה לאינפי 2 ח", "timestamp": 1663228622811}, {"author": "חילזון הפרא", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אירנה- מוקלט ולפני מועד ב עדי מוקלט\nחוות דעת - הרצאות: אירנה מסבירה ממש טוב את החומר ואפשר להבין גם את ההיגיון שמאחוריו ולא רק את הנוסחה הסופית שצריך לזכור בסוף. בסופו של דבר לפני מועד ב ראיתי את ההרצאות של עדי, ואם היא האחראית אצלכם חובה להיכנס אליה. היא מדגישה נקודות שיש במבחן וגיליתי כמה דרכי קיצור שהיו יכולות לעזור לי במועד א.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nמתרגלת את כל הנושאים, עוברת עליהם מהר אבל נותנת טיפים קטנים שממש עוזרים לדעת אם אתה בכיוון של הפתרון או סתם מסתבך.\nשעורי הבית: יש לאורך כל הסמסטר גליונות בכתב די קלים- שווה מאוד לעשות אותם כי במבחן בדרך כלל יש סעיף יחסית דומה לאחד התרגילים. בנוסף וובוורקים שמוציאים את הנשמה אבל נותנים מגן יחסית מספק.\n\nהמבחן: מועד א שלנו היה עמוס מאוד, לא הייתה שאלה מאוד קשה אבל היית צריך לדעת את כל החומר מאוד טוב כדי להספיק לענות על הכל. מועד ב לתחושתי היה קצת יותר קצר אבל נדרשה הבנה מאוד טובה של החומר כדי לענות על השאלות.\n\nהשורה התחתונה: קורס עמוס אבל בסגל באמת טוב ומסביר ואין ברירה אלא לעבור אותו", "timestamp": 1663518823796}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: אירנה ממש טובה ברוב הקורסים שבהם היא מעבירה, כדאי לפחות לנסות אם לא בטוחים- אם לא יש את עדי.\n\nשם המתרגל/ת: רבקה (מוקלט)\nחוות דעת - תרגולים: רבקה מהירה ממש אבל כך גם מצליחה להעביר הרבה תרגילים וככה יש הרבה דוגמאות שאפשר בעזרתם להבין את החומר יותר טוב.\n\nשעורי הבית: 6 גיליונות להגשה (ציון בין 0 ל - 2 על גיליון) שיכולים לתת בסך הכל 8% מגן, כדאי לנסות לפתור בלי רפרנס בכדי שיהיה בסיס טוב לקראת המבחן. בנוסף היה webwork שבועי שגם מעניק כמה אחוזים כמגן - סבירים ברובם.\n\nהמבחן: במועד א' הכניסו הרבה טריקים, אבל הם דברים שרואים אם פותרים מספיק מבחנים. רמת קושי השאלות היא גבוהה - אי אפשר לזלזל בבסיס טוב בהבנה של החומר.\n\nהשורה התחתונה: אינטגרלים זה כיף #ad", "timestamp": 1666294213973}, {"author": "123", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nאני מאוד אהבתי את אירנה, חשוב לה מאוד להסביר לכולם והיא תמיד עונה על כל השאלות עד שהכל ברור, גם במחיר של להספיק פחות.\nקצת מבולגנת על הלוח, אבל מרצה מעולה ואני ממליץ עליה בחום.\n\n\nשם המתרגל/ת: אחסאן \nחוות דעת - תרגולים: \nאחסאן מתרגל מעולה, יודע להעביר את החומר כמו שצריך, נותן דגשים ופותר תרגילים על הלוח בדיוק כפי שאמור להופיע במבחן. יודע להגיד מה רלוונטי יותר ומה פחות, וחוץ מזה שהוא מצחיק מאוד ותמיד יש אווירה טובה אצלו בתרגולים (במיוחד בקבוצה קטנה).\n\nשעורי הבית: \nיש גיליונות ווב וורק וגליונות הגשה. יחסית טכני, אבל חשוב לעשות כי מהווה מגן וגם חלק מהתרגילים עשויים להופיע במבחן.\n\nהמבחן: יחסית טכני, אין הרבה הוכחות. סגנון השאלות יחסית חוזר על עצמו, תתרגלו מספיק ויהיה טוב.\n\nהשורה התחתונה: \nקורס טכני, אבל כולל הרבה חומר.", "timestamp": 1666462201629}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מדהימה! יודעת איך הראש של הסטודנטים חושב, מעבירה את החומר מעולה ואי אפשר להתקיל אותה- לכל שאלה יש לה הסבר וגם הסבר טוב\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מסודרת ומתרגלת שאלות טובות לקראת המבחן ושיעורי הבית\n\nשעורי הבית: הוגנים, הוובוורק לוקח מלאא זמן אבל זה תרגול טכני ממש טוב ונחוץ \n\nהמבחן: משום מה הרגיש קשה יותר מכל המבחנים שכבר תרגלנו\nלקראת המבחן לראות תרגולים מוקלטים של איריס!!! האישה עושה סדר בהכל ומסבירה את החומר לעומק כדי שנבין\n\nהשורה התחתונה: קורס מפוצץ חומר, לדעתי כדאי לעבור על החומר טוב לפני שניגשים לפתור מבחנים. גם אם תתרגלו מעט מבחנים אבל תבינו את החומר יש סיכוי גבוה מאוד להצליח", "timestamp": 1675365429445}, {"author": ":)", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אייל פרג'י\nחוות דעת - הרצאות: \nקצת מבולגנות וקשה לעקוב אבל חדוא 2 יו נואו. חשוב מאוד לבוא להרצאות שלו!!! גם אם חוזרים על הקורס, כי יש לו הגדרות שונות ודגשים שונים. אני באתי להרצאות והשלמתי הבנה מההקלטות של צנזור.\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: \nמצויינת.\nשעורי הבית: \nקשים אבל זה מגן אז פסדר מה אני אגיד\nהמבחן: \nעם אייל היה ממש בסדר למי שהלך להרצאות, הרבה שאלות שהוא הראה דברים דומים\nהשורה התחתונה: עמוס קשה ומייאש :)", "timestamp": 1677583450914}, {"author": "Tian Han Shen", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ד\"ר אייל פראג'י\nחוות דעת - הרצאות: אייל נותן הגדרות שונות ממה שרגיל בדרך כלל, לכן הנוכחות בהם חובה ,הדוגמאות הקשות ושימוש של הגדרות שלו נבחנות במבחן, מי שלא היה בהרצאות שלו כנראה נכשל.\nשם המתרגל/ת:איריס שפירא\nחוות דעת - תרגולים: \nתרגולים טובים ולעניין.  נותנת דגשים מאוד רלוונטים למבחן הסופי .\nשעורי הבית:  \nקשים , חופרים , אבל מלמדים.\nהמבחן: החומר הוא מורכב , והגדרות מרובות , נדרש מסה תרגול. \n\nהשורה התחתונה:", "timestamp": 1677683974224}, {"author": "איריס שורות", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אייל פראג'י\nחוות דעת - הרצאות: \nאייל בחור חמוד ממש, מרצה קצת פחות מובן לפעמים אבל סך הכל הסתדרתי, אפשר להבין אותו... חשוב להגיע להרצאות שלו אם הוא מרצה אחראי כי הוא מלמד שונה משאר המרצים האחראיים של הקורס הזה, וגם המבחן שלו ממש שונה משלהם... הוא די איטי, אבל מוותר על רוב ההוכחות אז כן מספיקים ללמוד הכל ועומדים בקצב. אני אהבתי שלא מוכיחים כי ההוכחות משעממות בדרך כלל... \n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nמאוהבת באישה הזאת. חובה ללכת אליה אם היא מתרגלת, הצילה לי את הסמסטר. מראה מלא דוגמאות ומסבירה מצוין.\n\nשעורי הבית: \nסך הכל אחלה, אפשר להצליח לבד. \n\nהמבחן: \nמבחן מאוד ספציפי אצל אייל, אם מכירים אותו והולכים להרצאות אפשר להצליח מאוד. הוא אוהב מאוד את טבעת מביוס (מי שמכיר מכיר), מטפס הרים/גולש עם הגרדיאנט, הגדרה פיזיקאלית של הרוטור/דיברגנס ועוד כל מיני שטויות כאלה, אתם תכירו...\n\nהשורה התחתונה: \nהקורס הכי סבבה של הסמסטר של חשמל, ובכללי קורס חביב, לא קל בכלל אבל חשוב ויחסית מעניין, תורם לפיזיקה.\nרבקה אני אתגעגע אלייך 😘", "timestamp": 1678871177233}, {"author": "חצילואיד דו יריעתי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ד\"ר אייל פרג'י 🍆\nחוות דעת - הרצאות: \nאייל שועל קרבות.\nמרצה מאוד נחמד ואוהב את הסטודנטים, הוא מספר הרבה סיפורים בהרצאות (בעיקר על גרושתו). הקצב בהרצאות הוא מאוד איטי אבל בתכלס דיי נהניתי. חשוב מאוד לבוא להרצאות, כי הוא לוקח את הקורס לנישה שלו. המבחנים שלו בכלל לא דומים למבחנים מסמסטרים אחרים.\n\nשם המתרגלת: ד\"ר רבקה אביטל\nחוות דעת - תרגולים: \nאין על הדוקטור שלנו. מתרגלת מספר 1 בטכניון. אם היא מתרגלת אז כמובן לכו אליה.\nלא הייתי בתרגולים שלה אבל שמעתי שגם איריס מעולה.\n\nשעורי הבית: \nשיעורי בית סבבה. לפעמים טכניים וארוכים אבל מבחינת רמת הקושי, הם יחסית קלים לעומת הקורסים המתמטיים האחרים שלוקחים בחשמל\n\nהמבחן: \nמבחן הזוי לגמרי. יש שאלות שרק אם הייתם בהרצאות אתם יכולים לענות עליהם. ובאופן כללי על כל הדברים המהותיים של הקורס (משפט הדיברגנץ, גרין, סטוקס) לא שאלו בכלל.\nעם זאת אפשר להוציא בקורס הזה ציון גבוה אם משקיעים.\nאם אתם עם הייל תלמדו את המבחנים שלו בעיקר, אפילו לפתור פעמיים כל מבחן.\nבהצלחה!\n\nהשורה התחתונה:  קורס סלמתק, תנצלו את זה שהוא 5.5 נק\"ז", "timestamp": 1678879583391}, {"author": "מאיה", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עדי \nחוות דעת - הרצאות: היא מרצה מעולה. ממש מדברת בגובה העיניים אני ראיתי הקלטות שלה וזה היה מעולה \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: לכו לאיריס. היא מעולה. על ספידים אבל צריך לבוא מוכנים. \n\nשעורי הבית: סבבה ממש, רלוונטים גם למבחן מאוד\n\nהמבחן: לפני המבחן היה פקל מבחן של סטאדיס עם חן הררי. לקחתי אותו גם בחדוא 1מ וזה עזר לי אז ניסיתי שוב. זה כן סגר לי פינות וטריקים. סהכ היה ממש הוגן אבל צריך לשבת ולתרגל הרבה\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1684841755373}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אייל פרג'י\nחוות דעת - הרצאות: מרצה מעולה - מאוד ברור ושמח להתעכב על שאלות. אחלה מרצה שבעולם, אין על אייל\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה פשוט, אין הרבה מה להגיד.\n\nשעורי הבית: קלים יחסית, לא לוקחים יותר מידי זמן.\n\nהמבחן: היה קל באופן מפתיע, מבחן יותר מהוגן.\n\nהשורה התחתונה: אם קורס חובה במתמטיקה אז לפחות היה די קל.", "timestamp": 1689780564495}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמדהימה, אכפתית וכיפית\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nאין על המתרגלת הזאת אני נשבע, אנרגיות יפות, מסודרת, מבינה את הסטודנטים ואיפה קשה להם. לא איטית מדי ולא מהירה מדי. היא באמת מדהימה\nאין סיכוי שתצאו מהתרגול שלה כך שאתם לא מבינים היטב את החומר וזה מדהים!!\nשעורי הבית: \nהוויבוורקים קצת מעיקים אבל מאוד עוזרים וקריטיים להבנת החומר\nהמבחן: \nעדיין לא ניגשתי אבל בהצלחה לכולם!\nהשורה התחתונה: \nקורס לא פשוט אבל ניתן להצליח בו לפי דעתי", "timestamp": 1689781386590}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה טובה ועוברת על החומר בצורה ברורה. היא לא נתקעת על הסברים יותר מידי ומציגה את הנושא קצר ולעניין. מומלץ מאוד\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מבין הטובים שיש. מסביר הכל ועונה על שאלות בצורה ברורה.\n\nשעורי הבית: השיעורי בית היו קלים ולא לקחו יותר מידי זמן.\n\nהמבחן: הוגן. אין יותר מידי להגיד, רוב החומר היה בו ולא היה יותר מידי קשה\n\nהשורה התחתונה: קורס טוב ומעניין", "timestamp": 1689781978746}, {"author": "ש", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לפי הקלטות של אביב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אורן ירושלמי\nחוות דעת - תרגולים: מתרגל אחד הטובים, אווירה טובה חשוב לו שיבינו מהבסיס של דברים\n\nשעורי הבית: \n\nהמבחן: מאוד דומה לקודמיו, מאוד הוגן\n\nהשורה התחתונה:", "timestamp": 1690358383504}, {"author": "ציור נכון, חצי פתרון", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לידיה פרס הרי \nחוות דעת - הרצאות: מרצה מצויינת! היא ריגורוזית מאוד, אבל גם מצליחה להדגיש מה תכל'ס צריך לדעת ומשתדלת להראות כמה שיותר דוגמאות. בשונה ממד\"ר, היה אפשר לתפוס מקום טוב בהרצאות שלה \n \nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: פשוט מעולה! היא איטית יחסית, אבל היא מסודרת וברורה מאוד.\nאם אתם מעדיפים להיחשף למגוון יותר גדול של תרגילים, אולי עדיף ללכת לתרגולים של רבקה\n\nשעורי הבית: הגיליונות הפתוחים פשוטים יחסית ולא לוקחים יותר מדי זמן. הוובוורקים ארוכים יותר, ונחשפים שם למגוון רחב יותר של תרגילים\n\nהמבחן: הוגן מאוד. אם עדי מרצה אחראית, תדאגו לפתור מבחני עבר שלה ולחזור על שיעורי הבית כמו שצריך כי יש קונספטים שחשובים לה שמופיעים כמעט בכל מבחן\n\nהשורה התחתונה: סך הכל קורס סבבה, מסביר בדיעבד את כל המתמטיקה שמשתמשים בפיזיקה 2", "timestamp": 1690359171475}, {"author": "נתי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: מרצה מצויינת, ממליצה עליה בחום. מאוד ברורה, מנגישה את החומר ומרגיש שאכפת לה מהסטודנטים. נותנת טיפים טובים וממחישה את מה שנלמד.\n\nשם המתרגל/ת: אפרת אברם\nחוות דעת - תרגולים: מתרגלת מעולה, עברה איתנו על כל התרגילים החשובים באמת, בחרה תרגילים ספציפיים שמתאימים למרצה האחראית כדי שנצליח בבחינה. משקיעה מאוד ואכפת לה מהסטודנטים.\n\nשעורי הבית: שיעורי בית לא כאלה קשים וגם יש רפרנסים משנים קודמות וממבחנים. שווה את ההשקעה כי השאלות חוזרות על עצמן בבחינה.\n\nהמבחן: המבחן היה הוגן. חזר על מה שעשינו בתרגולים ובהרצאות. הוא דורש הבנה של החומר ולמידה לפני אבל ממש אפשר להצליח בו.\n\nהשורה התחתונה: קורס נחמד, מפצה על חדווא 1ת' והרבה יותר כיפי ממנו ומרגיש רלוונטי למקצועות בהמשך", "timestamp": 1690361191729}, {"author": "לא חשוב", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עדי וולף המלכה\nחוות דעת - הרצאות: \nאחלה מרצה בטכניוןןןן\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: איריס מעולההה\n\nשעורי הבית: עדי ממחזרת הרבה רעיונות משיעורי הבית אז ממולץ להשקיע בהם\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1690479648691}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דר אירנה גורליק\nחוות דעת - הרצאות: מרצה נהדרת שאכפת לה מהסטודנטים \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת נהדרת ואנרגטית\n\nשעורי הבית: לא קשים כל כך\n\nהמבחן: מבחן לא קשה אבל הבדיקה מאוד מאוד דקדקנית\n\nהשורה התחתונה: יחסית לחדוא 1 זה קורס יותר קליל", "timestamp": 1690895513261}, {"author": "לולו", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מרצה סבבה\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: כולם רצים לתרגולים של רבקה ושל אפרת, לדעתי ניקה אחלה ואם יש אופציה להגיע אליה והכיתה יחסית קטנה זה עדיף בהרבה.\n\nשעורי הבית:  גליונות וובוורק קשים, גליונות פתוחים להגשה סבירים לגמרי.\n\nהמבחן: מבחן הוגן, אפשר להצליח אם מתכוננים ועוברים על החומר כמו שצריך ובעיקר אם לא מזניחים במהלך הסמסטר כי יש כמות חומר גדולה. אם עדי מרצה אחראית לעשות את כל המבחנים שלה ולהבין את סוג השאלות כי הרעיונות בסוף דיי חוזרים על עצמם.\n\nהשורה התחתונה: קורס מעניין ממש, אחלה של צוות.", "timestamp": 1691071927643}, {"author": "ללניה", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: \nמעולה, קצת איטית בקצב אבל לי זה התאים בול. ממליץ מאוד להשתמש ברשימות שבדרייב. היא כמעט לגמרי נצמדת אליהן וזה מקל על הלימוד.\nשם המתרגל/ת: ראואן\nחוות דעת - תרגולים: \nמעולה, ממליץ בחום. מסבירה באופן ברור ומתעכבת רק ככשואלים שאלות. לרוב אין הרבה סטודנטים אצלה מה שיוצר תחושה של יחס אישי וכמעט תמיד משאיר זמן בסוף התרגול לשאלת שאלות נוספות\nשעורי הבית: בסדר\n\nהמבחן: בסדר\n\nהשורה התחתונה: להשקיע בהבנה במהלך השנה ויהיה בסדר", "timestamp": 1691481471055}, {"author": "עבד אלרחמן ערמוש", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מצוין\n\nשם המתרגל/ת: רבקה אבטל\nחוות דעת - תרגולים: מתרגלת מצוינת\n\nשעורי הבית: מצוין\n\nהמבחן: מצוין\n\nהשורה התחתונה: מצוין", "timestamp": 1691610149450}, {"author": "מיכאל חזן", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \nיש לה רשימות טובות והיא עובדת על פיהן\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: \nמאוד מומלץ, גם לו יש רשימות טובות.\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הרבה חומר", "timestamp": 1691612690627}, {"author": "Raz Kachal", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nגיליתי מאוחר את ההקלטות של צנזור - מומלץ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאפרת מתרגלת מעולה, בגדול נותן את כל הכלים לפתור ש\"ב ומבחנים.\nשעורי הבית: \nלא עמוס מידי, בזוגות ויש רפרנסים.\nהמבחן: \nהוגן.\nהשורה התחתונה:", "timestamp": 1693811955076}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אירנה \nחוות דעת - הרצאות: לא התחברתי במיוחד, חמודה מאוד אבל לא ממש מובנת לדעתי האישית.  אם עדי וולף המרצה האחראית ממליצה ללכת להרצאות שלה. \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: איריס האלופה, אבל מאוד מבולגנת ולא מתאימה לכל אחד. \n\nשעורי הבית: בסדר בסה\"כ, יש רפרנסים אבל חשובים להבנה - עדי לוקחת שאלות ממבחנים. \n\nהמבחן: מועד א היה די הוגן אם לומדים ויודעים את החומר מספיק, מועד ב לדעתי לא הוגן בכלל. \n\nהשורה התחתונה: קורס חובה, בסה\"כ קורס בסדר והחומר לא קשה מדי פשוט הרבה חומר. להיות על החומר בסמסטר ולתרגל מספיק לפני המבחן והסיכויי כישלון לא כאלו גבוהים.", "timestamp": 1697365446778}, {"author": "לא חשוב", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עדי וולף ואז לידיה פרס\nחוות דעת - הרצאות: עדי מרצה טובה יחסית מסבירה טוב בגדול וסטודנטים יכולים לשאול אצלה בהרצאה בכיף, אך שיטת הלימוד אצלה משעממת יחסית. בגלל זה עברתי אצל לידיה. לידיה מסבירה טוב גם וכמעט כל מילה שהיא אומרת בהרצאה רושמת על הלוח, לכן יש הרבה מה לכתוב תוך כדי ההרצאה, כמו כן, הקצב שלה גבוה יחסית לעדי בהעברת החומר.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מצוינת! ממליץ בחום\n\nשעורי הבית: יחסית קלים, במיוחד ש\"ב הפתוחים. למרות הוויבוורקים שמאוד ארוכים ומשעממות כי יש הרבה עבודה שחורה כדי לפתור.\n\nהמבחן: ניגשתי למועד רק למועד ב, המבחן היה בסדר בגדול אך הייתה שאלה אחת שהפכה את המבחן לקשה יחסית, ומשקלה היה 34 נקודות. אבל עבר סבבה והייתי מקום 9 בקורס!\n\nהשורה התחתונה: תשקיעו בקורס הזה כי משקלו 5.5 נק\"ז, וניתן לקבל 90+ אם מבינים טוב את החומר ופותרים מספיק מבחנים ובמיוחד מבחני עדי שהם די פתירים.", "timestamp": 1697641825963}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לידיה ואז מוקלט של צנזור\nחוות דעת - הרצאות: לידיה מרצה מצוינת, אבל הכיתה הייתה עמוסה. עברתי למוקלט של צנזור וזה היה מצוין! אין על צנזור ועל ההסברים שלו, מומלץ בחום! \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: המתרגלת הכי טובה שהייתי אצלה. משקיעה המון בתרגולים ומאוד אכפת לה מהסטודנטים ויודעת להתאים את התרגולים בהתאם למרצה האחראי. \n\nשעורי הבית: סבבה לגמרי\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: לכו לאיריס ותפתרו מלא תרגילים !", "timestamp": 1697723824220}, {"author": "11", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מרצה מעולה, הרצאות טובות וברורות. יחס מעולה לסטודנטים\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: תרגולים ממש טובים, מסבירה טוב עם הרבה טכניקות חשובות.\n\nשעורי הבית: סהכ הגיליונות די קלים, פחות כבדים מהשיעורים בקורסים המתמטיים האחרים. הוובוורקים קשים.\n\nהמבחן: מועד א היה הוגן, מועד ב זוועתי- המבחן הכי קשה של עדי בקורס הזה בפער.\n\nהשורה התחתונה: סהכ לא קורס כזה עמוס ביחס לנקז, אפשרי להוציא בו ציון טוב בטח אם עדי אחראית כי יש לה עקרונות שחוזרים על עצמם בהרבה מבחנים (גם במועד ב הקשה שהיה לנו).", "timestamp": 1703019301701}, {"author": "alon shorr", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: אני חושב שלידיה אחת מהמרצות בטכניון שיותר אכפת לה מהסטודנטים. תמיד תענה על כל שאלה בשעת קבלה ובאמת נהנית להעביר את השיעורים. גם נותנת מענה לבעיות ודברים שהסטודנטים מציפים. מאוד פדנטית על החומר ועל איך שהיא מעבירה אותו. אם מתאים לכם סגנון ההוראה שלה, ממליץ מאוד. מה שכן, היד שלכם תכאב מרוב כתיבה בסוף השיעור אם לא תשיגו סיכומי הרצאות..\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nנותנת את כל הטריקים והשטיקים שיש במבחן, עוברת ממש מהר על מלא תרגילים. אם אתם צריכים הבנה עמוקה של התרגילים לא הייתי הולך. אם אתם מרגישים סבבה ורוצים לדעת את כל הטריקים אקסטרה ואין לכם בעיה עם קצב מהר, לכו על זה.\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1704705179744}, {"author": "שוסי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: \nיוחאי הוא המרצה הכי טוב שהיה לי בתואר עד עכשיו.\nהוא מסביר ממש טוב ודואג שכולם יבינו.\nכשיושבים בהרצאה זה מרגיש כאילו הוא מלמד ממש לאט ושבחיים הוא לא יספיק את החומר. אבל אז מגלים שמספיקים הכל. אני לא יודע איך הוא עושה את זה אבל זה כמו קסם.\nמעבר לזה, הוא בן אדם ממש נחמד ומנסה להתחשב בסטודנטים - בין אם זה בהורדת עומס שיעורי הבית עקב תלונות או בהתחשבות במצב ומתן הקלות.\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: \nמתרגלת ממש טובה, מראה את כל הטריקים שיש במבחנים ואפילו שלחה לנו קישור לרשימות שלה. מה שכן היא ממש ממש מהירה ככה שרוב הסטודנטים שהלכו אליה לא רשמו אלא רק הקשיבו. אני רשמתי וזה היה די אינטנסיבי.\n\nשעורי הבית: הוובוורקים ממש ארוכים וטכניים. לוקחים הרבה זמן אבל חשובים מאוד להבנה של החומר - בעיקר לחלק של האנליזה הוקטורית.\nהגליונות הפתוחים היו ממש ממש קצרים - בגלל תלונות של סטודנטים רוב הגליונות הכילו שאלה אחת להגשה. מומלץ לעשות גם את השאלות שהן לא להגשה כדי לקבל שליטה טובה יותר בחומר.\n\nהמבחן: הרגיש מבחן יחסית סטנדרטי לקורס - לא היו באמת טריקים אלא פשוט בדיקה האם הבנו את החומר. מה שכן הוא היה מאוד ארוך וזה מתבטא בממוצע. אבל היה פקטור של 8 נקודות שכיפה על זה. מומלץ לעשות מבחני עבר של יוחאי מתל אביב כי רואים שהוא ממחזר רעיונות.\n\nהשורה התחתונה: קורס נחמד ולא  באמת עמוס במהלך הסמסטר. חשוב מאוד לפיסיקה ולהנדסה.", "timestamp": 1716236830667}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוחאי מעיין \nחוות דעת - הרצאות: המרצה הכי טוב שהיה לי עד כה בטכניון. מרצה ברור ומובן, נותן אינטואיציה ומאוד ברור על הלוח. מעבר לזה הסמסטר הנוכחי היה מאוד קשוב לסטודנטים ודאג שנבין ולא נילחץ מהמבחן. \n\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: אין עליה!! יש לה את הרשימות שלה והיא לעתים מבולגנת ומהירה מדי אבל לדעתי היא מלמדת מצוין, נותנת תרגילים טובים ורלוונטים למבחן והפלוס הוא שלא צריך להעתיק אצלה. \n\nשעורי הבית: מעיקים קצת אבל הוובורק נגיד חשוב לתרגול של החומר מאוד, והגליונות אחת לשבוע תרגיל 1 כל פעם לא נורא מדי פותרים בשעות קבלה. \n\nהמבחן: פעם ראשונה שיוחאי היה מרצה אחראי של הקורס, אז המבחן היה שונה ממבחני העבר, אבל לדעתי המבחן היה הוגן וכן בדק הבנה ולא היה יותר מדי טריקים וכאלה כמו שמרצים אחרים בקורס הזה אוהבים. \n\nהשורה התחתונה: קורס עמוס אך חובה, יוחאי מעולה.", "timestamp": 1716362764672}, {"author": "סטודנט משטחי מסוג שני", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוחאי מעין\nחוות דעת - הרצאות: יוחאי מרצה מציון. קצב טוב, הסברים ברורים, אווירה קלילה ופשוט כיף להיות בהרצאות שלו. הוא מעביר את החומר בצורה הכי טובה שראיתי עד עכשיו והוא מאוד נחמד ונעים לפנות אליו לשאול שאלות.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: רבקה מתרגלת מנוסה וחדה. היא טסה על תרגילים מה שאומר שמספיקים לעבור על כל החומר, פשוט לפעמים היא לא נכנסת לכל הדקויות של השאלה.\nהיא מכירה ומראה את כל הטריקים ונותנת אינטואיציה מצויינת לפתרון שאלות.\n\nשעורי הבית: הוובוורקים מהווים חזרה טובה על הטכניקה היבשה כמו שוובוורקים יודעים לעשות. לפעמים קצת ארוכים אבל תמיד ברמה מאוד סבירה.\n\nהגליונות הפתוחים היו רק שאלה אחת כל שבוע והיא כמעט תמיד הייתה ממש קלילה וחביבה. \n\nהמבחן: התוכן של המבחן דיי עקבי ולכן יחסית פשוט להתכונן. זה כמובן לא אומר שהוא קל - יש דיי הרבה נושאים שצריך להכיר טוב, וכמובן שהטכניקה באה עם תרגול. מבחן קשה אבל הוגן.\n\nהשורה התחתונה: זה קורס מאוד יפה, הרבה פחות מבלבל מחדו\"א 1 ונותן בסיס מצוין להמשך. מה גם שזה קורס חובה אז עדיף להנות ממנו כמה שאפשר.", "timestamp": 1716498251453}]}