{"posts": [{"author": "הודיה מאנע", "semester": "201901", "text": "כמו כמעט כל קורס מתמטי, גם הקורס הזה מכיל המון חומר ודורש השקעה, למידה ותרגול רציני. הקורס הספציפי הזה מעניין, בעיקר בזכות הרלוונטיות שלו לקורסים נוספים (יש בו נושאים רלוונטיים לחלק מקורסי הפיזיקה ויש בו לא מעט נושאים רלוונטיים למד\"ר ח'). מומלץ לפתור את רוב תרגילי הבית (ואם ניתן, אז את כולם, גם בשביל המגן, אבל בעיקר בשביל תרגול) וללמוד באופן רציני למבחן, כיוון שישנן שיטות שצריך להכיר ולדעת להשתמש בהן.", "timestamp": 1584439508000}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אלון דמטיוק\nחוות דעת - הרצאות: \nמרצה בסדר, יש לו הרבה סבלנות\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nמסבירה טוב ויש לה שיטות טובות לפתירת תרגילים, אבל טיפה מהירה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347728009}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: ממש טובים\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602483424794}, {"author": "Yonathan Mizrahi", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nתסתכלו לסנזור ביוטוב הרבה יותר טוב ואותו חומר\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nרבקה תותחית \nשעורי הבית: \nלא קל אבל מדמה את המבחן\nהמבחן: \nנופלים על קטנות ממש\nהשורה התחתונה:", "timestamp": 1608619929727}, {"author": "....", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אייל פראגי\nחוות דעת - הרצאות: אייל הוא מדבר רק על מה שצריך בתכלס, בלי יותר מידי הוכחות מיותרות\n\nשם המתרגל/ת: יורי גייבה\nחוות דעת - תרגולים: מאוד איטי...\n\nשעורי הבית: לא קלים ותופסים המון זמן\n\nהמבחן: המבחן של אייל קשה. ראו היסטוגרמה.\n\nהשורה התחתונה: אם אתם איתו, שיהיה לכם בהצלחה", "timestamp": 1614182034144}, {"author": "Sapir", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: איל\nחוות דעת - הרצאות: מלמד את החומר בצורה סבירה, לא מספיק כדי לגשת למבחן, צריך להיעזר בחומרים אחרים ולשאול שאלות.\n\nשם המתרגל/ת: יורי\nחוות דעת - תרגולים: מגיע תמיד באיחור, מסביר את מה שהוא מעביר בצורה טובה אבל מרגיש שאין תקשורת בין התרגולים להרצאות..\n\nשעורי הבית: \nלא קלים\nהמבחן: \nהיה מבחן קשה מאוד. יש דיסטוננס מטורף בין הרמה של החומר הנלמד לבין הרמה של המבחן.\nהשורה התחתונה: הקורס יכל להיות הרבה יותר מובן  ופייר. חבל.", "timestamp": 1616534544286}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: מעביר את החומר בצורה יחסית ברורה. מגיעים יחסית מעט להרצאות שלו אז גם אפשר יותר לשאול שאלות ולהתעכב. ממליץ ממש למי שמצליח להתחבר\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מאוד מהירה. אם לא מצליחים לעקוב אחריה מומלץ לעבור מתרגל. מעבירה את החומר בצורה ברורה ומסודרת, יש גם רשימות של התרגולים שלה שעוזרות מאוד. המון נסיון\n\nשעורי הבית: לוקחים הרבה זמן. הגליונות מאתגרים ודורשים השקעה. הוובוורקים מאוד עוזרים להפנים את החומר ואת הטכניקות לקראת הקורס\n\nהמבחן: שחיטה.\n\nהשורה התחתונה: קורס מעניין מאוד ומאוד רלוונטי לקראת המשך התואר. מומלץ להשקיע לאורך הסמסטר כדי להבין את החומר כמו שצריך. יותר קל מחדו\"א 1מ'", "timestamp": 1626103823470}, {"author": "נ.ה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nאחלה של מרצה מאוד מצחיק , מעביר את החומר בצורה יחסית ברורה\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת פשוט מדהימה , מסבירה טוב את החומר .\n\nשעורי הבית: יש גיליונות וובוורק לא כאלו קשים , אם זאת לדעתי גם לא כאלה דחופים (משמשים בתור מגן ) אבל עדיין ממליץ לעשות אותם מכיוון שעוזרים להטמיע את החומר\nהמבחן: קשה אך אפשרי \n\nהשורה התחתונה: סך הכל אחלה קורס , כן מעניין וכן רלוונטי להמשך , אני ממליץ לשקול לעשות פיסיקה 1 לפני הקורס כך כי חלק מהנושאים יש בפיסיקה 1 ולכן יכול להקל", "timestamp": 1626108337410}, {"author": "Alen", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: מעביר את ההרצאות בצורה מעניינת , דואג להבנת הסטודנטים ומאוד אכפתי לשאלות .\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: אחד המתרגלים הטובים ביותר שיצא לי לראות , תותח במה שהוא עושה , מראה את הכל בצורה מאוד מובנת . דואג להבנת שיטות הפתרון ורק אז לטכניקה . עונה על כל השאלות ומשרה אווירה מאוד טובה בתרגולים שלו.\n\nשעורי הבית: לא קצרים , דורשים השקעה והבנה של החומר , אבל מאוד עוזרים . בנוסף הם דומים לשאלות ממבחנים מה שמשפר את ההבנה של החומר דרכם.\n\nהמבחן: הוגן , דורש השקעה אך זה מצופה מכל קורס .\n\nהשורה התחתונה: קורס מאוד מעניין , הרבה יותר מחדווא 1 והווריאציות שלו , דורש השקעה כמו כל קורס של אותה כמות נקז .", "timestamp": 1626187985291}, {"author": "Tamar Hasson", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלכס קופרמן\nחוות דעת - הרצאות: \nמדהים מדהים!! מסביר פשוט טוב, לצאת מההרצאה כשהחומר ברור\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nאין כמוה כולם כבר יודעים\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626435009661}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה פשוט מעולה. מעביר את ההרצאות בקלילות ומשלב דוגמאות רבות ובדיחות רבות שמאוד עוזרות להבין את החומר. לפעמים מרגיש כאילו ההרצאה היא סטנדאפ. מידי פעם כשהוא מסביר עקרונות חשובים הוא צועק ונראה שהוא עצבני, אבל זו הטונציה שלו והדרך שלו להעביר את החומר - אישית לא מפריע אך עשוי להרתיע, למרות שבסופו של דבר הוא מסביר מעולה. \n\nשם המתרגל/ת: שוקי ארושס \nחוות דעת - תרגולים: שוקי מתרגל מדהים. בדרן חסר תקנה שסוגר כל פינה בחומר. רמה מאוד גבוהה של תרגילים בתרגול - יש לו ספר רוסי שהוא מאוד מחבב ומביא ממנו דוגמאות כל תרגול.\n\nשעורי הבית: הוובוורק מכין טוב מאוד לגליונות בית ומאוד כדאי לעשות אותו קודם. מאוד חשוב להיות על החומר ולא לפתוח פערים כי קל מאוד ללכת לאיבוד בקורס במיוחד בחלק האינטגרלי.\n\nהמבחן: 7 אמריקאיות ו2 פתוחות. מאוד טכני והתרגילים בו מכילים רעיונות חוזרים ככה שתרגול רב כדאי מאוד לקראת הבחינה. כמה שיותר מבחנים יותר טוב. \n\nהשורה התחתונה: קורס מעניין, הרבה יותר מחדווא 1מ'. הקורס מאוד עמוס וממליץ להיות \"על\" החומר כל הזמן.", "timestamp": 1626634140742}, {"author": "אופיר ביננטל", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ראיתי בזום. מסביר בסדר גמור\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: רצה מהר על החומר אבל מסבירה מעולה כולל דגשים על טעויות נפוצות\n\nשעורי הבית: 12 גיליון WW. נדרש מעל 80 כדי לקבל את כל הציון על הגיליון ונדרשים 10 גיליונות. ו6 גיליון להגשה. מתוכן 5 חובה. \n\nהמבחן: 7 שאלות אמריקאיות ו2 שאלות פתוחות\n\nהשורה התחתונה: לא קורס פשוט אבל חייבים", "timestamp": 1626714703262}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: לדעתי ניר לא מרצה טוב, מאוד מסורבל וקל לאבד אותו.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: פשוט מעולה, מסבירה טוב את החומר, ועושה הרבה סדר.\n\nשעורי הבית: מאוד מעייפים, אבל בסך הכל העניין עם הWW והגיליונות להגשה היה מאוד נכון לדעתי (צריך 80+ בWW ואז יחושב כ100)\n\nהמבחן: יותר קשה מבדרך כלל אבל סך הכל הוגן לגמרי, צריך להיות חד על החומר בשביל להצליח.\n\nהשורה התחתונה:  קורס מאוד טכני, אומרים שהוא יותר קל ומעניין מחדו\"א 1מ אבל לדעתי זה הפוך.", "timestamp": 1626721937322}, {"author": "A.A", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "חוות דעת - הרצאות:  ניר בן דוד\nכבן אדם, ניר מאוד נחמד והאווירה בהרצאות שנכחתי בהן הייתה טובה. כמרצה, לא הצלחתי להתרכז בהרצאות שלו בכלל, ולכן עברתי לראות את צנזור (ממליץ בחום על הסרטונים שלו בחדוא 2ת'). הוא סידר לי ההבנה בצורה מעולה.\n\nשם המתרגל/ת: שוקי  \nחוות דעת - תרגולים: \nשוקי מתרגל אגדי - באמת אכפת לו מהסטודנטים והוא תמיד שמח לעזור. מביא תרגילים קשים ממבחנים כבר מהשיעור הראשון כדי להרגיל אותנו לרמה ואפילו מעבר. בונוס נוסף - יש לו קבוצת ווטסאפ עם הסטודנטים שבה הוא עונה על שאלות.\n\nשעורי הבית: \nWW 10% מגן - מעל ציון 80 מקבלים 100. ממליץ לעשות, אבל לא להתעקש על 100 בכל WW - לא שווה את הזמן והעצבים.\n10% מגן גליונות בכתב - הגליונות היו סבירים מאוד.\n\nהמבחן: \nטכני מאוד - ממליץ להיות חדים על כל סוגי האינטגרלים השונים.\nהשורה התחתונה: \nאם עוקבים אחרי החומר בצורה סבירה במהלך הסמסטר, עושים את כל שיעורי הבית ופותרים הרבה מבחנים אפשר להוציא ציון גבוהה מאוד.", "timestamp": 1626848099675}, {"author": "ניר", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: הלכתי בתחילת הסמסטר לאבי והוא היה הרבה יותר טוב אבל החברים הלחיצו אותי ללכת לניר כי הוא מרצה אחראי וזו הייתה טעות, ההרצאות של ניר היו מפוצצות ואבי מסביר טוב יותר ממנו.\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: הצגה 10/10\n\nשעורי הבית: קשים אך מזל שאין רפרנס חייב לשבור את הראש ולהתווכח עם החברים כדי להבין יותר טוב את החומר\n\nהמבחן: \nוואו. לפני הפקטור 51 אחוז נכשלים היה מאוד קשה אבל כן חלק מהאמריקאיות היו מועתקות ממועדים קודמים.\nהשורה התחתונה: \nכל הסמסטר להיות על זה ולתת פייט בלמידה, להשקיע בחודש האחרון הוא יותר מדי נקודות מהמבחן", "timestamp": 1627214725142}, {"author": "איתמר זייד", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה:  ניר בן דוד\nחוות דעת - הרצאות:  לא מועבר בצורה טובה, קשה לעקוב\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים:  קצב מהיר מאוד\n\nשעורי הבית: קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס חובה, אז זה מה יש", "timestamp": 1631170160772}, {"author": "א.", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: קשה לעקוב\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: אישה מדהימה ומתרגלת תותחית על.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס סיוט.", "timestamp": 1632319204866}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: אחלה בן אדם, מרצה סביר. אהבתי אותו יותר מהמרצים האחרים.\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים:  יותר מסודרת, מסבירה לא רע ובעלת ניסיון.\n\nשעורי הבית:  קשה, אבל זה מתמטיקה.\n\nהמבחן: לא פשוט, לומדים הרבה ובקושי עוברים. אבל בעיני יותר קל מחדוא 1.\n\nהשורה התחתונה: קורס קשה, אבל תלמדו טוב ותצליחו.", "timestamp": 1634643733600}, {"author": "עמית", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מהיר מידי, לא הגיוני, צועק מלא, שואל את עצמי מה קורה פה מיליון פעם\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים:תותח \n\nשעורי הבית: זוועה, הוא כותב אותם בכתב יד לא ברור בכלל מה קורה \n\nהמבחן: מזעזע, שאלות פתוחות שאין סיכוי שתצליחו להבין איך לפתור. מזעזע\n\nהשורה התחתונה:", "timestamp": 1634835273191}, {"author": "Adan hijazi", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: בסדר\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מעולה.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1638658374861}, {"author": "Dor Katz", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אייל פריג'\nחוות דעת - הרצאות: מאוד איטי, מלמד בשיטה שונה. כשהוא המרצה היחיד חשוב להכנס להרצאות כי הוא שואל במבחן על הגדרות נורא ספיציות שלו. מסביר מעולה ועונה על כל שאלה ממש לעומק\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: מלכת עולם! מהירה ברמות אבל מפרסמת מראש את הסיכומים לתרגולים\n\nשעורי הבית: \n\nהמבחן: מי שהיה בהרצאות ובתרגולים יצליח בלי בעיה\n\nהשורה התחתונה:", "timestamp": 1644505683221}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אייל פרג'י\nחוות דעת - הרצאות: מלמד בשיטה שונה לגמרי מאיך שהקורס מועבר בסמסטר אביב, אז מי שחוזר על הקורס ומתכנן להבריז מהרצאות מפספס, מסביר לאט מאוד ונוטה להתעכב הרבה על שאלות אבל מאוד חשוב לו שכולם יבינו ומסביר בצורה מעולה, אכפת לו מאוד מהסטודנטים אבל חשוב מאוד להגיע להרצאות כי הוא שואל במבחן שאלות מההרצאות.\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: מושלמת ונותנת תרגילים שמאוד עוזרים במבחן\n\nשעורי הבית: ובוורקים מרופרנסים אבל שווה לשבת על הגיליונות ולפתור לבד כי במבחן יש שאלות מהגיליונות\n\nהמבחן: למי שהיה נוכח בהרצאות והצליח לקלוט מאייל איזה תרגילים הוא מתכוון לשים במבחן המבחן לא קשה, אבל הרבה שחזרו על הקורס בחרו לא להגיע להרצאות ונדפקו במבחן כי נשאלות שאלות על חומר שלא לומדים בסמסטר אביב, בכל מקרה מאוד מומלץ להגיע כי יש שאלות שמועתקות אחד לאחד מההרצאה\n\nהשורה התחתונה: לא להילחץ מהממוצע הנמוך יותר בהיסטוגרמה של אייל, זה נטו כי אנשים שחוזרים על הקורס לא מגיעים להרצאות ומסתמכים על מה שנלמד בסמסטר הקודם", "timestamp": 1644837015069}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: \nמרצה קצת איטי אבל אדם מאוד נחמד, מרגיש תמיד שאכפת לו מהסטודנטים ובעיקר אכפת לו שיהיה הבנה על החומר. \n\nאם לא הגעתם לשיעור ואתם חוזרים על הקורס - אין לכם סיכוי במבחן.\nשם המתרגל/ת:איריס \n \nחוות דעת - תרגולים: \nאין מה לומר על איריס, מלאך שמסתתר תחת מראה של מתרגלת, בנאדם מצחיק טוב ושכיף לקבל ממנה כל כך הרבה דברים טובים, מומלץ להקשיב לה כשהיא אומרת ״זה תרגיל חשוב״\n\nשעורי הבית: \nהוגנים ממש, מלמדים מאוד, לא ממוחזרים\n\nהמבחן: \nלא קל, אבל הוגן\n\nהשורה התחתונה: \nרק לא ניר בן דוד", "timestamp": 1646037176150}, {"author": "salma gamal zoai", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אייל פרגי\nחוות דעת - הרצאות:  חמוד אכפת לו שסטודנטים יבינו טוב את החומר ומעביר דוגמאות אבל מאוד איטי\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: בעלת קצב טוב ומעבירה טוב את התרגילים אבל מדלגת בסוף\n\nשעורי הבית: לא פשוטים \n\nהמבחן: קשה\n\nהשורה התחתונה: אפשר להוציא ציון אבל לא בקלות", "timestamp": 1646151091290}, {"author": "א.", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלון דמיטיריוק\nחוות דעת - הרצאות: הרצאות לא מאד ברורות\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מדהימה, מלא ניסון וידע של שנים", "timestamp": 1657357138879}, {"author": "Pokobar", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלון \nחוות דעת - הרצאות: באופן מפתיע אלון היה יחסית נחמד לסטודנטים במהלך הסמסטר וגם שאלות שבחדוא 1 היו מקבלות עלבון ממנו , הפעם קיבלו מענה.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מלך, תשתמשו בחשבונייה\n\nשעורי הבית: ww - לפעמים ארוכים ומעצבנים, גיליונות- רובם באורך סבבה, חשובים ללמידה\n\nהמבחן: ממוחזר, קשה אבל ממוחזר\n\nהשורה התחתונה: שיפור מחדוא 1", "timestamp": 1657744116167}, {"author": "Student", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא הבנתי מילה ממה שקרה שם\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: כיתה מפוצצת קשה לתפוס מקום אבל גרשון מלך חוזר על החומר ופותר שאלות כך שנבין טוב גם החומר וגם הטכניקות\n\nשעורי הבית: \nWw ארוכים הגליונות סבבה\nהמבחן: האמת שהמבחן שנתנו היה קשה אבל עם הרבה דברים חוזרים על עצמם מי שפתר הרבה מבחני עבר יצליח בלי בעיה \n\nהשורה התחתונה: תעשו שיעורי בית תלכו לתרגולים יהיה בסדר הקורס לדעתי הרבה יותר קל מחדווא 1מ", "timestamp": 1657802097610}, {"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: מרצה מאוד מסודר. סך הכל מסביר את החומר בצורה ברורה ושווה ללכת אליו כי הוא המרצה האחראי והוא לפעמים נותן דגשים של מה יותר חשוב לו מבחינת ניסוח או פתרון מבחן. ממליץ לתת לו עוד צ'אנס גם אם לא אהבתם אותו בחדו\"א 1, הוא פחות קר בחדו\"א 2.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מסביר בצורה מאוד מאוד ברורה. קצב מהיר מאוד, אם קשה לכם לעקוב לא ממליץ ללכת אליו. התרגילים שהוא מביא גם לא ברמה הכי גבוהה אז אם חשוב לכם לראות דוגמאות מאוד קשות בתרגולים עדיף ללכת למישהו אחר.\n\nשעורי הבית: קצת חופרים אבל הרבה יותר פשוטים ומהירים מחדוא 1. וובוורקים ארוכים אבל מאוד יסודיים ובאמת עוזרים ללמוד את החומר.\n\nהמבחן: הוגן לגמרי אבל לא לזלזל. תפתרו הרבה מבחנים משנים קודמות ותהיו בסדר. המבחן קצת קצר מדי לאורך השאלות אז ממליץ להתרגל לפתור מהר. \n\nהשורה התחתונה: רוב הסיכויים שאתם חייבים לקחת אז אין לכם יותר מדי ברירה.", "timestamp": 1658044407622}, {"author": "אתם יודעים מי זאת", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: נאדר האדיר מכולם\nחוות דעת - הרצאות: \nנאדר הוא אלוף האלופים. בכל הרצאה שלו הוא מסביר את החומר לפרטי פרטים ונותן לנו דוגמאות של מבחנים והרבה תרגילים ממש כמו תירגול. נאדר גם עונה לכולם על השאלות שלהם בצורה יפה ומלאה. הוא עושה גם צחוקים בשיעור וכיף מאוד מאוד ללמוד איתו. אחלה גבר.\nשם המתרגל/ת: גרשון האחד והיחיד\nחוות דעת - תרגולים: \nאתם יודעים שאין יותר טובים ממנו. הוא פשוט המלך של החדווה ואין לי מה להוסיף.\nשעורי הבית: \nשיעורי בית ממש בסדר. גם לימדו אותי את החומר טוב.\nהמבחן: \nהמבחן היה ממש אותו מבחן משנה קודמת עם מספרים אחרים. זה לא אומר שהוא לא קשה זה רק אומר שעם התירגול הנכון והשכל הטוב ניתן לנצח.\nהשורה התחתונה: לפתור מלא מבחנים משנים טובות ולדעת את כל הטכניקות.", "timestamp": 1658235996226}, {"author": "רז אמזלג", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nלא התחברתי בכלל. ממליץ לחפש אלטרנטיבות במידה ויש\nשם המתרגל/ת: \nאיריס/אחסאן\nחוות דעת - תרגולים: \nתותחים באותה מידה! מאוד ממליץ על אחד מהם אם מסתדר במערכת\nשעורי הבית: \nעוזרים לבנות בסיס, לא מעבר\nהמבחן: \nהוגן\nהשורה התחתונה:", "timestamp": 1658268467756}, {"author": "היי:)", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nהוא מסביר טוב, בקורס הזה הוא יותר נחמד מבחדוא 1מ. ממליצה לרשום הערות שהוא אומר למרות שאת כמעט הכל הוא כותב על הלוח, כי זה יכול לסדר את החומר כשעוברים על זה אחרכך. קורס עם הרבה טכניקה והוא ממש מחולק ל2, דפרנציאלי ובאמצע עוברים לאינטגרלים\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: \nמסביר טוב אבל הוא מהיר וקשה לעמוד בקצב. הוא כותב סיכומון קטן בהתחלה שעוזר אבל במהלך פתירת תרגילים הוא לא כותב את כל הפיתרון בצורה הכי מסודרת. מביא תרגילים ברמה גבוהה בנוסף, אז אם אתם על החומר ומסתדרים עם קצב די מהיר הוא ממש מומלץ\n\nשעורי הבית: \nגיליון פעם בשבועיים, יש גיליונות ויש גיליונות. צריך להגיש 5 מתוך 6.\nבנוסף יש וובורקים, ממליצה לפתור אותם לפני הגיליונות\n\nהמבחן: \nהמועד א היה די הוגן אצלנו, אלון מאוד חזרתי בנושאים ובמבנה של השאלות אז מאודדד מומלץ לפתור כמה שיותר מבחנים לפני המבחן. ממליצה גם לעשות סיכום קטן של כל האינטגרלים והנושאים שיש כי יש 6 אינטגרלים שונים וכל אחד עם דקויות ודברים קטנים משלו.\n\nהשורה התחתונה: קורס לא קל ועמוס טיפה, דורש וצריך להיות עם יד על הדופק אבל הוא הרבה יותר טכני מחדוא 1מ ופשוט לפתור המון תרגילים יעזור להבין את ההקשרים (יש גם אחלה של 2 ספרים בספריה שמסבירים את החומר טוב ושם יש אקסטרה תרגילים- ורוד וירוק טורקיז כזה)", "timestamp": 1658416873273}, {"author": "ליאור מאיר", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: מרצה מעולה! עונה לשאלות ונותן קשב אישיץ מסביר מעולה.\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: שוקי מאוד מסתמך על הבנה - איכות ולא כמות של תרגילים. אהבתי\n\nשעורי הבית: קשה\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1658424378905}, {"author": "ש", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: מרצה מנוסה ובעל המון ידע. מדי פעם במהלך הסמסטר עשה שיעורי השלמה כי לא תמיד היינו בקצב של החומר. אבל מרצה מדהים, קשוב לסטודנטים וחשוב לו שישאלו שאלות כדי שכולם יבינו.\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: הביא לתרגולים שאלות ברמה מאוד דומה למבחן ולשיעורי בית, מאוד עזר במהלך הסמסטר לסטודנטים וחשובה לו ההבנה.\n\nשעורי הבית: גיליון אחת לשבועיים בערך (5 גיליונות) ו10 וובוורקים קצת מעיקים אבל סך הכל חשובים להבנת החומר.\n\nהמבחן: ביחס לשנים קודמות היה מבחן מאוד הוגן. חשוב לתרגל מבחן תוך עמידה בזמנים כי 3 שעות למבחן כזה זה מאוד לחוץ.\n\nהשורה התחתונה: הרבה יותר סביר בעיניי מחדווא 1מ וכדאי להשקיע כי אפשר מאוד להצליח.", "timestamp": 1658470856794}, {"author": "mip", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: יורד לפרטים ברמה התיאורטית, מכסה כל הגדרה פורמלית, ככה שמי שחשוב לו סיכומים טובים ומפורטים יסתדר טוב עם אלון.\nנאדר כותב יותר מבולגן על הלוח אבל משתדל ממש להנגיש את ההסברים\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: כותבת ממממממש קטן ל הלוח, ויש לכיתה שלה נטיה להיות מלאה, ככה שאם לא יושבים קרוב כמעט בלתי אפשר להעתיק, בקטע הזה קצת סיוט!\n\nשעורי הבית: הגיליונות עוזרים ממש להביין ייותר טוב את החומר! כמה שיותר לנסות לפתור. ולגשת לשעות קבלה וסדנאות לקבל עזרה.\n\nהמבחן: הוגן, די תבניתי- מה שבמודל זה מה שיהיה כנראה.\n\nהשורה התחתונה:", "timestamp": 1658762718457}, {"author": "io", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: כולם אמרו עליו בסמסטר א שהוא נוראי אז לא הלכתי אליו, אבל הסמסטר הוא היה ממש בסדר, ענה בצורה בכבדת רוב הזמן וגם העביר את החומר טוב\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מושלמת!!! \n\nשעורי הבית: קשים ומייגעים\n\nהמבחן: המבחן שלנו היה הוגן\n\nהשורה התחתונה:", "timestamp": 1658815391144}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מסביר בצורה טובה. לפעמים נכנס עמוק מדי לתיאוריה וקל לאבד ריכוז. אווירה טובה בהרצאות\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: מתרגל תותח, פותר תרגילים ברמה גבוהה בתרגולים ועל כן דורש לשמור על קצב הבנת החומר תוך כדי הסמסטר. מי שמתחבר לזה יהיה מרוצה אצלו\n\nשעורי הבית: חלקם קשים חלקם פחות. לא ממש מכסים את רמת המבחן אבל כן כדאי להשקיע בהם\n\nהמבחן: הוגן\n\nהשורה התחתונה: הקורס התנהל בצורה טובה", "timestamp": 1658824471976}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: מרצה מצוין, מסביר הכל לעומק ובצורה מובנת\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון נקודה! בתור מתרגלת אחראית היא די מבולגנת אבל התרגולים שלה פשוט הכי טובים שיש \n\nשעורי הבית: עמוסים ממש\n\nהמבחן: היה מבחן פייר ממש, חלק מהשאלות ממוחזרות\n\nהשורה התחתונה: ממליצה על החשבוניה של גרשון(שאלות ממבחנים) שווה את זה", "timestamp": 1659081793061}, {"author": "L", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מרצה סבבה, הסביר באופן ברור את נושאי ההרצאה.\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: מתרגל הכי טוב שיש,משקיע בסטודנטים שלו,עוזר בזמן פנוי לסטודנטים שלו בכל שאלה\n\nשעורי הבית: דורשים מאמץ\n\nהמבחן: דורש מאמץ\n\nהשורה התחתונה: קורס טוב", "timestamp": 1659109526272}, {"author": "(;", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nברור ומסודר וסך הכל לא רע בכלל. כן קצת אנטיפת ולא משרה אווירה נעימה במיוחד, אבל לא לכולם זה קריטי.\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: שוקי מסביר מעולה את החומר ומאוד מתעכב על הבנה. העיניין הוא שהוא לא עושה הפסקות, ובנוסף בסמסטר שלנו עשה כמות מוגזמת של שיעורי השלמה (אזור הארבעה לדעתי), וזה חיסרון משמעותי בעיניי.\n\nשעורי הבית: לא קלים אבל גם לא קשים מידי. \n\nהמבחן: מאוד טכני ומאוד דומה למבחנים משנים קודמות. עם מספיק תרגול לגמרי אפשר להצליח. \n\nהשורה התחתונה: הרבה יותר מעניין, נגיש וקל מחדווא 1 לדעתי, אבל עדיין עמוס ודורש השקעה. ממליץ כן להיות ״על״ החומר במהלך הסמסטר ולתרגל מספיק מבחנים לקראת המבחן.", "timestamp": 1659447933853}, {"author": "?????", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: גם אני כמו כולם פחדתי ממנו, אך הופתעתי כי הוא היה ממש אחלה\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים:  כבר כל מה שהיה צריך להגיד עליה נאמר, פשוט אלופה.\n\nשעורי הבית: ארוכים- בעיקר וובורק\n\nהמבחן: היה ממש הוגן, תשקיעו ותצליחו\n\nהשורה התחתונה: אחלה של קורס לעומת חדווא 1 מ", "timestamp": 1660036400146}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "למדתי עם החשבוניה, מומלץ בחום!\n\nשעורי הבית: קצת ארוכים אבל מאוד טכניים.\n\nהמבחן: לא ניגשתי למועד א וזו הייתה טעות גדולה לצערי כי המועד א ממה שראיתי היה בעיניי מאוד טכני והוגן, אבל במועד ב אלון עשה שינויים משמעותיים בסוג השאלות וברמה שלהן. הרגיש כמה רמות מעל המועד א ולא כיסה את הרוב המוחלט של החומר הנלמד. \nהשורה התחתונה: קורס מעניין והרבה יותר טכני מחדוא 1מ אבל לכו תדעו על איזה מבחן תיפלו..", "timestamp": 1664608602681}, {"author": "at", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה:אלון\nחוות דעת - הרצאות: \nמעביר את החומר בצורה מסודרת ועניינית\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: \nשוקי נותן את הנשמה בשביל הסטודנטים. עוזר ומשקיע גם הרבה מעבר לשעות התרגול הסטנדרטיות, אך קשה לפעמים לעקוב אחריו ולהבין את הפעולות שהוא עושה על אוטומט, אז לכל אלה שצריכים קצב נמוך יותר כדי להבין ולעקוב, עדיף מתרגל אחר.\nשעורי הבית: \nכמו חדוא1מ\nהמבחן: \nהרבה יותר טכני והוגן, קל מחדוא1מ.\nהשורה התחתונה: \nקורס מעניין", "timestamp": 1664619547133}, {"author": "Is", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא יותר מדי הקשבתי אז גם לא ממש הבנתי\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מושלמת!! מביאה את התרגילים הכי קשים ככה שנצליח את כל התרגילים\n\nשעורי הבית: ארוכים, בעיקר רפרנסתי\n\nהמבחן: מזעזע\nאם עברתם מועד א אל תעזו חגשת למועד ב!!!!\n\nהשורה התחתונה: קורס נוראי", "timestamp": 1665229487621}, {"author": "eden", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nהרצאות די משעממות, אלון מרצה מאוד תוקפן ומזלזל מאוד. פחות התעניינתי בהרצאות, ההפך מחדוא 1, צריך לתת יותר צומת לב לתרגולים מאשר הרצאות\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: הייתי מנויה באתר חשבוניה, מאודדד עזר בהבנת החומר, מומלץ מאוד\n\nשעורי הבית: לא עמוסים במיוחד\n\nהמבחן: אם האחראי הוא אלון, לפתור הרבה מבחנים שלו, מביא את אותה תבנית. \n\nהשורה התחתונה: זה נשאר קורס של חדוא, ולא צריך להגיד מילה מעבר! בהצלחה", "timestamp": 1666520486037}, {"author": "סטודנט להנדסה", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: סך הכל בסדר.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: תותחית, מסבירה בדרכים מאוד נגישות לסטודנטים. בכל מקרה מומלץ ללכת לשני תרגולים בשבוע. (כלומר לעוד מתרגל)\n\nשעורי הבית: הוובוורקים ברמה הוגנת ומאוד מלמדים את החומר. הגליונות לא פתירים...\n\nהמבחן: מועד א היה הוגן מאוד לעומת מאוד, לכן מומלץ לא לגשת למועד ב' אם עוברים מועד א'!\n\nהשורה התחתונה: קורס קשה ועמוס אבל יותר קל מחדו\"א 1", "timestamp": 1666574918865}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: באמת רואים שהסטודנטים חשובים לנאדר והוא רוצה שכולם יצליחו. היינו קבוצה קטנה יותר בהרצאות ולכן נאדר ענה לכולם על כל שאלה שהייתה. הבעיה הייתה שזה גרם לו להימרח מאוד עם קצב הלימוד במהלך הסמסטר ואז לרוץ בסוף הסמסטר בכמה נושאים האחרונים שהיו קשים יותר עבור רוב האנשים. הוא ממש מנסה שכל הסבר שלו יהיה ברור אבל לפעמים קופץ ממחשבה אחת לאחרת וקשה לעקוב אחריו.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מקסימה, מסבירה לאט ומפורט כך שכולם יבינו ועדיין מספיקה המון בתרגול.\n\nשעורי הבית: סטנדרטיים וטכניים. לא קשים מדי :)\n\nהמבחן: קשוח מאוד. בעיקר כי נאדר שינה את מבנה המבחן ביחס לשנים קודמות מתוך רצון לעזור לנו ושהמבחן יהיה יותר פתוח עם פחות שאלות אמריקאיות, אבל זה לצערי בא לרעתנו כי השאלות לקחו כל כך הרבה זמן ששלוש שעות פשוט לא הספיקו. רובנו לא סיימנו את כל השאלות.\n\nהשורה התחתונה: קורס טכני יותר מחדוא 1 ובעייני גם יותר מעניין אבל מאוד מאוד עמוס מבחינת כמות החומר שצריך לדעת ולהבין ולכן גם המבחן עמוס.", "timestamp": 1675616468171}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: לא הייתי ,חבל על הזמן\n\nשם המתרגל/ת: אחסאן עבדאלפתאח\nחוות דעת - תרגולים: מתרגל מעולה,הכי הכי מושלם שיש,הסיבה היחידה שהיה לי קורס כיפי,ממש אכפתי,עונה על כל שאלה כמו שצריך,עובר בהתחלה על החומר בקצרה ואחר כך פותר הרבה שאלות,גם ממבחנים,אחלה של מתרגל ממש ממליצה בחום\n\nשעורי הבית: סבירים כמו כל קורס מתמטי\n\nהמבחן: קשוח ברמות,אני לא יודעת איך נאדר חושב אבל היה ממש לא סביר לא קשור למה שלמדנו המבנה של המבחן היה סיוט ברמות ממש חבל זה הפך את החוויה של הקורס במהלך הסמסטר לכלום מרצים כאלה לא נראה לי שמגיע להם להיות אחראים ממש חבל על השם של המוסד כי הם הופכים אותו לסיוט\n\nהשורה התחתונה: אם אתם משפרים את הקורס ונאדר הוא האחראי אז אל תקחו ואני אומרת את זה שוב אם נאדר הוא האחראי אל תשפרו את הקורס אפילו אלון יותר טוב,לכו לאחסאחן אם הוא היה אפילו מתרגל בקורס מתמטי אחר.", "timestamp": 1675679853857}, {"author": "Artemiy Tumanov", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמבחן ארוך ועמוס בצורה לא סבירה, ממוצע מועד א מדבר בעד עצמו. אם אתם ניגשים כדי לשפר תבדקו טוב טוב מי המרצה האחראי.\nהשורה התחתונה:", "timestamp": 1676885735798}, {"author": "--", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: לא הייתי,נראה לכם שאני יסבול את נאדר שעתיים רצוף?\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: פשוט מעולה הכי הכי מושלם שיש בכל הטכניון,מלך\n\nשעורי הבית: רגילים\n\nהמבחן: קשוח זעווה מזעזע פשוט לא נראה לי שמגיע לנאדר להיות אחרי בשום קורס מתמטי חבל ממש חבל\n\nהשורה התחתונה: אל תלכו לנאדר אל תאמינו לנאדר אם נאדר הוא אחראי אל תקחו את הקורס ,חבל ממש חבל שיש מרצה כזה בטכניון חבל על השם של המוסד ...", "timestamp": 1678790597249}, {"author": "שמעון", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: נאדר\nהרצאה אחת מספיקה כדי להבין ששום ערך מוסף לא נקבל שם(חוץ מסיפורים מיותרים על החיים). מזל שיש צנזור בעולם הזה. מי שמשפר שלא יתקרב למרצה הזה\n\nשם המתרגל/ת: אחסאן\nכפרה עליו אח יקר, מסביר טוב ולאט, יש רשימות שזה מאוד עוזר\n\nשעורי הבית:  מעצבנים ולא מועילים אבל לא קשים באופן חריג לחדוא\n\nהמבחן: עדיף לוותר מראש וללכת לים, לפחות ככה נהנה מה3 שעות האלה, ארוך פיצוצים ולא פייר בכלל\n\nהשורה התחתונה: ככל שהמרצה יותר נחמד במהלך הקורס ככה הוא ידפוק אותנו יותר במבחן, הבל הנאדר ושקר היוסי", "timestamp": 1679048742977}, {"author": "חוזר על הקורס", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: \nבהתחלה הלכתי פעם בשבוע כדי לרענן את החומר ( אחרי הזוועה במועד ב בשנה הקודמת) אבל ההרצאות שלו פשוט בלתי נסבלות , לדעתי יש לא כוונה טובה אבל הוא כל כך חופר על דברים פשוטים גם למישהו חוזר על הקורס זה לא אפשרי ( רובנו ) אבל לדעתי החומר שהוא מעביר מסודר מאוד אז אציע שתעברו עליו לווד\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \nבסמסטר שעבר הייתי אצל גרשון ו השקעתי המון התרגולים לכן רק חזרתי.. \nשעורי הבית: טכני מאוד. \n\nהמבחן: הזוועה האמיתית :/\nאבל לדעתי המבחן ו השאלות הם סבבה אבללל מה שקרה הוא שנאדר שינה את המבחן ו המטרה שהוא רוצה מהמבחן , פשוט כל המבחנים של אלון הם טכניים מאוד אז היה מספיק לעבור על כמה מבחנים ו לקבל ציון טוב , נאדר לא רצה את זה , מהפגישה שלו אחרי מועד א הבנתי שהוא רוצה הבנה עמוקה לכל המשפטים ו ההגדרות שהוא העביר , אבל אנחנו תירגלנו למבחן כמו מכונות שרואים שאלה ו בוחרים דרך פתרון ללא חשיבה נוספת ו זה מה שקרה לנו במועד א , אז למועד ב עברתי על כל הגדרה ו כל משפט שהוא העביר הייתי כל כך מבינה את החומר ( לקח לי המון זמן , 5 ימיים ) אח״כ עברתי על מועד א ו מועד ב של אלון מהסמסטר הקודם ו קיבלתי 85 :)  אז אל תתייאשו בסוף הכל יהייה טוב רק לנסות להבין מטרת המרצה האחראי ו הכל יהייה טוב \nבהצלחה לכולם :)", "timestamp": 1679267505264}, {"author": "סבאג", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דר.אגא נאדר\nחוות דעת - הרצאות: הרבה סיפורים מחיים האישיים שלו, מבזבז זמן למשך כל הסמסטר ואז בסוף מקיים שיעורי השלמה, למשך כל הסמסטר הדגיש שיש הבדל בין קורס חדוא2 לחדוא2מ.\nחומר מובן ומסודר, \n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: אותם דוגמאות מקורס חדוא2\n\nשעורי הבית: אותם תרגולי בית של קורס חדוא2\n\nהמבחן: מועד א היה בלגן, עם פקטור הממוצע היה44 ומועד ב בלי פקטור היה אותו ערך, קורס כזה שירד הממוצע בו בקמות משמעותית מדבר על המצב ההזוי שהיה למשך כל הסמסטר, והזלזול מצוות הקורס בתיקון המבחן\n\nהשורה התחתונה: קורס עמוס, בושה על הפקולאה של מתמטיקה שבוחרת בצוות כזה להיות אחראים על הקורס", "timestamp": 1680097589079}, {"author": "MO", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: הייתי בתחילת הסימסטר ובאמצע עזבתי לא הרגיש לי שזה תורם באופן מיוחד \n\nשעורי הבית: קשים... כמה ימים טובים לכל גיליון. לא הבנתי בכלל מה חשוב ומה לא ואם זה רלוונטי \n\nהמבחן: זוועה. ממוצע ברצפה. עברתי כי ראיתי את הפקל של חן הררי והוא ממש סידר לי את החומר בראש. אולי שווה לראות את זה תוך כדי הסימסטר ולא בבינג אחד \n\nהשורה התחתונה: שווה לבדוק אם לעשות חדוא 2ת - שזה יותר קשה אבל ממוצע סביר", "timestamp": 1684852133521}, {"author": "איתן", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מנסה ללמד\n\nשם המתרגל/ת: איריס וגלינה\nחוות דעת - תרגולים: מתרגלות טוב את החומר שלא מובן בהרצאות\n\nשעורי הבית: הוגנים\n\nהמבחן: קשה ולא פרופורציונלי לחומר\n\nהשורה התחתונה: לא לקחת בחורף", "timestamp": 1715804031325}]}