{"posts": [{"author": "ארפפפ", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: קצת עייף אבל נותן אינטואיציה טובה, יודע להתעכב על מה שחשוב וסך הכל ההרצאות הועברו באופן טוב.\n\nשם המתרגל/ת: גיא/נסים\nחוות דעת - תרגולים: חצי סמסטר ראשון עם נסים לא הבנתי כלום, עברתי לגיא אחרי חצי סמסטר וחיי השתנו, ממליץ בחום על גיא.\n\nשעורי הבית: אחלה, מאוד דומים למה שיש במבחן אז שווה לנסות להבין גם תוך כדי ולא רק לקראת המבחן.\n\nהמבחן: מבחנים מאוד נורמלים שבוחנים על החומר בלי יותר מדי שטיקים וטריקים בניגוד למרצים אחרים בסמסטר ג'\n\nהשורה התחתונה:", "timestamp": 1713266906141}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה בסדר סה\"כ - מרגיש כאילו הרבה נושאים כמו אמיתות לא הועברו כמו שצריך בכלל עד די הרגע האחרון\n\nשם המתרגל/ת: נסים\nחוות דעת - תרגולים: מתרגל ממש אחלה \n\nשעורי הבית: קלים יחסית\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס טכני בטירוף", "timestamp": 1713954986108}, {"author": "מפריד משתנים", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: סבבה, מסביר טוב את החומר. מה שכן אני חושב שההרצאות לא כאלה קריטיות, ויכול להיות שמספיק לקרוא את הרשימות של אחד המרצים.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: אין על התרגוליה!! מהירה וברורה. חבל שהיא לא תירגלה בעוד קורסים :(\n\nשעורי הבית: גיליון כל שבוע, רק שאלה או שתיים להגשה. לא עמוס בכלל, עוזר לוודא שאתם על החומר.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: קורס מתמטי קליל יחסית, עם קצת השקעה אפשר להוציא ציון סבבה", "timestamp": 1715008091877}, {"author": "2", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: סבבה לגמרי, מלמד בצורה מעניינת ודי תכליתית\n\nשם המתרגל/ת: נסים בראנסי\nחוות דעת - תרגולים: I believe in Nasim supermacy. מסיים את החומר של התרגול מהר ובצורה מובנת וטובה. \n\nשעורי הבית: שאלה אחת או שתיים כל שבוע, טכני ומייגע אבל מכין למבחן\n\nהמבחן: סבבה, מאוד טכני. מי שיפתור מספיק מבחנים קודמים כנראה יצליח בו\n\nהשורה התחתונה: קורס חובה", "timestamp": 1715154629664}, {"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: בכליי מסביר באופן טוב וסיכומי ההרצאה שלו היו אחלה , אך לפעמים  מתבלבל ומבלבל אותנו :(\n\nשם המתרגל/ת: נסים בראנסי\nחוות דעת - תרגולים: אחלה של מתרגל , מבין ושולט בחומר ומספיקים את הכל למרות שהתרגול הוא רק שעה\nממליצה בחום\n\nשעורי הבית: קלים יחסית \n\nהמבחן: הוגן , מי שמבין את החומר מצליח להוציא ציון מעולה בקורס \n\nהשורה התחתונה: מומלץ גם מי שלא חובה לו לקחת", "timestamp": 1715237423853}, {"author": "קושי שוורץ", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מסביר טוב אבל לעתים קרובים מסתבך ומסבך אותנו. לדעתי הרשימות מספיקות מעל ומעבר, ההרצאות מיותרות בעיניי. לעבור על הרשימות תוך כדי פתרון שיעורי הבית ואתם מסודרים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: קלילים, שאלה או שתיים. טכניים אבל עוברים בקלות.\n\nהמבחן: הוגן לגמריי. חבל לא להוציא בו 90+. תעשו את המאמץ להסביר את הכל.\n\nהשורה התחתונה: קורס נחמד. תעברו על הבחינות של שלומי מ-2018 עד 2024 והמבחן יעבור טוב.", "timestamp": 1716192583149}, {"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אברהם לוי\nחוות דעת - הרצאות: \nמעולה. נותן את התכלס של החומר, אבל גם יודע לתת את הרקע המתמטי כך ששום דבר לא יפול עלינו מהשמיים. יחד עם זאת - הוא (יחד עם שאר הסגל, אבל גם בהרצאות שלו זה בא לידי ביטוי) מניח בקיאות בכל הנושאים של קדמי הקורס.\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: \nטובה מאוד. מעבירה את התרגולים בנעימות ובארגון. מסבירה טוב. אין על מה להתלונן.\nשעורי הבית: \nקלים מאוד.\nהמבחן: \nקל מאוד. טכני.\nהשורה התחתונה: \nקורס קליל. מי שטוב במדר יסתדר בלי בעיה.", "timestamp": 1716200635013}, {"author": "לניה", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלומי גובר\nחוות דעת - הרצאות: מובן בהרצאות. רשימות לא כל כך מדוייקות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מאוד רלוונטי להמשך. ההבנה שלו חשובה וזה ניכר.", "timestamp": 1716363383398}, {"author": "s", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: בהתחלה עשה רושם של מסביר טוב,\nאבל בשלב מסוים הבנו שהוא מוכיח מלא דברים שלא לצורך וגם לא נותן אינטואיציה וההסברים ברמה נמוכה. \nבסופו של דבר היה עדיף להיות אצל שלומי (למרות שהוא קצת מרדים)\n\nשם המתרגל/ת: גיא בר שלום\nחוות דעת - תרגולים: ניסינו כמה מתרגלים בסוף הוא מסביר הכי הכי טוב, ראיתי רק מוקלט לצערי. גיא היה בשעת תרגול האחרונה וזה היה קצת מבאס, אבל סהכ מסביר טוב (אבל לא מספיק הרבה) \n\nשעורי הבית: \nחלק סביר חלק לא נגמרר\nהמבחן: המבחנים דיי הוגנים בסה\"כ.\n\nהשורה התחתונה: הקורס לא מועבר בצורה הכי טובה, בסופו של דבר קורס ומבחן סביר. שלומי היה אחראי", "timestamp": 1716555702962}, {"author": "שניר חן", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שלומי\nחוות דעת - הרצאות: שלומי הוא מרצה חמוד כזה מאוד סובלני כשעונה על שאלות ומסביר את החומר טוב הבעיה היא שאין לו כריזמה והוא מדבר קצת בשקט אז לפעמים מאוד קשה להתרכז.. שישבתי קרוב אבל היה לי מעולה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נסים - לא התחברתי.. הרגשתי שהוא מאוד מבולגן ונתקע על מלא דברים חישוביים שלפעמים בזבוזו את כל התרגול.. אבל כשזה לא קורה הוא נותן אינטואיציה טובה. \nבאמצע עברתי ליוליה -מתרגלת סבבה. \n\nשעורי הבית:  סבירים\n\nהמבחן: שלומי היה מרצה אחראי נתן מבחן יחסית קל אולי בגלל המלחמה.. היינו צריכים לתרגל ממבחני עבר של קורסים אחרים. \n\nהשורה התחתונה:", "timestamp": 1716743957983}, {"author": "ליים בת אל", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אבי לוי \nחוות דעת - הרצאות: בשתי ההרצאות הראשונות היה נראה שהוא טוב אבל איפהשהוא באמצע הסמסטר הוא נכנס למערבולת וגרר אותנו איתו לתוך הבלאגן. ראיתי את המוקלטות של שלומי וזה הציל לי את הקורס ונהנתי הרבה יותר. \n\nשם המתרגל/ת: יוליה פייגין קצוב \nחוות דעת - תרגולים: תותחית. מסודרת. דוגרית. אין יותר מה להוסיף. \n\nשעורי הבית: ארוכים וסזיפיים יחסית לקורס מתמטי, אבל זה כי יש נושאים קצת סזיפיים (העברת משתנים למשל) שנפתרים באופן שיטתי.\n\nהמבחן: הוגן גם במועד א וגם במועד ב שהיה קצת יותר קשה. שלומי כתב מייל \"המבחן במד\"ח יבחן על משוואות דיפרנציאליות חלקיות\" וזה אכן מה שקרה. \n\nהשורה התחתונה: קורס נחמד, המשך של מד\"ר, לזכור שטורם ליוביל וללמוד במקביל לפורייה ואחרי אלגברה 2מ אם אפשר.", "timestamp": 1718533155291}]}