{"posts": [{"author": "שם", "semester": "201902", "text": "ההרצאות של אורי אליאש ביוטוב מצויינות - ולכן אם לא התחברתם לסטייל של המרצה אפשר לצפות בהם.\nהתרגולים הכי מלמדים את חומר הקורס.\nשעורי הבית השונים (מתנט/גיליונות) משוחררים פעם בחודש ולכן הקורס נמצא ב\"תרדמת\" רוב הסמסטר חוץ מ3 שבועות שבהם צריך להספיק את ההגשות שנתנו (הגשות גדולות עם 11 שאלות בכל גיליון)\nכדאי מאוד לעשות את כל שעורי ההכנה במתנט - מדובר בנקודות מגן קלות שלא דורשות הרבה זמן.\nלמבחן - כדאי לעבור על התרגולים, לפתור את כמה שיותר מבחנים, לפתור את המבנים של המרצה האחראית (תפארת מאוד אוהבת לשים הוכחות במבחנים שלה - במבחנים שלה כדאי לדעת את כל ההוכחות על ורונסקיאן, אי תלות של הפתרונות ונוסחת האבל)\nמתרגלות - גלינה היא מתרגלת מצויינת והרבה התחברו לתרגולים של מרינה", "timestamp": 1597218300000}, {"author": "Narjes Hayadrey", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: \nשינה את הסילבוס, השתמש בחומר ושיטות שונות, קצת מבולגן אך הוא מרצה סבבה ומעולה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהוגן אך צריך יותר מ-3 שעות\nהשורה התחתונה:", "timestamp": 1613568178855}, {"author": "999", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ד\"ר אולג קליס\nחוות דעת - הרצאות: סמסטר ראשון שאולג מעביר את הקורס. מרצה קצת משעמם, העדפתי לראות בהקלטה. בכל זאת, מסודר ומעלה את רשימות ההרצאה שלו למודל.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מושלמת! כל מי שלקח קורס מתמטי והיה אצל אפרת בתרגולים יכול להסכים.\nנותנת תרגילים טובים ודגשים חשובים, ומסבירה כל פתרון בפירוט לפי שלבי פתרון.\n\nשעורי הבית: 4 גיליונות, הראשון היה ארוך מאוד מהרגיל, ה-3 האחרים יחסית סבירים. פעם ראשונה מועבר ע\"י ד\"ר אולג קליס לכן לא מרופרנסים כלל.\n\nהמבחן: מקוון, סמסטר קורונה.\nמועד א' היה ארוך מאוד לזמן של שעתיים, ושילב שאלות הוכחה מההרצאות יחד עם תרגילים נוספים.\nמועד ב' דומה מאוד באופי למועד א', הרגיש פחות ארוך.\n\nהשורה התחתונה: קורס טכני מאוד, חשוב להבין את הפיתוח לכל סוג משוואות ולא לזכור רק שורה תחתונה. חשוב לעבור גם על שיעורי הבית לפני המבחן, כי היו שאלות שהופיעו מהגיליונות.", "timestamp": 1616314118947}, {"author": "סתם לנסות", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: היה המרצה היחיד. בסך הכל בסדר, צריך להיכנס לראש שלו ולעבוד לפי איך שהוא רוצה כי הוא שונה ממרצים אחרים ובסוף המבחן גם הוא לפי הראש שלו.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: התרגולים היו מקוונים, והיה ממש נוח ואפרת מתרגלת מדהימה\n\nשעורי הבית: 4 גיליונות, ארוכים ממש. חשוב לעשות אותם בזמן, כלומר בכל שבוע שמתפרסם איזה תרגילים לעשות מתוכו  - לעשות. לא מומלץ (מניסיון כואב) להישאר עם יום אחרון להגשת גיליון שלא התחלתם שמקיף חצי סמסטר..", "timestamp": 1626652027369}, {"author": "פג סיני", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: הרשימות שלו כתובות בכתב של רופא אבל מתרגלים אליו. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: הצגה. מסבירה מעולה, תרגילים טובים.\n\nשעורי הבית: היו כמה גליונות קשוחים אבל סבבה סך הכל\n\nהמבחן: יום שישי הקרוב שיהיה בהצלחה...\n\nהשורה התחתונה: זה קורס חובה בתכלס אז לא כזה משנה, אבל בגדול קורס סבבה, נראה מפחיד בהתחלה אבל הרוב טכני וזורם אחרי תרגול. גם זה יעבור", "timestamp": 1628625566781}, {"author": "משה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: \nאולג היה המרצה של הקורס, לדעתי יש הרבה מה להשתפר מבחינת צילומים. הרעיון מאחורי הסרט מעניין וכן גם המסר שמאחוריו, איך פותרים מד\"ר בהחלט חשוב, אבל זוויות הצילום מאד הרסו את חווית הצפייה לצופה מרחוק. מי שבחר להגיע להרצאות, נהנה מאד.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nרן קירי שחקן נשמה, רואים שאכפת לו מהעלילה ובעיקר מהקהל בבית. מפיח חיים בעלילה ואין ספק שרן שובר את הקיר הרביעי.\nשעורי הבית: \nמייגעים וארוכים מדי, חיכיתי שייגמרו.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1629307734513}, {"author": "יעל", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: הרצאות מעולות, מדגים תרגילים רבים בהרצאה, מאמצע הסמסטר אפילו לא הרגשתי צורך להגיע לתרגולים כי יכולתי לפתור כבר את שיעורי הבית אחרי ההרצאות. מקפיד מאוד לעדכן כל שבוע מה אפשר לעשות כבר בשיעורי הבית.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מסבירה מעולה, לעיתים חוזרת על תרגילים שהראו לנו בהרצאה מה שהופך את התרגול לפחות רלוונטי.\n\nשעורי הבית: יש מעט גיליונות אבל כל גיליון ארוך מאוד- מומלץ להשתדל לעקוב אחרי המיילים בשביל לעשות את זה בזמן כי אחרת זה נצבר לגיליון ארוך מאוד. התרגילים מכינים לרמת מבחן בצורה טובה.\n\nהמבחן: הוגן מאוד, ברמה שנלמדה והייתה בשיעורי הבית\n\nהשורה התחתונה: קורס לא קשה, רק צריך לתרגל", "timestamp": 1634063660610}, {"author": "סתם מישהו", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: אחרי ההלם הראשוני שלי - מרצה טוב. מסודר וברור, אבל היו לו את הקטעים שלו עם שיטות מסויימות בהן רצה שנשתמש במבחן. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה כרגיל, מסודרת סבלנית ומסבירה ברור וטוב\n\nשעורי הבית: ארוכים ממש. לא להשאיר לרגע האחרון אלא לעשות באמת כשמפרסמים! אצלינו הגיליון הראשון היה על חומר של 5-6 שבועות ובכל שבוע פרסמו איזה שאלות מתוכו לעשות. לא היה כיף לעשות ביום עבודה של חודש וחצי...\n\nהמבחן: הוגן לגמרי\n\nהשורה התחתונה: קורס מתמטי, אבל מרגישים שהוא 2.5 נקז.. טכני יחסית (למרות שאולג אהב להוסיף גם שאלות על הוכחות והבנה ולא רק שימוש בטכניקה)", "timestamp": 1635360947175}, {"author": "אוילר", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: אלון מרצה מסודר ממלא את ההרצאה בדוגמאות. לא הסכים להקליט את השיעורים. החומר לא עבר בצורה ברורה והוא היה קצר רוח כששאלנו שאלות.\nקשה היה להבין איך ההגדרות והמושגים מתחברים ביחד. \n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: הייתה המתרגלת היחידה הסמסטר. \n\nשעורי הבית: 6 גיליונות לאורך הסמסטר. טכניים וארוכים. בנוסף גם היו וובוורקים שגם הם לוקחים לא מעט זמן. דורש כמה שעות כל שבוע. \n\nהמבחן: המבחן היה די עמוס ושונה ממבחנים של סמסטרים קודמים. היה המון דמיון למה תרגילים שראינו בהרצאות, בתרגול ובשיעורי הבית ככה שמי שחזר עליהם לפני הרוויח. יש לציין שעדיין היה קשה. \nקורס של 2.5 נז שעמוס כמו 3.5", "timestamp": 1645644149788}, {"author": "Yaniv Slor Futterman", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: לא מרצה מאוד טוב. לא כזה ברור ולא מסביר למה הדברים הם איך שהם. זה הכל ניתן לך פשוט ככה בלי הסבר או פיתוח אינטואיציה. ממליץ לראות הקלטות של יוחאי מהקורס אינפי-מדר. צריך לשים לב שאולג לא מאשר לפתור תרגילים בשיטות שונות מאלה שהוא לימד, אז אי אפשר להסתמך על הקלטות של יוחאי במקום אולג, אלא רק כמשהו משלים. אבל זה מומלץ\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מלכה. מסבירה מעולה, מאוד מועיל ופרקטי והיא כיפית\n\nשעורי הבית: \n4 גליונות מאוד ארוכים אבל עם הרבה זמן להגשה. פשוט לזכור לא לדחות את הכל לרגע האחרון.\n\nהמבחן: \n\nהשורה התחתונה: קורס סבבה. יחסית קליל רק חבל שלא מבינים לעומק למה הדברים עובדים איך שהם עובדים.", "timestamp": 1658682364703}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: קצת אעעעע כי הוא מסביר מלא תיאורה לא מעניינת אבל החומר די נחמד אז סבבה סהכ \n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אחלה מתרגלת אבל אם אתם פה אתם בטח מכירים אותה ויודעים אם הקצב שלה לרוחכם, היא די איטית לדעתי אבל זה כולה שעה תרגול אז למי אכפת, אבל הם חשובים כדי להבין את ההרצאות\n\nשעורי הבית: ואוווווו ארוכים ממש אבל יש מלא זמן להגשה אז תהיו על זה כל שבוע ויהיה בסדר\n\nהמבחן: קליל\n\nהשורה התחתונה: מלג מומלץ", "timestamp": 1660134148322}, {"author": "מאיה", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: הוא משעשע סהכ, אבל לא הצלחתי להקשיב לו. באיזשהו שלב הפסקתי להגיע \n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: איטית מאוד אבל טובה. הכל ממש מסודר אצלה ובסוף היא הכינה אותנו לא רע למבחן. לשים לב שלפעמים חסר לה זמן אז היא לא מתרגלת את כל הנושאים אז תהיו עירניים לקראת המבחן\n\nשעורי הבית: חופרים רצח. לא לדחות לרגע האחרון, אבל מאוד חוזרים על עצמם\n\nהמבחן: לא היה קשה. שאלות מאוד צפויות וממש פייר. חשוב לעבור על כל ההוכחות מראש\n\nהשורה התחתונה: אחלה קורס אבל ממש יותר מדי השקעה בשביל 2.5 נקז", "timestamp": 1660833241896}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אולג- הקלטות\nחוות דעת - הרצאות: ההקלטות מעולות! אפשר לראות אותו על פי 2 ולהבין הכל. לא הלכתי להרצאות פרונטליות הסמסטר כי לא הסתדר לי במערכת אבל בטוח שאולג מעולה גם שם.\nהאמת שלדעתי אפשר להסתדר גם רק מלקרוא את הרשימות שהוא מעלה למודל.\n\nשם המתרגל/ת: רן קירי- הקלטות\nחוות דעת - תרגולים: מומלץ ממש! פותר תרגילים בכמה שיטות, שעל חלקן כנראה לא הייתם חושבים.\nרואים שהוא יודע את החומר ממש טוב והתרגולים שלו משלימים לגמרי את מה שלא הובן עד הסוף בהרצאות.\n\nשעורי הבית: גליונות עמוסים וארוכים אבל ברגע שקולטים את הקונספט של התרגילים זה רץ. אין כרגע הרבה מבחנים שאולג בנה אז ממליץ לעבור גם על תרגילי הבית כשמתכוננים למבחן.\n\nהמבחן:  מבחן הוגן. 6 שאלות ב3 שעות, כאשר חלק מהשאלות הן נטו לפתור משוואה.\n\nהשורה התחתונה: עמוס יחסית בשביל 2.5 נקז, אבל החומר באמת נחמד ולא מרגיש מעיק כמו שאר הקורסים המתמטיים.", "timestamp": 1669241467903}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אולג\nחוות דעת - הרצאות: תגיעו לפחות בהתחלה כדי לסמן וי, אין טעם באמת כי לא מבינים כלום תוך כדי הרצאה ויש מלא הוכחות ופיתוחים לא רלוונטיים. לקראת סוף סמסטר כבר מפסיקים להגיע\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: הלכתי אליה כי היא היחידה שהסתדרה לי במערכת אבל בתכלס הבנתי שגם גלינה מתרגלת מעולה. אפרת מאוד מסודרת ותכלס בלי התרגולים לא מבינים את החומר\n\nשעורי הבית: מעיקים וארוכים!! חשוב להיות על זה כי אחכ להיתקע עם מסה ענקית של תרגילים זה לא נעים\n\nהמבחן: הוגן מאוד! גם מבחינת השאלות וגם מבחינת הבדיקה\n\nהשורה התחתונה: קורס טכני ברמות, תתרגלו מבחנים וזה הכל", "timestamp": 1675365778750}, {"author": "Hamilton", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד״ר אולג\nחוות דעת - הרצאות: הן סבירות.מסבירות לא רע את החומר. אולג מתנגד להקלטות אז קשה לסמוך על הקלטות עבר\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מיותרים, פשוט חוזרים על עוד תרגילים שדוגרי כבר היו דומים להם בהרצאה\n\nשעורי הבית: חלקם חופרים, זה תרגול טכני שחשוב למבחן\n\nהמבחן: ברובו טכני, יש שאלת הוכחה שהיא פשוט הוכחה שלמדנו ולפעמים יש שאלת הוכחה יצירתית. 90% מהפעמים זה פשוט להציב בנוסחא\n\nהשורה התחתונה: \nקורס קל וטכני. יותר קל מוקטורית.\nלא קורס מאוד מעניין", "timestamp": 1689240388974}, {"author": "Yuv Rab", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אולג קליס המלך\nחוות דעת - הרצאות: \nהרצאות קלות מאוד, ורק טכניות, כמעט ואין עניין של הבנה בקורס הזה\nשם המתרגל/ת: גלינה ליטינוב\nחוות דעת - תרגולים: \nהתרגולים קלים באותה מידה, תרגילים בסיסיים בלי קושי/טוויסט בהם\nשעורי הבית: \nסבירים, יותר מסובכים המתרגולים אך עדיין קשה לקרןא לזה \"מאתגר\"\nהמבחן: היה פשוט בזיוני. לא ראיתי עוד דבר כזה, פשוט תסתכלו על ההיסטוגרמה של מועד א'. פשוט הצגה. לדעתי אולג חשב שאנחנו כיתה טיפולית לפי המבחן. מומלץ ביותר! מעלה ממוצעים חריף, חבל שרק 2.5 נק\"ז\n\nהשורה התחתונה: קורס קל לפי הגדרה.\nמאת מלך הריש", "timestamp": 1689679336479}, {"author": "עדן", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ד״ר קליס אולג\nחוות דעת - הרצאות: מצוינות, טכניות אבל מובנות. באמת מרצה מצוין הכל ברור ומסודר. הוא ממליץ מאוד ללכת להרצאות אז לא לאכזב אותו (;\n\nשם המתרגל/ת:  גלינה\nחוות דעת - תרגולים: תרגולים מעולים, לעניין, וברורים. גלינה גם היא מעבירה את החומר מסודר, ויפה.\n\nשעורי הבית: המגן לא חובה, אבל מגן טוב. התרגילי בית לא ממוחזרים, וזה תרגול טוב לחומר.\n\nהמבחן: הוגן, רמה אחת או ברמה של שיעורי הבית, יש סוגי תרגילים לכל נושא (פלוס או מינוס נושא), שאלות הוכחה לפעמים, לכן כדאי לזכור איך לפתח את השיטה ולא השורה התחתונה של הפתרון. יש מבחני עבר, לא המון כמו בקורסים אחרים, אבל הם עוזרים, ויש גם ספר קורס באנגלית שניתן למצוא באינטרנט עם שאלות חזרה.\n\nהשורה התחתונה:", "timestamp": 1704623129044}, {"author": "בן", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות:\n אני קורא חוות דעת מסמסטרים קודמים ונוצרת לי תחושה שעשינו קורסים שונים לגמרי.\nאולג מאוד אוהב להתעכב על דברים בסיסיים, אבל כשהוא מסביר ניואנסים חשובים בפתרון תרגילים הוא מחפף. ברוב ההרצאות לא הבנתי מה הוא רוצה ממני.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nתודה לאל לאפרת.\nהיא מסבירה מעולה ונותנת אלגוריתמים מסודרים לפתרון רוב התרגילים שנפגשים בקורס.\n\nשעורי הבית: \nמאוד חופרים ובכלל לא מכסים את הנושאים של הקורס.\nבאחת מחוות הדעת הקודמות כתבו שזה מגן טוב. לא יודע אם השתנו הנהלים, אבל תרגילי הבית מהווים 10% מגן. תחליטו לעצמכם כבר אם 10% זה מגן טוב.\nהיה בנוסף \"מיני פרוייקט\" אופציונלי שנותן עוד 3% מגן, שזה פשוט עוד גיליון עם תרגילים בקינמטיקה.\n\nהמבחן: \nכנראה שאולג מנסה להוריד את הממוצע של הקורס.\n\nהשורה התחתונה: \nמצד אחד קורס מתמטי שהוא לא תיאורטי כמעט. מצד שני קורס של 2.5 נק\"ז שממש לא מרגיש ככה.", "timestamp": 1715631365639}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אולג קליס\nחוות דעת - הרצאות: מכסות את כל החומר שנדרש למבחן, נהיות יותר מעניינות לקראת סוף הסמסטר. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת לימדה אותי גם בקורס קודם ולדעתי המתרגלת הכי טובה שפגשתי, מסבירה את הכל בשלבים ובאופן מסודר. התרגולים טכניים אבל עוזרים מאוד בהבנת החומר.\n\nשעורי הבית: לא קשים אבל טכניים. מומלץ לעשות.\n\nהמבחן: שני המועדים היו הוגנים, ניגשתי לשניהם וקיבלתי אחלה ציון.\n\nהשורה התחתונה: קורס קליל, תרגילי הבית ופתרון מבחנים קודמים(של אולג) הם המפתח לקבלת ציון גבוה כי יש הרבה סוגים של משוואות דפרנציאליות וצריך לתרגל כדי לפתח את היכולת לזהות את סוג המשוואה.", "timestamp": 1718667773541}]}