{"posts": [{"author": "ירדן פלאש", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: דר׳ שוקי ארושס\nחוות דעת - הרצאות: מדבר קצת מהר, לא נותן הפסקות על מנת שיוכל להספיק יותר חומר. בסך הכל מרצה מעולה למי שמצליח להסתדר עם הקצב, אוהב לתת דוגמאות העשרה מעניינות מספרי מתמטיקה ברוסית ורומנית. עונה על שאלות הסטודנטים בבהירות ומראה איכפתיות. \n\nשם המתרגל/ת: גב׳ רבקה אביטל\nחוות דעת - תרגולים: רבקה אביטל היא מלכת המספרים הבלתי מעורערת, ואם יש אפשרות ללכת לתרגולים ששלחה, זו אפילו לא שאלה. מתרגלת מדהימה ולא הייתי מוותרת על דקה. עניינית, נותנת דוגמאות מפורטות ומסודרות, רלוונטי למרצה האחראי. חשוב לציין שהיא מדברת מאוד מאוד מהר ובדרך כלל לא מספיקים לכתוב בתרגול, אבל כותבת הכל על הלוח ואפשר לצלם ולהשלים (או לסנג׳ר חבר עם אייפד שיסכם וישלח). \n\nשעורי הבית: קשים. אין מה להגיד יותר מידי, יש עומס גם בשיעורי הבית במתנט (עבר לוובורק להבנתי) וגם בגיליונות בכתב. הגיליונות לרוב יותר קשים ומומלץ מאוד לעשות את הוובוורק/מתנט, אפילו שהוא מגן, כי מאוד מאוד עוזר להבנה של החומר.\nבמיוחד המתנט הארוך בנושא אינטגרלים. \n\nהמבחן: קשה. מאוד מאוד. חשוב מאוד לתרגל המון מבחנים ולעזור את החזרה על החומר - ככל שמתרגלים יותר מבחנים מבינים יותר טוב איזה שאלות עשויים לשאול ומה התשובות שצריך לענות (לרוב מאוד דומה בין השנים). חשוב לדייק ולא להשמיט ביטויים או מילים כי זה משפיע על הציון מאוד. \n\nהשורה התחתונה: טוב שזה נגמר. הקורס יכול להיות מאוד מאוד מעניין, אם הוא לא היה כל כך עמוס ודורש כל כך הרבה בכל כך מעט זמן. לעבור ולהמשיך.", "timestamp": 1597743220851}, {"author": "rita ibrahim", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "קורס בסיסי, קדם למלא קורסים", "timestamp": 1598094059536}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: שוקי ארשוס\nחוות דעת - הרצאות: \nמרצה טוב מאוד שמסביר את החומר בצורה ברורה\nשם המתרגל/ת: יוסי כהן\nחוות דעת - תרגולים: \nאחלה מתרגל, מביא דרכים נוחות וטובות לפתרון תרגילים\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347218379}, {"author": "מור", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nהוא ממש לא נחמד בזום יורד על התלמידים מלמד בסדר סהכ השתמשתי לרוב בסיכומים הכתובים שלו ולא בסרטונים\nשם המתרגל/ת: תמוז ורבקה\nחוות דעת - תרגולים: ממש ממש אחלה שתיהם מסבירים טוב כותבים יפה  \n\nשעורי הבית: \nסבבה הסרוקים קשים \nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612277559180}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nלמדתי איתו בזום, מתנהג כאילו אין לו רגשות ולא פעם הביא תחושות מאוד לא נעימות לסטודנטים שהעזו בכלל לשאול אותו שאלה. מתנהג ממש כמו רובוט. בחודש האחרון נהיה לפתע קצת יותר נחמד.\nמבחינת העברת החומר היה מקצועי ויסודי ולמי שהיה בפוקוס כל הזמן גם היה מובן.\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nמתרגל מעולה, עונה על כל שאלה, מסביר את עצמו גם כמה וכמה פעמים כשלא מובן לעומק.\nשעורי הבית: \nשיעורי הבית תאמו את הרמה שהוצגה בתרגולים.\n\n\nהשורה התחתונה: קורס לא פשוט, אבל ככה כל הקורסים המתמטיים.", "timestamp": 1612360741012}, {"author": "ל", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: אלון מעביר את ההרצאות בצורה מאוד מסודרת אבל לא כל כך עוזר בלענות על שאלות ולהבין.. יתרון יחיד - מרצה אחראי\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: תרגולים מעולים!\n\nשעורי הבית: יש וובוורק כל שבוע בערך וחמישה גיליונות להגיש.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612521363356}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  אלון דמיטריוק\nחוות דעת - הרצאות:  מועברות בצורה לא טובה ולא מובנת\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nמתרגל מעולה! נקודה של אור בקורס המטורף הזה\nשעורי הבית: \nקשים מאוד\nהמבחן: \nקשה מאוד\nהשורה התחתונה:", "timestamp": 1612725185315}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: קצת יבש ולפעמים לא ברור, בסדר סך הכל\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מתרגלת מעולה, עניינית, מבינה מה היא עושה, מסודרת \n\nשעורי הבית: יש כמות מכובדת של שיעורי בית, ברמה יחסית גבוהה ולוקחים יחסית הרבה זמן\n\nהמבחן: קשה יחסית אבל עם שאלות שחוזרות על עצמן\n\nהשורה התחתונה:", "timestamp": 1612776494021}, {"author": "dana", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מונוטוני, לא עונה ברור על שאלות\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מדהימה, מסבירה הכל בצורה מאוד מסודרת ומסבירה בדיוק איך לענות על שאלות\n\nשעורי הבית: ארוכים\n\nהמבחן: השאלות פתוחות היו נחמדות. האמריקיות קשות", "timestamp": 1612790689014}, {"author": "אופיר ביננטל", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: לא עונה על שאלות בצורה נעימה כל כך, בד\"כ מרצה אחראי וכזה קורה- זה מורגש. רושם על וייטבורד שזה נוח דרך הזום\n\nשם המתרגל/ת: דורון אלעד\nחוות דעת - תרגולים: מעולה לאלו שאוהבים את התרגולים הקטנים עם הייחס האישי. נותן המון ביטחון ומשקיע בסטודנטים שמגיעים אליו. נותן אווירה לימודית מאוד נעימה ומאוד עוזר להבין את החומר\n\nשעורי הבית: די קשים\n\nהמבחן: בד\"כ די חוזר על עצמו. בתקופת קורונה היא מבחן קשה\n\nהשורה התחתונה: לא פשוט. נדרש להשקיע הרבה", "timestamp": 1612952834076}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: מרצה טוב\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מתרגלת מקסימה, קצב ההוראה מאוד מהיר ולא מתאים לכולם, קצת מבולגנת מבחינת הכתיבה שלה.\n\nשעורי הבית: רבים, ארוכים וקשים \n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס קשה", "timestamp": 1613029691152}, {"author": "~~", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: אל תהיו מופתעים אם לא נעים בכלל לשאול שאלות. שמעתי במוקלט והיה בסדר גמור\n\nשם המתרגל/ת: דורון אלעד\nחוות דעת - תרגולים: דורון מתרגל פשוט מעולה. גם מאוד נעים ומשרה אווירה טובה, וגם מסביר מספיק לעומק, מספיק בסבלנות ונעזר באופן מעולה בציורים, בשאר התלמידים ועוד. היה לי לא פשוט אבל הוא באמת הפך את המקצוע להרבה יותר סביל.\n\nשעורי הבית: עמוס. לא תענוג גדול\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613340001066}, {"author": "Calculus", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: נהניתי בכל דקה בהרצאות שלו, מסודר, מסביר מעולה, אכפת לו המון מסטודנטים, מספיק חומר, בקיצור מרצה מושלם.\n\nשם המתרגל/ת: גרשון אברהם.\nחוות דעת - תרגולים: מתרגל מאוד מסודר, יש לו מצגות מאוד מסודרות ומסביר מעולה עד הסוף ועונה על כל השאלות, תמיד מספיק את החומר, לא צריך לכתוב כי כל המצגות שלו מכילות את כל החומר עם התרגילים.\n\nשעורי הבית: 6 שיעורי בית, מומלץ לעשות ולהשקיע כי תורמות המון להבנה.\n\nהמבחן: בתקופת הקורונה האמריקאי היה קשה מאוד, אבל יצאו פייר וקיבלנו פקטור.\n\nהשורה התחתונה: קורס בסיסי וקשה בסמסטר ראשון, צריך המון השקעה והבנה, אישית נהניתי מהקורס כי בחרתי במרצה ומתרגל שאהבתי ללמוד אצלם.", "timestamp": 1613376408945}, {"author": "מקס", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דר. יוסף כהן \nחוות דעת - הרצאות: מרצה מדהים, מסביר באופן טוב וברור, בהרצאות שומר על אווירה טובה ומצחיקה. נותן הרבה מעבר לחובות שלו כמרצה, מעבר לשעות ההרצאה ושעות הקבלה עונה על כל שאלה של הסטודנטים, נותן טיפים לקראת המבחנים ובאמת הולך מעל ומעבר למען הסטודנטים שלו.\n\nשם המתרגל/ת: גב' הילה מעיין\nחוות דעת - תרגולים: מתרגלת טובה ומנוסת, מסבירה טוב ונותנת דוגמאות פרקטיות, אבל לא הייתי ממליץ להיות אצלה, משום שהכיתה שלה מלאה בסטודנטים (בערך מאה ומשהו), שואלים אותה מיליון שאלות ובסוף אני מוצא את עצמי בטלפון מחכה שיפסיקו לשאול ואפשר יהיה להתקדם הלאה לחלק הפרקטי בחומר.\n\nשעורי הבית: לשיעורי הבית ברובו לא נותנים הרבה זמן עד להגשה, ברוב המקרים פותחים אותם כאשר רק את החלק ההכי ראשון בהם, אז ממליץ לחכות עם להתחיל לפתור את הWW לפחות, כי יצא כמה פעמים שישבתי שעות על לפתור משהו שלא תורגל או נלמד בכלל. ההגשות בכתב פשוטות יחסית, יש המון רפרנסים, לדעתי מאוד שימושיות לתרגול החומר. הWW מאוד עמוסים, המון שאלות ורובן קשות, בנוסף גם הנושא שהועלה מקודם לא עוזר.\n\nהמבחן: מבחן כואב, אלון דמיטריוק עושה מבחן קשה, צריך להיות מעבר לפיקס על החומר כדי להצליח בו. אין כמעט פתרונות לשאלות אמריקאיות, מה שמקשה על הלמידה. ממליץ לקראת הלמידה למבחן לא ללמוד את כל החומר ישר ולפתור מבחנים, אלא לשבת שעה לעבור על כל המבחנים מהעשור האחרון, לקטלג את כל התרגילים לפי נושאים ולפתור נושא נושא לפי הסדר. מחזק מאוד בסיס ומשאיר את החומר הסופי רענן, במיוחד שחצי מהבחינה עליו.\n\nהשורה התחתונה: קורס קשה, לא עמוס מדי, אבל המבחן בודק טוב מאוד את היכולות, לכן צורך השקעה רבה.", "timestamp": 1613385232207}, {"author": "קל-culus", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  אלון דימיטריוק\nחוות דעת - הרצאות: הרצאות מקצועיות אבל באווירה רעה, בעיקר בשל העובדה שהוא נוהג בקביעות לענות לשאלות של סטודנטים ב\"פאסיב אגרסיב\" מרגיז על גבול המעליב.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מתרגלת מעולה, ממליץ בחום.\n\nשעורי הבית: קשוחים ולוקחים לא מעט זמן אבל חשובים להבנת החומר.\n\nהמבחן: קשה מאוד, בעיקר החלק האמריקאי שהיה זוועה.\n\nהשורה התחתונה: ממש חבל שאין הרצאות של אביב צנזור ביוטיוב לקורס הזה...", "timestamp": 1613414806566}, {"author": "Maor Kovler", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: אל תלכו לאלון!!! תראו צנזור ביוטיוב\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים:המתרגלת הכי טובה בטכניון \n\nשעורי הבית: קשים מאוד\n\nהמבחן: קשה מאוד תמיד יש פקטור", "timestamp": 1613546275539}, {"author": "yarin serg", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: ללמוד מלא למבחן", "timestamp": 1613811763381}, {"author": "מאי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: \nאנשים ממש ברחו מההרצאות של אבי כי הוא טכנופוב אבל בפועל הוא מרצה מעולה מסביר ועונה על כל שאלה של סטודנט, מנסה להנגיש את החומר הנורא כמה שאפשר \nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nתרגולים עמוסים (160) זה טיפה קשה אבל גרשון מעביר את החומר מעולה והמון פעמים עונה על שאלות מהגיליונות\nשעורי הבית: \nלחלוטין ברמה גבוהה ולא קלים בכלל אבל ממש עוזרים להבנת החומר\nהמבחן: \nהיה מבחן יחסית הוגן פשוט לתרגל מלא מבחנים לפני\nהשורה התחתונה: \nקורס קשה, חומר לא ברור בקריאה ראשונה וגם לא בקריאה שנייה, פשוט צריך לתרגל בכמויות", "timestamp": 1613824036223}, {"author": "חדוה", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nאין מה לשאול שאלות, הוא לא מבין אותם אלא אם ניסחתם בצורה מתמטית מדויקת את השאלה, אז תחסכו לחברים שלכם.\nבסה\"כ מרצה מאוד מובן, מסודר ומעביר את החומר שצריך.\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \nאחלה תרגולים, היא מחוברת לנושאים ויודעת גם מה אלון מחפש ודורש במבחנים, ממליצה למרות שלפעמים היא מבולגנת מדי ולא ברור מה היא כתבה ומתי. \nגם גרשון מומלץ בעיקר לנושאים האחרונים של הקורס, הוא עושה סדר בראש.\nשעורי הבית: \nגיליונות ווובורקים שעוזרים לעכל את החומר, ממליצה לפתור את כולם לבד. \nהמבחן: \nלעומת שנים קודמות שינו את המבנה של המבחן (כמה מפתיע בסמסטר קורונה), במקום שאלת ציטוט+הוכחה של משפט היו עוד 2 שאלות שונות, מה שהגביל קצת את הזמן.\nאבל עדיין מבחן שלגמרי אפשר להצליח בו, בחלק הפתוח הוא ממוחזר ממש, האמריקאיות מאתגרות אבל לגמרי אפשריות. \nהשורה התחתונה: תתעקשו על החומר האחרון של הקורס, הוא חצי מהמבחן לפחות.", "timestamp": 1614015749358}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: הרצאות רציניות. המרצה מסביר את החומר בצורה בהירה וברורה. \n\nשם המתרגל/ת:  הילה מעיין.\nחוות דעת - תרגולים: מרצה מעולה. התרגולים עוברים על כל החומר של ההרצאות ואף מעבר. התרגולים מאפשרים להבין את שיעורי הבית ולעשות אותם בצורה יותר. התרגולים מכינים בצורה טובה למבחן.\n\nשעורי הבית: ישנו פער גדול בין רמת התרגילים בשיעורי הבית לבין רמת התרגילים המוצגים בהרצאות.\nשיעורי הבית כוללים 6 גיליונות בכתב ו-12 גליונות webwork.\nחשוב לעשות את שיעורי הבית. מהווים חלק משמעותי בציון הסופי ויכולים להקפיץ את הציון. יחד עם זאת, ציון שיעורי הבית מתבטל אם ציון המבחן הוא מתחת ל-50.\n\nהמבחן: קשה מאוד. השאלות האמריקאיות מסורבלות וקשות. אפשר לאבד המון נקודות בשאלות הפתוחות במבחן אם ההסבר לא יהיה מדויק והדרך תיהיה מעט שונה. ניתן להצליח ע''י חרישה וחזרה על מבחנים משנים קודמות.\n\nהשורה התחתונה: קורס קשה מאוד אבל ניתן לעבור אותו עם ציון יפה.", "timestamp": 1614444443624}, {"author": "Salwa Khafaga", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: מרצה מעולה, נותן הרבה מקום לשאלות, מצחיק ומסביר טוב מאוד.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: להגיש שיעורי בית. \n\nהמבחן: פתיר למי שמשקיע\n\nהשורה התחתונה: אין על אבי. קורס לא פשוט.", "timestamp": 1614605556739}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: \nחרא של מרצה וחרא של בנאדם, מרגיש כאילו לא בכבוד שלו לענות לסטודנטים על שאלות ובוחר לזלזל בהם במקום, ממליץ על מרצה אחר אם יש אפשרות או על סרטונים של צנזור.\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מדהימה שדואגת לענות על שאלות ולהסביר את החומר בצורה ברורה.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614606764496}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי מרצה מעולה, טוען שהוא לא אוהב להיסחף עם שאלות אבל לא מוותר כמעט על כל שאלה (לטוב ולרע), בגלל היסחפויות לפעמים קשה לעקוב, אבל הוא מתעכב על מה שבאמת אי אפשר לקלוט ברגע.\nשם המתרגל/ת: איריס, גרשון אברהם\nחוות דעת - תרגולים: איריס- איריס מתרגלת טובה אבל יורה לכל כיוון ואפשר לאבד ריכוז בשניה.\nגרשון-בזום תירגל ממצגת, די רץ על החומר אבל מעביר את החומר בצורה טובה.\n\nשעורי הבית: שיעורי בית להגשה לא ברמה מוגזמת, לא מורידים על שטויות.\nWW לפעמים בלתי נסבל, לפעמים יש תרגילים ששואבים זמן, ולפעמים הניסוח הוא מה שמפיל. כן להשקיע באחרונים, השאלות היחידות במבחן שצריך לחשב יהיו משם\n\nהמבחן: הפתוחות הוגנות, הסגורות מרגישות כמו לוטו, למעט שתי שאלות שאפשר להוכיח.\n\nהשורה התחתונה: לחזור על חומר שלא מבינים, לשנן הוכחות למבחן, לא זכינו לזה, אבל 20 נקודות מתנה באופן כללי, ולעשות כל אינטגרל שנתקלים בו.", "timestamp": 1614849395905}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: מסביר כאילו הוא עושה טובה בכלל ועונה בזלזול על השאלות אם בכלל.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מצויינת שמעבירה את החומר בצורה ברורה ודואגת שכולם יבינו.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614850190935}, {"author": "אייל מעוז", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nיוסי כהן ואלון דמיטריוק\n\nחוות דעת - הרצאות: \nההרצאות של יוסי קצת כמו \"שוק\". בהתחלה חשבתי שנחמד אצלו, אבל הרגשתי שאני לא מבין את החומר. עברתי לאלון. אלון נחמד, מסביר את החומר טוב. קצת קר, אבל סה\"כ מרצה סבבה\n\nשם המתרגל/ת: \nגרשון אברהם\n\nחוות דעת - תרגולים: \nגרשון מתרגל מדהים מדהים. ממליץ לכולם. מסביר טוב ובקצב טוב. אם תהיה לי עוד הזדמנות לתרגל אצלו, זה ללא ספק מה שאבחר.\n\nשעורי הבית: \nקשים. צריך להבין את החומר טוב מאוד כדי להצליח לפתור אותם.\n\nהמבחן: \nקשה בטירוף. ממוצע נכשל לפני פקטור. מבחינתי העיקר היה לעבור.\n\nהשורה התחתונה: קורס קשה ועמוס, חבל שלא נפרש על יותר זמן, שתהיה אפשרות לעכל את המידע.", "timestamp": 1615126410715}, {"author": "Naor Mahani", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: יכול מאוד לבלבל אבל אחרי ההרצאות הראשונות החומר מוסבר יותר טוב, רק לא לאבד ריכוז מגבולות כי השהייה בנושא כל כך מוקדן של הקורס יכולה לשבש את ההבנה של כל שאר הקורס.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: ללא ספק הצילה לי את הקורס. כל דבר שלא הבנתי מאלון היא הסבירה בצורה שאפשר גם לזכור וגם ליישם.\n\nשעורי הבית: יחסית חזרתי ויש הרבה מאותו סוג של שאלות. אך התרגול החזרתי הזה יבסס את הטכניקה שתצטרכו למבחן. ממליץ לנסות עם כמה שפחות רפרנסים כי ההסתמכות על רפרנסים הורסת את ההבנה העצמית, לדעתי.\n\nהמבחן: מבחן מאתגר, לא אשקר, אבל עם שקידה ופתירה של הרבה מבחנים, אפשר לצאת מהקורס הזה גם עם ציון יפה.\n\nהשורה התחתונה: קורס לא מאוד חביב לרוב אבל הוא מהווה בסיס להרבה תארים בעתיד, כדי לא לזלזל בו ולצאת ממנו לא רק עם עובר, אלא גם עם הטכניקה.", "timestamp": 1615162545261}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: מרצה מאוד מקצועי אבל די קר\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מתרגלת מעולה עם הרבה מאוד ניסיון\n\nשעורי הבית: קשים אבל חשובים מאוד על מנת להבין את החומר\n\nהמבחן: לא קל אבל אם פותרים את כל המבחנים כמה שנים אחורה יש הרבה שאלות דומות.\n\nהשורה התחתונה: קורס לא פשוט אבל חשוב מאוד להמשך, ההרצאות דורשות זמן לעיכול וכדאי מאוד להשקיע בשיעורי הבית כדי באמת להבין את החומר עד הסוף.", "timestamp": 1615508463356}, {"author": "מיכל", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: קשה להבין את החומר תוך כדי שיעור, כדאי מאוד לחזור על כל הרצאה כדי להגיע להרצאה הבאה מוכנים ולהצליח לעמוד בקצב\n\nשם המתרגל/ת: דורון אלעד\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי, סבלני ומסביר ממש ממש טוב, נותן המון טיפים מועילים על איך לגשת לכל נושא, עושה סדר.\n\nשעורי הבית: עוזרים להבין את החומר, חשובים בשביל המגן, רמת קושי די תואמת למה שעושים בתרגול\n\nהמבחן: לא פרופורציונלי לכלום. השאלות הפתוחות לרוב פתירות, האמריקאיות לא.\n\nהשורה התחתונה:קורס קשה, כדאי מאוד להגיע סופר מוכנים ולהשקיע בלהבין את ההרצאות והתרגולים כל הזמן, מומלץ לעשות את הקורס הכנה במתמטיקה של הטכניון לפני.", "timestamp": 1615575708894}, {"author": "Avi Cohen", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: דעות חלוקות, אבל אני אישית אוהב סדר ובסופו של דבר לדעתי אלון מסביר ומסכם על האייפד שלו מצויין. למדתי מהחומר המסוכם ממש בקלות, והוא המרצה האחראי, אז למה לא! \n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: רצה בטירוףףף על החומר אבל התרגולים כיפים והיא מפרסמת את הרשימות שלה לפני, לדעתי ללמוד איתה זה מצוין, לקרוא את רשימות התרגול לפני כל תרגול ואז לבוא עם הרשימות ולא לכתוב כלום בתרגול אלא רק לעקוב עם הדפים ולהקשיב.\n\nשעורי הבית: לא קשים מדי אבל גם לא קלים, כדאי לא לרפרנס כדי להיות מוכנים למבחנן.\n\nהמבחן: לא קל אבל לא קשה מדי (למרות מה שכולם אומרים) אם עושים מבחני עבר (ממליץ גם לחפש מבחני עבר מהקורס באנגלית, תשאלו בוגרים מה זה הם יגידו לכם הוא חפעמים ממחזר שאלות אפילו).\n\nהשורה התחתונה: אחלה קורס!", "timestamp": 1615906393246}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשוחים אבל אפשריים, מוסיף המון לעומס בסמסטר\n\nהמבחן: קשוח, בעיקר בסמסטר קורונה. המרצה לא סימפטי בעליל והמבחן היה לא הוגן.\n\nהשורה התחתונה: אם היה אפשר להמליץ שלא לעשות את הקורס עם המרצה הספציפי הזה הייתי עושה זאת, אך מכיוון שזהו קדם הכרחי תכירו שהמרצה הזה ספציפית לא יבוא לקראתכם בשום דבר שהוא לא חייב ולהפך, משפיל סטודנטים אחרים ויחסו לא נעים. ממליצה להעזר בפקל של ניר חן, להעזר בהמון סבלנות ולשנן את הוכחות המבחנים כפי שמפורסמים בתיקיית מבחנים מהעבר, אחרת ההוכחה לא תתקבל. בהצלחה :)", "timestamp": 1616147511148}, {"author": "Gilad sella", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  ד''ר יוסי כהן\nחוות דעת - הרצאות: טובות מאוד, התחלתי אצל אלון דמיטריוק אבל לאחר כמה הרצאות עברתי אליו, השיעורים היו במתכונת זום, רוב החומר הועבר בצורה מעניינת ותמיד היה משאיר זמן לשאלות. מעורב מאוד גם מחוץ לשיעורים ועונה תמיד על שאלות.\n\nשם המתרגל/ת:  הילה מעיין\nחוות דעת - תרגולים: מתרגלת מעולה, מחדדת נקודות שלא עברו עליהן בהרצאות ומלמדת דברים שעוזרים מאוד במבחנים. עוזרת בשעות הקבלה שלה אם נתקעים על שאלות ומלמדת דרכים קלות יותר לפתירת שאלות.\n\nשעורי הבית:  מחולקים לשניים - webwork ותרגילי הגשה סרוקים. רמת הקושי שלהם הולכת ועולה ככל שמתקדמים בסמסטר, ממליץ לא להשתמש ברפרנסים כי זה יקשה מאוד לקראת המבחן.\n\nהמבחן:  קשה מאוד, צריך להיות חדים מאוד על החומר בשביל להצליח בו ולהכיר את השאלות בהן המרצה האחראי אוהב להפיל,עדיף להצליח מאוד בחלק הסגור של המבחן כי כך לא יורדות נקודות על ניסוח. לפי הבנתי מועד ב' היה משמעותית קשה יותר.\n\nהשורה התחתונה:  קורס קשה, צריך לחרוש בשביל להצליח בו ולקבל ציון טוב- אבל זה אפשרי. עדיף לא לגשת למועד ב' כי המרצה(אלון דמיטריוק) מקשה יותר במועדים האלה.", "timestamp": 1616358749772}, {"author": "אוהד קטרי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ד\"ר יוסי כהן\nחוות דעת - הרצאות: פשוט מדהים\nלעיתים נגרר לשאלות (\"לוקחים אותו לשם\") אבל בכל מקרה מספיקים את החומר יפה ובצורה מעמיקה.\nפלוס הוא מצחיק בטירוף ונחמד ממש\n\nשם המתרגל/ת: גב' הילה מעיין\nחוות דעת - תרגולים: נותנת טיפים מעולים לקראת המבחן ומסבירה לעומק\n\nשעורי הבית: קשים, מומלץ לא להעזר ברפרנסים בכלל(!!!!) אחרת הכאפה במבחן תהיה רצינית.\n\nלא יודע על מרצים אחראיים אחרים, אבל אלון דימיטריוק שוחט במבחן. בעיקר מועד ב.\nתעשו כל מה שאתם יכולים כדי לא לגשת למועד ב\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1616439360339}, {"author": "יהב", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nמסביר את החומר בצורה מאוד פורמלית, קשה להבנה בהתחלה אבל מתרגלים לצורת ההסברים שלו אחרי כמה הרצאות\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: \nמתרגלת מדהימה, מסבירה את החומר מעולה וממש חשוב לה הבנת החומר\nשעורי הבית: \nתואמים לרוב את הרמה של התרגולים\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1625812142739}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: מסביר טוב ומפורט, יכול להשתפר בעת מתן מענה לשאלות סטודנטים.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: נשמה טובה, טיפה לא אחראית בתור מתרגלת אחראית, אבל מסבירה טוב ומובן.\n\nשעורי הבית: עמוס מאוד, וובוורקים + הגשות בכתב. \n\nהמבחן: לא קל, אבל עוזר שחלק מהחומר נלמד במכינה/5 יח\"ל. \n\nהשורה התחתונה: קחו ברצינות ויהיה בסדר אני מקווה.", "timestamp": 1626603728242}, {"author": "אוקי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא הבנתי 90% ממה שהוא אמר, אולי שוק של סמסטר ראשון\nממחזר מבחנים !!!! \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: הילה מעיין המתרגלת הכי טובה בטכניון. נקודה. \n\nשעורי הבית: קשים מאוד ולא קשורים למבחן \n\nהמבחן: אלון ממחזר מבחנים שזה נפלא\nפשוט לתרגל כמה שיותר וככה תגיעו למבחן מוכנים\n\nהשורה התחתונה: \nקורס קשוח בסמסטר ראשון\nאם יש לכם אפשרות קחו פקל\nאלון ממחזר מבחנים אז לתרגל כמה שיותר ויהיה בסדר\nלא הבנתי שום דבר במהלך הסמסטר ועם פקל ותרגול טוב של מבחנים הוצאתי ציון מעולה", "timestamp": 1626797595858}, {"author": "שלו בולקובשטיין", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות:\nמסביר טוב בסך הכל אבל לא יודע לענות על שאלות\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: נהדר, מסביר מעולה את החומר ועונה כמו שצריך על שאלות\n\nשעורי הבית: יש לא מעט\n\nהמבחן: מאתגר\n\nהשורה התחתונה: חייבים לקחת את הקורס, אז לפחות שווה ללכת למתרגל טוב :)", "timestamp": 1643866475538}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מלמד סבבה, לפעמים קצת לא נחמד לשאלות מסוימות אבל אחלה בן אדם ועוזר תמיד כמה שאפשר.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: בסך הכל מלמדת טוב אבל מאוד איטית והיינו צריכים בסוף עוד שיעור השלמה כי לא הספקנו לעבור על כל החומר\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643980783468}, {"author": "מאור אפוטה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nלא קלות מרצה מאתגר,  שווה לעבור על החומר לפני ההרצאה כדי להבין טוב יותר\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרבקה תותחית, רק עובדת בקצב מהיר מאוד, צריל לעצור לשאלות \nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643991696007}, {"author": "בוריס ק.", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה האחראי:  אלון דימיטריוק\n\nחוות דעת - הרצאות:  ההרצאות עמוסות ובשלב מסויים לא מבינים כבר את החומר, צריך להתאמץ.\n\nשעורי הבית: שיעורי הבית לא תואמים את רמת המבחן.\n\nהמבחן: בשנים קודמות אלון היה ממחזר מבחנים, בצער רב אני מודיע שזה לא ככה יותר החל מחורף 2022.\n\nהשורה התחתונה: הקורס עמוס וקשה, אפשר להצליח עם לומדים כמו שצריך, עצה שלי, תלמדו מצנזור ומהתירגולים המוקלטים של חדו''א 1 ת', מראים שם כלים ממש שימושיים והמתרגל מסביר את החומר כמו שצריך, החומר ברמה יחסית גבוהה ככה שזה מכין בדיוק כמה שצריך מבחן.", "timestamp": 1644163844884}, {"author": "תלמיד ממוצע", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: על הפרצוף, אנטיפת\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מהיר מאוד אבל לפחות עונה על שאלות\nממליץ בחום על איריס בתור מתרגלת!\n\nשעורי הבית: נאצים\n\nהמבחן: נאצי\n\nהשורה התחתונה: לא להכחיש את הקורס עד סוף הסמסטר", "timestamp": 1644169014835}, {"author": "Saar Levy", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: בן אדם מאוד קשה. עונה על שאלות בצורה לא מאוד ברורה אבל את לרוב מסביר טוב. שווה ללכת כדי לקבל דגשים כי הוא מרצה אחראי.\n\nשם המתרגל/ת: איריס שפירא\nחוות דעת - תרגולים: מאוד מהירה וקצת מבולגנת אבל אם מצליחים לעמוד בקצב טובה מאוד ונותנת הרבה דגשים וטיפים לניסוח ומבחנים שהרבה מתרגלים אחרים לא.\n\nשעורי הבית: וובוורקים ארוכים מאוד ולא פשוטים. שיעורי בית פתוחים יותר בסדר אבל גם כן לא לזלזל.\n\nהמבחן: קשה מאוד. אלון מרצה אחראי כבר שנים וכותב שאלות אמריקאיות כמעט בלתי אפשריות ששוות בסך הכל מעל 40 נקודות. להשקיע הרבה...", "timestamp": 1644173608529}, {"author": "/", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: אבי מרצה מצויין. רואים שחשוב לו שנצליח ונבין את החומר ומאוד נהניתי בהרצאות שלו.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מתרגלת מצוינת. מתקדמת בצורה יותר איטית למי שמעדיף :)\n\nשעורי הבית: וובוורקים וגיליונות. הגיליונות די ארוכים אבל בכל מקרה פחות עמוס מקורסים אחרים לטעמי.\n\nהמבחן: קשוח מאוד. המבחן התבסס כמעט לגמרי על החומר שלמדנו בשבועיים האחרונים והרגיש לי שהוא לא נועד לבדוק הבנה בחומר של הקורס אלא להפיל אותנו. באותו מבנה כמו של שנים קודמות אבל השאלות ברמה אחרת לגמרי בעיניי. \n\nהשורה התחתונה: קורס לא מאוד עמוס מבחינת מטלות אבל המבחן קשה ולא בוחן הבנה ברמה הנלמדת בקורס.", "timestamp": 1644233236178}, {"author": "דניאל", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות:  היה כיף בהרצאות, האווירה טובה, אבל לא מבינים את החומר ( חומר ניתן בצורה יבשה וקשה להבין משהו במהלך ההרצאה, צריך לחזור את החומר אחרי ההרצאה)\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nמתרגלת מעולה, עושה סדר בחומר עד עמה שזה אפשרי בקורסס הזה.\nשעורי הבית: לא קשורים למבחן\n\nהמבחן: קשה מאוד, המבנה לא דומה למבחנים בשנים קודמות.\n\nהשורה התחתונה: קורס מגעיל, צריך לשבת וללמוד מלא אחרי הרצאות וגם אז אפ אחד לא מבטיח עובר...", "timestamp": 1644247102311}, {"author": "מיכה", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: מעביר את החומר באופן מובן, מעט רובוטי לא עונה על שאלות, מסביר בדיוק כמו בהקלטות, מאוד מערכתי, לא אדם נעים במיוחד אבל גם דיי מסודר.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: תרגולים מצויינים יודעת בדיוק מה לא  ברור לסטודנט ונמנעת מהמוקשים האלה עוד לפני שאתה נקתל בהם.\nגם גרשון מרצה מצויין אם רבקה לא פנויה ממליץ עליו בחום.\n\nשעורי הבית: כמו במבחן\n\nהמבחן: לא קל\n\nהשורה התחתונה: בהצלחה", "timestamp": 1644403534460}, {"author": "'''", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: היה קצד לא ברור בהתחלה אבל במהלך הסמסטר היה ברור אבל יש לו בעיה שהוא לא כל כך עונה על השאלות\n\nשם המתרגל/ת: קרואן מלחם\nחוות דעת - תרגולים: מתרגלת מעולה מסבירה את החומר בצורה מסודרת וסבלנית ואוהבת ללמד ולהשקיע התרגולים\n\nשעורי הבית: לא קשים\n\nהמבחן: לא קל אבל לא קשה יש הרבה תיאוריה והרבה טכניכה בו זמנית צריך הבנה עמוקה לחומר (בדרך כלל בכל המועדים)\n\nהשורה התחתונה:", "timestamp": 1644427047490}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nרצים בחומר , לא הכל מובן מההרצאות וצריך הרבה עבודה כדי להבין \nשם המתרגל/ת: איריס \nחוות דעת - תרגולים: \nממש טובה \nשעורי הבית: \nקשיייייםםם\nהמבחן: \nמבחן קשה ברמות\nהשורה התחתונה: קורס עמוס מאוד , קשה צריך הרבה זמן ללמידה", "timestamp": 1644489164575}, {"author": "זיו ברזילי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה טוב, מצחיק וציני בטירוף, דואג להסביר לאט ושכולם יספיקו לרשום ולשאול שאלות, ממליץ לקחת במקביל במתרגל/ת חזק/ה שיוכלו להשלים פערים בהבנה אם יש (לא תמיד מבינים את המרצים וצריך לתת לחומר זמן לשקוע)\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: תותחית, נותנת טיפים מעולים למבחן ולש\"ב. רצה קצת מהר, אבל ככה גם מספיקה הרבה תרגילים שימושיים.\nעברה לזום לקראת סוף הסמסטר, חבל לא הייתי ממליץ, פחות מובן ככה.\n\nשעורי הבית: קשים אבל הוגנים (לפעמים שווה לרפרנס בייחוד ברציפות)\n\nהמבחן: קשה בטירוף היה קשה בפער משנים שעבר (חוץ מבקורונה).\n\nהשורה התחתונה: מומלץ יוסי בשילוב הילה/גרשון/כל מתרגל טוב. חשוב להבין את המרצה, המתרגל ולחזור על החומר כל שבוע", "timestamp": 1644526980079}, {"author": "טל", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: אלון יחסית ברור ומובן, לא רץ מהר מידי על החומר, אבל בנאדם עם אפס יחסי אנוש, לפעמים אפילו בלתי נסבל, עושה טובה שהוא עונה על שאלות ומתנהג לדעתי כמו ילד שעושה דווקא כששואלים אותו\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: רץ מאוד מהר על החומר, מדלג על שלבים בחישובים במחשבה שכולם חזקים ויכולים לעקוב, אי אפשר לכתוב ולהתרכז ביחד, וגם אם מצלמים באייפד זה הרבה פעמים לא ברור מה צילמת כי כל הלוח בבלאגן\n\nשעורי הבית: קשים אבל עוזרים מאוד בהבנת החומר לעומק\n\nהמבחן: קשה מאוד, אלון התחיל קצת לשנות את הצורה של המבחן אז לא לסמוך על מבחנים משנים קודמות\n\nהשורה התחתונה: קורס קשה מאוד, כדאי להיות בעיניינים מההתחלה ולהגיע מוכנים לתקופת מבחנים", "timestamp": 1644573399426}, {"author": "פעור", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: חשוב לאבי שנצליח, מרצה טוב עם לב טוב. לפעמים רץ על החומר אבל אין ממש ברירה בקורס כזה. הדוגמאות בכיתה לא תואמות את רמת המבחן.\nיש לציין כי אלון לא מעלה שום הסברים על השאלות האמריקאיות אז לפני המבחן אתם צריכים לסמוך על עצמיכם/על סטודנטים אחרים כשלאף אחד אין באמת מושג למה התשובה נכונה ולמה השאר שגויות. בקיצור כיף גדול! קורס של אי ודאות וחוסר התאמה מוחלט במבחן!\nאה ועד חורף 22 היה אפשר ללמוד מהמבחנים הקודמים שיש באתר, אבל אלון שינה את המבנה של המבחן ואין יותר דבר כזה.\n\nשם המתרגל/ת: הילה מעיין.\nחוות דעת - תרגולים: מתרגלת תותחית. הייתה יכולה לתת קצת יותר משעה אחת של קבלה לפני המבחן שאין אליו תשובות מפורטות בשום מקום (בעיקר לאמריקאיות)\nסה\"כ נותנת דוגמאות יחסית קלות שלא תואמות את רמת המבחן.\n\nשעורי הבית: \nקשים אבל מלמדים.\nעדיין לא ברמה של המבחן.\n\nהמבחן: \nשום דבר לא הכין אותנו למה שהלך שם.\nתקוו לקבל עובר ותמשיכו הלאה בחייכם.\n\nהשורה התחתונה: \nזו לא הכמות, זו האיכות\nמאגר דל של חומר ללמוד ממנו והסברים לשאלות\nבעיקר חוסר הלימה בין החומר הנלמד בתרגולים למבחן עצמו שהיה לא פרופורציונלי ובעיקר לא דומה לשום דבר שראינו לפני כן.", "timestamp": 1644749826858}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה טוב והוא עושה אווירה טובה בכיתה אבל בחודש האחרון של הקורס הוא היה באס\"ק וקצת חיפף בהסברה של נושאים מסוימים\n\nשם המתרגל/ת: שוקי ארושס\nחוות דעת - תרגולים: מצד אחד מסביר כל תרגיל ומהיר, אם רוצים מישהו מהיר, ומצד שני עושה הרבה פעמים תרגילים ברמה גבוהה בהרבה מהנדרש וקל לאבד אותו במיוחד כשעבר לזום בכל החודש האחרון\n\nשעורי הבית: קשים אבל עוזרים להבין את החומר\n\nהמבחן: היה ממש קשה ולא קרוב לשום רמה משנים קודמות\n\nהשורה התחתונה: קורס קשה ונוראי אבל קורס חובה אז פשוט צריך לנשוך שפתיים ולשרוד", "timestamp": 1644765228827}, {"author": "סטודנטית ממוצעת", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי מאוד אוהב לספר בדיחות תוך כדי השיעור, ככה שמי שלא מתחבר לבדיחות מאבד את זה מאוד מהר במהלך ההרצאה. לא מסביר את החומר ואו אבל כן עונה לשאלות כשיש.\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: מקסימה! אכפת לה מהסטודנטים קצת מהירה ומבולגנת אבל תותחית על!\n\nשעורי הבית: קשוחים וארוכים! גוזלים המון זמן.\n\nהמבחן: ואו. הלם ושוק. לא היה מבחן דומה לזה בשנים קודמות. כל הזמן אמרו שאלון ממחזר ולעשות מבחנים משנים קודמות ויהיה בסדר. טוב..לא הכל בסדר.\n\nהשורה התחתונה: קורס קשוח שמרגיש שמנסים להראות שהוא הכי קשוח בטכניון על חשבון הסטודנטים.", "timestamp": 1644938970014}, {"author": "יהיה בסדר", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גיא \nחוות דעת - הרצאות: התחלתי אצל אלון וכשראיתי שזה לא עובד עברתי לגיא. גיא הרבה יותר ״אנושי״ ועונה על שאלות, אבל בתכלס אצל שניהם לא הבנתי מילה\n\nשם המתרגל/ת: גרשון ורבקה \nחוות דעת - תרגולים: \nשניהם מאוד מהירים ומאוד מקצועיים. בסופו של דבר אני אישית פחות למדתי מהתרגולים אז גם כאן לא יותר מידי קריטי לדעתי.\n\nשעורי הבית: \nדי זוועתיים. לא להילחם על 100 בכל webwork.. זה פשוט לא שווה את זה\n\nהמבחן: \nקשה. הרגיש שמנסים להפיל.\n\nהשורה התחתונה: \nלהתחיל ללמוד למבחן כמה שבועות מראש ופשוט לעבור על כל התרגילים כמה פעמים כדי לוודא שמבינים את כל הנקודות. אישית לא הבנתי מילה רוב הסמסטר ובעזרת פקל חיצוני טוב והמון חרישה סיימתי בציון לא רע בכלל", "timestamp": 1644952795984}, {"author": "אבישג.ד", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: גיא \nחוות דעת - הרצאות: \nקודם כל - אל תלכו לאלון דמטריוק. אלון הוא זוועתי ומרשע. איש לא נעים ולא מכבד. אחרי שיעור אחד אצלו ברחתי. גיא לעומת זאת הוא איש כל כך נחמד ונעים. איש טוב שאוהב את הסטודנטים. למד את השמות שלנו וכשקצינת לשאול שאלה קרה לנו בשם- מתוק.  גיא מסביר מעולה ואתם יכולים לשאול אותו כמה שאלות שאתם רוצים.\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: \nרבקה מושלמת מושלמת מושלמת. רק אליה ללכת. אבל תבואו מוקדם לתרגול כי כל המקומות הטובים אצלה נתפסים. היא מבוקשת. רבקה מקסימה ועונה על שאלות במהלך התרנגול אבל לא עונה על השאלות בהפסקה אז קחו בחשבון.\nשעורי הבית: \nשיעורי בית נוראיים לקראת הסוף. יש גיליון אחד ממש קשה של הוכחות ואני ממליצה לעבור על כל החומר לפני שעושים אותו. הוובוורק נהדר והוא מלמד מעולה את הבסיס.\nהמבחן: \nהמבחן קשה מנשוא. רק בגלל שאלון דמטריוק כותב את המבחן. לנו הוא אמר שיהיו נושאים מסויימים ואז הוא לא שם אותם במבחן בכלל. להתכונן טוב על הכל ועל הדברים הכי קטנים. הוא בונה מבחן קשה מאוד!\nהשורה התחתונה:\nהקורס הכי קשה שלכם בסמסטר 1", "timestamp": 1644961122922}, {"author": "Yuv", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: לא הבנתי כלום ממה שהוא אומר לאורך הסמסטר אבל הוא הכי טוב בין המרצים לפחות עונה על שאלות ו אוהב לעזור לסטודנטים.\n\nשם המתרגל/ת: שוקי \nמהר מאוד ו קשה לעקוב אבל נותן טיפים ו פותר שאלות ברמת המבחן תצלמו הלוח ו תלמדו לבד אין מה לעשות. \nחוות דעת - תרגולים: \nחשובים..\n\nשעורי הבית: לא משקפות רמת המבחן אבל חייבים לעשות בשביל תרגול ו גם מגן לא רע..\n\nהמבחן: \nקשה מאוד מאוד היה ליגה אחרת ו לא קשור למועדי א אחרות אלון לא מרחם בכלל ( ממוצע של 49 לפני פקטור של 8 נקודות) עם כל זאת אם תלמדו טוב ו תדעו כל קטנה אפשר להצליח ו לקבל ציון טוב זה מה שקרה אצלי לפחות.\nהשורה התחתונה: \nאם לקחתם הקורס עם אלון תלמדו טוב מאוד החומר של החודש האחרון הוא 90% מהמבחן ו תתפללו לעבור..", "timestamp": 1644962583748}, {"author": "sahar", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות:  לא עונה על שאלות בצורה \"חמה\" ולעיתים מעיר היערות לא נעימות.\nמסביר את החומר כמו שיהיה במבחן, וממחזר מבנה של מבחן.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: הכי תותחית בעולם, עברתי גרך כל המתרגלים והיא הכי טובה בהתחייבות!\n\nשעורי הבית: חובה לעשות הכל כדי להבין, לקראת סוף הסמטר מקנה עומס מטורף\n\nהמבחן: קשה מידי, לחרוש את כל המבחנים של אלון ולקוות שלא יגזים.\n\nהשורה התחתונה: לפתור מלא מבחנים לקראת המבחן ויהיה בסדר.", "timestamp": 1645051867707}, {"author": "ה.מכונות", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nמרצה חד ומובן, אם כי יכול להיות די קשוח לשאלות אשר יכולות להתפרש כלא רלוונטיות. הוא כותב הכל על הלוח, ונותן דוגמאות.\n\nשם המתרגל/ת: איריס שפירא\n\nחוות דעת - תרגולים: \nמתרגלת וותיקה עם הרבה ניסיון, נותנת את הרשומות שלה תמיד לפני השיעור שניתן להיות איתה. איריס גם משעשעת ומכניסה הומור, וגם נותנת דגשים חשובים לדעת לקראת הבחינה.\n\nשעורי הבית: \nמחולק לשניים -\n1. ממוחשב WW- חלק ממש קשים אך הרבה מאוד עוזרים להבין את החומר, שלא לדבר שהיו 7 אחוז מגן שעזר לעבור.\n2. גיליונות - נותנים רשימה של שאלות, בודקים רק אחת והבודקים שהיו לנו הסמסטר ממש חיפפו. לרוב דרך רפרנסים (יש מלא) וגם עוזר (לדעתי יותר מהכל) להבין את החומר אז לא לוותר עליהם.\nהמבחן: \nלנו היה בוחן אמצע שהיה קשה מאוד, עדיין עדיף לגשת עליו כי הוא 20 אחוז מגן אז אין מה להפסיד, רק להרוויח.\n\nהמבחן היה ממש קשה, לנו היה פקטור של 8 נקודות ועדיין היו הרבה שלא עברו, חשוב לתרגל כמה שיותר מבחנים וכן להיות מוכנים על הוכחות של משפטים.\n\nהשורה התחתונה: \nקורס קשה, מורכב ועמוס אבל הכי חשוב להיות על החומר במהלך כל הסמסטר, לתרגל כמה שיותר ולשאול כמה שיותר חברים/מתרגלים/מרצים על דברים לא מובנים.", "timestamp": 1645179542469}, {"author": "א", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: בהתחלה ההרצאות היו מפוצצות והיה צריך להילחם על מקום בכיתה ובמיוחד על השורות הראשונות, הוא כותב מאוד קטן אז לשבת מאחורה אומר שאתה לא יכול לראות כלום. יוסי מרצה נחמד אבל לפעמים מרגיש שהוא כועס עלינו אם אנחנו לא מבינים את מה שהוא מסביר וקצת צוחק על אנשים.\nאני לא ממש הבנתי, הכל מלא במונחים והגדרות הזויות שלא מסבירים אותם לגמרי עד הסוף.\n\nשם המתרגל/ת: קרואן מלחם\nחוות דעת - תרגולים: רואים שהיא אוהבת את המקצוע ונהנית ללמד. היא רצה מהר בזמן התרגול ובקושי הספקתי להעתיק את מה שהיא כותבת. הרבה דברים לא הבנתי כי הייתי ממהרת לכתוב ולא הייתי מקשיבה אבל היא כן הסכימה לסטודנטים שביקשו לצלם את הדפים שלה ואז הם לא כתבו במהלך התרגול. היא ממש נחמדה ועונה על כל השאלות ובאמת אכפת לה מהסטודנטים.\n\nשעורי הבית: קשים מאוד, השתמשתי במלא רפרנסים כי פשוט לא הצלחתי, אבל זה בגלל שאישית אני לא הצלחתי להבין את החומר ונוצר לי פער. \nלא לזלזל בשיעורים כי הם כן עוזרים להבין את החומר ונותנים מגן שזה מאוד חשוב, אני עברתי רק בזכותו. אבל הם ממש לא ברמה של המבחן\n\nהמבחן: סופר סופר קשה, בעיקר על החומר של סוף הקורס אז לחרוש עליו. אני ראיתי סרטונים של צנזור לקראת המבחן וזה עזר לי להבין את החומר יותר טוב.\nהיה לנו פקטור של 8 נקודות ובכל זאת 40% מהסטודנטים לא עברו.\n\nהשורה התחתונה: קורס קשה, צריך להשקיע ולא להגיע למצב שנוצר פער.\nהמגן מאוד חשוב כי אם נופלים במבחן הוא מעלה בהרבה נקודות אז להשקיע.", "timestamp": 1645370526426}, {"author": "יהונתן מתתיהו", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות:  מרצה מעולה! חד משמעית המרצה הכי טוב שנתקלתי בו\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: מתרגל מצוין מסביר מעולה מומלץ בחום. \nשעורי הבית:  הרבה שיעורי בית., משתלם לעשות אותם מאוד עוזר להבנת החומר\nהמבחן: מבחן קשוח, עדיף לעשות הרבה מבחנים משנים קודמות כי הם ממחזרים שאלות.\n\nהשורה התחתונה: אחלה קורס דורש התמדה.", "timestamp": 1645384335578}, {"author": "Saeed Abu Elhaija", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: להתרחק, לא הכי טוב שיש, בא עם דף ומעתיק, ממש שיעור העתקה לא מתמטיקה, לא מסביר כל כך טוב, מבחינתו הכל מובן, רוצה רק להעביר חומר ולסיים, אפילו כשנותן שאלה, לא מאתגר סטודנטים ונותן להם לחשוב, אישית מרגיש שההרצאות שלו רק בזבוז זמן. הייתי לומד מהקלטות אינפי 1מ, חדווא 1ת ואנפי 2מ של צנזור, (תוך דילוג על חומר שאינו בסילבוס ), והיה סבבה ושגתי ציון גבוהה מאוד..\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: בכללי מתרגל טוב, בא עם שאלות ברמה,  החיסרון :עובר מהר מהר על השאלות, לא כותב פתרון מפורט על הלוח כמו שנדרש במבחן, לא מדויק באמירות, וזה קריטי בשאלות תיאוריטיות והוכחות. מהצד הטכני, ממש טוב, בתיאורטי ההפך.. לא הייתי סומך עליו\nשעורי הבית: לא קשים כל כך ..צריך לחשוב., רובם טכניות.\n\nהמבחן: מבחן ברמת טכניון. לא קשה ולא קל, לפני שניגשים צריכים להיות חדים בחומר, מבינים הכל לעומק. \n\nהשורה התחתונה: אל תפחדו, קורס לא קשה כמו שאומרים, לגבי מבחן לא להסתמך על טענות \" אלון משחזר מבחנים \", אלון משחזר מבנה לא יותר, תלמדו החומר טוב טוב אחר כך תפתרו כמה שיותר מבחנים רק לאלון, (להבין כל מבחן לעומק..) מי שפותר המון שאלות לו מבין איך הוא חושב וזה יקל עליו במבחן .", "timestamp": 1645556100231}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: הוא מרצה טוב ומצחיק שאכפת לו מאיתנו, וזה נראה שאנשים סתם נבהלו ממנו ממבט ראשון, וגם בגלל שהוא קצת צריך עזרה עם הזום. לקראת הסוף היו מעט אנשים בהרצאה וזה התחיל להרגיש כמו הרצאה פרטית שמאוד אהבתי את זה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: הילה מעיין הייתה המתרגלת האחראית, ואין לי ספק למה - היא תותחית אמיתית ושולטת בחומר. מאוד חשוב להקשיב לכל מה שהיא אומרת. הרגשתי לפעמים שהיא רצה מידי ומצד שני תכלס כל המתרגלים בחדוא ככה\n\nשעורי הבית: מאוד חשובים. בכלל לעשות תרגילים בחדוא זה מאוד חשוב, כי רק ככה באמת אפשר להבין.\n\nהמבחן: אלוהים ישמור\n\nהשורה התחתונה: בהצלחה. סתם, אל תילחצו, לקבל עובר בחדוא זה בגדר האפשרי", "timestamp": 1645564068098}, {"author": "( :", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מלך\n\nשעורי הבית: קשים וארוכים\n\nהמבחן: נורא\n\nהשורה התחתונה: אחד הקורסים הקשים ביותר בסמסטר א', ממליץ להיות על החומר כל הסמסטר.", "timestamp": 1645721124714}, {"author": "א", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: הוא כותב הכל מסודר על הלוח ומסביר די טוב, פשוט כדאי לבוא לכל הרצאה מוכנים מראש או שלא מבינים כלום.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: רץ קצת אבל מסביר טוב, רוב התרגולים נמצאים באתר שלו אז כדאי לבוא מוכנים איתם במקום לנסות גם לכתוב וגם לעקוב\n\nשעורי הבית: לא פשוטים בכלל\n\nהמבחן: מזעזע, אלון החליט שהוא משנה לגמרי את המבחן אז לא להסתמך יותר על זה שהוא ממחזר\n\nהשורה התחתונה: קורס קשוח אבל אין ברירה. לנסות ממש להיות על החומר תוך כדי הסמסטר ולא להשאיר הכל לסוף, וכמובן לראות סרטונים של צנזור", "timestamp": 1645995438225}, {"author": "Yonina", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: הוא קשוח. לא כדאי לשאול שאלות בשיעורים שלו כי הוא לא יענה.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים:  היא בת אדם ממש רע. לא מתחשבת.\n\nשעורי הבית: סבירים אך הילה מעיין ממש רעה בבדיקת השיעורים.\n\nהמבחן: קשוח\n\nהשורה התחתונה: אל תתעסקו עם הילה.", "timestamp": 1647735825989}, {"author": "pokobar", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: בסך הכל מרצה סבבה מבחינת יכולת להעביר את החומר בקצב טוב ומובן יחסית, אבל תגיעו מוכנים לזה שמי ששואל שאלות שלא יבואו לו בטוב יקבלו תשובות קרות/ קצת מעליבות/ לא יקבלו תשובה בכלל\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מדהים, בעיקר למי שלא אוהב לרשום יש לו אתר עם רוב תרגילי השיעור פתורים ואז אפשר להתעסק בלהקשיב\n\nשעורי הבית: לוקחים זמן אבל הגיליונות נחוצים כדי להבין את החומר כמו שצריך אז תשקיעו\n\nהמבחן:אכלנו חרא, היו מבחנים קשים ממש וממוצעים מצחיקים. \n\nהשורה התחתונה: לכו לגרשון ותנסו לשרוד, תשקיעו בשב ובעיקר בחומר של ה4 שבועות האחרונים", "timestamp": 1649502009636}, {"author": "היי:)", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: מאוד חמוד, כותב מהר. ההסברים שלו והמחשות עם טושים זה עוזרים. הוא קצת מונוטוני לפעמים וקצת מוזר אבל מי שמתאים לו הסגנון מרצה הזה הוא טוב.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים:  מתרגלת מצויינת בכללי.\n\nשעורי הבית: גיליון פעם בשבועיים, ממליצה לפתור את הוובורק לפני הגיליון\n\nהמבחן: קשה, אלון לא מחפש סתם שאלות אלה הבנה ולקשר בין הנושאים. גם אם לוקחים פק\"לים לתרגל בעיקר מבחנים\n\nהשורה התחתונה: קורס עמוס וקשה, לבוחן אמצע לא להשקיע את כל הזמן עליו ולעשות את הגיליונות אחריו כי אחרי הבוחן מתחיל העומס של הסמסטר בכללי וחבל ליצור פער.", "timestamp": 1657622817742}, {"author": "Shirel Gavrielove", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה מאוד אנושי, מעביר את ההרצאות בהומור. מרצה מסודר- לא יהיה חסר לכם כלום במחברת. החומר מאוד קשה ולרוב הוא מצליח להנגיש אותו לסטודנטים.  \n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: עושה המון סדר בהבנת החומר, נותן טיפים וטריקים טובים בהצלחת פתרון השאלות. באתר שלו יש אפשרות לתרגל שאלות נוספות מעבר המותאמות לסילבוס הנלמד. בדיעבד אם יש אפשרות מבחינת זמן לשלב עוד תרגול בשבוע הייתי עושה את זה.\n\nשעורי הבית: קשים מאוד וארוכים. הוובוורקים לעמים לא ברורים ופתירים. להתעקש לעשות ולא לרוץ ישר לרפרנס זה חשוב ובונה הבנה לאורך הסמסטר.\n\nהמבחן: קשה מאוד. מומלץ לתרגל כמה שיותר מבחנים משנים קודמות יש לפעמים עקרונות חוזרים. אמריקאיות לרוב לא פתירות. לא לוותר על שעות קבלה של כולם לקראת המבחן- עוזר ממש. \n\nהשורה התחתונה: קורס קשה ועמוס שצריך פשוט לעבור, עם הרבה השקעה ותרגול אפשר גם בציון טוב.", "timestamp": 1663318528237}, {"author": "נעם", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה טוב מאוד. מעביר את ההרצאות עם הרבה הומור וכמעט אף פעם לא התקדם עד שענה על כל השאלות של הסטודנטים. לרוב מאוד ציני וזה אולי לא מתאים לכולם. באופן כללי מאוד down to earth. מעביר את החומר בצורה מאוד מסודרת ומפורטת. כאמור לא מפחד לענות על שאלות של סטודנטים (אלא אם ממש אין זמן). אל תעשו רעש בזמן ההרצאה (כאילו דה...)\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: הכי טובה. מילים לא יכולות לתאר כמה שהיא מדהימה. רצה, כלומר, טסה בחומר. אולי לא מתאים לכולם אבל מי שמצליח לעקוב - היא מסבירה בצורה מעולה ונותנת דוגמאות לעניין.\n\nשעורי הבית: מהווים מגן אבל חלק חשוב בהבנת החומר של הקורס. במידה ויש קשיים מומלץ מאוד להעזר בצוות הקורס בשעות הקבלה.\n\nהמבחן: לא הכיל שאלות מפתיעות מידי. היו 2-3 שאלות שהופיעו במבחנים קודמים. בסך הכל מי שהספיק לפתור מלאאא מבחנים כנראה הצליח.\n\nהשורה התחתונה: קורס חדו\"א בסיסי. דרושה השקעה רבה במהלך הסמטסר. מי שמגדיל ראש ודואג לחזור על החומר המקדים לפני תחילת הסמסטר - יהיה לו משמעותית יותר קל.\nאני אישית מאוד נהנתי מהשילוב של יוסי עם הילה. לא יצא לי להיות אצל מרצים/מתרגלים אחרים.", "timestamp": 1675636262159}, {"author": "Jacob Newrenberg", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מאוד מכאני קצת קשה ללמוד רק ממנו\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל מעולה אבל רץ מהר מאוד על התרגולים\n\nשעורי הבית: די קשים ולא ברמה של ההרצאות \n\nהמבחן: מבחן קשה לקורס קשה\n\nהשורה התחתונה: עברתי את הקורס בבצלחה בזכות אתר סטאזיס, החומר שם חופף לקורס ומועבר בצורה מאוד מופשטת על ידי חן הררי שבעצמו לימד חדווא בטכניון.\nממליץ לכולם להירשם לפקל שלו בסוף סמסטר דרך אסט או להירשם לפקל המוקלט שלו באתר סטאדיס זה מסדר את החומר בראש ולי אישית הקפיץ את הציון בלפחות 30 נקודות", "timestamp": 1684401416496}, {"author": "מאיה", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אלון \nחוות דעת - הרצאות: באופן אישי ממש לא התחברתי אבל הייתי גם סופר שוקיסטית סימסטר א אחרי הכל. הוא כן איטי ומוכן להסביר שוב אם צריך\n\nשם המתרגל/ת: איריס \nחוות דעת - תרגולים: מדהימה. באמת. הכי מקצועית שתכירו. אבל היא רצה, היא על ספידים. צריך לשתות הרבה קפה לפני התרגול שלה ולבוא מוכנים \nבנוסף גם השתמשתי בפקל של חן הררי של סטאדיס. שמעתי על זה במקרה, וזה באמת היה בול אחד לאחד החומר של אלון, ואותו סגנון של שאלות. ראיתי אותו פעמיים וזה סגר לי פינות ממש. כל החלק בסוף של הטורים והאינטגרלים באמת אפשר לראות רק את הפקל ולא ללכת לאף הרצאה כי הם מכסים שם ממש הכל. הציל לי את המבחן \n\nשעורי הבית: ארוכים נורא, כאב ראש \n\nהמבחן: וואי היה קשוח ברמות, כל פיפס קטן מורידים 8 נקודות, צריך ממש להיזהר. לקחת את ה 50 ולברוח משם \n\nהשורה התחתונה: קורס קשה, ממליצה ממש לקנות את הפקל, זה הדבר היחיד שעזר לי לעבור, גם מי שמעביר את הפקל זמין לשאלות וממש עזר לי", "timestamp": 1684841585262}, {"author": "yam", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יוסי \nחוות דעת - הרצאות: אחלה מרצה, סבלני ,אווירה לימודית טובה, מעביר את החומר בקלילות אבל הוא כן יודע מה הוא עושה \n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: מתרגלת מעולה, ממש מקצועית היא יודעת ענות על כל שאלה \n\nשעורי הבית: \n\nהמבחן: מבחן בחדוא... יודעים איך זה..קשה... אין מה לעשות... \nלקראת המבחן נעזרתי בפקל של חן הררי (בתכלס יכלתי לראות רק את הפקל של חן מבלי להגיע להרצאות ולתרגולים- זה מה שהיה בפועל) \n\nהשורה התחתונה: קורס קשה צריך לתת בראש", "timestamp": 1684842474699}, {"author": "חדוא 1מ", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: הוא מרצה טוב עונה לשאלות ומחכה לכולם עד שיכתבו ואחרי זה הוא מסביר\n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: אין כמו רבקה, רוצים להצליח בקורס? לכו לרבקה.\n\nשעורי הבית: יש 6 גליונות שצריך להגיש 5 חוץ מהוובורק , לרוב השאלות אתה תמצא רפרנסים אבל הגיליון ייקח לך כמה שעות טובות\n\nהמבחן: קיים הרבה מבחנים מעבר לקורס הזה ואם פותרים הרבה מבחנים אז המבחן לא יהיה משהו מפתיע בשבילך כי בסוף זה אותו רעיונות ואותן שאלות רק צריך להשקיע ולפתור הרבה מבחנים\n\nהשורה התחתונה: קורס קשה צריך השקעה במהלך הסמסטר, לא לזלזל בו כי אוכלים אותה במבחן בסוף, קורס חובה אין מה לעשות!", "timestamp": 1689939405795}]}