{"posts": [{"author": "דניאל", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מסבירה את החומר מעולה, בצורה מאוד ברורה. תמיד שמחה לענות על שאלות ולעזור גם אחרי ההרצאות.\n\nשם המתרגל/ת: איריס\nחוות דעת - תרגולים: ממליץ להביא חגורת בטיחות כי איריס טסה יותר מהר ממהירות הקול. אם אתם מרגישים בנוח עם החומר - הכמות שאיריס מספיקה לכסות תעזור לכם בהבנה של החומר ובמבחן כי עוברים על הרבה יותר משאר המתרגלים ואיריס נותנת המון דוגמאות של מקרי קצה, והיא גם מסבירה את החומר בצורה מעולה וכיפית.\n\nשעורי הבית: לא פשוטים, אבל הוגנים. \n\nהמבחן: אין דרך לייפות את זה - המבחן קשה מאוד, אבל בטווח ההוגן. חייבים להשקיע המון בשביל לעבור עם ציון סביר.\n\nהשורה התחתונה: להשקיע המון מתחילת הסמסטר, אל תתנו לעצמכם ללכת לאיבוד, ותתרגלו *המון* ואפשרי להצליח.", "timestamp": 1713434034488}, {"author": "איתמר שאול אידלברג", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: מרצה טובה מאוד. אכפת לה שיבינו את החומר והיא מעבירה אותו בצורה הכי מעניינת שאפשר עם חומר כזה משעמם.\n\nשם המתרגל/ת: איריס/אחסאן\nחוות דעת - תרגולים: אחסאן מתרגל בצורה די סטנדרטית. ברור וישיר.\nסגנון הלימוד של איריס מאוד מבולגן אבל אם אתם מסתדרים עם זה היא מתרגלת מעולה. מעבירה את החומר מעניין, מביאה משאבים שעוזרים מעבר לחומר הבסיסי של הקורס ובכללי די מצחיקה.\n\nשעורי הבית: חמישה גיליונות, מתוכם היינו צריכים רק ארבעה. לא לרפרנס כי צריך להתרגל לצורת החשיבה של הפתרונות. לתרגל את השאלות שלא צריך להגיש כי לפעמים לוקחים מהן שאלות למבחן.\n\nהמבחן: טריקי ומעצבן, פחות או יותר מיועד להכשיל את הסטודנטים.\n\nהשורה התחתונה: זבל של קורס אבל חובה אז אין באמת מה לעשות. הקורס קשה ומעצבן אבל אפשר לעבור אותו וגם להוציא ציון טוב אם חורשים מספיק, אישית הקורס שלקח לי הכי הרבה זמן הסמסטר.", "timestamp": 1713692465285}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: פשוט מרצה נהדרת.\nעונה תמיד על כל שאלה, מגיעה מוקדם יותר, נשארת בהפסקות וגם אחרי כל הרצאה בשביל שאלות. מסבירה את החומר בצורה אינטואיטיבית וברורה, בגובה עיניים. מודעת לקשיים ומנסה לעזור כמה שאפשר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אחלה, קצת איטית לטעמי ולפעמים התרגולים לא בדיוק מכסים את החומר של הגליונות, מה שכן זמינה בעיקר בשעות קבלה.\n\nשעורי הבית: יש לא מעט והם לא קלים.\n\nהמבחן: הוגן, אלות שמזכירות את הגליונות.\n\nהשורה התחתונה: קורס קשה, מאוד מעניין, אירנה תותחית.", "timestamp": 1713914822327}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמרצה טובה, כותבת מהר מאוד אז קשה לפעמים לעקוב ולכתוב בו זמנית אבל מאוד ברורה.\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרק רבקה. עברתי כמה מתרגלים, רבקה הכי טובה בפער. ברורה, מסבירה טוב ומובן, פותרת תרגילים שבכל אחד נותנת טריק שונה להסתכל על הבעיה ולפתור אותה. אווירה טובה בכיתה ונגישה מאוד לשאול אותה שאלות. המתרגלת הכי טובה שנתקלתי בה בכללי, בטוח אמשיך איתה לחדו״א 2.\nשעורי הבית: \nרובם קשים ומאתגרים, לוקח הרבה זמן לפתור ואז לתקן. קורס שדורש המון שעות והשקעה\nהמבחן: \nקשה מאוד, ניכר לראות בממוצע של הסטודנטים.\nהשורה התחתונה: אם אתם לוקחים את הקורס הזה אז אין לכם ברירה, צריך להתמודד ולהצליח בסוף. החומר נחמד וכיף להתעסק איתו אבל השאלות באמת קשות.", "timestamp": 1713967639778}, {"author": "סאג'ד", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה:אירנה גורליק\nחוות דעת - הרצאות: \nמרצה מעולה, מסבירה באופן ברור את החומר, ותמיד נותנת הזדמנות לשאול שאלות, יש אווירה נעימה , בקיצור אין עליה.\n\nשם המתרגל/ת: ניקה \nחוות דעת - תרגולים:אני חושב שהיא מתרגלת מעולה , לפעמים הרגיש לי שעל חלק מהתרגילים היא הייתה טסה  אבל בכללי היא ממש אחלה , ניכר שהיא שולטת בחומר ותמיד לפני כל תרגיל היא נותנת לנו הזדמנות לחשוב על דרך פתרון וגם משתפת אותנו בדרך הפתרון , משהו שלא כל המתרגילים עושים , בסך הכול היא מתרגלת מעולה. \n\nשעורי הבית: 5 גליונות , לוקחים 4 הכי טובים , הם לוקחים זמן , יש גם כל שבוע מטלה בוובוורק בדר\"כ שאלות טכניות לתרגול על החומר.\n\nהמבחן: מבחן הוגן .\n\nהשורה התחתונה: קורס עמוס , צריך להיות כל הזמן במעקב שאתם מבינים את החומר כי אם משהו לא ברור בקלות ניתן ללכת לאיבוד ,  סך הכול הקורס מאתגר ומעניין. בהצלחה !", "timestamp": 1714007971256}, {"author": "Ar No", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nאחלה מרצה, מסבירה הכל ברור ומבינה כששואלים אותה שאלות. קצב לימוד ממש סבבה, שמעתי שמועות טובות גם על אחרים אבל אם היא מלמדת קורס שאתם צריכים לא רואה סיבה ללכת למישהו אחר\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: \nמתרגלת מעולה, מעבירה הכל ברור ובקצב טוב, יודעת לענות על שאלות ויש אווירה טובה בשיעורים, מעבירה את הדברים בצורה מאוד מסודרת וברורה\nשעורי הבית: \nהסמסטר הזה היו 5 גיליונות, לא בטוח איך יהיה בהבאים. הפערים ביניהם לא תמיד היו סימפתיים אבל היה זמן לנשום באופן יחסי. אין כל כך רפרנסים כי הקורס חדש אבל השאלות דומות יחסית ל1מ אז אפשר להוציא תובנות משם. אפשר להתמודד גם בלי רפרנסים\nהמבחן: \nמועד א' היה הוגן סהכ, אבל אני לא יודע כמה אפשר לבנות על זה שזה יהיה ככה כל קורס, מאוד תלוי במרצה האחראי\nהשורה התחתונה: \nזה לא קורס בחירה אז או שתחליפו פקולטה או תרשמו, אירנה וניקה הן שילוב מנצח, מאחל לכם בהצלחה", "timestamp": 1714083150491}, {"author": "קטן כרצוני", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמיכל ממש ממש חמודה ומהירה. \nהיא מסבירה מהר מאוד וכותבת באותו קצב מהר ולפעמים מדלגת על שלבים (נראה לי שכולם ככה) וקל מאוד לאבד אותה. כשמצליחים לעקוב אז היא מסבירה מעולה ומרגיש שסופגים את החומר טוב. \nמעבר לזה היא מאוד אנושית ואכפתית לסטודנטים, עונה על שאלות ואכפת לה שנאהב את הקורס מעבר ללמוד אותו וזה היה ניכר באווירה בכיתה.\n\nשם המתרגל/ת: רבקה ופארס\nחוות דעת - תרגולים: \nרבקה מלכה אבל מאוד מהירה. אווירה של לשים מכנסי ריצה לפני שנכנסים לתרגול. נותנת מלא תרגילים וככה לומדים טריקים והיא גם תותחית בחומר אז לרוב תלמד דברים ענייניים. מה שכן - מתוך התרגילים הצלחתי לעקוב בחצי בערך ובגלל זה הלכתי גם לפארס. שימו לב שאם אתם לא חדים על החומר 24/7 יהיה קשה לעקוב אחריה למרות שהיא לא משעממת.\nפארס חמוד לאללה, \n\nשעורי הבית: עמוסים מאוד. כל הזמן יש וובוורקים שמצד אחד עוזרים להבין את החומר (וגם לא חייבים לעשות את כולם) אבל מצד שני מאוד קשים ולוקחים כמה שעות יפות מהשבוע.\nבנוסף יש גליונות שהם ממש עוזרים לפתח חשיבה חדו\"אית וגם מכינים אותך למה הולך להגיע במבחן אבל גם קשה ועמוס.\n\nהמבחן: \nקשה מאוד, אבל הוגן. מומלץ לעבור על מבחנים ואחרי כמה כאלה מבינים מה הסטייל של השאלות שהולכות להגיע. ממליץ לענות על גליונות גם אם לא עשיתם את כולם.\n\nהשורה התחתונה: וואלה עמוס ולדעת הרבה אנשים הקורס הכי קשה שיש. גם לדעתי\nבהצלחה ושהאפסילון יהיה קטן כרצונכם", "timestamp": 1714248340042}, {"author": "קטן כרצוני", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות:\nמיכל ממש ממש חמודה ומהירה.\nהיא מסבירה מהר מאוד וכותבת באותו קצב מהר ולפעמים מדלגת על שלבים (נראה לי שכולם ככה) וקל מאוד לאבד אותה. כשמצליחים לעקוב אז היא מסבירה מעולה ומרגיש שסופגים את החומר טוב.\nמעבר לזה היא מאוד אנושית ואכפתית לסטודנטים, עונה על שאלות ואכפת לה שנאהב את הקורס מעבר ללמוד אותו וזה היה ניכר באווירה בכיתה.\n\nשם המתרגל/ת: רבקה ופארס\nחוות דעת - תרגולים:\nרבקה מלכה אבל מאוד מהירה. אווירה של לשים מכנסי ריצה לפני שנכנסים לתרגול. נותנת מלא תרגילים וככה לומדים טריקים והיא גם תותחית בחומר אז לרוב תלמד דברים ענייניים. מה שכן - מתוך התרגילים הצלחתי לעקוב בחצי בערך ובגלל זה הלכתי גם לפארס. שימו לב שאם אתם לא חדים על החומר 24/7 יהיה קשה לעקוב אחריה למרות שהיא לא משעממת.\n\nפארס חמוד לאללה, הוא אנדרייטד. מסביר טוב, רגוע, לא מדלג על יותר מדי שלבים וממש עוזר להבין את החומר. מצד שני לא עוברים על יותר מדי תרגילים כי באמת הוא דואג לעבור על החומר בצורה טובה. אם לא הייתי הולך אליו לא הייתי מבין רק מהתרגולים של רבקה.\n\nשעורי הבית: עמוסים מאוד. כל הזמן יש וובוורקים שמצד אחד עוזרים להבין את החומר (וגם לא חייבים לעשות את כולם) אבל מצד שני מאוד קשים ולוקחים כמה שעות יפות מהשבוע.\nבנוסף יש גליונות שהם ממש עוזרים לפתח חשיבה חדו\"אית וגם מכינים אותך למה הולך להגיע במבחן אבל גם קשה ועמוס.\n\nהמבחן:\nקשה מאוד, אבל הוגן. מומלץ לעבור על מבחנים ואחרי כמה כאלה מבינים מה הסטייל של השאלות שהולכות להגיע. ממליץ לענות על גליונות גם אם לא עשיתם את כולם.\n\nהשורה התחתונה: וואלה עמוס ולדעת הרבה אנשים הקורס הכי קשה שיש. גם לדעתי.\nבהצלחה ושהאפסילון יהיה קטן כרצונכם", "timestamp": 1714248468771}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: מיכל מרצה מעולה ומרגישים שהיא אוהבת את החומר ואת הסטודנטים\nאני ממש ממליץ עלייה היא המרצה שהכי אהבתי הסמסטר, רק קחו בחשבון שהיא כותבת מאוד מהר ובחדו\"א יש מלא חומר להעתיק\n\nשם המתרגל/ת: במהלך הסמסטר הלכתי ל3 מתרגלות: איריס שפירא, ניקה פת, רבקה אביטל\nממליץ לכם לבדוק כמה מתרגלים במיוחד בחדו\"א כי התרגולים קריטיים. לקראת המבחן מומלץ לתגבר וללכת לאקסטרה תרגולים.\n\nחוות דעת - תרגולים: \n- איריס: איריס טסה, אין סיכוי להעתיק אצלה אבל היא מעלה את הדפים שלה אז לא צריך להעתיק. עדיין גם בלי להעתיק לרוב הסטודנטים זה מהיר מדי.\nאבל אם אתם אוהבים תרגולים בהילוך מהיר אז לכו לאיריס! היא מספיקה מלא תרגילים בתרגול. \nהיא באמת מלכה, יש לה הרבה ניסיון והיא נותנת הרבה טיפים למבחן במהלך התרגולים, וגם יש אווירה כיפית אצלה בכיתה.\n\n- ניקה: אצל ניקה התרגולים בקצב ממש סביר, אמנם עדיין קצב מהיר כי זה חדו\"א אבל היא מחכה שאנשים יספיקו להעתיק והיא מסבירה לעומק את התרגילים. הכי הבנתי את החומר שהלכתי אלייה אבל החסרון זה שלא מספיקים אצלה הרבה תרגילים, היא גם פחות נותנת טיפים לגבי איך לענות במבחן. ניקה מעולה למי שרוצה להבין את החומר לעומק ולא רק לדעת לפתור את התרגילים.\n\n- רבקה: סהכ לדעתי רבקה הכי טובה. היא פותרת הרבה תרגילים אבל לא בקצב גבוה מדי, יש לה הרבה ניסיון והיא נותנת טיפים טובים שעוזרים במבחן.\nלמשל היא עשתה 3 שעות תרגול השלמה אצלנו על טורים (סמסטר מקוצר בגלל המלחמה וכו') וה3 שעות האלה פשוט סגרו לי את הפינה בטורים.\n\nשעורי הבית: קשים מאוד וארוכים מאוד, בהתחלה הם לא כאלה ארוכים אבל זה הולך ומתארך ככל שהסמסטר מתקדם.\nהוובוורקים סבבה ואני ממליץ לפתור אותם לפני הגיליונות כדי להבין יותר את החומר. הגיליונות ממש קשים, הייתי צריך לרפרנס קצת כל גיליון בערך וגם מורידים הרבה נקודות על טעויות.\nעם זאת מאוד חשוב להכין את שיעורי הבית! גם בשביל שתבינו את החומר (בחדו\"א זה סופר קריטי לתרגל) וגם בשביל המגן. אם אתם מגיעים לנגיד 95+ בשיעורי בית (שזה אני חושב רוב האנשים, או לפחות מלא) אז מספיק שתקבלו 50 במבחן ועברתם. זה ממש יכול לעשות את ההבדל בין עובר לנכשל אז תגישו את השיעורי בית ותשקיעו בהם בשביל המגן.\n\nהמבחן: סה\"כ הוגן. תחרשו כמה ימים לפני וסיכוי טוב שתעברו.\nעם זאת ממליץ סה\"כ לא להרים יותר מדי ציפיות, החומר קשה, המבחן קשה, והבדיקה קשוחה.\nמתמקד בעיקר בחומר של סוף הסמסטר אבל תעברו לקראת המבחן על כל המשפטים. היו שאלות שהיה צריך משפטים קטנים שלומדים ממש בתחילת הסמסטר. חשוב שתכירו את כל המשפטים כי יש דגש גדול על הנימוקים ויורידו לכם הרבה נקודות אם לא תנמקו כמו שצריך.\nיש שאלה של להוכיח משפט (תקבלו רשימה מראש של איזה הוכחות יכולות להיות) ולחשב טיילור, למי שלומד מראש למבחן זה כבר 20 נקודות במתנה.\n\nהשורה התחתונה: קורס מעניין אבל מאוד עמוס וקשה. הוא יכול לתעתע כי כל המשפטים בו די אינטואיטיביים, ולא תרגישו שזה מחדש לכם משהו. כנראה אם תסתכלו על משפטים של סוף הקורס אתם תרגישו שאתם מבינים אותם. אבל לא באמת מבינים עד הסוף על ההתחלה, אז חשוב לחרוש במהלך הסמסטר ולא לצבור פערים, ולחרוש עוד יותר לפני המבחן. \nקיבלתי ציון שאני מרוצה ממנו בטירוף ועדיין השורה התחתונה שלי זה לעבור ולברוח. קורס חובה והציונים לא טובים אבל בסוף עוברים גם את זה!", "timestamp": 1714914411073}, {"author": "יהיאפסילוןהציוןשלי", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר אירנה גורליק\nחוות דעת - הרצאות: אירנה הייתה כנראה הסיבה העיקרית שהקורס הזה היה איכשהו בסדר בשבילי. מרצה טובה מאוד, מסבירה בצורה ברורה גם דברים שהסטודנט שנה א' הממוצע בחיים לא ראה, נותנת אינטואיציה ויזואלית להרבה דברים, בסה\"כ רואים שהיא אוהבת את המקצוע והלוואי שהיא הייתה מרצה אחראית הסמסטר כי אני גם מתחבר יותר לסגנון של המבחנים שלה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת טובה, מסבירה את שלבי הפתרון בכל תרגיל ומטמיעה את התיאוריה של ההרצאות בצורה טובה. ההספק שלה לא מאוד גבוה אז יותר מומלצת למי שרוצה להבין מה עומד מאחורי פתרון התרגילים, פחות לרוץ על מלא שאלות.\n\nשעורי הבית: 5 גיליונות פתוחים ו-12 וובוורק (1 יותר מכל אחד בסמסטר לא מקוצר כמו זה). סה\"כ רכיב הש\"ב זה 15% מגן אם מקבלים מעל 50 במבחן. הוובוורקים קצת מעיקים ודי טכניים אבל קל להוציא שם ציונים טובים וצריך רק 7/12 בשביל מגן אז לא כזה נורא. גיליונות פתוחים קשים, כבר מההתחלה, גם בנושאים הכי ראשונים מדגישים פורמליות והוכחות, זה משהו שאי אפשר להפריז בחשיבות שלו ובדיעבד זה טוב ששוברים ככה את הראש בגיליונות כי זה באמת מלמד איך לחשוב בצורה הזאת וליישם את זה במבחן. גם קורס יחסית חדש אז אין הרבה רפרנסים אם בכלל. אם נתקעים ממש על שאלה, מומלץ לשבת עם חברים או ללכת לשעת קבלה, בסוף לסטודנט בסמסטר א' יש שיקולי זמן מסוימים.\n\nהמבחן: קשה מאוד, אבל את מועד א' הזה אגדיר כ\"פתיר\". השאלות היו לא פשוטות (במיוחד האמריקאיות!!!), אבל בגדול נבחנים על מה שלומדים והרמה הייתה צפויה. קשה, אבל צפויה. הממוצע לפני פקטור, שלא בשמיים אבל גם לא ברצפה כמו שנה שעברה, לדעתי שיקף את רמת המבחן. מורידים הרבה נקודות על חוסר פורמליות!! כל דבר שאתם כותבים חייב לנבוע בצורה ברורה ממשפטים או מדברים שהראיתם קודם! לא תכתבו, הנקודות ירדו!! אם נותנים למקצוע הזה את יראת הכבוד שמגיעה לו, משקיעים לאורך הסמסטר, פותרים את כל המבחנים של שנים שעברו (אצלנו זה היה רק של תשפ\"ג, מסכנים מי שהיו מחזור לפנינו) וגם מבחנים של חדו\"א מ' אם אלון המרצה האחראי, אז אפשר לקבל ציון סבבה. מומלץ מאוד מאוד לתרגל שאלות אמריקאיות, לדעתי הן החלק שהיה יותר לי במבחן. יש קורס במודל שפתוח לכולם כל שנה שנקרא \"חומר עזר בחשבון דיפרנציאלי ואינטגרלי\" עם מלא קבצים של אמריקאיות לפי נושאים, רק באסה שנזכרתי בו אחרי המבחן.\n\nהשורה התחתונה: קורס מאוד קשה ועמוס, לדעתי יותר מכל קורס בסמסטר א', משלב הרבה טכניקה שרואים בקורסי חדו\"א מ' והרבה עומק תיאורטי ופורמליות שרואים באינפי, והמבחן די תלוי במרצה האחראי ובסגנון שלו. בגדול, כנראה לא תהנו, למרות שלקראת סוף הסמסטר כן התחלתי קצת להעריך את החומר ואיך הכול נבנה מסדרות וגבול עד לנגזרות ואינטגרלים וכו'. העיקר לא להוריד רגל מהגז, תמיד לעשות את השיעורים ברגע שמוציאים אותם, ללכת לשעות קבלה אם לא מבינים משהו ולהתכונן למבחן בצורה לא רק חרשנית אלא גם נכונה (ראו ערך אמריקאיות). בהצלחה!", "timestamp": 1715000232825}, {"author": "מאיה", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nאירנה גורליק\nחוות דעת - הרצאות: \nאירנה מרצה מדהימה! מלמדת את החומר בצורה הכי מסודרת וברורה שאפשר, תמיד נותנת זמן לשאלות וגורמת לסטודנטים להרגיש בנוח לשאול מה שצריך ולהבין את החומר עד הסוף. באמת נהניתי בהרצאות איתה, גם ברמה גבוהה מאוד שתואמת את רמת המבחן וגם באווירה טובה.\nשם המתרגל/ת: \nאיריס שפירא\nחוות דעת - תרגולים: \nאיריס מתרגלת מעולה, מאוד מאוד מהירה אז כדאי להיות מוכנים לזה מראש. אכפת לה מהסטודנטים והיא מתחילת הסמסטר מביאה תרגילים ממבחנים ומראה את הרמה הכי גבוהה שאפשר, אז לי זה מאוד עזר להגיע מוכנה למבחן.\nשעורי הבית: \nהגיליונות ארוכים, לוקחים הרבה שעות בשבוע, אבל ממש מומלץ לעשות הכל כי בלי זה מאוד קשה להבין את החומר לעומק.\nהמבחן: \nהמבחן קשה, כדאי לתרגל מבחנים של אותו מרצה אחראי משנים קודמות (למרות שאין הרבה) כי כל מרצה נוטה לשאלות אחרות ולהתמקדות בנושאים אחרים. גם לתרגל מבחנים שלהם מחדו\"א 1מ יכול לעזור להבין את הכיוון.\nהשורה התחתונה: \nקורס שדורש המון השקעה במהלך הסמסטר, אבל עם בחירה נכונה של מרצה ומתרגל אפשר לקבל ליווי טוב ולהצליח אותו.", "timestamp": 1715526452238}, {"author": "Kadan H", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מרצה מעולה, לפעמים רצה קצת מהר\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון. תמיד מסביר לעומק ועונה לכל שאלה וכמובן משלב הומור משובך\n\nשעורי הבית: \n\nהמבחן: לא פשוט אבל הוגן\n\nהשורה התחתונה:", "timestamp": 1715936500919}, {"author": "חדוו''א 1ת'", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא תמיד קל לעקוב אחריו ולא תמיד עונה בבירור לשאלות. אבל הוא מכיר את החומר הכי טוב ואין פסיק שלא מועבר בהרצאות בסופו של דבר. ממליץ להיעזר בהקלטות ביוטיוב של צנזור של אינפי 1מ. רוב הקורס דומה. \n\nשם המתרגל/ת: אחסאן + איריס\nחוות דעת - תרגולים: אחסאן אחלה של מתרגל. הוא מסביר את החומר מצויין ומסודר ולוקח זמן להסביר. אבל הרגיש לי שהשאלות שלו לא תמיד ברמת מבחן ולא מכינות ב100%.\nאיריס רצה מאודדדד מהר על השאלות ומי שלא בא אצלה עם קילו של קפה בדם פשוט טובע. אבל אין מתרגל שמכין אותך למבחן יותר טוב ממנה. ממליץ לקחת את שניהם בו זמנית. תוציאו 100. \n\nשעורי הבית: קשים וארוכים. לא להתחיל אותם בדקה 90. ולהציע לשעות קבלה.\n\nהמבחן: להתאמן טוב טוב על מבחני עבר של המרצה האחראי של הקורס בסמסטר הנוכחי. לרוב אותו מבנה של מבחן ושאלות טיפוסיות שחוזרות. אבל המבחן לא פשוט.\n\nהשורה התחתונה: קורס עמוס ומפחיד. אבל אין הר גבוה מידיי ובסוף זה נשאר קורס חובה שכולם עוברים :)‫‬", "timestamp": 1715970035148}, {"author": "ד", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: לא ממש עונה לשאלות וקצת מהיר אבל מאוד מדוייק ואם הוא המרצה האחראי טוב ללכת עליו להרצאות לראות מה מצופה מכם במבחן.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מסבירה ממש טוב אבל לא מספיקה הרבה תרגילים\n\nשעורי הבית: קשים אבל עוברים אותם\n\nהמבחן: מורידים נקודות סתם אז צריך לדייק ממש\n\nהשורה התחתונה:", "timestamp": 1716247469474}, {"author": "i", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיכל קליינרשטרן \nחוות דעת - הרצאות: מיכל מרצה נהדרת מאוד נחמדה קצב טוב טיפה מאוהבות בהוכחות מאינפי מרבה להזכיר... מאלון להתרחק \n\nשם המתרגל/ת: רבקה ואחסאן \nחוות דעת - תרגולים: רבקה המתרגלת הכי טובה בטכניון אישה מדהימה הסברים מטורפים כל הטריקים בעולם היא המציאה והיא מסבירה ממליץ מאוד ללכת לשעות קבלה אפילו של קורסים אחרים כי היא עדיין תעזור , אחסאן גם מתרגל טוב מסביר טוב כמו באלגברה נחמד מאוד \n\nשעורי הבית: שיעורי הבית 5 גיליונות ארוכים ברובם אבל ברמה טובה למבחן לא כל כך קלים לפתור בלי עזרה ממתרגל בשעת קבלה אבל אחרי רמזים ניתן לפתור לבד \n\nהמבחן: המועד א' היה פתיר שאלת הוכחה לא הכי קלה אבל אפשרית אמריקאיות הם הקושי של הקורס\n\nהשורה התחתונה: בהצלחה קורס חמוד", "timestamp": 1716366608149}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל חמודה ברמות, כן קצת מהירה אבל היא כותבת כל מה שצריך לדעת, ואם תעצרו אותה לשאול שאלה היא נחמדה ומסבירה כמה שצריך וכמו שצריך. נהניתי ללמוד איתה את הקורס. היא כן הרגישה לי קצת מנותקת ממה שקורה בפועל לקראת המבחן והיא הייתה לא לגמרי על מה רלוונטי או לא מבחינת הגישה של המרצה האחראי (שדרך אגב אם זה אלון אז תתרחקו ממנו סורי).\n\nשם המתרגל/ת: איריס ואז ניקה\nחברים איריס היא לא לכל אחד. אם במקרה אתם מתחילים את התרגולים איתה תדעו מתי להרפות ולעבור למתרגל אחר אם זה מרגיש לא נכון כי חבל על הזמן ובקורס הזה הוא חשוב. קשה מאוד לעמוד בקצב שלה ולדעתי היא מתאימה לסטודנטים חזקים בלבד, ואם אתם צריכים קצב יותר ריאלי (ואני לא צוחק, לשבת אצלה זה כמו לצפות בהקלטה על כפול 3 בלייב) אז לא מומלץ, תחסכו.\n\nלגבי ניקה - היא חמודה, היא מלמדת בקצב הגיוני והתרגולים שלה שמים דגש של איכות על כמות. עם זאת וזה אבל גדול - היא בוחרת תרגילים מאוד ספציפיים שהם טובים ועוזרים להבנה של החומר, אבל הם לא רלוונטיים למבחן. את רוב הטריקים כנראה שלא תראו אצלה, או שלא תדעו שהם טריקים חשובים באותו זמן ותגלו אותם לבד כשתלמדו למבחן, ולי זה עלה בזמן למידה יקר. אני מניח שזה תלוי גישה של המתרגל וזה בסדר, אז לשיקולכם.", "timestamp": 1716566104277}, {"author": "Ran Gil", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות:\nהתחברתי מאוד. ברורה ומפרטת היטב.\nעונה לכל שאלה ברצינות ונעימה בכיתה.\n\nשם המתרגל/ת: רבקה וניקה\nחוות דעת - תרגולים: \nהלכתי לשתיהן כל השנה כי הרגיש לי שהן משלימות אחת את השניה.\n\nרבקה - טסה בשיעור, מתקתקת תרגילים והיד כואבת מכתיבה. היא חזקה מאוד על החומר ויש לה תשובה לכל שאלה. מנוסה מאוד. מכירה טוב את המבחנים והדרישות מהקורס.\n\nניקה - קצב שמאפשר חשיבה לעומק ואפילו לפתור תוך כדי התרגול.\nמעמיקה יותר ומפתחת חשיבה. מרגיש שהמטרה שלה זה למידה ולא רק לתקתק תרגילים.\n\nשעורי הבית: \nגיליונות קשים ולוקחים הרבה זמן (בהתחלה במיוחד כי לא יודעים איך לכתוב במתמטית).\nוובוורק - חלק ארוכים ולוקחים איזה שעתיים, אחרים קצרים יותר. באופן כללי הוובוורק מעולה להקניה של חומר.\n\n המבחן: \nקשה מאוד, אבל הרגיש לי הוגן.\n\nהשורה התחתונה: \nהקורס שהיה לי הכי קשה בסמסטר א.", "timestamp": 1716830426010}, {"author": "עלמה", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלון דימטריוק\nחוות דעת - הרצאות: טעות שלא עזבתי אותו! מרצה לא נעים ולא נחמד, מסביר בצורה הכי לא ברורה שיש. יש תחושה שהוא שונא ללמד ושונא את הסטודנטים ולא אכפת לא אם יבינו או לא, העיקר שהוא ייצא ידי חובה. \n\nשם המתרגל/ת: אחסאן עבד אלפתח \nחוות דעת - תרגולים: מתרגל מקסים, תמיד עושה אווירה טובה וכיפית, מצחיק ומעניין. בשלב מסוים הבנתי שבגלל שהוא מאד מסודר ומסביר הכל אז הוא עושה מעט תרגילים בכל תרגול כך שלא רואים המון תרגילים… מי שאוהב להעמיק ושהכל מסודר גם אם רואים פחות תרגילים אז זה מתאים לו. \n\nשעורי הבית: קשים ומעצבנים, לא להיתקע! לא לפחד לרפרנס כל עוד אתם מבינים את החומר בגדול זה לא כזה קריטי…\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716837283262}, {"author": "Einbar Dror", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: אלון מדוייק להפליא, כלכך שלפעמים קשה להבין אותו כי עדיין לא התרגלת לשפה המתמטית\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: רבקה מתרגלת מעולה, הספק גבוההה ולכן רואים הרבה תרגילים. היא לא תמיד תעמיק עד הסוף אבל אם שואלים אותה היא תספק את ההסבר המלא\n\nשעורי הבית: קשים, לבוא לשעות קבלה\n\nהמבחן: אימון שריר!! לעשות מבחני עבר, הם דומים גם במבנה וגם בקושי\n\nהשורה התחתונה: קורס קשה, זה הקורס המתמטי הראשון שפוגשים אחרי התיכון...", "timestamp": 1716902872264}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nלא כולם מתחברים לשיטת הלימוד שלו, הוא \"קשוח\" לפעמים מתנפל על אלה ששואלים שאלות ומבחינתו הדברים האלה הם מובנים מאיליו. הקצב שלו בהרצאות מהיר מאוד  וחייבים לשים לב לכל דבר, מבחינתי או ללכת להרצאות שלו נטו כדי לקבל את החומר או לקחת סיכומים מההרצאות שלו וללכת למרצה אחר.(במיוחד אם הוא האחראי)\nשם המתרגל/ת: אחסאן\nאחלה מתרגל באמת, אמנם הוא לא נותן הרבה תרגילים במהלך התרגול אבל הוא מתמקד בכל שאלה ומתעמק מאוד לכן גם אם יוצאים מההרצאה עם הרגשה שלא הבנתם כלום אחרי התרגול הכל מסתדר. \nגם רבקה מעולה אבל הקצב שלה מהיר מאוד (מאוד!) היא נותנת הרבה תרגילים,  אני חושבת שעדיף לנסות את שניהם ולבחור מי מהם מתאים יותר עבורכם.\nשעורי הבית: \nלא קשים במיוחד, וגם אם יש שאלה קשה פה ושם יכולים להסתדר בשעות  הקבלה, וגם תרגילי הבית באמת בודקים את רמת ההבנה שלכם לחומר לכן אם יש משהו שאתם מתקשים בו עדיף גם לחזור על הנושא הזה מהתרגולים ומההרצאות ואז זה ילך לכם חלק.\n\nהמבחן: \nזה קורס חדש יחסית בשנה שעברה הממוצע היה גרוע(45 משהו כזה)  מועד א' היה אחלה הרמה שלו היתה סבירה יחסית יש כמה שהביאו ציונים גבוהים ויש כמה שלא בגלל שלא היה מספיק זמן ללמוד אליו. לעומת זאת מועד ב' היה על הפנים יש הפרשים עצומים בין שני המועדים (עדיין אין ציונים אבל מורגש)\n\nהשורה התחתונה: בתחילת הקורס אתם תרגישו אבודים אבל בסופו של דבר זה יסתדר העיקר הוא להשקיע מאוד בהכנה למבחן ובמהלך הסמסטר ואז תרגישו עד כמה הקורס מעניין", "timestamp": 1717074079599}, {"author": "Emmanuel Clearfield", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמרצה מעולה, מסבירה טוב את החומר. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1717256318735}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nלא יודעת מה רוצים ממנו, אחלה מרצה בעיני. מדבר ברור ולאט וכותב על הלוח את כל מה שהוא אומר בהרצאה, כותב הוכחות ברורות ומסודרות לרוב. לא אוהב כששואלים שאלות שאין בהן באמת תוכן, אין לו בעיה להסביר שוב אם לא הבנתם משהו והוא תמיד נותן לשאול שאלות בהפסקה. שעת קבלה איתו מסדרת את הראש לגמרי לגבי השאלות בגיליונות וגם לגבי דברים שלא הבנתם בהרצאה. לא להיעלב! אם הפתרון שלכם לא טוב אז תמחקו ותעשו חדש לא קרה כלום \n\nשם המתרגל/ת: רבקה המלכה\nחוות דעת - תרגולים: \nאין מה להוסיף\n\nשעורי הבית: \nממש עוזרים להבנה של החומר, לגמרי לא מכסים את כל מה שיכול להופיע בבחינה.\n\nהמבחן: \nהוגן++\n\nהשורה התחתונה: \nאל תחכו למועדי א בשביל לזכור איך מוכיחים משפטים ובשביל לתרגל סדרות. הכל חייב לקרות תוך כדי הסמסטר אחרת תמצאו את עצמכם במועד ב\nאין הרבה מבחני עבר אז תתחילו מחדוות 1מ כדי להתחמם ואז תמשיכו למה שיש בחדוא 1ת. קחו חבר שלומד אינפי שישלח לכם שאלות מאצלם שאתם יכולים לפתור זה מאוד עוזר. יש גם תרגול נוסף שנמצא במודל עם פתרונות מלאים ברמה גבוהה.\nלא לזלזל בחלק האמריקאי במבחן, שם הולכות הכי הרבה נקודות", "timestamp": 1717330857176}, {"author": "Ran Gil", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מלמדת טוב, חמודה ועונה על כל השאלות. תכינו את היד כי כותבים הרבה…\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מקצוענית, מאוד מהירה וקשה לעקוב. לפעמים העדפתי רק להקשיב ולא לכתוב כי באמת הקצב מאוד מהיר. \n\nשעורי הבית: קשים מאוד, ארוכים מאוד. אבל זו הדרך היחידה להבין את החומר. \n\nהמבחן: קשה מאוד. השאלות האמריקאיות קריטיות לציון. יש לחץ זמן.\n\nהשורה התחתונה:", "timestamp": 1717673442968}, {"author": "רון", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מעולה ומהירה, אבל בן אדם נחמד מאוד ונעים\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מהירה מאוד ממליץ לשלב עם עוד מישהו איטי יותר\n\nשעורי הבית: קשים אבל עוזרים להבין\n\nהמבחן: \nנורא ואיום, מועד ב שאין סיכוי לפתור ב3 שעות. ממוצע נמוך יותר מקומה 1 באולמן. כנראה שהמרצה האחראי נבהל שיצא לו ממוצע יותר מ50 במועד א אז התנקם בנו במועד ב. תתכוננו טוב כדי שלא תצטרכו לגשת למועד ב.\nתשקיעו באמריקאיות מאוד - שם המפתח לעבור את המבחן\n\nהשורה התחתונה: זבל של קורס אבל חובה מה נעשה", "timestamp": 1717689790580}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלון דמיטריוק \nחוות דעת - הרצאות:\n אלון מרצה טוב לדעתי, מבחינת העברת החומר הוא טוב מאוד, הרבה אמרו לפני שיש לו יחס קר עם האנשים בכיתה, בעיקר עם מי ששואל אותו, לא הרגשתי את זה הרבה למרות שלפעמים זה ניכר.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nאפרת מתרגלת נהדרת, היא חוזרת קצת על החומר לפני שהיא מתחילה לעבור על התרגילים ככה שמי שלא הבין משהו בהרצאה יכול להבין אותו בתרגול שלה, גם כן הקצב שלה הוא לא מהיר לכן אפשר לעקוב אחריה מבלי ללכת לאיבוד.\n\nשעורי הבית: \nקשים, ארוכים ולוקחים הרבה זמן, במיוחד בקורס הזה כי הקורס יחסית חדש ואין רפרנסים.\n\nהמבחן: \nאני אישית לא ניגשתי למועד א' אבל ממה שראיתי הוא היה קשה אבל \"פתיר\". מועד ב' היה קשה ברמות ולפי דעתי 3 שעות בטח לא מספיקות כדי לפתור אותו לכן גם הממוצע שלו משקף את הרמה של המבחן.\nאני ממליץ מאוד לתרגל המון שאלות אמריקאות כי הן השאלות שקובעות את הציון (אצלי לפחות הם הצילו את הציון).\n \nהשורה התחתונה: \nהקורס הכי קשה by far לסמסטר א' למי שלומד הנדסת חשמל/מחשבים, ממליץ להשקיע בו הרבה במהלך הסמסטר כדי לא ליפול בסוף.", "timestamp": 1718040643818}]}