{"posts": [{"author": "SR", "difficultyRank": 4, "generalRank": 5, "semester": "201702", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ההרצאות המוקלטות של צנזור מעולות, והן אחת לאחת מה שהוא עושה בכיתה. לי אישית זה היה יותר נוח כי אפשר לראות בקצב שלי ולחזור אחורה אם משהו לא מובן.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: יוליה מתרגלת מעולה. לפעמים היא קצת רצה על החומר, אבל זה לא בהכרח משהו רע - מספיקים הרבה יותר תרגילים ומגיעים לדברים הקשים באמת.\n\nשעורי הבית: נכון לסמסטר אביב 18, יש תרגילי בית פתוחים ותרגילי בית במתנט. תרגילי המתנט לפעמים קצת מציקים ודורשים הרבה טכניקה. תרגילי הבית הפתוחים הם ההכנה האמיתית למבחנים ומאוד חשוב לעשות אותם, ולהשתדל לא לרפרנס (ואם כן - לוודא שלא עושים את זה על עיוור, אלא באמת מבינים את הפתרון). לפעמים תרגילי הבית מרגישים קצת לא פתירים, ולכן כדאי להתייעץ המתרגלים בשעות הקבלה.\n\nהמבחן: המבחן היה הוגן מאוד.\n\nהשורה התחתונה: קורס מעניין ומאתגר מאוד, דורש הרבה במהלך הסמסטר וחשוב לתת לו את הזמן שלו.", "timestamp": 1597744119259}, {"author": "YT", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מרצה מעולה, מסביר בצורה מדהימה הכל. ההרצאות ביוטיוב מומלצות מאד מאד!\nמה שכן הרבה פעמים לא סבלני לשאלות ששואלים אותו.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מרצה מעולה, חדה מאד. יודעת את החומר בצורה מדהימה ומעבירה אותו מצוין. ממליץ בחום! \n\nשעורי הבית: מאתגרים מאד. גיליון וWW פעם בשבוע. לוקח יומיים בשבוע- יום וחצי. אין רפרנסים לרוב השאלות. ממליץ לא להתקע על שאלות ימים שלמים ולבזבז זמן לשווא אלא להיעזר בחברים.\n\nהמבחן: מבחנים קשים ומאתגרים, לרוב הוגנים ותואמים לרמה של החומר המועבר במהלך הסמסטר. בדיקה מאד קפדנית.\n\nהשורה התחתונה: קורס קשה ומאתגר, דורש המון השקעה, זמן וכוח רצון. ממליץ מההתחלה לשבור את הראש על כל דבר שלא מבינים בו בזמן שיש פחות עומס בקורסים אחרים ובסוף בתקווה החומר מתיישב.", "timestamp": 1597753189791}, {"author": "י", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: רק לראות מוקלט של צנזור\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אפרת המלכה \n\nשעורי הבית: קשים עד בלתי פתירים, סבל טהור\n\nהמבחן: \nיחסית הוגן \nהשורה התחתונה: קורס קשוח, לפתור עם חברים, לשנן את החוברת הרצאות לקראת המבחן, להבין את ההוכחות טוב טוב", "timestamp": 1598380690714}, {"author": "ב", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: טוב מאוד! אפשר להסתדר רק עם המוקלט, יש שינוי רק בכמה הוכחות\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: טוב מאוד! נותן שאלות מאתגרות ותורמות הרבה להבנת החומר\n\nשעורי הבית: 6 תרגילי בית פתוחים ברמה קשה אך מאוד עוזרים להבנת החומר , וובוורקים.\n\nהשורה התחתונה: קורס יפה מאוד, דורש השקעה במהלך הסמסטר כדי להבין הכל.", "timestamp": 1598531703623}, {"author": "מ", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: נוהל קורנה עם כיתה הפוכה אז צפינו בהרצאות ביוטיוב ובמפגשי הזום היתה \"הטמעה של החומר\". בהמשך הסמסטר בעקבות שיחות עם הסטודנטים שינו את מפגשי הזום להיות שעה הטמעה ושעה שעת קבלה על מנת להוריד מהעומס, וזה אכן היה שיפור לדעתי.\n\nשם המתרגל/ת: מיכל קליינשטרן\nחוות דעת - תרגולים: היא מאוד נחמדה אבל קצת קשה לעקוב אחריה ולדעתי גם לא מאוד מסודרת, עניין של טעם.\n\nשעורי הבית: \nגליון פעם בשבועיים, וובוורק גם באותה תדירות בערך. יש רפרנסים להכל אבל לא קל לפתור (לי לפחות). חסרון משמעותי זה שלא היה כמעט פידבק על ההגשות של שיעורי הבית וגם הם לא היוו פקטור בציון, שום מגן שום כלום. \nהמבחן: קשוח לדעתי\n\nהשורה התחתונה: לי היה קשה אבל כן מעניין בסך הכל.", "timestamp": 1599471668090}, {"author": "און פביאן", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1601890183030}, {"author": "הרמיוני גרינג'ר", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: אביב צנזור האיש והאגדה\nחוות דעת - הרצאות: מרצה מצויין\n\nשם המתרגל/ת: אפרת \nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: קשים במיוחד\n\nהמבחן: קשה במיוחד\n\nהשורה התחתונה: קורס קשה במיוחד", "timestamp": 1603570680202}, {"author": "צביקה", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מעניינות מאוד\n\nשם המתרגל/ת: מיכל ק.\nחוות דעת - תרגולים: המתרגל הכי טובה בקורס\n\nשעורי הבית: קשים מאוד\n\nהמבחן: מבחן הוגן\n\nהשורה התחתונה: קורס קשה, ודורש המון שעות של תרגול", "timestamp": 1603881057140}, {"author": "ג'ורג'י", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: אביב צנזור (וידאו)\nחוות דעת - הרצאות: מרצה טוב, מאוד מובן.\n\nשם המתרגל/ת: וידאו של אינפי 1\nחוות דעת - תרגולים: סביר יחסית, בגלל הקורונה אמרו לצפות בו וכתבו בדיוק באילו חלקים. בסמסטר רגיל לא מומלץ, כי הרבה מהחומר שהוא מלמד בכלל לא שייך לקורס.\n\nשעורי הבית: הוובוורקים די קלים, אבל הגליונות הפתוחים קשים יחסית, והבדיקה שלהם מזלזלת ברמות (בקושי בודקים שאלה והסימון הוא וי/איקס פחות או יותר). שווה להילחם על הגליונות הפתוחים ולהבין בדיוק כמה קרובה התשובה לתשובה הרשמית (לרמת הניסוח), כי בסוף על זה נופלים במבחן.\n\nהמבחן: זוועה, בגלל הקורונה היו שני חלקים של שעה עם הפסקה ביניהם. המבחן עצמו היה קשה (במועד א' הייתה שאלה ממוחזרת ממבחן רגיל שלצערי לא ראיתי לפני, וכנראה הכוונה הייתה להתחשב (הוא לא ממחזר שאלות אף פעם בערך) אבל בפועל היא לא הייתה פתירה במסגרת החצי שעה לשאלה אם לא ראית אותה קודם). מועד ב' היה אפילו יותר גרוע (הממוצע היה 50, לפני פקטור של 7 נקודות).\n\nהשורה התחתונה: קורס חובה אז אין יותר מידי מה לעשות... צריך להיות חדים על הניסוחים והפרמול ממש. מומלץ מאוד לקחת פק\"ל שמעביר מישהו טוב/חונך- לי זה עשה את כל ההבדל.", "timestamp": 1607385826109}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מעניין בטירוף, בשבועיים שלושה האחרונים מתחיל לאבד כיוון. גורם לך להבין ששום דבר בחיים הוא לא מובן מאליו\n\nשם המתרגל/ת: שקד בדר\nחוות דעת - תרגולים: ממש ברורה וקשובה לשאלות, ממש כיף אצלה\n\nשעורי הבית: משמעותית קשים יותר מהמבחן וזה מעולה. הם לא נכללים בציון בכלל אבל יש משוב וזה חשוב לדעת איך אתם כותבים. הגיליון האחרון כבר התלכד עם מבחן בפיסיקה 1פ אז לא הגשתי אותו אבל בכל זאת עשיתי באיחור, ממליץ!\n\nהמבחן: יותר קל משיעורי הבית (זה כיף!) אבל עדיין מאוד מאתגר שזה פחות כיף\n\nהשורה התחתונה: צריך להיות חדים מההתחלה עד הסוף. אל תתקדמו לפונקציות עד אחרי 4-5 סימולציות של בחני אמצע. זה עוזר בטירוף גם אם תהיו שבוע שבועיים מאחורי כולם", "timestamp": 1611656382129}, {"author": ":(", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מיכל קליינשטיין\nחוות דעת - הרצאות: כיתה הפוכה אז צפיתי הקלטות של צנזור ולא אתייסח אליהם. בהרצאה הפוכה של מיכל קיבלנו 2-3 תרגילים בכל שיעור, ומיכל נתנה לנו כמה דקות לחשוב על כל תרגיל ולנסות להוכיח לבד. אחר כך היא ליוותה את אחד הסטודנטים בהוכחה שלו. לדעתי מיכל עשתה את זה באופן מעולה, לא התעכבה יותר מדי על סטודנטים שנתקעו אז הספקנו את כל התרגילים, ודאגה להדגיש נקודות חשובות שעולות תוך כדי. היא בחרה את תרגילים במיוחד כדי להעביר נקודה מסויימת או להראות לנו תרגילים מסוג שונה או דרכים אחרות להסתכל על בעיות. בהתחלה הלכתי להרצאות ההפוכות של צנזור והספקנו איתו הרבה פחות בגלל שהוא התעכב עם כל תלמיד שהתנדב לפתור את התרגיל עד שהם סיימו, ולפעמים זה לקח את כל השיעור.\n\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: השתתפתי בתרגולים הפוכים. לגבי התרגולים המוקלטים של שקד - לדעתי ברמה מאוד גבוהה. כל תרגול מתוסרט ותמציתי, ומוסבר בצורה מאוד טובה. כמעט תמיד לא היו לי שאלות כי דאגו לכסות את כל הנקודות.\nלגבי התרגולים ההפוכים של מיכל - לדעתי ממש ממש טובים. מיכל פתרה איתנו (כמו בהרצאות הפוכות - קודם מנסים לבד ואז מישהו מתנדב לפתור ביחד עם מיכל) תרגילים שבדרך כלל היה בהם משהו מעבר, תרגילים מסוג שלא נתקלנו בו עד כה או דרכים נוספות לפתור שלא ראינו. האווירה הייתה ממש טובה ומיכל מסבירה מעולה, אני הרגשתי שהתרגולים איתה תרמו לי המון.\n\nשעורי הבית: כל שבוע גליון וכל שבוע וחצי WW.\nהגליונות קשים ויכולים לקחת מספר ימים. לא חובה אבל כדאי לעשות אותם. יש רפרנסים לרוב התרגילים אבל כדאי לנסות לבד. WW קצת חופר לפעמים אבל נותן מגן.\n\nהמבחן: קשה, הוגן.\n\nהשורה התחתונה: שיעורים הפוכים >>> שיעורים רגילים", "timestamp": 1612294907528}, {"author": "roey", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: צפיתי בהרצאות המוקלטות ביוטיוב , לדעתי הן טובות מאוד ומובהרות דיין.\nלגבי כיתה הפוכה , באופן אישי אני לא התחברתי לקונספט. \nהשיעור לא ממריא ולי הרגיש שזה בזבוז של זמן \n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: אלוף! מסביר מעולה את החומר ואיך לגשת לתרגלים בצורה נכונה .  \n\nשעורי הבית: \nשלא נדע\nהמבחן: \nתכף נדע\nהשורה התחתונה: בהצלחה", "timestamp": 1612428552013}, {"author": "נדל", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: סמסטר זום, הייתה אופציה ללמוד עם צנזור מוקלט + צנזור בכיתה הפוכה, עם הזמן נשארתי עם המוקלט בלבד. כיתות הפוכות דורשות פי 2 זמן ומאמץ, ולא תמיד התמורה שווה את זה, אפילו לא כשמדובר במרצה אדיר ומשקיען כמו צנזור.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: יוליה מאוד מהירה, זה לא סוד. היא עוברת מתרגיל לפיתרון לתרגיל נוסף, בלי לחכות לאף אחד. לי אישית זה התאים, כי זה גרם לי לקחת מאוד ברצינות את התרגולים, בטח ובטח כשהם היו בזום והיה קל מאוד לאבד בהם ריכוז. לא לכולם זה התאים. במידה מסוימת זה גם נותן תחושה של ביטחון, אתה לומד אצל מתרגלת שמאוד בטוחה במה שהיא עושה ושולטת לחלוטין בתוכן של הקורס. \n\nשעורי הבית: קשים יחסית לשאלות של המבחן, אבל מקור תרגול מאוד חשוב. אין חובת הגשה אבל יש שאלה/סעיף שיעורי בית במבחן אז שווה לפתור אותם לפני.\n\nהמבחן: כל מה שמופיע במבחן חוזר בצורה כזאת או אחרת להרצאות של צנזור. אם לא בצורה ישירה (כשצריך להוכיח משפט מסוים) אז בצורה עקיפה- הטריקים להוכחות בשאלות הופיעו בשלב כזה או אחר בהרצאה. מאוד קשה לזכור את זה אז טוב לחזור על המשפטים שלמדנו ולנסות להוכיח לבד, בעזרת ההרצאות המוקלטות. \n\nהשורה התחתונה: אינפי 1מ. השם מאוד מפחיד אבל אל תתנו לו לכרסם לכם בביטחון. להפתעתי הקורס היה מעניין יותר מרוב הקורסים האחרים של סמסטר א.", "timestamp": 1612433543613}, {"author": "AnAbsoluteChad", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ראיתי מוקלטות והיה אפשרות להגיע ל\"כיתה הפוכה\", אישית לא ממליץ, לדעתי זה בזבוז זמן, אם יש שעה לשרוף ולהרוויח כמות חומר של רבע שעה אז ללכת, אחרת לא כדאי.\n\nשם המתרגל/ת: אירנה גרליק\nחוות דעת - תרגולים: כן כן כן ושוב כן, דואגת שכולם יבינו, מסבירה מעולה, פותרת תרגילים רלוונטים לגליונות ולמבחן, אם היא מתרגלת בקורס לכו אליה.\n\nשעורי הבית: סבל סבל סבל, לעשות ולא להתעצל, לא קשה לרפרנס, אבל ממליץ לפתור לבד עד גבול ההגיון, (לשבת 3 שעות על תרגיל ולא לדעת עדיין מאיפה להתחיל - לא הגיוני, זה אומר שצריך רמז או פוש קטן) ולהשוות עם אנשים לפני תאריך ההגשה.\n\nהמבחן: קשה. אין טעם ליפות את זה, מבחן מאוד קשה. לעבור על מבחנים של המרצה האחראי, למצוא עקביות בסגנון השאלות שהוא נותן, ולתרגל עד שיוצא עשן.\n\nהשורה התחתונה: קורס קשה, מעניין מאוד, לא ברור למה צריך אותו לתואר, אבל אין ברירה אלא לעבור דרכו.", "timestamp": 1612537668951}, {"author": "גיא", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: אין ספק שהבן אדם יודע להעביר חומר בצורה ברורה חדה ומובנת. יידע להסביר גם לארנבת מה זה גבול.\nמשום מה תרגול כיתה הפוכה פחות התחברתי אליו ולאופן שהוא מעביר אותו, אך אין ספק שההרצאות המוקלטות בהחלט מספיקות ומעולות בכדי לעבור את הקורס הזה.\n\nשם המתרגל/ת: טל בן-יהודה\nחוות דעת - תרגולים: אלוף העולם! יוצר אווירה נעימה ונוחה להשתתף ולהתנסות ומסביר את החומר בצורה הטובה ביותר מהבסיס ועד הטכניקות הנדרשות בכל סיטואציה. ממליץ !\n\nשעורי הבית: רובם פייריים אך חלקם קשים מאוד ובלתי פתירים !\n\nהמבחן: לא קל בכלל ודורש את כל הזמן הדרוש, אך פייר!\n\nהשורה התחתונה: קורס ברמה גבוהה - לקחת ברצינות", "timestamp": 1612543249318}, {"author": "אינפיטימטריסט", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מיכל ק.\nחוות דעת - הרצאות: הייתי בהצראות ההפוכות של מיכל, אחרי 2 סרטונים של צנזור מגיעים לעוד שעה אצלה. זה עובד כמעיין חיזוק או העמקה בחומר- מאוד מאוד ממולץ, אינפי הוא גם ככה המקצוע שדורש הכי הרבה זמן בסמסטר הראשון וזה טוב מבחינת לוז להשקיע בו באופן קבוע.\nבנוסך לזה שמיכל נוגעת בנקודות מאוד חשובות שתורמות להבנה ולפתרון.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: היינו הסמסטר קבוצה יחסית מצומצת אצל ניקה וזה היה נהדר, זמן לשאול שאלות ובאמת להבין כל תרגיל.\nניקה חדה מאוד אז מספיקים הרבה והיא תדע לענות על כל שאלה שיש לך- מומלץ.\n\nשעורי הבית: שווה להשקיע בגליונות- הם רמה מעל המבחן אבל יש בהם רעיונות ששווה להכיר ולתרגל.\nכמובן שבסוף בגלל הרמה נעזרים המון ברפרנס\n\nהמבחן: בעייני הוא יותר טריקי והעניין הוא לזהות בדיוק את דרך ההוכחה שאתה מחפש- בשביל זה פשוט לתרגל המון ממבחנים ושכל החומר ישב מסודר מבחינת הוכחות בראש\n\nהשורה התחתונה: להשקיע המון זמן- להוכיח לבד דברים ואמור להיות בסדר", "timestamp": 1612559704878}, {"author": "dan shpector", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נעמי\nחוות דעת - הרצאות: כיתה הפוכה.\nהרצאות מעשירות, נעמי נותנת הזדמנות לכולם להשתתף וזה באמת מעמיק את הלמידה.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: תרגולים טובים ועוזרים לשיעורי בית ולהבנה של החומר. יוליה רצה מהר על התרגולים. לפעמים קצת קרה ולא סבלנית לשאלות\n\nשעורי הבית: קשים ודורשים הרבה  זמן\n\nהמבחן: הוגן אבל דרש הרבה הכנה לפניי\n\nהשורה התחתונה: דורש השקעה רבה אבל בהחלט אפשר להצליח", "timestamp": 1612608362992}, {"author": "א", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: בגלל שהסמסטר היה בזום היו הרצאות בשיטת כיתה הפוכה. בהרצאות המוקלטות של צנזור ביוטיוב ההסברים ממש טובים ומובנים, אבל פחות התחברתי לשיטה של הכיתה ההפוכה. \n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: לפעמים קצת רצה על החומר אבל סך הכל מאוד ברורה לדעתי .\n\nשעורי הבית: גיליון חדש כל שבוע, עמוס והשאלות קשות אבל שווה להשקיע ולפתור את הגיליונות לבד, עוזר מאוד להבין את החומר.\nהשורה התחתונה: קורס לא פשוט, דורש השקעה לאורך כל הסמסטר ולא רק לפני המבחן.", "timestamp": 1612627884443}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nבעיניי מרצה פשוט מדהים. ההרצאות המוקלטות שלו מעולות, ובמתכונת הכיתה ההפוכה יש הרבה מקום לתרגול נוסף, מה שממש עזר לי להיות חדה יותר על החומר. המתכונת של השיעור ההפוך זה שעה אקטיבית ושעה של שאילת שאלות, וחשוב לא להישאר בכיתה סתם כדי לשמוע שאלות של אחרים, ולהבין שזה בזבוז זמן.\n\nשם המתרגלת: עברתי כמה מתרגלים\nחוות דעת - תרגולים:\nרבקה אביטל - מתרגלת מדהימה עם המון ניסיון מאחוריה. מומלץ לראות את התרגולים שלה מוקלטי, אם אתה קצת איטיים כמוני, כי היא קצת רצה וכשזה מוקלט אפשר לעצור ולהשמיע שוב.\nניקה פת - רצה על החומר ולא כל כך מובנת בעיניי, אני לא התחברתי.\nתרגולים מוקלטים של שקד - יכול להיות שחלק יתחברו יותר, אבל אני לא אהבתי את המתכונת של הסרטונים הקצרים בלי האינטראקציה עם הקהל - הרגיש לי מוזר ולא הצלחתי להתמיד.\n\nשעורי הבית:\nשיעורי הבית דורשים הרבה עבודה. הוובוורקים קצרים ויחסית נחמדים, אבל הגיליונות הפתוחים לוקחים הרבה מאוד זמן. אל תרפרנסו!! אני לא רפרנסתי כל הסמסטר ואני חושבת שזה עשה לי טוב. מה שכן, נעזרתי הרבה במתימטיקלי כדי להצליח גם לפתור בזמן נורמלי.\n\nהמבחן:\nהיה קשה אבל פיירי בסה\"כ. כמו שאפשר לצפות מקורס שהממוצע בו הוא ~70 \n\nהשורה התחתונה:\nקורס שדורשהמון השקעה אם אתם לא גאונים, כדאי לפחות לנסות להנות ממנו ולראות אותו כמשהו מעניין, בשביל הבריאות הנפשית שלכם :)", "timestamp": 1612631578887}, {"author": "refael Zilberblat", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  מיכל קליינשטרן\nחוות דעת - הרצאות: \nהרצאות הפוכות:\nמרצה מעולה,נחמדה מאוד ומסבירה טוב.\nשם המתרגל/ת:  יוליה פייגן\nחוות דעת - תרגולים: \nעושה הכל כמו שצריך ומסבירה באופן ברור.\nלפעמים קצת נוקשה אבל נחמדה בדרך שלה.\nשעורי הבית: \nמועילים ויחסית ארוכים\nהמבחן: \nפייר\nהשורה התחתונה: \nקורס קשה שצריך להשקיע", "timestamp": 1612701225595}, {"author": "מיכאל פוליאקוב", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ד״ר אביב צנזור (אחראי) + הקלטות וידיו.\nמיכל ק מרצה כיתה הפוכה בזום\n\nחוות דעת - הרצאות: מדהים. מעניין בהיר. מה שכיף שזה קורס לפרפקציוניסטים. הרגשה שהמרצה נותן את כל מה שיש לו, לא משאיר לעצמו כלום. מי שיודע את הקורס יודע גם להעביר אותו. אין משפטים או הגדרות שמלמדים על חצי כח ״כי אתם לא מתמטיקאים״ או ״זה כבד אז תעיינו באינטרנט הוכחה לבד״. הכל כולל הכל בנוי. שום לבנה לא נשארת רופפת.\n\nשם המתרגלת: ניקה פת\nחוות דעת - תרגולים: מעולה. בלי בזבוז זמן. התרגולים באמת על הוכחות וכו׳ שלא היית מגיע לבד.\n\nשעורי הבית: בונה והכרחי. אי אפשר להגיד שזה מספיק. שלא כמו בתיכון שאם סיימת את כלל שיעורי הבית אתה מוכן למבחן. כאן אם סיימת את כלל שיעורי הבית ונשאת ונתת עם חברים על ההוכחות שלך אז בהחלט קינת את המיומנות להוכיח בצורה יפה. אבל עדיין למבחן צריך עוד לזכור היטב את כל ההוכחות ואת כל ההגדרות. שאלה כמו נסח את משפט ויישטראס. הוכח את המשפט חוזרת על עצמה כל מבחן. וובורקים קלילים, לא מקיפים בכלל. בעיקר הצד החישובי של הקורס (כמו חשב גבול...).\n\nהמבחן: בסמסטר הזה היה סופר הוגן. אין מה להגיד. אם להשוות את הסמסטרים הקודמים כנראה שלא היה ולא יהיה מבחן ברמה הזאת.\n\nהשורה התחתונה: קורס מתוקתק בצורה בלתי רגילה. בנוי ומועבר בצורה נפלאה. באמת 100 פלוס.\nמי שנהנה מגאומטריה בתיכון ואוהב הוכחות זה קורס מדהים.\nהצוות אדיב, הצוות אוהב מאוד את החומר בעצמו וזה מועבר מאוד לתלמידים. הסילבוס ברור ומדוייק. בקיצור הכל מובנה יפה וחכם.\nהרעיון של הכיתות הפוכות, נהדר.", "timestamp": 1612876404588}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nאם חשוב לכם לשאול שאלות ועוזר לכם ללמוד בכיתות קטנות, לא להתקרב לכיתות שלו אפילו שהוא מרצה מעולה (המוניטין מוצדק). המוקלטות מדהימות.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nכל הפרגון מוצדק וכל מילה מיותרת. מסבירה ברור, בקצב מעולה, נותנת מקום לשאלות\n\nשעורי הבית: בשבילי היו על גבול הלא פתירים, אבל ממש חשובים להבנה של הדברים\n\nהמבחן: קשה ממש כי זה אינפי, אבל בלי דברים שלא קשורים לחומר או שלא היו בתרגילי בית. קשוח ממש אבל פייר.\n\nהשורה התחתונה: קשה בדיוק כמו שזה נשמע אבל יש כמה דברים יפים ומעניינים, תעשו את השיעורי בית ואל תשאירו פערים", "timestamp": 1612897836172}, {"author": "mishel Hitibeshvili", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: צנזור מוקלטות+הפוכות אין מה לעשות אינפי לומדים מתרגולים ועבודה עצמית.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: המתרגלת הכי טובה מבחינתי מעבירה את החומר בצורה מעניינת לא משעמם איתה בכלל\n\nשעורי הבית: כל שבוע גיליון עדיף להתחיל ביום שיוצא אחרת זה מתחיל להערם\n\nהמבחן: המבחן היה הוגן כנראה בגלל שזה סמסטר קורונה\n\nהשורה התחתונה: חייב לעשות את הקורס עדיף להשקיע כמה שיותר בזמן הסמסטר כדי לא לחזור על הקורס", "timestamp": 1612957786174}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הרצאות מהיוטיוב- הכי טובות ונוחות\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מתקדמת ממש מהר ועושה הרבה בכל תרגול, קצת מבלבלת, הסתמכתי בעיקר על התרגולים המוקלטים\n\nשעורי הבית: \n\nהמבחן: היה הוגן אבל צריך להשקיע הרבה מאוד כדי להצליח\n\nהשורה התחתונה: קורס קשה ועמוס, כדאי להשקיע מאוד כדי להצליח אבל ממש מעניין :)", "timestamp": 1613042271189}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מיכל קלרנשטיין\nחוות דעת - הרצאות: ההרצאות היו הפוכות ראינו מוקלט והגענו לחיזוק . עם העומס של הסמסטר השעןת ההפוכות היו בזבוז זמן\n\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: מתרגל הכי טוב בפקולטה הוא נותן תרגילים קשים לרוב ממבחנים ומלווה תלמידים לפיתרון דבר שבעיניי משאיר אותך מרוכז וחד בשיעורים . הרשימות ואופן העברת התרגול היה מסודר ונוח ובאמת סגר את ההבנה על החונר .\n\nשעורי הבית: קשים אבל שווה להאבק תורם להבין תחומר\n\nהמבחן:  קשה אבל מי שהשקיע בסמסטר והיה על החומר בהחלט יכל להוציא בו ציון טוב\nהשורה התחתונה:", "timestamp": 1613118059600}, {"author": "Krypton", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nכל מה שנאמר על הבחור אמת, מסביר מצוין וההקלטות מאוד נוחות.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: \nמעולה ממש לדעתי, יכולה להיות מהירה לאנשים אבל עוברת על הרבה מאוד מהחומר בכל תרגול.\n\nשעורי הבית: \nברי ביצוע וסופר חשובים. מאוד ממליץ לבצע בדיקה עצמית אל מול פתרונות שמפרסם צוות הקורס, רק ככה אפשר באמת למצוא טעויות.\n\nהמבחן: \nבסמסטר הזה המבחן היה במתכונת שונה (2 שאלות אמריקאיות ובלי שאלת ציטוט משפט), השאלות הוכחה דומות מאוד למה שיש בגיליונות ואפילו קלות יותר בדר\"כ. \n\nהשורה התחתונה: \nאחלה קורס, מלמד את הכלים הכי בסיסיים לחשיבה מתמטית ומאוד מעניין.", "timestamp": 1613295576473}, {"author": "אביב", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  דר' אביב צנזור\nחוות דעת - הרצאות: \nאחלה של מרצה, קצת קשה בזום עם המון אנשים אבל לומדים להסתדר. לא מקליט את הזום אז ממליץ להתכונן בהתאם\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nמתרגלת מעולה, קצת קשה להתרכז כי זה כמו \"שיעור פתוח\" אבל כל אחד ומה שנוח לו.\nשעורי הבית: \nקשים, יותר מהמבחן אפילו.\nהמבחן: הוגן וקשה.\n\nהשורה התחתונה: קורס קשה, אפשרי להצליח אם מנסים באמת.", "timestamp": 1613323357426}, {"author": "אופק גינת", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: המוקלטות. כל מה שצריך בשביל לקבל ציון טוב נמצא בהקלטות. צריך לדעת ולהבין כל טענה גם הכי קטנה שמופיעה בסרטונים\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מתרגלת מעולה , מביאה הרבה תרגילים ממבחנים ונקודות חשובות\n\nשעורי הבית: לא פתירים, הכל מרפרנסים.\n\nהמבחן: קשה מאוד אבל הוגן, מי שלומד ומטמיע הכל יכול להוציא ציון טוב\n\nהשורה התחתונה: קורס קשה אבל אפשרי", "timestamp": 1613396392509}, {"author": "Dan", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אביב\nחוות דעת - הרצאות: עובר על החומר בצורה מקיפה, ישנם נושאים שמדלג על פרטים בחומר שהכרחיים להבנה\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1613399904730}, {"author": "Yogev Namir", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: בהפוכה עוברים על דברים שהוא נתן להוכיח בבית בהרצאות המוקלטות.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: המתרגל מספר 1!!!! פשוט כיף לבוא לתרגולים שלו! קצב מעולה, מביא תרגילים ממבחנים, קבוצה יחסית קטנה ועובד עם אייפד.\n\nשעורי הבית: הגליונות הפתוחים לרוב קשים מהמבחנים\n\nהמבחן: \n\nהשורה התחתונה: אפשר להסתפק בהקלטות של צנזור ולבוא לתרגולים(רק לאחסאן!!!)", "timestamp": 1613401019893}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכל ק\nחוות דעת - הרצאות: \nהרצאות בוידאו של צנזור אין מה להוסיף.\nכיתה הפוכה עם מיכל לדעתי היה מיותר. היא מסבירה מאוד מהר והיא מאוד מבולגנת כך שהרבה פעמים מתחילה הוכחה ובאמצע קופצת לכל מיני הוכחות אחרות בלי שמסיימים את ההוכחה המקורית.\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nמעולה, מסבירה מצוין ועושה תרגילים שתואמים לרמה.\nשעורי הבית: \nקשים מאוד להכל יש רפרנס אבל שווה להשקיע ולפתור לבד/להבין לעומק את הפתרון.\nהמבחן: \nהמבחן היה הוגן, המבנה היה שונה משנים קודמות 2 שאלות סגורות לדעתי רק הזיקו והיה עדיף עוד שאלת הוכחה.\nהשורה התחתונה: קורס קשה, הבדיקה במבחן מאוד קפדנית לכן צריך להבין לעומק.", "timestamp": 1613402709565}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nמרצה מעולה שבאמת אכפת לו מהתלמידים.\n\nשם המתרגל/ת: התרגולים המוקלטים של שקד\nחוות דעת - תרגולים: מעביר את החומר בצורה קלה להבנה.\n\nשעורי הבית: קשה לעמוד בקצב שבוע אחרי שבוע אך בסופו של דבר, הם רק בשבילכם\n\nהמבחן: קשה אך הוגן. אם משקיעים וחורשים במהלך הסמסטר, אין סיבה לא לעבור את הקורס (גם אם במועד ב)\n\nהשורה התחתונה: תחרשו ויהיה טוב", "timestamp": 1613408190076}, {"author": "טל", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: הסרטונים כמובן מעולים, הכיתה ההפוכה לא באמת תרמה\n\nשם המתרגל/ת: ד\"ר אירנה גורליק\nחוות דעת - תרגולים: אירנה מצויינת וחשוב לה מאוד שנצליח. היא מאוד סבלנית וזה חשוב. הכתב שלה קצת מבולגן וזה יכול להיות בעייתי לחלק מהאנשים, לי זה עזר להישאר בפוקוס.\nהיא ואפרת אבירם הן המתרגלות הכי טובות בעיניי\n\nשעורי הבית: ארוכים מאוד, יותר קשים מהמבחן, אבל חשובים להבנה והטמעה של החומר\n\nהמבחן: הסמסטר היה הוגן, למרות שקשה. נראה שלפחות בזום נוטים כרגע יותר לכיוון של שאלות סגורות (אצלנו 42 נקודות מהמבחן היה סגור)\n\nהשורה התחתונה: קורס שחייבים לקחת, לא נהניתי בכלל, אבל בסוף שורדים", "timestamp": 1613410020390}, {"author": "infinator", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: צפיתי במוקלט, עובר על כל החומר ולא צריך ללכת להרצאות.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים:  מתרגלת מעולה\n\nשעורי הבית: לא עשיתי את הגיליונות הפתוחים רק את וויב-וורק \n\nהמבחן: קשה אך הוגן, להיות חד בחומר ולתרגל\n\nהשורה התחתונה: קורס קשה ולא מומלץ", "timestamp": 1613428709569}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הקלטות מצויינות. מספיקות כדי לדעת את החומר.\nהרצאות הפוכות לא שימושיות, ביזבוז של זמן.\nלא אכפת לו מהסטודנטים.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת טובה מאוד. עונה על כל השאלות, מספיקה את כל החומר. מוכנה להשאר אחרי השיעור ולהמשיך להסביר. רואים שהיא רוצה שנצליח. מאוד אכפתית.\n\nשעורי הבית: בהתחלה הם לא מובנים אך בהמשך הקורס זה מתחיל להיות יותר קל. לוקחים הרבה זמן. אסור לדחות אותם למרות שהם לא להגשה.\n\nהמבחן: בדיקה בצורה קשוחה מאוד. \n\nהשורה התחתונה: קורס קשה. אם יש אפשרות לא לקחת אז לא לקח", "timestamp": 1613470523599}, {"author": "Shay Hacohen", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ההרצאות המוקלטות מצוינות. הרצאות הכיתה ההפוכה היו מגניבות בהתחלה, אך עם הזמן הרגשתי יותר ויותר שארוויח יותר אם אעבור עצמאית על החומר, אתרגל או אעבוד על גליונות הבית, ואתקדם בקצב שמתאים לי במקום בקצב שמתאים (?) למאות התלמידים שנכנסים להרצאה; בשלב מסוים הפסקתי להיכנס אליהן לחלוטין ולא התחרטתי על כך (אבל אם מישהו מסכם, אפשר וכדאי לזרוק מבט, כי כן מועברות שם נקודות מעניינות לפעמים).\n\nשם המתרגל/ת: שקד ליבזירר (הרצאות מוקלטות)\nחוות דעת - תרגולים: התרגולים המוקלטים של שקד נהדרים. טובים ממש, יסודיים ועוזרים גם עם הטמעה של החומר, וגם עם פיתוח צורת החשיבה כשניגשים לבעיות באינפי. מומלץ ממש.\n\nשעורי הבית: גיליון בית באינפי זה לא פשוט, אבל *מאוד* חשוב: ההטמעה הכי רצינית של החומר במהלך הסמסטר מתבצעת בעת פתרון הגליונות. רוב התרגילים מעניינים ואני נהניתי מהם, אבל זה לוקח המון זמן וחלק לא קטן מהעומס בסמסטר מגיע מכאן. מאוד ממליץ לעבוד (ולעבוד באמת! להשקיע זמן סביר, לא להתייאש אם משהו לא נפתר ביום הראשון) על תרגילים עצמאית לפני ששוקלים להתייעץ עם מישהו (או, במקרה קיצון, לרפרנס), אבל גם מאוד ממליץ לחפש רפרנסים/להשוות תשובות בסוף העבודה או, לכל הפחות, לעבור על הפיתרון הרשמי. אם הוא דומה לפתרון שלכם ומאפשר לכם לזהות שגיאות פוטנציאליות, מגניב. אם לא, ראיתם דרך אלטרנטיבית; מגניב. מגניב either way ומאוד חשוב לדעתי :)\n\nהמבחן: לא קל, אבל הוגן. עם הבנה אמיתית של החומר אפשר בהחלט להוציא ציון יפהפה.\n\nהשורה התחתונה: קורס ממש מעניין. ממליץ להגיע ב\"ראש\" הנכון: מתוך רצון להבין וללמוד, ולא לטאטא בעיות הבנתיות מתחת לשטיח; להילחם עליהן עד שהאסימון נופל. הפורום במודל לשאלות מתמטיות הוא כלי ממש חזק שאני ממליץ להשתמש בו כשיש שאלות רציניות. התרגולים וההרצאות המוקלטים של שקד ליבזירר ואביב צנזור בהתאמה מצוינים.\nהבעיה העיקרית בקורס היא שלא מקבלים פידבק *בכלל* במהלך הסמסטר (לפחות בסמסטר קורונה): מבחן האמצע הוא רק סימולציה והבדיקה של גליונות הבית מדגמית בלבד (לרוב סתם V ירוק על התרגיל הספציפי שנבדק, שלא תורם הרבה). לכן חשוב להשוות עם הפתרונות הרשמיים (הגיוני שיהיו הבדלים! בד\"כ יש כמה דרכים. אבל לראות פתרונות זה חשוב) ולהיעזר בפורום שהזכרתי.", "timestamp": 1613491544702}, {"author": "---", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה:\nאביב צנזור\n\nחוות דעת - הרצאות: \nהרצאות של צנזור ביוטיוב - הכי מובן שאינפי יכול להיות, מומלץ גם לחזרות והשלמות בנוסף להרצאות בקבוצה אחרת\n\nשם המתרגל/ת:\nאפרת אבירם\n\nחוות דעת - תרגולים: \nתותחית על\n\nשעורי הבית: \nגיליונות קשים, רוב השאלות ברמה גבוהה יותר מהמבחן\n\nהמבחן:\nקשוח", "timestamp": 1613500995247}, {"author": "GK", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: צנזור מוקלט + דאוד\nחוות דעת - הרצאות: ההרצאות המוקלטות מעבירות את החומר טוב. אני ממליץ מאד לנסות את הכיתה ההפוכה. בכיתות של צנזור היו בין 150-300 סטודנטים מה שלא נתן לכיתה ההפוכה להעביר את המהות שלה. אצל דאוד, הייתה קבוצה מצומצמת מאד של סטודנטים מה שנתן אפשרות לשאול שאלות ולהבין לעומק את מה שדאוד לימד. מה שרכשתי בכיתה ההפוכה אצלו זה לא הלמידה של המשפטים (שכן אותם אנחנו רואים לפני השיעור בהקלטות), אלא יותר דרך החשיבה המתמטית של אינפי. רוב הכיתות ההפוכות אצלו עברו בכיף ועניין. \n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מתרגלת מדהימה מומלצת בחום. עונה על כל השאלות לעניין ומעבירה את החומר במקצועיות רבה.\n\nשעורי הבית:  כדאי לנסות כמה שיותר לבד או עם חברים. להסתכל ברפרנסים לא תורם להבנה. אם לא מספיקים להגשות מומלץ לנסות להשלים בכל זאת עבור עצמך.\n\nהמבחן: לא פשוט, כדאי להתפקס על הנושאים האחרונים שלרוב תופיע שאלה מפתיעה מאחד מהם (קעירות, טיילור רציפות במש).\n\nהשורה התחתונה: קורס שמצריך עבודה רציפה וקריעת תחת לפני המבחן. עבורי זרם יותר טוב מאלגברה א", "timestamp": 1613555447692}, {"author": "amitbs77777", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר אביב צנזור\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: אירנה מתרגלת מעולה, ממליץ בחום\n\nשעורי הבית: רמת קושי לגיטימית לחלוטין אל מול חומר הקורס\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין ולא פשוט", "timestamp": 1613570686863}, {"author": "Yael", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מעולה, מסביר לאט ומובן\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מצויינת, קצב מהיר אך מובן\n\nשעורי הבית: קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: הקורס קשה, אבל אפשרי בהחלט", "timestamp": 1613594506305}, {"author": "אלון", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nהקלטות מעולות , כיתה הפוכה שימושית בתחילת הסמסטר להבנה טובה יותר של החומר , כמה שבועות לסוף הסמסטר לדעתי הכיתה הפוכה לא מוסיפה הרבה , ועדיף לראות בזמן הזה את ההרצאות המוקלטות ולתרגל לבד.\nשם המתרגל/ת: יוליה פייגין \\ רבקה אביטל\nחוות דעת - תרגולים: יוליה -תרגולים רצים מהר מאוד , מספיקים הרבה שאלות אבל תשכחו מלשאול שאלות בתרגול.\nרבקה - מתרגלת מעולה , גם אצלה מספיקים הרבה שאלות אך היא עונה לכל שאלה ומסבירה את דרך החשיבה וההגעה לפתרון.\n\nשעורי הבית: קשים , חובה לפתור כל גיליון ולשבור את הראש על כל שאלה בשביל להצליח.\n\nהמבחן: קשה , טריקי אבל בגדול הוגן.\n\nהשורה התחתונה: לתרגל.", "timestamp": 1613723240964}, {"author": "Adam Katav", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: עושים כי צריך", "timestamp": 1613890327185}, {"author": "matan solomon", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה מעולה ויודעת מתי להמשיך כדי להספיק הכל.\n\nשעורי הבית: קשים מאוד לא להתבייש לבקש עזרה, מומלץ לפתור ביחד\n\nהמבחן: קשה, ממליץ להתחיל ללמוד כמה שיותר מוקדם ולפתור מבחנים קודמים\n\nהשורה התחתונה: קורס קשה אבל חובה אז עושים, ממליץ לעשות את השיעורי בית שבוע שלומדים את החומר ככה מבינים יותר טוב ולא מצטבר עומס.", "timestamp": 1614082015950}, {"author": "A", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור - מוקלט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: רצה קצת בחומר, אבל מספיקים יותר תרגילים ככה. בכל מקרה תמיד עוצרת לשאלות ומוכנה לעבור על התרגיל כמה פעמים עד שכולם יבינו\n\nשעורי הבית: קשים, גיליון אחת לשבועיים שמורכב משני חלקים, שאלות ברמה של מבחן, מומלץ לעשות.\n\nהמבחן: הוגן, אבל עדיין קשה ממש. מלא חומר שצריך לדעת, בעיקר לפתור מבחנים קודמים ולנסות למצוא עקרונות שחוזרים על עצמם.\n\nהשורה התחתונה: קורס קשה, אבל חובה", "timestamp": 1614159625404}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: סמסטר קורונה אז ראינו את ההרצאות ביוטיוב שהן מעולות והמפגשים עצמם היו בעיקר לחידוד של נקודות חשובות בחומר והוכחות נוספות שלא נגעו בהן במוקלטות, בפועל היה די מיותר והמוקלטות הספיקו.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: סה\"כ מסבירה טוב והרבה אוהבים אותה. בעיני היא הייתה מאוד איטית והרגשתי שההספק נמוך, אבל זה מאוד אינדיבידואלי.\n\nשעורי הבית: לא קלים אבל חשוב מאוד לעשות אותם למרות שאין חובת הגשה. הם עוזרים לפתח מיומנויות של כתיבת הוכחות מתמטיות ובסופו של דבר עוזרים להצליח במבחן. ממליץ לנסות בלי רפרנסים ורק אם ממש נתקעים אז לנסות להסתכל עליהם.\n\nהמבחן: קשה אבל הוגן מאוד\n\nהשורה התחתונה: קורס מעניין בטירוף, אני מאוד נהניתי. בתחילת הסמסטר לוקח זמן עד שמתרגלים לחומר והדברים מתחילים לחלחל. חשוב מאוד לתרגל ולהבין לכל אורך הסמסטר כדי להצליח במבחן.", "timestamp": 1614190365140}, {"author": "עדן ותד", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה ומסודרת\n\nשעורי הבית: חשובים\n\nהמבחן: \n\nהשורה התחתונה: אני לא ממליצה על הכיתה ההפוכה בכלל.", "timestamp": 1614349661035}, {"author": "Gilad Freidkin", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מצויינות ומובנות\n\nשם המתרגל/ת: אור דולב\nחוות דעת - תרגולים: תותח, מסביר מובן ומסכם בצורה מסודרת\n\nשעורי הבית: קשים\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס קשה, דורש השקעה רבה ע\"מ להצליח, אבל המבחן הוגן", "timestamp": 1614422417986}, {"author": "Maya Lavi", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מוקלטות של אביב צנזור\nחוות דעת - הרצאות: מובן לגמרי, אפשר להסתדר איתן בלבד.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה היטב ומובנת. הייתי אצלה גם באלגברה והיא פשוט תותחית. לא רצה מהר מדי, ועדיין מספיקה לכסות את כל החומר ושאשכרה תבין אותו.\n\nשעורי הבית: אחת לשבועיים (בערך), לוקחים זמן. ברמה יותר גבוהה מהמבחן אז לא להילחץ. אין חובת הגשה אבל מומלץ להגיש למטרות פידבק.\n\nהמבחן: הוגן. משקף את מה שלמדת- לא פחות ולא יותר. \n\nהשורה התחתונה: הבום של המקצוע הוא בהתחלה, אבל לאט לאט מתרגלים לרמה, לקצב, ועם הבנה של החומר והדרישות לו, ותרגול מספיק- אפשר להוציא ציון לא רע בכלל.", "timestamp": 1614941940597}, {"author": "ש", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  צנזור האיש והאגדה\nחוות דעת - הרצאות: מעניין אבל מאוד לא טריוויאלי- לוקח זמן עד שנופל האסימון אז לא לדאוג שלא מבינים מה הולך בהתחלה:)\n\nשם המתרגל/ת:  אפרת\nחוות דעת - תרגולים: הכי טובה שיש!\n\nשעורי הבית: קשים ממש, אני עבדתי עם רפרנסים כי בלעדיהם לא הייתי מצליחה לפתור\n\nהמבחן: קשה", "timestamp": 1615059098374}, {"author": "ruben fitoussi", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב\nחוות דעת - הרצאות: קשה\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: טוב\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קשה אבל טוב", "timestamp": 1615193800517}, {"author": "harel yamin", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור מוקלט\nחוות דעת - הרצאות: \nההרצאות מצויינות, חייב על פי 2\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: \nמסבירה מצויין, מומלץ מאוד. היה מאוד נחמד והיא גם מאוד ניסתה לעזור ולתת עצות\nשעורי הבית: \nהגיליונות לא היו קשים מדי וגם הוובוורקים, 25 אחוזי מגן קלים.\nהמבחן: \nגם מועד א וגם ב לא היו קשים מדי, סך הכל צריך להיות חדים על החומר והמבחן לא בעיה.\nהשורה התחתונה: קורס מאוד מעניין וכיפי.", "timestamp": 1615232234746}, {"author": "סטודנט שעבר את זה", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הרצאות מוקלטות מעולות, שיעורים הפוכים שלו לרוב טובים, לפעמים קצת מרוחים והוא נותן ליותר מדי אנשים להשתתף, אבל בסך הכל ממליץ לא לפספס.\n\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה בצורה ברורה כך שתצא מהשיעור עם הבנה טובה יותר של החומר. אם תצטרך עוד הסברים בכיף היא תסביר לך בהפסקה ובשעת הקבלה. ממליץ בחום עליה.\n\nשעורי הבית: מתפרסם חלק אחד של גיליון אחת לשבוע, ואת 2 החלקים מגישים בערך שבועיים אחרי פרסום החלק הראשון. לנסות בהתחלה לפתור את הגיליות בצורה עצמאית לחלוטין ולא להסתכל ברפרנסים. כשמתחיל להצטבר עומס, אין אפשרות להקדיש לכל תרגיל באמת כמה שעות עד שתבין לבד, ולכן זה בסדר להיעזר ברפרנסים, במידה מינימלית. עדיף להתייעץ עם אחרים. אם מסדרים את הזמן בצורה יעילה, לא תהיו לחוצים מבחינת הגשות ותוכלו להגיש אותם אפילו כמה ימים לפני מועד ההגשה. \n\nהמבחן: מועד א היה מאוד הוגן בעיניי, מי שפתר הרבה מבחנים ובאמת הבין את מה שהוא פתר, יכל להוציא ציון גבוה (מעל 70).\nחייב להקדיש לקראת המבחן הרבה מאוד שעות, מעייף אבל אין מה לעשות - זה משתלם בסוף. נושאים שלא ברורים ללכת לשאול בשעת קבלה או את החברים שמבינים, לא להשאיר בראש כי בסוף מתבלבלים ואז המבחן יילך פחות טוב\n\nהשורה התחתונה: קורס עמוס, אבל עם ניצול זמן יעיל מסתדרים.", "timestamp": 1615448195725}, {"author": "רועי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ההרצאות ביוטיוב מצוינות, לדעתי מספיק ללמוד משם את החומר.\n\nהכיתה ההפוכה שלו היא הדבר הכי מיותר שיצא לי להשתתף בו, 0 קשר לחומר הנלמד, לא רלוונטי ומרגיש יותר העשרה מאשר מלמד. אם אתם אוהבים לקום ב8 וחצי בבוקר ולשמוע את צנזור עופו על זה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מושלמת, אין עלייה באמת, תותחית שאוהבת את העבודה שלה ורוצה שתדעו הכי טוב.\nלדעתי כדאי לחזק עם עוד שעה של תרגול אצל מתרגל אחר.\n\nשעורי הבית: קשים מאוד, לדעתי אפילו קשים מידי, רמת המבחן לא מדגדגת את הגליונות, ממליץ לנסות לפתור לבד ותוך 30 דקות להתייאש וללמוד מהרפרנס.\n\nהמבחן: מועד א קל באופן ביזארי. מועד ב שמעתי שגיהנום.\n\nהשורה התחתונה: קורס מאוד מעניין, פותח את עולם המתמטיקה, חשוב לנסות לא להבלע בעומס ולא להתעכב מאחור.", "timestamp": 1615462571891}, {"author": "אביתר כהן", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  אפרת אבירם\nחוות דעת - תרגולים:  מאוד נהנתי מהתרגולים איתה, מאוד מומלצת, רק משהו אחד בעייתי זה שהיא נותנת לקטוע אותה הרבה וזה לפעמים מוציא מריכוז\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615722253126}, {"author": "ארבל", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב\nחוות דעת - הרצאות: מוקלטות + הפוכות\nהפוכות - כרגע אני חושב שהם גדולות מכדי באמת להיות רלוונטיות, כנראה שעדיף ללכת לתרגולים שקורים באותו הזמן כי הם נוטים להיות ריקים יותר.\n\nשם המתרגל/ת: אפרת!\nחוות דעת - תרגולים: אין על אפרת\n\nשעורי הבית: חשוב לעשות, מאוד מאוד מועיל להבנה ולהטמעה של החומר. לוקח בערך מליון שנה\n\nהמבחן: קשוח\n\nהשורה התחתונה: אתם לא פה אם יש לכם ברירה..", "timestamp": 1615798705633}, {"author": "-------", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: ד״ר אביב צנזור\nאישית, בחצי הראשון מהסמסטר ציפיתי במוקלט ביוטיוב וגם השתתפתי בכיתה הפוכה שזה דחף אותי קדימה בסדרות, אביב באמת עשה עבודה נהדרת בכיתה הפוכה בנושא סדרות ונתן תרגולים ושיטות הוכחה ופתרון שימושיים מאוד, בתור סטודנט שהתקשה באינפי בהתחלה, זה היה ה- push. בחצי השני הסתפקתי בלצפות בהרצאות המוקלטות ביוטיוב בגלל בעיית זמן בסמסטר, אבל בנגד להרבה אנשים, הכיתה ההפוכה שלו עזרה לי מאוד, אז לדעתי אל תפספסו.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nסדרות- אפרת אבירם : אפרת מתרגלת נחמדה ומשתפת את הסטודנטים בפתרון התרגילים והיא סבלנית מאוד ואכפת לה שהסטודנטים יבינו. אולי החסרון היחיד הוא שאפרת נותנת לכולם לשאול כל הזמן, שזה לפעמים קוטע את הריכוז שלנו בתרגול ומונע אותה מלהתקדם בחומר. לכן עברתי לרבקה.\nפונקציות- רבקה אביטל: \nציפיתי בתרגולים שלה בנושא פונקציות, המתרגלת מדהימה ומי שלא מצפה בתרגולים שלה בפונקציות הוא יפספס תרגילים חשובים מאוד וברמת בחינה סופית. הקצב של רבקה קצת יותר מהיר משאר המתרגלים, אבל זה נותן לה לתרגל יותר חומר ויותר שאלות בנושאים הכי חשובים בקורס. לסיכום, ממליץ מאוד מאוד לצפות בתרגולים שלה.\n\nשעורי הבית:\n תרגילי הבית דומים מאוד ברמה לשאלות המבחנים (לפעמים יש כמה שאלות יותר קשות) והם דורשים זמן יקר, אבל בסוף זה משתלם כי ההשקעה שלכם בשיעורי הבית (וכמובן בפתרון מבחנים לקראת המבחן הסופי) משקפת איך תפתרו את המבחן הסופי שלכם.\n\nהמבחן:\n המבחן שלנו הוגן מאוד. \nאבל, יש כמה מבחנים או שאלות ממבחנים כמעט בלתי פתירים ומאתגרים, לכן צריך לזהר ולעבוד ברצינות וברציפות.\nהשורה התחתונה:\n יש לי שני טיפים לאלה שרוצים ציון גבוה 85+ :\n1- לעבוד קשה על תרגילי הבית, אפשר לשתף רעיונות עם חברים או אנשים, אבל בסוף צריך לפתור באופן עצמי ולשבור את הראש כי זה המרכיב הכי חשוב בהבנת החומר. זה חובה ללכלך את הידיים באינפי, ולא מספיק רק להבין את החומר.\n2- לחזור ולנסות לפתור שוב מה רבקה פותרת בתרגולים שלה כי התרגולים שלה בפונקציות נהדרים וברמת המבחן הסופי.", "timestamp": 1615834022218}, {"author": "ל", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור/מיכל קלינשטרן\nחוות דעת - הרצאות: עקב סמסטר קורונה כולם צפו בהרצאות המוקלטות של צנזור שהן כמובן מעולות, וכיתה הפוכה אצל מיכל שהיא מרצה נהדרת.\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: מתרגלת טובה שמתאימה למי ששולט (או לפחות מתיימר להיות) בחומר. למי שכזה - היא מצויינת וההספק מאוד גבוה, אך כאמור כמעט ולא עונה על שאלות ולמי שמתקשה מומלץ לבחור מתרגל אחר.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מומלץ בחום להוכיח את המשפטים מההרצאות ולהיות על החומר מההתחלה, זו הדרך להצליח באינפי.", "timestamp": 1615837033314}, {"author": "אסמא", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: צנזור-מוקלט\nחוות דעת - הרצאות: בגלל שהיה סמסטר קורונה,השיעורים נערכו במתקונת כיתה הפוכה,לא הייתי באף דיון והסתפקתי במוקלט ולדעתי היה מספיק\n\nשם המתרגל/ת: שקד ליבזירר\nחוות דעת - תרגולים: גם הסתפקתי בתרגולים המוקלטים מסמסטר הקיץ ולדעתי שקד עובר על כל התרגילים החשובים ואלה שיש טריק או עיקר שצריך לדעת,מסביר בצורה מאוד ברורה ובגלל שזה היה מוקלט מראש אין שאלות מסטודנטים וכו אז היה ישר לעניין,קצר וברור \n\nשעורי הבית:  גליונות לדעתי היו ברמה קצת מעל המבחן אבל חשובים מאוד להטעמת החומר ולתרגלו,עדיף לנסות ולפתור לבד ולהיעזר בחברים רק במידת הצורך\nקצת עמוסים אבל שווה לפתר\n\nהמבחן: היה מאוד הוגן,מכסה את החומר שנחמד אין אף שאלה שהייתה מוגזמת או בלתי הגיונית\n\nהשורה התחתונה: קורס שדורש השקעה במהלך כל הסמסטר,לשאול תמיד אם יש משהו שלא מובן  ולפתור תרגילים ללא רפרנס,לקראת הבמחן לפתור המון מבחנים ויהיה בסדר", "timestamp": 1615882930657}, {"author": "א.ק.", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ההרצאות המוקלטות ביוטיוב מעולות, ובשעות המיועדות להרצאה הייתה כיתה הפוכה שבה היה מדייק וחוזר על דברים.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מתרגלת (ומרצה) מעולה\n\nשעורי הבית: גיליונות webwork - בערך פעם בשבוע, חשובים ולא קשים יותר מידי, מוסיף נקודות מגן.\nהגשות פתוחות - פעם בשבועיים או שלושה,  נבדקת שאלה אחת מכל גיליון בלי ציון. במבחן הסופי יש שאלה מתוך שיעורי הבית שנותנת עוד אחוזי מגן.\n\nהמבחן: קשה מאוד. דורשים רמת דיוק הזוייה, הבדיקה קפדנית מאוד.\n\nהשורה התחתונה: קורס מורכב ולא פשוט בכלל, כדאי להתאמץ ולהגיש גם את הגיליונות הפתוחים במהלך הסמסטר למרות העומס הכללי כי זה דבר שיכול לעזור מאוד במוכנות למבחן עצמו.", "timestamp": 1615993292447}, {"author": "Mattan Hoory", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nמרצה מהחריפים שהיו, שאיפה בלתי מתפשרת למצויינות. \nההרצאות המוקלטות שלו ביוטיוב מושלמות. הוא לוקח אתכם יד ביד לעבר העולם המתמטי של האקדמיה. \nההרצאות ההפוכות שלו היו נחמדות, לא מאוד cost-effective כי 5-10 תלמידים משתתפים והשאר צופים.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים:  רבקה מעולה, פותרת שאלות ממבחנים ומכניסה אותך ממש לראש הנכון כדי להביס את המבחן באינפי.\nכדאי!\n\nשעורי הבית: \nשיעורי הבית פשוט ארוכים בצורה לא סבירה, שאלות ברמת קושי גדולה מאוד ביחס למבחן. חלק מהשאלות עלולות לקחת יותר משעתיים ולפעמים גם אז צריך להיעזר במישהו.\nממליץ לא לזרוק את כל הזמן הפנוי שלכם על הגליונות בסמסטר א' שהוא גם ככה קשה. לכו לשעות קבלה או התייעצו עם החברים.\nיש משמעות גדולה ללפתור שאלות ולנסות להתמודד איתן, ויש גם שאלה משיעורי הבית במבחן. אבל הרבה יותר חשוב להבין את החומר ולתרגל שאלות שפויות ברמת המבחנים מאשר לזרוק 12+ שעות על כל גליון.\n\nהמבחן: \nפיר מאוד. כל השאלות ברובן הגיוניות ודורשות הבנה עמוקה של החומר - לא יותר, ולא פחות.\n\nהשורה התחתונה: \nקורס מאתגר, ידרוש את כל מה שיש לכם, ומתגמל למי שמשקיע בו בצורה הנכונה.", "timestamp": 1616012278130}, {"author": "דורימון", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור ומיכל קליינשטרן\nחוות דעת - הרצאות: הרצאות מוקלטות של צנזור מעולות, מאד ברורות וכיתה הפוכה של מיכל מצוינת. מיכל נעימה ומסבירה טוב ומאד עוזרת להבין את החומר לעומק. \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מסבירה סביר, לא תמיד ברור, לא כל כך נעים לשאול שאלות בשיעור. \n\nשעורי הבית: קשים אך פתירים. דורשים זמן והשקעה מהרגע הראשון. חשוב להשקיע בלנסות לפתור את הגיליונות בית הפתוחים לבד, זה מתסכל אבל מאד עוזר להבין את החומר. \n\nהמבחן: קשה, נתפסים לקטנות בהורדת ניקוד אבל השאלות עצמן הוגנות. \n\nהשורה התחתונה: קורס מעניין שכיף ללמוד, נדרשת השקעה כדי להצליח בו", "timestamp": 1616242059156}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: למדתי הכל מהמוקלטות, איכות קצת נמוכה אבל צנזור מסביר ברמה גבוהה. ההרצאות ההפוכות לדעתי מיותרות ולא תרמו ללמידה. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מדהימה. עונה על שאלות, לא מסבירה מהר מדי, ורואים שאכפת לה מהסטודנטים. \n\nשעורי הבית: \nדורשים זמן והשקעה. בהתחלה הם לא יהיו מובנים אבל זה ישתפר עם הזמן\nהמבחן: \nמבחו לא קל, וכדאי לתרגל הרבה מבחנים לקראת המבחן עצמו כדי להבין את כל השיטות שבהם צריך להשתמש. ממליצה להגיע לשעות קבלה, ולא להתייאש. \nהשורה התחתונה: \nקורס קשה, שדורש השקעה וזמן, אבל אפשר לעבור אותו.", "timestamp": 1616664113471}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מעולה, כיתה הפוכה רעיון גאוני \n\nשם המתרגל/ת: שקד בדר\nחוות דעת - תרגולים: ממש טובה\n\nשעורי הבית: יחסית סבב הלפעמים לשבור את הראש.\n\nהמבחן: לחזור על הרצאות לקרוא הוכחות ולהבין ואז לתרגל מלא סימלוציות ואפשרי לגמרי להוציא ציון טוב\n\nהשורה התחתונה: היה סבבה", "timestamp": 1617573400749}, {"author": "Elad Gross", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: כיתה הפוכה זה רעיון מעולה\n\nשם המתרגל/ת: שקד בדר \nחוות דעת - תרגולים: אחלה תרגולים\n\nשעורי הבית: קצת עמוס ולפעמים צריך לשבור את הראש אבל פתיר\n\nהמבחן: היה בסדר גמור\n\nהשורה התחתונה: חשוב לחזור על ההרצאות ועל ההוכחות לאורך כל הסמסטר ובמיוחד לקראת המבחן", "timestamp": 1617603675313}, {"author": "OG", "difficultyRank": 4, "generalRank": 5, "semester": "201903", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nהייתה כיתה הפוכה, בזום הוא תרגל שאלות ועבר על משפטים רוב הזמן\n\nשם המתרגל/ת: אור דולב\nחוות דעת - תרגולים:\nאחלה תרגולים, הם היו בזום לכן הוא הקליד אותם \n\nשעורי הבית: \nנחמדים, בגלל שזה היה בקיץ היו מאוד צפופים.\nהמבחן: \nשמעתי הרבה תלונות עליו אבל היה כנראה את המבחן הכי קל שהיה לאינפי 1מ הרבה זמן\nהשורה התחתונה: \nאין הרבה בחירה בין אם לעשות או לא לעשות אבל ממליץ לעשות בקיץ לפני תחילת סמסטר ראשון אם יש אופציה כי זה יכול להקל עליו מאוד", "timestamp": 1622584951746}, {"author": "לידור זינו", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה, מסבירה מעל ומעבר\n\nשם המתרגל/ת: אלכסנדרה (סשה) בקמן\nחוות דעת - תרגולים: רודפת אחרי הזמן בתרגולים, לפעמים קשה להבין מה היא מעבירה. אבל יכולת הסברה טובה בסהכ.\n\nשעורי הבית: קשים מאוד\n\nהמבחן: קשה מאוד מאוד, בפעם הראשונה שחנה מרצה אראית והממוצע אצלנו בסופי מועד א 62, יותר נמוך מרוב הסמסטרים האחרונים\n\nהשורה התחתונה: מרצה ומתרגלת טובים, תלמדו למבחן. אל תיקחו אם לא חייבים.", "timestamp": 1626802117404}, {"author": "catto", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: העדפתי לצפות בפלייליסט ביוטיוב; ואלו באמת הרצאות מצויינות, מלאות בהסברים בהירים ואינטואיציה למה שעומד מאחורי הנוסחאות וההגדרות על הלוח.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: טל מתרגל מעולה. תמיד עוצר לשאול אם יש שאלות, הסברים מאוד בהירים וברורים, מדגים טכניקות שחוזרות על עצמן הרבה במבחן, ומקדיש הרבה זמן לסטודנטים שלו. ביום שלפני המבחן הוא נשאר לתרגל 3 שעות בשעת קבלה שיועדה להיות 50 דקות.\n\nשעורי הבית: קשים, במיוחד כשעוברים לפונקציות, אבל אפשריים.\n\nהמבחן: קשה. ממליץ מאוד לטחון כמה שיותר מבחני עבר. בגלל שצנזור מרצה של הקורס כבר שנים, בעזרת תרגול של מספיק מבחנים אפשר לראות על מה הוא אוהב לשאול ומה פחות מוזכר.\n\nהשורה התחתונה: קורס קשוח, אבל מאוד מעניין.", "timestamp": 1627119779766}, {"author": "Unkown", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ראיתי את המוקלט ביוטיוב, לפעמים נכנסתי ללייב בזום ואביב צנזור פשוט אחד האנשים הפחות נחמדים שיצא לי להתקל בחיים. חושב שהשמש זורחת לו מהת** וכולנו מאוד נחותים לידו. \n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: פשוט מדהימה, עונה על כל שאלה, מספיקה כמות מכובדת של תרגילים ומעבירה הכל באופן מובן \n\nשעורי הבית: היה רק ww בתור שיעורי בית תקפים, הגליונות לא היו להגשה והיו גם בחני סימולציה (ללא ציון) פעם בשבוע\n\nהמבחן: קשה בצורה לא הגיונית. בתור מישהו שפתר את רוב המבחנים במודל, יכול להגיד שזה באמת היה מבחן קשה .\n\nהשורה התחתונה: תחרשו, קורס חובה ואין איך לברוח", "timestamp": 1627123915866}, {"author": "r", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיכל קליירשטיין\nחוות דעת - הרצאות: קצת מבולגנת על הלוח, אבל מסבירה בצורה מאוד ברורה את החומר, תמיד שמחה לענות על שאלות , ולא משאירה אותך עם קצוות משוחררים לקראת הבחינה.\nממליץ בחום!\n\nשם המתרגל/ת: אחסן\nחוות דעת - תרגולים: מתרגל טוב, מעביר בצורה טובה את החומר , מאוד מסודר על הלוח ונותן מקום לכיתה להשתתף ובכך מייצר שיעור אקטיבי יותר שזה נהדר!\n\nשעורי הבית: לא היה\n\nהמבחן:\n\nהשורה התחתונה:", "timestamp": 1627130685198}, {"author": "pedro", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מסביר מעולה , שווה לתפוס מקום בכיתה שלו\n\nשם המתרגל/ת: יוליה \nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון. \nמסבירה מעולה , לא מבזבזת זמן , נותנת תרגילים קשים ומכינה את הכיתה שלה בצורה הכי טובה שאפשר לבחינה.\n\nשעורי הבית: לעשות את הגליונות , אין סיכוי להצליח בלי זה\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: עושים כי חייב. אבל גם מעניין", "timestamp": 1627549754879}, {"author": "Crack", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אחלה מרצה. רוב הסמסטר הגעתי להרצאות שהתקיימו live. רוב ההרצאות היו דומות למה שנמצא ביוטיוב אבל לפעמים הוא מחליט לגוון בדרך ההוכחה של משפטים מסוימים בצורה שיותר קל להבין מאשר מה שקיים ביוטיוב.\nהיו גם כיתות הפוכות פעמיים או שלוש ואני באופן אישי אהבתי והרגשתי שזה כן מועיל לתהליך הלמידה שלי.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: סה\"כ בסדר אבל ההרגשה שאני יצאתי ממנה היא שכל התרגילים שעושים בסופו של דבר לא ממש דומים לסגנון התרגילים במבחן הסופי. לא יודע אם זה ככה אצל עוד מתרגלים, אבל בכל אופן פחות התחברתי להוראה שהרגישה לי מונוטונית מדי\n\nשעורי הבית: כמה רמות מעל הרמה של המבחן, אבל לפחות לא הייתה חובת הגשה. הם לוקחים זמן, אבל אין מה להרגיש רע אם לא מצליחים, זה רגיל :)\n\nהמבחן: מבחן קשה. צריך להתאמץ כדי להגיש ציון טוב.\n\nהשורה התחתונה: העומס בקורס לא גדול מדי, אבל חשוב לא לעזוב את החומר ליותר מדי זמן, כי אז עלולים לשכוח ויהיה קשה להיזכר בו כמו שצריך לקראת המבחן.\nבכל מקרה זה קורס חובה אז אין יותר מדי מה לעשות :)", "timestamp": 1627554653431}, {"author": "חראבו דראב", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  אביב צנזור \nחוות דעת - הרצאות: הוא מרצה סביר ותו לא .\nהרעיון הוא כזה. במהלך ההרצאה אתה תחשוב שאתה מבין את החומר ,ואז בשיעורי בית תבין שלא הבנת כלום . ולכן אני חשוב שעדיף ללכת לכל מרצה אחר, בכללי עדיף להתרחק מהמרצים המפורסמים כי כולם ילכו אליהם ולא יהיה מקום לנשום שלא לדבר על לשאול שאלות . \n\nשם המתרגל/ת: אחסן \nחוות דעת - תרגולים: המתרגל הכי טוב בפער.... \nאם צנזור גורם לך לחשוב שאתה מבין את החומר, אחסן גורם לך באמת להבין.\n\nשעורי הבית: \nמציק כבד ולא באמת מלמד\nהמבחן: \nלא קשור למטלות בית, פרט לשאלת שיעורי הבית הרמה של שאלות המבחן יותר נמוכה מגליונות הבית.\nהשורה התחתונה: זה קורס חובה. המטרה שלו היא קודם כל למיין ולסנן סטודנטים, ברמת הפרקטיקה הוא לא עשה כלום חוץ מלפגוע ברצון שלי ללמוד מתמטיקה באופן מעמיק יותר. ממליץ בחום לעבור על קורסים של לוגיקה ובדידה , ולחפש אולי קורסי הכנה למתמטיקה לפני כי הם יעשו לכם חיים קלים יחסית בלהבין את הרעיונות היותר כללים של הקורס .בכל מקרה זה קרוס שעוברים אותו ולא מסתכלים עליו (גם לא ברעיונות עבודה וכל מי שאומר אחרת חרטטן....) . הציון לא משקף כלום חוץ מאת מצב הרוח של הבודק באותו יום ,את היכולת שלך לפלצף בצורה שנלמדה בקורס ותו לא .", "timestamp": 1629014317901}, {"author": "גיבור הים", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות:\nפחות התרגלתי לאופן שבו הוא מעביר את ההרצאות בלייב.\nאביב מעביר את החומר בצורה מעולה, אבל האווירה קצת מתוחה מדי לטעמי ולא הרגשתי בנוח להיות פעיל בשיעורים.\nלכן צפיתי בהקלטות של אביב ביוטיוב ואני יכול להגיד שהן פשוט מעולות.\nלא הרגשתי צורך לנכוח בשיעורים עצמם.\n\nשם המתרגל/ת: טל בן‎‏־יהודה\nחוות דעת - תרגולים: \nטל מתרגל פשוט נהדר.\nמסביר את החומר לפרטי פרטים ולא מפספס שום פינה, גם אם זה אומר להתעכב על החומר ולא בהכרח ״לרוץ״ כמו מתרגלים אחרים.\nמנסה לעזור לסטודנטים שלו בכל דרך אפשרית: בין אם אלו שעות השלמה, קבוצת וואטסאפ לתמיכה או סיכומים שהוא מקליד בוורד ומעלה לדרייב.\nהיה מאריך שעות קבלה מעבר לזמן עד אחרון השאלות כדי לעזור לכל הסטודנטים שהגיעו.\n\nאם התמזל מזלכם וטל בן־יהודה מתרגל כשאתם לוקחים את הקורס - נא לא להתלבט. \n\nשעורי הבית: גליונות קשים מאוד ואין להם קשר מידתי לרמת המבחנים, לפחות ברוב השאלות, לדעתי זה לא דבר רע.\nהם כוללים כל מיני בעיות טריקיות שבוחנות בצורה מאוד נוקשה את ההבנה של התיאוריה.\nשימו לב שנכון לאביב 2021 אין חובת הגשה לגליונות.\n\nה־WW הם בדיחה למי שמקשיב בשיעורים.\n\nהמבחן:\nבמבחן היו 3 שאלות מאוד פשוטות ששיקפו בדיוק את החומר כפי שנלמד בכיתה.\nשאלה 3 סעיף א׳ במועד א׳ הייתה קשה בצורה יוצאת דופן.\nתתכוננו שצנזור ינסח לפחות סעיף אחד בבחינה שיהיה כמעט בלתי פתיר למי שלא מאוד חד על החומר.\n\nשאלות צנזור מרגישות כמו פסיכומטרי ודורשות אינטואיציה.\n\nהשורה התחתונה: קורס מאוד לא קל, אבל בסופו של דבר חייבים לעשות אותו.\nLive long and prosper.", "timestamp": 1634023504089}, {"author": "Gil Shahar", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אחד לאחד מה שיש בהקלטות ביוטיוב, מובן ומסודר ואם צריך אפשר להשלים מהיוטיוב\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: נהנתי מאוד מהתרגולים של טל, הקבוצה היתה קטנה והיה יחס אישי לכל אחד. טל כותב בכתב יד במחשב ומעלה הכל לone drive אחרי התרגולים\nבנוסף לתרגולים הרשמיים טל הוסיף לנו שעות תרגול כל שבוע ולפני הבוחן אמצע אפילו ישב איתנו בזום ביום שבת כל הצהריים בשביל שנחזור על החומר.\n\nשעורי הבית: לא פרופורציונאלים\n\nהמבחן: נחמד\n\nהשורה התחתונה: קחו את הקורס ברצינות, חשוב לפתור מבחנים קודמים במשך לפחות שבוע - שבוע וחצי לפני הבחינה", "timestamp": 1634541054411}, {"author": ":|", "difficultyRank": 2, "generalRank": 3, "semester": "202003", "text": "שם המרצה: דר אלון דמיטריוק\n\nחוות דעת - הרצאות: \nמרצה שונה מצנזור פעם ראשונה בשנים האחרונות\nדגשים מעט שונים, ומעביר אחרת קצת את החומר.\nבגדול אותו חומר שניתן ע\"י צנזור ביוטיוב או אינפי 1מ מקורסים קודמים.\n\nשם המתרגל/ת: שקד לייבזנר\nמתרגל מנוסה מאוד באינפי 1מ\n\nחוות דעת - תרגולים: \nמעביר טוב את החומר\n\nשעורי הבית: \n11 מתוך 13 וובוורקים\n5 מתוך 6 גיליונות\nיחד מהווים 20% מגן\nללא בחן אמצע כי קורס קיץ\n\n\nהמבחן: \n10 שאלות פתוחות, בניגוד למבנה של 5 שאלות של צנזור\nלא היה ניקוד ליד השאלות\nהשורה התחתונה: \n\nלא מומלץ לקחת אינפי בקיץ כדי לשפר. \nעמוס מאוד בקיץ - שני עד חמישי שעתיים הרצאה ושני עד רביעי שעתיים תרגול\nמאוד דחוס, קשה לשלב יחד עם מועדי ב", "timestamp": 1634892991393}, {"author": "שמואל דב בער", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nצנזור מוקלט- חוזר על הקורס, הגעתי למסקנה שאלה ההרצאות הכי יסודיות ותמיד הצלחתי למצוא הסבר לנק' הלא מובנות בחומר. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאישית הסתפקתי בהרצאות\nשעורי הבית: \nחשוב לעשות, לרוב יש 2 תרגילים בלבד מהגיליון שבאמת רלוונטיים ואולי יופיעו במבחן\nהמבחן: \nמבחן לא פשוט בכלל, הסמסטר המרצה נתן מבחנים לא סטנדרטיים בהשוואה לשנים קודמות. חשוב לעבור על כמה שיותר סגנוני שאלה.\nהשורה התחתונה: \nקורס מאוד מעניין, חשוב לקחת אותו ברצינות מההתחלה. אם לוקחים אותו בשאנטי, מגיעים לתקופת מבחנים ולא מבינים מימין ומשמאל.", "timestamp": 1635685852422}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202003", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: המרצה הכי גרוע בטכניון בלי מתחרים... רשע, נקמן, לא משחרר ציונים בזמן ולא אכפת לו בכלל. פשוט ביזיון שהפקולטה למתמטיקה מעסיקה בן אדם כזה.\n\nשם המתרגל/ת: שקד\nחוות דעת - תרגולים: לא ראיתי לא יודע לומר\n\nשעורי הבית: קשים\n\nהמבחן: אלון פשוט שינה את המבחן והיו לנו 10 שאלות... שזה שונה מלעשות 5 עם שני סעיפים כל אחת, בקיצור הוא בא ברע וניסה לדפוק אותנו כמה שיותר, לא קיבלנו עדיין ציונים אבל מאמין שהוא הצליח במשימה\n\nהשורה התחתונה: להזהר מאלון, להתרחק כמו מאש מקורסים איתו, זוועת עולם של מרצה.", "timestamp": 1635770831242}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202003", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: אווירה לא טובה בשיעורים, באופן כללי לא סובל סטודנטים, וזה ניכר גם במבחן הבלתי אפשרי שהוא נתן (ממוצע 38!!!!), מתייחס בזלזול לשאלות.\n\nשם המתרגל/ת: שקד ליבזרר\nחוות דעת - תרגולים: לא הייתי ולכן לא רלוונטי\n\nשעורי הבית: לא קרובים לרמה הכללית של הקורס\n\nהמבחן: מבחן בלתי אפשרי, שינה את מבנה המבחן בלי להודיע מראש מ5 שאלות עם שני סעיפים כל אחת שקשורים אחד לשני ל10 שאלות שונות לחלוטין, הרמה של השאלות לא נראתה בתרגולים או בתרגילי הבית, לא ברור איך סטודנט פשוט אמור היה ללמוד לדבר הזה ולהצליח.\n\nהשורה התחתונה: אם אלון מרצה לא להתקרב", "timestamp": 1635783625496}, {"author": "שון", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות:  מוקלט של צנזור ביוטיוב, מסביר מעולה\n\nשם המתרגל/ת: אחסאן עבד-אל פתח\nחוות דעת - תרגולים: אחסאן היה מתרגל מעולה, הוא מוביל את הסטודנטים לפתרון ומשתדל לפשט את הדברים.\nלא רץ מהר מדי על החומר.\n\nשעורי הבית: וובוורקים היו סבבה, לא רמה גבוהה מדי.\nהגליונות לא היו חובה להגשה אז הפסקתי באמצע הסמסטר עקב עומס, הגליונות קשים בפער ענק מהוובוורק ולוקחים הרבה זמן, אך תורמים להבנה עמוקה של החומר, לא לפחד לרפרנס ולא לבזבז יותר מדי זמן על שאלה, להמשיך הלאה.\n\nהמבחן: המבחן היה קשה ממש כצפוי לצנזור, אין יותר מדי מה להגיד\n\nהשורה התחתונה:  :(", "timestamp": 1636382589229}, {"author": "טכניוניסט", "difficultyRank": 4, "generalRank": 3, "semester": "202003", "text": "שם המרצה: צנזור ואלון (חזרתי על הקורס) \nחוות דעת - הרצאות: \nהקורס הזה זה הוא קורס ניפוי, תתרגלו. הקשר בינו להבנה מתמטית הוא מקרי בהרבה מהמקרים. מה שקורה הוא שמטביעים אתכם בכמויות של מידע (משפטים, הוכחות איזוטוריות למשפטים וטריקים לפתירה של שאלות). תנסו להוציא את המיטב מהפעם הראשונה שאתם עושים את הקורס, מקסימום תחזרו על הקורס ותוכלו יותר בשפיות לספוג את האינציקלופדיה שמנסים לגרום לכם לשנן.\nאל תתייאשו מהקורס הזה ומרמת ההוראה שלו, המטרה שלו הוא לייאש, תחשבו שאתם תקבלו על לעבור על הקורס הזה מיליונים של שקלים כי בסוף התואר אתם באמת תרוויחו כזו כמות וצריך לשמור על השוק מאינפלציה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: (יש הרבה שהם סבבה)\nעוזרים לכם להבין איך פותרים תרגילים ואת אינציקלופדיית הטריקים שצריך לשנן כדי לפתור אותם.\n\nשעורי הבית: שווה לשבור עליהם הראש, הם יאפשרו לכם להתאמן על היצירתיות שנדרשת כדי לפתור תרגילים באינפי.\n\nהמבחן: יש במועדי ב' של צנזור שאלת שינון - שפשוט הוא בוחר משפט שרירותי ואומר תרשמו את ההוכחה - 20 נק' על מבחן בהיסטורית המתמטיקה ושינון. בשאלה אחרת יש שאלה מהשיעורי בית - שאתם צריכים לשנן את דרך ההוכחה שלה. ואז יש כל מיני שאלות יותר רגילות ואולי איזו אחת עם דוגמא ממש איזוטרית לפונקציה שעונה על דרישות מאוד ספציפיות. המטרה של המבחן לשמור על ממוצע 60 פחות או יותר. תנסו לרכב על העקומה ולהוציא ציון גבוה יותר מהממוצע.\n\nהשורה התחתונה: \nברגע שתעברו את הקורס הזה, והקורס הבא אחריו (שהוא גם בא לייאש אבל ב-50% הנחה מהקורס הראשון) אנחת הרווחה תשמע בכל רחבי חיפה והקריות. בהצלחה חברים.", "timestamp": 1637533783792}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: בדיוק כמו ביוטיוב לא חובה ללכת לראות, למרות שזה נחמד זה כמו ללכת לראות סרט\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: מלך אין עליו, מסביר אינטואיטיבית וברור וממש נותן את הזמן שלו בשביל התלמידים, בכלל לא מובן מאיליו\nשעורי הבית: קשים בקטע אחר, לא לקחת קשה אם לא מצליחים בכלל :)\n\nהמבחן: מטורף, בלתי אפשרי בהצלחה...\n\nהשורה התחתונה: ככל הנראה הדבר הכי קשה שתעשו לימודית עד כה", "timestamp": 1644086924119}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: \nלדעתי ההקלטות עדיפות על הרצאות פרונטליות. ההרצאות הפרונטליות הן בדיוק כמו המוקלטות רק שבמוקלטות אתם יכולים לעצור ולחזור שוב על החומר (וזה ייתרון משמעותי).\n\nשם המתרגל/ת: אפרת אבירם / טל בן יהודה -מוקלט\nחוות דעת - תרגולים: \nאפרת טובה מאוד, ההסברים שלה מובנים ומסודרים, אחת השאלות מהתרגולים הופיעה בצורה מאוד מאוד דומה במבחן.\nצפיתי גם בהרצאות המוקלטות של טל בן יהודה (וקראתי את הPDF של סיכומי התרגולים שלו), טל מקסים, עובר ביסודיות על החומר ומביא הרבה טיפים מאוד טובים שעזרו לי במבחן. \nממליצה על שניהם - אני חושבת שכל אחד מהם תרם לי מאוד להבנה של החומר.\n\nשעורי הבית: \nהגיליונות בדרך כלל מורכבים מ4 שאלות ולדעתי 2 מהן סבירות וברמה של החומר והמבחן וה2 האחרות כמעט תמיד מוגזמות יחסית אז לא לפחד אם לא מצליחים.\nלדעתי כן שווה להשקיע את הזמן במהלך הסמסטר ולפתור אותם (או לפחות להסתכל על הקווים לפתרון ולנסות להוכיח אחר כך גם בעצמכם) אבל לא להתקע על זה שעות.\nתעשו את הוובוורק, זה גם נותן קצת מגן וגם חלק מהשאלות שם מופיעות בצורה כזאת או אחרת במבחן המסכם.\n\nהמבחן: \nאני יכולה להגיד בכנות שזה עניין של מזל - יש מועדים מזעזעים ויש מועדים שהם בסך הכל בסדר.\nלדעתי מועד א' היה יחסית בסדר - היה סעיף אחד מאוד מתקיל אבל חוץ מזה מבחן דיי הוגן שמי שתרגל הרבה מבחנים ועבר ביסודיות על השאלות בגיליונות כנראה יכול לקבל בו ציון יפה (מעל 80).\n\nהשורה התחתונה: קורס קשה, ללמוד מ-0 לכתוב הוכחות פורמליות ולהתנסח בצורה \"מתמטית\" זה תהליך (קשה וארוך). חייב לתרגל לאורך הסמסטר ולהתנסות בהוכחות אחרת נופלים.", "timestamp": 1644150391734}, {"author": "ב", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: הייתי בתחילת הסמסטר בפרונטלי. לדעתי מיותר מאוד ללכת להרצאות. הוא מסביר יותר טוב ביוטיוב וחבל לא לראות אותו על 2x.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת מסבירה ממש טוב אבל קצת איטית. מומלצת מאוד בתחילת הסמסטר, כשמתחילים אינפי, עד הבוחן אמצע (סדרות). אחריו (פונקציות) מומלץ לצפות בהקלטות לקרוא סיכומים של תרגולים (לאחסאן יש אחלה סיכומים וטל בן יהודה מפרסם סיכומים מעולים ממש).\n\nשעורי הבית:  יש גיליונות לא להגשה. מומלץ ממש לנסות ולפתור. משפר מאוד ועוזר ליישם את החומר. בבוחן אמצע הייתה שאלה מהגיליונות ובמבחן תמיד יש שאלה מהגיליונות ככה שמומלץ לעבור עליהם בכל מקרה.\n\nהמבחן: מועד א היה ברמה סבירה. אפשר להצליח אם מתכוננים כמו שצריך. מומלץ מאוד לגשת לבוחן אמצע כדי לקבל משוב על הדרך שבה כותבים דברים בקורס.\n\nהשורה התחתונה: הקורס הכי מדובר בסמסטר א ולא סתם.", "timestamp": 1644164347302}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: צנזור - הקלטות\nחוות דעת - הרצאות: מלחיץ להסתמך רק על הקלטות, לכן גם אני בהתחלה הלכתי לשיעורים בלייב של אלון דמיטריוק (לא מומלץ בכלל). \nאבל ההקלטות מספיק ברורות, ואם רואים אותן בקצב של הכיתה זה גם מסונכרן עם התרגולים וההגשות, ואין שום סיבה לא לראות אותן (חוסך גם זמן אם רואים על מהירות כפולה).\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: מתרגל תותח. משקיע ועונה על שאלות בלי סוף (אחרי התרגול), מוסיף עוד שעות של תרגול בסוף הסמסטר ולפני המבחן כדי לדאוג שהסטודנטים יגיעו הכי מוכנים שיש. אם טל מתרגל - לכו אליו.\n\nשעורי הבית: webwork מציקים בקטנה ולא באמת עוזרים מאד להבנה של החומר, תכלס לעבור על הגיליונות גם אם הם לא להגשה זה הדבר האמיתי.\n\nהמבחן: קשה, אבל אם חורשים מספיק אפשר להוציא 70+ שזה סבבה לגמרי לקורס.\n\nהשורה התחתונה: קורס שדורש. מלחיץ עם כל השמועות עליו אבל אחרי שמסיימים איתו מגלים שהשד נורא, אבל לא ברמה בלתי נסבלת.", "timestamp": 1644171122635}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: הלכתי פרונטלי בכל הסמסטר, ואני יכול לאשר שההקלטות ביוטיוב וההרצאות שלו פרונטליות כמעט זהות (מגוון לעיתים רחוקות בהוכחות של משפטים כלשהם, אבל לא משהו חריג). בכל זאת הייתה לי חוויה נהדרת מההרצאות הפרונטליות. הייתה אווירה טובה באולם והוא מרצה מעולה, לא חושב שיש סיבה כלשהי ללמוד את הקורס עם מרצה אחר חוץ ממנו (עם כל הכבוד לאחרים, לבנאדם יש תשוקה ויכולת מעולה ללמד אנשים חומר קשה). סופר ממליץ לראות הקלטות או ללכת פרונטלי, צנזור באמת מרצה נהדר.\n\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: אם אחסאן מתרגל את הקורס כשאתם לוקחים אותו, פשוט לכו אליו. המתרגל הכי תותח שיש. מסביר דברים בצורה נהדרת, מדגים קווי חשיבה שצריך בשביל לפתור שאלות ומשתף כל הזמן את הסטודנטים בכיתה וזה יוצר שיעור אקטיבי שכיף להיות בו. באמת מלך והחוויה ללמוד איתו הייתה מעולה.\n\nשעורי הבית: יש גיליונות פתוחים שהם לא להגשה, והשאלות בהם ברמה די גבוהה. ממליץ כן לעשות אותם למרות שזה כביכול \"לא יתרום לכם\" כי זה מאוד חשוב להיות כל הזמן עקביים בחומר ולהשתפר בהוכחות פורמליות. לא לפחד אם לא מצליחים, הרמה של השאלות בגיליונות גבוהה יותר מהמבחנים.\nחוץ מהם יש גיליונות WW שהם כן להגשה ומקנים 5% מגן. אין סיבה לא לעשות אותם, אתם צריכים את המגן וזה אחלה חימום לפני כל גיליון פתוח. רובם גם ככה לא כזה סיפור.\n\nהמבחן: בסמסטר שלנו היה מבחן לדעתי די הוגן (לא אומר שהוא לא קשה, אבל בהחלט פתיר). עם זאת יש מועדים שבהם המבחנים ממש לא הוגנים וקשים בצורה חסרת פואנטה, זה קצת משתנה. לדעתי אם חורשים מספיק אפשר להוציא ציון סבבה לגמרי (יחסית, בכל זאת זה קורס סופר קשה). חשוב מאוד להתאמן על פורמליות כי הבדיקה שלהם מאוד קפדנית וקשוחה.\n\nהשורה התחתונה: זה קורס קשה מאוד, אבל עם זאת גם מעניין לדעתי וחשוב להמשך התואר ולשאר הקורסים המתמטיים שתעשו. הכי חשוב לבוא בגישה חיובית ולהשקיע בו מאוד גם אם השיעורים לא להגשה וגם אם לא רוצים וזה מייאש, כי רק ככה באמת לומדים בו.", "timestamp": 1644172081166}, {"author": "BaronCabbage", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: כמרצה הוא ממש מעולה, אפילו יותר מעולה לראות אותו ביוטיוב על כפול 2. שינוי פלאים בעומס ברגע שעברתי ליוטיוב\n\nשם המתרגל/ת: גאי שמש\nחוות דעת - תרגולים: מתרגל ממש אחלה, אולי לא מנוסה כמו האחרים אבל רואים שיש לו תשוקה למתמטיקה ושהוא ממש רוצה שהסטודנטים יצליחו והביא יחס אישי.\n\nשעורי הבית: לא קלים אבל לא חובת הגשה, עם זאת ממש ממליץ לעשות כולם ולא להתעלם מאף תרגיל.\n\nהמבחן: המועד שלנו היה ממש הוגן בניגות למועדים קודמים. דורש רמה מסויימת של הבנה. ללמוד הרבה הוכחות של משפטים ולשים לב לטריקים שחוזרים על עצמם.\n\nהשורה התחתונה:  קורס חובה לא קל אבל דיי מעניין דורש הרבה השקעה וממש אפשרי להוציא בו ציון טוב", "timestamp": 1644182254577}, {"author": "סטודנט של פיזיקה", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמרצה מצוינת, דואגת לכולם\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: \nאחלה של מתרגל נותן הרבה שיטות לפתור שאלות ממבחנים\nשעורי הבית: \nמאוד קשים כדאי להשקיע בהם כי הרמה שלהן היא באותה הרמה של המבחן\nהמבחן: \nזה יותר עניין של מזל... יש מיעודים מאוד קשים שבקושי אפשר לקבל בהן עבר אחרים יותר קלים שאפשר לעבור בהם.\nהמטרה לעבור לא כדאי לשפר במועד ב\nהשורה התחתונה: \nלעבור את הקורס ולהנות קצת מהחומר (לא מהמבן :) )", "timestamp": 1644234491794}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מדהימה בתור בן-אדם עונה על כל השאלות מגיעה לפני עונה על שאלות ונשארת תמיד אחרי שיעור לענות על שאלות.בערך מאמצע הקורס אי אפשר לעקוב אחרי מדברת מהר ,רושמת לא ברור.\nשורה תחתונה -צנזור טוב בפער בהעברת החומר-הרצאות מוקלטות ופרונטלי אותו הדבר .\n\nשם המתרגל/ת: אפרת וטל \nחוות דעת - תרגולים: \nאפרת מדהימה מכל הבחינות תותחית על!\nטל-לסטודנטים שמתקשים,אין מתרגל טוב ממנו,שיכתב את כל התרגולים לטובת הסטודנטים,מסבר לאט ומדוייק,תמיד נשאר לשאלות,בערך מאצע הסמסטר התחיל ללמד אקסטרה בהפסקה הפעילה של יום רביעי בכדי להספיק כמה שיותר חומר.הוסיף המון זום תרגול לפני המבחן -באמת אחד המתרגלים הטובים שפגשתי.\n\nשעורי הבית: חשוב לעשות-לא לדאוג לגבי הגליונות אם לא מצליחים,אבל חשוב לנסות ולתת לזה זמן-במבחן מופיעה שאלה דומה.\n\nהמבחן: קשה-לפתור כמה שיותר מבחנים,ולשבת טוב טוב על החלקים התאורטיים\n\nהשורה התחתונה: תשקיעו זמן ומאמץ ותצליחו", "timestamp": 1644254403587}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: בשלב הזה אין מה להוסיף על צנזור, צנזור זה צנזור.\nעצה שהקלה עליי בהבנה של החומר (במחיר של עומס נוסף) היא לראות יום לפני ההרצאה את אותה הרצאה שלו מהיוטיוב וגם בנוסף לבוא להרצאה ולראות אותה עוד פעם בלייב. כל הרצאה היא 2 סרטונים מהפלייליסט ככה שההרצאה הראשונה היא סרטונים 1-2, השנייה היא 3-4 וכו' עד סוף הקורס. זה עושה הבדל גדול ושווה למצוא זמן בעיקר בהתחלה כשזה קל אבל גם בתקופות של עומס.\n\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: אחלה מתרגלת, היה פשוט לעקוב אחריה בתרגולים. אבל היה פעם או פעמיים שהיא ניסתה להפחיד אותנו בלי סיבה עם תרגילים לא אנושיים שכנראה לא יהיו במבחן מירוב שהם מזעזעים.\n\nשעורי הבית: מאוד מאוד מאוד קשים. הם לא חובה אבל כדאי לשבור עליהם את הראש ולא לבקש עזרה בכלל כי רק ככה אפשר, בסוף במבחן אתם לבד.\n\nהמבחן: משתנה, יכול להיות נורמלי (בסטנדרטים של צנזור) ויכול להיות ממש מזעזע. בכל מקרה צריך להתכונן נפשית לגרוע ביותר ולמועד ב, והמבחנים דיי צפויים, תהיה שאלה על רציפות במ\"ש, תהיה שאלה על טיילור, יהיו שאלות על פונקציות שג'ורג'י חפר בגינה ויהיה משפט מההרצאה שצריך לצטט וכנראה להוכיח.\n\nהשורה התחתונה: קורס קשה ועמוס אבל גם מעניין, חייבים להשקיע עליו הרבה שעות ביום לתרגול וחזרה אבל עוברים אותו בסוף.", "timestamp": 1644254982340}, {"author": "Ron Lebedinsky", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביב ואירנה (פעם אצלו פעם אצלה כי אני אוטיסט)\nחוות דעת - הרצאות: אביב מרצה מעולה, אוהב להשאיר שאלות פתוחות ובכך מנסה לגרום לסטודנטים לפעול לבד - מאוד חשוב כי זה מה בסופו של דבר חודר, מנסים וטועים או לא מצליחים ואז כשרואים את הדרך הנכונה זה יושב טוב.\nאירינה גם אחלה, היה פעם ראשונה שאלה שהיא לימדה אינפי ובניגוד לאביב היא לרוב עושה הוכחות של דברים שאביב רוצה שיתנסו לבד בהם. \nשניהם אחלה ועונים על רוב השאלות שנשאלות.\nבוספו של דבר הייתי ממליץ על אביב כי הוא יותר עוזר לפתח אינטואיציה בנוגע לנושאים הנלמדים.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: מתרגל שעושה מעל מעבר בשביל הסטודנטים ובנוסף לכך הוא מתרגל מצויין שבאמת מצליח לפזר את הערפל ולהבין את הנושאים הנלמדים לעומק. הוא נותן גישה להקלטות ישנות ולרשימות תרגולים אז ניתן להשתמש בהם אפילו אם לא הולכים אליו.\n\nשעורי הבית: גיליון שבועי של 5-6 שאלות לתרגול עצמי שלא מגישים (מאוד מאוד מומלץ לנסות ולפתור, הייתי אומר להשקיע בסך ה-4 שעות על כל גיליון), עולים קווים מכוונים לפתרון שבוע אחרי. גם יש מטלת webwork שבועית עם ציון שהולך למגן (לא לוקח יותר משעה בממוצע)\n\nהמבחן: מועד א' היה מאוד הוגן לפי דעתי, אבל זאת לא סיבה לא לעשות כלום. חובה להיות במקום שההוכחות מובנות והיכולת להוכיח דברים לבד קיימת. מאוד מומלץ לפתור יותר מ-10 מבחנים לפני שניגשים.\n\nהשורה התחתונה: קורס חובה שלא יהיה מעניין לרוב המוחלט אבל הסגל המלמד הוא אחלה ואכפתי, תעזרו בהם ותנסו להנות כמה שאפשר.", "timestamp": 1644305309606}, {"author": "אנונ'", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: אין מה להגיד מספר 1\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מעולה, מאזן טוב בין הרצון להתקדם ולהראות כמה שיותר תרגילים, לבין לייצר הבנה בכיתה.\n\nשעורי הבית: ממליץ לא לזלזל בגיליונות הפתוחים אפילו שהם לא להגשה, ויותר מכל השיעורי בית הכי חשובים הם התרגילי אקסטרה שצנזור נותן בכיתה.\n\nהמבחן: קשה מאוד, אבל דיי הוגן\n\nהשורה התחתונה: קורס חובה", "timestamp": 1644368769756}, {"author": "Itamar", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: נעמי  שקד/ הקלטות של צנזור\nחוות דעת - הרצאות: התחלתי עם נעמי בפרונטלי וקצת לפני בוחן האמצע עברתי להקלטות של צנזור. נעמי נחמדה אבל לדעתי מעבירה את החומר בצורה פחות ברורה ומעניינת. ההקלטות של צנזור טובות אבל צריך לשים לב שבאמת מבינים את החומר ולא סתם רואים את הסרטון.\n\nשם המתרגל/ת:  אולג קליס\nחוות דעת - תרגולים: מתרגל טוב מאוד. לפעמים יכול להיות קצת לא ברור, אבל מאוד משתדל לערב את הסטודנטים בשיעור ולהעביר את החומר בצורה מעניינת.\n\nשעורי הבית: גליון פתוח כל שבוע שאינו חובה להגשה וזה חבל כי אז אין פידבק על מה שעושים אז חשוב להשוות עם אחרים כדי לקבל משוב כלשהו.\n\nהמבחן: מבחן קשה, יש הרבה חומר ללמוד ולהבין, אבל עם מספיק למידה אפשרי להצליח.\n\nהשורה התחתונה: להיות במעקב עצמי לאורך הסמסטר שבאמת מבינים את החומר, לעשות את כל הגליונות הפתוחים ולנסות לקבל עליהם פידבק כי ככה תדעו אם אתם עומדים בקצב. קורס לא קל אבל חובה אז אין מה לעשות", "timestamp": 1644482174346}, {"author": "דנה גורליק", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: באמת שאין צורך להגיע להרצאות שלו, מספיק לצפות בסרטונים, הוא תותח ומסביר מעולה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אלופה ממש, יודעת להסביר את החומר בצורה טובה.\n\nשעורי הבית: לא פשוטים אבל חשובים להבנת החומר.\n\nהמבחן: הוגן לגמרי, הייתה שאלה משיעורי הבית.\n\nהשורה התחתונה:", "timestamp": 1644565341657}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: מעניין בטירוף, לא משנה אם אוהבים פונקציות או לא, אי אפשר לראות הרצאה של צנזור בלי להנות מהאישיות שלו. אני ראיתי את ההקלטות כי זה פחות מתאים לקום בשבע כדי לתפוס מקום נורמאלי בהרצאה שלו ב7 וחצי ( ניסיתי בתחילת הסמסטר אבל זה לא החזיק מעמד). אבל כל אחד ומה שמתאים לו. ממליץ לעצור את ההרצאות באמצע אם רואים את ההקלטות ולעשות את התרגילים שהוא נותן תוך כדי ההרצאה כי זה מאוד עוזר להבנה אמיתית של החומר, בנוסף מומלץ להסתנכרן עם הלוז של ההרצאות כדי שלא יווצר פיגור בחומר.\n\nשם המתרגל/ת: אחסאן \nחוות דעת - תרגולים: מתרגל טוב, יודע להסביר ולהעביר את החומר בצורה מאוד מאוד ברורה, אבל צריך להיות עם היד על הדופק כי לפעמים התרגולים שלו יוצרים מצג שווא לגבי המצב האישי בחומר.\n\nשעורי הבית:  קשים ברמות, אפשר לשבור את הראש ארבע שעות על תרגיל בקלות. מומלץ להשקיע בהם כמה שעות בשבוע ולנסות לפחות לעשות אותם אבל גם לא להילחם עליהם בצורה מוגזמת כי יש מקרים רבים שבהם זה לא יעיל. יש אסכולה שפשוט עושה את הגיליונות כהכנה למבחן, יש לזה יתרונות ויש לזה חסרונות. \n\nהמבחן: היה לסמסטר שלנו מבחן הוגן, בלי טריקים גאוניים או הוכחות בלתי אפשריות, אבל אין ספק שזה לגמרי עניין של מזל. בכל מקרה צריך לחרוש לאינפי ולראות כמה שיותר תרגילים, בסופו של דבר שאלות חוזרות על עצמן (לא העתקה מוחלטת אבל יש דמיון). \n\nהשורה התחתונה: תלמדו לאהוב את הקורס הזה ולנסות לראות את הקסם בחלק מההוכחות כדי שתסבלו כמה שפחות מהדרך!\nאינפי זה מסע רציני, זה שינוי מוחלט בחשיבה שהורגלנו אליה בתיכון, הדרך קשה אבל אל תתייאשו, בסוף זה קורה, בהצלחה!", "timestamp": 1644770698172}, {"author": "ניצן חיים ליסטמן", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ראיתי בעיקר את היוטיובים והם מעולים. ממליץ ללכת מידי פעם לראות בלייב גם בשביל החוויה וגם כדח להסתנכרן לקצב והסילבוס של השנה (הוא 99% זהה אבל כל עניין מה העשרה ומה לא היה לא ברור לפחות לי)\n\nשם המתרגל/ת: אחסאן עבד אל פתאח\nחוות דעת - תרגולים:  אחסאן תותח. הלכתי אליו בעקבות המלוצת מכאן. כל מה שכתוב נכון אז לא אחזור על הכל שוב.\n\nשעורי הבית: וובוורקים להגשה בשביל מגן, חוץ מ1 שהיה מזעזע הרוב יחסית קלים ותורמים לתרגול טכניקה והבנה בסיסית של חומר חדש. הגליונות הפתוחים היו קשים משמעותית וגם לא להגשה ככה שלא קיבלנו פידבק באמת עד הבוחן אמצע וזה היה גרוע.\n\nהמבחן: היה הוגן. התכוננתי טוב טוב ארבעה ימים לפני והרגשתי שבאתי מוכן\n\nהשורה התחתונה: הקורס הכי קשה שהיה לי הסמסטר. צריך להשקיע המון כדי להצליח אבל זה בהחלט אפשרי.", "timestamp": 1644777280101}, {"author": "מילר", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: \nאחלה מרצה! אין אצלו הרבה אנשים כי בהתחלה הוא אוהב להיות קצת קריפי ולהפחיד אנשים. אבל זה רק בהתחלה! הוא עונה על שאלות ומסביר מעולה ונותן קשב לכולם.\n\nשם המתרגל/ת: אחסאן עבד אל פתח\nחוות דעת - תרגולים: \nאחד המתרגלים התותחים. מעביר מעולה את החומר וגם נחמד איתו בשיעורים והוא בוייב כיפי לאורך הסמסטר. לפעמים הוא קצת בדיליי לעומת ההרצאה אז קחו בחשבון.\n\nשעורי הבית: \nהוובוורקים חביבים וטובים\nהגליונות הפתוחים קשים פצצות אבל טובים וגורמים לחומר להיכנס. אצלנו לא היה צריך להגיש אותם אז הרבה פעמים היה נוח לדלג עליהם ובסוף זה התברר כטעות. אז ממליץ כן לעשות אותם תוך כדי הסמסטר ולא לוותר עליהם גם אם הם לא להגשה.\n\nהמבחן: \nנפלנו על מבחן נחמד, לא היה קמירות, כיסויים, טיילור (הנושאים האחרונים שנחשבים הכי מציקים ומבלבלים) אז היה מאוד הוגן. בדרכ הוא קשה פצצות.\n\nהשורה התחתונה: \nאתם חייבים לעבור אותו גם ככה לא? אז לפחות שיהיה עם אחסאן כדי שיהיה כיף לאורך הסמסטר", "timestamp": 1644821671508}, {"author": "סטודנט בינוני", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אירנה גורליק הראשונה לשמה\nחוות דעת - הרצאות: \nאחלה מרצה, אבל טיפה מרדימה.\nבאופן אישי עשיתי איתה 4 שעות רצופות אלגברה אינפי כל ראשון ורביעי וזה לא מומלץ.\nאם יש לכם אופציה, קחו אותה רק לקורס אחד.\n\nשם המתרגל/ת: אחסאן עבד אלחתיכוס\nחוות דעת - תרגולים: \nמתרגל מעולה,נהניתי מכל שנייה\n\nשעורי הבית: קשים,ממליץ לעשות בעיקר גיליונות פתוחים,הכי ישפרו.\n\nהמבחן: אצלנו היה סביר,לרוב יותר קשה.\n\nהשורה התחתונה: \nצריך להיות חדים על מה כותבים.\nכל חוסר דיוק קטן מוריד מלא נקודות וזה פשוט נראה לבוחנים חוסר הבנה מוחלט.", "timestamp": 1644862814387}, {"author": "אוהב אינפי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nאירנה בהתחלה ואז צנזור ביוטיוב\nחוות דעת - הרצאות: \nשניהם ממש טובים, אירנה כותבת קצת מבולגן אז תתמודדו כי אין עליה.\nשם המתרגל/ת:  אפרת אבירם בכבודה ובעצמה\nחוות דעת - תרגולים: \nאין מילים לתאר כמה היא טובה, כל דבר שלא יהיה מובן בהרצאות היא תסביר בצורה מדהימה. אין עליה\nשעורי הבית: \nהוובוורק קלילים ונחמדים, והגליונות הפתוחים דורשים קצת יותר חשיבה, כדאי לשבת עליהם, בעיקר על אלו של הפונקציות.\nהמבחן: \nשלנו היה קליל ממש, אבל נראה לי זה היה חד\"פ, וכמו כלים חד\"פ, היה מס וחילקו לכולם את הציון ב1.04.\n\nהשורה התחתונה: \nקורס ממש נחמד, לא יודע למה כולם מתייחסים אליו כאילו הוא סוף העולם. אני ממש אהבתי.", "timestamp": 1644907895744}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רונית\nחוות דעת - הרצאות: \nמרצה טובה, לא היו הרבה בהרצאות שלה הסמסטר אז כן היה אפשר לשאול יחסית הרבה שאלות ולקבל יחס טיפה יותר אישי.\n\nשם המתרגל/ת: אולג\nחוות דעת - תרגולים: \nפשוט מתרגל מדהים, אני מאוד ממליץ עליו בהתחלה זה מרגיש כאילו הוא טיפה מתקדם מהר, אבל ככל שמתקדם הסמסטר זה מסתדר ובאמת הרגשתי שהוא לימד אותי לפתח אינטואיציה לחומר.\n\nשעורי הבית: \nהגיליונות יחסית קשים אבל אפשריים לגמרי פשוט לוקחים טיפה זמן, חוץ מזה הם לא להגשה אז לא משפיעים יותר מדי על העומס כי פשוט תעשו אותם כשנוח לכם.\nהוובוורקים קלילים והם די מגן מתנה אז חבל לא לעשות.\n\nהמבחן: \nהמבחן היה הוגן לגמרי, ובלי קשר תתרגלו מבחנים קודמים וגם מבחן יותר קשה יהיה בסדר.\n\nהשורה התחתונה: קורס נחמד ומעניין והוא באמת פחות גרוע מאיך שמציירים אותו.", "timestamp": 1644942537063}, {"author": "כפיר", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: נהניתי ממש במהלך הסמסטר, מעביר את החומר בצורה חווייתית ולפעמים מראה טריקים שלא מופיעים בסרטונים ביוטיוב. בהתחלה היה עמוס אצלו והיה צריך להגיע חצי שעה לפני אבל מהר מאוד האולם נהיה פנוי עד שבסוף היה 2/3 אולם ריק (כנראה שעברו ליוטיוב) והיה יותר מקום לשאול שאלות ולהשתתף.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: יש לו רשומות נהדרות של כל החומר אבל מאוד איטי בקצב שיעור, מוסף המון שעות מעבר לשעות התרגול ולא מתאים לכולם. בשלב מסוים עברתי למצב של לנסות לפתור את התרגילים ברשומות ואח\"כ לראות איך הוא פתר.\n\nשעורי הבית: גיליונות קשים אבל די מייצגים את רמת השאלות במבחנים של אינפי (פרט ל2-3 האחרונים שהיו הרבה יותר קשים מרמת המבחן). יש גם וובוורקים קלילים שמקנים ציון מגן.\n\nהמבחן: בדר\"כ המבחנים זוועה. למזלנו יצא מבחן הוגן או אפילו לומר פתיר מבדרך כלל וההיסטוגרמה מדברת בעד עצמה לדעתי.\n\nהשורה התחתונה: אינפי ואלגברה הם קורסים ממיינים וחשוב להשקיע בהם לפחות פי 2 מבכל קורס אחר בסמסטר הראשון. בהצלחה!", "timestamp": 1645100127941}, {"author": "סטודנט שנה א", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל רבייב והקלטות צנזור\nחוות דעת - הרצאות: מרצה ממש טוב, עוזר לכולם ופנוי לשעות קבלה גם מחוץ לשעות הלימוד, בפונקציות קצת התחיל להתפזר עד אז מעולה. צנזור בהקלטות מעולה כמובן.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת פשוט מעולה.\n\nשעורי הבית: גיליונות בית ממש קשים ולא משקפים את הרמה של המבחן (שהיא קצת קלה יותר) כדאי מאוד למצוא תרגילים נוספים לתרגל מהם את הבסיס מספרי לימוד שונים - אם אתם לא תדאגו לעצמכם לתרגול אף אחד לא יעשה את זה בשבילכם \n\nהמבחן: סך הכל הוגן, לתרגל הרבה מבחנים לפני \n\nהשורה התחתונה: קורס קשה ועמוס, בעיני לא כזה יפה כמו שחלק אוהבים להגיד ובכללי קורס מאוד טרחני וחופר. אין לכם ברירה אלא לעשות אותו אז ההמלצה שלי היא לקחת אותו ברצינות מהרגע הראשון כדי לא לתפוס פערים לקראת המבחן. אפשר להוציא ציונים יפים אם משקיעים מספיק.", "timestamp": 1645172141419}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מרצה מעולה.\nבגלל עומס הסטודנטים קשה מאוד לשאול שאלות.\nממליץ מאוד, לפחות בהתחלה, לחזור על החומר אחרי/ לפני כל הרצאה. החומר צריך לשקוע והרבה פעמים עולות תובנות עם הזמן. הדבר הכי גרוע זה לצבור פערים, כי קשה מאוד להשלים אחר כך.\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: הקבוצה אצלנו הייתה לא עמוסה וזה היה יתרון. יוליה מצד אחד רצה אבל בתמורה מספיקה הרבה. בשעתיים תרגול איתה קשה מאוד להבין הכל ולרוב צריך לחזור אחרי זה על החומר, אבל לדעתי זה שווה את זה כי מספיקים הרבה ורואים הרבה. לא לפחד לשאול אם לא מבינים מצד אחד, אבל מצד שני לא לחזור על שאלות או דברים שכבר נאמרו כי זה מעכב את יוליה והיא לא אוהבת את זה :)\n*הרבה פעמים יש שימוש בעובדות \"ידועות\" (כל מיני אי-שיוויונים וכו') - ממליץ מאוד כבר מתחילת הסמסטר לעשות רשימה של טריקים ושל מקומות שצריך להיזהר לא ליפול בהם.\n\nשעורי הבית: WW וגיליון כל שבוע.\nWW בדר\"כ פתיר ולוקח שעות בודדות (יש איזה קטע בוובוורק שלפעמים רואים תרגיל שנראה כאילו למדנו אותו כבר אבל בפועל יש שם טריק/ משהו עמוק יותר שעוד לא למדנו וסתם יכול לגרום לבזבוז זמן מיותר, לכן תוודאו טוב שאתם פותרים אחרי שכבר למדתם הכל).\nגיליונות פתוחים (לא להגשה, שאלה מהגיליונות במבחן) קשים וחלקם קשים מאוד. ממליץ מאוד בהתחלה לנסות לבד את הכל ולפתור את הקלים יותר ואחרי זה לשבור את הראש על הקשים עד שאתם מרגישים שלא יודעים יותר לאן להתקדם. אחרי זה לנסות אותו הדבר עם חברים ורק אחרי זה לרפרנס. גם אחרי שמרפרנסים, כדי לוודא שמבינים, ממליץ לכתוב את התשובה במלואה לבד, בלי להסתכל בו\"ז על הפתרון.\nממליץ בחום ללכת לשעות קבלה כל שבוע כדי להראות תשובות שלכם כדי לוודא שזה במבנה הנכון.\n\nהמבחן: באופן כללי צנזור הוגן במבחנים.\nחשוב שתדעו כבר מהתחלה שהמבחנים קלים יותר מהגיליונות הפתוחים (מה שכמובן לא אומר שלא צריך להשקיע בהם). לדעתי המבחן שלנו היה קל יותר ביחס לשנים קודמות.\nממליץ מאוד לפתור כמה שיותר מבחנים קודמות, לראות כמה שיותר גרפים של פונקציות, כדי שבתקווה תדעו כמה שיותר מהר איך הגרף נראה כשתראו פונקציה במבחן.\nממליץ בבוחן/ מבחן לפרט הרבה מצד אחד אבל לענות מאוד ממוקד מצד שני.\n\nהשורה התחתונה: קורס מעניין ופותח את הראש. מראה את מאחורי הקלעים של הרבה דברים שלמדנו בתיכון.\nחשוב לוודא שמבינים את הרעיונות הגדולים מאוד לעומק. גם כשנראה שמבינים, הרבה פעמים עדיין יש חורים.\nיש עניין גדול בקורס בדרך הכללית של איך לרשום הוכחה באופן כללי. לצערי חבל שאין הרצאה/ תרגול ספציפית על זה. ממליץ מאוד לגרד את זה כשלפעמים צנזור מדבר על זה (בעיקר בכיתה הפוכה/ הרצאות שקרובות לבוחן אמצע וכו') וממליץ מאוד ללכת לשעות קבלה (תשתדלו לא מאוד עמוסות אבל כן של מישהו נורמלי) ולהראות הוכחות שלכם כמה שיותר כדי לקבל פידבק. לא פחות חשוב מלהבין את החומר עצמו.\nבקורס יש הרבה עיסוק בכמתים (קיים/ לכל). ממליץ מאוד להבין את המשמעות שלהם לעומק ולהתאמן על שלילה שלהם באינטרנט/ מהחומר.\nבהצלחה !", "timestamp": 1645356906472}, {"author": "חילזון הפרא", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה:  צנזור (ביוטיוב)\nחוות דעת - הרצאות: אחלה הרצאות ואתה רואה בקצב שלך\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nמתרגלת מצוינת, מסבירה איך להתמודד עם השאלות ולהתחיל לענות בכלל על השאלה. מראה שלגמרי אפשרי להצליח לכתוב הוכחה פורמלית כמו שרוצים בקורס הזה.\nשעורי הבית: \nהחסרון המרכזי של הקורס. חוץ מוובוורק אין אף דרישה. לכן המלצה שלי תעשו גם את הגליונות בכתב שיש כל שבוע אבל תלכו לשעת קבלה של מתרגל כל שהוא כדי שיסתכל על מה שכתבתם.\nהמבחן: בשנה שלנו המבחן היה הוגן יחסית, הבדיקה מאוד קפדנית אז תשימו לב שאתם לא מפספסים אף פרט ומדייקים בכל הגדרה\n\nהשורה התחתונה: קורס שדורש הרבה השקעה", "timestamp": 1645367745925}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: \nאין מה להגיע פרונטלי, אחרי כמה שבועות עברתי ליוטיוב וחסכתי לי זמן. אחד לאחד אותו דבר, וככה תוכלו לעקוב כמו שצריך.\n\nשם המתרגל/ת: טל בן יהודה\n\nחוות דעת - תרגולים: \nאת טל גיליתי לצערי רק אחרי כ4 שבועות לסמסטר, אם הוא מתרגל חובה ללכת אליו. ממש תותח, נותן תמונה כללית מעולה לחומר, מתעכב על הדברים החשובים ועושה חזרות למבחנים מזמנו הפנוי. ממש אכפת לו מהסטודנטים ורואים את זה.\n\nשעורי הבית: \nיש גיליונות בWW שהם יותר טכניים בד\"כ וברמה יחסית פשוטה.\nיש גיליונות פתוחים שלא צריך להגיש אותם. הם ברמה מאוד קשה, יותר מהמבחן הסופי ולוקחים המון זמן. במבחן הסופי יש שאלה אחת מהגיליונות הללו. לצערי במהלך הסמסטר לא היה לי מספיק זמן להקדיש להם.\n\nהמבחן: \nמבחן קשה, עם המון אלמנטים תיאורטיים. צריך לדעת הוכחות של משפטים בצורה טובה. במבחן היו 3 סעיפים של 30 נקודות סה\"כ של להוכיח משפטים מההרצאה. אם לא זוכרים, הלך המבחן. ככה שהקורס הזה מערב לא מעט שינון ולדעת לכתוב הוכחות .\n\nהשורה התחתונה: \nלא כיף.", "timestamp": 1645422916707}, {"author": "~~", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מרצה מצוינת ממש! היא מבינה המון בחומר, קשובה לכל שאלה שהיא שעולה בהרצאות, ובאופן כללי ניכר כי מאוד מושקעת בזה שנבין את החומר הנלמד. ממליץ בחום.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה! מעבירה את החומר בצורה ממש טובה, מאוד קשובה לכיתה, ומשרה אווירה טובה מאוד במהלך התרגולים.\n\nשעורי הבית: רק WebWorkים להגשה, שהם משתנים ברמת הקושי, חלק ממש קלילים וחלק מעיקים מאוד. לצד ה-WebWorkים מפרסמים כל שבוע גיליון לא להגשה, אבל אלו הגליונות שמדמים בצורה הכי מדויקת את השאלות מהמבחן, אז למרות שלא להגשה תכלס מומלץ מאוד מאוד לעשות אותם כדי באמת לתרגל את החומר בצורה שאחרי זה נדרשים במבחן.\n\nהמבחן: קשה, אבל כן היה הוגן לפחות מועד א'.\n\nהשורה התחתונה: קורס קשה, אבל חובה, תשקיעו.", "timestamp": 1645434029611}, {"author": "ל\"א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: סבבה לגמרי, אירנה מרצה טובה ותתעכב איתך על נקודות שלא הבנת גם אחרי השיעור\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מדהימה, דאגה להעביר לנו את הסיכומים שלה שיהיה לנו. קצת רצה על החומר אז לא מתאימה לכל אחד\n\nשעורי הבית: שיעורי הבית להגשה אומנם קלילים, אבל יש גליונות פתוחים, שרוב הסטודנטים לא מספיקים כל כך לעשות, אבל מתוך הגיליונות האלו יש שאלה שתהיה במבחן אז שווה לעשות גם אותם  אם מצליחים מבחינת זמנים\n\nהמבחן: המבחן היה הוגן, זהו קורס קשה, צריך לפתור הרבה מבחנים ולהבין הרבה הוכחות כדי להצליח בו\n\nהשורה התחתונה: זהו קורס קשה, צריך לפתור הרבה מבחנים ולהבין הרבה הוכחות כדי להצליח בו, אומנם מבחינת הגשות הוא לא עמוס אך מבחינת הספק חומר הוא עמוס", "timestamp": 1645458935129}, {"author": "Daniel Hamzany", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: היתרון בצנזור הוא שהוא מעביר את ההרצאות באופן כמעט זהה לחלוטין למוקלטות בוידאו, כך שאם משהו לא מובן מאוד קל להשלים את החומר. ההרצאות חשובות ומעניינות, צנזור יודע מה הוא עושה.\n\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: משעממים קצת, מיכל מתרגלת טובה שעונה על שאלות ומסבירה את ההיגיון מאחורי דרכי הפתרון של התרגילים אבל בסופו של דבר אני לא חושב שהפקתי הרבה מהתרגולים\n\nשעורי הבית: מאוד מאוד חשובים, בסמסטר הזה הם לא היו חובה וזו טעות לנצל את העובדה הזו כדי \"להוריד מהעומס\" עשיתי את זה בחצי הראשון של הסמסטר והתוצאות באו לידי ביטוי בבוחן האמצע. השאלות ממוקדות לכל נושא ומאפשרות תרגול ממוקד בנושאים חלשים. כמו כן יש שאלות לתרגול נוסף שאפשר לפתור אם עדיין מרגישים חוסר שליטה בחומר.\n\nהמבחן: היה יחסית קל בסמסטר הזה, חשוב לתרגל מלא תרגילים כדי להגיע למצב שמהתבוננות על שאלה מקבלים אינטואיציה כללית לאיזה כיוון לנסות ללכת. מומלץ לקראת המבחן לשבת קבוצה של אנשים ולהריץ כמה שיותר תרגילים, ולהקדיש לכל תרגיל 10 דק בערך ולאחר מכן לעבור הלאה, וגם לעשות סימולציות. חשוב לזכור שתמיד יש שאלה מגליונות הבית במבחנים, שהיא יותר קשה משאר השאלות אבל למי שעשה אותה/עבר על הפתרון שלה זו שאלת מתנה\n\nהשורה התחתונה: קורס קשוח, אל תאמינו לצנזור שאומר שאינפי זה קל בתחילת הקורס. למרות זאת, הקורס מעניין ופותח את הראש לצורת חשיבה אחרת.", "timestamp": 1645495422230}, {"author": "שם", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: צנזור ביוטיוב\nחוות דעת - הרצאות: לא צריך שום דבר מעבר. לא הגעתי פעם אחת להרצאה בכיתה\n\nשם המתרגל/ת: מיכל עמיר. \nחוות דעת - תרגולים: אני אהבתי. קצת מפוזרת לפעמים, אבל מאוד אכפתית וקשובה לשאלות, ובעיקר מובנת ומדברת ברור.\n\nשעורי הבית: לא היה חובה, לא עשיתי בכלל. קצת מעצבן שאי אפשר להגיש ולקבל פידבק מה שדי הוריד לי מהמוטיבציה לעשות אותם\n\nהמבחן: היה הוגן, אפילו קצת יותר קל משנים קודמות, אבל זה עדיין צנזור.. השיטה הכי טובה להתכונן זה פשוט לעשות מלא מבחנים משנים קודמות. זה הכול חוזר על עצמו בסופו של דבר\n\nהשורה התחתונה: קורס ששמו הולך לפניו. דורש כמובן את ההשקעה וההבנה, אבל הכול בו מונגש בצורה יחסית נוחה מה שמקל מאוד את העבודה.", "timestamp": 1645544239782}, {"author": "/*=", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מרצה מעולה, ההרצאות ביוטיוב ממש אחד לאחד (אולי הוכחה אחת או שתיים שונות אבל זה ממש לא קריטי), אני אישית הלכתי להרצאות ואז ראיתי ביוטיוב את מה שלא ישב טוב כדי לחזק את ההבנה של החומר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אחלה מתרגלת, תמיד מגיעה מוכנה ויודעת להעביר את החומר מעולה, לפעמים בגלל שלא מספיקה להעביר מה שהיה צריך בתרגול היא רצה בטירוף פתאום ב-5 דקות האחרונות וזה קצת מבאס אבל חוץ מזה אחלה.\n\nשעורי הבית: גליון של שאלות פתוחות כל שבוע, כל גליון קשוח מאוד, אצלנו לא היה צריך להגיש אבל ממליץ מאוד לעשות בכל מקרה, זו הדרך היחידה לתרגל כתיבה של פתרון - רק לראות את ההרצאות והתרגולים אולי יעזור להבין את החומר אבל בלי תרגול זה לא שווה כלום.\n\nהמבחן: כנראה ממש תלוי במצב רוח של המרצה האחראי, המבחן שלנו היה פייר (יחסית), יש מבחני עבר קשוחים על סף הבלתי פתירים.\nממליץ לפני המבחן לפתור כמה שיותר מבחני עבר כי בסופו של דבר הדברים דיי חוזרים על עצמם ואפשר לקלוט תבניות ולדעת לאיזה כיוון ללכת בשאלות ספציפיות.\n\nהשורה התחתונה: קורס קשוח ודיי עמוס, לא סתם אומרים שהוא קשה אבל בסופו של דבר אפשרי אם משקיעים מספיק ומנסים באמת להבין לעומק את הדברים וכמובן חשוב מאוד לתרגל כמה שאפשר כדי לדעת לרשום פתרון בצורה פורמלית כמו שדורשים (משהו ש99% מהסטודנטים בסמסטר ראשון לא יודעים לעשות)", "timestamp": 1646297051589}, {"author": "Evgeny Gumovski", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: כל ההרצאות למדתי מהיוטיוב, חומר מובן ומעניין.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: המתרגל הכי אכפתי ודואג בטכניון. ממליץ מאוד ללמוד אצלו אם יש את האפשרות. מסביר את החומר בצורה ברורה וקולעת.\n\nשעורי הבית: לא חובה.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס כיפי, אני לא ציני, אהבתי אותו ממש :)", "timestamp": 1646315569368}, {"author": "שחר", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  אירנה גורליק\nחוות דעת - הרצאות: \nאירנה מקסימה באמת, תענה על כל שאלה ואפילו תשאר עוד אם צריך.  הלוח כן מבולגן בהרצאות, בדיעבד הייתי רואה צנזור ביוטיוב והולכת לשעות קבלה שלה.\n\nשם המתרגל/ת:  יוליה פייגלין/ טל בן יהודה\nחוות דעת - תרגולים: \nיוליה מקצועית בטירוף אבל התרגילים שלה ברמה של מבחן אם לא יותר לאורך כל הסמסטר, היא לא מתעכבת להסביר את החומר אלא יוצאת מנקודת הנחה שאנחנו כבר מאה אחוז עליו (מה שכשמובן לא תמיד המצב).  היה לי קשה לעקוב אחריה ולדעתי לא שווה את זה. \nבניגוד אליה, טל בן יהודה הוא פשוט תותח. מסביר הכל לפרטי פרטים, הדפים שלו מסודרים ביותר ואפשר להעזר בהם כסיכומים והעשרה. באמת שעברתי את המבחן רק בזכות ההקלטות שלו + התרגול לפני המבחן שהוא עשה כי גיליתי אותו רק באמצע הסמסטר. ממליצה בחום!\n\nשעורי הבית:  וובוורקים לא קשים, כדאי מאוד להיות על הגליונות אפילו שהם לא להגשה.\n\nהמבחן: \nקשה אבל אפשר להוציא בו ציון סביר, ללמוד את ההוכחות בעלפ ולדאוג שתדעו לפרמל הוכחה עוד מתחילת הסמסטר!\n\nהשורה התחתונה: \nאם אפשר, עדיף לעשות בפתוחה לפני אבל אם כבר הגעתם אז תראו צנזור ביוטיוב, תשיגו עותק של ההרצאות כתובות, תלכו למתרגל תותח, תעשו את הגליונות ואל תתנו לאנשים להפחיד אתכם על הקורס!", "timestamp": 1646335881519}, {"author": "אלחנן בלוך", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nצנזור יודע להסביר בצורה מאוד ברורה, וג8 מאוד מעניינת.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nניקה יחסית רצה על שאלות.\nלי זה היה מעולה, אבל יכול להיות שזה לא יתאים למי שיחסית מתקשה בחומר.\n\nשעורי הבית: \nלגליונות אין חובת הגשה. אבל קריטי לעשות, אם רוצים להגיע למבחן, למרות שהרבה פעמים השאלות קשות ומתסכלות.\n\nהמבחן:\nלא קל, אבל הוגן (אין שאלות ברמה של השאלות הקשות מהגליונות).\n\nהשורה התחתונה:\nבסופו של דבר, היה ממש מעניין!", "timestamp": 1646601907270}, {"author": "Daniel Oukhanov", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: דניאל רבייב, מהר מאוד עברתי לצנור \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טל בן יהודה אחד המתרגילים הכי משקיעים שראיתי,מסודר, מעלה רשימות,\n ומדבר בעברית לעומת חלק מהמתרגלים האחרים \n\nשעורי הבית: \nלא הצלחתי כמעט כלום אחרי שיעורי בית 5\nהמבחן: \nלא ככ דומה לשיעורי בית אבל כן כדאי לעבור עליהם \nלדעתי המבחן קשה ושווה להתחיל לפתור תרגילים של מבחן בהקדם האפשרי..זה תכלס הכי עוזר \nהשורה התחתונה:", "timestamp": 1646748859939}, {"author": "ferberonix", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nההרצאות של צנזור מדהימות. מדובר בבן אדם מהמעלה הראשונה שיודע להסביר מצוין כל דבר. במהלך ההרצאות הוא מאפשר לשאול שאלות וגם מווסת את כמות השאלות כך שקצב הלימוד מצוין. אצלנו הסמסטר היו כמה בדיחות שהכרתי מהסרטונים ביוטיוב שחזרו על עצמן אבל היו גם הרבה חדשות. על כן, האמירה שהוא חוזר על בדיחות נכונה באופן חלקי למדי.\n\nדוגמה נגדית: בהרצאה לפני חנוכה צנזור עשה לנו שעת סיפור ודקלם באופן מעורר השראה את הספר \"זה היה בחנוכה\" של נתן אלתרמן. זו הייתה חוויה מדהימה ביותר שהחדירה בנו אנרגיה טובה לקראת בוחן האמצע.\n\nטיפ ממני- אל תתנו לצנזור להשפיע עליכם יותר מידי בהרצאות שלו (לטוב ולרע) ושבו בשורה הראשונה רק אם יש לכם אומץ רב. אני ישבתי קבוע בשורה הראשונה ובאחת מההרצאות צנזור הדגים את משפט התכנסות הממוצעים ע\"י הענקת ציון סופי בקורס לכל היושבים בשורה הראשונה. מול אולם של 300 סטודנטים הוא צחק עליי שאקבל 17 במועד א', אולם לבסוף קיבלתי ציון סופי בקורס 95.\n\nשם המתרגל/ת: גאי שמש\nחוות דעת - תרגולים: \nזו פעם ראשונה שגאי מתרגל את הקורס. במהלך התרגולים היו כל מיני בעיות קטנות כגון: בלבול בפתרון התרגילים ולעיתים גם לא פתרנו את התרגילים בשל הבלבול של גאי. אך אל תתנו לזה להטעות אתכם, גאי מתרגל מאוד אדיב שמוכן לענות על כל השאלות שיש לכם גם לאחר התרגול. את התרגילים שלא פתרנו גאי פתר בתרגול הבא כך שלא באמת הפסדנו משהו. מעבר לכך, גאי מעלה קבצים מוקלדים של התרגולים לדרייב מה שמאוד תורם לסטודנטים. לדעתי הוא מתרגל טוב מאוד ביחס לכך שזו הפעם הראשונה שלו, שווה ללכת לנסות!\n\nשעורי הבית: \nהגיליונות קשים מאוד אך תורמים מאוד להבנת החומר. אתה יכול למצוא את עצמך יושב 3 שעות על תרגיל ושובר את הראש ועדיין לא מצליח אפילו להבין איך להתחיל לפתור אותו. הוובוורק הוא ברמה דיי בינונית ועוזר רק להבנה בסיסית ביותר, ובעיקר טכנית, של החומר.\n\nהמבחן:\nלהפתעתנו הרבה בניגוד למגמת העלייה ברמה של המבחנים בשנים האחרונות מועד א' היה יחסית קל והכי הוגן שהיה עד עתה. הממוצע היה גבוה מאוד אבל צנזור איזן זאת עם מועד ב' קשוח. לרוב המבחן בנוי משאלות הבאות:\n-שאלה על החלק הראשון של הקורס (סדרות, סופרימום וכו').\n-שאלת הוכחה של משפט מרכזי מהחלק השני של הקורס (פונקציות).\n-2 שאלות הבנה ויישום של המשפטים, התאוריה והכלים המתמטיים בקורס.\n- כמובן ישנה שאלת התאמה בין תכונות של פונקציות/סדרות לפונקציות/סדרות שרמת הקושי שלה תלויה בכמה ג'ורג'י היה שובב.\n\nהשורה התחתונה: \nמדובר בקורס מאוד קשה, תיאורטי ומעניין. הוא מסביר לנו מה עומד \"מאחורי הקלעים\" של החדו\"א שלמדנו בבית הספר. המפתח להצלחה בו טמון בהשקעה מתמדת לאורך כל הסמסטר בגיליונות (אל תזנחו אותם) ולקראת המבחן בפתרון כמה שיותר מבחני עבר. \nלסיכום, אביב צנזור הוא המרצה הטוב ביותר בטכניון ועל כך אין עוררין, זהו פשע לא ללכת להרצאותיו אם הוא מעביר את הקורס בסמסטר שלכם (הן בשביל הנאתכם והן בשביל הצלחתכם).", "timestamp": 1647180637437}, {"author": "סמסטר א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מעולה, חדה מאוד על החומר ויודעת לענות כמו שצריך על כל השאלות, לא מסננת הרבה שאלות.\nמצד שני קשה מאוד לעמוד בקצב ההכתבה שלה ובאופן כללי להבין את כל ההרצאה מבלי לחזור על החומר לפני זו משימה לא קלה אצל אירנה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: המתרגלת הכי טובה... נותנת תרגילים מאוד רלוונטיים לרמה הנדרשת, פותרת ביסודיות ומוודאת שכולם הבינו ותוך כדי מעבירה את החומר בצורה קלילה ונוחה להבנה.\n\nשעורי הבית: השנה גליונות הבית לא היו להגשה ורק גליונות הWW היו להגשה, לא לקח יותר מדיי זמן לפתור אותם ולא העמיס על המערכת.\n\nהמבחן: השנה המבחן במועד א היה מאוד הוגן. הרבה הבנה ומעט טריקים.\n\nהשורה התחתונה: קורס חובה, אך אפשר למצוא בו עניין.", "timestamp": 1647276917584}, {"author": "Alon Maayan", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  דניאל רבייב\nחוות דעת - הרצאות: הוא אחלה מרצה. לא הכי טוב אבל לא נורא. מאוד נהינתי בשיעורים שלו בייחוד כי היו בהם מעט אנשים. הוא אדם מאוד נחמד אך לא המרצה הכי טוב שהיה לי\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: היא מתרגלת מצוינת! הקצב שלה די מהיר אבל היא מאוד ברורה ומשקיעה את הזמן לענות על שאלות. בנוסף, היא מרגישה כמו אימא של הכיתה :)\n\nשעורי הבית: תעשו את שיעורי הבית, גם אם הם לא להגשה. הם די קשים אבל מאוד עוזרים להבנת החומר ותורמים מאוד להצלחה במבחן.\n\nהמבחן: המבחן די קשה. הסמסטר הוא היה קל יחסית לשנים קודמות. שאלת שיעורי הבית יותר קשה משאר השאלות ולכן יש לעשות את שיעורי הבית ולהבין אותם.\n\nהשורה התחתונה: קורס די קשה, אך הוא יכול להיות הרבה יותר קל אם משקיעים במהלך הסמסטר. רבקה מצוינת ואני הולך לתרגולים האחרים שלה.", "timestamp": 1647769378362}, {"author": "meseri asaf", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nדומות להרצאות של צנזור ביוטיוב, עם ניואנסים של אירנה. היא מרצה מעולה, ולמרות שהעבירה אותו פעם ראשונה היה ברור. לא תמיד הכי מסודרת אבל מפצה על זה בעזרה ומענה על כל השאלות.\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nהכי טובה בפער. מתרגלת שאלות ממבחנים/ברמה של מבחנים ומסבירה בצורה הכי ברורה שיש.\nשעורי הבית: \nגיליונות מזעזעים והרבה מעל הרמה של המבחן. וובוורקים שעוזרים להבנה\nהמבחן: \nמועד א שלנו היה איכשהו קל יחסית לבדרך כלל, אז היה בסדר.\nהשורה התחתונה: \nקורס חובה, תעשו אותו אם תרצו או לא.", "timestamp": 1647947551473}, {"author": "ירדן", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביב צנזור (ביוטיוב)\nחוות דעת - הרצאות: אין צורך להגיע לכיתה, אביב צנזור ביוטיוב x1.5 ואתם מסודרים\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: ללא ספק ה-מתרגל של אינפי. גם אותו אפשר לראות בהקלטות אבל אם רוצים לשאול שאלות, כדאי להגיע, הוא עונה בסבלנות ומסביר מעולה, שווה את זה.\nתמיד משקיע מעבר למה שנדרש ממנו כדי שהסטודנטים שלו יצליחו, כולל חזרות לקראת מבחנים. מומלץ בחום.\n\nשעורי הבית: כולם אומרים שהגיליונות יותר קלים מהמבחנים, האמת היא שזה לרוב לא נכון. תעשו את הגיליונות, תבינו אותם.\n\nהמבחן: הרבה עניין של מזל (ראה ערך מועד א' חורף 2022), אבל בכל מקרה מי שתרגל מספיק לאורך הסמסטר ולקראת המבחן, אמור להיות מסוגל להוציא ציון סבבה. \n\nהשורה התחתונה: העיקר לעבור ולהמשיך הלאה, יש מספיק קורסים יותר נחמדים שיפצו על ציון לא וואו, ולא כדאי להסתכן בחוזר. (אבל להגיע מוכנים לאינפי2 כי זה המשך ישיר)", "timestamp": 1648110514768}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מה שכולם אומרים. אין שני לו בלהסביר את החומר. הסרטונים ביוטיוב אחד לאחד ההרצאות וממש נוח לראות ככה או להשלים כשמפספסים.\n\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: בסדר גמור.\n\nשעורי הבית: לא ממש תורמים להבנת החומר בקורס. כדי לתרגל באמת כדאי לעשות את הגיליונות רשות.\n\nהמבחן: קשה, ממוצע נמוך. מי שילמד הרבה כנראה יצליח להוציא ציון טוב.\n\nהשורה התחתונה: קורס קשה אבל חובה אז בהצלחה :)", "timestamp": 1648492416598}, {"author": "Maor Levavi", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מסודרת, וסבלנית, יודעת להעביר את החומר היטב.\n\nשם המתרגל/ת: אחסאן עבד אל פתאח\nחוות דעת - תרגולים: מתרגל מצוין, מקצועי, יודע להטמיע את החומר בצורה טובה \n\nשעורי הבית: דורשים השקעה, מומלץ לעשות אותם על מנת להגיע מוכנים למבחן.\n\nהמבחן: קשה, מועדי ב' ו-ג' הם מועדים קשים יותר משמעותית ממועד א', מומלץ לעשות רק את מועד א' באינפי אלא אם נכשלת, מועדי ב' ו-ג' ידועים בכך שיש להם ממוצע נכשל\n\nהשורה התחתונה:", "timestamp": 1648719170110}, {"author": "ויצי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nצנזור מוקלט\nשם המתרגל/ת: \nצרגולים חשובים, אני הייתי עם טל בן יהודה \nחוות דעת - תרגולים: \nאחלה מתרגל , יש קצת הרבה אנשים אבל הוא ממש בסדר ועונה לשאלות.\nשעורי הבית: \nחשוב לתרגל !!\nהמבחן: \nלנו היה סבבה אבל בד\"כ יותר קשה\nהשורה התחתונה: \nצריך ללמוד הרבה ולהצליח", "timestamp": 1651216616669}, {"author": "תומר בירן", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: צנזור ביוטיוב/אירנה\nחוות דעת - הרצאות: לפני כל הרצאה ראיתי את צנזור על הילוך מהיר כדי לקבל רקע כללי ואז אצל אירנה הבנתי הכול לעומק. ממליץ לעשות ככה\n\nשם המתרגל/ת: אולג/אחסאן\nחוות דעת - תרגולים: שניהם אחלה, אוהבים לשתף את הכיתה בפתרון התרגילים\n\nשעורי הבית: מאוד מומלץ לעשות כדי להסתדר עם הקורס\n\nהמבחן: קשה. צריך ממש \"להיות על זה\" כדי להצליח ולכתוב הוכחות מדוייקות\n\nהשורה התחתונה: שיהיה בהצלחה :)", "timestamp": 1657180952220}, {"author": "Yotam Adar", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיכל קלרנשטיין\nחוות דעת - הרצאות: טובות , קצב סביר, מרצה נחמדה ונותנת יחס אישי\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: מעולים, מאוד עוזרים לסדר את החומר גם ברמה הפרקטית\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657182501846}, {"author": "אלמוג", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיכל קלירשנטיין\nחוות דעת - הרצאות: ה-מרצה בה הידיעה הכי טובה שהייתה לי בפער! חוזרת על הקורס ולהכתי להרצאות של מיכל. היא מצוינת, מעבירה את החומר בצורה ברורה, מתעקשת על ההבנה והשתתפות הסטודנטים בשיעורים, אכפת לה מאיתנו. הלוואי והיו עוד מרצות כמו מיכל בעולם.\n\nשם המתרגל/ת: טל בן יהודה מוקלט\nחוות דעת - תרגולים: מתרגל מצוין! נעזרתי ברשימות PDF שהוא מעלה וזה עזר לי מאוד\n\nשעורי הבית: הכרחיים להבנת החומר! לא לוותר עליהם\n\nהמבחן: \n\nהשורה התחתונה: מיכל גרמה לי להתאהב באינפי תודה מיכל", "timestamp": 1657730786643}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: הרצתה עם סבלנות ותמיד התעכבה שמשהו לא היה ברור. עונה על שאלות לפני/אחרי השיעור ובהפסקות. אווירה טובה ונעימה בשיעורים.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: רצה מהר מאוד על החומר, אבל מומלץ לבוא אליה לשעות קבלה כי היא מתקנת טעויות חשובות שהאחרים לא תמיד שמים לב אליהן. היא יודעת אינפי ברמה מאוד גבוהה, מרגיש שיותר משאר המתרגלים ואפילו המרצים.\n\nשעורי הבית: גליונות חובה להגשה בשביל ציון מגן. עמוס מאוד אבל כדאי לעשות.", "timestamp": 1657819174368}, {"author": "....", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \n\nהייתי עם רבייב רוב הסמסטר. בהרצאות הראשונות היה קצת קשה אבל עם הזמן התחלתי להתרגל. ההרצאות הלכו והצטמצמו למעט אנשים אבל לדעתי לא בצדק. דניאל מרצה מצוין ויודע ממש להביא אינטואיציה לחומר. בנוסף, הוא נחמד ביותר ויענה על כל מה שתשאלו.\nבגדול, לא הייתי כל כך מהר פורש לוידאו כמו שהמון אנשים בקורס עושים.\n\nשם המתרגל/ת:  אחסאן עבד אלפתח\nחוות דעת - תרגולים: \nאחסאן מתרגל מעולה, נותן דיי הרבה תרגילים ברמת קושי נבנית ומסביר הכל מצוין. דואג לשתף את כל הכיתה בפתרון ואף לתת לסטודנטים לנסות לפתור ומסביר כיצד צריך לגשת לתרגילים.\nמה שכן, התרגולים שלו יחסית עמוסים (אצלנו היו שתי קבוצות, אחת עמוסה ואחת עמוסה פחות, תשחקו עם זה)\n\nשעורי הבית: \nיש גיליונות באמת קשים שצריך לשבת ולשבור את הראש קצת, אבל לדעתי הם חלק בלתי נפרד מהצלחה בקורס. ברגע שהצלחתם להגיע לפתרון לבד יפלו לכם המון אסימונים. לכל גיליון יש שלושה שבועות אבל ממליץ לסיים קרוב למתי שמפרסמים, ככה תהיו באותו ראש עם מה שמלמדים באותו שבוע בהרצאות ובתרגולים. אותי זה הביא להצלחה בקורס.\n\nהמבחן: \nפתרתי מבחנים ויש קשים יותר וקשים פחות, אבל אין ספק שכולם דורשים יצירתיות. אצלנו המבחן היה דיי הוגן אז יצא עם ציון מעולה בקורס, אבל ברור לי שיש מבחנים שהייתי מוציא הרבה פחות. \nמה שכן אני לגמרי חושב שאפשרי להוציא ציון טוב בקורס הזה, עם הרבה השקעה.\n\nהשורה התחתונה: \nקורס קשה ומורכב, אבל לגמרי אפשרי. לא להוריד אף פעם רגל מהגז.", "timestamp": 1659021718514}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיכל \nחוות דעת - הרצאות: לא התחברתי. ממהרת ומבולגנת... למרות שהיא הכי טובה מבחינת היחס שהיא מקנה לכל סטודנט. הייתי מגיעה לשעות הקבלה שלה ושואלת הרבה ובאמת עזרה הרבה.   \n\nשם המתרגל/ת: יוליה, אולג\nחוות דעת - תרגולים: יוליה מצויינת אבל הייתה מהירה מדי בשבילי ופשוט לא הצלחתי לעקוב לכן עברתי לאולג ונהניתי מאוד. הייתי ממליצה ללכת ליוליה ולראות איך מסתדרים. אם לא מסתדרים אז לעבור לאחסאן או לאולג.\n\nשעורי הבית: לא חובה. קשים... לא להתעכב יותר מדי אבל כן לעשות אותם ולוודא שמבינים. \n\nהמבחן: מבחני מיכל בדרך כלל ממה שהבנתי קשים, אבל הסמסטר לא כל כך... המבחן היה הוגן יחסית לדעתי. \n\nהשורה התחתונה: קורס קשה. בסופו של דבר מתמודדים עם זה וכן אם משקיעים כמו שצריך משיגים ציונים גבוהים. לא להתייאש. לשאול כל הזמן ולכת לשעות הקבלה. אין ברירה כי הוא קורס חובה...", "timestamp": 1660317613138}, {"author": "גיא דוידוביץ'", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: מעביר את החומר בצורה יבשה, במקצוע שהוא כבר יבש מאוד.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה את התרגילים היטב ונותנת שלבים מדויקים לפתרון.\n\nשעורי הבית: לא חובה\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660727695083}, {"author": "Matan", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: קליינשטרן מיכל\nחוות דעת - הרצאות: מיכל מרצה מהממממת נקודה.\nאכפת לה מכולם , מוכנה לחזור על מה שהיא אמרה 10 פעמים אבל הכי חשוב אצלה זה שכולם יבינו\n\nשם המתרגל/ת: אחסאן עבד אלפתאח\nחוות דעת - תרגולים: אחסאן מתרגל ברמת ליגת אלופות באמת, פשוט אין עליו , ה \"ט\" שלו מעולם אחר :)\n\nשעורי הבית: יש הבדל עצום בין רמת שאלות שיעורי הבית ובין המבחן\nאם לא כל כך הסתדרתם בשיעורי בית זה לא אומר שאתם לא הולכים להפציץ במבחן\n\nהמבחן: המבחן היה הוגן , סביר, רמה בינונית\n\nהשורה התחתונה: זה קורס עמוס כן ואולי קצת קשה , אל ניתן להביא ציון טוב מאוד", "timestamp": 1664045681789}, {"author": "Omer Oz", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: אירנה מרצה מדהימה!!! נותנת זמן לשאלות ומוודאת שכולם מבינים חומר לפני שעוברת הלאה.\nמומלץ להגיע אליה לשעות הקבלה שם נותנת יחס אישי ומענה לכל שאלה.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nבמהלך הסמסטר היה לי חשוב להגיע לתרגולים של יוליה כי היא הכי חדה ומספיקה הכי הרבה תרגילים, בדיעבד היא רצה על הכל ולא מחכה לראות מי עוד איתה ולכן מספיקה הכי הרבה, לא מומלץ אם לא חדים מאוד על החומר.\nשעורי הבית: \nלא פשוטים אבל חשוב מאוד לעשות אותם לבד!!! לרפרנס רק אחרי שבאמת באמת לא רואים קצה חוט וגם אז עדיף לבקש כיוון מחבר לפני או להגיע לשעת קבלה.\nהמבחן: \nהמבחן של מיכל היה מאוד הוגן ומי שהיה על החומר יכל להוציא ציון מעולה\nהשורה התחתונה: \nדי שוק בהתחלה וצריך להתרגל לחשיבה ולחומר אבל מעניין", "timestamp": 1665841687728}, {"author": "גלי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: אני ממש אהבתי את ההרצאות של מיכל. לדעתי היא מעבירה את החומר בצורה טובה, לא פחות מהמוקלטים של צנזור. נותנת להשתתף הרבה ולשאול שאלות מתי שרוצים, ונותנת גם יחס אישי שזה תמיד נחמד וכיף. בקיצור אין על מיכל היא מקסימה ואני מאוד ממליצה.\n\nשם המתרגל/ת: אולג \nחוות דעת - תרגולים: אולג מתרגל ממש סבבה, פותר הרבה תרגילים ברמה גבוהה ומספיק די הרבה כל תרגול.\n\nשעורי הבית: מרגישים די קשים רוב הזמן, העדפתי לא להיתקע על מה שלא ידעתי ולרפרנס. מה שכן- לפני המבחן ממש ממש כדאי לעבור על הגיליונות ולזכור את הפתרונות כי תופיע שאלה אחת כזו והיא מגן ושווה להצליח.\n\nהמבחן: חרא של דבר, קשה ממש ומועד ב היה אפילו יותר קשה. ממליצה לפתור כמה שיותר מבחנים כי רעיונות לפעמים חוזרים על עצמם, אבל גם להיות מוכנים לאלתר, דורש מלא יצירתיות וזיכרון...\n\nהשורה התחתונה: אהבתי את הקורס, היה מעניין וכיף עם מיכל, אבל המבחן חרא ומעצבן ממש וזה די הורס את החוויה.", "timestamp": 1667159846138}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביב צנזור\n\nחוות דעת - הרצאות: \nאביב מרצה מעולה ומקצועי מאוד. הנסיון שלו בהוראה מורגש מאוד במהלך השיעור. הוא יודע לתת את הדוגמאות שעונות על רוב השאלות עוד לפני שנשאלו וב90 אחוז מהמקרים הרגשתי שיצאתי מההרצאה כאשר אני מבין את החומר הנלמד (את הרובד התיאורטי לפחות).\nאבל כאשר עולה שאלה מאוד קשה לתפוס את תשומת ליבו בין אם כי הכיתה גדולה ובין אם כי יש לו העדפות לסטודנטים קבועים. הרבה פעמים גם כשכבר נותן את זכות הדיבור הוא קוטל סטודנט אם לא נימק את שאלתו או הצעתו כראוי בצורה קצת מבזה, אחרי הכל המטרה שלו צריכה להיות לדעתי לעורר בנו את הרצון להשתתף ולא להפחיד. גם בשעות הקבלה שמגיעים במיוחד כדי לשאול אותו הוא לפעמים פשוט מחליט לפסוח על סטודנטים כי בשולחן שהם לומדים בו מישהו אחר כבר שאל אותו שאלה ויש עומס. \nבשורה התחתונה- מקצועיות- 10 יחסי אנוש- 3\n\nשם המתרגל/ת: אפרת אבירם\n\nחוות דעת - תרגולים: \nאין על אפרת!\nהלוח תמיד מאורגן והתרגילים מפילים את כל האסימונים.\nלפעמים קצת נראה שלא מרגישה בנוח עם שאלות מהסטודנטים ועונה לא במדוייק על מה שנשאל, אולי בגלל לחץ להספיק יותר תרגילים. \nבשורה התחתונה מומלצת מאוד\n\nשעורי הבית: \nהגליונות קשים, יותר מהרמה הנלמדת בקורס. זה בסדר פשוט לא כדי להתעקש עליהם יותר מידיי. אם לא הולך עדיף ללכת לסדנא ולבקש רמז. \nהם לא בודקים אותם אז בכללי מאוד ממליץ להגיע לשעות קבלה ולסדנאות ולבקש כמה שיותר שיעברו על התשובות כדי לקבל משוב כלשהו\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1674326325043}, {"author": "me", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  צנזור + יוטיוב\nחוות דעת - הרצאות: \nהרצאות מצוינות, ממליצה להגיע כי אישית שיקרתי לעצמי שאשלים ביוטיוב ולא תמיד זה קרה...\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nרצה קצת מהר עם החומר, אבל מאוד חריפה, חכמה וזורקת בדיחות פה ושם\nשעורי הבית: \nקשים\n\nהשורה התחתונה: \n\nלהשקיע בקורס מהדקה הראשונה ולהשתדל להיות בקצב", "timestamp": 1675531789852}, {"author": "יועד המיוחד", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הלכתי בתחילת שנה, כיף עם צנזור אבל כשהסמסטר נהיה יותר עמוס, לי אישית היה יותר נוח לעבור למוקלטות.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מלכה👑. אפרת מסבירה מושלם ועושה חזרה קצרה על החומר לרוב ורק אז מתחילה לפתור תרגילים.\n\nשעורי הבית: \nממש חשוב לעשות או לפחות לנסות לבד. כדאי גם במהלך הסמסטר להוכיח לבד מה שצנזור ממליץ להוכיח מאוד מכין למבחן \n\nהמבחן: \nדי הוגן צריך לחזור על מבחנים משנים אחרונות עדיף בסמסטר שתואם לסמסטר שלך. שווה להתכונן לפחות 4 ימים ולעשות בעיקר מבחנים אבל גם לראות שיודעים את ההוכחות של הכל ושהחומר התיאורטי יושב טוב.\n\nהשורה התחתונה: \nקורס טוב שעושה סיפתח נחמד ללימודים בטכניון. זה קורס כבד עם הרבה שיעורים אבל הוא מכניס לmindset של פתרון תרגילים בצורה אקדמית וחשיבה טובה.", "timestamp": 1675610837623}, {"author": "טלאל", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור - מוקלט\nחוות דעת - הרצאות: \nהקלטות מעולות, דומה 1-1 להרצאות השנה.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל מעולה מאוד, אבל מאוד איטי ומסביר מאוד למי שלא מבין, זה טוב כמוב אך לא השתלם לי ככה, אז ויתרתי על נוכחות בתרגולים ופשוט התחלתי ללמוד מהסיכומים שלו, סיכומים מדהימים מאוד, מסביר בהם את החומר בצורה צעולה, וגם לכל שאלה הוא מסביר טוב את השאלה, רעיון הפתרון (אינטואיציה) ואת הפטרון עצמו. מאוד ממליץ. \n\nשעורי הבית: \nהיו קשות ברמות, מזל שהם לא בודקים אותם.\nהעתקתי רובם מרפרנס וכשהגשתי 8 הפסקתי.\n\n\nהמבחן: \nהיה מוגן למי שלמד טוב, לא קשה ברמות אך גם לא קליל. פשוט אם למדת כמו שצריך יהיה בסדר.\n\nהשורה התחתונה: \nקורס לא כל, צריך להיות תמיד מסודר, אבל ניתן.", "timestamp": 1675689466262}, {"author": "..", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nאפרת מתרגלת מדהימה, מומלצת בחום\nשעורי הבית: \nכל שבוע וובוורק וגיליון מומלץ להתחיל מהוובוורק שהוא יותר טכני ואז לעבור לגיליו.ן מומלץ לעשות את כל הגליונות במיוחד את האחרונים כי בדרך כלל השאלות בגליונות הן מבחני עבר וזה תרגול טוב \nהמבחן: \nמועד א היה הוגן, לעשות הרבה מבחני עבר ושיהיה בסדר\nהשורה התחתונה: \nקורס חובה", "timestamp": 1675753729034}, {"author": ",,,,,", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיכל\\צינזור\nחוות דעת - הרצאות: \nבתחילת הסמסטר הייתי אצל מיכל ובאמצע הסמסטר עברתי לצינזור, מיכל מרצה מאוד טובה היא נותנת יחס ומסבירה די טוב, אבל לפעמים היא קופצת ממשו למשו וזה מאבד את הריכוז.\nצינזור מרצה מעולה רואים שיש לו התנסות בהוראה הוא מעביר את ההרצאה בצורה כיפית, עונה על כל שאלות, מסביר מאוד טוב ואפילו מסדר לכם את כל החומר בראש, בקיצור הוא אחלה של מרצה. \n\nשם המתרגל/ת: יוליה\\אפרת \nחוות דעת - תרגולים: בתחילת הסמסטר הייתי אצל יוליה היא מאוד חדה על החומר ורצה די מהר, מי שלא בקצב עם ההרצאות ומבין את החומר כמו שצריך אז יוליה לא הכתובת.\nבאמצע הסמסטר עברתי לאפרת היא אחלה של מתרגלת אנרגטית מסבירה טוב מאוד, היא נותנת כיוונים איך לגשת לשאלה ולא להתחיל לפתור דוך, בסוף הסמסטר היא התחילה לרוץ על כל החומר (כדי להספיק) וזה קצת הפריע לי איפשהו שם, אבל אפשרי להתמודד עם זה. \n\n\nשעורי הבית: קצת עמוס כל שבוע גליון אחד ולפחות שאלה אחת בכל גליון ממש קשה שצריכה הבנה עמוקה בחומר\n\nהמבחן: מועד א' היה די הוגן לא קשה ולא קל מי שלא מצליח את השיעורי בית זה לא אומר שהוא לא יצליח במבחן אבל חשוב לפתור את כל שיעורי הבית כי מביאים מהם שאלה במבחן. \n\nהשורה התחתונה: קורס מאתגר בהתחלה קצת קשה אבל בסוף מתרגלים לרמת הקושי", "timestamp": 1675770364160}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל + צנזור מוקלט\nחוות דעת - הרצאות: \nמיכל סה\"כ מרצה טובה, עונה לשאלות ורואים שאכפת לה מהסטודנטים ושיש לה אהבה לנושאים שהיא מלמדת אבל היא רצה ממש מהר. בתחילת הסמסטר החומר לא קשה מדי, באמצע הסמסטר כבר התחלתי לראות את ההקלטות של צנזור לפני ההרצאות, כי אחרת לא הבנתי שום דבר ממה שאני רושם בזמן ההרצאה. בכל זאת לא הצלחתי לעקוב אחרי ההרצאות אז התחלתי גם לכתוב בזמן שאני רואה את המוקלט ובהרצאות רק להקשיב. למי שמבין את החומר ממש טוב ויכול לכתוב ולהקשיב בו זמנית לא תהיה את הבעיה הזאת, אבל אני לא יכול.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מומלצת מאוד!!\nהכיתה אצלה עמוסה, ובצדק. הלכתי לתרגולים שלה גם באלגברה וגם באינפי, מסבירה כל תרגיל ממש טוב לפני שהיא מתחילה לפתור, וגם בזמן הפתרון אם צריך. אנרגטית מאוד, לכן בלתי אפשרי להשתעמם איתה. היא פותרת פחות תרגילים ממתרגלים אחרים אבל התרגילים שהיא כן פותרת, היא מתעמקת בהם ממש, ומשאירה זמן לשאלות. לדעתי זה עדיף מלפתור מלא תרגילים בלי להתעמק באף אחד מהם.\n\nשעורי הבית: \nכל שבוע webwork וגליון, והגליונות דיי קשים. יש תרגילים שאפשר לפתור לבד ויש תרגילים שחייב רפרנס או לשאול בקבוצה בוואטסאפ או בסדנה, כי קשה לעלות על הפתרון לבד.\n\nהמבחן: \nהרגשתי שאני לא הכי מוכן למבחן מועד א', אבל בכל זאת יצאתי ממנו עם בטחון שהצלחתי. הרבה מהשאלות כמעט זהות למבחנים שכבר פתרתי, והשאלות שלא, לא היו קשות במיוחד. ההרגשה שהמבחן יותר קל ממבחנים קודמים, אבל אולי זה רק בגלל שהתרגילים חזרו על עצמם.\n\nהשורה התחתונה: \nקורס מאתגר מאוד, צריך להתרגל לשפה של האפסילונים בהתחלה של הקורס, ולקראת המבחן לפתור כמה שיותר מבחנים כדי לא לקבל תרגילים מפתיאים במבחן.", "timestamp": 1675788549623}, {"author": "אנונימי‬‎", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: צנזור זה צנזור, לא צריך לומר יותר מזה.\nבחודש חודשיים הראשונים צריך להגיע מוקדם לתפוס מקום (אפילו 40 דקות לפני) אחרי זה זה מתחלק למי שסבבה לו לקום מוקדם ולמי שמעדיף לראות מוקלט,  בעיני אין יותר טוב מפרונטלי אבל המוקלט מעולה\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אין על אפרת, עמוס מאוד בכיתה\n\nשעורי הבית: הגליונות לקוחים הרבה פעמים משאלות עבר של מבחנים (גיליתי שלמדתי למבחן )  אז אפשר לרפרנס, טוב מאוד כדי לפתח אינטואיציה והרבה פעמים מאוד מתקשר לתרגולים חובה לעשות!\nהוובוורקים עוזרים ללמוד איך לעשות את הדברים היותר טכנים ולמרות שזה נראה חלק לא מרכזי ככ זה מאוד חשוב\n\nהמבחן: היה הוגן.\n\nהשורה התחתונה: קורס קשה, דורש הרבה מאוד השקעה, אבל גם מאוד מעניין ומלמד הרבה יותר מאיך לגזור פונקציה", "timestamp": 1675888948264}, {"author": "OBL", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nנאמר כבר הכל. מלמד את החומר מצויין, בהקלטות ובפרונטאלי שאני אישית נהנתי ממנו מאד (למרות הדימיון הרב להלקטות).\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: \nאירנה פותרת תרגילים בשרשרת על הלוח. הקצב מאד מאד מהיר.\nמצד אחד - רואים מגוון מאד רחב של שאלות בתרגול, כמעט אין סגנון שאלה שלא ראינו.\nמצד שני - לא מתעמקים באף נושא. למי שמרגיש שזה חסר לא מההרצאות יכול להיות בעייתי. אני לא הרגשתי ככה והיה לי מעולה\n\nשעורי הבית: \nגיליון + WW כל שבוע, קשה ועמוס מאד. את הגיליונות לא בודקים שזה חבל, אבל מפרסמים פתרון מלא.\nבעיקרון לא מקבלים מהשיעורי בית כמעט כלום (קצת מגן, ואת הגיליונות ממש אפשר לחפף), אבל מומלץ מאד לעשות אותם ברצינות כי אחרת מאד קשה בקרוס.\n\nהמבחן: \nבסמסטר שלנו היה לחלוטין הוגן והתכתב עם החומר מההרצאות והתרגולים, בלי הפתעות והברקות\n\nהשורה התחתונה: \nאחד הקשים של סמסטר א'. זה קורס של הבנה, אז חשוב להשקיע, ללכת לשעות קבלה ולוודא כל הזמן שהחומר יושב", "timestamp": 1675954739075}, {"author": "anonymous", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דר. אביב צנזור \nחוות דעת - הרצאות: זה פשוט אחד על אחד מהמוקלט עד כדי כך אותם בדיחות ואותו תזמון \nעדיף לראות מוקלט \n\nשם המתרגל/ת: אחסן\nחוות דעת - תרגולים: אחסן הוא אחד המתרגלים הטובים ביותר \nבמיוחד לסמסטר א הוא מלמד בקצב מושלם ואף פעם לא עובר נושא אם יש לו ספק שמישהו לא הבין \nהייתי בהתחלה אצל רבקה היא מהירה מדי להיה מקרה שהעבירה חומר בתרגול לפני שנלמד בהרצאה \n\n\nשעורי הבית: שעורי הבית היו לא קלים ובהתחלה הרגשתי רע שנעזרתי ברפרנס אך זה לגטימי לגמרי לדעתי זה סבבה להיעזר ברפרנס ל 3 הגליונות הראשונים בשביל להבין איך בכלל פותרים \n\nהמבחן: קשה לדעתי אך הוגן, לא היה הרבה זמן להתקונן \n\nהשורה התחתונה: צנזור במוקלט ואחסן בתרגולים זה שילוב מנצח", "timestamp": 1676011062074}, {"author": "סבל", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ד״ר מיכל קליינשטרן\nחוות דעת - הרצאות: \nמרצה נהדרת, מסבירה את החומר נהדר, וממש גורמת להבין אותו. ההרצאות אצלה יחסית קטנות מה שגורם לתחושה של יחס אישי, למי שאוהב. ההרצאות יכולות להיות קשות אז כן כדאי לשים לב שאתם על החומר וכן ללכת להרצאות. החומר בקורס מאוד בנוי אחד על השני אז להיות עליו.\n\nשם המתרגל/ת: גב. רבקה אביטל\nחוות דעת - תרגולים: \nאין מה להגיד, מתרגלת מדהימה, היא מאוד מהירה אז צריך לקלוט מהר אבל אם היא מתאימה לכם אז תלכו, מראה מלא תרגילים אפילו משיעורי הבית, וזה בול מה שצריך בקורס הזה. אפילו אם אתם לא איתה כדאי לעבור על התרגולים שלה לפני המבחן, מומלצת מאוד!\nשעורי הבית: \nנוראים כמו המבחן, צריך להשקיע כמה שעות לפני שמתחילים לפתור רק בלחשוב על הפתרון, חלק מהשאלות פשוט נפתרו על ידי כל התלמידים ביחד, במיוחד בהתחלה, וגם לא בדקו אף אחד מהשיעורים הסמסטר, אז אפילו לא קיבלת איזשהי ביקורת, מה שכן העלו פתרונות אז כדאי לעבור עליהם אחרי ולהבין. למרות שהם קשים וגוזלי זמן, שיעורי הבית הם העיקר וכדאי באמת לנסות לפתור ולא לרפרנס.\nיש בנוסף וובוורקים, שמרגישים קצת מנותקים מהקורס, הם בעיקר פשוט תרגול יבש של החומר וחזרה על התרגיל הראשון בכל תרגול רק בכמויות.\nגם היתה מטלה להכין חדר בריחה במהלך הקורס, שהרגישה יותר כמו מטלה בתיכון מאשר משהו שעוזר להבין את החומר.\nהמבחן: \nכמו כל מבחן באינפי, קשה בלי סיבה, ומתמקד בחלקים איזוטריים בחומר שאיכשהו חוזרים כל שנה. כמעט כל שנה דורשים הוכחה של משפט כלשהו אז לשים לב. השאלות הסגורות לא באמת סגורות, והשנה עשו שם טעות שלא הייתה דרך לתקן מה שבלבל הרבה אנשים. פשוט צריך לפתור כמה שיותר ולקוות לטוב.\nהשורה התחתונה: \nקורס קשה, ודי מיותר בשביל מי שלומד אותו. היתרון האמיתי שלו הוא פרמול של החשיבה שיכול לעזור אבל סה״כ זה סתם קורס שנועד להפחיד יותר מכל דבר אחר. אבל תנסו לאהוב אותו כי זה עדיף מהאופציה האחרת.", "timestamp": 1676045511693}, {"author": "Gg", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nאין על מיכל, מתחשבת ואכפתית כלפי הסטודנטים מסבירה מעולה ורואים שיש לה הרבה אהבה למקצוע.\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל מתרגל מעולה, מסביר דברים מאוד פרקטיים למבחן אבל בקצב מאוד איטי, היו הרבה תרגולי השלמה ולא הספקנו את החומר.\nשעורי הבית: \nקשים אך עוזרים\nהמבחן: \nקשה אך הוגן לרוב\nהשורה התחתונה: קורס קשה לא להזניח במהלך הסמסטר", "timestamp": 1676213638986}, {"author": "*", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור (לרוב מוקלט)\nחוות דעת - הרצאות: \nצנזור מרצה ממש מעולה, הוא מעביר את החומר בצורה ברורה ומעניינת. אני העדפתי לראות מוקלט כי זה אחד לאחד (גם הוא אומר) ויכולתי ככה לרוץ על הנקודות הקלות ולהתעכב על מה שקשה.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: \nתרגולים לא פשוטים, הרבה פעמים היישום של אינפי לתרגילים קשה יותר מלהבין את החומר עצמו. אבל אירנה מקסימה, משתפת את הכיתה  בכיווני המחשבה ועשתה הרבה תרגילים שעזרו לי בשיעורי הבית.\n\nשעורי הבית: \nיש webwork וגליון כל שבוע. הוובוורקים לרוב קלילים יותר אבל הגליונות ממש קשים, במיוחד החל מהחצי של הקורס בערך. בכל זאת חשוב בעיניי להתעקש להבין אותם. אני הלכתי לסדנה כמעט כל שבוע כדי להצליח לסיים.\nמקבלים אפס פידבק על הגליונות שזה בעייתי.\n\nהמבחן: \nיותר קל משיעורי הבית. אם עושים הרבה מבחנים לפני לאט לאט תופסים את הקונספטים. אבל אם מקדישים את הימים שלפני להשלים פערים מהסמסטר אז אין הרבה סיכוי לדעתי להצליח.\n\nהשורה התחתונה: קשה ועמוס בטירוף אבל גם מעניין. הסגל טוב.", "timestamp": 1676287014370}, {"author": "liaaa", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל מאוד מעניינת בהרצאות שלה אבל נוטה לפעמים להיות קצת  מבולגנת. אני בלמידה לקראת המבחן גם נשענתי על המוקלטים של צנזור\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אפרת מתוקה ולא היה פעם אחת שלא הבנתי מה עשתה בתרגיל מסויים. היא כל כך ברורה. חסרון אצלה זה שיש הרבה רעש בשיעורים והיא גם יותר איטית ממתרגלים אחרים (למרות שבשבילי זה יתרון:)\n\nשעורי הבית: היה קשוח, חשוב מאוד לנסות לבד אפילו אם אתם מוצאים את עצמכם יושבים על גליון כמה שעות טובות. ברגע שראיתם את הרפרנס הרסתם לעצמכם. אני ממליצה לנסות ללכת לשעות קבלה או לנסות לקבל רמז קטן ככל האפשר מחברים לקורס.\n\nהמבחן: היה הוגן סה\"כ. \n\nהשורה התחתונה: קורס לא כיפי אבל עוברים אותו בסוף... צנזור מאוד אוהב להלחיץ על כמה שזה הקורס \"הכי קשה בטכניון\".... בולשיט. זה סתם שוק, ואתם תעברו את זה:)", "timestamp": 1676377595561}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: צנזור פרונטלי/מוקלט\nחוות דעת - הרצאות: \nאין טעם ללכת להרצאות פרונטליות. עברתי למוקלט לקראת אמצע סמסטר נטו כי חששתי. למי שיש משמעת עצמית ממליץ לראות אך ורק מהמוקלט (זהה אחד לאחד לצנזור פרונטלי עד לרמת הבדיחות).\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: \nמתרגל מצוין ובין הטובים שיצא לי לראות בסמסטר א'. תרגולים עמוסים מאוד אז חייבים להגיע לפני כדי לתפוס מקום.\nשעורי הבית: \nברמה גבוהה. עמוסים. ממליץ לנסות לבד ולהעזר כמה שיותר בשעות קבלה וסדנאות. לא להיתקע על גליונות-אם לא מצליחים לשאול חבר/מתרגל וכו'\nהמבחן: \nקשה\nבמהלך הסמסטר לנהל רשימת משפטים ולשנן\nללמוד הוכחות משפטים ולתרגל כמה שיותר מבחני עבר\nהשורה התחתונה: \nקורס קשה ועמוס", "timestamp": 1676489323429}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: אין מה להגיד על צנזור ..\nבתחילת הסמסטר הלכתי פיזית להרצאות אבל לבסוף ציפיתי במוקלט זה ממש 1:1 כולל הבדיחות אפילו:) \n\nשם המתרגל/ת: ארינה\nחוות דעת - תרגולים: אירנה מדהימה היא קצת ממהרת אבל אפשר להתמודד איתה, הלכתי לאחסאן ורבקה פעמיים ולדעתי אירנה יותר טובה היא מספירה ממש טוב והתרגילים רלוונטיים לרמת המבחן והגליונות וגם יש אווירה כיפית בתרגולום שלה \nתכלס ..ממליצה בחום!\n\nשעורי הבית: קשים אבל לא בלתי פתירים ממליצה ללכת לשעות קבלה ולסדנאות ולהתייעץ עם חברים ,תנסו לפתור בעצמכם כי זה יעזור בזמן הלמידה למבחן וזה ייתן PUSH לכם בסמסטר  \n\nהמבחן: היה די הוגן צריך ללמוד טוב ולהשקיע זמן ומאמץ רב ובסופו של דבר  תעברו אותו \nממש חשוב להיות במעקב ולהטמע החומר לפני שפותרים מבחנים קודמים\n\nהשורה התחתונה: אין ספק שזה קורס קשה אבל זה לא בלתי אפשרי לקבל ציון גבוה אך צריך לעקוב ולשאול ולהשקיע וגם להנות כי זה קורס ממש כיפי:)) בהצלחה!", "timestamp": 1676566343910}, {"author": "Lior", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות:\nמיכל מרצה מעולה, תמיד פתוחה לשאלות ולחזור שוב אם משהו לא מובן.\nמרגישים שהיא אוהבת את המקצוע ואוהבת ללמד גם, ושאכפת לה מהסטודנטים.\n\nשם המתרגל/ת: אפרת/טל\nחוות דעת - תרגולים: \nאם אפרת מתרגלת את הקורס, חייבים ללכת אליה. אני הייתי אצל אפרת שעה אחת מתוך השלוש, אבל באמת שווה ללכת אליה. היא ממש נכנסת לעומק של התרגילים ומסבירה למה היא בחרה לפתור בדרך מסויימת. אחרי התרגול הגיליונות והוובוורקים מרגישים הרבה יותר סבבה.\n\nטל בדרך כלל בתחילת כל תרגול עושה תזכורת קצרה לחומר, ולפני כל תרגיל מסביר את האינטואיציה שמאחורי הפתרון. זה היה לי טוב בתחילת הקורס כשהייתי צריך את התגבור הזה להבנה, אבל לקראת הסוף זה הרגיש לי קצת איטי מדי ומשעמם. אם אתם חזקים בחומר ורק רוצים לפתור כמה שיותר תרגילים הייתי ממליץ ללכת למישהו אחר.\n\nשעורי הבית: הגיליונות קשים, אבל שווה להשקיע ולנסות לפתור לבד, אבל לא לשבור את הראש שעות. אני בדרך כלל פתרתי ביחד עם חברים ואז יש יותר רעיונות איך לגשת לתרגילים ועזרה בנקודות קטנות שלא מובנות עד הסוף.\n\nהוובוורקים לרוב די קלילים, כדאי לעשות כדי לקבל מגן וגם כדי שהדברים היותר טכניים ויבשים ישבו פיקס. עוזר גם לפתח אינטואיציה טובה שתמיד עוזרת.\n\nהמבחן: \nהמבחן היה הוגן מאוד, לדעתי קצת יותר קל משנים קודמות. אם משקיעים בגיליונות במהלך הסמסטר ונשארים על החומר, אני חושב שמספיק נטו לתרגל מבחנים בשביל להוציא ציון טוב. אני עשיתי 10-15 מבחנים במשך 5 ימים בערך והרגשתי שהגעתי מוכן.\n\nהשורה התחתונה: \nקורס לא פשוט, אבל מעניין וחשוב לדעתי.", "timestamp": 1676726402427}, {"author": "Shahar", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמיכל מרצה מעולה, נותנת יחס אישי ורואים עליה שהיא מאוד אוהבת את החומר. \nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nמפרסם סיכומים מסודרים ומושקעים עם תרגילים ופתרונות ומשתדל להסביר כמה שאפשר על ההגדרות בצורה שגורמת באמת להבין אותן לעומק.\nשעורי הבית: \nקשים ונישתיים יחסית, בסמסטר שלנו רובם היו תרגילים חדשים שמיכל כתבה אז גם לא היו להם רפרנסים.\nהמבחן: הוגן מאוד\nהשורה התחתונה: קורס מאתגר אבל מאוד מעניין, חשוב להבין לעומק את המשמעות של ההגדרות ולא סתם לשנן משפטים והוכחות.", "timestamp": 1676757812138}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיכל קליינשטיין\nחוות דעת - הרצאות: מיכל מאוד נחמדה ונותנת יחס אישי לתלמידים. מיכל סבלנית ומשתדלת ללמד ולהסביר בצורה אינטואיטיבית ככל האפשר ובצורה כזו שנבין כמה שיותר את המשמעות של הדברים.", "timestamp": 1677074140782}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: ראיתי ביוטיוב, לא רואה ערך לקום מוקדם בבוקר ולראות את אותו דבר בלייב (צריך אבל לשים לב שאתם על זה תוך כדי הסמסטר)\n\nשם המתרגל/ת: אילן יונה\nחוות דעת - תרגולים: אדם נחמד ומתרגל טוב. מתעסק בתכלס ומראה איך מתמודדים עם תרגילים.  ממליץ.\n\nשעורי הבית: לא פשוט אבל גם לא כזה מורכב\n\nהמבחן: לא פשוט. לא מהמבחנים שאפשר להזכר בהם שבוע לפני\n\nהשורה התחתונה: הלוואי שהיו מגיעים לתכלס יותר מהר ולא נתקעים חצי סמסטר על סדרות (כבודן במקומן מונח)", "timestamp": 1677566451924}, {"author": "JM", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביב צנזור\n\nחוות דעת - הרצאות: אביב מרצה מעולה, מסביר את החומר  באופן מסודר מאוד וברור.( לפעמים הוא נותן שאלות לתרגול עצמי, ממליץ בחום לנסות לפתור, השנה הוא הביא שתי שאלות במבחן מהתרגילים שהוא נותן).\n \n\nשם המתרגל/ת: יוליה the one and only\nחוות דעת - תרגולים: אין על יוליה, היא מתרגלת מעולה, תמיד מסבירה כשיש אי הבנה בחומר, נותנת טיפים טובים לאיך לגשת לתרגילי הבית ופותרת כמות מכובדת של תרגילים.\nצריך להיות על החומר כל הסמסטר כדי לא לאבד אותה, הקצב שלה היה מעולה לטעמי.\nחוץ מזה כיף אח'ושילינג בתרגולים שלה. \nשעורי הבית: ממליץ לנסות לפתור את הכל לבד, הם חזרה טובה לחומר שנלמד בשבוע, לדעתי רוב הש''ב היו קצת יותר קשים מהמבחן ובעיניי זה מעולה.\n\nהמבחן: לדעתי המבחן היה הוגן מאוד, כמעט כל השאלות ראיתי במבחנים משנים קודמות.\n\nהשורה התחתונה: קורס כייפי מאוד, דורש השקעה, צריך לתת לו chunk טוב של זמן במהלך השבועת אבל בסוף זה משתלם.", "timestamp": 1677606812753}, {"author": "מ ר", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: צנזור קצת אוברייטד. היתרון הכי גדול שלו הוא הרהיטות לדעתי. אבל היה לי קשה ממש לשבת אצלו בכיתה, גם בגלל שהיה קשה למצוא מקום וההרצאות היו מלוות בהרבה כאבי עיניים וגם בגלל שזה בלתי אפשרי כמעט לשאול במהלך ההרצאה שאלות. אין תחושה של נוחות בהרצאות בקיצור.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת נהדרת. תמיד אפשר לסמוך עליה שתדע להעביר את החומר בצורה מובנת. קצת עמוס אצלה בכיתה גם, מוזר שלא נותנים לה כיתה גדולה יותר.\n\nשעורי הבית: אוי ווי. גיליון פעם בשבוע וחצי בערך + וובוורק כל שבוע אם אני לא טועה. הוובוורקים עוד בסדר פחות או יותר, אבל הגיליונות ממש מאתגרים. כן שווה בכל זאת לנסות לפתור אותם כמה שיותר בשביל תרגול, אבל אני בשלב מסוים הפסקתי כי זה העמיס עליי יותר מדי. זה גם תלוי אבל ביכולת שלכם לשבת ללמוד, כי אחרי שעברתי עכשיו את סמסטר א' אני יודעת שהייתי עושה דברים אחרת ומצליחה עם שיעורי הבית יותר (לא מבחינת לדעת את החומר אלא מבחינת ניהול הלמידה).\n\nהמבחן: היה די הוגן אבל קשה. כמו כל המבחנים הקודמים נראה לי.\n\nהשורה התחתונה: אוי", "timestamp": 1677699825143}, {"author": "Adam Liberov", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אביב צנזור המלך, המלך הבלתי מעורער של אינפי רק צנזור , מרצה נפלא פשוט גבר כיף להיות בהרצאות שלו\nחוות דעת - הרצאות: חומר די מעניין הבעיה שאצל צנזור די עמוס אז צריך לבוא מוקדם כדי לתפוס מקום\n\nשם המתרגל/ת: טל בן יהודה ואילן יונה\nחוות דעת - תרגולים: טל בן יהודה - מסביר די טוב ומעלה את סיכומי התרגול לטימס ובכללי ממש נחמד ממליץ, אילן יונה - גבר רצח מסביר מעולה ובכללי אחלה מתרגל\n\nשעורי הבית: גליונות פעם בשבוע כ 4 - 5 תרגילים די קשים בדרך כלל, לא חובה לעשות אבל מומלץ כי זה עוזר להטמעת החומר באופן טוב.\n\nהמבחן: מועד א ו ב די סבירים, מי שלמד טוב יצליח בהחלט \n\nהשורה התחתונה: קורס מעניין , חובה להשקיע כל הסמסטר כדי להצליח", "timestamp": 1678286585285}, {"author": "Bob", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:צנזור \nצנזור זה צנזור העדפה ראשונה באינפי 1מ\nההרצאות הפרונטליות והמוקלטת שלו הן אחד לאחד אפילו משתעל בדיוק באותה שניה שהשתעל במוקלט כדאי לרוץ על 10 ההקלטות הראשונות לפני שמתחילים את הסמסטר זה ייתן לכם יתרון לאורך כל הסמסטר ותשארו בעניינים אך לשים לב שהנושאים יושבים טוב במידה ומשהו לא ישב לכם טוב זה יכול לבלבל אתכם לכן זו המלצה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nנטו אחסאן הוא מעורב בכל מה שקורה בקורס כבר שנים נותן המון טיפים לגבי המבחן ואופן הפתרון והפרמול שזה החלק המאתגר במבחן (פרמול)דבר שמתרגלים אחרים פחות מתייחסים אליו הוא מריץ מסה של תרגילים ודואג שכל מי שיושב בכיתה לא מעט פעמים מקשר בין שאלות מתרגול למבחן ומחזק את ההבנה בעיקר \nשעורי הבית: \nשיעורי בית שווים את ההשקעה  לא להגיד\"את זה אני אבין אחר כך\"  מה שלא יושב טוב לכו לשעות קבלה תתיצעו עם חברים \nכל תרגיל בית ייסתמך על משפטים שנלמדו אז כדאי בכל תרגיל בית לנצל את ההזדמנות לדעת ההוכחות בעל פה ואז להתחיל לפתור ככה תגיעו לסוף הסמסטר שולטים במשפטים שהם חלק משמעותי \nהמבחן: המבחן הוגן \n\nהשורה התחתונה: חלק מהסטודנטים שתשאלו נוטים להגזים בקושי הקורס אינפי 1מ הוא בתכלס מסע של 3 חודשים שבו אתם עוברים על משפטים זה לא קורס טכני כי הוא מתמקד במשפטים ניתוח שלהם הוכחות ומסקנות ובעיקר המון הבנה , אז סתכלו עליו כמסע משפטים שכל משפט מהווה אבן דרך למשפט שאחריו ותעברו בקלילות אין מה להילחץ", "timestamp": 1678629873848}, {"author": "srp", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמיכל ממש חמודה, היא לפעמים טיפה מבולגנת אבל לא יותר מידי קשה לעקוב אחריה. יש לה יחס ממש טוב לסטודנטים שלה והחוויה בכיתה שלה מעלה את המוטיבציה ללמוד לדעתי. אישית באתי גם לסדנאות שלה והיא ממש עוזרת.\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת ממש טובה בלהנגיש את החומר ומאוד קל לעקוב אחריה, היא יחסית איטית אבל בקורס הזה זה יכול להיות ממש טוב כי החומר מסובך. \n\nשעורי הבית: גיליון כל שבוע, לא בודקים לנו אותם אז בתכלס אפשר להגיש מתכון לעוגה ועדיין תקבלו את המגן. \n\nהמבחן: קשה אבל גם הקורס קשה\n\nהשורה התחתונה: קורס חובה, אבל אפשר להקל עליו עם באים לשעות קבלה וסדנאות ומתעקשים להבין את החומר.", "timestamp": 1678977831417}, {"author": "אנונימיץ", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אביב צנזור - יוטיוב\nחוות דעת - הרצאות: \nנאמר לי כי היו דגשים בהרצאות שלא נמצאות ביוטיוב (לקראת סוף הסמסטר, בנושא שארית של פולינום טיילור כאו-קטן. יש את זה בקצרה, בנוסף לחומר בתרגולים הפרונטליים והמוקלטים). פרט לכך, ניתן ומומלץ ללמוד דרך היוטיוב. ההרצאות מפוצצות כאילו מחלקים מתנות חינם.\n\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: \nהוא די סבבה, השתלב לי במערכת יותר טוב מיוליה (היא מעולה, מספיקה המון חומר ויותר תרגילים מאחסאן). הוא מזכיר קוסם/ אמן חושים עם תנועות הידיים שלו, מומלץ לשים לב.\n\nשעורי הבית: \nמומלץ לעשות הכל, אם ניתן גם את שאלות הבחירה. אפשר גם לענות על מה שחיוני וכהכנה למבחן לעבור גם על שאלות הבחירה.\n\nהמבחן: \nצריך לדייק בניסוחים וכמובן לדעת את המשפטים החשובים וההוכחות אליהן. אפשר לעבור בסבבה, ציון גבוה יותר קשה להשיג.\n\nהשורה התחתונה: \nלא לעשות את אתגר המיינקראפט, זה פשוט לא שווה את הזמן/ שפיות שלכם.", "timestamp": 1678991467080}, {"author": "..", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: מסביר טוב אבל לאט לא תמיד עומד בקצב עם ההרצאות/מתרגלים אחרים.\n\nשעורי הבית: לא חובה, לרוב קשים עד בלתי אפשריים, שווה לחזור עליהם לפני המבחן זה שאלה מתנה.\n\nהמבחן: לרוב המבחנים הוגנים בהשוואה לחומר הנלמד אבל זה לא הופך אותם לקלים, לשבת ולתרגל הרבה מבחנים מסמסטרים קודמים ולשים דגש על מבחנים של המרצה האחראי בסמסטר שלכם, לכל מרצה יש את הנושאים שהוא אוהב יותר ויופיעו אצלו יותר\n\nהשורה התחתונה: קורס חובה ולא פשוט, תשקיעו", "timestamp": 1679136097965}, {"author": "--", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביב\nחוות דעת - הרצאות: \nמצדיק את השמועות - מסביר מאוד ברור, אווירה קלילה (למרות שהחומר לא), דואג להביא דוגמאות והשוואות כדי שהחומר יהיה יותר מובן ומקושר למציאות\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: \nמדהים. \n\nשעורי הבית: \nקשים ולוקחים זמן, אבל מכינים למבחן באופן טוב ומסדרים את החומר\nמומלץ כן לעשות את שאלות הבונוס (יחד עם הגליון הבא)\n\nהמבחן: \nהוגן\n\nהשורה התחתונה: \nקורס קשה. במיוחד מבחינת כמות החומר וההתנסחות", "timestamp": 1679256637714}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: ההרצאות המוקלטות כיסו את כל החומר ברמה שאחרי השבועיים הראשונים הפסקתי להגיע להרצאות ולא הייתה לי שום בעיה בתרגולים מבחינת כיסוי של החומר. מומלץ בחום.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אחסאן מתרגל מצוין. מעביר את החומר בצורה עניינית ומרגיש שהוא פותר ככה שבאמת אפשר להבין את צורת החשיבה מאחורי דרך הפתרון של התרגילים. מה גם שהוא מרים את האווירה עם בדיחות אז בכלל מעולה.\n\nשעורי הבית: ארוכים וקשים מאוד, יותר מהשאלות במבחן עצמו. חשוב ממש להתעמק בכל תרגיל ולהבין את הטריקים שלו ולא ולוותר וישר לרפרנס כי אותי זה הציל במבחן בשאלת שיעורי הבית.\n\nהמבחן: הדרך הכי טובה להתכונן בעיני היא לפתור כמה שיותר מבחני עבר. השאלות מאוד תבניתיות ומזכירות מבחן בגרות מבחינת החזרתיות על הניסוחים. בשלב מסוים כבר קולטים את הדברים שבאמת צריך לזכור. חשוב מאוד לדעת ניסוחים והוכחות כי על זה נבדקים.\n\nהשורה התחתונה: קורס קשוח שכולם מפחדים ממנו אבל אם באמת משקיעים ומנסים ללמוד כמו שצריך אפשר לצלוח אותו ומקנה בסיס טוב לתחילת התואר.", "timestamp": 1679310163321}, {"author": "צנזור", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור - מוקלט.\nחוות דעת - הרצאות: לא סתם כולם מכירים את השם. מסביר את החומר בצורה יסודית וברורה, בהתחלה הלכתי להרצאות אבל הן באמת זהות לחלוטין להקלטות אז הפסקתי.\n\nשם המתרגל/ת: אחסאן/אפרת\nחוות דעת - תרגולים: שניהם מעולים, התרגול של אפרת התנגש לי עם משהו אחר אז הלכתי רק לשעה אחת שלה. אפרת מסבירה מעולה, הייתי אצלה גם באלגברה והיא תותחית, אכפת לה מאוד שכולם יבינו והיא מתעכבת כמה שצריך ובכל זאת לא נופלת בקצב מהאחרים.\nאחסאן גם מתרגל מצוין, דואג שתהיה אווירה טובה ולימודית בכיתה, נותן הרבה מקום לשאלות, מסביר טוב ולאט ודואג לפתור הרבה תרגילים ממבחנים.\n\nשעורי הבית: גיליון שבועי, לא קל בכלל, רמה יותר גבוהה מהתרגולים אבל חשוב.\n\nהמבחן: לא קל אבל הוגן, המבנה שלו די חוזר על עצמו אז כל עוד מתרגלים מספיק מבחנים ולומדים את המשפטים והחומר כמו שצריך אמורים להצליח.\n\nהשורה התחתונה: קורס לא קל בכלל אבל אפשרי. אל תתנו לתדמית של הקורס להפחיד אתכם.", "timestamp": 1679330149672}, {"author": "א", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: הכי טוב שיש\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מעולה\n\nהמבחן: תפתרו המון המון מבחני עבר זאת הדרך היחידה להצליח, ותלמדו בעל פה את ההגדרות והמשפטים באופן מדויק כולל כל הניואנסים", "timestamp": 1679414554238}, {"author": "A", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מעולה!!! ותואם ב-95% להקלטות אז קל להשלים אם צריך\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מדהים", "timestamp": 1679471859477}, {"author": "אפסילון חיובי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביב צנזור האיש והאגדה (רק לבוא פיזית להרצאות!!!)\nחוות דעת - הרצאות: לא תאמינו אבל הוא חי גם במציאות. הוא די האלוהים של הקורס הזה ושל סמסטר ראשון בכללי ביכולות הסברה שלו שזה כבר בא לו באוטומטי וביכולות המטורפות שלו לגרום לכם להרגיש שאתם מבינים את החומר עד שאתם נתקלים בגליונות ומבינים שוואלה אתם לא. אבל לגמרי ממליץ לבוא להרצאות ופשוט להנות מההרצאות ולא מהמוקלטות כי חבל לפספס אישיות כזאת (במיוחד לפני חנוכה ותודו לי אחר כך)\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: אין כמו אירנה היא בן אדם מדהים עם ספידי גונזלס קטן שחי בתוכה מה שמצריך מכם לשבור את היד בנסיון לעמוד בקצב אבל אתם לא תתחרטו שבחרתם להיות איתה כי היא אלופה ואכפתית גם שתעזור לכם עד שתבינו.\n\nשעורי הבית: שלא נדע מצרות. כל שבוע מקבלים גיליון חדש ואולקוס. ממליץ לא להגיע למצב של הצטברות גליונות באינפי כי זה כמו כדור שלג שבסוף יגרום לכם למפולת שלגים קשה כי גם אם עוד לא למדתם את החומר בשביל לפתור את הגליון עדיין תתעקשו לסיים עם זה כמה שיותר מהר ולעבור הלאה.\n\nהמבחן: מבחן שגורם להרגשה טובה כשאתה יוצא ממנו והרגשה רעה כשאתה מקבל את הציון אז באמת שלא צוחקים איתכם כשאומרים שחשוב להשקיע במבחן כדי להצליח כי עובדה שיש כאלה שקיבלו ציונים גבוהים אבל אני פשוט לא אחד מהם.\n\nהשורה התחתונה: קורס שלאט לאט מחלחל ההבנה של כמה הוא מגעיל אבל תתעודדו כי לפחות הצוות טוב ויעביר אותכם אחלה של סמסטר עד לתקופת המבחנים שמשם שצנזור ישמור עליכם.", "timestamp": 1679505179763}, {"author": "ג'ורג'י חפר בגינה ומצא ביקורת בצ'יזפורק", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביב צנזור האחד והיחיד (הרצאות פיזיות)\nחוות דעת - הרצאות: שמעו יש סיבה שהוא כזה סלב. הבן אדם יודע להרצות ולגרום לכם להבין. הבעיה היחידה איתו שלפעמים הוא כל כך טוב במה שהוא עושה, שאתה יוצא בתחושה שאתה מבין כשבפועל לא הבנת כלום. חשוב מאוד לעבור על ההרצאות לפני כל הרצאה ואפילו יותר מזה, הדרך להצליח בקורס הזה היא ללכת לסדנאות או לשעות קבלה. שם באמת אפשר לקבל את היחס האישי שצריך כדי להבין איך לכשף אפסילונים כמו שצריך.\n\nשם המתרגל/ת: אפרת אבירם ואז אירנה גורליק\nחוות דעת - תרגולים: אפרת ואירנה שתיהם מתרגלות מעולות. הבעיה שלי עם אפרת היא בתרגולים שלה אין מקום באופן קבוע, אז עברתי לאירנה. אירנה מסבירה כאילו היא חייה במוקלטת על X2, אבל לי אישית הקצב שלה התאים, בסופו של דבר, שתיהן מומלצות מאוד, במיוחד עם אתם עושים גם אלגברה אמ שם אירנה הייתה מרצה ואפרת הייתה מתרגלת, ואני נהנתי ללמוד עם אותם מרצים ביותר ממקצוע אחד.\n\nשעורי הבית: כל שבוע יש גליון יותר מחריד מהשני ווובוורק. תרגישו חופשי לרפרנס כי באמת שיש שאלות דוחות לפעמים, וחבל לבזבז שלוש שעות על שאלה. מה שכן, חשוב מאוד להבין את הדרך פתרון של כל השאלות מהגליונות כי לנו במבחן הייתה שאלה משם, ואם עשיתם אותה אז הרווחתם בענק.\n\nהמבחן: המבחן הזה מסריח כמו החרא של ג'ורג'י (הכלב של צנזור). מבחן קשה מאוד, למרות שהעובדה ששאלה אחת היא שאלה משיעורי בית בתיאוריה יכלה לעזור. לחרוש חזק על המשפטים ועל ההוכחות שלהם זה ממש מומלץ, כי יכולות להיות שאלות של הוכחה של משפט בלי חשיבה וזה תמיד אחלה. חבל שכל השאלות שכן דורשות חשיבה מזוויעות ועוברות כל גבול.\n\nהשורה התחתונה: קורס קשוח רצח וידוע לשמצה, אפשר להצליח בו, אבל חייבים להשקיע המון.", "timestamp": 1679505180549}, {"author": "עמית", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מרצה בחסד, מהברורים והדידקטיים ששמעתי. מאוד מתודי ורהוט. הגעתי פרונטלי והשלמתי / חיזקתי המוקלט. ממליץ מאוד.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: אירנה מדהימה, בעיקר כי באמת מורגש שאכפת לה מהסטודנטים. היא עוזרת מאוד בלבנות גישות פתרון ובתיעדוף ותכנון למידה למבחנים. בהעברת החומר היא מקצועית מאוד וסבלנית מאוד לשאלות ולדעתי היא מתרגלת מצויינת.\n\nשעורי הבית: מאתגרים, יכולים לקחת הרבה זמן אם מנסים לפתור הכל לבד. ממליץ להשקיע עד חצי שעה בשאלה ואם אין כיוון לפתרון אחרי חצי שעה - לקבל עזרה מרפרנס / חבר / שעות קבלה באופן מדורג (לא לקפוץ ישר לפתרון).\n\nהמבחן: מבחנים באינפי ידועים לשמצה בצדק, אבל המבחן שלנו היה הוגן לטעמי.\n\nהשורה התחתונה: קורס מאתגר עם סגל טוב.", "timestamp": 1679644389375}, {"author": "נועם קרן", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור מוקלט\nחוות דעת - הרצאות: אין כיף כמו מוקלטות, היה נושא יחיד שהועבר ר קפרונטאלית, צוות המרצים דאג להתריע על כך מראש כך שמי שלא מגיע בלייב יוכל להתעדכן מהחברים וכן להגיע ספציפית להרצאה הזאת, ממליצה מאוד.\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: אירנה מתרגלת מעולה!! לא מאכילה בכפית וכן נותנת לחשוב, עושה תרגילים ברמה גבוהה שמכינה למבחן, קצת מבולגנת אבל מתרגלים בסוף.\nהקצב גבוהה ולכן מי שמעכל לעט לא כדאי לדעתי\n\nשעורי הבית: קשים ולוקחים דיי הרבה זמן, כן הייתי ממליצה לא להתקע על תרגילים שעות בלי להתקדם וללכת לשעות קבלה / סדנאות או להציץ ברפרנסים לפני שמבזבזים על זה שבוע שלם\n\nהמבחן: לא קל בכלל, אבל ככה זה אינפי\n\nהשורה התחתונה:", "timestamp": 1679651802829}, {"author": "shiran", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: צנזור- וואלה תראו הקלטות גם תופס מאשר להידחף עם כולם על הבוקר \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אני פחות התחברתי ליולייה הרגיש לי שאנחנו לא מספיקים את רוב התרגילים והיה חסר לי הרבה תגבור מהצד\n\nשעורי הבית: קשים אבל זה מה שיש, שוהו להשקיע\n\nהמבחן: מועד א הלך ביזיון, אבל למועד ב למדתי עם פקל של סטאדיס- חן המלךךךך!! והקפיץ לי את הציון באיזה 35 נקודות אז סוף טוב הכל טוב. ממליצה בחום וחן גם עזר לי מלא בפרטי \n\nהשורה התחתונה: פגע וברח", "timestamp": 1683385441457}, {"author": "ווירשטראס", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: וואלה לא קל. מיכל קצת מבולגנת ומאבדת את עצמה מדי פעם, והחומר עצמו די קשה ומאוד מאוד מעמיק. תתכוננו להרבה משפטים שנבנים אחד על השני\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: אמאל’ה רבקה. אחלה מתרגלת אבל מה כותבת במהירות האור בערך. היתרון הוא שמספיקים המון המון תרגילים, אב יש אחלה של database לעבוד איתו אחר כך\n\nשעורי הבית: \nקשים, אפילו מאוד, אבל בהחלט אפשריים. רפרנסתי לא מעט, אבל פסדר אני לא חכם במיוחד. מי שמשקיע יהיה לו סבבה\n\nהמבחן: \nקשה, אבל באמת די הוגן. \n\nהשורה התחתונה: \nקורס לא קל, אבל לא בלתי אפשרי כמו שאוהבים להגיד", "timestamp": 1688759600711}, {"author": "נהוראי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nהרצאות טובות בסך הכל, עוברת על כל החומר בצורה מובנת. לקראת סוף הסמסטר פספסנו כמה נושאים, לא היה זמן הפעם.\nבהתחלה ההרצאות מאוד מלאות, בערך לקראת החצי כבר מתרוקן. אפשר לראות צנזור ולא להפסיד הרבה, אפשר להגיע להרצאות במקום וגם אז לא להפסיד הרבה.\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: \nמתרגלת טובה, התרשמתי שעם אחסאן הספיקו יותר הפעם.\nשעורי הבית: \nלא קשים במיוחד. 4 שאלות בכל גליון (בדר\"כ לפחות 3 שאלות חדשות), גליונות שבועיים, לקחו לי בין שעתיים לארבע שעות בשבוע.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689599987974}, {"author": "שחר פוקס", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: הלא התחברתי להרצאות, מיכל מאוד לא מסודרת ומעמיסה מאוד ללא שום היגיון עמוק, באמצע הסמסטר עברתי לצנזור ביוטיוב והיה שווה כל רגע.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: ניקה טיפה מהירה בעיניי, אבל מתעכבת ומסבירה לעומק כשמבקשים, הבנתי שאחסאן יותר טוב, וזה ניכר גם בכמות הסטודנטים שמגיעים.\n\nשעורי הבית: קשים, דורשים המון השקעה אך נותנים בסיס מאוד חזק למבחן ומפתחים חשיבה מתמטית גבוהה.\n\nהמבחן: היה מבחן הוגן לגמרי, מי שכל הסמסטר למד והשקיע יעבור אותו עם ציון טוב.\n\nהשורה התחתונה: קורס לא פשוט בכלל, מתסכל לרגעים אך בסוף הכל מתחבר ועם למידה ארוכה ניתן להצליח בזה", "timestamp": 1690359349628}, {"author": "A", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: אין מה לומר, הבן אדם אגדה. ואם בכל זאת לא הבנתם משהו, ההקלטות ביוטיוב הן ממש אותו הדבר אז קל לסגור פערים\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מדהים!!! מומלץ בחום\n\nשעורי הבית: צריך להיזהר לא לשבור עליהם את הראש בלי סוף, כדאי ללכת לשעות קבלה או לפתור עם חברים, ואז לעבור על זה לבד ולוודא שהכל מובן. לשבת ולבהות בדף לא יקדם אתכם לשום מקום\n\nהמבחן: קשה. תפתרו הרבה מבחני עבר כדי שתכירו את העניין\n\nהשורה התחתונה: קורס קשה אבל קורס חובה, תתכוננו לציון נמוך בבוחן האמצע כי זה תמיד ככה, אבל בסוף זה מסתדר", "timestamp": 1690728285803}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה:  מיכל\nחוות דעת - הרצאות: למיכל חשוב שהסטודנטים יבינו והיא באמת עושה השתדלות. מי שמגיע להרצאות באופן קבוע היא גם זוכרת את השם שלו. \nהחומר של הקורס - משפטים מאוד הגיונים, הוכחות מסורבלות. אין ברירה וצריך לשנן הוכחות.\nתחזיקו חזק ואל תעברו להקלטות, קשה מאוד לעמוד ככה בקצב.\n\nשם המתרגל/ת:  אחסאן\nחוות דעת - תרגולים: די עמוסים. מזכיר משפטים מההרצאה שזה טוב, יש סיכום של התרגולים שלו בדרייב. מרגישים שיש לו תלמידים שהוא אוהב וכאלו שפחות, אנחנו כבר לא בבית ספר..\n\nשעורי הבית: קשים.\n\nהמבחן: אימלה\n\nהשורה התחתונה: קורס קשה, מאתגר ומפחיד של סמסטר ראשון. חשוב לא להוריד רגל מהגז בשום שלב. הקצב מהיר בטירוף. תלכו לכמה שיותר שעות קבלה ותתרגלו מבחנים. חשוב מאוד גם לדעת לכתוב פורמלית, כי מאוד קוטלים על זה בבחינה. בהצלחה!\n\nבוחן אמצע - המלצה חמה - לא להשקיע בו יותר מידי ולהזניח את שאר המקצועות. בסופו של דבר הוא לא יהיה מגן גם ככה...", "timestamp": 1691412310801}, {"author": "ty", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: קליינשטרן מיכל\nחוות דעת - הרצאות: \nמהירה מאוד בחומר. אתה תעזוב את ההרצאות שלה בידיעה פחותה מאשר כשנכנסת לאולם. היא הצליחה לסבך מושגים פשוטים במתמטיקה.\nשם המתרגל/ת: עבד אלפתאח אחסאן\nחוות דעת - תרגולים: \nמדהים. ממליץ ללכת לתרגולים של אחסאן.\nשעורי הבית: \nקשים\nהמבחן: \nבסדר\nהשורה התחתונה:", "timestamp": 1692122316247}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ד\"ר מיכל\nחוות דעת - הרצאות: מיכל מלמדת בהרבה להט והתרגשות אבל כשאין לה הרבה זמן לסמסטר היא מתתחילה למהר\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מתרגלת מצוינת עם זיקה רבה למקצוע, קצת מהירה, אבל חשוב להקשיב למונולוגים שלה כדי להבין על מה היא מדברת.\n\nשעורי הבית: קשים, צריך לפתור רפרנסים.\n\nהמבחן: חוץ משאלה 4, יותר קל משנים קודמות.\n\nהשורה התחתונה: קורס קשה אבל אפשרי בהחלט, הפעם הראשונה שנחשפים למתמטיקה אקדמית וזה בהחלט משהו שצריך להתרגל אליו כדי להעריך את היופי שלו.", "timestamp": 1692524149689}, {"author": "ט", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: צנזור  מוקלט\nחוות דעת - הרצאות: \nאותו חומר 1:1, ההקלטות מאוד ברורות וטובות\n\nשם המתרגל/ת: טל בן יהודה (הרשימות שלו)\nחוות דעת - תרגולים: \nהרשימות של טל מאוד מאוד טובים, מסביר את החומר בהם בצורה מאוד טובה וברורה, לכל שאלה הוא קודם מסביר את האינטואיציה של השאלה ואחר כך רושם את הפתרון, ממליץ מאוד עליהם.\n\nשעורי הבית: \nלא עשיתי, אבל כן ממליץ לעשות אותם, עוזרים המון בהבנת החומר\nהמבחן: \nלא היה קל, אבל מי שלמד באמת טוב יכול להצליח בהם\n\nהשורה התחתונה: \nהחומר סה\"כ מעניין אם מבינים", "timestamp": 1711127085417}, {"author": "אביב", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: מרצה אגדי. המרצה הכי טוב בכל הקורסים בפער. מסביר מצוין וברור, מצחיק ואחלה בן אדם.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי הסמסטר, מסביר אינטואיציה ותרגילים מאוד ברור ונותן אחלה טיפים. \n\nשעורי הבית: מאתגרים מאוד, אבל שווה מאוד לעשות. זה עוזר בהבנה של החומר.\n\nהמבחן: מאתגר.\n\nהשורה התחתונה: הקורס הכי מאתגר בסמסטר הראשון אבל גם מאוד מעניין. אני אהבתי את הקורס, יש בו הרבה עומק ויופי.", "timestamp": 1713190439361}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: נעמי\nחוות דעת - הרצאות: \nנחמדה, מסבירה לא רע. לפעמים קצת מתבלבלת אבל לא אסון\nשם המתרגל/ת: מיכל עמיר\nחוות דעת - תרגולים: \nבאמת משתדלת, משקיעה ומנסה שנבין, אבל היא לא כל כך מצליחה להעביר את החומר טוב וגם מלא פעמים נקטע לה חוט המחשבה\nשעורי הבית: \nגיליון וWB, הWB סתם ארוך ומייגע ומיותר, תוציאו ב10 הראשונים 85 ותתפתרו מהם, הגיליונות קשים אבל חשוב לעשות\nהמבחן: \nקשה מאוד, אבל אפשרי. חשוב לזכור משפטים והוכחות ולא לפחד לקחת נוהל לא יודע\nהשורה התחתונה: קשה, לא כל כך נהניתי אבל הסגל לא רע בכלל", "timestamp": 1713372987655}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: צנזור הקלטות\nחוות דעת - הרצאות: הלקטות מעולות, לא נראה לי יש הרבה מה להוסיף על צנזור שלא נאמר כבר.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: אחלה בן אדם, יודע להסביר טוב את החומר ולרוב הוא ענייני, חשוב לו מאוד שכולם יבינו הכל בזמן התרגול, אבל זה גורם לו להתעכב קצת יותר מדי וכל שיעור מחדש הוא חורג מהזמן שלו. מומלץ מאוד ללכת לשעות קבלה שלו, מסביר בסבלנות לכולם ואם צריך הוא נשאר גם שעה אקסטרה ואפילו יותר עד שכולם קיבלו תשובה לשאלה שלהם.\n\nשעורי הבית: לא הייתה הסמסטר חובת הגשה וחבל, חשוב מאוד מאוד לעשות אותם, ולהשתדל כמה שפחות עם רפרנסים. השב הכרחיים בשביל לצלוח את הקורס, רק בעזרתם באמת מפנימים את החומר ומה באמת רוצים מאיתנו בקורס הזה.\n\nהמבחן: היה הוגן מאוד (אולי אפילו קצת קל), אבל נראה לי שצנזור פשוט התחשב בגלל המלחמה.\n\nהשורה התחתונה: קורס קשה מאוד, אבל עם מספיק השקעה זה לגמרי אפשרי לעבור אותו.", "timestamp": 1713386320928}, {"author": "הדוגסיטר של ג׳ורג׳י", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביב צנזור פרונטלי \nחוות דעת - הרצאות: \nאני חושבת שחלק משמעותי מהחוויה של סמסטר א׳ היא באמת להגיע להרצאות של צנזור פרונטלית גם אם ההקלטות הן בדיוק מה שהוא אומר, הוא מצחיק בטירוף עונה על שאלות וכל האווירה עושה את הקורס להרבה יותר נסבל. \nבשבועות הראשונים יש עומס אבל צריך לשרוד אותו, ואז כבר ממש סבבה, תמיד אפשר להגיע מוקדם לשמור מקום.\n\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nהיה מאוד עמוס לאורך רב הסמסטר עד שהעבירו אותנו לכיתה יותר גדולה. טל יודע את החומר והוא ממש מעודד שאנשים ישאלו שאלות והוא תמיד יסביר בסבלנות. לדעתי הוא מאוד איטי והיו לא מעט פעמים שאיבדנו ריכוז אצלו. אבל כשזה מגיע למי המתרגל שאני הכי ממליצה עליו מהסגל- זה הוא. ברשימות שלו יש המון טריקים מצויינים למבחן והוא ממש נותן יסודות טובים. \nשעות הקבלה שלו לדעתי לא יעילות, אי אפשר ממש לשאול שאלות משלך, אנשים באים לשם כדי שהוא יפתור להם את תרגילי הבית.\n\nשעורי הבית: \nקשים, לפעמים לוקחים כמה שעות, אבל בבקשה ממכם- לא לרפרנס. לבקש עזרה או רמז מהמרצה- זה עושה את כל ההבדל. במבחן יש שאלת שיעורי בית שהיא מתנה אם פתרתם את תרגילי הבית לבד. הוובוורקים מזעזעים אבל זה 5% מגן אז פשוט תסיימו איתם וזהו. \n\nהמבחן: \nהיה פייר ברמות קיצוניות, 2 שאלות משיעורי הבית, שאלות שעברו עליהן בכיתה. \n\nהשורה התחתונה: \nקורס ממש טוב אם משקיעים בו, ממליצה לעשות את כל התרגילים שצנזור נותן בכיתה, הם עוזרים ממש להבנה של החומר. לא לפחד לבקש עזרה, זה קורס קשה.", "timestamp": 1713420354605}, {"author": "לופיטל", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמאוד מהר הבנתי שאין לי כוח ללכת להרצאות המפוצצות של צנזור, ולדעתי מיכל לא נופלת ממנו ברמה בכלל, לא הייתי ממהרת לזלזל ולקחת את צנזור כברירת מחדל, יש המון יתרונות בללמוד בכיתה קטנה\nכמובן שלפני המבחן או אם משהו לא יושב לך טוב עד הסוף - הוידאו של צנזור נהדר ונעזרתי בו לא מעט בלמידה למבחן\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל מתרגל נהדר בעיניי, שווה את הכיתה המפוצצת ואת הקצב האיטי יחסית, יודע לתת אינטואיציה טובה לתרגילים וטריקים שימושיים. גם אם לא הולכים לתרגולים שלו הייתי ממליצה להסתכל ברשימות שיכולות מאוד לעזור בחומר המסובך יותר ובלמידה למבחן. בנוסף הוא משקיע מעל ומעבר בתרגולי חזרה ושעות קבלה למבחן.\nגם בתרגולים לא לפחד בנוסף לתרגול הפיזי להיעזר במוקלטים על נושאים ספציפיים שלא יושבים עד הסוף - יצא לי להיעזר בתרגולים המוקלטים של שקד בפנופטו והייתי מרוצה מהם.\nגם בהרצאות וגם בתרגולים הייתי ממליצה בסמסטר א להשתמש במוקלטים בתור עזרה נוספת ולא להסתמך עליהם לבד, שאלות בהרצאה ובתרגול ובשעות קבלה הם הדרך הכי טובה להבין מה מצבכם בחומר, במיוחד כשאין כמעט פידבק על תרגילי הבית.\nשעורי הבית: \nברמה גבוהה, דורשים לא מעט השקעה ומאמץ, ובסוף בכל גיליון היו שאלה או שתיים שהצלחתי לפתור רק אחרי שישבתי עליהן עם חונך\\מרצה או מתרגל בשעת קבלה\nלא להתייאש ולא למהר לרפרנס, אצלנו לא הייתה חובת הגשה בכלל וגם כמעט ולא היה פידבק אז להשתמש ברפרנסים היה מיותר לגמרי בעיני, למעט לבדוק אחרי שפתרתי אם הפתרון שלי לגיטימי.\nהמבחן: \nהמבחן היה ברמה דיי קלה בכלל המלחמה, שתי שאלות מגן, בלי לופיטל ובלי טיילור, פשוט יותר משמעותית ממבחני עבר שפתרתי\nהשורה התחתונה: \nהקרוס הכי קשה בסמסטר א, חייב להשקיע להיות על זה כל הסמסטר אחרת אין לכם סיכוי\nלא לפחד להיעזר בכל מה שהטכניון מציע לכם באופן מוזל ובחינם: חונכויות, שעות קבלה, שיעורים פרטיים עם חונכים\nעדיף גם לבקש את העזרה כמה שיותר מוקדם בסמסטר גם כדי שזה יהיה אפקטיבי וגם כדי שהחונכים לא יתמלאו", "timestamp": 1713441014407}, {"author": "ג'ורג'י", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: ההרצאות ממש מסודרות, באמת משקיע ומרצה מעולה (ומצחיק) \nמומלץ להגיע פיזית גם אם זה מאתגר בהתחלה בגלל העומס\nלכל מי שקשה לכתוב ולהקשיב בזמן הרצאה או סתם רוצה סיכום מאוד מסודר של כל ההרצאות ממליצה על הסיכום מהדרייב של ההקלטות - זה מוקלד וזהה למה שיש על הלוח\n\nשם המתרגל/ת: טל בן יהודה --> מיכל עמיר\nחוות דעת - תרגולים: בהתחלה הלכתי לטל, הרשימות שלו טובות והוא מסביר לעומק אבל הוא מאוד איטי ולי זה היה קשה.\nמתעמק לפעמים במה שלא צריך, זה מוציא מריכוז ומספיקים פחות תרגילים\nעברתי למיכל, בעיני היא תותחית, מספיקים אצלה הרבה והיא נותנת אינטואיציה ונותנת לנו לפעמים לחשוב לבד במקום ישר לתת את התשובה  \n\nשעורי הבית: מאתגרים לפעמים ודורשים זמן, חשוב לנסות לעשות כמה שאפשר לבד אבל זה סבבה לרפרנס כדי לא להתקע ולהכיר גישות חדשות לפתרון\n\nהמבחן: סהכ הוגן \n\nהשורה התחתונה: קורס מעניין\nולכו לשעות קבלה - זה ממש עוזר", "timestamp": 1713448911056}, {"author": "לגרנז׳", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: \nאביב מסביר באופן פרונטלי בדיוק כמו בהרצאות המוקלטות - הסבר איכותי וברור. \nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרבקה כותבת מאוד מהר אז לוקח זמן להתרגל לקצב שלה. מסבירה טוב וכמות התרגילים שהיא מספיקה מכינה טוב לקראת המבחן.\nשעורי הבית: \nלא מסובכים אבל דורשים הבנה טובה של החומר כדי להבין את רעיון התרגיל.\nהמבחן: \nהוגן, אבל לא קל.", "timestamp": 1713450233809}, {"author": "Yamit Patik", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: צנזור - הקלטות\nחוות דעת - הרצאות: \nממש אחלה, לא חושבת שיש טעם להגיע להרצאות שלו, סתם צפוף וחנוק\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: היינו בערך 10 אנשים בתרגול , מה שנתן את האופציה לשאול מלא שאלות במהלך התרגול ולקבל יחס אישי. יוליה מביאה תרגילים ממש טובים וקשים. לא הרבה מתחברים אליה כי היא רצה בחומר ברמות, אבל בשבילי זה הסתדר סבבה עם זה שהיו מעט אנשים אז היה אפשר לעצור אותה ולשאול. בסהכ אחלה מתרגלת\n\nשעורי הבית: קשים \n\nהמבחן: קשה\n\nהשורה התחתונה: קורס קשה, צריך לנשוך שיניים ולסיים איתו", "timestamp": 1713596833390}, {"author": "פסגותניק אלמוני", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מעולה ממש. היו כמה שינויים מהמוקלטות\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: מתרגל אגדי. לדעתי חובה ללכת\nהוא קצת איטי, אבל זה לגמרי שווה את זה, הוא מחדיר הבנה מאד עמוקה וטובה של החומר, ממליץ ממש. בנוסף יש לו את כל קבצי התרכגול בקבוצת טימס שלו, והם ממש ממש עוזרים, שווה קריאה\n\nשעורי הבית: נחמדים ברובם\n\nהמבחן: הוגן +. קל משמעותית ממה שציפיתי\n\nהשורה התחתונה: קורס מעניין וכיפי", "timestamp": 1714126052561}, {"author": "Yaniv Cohen", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: \nמיכל מצויינת ומאוד קל לעקוב אחרי קו המחשבה שלה.\nאני מאוד שמח שהלכתי אליה ולא לצנזור, וזכיתי לקבל יחס אישי.\nשם המתרגל/ת: יובל\nחוות דעת - תרגולים: \nיובל מאוד מסודר, ומשתדל להיות הכי מדוקדק שיש. ממליץ\nשעורי הבית: \n\nהמבחן: \nבמבחן אין הפתעות, אבל זה לא אומר שקל.\nהשורה התחתונה: \nקורס לא קל", "timestamp": 1714402251002}, {"author": "מושי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אביב צנזור פרונטלי\nחוות דעת - הרצאות: כולם כבר יודעים שהוא מרצה נהדר וזה נכון. ראיתי מוקלט לפעמים אבל להגיע פיזי היה שווה את זה, עמוס בהרצאות אבל אחרי השבועיים הראשונים כבר תמיד יש מקום.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: מתרגל טוב שנותן המון אינטואיציה אבל הוא (בדומה לכל שאר המתרגלים) יחסית איטי ולפעמים יכול להיות יעיל יותר פשוט לקרוא את הדפים שלו, שהם מקור נהדר\n\nשעורי הבית: חובה לגמרי להצלחה לדעתי. לא עמוסים מדי\n\nהמבחן: היה הוגן וברמה של שיעורי הבית.", "timestamp": 1714654286144}, {"author": "Null", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: aviv censor\nחוות דעת - הרצאות: watched the ones recorded from years ago, everything is very well explained, going to class and actually *sitting* was basically impossible because of the amount of people\n\nשם המתרגל/ת: omer\nחוות דעת - תרגולים: he was fine, i switched to recorded tutorials mid semester because he felt a little too slow for me\n\nשעורי הבית: this specific semester there was no need to submit them, either way they are very challenging and hard\n\nהמבחן: the exam was fair, of course it was hard its infi, but with enough studying i passed even though i found the course to be extremely challenging\n\nהשורה התחתונה: very hard course, especially for a 1st semester course, but its doable", "timestamp": 1714739440026}, {"author": "nn18", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמוקלט\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nרק רבקה\nשעורי הבית: \nסבבה\nהמבחן: \nללמוד טוב ויהיה טוב\nהשורה התחתונה: קורס חובה", "timestamp": 1714744772700}, {"author": "Ofek Y", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: צנזור יוטיוב\nחוות דעת - הרצאות: מאוד טוב ומובן\n\nשם המתרגל/ת: טל \nחוות דעת - תרגולים: מתרגל מאוד נחמד ומעמיק בחומר, עונה על כל שאלה\n\nשעורי הבית: עמוסים ומשמעותית יותר קשים מהמבחן\n\nהמבחן: מבחן מאוד הוגן, חשוב להיות ערני\n\nהשורה התחתונה:", "timestamp": 1714906850828}, {"author": "סטודנט שנה א", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: \nהקורס היחיד שממש חיכיתי להרצאות שלו, חובה ללכת. \n\nשם המתרגל/ת: טל \nחוות דעת - תרגולים: \nמאוד אכפתי וממש משקיע,  שם דגש גדול על הסברים ואינטואיציה מה שגורם לו להיות נורא איטי.\nבתחילת הסמסטר, לפני שנכנסים ללופ של הלמידה,  זה ממש עוזר להבין אבל בשלב מסוים זה נהיה מעיק כי הוא אוהב להתעכב על דברים לא חשובים . \n\nשעורי הבית: \nצנזור ממש מזהיר שמי שהולך לרפרנס הולך להיכשל במבחן, והוא לא טועה בגדול. \nהשב לא פשוטים אבל אפשריים עם השקעה , מה שכן במיוחד בגליונות הראשונים יש תרגילים שהפיתרון שלהם מסתמך על \"טריק\" מתמטי שאם לא רואים אותו אין סיכוי לפתור אותם. \nובסוף במבחנים אין בכלל שאלות שמסתמכות על הטריקים האלה, אז אותם זה בסדר גמור לא להצליח.\n\nהמבחן: \nהיה קל ביחס לשנים קודמות . \n\nהשורה התחתונה: \nקורס שאם לא תשקיעו בו תשנאו כל רגע, ואם כן תשקיעו תלמדו בדרך גם לאהוב אינפי.", "timestamp": 1714975539947}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: ההרצאות של צנזור אחד לאחד כמו ביוטיוב אבל חוויה לשבת בהרצאות שלו. מומלץ להגיע. \nבתחילת הסמסטר מפוצץ אבל די מהר מתפנה.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: האמת שלא ממש הצלחתי להתרכז בתרגולים, הוא מתקדם די לאט והיה לי קצת קשה לעקוב אחריו. \nהוא מסביר טוב ויש לו הערות וטיפים חשובים.\nהרשימות שלו מאוד טובות ומומלץ להשתמש בהן בזמן התרגול (הוא מעלה בteams).  \n\nשעורי הבית: חשוב לעשות ולא לרפרנס - התרגילים מלמדים מאוד ועוזרים להפנים את החומר.\n\nהמבחן: הוגן, אבל זה אינפי אז זה יחסי...\n\nהשורה התחתונה: קורס מעניין ומפתח חשיבה - הכי טוב עם צנזור.", "timestamp": 1715332419256}, {"author": "moriah zini", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מעולה אבל עמוס מאוד בתחילת הסמסטר, אבל העומס יורד מהר מאוד. ממומלץ מאוד להגיע להרצאות עד הסוף וכדאי, אם מספיקים, לראות שוב את המוקלט לאחר מכן ( כמעט אחד לאחד) כדי שהחומר ישב טוב, ובלי לצבור פערים.\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: אחלה בן אדם, באמת אכפת לו שנבין את החומר עד הסוף. אבל מתעכב להסברים כלליים ארוכים ושאלות רבות. אם אתם צריכים הסבר איטי מומלץ מאוד אבל זה מגיע במקום תרגול  של מגוון שאלות. אם אתם מבינים מלראות המון דוגמאות של תרגילים פתורים, עדיף שתלכו למתרגל אחר.\n\nשעורי הבית: קשים, לא הצלחתי אף אחד בלי עזרה\n\nהמבחן: הוגן לגמרי, אם אתן מתרגלים הרבה מבחנים תרגישו שהשאלות חוזרות על עצמן, ולא דורשים להמציא את הגלגל.\n\nהשורה התחתונה: גם אם לא הלך טוב כל הסמסטר עם הגיליונות, יש תקווה! תתרגלו הרבה מבחנים, תלמדו הוכחות בע\"פ (ותבינו אותם) ותעברו שוב על הגיליונות בשביל שאלת השיעורי בית.", "timestamp": 1715602564256}, {"author": "גלעד", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיכל והקלטות של צנזור \nחוות דעת - הרצאות: \nנכנסתי בהתחלה להרצאות של מיכל קליינשטיין. ההרצאות מצויינות ובגלל שכולם אצל צנזור גם יש לה זמן לשאלות וליחס אישי, אבל הבנתי שיותר מתאים לי לראות הקלטות. יש הקלטות מצוינות, גם ביוטיוב, ומקיפות טוב את החומר של הקורס. \n\nשם המתרגל/ת: גון\nחוות דעת - תרגולים: \nלא התחברתי כל כך לתרגולים של גון. גם עליהם ויתרתי לאחר כמה זמן לטובת הקלטות. \nשעורי הבית: \nהרבה שיעורי בית. שווה להשקיע בהם במהלך הסמסטר כי המבחן מאוד דומה. עם זאת, לא להיתקע יותר מדי לבד כי יש גם טריקים. \nהמבחן: \nקשה. שווה להשקיע זמן ללמוד את כל ההוכחות והתרגילי בית. \nהשורה התחתונה: קורס עמוס יחסית לסמסטר א, אבל אין לכם הרבה ברירה", "timestamp": 1715845971152}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: הרצאות מעולות, אין מה להוסיף, כן ממליץ להגיע להרצאות ולקבל את החוויה והיכולת לשאול, בנוסף יש דברים שמדייק ומחדד במהלך השנים, למרות שהוידאו מעולה ומי שמעדיף, מכסה את כל החומר.\n\nשם המתרגל/ת: יובל יפרח, בהמשך טל בן יהודה\nחוות דעת - תרגולים:  בהתחלה הייתי אצל יובל יפרח למשך 3 -4 שבועות, לטעמי יובל לא מסביר טוב, אם כי הוא מסודר ומנסה לעשות הכי טוב שהוא יכול, הוא טס והשאלות \"נעשות\" בדרך קסם, לא כל כך מסביר מה עומד מאחורי הדברים שהוא עושה, קשה מאוד לעקוב כסטודנט בסמסטר ראשון. לאחר מכן עברתי לטל והוא מדהים, ממליץ בחום במיוחד למי שמרגיש שהוא קצת פחות חזק. כל מי שהוא אומר איטי / לא מספיק - זה שווה את זה ! , אתה יוצא בתחושת הבנה של מה שנעשה, ותמיד ניתן להשלים אם לא, הבנה > נפח תרגול לדעתי.\n\nשעורי הבית: קשים מאוד, צריך וניתן להיעזר בשעות קבלה, הם קשים בכוונת מכוון ומיועדים להיות בסיס כזה של \"אם הצלחת בש.ב, התרגילים במבחן ייראו קלים\".\n\nהמבחן: היה לנו מבחן הוגן ביותר, לטעמי בגלל הסמסטר הקצר והמיוחד.\n\nהשורה התחתונה: קורס חובה, כדאי לנסות להתחבר לחומר ולחפש את היופי שלו בשביל להצליח גם ליהנות קצת מהדרך.", "timestamp": 1716305159990}, {"author": "Yuval", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: צנזור - מוקלט\nחוות דעת - הרצאות: ניסיתי בתחילת הסמסטר ללכת פרונטלי לכל אחד מהמרצים, לא ראיתי שום יתרון על המוקלט ועברתי למוקלט.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: לא רץ על תרגילים אבל מסביר לעומק ומוודא הבנה, למי שמאוד חד על החומר יכול להיות שהוא פחות מתאים, אבל לי ולהמון אנשים (לפי הכמות בתרגולים) הוא מצוין.\n\nשעורי הבית: גיליון בשבוע - קשים, ממליץ להתחיל כמה שיותר מוקדם כדי ללכת לשעות קבלה.\n\nהמבחן: הוגן.\n\nהשורה התחתונה:", "timestamp": 1716483799990}, {"author": "NeoCy", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביב \nחוות דעת - הרצאות: \nנכון, יש מוקלט. נכון, עמוס מאוד אצלו. אבל זו חוויה אמיתית. זכיתי בהרצאות שלו להעמיק באינפי כמו שלא העמקתי במתמטיקה בחיי.\nשם המתרגל/ת:  טל בן יהודה\nחוות דעת - תרגולים: \nמתרגל טוב, יודע לתת אינטואיציה. אבל אני שם פחות דגש על התרגולים כי באינפי חשוב יותר התאוריה בהרצאה.\nשעורי הבית: \nוובוורקים סבבה, עוזרים לאינטואיציה. גליונות שיכולים להיות כבדים, אבל עוזרים לבנות בסיס הבנתי לקראת בעיות גדולות בהמשך.\nהמבחן: \nמועד א' הוגן עד מאוד, מועד ב' מאתגר\nהשורה התחתונה: \nהאמת? אהבתי", "timestamp": 1716663938042}, {"author": "פסגותניק אלמוני", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: צנזור \nחוות דעת - הרצאות: \nלא הלכתי לנסות מרצים אחרים, אבל צנזור מרצה מעולה, אין איפה לטעות\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: \nטל נותן אחלה אינטואיציה, אבל מאוד איטי ולי אישית זה קצת הפריע, אבל נותן יחס אישי ומאוד מסודר עם הדפים שלו\n\nשעורי הבית: \nוובוורק וגליונות, יכול לקחת שעתיים לגיליון ויכול לקחת שש שעות, אינדיבידואלי אבל סבבה\n\nהמבחן: אחלה מבחן, יש הרבה מבחני תרגול אז יודעים למה לצפות\n\nהשורה התחתונה: קורס מאוד מסודר ומאוד נוח, עמוס אבל דואגים לתמוך בך, בהצלחה בסמסטר א!", "timestamp": 1716883691485}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: צנזור\nחוות דעת - הרצאות: מרצה מעולה, מסביר את החומר בצורה מטורפת. אחד לאחד כמו ההרצאות המוקלטות, אבל יש הרגשה שונה בין הפרונטלי למוקלט, ממליץ ללכת לפרונטלי (אם ממש עמוס בערך באמצע הסמסטר אנשים פורשים למוקלט ואז נהיה יותר מקום בכיתה)\n\nשם המתרגל/ת: טל בן יהודה\nחוות דעת - תרגולים: טל מסביר את החומר בצורה טובה ויש לו רשימות מעולות לתרגולים אבל קצת איטי, לרוב לא מספיק את כל מה שתיכנן לתרגול (בדרך כלל עושים משהו כמו 3 שאלות בתרגול ושאר הזמן הולך על הסברים).\n\nשעורי הבית: כל שבוע יש וובוורק וגיליון. הגיליונות יחסית קשים ולא היו חובה אבל הם עוזרים ברמות להבין את החומר ולהבין איך לגשת לתרגילים, איך לנסח הוכחות ובכללי מעלים את הרמה אז מומלץ לעשות במהלך הסמסטר ולא רק לפני המבחן (יש מספיק מבחנים משנים קודמות לתרגל לפני המבחן גם בלי הגיליונות)\n\nהמבחן: הוגן\n\nהשורה התחתונה: קשה אבל אפשרי", "timestamp": 1716917873416}, {"author": "אני", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אביב צנזור \nחוות דעת - הרצאות: מסביר יותר מידי לעומק אבל אין ממש ברירה אחרת - אולי עדיף לעשות קורס מ gool או studies שם הם יותר תכלס לפי מה ששמעתי \n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: יותר מידי טריקים שלא באמת שימושיים קצב מטורף ולא באמת פרקטיים למבחן כלכך \n\nשעורי הבית: קשים אבל תשקיעו זה יכול לעזור לכם אחר כך \n\nהמבחן: תתחילו ללמוד כמה שיותר מוקדם רק ככה מצליחים להבין \n\nהשורה התחתונה:", "timestamp": 1716976188712}, {"author": "סטונדט לנתונים", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אביב צנזור\nחוות דעת - הרצאות: חפרו עליו מספיק אבל הוא באמת מרצה טוב. היופי זה שיש רשימות של ההרצאות שלו וההקלטות זהות אחד לאחד להרצאות, פרט לחומר שיורד לפעמים. אפשר לראות הכל מוקלט ולהתעדכן מחברים על מה הוא לא עבר.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מעולה, מצליח לשמור על פוקוס של הכיתה, עושה הרבה תרגילים אבל בקצב נורמלי לעומת מתרגלים אחרים. נוטה לפעמים לכתוב תשובות ארוכות מהצפוי/תשובות שחוזרות על עצמן במעגלים, אבל העיקר שהוא עונה על הנדרש.\n\nשעורי הבית: קשים מאוד. קל להיתפתות ללא לעשות את הגיליונות בשנים שההגשה שלהם היא לא חובה אבל אי אפשר להצליח בקורס בלי לעשות אותם. הוובוורקים גם קשים אבל יותר אפשריים.\n\nהמבחן: קשה אך הוגן, היו הרבה התחשבויות בגלל המלחמה, צנזור הוריד את שאלת הג'ורג'י הסגורה והוסיף סעיפים קטנים לשאר השאלות. צריך פשוט לתרגל המון מבחני עבר כדי להבין את כל הטריקים ולהצליח.\n\nהשורה התחתונה: קורס קשה אבל חובה, אז אין מה לעשות. קחו אותו ברצינות ותשקיעו בו כנדרש.", "timestamp": 1717049201119}]}