{"posts": [{"author": "R", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רם בנד\nחוות דעת - הרצאות: \nההרצאות היו מעניינות ויסודיות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: גיליון שבועי, צריך להגיש 8 מתוך 12, והמגן הוא שאלת שיעורי בית שתופיע במבחן\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612432156785}, {"author": "Jared Goldberg", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איליה גכטמן\nחוות דעת - הרצאות: הקורס הועבר באנגלית, ואיליה די מבולגן ולעטים קרובות לא הכי ריגורוזי. יותר חשוב לו להעביר אינטואיציה לגבי המושגים ולהבין למה הוכחות עובדות מאשר להתקטנן על כל הוכחה. הוא קצת מוזר והגישה מאוד... בואו נגיד מיוחדת אבל אם מתחברים אז זה ממש אחלה. אני מאוד נהניתי. \n\nשם המתרגל/ת: ללא\nחוות דעת - תרגולים: \n\nשעורי הבית: היו 50% מהציון. היו 4 גליונות סה\"כ, 2 ממש ממש קשים ו2 סבירים. התרגילים היו מאוד רלוונטים והרבה מהלמידה תכלס קרתה שם. בסוף לא נראה לי נבדקו ולדעתי כולם קיבלו 100\n\nהמבחן: 25% מבחן באל פה שהיה מאוד הוגן, ומבחן בית שהיה די קשה אבל פתיר. \n\nהשורה התחתונה: איליה העביר כפול החומר שבדרך כלל מועבר בקורס הזה, וזה הגיע על חשבון קצת עומק בנושא הראשון שהוא ראה כפחות מעניין, אבל אני אישי שמח שכן כי החומר שהוא הוסיף על גאומטריה היפרבולית מאוד מאוד מעניין ומרגיש מאוד תכלס כאשר הרבה קורסי מתמטיקה אחרים מרגישים מעט מנותקים בעיניי.", "timestamp": 1647437002794}, {"author": "5 טטרהדר פוליהדרה", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: אווירה נהדרת, טלי קשובה לשאלות של סטודנטים, יש דיונים בכיתה. החומר די קל ולא מסובך מדי. לפעמים טלי לא הייתה מסודרת ולא תמיד הכול היה ברור אבל סה\"כ היה בסדר גמור.\n\nשם המתרגל/ת: טלי פינסקי\nחוות דעת - תרגולים: התרגולים הם בעצם ההרצאה השלישית בשבוע, שהופכת לסדנה בכיתה. הסדנאות עזרו בהחלט להבין את החומר, היו מעניינות ומיוחדות והייתה אווירה כיפית. יש סדנאות שבהן כל צמד מקבל משימה שונה ולכן זה דורש לחשוב עצמאית ממש. למשל סדנה שבה כל אחד מקבל ריצוף שונה במישור ומחפש סימטריות, או פוליהדרון שונה, או ריצוף שונה במישור היפברולי. מעניין ומגניב.\n\n\nשעורי הבית: אין, זה רק להמשיך את הסדנה אם לא מספיקים בכיתה.\n\nהמבחן: זורם ונחמד מאוד. כפי שרואים הרבה הוציאו 100, לי היו קצת קשיים בהבנה של אחת השאלות אז זה הכשיל אותי אבל לא נורא. \n\nהשורה התחתונה: מבחינתי קורס העשרה מגניב והיה כיף עם טלי. מה שלומדים בחבורות ולא מבינים רואים פה בצורה קונקרטית וזה עושה את כל התחום של הגיאומטריה ותורת החבורות ברור הרבה יותר.", "timestamp": 1678619476485}]}