{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: משה ברוך\nחוות דעת - הרצאות: \nמרצה נהדר, מסביר בצורה ברורה ובהירה את החומר, מאוד חשוב לו שכל הסטודנטים יבינו את החומר הנלמד ורואים את זה בשיטת הלימוד שלו. אפילו בזום היה לו חשוב להכיר בשם את רוב הסטודנטים וזה היה נחמד.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nיחסית לתרגול של שעה בשבוע, הרגשתי שאנחנו מספיקים המון תרגילים ולומדים המון. סתיו מתרגל מצוין, הסביר את החומר בצורה טובה וגם ניסה לתת אינטואיציה מאחורי התרגילים, מבלי לוותר על הפורמליות. \n\nשעורי הבית: \nהיו 6 תרגילי בית פתוחים בסמסטר הזה, עם ציון בינארי (עובר/לא עובר) עליהם. רוב התרגילים לא מאוד קשים אבל כולם טובים לתרגול החומר.\n\nהמבחן:\nלא קשה מדי, אם מבינים את החומר, עוברים על ההרצאות ועל התרגולים ומתרגלים כמה מבחנים אפשר להוציא ציון גבוה.\n\nהשורה התחתונה: \nמומלץ בחום, במיוחד עם משה ברוך. קורס מעניין עם סגל מצוין, שאפילו אפשר להוציא בו ציון טוב.", "timestamp": 1614076607593}, {"author": "ר'", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות: \nמרצה מוכשר ואכפתי, הרצאות מרתקות שהחומר הועבר בהן באמצעות סיכומים שהמרצה משלים בהרצאה שאפשרו למעוניינים בכך להשלים בעצמם את הסיכומים תוך כדי ההרצאה. ניר פתח דלת לעולם המרתק של החבורות בבנייה הדרגתית וברורה של החומר והוכחות יפות ומסודרות. ניר הרבה לקשר את התחום של החבורות לעולמות נוספים במתמטיקה וכך לבנות אינטואיציה לעולם החבורות.  \nשם המתרגל/ת: שקד בדר\nחוות דעת - תרגולים: תרגולים מעולים שרק הוסיפו להרצאות הנפלאות, באמצעות תרגילים שמתחברים לנושאי ההרצאה בצורה מצויינת. שקד הסבירה את התרגילים בצורה מעולה שרק העשירה את הסטודנטים.\n\nשעורי הבית: נחמדים ויפים למדי, תרמו רבות ללמידה.\n\nהמבחן: הוגן למדי, ולראיה ניתן להביט בממוצע.\n\nהשורה התחתונה: 10/10", "timestamp": 1635368536071}, {"author": "ברנסייד( זה מהלמה)", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות:  \nבן אדם נהדר ונעים הליכות, מסביר את החומר בצורה טובה מאוד, קצת עצלן אבל בטוב טעם. כולו לב לסטודנטים ורואים את זה. קצת רץ אם יש אנשים שמזרזים אותו, אם אתם מאבדים אותו , תבקשו ממנו שיתחשב , הוא בשמחה יעשה את זה.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: אחלה מתרגל, מסביר את החומר בצורה טובה מאוד ונותן אינטואיציות מעולות לחומר, היה שווה לקחת את הקורס רק בגללו, לפעמים קצת רץ, שווה לשאול אותו שאלות מעמיקות ולעצור אותו כשצריך.\n\nשעורי הבית: מאתגרים, אבל פתירים ללא ספק, סתיו פרסם לנו הקלטות עם פתרונות של הגליונות, מה שעשה את זה יותר קל משמעותית להבין לעומק את השאלות ואת החומר , גם בסמסטר עצמו וגם בחזרה על החומר למבחן.\n\nהמבחן: הוגן מאוד, בחן הבנה בקורס פרופר.( למרות שהיו שאלות שגם שינון היה פותר אותם)\n\nהשורה התחתונה: קורס יפהפה, מי שאוהב אלגברה ודברים שמסתדרים יפה יאהב את הקורס הזה, למרות שהוא נראה קשה בהתחלה, שווה להשקיע בו מאוד , לדעתי האישית הוא מתגמל מאוד.", "timestamp": 1657445069248}, {"author": "מישהו", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות: מרצה מעולה, מסביר מאוד ברור ומעלה רשימות מההרצאה והקלטות שמאוד עוזרות. לפעמים רץ על החומר ככה שמספיקים דברים שמרצים אחרים לא תמיד יספיקו, אבל מאוד פתוח לשאלות בזמן ההרצאה\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: זה סתיו ברמן, אני חושב שנאמר עליו מספיק, תרגולים מצויינים + רשימות\n\nשעורי הבית: יחסית קשים אבל מאוד עוזרים להבין, היו סה\"כ 6 גיליונות ככה שהיה הרבה זמן לשבת על כל אחד\n\nהמבחן: יחסית קל, נבדק בהוגנות (באופן כללי גם בבוחן אמצע מרגיש שהסגל באו לבדוק הבנה ולא התקטננו) \n\nהשורה התחתונה: קורס מעולה, כיף, ולא עמוס", "timestamp": 1657558201081}, {"author": "אורי בן חור", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ניר לזרוביץ\nחוות דעת - הרצאות: \nמרצה מעולה,לפעמים נוטה לרוץ קצת אז חשוב לעצור אותו ולשאול,תמיד שמח לענות\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nמתרגל שמבין את החומר ומעביר אותו מצוין,לפעמים נוטה ללמד משפטים שלא היו בהרצאה ומאוד שימושיים אז חשוב לדאוג להבין אותם\nשעורי הבית: \nהוגנים לחלוטין,לא ממש היתה בדיקה זה היה אצלנו רק הגיש לא הגיש אבל הם מעולים להבנת החומר\nהמבחן: \nחוץ משאלה אחת שהיתה לקלוט את הטריק היה הוגן לגמרי,שאלת שיעורי בית שמשמשת כמגן ובגלל שאין בדיקה לשיעורי הבית חשוב לוודא שעשיתם אותם כמו שצריך\nהשורה התחתונה: הוגן לחלוטין,סגל מצוין", "timestamp": 1659356165091}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נואר צבי יעקב (הווארד)\nחוות דעת - הרצאות: \nהווארד ממש טוב. הוא מרצה לפי הרשימות של ניר אז אם אתם לא יכולים להגיע להרצאות יש דרך ממש מסודרת להשלים הכל. בנוסף לכך הוא יודע להסביר ממש טוב ותמיד עונה לסטודנטים על שאלות והוא באופן כללי בן אדם ממש נחמד, ממש כיף להיות בהרצאות ויש אווירה מאוד נעימה.\n\nשם המתרגל/ת: פלזנשטיין ים ירחמיאל\nחוות דעת - תרגולים: \nים מתרגל ממש ממש טוב. אם לא הייתי יודע שזה הסמסטר הראשון שהוא מתרגל, באמת לא הייתי מנחש. הוא יודע לעבור על כל החומר בצורה טובה, נותן תרגילים מגניבים ומעניינים (באמת נהנתי לפתור חלק מהגיליונות) ומתקשר עם הסטודנטים בצורה טובה. אני שמח שהייתה לי את האופציה לקחת קורס שהוא מתרגל.\n\nשעורי הבית: \nיש סעיפים שדורשים יותר מחשבה אבל בגדול ים יודע לתת שאלות מגניבות שדורשות מחשבה ועוזרות להבנה של החומר.\n\nהמבחן: \nממש הוגן. אפשר לראות שים והווארד באו לקראתנו ועם מחשבה של לתגמל סטודנטים שהשקיעו בלמידה למבחן.\n\nהשורה התחתונה: \nקורס כיף, נהנתי, מחכה למבחו\"ש", "timestamp": 1689592291489}, {"author": "סילו", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: הווארד\nחוות דעת - הרצאות: לא טוב. הווארד הקריא מהרשימות של ניר לזרוביץ, לא היה שום תועלת/ ערך מוסף. רמת הוראה ורמת למידה מאוד נמוכה.\n\nשם המתרגל/ת: ים\nחוות דעת - תרגולים: הוא עוזב את הטכניון אז זה לא משנה.\n\nשעורי הבית: מאוד קשים, לא פרופורציוניים לרמת החומר הנלמד בהרצאה / בתרגול.\n\nהמבחן: ממוחזר כמעט כולו ... באמת מביך.\n\nהשורה התחתונה: סגל לא טוב לקורס שכולם אומרים שהוא טוב. אני מאוד מאוכזב", "timestamp": 1690391470497}, {"author": "חבורת מנות השווארמה", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: צבי נואר (האוורד) יעקב\nחוות דעת - הרצאות: קראתי את שתי הביקורות הקודמות על האוורד ולא הסכמתי עם אף אחת מהן. לדעתי היו להאוורד כמה וכמה הרצאות שהיו סך הכל די ברורות, וחלק שהתקשיתי להבין בהן למה הוא מתכוון ומה הפואנטה. סך הכל, הייתי מסכם ואומר שהוא סבבה, וגם מאוד עזר שהוא פרסם את הרשימות המדויקות של הקורס (אמנם רק בסוף הקורס, חבל שלא פירסם קודם). כמרצה, הוא הסביר לרוב בסדר וגם הראה רצון לענות על שאלות של סטודנטים.\n\nשם המתרגל/ת: ים פלזנשטיין\nחוות דעת - תרגולים: הבנתי שהוא עובר לחו\"ל אז לא יודע אם זה רלוונטי, אבל הוא פירסם רשימות מאוד ברורות וטובות, והראה רצון טוב לענות לסטודנטים על שאלות והיה לו חשוב שכולם יבינו. מצד שני, התרגולים היו לי בקצב מהיר מאוד והרבה פעמים הייתי צריך לעבור על הרשימות (המעולות) שלו בבית כדי להבין מה הלך.\n\nשעורי הבית: קשים וארוכים בקטע מוגזם בעיניי. אומנם חשוב היה לעשות אותם כדי להבין את החומר, אבל לדעתי היה צריך להפחית מהעומס הלא פרופורציונלי הזה לרמת הקורס.\n\nהמבחן: לא נורא בכלל יחסית. 7 שאלות, צריך לענות על 6, 3 חובה ו3 בחירה מתוך 4. (רוב הניקוד היה בחלק של הבחירה). 42 נקודות לכל המבחן, 3 לכל סעיף. זיהיתי בזמן המבחן שתי שאלות שלמות ממבחני עבר, היו כאלה שאמרו שהייתה עוד אחת. הייתה גם אחת דומה לשיעורי בית עם טוויסט שלא הצלחתי להבין, אבל היא הייתה רק בניקוד של סעיף (3 נק'). \n\nהשורה התחתונה: היה עמוס מאוד בגלל הש\"ב, וגם ההרצאות והתרגולים לא היו תמיד ברורים (אם כי ההרצאות לרוב כן לפי דעתי). הקורס הזה כולל המון הגדרות וצריך לשלוט בהמון חומר כדי כל הזמן להיות בעניינים ולהבין מה הולך. למרות זאת, המבחן היה ברמה סבירה, מה שהציל בעיניי את הקורס הזה.", "timestamp": 1691570003197}, {"author": "נדב צלניקר", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלי אלחדף\nחוות דעת - הרצאות: \nאלי קצת איטי אבל הרבה פעמים זה טוב כי יש הרבה הגדרות והוא נותן זמן לעכל\nמבין את החומר ממש טוב ולא עושה טעויות\nחומר מעניין!\nשם המתרגל/ת: טלי מונדרר\nחוות דעת - תרגולים: \nתרגולים טובים אבל לא חדה כמו אלי\nשעורי הבית: \nמאוד חשובים להבנת החומר ולדעתי כיפיים כי תרגילים בחבורות מרגישים כמו חידות שצריך למצוא את ההסתכלות הנכונה (קצת כמו תרגילים בקומבי בקטע הזה)\nהמבחן: \nהיה סעיף אחד של 7 נקודות שמעט מאוד הצליחו כי היה צריך טריק לא מוכר חוץ מזה הוגן (לי למשל ירדו נקודות רק עליו)\nהשורה התחתונה:\nברור שלקחת", "timestamp": 1715669282585}, {"author": "החבורה הדיהדרלית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלי אלחדף\nחוות דעת - הרצאות: הקצב בהרצאות איטי ולדעתי החומר עבר בצורה קצת משעממת. בנוסף הרבה פעמים אלי עשה כל מני קפיצות לוגיות לא טריוויאליות ואם לא עוצרים ושואלים אותו אז יש הרבה על מה לחשוב אחר כך. חוץ מזה אלי שולט בחומר בצורה מטורפת ואפשר לשאול אותו באמת כל דבר, והוא תמיד שמח לענות.\n\nשם המתרגל/ת: טלי מונדרר\nחוות דעת - תרגולים: ברוב התרגולים קיבלנו כל מני משפטים שהיו קריטיים לשיעורי בית אבל ללא הוכחה, והיו כל מני דוגמאות ותרגילים שטחיים שפחות עוזרים להתמודד עם הגיליונות. היה חסר פתרון של תרגילים מורכבים והצגת טריקים ודרכי חשיבה. סה\"כ הייתי אומר שבמתכונת שהתרגולים עברו היה אפשר לדלג עליהם. חוץ מזה, טלי נחמדה ושמחה לעזור ולענות על שאלות אז כן מומלץ להיעזר בשעות הקבלה שלה.\n\nשעורי הבית: גיליון בערך פעם בשבועיים. בהתחלה נראו תמימים וקלילים, אבל מהגיליון השלישי בערך הם היו קשים וארוכים ולקחו לא מעט זמן. לא קיבלנו בתרגולים מספיק כלים פרקטיים לפתור אותם והיה צריך לעשות קפיצה מחשבתית מאוד גדולה מהחומר בהרצאות לפתרון תרגילים.\n\nהמבחן: היה הוגן סה\"כ, אבל הבדיקה הייתה קטנונית לדעתי וירדו הרבה נקודות על כלום ושום דבר.\n\nהשורה התחתונה: במהלך הסמסטר הקורס היה לי קצת משעמם ודברים לא התחברו לי, אבל בסוף הסמסטר כשלמדתי למבחן פתאום הכל התחבר וסה\"כ זה קורס חמוד עם כל מני תוצאות יפות ומגניבות. מה שכן, הוא לא קורס פשוט בכלל וצריך להפנים את החומר כדי להעריך אותו.", "timestamp": 1715683271137}, {"author": "סטודנט ממוצע בפקולטה למתמטיקה", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אליהו אלחדף\nחוות דעת - הרצאות: \nבסדר \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nסביר\nהמבחן: \nבדיקה גרועה מאד כנראה כדי לנרמל ממוצע לא פעם ראשונה שזה קורה ועדיין מבאס לקבל 0 אם השאלה נכונה חלקית וחצי מהניקוד על פתרון שזהה לפתרון הרשמי מלבד שורה אחת\nהשורה התחתונה:\nאין על הסגל של הפקולטה", "timestamp": 1715763752952}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  אלי אלחדף\nחוות דעת - הרצאות: \nמסביר טוב וחי את החומר. לא נותן תמונה רחבה, רק אחרי שראיתי סרטונים ביוטיוב של צילג החומר התחיל להתחבר.\nשם המתרגל/ת: טלי מונדרר\nחוות דעת - תרגולים: \nהסבירה שוב את מה שהיה בהרצאה לפעמים מזווית קצת אחרת. לא פתרה תרגילים בכלל\nשעורי הבית: \nדי קשים(כנראה בגלל שלא פותרים תרגילים בכיתה)\nהמבחן: \nהיה מבחן הוגן מאוד והבדיקה גם הייתה בסדר\nהשורה התחתונה: \nעם סגל שמכניס קצת יותר התלהבות היה יכול להיות אולי קורס נחמד", "timestamp": 1716387763670}]}