{"posts": [{"author": "אידאל ראשי", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: עמוס נבו\nחוות דעת - הרצאות: הכפיל של נשיא המדינה רובי ריבלין היה מרצה טוב מאוד הרבה מאוד סיפורים והרבה מלל, אבל אולי יותר מדי מלל. \n\nשם המתרגל/ת: יוני \nחוות דעת - תרגולים: מאוד אהבתי. יוני מתרגל מצוין, בלי לחץ, באווירה נינוחה. הייתה למידה פעילה, הוא נתן לנו לחשוב, לענות, לנסות גם לתקן את עצמנו ואז היה ממשיך ומסיים את השאלה עם הדרך שהצענו לעתים קרובות. לא רואים כמעט דברים כאלה בתרגולים וזה מדהים. \n\nשעורי הבית: לא קשים מדי אבל יש על מה לחזור ולעכל את החומר. \n\nהמבחן: הוגן ובסדר. לצערי היה לי זמן מועט להתכונן והרגשתי שלא מיציתי את היכולת שלי ופספסתי הזדמנות להוציא ציון ממש טוב כי הבחינה בדיעבד הייתה די קלה. \n\nהשורה התחתונה: קורס די מעניין.", "timestamp": 1610241919555}, {"author": "שם או כינוי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  מיכה שגיב\nחוות דעת - הרצאות:  לא הייתי\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים:  לא הייתי\n\nשעורי הבית: לא עשיתי\n\nהמבחן: שני המועדים מאוד הוגנים, הבנתי שאחרים התלוננו על הבדיקה אבל אני מרגיש שקיבלתי יותר ממה שהייתי אמור (אם כי עוד לא הגיעו הסריקות)\n\nהשורה התחתונה: קורס די חביב, מאוד בוייב של חבורות מה שלעתים יכול להיות משעמם, אבל יש בו דברים יפים בלי ספק והחלק על שדות בסוף נהדר", "timestamp": 1678887764195}, {"author": "לא קומוטטיבי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: פרופ' ז'יטו הנכבד\nחוות דעת - הרצאות: כיף- כן! לומדים- (?).\n\nשם המתרגל/ת: סתיו.\nחוות דעת - תרגולים: כיף- כן. לומדים- כן. סיכומים מושקעים, תודה!\n\nשעורי הבית: בניגוד להרצאות הדיי אמורפיות, הסיכומים ושיעורי הבית של ז'יטו מסודרים ומאורגנים להפליא. אהבתי את הקשר הישיר לחומר ואת המדרגיות של שיעורי הבית. מגן 15% במתנה רק על הגשה.\n\nהמבחן: דיי חריג בנוף כי מותר להשתמש במה שרוצים (כולל אינטרנט), אז כמובן שלא כולל הגדרות או הוכחת משפטים. זה ובנוסף \"דף רמזים\" אלמותי שנשלח במייל לפני המבחן. למרות זאת הממוצע אחרי מועד א' לא היה גבוה.\n\nהשורה התחתונה: בלתי נשכח.", "timestamp": 1690349728523}, {"author": "הסיני שלא סיים את הארוחה שלו", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דני נפטין\nחוות דעת - הרצאות: מרצה סבבה, ניכר שמבין את החומר, אבל לא מאוד כריזמטי\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: וואו! מתרגל מדהים, הגיליונות ממש מעניינים ומעוררי חשיבה, מומלץ בחום!\n\nשעורי הבית: כמו שציינתי, אחלה גליונות,  שאלות הבחירה היו מעשירות\n\nהמבחן: היה מבחן קל יחסית.\n\nהשורה התחתונה: קורס מדהים! חומר מרתק, ממליץ בחום", "timestamp": 1716318511308}]}