{"posts": [{"author": "sari hleihil", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רם בנד\nחוות דעת - הרצאות: משקיע הרבה, סיכומים מדהימים, אבל הוא מוסיף הרבה חומר מעבר - זה מגניב - אבל זה שורף הרבה זמן.\n\nשם המתרגל/ת: לא בטוח\nחוות דעת - תרגולים: הסיכום טוב ומספיק, אישית לא הלכתי לתרגולים.\n\nשעורי הבית: שבועיים ארוכים וקשים, אבל כן מלמדים וחשובים להבנה. \n\nהמבחן: הוגן ביותר, ברמה דומה למבנים של כל המרצים האחרים בקורס, בגדול דור הבנה עמוקה להגדרות ולכלים הבסיסיים, ופחות מדגיש על ההוכחות הארוכות והמסורבלות.\n\nהשורה התחתונה: קורס מגניב! ומרצה שאוהב לתת וללמד לעומק, אבל כן עמוס ביחס ל 3 נק\"ז(להשוואה זה לקח לי בערך אותו זמן ש אינפי 3 לקח),אז אם יש לכם את הזמן מומלץ בחום.", "timestamp": 1600773085881}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "קורס קשה ועמוס, במיוחד עם רמי. הוא כן קורס מעניין, ולומדים בו הרבה מושגים שאני מאמינה שיוצא להיתקל בהם בהמשך בהרבה תחומים במתמטיקה", "timestamp": 1602318505791}, {"author": "טופולוגיים קו מניה", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: מיכאל אנטןב\nחוות דעת - הרצאות: מרצה חכם מאוד, רמה גבוהה. פחות אדיב, לא מדבר בגובה העיניים. הכול כמעט היה מופשט לגמרי בחומר והיה חסר לי דוגמות קונקרטיות. \n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: עמוסים מאוד. טוב שהיו דפים מודפסים שאפשר היה לעבור עליהם. \n\nשעורי הבית: יש הרבה. לדעתי היה קשה. זה גם כי לא עשיתי אינפי 3 לפני / במקביל אז באמת הכול היה חדש לי לגמרי והיה קשה במיוחד בחצי השני של הקורס לעכל את החומר. \n\nהמבחן: היה לי קשה, אבל זה במיוחד בגלל הקורונה שמועד ב נדחה חצי שנה קדימה ושחזור החומר לבחינה היה על גבול הבלתי אפשרי אחרי שכבר עבר סמסטר שלם. \n\nהשורה התחתונה: להגיע מוכנים אחרי אינפי 3 או במקביל אליו אחרת יהיה באמת קשה.", "timestamp": 1610241636228}, {"author": "בייר", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: הרצאות נפלאות\nמאוד ברורות ונורא פורמליות (לפעמים קצת יותר מדי אבל הוא בדכ גם נותן ציור שמסביר)\nבנוסף מעלה סיכומים מוקלדים בליך מדהימים\n\nשם המתרגל/ת: שקד לייבזירר\nחוות דעת - תרגולים: מצויינים\nממש מפקס על החומר חלק מהזמן עשה דברים לא קשורים ויופים\n\nשעורי הבית: יפים ולא קשים במיוחד \nמדי פעם יש תרגיל ממש קשה \n\nהמבחן: עשיתי רק את המועד ב והוא היה לדעתי סביר במיוחד והוגן , כל שאלה התחילה בהגדרות\n\nהשורה התחתונה:", "timestamp": 1635094282261}, {"author": "היי", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: טלי פינסקי\nחוות דעת - הרצאות: \nמאוד מעניינות, המון חומר ולפעמים קשה לא להיאבד נטו בגלל הכמויות והרמה בקורס הזה, טלי לפעמים נוטה להתבלבל קצת אבל היא ממש מקסימה ותמיד מוודאת שכולם על החומר, גם אם זה לוקח זמן\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nאח יקר, מתרגל טוב מאוד\nשעורי הבית: \nמאוד מאוד לא עמוסים, חמישה גיליונות סה\"כ מתוכם 4 להגשה, עם בקרת עמיתים שהוסיפה עוד מגן אופציונלי, אבל הבנתי שסמסטרים קודמים היו שיעורים עמוסים מאוד אז כנראה תלוי סמסטר\n\nהמבחן: מלחמת התשה, מבנה סטנדרטי של חמש שאלות, רובן היו בסדר חוץ מסעיף אחד שהיה ברמה מעל השאר ועוד אחד שבאמת היה על סף הלא פתיר, מה שכן הבדיקה הייתה מאוד רחמנית להרגשתי וניתן פקטור של 10 נקודות\n\nהשורה התחתונה: קורס יפהפה, חשוב מאוד ועמוס מאוד, המון חומר ברמה גבוהה, להתכונן בהתאם", "timestamp": 1661896044744}, {"author": "אוריסון", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: ארז הוא דמות שנויה במחלוקת בפקולטה, ויש לו שם לא טוב. אבל בתכלס, מי שממשיך להגיע להרצאות ומי שמגיע לשעות קבלה שלו מבין שהוא ממש אחלה. יש לו המון רצון טוב לעזור ולהרחיב אופקים לסטודנטים, לא תמיד הוא מצליח להעביר את זה בכיתה פשוט. לקראת סוף הסמסטר יכולות ההוראה שלו עלו ברמה מאוד, מקווה מאוד שישאר ככה לסמסטר הבא.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: מתרגל מצוין. רץ ולפעמים קשה לעקוב אחריו, אבל בסוף היום הוא בוחר תרגילים טובים לתרגול, נותן מענה מצוין בכיתה ובשעות קבלה, יש לו רשימות תרגול טובות. בקיצור מתרגל מצוין.\n\nשעורי הבית: קשים, אבל הקורס קשה אז אין מה לעשות. צריך להשקיע\n\nהמבחן: קשה אבל בסוף בדיקה הוגנת וממוצע טוב.\n\nהשורה התחתונה: קורס מצוין אבל קשה מאוד.", "timestamp": 1690449209484}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: \nהיו המון ביקורות על ארז במהלך הסמסטר. חלקן לגיטימיות לפי דעתי וחלקן פחות. בסופו של דבר כשההערות הללו באו לתשומת ליבו של ארז הוא באמת השקיע יותר מאמץ לענות על הבקשות של הסטודנטים והיה אפשר לראות את העלייה ברמה של ההרצאות. לפי דעתי ארז מרצה טוב ומאוד נהנתי לקחת איתו את הקורס ואני בטוח שהוא יעביר את הקורס בצורה אפילו יותר טובה בחורף לאחר שאימץ את הטיפים של הסטודנטים כפי שהיה ניתן לראות בהרצאות האחרונות.\n\nאם אתם סטודנטים ששוקלים לקחת מטרו בחורף הקרוב ושמעתם דברים מפחידים מסטודנטים אחרים, אני ממליץ לקחת את הקורס היפה הזה עם ארז במקום לחכות סמסטר. אמנם הייתה ביקורת עליו במהלך הסמסטר, אך הוא ממש השתפר ולמד ואין סיבה לא לקחת איתו את הקורס.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: \nבכל הקורסים שלקחתי עם סתיו הוא תמיד היה מתרגל מצויין וזה כלל לא השתנה.\n\nשעורי הבית: \nיש שאלות יותר קלות ושאלות יותר קשות. מדי פעם יש גם כמה שאלות יותר טכניות לא כיפיות אבל כן חשוב שנדע לפתור שאלות כאלו.\nהיה אפשר לראות שסתיו ממש השתדל שרוב השאלות בתרגילי הבית יהיו יפות וכיפיות ואני אישית מאוד נהנתי מהן. (גם משאלות הלא להגשה שסתיו הוסיף בסוף כל גיליון).\n\nהמבחן: \nבתור מישהו שפתר המון מבחנים והרגיש ממש חזק על החומר. לפי דעתי המבחן היה קשה ביחס לשנים קודמות, אך ארז פיצה על כך עם בדיקה מאוד מקלה ובסופו של דבר הממוצע היה יחסית גבוה לקורס.\n\nהשורה התחתונה: \nעוד דבר שלא ציינתי הוא שארז פרסם 2 שאלות רשות שמי שפותר אותן מקבל 2 נקודות בונוס לציון הסופי של הקורס, מרגיש לי שהשאלות עזרו לי להבנה של החומר ואני שמח שארז נתן את האופציה הזו.\n\nמטרו הוא בוודאות אחד מהקורסים הכי כיפיים שלקחתי בינתיים ואני מאוד ממליץ עליו. גם מאוד נהנתי לקחת אותו עם ארז וסתיו ואני מרגיש שרמת ההוראה של ארז לקראת סוף הקורס הייתה מצויינת.", "timestamp": 1691190797670}, {"author": "למת הצינור", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ד\"ר ארז נשרים\nחוות דעת - הרצאות: ארז העביר את הקורס בפעם הראשונה ובצירוף העובדה שהוא לא המרצה הכי מסודר ומספר סטודנטים נטו להציג את חוכמתם, ההרצאות בתחילת הסמסטר היו לא טובות. לקראת סוף הסמסטר ארז השתפר מאד, וההרצאות היו מאד טובות, מסודרות וברורות. בנוסף, ניכר כי ארז מאד השקיע והיה תמיד זמין לשאלות בהרצאות ובשעת הקבלה.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: מתרגל מעולה. לסטודנט הממוצע הוא רץ בתרגול אבל הוא מעלה רשימות מוקלדות וזמין לשאלות בשעת הקבלה ככה שהוא בעצם נותן מענה לסטודנטים בכל הרמות.\n\nשעורי הבית: היה גיליון פעם בשבוע עם שאלות חובת הגשה וגם כמה שאלות בונוס שלא היה חובה להגיש. באופן כללי הגיליונות תרמו מאד להבנת החומר.\n\nהמבחן: בסופו של דבר חוץ מסעיף ארור, המבחן היה הוגן מאד. הוא כלל בחירה של 4 שאלות מתוך 5. ובנוסף ארז נתן 2 שאלות בונוס די ארוכות שהגשת פתרון נכון זיכתה ב2 נק' בונוס לציון הסופי.\n\nהשורה התחתונה: קורס מדהים. מאד ממליץ לקחת עם ארז בחורף על אף כל השמועות.", "timestamp": 1691657039433}, {"author": "+", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: אל תקשיבו לביקורות הקודמות, הן נכתבו מתוך רחמים על ארז כי לקראת סוף הסמסטר הוא בא לכיתה עצובי שהתלוננו על ההוראה שלו וביקש שנעביר אותו במשאל המרצה כי לטענתו הוא ממש השקיע. אבל בסופו של דבר, היה בלתי אפשרי לעקוב אחר ההרצאות שלו, גם הוא בעצמו לא עקב. לא מסודר, הגדרות ומשפטים לא מנוסחים באופן ברור וחד-משמעי, ומעבר לזה לא מוסיף עניין או מוטיבציה לחומר. לא סיפק מקור אמין להשלים ממנו את החומר באופן שמתאים לסדר שבו לימד את הקורס עד הרגע האחרון (\"הקורס מבוסס על 3 ספרים\" + אין לו רשימות). התוצאה היא שחלק עצום מהסטודנטים דילג על מועד א' כדי ללמוד את הקורס מחדש ממקור אחר בקיץ, ולכן גם ההיסטוגרמה של מועד א' לא נוראית.\n\nהשורה התחתונה: אם יש לכם אופציה לדחות למתי שיהיה מרצה אחר - דחו את הקורס.", "timestamp": 1693835410356}, {"author": "סובל בכיף", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: אל תקשיבו לאנשים שאמרו שהוא \"השתפר\". הוא לא. הוא באחת מההרצאות האחרונות ביקש מפורש לרחם עליו כי זה פעם ראשונה שהוא מעביר את הקורס הזה.\nבכל הרצאה שהייתי בה הייתי צריך לקרוא סיכום של מרצה אחר או לראות הסבר כלשהו, כי אי אפשר להבין מה ארז רוצה. הוא מגלה את החומר תוך כדי שהוא מלמד. אני די בטוח שהוא בעצמו לא על מה החומר או מה הוא אומר בכלל. נותן דוגמאות שאיכשהו מצליחות לסבך את החומר יותר מההסבר הנורא שלו.\n\nשעורי הבית: לא בלתי אפשריים אבל קשים. ממליץ לעשות עם אנשים אחרים\n\nהמבחן: אפשרי אם מבינים את החומר. הורדת ניקוד על כל דבר אפשרי ללא רחמים\n\nהשורה התחתונה: חד משמעית - לא לעשות את הקורס הזה עם ארז! תקחו את הקורס הזה עם מישהו יודע ללמד, זה קורס קשה גם ככה, אל תקשו עוד יותר", "timestamp": 1693837029135}, {"author": "בייר בכבודו ובעצמו", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: לא הלכתי, הרשימות של ארז די טובות, אבל הוא נהג לכתוב שבוע קדימה ברשימות ואז לתקן שבוע אח\"כ כשהחומר אזכרה הועבר בכיתה, אז ממליץ לקרוא רק עד החומר הרלוונטי\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: לא הלכתי לתרגולים, אבל הגיליונות שהוא רשם מדהימים.\n\nשעורי הבית: ממש ממש ממש טובים, יש בכל גיליון שאלות בחירה שגורמות לאקסטרה חשיבה ומפתחות אקסטרה הבנה של החומר,\nבנוסף לאורך הסמסטר פורסמו 4 שאלות בונוס שמקנות כל אחת נקודה בונוס לציון הסופי, ממליץ לעשות אותן גם בלי קשר לציון - הן ממש מגניבות וממש מעניינות.\n\nהמבחן: מבחן די קשוח, אפילו עם הארכת זמן התקשיתי,  במיוחד כי שאלות במטרו קשות גם עם אתה על החומר כי הן דורשות חשיבה אבסטרקטית מפותחת\n\nהשורה התחתונה: קורס מרתק!!!! ממליץ בחום לכל מי שיכול", "timestamp": 1716319854963}, {"author": "קומפקיפיקציה חד-נקודתית", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ארז נשרים\n\nחוות דעת - הרצאות: ארז עובד עם רשימות שהוא מעדכן במהלך ההרצאות. לטעמי, הוא מאוד השתפר מקורס קודם שלקחתי איתו, וגם תוך כדי הסמסטר. בערך 80-85 אחוז מהחומר שהוא העביר היה בסדר גמור, השאר היה צורך להסתכל ברשימות שלו או להבין ממקורות אחרים. \n\nשם המתרגל/ת: סתיו ברמן\n \nחוות דעת - תרגולים: בתרגולים הוצגו דוגמאות ותרגילים ברמה גבוהה, מה שהשלים יפה את ההרצאות, שבהם הוצגו דוגמאות פשוטות. סתיו רץ מאוד מהר על החומר אבל הוא מתרגל טוב מאוד בפקולטה.\n\nשעורי הבית: מעולם לא היו לי שיעורי בית ככ רלוונטיים ולעניין בקורס בפקולטה. היו גיליונות קצרים כל שבוע שהיו מאוד רלוונטיים להבנת החומר, ושלא הרגישו עמוסים מידי או מעיקים.\n\nהמבחן: המבחן היה מאוד הוגן, ארז נותן אפשרות בחירה במבחן, אם יש נושא שחלשים בו אז זה ממש טוב.\n\nהשורה התחתונה: הקורס הזה ידוע כקורס מאוד קשה. ארז לימד בסדר , הוא מרצה מאוד מתחשב שחשוב לו שיבינו אותו ושהסטודנטים לא יהיו עם ציונים נמוכים בקורסים שהוא מעביר. \nהביקורות הקודמות ממש הרתיעו, אבל בפועל היה בסדר גמור.", "timestamp": 1716377107250}, {"author": "המבקר", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nמאוד מעניינות, ארז העביר את החומר בצורה טובה.\nאני שמעתי שסמסטר קודם הוא היה קצת מבולגן אבל לא הרגשתי ככה בסמסטר הזה, הוא גם העלה רשימות מסודרות למודל\n\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: \nסתיו מתרגל מאוד טוב עם הרבה ניסיון ומרגישים את זה. נראה שהוא בוחר שאלות רלוונטיות מתוך מאגר שיש לו והוא יודע לענות על כל השאלות של הסטודנטים\n\nשעורי הבית: \nשיעורי הבית היו יחסית קלים, פה ושם היו שאלות קשות, אבל סה\"כ חשוב בשביל להבין את החומר בצורה טובה.\nבנוסף לכך ארז פרסם 4 שאלות בונוס, שפתרון כל אחת זיכתה בנקודת בונוס לציון הסופי. השאלות היו ממש קשות ולקחו הרבה זמן, וזה הגיוני בהתחשב בעובדה שזה בונוס\n\nהמבחן: \nהמבחן היה הוגן, בחירה של 4 שאלות מתוך 5.\nהייתה שאלה אחת שנוסחה בצורה שאפשר לפרש אותה בכמה דרכים, כנראה שפירשתי בדרך אחרת ממה שארז התכוון אבל הוא התחשב ועדיין נתן את מלוא הנקודות.\n\nהשורה התחתונה: \nקורס מאוד מעניין וכיף, יחסית קשה מחשבתית אבל שווה את זה. הסגל היה מצויין", "timestamp": 1717011630909}]}