{"posts": [{"author": "טריוויאלית", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שי מורן\nחוות דעת - הרצאות: מועברות בצורה מאד מובנת, מרצה אכפתי.\n\nשם המתרגל/ת: ליאור טננבאום\nחוות דעת - תרגולים: לא הכי מובן אבל כן אכפתי מאד, חשוב לו שיבינו\n\nשעורי הבית: עמוסים אבל תואמים את הרמה בקורס.\n\nהמבחן: בוחן האמצע היה קל, מבחן הגמר היה קשה משציפינו. שאלות של אינפי, שאלות עמוקות וקשות ברמת גיליון. מה שכן, המבחן כן היה ברוח ש.ב, תרגולים וההרצאות.\n\nהשורה התחתונה: סה\"כ נחמד לעבור את הקורס עם שי כי הוא שם דגש על מה שחשוב לו. לא לזלזל ברמת המבחן.", "timestamp": 1614207035191}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: חיים מרצה נחמד עם כוונות טובות. קצת מבולגן\n\n\nהשורה התחתונה: סה״כ הקורס לא מאוד קשה והחומר נחמד (למרות שלא שימושי בשום מקום)", "timestamp": 1645607869175}, {"author": "טריוויאלית", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: מעולה, אהבתי\n\nשם המתרגל/ת: שקד\nחוות דעת - תרגולים: טובה, מקצועית\n\nשעורי הבית: קשים אבל בקטע טוב: מלמדים, רלוונטיים למבחן, רלוונטיים להבנת החומר\n\nהמבחן: הוגן, בחלקו מש.ב ומההרצאות, בחלקו שאלות קלאסיות בחומר\n\nהשורה התחתונה: אהבתי את המרצה חיים מאד, הוא רגוריזי ומגדיר הכל היטב, יש לעקוב ולשים לב לדקויות שהוא מעביר. הוא מסביר מה הוא מצפה לראות ואיך לכתוב את הדברים. הוא נבון ויודע את החומר.", "timestamp": 1650547957334}, {"author": "אפסי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ארז נשרים \nחוות דעת - הרצאות: הרצאות: מבולגן, לא מובן, מגיע לרוב לא מוכן ובאופן כללי קיימת תחושה שהוא מאלתר תוך כדי ההרצאה. לא פעם הוא שינה את ההוכחה שלו לפי שאלות של הסטודנטים על חוסר עקביות, וברוב ההוכחות הגדולות הוא מפסיק באמצע ההוכחה בשביל להוכיח מספר טענות או למות שחשובות להוכחת המשפט הראשי. בסופו של יום המחברת נראית כמו שדה קרב של סימונים והגדרות ולא לגמרי ברור מי נגד מי.\n\nשם המתרגל/ת: יובל יפרח\nחוות דעת - תרגולים: התרגולים, והגליונות שלהם, לפחות בתחילת הסמסטר יכלו להוות קורס בפני עצמו, והיה צריך מתרגל בשביל התרגולים של יובל, אולי זה השתנה בהמשך אבל מהשבוע הרביעי הבנתי שהקושי לא מוצדק בשביל שעה תרגול ו2.5 נק\"ז לעומת שאר הקורסים היותר כבדים. לקח לי זמן רב מדי להשקיע בגליון (ללא הצלחה רבה) ומבחינת של השקעה לעומת תועלת זה לא היה שווה את זה, לפחות לדעתי. \n\nשעורי הבית: \nרמת קושי - חמישה נפצים\n\nהמבחן: \n\nהשורה התחתונה: \nהחומר עצמו מעניין, אבל לדעתי הסגל לא מתאים", "timestamp": 1655110976164}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: מבולגנות מאוד. ארז עובד לפי הספר של הפתוחה (קיים גם ברשת וגם פיזית בספריות) ככה שנורא נוח לעבוד עם הספר במקום להגיע להרצאות. לא תחליף אידיאלי אבל עדיף מאשר להגיע להרצאה ושהמרצה לא יצליח להוכיח דברים.\n\nשם המתרגל/ת: יובל יפרח\nחוות דעת - תרגולים: נורא מהר הפסקתי להגיע לתרגולים כיוון שלא כל כך התחברתי ליובל ולצורת העברה של התרגול. התרגול נורא קצר, לא מוקלט והרשימות בכתב יד של יובל (שלא כל כך מובן בעיניי). \n\nשעורי הבית: \nרמת קושי - כמו שזה נראה ביחס למבחני עבר, רמה גבוהה מידיי. מגיעים באופן אקראי, נגמר הסמסטר וקיבלנו תרגיל בית חדש (10 במספר מתוך 13 שבועות).\n\nהשורה התחתונה: \nחומר מעניין, סגל לא מוצלח בכלל לדעתי, הקורס נהיה מאוד מסורבל וללא סיבה. היתרון היחיד זה שארז עובד לפי הספר של הפתוחה אז אפשר להיעזר בו.", "timestamp": 1656699530506}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ארז נשרים\nחוות דעת - הרצאות: \nארז לא הגיע מוכן לשיעורים, לפעמים סטודנטים ששולטים בחומר עזרו לו להוכיח והנחו אותו מה לכתוב. השיעורי בית היו קשים מאוד ולא תמיד תואמים לאותו שבוע שלמדנו בהרצאה / תרגול.\nיש את הספר של הפתוחה שנוח לעקוב אבל לדעתי הספר של הפתוחה לא ברמה התיאורטית שארז השתמש בה - שימוש בכל האקסיומות למיניהם. לכן זה כלי עזר ולא תחליף\n\nשם המתרגל/ת: יובל יפרח\nחוות דעת - תרגולים: התרגולים היו על הפנים, לא תמיד תואמים לחומר שהיה בהרצאה, יובל רץ מהר מאוד.\nהוא כן מוכן להסביר שוב ולהתעכב למי שלא הבין\n\nשעורי הבית: קשים מאוד", "timestamp": 1657698964631}, {"author": "עידן", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ד\"ר ארז נשרים\nחוות דעת - הרצאות: \nדי טעון שיפור. מצד אחד אני חוויתי את ארז כמישהו שמנסה להתחשב ולהיות טוב בתור מרצה, אבל מצד שני הוא התקשה המון בהרצאות למרות שהיו לו רשימות מוכנות מראש, והסביר בעיניי מאוד לא ברור. היו הרבה פעמים שהוא עצר הוכחה באמצע כדי להגדיר הגדרות, להוכיח טענות ולמות שהיו קריטיות להוכחה הגדולה, ולא עשה אותן לפני למרות שככה זה הרבה יותר מקובל וברור.\nלפחות בשנה הקרובה (עד שישתפשף קצת יותר), אם יש לכם קורס שאתם לא חייבים לקחת וארז מרצה בו, ממליץ בחום לא לקחת.\nשם המתרגל/ת: יובל יפרח\nחוות דעת - תרגולים: \nההסברים שלו רוב הזמן היו יחסית סבבה, אבל די קיבלתי ממנו הרגשה שלא הכי אכפת לו מהקורס הזה - לא תמיד הגיע בזמן לתרגולים, ביטל תרגול אחד בהתראה של פחות מיום (למרות שהוא ידע הרבה לפני שהוא יהיה בחו\"ל), העביר תרגול לזום בהתראה יחסית קצרה (גם פחות מיום), נתן שיעורי בית בכתב יד מהאייפד וכו'.\nשעורי הבית: \nדי קשים ומוזרים, אבל עוזרים להבין את החומר. בדיעבד, לא היה חובה להתמקד בהם כדי להצליח.\nהמבחן: \nהרבה מאוד עבודת שינון של הוכחות שהיו במהלך הסמסטר, בין אם כאלה שארז עשה והצליח לעשות אותן בצורה מלאה בהרצאה או כאלה שניתנו לנו בתור שיעורי בית. גם היה הרבה להגדיר.\nבערך 60-70 נקודות מהמבחן אפשר לקבל אם משננים את ההגדרות העיקריות וההוכחות הגדולות בצורה מושלמת.\nהשורה התחתונה: \nלא אהבתי את הקורס כנראה בגלל הסגל, אולי עם סגל אחר הייתה יכולה להיות לי חוויה טובה יותר. אם יש לכם קורס שאתם לא חייבים לקחת איתם, לא כדאי.", "timestamp": 1665396479484}, {"author": "=nobody", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מקס\nחוות דעת - הרצאות: \nסה\"כ ההרצאות הועברו באופן טוב, היינו כיתה די קטנה אז היה אפשר לשאול שאלות ולהעמיק עם מקס על החומר.\nהבעיה הייתה שכל סמסטר הקורס מועבר אחרת לגמרי ולמקס אין רשימות של ההרצאות, אז צריך להיות חדים על איזה חומר הועבר ועל איזה חומר ניתן דגש בהרצאה.\n\nשם המתרגל/ת: סתיו \nחוות דעת - תרגולים: \nמתרגל מדהים, בין הטובים שפגשתי בפקולטה.\nהצליח להביא המון שאלות טובות בשעת תרגול שבועית, ורואים שהגליונות נכתבו עם מחשבה. הוא גם מעלה אחלה רשימות למודל.\nחוץ מזה, ניראה לי שבחיים לא ראיתי מתרגל שככה חד על החומר של הקורס שהוא מעביר.\nשעורי הבית: \nיש גליון שבועי של 3-4 שאלות.\nלענ\"ד הגליונות לא היו קלים, וכמעט תמיד הייתה שאלה שלקחה לי המון זמן. בסוף זה השתלם כי חצי מהבוחן אמצע היה ש\"ב, וגם במבחן (אפילו שלא הוגדר שיש שאלת ש\"ב) היו רעיונות שפגשנו בש\"ב והיו רלוונטיים.\nהמבחן: \nבחירה של 4 מתוך 5. אין שאלת הוכחה.\nדי משקף את הרמה של הקורס, לא היה משהו לא פתיר, אבל זה לא היה קל.\nהשורה התחתונה: \nסה\"כ קורס מאד מעניין, הופתעתי לטובה.", "timestamp": 1677778396197}, {"author": "רישא ממש", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מקס גורביץ'\nחוות דעת - הרצאות: הכיתה היית מאד קטנה ולכן ההרצאות עברו בצורה יחסית ברורה. מקס יחסית רץ על החומר אבל תמיד היה אפשר לעצור ושאול שאלות. חשוב לציין שהקורס הועבר בצורה שונה משאר הקורסים והתמקד בחלק שלדעתי יותר יפה מעניין.\n\nשם המתרגל/ת: סתיו ברמן\nחוות דעת - תרגולים: מתרגל מעולה. היה זמין לכל שאלה במייל ואיפשר להגיע לשעות קבלה של קורסים שונים. בנוסף הוא העלה רשימות ברורות מאד שתרמו ללמידה. \n\nשעורי הבית: לא קלים, אבל מאד מאד תרמו לי להבנה של החומר. גם בבוחן אמצע וגם במבחן הסופי (מועד א') היו שאלות עם רעיונות משיעורי הבית (בסגנון או זהות) ככה שמי שהשקיע במהלך הסימסטר קיבל שאלה מתנה.\n\nהמבחן: הוגן לחלוטין. \n\nהשורה התחתונה: קורס יפה, כן הייתי ממליץ לעשות אותו לקראת סוף התואר.", "timestamp": 1678819113910}, {"author": "אומגה בריבוע", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חיים אבן זהר\nחוות דעת - הרצאות: חיים מלמד די טוב, והוא גם יודע לייצר עניין בחומר. כנראה שעם חיים תצאו מהקורס כשאתם יודעים את החומר, אבל לדעתי לא שווה לקחת איתו קורסים (הסבר בהמשך).\n\nשם המתרגל/ת: עמיר קרניאל \nחוות דעת - תרגולים: מתרגל מעולה. הוא מציג בתרגול תרגילים טובים שעוזרים להבין את החומר וגם עוזרים לפתור את שיעורי הבית. בנוסף הוא מאוד עוזר בשעות קבלה ונותן כיוון לפתרון.\n\nשעורי הבית: כל שבוע בערך 4 שאלות, צריך להגיש כל שבועיים. חלק מהשאלות לא קשות מאוד ואפשר לפתור יחסית מהר, וחלק ארוכות וברמה מאוד גבוהה ולוקחות הרבה זמן. לדעתי בשביל קורס של 2.5 נק\"ז זה היה עמוס מדי, אפילו שהיה 20% מגן. הגיליונות עזרו להבין את החומר.\n\nהמבחן: מועד א' היה מאוד קשה לדעתי. למרות שהרגשתי מאוד מוכן ומאוד על החומר בסוף זה לא תורגם לציון גבוה. חיים ידוע לרעה במבחנים שלו וכדאי לקחת את זה בחשבון.\n\nהשורה התחתונה: קודם כל הקורס עצמו מעניין מאוד (קצת פחות בחלק של עוצמות אבל כן בכל השאר). אני לא ממליץ לקחת את הקורס הזה (או קורסים אחרים) עם חיים כי הוא מאוד מעמיס על הסטודנטים והמבחן לא צפוי ובהחלט יכול להתקיל אתכם.", "timestamp": 1718100736024}, {"author": "ברו", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חיים אבן זהר\nחוות דעת - הרצאות: אחד המרצים הטובים ביותר שהיו לי, הבנאדם נראה למלם אבל שאקל רציני\n\nשם המתרגל/ת: עמיר קרניאל\nחוות דעת - תרגולים: מתרגל מעולה, מי שהגיע לתרגולים שלו גם הבין טוב את החומר וגם הגיע מאוד מוכן לתרגילי הבית\n\nשעורי הבית: אולי היו הרבה, אבל הרגיש שאם באמת מבינים מה היה בהרצאה אפשר לפתור 85% בפחות מ4 שעות\n\nהמבחן: שמעתי רק דברים רעים על מבחנים של חיים, אבל לבסוף הרגיש שהמבחן היה הוגן מאוד, סעיף אחד שדורש הרבה יצירתיות ועוד כמה סעיפים מאוד אפשריים\n\nהשורה התחתונה: אחד הקורסים היותר מעניינים בתואר, חיים ועמיר שילוב קטלני מומלץ מאוד", "timestamp": 1720209034898}]}