{"posts": [{"author": "SR", "difficultyRank": 4, "generalRank": 4, "semester": "201702", "text": "שם המרצה: דוד צילג ז\"ל\nחוות דעת - הרצאות: ההרצאות המוקלטות של דוד צילג הן בין הטובות ביותר שיצא לי לצפות - מדובר במרצה אגדי שאני ממליץ עליו בחום.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: גלית מתרגלת תותחית, ומעבר להכל היא פשוט בן אדם מקסים. בסמסטר שאני לקחתי את הקורס, קבוצת התרגול איתה הייתה די קטנה ולכן היה יותר קל להתקדם בחומר ולהשאיר מקום לשאלות. בנוסף, היא הייתה מאפשרת לתאם איתה להגיע לתרגול קצת מוקדם יותר, ואז לשבת איתה אחד על אחד על שאלות בנוגע לתרגולים, לשיעורי הבית וכד'. ממליץ עליה בחום!\n\nשעורי הבית: יש המון (המון) שיעורי בית בקורס - גליונות פתוחים ומתנטים (נכון לאביב 2018). המתנטים טכניים וחופרים בטירוף ולפעמים מרגישים קצת מיותרים, אבל סה\"כ הרבה מהקורס זה שליטה בטכניקה. הגליונות הפתוחים הם יותר חשובים כי הם מייצגים שאלות ברמת מבחן, ולכן מאוד מומלץ להתמודד איתן לבד / להיעזר בשעות הקבלה.\n\nהמבחן: המבחן היה יחסית קשה, אבל סה\"כ הלך בסוף בסדר.\n\nהשורה התחתונה: קורס מעניין סה\"כ, אבל לפעמים קצת טכני ברמה מעיקה.", "timestamp": 1597745267778}, {"author": "Yan Tomsinsky", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: פתחי סלאח\nחוות דעת - הרצאות: מרצה משעמם וחסר כריזמה. ממליץ בחום על ההרצאות של צילג ביוטיוב .\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: מתרגלת טובה ואיכפתית. תמיד מנסה לעזור ולהקשיב.\n\nשעורי הבית: גיליון וWW פעם בשבוע. בערך השקעה של יום שבוע לשיעורי בית.\n\nהמבחן: 90 אחוז מחומר המבחן נלמד בשבועיים האחרונים של הקורס, ממליץ להגיע חדים לחודש האחרון לפני המבחן ולנסות להבין את החומר כמה שיותר מהר.\n\nהשורה התחתונה:", "timestamp": 1597752319910}, {"author": "מתן סולומון", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: גבר רצח ועושה מעל ומעבר בשביל הסטודנטים, אבל מרצה קצת מבולגן ולא קוהרנטי\n\nשם המתרגל/ת: מיכל קליינשטרן\nחוות דעת - תרגולים: דואגת מאוד לסטודנטית, מרצה מהר אבל ברור ומובן\n\nשעורי הבית: קשוחים אך נסבלים\n\nהמבחן: קשוח\n\nהשורה התחתונה: למי שאוהב", "timestamp": 1598882812180}, {"author": "amir alkalay", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: סך הכל סבבה \n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: עם מתרגלים כאלה ניגשים למבחן\n\nשעורי הבית: איכסה\n\nהמבחן: נו בסדר\n\nהשורה התחתונה:", "timestamp": 1609832159417}, {"author": "דניאל", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: לא משהו בכלל. רצה מהר מדי וקשה שלא לאבד אותה עוד בהתחלה\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: אחלה של מרצה. התרגולים המוקלטים מספיקים לגמרי\n\nשעורי הבית: סבירים\n\nהשורה התחתונה: קורס ממש לא קל", "timestamp": 1611055768795}, {"author": "tal", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: צילג - מוקלטות\nחוות דעת - הרצאות:  המוקלטות של צילג מעולות, הוא מסביר הכל בצורה כי מובנת שאפשר והוא מושלם.\n\nשם המתרגל/ת:  גלית מזרחי\nחוות דעת - תרגולים: יש לגלית תרגולים מוקלטים ממש טובים, והיא דואגת גם לעשות הרבה שעות קבלה ועונה באדיבות לכולם.\n\nשעורי הבית: לא קלים, אבל מאוד מלמדים.\n\nהמבחן: \n\nהשורה התחתונה: צילג!", "timestamp": 1611078520215}, {"author": "tomer abrashkin", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אור דולב\nחוות דעת - תרגולים: \nהוא אחלה של מתרגל, ממש מסביר לאט וברור והוא מאוד מסודר\nועונה על שאלות בכיף.\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612463035199}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי בן אדם מדהים ומשקיעה מאוד בסטודנטים. תמיד נשארת לענות על שאלות, מכינה סיכומים בשבילנו ומנסה שיהיה מעניין עם דוגמאות מסרטים וסדרות והערות העשרה. תלמדו איתה אם יש לכם את האפשרות!\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: התרגולים המוקלטים של גלית מעולים וממש עזרו לי להצליח באלגברה הסמסטר. בכיתה ההפוכה לפעמים עוברים על עוד תרגילים אבל בדרך כלל זה בקונספט של שעת קבלה. גלית מאוד נחמדה ונשארה הרבה פעמים הרבה מעבר לזמן של התרגול בשביל לעזור לי. \n\nשעורי הבית: לפעמים מאתגרים, אבל כל השאלות מרגישות פתירות אחרי שעוברים על התרגולים המוקלטים ויושבים עליהם מספיק זמן.\n\nהשורה התחתונה: הקורס האהוב עליי הסמסטר- ממש מעניין!", "timestamp": 1612554210347}, {"author": "שיר חסקל", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מעולה. הקדישה זמן לאינטואיציה לפני כל נושא כבר מתחילת הקורס. בנוסף, השקיעה בהרצאות העשרה בנושאים שעניינו אותנו. \n\nשם המתרגל/ת: אור דולב\nחוות דעת - תרגולים: אור מתרגל מצויין!! העביר את התרגולים בצורה ממש מסודרת וברורה, מסביר מעולה ונשאר במידת הצורך גם בסיום התרגול.\n\nשעורי הבית: גליונות מאתגרים, אבל הקורס גדול ולכן יש מענה נגיש, הרבה שעות קבלה והיה גם פורום במודל לשאלות בנושאי הקורס.\n\nהשורה התחתונה: עדיף מאינפי D:", "timestamp": 1612573497374}, {"author": "מטריצה הפיכה", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי בן אדם מדהים. אבל! היא לא מעבירה את החומר בצורה כל כך ברורה, ובגלל שהיא בן אדם כל כך נחמד ומביאה דוגמאות מהארי פוטר וכו' אני התאהבתי באופי שלה ולא קלטתי עד שלב מאוד מאוחר שהיא בעצם לא מרצה טובה בשבילי. כשקלטתי שאני מקשיבה לשיעורים שלה אבל לא מבינה דברים בסיסיים, עברתי לראות הרצאות מוקלטות של צילג והשינוי היה ניכר.\nההרצאות המוקלטות של צילג מעולות, והייתי ממליצה אפילו ללמוד איתן מתחילת הסמסטר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה, פשוט המתרגלת הכי ברורה בעולם (וגם מצחיקה). הרבה פעמים היא  בתכלס הייתה מי שלימדה אותי את החומר. מה שכן - יש הרבה אנשים אצלה בשיעור אז זה ממש לא תרגול אינטימי.\n\nשעורי הבית: \nיכולים להיות לא מובנים.\n\nהמבחן: \nקשה.\n\nהשורה התחתונה: \nאני פחות נהניתי ממה שנהניתי מאינפי, אבל אני מרגישה שאם הייתי עוברת לצילג בשלב יותר מוקדם, הייתה לי חוויה טובה יותר ממה שהיה לי עם עדי.", "timestamp": 1612686230518}, {"author": "יואב מאירי", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: לפעמים קצת מבולגן אבל נותן מקום לשאלות, נותן אינטואיציה טובה ומתייחס יפה לסטודנטים.\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: מהירה ממש, אם החומר בא לכם בקלות ואתם רגילים לקצב מהיר, היא תתאים לכם מאוד.\n\nשעורי הבית: לא הכי קשים, רלוונטיים ועוזרים להבנה של החומר\n\nהמבחן: יותר קשה משמעותית לדעתי מהשיעורי בית, יש לו סגנון אחר ממה שרואים התרגולים ובשיעורי בית.\n\nהשורה התחתונה: החומר שימושי, הקורס עמוס מאוד  בחומר אבל יחסית לאינפי הוא יראה כמו פינוק.", "timestamp": 1612898014590}, {"author": "המדרג", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עדי וולף.\nחוות דעת - הרצאות:  כמו שאחרים כבר כתבו, עדי אדם מדהים ורואים שסופר אכפת לה מהסטודנטים שלה - היא תמיד נשארת לענות על השאלות של כולם ומקפידה לעצור לשאלות מתי שניתן. כמו כן סיכומי ההרצאות שלה ברורים והיא גם העבירה הרצאות העשרה , שזה לגמרי לא מובן מאליו.\nעם זאת, באופן אישי היה לי קשה לעקוב אחריה. קצב ההרצאות הוא די גבוה, וחלק גדול מהזמן, בייחוד לאחר החלק השני של הקורס, לא הצלחתי להתחבר כ\"כ להסברים שלה. \nייתכן ולאנשים יותר מתמטיים ממני החוויה הייתה שונה, אבל אם אתם לא חזקים במיוחד במתמטיקה, ייתכן וזו לא המרצה המתאימה.\n\n\n\nשם המתרגל/ת: אפרת אבירם.\nחוות דעת - תרגולים: אפרת המתרגלת הכי טובה בטכניון. נקודה. אם יש באפשרותכם להירשם לתרגולים שלהם - תעשו את זה. לא עכשיו. אתמול. \n\nשעורי הבית: סבירים, תואמים את הנעשה בתרגולים ובהרצאות ומחדדים את ההבנה של החומר.\n\nהמבחן: לא קל אבל הוגן בסה\"כ. \n\nהשורה התחתונה: קורס לא פשוט אבל עם מספיק תרגול רוב הדברים ברורים בסופו של דבר. עם זאת, אם אין לכן זיקה למתמטיקה כנראה שלא תאהבו אותו.", "timestamp": 1612969561159}, {"author": "HOM V,V", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה. מתרגמת את החומר מסינית לעברית. מומלץ מאוד בחום, גם לגבי קורסים אחרים. מדברת בגובה העיניים. נכס לטכניון.\n\nשעורי הבית: לא מעט אבל משאירים מחובר לחומר. מומלץ לעשות לדעתי כמה שמתאפשר (גליון של 6-7 שאלות על בסיס שבועי)\n\nהשורה התחתונה: קורס לא פשוט, מומלץ לא לזלזל בכלל. המון הגדרות והמון משפטים. השבועיים האחרונים הכי מהותיים בקורס.", "timestamp": 1612981644149}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: ממש חמודה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מסבירה ממש טוב וחוזרת על כל החומר בתרגולים, אני הבנתי את החומר יותר בתרגולים ופחות בהרצאות.\n\nשעורי הבית: לא מאוד כמוסים, בערך כל שבוע-שבוע וחצי גיליון (לא מאוד קשה)\n\nהמבחן: לא קשה, בערך אותה הרמה כמו הש.ב אבל עדיין צריך ללמוד טוטב לקראת המבחן\n\nהשורה התחתונה: קורס די מעניין, לא עמוס, סבבה", "timestamp": 1613042465367}, {"author": "--", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דוד צילג ז\"ל\nחוות דעת - הרצאות: הלוואי והייתי צופה בצילג מתחילת הסמסטר. בסמסטר קורונה אני באמת לא רואה סיבה ללכת למרצה אחר. עדיף לצפות בצילג, לרשום בצד שאלות וללכת לשעת קבלה של ניר שיודע להסביר דברים בצורה ממש טובה (אבל קצת מבולגת מדי בשביל לראות אותו הרצאה שלמה)\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: התרגולים המוקלטים בנויים ככה שהם מכינים אתכם לגליונות הפתוחים ולוובוורק. גלית מנוסה בטירוף ויודעת לתת שאלות שמחדדות את החומר. לתרגולים שלה בלייב הפסקתי להגיע כי היה קצת מבולגן ועמוס. אבל בשעת קבלה היא עוזרת ומסבירה דברים ומקשרת בין הנושאים השונים.\n\nשעורי הבית: לא קלים. לתת להם את הזמן שלהם אבל מה שחשוב זה שבסוף הבנתם והתעמקתם בפתרון.\n\nהמבחן: היה מבחן סופר סופר הוגן ואפילו קל בהשוואה למבחני עבר של ניר.\n\nהשורה התחתונה: ממליץ לא לזלזל בקורס הזה. לעומת אינפי הוא נראה בהתחלה קליל אבל זה שקר. תהיו עם יד על הדופק מההתחלה ותראו שאתם שולטים בכל ההגדרות והטכניקות אחרת זה יבוא לכם בהפוכה אי שם באמצע הסמסטר. החומר מאוד מעניין וחשוב להמשך, אבל זה קורס קצת מוזר כי גם כשהוא נגמר לא כל כך מבינים על מה הוא ואיך הכל מתחבר, מרגיש כמו ערבוביה של נושאים שונים שיש ביניהם כל מני קשרים מעניינים.. מבנה הקורס באמת מוזר, אבל הסגל ובפרט גלית מושלמים.", "timestamp": 1613052446165}, {"author": "Yogev Namir", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: מעבירה את ההרצאות בצורה ממש כיפית וקלילה. עונה לכל השאלות (לטוב ולרע). *עובדת עם אייפד*\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: מקצועית מאוד, מספיקים המון בתרגולים שלה, קצב גבוה למי שאוהב(אבל תמיד תענה לשאלות) *עובדת עם טאבלט*\n\nשעורי הבית: הגליונות משקפים את החומר שיהיה במבחן(גליון חדש אחת לשבועיים), תרגילי webwork טובים לתרגול טכניקה של חישובים, פחות תיאורטי.\n\nהמבחן: הייתה שאלה של 30 נק על HOM למרות שלמדנו את זה 20 דקות בכל הסמסטר. הייתה שאלה שלמה מהגליונות. השאר היה הוגן.\n\nהשורה התחתונה: לבוא לכל ההרצאות, לראות תרגולים מוקלטים של גלית.", "timestamp": 1613400793717}, {"author": "Shay Hacohen", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: הרצאות מעניינות ומרצה נהדרת עם המון אהבה לתחום. :)\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: מתרגלת מדהימה. כל תרגול חשוב ומלמד וגלית מסבירה ממש טוב ומעבירה פרקטיקה ואינטואיציה בו-זמנית וברמה גבוהה.\n\nשעורי הבית: חשובים מאוד: מטמיעים את החומר. מלבד תרגיל ספציפי פה ושם, לא מאוד קשים (המבחנים בד\"כ ברמה גבוהה יותר), אבל לוקחים זמן לפעמים.\n\nהמבחן: בעיקר עמוס מאוד, אבל שאלות הוגנות.\n\nהשורה התחתונה: קורס מאוד מעניין :)", "timestamp": 1613491727204}, {"author": "matan solomon", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: קצת משעממות וההוכחות מאוד טכניות וארוכות אז קל לאבד ריכוז. ניר מרצה מעולהומצחיק מאוד אבל צריך להתרגל אליו.\n\nשם המתרגל/ת: יוליה פייגין קצוב\nחוות דעת - תרגולים: קצב מהיר, מספיקה הרבה. טובה ממש, ממליץ.\n\nשעורי הבית: קלים יחסית לאינפי אבל לוקחים זמן וחשובים.\n\nהמבחן: מבחן קשה, אבל אפשרי.\n\nהשורה התחתונה:", "timestamp": 1614081806324}, {"author": "A", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה סבבה סה\"כ, משתמשת בהמון דוגמאות (בעיקר מהארי פוטר). אבל, היא עוצרת יותר מידי לשאלות וזה יוצר קטיעה בהרצאה כל פעם ואז לא מספיקים את החומר.\nעשינו 2 או 3 הרצאות השלמה במהלך הסמסטר אז כן הספקנו הכל בסופו של דבר ואפילו קצת העשרה וחזרה למבחן.\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: יוליה רצה בחומר בטירוף, אבל באופן מוזר הכל די ברור ובכל מקרה שמשהו לא ברור, היא בד\"כ תישאר אחרי התרגול כמה דקות כדי לענות על שאלות, או בשעת קבלה.\n\nשעורי הבית: קצת מפוזרים, הגיליונות מתפרסמים בהתאם להספק של המרצים אז קרה מצב שבו שבועיים לא מקבלים גיליון ואז פתאום מקבלים 2 בהפרש של יומיים. בכל מקרה, כדי לפתור לפחות חלק מהם כדי לקבל את הטכניקה שצריך בקורס\n\nהמבחן: קשה\n\nהשורה התחתונה: פחות נורא מאינפי", "timestamp": 1614160269319}, {"author": "עדן ותד", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \n\nשעורי הבית: חשובים וההגשה חובה\n\nהמבחן:  לא קל\n\nהשורה התחתונה:", "timestamp": 1614349741854}, {"author": "איתי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי מעולה ומומלצת מאוד!! מסבירה מעולה, בצורה מסודרת, עם המון דוגמאות.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: התרגולים המוקלטים של גלית הם הדבר הכי טוב שקרה לקורס הזה. ההסברים של גלית פשוט מצוינים והתרגילים ברמה גבוהה ואיכותית.\n\nשעורי הבית: הרבה גיליונות די ארוכים אבל מכינים למבחן בצורה לא רעה בכלל.\n\nהמבחן: לשם שינוי היה הוגן הפעם.\n\nהשורה התחתונה: אם משקיעים כל הסמסטר ודואגים שהכול יושב טוב, לא אמורה להיות בעיה להצליח.", "timestamp": 1614703252401}, {"author": "Ori Meiraz", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה מעולה, רואים שאכפת לו מהסטודנטים. הוא מסביר ועוצר אחרי הדברים שהוא כותב ונותן זמן לשאלות. קצת קשה \"להתרגל\" אליו אבל ממליץ להכנס להרצאות שלו ולנסות.\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מתרגלת טובה, נתנה עצות טובות לקראת המבחן\n\nשעורי הבית: קשה לעשות את השיעורי בית כל שבוע ולעמוד בקצב \n\nהמבחן: \nקצת קשה אבל הוגן, תמיד יש סוגי שאלות שחוזרים על עצמם ומרכיבים את רוב המבחן.\nהשורה התחתונה:", "timestamp": 1614710399666}, {"author": "Maya Lavi", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מקסימה, טיפה מפוזרת אבל בהחלט הכי טובה בסגל הסמסטר. נותנת הרבה דוגמאות שעוזרות להבין את החומר, וגם רואים שהיא נהנית ללמד ואוהבת את המקצוע, וזה חד משמעית תורם ללמידה. \nטיפ- החומר באלגברה נבנה ברמת הקושי, אז אל תהיו שאננים! \n\nשם המתרגל/ת: אפירת אבירם\nחוות דעת - תרגולים: ואו! מדהימה! מתרגמת את הסינית שלמדת בהרצאה לעברית. מסבירה כמו שצריך, מובנת, מציגה סוגי תרגילים שונים ודרכי חשיבה וגישות שונות לאותו התרגיל. חד משמעית עזר לי במבחן הסופי. \nהיא לא רצה עם החומר, והיא נותנת לאנשים לשאול חופשי ולהציע פתרונות- לי זה עבד מעולה, תחושה של כיתה (למרות שהיה סמסטר זום), אז קחו בחשבון אם זה מתאים לכם.\n\nשעורי הבית: גיליון אחת לשבוע (בערך), לקראת הסוף הסגל לא עמד בזמנים והעלה כמה גיליונות ברצף, אבל התחשבו מבחינת אחוזי מגן וכאלה. \n\nהמבחן: המבחן היה כמו כל מבחן של ניר בן דוד, יותר חשיבה וטריקים מאשר אלגברה שחורה. מבחן פייר לכל הדעות.\n\nהשורה התחתונה: סגל מאוד מתחשב בסטודנטים. קורס עם קושי עולה ונבנה, אבל אם מתייחסים אליו ברצינות מההתחלה, אין סיבה לא להוציא ציון גבוה.", "timestamp": 1614940812252}, {"author": "Maplestory", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: עצבני, טכנופוב, לא מביא דוגמאות(באלגברה הדבר הכי חשוב זה דוגמאות לדעתי). עדיף לראות צילג כל הסמסטר למרות שלא רואים כלום.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים:  אלופה\n\nשעורי הבית: לא נחמדים אבל לא נוראיים. יש רפרנסים אבל לפעמים הם משנים כמה שאלות אז להיות זהירים\n\nהמבחן: לפחות שאלה אחת לא פתירה, אלא אם ממש יודעים את החומר. מועד ב' זה מנהג במקצוע הזה אז לא להבהל.\n\nהשורה התחתונה: להיות על החומר, לעשות שיעורים בזמן, לא להתעקב יותר מדי על תרגילים כי בסוף כל החומר הרלוונטי למבחן מגיע בשבועיים האחרונים ונשען על מלא דברים שלא תזכרו כבר מתחילת הסמסטר.", "timestamp": 1614948148233}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מעולה. עונה לשאלות של כולם. מתעמק ונותן מעצמו בשביל הסטונדטים שלו.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: הסרטונים שלה מעולים ובתרגולים הלא מוקלטים שלה דואגת לתת ערך מוסף. שעות הקבלה שלה מאוד עזרו לי.\n\nשעורי הבית: קשים בהתחלה, אח\"כ מבינים שזו הנורמה ובסוף מתרגלים לעשות את אותם הדברים גם במבחן.\n\nהמבחן: אם שואפים לציונים גבוהים - הכרחי להבין את כל הקשרים ברמה מאוד עמוקה\n\nהשורה התחתונה: קורס טכני, אבל ממש לא לזלזל בו, כי אלה מיומנויות שנבנות לאורך זמן.", "timestamp": 1615209146519}, {"author": "סטודנט שעבר את זה", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: אין לכם מה לחפש אצל מרצים אחרים. ואני חותם על זה. יוסי כהן מרצה תותח, ממליץ עליו הכי הרבה מבין כל המרצים שלמדתי איתם בסמסטר הזה. הוא כל כך משקיע ומסביר לכל אחד שלא מבין, רואים שזה מאוד חשוב לו. הוא נותן דוגמאות, מסביר, וצוחק ככה שלמרות שהחומר קשה, ולפעמים קשה מאוד, הוא תמיד מרגיע ונותן תחושה שהכל בסדר. מי שלא הולך אליו - מפסיד.\n\nשם המתרגל/ת: הילה מעיין וגלית מזרחי\nחוות דעת - תרגולים: בה תחלה הייתי אצל הילה, והיא מתרגלת אלופה. מסבירה דברים שוב, עוברת על המון תרגילים לא טריוויאלים, ככה שאתה תראה אותם או בתרגילי בית או במבחן אפילו. ממליץ מאוד עליה. לקראת סוף הסמסטר, רציתי להעמיק אז הלכתי גם למוקלטים של גלית, והיא מסבירה בליגה אחרת. כמעט כל השאלות שלה יופיעו במבחן או הופיעו במבחני עבר, והיא מסבירה מאוד ברור- לא נכנס לתיאוריות אלא באמת נותנת כלים איך לפתור תרגיל לבד. לא מורחת את הזמן בכלל. אז אני אישית ממליץ לשלב בין שתיהן.\n\nשעורי הבית: גיליונות כמו בשאר המקצועות. לקראת סוף הסמסטר העמיסו עלינו מאוד, מפאת חוסר הזמן, אבל חשוב מאוד לפתור אותם כי הם תורמים להבנת החומר. אין פתרונות רשמיים שלהם, הם לא מפרסמים והרפרנסים זה פתרונות של תלמידים מסמסטרים קודמים. בחלקם יש טעויות אז ממליץ להשוות כמה רפרנסים או לנסו לבדוק האם זה באמת נכון לפני שרצים להעתיק. שוב, הכי טוב לפתור לבד!\n\nהמבחן: המבחן היה הוגן ברובו, חוץ משאלה אחת שבחיים לא שאלו על הנושא אז במבחנים, ובסמסטר דיברו איתנו על הנושא הזה 15 דקות ואני מגזים. אם ניר מרצה אחראי, אז תתכוננו מאוד יסודי למבחן, אבל תמיד תנסו לחשוב על כיוונים יצירתיים ושאלות הזויות. כי בסוף הוא שואל בול עליהן ולא רק על החומר הטריוויאלי.\n\nהשורה התחתונה: קורס עמוס ולעיתים קשה להבנה, צריך לתרגל הרבה בשביל להצליח בו.", "timestamp": 1615448650965}, {"author": "ארבל", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מסבירה טוב, לפעמים זורמת יותר מידי עם שאלות מהכיתה ונוצר עיקוב בחומר. מחברת את החומר היטב.\nכתב ברור.\n\nשם המתרגל/ת: אפרת + מוקלטות של גלית\nחוות דעת - תרגולים: לכו לאפרת! ממש טובה, מסבירה, מתקדמת בקצב טוב ויודעת לתת זמן לשאלות ולחתוך כשצריך\nההקלטות של גלית ממש טובות ועוזרות ממליץ בחום אם יש נושא שיותר מתקשים בו לעצור לרגע ולראות תרגול או שניים\n\nשעורי הבית: מומלץ מאוד לעשות עוזרים להבין את החומר.\n\nהמבחן: דורש הבנה של החומר.", "timestamp": 1615798969682}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: סביר. ניר הוא אחלה בן-אדם, אבל קשה לעקוב אחריו בהרצאות. באיזושהו שלב עברתי ליוטיוב פשוט.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מסבירה בצורה טובה מאד, אך לרוב מביאה דוגמאות יותר בסיסיות ופשוטות, שזה חשוב להבנה, אבל בסוף צריך להעמיק יותר איכשהו\n\nשעורי הבית: פעם בשבוע. לוקחים זמן אבל יש רפרנסים, זה אותו דבר כל שנה\n\nהמבחן: קשה, ובעיקר מתמקד על הדברים שנלמדו ממש בסוף הקורס. צריך לתרגל הרבה לפני\n\nהשורה התחתונה: יש נטיעה לזלזל בקורס הזה כי בהתחלה הוא מאד פשוט ולא באמת קשור, אבל בסוף דורש השקעה לא פחות מאיפני/חדו\"א. הכי טוב לדעתי זה לראות הקלטות ולדלג קדימה שיהיה זמן באמת להבין את המושגים החשובם שהם בד\"כ דוחסים לשבוע האחרון.", "timestamp": 1616148671455}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עדי וולף המלכה\nחוות דעת - הרצאות: עדי מתרגלת מקסימה. יודעת את החומר, מלמדת בצורה כיפית, אכפת לה מהתלמידים, עונה על שאלות. מומלצת בחום!\n\nשם המתרגל/ת: אור דולב\nחוות דעת - תרגולים: מתרגל תותח! אין מילים באמת, עוזר, עונה, יודע את החומר. אלוף.\n\nשעורי הבית: מאתגרים. מומלץ להיעזר בחברים וכד'\n\nהמבחן: קשה. ממש ככה , במבחן שאלות על נושאים שנלמדים בשבועיים האחרונים של הקורס, ללמוד את החומר תוך שבועיים + עומס של קורסים אחרים - מזעזע. לי היה מאוד קשה.\n\nהשורה התחתונה: בתקופת קורונה קשה מאוד להישאר מרוכז בזום. יש מי שהיה לו קל ונהנה מהזום ויש מי שהיה לו קשה ורק הסתבך עם כל הלמידה מרחוק. סה\"כ קורס חובה וצריך להצליח בו.", "timestamp": 1616163441746}, {"author": "טל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  עדי וולף\nחוות דעת - הרצאות: מרצה מדהימה! אחת הטובות שיש. מסבירה ברור ומובן, מסודרת, נחמדה וחשוב לה שנבין ונצליח. לקראת סוף הקורס ראו עליה שהיא בלחץ לסיים את החומר ולכן רצה עליו בקצב מהר מדי, אבל עדיין מומלצת בחום.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מושלמת! המתרגלת הכי טובה. אם יש אפשרות לקחת אותה, אל תהססו. היא ועדי עשו לי את הקורס.\n\nשעורי הבית: ארוכים אבל לא בהכרח קשים, תלוי כמה אתם על החומר. לרוב אחרי התרגול של אפרת היה ממש קל לפתור אותם, רק הבעייתיות היא שלפעמים התרגולים היו מאוחרים מדי.\n\nהמבחן: ניר בן דוד אוהב לדפוק שאלות לא סבבה, שמצריכות המון ניחושים. אופן הבדיקה הוא דקדקני מאוד ביחס לעובדה שבקושי קיבלנו פידבק על דרך כתיבת ההוכחות שלנו במהלך הסמסטר\n\nהשורה התחתונה: עדי ואפרת פשוט הפכו את הקורס הזה להיות הרבה יותר כיפי מהפוטנציאל שלו", "timestamp": 1616230846517}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \nמרצה מצוינת. מרצה באופן ממש ברור, אינסוף סבלנות, נחמדה ומצחיקה ככה כשגם שהחומר משעמם, אז דברים עוברים באופן מעניין.\nהחומר בהרצאות מאוד תיאורטי.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nאפרת מתרגלת מעולה! בגלל הקורונה התרגולים היו בזום ככה שהיו 150 איש ככה שהתרגולים התקדמו יחסית לאט.\n\nשעורי הבית: \nמחולק ל2: \nגיליון על כל נושא בקורס, בערך פעם בשבוע. שאלות מתקדמות יותר/הוכחות על החומר לוקח לא מעט זמן. בודקים שאלה אחת/שתיים מתוך כל גיליון.\nוובוורק - תרגילים טכניים יחסית שעוזרים להטמיע את הנושא\nהמבחן: \nמבחן קשה, עם זאת הדפוס של המבחן חוזר ככה שעם מספיק תרגול אפשר די להצליח.", "timestamp": 1616340238555}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות:  אכפת לה מהסטודנטים שלה, אבל לעיתים לא מובנת בהסברים שלה, ולא עוברת על מספיק דוגמאות. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, עונה על שאלות, מעבירה את החומר בצורה ברורה ולא מהירה מדי.\n\nשעורי הבית: \nדורשים עבודה, אבל לגמרי פתירים.\nהמבחן: \nהמבחן לא קל, אבל עם משקיעים ומתרגלים טוב אפשר לקבל ציון טוב בו. \nהשורה התחתונה: \nקורס קשה, אבל אפשר לקבל בו ציון גבוה.", "timestamp": 1616664706532}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: או דולב\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי מעביר את החומר מצוין\n\nשעורי הבית: קצת עמוסים אבל יחסית בסדר\n\nהמבחן: צריך לתרגל המון!\n\nהשורה התחתונה: לעשות כמה שיותר תרגילים ולשים דגש על החומר בשבועות האחרונים.", "timestamp": 1617605029729}, {"author": "m-wa", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ניר \n\nחוות דעת - הרצאות: לדעי הוא מרצה ממש מעולה ומסביר טוב מאוד \n\nשם המתרגל/ת: אפרת \n\nחוות דעת - תרגולים: מצויינת \n\nשעורי הבית: ארוכים וקצת קשים \n\nהמבחן: דורש השקעה והבנה עמוקה לחומר אבל ניתן לקבל ציון 90+ \n\nהשורה התחתונה: בהצלחה", "timestamp": 1617863293865}, {"author": "catto", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ד\"ר פתחי סלאח\nחוות דעת - הרצאות: לצערי לא ממש התחברתי לסגנון ההוראה של פתחי, החומר הועבר בצורה קצת משעממת וחדגונית, בתבנית של \"משפט, הוכחה, משפט, הוכחה\" בלי ממש להסביר את האינטואיציה מאחורי הדברים, או להסביר את הצורך בהם.\n\nכעבור כמה שיעורים עברתי לדוד צילג ז\"ל, ואני לא חושב שבאיזשהו שלב לא הבנתי את ההסברים שלו, שזה נדיר בקורס כמו אלגברה. מרצה אגדי ששם דגש גדול על הבנה של מאחורי הקלעים ושל הצורך במשפטים האלה. מומלץ בחום\n\nשם המתרגל/ת: עליזה מלק\nחוות דעת - תרגולים: ממה שהבנתי עליזה לרוב לא מעבירה תרגולים, אבל בגלל הסמסטר קורונה כנראה היא כן הייתה מתרגלת. רמה גבוהה מאוד, ניכרת האהבה שלה לחומר. פלוס הרבה תרגילים שהיא העבירה היו מוטיב חוזר במבחני עבר :)\n\nשעורי הבית: ניתנים אחת לשבוע, ככל שהסמסטר עובר הם נהיים יותר קשים, אבל אפשר לסיים הכל ביום\n\nהמבחן: המבחנים של פתחי לרוב יותר קשים משל ניר (גם ניכר בממוצע), אבל סה\"כ סביר. צריך להיות בקיא בחומר ברמה עמוקה, ולא רק לדעת דברים טכניים כמו איך מוצאים ע\"ע ומטריצה מייצגת\n\nהשורה התחתונה: קורס מעניין מאוד וכנראה האהוב עליי מסמסטר א', ממליץ בחום על הוידואים של צילג", "timestamp": 1625743417456}, {"author": "לילוש", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוקטור סאלח פתחי\nחוות דעת - הרצאות: למעשה לא נכנסתי אפילו להרצאה אחת, אלא למדתי אך ורק מההרצאות ביוטיוב של דוד צילג זכרונו לברכה. ההרצאות שלו היו מעניינות והוא העביר בהן הרבה אינטואיציה בחביבות כזאת שכיף ללמוד!\n\nשם המתרגל/ת: אור דולב.\nחוות דעת - תרגולים: גם את התרגולים למדתי מהקלטות, של מישהי בשם גלית, מכיוון שלא התאימו לי שעות התרגול. התרגולים של גלית היו מובנים ודרשו הבנה אמיתית ולא רק טכניקה - אני נהניתי.\n\nשעורי הבית: קלים, בעיקר בהתחלה. ממליץ בחשבונות של דירוג מטריצות לוודא מדי פעם שאין טעויות, כי מבאס לקלוט שטעית רק בסוף, או לעבוד עם מספרים וביטויים מגעילים בגלל שטעית איפשהו. \n\nהמבחן: היה נחמד בסך הכל, הוגן. \n\nהשורה התחתונה: הקורס הזה לא מאוד מעניין, וקצת קשה לראות את המוטיבציה בהתחלה... נעזרתי בספר לימוד בשם Linear Algebra Done Right by Gallilian, שבו יש את כל החומר, אפילו עד לאלגברה ב, והוא מועבר בצורה יותר תאורתית ופחות טכנית. בקורס קודם כל מלמדים על מטריצות, והדבר נראה מוזר וארביטררי, אבל הספר מתחיל דווקא ממרחבים ווקטורים וטרנפורמציות לינאריות, כך שאני ממליץ לנסות ולראות אם זה עוזר בהבנה או בשביל הנאה. \n\nהרגיש לי שבקושי למדנו עד הסוף של הקורס, והיו הרבה דברים שנראו לא קשורים, אבל הכל מתחבר בסוף בהרמוניה כשלומדים על לכסון מטריצות, בצורה די מספקת.", "timestamp": 1626207219633}, {"author": "סבא בז'יק", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פתחי סאלח + קצת דוד צילג\nחוות דעת - הרצאות: הייתי ברוב ההרצאות שלו הסמסטר ולדעתי סגנון ההוראה שלו נורא מונוטוני וגם נורא מהיר, לכן אלא אם כן אתם ממש על החומר לא תמיד הכי פשוט לעקוב אחריו. לקראת הסוף עברתי להרצאות המוקלטות של צילג, והתחרטתי שלא עשיתי זאת לפני כן...\nאחלה הקלטות ומרצה מעולה\n\nשם המתרגל/ת: עליזה מלק + קצת גלית מזרחי\nחוות דעת - תרגולים: בתרגולים של עליזה יש אחלה אווירה, והיא תענה לכל סטודנט שצריך ממנה משהו בין אם זה אישי או לגבי החומר, אבל נורא הפריע לי הבלאגן בתרגולים. לפעמים היא איבדה תרגילים שרצתה לעשות או שבכללי הלוח היה מבולגן תוך כדי פתרון התרגילים והיה מסובך להבין לפעמים.\nלקראת הסוף עברתי לתרגולים של גלית, ושוב פעם, תרגולים מעולים, מסבירה הכל מעולה, וגם שם התחרטתי שלא עברתי מוקדם יותר\n\nשעורי הבית: יש גיליונות להגשה (8 מתוך 13) וWW. הגיליונות לא פשוטים אבל גם לא קשים מדי. יש הרבה מהם לכן במצטבר לוקחים הרבה זמן אבל רוב הגיליונות לוקחים 3 שעות +-.\nהWW יחסית פשוטים ולרוב לוקחים באזור השעה.\n\nהמבחן: מבחן מאתגר אך פתיר. חשוב נורא לעשות כמה שיותר מבחנים לפני כדי ללמוד טריקים שחוזרים על עצמם, ולדעת לקשר בין כל החלקים השונים בחומר שבסופו של דבר כל אחד מהם קשור לשני. אחרי מספיק ניסיון, המבחן לא יותר מדי מסובך.\n\nהשורה התחתונה: אני נהניתי מהחומר של הקורס. הדבר הכי חשוב זה לדעת לקשר בין החלקים השונים בחומר, ואחרי שעושים את זה, ההצלחה שלכם מובטחת :)", "timestamp": 1627578931645}, {"author": "taymor sabik", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: \nמשמעמם מאוד\nשם המתרגל/ת: עליזה מלק\nחוות דעת - תרגולים: \nמאוד ממליץ היה קיף ללמוד איתה \nשעורי הבית: \nלא קשה ולוקחים שעה בשבוע\nהמבחן: \nלא קשה אבל צריך תרגול\nהשורה התחתונה: \nקורס מאוד מעניין ולא עמוס סבבה לגמרי", "timestamp": 1628976293121}, {"author": "Gil Shahar", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: מאוד משעמם, עברתי לצילג ביוטיוב אחרי חודש, ההרצאות שלו ישנות אבל החומר עדיין רלוונטי אם כי לא באותו סדר.\n\nשם המתרגל/ת: עליזה מלק בהתחלה, הילה מעיין בסוף\nחוות דעת - תרגולים: עליזה מאוד מפוזרת, יש לה את השיטות שלה להסביר וממה שיצא לי לראות היא מתבלבלת לפעמים בדברים קריטיים וגורמת לבלבולים אדירים בחומר. עזבתי אותה והתחלתי לראות את התרגולים של הילה מעיין, מאוד מומלץ! להילה יש שיטות להסביר ולזכור בצורה מסודרת דברים חשובים לפתרון תרגילים.\nהקבוצה היתה קטנה והיה יחס אישי לכל אחד, הילה כותבת בטאבלט ולכן יוצא מסודר יותר\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1634541314237}, {"author": "Benjamin Mayan", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פתחי \nחוות דעת - הרצאות: ההרצאות היו די יבשות ופתחי לא טרח לתת שום אינטואיציה או מוטיבציה למושגים ולמשפטים, אבל ההרצאות היו ברורות מסודרות ועם הרבה דוגמאות.\n\nשם המתרגל/ת: עליזה\nחוות דעת - תרגולים: עליזה מתרגלת מאוד ותיקה אז יש לה הרבה טריקים וטיפים לאיך לגשת לכל מיני תרגילים, התרגולים היו באווירה טובה והיא השתדלה לענות בפירוט על שאלות מהסטודנטים. הקצב של עליזה קצת מהיר.\n\nשעורי הבית: גליונות בית עם שאלות פתוחות בערך כל שבוע + גליונות בית מקוונים פעם באיזה שבוע וחצי.\nחלק מהגליונות היו מאתגרים ודרשו הרבה מחשבה והשקעה, וכל גליון של שאלות פתוחות לקח לי לפחות 4-5 שעות של עבודה. הגליונות המקוונים ברובם קלילים ובעיקר מתרגלים מיומנויות טכניות, אפשר לפתור אותם בשעה שעתיים בקלות.\nשיעורי הבית מאוד עוזרים להפנים את החומר וממש חשוב לעשות אותם כדי להיות מוכנים למבחן.\n\nהמבחן: המבחן היה מאתגר וארוך, אבל אם מתכוננים אליו היטב (פותרים עשרות מבחני עבר) אפשרי לגמרי להוציא ציון טוב\n\nהשורה התחתונה: קורס די מעניין (היה יכול להיות יותר מעניין עם מרצה שנותן גם את האינטואיציה למושגים) אבל מאוד אינטנסיבי ודורש לא מעט השקעה.", "timestamp": 1634980138864}, {"author": "שי", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: ממש אחלה, דואג לעשות מספיק דוגמאות\n\nשם המתרגל/ת: אור דולב \nחוות דעת - תרגולים:  תמיד בא מוכן ואם טעה מתקן \n\nשעורי הבית: סבירים למדיי\n\nהמבחן: מבחן קשה יחסית לשאר, התמנייקו אם שואלים אותי\n\nהשורה התחתונה: קורס שקל לעבור, בשביל 100 צריך המון מאמץ", "timestamp": 1635598931705}, {"author": "שון", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פתחי סלאח \nחוות דעת - הרצאות: היה די מונוטוני, לא כלכך התחברתי להרצאות שלו.\n\nשם המתרגל/ת: עליזה מלק\nחוות דעת - תרגולים: עליזה מלכת העולם, היא קצת רצה על הדברים אבל היא מסבירה טוב ותמיד נשארה לעזור אחרי השעות, ממש חדה ועשתה הכל באווירה טובה, ממליץ בחום.\n\nשעורי הבית: וובוורקים סבבה, גליונות גם לא רעים מדי.\n\nהמבחן: המבחן היה ברמה סבירה\n\nהשורה התחתונה: קורס נחמד וחשוב מאוד להמשך", "timestamp": 1636382698480}, {"author": "בן", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מרצה מעולה, מסבירה באופן אינטואיטיבי בעזרת הרבה דוגמאות גורמת להבנה אמיתית של החומר. לומדת את השמות של הסטודנטים ודואגת שכל אחד ייצא בתחושה שהוא הבין. לא מתאימה לכולם, לפעמים טיפה מתעכבת.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מעולה! מסבירה באופן ייסודי, מסודר והומוריסטי\n\nשעורי הבית: עמוסים אבל לא צריך להגיש את כולם \n\nהשורה התחתונה: מיכל והילה גרמו לאינטואיציה מאוד חזקה וציון גבוה.", "timestamp": 1641996933321}, {"author": "מיה", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: מיכל מדהימה, מסבירה את החומר לעומק, עונה על כל השאלות כמו שצריך. היא אמנם טיפה איטית לעומת המרצים האחרים ולקראת סוף הסמסטר זה מתחיל להיות מורגש, אבל לא ברמה משמעותית.\n\nשם המתרגל/ת: אירנה גורליק\nחוות דעת - תרגולים: מסבירה טוב ולעומק, סגרה לי את כל הפינות הבעייתיות בחומר.\n\nשעורי הבית: לא נוראיים, אפשר לסיים ביום כל גיליון.\n\nהמבחן: קשוח אבל אפשרי.\n\nהשורה התחתונה: סך הכל לא קורס זוועה, תוודאו שאתם על החומר לכל אורך הדרך כי בסוף הקורס הכל מתחבר ביחד ואם יש משהו שאתם לא סגורים עליו אז באסה", "timestamp": 1644424599639}, {"author": "Itamar", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: מרצה מצוינת, מעבירה את החומר בצורה ומעניינת ויחסית ברורה. מורגש שהיא נהנית ללמד.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת טובה, קצת מהירה אבל מאוד ברורה ומעניינת.\n\nשעורי הבית: גליון פתוח חובה כל שבוע, קצת ארוך אבל יש רפרנסים כמעט להכל. בנוסף, גליון סגור כל שבוע שגם עלול לקחת הרבה זמן לקראת אמצע הסמסטר.\n\nהמבחן: לא קל, יש הרבה נושאים שצריך להבין והרבה משפטים לזכור, אבל אפשר להצויא בו ציון טוב אם לומדים מספיק.\n\nהשורה התחתונה: הקורס מרגיש יחסית קל בתחילת אבל מתחיל להיות קשה לקראת הסוף. צריך להבין את כל החומר לאורך הסמסטר כי בסוף הכל מתחבר וקשה להשלים פערים.", "timestamp": 1644484709461}, {"author": "ג", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי נחמדה מאוד אבל היא לא מסבירה את החומר המורכב יותר כמו שצריך. עברתי להקלטות ביוטיוב של צילג באמצע הסמסטר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת מומלצת בחום! וגם: יש את ההקלטות של גלית בפנופטו. עוזרות ממש ויש בהם טריקים חשובים.\n\nשעורי הבית: יש תרגיל בית להגשה כל שבוע, נבדקת רק שאלה אחת. עוזרים מאוד להפנמה של החומר.\n\nהמבחן: קשה אבל הוגן\n\nהשורה התחתונה: עדיף כישלון מפואר מחלומות במגירה", "timestamp": 1644514734152}, {"author": "BaronCabbage", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: יש לו תשוקה לחומר שהוא מעביר ויש הרבה צחוקים במשך ההרצאה אבל לפעמים הוא מאיט קצב בשעה הראשונה ואז רץ ממש בשעה השנייה.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מעולה, יסודית, נותנת כל טריק שהיא מכירה ומשתדלת לענות על כל השאלות.\n\nשעורי הבית: גיליון בשבוע להגשה אבל בודקים רק תרגיל אחד חשוב לעשות אותם בשביל הבנה.\n\nהמבחן: זה ידוע שניר שוחט במבחנים. לא היה קל בכלל.\n\nהשורה התחתונה: קורס חובה אין מה לעשות אם לומדים ללאורך הסמסטר ואז נותנים כמה ימים פוש לפני המבחן זה ממש אפשרי.", "timestamp": 1644598939801}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: יש אווירה מעולה בהרצאות, מלא צחוקים וניר מרצה מעולה עם המון תשוקה לחומר, הבנה עמוקה ומי שמתחבר אליו ממש יהנה. זה לא לכולם, יש כאלה שפחות יתחברו לסגנון שלו אבל תנסו לפחות.\n\nשם המתרגל/ת: אפרת אבירם.\nחוות דעת - תרגולים: פשוט מלכה, אין מה להגיד. הלוואי וכולם היו כמוה. עונה על שאלות בצורה ברורה, מחדדת טעויות נפוצות ועושה הכל כדי שכולם יבינו את החומר.\n\nשעורי הבית: יש WW ויש גיליונות פתוחים. הWW מתחילים להיות קצת עמוסים בחצי השני של הסמסטר אבל סה\"כ הם בסדר. רוב הגיליונות די סבבה אבל החסרון המרכזי הוא שרוב השאלות בהם הן פחות בסגנון שמופיע במבחן אז מעבר לסעיף ש\"ב שיש בכל מבחן הם לא הכנה כ\"כ טובה לדעתי. בכל מקרה הגשה חובה אז תעשו.\n\nהמבחן: ניר שחט אותנו, היה מבחן קשה. ממליץ ממש להתחיל להתכונן למבחן ישר אחרי שלומדים ערכים עצמיים ווקטורים עצמיים כי הוא דורש המון תרגול וצריך להיות מאוד חדים על החומר כדי להצליח בו. עם זאת זה בהחלט אפשרי.\n\nהשורה התחתונה: אחלה קורס, מאוד מעניין. המבחן קשה אבל בסוף זה קורס בסיס וצריך להצליח בו. המלצה לכל מי שקורא, תראו את הפלייליסט בערוץ היוטיוב של 3Blue1Brown על \"המהות של אלגברה ליניארית\". זה יתן לכם נקודת מבט חדשה על החומר ויחבר לכם הרבה נקודות שלא שמים עליהם דגש בקורס כל כך.", "timestamp": 1644664499306}, {"author": "ניצן חיים ליסטמן", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר בן דד\nחוות דעת - הרצאות: סגנון הלימוד שלו לא מתאים לכולם. אני אישית התחברתי אליו. אף פעם לא משעמם אצלו בהרצאות וזה יאמר לזכותו.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מקצועית, נחמדה מאוד וסבלנית. התרגולים שלה מאוד ממוקדים אבל יכולים להרגיש מהירים מאוד בהתחלה, צריך להתרגל.\n\nשעורי הבית: גליון להגשה כל שבוע כמעט וגם וובוורקים. שווה לעשות כי הם לרוב לא קשים מידי וזה נותן מגן. החיסרון היחיד זה שהם לא דומים לשאלות במבחן כל כך לדעתי\n\nהמבחן: מועד א היה מזעזע, מחכים למועד ב\n\nהשורה התחתונה: אחלה קורס, החומר נהיה מעניין באמצע והכל מתחיל להתחבר", "timestamp": 1645045618545}, {"author": "מטריצה מייצגת למבחן לא מייצג", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: ממש ממליץ ללכת למיכל, היא עוזרת להבין את החומר ונותנת הרבה דוגמאות כדי להעביר את החומר בצורה ברורה ולי זה מאוד עזר להבין את החומר שמאוד לא פשוט להבנה.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: אחלה מתרגלת! בקיאה בחומר לרמה של מרצה לכל הפחות, נותנת כל מיני כיוונים נוספים לפתרון התרגילים. היא כן רצה על החומר ועל התרגול כולו אז אם אתם כותבים יחסית לאט כנראה יהיה קשה לעקוב אחריה. \n\nשעורי הבית: גיליון שיוצא כל שבוע והגשה שלהם מקנה ציון מגן. היה צריך להגיש 8 מ12 לקבלת כל הנקודות אבל בהחלט עוזרים להבין את החומר בצורה טובה יותר. היו קלים יותר והיו כאלו בלתי פתירים. הוובוורקים היו גם מלמדים.\n\nהמבחן: היה מבחן אמצע ממש נחמד. מומלץ ללמוד אליו כי זה 20% מגן וזה ממש משמעותי כשמשווים את רמות הקושי בין מבחני אמצע למבחנים סופיים. המבחן הסופי היה קשה פיצוצים. החליטו לעשות מועד א לא פתיר ולתת פקטור בדיחה של 3 נקודות. ממוצע של 57 כאשר משהו כמו 70% עם מתחת ל70 אחרי הפקטור. אחרי שבאינפי היה מבחן הוגן אלגברה החליטו לעשות שרירים ולהראות שהם גם קורס ממיין. \n\nהשורה התחתונה: ממש נהניתי מהקורס רק חבל שאצטרך לעשות מועד ב כדי לקבל ציון שמשקף את רמת הידע שלי", "timestamp": 1645099504025}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עדי וולף \nחוות דעת - הרצאות: מרצה מאוד מסודרת ומאורגנת, הדפי הרצאות שלה זה הדבר הכי מושלם בעולם פחות או יותר, ההרצאות לא תמיד היו מעניינות אבל סה\"כ סביר והיה ניסיון לערב אותנו בהרצאה עם שאלות וסקרים. אלגברה זה קורס מאוד חשוב להמשך אז ממליץ לקחת ברצינות.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מעולה, רואים שהיא מבינה את הקשיים של התלמיד ויודעת לזהות את הנקודות החלשות שלו ולסייע לו, ההסברים שלה מאוד ברורים והיא אף פעם לא הותירה אותי עם שאלה פתוחה. \n\nשעורי הבית: גיליון שניתן באופן שבועי, צריך להשקיע בשיעורי בית האלה כי בהמשך משתמשים בהוכחות שעשינו בהם והם מאוד עוזרים בבניית ההבנה בחומר. לגבי הוובוורקים, דוגרי לא כאלה חשובים, הם יותר מותאמים לרמה של קורסים פשוטים וחישוביים יותר אז בדיעבד לא הייתי עושה מעבר לדרישה בשביל המגן.\n\nהמבחן: מבחן לא הוגן, היה קשה בטירוף, קשה הרבה יותר ממועדים קודמים, לא חושב שמישהו ראה את זה בא. מה גם שהממוצע במבחן היה 57 וניתן פקטור של שלוש נקודות בלבד.  \n\nהשורה התחתונה: קורס קשה, ארוך ועמוס, אני אישית התקשיתי בו יותר מבאינפי, מבחנים של ניר - סיוט מארץ הסיוטים אבל מעבר לכך לקורס יש צוות מתרגלים ומרצים ממש טוב ותומך.  שמתי דירוג בינוני אבל זה לא שיש לכם בחירה או משו. בהצלחה!", "timestamp": 1645129097056}, {"author": "אלחנן בלוך", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: קשה להשתעמם עם ניר... אז זה מוסיף עניין להרצאה, ובסוף גם עוזר לעקוב אחרי החומר.\n\nשם המתרגל/ת: יוליה פייגין-קצוב\nחוות דעת - תרגולים: התרגולים ברמה גבוהה. הרבה פעמים יוליה פותרת את התרגילים לא בדרך הפשוטה, אלא בדרך חכמה ומהירה, וזה מלמד לחשוב מחוץ לקופסא, ולהבין את החומר יותר לעומק.\nבאופן כללי, ממש מומלץ למי שהחומר יושב לו יחסית טוב. אבל מי שפחות, נראה לי שעדיף שילך למתרגל שעובד יותר לאט.\n\nשעורי הבית:\nדי עמוס. כמובן, חשוב לעשות במהלך הסמסטר, כי אחרת אי אפשר באמת להגיע מוכן למבחנים.\n\nהמבחן:\nלא פשוט, צריך גם לדעת \"לדפוק עבודה\" וגם לנמק היטב. ניר משתדל שיהיו כל פעם שאלות שהם לא רק עבודה, אלא דורשות גם הבנה מעמיקה. מצד אחד זה קשה, אבל מצד שני כשמבינים זה דווקא שאלות שעושים יותר מהר...\n\nהשורה התחתונה: בסופו של דבר, במבט לאחור למדתי כאן טכניקות מדהימות (למי שמתמטיקה קצת מעניינת אותו...)", "timestamp": 1645132136091}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ניר בן דוד (המכונה בנדה)\nחוות דעת - הרצאות: ניר באמת מרצה אחלה לדעתי, לא משעמם אצלו בהרצאות. הוא מאוד אנרגטי ובן אדם מצחיק, ואני מתחבר לכל מה שאמרו פה. הסגנון שלו לא מתאים לכולם, אני אהבתי אבל היו גם כאלה שפחות התחברו. ממליץ לנסות אותו בשבועות הראשונים לסמסטר ולראות אם אתם מתחברים. סהכ מי שהלך אליו לדעתי היה די מרוצה באופן גורף.\n\nשם המתרגל/ת: אפרת אבירם.\nחוות דעת - תרגולים: אפרת מתרגלת מדהימה. היא באמת יודעת לשים דגש על נקודות חשובות בחומר ולהנגיש דברים מאוד אבסטרקטיים לכדי משהו שאפשר לעבוד איתו. יש אווירה מעולה בכיתה שלה שווה לדעתי ללכת אליה. בתחילת הסמסטר היה די עמוס אבל אחרי שאנשים גילו את נפלאות הזום הכיתה שלה די התרוקנה והיה מקום בשפע, שזה אחלה.\n\nשעורי הבית: היו משהו כמו 12 גיליונות שבועיים להגשה. רוב הגיליונות היו ברמה די בסדר, לא קלים מדי ולא קשים מדי אבל אני חושב שהם לא ממש דומים למבחן מעבר לכך שיש במבחן סעיף שהיה בשיעורי בית. חלק מאוד גדול מהגיליונות היה די טכני (במיוחד בהתחלה) וגם החלקים שהיו עם הוכחות לא היו יותר מדי מסובכים למעט שאלה פה שאלה שם. סה\"כ צריך לעשות כי זו הדרך לתרגל את החומר אבל אל תהיו שאננים אם הולך לכם טוב בגיליונות, עדיין צריך ללמוד למבחן.\nחוץ מהם היה WW שזה בתכלס כמו כל WW אחר שיהיה לכם בסמסטר, פשוט שאלות טכניות בשביל מגן.\n\nהמבחן: הבוחן אמצע שהיה היה ממש הוגן וגם היו ציונים ממש סבבה, זה לא משקף בשום צורה את המבחן האכזרי שהיה. במבחן היו הוכחות ממש קשות וסעיפים שחלקם ברמה הרבה יותר גבוהה מכל מה שהיה במבחני עבר. פתרתי את רוב המבחנים שהיו במודל ולדעתי זה הכי קשה שנתקלתי בו. הממוצע היה 57 ונתנו פקטור ממש נמוך של 3 נקודות. ביחס לשנים קודמות ממש פתחו אותנו. רוב הקורס ניגש למועד ב'. מבאס אבל קורה שנופלים על מועדים זוועה, תקוו שזה לא יקרה לכם.\n\nהשורה התחתונה: הקורס מאוד מעניין וחשוב, ולא מרגיש שהוא יותר מדי עמוס במהלך הסמסטר אבל המבחן כן ממש ביאס. ממליץ מאוד לקחת את הקורס ברצינות וכל הזמן לוודא שהבנתם את החומר ולהשקיע כי סביר להניח שבקורסי המשך עוד תתקלו בחומר הזה.", "timestamp": 1645177486879}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר בן דוד (וקצת צילג)\nחוות דעת - הרצאות: ניר מרצה טוב, אבל לא מתאים לכל אחד. מצד אחד, מסביר טוב, בעל ידע מאוד רחב ונותן הרבה דוגמאות ויש אווירה טובה בהרצאות. מצד שני, כשהחומר קשה לנו, לו הוא לפעמים נראה מובן מאליו, וכששאולים שאלות הוא לא מבין איך יכול להיות שאנחנו לא מבינים. חוץ מזה, לפעמים הוא צוחק במהלך ההרצאה ואז בסוף ההרצאה נותן ספרינט ואז צריך לחזור/ להשלים את זה כי מאוד קשה להבין בקצב הזה.\nניר גם היה מרצה אחראי ולפי מה שהרבה אומרים, יש לו את הקטעים שלו במבחנים, אז כדאי לזכור גם את זה.\nשימו לב שגם משפטים שנראים לא חשובים בהתחלה, יכולים להיות נושא שלם בהמשך והטריק במבחן, אז חשוב לא להזניח שום דבר, גם אם נראה לא חשוב באותו הרגע.\nלפעמים יש הוכחות קצת ארוכות, לדעתי לא חייב לדעת ולזכור כל הוכחה מסובכת, אלא יותר להכיר מלמעלה.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: אחלה מתרגלת, עושה את זה מאהבה למקצוע ולסטודנטים.\nהתחברתי לזה שהיא נותנת אינטואיציה מהצד הגאומטרי - חשוב ממש. בסוף האינטואיציה יכולה מאוד לעזור אבל גם מאוד להפיל, אז כדאי להשתמש, אבל בזהירות. משקיעה הרבה בנכון/לא נכון שעוזר לסגור פינות ולהבין את המכלול. חוץ מזה משקיעה גם הרבה בקישור בין הנושאים שזה ממש חשוב.\nמצד שני, לפעמים מסבירה דרכי פתרון ואלגוריתמים לפתרון בלי להסביר עד הסוף מה עומד מאחורי כל שלב ושלב, מה שמוביל לשינון וליכולת פתרון די מקובעת. ממליץ לשים לב לזה ולוודא שמבינים למה עושים כל דבר כי אחרת אתם מסתכנים במבחן.\n\n\nשעורי הבית: WW וגיליון פתוח כמעט כל שבוע.\nממליץ להתחיל מה - WW כדי להתאמן על הטכניקה וקצת להכיר טריקים ואז לעבור לגיליון הפתוח.\nה - WW לרוב לא מאוד קשה, ובדר\"כ לוקח שעתיים-שלוש נטו.\nהגיליון הפתוח ברובו בינוני ובדר\"כ יש שאלה/ סעיף קשים יותר. לוקח בערך 6 שעות (לפעמים יש דברים ארוכים טכנית).\n\nהמבחן: מועד א היה יחסית קשה. באופן כללי חושב שמי שמשקיע בלהבין באמת את הדברים לעומק, את הקשר ביניהם, ולמה פותרים איך שפותרים ומתרגל הרבה מבחנים של ניר (בהנחה שהוא מרצה אחראי) יכול מאוד להצליח.\n\n\nהשורה התחתונה: קורס עם מבנה מיוחד. בהתחלה לומדים נושאים כלליים שאת רובם גם למדנו בתיכון (יחסית קלים) ואז לאט לאט מתחילים \"בחומר האמיתי\" (מרחבים וקטורים) ורמת הקושי עולה, וגם אז לומדים נושאים שיכולים להראות לא קשורים. אבל לקראת הסוף, (טרנספורמציות ליניאריות ולכסון) הכל מתחבר. חשוב מאוד להבין את הנושאים האחרונים כי זה מה ששואלים עליו במבחן. ממליץ לקראת הסוף להתקדם קצת לבד כדי שיהיה זמן לעכל את החומר האחרון.\nממליץ מאוד על הערוץ 3b1b ביוטיוב, נותן אינטואיציה מטורפת עם הדגמות מאוד מושקעות.\nבקורס הרבה פעמים יש דברים טכניים קצת ארוכים וסיזיפיים (ובעיקרם דירוג מטריצות), ממליץ מאוד לעבוד מסודר ולהגיע עד הסוף כשצריך, ולא לעצור באמצע ולהתחיל לנחש את הסוף! איבדתי על זה הרבה נקודות בבוחן אמצע.\nלדעתי קורס מאוד מעניין, למרות שרוב הדרך, עד לסיום, לא ברור כל כך מה הפואנטה של הקורס.", "timestamp": 1645355682050}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עדי וולף ואחר כך ניר בן דוד\nחוות דעת - הרצאות: \nעדי מסבירה אחלה אבל מתעכבת הרבה על שאלות של סטודנטים ואחר כך צוברים פערים. בנוסף, די שעמם אותי הסגנון לימוד שלה אז עברתי לניר בן דוד. ניר לא יתאים לכל אחד, לדעתי שווה לבדוק אם הוא הסגנון שלכם, מרצה שאכפת לו מאוד וההרצאות באווירה טובה.\n\nשם המתרגל/ת:  הילה מעיין וגלית במוקלט\nחוות דעת - תרגולים: \nהילה מתרגלת מעולה, פותרת תרגילים חשובים וטריקיים שחשוב לדעת ומעבירה את החומר בצורה קלילה.\nאצלנו היה במודל בנוסף תרגולים מוקלטים של גלית מהסמסטר קורונה בשנה שעברה. התרגולים האלה עזרו לי ממש בנושאים שלא הייתי חד עליהם, ממש סגר לי פינה.\nלא הלכתי לגלית פרונטלית, אך נראה שגם היא מעולה.\n\nשעורי הבית: \nצריך להגיש 7 גיליונות פתוחים מתוך 10 ויש גם WW במקביל.\nהWW עוזר מאוד בפן הטכני של לפתור תרגילים והגיליונות ממש תורמים בהבנת החומר. בודקים רק תרגיל אחד מהם, ככה שהייתי מוודא תשובות מרפרנסים כדי לדעת שפתרתי נכון.\nיש תרגיל אחד במבחן משיעורי הבית והשאר די שונים באופי שלהם. אז לא הייתי מתעכב על להשלים את שיעורי הבית שלא עשיתי לפני המבחן.\n\nהמבחן: \nהיה מבחן ממש קשה, ממוצע 57. המבחנים מאז שניר מרצה אחראי נהיו יותר קשים. בלמידה למבחן שווה להתחיל ממבחני ישנים יותר קודם, כי האחרונים יהיו ממש קשים למי שרק מתחיל ללמוד למבחן.\n\nהשורה התחתונה: \nהקורס מתחיל בצורה קלה ואז נהיה ממש קשה. בכללי הוא מאוד עמוס בחומר, שווה לעקוב כל הזמן ובמיוחד בנושאים האחרונים. הם מחברים הכול ביחד ונבחנים בעיקר עליהם.", "timestamp": 1645423444627}, {"author": "Daniel Hamzany", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניר בן דוד מהסיבה הפשוטה שכל שאר המרצים לא מספיקים את החומר.\nחוות דעת - הרצאות: מיותרות לחלוטין, כל ההרצאות משעממות ומפוצצות בהוכחות של משפטים שלא רלוונטיות למבחנים או לתרגילי הבית, וניר צועק על הלוח ועל הסטודנטים בלי סיבה נראית לעין.\n\nשם המתרגל/ת: אפרת אבירם ובהמשך מוקלטות של גלית מזרחי\nחוות דעת - תרגולים: הכרחיים בהחלט להצלחה בקורס ובמבחן, כוללים מלא טריקים שמקצרים הוכחות בהמון זמן.\n\nשעורי הבית: הוגנים, עצם העובדה שחלה עליהם חובת הגשה מוודאת בעקיפין שהחומר מתורגל.\n\nהמבחן: קשוח מאוד, מאז שניר בן דוד מונה למרצה האחראי הרמה של המבחנים רק עלתה ונהייתה בהחלט לא הגיונית, דבר שמתבטא בחציון של 50 אחרי פקטור. הצלחה במבחן כרוכה במזל טהור, מומלץ להתחיל להתחיל ממבחנים מהתקופה שלפני ניר כדי לצבור קצת ביטחון ולאחר מכן לעבור למבחנים שלו כדי להבין כמה נדפקתם.\n\nהשורה התחתונה: האופן בו חומר הקורס מועבר פגום מהיסוד, ההרצאות מיותרות לחלוטין והתרגולים חובה. כדי להצליח במבחן כדאי להגיע לתקופת המבחנים עם הבנה טובה של החומר ובמהלך תקופת המבחנים עצמה לחרוש תרגילים ממבחנים.", "timestamp": 1645485999948}, {"author": "דביר סלה", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nניר מרצה ממש טוב, מעביר את החומר בצורה כיפית ומצחיקה, ומנסה מאוד שהסטודנטים יבינו את החומר ואת האינטואיציה שמאחורי החומר. למרות זאת צריך טיפה לתפוס ראש שבאים ללמוד איתו, כי זה לא כמו הרצאה רגילה. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nאפרת מתרגלת מצוינת, מסבירה את החומר בצורה ממש טובה ובהירה, ממליץ מאוד ללכת אליה. אכפת לה מכל סטודנט, וכיף איתה מאוד בשיעורים. ממליץ מאוד.\n\nשעורי הבית: \nגליון אחד כל שבוע על החומר שנלמד באותו שבוע. הגליונות לא מאוד קשים אבל גם לא מאוד קלים. שווים את התרגול עליהם.\n\nהמבחן: \nבמועד א ניר דפק מבחן קשה פיצוצים, בכלל לא כמו כל מה שהתכוננו אליו עד עכשיו. מקווים לטוב במועד ב\n\nהשורה התחתונה: \nיש לקורס סגל ממש טוב, שאכפת לו מהסטודנטים. החומר מאוד מעניין והכל מתקשר אחד עם השני בסוף סמסטר. חבל שהמבחן היה כזה קשה.", "timestamp": 1645894627357}, {"author": "ES", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: אין אף רגע משעמם בהרצאות של ניר. הוא מביא להרצאות המון מרץ ואנרגיות, הוא ממש ההפך מהמרצים האלה שמרדימים אותך בשיעור. החומר מועבר במלואו ובצורה מקצועית, ובנוסף לזה כולנו נקרעים מצחוק כל חמש דקות בערך. בלא מעט מהמקרים, להיות בהרצאות שלו זה קצת כמו להיות במופע סטנדאפ בנושא אלגברה. ברור שלא כולם מתחברים לזה ושזה אינדיבידואלי, אבל לי אישית ברור שהחומר של קורס כזה עמוס ועם קצב מהיר כמו אלגברה אמ לא היה נקלט אצלי עם אף מרצה אחר\\ת...\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: הילה מתרגלת מדהימה!!! ניסיתי גם מתרגלים אחרים ואין מה להשוות בכלל! חדה וחכמה מאוד, וניכר שהיא מבינה את הנושאים שהיא מלמדת לעומקם וגם יודעת להסביר אותם ככה שגם אנחנו נבין, מגיעה מוכנה לתרגול ולפעמים גם מאלתרת תרגילים ודוגמאות מהראש כדי להדגים משהו שסטודנטים שאלו, עונה על שאלות מההתחלה ועד הסוף אבל גם יודעת לנהל את מהלך התרגול ולא להתפזר ולאבד את הקצב, והיחס שלה לסטודנטים באמת מעולה והאווירה תמיד טובה.\n\nשעורי הבית: הוובוורק ברמת קושי קלה-בינונית, אבל הגיליונות בהחלט מאתגרים. יש בהם מעט שאלות, אבל כל שאלה דורשת ממך להמציא את הגלגל, צריך הבנה אמיתית ומעמיקה של החומר כדי להצליח לעלות על הפתרון, וזה יכול לקחת הרבה זמן.\n\nהמבחן: בהחלט קשה. בדומה לשיעורי הבית, צריך הבנה באמת טובה של החומר, והשאלות מאוד מאתגרות ומעמיקות. וכאן אין לכם שעות וימים לחשוב על כל תרגיל, כי זה מבחן, והזמן קצר.\n\nבשורה התחתונה: קורס עמוס ומאתגר. הדבר היחיד שהיה חיובי בו זה המרצה והמתרגלת המעולים שפשוט היה כיף ללמוד אצלם.", "timestamp": 1646098071530}, {"author": "ferberonix", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמיכל היא מצרה מאוד מיוחדת. מצד אחד היחס האישי שלה לסטודנטים מדהים והיא עונה על כל השאלות בהרצאות. מצד שני היא מאוד מבולגנת ורצה ממקום למקום. לעיתים היא שוכחת לכתוב נימוקים ופשוט מצפה שנבין לבד מה היא עשתה. לעיתים היא כותבת דברים באופן לא מובן בעליל. יתרה מכך, התחביר שלה נוראי, אין שימוש בסימני פיסוק, הניסוחים די מוזרים ולפעמים היא כותבת מילים ושוכחת לכתוב איזו אות במילה. \nבתחילת הסמסטר היא הסבירה לנו שהיא בדרך כלל לא מרצה באלגברה כי היא לא אוהבת את זה מה שמסביר למה היא לא מרצה באופן איכותי מספיק.\nאין ספק שמיכל מתאימה לסטודנטים שיותר חדים על החומר וחזקים בנושאי הקורס.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nישנה התלהבות גדולה ביותר מאפרת כמתרגלת בקורסי המתמטיקה בטכניון. אפרת מדהימה ביחס שלה לסטודנטים, יודעת לעזור כשצריך ולפעמים משחילה בדיחות ברוח טובה. התרגולים שלה מאוד מהנים והיא מסבירה את החומר באופן טוב. נוסף על כך, היא עוברת על מגוון גדול של שאלות וחושפת אותנו להרבה טכניקות הנדרשות בקורס.\n\nשעורי הבית: \nישנם גיליונות בכל שבוע. לדעתי חשוב ביותר לעשות אותם מכיוון שהם חושפים אותנו למגוון תרגילים ובכך מפתחים את היכולת לפתור הרבה סוגי תרגילים בכל מיני רמות. בנוסף הכנת הגיליונות חשובה לצורך קבלת האפשרות להיות זכאי לחמש אחוזי מגן של שאלת ש\"ב במבחן (תאמינו לי היא מגנה עליכם).\nהוובורקים הם יותר טכניים ותורמים רק להבנה בסיסית ביותר של החומר, אבל גם הם מקנים מגן אז מומלץ לעשות את כולם.\n\nהמבחן: \nהמרצה האחראי הסמסטר היה כרגיל ניר בן דוד שהחליט להתחלף עם צנזור בתפקידים ולהיות זה שמתעלל בנו במבחן (לשם שינוי המבחן באינפי היה מאוד הוגן). מועד א' היה עם ממוצע 58 ומועד ב' עם 55. אלו הממוצעים הנמוכים ביותר שהיו בקורס ולא ברור מה עבר על ניר כשהוא בנה את המבחנים. גם הפקטור היה קטן מאוד (4 נק' במועד א ו-5 ב-ב').\n\nהשורה התחתונה: \nקורס בעל פוטנציאל להיות מאוד מעניין אם רק ידעו להעביר אותו בצורה הנכונה. הוא לא קשה מאוד אלא דורש הבנה עמוקה בחומר. מי שזוכר את כל המשפטים החשובים ויתרגל חזק לאורך הסמסטר יצליח מאוד.", "timestamp": 1647368168631}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צילג מוקלט\nחוות דעת - הרצאות: \nקצת קשה לפעמים להסתנכרן בין המוקלטות של צילג לבין הסדר שבו מעבירים את החומר בקורס, אבל ללא ספק צילג מסביר יותר טוב מהמרצים שיעבירו לכם את החומר. פשוט חשוב לקרוא את הסיכומים של המרצה האחראי / אחד מהמרצים האחרים בקורס כדי לוודא שאתם באמת לא מפספסים שום דבר (בגלל שהסדר לפעמים טיפה שונה).\n\nשם המתרגל/ת: אפרת פרונטלי, וגלית (מוקלטים מאביב 2021)\nחוות דעת - תרגולים: \nאפרת מסבירה את החומר בצורה טובה, אבל לפעמים התרגולים שלה בהתחלה נמרחים, ואז לקראת הסוף התרגילים הקשים מועברים בזמן קצר מאוד מה שמקשה על ההבנה. בנוסף, נעזרתי בתרגולים המוקלטים של גלית לפני פתירת המבחנים וכדי לחזק נושאים שהיו טיפה פחות מובנים - מאוד מומלץ.\n\nשעורי הבית: \nוובורקים - רובם דיי חישוביים ופשוטים, אבל בחלקם יש שאלות דיי טריקיות שכן דורשות חשיבה.\nגיליונות - כל שבוע יש גיליון, אם עושים את הגיליון בצורה רצינית בלי רפרנסים זה יכול לקחת כמה שעות. יש לפעמים תרגילים דיי תיאורטיים ולא ברורים כל כך שאם נתקעים עליהם כדאי מאוד להיעזר במישהו (או ברפרנס). \n\nהמבחן: \nלא ניגשתי למועד א' כי הוא היה סמוך מאוד למועד א' באינפי ולא באמת היה זמן מספיק להתכונן אליו במידה מספקת. אבל לפי מה שרוב האנשים אומרים הוא היה קשה מאוד ואפשר לראות את זה גם בהיסטוגרמה. במועד ב' המבחן חד משמעית לא היה קל יותר, שאלה ראשונה הכילה המון סעיפים וחלק מהסעיפים שלה נפתרו בצורה לא סטנדרטית בכלל שהזכירה יותר שאלות ממתק\"א. בנוסף במבחן הייתה שאלה שבודקים בה רק תשובות סופיות (שאלה 3), שרוב הסטודנטים טעו בה לא בגלל שהיא הייתה קשה מדי, אלא סתם כי הפתרון היה מאוד שונה מדברים שהיו בסמסטרים קודמים. (סעיף ב')\n\nהשורה התחתונה: \nהקורס מתחיל בצורה סימפטית יחסית, לקראת אמצע הסמסטר כשמתחילים ללמוד על מרחבים וקטוריים הוא מתחיל מאוד להסתבך, נאספים המון משפטים וכל הנושאים משתלבים זה בזה בצורה שיכולה להיות דיי overwhelming,  חשוב בשלב הזה להיות מאוד חדים על החומר ולעשות מעבר על כל המשפטים לעתים קרובות, אחרת נאבדים בחומר. בסה\"כ הקורס כן יפה יותר מאינפי (קשה שלא) וכן יש בו דברים מעניינים, אבל הוא דורש להיות מאוד חד על החומר לאורך הסמסטר.", "timestamp": 1647424575730}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: כמרצה ניר לדעתי ממש אחלה. הוא בנאדם מאוד מצחיק, אנרגטי והיה לי כיף להיות בהרצאות שלו. עם זאת כמו שהרבה אחרים כתבו כאן הוא לא לכולם ולא כולם יתחברו לסגנון שלו אבל כדאי לנסות בשבוע הראשון של הסמסטר את ההרצאות שלו ולראות אם אתם בסדר עם זה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת נהדרת מכל בחינה. היחס שלה לסטודנטים מדהים והתרגולים שלה באמת עוזרים להבין את החומר ולהתמודד עם התרגילי בית. ממליץ בחום.\n\nשעורי הבית: יש כל שבוע גיליון להגשה, בסמסטר שלנו ניתנו עליהם ציונים בינאריים (הוגש/לא הוגש). אם מגישים X גיליונות מקבלים בעצם מגן בדמות שאלת ש\"ב מתוכם שמופיעה במבחן וניתן עליה ציון גם בנפרד. לדעתי הם די חשובים להטמיע את החומר למרות שסגנון ורמת השאלות בהם די שונים ממה שהולך במבחנים. בנוסף לכך יש גיליון WebWork שמתפרסם כל שבוע ולפתור את רובם מקנה גם 5% מגן שזה תמיד טוב. ממליץ לפתור את הWW לפני הגיליונות הפתוחים כי לרוב הם טיפה פחות כבדים ויותר טכניים וחישוביים.\n\nהמבחן: שני המועדים שניר כתב היו ברמת קושי הזויה. הממוצע בשניהם לפני פקטור היה 57 במועד א' ו55 במועד ב' בהתאמה. באתי למועד א' וקיבלתי שוק די רציני, בסופו של דבר ניגשתי למועד ב' והצלחתי לשפר ב10 נקודות אבל הציון שלי עדיין די נמוך ביחס למה שציפיתי מעצמי במהלך הקורס. המבחנים הסמסטר היו קשים בפער מהמבחנים בסמסטרים קודמים וההיסטוגרמות בהתאם. מאוד ממליץ לפנות הרבה זמן לחרישה למבחן ובעיקר לשים דגש גדול מאוד על הבנה של החומר כדי שתוכלו להתמודד עם כל סוג של שאלה. יש המון משפטים שנראים שוליים אבל הם בדר\"כ מפתח בשביל לענות על השאלות כמו שצריך.\n\nהשורה התחתונה: הקורס עצמו לדעתי ממש מעניין ומרגיש שזה הNext Level של מתמטיקה אחרי מה שחווים בתיכון. חבל ממש שהמבחן היה קשה כי זה די מוריד לי מהחוויה של הקורס אבל בכל זאת החומר מעניין וזה בתכלס קורס שבונה בסיס שתצטרכו להמשך התואר אז כדאי ממש להשקיע כדי להבין אותו לעומק. אם ניר הוא המרצה האחראי של הקורס כשאתם לוקחים אותו, צפו למבחן קשה מראש ותחרשו טוב טוב כדי שתוכלו להתמודד עם זה.", "timestamp": 1647445102961}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: מיכל מרצה מדהימה, מסיברה מעולה ואכפת לה מאוד שכולם יבינו אבל לפעמים זה בא על חשבון התקדמות בחומר וזה מורגש לקראת סוף הקורס\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: מתרגלת טובה אבל צריך להיות חד על החומר כדי להצליח לעקוב כי היא עוברת קצת מהר על התרגילים, אבל תמיד אפשר לשאול אותה שאלות\n\nשעורי הבית: \nוובוורקים לרוב קלים, הגליונות גם יחסית קלים חוץ מכמה שאלות, יש המון רפרנסים אז אם לא מצליחים חבל להיתקע כי לפעמים צריך הברקה שאם לא ראית לפני כנראה לא תעלה עליה\nהמבחן: המבחן קשה בהרבה מהשיעורי בית והתרגולים, לא אותה רמה בכלל, לכן חשוב להקדיש לו מספיק זמן ולעשות הרבה מבחנים\n\nהשורה התחתונה: קורס מאתגר ועמוס אבל גם מאוד מעניין", "timestamp": 1647857222447}, {"author": "anonymous", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דוד צילג בyoutube\nחוות דעת - הרצאות: מפשט מאוד את החומר, ממליץ לראות מתחילת הסימסטר \n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: מעבירה את החומר בצורה מאוד ברורה וחדה \n\nשעורי הבית: וובוורקים וגליונות ברמה הוגנת, פתירים ועוזרים  להטמיע את החומר. בכל גיליון יש איזה שאלה אחת קשה יותר שדורשת יותר זמן, וכנראה גלית תפתור אותה בשעת קבלה \n\nהמבחן: קשה!!\n\nהשורה התחתונה: קורס חשוב שהידע בו משמש בהמשך, חשוב להיות על החומר לאורך כל הסימסטר.  מועד א היה 3 ימים אחרי אינפי אז חייבים לשלוט בחומר לפני תקופת המבחנים", "timestamp": 1648028082546}, {"author": "ירדן", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עדי וולף (חיזוק מצילג מיוטיוב)\nחוות דעת - הרצאות: טיפה מבולגנות במובן שלפעמים חסר הקונטקסט והסבר על איך הדברים מתחברים אחד לשני, ככה שיש אסימונים שנופלים רק לקראת סוף הסמסטר (או לא נופלים בכלל).\nסה\"כ עדי מרצה טובה ונחמדה, אפשר לשאול אותה שאלות בחופשיות. אחראית ותמיד תדאג לא לפספס שום נקודה ולהשלים כל פיסת חומר שלא תחסר.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אין על אפרת בעולם!! תרגולים שהם מופע סטנדאפ. מדביקה אותך באנרגיות ובהתלהבות שלה. הופכת את כל הבלגן של ההרצאות וכמויות החומר לשיטת עבודה ברורה ומסודרת, מספיקה לכסות מלא דוגמאות וסופר פדנטית לגבי הטכניקה.\nקצת רצה אז למי שלא מתאים קצב מהיר אולי עדיף שלא.\n\nשעורי הבית: מאוד חשובים ורלוונטיים למבחן- לא לוותר על אף גיליון ולעשות אותו מיד אחרי שמסיימים את הנושא בתרגול כדי להטמיע אותו טוב.\nמה שחבל הוא שאין פידבק אמיתי אז אח\"כ כשפותרים מבחנים ונתקלים באותן שאלות מגלים שהתשובות שכתבנו היו ערימת שטויות ולא היה מי שיגיד לנו את זה.\nהפתרון - ללכת לשעות קבלה וכמה שיותר.\n\nהמבחן: לניר בן דוד אין רחמים. המבחנים שלו קשים יותר מהגיליונות- תרגלו כמה שיותר מהם ותקראו ספר תהילים לפני המבחן.\n\nהשורה התחתונה: כולם אומרים שאינפי הוא השוק של סמסטר א', עבורי זה היה אלגברה. אל תהיו שאננים זה קורס קשה לא פחות לדעתי + כנראה שחשוב הרבה יותר.", "timestamp": 1648111426041}, {"author": "REL", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמרצה מצויינת, מסבירה טוב, נלהבת לגבי החומר, עונה לשאלות גם בהרצאה וגם בהפסקה. תמיד נותנת הרבה דוגמאות מספריות כדי שנקבל אינטואיציה לחומר ונבין אותו. יכולה להיות קצת מהירה בקצב. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nגם מצויינת. אפרת מאוד אנרגטית וזה משאיר אותך בריכוז והופך את התרגולים שלה למעניינים. מסבירה ממש טוב ובקצב מצויין, אבל כותבת מאוד מהר.\n\nשעורי הבית: \nוובוורקים - רובם היו בסדר אבל היו כמה שאלות ממש מעצבנות. מאוד חישוביים וטובים לתרגול. \nגליונות - היה מותר להגיש 8 מתוך 12 גליונות כדי לקבל מגן (סהכ וובוורקים + גליונות נתנו %5 או 10% מגן, לא זוכרת בדיוק כמה). הגליונות היו ברמה טובה אבל לא קשה מידיי, מה שקצת הטעה כי הרמה של המבחן הייתה קשה יותר. \n \nהמבחן: \nהיה בוחן אמצע ומבחן. \nקשה ולדעתי לא תואם את הרמה שלמדנו במהלך כל הסמסטר. היה פער גדול בין מה שציפינו להיתקל בו לפי הגליונות ומה שציפו מאיתנו במהלך הסמסטר לבין הרמה של המבחן עצמו, כשרוב השאלות בו היו בעצם ממורכזות סביב החומר של השבוע/שבועיים האחרונים לסמסטר. 2 שאלות פתוחות, שאלה אחת של תשובות סופיות בלבד ו2 שאלות אמריקאיות. \n\nהשורה התחתונה: \nקורס יפה ממש בעיני (גם ככה קורס חובה) אבל תופס הרבה מהנפח של הסמסטר. להישאר על החומר במהלך הסמסטר - כי כל דבר חדש שלומדים בהרצאה מתבסס על קודמיו או ישמש אותנו בהמשך - הכל בקורס הזה מתחבר. לקראת הבחינה לפתור המון מבחני עבר ולוודא שמבינים טוב את החומר גם מבחינת הוכחות וגם מבחינת חישובים.", "timestamp": 1648323227367}, {"author": "א", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: יש לו את הסגנון שלו, מי שמתחבר נהנה בהרצאות. בסמסטר שלי הוא פירסם אחלה רשימות שעזרו לי לעקוב מרחוק מה קורה על הלוח בלי לחץ לסכם מהר.\n\nשם המתרגל/ת: ניקה והקלטות של גלית\nחוות דעת - תרגולים: ניקה אחלה מתרגלת אבל רצה די מהר על החומר בלי מספיק הסברים עבורי, הלכתי בעיקר בגלל אילוצי מערכת. ההקלטות של גלית מדהימות והיא מסבירה מעולה שיטות פרקטיות איך לגשת לחומר.\n\nשעורי הבית: וובוורק + גיליון כל שבוע ברמה סבירה. חשוב לעשות את הגיליונות כמו שצריך כדי להבין באמת את החומר (+יש שאלה/סעיף ש\"ב במבחן), אבל לקחת בחשבון שהמבחן לא דומה בכלל.\n\nהמבחן: קשה מאוד בעייני. אין קשר בין הרמה וסוג השאלות בתרגילי בית לעומת המבחן. מתוך 5 שאלות יש 2 אמריקאיות ו-1 שעונים בה רק תשובות סופיות אז לרוב השאלות אין פתרונות מלאים כדי ללמוד למבחן (לא רשמי ולא סריקות של סטודנטים אחרים). בנוסף, רוב מוחלט - אם לא כל - המבחן מבוסס כמעט ורק על הנושאים האחרונים בקורס (בסיס ומימד, העתקות, לכסון, ע\"ע וו\"ע), ככה שבלי לשלוט בהם פיקס אי אפשר להצליח במבחן.\n\nהשורה התחתונה: קורס לא תמים, נראה בסדר רוב הסמסטר אבל הרמה קופצת בנושאים האחרונים וכמעט רק עליהם מבוסס המבחן. ממש לא אלגברה מהתיכון.\nקורס חובה וקדם לכמה קורסים חשובים במדמ\"ח אז כדאי להשקיע ולעבור אותו בלי להימרח.", "timestamp": 1648413152840}, {"author": "DS", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה ממש טוב. הוא כיפי, מצחיק ורואים שהוא נהנה להעביר את החומר. כל שבוע חיכיתי להרצאות שלו. צריך טיפה לתפוס ראש שמגיעים אליו, אבל ברגע שאת איתו הוא ממש טוב.\n\nשם המתרגל/ת: אפרת \nחוות דעת - תרגולים: \nאפרת מתרגלת מדהימה, מסבירה את החומר בצורה ממש טובה, מעניינת ונגישה. רואים שאכפת לה מכל סטודנט, והיא מתייחסת לכל אחד בצורה מדהימה. ממליץ ממש למי שיכול.\n\nשעורי הבית: \nגליון אחד כל שבוע. הגליונות לא הכי קשים, אבל צריך לדעת את החומר שהיה בתרגול ובהרצאה בשביל להצליח לפתור אותם. \n\nהמבחן: \nלא יודע מה עבר על ניר הסמסטר. מועד א  היה קשה בצורה לא פרופורציונאלית יחסית למבחנים משנים קודמות. מועד ב גם היה קשוח ממש. ניר עשה לנו חיים קשים.\n\nהשורה התחתונה: \nבהתחשב בכך שזה קורס חובה, אין הרבה מה להגיד. הצוות מעולה, רק המבחן היה ממש קשה.", "timestamp": 1648623476398}, {"author": "LGX", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: פאתחי סלאח\nחוות דעת - הרצאות: מזעזע, מרצה משעמם. לא טורח לתת שום אינטואיציה לחומר. \n\nשם המתרגל/ת: גלית מזרחי (מוקלט)\nחוות דעת - תרגולים:  התרגולים המוקלטים נהדרים. גלית נותנת דגש על שאלות עם \"טריקים\", מפרטת על  דרכי הפתרון וההגיון מאחוריהם. מומלץ מאוד. בתרגולים פיזיים קצת קשה לקלוט את כל הנ\"ל בבת אחת. \n\nשעורי הבית: קלים עד גליון שש בערך, החל מאמצע הסמסטר דורשים יותר זמן\n\nהמבחן: יחסית הוגן. \n\nהשורה התחתונה: תרצו או לא אתם חייבים לעשות את הקורס", "timestamp": 1657533820851}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דוד צילג (מוקלט)\nחוות דעת - הרצאות: הקלטות מדהימות, מסביר באופן ברור את החומר עם הומור, יש אווירה כיפית וקלילה בהקלטות.\n\nשם המתרגלת: רותם בן זאב\nחוות דעת - תרגולים: רותם מתרגלת ממש טובה. \nנותנת תרגילים טובים ואפשר לראות שהיא נהנת להעביר את התרגולים ואוהבת את החומר. מעלה רשימות מאוד מסודרות.\n\nשעורי הבית: יחסית קצרים וטכנים.\n\nהמבחן: לפי דעתי המבחן היה מאוד הוגן, הפתוח בדק שליטה בהבנה של החומר ובטכניקה. קצת חבל לי שיש שאלות אמריקאיות כי יכולה להיות טעות חישוב קטנה בשאלה ובמקום לאבד 2 נקודות מאבדים את כולה. \nלפי דעתי שאלות אמריקאיות זה פחות מתאים לקורסים במתמטיקה (גם באינפים) אבל מבין שחיוני להם חלק אמריקאי בגלל המספר הרב של הנבחנים וחוסר בכוח אדם בבדיקה.\n\nהשורה התחתונה: קורס חמוד, לפעמים קצת טכני ומעיק, אבל יש הרבה חומר מעניין.", "timestamp": 1657634407956}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פתחי סלאח\nחוות דעת - הרצאות: ההרצאות אצלנו היו עמוסות אז לא נכנסתי. ראיתי דוד צילג ביוטיוב.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מצוינת ומעבירה את החומר ברמה גבוהה מאוד. נותנת טיפים טובים אך לעיתים קצת מהירה עם הקצב \n\nשעורי הבית: גליונות עמוסים, אבל מומלץ לעשות בשביל המגן והתרגול.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657819248447}, {"author": "לא יודע מה זה רלוונטי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "קורס שמשקיע מלא זמן בהגדרות והוכחות מפורטות של כל מני תכונות חצי מובנות מאליהן, אבל בעיקר בסוף שלא (קצת גם במקומות אחרים) פתאום מתחילות מלא בעיות אלגבריות קשות. בפועל יותר מעניין אותם לדעת לפתור את הבעיות ולהוכיח בערך ורוב העיסוק הריגורזי בקורס מיותר קצת.", "timestamp": 1658304073245}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פתחי \nחוות דעת - הרצאות: לא התחברתי כל כך. הרגשתי שהוא רק מעתיק מהדפים שלו ולא באמת מסביר.  לא הייתה ברירה כי הוא היה המרצה היחיד בסמסטר הזה. \n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: בגדול מסבירה היטב. אבל לא באמת הרגשתי שרמת השאלות שהיא מעבירה או פותרת דומה למבחנים. הייתה פותרת תרגילים בסיסיים וטכניים. לא יודע אם זה המצב רק אצלה... \n\nשעורי הבית: לא חובה. לעיתים רבים לא באמת משקפים את רמת המבחן \n\nהמבחן: קשה ודורש השקעה\n\nהשורה התחתונה: קורס קשה... דורש הרבה הרבה השקה. לדעתי קשה יותר מאנפי, יכול להיות שזה רק אני...", "timestamp": 1660315561419}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אירנה\n\nחוות דעת - הרצאות: \nמרצה מעולה. מסבירה את החומר בצורה מובנת ומעניינת. תמיד מרגיש נעים לפנות אליה לשאלות בין אם זה בהרצאה בשעת קבלה או במסדרון בדרך לכיתה.\nכותבת ומלמדת בקצב די מהיר (לא יתרון ולא חסרון מתאים לאנשים מסוימים)\nיועיל מאוד אם תשפר את האסטתיקה והסדר על הלוח- כתב יותר גדול וישר, מחיקות עד הסוף של הכיתוב הקודם וניהול נכון של המקום בכל משבצת.\nשורה תחתונה מודה על הזכות שנפלה בחלקי ללמוד מאירנה!\n\nשם המתרגל/ת: אפרת אבירם\n\nחוות דעת - תרגולים: \nאפרת מעולה, כבר כתבתי לה חוות דעת כמתרגלת באינפי. אין מה להוסיף\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1674375526418}, {"author": "אנונימי‬‎", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מדהימה! לכו לשעות קבלה וסדנאות שלה מסבירה מעולה.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: כיפית בטירוף, אנרגטית גם אחרי 6 שעות על הרגליים ותמיד מוכנה לענות על הכל, עמוס מאוד בתרגולים, אבל היה שווה את זה.\n\nשעורי הבית: מבאס שאין פתרונות לגליונות, הוובוורקים מעולים וטובים לתרגול\n\nהשורה התחתונה: אם אין ברירה נעשה את הכי טוב שלנו :)", "timestamp": 1675888448459}, {"author": "OBL", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nבכנות ההרצאות היו יחסית מבולגנות, קצב מהיר וקשה לחלק לנושאים.\nאירנה עצמה הייתה מאד אכפתית, ענתה על שאלות בסבלנות לכל מי ששאל, וכן למדתי מההרצאות אבל בתכלס לרוב יצאתי דיי מבולבל.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: \nווואו. המתרגלת הכי אנדראיטד בטכניון. לימדה בצורה מעולה, את כל הטכניקה והפרקטיקה שכל כך צריך במקצוע. עושה את זה אשכרה כתחביב, עם המון אהבה שניכרת.\n\nשעורי הבית: \nגיליון + WW כמעט כל שבוע. בודקים יחסית שטחי. מעט מגן, אבל מאד מומלץ לעשות כי זה התרגול הכי טוב לחומר הזה\n\nהמבחן: \nאצלנו היה קשה מאד. לרוב סמסטר חורף קשה - תתכוננו\n\nהשורה התחתונה: \nקורס טכני יחסית, דורש הבנה אבל בעיקר הרבה טכניקה, שליטה במושגים ובמשפטים. זה לא הופך אותו לקל - היקף החומר עצום וצריך לקחת אותו ממש ברצינות", "timestamp": 1675954969003}, {"author": "ע״ע", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:ד״ר אירנה גורליק\nחוות דעת - הרצאות: \nההרצאות נחמדות והאווירה טובה אבל הן די מיותרות, בהרצאות רק מוכיחים משפטים שההוכחה שלהן מסובכת מאוד, לא דומה לתרגילים שאחר כך פותרים, אף אחד לא זוכר אותן וכמעט אף פעם לא מבקשים אותן. אישית היו מקרים שלא הגעתי להרצאות והגעתי לתרגול אחרי והבנתי את החומר מהקשר .לקראת סוף הקורס השתמשתי בקורס של עליזה מלק שמוכיח הכול ומראה הרבה דוגמאות ברמה טובה אז הייתי ממליץ אבל עדיין כדאי לעקוב על החומר כי אחרת מפספסים דברים.\nשם המתרגל/ת: גב. אפרת אבירם\nחוות דעת - תרגולים: \nמתרגלת נהדרת, מסבירה טוב את החומר ובצורה ברורה, התרגולים זה כל הקורס אז לא לזלזל בהם. לפעמים יכולה להיות איטית מה שגורם לה לפספס תרגילים אז כדאי לבדוק בהקלטות של התרגולים שלא התפספס כלום אבל באמת שאין כמוה.\nשעורי הבית: \nגליונות וובוורקים, גליונות ברמה די לא מעמיקה שלא באמת נבדקים, הציון כמו בקורסי מתמטיקה נקבע בזמן המבחן אז המשמעות שלהם די זניחה…\nהוובוורקים כן קיבלו משקל ולרוב היו פשוט מעבר על הטכניקה, הייתי ממליץ לעשות אותם מיד אחרי התרגולים כדי לקלוט את החומר ואז לעבור לגיליונות. בסה״כ שיעורי הבית ממוחזרים וקלים בהרבה מהמבחן.\nהמבחן: \nהשנה היה קצת מוזר, דרשו לעשות דברים שאף פעם לא ראיתי שדרשו מה שגרם קצת לבהות במבחן… האמריקאיות היו לא פתירות ברמה שצריך פשוט לשלול על ידי דוגמאות נגדיות עד שמגיעים לנכונה כי לך תנסה להוכיח. אבל בסה״כ אם עוברים על הרבה מבחנים ומתרגלים בעיקר את האמריקאיות אמור להיות בסדר.\nהשורה התחתונה: \nקורס חובה אבל מאוד נחמד לדעתי. מלמדים חומר שמרגיש קצת כמו לפתור חידות שזה נחמד. החיסרון העיקרי זה הרצון להוכיח כל דבר, והעובדה שאין באמת סדר לקורס. חשוב אבל לקראת הנושא האחרון להיות על כל החומר כי אז הוא פשוט מגיע ביחד אחרי שכל נושא לא היה קשור לקודם.", "timestamp": 1676044349850}, {"author": "Gg", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה:דר אירנה גורליק \nחוות דעת - הרצאות: \nמלכה. מהירה מאוד אבל מסבירה מעולה למי שבקצב שלה ועל החומר\nשם המתרגל/ת: אפרת/גלית \nחוות דעת - תרגולים: \nשתיהן מצוינות אני אישית זגזתי ביניהן במהלך הסמסטר והתרגולים עזרו לי מאוד להבנה של החומר, פחות למבחן\nשעורי הבית: \nלא נוראיים אבל לא כל כך קשורים למבחן.\nעזרו להבנה של הקורס.\nהמבחן: \nקשה מאוד, גם למי שהיה על החומר כל הקורס חשוב לתרגל כמה שיותר מוקדם.\nהשורה התחתונה: קורס קשה, בהצלחה.", "timestamp": 1676213512035}, {"author": "*", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nבאמת מקסימה ויש לה הבנה טובה של החומר, תמיד עונה על שאלות ואכפת לה מהסטודנטים. לפעמים יצאתי מבולבלת מההרצאות כי הן היו קצת מבולגנות בעיניי ועברתי שוב על החומר אחרי, אבל בשורה התחתונה ממש שמחתי שהייתי בהרצאות של אירנה.\n\nשם המתרגל/ת: ניקה פת \nחוות דעת - תרגולים: \nבעיניי היא מעולה, מספיקה המון תרגילים שרלוונטיים לחומר וכמעט תמיד נפלו לי אסימונים בתרגול. נחמדה ויודעת לענות על כל שאלה, מאוד משתפת את הסטודנטים במענה לשאלות.\n\nשעורי הבית: \nwebwork וגליון כמעט כל שבוע. לא חובה להגיש אבל זה מגן. לדעתי חייבים להגיש אחרת לא באמת מבינים לעומק את החומר. הרמה של הגליונות לא מאוד גבוהה אבל הם כן ארוכים ולוקחים זמן.\n\nהמבחן: \nלדעתי הוא היה קשה, בוודאות קשה יותר מהגליונות אז שווה לתרגל הרבה מבחנים לפני. קצת קשה לעמוד בזמנים.\n\nהשורה התחתונה: קורס קשה ועמוס, לא להיות שאננים לפני המבחן אם הולך לכם בגליונות.", "timestamp": 1676286683673}, {"author": "liaaa", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: יוסי מצחיק ממש ומסביר טוב את החומר, מתעקש להתעכב על חומר אם אנשים לא מבינים ומפשיט רעיונות. גם עשה איתנו תרגילים שממש הראו את החלק היישומי של החומר התיאורטי. הוא לא הכי מסודר שיש ברישומים שלו אבל אני אישית ממש נהניתי משיעורי אלגברה שלו, הייתה אווירה טובה.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: הלכתי לכל המתרגלים שהיו זמינים לנו - אין על אפרת. נקודה. \n\nשעורי הבית: הש.ב לא קלים וגם פה כמו באינפי אסורררר להסתכל ברפרנס. הרבה שאלות מהש.ב לקוחות ישירות ממבחנים ובחני אמצע אז זה גם תרגול ממש טוב בשבילכם לקראתם.\n\nהמבחן: המבחן היה לצערי לא הוגן השנה- היה השענות כבדה על חומר המרוכבים שלא לימדו אותנו ולמדנו עצמאית, ושאלות שרמת הקושי שלהן גבוהה מהרגיל. בקיצור מועד ב'\n\nהשורה התחתונה:", "timestamp": 1676378038991}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ניר+צילג מוקלט\nחוות דעת - הרצאות: \nמיותר להגיע פרונטלית- צילג מסביר במוקלט הרבה יותר טוב בצורה משמעותית\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nמתרגלת מצוינת. עמוס מאוד אצלה אז ממליץ להגיע מוקדם ולתפוס מקום.\nשעורי הבית: \nברמה גבוהה. לרוב ממוחזרים אז יש הרבה רפרנסים. ממליץ להשקיע ולהשתמש בשעות קבלה וסדנאות\nהמבחן: \nקשה, להתחיל לתרגל מבחנים כמה שיותר מוקדם\nהשורה התחתונה: קורס קשה", "timestamp": 1676489436947}, {"author": ",,,,,", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ד\"ר אירינה\nחוות דעת - הרצאות: אחלה מרצה רואים שיש לה אכפתיות מהסטודנטים, החסרון היחידי שהיא לא כותבת מסודר על הלוח.\n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: היא המתרגלת הכי מצויינת בפער לדעתי היא underrated, היא מסבירה טוב מאוד, תמיד מנסה לעבור על כל הטעויות הנפוצות של הסטודנטים, נותנת הרבה טיפים ומדגישה הרבה דברים.\nאם מסתדר לכם עם המערכת השעות לכו אליה כי לא תתאכזבו.\n\nשעורי הבית:\nלא קשים, הכל בריפרינס אבל לדעתי לא צריך. \n\nהמבחן: היה קשה מאוד, לא יודע מה עובר בראש של ניר כשהוא כותב את המבחן.\nבתכלס מועד ב'.\n \nהשורה התחתונה: קורס מעניין לדעתי, החומר לא קשה להבנה והכל בנוי על הנושא שנלמד לפניו לכן אל תפספסו שום הרצאה מבלי להשלים אותה לפני ההרצאה שאחריה.", "timestamp": 1676660331823}, {"author": "Lior", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמרצה טובה, מסבירה הכל בפשטות יחסית, חוץ מהנושא האחרון הרגשתי שהחומר ישב לי טוב כמעט מיד. \nממליץ להעתיק רק משפטים ודוגמאות, ובהוכחות רק להקשיב ולהבין. ההוכחות עצמן לא חשובות בש\"ב/מבחנים, אבל כן כדאי להכיר את הטכניקות כי הן חוזרות על עצמן בהרבה תרגילים.\nשימו לב שאתם יושבים בצד ימין של האולם!\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nללכת לאפרת זה בגדר חובה. היא מסבירה כל תרגיל וכל פתרון ממש לעומק, והתרגילים שעשינו איתה חוזרים כל הזמן בגיליונות ובמבחנים.\n\nשעורי הבית: \nגיליונות ארוכים שדורשים הרבה מאוד זמן. כדאי להשקיע בהם ולהגיש כי מקבלים משוב עליהם, גם אם הוא ממש חלקי.\n\nהמבחן: \nהמבחנים של ניר מרגישים כאילו כל הציון תלוי במזל של איזה תרגילים הוא יבחר. מה שכן, יש חלק גדול של תרגילים שחוזרים על עצמם, לכן שווה לתרגל כמה שיותר מבחנים שהוא כתב. \n\nהשורה התחתונה:", "timestamp": 1676726833234}, {"author": "Shahar", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מקסימה ומסבירה הכול כמו שצריך, אחת המרצות הטובות.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: פותרת תרגילים שמאוד עוזרים להבנה, נחמדה מאוד.\n\nשעורי הבית: יחסית קלים, נבדקים ממש בקטנה.\n\nהמבחן: השאלות הפתוחות יחסית הוגנות (למרות שאצל ניר הוא לפעמים מכניס חומר יחסית נישתי להיות במרכז השאלה, אצלנו זה היה מטריצה מייצגת של הרכבה), לאמריקאיות חייבים להתכונן כמו שצריך וגם אז הן מרגישות קצת תלושות. הם אף פעם לא מפרסמים תשובות מפורטות לשאלות האלה אז אי אפשר ממש להתכונן ממבחנים קודמים.\n\nהשורה התחתונה: קורס מעניין, חשוב בסמסטרים של ניר לפתור המון מבחנים שלו להבין את צורת החשיבה שלו.", "timestamp": 1676758619209}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מאוד נחמדה, אבל כותבת על הלוח מהר בהצאות. קשובה לשאלות של תלמידים.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: תרגולים מאוד מסודרים. ניקה התאימה את עצמה למצב של הכיתה. התרגולים שלה עזרו לי להבין את החומר הנלמד.", "timestamp": 1677074015620}, {"author": "מ ר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מדהים. המרצה הכי טוב שהיה לי אי פעם. מעביר את החומר בצורה מובנת ומעניינת עם צחוקים, ומאפשר לסטודנטים להרגיש בנוח לשאול שאלות תמיד. יחזור על כל מה שצריך חמש פעמים אם צריך. האווירה בכיתה הייתה נהדרת. אין מרצים כאלה.\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מתרגלת סבבה. קצת היה לי קשה עם זה שהיא מדברת מהר וכותבת אפילו יותר מהר.\n\nשעורי הבית: גיליון פתוח פעם בשבוע וחצי + וובוורק פעם בשבוע? משהו כזה. היו סבבה דווקא\n\nהמבחן: הייתה בו שאלת מרוכבים קצת מגעילה אבל אחרי שהבנתי את הפתרון של המבחן, וואלה היה מאוד פייר. בכל זאת היה קשה אבל\n\nהשורה התחתונה: קורס קצת כיפי אבל עמוס", "timestamp": 1677700024282}, {"author": "..", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דר אירנה גורליק\nחוות דעת - הרצאות: \nמרצה מעולה, מומלצת מאוד. \nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nמדהימה אם היא מתרגלת חובה ללכת.\nשעורי הבית: \nכל שבוע וובוורק וגיליון אני ממליץ להתחיל מהוובוורק כי הוא יותר טכני ועוזר בהקנייה של החומר ורק אחר כך שיותר חדים על החומר לגשת לגיליון ממליץ מאוד לעשות את כל הגליונות במיוחד את האחרונים כי רוב השאלות בהן הן שאלות ממבחנים וזאת הכנה טובה למבחן \nהמבחן: אם מתרגלים מספיק מבחנים רואים שזה מאוד חזרתי והרעיונות של השאלות די חוזר על עצמו, צריך לתרגל הרבה במיוחד שאלות אמריקאיות שלרוב מפילות הרבה אנשים \n\nהשורה התחתונה: לדעתי קורס מרתק שבהמשך הופך להיות גם רלוונטי לתואר.ממליץ", "timestamp": 1678087887900}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: לי לי לי רק רק רק\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: אחלה מתרגלת\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678105089755}, {"author": "הלורד", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: התחלתי עם ניר אבל פחות התחברתי לסגנון אז עברתי לאירנה. הרצאות בקצב די גבוה וקצת קשה לעקוב תוך כדי הרצאה. ממליץ לקרוא סיכומי הרצאה לפני ההרצאות כדי לנסות להישאר על זה\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מתוקה ומסבירה מעולה!\nאין כל כך סנכרון בין ההרצאות לתרגולים אז כל תרגול הוא הפתעה \n\nשעורי הבית: גליון ו-webwork פעם בשבוע. הגליונות עוזרים להבין טוב את מה שנלמד ולרוב יש רפרנס. הציון עליהם הוא 1/0 אז צריך פשוט לעשות ברצינות ולא חשוב כמה צדקת.\n\nהמבחן: מאוד תלוי על איזה מבחן נפלת, לרוב קשה אך פתיר. השאלות האמריקאיות מבלבלות ומסוכנות.\n\nהשורה התחתונה: אין כל כך ברירה אלא פשוט להתמודד עם זה", "timestamp": 1678377974752}, {"author": "אנונימיץ", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה:  יוסף כהן\nחוות דעת - הרצאות: \nהרגיש מבולגן לעיתים תכופות, במיוחד לקראת סוף הקורס. לטעמי אפשר יותר מדי שאלות שנענו לפני חצי שעה/ בהרצאה הקודמת ונותן את אותה התשובה מילה-במילה. רצוי לתת לו לסיים משפט כשרוצים \"לפתוח שולחן\"\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \nמעבירה את החומר היטב, מסבירה כיצד רצוי ונכון לענות על שאלות. העבירה גם מרתון תרגול לפני המבחן.\n\nשעורי הבית: \nמומלץ מאוד לעשות את כולם ולפתח את החשיבה. תעשו את הוובוורקים קודם, הם עוזרים להבנה!\n\nהמבחן: \nקשה, במיוחד בשנים האחרונות, לרוב בלי פרופורציה. יש דקויות בנושא שדה המרוכבים ואיך הם משתלבים עם החומר המתקדם שלא נלמדו/ תורגלו בסמסטר.\n\nהשורה התחתונה: \nמגעיל באופן לא רגיל.", "timestamp": 1678992000860}, {"author": "..", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מרצה מעולה ומצחיק, קצת מבולגן אבל אפשר להתגבר על זה\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: לא חובה אבל עוזרים מאוד להבין את החומר במהלך הסמסטר לא ככ קשים.\n\nהמבחן: מפתיע, כדאי להתכונן הרבה ולעשות כמה שיותר מבחנים של המרצה האחראי בסמסטר שלכם.\n\nהשורה התחתונה: קורס חובה ויהיה בסדר", "timestamp": 1679136200040}, {"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי \nחוות דעת - הרצאות: \nאווירה קלילה ורגועה , עונה לכל השאלות (גם בפעם החמישית, לטוב ולרע) , מסביר את החומר לעומק גם מעבר לחומר הרשמי נטו בשביל שבאמת נבין\nלפעמים קצת קשה עם המבנה של השיעור שלו - הוא קודם מפיל עליך את כל החומר היבש ואז מתחיל לחבר הכל ביחד. אני אישית התחברתי אבל לא מתאים לכל אחד\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: \nמדהימה. חזקה על החומר, תמיד מסבירה מכמה כיוונים שונים, תמיד ברורה \n\nשעורי הבית: \nבדרך כלל לא קשים, הWW מסדרים את החומר ואז הגליון הוא תרגול מצויין ומאוד דומה לרמה במבחן\n\nהמבחן: \nסך הכל הוגן, שאלות של בעיקר הבנה אבל חבל שקל כל כך ליפול על טעויות חישוב סתמיות\n\nהשורה התחתונה: \nקורס מעניין, האמת די נהניתי ממנו", "timestamp": 1679249442644}, {"author": "צנזור", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: אהבתי מאוד. ניר מצחיק ודואג להשאיר אותך ערני כל ההרצאה, מעביר את החומר בצורה טובה, קצת מבולגן ולפעמים מתעמק יותר מדי בפרטים שוליים אבל בסך הכל מרצה מצוין, כל הרצאה שלו מרגישה כמו הופעה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אלופה! מתעכבת ומסבירה כמה שצריך ובכל זאת בקצב טוב עם החומר, מאוד יסודית ואכפת לה מאוד שיבינו אותה כולם.\n\nשעורי הבית: גיליון פעם בשבוע בערך, הגיליונות ברמה קצת יותר גבוהה מהתרגולים.\n\nהמבחן: קשה. לא ברור למה זה ככה אבל זה תמיד ככה - המבחן משמעותית יותר קשה מכל מה שעושים במהלך הסמסטר. החומר הוא בעיקר 3-4 ההרצאות האחרונות אבל ברמה שלא נתקלים בה.\n\nהשורה התחתונה: קורס לא נורא אבל המבחן קשה", "timestamp": 1679328683663}, {"author": "~A", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מרצה מעולה, לפעמים היא קצת רצה אבל לי זה לא הפריע לי, עונה על כל השאלות ומביאה דוגמאות\\דוגמאות נגדיות שימושיות.\nרואים שהיא נהנת מללמד ולהעביר את הידע שיש לה לסטודנטים שלה. \n\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: יוליה מתרגלת ממש טובה לדעתי, היא מעבירה כמות שאלות טובה. התחברתי לסטייל לימוד שלה.\n\nשעורי הבית: גליון כל שבוע בערך, לא קשים, דורשים הבנה של החומר אך לא דורשים המון זמן.\n\nהמבחן: ניגשתי רק למועד ב', לדעתי היה סטנדרטי😉 אם פותרים מספיק מבחנים של ניר רואים שהשאלות סוג של חוזרות על עצמן...\n\nהשורה התחתונה: קורס 5.5 נק''ז שאפשר לקבל בו ציון מכובד עם יחסית (לאינפי) לא יותר מדי השקעה.", "timestamp": 1679427108174}, {"author": "מקנן המטריצות", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה בן אדם מדהים וחכם בטירוף. בעיה אחד זה שהיא חייה על כפול 1.5 בטבעי שלה אז קשה מאוד לעמוד בקצב שלה כי היא ממלאת לוח בעשר דקות אבל אם תשאלו שאלות תוך כדי אתם תהיו בסדר והיא גם תשמח לענות לכם עליהם.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה וזה משתקף בעומס בתרגולים שלה אבל בהחלט שווה את זה כי אין סיכוי שתצאו ממנה בלי שהחומר יפול לכם כמו שצריך ואני נשארתי אחרי ריצות ממאייר עד לפקולטה לחינוך אי שם למטה בפחות מעשר דקות כדי לתפוס מקום אז תאמינו לי שהיא שווה את המאמץ\n\nשעורי הבית: הגליונות והוובוורקים יוצאים כל שבוע והם בהחלט מצריכים זמן והשקעה לפתור אותם אבל בסוף זה רק ישתלם לכם.\n\nהמבחן: תפנו הרבה זמן לפני המבחן כדי להתכונן אליו ותתכוננו אליו כמו שצריך כי אין סיבה לא להצליח בו אבל הוא פשוט מצריך השקעה ופתירה של כמה שיותר מבחני עבר כדי לתפוס את הקטע של המבחן.\n\nהשורה התחתונה: אירנה ואפרת לשלטון!!! צמד מנצח שפשוט התאהבתי ביכולות הרצאה שלהם כבר מהשבוע הראשון", "timestamp": 1679504211645}, {"author": "נב\"ד המרושע", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אירנה גורליק המלכה\nחוות דעת - הרצאות: אירנה אחלה של מרצה, אין הרבה דברים רעים להגיד עליה. היא מסבירה מצוין, מצחיקה כשצריך, ודואגת לעזור. בכיף הייתי עושה עוד קורסים איתה. אבל, קחו בחשבון שהיא כותבת על סף מהירות האור, ברמה שכשיושבים באולם וממצמצים אז שליש מהלוח מלא. ראו הוזהרתם!\n\nשם המתרגל/ת: אפרת \"אין מקום\" אבירם\nחוות דעת - תרגולים: אפרת גם היא מתרגלת מצוינת. הבעיה המרכזית עם אפרת זה שאני לא הסטודנט היחיד שעלה על זה שהיא אחלה מתרגלת, לכן התרגולים שלה הם מפוצצים יותר מהר מירון. יצא לי לא פעם אחת לשבת על סף של חלון, לעמוד מחוץ לדלת או בכלל לא להצליח להכנס, וזה ממש בעיה. באמצע סמסטר עברנו לאולם שרמן בפקולטה לחינוך (שזה די חור) בנסיון לפתור את הבעיה, אבל זה לא עזר. תשדלו להגיע מוקדם אליה או לסדר שמישהו יתפוס לכם מקום.\n\nשעורי הבית: גליון כל שבוע וגם וובוורק . הייתי ממליץ במיוחד לקראת הסוף של הסמסטר דווקא לא לוותר על הגליונות האחרונים כדי ללמוד למבחנים, כי הנושאים האחרונים ממש חשובים.\n\nהמבחן: לא נוראי, אבל די מחריד. הבעיה שהמבחן שלנו היה שלושה ימים אחרי המבחן של אינפי מה שהקשה על ההתכוננות למבחן. תוסיפו לזה את העובדה שניר בן דוד שהיה המרצה האחראי כותב מבחנים מזוויעים באופן עקבי, ותקבלו את אלגברה אמ.\n\nהשורה התחתונה: קורס קשוח אבל אפשר להצליח בו אם משקיעים מספיק.", "timestamp": 1679504255851}, {"author": "עמית", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אני אישית מאוד אוהב את אירנה. כמרצה היא מאוד מקצועית וסבלנית לשאלות אך עם זאת עשויה להיות מעט מבולגנת ברצף או מפוזרת על הלוח, וזה מאתגר בעיקר כשלא חדים ב100% על החומר. לדעתי השילוב המנצח הוא לעשות חזרה של 10 דקות לפני השיעור כדי שכשהרצף של אירנה נהיה מבלבל לא תאבדו אותה.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: אשת הסגל הטובה ביותר שיש. מאוד אכפתית כלפי הסטודנטים, מאוד מתודית ופרקטית, ומקצועית להפליא. ממליץ מאוד!\n\nשעורי הבית: הוגנים, שאלות שראיתי ממבחני עבר ולדעתי עוזרים בהטמעת החומר ובלהרים את הסטודנטים לרמה הנדרשת למבחן.\n\nהמבחן: מאתגר אך הוגן\n\nהשורה התחתונה: קורס חשוב ומאתגר עם סגל מצויין.", "timestamp": 1679644692568}, {"author": "נועם קרן", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: לקח לי הרבה זמן להתרגל לקצב שלה ולבלגן, אני חושבת שזה שריר שצריך להתרגל אליו במיוחד באלגברה שכמויות החומר הן אדירות..\nנותנת הרבה זמן לשאלות ותמיד זמינה בהפסקות\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: המתרגלת הכי טובה בפער \n\nשעורי הבית: לוקחים זמן, אבל שווה להשקיע בהם, מכינים למבחן\n\nהמבחן: תלוי מבחן, אבל לא מורכב מאוד אם חורשים טוב\n\nהשורה התחתונה:", "timestamp": 1679651905009}, {"author": "אליהו", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות:\n\nשם המתרגל/ת: עליזה מאלק\nחוות דעת - תרגולים: \n\nשעורי הבית: \nממוחזרים מאוד. דורשים בין שעתיים לשלוש בשבוע (בלי רפרנס).\nהמבחן: \nקשה.\nהשורה התחתונה:", "timestamp": 1689600316110}, {"author": "א", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: מסביר מעולהת מרוצה מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס לא פשוט", "timestamp": 1690378370959}, {"author": "s", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: פחות התחברתי, מדבר באופן יחסית מונוטוני אז לי היה קצת קשה לעקוב\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: המתרגלת הכי טובה בעולם, מסבירה את החומר באופן מובן ואינטואטיבי ובכללי אכפת לה מהתלמידים. עונה על כל שאלה ונשארת כמה זמן שצריך בשעות קבלה עד שלאף אחד אין יותר שאלות.\n\nשעורי הבית: חשוב ממש לעשות אותם, הם לא פשוטים אבל עוזרים להבין את החומר\n\nהמבחן: יחסית הוגן\n\nהשורה התחתונה: אמנם קורס מתמטי ולא פשוט אבל אם משקיעים במהלך הסמסטר אפשר ממש להצליח", "timestamp": 1690438642474}, {"author": "A", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: הקלטות של עליזה מהיוטיוב\nחוות דעת - הרצאות: עליזה מלק מדהימה ממש!!! הבעיה היחידה היא שקשה להבין מהיוטיוב איזה משפטים מותר להשתמש ובאיזה לא, ומה שקרה בסוף זה שבמבחן השתמשתי במשפט שהיא לימדה אבל זה לא היה משפט מההרצאה וירד לי די הרבה ניקוד על זה, אז תוודאו שאתם מעודכנים ברשימת המשפטים בסמסטר שלכם...\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: מעולה מעולה מעולה מומלץ בחום\n\nשעורי הבית: קשים אבל חשובים, אל תוותרו עליהם\n\nהמבחן: דומה ברמה שלו לתרגילי הבית ולדברים שפתרנו בתרגול\n\nהשורה התחתונה: קורס חשוב להמשך התואר, וגם הרבה נק\"ז, אל תזלזלו", "timestamp": 1690728774004}, {"author": "A", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: צילג ופתחי\nחוות דעת - הרצאות: פתחי מדבר בקול מונוטוני ומרדים. אם אתם יכולים לראות את המוקלט של צילג, תעשו את זה\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מתרגלת מצוינת! מאוד מומלץ\n\nשעורי הבית: חלקם ארוכים מאוד, ולפעמים על גבול הבלתי אפשריים, אבל אפשר ללכת לשעות קבלה ויפתרו אותם בשבילכם בעקרון\n\nהמבחן: מאוד מאוד ארוך, שאלה אחת נאלצתי לנחש כי לא היה זמן\n\nהשורה התחתונה: קורס קשה אבל חובה וגם חשוב להמשך", "timestamp": 1690729094387}, {"author": "fvre", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: לא כעל כך מובן\nשם המתרגל/ת: עליזה מלק\nחוות דעת - תרגולים: \nעליזה מקסימה \nשעורי הבית: \nבסדר\nהמבחן: \nקשה\nהשורה התחתונה:", "timestamp": 1692121674184}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ד\"ר סאלח\nחוות דעת - הרצאות: פתחי פשוט מרצה מדהים. הוא תמיד מרצה באופן \"קצר וקולע\" ותמיד נותן דוגמאות. הוא קצת מונוטוני ומשעמם אבל הוא מאוד נחמד ואכפת לו מהסטודנטים.\n\nשם המתרגל/ת: ד\"ר עליזה\nחוות דעת - תרגולים: עליזה מדהימה אותי כל פעם מחדש, מקצוענית אמיתי במקצוע ומצחיקה מאוד, רואים שאכפת לה מהסטודנטים.\n\nשעורי הבית: ממחוזרים ומרופרנסים. בהתחלה הם ארוכים ומעצבנים ואחר כך הם נהיים נחמדים יותר\n\nהמבחן: רמה בינונית, אבל כל המבחנים של פתחי ברמה בינונית והוגנת. 80% מהמבחן הוא על החומר של ע\"ע ולכסון אז כדאי להיות חזקים בחומר הזה.\n\nהשורה התחתונה: קורס מאוד יפה ומאוד נחמד, לדעתי הוא הכי קל בסמסטר (עבור אלה שלומדים מדמ\"ח) אבל חשוב לתרגל אותו הרבה כי זה עדיין דורש חשיבה", "timestamp": 1692524342611}, {"author": "אביחי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ד\"ר סאלח פתחי\nחוות דעת - הרצאות: מרצה רהוט וברור, מסביר את החומר בצורה טובה עם הרבה דוגמאות, סבלני ועונה על שאלות.\n\nשם המתרגל/ת: ד\"ר עליזה מלק\nחוות דעת - תרגולים: מצויין ! \n\nשעורי הבית:\n\nהמבחן: לא קל אבל הוגן\n\nהשורה התחתונה:", "timestamp": 1705436181808}, {"author": "אביב", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אירנה ואז צילג מוקלט\nחוות דעת - הרצאות: התחלתי עם אירנה ואיבדתי אותה בשבוע הרביעי בערך, ומאז עברתי למוקלטות של צילג ומאוד התחברתי.\n\nשם המתרגל/ת: אפרת אבירם ואורן ירושלמי\nחוות דעת - תרגולים: שניהם מעולים. אפרת קצת טסה בחומר יותר מידי לפעמים אבל מתרגלת טובה.\n\nשעורי הבית: יש הרבה עומס.\n\nהמבחן: \n\nהשורה התחתונה: פחות התחברתי לקורס. המרצים לא מספיק טובים אבל יש מתרגלים טובים.", "timestamp": 1713190535175}, {"author": "סטודנט שנה א", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אירנה. \nחוות דעת - הרצאות: \nאני אישית לא התחברתי בכלל , רצה על החומר בצורה מאוד יבשה ולטעמי משעממת . \nצילג במוקלט הציל אותי .\n\nשם המתרגל/ת: גלית.\n\nחוות דעת - תרגולים: \nמתרגלת מאוד טובה , נותנת הרבה טיפים איך לגשת לשאלות ומראה טעויות נפוצות . מומלצת !\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713539102014}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nאחלה מרצה, אבל הוא היה היחיד בשעות נורמליות אז היה כזה מפוצץ בהרצאות שלו \nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמתרגלת מדהימה. סופר נחמדה, מסבירה מעולה, נותנת אינטואיציות וטיפים וטריקים וטעויות נפוצות   \nשעורי הבית: קשים וארוכים. הww מזעזע \nהגיליון יותר סימפטי אבל גם לפעמים נותנים שאלות ארוכות\n\nהמבחן: החלק הפתוח היה בדיחה, האמריקאיות היו קשות ממש. הקורס חייב להוריד אותן כי זה באמת לא הגיוני שטעות אחת קטנה ויורד לך 10 נקודות \n\nהשורה התחתונה: הקורס עמוס אבל יותר סימפטי מאינפי והצוות גם ממש נחמד", "timestamp": 1714479101969}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה מדהים. מסביר את החומר מעולה ויש לו המון סבלנות לשאלות של הסטודנטים. בנוסף הוא בן אדם ממש מצחיק, כיף להגיע להרצאות שלו. אם לא תוקעים אותו בשעות נוראיות כמו שהיה הסמסטר אז ממש מומלץ.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת תותחית. סופר עניינית ויודעת לבחור תרגילים בצורה מעולה שמכסה כמה שיותר מהחומר. מעודדת את הסטודנטים לפתור יחד איתה את התרגילים ולא פותרת אותם עם עצמה. היה עמוס אצלה בטירוף וזה היה קצת מבאס, אבל אם לא מגיעים ברגע האחרון אפשר לתפוס מקום טוב.\n\nשעורי הבית: הגליונות סבירים, אותם גליונות כבר מיליון שנה אז יש רפרנסים להכל, שווה לנסות לבד אבל לא צריך לשרוף על זה שעות, אם לא מצליחים להעזר ברפרנסים. הוובוורק מייגעים בטירוף, חישובים מאוד ארוכים ומסורבלים ולעתים קרובות גם מאוד רפטטיבים. לעשות כמה שנדרש בשביל הבונוס ולא לטרוח מעבר.\n\nהמבחן: השאלות הפתוחות היו יחסית קלות לעומת מבחני עבר, אבל מאוד ארוכות. הן שרפו מלא זמן מהמבחן. השאלות הסגורות היו די קשות, וגם הן היו חצי מהנקודות במבחן בלי חלוקה להרבה סעיפים, כל טעות בהן עלתה יותר מדי נקודות, לא ממש הוגן בשביל שאלות שאי אפשר לקבל בהן ניקוד חלקי.\n\nהשורה התחתונה: יש בקורס הרבה יותר מדי משפטים לזכור, לא ברור לי איך מצפים מסטודנטים לזכור את כל זה בעל פה. בנוסף התוכן של הקורס קצת משעמם, לא הצלחתי למצוא בו יותר מדי עניין ביחס לקורסים מתמטיים אחרים. אבל הוא שווה מלא נקז אז כדאי כן להשקיע.", "timestamp": 1714513492490}, {"author": "-", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמהר מאוד בסמסטר הבנתי שאני לא הולכת ללכת להרצאות המפוצצות של ניר (שמו אותו בחלון זמן שלא היה בו אף תרגול \\ הרצאה אחרת בשעות טובות והוא גם המרצה האחראי) והשעות של יוסי היו פשוט מזעזעות.\nאירנה הייתה קצת ברירת מחדל בעיניי, אהבתי אותה בקייטנת מתמטיקה אבל באלגברה איבדתי אותה בערך באמצע הסמסטר, וגם באלגברה בניגוד לאינפי לא צריך לדעת להוכיח משפטים אז מרגיש לי שההרצאות פחות קריטיות, התרגולים יותר סידרו לי את החומר.\nהרשימות שלה עוזרות, ומה שלא הבנתי אחרי ההרצאה והפריע לי לפתור תרגילים, ראיתי בסרטונים של עליזה מלק.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nאפרת מושלמת, 10\\10, התרגולים סידרו לי את כל החומר שלא הבנתי בהרצאות, והטיפים שלה ממש עזרו לי במבחן\nהייתה בקבוצה במקביל להרצאה של צנזור אז לא היה מפוצץ מידי.\nבקורס הזה לדעתי התרגול יותר חשוב מההרצאה\nשעורי הבית: \n7 מתוך 11 גיליונות פתוחים חובה\n7 מתוך 11 וובוורק חובה\nכדאי להשקיע ולעשות לבד, אבל למה שלא מצליחים יש רפרנסים כי הכל ממוחזר\nהמבחן: \nמבחן שונה משנים קודמות, יותר שאלות סגורות, והשאלות הפתוחות היו ארוכות להחריד, אבל לא היה איזה טריק מונפץ שהיה צריך כדי לפתור, היה סה\"כ הוגן אבל קשה וחופר.\n\nהשורה התחתונה: \nקורס קשה וכבד של סמסטר א, תמיד אומרים שאינפי הכי קשה (וזה נכון) אבל אלגברה רק טיפה יותר קל\nצריך להשקיע ולתת עבודה אבל זה ממש אפשרי", "timestamp": 1714581521615}, {"author": "Ofek Y", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: לא כלכך מובן, למדתי מצילג ביוטיוב\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: אין מה לומר, הרמה שלה מאוד גבוהה \n\nשעורי הבית: שיעורי בית סבירים, קצת עמוס אבל בסדר\n\nהמבחן: המבחן היה קצת שונה ממבחנים קודמים בגלל המלחמה אבל היה הוגן\n\nהשורה התחתונה:", "timestamp": 1714906785693}, {"author": "ע\"ע 0", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נב\"ד (ניר בן דויד)\nחוות דעת - הרצאות: \nהו, ברוכים הבאים למגילה שלי. אנא, התרווחו, זה יקח דקה. \nכסטודנט שנה א' ממוצע חשבתי שללכת להרצאות של המרצה האחראי זה הדבר הנכון ושוב, האחראי וכמובן, הממוצע לעשות. בשבועות הראשונים לא היה אפילו מקום אחד פנוי לשבת בו אם הייתם מגיעים שעה וחצי לפני הזמן ועוד בדיוויס!!!!! (מי לעזאזל שם הרצאות בדיוויס). \nדי מהר הבנתי שאם אתה לא יושב שורה 1-4 בהרצאות של ניר אתה שומע רק 60% מההרצאה כי את ה40% האחרים הוא ממלמל והם ה40% הכי חשובים בקורס. \nמאוד קל לאבד את ניר, הוא מדבר מהר, לא עקבי בסימונים, מדבר חלש ואז לפתע מתחיל לצעוק. אישית, נרדמתי לא פעם ולא פעמיים. וברגע שאתה מאבד אותו כנראה שהלכה לך ההרצאה, כי מאוד קשה למצוא אותו מחדש. \nחוץ מזה, אין סיכוי שמישהו אי פעם ניגש אליו לשאול אותו שאלה על מה שהוא עשה בהרצאה- זה פשוט מפחיד מדי. הוא מתעצבן ואפילו קצת גורם לך להרגיש רע שלא הבנת. משפט מפתח אצלו זה: \"מה זה? זה ברכה\", מי שמבין מבין. \nהונסטלי, אם יש מרצה אחר, ממליץ לעבור אליו כמה שיותר מהר כדי שלא תאבדו את אלגברה לגמרי, זה יכול להיות קורס ממש ממש קל ועם ציון ממש ממש טוב בשבילכם. זה לא שווה את זה שהוא מרצה אחראי. \nלקראת סוף הקורס גם צברנו פער שלילי על שאר ההרצאות שבאורך פלא זה השפיע עלינו ולא עליהם למרות שניר מרצה אחראי. \n\nשם המתרגל/ת: אפרת \nחוות דעת - תרגולים: \nאפרת הצילה לי את אלגברה. אבל בבקשה מכם, תרשמו באתר לתרגולים שלה, אחרת בשלושה שבועות הראשונים יעשו סינון וחבל שתפסידו תרגול. זה סופר סופר סופר חשוב להיות רשומים אליה. \nאזהרה: היא קופצת, היא מהירה, אבל אל תאבדו ריכוז. \nאין עליה, היא פשוט מתרגלת תותחית שגם ממש עושה שאלות רלוונטיות לשיעורי הבית . אפרת אם את רואה את זה: תודה. \n\nשעורי הבית: \nוובוורקים וגיליונות- לוקחים זמן אבל דומים לתרגולים, אין לי מה להרחיב.\n\nהמבחן: \nלא כל כך קשה, יותר ארוך. חלוקת נקודות לא פרופורצאונלית לשאלות סגורות. אין סיכוי וזה לא לגיטימי ששאלה שבודקים בה רק תשובה סופית תהיה 10 נקודות. ויותר מזה, שיהיו 5 סעיפים כאלה. חמור מאוד.\n\nהשורה התחתונה:", "timestamp": 1715189880627}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר והקלטות צילג\nחוות דעת - הרצאות: בשליש הראשון של הסמסטר היתי אצל ניר, היה די קשה להבין ולהתרכז. הכיתות צפופות מאוד ואם לא יושבים קרוב לא שומעים אותו. הוא חצי צועק וחצי מדבר בשקט ולא נורא מסודר. \nההקלטות של צילג מעולות, מסביר טוב ובפשטות ומוכיח הכל!\n\nבנוסף מאוד מומלץ סדרת הסרטונים של 3b1b ביוטיוב על אלגברה - ככה בסוף אשכרה מבינים על מה הקורס הזה בכלל...\n\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת פצצה. קצת רצה אבל משאירה את כולם עירניים. היא מראה מלא דוגמאות טובות.\n\nשעורי הבית: מאוד חשוב לעשות, דומים למבחן ולצורת חשיבה. מומלץ מאוד לא לרפרנס.\n\nהמבחן: קשוח. מבנה המבחן עצמו די מעצבן אבל השאלות סבירות.\n\nהשורה התחתונה: קורס מעניין - כשמבינים למה הנושאים שלומדים בו קשורים אחד לשני בכלל.", "timestamp": 1715332905221}, {"author": "moriah zini", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מוקלט\nחוות דעת - הרצאות: עברתי בכל המרצים ולא התחברתי לאף אחד, בסוף ראיתי צילג מוקלט וחלק מעליזה מלק (לא הכל כי ארוך מידי) + בעזרת גלית המלכה לא הרגשתי פספוס גם אם עוד לא הספקתי לראות את ההרצאה המתאימה בזמן התרגול.\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: מושלמת. מובן, שולטת לגמריייי על החומר, ויודעת להתעכב בדיוק על הדברים הנכונים. אין יותר טוב ממנה\n\nשעורי הבית: סביר, דורש זמן אבל שווה את זה בשביל ההבנה.\n\nהמבחן: קצת קשה אבל הוגן בסה\"כ\n\nהשורה התחתונה: קצת קשה, במיוחד לזכור את כמות המשפטים המטורפת, אבל לא מזעזע יותר מידי", "timestamp": 1715603095514}, {"author": "..", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: אם יוצא לכם ללמוד אצל יוסי אז לא לפספס. מבינים אצלו מעולה ועדיין יש אווירה טובה וצחוקים\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: די רץ על החומר אבל מבינים אותו\n\nשעורי הבית: ארוכים, אבל כדאי להשתפשף בחומר כי עוברים מהר מנושא לנושא\n\nהמבחן: קשוח\n\nהשורה התחתונה: קורס חובה", "timestamp": 1715951156636}, {"author": "אחד שיודע", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: אני מאוד התחברתי לסגנון ההרצאה של ניר, הוא מעט מפוזר ואבסטרקטי, אך מאוד נהניתי מההרצאות שלו ונהניתי מהן מאוד, לטעמי מעביר את החומר בצורה מעניינת. ממליץ על ניר כמרצה אך הוא לא בשביל כל אחד.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: אפרת פשוט מתרגלת מעולה ! מסבירה הכל בנועם, מספיקה הרבה מהחומר, הכל רהוט וברור. אין לי מה להוסיף.\n\nשעורי הבית: הוגנים, קצת עמוסים מבחינת כמות אבל תרגילים שהולמים לרמת המבחנים והתרגילים בתרגולים.\n\nהמבחן: יחסית קשה, המבחן בנוי בצורה כזו שניתן לאבד הרבה נקודות ומהר, עם שתי שאלות אמריקאיות ושאלה סגורה בה מתייחסים רק לתשובות סופיות, השאלות הפתוחות היו הוגנות סה\"כ.\n\nהשורה התחתונה: קורס מעניין ומאוד חשוב לתחום מדעי המחשב, ממליץ להשקיע בו במהלך הסמסטר, ניתן להצליח.", "timestamp": 1716305637028}, {"author": "יהיה טוב", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אירנה גורליק \nחוות דעת - הרצאות: אירנה מעולה אבל מהירההה. כמעט כל הסמסטר התרגולים היו בדיליי של שבוע וחצי אחריה. טיפ - אם אתם הולכים אליה, אל תטרחי להעתיק, תפתחו את הסיכומי הרצאות שלה במקום. היא כותבת אחד לאחד מה שכתוב שם. חוץ מזה - מסבירה מעולה, אכפתית ועונה על שאלות, ונחמדה ממש.\n\nשם המתרגל/ת: גלית מזרחי\nחוות דעת - תרגולים: אלופה! לפעמים הייתי יוצא מבולבל ממש מההרצאות אבל גלית מביאה תרגילים פצצתיים שעוזרים להבין את החומר בצורה טובה. לפחות מספיק טובה בשביל להצליח את רוב שיעורי הבית.\n\nשעורי הבית: קשים, מעצבנים, מפרכים, אבל אפשריים. לא מצליחים? אל תשברו את הראש, לכו לשעות קבלה. במתמטיקה, כמו במתמטיקה, יש שם לפעמים טריקים שקשה לראות לבד. אבל בשום פנים ואופן אל תוותרו על השיעורי בית, הם המפתח להצלחה בקורס. \n\nהמבחן: די הוגן, אבל כמו בכל המבחנים של ניר, יש קצת בולשיט. אם הוא מרצה אחראי, תתרגלו הרבה מבחנים שלו (סמסטרי חורף האחרונים בעיקר) ותצליחו.\n\nהשורה התחתונה: קורס לא קל בכלל, הרבה מושגים חדשים כל שבוע, וצריך להתרגל אליהם מאוד מהר. אבל אם תשקיעו בקורס, תצליחו.", "timestamp": 1716465060203}, {"author": "Yuval", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דוד צילג - הקלטות\nחוות דעת - הרצאות: הפרונטליות שהייתי בהן היו מפוצצות / לא טובות, ויש מוקלט גם של צילג וגם של עליזה, מכסה את החומר מושלם ולי היה יותר נוח.\n\nשם המתרגל/ת: גלית מוקלט / אפרת\nחוות דעת - תרגולים: שתיהן מצוינות.\n\nשעורי הבית: גיליון בשבוע - בינוניים. בדרך כלל רוב הגיליון לא קשה אבל לעיתים קרובות הם יחסית מאוד ארוכים ולוקחים זמן.\n\nהמבחן: בגדול אפשר יחסית מהחומר לצפות מה בערך יהיה במבחן אבל המבחנים מרגישים קצת רנדומליים.\n\nהשורה התחתונה:", "timestamp": 1716485640521}, {"author": "אין", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  ניר בן דוד\nחוות דעת - הרצאות: ניר אחלה בן אדם, אבל מבחינת הוראה הוא על הפנים, לא משנה כמה תנסה להתרכז, אתה תאבד אותו אחרי כמה דקות, ממליץ לצפות בקורס של עליזה ביוטיוב, מכסה את כל החומר\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים:  מתרגלת מספר אחת \n\nשעורי הבית: לא קלים אך לא קשים כל כך, ניתן לרפרנס בקלות\n\nהמבחן: קשה ביותר\n\nהשורה התחתונה: קורס לא קל, דורש השקעה", "timestamp": 1716503483678}, {"author": "פסגותניק אלמוני", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ניר בן דוד, דוד צילג מוקלט \n\nחוות דעת - הרצאות: \nניר לטעמי מאוד חכם אבל לא מעביר את החומר בצורה טובה, עברתי לצילג מוקלט במהלך הסמסטר והיה יותר טוב\n\nשם המתרגל/ת: בר תבור\n\nחוות דעת - תרגולים: \nאחלה, כיתה קטנה, פתוח לשאלות\n\nשעורי הבית: קשים לעומת מה שנלמד\n\nהמבחן: שלא נדע\n\nהשורה התחתונה: קורס מאוד מבולגן, סגל לא סגור על עצמו, מבחן ברמה שונה לגמרי מהנלמד", "timestamp": 1716883929219}, {"author": "פסגותניק אלמוני", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מרצה טובה מאד, מסבירה מעולה. כן מלמדת מאד מהר ככה שטיפה יכול קשה לעקוב\n\nשם המתרגל/ת: גלית\nחוות דעת - תרגולים: מתרגלת מאד טובה, מסבירה הכל ותמיד עונה על שאלות. גם כן מאד מהירה.\n\n\nשעורי הבית: בסדר יחסית. לוקח קצת זמן.\n\nהמבחן: מועד א היה סיוט, מועד ב היה נחמד יחסית\n\nהשורה התחתונה: קורס די קשה, הרבה יותר מאינפי לדעתי.\nרוב הקושי נובע מכך שפשוט לומדים המון מוסגים ולא מקשרים אותם לכלום, ורק בסוף הקורס מבינים את התמונה הכללית של החומר, ומבינים כמו שצריך על מה דיברו. אז אל תוותרו לגמרי אם לא הבנתם, כי האסימון ייפול בסוך, מצד שני גם חשוב מאד להיות על החומר.", "timestamp": 1717013736492}, {"author": "סטונדט לנתונים", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ניר בן דוד + הקלטות עליזה\nחוות דעת - הרצאות: קשה איתו. בהתחלה הוא עושה רושם טוב כי הוא מצחיק אבל קשה לעקוב אחריו והוא לא מסביר טוב את החומר. הייתי ממליץ ללכת למרצים אחרים אבל בדרך כלל אין אלטרנטיבות טובות. הרבה פעמים השלמתי בעזרת הקורס המוקלט של עליזה מלק המלכה, פשוט החומר לא בדיוק תואם אחד לאחד אז הייתי רק נעזר בזה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: המתרגלת הכי טובה בפער, ובהתאם הביקוש אליה בהרצאות. באמצע הסמסטר התחילו לבדוק שמות בכניסה לתרגולים שלה ולהכניס רק תלמידים שהיו רשומים אליה מרוב שהיה עמוס, לכן ממליץ לוודא שאתם רשומים לשיעור שלה ספציפית כשאתם נרשמים לסמסטר. אכפתית, מצחיקה, ומפשטת ומסבירה את החמור מעולה.\n\nשעורי הבית: קשים, אבל לא בודקים אותם באמת, רק הגיש/לא הגיש אז לא הייתי מתאבד עליהם, אבל חשוב לנסות לעשות אותם.\n\nהמבחן: היה די קשה, עם שאלות שלא הוסברו טוב. מנגד היו הרבה הטבות למילואים בעקבות המלחמה שעזרו, כמו דף נוסחאות והטוב בין השניים על 2 השאלות האמריקאיות שהיו. בנוסף היה פקטור של 3 נקודות.\n\nהשורה התחתונה: קורס קשה אבל חובה, הרבה דברים שלא ברורים במהלך הקורס מתחברים בסוף. ממליץ גם לראות את הפלייליסט של 3blue1brown על אלגברה לינארית לקראת המבחן, קצת עושה סדר ונותן אינטואיציה טובה יותר.", "timestamp": 1717049565817}, {"author": "לא צריךךך", "difficultyRank": 3, "generalRank": 3, "semester": "202302", "text": "שם המרצה: ניר בן דויד\nחוות דעת - הרצאות: להתרחק מניר.לא מובן בכלל . מדבר מהר בקיצור בלגן.לימדתי מצילג ביוטיוב(הציל לי את הקורס). עדיף מלהתחיל עם צילג מאשר ללכת להרצאות\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אין על אפרת . הכי טוב\nשעורי הבית: כדאי לעשות.ברמה טובה\n\nהמבחן: ניר עשה לנו מבחן רק הוא יכול לפתור.משהו באמת מכשיל.\n\nהשורה התחתונה:קורס חובה חייבים להשקיע", "timestamp": 1717335484080}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: הוא מרצה סבבה, אבל טיפה מעייף וגם היו אצלו מפוצץ. ההרצאות לא מאוד חשובות בתכלס \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מדהימה! הצילה לי את הקורס. ההסברים בתחילת התרגול מכסים על 90% מהחומר של ההרצאות, יש לה כמויות של שאלות ממבחנים לפי נושאים שהיא פותרת בסוף השיעור, היא מסבירה מצוין, נותנת טיפים מעולים,  דגשים, טעויות נפוצות, ובעיקר הכיתה שלה ממש לא מפוצצת. מומלצת בחום  \n\nשעורי הבית: ww ארוכים ומיותרים מעבר למגן,  גיליונות חשוב לעשות ולי אישית לא היה מאוד קשה (כנראה בגלל הילה)\n\nהמבחן: מועד א מזעזע עם שאלה אמריקאית עם שתי תשובות נכונות, מועד ב ברמה סבירה ואפשר להוציא ציון ממש טוב\n\nהשורה התחתונה: חוץ מהמועד א, אני נהנתי ממש, יותר מאינפי", "timestamp": 1718032688426}]}