{"posts": [{"author": "s", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: \nמרצה בסדר, אצילנו האופציות האחרות לא היו הכי וואו נאלצנו לבחור בו. יש לו רשימות מסודרות אבל הוא מאוד אוהב להוכיח כל דבר והוא לא תמיד מסביר הכי מובן\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: \nכל תרגול מסתיים ב20 דק איחור, אבל מסביר טוב את החומר ונותן אינטואיציה \nשעורי הבית: \nסבירים\nהמבחן: \nעוד לא היה נקווה לטוב\nהשורה התחתונה: קורס סביר סהכ", "timestamp": 1714044719136}, {"author": "0", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ד\"ר דניאל רבייב\nחוות דעת - הרצאות: \nסבבה. דניאל מסביר בסדר עונה על שאלות בצורה יפה וסבלנית. יש לפעמים הרבה הוכחות ולעיתים גם ארוכות, לא צריך את זה למבחן (לפחות למבחן שלנו).\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nרבקה מעולה! ממליצה בחום. רבקה מספיקה לעשות המון תרגילים בשעת תרגול אחת, תרגילים רלוונטיים מאוד לשיעורי בית ולמבחן. היא די זריזה אז לא מתאימה לכולם.\nשעורי הבית: \nפעם בשבוע יש תרגיל או שניים עם כמה סעיפים. לפעמים התרגיל די מאתגר ממליצה ללכת לשעות קבלה. לפעמים ממש סבבה וקליל, סה\"כ כמה שעות בודדות כל שבוע.\nהמבחן: \nהמבחן שלנו היה מאוד הוגן בעייני. מבחני עבר ממליצה לתרגל מבחנים מהקורס שהיה עד 2010\nהשורה התחתונה: \nקורס סבבה עם הרבה אינטגרלים לא מפחידים. אין הרבה חומר ביחס למרוכבות ומד\"ח.", "timestamp": 1715062546720}, {"author": "איתי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אופיר דוד\nחוות דעת - הרצאות: אופיר מרצה מצוין.\n\nשם המתרגל/ת: מרינה קדוש ברם\nחוות דעת - תרגולים: בזבוז זמן. דפי התרגולים מהמודל היו מפורטים והיה אפשר לקרוא אותם במקום (בפחות זמן).\n\nשעורי הבית: הם היו פחו תאו יותר ברמה של השאלות במבחן ולכן מומלץ להכין.\n\nהמבחן: מבחן קצת טכני אבל דורש הבנה של החומר.\n\nהשורה התחתונה: קורס אחלה.", "timestamp": 1715770754375}, {"author": "0 (לא) מספר טבעי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אלון דמיטריוק ואופיר דוד\nחוות דעת - הרצאות: בחצי הראשון של הסמסטר הייתי אצל אלון, ולדעתי הוא העביר את החלק של טורי פורייה ממש טוב. כשהתחלנו התמרות הוא ממש נכנס לעומק של כל הוכחה כאילו אנחנו בחדו\"א 1 מה שהפך את ההרצאות למשעממות ומעיקות. עברתי לאופיר ואני ממליץ עליו בחום! \nההרצאות היו ממש קלילות ונעימות. אופיר מפתח אינטואיציה ממש חזקה להכל ונותן מלא דוגמאות, ופחות מתעכב על הפורמליזם המתמטי הכבד.\n\nשם המתרגל/ת: יורם יחיא \nחוות דעת - תרגולים: מעולה!! אמנם כל תרגול הסתיים 20 דקות אחרי הזמן אבל רואים שליורם ממש חשוב שנבין. \n\nשעורי הבית: גיליון כל שבוע, רק שאלה או שתיים להגשה. לוקח יחסית קצת זמן לעשות בדרך כלל, עוזר לוודא שהבנתם את החומר.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: המתמטיקה שלומדים בקורס הזה מעניינת וגם יפה לפעמים אבל בסופו של יום מדובר בקורס טכני. אם משקיעים אפשר לקבל ציון טוב.", "timestamp": 1716063255921}, {"author": "n טבעי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: רבייב מסביר טוב את החומר, נותן מלא דוגמאות תוך כדי הרשימות וכן מסודר. תיתכנה מלא שגיאות ברשימות שלו אז זהירות. \n\nשם המתרגל/ת: ריבקה\nחוות דעת - תרגולים: אין על ריבקב כתמיד. השאלות שהיא מעבירה רלוונטיות לחומר והן ברמת מבחן לרוב. מאד ממליץ.\n\nשעורי הבית: שיעורי הבית קלילים, שאלה או שתי שאלות על כל חומר והן סוג של רענון. ממליץ לעשות אותן לבד כדי לחזור על החומר. כל אחת לא לוקחת יותר מ-2 שעות.\n\nהמבחן: הוגן לגמריי. הממוצע טוב, אבל נדפקנו במועד א' בגלל שגיאה בזמן המבחן (רק בזמן המבחן ידענו ש-n טבעי יכול להיות 0), וכן תיקנו את המבחנים בצורה לא נכונה. אבל סך הכל הוגן מאד מבחינת קושי.\n\nהשורה התחתונה: קורס קליל שחבל לא להוציא בו 90+. לעבור על כמות מכובדת של מבחנים לפני הבחינה ואתם מסודרים. בהצלחה!", "timestamp": 1716192263486}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אופיר דוד\nחוות דעת - הרצאות: \nבא מוכן לכל הרצאה, מאורגן, יודע להסביר ויודע לתת את האינטואיציה המתמטית. ניכר שחשוב לו שנדע את החומר ולא רק שנדע לפתור תרגילים. מומלץ!\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nיוצא לה להתקע על תרגיל באמצע התרגול פעם ב, אבל חוץ מזה היא מסבירה טוב ובקצב טוב.\nשעורי הבית: \nקלים.\nהמבחן: \nמאוד קל, אבל היו לנו הרבה בעיות בבדיקה עם נימוקים (נקודות שירדו על שימוש לבדף נוסחאות) וכדומה.\nהשורה התחתונה: \nקורס באינטגרציה בחלקים. מאוד קל.", "timestamp": 1716200182418}, {"author": "לניה", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: ראיתי הקלטות שלו. היה ברור מאוד\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: \nמבולגן אבל ניראה שהוא ממש מנסה לכוון אותך בכיוון הנכון.\nשעורי הבית: סבירים, עוזרים להבנה הפרקטית של החומר.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס ראוי לשמו. חבל שלא הכניסו גם התמרת Z, הבנתי שזה חשוב.", "timestamp": 1716363301047}, {"author": "ֶ;", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אופיר דוד \nחוות דעת - הרצאות: \nמרגיש קצת כמו תרגול, משתף מלא את הסטודנטים ולכן יכול להרגיש מעט מבולבל ומבולגן, איש טוב אבל. \n\nשם המתרגל/ת: מרינה שם אחד (גרוז נראה לי)\nחוות דעת - תרגולים: \nעושה מלא טעויות חישוב, כותבת קטן ורצה על החומר. אם אתם בסדר עם זה אז היא מעולה ועדיפה על האחרים. \n\nהרשימות פה גם די מפורטות אבל לפעמים יש כל מיני קפיצות של לכו תבינו מה היה \n\nשעורי הבית: \nקצת מרגישים לא קשורים, מאוד טכניים חוץ מגיליון אחד שהחליטו להביא תאוריה גם\n\nהמבחן: \nחוץ משאלה אחת הוא היה קל מאוד\n\nהשורה התחתונה: \nלא מבינה למה זה קורס בפני עצמו, אין בו הרבה תוכן ובקלות משלימים הכל בכמה ימים בודדים", "timestamp": 1716453340236}, {"author": "!!", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב \nחוות דעת - הרצאות: \nואוו וואוווו איזה עצבים, הסגל הכי מנתוק ובזיוני שיש!  ההתנהלות סביב המבחן והערעורים פשוט מבזה! בבירור הייתה שאלה אמריקאית בעייתית והם לא טרחו לעשות עם זה כלום, בבירור הם שלחו מייל שאם מערערים על שאלה אמרקאית לא ייבדק החלק הפתוח אבל כמובן שהם הורידו נקודות גם על החלק הפתוח, פשוט בזיוני. שלא נדבר על זה שרבייב הוא אחד המרצים הגרועים והמשעממים שפגשתי, בקיצור תברחו!!\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716668144437}, {"author": "שניר חן", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רבייב \nחוות דעת - הרצאות: מרצה בינוני לדעתי, לפעמים נתקע על חישובים יותר מדי. מסביר בצורה סבירה  פלוס. \n\nהייתי גם אצל אלון דימטריוק - היה סבבה לגמרי וגם ענה על שאלות בצורה טובה ואיכפתית שזה קצת מפתיע מהשמועות שהיו עליו בשנים קודמות. \n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: יורם הוא דמות..הוא בחור מצחיק עם אמירות השויות לפעמים יש כאלה שמתחברים ויש שפחות אני אבל מאוד אהבתי. הוא מאוד נכנס לאינטואיציה ולמשמעות של דברים ואוהב להסביר הכל באופן ויזואלי עם גרפים, שרטוטים וכו' מה שהופך את הקורס שיחסית טכני למאוד הבנתי ומעניין. \n\nמה שכן הוא אוהב לגנוב כמה דקות בסוף כל תרגול \n\nשעורי הבית: הוגנים\n\nהמבחן: המבחן היה ממש הוגן יחסית למבחני עבר אולי בגלל המלחמה וזה שזה פיילוט. \n\nמה שכן הייתה שאלה אמריקאית עם טעות בניסוח התשובה באופן חד משמעי ולא אישרו את הערעורים על זה.. מאוד מאכזב מרבייב המרצה האחראי ומסגל הקורס. \n\nהשורה התחתונה:", "timestamp": 1716744524360}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: בעיני הוא הרצה סבבה והעביר את החומר סבבה (אני יודעת שהדעה שלי לא פופולרית אבל בגדול אני יכולה להבין שהבנתי את החומר והיה לי טיפה עניין בהרצאות) , אבל הוא המרצה האחראי הכי נבזי בעולם באמת רחמים על כל מי שלוקח קורסים של רבייב\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: בעיני הוא נותן המון אינטואיציה ומלמד דוגרי איך פותרים את התרגילים, אבל קצת חפרן אם שואלים אותו שאלה (אבל דווקא באיזשהו מקום אהבתי שהוא חפרן כי הוא נתן המון אינטואיציה ב\"חפירות\" וענה גם לא רק על מה ששאלתם אבל זה דווקא היה טוב)\n\nשעורי הבית: סבבה לגמרי \n\nהמבחן: אין לכם מה לדעת את החומר, העיקר שהצלחתם להיכנס לראש של רבייב ואז תצליחו במבחן.\n\nהשורה התחתונה: קורס סבבה ומעניין אבל רבייב הורס אותו", "timestamp": 1716969316877}, {"author": "~", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nהמרצה הכי גרוע שהיה לי בתואר בפער ענק, אני לא מבין איך הוא עדיין מקבל משרה פה, בגלל אנשים כמוהו סטודנטים לא רוצים ללמוד בטכניון. מי באמת חשב לעצמו לתת לו ללמד במוסד הטכניון, מרצה גרוע, חסר ביטחון, לא יודע ללמד ולא יודע לכתוב מבחנים וגם לא לבדוק אותם.\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nאחלה מתרגלת, הצילה לי את הקורס ובגללה קיבלתי ציון טוב בקורס. (למרות שהמבחן היה לא מוגדר היטב ורבייב עשה טעויות מהותיות בשאלות הבחינה).\nשעורי הבית: \nלא קשורות לכלום (לא לבחינה זה בטוח), תרפרנסו או משהו.\nהמבחן: \nסתם משהו לא קשור לחומר, ורבייב לא יודע לספור במספרים טבעיים (זה היה ממש מצחיק).\nהשורה התחתונה: \nאנא עארף, אל תלמדו עם רבייב, סתם מרצה גרוע.", "timestamp": 1717315471135}, {"author": "ליים בת אל", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אופיר \nחוות דעת - הרצאות: מרצה חמוד מאוד אבל לא ממוקד וזה מאוד קשה. הוא בעיקר מרצה כמו מתמטיקאי למתמטיקאים. רואים את התשוקה שלו אבל ניכר שהוא לא מרכיב את המבחן בכלל. \n\nשם המתרגל/ת: יורם יחיא \nחוות דעת - תרגולים: הוא קורע מצחוק ולא מודע לזה, מסביר בפירוט (לפעמים פירוט יתר שמוציא מפוקוס), לא כל כך ער לזמנים של התרגול (הוא רק שעה והוא מתייחס לזה כאילו הוא שעה וחצי), אבל גם שעה תרגול לא באמת מספיקה אז זה מובן. יש לו רשימות תרגול וזה עוזר בטירוף.\n\nשעורי הבית: סבירים תלוי בגיליון. לעשות אלגברה 2מ לפני זה חובה היום, אבל במקרה שלי היה יתרון משמעותי.\n\nהמבחן: את המבחן מרכיב רבייב. יש שאלות ממוחזרות, אבל יש שאלות גם קשות (שהיה עדיף שהיו פתוחות ולא אמריקאיות). הרבה התמרות וקצת טורים. \n\nהשורה התחתונה: גיליונות מתמטיים כל שבוע, אבל לא קורס שעמוס יותר מידי בחומר תיאורטי, וגם מאוד ברור מה ההבדל בין כל חלק בקורס (התמרות, טורים, לפלס, פורייה).", "timestamp": 1718532856450}]}