{"posts": [{"author": "יהי-ישר", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: \nלעומת חדוא 1מ, הקורס הזה היה בשבילי חוויה מתקנת ונטו בזכות ניר. הבן אדם אגדה וכל הרצאה שלו זה מופע סטנד אפ שעל הדרך עוזר להבין חדוא. הוא אולי מדבר חזק וצועק אבל עושה את זה מצחיק ומעניין, בלי להתעכב על שטויות. הוא גם מביא הרבה דוגמאות ברורות ורלוונטיות, ומי שיגיד אחרת סתם חמוץ.\n\nחוות דעת - תרגולים: \nהתחלתי את הסמסטר אצל איריס, ובאמת עם כמה שהיא נחמדה היא מאווווד לא מסודרת. רצה במעגלים ומדברת עם עצמה.\nרבקה הייתה המתרגלת האחראית אבל היה מפוצץ אצלה באופן קבוע, ככה שאל תבנו על למצוא אצלה מקום.\nבשלב מסויים העבירו תרגול אחר, של איילה, ועברתי אליו. איילה מתרגלת הרבה יותר טובה, אבל ממש רצה על החומר ולפעמים אתה לא מספיק להתחיל להעתיק תרגיל כשהיא כבר בתרגיל הבא, ככה שהתרגולים לא תרמו הרבה.\n\nשעורי הבית: \n5 גליונות חובה בכתב מתוך 6 ומלאאאאאא וובוורקים. יש וובוורקים ו\"פעילויות וירטואליות\" ששם ממש צריך להשתדל בשביל לא להוציא 100. שאר הוובוורקים באמת לא שווים את הזמן, הם בדרך כלל ארוכים וקשים עם מלא אינטגרלים.\nהגליונות סבירים, יותר קלים מחדוא 1\n\nהמבחן:.יהיה בהמשך, אבל אני מניח שבגלל שבכל זאת מדובר בחדוא המבחן יהיה לא קל. \n\nהשורה התחתונה: יותר סביר מחדוא 1מ, במיוחד אם ניר מלמד את זה.", "timestamp": 1688468079810}, {"author": "יעקוביאן", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מרצה מאד כרזימטי, קשה לא לעקוב אחריו ועם זאת קצת מפוזר לעיתים. מאד נוח שכל ההרצאות שלו מפורסמות במודל והוא עוקב 1:1 אחרי הקבצים של ההרצאות.\n\nשם המתרגל/ת: איריס / איילה\nחוות דעת - תרגולים: אם יש לכם אפשרות תלכו לאיילה, מתרגלת מעולה בעיני, מסבירה קצת מהר אבל עדיין מתעקשת על ההבנה שלו. איריס לעומתה הרגיש לי שפחות יש לגיטמציה לשאול שאלות, והיא מהירה ממש. \n\nשעורי הבית: גיליונות קשים, ארוכים אבל מהווים סיכום טוב לחומר.\n\nהמבחן: זוועה", "timestamp": 1689585041174}, {"author": "Rotem B", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: געגועים לאלון, נאדר יודע להסביר את החומר באופן מספיק אבל מאוד מבולגן.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מעולה, החומר מתיישב טוב\n\nשעורי הבית: סבירים, יותר קלים וטכניים מחדווא 1מ\n\nהמבחן: תלוי במרצה האחראי, המבחנים של ניר קשים לעומת השאר.\n\nהשורה התחתונה: קורס מאוד טכני וגם די מעניין.\nלגבי ההתנהלות: לא כל החומר מועבר בזמן והסגל מבולגן הרבה יותר מאשר מרבית הקורסים המתמטיים.", "timestamp": 1689605442391}, {"author": "LH4", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: למרות השעות הקשות (8:30-10:30)*2, ללמוד עם ניר זאת חתיכת חוויה. בערך כל 3 דקות יש בדיחה ששוברת אותך מצחוק וביחד עם המבטא שלו ואופן ההעברה של החומר, כל שיעור הוא חתיכת מופע. זה קורס עם ערימות של חומר וניר מפרסם רשימות לקורס לפני כל הרצאה, ככה שתמיד אפשר לקרוא שוב ולעבור על ההרצאה ובהרצאה עצמה להתעסק רק בניר וחומר. הוא מסודר מאוד ולחא עוזב את הרשימות ומרבה לתת דוגמאות ממבחני עבר שהוא בעצמו כתב, ואת אלו שהוא לא מספיק הוא נותן לחזרה הביתה ולפעמים שואל שאלות דומות להן במבחן. חדוא 2 זה קורס שונה לגמרי מחדוא 1 ולא רק בחומר, בעיקר בגלל ניר והחוויה המטורפת של לעבור את השנה איתו. יותר מזה, אומרים עליו ש\"כיף ללמוד אבל מסוכן להיבחן\", אבל במבחן הוא לא שואל על דברים שהוא חוזר עליהם לפחות 3 פעמים בהרצאה (רידוס וקטור), בסך הכל אחד המרצים הכי טובים שיש למקצוע הזה.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: אין כמו גרי, הוא באמת מתאים למי שאוהב להקשיב בתרגולים שלו כי הכל רשום באתר שלו.\n\nשעורי הבית: אחת לשבועיים גיליון בכתב, כשרוב השאלות מאוד דומות לאלו שבהרצאה / תרגול, 6 תרגילים לא קשים וברמה של המבחן. בנוסף לזה יש 7 שיעורים בווובוורק שנועדו ללמד ולחזור על חומר תיכוני ועוד 12 לש\"ב שמאוד מאוד מאוד מלמדים ועושים חזרה טובה על החומר, ממליץ לפתור כמה שיותר.\n\nהמבחן: עדיין אין ציונים, אבל ניר לא שאל על דברים שלא נגע בהם בהרצאה, לדעתי האישית די הוגן אבל בגלל כל החומר שצריך לדעת, קצת קשה ללמוד אליו ולפתור הרבה תרגילים מסוגים שונים במגלבת הזמן הקיימת. \n\nהשורה התחתונה: אחלה קורס, לא לחשוב פעמיים אם ניר מרצה, ללמוד טוב למבחן ולפתור הרבה מבחנים של המרצה האחראי משנים אחורה.", "timestamp": 1689661451220}, {"author": "Aviv", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה מאוד משעשע, הטונים בהרצאה שלו מאוד גבוהים (לא מומלץ לשבת בשורות הראשונות, תחסכו לאוזניים שלכם). בכללי מעביר את החומר בצורה ברורה אך קצת משעממת.\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: היא מאוד מעדיפה כמות על איכות. מזכירה בגישה את התרגולים של גרשון אבל הקצב אצלה הרבה יותר מהיר! אם היה לי זמן בלו\"ז ללכת למישהו אחר - היה עדיף כי הקצב מהיר מידי.\nאבל בכללי היא אחלה מתרגלת, עדיף להיצמד לסיכומי תרגול שהיא שולחת, להקשיב ולהבין את מה היא עושה.\nהיא יודעת להביא המון טיפים מצויינים למבחן מהניסיון שלה.\n\nשעורי הבית: \n\nהמבחן: ניר היה מתרגל אחראי, הוא ידוע בכך שהוא בונה מבחנים הממוקדים בהבנה ופחות בטכניקה. כתוצאה, המבחנים שלו קשים! כדאי מאוד לעשות מבחנים שהוא כתב ( הוא כתב את 2021 ו 2023 של קורס חדו\"א 2מ ואת 2016 ו 2017 של קורס חדו\"א 2). תתמקדו במבחנים שהוא כתב קודם ואז בכל שאחר מבחני העבר (כמובן שבמידה והוא המרצה האחראי אצלכם).\n\nהשורה התחתונה:", "timestamp": 1689677727842}, {"author": "Aviva Peimer", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: לי אישית סגנון הלמידה לא היה יותר מידי ברור. מה שכן, מרצה חביב ששמח לענות על כל שאלה ולעזור במידת הצורך\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל תותח, קצת קשה לעמוד בקצב \n\nשעורי הבית: נוראיים. מרוב שצריך לרפרנס לא באמת תורמים להבנה\n\nהמבחן: קשה אבל פייר\n\nהשורה התחתונה: קורס מאתגר, לא לקחת אם לא חובה. חשבונייה של גרשון מומלצת בחום לחיזוק לא רק לקראת המבחן אלא במהלך הסמסטר.", "timestamp": 1690206300338}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות:  לדעתי ההרצאות של ניר זו חוויה אחרת לחלוטין. ניר מצליח לגרום לחדו\"א להיות מעניין, גם בשעות הקשות של הבוקר. חשובה לו ההבנה מעל הכל ולכן תצפו כי המבחנים שלו יהיו שונים מהשאר. \nאם הוא המרצה האחראי, במהלך הסמסטר תלכו להרצאות שלו ותראו לאילו נקודות הוא שם דגש. הוא חוזר על כך הרבה פעמים בהרצאה ומכסח בציון על זה.\nמה כן, אם יש דבר אחד שכולם יכולים להסכים עליו בפה אחד, זה שלניר אכפת מהסביבה. אחוז לא קטן מהמבחן שלו ממוחזר ממבחנים באנליזה נומרית שהוא רשם ולכן שווה לפתור כמה מבחנים משם.\n\nשם המתרגל/ת:  גרשון אברהם\nחוות דעת - תרגולים:  גם בחדו\"א 2 גרשון אלוף. בסופו של דבר חדוא 2 הוא קורס טכני ברובו המוחלט ולכן כדאי לבחור מתרגל שיידע להסביר לכם איך לפתור את השאלות.\n\nשעורי הבית:  הוובוורקים מצוינים לתרגול עצמי. ממליץ לא לזלזל בהם מאחר והם מפתחים את היכולות הטכניות.\nהגליונות גם נחמדים, חלק מהשאלות לקוחות ממבחני עבר של חדוא 2, 2ת ואנליזה נומרית, ולכן אני ממליץ לא לזלזל גם בהם.\n\nהמבחן: לא פשוט, אבל עם השקעה אפשר לקבל ציון טוב.\n\nהשורה התחתונה:  אומנם חדו\"א 2 לא מתקרב מבחינת קושי לחדו\"א 1 מאחר וזה קורס טכני הרבה יותר, אל תזלזלו בו במהלך הסמסטר ותשימו לב לדגשים של המרצים האחראים.", "timestamp": 1690278283337}, {"author": "~~~", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: דיי מפוזר אבל מתעקש שכולם יבינו את החומר סך הכל אחלה מרצה\n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: המתרגל הכי טוב של הטכניון\n\nשעורי הבית: רק הוובוורק מעיק קצת כל השאר סביר לגמרי פשוט לשבת על התרגולים\n\nהמבחן: מבחן פייר לחלוטין וגם פינקו בפקטור סך הכל קורס סבבה אם כל הסמסטר עשיתם מה שצריך ושבוע למבחן חרשתם\n\nהשורה התחתונה:", "timestamp": 1690378612465}, {"author": "...", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה מעולה, יודע איך להשאיר את הסטודנטים קשובים, מאוד מצחיק וקשוב לסטודנטים. מה שכן, הוא מדבר ממש חזק, אז קחו בחשבון לא לשבת שורה ראשונה... חוץ מזה, מרצה מצויין! \n\nשם המתרגל/ת: איילה\nחוות דעת - תרגולים: מעולה!! מאוד נחמדה, סבלנית לשאלות גם בזמן הפסקה וגם אחרי השיעור. ממליצה ללכת אליה בחום :)\n\nשעורי הבית: סך הכול הוובורקים ממש עושים להבין את החומר, הש\"ב כתובים שועים את הסדר האחרון שצריך כדאי להבין את החומר. בסופו של דבר זה מה שעוזר להבין אז תשקיעו בשב\n\nהמבחן: ניר כותב מבחנים די קשים... המבחן של אלון נראה הוגן ליד שלו. סך הכול, מי שעבד קשה כול הסמסטר קיבל ציון לא רע, אבל המבחן של ניר מטורף.\n\nהשורה התחתונה: קורס שדורש השקעה, מי שמשקיע בסוף יבין הכי טוב", "timestamp": 1690579790649}, {"author": "Yehonatan Or-hof", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר\nחוות דעת - הרצאות: מרצה סוף הדרך ומי שאצלו כל ההרצאות מבין על מה הוא הולך לשאול במבחן. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין על גרי \n\nשעורי הבית: קשים וארוכים אבל לא כמו חדוא אחד \n\nהמבחן: מבחן קשה ומאוד אמורפי. \n\nהשורה התחתונה: אפשר להצליח רק להקפיד ללכת להרצאות של ניר", "timestamp": 1690988683615}, {"author": "פקטור", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר\n\nהמבחן: מבחן קשה\nחבל זה קורס דיי חשוב, ציונים בדרך כלל גבוהים, המבחנים של ניר לא פיירים \nחבל שיש מרצים שפשוט לא רוצים שאנשים יעברו את הקורס שלו", "timestamp": 1691424370350}, {"author": "שורת הדין", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: נאדר מרצה שאכפת לו, אבל לי אישית היה קשה לעקוב אחריו בסביבות ההרצאה העשירית. מה שכן הוא היה בהתחלה יחסית מסודר על הלוח, בהמשך קצת התבלגן לו. \n\nשם המתרגל/ת: איילה\nחוות דעת - תרגולים: התחלתי את הסמסטר אצל איריס, אבל קצת קיבלתי קרינג' מכך שהיא כל הזמן צוחקת ומדברת לעצמה (אבל היא בן אדם טוב ואחלה מתרגלת). השיא היה שבאה סטודנטית עם תינוק והרגיש לי שהיא סבתא של התינוק או משהו. בדיוק אז שהבנתי שאני הולך כמו חדוא 1 לא להבין כלום ולנחש אמריקאיות נכון במבחן, בא חבר ואמר לי שאיילה אחלה מתרגלת ועברה לתרגל על אותן שעות בדיוק. ניסינו והיא הייתה מדהימה. מביאה מלא דוגמאות רלוונטיות ומסבירה את החומר כמעט מאפס. מה שכן תכאב לכם היד, כי היא כותבת המון ומהר. בנוסף היא מאוד עוזרת בשעות קבלה גם מעבר לאותה שעה שבועית ומאוד אכפת לה.\n\nשעורי הבית: הרבה רפרנסים אבל רלוונטים, הגיליונות הכתובים ברמת מבחן.\n\nהמבחן: היה מאוד קשה, אבל לא וויתרתי לעצמי והוצאתי ציון שאני מאוד מרוצה ממנו. מה שכן הוא היה הרבה יותר קשה ממה שתירגלתי ובעיקר לא באותו סגנון.\n\nהשורה התחתונה: הקורס קשה, כנראה שאין דרך לברוח...", "timestamp": 1691434730628}, {"author": "ואי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ניר בן דוד \nחוות דעת - הרצאות: קשה לעקוב אחריו. הוא מדבר מעניין אבל מתפזר בקלות. כן חשוב להיות בהרצאות שלו אם הוא האחראי, מאוד עוזר להיכנס לראש שלו ולהבין מה מצופה ממך במבחן.\n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: דעה לא פופולרית - לא ואו.\n\nשעורי הבית: ארוכים אבל לא משהו מיוחד. \n\nהמבחן: מספיק להציץ בממוצע הסמסטר יחסית לממוצעים של חדוא 2מ. דגש חזק על משפטים והבנה ופחות חישובי (המבחנים של אלון מאוד שונים). מבחן לא קל ושחיטה של בדיקה. \n\nהשורה התחתונה: אם אתה קורא את זה אז כנראה שאין לך ברירה. שווה להציץ מי האחראי ב-2ת לעומת האחראי של הקורס הזה ואולי לקחת אותו. אם ניר אחראי צריך להיכנס לראש של ניר ולהיות סגורים על כל החומר כולל הכוכביות הקטנות ואז אפשר לעבור אפילו בציון גבוה מאוד.", "timestamp": 1691953896305}, {"author": "נעה", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ניר בן דוד \nחוות דעת - הרצאות: בחיים לא חשבתי שיהיה לי מעניין בשיעור חדו\"א, ניר העביר את החומר בצורה ממש ברורה ומסודרת.\n\nשם המתרגל/ת:  איריס שפירא \nחוות דעת - תרגולים: מעולה ומסבירה  מדהים אבל מאוד מאוד מהירה, אכפת לה מהסטודנטים מאוד ועוזר בכל דבר שצריך.\n\nשעורי הבית: לא קלים אבל גם לא מאוד נוראיים\n\nהמבחן: השאלות הפתוחות היו סבירות אבל האמריקאיות היו זוועה. \n\nהשורה התחתונה: קורס לא קל שדורש לא מעט השקעה אבל אפשרי יותר מחדוא 1. אם יש אופציה ממליצה ממש/ על איריס בעיקר!", "timestamp": 1695187271245}, {"author": "A", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה:  נאדר (ניר בן דוד מרצה אחראי)\nחוות דעת - הרצאות: יחסית בסדר, לפעמים הרגיש שהוא הולך לאיבוד בחומר.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מתרגל סבבה, רץ בחומר לא קל לעמוד בקצב. אבל מעביר את החומר בצורה טובה.\n\nשעורי הבית: לא קלים לא קשים, הגליונות די ארוכים. תנסו לא לרפרנס\n\nהמבחן: מועד א היה קשה ומועד ב היה אפילו יותר קשה. ניר אוהב טריקים וגאוס. \nהתכוננתי למבחן עם הפק\"ל של חן הררי שהציל אותי בתוך המערבולת של הכמות נושאים המטורפת של הקורס. ופתרתי כמה שיותר מבחנים. קיצר המלצה שלי פק\"ל של חן + מבחנים.\n\nהשורה התחתונה: קורס לא קל, יותר טכני מחדוא 1מ שזה נחמד. אם אתם עם ניר בהצלחה.", "timestamp": 1703676319229}, {"author": "דיברגנץ על רוטור", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: רואים שהוא שונא את החומר (והוא גם טורח לציין את זה) והוא עושה טובה שהוא בכלל מלמד. אם אתם מסוגלים להידבק למוקלטים של צנזור ממליצה בחום.\n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: איש יקר, המתרגל הכי נורמלי בסגל. לרוב לא מפוצץ אצלו והוא מסביר טוב וגם אם תסתבכו ותרצו עוד עזרה הוא תמיד ישמח לעזור.\n\nשעורי הבית: קשים, אבל אם יש משהו שאני נפלתי בו זה שלא עשיתי אותם. אל תעשו כמוני.\nהמבחן: \nאם ניר בן דוד הוא מרצה אחראי - צפוי לכם מבחן קשה מאוד וכשאני ניגשתי במועד ב 50% מהאנשים לא עברו ואפילו לא היה פקטור (עזבו שהוא לא התחשב בגלל המלחמה). ניר מחפש הבנה, ולא בהכרח טכניקה ויש לו ניסוחים הזויים לשאלות שצריך רגע לעכל. אני ממליצה לכם בחום לפתור את כל המבחנים שהוא כתב (כולל מחדווא 2) כי יש לו נטייה למחזר חלק מהשאלות. \n\nהשורה התחתונה: איחלתי לחייל בהצלחה.", "timestamp": 1703761512787}, {"author": "Tim Manor", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: נאדר מרצה מצחיק עם כוונות טובות אבל הוא לא תמיד מסביר הכי טוב, יכול להיות שזה גם נובע ממחסום שפה מסוים. על אף שבאחד על אחד הוא מעולה!\n\nשם המתרגל/ת:  רבקה אביטל\nחוות דעת - תרגולים: \nרבקה יודעת את החומר ברמה גבוהה אבל היא לא הכי מסודרת ולפעמים זה מקשה בתרגולים.\nשעורי הבית: \nהרבה שיעורי בית, הרבה מהם (בעיקר הוובוורקים) בעלי תרגילים רבים על מנת שהחומר ייקלט, אבל הגיליונות הפתוחים לפעמים יש שאלות שלא מובן איך פותרים..\nהמבחן: \nהשנה המבחן היה קשה בצורה קיצונית, הממוצע היה נמוך באזור 10-12 נקודות, וזה אחרי 5 נקודות פקטור. זה פשוט תלוי מרצה אחראי (שלנו היה ניר בן דוד שתמיד עושה מבחנים קשים)\nהשורה התחתונה: \nקורס יחסית עמוס.\nהמלצה שלי, תשקיעו יותר זמן על הבנה של העקרונות של החומר מאשר על לפתור שיעורי בית. לטעמי זה יכין אתכם יותר טוב לקראת המבחן הסופי.", "timestamp": 1704703244816}, {"author": "הצל", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: מתפזר, עושה טעויות ואז קופץ אליהן חזרה, החומר התאורטי עובר סבבה אבל הפרקטיקה ממש ממש לא. \n\nשם המתרגל/ת: שוקי\nחוות דעת - תרגולים: מעביר הכל מהר, חישובים עושה בראש וזורק על הלוח ובחור די אינטנסיבי בגדול. \nחשוב לו מאוד שתבינו אז כדאי לא להתרגש ממנ פשוט אם תעשו מה שאומר כנראה שתצליחו, אבל הוא דורש מאוד ואיש מאוד מיוחד, לא פשוט בכלל ולי בדיעבד לא ככ התאים ללמוד איתו למרות שנהנתי מאוד מסגנון הלימוד.\n\nשעורי הבית: חשוב לעשות לבד בלי רפרנסים כי זה קורס מאוד טכני, התררגול ממש חשוב.\n\nהמבחן: קשה ומאוד טכני\n\nהשורה התחתונה: לי היה כיף להבין את התאוריה אבל הקורס עצמו היה סיוט.", "timestamp": 1705307403062}]}