{"posts": [{"author": "gil blank", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המתרגל/ת: ליטבנים גלינה\nחוות דעת - תרגולים: מדברת קצת לאט ועם מבטא רוסי . כותבת מאוד ברור על הלוח", "timestamp": 1666685427876}, {"author": "מ", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר. דמיטריוק אלון\nחוות דעת - הרצאות: \nלמי שכבר יודע את החומר הוא מסביר מעולה\nשם המתרגל/ת: זלמן סמיטרי אולגה\nחוות דעת - תרגולים: \nהיא נחמדה ומסבירה די טוב\nשעורי הבית: \nקשים\nהמבחן: \nכמו השיעורים\nהשורה התחתונה: תנסו שלא ללכת לאלון", "timestamp": 1668333443330}, {"author": "hi", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות:\nמרצה טוב שיודע את החומר אבל מלמד ממש מהר \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: פצצה, הסיבה היחידה שאני עדיין בתואר ללכת אליו חובה\n\nשעורי הבית: יש הרבה אבל הרמה סבבה, ברמה של התרגול\n\n\n\nהשורה התחתונה:", "timestamp": 1673690957241}, {"author": "iGGor", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרופ. אלי אלחדף\nחוות דעת - הרצאות: מרצה מנוסה שמסביר קצת מפוזר אבל בסופו של דבר הכל מסתדר. זמין לשאלות, אם הן רלוונטיות והגיוניות. אם אלה שאלות מפגרות הוא יכול קצת להתאכזב ואפילו לפעמים להטריל במידה מסוימת, אבל סך הכל מאוד ממליץ ללכת אליו.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: מעבירה הכל בצורה מובנת ורגועה בלי לרוץ, אבל מספיקה כל מה שצריך (בערך). מאוד זמינה לשאלות וממש עוזרת לסטודנטים. ממליץ ללכת אליה כי אצל גרשון מפוצץ.\n\nשעורי הבית: לא קלים אבל פתירים. הוובוורקים יותר קשים ולא משקפים את הרמה בקורס בדרך כלל.\n\nהשורה התחתונה: קורס קשה יחסית אבל בנוי טוב. אל תיכנסו לדיכאון מהבוחן אמצע", "timestamp": 1673972631827}, {"author": "ר", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: פרופסור אליהו אלחדף\nחוות דעת - הרצאות: לי אישית מאוד קשה לעקוב אחריו ולהקשיב, אז הייתי עסוק יותר בלכתוב הכל מהלוח, אך לעיתים הכתב שלו לא ברור ונוצר בלאגן על הלוח (למשל כשהיה מוחק את הלוח היה משאיר פתאום דברים ורושם לידם - בקיצור חוסר סדר). המלצה שלי שהבנתי רק בסוף הסמסטר - לוותר על ההרצאות ולקרוא סיכומים בבית. באופן כללי אלי מרצה נחמד שמנסה לענות על שאלות הסטודנטים.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: מתרגלת מצוינת, עוזרת מאוד בשעות קבלה ויסודית. \n\nשעורי הבית: קשים מאוד ולא להכל יש רפרנסים, תמיד נאלצתי להשקיע בגיליונות שעות ארוכות וללכת לשעות קבלה. גם אחת הבודקות בודקת בצורה מוזרה - לי אישית רשמה לי שחסר משהו ללא סיבה.\n\nהמבחן: עוד לא קרה וכרגע אני בהכחשה. הבוחן היה יחסית הוגן, אך השאלות האמריקאיות במבחן ובבוחן יכולות להוריד מאוד את הציון.\n\nהשורה התחתונה: הקורס קשה מאוד, כמו כן צוות הקורס לא זמין במיילים - בין השאר המתרגלת האחראית לא ענתה לי על אימייל מלפני חודשיים והמרצה האחראי עדיין לא השיב ועבר יותר משבוע.", "timestamp": 1674755907599}, {"author": "יא", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: אי אפשר להגיד שהוא מרצה לא טוב, וגם אי אפשר להגיד שהבנתי משהו\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: מדהימה, אכפתית והשעות קבלה שלה הצילו לי את הקורס. קצת איטית אבל איך שהוא הספיקה הכל.\n\nשעורי הבית: קשים\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קשה", "timestamp": 1675093891586}, {"author": "gil blank", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: הכל מאוד מסודר משנות עבר. אלון לא ממש עונה על שאלות\n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: בחור על הכיפאק. מסביר נהדר. רץ מהר. מומלץ להוריד את התרגול שלו מראשו להגיע מוכנים לריצה.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675595549667}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nארוכות יש הרבה לכתוב למי שמתכנן על לכתוב קשה להבין את החומר אפשר לשאול אותו תמיד שאלות בסה״כ בסדר\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמתרגלת טובה בזכותה הבנתי איך לפתור דברים קצת מהירה אבל מתרגלים.\nשעורי הבית: \nלפעמים הם ארוכים ממש אבל עוזרים מאוד להבנת החומר ודרך כתיבת התשובות כן רצוי לפתור את כולם כי הם ממש מסכמים את החומר.\nהמבחן: \nקשה אבל הוגן מי שלומד אליו ממש טוב יכול לעבור ורצוי מאוד לא לחזור על הקורס כי הוא בדרך כלל מהווה קדם לשאר הקורסים הנלמדים בהמשך\nהשורה התחתונה: קורס קשה בלי ספק אבל הוא קדם לכן חייב לעשות אם יש לכם אפשרות בחירה אל תבחרו בו והכי חשוב תשקיעו בלקרוא את החומר אחרי ההרצאה ולראות אם אתם באמת מבינים מה נלמד שיהיה בהצלחה!", "timestamp": 1675614796150}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: אלון יכול להיות מאוד מאיים בהתחלה, אבל עם הזמן מתרגלים אליו. לפעמים לא מסביר בצורה הכי ברורה אבל בגלל שכבר המון שנים כותב את המבחנים כדאי להכיר את הדוגמאות שלו.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: כל התרגולים שלו היו מפוצצים. מסביר את החומר בפשטות ועניין\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס קצת קשוח אבל לא משהו שאי אפשר להוציא ציון גבוה אם לומדים בצורה נכונה", "timestamp": 1675854444320}, {"author": "להלה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: ממליץ ללכת להרצאות הראשונות לראות איך אלון אוהב לנסח משפטים והוכחות (אחרי ההרצאה הרביעית מבינים) אבל מעבר לזה, צנזור חדוא 1ת ביוטיוב סוגר את כל הקורס והרבה מעבר.\n\nשם המתרגל/ת: גרשון והילה מעיין\nחוות דעת - תרגולים: \nזיגזתי בין התרגולים, חייב להגיד שניהם אחלה, גרשון רץ אבל בן אדם סופר נעים שתמיד מוכן לענות על כל שאלה לא משנה מתי זה. הילה מתרגל אחלה פשוט בחורה לא כלכך נחמדה, נותנת הרגשה לפעמים שהיא עושה טובה שעונה על שאלה בהפסקה ולא מאפשרת לשאול לשאלות על השיעורי בית. בגדול גרשון עדיף. בכל מקרה רוב התרגול וההבנה היא בבית\nשעורי הבית: \nגיליונות בכתב וגליונות וובורק, בסך הכל בסדר ומאפשרים לתרגל את החומר ולהבין אותו, ממליץ לא לרפרנס אלא אם חייבים אחרת באמת פשוט לא תבינו נושאים שלמים כמו שצריך.\nהמבחן: \nאצלנו הרגיש הוגן, כשאני אומר הוגן אני מתכוון באותה מתכונת של שנים קודמות,. המבחן קשה אבל אם פותרים מספיק מבחני עבר של אלון, לומדים להכיר איך הוא מתייחס לכל נושא ואפשר להצליח.\nהשורה התחתונה: קורס עמוס שמרגיש שתופס את הנפח העיקרי בסמסטר א'.", "timestamp": 1676019185118}, {"author": "*", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלי אלחדף\nחוות דעת - הרצאות: \nהמרצה הכי טוב שיש, וזה לא נרשם מרקורד של סמסטר אחד. זהו קורס חוזר שלי ולדעתי אם הייתי לומדת איתו מלכתחילה המצב שלי היה אחר לחלוטין. מסביר ה-כ-ל לעומק, כל ההוכחות שלו ברורות (לא הכי מסודר בלוח, אבל אני התרגלתי וברגע שאתה מרגיש שאתה מבין הכל לעניין הזה יש הרבה פחות חשיבות), מדגים, לא מחפף בשום דבר, לא מטיס את החומר אלא כל דבר בקצב הנכון שלו, ובשבילי הכי חשוב- עונה על שאלות ברצינות ועם המון רצון טוב. וכל זה לא גורע מקצב למידה שהוא בול לסמסטר. אפילו שעות הקבלה שלו מבחינתי היו הכי ענייניות ותורמות, בקיצור הוא מספר אחת! אם רוצים להגיע לרמת הבנה עמוקה, והשינוי אצלי היה ממש מ0 למאה - אני ממליצה לכל מי שיש לו את ההזדמנות ללמוד ממנו.\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: גרשון מתרגל מעולה! מסודר מאוד, בהתכוננות למבחן נעזרתי המון ב*צילומים* מהלוח, רושם כמו מחברת. מכסה את כל החומר ומביא המון היגיון לתרגילים. בעיניי השילוב של שניהם זה שילוב מנצח.\n\nשעורי הבית: רמת עומס בינונית-קשה. הסמסטר הם היו יותר עמוסים, אבל פתירים וחשובים.\n\nהמבחן: מקווה לראות ציון טוב בסוף, אבל בזכות שני אלה באמת ניגשתי עם ביטחון. האמריקאיות לא פשוטות. לא למדתי עם אלון, אבל הוא מרצה מאוד הוגן וזה משתקף במבחן. מצד אחד אין הפתעות, מצד שני רמה גבוהה של מבחן.\n\nהשורה התחתונה: זהו קורס חובה אז כך או כך תעשו אותו, אם יש את האפשרות ללמוד", "timestamp": 1676032367864}, {"author": "אורי בלוגולובסקי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אליהו אלחדף\nחוות דעת - הרצאות: מצויין, הוא מסביר טוב ותמיד עונה על שאלות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: תרגולים הכי טובים שהיתי. מאוד ממוקד ומאוד פרקטי איך לפתור שאלות\n\nשעורי הבית: כדאי מאוד להשקיע כדי להבין\n\nהמבחן: הוגן, לא קל אבל הוגן\n\nהשורה התחתונה:", "timestamp": 1676220912407}, {"author": "אביעד בר שי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרופ' אליהו אלחדף\nחוות דעת - הרצאות: מרצה מדהים. נותן מעצמו המון מעבר למצופה כדי שסטודנטים יבינו את החומר. מושלם למי שצריך מעבר איטי יותר על החומר.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: לי אישית היה חסר הסברים של התיאוריה של הנושאים שהיה מאוד נצרך כדי להבין את החומר (בסופו של דבר השלמתי את זה בעזרת ספרים) וגם סוג התרגילים שפתרנו היה מאוד דומה ולא מספיק מגוון כך שבהגשות היו הרבה שאלות שלא ידענו איך לגשת אליהן (המצגות באתר של גרשון ממש עוזרות בזה).\n\nשעורי הבית:\nWebWork- יחסית קל ומאוד עוזר לתרגל את הטכניקה לפתרון של תרגילים. תמיד עשיתי אותם כהקדמה להגשות בכתב כדי \"להיכנס לראש\" ולחדד את ההבנה של השיטה.\nמה שכן- די מציק שיש רק 4 ניסיונות לכל שאלה ולא תמיד הניסוח של השאלה מספיק ברור ואז סתם מתבזבזים ניסיונות.\nבכתב- השאלות היו ברמה הרבה יותר גבוהה מהשאלות במבחן אבל זה באמת עוזר להבנה של איך כותבים פתרון לשאלה במבחן כי לא מספיק רק לדעת לפתור את התרגיל אלא צריך גם להצדיק את השלבים שעשית בדרך.\n\nהמבחן: \nהיה קשה אבל די הוגן. שאלות בסגנון מאוד דומה למה שמופיע במבחנים משנים קודמות ובמצגות של גרשון כמעט אחד לאחד. צריך לדעת טוב איך להתמודד עם אינטגרלים מוכללים ועם טורים אינסופיים (שזה 2/3 הנושאים האחרונים של הסמסטר) אז חשוב לתפוס ראש בהרצאות האחרונות ובתרגולים האחרונים עד כמה שזה מפתה לוותר עליהם ולהכין הגשות אחרונות כדי להתפנות להתכונן למבחן בפיזיקה. \nמעבר לזה- חשוב לחזור טוב על ההגדרות והטענות שהראו בהרצאה. זה המפתח לשאלות אמריקאיות (שהמשקל שלהן הוא סביב ה30 נקודות)\nהשורה התחתונה: קורס די קשה אבל אם תקשיבו בהרצאות ולא תפחדו לשאול את מה שלא הבנתם כבר באותו יום (אם לא נוח לכם בהרצאה עצמה- תיגשו אל המרצה בהפסקה או אחרי השיעור/ בשעת קבלה). אפשר לעבור אותו עם ציון טוב (שלא לדבר על עובר)", "timestamp": 1676564094979}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מסביר בפרטי פרטים, מקפיד על הוכחות בהרצאות והדיוק חשוב לו מאוד. ממליץ ללכת להרצאות שלו בשביל להבין את הרמה שאליה הוא מצפה במבחן ולהתאים כבר מההתחלה את הכתיבה שלכם אליה.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: תותח על. יודע להסביר בגובה עיניים ומדבר בשפה שאנחנו חושבים בה, לכן קל ליישם את מה שהוא מלמד. אומנם התרגולים עמוסים אבל זה שווה את הצפיפות לדעתי.\n\nשעורי הבית: \nWebWork: בעיקר צורכים זמן ונועדו לתרגל את הצד הטכני. חשוב מאוד לדעת לשלוט בו אבל אין מה להתשגע עליהם. רוב ההתכוננות והלמידה תהיה דרך גליונות ההגשה והמבחן אמצע+מבחן סופי\nגליונות הגשה: כמו שאמרתי לעיל, סופר חשוב להבין אותם. השאלות שמופיעות שם דומות מאוד למבחן הסופי (אני לא בטוח אבל לדעתי אפילו חלקן, אם לא רובן, לקוחות ממבחני עבר ועברו שינוי קל)\n\nהמבחן: קשוח, אלון מצפה לרמה גבוהה של הבנה ודיוק. כל פסיק חשוב ואי אפשר לחרטט במבחן. אבל ציון טוב הוא יותר מאפשרי.\n\nהשורה התחתונה: קורס לא פשוט, הקורס \"המפחיד\" ביותר לסטודנטים סמסטר א ללא ספק. אבל אין מה לפחד צריך רק להבין מה הצפיות מכם ולדעת להתאים את עצמכם לשגרה שנדרשת.\n\nהמון בהצלחה למי שמתחיל סמסטר א!!", "timestamp": 1676802403188}, {"author": "דבורית", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אליהו אלחדף\nחוות דעת - הרצאות: הרצאות שמרגישות כמו נצח,משעמם, לא מרבה בדוגמאות ובפרט לא בדוגמאות מספריות (למרות שמבקשים ממנו במהלך ההרצאה). למי שאוהב הרצאות פחות עמוסות עדיף ללכת לאליהו. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: הייתי בקבוצת תרגול דיי ריקה כך שהיה מדהים, הוא רץ על התרגול ומספיק מלא תרגילים מה שעוזר אחרי זה בשיעורי בית. נותן דגשים למה המתרגל האחראי יותר אוהב שכותבים ודברים כאלה שהיו מאוד מועילים. ניסיתי תרגול שלו בכיתה יותר מלאה והיה לי נורא קשה, ממליצה למצוא את הקבוצה הקטנה יותר. בדרכ גרשון היה בקצב יותר מהיר מהמרצה מה שקצת עזר. סיים את התרגולים בדרך כלל רבע שעה לפני הזמן. \n\nשעורי הבית:  וובוורקים סבירים ברמת הקושי למרות שהם רבים בצורה לא הגיונית. \nהגליונות היו מזעזעים, השקעת זמן מטורפת שלא ניתן לתאר, רמת קושי גבוהה שבודקת את הבנת ההרצאות לעומק. \n\nהמבחן: מבחן לא קל, אך יחסית לסמסטרים אחרים שראיתי הוא היה דיי פייר. \n\nהשורה התחתונה: קורס קשה אבל קורס חובה אז אין מה לעשות שרדנו.", "timestamp": 1676970492098}, {"author": "ניקול", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: בהרצאות זה כאילו הוא קורא ספר ופשוט מעביר את החומר, לא מומלץ לרשום תוך כדי וממש להבין כי הוא רושם בקצב מאוד גבוהה. מאוד ברור ומרצה ממש לנקודה מומלץ לכל מי שאוהבים תכלס ולא בזבוזי זמן מיותרים.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מסביר הכל בצורה מאוד ברורה, מומלץ לכל מי שרוצה להבין איך לפתור את התרגילים עצמם\n\nשעורי הבית: ברמה שתואמת את התרגולים,אפשרי לרפרנס, יש הכל בדרייבים\n\nהמבחן: מאוד קשוח, הם רוצים צורת כתיבה מאוד ספציפית וצריך לשנן הרבה\n\nהשורה התחתונה: קשה, בהצלחה, תשקיעו גם במהלך הסמסטר כי קשה להשלים הכל בסוף.", "timestamp": 1677163296636}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nבסך הכל בסדר גמור, התחיל מהיר והפך להיות יותר בקצב נורמלי לא תמיד מבינים הכל מומלץ לשאול אבל לא תמיד הוא מבין את השאלות אז אם לא הבנתם תשאלו את המתרגל \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nטובה מאוד קצת מהירה אבל בסך הכל בסדר יש לה מלא תבניות איך לענות על שאלות מה שבאמת שווה זהב במבחן מומלץ מאוד!\n\nשעורי הבית: קשים מאוד צריך הרבה זמן השקעה\n\nהמבחן: אכזרי אבל אפשר לעבור את הקורס מספיק שתגיעו ל50 במבחן וציון ש.ב שלכם גבוהה מאוד מה שלגמרי אפשרי ועברתם את הקורס\n\nהשורה התחתונה: \nקורס קשה מאוד מצריך המון זמן השקעה חשוב ומהווה 5 נקז אם זה קורס בחירה בשבילכם אז אל עדיף לבחור קורס אחר אם זה קורס חובה בהצלחה!", "timestamp": 1678179501508}, {"author": "אא", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון דמטריוק\nחוות דעת - הרצאות: מדבר ברור ולעניין למרות שלוקח זמן להתרגל אליו. \n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: הציל אותי ואת חיי. הדבר הכי טוב שקרה לטכניון. \n\nשעורי הבית: לא כל כך עמוסים, תורם ממש להבנה של החומר \n\nהמבחן: הוגן לחלוטין, אם שולטים בחומר הגיוני להצליח\n\nהשורה התחתונה:", "timestamp": 1678389123744}, {"author": "Nir Karl", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: אלון לא אוהב תלמידים ולא אוהב לענות על שאלות של תלמידים תוך כדי הרצאה. אני פחות התחברתי אליו.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: אחלה מתרגלת, ניכר שהיא יודעת מה היא עושה, מביאה דוגמאות רלוונטיות ומסבירה מעולה, ממליץ.\n\nשעורי הבית: הרבה, דורשים הבנה בחומר.\n\nהמבחן: תואם את רמת שיעורי הבית לדעתי.\n\nהשורה התחתונה: קורס סבבה, עמוס.", "timestamp": 1678692425223}, {"author": "Eli", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nההרצאות בקצב מהיר ויכולות להיות מבלבלות\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: \nמתרגל מאוד טוב אבל לא שווה להיות בתרגול שלו אם מפוצץ כי הוא פשוט רץ בחומר\nשעורי הבית: \nיש גם גליונות וגם וואבוורקים הוואבוורקים בסדר והגיליונות קשים מאוד. צריך להתחיל את השיעורים כמה ימים לפני כי לפעמים עולים רעיונות אחרי כמה ימים\nהמבחן: \nהאמריקאיות נוראיות אבל סוג השאלות נשאר אותו הדבר כל שנה אז בסה\"כ די הוגן\n\nהשורה התחתונה:", "timestamp": 1678787304006}, {"author": "פאקטור", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nתצפו להיות עציץ החל מהרצאה 3-4\nבדיעבד הרצאות מיותרות לחלוטין\nעדיף לא לשאול שאלות במהלך ההרצאה\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: בדיעבד היא לא עזרה לי הרבה, הרע במיעוטו\n\nשעורי הבית: \nקשים, לרפרנס (קשים גם לרפרונס)\nעדיף להתעקש על להבין את החומר במקום לשרוף ימים על וובוורקים חסרי תועלת.\nהמבחן: \nלהתפלל חזק לפקטור\nהשורה התחתונה: חשבוניה דחוף, הפק\"ל של חן הררי הציל את חיי.", "timestamp": 1678998356882}, {"author": "הצל", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: על הפנים, מיותר להגיע להרצאות שלו, לא אכפת לו אם התלמידים יבינו או לפחות ככה מרגיש, עדיף לקחת מההתחלה קורס אינטרנטי למי שיש את האופציה ולרוץ לבד. \n\nשם המתרגל/ת: גרשון אברהמי \nחוות דעת - תרגולים: מעולה, ענייני ויודע להעביר ולהדגיש נקודות חשובות, מסביר מעולה ומראה טכניקות עונה על שאלות באופן ענייני ורציני\n\nשעורי הבית: קק\n\nהמבחן: קק, אלון קשוח\n\nהשורה התחתונה: צריך לעבור את זה, בדיעבד זה נחמד בזמן הקורס לא הבנתי מילה", "timestamp": 1679158211791}, {"author": "tbu", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: מרצה באופן חד משמעי, חד וחלק, די מובן אם מקשיבים לדבריו ולא כותבים במקביל. מומלץ להגיע לכל ההרצאות שלו. (אם הסתבכתם או לא הבנתם את התאוריה, תצפו בהרצאות חוודא1ת של צנזור ביוטיוב ותלמדו ממנו , כשבמקביל אתם בודקים מה נמצא בסילבוס ומה לא).\nבנגע לשאלות במהלך ההרצאה, תשאלו את אלון מה שתרצו בהרצאות אבל שימו דגש על לשאול שאלות בצורה פורמלית וברורה, במידה ולא, חבל עליכם. הוא לא יבין את מה ששאלתם ותגובתו לא ,תיהיה חיננית). דיוק זה מה שיבדיל אתכם מעובר לציון גבוה מאוד.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: תעשו לעצמכם טובה ולכו אליו. בלעדיו תתקשו למצוא קשר בין התאוריה שמוסברת בהרצאות למטלות ההגשה ושיעורי הבית ( שציונם נכלל בציון הסופי ). \n\nשעורי הבית: תעשו ( מקסימום תרפרנסו ותלמדו מהם).\n\nהמבחן: תפתרו את כל המבחנים שלו מ10 השנים האחרונות והציון שלכם יהיה מעולה. האמריקאיות של אלון מעט מבלבלות אז תדעו את המשפטים היטב ותבינו אותם.\n\nהשורה התחתונה: שימו דגש על כל החומר הנלמד בקורס ותשתדלו ללמוד את החומר היטב במהלך הסמסטר ולהבין אותו. זה יחסוך מכם המון זמן בלמידה למועד א ולא תצטרכו (בתקווה) מועד נוסף. \n\nתנו בראש!", "timestamp": 1679327973702}, {"author": "יוחאי יהב", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון דימיטרי ותק\nחוות דעת - הרצאות: בינוני \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מעולללללה\n\nשעורי הבית: בסדר \n\nהמבחן: מוזר\n\nהשורה התחתונה: קורס מעולה", "timestamp": 1679345638087}, {"author": "matan arad", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלון דימיטריוק\nחוות דעת - הרצאות: תסכול של החיים, מזל שעזב את הקורס, עברתי לאליהו ואז כבר הפסקתי לבוא להרצאות, צוות נוראי\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: לימד אותי את כל החומר מאפס דרך התרגול, מתרגל פצצה בזכותו קיבלתי ציון סבבה\n\nשעורי הבית: גליונות אחלה תרגול ווב וורק אין קשר למבחן\n\nהמבחן: קשההההההה\n\nהשורה התחתונה: קורס קשה אם יש לכם ברירה לא לקחת", "timestamp": 1679497692947}, {"author": "לג", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nלא התחברתי בכלל, רץ בחומר ובכתיבה כך \nשכמעט אי אפשר לכתוב ולהתרכז באותו זמן\nשם המתרגל/ת: מעיין הילה\nחוות דעת - תרגולים: \nמעולה. נותנת דגשים ממש טובים איך לפתור תרגילים\nשעורי הבית: \nהוובוורקים ממש עוזרים להבנת החומר אבל השעורים הכתובים קשים ולא קשורים \nהמבחן: \nהחלק הפתוח יחסית בסדר אבל השאלות האמריקאיות ממש קשות ומכשילות\nהשורה התחתונה:", "timestamp": 1679501325191}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: בתחילת הסמסטר היה קצת קשה להבין אבל עם הזמן הגיעו יותר דוגמאות מוחשיות שעזרו. למי שמתקשה אפשר ל\"תחזק\" עם סרטונים של צנזור ביוטיוב עזר לי מאוד\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל מעולה, עובר על החומר בקצב מהיר אבל נודע בכל הנקודות החשובות. מעבר לזה גם בשעות קבלה- מאוד מאוד עוזר\n\nשעורי הבית: סבירים מאוד\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס עם חומר קצת קשה לתפיסה אבל כשתופסים אפשרי לגמרי.", "timestamp": 1679763901131}, {"author": "Avivi Halfon", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: אלון לא מרצה חברותי או נחמד, אפילו שהוא כן זרק חיוכים ובדיחות ברגעי אור קטנים.\nהוא אינטליגנטי מאוד ולכן הוא לא מבין שלא כולם מבינים את הראיה הרחבה שלו בנושאים מורכבים (לסטודנטים. לא מורכבים עבורו).\n\nשם המתרגל/ת: הילה מעיין.\nחוות דעת - תרגולים: מרגיש כאילו כבר נמאס לה, לא מתייחסת כל כך בכבוד לסטודנטים אבל כן מקצועית ויודעת את החומר. לא מרגיש שהיא מסורה לסטודנטים או שאכפת לה מהם כל כך.\n\nשעורי הבית: \n\nהמבחן: ברמה מקצועית גבוהה מאוד, ממליצה מאוד לקחת את הפק\"ל של חן הררי לפני המבחן - גם אם אתם סגורים מאוד על החומר.\n\nהשורה התחתונה:", "timestamp": 1679845880900}, {"author": "המלך", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אלון דימיטריוק\nאחד המרצים הטובים בטכניון, דורשני ומהיר לכן *לא מתאים לכולם*. יודע את החומר מעולה ומסביר מאוד ברור יחסית לחומר הבזוי של הקורס הזה.\n\nשם המתרגל/ת: יארה חאטום\nחוות דעת - תרגולים: מתרגלת חדשה, נותמת המון מקום לסטודנטים לפתור את התרגילים בתרגול, קצת מבולבלת. תשתתפו הרבה וזה מאוד יעזור. מי שיכול להרשות לעצמו שילך לגרשון.\n\nשעורי הבית: באורך הגלות, שימו לב שבכל גיליון ההגשה יוצאת כמו שצריך. אני הגשתי בטעות רק דף שער וקיבלתי אפס.\n\nהמבחן: בזיוני לחלוטין, אמריקאיות לא פתירות בעליל. נכון לא נכון ניתן לניחוש,השאר לא נורא.\n\nהשורה התחתונה: קורס חשוב", "timestamp": 1680165682866}, {"author": "סטודנט ממוצע", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: כמו כן מרצה, אין ציפיות גבוהות ממנו אז בסופו של דבר הוא בסדר. \n\nשם המתרגל/ת: מעיין הילה\nחוות דעת - תרגולים: תותחית ששמה דגש גם על שיטות.\nשעורי הבית: קשים בטירוף כמצופה מהקורס הזה. \nהמבחן:\nמבחן קשה אבל שוב זה הקורס.\n\nכאן אוסיף שאני מאוד ממליץ לקחת את הפק\"ל של אס\"ט עם חן הררי המלך. הציל לי מספר דו ספרתי של נקודות במבחן. יש אותו מוקלט גם באתר סטאדיס (גם הלכתי לזה של אס\"ט וגם צפיתי בסטאדיס ולדעתי הם די חופפים אז אין טעם לקחת את שניהם).", "timestamp": 1683044262845}, {"author": "Denis Lenau", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלון דמיטריוק\nחוות דעת - הרצאות: \nמרצה טוב, מלמד ברור אבל רץ על חומר שהוא גם ככה קשה. ולא נכנס לפרטים והסברים.\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל מעולה, קצת רץ על הדברים אבל מכניס לתרגול תרגילים שמכסים את הדברים החשובים\n\nשעורי הבית: \nשיעורי הבית ברמה קצת יותר גבוהה מההרצאות והתרגולים. \nהמבחן: \n\nהשורה התחתונה: בסוף עברתי את הקורס עם ציון מעולה והכל בזכות הפקל של חן הררי התותח! מלמד בצורה מאוד ברורה, קלה להבנה ופשוט בן אדם שכיף להקשיב לו. בשבוע אחד לימד אותנו את כל מה שהיינו צריכים למבחן. ממליץ בחום לכולם לקחת את הפקל שלו דרך אסט או דרך אתר סטאדיס.", "timestamp": 1684403967506}, {"author": "ניצן כהן", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nרץ ממש. לא נחמד ולא אוהב שאלות של תלמידים. מקבל רק את מה שנכון לדעתו (אין נקודות על הבנה אך ניסוח שונה משהוא לימד).\n\nשם המתרגל/ת: יארה\nחוות דעת - תרגולים: \nמדהימה, הצילה לי את הקורס. מאוד עוזרת. תרגול כמעט ריק כי כולם הולכים למתרגלים המנוסים יותר. \n\nשעורי הבית: \nקצת קשים, במיוחד המטלות הכתובות שלוקחות הרבה זמן אבל לרוב הדברים יש רפרנסים משנים שעברו.\nהמבחן: \nקשה. \nהשורה התחתונה: \nאם יש קורס עם מרצה אחראי שהוא לא אלון- לכו לשם. אם אתם חייבים, לכו להרצאות של אלון כי חלק מהדברים שהוא מעביר נמצאים אח״כ בבוחן ובמבחן. להעתיק הוכחות למשפטים - חלקם נמצאים במבחן.", "timestamp": 1686753987626}, {"author": "עדי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נאדר \nחוות דעת - הרצאות: \nממליצה ממש ממש! מדבר בגובה העיניים , נותן מקום לשאלות ומסביר בצורה טובה . נותן הרבה דוגמאות.\nהרצאות עוברות באווירה טובה\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים:  המתרגלת הכי טובה!\nמובנת מאוד , נותנת דוגמאות טובות\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713173925964}, {"author": "yotam", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אגא נאדר\nחוות דעת - הרצאות: נאדר לא תמיד מסביר הכי ברור, הדוגמאות שלו לא ברורות במאה אחוז ולפעמים אינו מסיים את הדוגמאות וכבר עובר לנושא הבא. לא תמיד מפרט לעומק על הנושא הנלמד.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: גלינה מתרגלת מלכה, אין לה תחליף.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס זוועה", "timestamp": 1713175197262}, {"author": "ניקיטה וליקודני", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי הרבה פעמים ציני, הרבה פעמים רץ בחומר (יש הרבה חומר) ולא סובל כשמישהו מדבר בקהל. עם זאת הוא תמיד יענה על שאלה ויסביר את עצמו אם יש זמן. הציניות שלו אף פעם לא משפילה (הוא ציני כלפי עצמו) והוא נהיה אגדה בגלל היציאות שלו. יותר נחמד איתו בשעות קבלה, כשאין לו טון של חומר להעביר בזמן קצר (יש באמת הרבה חומר), אז הוא יכול להתעכב יותר על הנושא\\בעיה.\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: רבקה אלופה, במתמטיקה ובהוראה. מי שלומד אצלה ויוכל להיכנס לפחות קצת לראש שלה מבחינת פתרון תרגילים יצליח.\nרבקה רצה מהר. המהירות האיטית שלה זה מהר מדי בשביל רוב האנשים, אז לפעמים צריך לבחור בין להבין ולהעתיק (אפשר להבין, לצלם ואז להשלים).\n\nשעורי הבית: קשים, עמוסים, לא מובנים הרבה זמן. אבל זה חדוא, מה ציפיתם? \"החיים(חדוא) זה לא קשת בענן, העולם זה מקום מכוער, זה לא משנה כמה אתה קשוח החיים(חדוא) יורידו אותך על הברכיים. אף אחד לא יכול להכות חזק כמו החיים(חדוא) וזה לא משנה כמה חזק אתה מכה אלא כמה מכות חזקות תוכל לחטוף ובכל זאת להמשיך הלאה\". רוקי בלבואה\n\nהמבחן: בשביל להצליח צריך להשקיע הרבה זמן, עבודה ומחשבה. יש הרובריקות חוזרות על עצמן ממבחן על מבחן, אז מי שפותר הרבה תרגילים ומבין תאוריה יוכל להצליח\n\nהשורה התחתונה: חדוא זה דבר מרכזי לכל מי שמתעסק עם הנדסה או מדע. מי שיצליח בחדוא, יצליח בשאר הדברים כמעט בטוח", "timestamp": 1713266946516}, {"author": "Nadav Yashar Hochman", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מרצה נהדר ומתחשב מאוד. תהיו טובים איתו והוא יהיה טוב איתכם\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: אחלה מתרגלת לפעמים אבל מיותר ללכת\n\nשעורי הבית: קשה\n\nהמבחן: לא קל אבל אפשרי\n\nהשורה התחתונה: צוות טוב אבל חומר דורש עבודה", "timestamp": 1713363992749}, {"author": "איתן 67", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר נאדר אגא\nחוות דעת - הרצאות:\nנאדר לימד את הקונספטים הכלליים בצורה ברורה, אם כי לעיתים קרובות בילבל פלוס למינוס ושטויות אחרות. הייתה אווירה טובה מאוד בכיתה ולמרות שהחומר היה קשה כולם הביעו רצון ללמוד בגללו. יצויין שנאדר מלמד דברים שלא נמצאים בחומר (קול, מגניב, העשרה), אבל לפעמים מלמד דברים בצורה שונה מיוסי - המרצה האחראי - וזה גורם לבעיות במבחן הסופי.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים:\nגלינה לימדה בצורה יחסית יבשה אך העבירה את החומר ונתנה טיפים מועילים.\n\nשעורי הבית:\nקשים ולוקחים הרבה זמן. היו סופ\"שים שישבתי 15 שעות רק על שיעורי הבית בחדו\"א כי הם היו להגשה בשני.\n\nהמבחן:\nהוגן אך לא כיף.\n\nהשורה התחתונה: קורס עמוס ולא מספיק מעניין כדי להצדיק את העומס. מצד שני, זה קורס חובה ובסיסי. אז...", "timestamp": 1713372214636}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי אחלה גבר שבעולם, למרות שרואים שקשה לו ללמד בקבוצות היותר עמוסות כי הדיבורים ממש מפריעים לו. מצד שני הוא מוכן לענות לסטודנטים בוואטסאפ גם בשעות מאוד מאוחרות(ראיתי אותו פעם עונה למישהו באחת לפנות בוקר) והוא חופשי מוכן לצחוק על הכל.\n\nשם המתרגל/ת: גרשון/גלינה\nחוות דעת - תרגולים: בתחילת הסמסטר הלכתי לגרשון כי זה הסתדר לי עם הלוז וקראתי עליו דברים טובים, עד שנהיה עמוס מדי אצלו לקראת שבוע 3 והתחילו להעיף כל מי שלא בקבוצת ההרשמה. גרשון יודע על מה הוא מדבר אבל הוא די רץ על החומר, מצד שני הוא מכניס לתרגולים תרגילים שמדגישים את הדברים החשובים ומראים בצורה יפה טריקים מוכרים. הוא יודע להנגיש טוב את החומר ולגרום גם לדברים מסובכים להישמע מאוד פשוטים. עם גלינה לעומת זאת אף פעם לא הרגשתי שרצנו על החומר ועדיין הספקנו הכל בדרך כלל. הרגשתי שהתרגילים היו פחות לימודיים מאצל גרשון ויותר הייתי צריך להתאמץ כדי להבין את החומר אבל לי זה דווקא עזר כי עם גרשון אפשר להיכנס לשאננות כזאתי שהוא מביא לכם את כל הטריקים ולא צריך להתאמץ כדי באמת להבין מאיפה דברים באים.\n\nשעורי הבית: הוובוורקים בדרך כלל היו די קלים, שימושים מאוד נאיבים של נוסחאות. הרבה פעמים עשיתי אותם בתור חימום כזה לפני הגליונות הפתוחים כדי לפתח היכרות עם הנוסחאות. הגליונות הכתובים זה איפה שדברים באמת נהיים רציניים. משבוע לשבוע הזמן שלקח להכין גליון כתוב גדלה אקספוננציאלית וכמות העמודים עלתה מעשר עמודים לגליון הראשון לעד 34 עמודים בגליון הרביעי(את החמישי והשישי לא הגשתי כי לא הייתה חובת הגשה יותר). השאלות שם יכולות לנוע בין שאלות קלאסיות שחשוב לדעת איך לפתור לשאלות רנדומליות שאחד המרצים חשב עליהן ואף אחד לא עומד לדעת לפתור בלי ללכת לשעות קבלה כדי לקבל את התשובה. השיעורים ארוכים ומתישים ובכל זאת כדאי לעשות הכל מהתחלה ועד סוף, גם אם לא מגישים בסוף.\n\nהמבחן: היה הוגן לגמרי\n\nהשורה התחתונה: קורס עמוס(נו מה ציפיתם, חדוא) אבל כל האנשים שאומרים שזה בלתי אפשרי או לקחת את החמישים ולברוח מגזימים בטירוף, לגמרי ניתן לקבל ציון לא רע בכלל אם מגיעים להרצאות, עושים את השיעורים כמו שצריך, והולכים לשעות קבלה. לא צריך להיות גאון ולא צריך להיות חרשן. תעשו את המינימום כדי להבין את החומר ואתם תעברו אם לא יותר מכך.", "timestamp": 1713372601334}, {"author": "L", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות:\nההרצאות היו מאוד לא מובנות והחומר עצמו מאוד קשה.\nיוסי מנסה להפוך את הקורס לבלתי אפשרי וממש חבל.\nזה בסך הכל הסמסטר הראשון שלנו וגם המבחן הראשון לחלקנו ומרגיש כאילו התחלנו ברגל שמאל את התואר בגלל הקורס הזה.\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים:\nגלינה חמודה ומסבירה בסדר אבל לא מצליחה להנגיש מספיק את החומר הקשה הזה. לא פותרים תרגילים ברמת השיעורי בית אז הפסקתי לבוא לקראת סוף הסמסטר כי סתם בזבוז זמן.\n\nשעורי הבית:\nשנים קודמות היה שיעורי בית ממוחזרים עם רפרנס.\nהשנה קיבלנו שיעורי בית שלקוחים ממבחנים מכל מיני שנים והשאלות מאוד קשות- רמת מבחן אחרי שבקושי פתרנו משהו בסגנון. בקושי הצלחתי אותם והציונים לא גבוהים מאוד אבל הכי מבאס שבודקים בקושי שאלה אחת (בדרך כלל סעיף בודד) מכל העבודה אחרי כמות שעות מטורפת שישבתי עליה אז יצא שלא יכלתי להעזר בפתרונות לקראת הבחינה כי לדעתי היו שגויים אך לא נבדקו. גם לקראת הבחינה למרות שהובטח לנו שיהיה פתרונות, לא היו פתרונות לעבודות האלה וממש חבל כי לרב זה משאלות אמריקאיות במבחנים שגם להם אין פתרונות.\n\nהמבחן:\nהשאלה הראשונה 20 נקודות, הייתה מהגהנום, שאר המבחן היה סביר אבל לא חושבת שהצלחתי הכל.\nאם אקבל עובר כנראה אנסה לשפר את הקורס בהמשך התואר.\n\nהשורה התחתונה: התרגול בנושא מסוים תמיד היה בדילאי של שבוע מההרצאה באותו נושא שזה משהו שצריך קודם כל לטפל בו. החונכים שהציעו לי מקידום סטודנטים לא ענו בכלל להודעות והיה מעט מאוד אז לא הצלחתי לקבל עזרה בסבסוד.\nמרגישה מאוכזבת מצוות הקורס גם שכל כך לא אכפת לו מהסבל שלנו. שיקפנו מספר פעמים לצוות כמה קשה לנו וכמה בקושי מתחשבים בנו, למרות המלחמה והמצב הרגשי המעורער שלנו, בקושי הורידו לנו נושאים למרות שלקורס המקביל 1מ2 כן הורידו את הנושאים האחרונים הכבדים. לא הביאו לנו פתרונות לעבודות והמבחנים פתורים רק באופן חלקי. הפתרנות המלאים לשאלות אמריקאיות והעבודות היו מאוד עוזרות אבל בגלל סיבות טיפשיות לא הביאו לנו.\nללא שיעורי עזר / קורסי אונליין זה בלתי אפשרי לעבור אותו אבל כמובן שזה מכספנו האישי וזה מאכזב ממש.\nהייתי ממליצה- מראש להתארגן על מורה פרטי טוב כבר בתחילת הסמסטר שתהיו איתו לאורך הקורס אם יש לכם כסף.", "timestamp": 1713527262825}, {"author": "Margarita Birchanskiy", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: בסמסטר הזה היה רק את יוסי ואת נאדר. אם יש אופציה ללכת למישהו אחר, ממולץ בחום. מנסה להיות מצחיק בשיעורים, אך לא תמיד מוצלח. בסך הכל מסביר בסדר, לא תמיד מתייחס בסובלנות כלפי שאלות של סטודנטים.\n\nשם המתרגל/ת: רבקה \nחוות דעת - תרגולים: מתרגלת מעולה, מספיקה לעבור על המון חומר והמון תרגילים תוך כדי הסבר ברור. מהירות גבוהה, מתאים למי שמספיק לעקוב ומומלץ להתאתגר כי בסוף זה שווה.\n\nשעורי הבית: \n\nהמבחן: הוגן בסך הכל. דורש למידה של שבועיים לפחות אבל עם מספיק תרגול אפשר לפתור אותו בלי בעיה. עם זאת דורש זמן תרגול.\n\nהשורה התחתונה:", "timestamp": 1713536628053}, {"author": "לא היה לי כיפה אז לא התחפשתי ליוסי בפורים", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי \nחוות דעת - הרצאות: אחלה יוסי, מעביר את החומר מדוייק, לפעמים קצת עושה שטויות על הלוח שאף אחד לא מבין (במיוחד בהתחלה) אבל ברגע שקולטים אותו ומבינים שנאדר אופציה הרבה יותר גרועה (הוא באמת לא מצחיק ומפוזר) אז אתם דיי תקועים איתו take it or leave it, ממליץ לשבת מקדימה אצלו כי אז יש סיכוי שהוא ייזרוק עלייך טוש, אם ממש לא מסתדר לכם השעות אז אין בעיה ללכת למוקלטות שזה העתק הדבק למה שהוא עושה בכיתה (אותן בדיחות אפילו)\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: גרשון שם את הכיתה שלו באולמן 803 שזה בערך בסוף העולם שמאלה, אם אתם לא אוהבים מדרגות אכלתם אותה, נגיד ועליתם את המדרגות וכן הגעתם לכיתה, גרשון פשוט עושה בדיוק את אותם הדברים שהוא עושה בחשבוניה, לרמת התרגיל וההסברים, הוא היה המתרגל שלי גם בלינארית מ' וגם בחדוא 1מ', ככה שהתרגולים היו אחד מיד אחרי השני ופשוט נשארתי בכיתה לשניהם, גרשון יכול להיות מאוד זריז לאנשים אבל אני חושב שהוא בדיוק בקצב שצריך, עושה מלא דוגמאות (ובגלל המהירות שלו התחלתי לצלם את הלוח ולהקשיב במקום לכתוב ולפספס את ההסבר), אבל גם הבנתי ששאר המתרגלים רצים אז זה דיי pick your poison\nבכל מקרה, תמיד כיף קצת גרשון לנשמה, אם תראו שלא עובד בכלל בינכם אז להחליף מתרגלים כמה שיותר מהר\n\nשעורי הבית: גועל נפש, הקורס הרגיש לי פח אשפה בכל החצי סמסטר הראשון, הייתי צריך לרפרנס כמעט הכל (כולל הוובוורקים) פשוט כי התעוררתי מאוחר רצח לעובדה שאני סטודנט בטכניון וצריך ללמוד בניגוד למתמטיקה חמש יחל בתיכון, בדיעבד אם הייתי בא יותר מוכן מנטלית לחדוא מאמין שיכל ללכת יותר טוב\n\nהמבחן: יוסי פרגן רצח, עשה מבחן שמאוד מזכיר תרגילים ממבחני עבר הוא כתב, כל מי שמתלונן על המבחן קחו את זה בערבון מוגבל כי זה חתיכת skill issue, המבחן היה קל אבל אם לא עשית מספיק מבחנים שלו אז דיי אכלת אותה\nבסוף המטרה של כל הקורס הזה זה לעבור אותו אז גם 60 זה לא מילה גסה פה, ממליץ להתחיל ללמוד למבחן כמה שיותר מוקדם ככה תהיו מוכנים לכל מכה שיכולים לארגן לכם\n\nהשורה התחתונה: מה אכפת לך, סבלנות יש?", "timestamp": 1713603958193}, {"author": "זה שאומר יפה מאוד", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: באמת אחלה יוסי, מעביר את החומר בסדר ולפעמים שוכח שאנחנו לא גאונים אבל תמיד עוצר להסביר שוב, מחכה לכולם שיעתיקו כדי שיוכלו להקשיב להסבר, ציני מאוד ובעיני מצחיק כמעט באותה מידה, זמין בווצאפ כמעט כרונית למעט שבתות, בסוף הקורס תדעו לדבר יוסית, ההרצאות חשובות מאוד כי רק ממוקלט קשה לדעת מה נשאר בחומר ומה ספציפי אולי הורידו\n\nשם המתרגל/ת: גלינה\\רבקה\nהתחלתי עם גלינה ועברתי רק בגלל אילוצי שעות לרבקה\nשתיהן מעולות אבל שונות מאוד, גלינה מסבירה יותר לעומק קצת פחות תרגילים אבל מסבירה היטב וחוזרת אם צריך\n\nלקראת האמצע עברתי לרבקה, רבקה כמו גלינה נחמדה מאוד ונכונה לעזור רק חושבת מתנהלת וכותבת בקצב משוגע מה שגורם לה להספיק הרבה תרגילים ולהראות כמה שיותר סוגים של טריקים אבל לפעמים מעייף עד בלתי אפשרי לעקוב, זה נראה קשה אבל יתרום לכם מאוד, היא כמובן עונה על שאלות רק תעצרו אותה בעצמכם.\n\n\n\nשעורי הבית: קשים מאוד, לקוחים ממבחנים בעיקר או יותר קשים, אם לא עשיתם אותם קשה לדעת איך אתם בקורס המזוויע הזה, תעשו, את השלושה האחרונים פחות בודקים מניסיון רק תגישו\n\nהמבחן: באתר ראיתי שהמבחנים של אלון אלוהים ישמור, למזלי הרב זכיתי ביוסי שזכר שמלחמה בחוץ ועשה מבחן מאוד דומה למבחנים שלו משנים קודמות כך שלא הייתי מופתע בבחינה מכלום\n\nהשורה התחתונה: קורס שייקח לכם את מירב המשאבים הסמסטר, לא להבהל אם לא הבנתם משהו מיד, תהיו עם היד על הדופק שהבנתם את הקונספטים לקראת המבחן ולכו לבדוק כמה שיותר מתרגלים בשבועיים הראשונים כי אתם עוד לא עמוסים עדיין, דה?", "timestamp": 1713634794123}, {"author": "change2000", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אגא נאדר\nחוות דעת - הרצאות: הוא שונא חדוא וזה מאוד מורגש. יצא לי ללמוד איתו אלגברה גם והוא היה מדהים. בחדוא קשה לו וזה לגיטימי כי זה לא התחום שלו. נגרר לדוגמאות לא טריוויאליות ומאבד אפילו את עצמו. מצד שני כל מי שלמד עם יוסי (המרצה השני והאחראי) לא היה במצב יותר טוב מאיתנו ככה שהאשמה צריכה להיות מוטלת על החדוא ללא ספק.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nמאוד יסודי וטכני. טוב למי שמגיע מוכן מבחינה מתמטית כי הוא לא שואל שאלות במהלך התרגול ופשוט עונה לעצמו. אם הבנת מעולה אם לא בהצלחה לשאול אותו בהפסקה עם תור של 10 סטודנטים עם שאלות לא הגיוניות על מטלות הבית.\nשעורי הבית: \nקשים ללא סיבה מוצדקת. המרצים בעצמם הסתבכו ולא הצליחו לפתור חלק מהשאלות כי היו שם טעויות. לכו למתרגלים הם יותר טובים בלפתור.\nהמבחן: \nהוגן באופן מפתיע מאוד.\nהשורה התחתונה: קורס קשה ולא מומלץ", "timestamp": 1713710167597}, {"author": "נאדר המלך", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: נאדר מרצה מושלם. מלמד מצחיק, אוהב את הסטודנטים שקבועים אצלו, ומעביר את החומר בצורה טובה. נאדר מלמד ממש לאט וזה טוב דווקא בקורס הזה כי הוא נותן אפשרות לשאול כל שאלה שרוצים. נכון צריך לעשות השלמות בצהרי יום ד לפחות פעם אחת והוא ממש לא אוהב חדוא אבל הוא עדיין מלמד ואוהב ללמד גם אם הוא לא אוהב חדוא. הוא לימד גם אלגברה הסמסטר ושם הוא היה הרבה יותר שמח אז אם יוצא לכם לראות אותו באלגברה מומלץ ממש, וגם בחדוא הוא מומלץ על כל מרצה אחר שיתנו לכם.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: התרגולים שלה מצויינים והם גם מוקלטים, הייתי בתרגול שהיה על השעה של המרצה האחראי ככה שהיו בתרגול בערך עשרה אנשים ככה שהיה ממש טוב אצלה\n\nשעורי הבית: נוראיים אבל בסדר אם עושים אותם בחבורה\n\nהמבחן: הכי קל שראיתי בשנים האחרונות\n\nהשורה התחתונה: תסיימו את הקורס הזה ואל תחזרו עליו אם עברתם", "timestamp": 1713723223402}, {"author": "אל תתחתן", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: \nמרצה מצוין, הוא מאוד דואג שהחומר התיאורטי יישב טוב אצל הסטונדטים שלו ולכן ההרצאות שלו הן בקצב יותר איטי משל יוסי (בשבוע האחרון עשינן גם שיעור השלמה אבל זה שווה את זה), מביא הרבה דוגמאות שעוזרות להבין. הוא אומנם מעט מפוזר ונוטה להתבלבל בדוגמאות- אבל בשורה התחתונה הוא מרצה נהדר ומאוד מצחיק וזה גרם לכך שההרצאות שלו היו ההרצאות שנהנתי בהן הכי הרבה בסמסטר. \nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nמתרגלת מצוינת, מאוד חשוב להגיע לתרגולים כי בלי זה אי אפשר לעשות בכלל את שיעורי הבית, והתרגולים של ניקה היו ברמה מאוד גבוה, ממליץ מאוד.\nשעורי הבית: \nארוכים ומייגעים - תאורטיים מדי יחסית למבחן שהוא די טכני.\nהמבחן: \nחייב להגיד שהופתעתי כי היה די פייר, יחסית למבחנים של דמטריוק שנראים כמו אסון, המבחן של יוסי (המרצה האחראי) היה ממש סבבה.\nהשורה התחתונה: \nקורס מעניין וקשה שצריך הרבה השקעה- כנראה יקח לכם 50 אחוז מזמן הלמידה שלכם (אם לא יותר)", "timestamp": 1713869327357}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: בסה״כ אחלה מרצה, מסודר מאוד אבל ממש קשה לו כשמפריעים (ולפעמים כששואלים אין לו סבלנות). אבל התחשב מאוד גם בדחיית מועדי הגשה של שיעורים וגם בנה מבחן הוגן מאוד, דחף להתחשבות במילואימניקים (שנת מלחמה) וכן חשוב לו שכולם יצליחו\n\nשם המתרגל/ת: רבקה\nחוות דעת - תרגולים: מתרגלת מעולה, מביאה בכוונה שאלות קשות אז אל תיבהלו כי אח״כ מגיעים למבחן ויודעים מעולה. רואים שחשוב לה שיבינו אבל לפעמים היא קצת ממהרת… ממליץ לצלם ולהקשיב במקום להתאמץ להעתיק ולפספס\n\nשעורי הבית: קשים אבל עוזרים מאוד, משמעותית הקורס שלוקח הכי הרבה השקעה בסמסטר גם בשעות וגם בהבנה\n\nהמבחן: הוגן מאוד מאוד\n\nהשורה התחתונה: קורס סביר", "timestamp": 1713999892618}, {"author": "מישהי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: \nאני באופן אישי סבלתי ברמה שלא תתואר במילים, הקורס עצמו קשה במילא ואם תשאלו אותי יוסי רק הפך אותו לסיוט אפילו עוד יותר.\nניכר שהוא מקצועי מבחינת הידע שלו אך לתחושתי לא הצליח להעביר את החומר בכיתה בצורה ברורה ובודדים מי שהבינו אותו והצליחו להשאר בקצב. מרגיש כמו שיעור של הכתבה אינסופית של משפטים שבכל מקרה רשומים באלפי סיכומים קודמים. לא הרגשתי שהוא מסביר את העומק של החומר אלא פשוט רץ עליו במהירות האור - וגם כאשר מישהו שאל שאלה הוא עשה טובה שבכלל הקשיב לו וענה אם בכלל.\nאפשר להבין כי כמות האנשים באולם היתה לא נורמלית. ח ר ד ה.\nלדעתי אם אפשר ללכת למרצה אחר אז מומלץ, וכיתות קטנות עדיפות. הוא מתחשב במילואים באופן אישי אבל אם אתם לא מילואים אז אתם יכולים לקפוץ מה שנקרא..\n\nשם המתרגל/ת: גלינה \nחוות דעת - תרגולים: \nמדהימה. הקצב יותר איטי אבל אפשר להבין כל תרגיל לעומקו כולל ציורים גרפים ואת מהות המתמטיקה. בתרגולים אחרים מדפיקים לעבור על יותר שאלות אך לפעמים זה במחיר של לא להבין אותם בכלל ופשוט לרדוף אחרי הקצב של השיעור. כל אחד ומה שמתאים לו.\n\nשעורי הבית: \nייאוש שלא נגמר, כדאי לעשות לבד ולהתעמק על שאלות כי ככה לומדים את החומר אבל זה לוקח כמות זמן עצומה שלא תמיד יש.\n\nהשורה התחתונה: חובה ואין ברירה. הקריס לי את הסמסטר. עצה חמה!!! לפני תחילת הקורס לחזור כמה שיותר על מושגי תיכון כלליים (סרטוני הכנה של צנזור למשל)", "timestamp": 1714238637816}, {"author": "אנייי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: האמת שממש נהניתי מההרצאות, יוסי מרצה טוב, בקבוצה גדולה היה קצת קשה לעקוב אחריו אבל בקבוצת הרצאה יותר קטנה הוא הסביר מאוד ברור וענה על שאלות. מאוד ציני אבל זה בצחוק לא צריך להעלב ממנו :)\n\nשם המתרגל/ת: אברהם גרשון \nחוות דעת - תרגולים: מלך, קצת מהיר אבל מאוד מובן ומסביר דברים בצורה מאוד בהירה \n\nשעורי הבית: ארוכים, מייגעים ומתישים, לא דומים בכלל לרמה של התרגילים שפותרים בתרגולים. \n\nהמבחן: היה הוגן מאוד, לא קל אבל פייר \n\nהשורה התחתונה: אחלה קורס צריך להשקיע הרבה", "timestamp": 1714495967084}, {"author": "אורי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות:\nאחלה יוסי. לא יודע עם הוא מתאים לכולם, אבל באמת שכיף להגיע להראות עם מרצה שרואים ומרגישים שבאמת אכפת לו מהסטודנטים שלו, ועוד כשהוא מרצה אחראי על קורס ענקי. \n\nממליץ מאוד לראות עם יש קבוצה יותר קטנה, גם אם השעות פחות נוחות, הבדל משמעותי בין הרצאה של 300 סטודנטים ל-80.\n\nיוסי תמיד מוכן לענות לשאלות בהרצאה, בהפסקה, בשעות קבלה, ותמיד זמין בוואצפ האישי שלו ובקבוצה שהוא פותח לכל השאלות. חוץ מזה- אלגברה יכול להיות קשוח ולא מובן מה קורה שם, אז עוזר (לפחות לי) שהמרצאה מתבדח וכל הזמן שובר את המתח. \nרק המלצה קטנה- לא תמיד יוסי כותב הכי מסודר שיש בזמן ההרצאה, אבל כל החומר זמין בכל כך הרבה מקומות ודרכים, שבאמת עדיף לשבת בהרצאה ולהקשיב. את המחברת אפשר למלא אחר כך. \n\nשם המתרגל/ת:  ניקה\nחוות דעת - תרגולים: \nניקה נהדרת. מביאה תרגילים מעניינים ומראה את האינטואיציה ואיך לגשת בכלל, גם מראה מלא טריקים שימושיים. הבעיה היחידה היא שהיא ממש רצה, אז פשוט צריך לפעמים לשאול ולבקש ממנה לחזור רגע לאחור\n\nשעורי הבית: 6 גליונות בכתב, 6 webwork. \nהגיליונות לא קלים, כל השאלות הם ממבחני עבר (אפשר לחפש במחנים או במודל בקורס \"קורס חומר עזר בחשבון דיפרנציאלי ואינטגרלי\" שם יש פתרונות מלאים להרבה מהתרגילים שיש בגיליונות או שדומים אליהם. \nה- Webwork יותר טכני, כדאי לנסות לעשות ברגע שסיימתם את החומר הרלוונטי בהרצאה.\nמומלץ לפחות לנסות את הכל, גם אם לא מגישים. \n\nהמבחן: הוגן. צריך לשנן את הניסוח וההוכחה של איזה חמישה משפטים מרכזיים (שאלה בטוחה במבחן, יכול להיות 15 נקודות באמת מתנה). אין באמת הפתעות במבחן, הוא לא קל אבל היה מאוד הוגן, אם הקשבתם בהרצאות ופתרתם מספיק שאלות לפני בצורה מלאה, אפשר להוציא ציון מאוד גבוהה. \n\nהשורה התחתונה: קורס חובה לכולם. הוא לא קל, ודורש לפתוח את הראש להמון רעיונות חדשים/ישנים וללמוד שפה מתמטית. ליוסי באמת אכפת מהסטודנטים שלו ועושה מה שהוא יכול.", "timestamp": 1714555719030}, {"author": "ב'", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: אחלה מרצה, מסביר בסך הכל ברור ובאווירה טובה. היחס שלו למילואימניקים מדהים!\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים:  מתרגלת טובה בסה\"כ, אני הייתי צריך להתאמץ קצת כדי את  מה שהיא אומרת (מבחינת שפה)\n\nשעורי הבית: לא קלים אבל הוגנים\n\nהמבחן: בגלל המלחמה היה מבחן הוגן ואפילו קצת קל\n\nהשורה התחתונה: קורס סבבה - בכל מקרה מי שלוקח אותו לוקח כי חייב אז אין באמת ברירה :)", "timestamp": 1715077806308}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן \n\nחוות דעת - הרצאות: \nיוסי מרצה טוב, יודע להסביר, רואים שיש לו ניסיון ויודע לעשות את העבודה שלו כמו שצריך.\nאכפת לו מאוד מהסטודנטים עד כדי שפתח לנו קבוצת וואטסאפ והשתדל לענות על כל שאלה בכל שעה ביום \nבנוסף לזה הוא דואג לנו ללפחות 5/6 בדיחות כל הרצאה וזה נחמד לדעתי.\nלכו אליו במיוחד אם הוא מרצה אחראי.\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nהתרגולים היו סבבה לגמרי, שאלות טובות ומכסות את החומר שנלמד בהרצאה, ניקה מתרגלת טובה אך קצת עצבנית בשעות קבלה\nהלכתי אליה פעם אחת לשעת קבלה והיא לא הייתה מוכנה לעזור עם שיעורי בית להבדל ממתרגלים אחרים למשל רבקה שהייתה פותרת חצי מהגליון עם הסטודנטים\nשעורי הבית: \nנורא ואיום, לא קרובים לרמת התרגולים, נתנו לנו שאלות ממבחנים והיו מורידים על כל דבר קטן שזה בעיניי אינפי קצת\nהמבחן: \nיוסי פינק אותנו במבחן דיי הוגן (בגלל המלחמה) אבל עדיין צריך לשבת הרבה שעות על כל גיליון וימים שלמים לפתור מבחנים כדי לדעת לפתור במבחן.\nהשורה התחתונה: \nקורס חובה שצריך לעבור אותו, אפשר גם לקבל ציון טוב , קחו את זה ברוח טובה ותעזרו בחברים כי אין לכם ברירה :)", "timestamp": 1715097674881}, {"author": "ו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי בעיני היה מרצה לא כזה טוב, רוב ההרצאות שלו היו פשוט זריקת מושגים באוויר ואז מבינים אותם בדיעבד. הרבה פעמים פשוט לא טורח להסביר אלא מציג נושאים שלמים כמובנים מאליו, מגיע וזורק מושגים בלי שום הקשר וצריך לפענח מה הוא מנסה להגיד. הוא כן ניסה לשמור על אווירה מצחיקה בכיתה ומאוד עזר מתי שביקשו ממנו בפרטי,  וגם לקראת סוף הסמסטר הוסיף שעת קבלה. אבל פשוט ההרצאות שלו לוקות הרבה בחסר ויש הרבה עבודה של להבין את ההרצאות לבד. \n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מושלמת, מסבירה מעולה, בזכותה הבנתי את החומר. התרגולים שלה היו סופר רלוונטיים וענייניים. גם בשעות קבלה שלה הייתה מאוד עוזרת\n\nשעורי הבית: קשים, ארוכים, אבל מומלץ לעשות כדי להבין את החומר תוך כדי הסמסטר\n\nהמבחן: המבחן היה די הוגן ביחס לתקופה, הרגיש שיוסי התחשב\n\nהשורה התחתונה: קורס לא פשוט שדורש המון זמן במהלך הסמסטר אבל חד משמעית ההשקעה משתלמת", "timestamp": 1715179310192}, {"author": "י", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: ההרצאות ברורות ומובנות. אצל נאדר לעומת זאת היה לי ממש קשה להבין.\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים: היה קצת קשה לעמוד בקצב של הקורס אצל גלינה.. התרגולים נמרחו על שאלות בסיסיות של סטודנטים שלא הבינו את החומר בהרצאה והרגשתי שאין לי את היכולת לעמוד מול השיעורי בית \n\nשעורי הבית: קשים ולוקחים המון זמן\n\nהמבחן: המבחן היה בסדר סהכ \n\nהשורה התחתונה:", "timestamp": 1715252807216}, {"author": "OX", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מסביר בצורה בהירה ומובנת. מרצה בחסד עליון, מענה רגיש לאנשי מילואים בעיקר בסמסטר תחת צל המלחמה, עצם העובדה שעברתי לזכותו. אין מילה אחת רעה.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מסביר מעולה, הקצב הטבעי שלו הוא 1.75, אז קל מאוד לאבד אותו ברגע של היסח דעת, מעבר לזה 10\\10\n\nשעורי הבית: \n\nהמבחן: קשה וטריקי, חשובה תשומת לב לפרטים קטנים.\n\nהשורה התחתונה: קורס חובה, מה כבר יש להגיד.", "timestamp": 1715512992435}, {"author": "יל", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אגא נאדר \nחוות דעת - הרצאות:  מעביר את החומר בצורה מעניינת אבל לרוב לא מסיים דוגמאות עד הסוף, דבר שמקשה על ההבנה במהלך הלמידה העצמית \nסה\"כ מרצה בסדר, מראה רצון להצלחה של הסטודנטים ומשתדל לעזור ולהתעכב על החומר שצריך\n\nשם המתרגל/ת: גלינה \nחוות דעת - תרגולים: מעולה, מעבירה את התרגולים בצורה מקצועית ואיכותית, לפעמים טיפה איטית ולא משתיקה אנשים שחושבים שהם הגיעו לשיעור פרטי מספיק מהר \nסה\"כ מתרגלת מצויינת \n\nשעורי הבית: עמוס מאוד וקשוח, בעיקר הגליונות הפתוחים \n\nהמבחן: היה קשה אך הוגן \n\nהשורה התחתונה: להקפיד לעשות שיעורי בית וגליונות לאורך הסמסטר כדי לא להגיע בשוק מוחלט לתקופת מבחנים", "timestamp": 1715704778396}, {"author": "חן השילוני", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: נאדר בבירור לא אוהב את החומר של חדוא 1, מתקשה להעביר אותו בבירור, והרבה פעמים הוא נאבד באמצע מחשבה ועושה טעויות קטנות שלוקחות זמן מהשיעור. בשביל להיות הוגנים, הוא מרצה שבאמת אכפת לו שהסטודנטים שלומדים איתו יעברו את הקורס, והוא יעשה לא מעט על מנת שתבינו את החומר\n\nשם המתרגל/ת: גלינה\nחוות דעת - תרגולים:  בעקרון מתרגלת סבבה, אבל לא קל להיות מתרגל של קורס כזה קשה. היא הביאה לנו כל מיני מודלים של איך לפתור שאלות מסוגים שונים, אבל היא לא ממש הצליחה לכסות כל מה שיכול להופיע במבחן.\n\nשעורי הבית:  היו לנו רק 6 שב, אבל כל אחד ממש ארוך ולוקח לפחות יום או שתיים של השקעה מלאה רק בו על מנת לענות על הכל. עדיין, מומלץ לענות על הכל, שכן רוב מה שמופיע במבחן מופיע בשב.\n\nהמבחן:  לא מבחן פשוט, יש מידי פעם טריקים שעושים לך שצריך הבנה גבוהה בשביל לקלוט. למרות זאת, המבחן מאוד הוגן, שכן רוב מה שמופיע שם מופיע בשב. רק מה חבל, המרצים לא מתואמים בינהם במה מלמדים ומה לא, וזה גורם לזה שבמבחן יכולה לצוץ לך שאלה שאתה לא למדת, אבל יוסי (מרצה אחראי) לימד אצלו. אה וכדאי לזכור זהויות טריגו וגרפים שלהם במבחן, מאוד שימושי ומצפים שתדע אותם מראש\n\nהשורה התחתונה: קורס חובה מאוד קשה ועמוס, עם סגל ענק שלא מתואמים בינם לבין עצמם מה קורה. לצערינו, אין מנוס מחדוא, ולפחות זה לא אינפי", "timestamp": 1715960346934}, {"author": "sahar", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nמאוד מקובע בשיטת לימוד ולוקח זמן עד שהוא מסביר בצורה ברורה, אך הוא כן עונה על שאלות \nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: \nתרגולים בכיתה היו טובים וחלק מהשאלות שפתרנו עזרו המון בפתרון של השב מסבירה טוב ועונה על שאלות\nשעורי הבית: \nבהתחלה הם נחמדים ואחכ נהיים קשים בהגזמה ודורשים מלא שעות, המלצה שלי לעשות רק מה שצריך לעשות ואחכ להסתכל לעבוד בקצב שלך אבל לא בהכרח להגיש\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1716362562800}, {"author": "ערפילית", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: כהן יוסף\nחוות דעת - הרצאות: קונקרטי ובשליטה מלאה.\n\nשם המתרגל/ת: אביטל רבקה \nחוות דעת - תרגולים: קצב מסחרר, פיזיו לפרק כף היד אחרי השיעור. ממליצה להתרכז בטיפים שלה.\n\nשעורי הבית: גליונות יחסית ארוכים בכתב, לתת באפר של כמה ימים לפני ההגשה כדי לעכל ולארגן את התשובות, כדאי להתעכב עליהם (לא יום לפני). ווברק (ממוחשב) לא פשוט.\n\nהמבחן: דומה לגליונות, המועד שלנו היה הוגן לטעמי.\n\nהשורה התחתונה: קורס מורכב, ודורשני - אני הרגשתי מאוימת לפרקים. אבל לא להרים ידיים גם אם ההבנה לא הבשילה וגם לא תבשיל! גם אם אתם/ן לא מרגישים/ות כמו אנשים מתמטיים. יש רפרנסים לטכניקות ולא חסרים חומרי עזר. לא להסס לפנות גם למקורות חיצוניים באנגלית.", "timestamp": 1716394845120}, {"author": "סטודנט באוויר", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: \nיוסי מלמד קורס שיכול להיות הכי משמעמם בעולם בצורה קלילה ונעימה, רב הפעמים יצאתי מהשיעור ולא הבנתי כלום אבל הייתי מגיע אליו קבוע לשעת קבלה עם השאלות מההרצאה ושם נסגרו לי הפינות. ההרצאות של יוסי מאוד עמוסות.\n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים:\n גרשון פנתר, הוא תרגל אותי גם באלגברה לינארית, בחדווא הוא הרבה יותר איטי (בקטע טוב) מסביר עד שכולם מבינים.\n\nשעורי הבית: \nשיעורי הבית מצד אחד עמוסים, צריך להגיש גיליון פתוח עם המון תרגילים ויש גם וובוורקים עם המון מטלות. הבעיה בגליונות שלא כותבים לך על מה הטעות.\nהמבחן: \nהמקצוע נחשב קשה מאוד אבל בסופו של דבר הוא חוזר על עצמו, צריך לפרט ולנמק והמבחן אצלנו היה הוגן הוא מורכב מחלק של שאלות פתוחות, אמריקאי ונכון לא נכון \nהשורה התחתונה: \nיוסי וגרשון מצויינים שמעתי על חדווא דברים מאוד מפחידים, זה קשוח אבל לא משהו בלתי אפשרי, בסוף 80 אחוז עוברים על הפעם הראשונה", "timestamp": 1716496742079}, {"author": "אבי", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות: היה לי קשה מאוד ללמוד איתו, לא מתייחס ברצינות לשאלות, כיתות מפוצצות, מעביר את החומר בצורה לא טובה מספיק אם בכלל\n\nשם המתרגל/ת: רבקה אביטל \nחוות דעת - תרגולים: מדהימה!! הצילה לי את הקורס! כיתות מפוצצות ובצדק! היא רצה בטירוף וצריך להיות ממש בקשב אבל זה אפשרי, היא מסבירה מעולה מתעכבת על שאלות ומוודאת שכולם הבינו לפני שממשיכה\n\nשעורי הבית: קשים וארוכים, כן תורמים להבנה אבל לא בסגנון המבחן  \n\nהמבחן: היה הוגן מאוד\n\nהשורה התחתונה: קורס לא קל בכלל, להשקיע מהתחלה וללכת לרבקה", "timestamp": 1716630373997}, {"author": "אאאאלף", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסף כהן\nחוות דעת - הרצאות: \nהחיובי- יוסי באמת בן אדם טוב, אכפת לו מסטודנטים והוא מוכן ללכת לקראת מי שצריך. ההרצאות מועברות ברוח טובה ועם הרבה הומור. חוץ מזה הוא היה מאוד זמין בווטסאפ וענה לשאלות.\n\nהפחות חיובי- לעתים קרובות הרגיש שאין לו באמת כוח להסביר במהלך ההרצאה ושנמאס לו מהחומר. ההסברים שלו לא תמיד הכי מובנים ודברים שהרגישו לו פחות חשובים או מסובכים הוא הזכיר בדרך אגב והמשיך הלאה.\n\nאישית אני ראיתי ביוטיוב את ההרצאות של צנזור של חדוא 1ת' וזה עזר לי יותר מבחינת הבנת החומר. חשוב לדעת שהחומר לא לגמרי חופף במאה אחוז, ואם יוסי מרצה אחראי אז הוא אומר מה עשוי להיות במבחן ומה לא, אז שווה לבוא להרצאות בכל מקרה\n\nשם המתרגל/ת: רבקה אביטל\nחוות דעת - תרגולים: \nלקח לי קצת זמן להתרגל לקצב ולשיטה של רבקה, אבל מהרגע שהתרגלתי התרגולים היו נפלאים. רבקה מסבירה ממש טוב ומוכנה לחזור על נקודות פחות ברורות. הדבר הכי חשוב זה שהיא מכירה את כל הטריקים וסוגי השאלות, אז התרגולים שלה מכינים ממש טוב לקראת המבחן. הרבה פעמים היא גם מאגדת את כל הכלים שלמדנו בהרצאות במפוזר, וזה ממש עוזר להבין במה אפשר להשתמש איפה. אני ממש ממליץ\n\nשעורי הבית: \nקשים מאוד, אבל אפשר להצליח בהם. מכינים למבחן די טוב.\nלסגל לקח מלא זמן לבדוק אותם, אז תהיו מוכנים לזה\n\nהמבחן: \nהיה הוגן מאוד, על גבול הקל מהרגיל.\n\nהשורה התחתונה: \nקורס קשה ותובעני, הכי קשה שהיה לי הסמסטר. כדי להצליח חייבים להשקיע הרבה זמן ומאמץ, אבל זה אפשרי. תמצאו מתרגל טוב, תשתדלו ללכת להרצאות של המרצה האחראי ותשתמשו בעוד מקורות חוץ מזה (ההקלטות של חדוא 1ת' ביוטיוב/פנופטו, פק\"לים וכו')", "timestamp": 1716738020421}, {"author": "Shahar", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: \nיוסי בן אדם טוב אחד על אחד, וגם הייתה לו קבוצת ווצאפ שהוא ענה לכולם לשאלות עד מאוחר. \nבהרצאות עצמן זה קצת אחרת, הוא לא תמיד סבלני לשאלות והוא לא מסביר הכי טוב (לדעתי), הרבה פעמים הלכתי לראות הרצאות של צנזור ביוטיוב. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מזעזע. הוא רץ בחומר, לא מסביר כל תרגיל עד הסוף וגם אם אתה לא מעתיק אתה לא מצליח לעקוב אחריו. הוא לא מתקשר עם הכיתה בכלל, ככה שצריך ממש להתאמץ כדי לעצור אותו ולשאול שאלה. \n\nשעורי הבית: קשים ממש, אין קשר בינם לבין התרגולים או ההרצאות. \n\nהמבחן: קשה, כמעט ולא היה מבחנים של יוסי משנים שעברו כדי להתאמן עליהם. חיפשו על מה להוריד במבחן. \n\nהשורה התחתונה: קורס זוועה שאם היה מנוהל טוב היה יכול להיות סביר.", "timestamp": 1716829882548}, {"author": "Tom", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: אני אישית כן התחברתי אבל לא כולם ככה. חשוב לו מאוד שנבין ועובד בקצב איטי יותר. ההרצאות תמיד באווירה טובה ובכיף.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אין על גרשון, כדאי לעבוד עם הסיכומים שלו מחשבוניה. התרגול זה מה שחשוב באמת! הרצאות אפשר לפספס חופשי (ולפעמים אפילו לא לנסות להשלים) גרשון עובר על הכל בתרגולים ובתחושה שלי יותר נוח ללמוד חדוא מדוגמאות ולא בתיאוריה\n\nשעורי הבית: נ ו ר א\nפתחתי את הגליונות הפתוחים ארבעה ימים לפני ההגשה ואז הבנתי למה נתנו לזה שבועיים. חשוב לציין שבניגוד לקורסים אחרים זה לא קורס שאפשר להחליט על יום שבו ״אני מתחיל ומסיים״ את השיעורים. זה דורש חשיבה ולא רואים את הפתרון באותו רגע. צריך לחשוב על התרגילים הרבה זמן ודווקא כן כדאי לפרוס את זה על פרק זמן ארוך\n\nהמבחן: היה קל יחסית. אני מאוד הלחצתי את עצמי על הקורס שמרוב שהוא היה קל לא חשבתי על דרכי פתרון כל כך קלות והסתבכתי סתם. ממליץ מאוד לקנות את הפקל של חן הררי! חובה חובה חובה\n\nהשורה התחתונה: מזעזע אבל כולם עוברים את זה, עשו לפניכם ויעשו אחריכם ;)", "timestamp": 1716834591832}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nיוסי הופך את ההרצאות לקצת מעניינות יותר אבל יש הקלטות שלו אז אפשר שלא ללכת\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: אחלה מתרגלת, עונה על שאלות בזמן השיעור אבל לא נלהבת לענות על שאלות על הש.ב בשעות קבלה.\n\nשעורי הבית: \nשיעורי הבית קשים אבל מאוד עוזרים להבין את החומר \n\nהמבחן: \nמועד א היה הוגן ביחס למלחמה (מניח שבזכות המילואימניקים).\nמועד ב היה מזעזע וזה משתקף בהיסטוגרמה שהייתה ועם ממוצע סופי כולל של 51.\n\nהשורה התחתונה: \nאפשר לעבור את הקורס אם לומדים, בעיניי אפשר ללמוד מהאינטרנט יותר טוב. לא לגשת למועד ב'", "timestamp": 1717269073528}, {"author": "בני", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nמסביר לא רע בכלל, אינטראקטיבי.\nאפשר להגיד שההרצאה היא גם על גדר הסטאנדאפ.\nלפעמים אנשים נעלבים ממנו אבל הוא ציני לגמרי ולא צריך לקחת אישית.\n\nיתרון ענקי שלו הוא שהוא פותח קבוצת וואצאפ (בניגוד לתקשורת דרך האימייל כמו רוב המרצים) והוא פעיל בה ואפילו היה זמין לפעמים לשאלות בפרטי.\n\nשם המתרגל/ת: גלינה ליטבינוב\nחוות דעת - תרגולים: \nפחות התחברתי לאופן לימוד, מתרגלים אחרים יותר אינטראקטיביים\nעם הכיתה, גלינה פשוט פותרת תרגילים בעצמה והשיעור מתנהל באופן די מונולוגי.\n\nשעורי הבית: \nדי קשוחים אבל אם תשבו עליהם מספיק פעמים אתם תצליחו.\n\nהמבחן: \nמועד א פייר לגמרי, זה היה סמסטר מלחמה אז ריחמו עלינו.\n\nהשורה התחתונה: \nקורס קשה, אתם תחלמו קצת על אפסילונים בשלב כשלהו בסמסטר, אבל אפשרי לקבל בו ציון טוב. שווה להגיע מוכנים לקורס וללמוד מראש.", "timestamp": 1718763495179}]}