{"posts": [{"author": "עדי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nיוסי מרצה טוב בסך הכל. הדוגמאות שלו לא כל כך ממחישות את הנושא והוא יוצא מנקודת הנחה שאנחנו מכירים את החומר מלפני.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713173797716}, {"author": "ליאור רומנו", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סלאח פתחי\nחוות דעת - הרצאות: \nמאוד מומלץ. מסודר מאוד, רגוע ובונה את החומר אחד על השני כמו שצריך.\nחיסרון: אחרי כל הרצאה הוא לוקח כמובן מאליו שהחומר עד כה הוטמע - לכן מאוד מומלץ לעבור על הרצאה \\ שניים אחרונות לפני כל הרצאה כדי לא לאבד במושגים.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: \nמתרגל מצוין, וסופר רוגע. כל תרגיל מסביר מהיסוד שלו.\nיתרון: מאפשר הבנה מאוד מעמיקה של החומר.\nחסרון: קצב איטי לכן מספיקים פחות תרגילים.\nהמלצה: לבדוק גם את אירנה כמתרגלת ורק אז להחליט - גם היא ממש טובה ומהירה יותר. \n\nשעורי הבית: \nתורמים למאוד להבנת החומר, חשוב לעשות.\n\nהשורה התחתונה: קורס מתמטי מעניין. הכי קשה מבחינה הבנתית אבל גם חומר שאחרי שאתה מבין אותו הוא זורם בהבנה שלו.", "timestamp": 1714208519538}, {"author": "אורי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nאחלה יוסי. לא יודע עם הוא מתאים לכולם, אבל באמת שכיף להגיע להראות עם מרצה שרואים ומרגישים שבאמת אכפת לו מהסטודנטים שלו, ועוד כשהוא מרצה אחראי על קורס ענקי. \n\nיוסי תמיד מוכן לענות לשאלות בהרצאה, בהפסקה, בשעות קבלה, ותמיד זמין בוואצפ האישי שלו ובקבוצה שהוא פותח לכל השאלות. חוץ מזה- אלגברה יכול להיות קשוח ולא מובן מה קורה שם, אז עוזר (לפחות לי) שהמרצאה מתבדח וכל הזמן שובר את המתח. \nרק המלצה קטנה- לא תמיד יוסי כותב הכי מסודר שיש בזמן ההרצאה, אבל כל החומר זמין בכל כך הרבה מקומות ודרכים, שבאמת עדיף לשבת בהרצאה ולהקשיב. את המחברת אפשר למלא אחר כך.\n\nשם המתרגל/ת:  אלון פלדמן/ איילה\nחוות דעת - תרגולים:  אלון היה במילואים חצי מהסמסטר ואיילה החליפה אותו עד שהוא חזר.\n\nאלון מעולה, מסביר ומנגיש את החומר בצורה מובנת מאוד, עונה על שאלות, נותן ומסביר טריקים ואינטואיציות חשובות. \n\nאיילה יותר צ'יטה מאיילה, היא פשוט טסה עם התאוריה והתרגילים, פשוט צריך כל הזמן לעצור אותה לרגע ולבקש שתחזור אחורה ותסביר עוד פעם (היא תמיד נענית לבקשה, פשוט לא להתבייש לשאול)\n\nשעורי הבית: היו 6 גיליונות להגשה בכתב, כל השאלות היו ממבחני אמצע וגמר של שנים קודמות, אז אם מרגישים שצריך רפרנס אפשר לחפור ולמצוא או למצוא תרגילים דומים. \n\nבנוסף היו 6 Webwork , תרגילים יותר חישוביים, מומלץ מאוד לעשות אותם ברגע שסיימתם את החומר הרלוונטי, התרגול הזה ממש חשוב.\n\nהמבחן: לא קל, אבל הוגן. פעם ראשונה שיוסי מרצה אחראי, והוא כתב מבחן שונה מאוד מהבחינות של עליזה מה12 שנים האחרונות. המבנה יותר דומה למבחנים שלו בחדוא. \nלא היו באמת הפתעות במבחן, כל ההוכחות היו מאוד טכניות ובסיסיות של ללכת לפי ההגדרה ומשפטים בסיסים. \n\nהשורה התחתונה: קורס חובה לכולם, הלוואי וכל המרצים שלכם יתנו יחס כמו שיוסי נותן לסטודנטים.", "timestamp": 1714554956582}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: היה סבבה, חומר די יבש. מי שיכול עדיף שילמד מעליזה בקמפוס IL ויחסוך זמן ובלבול.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: אחלה גרשון\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אין לכם ברירה", "timestamp": 1714746495222}, {"author": "עדי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה שכיף להיות בהרצאות שומר על הערנות שלנו, אווירה נעימה ומצחיקה. מאוד אכפת לו שנבין את החומר. לפעמים (זה לא באופן גורר אך היו כמה פעמים שכאלה) מלמד בצורה קצת מבולגנת כל שלא תמיד קל לעקוב ולהבין. סה״כ אחלה מרצה. לא להיבהל מהצעקות, ככה הוא מדבר.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון, מסודר ברור וקוהרנטי.\n\nשעורי הבית: גליונות קשים, ולא בהכרח מסונכרנים עם החומר. לנסות לעשות מה שאפשר ברגע שלומדים את החומר אחרת נוצרים פערים בהבנה בלי לתרגל.\n\nהמבחן: \n\nהשורה התחתונה: סה״כ מאתגר אבל אפשרי. בעיקר חשוב לא לתת לפערים להיווצר, הכל מתבסס אחד על השני ויש המון מונחים שצריך להכיר כך שאם משהו לא יושב טוב מהרצאה קודמת, קשה להבין את ההרצאה אחרי.", "timestamp": 1715039015274}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: יוסי אחלה בן אדם, מצחיק ומעביר את ההרצאה בסבבה.\nהרבה פעמים יוצאים מההרצאות שלו בתחושה של \"לא הבנתי כלום\" (בעיקר לקראת סוף הסמסטר) אבל אחרי שעוברים על החומר שוב זה מסתדר. אם הוא לא מרצה אחראי אין סיבה טובה ללכת.  \n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: אלון מאוד נחמד ומעביר את התרגילים בצורה נגישה ונעימה. לפעמים קצת נשאב לשאלות של סטודנטים ובגלל זה מספיק פחות תרגילים, אבל שווה את זה. \n\nשעורי הבית: ממש סבבה. 6 גליונות ובכל גליון 6 שאלות. 4 מהשאלות סופר טכניות ודי פשוטות, ושתיים טיפה יותר חשיבתיות.\n\nהמבחן: יותר מ-50 אחוז מהמבחן הוא טכני, ככה שלעבור זו באמת לא בעיה. כדאי להשקיע יותר בשאלות חשיבה אחרי שמבינים את הקונספט של השאלות הטכניות.\n\nהשורה התחתונה: קורס סבבה, די עמוס.", "timestamp": 1715094858925}, {"author": "איתן", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא משהו מיוחד, ההרצאות אותו דבר עם כל המרצים (ניסיתי גם את יוסי וגם את פתחי)\nשם המתרגל/ת: \nחוות דעת - תרגולים: ניר אלפסי - מתרגל מצויין מסביר מאוד מפורט וקל להבין\n\nשעורי הבית: הוגנים וקלים יחסית\n\nהמבחן: מועד א' היה לא סביר בכלל, בדרכ הרמה של המבחן היא ברמה של השיעורי בית או פחות (כי עושים בבית ולא נבחנים עם זמן) אבל המבחן היה מלא בהוכחות ולא דומה במבנה לאף מבחן עבר (הוא מן מוטציה של השנים האחרונות ושל לפני עשור)\n\nהשורה התחתונה: נקווה שיהיו הוגנים עם הפקטור", "timestamp": 1715162066225}, {"author": "י", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \nמלמד בבדר סה\"כ עובר על כל החומר בצורה מסודרת אבל קצת מונוטני ולא תמיד מבין את השאלות של הסטודנטים \n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מדהים, הציל לי את המקצוע! מלמד מסודר וברור מביא תרגילים גם ברמה יותר קשה וסבלני לכל שאלה\n\nשעורי הבית: קשים לוקחים מלא זמן וחשובים ברמות\n\nהמבחן: המבחן אצל יוסי היה ממש שונה מהמבחנים של עליזה מה שתפס אותנו קצת פחות מוכנים\n\nהשורה התחתונה:", "timestamp": 1715252538105}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עליזה ביוטיוב\nחוות דעת - הרצאות: לא ללכת להרצאות באמת שיוטיוב יותר מסודר מכל הרצאה אפשר לשים על הילוך 2 דברים טכניים ולחזור על דברים תאורטיים , בסוף קורס עם פעק בין התאוריה לתרגילים ככה שלא תמיד צריך את התאוריה לפעמים אפילו בזבוז זמן. אני תחילת כל נושא שמתי עליזה הילוך מהיר וסיכמתי את המושגים הבסיסים ואז הלכתי לתרגולים כפולים. עזר מאוד לדעתי.\n\nשם המתרגל/ת: אחסאן/גרשון/ארינה\nחוות דעת - תרגולים: בהתחלה הייתי אצל גרשון אבל לדעתי הוא מלמד פחות טוב אלגברה מאשר חדוא. לקראת סוף הסמסטר התחלתי ללכת לאחסאן ובאמת שמרצה תותח על שכיף ללמוד איתו ועובד סופר מסודר. בגלל שהוא לא מספיק הרבה תרגלים שווה להשלים תרגול מהתרגלי סיכום של עליזה ביוטיוב/קמפוסil.\nארינה גם טובה אבל עמוס אצלה בסטודנטים לי זה הקשה.\n\nשעורי הבית: גיליונות חשובים רצח מי שפותר לבד הוא ברמת מבחן. סופר חשוב להבין טוב ותלרגל טוב את ההעתקות וגם להקדיש זמן בסוך הסמסטר לפני התקוךת מבחנים לתרגל לכסוןעע ואז זה 2 שאלות מתנה במבחן. להבין טוב גם את המושגים במרחבים וקטורים כי למרות שזה לא קשה הרבה נופלים על זה.\n\nהמבחן: קל למי שלומד כמו שצריך אין מה להוסיף, צריך להיות טוב במהלך הסמסטר ולתת שבוע + מרוכז לפני המבחן.\n\nהשורה התחתונה: קורס לא קשה, אותי הוא הכי הפחיד במהלל הסמסטר בגלל הכמיות חומר המטורפות והרגשתי שיש מלא משפטים שאני לא זוכר ובלאגן. זה לא ככה. תבינו את המושגים הבסיסים. כשלא הצלחתם תרגיל בגלל משפט תכתבו לכם אותו על דף בצד שתעברו עליו כל כמה זמן. תפנימו כל נושא מהר לפני שעוברים לנושא חדש, וזה קורס שלכם. תהיו רגועים למי שמשקיע במהלך הסמסטר אבל מרגיש לא 100 זה שוקע בתקופת מבחנים. פשוט תדחפו כל הזמן עוד תרגול איפה שצריך. בהצלחה!", "timestamp": 1715453935993}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nניר הוא המרצה הכי טוב באלגברה (כן יותר טוב מעליזה) יודע להסביר טוב מאוד ואכפת לו שהסטודנטים יבינו כל צעד שהוא עושה, דואג להעלות רשימות שלו לכל נושא למודל כדי שלא נאבד אותו בהרצאה תוך כדי כתיבה\nמדבר בטון קצת גבוה אז אל תשבו מקדימה וגם אל תשבו הרבה מאחור כי הכתב שלו קטן מאוד.\nאחלה מרצה והבדיחות שלו איכותיות מומלץ!\nשם המתרגל/ת: \nניר אלפסי\nחוות דעת - תרגולים: \nניר המלךך!!\nאין לי באמת הרבה מה להגיד, המתרגל הזה עשה לי את הסמסטר, חיכיתי לימי שני רק בשביל להגיע לתרגולים שלו! נותן אחלה הרגשה לסטודנטים ויודע את חומר טוב מאוד, זמין לסטודנטים ונותן שעתיים קבלה שבועיות לקורס.\nבנוסף לכל זה הוא דואג לנו לרשימות תרגולים עם משפטים לכל פרק!\nהכיתה לא עמוסה וזה טוב להספק ולהבנה של החומר. לכו רק אליו!!\nשעורי הבית: \nסבירים ועוזרים להבנה ולטכניקה.\nהמבחן: \nהמבחן היה זוועה שלא מהעולם הזה, זאת הפעם הראשונה שיוסי (מרצה אחראי) כותב מבחן באלגברה וזה מורגש, היה מבחן מלא הוכחות ושונה מאוד מהמבנה הרגיל שלו. רואים בבירור שיוסי רגיל לכתוב מבחנים בחדו״א\nהשורה התחתונה: \nקורס טכני מאוד, עד השבוע ה9 לסמסטר החומר נראה באמת קליל ונחמד אבל אחרי זה כל הדברים מתחילים להתחבר ומתחיל להיות קל ללכת לאיבוד, קורס חובה שצריך לעבור אז שווה להשקיע.", "timestamp": 1715453980460}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: יותר ממומלץ! ניר הוא הדוגמה לאדם שאוהב את העבודה שלו וזה מורגש.\nמסביר בצורה ברורה, דואג שיהיו רשימות לפני כל שיעור שזה יתרון מטורף.\n\nשם המתרגל/ת: ניקה פת/ אירנה גורליק\nחוות דעת - תרגולים: בהתחלה הלכתי לאירנה, עד שלא הסתדר לי במערכת, מתרגלת מעולה!!! והלוואי ויכולתי להשאר אצלה.\nגם ניקה ממש טובה (בחדוא היא יותר טובה), מכסה את רוב הדברים\n\nשעורי הבית: ממש בסדר\n\nהמבחן: היה במתכונת שונה משנים עברו, רובו הוכחות, דבר שגרם ליכולת באמת לסיים את המבחן בשלוש שעות ליותר מאתגרת (יוסי אוהב להיות יצירתי)\n\nהשורה התחתונה: להעזר ברשימות של ניר ואם צריך להשלים אז מהסרטונים הישנים של עליזה של התרגולים", "timestamp": 1715496310381}, {"author": "יל", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי כהן \nחוות דעת - הרצאות:  מעביר את החומר בצורה אינטראקטיבית\nלעיתים ממהר ומרגיש שהוא מתעכב על דברים לא רלוונטיים \nסהכ בסדר גמור \n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: מלך העולם, מסדר את כל החומר בצורה מעולה ומסודרת פרקטית ואיכותית\n\nשעורי הבית:  להקפיד לבצע כדי לא להגיע בשוק לתקופת מבחנים \n\nהמבחן: היה קשה משמעותית ביחס למבחני עבר, התמקד בעיקר בהוכחות ופחות בעבודה טכנית, האריך את הזמן של המבחן משמעותית והקשה משמעותית \n\nהשורה התחתונה: קורס עמוס בחומר אבל אפשרי, לטחון מלא מבחני חזרה ולעבור טוב על הוכחות ואיך לכתוב אותן נכון", "timestamp": 1715705013470}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: הרבה פעמים ישנתי בהרצאות, הוא כותב מהר מאוד ולא מפסיק לכתוב וצריך להתמודד איתו, אבל אפשר להעזר בסיכומים משנים קודמות הם לא כל כך שונים, אם מתרכזים איתו מבינים, הוא מסביר הכל, מסודר מאוד, ולא מפספס כלום.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אין על אחסאן, הוא, נסיתי כמה מתרגלים באלגברה וחדו״א, אחסאן הוא הכי טוב, מסביר דרכים טובים מאוד, מסכם, מסדר ונותן הכל, בהתחלה הוא לא ממהר עד שכולם מבינים, כל פעם הייתי הולך לתרגול בהתלהבות להבין.\n\nשעורי הבית: בינוניים, ברמה של המבחן, הרבה פעמים הייתי צריל ללכת לשעות קבלה, אבל תמיד הייתה הבעיה שאני פספסתי משהו בהרצאה או בתרגול\n\nהמבחן: הייתה הפעם הראשונה שיוסי אחראי, אז למדתי מבחני עליזה, ויוסי הביא מבנה חדש לגמרי, מלא הוכחות, לא כל כך קשה, אבל לא הספקתי לענות על כל השאלות, ורבים כמוני.\n\nהשורה התחתונה: היה כיף ללמוד אלגברה, יש מלא טריקים שצריך לדעת, אבל הרעיונות חוזרות על עצמן", "timestamp": 1716229351452}, {"author": "עדן", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מרצה מעולה! מסודר, מסביר ברור ותמיד יש אצלו אווירה בהרצאות.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: אין ספק שגרשון יודע על מה הוא מדבר. שימו לב שהוא לא עוצר לשנייה אז צריך לדעת להתרגל לקצב הגבוה שלו.\n\nשעורי הבית: תואמים את הרמה הכללית של הקורס.\n\nהמבחן: לדעתי הוא לא מאוד מורכב, העניין העיקרי שבקורס עוברים על כל כך הרבה חומר שקשה לדעת להתמקד לנושאים הרלוונטיים, אז הייתי ממליצה לכולם לא להוריד את הרגל מהגז בקורס הזה.\n\nהשורה התחתונה:", "timestamp": 1716725433472}, {"author": "מ", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \nסבבה, אבל בסוף הוא הכין אותנו למבחנים במבנה כמו שהיו כשעליזה הייתה מרצה אחראית, פתר איתנו תרגילים שלה והכל אבל אז המבחן היה שונה לגמרי. לא יודעת כמה הייתי ממליצה.\nבאופן כללי, אם לא עליזה היא המרצה האחראית שלכם אז לכו לשיעורים של המרצה האחראי כי אחרת המבחן יבוא בהפתעה.\nשם המתרגל/ת: אחסאן/ אירנה\nחוות דעת - תרגולים: \nאירנה היא מלכה אבל בשלב מסויים בסמסטר היא לא הסתדרה לי יותר במערכת, אז התחלתי ללכת לאחסאן שהוא גם ממש ממש סבבה\nשעורי הבית: \nיחסית בסדר\nהמבחן: \nחרא, יוסי היה מרצה אחראי פעם ראשונה ולא הסכים להגיד לנו את מבנה הבחינה עד ערב לפני. כל המבחני עבר שתרגלתי כאילו הלכו לפח מרוב שהמבחן היה שונה. בשני המועדים היו מלא פשלות במבחן. במועד ב גם הורידו סעיף של 10 נקודות (אחרי המבחן) וחילקו את הנקודות בין שאלות אחרות. מבאס רצח\nהשורה התחתונה: \nבמהלך הסמטר חשבתי שסבבה אבל במבחן גיליתי שלא :)", "timestamp": 1719844924026}]}