{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: צועק הרבה אבל בקטע טוב ולא עצבני - מרצה די טוב ושמח להתעכב על שאלות. \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת פשוט ממש טובה, מתעכבת על שאלות אם צריך ועם הסברים מאוד ברורים. מתרגלת של תכלס שעוזרת לפתור באופן שיטתי את השאלות.\n\nשעורי הבית: \nלא קשים מידי ולא קלים מידי, הם די סבבה ועוזרים\nהמבחן: \nסביר\nהשורה התחתונה: קורס סבבה, מעט מידי נקז אבל קורס סבבה", "timestamp": 1688812288974}, {"author": "Ori", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: \nמסבירה אחלה (*צריך להתרגל אליה) אבל צריך לבוא חד להרצאות אחרת זה גיבריש.\n\nשם המתרגל/ת: אפרת \nחוות דעת - תרגולים: \nאין על אפרת בעולם. שיעור אחרון טושים עפים באוויר ממליץ להגיע רק בשביל זה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689252362394}, {"author": "s", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עדי ומיכל\nחוות דעת - הרצאות: \nמשעממות וממש לא ברורות\nהייתי אצל , שתיהן נחמדות מאוד אבל לא מסבירות ברור ככ\nבעיני מיכל עדיפה\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: הכל בלחץ אבל זו לא אשמתה זה הקורס שמנוהל בצורה גרועה\nמתרגלת שמסבירה הכי טוב שניתן לדעתי\n\nשעורי הבית: קשים ולא מובנים\n\nהמבחן: עוד לא היה אבל בהצלחה לנו\n\nהשורה התחתונה:", "timestamp": 1689538087222}, {"author": ":)", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכל קליינשטרן\nחוות דעת - הרצאות: \nמאוד מובנת, באה לעזור, מאוד חדה על החומר, נותנת דגשים חשובים, ויותר מכל נלהבת. מאוד מומלצת.\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: \nמאוד מסודרת ומאוד מובנת. די איטית, אז לרוב לא תספיק תרגול שלם בשעה (לא שזה באשמתה - הקורס רק מנוהך בצורה איומה\nשעורי הבית: \nקשים.\nהמבחן: \nלא נורא - להוציא עובר ממש בגדר האפשרי. להוציא 80 ומעלה לעומת זאת..\nהשורה התחתונה: הקורס מנוהל זוועה, אבל מאוד שימושי.", "timestamp": 1690879896210}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דר עדי וולף\nחוות דעת - הרצאות: עדי מעבירה את החומר בצורה מעניינת הבעיה היא שזה קורס חדש שלאף אחד אין מה הולך בה, והיא מאוד מתקשה בלשמור על שקט באולם \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת נהדרת \n\nשעורי הבית: סבירים\n\nהמבחן: מבחן יחסית סביר אם באים עליו מוכנים\n\nהשורה התחתונה: קורס חדש שהסגל לא כל כך סגור עליו גם", "timestamp": 1690895722233}, {"author": ".", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: לא התחברתי כל כך, היא מאוד מבולגנת לדעתי ולא מעבירה את החומר בצורה כל כך ברורה\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: סבירים\n\nהמבחן: היה הוגן אבל לא קל \n\nהשורה התחתונה: קורס מבאס ממש", "timestamp": 1691073750667}, {"author": "תעלול נרמול", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי בן אדם מקסים, וסך הכל מרצה סבבה. היו אצלה לא מעט סטודנטים בהרצאות והיה לה קשה להשתלט על הרעש באולם. הקצב יחסית איטי, אבל לדעתי עדי מצליחה להעביר את החומר בדרך מעניינת \n\nשם המתרגל/ת: אפרת \"צריך לבוא שעתיים מראש כדי לתפוס מקום\" אבירם\nחוות דעת - תרגולים: באופן כללי - התרגולים לא היו בנויים טוב בעיני. בקושי מספיקים 2 תרגילים (ויש פעמים שפחות) והתרגילים בדרך כלל כמעט אותם תרגילים כמו בגיליונות, מה שמצד אחד מקל על הפתירה שלהם, אבל מצד שני לא נחשפים למגוון גדול מספיק של תרגילים.\nחשוב להדגיש שזה לא באשמת אפרת - כל המתרגלים אמורים להעביר את אותם תרגולים. סך הכל אפרת סבבה, אבל יש קורסים שהיא מעבירה בהם תרגולים יותר משמעותיים וייתכן שעדיף ללכת למתרגל פחות עמוס ממנה\n\nשעורי הבית: בשונה משאר המתמטיקות של שנה א', כאן היו רק גיליונות פתוחים בלי וובוורקים. הגיליונות לא פשוטים, הם דורשים הרבה חשיבה, אבל סך הכל לא לוקחים יותר מידי זמן.\nזה שאין וובוורקים זה לא דבר טוב אבל - כי בסופו של דבר המבחן טכני מאוד וחסר תרגול ממוקד של הטכניקה\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס חשוב, רלוונטי ומעניין עם הרבה פוטנציאל להיות טוב, עוד כמה סמסטרים כשיהיה לו פורמט קבוע הוא כנראה יהיה הקורס המתמטי הכי חביב בסמסטר ב'", "timestamp": 1691095543017}, {"author": "11", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: מיכל קלינשטרן\nחוות דעת - הרצאות: הקורס דפוק, עד יומיים לפני מהבחן לא הבנתי מה הולך בקורס. אבל מיכל יחסית הקלה על הבעיות (הרבות) של הקורס וניסתה לעזור עד כמה שהיא יכולה\n\nשם המתרגל/ת: עומר מויאל\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב ועוזר לעשות קצת סדר בראש מכל הבלאגן של הקורס הזה. הבעיה היחידה בתרגולים זה שיש רק שעה וכמעט תמיד לא מספיקים הכול\n\nשעורי הבית: די קשים\n\nהמבחן: היה הוגן יחסית (לראיה הממוצע...), בלמידה טובה בשבוע לפני המבחן היה ניתן לעשות קצת סדר בראש בכל הקורס הזה ולהוציא ציון טוב.\n\nהשורה התחתונה: קורס דפוק, מרגישים ממש שהוא חדש והכל מבולגן, הרגיש לפעמים שגם הסגל לא סגור על עצמו. אבל חובה אז אין מה לעשות...", "timestamp": 1691409384174}, {"author": "ללניה", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nמאוד מבולגן.  הרגיש כאילו הוא לא סגור על החומר שצריך לעבור... מאמין שזה יותר בגלל שהקורס חדש ואף אחד מהמרצים לא ממש ידע מה יכנס ומה לא יכנס...\nשם המתרגל/ת: ראואן\nחוות דעת - תרגולים: \nמעולה, ממליץ בחום, ברורה.\nשעורי הבית: \nקשים מאוד...\nהמבחן: \nלא נורא, אבל עמוס בהגדרות\nהשורה התחתונה: יחסית לקורס של 2 וחצי נקז העומס היה מוגזם והחומר היה מבולגן, מקווה מאוד שיעשו עם זה משהו בסמסטרים הבאים שכן החומר מאוד רלוונטי למי שממשיך בפיזיקה.", "timestamp": 1691481643580}, {"author": "מיכאל חזן", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: איתי \nחוות דעת - הרצאות: \nמבלבל ורץ\nשם המתרגל/ת:  הילה שפלר\nחוות דעת - תרגולים: \nלא מציע להסתמך על התרגולים בכתב שכתובים במודל\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1691612522163}, {"author": "שניר חן", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי מרצה טובה, מאוד מסודרת מסבירה את החומר טוב ואפשר לראות שממש אכפת לה.\nלדעתי אבל היא לא הכי כריזמטית, מה שהקשה עליי להתרכז בחלק מהשיעורים.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: אין על אפרת. מסבירה מעולה בעלת ניסיון ומעבירה את השיעור בצורה כיפית.\nמה שכן, שעה אחת לא הספיקה לתרגול החומר לדעתי.\n\nשעורי הבית: חלק מהגיליונות היו פיריים חלק ארוכים.\n\nהמבחן: המבחן היה פייר באופן כללי. הוא היה פיילוט ולכן היה דברים לא צפויים (הנושא האחרון שלכאורה גם הכי גדול היה רק שאלה אמריקאית אחת, ונושא אחר שהיה בבוחן אמצע היה שאלה פתוחה).\n\nהשורה התחתונה: הקושי של הקורס זה שהוא 2.5 נק\"ז ובו הרצאה אחת של שעתיים בשבוע וזה מקשה מאוד לזכור את החומר במהלך הסמסטר לכן מומלץ לחזור על הדברים כל שבוע לפני ההרצאה.", "timestamp": 1693325782287}, {"author": "Ori Fridman", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: אחלה, מסבירה את הדברים בפשטות\n\nשם המתרגל/ת: אבירם אפרת\nחוות דעת - תרגולים: מעולה! ממש עזרה להבין את החומר במיוחד בקורס המבלבל הזה.\n\nשעורי הבית: לא היו יותר מדי.\n\nהמבחן: רמה סבירה לגמרי. בלי יותר מדי טריקים נטו בדק הבנה של החומר.\n\nהשורה התחתונה: קורס יחסית בסדר, דרש יחסית הרבה השקעה ל-2.5 נקז אבל רמת המבחן פצתה על זה..", "timestamp": 1705230840526}, {"author": "עדי וולף", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עדי\nחוות דעת - הרצאות: \nעדי מרצה מדהימה\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nאין על אפרת\nשעורי הבית: \nקשים קצת\nהמבחן: \nקשה קצת\nהשורה התחתונה: \nמוזר אבל חדש אז אין מה לעשות", "timestamp": 1705346504795}, {"author": "Yuval Maltsev", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: אחת המרצות הטובות שיצא לי לראות, החומר מסודר וברור ותמיד באה לקראת הסטודנטים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי בית: הוגנים, לפעמים יכול להיות טיפה ארוך, אבל אם עושים עם שותף אז יוצא מאוד נחמד ולא עמוס.\n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס", "timestamp": 1713294513992}, {"author": "סטודנט סטנדרטי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: עדי מרצה מצויינת ומסבירה את החומר באופן ברור ודואגת שכולם מבינים מה קורה על הלוח. הרשימות שלה מדהימות והיא נותנת דוגמאות ומוטיבציות לחומר שנלמד בקורס שעלול להרגיש קצת מנותק.\nלפעמים מרגיש שהיא קצת מתעכבת יותר מדי אבל בסוף היא מספיקה את כל החומר הנדרש.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: התרגולים בקורס הזה הם קצת Hit or miss. לפעמים הם מרגישים מיותרים ולפעמים הם פוגעים בול בחומר שצריך.\nהילה מתרגלה טובה אבל לפעמים היו מעברים שהיא לא הסבירה הכי טוב ולעתים יצא שהיא לא הספיקה את כל התרגול. \nהלכתי רק לחצי מהתרגולים והרגשתי סבבה.\n\nשעורי הבית: שיעורי הבית הפתוחים קלילים, אין יותר מדי מה להסתבך איתם והם באמת עוזרים להבין את החומר.\nשיעורי הבית הסגורים (הבחנים הממוחשבים) היו סבבה אם כי קצת מעצבנים לפעמים עם יותר מדי חישובים מיותרים.\n\nהמבחן: המבחנים של עדי עוקבים כולם אחרי תבנית מאוד מאוד קבועה ויש כמה שאלות שאחרי שרואים אותן בהרצאה ואז בתרגול ואז בתרגילי בית כבר זוכרים איך לעשות אותן בעל פה.\n\nהשורה התחתונה: קורס חובה חביב, נותן אתנחתא מסמסטר יחסית עמוס.", "timestamp": 1713428810344}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: \nעדי מאוד מסודרת, יש לה רשימות הרצאה שמסכמות את כל החומר טוב אז נוח לעקוב. דואגת לענות על כל השאלות.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: קצת מעיקים, דורשים יותר זמן מהצפוי. יש 6 גיליונות ומתוכם צריך להגיש 4 למגן.\n\nהמבחן: המבחן היה הוגן, עדי הכווינה קצת ונתנה שאלות דומות לשיעורים. הקורס בעל הרבה חומר למרות הנק\"ז, חשוב ממש לעבור על הגיליונות לקראת המבחן.\n\nהשורה התחתונה: אחלה קורס, הרבה חומר.", "timestamp": 1714591565904}, {"author": "שוסי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עדי וולף (מוקלט)\nחוות דעת - הרצאות: \nלא יכולתי להגיע פרונטלית אז ראיתי הקלטות (מהסמסטר הנוכחי).\nעדי מרצה מצוינת שמסבירה מאוד טוב את החומר ודואגת שכולם יבינו. חסרון אבל שלפעמים היא מתעכבת יתר מדי על שאלות ככה שיוצא שהיו הרצאות שכמעט לא למדנו דברים חדשים.\nלמרות הכל אהבתי והיא בין המרצים הטובים שהיו לי בתואר עד עכשיו.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: \nמתרגלת לא משהו, מדברת חלש ומשעמם. כמעט ולא סיימנו אף תרגול בזמן וכל שבוע נשארנו ל-10-15 דקות נוספות.\nהתרגולים עצמם בנויים ככה שאפשר לקרוא אותם לבד ולהבין יותר בפחות זמן... \n\nשעורי הבית: \nשיעורי הבית הפתוחים ממש נחמדים ולא לוקחים יותר מדי זמן.\nהממוחשבים לעומת זאת ארוכים בחישובים והיו מלא טעויות בגלל שעדי הכינה את הממוחשבים לפני הסמסטר הזה וזאת פעם ראשונה שיש אותם.\nיאמר לזכותה של עדי שכל מי שמצא טעות בממוחשב קיבל נקודה בונוס לסופי.\n\nהמבחן:  היה מבחן קל לדעתי. עדי נתנה המון רמזים מטרימים לגבי איזה דברים ישאלו במבחן ככה שיוצא שהשאלה של הגדרת מושג והוכחה הייתה נקודות מתנה. בנוסף, היו שאלות כמעט אחד לאחד למה שראינו בשיעורי בית.\nגם האמריקאיות היו נחמדות חוץ מ-2 קצת יותר קשות אבל לגמרי פתירות.\nמומלץ ללמוד בעל פה סוגי שאלות שחוזרות על עצמן.\n\nהשורה התחתונה: \nקורס נחמד ולא עמוס בכלל, לדעתי גם די מעניין וככל הנראה גם די חשוב. מה שכן, לדעתי כל החלק של שיטות נומריות הועבר לא טוב - ברמה ממש בסיסית ככה שמרגיש מיותר שמלמדים את זה. לדעתי היה עדיף לפצל לאלגברה 2 ולשיטות נומריות כשני קורסים נפרדים.", "timestamp": 1714592719109}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עדי וולף \nחוות דעת - הרצאות: עדי אחת המרצות הטובות יותר שנתקלתי בהן, ברורה ומובנת, חשוב לה שכולם יבינו והיא מתקדמת בקצב סבבה לא מהר מדי ולא לאט. החומר עצמו קצת מוזר בהתחלה אבל עם הזמן מסתדר \n\nשם המתרגל/ת: הילה שפלר \nחוות דעת - תרגולים: לא התחברתי בכלל, לא מובנת ככ ופותרת דברים מהר ובצורה קצת מסבכת לטעמי. באיזשהו שלב הפסקתי להגיע פרונטלי, ובהקלטות שאפשר להחזיר אותה אחורה הסתדרתי יותר. לא הייתה ברירה אחרת הסמסטר. בכל מקרה עדי עושה הרבה דוגמאות ככה שזה בסדר.\n\nשעורי הבית: קצת מעיקים וארוכים אבל לא הרבה גליונות אז זה יוצא בסדר לאורך הסמסטר. \n\nהמבחן: מבחן ממש הוגן, עדי ממש מכווינה למה שהיא רוצה לשאול אז חשוב להקשיב לה ולעשות מבחנים שלה. \n\nהשורה התחתונה: אחלה קורס.", "timestamp": 1714721107672}, {"author": "ממ\"פ", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עדי וולף\nחוות דעת - הרצאות: מרצה מדהימה.\nעדי גם מעבירה את החומר בצורה מעניינת וגם האווירה במהלך ההרצאות נעימה.\nמאוד אכפת לה מהסטודנטים וכיף לפנות אליה אם יש שאלות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמכינים טוב לקראת המבחן.\nהמבחן: \nהוגן מאוד.\nהשורה התחתונה: קורס ממש מעניין.", "timestamp": 1715585420297}]}