{"posts": [{"author": "Ze'ev", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: עיקר ההרצאות הוא מעבר על משפטים, לפעמים הוכחה שלהם והרבה דוגמאות. הקורס מעט שונה מקורסים אחרים באופי שלו, ולפעמים מרגישים כאילו רצים על המון משפטים ונוסחאות.\n\nשם המתרגל/ת: רז לוטן\nחוות דעת - תרגולים: מתרגל מעולה! התרגולים כולם מכילים את אותם תרגילים כפי שמוצג באתר הקורס מבעוד מועד. לרוב מספיק את כל התרגילים, לפעמים מוסיף תרגילון נוסף, מסביר טוב את החומר ומנהל טוב את הזמן של התרגולים הקצרים (שעה בשבוע)\n\nשעורי הבית: בכל סמסטר יש 4 גיליונות שהם בעלי חובת הגשה (8% מגן) בד\"כ דורשים שעה של השקעה. התרגילים בד\"כ קלים אבל בכל גיליון יש תרגיל אחד קשה שככל הנראה נלקח ממבחן עבר.\n\nהמבחן: בתקופת הקורונה המבחן היה דומה למבחנים הקודמים, 8 שאלות אמריקאיות ו2 פתוחות, המלצה שלי- לתרגל מבחני עבר!! לפתח כמה שיותר את המיומנות הזו של פתרון בעיות. \n\nהשורה התחתונה: קורס נחמד, בשלב הזה של התואר (סמסטר 3) לא קשור בכלל לשאר הקורסים. ממליץ לקחת אותו כקורס טכני ולתרגל לקראת המבחן המון.", "timestamp": 1612424611000}, {"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: פתחי מרצה נחמד, מסודר ומסביר טוב.\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: הילה מתרגלת מצוינת. היא מסבירה טוב וגם נותנת עצות שימושיות למבחן.\n\nשעורי הבית: לרוב קלילים. כדאי לפתור אותם כי יש שאלות דומות במבחן.\n\nהמבחן: במבחן יש מדי פעם שאלות טריקיות ולכן כדאי לתרגל לא מעט בהכנה אליו.\n\nהשורה התחתונה: קורס לא קשה מאוד אך דורש תרגול רב.", "timestamp": 1612792629521}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: משעמם מאד, בקושי משתף את הכיתה אבל יש סיכום של כל מה שהוא אומר מילה במילה כך שאין צורך לרשום בכלל (כולל דוגמאות והסברים).\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מסבירה לעומק, מכירה המון טריקים טובים למבחנים, טובה מאד.\n\nשעורי הבית: לא עשיתי את כל הגיליונות שלא היו חובה ומאד הצטערתי על זה מבחינת ההבנה של החומר, שווה להשקיע כמה שעות בשבוע ולפתור את כל הגיליונות, גם אלו שלא להגשה - עוזר המון במבחן כשיש 2-3 שאלות מתוך שיעורי הבית.\n\nהמבחן: המבחן היה דיי ממוחזר ודומה מאד למבחנים קודמים, שווה לפתור הרבה בחינות מראש.", "timestamp": 1612975452278}, {"author": "E[x]", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רון רוזנטל\nחוות דעת - הרצאות: המרצה הכי טוב שיש בטכניון. לצערי הבנתי שהוא העביר את הקורס באופן חד\"פ\n\nשם המתרגל/ת: איתי זילברמן\nחוות דעת - תרגולים: תרגולים מוקלטים בפונפטו - שווה מאוד! יותר טוב מכל המתרגלים ב\"לייב\"\n\nשעורי הבית: קלים ומרופרנסים\n\nהמבחן: 70% שאלות אמריקאיות, יכולות להיות טריקיות - צריך לתרגל הרבה מבחני עבר כי זה בד\"כ טריקים שחוזרים\n30% שאלות פתוחות - יותר קלות לדעתי\n\nהשורה התחתונה: אחלה קורס, גם חובה בכל מקרה...\nמי שמחשמל ומחליף אותו עם פיזיקה 3 ח' , עדיף לקחת סמסטר אחריו מיד אותות אקראיים כי הוא ממש המשך ישיר שלו", "timestamp": 1624999917828}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: פתחי \nחוות דעת - הרצאות: אותן הרצאות כל שנה, מעביר את החומר בצורה די רובוטית אבל בקורס הזה זה מספיק.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מצויינת. מסבירה הכל כמו שצריך מכוון למבחן ונותנת טיפים לפיתרון תרגילים.\n\nשעורי הבית: יבשים כל שבוע בערך וצריך להגיש גיליון שהם קובעים פעם בכמה שבועות. שאלות לא קשות בכלל, ממוחזרות.\n\nהמבחן: מבחן די חוזר על עצמו בסגנון כדאי לפתור הרבה מבחנים.\n\nהשורה התחתונה: קורס חביב, לא קשה מאוד.", "timestamp": 1627279998533}, {"author": "בובובו-בו בו-בובו", "difficultyRank": 1, "generalRank": 5, "semester": "202003", "text": "שם המרצה: \nיוחאי מעיין\nחוות דעת - הרצאות: \nמרצה מדהים.מסביר ממש מעניין, מאוד מסודר, נותן מלא אינטואיציה. \nלצערי כנראה עוזב את הטכניון.\nשם המתרגל/ת: \nהילה מעיין\nחוות דעת - תרגולים: \nהתרגולים מאוד מסודרים, ועוברים עם סיכום תרגילים מסודר מאוד. הילה מעבירה אותם מעולה, היא מאוד מנוסה ומסבירה היטב.\nשעורי הבית: \nרק 4 הם חובה, תעשו את כולם במילא, 3 שאלות מהמבחן הן שאלות שיעורי בית\nהמבחן: \nלא קל בכלל, זה קורס שלומדים בו שפה חדשה, צריך שזה ישקע ויהיה מאוד אינטואיטיבי, אחרי שעוברים את החלק הזה המבחנים הרבה יותר זורמים.\nהשורה התחתונה: \nקורס מאוד מעניין לדעתי, שהוא לא קל בכלל. צריך לתרגל הרבה במהלך הסמסטר כדי שהחומר ישקע.", "timestamp": 1635665892175}, {"author": "פואסון", "difficultyRank": 1, "generalRank": 5, "semester": "202003", "text": "שם המרצה: יוחאי מעיין המלך\nחוות דעת - הרצאות: מרצה מעולה, נותן דוגמאות ואינטואיציה ורואים שבאמת החומר ממש מגניב בעיניו. \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: נותנת דגשים חשובים בתרגול, קצת מהירה אבל אין מה לעשות התרגולים בקורס הזה הם קצרים מדי. יש אחלה דפי תרגול, אבל הם מאוד מתומצתים.\n\nשעורי הבית: חשובים, יש 3 שאלות שיעורי בית במבחן. רק 4 חובת הגשה\n\nהמבחן: בהתחלה קשה ממש, אבל אחרי שפותרים המוןןן מבחנים נהיים מכונה וזה מבחן טכני בטירוף. למידה רצינית הביאה ציון מושלם\n\nהשורה התחתונה: קורס כיף, מעניין, שרואים בו איך משתמשים במתמטיקה של שנה א גם בשביל דברים \"אמיתיים\" יותר בפעם הראשונה בתואר בערך. אחלה קורס לקיץ", "timestamp": 1635750768358}, {"author": "Bin", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: מרצה בסדר, מאוד מונוטוני\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מתרגלת מצויינת, מסבירה את החומר והאינטואיציה ממש טוב\n\nשעורי הבית: מפורסמים 12 גיליונות (אחד בשבוע), מתוכם 4 היו להגשה. לא ממש עמוס\n\nהמבחן: סטנדרטי והוגן לחלוטין.\n\nהשורה התחתונה: קורס נחמד, לא הכי מעניין בעולם אבל לפחות היה די הוגן.", "timestamp": 1635854236032}, {"author": "hrsi ayhkrni", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: \nמאורגנות והוגברו ברמה גבוה.\nהמרצה נתן מענה טוב ללימוד ההיברידי\n\nשם המתרגל/ת: בילה מעיין\nחוות דעת - תרגולים: \nהמתרגלת נתנה כלים רבים והעבירה את התרגולים בצורה טובה מאוד\n\nשעורי הבית: \n\nהמבחן: \nמבחן יחסית חוזר על עצמו בשנים קודמות אך רמתו גבוהה\nהשורה התחתונה:", "timestamp": 1644915810849}, {"author": "--", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "המבחן: אמריאקאי. הטיפ העיקרי שלי הוא שתתיחסו לכל אמריקאית כשאלה פתוחה. ותשלימו כל חישוב, אל תגידו אני יודע בערך ויהיה בסדר כי אז תיתקעו במבחן על לסיים 80% מהשאלה ולקבל 0% מהנקודות. \n\nהשורה התחתונה: החומר מרגיש קל עד שמתחילים להתחכך עם המבחן. אבל די מעניין.", "timestamp": 1647519393334}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: \nראיתי את המוקלטות על כפול 2 ולא הרגשתי שפספסתי משהו\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: ראיתי את המוקלט כי הכיתה הייתה מפוצצת באופן קבוע, התרגולים טובים ולפעמים יש בהם שאלות מהמבחנים\n\nשעורי הבית: ארבעה גיליונות להגשה מתוך שתיים עשרה, אז לא עמוס בכלל. כן שווה לעשות את כולם לפני המבחן כי הוא כולל כמה שאלות מהגיליונות\n\nהמבחן: סה״כ סביר, עם הרבה תרגול עולים על הטכניקה. \n\nהשורה התחתונה:", "timestamp": 1650038270910}, {"author": "מתפלג בינומית", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \nראיתי במוקלט כפול 2, אחלה מרצה.\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \nרצה בתרגולים בטירוף, אבל סה\"כ סבבה \nשעורי הבית: \n4 שיעורי בית להגשה אבל מומלץ לפתור את כל ה 12 בגלל שחלק מהם מופיעים בבחינה\nהמבחן: \nלא עשיתי\nהשורה התחתונה: \nקורס משעמם, מספיק עם המתמטיקה לא בא ליייי!!!!", "timestamp": 1656968061555}, {"author": "Anonymous", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: הרצאות נחמדות, קצת איטיות\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מדהימה\n\nשעורי הבית: 12 גיליונות מתוכם 4 להגשה, 3 שאלות מתוכן מופיעות במבחן. תורמים מאוד להטמעה של החומר\n\nהמבחן: היה אחלה\n\nהשורה התחתונה: קורס מתמטי נחמד", "timestamp": 1658903612153}, {"author": "לפטר סגל עם 70% נכשלים מ450 סטודנטים", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שעורי הבית: 8% גליונות קלים\n\nהמבחן: שואה גרעינית, ממוצע 50, קרוב ל70% נכשלים לפני פאקטור מביך של 5 נקודות - הממוצע הכי נמוך שהיה אי פעם במקצוע בפער משמעותי.\n\nהשורה התחתונה: סגל מביך ולא מקצועי, 37% עוברים לפני פקטורון של 5 נקודות מעיד יותר על הסגל מאשר על הסטודנטים.\nתעודת עניות לסגל ולבית הטכניון כולו.", "timestamp": 1659355697388}, {"author": "אורן ברגמן", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אדי מהיוטיוב\nחוות דעת - הרצאות: \nטיל\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: \nטילה (טיל בנקבה)\nשעורי הבית: \nחרטא, לא באמת חשובים. כאילו, תעשו את הגליונות כי יש על זה 3 שאלות במבחן אבל זה רק 8 אחוז מגן.\nהמבחן: \nקליל והוגן, יצאתי אחרי שעתיים. \nהשורה התחתונה: \nלבחור שכתב קודם שיש 70 אחוז נכשלים, אתה כנראה לא יודע חשבון בסיסי כי 100-37=63 וזה יותר קרוב ל60 מאשר ל-70. ואם אתה לא יודע חשבון בסיסי איך אתה רוצה לדעת את משפט הגבול המרכזי?\nהיה אחלה קורס, לא הייתי מתנגד לעוד פקטור.", "timestamp": 1659361636810}, {"author": "you all bitches", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: משעמם אבל מסביר טוב\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מבולגנת ולא מסודרת בכלל, אבל מסבירה טוב\n\nשעורי הבית: סבירות\n\nהמבחן:לא להתייחס לחנונים האלה שכותבים, המבחן כמו כל מבחן בהסתברות, תעבוד קשה, תקבל, המבחן לא קל בכלל כמו שאמר זה שכתב לפני, כנראה שהוא למד חודש לפני המבחן ובא להגיד שהיה קל, יש להגיע מוכן היטב כדי לקבל ציון 80+ \n\nהשורה התחתונה: קורס משעמם וגם לא קל, יש לתרגל טונות של מבחנים.", "timestamp": 1659365244776}, {"author": "רוי", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  סלאח פאתחי\nחוות דעת - הרצאות: בתור מרצה הוא איטי ואדיש, הרבה פרשו בשלב מסוים למוקלטות שלו או של יוחאי אנאערף, אבל הוא כן ברור ומסודר, ההרצאות מובנות והדוגמאות אחלה. הוא בנאדם ממש נחמד גם בלי קשר.\nהערה אקסטרה: יש חוברת הרצאות מאוד טובה של פאתחי והוא נצמד אליה כמעט אחד לאחד, פה ושם עושה דוגמאות חדשות ובאופן כללי הרבה מהדוגמאות שהוא עושה רלוונטיות למבחן ולההבנה של החומר.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מאוד מקצועית אבל קצת רצה בתרגולים אז חשוב להיות קשובים ולא להתעסק בשטויות כי אפשר סתם לאבד אותה.\n\nשעורי הבית:  יש 13 גיליונות, מתוכם רק 4 להגשה. כל הגיליונות לא עמוסים ולוקחים בין שעה לשעתיים במידה ואתם על החומר במהלך הסמסטר. אמנם יש רק 4 להגשה אבל 3 שאלות במבחן מבוססות על כל 13 הגיליונות ולכן מומלץ מאוד לעשות את כל הגיליונות.\n\nהמבחן: רוב המבחנים של פאתחי הם סבירים, כלומר ניתן לקבל ציון טוב במידה ולא שונאים הסתברות יותר מדי ולא מזניחים את הקורס. ספציפית המבחן שלנו היה מעט קשה יותר מהרגיל אבל עדיין היה אפשרי להוציא בו מעל 80 גם ללא אהבה להסתברות.\n\nהשורה התחתונה: קורס לא עמוס, מסוג הקורסים שאפשר לעשות עליהם סוג של מרתון לקראת המבחן ולהשלים פערים וחומרים חסרים במידה וזרקתם עליו במהלך הסמסטר(משהו שאי אפשר לעשות לדוגמא באותות ומערכות). מבחינת עניין זה מתחלק לשני גושים - או שאוהבים מאוד ומתחברים לאינטואיציה ההסתברותית או שסובלים, אין באמצע.", "timestamp": 1659800152784}, {"author": "בלתי תלוי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פתחי סלאח\nחוות דעת - הרצאות: ראיתי הקלטות כל הסמסטר,ממש אחלה להריץ על x2, כל החומר עדכני למעט ווקטור גאוסי יש בעיות בהקלטה. יש בדרייב תמלול של ההקלטות האלה, וזה לרוב מילה במילה.\nיש גם הקלטות של יוחאי עם סיכום, אבל לטעמי יוחאי מרחיב יותר מידי אם הקורס הזה לא מעניין אתכם כ\"כ\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: גם מוקלט, תותחית ופרקטית\n\nשעורי הבית: לא קשים, לרוב יש רפרנס בשנים קודמות, לא הכל חובה אבל מומלץ לעשות \n\nהמבחן: היה מבחן קצת קשה מהרגיל, והיה קצת ימים להתכונן, אבל מבחן הוגן סה\"כ. צריך פשוט לפתור המון מבחנים ולהבין את סט הטריקים שיש במקצוע וזהו.\nיש 3 שאלות ש\"ב, אבל אם אין זמן להתכונן חבל לעבור על הש\"ב לטעמי.\n\nהשורה התחתונה: הקורס הכי פחות טובעני בסמסטר 4, אפשר די לזרוק עליו אם אתם לא מתקשים עם קונספטים מתמטיים בדר\"כ", "timestamp": 1661595622099}, {"author": "סטונדט 0", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: X2 במוקלט וזה סבבה, אותי באופן אישי החומר שיעמם.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מעולה, מלמדת בקצב מהיר צריך להיות קשובים. \n\nשעורי הבית: 4 גליונות מרופרנסים להגשה מתוך 12. חשוב לעבור על השיעורים לפני המבחן כי 3 שאלות מהמבחן משם.\n\nהמבחן: לא פשוט בכלל, אבל עם מספיק תרגול לפני אפשר להצליח.\n\nהשורה התחתונה: לא אהבתי אבל זה חובה וחשוב להמשך", "timestamp": 1662277695673}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202103", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: פשוט מעולה!\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון\n\nשעורי הבית: לגמרי עוזרים להבין את החומר\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1667068049743}, {"author": "Diana Shaulov", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: מרצה ממש טוב, מסביר מעולה את החומר ובצורה מעניינת, יש לו רשימות מסודרות וכיף ללמוד אצלו, עונה על כל שאלה.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: התרגולים מאוד מהירים אבל ככה זה בקורס הזה, הילה מתרגלת מדהימה ונותנת המלצות למבחן כבר מהתרגול הראשון, היא מסבירה טוב וקל להבין אותה. הייתי ממליצה להוריד את הרשימות של התרגול מהמודל ולכתוב את הטיפים שלה בתור הערות, כמעט כל טיפ שהיא נותנת עוזר בלמידה למבחן.\n\nשעורי הבית: הוגנים. לא לפחד לרפרנס בגליונות מתקדמים יותר יש טריקים שלא באמת קל לשים לב אליהם.\nאמנם רק 4/12 להגשה אבל כדאי לעשות את כל הגליונות כי בכל מבחן יש כ3 שאלות מהתרגילי הבית (24+ נקודות)\n\nהמבחן: המבחן לא פשוט, אבל אם פותרים הרבה מבחנים הוא הופך להיות טכני. \nשווה לעשות אותו בקיץ כי יש באמת זמן להשקיע.\n\nהשורה התחתונה: קורס לא פשוט, בהתחלה ממש מרגיש כמו שפה חדשה, אפשר להצליח בו ממש אם משקיעים. מומלץ לקחת בקיץ.", "timestamp": 1667069327114}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות:  הלכתי בהתחלה ואז הפסקתי, הוא פשוט קורא מדף ומכתיב על הלוח.. אין מה לסכם איתו, הכל בדרייב.\nממליצה לראות במקום הרצאות של פרופ' מאיר וולף ביוטיוב, נותן ממש אינטואיציה ואפשר גם להריץ :)\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: בסדר כזה, ממש מהירה בגלל קוצר הזמן אז בקושי מצליחים להבין\n\nשעורי הבית: כמה גיליונות מרופרנסים\n\nהמבחן: בסדר, אפשר ללמוד ממש טוב ולהצליח.\nיש נטייה להזניח את הקורס אז כדאי ממש להיות על החומר במהלך הסמסטר.\n\nהשורה התחתונה:", "timestamp": 1669707295383}, {"author": "ירדן", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: \nטוב מאוד\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \nטובה מאוד\nשעורי הבית: \nעומס בינוני\nהמבחן: \nיחסית ממוחזר\nהשורה התחתונה:", "timestamp": 1675427587944}, {"author": "1", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: ההרצאות על הפנים, קשה מאוד להבין אותו, הוא פשוט בא וזורק את החומר בלי יותר מדי הבנה או הרחבה...\n\nשם המתרגל/ת: איתי (זה שמוקלט באולפן)\nחוות דעת - תרגולים: מתרגל סבבה לגמרי, מסביר הבנתית (עד כמה שאפשר בשעה תרגול), התרגולים לוקחים קצת יותר משיעור רגיל כי הוא מעביר אותם לאט אבל הוא בסדר גמור.\n\nשעורי הבית: 4 גליונות חובה להגשה ובדיקה סתם. חבל שלא שמים דגש יותר על שיעורי בית בקורס הזה... \n\nהמבחן: זוועת עולם, יש בו קצת חזרתיות אבל האמריקאי והחוסר במחשבון פשוט הופך אותו ללא הוגן בעליל בנוסף לפעמים הפתוחים קלילים לפעמים לא פתירים אין לדעת לקראת מה אתה מגיע.\nלדעתי במבחן הזה הרבה עניין של מזל על איזה יום נפלתם על מי שכותב את המבחן... מה שנקרא איחלתי לחייל בהצלחה! \n\nהשורה התחתונה: קורס על הפנים, סגל עייף, חובה-אכלתם אותה, בהצלחה!", "timestamp": 1678004227438}, {"author": "Tamir Manoach", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: הוא מרצה בדיוק לפי הסיכום של *אביעד מועלם* מהדרייב\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: אין מתרגלת יותר טובה ממנה בכל הארץ.\nהוא מצליחה לעשות תרגול של שעתיים בשעה אחת\n\nשעורי הבית: כולם ממוחזרים\n\nהמבחן: לא קשה אבל מסובך לפעמים\n\nהשורה התחתונה: קורס סבבה, צוות טוב.\nתבין את החומר ויהיה לך טוב", "timestamp": 1678260973381}, {"author": "C1", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: אחלה סיכומים, קצת מרדים בהרצאות ולא ממש עונה על השאלות בכיתה. יש הקלטות שלו, שעזרו להשלים את החומר שמקרה שלא הייתם בlive \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nכל התירגולים מפורסמים באתר מראש, מאד נחמדה ועוזרת, קצת ממהרת כי יש הרבה תירגולים\n\nשעורי הבית: יש 12 עבודות (אחת בשבוע) אבל מגישים בתכלס 4-5, צריך לענות על כל השאלות שם, אבל רובם ממוחזרים משנים קודמות. כן ממולץ לעשות גם את אלה ללא ההגשה, אם ישלכם כח, כי זה מראה כמה מהר אתם לא שולטים בחומר\n\nהמבחן: \n8 שאלות אמריקאיות - 64 נקודות, בדכ 2 מבוססות על תרגילי בית\n2 פתוחות \nהמבחן מאד קשה, צריך לתרגל פשוט מלא מלא מבחנים לפני, ואז שמים לב שהשאלות חוזרות על עצמם. באתר הם מביאים רק תשובות סופיות, שזה לא ממש עוזר, אז כדאי להסתכל על פיתרונות מלאים בdrive או באתר הסריקות\n\nהשורה התחתונה: קורס קשה, ודי משעמם אבל הוא חובה", "timestamp": 1678862496066}, {"author": "דריל מונרו", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוחאי מעיין מוקלט\nחוות דעת - הרצאות: \nיוחאי מעולה כרגיל, ההרצאות המוקלטות שלו היו מלפני שנתיים אבל החומר עדיין רלוונטי, יש סיכום מוקלד שלו שכדאי להעזר בו לדעתי, עוזר לך להיות על הדברים.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nאגדית, אין מילה אחרת. מצליחה להכניס שעתיים תרגול שאמור להיות במקצוע הזה לשעה אחת. היא מעבירה את התרגול בקצב גבוה, אבל זה הכרחי במקצוע הזה.\n\nשעורי הבית: \n12 גליונות שבועיים במהלך הסמסטר, 4 להגשה. ממליץ לעשות ברצינות, הם עוזרים ליישם את החומר ומראים לך מה אתה יודע ומה אתה לא, ואם נתקעים יש רפרנס. בנוסף, יש 3 שאלות שיעורי בית במבחן, וקריטי לשלוט בהן ולדעת את כל הטריקים שהם לפעמים דורשים.\n\nהמבחן: \nמבחן קשה. הוא בודק הבנה טובה של החומר, והחלק האמריקאי קשוח כי אין הבדל אם ידעת 95% מהשאלה או 0% ממנה. הרגשתי שרק אחרי שתרגלתי מספיק מבחנים (15 ומעלה) התחלתי באמת להצליח, לפני זה תמיד היו 2-3 שאלות במבחן שלא ידעתי איך לגשת אליהן. תתרגלו הרבה ויהיה בסדר\n\nהשורה התחתונה: קורס לא פשוט בכלל אבל מאוד מעניין לדעתי, בטח ביחס לקורס מתמטי. לא עמוס מידי במהלך הסמסטר, אבל המבחן קשה.", "timestamp": 1691003370115}, {"author": "חילזון הפרא", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יוחאי מעיין (מוקלט)\nחוות דעת - הרצאות: לא יודע כמה קריטי בקורס הזה לראות את ההרצאות. בכל מקרה הקלטות של יוחאי רלוונטיות לקורס ואפשר לעקוב אחריהם עם סיכום שקיים כבר.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nלבוא חדים לתרגולים שלה כי הם בקצב מהיר, מספיקה בשעה אחת לעבור על כל החומר ולתת טיפים על הדברים שכדאי לשים לב אליהם.\nשעורי הבית: 4 גליונות להגשה ועוד 8 לא. להכל קיים רפרנס ולא מכביד בכלל. במבחן יש שלוש שאלות מהשיעורי בית אז כדאי להכיר אותם אבל אם עמוס בסמסטר אפשר לוותר וללמוד אותם לפני המבחן\n\nהמבחן: \n8 אמריקאי שאחרי תרגולים רבים אפשר להצליח כמעט את כולם. בסופו של דבר אם עשית מספיק מבחנים כנראה כמעט לכל שאלה ראית כבר גרסה מסוימת. יש עוד שתי שאלות פתוחות שהם סבירות בדרך כלל.\nהשורה התחתונה: לא עמוס במהלך הסמסטר אבל צריך ללמוד למבחן מאוד טוב כדי להצליח", "timestamp": 1691046518104}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לירן רותם\nחוות דעת - הרצאות: אם לירן מרצה - מומלץ ללכת אליו! כיף ללמוד אצל מרצה שבאמת נהנה ללמד. מעבר לזה- מסביר טוב, משתדל לתת אינטואיציה ועונה לשאלות.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: תרגולים מאוד מהירים ועמוסים. הילה נותנת טיפים ודגשים חשובים.\n\nשעורי הבית: 12 גליונות עם 4-5 שאלות בגיליון, מתוכם 4 להגשה. שווה להשתדל לעשות את רוב הגליונות תוך כדי הסמסטר, כי יש במבחן 3 שאלות מהגליונות והרבה שאלות שמבוססות על נקודות מהגליונות.\n\nהמבחן: 8 שאלות אמריקאיות ו-2 פתוחות. הרבה דברים מבוססים על מסקנות מהגליונות! אז להשתדל לעשות את רובם, ואם מפספסים כדאי להשלים במקביל לפתרון מבחנים.\n\nהשורה התחתונה: קורס חובה, סך הכל בסדר.", "timestamp": 1691319592192}, {"author": "a", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: מרצה מצוין , אדיב, מקדיש זמן לשאלות הסטודנטים בהרצאות , אולי בגלל שיש לי רקע מספיק טוב על הרבה נושאים שפתחי מלמד , כמו למשל : תוחלת , שונות וכו' , אז הרבה פעמים הרגיש לי שההרצאות משעממות קצת . \n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים: אחלה מתרגלת , חכמה מאוד , נותנת את התכלס לסטודנטים וזה כל מה שסטודנט  ירצה בכלל מתרגולים , לא רצה בתרגילים כדי לסיים את התרגול אלא מקדישה הרבה זמן לשאלות ! זה נדיר בקורס הזה ולכן רוצו עליה\n\nשעורי הבית: לא כזה נורא (יש בדרייב (: , )\n\nהמבחן: היה בסדר גמור , היה ניתן לתת פקטור אבל ..לא נתנו!\n\nהשורה התחתונה: ניתן להצליח ועוד איך! זה קורס קל", "timestamp": 1691358558074}, {"author": "Grades", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \nלא הכי כריזמטי שיש, אבל מעביר את החומר בצורה ברורה.\nסה\"כ רואים שהוא מבין מה עושה ושהוא מריץ את הקורס כבר שנים.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמעולה, מעבירה את החומר בצורה כנראה הכי טובה שראיתי בפקולטה למתמטיקה, וגם משרה אווירה כיפית תוך כדי התרגולים, שזה פעם ראשונה שהייתי יכול להגיד על איזה מרצה/מתרגל בטכניון אחרי 4 סמסטרים\n\nשעורי הבית: \n12 גליונות, 4 מתוכם להגשה.\nסה\"כ לא קשים במיוחד ולכולם יש רפרנס.\nחשוב לעשות אותם כי יש כמה תרגילים שחוזרים על עצמם במבחן\n\nהמבחן: \nאצלנו היה סביר, אבל חלקם יכולים להיות זוועתיים, תלוי איך פתחי קם ביום שהוא כתב את המבחן.\nסה\"כ, אם עושים את כל הש.ב ואיזה 15 מבחנים אז אמור להיות סביר להוציא 80+.\nהחלק האמריקאי יותר קל לפי דעתי, אבל כל נפילה בו זה -8 נקודות.\nבחלק הפתוח ממה שראיתי, אם הם רואים את התשובה הסופית נכונה בסוף, יתנו לך את כל הניקוד גם עם טעית בכל שלב בתרגיל, \nואם הם רואים תשובה לא נכונה, גם אם זה טעות הכי קטנה לקראת הסוף אז ישר תראה x גדול על הסעיף\n\nהשורה התחתונה: \nסה\"כ קורס יותר קליל משאר המתמטיקות, אני כמעט לא הייתי על החומר במהלך הסמסטר ועדיין סיימתי על 85 מ5 ימי למידה כאשר יום אחד היה נטו לעבור על ההרצאות של פתחי.", "timestamp": 1691765623107}, {"author": "יוסי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: לירן - אחד המרצים הטובים שראיתי, מסביר הכל פשוט מאוד ועם המון אינטואיציה, נותן את המקסימום לסטודנטים, מסביר הכל שוב ושוב עד שכולם יבינו, ובאמת גם נהנה ללמד את החומר רואים עליו את השמחה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: אין על הילה, יודעת להסביר את הנקודות החשובות ולתת את הדגשים הנכונים למבחן, להספיק המון חומר בזמן קצר אבל בצורה מובנת, מושלמת!!\n\nשעורי הבית: קשים אבל עם רפרנס הכל אפשרי\n\nהמבחן: הוגן, אם השקעתם במהלך הסמסטר ועשיתם את הגליונות ובסוף גם איזה 8 מבחנים בערך אז יש לכם סיכוי טוב מאוד\n\nהשורה התחתונה: אהבתי ממש מעניין מאוד", "timestamp": 1691953154928}, {"author": "a", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: פתחי וקצת יוחאי בסוף.\nחוות דעת - הרצאות: \nפתחי מונוטוני להחריד והרצאות מרדימות. תעשו לעצמכם טובה ותראו הקלטות של יוחאי מההתחלה, אני עשיתי את הטעות וראיתי רק את ה3 האחרונות.\nשם המתרגל/ת: הילה מעיין.\nחוות דעת - תרגולים: \nכפי שנאמר הרבה-אין מספיק זמן תרגול בקורס הזה, אבל גם בשעה שיש ללכת רק להילה. מסבירה ויודעת את הקורס בצורה הכי טובה. \nשעורי הבית: \nאמנם שווים לא הרבה במגן ולא תמיד הכי פשוטים, אבל שווה לפתור את כל הגיליונות, כולם כולל כולם! מה שלא ברור ללכת לשעת קבלה של הילה, אין לה בעיה שיבואו גם בשעות קבלה שלה של קורסים אחרים (לתאם איתה לפני) והיא מסבירה את הכל בצורה ברורה. יש 3 שאלות שיעורי בית במבחן שזה המון, ואם פותרים את כולם לפני הן יכולות להיות שאלות מתנה.\nהמבחן: \nכשפותרים את המבחנים הראשונים נראה בלתי אפשרי, אחרי תרגול של הרבה מבחנים והבנה של הרעיון אפשר להוציא ציון סבבה  (סבבה יחסית לקורס, כלומר 70-75 פלוס).\nהשורה התחתונה: \nקורס שיכול להיות יותר טוב אם יהיו לו יותר שעות תרגול, אבל לפחות מסיימים עם הפקולטה למתמטיקה שזאת ברכה גדולה.", "timestamp": 1692009226222}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לירן\nחוות דעת - הרצאות: \nללכת ללירן! מסביר טוב מאוד ועונה על כל השאלות, רואים שהוא אוהב ומבין את החומר פשוט אין עליו! \nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \nנכון שהתרגולים מאוד קצרים אבל הילה מסבירה הכל מאוד טוב ונותנת לנו שיטות איך לפתור את המבחן ולהבין את הטריקים. הרבה פעמים הרגיש לי שאני לא מבינה כלום בקורס הזה אבל כשהלכתי להילה הרגיש לי ממש אפשרי עם קצת תרגול והבנה לחומר.\nשעורי הבית: \nלא קשים במיוחד כשיש רפרנסים, לא משנים אותם מסמסטר לסמסטר אבל כדאי לפתור לבד כי הם ממש ממש חשובים למבחן, באמירקאיות יש אולי 3 שאלות (לא בטוחה) שהם כמו שיעורי הבית ואם אתם חוזרים על שיעורי הבית לפני המבחן וזוכרים הכל אז יש לכם 3 שאלות בכיס (מתוך 8).\nהמבחן: \nבתור מישהי שהלכה לאיבוד באמצע הסמסטר היה לי קשההה ללמוד למבחן במשך 5 ימים, אבל! ביומיים האחרונים לפני המבחן כשכבר עברתי על הרבה מבחנים הרגיש לי מאוד ממוחזר ושזה בהחלט אפשרי. המבחן שלנו היה יחסית קל וסיימתי את הקורס עם הרגשה טובה.\n\nהשורה התחתונה: קורס שנראה מזעזע אבל בהחלט אפשרי, אל תתייאשו ואל תתייחסו לשמועות, אם לומדים ומתרגלים טוב ניתן להוציא ציון טוב.", "timestamp": 1692878213039}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוחאי מעיין במוקלט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: ראיתי מוקלט כי התרגולים שלה היו עמוסים ברמות לא נורמליות, אבל היא מסבירה ממש טוב את החומר\n\nשעורי הבית: יש איזה 4 להגשה לא קשים, ניתנים לרפרונס אם אין לך זמן, המשקל שלהם הוא 8% מגן\n\nהמבחן: דיי חוזר על עצמו בדרך כלל יש שאלה או שתיים יותר קשות מהאחרות ודורשות מחשבה\n\nהשורה התחתונה: קורס חובה והרבה מסתמכים עליו בהמשך", "timestamp": 1705163023765}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פתחי (מוקלטות)\nחוות דעת - הרצאות: \nסבבה על כפול 2\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מהירה מידי וכותבת ממש קטן - קשה מאוד לעקוב\n\nשעורי הבית: קלים ואין הרבה. וובוורק מעיק כי וובוורק.\n\nהמבחן: הוגן אבל מבאס שכמעט הכל אמריקאי וכל טעות זה קנס רציני.\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1714660115911}, {"author": "נורמלי לא תקני", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אדי מאיר-וולף\nחוות דעת - הרצאות: הכי טוב זה לראות את אדי מוקלט ביוטיוב. אין טעם לבוא להרצאות.\n\nשם המתרגל/ת: הילה מעין \nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון!\n\nשעורי הבית: יש 12 גיליונות פתוחים אבל צריך להגיש רק 5 גיליונות ספציפיים שהסגל מודיע עליהם מראש. הגיליונות ממוחזרים ובלי קשר לא לוקח יותר זמן לעשות אותם, אבל אני ממליץ לעשות את כל הגיליונות כי תמיד יש במבחנים לפחות 2 שאלות שמבוססות על שיעורי הבית.\nהסמסטר התנסו פעם ראשונה עם וובוורקים שסך הכל היו די טובים אבל היו בהם לא מעט טעויות. אני ממליץ לעשות את הכל כי זו הדרך הכי טובה לוודא שאתם באמת מבינים את החומר כמו שצריך.\n\nהמבחן: קשה, אבל הוגן. המבחנים של פתחי ברובם חוזרים על עצמם, אם תפתרו מספיק מבחנים אז מאוד אפשרי להוציא ציון סבבה, אבל צריך להיות ממש חדים בשביל להוציא ציון ממש טוב.\n\nהשורה התחתונה: באופן אישי לא כל כך התחברתי לקורס, אבל זה קורס חובה אז אין מה לעשות.", "timestamp": 1715077403714}, {"author": "TT", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: עברתי על רשימות הרצאה ולא הרגשתי שחסר לי משהו . +לקראת המבחן עשיתי פקל בסטדיז - מומלץ בחום. \n\nשם המתרגל/ת: הילה מעין \nחוות דעת - תרגולים: מדהימה. מסבירה ברור, לא מניחה ידע קודם, מאוד down to earth ומאוד מקצועית. \n\nשעורי הבית: בסמסטר הזה היה מגן ולא תקף \nמעט גליונות מומחזרים שקל לרפרנס. וובוורקים מעצבנים אבל לא משהו לא צפוי. \n\nהמבחן: \nביחס לפקולטה למתמטיקה, מקסים. עוקב אחריי מבנה דיי קבוע, כולל שאלות שיעורי בית, 8 אמריקאיות 2 פתוחות שבהן יש הוכחות לא כבדות להוכיח (לא קלות פשוט לא כבדות טכנית לא דורשות פרמול למשל) \n\nהשורה התחתונה: ביחס לפקולטה למתמטיקה סבבה, אבל נמאס לי מהם מאוד. אפשר לעבור בלי לבכות. בשלב הזה אתם כבר יודעים אם אתם אוהבים ללכת להרצאות, לי לא היה צורך פה. יש פקל בסטאדיס והוא מושלם אני ממליץ בחוםם.", "timestamp": 1715083960717}, {"author": "אין", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: דורש המון תרגול \n\nהשורה התחתונה: מעניין אבל לקראת המבחן צריך לפתור הרבה מבחנים", "timestamp": 1715186976405}, {"author": "M", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: \nאולי המרצה הכי טוב שנתקלתי בו עד כה. מסביר מעולה, נותן אינטואיציה טובה. לא מתבלבל אף פעם (מאוד חשוב) ומדבר בגובה העיניים. במבחן שלנו הייתה שאלה שאולי סטודנט אחד הצליח לענות עליה מתוך כל הנבחנים, והוא נתן לנו לגבי זה מענה מנותק לחלוטין. מאכזב.\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nהיא אחלה אבל overrated לחלוטין. אין לי משהו רע להגיד אבל לא הרגשתי שהתרגולים תרמו לי ככ כמו בקורסים מתמטיים אחרים.\nשעורי הבית: \nנחמדים ממש. ממליץ לעשות את כולם ובהקדם, ממש עזר לי לעכל את החומר.\nהמבחן: \n\nהשורה התחתונה: \nאחלה קורס. קצת קרינג' לומר אבל נהניתי. כמו שכבר כתבתי היה סעיף של 9 נקודות שכמעט אף אחד לא פתר (רק סטודנט אחד עקף את הציון 95 במבחן) וזה השאיר טעם קצת מר בפה. אבל כנראה שלא יקרה לכם אז ממליץ!", "timestamp": 1715258421231}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: \nמאוד מונוטוני, אבל ניכר שהוא מעביר את הקורס כבר הרבה מאוד שנים. אפשר להשלים מההקלטות שלו (הוא אומר את אותן המילים באותו הסדר בדיוק). כך או כך, מעביר את החומר בצורה טובה.\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמדהימה כרגיל. גם איתה ניכר שהיא מעבירה את הקורס שנים רבות. בקיאה בכל חלק של החומר ויודעת לענות ולעזור.\nשעורי הבית: \nממוחזרים. קצת קשים, אבל בעיקר לא אינטואיטיביים.\nהמבחן: \nיש כמה שאלות שחוזרות על עצמן במספרים אחרים. חשוב לעבור על מבחני עבר.\nהשורה התחתונה: \nקורס מאוד טכני ומאוד לא אינטואיטיבי.", "timestamp": 1716201171552}, {"author": "הסובל", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: אם יש לכם מוקלט תראו מוקלט זה אותו דבר \n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים:  מתרגלת את זה שנים, כל התרגולים שלה אותו דבר ומוקלטים. אני חושב שעיקר התרגולים זה לעזור לפתור את שיעורי הבית, כל מה שהיא מלמדת ואומרת לקראת המבחן שוכחים ואז לומדים לבד.\n\nשעורי הבית:  החליטו להוסיף ww .... אז שחורות אבל לפחות עוזר לתרגל קצת. את הגליונות הפתוחים תרפרנסו\n\nהמבחן: יש 3 שאלות שיעורי בית אבל אם פותרים מבחני עבר כבר מכירים את כולן. \nהדרך להצלחה היא לתרגל לפחות 12 מבחנים - יש פתרונות מלאים בדרייב.\n\nהשורה התחתונה: קורס חובה אז מה נעשה", "timestamp": 1716322742821}, {"author": "ֶ;", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: פתחי \nחוות דעת - הרצאות: \nמשעממות ומונוטוניות בטירוף \n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: \nחוויה אבל תרגול של שעה שהיא רצה בו ובורחת אחרי. לא הרגשתי שהועיל לי כלכך\n\nשעורי הבית: \nממוחזרים \n\nהמבחן: \nנראה כמו כל המבחני עבר\n\nהשורה התחתונה:\nקורס לא קל שמועבר גרוע והופך אותו ליותר לא קל. לא נהנתי", "timestamp": 1716453490959}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יוחאי מעיין מוקלט\nחוות דעת - הרצאות: טובות, אבל לדעתי מחקו אותם \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מסבירה ממש טוב, ראיתי מוקלט כי בשעה שיכולתי היה עמוס ברמה שאין איפה לשבת ואי אפשר לנשום אחרי שעה בכיתה עברתי למוקלט\n\nשעורי הבית: יש להגיש כמה גליונות בודדים מתוך 10 שבמודל (מפרסמים מראש איזה) ויחסית קלילים\n\nהמבחן: לא התחברתי, ניגשתי רק למועד ב וזו הייתה טעות, הממוצע היה נמוך מהמועד א כשדיברנו איתם על זה נאמר לנו שביחס לזה שיש מלחמה ושהמבחן נדחה הם ציפו שיהיה אפילו נמוך יותר אז זה ממוצע טוב מבחינתם.\n\nהשורה התחתונה: חובה. ודיי מסתמכים עליו בקורסי המשך אז הוא גם חשוב להבנה", "timestamp": 1717010102162}, {"author": "הנפתחת", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ד\"ר פתחי סאלח\nחוות דעת - הרצאות: \nאני די התחברתי, הנפתח מסביר טוב ונותן הרבה דוגמאות של תרגילים, סך הכל ממליצה. חוץ מזה הסתברות זה משעמם אבל אין מה לעשות חייב לקחת...\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: \nמתרגלת תותחית, נותנת אינטואיציה טובה (על אף שאין בקורס הזה) על איך לפתור את התרגילים, מראה מגוון של תרגילים ועונה על שאלות. בחורה חמודה מאוד, מומלץ. \n\nשעורי הבית: סבבה לגמרי, ממליצה להשקיע בהם כי במבחן עצמו אם פתחי אחראי אז 3 שאלות הראשונות הן שאלות ש\"ב מהגיליונות (או מבוססות על- פשוט נתונים אחרים) ואם תפתרו את הגיליונות לבד אני מאמינה שיהיה לכם יותר קל במבחן. סך הכל לא עמוס כל כך, לא את הכל צריך להגיש אבל ממליצה לעשות את כל הגיליונות. \n\nהמבחן: גועל נפש, חרא של דבר. 0 התחשבות למרות שאנחנו בסמסטר מלחמה ושום דבר לא רגיל. נתן במועד א שאלה פתוחה שרק סטודנט אחד בערך הצליח לענות עליה, 9 נק' שהלכו לפח. לא אהבתי בכלל, תנסו לתרגל מלא ולהשתמש בפתרונות המלאים שיש בדרייב שאנשים פתרו. לי זה עדיין לא עזר.\n\nהשורה התחתונה: נראה תמים אבל נתן כאפה של החיים במבחן. אני מבינה שאני יפה וחמודה ובא לך לראות אותי שוב, אבל זו לא סיבה להכשיל אותי במבחן בשביל שאחזור על הקורס...", "timestamp": 1717944299732}]}