{"posts": [{"author": "אינטגרל משטחי מסוג שני", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה טובה, אבל קשה לעמוד בקצב שלה \n\nשעורי הבית: וובוורקים שלוקח נצח לפתור אותם\n\nהמבחן: נגלה בהמשך\n\nהשורה התחתונה: קורס חובה, וכל מילה מיותרת", "timestamp": 1675608138580}, {"author": "Maayan Zilber", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה מעולה! מסבירה באופן ברור את החומר שמהווה הכנה מתמטית מצויינת לפיסיקה 2פ'\n\nשם המתרגל/ת: אין\n\nשעורי הבית: מוקדשת שעת סדנה אחרי ההרצאות לתרגול שיעורי הבית ככה שלידיה עוזרת לפתור את התרגילים למי שמתקשה\n\nהמבחן: הכי בסיסי שיכל להיות, העיקר להבין את החומר ולעבור\n\nהשורה התחתונה: קורס חשוב מאוד ללומדים במסלול פיסיקה-מתמטיקה", "timestamp": 1678806060112}, {"author": "בועז מונטיליה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לידיה \nחוות דעת - הרצאות: לידיה מלכה! מסבירה טוב ממש, משלבת בין פרקטיקה להבנה של העקרונות מאחורי הדברים, מפרטת הכל, ועונה ומסבירה יותר בהפסקות אם צריך.\n\nשעורי הבית: אין כמעט, קצת וובוורק שהוא כיפי ומעניין\n\nהמבחן: אמריקאי, בינארי, עם בונוס מהוובוורק צריך 45 כדי לעבור, מה עוד יש לומר?\n\nהשורה התחתונה: קורס כיפי ומעניין, מכין כמו שצריך :)", "timestamp": 1679167089215}, {"author": "Maayan Zilber", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לידיה פרס הרי\n\nאמ\"לק: קורס חובה לפיזמתיקאים!!!\n\nקצת על הקורס:\nבניגוד לקורסים רגילים כל המטרה של הקורס היא לתת לפיזמתיקאים כלים לפתור תרגילים ובעיות שדורשות חומר של חדוו\"א 2(או אינפי2\\3) ומד\"ר[לומדים בסמסטרים2-3] כדי שיוכלו להסתדר בפיזיקה 2פ'[סמסטר 2], אז בפועל יוצא שלומדים את כל החומר סמסטר או 2 לפני שמגיעים אליו בקורסים ה\"רשמיים\" של מתמטיקה\n\nמבחינת התעמקות בהוכחות והסברים של החומר:\nל-90 אחוז מהחומר שלומדים בקורס מקבלים תשובה של תוכיחו באינפי2/3/מדר א וכו'... אין וכמעט הוכחות אלא הרבה דוגמאות והסברים אינטואיטיביים במקומם כי אין להן זמן בהתחשב בכמות החומר שצריך להספיק\n\nחוות דעת - הרצאות: \nיש כמויות של חומר להספיק ולידיה מעבירה את כולו בצורה מעניינת רלוונטית וברורה, מה שכן בשל כמות החומר קצב הלימוד מהיר מאוד ומספיק שאיחרת ב-5 דק' יש כבר 2 לוחות מלאים...\n\nשם המתרגל/ת: *אין תרגולים*\n\nשעורי הבית:\nהקורס לא באמת עמוס כי הוא שעתיים בשבוע עם שעת קבלה מיד אחרי שבה מתרגלים מטלה בוובוורק על החומר שנלמד באותה הרצאה ואין מטלות חוץ מזה - אני אישית לא השקעתי זמן יותר מ4-5 שעות בשבוע(כולל ההרצאה)\n\nהמבחן:\nהקורס מאוד סלחני, לרוב הוובוורקים יש אינסוף נסיונות כלומר המטרה היא לנסות ולהבין עד שמצליחים ובסוף גם המבחן הוא עובר בינארי ואמריקאי אז באמת ששם לא הקושי\n\nעבור פיזיקאים לא מתמטיקאים:\nמבחינת להמליץ על הקורס לקהל לא מתמטי אני חושב שבמקומות מסויימים תהיה הרגשה שהקורס לא בהכרח מיועד עבורו, אבל לא חושב שזה יפגע יותר מדי כי בסופו של דבר אם הסטודנטים מוכנים להשקיע אקסטרה שעות בשבוע בשביל הכלים האלה אז לדעתי הם הרבה יותר יעילים מהסדנה המתמטית של פיזיקה 1פ'...\nהקטע הוא עבור רוב הפיזיקאים הוא שהם באמת לומדים את החומר במקביל, שמצד אחד מקשה כי לא תמיד הקורסים באותו קצב(אני משער) אבל מצד שני החומר יותר טרי\nאם יש סטודנטים שמצליחים להתייחס לקורס הזה כבונוס -כלים לפתרון בעיות בפיזיקה ולא כתחליף לקורס במתמטיקה אז בהחלט מומלץ\nאם אותו/ה סטודנט/ית יודעים שללמוד את החומר מוקדם ומהר מאוד יגרום להם לבלבול או לשאננות יותר מלעזר אז כמובן שלא הייתי ממליץ להם\n\nהשורה התחתונה: \nזה קורס שמלמד מגוון רחב מאוד של נושאים וצריך להספיק כמויות של חומר - חלק כן נבהלו והיו בשוק מהכמות והעומס\nואני חושב שצריך להתייחס לזה בתור למידה של מלא כלים ולהבין איך להשתמש בהם במקום בתור להבין עכשיו את החומר לעומק...(כי את זה בכל מקרה עושים אח\"כ בקורסי המשך)", "timestamp": 1703696181088}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה מצוינת.\nהקורס עצמו הוא לא קורס טריוויאלי, שמכסה את החומר של אינפי 1-3 בשביל פיזיקה שאמור לפתח אינטואיציה לדברים שלא בהכרח פגשנו, לידיה עושה את זה בצורה מצוינת. מצליחה צהנגיש את המתמטיקה הקשה בצורה מופלאה שעוזרת להבין את הפיזיקה בצורה טובה יותר.\nמאוד מהירה וחובה להיות מפוקסים תמיד או שהלוח מתמלא, תמיד עונה לשאלות ותמיד זמינה.\n\nשם המתרגל/ת: לידיה\nחוות דעת - תרגולים: \nלאחר כל הרצאה יש שעה בה אנחנו עושים את הוובוורק של אותה ההרצאה ולידיה נשארת איתנו כדי לעזור בכל שאלה לכל מי שצריך ונתקל או לא הבין משהו במהלך ההרצאה\nשעורי הבית: \nקלים, לידיה עוזרת בכל מה שצריך.\nהמבחן: \nבדיוק כמו הוובוורק\nהשורה התחתונה: \nקורס מאוד מעניין, תורם להבנה של הפיזיקה, קל, לידיה באמת תותחית.", "timestamp": 1713915041859}, {"author": "ברק", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: לידיה פשוט מושלמת. מלמדת במהירות ככה שזה מאלץ אותך לעמוד בקצב שלה (ולא מהירה מדי ככה שאי אפשר לעמוד בקצב). היא ממש ממש ממש רוצה שכל הסטודנטים יצליחו בקורס ונותנת טיפים איך להצליח בקורס ובכלל בתואר.", "timestamp": 1714048124736}, {"author": "שם או כינוי", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: קצת איטי לדעתי, למרות ששמעתי גם דעות הפוכות. לידיה מאוד נחמדה ועוזרת.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: וובוורקים, שעה בשבוע אולי\n\nהמבחן: ממש לא מסובך, אפשר ללמוד כמה ימים לפני המבחן ולעבור. גם זה עובר בינארי ולידיה ממש מנסה שאף אחד לא יכשל, אז קשה לא לעבור את הקורס\n\nהשורה התחתונה: קורס לא קשה, הסמסטר לא יצא לי להשתמש במה שלמדנו בו אבל שמעתי מאחרים שזה שימושי לפני פיזיקה 2פ", "timestamp": 1715354121237}, {"author": "ד", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: לידיה מעולה, ההרצאות שלה מאוד מתוכננות ובנויות בצורה מאוד ספציפית אבל בצורה טובה מאוד ככה שהכל מוסבר מעולה, לא פעם מישהו שאל שאלה ולידיה אמרה \"הו זה בדיוק מה שנדבר עליו עכשיו\". \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אחרי ההרצאה יש שעה שיושבים בכיתה ועושים את שיעורי הבית והציפייה היא שתסיימו אותם בכיתה. לידיה נשארת ועוזרת למי שצריך עזרה. סה\"כ הם ממש סבבה, לפעמים זה שאלות שממש צריך לשבור את הראש עד שמבינים את הרעיון, לפעמים זה ממש קל, אבל עם פואנטה.\n\nהמבחן: קל אם לומדים את החומר כמו שצריך. המטרה של המבחן, לדבריה של לידיה, הוא \"שכולם יעברו\". רק בודקים שהבנתם מה הדברים שאתם עובדים איתם ושאתם יודעים להשתמש בהם בצורה בסיסית. תהיו על החומר ותשקיעו כמה ימים לפני המבחן ויהיה טוב.\n\nהשורה התחתונה: לדעתי קורס שצריך להיות חובה לכל מי שלומד פיזיקה או שילוב עם פיזיקה. ב2פ ממש בשבוע הראשון כבר משתמשים בחומר של הקורס (שבחדוא 2ת לומדים לקראת הסוף) אז זה שימושי מאוד, והקורס עצמו לא קשה בכלל והוא עם עובר בינארי בכל מקרה.", "timestamp": 1715520570373}, {"author": "Evyatar Reif", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \nכפרה על לידיה הלוואי שתהיה אמא שלי.\nהיא מדברת ממש לאט אבל היא פשוט חמודה וכל השיעורים ממש כיפים. יש שעתיים הרצאה ואז שעה של וובוורק שבדרך כלל מספיקה בשביל לעשות כל מה שהיה צריך.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: המבחן בנוי בשביל שתעבור, צריך 45 (אם עשיתם את כל הוובוורקים שצריך) מתוך 105 שזה ממש הוגן.\n\nהשורה התחתונה: כפרה על לידיה", "timestamp": 1715715391096}, {"author": "ד", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא להרשם לקורס!!! מקסימום תשבו בהרצאות אבל ממש באסה לעשות מבחן אחרי שכולם סיימו כבר. זה נראה קליל בהתחלה אבל זה נהיה סיוט לשבת שם 3 שעות כל שבוע", "timestamp": 1716247742769}, {"author": "Ar No", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות:  ההרצאות היו מעולות, הדבר היחיד שהיה מאתגר זה העובדה שהן התחילו מאוחר מאוד. כל שבוע הרצאה שעתיים ועוד שעה וובוורק בסוף, לידיה מסבירה את החומר מעולה ואחרי זה גם עונה על שאלות במשך שעה עד שעה וחצי בחלק מהמקרים.\n\nשעורי הבית: רק וובוורקים שלרוב נעשים בכיתה. \n\nהמבחן: לא קשה מדי. אם עוברים על החומר שלושה ימים לפני אמורים להיות מסוגלים לענות על כל השאלות ולהוציא 100 בלי בעיה. הציון על הקורס הוא בינארי ואם עושים את הוובוורקים מקבלים 10 נק' מגן, כלומר 45 בשביל עובר בינארי, ככה שגם אם אין לכם כוח ללמוד אפשר לעבור יחסית בקלות.\n\nהשורה התחתונה: קחו את הקורס, עוזר מאוד בסמסטר ב כשמתחילים חדווא 2ת ופיזיקה 2פ, נותן תחושה של טריטוריה מוכרת ומקל מאוד בהתמודדות עם החומר", "timestamp": 1720872477118}]}