{"posts": [{"author": "Jared Goldberg", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתי שפריר\nחוות דעת - הרצאות: איתי מלך. רוב מי שלקח את הקורס עשה איתו אינפי אחד, והוא היה מאוד פתוח איתנו, והציג את החומר אמנם לפעמים בצורה קצת אבסטרקטי ולא נגיש, אך תמיד עם הרבה הומר, סבלנות לשאלות ודאגה להבנה של כולם. ההרצאות היו לרוב באווירה מעולה וכיפית, והפך קורס שיכול להיות מאוד יבש ותכני ליחסית משעשע ונחמד. ככה צריך ללמד מתמטיקה של תואר ראשון! 10\\10\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: גאון ? ללא ספק. עצלן? ללא ספק. שיטה מוצהרת לתרגולים: לבלבל את השכל מספיק זמן שהשיעור יעבור בלי שאף אחד ישים לב למה שקרה. בסדר: לפעמים חשף אותנו לקשרים מעניינים מאוד בין מד\"ל לבים פיזיקה (מה שרוב מי שלקח את הקורס לומד), אבל התרגולים היו פשוט לא רלוונטים בעליל. \n\nשעורי הבית: לא רללונטי בכלל למבחן, ומעט ולא לחומר של הקורס. לפעמים היו שאלות לא פתירות (לא כי הן קשות אלא ממש לא נכונות או לא פתירות). \n\nהמבחן: קצת מוזרים, קצת לא קשורים למד\"ח או לפחות איך שאנחנו למדנו, אבל ייתכן *מאוד* שזה יותר קשור לתרגולים הלקויים\n\nהשורה התחתונה: קורס קצת טכני אבל מאוד חשוב, מרצה מעולה, חבל על המתרגל", "timestamp": 1634915303996}, {"author": "עובר בקושי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אור שליט\nחוות דעת - הרצאות: \nלא התברתי לחומר אבל הוא מרצה טוב.\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: תרגילים טובים, מסביר טוב.\n\nשעורי הבית: קשים מאוד ועמוסים. יש כל שבוע. קשה עד בלתי אפשרי בלי רפרנס\n\nהמבחן: מזעזע, רמה גבוהה להחריד. מהמבחנים שמוציאים את כל החשק ללמוד. גם מועד ב'. גם אחרי שבועות של למידה, גם אחרי שמצליחים מבחנים קודמים, פשוט רמה אחרת מכל השאר.\n\nהשורה התחתונה: מתמטיקאים - לא לבחור. פיזמטיקאים - עדיף לחכות למתי שאור שליט לא מעביר", "timestamp": 1668586538465}, {"author": "פורייה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: בהחלט המרצה הכי טוב בטכניון\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: בהחלט המתרגל הכי זורק בטכניון.\nפשוט ביזיון, כל תרגול הוא איחר, לא היה מתואם בכלל עם יוחאי ותרגל על דברים שלא למדנו. לא זמין במייל, אין שעת קבלה.\n\nשעורי הבית: בעיקר טכניים\n\nהמבחן: פייר בסוף היום.\n\nהשורה התחתונה: אחלה קורס, הרבה אינטואיציה פיזיקלית.", "timestamp": 1690391338574}, {"author": "lihi_ menachem", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוחאי מעיין\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, מעביר את החומר בצורה יוצאת מן הכלל. נותן אינטואיציה, מנגיש את החומר, תמיד מגיע מוכן, נכון וזמין לשאלות. מרצה מעולה! \n\nשם המתרגל/ת: בר תבור \nחוות דעת - תרגולים: הרבה פעמים הגיע באיחור לתרגולים, לא מתואם עם המרצה על החומרים שהועברו בהרצאות. אין שעת קבלה, לא זמין לשאלות. \n\nשעורי הבית: טכניים\n\nהמבחן: הוגן לגמרי", "timestamp": 1690449691422}]}