{"posts": [{"author": "שם", "semester": "201902", "text": "המלצה חמה - לכו לתרגולים של אפרת אבירם - ועדיף הרקים יותר (בדר\"כ נופל על השעות של עליזה מלק, אבל לגמרי שווה לפספס את ההרצאות של עליזה כדי לבוא לתרגולים של אפרת)", "timestamp": 1597247580000}, {"author": "Shahar Itzhaki", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מעבירה מעולה אבל עושה יותר מדי הקלות\n\nשעורי הבית: טובים, לא קשים מדי ומלמדים\n\nהמבחן: ארוך מדי עבור הזמן שמוקצב לו, אבל מלבד זה הוגן\n\nהשורה התחתונה: קורס למופת, מרצה אחראית טובה וקשובה לסטודנטים.", "timestamp": 1597757604239}, {"author": "rita", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "קורס בסיסי, קדם למלא קורסים", "timestamp": 1598094080959}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nעושה אווירה טובה בשיעורים, מסביר את החומר טוב\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה שיש בפקולטה למתמטיקה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347157314}, {"author": "י", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעליזה - מרצה מדהימה וחמודה. עוזרת לכולם\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאפרת המלכה\nשעורי הבית: \nלא עמוסים ופתירים.\nהמבחן: \nהמבחן טכני מאוד - שווה ללמוד ממש טוב כדי להוציא ציון גבוה!\nהשורה התחתונה: \nהקורס הכי כיפי בסמסטר א' לעשות! לא לוותר עליו ולהבין הכל!", "timestamp": 1598380811050}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nקורס מאוד טכני", "timestamp": 1599141218855}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: עליזה מלק \nחוות דעת - הרצאות: עליזה מרצה טובה וקשובה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  הגליונות חופרים אבל שווה להשקיע בהם כי דומים למבחן\nהמבחן: \n\nהשורה התחתונה: עם השקעה סבירה אפשר להצליח בקורס הזה", "timestamp": 1599398728647}, {"author": "און פביאן", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: טובות מאוד\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: טוב מאוד\n\nשעורי הבית: \n\nהמבחן: ברמה טובה ולא קשה מדיי\n\nהשורה התחתונה:", "timestamp": 1601890230451}, {"author": "רון וויזלי", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עליזה המלכה\nחוות דעת - הרצאות: מרצה מעולה ומתרגלת אפילי יותר מעולה (בוידאו)\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: סבבה לגמרי\n\nהמבחן: הוגן אך לא קל\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1603570768162}, {"author": "חוות דעת", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: הרצאות מעניינות ומקיפות את החומר.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: תרגולים מאוד מסודרים, חזרה מהירה על שיעור קודם, משתפת את הסטודנטים בשאלות.\n\nשעורי הבית: חשוב לעשות גם וובוורק וגם גיליונות.\nבערך הם ברמה של המבחן.\n\nהמבחן: מבחן הוגן.\n\nהשורה התחתונה: קורס טכני, חשוב לעשות שיעורים", "timestamp": 1603903819540}, {"author": "Hyunjoon", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות:  מסבירה בצורה מעולה, ויודע לפשט דברים טוב מאוד.\n\nשם המתרגל/ת: עליזה מלק (מוקלט ביוטיוב)\nחוות דעת - תרגולים:  פותרת תרגילים מאוד דומים לתרגילי בית ושאלות של מבחנים, בצורה ברורה, למרות שקצת מהירה.\n\nשעורי הבית: מאוד דומים לאלו במבחן, ותמיד יש שאלת תרגיל בית במבחן.\n\nהמבחן: בכל השנים שבהן עליזה הייתה מרצה אחראית המבחנים חזרו על עצמם מבחינת סגנון, לכן מומלץ בחום לפתור כמה שיותר מבחני עבר כדי להצליח.\n\nהשורה התחתונה: קורס טכני מאוד, הקושי הוא בעומס וכמות המשפטים הגדולה מאוד.", "timestamp": 1605082606764}, {"author": "משה", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nמאד מהירות, דניאלה התקשתה הסמסטר עם הזום והיו הרבה תקלות בגלל זה היו הרבה שיעורי השלמה.  \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nארוכים\nהמבחן: \n\nהשורה התחתונה: אין לכם ברירה", "timestamp": 1612350154045}, {"author": "Anat Geyfman", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מהירה אבל ברורה\n\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: יסודי וברור\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612355010544}, {"author": "dana", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מסבירה טוב ולא ממהרת\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מדהימה, מסבירה טוב מאוד\n\nשעורי הבית: ארוכים אבל לא מאוד קשים", "timestamp": 1612790787422}, {"author": "refael Zilberblat", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דינאלה אבידן\nחוות דעת - הרצאות: \nקצת מבולגנת אבל מסבירה בבהירות וסבלנות\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nמתרגל תותח,מומלץ.\nשעורי הבית: \nארוכים\nהמבחן: \n\nהשורה התחתונה: \nקורס טכני,צריך לעבוד ולהשקיע אבל זה לא בשמיים", "timestamp": 1612795306808}, {"author": "Alen Zilbert", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: הרצאות מצויינות , מרצה מאוד מומלצת \n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מאוד עוזר , ומאוד משתף את הסטודנטים בפתרונות\n\nשעורי הבית: מומלץ לעשות, בגלל שתהיה שאלה משם במבחן וזה עוזר להבין את החומר\n\nהמבחן: \n\nהשורה התחתונה: קורס קשה בסמסטר א' אבל בהשקעה מתאימה בסוף מבינים את הרוב", "timestamp": 1612883085165}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאלה אבידן \nחוות דעת - הרצאות: המרצה רצה על החומר בקצב מסחרר, בקושי הצלחתי לעקוב ולהבין משהו \n\nשם המתרגל/ת: ויויאן לווין \nחוות דעת - תרגולים: מתרגלת פשוט מדהימה\n\nשעורי הבית: רבים, ארוכים וקשים.\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס קשה מאוד", "timestamp": 1613029629537}, {"author": "GG", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: \nמאוד מאוד ברורה, דואגת להבנה של התלמידים ועשתה את הסמסטר המקוון משמעותית פחות קשה משהוא היה יכול להיות במקצוע עם כל כך הרבה חומר\n\nשם המתרגל/ת: ויויאן לאון\nחוות דעת - תרגולים: \nמושלמת, פתחה איתנו קבוצה וענתה באופן קבוע לשאלות גם בשעות מאוחרות ובכללי התאמצה מאוד, מומלצת בחום\n\nשעורי הבית: \nהגיליונות והוובוורקים תורמים מאוד להבנה ודי קריטיים בשביל לעבור את הקורס, אבל דורשים יחסית הרבה זמן לסיים בצורה מעמיקה\n\nהמבחן: \nהמבחן שלנו היה מאוד שונה משנים קודמות והיה דגש מאוד גדול על שאלות אמריקאיות, מה שכנראה מוריד את הממוצע משמעותית", "timestamp": 1613056263916}, {"author": "לא התחברתי", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עליזה מלק ואז אירנה גורליק\nחוות דעת - הרצאות: התחלתי אצל עליזה והרגשתי שהיא מבולגנת ושהייתי תוכי שרק כותב בשיעורים אחרי חודש בערך עברתי לאירנה ושם היה טוב יותר אם כי עדיין לא באמת מעניין.\n\nשם המתרגל/ת: הילה מעיין ואז גרשון\nחוות דעת - תרגולים: הילה מתרגלת טוב ומסודר ועוברת על דברים שמופיעים במבחן כבר מההתחלה אז זה מעולה. קצת עצבנית אז תזהרו עם שאלות.\nגרשון גם אחלה מתקתק ונוגע בכל הרעיונות שצריך להכיר, אבל תדעו שאצלו לא תוכלו להספיק לכתוב אלא רק להקשיב כי זה מצגת וזה רץ.\n\nשעורי הבית: אין הרבה קשר בין מבחן לש.ב. תקוו שתזכרו איך לםתור את שאלת ש.ב. במבחן וחוץ מזה מבחינתי נטו למגן.\n\nהמבחן: היה קשה ולא הוגן בעייני, שינו השנה את הפורמט ככה שהשאלות היותר טכניות יצאו ואלה נקודות די בטוחות אז הממוצע יהיה נמוך יותר ויפקטרו למעלה.\n\nהשורה התחתונה: אני לא אהבתי בכלל את המקצוע הזה, לא יודע אם זה בגללי או בגלל המרצים והקורס אבל הרגיש לי שפשוט זורקים עליי מלא הגדרות ופשוט ממלאים מחברות שלמות בתוכן ספרותי במקום להתמקד בעיקר ולא בהוכחות.\nבסוף לא צריך את כל ההוכחות המיותרות האלה ועדיך ללמוד להוכיח מתרגולים של מבחנים .\nיכלו לעשות את הקורס אחרת אבל בעייני זה הקורס הכי גרוע בסמסטר ראשון, כל הרצאה סבלתי.", "timestamp": 1613209107585}, {"author": "סטודנט מיואש", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: \nאחלה גבר שבעולם משקיע מעצמו ובסוף הקורס גם קבע לנו שלוש שעות קבלה עם תרגילי קצה\nשם המתרגל/ת:  אחסאן\nחוות דעת - תרגולים: \nמתרגל לחכמים בלבד הייתי אצלו כל הסמסטר ולא הבנתי כלום מי שעל זה בחומר הוא לגמרי צריך ללכת אליו אם אתם מתקשים עדיף ללכת לגרשון שמסביר הכל בבדידים\nשעורי הבית: \nעמוסים ולוקחים זמן מומלץ לתת כל ערב כמה שעות\nהמבחן: \nאין חשיבות לקושי כי הוא ממש מהיר צריך להתכונן אליו עם זמנים.\nהשורה התחתונה:", "timestamp": 1613249995785}, {"author": "מקס", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מעולה, מסבירה את החומר באופן ברור וטוב. נותנת המלצות על התמודדות עם המבחנים ועוד.\n\nשם המתרגל/ת: גלעד סופר\nחוות דעת - תרגולים: מתרגל מדהים, מבין את החומר, מסביר אותו אפילו יותר טוב. יוצר אווירה חיובית ונעימה במהלך הסמסטר.\n\nשעורי הבית: שיעורי בית בכתב ארוכים וקשים (בחלקם) ברמה נוראית, אבל מלמדים את החומר, יש הרבה רפרנסים לחצי מהשאלות (אצלנו החליטו להגדיל את כמות השאלות פי שתיים בערך). שיעורי בית בWW קלים ומהירים, לא רעים כדי להתאמן אבל לא משהו מאוד שימושי, במיוחד שיש שיטה לדעת אם התשובה נכונה בלי להגיש. (צריך ללחוץ על \"צפה בתשובות\" או משהו בסגנון ואז זה יראה אם מה שנרשם נכון או לא).\n\nהמבחן: אישית המבחן לא היה קשה מאוד, אבל זה קורס מתמטיקה ראשון אז זה אף פעם לא קל, בכללי רוב החומר מסתכם בנושא האחרון, וחצי ראשון של הקורס זה מבוא מאוד איטי, אז מאוד קריטי להקשיב ולעשות חזרות במהלך החצי השני של הסמסטר כדי לא להתקל במצב בו לא מבינים חומר לקראת המבחן. \nבכללי יש הרבה מבחנים ללמוד מהם עם פתרונות מלאים אז הכל נגיש.\n\nהשורה התחתונה: קורס לא פשוט בכלל, דורש השקעה רבה. יש מרצים ומתרגלים מצויינים, והחומר לא יותר מדי קשה.", "timestamp": 1613384202152}, {"author": "אופק", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: הרצאות זום, אני פחות התחברתי לעליזה, מבולגנת מידי , לא מתעכבת על הדברים החשובים, לפעמים מתעצלת לכתוב או להגיד פרטים קטנים וחשובים. \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: תרגולים מעולים! עברתי אצל כל המתרגלים והוא חד משמעית הכי חד ומדוייק ובהיר.\n\nשעורי הבית: קשים, משקפים את רמת השאלות הפתוחות במבחן.\n\nהמבחן: קשה מאוד אבל אפשרי.\n\nהשורה התחתונה: קורס עמוס אבל מעניין מאוד.", "timestamp": 1613396271470}, {"author": "Noa Dveyrin", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nעליזה מרצה מעולה. הלמידה מרחוק מאתגרת אבל סבירה.\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nאני ממש אהבתי את גרשון, אבל הוא קצת מהיר. לא לכל אחד\nשעורי הבית: \nהרבה וכבדים, מומלץ לקחת בחשבון עומס של לקראת סוף סמסטר ולא לדחות מטלות\nהמבחן: \nהמבחן המקוון היה לא קל. שאלות אמריקאיות מרובות על זמן קצר. באופן כללי, המבחנים שעליזה כותבת די ברמת שיעורי הבית לכן מומלץ לעשות אותם.\nהשורה התחתונה: קורס חביב עם שיעורי בית ששואבים זמן", "timestamp": 1613665585251}, {"author": "מאי", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: \nמושלםםם באמת מעביר את החומר בצורה כלכך ברורה. כותבת על הלוח מסודר ומספיק לתרגל הרבה ביחס לשאר המרצים\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: \nהייתי בתרגול יחסית קטן אז היה מעולה כרגיל\nשעורי הבית: \nיחסית קלילים, ברמה של החומר שעובר בשיעור.\nהמבחן: \nהיה מבחן ממש קשה ללא פקטור אז באסה \nהשורה התחתונה: \nבמהלך כל הסמסטר הקורס באמת היה אחלה רק המבחן היה קשה", "timestamp": 1613823893097}, {"author": "Adam Katav", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: טובות ומסודרות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מעניין אבל אין לכם בחירה גם ככה אז מה חוות הדעת שווה?", "timestamp": 1613890302506}, {"author": "עמית", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את החומר בזמן ובצורה מובנת. סבלנית לכל השאלות ובאמת תענוג להיות סטודנטית שלה. \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת טובה. מעבירה דגשים חשובים. בדר\"כ הכיתה שלה מלאה בהמון סטודנטים אז אין הרבה זמן לשאלות. \n\nשעורי הבית: סבירים יחסית לקורס. לעיתים כמות התרגילים לגיליון מוגזמת.\n\nהמבחן: הוגן לחלוטין. \n\nהשורה התחתונה: קורס מעניין. אני נהניתי.", "timestamp": 1613986241440}, {"author": "ע\"ע", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: אירנה\nברורה, מסודרת, מלמדת עם עניין ומרגישים שהיא אוהבת את מה שהיא עושה. \nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מומלצת למי שעל החומר\nתכינו את האצבעות בידיים לכתוב מהר והרבה כל תרגול\n* מזל שהיא שומרת את המחברת שלה בענן\nשעורי הבית: \nהרבה גיליונות, כל גיליון זה 2 גיליונות ביחד, ועוד וובוורקים, \nאבל בסה\"כ אחלה הזדמנות להוציא מגן למי שמוכן לשבת שעות על זה.\nהמבחן: מבחן על זמנים, מי שמהיר יצליח, מי שאיטי יעשה מועד ב'.\nהשורה התחתונה: אין כלכך בחירה לקורס, אז שיהיה לכם בהצלחה", "timestamp": 1614014922258}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מסבירה את החומר בצורה טובה מאוד אבל מבולגנת מדי לטעמי.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל מצוין. מסביר מעולה ועונה על כל השאלות. הוא די מהיר אז מומלץ למי שמצליח לעקוב ועומד בקצב.\n\nשעורי הבית: עמוסים מאוד בעיקר לקראת סוף הסמסטר. הרבה תרגילים מייגעים ומיותרים אבל יש חובת הגשה :(\n\nהמבחן: היה קשה מאוד ולא הוגן ביחס לשנים קודמות ולא ניתן פקטור. כל מבנה המבחן השתנה בגלל הקורונה, נקווה שיחזור לצורתו הרגילה בסמסטרים הבאים.\n\nהשורה התחתונה: הקורס עצמו מעניין אבל ההגשות והמבחן הורידו לי מאוד מהקורס הזה.", "timestamp": 1614190658631}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אירנה \nחוות דעת - הרצאות: טובה מאוד, אכפת לה מהסטודנטים ומקפידה לענות לכולם, נשארת עוד זמן בשעות קבלה, מעבירה את החומר די מסודר וברור. \n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: מעביר בצורה מסודרת עם הרבה שיטות חשובות שעוזרות, נותן גישה להרבה חומרים שמסכמים את החומר ומראים דוגמאות בצורה טובה. \n\nשעורי הבית: בסמס' הזה ההתנהלות הייתה על הפנים, כל גיליון הגשה היה מורכב מחלקים שמפוזרים בגליונות שונים (תרגיל מפה, תרגיל מפה), חלקם כל הזמן היו צריכים לשנות בהוראות כי נראה שמי שכתב אותם לא הבין בעצמו מה הוא רוצה. \n\nהמבחן: לא הוגן בעליל, וניתן לראות את זה בהיסטוגרמות, שזה הכי נמוך מזה כ10 שנים. צוות הקורס מתעצל לבדוק מבחנים ובטענה דבילית שיש להם 1200 סטודנטים החליטו לשנות את המבנה של המבחן גם בגלל הקורונה לשני חלקים של שעה ורבע, ללא שאלות חישוביות שמראות על הבנה של עיקר הטכניקה שמועברת בקורס (בניגוד לכל המבחנים קודמים), בעיקר שאלות אמריקאיות מכשילות, ומבנה מבחן שבכללי די מכשיל. \n\n\n\nהשורה התחתונה: החומר בקורס יחסית לא קשה להבנה, ניתן להצליח בו. אבל נראה שהסמס' החליטו להקשות על כך כביכול בשביל להראות שזה המקצוע הכי קשה והכי חשוב בסמס' ראשון, או מאיזה סיבה אחרת שהתחשקה לסגל.", "timestamp": 1614198667683}, {"author": "Dani dragon weaver", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: מרצה נהדר. הוא עובר על החומר בצורה איטית וברורה מאוד. מוודא שכולם הבינו ותמיד יסכין לענות על שאלות. הוא ישקיע כדי שכל התלמידין שלו יבינו את החומר בצורה טובה.\nמה שרע: הוא לא מעלה הקלטות אז חייבים להיות נוכחים בשיעור. בנוסף בגלל שהוא עובר על החומר בצורה יסודית כל כך היינו צריכים כמה שיעורי השלמה.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מתרגל מצויין. בתחילת כל תרגול הוא מזכיר את עיקרי החומר מההרצאה כדי שכולם יהיו מעודכנים ויבינו. בנוסף הוא מערב את התמידים בפיתרון התרגילים מה ששומר על כולם קשובים.\n\nשעורי הבית: ארוכים ולוקחים הרבה זמן.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614205188609}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אגא נאדר\nחוות דעת - הרצאות: קל מאוד לאבד ריכוז. קורס מסורבל מאוד, המון הגדרות ונושאים. חשוב מאוד להקשיב. בשלב מסוים איבוד ריכוז ורצון ללמוד בהרצאות האחרונות יכול להוביל לכישלון במבחן.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מסבירה את החומר נהדר. מצמצמת את הפער בהבנת החומר לאחר ההרצאה.\n\nשעורי הבית: ארוכים מאוד וקשים.\n\nהמבחן: קשה ולא הוגן.\n\nהשורה התחתונה: קורס קשה מאוד.", "timestamp": 1614444936240}, {"author": "Salwa Khafaga", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: פתחי סאלח\nחוות דעת - הרצאות: מתאים לסטונדטים עם רקע ומחשבה אלגברית ולא צריכים להיתקע על פרטים קטנים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשיעורי בית: חשוב מאוד להגיש שיעורי בית הן בכתב והן בוובוורק! \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614605423570}, {"author": "ruben fitoussi", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אליזה\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית:100\n\nהמבחן: 91\n\nהשורה התחתונה: מעולה", "timestamp": 1615193748705}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מצוינת שמסבירה את החומר בצורה ברורה ומעניינת ורואים שאכפת לה מהסטודנטים.\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: מצוינת, התרגולים עוזרים מאוד להבנה של החומר שנלמד בהרצאות.\n\nשעורי הבית: ארוכים ולא תמיד קלים אבל תורמים מאוד להבנה של החומר\n\nהמבחן: בסמסטר שלנו המבחן היה במתכונת קצת שונה והתוצאה הייתה פחות מוצלחת והממוצע היה נמוך משמעותית משנים קודמות לדעתי בגלל ששמו דגש גדול מדי על שאלות חישוב שקל מאוד לעשות בהן טעויות (השאלות אמריקאיות) מאשר בשאלות שבודקות הבנה של החומר ובנוסף הזמן לא היה מספיק. אני מאמין שבסמסטרים הבאיחם יופקו לקחים והמבחן יהיה בסדר.\n\nהשורה התחתונה: החומר לא פשוט להבנה ודורש הרבה תרגול מכיוון שהרבה פעמים הנושאים מופשטים ולא ניתן לדמיין אותם בראש אבל בשורה התחתונה הקורס די מעניין. חשוב לעקוב אחרי החומר ולא לצבור פערים כי קשה מאוד להשלים בתקופת מבחנים.", "timestamp": 1615507595043}, {"author": "מיכל", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אירנה מדהימה!!! מסבירה ממש טוב, נותנת דוגמאות להכל, ועושה הרבה סדר. לאורך כל הקורס נתנה טיפים איך היא חושבת שכדאי ללמוד, להטמיע את החומר ולהתכונן למבחן, ולימדה דרכי חשיבה טובות לפתרון תרגילים. ממש אכפת לה מהסטודנטים\n\nשם המתרגל/ת: אחסאן \nחוות דעת - תרגולים: מדהים, מסביר לאט וברור ונותן המון דגשים תוך כדי, יוצר אווירה טובה בתרגול (הצליח אפילו בזום). מוודא הבנה עם כולם ועונה על שאלות. מומלץ ממש\n\nשעורי הבית: ארוכים מאוד, לפעמים גם קשים מאוד אבל בעיקר ארוכים ולוקחים זמן. אבל שווה להגיש הכל כי המגן ממש מעלה את הציון\n\nהמבחן: קשה בלי פרופורציה לכלום, אפשר לעבור אם ממש מנסים להבין כמו שצריך את החומר. כדאי לאורך הקורס לכתוב ניואנסים קטנים כי אלה הדברים שעוזרים במבחן.\n\nהשורה התחתונה: קורס מעניין אבל מאתגר מאוד. מרצים ומתרגלים טובים", "timestamp": 1615575393635}, {"author": "אביתר כהן", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  אחסאן\nחוות דעת - תרגולים:  מתרגל בעל אנרגיה טובה, משאיר אותך מרוכז למשך כל התרגול מומלץ בחום!!\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615722166613}, {"author": "ל", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מצויינת, מסבירה את החומר היטב ועונה על שאלות במידה הנכונה אך לא יותר מדי.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל נהדר, קשוב ומקצועי מאוד, רץ על החומר והתרגילים מהר אך זה יתרון כי ההספק גבוה. פחות מתאים למי שמחפש מתרגל עם קצב נמוך.\n\nשעורי הבית: בסדר, בחלקם דורשים עבודה סיזיפית\n\nהמבחן: מאתגר מאוד בהשוואה לחומר ולשאר הסמסטרים, להיות חדים על החומר\n\nהשורה התחתונה:", "timestamp": 1615837273130}, {"author": "Avi Cohen", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גב׳ דניאלה אבידן\nחוות דעת - הרצאות: מרצה מדהימה, כיפית וקשצת קשוחה כשצריך (לדעתי). קצב טוב, הרבה הרצאות השלמה אבל זה לטובה! הכי חשוב (מבחינתי), היא כותבת מאוד מסודר על הלוח, למדתי ממש טוב מכל הסיכומים של כל מה שהיא כתבה על הלוח וזה הספיק לגמרי!\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: אחלה מתרגל, התרגולים עוזרים מאוד לראות את רוב סוגי השאלות ואיך פותרים אותם, בר אחלה גבר לכו אליו!\n\nשעורי הבית: מלא מלא מלא שיעורי בית... לא קל, אבל מומלץ לא לרפרנס ולנסות כמה שיותר לבד וכמה שיותר מוקדם כי זה מ ל א עבודה.\n\nהמבחן: לא מבחן כיף. אבל אם מתכוננים טוב ומתרגלים מספיק ממבחני עבר אין סיבה לא להצליח! (ממליץ על הפק״ל עם ליטל)\n\nהשורה התחתונה: קורס לא קל בכלל, אבל עם דניאלה יהיה לכם את כל החומר מסוכם מושלם ואז לא תאכלו סרטים מאיפה ללמוד אז ממליץ :)", "timestamp": 1615906218124}, {"author": "א.ק.", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מעולה! ההרצאות מתוכננות ובנויות היטב, היא מסודרת ומספיקה להעביר את החומר אותו תכננה. מסבירה בצורה מסודרת, ברורה ופשוטה, נהניתי בהרצאות שלה.\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: אחלה אחסאן.. מעביר את החומר של התרגול בצורה קלילה ומצחיקה, מלמד דברים מועילים ושימושיים.\n\nשעורי הבית: חשובים וטובים. יכולים להיות עמוסים וכבדים, אבל באמת עוזרים להבנה ולתרגול של החומר\n\nהמבחן: המבחן היה קשה יותר ממבחנים משנים קודמות שפתרתי לפני. בגלל הקורונה חילקו אותו לשני חלקים עם הפסקה ביניהם, שאותי ההפסקה הוציאה מריכוז ואחר כך היה קשה לי לחזור למבחן, אבל זה תלוי אנשים.\n\nהשורה התחתונה: קורס בעיקר טכני ומובנה, שלי זה היה מעולה אבל יש אנשים שפחות מתחברים. הקורס לא פשוט ודי עמוס, אבל אני אפילו נהניתי לפעמים...", "timestamp": 1615993975163}, {"author": "עמית", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מעולה! מסבירה טוב ממש וסבלנית לשאלות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים\n\nהמבחן: הוגן \n\nהשורה התחתונה: קורס טוב, לא קשה מדי אבל כן עמוס. אני אהבתי", "timestamp": 1616011423550}, {"author": "דורימון", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מסבירה טוב, נותנת המון דוגמאות וכותבת הכל על הלוח. קצב מהיר. \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: רץ על החומר ומספיק הרבה תרגילים, מסביר מעולה, הקצב מהיר.\n\nשעורי הבית: יש הרבה שיעורים, חשוב לא לדחות לרגע האחרון. חלוקת הזמני הגשה מוזרה ומעצבנת (לפעמים חודש בין שתי הגשות, לפעמים שבוע...). מי שלא מגיש את המספר המינימלי שנדרש לא זכאי למגן (גם לא חלקי) \n\nהמבחן: בגלל הקורונה המבנה מעצבן - רק שאלות אמריקאיות והוכח/הפרך. זה לא מאפשר בדיקה אמיתית של הידע או מתן ניקוד חלקי ולכן לא מאד הוגן. \n\nהשורה התחתונה: קורס סבבה, התנהלות מתסכלת ומבחן מעצבן", "timestamp": 1616242454906}, {"author": "גבי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: בסך הכל ממש נחמד להקשיב לה, עלולה להיות קצת מבולגנת מבחינת סדר כתיבה ורצף.\n\nשם המתרגל/ת: גרשון שמעון\nחוות דעת - תרגולים: התרגולים ברמה ממש גבוהה, שמעון מכיר את החומר מעולה והעביר אותו בצורה טובה. קבצי הסיכום שלו כוללים גם שאלות לתרגול נוסף.\n\nשעורי הבית: לא מאוד קשים ותכלס עוזרים להבין את החומר טוב. מומלץ לעשות אותם גם כדי להיות על החומר\n\nהמבחן: לא קל, אבל בוחן בהגינות את החומר שנלמד.\n\nהשורה התחתונה: במאמץ לא מאוד גדול אפשר להיות על החומר ואפילו להנות מהקורס.", "timestamp": 1616271509317}, {"author": "E.Gerber", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: מרצה ממש טוב, מומלץ ביותר!\n\nהשורה התחתונה: קורס חובה, מה זה משנה אם ממליצים עליו או לא?", "timestamp": 1625058733469}, {"author": "Assaf Levanon", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nמתרגלת מצויינת, משקיעה המון בסטודנטים ומסבירה מעולה\nמעודדת השתתפות בתרגולים\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1625769659086}, {"author": "נ.ה", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nסך הכל אחלה של מרצה אך לדעתי ההרצאות מיותרות ועדיף ללמוד מהספר של הקורס שהוא מצוין \nשם המתרגל/ת: ויויאן \nחוות דעת - תרגולים: אחלה מתרגלת , התרגולים לדעתי כן חשובים כי מראים איך לפתור תרגילים \n\nשעורי הבית: לא קשים במיוחד לדעתי עבודה של שעות [ גם על הוובוורק וגם הגיליונות ] \n\nהמבחן: לדעתי המבחן מאוד הוגן , ובפועל לא בודק איזהשהו הבנה מטורפת , אם זאת אני הייתי כן עובד בעיקר על החלק של ההוכח/הפרך ושאלות אמריקאיות מכיוון ששם החלק שבו הרבה נופלים וזה בעיקר על שטויות וזה חבל \n\nהשורה התחתונה: קורס בעיני כיפי וגם החומר מאוד מעניין בעיני ולכן תקחו אותו בקלות", "timestamp": 1626011648445}, {"author": "ג", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מסבירה טוב, בסדר גמור.\n\nשם המתרגל/ת: בר תבור\nחוות דעת - תרגולים: מסביר מפורט ולא רץ יותר מדי. סבבה לגמרי.\n\nשעורי הבית: עמוס מאוד, וובוורקים + עבודות להגשה. כנראה בין הקורסים העמוסים ביותר בשנה א. \n\nהמבחן: קשה מאוד, מבחן שמטרתו לסנן. תתחילו ללמוד מוקדם ככל שניתן ותדאגו להשלים פערים תוך כדי סמסטר.\n\nהשורה התחתונה: ברוך שפטרנו מעונשו של זה", "timestamp": 1626603202882}, {"author": "לידור זינו", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: טובה מאוד\n\nשם המתרגל/ת: מרים וולך\nחוות דעת - תרגולים: טובה מאוד, מסבירה, מעמיקה\n\nשעורי הבית: פתירים - מספיק להבין מה קורה בהרצאות ובתרגולים פעם אחת כדי להצליח לפתור גיליון בנושא\n\nהמבחן: לא קשה מדי לא קל מדי, בדיוק ברמה המצופה\n\nהשורה התחתונה: מומלץ למי שצריך אלגברה א'/אלגברה 1/אלגברה 1מ", "timestamp": 1626802266588}, {"author": "luffy", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: היא מרצה ברמה טובה, אך לדעתי אפשר לוותר על ההרצאות ולקרוא את ספר הקורס שהוא מצוין \n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: אחלה של מתרגלת, על התרגולים אני ממליץ לא לוותר\n\nשעורי הבית: לוקחים זמן אך לא יותר מדי והם לא כאלה עמוסים\n\nהמבחן: בעיני מאוד הוגן , אני ממליץ לעבוד על החלק של ההוכח/הפרך ושאלות אמריקאיות כי שם נופלים לא מעט נקודות וחבל \n\nהשורה התחתונה: אחלה של קורס , אני ספציפית נהנתי ממנו .\nאין בקורס הזה לבנות על פקטור", "timestamp": 1628342327108}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: נוטה להיות לא מסודר, אבל נחמד סהכ. לא הייתי ממליץ לכל אחד\n\nשם המתרגל/ת:  הילה מעיין\nחוות דעת - תרגולים: למי שבא לו לרוץ על החומר עם כמה שיותר טריקים ותכלס - הילה מושלמת\n\nשעורי הבית: ארוכים ועוזרים להבנה\n\nהמבחן: \n\nהשורה התחתונה: חובה :)", "timestamp": 1643898907900}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: נאדר אגא\nחוות דעת - הרצאות: אין על נאדר בעולם. תמיד נותן מקום לשאלות, עוזר לסטודנטים ומלמד את החומר בצורה מעניינת עד כמה שניתן\n\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: תותח! מעביר את החומר בצורה טובה וברורה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643980887612}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מסבירה את החומר ממש טוב וסבלנית לשאלות והסברים נוספים אם צריך.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת מדהימה, מסבירה מעולה ומספיקה לכסות הכל למרות שלא רצה בתרגולים.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644050524506}, {"author": "יוסף בן", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה טובה אבל כותבת לא מסודר ולא תמיד ברור מה היא רוצה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: המתרגלת הכי טובה ביקום\nמסבירה פצצה, ברור וחד.\n\nשעורי הבית: הש.ב. מעולים עוזרים להבין את החומר כמו שצריך.\n\nהמבחן: \n\nהשורה התחתונה: קורס טכני בעיקר. צוות מעולה.", "timestamp": 1644152770176}, {"author": "ח", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: הרצאות של צנזור ביוטיוב (באנגלית)\nחוות דעת - הרצאות: זה צנזור, אז הרצאות שלו תמיד טובות. הוא מסביר בצורה טובה, ולמרות שזה באנגלית זה ממש לא דורש בקיאות מוגזמת בשפה. הוא מסודר מאוד, וגם ההקלטות מחולקות לפי נושאים בצורה יעילה.\n\nשם המתרגל/ת: הילה מעין\nחוות דעת - תרגולים: לפעמים קצת איטית, אבל מתרגלת טובה בסך הכל.\n\nשעורי הבית: \nלא קשים מדי\nהמבחן: קשה, אבל אמור להיות תואם לחומר הנלמד ולשאלות ש\"ב\n\nהשורה התחתונה:", "timestamp": 1644156340052}, {"author": "/", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: מרצה מעולה, מאוד נהניתי בהרצאות שלו. קצת מתפזר לפעמים לטעמי אז אפשר לאבד אותו. ממש ממליצה לעבור על הסיכומים של ההרצאה הקודמת לפני כל הרצאה- זה מקל מאוד.\n\nשם המתרגל/ת:  ניקה פת\nחוות דעת - תרגולים: מתרגלת מצויינת וממש רואים שהיא מבינה את החומר שהיא מעבירה לעומק אבל כן קצת רצה בתרגולים אז לדעתי פחות מתאים למי שרוצה קצב יותר איטי :) לקראת הסוף למדתי מהקלטות \n\nשעורי הבית: וובוורקים וגיליונות, יחסית עמוס.", "timestamp": 1644232884348}, {"author": "גיא וילקומירסקי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: מרצה טובה, כותבת קצת מובלגן על הלוח. סבלנית ועונה על שאלות \n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מעולה! אנרגטית מאוד והתרגולים שלה ממש עוזרים להבין את החומר\n\nשעורי הבית: לא פשוטים אבל מכינים טוב למבחן ונוגעים בכל סוגי השאלות\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס עם הרבה חומר תיאורטי, חשוב להיות עליו במהלך הסמסטר", "timestamp": 1644255644589}, {"author": "אלמוני", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: דניאלה מעולה, אבל כותבת קטן\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: הילה שפלר מדהימה!\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס טכני", "timestamp": 1644327410953}, {"author": "אנונ'", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות:  \nלא ממליץ, ממהרת לרוץ קדימה בהסברים לא ברורים, בעיקר מתעסקת בלהראות דוגמאות טובעניות ומקווה שאנשים יבינו מהדוגמה.\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nמתרגלת מעולה, אבל קצת איטית, מצד אחד נותנת יחס לכל אחד ודואגת שכולם יבינו, אבל זה יוצר לפעמים עיקובים מיותרים וצורך בהשלמות. אם לא איכפת לכם להתקדם קצת יותר לאט, אז אין מצב לצאת מהתרגול שלה בלי להבין את החומר.\nבנוסף יש לה את המצגות שלה שהם חומר עזר מצויין במיוחד למי שמשתמש בטאבלת כמחברת.\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644368983902}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה ממש טובה ומקפידה שכולם יבינו אבל עושה הרבה הוכחות שלא בהכרח חשובות ככה שאפשר לאבד בהרצאות מסוימות\n\nשם המתרגל/ת: אפרת אבירם \nחוות דעת - תרגולים: המתרגלת הכי מושלמת שיש. דואגת שכולם יבינו ואנרגטית בטירוף עם ממש תשוקה למתמטיקה\n\nשעורי הבית: קשים וארוכים\n\nהמבחן: קשה אבל קצת פחות מהשיעורי בית והמבנה שלו אותו מבנה כבר כמה שנים וגם רמת הקושי פחות או יותר קבועה לאורך השנים\n\nהשורה התחתונה: קורס קשה וטכני", "timestamp": 1644765468963}, {"author": "מילר", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nללכת רק אליה! היא המרצה האחראית אז יודעת להכווין בדיוק לדברים שהכי חשוב לדעת (ולפעמים זורקת רמזים למבחן).\nמלמדת את החומר הכי טוב בפער ניכר. לא לוותר עליה.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: הוא קצת מוזר בהתחלה, אבל מתרגל מעולה. אוהב להתחיל לפתור תרגילים בלי לעשות דיון בכיתה על הפתרון אז יש כאלב שיראו בזה חיסרון. מצד שני מספיקים מלא תרגילים בזכות אז אז תלוי אם אתם אוהבים את הדיונים שלפני הפתרון או לא.\n\nשעורי הבית: \nעוברים טוב על החומר וגורמים לו להיכנס כמו שצריך.\n\nהמבחן: \nקשה פצצות לצערי, אבל וולקאם טו טכניון הרי.\n\nהשורה התחתונה: \nלאורך הקורס נראה שהוא \"רק טכניקה\" (בטח בהשוואה לאינפי למשל) אבל בסוף מגלים שיש המון חומר ושהכל מתערבב ביחד וזה לא פשוט בכלל. לא לזלזל!\n#רק_עליזה", "timestamp": 1644821881585}, {"author": "Saar Levy", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מרצה מדהימה. יחסית מהירה אז צריך הרבה ריכוז לעקוב אחריה אבל עדיין הייתה המרצה האהובה עליי כל הסמסטר.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: בעלת המון ניסיון מביאה דוגמאות ותרגילים מאוד מאוד שימושיים לשיעורי בית.\n\nשעורי הבית: וובוורקים לא קשים מדי ובאורך יחסית בסדר. גליונות פתוחים ארוכים מאוד אבל גם כן לא קשים מדי.\n\nהמבחן: הוגן מאוד אם הייתם על החומר ועשיתם את שיעורי הבית. בכל זאת לא פשוט ויחסית ארוך ל3- שעות.\n\nהשורה התחתונה:", "timestamp": 1644926962505}, {"author": "סטודנטית ממוצעת", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: עליזה מרצה ממש מעולה! מעבירה את החומר מעולה אבל לפעמים מאוד מהר. לא פשוט לעקוב אחרי ההרצאות לפעמים..\n\nשם המתרגל/ת: הילה מעין - מלכה!\nחוות דעת - תרגולים: פשוט עושה סדר! לא לוותר על התרגולים שלה. אין לה תחליף.\n\nשעורי הבית: גוזלים מלא זמן. אבל כדאי לעשות כדי להיסגר על החומר! במיוחד שבמבחן תמיד יש שאלה מהשיעורי בית\n\nהמבחן: קשה! יצאנו המומים. \n\nהשורה התחתונה: קורס לא מאוד קשה אבל גוזל המון זמן.", "timestamp": 1644938273004}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מדהימה, מלמדת את החומר ממש טוב ועונה לכל השאלות\n\nשם המתרגל/ת: הילה מעיין/שפלר\nחוות דעת - תרגולים: טיפה רצות על החומר אבל מסבירות טוב\n\nשעורי הבית: \nהרבה, מומלץ לעשות את כל השיעורים ולא רק מה שלהגשה\nהמבחן: הוגן מאוד\n\nהשורה התחתונה:", "timestamp": 1645344322493}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nדניאלה מרצה מעולה. היא מסכמת את החומר ואת ההוכחות על הלוח בצורה מאוד מסודרת ומפורטת וזה פלוס גדול. הקצב מהיר, ולפעמים קשה לעקוב ולסכם בו זמנית- אבל יוצאים עם סיכומים מעולים וברורים. \nחוץ מזה דניאלה באמת אוהבת את החומר שהיא מלמדת, היא מעבירה אותו בצורה כיפית, ותמיד עונה על שאלות בגובה העיניים ובחיוך. \nDisclaimer - הקורס לא \"רק טכני\" כמו שאוהבים להגיד. יש בו לא מעט הוכחות שחשוב (לדעתי) להבין לעומק כדי להצליח. הנושאים משתלבים אחד בשני במהלך הקורס, יש מסת חומר די גדולה ולפעמים הולכים לאיבוד. לכן חשוב למצוא מרצה שמצליחים להבין ולעקוב איתו ככל האפשר. למדתי אצל עליזה מלק עד שעברתי משיקולי לו\"ז, וגם היא מרצה מעולה! הקצב פחות מהיר מאצל דניאלה. \nובכל מקרה, כדאי להעזר בספרי התרגול וההרצאות של עליזה מלק, שעוזרים מאוד לעשות סדר. יש גם את סרטוני היוטיוב של צילג ז\"ל וסרטונים של עליזה בcampus il, חלקם כבר ביוטיוב.\n\nשם המתרגל/ת:  גרשון אברהם\nחוות דעת - תרגולים: \nמתרגל מעולה. הקצב מהיר, אז מספיקים יותר תרגילים ביחס לקבוצות תרגול אחרות, וגם לא נכנסים לפער ביחס להרצאות (וזה משמעותי בשיעורי בית). מה שכן הקצב באמת מהיר, וזה לא מתאים לכל אחד.\nגרשון מביא המון תרגילים שמכסים את כל הטריקים האפשריים. התרגולים עזרו מאוד בהבנת החומר מההרצאות. ממליצה!\n\nשעורי הבית: \nמורכבים מWW ומגליונות פתוחים.\nהWW לרוב עוזרים בהבנה טכנית של החומר, ותמיד כדאי להתחיל מהם כי מקבלים פידבק על כל תרגיל מיידית והם הכנה טובה לגליונות הפתוחים. מה שכן, יש WW שהם מאוד טכניים וחישוביים וכשיש לחץ של זמן אפשר לוותר.\nהגליונות הפתוחים הם הדבר האמיתי וכדאי לעשות אותם (בלי לרפרנס).\nהמבחן: \nהוגן.\nהשורה התחתונה: \nקורס חשוב, שיעורי הבית עוזרים וחשובים וכדאי לעשות אותם בקצב ההרצאות ולא להכנס לפער. אם מתרגלים ולומדים כמו שצריך אפשר לקבל ציון טוב מאוד (מעל 85 ואפילו מעל 90).\nהסגל באמת נחמדים ומנסים לעזור ולהתחשב בתאריכי הגשות, וזה לא מובן מאליו. במיוחד בקורסי היסוד.", "timestamp": 1645360174721}, {"author": "חילזון הפרא", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: אירנה. מרצה מצוינת. מסבירה עם הרבה מאוד סבלנות ועונה לכל שאלה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: גרשון. מתרגל מצוין. מאוד מהיר ומספיק הרבה מאוד תרגילים. מלמד הרבה טריקים מועילים למבחן.\n\nשעורי הבית: גליונות בכתב ארוכים אבל מכינים מצוין למבחן (ויש גם שאלת ש.ב משם) ww שמוודאים הבנה טכנית של החומר ולא מכבידים יותר מדי\n\nהמבחן: ארוך מאוד ודורש יכולת שליטה גבוהה מאוד בכל החומר כי לקראת הסוף רואים איך כל החומר של הקורס משתלב.\n\nהשורה התחתונה: קורס עמוס לאורך כל הסמסטר ומבחן יחסית עמוס וקשה אבל בהחלט קורס אפשרי ויש אחלה צוות לקורס", "timestamp": 1645367279081}, {"author": "ל\"א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: בעיני מדהימה, קצת מבולגנת אז לא מתאימה לכל אחד, נותנת דגשים משמעותיים שרלוונטיים לחומר\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מדהימה ממש, מעבירה את החומר בצורה מעניינת ואנרגטית\n\nשעורי הבית: שיעורי הבית מהווים מגן, והם ממש סבבה, בעיני הקורס שהכי נחמד לעשות בו שיעורי בית\n\nהמבחן: המבחן הוגן, בסמסטר שלי לדעתי היה קצת יותר קשה משנים קודמות, אבל אם אתה מתרגל מספיק מבחנים לפני אין סיבה שלא תוציא בזה ציון טוב\n\nהשורה התחתונה: קורס סבבה בעיני", "timestamp": 1645458691793}, {"author": "Shira Barmats", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: משעשעת. הכתיבה על הלוח קצת מבולגנת ולא קריאה אבל אופן הלימוד יחסית מעניין. קצת בלאגן ללמוד איתה אבל בסדר אם עוקבים אחרי השמות שהיא נותנת למשפטים שלה.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: ממש תותחית, מהירה ומספיקים הרבה תרגילים.\n\nשעורי הבית: הגליונות ממש עוזרים להכניס את החומר, מומלץ\n\nהמבחן: לתרגל הרבה לקראתו והוא בערך בסדר\n\nהשורה התחתונה: מלא הגדרות חדשות, לא להבהל", "timestamp": 1645519599120}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פאתחי\nחוות דעת - הרצאות: אין משהו יותר מידי ייחודי להגיד על פאתחי. הוא פשוט מרצה טוב ובן אדם נחמד שעושה את העבודה שלו, וגם עושה אותה מהר. בסופו של דבר טוב הרצאות שלו תמיד עם אווירה טובה. כמובן, אפשר לשאול אותו כשלא מבינים והוא תמיד יעזור להבין. אפילו מאוד ממליץ לבקש ממנו להסביר ולתת דוגמאות כדי שלא תמצאו את עצמכם לומדים איתו חומר של עוד שבוע ;)\n\nשם המתרגל/ת: אחסאן\nחוות דעת - תרגולים: מדהים. המתרגל הכי טוב לדעתי. הוא יודע לתת דוגמאות טובות וגם מטבל את התרגול בהומור\n\nשעורי הבית: הוובוורקים יכולים להיות חופרים, או קשים, אבל כדאי לעשות אותם גם אחרי המגן. השיעורי בית בכתב לרוב סבבה וגם דומים לחלק הפתוח במבחן.\n\nהמבחן: מאוד הוגן. עם מספיק מאמץ אפשר לצאת עם ציון טוב מאוד אפילו\n\nהשורה התחתונה: קורס חובה, אבל מאוד סטנדרטי לדעתי. תשקיעו ותרוויחו!", "timestamp": 1645564944768}, {"author": "עמית לוין", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאירנה- מקסימה, אוהבת ללמד, לקראת סוף הסמסטר רצה עם החומר ואם אתה לא איתה קל לאבד אותה.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nגרשון- מדהים, בזכותו הצלחתי בערך לעקוב אחרי מה שקורה בשיעור ולהדביק את הפערים שצברתי.\nהמבחן: \nארוך מאוד, אבל בערך ברמה של מה שעושים כל השנה.", "timestamp": 1645604980516}, {"author": "( :", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: אחלה נאדר, מצחיק מאוד. אני פחות ממליץ עליו למרות שהוא אדם ממש נחמד.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מתרגלת טובה, קצת מבולגנת.\n\nשעורי הבית: ארוכים וחופרים\n\nהמבחן: קשוח\n\nהשורה התחתונה: קורס קשה, צריך להיות על החומר כל הסמסטר כדי להצליח במבחן.", "timestamp": 1645721073860}, {"author": "'''", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פתחי\nחוות דעת - הרצאות: מרצה טוב אבל בקצב מהיר\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מתרגל מעולה מסביר בצורה מאוד מאוד ברורה ומאוד סבלני \n\nשעורי הבית: קשוחים\n\nהמבחן: צריך לפתור כמה שיותר מבחנים משנים קודמות\n\nהשורה התחתונה:", "timestamp": 1646561312052}, {"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פתחי \nחוות דעת - הרצאות: \nמרצה מצוין, הולך קצת מהר יותר מהאחרים אבל מצחיק ומובן. מדבר טיפה מונוטוני למי שזה מקשה עליו להתרכז.\n\nשעורי הבית: \nלפעמים קשים, אבל בגדול לא לוקח יותר מידי זמן\nהמבחן: \nהוגן ממש. אם מתכוננים עושים הרבה מבחנים משנים קודמות הרבה חוזר על עצמו. כדאי לזכור משפטים לפרטים קטנים בשביל החלק של ההוכחות.\nהשורה התחתונה: \nקורס חובה :| \nלא מהגרועים", "timestamp": 1646741488780}, {"author": "סמסטר א", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה טובה מאוד, רצה בצורה קצת מהירה מדיי על החומר לדעתי, ולא תמיד נותנת במה לחלקים הקשים להבנה, אבל בכל זאת הייתי ממליץ עליה.\n\nשם המתרגל/ת: אפרת אבירם\nחוות דעת - תרגולים: מתרגלת מעולה, הצילה להרבה אנשים את הקורס, מלמדת בצורה רגועה ונותנת תרגילים מאוד רלוונטיים לחומר הנלמד.\n\nשעורי הבית: לא מעט\n\nהמבחן: ארוך, אבל דיי חוזר על עצמו, מעט טריקים מדיי פעם\n\nהשורה התחתונה: קורס חובה.", "timestamp": 1647277052188}, {"author": "Alon Maayan", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: עליזה היא המרצה הכי טובה שהייתה לי. היא יודעת איך להעביר את החומר באופן מאוד ברור ומשעשע וקלטתי את החומר בהרצאה בקלות יחסית לשאר הקורסים, וזה בזכותה.\n\nשם המתרגל/ת: גרשון \nחוות דעת - תרגולים: מתרגל מצוין. הכתב שלו מאוד ברור והוא יודע מה הוא עושה. אדם מאוד נחמד והתרגולים שלו מאוד מובנים ויעילים.\n\nשעורי הבית: שיעורי הבית להגשה ייקחו קצת זמן, לי בערך 10 שעות שבועיות, אבל בלעדיהם לא הייתי מצליח בקורס. אישית, נהינתי מהם.\n\nהמבחן: המבחן היה קשה יחסית לקודמיו אבל מאוד פייר. צריך ללמוד על ידי מבחני עבר. אין מנוס.\n\nהשורה התחתונה: קורס מאוד מעניין. הייתי מעדיף אלגברה 2 במקום חדו\"א2 או אינפי 2", "timestamp": 1647769912155}, {"author": "bu", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות:מרצה תותחית קצת מבולגנת. ממליץ להגיע חד להרצאה כלומר לעבור על ההרצאה הקודמת ביסודיות לפני ההרצאה הבאה. \n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת טובה מאוד מקצועית, קצת ממהרת אבל מספיקה לכסות הרבה וריאציות של תרגילים\n\nהמבחן: \nהרבה שאלות מזכירות את השאלות בספר תרגילים פתוקרים של עליזה\nהשורה התחתונה: קורס שדורש השקעה אבל אפשרי מאוד לקבל ציון טוב.", "timestamp": 1647900546137}, {"author": "Barak Sade", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: נאדר \nחוות דעת - הרצאות: מלמד קצת לאט, דורש השלמות שיעשה כנראה על צה\"ד. אבל מרצה טוב ואווירה טובה\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מעולה, ממליץ מאוד למי שיכול לעמוד בקצב גבוה יחסית\n\nשעורי הבית: לא מאוד קלים, אבל מאוד אפשריים. בהתחלה אין כמעט גיליונות להגשה, אבל לקראת הסוף הם מצטברים, מומלץ להקדים עבודה עליהם כמה שאפשר\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1647931017014}, {"author": "meseri asaf", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nאחלה בן אדם, עונה לכל השאלות ונשארת גם אחרי כמה שצריך. לפעמים קצת מהירה ולא תמיד מסודרת, אבל מעבר על השיעור אחר כך מסביר הכל\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה בפער. קצת בפיגור אחרי ההרצאות, אבל כל דבר שלא היה ברור בהרצאה נראה קליל אחרי התרגול שלה. עושה גם אווירה טובה בתרגול ויודעת בדיוק מה צריך.\nשעורי הבית: \nגיליונות בית שלפעמים לוקחים זמן אבל חושבים ומפנימים בעזרתם את החומר. וובוורקים שחלק קלילים וחלק מזעזעים.\nבכל מקרה לפתור רק אחרי התרגול הרלוונטי כי הרבה פעמים פותרים שאלות בתרגול מהשיעורי בית.\nהמבחן: \nקצת קשה וטריקי, אבל חלק מהדברים חוזרים על עצמם\nהשורה התחתונה: \nקורס חובה, תעשו אותו אם תרצו או לא תרצו. בסוף עוברים", "timestamp": 1647947410909}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: אני אהבתי. מסבירה את החומר טוב ומובן.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מעולה וממש מומלצת! \n\nשעורי הבית: עמוסים אבל הגיליונות הפתוחים ממש עוזרים להבנת החומר.\n\nהמבחן: ממוצע נמוך אבל אם לומדים מספיק אפשר להוציא ציון בסדר.\n\nהשורה התחתונה: ביחס לקורס חובה הוא לא נוראי ואפשר להתעניין בחומר.", "timestamp": 1648492606840}, {"author": "Maor Levavi", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירנה גורליק\nחוות דעת - הרצאות: מרצה מסודרת, אחראית, סבלנית, מספקת הבנה עמוקה של החומר לסטודנטים.\n\nשם המתרגל/ת: ד\"ר ח'ירייה מסארווא\nחוות דעת - תרגולים: מתרגלת מצוינת, יודעת להסביר היטב, שומרת על קצב גבוה בתרגול אבל מבינים היטב את מה שהיא עושה.\n\nשעורי הבית: כדאיל השקיע בהם\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1648719291034}, {"author": "ויצי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nעליזה מוקלט\n\nחוות דעת - הרצאות: \nאחלה מרצה, יש גם את צילג ז\"ל אבל זה לא בדיוק החומר. \nאפשר גם צנזור באנגלית.\nשם המתרגל/ת: \nויויאן\nחוות דעת - תרגולים: \nעונה לשאלות, גם בקבוצת ווטסאפ מאוד עזר\nשעורי הבית: \nחשובים, הרבה אבל לא נורא\nהמבחן: \nקצת  טריקי, צריך לזכור טוב ולתרגל הרבה ואז זה פשוט\nהשורה התחתונה: \nחומר לא קשה להבנה אבל ציך לשלוט בו בצורה טובה", "timestamp": 1651216497532}, {"author": "אווו", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם כהמרצה: עליזה \nחוות דעת - הרצאות: לא צריך\n\nשם המתרגל/ת: אחסאן \nחוות דעת - תרגולים: לא צריך\n\nשעורי הבית:לא צריך \n\nהמבחן: הכי טכני \n\nהשורה התחתונה:צריך לפתור הרבה מבחנים עד שתשלטו בחווומר היטב \nואז אני מבטיח שתקבלו 100 על המחן עצמו \nממליץ לא ללכת להרצאות ולא לתרגולים \nרק לפתור שאלות באוופן אישי", "timestamp": 1654190526416}, {"author": "דיאון בורדהימה", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אירנה\nחוות דעת - הרצאות: \nמרצה מעולה, מסבירה את הכל בצורה ברורה, החיסרון היחיד שלה זה הכתב על הלוח לא הכי מסודר אבל אפשר להתגבר על זה.\nאין על אירנה בעולם\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמהירה מאוד ואם כותבים קצת קשה לעקוב אחרי מה שהיא עושה, אבל היא שולטת בחומר ומעבירה אותו בצורה שעוזרת ממש לשיעורי בית בww ובגיליונות.\nשעורי הבית: \nקצת ארוכים אבל הם באמת חשובים כדי להכניס את החומר\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1654510905793}, {"author": "תומר בירן", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: מבולגנת. לא רואה סיבה להגיע כי יש לה הקלטות טובות\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: מעולה ומאוד תכלס. סגר לי את כל הפינות בקורס\n\nשעורי הבית: גיליונות וWW. אם שולטים בחומר זה לא עמוס מידי\n\nהמבחן: מאוד דומה לשנים קודמות. כל שנה אותו רעיון\n\nהשורה התחתונה: צריך לשלוט בקורס במהלך הסמסטר אחרת קשה להשלים הכול בתקופת המבחנים", "timestamp": 1657180804751}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nעליזה מדברת לפעמים ממש מהר וזה בסדר אם יצאתם מההרצה בלי להבין מילה, מומלץ לא לכתוב אחריה כדי להבין ממש טוב את החומר וגם יכולים להבין לבד את החומר או לצפות בהקלטות שלה כי הוא יחסית סביר.\n\nשם המתרגל/ת: ויוויאן לאוין\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה שיש בכל הטכניון ברמה, מעבירה את החומר בצורה  ממש טובה ועונה כל כל השאלות ומשתפת את הסטודנטים בפתרון השאלות, פתרנו מלה שאלות רלוונטיות למבחן ונתנה לנו מלה טריקים שהופיעו במבחן.\n\nשעורי הבית: \nסבירים אבל לוקחים מלא זמן אם רוצים לפתור בצורה מלאה\nהמבחן: \nלפעמים עליזה עושה פעלולים ומביאה מבחנין קשים מאוד או מביאה מבחן סביר, אין באמצע צריך לפתור מלא בחינות כדי לדעת את כל הטריקים כי הם חוזרים על עצמם.\n\nהשורה התחתונה: \nחומר לא קשה ודורש פתירת מלא שאלות ומבחנים כדי להביא 100 וזה ממש אפשרי", "timestamp": 1657188702197}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה מדהימה! היא מצליחה להעביר את החומר בצורה כל כך ברורה ומובנת. באמת נהניתי מכל רגע בהרצאות שלה. רואים שהיא אוהבת את מה שהיא עושה. יש גם סרטונים שלה ביוטיוב על הרוב המוחלט של הנושאים.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: חזרתי על הקורס אז בעיקר הגעתי לתרגולים. הילה מתרגלת נפלאה! היא בקיאה בחומר ומספיקה המון במהלך התרגול אבל גם עושה הכל ברוגע, שלווה וחיוך אז אין הרגשה שהיא רצה או בלחץ להספיק. מומלצת בחום :)\n\nשעורי הבית: גיליונות להגשה וובוורקים. לפעמים השאלות לא הכי פשוטות אבל מאוד מאוד עוזרים להטמיע את החומר.\n\nהמבחן: בעיניי היה יחסית לא פשוט ביחס לסמסטרים קודמים. יש שאלות וטריקים שכן חוזרים על עצמם אז ממליצה בחום לפתור מלא מבחני עבר.\n\nהשורה התחתונה: אחלה קורס אבל השאלות במבחן לפעמים מתקילות. בכל מקרה קורס חובה אז ממש ממליצה לקחת עם הילה שפלר ועליזה אם יש אפשרות!", "timestamp": 1657206219826}, {"author": "....", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nמרצה מעולה. מלמדת מעולה, נותנת טיפים טכניים ואין שאלה שתשאלו ולא תקבלו תשובה במקום. באופן כללי מרגיש שיש הרבה חומר בכל הרצאה אבל הקורס בנוי ככה שבכל נושא משתמשים בחומר שנלמד קודם אז זה בסדר.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nמתרגלת מצוינת. יסודית מאוד. כל תרגול מתחיל במעבר על החומר וחידוד נקודות, ולאחר מכן פותרים תרגילים. יכול להרגיש טיפה איטי אבל היא באמת דואגת שכולם יבינו ושהתרגיל יוסבר לפרטים.\nממליץ לבוא אחרי שישבתם קצת לבד על החומר, לדעתי זה הכי אפקטיבי.\n\nשעורי הבית: \nאני חושב שהשיעורי בית הכי נחמדים שהיו הסמסטר. ממליץ בחום לעשות מיד לאחר ההרצאות, עוזר להטמיע טוב את החומר.\nכך עשיתי במהלך הסמסטר, ולקראת המבחן רק תירגלתי מבחנים.\n\nהמבחן: \nלדעתי המבחן הוגן לחלוטין. תזהרו מהאמריקאיות אפשר לטעות שם בקלות.\n\nהשורה התחתונה: \nאחלה קורס, ממליץ!", "timestamp": 1657615397704}, {"author": "היי:)", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: מרצה ממש טוב, הוא יודע לשמור על הקשב שלך. הוא מדבר לפעמים לאט או סוטה מהנושא קצת  אבל נותן כל מיני טריקים לאיך לגשת לנושאים.\n\nשם המתרגל/ת: ניקה\nחוות דעת - תרגולים:  ממש אהבתי, הכל היה מסודר והסברים ברורים. לפעמים טיפה מהירה אבל מקשיבה כשמבקשים לחזור על דברים\n\nשעורי הבית: כל שבועיים גיליון. ממליצה לעשות את הוובורק לפני הגיליון\n\nהמבחן: מבחן בסדר, דורש לשבת וללמוד ועוזר מאוד כשמבינים איך כל הנושאים קשורים אחד לשני כי בשבוע שבועיים האחרונים הכל מתחבר ומתקשר. יש שאלה אחת מהשיעורי בית שמופיעה במבחן\n\nהשורה התחתונה: קורס טכני אבל דורש להבין. מומלץ לעבור על ההרצאה הקודמת קצת לפני הנוכחית", "timestamp": 1657621811645}, {"author": "תומר זבוקליצקי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות:  עליזה מרצה מעולה - היא מסבירה טוב את החומר והיא גם המרצה האחראית. לעיתים מדברת מהר אבל יש הקלטות שלה אז תמיד אפשר להשלים\nשם המתרגל/ת:  גרשון\nחוות דעת - המון מתרגלים מומלצים - אני אישית חושב שגרשון מסביר מעולה, קשוב ועוזר להתכונן למבחן, נותן הרבה אסוציאציות. שווה להגיע לתרגול שלו .\n\nשעורי הבית: יש ww ויש גליונות דו שבועיים ולהם רפרנסים . השיעורי בית הם המפתח בקורס!!!! מי שעושה שיעורי בית ולא מרפרנס פשוט מובטח לו לפחות עוד עשרים נקודות בציון .\n\nהמבחן:  אצלנו המבחן היה הוגן מאוד - חזרתי משנים קודמות  ממליץ ללמוד שבוע וחצי מראש כי סמסטר ראשון ולתרגל פשוט המון מבחנים. שווה את זה \n\nהשורה התחתונה:  קורס מעניין יחסית ובסיס להמון קורסים אחרים. תשקיעו אפשר לקבל 80+ .  ואל תשכחו לעשות ש.ב שווה את זה", "timestamp": 1657635046189}, {"author": ":>", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה מלק \nחוות דעת - הרצאות: מבולגן מאוד, עדיף לראות הרצאות מוקלטות שלה מהסמסטר של הקורונה.\n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים: התרגולים שלו עזרו לי להבין את החומר יותר מכל דבר אחר, רץ על מגוון של תרגילים ומדבר תכלס על החומר, מומלץ מאוד.\n\nשעורי הבית: מעיקים אבל אפשריים לגמרי להבנה אחרי התרגול בנושא.\n\nהמבחן: לא הייתי אומר קשה אבל בהחלט מבלבל, הוגן בהחלט אבל צריך להיות זהירים\n\nהשורה התחתונה: קורס סבבה בסך הכל, לא לקחת ללב את הבוחן אמצע", "timestamp": 1658241616000}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צילג\nחוות דעת - הרצאות: הקלטות משנת 1900 אבל עדיין אותו חומר והוא מרצה די טוב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא עמוסים במיוחד. כן לדאוג שמבינים את החומר בשיעורי הבית.\n\nהמבחן: לא קשה במיוחד רוב השאלות די טכניות וחוזרות על עצמן. יש חלק של בערך 20 נקודות של הוכחות לא קשות במיוחד.\n\n\nהשורה התחתונה: חומר שימושי בטירוף קורס חובה אז אין בחירה ככ.", "timestamp": 1660568012579}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מעבירה את ההרצאות באופן ברור, עושה הרבה דוגמאות.\n\nשם המתרגל/ת: חייריה מסארווה\nחוות דעת - תרגולים: מתרגלת סבירה, מעבירה קצת יבש אבל טוב.\n\nשעורי הבית: מכסים את כל החומר, לוקחים כמה שעות טובות.\n\nהמבחן: לא קשה מדי\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660727510787}, {"author": "**", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מעולה!!! מסבירה טוב, עניינית, לא מתפזרת ובעיקר מסבירה את הרציונל מאחורי כל דבר ודואגת לקשר בין כל המושגים כי יש המון. הרצאות פרונטליות מעולות, גם ההקלטות אחלה. מומלץ לשאול כי תמיד דואגת לענות ולהסביר שוב למי שלא הבין.\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: מצוין, די טכני ומספיק הרבה תרגילים בגלל שהוא מאוד מהיר, מסביר שוב למי שלא הבין אבל עושה את זה ממש במהירות אז יכול להיות שלא יבינו. מתרגלת נוספת מעולה- הילה מעיין, לדעתי המתרגלת הכי טובה, מסבירה הכל בצורה מובנת ותמיד נעימה (שזה לא מובן מאליו).\n\nשעורי הבית: מעיקים. 6 גליונות מתוכם חובה להגיש 5, די עמוסים בתרגילים אבל מאוד חשוב להבנת החומר, לא לוותר עליהם ולהתעקש להבין את החומר כי לקראת סוף הסמסטר רצים ממש.\n\nהמבחן: די חוזר על עצמו במבנה, השאלות הוכח או הפרך סיוט אבל שאר המבחן באמת בסדר למי שמגיע מוכן. לעבור על כל המבחנים ולתרגל המון ותהיו בסדר.\n\nהשורה התחתונה: קורס לא פשוט, הרבה מושגים ועמוס, אבל חובה אז אין יותר מדי ברירות. רק עליזה.", "timestamp": 1664811360882}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: הקלטות של צנזור\nחוות דעת - הרצאות: ההקלטות פצצה, הכול ברור אפילו באנגלית, מכסה את כל חומר הקורס ומובן לחלוטין.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: התרגולים שלה ממש טובים, נורא מסודר ולפי מצגת.\n\nשעורי הבית: הגליונות נורא ארוכים, קשה לסיים ביום. אבל הם מכסים את החומר ממש טוב, ואז מגיעים למבחן מוכנים.\n\nהמבחן: המבחן יותר ארוך משהוא קשה. צריך להיות על החומר שנלמד בשלבים האחרונים של הסמסטר, אז צריך לוודא לא לפתוח פער - במיוחד אם המבחן ממש מוקדם בתקופת המבחנים.\n\nהשורה התחתונה: אחלה קורס, נורא נוח לאוהבי ההלטות", "timestamp": 1666264814217}, {"author": "גלי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: אין על עליזה. מעבירה את החומר בצורה מושלמת ובנוסף עם אווירה טובה והומור. עונה על כל השאלות ומסבירה מצויין.\n\nשם המתרגל/ת: ויויאן לאווין\nחוות דעת - תרגולים: ויויאן מעולהה. מדויקת מאוד ומסבירה ממש טוב, מביאה שאלות ממבחני עבר. מסבירה בפירוט על כל דבר, ואם יש משהו לא ברור עונה על כל מה שצריך.\n\nשעורי הבית: ממש אחלה וגם די דומים בחלקם למבחן אחר כך. שווה לעבור על השאלות הוכח/הפרך לפני המבחן כי תופיע שאלה אחת/שאלה דומה וזה די הרבה נקודות. בסך הכל לא כזה עמוס ולא לוקח מלא זמן.\n\nהמבחן: ממש בסדר, לדעתי הוגן מאוד. הכל אותו סגנון ואין כל כך דברים חדשים ממבחני עבר, עליזה די שומרת על רמה אחידה של המבחנים וככה זה הרגיש לי.\n\nהשורה התחתונה: אחלה קורס, הוא לא קל כמו שאולי חלק אומרים אבל הוא מעניין וכיפי ללמידה, אפשר להוציא בו ציונים גבוהים אבל בגדול הממוצע לא כזה גבוה. בתכלס זה הקורס שהכי אהבתי הסמסטר וכיף שסוף סוף יש קורס שמנוהל בצורה טובה ואחידה, וששיעורי הבית באמת קשורים למבחן...", "timestamp": 1667160850012}, {"author": "דור", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות:\nגורמת להרצאה להיות מצחיקה מאוד, היא מלמדת טוב והיא מאוד ברורה. קצת רצה אז לא מתאימה למי שצריך ל״כתוב״ את ההרצאה \nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: \nלא משהו, לחוץ ומלחיץ.. וויתרתי ועברתי למוקלט\nשעורי הבית: \nהמון, המון המון... אבל מה אפשר לעשות קורס בסיס\nהמבחן: \nעדיין לא היה\nהשורה התחתונה: לא ממש משנה כי גם ככה זה חובה", "timestamp": 1675190000612}, {"author": "Raz Kachal", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: אחלה מרצה, כתב מזעזע וצפוף על הלוח אבל אפשר להסתדר ושווה לא להצטופף אצל עליזה.\n\nשם המתרגל/ת: ויויאן הקלטות\nחוות דעת - תרגולים: מאוד מסודר עם מצגות, ממליץ.\n\nשעורי הבית: לא בשמים, יש רפרנס. \n\nהמבחן: .\n\nהשורה התחתונה: יותר קל מחדו\"א", "timestamp": 1675380742101}, {"author": "nono", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה מלק \nחוות דעת - הרצאות: \nהיא מקסימה אבל לא מסודרת בהעברת החומר\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nהיאממש טובה אבל הכתב שלה ממש קטן לכן קשה להעתיק מהלוח\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675417647111}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: אל תלכו, עוברת ממש לאט על החומר ובסוף צריך לעשות מלא הרצאות השלמה ואז בתרגול עוברים על משהו שעוד לא למדתם\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: עובר ממש מהר על החומר אז שימו לב\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675420379589}, {"author": "מישל", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: ניר מרצה מעולה וקורע מצחוק!\nהוא מסביר הכל בצורה ברורה ועם המון אנרגיות. הוא נותן הרבה דוגמאות ויישומים לחומר התיאורטי ויש לו סיכומים מסודרים במודל ככה שאפשר לא לכתוב בהרצאות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הוובוורקים מאוד עוזרים להפנים את החומר ברמה הבסיסית, לא לוותר. גליונות קצת ארוכים אבל שווה את זה. \n\nהמבחן: \n\nהשורה התחתונה: קורס עמוס אבל עם הרבה תרגול אפשר ממש להצליח. אם ניר מרצה באותו סמסטר, זכיתם.", "timestamp": 1675621559175}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  אבי גורן\nחוות דעת - הרצאות:  מרצה טוב ממש, מי שמרגיש לשאול שאלות בשיעור- הרצאות הצגה\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: מצויין\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675695776406}, {"author": "Y", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: עליזה מצוינת!\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: מתרגלת מצוינת- יש רק שעתיים תרגול אבל היא מספיקה הכל וברור!!!\n\nשעורי הבית: דומים מאוד למבחן\n\nהמבחן: מבחן לא פשוט אבל סביר\n\nהשורה התחתונה:", "timestamp": 1675880705020}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: \nדניאלה נוטה להיות מאוד מבולגנת על הלוח, היא כותבת צפוף, באופן לא קריא ומאוד מאוד לא מסודר לטעמי. הרבה פעמים הרגשתי שהיא מדברת על החומר מתוך זיכרון של שנים, ולא מסבירה אותו בצורה שתיצור אינטואיציה אצל הסטודנטים שנתקלים בו לראשונה.\n\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: \nאלון מתרגל מדהים. האווירה בתרגול לימודית, הוא מקצועי ומעביר את החומר בקלילות. למרות זאת, יצא לי להיות בתרגול של מתרגל נוסף ושם הרגשתי שהתרגילים שפטרו בתרגול היו ברמה קשה יותר שמייצגת את תרגילי הבית והמבחן הסופי.\n\n\nשעורי הבית: \nיכולים לקחת קצת זמן ויש שאלות עם סעיפים רבים. לא צריך להגיש את כולם אבל חשוב לקחת בחשבון שסעיף במבחן נלקח משיעורי הבית והוא חלק מציון המגן (בשאלות הוכח/הפרך). חשוב לעשות את הגיליונות כי הם מהווים גם תרגול ומימוש של דברים שנעשים בתרגולים ובהרצאות. בנוסף, יש גם את הוובוורק שלרוב הוא יותר קליל.\n\nהמבחן: \nהמבחנים מאוד חוזרים על מוטיבים ממבחני עבר, לכן לדעתי חשוב מאוד לעבור על כמה שיותר מבחנים ולהבין את הטריק בכל שאלה.\n\nהשורה התחתונה:\nקורס שיכול להיות סך הכל חביב. לקראת הסוף החומר טיפה מתדרדר ונהיה קשה, אבל זה לא משהו שסטודנט נורמטיבי לא מסוגל לו.", "timestamp": 1675980655048}, {"author": "0", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מצוינת. עליזה מעבירה את החומר עם הרבה דוגמאות והומור. מסבירה את הרצף הלוגי של הסילבוס ויש לה הרבה סבלנות לשאלות. אמנם במהלך הסמסטר צברנו פער על מרצים אחרים והיינו צריכים לעשות 2 שיעורי השלמה. אבל היא הסבירה מעולה את החומר וההבנה הייתה טובה יותר. בתחילת הסמסטר יש עומס גדול אצלה, לכן כדאי להגיע מוקדם לתפוס מקום. במהלך הסמסטר העומס יורד.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: התרגולים מאוד עמוסים בסטודנטים לאורך כל הסמסטר לכן כדאי להגיע מוקדם. מתרגלת מעולה, מסבירה ממש טוב והתרגילים שלה מכסים את מרבית סוגי השאלות.\n\nשעורי הבית: הגיליונות בכתב יחסית ארוכים ודורשים זמן אך לא מאתגרים מידי (יש רפרנסים). השיעורי בית בWEBWORK ארוכים יחסית ומציקים.\n\nהמבחן: לומדים טוב ממבחנים קודמים והמבחן לא קשה מידי. יש לו חלקים גדולים שהם יחסית טכניים שאותם מסבירים בתרגולים\n\nהשורה התחתונה: חשוב לעקוב אחרי החומר ולא לאבד את הקצב. לכל אחד מתאים מרצה/מתרגל אחר והרוב המוחלט של המתרגלים והמרצים מעולים ולכן כדאי לנסות כמה כדי לדעת מי מתאים לך.", "timestamp": 1676103916408}, {"author": "עוד סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: מצחיק בעיקר, אווירה טובה. הרצאות סבירות.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: אחלה תרגולים, הילה העלתה הכול למודל שזה מושלם.\n\nשעורי הבית: גליונות ארוכים אבל חשובים מאוד למבחן.\n\nהמבחן: קשה, מבלבל, כל משפט קטן שנראה מטופש ולא חשוב יכול להופיע במבחן, ולכן מעצבן מאוד. \n\nהשורה התחתונה: קורס סבבה, דברים חדשים למי שלא פגש בעבר, מבחן חופר.", "timestamp": 1676107676304}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: בתחילת הסמסטר דניאלה הייתה ממש בסדר, לימדה באופן ברור אבל בהמשך זה הדרדר, החומר היה פחות ופחות מובן. היא פשוט התחילה לרוץ על החומר וללא סיבה - כי היה מספיק זמן, מבלי להעביר אותו כמו שצריך. היא הפכה להיות ממש חסרת סבלנות לשאלות ששאלו סטודנטים, הרבה פעמים ניסתה להיות מצחיקה אבל תכלס יצא שהיא  העירה הערות קצת מתנשאות לגבי הבנת החומר, הכתיבה על הלוח מאוד מבולגנת ולא מובנת. את כל החומר של סוף הסמסטר, שזה החומר הכי חשוב ועיקרי למבחן, למדתי לבד והשלמתי אחרי ההרצאות, ההרצאות לא היו יעילות בשום צורה, ממליצה לצערי לא ללכת להרצאות שלה. \n\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: אלון מתרגל מעולה, מעביר את החומר בצורה עניינית והאווירה בתרגול ממש טובה! \n\nשעורי הבית: עמוסים אבל חשובים מאוד להבנת החומר, ממליצה לנסות לעשות לבד ולא להסתכל ברפרנס.\n\nהמבחן: לפעמים עליזה עושה מבחנים ממש קשים, אבל צריך בעיקר להבין את הטריקים שלה. \n\nהשורה התחתונה: המון חומר אבל אם מתרגלים הרבה שאלות מגוונות עם הטריקים שעליזה אוהבת, ויש הרבה, אפשרי להצליח.", "timestamp": 1676108422876}, {"author": "ניר מילר", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: המון המון תוכן שחופף להרצאות היוטיוב שלה, מרצה מטורפת מומלצת מאוד !\n\nשם המתרגל/ת: גרשון המלך\nחוות דעת - תרגולים: הלכתי להמון מתרגלים בעיניי הוא הכי מומלץ, לא יצאתי מאף תרגול מבלי להבין הכול ב100%\n\nשעורי הבית: גיליון בשבועיים, לקראת סוף הקורס מתחיל להיות צפוף ועמוס\n\nהמבחן: בוחן קשה בהגזמה, מבחנים הוגנים עם למידה מקדימה\n\nהשורה התחתונה: קורס חובה, 5 נקז, אפשרי לגמרי להוציא ציון גבוה\nבהצלחה !", "timestamp": 1676114522271}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: ניר מרצה בסדר גמור, יש אווירה טובה בשיעורים שלו אבל מאוד מאוד מבולגן. יתרון גדול זה שהוא עובד עם רשימות מסודרות מאוד וככה יותר קל לשמור על ריכוז בהרצאות שלו.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: מעולה! מסבירה בצורה ברורה, מתרגלת תרגילים מדוייקים שיעזרו לשיעורים ומסודרת מאוד.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676212415693}, {"author": "תמר", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: לעומת הסרטונים ביוטיוב עליזה קצת מפוזרת בהרצאות, אבל הסרטונים פשוט איטיים מדיי ואי אפשר באמת ללמוד ככה חייבים לתפוס קצב אז מומלץ מאוד להגיע להרצאות ורק להשלים דברים שפחות מבינים מהסרטונים. היא הייתה קצת בפער בהרצאות אחרי המרצים האחרים ובסוף ההסמסטר ממש רצה על הנושאים הכי קשים וזה הקשה ממש על הלמידה שלהם. מה שכן מאוד חשוב לה שכולם יבינו והיא נותנת דוגמאות ומסבירה מעולה. \n\nשם המתרגל/ת: ויויאן \nחוות דעת - תרגולים: עובדת עם מצגת ממש מסודרת שזה מעולה, פותחת קבוצת ווצאפ וממש עוזרת למי שצריך \n\nשעורי הבית: גם הוובוורקים וגם הגליונות פתירים ממש ועוזרים להבנה, באמת מומלץ לפתור וללמוד מהם \n\nהמבחן: יש מעט מאוד זמן ללמוד אליו (הבנתי שזה קורה כל שנה) אז להתעקש מאוד על להבין את החומר בעיקר של סוף הסמסטר ולא להוריד רגל מהגז!\n\nהשורה התחתונה: הקורס בנוי בצורה של בניית בסיס יחסית איטית ואז בבת אחת רצים על המון נושאים חשובים וקשים ביחד. לא לאבד את זה באמצע בשום מחיר! והשבועיים האחרונים של הסמסטר קריטיים! אם משהו לא ברור, ישר לסגור את הנושא עם הסרטונים של עליזה ביוטיוב ולהמשיך הלאה", "timestamp": 1676287067619}, {"author": "נתי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: מרצה מעולה!! ממליצה בחום,\nיכול להרתיע בהרצאה הראשונה, אבל הוא אחלה של מרצה- מסביר ברור, נותן דוגמאות מספריות ומעביר את ההרצאה בכיף.\nלא היו אצלו הרבה אנשים, אז היתה תחושה של יחס אישי.\n\nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: מתרגל מעולה! פותר תרגילים רלוונטים, נותן המון טיפים למבחן- רואים שממש אכפת לו מהסטודנטים. עונה לשאלות תמיד ומשקיע. לעיתים קשה לעקוב אחריו בכיתה (לא תמיד הכי מסודר) אבל הוא מעלה את כל מה שהוא מעביר בקובץ מסודר למודל עם כל ההערות החשובות, שזה ממש אחלה.\n\nשעורי הבית: סבבה\n\nהמבחן: לא קל אבל לא נוראי, צורך למידה והשקעה אבל יש מקצועות הרבה יותר רעים\n\nהשורה התחתונה: מקצוע חשוב ורלוונטי להמשך התואר", "timestamp": 1676469593827}, {"author": "קיילי המילטון", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה חמודה, קצת חסר פורמליות בקורס והיא מנסה להנגיש דברים לסטודנטים שכבר נאלצו להבין הגדרות הרבה יותר מסובכות, לא צריך להסביר לנו בבדידים אנחנו ילדים גדולים\n\nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: מתרגל מעולה, יודע את החומר מצוין ורואים שהוא מאוד נהנה ממה שהוא עושה ורוצה ללמד. תמיד עושה גם קצת מעבר ומעלה רשימות מאוד מפורטות לאתר הקורס, ממליץ מאוד\n\nשעורי הבית: סבירים לחלוטין\n\nהמבחן: קשה, אבל עם מספיק תרגול אין סיבה לא להצליח מאוד! האמריקאיות מכשילות, להיזהר\n\nהשורה התחתונה: חייבים", "timestamp": 1676529744089}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גב דניאלה  אבידן\nחוות דעת - הרצאות: מרצה מצוינת שגורמת לחומר להישמע מעניין והיא מסבירה באופן די ישיר. הקצב שלה מהיר יחסית, ולכן מספיקים הרבה בהרצאות ובדרך כלל בהרצאה האחרונה מבצעים חזרה על החומר\n\nשם המתרגל/ת:  ראואן טבריה\nחוות דעת - תרגולים: מתרגלת נהדרת, משקיעה בסטודנטים ומאוד נחמדה. לדעתי התירגולים שלה עדיפים כי היא מאוד מסודרת והיא מאוד מתאומת עם דניאלה, וגם הקבוצה שלנו היית יחסית די קטנה אז הספקנו הרבה.\n\nשעורי הבית: \nשיעורי בית סברים\n\nהמבחן: \nיש חלק של 50 נקודות שהן יחסית טכניות, ומי שיתאמן על מספיק מבחנים יעבור אותו, אבל כדי להוציא ציון טוב צריך להשקיע המון בקורס וזה מאוד קשה. במיוחד השאלות האמריקאיות שהן מאוד מכשילות.\n\nהשורה התחתונה: \nקורס חובה, שמעניק הרבה רקע חשוב למד\"ר ולקורסי המשך", "timestamp": 1676649270959}, {"author": "סטודנט ממוצע", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: סאלח פתחי\nחוות דעת - הרצאות: הבנתי שהוא לא מלמד בכל סמסטר. אחלה מרצה, שקט ורגוע. נותן אינטואיציה טובה על החומר ועונה על כל השאלות.\n\nשם המתרגל/ת: קרוואן. \nחוות דעת - תרגולים: אחלה מתרגלת, שולטת היטב בחומר נותנת 100 אחוז מעצמה.\n\nשעורי הבית: \nגליונות ווברוק שבועיים די קלים, יש פה ושם טריקים. עבודות פתוחות דו שבועיות ארוכות, אבל לא קשות מידי.\nהמבחן:\n המבחן די קשוח, אין הרבה זמן להתכונן עליו. החומר בנוי בקורס בצורה כזאת שכל החומר הקשה נלמד בסוף ויש גם עומס של קורסים אחרים. לא הספקתי לתרגל מבחנים בכלל , אבל הוצאתי ציון טוב כי פחות או יותר הבנתי את החומר.  \n\nהשורה התחתונה: בגלל שהחומר בנוי בצורה מונטונית עולה, ממליץ להשקיע ולהיות חדים על החומר כל הסמסטר, אם אפשר לקבל ציון טוב בבחן אמצע(למרות שזה לא באמת משנה וקריטי), כי החומר שם יותר פשוט וזה יכול לעזור במגן(דבר שלי עזר).", "timestamp": 1676747986165}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה\nמשעשעת ומאוד נחמדה אבל מבחינתי היא הייתה הכאוס בהתגלמותו, רוקדת מחול שדים על גבי הלוחות. לסכם אותה עם עפרון ומחברת היה סיוט וגם ככה היה מפוצץ אז פרשתי לבית אחרי שתי הרצאות.\nהסרטונים ביוטיוב הם אחלה אופציה, אבל מאוד מורחבים וצריך לדעת מה לסנן (אפשר לראות הכל ולוותר למשל על תרגולים). הרבה תרגילים שם יופיעו בגרסאות כאלו ואחרות בש\"ב ויש הרבה טיפים ורעיונות שהיא אוהבת להשתמש בהם. עוד אופציה טובה היא הקלטות מסמסטרים קודמים שאפשר לעצור את הטירוף של ההרצאה לרגע ולסדר את הבלאגן.\n\nשם המתרגל/ת: ויויאן\nסוג של מלאך שנשלח בחסד עליון מסיבה לא ברורה לתרגל אלגברה בטכניון. משקיעה (יותר מדי) בסטודנטים ובאמת אכפת לה שהכל יהיה ברור לכולם. רהוטה, מסודרת, מבריקה.. לא לפספס", "timestamp": 1676751473319}, {"author": "e", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: אוהבת את החומר ומסבירה בצורה ברורה, הבנת הסטודנטים חשובה לה. דאגה להספיק את כל החומר בזמן ע\"מ לבצע שיעור חזרה בהרצאה האחרונה.\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: משתדל מאוד ומסביר ברור ובגובה העיניים אך לדעתי לא מספיק מספיק תרגילים בתרגול (המטרה לשמה מגיעים לשיעור)\n\nשעורי הבית: כדאי לפתור לבד\n\nהמבחן: דומה למבחני עבר\n\nהשורה התחתונה: ללמוד במהלך הסמסטר", "timestamp": 1676804239513}, {"author": "ללניה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ניר בן דויד\nחוות דעת - הרצאות: העביר בצורה מעניינת, מפתח חשיבה מתמטית, טיפה מבולגן אבל עם רשימות מעולות.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: מעולים, ממליץ מאוד. מסודרת ומסבירה בצורה מרתקת. רשימות טובות עם מעט טעויות חישוב אבל בכל זאת ממליץ לעבוד צמוד אליהן.\n\nשעורי הבית: בונים הבנה\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס בסיס לכל דבר בהמשך", "timestamp": 1676882159577}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מלק עליזה\nחוות דעת - הרצאות: כמובן- האחת והיחידה עליזה. מדהימה, יש לה חוש הומור כמו אור בסופה של מנהרה חשוכה. רצה בקצב מהיר אבל לא מהיר. איך? בעצם מתעכבת בחומר. מאוד. אבל באותו זמן לא מבינים את החומר כל כך אלא כאשר עוקבים ממש אבל ממש.\n\nשם המתרגל/ת: קרואן\nחוות דעת - תרגולים: מעולה. אין מילים לתאר, יודעת להסביר והיא סבלנית עם השאלות של הסטודנטים. השאלות שהיא מציגה הינן לעניין ונותנות טריקים למבחן.\n\nשעורי הבית: קצת ארוכים אבל הכרחיים. ממליץ לפתור את שאלות ההוכחה וההפרכה ולהבינן לעומק. כמובן יש רפרנסים במידת הצורך שזה נחמד.\n\nהמבחן: מבחן הוגן. מי שלמד מבחנים משנים קודמות יוכל להוציא ציון טוב. \n\nהשורה התחתונה: תפתרו המון שאלות משנים קודמות ותעקבו אחרי החומר. קורס לא קשה אבל קצת מעמיס.", "timestamp": 1676899264856}, {"author": "אורי בלוגולובסקי", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אבי גורן\nחוות דעת - הרצאות: מרצה הצגה, תלכו לשיעור אחד איתו תבינו\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: הכל מסודר, מסבירה מצויין את החומר מאוד סבלנית\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677160391484}, {"author": "ר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: מדהים\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677328584995}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: סלאח פתחי\nחוות דעת - הרצאות: מרצה מעולה מסביר את החומר ברמה גבוהה ונותן המון דוגמאות.\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: לא פשוטים אבל ברגע שמבינים את החומר בהרצאות הם לא בלתי פתירים.\n\nהמבחן: די קשה\n\nהשורה התחתונה: קורס לא פשוט וצריך להשקיע הרבה", "timestamp": 1677582300111}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: לא עפתי על ההרצאות, התרגולים זה העיקר. לדעתי ההרצאה גם כן מכילה הרבה דברים שפשוט לא רלוונטים ומבלבלים.. אפשר להיעזר בסרטיונים ביוטיוב שמכסים את מה שלא נקלט. לא חסרים מרצים טובים - אישית אני חושב שעליזה אוברייטד *ברמות* והיא בכלל על הפנים. דיס-המלצה חריף מאוד עליה.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: אחלה מתרגלת, ברורה, משתמשת במצגות אם יש אנשים שמעדיפים לא לכתוב. ממליץ\n\nשעורי הבית: סבירים, ויש רפרנסים\n\nהמבחן: יחסית קל, כל המבחנים די דומים ולכן אפשר לדעת למה לצפות.\n\nהשורה התחתונה: קורס חובה, לא קשה מדי, מעט מבלבל בהתחלה. לא להילחץ. וכמובן להתרחק מעליזה :)", "timestamp": 1677599899984}, {"author": "למה אכלתי אמא", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: פאתחי\nחוות דעת - הרצאות: שאלוהים יברך אותו. איך המרצים הטובים יותר שהכרתי. הסיכומים שלנו מעולים והוא באמת יודע להסביר בצורה מובנת וברורה את החומר. \n\nשם המתרגל/ת: הילה שפלר\n\nחוות דעת - תרגולים:  ממש טובה. אבל מרגיש שהיא יותר מידי מנסה לחזור על הסיכום של ההרצאה במקום לעשות תרגולים מה שגורם לכך שלא מספיקים לעבור על כל הדברים בזמן.\n\nשעורי הבית: אולי הנושאים האחרונים טיפה קשים, אבל סה\"כ ש\"ב סבבה לגמרי.\n\nהמבחן: היה קשה. אבל אם יודעים את החומר עוברים את זה בשלום.\n\nהשורה התחתונה: למצוא מרצה ומתרגל טוב בשביל להבין באמת את החומר ולהצליח במבחן.", "timestamp": 1677838203660}, {"author": "*", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה \nחוות דעת - הרצאות: מרצה ממש מהירה, עוברת על החומר יותר מהר מעליזה (לטובה, מספיקים המון דוגמאות והעשרות שעוזרות להבנה). קצת אסרטיבית ולא נעימה לפעמים בשאלות\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מתרגל מצויין!! ממש מסודר וכותב כל תרגול מה נעשה בו, עונה לשאלות ואכפת לו מהתלמידים \n\nשעורי הבית: \nיש רפרנסים שזה נחמד, \nהוובוורקים ארוכים ממש מאיזשהו שלב\n\nהמבחן: \nאותו דבר כבר 20 שנה, אבל לא קל, כדאי ללמוד טוב אמריקאיות והוכח הפרך\n\nהשורה התחתונה: קורס חובה אז תעשו\nאם מבינים את החומר אפשר להוציא ציון ממש טוב", "timestamp": 1678027706560}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה סה\"כ סבבה, מדברת לפעמים מהר ולא הכי מסודרת. הכיתות לרוב מפוצצות אז גם יש זום. בכללי לקראת סוף הסמסטר קניתי את הספר שלה של הקורס והצטערתי שלא עשיתי את זה מוקדם יותר כדי להיות על החומר. יש לה גם הרצאות מוקלטות ביוטיוב על כל החומר.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: פשוט מצויינת. מסבירה טוב, מנגישה את החומר ועונה על שאלות. טיפה עמוס בכיתה אז צריך להגיע מוקדם בד\"כ.\n\nשעורי הבית: לא קשים במיוחד אבל הגליונות יכולים לקחת המון זמן.\n\nהמבחן: המבחן סה\"כ הוגן וחוזר על עצמו ככה שאפשר להצליח במבחן אם פתרת מספיק מבחנים ואתה זוכר טוב איך לפתור את החומר. החומר למבחן הוא כל הנושאים האחרונים של הקורס.\n\nהשורה התחתונה: הקורס כמו שמצפים ממנו לקורס מתמטיקה בסמסטר א'. הוא לא סופר עמוס, המבחן בסוף הוגן ופשוט צריך לוודא להיות על החומר לאורך כל הסמסטר ובמיוחד על הנושאים האחרונים כי הם דומיננטים מאוד במבחן.", "timestamp": 1678173226138}, {"author": "הילה ביליה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: אחלה עליזה\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: \nהדבר הכי טוב שקרה לי בטכניון. מקצועית,  משקיעה בסטונדטים, התרגולים שלה ברורים בזכות המצגות. הצילה אותי במקצוע (היא והחשבוניה)\n\nשעורי הבית: הוגנים\n\nהמבחן: הוגן\n\nהשורה התחתונה: לא לפחד מאלגברה!!! מקצוע קל אם יושבים מספיק", "timestamp": 1678369136598}, {"author": "אא", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: עם כל האהבה לסלבית האהובה, הייתה צריכה לעשות 3 הרצאות השלמה כי היא התעכבה יותר מדי על שאלות סטודנטים. האם היה שווה את זה? לא בהכרח, כי את הנושאים החשובים למדנו במהירות \"ראפ גוד\" של אמינם. מצד שני- היא מתוקה משתדלת ומדברת ברור. והיא המרצה והמתרגלת האחראית\n\nשם המתרגל/ת: גרשון <3\nחוות דעת - תרגולים: אין מה להוסיף. גרשון אברהם לשלטון. יכול להסביר לי על מניות ובורסה ואני אבין את הכל ואהיה אילן מאסק הבא. יכול להיות טיפה מהיר לאנשים, אבל מכסה המון סגנונות של תרגילים. מומלץ בטירוף\n\nשעורי הבית: עומס של קורס 5 נק\"ז. חשוב לעשות כי מופיעים במבחן. באמת עוזר להבין תחומר.\n\nהמבחן: אם הבנתם 100% שני נושאים אחרונים אתם תוציאו 60+, כל שאר הדברים פחות רלוונטיים. יש שאלות שבהן הקפיצה למסקנות יכולה לשבור שיא גינס. סך הכל הוגן מכל הלא הוגנים.\n\nהשורה התחתונה: קורס עמוס עם מלא נושאים ודברים ללמוד. אפשר להיות עם מוח על קיבולץ 50% עד השבועיים האחרונים ולהצליח בגדול", "timestamp": 1678389031728}, {"author": "נעם גולדמן", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: עליזה מסבירה מצוייין, מתעכבת הרבה על שאלות מהקהל, ככה שמי שרוצה יכול פשוט לשמוע את ההקלטות שלה ולחסוך ממנו את זה.\n\nשם המתרגל/ת: הילה מעיין\nחוות דעת - תרגולים: \nמתרגלת מעולה, מסבירה באופן מפורט ובקצב טוב.\nשעורי הבית: לא קשים מידי, יש רפרנסים, חשוב לנסות לבד.\n\nהמבחן: לא פשוט, צריך להגיע מאוד חדים ומאוד על החומר בשביל לקבל ציון טוב, יש הרבה טריקים.\n\nהשורה התחתונה: קורס קשה, עמוס בחומר, אבל לדעתי מעניין.", "timestamp": 1678668829115}, {"author": "Nir Karl", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאלה אבידן\nחוות דעת - הרצאות: מפוזרת מאוד, אני פחות התחברתי לדניאלה, כי היא מלמדת מאוד מפוזר, היא קופצת מנושא לנושא וקשה לעקוב. אם מצליחים לעקוב, היא מרצה אחלה.\n\nשם המתרגל/ת: הילה שפלר\nחוות דעת - תרגולים: הילה אחלה, מלמדת ברור, דואגת להסביר ולהביא הרבה דוגאמות רלוונטיות, בנוסף יש לה דפי סיכום של התרגולים שזה נחמד מאוד.\n\nשעורי הבית: דורשים הבנה בחומר, ויש הרבה מהם.\n\nהמבחן: קשה, אבל אם מבינים את החומר תוך כדי הסימסטר, ודואגים לתרגל היטב את החומר לקראת המבחן (ולסכם תוך כדי הסימסטר) אז אפשר להוציא ציון טוב.\n\nהשורה התחתונה: קורס עם הרבה שיעורי בית ומשפטים שצריך לזכור.", "timestamp": 1678692301367}, {"author": "Happy", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה (המלכה) אבידן\nחוות דעת - הרצאות: מרצה מהירה יחסית, אבל מסבירה טוב מאוד עם המון המון דוגמאות. לפעמים נותנת טיפה פחות מקום לדוגמאות אבל זה לטובה כי היא מספיקה יותר מהר את החומר ממרצים אחרים, לי עזר שהיא פחות התעכבה באמצע ההרצאות על שאלות ונתנה רצף לחומר. \n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: המתרגל הכינטוב שיש, סוג של אלוהים, הייתי איתו באלגברה ובחדוא והוא פשוט עשה לי את הסימסטר. גרם לי להצליח במקצועות המפחידים האלו. הוא מהיר אבל נותן כמות דוגמאות שלא תחשבו שתוכלו לקבל. במקצועות האלה כמות הדוגמאות זה החשוב ביותר לדעתי. יש לו רשימות מודפסות כך שלא חייב לכתוב בתרגולים שלו.\n\nשעורי הבית: גיליונות כל שבועיים ווובורק בערך כל שבוע. חשובים מאוד להבנת החומר. לא להכחיש אותם, ממליצה להשקיע בהם בסימסטר.\n\nהמבחן: המבחן לא היה קשה. הוא נראה אותו דבר כבר בעשר שנים האחרונות בערך… מי שלמד טוב כל הסימסטר לא צריך יותר מידי להשקיע בלמידה למבחן. בנוסף יש שאלה אחת של עשר נקודות שהיא שאלת יעורי בית.\n\nהשורה התחתונה: קורס חובה, דניאלה מצויינת, ממליצה לעבוד קשה לאורך כל הסימסטר כי אז זה באמת מקצוע קל עם ציון גבוה.", "timestamp": 1678705344651}, {"author": "Nadav Elmaliah", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nאם כבר ללכת להרצאות, אז לא כדאי של עליזה, נכון היא כוכבת אבל יש את כול ההרצאות שלה ביוטיוב כמעט אחד לאחד ואפילו ברמה גבוהה יותר, חוץ מזה שההרצאות שלה תמיד ממש עמוסות והיא עונה למלא שאלות ולכן יוצא מצב שצוברים פערים בחומר ביחס לקבוצות האחרות ואז צריך לעשות הרבה הרצאות השלמה.\n\nשם המתרגל/ת: קרוואן \nחוות דעת - תרגולים: \nהמתרגלת הכי טובה בטכניון, היא פשוט מדהימה, ברמה שלקראת סוף הסמסטר לא הספקתי לראות את ההרצאה של עליזה על ערכים עצמיים ווקטוריים עצמיים, הגעתי לתרגול של קרוואן והבנתי את כל החומר בלי להיות בכלל בהרצאה. כל עבודה שהייתה להגשה נעזרתי בתרגולים שלה ופתרתי בקלות בזכותה. \nבאמת שאם תלכו לתרגולים שלה לא תתחרטו.\nשעורי הבית: \n\nהמבחן: \nעמוס מאוד, מרגיש שאין מספיק זמן לפתור הכול.\nיש הרבה חזרה על היסודות בעיקר על גרעין ומימד קבוצות פורשות וכו'. שאלה אחת על מספרים מרוכבים אז אני החלטתי לוותר עליה והתמקדתי בדברים אחרים שהיו חשובים יותר.\nלדעתי הכי חשוב זה פשוט לתרגל ממש טוב את סדר הפעולות שצריך לעשות כשפותרים שאלה, כמו מתכון טוב שזוכרים בעל פה. חוסך הרבה זמן וטעויות דביליות. והכי חשוב לפתור לאט ובזהירות. לא למהר לענות ולא למהר לרשום תוצאה, לוודא שכל צעד הוא נכון אחרת הולכת שאלה שלמה על שטות.\nהשורה התחתונה: \nקורס חשוב מאוד. השימושים שלו הם באמת אינסופיים, כמעט בכל תחום תוכלו לראות שימוש של אלגברה לינארית. פיזיקה, מדעי המחשב, בינה מלאכותית, טייס אוטומטי ועוד המון. ממליץ להשקיע בקורס הזה הוא חשוב ושימושי להמשך.", "timestamp": 1678821165647}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוסי כהן\nחוות דעת - הרצאות: \nמרצה טוב, חוזר על עצמו כמה פעמים השיעור עובר באופן מסודר ומצחיק. כיף ללמוד איתו כשזה בקבוצה קטנה, אל תשוו לחדוא\nשם המתרגל/ת: אלון פלדמן\nחוות דעת - תרגולים: מתרגל מעולה מסודר קל לעקוב אחריו ומסביר ממש טוב מומלץ!!\n\nשעורי הבית: גליון פעם בשבועיים, דורשים עבודה\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס חובה", "timestamp": 1678899707810}, {"author": "Leeyam bat el", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד \nחוות דעת - הרצאות: הגעתי לניר אחרי שהייתי אצל דניאלה אבידן ועברתי בגלל כמות האנשים. הכיתה יותר קטנה שזה נחמד (למי שזה חשוב). ניר מדבר בלהט על החומר, ובד\"כ בשפה מעוד \"עממית\", אבל לפעמים הוא סוטה לדברים מאלגברה למתמטיקאים, וזה קצת מבלבל. \n\nשם המתרגל/ת: גרשון אברהם \nחוות דעת - תרגולים: מתרגל ששווה להגיע אליו. גורם להרבה אסימונים ליפול. מדבר מהר וכותב מהר אז מתאים למי שמצלם את הלוח/לא צריך לכתוב. \nמספיקים אצלו הרבה דוגמאות, ולפעמים אפילו עוקפים את המרצה בחומר. \n\nשעורי הבית: ארוכים, ארוכים, ארוכים. יש 5 מטלות הגשה חובה, ו8 וובוורקים. הרבה עבודה סיזיפית, פרט להוכחות שלפעמים יכולות קצת להסתבך.\n\nהמבחן: \nעליזה מלק כותבת אותו, יש הפרשים ברמה בין המועדים לפעמים. \nהשורה התחתונה: \nקורס מתמטי - המטלות בו לוקחות זמן, יש רפרנסים כמעט להכל אז אפשר להסתדר למי שצריך, אבל כל מטלה ארוכה. המבחן ברמת קושי בינונית אבל מי שעושה מספיק מבחנים ורואה מספיק טריקים יסתדר בכל השאלות, למעט הוכח-הפרך שם מדובר בידע ובשליטה בהוכחות.", "timestamp": 1678946211587}, {"author": "פאקטור", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: עליזה ואז ניר בן דוד ואז צילג ז\"ל\nחוות דעת - הרצאות: \nמיותר, בינג' של דוד צילג עלול להציל את מצבכם.\nההרצאות של עליזה מפוצצות בקטע רע, בתחילת הסמסטר תאלצו להגיע ב7:30 בבוקר כדי לתפוס כיסא.\nשם המתרגל/ת: ניר אלפסי\\ויויאן\nחוות דעת - תרגולים: \nניר בן אדם ממש נחמד ומלא בכוונות טובות, קצת רץ ולא הכי ברור.\nויויאן אחלה אבל הכיתה שלה מפוצצת, תגיעו ברגע שהכיתה מתפנה.\nשעורי הבית: \nחרדות\nלרפרנס\nלהשתמש במחשבון מטריצות ויפה שעה אחת קודם\nהמבחן: \nקריאת שמע לפני זה לא תזיק\nתתרגלו כמה שיותר מבחנים, תתעקשו על להבין מה אתם עושים.\nהשורה התחתונה: רק צילג \nתקנו חשבוניה\nבסוף זה יעבור, תשתדלו לנסות להבין קצת במהלך הסמסטר ולא רק בתקופת מבחנים.", "timestamp": 1678998699195}, {"author": "Tom Nir", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: הרצאות מעולות! ניר מצחיק מאוד אך יחד עם זאת יודע להעביר את החומר בצורה ברורה. מאוד חשובה לו ההבנה של כלל הסטודנטים בכיתה והוא מוכן להתעכב עד כמה שניתן כדי לוודא אותה.\n\nשם המתרגל/ת: ניקה פת\nחוות דעת - תרגולים: התרגלים היו סה\"כ טובים, לדעתי קצת איטיים מדי. לניקה חשובה מאוד ההשתתפות של סטודנטים בשיעור אז אם אתם מסוג הסטודנטים שמעורבים בשיעורים היא מומלצת אך לדעתי הילה מעיין טובה יותר ואם יש לכם את האפשרות לכו אליה.\n\nשעורי הבית: הוובוורקים חשובים מאוד, זה קורס טכני והמבחן עמוס בטריקים שנחשפים בוובוורקים לחלקם במהלך הסמסטר.\nכמובן שהגיליונות גם הם חשובים מאוד.\nממליץ מאוד לא לחכות שיודיעו על פתיחת הגליונות להגשה אלא לעשות אותם כבר כשהידע שלכם מאפשר את זה (לעתים יש דחייה משמעותית במועדי הפתיחה וכל השאלות והגיליונות מופיעים באתר הקורס מתחילת הסמסטר). \n\nהמבחן: קשה אבל לא מאוד לדעתי, שווה לתרגל את המבחנים המאוחרים כשעליזה המרצה האחראית כי מבנה המבחן די חוזר על עצמו.\n\nהשורה התחתונה: קורס מעניין, בחלקו הגדול מאוד טכני אך גם פותח דרכי מחשבה ומעניין.", "timestamp": 1679089279195}, {"author": "הצל", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: היה קצת לא ברור מה המטרה מההתחלה, לטעמי עדיף לעבור כמה שיותר מהר על כל החומר ברפרוף יחסית כדי להגיע כמה שיותר מהר לפואנטה ואז לחזור אחורה ולהעמיק, ההעמקה הטכנית של החומר בוובוורק ובהגשות מספיקה ואין טעם להתעקב. \n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: היה טוב, עד שבשלב מסוים התחילה לרוץ על החומר ולא נתנה מקום לשאלות דווקא כשהגענו לחלק החשוב של הקורס \n\nשעורי הבית: חשובים להבנה הטכנית.\n\nהמבחן: הוגן \n\nהשורה התחתונה: מעיק", "timestamp": 1679158061265}, {"author": "חוזר על הקורס", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לא נוכחתי בהרצאות (חוזרת חל הקורס)\nחוות דעת - הרצאות: \nאבל חזרתי על התוכן שלהם מהספר של עליזה בהתאם \nשם המתרגל/ת: ויויאן לאוין  \nחוות דעת - תרגולים: אני לא יודעת למה אף אחד לא דיבר לנו שהיא תותחית מההתחלה , לדעתי המתרגלת הכי טובה לאלגברה אם הייתם עמה מהתחלת הסמסטר , אני אישית ניסיתי  כל כך מתרגלים באלגברה גם הסמסטר ו גם בשנה הקודמת אבל אין עליה יצאתי עם 85+ רק מהתרגולים שלה , היא גם פותחת קבוצה בוואצאפ ו עונה על כל שאלה שנשאלת ו זה כלומר לא מובן מאילו \nלכו לויויאן כדי שלא תחזרו על הקורס\nשעורי הבית: \nכל 2-3 שבועיים יש אחד סבירים לדעתי אבל ארוכים יש גם הWebwork עוזרות מאוד להבנת החומר\nהמבחן: \nאני לא נכנסתי למועד א רק ל ב ו לדעתי היה סביר \nהשורה התחתונה: קורס חשוב אבל עם בחירות טובות ו למידה שבועית תצאו עם ציון טוב , קורס טכני", "timestamp": 1679266307776}, {"author": "yaara bi", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה ויוסי\nחוות דעת - הרצאות: דניאלה מרצה קשה. היא רצה על החומר ולא עונה על שאלות. גם אם מגיעים אליה בהפסקות בין ההרצאות לא תמיד תרצה להסביר. יוסי לעומתה מקסים. ההרצאות אצלו מצחיקות, הוא מלמד ברור ועוצר להסביר במידה כשצריך.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679293575213}, {"author": "מאיה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: \nמרצה מעולה!!! מסודרת, מעניינת ומצחיקה. מאוד עמוס בשבועות הראשונים אבל מתאזן.\n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: \nמהיר, מובן ומסודר. ממליצה ממש.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679327854169}, {"author": "קיילי המילטון", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאלה \nחוות דעת - הרצאות: מלכת על מהחלל לא יכול לדמיין את עצמי עובר את הקורס עם מרצה אחרת \nיש גם סיכום שלה יפה וכמו שצריך משנים קודמות והיא חוזרת עליו באמת כמעט אחד לאחד זה מעורר פליאה \n\nשם המתרגל/ת: הילה מעיין \nחוות דעת - תרגולים: המתרגלת הכי טובה בהיסטוריה עשיתי סקר \n\nשעורי הבית: מבלבלים וחשובים מאוד קשה להתרגל הוחכות כמו שצריך וחשוב לנצל את הפידבק כדי ללמוד \n\nהמבחן: הוגן מבלבל אבל אפשרי מאוד \n\nהשורה התחתונה: קורס חשוב להבנתי הוא גם משפיע מאוד בהמשך שווה ללמוד כמו שצריך ולא להסתפק בעובר", "timestamp": 1679386798990}, {"author": "amit kaminer", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה\nחוות דעת - הרצאות: \nמרצה די טובה אם מצליחים לשבת קדימה\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: \nמעולה, גם זמין לעזור ב1 על 1 אם צריך\nשעורי הבית: \nיש המון, אבל לעשות אותם כמו שצריך בלי רפרנסים (עד כמה שאפשר) זה הדבר הכי אפקטיבי שתוכלו לעשות בשביל עצמכם\nהמבחן: \nאם מתרגלים מספיק ויודעים טוב הוכח-הפרך מגליונות ש\"ב לגמרי אפשר להפיץ\nהשורה התחתונה: \nקשה, אבל עליזה מנהלת אותו ברמה מטורפת ולגמרי אפשר להצליח בו", "timestamp": 1679734178005}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה מאלק\nחוות דעת - הרצאות: חד משמעית המרצה הכי טובה שיצא לי לפגוש, מאוד נהניתי בהרצאות שלה והבנתי את החומר. מעבר לזה, כיף להרגיש שהמרצה רואה אותך כאדם ורוצה שתצליח. למי שהקליטה שלו מהירה ואין לו בעיה לראות סרטונים- הייתי ממליצה אולי לראות את הסרטונים ביוטיוב במקום ההרצאות שכן עליזה עונה לכל שאלה מה שיוצר פער בקצב.\n\nשם המתרגל/ת: ניר אלפסי\nחוות דעת - תרגולים: ניר מתרגל נהדר, תמיד זמין לכל שאלה ובמהלך השיעור מתעכב על החלקים הבעייתים. מעבר לזה מסביר מה הולך לבוא הלאה ומתי כדי להבין לעומק כי זה חלק קריטי להמשך.\n\nשעורי הבית: סבירים מאוד, אבל אצלנו בדיקת שיעורי הבית הייתה בדילאיי ככה שלא היה זמן לעבור על ההערות וללמוד מהן.\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1679763733332}, {"author": "ר.מ", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאלה אבידן \nחוות דעת - הרצאות: דניאלה מהממת, מסבירה את החומר בצורה מושכת, מורגש שהיא אוהבת מה שהיא עושה, אך הבעיה שהכתיב שלא אינו מסודר, ולפעמים קשה לקרוא.\n\nשם המתרגל/ת: רואן טרביה\nחוות דעת - תרגולים: ממליצה בחום!, אהבתי את החומר והבנתי אותו רק אחרי התרגולים שלה.\n\nשעורי הבית: מכמים את החומר היטב, ודי קרובים לשאלות המבחן.\nהמבחן: לא קשה, השתי שאלות הראשונות טכניות, השאלות האחרות דורשת הבנה של החומר. \nלא קשה לעבור את הקורס עם ציון שמעל 80.", "timestamp": 1679954277449}, {"author": "המלך", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עליזה אהובתי\nחוות דעת - הרצאות: המרצה המצחיקה בטכניון, ליצנית אמיתית. מעבירה את החומר בצורה מעולה, כל ההרצאות שלה מהנות. מלכה\n\nשם המתרגל/ת: גרשון אברהם\nחוות דעת - תרגולים: המתרגל הכי טוב בפקולטה למתמטיקה בכל נושא אפשרי, רץ מהר על החומר ופשוט יודע הכל.\n\nשעורי הבית: ארוכים אבל סופר סופר חשובים להבנה, תנסו לא לרפרנס\n\nהמבחן: הוגן מאוד, מלא טריקים שגרשון תמיד מספר עליהם.\n\nהשורה התחתונה:", "timestamp": 1680165804764}, {"author": "S", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: הבדל שמיים וארץ מחדוא. באלגברה הכיתה הרבה יותר קטנה, יוסי מסביר מעולה, בקצב טוב, חוזר על הדברים ועונה על שאלות. וכמובן- מכניס הומור וצחוקים. באמת אכפת לו מהסטודנטים והוא עוזר להם כשצריך, וזמין גם בקבוצה בווצאפ שזה לא מובן מאליו.\n\nשם המתרגל/ת: ויויאן\nחוות דעת - תרגולים: כמובן שהיא מתרגלת הכי טובה בטכניון. מה שכן- צריך להילחם על מקום אצלה כי הכיתה מפוצצת. אני הייתי מגיעה מוקדם ואפילו יוצאת מהשיעור לפני מוקדם יותר כדי לשבת מקדימה, ורק ככה הצלחתי לעקוב אחרי מה שהיא עושה. היא כן מהירה אבל אחכ כשעוברים על החומר מבינים מה היא עשתה. המצגות שלה מאוד מסודרות ואם כתבת את הפתרונות לתרגילים ששם בתרגול, יש לכם את כל החומר בערך. ויויאן גם חכמה וזמינה בקבוצה ובווצאפ ואכפת לה מאוד! \n\nשעורי הבית: ממש לא קלים, וובוורקים ארוכים ומעמיסים (כמו וובוורק בכל מקצוע). הגליונות לא נוראים אבל די ארוכים ומוסיפים עוד מטלות. מומלץ לעשות את הרוב לבד, או לפחות לנסות, כדי לקלוט את החומר.\n\nהמבחן: לא תמיד כזה קשה, אבל ארוךך ברמה שאם עושים את כל השאלות וחושבים על כל שאלה (אפילו לא ברמת הלהיתקע עליה), ה3 האלה מספיקות בלחץ. המלצה שלי- לעשות הרבה מבחני עבר, הסגנון חוזר על עצמו, להשקיע בשאלות הפתוחות הראשונות כדי ללקט הרבה נקודות, ולשבת על הוכח/הפרך ואמריקאי שאתם חושבים שיש לכם סיכוי לצדוק בו. אם תתקעו על כל הפרכה אתם לא תספיקו את המבחן בחיים.\n\nהשורה התחתונה: בין חדוא לאלגברה אני לגמרי הייתי team אלגברה. זה יותר טכני וגם נבנה אחד על השני, ככה שלפעמים חומר שוקע גם הרבה אחרי שסיימתם ללמוד אותו, רק כי הוא משולב בנושא הבא.", "timestamp": 1680555770857}, {"author": "Raz Kachal", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  דניאלה אבידן\nחוות דעת - הרצאות: \nכותבת מאוד מפוזר על הלוח אבל מרצה מעולה ושווה ללכת אליה במקום להצטופף אצל עליזה\n\nשם המתרגל/ת: ויויאן מוקלט\nחוות דעת - תרגולים: מצויין, כל מה שצריך בהקלטות.\n\nשעורי הבית:  לא קשים במיוחד (יש רפרנסים)\n\nהמבחן: בוחן אמצע היה קשה ובמבחן הסופי היו ממש הוגנים.\n\nהשורה התחתונה:", "timestamp": 1688218309846}, {"author": "שוסי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: מרצה טובה ומסבירה את החומר באופן מובן, רואים שהיא יודעת טוב את החומר. היא עונה לכל מי ששואל בנחמדות והיא מנסה לעורר בנו עניין. \n\nשם המתרגל/ת: גרשון\nחוות דעת - תרגולים: גרשון אדם נחמד והשאלות שהוא מראה בתרגולים לקוחות ממבחני עבר ככה שמתחילים לפתור תרגילים ממבחנים כבר בתחילת הסמסטר. אבל הוא טס מהר על החומר ככה שהוא לא מתאים לכולם. אני פחות התחברתי למרות שהשאלות שהוא מביא ממש עוזרות במבחן ובשיעורי בית. הייתי ממליץ רק להקשיב ואחרי זה בבית להעתיק למחברת.\n\nשעורי הבית: ארוכים אבל לא מסובכים. כדאי לפתור לבד בעיקר את ההוכח/הפרך כי יש שאלת שיעורי בית במבחן ששווה 10 נקודות ומהווה 5 אחוז מגן ככה שחבל לא לנצל.\n\nהמבחן: לדעתי מועד א היה ממש הוגן. מי שתרגל הרבה מבחנים ראה שהרעיונות חוזרים על עצמם ואפשר עם השקעה לאורך הסמסטר להוציא ציון טיל.\n\nהשורה התחתונה: קורס נחמד ובסיס לכל קורסי ההמשך. חשוב להשקיע בו.", "timestamp": 1689018709780}, {"author": "A", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עליזה מלק\nחוות דעת - הרצאות: הייתי בכולם, אוברייטד לדעתי. לוקח לה המון זמן להעביר חומר שאפשר מהסרטונים שלה ביוטיוב להבין ב10 דקות. חוץ מזה היא אחלה ומצחיקה אבל בדיעבד ההרצאות לא קריטיות.\n\nשם המתרגל/ת: אברהם גרשון\nחוות דעת - תרגולים: מדהים! רץ בחומר אבל פותר המון תרגילים עם טריקים חשובים שהופיעו במבחן. חדמש המתרגל הכי טוב שיש לפקולטה של מתמטיקה להציע.\n\nשעורי הבית: ווב וורקים נחמדים, גליונות ארוכים רצח אבל חשוב לא לרפרנס.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: אחלה לא יותר לא פחות", "timestamp": 1689807853920}, {"author": "ינ", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  עליזה\nחוות דעת - הרצאות: הלוח שלה קצת מבולגן אבל היא מרצה מעולה ואכפת לה שכולם יבינו\n\nשם המתרגל/ת:  אחסאן\nחוות דעת - תרגולים:  אין על אחסאן\n\nשעורי הבית: דורשים הרבה זמן אבל עוזרים להבנת החומר ויש פתרונות לרוב המוחלט\n\nהמבחן:  ארוך ומתיש\n\nהשורה התחתונה:", "timestamp": 1714719487429}]}