{"posts": [{"author": "יואב סנדנר", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה:  מיכאל חנבסקי\nחוות דעת - הרצאות: \nלא ברורות, לא מובן סדר החומר הנלמד\nשם המתרגל/ת: עמית ויינטראוב\nחוות דעת - תרגולים: לא מספקים\n\nשעורי הבית: אין תמיד קשר לחומר הנלמד\n\nהמבחן: קל\n\nהשורה התחתונה:", "timestamp": 1602064021568}, {"author": "Jared Goldberg", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: מיכאל חנבסקי\nחוות דעת - הרצאות: מיכאל לא הסתדר כל כך טוב עם הלמידה המקוונת. הוא כן פרסם רשימות מבולגנות אך בסבירות אבל. \n\nשם המתרגל/ת: עמית ווינטרוב \nחוות דעת - תרגולים: קצת לא עקבי, קתצ מרפרף על טכניקות שבסוף חשובות למען התמונה הגדולה. \n\nשעורי הבית: סבירים לגמרי, עוזרים\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס מאוד חשוב ומאוד מעניין שהועבר בצורה לדעתי פחות מרואייה", "timestamp": 1603570395898}, {"author": "OG", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מקס גורביץ\nחוות דעת - הרצאות: \nאני הרגשתי שיש חלקים שבהם ההרצאות הועברו בצורה מאוד מאוד איטית ואז חלקים שפתאום מועברים מאוד מאוד מהר; למרות זאת לא היה קשה יותר מידי עבורי לעקוב אך שמעתי כי יש סטודנטים אחרים שהיה להם יותר קשה איתו.\nמעבר לכך בגלל שהיינו די מתקדמים בחומר חלקים גדולים של הסמסטר הוא הראה שימושים של חלק מהדברים שעשינו מחוץ למתמטיקה. (לדוגמא רגרסייה לינארית, שימושים בפיזיקה קוונטית וכו')\nאני אישית הייתי ממליץ לעשות איתו את הקורס.\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: \nהתרגול הראשון היה נוראי לכן לא הגעתי לאחר מכן לשום תרגול ורק השלמתי אותם מהרשימות שלהם שהוא העלה לאחר מכן.\nבשלב יותר מאוחר של הסמסטר התקשתי עם תרגיל בית לכן צפיתי בתרגול בנושא וראו שיפור משמעותי ברמת התרגול שלו, מעבר לכך ברור שהוא מנסה מאוד להשתפר בתור מתרגל (העלה אחרי כל תרגול אזור במודל לתת לו משוב על התרגול)\n\nשעורי הבית: \n10 גליונות, בערך 1 בשבוע.\nבהתחלה הגליונות היו מאוד ארוכים ועם הזמן הגליונות הצתמצמו באורך (ובקושי) עד רמה שבה מי שנמצא חזק על החומר של הקורס יכול היה לסיים את הגליון בית האחרון בפחות מ-15 דקות\nהמבחן: \nמבחן לדעתי קל יחסית.\nלרוב באלגברה ב במבחן יש שאלה של למצוא צורת ג'ורדן של מטריצה ובמקום זאת קיבלנו שאלה של SVD (חומר שלפחות ממבחנים של שנים קודמות לא היה נראה כי הכניסו אותו כל כך חזק במבחן) קצת מפתיע אבל למי שיודע את החומר זה לא אמור להיות יותר קשה מהרגיל.\nהשורה התחתונה: \nקורס קשה יחסית, לדעתי אפשרי במידה ויש מספיק זמן להשלים את רוב החומר אחרי ג'ורדן בשבועיים שלושה ככה שלא צריך להיות לחוצים עם מאבדים את המרצה בחלק זה.", "timestamp": 1625827478333}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: מקס גורביץ'\nמקס הוא ללא ספק המרצה הכי נוראי שהיה לי. הוא מאוד מבולגן, ומאוד קשה לעקוב אחריו. הוא התייחס להרבה דברים כטרוויאליים למרות שהם ממש לא טריוויאליים. אני אישית הרגשתי שהוא התייחס לקורס כקורס ריענון(כלומר הוא יצא מנקודת הנחה שראינו את החומר לפני כן), ולא הבין שזו הפעם הראשונה שמרבית הסטודנטים נתקלים בחומר שהוא מלמד.  כששאלתי אותו שאלות בהרצאה הוא יותר בלבל אותי מאשר ענה לי על השאלה. בנוסף הוא לא מלמד לפי ספר, כך שאי אפשר היה למצוא ספר מתאים וללמוד את החומר לבד(אין סיכוי שתצליחו להבין משהו מההרצאות). \n\nבשורה התחתונה הוא הפך את הקורס להרבה יותר קשה ועמוס ממה שהוא אמור להיות. \n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: מתרגל סביר. בתחילת הסמסטר הוא היה ממש לא ברור, אבל השתפר בהמשך.  חשוב לו שיבינו. \n\nשעורי הבית: קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: לא לקחת קורס עם מקס גורביץ' בשום מצב. גם לא תמורת שלום.", "timestamp": 1625840973583}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מקס גורביץ\nחוות דעת - הרצאות: מקס העביר את הרוב המוחלט של ההרצאות בצורה לא מובנת, גם אחרי שקוראים את הכתוב בהרצאה קשה מאוד להבין את השורה התחתונה, המון שאלות נותרות בלי מענה עם המשפט הקבוע- \"זה תרגיל\"-מה שבעיקר מעמיק את הפער שנוצר מההסברים המאוד כלליים שלו.\nלא מומלץ\n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: בתחילת הסמסטר גם אלעד וגם טלי היו מאוד לא מובנים, החלטתי להישאר עם אלעד בגלל שהוא המתרגל האחראי. היה לו  מאוד חשוב להשתפר במהלך הסמסטר ושאל לפידבקים לאחר כל תרגול, אך עם כל הרצון הטוב וההערכה התרגולים היו עדיין לא מאוד מובנים.\n\nשעורי הבית: בחצי הראשון של הסמסטר לא היה קשר בין התרגולים לבין הגיליונות שהיו קשים וארוכים מאוד. בחצי השני של הסמסטר הגיליונות היו באורך וברמת קושי סבירה (למי ששרד ועקב עד אותו שלב).\n\nהמבחן: קשה, היה צריך ללמוד איכשהו חלק נכבד מהחומר לבד.\n\nהשורה התחתונה: שילוב לא מתאים בעייני של סגל ההוראה גרם לנפילה קטסטרופלית של הקורס, שלא אמור להיות קשה ולא מובן ברמה שהועבר.", "timestamp": 1625938873084}, {"author": "חסוי", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מקס\nחוות דעת - הרצאות: \nהרצאות מזעזעות, לא מובן בעליל, המרצה לפעמים מאבד את עצמו תוך כדי ההרצאה,חסר קריזמה וסוטה לנושאים לא רלוונטים\nשם המתרגל/ת: אלעד, וטלי\nחוות דעת - תרגולים: גם לא ברורים\nלהגנתו של אלעד הקובץ תרגולים שהוא מעלה בסוף שיעור מדהים\nשעורי הבית: קשים ביותר הרבה טעויות שלא טורחים לתקנם עד הרגע האחרון \n\nהמבחן: קשה \n\nהשורה התחתונה: \nאין ברירה לקחת אותו ככה שמקווה לכם יהיה צוות יותר טוב", "timestamp": 1626028761017}, {"author": "לברדור", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מקסים גורוביץ\nחוות דעת - הרצאות: \nלדעתי הוא בן אדם דיי נחמד ואני לא חושב שהוא מרצה כלכך גרוע, אפשר להבין את החומר פשוט דיי קשה וגם ככה החומר לא פשוט. הבעיה העיקרית זה שהוא ממש מונוטוני אז קשה לשים אצבע מתי מה שהוא אומר חשוב, הוא גם לא מסביר מעברים במשוואות וזה קשה כשעדיין לא סגורים על ההגדרות והמסקנות מאותו שיעור\n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: \nבחיים לא ראיתי מתרגל שהשתפר ברמה של הלימוד שלו כלכך במהלך סמסטר. הוא מאוד נחמד וממש משתדל להשתפר ולקבל פידבק מסטודנטים.הוא לא מתרגל מסודר מאוד אבל לקראת סוף הקורס היה סבבה\nשעורי הבית: \nהכי קשים בעולם בערך לא פתיר\nהמבחן: \n\nהשורה התחתונה: \nקורס קשה", "timestamp": 1626072933426}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מקס גורביץ'\nחוות דעת - הרצאות: מרצה נחמד אבל לא מצליח ליצור עניין וההרצאות בסך הכל די משעממות. קשה לעקוב אחרי הקו הכללי של ההרצאות מה שגורם לחומר להרגיש מבולגן ולא ברור\n\nשם המתרגל/ת: אלעד צורן\nחוות דעת - תרגולים: מתרגל טוב, יודע את החומר עונה על שאלות ומסביר טוב. קצת רץ כדי להספיק את הכל\n\nשעורי הבית: יחסית קשים, כל גיליון לוקח כמה שעות עבודה ויוצא אחד כמעט כל שבוע. הגיליונות מכסים את כל החומר וטובים להבנה\n\nהמבחן: היה לא קל ודרש הבנה טובה של כל החומר, הסמסטר הממוצע היה יחסית נמוך במבחן, כנראה בגלל העבודה שרבים מהסטודנטים לא הבינו את החומר בצורה טובה\n\nהשורה התחתונה: קורס לא פשוט שמכיל המון נושאים שונים. צריך זמן כדי ללמוד למבחן", "timestamp": 1626762160489}, {"author": "הייייי", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מקס גורביץ\nחוות דעת - הרצאות: מבולגנות ומופשטות מדי, ממש קשה להבין את החומר\n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: יחסית בסדר, החומר באופן כללי לא הועבר טוב ולכן קשה לשפוט את התרגולים\n\nשעורי הבית: רמה הרבה יותר גבוהה מהתרגולים ומרגיש שהם לא קשורים לחומר בכלל\n\nהמבחן: יחסית בסדר\n\nהשורה התחתונה:", "timestamp": 1626867244084}, {"author": "Lidor", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מקסים גורביץ\nחוות דעת - הרצאות: המרצה אדם נעים ונחמד אבל לדעתי הוא לא הסביר את החומר בצורה טובה, היה מאוד מבולגאן, לא מובן, כששואלים אותו שאלות הוא אינו יודע מה לענות. רוב הזמן הוא פשוט מעתיק את ההוכחות מהדפים שלו ללוח. באופן אישי אני (ועוד סטודנטים רבים) הפסקתי ללכת להרצאות לאחר כמה שבועות ואני לומד למבחן באופן עצמאי דרך סיכומים של עדי וולף (שהלוואי שהייתה מעבירה את הקורס)\n\nשם המתרגל/ת: אלעד צורני \nחוות דעת - תרגולים: מגיע מוכן לתרגולים ואפילו מפרסם סיכום תרגול אחרי כל תרגול. ניכר שהוא משתדל וחושב על טובת הסטודנטים, אבל הגליונות שהוא היה נותן לנו היו לא פתירים בעליל, יש לו רף לא מציאותי לרמה שצריכה להיות לסטודנטים בקורס\n\nשעורי הבית: קשים מאוד (!), בדרך כלל מביאים בגיליונות להוכיח משפטים כבדים (שהם חלק מהחומר שצריך לדעת למבחן). ממליץ להעזר ברפרנסים ולא להיתקע עליהם יותר מידי \n\nהמבחן: ממוצע 56 (אחרי פקטור 5 נקודות), לא ניגשתי למועד א' אבל הבנתי שהוא היה נוראי (הממוצע אכן משקף את רמת ההבנה של רוב הסטודנטים בסיום הקורס)\n\nהשורה התחתונה: תקחו את הקורס עם סגל טוב ויהיה בסדר", "timestamp": 1627395442180}, {"author": "זיו דמיר", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מקס גורביץ\nחוות דעת - הרצאות: מרצה מהמעלה הראשונה ,אחד הטובים שהיו לי במהלך הלמידה שלי בטכניון ואני חושב שגם שיהיו, לצערי הייתי מבין הסטודנטים בהתחלה שחשבו שהוא לא מאוד טוב במה שהוא עושה וזה גרם לי לא ללמוד כמו שצריך את הקורס ולא לגשת למועד א', לאחר שחזרתי על ההקלטות הבנתי כמה טעיתי בהבנה הזו,כי לא הצלחתי להבין נושא מאוד פשוט בהתחלה וזה היה כמו כדור שלג.\nמרצה מומלץ ביותר,מה שכן, צריך להגיע אליו מוכן כמו שצריך עם החומר המקדים, אבל אם מגיעים מוכנים , הוא מביא תובנות רבות לגבי הוכחות מסובכות(הדברים שהוא עושה עם אינדוקציות על תתי מרחבים מרגיש כמו קסם) ,גרם לי לאהוב מחדש את החומר בקורס. העניין באלגברה זה להיות גמיש עם הגדרות ולדעת מתי לא לנסות לשבור את הראש על איזו הגדרה  או משפט שלא \"מסתדרים ישר\" , בסוף הכל מאוד הגיוני,מומלץ להעזר בlinear algebra done right כדי לתחזק את ההבנה.\n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים:  אחלה מתרגל , השתפר מאוד במהלך הסמסטר וידע להטמיע את הבסיס כמו שצריך.\n\nשעורי הבית: מאתגרים בהחלט, בהתחלה לא הבנתי מה הקשר בין השיעורים להרצאות/תרגולים, בהמשך מבינים שזה היה משהו מתוכנן היטב שגרם לנו להבין הרבה יותר טוב את החומר. לקראת  הסוף הייתה ירידה בקושי בש.ב.\n\n\n\nהשורה התחתונה: קורס מדהים ביופיו שמביא כלים מדהימים להמשך התואר , ממליץ בהחלט", "timestamp": 1630331722645}, {"author": "יוראי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דר. מקסים גורביץ\nחוות דעת - הרצאות: לא משהו.\n\nשם המתרגל/ת: מר אלעד צורני\nחוות דעת - תרגולים: אלעד מאוד משקיע ואכפתי. קצת תיאורתי מידי ולכן כדאי לחשוב היטב למהות של התרגילים שמביא, שכן יש בהם הרבה חשיבות שלא תמיד שימושית למבחן אך כן לאלגוריתמיקה וכו\n\nשעורי הבית: סבבה\n\nהמבחן: פייר מאוד.\n\nהשורה התחתונה: זה קורס חובה, ממליץ לחזור עליו בכל מקרה. זה 5 נק\"ז ולקבל בו ציון גבוהה זה יותר קל מאינפי 1 או 2 (לא עם רוס)", "timestamp": 1630579215340}, {"author": "NONE", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: מקס גורביץ'\nחוות דעת - הרצאות: בחור חביב סה\"כ, אך עושה את המינימום הנדרש, מרגיש כאילו מישהו מכריח אותו להרצות. לא העלה רשימות, לא העלה למודל פתרונות למבחנים ואפילו את הערעורים על הבחינה נתן למתרגל לבדוק. \nברמת החומר- מקס אוהב העתקות אבסטרקטיות יותר ממשחקי מטריצות, וזה ניכר בכל היבט בקורס. \n\nשם המתרגל/ת: אלעד צורני וטלי מונדרר\nחוות דעת - תרגולים:  \nטלי - הראתה אי-בקיעות בחומר, לעיתים קרובות התלמידים הסיטו אותה טיפונת ממה שמופיע לה בדפים והיא איבדה אוריינטציה.\nאלעד-  מעלה רשימות וכותב מסודר, רמת התרגילים בתרגולים נמוכה מאוד ולא מתקרבת לרמה במבחן. באופן כללי לא הצלחתי להנות מהתרגולים וזאת בלשון המעטה. מוזר בתרגולים שלו.\n\nשעורי הבית: \n13 גליונות בערך, 15% מגן. בתחילת הקורס היו גליונות עמוסים וארוכים, בסוף קיבלנו 2-3 שאלות פשוטות בגליון (סגל זורק כבר אמרנו?)\n\nהמבחן: \nהמבחנים היו סבירים לחומר הנלמד. אבל, ויש אבל גדול - סגל הבודקים לא מצליח להבדיל בין עיקר לטפל, ומתקטנן על טיעוני אלגברה א'. בערעורים ובפניות הבודקים מסתתרים מאחורי איזשהו מכוון בדיקה חסוי שידוע רק להם ומצדיקים את בדיקתם איתו, אך מצפייה בכמה בחינות אין שום עקביות ואחידות באופן הבדיקה, ממש \"תן לסיים וללכת הביתה\". \n\nהשורה התחתונה: קורס נחמד ומעניין, סגל נוראי, ממליץ בחום לא להתקרב לקורס אם הסגל מורכב מרובו מסגל אביב 2021.", "timestamp": 1635863130727}, {"author": "Benjamin Mayan", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר בן דוד\nחוות דעת - הרצאות: \nניר הוא מרצה מעולה (הכי טוב שפגשתי עד כה בטכניון) ההרצאות שלו היו ממש מעניינות, הוא תמיד הסביר את התמונה הגדולה של נושא מסויים לפני שהתחיל להיכנס אליו לעומק ונתן כל מיני אנקדוטות מעניינות על הקשר של הנושאים שנלמדים למתמטיקה כולה ולנושאים אחרים. \nניר קצת מבולגן בהרצאות, ולפעמים קצת היה קשה לעקוב אחריו, אבל מאוד חשוב לו שהסטודנטים יבינו את החומר היטב וכששואלים אותו שאלה הוא יורד לשורש הבעיה ומסביר לעומק. \nמומלץ ללכת לשעת קבלה שלו אם יש משהו שלא מובן. \nבקיצור אחלה מרצה וממש כדאי לקחת איתו את הקורס. \nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: \nהתרגולים לא תמיד היו קשורים למה שנלמד בהרצאה, ואלעד לא פעם התבלבל והסתבך עם שאלות.  אבל בסך הכול אלעד היה מתרגל סבבה והיה לו חשוב לענות על שאלות. \n\nשעורי הבית: \nדי ארוכים ולרוב לא קשורים בכלל למה שנלמד בהרצאות...  \n\nהמבחן: \nמועד א' היה קשה וארוך מדי והבדיקה הייתה רצחנית, הממוצע היה בהתאם (היה פקטור של 15 נקודות) מועד ב' היה קצת יותר קל אבל 2 המבחנים היו עם 6 שאלות שכמעט כולן כוללות חישובים ארוכים שגוזלים הרבה זמן. \nהשורה התחתונה: \nקורס מעניין (במיוחד למי שהיה לו מעניין באלגברה א) המשך ישיר לאלגברה א, יש בו הרבה תוצאות מפתיעות ומגניבות.  עמוס ודורש לא מעט השקעה כדי להבין את החומר ולשלוט בו", "timestamp": 1646914258786}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ניר בן-דוד\nחוות דעת - הרצאות: \nמרצה מעולה\n\nשם המתרגל/ת: אלעד צורני\nחוות דעת - תרגולים: \nהתרגולים מיותרים. אלעד לא היה מתואם עם המרצה והתרגילים לא היו קשורים לשאלות של המבחן\nשעורי הבית: \nקלים מאוד ולא תורמים בכלל להבנת החומר\nהמבחן: \nמבחן הוגן וטכני אבל ארוך יחסית \nהשורה התחתונה: \nחומר מאוד מעניין חבל שלא משקיעים זמן בלכתוב שיעורי בית ותרגולים מתאימים", "timestamp": 1647596723099}, {"author": "THE MOGDOM", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקסים גורביץ'\nחוות דעת - הרצאות: מקסים היה די מבולגן עם הדרך שבה הוא הרצה, וגם העובדה שהוא לא פירסם רשימות ובכל זאת צוטט מהם היה מקשה\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: נראלי ששמו הולך בפני עצמו, אחד המתרגלים הכי טובים בפקולטה אני מאמין\n\nשעורי הבית: שיעורי הבית היו ממש סבירים ועזרו להבין את החומר\n\nהמבחן: עוד לא עשיתי הוא מחר אבל אמאלה המבחנים של מקסים מפחידים\n\nהשורה התחתונה: אם אני לא אשרוד את המבחן מחר, תדעו שאהבתי אתכם", "timestamp": 1657565671590}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מקס\nחוות דעת - הרצאות: סבירות\nמקס נורא משתדל ועובד בצורה מאוד ריגורוזית ומסודרת (פרקים, תת-פרקים, תת-תת פרקים... לפעמים זה כבר מוגזם).\nהבעיה היא שקשה להבין אותו ולא מעט פעמים ההגדרות שהוא נותן בכיתה הן סתם סיבוך מיותר של הנושא, כשלמעשה זה מאוד פשוט.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מצוינים ועושים סדר בבלגן, מציע לא להבריז.\n\nשעורי הבית: קשים אבל תורמים מאוד להבנה של החומר\n\nהמבחן: קשה. היו 6 שאלות מתוכן צריך לבחור 5, וכל אחת הייתה ארוכה ממש. לא הספקתי לענות על סעיף לפחות בכל שאלה. המכשול העיקרי הוא הזמן, אבל גם השאלות עצמן קצת מורכבות להבנה ודורשות לקרוא אותן כמה פעמים.\n\nהשורה התחתונה: קורס יפה ומומלץ מאוד, אבל אולי לחפש מרצה אחר לכך.", "timestamp": 1658074051815}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מקס גורביץ\nחוות דעת - הרצאות: מסודרות מאוד, עד כדי מספור של פרקים ותתי פרקים בקורס, ובכל אחד מספור של טענות, משפטים, הגדרות וכו'.. לי באופן אישי הסדר הזה עוזר.\nבנוסף מקס היה מאוד ריגורוזי בהוכחות שכתב בכיתה, וגם אם לא הצלחתי להבין עד הסוף בזמן ההרצאה לפחות היה עם מה לעבוד אחר כך (להבדיל ממרצים אחרים שלפעמים נוטים להשאיר חורים גדולים בהוכחות שקצת קשים לגישור).\nבסה\"כ ללמוד אצל מקס הייתה חוויה טובה.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: משקיע מאוד בתרגולים, והעלה רשימות מסודרות מאוד למודל.\nבנוסף רן פתח לקורס פורום פיאצה שהיה ניתן לשאול בו שאלות על שעורי הבית וגם כלליות - זה לא משהו שראיתי בקורסים אחרים, שבדרך כלל נותנים מענה לשאלות מתמטיות רק בשעות קבלה, ולדעתי זה עוזר ומוערך מאוד.\n\nשעורי הבית: היה אחד בכל שבוע, דורשים לא מעט זמן אבל מאוד תורמים להבנת החומר.\n\nהמבחן: היו 6 שאלות שמתוכן היה לבחור 5, כל אחת די ארוכה מהרגיל. לטעמי כל תת קבוצה של 5 שאלות שמתוכן יש לבחור 4 יכלה ליצור מבחן הוגן יותר.\n\nהשורה התחתונה: קורס ממש יפה, מאוד נהניתי ממנו וגם מהסגל. ממליץ להיעזר גם בספר Linear Algebra Done Right וגם בסרטונים ביוטיוב של Sheldon Axler שכתב את הספר.", "timestamp": 1658768907406}, {"author": "סטודנט רנדומלי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקס\nחוות דעת - הרצאות: מוכיח לעומק, בונה מיליון טענות עזר שלפעמים גורמות לך לאבד את הרצף\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: התרגולים עם אלעד היו בקבוצות קטנות יותר ככה שמי שהיה צריך אקסטרה חידוד לדברים נהנה אצלו יותר\n\nשעורי הבית: טובים ומכסים את החומר, לפעמים היה צורך בחידודים / רמזים והמתרגלים תמיד שמחו לענות..\n\nהמבחן: לא פתיר ב3 שעות, ניתן פקטור\n\nהשורה התחתונה: קורס חובה, מה תעשו? סתם. קורס סופר חשוב ומעניין ואם מתעלמים מהמבחן החוויה ממנו טובה מאוד.", "timestamp": 1658952200507}, {"author": "אחלה", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מקס גורביץ'\nחוות דעת - הרצאות: מרצה לא טוב. ההרצאות מבולגנות, מקס בעיקר מסביר ללוח ולא לכיתה ... מעתיק מהדף וטועה בהעתקה / יש אצלו טעויות בדפים שהוא פשוט לא יודע להסביר - בקיצור פשוט לא מגיע מוכן להרצאה.\nהחומר עצמו עבר בצורה שונה מהספרים של הפתוחה ולכן אי אפשר גם ללמוד בעזרתם.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: מתרגל מצוין לצד פלטפורמה תומכת - רשימות, פיאצה וזמינות מטורפת. \n\nשעורי הבית: ארוכים מאוד + מלא טריקים מהתרגולים של רן. לא היו שאלות הבנה עמוקות מאוד. היה אחלה שאלות רשות.\n\nהמבחן: קשה בצורה לא סבירה, לצד בדיקה קשה מאוד. \n\nהשורה התחתונה: לא לקחת מקס גורביץ, כן לקחת רן קירי.", "timestamp": 1659171409067}, {"author": "עידו ראובן", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מקס\nחוות דעת - הרצאות: ההרצאות היו מאוד קשות לעיכול לאורך הסמסטר. מקס מרצה מסיכומים שיש לו שהוא לא מוכן לפרסם, שזה מובן, אבל מאוד קשה להגיע להוכחה בשבוע החמישי ולראות משפט כמו \"לפי משפט 1.12\" שלכו תדעו מה היה במשפט 1.12 כי לא מספרתם אחריו דברים 0_0.\n\nשורה תחתונה, חובה למספר את המשפטים/הגדרות/למות לאורך הסמסטר כי אחרי זה מאוד קל לנווט בחומר. בנוסף לזה יש כל מיני הערות שמקס זורק לאוויר כאילו הן מובנות מאליהן, והן יותר ברורות אחרי שחוזרים על כל החומר מחדש.\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: רן קירי מתרגל מעולה. בתרגולים עצמם הוא אמנם מעביר תרגילים כבדים, אבל אחרי שהוא מסביר את הכוונה מאחורי התרגילים זה נותן אינטואיציה מאוד חזקה להכל. בנוסף הוא משקיע המון מעצמו בשביל סטודנטים שצרכים שעות קבלה או עזרה בחומר.\n\nשעורי הבית: \nקשים וארוכים\n\nהמבחן: \nהוגן\n\nהשורה התחתונה: \nסהכ הקושי האמיתי של הקורס מגולם באופי שכתוב ההרצאות והתרגולים. ככל שתשקיעו יותר בהעתקה מוחלטת של הלוח למחברת ככה יהיה יותר קל לחזור על הדברים מחדש ולהבין את הקשר בין ההרצאות השונות.", "timestamp": 1665229641169}, {"author": "****", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מקסים גורביץ\nחוות דעת - הרצאות: \nקשה מאוד לעקוב אחרי ההרצאה ובעיקר על זה שיש לו רשימות שהוא לא מעלה אבל עדיין ממספר בשיעור וחושב שמובן לנו על מה מדובר כשהוא אומר לפי משפט 2.3.4 שבכלל היה בהרצאה 5 ואתם בהרצאה 16 כבר. מי שלוקח איתו תמדדו כמה זמן לוקח לו להסיט מבט בחזרה לקהל זה מוסיף שעשוע לשיעור כי פשוט הוא כמעט תמיד עם הפנים ללוח.\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: \nאחד המתרגלים היותר טובים שהיו לי כאן, בעיקר בזכותו ולא בזכות מקס אני יודע אלגברה.\nשעורי הבית: \nלא פשוטים בכלל אבל מי שפותר. כל מבין את החומר לעומק בצורה הרבה יותר טובה.\nהמבחן: \nמועד א היה סיוט על גבול הבלתי אפשרי לפתרון בזמן, ראיה לכך הייתה שלא היה אחד שקיבל מעל 88 במבחן עצמו.\nמועד ב היה מעט יותר סביר למרות ששינו מלא דברים באמצע וזה גרם להם להוסיף רבע שעה אבל המבחן היה עדיין ארוך מאוד.\nהשורה התחתונה: \nקורס לדעתי מעניין ברמות, עדיף לא לקחת עם מקס וכן עם קירי.", "timestamp": 1666767474179}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות: \nהרצאות כלכך טובות ומעניינות שמבאס אותי שבזבזתי את הזמן שלי סמסטר קודם בנסיון לרדוף אחרי החומר.\nעכשיו באמת הבנתי את החשיבות של בחירת הקורס לפי מרצה, יש כאלה שפשוט לא שווים את הנסיון אפילו, ויש מרצים שפשוט יודעים מה הם עושים.\nשם המתרגל/ת: אלן צורני\nחוות דעת - תרגולים: \nמתרגל מעולה, רואים שאכפת לו שיבינו את החומר, ורואים שיש לו הבנה מעמיקה בעצמו.\n\nשעורי הבית: \nארוכים כמו כל קורס באלגברה. אבל כדי להבין גרם שמידט צריך לעשות גרם שמידט.\nהמבחן: \nפרו-טיפ לא משנה מי המרצה, תשקיעו את החיים במועד א' ואל תחשבו לגשת למועד ב' אלא אם אתם מבינים את החומר מכל הכיוונים האפשריים. לא נכווים פעמיים.\nהשורה התחתונה: \nהקורס הזה מאוד חשוב, אם המרצה לא טוב, תלמדו לפי הרשימות של ניר.", "timestamp": 1673937631643}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר לזרוביץ'\nחוות דעת - הרצאות: מצויין!!!\nמובן, בקצב טוב, רשימות טובות, נותן אינטואיציה, ומה לא...\n\nשם המתרגל/ת: אלן סורני\nחוות דעת - תרגולים: משתדל מאוד ומשקיע, אבל לפעמים לא ברור ומבולגן. לקראת התרגולים האחרונים כבר בקושי הגיעו אנשים, אבל הרשימות שלו טובות.\n\nשעורי הבית: היו רק 6 גיליונות, לא נוראיים בכלל, לכן זה לא העמיס בכלל. לעומת זאת, לא היה מספיק תרגול על החומר.\n\nהמבחן: מחולק חצי-חצי בין מבחן אמצע (תקף) לבין מבחן סוף. הראשון כלל את הפרקים של דטרמיננטה, סכומים ישרים וז'ורדן, בעוד השני כלל את הפרקים של מכפלה פנימית, אופרטורים נורמליים ותבניות בילינאריות.\nכן הקל מאוד מבחינת כמות החומר שצריך לזכור למבחן, אבל בסה\"כ האורך של שני המבחנים ביחד יותר גדול משל מבחן בסמסטר אחר. גם בעייתי לעשות מבחן אמצע תקף כשיש הרבה גיליונות במקביל, ובנוסף ההכנה למבחן היתה קצת יותר מסובכת בגלל המתכונת השונה.\nהמבחנים לא היו קשים מדי ואפילו יחסית קלים, אבל הקונספט של השאלות שונה מבד\"כ ודורש הבנה וחשיבה.\n\nהשורה התחתונה: \nתקחו את ניר בכל מקום שאתם יכולים", "timestamp": 1676310937894}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר לזורוביץ'\nחוות דעת - הרצאות: \nניר מרצה מאוד טוב, מאוד כיף ללמוד איתו ויש אווירה נעימה בהרצאות.\n\nשם המתרגל/ת: אלן סורני\nחוות דעת - תרגולים: \nלא הייתי\n\nשעורי הבית: \nעוברים די טוב על החומר הנלמד ויש שאלות יפות, רמה הוגנת.\n\nהמבחן: \nחילקו את הקורס ל2 אז היו שני מבחנים במקום אחד, הקל מכיוון כל פעם היה פחות חומר ללמוד למבחן.\nשני המבחנים היו הוגנים.\nהשורה התחתונה: \n\n\nסיכום:\nבגדול קורס טוב עם המון נושאים מגניבים", "timestamp": 1676559538506}, {"author": "מישהו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר לזרוביץ׳\nחוות דעת - הרצאות: מהמרצים היותר טובים בפקולטה, הרצאות נהדרות ומסודרות ביחד עם רשימות מוקלדות שעלו למודל.\n\nשם המתרגל/ת: אלן סורני\nחוות דעת - תרגולים: מוקדם בבוקר אז לא יודע להגיד ):\n\nשעורי הבית: לא עשיתי \n\nהמבחן: המבחן (והקורס) חולק ל2, היה בוחן אמצע במשקל 50% ומבחן במשקל 50%, מאוד מקל על הלמידה (אם כי כן מוסיף עומס באמצע הסמסטר), שני המבחנים היו מאוד הוגנים לדעתי.\n\nהשורה התחתונה: קורס די מעניין וכנראה חשוב שכדאי לדעת, בכל מקרה חובה אז זה לא כל כך משנה, ניר נהדר והמתכונת שלו של פיצול הקורס הקלה מאוד, תיקחו איתו אם יש אפשרות", "timestamp": 1676650769399}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר לזרוביץ\nחוות דעת - הרצאות:  המרצה הכי טוב שהיה לי בפקולטה עד כה. עוקב אחרי הרשימות שלו ומסביר הכל בצורה ברורה והאווירה בהרצאות מאוד נעימה\n\nשם המתרגל/ת: אלן צורני\nחוות דעת - תרגולים: התרגולים היו קצת מבולגנים, לא תמיד התרגיל שאלן הציג היה נכון לחלוטין\n\nשעורי הבית: \nאחלה\nהמבחן: \nהיו 2 בחנים במקום מבחן, בוחן אמצע תקף זה לא הכי אידאלי אבל בשביל אלגברה ב לדעתי זה היה נכון. הבוחן הראשון היה על חצי מהחומר והשני על החצי השני\nהשורה התחתונה: לקחת אם ניר מעביר", "timestamp": 1683548815865}, {"author": "בועז מונטיליה", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיכה שגיב\nחוות דעת - הרצאות: אחלה בן אדם, מרצה לאט, ובנוסף חוזר על חומר מהרצאה קודמת במשך חצי שעה בתחילת כל הרצאה, דבר מתסכל ומונע ריכוז.\n\nשם המתרגל/ת: ים פלדשטיין (סליחה על איות גרוע)\nחוות דעת - תרגולים:  3>. מתרגל מדהים, הבנה מעולה בחומר, מנהל רשימות רצות וברורות לקריאה של כל התרגילים.\nמדבר וכותב *מאוד* מהר, אבל אם שואלים שאלות עוצר להסביר תמיד.\n\nשעורי הבית: \nמאוד הוגנים, במיוחד לאחר השביתה כשצמצמו משמעותית דרישת חובה.\n\nהמבחן: \nהיה ארוך קצת, אך ביחס לרמת השאלות ממבחני עבר היה מאוד הוגן ואפילו מקל.\n\nהשורה התחתונה: \nוואו! אני כל כך אוהב צורת ז'ורדן, אלגברה זה מדהים! ממליץ בחום לכולם", "timestamp": 1691427266833}, {"author": "Joy Boi(he/him)", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיכה.\nחוות דעת - הרצאות: לא הכי פורמליות אך בסוף החומר הועבר בצורה סבירה.\n\nשם המתרגל/ת: ים.\nחוות דעת - תרגולים:  אחלה , לפעמים ממהר אך אם משהו לא מובן הוא עוצר ומסביר שוב\n\nשעורי הבית: חשובים כדי לתרגל את החומר, בדיקת התרגילים הייתה קשוחה מאוד בלי סיבה .\n\nהמבחן: הוגן מאוד מאוד. וזה נראה בהיסטוגרמה.\n\nהשורה התחתונה: קורס עם חומר מעניין מאוד. ממליץ.", "timestamp": 1694530810300}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיכה שגיב\nחוות דעת - הרצאות: \nהמרצה הכי טוב שהיה לי בטכניון! חיכיתי להרצאות שלו והתעוררתי שמחה בבוקר של הרצאה באלגברה ב׳. מפתח אינטואיציה חזקה, לב ענק ויסביר כמה שצריך עד שתביני. \n\nשם המתרגל/ת: ים\nחוות דעת - תרגולים: \nמגיע מוכן לכל התרגולים, יש גם סיכום של כל תרגול. מאוד חשוב לו שיבינו, תמיד אפשר לפנות וישמח לעזור.\n\nשעורי הבית: \nארוכים. \n\nהמבחן: \nהוגן.\n\nהשורה התחתונה: \nהקורס שהכי נהנתי בו בתואר. הרבה קרדיט לסגל.", "timestamp": 1704878727693}, {"author": "שם או כינוי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניר לזרוביץ\nחוות דעת - הרצאות: מרצה מאוד טוב. בהתחלה של הקורס לא ממש הבנתי את הקורס כי עשיתי אלגברה א לפני כמה שנים, אבל הצלחתי להבין מה הולך בעזרת ההרצאות שלו. הביא דוגמאות מאוד טובות, ועבר על החומר בקצב די מהיר אבל גם מובן וברור. הצליח לעבור על כל החומר גם למרות שזה היה סמסטר קצר מהממוצע.\n\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: פחות אהבתי את התרגולים של סתיו. הוא עבר על החומר די מהר, בהתחלה הייתי מנסה לכתוב ולעקוב אבל בסוף הסמסטר כבר וויתרתי על להעתיק את מה שהוא כותב. הוא כותב לא כל כך מסודר בלוח, ובמיוחד בתחילת הסמסטר יצא שהוא התחיל לכתוב משהו ואז מחק הרבה פעמים. \n\nשעורי הבית: היו 6 גליונות, לטעמי זה היה קצת מעט כי אני מרגיש שלא ממש הבנתי את החומר כמו שהבנתי במקצועות אחרים שהיו יותר גליונות.\n\nהמבחן: היה מבחן די הוגן, 5 שאלות כל אחת על נושא שונה. כל מרצה מלמד את החומר קצת שונה אז קצת קשה להסתמך על מבחנים מהעבר כדי ללמוד.\n\nהשורה התחתונה: קורס קשה מאוד, למרות שהיה מרצה ממש טוב. זה חומר מאוד תיאורטי שקשה לפרסר מה הוא באמת אומר מתחת לכל ההגדרות, וכל הזמן זורקים עליך הגדרות חדשות. מצד שני, היה מאוד מעניין, וגם במהלך הקורס יצא שפתאום אני הבנתי דברים ששמעתי לפני שלמדתי את הקורס ולא הבנתי, או ששמעתי משהו על קורס פיזיקה מתקדם ופתאום הבנתי מה זה אומר כי זה היה באלגברה ב.", "timestamp": 1715371701777}]}