{"posts": [{"author": "1231", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה מצוינת, היא לטובת הסטודנטים הרבה מעבר לסמסטר או לקורס. \nהיא עצמה מודה שהקורס עצמו אינו כבד ומורכב לעומת שאר הקורסים בסמסטר, אין עומס של גיליונות או הגשות.\nנראה שלידיה מנהיגה שינוי מסוים בקורס - מקווה שלסמסטרים הבאים הוא יהיה יותר מרווח עם הנושאים שהיא לא הספיקה.\n\nשעורי הבית: מצריכים בערך שעה וחצי של ריכוז.\n\nהמבחן: הוגן, אמריקאי עם המון שאלות עוזרות. \n\nהשורה התחתונה: לידיה אלופה, מקווה מאוד שיצא לי ללמוד איתה יותר בסמסטר", "timestamp": 1645471476413}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לידיה פרס הרי\nחוות דעת - הרצאות: לידיה מרצה מצויינת, לפעמים קצת רצה אבל ההסברים שלה מאוד ברורים ומובנים.\n\nשעורי הבית: קשים אבל יש ממש מעט אז שעתיים שלוש בשבוע לרוב יספיקו (ואם אתם ממש מבינים את החומר אפילו פחות). בכל מקרה שעה מתוך השעתיים של השיעור מוקדשת לפתירת שיעורי הבית אז זה חוסך זמן.\n\nהמבחן: לא פשוט אבל הוגן. גם אם לא יודעים את החומר טוב כל כך במהלך הסימסטר מספיקים 3 ימים של למידה.\n\nהשורה התחתונה: קורס חשוב ולא מאוד עמוס אבל אסור לזלזל בו כי החומר לא פשוט בכלל. לידיה מהממת ואחוזי ההצלחה מאוד גבוהים.", "timestamp": 1646775020829}, {"author": "Yaniv Slor Futterman", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: מרצה פשוט מצוינת. אין על לידיה בעולם. התלמידים שלה ממש חשובים לה, היא מלמדת בצורה טובה וגורמת לך להרגיש שלמישהו במערכת הגדולה הזו אכפת ממך. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nיש וובוורקים שעושים אותם בהמלך השיעור. השיעור פעם בשבוע והוא תמיד מתחיל בהרצאה, אז הפסקה, ואז חוזרים לפתור את הווברוקים בכיתה בזמן שלידיה שם. זה מאוד עוזר לתרגל את החומר רגע אחרי שלמדת אותו, והיא גם שם לעזור כשנתקעים (מה שקורה לא מעט). יש גם ספר במודל לתרגול אינטגרלים נוספים אם רוצים תרגול נוסף, מה שלפעמים צריך. \n\nהמבחן: \nעובר בינארי. \nלא קשה במיוחד, מאוד הוגן. אבל כן צריך ללמוד את החומר ולדעת אותו. דורש יומיים למידה, או שעות בודדות כל יום בכמה ימים לקראת המבחן. מומלץ להיפתר מזה מהר, לגשת למועד א' ולעבור הלאה עם החיים.\n\nהשורה התחתונה: אחלה קורס. לידיה מהירה אז כן מומלץ להקשיב ופחות לכתוב, כי קשה לעמוד בקצב שלה. עוזר לפיסיקה 1פ (למרות שחלק ממה שנלמד נלמד אחרי שפיסיקה כבר הגיעו אליו, או שהוא נלמד קצת שונה מבפיסיקה) אבל זה גם עוזר לפיסיקה 2פ, ובכלל רואים איך החברים שלא לקחו את זה מתפסטנים יותר עם אינטגרלים ממי שכן לקח ממפיס. בהחלט קורס מאוד מומלץ", "timestamp": 1647350664632}, {"author": "טל משיח", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: לידיה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חשובים\n\nהמבחן: מסכם את שיעורי הבית\n\nהשורה התחתונה:", "timestamp": 1647430812279}]}