{"posts": [{"author": "סטודנט תמים", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: הרצאות לא מסודרות, לא מגיע מוכן להרצאות ופותר תרגילים תוך כדי ככה שיש לא מעט טעויות ועצירות מיותרות. מעביר את החומר בסדר\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: שיעורי הבית היו בסדר, אבל אבירם שהיה אחראי עליהם לא מעלה את הפתרונות בזמן הסביר, את שני הגיליונות האחרונים העלו יומיים לפני מועד א, ונתנו לגיליון האחרון שבוע לפתור ולהגיש כשהמגן תלוי בו\n\nהמבחן:  אם דניאל כותב את המבחן, תדעו שהוא לא הוגן. הוא שואל על נושאים שהוא אומר במהלך הסמסטר שאין סיבה להתעמק בהם. הוא משנה את השאלות תוך כדי מבחן. ובכללי המבחנים קשים.\n\nהשורה התחתונה: קורס חובה אז אין ברירה", "timestamp": 1612173173282}, {"author": "אלנאג׳י", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: נראה טוב, הוא מאוד איטי, אבל לא חושב שזה פוגע בסטודנטים\n\nשם המתרגל/ת: אבירם\nחוות דעת - תרגולים: האיש הכי לא מסודר בסמסטר, לא היה פעם והתחיל שיעןר בזמן\n\nשעורי הבית: הוגנים\n\nהמבחן: כאן אנחנו מדברים על מבחן מכשיל, רבייב מביא תמיד את השאלה המכשילה, שאף פעם לא פתרנו ברוח שלה אף פעם (לא בתרגול ולא בהרצאה), חבל״ז באמת:)\n\nהשורה התחתונה:", "timestamp": 1612241588033}, {"author": "Oren", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: סמסטר מקוון, לא הצלחתי לראות פחות מX2.75 ואין דרך חזרה מכך.\nמרצה טוב שמסביר מצוין, אבל אוהב להתעכב ולתקן כל קו לא ישר בזמן ההרצאה(מה שמחזק את הסיבה לראות בX2.75).\nההרצאות חשובות להבנת החומר.\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: מתרגל מצוין! לפעמים טיפה מרגיש שהוא בורח מהשאלה שהוא מסביר כדי להעביר איזה נושא ספציפי, אבל עובד עם הסיכום המוקלד שהוא הכין 1 ל1 למה שמעביר בתרגול, ובכך נותן את האופציה לא לכתוב ולהקשיב בעיקר(לי זה עזר).\n\nשעורי הבית: \nלא עמוסים מדי, גליון של 6-7 שאלות בד\"כ, מדי פעם יש שאלות שהן נטו אלגברה עם מספרים מגעילים, אבל בכל קורס נופלים לפעמים על גליונות כאלה.\n\nהמבחן: \nיחסית קשה, רבייב ידוע בשאלות טריקיות והתחכמויות.\n\nהשורה התחתונה: קורס חשוב להמשך, לא קל אבל ניתן להוציא ציון בסדר.", "timestamp": 1612270369071}, {"author": "דש", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: משעממות ביותר!!!!! החומר היחידי שעניין אותי הוא נושא של ההתמרות, אי הסדר והתיאום בקורס גבוה מאוד \n \n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: נחמד מסביר טוב,מדבר הרבה כדאי לצפות במוקלט *2\n\nשעורי הבית: קשים מאוד אין רחמים משנים אותם קצת כל סמסטר \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612294194030}, {"author": "פלנשראל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  דניאל רבייב\nחוות דעת - הרצאות: \nיש רשימות מסודרות להרצאות. מתעכב טיפה על דוגמאות וחישובים אבל סך הכל מעביר את החומר טוב. \nשם המתרגל/ת: אבירם יעקוביאן\nחוות דעת - תרגולים: \nמתרגל מצוין. חד ולעניין\nשעורי הבית: לא פשוטים אבל תורמים להבנה\n\nהמבחן: לא קל אבל אפשר להצליח עם תרגול\n\nהשורה התחתונה: סך הכל חומר די מעניין, טיפה דומה לחדוא 2ת רק קצת יותר תיאורטי", "timestamp": 1612594895113}, {"author": "שורד", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשה\n\nהשורה התחתונה: השילוב הקטלני של חומר משעמם וקשה ממש", "timestamp": 1612858793987}, {"author": "אחד ששרד", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה מזעזע, רמת הוראה נמוכה מאוד, לא מגיע מוכן לשיעורים בכלל, בין אם זה שהוא שוכח לסגור את הפלאפון שלו ועונה לשיחות תוך כדי ההרצאות (קרה יותר מ5 פעמים בהרצאות שונות ככה שלא היה משהו חד פעמי), פותר תרגילים ביחד עם הסטודנטים בלי להיות מוכן אליהם בכלל ובנוסף להכל פשוט מסביר את החומר בצורה לא טובה גם כשמדובר בחומר משעמם וקשה.\nלא היה לו שום ערך מוסף ולא הצליח להביע חותם חיובי בשום צורה\n\nשם המתרגל/ת: אבירם יעקוביאן\nחוות דעת - תרגולים: \nבתור מתרגל אחראי אני חושב שהוא היה מאוד לא מסודר.\nאיחר המון לתרגולים שלו, איחר בבדיקת הגליונות (החזיר ציונים על הגיליון האחרון שלושה ימים לפני המבחן) ולא היה זמין יותר מידי במהלך הסמסטר מה גם שלא היה סנכרון בינו לבין שאר המתרגלים ונוצר מצב שצריך לעקוב אחרי כל מה שנלמד בתרגולים האחרים ואפילו לצפות בחלק מהם על מנת להצליח לפתור את הגליונות.\nבמהלך התרגולים שלו העביר את החומר בצורה סבירה.\n\nשעורי הבית: \nקשים מאוד ודורשים הבנה לפעמים מעבר למה שנלמד בהרצאות, המלצה אישית - להיות חדים על הסיכום של הקורס ולעבור גם על התרגולים המוקלדים של יורם כדי לנסות ולקבל הכוונה, מומלץ מאוד לעשות אותם הם תורמים להבנה מאוד\n\nהמבחן: \nלא קשור לכלום, חומר שדניאל הצהיר שלא יהיה במבחן כי הוא פחות רלוונטי לקורס בא לידי ביטוי בשאלה של 20 נקודות, ניסוח מאוד מבלבל של שאלות שהיה צורך לשנות אותו במהלך הבחינה (ולא הודיעו את זה לכל הכיתות) מה שגרם לאובדן נקודות שדניאל בחר שלא להודות בשגיאה שלו ובכל זאת לא להתייחס לזה.\nהשורה התחתונה: \nלהצליח במבחנים עם דניאל זה כמו להצליח בלוטו.. אם מרצה אחר אחראי של הקורס הזה הסיכויי הצלחה תואמים את רמת הידע של הסטודנט ככל הנראה עם דניאל אי אפשר לדעת", "timestamp": 1612978044367}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: דניאל ידוע במבחנים מתחכמים ובהכשלת סטודנטים.בהרצאות הוא מסודר ומשתדל להעביר בצורה טובה.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: המתרגלת הכי מקצועית מכולם אבל הכי מתנשאת שפגשתי.\n\nשעורי הבית: מתאגרים אבל אפשריים.\n\nהמבחן: יכל להיות הוגן, אבל זה דניאל.\n\nהשורה התחתונה: צריך להיות ממש על זה כדי להצליח וגם אז יכולים ליפול במבחן.", "timestamp": 1613132443585}, {"author": "גאוסיאן", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: למרות שלפעמים הוא טועה בדברים, הוא יודע את החומר בצורה ממש טובה. החומר בסופו של דבר, מובן, אך מצריך השקעה.\n\nשם המתרגל/ת: אבירם יעקוביאן\nחוות דעת - תרגולים: סטנדרטי\n\nשעורי הבית: ארוכים וחלקם עבודה שחורה\n\nהמבחן: יותר לצד התיוריטי עם רבייב. הוא אוהב את החשיבה האינפית, מומלץ מאוד לחשוב מחוץ לקופצה ובכמה דרכים שונים.\n\nהשורה התחתונה: תשקיעו, תקבלו. כיוון שאי אפשר לדמיין מה קורה במרוכבות, זה יהיה מוזר לפעמים. נסו לקבל מוטיבציה על התמרות פורייה מיוטיוב 3brown1blue.", "timestamp": 1613410028700}, {"author": "Whiteice", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי הבית היו קשים . כמעט אין סיכוי לפתור את הכל לבד בזמן סביר \n\nהמבחן: \nקשה ותיאורטי. אני שאלתי במפורש את דניאל בתחילת הסמסטר האם כדאי לצפות בקורס \"פונקציות מרוכבות\" של אליאש ביוטיוב. הוא טען שלא מומלץ , כי זה קורס למתמטיקאים ולא למהנדסים. לא הבנתי מה זה אומר , לא הקשבתי לו. *בסוף במבחן היו 5 שאלות הוכחה אז עשיתי בשכל* \nלדעתי עדיף ללמוד לבד מאליאש. הרבה יותר ברור \nקחו בחשבון.\nהשורה התחתונה: \nתלמדו לבד כדי להבין את החומר. המבחן יהיה מזעזע בכל מצב.", "timestamp": 1613451193687}, {"author": "קונבולוציה", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: \nמרצה מעולה, במיוחד על מהירות 2.75 במוקלט.\nמאורגן מאוד עם דפי הרצאות.\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: \nמאורגן עם דפי תרגולים.\nמסביר טוב מאוד ונותן דרכים נוספות לפתור שאלות.\n\nשעורי הבית: \n6-7 שאלות שלוקחות זמן ועם הרבה כתיבה.\nיכולים לקחת כמה ימים ON&OFF.\nלא הין מתוזמנים טוב בסמסטר הנוכחי מה שהפיל 2-3 גיליונות על שבועות אחרונים\n\nהמבחן: \nסה\"כ פייר, בתקווה שמתרגל לא יחליט לעשות צחוק ולשבור לכם את הלב.\n\nהשורה התחתונה: \nקורס חובה שדורש השקעה.\nלא פשוט בכלל.\nעדיין אפשרי להוציא ציון טוב אם לא מזניחים.\nלרוב שאלות טכניות במבחן", "timestamp": 1614182199115}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: חשוב לו שנבין ורואים את זה. אבל הוא מאוד מתעסק בנראות של ההרצאות ברמה שזה מפריע\n\nשם המתרגל/ת: אברים יעקוביאן\nחוות דעת - תרגולים: מבולגנים ולא מוסברים טוב\n\nשעורי הבית: קשים\n\nהמבחן: היה הוגן\n\nהשורה התחתונה: קורס נורא אבל אין ברירה", "timestamp": 1614242201566}, {"author": "---", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מאוד מעניין", "timestamp": 1614373085574}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מעביר את החומר טוב ואין יותר מידי ברירות אחרות.\n\nשם המתרגל/ת: יורם \nחוות דעת - תרגולים:  מבולגן מאוד, אבל פותר די הרבה שאלות בהרבה דרכים.\n\nשעורי הבית:  \n\nהמבחן:  היה מבחן די קשה מאוד תיאורטי ביחס למבחנים קודמים. \n\nהשורה התחתונה:", "timestamp": 1614622189852}, {"author": "ר", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: משעממות, ראיתי הכל מוקלט על פי 2 2.5 אחרת נרדמים\n\nשם המתרגל/ת: אבירם\nחוות דעת - תרגולים: סביר, איחר מלא\n\nשעורי הבית: קשים אבל פתירים לרוב\n\nהמבחן: קשה אך הוגן יחסית\n\nהשורה התחתונה: עושים כי צריך", "timestamp": 1614760229209}, {"author": "כללי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה:רבייב \nחוות דעת - הרצאות: \nאיטיות וקשות לצפייה בזמן אמת, התעסקות מרובה במסביב ובנראות\nשם המתרגל/ת: אבירם \nחוות דעת - תרגולים: \n-\nשעורי הבית: \nשש גליונות בסגנון שלא קשור לחומר\nהמבחן: \n-\nהשורה התחתונה: \n-", "timestamp": 1614835976066}, {"author": "E", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מסביר טוב אבל מתקדם לאט ומביא דוגמאות מסובכות, מומלץ לראות על מהירות גבוהה בליווי חוברת ההרצאות שלו.\n\nשם המתרגל/ת: אבירם יעקוביאן\nחוות דעת - תרגולים: מתרגל מעולה.\n\nשעורי הבית: לרוב טכניים ודורשים מלא חישובים מכוערים. לא מקיפים את כל החומר למבחן אבל הוגנים מבחינת רמת קושי וזמן עבודה.\n\nהמבחן: רבייב, אין צורך לפרט מעבר.\n\nהשורה התחתונה: קורס לא קל אבל החומר יחסית מעניין, חובה בכל מקרה.", "timestamp": 1615719351669}, {"author": "יקיר לוגסי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: באמת אחלה, דניאל עונה לכל השאלות, משתדל להעמיק איפה שאפשר, ונתן אווירה טובה במהלך הקורס. מי שלוקח איתו קורס מקוון שידע שדניאל מאוד מתעכב על הנראות ועל הכתיבה באייפד, בעיניי זה מבורך כי הסיכומי הרצאות שימושיים לבסוף, אבל זה קצת מאט את קצב ההרצאה (בלייב), לכן אני פשוט צפיתי במוקלטות על מהירות גבוהה.\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: יורם גבר שבגברים, תמיד אפשר לשאול ולקבל תשובה (גם אם לפעמים היא ארוכה מידי, מי שלמד איתו מבין), מאוד חשוב לו לציין את הנקודות הטריקיות, ולזהות את אופי התרגילים והרעיונות. חשוב לו גם להסביר את השימושים בתעשייה של הדברים המתמטיים שאנחנו לומדים.\n\nשעורי הבית: הוגנים אך מאוד קשה להשיג רפרנס, לא ממוחזר.\nגיליון פעם בשבועיים.\n\nהמבחן: מועד א׳ התקיים שלושה ימים לאחר סוף הסמסטר, כלומר יום לפני שהתחילה בכלל תקופת המבחנים, זה לא הוגן אך חשוב לציין שאין לצוות הקורס קשר לזה בכלל אלא למזכירות הפקולטה האכזריות. בעיני המועד היה הוגן, אם כי כמו שציינתי, מאוד צפוף ולחוץ.\n\nהשורה התחתונה: קורס באמת מאוד יפה מתמטית, בעיקרון זה ״ההמשך״ של אינפי, רק פחות פורמלי ומציק. סוגר הרבה חורים ושאלות שעלו באינפי.", "timestamp": 1632302102344}, {"author": "A", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מרצה סביר, מאוד מסודר\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: מתרגל טוב, עונה לכל שאלה ומרגיש שהוא באמת רוצה שנצליח. \n\nשעורי הבית: 6 גיליונות קשים, לא מרופרנסים, לא מפרסמים פתרונות אחרי ההגשה (ככה שלא ניתן לבדוק את עצמך), וגם בודקים שאלה אחת בלחץ.\n\nהמבחן: מבחן של רבייב... זוועה, הרמה לא קשורה למציאות.\n\nהשורה התחתונה: קורס חובה, אין יותר מידי מה לעשות.", "timestamp": 1634296118675}, {"author": "נ", "difficultyRank": 4, "generalRank": 4, "semester": "202003", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מעניין\n\nשם המתרגל/ת: רן קירי\nחוות דעת - תרגולים: ממש טוב, מסביר לעומק ועונה המון על שאלות\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1634456668162}, {"author": "סטודנטית מבואסת", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רבייב \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ליטל \nחוות דעת - תרגולים: סבבה לגמרי \n\nשעורי הבית: \n\nהמבחן: קשה בטירוף צריך המון השקעה לשים לב להכל מהתחלת הקורס עד סופו , המון דברים לזכור , אם לא היה קורס חובה לא הייתי מתקרבת מהקורס הזה בחיים . \n\nהשורה התחתונה: תשקיעו בקורס מההרצאה הראשונה , תבינו לעומק אחרת קשה להצליח .", "timestamp": 1644516283911}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה טוב בסך הכל, מסביר טוב, נותן אינטואיציה טובה.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים:\nהיא מתרגלת אחראית בכמה סמסטרים האחרונים אבל היא מאוד איטית, מתייחסת בזלזול לסטודנטים, מסיימת תרגולים לפני הזמן למרות שהיא לא מספיקה אפילו חצי מכמות התרגילים שמתרגלים אחרים מספיקים. באופן כללי לא ממליצה עליה.\nמצד שני, הקורס הזה מאוד מבולגן ובגלל שהיא מתרגלת אחראית, היא היחידה שעושה במהלך התרגול תרגילים שקשורים לשיעורי הבית, ובלי זה שיעורי הבית פשוט לא פתירים. לכן המשכתי ללכת אליה.\n\nשעורי הבית: שאלה אחת להגשה בשבוע ועוד שאלות שלא להגשה, לא עמוס בסך הכל אבל לא מפרסמים פתרונות רשמיים לאחר ההגשה וגם הבדיקה מאוד מחפפת, כך שאין ממש ממה ללמוד.\n\nהמבחן: ארוך וקשה, דורש לדעת את כל הטריקים מההרצאות של רבייב, אז לעבור ממש טוב על קובץ ההרצאות המוקלד שלו ועל ההוכחות של המשפטים (הן לא נדרשות כהוכחת משפט במבחן אבל כן מכילות המון טריקים שעוזרים למבחן). \n\nהשורה התחתונה: קורס מאוד מבולגן, מומלץ להיצמד לקובץ ההרצאות המוקלד של רבייב וללמוד ממנו. ייתכן שבדיעבד הייתי רואה שני תרגולים בשבוע אם הדבר מתאפשר, כדי שהחומר ישקע יותר טוב במהלך הסמסטר.", "timestamp": 1644744907146}, {"author": "איציק זינו", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nדורון אלעד\n\nחוות דעת - הרצאות: \nדורון מרצה נעים מאוד, הסביר את החומר טוב והיה קשוב \nלסטודנטים. סך הכל מומלץ\n\nשם המתרגל/ת: \nליטל שמן\n\nחוות דעת - תרגולים: \n\nמצד אחד, היא הייתה מתרגלת אחראית ופתרה בכיתה בפועל תרגילים שכמעט זהים לגליון השבועי וחסכה ככה ים עבודה כל שבוע. \nמצד שני, היא עושה פשוט ממש מעט תרגילים כל פעם ובדיעבד זה בעיה ממש רצינית, יש סוגי שאלות שפוגשים במבחנים שמרגיש שלא באמת נגענו בהם בתרגול.\n\nשעורי הבית: \n\nרק תרגיל אחד להגשה השאר לא חובה. כמו שכתבתי, מי שתרגל אצל ליטל עשה לו חיים הרבה הרבה יותר קלים בפער.\n\nהמבחן: \n\nמבחן קשה ברמות, כל פעם שפותחים אחד חדש רואים שוב שאלה שלא היה כמוה בחיים ומרגיש שצריך ממש להמציא את הגלגל כל פעם. \nבנוסף, בשנים האחרונות המבחנים הפכו יותר תיאורטים והקורס לא ממש השתנה בהתאם לדעתי, פתאום מוצא את עצמי מנסה להיזכר במשפטים של אינפי 1מ באמצע מבחן של מרוכבות. בקיצור באסה. \n\nהשורה התחתונה: \nחובה אז אין ברירה. מבחן אחד הקשים שהיו עד עכשיו בתואר לדעתי. החומר עצמו בסדר, די קופצים מנושא לנושא ולא הכל מעניין כל כך.", "timestamp": 1644873325309}, {"author": "נפגעת מרוכבות", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: הרצאות בסדר, מעביר את החומר טוב. היה לי קשה לפעמים לעקוב אחריו בהוכחות ודברים כאלה. כדי להבין מה הוא עושה בהרצאה חזרתי לפני כמעט כל הרצאה אחרי ההרצאה הקודמת. \n\nשם המתרגל/ת: יורם יחיא וליטל שמן\nחוות דעת - תרגולים: תרגולים של יורם מעניינים, אבל לא היו לי מאוד אפקטיביים. עובר על הדברים החשובים מהר מידי וקשה באמת לענות על שיעורי בית אחרי התרגולים שלו. ליטל מלמדת טוב מאוד לדעתי, החומר מובן יותר אחרי התרגולים שלה. יש לה קטעים שהיא לא עונה לאנשים על שאלות בצורה קצת מעצבנת.. אבל סה\"כ אני חושבת שרוב מה למדתי בקורס זה ממנה.\n\nשעורי הבית: היתה שאלת חובה אחת בכל גיליון. סה\"כ כולם ביחד 15% מגן. אבל היה חשוב לתרגל את כל הגליונות כדי להבין את החומר יותר טוב. חלק מהשאלות חובה היו מלמדות וחלק סתם היו בזבוז זמן.. היה חשוב להיות בתרגול אצל ליטל לפעמים כדי להבין בכלל איך לפתור אותם, כי שאר המתרגלים לא תמיד עשו דברים בסגנון. \n\nהמבחן: טריקי ומאוד קשה לדעתי. את המועד א בכלל לא הספקתי לסיים ונשארו לי כמה סעיפים חצי פתורים. בדיקה מאוד קשה ולא הוגנת. לאנשים שונים הורידו ניקוד שונה על אותו דבר.. ובכללי גם אם מאוד מוכנים למבחן, לא קל להצליח בו.\n\nהשורה התחתונה: קורס קשה אבל חובה", "timestamp": 1645268212173}, {"author": "צוללן ציונים מומחה", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: ההרצאות טובות, הרבה חושבים שהוא לא מסביר מספיק, לדעתי כן. הוא גם באמת רוצה שתבין את החומר, ומוכן להסביר שוב ושוב. היתרון שיש את הרשימות שלו, והוא די דואג שיהיו מעודכנות. לטוב ולרע, מרצים שחוזרים מילה במילה על הרשימות שלהם. עם זאת, מן הסתם הוא מדבר מעבר למה שמופיע ברשימות, ולא הכל שם. אבל, מה שצריך לדעת, בגדול? שם. וזה תורם המון לקשב בהרצאה. באחד על אחד, הוא באמת יודע להסביר היטב. לפעמים יש קטעים שהוא מתבלבל, ולפעמים נתקע בלהסביר לאחד בהרצאה על משהו. אבל, זה נטו כי באמת חשוב לו שהסטודנטים יבינו. מרצה טוב בסה\"כ.\n\nשם המתרגל/ת: יוליה פייגין\nחוות דעת - תרגולים: מתרגלת מצויינת, ההימור ללכת לתרגולים שלה, למרות שזה לכאורה פעם ראשונה שהיא מעבירה את הקורס, השתלם. אם יצא לכם, להיות בתרגולים שלה בקורסים אחרים, אז אותה רמה לפחות. שליטה מצויינת בחומר, הסברים טובים. כן היא קצת טסה, לפעמים זה לטובה לפעמים זה לרע. היא מספיקה הרבה, ומסבירה לעומק והיטב.\nהאווירה תמיד טובה וחיובית בכיתה, ולעיתים אכן מערבת את הסטודנטים בפתרון תרגילים.\nקורס כמו מרוכבות, שמאוד מתבסס על הידע מאינפי 1מ ו2ח, וחדווא 2ת, אז היה נכון ללכת למתרגלת שמאוד חזקה בקורסים האלו. כי הגישה שלה לחומר, לי לפחות הרגיש בדיוק.\n\n\nשעורי הבית: \nזה משתנה, לעיתים שאלות באמת ללא תכלית או הכנה.\nלעיתים שאלות מעניינות ומלמדות.\nאין לכאורה הרבה להגשה, כל שבוע שאלה אחת מגישים מתוך שלושה. אבל, לפעמים השאלה יכולה לקחת יומיים לפתור. ולפעמים גג שעה שלוש.\n\nהכי מעצבן זה הבדיקה, עד שסוף סוף בודקים לעומק את הש\"ב, כמו שרצוי ומתבקש, או ככה אתה חושב.\nבפועל, הרבה פעמים מורידים סתם, על דברים נכונים, או דברים שהבודקים חשבו שזה לא נכון, כשבפועל הוא נכון. או מגלל שלא קראו את כל הגיליון, פיספסו הרבה. לפעמים הורידו בצורה גורפת לכל הקורס, נטו כי אף אחד, לדעת הבודקים, לא הבין באמת את השאלה. למרות, שפתרו את השאלה, בדיוק לפי התרגול.\n\nהמבחן: רבייב.\nבאמת, אם יש מישהו שכותב את המבחנים הכי קשים בטכניון, זה רבייב. מי שחושב שלא, לא ראה את המבחנים של רבייב, שבאורח פלא, מצליח כל מועד להעלות את הרמה מול המועד הקודם.\nאם יש שאלה חישובית, רוב הסיכוי שאם לא הבנת ממש אבל ממש את ה\"בין השורות\" מאחורי השאלה, היא תקח לך המון זמן לפתור. שאלות אמריקאיות שלוקחות המון זמן.\nואם זו שאלה תיאורטית, להלן הוכחה, בהצלחה כי הן יהיו ברמה מאוד גבוהה. בסוף, המבחן אפשר לפתור ותכלס להצליח בו.\nאבל, גם החזקים ביותר שתכיר יתקשו בו. וגם במבחן תפגשו שוב בדיקות לא הגיוניות. \n\nהשורה התחתונה: \nקורס עם חומר, שחלק אולי סולדים ממנו, וחלק מאוד יתעניינו בו. קורס קשה, אבל אם זה יעניין אותך, אתה תראה איך זה מתחבר, ויחסית שימושי יותר ממה שנדמה.\nחלק מהנושאים באמת נחמדים לבד. הרבה דברים מתחברים בסוף.", "timestamp": 1645382985385}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה אחלה סך הכל אבל יש לו קטעים שמתעקב על דברים לא רלוונטיים\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: רואים שהוא מבין את החומר אבל לא תמיד מצליח להעביר את מה שהוא רוצה\n\nשעורי הבית: לא קשורים למבחן\n\nהמבחן: היה הוגן סך הכל, חיפשו על מה להוריד ופשוט הורידו על דברים נכונים שאנשים רשמו - תבדקו את המבחן ותערערו בהתאם", "timestamp": 1645976821576}, {"author": "קושי", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה מדהים. תמיד מדבר למכנה המשותף הכי נמוך וכששואלים שאלה גורם להרגיש כאילו אתה היחיד בכיתה ומתעכב עד שתבין. לא גורם לביורפואה להרגיש לא בנוח כי לא לקחו אינפי ומשתדל להנגיש את הנושאים השונים. זמין מאוד ומסביר בצורה רגועה וקלילה כל דבר. ממש מומלץ\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: היא המתרגלת האחראית, ובלי ללכת לתרגולים שלה אין שום סיכוי לפתור את שיעורי הבית. מספיקה מעט מאוד תרגילים ומתעכבת על דברים שבחיים לא נשאלים במבחן, גישה ממש לא טובה לסטודנטים ועושה טובה שמלמדת ועונה לסטודנטים בצורה ממש מעליבה\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: הלכתי גם לתרגולים שלו וגם של ליטל. מספיק בפער יותר תרגילים ויש לו דפי תרגול ממש מסודרים שמופיע גם פתרון מלא לכל התרגילים בתרגול וגם את החומר התיאורטי. מסביר טיפים שעוזרים בעיקר לחשוב ולפתור את השאלות האמריקאיות\n\nשיעורי הבית: בדיקה מחפפת, לא כותבים אפילו על מה מורידים בשיעורי בית ככה שאי אפשר ללמוד למבחן\n\nהמבחן: רבייב תמיד מפתיע, תמיד מביא את השאלה שאף פעם לא הייתה כמוה בשנים קודמות\n\nהשורה התחתונה: קורס שצריך להשקיע בו כל הסמסטר כדי להצליח", "timestamp": 1646222485650}, {"author": "א", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דורון \nחוות דעת - הרצאות: דורון המלך הבלתי מעורער וממש לא כדאי ללכת לרבייב רק בגלל שהוא מרצה אחראי כי דורון מסביר נדיר. \n\nשם המתרגל/ת: ליטל \nחוות דעת - תרגולים: באופן כללי היא חסרת סבלנות קצת אבל מסבירה סה״כ סבבה. התרגול לא עובר באווירה נעימה אז זה קצת מעיק. עדיף לראות אותה מוקלט אם יש אופציה.\n\nשעורי הבית: \n\nהמבחן: המבחן ברמה גבוהה. צריך לתרגל הרבה בשביל להצליח.\n\nהשורה התחתונה: גם ההרצאות וגם התרגולים קריטים . הכל חשוב בקורס הזה. כדאי לרדת לפרטים הקטנים .", "timestamp": 1646259231126}, {"author": "מרוכבת", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: מרצה טוב, צריך לעקוב באדיקות אחרי כל הרצאה ולחזור על הרצאות קודמות. החומר נבנה אחד על השני.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: מתרגלת אחראית, מאוד חשוב ללכת דווקא אליה. מלמדת מעולה, מקצועית.\n\nשעורי הבית: חובה לעשות גם את מה שלא להגשה.. קריטי להבנה.\n\nהמבחן: המבחן הוגן, הקורס בכללי לא קל לכן חשוב להבין שמי שהיה על זה מההתחלה ועשה את כל שיעורי הבית והשקיע מעבר (gool/ שעות קבלה) יצליח.\n\nהשורה התחתונה: חשוב מאוד להשקיע לאורך הסמסטר, ולדעתי לתגבר בעוד עזרה כי הרצאות ותרגולים לבד לי אישית לא הספיקו.", "timestamp": 1646742823901}, {"author": "תקשיב או תכשל", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל רבייב ואז דורון אלעד\nחוות דעת - הרצאות: \nאין לי משהו רע להגיד על דניאל כ*מרצה*:\nיחסית משעמם ומונוטוני, אבל יענה לכם על השאלה, יסביר יחסית טוב ולא ירוץ יותר מידי.\nאבל - אם יש לכם את דורון כמרצה חד משמעית ללכת אליו.\nמרצה שמבין את הראש של הסטודנטים, מסביר טוב ואווירה מעולה בשיעור\n\nשם המתרגל/ת: ליטל שמן -> יורם יחיא  -> יוליה פייגין\nחוות דעת - תרגולים: \nליטל שמן: אין פה מספיק מקום לביקורת רעה אליה אז אקצר:\nדורסנית כלפי סטודנטים, איטית, מעבירה הרבה תרגילים שלא קשורים למבחן אבל קשור ועוד איך לשיעורי בית שהיא כותבת ולכן דואגת להעביר תרגילים בסגנון דומה (כנראה כדי שהכיתה לא תיהיה ריקה) - תצפו רק שנתקעתם בש\"ב\n\nיורם יחיא: לטעמי מבולגן מידי בשיעורים שלו, לא כותב הרבה ומדבר המון באוויר, לפעמים על דברים לא קשורים \nאבל - יש לו רשימות תרגול הכי מסודרות שפגשתי עד כה בתואר אז אם לא ללכת אליו כן לתרגל משם בזמנכם הלא קיים\n\nיוליה: מי שמכיר אותה מקורסים אחרים לא יופתע - מתרגלת מצוינת עם תרגילים שלקוחים רק ממבחנים ככה שהרמה מעולה, מתאימה למי שיכול לעמוד בקצב\nאסייג שזה היה הסמסטר הראשון שלה במרוכבות ולכן לא הייתה חדה על חלק מהמשפטים\n\nשעורי הבית: \nהגשה של תרגיל 1 אז סביר אבל אל תתרגשו מהתרגילים ההזויים שיצוצו שם\n\nהמבחן: רובו טכני, כנראה טכניקה תביא לכם את ה80-70.\nיתר הנקודות יהיו תלויות האם תוכלו להתמודד עם ההפתעות שרבייב יבשל למבחן, אם יהיה מזל הרווחתם\n\nהשורה התחתונה: חומר מעניין למי שאוהב מתמטיקה, כדי מאוד להישאר על החומר במהלך הסמסטר, ולקראת המבחן לפתור כמה שיותר מבחנים", "timestamp": 1646755878845}, {"author": "סטונדט", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: אחלה מרצה, עונה על השאלות ומסביר ברור. עובד בצמוד לרשימות מוקלדות ומסודרות.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: לא הכי נחמדה לסטודנטים ושאלות ולא מספיקה הרבה תרגילים, אבל היא המתרגלת האחראית וכמעט בלתי אפשרי לפתור את שיעורי הבית אם לא מסתכלים בתרגולים שלה (במועד ב הייתה אפילו שאלה במבחן מהתרגול שלה).\n\nשעורי הבית: 10 גליונית של שאלה אחת להגשה ועוד כמה לתרגול עצמי. לא ארוך, לפעמים די מאתגר וחובה לצפות בתרגול של ליטל בנושא אחרת קשה מאוד לפתור.\n\nהמבחן: מועד א שאלות אמריקאיות כמו כל השנים אבל פתוחות מזעזעות.\nבמועד ב הפוך לגמרי, שאלות אמריקאיות בלתי פתירות ושאלות פתוחות הגיוניות.\nבגדול המבחן מאוד קשה, תמיד תהיה שאלה שבחיים לא ראיתם משהו דומה אליה, הרבה תפילות ומזל.\n\nהשורה התחתונה: חומר יחסית מעניין עם מבחן שהורס הכל", "timestamp": 1647428089491}, {"author": "עוד נפגע מרוכבות", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: המחשבה הראשונית היא ללכת לדניאל כי הוא מרצה אחראי כבר מליון שנה אבל בדיעבד עדיף ללכת לדורון או למרצה השני שמרצה איתו כדי לקבל הבנה יותר טובה. דניאל הוא אחד המרצים הבודדים בשלב הזה שעדיין דוגלים בקונספט של סמסטר א'- יותר מדי מעברים הם \"קל לראות\" והפתרונות של המבחנים מתקצרים ומתקצרים עם השנים עד לרמה שהוא משחרר פתרון *רק* לשאלות הפתוחות וגם ה\"פתרונות\" לוקים בחסר עד כדי תסכול.\n\nשם המתרגל/ת:  ליטל שמן -> יוליה\nחוות דעת - תרגולים: דיסהמלצה חריפה מאוד למרות שבלעדיה אי אפשר לפתור שיעורי בית, עדיף ללכת ליוליה.\n\nהמבחן: כל מבחן דניאל ממציא את עצמו מחדש וקשה לראות את אותו קונספט חוזר על עצמו יותר מפעמיים מה שהופך את המבחנים לקשים ביותר. חלק אמריקאי במועד ב' היה בלתי פתיר(אני בטוח שלא ישוחרר אליו גם פתרון מלא) וממוצע מועד ב' היה 53 לפני פקטור של 7 נקודות.\n\nהשורה התחתונה: ככל שהממוצע יותר נמוך ככה יש יותר יוקרה לא?", "timestamp": 1647438487358}, {"author": "--", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות: מרצה מצוין, אחלה הרצאות. לא מבין למה אנשים הלכו להדחס בכיתה כדי לשמוע את רבייב, הרבה פחות מומלץ. \n\n\nשעורי הבית: שווה לעשות! לרוב אני מזניח ש\"ב אבל פה הציונים נמוכים אז ה15 אחוז האלה יכולים לעשות הבדל בין נכשל לעובר. \n\nהמבחן: מבחן מזעזע ולא קשור. ממש לא בודק ידע, קבלו 55 והמשיכו הלאה בחייכם. \n\nהשורה התחתונה: הקורס עצמו מעניין וחשוב, בעיקר ההתמרות. אבל המבחן מוציא את כל המיץ מהמקצוע. קורס חובה של פקולטה הזויה.", "timestamp": 1647519248637}, {"author": "1", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: רבייב מבין את החומר מעולה, העניין של ללמד קצת פחות. צריך להתרגל אליו ואז ההרצאות נהיות סבירות...\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: מתרגלת בסדר גמור, עושה תרגיל אחד או שניים במהלך השיעור שמכיל כל פיפס של הבנה, מאוד אהבתי את זה. פחות התחברתי לגישה כלפי הסטודנטים שלה, לא כזה רלוונטי אבל סה\"כ היא מאוד מומלצת...\n\nשעורי הבית: שיעורי הבית בסמסטר שהיה היו נוראיים, שאלה אחת להגשה שלא ממש קשה הבנתי ולא ממש מתרגלת את החומר והשאר ללא פתרונות ללא חובת הגשה מאוד קשים. \n\nהמבחן: אני לא אקשר, המבחן לדעתי ברובו לא ממש בודק את ההבנה של החומר עצמו אלא יותר לדעת טריקים אלגברים שהמטרה שלהם לדעתי הוא לשמור על ממוצע נמוך...\n\nהשורה התחתונה: אין ברירה...", "timestamp": 1647608751466}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דורון אלעד\nחוות דעת - הרצאות:ההרצאות היו מעולות, דורון התעכב על כל דבר קטן שלא היה ברור, השתדל לא להיות מתמטי מידי (עד כמה שאפשר בקורס כזה) ובעיקר דיבר בגובה העיניים וניסה לתת אינטואיציה\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: לא ממליץ. מאוד איטית (ברמה של שני תרגילים בתרגול) היא בוחרת בעצמה על מה לתרגל, אז זה בוודאות לא יכין אתכם למבחן. ובגדול היא לא נעימה לסטודנטים.\n\nשעורי הבית: \nחסרי כל קשר למבחן, נועדו להוריד לכם את המגן לאפס. ולרוב גם חסרי רפרנס.\n\nהמבחן: מבחן הזייה, גם אחרי שתרגלתי 30 מבחנים+ עדיין היה שאלות שהצליחו להפתיע בכמה שהן קשות. רבייב עושה נה שהוא רוצה ולאף אחד לא אכפת.\n\nהשורה התחתונה: קשה מאוד, דורש השקעה כל הסמסטר כדי לגרד עובר בחלק מהמקרים (תלוי מבחן ומצב רוח של דניאל) באופן אירוני כל הלימודים אח״כ מבוססים על מה שנלמד בקורס כמו התמרת פורייה. חבל שלא עושים מאמץ אמיתי להטמיע אותו", "timestamp": 1650038812962}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: לא תורמות לשום דבר וכלום\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: על הפנים. עושה שניים שלושה תרגילים בשעתיים וזה ממש לא מספיק כדי להכין למבחן. באופן כללי האווירה לא טובה אצלה ובמקום לעשות הרבה תרגילים כדי שנבוא מוכנים למבחן היא מעמיקה ממש בכל תרגיל בדיוק במקומות הלא חשובים וחבל.\n\nשעורי הבית: תרגיל אחד בשבוע להגשה\n\nהמבחן: דיי זוועתי אבל הפקטור פיצה קצת על זה.\n\nהשורה התחתונה: ממליצה בנוסף להרצאות ולתרגולים ללכת לפקל של אלחנדרו. זאת הדרך היחידה להגיע לציון טוב במקצוע הזה ולא לסיים אותו כמו כולם עם ציון של 60 או 70.", "timestamp": 1657709883672}, {"author": "אחד שיודע מרוכבות", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דניאל רבייב (צפיתי במקולטות של דורון) \n\nחוות דעת - הרצאות: לא אהבתי איך שדניאל מעביר את שיעורים, הייתי יוצא מבובל יותר מההרצאות. ההקלטות של דורון הצילו אותי, למרות כל הבאגים שהיו בהקלטה היה מאוד כיף ללמוד ממנו. אם הוא מלמד בסמסטר שלכם לכו אליו הוא מאוד מומלץ. בכל מקרה חשוב לעבור על הרשימת הרצאות של דניאל, יש שם כל מיני הערות מוזרות שמופיעות תחת משפטים שהוא לא מעביר בהרצאה, אבל כשר להשתמש בהם - מאוד שימושיים!\n\nשם המתרגל/ת: ליטל\n\nחוות דעת - תרגולים: יודעת את החומר ממש טוב, יודעת גם להעביר אותו לסטודנט, קצת לא נחמדה אבל לא משנה באמת תכלס, הבעיה שהיא לא פותרת מספיק תרגילים. אם היא הייתה פותרת עוד איזה 2 תרגילים רציניים זה היה פגז. מרגיש היא מנסה קצת למרוח את הזמן בחלק מהתרגולים\n\nשעורי הבית: שאלה פר גיליון פעם בשבוע, 15% מגן. השני גיליונות האחרונים יכולים להכנס לממוצע, אבל הם לא מחייבים.\n6 השבועות הראשונים בגיליונות זה תרגילים שהסגנון שלהם לא ממש מופיע במבחן, כן אבל חשוב להבין את החומר הזה לעומק כי הוא מופיע בדרכים שונות בהמשך\nאחרי מטלה 6 כולל הסגנון תרגילים דומה למבחן ואצלנו ליטל שמה תרגילים ממבחני עבר (גיליתי את זה בידעבד, אז כדאי לשבור עליהם את הראש)\n\nהמבחן: אוי ואבוי, יש פעם במועד שאלה מונפצת שבחיים לא הייתה, תכלס אם סגורים על החומר ממש טוב ולא לומדים כמו תוכי באמת שאפשר אפילו להצליח. הבעיה היא הבדיקה הביריונית של המבחן. כואב להם מאוד לחלק נקודות לסטודנטים במהלך הבדיקה. בגדול סביר מאוד להוציא 70-75 אם ממש משקיעים במהלך הסמסטר\n\nהערה חשובה!!!:\nאפשר תכלס לפתור שני שליש מהמבחן כבר משבוע 9-10 (כל החומר של מרוכבות בלי התמרות) תתחילו לתרגל למבחן הזה מאוד מוקדם, בערך משבוע 10-9, כי מרוכבות תמיד המבחן הראשון ובלתי אפשרי להרים אותו בשבוע לפני המבחן, צריך זמן כדי שהמסה הזאת תשקע ותשב כמו שצריך. כאמור, בגלל הוואריאציה הגדולה של השאלות שדניאל יכול לתת במבחן.\n\nהשורה התחתונה: \nקחו נשימה עמוקה, זה הולך להיות מאתגר, אבל בקרוב אתם תעברו את זה וזה יהיה מאחוריכם!", "timestamp": 1657783102510}, {"author": "tal", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דניאל רביב\nחוות דעת - הרצאות: מסביר טוב ,כאשר לא עוקבים ושואלים ,אין לו בעיה להסביר יותר מפעם אחת , בכללי הוא לא רע כמו שאומרים אבל לפעמים איטי\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: בהתחלה הלכתי לליטל והרגיש לי שהיא מעבירה שאלות לא ברמת המבחן אך הרישמות של יורם היו ממש מסודרות ויפות\n\nשעורי הבית: לא קשורים למבחן \\ לא מכיניות אותך לרמה של שאלות המבחן \n\nהמבחן: קשה מאוד מאוד ברמה מפתיעה למרות שפתרתי מעל 10 מבחנים והתחלתי ללמוד מוקדם והבנתי כל מעבר וכל שאלה בשאלות שפתרתי אך לא עזר לי למבחן ,נתן לנו 14 פקטור וגם הביא שאלה של טורים שקשורה לאינפי 2ח שלא בוחנת אותך במרוכבות!! \n\nהשורה התחתונה: אין מה לעשות רק דניאל מעביר קורס זה:(", "timestamp": 1658005898648}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דניאל רבייב \nחוות דעת - הרצאות: לא מאוד חשוב - דניאל מסודר ובקיא בחומר, אבל למרות זאת לרוב לא הצלחתי להבין את החומר ודברים הסתדרו רק לאחר התרגול. היו פעמים רבות שהעדפתי לא להגיע ורק לעבור על רשימות ההרצאה.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: אני אהבתי את שיטת הלימוד, אמנם איטית אבל נותנת אינטואיציה טובה לתרגילים. \n\nשעורי הבית: לא עמוס, שאלה בשבוע, ציון בין 0-10. אמנם המגן יחסית זניח. \n\nהמבחן: קשה מאוד, קחו בחשבון שכנראה יהיה תרגיל או שניים שלא נראו כמותם במבחני עבר + הזמן במבחן דוחק + המבחן הוא שניה וחצי לאחר סיום הסמסטר, ולכן ממליץ להתחיל להתכונן ברצינות כבר משבוע 12 לסמסטר כדי לפחות להכיר כמה שיותר סוגי שאלות.\n\nהשורה התחתונה: הקורס לא עמוס אבל המבחן קשה, לנסות לסדר את הסמסטר כך שבשבוע 12 תיפטרו מכל שאר המטלות ותתרכזו במבחן.", "timestamp": 1658422795127}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורי אליאש ביוטיוב\nחוות דעת - הרצאות: מעולה ממש! נותן אינטואיציה\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: מתרגלת טובה, מסבירה את החומר טוב אבל מספיקה פחות תרגילים. המליצו לי ללכת אליה כי היא כותבת את תרגילי הבית אבל לדעתי התרגולים שלה לא ממש עזרו. קצת לא נחמדה כששואלים שאלות אבל בסך הכל התרגולים שלה מעניינים .\n\nשעורי הבית: קצרים ולא קשים אבל לרוב אין רפרנס והבודקים קצת מחפשים על מה להוריד אז ממליצה להשוות תשובות עם סטודנטים אחרים לפני שמגישים. \n\nהמבחן: לא וואו, מרגיש שרבייב בונה את המבחן בעיקר על סמך טריקים ולא על הבנת החומר שזה קצת מבאס.\nממליצה לפני המבחן לפתור את התרגילים מדפי התרגול של *יורם* יש תשובות ברורות ועוזר לחומר לשקוע.\n\nהשורה התחתונה: קורס ממש מעניין אבל המבחן נחמד.", "timestamp": 1667286763772}, {"author": "סטודנטית מחשמל", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nהוא יודע טוב את החומר ומסביר מאוד יפה לעצמו, אבל יש את רשימות ההרצאה במלואן מילה במילה אז אין עדיפות מיוחדת לללכת אליו.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: יורם הרגיש לי מעופף מדי אז הייתי אצלה, היא מסבירה בקפדנות אבל לא קשובה לסטודנטים בכלל אז היא יכולה לדבר חצי שעה על פרט לא חשוב שכולם מבינים, ולא להתעמק בכלל בנקודה שקשוחה לכולם להבנה. \nהאווירה בתרגולים שלה מאוד לא נעימה, בדיעבד עדיף ללכת ליורם.\n\nשעורי הבית: אם רק מגישים את מה שחייבים אז זה לא לוקח המון זמן (מקסימום נעזרים בסטודנטים בקבוצה שפתרו) וזה גם עם משקל נמוך, אבל זה לא ממש תורם למבחן.\n\nהמבחן: זוועה וזיוועון. כל הכיף של רבייב הוא שכל שאלה תהיה התקלה חדשה, כדי שאף פעם לא נרגיש בטוחים. 5 שאלות אמריקאיות שלוקחות נצח של חישובים ואפשר ליפול על טעות חישוב קטנה, ו4 שאלות פתוחות שלפחות חלקן כוללות איזה טריק הזוי שלא נראה מעולם.\nואם זה לא מספיק - המבחן ביום הראשון/שני של תקופת המבחנים, אז אין ברירה אלא ללמוד אליו בסמסטר.\n\nהשורה התחתונה: ללמוד תוך כדי הסמסטר, לא לסמוך על שיעורי הבית בכלל - הם לא יעזרו לכם, לתרגל מבחנים כדי שתצליחו את השאלות עם ההנפצות שכבר כן נראו, ובעזרת השם תיפלו רק בהנפצות הממש מוגזמות והפקטור יציל אתכם.\n\nהקורס לא באמת עמוס במהלך הסמסטר מבחינת עבודות, אבל צריך לפנות לו מסםיק זמן מסוף הסמסטר כדי ללמוד", "timestamp": 1674672625046}, {"author": "כרמל", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nדורון בפנופטו\nחוות דעת - הרצאות: \nדורון מושלם. אין מה ללכת להרצאות בלייב כשיש את דורון המלך.\nשם המתרגל/ת: \nיוליה\nחוות דעת - תרגולים: \nהיה כיף בתרגוליה, ממש כיף עם יוליה בקורס הזה.\nשעורי הבית: \nגליון שממנו צריך לעשות שתי שאלות בשבועיים, לא לחוץ בכלל. לא להקשיב לביקורות הקודמות, לנו היו שתי שאלות מהש\"ב במבחן עצמו אז מומלץ לעבור עליהם לפני המבחן. לא מפרסמים פתרונות אז אפילו אולי כדאי לעבור עליהם יום-יומיים לפני המבחן וללכת עם זה לשעת קבלה.\nהמבחן: \nבסה\"כ היה מבחן הוגן, פעם ראשונה שיש פתרון מד\"ח עם התמרת פורייה במבחן אבל צלחנו את המכשול הזה. בסה\"כ, זה קורס שהרבה אנשים הלחיצו אותנו ממנו והיה סבבה. יכול להיות שאנשים צודקים ובשנים שעברו היה רע, אבל רבייב נשמה טהורה ולא צריך לדאוג, פשוט לטחון איזה 15 מבחנים ואתם תהיו בסדר.\nהשורה התחתונה: \nאני נהנתי. ואתם?", "timestamp": 1675086130689}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nנכחתי ברוב ההרצאות ואי אפשר להגיד שהן היו מיותרות, פשוט רבייב קצת איטי, לא תמיד עקבתי אחריו ולפעמים הוא בא לא מוכן להרצאות. אין מה לעשות. אפשר לקרוא את הרשימות שלו, הן לא 1 ל1 עם מה שהוא מעביר בהרצאות אבל אפשר להגיד שזה מספיק (לפעמים יורד חומר אז גם צריך להיות מעודכנים עם מה שקורה בהרצאות).\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nליטל מתרגלת מדהימה.\n\nשעורי הבית: \nלא עמוס. גיליון אחד (שתי שאלות) כל שבועיים. אפשר להיעזר באחרים\n\nהמבחן: אז זהו שמועד א׳ שלנו היה הוגן לפי דעתי, יחסית לשנים קודמות. אבל אבל אבללל רבייב כמו תמיד אוהב להפתיע עם שאלה שמעולם לא ראיתם כמותה. בשאלה האחרונה היה מד״ח עם התמרת פוריה שכרנאה היה כמוה בגיליון 6 שלא היה להגשה ולצערי הם לא מפרסמים פתרונות לגיליונים אז באסה.\n\nהשורה התחתונה: אל תתייאשו כשאתם פותרים מבחנים זה באמת זוועה אבל יהיה בסדררררר עברנו אינפי מדר והרבה זוועות כאלה", "timestamp": 1675102773279}, {"author": "--", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nמאוד מתרכז בהוכחות של דברים ופחות בלתת אינטואיציה על החומר, הרבה פעמים מרגיש שהוא לא 100 אחוז מוכן לשיעור ומתחיל להתבלבל בהוכחות ולהתקע\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: לא טובים בכלל. מעבר לזה שהיא מאוד איטית ומספיקה אולי 2-3 תרגילים כל פעם היא גם מאוד לא נעימה לסטודנטים, בקושי עונה על שאלות וגם כשעונה זה \"למדתם בהרצאה\".\n\nבאמצע הסמסטר עברתי לתרגולים של יוליה בלבד- סופר מומלצת, מספיקה המון תרגילים ומסבירה טוב.\n\nשעורי הבית:  לא עמוסים במיוחד, 2 שאלות להגשה פעם בשבועיים אבל לרוב עם טריקים הזויים שלא נלמדו ועד שמישהו לא מראה לך אותם אין סיכוי שתצליח.\n\nהמבחן: סביר, רבייב עשה קטע ונתן שאלה של 20+ נק על פתירת מדח באמצעות טורי פוריה, משהו שהוא נתן כדוגמה של חמש דק באיזה הרצאה. \n\nהשורה התחתונה: בכללי- יכל להיות קורס סביר יותר אבל הסגל שלו פשוט מתנהל בצורה בזיונית. לא מפרסמים פתרונות לשיעורי בית (גם לרשות), לא עוזרים כשמבקשים מהם לפתור תרגילים ספציפיים, ליטל נותנת לכל אחד לשאול שאלה אחת בלבד בשעת קבלה, כשביקשתי לערער על ציון שב היא אמרה שזה רק בשעת קבלה מולה, ועוד הרבה דברים שגרמו לקורס הזה להיות סיוט. חבל", "timestamp": 1675166508423}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: בזבוז זמן להוכחות מיותרות, גם בסוף הסמסטר כשהמבחן מתקרב ועדיף לסיים את החומר ולהשאיר את ההרצאה האחרונה לפתרון תרגילים. ככל הנראה זה הסמסטר האחרון שהוא מעביר את הקורס בפורמט הזה, אז לא בטוח עד כמה רלוונטי\n\nשם המתרגל/ת: יוליה פייגין קצוב + ליטל שמן\nחוות דעת - תרגולים: הלכתי לליטל בהתחלה ועברתי ליוליה אחרי אמצע סמסטר, בדיעבד חבל שלא הלכתי ליוליה מהשניה הראשונה שהסמסטר התחיל. ליטל מסבירה בצורה מאוד איטית, קפדנית ומייגעת על כל נקודה ונקודה, בעיקר דברים שהם תיאוריה שלא רלוונטיים בתכלס למבחן.\nיוליה בקצב מעולה, מסבירה מה שרלוונטי ומראה טריקים ותרגילים טובים. מדברת בגובה העיניים ואין אווירה מגעילה בכלל בניגוד לליטל, שאצלה מפחדים לפצות פה\n\nשעורי הבית: פעם בשבוע מתפרסמת שאלה להגשה, לא ברור למה הסגל לא פרסם פתרון לתרגילי הבית, גם לרשות וגם לחובה אחרי שעבר תאריך ההגשה. אטימות מוחלטת מצד הסגל בעניין הזה. שיעורי הבית לא מרגישים רלוונטיים לבחינה, אפשר לרפרנס ולהבין את הקונספט מאשר לשבור את הראש\n\nהמבחן: מפוצץ טריקים!!! קטע מסריח של שאלה במדח אבל שאר המבחן היה יחסית הוגן וחזר על עצמו משנים קודמות\n\nהשורה התחתונה: קורס מייגע, לא אינטואיבי אבל בסוף כשלומדים למבחן התמונה מתבהרת, אין מה לפחד ממנו", "timestamp": 1675345904460}, {"author": "Alon Maayan", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: ניזאר לא מרצה כל כך טוב... הוא לא מסודר, לא מאורגן, בקצב לא טוב ולא ברור במיוחד...\n\nשם המתרגל/ת: נסים\nחוות דעת - תרגולים: מתרגל טוב, אבל היתה תחושב שהוא לא כל כך מוכן לתרגל את הקורס... לא עברנו על התמרת z עד השיעור האחרון וגם לא נראה שהוא זוכר את כל החומר של הקורס...\n\nשעורי הבית: גליונות סבירים, לא קושרים למבחן אבל לא ארוכים במיוחד. יש רפרנסים טובים בדרייב.\n\nהמבחן: לא קשור לכלום... המבחן בוחן על כמה אתה מכיר את הטריקים של רבייב... מקווה שעם ניזאר בסמסמטר הבא יהיה שונה.\n\nהשורה התחתונה: קורס סביר אבל מבחן מעיק", "timestamp": 1675518237173}, {"author": "Israel Bareketh", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: הייתי אצל רוס, היה נהדר. מסביר טוב ולא מתעכב יותר מדי עם הוכחות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מוקלטות. בדיעבד, לא הכי חכם.\n\nשעורי הבית: שישה גליונות, צריך לפתור שתי שאלות מתוכן. לרוב שאלות קלות שלא מייצגות בכלל את המבחן.\n\nהמבחן: פשוט לא.\n\nהשורה התחתונה: אין ברירה, חייבים לקחת אותו. רק לזכור שיש אור בקצה המנהרה.", "timestamp": 1675593118539}, {"author": "מרקו בלבול", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רוס פינסקי\nחוות דעת - הרצאות: אגדה מהלכת, הביאו אותו בחירום ככה\"נ כי לא היה מרצה אחר. הוא מתמטיקאי ומרצה בחסד, העביר את מרוכבות בצורה מאוד ברורה וידע מתי צריך להתמקד בפרטים הקטנים ומתי לא. אמנם החומר של התמרות לא היה ממש איזור הנוחות שלו אבל גם אותו הוא העביר בצורה מעולה. מעבר למקצועי, האווירה בכיתה שלו הייתה מעולה ואחרי חצי סמסטר הוא הכיר כבר את כל הסטודנטים בשם. אם במקרה הוא מעביר קורס המשך, ממליץ עליו בחום.\n**כמו כן ממליץ על קובץ ההרצאות של רבייב במקום לכתוב בהרצאות, הוא כתוב טוב ויש בו באמת כל כל מה שצריך**\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: לדעתי המתרגלת הכי טובה שהייתה בסמסטר שלנו, העבירה את התרגולים בצורה סולידית, ידעה לענות בצורה עניינית וחדה לשאלות שלנו, והכי חשוב - היא לא שבורה מלהעביר את הקורס.\n\nשעורי הבית: תרגיל אחד חובה להגשה בשבוע, והוא לא תמיד התרגיל הכי חשוב בגליון. לדעתי - החל מאמצע הסמסטר צריך להתחיל לעשות גם את השאלות שלא להגשה כי הן מתחילות להיות שאלות בסגנון המבחן.\n\nהמבחן: מבחן שלא כיף (בלשון המעטה) להתכונן אליו, כי סביר להניח שתהיה שאלה אחת מאוד מקורית במבחן שיהיה קשה מאוד לפתור, אבל לדעתי אם עשיתם מסה קריטית של מבחנים כבר ראיתם את רוב התרגלים ואת ה70 תצליחו להוציא. בסה\"כ עושים אותו וממשיכים הלאה.\n\nהשורה התחתונה: קורס שמצד אחד יש בו עניין והוא מציג קונספטים מעניינים, אבל מצד שני המבחן קצת מעיב אליו. בכל מקרה לומדים אותו מחדש באותות לפי השמועות אז פשוט צריך לסיים אותו. תודה לרוס שהביא אותי עד הלום.", "timestamp": 1675788642103}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nלא חדש... הבן אדם בלתי נסבל ועושה הכל כדי למרר את חיי הסטודנטים. \nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nסבירה לגמרי, קצת מתנשאת ומדלגת על פרטים לא מובנים מאליהם אך שולטת יפה בחומר\nשעורי הבית: \nמעט, לא דומים למבחן אך חשובים לעשות וכמובן שהסגל לא מפרסם פתרונות אז אין איך לבדוק תשובות\n\nהמבחן: מבחן של רבייב.. קשוח וטריקי עם הרבה מקומות למעוד\n\nהשורה התחתונה: חובה", "timestamp": 1675803700870}, {"author": "סטודנט לחשמל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יוליה +פק\"ל של אלחנדרו\nחוות דעת - תרגולים: יוליה מצויינת, מאוד ברורה, תרגילים טובים. הפק\"ל של אחנדרו זו הדרך להצליח, מתחילים לפתור תרגילים ברמת מבחן מתחילת הסמסטר, והוא מפשט את החומר התאורטי של רבייב לפתרונות יחסית טכניים. מומלץ בחום!\n\nשעורי הבית: לא עמוסים, מדי פעם יש שאלה הזוייה שהערך הלימודי שלה לא ברור. מומלץ לפתור את השאלות רשות, אבל אחרי שעוד אנשים פתרו, כדי לא לבזבז זמן על הנפצה לא רלוונטית.\n\nהמבחן: שלנו היה הוגן. בכל מקרה, אלחנדרו מכין למבחן בצורה מיטבית.", "timestamp": 1675850864380}, {"author": "סטודנט להנדסת חשמל", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רוס\nחוות דעת - הרצאות: בסמסטר שלנו המרצים היו רבייב ורוס. \nרוס מרצה מאוד נחמד, אך לדעתי לא מסביר את החומר בצורה טובה. הוא הרבה פעמים התבלבל במהלך הוכחות, הכתב שלו ממש לא מובן ולא הצלחתי לקבל ממנו הרבה ערך מוסף. העדפתי ללכת פרונטלי, אז יצא שבשלב מאוחר מדי עברתי להקלטות של דורון אלעד. דורון מרצה מצוין, אם הוא במקרה מרצה בקורס מאוד ממליץ ללכת אליו.\n\nשם המתרגל/ת:  יורם מוקלט ואז יוליה.\nחוות דעת - תרגולים:\nדיס המלצה על ההקלטות של יורם, הוא מאוד נחמד ומסביר טוב אבל לא כותב מסודר ומאוד מבולגן בכללי. ממליץ ללכת פרונטלי ליוליה. אמנם היא רצה מהר מדי הרבה פעמים ומדלגת על מעברים שקשה להבין בלעדיהם, אבל ללא ספק היא הכי טובה בקורס ופותרת תרגילים מאוד חשובים. ממליץ לכתוב אצלה בשיעור ולעבור על זה אחר כך.\n\nבנוסף דיס המלצה על ליטל, הייתי בתרגול אחד שלה. היא מאוד איטית, מתעכבת על דברים קלים ולא מספיקה כמעט תרגילים.\n\n\nשעורי הבית: \nשאלה בשבוע, שאלות מונפצות שלרוב לא קשורות למה שראיתם בתרגולים או תראו במבחן. לא ממליץ לשבור את הראש עליהם, לדעתי לרפרנס ולנסות להבין איך פתרו. היו עוד שאלות רשות בלי פתרונות, אני אישית לא נגעתי באף אחת מהן ולא הרגשתי מחסור כלשהו. מרגיש לי מיותר לפתור תרגילים בלי פתרון שאוכל לוודא אחרי זה.\n\nהמבחן: המון טריקים שחוזרים על עצמם. ממליץ אם יש לכם זמן, לפתור תרגילים מהרשימות תרגולים של יורם בדרייב של חשמל. יש לו סיכום תמציתי של כל נושא ותרגילים עם פתרון מלא, ממש מומלץ לחזרה על החומר. בכללי לפתור הרבה מבחנים ולא להתייאש, בהתחלה זה נראה מפחיד אבל מאוד חוזר על עצמו. אצלנו היה מבחן די הוגן עם שאלה אחת מונפצת על נושא שבחיים לא היה. אבל סה\"כ עם למידה נכונה אפשר להוציא ציון סבבה ולהמשיך הלאה.\n\nהשורה התחתונה: \nקורס לא ממש מהנה לדעתי, כדאי לנסות להיות על החומר של התרגולים ולא להתרגש משיעורי הבית.", "timestamp": 1675860489982}, {"author": "כ", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: הלכתי פרונטלי כל הסמסטר וזו הייתה טעות. דניאל נראה בנאדם נחמד בסהכ אבל הוא לא ממש יודע להעביר חומר. הוא מעביר את הקורס כבר שנים אבל עדיין ינסה לחשוב מחדש על הוכחות ודומאות תוך כדי הרצאות ולא להשתמש בקובץ באתר שהוא עצמו(!) הקליד. \n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: מתרגלת טובה בסך הכל. אווירה לא הכי טובה, אבל מתמקדת על נקודות שיכולות להיות חשובות (למרות שבמבחן בסוף מתברר שלא). \n\nשעורי הבית: לא ממש מועילים, בטח כשהסגל המאוד מאוד נחמד של הקורס לא מפרסם פתרונות. \n\nהמבחן: רע. פשוט רע.\n\nהשורה התחתונה: מלג לא מומלץ", "timestamp": 1675870779292}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: בהתחלה רוס ואז דורון אלעד מוקלט\nחוות דעת - הרצאות: בגדול אפשר לומר שאפשר לוותר על ההרצאות בקורס הזה בגלל רשימות ההרצאה הטובות של דניאל. בכל מקרה ההקלטות של דורון למרות איכות לא הכי טובה יחסית בסדר ונותנות תחושה סבירה לחומר. בסופו של דבר מעבר על הרשימות היה ממש מספיק כדי לקלוט את החומר\n\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: מתרגלת מצוינת. הייתה אווירה ממש טובה וכל תרגיל שהיא עשתה בתרגול היה עם עקרון סופר חשוב שעזר במבחן. לרשום כל מעבר שהיא עושה על הלוח בצורה ברורה ולעבור שוב על התרגולים שלה\n\nשעורי הבית: לרפרנס בשביל המגן אבל אין סיבה להשקיע בהם בסוף לומדים רק מלפתור מבחנים של הקורס\n\nהמבחן: בגדול נפלנו על מבחן יחסית סביר חוץ משאלה אחת. המלצה כללית למבחן היא לעבור על כל דוגמא שיש ברשימות של דניאל ולהבין אותם טוב כי לפעמים הוא פשוט לוקח שאלה משם...\n\nהשורה התחתונה: קורס קשה והצוות לא הכי סימפטי אבל אפשר לקבל ציון נורמלי ולהמשיך הלאה", "timestamp": 1675944907025}, {"author": "קושי גדול", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רבייב/רוס\nחוות דעת - הרצאות: רוס הכי טוב\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: בן אדם ממש לא נחמד. מלמדת אחלה\n\nשעורי הבית: חופרים, יש שם הרבה שאלות ממבחנים וכדאי להיות על החומר לאורך הסמסטר כי יש הרבה נושאים לא קשורים כל כך\n\nהמבחן: קשה אבל תכלס טכני ואפשר להצליח אם לומדים נכון\n\nהשורה התחתונה: פשוט תקחו את הפקל של אלחנדרו, ככה מצליחים בקורס הזה (אפשר גם רק לראות את ההקלטות שלו לפני המבחן)", "timestamp": 1676018752038}, {"author": "ח.כ", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלחנדרו\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אלחנדרו\nחוות דעת - תרגולים: \n\nשעורי הבית והמבחן: סוואגים וואלאבלה\n\nהשורה התחתונה: אין על אלחנדרו", "timestamp": 1676035236127}, {"author": "Shiran Fournier", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: סך הכל מעביר את ההרצאות בצורה סבירה, עונה באופן מכבד על שאלות. קצת תחושה שהוא מעביר את החומר לעצמו ולעיתים קרובות מתעכב על הוכחות שהוא מנסה לכתוב לבד במקום להסתכל בדפים שלו שזה מבזבז זמן וגם מבלבל\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: איטית וברורה בתרגולים שלה אבל לא מספיקה כמו שאר המתרגלים. לא עוזרת בכלל בשעות קבלה \n\nשעורי הבית: שיעורי הבית קשים ממש ולרוב בכלל לא קשורים לחומר הנלמד. כמעט בכל תרגיל להגשה יש איזה טריק שבלעדיו התרגיל בלתי פתיר (והטריק בכלל לא קשור לחומר כמו למשל נוסחת הבינום)\n\nהמבחן: מבחנים קשים מאוד, אבל גם מאוד חוזר על עצמו בסוף\n\nהשורה התחתונה: קורס מאוד קשה שדורש הרבה השקעה ולמידה ועצמאית", "timestamp": 1676100752773}, {"author": "אחלה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nריבייב\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: כולם אומרים קשה לעבור,אבל מה שיותר קשה שכולם יעברו ואתה לא \nלך ללמוד....", "timestamp": 1676169559154}, {"author": "לא חשוב", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רבייב דניאל\nחוות דעת - הרצאות: רבייב בגדול מרצה טוב, אבל מאוד אוהב להרחיב, ויש הרצאות מיותרות הוכחות שלא תורמות לנו כלום ולא רלוונטיות למבחן.\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: ליטל מסבירה את החומר בצורה טובה, בקצב איטי, וקצד לא נחמדה עם הסטודנטים לכן לא התחברית\n\nשעורי הבית: לא רלוונטיות למבחן או להבנה, מציע במקום להשקיע על רשימות יורם\n\nהמבחן: לא כל כך קשה כמו שתיארו לנו, דניאל מאוד אוהב להפתיע כמו במבחן האחרון שהביא שאלה במדח שהסביר אותה בהרצאה ב5 דקות, אם אתם ממש על החומר ופותרים הרבה מבחנים כן אפשר להוצא ציון טוב 80+\n\nהשורה התחתונה: קורס מאוד יפה ומעניין, אבל הצוות לא.", "timestamp": 1676574377349}, {"author": "---", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: הקלטות של דורון\n\nשם המתרגל/ת: הקלטות של יורם\nחוות דעת - תרגולים: מעביר את החומר בשביל שנהיה מהנדסים טובים יותר ולא בשביל לעבור את המבחן.\n\nשעורי הבית: עונש דו שבועי.\n\nהמבחן: הגראנד פינאלי של רבייב.. נכנס בנו בכל הכוח.\n\nהשורה התחתונה: לא ללמוד אצל רבייב.", "timestamp": 1676826275165}, {"author": "Grades", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: \nסה\"כ נחמד אבל די היה משמים מבחינתי ולא הרגיש לי שתרם יותר מדי להבנה של החומר\n\nשם המתרגל/ת: ליטל\nחוות דעת - תרגולים: \nלא משהו, איטית וגם לא תמיד עושה תרגילים רלוונטיים\n\nשעורי הבית: \nהחצי הראשון זה בעיקר בסיס שחשוב אבל לא ש.ב קריטיים, החצי השני כבר מזכיר יותר תרגילים ממבחנים\n\nהמבחן: \nבכל מבחן רבייב מפתיע, אצלנו שם מדח עם התמרות פורייה.\nחשוב לתרגל מלא כי 75 אפשר להוציא נטו מלעשות הרבה מבחנים ואת השאר צריך לקוות שהבנת מה הדגשים שלו באותו סמסטר שהוא יכול להפתיע איתו במבחן(אצלנו כמו שאמרתי זה היה מדח עם התמרות פורייה)\n\nהשורה התחתונה: \nלקחת את הפקל של אלחנדרו, מי שלא לקח אותו היה לו יחסית קשה במבחן ומי שלקח הלך לו יותר טוב ממה שראיתי(ממליץ על המקוון ממש)", "timestamp": 1676896548704}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: לא הבנתי כלום בערך משבוע 4. דניאל מאוד אוהב להתפלסף על הוכחות, במקום פשוט לכתוב את ההוכחה ואז להסביר הוא מוכיח יחד עם הסטודנטים ומי שלא ככ מבין פשוט מאבד אותו והוא לא מסביר אחכ שוב. תכלס הוא לא מנגיש את החומר לסטודנטים ומאוד קל לאבד אותו במהירות... \n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: \nתראו, ליטל בלשון המעטה לא בחורה נעימה... אבל היא מתרגלת טובה בעיניי. צריך לבוא מוכנים לתרגולים שלה ולדעת את המשפטים שנלמדו בהרצאה כי היא פשוט לא תחזור עליהם לא משנה מה מקטע של פרנציפ (או שפשוט תוודאו שהם פתוחים לכם ואתם יכולים להיזכר תוך כדי התרגול).\nמה כן אהבתי בתרגולים שלה: היא סופר מסודרת על הלוח ויש לה כתב מאוד קריא ומובן. היא עוברת על השאלות יחסית לאט- לי זה התאים כי אני מעדיפה אבל קחו בחשבון שהיא מספיקה פחות שאלות. היא יודעת את החומר טוב ומסבירה טוב בגדול. באופן עקרוני התרגילים שהיא נותנת יחסית משקפים את תרגילי הבית.\nשעורי הבית: שאלה אחת בשבוע. לא עמוס בכלל אבל לפעמים קצת בלתי פתיר, תמיד יש מי שמצליח אז מקסימום תרפרנסו ותקפידו להבין את הפיתרון.\n\nהמבחן: היה הוגן למי שהיה מוכן חוץ מהשאלה של המד\"ח עם התמרת פורייה שהפתיעה את כולם. כדאי לדעת את הדוגמאות שדניאל עושה בהרצאות.  עם הפקל של אלחנדרו ותרגול של כמות יפה של מבחנים של רבייב אפשר להוציא 90+\n\nהשורה התחתונה: לקראת המבחן ראיתי את הפקל המוקלט של אלחנדרו שיש בו את כל הטריקים של רבייב ומכסה כל פיפס שיש במבחן. הגעתי ממצב שבקושי ידעתי משהו לציון פצצה. קורס קשה אבל לא עמוס.", "timestamp": 1677512288837}, {"author": "a", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: הקלטות של דורון אלעד\nחוות דעת - הרצאות: \nהתחלתי אצל רוס, אין ספק שהוא בן אדם טוב אבל לא היה לי כל כך ברור. עברתי להקלטות של דורון יחד עם הרשימות של רבייב והיה מעולה.\nשם המתרגל/ת: יוליה\nחוות דעת - תרגולים: \nמצד אחד מתרגלת טובה ששולטת בחומר, מצד שני הרגישה הרבה פעמים מהירה מידי והייתה תחושה שהיא מדלגת על שלבים, ויכול להיות שהיה יעיל יותר אם פשוט הייתה מסבירה הכל. כנראה הכי טובה מהמתרגלים שיש.\nשעורי הבית: \nלא רלוונטים, תרגיל פעם בשבוע והגשה פעם בשבועיים, בלי רפרנסים מאנשים שהלכו לשעת קבלה אי אפשר באמת לפתור ולא באמת עוזר למבחן\nהמבחן: \nמזעזע, רבייב קלאסי. שלנו היה יחסית סביר, אבל זה רק כי אחרי שמתרגלים לזוועות של רבייב פתאום שלנו נראה נורמאלי.\nהשורה התחתונה: \nהדבר היחיד שיכול לעזור בקורס הזה זה הפקל של אלחנדרו. חובה חובה", "timestamp": 1677922390707}, {"author": "Tamir Manoach", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: המרצה סבבה\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: כמרצה היא בסדר, לא מעולה אבל בסדר.\nאבל כבן אדם... פשוט לא!\n\nשעורי הבית: הרבה לא ממוחזר, והכל קשה\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: הקורס נסגר", "timestamp": 1678261070650}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות:  מבולגן פיצוצים, הוא מתבלבל המון במהלך השיעור, לי היה קשה להתרכז ככה.\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים:  יודעת את החומר אבל התרגולים שלה לא מספיק מכינים אותך למבחן או לשיעורי הבית. ובאופן כללי היא לא הכי נחמדה\n\nשעורי הבית: מגישים 2 שאלות אחת לשבועיים ואחת נבדקת שאר השאלות לתרגול עצמי, לא היו מוכנים לתת קווים מנחים לפתירת השאלות אז לא היה דרך לדעת אם פתרת נכון או לא את השאלות, ובשעות הקבלה המענה לא היה מספק (חלק מהמתרגלים בעצמם לא ידעו לענות על השאלות והאחרים פשוט לא היה מספיק זמן לכל שאלות לרוב, אישית  לכן תיעדפתי לשאול קודם על השאלות הגשה ורק לאחר מכן שאלות מעבר)\n\nהמבחן:  קשה אבל דיי הוגן, הייתה להם טעות בבדיקה אצל כולנו ובמקום לבדוק את השאלה האמריקאית הזו מחדש הם אמרו לנו להגיש ערעור אם חשבנו שטעו אצלנו.\n\nהשורה התחתונה: קורס לא עמוס במיוחד במהלך הסמסטר אבל מצריך השקעה על מנת להבין את החומר ולהצליח במבחן, \nבשורה התחתונה הוא נסגר עוד 2 סמסטרים אז זה לא כזה משנה", "timestamp": 1679666114204}, {"author": "מ", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: רבייב\nחוות דעת - הרצאות: מרצה סביר\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: הייתי איתה בקורסים אחרים והיא הייתה תותחית אך הפעם די מפוזרת ולא סגורה עד הסוף על החומר, אין תקשורת גם בינה לבין הסגל אז לא ברור מה בדיוק צריך למבחן. \n\nשעורי הבית: לא הרבה אבל הרבה מהשאלות בלתי אפשריות לפתור לבד, סתם מסבך ומעייף, לנסות לבד בקטנה ואם לא לעבוד עם רפרנס / לבדוק עם חברים\n\nהמבחן: חלק סביר וחלק מוגזם ממש, מבחינתי זה לשרוד את הקורס (חוזר עליו /: )\n\nהשורה התחתונה: קורס עמוס בהגזמה אבל בקרוב יפרידו אותו, אם אתם לא צריכים לעבור מה שעברנו תגידו תודה בורכתם. יאללה יהיה בסדר", "timestamp": 1679668007598}, {"author": "שונא רבייב", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "דניאל רבייב. הכי לא טוב.\nאין מה להוסיף.", "timestamp": 1679914526407}, {"author": "צוריאל ויזל", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהקלטות מעולה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהקלטות מעולה\nשעורי הבית: \n\nהמבחן: \nללמוד ולזכור משפטים. בסוף מזכיר קצת חדוא 2\nהשורה התחתונה:", "timestamp": 1683625633520}, {"author": "מאיה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: רבייב \nחוות דעת - הרצאות: קשה לי להגיד חד משמעית היו דברים שהוא לימד טוב ודברים שלא כלכך. הוא כן נחמד וסבלני אבל ההרצאות לא כלכך עזרו לי, בפועל למדתי הכל מהפקל של סטאדיס עם אלחנדרו \n\nשם המתרגל/ת: ליטל \nחוות דעת - תרגולים: היא מסבירה מאוד טוב ולאט, לא עושים הרבה תרגילים אבל זה ככה גם בשאר המתרגלים שעושים בול כמוה. היא ממש מקצועית \n\nשעורי הבית: קליל , לרוב גם לא רלוונטי \n\nהמבחן: תקנו את הפקל של סטאדיס עם אלחנדרו !!! באמת הציל לי את המבחן. למועד ב למדתי רק ממנו אפילו לא עברתי על הרצאות והלך טוב. ממליצה בחום, וגם אלחנדרו ממש נחמד.\nיכולים לראות שבסימסטר שלי כולם קנו את הפקל וקיבלנו ממוצע גבוה בלי פקטור \n\nהשורה התחתונה: תקנו את הפקל ואפשר להבריז מהרצאות", "timestamp": 1684841283180}, {"author": "Cristiano is the GOAT", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: צפיתי למוקלט של רבייב , שהיו מעולות\n\nשם המתרגל/ת: יורם יחיא\nחוות דעת - תרגולים: צפיתי במוקלט /שלו ת הוא נהדר ומסביר בצורה טובה ואיכותית\n\nשעורי הבית: לא קשים בכלל \n\nהמבחן: הוגן מאוד , לא קשה\n\nהשורה התחתונה: קורס נחמד . הוא נסגר הסמסטר.", "timestamp": 1689246010246}, {"author": "מר H", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ניזאר רדואן\nחוות דעת - הרצאות: \nפשוט מיותר. צפיתי בהקלטות של רבייב מהקורונה, היו טובות. ניזאר פשוט ריפרנס את הקובץ הרצאות של דניאל (שהוא מעולה) ועשה את זה גרוע. מתבלבל המון פעמים.\n\nשם המתרגל/ת: מרינה גרוזד\nחוות דעת - תרגולים: \nמתרגלת טובה. היא מתרגלת בעיקר מהקבצים של יורם שיש במודל והם טובים. תכלס היא לא מספיקה אף פעם לעבור על הכל (ולא באשמתה, הם ארוכים מאוד) ולכן כדאי אולי לשקול גם תרגולים בהקלטות של יורם, שמעתי שהן מעולות.\n\nשעורי הבית: \nממש נחמדים, אין משהו רע להגיד\n\nהמבחן: \nהיה מבחן לא סבבה בניגוד למה שכתבו לפניי. כן היו דברים ממוחזרים אבל בקטע הטכני של המבחן היו דברים נוראיים שגם אם ראיתם אותם פעם לא הייתם רוצים שייתנו לכם אותם במבחן. אמריקאיות נוראיות.\n\nהשורה התחתונה: \nאין ברירה כל כך כי חייבים לקחת את הקורס הזה, אבל אני באמת ממליץ לכם לסיים את הקורס עם הקלטות שבועיים לפני סוף הסמסטר ולעשות מבחנים, זאת הדרך היחידה להצליח כי בד''כ המבחן הזה הוא הראשון מבין כולם (שלנו היה ביום ראשון שאחרי הסמסטר). בהצלחה!", "timestamp": 1689519558040}, {"author": "OG", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ניזאר\nחוות דעת - הרצאות: \nאני בטוח שהוא יודע מתמטיקה טוב, את החומר של הקורס הזה פחות…\n\nשם המתרגל/ת: יורם\nחוות דעת - תרגולים: \nמתרגל מעולה, עזב אותנו ללא התראה מוקדמת באמצע הסמסטר (ממליץ לצפות בהקלטות שלו בכל מקרה). \n\nשעורי הבית: \nהרוב ממוחזר, קצת קשים אבל שווים את המאמץ\n\nהמבחן: \nממוצע 59 אומר את הכל…\n\nהשורה התחתונה: \nקורס מעניין למי שאוהב מתמטיקה, ללמוד בעיקר מתרגולים ורשימות של יורם ולפתור הרבה מבחנים", "timestamp": 1690049930403}, {"author": "חצי מהנדס", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ניזאר\nחוות דעת - הרצאות: \nלא הייתי, חוזר על הקורס\n\nשם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: \nנחמד\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: ישתבח שמו לעד שסוף סוף פירקו את הקורס הלא מחובר למציאות הזה.", "timestamp": 1690275225009}, {"author": "גברת H ההרמונית והשלמה", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ניזאר/ דניאל רבייב מוקלט\nחוות דעת - הרצאות:\nניזאר סתם הקריא מהדף, הייתי אצלו 5 הרצאות ולא קיבלתי יותר מידי ערך מוסף, מתבלבל עם עצמו הרבה. עברתי להקלטות של רבייב מהקורונה, אחלה של דבר. \n\nשם המתרגל/ת: מרינה גרוזד (גרדוזה)\nחוות דעת - תרגולים: אחלה מרייייינה. צריך לאהוב את הסגנון, אבל אני אהבתי וחושבת שהיא אחלה של מתרגלת ומראה יחסית הרבה תרגילים. משתמשת בדפים של יורם שזה מעולה. אבל חבר'ה, לא לדבר בבקשה... מרינה צריכה שקט כדי להתרכז.\n\nשעורי הבית: די סבבה, לא יותר מידי עמוס. אצלנו היה פעם בשבועיים בערך, אפילו יותר זמן לפעמים (כי ניזאר גזור). \n\nהמבחן: חרא של דבר. לא היו לנו בכלל מבחנים של ניזאר, די הפתיע באמריקאיות שהיו קשות. באסה שרבייב לא היה אחראי,  נדפקנו עם ניזאר הכנר הזה ממש.\n\nהשורה התחתונה: לא מומלץ, לסגור את הקורס בקשה.", "timestamp": 1690381251724}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ניזאר \nחוות דעת - הרצאות: הקלטות רבייב - הכי טוב שיש\n\nשם המתרגל/ת: מרינה \nחוות דעת - תרגולים: \nעל הפנים.. לא אכפת לה בכלל\nתקנו את הפקל של אלחנדרו יש בו את כל התרגולים+כל המבחנים וזה עוזר שווה את הסכום כסף הקטן\n\nשעורי הבית: \nקלילים\nהמבחן:  זורם למי שעשה אלחנדרו\n\n\nהשורה התחתונה:", "timestamp": 1694528170573}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות: אני לא התחברתי, מרגיש שהוא מגיע לא מוכן בעליל להרצאות אבל לא היו חלופות טובות\n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים: לא הכי נחמדה אבל מסבירה דיי טוב\n\nשעורי הבית: לא יותר מידי נוראים אבל לא מפרסמים פתרונות אז אין לך דרך לדעת אם צדקת או לא\n\nהמבחן: קשה\n\nהשורה התחתונה: לא מועבר יותר אז לא רלוונטי", "timestamp": 1705162614990}, {"author": "-", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דניאל רבייב\nחוות דעת - הרצאות:  מרצה מאוד מסודר, תמיד מגיע בזמן, יש לו חוברת שהוא הולך לפיה כמעט 1 ל 1. היינו קבוצה קטנה בכיתה - להפך מהשמועות - דניאל נחמד סך הכל ותמיד עוזר כשיש שאלות. גם מסביר די טוב ובאופן ברור. \n\nשם המתרגל/ת: ליטל שמן\nחוות דעת - תרגולים:  ליטל מאוד מסודרת ופקיאה בחומר ודייקנית. מבחינת יחס אישי, פחות. \n\nשעורי הבית:  הרגילים, מרופרנסים לרוב, וגם לפעמים אפשר לפתור בכמה דרכים (לא רק מה יש ברפרנס) וזה מתקבל. לא היה עמוס כלל. מאוד מומלץ לא להעתיק מרפרנס! אישית פתרתי לבד וזה מאוד עזר לי במהלך הסמסטר וגם התגמל טוב בבחינה!\n\nהמבחן: אישית עקבתי כל הסמסטר אחרי הקורס, הייתי בקצב, נכחתי בהרצאות וגם בתרגולים. היו קצת קיצוצים הסמסטר (2-3 משפטים והתעקות מביוס), מניחה שזה מקל. מועד א' היה כולו משוחזר, למרות זאת הממוצע היה ממש נמוך כך שנתנו 5 נקודות פקטור לציון הבחינה. אישית קיבלתי ציון די טוב (80, 85 אחרי פקטור ו-87 סופי) ולא הרגשתי כי טחנו בבדיקה - אם היית בכיוון וניסית ופיתחת דברים בכיוון הנכון, קיבלת הרבה מהציון, והתחשבו גם בטעויות נגררות. מה שכן צריך להיות על השאלות האמיריקאיות כי שם מתפספסים רוב הנקודות. \n\nהשורה התחתונה: מבינה שיכול להיות לחוץ, אבל לדעתי אפשרי אם הולכים עם הקצב לאורך הסמסטר ועושים עבודות בית בלי רפרנס.", "timestamp": 1713722187402}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: רבייב דניאל \nחוות דעת - הרצאות: לקחתי את הקורס פעמיים. פעם אחת בסמסטר רגיל של כמה מאות סטודנטים והיה מזעזע. לימד באולם מפוצץ עם אנשים על הרצפות ולא באמת היה אפשר להפיק משהו מזה. בסמסטר הבא היינו 10 בערך בכיתה אז הוא היה איטי יותר, ברור יותר וסבלני יותר לשאלות והיה יותר סביר\n\nשם המתרגל/ת: ליטל שמן \nחוות דעת - תרגולים: סביר. לא הכי נעים איתה אבל מעבירה את החומר יחסית ברור\n\nשעורי הבית: סבירים \n\nהמבחן: זוועות עולם. היה ממוצע 55 אז נתנו פקטור 5 נקודות. \n\nהשורה התחתונה: קורס זוועתי, היה הסיוט של חיי במשך שני סמסטרים אבל זה לא שיש ברירה אחרת", "timestamp": 1717224294624}]}