{"posts": [{"author": "אופטיקה", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: מעביר את הקורס בצורה מאוד שיטתית ומסודרת\n\nשם המתרגל/ת: מני מנשס\nחוות דעת - תרגולים: לא טובים\n\nשעורי הבית: לא תמיד קשורים לחומר אבל בסך הכל פתירים. \n\nהמבחן: לא היה\n\nהשורה התחתונה: זה לא הקורס בחירה הכי מרתק שאפשר לבחור אם אופטיקה זה לא הנושא שמעניין אותך.", "timestamp": 1609761520425}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אורן כהן\nחוות דעת - הרצאות: אורן מבולגן מאד, הוא טוב לדעתי בלהעביר חלק מהקונספטים ובחלק עושה ממש בלגן. בתור קורס בחירה הייתי צריך לעבוד קשה מאד כדי לשחזר כל צעד וכל כוונה שלו, עבדתי יותר קשה מקורסי 5 נקז שלקחתי הסמסטר (ולקחתי 3 כאלה). היה מתיש ומייגע.\nעם זאת, אורן כבן אדם וכמרצה מאד משתדל לעזור ושנצליח - פשוט שיטת ההוראה שלו ואיך שהוא מעביר את החומר ממש לא הייתה ברורה לי.\n\nשם המתרגל/ת: עמרי \nחוות דעת - תרגולים: תרגולים קצת מנומנמים, הוא ממש השתדל להוסיף לכל תרגול קונספטים מהחיים על דברים שאנחנו לומדים. היה מעניין\n\nשעורי הבית: נע בין קל מאד ללא פתיר.\n\nהמבחן: מבחן קשה ולא ברור. \n\nהשורה התחתונה: פחות", "timestamp": 1626173781280}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אורן כהן\nחוות דעת - הרצאות: מעניינות. מסביר טוב אם אתם עוקבים.\n\nשם המתרגל/ת: עמרי ונגרוביץ\nחוות דעת - תרגולים: סבירים, די טכניים.\n\nשעורי הבית:  ממוחזרים 100%.\n\nהמבחן: קשה. אצלנו היה גם בוחן אמצע שעזר לחזור על החומר. לא שזה עזר.\n\nהשורה התחתונה: קורס מעניין מאוד. יותר טוב מגלים.", "timestamp": 1626963413850}, {"author": "Arex", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: היה בסדר\n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: לא הייתי\n\nשעורי הבית: היו הגיוניים\n\nהמבחן: מבחן מגעיל על נושאים שבקושי למדנו\n\nהשורה התחתונה:", "timestamp": 1628336639632}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יואב\nחוות דעת - הרצאות: רץ מהר מדי על מושגים ״יבשים״. חוץ מזה ההרצאות די מגניבות למרות שהחומר קשה רצח\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: אפורים מאוד. לרוב לא קשורים להרצאות ומתי שכן אז הם קוראים לאותו דבר בשמות שונים או בהרצאות משתמשים בi ובתרגולים בj וכאלה. זה נשמע בקטנה אבל בסוף זה גורם למלא דברים להתערבב ומעמיס על הקושי של הקורס שגם ככה לא חסר לו\n\nשעורי הבית: 10 גיליונות של דם יזע ודמעות. ביום טוב אתה מצליח להבין מה עשו ברפרנס. רק בלמידה למבחן קלטתי שברפרנסים יש טעויות כי נהיה לי קצת שכל. בקיצור זוועה\n\nהמבחן: שחור. ב2016 2017 תסתכלו על הממוצע, המבחנים היו מתוך 110. גם מועד א שלנו היה רע\nהשורה התחתונה: הסגל מאוד אכפתי אבל הקורס שחור מאוד, יושב עליך יותר מכל קורס אחר בפקולטה כולל 1/2פ. אלוהים יודע איך אני זוכר את הקורס כחווייה חיובית, כנראה כי החומר ממש מעניין", "timestamp": 1657899443720}, {"author": "סטודנט כללי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: יואב מרצה טוב. מבין את החומר, יודע להסביר אותו בצורה ברורה ומאוד קשוב ומעודד שאלות של סטודנטים עליהן הוא עונה בצורה מכבדת ומובנת.\n\nשם המתרגל/ת:  גיא מושל\nחוות דעת - תרגולים:  התרגולים כתובים טוב אך ניכר היה שגיא התקשה להעבירם בצורה ברורה. פעמים רבות גיא מלמל את התרגול מול הלוח מבלי באמת להסביר אותו לסטודנטים. יכול להיות שגיא מבין טוב את החומר אך יכולת ההוראה הייתה נמוכה.\n\nשעורי הבית:  גיליון שבועי שדורש עבודה והשקעה. לעתים תרם להבנה של החומר ושל שיטות העבודה.\n\nהמבחן:  הוגן סך הכול.\n\nהשורה התחתונה:  קורס נחמד.", "timestamp": 1658652247173}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות:  מרצה מעולה, שולט בחומר ברמה מאוד גבוהה, ורואים שהוא מאוד אוהב את החומר ומעביר לנו מההתלהבות שלו. ההרצאות מאוד מסודרות וברורות. \n\nשם המתרגל/ת: גיא מושל\nחוות דעת - תרגולים: מבין את החומר טוב ואוהב לעזור לסטודנטים, כותב PDF מאוד מאוד מסודרים ומפורטים שממש עוזרים ללמוד מהם. התרגולים עברו בצורה מבולגנת יחסית ולא הכי ברורים אבל די השתפרו במהלך הסמסטר.\n\nשעורי הבית: גליונות שבועיים די ארוכים ומייגעים, להרבה מהם לא היה רפרנס ולקחו המון זמן.\n\nהמבחן: הפחד הגדול של כל קורס עם יואב....\nבאופן מאוד מפתיע היה הוגן מאוד \n\nהשורה התחתונה: קורס ממש ממש יפה למי שמתחבר לתחום מומלץ", "timestamp": 1658725400782}, {"author": "קאוסטיקה", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: פשוט משעמם. למרות הרושם, יואב מסביר מבולגן, החומר לא מובן ואיבדתי כל חמש דקות מחדש.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים:  גיא מסביר עם הכי סבלנות בעולם. לרוב הוא מסביר בדרך שהוא מבין, וזה לא תמיד הדרך שאתם מבינים, אבל יש לו מספיק סבלנות בשביל שאחרי חצי שעה תבינו למה הוא התכוון. \nבגדול גבר גבר\n\nשעורי הבית: עמוסים וארוכים, אבל יש רפרנסים להכול.\n\nהמבחן: מבחן לא מובן - לא ברור מה אמורים לחשב. בגדול בדיקה רחמנית אז הממוצע גבוה.\n\nהשורה התחתונה: אם לא חובה, אל תיקחו.", "timestamp": 1692184224365}, {"author": "אביאור מלסה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nיואב שגיא\nחוות דעת - הרצאות: \nמרצה מעולה. ההרצאות ממש מעניינות ומאוד מגוונות, מסבירות באופן ממש טוב ומפורט מלא תופעות של אור. יואב ממש מסודר, מפתח את הכל ברור מאוד ונותן מלא דוגמאות פרקטיות לנוסחאות ולקירובים שהוא מפתח מהיום יום או מעבודות מדעיות עדכניות. יואב גם עונה על שאלות בסבלנות ומרגיש שמאוד אכפת לו.\n\nשם המתרגל/ת: \nגיא מושל\nחוות דעת - תרגולים: \nגיא מתרגל טוב. יש לקורס תרגולים שהוא כתב בPDF שהם ברורים ומסודרים מאוד. התרגולים מנגישים טוב את ההרצאות ועוזרים לשיעורי בית והמבחן.\n\nשעורי הבית: \nגליון שבועי, אבל אפשר להגיש רק 8 גליונות כדי לקבל את כל המגן. השיעורים ארוכים וקשים יחסית, אבל מאוד מלמדים לקרת המבחן שדומה להם מאוד, אז שווה מאוד לעשות.\n\nהמבחן: \nסבבה לגמרי. המבחן דומה מאוד לשיעורי בית והתרגולים. מרגיש שלא צריך להמציא את הגלגל אלא פשוט להבין את החומר לקבל ציון טוב. בנוסף, אחת הבדיקות הכי מקלות שהיו לי בתואר, מרגיש שחפשו הבנה ובקושי הורידו על טעויות קטנות שלא משנות באמת.\n\nהשורה התחתונה: \nקורס מעולה, לדעתי אחד הטובים והמעניינים בפקולטה. החומר ממש מגוון וממש מסביר טוב מלא תופעות שרואים ביום יום של אור, מה שהופך את הקורס למאוד מעניין לדעתי. בפועל, זה הקורס היחיד שמסביר טוב באמת מה זה אור, זה קורס שמרגיש לי שהיה צריך להיות במומלצת ולא כקורס בחירה. בנוסף, זה קורס סופר פרקטי, כי הוא מדבר על אופטיקה באופן שמאוד עוזר ללכת ולעבוד בנושא בפועל, ולכל מעבדה ניסויית יש אלמטים אופטים לרוב.", "timestamp": 1703981523738}]}