{"posts": [{"author": "סטודנט כללי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: וינסנט דז'אק\nחוות דעת - הרצאות: הרצאות בסדר, החומר יכול להיות מורכב או אולי טיפה לא מובן (בעיקר כמובן בהתחלה). החומר וההרצאות היו מעניינות ומעשירות.\n\nשם המתרגל/ת: ברי גינת\nחוות דעת - תרגולים: מתרגל טוב, מסביר טוב וקשוב לשאלות של סטודנטים.\n\nשעורי הבית: שיעורי הבית מקנים מגן ובמהלך הסמסטר יש 6 גיליונות (בוחרים 5 הטובים ביותר). לא נוצר עומס משמעותי והשאלות משקפות ברמה טובה את הנדרש בקורס.\n\nהמבחן: הוגן ומעניין.\n\nהשורה התחתונה: קורס מעניין, נותן הרבה כלים ומשנה את צורת החשיבה לגבי חלק מהדברים שהכרת קודם.", "timestamp": 1615146659993}, {"author": "Itay Tal", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: וינסנט דז׳אק\nחוות דעת - הרצאות: \nמרצה מעולה, מאוד ברור, מסביר חומר טוב. כיף ללמוד.\nשעורי הבית: \nקשים, מומלץ לרפרנס בלי בושה את הפיתוחים האלגבריים לפחות.\nהמבחן: \nהיה הוגן. הקורס כולל הרבה נושאים, אז מבחן אחד של שלוש שאלות לא יכול לכסות את כולם, ולכן יש פקטור של מזל על מה נפלת.\nהשורה התחתונה: \nקורס יפה, מעניין, לא קל.", "timestamp": 1615747617144}, {"author": "_", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: וינסנט\nחוות דעת - הרצאות: \nוינסנט מרצה מאוד נחמד ומתחשב. צריך קצת להתרגל אל סגנון ההוראה שלו בהתחלה, אבל הוא מסביר את החומר בצורה טובה. \n\nשעורי הבית: קשים ממש וארוכים. מומלץ לנסות לפתור לבד, אבל יש שם פיתוחים ממש קשים מתמטיים אז זה בסדר גם לרפרנס חלק, רק חשוב להבין את הפיתוחים גם אם אתם לא מסוגלים לבצע אותם לבד, המיומנות לגמרי משתפרת עם הזמן. \n\nהמבחן: המבחנים של וינסנט יחסית ארוכים, אבל לרוב הוגנים. הבדיקה מאוד הוגנת ומתחשבת, אז תוודאו שאתם משקפים על הטופס שאתם מבינים את החומר בכל שאלה וסעיף, גם אם אתם מרגישים שלא הצלחתם את הסעיף. \n\nהשורה התחתונה: \nקורס לא קל, לפעמים מרגיש מוזר כי בעיקר לומדים ומתאמנים בהרבה כלים חדשים ובגישה חדשה לפיזיקה, ורואים מעט מאוד איך זה בפועל פוגש את המציאות ואיך משתמשים בכלים האלה. אבל אני מאמינה שזה משהו שמגיע בקורסי ההמשך. \nאבל יש גם נושאים ממש מעניינים, בעיקר לקראת סוף הקורס, והטכניקה שנראית בהתחלה מאוד מוזרה נהיית הרבה יותר נוחה לשימוש עם הזמן אז לא להתייאש :)\nחשוב להשקיע כל הסמסטר כדי שהחומר ישקע מספיק זמן לפני המבחן.", "timestamp": 1615798851546}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: וינסנט דג'אק\nחוות דעת - הרצאות: טיפה מבולגנות אבל בסך הכל טובות\n\nשם המתרגל/ת: משה-ישי כהן\nחוות דעת - תרגולים: מתרגל ממש טוב שניכר שמשקיע בסטודנטים מעל ומעבר\n\nשעורי הבית: קשים ביותר. יקחו הרבה מאוד זמן וגם אז סביר להניח שחלק יהיה צריך לרפרנס\n\nהמבחן: ברמה סבירה, קל בהרבה משיעורי הבית\n\nהשורה התחתונה: קורס מעניין בסך הכל אבל כזה שידרוש הרבה השקעה לכל אורך הסמסטר", "timestamp": 1615812473340}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: וינסנט דז'אק\nחוות דעת - הרצאות: טובות. עוקב כמעט מילה במילה אחר הרשימות שלו - ולעיתים ברשימות כתוב יותר בפירוט - מומלץ לעקוב אחר ההרצאות ולעבור טוב טוב על הפיתוחים שנעשים במהלך ההרצאה.\n\nשם המתרגל/ת: משה-ישי כהן\nחוות דעת - תרגולים: מתרגל מדהים, מאד רוצה בטובת הסטודנטים. מאד זמין במהלך הסמסטר ומשקיע מעל ומעבר למען הסטודנטים והצלחתם\n\nשעורי הבית: קשים אבל תורמים מאד להבנת החומר. לא לרפרנס - גם הפיתוחים המתמטיים תורמים בסופו של דבר להבנה. המבחן מתמטי מאד וככל שמתרגלים לכך יותר מוקדם בשיעורי בית יהיה יותר קל במבחן\n\nהמבחן: המבחן קל עם השקעה רציפה במהלך הסמסטר והשקעה בשיעורי בית\n\nהשורה התחתונה: קורס מדהים. הקורס שהכי אהבתי והתחברתי אליו במהלך הסמסטר - קונספטים חדשים בפיזיקה ומאד שונה מפיזיקה של שנה א.", "timestamp": 1616581188781}, {"author": "אא", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: קרן כנרת\nחוות דעת - הרצאות: מרצה מעולה לדעתי. לפעמים היא זורקת דברים הזויים שהיא מצפה שנבין על ההתחלה אבל היא סה\"כ מסבירה טוב את החומר ומעבירה אותו בצורה מעניינת.\n\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: חסר כריזמה, לא מסודר בעליל. בשלב מסוים פשוט הפסקתי ללכת לתרגולים בכלל אבל שמעתי המלצות על עומר.\n\nשעורי הבית: קשים מאוד אבל חשובים (תכלס כמו בכל קורס פיזיקה שלקחתי עד עכשיו). כדאי להשקיע בהם, אבל גם אל תפחדו לרפרנס אם אתם נתקעים כי הם לפעמים דוחפים פיתוחים הישר מהגיהנום, וגם כי הם לא בודקים את הגיליונות עצמם, ובמקום זה עושים בוחן קצר של 20 דקות בתחילת כל תרגול המבוסס על התרגיל בית. מבאס שמבזבזים זמן תרגול על הדבר הזה, אבל הבחנים לרוב סבבה לגמרי, וכל בוחן מקנה ציון מגן בנפרד.\n\nהמבחן: הרמה הייתה הוגנת לחלוטין (במיוחד בהשוואה לשיעורי בית), חוץ מסעיף אחד של 6 נקודות על נושא שבקושי עברנו עליו בהרצאה. המבחן כולו היה ממש ארוך (מלא סעיפים בכל שאלה), אבל בסוף פרגנו מאוד (!!) בבדיקה. סה\"כ החוויה הייתה טובה.\n\nהשורה התחתונה: קורס חשוב ומרתק. החומר נהיה מבלבל בצורה מוגזמת ככל שהסמסטר עובר (במיוחד בחלק של גוף קשיח) אז שימו יד על הדופק במהלך הסמסטר. כל עוד מבינים את החומר ומתרגלים קצת מבחנים אפשר להוציא ציון סבבה.", "timestamp": 1646304846894}, {"author": "Eilon Zohar", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: כנרת\nחוות דעת - הרצאות: חווייה מטלטלת. היא מרצה מצויינת אבל החומר לא פחות ממדע בדיוני\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: חיה. סופר מומלץ, בנוסף לדיס המלצות שקיבלתי על מתרגלים אחרים\n\nשעורי הבית: אמאלה\nשיעורי בית שבועיים עם שאלה אחת קלה ו2-3 מהשטן\n\nהמבחן: מדע בדיוני כרגיל, אבל הוגן. נראה בבדיקה שהם לא מצפים ממך לדעת פרפקט כי זה באמת קשה בקטע אחר. ממש מפרגנים בבדיקה.\n\nהשורה התחתונה: אפשר להוציא מעל 80 בכיף אם משקיעים במהלך הסמסטר. צריך להיות עם יד על הדופק כי הכול יכול להיות במבחן", "timestamp": 1647165930582}, {"author": "רונן", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nכנרת קרן\nחוות דעת - הרצאות: \nההרצאות היו לא טובות לטעמי. הועברו מתמטית מאוד ולא היו מעניינות או נתנו אינטואיציה בכלל. בנוסף כנרת גם מאוד מבולגנת. \nבאופן כללי כנרת עשתה המון שינויים בקורס הכניסה והוציאה נושאים מהקורס, רוב הנושאים החדשים שהיא הכניסה לא היו מובנים בכלל. \nיש הרצאות של יוסי אברון ביוטיוב שהיו דרך טובה להשלים את החסר בחלק מהדברים (ובמיוחד בגוף קשיח).\n\nשם המתרגל/ת: \nעומר גרנק\nחוות דעת - תרגולים: \nעומר מתרגל סבבה. הבעיה בתרגולים הייתה שכנרת הוסיפה בוחן בכל תרגול שהיה אמור לקחת 20 דקות בתאוריה. בפועל לקח כשעה. בגלל זה בכל אחד מהתרגולים לא סיימנו את כל התרגילים של התרגול בכיתה. זה היה גם גורף לכל 3 המתרגלים, ללא קשר לעומר.\nהבחנים גם הפכו את התרגולים לנוכחות חובה בפועל ולא נתנו לבוא למוקלט.\n\nשעורי הבית: \nבלתי פתירים, לא כהגזמה אלא כי תמיד היה חסר נתון או היה אינטגרל שאחר כך בפתרון הרשמי כתבו משהו בסגנון \"לאחר הכנסה לוולפראם התקבל...\". בקיצור לחכות כמה ימים למייל תיקון ורק אז להתחיל אחרת לא פתיר. \n\nהמבחן: \nבגלל שהחומר השתנה לגמרי הסמסטר, לא היה כל כך אפשר לדעת למה לצפות, ואכן המבחן היה נראה נראה שונה לגמרי מכל מבחן שהיה ב10 שנים האחרונות. בגלל הדבר הזה לדעתי, הבדיקה הייתה סופר מקלה אז זה די התאזן לממוצע סבבה.\n\nהשורה התחתונה: \nקורס מבולגן,  ושהועבר באופן אפור מאוד. השיעורי בית רעים מאוד. העניין של הבחנים מקווה מאוד שלא יחזור כי היה ממש מבאס וגם פגע בזמן הלימוד של התרגול.", "timestamp": 1647188530032}, {"author": "עמית קרן", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: הכל מתמטי, סוף סוף לא עושים דברים והנחות כמו ערסים. חיכיתי לזה מלא. כנרת משתדלת לתת גם אינטואיציה והדגמות מכבדות\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: אלון גידל אותנו עוד משנה א' עם התרגולים של 1פ' (שהיו סבירים). ובאנליטית היה פצצה רצח וממש ממש כיף. 9 במדד שלי.\n\nשעורי הבית:  \nגליונות מעניינים שמסבירים תופעות של הקורס, חלק מעניינים יותר חלק פחות. הכנה טובה לאלקטרו אני מניח.\n\n\nהמבחן: קשה אבל הוגן\n\nהשורה התחתונה: אלון אל תעזוב אותנו", "timestamp": 1674132100145}, {"author": "כרמל", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: כנרת\nחוות דעת - הרצאות: \nמת על כנרת, המרצה הכי טוב בפיזיקה עד עכשיו (היו רק שניים אז לא להתלהב יותר מדי, אבל היא טובה).\n\nשם המתרגל/ת:  שי קפון\nחוות דעת - תרגולים: \nאין על שי. המתרגלת הכי טובה בטכניון\n\nשעורי הבית: \nאעע מדי פעם בלתי פתירים ומדי פעם שאלות נורמליות. לא כדאי לרפרנס כי זה טוב למבחן.\nהמבחן: \nהיה קשה איכס, מה זה הדבר הזה שאומרים לנו לפתח את כל קפלר מחדש.\nהשורה התחתונה: \nקורס כיפי", "timestamp": 1676741284454}, {"author": "אחד שמבין", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: קרן כנרת\nחוות דעת - הרצאות: \nלטעמי לא טובות. מפתחים ומוכיחים כל דבר קטן ושולי גם אם זה לוקח מלא זמן ולא מוסיף הבנה חשובה. וזה בא בגדול על חשבון ההבנה וראיית התמונה השלמה של הנושאים.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nחלק מהתרגולים מרגישים כמו הרצאה על נושא מדעי מעניין וספציפי ולא באמת מתרגלים אותך בחומר התכלס. מספיקים מעט מאוד שאלות.\n\nשעורי הבית: \n\nחלק חשובים ומלמדים, וחלק, שוב, על נושאים שוליים ומתמטיים שלא שווה להשקיע עליהם דקה במהלך סמסטר עמוס.\n\nהמבחן: \nהיה קשה, אין מבחנים קלים, אבל לפחות אצלנו הוא בחן על פיסיקה ולא על דברים מוזרים.\n\nהשורה התחתונה: \nמעניין ללא ספק, ובגוף קשיח הופך להיות קשה לתפיסה, שווה לחפש מקור נוסף להבין ממנו את הנושא הזה.", "timestamp": 1676984061900}, {"author": "המילטון", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: כנרת\nחוות דעת - הרצאות: הרצאות קשות - מאוד מתמטיות, מוכיחים המון דברים בצורה ריגורוזית ולא מתאימה לפיזיקה.\nבשורה תחתונה כנרת כן מרצה טובה.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: אחלה מתרגל, אני חושב שהתרגולים לא בדיוק מביאים את השורות התחתונות הנכונות.\n\nשעורי הבית: קשים בטירוף, מאוד מתמטיים, מחייבים שעות קבלה.\n\nהמבחן: קשה בטירוף ובקפיצת רמה מכל מה שאי פעם ראינו הן בתרגולים והן בשיעורי בית.\n\nהשורה התחתונה: גוף קשיח - נושא שעוברים עליו בשבועיים האחרונים בקורס, מתורגל בצורה מאוד לקויה ובסוף במבחן דורש המון הבנה והמון תרגול - מאוד קשה בקיצור.", "timestamp": 1677453358962}, {"author": "מהנדס פשוט עם", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: כנרת\nחוות דעת - הרצאות: \nכמו שכתבו בחוות דעת ההרצאות מאוד מתמטיות ומתעכבות על כמעט כל פיפס. אישית דווקא אהבתי את זה, כי לדעתי זה בדיוק ההבדל בין קורס פיסיקה לפיסיקאים לקורס פיסיקה רגיל. אמורים לצלול יותר לפרטים של התיאוריה, ומה לעשות חייב לדעתי בסוף לעבור דרך כל השיקולים הכמותיים כדי להבין מה באמת קורה לעומק.\n\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: \nראיתי הקלטות מסמסטר חורף 2021. לדעתי ממש אחלה. מסביר ברור ובסבלנות.\n\nשעורי הבית: \nכמו שכתבתו, יש לא מעט גיליונות קשים. \nבדיעבד אחרי שהבנתי את החומר, הייתי אומר שבסוף אולי באמת סה\"כ היה במצטבר 1-2 מתוך 12 גליוינות עם שאלות ברמת קושי מחרידה.\n\nהשאר היה ברמה סבירה, וככל הנראה הקושי שכן היה לי באותו זמן היה עקב העובדה שהחומר עוד לא ישב לי בראש בצורה טובה.\n\nהמבחן: \nלא קל אבל לא משהו זוועתי. בסוף כן בדק על החומר. \n\nהשורה התחתונה: \nאישית אני לא מהמסלול של פיסיקה אלה חשמל טהור, אז לקחתי קורס זה כבחירה חופשית. מניח שאם אני הצלחתי להבין את החומר, אז בפרט כל אחד במסלול של פיסיקה יוכל להפנים את החומר ברמה לא רעה בהנתן מספיק השקעה וזמן.\n\nיש באמת כמה נושאים שלוקח זמן להבין לעומק לדעתי.  אישית לי לקח לא מעט מאמץ להבין גוף קשיח, בעיות פיזור ואולי תנודות קטנות. אבל ברגע שמבינים את הכל לעומק אז אפשר לראות את היופי בקורס.\n\nסה\"כ קורס נחמד ביותר אני חושב אם נותנים לו צ'אנס.", "timestamp": 1677742504830}, {"author": "Tamir Manoach", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: ההרצאות מעניינות אבל מאוד \"באוויר\".\nכנרת היא מרצה מעולה בשורה תחתונה, מאוד אנושית וחברותית.\n\nשם המתרגל/ת: עומר גרנק\nחוות דעת - תרגולים: מתרגל מעולה, התרגולים עוזרים לך להבין איך לפתור תרגילים.\n\nשעורי הבית: חלקם ממוחזרים, אבל לא כולם.\nלוקח זמן לפתור כל גיליון.\n\nהמבחן: קשה, אבל מה אפשר לצפות מפיסיקה.\n\nהשורה התחתונה: קורס סבבה, צריך להיות בפוקוס במיוחד בשבועות האחרונים", "timestamp": 1678260655519}, {"author": "וקטור לפלס רונגה לנץ", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: ההרצאות מעניינות, נותנות אינטואיציה שונה לגבי פיזיקה, עוברים מהשפה של התיכון לשפה שבה אפשר להתחיל לדבר על פיזיקה מתקדמת יותר.\nזה נראה מאוד מתמטי כי זה מאוד מתמטי- זה חשבון ווריאציות, בהתחלה קשה להבנה, אח\"כ מתרגלים, הקורס ברמה גבוהה ולפעמים קשה להבנה.\nכנרת מרצה טובה, נחמדה מאוד, הוגנת.\n\nשם המתרגל/ת: רן יעקובי\nחוות דעת - תרגולים: לדעתי רן המתרגל הטוב ביותר שהיה בקורס בסמסטר שבו לקחתי אותו, קודם כל הוא נחמד מאוד, מעבר לזה- הוא נותן הסברים טובים ויודע להגיד על פיתוחים \"טוב, זה אלגברה, נתקדם לחלק המעניין\" ואשכרה לעבור לחלק החשוב וכשצריך לעשות את האלגברה הוא עושה את האלגברה, רן מסביר את החומר טוב ונותן אינטואיציה טובה לדברים בקורס שהוא מאוד לא אינטואיטיבי.\n\nשעורי הבית: בסה\"כ קשים עד בלתי פתירים, ממוחזרים לרוב, ***חשובים מאוד*** ולכן מומלץ לא לרפרנס אותם עד כמה שניתן, למרות שלפעמים אי אפשר לפתור אותם, יש גם שאלות שהן סבירות ואף קלות, הרוב קשות, בייחוד בגיליונות מאוחרים יותר, לפעמים השאלות בלתי פתירות.\n\nלגבי הקורס עצמו והחומר:\nאין אינטואיציה מאחורי לגרנז'יאן- תוותרו על לחפש סיבה הגיונית לחסר את האנרגיה הפוטנציאלית מהקינטית, \nL=T-V\nוזהו.\nכשכנרת אומרת שהפעולה מינימלית הכוונה לערך של האינטגרל- לוקחים את הלגרנז'יאן, עושים עליו אינטגרל, קוראים לערך הזה פעולה, היא יוצאת מינימלית תחת תנאים מסוימים, מינמליות זה לא מינימליות של אורך המסלול או הזמן שלוקח לחלקיק לעשות אותו או של כל דבר אחר מלבד מינימום של ערך האינטגרל.\nכמו שאמרתי- זה מעניין, אבל זה לא אינטואיטיבי, לא את הכל צריך להבין, אין מאחורי זה היגיון או אינטואיציה, ואם יש- לא מלמדים אותו בקורס הזה כי הוא לא רלוונטי לקורס הזה.\n\nחשוב להתעכב על הנקודות המתמטיות בקורס כי זה קורס מתמטי של הפקולטה לפיזיקה- חשבון ווריאציות.\n\nהתמרות לג'נדר והתמרות קאנוניות- נושא קשה וקצת לא מובן, מומלץ לתרגל כמה וכמה פעמים, יכול להופיע במבחן ואפשר להרוויח נקודות רק מלהיות חדים על המתמטיקה שמאחורי.\nתנודות קטנות- תפתחו דברים לטיילור כשאומרים תנודות קטנות.\nכוח מרכזי ופיזור- וקטור לפלס רונגה לנץ הוא נושא לא מובן, חשוב לאחר כך.\nחשוב לתרגל פיזור וכוח מרכזי, יש הרבה דוגמאות לכוח מרכזי במבחני עבר, פיזור עוד יהיה.\nגוף קשיח- נושא קשוח, הנושא הכי קשה בקורס והכי קשה במבחן.\nמעבר לזה יש עוד נושאים, כולם יכולים להופיע במבחן, תשקיעו בקורס הזה כי \"הקורס הזה ילמד אתכם להפסיק לדבר בגוגו-גהגה ולהתחיל לדבר קצת כמו פיזיקאים\"\n\nהמבחן: \nקשה, יש מי שטוענים שמועד א שלנו היה לא הוגן, מומלץ לפתור את שאלת הסוכריה כי תמיד שאלת התנ\"ז במבחן היא הכי קשה וזאת שאלה קלאסית של תנ\"ז.\nהשורה התחתונה: \nקורס קשה, מעניין וחשוב, חובה לפיזיקאים, מומלץ למי שירצה להתעמק במכניקה ססטיסטית ו/או בקוונטים.", "timestamp": 1678925213683}, {"author": "אויילר את לגרנז", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  כנרת \nחוות דעת - הרצאות: \nמרצה טובה, אחת הטובות שהייתה עד כה בתואר. ברורה, חשוב לה שנבין את החומר והחומר באמת מעניין.\nמה שכן יש איזה קטע בקורס שמתחילים לדבר על קואורדינטות וזה פשוט לא נגמר - משהו כמו חודש שלם על השטות הזאת. אבל כנרת מלכה\n\nשם המתרגל/ת: שי קפון\nחוות דעת - תרגולים: \nיש כאלה שלא התחברו, אני אישית מאוד אהבתי. מסבירה טוב, ברגוע ויש אווירה טובה בתרגולים.\n\nשעורי הבית: \nלא כאלה קשים כמו שחלק כותבים פה. אני גם קראתי ביקורות לפני תחילת סמסטר וחששתי קצת אבל אל תרפרנסו הם באמת לא כאלה נוראיים וממש אפשריים (גם האינטגרלים בהתחלה). זה גם כל שבועיים להגשה ולא כל שבוע אז יש זמן \n\nהמבחן: \nמבחן מאוד הוגן. גם מועד ב היה מאוד הוגן. כנרת לא מהמרצים שמצפים שתלמדו חומר חדש תוך כדי המבחן או שתעשו דברים מטורפים, סך הכל באה לבדוק את רמת הידע ולכן השאלות מאוד הוגנות, דומות לרמה של הגיליונות וגם מזכירות מבחנים עבר\n\nהשורה התחתונה: \nקול", "timestamp": 1679907361799}, {"author": "yuval gur", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "אזהרה - הביקורת ארוכה כי אני שופך בה את יגוני על הקורס. החויה שלי היתה רעה, כידוע, לא כולם סבלו כל כך....\n\nשם המרצה: שלמה רזמט\nחוות דעת - הרצאות: שלמה בן-אדם טוב ומרצה מאוד מתחשב מכל בחינה. ההרצאות שלו היו לי קשות, כיוון שהוא לא רושם על הלוח, ומקפיד לפרט פיתוחים מתמטיים ארוכים.\nאם לרגע מאבדים אותו, קשה לחזור על הסוס... הנחמה - שהקליט את ההרצאות והעלה למודל.\n\nמשום מה התעקש לחפור עמוק בדקויות מתמטיות ובמשמעויות אלגבריות של הנושאים. לזכותו יאמר שבמבחן זה לא בא לידי ביטוי, אבל זה הפך את ההרצאות לקשות ואת הלמידה למבחן לחויה מלחיצה במיוחד.\n\nשם המתרגל/ת: יובל, ואז עלי ואז מיכל ואז רשימות...\nחוות דעת - תרגולים: כל המתרגלים של הקורס הזה - לא מוצלחים!! \n\nאצל יובל הייתי בשיעור הראשון, משום מה היה מפוצץ אצלה (אולי כי היתה מתרגלת ראשית) לא הבנתי מה אנשים התלהבו, היא לא העבירה את החומר בצורה קוהרנטית ונראה היה שבעצמה לא מתמצה בו.\n\nאחרי זה עברתי לעלי - הוא היה \"לא רע\", פעם ראשונה שהוא מתרגל לכן היו לו הרבה בלבולים בתרגילים, אבל הוא סך הכל הצליח לענות על שאלות בצורה מספקת. שמו אותו ביום חמישי, והצלחתי לכווץ את המערכת ביום ולכן נאלצתי לוותר עליו. המתרגל הכי \"סביר\" מבין המתרגלים שראיתי (גם בהקלטות)\n\nמיכל - פשוט לא עבד לי איתה. אני לא רוצה להשמיץ אותה, אבל מאוד לא נהנתי/ נתרמתי מהתרגולים שלה. הסבירה את החומר בצורה לא ברורה, רצה על תרגילים מהדף מתוך הנחה שכולם מבינים... סבלתי והשתעממתי מאוד ואחרי שני שיעורים התייאשתי.\n\nבסוף את החומר של התרגולים צרכתי ישירות מהרשימות, הן סבבה יחסית, חלק מהדוגמאות קצת מנוונות (מהבחינה שלא מלמדות הרבה) אבל זה היה עדיף על התרגולים בעיני.\n\nשעורי הבית: \nקצת מציקים, פתירים סך הכל. לא מאוד עמוס אלא אם אתם חופרים בהם לעומק ומנסים בכח לסבך דברים - לפעמים זה עובד, לפי ההתכתבויות בוואטסאפ (שדאגו להלחיץ כהוגן) זה לרוב לא עובד.\n\nהבעיה שלי עם שיעורי הבית, היתה שהם מתפרסמים ביום חמישי (אחרי התרגול האחרון) זה מעצבן!!! מכל הדברים זה מה שהכי השניא עלי את הקורס... טוחנים את התחת כדי לסיים את כל השיעורים עד רביעי בלילה בשביל סופש שקט ואז מפילים גליון... אותי אישית זה מאוד הרגיז ופיתח בי אנטגוניזם לקורס ולסגל...\n\nהמבחן: \nהוגן מאוד. הופתעתי שלא הכיל נושאים מתמטיים קקיוניים שאפילו הפיזמטיקאים לא למדו...\nאני מעז אפילו לומר - קל יותר מהמבחנים של כינרת.\n\nהשורה התחתונה: \nקורס מעצבן ומתיש... אבל חובה. הוא עורר בי הרבה חששות בנוגע לקורסי ההמשך ולפקולטה לפיזיקה בפרט... לא ראיתי בו את \"היופי והאלגנטיות הפיזיקלית\" שרבים מתיימרים לראות... יתכן בהחלט שהבעיה בי\n ¯\\_(ツ)_/¯", "timestamp": 1715793162294}, {"author": "בועז מונטיליה", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: אחלה מרצה! \nשם דגש מאוד מתמטי בקורס, לדעתי אפילו קצת יותר מדי, אבל בסך הכל מסביר טוב\n\nשם המתרגל/ת: מיכל שמש\nחוות דעת - תרגולים: מיכל רצה מהר אבל תמיד עוצרת להסביר אם צריך, מסבירה ממש טוב את החומר ושמה דגשים במקומות הנכונים\n\nשעורי הבית: מאוד טכניםם וחישוביים, הגליונות הכי מעצבנים שהיו לי עד כה\n\nהמבחן: הוגן, בחן את הידע הנדרש ולא באופן מוגזם\n\nהשורה התחתונה: קורס מעניין תיאורטית אבל משעמם פרקטית, אבל ידע חשוב לשאר התואר", "timestamp": 1715907519463}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: \nמדהים!! מסביר בבירור ובדיוק, יודע לענות על שאלות, ותמיד זמין לעזור. \nשם המתרגל/ת: אלון סטרוגצקי\nחוות דעת - תרגולים: \nמעולה! יודע את החומר טוב ומסביר אותו לעומק. הולך מעל ומעבר כדי שיבינו. עוזר מאוד בשעת הקבלה.\nשעורי הבית: \nקשים מאוד. עוזרים להכיר את החומר.\nהמבחן: \nהוגן. שום דבר שלא היה בהרצאה. היה קשה, אבל ישים לכולם.\nהשורה התחתונה: \nקורס שמנוהל מעולה!!", "timestamp": 1716201008052}, {"author": "reesh man", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: הקלטות של שלומו\nחוות דעת - הרצאות: בחור טוב סה״כ אבל לא הכי ברור העולם\n\nשם המתרגל/ת: הקלטות של יובל\nחוות דעת - תרגולים:  סה״כ סבבה, מסבירה סבבה\n\nשעורי הבית: \nסה״כ סבבה, קשים אבל פתירים אם רפרנס.\nהמבחן: \nסבבה סה״כ\nהשורה התחתונה: סה״כ סבבה, ציונים טובים", "timestamp": 1716306976187}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: \nמרצה מהטובים שהיו לי, עונה במייל על שאלות, הרצאות ברורות ולשם שינוי מראים את הפיתוחים. אכפת לו מאוד שהסטודנטים יבינו ורואים את זה.\nשם המתרגל/ת: יובל אבולעפיה ואז אלון סטורגצקי (נראלי שזה השם? לא זוכר איות)\nחוות דעת - תרגולים: יובל אחלה מתרגלת, עזבתי כי היה עמוס פיצוצים.\nאלון מתרגל ממש טוב גם, חשוב לו שיבינו ועונה על כל השאלות גם אלף פעם אם צריך. התרגולים מאוד עזרו להבין את החומר.\n\nשעורי הבית: עוזרים לפתח את הטכניקה של פתירת שאלות, חשובים. גם המטלות קריאה היו מעניינות וחשובות.\n\nהמבחן: הוגן, לא מתמטי מאוד וכן שם איזשהו דגש על להבין את החומר יותר מסתם לחשב, הבאסה היחידה זה שהם שינו את הנתונים של איזו שאלה משהו כמו 3 פעמים במהלך הבחינה (קורס קלאסי בפיזיקה...)\n\nהשורה התחתונה: קורס מעולה - הרבה דברים יפים וחשוב מאוד לשאר הקורסים", "timestamp": 1716313591413}, {"author": "לניה", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: \nכרגע המרצה הכי טוב שהיה לי בטכניון. מסביר בצורה טובה מאוד. מפרט לפעמים יותר מדי על מתמטיקה אבל קשוב למצב הסטודנטים. לא רושם מספיק על הלוח וזה הקשה קצת על הקורס. יש לו רשימות טובות ומפורטות באנגלית ואולי יש רשימות סטודנט בדרייב. שווה לבדוק.\n\nשם המתרגל/ת: יובל אבולעפיה\nחוות דעת - תרגולים: \nמתרגלת מעולה. ממליץ בחום. ראיתי בעיקר את ההקלטות שלה אבל בשעות קבלה היא הייתה ממש זמינה ופנוייה לעזור ולהסביר.\nשעורי הבית: \nלפעמים קשים לפעמים פחות. תורמים מאוד להבנה של החומר אז ההמלצה שלי היא לא לרפרנס אלא לשבור את הראש אם צריך.\nהמבחן: מועד א' היה לא פשוט אבל לא קשה בהגזמה. בעיקר לא היה ברור למה לכוון בלימוד לקראת המבחן כיוון ששלמה מעביר את הקורס בפעם הראשונה וההמלצות שלו בנושא היו לעשות בעיקר מבחנים של כנרת.\n\nהשורה התחתונה: קורס מדהים. טעימה ראשונה מעולם הפיזיקה שלא מוכר מהתיכון. נותן כלים ומבט חדש על הפיזיקה שבאתי ללמוד. שלמה שינה את הקורס לא מעט בכך שהכניס דגש על חבורות ועל המתמטיקות שמאחורי הלגראנג'יאן וההמילטוניאן, וזה מאוד לטובה כהכנה לקורסים המתקדמים יותר.", "timestamp": 1716363007941}, {"author": "ֶ;", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט \nחוות דעת - הרצאות: \nמרצה מעולה, מסביר מצויין את החומר אבל לפעמים מתפזר למתמטיקה קצת יותר מידי. לא כותב הרבה על הלוח אז צריכים להיות ממש חדים מבחינת קשב. \n\nאבל אין מרצה כמוהו, הכי טוב שהיה לי עד כה בטכניון. \n\nשם המתרגל/ת: יובל אבולעפיה \nחוות דעת - תרגולים: \nלא ראיתי מתרגלת שכל-כך אכפתית ורוצה בטובת הסטודנטים. מסבירה מצויין את החומר וזמינה תמיד לשאלות\n\nשעורי הבית: \nקשים אך פתירים, מכינים טוב לבחינה ועוזרים להבת החומר. \nעוזר מאוד לדבר עליהם עם חברים ובכך להעמיק את החומר. הם רמה או שתיים מעל הרמה של ההרצאה והתרגולים אבל זו באמת הכנה טובה להתמודדות עם שאלות בקושי כזה\n\nהמבחן: \nקשה אבל הוגן\n\nהשורה התחתונה: \nקורס מעניין מאוד עם צוות מהחלומות", "timestamp": 1716452605752}, {"author": "אנליטיקאי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: שלמה מרצה ממש טוב לדעתי (אולי הכי טוב שנתקלתי בו עד כה) - לא בהכרח כי הוא מאוד ברור (למרות שהוא כן ברור סך הכל ברגע שמתרגלים לקורס ולסגנון שלו), אלא כי הוא ממש אוהב את החומר וחשוב לו מאוד שנבין את החומר ושנבין אותו לעומק. ממש מרגישים את ההתלהבות של שלמה בהרצאות, וזה עושה חשק להגיע להרצאות ולהתעמק בחומר. שלמה עודד אותנו לשאול אותו שאלות כל הזמן (גם במיילים חופשי).\nלי היה קצת קשה עם ה\"מתמטיקה של פיזיקאים\" שקרתה בקורס אבל אני מניח שלומדים קצת לחיות עם זה ואם מתאמצים מספיק והולכים לשעות קבלה אז אפשר להבין מה קרה שם.\n\nהחומר עצמו די קשה והייתי צריך לשבת יחסית הרבה (הכי הרבה עד עכשיו בתואר) אחרי ההרצאות ולפענח מה קרה בהרצאה, אבל זה לגמרי אפשרי להבין והקורס הזה יושב על הנחות שמתוארות בצורה יחסית ברורה אז באמת אם משקיעים אפשר להבין.\n\nשם המתרגל/ת: אלון סטרוגצקי \nחוות דעת - תרגולים: מאוד נהניתי - יש אווירה טובה בתרגולים של אלון והוא די מצחיק אז בכלל נחמד. בסך הכל הוא יודע להסביר את מה שהוא עושה וגם עונה על שאלות כמו שצריך.\nהתרגולים מצד אחד היו מאוד מושקעים, עם מסמך שמפרט בדיוק את כל השאלות ופתרונות מלאים, אבל מצד שני לדעתי הרבה פעמים בתרגולים הייתה קפיצה עמוקה מדי לחומר כבד וקשוח ואז יצא הרבה פעמים בתרגולים שאיבדתי בשעה השנייה כבר את אלון. אחרי זה כשעברתי שוב על התרגולים לקראת המבחן אבל אז הצלחתי להבין באמת מה הלך שם וזה שהתרגולים היו כל כך מסודרים זה מאוד עזר.\nהתרגולים גם היו מאוד רלוונטים לפתרון השיעורי בית שזה טוב.\n\nשעורי הבית: די עמוס - משהו כמו 11 גליונות פתוחים שלוקחים איזה 4-8 שעות כל אחד, ובנוסף שתי מטלות קריאה שגם לוקחות אותו סדר גודל. מה שכן שיעורי בית רלוונטים ובאמת גליון אחד לכל נושא שלמדנו שזה טוב ללמידה.\n\nהמבחן: אני באופן אישי ציפיתי למבחן מאוד תאורטי וקשוח כי שלמה שם המון דגש על הבנה לאורך הקורס, אבל היה מבחן די סטנדרטי באנליטית ואפילו לתחושתי יותר קל מהמבחנים של שנים קודמות שיצא לי לפתור. בדיקה הוגנת לגמרי.\n\nהשורה התחתונה: מאוד נהניתי, מומלץ בחום. אחלה סגל (גם שאר המתרגלים היו מאוד טובים לפחות בשעות הקבלה) - מאוד השקיעו.", "timestamp": 1716491835605}, {"author": "יעקובי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מלמד מעולה!! יש לו רשימות באנגלית אבל יש סיכום של סטודנטית מהסמסטר, לדעתי הוא מסביר מעולה והיה לו חשוב שנבין והוא כל הזמן דאג לזה שאנחנו מבינים\n\nשם המתרגל/ת: אלון \nחוות דעת - תרגולים: אחלה, לא הייתי בכל התרגולים ראיתי חלק מההקלטות של יובל גם היא אחלה\n\nשעורי הבית: מאודדדד מאוד רלוונטים, הרגשתי שעזרו ממש במבחן\n\nהמבחן: ארוך ממש אבל בדקו מאוד הוגן וטוב\n\nהשורה התחתונה: אחלה סגל!", "timestamp": 1716983589448}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: \n\nמרצה מדהים, נהנתי כל רגע בקורס, קורס מרתק.\n\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: \n\nאחלה מתרגל, מסביר חומר טוב.\n\nשעורי הבית: \nבהתחלה נראים מפחיד, אבל לא קשים.\n\nהמבחן: \nקושי בינוני, אבל בדיקה מאוד נחמדה.\n\nהשורה התחתונה: \n\nוואו קורס מדהים, מאוד מומלץ (אבל קורס קשה)", "timestamp": 1717507434352}]}