{"posts": [{"author": "שם", "semester": "201902", "text": "סגל קורס מומלצים - חנה ועכאשה שניהם מדהימים וגם דניאל מלר (מתרגל) מצויין.\nהסדנה בפיסיקה 1מ ממש עוזרת להבנה ודרך גישה לשאלות ממבחנים.\nשעורי הבית קשים ולפעמים אין רפרנסים לכולם - במצב הזה כדאי להגיע לשעות קבלה של המתרגלים/פיזיקלי.\nדרך לימוד למבחן - כמה שיותר מבחנים משנים שעברו (של המרצה האחראי) - עדיף 7-9", "timestamp": 1597264200000}, {"author": "SR", "difficultyRank": 3, "generalRank": 3, "semester": "201702", "text": "שם המרצה: -\nחוות דעת - הרצאות: שני המרצים בסמסטר שלי היו לא משהו בכלל - ארי לאור ונתנאל לינדנר. במידה וזה המצב, ממליץ ללמוד מהווידאו של דדו בפיסיקה 1מ / מהווידאו של מוחמד עכאשה בפיסיקה 1ל. \n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: סה\"כ ערן מתרגל סבבה, למרות שאני אישית הרגשתי ששעה של תרגול בשבוע לא באמת יכולה לעזור להבין את החומר כמו שצריך.\n\nשעורי הבית: מרופרנסים כמעט 100% ולכן אפשר לסיים בכמה דקות, למרות שממליץ לפתור אותם לבד כדי באמת לעקוב אחרי החומר.\n\nהמבחן: מועד א' היה זוועה. מועד ב' גם היה די קשה, אבל היה זמן לחרוש אליו אז היה בסדר.\n\nהשורה התחתונה: קורס עם המון המון חומר, חשוב לעקוב אחריו במהלך הסמסטר. לצערי לפעמים זה קצת עניין של מזל על איזה מרצה נופלים - יש אחד שמבחינתו ממוצע 60 זה סבבה, ויש אחרים שמפקטרים לאזור ה-70.\nבסמסטר שלי הרגשתי שרמת ההוראה הייתה על הפנים, וזה מאוד הקשה ללמוד ולעכל את החומר.", "timestamp": 1597744948018}, {"author": "פיסיקה", "difficultyRank": 5, "generalRank": 2, "semester": "201901", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: לפי דעתי יש יותר התלהבות מעכאשה. כל ההרצאה הוא מפתח נוסחאות וזורק דוגמאות שלא באמת דומות למה שפוגשים במבחן או אפילו בשיעורי הבית. הרגיש שההרצאות מעט מיותרות כי אתה פותח את הגיליון וזה שמיים וארץ לעומת מה שעבר בהרצאה. קשה לקבל אינטואציה פיסיקלית, שמאוד חשובה, דרך ההרצאות. לפי חברים, אם חנה מלמדת, היא עדיפה.\n\nשם המתרגל/ת: ערן לוסטינג\nחוות דעת - תרגולים: התרגולים קצרים מידי. שעה של תרגול בשבוע, המתרגלים מספיקים תרגיל וחצי.\n\nשעורי הבית: כ-13 גיליונות שבועיים. מאוד מאתגרים. יש רפרנסים טובים כמעט להכל, אבל מומלץ לנסות לפתור לבד. מאוד חשוב להיות על החומר לאורך כל הסמסטר.\n\nהמבחן: מבחן אמריקאי שלא עושה חסד עם הקושי של הקורס. אפשר להצליח בגדול ואפשר ליפול בגדול. \n\nהשורה התחתונה: קורס מאוד קשה. קשה לקבל אינטואציה פיסיקלית מהצוות. מאוד ממליץ ללכת לסדנאות! הן מאוד עוזרות, והן בעצם השעתיים תרגול החסרות.", "timestamp": 1597773067705}, {"author": "דניאל", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מוחמד עאכשה\nחוות דעת - הרצאות: \nאחלה מרצה, אין תלונות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש גיליונות עם רפרנסים לכל הסעיפים, ויש כאלה שאין בכלל.\nהשאלות מאוד טכניות שדורשות חשיבה קצת מעבר. מומלץ לנסות לפתור הכל, כי השאלות מכילות טריקים של שאלות ממבחנים.\nהמבחן: \nמבחן אמריקאי עם 11 שאלות על רוב הנושאים בסילבוס. בשביל להצליח במבחן צריך לפתור כמה שיותר מועדי עבר,\nומומלץ לפתור את מבחני העבר עם דף נוסחאות ככה שתוכלו להתרגל אליו לפני המבחן.\nהשורה התחתונה: \nהחצי הראשון של הקורס דומה מאוד למכניקה שנלמדת בתיכון, והחצי השני הוא החלק הקשה של הקורס שדורש הבנה מלאה של הנושאים.", "timestamp": 1597829753512}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "201901", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה. הרבה הדגמות שנותנות אינטואיציה, עונה על שאלות בצורה מסודרת וברורה. יש לה רשימת הרצאות שהיא מפרסמת לפני כל הרצאה שמכיל את כל מערך השיעור שלה (לפעמים תרגילים נוספים שהיא לא מספיקה, שווה לעבור עליהם). \n\nשם המתרגל: עומר צור\nחוות דעת - תרגולים: מתרגל מעולה. מסביר את החומר בצורה ברורה. זמין לאחר השיעור לענות על שאלות. טוב מאוד בקבוצה קטנה. שעת תרגול לא מספיקה בכלל!!\n\nשעורי הבית: גיליונות שקל מאוד להתפתות לא לעשות אותם באופן עצמאי לחלוטין/לא לעשות אותם באופן עצמאי בכלל. לדבוק לעשות אותם ולהבין מה אתם עושים כי אם לא, זה לא שווה כלום. ללכת לשעות קבלה למתרגלים ולהבין דברים עד הסוף (מומלץ)\nלתרגל הרבה הרבה לפני המבחן מבחני עבר. לפעמים צריך תוך כדי סוף הסמסטר. אצלנו הוא היה ממש שלושה ימים אחרי סיום הסמסטר שכל הנושא האחרון (יחסות) בקושי התיישב טוב בקורס.  \n\nהמבחן: קשה יחסית. כמעט תמיד מפוקטר. (תלוי מרצה) מבחן אמריקאי של 12 שאלות. לפעמים אפשר לפסול תשובות לפי יחידות ואינטואיציה שזה נחמד. \n\nהשורה התחתונה: קורס קשה, חשוב להיות עליו למשך כל הסמסטר פחות או יותר. אם מצליחים תרגילי בית בסך הכול באופן עצמאי ומתרגלים הרבה, ניתן להוציא ציון טוב.", "timestamp": 1597862159146}, {"author": "י", "difficultyRank": 3, "generalRank": 3, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעכאשה- חמוד, אחלה מרצה, מסביר מעולה ומצחיק\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים לא לימדו אותי כלום, עדיף לראות את המוקלט.\nשעורי הבית: \nיש 13 גליונות במודל - הגשה אלקטרונית - יש רפרנסים להכל אז זה לא נורא. מומלץ לפתור לפני שמרפרנסים.\nהמבחן: \nאמרקאי - כמו הגרלת לוטו... \nהשורה התחתונה: \nקורס לא כיפי", "timestamp": 1598380761387}, {"author": "Tom", "difficultyRank": 3, "generalRank": 4, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nתרגולים לא תרמו יותר מדי. אפשר להסתדר בלעדיהם. רוב הלמידה מתבצעת בתקופת המבחנים\nשעורי הבית: \nמייצגים בצורה טובה בעיניי את השאלות במבחן. מי שמקפיד להבין את הפתרונות שלהם, יסתדר טוב יותר בתקופת המבחנים\n\nהמבחן: \nמי ששולט בחומר יסתדר. תמיד יהיו כמה שאלות קשות יותר ולא טריוויאליות. לכן זה גם עניין של מזל\n\nהשורה התחתונה: \nמי שמקפיד להבין את החומר תוך כדי הסמסטר, יסתדר טוב יותר בסוף. אחרת לנושאים יש נטייה להתערבב בסוף ולאסימונים אין זמן ליפול...", "timestamp": 1600852297937}, {"author": "..", "difficultyRank": 3, "generalRank": 3, "semester": "201903", "text": "שם המרצה: סעיד מחאג'נה\nחוות דעת - הרצאות: מרצה מעולה, מובן ומעניין! ממליץ בחום!\n\nשם המתרגל/ת: ינאי פלורסיים\nחוות דעת - תרגולים: התרגולים בקורס פשוט מיותרים, לא משקפים את הרמה הנדרשת בשום צורה, לא מלמדים כיצד לגשת לשאלות אמיתיות והם לגמרי בזבוז זמן. המתרגל חסר כריזמה ודי משעמם- הייתי ממליץ לא לבזבז את הזמן ופשוט לוותר מראש עליהם.\n\nשעורי הבית: לא קשים, חשובים ובהחלט מתרגלים טוב החומר- חשוב לעשות ולוודא שמבינים.\n\nהמבחן: מבחן אמריקאי מזעזע- גם אם השאלות נורמליות, מקפידים לתת בתשובות כל טעות חישוב אפשרית בדרך כך שיוצא שגם עם טעית- יצאת עם תחושה מעולה מהמבחן למרות שהאכזבה בציונים תהיה קשה. לא לזלזל, לשים לב לדקויות הקטנות- מבחן פשוט אכזרי.\n\nהשורה התחתונה: אחד הקורסים היותר מעניינים שלקחתי בתואר, לצערי אזכור ממנו רק את המבחן אכזרי.", "timestamp": 1601502445783}, {"author": "און פביאן", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: הכי טובות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש רפרנסים וגם לא כאלה קשים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1601890253667}, {"author": "ברקיסט", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נועם סוקר \nחוות דעת - הרצאות: \nהרצאות מעולות, מסביר את החומר בצורה מאוד ברורה. לפעמים מסביר קצת על נושאים לא רלוונטיים לקורס. \nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: \nתותח, מסביר את הכל בצורה מאוד ברורה. לפעמים השעת תרגול לא מספיקה\nשעורי הבית: \nיש רפרנסים לרוב הגדול, סה\"כ סבירים ותורמים ממש להבנה של החומר\n\nהמבחן: חרא של פורמט, אצלנו היה 10 אמריקאיות. צריך להיות חד על הנושאים ולשים לב להבדלים הקטנים בין התשובות. \n\nהשורה התחתונה: קורס יחסית מעניין, מבחן נורא ואיום", "timestamp": 1612133170392}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר חנה מרטיסקאינן\nחוות דעת - הרצאות: מדהימות. חנה מסבירה בצורה ברורה, לא משאירה אף אבן לא הפוכה ונותנת זמן לשאלות (עם זה שזה היה סמסטר קורונה ו350-450 אנשים בזום בכל הרצאה). מעבר להרצאות המעולות (שהיא העלתה בסמסטר קורונה את ההקלטות שעה לאחר סיום ההרצאה) היא מעניקה יחס אישי לכל סטודנט ומאפשרת לפנות ישירות אליה במייל לגבי שאלות מהרצאות, תרגולים ושיעורי בית. לקראת סוף הסימסטר צילמה עשרות סירטוני עזר לטובת הסטודנטים של פתרון שאלות מפתח בעיקר ממבחנים. שוב, אם חנה מרצה באותו סמסטר אין ספק אלא לבחור בהרצאות שלה, לא תתאכזבו.\n\nשם המתרגל/ת: מר אסף דרינגר\nחוות דעת - תרגולים: תרוגלים סבירים, רץ על החומר ולא משאיר יותר מדי זמן לשאול. כמו בקורסים אחרים רמת התרגילים בתרגול לא קרובה למבחנים ועדיף להתרכז בשיעורי בית ופתרון מבחנים משנים קודמות. שורה תחתונה על התרגולים - אפשר להסתדר בלעדיהם. \n\nשעורי הבית: יש שאלות מאתגרות יותר ויש כאלה שפחות. יש רפרנסים כמעט להכל (לגליון  האחרון רק אין). מי שעושה את שיעורי הבית במהלך הסמסטר וחד על החומר זוכה גם בציון טוב על שיעורי בית (10 אחוז מהציון הסופי) וגם מגיע מוכן יותר ללמידה למבחן. בהחלט שווה להשקיע בהם. \n\nהמבחן: בסמסטר הנ\"ל המרצה האחראי היה נועם סוקר. לא יצא לי ללמוד אצלו כי הייתי אצל חנה. אבל ההיכרות עם סוקר קרתה לקראת המבחן. הוא לא היה מרצה אחראי בקורס הרבה פעמים (שלוש או ארבע פעמים) ולכן לא היה הרבה מבחנים שלו לפתור לקראת הבחינה כדי להרגיש את הרמה. אבל בהחלט הבודדים שהיו שיקפו שהמבחנים שלו כמה רמות מעל המרצים האחרים. הוא מאוד אוהב שאלות \"הבנה\" שהכשילו רבים, מומלץ מאוד לפתור בחינות שלו אם הוא המרצה האחראי. המבחן היה בהתאם, מספר לא מבוטל של שאלות הבנה עם זאת שאר השאלות היו סבירות ומי שבקיא בחומר היה צריך לצלוח אותן. \n\nהשורה התחתונה: קורס די מעניין ואם המרצה טוב אז בכלל. המבחן מאוד תלוי במרצה, לפי ההתרשמות של פתירת מבחנים לפני הבחינה, רוב הבחינות סבירות והוגנות.", "timestamp": 1612189223898}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  פרופ. נועם סוקר\nחוות דעת - הרצאות: \nהסמסטר, ההרצאות שלו היו מוקלטות מראש.\nומי שרצה, אז בשעות ההרצאה שהיו אמורות להיות, יש שעת שאלות. מין מקרה פרטי של \"עאלק\" כיתה הפוכה.\nההרצאות שלו הן סבירות פלוס, הוא מרצה מאוד לא צפוי.\nהיו רגעים אף משעשעים. והיו הרבה רגעים שאתה בטוח שהבנת את החומר באופן מעולה.\nאבל, הוא מסביר הרבה הרבה יותר טוב בלייב מאשר בהקלטות.\nואחר כך כשאתה מגיע למבחנים שלו, אתה מגלה כמה ענק הפער, בין להבין את ההרצאות שלו, לבין להבין מה הוא רוצה ממך.\nולא, הפער הזה ממש לא מידתי.\n\nשם המתרגל/ת:  מר ערן לוסטיג\nחוות דעת - תרגולים: \nמתרגל פצץ.\nלא היה משהו ברור?\nיש רשימות מסודרות ומעודכנות, של בדיוק מה שכתב בתרגולים.\nהרשימות לא עוזרות? יש הקלטות, שבתוכן מסודרות לפני נקודות זמן, של התקדמות הנושאים בתרגול.\nמה שמאפשר מאוד לעבור שוב על החומר, בצורה מדוייקת, ולא מצריכה להקשיב לכל התרגול, ורק בנושאים שצריכים חזרה ספציפית.\n\nשעורי הבית: \nחלקם קשים, חלקם קלים מאוד ביחס לבחינה הסופית,\nמה שהם מהווים יותר חימום מאשר תרגול.\n\nהמבחן: \nהמבחן מאוד תלוי מרצה, היו הרבה מבחנים לאורך השנים שהיו הוגנים מאוד, ואף חלקם הוגנים בצורה מצויינת.\nמבחן הוגן, לא חייב ולא אומר, מבחן שלא בוחן באופן מקיף מאוד את רמת ההבנה של הנבחן.\n\nהמבחן של סוקר, היה בנוי גם עם שאלות, שנבנו כדי להכשיל,\nסטודנטים המבינים היטב את החומר, בפרט ובדגש בנושא השאלה.\n\nהשורה התחתונה: \nתבררו מי המרצה האחראי לפני.\nזה הבדלים מאוד משמעותיים.", "timestamp": 1612189913733}, {"author": "Amjad Shehadeh", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מרצה תותחית, מוכנה להשקיע מאוד בסטודנטים ולעזור להם להצצליח. עשתה שעות קבלה נוספות לא בלו״ז והקליטה סרטוני עזר פתרה בהן שאלות ממבחנים שסטודנטים רבים לא הסתדרו איתן.\n\nשם המתרגל/ת: סשה  \nחוות דעת - תרגולים: מתרגלת יפה.\n\nשעורי הבית: 13 ש״ב מחשבים את ה 10 הכי טובים (עשו פעם את ה9 הכי טובים) גליון אחד כל שבוע במודל, כל גליון עם 3 נסיונים והציון הכי גבוה הוא נחשב. קצת מעמיס: ממליץ לעשות אותם הכי מוקדם שאפשר.\n\nהמבחן: אמריקאי: 11-14 שאלה כל שאלה 6 תשובות ואחת נכונה.\nבחורף 2020 היה 10 שאלות עם 11-12 תשובות כל אחד. פעם ראשונה עושים את זה, לא יודעים אם ישנו את זה. \nצריך להיות זהירים כי התשובות ממש קרובות וכמעט כולם מכסים את כל הטעיות שאפשר לעשות אותם. קצת מקשים את זה לפעמים. יש פערים בין רמות המבחנים. \nונותנים פקטור בהתאם.", "timestamp": 1612249327884}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nחנה מרצה מעולה, מסבירה טוב, עונה על שאלות והחלק הכי טוב הוא שהיא מפרסמת את הסיכומי הרצאות שלה לפני ההרצאה ולרוב הם אחד לאחד מה שהיא מעבירה וקל יותר לעקוב ככה. גם נועם מרצה מעולה ואולי קצת יותר מעניין אך פחות מסודר.\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: \nערן ממש אחלה הבעיה שהתרגולים קצת קצרים ולכן אין זמן לשאלות או להתכב יותר מדיי על הדברים ולכן לפעמים קשה להבין בזמן התרגול, כדאי לבוא מוכנים ולעבור לפני על החומר למרות שהוא גם מזכיר בתחילת התרגול את הנוסחאות שלמדנו בהרצאה. \nשעורי הבית: \nהגליונות לא מאוד ארוכים אבל לא פשוטים בעיני. גזלו לי יותר שעות ממה שציפיתי אם רוצים באמת להבין לעומק. יש רפרנסים כמעט להכל שזה עוזר, אבל רצוי מאוד להבין את שיעורי הבית וגם לנסות לבד לפני שרצים לרפרנס כי אחרת לא מבינים איך באמת להשתמש במה שנלמד.\nהמבחן: \nהיה יחסית הוגן אבל לא קל. המבחנים לא קלים ודורשים לתרגל די הרבה. מומלץ להתחיל לתרגל כמה שיותר מוקדם ולראות כמה שיותר שאלות כדי לקלוט את הדרך פעולה בכל נושא. אם אפשר כבר במהלך הסמסטר להתחיל לראות שאלות ממבחנים על כל נושא שנלמד (אני לא עשיתי את זה אבל היה בהחלט יכול לעזור מאוד).\nהשורה התחתונה: קורס לא פשוט אבל הסגל מעולה, הם ממש באים לקראת, עשו מלא שעות קבלה לפני המבחן ובכלל קובעים עם כל מי שרוצה גם אחד על אחד, מפרסמים חומר עזר נוסף וסרטוני פתירת תרגילים שביקשו מהם. ממש אחלה סגל עושים את כל המאמץ שנצליח, רק צריך לתרגל הרבה ולהיות חדים על הנושאים כי זה לא משהו שבא לכולם בקלות.", "timestamp": 1612255585410}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה! \nהשקיעה המון במענה על שאלות סטודנטים בזמן הסמסטר ולפני המבחן. מפרסמת את הרשימות כך שיש סיכום עדכני של ההרצאות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים נותנים כיוון כללי לפתרון שיעורי הבית אך לא מספיק מקיפים\nשעורי הבית: לא קשים וממוחזרים\n\nהמבחן: מבחן אמריקאי של 10 שאלות, הוגן, דומה למבחני עבר היו שאלות הבנה לא קלות.\n\nהשורה התחתונה: מרצים מעולים רצוי להבין טוב את שיעורי הבית ולפתור מבחנים כמה שיותר מוקדם עוד במהלך הסמסטר ציון גבוה אפשרי לחלוטין", "timestamp": 1612288580659}, {"author": "tj2021", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר חנה מרטיסקאינן\nחוות דעת - הרצאות: \nההרצאות היו ברורות וקוהרנטיות, היינו בערך 500 תלמידים בכל שיעור זום. למרות שרוב הזמן היינו על השתק השיעורים היו מעניינים ומגוונים. היו הרבה יחסית ניסויים והזדמנות לשאול שאלות בהפסקות ובצאט (כןכן, היא עקבה אחריי הצאט והגיבה)\nחוץ מזה חנה העלתה רשימות הרצאה מפורטות לפניי כל הרצאה מה שעשה פלאים להבנה שלי את החומר וללמידה שלי.\nהאפשרות השנייה הסמסטר הייתה הרצאות מוקלטות של נועם סוקר - ניסיתי לראות אותן ולא הייתי ממליץ, מסובך ומלחיץ. \n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: \nהתרגולים רלוונטיים מאוד להבנה של החומר אי אפשר לפתור שיעורי בית/ מבחנים בלעדיהם. \nמתרגל פצצה. יודע את החומר שולט בו, אווירה מעולה בשיעורים, מעלה את כל הרשימות המסודרות ומוסיף אקסטרה סרטוני הסבר והצעות לתרגילים נוספים. מעולה.\n\nשעורי הבית: \nגליונות שהם 10% מהציון, אמריקאי במודל, יש רפרנסים אם יודעים איפה לחפש. סך הכל רלוונטיים וטובים. \n\nהמבחן: \nמבחן אמריקאי עם רמה שמשתנה מאוד בין שנים ובין מרצים. \nממליץ אם יש בחירה לא לקחת בשנה שסוקר מרצה אחראי, המבחנים שלו עם ממוצע נמוך משמעותית. \n\nהשורה התחתונה: \nקורס חובה, אבל נהנתי. כמו כל סטודנט הייתי שמח למבחן עם ציון גבוהה יותר אבל אני מרגיש שלמדתי והבנתי את החומר של הקורס ברמה טובה. \nמבחינת עומס במהלך הסמסטר הוא כנראה היה הקורס שדרש ממני הכי הרבה מאמץ .", "timestamp": 1612299663175}, {"author": "DM", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: כל עוד הוא מרצה אחראי, תברחו. אם יש לכם אופציה לראות סרטונים של חנה(היא מדהימה!) אז תראו, או תקנו GOOL. ברוב ההרצאות של נועם הוא מתפזר, מאוד קשה להבין אותו. המבחנים שלו אכזריים והוא דואג לממוצע של 65 בניגוד למקבילו עכאשה.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: אחלה תרגולים, מעט איטי.\n\nשעורי הבית: \nגיליון פעם בשבוע, לפעמים יש שאלות מונפצות, כמעט להכל יש רפרנס.\nהמבחן: \nתלוש מהמציאות, אין שום קשר בין מה שמלמדים ברהצאות ובתרגולים לתרגילים שמופיעים בבחינות. תריגלים ברמת קושי מטורפת. \nהשורה התחתונה: תקנו GOOL, תלמדו את הקורס לבד ומהר ותחילו להריץ מבחנים כמה שיותר מהר.", "timestamp": 1612337263998}, {"author": "Dinoman", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעניינות\n\nשעורי הבית: רפרנסים\n\nהמבחן: קשוח למות\n\nהשורה התחתונה: לחרוש ולהתפלל לפקטור. לא לעשות כשסוקר אחראי\nבאסה שחובה", "timestamp": 1612381440889}, {"author": "أسير الأحزان", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אני לא אגיד עוד יותר חוץ מאם אתם יכולים לברוח מהקורס כאשר נועם סוקר הוא מרצה אחראי, תברחו, המבחן היה 10 שאלות רב ברירה, כל שאלה עם 12 תשובות שונות רק בכמה מספרים אחרי הנקודה.\nלחלוטין לא היה מבחן של האם אתה מבין ושולט בחומר או לא, אלא היה מבחן של להכשיל ולהטעות סטודנטים ככל האפשר.\nתפתור שאלה באופן נכון ומסודר עד הסוף אבל מספיק לך לטעות בהצבה למחשבון וזהו אתה מקבל אפס על כל השאלה,(בניגוד למבחן עם שאלות פתוחות במקרה כזה הייתה מקבל את רוב הציון). זה או שאתה מצטיין או שאתה הולך למועד ב או חוזר על הקורס, אין מקום ביניים.", "timestamp": 1612520292114}, {"author": "SD", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נועם סוקר  \nחוות דעת - הרצאות: משעממות \n\nשעורי הבית: לא רלוונטי למבחן\n\nהמבחן: לא פתיר \n\nהשורה התחתונה: תברחו מהקורס אם סוקר מרצה אחראי או מרצה שני כי תקבלו מבחן רחוק שנות אור מהמיצאות :)", "timestamp": 1612703695235}, {"author": "dana", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nהרשימות שלה מעולות\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מעולה, מסבירה טוב", "timestamp": 1612790897721}, {"author": "andre", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דר.חנה מרטיסקאינוו\nחוות דעת - הרצאות: \nמרצה מעולה, ההצאות שלה מעניינות ביותר כמו כן היא הכי אוהבת לעזור אפילו עשתה לנו סרטונים מוקלטים של תרגילים שהיא פותרת חוזר ואומר מעולה!\n\nשם המתרגל/ת: ערא לוסטיג\nחוות דעת - תרגולים:\nתרגולי הפיזיקה הם שעה ומאוד עמוסים אבל ערן מתרגל טוב \n\nשעורי הבית: \nעוזרים להבנה\nהמבחן: \nמועד א לפי דעתי היה קשה מהרגיל\nהשורה התחתונה:", "timestamp": 1612803029076}, {"author": "Adam Katav", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nחנה תותחית! מומלצת ביותר!", "timestamp": 1613890381036}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מדהימה!!! מסבירה הכל בצורה מובנת ומסודרת. אכפתית מאוד כלפי הסטודנטים ועוזרת במה שהיא יכולה. ממליץ ללכת רק אליה!\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: אחלה לגמרי. עוזר לעשות סדר בראש עם החומר מההרצאות. יש רק שעה אחת בשבוע שלא כל כך מספיקים בה יותר מדי.\n\nשעורי הבית: לא ארוכים במיוחד וחשוב לעשות אותם כדי לתרגל ולהבין את החומר. יש רפרנסים כמעט להכל.\n\nהמבחן: לא קל בכלל, הכל אמריקאי ומרגיש קצת כמו הגרלת לוטו. יש פקטור ככה שזה לא באמת משנה, בסוף מסיימים עם ציון סביר.\n\nהשורה התחתונה: קורס נחמד, קצת מעיק לפעמים", "timestamp": 1614190913438}, {"author": ".geniues-N.G", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: בהחלט מרצה שלא רואים כל יום, פשוט תענוג ללמוד ממנה. מקצועית ברמות, תענוג ללכת לשעות קבלה שלה באמת פשוט כיף לשמוע את ההסברים שלה.\n\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: תותח אמיתי - יודע להסביר את הדקויות הכי קטנות וחשובות, מקצועי מאוד.\n\nשעורי הבית: עוזרים המון להבנה של החומר, דורשים המון השקעה.\nהסדנאות לדעתי לא כל כך מועילות\n\nהמבחן: קשה באופן מוגזם ולא כל כך הוגן ביחס למה שנלמד במהלך הסמסטר\n\nהשורה התחתונה: אחד הקורסים המעניינים שיש בתואר.", "timestamp": 1614196337845}, {"author": "Elad Kay", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: סה״כ נדמה שהוא יודע את החומר אבל בהרצאות המוקלטות שהוא פרסם במקום להרצות בלייב הייתה לו נטייה להציג פיתוחים מתמטיים ארוכים, לא מוסברים וחסרי תועלת, ולא להגיד לפני מה בעצם אנחנו מפתחים. הקשה על להבין מה באמת צריך לדעת.\n\nשם המתרגל/ת: סשה (אלכסנדרה) בקמן\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: גיליון כל שבוע, לא סופר קשה, אפשר למחזר\n\nהמבחן: לא לעשות מבחנים של נועם סוקר. ממוצע נמוך ופקטור לא מספיק\n\nהשורה התחתונה: כנראה שאין לכם בחירה, אבל הייתי מחכה שעכאשה יחזור", "timestamp": 1614858264604}, {"author": "Be'Ilum Shem", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות:  \nההרצאות המוקלטות של נועם לטעמי לא היו מספיק ברורות ואיכותיות, לעומת זאת של חנה היו יחסית טובות למרות שמדובר בהקלטה בזום, באופן כללי אני חושב שיכלו להקליט סרטונים איכותיים עם הסברים טובים ולא להידבק לפורמט של כיתה ולוח, אלא להתקדם למשהו ברוח התקופה, אבל זה לא ייחודי רק לפיזיקה, פשוט בפיזיקה ובמיוחדת במכניקה הדגמות ויזואליות מאוד עוזרות להבנה.\n\nשם המתרגל/ת: ---\nחוות דעת - תרגולים: ---\n\nשעורי הבית: לא קלים אבל להכל יש רפרנסים- תודה לאל.\n\nהמבחן: ממוצע כללי 57(בקורס) במבחן ככל הנראה 40 (כי 40 זה הציון שצריך כדי לעבור את הקורס עם 10 אחוז מגן(ציון ש\"ב תקף)), אחד הנמוכים בשנים האחרונות אם לא בעשור.\n\nהשורה התחתונה: החומר מעניין - טעימה מכל נושא. יותר מאחד מכל 4 נכשלו במבחן, ממוצע בתחתונים. מקווה שסמסטר הבא עם חנה אחראית וגידי מרצה יראה טוב יותר.", "timestamp": 1614883560115}, {"author": "איתי", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה ונועם\nחוות דעת - הרצאות: \nחנה מאוד נחמדה, היא מוכנה לענות על שאלות בשעות קבלה בשיא הסבלנות והאכפתיות. לנועם שאפו לפני המועד ב' הוא פשוט עשה כל יום שעת קבלה, כל יום. שאפו.\n\nהחומר של הקורס תיכוני. פשוט ככה. שבועות ראשונים חוזרים איתנו על ווקטורים ואחר כך קינימטיקה ואולי נושא מורכב בודד זה תנע זוויתי כי לא מלמדים את זה בתיכון.\n\nהקושי בקורס הזה הוא שהתרגילים במבחנים הם מכשילים, נישתיים, מתבססים על טריקים. אתם רוצים להוציא ציון טוב פשוט תטחנו מבחנים ותשננו את כל הטריקים האפשרים ואז תוכלו להוציא ציון טוב (כמו הרבה קורסים במוסד שלנו  - לא בהכרח משקף באמת הבנה עמוקה)\n\nהמבחן היה פשוט מצחיק, כאילו כל כך סוריאליסטי ואבסורדי מכיוון שלעבור אותו היה נס. אין מה לעשות נועם רוצה/צריך/תחביב שלו להכשיל אנשים ולהשאיר ממוצע נמוך. אולי כי זו הנחיה מלמעלה לעשות את פיסיקה 1מ' כקורס ניפוי למסלולים מסויימים (אולי זו הסיבה למה הוא מלמד תמיד סמסטר חורף). בכל מקרה לא ביג דיל, חוזרים על הקורס באביב ונותנים בראש עם חנה שככל הנראה תהייה הוגנת ולא תתגאה בזה שהממוצע שלה נמוך ושצריך לירוק דם כדי לעבור.\n\n\n\nשם המתרגל/ת:\n\nערן לוסטינג \n\nחוות דעת - תרגולים: \n\nאולי המתרגל הכי טוב שהיה לי הסמסטר. כל כך יעיל עם זמנים מצליח לדחוס בשעה בודדת כל כך הרבה עקרונות חשובים ומפרק איך ניגשים ועונים לשאלות בצורה כל כך בהירה וטובה. 10/10 אני לא צריך יותר מזה.\n\n\nשעורי הבית: \n\nדי סבבה, יש בדרך כלל שאלה אחת שהיא ממש קשה ואליה אפשר לנסות לשבור את הראש או פשוט לרפרנס (בנינו אפשר לסיים את הש\"ב באיזה שלוש שעות נגיד)\n\nהמבחן: \n\nאבסורד, שפל היסטורי של ממוצע. יש מוקשים בתואר שאנחנו עושים והקורס הזה הוא אחד כזה. על תתדרכו עליו עם החיים שלכם תלויים בזה.\n\nהשורה התחתונה:", "timestamp": 1615158718335}, {"author": "ruben fitoussi", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: קשה מאוד\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית: 100\n\nהמבחן: \n\nהשורה התחתונה: קורס קשה", "timestamp": 1615193888900}, {"author": "Avi Cohen", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד״ר חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מדהימה וחברותית, מלמדת את החומר באהבה למקצוע ולסטודנטים, פשוט כיף בכל רגע בהרצאות שלה. היא מפרסמת את הרשימות שלה ופתרונות לתרגילים ממבחנים וזה מאוד מאוד עוזר!\n\nשם המתרגל/ת: ד״ר סשה (אלכסנדרה) בקמן\nחוות דעת - תרגולים: תרגולים קצרים מדי ולא מספיקים, אבל סשה אחלה מתרגלת והיא מסבירה טוב ודואגת שכולם הבינו לפני שהיא ממשיכה.\n\nשעורי הבית: חייב חייב חייב לעשות בלי לרפרנס מדי, המבחן קשה...\n\nהמבחן: תתרחקו מהקורס כשנועם סוקר מרצה אחראי, המבחנים שלו מאוד מאוד מאוד קשים..... ממוצע 57 עם פקטור... תלמדו ממבחני עבר לפתור כמה שיותר!\n\nהשורה התחתונה: קורס קשה מאוד עם לא מספיק תרגולים, אבל זה מה יש.", "timestamp": 1615906546503}, {"author": "א.ק.", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה, העלתה את רשימות ההרצאה שלה לפני כל הרצאה ומומלץ לעבור עליהן לפני בשביל להתכונן לקראת ההרצאה.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: טובים מאוד, שעת תרגול אחת לא מספיקה.\n\nשעורי הבית: פעם בשבוע עם ציון תקף בקורס, לפעמים הם קשים וארוכים, אבל יכולים להיות חשובים בהבנה ובתרגול של החומר. יש רפרנסים להכל, אבל עדיף לנסות לפתור לבד לפחות חלק מכל נושא.\n\nהמבחן: סיוט. מבחן אמריקאי עם 8-14 אפשרויות בכל שאלה, קשה מאוד ורחוק מאוד ממה שלמדנו בהרצאות. המבחן היה ככה בגלל הקורונה, בדרך כלל לא עד כדי כך.\n\nהשורה התחתונה: קורס חובה, אין ברירה.\nאם יש לכם אפשרות בחירה, אל תעשו בסמסטר שבו נועם סוקר המרצה האחראי, הממוצע של המבחנים בשנים שלו מזעזע, וזה לא אכפת לו.", "timestamp": 1615994302292}, {"author": "עמית", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מסבירה את החומר בצורה ברורה.\n\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: זמן התרגולים לא תואם לקורס. שעה בשבוע לא מספיקה.\n\nשעורי הבית: קשים.\n\nהמבחן: לא מייצג את הבנת החומר.\n\nהשורה התחתונה: הקורס מעניין, המבחן גורר אכזבה.", "timestamp": 1616011619415}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מושלמת בהגזמה. מפשטת ומסבירה ומעבירה את החומר בצורה מובנת ומהממת.\n\nשם המתרגל/ת: ערן לוסטינג\nחוות דעת - תרגולים: התותח שבתותחים וכל מילה נוספת מיותרת. הבחור אגדה בעיניי. \n\nשעורי הבית: קל ממש לרפרנס. רצוי שלא כי זה ממש תורם לפתור לבד.\n\nהמבחן: המבחן כלל הרבה שאלות הבנה עם גרפים ( המרצה האחראי היה נועם סוקר ). חשובבבב לעבור על כל המבחנים של המרצה האחראי של הקורס שלכם ולראות מה הסגנון שאלות שהוא אוהב ולהתכונן בהתאם.\n\nהשורה התחתונה: קורס סבבי.", "timestamp": 1616024580998}, {"author": "Ofir Gur", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: ההרצאות מוקלטות, הבנתי כמעט הכל ישירות משם, ממליץ.\n\nשם המתרגל/ת: ???\nחוות דעת - תרגולים: לא הגעתי לתרגולים, קראתי סיכומים כתובים של התרגולים, היו ברורים.\n\nשעורי הבית: 13 תרגילי בית 10 הטובים ביותר הם מגן, השיעורים קצת טריקים אבל לא עמוסים יותר מידי.\n\nהמבחן: מבחן טריקי אבל אפשרי\n\nהשורה התחתונה: קורס נחמד, כדאי לעקוב במהלך הסמסטר על מה קורה ולהגיש תרגילי בית", "timestamp": 1616262472236}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות:\nמרצה מצוינת, איכפתית ומעבירה את החומר באופן מעולה, אפילו דרך הזום. התחלתי מההרצאות של נועם ועברתי כי יותר התחברתי לדרך שהיא מעבירה.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: \nמתרגל מסודר מאוד, יש סיכומי תרגול לכל התרגולים העתידיים כבר מהיום הראשון של הסמסטר. החומר עובר באופן ברור ויש זמן לשאול שאלות כמשהו לא מובן.\n\nשעורי הבית: תרגילים במודל, צריך להזין תשובה סופית בלבד (בדומה למבחן). נפתח גיליון כזה כל שבוע, לוקח חצי יום לסיים את הגיליון. \n\nהמבחן: אמריקאי עם תשובות סופיות בלבד, חלק מהשאלות הן הבנה וחלק של חישוב. בסמסטר הנוכחי נועם סוקר היה המרצה האחראי והשאלות היו בעיקר קשות פיזיקלית ופחות מתמטית. \n\nהשורה התחתונה: קורס קשה, מומלץ לפתוח מבחן שניים בשבועות הראשונים של הסמסטר כדי להבין מה מצופה מכם בסופו של דבר מהקורס.", "timestamp": 1616340529277}, {"author": "מירמורי", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מסבירה מעולה\n\nשם המתרגל/ת: אמוץ\nחוות דעת - תרגולים: מסביר מעולה\n\nשעורי הבית: מעיקים\n\nהמבחן: לא פרופורציונלי בשום צורה לחומר של הקורס , נבחנו בגדול על 20% מהחומר\n\nהשורה התחתונה: קורס פיזיקה הראשוןן שיצא לי לראות שמתנהל בצורה נורמלית , אבל קילקלו במבחנים", "timestamp": 1616362061261}, {"author": "amitbs77777", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ד\"ר חנה מרקסיאן\nחוות דעת - הרצאות: מעניינות, הרבה חומר במעט זמן\n\nשם המתרגל/ת: ד\"ר סשה בקמן\nחוות דעת - תרגולים: פרקטיים ועוזרים להבנת החומר\n\nשעורי הבית: עמוסים ולא תמיד מקבילים לנלמד בהרצאות\n\nהמבחן: תלוי מאוד במרצה האחראי \n\nהשורה התחתונה: קורס עמוס יחסית ל3.5 נק\"ז", "timestamp": 1626003068992}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמרצה מעולה, יסודית, מסודרת ויורדת לשורש העניין. יודעת להסביר דברים מורכבים מזוויות שונות. \nשם המתרגל/ת: סשה.\nחוות דעת - תרגולים: \nתרגולים מאוד בינוניים, לא מספיקים חלק מהשאלות בתרגולים איתה, והשאירה אותנו לצפות בהקלטות. נצמדה המון למערל של התרגול, היה קשה לקבל תשובות בנוגע לדברים פיזקליים מוחשיים.\n\nהסדנא: ממליץ מאוד להכניס ללוז ולסדר היום, לצפות זה חובה, תרגילים מעולים ממבחנים שעושים סדר בראש לקראת תרגילי הבית.\n\nשעורי הבית: \nחופפים להרצאות, סביר לפתור אותם אם כי הייתי ממליץ לעבור על החומר הלימודי הנוגע לנושא, טוב טוב לפני.\n\nהשורה התחתונה:\nהקורס עמוס, יותר ממה שצריך להיות ל3.5 נקז. אבל אפשר להצליח עם מקפידים להבין אל הנקודות העדינות.", "timestamp": 1626117609367}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה אחת המרצות המוצלחות שראיתי, מסבירה בסבלנות ובבהירות עד שמבינים. מתייחסת לסטודנטים בצורה נעימה ולא מזלזלת. היא מפרסמת את הרשימות שלה לפני כל הרצאה ואפשר לבוא איתם פשוט להרצאה ולא להתעסק בלכתוב שזה אחלה, וגם יש שם עוד דוגמאות שלא מספיקים בכיתה. בהתחשב בזה שאין באמת תרגולים בקורס הזה, הדוגמאות האלה יכולות לעזור מאוד. בנוסף היא עונה למיילים ובפורום די הרבה ועושה שעות קבלה פרטניות.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: מתרגל מעולה, גם מסביר בצורה טובה ותבניתית (כאילו איך צריך לחשוב בבעיות מסוימות), וגם יש לו מאגר של סרטוני עזר וסדנאות שבהם הוא פותר תרגילים נוספים - מאוד מאוד חשוב. כמו שאמרתי מקודם שעת תרגול אחת בשבוע זה לא עוזר בשיט ולא מכין לא למבחן ולא לגליונות בית. נעזרתי המון בסנדאות ובסרטוני העזר של ערן. גם לחנה יש אחלה סרטוני עזר אגב.\n\nשעורי הבית: רוב הסמסטר הרגיש שלא קיבלנו את הכלים המתאימים מההרצאות ומהתרגולים בשביל להתמודד עם חלק מהשאלות בגליונות. מה שכן הגליונות מרופרנסים ולרוב עזר לי לנסות לעשות רנרס אנג'נירינג ואיך הגיעו לפתרון (או ללכת לשעת קבלה). בכל אופן מאוד עמוס ולקח לי יום בשבוע לעשות את הגליונות.\n\nהמבחן: לרוב קשה בצורה לא סבירה, לדעתי השנה עם חנה היה די הוגן לדעתי. הדרך להתכונן היא לעשות מלא מלא מבחנים עד שמצליחים להבין לאיזה נושאים קשורה כל שאלה ומשם זה יותר עניינים של נוסחאות. ממליץ על ללכת לסדנאות לפני המבחן ולשעות קבלה - להרבה מבחנים אין פתרונות\\פתרונות לא ברורים.\n\nהשורה התחתונה: קורס עמוס וקשה יחסית ל3.5 נקז שהוא מביא. לא נהנתי בכלל אבל זה קורס חובה ואין ממש מה לעשות", "timestamp": 1626426728577}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמרצה מעולה, אולי מבין המרצות הבודדת שהרגשתי שאכפת לה מהסטודנטים במהלך הסמסטר. מסבירה כמו שצריך, מביאה המון דוגמאות ואם נעזרים ברשימות ההרצאה שלה- אין סיבה אפילו לכתוב.\nבשלב מסויים עברתי לכתיבה בהרצאות כדי להפנים את החומר טוב יותר. בסה״כ מדובר במרתה אחראית מאוד, אכפתית שנענית לכל שאלה ובקשה ועושה את המקסימום בשביל הסטודנטים שלה.\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: \nהתרגולים יחסית בסדר. לא מספיקים לכסות את כל החומר, קצרים מדי יחסית לכמות החומר שהקורס דורש ולכן כדאי מאוד ללכת לסדנא- שם פותרים שאלות נוספות ממבחנים וזה מסדר את הראש, נותן כלים איך להתמודד עם סוגים שונים של שאלות ומכין אותך למבחן כמו שצריך.\n\nשעורי הבית: \nדי עמוסים, תמיד הייתה ציפייה לסיים אותם בשעה-שעה וחצי ובפועל זה לקח הרבה יותר וזה אחרי ריפרונס שלהם מגיליונות אקסל בדרייב. \nאין סיבה לא לרפרנס את הגיליונות אם כי הייתי מאוד ממליץ להבין את הדרך- בסופו של דבר מקבלים מהשיעורים כלים להתמודדות עם שאלות נוספות.\n\nהמבחן: \nאני חושב שאפשר לומד בפה אחד, שהיה אחד המבחנים ההוגנים שראיתי- שאלות שלא דרשו הבנה עמוקה מדי בחומר, אם כי אכן בחנו דברים חשובים מאוד מבחינת הידע. חלק מהשאלות היה ניתן לפתור עם דף נוסחאות משובח ואיכותי. \nלגבי הדף נוסחאות- ממליץ להכין במהלך כל הסמסטר, ולאסוף דברים חשובים בו ולא לקחת דף נוסחאות של מישהו אחר לקראת המבחן- זה עוזר פלאים.\n\nהשורה התחתונה:\nקורס עמוס, אבל אני חושב שהעובדה שחנה הייתה מרצה אחראית הפכה אותו לקורס הוגן, איכותי ואפילו מעניין. מאוד ממליץ לקחת כשחנה מרצה אחראית.", "timestamp": 1626540580006}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה ואכפתית, מסבירה הכול באופן מובן וכמה פעמים גם כשלא מבינים. יש לה רשימות וזה דבר מדהים שכדאי להיעזר בו - מאוד מקל על ההקשבה בהרצאה והבנת החומר בנושאים רבים. ממליץ להשתמש ולכתוב הערות בצד, ובנוסף לכך לאגור במהלך הסמסטר דוגמאות ונוסחאות שימושיות שפותחו בהרצאות לדף נוסחאות למבחן הסופי.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: אחלה מתרגל שבעולם. ממליץ מאוד לראות את ההקלטות ולשים על X1.5.\n\nשעורי הבית: יוצאים כל שבוע. מומלץ מאוד לא לרפרנס בפעמיים הראשונות ולהתמודד לבד עם השאלות ואפילו להגיע לשעות קבלה ולשאול. חשוב מאוד במיוחד בקורס שכזה.\n\nהמבחן: אמריקאי עם 12 שאלות והוגן מאוד לדעתי. אפשר להביא דף נוסחאות של 2 דפים דו-צדדיים (4 עמודים). עם דף נוסחאות עדכני לסמסטר המשלב הרבה דוגמאות ממבחני עבר ומההרצאות, המבחן נראה אחרת לגמרי.\n\nהשורה התחתונה: קורס מעניין ומאתגר. יחסית עמוס לעומת קורסים אחרים ודורש הרבה השקעה על מנת להצליח בבחינה.", "timestamp": 1626633181447}, {"author": "..", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה אחלה מרצה, מסבירה טוב את החומר ועונה על שאלות.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: מומלץ לצפות בתרגולים המוקלטים מהזום, שם היה מעולה. בלייב פחות אהבתי אותו.\n\nשעורי הבית: \nגיליון כל שבוע עם סדר גודל של 10 שאלות שחלקן כמה רמות מעל התרגילים שנראו בכיתה או אפילו מה שיש במבחנים, ואין ממש את הכלים לפתור אותן. בכל זאת מומלץ לנסות להתמודד עם השאלות (לפחות האלה ברמה בינונית) לבד ולא לרפרנס.\n\nהמבחן: \nהמבחן על המון חומר וקשה להתכונן אליו אלא אם כן יש הרבה זמן כדי ללמוד באופן יסודי. מה שעוד מקשה על ההכנה למבחן היא שלרוב מבחני העבר אין פתרונות בכלל, ואם יש אז הם מאוד מאוד מקוצרים (ברמה של לפעמים הוספה של שורה או שתיים הסבר למה ואיך הגיעו למשוואה שהשתמשו בה יכלו לחסוך לך שעה של לשבור את הראש מה הם עשו שם, ואני באמת לא מבין למה לדפוק את הסטודנטים ולרשום פיתרון בשתי שורות שקשה ללמוד ממנו ולהשתפר). המבחן לא כל כך פרופורציונאלי לחומר שנלמד בסמסטר - לדוגמא יחסות שזה נושא שנלמד בחאווה בשני שיעורים האחרונים לרוב מופיעות 3-4 שאלות במבחן ולעומת זאת נושאים שהשקענו בהם הרבה יותר זמן יש בקושי שאלה. סה\"כ אם מספיקים ללמוד את כל החומר בצורה טובה המבחנים ברמה די סבירה, אבל בגלל כמות החומר העצומה זה לא טריוויאלי.\n\n\nהשורה התחתונה: קורס עמוס ולא שווה את ה3.5 נק\"ז.\nאני מאוד ממליץ להיות על החומר במהלך כל הסמסטר, לפתור את כל השיעורי בית (ומה שלא מצליחים לחפש רפרנס עם הסברים ולא סתם אקסל) ולפתור בכל נושא גם הרבה תרגילים מעבר למה שיש בשיעורי בית, אחרת קשה מאוד בכמה ימים שיש ללמוד למבחן בתקופת מבחנים לכסות את הכל. בקורס מנסים ללמד הרבה יותר מדי נושאים בקורס הזה, ככה שיוצא שהרבה נושאים מדברים עליהם פחות משעה בהרצאה, חנה מראה את הדוגמא הכי פשוטה שיש ואז משחילים אותך בתרגילים ברמת קושי הכי גבוהה שאפשר", "timestamp": 1626683795742}, {"author": "שחר זוארץ", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: מעניינות והרבה דוגמאות. מומלץ כמרצה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש הרבה אבל הם חשובים\n\nהמבחן: קצת קשה\n\nהשורה התחתונה: אני לא אוהב פיזיקה אבל המרצה הפך את זה לנסבל", "timestamp": 1626701624645}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה באמת מעולה, רואים שהיא אוהבת ללמד את הקורס הזה וזה בא לידי ביטוי באנרגיה החיובית שיש לה בהרצאות. \n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מתרגלת מצוינת, מסבירה בצורה מאוד מסודרת ותמיד עונה על שאלות.\n\nשעורי הבית: קשים. אם יש זמן מאוד מומלץ לא לרפרנס.\n\nהמבחן: בסך הכל רמת המבחן לא הייתה שונה מהרמה בשנים קודמות, הדבר היחיד שמוריד את הממוצע זה שלא ניתן פקטור הפעם.\n\nהשורה התחתונה: קורס מאוד מעניין, אבל קשה ועמוס שלא ממש תואם את כמות הנק\"ז שלו.", "timestamp": 1627238831523}, {"author": "Michal Maya", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מושלמת. מסבירה ממש טוב ועושה הכל כדי שהסטודנטים יצליחו\n\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: תותח. תרגולים ממש קצרים אז הוא לא מספיק הרבה אבל מסביר מעולה \n\nשעורי הבית: דיי קשים לא מאוד עמוסים\n\nהמבחן: קשה ומכשיל \n\nהשורה התחתונה: קורס מעניין, אין מספיק שעות במערכת בשביל להבין את החומר ברמה הנדרשת", "timestamp": 1627292757781}, {"author": "אנונומי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גדעון\nחוות דעת - הרצאות: חד משמעית המרצה הכי מושלם ! מעביר את ההרצאה בצורה הכי מעניינת ותמיד בא עם הרבה אנרגיות שבאמת גורם לנו להתעניין בפיסיקה .\n\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: גם ממליצה הוא תותח \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1630949789573}, {"author": "Bimini Bon-Boulash", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה. מסבירה מעולה ואכפתית. יש קצת בעיה של ניהול זמן כי עונה לכלללללל השאלות בפעם השלישית (אחרי שהיא אומרת שהיא לא תעשה את זה הפעם) ואז בעשר הדקות האחרונות מתחילה לרוץ על החומר.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: מסביר טוב ויש לו אחלה מוקלטות וסיכומים במודל. יכול להיות קצת פוץ מידי פעם\n\nשעורי הבית: גיליון סגור במודל כל שבוע. לא קשה מידי ויש תשובות כמעט לכל השאלות בדרייבים, אבל שווה לעשות כי הם עוזרים להבין את החומר. לא יודע מי צריך לשמוע את זה אבל לא לעשות לפני שרואים את התרגול.\n\nהמבחן: אמריקאי, צריך להיות על הכל כי הם מדהימים בלשים תשובות לא נכונות שיכולות לצאת.", "timestamp": 1634114106321}, {"author": "Benjamin Mayan", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אחלה מרצה סך הכול, מסבירה לא רע, מסודרת.\n\nשם המתרגל/ת: סשה \nחוות דעת - תרגולים: התרגולים בקורס קצרים מדי ואין למתרגלים זמן לעבור אפילו על כל התרגילים. סשה עשתה מאמץ להסביר את החלקים החשובים מהתרגילים וענתה על שאלות למרות חוסר הזמן, בנוסף היא הקפידה להקליט את התרגילים שהיא לא הספיקה.\nסך הכל אחלה מתרגלת\n\nשעורי הבית: גליון מקוון בערך פעם בשבוע , רוב התרגילים היו פתירים בקלות אבל חלקם היו מעצבנים ונאלצתי להיעזר ברפרנס (אין רפרנסים מלאים לכל הגליונות). כל גליון דורש איזה שעתיים שלוש עבודה.\n\nהמבחן: היה מבחן הוגן לגמרי, חוץ משאלה אחת שכללה מושג שבכלל לא הוזכר בהרצאות/תרגולים והרבה סטודנטים נפלו בה.\n\nהשורה התחתונה: קורס לא עמוס במיוחד ודי מעניין אבל התרגולים קצרים מדי", "timestamp": 1634979596930}, {"author": "Shay Hacohen", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: מרצה ממש טוב. אווירה טובה בהרצאות. דואג להעביר כמה שיותר אינטואיציה לצד הפורמליזם.\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: מתרגל מצוין. מעביר טכניקה ממש טוב. פרסם רשימות והקלטות מתרגולים שנעזרתי בהן לא מעט. פרסם גם הקלטות של סדנאות שנועדו לחדד הבנה בנושאים מסויימים שגם בחלקן נעזרתי.\n\nשעורי הבית: לא עמוסים מאוד ביחס לרוב הקורסים שלקחתי. מסייעים בהבנת החומר.\n\nהמבחן: אמריקאי, משום מה. זה אומר שטעות חישוב יכולה לגרור פגיעה משמעותית בציון. עם זאת, עם מספיק תרגול וזהירות, מינון טעויות החישוב יורד.\n\nהשורה התחתונה: קורס כיף ומעניין. חבל לדעתי שהמבחן אמריקאי אבל עוברים את זה.", "timestamp": 1635197988259}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: נוראי ביותר. מכשיל בכוונה. \n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: סבירה. התרגולים בקורס הזה כמעט ולא מועילים\n\nשעורי הבית: גיליון וובוורק כל שבוע. חלקם לא קלים בכלל. יש רפרנסים\n\nהמבחן: אמריקאי\n\nהשורה התחתונה: קורס מעניין, מבחן לא קל.", "timestamp": 1635255789269}, {"author": "כינוי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאנין\nחוות דעת - הרצאות: אחלה מרצה , מסבירה הכל עם דוגמאות ממש טובות לאינטויצאה\n\nשם המתרגל/ת: ערן לוסטיג\nחוות דעת - תרגולים: \nמתרגל מצוין , מעביר את החומר בצורה ממש טובה\nשעורי הבית: \nכדאי מאוד לעשות אותם בלי ריפרנסים\nהמבחן: \nהמבחן מועד ב שלנו היה מאוד הוגן.\nהשורה התחתונה: קורס ממש מעניין ויסודי מאוד , קשה אבל אם עושים תרגילי בית מסתדרים", "timestamp": 1635470183026}, {"author": "Omer Kawaz", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יורם רוזן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אפשר להעתיק מהדרייב - ממוחזרים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643547839932}, {"author": "BaronCabbage", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעולה, מעבירה מעולה את החומר וגם מקליטה \n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מתרגלת טובה סה\"כ וגם מקליטה את התרגולים שלה, ראיתי רק הקלטות, התרגולים מלש עצמם לא מועילים במיוחד כי לא מספיקים כלום והתרגול קיים גם ב PDF באתר.\n\nשעורי הבית: גיליון פעם בשבוע, הרבה יותר קשים מהשאלות במבחן בערך 3 שעות כל אחד, יש רפרנסים בדרייב שבעיקר בונים עליהם לפיתרון אבל ממש עוזרים להבנה.\n\nהמבחן: הוגן וממש אפשרי, 12 שאלות אמריקאיות שאפשר לענות על חלקם בצורה אינטואיטיבית וחלקם ברמה של תיכון, לא למדתי יותר מידי כי היה לי מבחן אחר שדרש יותר.\n\nהשורה התחתונה: החלטתי להקדים את הקורס חסמסטר ראשון (מדמ\"ח) וסהכ היה רעיון לא רע.\nהקורס לא בנוי בצורה מוצלחת מבחינת תרגולים, מאד אינטואיטיבי אבל לא קשה מידי לא עמוס במיוחד.\nלמי שאוהב פיזיקה - הרווחתם.\n\nלהשקיע בהבנת יחסות כי זה חלק לא קטן מהמבחן וממש לא קל במקצוע (ה\"backtracking\" של פיזיקה1מ).", "timestamp": 1643645561340}, {"author": "קוריוליס", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את החומר בצורה מעולה. יש גם הקלטות שלה שברובן דומות להרצאות בלייב שזה יתרון.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: מתרגלת אחלה סה\"כ אבל התרגולים בקורס לא באמת שווים משהו כי הם רק שעה אחת. הדבר הכי מועיל בהם זה להכיר עוד דוגמאות לכל מיני מקרים. אני באופן אישי ראיתי רק מוקלט כי זה היה נראה לי בזבוז להיות בתרגול לייב.\n\nשעורי הבית: די קשים, אבל יש אחלה רפרנסים. טיפה יותר קשים מהמבחן. הדבר הכי מעצבן היה שהם יוצאים כל שבוע. זה גוזל יותר מדי זמן יחסית למה שהקורס הזה שווה.\n\nהמבחן: מבחן הוגן סה\"כ. אפשר להצליח אם מתרגלים הרבה מבחנים לפני זה כי בסופו של דבר כל תהליך הלמידה הוא להכיר טריקים שונים שאפשר להתשמש בהם במבחן.\n\nהשורה התחתונה: אני לא חשבתי שהוא כל כך מעניין, ובתוספת השיעורי בית כל שבוע הפך להיות הקורס הכי מעצבן בסמסטר, אבל אין ברירה וחייבים לקחת אותו ואפשר גם להצליח.", "timestamp": 1643796325321}, {"author": "Ron Lebedinsky", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מרצה מעולה אך מאיך שמורכב הקורס אין באמת זמן להיכנס לדקויות של כל נושא, בעיה של הקורס עצמו ולא של חנה כמרצה. היא עושה מעל ומעבר בשביל הסטודנטים.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מעבירה את החומר בצורה זריזה וברורה. בגלל שיש לה רק שעה אחת של תרגול היא ממהרת להספיק את מה שהיא צריכה להעביר.\n\nשעורי הבית: כל שבוע יש מטלה של 8 עד 12 שאלות בנושא ספציפי, לוקח בסביבות של 3 שעות או יותר, כדאי לגשת לפתור אחרי התרגול באותו הנושא של המטלה. ( יש גם רפרנסים לרוב השאלות אך מאוד מומלץ לא לקפוץ עליהם ישר כשלא מצליח משהו )\n\nהמבחן: הוגן, יש היזון בין הרמה של ההבנה הדרושה לבין הרמה של מורכבות הפתרון של השאלות כך שיש רמת קושי קצת יותר מבינונית של כל השאלות. מומלץ מאוד לפתור הרבה מבחנים מהשנים האחרונות לפני שניגשים למבחן עצמו.\n\nהשורה התחתונה: קורס בסיס לא קשה אבל גם לא קל, יש כמה דברים מעניינים פה ושם שצצים בהרצאות.", "timestamp": 1643871564975}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מושלמת וגם טבריינית ככה שאין מה להתבלבל - פשוט ללכת אליה (המרצה עם הכי הרבה סטודנטים בטכניון..)\n\nשם המתרגל/ת:  אמוץ פרי\nחוות דעת - תרגולים:  נחמד סה\"כ, שעה בשבוע פשוט לא מספיק\n\nשעורי הבית: ארוכים ולפעמים פשוט מתישים\n\nהמבחן: הכל אמריקאי, בחלק ממנו הרגשתי שאני ממלא ווינר\n\nהשורה התחתונה: עוד קורס חנק מבית היוצר של שנה א' בטכניון", "timestamp": 1643899048497}, {"author": "רז", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאלופה, ללכת רק אליה\n\nשם המתרגל/ת: אמוץ פרי\nחוות דעת - תרגולים: \nמתרגל מעולה, אכפתי, מסביר מעולה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643902941566}, {"author": "Roy", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: לא הגעתי להרצאות פיסית, אלא רק ראיתי הקלטות אחרי שהיא העלתה אותן. לא מרגיש שפספסתי משהו.\nאני מחזיק בדיעה הפחות נפוצה שחנה לא מרצה כזו טובה. היא מעבירה את ההרצאות באווירה טובה ועונה על שאלות, אבל מרגיש לי שאין באמת מעבר על החומר בצורה שתתן הבנה. החומר בהרצאות מועבר ברמה שטחית מאוד שלא תואמת את תרגילי הבית ואת המבחן.\n\nשם המתרגל/ת: אמוץ פרי\nחוות דעת - תרגולים: לדעתי אמוץ המתרגל הכי טוב שהיה אצלנו בקורס (וניסיתי את כולם). לא מבין איך לא היו אצלו יותר אנשים בתרגולים. מעביר אותם בצורה עניינית ועוזר להפנים את החומר.\nבאופן  כללי התרגולים בקורס בנויים לא משהו, יש רק שעה תרגול ולרוב לא מספיקים את הכל, אבל זה מה יש. ממליץ לעבור על הדפים של התרגולים אחר-כך לבד ולנסות לעשות לפני שעושים את שיעורי הבית, גם את מה שהיה בכיתה ומה שלא הספיקו.\n\nשעורי הבית: הזייה. בהרצאות ובתרגולים מביאים תרגילים קלילים כדי שנחשוב שהנושא הזה לא כזה נורא, ואז מביאים בשיעורי בית תרגילים ברמה שלא ציפית לה. כל הגשה יש לפחות תרגיל אחד על גבול הלא-פתיר. לא חושב שיש מישהו שפתר הכל וקיבל 100 בלי רפרנס.\n\nהמבחן: המבחן שלנו לא היה קשה באופן יוצא דופן לדעתי, הייתה שאלה אחת שהתשובה הנכונה לא הייתה באפשרויות וכולם בזבזו עליה את הזמן. לא חושב שיש סמסטר בלי פקטור בקורס הזה.\n\nהשורה התחתונה: נראה לי שאם משקיעים ולומדים לזה כמו שצריך אפשר להוציא ציונים טובים מאוד, אבל הקורס לא בנוי כדי לעזור לכם בזה.", "timestamp": 1643974767280}, {"author": "Gil Shahar", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה מרקיסטיאן\nחוות דעת - הרצאות: מרצה ברמה של צנזור, מאוד מסודרת, מקליטה, מעלה סרטוני עזר לתרגילים ממבחנים\n\nשם המתרגל/ת: אליה בלונמנטל\nחוות דעת - תרגולים: תרגולים עם קבוצה קטנה של אנשים, היה הרבה יחס אישי והוא יודע לענות על שאלות בצורה טובה.\n\n\nשעורי הבית: נחמדים אבל לא שווה להשקיע. אם לא הולך אז לא נורא לרפרנס. פתירת מבחנים הרבה יותר חשובה מהם\n\nהמבחן: היה קשה יחסית למבחני עבר אבל קיבלנו פקטור של 13 נקודות. היו הוגנים.\n\nהשורה התחתונה: קורס עם הרבה חומר אבל אם מקדישים שבועיים לפתור מבחנים אפשר להצליח בגדול. השאלות חוזרות על עצמן.", "timestamp": 1644052304924}, {"author": "Sason Shmuel Lameey", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מצוינות. אם יש לכם את האופציה להיות איתה - לכו על זה. \n\nשם המתרגל/ת: אליה בלומנטל\nחוות דעת - תרגולים: תרגולים בקבוצה קטנה (15 אנשים מתוך 700 בקורס). מסביר בסך הכל ממש טוב. דיי מונוטוני ולפי הספר אבל ככה כולם. נשאר ומסביר (התאפשר בסמסטר הזה) לגביי החומר של התרגול או אפילול סתם חומר של פיזיקה קוונטית אם תרצו :)\n\nשעורי הבית: קשוחים מאוד, בתור אחד שעף על פיזיקה בתיכון, אלו היו שעות של כאב מהול ביופי נסתר. ממליץ לנסות לעבור על ההרצאות תרגולים ולנסות לפתור, אם נתקעתם, חבל לכם על הזמן - לכו לרפרנס, תוודאו שהבנתם, תפנימו ושלום על ישראל.\n\nהמבחן: דיי קל. למעשה כל המבחנים שפתרתי לפני היו ממש מסובכים ובהתחלה לא הבנתי מילה. אבל *בגללם* החומר של כל ההרצאות הופנם יותר טוב ויכולתי לעשות אינטגרציה של החומר במבחן. \n\nהשורה התחתונה: חשוב לפתור הרבה מבחנים, להיות עם היד על הדופק על שיעורי הבית (ככלל, זה חשוב בכל קורס, לא משנה איך, תעברו בסוף על שיעורי הבית).\nבנימה אישית, אם אין לכם יותר מדי חברים בתחילה, זה באמת לא קל, (ואולי גם לא יהיו בהמשך אבל זה סיפור אחר). תוודאו כניסה לקבוצת הווטסאפ (או ברבים אם מתאפשר) ותעברו את זה בסוף :)", "timestamp": 1644075438037}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה טובה, מומלצת ממש. מסבירה מסודר וברור. למי שנוח מפרסמת בדר\"כ גם את הרשימות שלה לפני ההרצאה ואז אפשר לשבת איתן במקום להעתיק מהלוח.\n\nשם המתרגל/ת: אליה בלומנטל\nחוות דעת - תרגולים: קצת יבשים. אבל מסבירים איך להוריד את החומר שלומדים בכיתה לתכלס של התרגילים בשיעורי בית.\n\nשעורי הבית: גליונות במודל כל שבוע. די קשים, אבל יש רפרנסים אז זה לא נורא כ\"כ. \n\nהמבחן: אמריקאי. קשה ממש וכמעט תמיד עם פקטור. תתכוננו טוב ואל תסמכו על המזל.\n\nהשורה התחתונה: סה\"כ קורס מעניין, גם אם לאורך הסמסטר לא מבינים את הקושי שבו/מדחיקים את השיעורי בית, לפני המבחן האסימון נופל ואז מתחילים להילחץ ולחרוש. אבל אפשר לעבור אותו, ועם קצת מאמץ אפילו עם ציון טוב.", "timestamp": 1644171399091}, {"author": "Gal S", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: חנה מרצה מצויינת. עם התקדמות הקורס מבינים מה בפיתוחים בהרצאה חשוב יותר ומה פחות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין מספיק זמן תרגול (50 דקות בשבוע) ככה שלא מספיקים כמעט כלום במהלך השבוע. ממליץ להעזר בקורס חיצוני (לא חסר) שמאפשר תרגול יותר מעמיק של החומר.\n\nשעורי הבית: ברמה יחסית גבוהה, אבל הרוב פתיר ועוזר להטמעה של החומר.\n\nהמבחן: אם מבינים את התשתיות של הנושאים ומתרגלים בצורה סבירה מבחנים אז אפשר להוציא ציון טוב", "timestamp": 1644174960843}, {"author": "Bar David", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה, מקליטה את ההרצאות שלה ומלמד ברמה מקצועית גבוהה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644307272346}, {"author": "אנונ'", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמרצה טובה, נוטה לפעמים לסבך דברים פשוטים עם הסברים מסובכים מידי, אבל היא הכי טובה שיש\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nהשאלות בשיעורי הבית הן ברמה של שאלות מבחן אז חשוב לעשות אותן מתוך הבנה ולא לרפרנס על עיוור, אפילו שהן קשות במה לא הגיונית עבור מי שרק ראה שעתיים הרצאה בנושא\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644369128977}, {"author": "Nikol Seleznev", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: המרצה הכי טובה בפער מכל השאר. \n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מתרגלת סבבה.\n\nשעורי הבית: קשים אבל יש רפרנס להכל \n\nהמבחן: מבחן קשה ממש. לפעמים יש שאלות ממש קשות שלא ברור מאיפה הן באו ולפעמים יש שאלות בדיחה. בקיצור צריך ללמוד כמו שצריך לזה.\n\nהשורה התחתונה: קורס ממש מעניין אבל דורש המון השקעה.", "timestamp": 1644821755846}, {"author": "יהי אפסילון קטן מאפס", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: \nחנה מרצה טובה ועושה כמיטב יכולתה במסגרת השעות המועטות מדי שיש לקורס הזה.\nמסת חומר גדולה.\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: יש גליונות קלילים ויש גליונות קשים\n\nהמבחן: \nלפעמים הוגן ולפעמים לא. \nאצלנו לא. כדאי שאחזור ללמוד למועד ב' במקום לכתוב היסטוגרמות.\nהשורה התחתונה: \nקורס מעניין \nתקוו שיהיה מבחן הוגן\nשליש מבחן תמיד יחסות\nתתפללו שבשאר תהיה הגינות", "timestamp": 1645360750745}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: חנה. מסבירה בצורה טובה את החומר. בעיקר הרבה דוגמאות לכל נושא מה שעוזר להבין את החומר.\n\nשם המתרגל/ת: סשה (רק בהקלטות)\nחוות דעת - תרגולים: ראיתי רק הקלטות של התרגולים ולטעמי היו די מיותרים. לא הסבירו שם את החומר בצורה טובה יותר מההרצאה וניתן היה לקרוא את הדפים של התרגול בקצב שלך\n\nשעורי הבית: גליון אחד כל שבוע. לוקח כמה שעות להתמודד איתו וכמעט תמיד יש כמה שאלות שאתה מרפרנס עליהם\n\nהמבחן: אפשרי לגמרי. 12 שאלות אמריקאיות ברמות קושי שונות. כדי להיסגר לפני המבחן על יחסות כי יש על זה הרבה שאלות אבל החומר נלמד ממש בסוף הקורס\n\nהשורה התחתונה: אם חנה מרצה הקורס לגמרי אפשרי", "timestamp": 1645367495947}, {"author": "Gil Shahar", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה מרקיסטיאן\nחוות דעת - הרצאות:\nמאוד מסודרת, מעלה סרטוני עזר במהלך הסמסטר של שאלות לדוגמה.\nיותר מדי אנשים באים להרצאה שלה אז לפעמים אי אפשר לשאול.\n\nשם המתרגל/ת: אליה בלומנטל \nחוות דעת - תרגולים: תרגולים בקבוצה קטנה יחסית, קיבלנו יחס אישי מעולה ומרגיש שאליה ידע לענות מאוד מהר על כל השאלות שנשאלו.\nהכתב שלו לפעמים לא הכי ברור אבל הוא משתדל.\n\nשעורי הבית: ארוכים וחשוב לעשות אותם בתחילת הסמסטר בשביל לקבל אינטואיציה. לקראת סוף הסמסטר שכבר לא חובה להגיש ממליץ לעבור למבחנים. יש המון מבחנים לפתור אז שווה להתחיל מוקדם.\n\nהמבחן: אמריקאי, היה קשה יחסית למועדים קודמים אבל הביאו פקטור נדיב של 13 נקודות.\nתביאו דף נוסחאות שיצא לכם לעבוד איתו בשביל לא לבזבז זמן על לחפש בו.\n\nהשורה התחתונה: פיזיכיף", "timestamp": 1645375452663}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות:  \nמרצה מעולה, מאוד ברורה ואכפת לה מהסטודנטים. לפעמים קצת מעמיקה בתאורטי יותר מדי.\n\nשם המתרגל/ת: אליה ולאחר מכן סשה(אלכסנדרה)\n\nחוות דעת - תרגולים: \nיש שעה תרגול בשבוע, ממש לא מספיק כדי לפתח אינטואיציה טובה למקצוע. אצל אליה היה קשה לעקוב, הוא מאוד נחמד אבל לא התחברתי לשיטת לימוד אצלו.\n\nעברתי להקלטות של תרגולים של סשה, בתור מתרגלת אחראית, היא הייתה יותר ממוקדת על החומר, אך בגלל שמדובר בשעה שבועית, היא הייתה צריכה לרוץ על שאלות ולא הספיקה כל מה שרצתה.\n\nשעורי הבית: \nיש גיליון בשבוע, אני עשיתי טעות ורפרנסתי הרבה מהם בשלב מוקדם. לאחר מכן החומר נהיה מאוד קשה ולא אינטואיטיבי אם לא מבינים את החומר ההתחלתי. ממליץ לעשות את שיעורי הבית לבד ולהיות על החומר במהלך הקורס. בנוסף, יש 15% מגן על הגשת 10 תרגילי בית מתוך 13, ככה ששווה להגיש.\n\nהמבחן:\nאין מבחן אמצע, המבחן הסופי הוא אמריקאי עם 12 שאלות.\nחצי מהמבחן שלנו התמקד בחומר שנלמד בכמה שבועות האחרונים של הסמסטר. אז כדאי להיות חדים עליו.\n \n\nהשורה התחתונה: \nקורס קשה ואין לו מספיק שעות תרגול במערכת. ממליץ כמה שפחות לרפרנס ולמצוא מתרגל שאתם מתחברים אליו.", "timestamp": 1645422501640}, {"author": "ל\"א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מדהימה! היא תנסה לעשות הכל כדי שתבינו את החומר כמו שצריך, אם זה להישאר איתך לאחר ההרצאה להסביר לך את החומר או למשוך את השעת קבלה שלה 3 שעות מעבר למה שהיא אמורה, פשוט מדהימה\n\nשם המתרגל/ת: אליה בלומינטל/ סשה \nחוות דעת - תרגולים: לפעמים הלכתי לאליה לפעמים הלכתי לסשה. יש שעת תרגול אחת בשבוע שזה לא מספיק להיקף החומר בכלל, הרבה מהחומר אתה צריך להיסגר עליו לבד אחר כך בשיעורי הבית, אבל שניהם מתרגלים ממש סבבה\n\nשעורי הבית: קשים, דורשים זמן ומחשבה, כן ממליצה לעשות הכל למרות שלא חייב כי זה עוזר לך בעיני להיסגר על החומר מבעוד מועד, המבחן הזה הוא לרוב הראשון וימים בודדים לאחר סוף הסמסטר אז אין הרבה זמן ללמוד אליו, אז ממליצה להיסגר על החומר מראש\n\nהמבחן: המבחן הוגן, לרוב מקיף את כל החומר (ספציפית בסמסטר שלי לא) ומכיל לפחות 4 שאלות על הנושא האחרון בקורס - לורנץ, אז תיסגרו על זה מבעוד מועד\n\nהשורה התחתונה: קורס מעניין, קצת קשה ועמוס", "timestamp": 1645459282943}, {"author": "YT", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nתותחית אמיתית. עוד לא נתקלתי במרצה שמשקיע/ה כ\"כ הרבה. מפרסמת סרטוני עזר, מנהלת פורום שאלות של סטודנטים ומסבירה בצורה מדהימה. אני ראיתי הקלטות.\nשם המתרגל/ת: אלכסנדרה בקמן וניר יום טוב(וידאו)\nחוות דעת - תרגולים: \nהתחלתי מאלכסנדרה והיא פשוט עייפה, לא מלמדת כלום, מביאה דף של התרגול, מעתיקה אותו ללוח ומקריאה ממנו. בזבוז זמן מוחלט.\nבהמשך הסמסטר עברתי למוקלטים הישנים של ניר יום טוב והוא פשוט מדהים ומומלץ מאד! למרות שהוידאו ישן הוא רלוונטי בדיוק באותה מידה.\nשעורי הבית: \nרפרנסתי הכל.\nהמבחן: \nהמבחנים בקורס לא פשוטים וצריך זמן עד שהכל שוקע אבל אם בסוף החומר שוקע ומבינים אותו השאלות לא קשות. לנו היה מבחן הוגן לטעמי, למרות שהיה ממוצע נמוך וכמעט תמיד המבחנים בקורס מפוקטרים.\nהשורה התחתונה: \nבמהלך הסמסטר לא למדתי דקה מעבר ללראות הרצאות ותרגולים מוקלטים במהירות כפולה. למדתי שבועיים לפני המבחן ויצא מעולה. לא יעבוד לכל אחד כנראה. סה\"כ הקורס די מעניין.", "timestamp": 1646381451041}, {"author": "סמסטר א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה מרטיקאינן\nחוות דעת - הרצאות: מרצה מושלמת, אין מילה אחת רעה. יודעת לאזן בדיוק המידה הנכונה בין שאלות ולבין ריצה על החומר השותף, מלמדת בצורה חייכנית ומסקרנת. לא מכיר עוד מרצה עם כזו מודעות ונכונות לעזור למאות הסטודנטים שלה, אין כמו חנה.\n\nשם המתרגל/ת: סשה \nחוות דעת - תרגולים: סביר, סשה קיבלה שעה שבועית אחת לתרגול והחוסר הורגש מאוד, בקושי מספיקים לפתור תרגיל אחד בשבוע, סשה רצה עליו במהירות האור ובדרך כלל לא יוצאים עם הרבה מידע חדש מהתרגולים.\n\nשעורי הבית: עבודות במודל, עוזרות להבנה ויש אחלה רפרנסים.\n\nהמבחן: מבאס, שאלות אמריקאיות מטעות בחלקן. כל עניין היחסות היה קשה.\n\nהשורה התחתונה: קורס מעניין אבל לא קל להבנה.", "timestamp": 1647277271770}, {"author": "תומר לוי", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\n\nחוות דעת - הרצאות: מרצה מצויינת, עונה על כל השאלות ומשתדלת מאוד מאוד מאוד להיות זמינה במודל ובשעות קבלה.\nאין כמוה!\n\nשם המתרגל/ת: אליה\nחוות דעת - תרגולים: טון די לא מעוניין ללמד, קשה להבין ממנו ולא תמיד תופס שאלות בקלות או עונה באופן יעיל...\n\nשעורי הבית: הרבה עבודות שבועיות במודל, לוקח לפחות שעתיים שלוש טובות אם לא נתקעים... כדאי להיעזר במתרגל טוב בשעת הקבלה שלו או פשוט לבקש לפתור תרגילים בשיעור, אין בעיה עם זה\n\nהמבחן: אמריקאי, לא קשה במיוחד אם סגורים טוב על החומר ועושים הרבה תרגילים לפני.\n\nהשורה התחתונה: פיסיקה מהתיכון עם קצת חדו\"א נגזרות אינטגרלים וכולי... ממש לא נורא.", "timestamp": 1647359099585}, {"author": "עידו", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: חנה נשמה טובה! חשוב לה להעביר את החומר כמו שצריך, מצד שני בגלל שיש רק שלוש שעות בשבוע היא לא מספיקה לענות על כל השאלות ומרגיש שהיא במירוץ תמידי נגד הזמן. היתרון הוא שהיא מקליטה את ההרצאות ומעלה לפנופטו, אז לי אישית יצא הרבה לצפות שוב בהקלטות להבין דברים מחדש.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: \nעקרונית לא ראיתי את התרגולים פרונטלית, אלא רק מוקלט. יש רק שעה תרגול בשבוע אז אין מספיק זמן להטמיע את החומר. מצד שני, הרבה מהתרגילים של התרגולים מופיעים בשיעורי בית.\nשעורי הבית: ברמה יחסית גבוהה, אבל מטמיעים את החומר טוב. הרבה רפרנסים..\n\nהמבחן: יחסית הוגן, אמריקאי.\n\nהשורה התחתונה: קורס לא בשמיים, אבל דורש השקעה בעיקר לפני המבחן. הרבה מהתרגילים חוזרים על עצמם, אז חשוב לתרגל ולהכיר את רוב סוגי התרגילים.", "timestamp": 1647714475562}, {"author": "Alon Maayan", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  יורם רוזן\nחוות דעת - הרצאות: יורם לא מרצה טוב. בשיעור הראשון הוא אמר את זה. היה לי רקע בחומר אז יכולתי להרשות לעצמי ללכת להרצאות שלו, שניהנתי מהן מאוד. הוא לא מרצה רגיל אבל רואים שהוא אוהב את החומר והוא מעביר אותו בדרכי הבנה ולאו דווקה בדרכים רגילות של הרצאה. \n\nשם המתרגל/ת: אלכסנדרה בקמן\nחוות דעת - תרגולים: סשה מתרגלת מצוינת. היא מאוד מקצועים וברורה וללא התרגולים שלה הייתי אבוד.\n\nשעורי הבית: שיעורי הבית יחסית קשים. עדיף כמה שפחות לרפרנס, אלא אם אין מוצא אחר. תריך להקדיש אליהם כמה שעות בשבוע אך זה משתלם. \n\nהמבחן: אל תיבהלו מכמות השאלות במבחן. אפשר לענות עליו במגבלת הזמן. המבחנים של יורם (המרצה האחראי) מאוד פיירים. שיעורי הבית לא מכינים כמו שצריך למבחן. פשוט צריך לתרגל ולתרגל ולתרגל מבחני עבר.\n\nהשורה התחתונה: קורס מאוד מעניין ודי כבד.", "timestamp": 1647769634558}, {"author": "meseri asaf", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאין על חנה. תמיד עם חיוך, תמיד עוזרת, תמיד עונה על שאלות גם במייל וגם בהרצאה והכל באהבה ובפירוט.\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: \nתרגולים מיותרים, הפסקתי ללכת באמצע כי הם פשוט העתק של מה שכתוב בדף של התרגול\nשעורי הבית: \nעמוסים, לא מכינים לגמרי למבחן\nהמבחן:\n12 שאלות אמריקאיות מבלבלות, מאוד משתנה בהתאם למי המרצה האחראי.\nהשורה התחתונה:", "timestamp": 1647947684613}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מומלצת מאוד! מסבירה את החומר מעולה ומדגימה גם את הרעיונות. רואים שהיא נהנית מהחומר ושנורא חשוב לה שיצליחו בקורס. גם לא בשעות הקורס נורא עוזרת (הרבה פעמים נשארת אחרי שנגמרה השעת קבלה, לקראת מבחן עונה הרבה על שאלות).\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: מומלצת.\n\nשעורי הבית: מאוד עוזרים להבנת החומר.\n\nהמבחן: אמריקאי. קצת מעצבן אבל התשובות יכולות לעזור במציאת הפיתרון במקרים קשים ;) אם מתרגלים מספיק לפני אפשר להוציא ציון טוב.\n\nהשורה התחתונה: עמוס ביחס ל3.5 נזים, אבל חובה אז בהצלחה!", "timestamp": 1648492899515}, {"author": "תומר בירן", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מדהימה. מלמדת מעולה ותמיד מתואמת עם הזום והרשימות. עוזרת מאוד בשעות קבלה ולא זזה משם עד שכולם מבינים\n\nשם המתרגל/ת: רון\nחוות דעת - תרגולים: חלק אהבו אותו וחלק לא. ממליץ לנסות ולהחליט בעצמכם\n\nשעורי הבית: לא ארוכים. כדאי לעשות ולא לרפרנס\n\nהמבחן: אמריקאי", "timestamp": 1657181055595}, {"author": "Anonymous", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה \nחוות דעת - הרצאות:  צפיתי בהקלטות שלה, מעולות.\n\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: מתרגל טוב מאוד.\n\nשעורי הבית: אם עושים בלי לרפרנס, הקורס נהיה הרבה יותר קל. הבעיה שאין לפעמים את הזמן לעשות את זה. \n\nהמבחן: כמו כל שאר המבחנים.\n\nהשורה התחתונה: פיזיקה זה מעניין, הקורס פחות לדעתי.", "timestamp": 1657447287244}, {"author": "Omer Har Paz", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלכסנדרה בקמן\nחוות דעת - הרצאות: \nמרצה מדהימה היא קצת  סוטה מהנושא לפעמים היא חזקה על התאוריה \nשם המתרגל/ת:  רון בסלר \nחוות דעת - תרגולים: מרצה מעולה  הכי שווה שיש תלמדו רק איתו הוא מעלה סרטונים ליוטוב והוא עושה את השיעורים בנויים היטב \n\nשעורי הבית: חסר ניסיונות בווב וורק מקסימום אפשר לרפרנס\n\nהמבחן: אין קשר בינו לבין השיעורי בית \n\nהשורה התחתונה:", "timestamp": 1657989969938}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאין יותר מידי מה לפרט, המרצה הכי טובה בטכניון!\nשם המתרגל/ת: אסף \nחוות דעת - תרגולים: \nהתרגולים זה הבזבוז זמן הכי גדול של הקורס, מרגיש לי ממש מיותרים למרות שהלכתי , אולי הוסיף לי 5% ידע כל פעם\nשעורי הבית: \nהשעורי בית קשים אבל עוזרים להבנת החומר , שווה מאוד להשקיע בהם ! \n\nהמבחן: \nהמבחן היה קשה בעיני , 12 שאלות אמריקאי. \n\nהשורה התחתונה: \nקורס ממש מעניין, לפחות חנה עושה אותו מעניין.\nבהצלחה", "timestamp": 1658160985190}, {"author": "זאת אני", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה מרטיסקאינן \nחוות דעת - הרצאות: חנה מרצה מעולה! מקליטה בזום, יש לה את כל הרשימות מסודרות אז לא צריך לכתוב, מסבירה באופן ברור ועונה על שאלות. לכו לשעות קבלה של חנה! היא עוזרת המון. ובאופן כללי חנה מספקת מענה נהדר על שאלות בקורס (מענה על שאלות בהרצאה, שעות קבלה ומענה בפורום)\nתשאלו שאלות בפורום, עונים שם ממש אחלה.\n\nשם המתרגל/ת: סתו מרכוס\nחוות דעת - תרגולים: יש רק שעה אחת של תרגול וזה לא מספיק, אז המתרגלים נאלצים לדחוף יותר מידי חומר במעט מידי זמן. סתו סבבה, מסבירה באופן ברור. אבל באופן כללי התרגולים מיותרים, אם אתם לא פותרים בעצמכם, זה לא יעזור יותר מידי להבנה.\n\nשעורי הבית: קשים אבל תורמים מאוד להבנה! מומלץ מאוד לעשות אותם בלי רפרנס למרות שיש לשיעורי בית מלא רפרנסים. \n\nהמבחן: קשה מאוד! מאוד! שאלות ברמה מאוד גבוה. עוזר שהמבחן אמריקאי. חשוב לתרגל מבחנים של המרצה האחראי כי לכל מרצה יש שאלות חוזרות שהוא / היא אוהבים.\n\nהשורה התחתונה: קורס קשה. בהצלחה :)", "timestamp": 1658179874822}, {"author": "....", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: סשה\nחוות דעת - הרצאות: \nסשה מאוד נחמדה, הייתה טיפה מבולבלת הסמסטר אבל ההרצאות היו גם יותר קטנות...\nבאופן כללי חושב ששוה לראות הרצאות מוקלטות על מהירות גבוהה כי זה דיי בזבוז זמן. לפחות שלושת רבע מהזמן בהרצאות זה על הפיתוח המתמטי שלא תידרשו לעשות בשום שלב בקורס (המבחן כולו עם דף נוסחאות)\n\nשם המתרגל/ת:  -\nחוות דעת - תרגולים: \nשעה בשבוע, מיותר לגמרי, הייתי פעמיים והפסקתי להגיע\n\nשעורי הבית: \nמעיקים מאוד אבל עוזרים להבין את החומר, תתעקשו להצליח לבד בלי רפרנס אבל לא כדאי לבזבז יותר מדי זמן, השאלות במבחן בסה\"כ קלות יותר\n\nהמבחן: \nמבחן יחסית בסדר אם פותרים המון מבחנים לפני, אבל זה בעצם מה שעוזר בקורס. לדעתי חייבים לשנות את המבחן שלא יהיה אמריקאי.\nעדיף לעשות שאלות ממבחנים עוד מתחילת הסמסטר, אפילו על חשבון לראות הרצאות (אם יש לכם דרך אחרת ללמוד את החומר)\n\nהשורה התחתונה: \nאישית לא אהבתי את הקורס. מרגיש כאילו זורקים עלינו מלא חומר בזמן מועט ובלי לדבר עליו בכלל. יחסית ל3.5 נקודות יש המון חומר. מה שכן, מרגיש לי שצוות הקורס מודע לעניין הזה כי היה אצלנו פקטור דיי מכובד.\nבהצלחה.", "timestamp": 1658327080637}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה תותחית, באמת המרצה הכי טובה שהייתה לי, תמיד מלמדת בצורה מעניינת ומשקיעה\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: \nהתרגולים היו נחמדים בגלל שהם קצרים לא באמת מספיקים בהם יותר מדי אז הם לא מאוד קריטיים\n\nשעורי הבית: יש הרבה אבל לא צריך לעשות הכל והם עוזרים\n\nהמבחן: המבחן הוגן ונתנו אפילו פקטור במשקל של שאלה\n\nהשורה התחתונה: הקורס הוא קורס מעניין ונחמד יש סגל טוב שמשקיע, המבחן גם באמת לא כזה נורא", "timestamp": 1658336184425}, {"author": "Me", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: לדעתי חנה מרצה נחמדה מאוד ומקסימה אבל לא עוזרת בכלל בהבנה הפיזיקלית של החומר. היא עדיפה על מרצים אחרים אבל שווה להתעכב אחרי הרצאות ולנסות להבין דברים לבד ולא רק פיתוחים מתמטיים לא נחוצים.\n\nשם המתרגל/ת: דרינגר\nחוות דעת - תרגולים: קצרים מידי, אסף אחלה מתרגל. גם סתו ממש נחמדה.\n\nשעורי הבית: סיוט. קשים אבל עוזרים. שווה להתעכב אבל לא לפחד לרפרנס. לא לדחות.\n\nהמבחן: אם לומדים טוב אפשר להצליח. \n\nהשורה התחתונה: נוראי בסמסטר, פחות במבחן", "timestamp": 1658627070195}, {"author": "סטודנט מיואש", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה:  חנה \n\nחוות דעת - הרצאות: \nחנה מסבירה מעולה אבל פחות היה לי סבלנות להרצאות, העדפתי לעבור על הסיכומי הרצאות שלה (מעולים!).\n\nשם המתרגל/ת:  רון בסלר\n\nחוות דעת - תרגולים: \nמאוד משקיע ומנסה להעביר את החומר באופן מעניין ולא באופן יבש של לפתור תרגילים. לפי הנסיון שלי או שממש תאהב את הסגנון או שתחפש מתרגל אחר.\n\nשעורי הבית: \nלוקחים 3-4 שעות בשבוע ובסוף הולכים לרפרנס\n\nהמבחן:  קשה אבל השאלות חוזרות על עצמם ועם הכנה טובה אפשר להצליח. בדרך כלל יש פקטור מכובד שיכול לעזור.\n\nהשורה התחתונה:  בתיאוריה זה יכול להיות מעניין, אבל בתכלס קורס מעיק", "timestamp": 1659045365707}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: (מוקלטות) פשוט מעולה!!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אחרי שעברתי כל מתרגל אפשרי הגעתי למסקנה שעדיף לא לתרגל בכלל. הרצאות+סרטוני עזר של חנה יכסו לכם את כל מה שאתם צריכים.\n\nשעורי הבית: ארוכים, לפחות לי לקחו המוןן זמן אבל חשוב לעשות כי זה תקף ואפשרי לגמרי להוציא 100. חוץ מזה שאלו ממש שאלות סגנון מבחן.\n\nהמבחן: הוגן. אפשר להפציץ אם מתרגלים מספיק. אה ותשימו לב לפרטים הקטנים, ולתשובות מבלבלות, זה עשוי להיות ההבדל בין מרים ממוצע לבין מועד ב.\n\nהשורה התחתונה: מעניין, קצת תובעני ביחס לנק\"ז, אפשר להצליח בו עם מספיק השקעה.", "timestamp": 1659098100367}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אחת ויחידה\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: \nאחלה מתרגל, מסכים עם האחרים שהתרגולים עצמם הם לא הדבר הכי חשוב בקורס אבל כן מאוד כדאי לעבור על סיכומי התרגול שיש באתר כדי ללמוד את דרכי הפתרון.\n\nשעורי הבית: גיליון פעם בשבוע במודל של ~12 שאלות. בהתחלה קצר אחרי זה לוקח כמה שעות (ראו שורה תחתונה)\n\nהמבחן: בסמסטר שלנו היה לא מאוד קשה. צריך לפתור הרבה מבחני עבר ויהיה בסדר. תוודאו שאתם יודעים בידיוק איך לפתור כל תרגיל מתרגילי העבר (שנראים ברמה הגיונית).\n\nהשורה התחתונה: קורס מתעתע.. מתחיל מאוד ידידותי ונראה שדומה לתיכון ואז מגיעים לאמצע פלוס ונהיה קשה.\nתצפו לזה ואל תתרגלו שגיליון לוקח שעה.\nממליץ כבר לקראת הסוף להחליט על דף נוסחאות, לעבוד איתו ולהוסיף כל מה שצריך.\nקורס מעניין", "timestamp": 1661073809338}, {"author": "Nicole Abramenkov", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: כל אחד יודע להגיד שההרצאות של חנה נהדרות, הכול מובן וברור ומסודר. מי שכותב על טאבלט יכול להנות מרשימות ההרצאה שחנה מפרסמת מראש למודל להביא לשיעור.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: סשה מלמדת את התרגולים בצורה נורא מסודרת ולעניין ובלי להתפזר\n\nשעורי הבית: לא קלים, מומלץ לעבוד בזוגות, ככה לומדים יותר :)\n\nהמבחן: שונה משיעורי הבית בעליל, אם פתרון לוקח לכם יותר מארבע שורות אתם לא בכיוון (לעומת שיעורי הבית). המבחן הוגן, ונוטים לתת פקטור על מנת לנרמל את הממוצע.\n\nהשורה התחתונה:", "timestamp": 1666264478363}, {"author": "****", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמי שראה יודע, חנה מרצה פשוט מעולה, יודעת את החומר ולהעביר אותה ברמה פנומנלית ואין מה להרחיב כי אין מה לבחור אופציה אחרת כשיש את חנה.\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: \nמעביר את התרגולים ממצגות, מאוד קשה לעקוב אחריו לדעתי הוא פשוט הסתדר לי הכי טוב במערכת אבל בדיעבד נראלי אם היה עדיף פשוט לעבור על המצגת בעצמי ולהבין.\nשעורי הבית: \nרובם לא קלים, מי שמשקיע בהם במהלך הסמסטר אבל יכול להפציץ במועד א.\nהמבחן: \nמועד א לדעתי היה קשה וגם היה פקטור בהתאם, מועד ב יותר סביר פשוט צריך לתרגל מלא מלא מבחנים.\nהשורה התחתונה: \nאם מבינים את מה שהולך אז הקורס מאוד מעניין, מי שלא תמיד על החומר אז יכול לצבור פערים.", "timestamp": 1666767806968}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: סשה בקמן\nחוות דעת - הרצאות: היה סבבה עד שסיימנו את החומר של התיכון, אחר כך קצת פחות ברור מבחינת הסברים ולקראת סוף הסמסטר עברתי להקלטות של חנה (מומלצת מאוד אבל לא הסתדר במערכת)\n\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: מיותר לחלוטין. לא הגעתי אחרי 3-4 תרגולים כבר וממש לא צריך את זה בשביל המבחן.\n\nשעורי הבית: לא פשוטים, זו לא בושה לרפרנס. השאלות מהמבחנים לא דומות אז זה לא כל כך משנה לדעתי.\n\nהמבחן: גרוע כי הוא אמריקאי אבל אפשר להצליח ולקבל ציון ממש טוב, חשוב להכין דף נוסחאות טוב/ להוסיף דברים משלכם לדף קיים, פתרונות לשאלות שחוזרות על עצמן ממששש עוזרים מומלץ ביותר. חוץ מזה לפתור הרבההה מבחנים לפני כן.\n\nהשורה התחתונה: מעצבן שהקורס עצמו והמבחן לא הכי קשורים, אבל בסך הכל אפשר להצליח על אף זאת ולהוציא אחלה ציון.", "timestamp": 1667160090435}, {"author": "anon 14", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הסמסטר היה אצל חנה כמעט 350+ סטודנטים (לפחות... שלא לדבר על סטודנטים שנכחו בזום) ובכל זאת ניסתה לעזור לכולם ולענות על השאלות. גם הייתה פעילה המון בפורום ועזרה הרבהה! היא פשוט מדהימה.   \n\nשם המתרגל/ת: ג'וליאן נורדי\nחוות דעת - תרגולים: נתן טיפים ועזר הרבה, ובפרט בשעות הקבלה. התרגולים קצרים מדי אז לא היה מספיק את הכל אבל כן היה משתדל להעביר את המסר בצורה הכי ברורה שיש למרות שההרצאות היו בפיגור. הרבה סטודנטים מעדיפים לא ללכת התרגולים. שווה לנסות כך וכך ואז להחליט. \n\nשעורי הבית: הגליונות 1-5 יחסית בסדר. אחר כך זה נהיה יותר ויותר קשה ודורש השקעה. לדעתי כן חייבים להשקיע בתרגילי הבית כי הם חשובים להטמעת החומר. \n\nהמבחן: טריקי. הממוצע משקף את זה (53). מה שעזר לי זה שהמבחן אמריקאי וזה סוג של רמז. הסמסטר כמעט 3 או 4 שאלות התעסקו בהונשא האחרון שלמדנו. שזה הרבה! אבל אין מה לעשות... צריכים להבין כל דקות. \n\nהשורה התחתונה: לדעתי \"לפתור כמה שיותר מבחנים בלי לחזור על החומר\" זה שקר. חייבים להבין לעומק מה כל דבר אומר וכן לחזור על התרגולים והחומר. אחרת יכולים לשנות את סגנון שאלות המבחן ותופתעו (לרעה)...", "timestamp": 1675175445323}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חנה מרטיסאקינן\nחוות דעת - הרצאות: מלכה מלכה מלכה!!!\nללכת רק אליה.\n\nשם המתרגל/ת: לא הלכתי לתרגולים\nחוות דעת - תרגולים: אפשרי מאוד להצליח בקורס בלי תרגולים - מומלץ ללכת אם רוצים לדעת איך פותרים תרגילים, אבל יותר מלמד וכיף לפתור בעצמך את שיעורי הבית.\n\nשעורי הבית: לא עמוסים מדי, אבל חלקם ברמה גבוהה ודורשים הבנה של החומר.\nאם לא מצליחים, לרפרנס בשביל ציון טוב כי הם תקפים.\n\nהמבחן: אם יורם המרצה האחראי, מזל טוב, קיבלתם מבחן קל ופקטור שמן.\nתעברו טוב על החומר לקראת המבחן ותתרגלו מבחני עבר.\nהמבחנים קלים אבל אמריקאים, אז צריך להיות מרוכזים בבחינה עצמה.\n\nהשורה התחתונה: תלמדו טוב ותפציצו במבחן, אפשרי לגמרי אם מתרגלים מבחני עבר.", "timestamp": 1675408538562}, {"author": "מישל", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: חנה בזום\nחוות דעת - הרצאות: חנה מרצה טובה, בגלל שכולם הולכים אליה אין מקום לשבת באולם וזה חבל. מזל שיש הרצאות מוקלטות שלה מסמסטרים קודמים (וגם בסמסטר הנוכחי היא העבירה בזום והקליטה בנוסף לפרונטלי, וזה לא מובן מאליו).\n\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: פחות מומלץ. באופן כללי אין לקורס מספיק תרגול ביחס לכמות החומר שעובר בהרצאות. \n\nשעורי הבית: מעל רמת המבחן אבל עוזרים להבין את החומר אם מתעקשים לפתור הכל.\n\nהמבחן: 12 שאלות אמריקאיות. שאלות טריקיות עם ניסוחים מבלבלים שפחות בודקות ידע והבנה ויותר בודקות קריאה בין השורות. \n\nהשורה התחתונה: קורס קשה, עם מבחן קשה בלי מספיק תרגול. צריך להשקיע הרבה מהשבוע הראשון כדי להצליח", "timestamp": 1675622382751}, {"author": "סטודנטית מן המניין", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה טובה וניכר כי אוהבת את הפיסיקה. די מונוטונית ולדעתי מרחיבה יותר מדי על נוסחאות ודברים שמרגישים לא רלוונטים אחרכך למבחן. הייתי רואה אותה בהקלטות במבט אחורה. \n\nשם המתרגל/ת: אין. \nחוות דעת - תרגולים: כל המתרגלים היו לא משהו בכלל. שעת תרגול אחת לא מספיקה ללימוד הנושא, השתמשתי בהקלטות של רון בסלר. \n\nשעורי הבית: מאוד קשים ולוקחים הרבה זמן, כדאי להיעזר ברפרנס אבל חשוב מאוד להבין את הנושאים ולא לדחות לסוף סמסטר כי אין זמן המבחן תמיד ישר אחרי סוף סמסטר. \n\nהמבחן: מבחן קשה ומאוד טריקי. \n\nהשורה התחתונה: תראו את חנה בהקלטות ותשקיעו בלהבין את השיעורי בית ואת החומר הנלמד. הייתי מתחילה לפתור מבחנים כבר בשלב די מוקדם כי השאלות מהמבחנים ברמה יותר קלה מהשיעורי בית וזה מה שרלוונטי בסוף. קורס לא משהו בכלל.", "timestamp": 1675763349231}, {"author": "Y", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מרטיסק\nחוות דעת - הרצאות: חנה מרצה מצוינת, יש במודל סרטונים מוקלטים שהיא פותרת בהם תרגילים\n\nשם המתרגל/ת: נירית\nחוות דעת - תרגולים: תרגולים טובים, קצת לא מסודר\n\nשעורי הבית:  השיעורי בית יותק קשים מהמבחן ומכינים ממש טוב למבחן בגלל זה...\n\nהמבחן: המבחן לא פשוט, אמריקאי אז אין נקודות על הדרך פתרון וכו' צריך לשלוט בחומר\n\nהשורה התחתונה:", "timestamp": 1675880622358}, {"author": "0", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ד\"ר חנה מרטיסקאינן\nחוות דעת - הרצאות: מעולה. מסבירה את החומר בצורה ברורה ונותנת אינטואיצייה לחומר. ההרצאות שלה עמוסות יחסית במיוחד בתחילת הסמסטר לכן מומלץ להגיע מוקדם. למי שרוצה יש גם הקלטות שלה.\n\nשם המתרגל/ת: ג'וליאן נורדי\nחוות דעת - תרגולים: באופן כללי התרגולים מאוד קצרים- רק שעה ולכן לא מספיקים לעבור על הרבה תרגילים. היו מעט סטודנטים בתרגול ולכן היה אפשר לשאול הרבה שאלות.\n\nשעורי הבית: דורשים זמן ולעיתים מאתגרים. מומלץ להסתכל על רפרנסים או ללכת לשעות קבלה של חנה/מתרגלים כשלא מבינים את החומר או תרגילים מסויימים כדי לא לצבור פער בחומר\n\nהמבחן: המבחן הוגן - שאלות של ברורות או קשות כולם לא מצליחים ולכן אין צורך להילחץ, יש כמעט תמיד פקטור. מאוד מומלץ לפתור הרבה מבחנים מראש כי המבחן נורא חזרתי.\n\nהשורה התחתונה: חנה מעבירה את החומר מעולה כיף גדול למי שאוהב/ת פיזיקה :) לא לפחד מחומר של מבינים ולבוא לשעות קבלה.", "timestamp": 1676104359830}, {"author": "מישל", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הרצאות מרתקות; מרצה באופן ברור לא וואו\n\nשם המתרגל/ת: נירית אסף ורון בסלר מהאינטרנט\nחוות דעת - תרגולים: אין מספיק תרגולים וכל המתרגלים לא משהו. הלכתי לשני תרגולים בשבוע במקום אחד כדי להבין טוב יותר, הם גם לא עוזרים בפיתרון שיעורי הבית\n\nשעורי הבית: עמוסים רצח אבל ממליצה לעשות לבד הכל כי זה בערך הדבר היחיד שגורם להבין את החומר\n\nהמבחן: \nקשה מאוד אבל בסוף פתיר. תתרגלו מלא מלא מבחנים ותדברו את הראש על שיעורי הבית\nהשורה התחתונה: הקורס האהוב עליי בסמסטר בזכות ההרצאות והחומר אבל המתרגלים ממש לא טובים. ממליצה על רון בסלר מהאינטרנט ותתחילו להתכונן מוקדם למבחן", "timestamp": 1676313082700}, {"author": "נעם גולדמן", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מרטיסיקיאן.\nחוות דעת - הרצאות: \nהמרצה הכי טובה, משקיעה את הנשמה שלה בהרצאות ובכללי בסטודנטים. אפשר גם לשמוע הקלטות שלה משנים קודמות, ביחד עם הרשימות הרצאה שלה וככה לא צריך לסכם. בקיצור ללכת רק אליה.\n\nשם המתרגל/ת: רון בסלר מוקלט.\nחוות דעת - תרגולים: \nיחסית לשאר המתרגלים הפרונטלים הוא טוב, אבל באופן כללי התרגולים לא משמעותיים מידי והעיקר הוא לתרגל בעצמך בשיעורי בית.\nשעורי הבית: \nקשים וחשובים, חובה לעשות בשביל שהחומר יישב.\nהמבחן: \nקשה, אמריקאי וטריקי, לא מקבלים נקודה אם לא הגעת לתשובה הנכונה, אפשר ליפול בהרבה דברים.\nהשורה התחתונה: \nקורס קשה, לא עמוס בטירוף אבל דורש מאמץ וזמן.", "timestamp": 1676357794716}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה, ההרצאות איטיות מידי, למדתי מהקלטות שלה על מהירות 1.5 מומלץ ממש! היא מסבירה דברים באופן מובן ממש.\n\nשם המתרגל/ת: אף אחד\nחוות דעת - תרגולים: החל מהתרגול השלישי הפסקתי ללכת לתרגולים. היה לנו את אסף, נירית וג'וליאן. לא התחברתי לשום תרגול. העדפתי ללמוד לבד..\n\nשעורי הבית: \nקשים וארוכים לפעמים אין ברירה להשתמש ברפרנסים.\n\nהמבחן: \nהיה ברמה סבירה. אפשר לומר שיש שאלות שחוזרות על עצמן. צריך לפתור הרבה מבחנים משנים קודמות.\n\nהשורה התחתונה:  קורס שאפשר להצליח בו, צריך לפתור מלא תרגילים ולהכיר את כל הטריקים הקטנים שחוזרים על עצמם. ותדאגו לעצמכם לדף נוסחאות טוב כי זה עוזר במבחן.", "timestamp": 1676561749942}, {"author": "Meowster", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: \nמאוד מעניינות, חנה יודעת להעביר את החומר בצורה טובה עם המון רגש ועניין.\n\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: \nלא הייתי\nשעורי הבית: \nלוקחים קצת זמן אבל כדאי לפתור אותם גם כי זה ציון תקף וגם כי זה עוזר בתרגול למבחן.\nהמבחן: \nמבחן די הוגן, יורם גם פינק בפקטור מטורף.\n\nהשורה התחתונה: \nקורס חובה אז אין כזה מה להגיד אבל אם לוקחים אותו עם חנה ורואים גם הקלטות של רון ברסלר יהיה כיף.", "timestamp": 1676651394079}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה מרטיסיקיאן \nחוות דעת - הרצאות: מרצה מצוינת, אוהבת ללמד ואוהבת את התלמידים ויודעת להעביר את החומר בצורה מעולה.\n\nשם המתרגל/ת: אסף דירינגר\nחוות דעת - תרגולים: אחלה אסף, קצת רץ אבל למי שעוקב בחומר הוא מצוין.\n\nשעורי הבית: עמוס, צריך להשקיע זמן.\n\nהמבחן: \nיורם די זרק על הסטודנטים במבחן, אתם יכולים לראות את זה בחציון והממוצע הנמוכים ביותר למועד א ב15 השנים האחרונות.\nשאלות שמתרגלים הסכימו שהניסוח נותן עבורן יותר מתשובה אחת, כאשר רק אחת התקבלה בפתרון הסופי. פתרון רשמי שמפורסם באתר ומשתמש בדברים שלא למדנו.\nיורם נפנף את תלונות הסטודנטים על שאלות מכשילות ב\"גם ככה אתן לכם פקטור אז מה זה משנה\". \nייאמר לזכותו שאכן נתן פקטור אבל הזלזול בטענות הסטודנטים המוצדקות מעורר זעם.\n\nהשורה התחתונה: קורס חובה, חנה הפכה אותו לכיף במהלך הסמסטר, יורם הפך אותו לזוועה בשלוש שעות של מבחן בסוף הסמסטר.", "timestamp": 1677007040094}, {"author": "סטודנט כלשהו", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ד\"ר חנה מרטיסקאינן\nחוות דעת - הרצאות: \nההרצאות באמת ממש טובות, עוברות על כל נקודה בחומר ובאמת מעניינות ומקיפות. ההרצאות המוקלטות משנים קודמות גם הן באיכות ממש ממש טובה. חנה דואגת לוודא שממש כולם מבינים ולענות על כל השאלות.\nשם המתרגל/ת: אסף דרינגר\nחוות דעת - תרגולים: \nלא הייתי בתרגולים - אבל המצגות של התרגול כתובות היטב ומתמצתות את החומר בצורה מאוד טובה וברורה.\nשעורי הבית: \nשיעורי הבית באמת מכינים לקראת המבחן האמיתי בסוף - אז ממש כדאי להשקיע בהם. הם לא קשים (המורכבים יותר לקחו בין שעה ל3 שעות גג), במיוחד אם דואגים לעבור בקפידה על ההרצאות והתרגולים - מה שמועבר שם זה בדיוק מה שבתרגילי הבית.\nהמבחן: \nמבחן מאוד הוגן - אין משהו מפתיע, באמת כל מה שהיה בהרצאות הופיע, התרגילים מתרגילי הבית לפעמים חזרו במבחנים - ובטוח כל שאלה היא בקונספט של שאלה כלשהיא מהתרגילי בית. המבחנים משנים קודמות לא שונים במיוחד אז אפשרי להיתכונן לסגנון ולבוא מוכנים.\nהשורה התחתונה: \nבאמת קורס סבבה, אין ממה להילחץ, רק לבוא להרצאות ולשבת על שיעורי הבית (לא לרפרנס כי באמת שזה בול מה שיופיע במבחן) - וממש ממש ממש מומלץ לבוא לשעות הקבלה גם אם אין במיוחד שאלות רק כדי להקשיב או לחזור על החומר.", "timestamp": 1677162141053}, {"author": "הלורד", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מפוצצות ובצדק!\nחנה מרצה מדהימה\n\nשעורי הבית: גליון פעם בשבוע ולרוב השאלות יש רפרנס\n\nהמבחן: אמריקאי. אם מתרגלים מספיק מבחנים אין סיבה לא לקבל ציון גבוהה\n\nהשורה התחתונה: בשביל חנה נלך גם לפיסיקה 2", "timestamp": 1678378063663}, {"author": "אביב בנימין", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: תותחית שמשקיעה בסטודנטים\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: הייתי אצלו לתרגול אחד בלבד.\nלא ממליץ. מה שכן שעות הקבלה של חנה זה הדבר שהציל לי את הקורס. יותר אפקטיבי ומעמיק מכל תרגול שיש\n\nשעורי הבית: קשים\n\nהמבחן: אם לא תשלח איך תקח\n\nהשורה התחתונה: תצברו לכם מזל לפני שאתה ניגשים למבחן האמריקאי", "timestamp": 1678623153121}, {"author": "נעם גולדמן", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: חנה הכי טובה אין בכלל שאלה. יש לה הקלטות ככה שאפשר לשמוע אותם בכפול שתיים ולא צריך להיאבק על מקום באולם הרצאות. בנוסף לא צריך לסכם כי יש את רשימות ההרצאה שלה.\n\nשם המתרגל/ת: רון מוקלט.\nחוות דעת - תרגולים:  עברתי כמה מתרגלים, כולם לא היו טובים כ\"כ, רון מוקלט הוא הרע במיעוטו. ובכל מקרה התרגולים לא כ\"כ משמעותיים (קצרים, ולא מספיקים כלום).\n\nשעורי הבית: חשובים להפנמת החומר\n\nהמבחן: אמריקאי מעצבן, טעות חישוב קטנה והלך כל התרגיל. אבל מצד שני היה פקטור רציני (כעשרים נקודות) ככה שאין תלונות.\n\nהשורה התחתונה: קורס קשה, לומדים את החומר מהר וצריך לשים לב שעומדים בקצב", "timestamp": 1678668712749}, {"author": "נ", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים. לא כדאי לעשות לבד\n\nהמבחן: קשה מאוד מאוד\n\nהשורה התחתונה: לעשות רק אם חייב", "timestamp": 1678879843378}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nחנה המרצה שהופכת את הקורס הזה לבסדר. מנסה לעזור בכל דרך - בין אם זה בשעות קבלה, בהרצאה עונה כמה שאפשר, מעלה סיכומים למודל. חד משמעית ללכת אליה, יש כמה פיתוחים מתמטיים שמראים בהרצאות שפחות רלוונטים, אבל יש תרגילים שחנה פותרת שהם עקרונות שחוזרים על עצמם תמיד.\nחנה מרצה מדהימה!\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \nמיותרים לדעתי, קצרים מדי ולא אפקטיביים. אפשר לראות תרגולים של רון ביוטיוב למי שרוצה.\n\nשעורי הבית: קשים, אבל יש הרבה רפרנסים. קשים יותר מהתרגילים במבחן.\n\nהמבחן: אם לוקחים את הקורס עם יורם, יהיה פקטור כמעט בוודאות. המבחן אמריקאי, מה שבהתחלה יכול לגרור טעויות טיפשיות, אבל אם מתרגלים כמה מבחנים מתרגלים לעניין ואפשר להוציא ציון גבוה.\n\nהשורה התחתונה: לכו לחנה ויהיה טוב", "timestamp": 1678956213177}, {"author": "ITZIK", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מלכה אין מה להגיד, מעבירה תחומר בצורה ברורה וגם אחלה בן אדם\nראיתי הקלטות שלה כי הכיתה הייתה מלאה בקטע מגעיל וגם היה לי יותר נוח ללמוד בזמנים שלי\n\nשם המתרגל/ת: מצאתי מתרגל ישן בפונטפטו לא זוכר איך קוראים לו, אחרי שהייתי רואה את התרגולים שלו הייתי פותר את התרגילי כיתה של התרגול כי הם די מסכמים את הנושא\nחוות דעת - תרגולים: לא ידוע עד כמה זה הכרחי\n\nשעורי הבית: די קלילים\n\nהמבחן: לא מבחן קשה, פשוט קצת הרבה נושאים אבל אם נמצאים על החומר במהלך הסמסטר אפשר ממש להצליח, מה גם שהמבחן אמריקאי והשאלות ממש קצרות (לחישוב) אז אין גם לחץ של זמן\nתמצאו דף נוסחאות בדרייב ותלמדו איתו (אפילו מתחילת סמסטר) יחסוך לכם הרבה כאב ראש\n\nהשורה התחתונה: קורס חמוד מאוד, בגלל שהיו הרבה נושאים לא באמת למדנו לעומק משהו סתם שיננו נוסחאות כמו קופים (בגלל זה המבחן גם לא קשה) אבל אני מניח שזו המטרה - להיחשף לכמה שיותר נושאים ומי שרוצה יכול לקחת קורסי המשך", "timestamp": 1679089916020}, {"author": "מאיה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nתותחית!!! משקיעה ממש בתלמידים, מובנת ומעניינת.\n\nשם המתרגל/ת: נירית\nחוות דעת - תרגולים: \nלא מאוד מובנת, אבל עונה על שאלות\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679327931272}, {"author": "11", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאין צורך להרחיב, המרצה הכי טובה בטכניון! מסבירה טוב ומאוד דואגת לסטודנטים למרות שזה קורס ענק (לדוגמא שעות קבלה שלה יכולות להימשך שעתיים בכיף, אפשר לקבוע איתה במייל שעת קבלה פרטית)\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nנירית, מסבירה בסדר אבל מאוד מנסה לעזור ולהסביר.\nשעורי הבית: \nקשים, מרופרנסים טוב בדרך כלל\nהמבחן: \nקשה, אם יורם מרצה אחראי הניסוחים שלו לא ברורים יותר מדי... אבל פיצו על זה בפקטור נדיב מאוד\nהשורה התחתונה: \nקורס חובה אבל די מעניין, חשוב להשקיע ולהשקיע בשיעורי בית", "timestamp": 1679516439438}, {"author": "מעריץ אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nגיבורת העל הבלונדינית שלי, לא רק שהיא מתנדבת בחילוץ והצלה ובנוסף אזרחית למופת היא גם המרצה הטובה בטכניון בפער. מעבירה את החומר בצורה מסודרת וברורה בקצב טוב ובחן רב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nצפרדע מוטנטית וקשת הכלבה הכלבה סהכ מאוד יצירתיים בשאלות כפי שניתן לראות, קורס בזואולוגיה מומלץ לפותרים.\n\nהמבחן: \nיורם מרכיב שאלות רנדומליות עם תשובות עוד יותר רנדומליות, כמות המיילים שנשלחו אחרי המבחנים משתווים למספר אבוגדרו ולפקטור בקורס. סהכ סביר לא מעבר.\n\nהשורה התחתונה:\nאין על חנה משוש חיי היפה בנשים והסיבה שבגללה אני קם בבוקר.\nנ.ב \nמי שהבין מה זה תנ\"ז היט מי אפ", "timestamp": 1680081625832}, {"author": "המלך", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: וואו, אין מילים. דמות מלאך בבלונד. ברורה מאוד, מסודרת מאוד. יש לה רשימות מצוינות במודל, כל הסטודנטים עוברים להרצאות שלה, אפשר לראות בפנופטו על כפול 2 ולחסוך זמן.\n\nשם המתרגל/ת: נירית מרזל\nחוות דעת - תרגולים: תרגולים מעט מיותרים, הלכתי לקראת הסוף לחידוד, נוטה להתפזר לשאלות מיותרות של סטודנטים ולרוב לא מספיקה הרבה.\n\nשעורי הבית: 10 גליונות מתוך 12, משבוע 5 נהיים יותר מסובכים.\n\nהמבחן: יורם שיבדל לחיים ארוכים, מבחן הזוי, המון טעויות. אחרי מועד ב קיבלנו 5 מיילים על תיקון לשאלות, פקטור עצום של 17 נק.\n\nהשורה התחתונה: אחלה קורס, מי שיכול עדיף 1 לדעתי.", "timestamp": 1680166787911}, {"author": "..", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "איכס מיותר, מי שלא חייב שיתרחק מפיזיקה", "timestamp": 1685450126773}, {"author": "מישהו", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה!!!\nחוות דעת - הרצאות: מדהימה, יש הכל במודל, הרצאות, רשימות, מה שלא תרצו. היא עונה לכל שאלה גם במודל וגם פנים מול פנים. בהרצאות עושים תרגילים שמופיעים בתרגילי הבית (לפעמים פשוט מספרים אחרים), הכל ממש לעניין, הכל מאוד פייר. \n\nשם המתרגל/ת: ניסיתי את כולם \nחוות דעת - תרגולים: הדבר היחידי שטוב במתרגלים בקורס, זה שיש הקלטות של רון בסלר. אני לא מרגיש שהתרגולים תרמו לי בכלל.\n\nשעורי הבית: פיירים לגמרי. \n\nהשורה התחתונה: ממליץ, הולך לעשות פיזיקה 2 אבל רק עם חנה.", "timestamp": 1688568558363}, {"author": "לא אוהב פיזיקה", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: סשה\nחוות דעת - הרצאות: סשה מרצה מעולה, רוב הסטודנטים מעדיפים ללכת לחנה מה שגורם לכך שההרצאות של סשה הרבה יותר אינטימיות, היה בממוצע פחות מ20 סטודנטים בכל הרצאה. בעיני זהו יתרון אדיר שכן כך יש הרבה יותר מקום לשאול את המרצה שאלות. בנוסף סשה מרצה יחסית טובה, והיא אחלה בנאדם. ככה שמאוד מומלץ למי שיכול ללכת אליה.\n\nשם המתרגל/ת: (ד״ר) אסף \nחוות דעת - תרגולים: אסף תותח, בקורס היו תרגולים של שעה, מי שהגיע מוכן לתרגול הבין מה שהולך שם. אסף עונה על שאלות לאחר התרגולים ואפילו נשאר הרבה מעבר למה שהוא צריך להשאר כדי לעזור לסטודנטים. סך הכל מתרגל מצוין, אך סיים את הדוקטורט שלו ולכן כנראה לא יתרגל בקורס הקרוב.\n\nשעורי הבית: מתחילים ממש קל, אך ברגע שמגיעים למסה משתנה נהפכים לקשים מאוד (בעיני לפחות), לקחו לי בממוצע 6-8 שעות לעשות והיו 13 גיליונות במהלך הסמסטר. בעיני עזרו מאוד להבין איך לענות על שאלות.\n\nהמבחן: לא היה עוד \n\nהשורה התחתונה: קורס קצת עמוס אך בסך הכל לא כזה נורא.", "timestamp": 1688721639108}, {"author": "Mayar Sussan", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הרצאות פגז! חנה מהממת, מעבירה את ההרצאות בצורה מאוד מעניינת, המוקלט שלה מאוד ברור והיא מקליטה הכל!! ממליצה בחום. הייתי במגמת פיסיקה בטיכון ואפשר להגיד שזה עזר מאוד, אבל חנה מלמדת בצורה שגם מי שאין לו רקע חזק יכול להבין.\n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: הייתי בהתחלה אצל מתרגל אחד שהקריא משקופית, זה היה מזעזע, וממש לא התחברתי לרון, הוא באמת משתדל שכולם יבינו עד לרמה מאוד מאוד בסיסית כך שזה מרגיש איטי מדי.ֿ במקום תרגולים ממליצה לראות את הסרטוני עזר של חנה, שם היא פותרת תרגילים לפי נושא ברמת מבחנים בצורה מאוד ברורה, היא גם פותרת בדרכים שונות את אותו תרגיל ותמיד מדגישה על טעויות נפוצות בתרגיל, לדעתי עדיף על בזבוז זמן בתרגולים, כי גם כן חנה לפעמים פותרת שאלות מהתרגול בהרצאה.\n\nשעורי הבית: \nלא כל כך קשים אבל בהחלט לא ברמת מבחן, מומלץ לרפרנס. \n\nהמבחן: המבחן עוד יומיים, אך מפתירת מבחנים משנות קודמות אני יכולה להגיד שלא קשה לקבל ציון טוב, רק מומלץ לפתור הרבה מבחנים כי יש שאלות שחוזרות על עצמם .\n\nהשורה התחתונה: קורס נחמד למדי, לא עמוס מבחינת שיעורי בית אם מרפרנסים, וממבחנים קודמים אפשר לשאר הצלחה.", "timestamp": 1689662956092}, {"author": "NONE", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מושלמת. אחת המרצות הטובות בטכניון. רק לא מפרגנת בפקטור :(\n\nשם המתרגל/ת: רון בסלר מוקלט\nחוות דעת - תרגולים: רון מאוד משקיע וסופר מעניין, אבל בגלל לפעמים מרגיש שיותר חשוב לו המוקלטות באתר וביוטיוב שלו\nמאשר הסטודנטים בסימסטר עצמו, ולפעמים זה נותן וייב שמנסה יותר מדי להיות להיות כוכב רשת. ובכל זאת אסיים בזה כן הופך את התרגולים ליותר מעניינים ושבסוף אין אלטרנטיבה יותר טובה ממנו.\n\nשעורי הבית: שבועיים, לא פשוטים בכלל. יש רפרנסים אבל מאוד כדאי לפתור כדי לא לטבוע בתקופת מבחנים.\n\nהמבחן: לא פשוט אבל לא קשה מדי, חנה לא מפרגנת בפקטור בכלל ואישית מאמין שהגיע לנו הסימסטר יותר. הרגיש מבחן יותר קשה מסימסטר קודם, הם קיבלו 20 ואנחנו 8 - וזה ניכר בממוצע.\n\nהשורה התחתונה: חנה מרצה מושלמת.", "timestamp": 1690299694272}, {"author": "דבקה", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה (מוקלט)\nחוות דעת - הרצאות: חנה מרצה מעולה, לא התאפשר לי להגיע לפרונטלי אז ראיתי את כל הקורס במוקלט.\n\nשם המתרגל/ת: רון בסלר (מוקלט)\nחוות דעת - תרגולים:  במהלך הסמסטר לצפות במוקלט זה פתרון לא רע, אבל כהכנה למבחן לדעתי רון לא מסביר מספיק טוב. הרבה בלאגן בתרגולים ולפעמים מרגיש שהוא מנסה הרבה יותר מידי לעשות דברים \"לא שיגרתיים\" בתרגולים לרמה שזה לא תורם ללימדה אלא מפריע ומציק. יאמר לזכותו שהוא משקיע מאוד והאתר שלו פתוח לכולם שזה ממש לא מובן מאליו.\n\nשעורי הבית: תרגיל בית במודל פחות או יותר פעם בשבועיים, רובם סבירים חוץ ממסה משתנה ותנ\"ז, אבל עדיף לא לרפרנס אלא אם כן חייבים אחרת זה סתם בזבוז זמן ותצטרכו לחזור על כל החומר מאפס בתקופת מבחנים. \n\nהמבחן: היה מבחן קשה אבל לדעתי הוגן. חנה עושה מבחנים כאלה, קשים אבל איך שהוא הוגנים והיא לא מפקטרת כמו יורם.\n\nהשורה התחתונה: ההמלצה הכי טובה שיש לי היא לעקוב ולהיות עם עם יד על הדופק במהלך הסמסטר ובסוף הסמסטר לעשות פק\"ל של ערן אברהם שיסדר לכם את הראש (לדעתי חובה).", "timestamp": 1691071668224}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמרצה טובה, קצב טוב, אבל כיתות עמוסות. כמו שנכתב כאן כבר, מומלץ.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: \nמשתמש במצגות אז לא תמיד יש זמן לסכם, אבל מתרגל טוב סה\"כ. \n\nשעורי הבית: לא קשים במיוחד כשמבינים את הדרך.\n\nהמבחן: לא קל. יש דפי נוסחאות מוכנים, אז למי שאין הרבה זמן לפני המבחן לא ממליץ להכין לבד, מנסיון. \n\nהשורה התחתונה: חומר מעניין למי שאהב פיזיקה בתיכון, אבל מתעמקים בו הרבה יותר מבחינת הוכחת נוסחאות.", "timestamp": 1691488870905}, {"author": "Lior Katz", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה מאוד מאוד טובה, היא דואגת לתת דוגמאות לכל דבר וגם פותרת שאלות בכיתה שעוזרות להתמיע את החומר. אם צריך היא עונה לשאלות בהפסקה וגם יש פורום במודל (לא השתמשתי אף פעם אבל אומרים שהיא עונה מהר ועוזרת מאוד). היא גם עושה זום ומעלה את כל ההקלטות ככה שממליץ לפחות לראות את זה למי שלא מגיע להרצאות.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: הלכתי לכמה תרגולים הראשונים של רון בסלר בהמלצת חברים מסמסטר שעבר, ולאחר שינוי במערכת חשבתי לעבור לראות את ההקלטות שלו אבל לא הצלחתי להבין איזה הקלטות אני צריך לראות (יש בפלייליסט ערבוב של כל מיני סרטונים מסמסטרים קודמים גם) ובכללי הרגשתי שהתרגולים לא כל כך עוזרים. תרגול של שעה על 3 שעות הרצאה, ובנוסף רון אוהב לעשות כל מיני גימיקים בתרגולים שלו אז הרגשתי שאין טעם לראות את זה והפסקתי. מה גם שחנה פותרת תרגילים בהרצאה אז לא הרגשתי חוסר.\n\nשעורי הבית: גיליון כל שבוע. בדרך כלל הייתה שאלה או שתיים שקצת תקעו אותי (יש רפרנסים לכמעט הכל אבל התקשתי להבין איפה הבעיה בפתרון שלי). הגליונות בסוף הסמסטר שהיו אמורים להיות על נושאים קשים יחסית (מערכות מסתובבות, יחסות וכו') דווקא הרגישו לי הרבה יותר קלים מהקודמים ככה שלא היה נורא להתמיד במהלך הסמסטר. הגליונות גם נותנים ציון תקף ומכינים למבחן ככה שכדאי מאוד לעשות.\n\nהמבחן: מבחן די סטנדרטי, מבחנים משנים קודמות ושיעורי בית הכינו בצורה די טובה. השאלות במבחן דומות ברמה לאמצע הגליון, נגיד שאלות 6-9, ופחות לשאלות בסוף הגליון. החסרון הוא שהמבחן אמריקאי ככה שאפשר להתבלבל כמה פעמים נורא בקטנה ולקבל 75.\n\nהשורה התחתונה: קורס אחלה למי שאוהב פיזיקה. לא נתקעים הרבה זמן על אותו נושא לכן כדאי להזכר קצת מראש בחומר של התיכון ולא לצבור פערים בהרצאות.", "timestamp": 1694434654103}, {"author": "צפרדע מוטנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חנה (מוקלט מסמסטר שעבר)\nחוות דעת - הרצאות: בין המרצות האיכותיות והאכפתיות שהיו לי עד כה. יש גם פורום שאלות ותשובות שחנה ואלכסנדרה עונות שם לשאלות, וזה לא מובן מאליו. באמת קיימת השקעה מאוד גדולה מצד הסגל.\n\nאני כן חושב שיש קצת נפילה ברמת הפורמליות והדגשים על התנאים המדוייקים של חלק מהנוסחאות, אבל זה יותר בעיה של הקורס מאשר של המרצה. אישית הייתי רוצה שיהיה דגש על דרך נכונה מאשר רק תשובה סופית נכונה.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: אסף גם משקיע בתרגולים שלו, אבל לא הרגשתי שהם יותר מדי מועילים. עדיין, שווה בעיניי לקרוא את התרגולים המודפסים, הם מאוד איכותיים.\n\nשעורי הבית: קצת קשים, אבל גם הגיליונות הכי קשים לא לוקחים יותר מיום. לא ממליץ לרפרנס על עיוור, השאלות בתרגילי בית כן משקפות את הרמה במבחן (וחלק קצת קשות יותר).\n\nהמבחן: לא הייתה שאלה על מסה משתנה ועל כן אני שמח.\n\nהשורה התחתונה: זה כן קורס די קשה בעיניי, שמתגמל יותר טחינה של שאלות עבר מאשר הבנה מעמיקה, אבל סה\"כ היה בסדר.", "timestamp": 1695925370003}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חנה (מוקלט)\nחוות דעת - הרצאות: ראיתי את ההרצאות של הסמסטר הנוכחי שחנה העלתה תוך כמה שעות לאחר ההרצאה הפרונטלית, היא מרצה מהממת, מסבירה את החומר בצורה מעולה\nיש גם פורום שחנה עונה על השאלות ומאוד משקיעה (תשתמשו בו הוא עוזר)\nלגבי ההרצאות עצמן: לרוב הן פיתוח נוסחאות וגם כן אינטואיציה (לדעתי החלק של פיתוח הנוסחאות די מיותר)\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \n\nשעורי הבית: תקפים ולכן אני אישית ניסיתי לפתור אבל אם לא הצלחתי ישר השתמשתי ברפרנס (לא נתקעתי יותר מדי זמן על אותה שאלה) \nלדעתי שיעורי הבית לא קריטיים אבל כן עוזרים אם עושים אותם\n\nהמבחן: בודק את ההבנה של החומר וגם כן דורש תרגול רב\n\nהשורה התחתונה: קורס דורש השקעה במיוחד בזמן המבחן, תפתרו מלא מבחנים ותצליחו :)", "timestamp": 1695987167298}, {"author": "אליהו", "difficultyRank": 3, "generalRank": 4, "semester": "202203", "text": "שם המרצה: סשה\nחוות דעת - הרצאות: \nמרצה טובה בסך הכל, משקיעה ורואים שחשוב לה ללמד.\nלי החומר היה די קשה, חשוב להיות עליו לאורך הסמסטר (במיוחד בהתחלה יש הכנה מתמטית של דברים כמו מד\"ר ומכפלת וקטורים שלא נוגעים בהם בקורסי המבוא המתמטיים)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשים אך ממוחזרים. 15% תקף, 10 גליונות מתוך 13.\nאפשר למצוא רפרנס ל98% מהשאלות, עם הסבר ופתרון מלא. 12~ שאלות בגליון, גליון כל שבוע (בסמסטר קיץ שני גליונות בשבוע), בין שעה וחצי לשלוש שעות עבודה, תלוי ברפרנסים וכמה אתם מסתדרים עם החומר.\nהמבחן: \nהיה קשה, אז היה פקטור של עשר נקודות. גם אחריו הממוצע הסופי היה 71, קצת נמוך יותר משנים קודמות. היו גם כאלה שסיימו שעה לפני הזמן (אבל רק אחד מהסמסטר קיבל מאה), שזה משהו שלא ראיתי בקורסים קודמים.\nשאלות אמריקאיות, מצד אחד יתרון כי גם אם אתה לא יודע את התשובה אתה יכול לפסול 3-4 תשובות ברוב השאלות. ומצד שני אפשר ליפול על תשובות שדומות לפתרון, התשובות האמריקאיות כן מבלבלות ודומות אחת לשנייה. כל שאלה היא 8 נקודות, שזה רע. עשית 3 טעויות מפגרות, מצאת את עצמך עם 75. באלגברה או באינפי היית עם 88.\nהשורה התחתונה: \nקורס מעניין, לא חייב להשקיע הרבה בש\"ב, כן כדאי להבין מה קורה בזמן ההרצאות כי לוקח זמן לחומר לשקוע.", "timestamp": 1695999901217}, {"author": ",,", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: חנה מהמרצות הטובות בטכניון, מעבירה את החומר בצורה מאוד נוחה ואינטואיטיבית. \n\nשם המתרגל/ת: רון\nחוות דעת - תרגולים: הלכתי רק ב-3 שבועות הראשונות בסמסטר ואז הרגשתי שזה בזבוז זמן, למרות שרון ממש משקיע ומנסה לבוא לקראתנו.\n\nשעורי הבית: גליון כל שבוע, קשים, לא מדד לרמת המבחן, יש ריפרינס לכל שאלה בגליון, לדעתי תפתרו לבד כדי להפנים את החומר.\n\nהמבחן: הוגן, רק שחבל שהניסוח לפעמים מבלבל, ואם טעיתם ב-3 שאלות על הבנת הנקרא\\ טעות נגררת, אז אתם על 74 (בערך),  ואיכשהו חנה הצליחה לדעת איפה הסטודנטים מתבלבלים ובדיוק שמה תשובות לטעויות האלה.וזה בכלל לא משקף את היכולת של הסטודנט בחומר, וגם חנה לא מפנקת בפקטור ולא התחשבה במועד ב' על שאלה 1 בניסוח המבלבל, וזה הפיל רוב הסטודנטים.\n\nהשורה התחתונה: קורס עמוס, קשה לא כיף איתו בסמסטר. אבל חנה אחלה מרצה מבחינת הוראה אז קצת מוריד מהלחץ. יחסית לקורס של 3.5 הוא קורס עמוס", "timestamp": 1696346207141}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה תותחית! מרצה מעולה, מסבירה את החומר ממש ברור ורואים שהיא משקיעה. עונה על שאלות בגובה העיניים ורואים שאכפת לה שכולם יבינו.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: אסף מתרגל טוב, המצגות שלו ממש ברורות והוא מסביר ברור. התרגולים הם רק של שעה ולא מספיקים לעשות מספיק שאלות, לא הרגשתי שהם ממש מועילים או שהם עזרו לי לקראת המבחן.\n\nשעורי הבית: גיליון אלקטרוני פעם בשבוע, להכל יש רפרנס. הגיליונות קשים! לא ממליצה לרפרנס אם לא חייבים כדי שתוכלו להיות על זה במהלך הסמסטר.\n\nהמבחן: המבחן היה הוגן. במהלך הסמסטר לא כלכך הייתי על החומר ובמועד א קיבלתי ציון לא טוב, אבל לקראת מועד ב היה לי זמן לעבור מחדש על תרגילי הבית ולחדד את החומר שלא הבנתי ואז גם קיבלתי ציון טוב במבחן. כלומר אם מבינים את החומר שחנה מלמדת בהרצאות ומצליחים לפתור לבד את תרגילי הבית אז אפשר לקבל ציון טוב.\n\nהשורה התחתונה: חנה מושלמת, החומר קשה, המבחן הוגן.", "timestamp": 1704921845345}, {"author": "לארוצהחדוא.jpg", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: שמה הולך לפניה, מרצה מעולה, מסבירה את החומר בפשטות ובבהירות, נותנת אינטואיציה פיזיקלית בדוגמאות ועונה בשמחה על שאלות. גם יש פורום במודל שחנה עונה שם כל הזמן על שאלות שזה ממש עוזר. החסרון זה הכמויות סטודנטים שבאים להרצאות שלה, ברמה שלפעמים אין זמן לשאלות ויחס אישי זה משהו שקשה לקבל למרות שהיא משתדלת. אז אם לא מסתדר בלוז או רוצים קבוצת לימוד קטנה יותר אז גם סשה ממש אחלה, הייתי אצלה בשעות קבלה והיא מסבירה טוב.\n\nשם המתרגל/ת: נועם דורי\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב וגם קבוצת תרגול קטנה אז תמיד נותן זמן לשאלות. יחד עם זאת, שעה תרגול בשבוע הרגיש לא מספיק, אז יוצא מצב שמנסים לעשות הרבה שאלות כל תרגול פשוט בשביל להספיק אבל לא באמת מתעמקים בדרכי פתרון, מה שתכל'ס משנה בשביל הגיליונות והמבחן, לכן באתי רק לחלק מהתרגולים. אבל זה כן עוזר לסגור פינות וגם זה נוח שהייתה לנועם שעת קבלה ישר אחרי התרגול בשביל לשאול שאלות מגיליונות/מבחני עבר. בתכל'ס אפשרי לדעתי לעבור את הקורס הזה בלי לבוא לתרגולים/לצפות בהם מהזום אבל בסוף זה החלטה אישית.\n\nשעורי הבית:  גיליון במודל כל שבוע של 10 שאלות שעולות ברמת הקושי, חלק מהשאלות קלות על מנת לתרגל הגדרות של מושגים וחלקן יותר מסובכות ומשקפות פחות או יותר את הרמה המצופה במבחן. יש רפרנסים לרוב השאלות וזה מפתה לרפרנס, במיוחד כי ש\"ב זה 20% מהציון (או 15%, תלוי בשנה), אבל לפתור לבד את התרגילים זה לדעתי פקטור מאוד משמעותי להצלחה במבחן, כי השאלות היותר קשות של כל גיליון זה מה שמאפשר להיות על החומר במהלך הסמסטר ולא רק בתקופת המבחנים. אני רפרנסתי חלק מהשאלות הקשות נטו בשביל להגיש בזמן אבל לפני המבחן חזרתי על כל הגיליונות ווידאתי שאני יודע לפתור הכול וזה עזר מאוד בסוף.\n\nהמבחן: אמריקאי, 12 שאלות. בגלל קיצור הסמסטר לא היה פוטנציאל אפקטיבי ומסה משתנה. מועד א' היה הוגן לדעתי, מי שהשקיע והתכונן הוציא ציונים לא רעים בכלל ורואים את זה בציונים. חשוב לשים לב לניסוח ולא ליפול על טעויות חישוב כאלה או אחרות כי יש תשובות שהן טעויות נפוצות שהסגל חושב עליהן וזה יכול להפיל. אי אפשר להמעיט בחשיבות של דף נוסחאות טוב. יש כאלה אחלה בדרייב אבל אני לקחתי אחד והוספתי שם שאלות פתורות בנושאים שאני פחות חזק בהן, והיו במבחן שאלות מאותו נושא שפשוט הצבתי בנוסחאות וזה מה שפתר את כל השאלה. אז תשקיעו בדף הנוסחאות, או לכל הפחות תמצאו אחד טוב ממישהו אחר. וכמובן לחרוש מבחני עבר זה כמעט מיותר לציין.\n\nהשורה התחתונה: קורס מעניין, גם יש לו קשר לעולם האמיתי בניגוד לכל המתמטיקות של סמסטר ראשון, סגל טוב, ומבחן שאפשר להצליח בו. חשוב להיות על החומר במהלך הסמסטר כי יש הרבה ממנו, במיוחד ביחס לקורס של 3.5 נק\"ז, אבל אם תשקיעו ותתכוננו טוב אז אפשר להוציא ציון יפה.", "timestamp": 1713112269332}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלכסנדרה (סשה) בקמן\nחוות דעת - הרצאות: סשה ממש אחלה מרצה, יש כאלה שממליצים רק על חנה אבל אני ממליץ לכם לא לפסול מראש.\nחנה כמובן סופר מומלצת אבל עמוס אצלה והסמסטר היא הייתה בשעות מאוחרות. שתיהן מעלות את הרשימות הרצאה שלהן והסמסטר שתיהן הקליטו את ההרצאות שלהן.\n\nשם המתרגל/ת: ג'וליאן נורדי (ראיתי מוקלט)\nחוות דעת - תרגולים: בשבועות הראשונים של הקורס התרגולים הרגישו לי מיותרים אז לא הלכתי, אבל לקראת הסוף לדעתי חשוב להגיע/לראות הקלטות. ג'וליאן ממש אחלה מתרגל.\n\nשעורי הבית: כל שבוע גיליון במודל, המגן נקבע לפי 9/12 הכי טובים. יחסית הרבה שיעורי בית ל3.5 נק\"ז אבל השיעורי בית ברמה ממש סבירה ועוזרים להבין את החומר.\n\nהמבחן: הוגן לגמרי. אם אתם משקיעים מספיק אז לגמרי אפשר להפציץ. \n\nהשורה התחתונה: אמנם יחסית עמוס אבל מאוד מעניין לדעתי והסגל ממש אחלה, כל החומר (גם התרגולים) נמצא גם במודל.", "timestamp": 1713126552115}, {"author": "וקדימה לפיזיקה 2ממ", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nחנה לגמרי עשתה לי את הקורס, מעבירה את החומר בצורה סופר מעניינת וברורה. משקיעה ממש בטיב ההרצאות ובחומרי העזר (רשימות הרצאה, סרטוני עזר..). עונה בשמחה ובאופן מלא על שאלות. בשורה התחתונה חלק גדול מההצלחה והעניין שלי בקורס היו הודות לה. כמו שנאמר החיסרון היחיד זה האולמות המלאים אבל לי לא הייתה בעיה לשבת מאחורה, לפתוח את הרשימה שהיא מפרסמת לפני ההרצאה ופשוט ולהקשיב.\n\nשם המתרגל/ת: נועם דורי\nחוות דעת - תרגולים: \nנועם סופר השקיע במהלך הסמסטר, הגיע מוכן לתרגולים ונתן אינטואיציה ומוטיבציה לכל נושא בטרם התחלנו לפתור תרגילים. הבעיה היחידה היא שלדעתי שעה אחת לא מספיקה, ככה שיוצא שעושים בערך 2 שאלות (עם כמה סעיפים) בלבד במהלך התרגול\n\nשעורי הבית: \nגיליון להגשה אחת לשבוע, בהתאם לחומר שנלמד בכיתה. בהמשך לזה ששעת תרגול אחת לא מספיקה - אני לפחות הגעתי לגיליונות כשאין לי מושג איך לפתור חלק מהשאלות הקשות יותר והייתי חייב להיעזר בשעות קבלה / רפרנסים. המלצה שלי, גם אם פותחים רפרנסים - לוודא שהבנתם את דרך הפתרון. היו נקודות קטנות שלא הבנתי במהלך הסמסטר אבל הקצב מחייב אותך להמשיך הלאה, ורק בלמידה לקראת המבחן השלמתי את הפערים הלו.\n\nהמבחן: הוגן לחלוטין, לי לפחות הרגיש שלא הייתה אף שאלה שטומנת בחובה \"טריק\" מיוחד, ככה שמי שהשקיע במהלך הסמסטר יכל להפציץ והממוצע היחסית גבוה (לעומת שנים שעברו) מעיד על כך. יש לציין שבגלל הסמסטר המקוצר ירדו נושאים מסוימים.\n\nהשורה התחתונה: לפעמים מעניין, לפעמים פחות. הסגל מעולה, הרבה חומר שדורש השקעה, הבנה ועקביות ואם תקפידו על אלה אין סיבה לא להצליח במבחן.", "timestamp": 1713195693784}, {"author": "יובל קובץ׳", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה מרטיסקניאן\nחוות דעת - הרצאות: \nהמרצה הכי טובה בטכניון!! מסבירה בצורה ברורה, משקיעה בהדגמות ונותנת טיפים לגישה לפתרון שאלות\nיש לה גם מוקלטים מצויינים למי שצריך להשלים או מי שמעדיף ללמוד מרחוק כולל תרגילים מכל נושא לקראת למידה למבחן\n\nשם המתרגל/ת:  נועם דורי\nחוות דעת - תרגולים: \nמרצה מתחיל, משקיע ושולט מאוד בחומר, אדיב מאוד לסטודנטים, לפעמים מדלג מהר בפתרון תרגילים ולא מסביר עד הסוף\n\nשעורי הבית: \nברמה בינונית עד קשה, לוקח בערך שעתיים + כל שבוע אבל תורם להטמעה של החומר\n\nהמבחן: \nהוגן לחלוטין\n12 שאלות אמריקאיות, 6 תשובות כל אחת. מכסה את כל מגוון הנושאים\nאם לומדים טוב ושולטים בכל החומר אפשר להצליח\n\nהשורה התחתונה: \nבהתחלה נראה קורס מאוד מאוד קשה עם מעט מדי שעות ומעט נק\"ז ביחס לקושי", "timestamp": 1713280826560}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: המרצה הכי טובה שקיימת \n\nשם המתרגל/ת: אורי יחזקאל \nחוות דעת - תרגולים: אחלה מתרגל מומלץ \n\nשעורי הבית: קשים ומעצבנים \n\nהמבחן: הוגן \n\nהשורה התחתונה:", "timestamp": 1713293742752}, {"author": "תומר", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: אחת המרצות הטובות בטכניון. עונה באתר, מקליטה פתרונות ומשקיעה ממש.\n\nשם המתרגל/ת: לא הלכתי\n\nשעורי הבית: קשים החל מאמצע הסמסטר אבל קל לרפרנס. \nאם יש טיפה זמן שווה להשקיע על זה, אבל אם לא\nזה כנראה לא מה שיגרום לכם להכשל במבחן\n\nהמבחן: מאוד הוגן. הסמסטר ספציפית הרגיש \nפחות קשה, במיוחד ביחס למבחנים אחרים של חנה שנוטים ליהיות קצת יצירתיים.  מי שלומד טוב וטוחן קצת מבחנים יכול להוציא ציון ממש טוב.\nהבעיה העיקרית שהמבחן אמריקאי עם 12 שאלות ותשובות דומות בקטע מכשיל, אז אם פעם אחת הייתה לכם טעות של מינוס במקום פלוס ופעם אחת בטעות סימנתם תשובה לא נכונה במחברת אתם כבר ב83\n\nהשורה התחתונה: קורס סבבה וחנה מדהימה", "timestamp": 1713392648167}, {"author": "אייל", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: סשה בקמן\nחוות דעת - הרצאות: סשה מעולה, מסבירה ממש טוב לדעתי ושואלת כמה פעמים לוודא שכולם הבינו ותסביר כמה פעמים עד שתבין ומקליטה את כל ההרצאות ככה שאם פספסת הרצאה אפשר להשלים \n\nשם המתרגל/ת: רון בסלר - מוקלטות\nחוות דעת - תרגולים: מעולה! בתחילת הסמסטר הלכתי לתרגול אחר ולא כל כך הבנתי כי יש רק שעה אחת של תרגול ואז מצאתי את ההקלטות של רון וזה ממש עזר לי להבין טוב את החומר. רון מסביר ממש טוב \n\nשעורי הבית: 10 שאלות כל גיליון, גיליון פעם בשבוע. הגיליונות בדרך כלל די קשים, יותר קשים מהמבחן אז אם מצליחים אותם אתם במצב טוב. אם לא לחפש רפרנס ( בדרך כלל יש) ולנסות להבין אותו טוב\n\nהמבחן: שלנו היה ממש קל אבל גם המבחנים האחרים שתירגלתי לא היו קשים מדי. אם לומדים טוב במהלך הסמסטר אפשר להצליח\n\nהשורה התחתונה: קורס נחמד יכול להיות מעניין ולא קשה מדי", "timestamp": 1713472280546}, {"author": "Sivan Neulander", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: נהדרת בקטע מוגזם\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: תראו את הסרטונים שלו!!!\n\nשעורי הבית: קשים\n\nהמבחן: הוגן, דומה לשיעורי בית דומה למבחנים קודמים", "timestamp": 1713780468861}, {"author": "ליאור רומנו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: סשה בקמן\nחוות דעת - הרצאות: \nנחמדה מאוד, מלמדת ברוח טובה. אך לעיתים מתקשה להבין את ה\"שלד\" של החומר מרוב נחמדות ורצון שיהיה לנו קל. \nחנה לעומת זאת מטורפת. מדויקת, מהירה, כל מילה בסלע. \n\nשם המתרגל/ת: אריאל\nחוות דעת - תרגולים: \nכיתה קטנה אז אפשר לשאול שאלות ולחדד נושאים. \n\nשעורי הבית: \nאמריקאי הכל. כמו המבחן.\n\nהמבחן: פיירי. \n\nהשורה התחתונה: קורס דיי מעניין.", "timestamp": 1714207934831}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאין מה להגיד, פשוט תלכו אליה. גם אם עמוס יש מוקלט או שתחכו שיתחיל קצת להיות פחות עמוס במהלך הסמסטר.\nמה שכן השעות שלה לא ככ נוחות.\nבכל מקרה מספר 1 בארץ \n\nשם המתרגל/ת: רון בסלר (מוקלט)\nחוות דעת - תרגולים: \nהלכתי למתרגלים הפרונטאליים עד שבוע 6, במהלכו הבנתי שאין מה לעשות, שום דבר לא ישתווה לרון. גם אם זה מוקלט, תמיד אפשר לשאול שאלה באתר והוא עונה. מסביר מטורף.\nאני מעריץ שלו ופעם אחת אני אגיד לו.\nאשכרה מתרגל בפיזיקה שאתה מבין בזכותו הכל.\n\nשעורי הבית: עמוסים ממש. אמנם יש רפרנסים אבל עדיין כל גיליון כל שבוע הוא קשה ובתרגולים ובהרצאות אתה לא באמת מכסה את רוב החומר אז יש לא מעט תרגילים שקשה להבין איך לגשת אליהם. \nמה שכן - לא חייב  לעשות את כולם אז תשימו לב, אפשר לחזור לחלקם בהכנה למבחן.\n\nהמבחן: לא פשוט, אמריקאי ככה שכל תשובה מאוד חשובה ודי קל לרדת מ80 (מספיקה 2 טעויות וטעות סימון), אבל אם לומדים טוב ועושים הרבה מבחנים אז מבינים את הטריקים ואיך לגשת לתרגילים ולגמרי אפשר להצליח. המבחן די הוגן.\n\nהשורה התחתונה: \nקורס לא פשוט. מלא חומר ולא מקבל מספיק זמן. 4 שעות שבועיות למלא מלא חומר ואפילו די חשוב, אז הכל מתבצע בריצה ובמהלך הסמסטר קל לאבד את החומר וזה משפיע גם על הגיליונות.\nמה שכן - במהלך הלמידה למבחן ממש אפשר להבין את החומר ולהצליח, וגם החומר די מעניין.\nבסוף זה נופל עליך ואתה מבין את החומר, אל תיבהלו!", "timestamp": 1714478510977}, {"author": "אורי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: חנה.\nלא באמת צריך לפרט, שמה לפניה. \nפשוט מרצה נהדרת. היא מעלה את הרשימות של ההרצאה לפני, מומלץ לרפרף לפני זה. ממליץ גם לשבת בהרצאה ורק להקשיב ולנסות להבין, אפשר להעתיק את הכל מדפים שלה במודל אחרכך. \n\nשם המתרגל/ת:  הקלטות של רון בסלר\nחוות דעת - תרגולים: לא הלכתי. כל החומר והתרגלים שנעשים נמצאים במודל ביחד עם הפתרון. ההקלטות של רון מעולות\n\nשעורי הבית: לא פשוטים, אבל חשוב ממש לעשות אותם כל שבוע, כדאי גם עם כל גיליון לשבת עם הנוסחאות שראיתם בהרצאה הרלוונטית. אפשר למצוא רפרנסים להכל, אבל כדי לנסות ולא להעזר יותר מידי, אולי רק אם באמת לא יודעים רק בשביל לקבל את הצעד הראשון או הבא, או אולי לבדוק את עצמכם בסוף. כדאי גם להכין את דף הנוסחאות שלכם במהלך הסמסטר, כל פעם שסיימתים גליון, תרכזו ממנו את הנוסחאות שפיתחתם או השתמשתם בהם הרבה. \n\nהמבחן: לא קל, אבל הוגן מאוד. עם עשיתם את הגיליונות וכמה מבחנים לפני לגמרי אפשרי. מומלץ לנסות ולפתוח מבחנים במהלך הסמסטר ולנסות טיפה, כל שבוע בערך בקורס זה עוד שאלה מהמבחן שאפשר לפתור.\n\nהשורה התחתונה: חנה מלכה.\nאם עברו כמה שנים מאז שנגעתם בפיזיקה וחדוא בתיכון, הקורס לא קל. הקצב מהיר ויש לא מעט חומר. אישית לבוגרי מכינה יש יתרון, אם הצלחתם שם עם ציון טוב אז אתם לגמרי מוכנים.", "timestamp": 1714556889650}, {"author": "אורי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה (אין עליה)\nחוות דעת - הרצאות: אין יותר מידי מה להגיד, שמה הולך לפניה. מרצה מעולה, מסבירה בהתלהבות ויש לה סיפורים מצחיקים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: בתחילת הסמסטר היתי אצל נועם אבל די מהר עזבתי את התרגולים כי לא ממש הרגשתי שהם תורמים. צפיתי בכמה תרגולים מוקלטים של רון בסלר - הוא אחלה.  \n\nשעורי הבית: ממש חשובים ומאוד דומים לשאלות מהמבחן. מאוד מומלץ לא לרפרנס ולהבין הכל.\n\nהמבחן: הוגן מאוד, דומה לתרגילי הבית ולמבחנים משנים קודמות.\n\nהשורה התחתונה: ממליץ כבר לקחת בסמסטר א' - אחלה חוויה.", "timestamp": 1715330547253}, {"author": "ליני", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: ההרצאות מפוצצות אישית אני ממליצה לצפות בהרצאה המוקלטת. החומר מועבר בברור, חנה תמיד שמחה לעזור לסטודנטים ועונה על שאלות בצורה מצוינת ועם יחס טוב. היא תמיד מעלה את סיכומי ההרצאה מראש ככה אפשר לקרוא ולעבור על ההרצאה שוב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תרגולים מיותרים, המתרגלים גרועים לא בקיאים בחומר ולא יודעים להעביר את התוכן הנדרש.\n\nשעורי הבית: התרגילים עולים ברמת הקושי אבל פתירים. שעות הקבלה עוזרות מאוד כדי להבין איך פותרים אותם.\n\nהמבחן: אמריקאי 12 שאלות. פתיר רק להיזהר מטעויות נפוצות שאפשר ליפול בהן.\n\nהשורה התחתונה: קורס נחמד לא עמוס במיוחד אם עומדים בקצב ומסכמים כמו שצריך. קורס יסוד שחובה לקחת אז אין מה לעשות", "timestamp": 1715538971074}, {"author": "יל", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה מרט'\nחוות דעת - הרצאות:  \nקטלנית, מעבירה את החומר בצורה מעולה, מסודרת \n\nשם המתרגל/ת: גוליאן \nחוות דעת - תרגולים: \nבסדר גמור סה\"כ \n\nשעורי הבית: תלוי בנושא אבל בדכ די קשים \n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה:  לתרגל מבחני עבר בכמויות", "timestamp": 1715705315750}, {"author": "גלעד", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nאין הרבה מה לכתוב על חנה שעוד לא נכתב. טוב שיש גם מרצים כמוה בטכניון. \n\nשם המתרגל: לא נכנסתי\nחוות דעת - תרגולים: \nשעה של תרגול על 3 שעות הרצאה. בקושי מספיק תרגיל אחד. עדיף להשקיע בשיעורי בית. \n\nשעורי הבית: \nגליון כל שבוע. לא קל. בשלב מסוים התבססתי הרבה על רפרנסים, אבל מי שישקיע זה ישתלם במבחן. \n\nהמבחן: \nאמריקאי, 12 שאלות, דף נוסחאות שאתה מכין. סה״כ היה הוגן מאוד, לא מנסים להכשיל. \n\nהשורה התחתונה: \nאחלה קורס, דורש את ההשקעה והזמן בהרצאות ובמטלות", "timestamp": 1715846863182}, {"author": "שחף", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: חנה מעולה, יש הכל מוקלט.", "timestamp": 1716288944946}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nחנה מרצה מספר 1 בטכניון, אין יותר מה להרחיב פשוט מי שלוקח את הקורס הזה חייב ללכת אליה.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \nהלכתי שבוע - שבועיים ראשונים ואז ראיתי שאין טעם ללכת בעיקר בגלל שיש רק שעה אחת בשבוע שבה בקושי מספיקים לפתור תרגיל אחד.\nבכל מקרה אני כן ממליץ על רון בסלר במוקלט (אצלנו לא תרגל) למי שרוצה לדעת לפתור תרגילים\n\nשעורי הבית: \n12 גליונות אבל מחשיבים את 9 הכי טובים, לא קלים ולוקחים קצת זמן והשקעה אבל הם עוזרים לקראת המבחן.\n\nהמבחן: \nשני המועדים היו הוגנים (השני היה יותר קשה לדעתי) אבל שניהם לא פשוטים. צריך לפתור כמות של מבחני עבר כדי להבין את הרעיונות, אם עושים זאת אפשר להביא ציון טוב.", "timestamp": 1716306634051}, {"author": "צופה אינרציאלי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות:\n10/10 , אין מה להוסיף, הכול מובן וברור.\n\nשם המתרגל/ת: ג'וליאן\nחוות דעת - תרגולים: \nממש נחמד וחביב ומסביר טוב את החומר\n\nשעורי הבית: \nהשאלות הראשונות בכל גיליון קלות ואז נהיות קשות יותר, אבל זה תרגול ממש טוב\n\nהמבחן: \nלא קשה, הרמה ירדה בשנים האחרונות לדעתי\nהשורה התחתונה: \nקורס סימפטי ביותר, אם הוא לא היה חובה עדיין הייתי לוקח אותו :)", "timestamp": 1716556262175}, {"author": "Tony", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: יש סיבה שחנה היא המלכה. מסבירה בבירור \nוכל ההרצאות כבר מתומצות ונמצאות במודל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: גליון כל שבוע, לי הם היו די קשים אבל הכמות לא גדולה במיוחד\n\nהמבחן: הוגן בסהכ, יש מספיק זמן והשאלות באותו סגנון של שיעורי הבית והתרגולים\n\nהשורה התחתונה: קורס עם הרבה חומר, חנה הופכת אותו לפחות גרוע ממה שהוא באמת", "timestamp": 1716706887456}, {"author": "צופה במערכת האינרציאלית", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה ככל הנראה אחת המרצות הטובות שפגשתי. היא מעבירה את ההרצאות בצורה יוצאת דופן, אכפתית מאוד ועוזרת איפה שהיא יכולה לסטודנטים. ההרצאות שלה מפוצצות (ובצדק) אז שווה לשקול לראות מוקלט.\n\nשם המתרגל/ת: ג'וליאן נורדי\nחוות דעת - תרגולים: מתרגל מעולה. לפעמים מרגיש שרץ על החומר, אז כדאי להיות עם הסיכום של התרגול מהמודל מול העיניים אם זה עוזר לשמור על הקצב. עם זאת, מסביר בצורה טובה את הנושאים ועונה על שאלות בצורה מובנת.\n\nשעורי הבית: \nגיליון לשבוע, לא צריך להגיש את כולם (9/12). הגליונות הראשונים יחסית קלים אבל מהר מאוד הם נהיים מורכבים ממש ודורשים כמה שעות כל שבוע לפתרון. שווה לחכות לתרגולים, ואפילו לשעות קבלה, כדי לפתור גליונות בצורה יעילה.\n\nהמבחן: \nמאתגר אבל הוגן. אם לומדים כמו שצריך לקראת המבחן וחוזרים על הסיכומים בסוף הסמסטר אפשר להוציא ציון יפה.\n\nהשורה התחתונה: \nקורס מאתגר עם סגל מדהים שעושה את כל ההבדל.", "timestamp": 1716761969502}, {"author": "עלמה", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעולה אין מה להוסיף.\n\nשם המתרגל/ת: רון בסלר מוקלט \nחוות דעת - תרגולים: עבדתי עם האתר שלו, עבד בשבילי מצויין, ממליצה מאד!!\n\nשעורי הבית: \nתורמים מאד להבנה, לא נוראיים\nהמבחן: הוגן מאד. \n\nהשורה התחתונה:", "timestamp": 1716837357096}, {"author": "Einbar Dror", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מרצה מעולה,  מובנת מתחשבת, מנסה לעזור בכל צרה!\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: גל נהדר, מסביר עד הסוף וזמין לאחרים\n\nשעורי הבית: קשים, אבל לא להלחץ מזה\n\nהמבחן: אמריקאי אז שווה מאוד לבדוק תשובות בקפידה\n\nהשורה התחתונה: חנה מעולה!", "timestamp": 1716903131677}]}