{"posts": [{"author": "חן", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "השורה התחתונה: \nשונה מאוד (לטובה כמובן) מהמעבדות הקודמות. עושים שני ניסויים מתוך רשימה יחסית ארוכה, כל ניסוי לוקח בערך חצי סמסטר אז יש זמן לצלול פנימה ולקחת ברצינות. בניגוד למעבדות הקודמות, מרגישים שיש מה להשקיע ואפשר להבין מה עושים. בסוף כל ניסוי צריך להציג את התוצאות שלך במצגת (רבע שעה) ודוח שדומה למעבדות הקודמות, חוץ מזה אין כל כך עבודה בבית (אולי לקרוא דברים). סך הכל נחמד.", "timestamp": 1626934925711}, {"author": "פיזיקאי אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "קורס פשוט נוראי, למי שיש אפשרות בחירה שיתרחק כמו מאש עדיף כל פרוייקט בכל נושא במקום.\nזאת מעבדה שמבצעים אותה פעמיים בשבוע כל פעם 3 שעות וזה פשוט שורף את כל השבוע, עד שאתם חושבים שסיימתם לעבוד על המעבדה הזאת באותו השבוע יומיים לאחר מכן נפגשים שוב במעבדה.\nזה סבל שלא נגמר כי גם לאחר העבודה הקשה צריך להכין מצגת ולאחר מספר פגישות נוספות מול המדריך צריך להציג אותה מול כל הסטודנטים בקורס ביום מתיש מהבוקר עד הערב בו שומעים את המצגות של כולם והנוכחות חובה. לאחר הסבל בהכנת המצגת יש צורך בהכנת דו\"ח שגם הוא חפירה אחת גדולה ולוקח זמן רב להכין אותו (זה ניסויים ארוכים משמעותית ממעבדות קודמות).\nואם חשבתם שפה זה נגמר אז תכפילו הכל פי 2 כי צריך לבצע 2 ניסויים במהלך הסמסטר ולכל אחד בנפרד מצגת עם יום שלם של הצגה ודו\"ח.\nכמות השעות שהשקעתי בקורס הזה עולה על כמות השעות שהשקעתי בכל המקצועות האחרים שלי ביחד באותו הסמסטר ובסוף מקבלים ציונים לקראת סוף אוגוסט , אמנם ציונים לא רעים אבל ממש לא שווים את ההשקעה בסמסטר.\nהיו ניסויים קלים יותר ופחות שצריך לבחור מהן, זה כמובן משפיע על הקורס אבל בכל מקרה אתם תלויים בניסויים שאחרים בוחרים ותוכלו להקלע למצב שתעשו ניסוי שאתם לא רציתם.\nבכל אופן, תשתדלו לבחור פרוייקט מספיק זמן מראש כדי למנוע מעצמכם את בזבוז הזמן הזה.", "timestamp": 1664705798193}, {"author": "ביונסה", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "השורה התחתונה: חרא. לא לעשות אם לא חייבים. אם עושים, לעשות את הניסוי של פוטונים שזורים", "timestamp": 1677243054748}, {"author": "מה זה משנה", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שונה מאוד ממעבדות 1-4. בוחרים שני ניסויים גדולים שכל אחד מהם לוקח שישה שבועות. הניסויים הם מהרבה נושאים אז אפשר לבחור מה שמעניין אתכם. חוץ מהנושא עצמו, שווה לברר מי המנחה של הניסוי שאתם רוצים, כי יש מנחים שמפרגנים בבדיקה יותר ויש כאלה שפחות (מישה למשל מאוד מפרגן), ובניגוד למעבדות 1-4 אין שום נירמול. בסך הכל - 3 נקודות עם אחלה ציון בהשקעה סבירה.", "timestamp": 1680345918332}]}