{"posts": [{"author": "OT2468", "semester": "201902", "text": "קורס מאוד מעניין, סגל המרצים טוב מאוד ועוזר המון.\nהרגשתי שהתרגולים לא באמת מוספים המון ויצאתי יותר מבולבל מהם. בסוף עברתי על קבצי התרגול לבד והבנתי בצורה טובה יותר.", "timestamp": 1595930982000}, {"author": "ירדן פלאש", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: דר׳ חנה מרטיסקאינן\nחוות דעת - הרצאות: דר׳ חנה מרטיסקאינן היא מתת האל לאדם וכל מי שיכול להרשות לעצמו להיות בנוכחותה צריך. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597743270979}, {"author": "Lir", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: מאוהבת. \n\nשם המתרגל/ת: לא הלכתי.  יש הכל מודפס במודל ותרגלתי לבד.\nחוות דעת - תרגולים: \n\nשעורי הבית: במודל, פעם בשבוע. ממוחזרים כבר שנים ויש רפרנס, אבל כדאי להבין ורק להעזר ברפרנס אם נתקעים.\n\nהמבחן: לא קשה\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1597745409775}, {"author": "Ok", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: \nההרצאות היו החלק הכי טוב בשבוע שלי, גידי מרצה מדהים וההרצאות היו תענוג\n \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nעברתי מספר מתרגלים אך הם לא היו ברמה גבוהה, או שלא היה להם כוח לתרגל או שלא ידעו מספיק את החומר אבל כל התרגול נצמדו לדף תרגול ולא ממש ידעו לענות על שאלות מעבר\n\nשעורי הבית: קשים, כמה רמות מעל רמת התרגול או הכיתה אבל שעות קבלה מאוד עוזרות ולרוב יש רפרנסים טובים כדי לוודא את התוצאות\n\nהמבחן: \nלא קל, אמריקאי, אבל הוגן\n\nהשורה התחתונה: קורס טוב, אם עושים את השיעורי בית אפשר להוציא ציון לא רע בסוף", "timestamp": 1599460305443}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: זה היה בסמסטר זום, הנושאים בהרצאות עצמם עברו מאוד מאוד מהר אם לא מגיעים עם ידע בסיסי אז הקורס יהיה עמוס. חנה מעבירה את החומר בצורה טובה מאוד לא מתעכבת הרבה על שאלות.\n\n\nשם המתרגל/ת: אלכסנדרה\nחוות דעת - תרגולים: מתרגלת טובה לרוב מספיקה את כל התרגול\n\nשעורי הבית: תרגיל בית ושיעורי הכנה במודל יחסית פשוטים.\n\nהמבחן: מותאם לחומר הנלמד\n\nהשורה התחתונה: קורס קל לאלו עם ידע קודם בפיסיקה", "timestamp": 1600622450798}, {"author": "Yaakov L.", "difficultyRank": 2, "generalRank": 5, "semester": "201903", "text": "שם המרצה: זיו מילוצקי\nחוות דעת - הרצאות: ההרצאות היו מוקלטות מראש (בגלל הקורונה) אבל היו מעולות. החומר עבר בצורה ברורה מאוד ובנוסף גם מעניינת. מרצה מצוין לדעתי.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: ראיתי תרגולים מוקלטים שלה במהלך הסמסטר, מתרגלת מעולה.\n\nשעורי הבית: \n\nהמבחן: סביר בהחלט, רוב השאלות בד\"כ דורשות רק הבנה לאיזה נושא מכוונת השאלה ומה הנוסחא הנכונה להשתמש בה.\n\nהשורה התחתונה: אחלה קורס, מעניין מאוד.", "timestamp": 1600942151536}, {"author": "הדר", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות:  חנה מרטיסקאינן\n\nשם המתרגל/ת:  אלכסנדרה בקמן\nחוות דעת - תרגולים: לרוב לא מספיקים בתרגול את כל התרגילים נתונים והם נוטים להיות נורא עמוסים. אין הרבה זמן לשאלות \n\nשעורי הבית:  לוקחים כמה שעות טובות בשבוע\n\nהמבחן:  \n\nהשורה התחתונה:  קורס יחסית קשוח, צריך להשקיע זמן במהלך הסמסטר על מנת להיות מוכנים למבחן כי בד\"כ הוא מתרחש מיד בתחילת תקופת מבחנים ואין הרבה זמן ללמוד אליו", "timestamp": 1602510382122}, {"author": "Yaron Schlesinger", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: גדעון אלון וחנה מרק\nחוות דעת - הרצאות:  מדהימים וברורים שניהם\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא התחברתי לאף אחד מהמתרגלים\n\nשעורי הבית: \n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1602577611046}, {"author": "muhammed mahamid", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מאוד מעניינות, מוכיחה כמעט הכל מתמטית ומסבירה מה קורה פיזיקלית.  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא הגעתי לאף תרגול, אין צורך לדעתי.\n\nשעורי הבית: מאוד עוזרות להישאר בעניינים(בפרט לאלה שלא מגיעים לתרגולים), כמובן יש מלא רפרנסים :)\n\nהמבחן: \nאם מבינים החומר טוב מאוד, וחורשים מספר מכובד של מבחני עבר, אז אין סיבה(חוץ מחוסר ריכוז אולי) שלא תקבלו 100\nהשורה התחתונה:", "timestamp": 1612186814854}, {"author": "sagi346", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גידי וחנה\nחוות דעת - הרצאות: הייתי כל הסיסמטר עם גידי בלייב ובסוף הסימסטר עשיתי מרתון הקלטות של חנה, שניהם פשוט מעולים, גידי גורם להכל להיות מעניין יותר וממש נהנה ללמד וחנה פשוט מלמדת מאוד פרקטי את מה שצריך למבחן.\n\nשם המתרגל/ת: אביתר סבג\nחוות דעת - תרגולים: התרגולים יכולים לעזור קצת, אבל העיקר זה ההרצאות והשיעורי בית, אם מבינים בהרצאות ומשקיעים בשיעורי בית ובפתירת מבחנים אפשר להסתדר גם בלי התרגולים, אם אתם עם גידי אז ההתחלה של התרגול מסכמת טוב את מה שגידי מסביר, כי הוא פחות רושם בצורה שקל להעתיק דברים למחברת.\n\nשעורי הבית: חשוב לעשות כדי להבין\n\nהמבחן: לפתור הרבה מבחנים לפני עד שמבינים, אם יש נושא שממש לא מבינים, אפשר להוסיף מקרים פרטיים שקשורים אליו לדף נוסחאות. היה מבחן הוגן, השאלת בונוס הייתה פשוט לנחש תשובה מתוך 6 כי לא ממש היה איך לפתור אותה, אל תבנו עליה\n\nהשורה התחתונה: אחלה קורס, מרצים טובים, לפתור כמה שיותר מבחני עבר לפני המבחן.", "timestamp": 1612254858050}, {"author": "ליאור ליאון", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: כזה גבר, קצת מפוזר, מאמין שבלימוד פרונטילי(היה סמסטר זום) יהיה הכי טוב שאפשר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612266210275}, {"author": "elad siman tov", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גידי המלך\nחוות דעת - הרצאות: אחלה אווירה קצת מבולגן לפעמים. יש כאלה שיתאים להם ויש כאלה שלא, ממליץ לנסות לראות איך הולך. יש לו סיכומים של ההרצאה מילה במילה אז זה ממש עוזר.\n\nשם המתרגל/ת: אביתר\nחוות דעת - תרגולים: 100%\n\nשעורי הבית: הוגנים, היו כמה שאלות קצת קשות מדי אבל לרוב זה ממש אחלה יש כמה נסיונות אין סיבה לא להוציא 100\n\nהמבחן: הוגן, ציונים יחסית גבוהים בקורס.\n\nהשורה התחתונה: כיף לא עמוס מדי אם מגיעים עם רקע מהתיכון, חומר מעניין", "timestamp": 1612506355275}, {"author": "Eric Vaizman", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: \nמרצה ממש טוב, לפעמים קצת מבולגן אבל ללא ספק ממש מעניין להקשיב לו והוא מעביר את החומר בצורה טובה\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: \nהמתרגלת הכי טובה בפער בצוות המתרגלים, וניסיתי את השאר גם (אביתר סבג, ינאי פלורסהיים)\nשעורי הבית: לא קשים במיוחד, רמה סבירה\n\nהמבחן: \nהיה אמריקאי כולו והוגן ברמה\nהשורה התחתונה:", "timestamp": 1612530382838}, {"author": "Tsur", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה. מסבירה היטב את החומר בליווי דוגמאות מוחשיות בכיתה. מעוררת עניין וסבלנית לשאלות.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: במסגרת הזמן המועט לכל תרגול, לא ניתן היה להעביר את החומר בצורה איכותית ומספקת.\n\nשעורי הבית: כל שבוע מטלה על החומר הנלמד. מומלץ להתמודד לבד עם שיעורי הבית על מנת להגיע מוכנים למבחן.\n\nהמבחן: מאתגר אבל אפשר להצליח בו אם מכינים את כל שיעורי הבית ומתרגלים מכל מבחני העבר.\n\nהשורה התחתונה: קורס מאתגר אך אפשר לעבור אותו כמו שצריך", "timestamp": 1612615731576}, {"author": "איתמר זייד", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: \nאווירה טובה אבל החומר לא הועבר כ\"כ טוב\nשם המתרגל/ת:  אביתר סבג\nחוות דעת - תרגולים: \nמהיר מדי\nשעורי הבית: \nקשים\nהמבחן: אם פותרים כמה מבחנים משנים שעברו- המבחן לא קשה\n\nהשורה התחתונה:", "timestamp": 1612725297863}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גדעון אלון(גידי)\nחוות דעת - הרצאות: המרצה הכי טוב בטכניון! מסביר מעולה את כל החומר, מעיר את השיעורים בכיף וגורם לכך שכיף לבוא לשיעור כל שבוע\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: מתרגלת מעולה, רק חבל שהתרגול הוא רק שעה אחת אז היא לא מספיקה המון\n\nשעורי הבית: יחסית קשים, מצפים שנבין ונעשה מאמץ להבין מעבר להרצאה\n\nהמבחן: יחסית פשוט למי שמבין את החומר, שאלות עם אותו רעיון כמו בשיעורי בית ומבחנים אחרים\n\nהשורה התחתונה:", "timestamp": 1612776759862}, {"author": "קרן", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: בגדול חנה היא אלוהים, מסבירה ברור ומדויק\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612796036443}, {"author": "אופיר ביננטל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אהבת הסמסטר שלי. ברורה, מצחיקה. המרצה הכי אכפתית שיצא לי לפגוש\n\nשם המתרגל/ת: אביתר\nחוות דעת - תרגולים: מסביר מצויין. עונה על שאלות בצורה ברורה\n\nשעורי הבית: לא תמיד פשוטים. נדרש תמיד לעבור על החומר לפני שניגשים אליהם\n\nהמבחן: אמריקאי. די חוזר על עצמו. נדרש תרגול\n\nהשורה התחתונה: קורס נחמד. נדרש לתרגל כי אין הרבה שעות שבועיות", "timestamp": 1612952938484}, {"author": "Daniel Gorodetzki", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ד\"ר גדעון אלון \nחוות דעת - הרצאות: גדעון מגיע לכל שיעור עם אנרגיות, פעמים רבות חשבתי שבטעות פתחתי טוויץ' ואני מסתכל על סטרימר שמטרתו לבדר, באמת שלא חכיתי בקוצר רוח לשום הרצאה חוץ מפיסיקה, החומר הועבר באופן ברור וקיבלתי ציון שאני יותר ממרוצה ממנו, ממליץ בחום\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612963668930}, {"author": "בני", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "ממליץ לכם את גידיייייייייי", "timestamp": 1613035975559}, {"author": "Maor Kovler", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הקורס הכי מעניין בסמסטר עם המרצה הכי מעניינת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: לא קשה מידי\n\nהשורה התחתונה: קורס מעניין שאפשר לקבל בו ציון טוב", "timestamp": 1613546335815}, {"author": "נ.א.", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות:  מרצה מעולה!!! מסבירה ממש טוב ואפילו עושה הרבה ניסויים קטנים כדי לעזור לסטודנטים להבין. פשוט מדהימה.\n\nשם המתרגל/ת: אביתר סבג\nחוות דעת - תרגולים: ממליצה.\n\nשעורי הבית: קצת ארוכים אבל מאוד עוזרים להבין את החומר. אני ממליצה לפתור את הכל לבד כי באמת צריך להבין את החומר לבחינה. \n\nהמבחן: 10 שאלות ושאלת בונוס, לא היה קשה בכלל אבל היו כמה טריקים. בגדול צריך לפתור עם הבנה כדי לקבל ציון מעל 70 אבל ניתן לקבל 60-70 מדף נוסחאות והבנה בסיסית של החומר.\n\nהשורה התחתונה:", "timestamp": 1613747082910}, {"author": "אייל מעוז", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה מרטסיקאינן\n\nחוות דעת - הרצאות: חנה מושלמת!!! מעבירה בצורה כל כך ברורה, לאט ובזהירות. יודעת לשלוט בכיתה, כך שאין הפרעות במהלך השיעור. היה סמסטר בזום, אז כל הזמן הייתה בקשב לצ'אט וענתה לשאלות מהצ'ט כחלק מהעברת השיעור. מאושר עד הגג שיש לי איתה עוד קורס סמסטר הבא.\n\nשם המתרגל/ת: סשה בקמן\n\nחוות דעת - תרגולים: \nתרגול קצר. סשה חמודה ממש, ומנסה לעזור לכולם להבין את החומר. אני הייתי רוצה שיהיה יותר זמן בתרגול הזה\n\nשעורי הבית: \nבמודל. לא קלים בכלל. יש גם תרגילי הכנה לכל חומר וגם תרגילים מלאים. מידי פעם היה צריך לרפרנס..\n\nהמבחן: \nהוגן. צריך לקרוא את השאלות עד הסוף, ולשים לב לכל הפרטים הקטנים. \n\nהשורה התחתונה: קורס מעניין. היה צריך אולי עוד טיפה תרגול.", "timestamp": 1615126898755}, {"author": "Naor Mahani", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: השיעורים שלה מועברים בצורה עניינית והיא מבססת את החומר בצורה טובה. בנוסף היא גם נוטה לענות על שאלות ולהסביר אותן מהיסוד והדוגמאות שלה בדרך כלל כוללות את העיקר של החומר, ולכן קל להבין מהן את המהות של מה שצריך ליישם בתרגילים.\n\nשעורי הבית: כוללים את רוב החומר ואכן מאתגרים, אך הפתירה של שיעורי הבית תגרום להבנה של איך לגשת לתרגילים ומה צורת החשיבה שצריך לקחת בפתירת שאלות בפיזיקה, כמו זיהוי החומר עליו מדובר.\n\nהמבחן: המבחן די פייר, השאלות בו דורשות חשיבה וקשה לנחש את התשובה, תמיד כדאי לפתור ולא לחפש קיצורי דרך, אבל אם יודעים איך לגשת לתרגיל הוא לא אמור להיות מאתגר מידי.\n\nהשורה התחתונה: קורס די נחמד, החומר בו מעניין וצורת החשיבה היא ייחודית.", "timestamp": 1615163100729}, {"author": "ו", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה! \n\nשם המתרגל/ת: סשה בקמן \nחוות דעת - תרגולים: מתרגלת ממש טובה, עונה לשאלות אבל לא לשאלות מיותרות\n\nשעורי הבית: שיעורי בית במודל, יש רפרנס ודי קלילים\n\nהמבחן: מבחן קשה מאוד, צריך לעבוד הרבה כדי להוציא ציון טוב.\n\nהשורה התחתונה: קורס לא עמוס אבל לא מעניין", "timestamp": 1615195381834}, {"author": "מיכל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה אגדית, מסבירה מאוד מאוד ברור ומשתלטת טוב על הכיתה. מה שכן ההרצאות בפיזיקה עמוסות ורצות על הרבה חומר בכל פעם, כדאי לפני כל הרצאה לעבור על הרשימות (אצלנו שני המרצים פרסמו מראש).\n\nשם המתרגל/ת: סשה (אלכסנדרה)\nחוות דעת - תרגולים: התרגולים בקורס היו קצרים מידי ולא הקיפו את כל מה שלימדו בהרצאה, לרוב גם לא היו מסונכרנים עם ההרצאה והיו יותר משבוע אחרי ההרצאה בנושא. המתרגלים רצו על התרגילים ובקושי היה להם זמן לענות על שאלות\n\nשעורי הבית: קשים וגוזלים זמן, אבל עוזרים להבין את החומר באמת.\n\nהמבחן: הוגן, ויש הרבה איך להתכונן אליו.\n\nהשורה התחתונה: הקורס לא התנהל בצורה הכי מסודרת, וגוזל יותר זמן ממה שציפיתי לקורס של 2.5 נקודות, אבל מאוד מעניין.", "timestamp": 1615574876171}, {"author": "נ.ה", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: המרצה בה הידיעה. מסבירה בצורה כיפית את החומר ומרגישים גם שהיא אוהבת את החומר . מאוד נהנתי והיא גם מעלה את הסיכומים שלה מה שמקל על העניינים\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: סך הכל אחלה של מתרגל , אך לדעתי התרגולים קצת מיותרים ומספיק ההרצאות[ואם רוצים אז ללמוד את הסיכומים]\n\nשעורי הבית:שיעורי הבית הוגנים וגם לא קשים \n\nהמבחן: מאוד הוגן. פשוט צריך לפתור שאלות ולתרגל כמה שיותר , בסוף החומר די חוזר על עצמו\n\nהשורה התחתונה: אחלה קורס מאוד נחמד", "timestamp": 1615654106934}, {"author": "שמואל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דדי/חנה\nחוות דעת - הרצאות: מרצים מעולים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דורשים השקעה\n\nהמבחן: לא קשה אם יודעים את החומר\n\nהשורה התחתונה: מעניין", "timestamp": 1615885462987}, {"author": ":", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מעולה ממש, מאוד נעים להקשיב לה במהלך ההרצאות. בדרך כלל היא מעלה סיכומים לפני ההרצאה, ככה שתוכלו לעבור עליהם (ואם לא תבינו משהו, זה גם בסדר :) ). בהרצאות היא חוזרת גם על הסיכומים, ומסבירה בצורה מאוד טובה. בנוסף, קצת לפני המבחן היא העלתה סרטונים בהם היא פותרת מספר תרגילים ממבחני עבר, וזה מאוד לא מובן מאליו. רק חנה!\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: אחלה מתרגלת, אבל התנגשה לי עם תרגול אחר, אז צפיתי בהקלטות שלה במקום. בדיעבד - החלטה מעולה, כי בתרגול של שעה אחת טסים על החומר. בנוסף היא גלשה על זמני ההפסקה, ובהקלטות זה לא עניין גדול.\n\nשעורי הבית: בחצי הראשון של הסמסטר סבירים, אבל בחצי השני הופכים להיות הרבה יותר קשים. כדאי לפתור עם עוד אנשים, ובמקרה הכי גרוע יש רפרנסים כמעט להכל.\n\nהמבחן: אמריקאי, קל פיצוצים, מהקורסים הבודדים ששיעורי הבית קשים יותר מהמבחן עצמו. מאוד חשוב אבל לדייק בחישובים, כי יכולים לתת תשובות מטעות.\n\nהשורה התחתונה: בתור אחד שלא אוהב יותר מדי פיזיקה - קורס סבבה, בעיקר בזכות הצוות. אפשר להוציא 100 יותר בקלות (בהשוואה לקורסים אחרים, מן הסתם).", "timestamp": 1616230311641}, {"author": "noam nissim", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קצת קשים אבל מלמדים טוב לבחינה\n\nהמבחן: שאלות אמריקאיות לא קשות מדי\n\nהשורה התחתונה: אחלה קורס ולא עמוס מדי", "timestamp": 1616260413818}, {"author": "Gilad sella", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  חנה מרטיסקאינן\nחוות דעת - הרצאות:  לא לחשוב אפילו על ללכת למרצים אחרים!!! חנה המרצה הכי טובה שהייתה לי הסמסטר, מעבירה את החומר ברמה מאוד גבוהה ומספקת דוגמאות מאוד רלוונטיות למבחן. נותנת זמן לשאלות(סמסטר זום, אז הצ'אט תמיד היה מולה וענתה על שאלות משם). הייתי גם אצל המרצה השני(גידי אלון) בשעת קבלה ואני חד משמעית ממליץ יותר על חנה.\n\nשם המתרגל/ת:  סשה(אלכסנדרה) בקמן/אביתר סבג\nחוות דעת - תרגולים:  אישית הרגיש לי שהתרגולים היו קצרים מדי ועקב כך ממש לא יעילים, אבל אני הרגשתי שהחומר הועבר יותר טוב אצל סשה, למרות שלא היה הרבה זמן לשאלות ולא כל החומר של התרגול הועבר. ממליץ על שילוב של שעות הקבלה של חנה + לקרוא את התרגולים.\n\nשעורי הבית:  מחולקים לשניים - תרגילי הכנה ותרגילי בית. את תרגילי ההכנה הייתי עושה יום-יומיים לפני ההרצאה עם הרשימות של ההרצאות של חנה. תרגילי הבית יכולים להיות קשים אבל הם בדיוק באותה הרמה של המבחן, לכן אני ממליץ לא להשתמש ברפרנס ולשבור קצת את הראש עליהם - זה שווה את זה אחר כך במבחן. יש רפרנסים להכל שמפוזרים בדרייבים.\n\nהמבחן:  הוגן, ממליץ לעבור על הרבה מבחנים לפני כי ממחזרים שאלות. אם הייתם ממוקדים על החומר לאורך כל הקורס ולא זלזלתם בשיעורי בית אז ממש אפשר להוציא ציון טוב.\n\nהשורה התחתונה:  חבל שהקורס לא עם הרבה נק\"ז כי אפשר להוציא בו ציון טוב שמעלה את הממוצע. חוץ מזה, לכו לחנה, המרצה עם הכי הרבה אהבה למקצוע ודאגה לסטודנטים, והייתה לי חוויה מתקנת אצלה אחרי מורה נוראי בתיכון שלימד אותו חומר.", "timestamp": 1616874827976}, {"author": "N.h", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: חנה \nמדהימה , מסבירה בצורה אדירה . היא מעלה לאחר מכן את הסיכומים של ההרצאות ואני ספציפית למדתי מזה [חוסך את הזמן]\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לדעתי אין טעם ללכת לתרגולים\n\nשעורי הבית: קלילים . דורשים בערך עד שעתיים שבועיות \n\nהמבחן: פשוט לפתור כמה שיותר מבחנים ותהיו מוכנים\n\nהשורה התחתונה: קורס קל מאוד ולא מסובך ודורש השקעה מינמלית . [אותי האמת קצת שיעמם אבל זה יותר נבע מהחוסר בעומק של החומר שהוא האמת חומר מעניין ]", "timestamp": 1619004448377}, {"author": "SE", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה מרטיסקיאן\nחוות דעת - הרצאות: כפרה עליה. מעניינת מאוד, מסודרת וקל להבין אותה. מעלה את הסיכומי הרצאה מראש אז אפשר לעקוב תוך כדי ההרצאה ולא להתרכז רק בלכתוב.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: מדברת על מהירות 1.5 ברגיל אבל מספיקה את התרגול לפחות. באופן כללי מנסים לדחוף כל כך הרבה תרגילים ברק שעה אחת אז לא באמת לומדים משהו ועוזרים.\n\nשעורי הבית: קשים ברמה מוגזמת מידי ודורשים יותר מידי! לא באמת לומדים מהם ויוצאים כל שבוע שניים או שלושה\n\nהמבחן: נורא ואיום. בוריס החליט לדפוק את הסטודנטים והיה קשה בטירוף, כולם ניצלו את כל הזמן עד תומו. השאלות לא דרשו הבנה, רק מלא חישובים ומיזוג בין נושאים ברמה גבוהה מידי. \n\nהשורה התחתונה: ברוך שפטרנו", "timestamp": 1625579143141}, {"author": "הכי כנה בעיר", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה וזה לא משנה\nחוות דעת - הרצאות: גם זה לא משנה!\nשם המתרגל/ת: סשה, וואלה לא משנה\nחוות דעת - תרגולים: אחלה, אבל גם לא משנה\n\nשעורי הבית: ימממבה זמן שאבו לנו, אבל חכו לטיפ המרכזי!!\n\nהמבחן: עם קצת השקעה ויכולת, עוברים עם אחלה ציון\n\nהשורה התחתונה: יאללה הגעתם עד פה אז לא נפרט??\nככה, מדובר בקורס שהוא משאבת זמן מטורפת- שיעורי בית שלוקחים מלא זמן פלוס הרצאות ותרגולים שכל קשר בינם לבין המבחן/ השיעורי בית- מקרי בהחלט.\nאז מה עושים אתם שואלים?? אני אגיד לכם!!!\nיש קורס מרתון שמעביר בחור בשם ערן אברהם (לא מקבלים ממנו אחוזים בהבטחה!) , הבחור חריף רצח, בדיעבד, הכי כדאי פשוט לראות את כל המרתון שלו בתחילת סמסטר (יש לו הקלטות באולפן מקצועי ומדהים) ומשם פשוט לעשות שיעורי בית ולפתור מבחנים באופן עצמאי. כן כן עצמאי!! מבחן/ שניים בשבוע לגמרי יספיקו.\nקורס גרוע בכל מובן המילה, פשוט ללמוד לבד ורק ככה אפשר להצליח בדבר הזה... בהצלחה!!", "timestamp": 1625682719474}, {"author": "אסף סרוסי", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטסקאינן\nחוות דעת - הרצאות: מדהימה! ממש כיף להיות בהרצאות.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מתרגלת מצוינת, מאוד מסודרת ומאוד ברורה\n\nשעורי הבית: בדרכ לא קשים במיוחד, אבל היו כמה שאלות שהיו ברמה מעל התרגולים. סהכ תואמים את הרמה של המבחן\n\nהמבחן: נחמד מאוד, היה הוגן לדעתי מלבד שאלה אחת שהפתרון שלה היה קשה ולא ברור. 10 שאלות אמריקאיות לדעתי זה קצת לא מכבד כי על כל טעות משלמים ב10 נקודות\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1626022255173}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעניינות ומלמדות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יחסית קשים אבל מלמדים לקראת המבחן\n\nהמבחן: תלוי איזו שנה. יש שנים שהמבחן יותר קל מהבגרות ויש שנים שהמבחן קשה (אביב 21)\n\nהשורה התחתונה: קורס מעניין, ממליצה לעשות פק״ל עם עמית שלמה לפני המבחן כי הוא ממקד וממש עוזר.", "timestamp": 1626070881044}, {"author": "Alen", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: מרצה תותח , מסביר את הכל בצורה מוחשית ומנסה להדגים כל חומר בשביל הבנה טובה יותר. באמת מאוד מאוד מומלץ , וחוץ מהכל בן אדם מדהים.\n\nשם המתרגל/ת: סשה \nחוות דעת - תרגולים: מתרגלת טובה , יכול להיות היא טיפה מהירה לאנשים שמעדיפים קצב איטי . מנסה להסביר את הכל אבל עם שעה בשבוע בלבד כמעט ולא יכולה לעצור ולהסביר חומר לעומק.\n\nשעורי הבית: טיפה הורגש שעמוסים , דומים למבחנים ומצריכים הבנה טובה . מי שעושה אותם רק על הדרך בדרך כלל ימצא את עצמו יושב עליהם כמה שעות . \n\nהמבחן: לא ממש מראה את הבנת החומר , אמנם הוא מחובר לחומר של הקורס אבל מורגש שהוא נטו טכניקה ופחות הבנה ..\n\nהשורה התחתונה: קורס מעניין אבל חבל שיש אליו לפעמים פחות זמן במהלך סמסטר עמוס.", "timestamp": 1626188271980}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מדהימה, חובה ללמוד אצלה.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: רצה אבל מסבירה טוב. ממליץ עליה\n\nשעורי הבית: פעם בשבוע.שבוע וחצי קשה, אבל מרפסמים הרבה מראש אז זה כיף\n\nהמבחן: סביר. אמריקאי\n\nהשורה התחתונה: אחלה קורס. דורש השקעה אבל מעניין ולא מגזימים", "timestamp": 1626357142322}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: פשוט עשה לי את הסמסטר, בן אדם זהב שיתעקש יותר מכם על זה שתבינו את החומר, עושה מעל ומעבר בשביל סטודנטים, מסביר מעולה וממוקד.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: נותנת דגשים טובים, היא רצה ממש אבל זה יוצא ככה כי היא עושה חזרה ממש טובה על החומר התיאורטי בתחילת השיעור.\n\nשעורי הבית: קצת מעצבנים כי יכולים לקחת כמה שעות כל שבוע אם אתם לא זוכרים יותר מדי מהתיכון, אבל מאוד עוזרים להבנה של החומר\n\nהמבחן: פייר, חלק מהרעיונות ממוחזרים, השאלות לא נופלות מהשמיים\n\nהשורה התחתונה: תעשו לעצמכם טובה ולכו לגידי, הקורס הזה היה אמור להיות הקוץ ב... של הסמסטר ובזכות גידי הוא היה ממש קליל וזורם", "timestamp": 1626376358683}, {"author": "OK", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מסבירה מעולה. חשוב להבין את הדוגמאות שהיא מביאה כי לרוב אלה דברים עם עקרון ממש חשוב \n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: מלמדת ממש מהר, אבל מסבירה טוב\n\nשעורי הבית: קשוחים. לנסות להבין אותם ולא לרפרנס \" על עיוור\". חלקם הגדול קשה יותר מהרמה של המבחן. \n\nהמבחן: הוגן לגמרי. צריך לפתור כמה מבחנים משנים קודמות. העקרונות חוזרים מאוד .\nלתרגל המון ממבחנים ולפנות לזה מספיק זמן.\n\nהשורה התחתונה: מי שלומד טוב למבחן יצליח.", "timestamp": 1626547908954}, {"author": "ג", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: נהדרת ומקסימה. מסבירה מדהים ומסודר. ההדגמות בכיתה ממש נחמדות. מאוד מאוד מומלצת.\n\nשם המתרגל/ת: אביתר סבג\nחוות דעת - תרגולים: מסביר מאוד מסודר ועונה על שאלות בצורה משביעת רצון. \n\nשעורי הבית: לא עמוס יותר מדי, רקע במכניקה (מהתיכון/מכינה) בהחלט עוזר.\n\nהמבחן: מבחן הוגן, תלמדו רציני ובעיקר לחומר שלומדים בשבועות האחרונים (זה בערך שליש מהציון נראה לי?)\n\nהשורה התחתונה: הלוואי שכל הקורסים היו ככה.", "timestamp": 1626604994425}, {"author": "עומר כפיר", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מצויינת, מעבירה את החומר מעולה\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: הכי טובה ממי שהיו\n\nשעורי הבית: לא פשוטים - דורשים השקעה מסויימת\n\nהמבחן: לא מאוד קשה\n\nהשורה התחתונה: קורס מעניין!", "timestamp": 1626630483329}, {"author": "אלון", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה מעולה מסבירה הכי טוב שיש ובנוסף מתוקה אמיתית. \nהמלצה שלי תלכו אליה לכל קורס פיזיקה שאתם לוקחים\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: בגדול מסבירה מאוד טוב, הבעיה העיקרית זה שהיא רצה ולפעמים מתפספסות נקודות קטנות בגלל זה. בגדול מומלץ\n\nשעורי הבית: גליונות במודל, לרוב כל שבוע. לא קשים מדי.\n\nהמבחן: אמריקאי 10 שאלות. הוגן\n\nהשורה התחתונה: קורס מבוא ולכן לא הכי מרתק. לומדים קצת דברים מעניינים בסך הכל.", "timestamp": 1627838083548}, {"author": "נועה", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסיאן\nחוות דעת - הרצאות: לא ללכת לאף אחד אחר, רק אליה, נסיתי כמה מרצים והיא תותחית, מסודרת, רשימות מעולות שהיא מעלה לפני כל הרצאה, ומסבירה מעולה.\nלא לחפף בהגעה במיוחד לקראת הסוף כשמגיעים לדברים המסובכים באמת. \n\nשם המתרגל/ת: אלכסנדרה - סשה\nחוות דעת - תרגולים: לקראת התרגולים המאוחרים הלחץ להספיק את כל השאלות הורגש גם באופן שבו העבירה את התרגולים, אבל היא הכי טובה מבין המתרגלים, בשיעורים הראשונים נתנה הסבר מעולה על הכל כמעט כמו בהרצאה (לשיקול של כל אחד עד כמה הוא רוצה לנכוח, תמיד אפשר לעבור על התרגול לבד כי מעלים את כל הפתרונות), לי עזר הדרך שבה היא הסבירה ופתרה.\n\nשעורי הבית: כל שבוע בערך, לוקח זמן לסיים את הגיליונות אבל הם חשובים להטמעה והבנת החומר (מבחינת זמן השקעה זה לא נוראי, אבל כן דורש השקעה)\n\nהמבחן: משקף מאוד את שיעורי הבית, חשוב להטמיע את החומר.\n\nהשורה התחתונה: קורס הוגן, אחלה של צוות, שיעורי בית לא נוראיים, עומס לא כבד מידי.", "timestamp": 1633421077381}, {"author": "אני", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכל נוימן \nחוות דעת - הרצאות: מסודרת מאוד, משתדלת מאוד לענות על כל השאלות. הכיתה הרבה פחות מפוצצת משל המרצה השני שזה היתרון הכי חשוב\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: תראו את התרגולים שלו ביוטיוב, הוא ממש תותח. בהתחלה לא אהבתי בגלל שהוא מביא המון אביזרים וזה היה מוזר ויש לו שיטת לימוד מאוד ויזואלית אבל גיליתי שזה ממש עוזר ללמוד בקלות את החומר. ממליצה על התרגולים שלו מאוד!\n\nשעורי הבית: פעם בשבוע בערך גליון במודל, יותר קשים מהמבחן עצמו\n\nהמבחן: סך הכל דיי הוגן\n\nהשורה התחתונה: משקיעים שלוש שעות בשבוע בערך בכל הסמסטר ויהיה לכם אחלה ציון", "timestamp": 1643895722505}, {"author": "Saar Levy", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: הרצאות מעניינות עם אנרגיה גבוהה. קצת מבולגן אבל מאוד כיפי.  לפעמים מתעכב מאוד על כדי לוודא שכולם הבינו ולא מספיק הרבה. סך הכל מרצה טוב אבל הרבה פעמים השלמתי מהקלטות של חנה ואני ממליץ עליה יותר\n\nשם המתרגל/ת:  אלכסנדרה (סשה) בקמן\nחוות דעת - תרגולים:  מאוד יסודית ולא מקבלת מספיק זמן בשביל לעבור על הכל. תרגולים מאוד ברורים אבל מתעקשת לעשות חזרה יחסית מעמיקה על התאוריה לפני שמתחילים לפתור ואז לא מספיקים כי יש רק שעה. עדיין המתרגלת הכי טובה בקורס.\nרון בסלר לא מומלץ לדעתי! סתם עושה יותר מדי שואו. \n\nשעורי הבית:  לא לזלזל. בהתחלה יחסית קלים אבל משבוע 6-7 עולים רמה משמעותית, יותר קשים מהמבחן. כל גיליון לוקח 3-5 שעות וזה מרגיש קצת לא שווה בגלל שהקורס רק 2 נק\"ז.\n\nהמבחן: בין 10 ל12 שאלות אמריקאיות. אם עשיתם את כל שיעורי הבית אז לא קשה במיוחד, שבוע פלוס מינוס של למידה מספיקה בשביל המבחן. הרבה שאלות מנוסחות מוזר ומבלבל, מומלץ מאוד לשאול שאלות הבהרה בזמן המבחן.\n\nהשורה התחתונה:  בין הקורסים היותר קלים בסך הכל אבל משלב מסויים בסמסטר לוקח הרבה יותר מדי זמן בשבוע בשביל הנק\"ז שמקבלים. אבל כנראה שזה קורס חובה בשבילכם אז אין מה לעשות :)", "timestamp": 1643907591401}, {"author": "דניאל", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: אין דרך לתאר את החוויה להיות אצל גידי בהרצאות. מרצה מדהים בכל המובנים ויוצר אווירה שלא משתווה בכלל לקורסים אחרים. \n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: מתרגל תותח שדואג להעלות כל מה שהוא מלמד ליוטיוב כדי שיהיה פתוח לכולם. \n\nשעורי הבית: באיזשהי נקודה במהלך הסמסטר הם הופכים לקשים עד בלתי נסבלים.\n\nהמבחן: מאוד הוגן, לתרגל המון מבחנים ואפשר לקבל ציון פצצה.\n\nהשורה התחתונה: כיף בפיזיקה", "timestamp": 1643909340363}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: בן אדם מדהים! כיף להגיע לשיעורים ולשמוע את התשוקה שלו לפיזיקה. ממליץ מאוד ללכת אליו אם אפשרי.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: צר לי להשתמש באותה מילה שוב, אבל גם רון מדהים. כל התכנים של השיעור + עוד עולים לערוץ ביוטיוב שלו. איכשהו מצא דרך לשלב הדגמה / משהו מוחשי בשביל להסביר כל נושא - מאוד עזר להבין את הנושאים היותר מסובכים של הקורס (למשל תנע זוויתי).\n\nשעורי הבית: לוקחים כמה שעות בכל שבוע, אבל כדאי להשקיע ולעשות אותם - זה מכין טוב מאוד למבחן (יותר קשים מהמבחן).\n\nהמבחן: לא קשה במיוחד, אפשרי ואפילו סביר מאוד לקבל 100. 11 שאלות אמריקאיות - כל אחת 10 נקודות (סה״כ 110 נקודות)\nעצה שלי, לתרגל לתרגל ועוד לתרגל - השאלות חוזרות על עצמן ממבחני עבר.\n\nהשורה התחתונה: צוות קורס חד משמעית הכי טוב הסמסטר, קורס לא קשה מאוד - אבל כן דורש השקעה. אפשרי לקבל בוא 100.", "timestamp": 1644004719141}, {"author": "תום", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: המרצה/בנאדם הכי טוב בהיסטוריית המין האנושי. נותן הכל כדי שכולם יבינו אותו וגם יהנו מהחומר. תכלס הייתי בהופעות פחות כיפיות מהרצאות שלו.\n\nשם המתרגל/ת: שסה בקמן\nחוות דעת - תרגולים: יעילה וחדהת יודעת בדיוק מה צריך לדעת למבחן ומה לא. עזבו פקלים פשוט תראו אותה בלופים.\n\nשעורי הבית: טיפה קשים אבל לא חסרים רפרנסים והשאלות די חוזרות על עצמן מסמסטרים קודמים. חשוב לנסות לבד כדי לא לקבל שוק במבחן.\n\nהמבחן: הוגן בסך הכל 10 שאלות אמריקאיות + אחת בונוסת גם אם לומדים חצי קלאצ' אפשר לעבור בקלות. אבל כדאי להשקיע כי ציון טוב ממש אפשרי פה. זה לא חדוא.\n\nהשורה התחתונה:  אחלה קורס ואחלה סגל. ומומלץ מאוד לראות את ערוץ היוטיוב של רון בסלר ( אחד המתרגלים). מאוד עוזר.", "timestamp": 1644087638512}, {"author": "בן", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מדהים! חד משמעית הסיבה למה הממוצע  גבוה בהרבה מסמסטרים קודמים.\n\nשם המתרגל/ת: אלדנה\nחוות דעת - תרגולים: ממש טובה ויסודית, משלימה פערים מההרצאות ומלמדת טכניקות טובות\n\nשעורי הבית: עמוסים אבל כדאי לנסות לפתור לבד בלי רפרנסים (או אם מסתכלים  על הרפרנסים להבין דרך פתרון)\n\nהמבחן: ממש הוגן עם שאלת בונוס\n\nהשורה התחתונה: בזכות גידי קיבלתי 100 באמת מרצה פצצה מומלץ מאוד. שמעתי גם על המרצה השנייה שהיא גם מעולה. מומלץ ולא מומלץ מאוד כי בכל זאת קורס חובה...", "timestamp": 1644171017167}, {"author": "יהיה בסדר", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי \nחוות דעת - הרצאות: השמועות נכונות והאדם באמת אחד המקסימים שפגשתי בחיי. איכפתי ומסור ברמות שפשוט יפה לראות. ההרצאות שלו מפוצצות אז זה משהו שצריך לקחת בחשבון.\n\nשם המתרגל/ת: רון וסשה\nחוות דעת - תרגולים: סשה מקצועות, תכלסית ועיניינית, מתרגלת מעולה לדעתי.\n רון אכפתי בטירוף, ובאמת עושה את מירב מאמציו למען הסטודנטים, וזה ניכר. תמיד דאג להעלות הכל לערוץ היוטיוב והיה מאוד זמין לעזרה במייל. הקטע אצל רון שהוא מאוד שם דגש על הדגמות חיות, שזה נחמד אבל בסופו של דבר לפעמים עשוי להרגיש כמו קרקס ולא תרגול, אבל אני מניח שזה עיניין של טעם.\n\nשעורי הבית: די קלילים. גיליון אחת לשבוע לרוב  \n\nהמבחן: גם היה די קל, ממוצע גבוה.\n\nהשורה התחתונה: צוות מעולה (!) והחומר די נחמד. לא להיות יותר מידי שאננים עם הקורס כי בשבועות האחרונים הרמה טיפה עולה", "timestamp": 1644178899398}, {"author": "Oph", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיכל נוימן\nחוות דעת - הרצאות: מאוד מסודרת, מסבירה בצורה נעימה ועומדת בקצב\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: רצה על התרגילים בקטע טוב, מסבירה מובן\n\nשעורי הבית: היו לפעמים מאוד קשים ודרשו הרבה זמן\n\nהמבחן: לא קשה, יש שאלת בונוס והממוצע מאוד גבוה\n\nהשורה התחתונה: בסדר בסך הכל", "timestamp": 1644225924662}, {"author": "Aviv Baltsan", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: ההרצאות נהדרות. גידי מרצה מיוחד ואדם ענק ואני בטוח שכל מי שהיה איתו אפילו בהרצאה אחת שם לב לזה מיד. רמת האכפתיות מהסטודנטים היא מעל ומעבר למה שהכרתי מקורסים אחרים – בין אם מדובר בלתת מקום לשאלות בשיעור או בין אם מדובר בשעות קבלה. החיסרון היחיד הוא שסגנון ההרצאה שלו הוא קצת מפוזר ואסוציאטיבי, אבל הוא תמיד שמח לענות על שאלות ככה שבתכלס אם לא מבינים זו לא בעיה.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: אחד המתרגלים הכי משקיענים שיצא לי להיתקל בהם. בנוסף לתרגולים המעולים רון מתחזק גם עמוד יוטיוב, לשם הוא מעלה את כל התכנים מהתרגול בנוסף לעוד תכנים אקסטרה שיכולים לסייע. מומלץ לצפות.\n\nשעורי הבית: שיעורי הבית יחסית מאתגרים אבל הם חזרה מעולה על החומר. הרמה שלהם יותר גבוהה מהמבחן והם מהווים גם אחוז ניכר מהציון הסופי, אז ממליץ מאוד לעשות אותם. לא חושב שהם לוקחים יותר מ-3 שעות בשבוע.\n\nהמבחן: המבחן לא קשה אבל עדיין ברמה. הוא הוגן ומכסה את החומר של הקורס. סגנון השאלות חוזר ממבחני עבר ולכן ממליץ מאוד לתרגל!\n\nהשורה התחתונה: לא חושב שיש לכם יותר מדי בחירה לגבי לקחת את הקורס או לא אבל סך הכול הוא באמת כיפי ומעניין, והסגל רק עושה חשק ללמוד.", "timestamp": 1644350210045}, {"author": "אבישג.ד", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nהמרצה והבן אדם הכי מיוחד ונהדר שפגשתי. איש מקסים שאוהב פיזיקה. גידי קצת מבולגן אבל מלא באנרגיות וכיף לבוא להרצאות שלו. ממליצה בחום ללכת אליו. הוא מרצה לכל החיים. מסביר בצורה נהדרת את עיקר הקורס.\nשם המתרגל/ת: רון בסלר האחד והיחיד\nחוות דעת - תרגולים: \nלכו רק לרון בסלר. הוא המתרגל הכי טוב בקורס. פשוט לכו אליו ותצליחו בבחינה. הוא מסכם ומפרט ומסביר בדיוק את מה שצריך ומסביר בצורה הכי טובה שיש. אכפת לו מהסטודנטים והוא מכין את השיעורים בקפדנות ואוהב ללמד. בניגוד מוחלט עומד ינאי- אל תלכו אליו הוא לא יודע להסביר ולא אכפת לו מהסטודנטים. הוא פשוט פותר לעצמו שאלות על הלוח ולא מבינים את הכתב שלו בכלל. הוא תמיד מגיע באיחור לתרגול.\nשעורי הבית: \nשיעורי הבית מעולים. תעשו אותם הם פשוט שאלות ממבחנים קודמים. הם טובים והם ברמת מבחן.\nהמבחן: \nהמבחן הוגן וטוב. ניתן לקבל בו 100 די בקלות אם לומדים את החומר טוב ומתרגלים כמה וכמה מבחנים.\nהשורה התחתונה: \nלכו לגידי ולרון בסלר ותצליחו. הקורס הכי כיפי בסמסטר", "timestamp": 1644961695228}, {"author": "sahar", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מלך מלך מלך\nאנרגיות מטורפות ועשה לי את הסמסטר. מתיחס בכבוד והערצה לסטודנטים ושואף ללמד ברמה הכי גבוהה שכולם יבינו את החומר.\nאין מקצועי ומסור ממנו.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: בשל קוצר של זמן, שעה בשבוע, רצה על החומר במהירית האור ומנסה את המיטב. בגלל הלחץ של הזמן היא משרה לחץ בכיתה ותחושה לא נעימה.\n\nשעורי הבית: \nלא פשוטים בכלל אבל לפתור אותם ללא רפרנס ויש לך מאה במבחן\nהמבחן: קשה אבל אם רוצים מספיק אפשר להגיע ל3 ספרות.\n\nהשורה התחתונה: תפתרו מלא מבחנים.", "timestamp": 1645052076317}, {"author": "צ", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי \nחוות דעת - הרצאות: מרצה תותח אין מרצה אחר שמשתווה אליו בקורס.\n\nשם המתרגל/ת: רון בסלר \nחוות דעת - תרגולים: רון מתמקד יותר בערוץ היוטיוב שלו מאשר לעשות תרגולים.\nחד משמעית לא מומלץ!!!\nשעורי הבית: קשים אך מאוד תורמים למבחן.\n\nהמבחן: אמריקאי אז יחסית יותר פשוט מקורסים אחרים.\nצריך לשים לב לזה שצריך לעגל כי זה משהו שחוזר הרבה!!\n\nהשורה התחתונה: קורס קל עם מבחן אמריקאי עם השקעה מיינמלית עוברים", "timestamp": 1645384656071}, {"author": "I.V", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: גידי הוא משהו לא מהעולם הזה, כיף לבוא להרצאות רק בשביל האווירה, אפילו לא בשביל החומר. כמו שעתיים של רוגע לנפש. \nמעבר לזה הוא משקיע בטירוף בשעות קבלה ובאמת עושה הכל שהחומר יובן. באמת מרצה שאני לא חושב שאפגוש אחד כמוהו.\n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: אין זמן בתרגולים ובקושי מבינים משהו, אבל היא עושה מאמץ להספיק מה שאפשר ובסה\"כ במהלך התרגול היא בסדר, אבל סשה באופן כללי די עייפה וביטלה כמה תרגולים בלי סיבה אמיתית. שעות הקבלה שלה חסרות תועלת.\n\nשעורי הבית: קשים רצח למי שעברו לו שנים מהתיכון. יש תרגילים שפשוט אי אפשר לפתור בלי רפרנס ואין שום יכולת להבין מה לעשות שם (אולי בשעת הקבלה של גידי..). זה די דפוק ויוצר מצב שבו משקיעים בש.ב. כמות זמן לא הגיונית בכלל ביחס לנק\"ז.\n\nהמבחן: אם הצלחתם את שיעורי הבית והבנתם את החומר, המבחן יהיה קל. יש גם בונוס אז 100 זה ריאלי.\n\nהשורה התחתונה: קשה באימונים קל בקרב.", "timestamp": 1645393236516}, {"author": "Hay Zagory", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מרצה שבאמת אוהב מה שהוא עושה ומאוד נהנתי מההרצאות, הורגש שהרמה במבחן ושיעורי בית הרבה יותר גבוהה מרמת הלימוד בהרצאה\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: תותח על, אין מצב לקורס בלעדיו \n\nשעורי הבית: מתוך מבחני עבר, קשים יחסית\n\nהמבחן: לא קשה מידי, צריך ללמוד טוב ממבחני עבר ולהיכן נוסחאות טוב וזה מספיק\n\nהשורה התחתונה: קורס קשה אבל הוראה טובה (בעיקר תרגולים)", "timestamp": 1646687796238}, {"author": "Emi", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: גדעון אלון - גידי\nהמרצה הכי מדהים בעולם, כל הרצאה חוויה. נותן מעצמו, לקראת המבחן מוסיף שעות קבלה, בכללי מדהים.\n\nשם המתרגל/ת: סשה בקמן\nחוות דעת - תרגולים: מתרגלת חדה, תרגולים מהירים אבל אין ברירה, עונה על שאלות בצורה טובה.\n\nשעורי הבית: \nלא קלים בכלל.\nהמבחן: סביר\n\nהשורה התחתונה:", "timestamp": 1647250168134}, {"author": "ס", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: \nגידי פשוט מושלם!!! לב זהב, אכפת לו מכל סטודנט וסטודנט (ויש אצלו מאות סטודנטים) כל כך אכפתי ודואג שנבין הכל, באמת חוויה ללמוד אצלו\nשם המתרגל/ת: סשה ורון בסלר\nחוות דעת - תרגולים: בהתחלה הייתי אצל רון, הוא ממש אכפתי ואוהב את החומר אבל לדעתי היה קצת יותר מידי תיאטרלי והתרגולים היו לוקחים יותר זמן\nסשה מתקתקת את החומר מסבירה מעולה \n\nשעורי הבית: גליון אחד פעם בשבוע, לא נורא\n\nהמבחן: המבחן היה ממש סבבה אפשר להוציא ציון גבוה, תכינו דף נוסחאות טוב\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1647344654923}, {"author": "Yonina", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: היא ממש חמודה ומאוד עוזרת בשיעורי בית וכל בעיה אחרת. \n\nשם המתרגל/ת: סשה\nחוות דעת - תרגולים: אלופה! מסבירה את החומר ממש טוב.\n\nשעורי הבית: ממש סבירים\n\nהמבחן: אפשר להוציא בו ציון טוב\n\nהשורה התחתונה: תפתרו כמה מבחנים ואז אתם ממש תצליחו במבחן.", "timestamp": 1647736052437}, {"author": "Ali", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nגידי פשוט קסם, עושה את ההבדל, נותן את הנשמה. מצד שני קשה לעקוב אחריו גם על הרשימות שלו כי הוא קצת קופץ\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשיםםםםםן!!!!! דורשים הרבה זמן בטח יחסית לנז\nהמבחן: יותר קשה משנים קודמות. ישים אבל לא פשוט בכלל\n\nהשורה התחתונה:", "timestamp": 1647864344799}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גידי + המוקלטות של חנה\nחוות דעת - הרצאות: גידי מרצה מעולה, מאוד אכפת לו מההבנה של כל סטודנט בכיתה והוא מאוד מעודד שאלות בזמן ההרצאה, אבל בגלל זה הוא טיפה מתפזר בהרצאות שלו ולא לכולם זה התאים. מתישהו באמצע הסמסטר עברתי להקלטות של חנה וגם הן מצוינות. סה\"כ אם גידי וחנה מרצים את הקורס תנסו את שניהם כי שניהם ממש מעולים.\n\nשם המתרגל/ת: המוקלטים של רון בסלר\nחוות דעת - תרגולים: הקטע אצל רון זה שאפשר ללמוד את כל הקורס מהערוץ יוטיוב שלו. אם אתם מתחברים לצורה שבה הוא מתרגל, יש הקלטות שמכסות 100% מהקורס ועוד ביוטיוב שזה הכי נוח. לי זה ממש התאים ופשוט רצתי עם זה כל הסמסטר, ממליץ.\n\nשעורי הבית: שני גיליונות כל שבוע, אחד זה תרגיל הכנה שהוא ממש קצר ואחד זה הגיליון הרציני. תעשו אותם כל שבוע ואתם מסודרים על החומר. יש רפרנסים להרבה שאלות (למרות שעדיף לנסות בלי).\n\nהמבחן: היה הוגן, אפשר בלי הרבה למידה לקבל ציון לא רע בכלל ואם ממש משקיעים כל הסמסטר אפשרי גם להגיע לציונים גבוהים מאוד. המבחני עבר ממש חוזרים על עצמם.\n\nהשורה התחתונה: סהכ קורס בסדר. לא החומר הכי מעניין אבל הסגל מעולה והקורס עצמו לא עמוס יותר מדי.", "timestamp": 1656961218245}, {"author": "לורנץ", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמרצה מעולה, מסודרת, אכפתית, גיבורת על שמצילה אנשים במילואים בזמנה הפנוי. יש לה הקלטות מעולות שתואמות אחד לאחד את הנלמד בכיתה. מרוב דוגמאות וטיפים פרקטים התרגולים מרגישים כמעט לא נחוצים.\n\nשם המתרגל/ת: אלדנה מוקלטים.\nחוות דעת - תרגולים: \nנחמדים, עוזרים להיחשף לעוד שאלות שאפשר להעתיק אחד לאחד לגיליון/מבחן. בסוף המטרה זה להיחשף לכמה שיותר שאלות מגוונות.\nשעורי הבית: \nיש תרגילי הכנה שהם ממש קלילים ויש את הגליונות בית שיותר קשים מהמבחן- עדיף לא לרפרנס אבל גם אם כן, עדיין אפשר להצליח בגדול במבחן.\nהמבחן: \nממוחזר אבל דורש כן לעבור על הרבה מבחני עבר ולהכיר כמה שיותר אופציות לשאלות. תכינו דף נוסחאות אישי שאתם צריכים ולא את הדפים המוגזמים שיש בדרייבים. \nיש בדרך כלל בין 10 ל12 שאלות במבחן, באזור ה2-3 טריקיות וכל השאר ממש סבבה.\n\nהשורה התחתונה: \nקורס לא עמוס אבל דורש למידה רציפה כל הסמסטר ואפשר להוציא בו ציונים יפים.", "timestamp": 1657004780756}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מרצה מעולה מנגישה את החומר בצורה טובה בזמן ההרצאה, מעלה לאתר את כל הסיכומים וההקלטות. \n\nשם המתרגל/ת: אלדנה\nחוות דעת - תרגולים: סהכ אחלה מתרגלת מתאים למי שלא אוהב כיתה עמוסה\n\nשעורי הבית: דורשים הרבה זמן והרבה מעל רמת המבחן\n\nהמבחן: שאלות קצרות שבודקות בעיקר את ההבנה ולא מסובכות מבחינת חישובים, מבחן מאוד הוגן. \n\nהשורה התחתונה: קורס לא קשה מידי עם ממוצע יחסית גבוה", "timestamp": 1657183499473}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מדהימה- קשובה, סימפטית, מסבירה מעולה ותותחית בחומר. אם מסתדר ללכת להרצאות שלה אז מדהים. אם לא אז היא גם מצויינת בהקלטות מסמסטרים קודמים. ככה שאפילו כדאי לשקול לראות הקלטות שלה מאשר ללכת למרצה אחר.\n\nשם המתרגל/ת: סשה \nחוות דעת - תרגולים: מסבירה מעולה את החומר התיאורטי, לפעמים לא מספיקה לפתור מספיק תרגילים כי אין זמן.\n\nשעורי הבית: קשים בהרבה ממה שרואים בתרגולים ובהרצאות. בתכלס הש.ב קשים יותר אפילו מהרמה של המבחן.\n\nהמבחן: כמות השאלות משתנה בין הסמסטרים, אבל זה תמיד אמריקאי. המבחן היה הוגן ברמה אבל היו שאלות טריקיות מבחינת הניסוח.\n\nהשורה התחתונה: קורס טוב שעם השקעה סבירה אפשר לצלוח אותו בפנאן. עם השקעה קצת יותר גדולה אפשר להוציא ציון פצצה.", "timestamp": 1657522627242}, {"author": "mip", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה! יש לה סיכומים מעולים להרצאות! אני ראיתי את ההקלטות שלה יחד עם הסיכומים, הוספתי הערות איפה שצריך וזה היה מעולה!  (ממש עוזר לסדר את המערכת להיות יותר גמישה) \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: סרטונים של רון בסלר ביוטיוב עוזרים ממש, ויש גם הקלטות בפונפטו\n\nשעורי הבית: סבבה, מידי פעם יש שאלה שוברת שיניים אבל סהכ בסדר\n\nהמבחן: קשה להגיד, פתאום יכולה להיות שאלה הזויה\n\nהשורה התחתונה:", "timestamp": 1658763519150}, {"author": "ליאור", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nהרצאות מסודרות מאוד ,\nמעט פיתוחים מיותרים אך עוזרים להבין מהיכן כל נוסחא מגיעה. \nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: \nמאוד זמין ומוכן לסייע תמיד. \nשעורי הבית: \nדורשים השקעה\nהמבחן: \nהוגן \n\nהשורה התחתונה: \nקורס שדרושה בו השקעה אך הוא מאוד טכני.", "timestamp": 1658941571529}, {"author": "שרון", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מדהימה!!!!! למדתי מההקלטות שלה כי לא הסתדר לי במערכת ללכת להרצאות. ברורה, מסבירה טוב, נחמדה.\nהייתי גם אצל גידי- הוא נחמד אבל קצת מפוזר בשיטת לימוד ופחות התחברתי.\n\nשם המתרגל/ת: ינאי \nחוות דעת - תרגולים: בכללי התרגולים בפיסיקה 1 לא כל כך רלוונטיים למבחן.\n\nשעורי הבית: קשים בשלוש רמות מהמבחן. \n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: ללמוד אצל חנה ולא להתרגש משיעורי הבית, הם לא משקפים מה שיהיה במבחן.", "timestamp": 1658941746085}, {"author": "L", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה טובה מאוד, הבנתי כל דבר בהרצאה שלה, מסבירה את נושאים בצורה מושלמת\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: עונה על כל שאלה, מסביר טוב את נושאים, עובר בתרגול על נושאים בצורה טובה.\n\nשעורי הבית: נהפכים ליותר קשים ככל שקורס מתמשך.\n\nהמבחן: דורש השקעה גדולה\n\nהשורה התחתונה: קורס שיש בו שעת תרגול אחת שלא מספיקה", "timestamp": 1659109365840}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: המרצה הכי טובה שיש! מלמדת בצורה מסודרת וברורה. היא מפרסמת מראש במודל את הרשימות של ההרצאות שלה, ומלמדת בהרצאה כמעט באותו סדר בדיוק. ממש נוח לייצא מראש לטבלאט את הרשימות ואז במקסימום להוסיף הערות על מה שכבר כתוב שם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אחרי שניסיתי כמה מתרגלים הבנתי שלמתרגלים בקורס הזה אין ערך מוסף. צוות הקורס מפרסם מראש במודל את הקבצים של התרגולים ואת הפתרונות שלהם. הספיק לי לעבור על זה באופן עצמאי.\n\nשעורי הבית: בכל נושא יש תרגילי הכנה (אמורים לפתור לפני שעושים את התרגול הרלוונטי, הם שטות מוחלטת) וגיליון שיעורי בית. הגיליונות דורשים קצת השקעה, אבל הרמה שלהם פיירית ומשקפת את רמת המבחן.\n\nהמבחן: שאלות אמריקאיות, מכסה את רוב החומר. מבחן הוגן סך הכל.\n\nהשורה התחתונה: חנה תותחית על. קורס סבבה סך הכל.", "timestamp": 1662365738985}, {"author": "הסקייטבורד של רון", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: נירית מרזל\nחוות דעת - הרצאות: מבחינת איכות ההוראה היא טובה מאוד. נירית גם באה לקראת הסטודנטים מעל ומעבר, תמיד הייתה זמינה לשאלות ונתנה אפשרות לצפות בשיעור בזום והקלטות שזה לא מובן מאליו לכיתה של 20 איש. \n\nשם המתרגל/ת: רון בסלר ביוטיוב\nחוות דעת - תרגולים: ההשקעה של רון בהנגשת התרגולים שלו עם ערוץ יוטיוב ענק ואתר משלו היא פשוט מדהימה בכל קנה מידה. צפיתי כמעט בכל הסרטונים של פיסיקה 1 שהוא העלה, אבל בסופו של דבר לסטודנט הממוצע לא הייתי ממליץ ללמוד בשיטה הזאת. אבל אציין קודם את הדברים הטובים - מבחינת איכות ההוראה רון לוקח את כל המתרגלים בהליכה. הוא מלמד עם המון תשוקה ובאמת גרם לי לאהוב פיזיקה למרות שלא התחברתי אל המקצוע הזה בתיכון. \nאז למה אני לא ממליץ?\nהבעיה הראשונה והעיקרית היא שזה פשוט ארוך מדי. תרגול של 50 דקות הופך ל-90 דקות, והרבה פעמים הוא חוזר על החומר של ההרצאה או חוזר על עצמו. לי בקיץ לא היה מחסור בזמן אבל בסמסטר רגיל זה היה מציק. עוד בעיה שכבר ציינו פה היא שהוא משתמש בהרבה טריקים ושטיקים שאף אחד לא צריך כשיש דף נוסחאות בבחינה, וזה סתם מסיח. בעיה נוספת שהמצלמה כל הזמן קופצת ממקום למקום ולא הכי נוח ללמוד ככה.\n\nאגב, יש לו בערוץ גם פתרונות להמון שאלות משיעורי הבית ומבחני עבר, אותי זה הציל לא מעט פעמים וממליץ בחום לבדוק את הערוץ שלו רק בשביל זה.\n\nשעורי הבית: לנו בקיץ היה פורמט קצת שונה, 12 גיליונות רגילים בלי תרגילי הכנה. כפי שאמרו פה זה יותר קשה מהמבחן אבל שווה להשקיע ולפתור ולא להכנע לרפרנס.\n\nהמבחן:  אחד המבחנים הקלים שהיו לי בתואר (אחרי שנתיים). המבחן הזה בגדול בא לבדוק אם אתם יודעים להשתמש בנוסחאות, לא צריך יותר מדי הבנה.\n\nהשורה התחתונה: הקייטנה הכי טובה שיש לטכניון להציע.", "timestamp": 1663672215853}, {"author": "ללא", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין על חנה מסבירה טוב יש הרצאות מוקלטות שמקיפות רוב החומר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא הלכתי לתרגולים בהתחלה צפיתי בהקלטות באמצע הסמסטר הרגשתי שהם מיותרות אז הפסקתי הרגשתי שחנה מקיפה גם התרגולים \n\nשעורי הבית: לא משהו שלא פתיר אבל הרמה מונוטונית עולה התקשיתי קצת באמצע הסמסטר אבל בסדר תנסו לקבל ציונים מלאים בשיעורי בית משפרות הציון הסופי\n\nהמבחן: אני אוהבת את חנה בגלל שלמועד א ו ב אותה רמת קושי היה בינוני לא משה שקשה במיוחד הבנת החומר מההרצאות ו שיעורי בית עזרו בהכנה למבחן\n\nהשורה התחתונה:", "timestamp": 1664549488418}, {"author": "הבמ", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: הרצאות מעולות, מעבירה את החומר בצורה מובנת לחלוטין\n\nשם המתרגל/ת: לא הלכתי לתרגולים אחרי כמה תרגולים גרועים\nחוות דעת - תרגולים: \n\nשעורי הבית: בסדר\n\nהמבחן: בסדר\n\nהשורה התחתונה: קורס חביב עמוס במידה הנכונה", "timestamp": 1666287396635}, {"author": "סטודנט להנדסה", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה טוב סך הכל, הדוגמאות שהיא נותנת הרבה יותר קלות מהנדרש.\n\nשם המתרגל/ת: מנגל עילי\nחוות דעת - תרגולים: בגדול כל המתרגלים לא היו מדהימים.\n\nשעורי הבית: קשים מאוד, הרבה יותר קשים מהמבחן. תרגישו חופשי לרפרנס אותם אחרת זה יקח ימים ומי שיש לו זמן לכו לשעות קבלה.\n\nהמבחן: הוגן\n\nהשורה התחתונה: בסוף הקורס תקחו מרתון של ערן אברהם כי בתכלס הוא תותח ומלמד יותר טוב מכל צוות הקורס.", "timestamp": 1666574582325}, {"author": "iGGor", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי\\ סשה (אלכסנדרה)\nחוות דעת - הרצאות: שניהם מרצים טובים אבל בצורה שונה: גידי מאוד דרמטי ועושה הצגות ודברים הזויים כמו לזרוק מחבתות או לגלוש על סקייטבורד ולצעוק (מהתרגשות, לא מכעס) והוא מסביר הכל בצורה שגורמת לך להרגיש שאתה בכיתה טיפולית. הוא מאוד נחמד ומאוד תומך בסטודנטים אבל מי שרציני ורוצה את החומר ישר ולעניין אז קצת ימאס לו ממנו.\n\nלעומת זאת סשה (ד\"ר אלכסנדרה בקמן) מאוד מקצועית ומסבירה את החומר מהר אבל מאוד ממוקד ובצורה מובנת וברורה, עם דוגמאות הסברים ומענה על שאלות. היא גם מאוד נחמדה אבל מבינה שיש לה הרבה חומר להעביר, בניגוד לגידי שקצת מתפזר בהרצאות שלו.\n\nשם המתרגל/ת: ינאי\\אלדנה\nחוות דעת - תרגולים: אם המרצים מצויינים אז המתרגלים הם ההופכיים להם- התרגולים כל כך מזוויעים שרוב מי שלקח את הקורס לא הלך לתרגולים כי זה ממילא שעה אחת בשבוע וגם אם באים אז מרגישים בזבוז זמן. אלדנה לפחות מגיבה לסטודנטים, ינאי בכלל עם עצמו ופשוט רושם על הלוח.\n\nהמלצה שלי: תראו את ההקלטות של רון בסלר.\n\nשעורי הבית: כל שבוע עולים משמעותית ברמה, ובכללי לעומת מבחני עבר הם ברמה מאוד גבוהה אבל במזל כמעט כל שיעורי הבית ממוחזרים ולכן אפשר לרפרנס. הרוב מרפרנסים...\n\nהמבחן: עדיין לא היה (עוד שבועיים) אבל מבחני עבר היו אמריקאים ולא קשים בכלל. חלק גדול יחסית מהשאלות על ה-3 הרצאות האחרונות אז קשה ללמוד הרבה זמן מראש. מותר להביא דף נוסחאות מהבית (שני דפים עם מה שאנחנו רוצים).\n\nהשורה התחתונה: קורס ממש סבבה, קצת מפחיד בגלל כל המדרים והוקטורים אבל מאוד מאוד סביר וגם המרצים מצויינים. התרגולים בזבוז זמן וחבל שכך...", "timestamp": 1673973641992}, {"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: אם יש לכם את האופציה ללכת לגידי תלכו, תנסו ותחוו בעצמכם, כי אי אפשר לתאר במילים את ההרצאות שלו. למרות שהחומר בפיזיקה מורכב, גידי משרה כל כך הרבה רוגע ואווריה טובה בשיעור שהמסובך הופך למובן, מעניין ומסקרן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1674771957480}, {"author": "יאפ", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: סשה / גידי\nחוות דעת - הרצאות: שניהם מרצים טובים, סשה יותר טכנית וגידי אנרגטי ויותר מראה דוגמאות ובאופן כללי לטעמי ההרצאות שלו היו טיפה קרקס. כל אחד התחבר למישהו אחר והשורה תחתונה שניהם מעולים\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: מאה שמונים מעלות מהמרצים. מזעזע. מיותר ולא ברור וסתם בזבוז זמן.\n\nשעורי הבית: זה הולך ונהיה הרבה יותר קשה\n\nהמבחן: הוגן\n\nהשורה התחתונה: זה קורס שבהתחלה מרגיש קל ולא יותר מידי מסובך, וזה ממש לא נשאר ככה אז מי שהוריד את הרגל מהגז כמוני בילה שעות מול הסרטונים של רון בסלר", "timestamp": 1675093721516}, {"author": "o.k", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה:גידי/סשה\nחוות דעת - הרצאות: שניהם מעולים,תלוי איך נוח לכל אחד ללמוד.\nגידי יותר משלב בהרצאות דברים מצחיקים/מעניינים ומראה דוגמאות בלייב ולפעמים הוא טיפה סוטה מנושא השיעור לדברים וסיפורים אחרים(לדעתי זה יתרון ולא חיסרון)  וכשצריך לפני מבחן הוא מוסיף שעות לימוד או שעות קבלה.סשה לעומתו יותר זריזה מבחינת חומר,מתקדמת מהר עושה תרגילים עונה על שאלות ומאוד תכליתית.\n\nשם המתרגל/ת: ינאי\n\nחוות דעת - תרגולים: \nלא כזה נורא אבל החלט טעון שיפור, לפעמים הוא רץ יותר מדי ואפילו לא מנסה לבדוק אם למישהו יש שאלה.\nשעורי הבית:\nהם כן יותר קשים מהרמה של המבחנים אבל זה לא שהם בלתי פתירים,רובם גם ממוחזרים אז אפשר לרפרנס במקרה הצורך.\nהמבחן: הוגן.\nהשורה התחתונה: קורס נחמד מאוד להעלאת הממוצע ובנוסף מעניין מאוד.", "timestamp": 1675360910389}, {"author": "ביאטריס מיסלר", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: סשה/אלכסנדרה בקמן\nחוות דעת - הרצאות: \nמרצה מעולה,חשוב לה ממש ההבנה של התלמידים,היא כן מדגימה לפעמים אבל ההדגמות מרגישות קצת ישנות\nנהנתי אצלה בהרצאות כי גם לא היה מפוצץ ותמיד היה איפה לשבת וגם בזום הכל היה משודר מעולה.\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: תכלס לא הייתי כי אחרי שני ניסיונות לא רצופים הבנתי שאין פואנטה בתגולים שלו,היה משעמם ברמות ולא באמת הצלחתי לעקוב אחרי מה שהוא מנסה להסביר,הכתב לא ברור והוא רץ על החומר\n\nשעורי הבית: \nסבל.צריך לצוד רפרנסים והשיעורי בית מרגישים כל כך תלושים מההרצאות ומהרשימות של התרגול וכל שבוע נפתח גם תרגיל הכנה וגם גיליון חדש\nהמבחן: \nלא היה נורא בכלל,פשוט צריך לפתור לפחות 10 מבחנים(ולהבין ולכתוב בדף נוסחאות מההתחלה של הקורס גם את השיעורי בית) כל השאלות חוזרות על עצמם בסופו של דבר\nהשורה התחתונה: זה קורס חובה אז אין יותר מידי,רון בסלר ממש עזר לי ובתכלס לדעתי לא חייב להגיע לכל ההרצאות והתרגולים אם קוראים את הרשימות ולומדים ופותרים מבחנים שבוע לפני המבחן", "timestamp": 1675703514720}, {"author": "Niv Maman", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי המלך \nחוות דעת - הרצאות: רואים כמה שגידי אוהב ללמד וכמה יש לו תשוקה ולבני אדם ולפיזיקה. הוא כן קצת מבולגן אז צריך להקשיב טוב בהרצאות אחרת אפשר לאבד אותו. אבל הוא מסביר את החומר ממש ממש ממש טוב והוא מלךךךךךך אין אנשים כמוהו. כיף לצפות בו פשוט.\n\nשם המתרגל/ת: אלדנה \nחוות דעת - תרגולים: התרגולים מיותרים ברמות. תצפו ברון בסלר ואתם מסודרים. התרגולים מרדימים ומשעממים. רון בסלר יותר טוב בפער.\n\nשעורי הבית:  לא פרופרציונליים לחומר שנלמד בקורס בשום צורה. אל תתנו לזה לתסכל אתכם שאתם לא מצליחים זה סתם קשה ברמה לא פרופרציונלית.\n\nהמבחן: סביר לגמרי והוגן. שימו לב מי המתרגל האחראי הסגנונות ממש שונים. שלומית טרם מגזימה ברמה.\n\nהשורה התחתונה:", "timestamp": 1675713537767}, {"author": "ניק", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מתלהב בטירוף מהחומר. מי שמתחבר לזה יהנה מאוד מההרצאות, לי אישית היה הרבה יותר נוח בפרונטלי מההקלטות שלו.\n\nשם המתרגל/ת: אלדנה מוקלט\nחוות דעת - תרגולים: נחמד, לא הרגשתי שמוסיף לי המון, כנראה בגלל שהיה בהקלטות.\n\nשעורי הבית: בהתחלה סבבה, בהמשך נהיה נוראי, גליון שבועי במודל שבסוף נהיה ממש קשה ולוקח יחסית הרבה זמן.\n\nהמבחן: 12 שאלות אמריקאיות, סך הכל מאוד מאוד טכני, מי שעובר על החומר כמה ימים ומתרגל כמה ימים יצליח.\n\nהשורה התחתונה: בתור אחד שלא היה על הקורס, למדתי הכל בשבוע לקראת המבחן והיה ממש סבבה אז לא להילחץ.", "timestamp": 1675720194059}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: כדאי מאוד מאוד ללכת להרצאות של גידי בגלל שגם בלי קשר לפיסיקה הוא בן אדם שנכנס ללב. הסטודנטים שלו מאוד חשובים לו והוא יקדיש כמה שהוא צריך מהזמן שלו על מנת שסטודנט יבין.\nלפעמים הוא יכול להיות קצת מפוזר, אבל זה חלק מהעניין.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לפעמים שאלות מנוסחות בצורה לא ברורה אבל ש.ב לא מאוד קשים\n\nהמבחן: \n\nהשורה התחתונה: קורס שאמור להיות די קל", "timestamp": 1675854595812}, {"author": "lior zaphir", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: \nגידי הוא המרצה היחיד בטכניון שבאמת הנחיל בי אהבה למקצוע למרות הלחץ והציונים. הוא מסביר את החומר בצורה ברורה אם כי לפעמים מעט מפוזרת אבל אף לא משעמם אצלו\nשם המתרגל/ת: ינאי פלורסהיים\nחוות דעת - תרגולים: \nינאי לא מתרגל מדהים, הוא מעביר את החומר בצורה לא הכי ברורה.\nשעורי הבית: \nבחלק מהגיליונות היו טעויות וחלק מהשאלןת לא פרופורציונליות לרמץ המבחן\n\nהמבחן: \nהמבחן השנה (חורף 2023) היה הוגן, ועם כמות נכונה של הכנה כולם יכולים לקבל ציון טוב(85+)\nהשורה התחתונה: \nאחלה קורס עם מרצים אכפתיים.", "timestamp": 1675869101035}, {"author": "תנע זוויתי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: סשה בקמן\nחוות דעת - הרצאות: מרצה מאוד יסודית, מסודרת, רצינית ואכפתית.\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: מיותרים. עומד ומדבר לעצמו. כותב קטן ומבולגן והכי כיף שהוא מת לצחוק משאלות של סטודנטים. \n\nשעורי הבית: מעל הרמה של המבחן. קשים מדי.\n\nהמבחן: סבבה לגמרי כל עוד מתרגלים מלא מבחנים משנים קודמות.\n\nהשורה התחתונה: המרצים טובים, צוות המתרגלים להפך. במהלך הסמסטר היו גם הרבה תקלות עם הגליונות, פעם אחת המתרגל האחראי (ינאי) מחק את הציונים ב2 גליונות, כך שנאלצתי לעשות אותם שוב - למזלי הם היו ה2 הראשונים אז היו קלים.", "timestamp": 1676195374446}, {"author": "אורי בלוגולובסקי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מרצה חלום אין מה להוסיף\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: אין לו סבלנות להסביר או לענות לשאלות, מקריא מדף כמו שיכולתי לקרוא בעצמי\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676221002798}, {"author": "Tim Manor", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: הרצאות מעולות! יש רשימות של הכל אז לא צריך לכתוב כמעט כלום, לי הספיק להקשיב. גידי הוא המרצה הכי משקיע שהיה לי בסמסטר הראשון. לכו לכל שעת קבלה שלו! וגם לתגבור לקראת המבחן!\n\nשם המתרגל/ת: אלדינה\nחוות דעת - תרגולים: הייתי בתרגול אחד והרגיש לי קצת מיותר. לא מספיקים הרבה בתרגול של שעה\n\nשעורי הבית: רובם בסדר, עד שמגיעים לתנע קווי ושם הם מתחילים להעיק\n\nהמבחן: אני סיימתי במועד א'. המבחן היה הוגן וקל יחסית לשנים קודמות.\n\nהשורה התחתונה: קורס קליל", "timestamp": 1676308411248}, {"author": "נעמה לילה", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: פשוט מדהים, ברמה שבעיני שווה ללכת להרצאות שלו אפילו אם אתם לא צריכים לעשות את הקורס(; הוא גאון אמיתי, ופשוט אדם מדהים. נותן מעצמו כל כך הרבה לסטודנטים, והכל עם רצון אמתי שנצליח ונרגיש טוב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676625683027}, {"author": "ניקול", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nמדהיםםםםםםםם, מאוד ברור, אכפת לו שכולם יבינו את החומר והוא לא מתפשר על איכות. מלמד טוב, כל שיעור חוויה.\n\nשם המתרגל/ת: אלדנה\nחוות דעת - תרגולים: ברורה, מסבירה הכל ביסודיות ומתעכבת על כל שאלה עד שהובנה במלואה. מאוד מומלץ למי שלא לגמרי מסתדר עם החומר.\n\nשעורי הבית: לרפרנס! יותר קשים מהמבחן\n\nהמבחן: חביב, הרעיון חוזר על עצמו בכל המבחנים ומספיק לחזור על כמה ואתה כבר מוכן לגמרי", "timestamp": 1677163600691}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: סשה\nחוות דעת - הרצאות: מאוד ברורה ותמיד מוכנה לענות של שאלות\n\nשם המתרגל/ת: ינאי \nחוות דעת - תרגולים: ממש לא משהו.\n\nשעורי הבית: די קשים, אבל כן עוזרים להבין את החומר\n\nהמבחן: יותר קל מהשיעורי בית, הוגן \n\nהשורה התחתונה: קורס שדורש השקעה, לא לזלזל בו", "timestamp": 1677882507681}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nמושלםםםם! מרצה מושלם מעביר את ההרצאות בכיף בהתלהבות רואים שהוא אוהב את החומר שהוא מעביר ובעל קשב רב לתלמידים שלו מרצה באמת מושלם ההרצאות שלו מעניינות בטירוף עם הרבה מאוד ניסויים וכיף מאוד להגיע להרצאות הם אלו שהחזיקו אותי שפויה בסמסטר הזה!\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: \nהייתי בשני תרגולים ואמרתי שאין מצב אני מבזבזת זמן על זה והעדפתי ללכת לשעות קבלה של גידי שהיו מלמדות בהרבה \nשעורי הבית: \nחלקם קשים חלקם פחות תלוי עד כמה אתם אוהבים את המקצוע ומבינים אותו אבל בשעות קבלה של גידי תמיד ניתן לבוא ולשאול אותו שאלות והוא עונה בכיף בשמחה ובהרבה הבנה\nהמבחן: \nאמריקאי, אם מתכוננים אליו כמו שצריך לגמרי אפשר להוציא 100 ממליצה פשוט לשבת להבין את החומר ולפתור 13+ מבחנים ואז אתם תתחילו להבין שהכל חוזר על עצמו ואיך לגשת למבחן לדעתי הדרך הכי טובה להוציא 100\nהשורה התחתונה: \nקורס מאוד כיפי מהנה מעניין נהנתי מכל רגע ורגע מומלץ מאוד למי שאוהב פיזיקה!", "timestamp": 1678179843377}, {"author": "ניק", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גידי (מוקלט)\nחוות דעת - הרצאות:  מלא תשוקה ללמד\n\nשעורי הבית: גליון שבועי במודל, בהתחלה סבבה ובסוף הופך מתיש וקשה\n\nהמבחן: אני כאן כדי להגיד שלאורך כל הקורס לא הייתי על הדברים, לא ראיתי הרצאות, הפסקתי ללכת לתרגולים ובסוף קיבלתי ציון מאוד גבוה בלמידה של שבוע. אז אם אתם באותו מצב כמוני, אל תתייאשו כי זה אפשרי", "timestamp": 1678286385953}, {"author": "Eli", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: סשה\nחוות דעת - הרצאות: \nממש מסודרת, כותבת הכל על הלוח ומלמדת דרך דוגמאות\nקצת איטית מדי, היינו צריכים הרצאת השלמה ולא גמרנו את החומר עד ההרצאה האחרונה שהייתה שלושה ימים לפני המבחן\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: \nמשעמם ומבלבל, מיותר ללכת\nשעורי הבית: \nברמה יותר גבוהה מכל מה שעשינו בהרצאה ובתרגול, צריך לשבת על זה ועדיף לא ברגע האחרון כדי לאפשר לחשוב קצת\nהמבחן: \nהוגן\nדומה מאוד לכל המבחנים בשנים הקודמות ויותר קל מהשיעורי בית\nהשורה התחתונה:", "timestamp": 1678787068757}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי \nחוות דעת - הרצאות: מרצה מעולה שאוהב את מה שהוא עושה וכלכך כיף ללמוד אצלו ברמה שחיכינו להרצאות שלו כל שבוע, אכפת לו מסטודנטים ומסביר את החומר ממש טוב רק צריך להתרכז כי זה לא קשה לאבד אותו\n\nשם המתרגל/ת: רון בסלר מוקלט \nחוות דעת - תרגולים: מתרגל מצוין מסביר את החומר בצורה ממש טובה הוא ממש משקיע בסרטונים לא הלכתי בכלל לתרגולים כי לא התחברתי למתרגלים (אלדנה וינאי) ולרון יש סרטונים עם הסברים מפורטים ואפילו פתרונות לשאלות מסוימות בקיצור ממש מומלץ \n\nשעורי הבית: קשים אבל זה לא אומר כלום, ינאי פשוט אוהב לתת מלא גיליונות קשים שהם רמה מעל החומר שנדרש מכם להבין ולדעת אפילו המבחן פחות קשה, לא שווה להיתקע על שאלה יותר מדי זמן תראו פתרון של רון וזה יסגור את הפינה וגם אם לא תשתמשו ברפרנסים זה בסדר \n\nהמבחן: הוגן והרעיונות חוזרים על עצמם ממבחנים קודמים תתכוננו טוב ותרגלו מבחני עבר זה ישתלם \n\nהשורה התחתונה: ממש מומלץ וכיפי למי שאוהב פיסיקה וגם מי שלא יכול לקבל ציון טוב", "timestamp": 1678826545692}, {"author": "gil blank", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: גידי מושלם, ללכת אליו זו חוויה. הוא מורה בכל רמ\"ח אבריו וחשוב לו מאוד שתבינו. הוא משתף מהחיים שלו. השעתיים הכי טובות בשבוע שלי בפער.\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: רץ על החומר בטירוף כי אין זמן. הוא לא ממש עונה על שאלות וגם לא מעלה הרבה חומר למודל. \n\nשעורי הבית: הוגנים\n\nהמבחן: הוגנים", "timestamp": 1678959943809}, {"author": "וו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מהמם חמוד וטוב מאוווד ממומלץ ברמות\n\nשם המתרגל/ת: ינאי ואלדנה\nחוות דעת - תרגולים: לא מעבריים טוב\nחבללל על הזמןן\n\nשעורי הבית: קשיים\nאבל מומלץ להבין \n\nהמבחן: הומוגיני \n\nהשורה התחתונה: צריך השקעה ומעקב בסמסטר ללכת להרצאות ולהבין\nלפני המבחן תקחו 4-5 ימים רק תפתרו מבחנים ותבינו", "timestamp": 1679043346803}, {"author": ",", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: גידי מושלםםםםם\n\nשם המתרגל/ת: בתיאוריה ינאי בפועל המוקלטות של רון בסלר\nחוות דעת - תרגולים: הרגיש שלינאי לא אכפת מהסטודנטים, הוא עונה על שאלות כשהוא ממש חייב אבל בגדול מדבר עם עצמו מול הלוח. המוקלטות של רון אחלה!\n\nשעורי הבית: \nחלקם היו קלילים אחרים דרשו ממש לשבת ולשבור את הראש\n\nהמבחן: היה די קשה אבל יחסית הוגן\n\nהשורה התחתונה: קורס חובה אז פשוט עוברים אותו וממשיכים", "timestamp": 1679136086407}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: \nחנה מרצה מטורפת, מסבירה את החומר בצורה ברורה מאוד, קשובה לסטודנטים ורואים שהיא נהנת במה שהיא עושה. כדאי לראות על 2X, כי לפעמים מתעכבים על דברים. הכיתה הפרונטאלית שלה מפוצצת, אז הקלטות למי שיכול.\n\nשם המתרגל/ת: רון בסלר מוקלט \nחוות דעת - תרגולים: \nרון מתרגל טוב, אבל לפעמים הוא קצת קרינג'. מי שיכול שילך, כי כנראה המתרגל הכי טוב שיהיה, אבל לא לצפות לנס משמיים בהבנה.\n\nשעורי הבית: \nקשים מאוד ביחס למבחן. לרפרנס אם יכולים\nהמבחן: \nאמריקאי שחוזר על עצמו. שבוע הכנה של חזרות על מבחנים ואתה יכול להוציא ציון ממש טוב\nהשורה התחתונה: \nקורס די קליל, ממליץ", "timestamp": 1679228272331}, {"author": "Dean B", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  גידי\nחוות דעת - הרצאות: \nמרצה מספר אחת בטכניון נקודה.\n\nשם המתרגל/ת:  ינאי\nחוות דעת - תרגולים:  רץ על החומר מהר, ממליץ לעבור על התרגולים לפני כדי להיות בעניינים\n\nשעורי הבית:\n ממליץ לפתור את כל השיעורי בית ולהוציא בהם 100  כי הציון מגן הוא תקף. להיעזר בשעות קבלה.\nהקושי של השיעורי בית לא מתקרב לדעתי לקושי של שאלות מהמבחן כלומר השאלות במבחן פחות מורכבות.\n\nהמבחן:  לא קל אבל מאוד חוזר על עצמו, באופן אישי סיימתי את המבחן חצי שעה לפני הזמן ונשארתי כדי לבדוק את עצמי עד הרגע האחרון. \nציון סופי 91  :)\n\nהשורה התחתונה:  \nללכת לשעות הקבלה ש גידי ולפתור שאלות ממבחנים והציון שלכם (כמעט) מובטח!", "timestamp": 1679403541450}, {"author": "matan arad", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: מצחיק ומובן, אחד המרצים הטובים שיש\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: נורא ואיום, מנסים להקשיב אבל אי אפשר כשהוא דופק לך מינוס אף שווה למינוס אם יי\n\nשעורי הבית: רמת מבחן\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין, מרצה מעולה, מבחן הוגן וממוצע גבוה", "timestamp": 1679497502772}, {"author": "אני צמא לשאלות", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גידי \"רק ניוטון\" אלון\nחוות דעת - הרצאות: גידי אחלה של מרצה, אבל הוא כן קצת מפוזר. לוקח זמן להתרגל לזה שאין ממש מה לכתוב בהרצאות שלו (ואין ממש איך) אבל באמת שהוא מסביר טוב. יש לו יכולת מטורפת לגרום לך לא לשים לב שאתה שעתיים לומד פיסיקה, כי הוא עושה את ההרצאה כזאת חוויתית וכיפית. גידי עושה מלא ניסויים חוויותיים יחד עם זה שההתלהבות של גידי היא מדבקת בטירוף. הוא יזרוק מחבתות, ירים משקולות ויביא פילים ונמרים מאיקאה רק כדי שתקשיבו לו, וכדאי, למה הוא יודע מה הוא אומר.\nחשוב לי להגיד שהחומר שמועבר בהרצאות, התרגילים שעושים בתרגול והשאלות מהמבחנים לא בדיוק אותו דבר מבחינת הפרקטיקה של דרכי הפתרון (עד שמתקרבים למבחן עצמו), אז כדאי להיחשף כמה שיותר מוקדם כדי להבין עם מה אתם מתמודדים.\n\nחוות דעת - גידי המלך: גידי הוא המרצה הכי טוב בטכניון בפער (כן, יותר מצנזור בעיניי, ולמדתי עם שניהם פיזית). הסיבה העיקרית היא כי בניגוד למרצים נורמליים אכפת לו מהתלמידים שלו במידה ראויה להערצה. הוא עושה שעות קבלה כל הזמן (שממש מומלצות!!!) וממש מתעקש שכל התלמידים יבינו ויהיו איתו, והרצון שלו לעזור לנו להצליח בוהק כמעט חזק כמו האישיות המדהימה שלו. הוא איש כזה מיוחד וכנה, ובחיים שלי לא היה לי מרצה/מורה כמוהו. אני חושב שלכל אדם שמתחיל פיזיקה 1 כדאי ללכת לחוות את הבן אדם המדהים הזה, מבטיח שלא תתחרטו.\n\nשם המתרגל/ת: ינאי פלורסהיים\nחוות דעת - תרגולים: ינאי מתרגל טוב, הבעיה היא שלקורס יש שעת תרגול אחת ויחידה, מה שמכריח את ינאי לרוץ במהירות מטורפת. יכול להגיד שלי אישית הוא די עזר אבל זה שיש רק שעה אחת זה בעייתי..\n\nשעורי הבית: גליון אחד מצ'וקמק במודל בשבוע. בעקרון הגליונות לא קשים יותר מדי, הבעיה היא שלפעמים אתה לא בטוח אם טעית כי לא פתרת בדרך נכונה או בגלל טעות חישוב. ממליץ באופן כללי לא לדחות אותם לסוף, ובמיוחד הכי הכי כדאי ללכת לשעות קבלה של גידי ולעשות איתו את הגליונות. גם חוסך לכם לעשות את זה על זמנכם הפנוי, גם אשכרה מבינים מה רצו מכם, וגם עוד זמן עם גידי. רווח נקי לכולם.\n\nהמבחן: מבחן של 12 שאלות אמריקאיות. בעקרון המבחן די קל, הבעיה היא שהתשובות ממש מבלבלות בכוונה. התשובות נבחרות ככה שאם אתה לא פותר נכון, אתה תקבל תשובה שגויה שכן מופיעה בתשובות, תסמן אותה באושר רק כדי לגלות אחרי המבחן שטעית (אומר מניסיון). קחו את המבחן לאט, יש שלוש שעות, וזה יותר ממספיק.\n\nהשורה התחתונה (לסיום נשמע את הצליל לה): גידי הוא המלך של חיי והמרצה הכי טוב שהיה לי, חבל שהקורס הזה לא טוב כמוהו. ממליץ לכל מי שהולך לעבור את הקורס המעצבן הזה ללכת אליו רק בשביל לחוות את גידי כבן אדם.", "timestamp": 1679506375484}, {"author": "תהיו איתי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גידי אלון המלאך בדמות אדם\nחוות דעת - הרצאות: לא קורה לכם הרבה שבחיים אתם נתקלים במלאך שמסתובב ביניכם ובמיוחד שלא מלמד פיזיקה שזה מקצוע מהשטן אבל גידי הוא דוגמה לכך. הבן אדם הכי מדהים שפגשתי בחיים שלי שעוסק בהוראה כי הוא פשוט נותן מעצמו את המיליון אחוז שלו כד שתקבלו מאה במבחן וכל זה תוך כדי הרצאות חווייתיות ומהנות שלא נראו כמותם. אם היה לי אפשרות לבחור מרצה אחד או סתם בן אדם שילווה אותי כל התואר הייתי בוחר בגידי בלי למצמץ בכלל כי אם הוא גרם לי להיות בטוב עם פיזיקה שהיא השנאה הכי גדולה שלי עוד מהתיכון אז הבן אדם פשוט מכשף, וזה נטו האישיות והאנרגיות שלו. אל תפספסו כי אחרת אתם תצטערו. גם אם זה רק ללכת לשעות הקבלה שלו, שגם אל תפספסו כי הוא ילחם על כל שאלה כדי שתבינו אותו. אין מה יותר להוסיף חוץ מזה שתחברו עירוי של גידי לדם כדי להרגיש נפלא בחיים פתאום כי זה לפחות אצלי כבר מעבר להרצאה בפיזיקה.\n\nשם המתרגל/ת: ינאי פלורסהיים\nחוות דעת - תרגולים: כריזמה של שק תפוחי אדמה אבל האופציה הכי טובה שתהיה לכם.\n\nשעורי הבית: אל תדחו לרגע האחרון!!! להיפטר מהם כמה שיותר מהר ולהמשיך הלאה בחיים כי למרות שהתרגילי בית לא הכי קשים שיש, הם מציקים ומגעילים וגורמים לך לשאול הרבה פעמים בשביל מה לעזאזל?\n\nהמבחן: בתור בן אדם ששונא פיזיקה וסולד מהמקצוע בכללי הספיקו לי ארבעה ימים לפני המבחן להתחיל להתכונן ולהוציא 83 במבחן אז לשיקולכם (להתכונן זה פשוט לפתור מבחנים כי אין יותר מדי מה לעשות)\n\nהשורה התחתונה: עזבו אותכם שטויות רק גידי!!!", "timestamp": 1679506474542}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: ואוו איך אפשר לתאר במילים את ההרצאות עם גידי. פשוט תבואו. ההרצאות איתו היו כמו שעתיים של רוגע לנשמה. האכפתיות שלו כלפי הסטודנטים והאהבה שלו לפיסיקה מעוררת הערצה והוא יעשה כל מה שהוא יכול כדי שתרגישו בנוח לשאול שאלות. הוא מסביר את החומר בצורה מובנת וברורה והוא חד משמעית המרצה הטוב ביותר שפגשתי בלימודיי עד כה. \n\nשם המתרגל/ת: רון בסלר מוקלט +ספרים\nחוות דעת - תרגולים: בהתחלה צפיתי בהקלטות של רון אבל מהר מאוד עברתי לפשוט לקרוא את החוברות המצויינות שהוא מוציא. מתרגל מדהים והוא נתן אחלה טיפים שממש עזרו לי בלהבין לא מעט נושאים. בהתאם לחוות הדעת הקודמות לא ניסיתי אפילו ללכת למתרגלים האחרים פרונטלית.\n\nשעורי הבית: גיליונות הכנה ומטלות במודל. רובם בסדר, לקראת הסוף הרמה ממש עולה. לכו לשעות קבלה עם גידי! גם הן כמו ההרצאות כיפיות ממש והוא ישמח לענות על כל שאלה. יש רפרנס מלא אז אפשר להשתמש גם בו. ממליצה לסיים עם הגיליונות כמה שיותר מהר כי הם סתם מוסיפים עומס במיוחד בסוף הסמסטר.\n\nהמבחן: קצת מוזר. הרגשתי שהייתה עלייה ברמה מהמבחנים הקודמים שפתרתי. היו שאלות מאוד פשוטות והיו כמה שאלות מאוד קשות בעיניי. סה\"כ מבחן מאוזן מבחינת הרמה ודי הוגן. תפתרו מלא מבחנים משנים קודמות כי זה עוזר מאוד.\n\nהשורה התחתונה: אחלה של קורס ועם גידי זו בכלל חוויה!", "timestamp": 1688982766817}, {"author": "אינווריאנט", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות: \nמרצה נחמד סה\"כ, אבל קצת צעק יותר מדי מה שגרם לי להפסיק לבוא. למדתי מלקרוא רשימות והיו די ברורות.\nשם המתרגל/ת: \nאלדנה גריצ'נר\nחוות דעת - תרגולים: \nהייתי בשני תרגולים וגם הם הרגישו מיותרים.\nשעורי הבית: \nמאוד עוזרים עם ההבנה של החומר, יכולים להיות קשים אבל בסופו של דבר זה התרגול האמיתי. אבל הייתי ממליץ להסתכל על התשובות אם לא יודעים ולא להגיש שטויות כי סתם חבל.\nהמבחן: \nהמבחן משום מה היה יותר קשה משנים קודמות אבל עדיין מי שיודע את החומר היה אמור לעבור אותו בקלות. השאלות היו לפעמים מכשילות אבל פיזיקלית ולא מתמטית ובדקו הבנה של החומר.\nהשורה התחתונה: קורס חובה למה קראתם עד לפה", "timestamp": 1689014976315}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: אחלה הקלטות ואחלה חנה. גם הסיכומים שהיא מעלה למודל עוזרים ללמידה. בכללי מורגש שהיא עושה עבודה טובה ובאה לקראת הסטודנטים בלי להוריד מרמת הקורס\n\nשם המתרגל/ת: רון מוקלט \nחוות דעת - תרגולים: אחלה רון, אוהב את הגישה שלו, רואים שהוא נהנה ללמד וזה מאוד נחמד. לפעמים החומר שהוא מעלה לאתר קצת ארוך וחופר מידיי לכן צריך לדעת לסנן כי יש קורסים יותר משמעותיים בסימסטר\n\nשעורי הבית: בכל גליון יש 2-3 שאלות קשות והשאר קלות יותר. אם נתקעים יש רפרנסים באקסל לתשובות סופיות למרות שהייתי ממליץ גם להבין איך מגיעים אליהן\n\nהמבחן: אמריקאי וסבבה. לא קל מידיי לא קשה מידיי\n\nהשורה התחתונה:", "timestamp": 1689412947913}, {"author": "~", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: \nגידי מרצה מדהים! הוא מסביר נהדר ונותן דוגמאות ויש אצלו המון מקום לשאול שאלות. באמת חושבת שכתבו לפני רבות על גידי. מה שכן, ההרצאות שלו תמיד מלאות (גם לקראת סוף הסמסטר) אז לפעמים קשה למצוא מקום לשבת וזו באסה אמיתית.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \nהייתי בכמה תרגולים בתחילת הסמסטר גם של ינאי וגם של אלדנה ולא התחברתי בכלל. ינאי הרגיש שעושה לנו טובה שהוא מגיע בכלל לתרגול ובגדול דיבר לעצמו עם הפרצוף ללוח, בקושי נתן מקום לשאול. אלדנה היתה יותר מוצלחת אבל פשוט אי אפשר היה לשמוע אותה מדברת אם לא ישבתי בשורה הראשונה ממש ממול למקום שבוא היא עמדה. הקשבתי במקום לתרגולים המוקלטים של רון בסלר והיה נהדר, רון מסביר ממש טוב וגובה העיניים, נותן דוגמאות ויש כל מיני סרטונים אקסטרה על שאלות של סטודנטים ודגשים שממש עזרו.\n\nשעורי הבית: \nתרגיל בית כל שבוע, הגשות בגדול חובה. לא היה מאוד מאוד עמוס אבל חלק מהשאלות היו לא פשוטות בכלל.\n\nהמבחן: \nאמריקאי, הרגיש לי מעל הרמה של תרגילי הבית. היה די קשה ולא טריוויאלי וחשוב לתרגל המוןןןן מבחנים לפני כדי לראות כמה שיותר סוגי שאלות בשביל להצליח לגשת לשאלה בדרך אליה הם מכוונים אחרת אפשר קצת ללכת לאיבוד\n\nהשורה התחתונה: \nקורס חובה אז מסתדרים", "timestamp": 1689569794927}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מרצה ממש טובה, מאוד פשוט להבין אותה ואם לא מבינים היא ממש שמחה לענות על שאלות. באופן כללי נראה שהיא אוהבת את המקצוע ושהיא נהנית להעביר את החומר וזה נותן אווירה טובה למהלך ההרצאה.\n\nשם המתרגל/ת: איוון \nחוות דעת - תרגולים: לא משהו לצערי כי הוא ממש השתדל. באופן כללי יש הקלטות של רון בסלר שראיתי מדי פעם, גם לא עפתי למרות שכולם ממליצים עליו.\n\nשעורי הבית: קשים מעט, בהחלט יותר מהרמה של המבחן. הייתי ממליצה כמה שפחות לרפרנס כי לא ממש מלמדים איך לגשת לשאלות וזו מיומנות שכדי לרכוש לפני שמגיעה תקופת המבחנים.\n\nהמבחן: היה הוגן אבל עדיין הממוצע לפני פקטור היה 58...לדעתי זה רק מוכיח שהם חייבים ללמד איך לגשת לשאלות כי לדעת את החומר התיאורטי זה ממש לא מספיק. \n\nהשורה התחתונה: מבחינת הבנה הקורס לא קשה מדי, הקושי הוא באמת בעניין המעשי.", "timestamp": 1689670156711}, {"author": "ים", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: וואי הוא פשוט מושלם איזה איש אגדה,\nלדעתי כדאי לבוא בשבילו והפיזיקה פחות חשוב\n\nשם המתרגל/ת:  גל גומפל\nחוות דעת - תרגולים: בקיא בחומר נחמד ומתרגל אחלה\n\nשעורי הבית:  אם לא עושים אותם ב12 בלילה אחלה תרגול\n\nהמבחן:  טוב שהוא אמריקאי\n\nהשורה התחתונה: קורס די מסודר והרבה דוגמאות לחזור מהן על החומר", "timestamp": 1689673442573}, {"author": "Aviv", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גדעון אלון\nחוות דעת - הרצאות:  גידי מרצה מעולה! באמת אכפת לו מהסטודנטים. הוא מצליח להעביר את ההרצאות בצורה מעניינת וברורה. ממליצה בחום ללכת לחוות את ההרצאות איתו. \n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: מתרגל נחמד מאוד, העביר את התרגולים באופן מצויין. מאוד מקיף ומקצועי. ידע להכווין ולעזור טוב מאוד.\n\nשעורי הבית: יש תרגילי הכנה שעושים לפני התרגולים שהם קלילים ועוזרים להבין את הדגש של מה שנלמד בהרצאות.\nגיליונות שיעורי הבית היו ברמה גבוהה, לקחו קצת זמן כדי לסיים אותם אבל מכינים מאוד לקראת המבחן.\n\nהמבחן: יש מועדים מאתגרים יותר ויש כאלה שפחות. ככל שתעשו יותר מבחני עבר כך לא יהיו שאלות שיפתיעו אתכם. השאלות בסופו של דבר חוזרות על עצמן.\n\nהשורה התחתונה: קורס נחמד לחלוטין, קל לעבור אותו אם משקיעים זמן בתרגול והבנת החומר.", "timestamp": 1689677438077}, {"author": "~~~", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: מרצה אדיר עוזר מאוד בהבנת החומר מומלץ מאוד ללכת לשעות קבלה חוסך הרבה כאבי ראש על שיעורי הבית\n\nשם המתרגל/ת: איוון רפפורט\nחוות דעת - תרגולים: זה היה הסמסטר הראשון שלו אבל הוא היה ממש סבבה האמת גם שלא היה צריך יותר מדי קורס יחסית בסדר\n\nשעורי הבית: לפעמים קשים ממש אבל גידי פותר הכל בשעות קבלה וזה ממש טוב בכל מקרה לא להיבהל במבחן זה שונה\n\nהמבחן: סביר לגמרי\n\nהשורה התחתונה:", "timestamp": 1690378757220}, {"author": "בעיות אב בכמות גדולה", "difficultyRank": 1, "generalRank": 5, "semester": "202203", "text": "שם המרצה: \nחוות דעת - הרצאות: נירית. מסבירה טוב. היא רושמת בתוך onenote בהרצאות ונותנת את הקישור. ככה שלא צריך לכתוב כלום רק להקשיב. טיפה הולכת לאיבוד בתחום של איך להשתמש בטכנולוגיה.\n\nשם המתרגל/ת: אלדנה\nחוות דעת - תרגולים: בסדר סה\"כ. יש במודל את כל הדפים של התרגולים ביחד עם סיכומי התרגול והפתרון המלא של השאלות.\n\nשעורי הבית: גליונות כמו WW. הרוב בסדר לגמרי. חלק לא מובן. הבעיה העיקרית שיש איזה 3-4 אפשרויות הגשה של הגליון והנתונים שנותנים לכם לא תמיד יובילו לפתרון עם מספרים יפים.\n\nהמבחן: אמריקאי. קליל. תורידו את דף הנוסחאות מהדרייב. בדף נוסחאות זה מופיעות לא רק הנוסחאות אלא גם דרך פתרון של שאלות שחוזרות על עצמן, עוזר בשאלות קשות. היה פקטור של 8 נק'.\n\nהשורה התחתונה: קחו לקיץ. מינימום השקעה ומקסימום ציון.", "timestamp": 1698322905635}, {"author": "הצל", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אלון גדעון \nחוות דעת - הרצאות: גידי חמוד לאללה ומסביר א החומר טוב, חשוב לו שיבינו ויש לו המון תשוקה שעוברת בהרצאות שלו, אני ממש מעריך אותו על התשוקה והרגישות שלו אבל יש אנשים שפחות התחברו כי הוא די אינטנסיבי לפעמים. \nשעות הקבלה שלו רק לא היו ככ טובות, היה מתפזר וכביכול מנסה לעשות את שעת הקבלה באופן הוגן אבל הרבה פעמים היו פערים ודברים היו מתפספסים. \n\nשם המתרגל/ת: מרינה\nחוות דעת - תרגולים: הייתי בתרגול 1, לא יודע\n\nשעורי הבית: אחלה, חשוב מאוד להבנה ולתרגול פרקטי, לא מאוד עמוסים אפילו, בדרכ אפשר לסיים אותם ישר ביום שמלמדים את החומר. \n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין מאוד", "timestamp": 1705309170431}, {"author": "גאבי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי \nחוות דעת - הרצאות: \nגידי אחלה מרצה ובן אדם מקסים, הוא מאוד משקיע בהסברים ודואג שכולם יבינו, מה שכן הוא לפעמים מתפזר.\nמה שכן בגלל שיש לו הרבה סטודנטים יש הרבה מאוד רעש בהרצאות והרבה שאלות- גם בשעות קבלה יש עומס\nשם המתרגל/ת:  לא הלכתי\nחוות דעת - תרגולים: \nניסיתי ללכת פעמיים לתרגולים והגיתי למסקנה שזה בזבוז זמן מוחלט\nשעורי הבית: \nבסדר סהכ- יש רפרנסים טובים\nהמבחן: \nהוגן סהכ לא היה קל אבל גם חא היה קשה מדי\nהשורה התחתונה: קורס מעניין ולא קשה מדי, וסהכ היה אחלה (אם מתעלמים מכמות האנשים הרעש שהם יצרו)", "timestamp": 1712856121590}, {"author": "אלון ספיר", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גידי אלון המרצה הכי טוב בטכניון!!!\nחוות דעת - הרצאות: \nמאיפה להתחיל? זה או שאפשר להגיד שגידי הוא המרצה הכי טוב בטכניון, שמי שלא היה בהרצאה איתו לא למד פיזיקה בפרט ובטכניון בכלל ושכל מילה נוספת מיותרת, או שאפשר לרשום על גידי מגילות עם מחמאות ושבחים וזה לא יסתיים לעולם. אחלק את חוות הדעת שלי ל2:\n1. גידי הבן אדם: גידי הוא מלאך שאלוהים שלח כדי להזכיר לנו שיש בני אדם טהורים: אין הרצאה שגידי לא משתף אותנו מהחוויות האישיות שלו על אופי ועל חוכמת חיים, בדרך הומוריסטית ומעשירה. לפרקים מרגיש שגידי הוא לא מרצה לפיזיקה, אלא מורה לחוכמת חיים, וזה בלי שנפגעת איכות ההוראה שלו. גידי משלב הומור במידה מאוד מאוד גבוהה אבל זאת פשוט מתנה לכל סטודנט שיושב בהרצאה שלו. גידי יעשה הכל כדי שתצאו מההרצאה שלו כשאתם מבינים: מדוגמאות אינטואיטיבות על נטלי ושוטר, דרך ללכת מכות עם האני העצמי שהוא שונא בעצמו אבל בעצם הוא ממש עוזר לו להסתכל על העולם בדרך טובה יותר, כולל האנשה של פיל ופנתר ועד, איך לא, זריקת מחבת כששליח מקררים מתקשר וגידי מדבר איתו במיקרופון. גידי לא מסתיר כלום מהסטודנטים שלו על החיים האישיים שלו. קצת מעצבן שגידי מוצא לנכון להתנצל על זה שהוא מבטל שעות קבלה בשעות לא שעות כי יש לו חיים אישיים עם הבת זוג שלו, אבל נסלח לו כי אלו שעות קבלה מאוד איכותיות, בנות *לפחות* 3 שעות שבועיות, כולל אחרי ההרצאה עד אחרונת השאלות ועד 22 בערב בזום, כולל מרתון לפני המבחן עם שאלות ממבחנים.\n2. גידי המרצה: מורגש שגידי מנוסה מאוד בהעברת הקורס: יש במודל את הרשימות שלו שהוא כתב ואיכשהו, בלי שזה מורגש תוך כדי ההרצאה, הוא מתבסס עליהן ברמת הנתונים והשמות המדויקים בדוגמאות הכיתה שיש בהן. אז נכון, גידי יכול להיות לפעמים לא מסודר וקל לאבד אותו(מה שכן הוא מודע מאוד לזה שקל לאבד אותו וכמו שציינתי, כל משפט שני שלו זה \"מי שאיבד אותי תחזרו אליי\"), אבל בסופו של דבר הוא מובן ואתה יוצא את ההרצאה כשהבנת את החומר. גם בשעות הקבלה האינסופיות של גידי הוא מסביר בצורה שמאפשרת לך לצאת עם הבנה מקסימלית. \nלסיכום, גידי הוא המרצה שהכי משלב בין הבנה לחוויה בהרצאה. היה סמסטר תענוג!\nשם המתרגל/ת: דור קופלביץ'\nחוות דעת - תרגולים: \nקשה לי לתת ביקורת על דור, כי הוא באמת המתרגל הכי טוב שיש בסגל, שלא לומר היחיד הטוב(אל תלכו לשמעון סוחולוצקי!!! אל תלכו לשמעון סוחולוצקי!!!): הוא מסביר באופן דיי ברור ועונה על שאלות סבבה.\nהבעיה היא במבנה התרגולים בקורס הזה, שגורם למתרגלים להתבסס על דף עם 2-3 שאלות שאפשר לקרוא בעצמך ולהבין טוב יותר מאיך שזה נמרח על תרגול של שעה. לא בכדי התרגולים היו ברובם חצי ריקים.\nכן צריך לציין לטובה את זה שהסגל הקדיש תרגול אחד לשאלות ממבחנים, תרגול שמאוד מאוד עזר.\nגם כאן, הסגל ממש נרתם עם שעות קבלה.\nשעורי הבית: \n\nהמבחן: \nהמבחן בקורס הוא מאוד הוגן\nהשורה התחתונה: \nאל תוותרו על ללמוד עם גידי!!! תתרגלו מבחנים כמה שיותר, בעיקר שאלות עם מד\"ר, ואתם מסודרים. זה לא הקורס שצריך להפחיד אתכם בסמסטר הראשון בטכניון, אבל כן תהיו עירניים לגביו.", "timestamp": 1712931518047}, {"author": "איתן 67", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ד\"ר גדעון (גידי) אלון\nחוות דעת - הרצאות:\nגידי העביר את החומר בצורה פשוט משובחת. מלאה בהומור, מעשירה, מרתקת ומהנה, אבל תוך כדי גם מלמדת ודואגת שנדע את החומר. כל יום חמישי בבוקר מאייר 280 היה מפוצץ ואנשים היו עומדים בחוץ יותר מחצי שעה לפני אם האולם היה נעול. גידי נתן יחס אישי לכל מי שבא לשאול שאלה ותמיד נתן תחושה שהשאלות רלוונטיות ולגיטימיות. הוא שילב בהרצאות מיני שעשועים, ממשחק עם הלוח עד בובה של פיל. ממליץ בחם, ולו רק בשביל החוויה (כל השבוע רק מחכים לחמישי להרצאה שלו).\n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים:\nנועם אמנם היה מעט משמים משמים אבל הוא היה נחמד מאוד והסביר את דרך הפתרון של כל תרגיל בבהירות רבה. אם נחוץ לכם לשמוע מישהו פותר, לכו אליו. אם לא, אפשר להסתדר גם רק עם המודל.\n\nשעורי הבית:\nמאתגרים ולעיתים דרשו שימוש בפתרונות, אבל מכינים למבחן. הייתי אומר שהם מעט יותר קשים מהמבחן הסופי, אבל אולי זה בגלל שלמבחן התכוננתי יותר.\n\nהמבחן:\nמבחן הוגן לגמרי. שאלה או שתיים קלות, שאלה או שתיים קשות והרוב באמצע. אפשרי לגמרי לקבל מעל 70 ועם מעט מאמץ גם מעל 80.\n\nהשורה התחתונה:\nקורס מעניין – עד כמה שמכניקה ניוטונית (פלוס עוד טיפה) יכולה להיות מעניינת – ומועבר בצורה מעולה בזכות המרצה. ממליץ (לא כאילו שיש לכם בחירה, זה קורס של שנה א').", "timestamp": 1713017791563}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nאוברייטד מאוד לדעתי, מאמצע הסמסטר ראיתי הקלטות של חנה וזה ב10 רמות יותר טוב. יש יותר מדי צחוקים עם כל מיני אנשים שמעריצים אותו, מה גם שהוא לא זמין בכלל להודעות ולבעיות של סטודנטים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמי שברמה טובה, לדעתי קצת מיותר\nשעורי הבית: \nלרפרנס ולפתור מבחנים כמה שיותר מוקדם\nהמבחן: \nמבחן הוגן וסבבה, מי שמתכונן כמו שצריך אמור לקבל מעל 80 בלי הרבה בעיה.\nהשורה התחתונה: \nתראו את חנה", "timestamp": 1713028782088}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \nמרצה אחלה. מצחיק ומסביר טוב, ונראה שהוא באמת נהנה ללמד את החומר. מה שכן אי אפשר להשיג אותו במייל בכלל. הייתי גם בשעת קבלה של הדיל, גם אחלה\nשם המתרגל/ת: שמעון סוחלובצקי\n\nחוות דעת - תרגולים: \nמתרגל נורא. הבן אדם עם כריזמה שלילית, לא יודע להסביר את החומר, משעמם ומבלבל את כולם. הוא גם לא מצליח להסביר את העקרונות והוא גם שוכח לפעמים להראות מה השאלה. גורם לחומר להיות כל כל הרבה יותר מסובך ממה שהוא. אני באמת חושב שיצאתי מהתרגול עם פחות ידע והבנה ממה שנכנסתי, באמת להתרחק כמו אש.\n\nשעורי הבית: \nקשים, כל קשר ביניהם לבין המבחן מקרי בהחלט. ניסיון ראשון תנסו לפתור בעצמכם, אחר כך תרפרנסו. תאמינו לי שאתם תרצו את שני הניסיונות בשביל הרפרנסים כי קל לעשות טעות בהצבה\nהמבחן: \nהוגן ויחסית קל, אפשר בקלות להוציא מעל 80, אבל צריך להיזהר כי יש לא מעט מלכודות\nהשורה התחתונה: \nהקורס סבבה, חוץ מהשיעורים ושמעון", "timestamp": 1713176766155}, {"author": "תפוד", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  גידי\nחוות דעת - הרצאות: נחמדות ביותר, ממליץ ללכת ל3-4 הרצאות הראשונות להנות מהמופע ולעבור לראות הקלטות של חנה\n\nשם המתרגל/ת: לא מומלץ ללכת לתרגולים תראו את רון ברסלר (הידוע לשמצה בתור ה\"קינג\")\n\nשעורי הבית: שמיים וארץ לעומת ההרצאות והתרגולים. שיעורי בית ראשונים קלילים ואז מגיע גליון 5.\n\nהמבחן: קל עד לכל היותר בנוני\n\nהשורה התחתונה: תנע זוויתי, תנע זוויתי...", "timestamp": 1713196970688}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גידי אלון \nחוות דעת - הרצאות: \nגידי מרצה שכיף ללמוד איתו , גורם לכם להבין פיסיקה ואף להתעניין יותר בחומר, תמיד מביא איתו להרצאות חפצים שימחישו כל נושא שנלמד בכיתה.\nלפעמים תרגישו שהוא מרחף קצת אבל הוא מספיק לעשות את מה שצריך ואף יותר.\nמתחילת הסמסטר כל שבועיים הוסיף עוד שעות קבלה כדי לעזור לסטודנטים.\nחוץ מכל זה הוא בנאדם מדהים עם רוח צעירה יותר מהסטודנטים עצמם אז לכו אליו !\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: \nבתחילת הסמסטר הלכתי לכל המתרגלים של הקורס, לצערי נאלצתי לבחור את ההכי פחות גרוע ביניהם.\nלבסוף התברר שנועם הוא מתרגל טוב בסה״כ.\nהתרגולים יצרו פער מאוד גדול בין ההרצאות ושיעורי בית לכן את תחכו לתרגולים להבין את החומר ותראו את הסרטונים של רון בסלר ביוטיוב הוא הציל לי את הקורס\nשעורי הבית: \nבגדול שיעורי הבית לא היו קשים מאוד אבל חד משמעית רמה יותר גבוהה מהמבחן ולקחו מלא זמן\nוחוץ מזה רוב השאלות היו צריכות חישובים מדויקים (מה שלא עושים במבחן) ומורידים על כל סטיה בחישובים אז תרגישו חופשי לגשת לרפרנסים של האקסל לפני שתגישו כל גיליון.\nהמבחן: \nמבחן דיי הוגן ואפשר לקבל בו 100 אם מתרגלים 5 ימים בלי הפסקה .\nהשורה התחתונה: קורס חובה אבל סביר, תזכרו שהוא 2.5 נקז אז קחו בחשבון לא לזלזל במקצועות אחרים כדי לקבל בו ציונים ממש גבוהים", "timestamp": 1713426776095}, {"author": "Shai Tebeka", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי(גדעון) אולן\nחוות דעת - הרצאות: נהדרות, גידי מעביר הרצאות כאילו הן סמינר לימודי חד פעמי ולא שיעור פיזיקה באוניברסיטה, העבירה בהרצאה קלילה ומרעננת. לקראת סוף הסמסטר אפילו התאכזבתי שלא נכנסנו יור לעומק בחומר. \n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: נהדר, למרות שהתרגול הוא רק שעה, נועם הצליח לעבור בקצב טוב ושניתן לעקוב אחריו על החומר ולהתרכז בדקויות הרלוונטיות לחומר של אותו שבוע. ממליץ\n\nשעורי הבית: בסדר, שיעורי הבית הם להגשה דרך המחשב, שמתקבלת רק תשובה נכון\\לא נכון ולא נותנים חוות דעת של ממש או דרכים לשיפור הפטרונות, אבל הם לא היו קשים מדי והכינו אותי לא רע לבחינה\n\nהמבחן: בסדר, לא קשה מדי אך גם לא קל לגמרי\n\nהשורה התחתונה: קרוס נחמד, עובר על הבסיס של הפיזיקה בלי להכנס לדקויות כל כך.", "timestamp": 1713443258964}, {"author": "Margarita Birchanskiy", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גידעון אלון\nחוות דעת - הרצאות: מרצה מעולה, כיפי, מעביר את ההרצאות עם הרבה צחוק בצד. עם זאת תמיד מפוצץ בהרצאות שלו ואפשר לצאת עם הרגשה שהבנת את החומר ואז לפתוח תרגילים ולא להבין מאיפה בכלל להתחיל. \n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: חסר כריזמה, לא מומלץ בכלל\n\nשעורי הבית: קשים משמעותית מהרמה בהרצאות ובתרגולים, עם זאת תרגול טוב לקראת המבחן, כי המבחן ברמה נמוכה יותר.\n\nהמבחן: אמריקאי, ממש סבבה, עם מספיק תרגול עולים על הרבה טריקים ויודעים לפענח טוב כל סוג של שאלה. בהתחשב בכך שלמבחן מגיעים עם 2 דפי נוסחאות (משני צדדים), ממש סבבה ואפשר לכתוב דוגמאות נפוצות ופתרונן.\n\nהשורה התחתונה: נחמד ומגניב, לא עמוס מדיי והמבחן עם מספיק הכנה ודף נוסחאות ממש בסדר.", "timestamp": 1713536839404}, {"author": "התחפשתי לגידי בפורים", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: אחלה גידי, קצת מתפזר ולא כולם מתחברים אליו, לא הלכתי להרצאות של המרצה המקבילה (הדיל) אבל הבנתי שהיא גם סבבה, גידי פשוט ממש חשוב לו שכולם *כולם* יבינו והוא יכול להעביר מלא זמן על שאלות וצחוקים, שאחלה יפה והכל אבל מרגיש שאנחנו שורפים מלא זמן על שטויות, לדעתי גם הוכחות למשוואות זה קצת מיותר (כי בואו למי אכפת מההוכחה של שימור תנע), אם לא מתחברים לגידי על ההתחלה, לא לפחד ללכת פשוט למרצה המקביל למרות שכולם כנראה יגידו לכם שלא\n\nשם המתרגל/ת: נועם (לא זוכר אם זה השם שלו)\nחוות דעת - תרגולים: משעמם טילים, הייתי מגיע לתרגולים שלו ומשחק באייפד, כריזמה של סט מצעים, אני בטוח שכל מה שהוא מראה על הלוח מאוד חשוב, אבל הוא מרדים פצצות, אם אתם צריכים 50 דקות של רעש לבן בראש, ממליץ, בכללי כל המתרגלים בקורס הזה קטטונים, אפשר בכיף לא ללכת לאף אחד מהם ולחסוך לעצמכם זמן ביום\n\nשעורי הבית: בולשיט, מיותר, תרפרנסו הכל ותתחילו לעשות מבחנים, בדיעבד מתחרט שהשקעתי עליהם כל כך הרבה זמן\n\nהמבחן: פשוט רצח, תעשו מספיק מבחני עבר ותבינו את הז'אנר \n\nהשורה התחתונה: אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי! אר קרוס פי!", "timestamp": 1713603162426}, {"author": "תנעזוויתיתנעזוויתי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פאקינג גידי\nחוות דעת - הרצאות: \nאיפה מתחילים ומה יש להוסיף שלא נאמר, אולי חלק טוענים שגידי מפוזר לעיתים אבל הם פספסו את העיקר, והעיקר זה המלאך הכאוטי גידי שהוא פשוט שואו לכל דבר, וממש לא הפיזיקה כי הפיזיקה באמת שטויות אם תפנו כמה ימים לפני המבחן, פשוט תבואו\n\nשם המתרגל/ת:  נועם נס\nחוות דעת - תרגולים: \nאם אתם לא לגמרי לגמרי אבודים בחומר אז מיותר לגמרי. ראיתי דגים עם יותר נוכחות בחדר, פשוט ההפך מגידי, מסביר בצורה הפורמלית ולא האינטואיטיבית ומרדים למות, בקושי מספיק משהו.\n\nשעורי הבית: מגיליון 5 נהיים קשים להחריד, אין סיבה לא להעתיק פשוט ולהבין אחר כך, צריך לזכור שבמבחן יש לכם רבע שעה לשאלה ובשיעורי בית לא אכפת להם שייקח שעה גם אז מפה נובעים הבדלי הרמה\n\nהמבחן: קל מאוד למי שלמד, עשה שיעורי בית ועשה מדיטציה של תוכן שקשור לגידי\n\nהשורה התחתונה: קורס חובה גם ככה אבל גידי יאיר לכם את היום,] תוציאו ציון סבבה ושימו לב שאתם לא משקיעים בקורס יותר מדי על חשבון חדוא", "timestamp": 1713635250884}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: חמוד מאוד ורוצה מאוד שכולם יצליחו אבל לפעמים קצת (מאוד) חופר. מדבר המון על דברים שלא ככ קשורים ואז מאבדים קשב כשהוא מדבר על דברים חשובים, אבל בסה״כ הוא אחלה גבר וקצת מרענן בין שאר המרצים\n\nשם המתרגל/ת: לא הייתי\nחוות דעת - תרגולים: \n\nשעורי הבית: אחלה, בול מה שיש במבחן אז ממליץ לעבור עליהם לפני, יש רפרנסים אז בקטנה\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: אחלה של קורס", "timestamp": 1714000178671}, {"author": "(חוצניק)", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גדעון (גידי) אלון \nחוות דעת - הרצאות: כיפיות. יותר מסבירות את הרעיון מאשר איך לעשות את התרגילים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: בתרגול ממש מסבירים לך איך לעשות את כל סוגי התרגילים שיתנו לך.\n\nשעורי הבית: אוכלות את הזמן בחישובים אבל סך הכל לא קשים.\n\nהמבחן: קל, רק יש לחץ זמן. המבחנים בעצם לא משתנים -- יש שאלות שכבר הופיעו כמעט אחד לאחד במבחנים קודמים. \n\nהשורה התחתונה: תעשה את שיעורי הבית ותהיה בסדר.", "timestamp": 1714042071183}, {"author": "S", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: גידי חמוד, מאוד חשוב לו שיבינו אותו והוא עונה על שאלות. מה שכן- קל להתפזר בהרצאות שלו כי הוא הרבה פעמים קופץ מנושא לנושא (כולל כאלה על החיים ולא על פיזיקה), ומהר מאוד גם תגלו שאי אפשר לעקוב אחריו ברשימות תוך כדי. לפחות לא משעמם כי הוא אוהב להדגים ולזרוק חפצים באוויר. \nשורה תחתונה- אחלה מרצה, קשוב, אכפת לו מהסטודנטים.\n\nשם המתרגל/ת: ניסיתי איזה 3 ועברתי למוקלט של אלדנה מלפני כמה שנים והיא תותחית.\nחוות דעת - תרגולים: המתרגלים לא הכי חדים, מבזבזים חצי מהשיעור על לכתוב את השאלה על הלוח למרות שיש את הקובץ במודל. התרגולים הראשונים בכלל מיותרים אם אתם לא סמסטר ראשון (מלמדים מה זה וקטור). חבל שהתרגול רק שעה, כי בהמשך החומר נהיה הרבה יותר קשה.\n\nשעורי הבית: במודל סטייל וובוורק. ה3-4 הראשונים קלילים, אחרי זה נהיים קשים ברמה בלתי נסבלת מבחינת זמן עבודה וניסוחים מעצבנים. כל מטלה כזו היא על נושא אחד אז הם חיפשו להיות יצירתיים. יש מליון רפרנסים בדרייבים אז אל תבזבזו את הזמן שלכם (גם לא תורם מי יודע מה למבחן).\n\nהמבחן: 12 שאלות אמריקאיות. לא קליל, אבל סה\"כ הוגן מאוד, היה ממוצע די גבוה. כדאי לבוא עם דף נוסחאות טוב שיש בו דוגמאות של שאלות מורכבות. לתרגל טוב ממבחני עבר ואתם סבבה.\n\nהשורה התחתונה: בתור שונאת פיזיקה הוא היה סביר ועביר.", "timestamp": 1714514296798}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלון גדעון (גידי)\nחוות דעת - הרצאות: חוויה ללכת להרצאות שלו, משקיע מאוד, לא מעמיק מספיק בחומר בהרצאות שלו.\n\nשם המתרגל/ת: נעם נס\nחוות דעת - תרגולים: מאוד משתדל, מתקדם לאט מידי בחומר, לא מספיקים לעבור על כל התרגילים בשעה, הפסקתי לבוא לתרגולים.\n\nשעורי הבית: די קשים\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1714565754853}, {"author": "ו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: גידי בן אדם מלך, כיפי ומעניין. משלב המון עניין בהרצאות שלו, ופשוט כיף להקשיב לו. עוזר ממש בכל מה שצריך ונשאר אחרי כל הרצאה כדי לענות על שאלות גם אם זה לוקח שעה. הוא קצת מבולגן ומפוזר אבל חד משמעית שווה את זה\n\nשם המתרגל/ת: דור  \nחוות דעת - תרגולים: אחרי שהייתי אצל כל המתרגלים דור היה הכי טוב מביניהם, הספיק את כל השאלות בתרגול עם רמת הסבר סבירה ךעומת האחרים שלא היו מספיקים שאלות בכלל או פשוט לא מסבירים כמו שצריך \n\nשעורי הבית: קשים אבל גידי פותר אותם כל שעת קבלה אז שווה להצטרף ולהבין את הפיתרון לקראת המבחן \n\nהמבחן: לא קל אבל כן עביר ברגע שקולטים את הקטע כי יש ששאלות שחוזרות על עצמן ובדף נוסחאות אפשר לכתוב מה שרוצים. \n\nהשורה התחתונה: קורס לא פשוט אבל מעניין וגידי יעשה הכול כדי לעזור ולהסביר", "timestamp": 1715179463856}, {"author": "דנה הודיה ברנשטיין", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מסודרים במיוחד הדיל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חלק מקריאים מהדף לא עוזרים\n\nשעורי הבית: קשים, לא ברמת מבחן\n\nהמבחן: מאוד מתחשב\n\nהשורה התחתונה:", "timestamp": 1715597773727}, {"author": "חן השילוני", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות:  חד משמעית גידי המרצה (ומורה) הכי טוב שאי פעם נתקלתי בו. הרצאות מלאות הומור והסברים נהדים לחומר, שגורמים לכך שמגיעים להרצאות של גידי 300(!) אנשים, ועדיין הם ברמה ממש גבוהה. \n\nשם המתרגל/ת:  שמעון\nחוות דעת - תרגולים:  שמעון דיי חסר כריזמה, ואני תמיד יצאתי מהתרגולים שלו בהרגשה רעה בפה, שלא ממש עזר לי התרגול. השלמתי את רוב התרגולים בסיכומים שהעלו למודל, וגם למדתי מהם הרבה יותר טוב.\n\nשעורי הבית:  רוב התרגילים הופיעו בשב של שנים קודמות, אם תסתכלו בדרייב הפקולטי שלכם ככל הנראה תמצאו את התשובות לחלק נכבד מהשאלות. חשוב אבל לנסות לפתור ללא עזרה, כי בדיוק אותו סוג שאלות מופיע במבחן, באותה רמת קושי.\n\nהמבחן: ממש נחמד, 2 שאלות (מתוך 12) היו מאוד פשוטות ורק בדקו הבנה של הנושא, והשאר, כמו שאמרתי, בול כמו מה שמופיע בשב.\n\nהשורה התחתונה:  אם לקחתם פיזיקה בתיכון, הקורס הזה יותר משמש בתור רענון החומר וטיפה התעמקות בנושאים מסויימים (עם תוספת יחסות פרטית, שזה פחות אינטואטיבי, אבל מה לעשות). כל עוד אתם הולכים לגידי הקורס הזה יהפוך בקלות לאהוב שלכם בסמסטר, אז אל תוותרו על ההזדמנות!", "timestamp": 1715960902195}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: בסוף הסמסטר לא הלכתי ל3 הרצאות האחרונות וזה לא הפריע לי כלום, בהרצאות מסבירים דברים בצורה פשוטה מאוד, הבסיס של הבסיס של הנושא, וזה לא עוזר לענות על ש״ב ומבחן בכלל.\n\nשם המתרגל/ת: שמעון\nהלכתי לתרגול ראשון, הכתב שלו מאוד מאוד קטן, וצריך לבקש ממנו להגדיל כל 5 דקות והוא לא מגדיל כל כך, והוא כמעט העתיק מה שבסכום שנמצא במודל ולא דיבר הרבה. \nבתרגולים רמת התרגילים עולה קצת אבל עדיין לא מכסה את כל החומר. \nצפיתי בתרגול של סשה והיה עוזר.\nחוות דעת - תרגולים: \n\nשעורי הבית: קשות מאוד, ויותר משאלות המבחן, לא כדאי לבזבז הרבה זמן בהם, כי הם קשים בהגזמה\n\nהמבחן: הוגן מאוד, אם לומדים הרבה מבחנים, אין רעיונות חדשים.\n\nהשורה התחתונה: נעזרתי בסרטונים של רון בסלר, וזה עזר יותר מהרצאות ותרגולים, ולדעתי אפשר להסתפק בהם.", "timestamp": 1716230371897}, {"author": "ערפילית", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גדעון אלון \nחוות דעת - הרצאות: ההרצאה שלנו היתה ממוקמת בימי חמישי ואלה היו שעתיים של *ריפוי* באמצעות פיזיקה. מרצה יוצא דופן שמראה לא רק את ההיבטים הפיזיים של המקצוע אלא גם את הפילוסופיים. והשבוע נחתם עם טעם טוב בזכותו. האולם גדוש בצופים, אז תקדימו לתפוס מושב.\n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: התרגול הוא באורך של שעה בלבד, וזה מורגש בהספק שהוא רק שתי שאלות בדיוק. המתרגל עצמו לא נכנס לפרטים על כל שאלה שכבר פתורה בסיכומים בכתב. אפשר להסתפק בהבנה עצמאית שלהם.\n\nשעורי הבית: ממוחשבים, כמה מהם ברמה גבוהה יותר מאלה במבחן.\n\nהמבחן: אמריקאי והוגן.\n\nהשורה התחתונה: קורס טוב, פיזיקה תיכונית עם הרחבה לכמה נושאים חדשים.", "timestamp": 1716391465363}, {"author": "סטודנט באוויר", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: \nההרצאות של גידי מאוד קלילות ומעניינות וזה מרגיש בעיקר כמו הצגה, בסופו של דבר זה לא מכין למבחן והייתי צריך לראות המון סרטונים של חנה כדי להתכונן, ממליץ ללכת להדיל \n\nשם המתרגל/ת: שמעון \nחוות דעת - תרגולים: \nהמתרגלים לא היו וואו, שמעון ממש מבלבל וקשה מאוד להבין אותו.\n\nשעורי הבית: שיעורי הבית נהיים קשים בהדרגה, יש רפרנסים טובים ואפשר להיעזר בהם  \n\nהמבחן: \nהייתי במילואים במועד א והמועד ב היה מאוד קשה, תנסו לא להפסיד אותו \nהשורה התחתונה: \nקורס מעניין מזכיר מאוד את הפיזיקה של התיכון צריך לתרגל המון מבחנים מהאתר של פיזיקה לפני המבחן", "timestamp": 1716496251432}, {"author": "אבי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי \nחוות דעת - הרצאות: גידי מהמם בתור בנאדם וגורם לך לאהוב פיזיקה אבל קל נורא לאבד אותו במהלך השיעור \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תרגולים שלא תורמים בכלים, פשוט לקרוא מהמצגת ולראות את הפתרונות \n\nשעורי הבית: יש קשים יותר יש קלים יותר סה״כ בסדר \n\nהמבחן: הוגן מאוד! אמריקאי. אין מטרה להכשיל, אם אתם יודעים את החומר המבחן ילך מעולה \n\nהשורה התחתונה: לכו לגידי לאהוב פיזיקה אבל תלמדו לבד בבית לא קצת", "timestamp": 1716630702228}, {"author": "אאאאלף", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גדעון אלון (גידי)\nחוות דעת - הרצאות: \nוואו.\nקראתי עליו לפני זה ביקורות בצ'יזפורק אז ידעתי שהוא טוב, אבל לא ממש ידעתי למה אני נכנס בהרצאה הראשונה.\nקחו מופע אימפרוביזציה, טיפול פסיכולוגי וטקס גירוש שדים, תערבבו עם הרבה פיסיקה ותקבלו משהו דומה להרצאות של גידי.\n\nלגידי יש יתרון וחיסרון אחד קריטי- ממש חשוב לו שכולם יבינו את החומר. אז הוא גורם לזה לקרות גם בעזרת כלים סטנדרטיים כמו שעות קבלה אליהן הוא פחות או יותר התחנן שנגיע, להישאר שעה אחרי השיעור כדי לענות על שאלות, הדגמות חיות ויצירת סביבה שמעודדת שאילת שאלות, וגם בכלים פחות סטדנרטיים כמו הפרעות יזומות בשטף ההרצאה כדי שמי שאיבד קשב יוכל לחזור (בדרך כלל בעזרת משהו מפתיע כמו שיר, או מחבת מעופפת).\nלמי שהחומר לא בא לו באופן טבעי זה יכול ממש להועיל, ולמי שהחומר בא קצת יותר בקלות, זה אולי טיפה מעכב אבל החוויה שווה את זה, וכנראה שהוא לא באמת יצטרך למידה ממוקדת יותר כדי להצליח בקורס כי הוא באמת לא קשה יותר מדי.\n\nאם יש לכם את הבחירה, לכו לגידי, הוא באמת משהו מיוחד. לא תצטערו על זה.\n\nהערה קטנה- אתם לא היחידים שקראו ביקורות מפרגנות על גידי בצ'יזפורק. הולכים להיות מלא אנשים בהרצאה, תהיו מוכנים ותגיעו מוקדם אם חשוב לכם לשבת מקדימה\n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: \nנועם ממש נחמד ורוצה לעזור, אבל בשעה בודדת של תרגול באמת לא היינו מספיקים הרבה. אם אתם חושבים שתצטרכו הרבה עזרה בקורס לא בטוח שהייתי הולך אליו, ואם אתם חושבים שלא תצטרכו הרבה עזרה אז לא בטוח ששווה לבוא לתרגולים באופן כללי.\n\nשעורי הבית: \nגליונות במודל. די קשים, רובם מעל הרמה של המבחן.\nיש שלושה נסיונות והסגל בדרך כלל ממש מוכן לעזור בשעות קבלה אז אל תנצלו את כל הניסיונות שלכם לפני שהלכת לשעת קבלה\n\nהמבחן: \nסביר לגמרי. 12 שאלות אמריקאיות עם 6 אופציות כל אחת.\nמותר להביא מחשבון ושני דפי A4 דוצ עם מה שבא לך עליהם, שזה די והותר. יש דפי נוסחאות מוכנים משנים קודמות בכל מיני דרייבים פקולטיים, תחפשו\n\nהשורה התחתונה: \nקורס מצוין. אני אפילו טיפה מקנא במי שהולך ללמוד אותו הסמסטר", "timestamp": 1716739579128}, {"author": "Aviva Peimer", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: הדיל ח'מיס\nחוות דעת - הרצאות: מאוד ברורה ועניינית. \n\nשם המתרגל/ת: דור קופלוביץ\nחוות דעת - תרגולים: ממש בסדר סה\"כ, מסביר די ברור ומיקם לנו את שעת הקבלה צמוד לתרגול שזה נוח.\n\nשעורי הבית: הוגנים. לא משקפים כזה מדוייק מה יהיה במבחן אבל מכינים טוב מבחינת ההבנה של החומר.\n\nהמבחן: הסגנון מאוד ממוחזר ככה שאם עוברים על מספיק לגמרי אפשר להוציא ציון יפה.\n\nהשורה התחתונה: אחלה קורס, לי היה מאוד כיף להבין בעקבותיו את העולם שאנחנו חיים בו קצת יותר טוב.", "timestamp": 1716741268599}, {"author": "Tom", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: חד משמעית תלכו לגידי, מרצה פשוט מדהים כבן אדם וכיף לבוא להרצאות שלו. באמת אכפת לו מהסטודנטים ושכולם יבינו. מה שכן לי יצא כן לאבד אותו הרבה\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: מאוד משתדל להסביר וחשוב לו שכולם יבינו אבל לטעמי הוא היה איטי מידי והתעכב על דברים שראינו בהרצאות במקום על תרגול\n\nשעורי הבית: לא קשים במיוחד אבל הם לא ממש קשורים לסגנון המבחן בפועל\n\nהמבחן: הוגן ביותר\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1716834106393}, {"author": "אני", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאני ראיתי את חנה מוקלט אבל מסבירים יותר מידי לעומק, ממליצה על הפקל של ערן, סגר את הפינה מפחיד \nשם המתרגל/ת: לא הלכתי \nחוות דעת - תרגולים: בזבוז זמן \n\nשעורי הבית: קלים יחסית, דומים למבחן \n\nהמבחן: אם עושים את הפקל של ערן -ציפס. \n\nהשורה התחתונה: פקל של ערןןןן (not sponsered)", "timestamp": 1716976089802}, {"author": "hamode", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גדי\nחוות דעת - הרצאות: תאמת רק הלכתי ל שתי הרצאות , אתם לא באמת צריכים את ההארצאות החומר לא קשה אפשר ללמוד לבד בבית\n\nשם המתרגל/ת: דור\nחוות דעת - תרגולים: הוא סבבה אבל הפסקתי ללכת אחרי תרגול שני\n\nשעורי הבית: לא עמוס\n\nהמבחן: קל יחסית\n\nהשורה התחתונה: ממליץ לקנות את הקורס של ערן", "timestamp": 1717269608887}, {"author": "ו", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה:גידי \nחוות דעת - הרצאות: מסביר בהתלהבות ועושה גם זומים לקראת המבחן שבהם הוא פותר שאלות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718773768044}]}