{"posts": [{"author": "אלו", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: טיל\n\nשם המתרגל/ת: גדעון אלון\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: קשים אבל לא מידי\n\nהמבחן: הוגן.\n\nהשורה התחתונה: להיות עם יד על הדופק", "timestamp": 1610987081431}, {"author": "אמיר", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופסור דניאל פודולסקי\nחוות דעת - הרצאות: טוב מאד אבל מתעקב בלענות לשאלות של הסטודנטים\n\nשם המתרגל/ת: דוקטור גדעון אלון\nחוות דעת - תרגולים: טוב מאד, אבל כותב מאד קטן על הלוח שבאופן מקוון קשה לראות מה רשום בו\n\nשעורי הבית: תרגול טוב\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1611421722559}, {"author": "---", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: הכנה להרצאות (רשימות) ברמה גבוהה ביותר\nאך מתקשה בעברת השיעורים ומתעקב על שאלות לא רלוונטיות\nשם המתרגל/ת:  גידי \nחוות דעת - תרגולים:\nבסכ תרגולים מועילים מתרגל ממש טוב ואנרגטי \n\nשעורי הבית: \nקשים מועילים, אך לא תמיד ברורים\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1612333466010}, {"author": "refael Zilberblat", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דינאל פודולסקי\nחוות דעת - הרצאות: \nמרצה נהדר,נחמד מאוד וסופר מסודר,מסביר טוב את החומר\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: \nמתרגל מדהים ותותח, מסביר כמה שצריך ומשקיע מלא זמן אקסטרה כדי לעזור לסטונדנטים.\nשעורי הבית: \n\nהמבחן: \nפייר\nהשורה התחתונה: \nקורס קשה. גיליון שיעורי בית כל שבוע,קשה ודורש זמן.\nיחד עם זאת הקורס מעניין.", "timestamp": 1612795413416}, {"author": "שלדון קופר", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל פודלסקי\nחוות דעת - הרצאות: מעולה. הוא הכין לנו סיכומים מעולים בכל נושא ואני מאוד אהבתי את הרעיון.\n\nשם המתרגל/ת: גדעון אלון\nחוות דעת - תרגולים: מעולה. תמיד מלא באנרגיות חיוביות והתלהבות מהפיזיקה.\n\nשעורי הבית: דורשים השקעה אבל לא משהו מטורף.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: אין על פיזיקה", "timestamp": 1612852686516}, {"author": "א", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: הוא כתב סיכומים של החומר וביקש לקרוא אותם לפני כל שיעור (קצת כמו כיתה הפוכה). הסיכומים מעולים וברורים, ומאוד עזרו לי להבין את ההרצאות עצמן. דניאל מרצה טוב, למרות שהוא לא כל כך טוב בלנהל שאלות של סטודנטים (לפעמים מתעכב, לפעמים פשוט עובר הלאה). אבל הוא בסך הכל סבבה. הוא גם המרצה היחיד, אז זה לא כאילו יש לכם ברירה.\n\nשם המתרגל/ת: יונית\nחוות דעת - תרגולים: מתרגלת טובה מאוד. גם שמעתי דברים טובים על גידי, ולמרות שלא יכולתי לבוא לתרגולים שלו אני יכול לאשר שהוא מתרגל מעולה (באתי לשעת קבלה שלו לפני המבחן והתרשמתי מאוד). כל מה שכותבים עליו פה כנראה נכון.\n\nשעורי הבית: קשוחים אבל עוזרים להבין את החומר\n\nהמבחן: קשה אבל הוגן, במיוחד ביחס לשנים קודמות\n\nהשורה התחתונה: לשמור יד על הדופק. ע\"פ רמת המבחנים משנים קודמות, אני חושב שרמת הקורס נהיית יותר שפויה לאחרונה, אבל עדיין אפשר לאבד את זה בקלות.", "timestamp": 1612873032365}, {"author": "SF", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאל \nחוות דעת - הרצאות: \nנחמד, רשימות מאוד טובות\nשם המתרגל/ת: גידי \nחוות דעת - תרגולים: \nמדהים, קשוב ועוזר מאוד.\nשעורי הבית: \nארוכים ולפעמים מאתגרים, אך שווים את ההשקעה\nהמבחן: \nהגון מאוד\nהשורה התחתונה: ללמוד טוב ולתרגל הבנה", "timestamp": 1612899155308}, {"author": "XxX_QuickScoper420_XxX", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nמעניין, יש רשימות מעולות שהוא כתב שעוזרות רצח.\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: \nמצויין יודע את  החומר ומנוסה מאוד. בנוסף, את התרגול הוא מעביר בצורה מעניינת רצח.\n\nשעורי הבית: \nקשים וחשוב לעשות. לא ללכת לשעת קבלה ולכתוב מה שהמתרגל כתב על הלוח ולהגיד \"הבנתי הכל איזה כיף\" חייב להתמודד עם שאלות \"שאין מושג\" איך פותרים, ככה זה המבחן.\n\nהמבחן: \nקשה, אבל דומה לשיעורי בית, אפשר להצליח. בנוסף, קשה ללמוד אליו כי החומר בקורס הזה משתנה בצורה הזויה משנה לשנה. הכי חשוב לעשות שיעורי בית \"ולהתמודד\" עם שאלות ברמת מבחן באופן שוטף כדי להיות מוכן טוב. \n\nהשורה התחתונה: \nקורס מעניין וקשה, הסגל עשה בקורס המון סדר שזה חשוב. \nלקחת בחשבון שבפועל \"רוב הקורס\", כלומר החלק הקשה ומה שמופיע במבחן, זה השליש האחרון של הסמסטר. בחלק הזה הקורס נהיה ב10 רמות יותר קשה במכה, לא להרגיש ש\"וואו זה קל למדנו את זה בתיכון\" כי זה לא מה ששואלים בבחינות.", "timestamp": 1612995343770}, {"author": "ינאי", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ' דניאל פודולסקי\nחוות דעת - הרצאות: מעולות. דניאל סוחף אותנו ומאוד נחמד, מאוד רוצה לבוא לטובתנו ומסביר ממש טוב. היה כיף ללמוד איתו והוא עשה את החומר מרתק ורלוונטי ואפילו מצחיק. \n\nשם המתרגל: ד\"ר גידי אלון \nחוות דעת - תרגולים: הוא היה נהדר, מבין מדהים את החומר ושולט בזמן שלו מעולה, שולח מראש את החומר שנעבור עליו כתוב, מוכן לשבת ולהשקיע גם שעות שלמות של קבלה רק על סטודנט בודד עם שאלה.\n\nשעורי הבית: קשים, ארוכים, אבל מאוד מספקים\n\nפרופ' דב לוין העביר לנו גם סדנה מתמטית שאני יכול לומר שמאוד עזרה לי באופן אישי, ואני מאוד ממליץ להגיע אליה, הוא חביב ומצחיק וכל שעה איתו היא ברכה\n\nהמבחן: קשה, אבל הוגן\n\nהשורה התחתונה: קורס כיף, לומדים המון, סהכ אפשר לעבור אותו אם משקיעים, ממליץ מאודדדד על גידי לכל דבר ועניין", "timestamp": 1613694299284}, {"author": "Hili Davidov", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מדהים!\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: מתרגל מעולה, משקיע בשעות קבלה וכו', מאוד ממליצה\n\nשעורי הבית: חשובים ממש להבנה\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1613753224494}, {"author": "חנן קרסנה", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ' דניאל פודולסקי\nחוות דעת - הרצאות: ההרצאות היו טובות מאוד.  דניאל מאוד השתדל שכולם יבינו וגם דאג לשלוח לפני ההרצאות את החומר עליו הוא יעבור כדי שנוכל להתכונן.\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: \nגידי היה המתרגל הכי מטורף שהיה לי בסמסטר.\nבא לכל תרגול עם אנרגיות ואהבה לחומר ולהוראה.\nמשקיע בהכנה של רשימות לתרגולים ובשעות על גבי שעות של לשבת עם סטונדטים ולעזור להם להבין את החומר.\nשעורי הבית: מאוד מאתגרים אבל אני אישית הרגשתי שהכינו אותי כמו שצריך למבחן\n\nהמבחן: הוגן מאוד. בשנים שלפני המבחן היה קצת יותר קשה אבל עדיין הוגן.\n\nהשורה התחתונה: אחלה קורס. לשים לב שהחצי השני הוא העיקר ולא להכנס לשאננות של \"למדתי אתזה בתיכון\" בגלל החצי הראשון", "timestamp": 1613808278769}, {"author": "n", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nהמרצה הכי חמוד ואכפתי בטכניון\n\nשם המתרגל/ת: איתי מנגל\nחוות דעת - תרגולים: \nאני אישית אהבתי, לא היו אצלו הרבה אנשים ככה שהיה יחס אישי\nשעורי הבית: \nמאתגרים, צריך לשבת עליהם חזק\nהמבחן:  קשוח אבל הוגן\n\nהשורה התחתונה: אם אתם רשומים לקורס הזה כנראה שאתם אוהבים פיזיקה, אז אתם תהנו ממנו כי זה חומר ממש מעניין", "timestamp": 1614088188785}, {"author": "דביר דימינסקי", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל\nחוות דעת - הרצאות: \nמעולה\nשם המתרגל/ת: גידי \nחוות דעת - תרגולים: \nמעולה\nשעורי הבית: \nקשים אך מלמדים\nהמבחן: \nקשה ויצירתי אבל אפשרי\nהשורה התחתונה: \nקורס קשה שדורש הרבה יצירתיות. עפתי עליו", "timestamp": 1614597993916}, {"author": "ל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: הדבר הכי טוב שיכול לקרות לכם! \nהמרצה הכי מתוק עלי אדמות, מסביר את החומר מעולה, קצת הולך לאיבוד כששואלים יותר מדי שאלות אבל סך הכל מצויין!\n\nשם המתרגל/ת: גידי (גדעון) אלון\nחוות דעת - תרגולים: מתרגל מצויין, אנרגטי ומקסים, לא תירדמו אצלו בתרגולים. חלק מהדברים מוסברים מנקודת מבט קצת ספציפית שלא בהכרח תתאים לכל אחד, אז שווה לנסות ואם יתאים לעוף עליו.\n\nשעורי הבית: רמת קושי בסדר גמור, מומלץ להשקיע בפתרון\n\nהמבחן: מאתגר אבל הוגן, לדעת את החומר התיאורטי היטב\n\nהשורה התחתונה:", "timestamp": 1615836833478}, {"author": "יוסי בכינור", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות:\nמעולות, יש גם רשימות שהוא כתב שזה הדבר שהכי עוזר בהבנת החומר. בנוסף, החודש האחרון (שבו 2 הנושאים האחרונים) קשה ועמוס ברמות, שאר הקורס הרבה פחות קשה.\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים:\nמעולה, מנוסה ומתרגל מעניין רצח, יש רשימות מעולות של התרגול גם.\nשעורי הבית:\nקשים, ארוכים מעיקים. חשוב רצח לעשות לבד זה הכי עוזר למבחן. לוודא שעושים ומבינים הכל.\nהמבחן:\nקשה, יש שינויים בחומר וקשה ללמוד אליו, אבל הוא פייר ודומה לשיעורי בית. בקיצור תעשו לבד את השיעורי בית תצליחו", "timestamp": 1627904557506}, {"author": "ממ", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: דניאל חמוד ממש, החומר מעניין, ויש באתר את הרשימות שלו מסודרות ממש. משתדל לענות לכל שאלה בצורה הכי טובה שיש.\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: גידי הוא לחלוטין המתרגל הכי טוב בטכניון. מעביר תרגולים כיפיים ומעניינים (שגם עם רשימות באתר), נהנה מלענות על שאלות ויישאר בכיתה אחרי התרגול עד שהסטודנט האחרון יבין. \n\nשעורי הבית: קשים אבל אפשריים אם משקיעים. במקרה הכי גרוע יש רפרנסים.\n\nהמבחן: \nקשה ממש, יותר משאלות שיעורי בית.\nהשורה התחתונה: כנראה הקורס הכי קשה לסמסטר ראשון בטכניון, אבל שווה את זה", "timestamp": 1644156138657}, {"author": "סטודנט של פיזיקה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דאניל\nחוות דעת - הרצאות: \nיש לו רשימות מצויינות, הוא דואג לכולם והמבחנים שלו יותר קלים משאר המרצים. אבל לא כל כך יודע לתת תשובות לשאלות\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: \nיש לגידי גם רשימות ממש עוזרות הוא עושה הרבה שעירים נוספים שממש עוזרים. הוא המתרגל הכי חמוד ועוזר שתפגשו בעולם\nשעורי הבית: \nכדאי לפתור את כולם הן באותה רמה של המבחן\nהמבחן: \nהוגן\nהשורה התחתונה: \nצריך להשקיע הרבה בקורס אבל להשאיר הרבה זמן לאנפי (כי בקורס הזה יותר קל לקבל עבר)", "timestamp": 1644234741962}, {"author": "אלמוני", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה מדהים\n\nשם המתרגל/ת: גדעון אלון\nחוות דעת - תרגולים: המתרגל הכי טוב\n\nשעורי הבית: המון\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644327483944}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nהמרצה הכי חמוד בטכניון, מסביר אחלה וגם מעלה רשימות ממש טובות ומפורטות למודל. לפעמים קצת מתעכב יותר מדי על שאלות, אבל רוב הסמסטר למדתי מהקלטות אז לא היה בעיה.\nבכללי אני מאוד ממליץ ללמוד מהקלטות עם הרשימות לידכם, לי בתור בן אדם שלא כל כך טוב בפיזיקה זה מאוד עזר שיש את האפשרות לעצור כשלא מבינים משהו או כשנאבדים באיזה חישוב אלגברי.\nשם המתרגל/ת: אלון סטרוגצקי / גידי אלון\nחוות דעת - תרגולים: \nבחצי הראשון של הסמסטר הגעתי לאלון, אחלה מתרגל, מסביר טוב את החומר ועונה על שאלות. גם השעות קבלה שלו מצוינות.\nבחצי השני של הסמסטר כבר פחות הגעתי פיזית לקמפוס ולמדתי בעיקר מההקלטות של גידי ומהרשימות של התרגולים. נראה שגם הוא מתרגל ממש טוב ולא סתם המון ממליצים עליו.\nשעורי הבית: \nכמעט כל שבוע גיליון. השלושה הראשונים קלים ומזכירים פיזיקה של תיכון, ואחר כך הם נעשים קשים מאוד מהר מאוד. יצא לי גם לשבת על גיליונות מסוימים 12 שעות אם לא יותר. ממליץ לנסות לפתור לבד אבל להשוות תשובות עם הרפרנסים כי הציון תקף. אם אתם רואים שטעיתם תנסו להבין את מקור הטעות ולא סתם להעתיק את התשובה הנכונה. גם כדי לוודא שאתם מבינים את החומר וגם כי לפעמים יש טעויות ברפרנס.\nהמבחן: \nהמבחן היה קשה בטירוף, אפילו שדניאל נחשב מרצה שנותן מבחנים קלים יחסית. חצי מהמבחן היה גאומטריה אנליטית (נושא שרובנו לא נגענו בו מאז התיכון) וחישוב פוטנציאל אפקטיבי (נושא שנלמד משהו כמו 15 דקות בסוף אחת ההרצאות). גם השאלה על התנע זוויתי הייתה לא פשוטה בכלל אבל השאלה על היחסות דווקא הייתה קלילה.\nמה שכן, הבדיקה של המבחן הייתה מאוד מקלה וגם נראה שנתנו פקטור משמעותי, כי יצא שקיבלתי ציון מכובד מאוד על מבחן שהייתי בספק שיקבל עובר כשהגשתי אותו (עוד לא התפרסמו הסריקות אז אני לא יודע להגיד בוודאות).\nהשורה התחתונה: \nקורס חובה, כנראה יעניין את מי שאוהב פיזיקה.\nחשוב מאוד גם במבחן הסופי וגם בבוחן אמצע שאם אתם לא יודעים משהו או שאין לכם זמן לפתור אז תכתבו דרך אופציונלית לפתרון ותסבירו אותה. כנ\"ל אם נראה לכם שטעיתם אבל אתם לא בטוחים איך לתקן. העלה לי לפחות 20 נקודות בציון, גם של הבוחן אמצע וגם של המבחן הסופי.", "timestamp": 1644511903730}, {"author": "בועז דדון", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרופ׳ דניאל פודולסקי\nחוות דעת - הרצאות: מדהים, מרצה מעניין ממש, כיף להיות איתו בהרצאות, בשעות קבלה, אכפתי מאוד ומוכן לעזור\n\nשם המתרגל/ת: ד״ר גידי אלון\nחוות דעת - תרגולים: כיפיים בטירוף, גידי סביר להניח המתרגל הכי טוב בטכניון. הוא יודע לעניין להסביר, תמיד מוכן לענות על עוד שאלות. תמיד מוכן לעשות מעבר, בעוד שעות קבלה מעבר לשעות הרגילות, להישאר אחרי השיעור, הוא מתרגל תותח\n\nשעורי הבית: קשים, יש שאלות לא פשוטות, הסגל של הקורס מאוד מתחשב ועוזר ותמיד מוכן לענות על שאלות אז זה עוד מקל\n\nהמבחן: לא קל אבל שאלות מעניינות\n\nהשורה התחתונה: קורס מעניין ממש, הסגל מדהים, שכיף להיות איתו בקורס, עוזר המון וזה מאוד מקל על העומס והקושי של הקורס", "timestamp": 1644836762078}, {"author": "אוהב פיזיקה", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nאויש הוא כזה מתוק, אין על דניאל. הוא מדי פעם מתקשה לענות על שאלות בצורה הכי ברורה אבל הוא באמת מתוק ומעביר את החומר בצורה מדהימה (וברשימות שלו יש הכל בצורה הכי מפורטת שיש פלוס בדיחות)\nשם המתרגל/ת: גידי האחד והיחיד\nחוות דעת - תרגולים: \nאין כמו גידי, אנחנו מאמינים שהוא כל כך אהב אותנו שהוא החליט לתרגל גם את 2פ, והיה כל כך כיף איתו. באמת מתרג מדהים. הוא גורם לך לאהוב פיזיקה בצורה לא נורמלית.\nשעורי הבית: \nקשים, אבל לא יותר מדי. לא הרגשתי כל כך לחוץ מהשיעורים אבל מה שאני יכול להגיד - אל תעשו עם רפרנסים.\nהמבחן: \nקשה, צריך לחרוש את החיים לפניו ואז לקוות למועד ב נחמד יותר אבל בסה\"כ הוגן.\nהשורה התחתונה: \nהקורס שהיה הכי כיף בסמסטר עד שהגיע המבחן, אבל יהיה טוב במועד ב", "timestamp": 1645168157593}, {"author": "_", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מסודר ומאורגן, מנהל את הזמן בצורה טובה ויודע להעביר את החומר בצורה מאוד ברורה.\n\nשם המתרגל/ת: איתי דוידוביץ'\nחוות דעת - תרגולים: תותח, היינו כיתה קטנה וזה נתן לו את היכולת לתת קשב לכל סטודנט וסדטודנט.\nעשה מעל ומעבר - זמינות במיילים, הסברים, שעות קבלה שאינן בשעות הקבלה. בקיצור מלך.\n\nשעורי הבית: קשים מאוד, יש רפרנס ב drive הפקולטי.\n\nהמבחן: קשה מאוד, \n\nהשורה התחתונה: יש פער מטורף בין ההרצאות-התרגולים-השיעורי בית והרמה במבחן בסוף! אני אישית עברתי במועד א' בנס.", "timestamp": 1645391709692}, {"author": "~~", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: פשוט מצוין! דניאל מאוד מושקע בלהעביר את החומר לסטודנטים, וניכר שמאוד מעוניין בהצלחה שלהם. זה מגיע לידי ביטוי בכך שהוא מקבל כל שאלה שהיא וחוזר על אותו רעיון כמה וכמה פעמים עד שנראה שכולם מבינים. כמו כן, הוא מפרסם את רשימות השיעורים שלו שהם מסודרות מאוד וממש עוזרות. כן יכול לאבד את חוט המחשבה לפעמים, אבל סך הכל באמת מרצה מצוין ולגמרי מדובר בזכות ללמוד איתו.\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: אין על גידי, מדהים כמה לראות כמה הוא אוהב פיזיקה ואת ההוראה, וכמה הוא מושקע בכך שנבין את החומר כמו שצריך ושנצליח. משקיע אינספור שעות מעבר למה שצריך, וגם איתו יש רשימות מסודרות של מה עוברים בכל תרגול. סופר מוערך והלוואי שהיה מתרגל בכל קורס.\n\nשעורי הבית: מתחילים די דומה למה שעוברים בתיכון, אבל אחרי כמה שבועות הרמה עולה פתאום. רוב הזמן שיעורי הבית קשים, אבל חשוב מאוד לעשות אותם ולנסות לשבת עליהם לבד. חשוב להגיד שהדגשים של הקורס השתנו במידה מסוימת מאז שגידי ודניאל נכנסו אליו, ואז המבחנים של שנים קודמות לא תמיד הכי משקפים את המבחן שלהם, ודווקא שיעורי הבית דווקא משקפים יותר במדויק מה ירצו לראות במבחן, אז מומלץ בחום להשקיע בהם לבד.\n\nהמבחן: לא קל, דורש הבנה ויצירתיות על גבי החומר הבסיסי שמכירים, אבל לגמרי אפשר לעבור אותו.\n\nהשורה התחתונה: ללא ספק הקורס הכי מעניין שעשיתי הסמסטר, עם הסגל שהשקיע הכי הרבה וניכר שכולם היו מאוד מושקעים בהצלחתנו. עם זאת ללא ספק מבין הקורסים הקשים יותר של הסמסטר, זה מה יש.", "timestamp": 1645434495943}, {"author": "נפתלי בנט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  דניאל פודלסקי התותח\nחוות דעת - הרצאות: אלה ההרצאות שהכי נהנתי לבוא אליהם, פעם אחת כאב לי הראש ובכל זאת באתי להרצאה כי שמעתי שהולכים לדבר על תנועה הרמונית ואני לא מצטער על אף רגע. הוא נותן זמן למי שרוצה לשאול שאלות, ומי שלא מעוניין להקשיב לשאלות יכול אפילו בנתיים להסתכל ברשימות היפייפיות שלו בזמן ההרצאה, מומלץ בחום להביא אותם למי שיש לפטופ\\אייפד... עוזר מאוד ללמוד למבחן ובאופן כללי בקורס! בהרצאה האחרונה שלו הזלתי דמעה. תודה פודולסקי!\n\nשם המתרגל/ת:  Alon Strugatsky (אלון)\nחוות דעת - תרגולים: עם אלון היה ממש כיף, אפשר לאמר שבזכות השעות קבלה שלו, שבהם הוא נותן יחס אישי ולא מוותר על אף סטודנט, עזרו לי להפציץ בבוחן אמצע ציון שלא חלמתי שאני יקבל בסמסטר הראשון של התואר הזה. גם מי שלא אצל אלון ממליץ בחום לבוא לשעות קבלה! \n\nשעורי הבית: האמת שהם ממש כיפים להכנה ולא עמוסים מידי, רק לקראת סוף הסמסטר זה ניהיה קצת עמוס אבל בהתחלה ובאמצע הגליונות כולם חשופים ורק מחכים שתפתרו אותם, ואם מישהו מסתבך כמובן שיש רפרנסים שנועדו לעזור או להציל את המצב במקרה הגרוע ביותר. באופן כללי צוות הקורס היה מאוד מקצועי ונחמד לגבי שיעורי הבית תמיד נתן הארכות למי שהיה צריך\n\nהמבחן: היה להרבה אנשים קשה, בכל זאת פיסיקה בטכניון... אבל לגמרי פתיר ועם הרבה למידה לא צריך לפחד ממנו זה לא אינפי 1מ' אחרי הכול...\n\nהשורה התחתונה: קורס מעניין, חשוב להבין דברים גם אם זה לא יהיה במבחן אתם עושים תואר בפיסיקה ולכן חשוב לא להזניח דברים שלא הבנתם בקורס ולהתעכב עליהם. צוות הקורס מורכב ממרצה מדהים ושורת מתרגלים מצויינים שמעודדים את הסטודנטים להצליח בכל דרך אפשרית. כל הכבוד לכם צוות פיסיקה 1פ'.", "timestamp": 1646061031058}, {"author": "Daniel Oukhanov", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: דניאל \nמרצה באמת מעולה ואיכפתי \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: גידי \nבן אדם שבאמת יוצר התלהבהות מהחומר \n\nשעורי הבית: עמוסים אבל טובים ורלוונטים למבחן\n\nהמבחן: \nקשה אבל אפשרי \nהשורה התחתונה:", "timestamp": 1646748950083}, {"author": "נוטון גנב ת'חדווא", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: דניאל מקסים, מסביר מאוד ברור ועונה בסבלנות לשאלות. ממליץ ללכת אליו לשעות קבלה, כי יש לו הבנה עמוקה ויודע לענות יפה על שאלות שלפעמים המתרגלים מסתבכים איתן קצת.\n\nשם המתרגל/ת: גידי אלון/אלון סטרוגצקי/איתי דוידוביץ\nחוות דעת - תרגולים: הלכתי לשלושה מהמתרגלים לסירוגין. גידי תותח אבל הוייב שלו לא מתאים לכל אחד, הוא מאוד משקיע ולמשל עשה סדנאות לפני המבחן בימי שישי בבוקר. לא עונה למיילים כמעט בכלל. אלון ואיתי אלופים, מסבירים מעולה וממש נכונים לעזור לכל מי שצריך.\n\nשעורי הבית: ממליץ לעשות אותם טוב טוב, להשתמש גם ברפרנסים שבדרייב בחכמה ובעיקר בשעות קבלה. \n\nהמבחן: לא יודע מה יהיה סמסטרים הבאים, אבל דניאל שינה את הקורס. המבחנים שלו שונים לגמרי מהמבחנים של שנים קודמות בטכניון, לטעמי כמעט ואין למה לגעת במבחנים של בכר/קרן ושות' כי הם מתמקדים בקוריוליס ואוילר ובעוד דברים שדניאל פחות מתמקד בהם. מומלץ לחפש מבחנים מאוניברסיטאות אחרות - ת\"א, העברית, יותר דומים בסגנון. וכמובן מבחני עבר של דניאל. ממליץ גם לנסות לפתור תרגילים מהספרים של ברקלי ושל מורין, למרות שמורין ברמה מאוד גבוהה ומעטות השאלות שם שמתאימות לרמת הקורס, אבל הן עדיין מעולות. כדאי ללמוד כבר שבועיים לפני, ולהתמקד בדברים שאמרתי. פחות רלוונטי לעבור על הרצאות ותרגולים כי בפיזיקה העיקר זה לתרגל בעצמכם, כל עוד שאתם סגורים על החומר של הסמסטר כמובן. המתמטיקה של 1פ של דניאל לא מוגזמת, אז אין למה להיבהל מזה שאתם לא יודעים עדיין אינפי וכו'. בעיקר לשים לב שאתם מבינים איך מחשבים מומנט התמד ומרכז מסה של גופים רציפים, להשתמש ב\"שיטות אינטגרציה\" שמלמדים בסדנאות - זה יותר כמו טריקים ופחות כמו מה שלומדים בפקולטה למתמטיקה. \n\nהשורה התחתונה: קורס שפותח את הראש, כדאי להשקיע כי זה 5 נקז. מטרת הקורס היא לבנות אינטואיציה פיזיקלית, להתרגל לחשוב כפיזיקאי. חשוב מאוד להשקיע זמן, הסמסטר מתחיל מאוד קליל ואפשר בקלות להיכנס לשאננות. מאוסילטורים/עבודה אנרגיה זה מפסיק להיות סתם חומר של תיכון, וכדאי גם לשים לב שסגורים טוב טוב על \"קורדינטות פולריות\" של אר כובע וטטא כובע וכל הביטויים שתלויים בהן, כי כשלומדים את זה בתנועה מעגלית קל להתעלם אבל זה חוזר בהפוכה בהמשך. הנושא המורכב של הקורס זה תנע זוויתי, פשוט כי הבעיות שם כוללות הרבה שיקולים שמאוד משתנים מבעיה לבעיה. הנושא הכי קל וטכני זה יחסות פרטית. לשים לב שמבינים טוב עבודה ואנרגיה, ואת הקשר בין פוטנציאל לכוח, ואת הקשר בין פוטנציאל לתדירות ולמסה אפקטיבית של תנודות קטנות. הקורס עצמו בנוי מאוד טוב וניכר שסגל הקורס משקיע בו כדי שיהיה ברמה גבוהה - יש רשימות מעולות של גידי לתרגולים, ורשימות טובות של דניאל להרצאות.", "timestamp": 1646761186877}, {"author": "-", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה מצויין, מלמד בצורה עניינית וברורה ויש לו רשימות מצויינות. מאוד קשוב וסבלני וחשוב לו שהסטודנטים יצליחו בקורס.\n\nשם המתרגל/ת: גדעון אלון\nחוות דעת - תרגולים: מתרגל מצויין, מאוד חשובה לו ההבנה של החומר והתרגולים מתרכזים המון בפן הזה (בנוסף לתרגילים עצמם). גם לו יש רשימות מצויינות שמאוד נוח לעבוד איתן. הוא ידוע כמתרגל טוב אז הכיתה קצת עמוסה אבל שווה את זה.\n\nשעורי הבית: ארוכים אך פתירים\n\nהמבחן: קשה מאוד אבל בדיקה סלחנית\n\nהשורה התחתונה: קורס מעניין מאוד לחובבי הפיזיקה אך דורש הרבה עבודה. ניכר שהסגל רוצה בטובת הסטודנטים והם עובדים קשה כדי שנצליח בקורס. גם המרצים וגם המתרגלים מאוד אוהבים את מה שהם עושים וזה משרה אווירה טובה באופן כללי.", "timestamp": 1646774835683}, {"author": "Bob Bobinson", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: הרצאות מאוד טובות. דניאל מאוד נחמד, מתעכב על מה שצריך ועוזר להבין את החומר. מומלץ ביותר.\n\nשם המתרגל/ת: אלון סטרוגצקי, מוקלטות של גידי\nחוות דעת - תרגולים: אלון מתרגל בסדר. קצת יותר יבש מגידי, אבל עדיין נחמד. גידי מתרגל מדהים. מעניין, טוב לב, תמיד עונה על שאלות ועוזר לכולם. אחד המתרגלים הטובים והנחמדים בטכניון. החיסרון היחיד הוא שהקבוצות אצלו ממש גדולות, מה שיכול לעכב קצת את השיעור.\n\nשעורי הבית: גיליונות עם קצב פרסום מאוד לא סדיר, בין שבוע לשבועיים. ימי ההגשה היו מאוד מבולגנים כל הסמסטר, עם הרבה דחיות ותאריכים מוזרים (לפעמים להגשה ל-00:00 ולפעמים ל-23:59 - מאוד מבלבל). יחד עם זה שהם ארוכים יחסית ותקפים, זה יכול מאוד להעמיס בבת אחת.\n\nהמבחן: המבחן לא קל, צריך ללמוד אליו הרבה ויש הרבה שאלות טריקיות שרוב הסיכויים שלא ראיתם משהו דומה מספיק בעבר. הייתרון הוא שהבדיקה מאוד מקלה, ועל רעיון נכון (גם עם טעויות חישוב/נוסחאות) אפשר עדיין לקבל הרבה נקודות.\n\nהשורה התחתונה: קורס עמוס וקשה, אבל סגל מאוד נחמד וחומר שכמובן חשוב לכל שאר הפיזיקה.", "timestamp": 1647264987029}, {"author": "Yaniv Slor Futterman", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  דניאל פודולסקי\nחוות דעת - הרצאות:  הרצאות מצוינות. הוא מרצה מעולה עם מחברות מורה פשוט מעולות. הוא מלמד ממש בצמוד למחברת והכל ברור.\n\nשם המתרגל/ת: גידי (גדעון)\nחוות דעת - תרגולים: פשוט מלך. אין על גידי בעולם. ממש מרגישים שאכפת לו מהתלמידים ומאוד חשוב לו שנצליח ושהכל יהיה ברור. מאוד אוהב לענות על שאלות ולעזור ובכלל מתרגל מאוד טוב. לקראת המבחנים הוא נותן המון זמן מעצמנו מעבר למה שצריך. הוא עשה לנו מספר שיעורי בונוס בזום לקראת המבחנים, כל אחד של 4 שעות או יותר. באמת תותח אמיתי.\n\nשעורי הבית: \nקשים. יש רפרנס בדרייב של פיסיקה, אבל באמת מומלץ לנסות בלי. זה קורס קשה שבקלות מתרגלים לפתור את התרגילים עם הרפרנס ובטווח הרחוק זה ממש פוגע. \n\nהמבחן: \nקשה מאוד, אבל אפשרי. צריך לרתגל הרבה מאוד מבחנים משנים קודמות וגם לשנן פתרונות של תרגילים קשים במיוחד, נגיד של מסה משתנה, או של Ueff. \n\nהשורה התחתונה: \nקורס מאוד מעניין עם סגל פשוט נפלא (מכל הפקולוטת שלמדתי אצלן (מדמח, מתמטיקה, פיסיקה) הסגל של פיסיקה הכי טובים ונחמדים ואכפתיים) אבל תרגילים קשים עם מתמטיקה שעדיין אין לך (שאלות על מד\"רים לפני שלמדת מה זה) ומבחן קשה שצריך הרבה זמן להתכונן אליו. \nממליץ מאוד לקחת קורס ממפיס (מוכנות מתמטית לפיסיקה) של לידיה, עוזר בפיסיקה 1פ, ועוד יותר עוזר לקראת פיסיקה 2פ. ממפיס זה רק עובר בינארי, אז לא כבד לקחת אותו.", "timestamp": 1647350021704}, {"author": "טל משיח", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: משקיע בטירוף מאוד מסודר והרשימות שלו מדהימות \n\nשם המתרגל/ת: איתי דוידוביץ\nחוות דעת - תרגולים: מתרגל מדהים מסביר הכל כמו שצריך\n\nשעורי הבית: חשובים מאוד, חשוב להשתמש כמה שפחות ברפרנסים\n\nהמבחן: קשה אבל אפשרי\n\nהשורה התחתונה:", "timestamp": 1647431069268}, {"author": "Anne Onimus", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה טוב, נחמד, קשוב לסטודנטים, מעלה הקלטות ואת הרשימות המפורטות שלו שזה ממש עוזר במהלך הקורס. הצוות מעלה גם הרבה תרגילים לתרגול נוסף וחומר עזר.\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: מסביר מעולה וממש passionate לגבי החומר מה שמאוד עוזר לא ליפול לתוך מרה שחורה, מפרסם סיכום מלא ומפורט של התרגולים\n\nשעורי הבית: עמוס בטירוף אבל עוזר להבנה של החומר בסך הכל\nציון תקף ויש הגשה כל שבוע אבל הצוות קשוב ומביא הארכות כשצריך\n\nהמבחן: גועל נפש של הגועל נפש באמת כנראה שהייתי היטלר בגלגול הקודם אחרת אני לא יודעת למה הדבר הזה מגיע לי\nמועד ב ו-ג יותר קשה ממועד א לרוב, בעיקר בשאלות של היחסות. מועד א זה לרוב שאלה נחמדה עם טרנספורמציית לורנץ רגילה+מהירויות בתוך מערכות יחוס וזהו, ובמועדי ב ו-ג היחסות זה משהו פסיכי עם תנע ואנרגיה ופוטונים ועוד כל מיני זוועות אז תעשו לעצמכם טובה ותיגשו למועד א עד כמה שמתאפשר לכם.\n\nהשורה התחתונה: אחלה של סגל והחומר מאוד נגיש אבל אפילו זה לא מציל את הקורס הזה מלהיות עונש מאלוהים בהצלחה חמודים", "timestamp": 1647858119680}, {"author": "Maor Levavi", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרופ' חבר דניאל פודולסקי\nחוות דעת - הרצאות: מרצה מצוין, יודע להעביר את החומר היטב ולשמור על הכיתה מרוכזת\n\nשם המתרגל/ת: ד\"ר גדעון אלון\nחוות דעת - תרגולים: המתרגל הטוב ביותר בטכניון, אני ממליץ בחום לשנות מערכת על מנת להגיע לתרגולים שלו\n\nשעורי הבית: \nמומלצת השקעה רבה, יש גליונות שייקחו כמה שעות.\nהמבחן: קשה, מומלץ ללמוד אליו לפחות שבוע מראש כאילו שאין עוד מקצועות.\n\nהשורה התחתונה: קורס מומלץ", "timestamp": 1648718968215}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פודולסקי\nחוות דעת - הרצאות:  נחמד ממש, די מצחיק. מרצה טוב סך הכל.\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים:  מתרגל נהדר לסמסטר ראשון מרגיע מאוד ומשקיע מכל הלב בסטודנטים. תמיד דואג שכולם יבינו את החומר.\n\nשעורי הבית: די עמוסים ולא מובנים ככ. חשובים מאוד כי הקורס אוהב להשתמש בשאלות דומות משיעורי הבית למבחן.\n\nהמבחן: קשה. לקראת סוף הסמסטר החומר נהיה מאוד קשה והמבחנים מאוד הבנתיים. מאוד חשוב להראות בבחינה שמבינים את החומר ואז הבדיקה תהיה מאוד נחמדה ביחס לטעויות חישוב או טעויות טכניות ( לא הפואנטה של הקורס)\n\nהשורה התחתונה: מתחיל תמים. מרגיש קצת תיכוני. ברגע שהמרצה מתחיל לדבר על אנרגיה פוטנציאלית אפקטיבית או אוסיליטורים דחוף להיכנס לעניינים כי החומר נהיה קשה מאוד מהר ובלי ששמים לב יכולים למצוא את עצמכם לא מבינים כלום.", "timestamp": 1660568196335}, {"author": "גיא דוידוביץ'", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה מצוין. תמיד מעביר את ההרצאות בשיתוף הכיתה.\n\nשם המתרגל/ת: מיכאל בירק \nחוות דעת - תרגולים: מתרגל סביר. לעיתים לא סגור על התרגילים שהוא מעביר.\n\nשעורי הבית: קשים ולוקחים הרבה זמן\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס חובה. קורס קשה", "timestamp": 1660728095067}, {"author": "Jonathan Kisselev", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: דניאל מרצה נהדר, נותן חומר בצורה מעניינת וגם עונה על שאלות. יש הרבה ניסויים במהלך הקורס שממש מזכיר לנו שאנחנו פה ללמוד פיזיקה \n\nשם המתרגל/ת:\nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים ולפעמים יש שאלות יפות\n\nהמבחן: 4 שאלות פתוחות. אין משהו מעבר לדברים שלומדים בכיתה. חושב שיותר קל להוציא ציון טוב ביחס לקורס 1 מ׳ עם אמריקאיות \n\nהשורה התחתונה:", "timestamp": 1675487230356}, {"author": "לא תודה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nמסביר טוב, אבל מומלץ לקרוא את הרשימות שהוא מעלה לפני ההרצאה. נותן הרבה דוגמאות ועוזר להבין מתי שצריך. להיזהר מתפוזים שעפים באולם.\nשם המתרגל/ת: גידי (גדעון אלון)\nחוות דעת - תרגולים: \nמלך. מתרגל מעל לכל שבח. הכי חשוב לו בעולם שתבינו את החומר. הדבר היחיד שהוא אוהב יותר מפיזיקה הוא ללמד פיזיקה. \nמסביר מאוד לעומק, עונה על כל שאלה בכל דרך עד שמבינים. בתור מתרגל אחראי היה ניכר כמה אכפת לו וכמה הוא רוצה לעזור לסטודנטים, מקיים שלוש או ארבע שעות קבלה בשבוע (וגם אלה יותר כמו שעה וחצי).\nבכל זאת, הוא עלול להעביר תרגולים מאוד לאט בגלל העומק הזה.\nשעורי הבית: \nקשים מאוד, אבל לא ארוכים. מומלץ שלא להסתכל ברפרנסים, או לפחות לא להעתיק.\nהמבחן: \nהרבה יותר קשה משיעורי הבית. מומלץ בחום ללמוד אליו לפחות שבוע-שבוע וחצי מראש, ולא רק כשנגמר הסמסטר.\nהשורה התחתונה:", "timestamp": 1675604684555}, {"author": "אורי ורותי", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה טוב\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: מלך!\n\nשעורי הבית: היו קשים, הצלחתי כמעט הכל רק בעזרת הרפרנסים\n\nהמבחן: היה הוגן. מקווה לעבור במועד ב.\n\nהשורה התחתונה: אורי ורותי היו ממליצים על הקורס הזה, אני פחות.", "timestamp": 1675607714408}, {"author": "עוד סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: פודולסקי\nחוות דעת - הרצאות: סה\"כ מאוד מעניין, בגדול לקחו את החומר מהתיכון והעלו אותו כמה וכמה רמות למעלה. פודולסקי אחלה מרצה ועשה כמה ניסויים והדגמות מעניינות, חוץ מזה החומר עמוס וקשה לפעמים להבין מה בדיוק חשוב ומה הוא אומר רק כי צריך.\n\nשם המתרגל/ת: אורי יחזקאל\nחוות דעת - תרגולים: התרגולים מאוד קשורים למבחן, צריך להשתתף כדי להתכונן ולהגיע לכל תרגול חזרה שיש לפני המבחן. אורי אחלה מתרגל, השקיע בנו הרבה והיה מאוד נחמד. היינו מעט סטודנטים וזה הפך את התרגולים לכיפים הרבה יותר.\n\nשעורי הבית: כל שבוע גיליון עד שהצוות לא עמד בעומס של עצמו. תרגילים ברמה מאוד גבוהה, יותר מהמבחן אז צריך לא לקחת קשה. חוץ מזה יש כמה מטלות שפותרים במודל עצמו וזה ממש פשוט ובקטנה.\n\nהמבחן: נראה שספציפית השנה היה מבחן יחסית קל עם כמה טריקים שצריך לעלות עליהם כדי לפתור את התרגילים. בסה\"כ הצוות מראה הרבה רצון ונכונות שנצליח.\n\nהשורה התחתונה: קורס חובה... אז אין מה לומר... אבל סה\"כ מעניין.", "timestamp": 1676107481117}, {"author": "ללניה", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nמרצה מעולה, מעביר את ההרצאה בצורה מעניינת, עונה על שאלות (לפעמים גם מעמיק מעבר לחומר, שזה טוב, רק שזה דוחף החוצה זמן הרצאה על החומר, שזה קצת מבאס) סהכ חומר מעניין עם רשימות מסודרות (ממליץ לעבוד על גביהן ולכתוב הערות)\nשם המתרגל/ת: גידי \nחוות דעת - תרגולים: אחלה מתרגלת ללא ספק מעביר תרגול בצורה מרתקת. ממליץ בחום. יחד עם זאת הוא לא יתאים לכל אחד, עם המון אנרגיות הוא לפעמים קצת גולש או הולך לאיבוד וטיפה מתבלבל. לא מתחרט לרגע שהלכתי אליו.\n\nשעורי הבית: הוגנים, מלמדים, מכינים למבחן, יחסית\n\nהמבחן: \nלא פשוט, הוגן בשורה התחתונה\nהשורה התחתונה: אחלה קורס אחלה מרצים אחלה פקולטה 5 דרקונים", "timestamp": 1676881705925}, {"author": "Yair Berman", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nדניאל הוא באמת נשמה טהורה, אבל לא מצליח לשלוט בכיתה כשמלא שואלים שאלות פשוט לא רלוונטיות, ומרגיש שהעיקר של החומר לא עובר. ההרצאות כיפיות אבל חובה להשלים אחר כך מסיכומים. יש הקלטות שהן די זהות.\n\nשם המתרגל/ת: גדעון אלון (גידי)\nחוות דעת - תרגולים: \nגידי באמת מקסיםםם, אבל הרבה פעמים סוטה מהחומר ולא מספיק את התרגול. תרגולים שתענוג להיות בהם, אבל להבנת החומר הייתי שוקל להחליף.\nראוי לציין שהוא נתן לנו *המון* שעות קבלה והיה אפשר ללכת לשפר את ההבנה\n\nשעורי הבית: \nהם מתחילים קל, אבל נהיים מזוויעים יותר לאורך הסמסטר. בהתחלה לוקחים שעתיים בפנאן, ואז בסוף פשוט לא הצלחתי אותם ורפרנסתי (יש רפרנסים רשמיים ומצויינים). ממליץ כן להתאמץ ולפתור למי שיש את הזמן.\n\nהמבחן: \nאין מה לומר, המבחן לא פשוט. לדעתי הוא בערך ברמה של שיעורי הבית. לכו לשעות קבלה לפני המבחן ואפשר להצליח.\n\nהשורה התחתונה: \nזו ההתחלה של פיסיקה, יש סגל מאוד אוהב ותומך ומקצוע קשה.", "timestamp": 1676883778900}, {"author": "אורי או רותי-תבחרו", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות:  מרצה מדהים!!!!! כל הסופרלטיבים שאפשר לכתוב... אז דניאל.  אכפת לו ממש. \n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים:  לא לבעלי לב חלש. לא כי הוא לא טוב, הוא הכי טוב, מסביר מעולה, יש לי רשימות מדהימות ונותן המון אינטואציות, אבל- אם אפשר היה לתעל את האנרגיה שלו בנצילות גבוהה, אז בעיות האנרגיה בעולם היו נפתרות.  לפעמים הוא מתפזר אבל זה מתגמד ביחס לכמה שהוא מובן ודואג שוב ושוב שנשאל כדי שנבין.\n\nשעורי הבית:  זוועה\n\nהמבחן:  לא קל... מציע לתרגל אחרי כל נושא הרבה שאלות ברמת הקורס מעבר לגליונות... כי הם זוועה, קשים מאוד. פיסיקה 1פ זה בסוף כמה שיותר לתרגל ולא הפיתוח עצמו בהכרח, ואין מספיק תרגול\n\nהשורה התחתונה:  קורס חובה...", "timestamp": 1677092774481}, {"author": "none", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: daniel\nחוות דעת - הרצאות: \n\nשם המתרגל: gidi\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677509497615}, {"author": "Jonathan Kisselev", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי \nחוות דעת - הרצאות: \nהמרצה מאולה, ודע חומר טוב, יודע איך להסביר וצמיד פתוח לשאולות \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים וממש חינוכים \n\nהמבחן: המבחן מכיל 4 שאלות פתוחות, אין הרבה חישובים ושאלות עצמן מעניינות אבל צריך להבין טוב את החומר\n\nהשורה התחתונה:", "timestamp": 1677949121847}, {"author": "א.ב.", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nדניאל ממש חמוד. ממש משתדל שיהיה מובן ומעניין. לפעמים הוא לא מסביר הכי ברור, אבל מרגישים שחשוב לו שיהיה כמה שיותר טוב.\nהחומר לא פשוט - גם הפיתוחים המתמטיים לפעמים ארוכים, קשים ומגעילים, והרבה פעמים גם קשה להבין את הרעיונות הפיזיקליים שמאחורי הדברים.\n\nשם המתרגל/ת: עמית גופט.\nחוות דעת - תרגולים:\nממליץ בחום! עמית מסביר בצורה ברורה וחדה, ונותן דגשים חשובים איך להסתכל נכון על תרגילים.\n\nשעורי הבית: \nלא פשוטים - אי אפשר לצפות לסיים גיליון בערב אחד. תמיד זה דורש עוד מחשבה והבנה.\n\nהמבחן: \nקשה. אני לא חושב שמנסים בכוונה להקשות, אבל באמת קשה מאוד להפנים את החומר ברמה שמספיקה כדי לפתור את התרגילים.\n\nהשורה התחתונה:\nעמוס, ודורש הרבה השקעה (למרות שבמבט ראשון אפשר לחשוב שזה לא כ\"כ קשה). אבל מאוד מעניין.", "timestamp": 1678055024249}, {"author": "תלמיד אלמוני", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: דניאל מעביר את החומר בצורה טובה, וגם הוא מפרסם את הרשימות שלו במודל. בנוסף הוא בנאדם ממש נחמד, לפעמים הוא אפילו נשאר אחרי הרצאה להסביר לסטודנטים דברים שלא הבינו, ופעם אחת הוא ממש הלך למשרד שלו ועשה סוג של שעת קבלה ספונטנית.\n\nבנוסף היו את הסדנאות של דב לוין, שהתקיימו במשך שעתיים פעם בשבוע, בהן הוא הסביר כל מיני שיטות מתמטיות שרלוונטיות לנושאים שהקורס מכסה. להבנתי, המטרה שלהן היא לעזור לגשר על הפער הדי גדול בין מתמטיקה של תיכון למתמטיקה של הקורס שנלמדת באמת לעומק בסוף אינפי 1 או באינפי 2/3. לדעתי באמת יש ערך מוסף בסדנאות, אבל בלא מעט מהזמן שלהן דב סוטה לדבר על החתולה שלו (או מספר בדיחות בלי פילטר שזה משעשע האמת), וזה לא ממש חובה, אז אם בהמשך הסמסטר אתם מרגישים שהסדנא מעיקה על הלו\"ז שלכם, לדעתי זה בסדר לוותר - במיוחד אם אתם לוקחים גם את ממפיס (104000).\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: \nחשוב להדגיש - פיזיקה 1פ הוא קורס מאוד מאוד קשה.\nלמרות כל העומס של הסמסטר הראשון, לדעתי שעתיים תרגול בשבוע לא מספיקות. בחוויה שלי, האתגר העיקרי בקורס הוא ההתמודדות עם תרגילים - ההרצאות מסבירות את העקרונות ואת הנוסחאות, אבל לא מתי הן רלוונטיות. בשבילי הרבה פעמים רק הניסיון להבין מה מתרחש ואיזה חישובים רלוונטיים היה החלק הכי קשה בתרגילים.\n\nמה שאני מנסה להגיד - בשום פנים ואופן לא לוותר על תרגולים.\n\nעמית מתרגל סבבה. הוא מסביר טוב פתרון של תרגילים, וגם יודע לספק תשובות קצרות אבל טובות לשאלות. התרגילים לתרגולים מפורסמים כמה ימים מראש, למי שיש טאבלט אני ממליץ להוריד לפני שמגיעים, זה עוזר לעקוב.\n\nשעורי הבית: מאוד, מאוד קשים, אבל כפי שהסברתי מקודם, חשוב מאוד לדעת להתמודד עם תרגילים, אז רצוי להשקיע בפתרון שלהם ולא למהר לרפרנסים.\n\nחשוב גם להדגיש שלדעתי עצם זה שיודעים באיזה נושא כל גיליון עוסק מוריד מרמת הקושי של התרגילים, אז לתרגול יותר אפקטיבי כדאי לתרגל על \"עיוור\".\n\nהמבחן: עשיתי רק את מועד א. הוא היה מאתגר אבל הוגן, לדעתי היה פחות קשה ממבחני עבר של פודולסקי. כשמתרגלים מבחני עבר חשוב לשים לב של איזה מרצה הם, כי יש נושאים שפודולסקי לא כיסה אבל מרצים אחרים כן. שוב, פיזיקה 1פ קורס מאוד קשה, חשוב לתרגל כמה שיותר לקראת המבחן.\n\nהשורה התחתונה: אמנם כבר כתבתי את זה כמה פעמים, אבל חשוב להדגיש - פיזיקה 1פ קורס קשה במיוחד. אמנם יחסית לקורס בנושא \"גדול\" עשויים לחשוב בהתחלה שהוא קליל (5 נקז במקום 5.5), אבל בחוויה שלי כדי באמת להצליח בו סביר שתידרש מכם השקעה של יותר מ-5.5 נקז. כדאי לשקול את זה מבחינת הלוז שלכם, כי קריטי לתרגל הרבה.\n\nאם לא למדתם מעבר למתמטיקה של תיכון ואתם נבהלים מנוטציות מפוארת - אני מאוד ממליץ לבדוק את מוכנות מתמטית לפיזיקה (104000)\n\nגם חשוב לציין שהקורס חד-שנתי, כלומר אם תצטרכו לחזור עליו תאלצו לחכות שנה.\n\nהחדשות הטובות הן שסגל הקורס איכותי ובא לקראת הסטונדטים, ובסוף למרות הקושי נהניתי ואני מצפה להמשיך ללמוד פיזיקה - זה נושא מגניב!", "timestamp": 1678802418666}, {"author": "אינווריאנט אינווריאנטי", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: אחלה מרצה. מומלץ להוריד את הקבצים של הרשימות שלו ולהוסיף הערות במהלך ההרצאה.\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: מתרגל מצוין. טיפה מבולגן, אבל מסביר מאוד ברור.\n\nשעורי הבית: ארוכים ולא פשוטים. תעשו מאמץ לפתור את התרגילים לבד בלי רפרנסים, הם עוזרים מאוד בהטמעת החומר.\n\nהמבחן: קשה מאוד, אבל סך הכל הוגן. הבדיקה סלחנית מאוד.\n\nהשורה התחתונה: קורס קשה ומעניין מאוד.", "timestamp": 1678871551588}, {"author": "Tom Nir", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: דניאל נחשב מרצה מעולה, הוא אדם מבין האנשים הנחמדים ביותר שפגשתי ובעל קרדיט מקצועי חריג. אני באופן אישי מאוד לא הסתדרתי עם סגנון ההוראה שלו והתקשתי מאוד לעקוב אחריו במהלך ההרצאות ואני יודע שיש לפחות מעטים שהרגישו כמוני.\nבנוסף, לרוב הוא לא מלמד מהכלל אל הפרט אלא מהפרט אל הכלל, דבר שגרם לי לפערים חמורים בהבנה.\n\nממליץ בחום להשאיל את ספר הלימוד של ברקלי מהספרייה, לנסות את ההרצאות, ובמידה שלא מסתדרים אז לא להגיע וללמוד רק מהספר (ממליץ להיעזר בו באופן כללי, הוא מצויין וקיימים גם תרגומים לעברית של הפתוחה)\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: מתרגל מעולה, קצב גבוהה במטרה להספיק את הספקטרום הרחב ביותר של השאלות והנושאים אך יודע גם לא לחפף עם העומק התיאורטי.\n\nהיו שני מקרים שבהם הוא אמר אמירות לא מדויקות שנאלצתי לבדוק עם אנשי הסגל אחרים האם הן נכונות אך אין בזה להעיב על הכלל (אני ממשיך איתו בפיסיקה 2פ')\n\nשעורי הבית: לא פשוטים אבל מאוד תורמים להבנת החומר, ממליץ לפתור לבד וללכת לשעות קבלה אם לא מסתדרים (רפרנסים כמוצא אחרון בלבד).\n\nהמבחן: עשיתי את שני המועדים, שניהם היו הוגנים מאוד, במועד ב' היו קשיי ניסוח שהקשו מאוד על חלק לא מבוטל מהמבחנים אך נכון לזמן כתיבת שורות אלה לא נתקבלה תגובה על הערעור.\n\nהשורה התחתונה: קורס מרתק ועמוק  וכתוצאה מכך גם קשה מאוד, חובה להתעקש להיות \"עליו\" במשך כל הסמסטר ולא לחכות לתקופת מבחנים.", "timestamp": 1679088348959}, {"author": "בועז מונטיליה", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: סבבה, נחמד מדי ומתעקב המון על שאלות סטודנטים, שזה קצת חבל, תמיד מוכן לענות על שאלות בסוף הרצאה\n\nשם המתרגל/ת:  עמית גופט\nחוות דעת - תרגולים: מצוין! מסביר כמו שצריך, דואג להתקדם, ומסכים לענות ולהסביר יותר לעומק כשצריך.\n\nשעורי הבית: מדהימים! החומר לא קשה מדי אבל השאלות מרתקות ודורשות יצירתיות ואינטואיציה והבנה איך ליישם את החומר כמו שצריך, ממש גרמו לי לרצות את התואר.\n\nהמבחן: יצא לנו מועד א' ממש קל, בלי כל השאלות הקשות.\n\nהשורה התחתונה: מדהים! ממליץ בחום", "timestamp": 1679166778498}, {"author": "שמשון", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: פודולסקי\nחוות דעת - הרצאות: \nלפודולסקי יש המון (המון) כוונות טובות. מרצה טוב הוא לא, אבל יש גרועים ממנו והרשימות שלו מאוד מאוד מסודרות.\nבגלל פער השפה והדיקציה יש דברים שנשארים לא ברורים.\nשם המתרגל/ת: גדעון העפיפון \n\nחוות דעת - תרגולים: \nגידי הוא כל מה שאתה רוצה מאנשי הוראה באקדמיה - משקיען, מרצה מצוין ומאוהב בחומר שהוא מלמד. מצד שני, נוטה לאבד אחיזה בנושא השיעור או להתפזר משאלות של אנשים מה שגורם לזה שמאבדים אותו. לנו זה גרם לאי הבנה של תרגיל שהופיע באופן דומה במבחן, ושליש מהקורס איבד 8 נקודות בו.\nשעורי הבית: \nעולים ברמת הקושי מהר מאוד, אבל יש רפרנסים מושקעים ומפורטים להכל. שווה להתאמץ לעשות אותם באמת, כי החל מאמצע הקורס הם לגמרי ברמת (וסגנון) המבחן\nהמבחן: \nקשה מאוד. אין דרך לייפות את זה. מצד שני, הבדיקה מאוד הוגנת והשאלות חוזרות על מספר מצומצם של קונספטים קבועים שחשובים לפודולסקי. דורש הרבה הכנה, ובאופן חריג יש יותר חשיבות להבנה מעמיקה של מעט שאלות נכונות מלפתור הרבה.\nהשורה התחתונה: \nקורס קשוח, אבל מעניין. סגל הכי משקיען שיש, אבל מפוזר (מאוד) ולפעמים לא מדויק מספיק", "timestamp": 1679301817582}, {"author": "Ido", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: מרצה מעולה, מאוד ברור ומוכן לענות על כל שאלה.\n\nשם המתרגל/ת: שמעון סוחולוצסקי\nחוות דעת - תרגולים: המתרגל הכי טוב שיש בערך. מאוד ברור, מסביר מצוין ועובר על התרגילים בקצב טוב ככה שיש זמן לעוד תרגילים. אין על שמעון הundisputed goat של המתרגלים.\n\nשעורי הבית: \nדי סבבה, לא ממש ברמה של המבחן.\nהמבחן: קשה יותר מהשיעורי בית אבל בסה״כ סבבה והוגן\n\nהשורה התחתונה: קורס טוב עם צוות של אנשים טובים ונחמדים שרוצים לעזור.", "timestamp": 1679399226414}, {"author": "דניאל", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: נועם מרצה מיוחד. יותר משהוא מלמד את החומר של הקורס ב1פ חשוב לו ללמד את \"התרבות של פיזיקה\". בכל הרצאה יש העשרה מעוד נושאים בפיזיקה מעבר לחומר. נועם גם סטנדאפיסט מהמוצלחים בטכניון, כל הרצאה מהנה. לפעמים יוצא שהוא רץ נורא מהר על דברים מבלבלים אבל זה פתיר. מאוד שמח לענות על שאלות ויש בערך אינסוף שעות קבלה.\n\nשם המתרגל/ת: גדעון אלון\nחוות דעת - תרגולים: אין על גידי. מת עליו. גידי גם מסביר את החומר יותר טוב מכל אחד אחר וגם מוכן להשקיע מעל ומעבר בשביל לעזור לכל מי שצריך. אין בכלל התלבטות שאם יש את האופציה, ללכת אליו.\n\nשעורי הבית: סבירים. יש לכמעט הכל רפרנסים אבל בכל מקרה הם לא קשים במיוחד. \n\nהמבחן: נועם כותב מבחנים לא פשוטים. המבחן מאוד שונה משיעורי הבית, כולל שאלות שמשלבות כמעט את כל הנושאים שנלמדו, אבל פתיר. השאלות אצל נועם הן שאלות הבנה, ובודקות שממש הבנתם את התכלס של הרעיון, בחלק בכלל לא צריך אפילו לחשב או לרשום בכלל נוסחאות, רק להסביר.\n\nהשורה התחתונה: אני לא מכיר אנשים שמתחילים תואר בפיזיקה בשביל ללמוד איך דברים מתנגשים ומסתובבים, אבל זה בסיס חובה וסך הכל מועבר טוב עם סגל שנותן הכל בשביל לעזור.", "timestamp": 1712943781826}, {"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: מאוד מעניין, צריך הרבה לעכל את החומר ולסכם ולעבור עליו שוב בבית על מנת להבין, נועם מרצה טוב מייצר הרבה עניין בהרצאות, לפעמים נוטה לברוח מהנושא אבל זה רק מוסיף לעניין ומרחיב אופקים\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: לדעתי התרגולים לא מספיקים בשביל להצליח בקורס, צריך או למצוא איך לתרגל יותר ולהספיק יותר תרגילים בתרגול עצמו (שבדרך כלל בקושי מסיימים עם גידי את התרגול המתוכנן) או פשוט לתרגל בבית יותר לבד\n\nשעורי הבית: רמה גבוה, חלק דורש הבנה מאוד עמוקה של החומר מה שלפעמים מרגיש שלא נותנים את הכלים לפתור ודיי צריך להתמודד לבד או לברוח לרפרנסים\n\nהמבחן: קשה, דורש הרבה הכנה.\n\nהשורה התחתונה: קורס מעניין אך מאוד קשה", "timestamp": 1713281885694}, {"author": ":)", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: מעביר את החומר בצורה חוויתית- מבצע הדגמות בכל נושא ומספר בדיחות תוך כדי. יחד עם זאת, קל לאבד אותו במהלך ההרצאה ולכן מומלץ להיעזר בהקלטות.\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: מעביר את החומר בצורה ברורה, חשוב לו להסביר את החומר לכן האווירה בתרגולים פתוחה ומשוחררת. \n\nשעורי הבית: נוגעים בנקודות חשובות. יש להם פתרונות מלאים לכן מומלץ להיעזר אך לוודא שמבינים את העיקרון. \n\nהמבחן: המבחן היה פייר, כמו כן נועם נתן רמזים מטרימים לגבי אופי השאלות, בעיקר שאלות הבנה.\n\nהשורה התחתונה: להרגיש בנוח לפנות לצוות הקורס על כל שאלה ולהגיע לשעות קבלה אם צריך- הצוות מאוד נחמד ומקצועי.", "timestamp": 1713338756455}, {"author": "שוסי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סוקר \nחוות דעת - הרצאות: \nאני אתחיל מהשורה התחתונה: לדעתי סוקר לא מרצה טוב - הוא אוהב לעשות פיתוחים ארוכים בלי באמת להסביר מה הוא עושה. כל שיעור הוא חופר על נושאים לא קשורים כמו ביולוגיה. אחרי שהוא קולט שהוא לא מספיק הוא מעביר את החומר ממש מהר ולא עונה על שאלות. \nגם כשהוא לא ממהר הוא לא ממש עונה על שאלות ולפעמים בכלל מתעלם כשפונים אליו.\nלמרות זאת, הוא ממש מצחיק וההדגמות שהוא מראה עוזרות להפנים את החומר. יש לו גם הרבה הרבה שעות קבלה וכל שאלה תקבל תשובה. \nלסיכום, יש לו הרבה אהבה ותשוקה לפיסיקה והוא רוצה שכולם יבינו אבל לצערי הוא לא מרצה טוב במיוחד. \n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: \nמסביר ממש טוב אבל נתקע יותר מדי על שאלות של סטודנטים ויוצא שהוא לא מספיק לסיים אף תרגול בזמן. לצערי מהתנסות שלי עם מתרגלים אחרים הם גם כאלה.\nאני העדפתי את איתי כמתרגל כי הוא פחות אנרגטי מגידי (גידי ממש אנרגטי וצועק כל תרגול ככה שלא מתאים לכולם).\n\nשעורי הבית: \nמתחילים ממש סבבה ואז יש עלייה חדה בקושי ולבסוף נהיים סבבה. מומלץ להתחיל לפתור ביום שיוצאים כי יש גיליון כל שבוע.\nממליץ לנסות לפתור לבד עד כמה שאפשר ואם באמת לא מצליחים אז להיעזר ברפרנסים.\n\nהמבחן: \nסוקר ממחזר מבחנים כמו שהוא ממחזר בדיחות. אני ממליץ לעבור על מבחנים אמריקאיים של סוקר מ1פ וגם מ1מ. לדעתי לעשות מבחנים של פודולסקי ושל בכר זה בזבוז זמן וכדאי לעשות אותם אם באמת אין משהו אחר לעשות. במבחן שלנו כמעט כל השאלות הופיעו בצורה כזו או אחרת במבחן עבר של סוקר. \nאבל הסמסטר דחפו הרבה סעיפים לכל שאלה ככה שהיה קצת לחוץ. ממליץ לנסות לתרגל על זמן כבר מההתחלה ככה שתדעו כמה זמן להקציב לכל שאלה.\n\nהשורה התחתונה: \nלמרות כל מה שאמרתי אני נהניתי. לדעתי החומר ממש מעניין ואני כבר מחכה ל2פ.", "timestamp": 1713366629616}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: מהיר ולא ברור, מאוד מצחיק אבל אי אפשר לעקוב אחריו. לפעמים לא עונה על שאלות.\n\nשם המתרגל/ת: גידי (אלון גדעון)\nחוות דעת - תרגולים: פשוט אדם מדהים שאכפת לו מהסטודנטים, מספיק הכל בקצב טוב, עונה על כל שאלה, נשאר תמיד לשאלות.\n\nשעורי הבית: \nקצת קשים אבל הביאו לכל מי שהגיש משהו 100\nהמבחן: \nקשה בצורה לא רגילה, מתחכם וטריקי.\nהשורה התחתונה: \nלא התחברתי לקורס", "timestamp": 1713437965274}, {"author": "איתמר", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: די זוועה. בהתחלה פחות שמים לב כי הוא זורק בדיחות ויש לו יכולת לתפוס את תשומת הלב של הכיתה, אבל עם הזמן קולטים שנועם לא באמת עונה על שאלות, שהוא רץ במהירות מטורפת על הנושאים ככה שלא באמת מצליחים לקלוט כלום בהרצאה ושהוא מתעכב על נושאים שלא קשורים בכלל לקורס בגלל שהם מעניינים אותו באופן אישי. אישית הייתי צריך ללמוד רוב החומר של הקורס באופן עצמאי.\n\nשם המתרגל/ת: שי נדל\nחוות דעת - תרגולים: מסביר את החומר טוב ואכפת לו שמבינים. אין לו יותר מדי נוכחות אז לפעמם קצת מאבדים פוקוס אבל באופן כללי מתרגל טוב.\n\nשעורי הבית: אותם שיעורי בית מאז 2016, כל הרפרנסים זמינים בדרייב. לבודקים לא היה יכול להיות אכפת פחות מהעבודה שלהם: אנשים הגישו להם גיליונות עם טעויות, גיליונות ריקים ופעם אחת גיליון של קורס אחר לגמרי בטעות ולא משנה מה, תמיד מקבלים 100. נחמד לציון, פחות נחמד מבחינת קבלת משוב על רמת הידע שלכם בקורס.\n\nהמבחן: טריקי, מעצבן ובאופן כללי די זבל.\n\nהשורה התחתונה: אם קיבלתם את סוקר אתם תצטרכו ללמוד עצמאית, ואין קשר בין הגיליונות לבין המבחן. חבל כי הקורס באמת מעניין כשמלמדים אותו כמו שצריך.", "timestamp": 1713693246521}, {"author": "Ar No", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: \nמרצה מעולה - אם יש לכם את האופציה ללמוד איתו ממליץ בחום להירשם - ההרצאות איתו הן רמה אחרת. החומר כמעט תמיד מוסבר באופן ברור ובאווירה טובה\nשם המתרגל/ת: שי / איתי\nחוות דעת - תרגולים: \nאישית תמיד הייתי מתעפץ בתרגולי פיזיקה, היה קשה מאוד להשאיר את הראש למעלה במהלכם. השיעורים עם איתי היו בסדר, השיעורים עם שי היו יותר מוצלחים, סהכ שניהם הסבירו את הדברים די טוב - הקול של איתי היה מרדים בבוקר, הקול של שי לא היה מרדים אבל התאורה באולם הגדול לא עושה טוב בשעות מאוחרות.\nשעורי הבית: \nתתמקחו עם המתרגל האחראי, בכנות זה היה המקצוע הכי עמוס בסמסטר מבחינתי, הגיליונות היו צפופים יחסית, ורק פעם אחת הצלחנו לשכנע אותם לרווח קצת בין שני גיליונות. עדיף לעשות את השאלות עצמן מאשר לרוץ לרפרנסים\nהמבחן: \nהמבחן היה מאתגר - הגישה של המרצה תכתיב את סוג הבחינה, תכתבו כמה שיותר היבטים מהחומר על הדף נוסחאות שאתם יכולים להביא ותקוו שציטטתם את המשפטים הנכונים\nהשורה התחתונה: אין ברירה אלא לקחת, כנראה שגם לא תהיה לכם בחירה במרצה - אם עוד תזכו ללמוד עם נועם אשריכם, אם לא, תנסו בכל זאת להתעניין בחומר, זה בסיס אבל גם הוא מעניין", "timestamp": 1714083633965}, {"author": "-", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: זוועה.\nאמלק: תחסכו לעצמכם זמן יקר ותלמדו מהקלטות של פודולסקי/חנה, לדעתי אין מה לטרוח להגיע.\nנועם כריזמטי בטירוף וסופר מעניין ומצחיק, שזה מעולה להרצאות העשרה כשלא צריך להבין לגמרי את מה שמעבירים. את החומר הרלוונטי הוא פשוט לא מלמד כמו שצריך, הוא יכול חצי שיעור להיתקע על בדיחות ולהתעכב על דברים לא חשובים שמעניינים אותו, ובזמן שנותר הוא מפתח נוסחאות ועושה מעברים הזויים בלי להסביר בכלל. אתה יכול למצוא את עצמך במשך חצי הרצאה בוהה בפיתוחים שאין לך שום סיכוי להבין, ואני אומרת את זה בתור אחת שעשתה כבר חדוא ואלגברה ויודעת קצת מתמטיקה. ברגע שהתחלתי לראות הקלטות של חנה ופודולסקי הבנתי כמה מה שנועם עושה זה לא ללמד את החומר. הכוונות שלו באמת טובות, חשוב לו מאוד להיות מעניין ויש לו הדגמות נהדרות שעוזרות לפתח אינטואיציה לחומר, אבל אני חושבת שהוא לא כל כך זוכר מה זה להיות סטודנט שנה א שצריך להסביר לו דברים שנראים לו אולי קצת דביליים, ושיש סיבה לזה שהקציבו 4 שעות הרצאה בשבוע ואין זמן לבזבז כדי ללמד את החומר כמו שצריך.\n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: מדהים! וואו! הציל לי את הקורס!!! איתי במשך שעתיים תרגול גרם לי להבין כל מה שלא הבנתי ב4 שעות הרצאה אצל נועם. הוא כל כך אכפתי ועונה על שאלות ומסביר בצורה סופר פשוטה, לדעתי החומר של 1פ באמת לא כזה קשה כשמסבירים אותו בצורה פשוטה כמו שאיתי מסביר. יש שיגידו שהוא מונוטוני ומשעמם, אבל למי אכפת אם הוא מסביר בצורה כל כך מושלמת???\n\nשעורי הבית: קשים אבל עם רפרנסים כמו שכתבו פה לפניי, אין לי יותר מדי מה לחדש. דעה לא כל כך פופולרית: לא כל כך נורא לרפרנס כשצריך, ברור שעדיף שלא אבל השאלות האלה מזכירות בעיקר את המבחנים של פודולסקי, שהוא הבן אדם ההפוך מנועם סוקר. אין שום קשר בין המבחנים של נועם לשאלות משיעורי הבית. בכל מקרה כולם מקבלים 100 בין אם הגשת גיליון מושלם ובין אם הגשת קובץ ריק. \n\nהמבחן: דעה לא כל כך פופולרית אבל לא כל כך קשה, לדעתי המבחנים של פודולסקי נגיד יותר קשים. כדאי לתרגל רק מבחנים של נועם כי הם מאוד שונים מהשאר וקל לראות מה נועם אוהב במיוחד. כשמבינים קצת את הראש של נועם זה סבבה ואין יותר מדי הפתעות. גם מאוד מקלים בבדיקה כי אף אחד לא באמת יודע את החומר וצריך לשמור על ממוצע נורמלי. אבל אתם, אם תקשיבו לביקורת שלי, תלמדו ממרצים אחרים ולכן תבינו את החומר.\n\nהשורה התחתונה: תמצאו את המרצה שאתם מבינים אותו הכי טוב ותלמדו ממנו, קורס באמת סבבה כשלומדים מהאנשים הנכונים.", "timestamp": 1714461474531}, {"author": "לילך", "difficultyRank": 4, "generalRank": 4, "semester": "202302", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: \nפשוט לא, לא הבנתי כלום בהרצאות. נועם עצמו מאוד כריזמטי ומצחיק אין ספק אבל הוא לא לימד את החומר. את כל הקורס למדתי מחנה והיה מדהים, הצלחתי להבין כמעט הכל ואפילו קצת להנות. \n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: \nמעולה, התרגולים הצילו את ההבנה שלי, איתי היה ממש סבלני והיה מוכן להסביר הכל. עבד לאט ומסודר והסביר כל פיפס שעשה. ממליצה בחום. \n\nשעורי הבית: להכל יש רפרנסים, חלק מהשאלות פסיכיות ולא סבירות לסמסטר א, חלק קלות מאוד ברמת תיכון. \n\nהמבחן: היה די קשה, אבל היה לדעתי פייר. המבחן של נועם שונה מאוד ממבחנים של מרצים אחרים אז מאוד רצוי לתרגל מבחני עבר של המרצה שלכם. המבחנים של נועם היו קלים יותר לדעתי בהשוואה לאלו של מרצים אחרים. \n\nהשורה התחתונה: \nאיכסה קורס, איכסה חומר, מרצה סביר מינוס, וחנה מלאך מושלם שגואל את כולנו מהייסורים.", "timestamp": 1714996405202}, {"author": "Evyatar Reif", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: \nמרצה נוראי. אני חושב שזה חוצפה להיות מרצה כל כך גרוע. \nנועם מרבה בעיקר לספר בדיחות במקום ללמד, והשיעורים שלו נורא מבולגנים ולא ברור מתי הוא מלמד חומר, מתי הוא סתם זורק לנו העשרה (למשל הוא בזבז שעה של שיעור בלהסביר ביקוע גרעיני בשביל לעשות דוגמה של שימור תנע...)\nממליץ לראות הקלטות של חנה במקום, או במקרה הכי גרוע הקלטות של נועם מתקופת הקורונה שם בגלל שלא היה תלמידים הוא באמת לימד.\n\nשם המתרגל/ת:  איתי\nחוות דעת - תרגולים: \n10/10 איתי מתרגל מטורף. הוא הסיבה היחידה שידעתי משהו בקורס הזה, הוא לימד בשעתיים תרגול כל מה שנועם לא לימד.\n\nשעורי הבית: \nממוחזרים עם אותן טעויות כתיב מאז 2016.\nהמבחן: \nממש לא הוגן. הייתה שאלה שבחנה אותנו בעיקר על איך אופניים עובדות... מבחן שמתבסס בעיקר על טריקים שנועם אוהב.\n\nהשורה התחתונה: \nאם יש ברירה אז אל תלמדו עם נועם. אם אין אז תראו חנה במקום", "timestamp": 1715715213318}, {"author": "No", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: נועם סוקר \nחוות דעת - הרצאות: \nפשוט לא, אם המרצה שלכם זה נועם אל תבזבזו זמן ותלמדו מהקלטות של חנה\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: איתי מתרגל כל כך טוב עזר לי בהבנה של החומר \n\nשעורי הבית: ארוכים יותר מדי ולא דומים למבחן אבל יש רפרנסים\n\nהמבחן: \nכל כך קשה ולא הוגן, הפיעו דברים שלא ראינו בהרצאות/תרגולים\nהשורה התחתונה: חוויה טראומטית", "timestamp": 1716219068717}, {"author": "Ido Ehrlich", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: ההרצאות היו לא מספיק מסודרות. נדרש בסיס מתמטי טוב יותר (קורס ממפי״ס מדביק את הפער, אבל לקח זמן עד שהייתה הלימה). סדרת ההרצאות מתקופת הקורונה יותר ברורה. נועם הסביר וגם בחן לפי הבנה ופחות פיתוחים מתמטיים.\n\nשם המתרגל/ת: איתי דבידוביץ\nחוות דעת - תרגולים: מעביר מסודר וברור. ממליץ ללכת לשעות קבלה\n\nשעורי הבית: יש רפרנסים כמעט לכל תרגיל. כל שבוע היו שיעורי הגשה\n\nהמבחן: סך הכל פייר, לא קל. \n\nהשורה התחתונה: קורס לא קל, עמוס יחסית ומומלץ להבין את המתמטיקה טרם ההרצאות.", "timestamp": 1716281015840}, {"author": "i", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות:  נועם מרבה לספר בדיחות אבל פחות ללמד חומר חשוב שיהיה בבחינה \n\nשם המתרגל/ת: גידי \nחוות דעת - תרגולים:  גידי הוא אדם מדהים טיפה מבולבל אבל ההסברים שלו מצויינים ומאוד פיזיקליים גם איתי ושי מתרגלים מצויינים מומלץ ללכת לכמה שעות קבלה שרק ניתן \nשעורי הבית: \nהשיעורי היו סבירים יש אינספור רפרנסים לא משהו שקרוב לבחינה \nהמבחן: \nהמבחן לא קרוב מחשבתית ומתמטית לכל דבר שנועם הראה במועד א נועם הראה פיזיקה של אופניים שדיבר עליהם חמש דקות בסדנה שאינה חובה \nהשורה התחתונה: בהצלחה אתם תצטרכו את זה ולא לעשות אם לא חייבים", "timestamp": 1716366099940}, {"author": "עדן", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: מרצה מעולה! מסביר מאוד ברור את החומר, יענה לכם על כל השאלות (בשעות קבלה) ובעיקר הוא מעביר את התחושה שהוא בא ללמד לכיף.\nנועם דורש הרבה מהסטודנטים שלו ולכן שימו לב שחשוב לעבור על השיעורים והתרגולים בזמן הפנוי כדי להבין את החומר לעומק.\n\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: אין על גידי. יענה לכם על כל שאלה גם אם תשאלו אותו עליה עשר פעמים. אדיב, נחמד ואין ספק שהוא יודע להעביר את החומר. מומלץ מאוד!\n\nשעורי הבית: לא קלים, אבל יש רפרנסים אז..\n\nהמבחן: קשה. תתאמצו להגיע מוכנים ורגועים כדי לחסוף מעצמכם את המועד ב'.\n\nהשורה התחתונה: תכל'ס, לא ציפיתי לפחות מפיסיקה 1 פ'.", "timestamp": 1716725703772}, {"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: נועם הוא דמות. הרצאה מבחינתו זה יותר כמו זמן שבו כולם מקשיבים לו. בלאגן ואי אפשר להבין כלום. מלא בדיחות, אותי זה הצחיק עד שהפסיק כי חרדות.\n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: איתי פשוט מושלם באמת, מסביר את החומר מעולה והיה לו סופר אכפת מהסטודנטים. \n\nשעורי הבית: פשוט לא קשורים ולא מסונכרנים עם ההרצאה. יש רפרנסים כמעט להכל אז לפחות זה.\n\nהמבחן: יאמר לזכות נועם שלדעתי לפחות המבחנים שלו יותר קלים ממרצים אחרים. יותר שאלות הבנה ופחות חישובים ותסבוכים. \n\nהשורה התחתונה:", "timestamp": 1716824410277}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: בן אדם הצגה, הרצאות רצופות בדיחות של פיזיקאים אבל לא מעביר טוב את החומר\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: כפרה על גידי\n\nשעורי הבית: כן\n\nהמבחן: היה פייר לדעתי, רבים חושבים אחרת\n\nהשורה התחתונה: בהצלחה", "timestamp": 1719073090344}]}