{"posts": [{"author": "רז הדרי", "semester": "201902", "text": "קורס קל מאוד ומעניין מאוד, אפשר להוציא ציון מעל 90 בקלות", "timestamp": 1595542776000}, {"author": "Omer Cicelsky", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מאוד מעניין ודי קל, המבחנין חוזרים על עצמם. שב קלים ולא ארוכים מידי. הדיל מתרגלת מעולה", "timestamp": 1597740033011}, {"author": "Nir Abramovich", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: הרצאות מעניינות. המרצה מעביר את החומר בצורה טובה. החומר לא קשה במיוחד.\n\nשם המתרגל/ת: הדיל\nחוות דעת - תרגולים: הדיל מתרגלת טובה ומשקיעה. שווה ללכת לתרגולים שלה, לא הייתי אצל מתרגלים אחרים \n\nשעורי הבית: די קלים ברובם\n\nהמבחן: הוגן. צריך לדעת את החומר טוב ואפשר להוציא ציון מאוד טוב.\n\nהשורה התחתונה: קורס קל, אפשר להוציא ציון טוב. חומר מעניין.", "timestamp": 1598269330317}, {"author": "שליחי הדודה", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: הרצאות מאוד מעניינות ולא כבדות במיוחד, ממליץ לצפות ביוטיוב\n\nשם המתרגל/ת: הדיל\nחוות דעת - תרגולים: ניכרת השקעה מצידה והיא עוזרת מאוד לאורך כל הסמסטר. מקצועית: היא מעולה, הופכת הכל לפשוט וטכני.\n\nשעורי הבית: לא חייבים להשקיע די קלים ברמה של המבחנים\n\nהמבחן: הוגן מאוד ואפילו קל עם שאלה או שתיים לא טריוויאליות. \n\nהשורה התחתונה: קורס מעניין ומעלה ממוצע:)", "timestamp": 1598906379624}, {"author": "RA", "difficultyRank": 1, "generalRank": 5, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות:מיותרות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מספיק כדי לכסות את מה שצריך לדעת למבחן\n\nשעורי הבית: קלללל\n\nהמבחן: דף נוסחאות טוב ו100 קל\n\nהשורה התחתונה: אל תשרפו זמן על להבין", "timestamp": 1609058417628}, {"author": "SR", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: הווידאו של ההרצאות ביוטיוב מעולה. אין על עכאשה.\n\nשעורי הבית: אחת לשבוע. בדר\"כ לא מסובכים מדי, רצוי לעשות כדי להיות על החומר.\n\nהמבחן: לגמרי אפשר להוציא 90+ אם פותרים מספיק מבחנים ומשתמשים בדף נוסחאות טוב. הקורס מאוד טכני.\n\nהשורה התחתונה: אחלה קורס להעלות את הממוצע.", "timestamp": 1612740015644}, {"author": "Alon", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: ראינו רק את הוידאו, אחלה וידאו. אני מחוייב לקחת את הקורס ולכן גם לא מצאתי עניין בקורס עצמו ובתכנים\n\nשעורי הבית: 12 תרגילים במודל, לכולם יש אקסלים נוחים ולחלקם גם פתרונות מלאים\n\nהמבחן: יחסית טכני, פשוט וחוזר על עצמו\n\nהשורה התחתונה: רק טיפה יותר קשה ממל\"ג, והציונים בהתאם", "timestamp": 1612813726845}, {"author": "asaf bialystok", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: סמסטר קורונה - נתנו לנו לראות את ההרצאות המוקלטות מיוטיוב. אחלה הרצאות. \n\nשם המתרגל/ת: מיטל סימן-טוב\nחוות דעת - תרגולים: תרגולים טובים, ממקדים את החומר על מה שצריך ללמוד בשביל המבחן ופותרים דוגמאות רלוונטיות לתרגילי הבית ולמבחן.\n\nשעורי הבית: \nפשוטים ומרופרנסים ברובם\n\nהמבחן: \nאמריקאי, די פשוט, יש שאלות קצת טריקיות כמו בכל מבחן אמריקאי אז צריך לפתור בזהירות. הדרך ללמוד אליו היא פשוט לעשות מלא מבחנים.\n\nהשורה התחתונה: \nאחלה קורס, די פשוט *למי שלומד לאורך הסמסטר*. לדעתי לא קורס שמומלץ ללמוד מאפס שבוע לפני המבחן. \nבנוסף גם די מעניין למי שבקטע.", "timestamp": 1613553941236}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מוחמאד עכאשה\nחוות דעת - הרצאות: לא הרצה- שלח ליוטיוב\n\nשם המתרגל/ת: אופיר ארזי\nחוות דעת - תרגולים: המתרגל מעולה, האיכות של המצלמה לפעמים פוגעת בהבנה\n\nשעורי הבית: \n\nהמבחן:  דומה לקודמים\n\nהשורה התחתונה:", "timestamp": 1614541867698}, {"author": "Mohammad A.Azab", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות:  ביו-טיוב, כרגיל הוא מצוין. החומר מאוד מעניין, ועכאשה מסביר בצורה גם מסקרנת וגם מפשטת.\n\nשם המתרגל/ת: הדיל\nחוות דעת - תרגולים: יש לה מוקלטים מסמסטר קודם. היא טובה מאוד.\n\nשעורי הבית: כמו הקורסים שלפני, יש רפרנסים, צריך 10 מצוך 12 בערך, לא מאוד מסובכים.\n\nהמבחן: לפתור הרבה מבחנים, ולשים לב טוב מאוד בבחינה, כי יש שאלות טכניות לחלוטין וכל טעות קטנה עלולה להחסיר 10 נקודות מהציון.\n\n\nהשורה התחתונה: יותר קל מפיזיקה 2, והרבה יותר יפה. מומלץ למי שמתעניין.", "timestamp": 1615553729153}, {"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "למדתי במהלך סמסטר קורונה רק מהוידיאו הישנים של ההרצאות והתרגולים.\n\nשיעורי הבית: גיליון במודל אחד לשבוע. פתירה שלהם עוזר להבנה. לרוב ממוחזרים ככה שאם נתקעים אז יש רפרנסים/עזרה באינטרנט\n\nהמבחן: טכני מאוד. פותרים מספיק מבחנים משנים קודמות וזה מבטיח ציון טוב. ממוצע גבוהה\n\nהשורה התחתונה: קורס שהחומר בו לא פשוט בכלל. לעומת זאת, הציונים גבוהים הודות למבחן מאוד תבניתי וטכני. ניתן להוציא ציון גבוהה במבחן גם אם במהלך הקורס מתקשים לעקוב אחר החומר.\nותכלס, אם עברתם את פיסיקה 1+2 (קדמים) אז כנראה שפיסיקה 3 יהיה הכי קל מביניהם.", "timestamp": 1616315540312}, {"author": "Elad Kay", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: מרצה מעולה, יודע טוב להסביר ויש גם הדגמות. לעיתים מאוד מאוד קרובות ביטל את ההרצאה והפנה אותנו למוקלטות שלו ביוטיוב. למעשה אצלנו ההרצאות היו בימי ראשון ורביעי וההרצאה של יום רביעי קרתה רק פעמיים כל הסמסטר. לא נורא.\n\nשם המתרגל/ת: הדיל חמיס וליטל שני זרביב\nחוות דעת - תרגולים: שתיהן מצוינות! באמצע הסמסטר (היה ידוע מראש) ליטל החליפה את הדיל ושתיהן באמת מצוינות.\n\nשעורי הבית: לא קשים\n\nהמבחן: לא קשה, צריך לפתור מבחני עבר\n\nהשורה התחתונה: מומלץ", "timestamp": 1628959559680}, {"author": "רז בוזגלו", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מוחמד עכאשה \nחוות דעת - הרצאות: אלוף על ! \n\nשם המתרגל/ת: דניאל לומזוב \nחוות דעת - תרגולים: מתרגל מדהים ותותח ! מסביר ברמה גבוהה ומעמיק. \n\nשעורי הבית: יש, הם מגן של 20%. מאוד מומלץ לעשות אותם, הם לא קשים בכלל. \n\nהמבחן: סופר הוגן וקליל. אפשר להוציא 100 בקלות. \n\nהשורה התחתונה: קורס מאוד מומלץ עם פוטנציאל לציון מאוד גבוה. כן להשקיע, אבל לא להתחרפן. יש 3 דפי נוסחאות שאפשר להביא ולא צריך יותר מזה.", "timestamp": 1631700163110}, {"author": "מיכאל", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: מרצה מעולה, אוהב את המקצוע ואוהב ללמד.\n\nשם המתרגל/ת: הדיל חמיס\nחוות דעת - תרגולים: לא התחברתי בכלל.\n\nשעורי הבית: גליון שבועי במודל לא קשה. לחובבי הז'אנר יש תמיד רפרנסים.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס מומלץ לשרשרת מדעית.", "timestamp": 1633250114429}, {"author": "פיסיקה", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "קורס מאוד מאוד קל, שאלות ממוחזרות והחומר אינטואיטיבי וזורם ביחס לקורסים הקודמים של פיסיקה - 100 מובטח.", "timestamp": 1634119754385}, {"author": "עומר", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עכאשה (וידאו)\nחוות דעת - הרצאות: 35 סרטונים ביוטיוב, עוזרות להבין את החומר לפני התרגול, אך לא צריך לראות את הכל - חלק ניכר מההרצאות זה הוכחות נכונות של נוסחאות שנשתמש בהן וההוכחה היא בדרך כלל ארוכה ומתמטית, אפשר לדלג רק לחלקים שמסבירים בהם את החומר.\n\nשם המתרגל/ת: ליטל (וידאו)\nחוות דעת - תרגולים: מעולים.\n\nשעורי הבית: שווה לפתור אחרי התרגול, הם ברמה די דומה לתרגילים במבחן. מדי פעם יש איזה שאלה ממש כבדה שעדיף לרפרנס וזהו.\n\nהמבחן: הוגן למדי\n\nהשורה התחתונה: אחלה קורס, בעיניי היה מעניין ולא קשה במיוחד. לקורס יש שם של ״להציב את השאלה בדף נוסחאות ולקבל 100״ בפועל זה לא כך וצריך לפחות לראות את התרגולים כדי לפתור מבחן.", "timestamp": 1644172966379}, {"author": "אויילר", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: מרצה מאוד טובף בין הטובים שהיו לי בטכניון, כמובן שהקורס קל לכן אין תלונות אבל הוא מעביר קורס שיכול היה להיות מאוד משעמם בצורה מאוד מעניינת.\n\nשם המתרגל/ת: איברהים\nחוות דעת - תרגולים: לפעמים לא מובן אבל סהכ בסדר\n\nשעורי הבית:  מאוד לא קשים\n\nהמבחן: חוזר על עצמו, פשוט , בעקרון מקצוע של 100 עם קצת השקעה\n\nהשורה התחתונה:  קורס מעניין מאוד, קליל.", "timestamp": 1645635490877}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: \nמרצה אדיר, שווה ללכת להרצאות. גם ההרצאות מהיוטיוב מעולות וברמת החומר הן לפעמים אפילו יותר מסודרות. עדיין ממליץ ללכת להרצאות שלו.\nשם המתרגל/ת: אברהים חוסיין\nחוות דעת - תרגולים: \nאחלה מתרגל, הצליח להעביר את החומר בצורה מאוד ברורה ומעניינת. מומלץ ממש\nשעורי הבית: \nעל בסיס שבועי, לרוב לא קשים במיוחד ודי עוקבים אחרי מה שהיה בתרגול\nהמבחן: \nאמריקאי, כמו פיזיקה 1 ו-2. אפשרי ממש להוציא מעל 90 אם לא עושים שטויות\nהשורה התחתונה: אחלה קורס, מעניין וקליל", "timestamp": 1647426796725}, {"author": "Rotem Ben Shlush", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: \nראיתי בוידאו את ההרצאות ביוטיוב. האמת שהרבה פעמים הלכתי קצת לאיבוד, יש הרבה חישובים מתמטיים. לפי דעתי כדאי לראות את ההרצאות, אבל לא להיבהל אם הולכים לאיבוד כי המבחן קל.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \nיש חזרה על החומר של ההרצאות, הם ענייניים ומסכמים בצורה יפה את מה שצריך לדעת. יותר חשובים לפי דעתי מההרצאות, אבל גם לא להיבהל אם הולכים לאיבוד.\n\nשעורי הבית: \nבמודל כמו בקורסים אחרים של פיסיקה. הם ברמה יותר גבוהה מהמבחן.\n\nהמבחן: \nקל, חשוב פשוט לפתור הרבה מבחני עבר ולהכין דף נוסחאות טוב. הרבה שאלות ממוחזרות ממבחני עבר (לפעמים ברמה שהם אפילו לא משנים את הנתונים) ואם יש דף נוסחאות טוב, יכולות להיות שאלות שתמצאו להן את התשובה בצורה מיידית בדף נוסחאות.\nאז ההמלצה שלי - פשוט ללמוד טוב ממבחני עבר.\n\nהשורה התחתונה:", "timestamp": 1647612886664}, {"author": "האננס", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: \nלא צפיתי בתרגולים אבל כולם מאוהבים בו ואומרים שהוא מלמד מצוין.\n\nשם המתרגל/ת: אבראהים\nחוות דעת - תרגולים: \nמלמד מעולה, מסביר את החומר בצורה פשוטה ויעילה.\nהתרגולים עצמם קצרים מידי ולא מצליחים לעבור על כל החומר.\nלהבנתי עכאשה מתרגל גם בהרצאות שלו אז שווה לראות.\n\nשעורי הבית: \nבמודל, עוברים טוב על החומר וסוגרים פינה.\n\nהמבחן: \nמי שטיפה משקיע ולומד קצת למבחן יכול בהחלט להוציא ציון גבוה.\nעכאשה בן אדם מדהים ורק רוצה שיהיה לכולם טוב, ברמה שהיה מיעוט שהתבכיינו על שאלה מאוד הוגנת וברורה והוא פשוט נתן פקטור (לא מוצדק) על השאלה.\n\nהשורה התחתונה: \nקורס קל, אפשר ללמוד אותו מאפס ב4 ימים.\nלפי מה שראיתי, במומלצת של מכונות תשפ\"ב הפך להיות קורס בחירה, ***תקחו אותו*** לא תפגשו מרצה ובן אדם מדהים כמו עכאשה. \nלא סתם הוא זוכה במרצה השנה כל שנה!", "timestamp": 1647683131129}, {"author": "sss", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: מעניין, לא קל לדעתי להבנה\n\nשם המתרגל/ת: איברהים\nחוות דעת - תרגולים: מעולה, מאוד פרקטי ומסביר את הדברים בצורה מאוד אינטואיטיבית\n\nשעורי הבית:  כדאי לרפרנס לדעתי , ולהשקיע במבחנים במקום\n\nהמבחן: לדעתי משמעותית יותר מסובך משנים קודמות, והממוצע בהתאם. יש כמה מבחנים לא קלים, לדעתי כל הביקורות של ה\" 100 קל\" זה מאנשים שעשו מועדים קלים(ויש הרבה כאלה)\n\nהשורה התחתונה: \nסהכ מקצוע טכני עם שאלות שחוזרות על עצמן, אפשר להוציא ציון מאוד טוב אם פותרים הרבה מבחנים, וגם מעניין בעיניי", "timestamp": 1660300593449}, {"author": "דה ברולי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: אחלה מרצה, רציני ואכפתי שמשקיע מאוד וחשוב לו שהסטודנטים יבינו את החומר.\n\nשם המתרגל/ת: איבראהים \nחוות דעת - תרגולים: מלך! מסביר ברור, תמיד מוכן לעזור עם גישה חיובית ללמד את החומר כמו שצריך ומוטיבציה לענות על השאלות\n\nשעורי הבית: במודל, יש רפרנס\nהמבחן: הוגן\nהשורה התחתונה: קורס מעניין וחשוב להמשך, פותח את הראש, עם סגל רציני מאוד שמשקיע הרבה", "timestamp": 1660351444187}, {"author": "אני גם גל וגם חלקיק", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: מרצה טוב וההרצאות מובנות וברורות ברובן. לקראת סוף הסמסטר אבל היה נראה שהוא די התעייף או שסתם נמאס לו מהקורס, והוא שלח אותנו לראות את ההרצאות המוקלטות ביוטיוב (הקלטות שלו מלפני מספר שנים) במקום להעביר הרצאה פרונטלית.\n\nשם המתרגל/ת: אברהים\nחוות דעת - תרגולים: מתרגל טוב וברור, אבל לפעמים הוא מדבר לאט מדי או נתקע על שאלה/סעיף מסוימים, והוא לא תמיד הספיק את כל השאות של התרגול ואמר לנו להשלים את השאלה האחרונה בבית לבד. חוץ מזה הוא היה מעולה וקשוב לסטודנטים.\n\nשעורי הבית: 13 גליונות (האחרון לא להגשה) שמתוכם לוקחים את ה-10 עם הציונים הכי גבוהים. כמו בפיזיקה 1 ו-2, השאלות הן אמריקאיות ב-moodle, ורובן מרופרנסות מסמסטרים קודמים. עדיף להיות על החומר לאורך הסמסטר אבל גם מומלץ יותר להשקיע במבחנים מאשר בשיעורי הבית שלרוב היו ברמה יותר גבוהה מאשר המבחנים.\n\nהמבחן: 13 שאלות אמריקאיות. היה הוגן, אם כי קשה יותר מאשר (כמעט) כל מבחני העבר. לרוב יש שאלות מאוד פשוטות ורק אחת יותר מאתגרת, ולנו היו 3 שאלות מאתגרות.\nהמבחן כן דורש הבנה ולא פשוט הצבה בדף נסחאות (רק 3-4 שאלות בערך כן ניתן להציב ישירות בדף הנוסחאות), אבל לא מסובך יותר מדי, והשאלות יותר פשוטות מתרגילי הבית ומהתרגולים.\nבמועד א הייתה שאלה שאם יודעים חומר אקסטרה (שלא נכלל במגרת הקורס) מגיעים לתשובה אחרת, ולכן עכאשה החשיב את השאלה כנכונה לכולם, ללא תלות במה סימנו.\n\nחשוב(!): לא לזלזל בחומר האחרון של הקורס - מצב מוצק - כמעט אין עליו שאלות במבחנים אך לנו הייתה שאלה והיא הייתה הבנתית והיה חשוב להבין את החומר כדי להצליח בה.\n\nהשורה התחתונה: קורס אכן יותר פשוט מהקדמים שלו (פיזיקה 1 ו-2), אבל לא משהו שאפשר ללמוד אליו מאפס ביומיים - דורש בערך שבוע אם לומדים מאפס.\nיש שאלות שחוזרות על עצמן וחשוב ללמוד את הטכניקות לפתרון (לא ברמת מבחנים של חובב - המבין יבין). להגיע לבחינה עם דף נוסחאות טוב זה חשוב, אבל לא העיקר.", "timestamp": 1661435674270}, {"author": "אסי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: עכאשה מדהים!\nכשהוא היה מרצה בכיתה ההרצאות היו ממש מעניינות וטובות.\nבשלב מסוים הוא אמר לנו לראות את ההרצאות מהיוטיוב ואז התחלתי להכחיש את הקורס...\n\nשם המתרגל/ת: איברהים חוסין\nחוות דעת - תרגולים: מתרגל ממש טוב, מסביר מצויין\nמספיק לראות את ההקלטות\n\nשעורי הבית: מרופרנסים, חשובים להבנת החומר\n\nהמבחן: אמריקאי, הוגן\n\nהשורה התחתונה: קורס קליל שכמעט ולא דורש השקעה במהלך הסמסטר ומספיק ללמוד אליו שבוע לפני המבחן כדי לקבל ציון טוב", "timestamp": 1662227210894}, {"author": "יאסר סבסאוי", "difficultyRank": 1, "generalRank": 5, "semester": "202003", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אבראהים חוסין\nחוות דעת - תרגולים: אין דברים כאלה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1665325453597}, {"author": "Gregory Zingerenko", "difficultyRank": 2, "generalRank": 5, "semester": "202103", "text": "שם המרצה: אורן שפיר\nחוות דעת - הרצאות: מעניין, מסודר, מובן, מקצועי\n\nשם המתרגל/ת: עמית קם\nחוות דעת - תרגולים: מסודר, מכוון למבחן\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מומלץ בחום אם מתעניינים בפיזיקה, מדע ורוצים להעשיר את הידע עם ציון טוב ו-3.5 נק\"ז", "timestamp": 1666356038582}, {"author": "מדמחיסט עייף", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: לא יכול לחוות דעה לא הייתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא יכול לחוות דעה לא הייתי\n\nשעורי הבית: \nרפרנסים ל95% מהם שאפשר לפתור בלי הבנה ( חפשו בדרייבים של הפקולטות השונות)\nהמבחן: \nאת הקורס לא למדתי במהלך הסמסטר - למדתי 6 ימים מלאים למבחן: חשוב על ההתחלה להדפיס דף נוסחאות טוב(מהדרייב, יש בהם טעויות קטנות אז תתקנו בהתאם למה שתראו בפתרונות המלאים של המבחנים). לא עברתי על החלק התיאורתי אלא ישר התחלתי מבחנים והלכתי לתרגולים כל פעם שלא הבנתי משהו(לפעמים לא עזר), בהתחלה לא מצליחים כלום אבל אחרי מבחן שניים כבר מזהים לאן ללכת בדף נוסחאות ואיזה נוסחה תעזור. כמובן שיהיו שאלות שלא אפשרי לענות בלי לדעת תיאוריה אבל בד\"כ זה 1-3 שאלות במבחן מתוך 13 ככה שאפשרי להוציא ככה ציון סבבה עם השקעה מינימלית.\nהשורה התחתונה: \nלמי שמחפש לסגור שרשרת מדעית - הקורס \"קל\" ביחס לקודמים לו ואם תשקיעו מאמין שתקבלו ממש גבוה, אם לא תשקיעו ותלמדו חכם רק למבחן אפשרי להוציא 70 או 80 עם לימוד נכון ועבודה עם דף נוסחאות שתשפרו ותתמקצעו בו.", "timestamp": 1676031325101}, {"author": "הקורס לימד אותי יותר הסתברות מהקורס בהסתברות", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: ראיתי הרצאות מוקלטות עד איזה שבוע 4, ואז כבר הפסקתי. אפשר להתמודד טוב מאוד גם בלי ההרצאות.\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: מעבירה את החומר בצורה טובה ומעניינת, רואים שהיא אוהבת את החומר.\n\nשעורי הבית: יש רפרנס להכל אם צריך, אבל שיעורי הבית גם ככה לא קשים.\n\nהמבחן: קל מאוד. תלמדו כמה ימים לפני והכל יהיה בסדר.\n\nהשורה התחתונה: קורס מעניין וקליל, מומלץ למי שאוהב פיזיקה ורוצה להעלות ממוצע", "timestamp": 1678878621178}, {"author": "ג", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: אחלה מרצה שבעולם. מסביר ברור ומעניין. יש גם הקלטות ביוטיוב אם יש צורך בהשלמות!\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: מתרגלת חביבה\n\nשעורי הבית: לא מסובכים, אבל החומר של הקורס הוא לא כל כך אינטואטיבי לצערנו\n\nהמבחן: סביר", "timestamp": 1679240394616}, {"author": "Yaakov L.", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הייתי \n\nשם המתרגל/ת: איברהים\nחוות דעת - תרגולים: ראיתי מוקלטים שלו, היה סבבה\n\nשעורי הבית: כל שבוע אבל לא קשה\n\nהמבחן: לא קשה בכלל\n\nהשורה התחתונה: מל\"ג מומלץ", "timestamp": 1679392847947}, {"author": "רגד שמאלי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: לא ראיתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא קשים במיוחד, ניתן להבין 80% מהם וזה מספיק\n\nשעורי הבית: \n\nהמבחן: לעבור על התרגולים ולפתור כמה שיותר מבחנים משנים קודמות, רעיונות חוזרים על עצמם, פשוט קורס של לשחק במשוואות\n\nהשורה התחתונה: מומלץ", "timestamp": 1680606852758}, {"author": "0000", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עוכאשה\nחוות דעת - הרצאות: אין אין עליו ברור וישר לעניין ורוצה שכל הסטודנטים יצליחו, יש הקלטות להרצאות ולתרגולים והכל ברור\n\nשם המתרגל/ת: אבראהים חוסין\nחוות דעת - תרגולים: ברור וישר לעניין ומפשט דברים\n\nשעורי הבית: יש רפרנס להכל\n\nהמבחן: למידה יעילה מביאה 90+\n\nהשורה התחתונה: אחלה קורס מדעי", "timestamp": 1689704062229}, {"author": "-", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "לא הגעתי להרצאות כי לעקוב אחריהן דרש המון זמן בשבועות הראשונים ופשוט לא עזר בלפתור שאלות. בנוסף שמעתי על הקורס הזה שאמור להיות מסקרן וסגירת מעגל מוצלחת עם פיזיקה וההרצאות (וגם כל יתר הקורס) היו הפוכים מזה לגמרי\n\nקראתי את התרגולים ולא הגעתי, לא באמת היה אפשר להבין איזה אות מייצגת מה בנוסחאות, ואני עדיין במצב הזה גם אחרי שקיבלתי 100 במבחן. גם חברים שהגיעו לתרגולים היו במצב דומה.\n\nשעורי הבית: קשים פי מאה יותר מהמבחן. לרפרנס, אבל להבין את הרפרנס. כל הלמידה שלי של הקורס הייתה דרך רפרנס מדהים של סטודנט עבור כל נושא.\n\nהמבחן: להכיר את כל השאלות הקבועות מכל נושא ולדעת להציב במחשבון ואז אין מה לדאוג.\n\nהשורה התחתונה: אפילו שעשיתי אותם כי הייתי חייב, סהכ נהנתי מפיזיקה 1מ ומפיזיקה 2. חשבתי שלקחת קורס שהוא פתיחת אופקים לנושאים מעניינים כמו שכתוב בסילבוס יכול להיות אחלה דרך לסגור שרשרת מדעית. טעיתי, עד עכשיו לא רואה קשר בין מה שלמדנו ל70 אחוז מהסילבוס. אפילו לא ניסו לגרום לנו להבין מה הולך מאחוריי הנוסחאות המתמטיות הקיצוניות האלו. קיבלתי 100 בקורס ואני יכול לומר לגמרי שהדבר היחיד שלקחתי ממנו זה לדעת לעקוב אחרי דף נוסחאות מסוים בלי טיפת אינטואיציה והבנה של מה הולך. מילא הוא גם היה קל כמו שאומרים עליו, לדעתי הוא לא היה. עדיין הייתי צריך לשים כמה ימים טובים בתקופת מבחנים כדי להשתלט על כל החומר הזה.\n\nבקיצור, אולי קל לקבל בו ציון אחלה, אבל בכלל לא קורס קל כמו שאומרים. קורס לא מעניין שמשאיר טעם גרוע משרשרת פיזיקה. לקחת רק אם חייבים לסגור שרשרת או אם סוף התואר ולא נשארה מוטיבציה בכלל ללמוד משהו מעניין אלא רק לסגור נקז.", "timestamp": 1689778851836}, {"author": "שוגה בוגה שיגועים", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "אין מה להגיד על פיזיקה 3. במילה 1 = קייטנה.\nבסמסטר 1 אמרו לי ככה:\nפיזיקה 1 זה קל פיזיקה 2 זה קשה פיזיקה 3 זה בית.....\nאכן צדקו.\nעכאשי הוא כל כך נחמד תמיד מסביר את כל החומר ואז בסוף אומר שכל מה שהוא הסביר זה לא מדע מדוייק.\nבמבחן כולם קיבלו 100 כמובן הרי זה מבחן אמריקאי ממוחזר.\nבמהלך הסמסטר שכחנו שנרשמנו לקורס אבל שבוע למבחן בפיזיקה זה לא סוף חרוץ.\nלמדנו את כל הקורס ביומיים והוצאנו ציון גבוה פי 2! (מ50).\nשיעורי הבית הם בכלל לא אסון מאז שהמציאו את האקסל זה בא בפאסון. \nבקיצור הקורס הכי לא מושקע בתואר עד כה. מקווה שעכאשה ידע את ערכו (הגדול! איש נהדר ונחמד!).\nוזהו זה הסוף של כל הפיזיקות:( מקווה בשבילכם שקיבלתם בכולם מאיות:)", "timestamp": 1691593956635}, {"author": "כריס", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לא הייתי\nחוות דעת - הרצאות:\n\nשם המתרגל/ת: איברהים \nחוות דעת - תרגולים: תותח. \n\nשעורי הבית: לרפרנס בשביל המגן, אין צורך לפתור לבד\n\nהמבחן: יום אחד של מעבר על תרגולים, שלושה ימים של מבחנים הספיקו בשביל ציון מעולה. להתחיל לעבוד מהרגע הראשון של הלמידה בצמוד לדף נוסחאות!!!\n\nהשורה התחתונה: קורס מדהים. חבל שמתפנה זמן להשקיע בו רק שנייה לפני המבחן בדרך כלל, הלוואי והסגל הזה היה מלווה אותי גם בכל הקורסי חובה בפקולטה.", "timestamp": 1691674816600}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: \nלא אהבתי את ההרצאות שלו.\n\nשם המתרגל/ת: איברהים\nחוות דעת - תרגולים: ממולץ\n\nשעורי הבית: לא קשים במיוחד - כן פתרתי אותם, הם עוזרים להבין את החומר\n\nהמבחן: די ממוחזר ולא קשה במיוחד.\nפשוט צריך דף נוסחאות טוב\n\n\nהשורה התחתונה: אם אתם מחפשים קורס קל, שלא דורש השקעה גדולה, אז זה הקורס", "timestamp": 1691930307488}, {"author": "אנונימוס", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: עכאשה - אחלה מרצה נחמד מאוד מסביר טוב ובאמת משתדל לגעת בהרבה נושאים כדי שנכיר כמה שיותר דברים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: איברהים מתרגל מעולה מסביר טוב, נחמד מאוד לסטודנטים ובאווירה טובה אין עליו!!\n\nשעורי הבית: סה\"כ בסדר אבל יש רפרנסים מעולים חובה להשתמש בהם\n\nהמבחן: מבחן סבבה לגמרי, צריך כמה ימים של למידה אינטנסיבית ולתרגל ככה 8-9 מבחני עבר ואז כנראה שתראו את רוב השאלות, אבל המבחנים באמת בסדר גמור (לא קלים אז לא לזלזל)\n\nהשורה התחתונה: קורס נחמד מאוד, אם משקיעים בו נכון יכול להעלות ממוצע, נותן עוד מבט על דברים שכנראה לא נגע בהם בחיים אבל נחמד לדעת, ומנוהל מצוין עם סגל קורס נפלא ורפרנסים עוד יותר! מומלץ גם כקורס בחירה", "timestamp": 1691952990424}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202203", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: \nרצתי על ההרצאות של עכאשה בסמסטר על קצב של פי 2, אבל שכחתי את כולן אחרי החופש בין סיום הקורס למבחן. ולא חזרתי עליהן. ההרצאות לדעתי ממש לא חובה.\nשם המתרגל/ת: עמית קם\nחוות דעת - תרגולים: \nגם את התרגולים שלו ראיתי מוקלטים משנה שעברה עמית נראה אחלה מתרגל הוא העביר את החומר בצורה מובנת וידע לענות על שאלות.\nשעורי הבית: \nשיעורי בית יותר קשים מהמבחן מצאתי את עצמי פה ושם נתקע על כמה שאלות אבל אחלה תרגול. אותו קונספט של שאר הפיסיקות.\nהמבחן: \nהמבחן היה סביר לדעתי הוגן, לא קשה- כמו שאר המועדים, אבל היה ממוצע משמעותית יותר נמוך ממועד א כי באמת היה ברמה יותר גבוהה.\nהשורה התחתונה: \nחשבתי שזה יהיה קורס מעניין ויפתח אותי למקומות חדשים בפיסיקה לצערי התאכזבתי בעניין הזה, אין הוכחות כמעט, לוקחים את מה שאומרים כמובן מאליו שזה מצער באיזשהו מובן ברוב הנושאים לא היה לי אינטואיציה למה הדברים נכונים אבל פשוט קיבלתי אותם. \nבתכלס הקורס יותר קל משאר הפיסיקות ואפשר להוציא ציון מאוד גבוה גם בלי השקעה מיותרת.", "timestamp": 1705163829108}, {"author": "אייל גולן המלך", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עכאשה \nחוות דעת - הרצאות:  ראיתי מוקלט, מעביר את החומר בצורה ברורה וקורהנטית בלי מריחת זמן. אפשר לראות שהוא אחלה של בחור. באופן אישי אני מאוד אוהב את התחום של הקוונטים מעבר למה שנלמד במוסד האקדמי, אז היה לי עניין רב בחומר הנלמד.\n\nשם המתרגל/ת: איברהים\nחוות דעת - תרגולים:  גם פה ראיתי מוקלט, בחור חביב מאוד שיודע ללמד.\n\nשעורי הבית: רפרנסתי הכול כבר בשבוע 1 כדי לא להתעסק עם זה במהלך הסמסטר.\n\nהמבחן:  הזנחתי את הקורס לחלוטין עד השבוע של המבחן (שיחקתי ליג וראיתי במסך השני את ההרצאות ואת התרגולים). שבוע לפני התחלתי לראות תרגולים ברצינות בשילוב עם למידה למבחן אחר. בתכלס היו לי יומיים/שלושה של פתירת מבחנים. המבחן היה די קליל, כמו כל מבחן בפיסיקה 3,  וזאת למרות שהמבחן היה יותר קשה מזה של סמסטר שעבר. יש המון שאלות ממוחזרות שלעיתים מובאות עם אותם נתונים בדיוק.\n\nהשורה התחתונה:  פרס אחרי פיסיקה 2 שיותר קשה משמעותית, סגל חביב שלא מקשה , שווה לקחת שרשרת פיסיקה רק בשביל הקורס הזה.  אובראול 9/11.", "timestamp": 1713546495563}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: מרצה על\n\nשם המתרגל/ת: עומר גורביץ \nחוות דעת - תרגולים: הכי מומלץ!\n\nשעורי הבית: \nעדיף לפתור עוזרות בהבנת החומר\nהמבחן: \nהוגן\nהשורה התחתונה: קורס חמוד", "timestamp": 1713558956673}, {"author": "קרם ברולי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: אחלה הקלטות. הקשבתי חצי-כוח תוך כדי הסמסטר.\n\nשם המתרגל/ת:\nחוות דעת - תרגולים: אל תלכו לתרגולים, לא צריך באמת. מספיק לקרוא אותם כשאתם יכולים וגם אז לא חייבים להבין יותר מדי.\n\nשעורי הבית: לרפרנס\n\nהמבחן: מבחן קל. צריך דף נוסחאות טוב, ולתרגל קצת פחות משבוע כדי להיות מוכנים.\n\nהשורה התחתונה: קורס קליל עם ציון מתנה. אין מה להשקיע במהלך הסמסטר כמעט, והחומר נחמד סה\"כ.", "timestamp": 1713721028527}, {"author": "ע.", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "חוות דעת - הרצאות: \nלא צפיתי\n\nשם המתרגל/ת: אבראהים מוקלט\nחוות דעת - תרגולים: \nמאוד טוב מסביר את החומר בצורה מעולה.\nשעורי הבית: \nרפרנס לכולם\nהמבחן: \nיום חזרה על החומר ו 2-3 ימים תרגול מבחני עבר ואז ציון 90+ מובטח\n\nהשורה התחתונה:", "timestamp": 1714206551162}, {"author": "Gal", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: מרצה מעולה ומאוד מתחשב בסטודנטים.\nעל פניו החומר די משעמם אבל הוא מעביר אותו בסבבה ויש הקלטות מאוד טובות שלו ביוטיוב אם משהו לא מובן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אם צופים בהקלטות של מוחמד ביוטיוב התרגולים די מיותרים. \n\nשעורי הבית: 20% תקף. רמה מעל המבחן. \nאפשר לרפרנס בלי נקיפות מצפון. רק כשלומדים למבחן באמת מבינים מה צריך לעשות ולמה כי יש פתרונות יחסית מפורטים למבחני עבר.\n\nהמבחן: שאלות סטנדרטיות וממוחזרות ברובן. תמיד יש שאלה או שתיים שדורשות קצת חשיבה. שאר השאלות הן פשוט להציב בנוסחה.\n\nהשורה התחתונה: קורס לא קשה עם סגל טוב", "timestamp": 1716666136425}]}