{"posts": [{"author": "---", "difficultyRank": 5, "generalRank": 4, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: עמוס מאוד לקחת אותו בקיץ, אבל קורס טוב", "timestamp": 1601744886913}, {"author": "Dor Shacham", "difficultyRank": 4, "generalRank": 4, "semester": "202003", "text": "שם המרצה: \nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nעשינו 3 דוחות מעבדה והם היו ממש ארוכים ומעיקים, חוץ מזה רוב הזמן עושים בשיעור לומדות ובבית עושים דוח על כל 3 לומדות שלוקח בערך שעתיים אז די סבבה.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: רוב הזמן המעבדה די רגועה אבל כשיש דוח להגיש זה ממש מעיק. הניסויים עצמם והלומדות לדעתי היו די מעניינים.\nעשיתי את המעבדה בקיץ וזה היה מאוד נוח", "timestamp": 1634755697208}, {"author": "Eilon Zohar", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המדריכה: קטיה\nחוות דעת: מונוטונית. נראה שהיא רק רוצה לסיים עם זה. באיזשהו מקום זה נחמד כי היה סמסטר יחסית עמוס והמעבדה הייתה קלילה בגלל זה\n\nהשורה התחתונה: לעשות כדי לעשות. ניסויים חמודים", "timestamp": 1644311031268}, {"author": "531", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גיל בן ארי\nחוות דעת - מעבדה: גיל מקצוענית בטירוף (היא גם האחראית על מעבדה 2). שלוש שעות במעבדה שהיא רק עוברת בינינו ומוודאת שהכל הולך טוב ושכולם מספיקים.\n\nשעורי הבית: מאוד קשים. גיל קפדנית על הכל בצורה מטורפת, אז הדוחות אף פעם לא מושלמים.\nבכללי הדוחות מאוד ארוכים ודורשים הרבה מאוד עבודה (ניתוח נתונים בפייתון ומסקנות).\n\nהשורה התחתונה: קורס קשה, שאב לי הכי הרבה זמן בסמסטר. המעבדה דורשת המון - לקרוא לפני המעבדה את התדריך (20 עמודים לפחות, לרוב לא מתואם עם 2פ ולכן גם לא מבינים בדיוק את החומר), כשמגיעים פשוט מתחילים לעבוד וכמה שתספיק בכיתה זהו הציון שלך על המעשי.\nלא מומלץ לעשות במקביל ל2פ' אלא אחריו. ממליץ להגיע עם ידע מוקדם בפייתון.", "timestamp": 1659172188575}, {"author": "Tian Han Shen", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גבי ויינרוט\nחוות דעת - תרגולים: \nמאוד תכלס כמדריך, לא מחפש להוריד ציון בדוחות.\nשעורי הבית: \nהסמסטר לא היו דוחות ארוכות , לכן הרבה פחות עמוס \nהמבחן: \nיש מבדק מיומנות , שבו נדרש לעשות ניסוי שנעשה בצורה עצמאית.\nהשורה התחתונה:\nקורס די סבבה במתכונת של השנה , אבל כל סמסטר הם משנים את המבנה", "timestamp": 1677684322074}, {"author": ":)", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המדריך: גבי\nזוועה! גבי נותן הוראות לא ברורות, מסביר בהתנשאות וזלזול, ומבזבז חצי שעה מכל שיעור מעבדה ב ״הסברים״ על נושאים שבכלל לא קשורים למעבדה. לא די בכך, הוא גם מוריד בערך כפליים מכל מדריך אחר בדוחות - דוח שקיבל אצל גבי 30 יקבל אצל מדריכים אחרים 80...\n\nשעורי הבית: עלולים להיות ארוכים ומייגעים. תלוי ניסוי\n\nהשורה התחתונה: אילולא גבי המעבדה יכלה לעבור בנעימות", "timestamp": 1689431996396}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המדריך: דימה\nחוות דעת: מדריך ממש טוב, יודע לעזור ולענות על שאלות ומאוד צ'יל. מאוד הוגן בבדיקת הדו\"חות.\n\nשעורי הבית: \nסיוט מוחלט. כל קוד להכנת גרפים שיענו על הסטנדרטים יהפך לפרוייקט באורך הגלות שממש לא ירגיש מספק (גם אחרי שתקבלו את הגרף הכי יפה שיש). הדו\"חות עוד סבבה יחסית, עיקר המטלה זה באמת להכין קוד.\n\nהשורה התחתונה: קורס נחמד והכל, תמיד סבבה לראות את התופעות הפיזיקליות מתרחשות במציאות אבל בתכלס כל הסיבה לקיום שלו זה ללמד אותנו להכין גרפים.", "timestamp": 1689781208258}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: גבי\nחוות דעת - הרצאות: מדריך ממש נורא. אם אתם בקבוצה שלו תעברו מהר או שתתכוננו להשקיע את כל החיים שלכם בהגשות. יש ניסויים שהוא יסביר שעתיים וישאיר רק שעה לעשות את הניסוי אבל למרות זאת לרוב זה מספיק זמן לסיים את הניסוי. הוא בודק את ההגשות כמו דיקטטור ויוריד 20 נקודות מייד אם יש אפילו גרף אחד שלא הוספתם בו \"אנוטציות\" ובנוסף לזה ימצא איזה 10 תירוצים להוריד נקודות פה ושם. ציון על עבודה מושקעת זה 60 ועל אחת שלא 20\n\nשעורי הבית: לכתוב קוד לוקח הרבה זמן והוא אף פעם לא יהיה אלגנטי אז כדאי לוותר על זה. להכין את הגרפים יכול להיות מציק. ולהכין הגשה גם בוורד וגם בליך סתם מציק ובזבוז זמן\n\nהשורה התחתונה: הקורס יכול להיות סבבה אבל הוא גם עמוס מאוד. אל תלכו לגבי", "timestamp": 1689781325935}, {"author": "מלך הריש והמפנק הראשי", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המדריך: גבי ויינרוט\nחוות דעת: צרחות!! לא להתקרב, אני חוזר, לא להתקרב! לעולם לא ראיתי כזה זלזול בסטודנטים, הערות פוגעניות ומנותקות מההשקעה הרבה שנותנים בדו\"חות. מוריד נקודות בלי לחשוב פעמיים. 100 אצלו זה אם תגיש דוקטורט בתור דו\"ח.\n\nשעורי הבית: כבדים אחושרמוטה. לוקח זמן כמעט כמו רטובים במדמ\"ח.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מזעזע, לא ממליץ לקחת עם גבי.  הביקורת עליו היא לא כבן אדם חס וחלילה אלא כמדריך. הוא היה צוחק איתנו ואז מכסח בבדיקה ללא רחמים.", "timestamp": 1689855873332}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המדריך: גבי ויינרוט\nחוות דעת - מעבדה: \nגבי בן אדם נחמד ומסביר הכל בצורה מובנת. הבעיה היא שהרבה פעמים הסבר שלו יכול לקחת שעתיים ולגזול זמן יקר במעבדה ולהוסיף זמן עבודה בבית. \nהניסוים עצמם ברובם בסדר אבל יש כמה שאפשר לא להספיק או לעבוד מאוד בלחץ כדי להספיק סתם כי דרשו לחזור על אותו עיקרון בכמה דרכים שונות בניסוי. \n\nשעורי הבית: זוועות עולם. \nהקורס שבפער לקח הכי הרבה זמן בשבוע במהלך הסמסטר, הרבה יותר השקעה מכל קורס אחר, ואחרי שתשקיעו באמת שעות בו תקבלו 80 במקרה הטוב על הדוח בגלל כל מני חירטוטים בגלל שלא הסבירו לכם טוב איך לעשות נכון. מי שבנה אותו / החליט על מדיניות הבדיקה משום מה חושב שהקורס הוא 10 נקז ולא מבינים ש1.5 נקז לא אמורים להיות כאלה עמוסים. \n\n\nהשורה התחתונה: \nבסוף איכשהו הציונים הסופיים עוד סבירים אבל באמת שאין קורס שהעביר אותי טלטלות כמו הקורס הזה. מקווה בשבילכם שישפרו את מדיניות הבדיקה ויורידו את העומס.", "timestamp": 1691611549598}, {"author": ":)", "difficultyRank": 3, "generalRank": 5, "semester": "202203", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: מיכאל מדריך מצוין! מאוד מפרגן בציונים ועוזר במהלך המעבדה בכל מה שצריך\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1697723965974}, {"author": "רואיה", "difficultyRank": 5, "generalRank": 5, "semester": "202203", "text": "שם המדריך: דימה שישקין\nחוות דעת: דימה הוא מדריך מצוין שעזר לנו להבין את החומר לעומק במהלך כל הסמסטר. הוא לא רק פיקח את הניסויים, אלא גם הביא להבנה מעמיקה של הפיסיקה מאחורי כל נושא בחשמל ומגנטיות. בדוחות, הוא היה הוגן בבדיקות.\n\nשעורי הבית: כוללים 6 ניסויים עם דוחות המבוססים על שאלות ספציפיות או הצגת נתונים גרפיים. יש גמישות בצורת ההצגה, אך החשיבות העיקרית היא ההבנה וההסבר המקיף של הנתונים. הדוחות דורשים מאמץ וזמן. בעיקר על החלק של הצגת הנתונים שהוא צריך ידע ב-python\n\nהמבחן: אין\n\nהשורה התחתונה: ניסויים מעניינים. יש הרבה תכנות. מומלץ בחום להגיע לכל ניסוי עם רקע טוב על הניסוי והבנת התדריך לפני. ולהכין את הקוד לאיסוף כל הנתונים לפני כל מפגש.\nממליצה לקחת בסמסטר קיץ או בסמסטר לא עמוס.", "timestamp": 1704634487906}, {"author": "א.ב.", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המדריך: גבי ויינרוט\nחוות דעת: גבי מסביר בדרך כלל היטב מה צריך לעשות, ומה חשוב לדעת. לפעמים ההסברים התיאורטיים קצת ארוכים מידי.\n\nשעורי הבית: יש לגבי דרישות גבוהות לגבי הגשת הדוחות והגרפים.\n\nהשורה התחתונה:\nדי מעצבן, אבל עוברים את זה...\nטוב לבוא עם קצת רקע בפייתון.", "timestamp": 1711535298153}]}