{"posts": [{"author": ",", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "אצלנו בסמסטר, המעבדה לפיסיקה הייתה מקוונת. היו 3 ניסויים. הדוחות ארוכים ולוקחים זמן. מעבדות מציקות. בחני כניסה קשים ולא קשורים, ותלויים בזיכרון שלך אם אתה זוכר את התשובות הנכונות והאם ראית את השאלות האלה קודם. בחני כניסה שהם מזל. הרבה פעמים לא קשור לפיסיקה בכלל אלא בסטטיסטיקה. למי שלא עשה קורס כזה, הוא לא יבין בכלל על מה מדובר, וחבל. \nבכל מקרה, הציונים מנורמלים סביב 90. \n\nהשורה התחתונה: קורס מעיק ודוחות מציקים. לא להגזים בהשקעה, 1.5 נקז, אם כי הרבה נקז יחסית למעבדה. לעשות את זה כמה שיותר מהר! מיותר ושורף זמן", "timestamp": 1598296572394}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: גלעד בנסקי\nחוות דעת - הרצאות: סמסטר קורונה, מעבדה נוראית ושואבת זמן. 3 שעות מפגש+לעשות ניסוי בבית לפני+לשבת כמה שעות טובות על הדוח שבחיים לא מספיק טוב בעיניהם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות מעיקים\n\nהמבחן: לא רלוונטי\n\nהשורה התחתונה: קורס חובה אז אין ברירה כל כך..", "timestamp": 1612255971868}, {"author": "לייזר", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: גלעד בנסקי\nחוות דעת - הרצאות: חופר ברמות, מדבר שעות על התאוריה ולא מסביר מה לעשות תכלס בדוח\n\nעל הקורס: מי שמצפה לקורס מעבדה נחמד עם 90+ קליל טעות בידו. סמסטר קורונה לכן היו מפגשים של 3 שעות בזום+לעשות ניסוי לבד בבית בתנאים מגוכחים+להתכונן לניסוי הבא כי יש בוחן כניסה+ דוחות מעבדה ארוכים כמו הגלות שגם איינשטיין לא היה מוציא בהם מעל 90.\n\n\nהשורה התחתונה: קורס נוראי ומשעמם, לא לומדים שום דבר חדש והדוחות מעיקים בטירוף, פשוט קורס שנועד לבזבז את הזמן", "timestamp": 1613928465116}, {"author": "ר", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: גוליה\nחוות דעת - הרצאות: בסה\"כ סבבה. לא ממש נותנת ציון 2, אבל היא בסדר גמור ביחס למדריכים אחרים לפי מה ששמעתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הדוחות קשים ברמות, תתכננו לשבת שעות על כל דוח", "timestamp": 1629107598095}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המתרגל/ת: קטיה\nחוות דעת - תרגולים: קטיה מעולה, מעבירה את המעבדות בצורה מאוד ברורה, אומרת מה היא מצפה שיהיה בדוח ומתעכבת גם על קשיים בכתיבת הקוד במטלאב. עוזרת גם כששואלים במייל. באמת מתאמצת בשביל הסטודנטים כשיש צורך.\nקטיה מעולה מומלץ בחום להיות בקבוצה שלה!\n\nשעורי הבית: הדוחות נוראיים, גוזלים מלא זמן.\n\nהשורה התחתונה: סך הכל קורס חובה ואין מה לעשות.", "timestamp": 1633865972483}, {"author": "גל", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: איוון רפפורט\nחוות דעת - הרצאות: עובד ישר ולעניין. אני אהבתי\n\nשעורי הבית: \nמתישים", "timestamp": 1647292507399}, {"author": "האננס", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גלעד בנקסי\nחוות דעת - הרצאות: מנחה טוב, מסביר הכל בצורה טובה ולא משאיר מקום לספק.\nטיפה קפדן בבדיקה אבל סך הכל הוגן.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: יש 8 מפגשים סך הכל ו-6 מעבדות שונות.\nחומר כביכול נלמד בקורס פיסקה 1 אבל המעבדות ממש לא קשורות.\nהמעבדות עצמן מאוד קלות ופשוטות אבל הדוחות עליהן קצת קקה.\nצריך למצוא רפרנס טוב ולהיצמד אליו, לשים לב שיש שוני בין הדרישות במעבדות בין הסמסטרים (דורשים גרפים קצת אחרים וכו'), אבל עדיין אפשר לרפרנס הכל.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס עמוס למי שבאמת משקיע, אפשר לסיים עם הדוחות תוך 3 שעות.\nקורס בחירה להנדסת מכונות אז לא משנה מה כתבתי.\nמי שלא מהנדסת מכונות לא מומלץ.", "timestamp": 1658654886519}, {"author": "שלומקה", "difficultyRank": 4, "generalRank": 2, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: מדריך קשוח ממש!! זו מעבדה לאנשים שלא עושים תואר בפיזיקה, לא מתעניינים בפיזיקה והוא לוקח את הקורס הזה ממש קשה וברצינות למרות שסטדנטים רק רוצים לסמן וי על קורס חובה וקאדר\nהוא גם ממש מגזים בהורדת ציונים בדוחות\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא כיף בכלל אבל זה היה נראה שהקבוצות האחרות עם המדריכים האחרים דווקא סבבה", "timestamp": 1666467450002}, {"author": "noora Omari", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: עביר\nהמעברות היו קלות ונעימות ולפעמים היינו מסיימיים לפני הזמן\nהדוחות גם היו בסדר גמור \nהמבחן: אין\n\nהשורה התחתונה:", "timestamp": 1677403543845}, {"author": "ins", "difficultyRank": 3, "generalRank": 3, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: דניס\nחוות דעת - תרגולים: דניס אמנם בחור נחמד אבל יש לו אישו עם שגיאות והדרישות שלו לדוחות ממש מוגזמות ונותן ציונים נמוכים, אתם תראו את הקבוצה מולכם במעבדה מסיימים שעה לפניכם \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס עצמו קליל אבל לא ללכת לדניס!!", "timestamp": 1684748251430}, {"author": "אוסילטור הרמוני 2: הנקמה", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המדריך/ה: קטיה \nחוות דעת: \nמדריכה שיודעת מה היא עושה, מנוסה במעבדות ולכן יודעת איך לעגל פינות כדי להקל עלינו בביצוע ובדוחות. מאוד נחמדה, עוזרת כשצריך ונותנת הערכה כנה.\nהמעבדה עצמה:\n 8 מפגשי חובה + 2 השלמה, 6 ניסויים, כל שבוע ניסוי אחר.\nשלושת הניסויים הראשונים בעיקר נועדו ללמד סטטיסטיקה ולבדוק שיטות שונות על מודלים פשוטים כמו מטוטלת או עגלה במישור.\nהשלושה האחרים ממש לא קשורים לא לפיסיקה 1 ולא לפיסיקה 2, שלושתם בתכלס אותו ניסוי עם אותה מערכת שפרשו על 3 מפגשים. לא מובנים בשיט אם לא למדתם פיסיקה 1פ או תנועה הרמונית בהרחבה.\nבחני כניסה:\n5 שאלות אמריקאיות. החל מניסוי 4 הם כבר לא רלוונטים יותר מידי לניסוי עצמו, בבוחן האחרון היו כמה שאלות פגומות. מספיק לשנן תשובות מהדרייב כשעה לפני ואפשר לעבור על 4/5 או אפילו 5/5. בכל מקרה הם רק 20% מהציון של כל מעבדה.\n\nדוחות מעבדה: \nבניגוד לכימיה, פה הדרישה היא לגג 8-10 עמודים ואין דוחות מכינים, אין צורך לצרף הרבה נספחים ואין הרבה רקע תיאורטי. גם את הדוחות ואת הניסויים עושים בזוגות בד\"כ, אז תבחרו פרטנר מראש. 50% מהניקוד נטו על התוצאות. מקבלים ציון בסקאלה של 0 עד 2, כשהרוב המוחלט מקבלים 1.\nבסופו של דבר מנרמלים את הממוצע ל90 ככה אז זה הכל סתם.\n\nהשורה התחתונה: קורס מיותר, ספציפית לחומרים, לא באמת מהווה קדם לשום דבר אבל סהכ לא קשה. למי שבחומרים- מומלץ לדחות לקיץ או לסמסטרים מאוחרים.", "timestamp": 1686663725182}, {"author": "...", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: קטיה\nחוות דעת - הרצאות: היא מדריכה סבבה סך כול, אבל ממש לא ברורה בדרישות שלה לדוח. לי אישית הפריע שלא ברור מה לעשות בדחוח \n\nדוחות: 3 הראשונים קשורים לפיזיקה 1 וה3 האחרונים ממש לא קשורים. למדתי את כול החומר רק למעבדה, בעיניי בזבוז זמן וממש לא רלוונטי לפיזיקה 1. בנוסף, צריך ללמוד מטלאב מתוך סדנה אחת מסכנה שהם עושים בנושא. בעיניי לא מועיל.\n\nהשורה התחתונה: קורס לא משהו בכלל, אבל עובר מהר וחשוב לבחור שותף\\ה שתעבדו טוב ביחד.", "timestamp": 1688836099708}, {"author": "אוסילטור הרמוני 3: הנפילה", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המדריך: מתן\nחוות דעת: מתן מדריך מדהים, עוזר מאוד, זמין ומתחשב. בסופו של דבר גם מפרגן ומביא את מה שמגיע. \n\nשעורי הבית: עמוסים קצת ובעיקר מרגיש לי שיש לכתוב לפי תבנית מאוד ספציפית את הדוחות, אבל בסוף מתרגלים.\n\nהשורה התחתונה: אין הרבה קשר בין פיזיקה 1 למעבדה, יש שם נושאים שבכלל קשורים יותר לפיזיקה 2, כך שיש ללמוד הרבה דברים לבד, כאשר בתדריכים הכל נראה מאוד תיאורטי. אם זה לא קורס חובה, לא לקחת....", "timestamp": 1691434304779}, {"author": "התפלגות בינומית שובבה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המדריך: מתן גראואר\nחוות דעת:\nהיה כיף ממש ללמוד את הקורס עם מתן (עם כמה שהוא היה מתיש, ולא מתגמל עם הנק\"ז כמו כל קורס מעבדה אחר).\nמתן מוסיף מהידע האישי שלו ונותן מעצמו מעבר למה שנדרש, קשוב והמעבדות מתנהלות בכבוד, כיף ורצון למידה - אבל הכל תלוי במדריכים שלכם. \nהקורס עצמו בעייתי. מבאס ללמוד קורס כשאת.ה יודע.ת שלא משנה ההשקעה שלכם.ן, התוצאה באזור ה-90, אבל חשוב לשים לב שלא ישתה לכם את הזמן! מניסיון אישי, השקעתי בערך יום-יומיים בשבוע על הקורס, כולל הכנה למעבדה ודוחות, אבל זה ממש לא שווה את זה לקורס של 1.5 נקז!\n\nהשורה התחתונה: קורס חובה, אין ממש ברירה, אבל סך הכל הקורס מאוד מלמד, ונותן טעימה לכתיבה מדעית ולסטטיסטיקה. אולי שווה לנסות ללמוד סטטיסטיקה לפני, אבל לא קריטי. \nשמעתי גם על מדמחיסטים.ות שחושבים.ות לקחת את הקורס. בבקשה, אל.", "timestamp": 1692373888337}, {"author": "נעה", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: הדיל\nחוות דעת - הרצאות: הדיל ממש עזרה לנו וגם נתנה ציונים יחסית טובים, היא אחלה מדריכה\n\nדוחות זוועה, ממש קשים, לוקח יותר מיום שלם לעשות דוח וזה עוד בזוגות.  לא למדנו אתך החומר הזה וצריך ללמוד אותו גם לבוחן וגם לדוח, ה3 מעבדות האחרונות הן בכלל על חומר של פיזיקה 2 . \n\nהשורה התחתונה: לא ברור למה סטודנטים לחומרים צריכים לעשות את הקורס הזה, פשוט לעבור ולשכוח. אם יש אופציה לוותר עדיף תמיד", "timestamp": 1695188587069}]}