{"posts": [{"author": "יעל", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: דוד התחיל את הסמסטר בלשלוח אותנו להרצאות מוקלטות, דבר שבעיני היה לא מוצלח. באמצע סמסטר עבר לשיעורים בלייב בזום. הוא מרצה טוב אבל הסתבך רבות עם הטכנולוגיה, ופעמים רבות היינו צריכים להעיר על כך שאנו לא רואים מה שהוא עושה. מאוד אכפת לו מהסטודנטים שכן בסוף הסמסטר עשה לנו תגבורים (3 שעות ברצף).\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: דניאל מתרגל סבבה. גם לו מאוד אכפת מהסטודנטים ודאג לחזק לנו את הנושאים הקשה בתגבורים. לפעמים היה נצמד טיפה לדפי התרגול... \n\nשעורי הבית: \nלי היו מאוד מאתגרים, לא הצלחתי לפתור אותם באמת בלי עזרה. כל שבוע היה גיליון במודל ואף לפעמים 2.\nהמבחן: \nהיה לא קל, חלק מהשאלות לא ידעתי להתמודד איתם בכלל, חלק היו סבירות מאוד. נבחנים באותו מבחן של פיזיקה 1\nהשורה התחתונה: הרבה מאוד שעות שבועיות, לפעמים אפילו יותר מידי גם בהתחשב שזה קדם+קורס, שכן מיועד לסטודנטים חסרי פיזיקה...", "timestamp": 1612770897897}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דוד\nחוות דעת - הרצאות: ההרצאות קצת לא ברורות ואופן ההוראה לא הכי מסודר, צפיתי בסופו של דבר בקורס המוקלט ביוטיוב של מוחמד עכאשה.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: מתרגל מצוין ! היה ממש קל להישאר מרוכזים איתו וניכרת הייתה השקעתו בלימוד. \n\nשעורי הבית: רובם חוזרים על עצמם משנים קודמות, חלקם קשים מאוד חלקם בסדר.\n\nהמבחן: היה קשה אבל הוגן.\n\nהשורה התחתונה: קורס מעניין מאוד", "timestamp": 1613029568804}, {"author": "פ", "difficultyRank": 2, "generalRank": 3, "semester": "202003", "text": "שם המרצה: עדי נסר\nחוות דעת - הרצאות: מבולגנות בטירוף\n\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: \nמבולגנות אפילו עוד יותר \nשעורי הבית: \nממוחזרים\nהמבחן: \nמועד ב של פיזיקה 1, אותו סגנון שאלות במשך שנים של מבחני פיזיקה \nהשורה התחתונה: תראו את ההרצאות המוקלטות של חנה ויהיה טוב", "timestamp": 1634022698966}, {"author": "ישראלה ישראלית", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: אחלה בן אדם אבל מרצה גרוע. מלא בכוונות טובות אבל עם כוונות טובות לא הולכים למכולת.!. מבולגן, לא מסביר מה הוא עושה, פשוט זורק דברים לאוויר בלי הפסקה.\n\nשם המתרגל/ת: מישה ניטשינסקי\nחוות דעת - תרגולים: קושי בשפה מה שמשפיע על ההספק במהלך התרגול. בן אדם טוב ומתחשב אבל קצת בזבוז זמן להגיע לתרגולים. \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: כדאי ללכת להרצאות ותרגולים של פיזיקה 1 ולא 1ל , ההרגשה שלי היא שבכוונה הסגל של 1ל לא מספיק טוב על מנת שהציונים של פיזיקה 1 ישארו גבוהים יותר. בכל מקרה המבחן בסופו של דבר הוא אותו מבחן.", "timestamp": 1642951424392}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: \nמרצה סביר, עושה הרבה ניסויים שזה נחמד, מצד שני לא תמיד מסביר בצורה הכי ברורה. \n\nשם המתרגל/ת: מישה\nחוות דעת - תרגולים: \nעוזר המון בשעות קבלה, פותר תרגילים בצורה נהדרת אבל לא יודע להסביר למה צריך לפתור ככה. \n\nשעורי הבית: מגוונים מאוד, חלקם מעל רמת מבחן, חלקם מתחת. \n\nהמבחן: 11 שאלות אמריקאיות, 10 נק' לכל שאלה (סה\"כ 110 נק') פייר מאוד, אם פותרים את המבחנים של שנים קודמות אפשר להגיע מוכנים. \n\nהשורה התחתונה: \nכדאי להיעזר בהרבה חומרים חיצוניים (גול, הרצאות ביוטיוב וכאלה..). ללכת לשעות קבלה! ולתרגל כמה שיותר מבחנים.", "timestamp": 1644315424011}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: הרצאות לפעמים קצת לא ברורות אך יש לו המון שיטות לפתרון תרגילים בכמה תחומים והן קלות עבור מי שלא למד פיזיקה לפני כן.\nבסה\"כ עם כוונות טובות מאוד\n\nשם המתרגל/ת: מיכאל נינטשנקו \nחוות דעת - תרגולים: יודע לפתור טוב תרגילים ותמיד רוצה לעזור אך לפעמים לא יודע להסביר למה צריך לפתור כמו שפותר.\nשוב אדם עם הרבה רצון לעזור\n\nשעורי הבית: יש קלים ויש קשים\n\nהמבחן: אותו מבחן של פיזיקה 1\n\nהשורה התחתונה: רצוי להיעזר בגול ולהשקיע במהלך הסמסטר", "timestamp": 1646293943393}, {"author": "הילה", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: עדי נסר וגידי המלך\nחוות דעת - הרצאות: כל המבנה של הקורס שלנו היה שונה לחלוטין אז ההרצאות והתרגולים לא היו קלאסים, זה היה \"כיתה הפוכה כזה\" . בכל אופן, היה אחלה קורס וגידי הוא מלך העולם, הרבה זמן לא פגשתי מרצה שהדבר היחיד שהוא אוהב יותר מפיזיקה זה ללמד פיזיקה . אם תקחו איתו קורס - תזכו .\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: מתרגל על, גם הוא, כמו גידי, באמת אוהב ללמד ויעשה הכל כדי שחווית הלמידה של הסטודנטים תהיה בטופ האפשרי . ממליצה ביותר מחום\n\nשעורי הבית: כמו תמיד, חלק שאלות מייצגות וחלק כאלה שלא ראויות להתייחסות בכלל מרב שהן לא פרופורציונליות לרמה .\n\nהמבחן: היה קל לא אשקר \n\nהשורה התחתונה: אחלה קורס, זכיתי בסגל פצצה שהוביל לציון גבוה - ממליצה בחום", "timestamp": 1666278755653}, {"author": "1", "difficultyRank": 5, "generalRank": 3, "semester": "202203", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: דוד מרצה אכפתי וקשוב, אבל מבחינת העברת החומר יש מקום לשיפור- אבל מי שמצליח לעקוב אחריו ולקלוט את השיטות שהוא נותן יוכל להיעזר בזה במבחן.\nשם המתרגל/ת: נעם נס\nחוות דעת - תרגולים: הייתי בתרגולים הראשונים, החומר מועבר בצורה נורא איטית ומתישה ולכן ויתרתי\n\nשעורי הבית: עוזרים ביישום החומר\n\nהמבחן: הוגן יחסית\n\nהשורה התחתונה: הקורס עצמו עמוס מאוד, ולכן מומלץ לגשת לבחינת סיווג ולחסוך את הכאב ראש הזה", "timestamp": 1696154909971}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202203", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: דוד חמוד מאוד, באמת רוצה שנצליח. בפועל את המבחן כותבת חנה (לרוב המרצה האחראית של פיזיקה 1) כך שסגנון השאלות שדוד אוהב פחות מופיע במבחן. מה שכן הוא מפתח נוסחאות כלליות במהלך ההרצאות שרלוונטיות למקרים רבים ואפשר להשליך על שאלות מבלי לפתח את כל הנוסחה שוב. בשורה התחתונה, דוד אחלה מרצה אבל ממליצה גם לראות את ההקלטות של חנה, היא תותחית. \n\nשם המתרגל/ת: נועם נס\nחוות דעת - תרגולים: חמוד אבל התרגולים מאוד איטיים, מאוד עוזר בשעות קבלה וגם עונה למיילים ששולחים לו עם שאלות.\n\nשעורי הבית: התרגילי הכנה ממש בקטנה ולא לוקחים הרבה זמן, התרגילי בית מעיקים יותר ודורשים השקעה. ממליצה כן לעשות אותם ולא לרפרנס על מנת להיות על החומר במהלך הסמסטר. \n\nהמבחן: אני הרגשתי שהמבחן היה ברמה גבוהה וגם הממוצע היה יחסית נמוך. \n\nהשורה התחתונה: קורס קיץ עמוס מאוד. תשקיעו במהלך הסמסטר ואל תצברו פער, אפשרי להצליח (:", "timestamp": 1696194387814}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202203", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: \nמרצה מצוין. הייתי נוכח בכל ההרצאות ובכל התירגולים דבר שהוא קריטי מאוד לקורס. \nבאתי עם מעט ידע בושא המכניקה ויצאתי אחד שאוהב ומתחבר לתחום בזכות דוד.\nסבלני, מתחשב ומקצועי.\nממליץ מאוד על דוד.\nשם המתרגל/ת: נס נועם.\nחוות דעת - תרגולים: \nבחור צעיר וחמוד. לא מקצועי בכלל בהעברת הידע והכריזמה לא גבוהה.\nהיתרון שלו זה האכפתיות הוא יכול להישאר מזמנו לשאלות כמעט שעתיים לאחר התרגוול. \nאולי בגלל שזה סימסטר קיץ והכל קצר ועמוס הרגשתי חוסר כריזמה ובלבול.\nפחות ממליץ.\n\nשעורי הבית: \nחלקם קשים וחלקם קלים. צריך להגיש n-2 שיעורי בית וזה גם אחלה תרגול.\nהמבחן: \nהקורס עצמו היה כיף ומדהים. \nנהניתי והתכוננתי ולמדתי והשקעתי.\nהמבחן היה מזעזע. לא הוגן בכלל ולא התכוננתי לכמות כזו של הפתעות. \nממליץ מאוד ללמוד מבחני עבר מהשנים האחרנות. בעיקר ללמוד את הטריקים.\nהשורה התחתונה: \nקורס טוב. למי שלא עשה פייסיקה בתיכון אני יותר ממליץ עליו.\nנתראה בפיסיקה 2 ל.", "timestamp": 1697713946722}, {"author": "הילה", "difficultyRank": 3, "generalRank": 4, "semester": "202203", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: נועם \nחוות דעת - תרגולים: נועם המתרגל האהוב עליי בטכניון \nאין ולא יהיה מתרגל כזה אכפתי שמקדיש מהזמן שלו לסטודנטים אחרים מתוך רצון לעזור ושתצליחו באמת, הוא סבלני מאוד, יסודי ומקצועי\nכיף לראות מתרגלים שאכפת להם מסטודנטים באמת\nשעורי הבית: \nעוזרים להבין את החומר\n\nהמבחן: \nהוגן\n\nהשורה התחתונה:", "timestamp": 1704464970137}, {"author": "אדם", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: זיו\nחוות דעת - הרצאות:  הרצאות לא ברורות, הוא מפתח כל כך הרבה נוסחאות וזה כל כך מבלבל ואתה פשוט נאבד בין הנתונים. הוא לא סובלני לסטודנטים, וזה בעייתי כשהקורס מיועד לסטודנטים שאין להם רקע מקדים. הקורס הזה לוקח כל כך הרבה זמן מהמערכת, המבחן של פיזיקה 1ל זהה למבחן של פיזיקה 1 רגיל, פשוט חבל על הזמן שלכם. לכו לפיזיקה. \n\nשם המתרגל/ת: סתיו \nחוות דעת - תרגולים: חסרת כריזמה, לא ברורה, קצת מרגיש כאילו היא מעתיקה פתרונות מדף. רוב הקורס לא נכנסתי לתרגולים בגלל זה. שוב, חבל״ז\n\nשעורי הבית: ברמה גבוהה ממש, רוב הזמן הייתי מתוסכל. שוב, אין לי ידע מקדים בפיזיקה וזה בכלל לא היה מותאם אל הקורס שלנו. התרגולים וההרצאות לא הכינו אותי בכלל לשיעורי בית, לא בצורה תיאורטית ולא בצורה פרקטית. \n\nהמבחן:  קשה, ממוצע ציונים נמוך יחסית. השיעורים וההרצאות והתרגולים לא הכינו בכלל למבחן. גם מבחנים לתרגול והפתרונות שלהם לוקים בחסר, ולכן גם לא מובנים.\n\nהשורה התחתונה:  חבל על הקורס הזה בכללי, לכו להרצאות ותרגולים של פיזיקה 1. מלמדים את אותו החומר ונשאר לכם זמן פנוי. אם זה לא עוזר גם. תצפו בחנה ובעכאשה.", "timestamp": 1714579801449}, {"author": "מ", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: זיו\nחוות דעת - הרצאות: \nמלא מלא שעות שבועיות שבאמת מרגישות כמו בזבוז זמן, רוב השיעור הולך על פיתוח נוסחאות וממש לא מספיק זמן על תרגול והסבר של החומר. בשלושה שיעורים האחרונים של הסמסטר הוא לימד חומר שלא היה למבחן, במקום לעשות שיעורי הכנה מה שהיה מבאס.\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: \nהפסקתי ללכת באיזשהו שלב, אני לא הצלחתי להבין אותה בכלל בכלל. לכל התרגולים היה דף סיכום שממנו הצלחתי בערך ללמוד\nשעורי הבית: \nקשים, אני לא הכי הצלחתי אותם בלי רפרנסים אבל אם מצליחים זה שאלות מאוד דומות לשאלות במבחן אז כן הייתי ממליצה לשבור על זה קצת את הראש\nהמבחן: \nלמדתי הכל מאפס בשבועיים שלפני ובסוף קיבלתי ציון סבבה אז זה אפשרי, אבל עדיין לא קל בכלל\nהשורה התחתונה: \nאם יש לכם אופציה פשוט תכנסו להרצאות של פיזיקה 1 רגיל במיוחד אם זה עם גידי זה משפר את החוויה ממש והרבה פחות שעות שבועיות.", "timestamp": 1714929829211}, {"author": "לא משנה", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: זיו  \nחוות דעת - הרצאות: \nהרבה שעות לוקח מהזמן שלכם  ויותר מדי מציג הוכחות שפשוט מיותר להתייחס אלים \nאחרי חודשיים הפסקתי ללכת לשיעורים\nלמידה עצמית בבית דרך סרטוני רון ופתירת מבחנים זה הכי יותר סבבה שאפשר לעדות מאשר לעבור על חומר ההרצאות\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: \nלא יודעת להסביא ולא מבינים ממנה כלום \nהלכתי  לשתרגולים רק בשתי השבועות הראשונות ואז הפסקתי וסתם מיותר ללכת לשיעורים\n \nשעורי הבית: לא צריך להילחץ מהשיעורי בית \nיש מלא שיעורים והם יותר קשים מהמחבן \nהמבחן הוא ממש קל ולא קשור לשיעורי הבית \nהמבחן: \n\nקל ובקטנה\nאהבתיהשורה התחתונה:", "timestamp": 1716370044016}, {"author": "נגה", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: זיו\nחוות דעת - הרצאות: אמנם המון שעות הרצאה, אבל הכל מוקלט וגם מפורט היטב בהרצאות. \nהייתי ממליצה ללכת לשעות קבלה, הוא עוזר ונותן הכוונות ממוקדות בנוגע לכל שאלה שלכם. \nמעבר לכך, זמין במיילים, מתחשב בסטודנטים שלו (היו פעמים שדחה לנו הגשה למועד מאוחר יותר בכלל עומס בשאר הקורסים).\n\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: פחות התחברתי, אבל גם התרגולים שלה מוקלטים, זה עוזר. \n\nשעורי הבית: קשים, לא ברמת המבחן, יש רפרנסים למסתבכים, אבל עדיין מומלץ לנסות לפתור לבד כדי להפנים באמת את החומר. \n\nהמבחן: קשה. לחרוש על המון מבחנים, בסוף זה אותן השאלות עם שינויים אסתטיים. \n\nהשורה התחתונה: פיזיקה זה מעניין מאוד כשמבינים :)", "timestamp": 1720460408335}]}