{"posts": [{"author": "Chen Tasker", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: שלמה מרצה מדהים, יודע להעביר קונספטים מסובכים בצורה מאוד ברורה. בערך באמצע הקורס הפיתוחים נהיים מסובכים מאוד. סהכ ההרצאות מעניינות וטובות.\n\nשעורי הבית: עמוסים אבל מלמדים.\n\nהמבחן: בערך מה שציפיתי. קורס לא פשוט אבל המבחן היה הוגן.\n\nהשורה התחתונה: קורס מעניין וטוב, במיוחד עם שלמה. שמח שעשיתי אותו במקום את שדות של חשמל", "timestamp": 1597740767699}, {"author": "אלקטרו", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מרצה מעולה, מאוד ברור ועם הרבה מוטיבציה שהסטודנטים יבינו. סיכומים מעולים לקורס. אוריינטציה מתמטית.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מאתגרים אבל מאוד רלוונטיים לתוכן הקורס\n\nהמבחן: הוגן אבל קשה\n\nהשורה התחתונה: קורס מאתגר אבל עבר בצורה מעולה עם שלמה.", "timestamp": 1609761371824}, {"author": "סטודנט כללי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  על הנייר המרצה האחראי הוא חגי פרץ בפועל שלמה רזמט.\nחוות דעת - הרצאות: הקורס עבר בפורמט כיתה הפוכה כך שצופים בהרצאות מוקלטות של שלמה מסמסטר אביב 2020 ובזמנים הרשומים במערכת להרצאות הייתה עבודה בקבוצות קטנות (בזום או בכיתה) על גיליונות שיעורי הבית עם זמינות של סגל הקורס לשאלות. שלמה מעביר את החומר טוב, יש הרבה פיתוחים מתמטיים כבדים שלא קלים לעיכול בצפייה ראשונה אך בעלי תוצאות חשובות. הקורס לוקח את 2פ ונותן לו \"זריקת סטרואידים\" רצינית עם דרך הסתכלות חדשה על העולם של חשמל ומגנטיות וגם קרינה.\n\nשם המתרגל/ת: על הנייר היו מתרגלים לקורס בפועל עמית גופט וברק קציר.\nחוות דעת - תרגולים: עברו טוב סך הכול בסמסטר אביב 2020.\n\nשעורי הבית: 12 גיליונות לא קלים אך לרוב יש תרגילים שניתן לרפרנס במידת הקושי. מהם נלקחים התשעה הטובים, מומלץ לעשות אותם כדי לעבוד ולחזק את ההבנה של החומר של הקורס.\n\nהמבחן: מבחן שהועתק כמעט באופן מלא ממבחני עבר של רזמט + שאלה שדומה לתרגיל שהיה בשיעורי הבית. השיטה היא \"מבחן בדף נוסחאות\", אם תדע את דף הנוסחאות טוב תוכל להצליח.\n\nהשורה התחתונה: קורס שבמהלך הסמסטר כבד אך מלמד הרבה דברים שיכולים להיות מעניינים, לא רק בעולם של אלקטרודינמיקה.", "timestamp": 1626451117743}, {"author": "גדי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חגי פרץ אך ההרצאות הועברו בהקלטות של שלמה רזמט משנה קודמת. גם התרגולים הועברו באמצעות הקלטות של שנה קודמת. סגל הקורס היה זמין לשאלות ואף קיים מפגשים פעמיים בשבוע.\n\nחוות דעת - הרצאות: ההרצאות היו מובנות לגמרי כך שלא הייתי זקוק לשעות השלמה מעבר אליהן. הן נוגעות בקונספטים חדשים (שאותי מרתקים) שלא ראינו בפיזיקה קודם בחלק הראשון של הקורס אבל אז הופכות להיות מעיין \"שיטות לפתרון מדח\" בפיזיקה ובעזרת השיטות פותרים משוואות מקסוול בכל מיני היבטים. חלק מהשיטות פיתחנו בהרצאה וחלק מהן רק הוצגו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים גם עברו מוקלטים מסמסטר קודם. הם היו ברמה טובה והסבירו כל מה שהיה צריך.\n\nשעורי הבית: שיעורי בית קשים כי זו פעם ראשונה שנתקלים בשאלות. ניכר היה שהם נבנו בצורה מלמדת, רובם אפילו לא מוחזרו משנים קודמות. הם היו השלמה מעולה לחוסר האינטרקציה שיש לסטודנט עם המרצה בפורמט זה של כיתה הפוכה עם הקלטות.\n\nהמבחן: מועד א' היה די ממוחזר ככה שמי שתרגל לפני הצליח בגדול. מי שלא תרגל מספיק אך הכיר את החומר ברמת הנוסחאות גם יכל להצליח במבחן, יתכן וכיוון שרוב הקורס למדנו טכניקות לפתרון בעיות.\n\nהשורה התחתונה: קורס מעניין ומרתק בחלקו הראשון שמכניס אלמנטים חדשים בפיזיקה שלא נתקלנו בהם לפני ומהווים סוג של הקדמה ליחסות כללית. החלק השני והשלישי של הקורס הם יותר טכניים ומציגים שיטות שונות לפתרון משוואות מקסוול במצבים שונים ותנאים שונים, מה שהופך את הקורס לקצת \"מדח לפיזיקאים\" אבל מגיעות גם עם תובנות פיזיקליות.\nנהניתי מאוד מהקורס שגם הציג כלים חדשים בעולם הפיזיקה וגם קישר בין מד\"ח לבין פיזיקה ובעיות פרקטיות עם תובנות מהן. אני אישית במסלול חשמל-פיזיקה ושמח מאוד שבחרתי באלקטרו במקום בשדות של חשמל.", "timestamp": 1626766748831}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חגי (שלמה)\nחוות דעת - הרצאות: שלח אותנו לראות הרצאות בפנופטו של שלמה (כיתה הפוכה). ההרצאות ממש טובות אבל נראה שחגי לא יודע כלום כשמדברים איתו על החומר. הקורס מחולק ל3 בגדול: יחסות, סטטיקה ודינמיקה. בקטע של היחסות הוא ממש יודע טוב ובשאר נראה שאין לו מושג\n\nשם המתרגל/ת: אף אחד\nחוות דעת - תרגולים: שלחו אותנו לראות תרגולים מוקלטים בפנופטו, כל קשר בינם לשיעורי הבית ולחומר של הקורס בכללי מקרי בהחלט. ממליץ בחום אפילו לא לקרוא אותם (אולי את האלו שעל יחסות). בכיתה ההפוכה הסתובבו המתרגלים ומהקצת שהייתי ומחברים שמספרים נראה שגם להם אין מושג ממה שקורה. פשוט ביזיון.\n\nשעורי הבית: סה\"כ אחלה אבל אף אחד לא יודע לפתור אותם כולל הסגל. אם אתה לא מבין משהו עדיף ללכת לרפרנס כי המתרגלים כנראה לא יודעים לעזור לך. אגב גם בפתרונות הרשמיים של שיעורי הבית והמבחנים נראה שמי שכתב אותם (כנראה חגי) לא יודע מה הוא עושה. יש שם דברים לא הגיוניים ברמת המימדים או במועד ב 2021 פונקציית גרין לא מקיימת בכלל את התנאי שכתוב בדף נוסחאות. באמת מביך אין מה לומר\n\nהמבחן: יחסית קשה, לא מאוד. הבעיה בעיקר שאי אפשר להבין מה רוצים ממך ונראה כאילו כתבו את המבחן בעשר דקות. אתה שואל מתרגלים \"מה כתוב פה\" \"מה אני צריך לעשות\" והם בקושי מצליחים לענות. נראה לי שהם אפילו לא ראו אותו לפני שחגי שלח להדפסה.\n\nהשורה התחתונה: יודעים לעשות יפה מאוד כאילו אכפת להם מאיתנו אבל במציאות זה לא נכון. החומר מעניין מאוד אבל הסגל (גם של השנה וגם של המוקלטות) הורס את זה ממש. מומלץ כי לומדים שם דברים של יחסות שאין בשדות וכדאי להכיר, אם היחסות יורדת בעתיד אל תעשו את הקורס", "timestamp": 1657552552247}, {"author": "~", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חגי פרץ\nחוות דעת - הרצאות: \n\nההרצאות עברו בכיתה הפוכה - ראינו הרצאות מוקלטות של שלמה רזמט מאביב 20' והגענו בשעות ההרצאה האמיתיים לפתור את הגליונות עם חגי והמתרגלים. התחושה הכללית הייתה שהסגל עשה העתק הדבק לקורס מסמסטר קודם עם אפס התאמה ושיפור. הכיתה הפוכה עצמה עזרה ויותר קל לפתור את הגליונות כשיש לך מישהו זמין לשאלות, אבל לרוב לא מספיקים לסיים את הגליונות בכיתה הפוכה.\nרזמט עצמו מרצה מעולה - ההרצאות הראשונות הזויות לגמרי ולוקח זמן להבין את הצורת כתיבה החדשה שמשתמשים בה בקורס, אבל אחרי שבוע 4-5 זורקים אותה כמעט לגמרי וחוזרים לכתוב הכל כמו ב2פ אז לא להלחץ מההתחלה.\n\nשם המתרגל/ת: תרגולים מוקלטים \n\nחוות דעת - תרגולים: \nהמתרגלים המוקלטים באופן כללי על הפנים, למרות שדפי התרגול מצוינים ונעזרתי בהם הרבה לקראת המבחן. הם לרוב מדייקים לגמרי לשאלות שראינו במבחנים ורלוונטים.\n\nשעורי הבית: \nגליון שבועי של 6 שאלות, לרוב כבדות מאוד וארוכות. כמעט הכל אצלנו היה ממוחזר מסמסטרים קודמים. החל מגליון 3-4 לגמרי דומות לשאלות שמופיעות במבחן אז מומלץ להשקיע מאמץ ולפתור לבד, ואת מה שלא לוודא בכיתה הפוכה.\n\nהמבחן: \nלא קל - יש חריגים אבל בגדול בפורמט די קבוע עם סגנון שאלות טכני מאוד שחוזר על עצמו. הנוסחאון שהקורס מספק מפנק לגמרי וברוב המקרים מספיק לזהות את הנוסחא שצריך להשתמש בה ולא מעבר. דורש כמה ימי למידה טובים, לראות כמה שיותר סוגי שאלות ולסכם בדפים שמרשים להביא איך פותרים כל סוג שאלה.\n\nהשורה התחתונה: \n\nכנראה הקורס הכי לא אפוי שעשיתי בטכניון, בטח ביחס לקורס של 5 נק\"ז. משקיעים המון זמן (בערך שליש קורס ועוד בהתחלה ששומדבר לא ברור) בללמוד לעבוד עם טנזורים ואז בקושי משתמשים בהם לאורך רוב הקורס או במבחן. בפועל רוב ההתעסקות היא לקחת כלים של מד\"ח ולהשתמש בהם בשביל לפתור בעיות מפיזיקה 2פ. החלק האחרון של הקורס שעוסק באלקטרודינמיקה וקרינה מאוד מרענן ומציג דברים שלא רואים עדיין בשום מקום אחר, אבל מוקדש לו מעט מאוד זמן.\nההרצאות והתרגולים המוקלטים הם הדבר הכי כבד שיצא לי לעשות עד כה - 4 שעות שבועיות (לפעמים יותר ובלי הפסקות כי רזמט הקליט אותן בלי קהל) של פיתוחים מתמטיים סבוכים שצריך לדעת לעשות בעצמך אחרי בשביל הגליונות והמבחן. הבעיה העיקרית היא באמת הזמן - לראות את המוקלט לרוב לוקח יותר מהרצאה רגילה במידה ואתה רוצה להבין משהו מההקלטות, ולא מסיימים ב-4 שעות את הגליון השבועי - בקיצור הקורס מאוד עמוס.\nחשמל-פיזיקה שמתלבטים בין זה לבין שדות - ממה ששמענו מחשמל שעשו, הוא נשמע הרבה יותר עדיף ורלוונטי.", "timestamp": 1657642557133}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "אם אתם בחשמל פיזיקה ומתלבטים בין אלקטרו לבין שדות - לא שווה את זה! לכו לשדות", "timestamp": 1657805541468}, {"author": "הסנטור אמסטרונג", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "החוות דעת הזאת לאנשים שבהנדסת חשמל פיזיקה. בתור אחד שבדק ממש לעומק את העניין של איזה קורס לקחת, ממליץ לקרוא את הסיכום שיחסוך לכם את כל הבדיקות האלה.\n\nשם המרצה: \nחגי פרץ, בפועל הקלטות שלמה רזמט\nחוות דעת - הרצאות: \nהקורס היה כאילו כיתה הפוכה, עם ההקלטות של שלמה רזמט משנה הקורנה. אתחיל קודם כל עם החוות דעת על ההקלטות:\nשלמה הוא אחד המרצים הטובים שהיו לי, רמת ההבנה וההשקעה שלו בהרצאות היא פסיכית. בשנה שהוא העביר, הוא הוסיף בחודש הראשון של הקורס נושא של איך עם מעט מאוד הנחות של יחסות ותורת שדות מגיעים, למשוואות מקסוול. חלק סופר מעניין. שאר הקורס שהוא \"אלקטרו קלאסי\" לדעתי הרבה פחות מעניין וסוג של חזרה על 2פ עם מד\"ח הפעם.\n\nחגי היה האחראי וההתנהלות של הקורס הייתה ביזיונית, בחלק של היחסות עוד הוא הבין בשאר הקורס נראה שלא באמת.\n\nחוות דעת - תרגולים: \nהיו תרגולים מוקלטים מסמסטר קורונה שהיו לא משהו כל כך. המתרגלים של הסמסטר שהיו לנו הרגיש שלא ידעו בכלל את החומר ושאין למי לפנות.\n\nשעורי הבית: \nהשיעורי בית קשים וארוכים רצח. לוקחים הרבה שעות טובות בשבוע, תתכוננו שיש לזה חתיכת תחת שצריך לשים על זה.\n\nהמבחן: \nבכללי ברוב השנים הרגיש די טכני, ושאפשר ללמוד איך לפתור אותו ולהקיא על הדף. אצלנו צוות הקורס החליט להוריד ממוצע, ועשה את הבדיקה הכי הזויה שראיתי בחיים שלי, הוריד על פאקטורים מספריים, וזה ששכחת קבועים המון נקודות למרות שברוב המבחנים לא מורידים על דברים כאלה בכלל.\n\nהשורה התחתונה: \nהסגל הכי נוראי שהיה לי, בדיקת מבחן הזויה, יחד עם תחושה שלא יודעים לעזור בחומר בכלל.\n\nעכשיו למתלבטים שבפיזיקה חשמל, אני אפתח בזה שאני במסלול וזה אחד הציונים הנמוכים שלי בתואר עד כה. \n\nקודם כל אם אתם שוקלים אפילו קצת תואר שני בפיזיקה, קחו אלקטרו. זה קורס קדם למלא קורסים של תואר שני בפקולטה, אתם תצטרכו להשלים אותו אם לא תעשו. גם אם אתם לא חושבים על תואר שני, תבדקו שבבחירה שאתם רוצים בפיזיקה זה לא קדם חיוני, כי שדות של חשמל לא קדם חליפי בפקולטה.\n\nלרוב שנשארו שזה לא רלוונטי אליהם, אני חושב שהחודש הראשון של הקורס על יחסות ותורת שדות הוא מהמעניינים בתואר. אם זה נשאר גם סמסטר הבא, למרות שככל הנראה חגי עם ההקלטות של שלמה כבר לא יהיו, הייתי לוקח את הקורס בטוח. אחד הדברים היפים בתואר לדעתי, למרות ההשקעה בזמן הסמסטר והציון הנמוך זה שווה את זה.\n\nאם החלק הזה יורד, וחוזר כמו שהיה ב2018 וקודם, להיות \"אלקטרו רגיל\", לא הייתי לוקח את הקורס. החלק שהוא האלקטרו עצמו טכני ולא כל כך מעניין ואפשר בכיף ללמוד אותו מחשמל ב10% של העומס. סמסטר 4 הוא גם הכי קשה ועמוס שהיה לי בתואר בפער (וזה בלי מעבדה 1א) אז זה נאוד משמעותי. \nשדות של חשמל בלי הגשות חובה בכלל, בעוד שאלקטרו יש 8 עד 10 שעות עבודה על שיעורי בית שזה הבדל גדול מאוד.\n\nשורה תחתונה, הייתי לוקח אלקטרו רק אם החלק של תורת שדות ויחסות נשארים אם לא או שזה קדם שאתם חייבים למשהו, אחרת לא הייתי לוקח.", "timestamp": 1658518164465}, {"author": "לורנץ", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יותם שורק\nחוות דעת - הרצאות: ההרצאות לא הכי ברורות, גם בגלל החורמ הדי מסובך וגם בגלל שיותם קצת מפוזר, גם כתב לא ממש ברור וגם הרבה אי ודאויות על סימנים ופקטורים. עושים הרבה מעברים מהירים בביטויים ארוכים שנראים לו מובנים מאליהם אבל לסטודנטים הם טיפה יותר מסובכים. יותם נחמד בסך הכל, אבל לא הייתי ממליץ ללכת להרצאות שלו אלא למוקלטות של רזמט. \n\nשם המתרגל/ת: שי קפון\nחוות דעת - תרגולים: מתרגלת טובה. בתרגולים שלה נסגרים יותר טוב על החומר, ויש אווירה נחמדה. מצד שני אחרי הבוחן אמצע עם הממוצע 30 הייתה אווירה קצת עכורה, בלי הרבה לקיחת אחריות של הסגל.\n\nשעורי הבית: גליון שבועי. ארוך, רובו בר רפרונס, אבל עוזר טיפה להטמיע את החומר.\n\nהמבחן: תכלס הלמידה למבחן היא מה שמלמדת הכי טוב. יש הרבה מרצי עבר לקורס ויש הרבה סגנונות של מבחני עבר. במבחן שלנו יותם נתן מבחן שלא ממש מתאים ל3 שעות אלא ל4 או 5 עם פיתוחים ארוכים כאורך הגלות בסעיפים עם מס' נקודות שלא מצדיק את זה. לא סתם הממוצע הוא הנמוך מזה שנים, וזה עוד אחרי פקטור 10%, ו20% של השיעורי בית.\n\nהשורה התחתונה: אחד הקורסים המעניינים שיש, אבל הוא קשה גם מבחינת התנהלות של הצוות וגם מבחינת החומר עצמו. אם אתם חשמל פיזיקה ושאלתם את עצמכם אם לקחת שדות או אלקטרו, קחו שדות", "timestamp": 1691047896662}, {"author": "Tamir Manoach", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: שורק יותם\nחוות דעת - הרצאות: מרצה גרוע. אל תעשו את הקורס איתו\nכוונות טובות, ביצוע... יש הרבה לרצות\n\nשם המתרגל/ת: שי קפון\nחוות דעת - תרגולים: הסגל עצמו נוראי בשנה הזאת\nמבין כל האפשרויות היא בסדר, אבל היא לא מתרגלת טובה.\n\nשעורי הבית: כל שבוע, חייבים רפרנס של משהו בכדי לנסות לפתור, קשה ממש, קורס לא קל\n\nהמבחן: עדיין קשה מאוד\n\nהשורה התחתונה: אל תעשו את זה, תעשו שדות", "timestamp": 1691500596305}, {"author": "אורן ברגמן", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יותם המלך\nחוות דעת - הרצאות: מלך. גבר. \n\nשם המתרגל/ת: שי קפון\nחוות דעת - תרגולים: לא כל כך הבנתי למה חלק גדול מהתרגולים מכסה הוכחות של דברים מיותרים שלא נפגוש לא במבחן ולא בשיעורי בית שיכולים פשוט לשלוח לנו לינקים להסתכל בספרים. אין רשימות וזה קצת מבאס כי יש סטודנטים שפשוט שונאים לרשום חוץ מזה אחלה שי.\n\nשעורי הבית: \nהשיעורי בית הכי כיפים והי עניינים שהיו לי הסמסטר אם משווים ללכסון של מטריצות בקוונטית. ממש עוזרים לראות שאתה באותו קו עם החומר.\nהמבחן: \nתפיסה לא נכונה של כמה זמן אמור לקחת מבחן.\nהשורה התחתונה: פיסיקה 2פ על סטרואידים. מדהים. גאוני. תמשיכו ליחסות כללית בעתיד. אל תעשו בכלל תואר אם אתם לא עושים את הקורס הזה מה אתם עושים פה לכו להומניסטים או מדמח או משהו...", "timestamp": 1692005784756}, {"author": "אף מיו ני", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יותם שורק\nחוות דעת - הרצאות: הוא מתלהב מהחומר ואוהב ללמד, יש לו כוונות טובות, הבעיה היא שהוא לא מרצה טוב, הוא מאוד מבולגן ולא מסביר טוב, אני מקווה שישתפר וישחרר רשימות מסודרות, עובד ביחידות שבהן כמעט כל קבוע הוא ביחידות של 1, פעם מהירות האור נמצאת במכנה של ביטוי מסוים, פעם אחרת היא במונה של אותו ביטוי ובריבוע, הבלאגן של הפלוסים והמינוסים חוגג.\nאני מאוד מקווה שיותם יסדר רשימות שכוללות ביטויים מסודרים ומוגדרים היטב ללא הבלבול שהוזכר לעיל.\nכדאי להשיג הקלטות של שלמה רזמט.\n\nשם המתרגל/ת: שי קפון \nחוות דעת - תרגולים: מתרגלת סבירה בכל המובנים, לא גרועה ולא טובה, מסרבת להעלות רשימות של התרגולים למודל.\n\nשעורי הבית: קשים אם לא מרפרנסים אבל מלמדים הרבה, לפעמים קשה להבין את הרפרנס כשמרפרנסים.\n\nהמבחן: \nאחרי פיקטור רציני ומוזר עדיין היה ממוצע מזוויע במועד א וגם במועד ב, לפני פקטורים הממוצע היה נכשל בשני המועדים, ממוצע בוחן האמצע שווה למידת הנעליים הממוצעת של ילד סיני בן 5.\n\nהשורה התחתונה:\nהחומר עצמו מאוד מעניין- אחרי שלומדים את תורת האינדקסים, שזה חומר טכני, מעצבן ומבלבל אך שימושי, הקורס מציג נקודת מבט מאוד מעניינת על העולם.\nכשלמדתי מהסגל את החומר לא אהבתי אותו בכלל, התאהבתי בחומר כשלמדתי אותו לבד.\nבתור סטודנט במסלול חשמל פיזיקה אני שמח שבחרתי בדרך הקשה, אבל אני גם רוצה תואר שני בפיזיקה.\nחשמל פיזיקה- אם אתם רוצים תואר שני בפיזיקה, אתם חייבים לקחת את הקורס הזה.\nלגבי חשמל פיזיקה שלא רוצים תואר שני בפיזיקה- שדות זאת אופציה מפתה, יכול להיות שזאת גם האופציה השפויה יותר, אני אישית חושב שהקורס מאוד יפה, שווה לבדוק מי הסגל לפני שלוקחים כי סגל רע הורס את הקורס לכולם והורס לכם את הממוצע.\n\nאנשים ממסלולים אחרים שיכולים לוותר על אלקטרו איכשהו - אין לי עצה טובה לתת לכם מעבר לעצות שנתתי לחשמל פיזיקה.", "timestamp": 1711281240783}]}