{"posts": [{"author": "natan borkowski", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: הגר\nחוות דעת - הרצאות: אחלה מרצה שבעולם!!!    החזירה לי את אהבה לפיזיקה שנעלמה בפיזיקה 1מ\n\nשם המתרגל/ת: משה\nחוות דעת - תרגולים: תותח\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597844699793}, {"author": "בועז", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: וידיאו\nחוות דעת - הרצאות: ההרצאות של סילביה בוידיאו מוצלחות, מובנות ומסודרות, עד כמה שהקורס הזה יכול להציע.\n\nשם המתרגל/ת: וידיאו וגל גומפל לסירוגין\nחוות דעת - תרגולים: המתרגל בוידיאו רץ מאוד מהר וגל די איטי. הפתרון היחיד שעבד לי הוא לעבור על ה-PDF לבד ולפתור בעצמי.\n\nשעורי הבית: יחסית מלמדים, אבל גם מאוד מעיקים.\n\nהמבחן: סביר. יש המון חומר, אבל אם פותרים מספיק מבחנים לפני, מצליחים להוציא ציון לא רע. די חוזר על עצמו.\n\nהשורה התחתונה: קורס נחמד. היה לו פוטנציאל הרבה יותר גדול (pun not intended), אבל הוא נוגע בכל הדברים החשובים שצריך לדעת בנושאים של חשמל וגלים.", "timestamp": 1598025276161}, {"author": "פיסיקה 2ממ", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nלגבי המרצה והמתרגל לא אביע דעה, מכיוון שבסמסטר הקורונה לא נוצרה לנו אינטראקציה איתם בכלל עד למבחן.\n\nשעורי הבית: הוגנים. יש הרבה ניסיונות לפתור כל גיליון במודל, אז אפשר להיות רגועים ולהוציא בהם ציון מקסימאלי. חשוב לעבור על התרגולים היטב.\n\nהמבחן: הוגן, הכנה טובה משנים קודמות תעזור מאוד.\n\nהשורה התחתונה: קורס עמוס בחומר. חשוב לדעת שאם לוקחים אותו במקביל לחדוא 2ת, לומדים הרבה אנליזה וקטורית כבר בתחילת הקורס (משפט גאוס ומשפט סטוקס) אז לא להיכנס לשוק בהתחלה, כי כשמגיעים לסוף הסמסטר האסימונים נופלים יפה וכבר מצליחים להבין לבד מושגים כמו שטף וכו'...", "timestamp": 1598287889111}, {"author": ",", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: סילביה (מרצה בוידאו)\nחוות דעת - הרצאות: מרצה מעולה. מלמדת את החומר בצורה יסודית עם הדגמות ופיתרונות לשאלות רבות. חלופה מעולה למי שרוצה לעבור לוידאו (אצלנו לא היתה ברירה)\n\nשם המתרגל/ת: יובל בוידאו\nחוות דעת - תרגולים: מריץ מהר מאוד את התרגולים ופותר מלא שאלות. מריץ חדווא 2 ולא מסביר את המעברים. אבל בסך הכול מתרגל טוב. לדעתי שווה ללכת לתרגולים הפרונטליים במידה וקיימים. \nשווה ללכת לשעת קבלה שבועית ולשלוט בחומר לכל אורך הסמסטר. ככה אפשר להצליח בקורס בצורה טובה. שיעורי בית ארוכים בדרך כלל, אך חשוב לעשות אותם כדי להבין את החומר כמו שצריך. 12 גיליונות שאצלנו 10 גיליונות היוו מגן של 25%. \n\nהמבחן: מבחן בדרך כלל קשה, אבל אם יושבים כמו שצריך במהלך הסמסטר ומבינים את החומר+ מתרגלים כמו שצריך בתקופת מבחנים אפשר להצליח.  וזה שווה את ההשקעה. 5 נק\"ז. \n\nהשורה התחתונה: קורס עמוס מאוד, אבל עם השקעה מתמשכת לכל אורך הסמסטר, אפשר להצליח בצורה טובה. לא לוותר על נושאים ולהבין את הדברים. בסך הכול חומר קורס מאוד מעניין.", "timestamp": 1598296014960}, {"author": "ב", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: במוקלט- סילביה\nחוות דעת - הרצאות: מהממת\n\nשעורי הבית: סבירים ואפשר לסיים במספר שעות אם מבינים החומר היטב בהרצאות ובתרגולים\n\nהשורה התחתונה: קורס יפה ומעניין, עמוס מבחינת חומר (יש בו יותר מדי נושאים). צריך השקעה להבנת החומר לעומק.", "timestamp": 1598531507371}, {"author": "אורי", "difficultyRank": 3, "generalRank": 4, "semester": "201903", "text": "שם המרצה: סילביה מהוידאו/יורם רוזן\nחוות דעת - הרצאות: סילביה מרצה מדהימה, מסבירה כמעט הכל ממש ברור. הקושי היחיד שלי איתה היה בהסברים של הדברים המתמטיים (דיברגנץ, רוטור, כאלה) אבל פשוט ראיתי סרטונים אחרים ביוטיוב שהשלימו לי את הפער. יכול להיות שזה נבע מהעובדה שלא עשיתי חדוא 2 אלא אינפי 2מ.\n\nשם המתרגל/ת: יובל מהוידאו\nחוות דעת - תרגולים: מתרגל סבבה, מסביר ברור.\n\nשעורי הבית: פחות קשים משיעורי הבית של פיסיקה 1מ' לדעתי - או לפחות לוקחים פחות זמן. ייתכן שזה בגלל שהיה סמסטר קיץ מקוצר. אף על פי כן, כל תרגיל בית לוקח 3-4 שעות ועלול לקחת אפילו יותר ויש 13 כאלה. בקיץ זה לא נורא כי אין עומס מקורסים אחרים.\n\nהמבחן: המבחנים די קשים. יש מרצים שעושים מבחנים אמריקאים ויש כאלה שעוסים מבחנים עם שאלות פתוחות. באמריקאיים השאלות קצת יותר קלות אבל יש יותר מקום לטעויות\n\nהשורה התחתונה: קורס ממש מעניין לדעתי, שמלמד פיזיקה ממש מגניבה. מה שהופך אותו לקשה בעיניי אלה הנושאים הרבים בקורס ואיך הרבה דברים קשורים ליחסות, שזה נושא מבלבל בפני עצמו", "timestamp": 1601204276394}, {"author": "יצחק ספוקויני", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה:  סילביה (הקלטות כי קורונה, יורם רוזן מרצה אחראי)\nחוות דעת - הרצאות: מסבירה טוב, קצת לא נכנסת לפרטים לפעמים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הכי טוב שיכול להיות. ברמה של החומר וכמות סבירה. מאוד עוזרים להבנה של החומר.\n\nהמבחן: \nהיה בזיון. שלוש שאלות נפסלו כי היה בהן טעות כי הסגל התעצל לעבור על המבחן בצורה רצינית לפני.\nהשורה התחתונה: \nחומר בסיסי ודי מעניין הפותח את כל עולם החשמל. קשה בהתחלה למי שעוד לא עשה חדווא 2 (רוב האנשים) כי משתמשים המון באינטגרלים ובמשפטים מסוף חדווא 2 להוכחות (סטוקס וכו'...)", "timestamp": 1603212801945}, {"author": "FedEx", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: סילביה בוידאו (בפועל המרצה האחראי היה יורם רוזן)\nחוות דעת - הרצאות: סילביה די טובה (לא היו הרצאות בלייב בכלל, אז אין כל כך איך להשוות אותה להרצאה בלייב)\n\nשם המתרגל/ת: מתחלף\nחוות דעת - תרגולים: בחצי סמסטר הראשון ראינו וידאו של יובל, שהיה לא הכי ברור (בעיקר כי כנראה שזה צולם בקיץ ולכולם כבר היה את הבסיס המתמטי מחדווא 2 ומאינפי מד\"ר, והרבה פעמים הוא מדלג על פיתוחים מתמטיים שלא טריוויאלים כל כך). בחצי הסמסטר השני (אחרי הרבה תלונות שלנו) היה מתרגל שונה פעם בשבוע שהעביר תרגול בלייב... ממה שזכור לי, גל וליאת היו הכי טובים.\n\nשעורי הבית: גיליון פעם בשבוע, די קשים אבל יש להרוב רפרנס.\n\nהמבחן: מזעזע- במועד א' נפסלו שתי שאלות (אחת אחרי שעתיים במבחן ואחת בדיעבד) בגלל שהתשובה הנכונה לא הופיעה, ועוד לפחות 2-3 שאלות עם ניסוח בעייתי (שאיתן לא קרה כלום). מועד ב' גם היה זוועה, אבל לפחות מקוון.\n\nהשורה התחתונה: קורס על הפנים- אם לא חייבים מומלץ לא לעשות.", "timestamp": 1607385101858}, {"author": "לא חשוב", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: סילביה/יורם בנושא גלים\nחוות דעת - הרצאות: סילביה מרצה מעולה, עוברת על החומר באופן יסודי ומסודר. בסמסטר זה נושא הגלים הועבר באופן מורחב יותר כך שההרצאות שלה לא רלוונטיות ולכן עברתי בשבועיים האחרונים ליורם. יורם עובר מהר על החומר מבלי לתת הרבה דוגמאות ולא מסודר. בכל אופן רואים שאכפת לו מהסטודנטים ושהוא אוהב ללמד ולהתעסק בפיזיקה.\n\nשם המתרגל/ת: אנטולי \nחוות דעת - תרגולים: מתרגל מעולה, מסביר את החומר טוב ולאט \n\nשעורי הבית: 12 גיליונות, צריך להגיש 10 כדי לקבל את מלוא המגן (25%)\n\nהמבחן: המבחן אמריקאי, היו שאלות ברמות שונות, שתי שאלות עם נוסח לא ברור ושאלה אחת בנושא שלא למדנו\n\nהשורה התחתונה: בקורס יש כל כך הרבה נושאים וקל מאוד ללכת לאיבוד, אבל אם נשארים במעקב כל הסמסטר ומתרגילים המון לפני המבחן, אין סיבה שלא תקבלו ציון גבוה", "timestamp": 1612175995014}, {"author": "ניר אלפסי", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: הרצאות קצת מבולגנות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: הזוי לגמרי\n\nהשורה התחתונה: אם יש אפשרות - אל", "timestamp": 1616361917456}, {"author": "Eden Ninary", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין על חנה\n\nשם המתרגל/ת: הקלטית של יובל \nחוות דעת - תרגולים: היוא מסביר מעולה!\n\nשעורי הבית: יש רפרנס מעולה \n\nהמבחן: מועד א היה בלתי פתיר. עדיין לא קיבלתי ציון אבל אני לא מצפה לעבור את ה20. היה פשוט בזבוז של זמן לגשת למבחן הזה\n\nהשורה התחתונה: באסה", "timestamp": 1626867464596}, {"author": "סטונדט", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מדהימה ומסבירה ברור.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: מתרגל טוב, יודע את החומר ועונה לשאלות. \n\nשעורי הבית: לא מועילים, בזבוז זמן אחד גדול הכל מרופרנס\n\nהמבחן: הזוי מאוד, שאלות לא קשורות לכלום ומתחכמות ככה זה שגל גומפל כותב את התרגילים.\n\nהשורה התחתונה: קרוס חובה אז אין יותר מידי מה לעשות.", "timestamp": 1626957125609}, {"author": "עוד סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה טוב,מסבירה ועניינית.\n\nשם המתרגל/ת: לא היה לי באמת מתרגל טוב בפיזיקה 2ממ.\nחוות דעת - תרגולים: התרגולים די מוזרים, המתרגלים בדכ לא מספיקים אותם.\nהרגשתי שהם היו מיותרים לאורך הסמסטר והלמידה האמיתית היא לפני המבחן שם מתחילים לקלוט דברים\n\nשעורי הבית: הזויים, רמה קשה מאוד חלקם עם פיתוחים מתמטיים מיותרים.\nהכל מרופרנס לא מלמד כלום גם אם אתה מנסה לבד.\n\nהמבחן: הזוי ובזוי, לוטו על אמת.\nהפקולטה לפיזיקה מוכיחה פעם נוספת שהיא שמה אלף ז** על הסטודנטים ומייצרת מבחנים שלא באמת בודקים שום הבנה וכמובן שזה אמריקאי אז טעית בדרך, לך תחפש אותנו.\n\nהשורה התחתונה: עד מתי פקולטה לפיזיקה", "timestamp": 1627897474191}, {"author": "Royses1", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה בחורה נורא חביבה, את רוב הנושאים מעבירה בצורה מצוינת אם כי פה ושם מרגיש שגם לה אין תשובות מספקות לכל דבר, ולפעמים עושה מעברים לא טירוויאלים אבל זאת כבר תופעה של כל מרצה בפיסיקה. ממליץ ממש על דפי ההרצאות שלה, אני לפני כל שיעור הגעתי מוכן עם דפי ההרצאות ולמדתי רק מהן כל הסמסטר וגם לקראת המבחן.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: בחור ממש טוב, יש לו לב רחב, אכפת לו ממש מהסטודנטים והוא באמת מתאמץ לתת מעצמו למען הסטודנטים. הבעיה היא שלטעמי גם לו אין תשובות מספקות לכל דבר וגם הוא קצת \"מקריא\" מהדפי תרגול בצורה יבשה ללא ערך מוסף(אגב זאת בעיה של כל המתרגלים בקורס), אבל הוא באמת מתאמץ לעזור ולענות אם שואלים אותו.\n\nשעורי הבית: יש גיליונות קשים יותר ויש פחות, באופן כללי הגיליונות לוקחים פחות זמן מפיסיקה 1מ' אבל בכל גיליון יש איזה שאלה או שתיים קצת מצוצות מהאצבע שהתפתתי להסתכל כבר ברפרנס(כן, יש רפרנס מטורף לגמרי לכל השב).\n\nהמבחן: במבחן שלנו היו 12 שאלות אמריקאיות, הייתי אומר ש8 מתוכן היו סטנדרטיות(כלומר, ראינו דברים דומים אם לא זהים בתרגול או בשיעורי הבית) ועוד 4 שאלות שהצריכו הבנה פיסיקלית טובה מאוד\\סתם לחשוב הרבה. מבחן די קשה אבל עדיין בגדר ה-\"הוגן\".\n\nהשורה התחתונה: קורס קשה, אני נעזרתי הרבה בספר הקורס של Purcell כדי לפתח הבנה פיסיקלית טובה מספיק, הרגשתי שלפעמים ההרצאות\\תרגולים לא הספיקו בשביל ההבנה האמיתית.\nקורס די מעניין באופי שלו והיו נושאים שממש התלהבתי מהם אבל מצריך עבודה מאוד קשה במהלך הסמסטר כדי להגיע לרמה גבוהה.", "timestamp": 1630335070785}, {"author": "יקיר לוגסי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מרצה מעולה, כפי שכל מי שעובר איתה קורס פיסיקה יודע. אומנם לעיתים החומר קשה ברמה בלתי נסבלת, במיוחד לאור העבודה שהרבה ממנו מבוסס על כלים מתמטיים שהסטודנטים לומדים בקורסים מקבילים, אז קשה לראות את התמונה הגדולה מיד, אומנם חנה היקרה משתדלת להעביר את החומר כמו שצריך, חוזרת על הדברים בסבלנות אדירה, בליויי הדגמות מעניינות והומור משובח. אם יש לכם אופציה לקחת איתה את הקורס, סעו לשלום.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: חד משמעית המתרגל הכי רציני שפגשתי בשנתיים לימודים בטכניון. מלבד לכך שהוא פשוט קסם של בחור, הוא מתייחס לעבודה שלו ולסטודנטים שלו באופן שובה לב, וחשוב לו מאוד להעביר האינטואיציות (מה שקריטי בקורס כזה). \nתמיד אפשר למצוא איתו זמן כדי לקבל הסבר נוסף או להתעמק איתו על הדברים בכיף, והוא תמיד יזכור להחזיר לך תשובות על שאלות שנשאלו, גם אם אין לו אותם כרגע.  \nדניאל אתה המלך.\n\nשעורי הבית: חלקם נעימים יותר ופחות, יש רפרנסים.\n\nהמבחן: אמריקאי לחלוטין, בעיני המועד שלנו היה הוגן מבחינת הרמה והנושאים שנשאלו.\n\nהשורה התחתונה: לאלו מכם שהקורס חובה, אין לי מה להגיד.\nלאחרים - קחו אותו רק אם באמת יש לכם עניין ותשוקה בפיסיקה של האלקטרומגנטיות (אחרת קחו פיסיקה 2 רגיל או לא בכלל) בגדול הקורס באמת מרהיב למי שמתעניין, אבל ממש לא לכל אחד.", "timestamp": 1632301445305}, {"author": "גבי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה טובה, חזקה מאוד בחומר - לפעמים העמיקה בתאוריה יותר ממה שהיה נחוץ.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים:  מתרגל מעולה, נתן הרבה אינטואיציה וגישה לפתרון בעיות. היה מאוד זמין לעזרה.\n\nשעורי הבית: לא קלים, אבל עוזרים\n\nהמבחן: קשה. ממש מומלץ ללמוד ממבחני עבר.\n\nהשורה התחתונה: הקורס מאוד עמוס וקל ללכת לאיבוד בחומר, מומלץ להיעזר במתרגלים", "timestamp": 1634725770247}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גאי בונין\nחוות דעת - הרצאות: משתדל להיות מעניין, לא משחרר רשימות הרצאה\nמתרגלים: כולם מקריאים אותו דבר ליאת הייתה סבבה פתרה בכוחות עצמה בלי להשתמש בדף\nשעורי הבית: מעייפים, כל שבוע מרפרס מחדש\n\nהמבחן: באסה\n\nהשורה התחתונה: עובר וממשיכים", "timestamp": 1635083893106}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין על חנה\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: מתרגל מעולה\n\nשעורי הבית: שימוש חזק ברפרנסים\nהמבחן: משחק הניחושים\n\nהשורה התחתונה: קורס רע. רוב הזמן מתעסק במתמטיקה שעדיין לא יודעים אם הולכים לפי המומלצת, ורק לקראת הסוף דברים מתחילים להסתדר כמו שצריך.", "timestamp": 1635425391192}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: גיא\nחוות דעת - הרצאות: אוהב את החומר, חבל שאין רשימות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מלא\n\nהמבחן: אמריקאי קשה ולא הוגן\n\nהשורה התחתונה: באסה", "timestamp": 1641472842286}, {"author": "עמרי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: חנה תותחית. המרצה הכי טובה בטכניון\n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: מתרגל סבבה. מאחר כרוני. לרוב לא מספיק להעביר את כל התרגול הכתוב", "timestamp": 1642801450458}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: הרצאות איכותיות, מעבירות את החומר מצויין. \n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: טובים, יש הסברים ברורים והמתרגל מתעקב על מה שקשה. \n\nשעורי הבית: ארוכים, מייגעים, מאוד מאוד מפתה לרפרנס. תשתדלו שלא כי זה מתכון ללכת לאיבוד בחומר.\n\nהמבחן: לא קל. בסמסטר שלנו היה מבחן סביר יחסית, אבל עדיין היה צריך ללמוד ארבעה חמישה ימים לפחות כדי לקבל ציון טוב. \n\nהשורה התחתונה: מי שחייב, חייב. בתור אחד שלקח את הקורס כבחירה, ממליץ רק למי שאוהב פיזיקה ולא מפחד מאינטגרלים. יש הרבה נושאים שלא מתעסקים בהם בפיזיקה 2 (לפחות לפי התקציר בצ'יזפורק) ככה שאם אתם באמת מתעניינים, ממליץ בחום על הקורס. כל מי שמחפש רק לסגור שרשרת מדעית לכו ל-2 ו-3, באמת שבשבילכם אין טעם.", "timestamp": 1643641099946}, {"author": "Omer Huly", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ד\"ר חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מרצה מעולה! מסבירה ברור ומתעכבת היכן שצריך. עונה על כל שאלה עם חיוך. נחמד להגיע בעיקר כשיש הרצאות עם הדגמות.\n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: התרגולים חשובים מאוד להבנת החומר ויודעים להבליט את הנקודות החשובות בתרגילים כהכנה למבחחן. \n\nשעורי הבית: הגשות שבועיות, תרגול טוב לקראת המבחן ורענון החומר במהלך הקורס.\n\nהמבחן: מבחן אמריקאי לא קל.\n\nהשורה התחתונה: קורס מדהים לחובבי הפיסיקה, אם אתם רוצים שיהיה לכם קל קחו פיסיקה 2.", "timestamp": 1644317933761}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה פשוט מעולה. מסבירה את החומר בצורה ברורה, מסודרת ומאוד מעניינת.\n\nשם המתרגל/ת: תרגולים מוקלטים של ליאת\nחוות דעת - תרגולים: התרגולים לא הרגישו לי כאלה נחוצים, בסופו של דבר היא פשוט כתבה על הלוח את מה שכתוב בקובץ התרגול אחד לאחד בלי לחדש משהו מעבר.\n\nמעבר לתרגולים הועברו גם סדנאות - הן מאוד מומלצות ובאמת תורמות להבנה של החומר והתמודדות עם המבחן\n\nשעורי הבית: בשלב מסוים פשוט ויתרתי על לנסות לעשות אותם וישר ריפרנסתי, לדעתי תרגילי הבית לא תורמים יותר מדי להבנה של החומר.\n\nהמבחן: הוגן לגמרי\n\nהשורה התחתונה: קורס מאוד מאוד מעניין, אבל עמוס בצורה לא הגיונית. \nאם הקורס לא חובה, עדיף לקחת פיזיקה 2", "timestamp": 1645117948010}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מדהימה.\n\nשם המתרגל/ת: פקל של עמית שלמה\nחוות דעת - תרגולים: לא ממליצה ללכת לתרגולים בכלל פשוט בזבוז של זמן. ממליצה על הפץל של עמית שלמה.\n\nשעורי הבית: סבירים\n\nהמבחן: חנה עושה מבחנים הוגנים\n\nהשורה התחתונה:", "timestamp": 1645720780317}, {"author": ":)", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה נהדרת, אכפתית מאוד ומעבירה את החומר בצורה מדהימה. מקפידה לעשות פעם בשבוע \"הרצאת ניסויים\" וההדגמות שהיא מציגה מאוד מעשירות. \n\nשם המתרגל/ת: ליאת נמירובסקי לוי (מוקלט מאביב 2021)\nחוות דעת - תרגולים: מתרגלת טובה מאוד והתרגולים המוקלטים שלה מעולים. מומלצת מאוד אם מעבירה פרונטלי. \n\nשעורי הבית: גליון מודל על בסיס שבועי. תורמים מאוד להבנת החומר.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: קורס מעניין, מכיל הרבה נושאים יפים ובהתאם עמוס מאוד.", "timestamp": 1646064872910}, {"author": ":)", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מדהימה. כל קורס שעשיתי איתה עד עכשיו נהנתי בהרצאות מאוד. עושה הדגמות וניסויים, עונה לשאלות, מסבירה ממש מעניין (גם את החלקים מהמתמטיים הקשים). אין על חנה!\n\nשם המתרגל/ת: מוקלט של ליאת נמירובסקי מסמסטר אביב 2021.\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה לעומק, תרגולים עמוסים ויש הרבה טריקים חשובים בתרגולים, אבל:\n\n* מאוד ממליצה לקחת את הפק\"ל של עמית שלמה לקורס!\nיש כל כך הרבה טריקים, קשרים ונוסחאות בקורס, ועמית באמת עושה סדר בהכל. כל המבחן פתרתי עם האיטואיציות שפיתחתי בפק\"ל.\n\nשעורי הבית: אמריקאי במודל, מרופרנס כמובן. שווה לנסות, אבל לא לשרוף סתם זמן, יש תרגילים מזוויעים.\n\nהמבחן: אמריקאי 12 שאלות. הוגן מאוד. יש שאלות מסובכות אבל בכנות רוב השאלות אצלנו היו ממש פתירות. \n\nהשורה התחתונה: אם לא חובה לא מומלץ לקחת. קורס עמוס מאוד. מצד שני, חומר מעניין וחשוב ברמה מתמטית גבוהה.", "timestamp": 1647076903622}, {"author": "-", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אחת המרצות הטובות בטכניון. ממש משקיעה ומסודרת. שווה ללמוד בהרצאה עם הרשימות הרצאה שלה הכל כבר כתוב שם.\n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: פתר את התרגילים מאפס ולא עבר על הפתרון הכתוב כמו שנוהגים חלק המתרגלים וזה יתרון משמעותי. החיסרון שהוא מאחר כל תרגול בצורה מוגזמת.\n\nשעורי הבית: גליונות במודל שמרפרנסים מהדרייב כמו פיסיקה 1מ.\n\nהמבחן: המבחן היה הוגן לדעתי. חשוב להכין דף נוסחאות טוב, הדף שהם נותנים לא עוזר בשיט. אפשר לקחת מהדרייב ולהוסיף דגשים ותרגילים שלא זוכרים איך לפתור. אצלנו נתנו להביא דף אחד משני הצדדים.\n\nהשורה התחתונה: בהתחלה החומר לא מובן בכלל אבל כשלומדים למבחן איכשהו זה מסתדר.", "timestamp": 1647212040918}, {"author": "המשמיד", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nאחלה הרצאות, חנה כמו שהיא אחלה מרצה גם ב-2ממ, בדומה לכל שאר הקורסים שהיא מעבירה. ההרצאות עצמן כן מרגישות יותר עמוסות ומפוצצות כיאה לקורס, אבל ההרצאות מאוד סבבה, וחנה הופכת אותן אפילו למהנות.\n\nשם המתרגל/ת: ליאת נמירובסקי\nחוות דעת - תרגולים: \nלא ככ הגעתי לתרגולים, כל קשר ביניהם לבין הקורס עצמו לפעמים מרגיש מקרי בהחלט. כן יש סיכומי תרגול שאולי איכשהו יעזרו בזמן עשיית השב, אבל ללכת תרגול שעתיים יהיה בזבוז זמן. עם זאת, ליאת היא מתרגלת מעולה ומאוד אחלה, אז אם כבר לכו אליה.\n\nשעורי הבית: \nגיליונות מודל שבועיים, חלקם קצת מונפצים ומבאסים אבל אחרים מאוד סבבה. סהכ הרמה של השב לא נפלה מהרמה של המבחן אצלנו, אז אם תשימו עליהם זמן סביר אמור להיות בסדר.\n\nהמבחן: \nבמקרה שלנו (יכול להיות שיצאנו בזול) שתי הבחינות היו מאוד מאוד הוגנות. חנה חיברה בחינות הגיוניות, שלא בשמיים ואז יהיה צורך לפקטר. המבחן עצמו אמריקאי, 12 שאלות עם 6 תשובות. אם אתם באמת תירגלתם מספיק, אין סיבה שלא תפגיזו, וזה מעולה כי זה קורס עם 5 נקז. \n\nהשורה התחתונה: \nאם אתם יכולים לקחת פיזיקה 2, קחו. אם חסר לכם נקז ובא לכם קצת אתגר, ממליץ ממש. אמנם הקורס יותר כבד ורחב לעומת פיזיקה 2, אבל הבחינה הייתה הוגנת מאוד.", "timestamp": 1647432433109}, {"author": "לי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעולה כרגיל!\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: מתרגל מעולה, אכפתי ועונה לשאלות בסבלנות.\n\nשעורי הבית: לרוב קשים, לי אישית היה קשה לפתור לבד אז מרפרנסים.. מה שכן לפחות לנסות להבין את הפתרון\n\nהמבחן: מבחן קשה, אבל חנה עשתה מבחן הוגן לגמרי\n\nהשורה התחתונה:", "timestamp": 1647780914180}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין מילים. חנה זאת חנה. מרצה מעולה באיכות ההוראה שלה. קשובה והוגנת לתלמידים הרבה מעבר למרצים אחרים. לא הרבה מרצים ממהרים לפרסם פתרון מלא ואיכותי למבחן בסוף יום המבחן עצמו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא השתתפתי. הפקל של עמית היה מספיק\n\nשעורי הבית: \nארוכים ומרופרנסים לחלוטין\n\nהמבחן: \nהמבחן של חנה היה הוגן מאוד\n\nהשורה התחתונה: יש ברירה?", "timestamp": 1648104591341}, {"author": "Majd Mansour", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מרצה מהממת. עונה על שאלות בצורה ישירה אך ההרצאות שלה חסרי דוגמאות לרוב ומפתחת את כל המשפטים התמטיים שלומדים (אין צורך.. הייתה יכולה לתת כמה דוגמאות בנושאים)\n\nשם המתרגל/ת: מוקלט של ליאת\nחוות דעת - תרגולים: התרגולים קשים אבל היא עוברת על הכל כמעט.\n\nשעורי הבית: קשים ברמת מבחן, לא פתרתי בעצמי.. רפרנס \n\nהמבחן: מבחני חנה הם סבבה בהשוואה למהחנים של מרצים אחרים אבל החומר קשה להבנה\n\nהשורה התחתונה: קורס מלא חומר קשה ועמוס, אם איבדתם במהלך הסמסטר יהייה קשה לעקוב. לא ממליץ לקחת את הקורס אם הוא לא חובה", "timestamp": 1648227695081}, {"author": "פוינטינג", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מעולה, מענייינת, מסודרת ותמיד שמחה להסביר שוב. \nהייתה גם המרצה האחראית בקורס ורואים שאכפת לה. \nבהרצאות לומדים את התיאוריה וגם יש קצת תרגול. יש גם מדי פעם ניסויים שממש עוזרים לתת אינטואציה.\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: \nנחמד, מסודר, גם שהתקלנו אותו בשאלות קשות אמר שיבדוק ויחזור אלינו ובאמת חזר. \nיש דפי תרגול ככה שכל המתרגלים מלמדים די באותו אופן.\n\nשעורי הבית: גיליון במודל פעם בשבוע.\n\nהמבחן: בדרך כלל המבחנים הרבה יותר קשים מהשאלות שרואים במהלך הסמסטר. המבחן הסמסטר היה הרבה יותר הוגן, חלק מהשאלות היו קשות אבל לחלוטין ברמה של הקורס.\n\nהשורה התחתונה: חלק מהקורס נובע גם מהקושי המתמטי שלו. סגל הקורס היה מעולה הסמסטר והרגישו את זה לכל אורכו.", "timestamp": 1648802469459}, {"author": "טיילור", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מדהימה, אולי המרצה הכי טובה בטכניון. מעבירה את החומר מעולה, עושה ניסויים והדגמות ומקפידה להסביר איך כל דבר שלומדים בא לידי ביטוי בעולם (הזוהר הצפוני זה מוטיב חוזר).\nהרשימות שלה הן מהטובות בטכניון, מומלץ מאוד לא לכתוב בהרצאות אלא לשבת עם הרשימות ופשוט להקשיב לה.\nלפעמים עושה קצת יותר מדי פיתוחים מתמטיים מסובכים ומיותרים, שבכל מקרה לא תבינו כי עוד לא הגעתם לחומר הזה בחדו\"א.\n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: גם בתרגולים וגם בסדנאות ראיתי אותו. כל המתרגלים בפיסיקה לא משהו, רובם מקריאים מהדף.\nגל יחסית פותר בעצמו ולפעמים נותן דרכים שונות ממה שכתוב בדפים. בחור נחמד וניכר שהוא יודע את החומר.\nהסדנאות מאוד חשובות לדעתי, יש שאלות עם קונספט שאין מצב להבין לבד.\nדבר אחד מאוד הפריע לי - גל חזר לאורך כל הקורס על זה ש\"תשובה 0 זה משהו שכותב השאלה הכניס רק כי הוא התעצל לחשוב על עוד תשובות, אני אף פעם לא נותן שאלה שהתשובה שלה היא 0\". קאט למועד ב', שתי שאלות טריקיות שהתשובה עליהן היתה 0 ונכנסתי לסרטים בגללו במבחן.\n\nשעורי הבית: קשים, מרופרנסים לחלוטין\n\nהמבחן: אמריקאי. חנה כותבת מבחנים הוגנים. באופן כללי השאלות במבחנים קלות יותר משיעורי הבית, כל שאלה מתמקדת בנושא ספציפי. אם לומדים טוב ורואים הרבה שאלות אפשר לקבל ציון גבוה מאוד.\n\nהשורה התחתונה: קורס מעניין ממש, חומר קשה אבל חלקים בקורס ממש העיפו לי את המוח. פער מתמטי משמעותי בגלל חדו\"א 2ת שנלקח במקביל, ממליץ ללמוד קצת על אינטגרלים בזמנכם החופשי בתחילת הסמסטר רק כדי להבין מה רוצים מכם. אם חנה מרצה אחראית אפשר להיות רגועים ולדעת שבסוף יהיה בסדר.", "timestamp": 1649862184641}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: יותר מדי פיתוחים מתמטיים לא רלוונטיים.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגל ממש טוב, עונה על שאלות, מסביר ברור.\n\nשעורי הבית: סבירים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657182555649}, {"author": "alyl603", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: טובה אבל ממהרת\n\nשם המתרגל/ת: ליאת\nחוות דעת - תרגולים: נהדרת\n\nשעורי הבית: בערך 1-3 שעות\n\nהמבחן: קשה\n\nהשורה התחתונה: אין ברירה", "timestamp": 1657184008896}, {"author": "ב", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הרצאות טובות. מעלה את הרשימות מההרצאות ששימושיות מאוד. יותר מדי פיתוחים מתמטיים לאורך ההרצאות וניסויים. פחות הסברים פיזיקליים. \n\nשם המתרגל/ת: דניאל מלר מוקלט\nחוות דעת - תרגולים: מצויין. מסביר טוב את האינטואיציה ולא מתעכב על חישובים.\n\nשעורי הבית: גיליון במודל. רובו פתיר אם ראית תרגול והרצאה כמ שצריך. אבל תמיד יש כמה שאלות מתוחכמות מדי שאין ברירה אלא לרפרנס\n\nהמבחן: \n\nהשורה התחתונה: בגדול פיזיקה זה מגעיל. אבל חייבים כדי להבין. ואפילו יש רגעים שזה נחמד.", "timestamp": 1657525531032}, {"author": "Roy", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה מרטסקניאן\nחוות דעת - הרצאות: אני מחזיק בדעת המיעוט שחנה לא מרצה טובה. כמרצה אחראית וכסגל בקורס היא באמת משקיעה בקורס, וברור שהיא משתדלת לעזור לסטודנטים כמה שיותר, אבל מבחינת ההרצאות בפועל, החומר פשוט לא עובר כמו שצריך.\nכיאה למרצה עם שם של מטריצה ותואר ראשון במתמטיקה, חנה חובבת פיתוחים אלגבריים שלוקחים עשרים דקות מזמן הרצאה, כך ש200 סטודנטים באולם יושבים מבולבלים, ולא נראה לי שמישהו לומד מזה פיסיקה. בדרך כלל התייחסות לפיסיקה עצמה היא אלמנט משני בהרצאות, וחבל כי פיסיקה זה מעניין וההרצאות של חנה לא.\nעם זאת בתקופת המבחנים גיליתי שיש לה מערך שלם של הקלטות נקודתיות שהיא פותרת בהן תרגילים ממבחנים בנושאים שונים. שם היא באמת זורחת וההקלטות האלה הרבה פעמים משמעותית יותר אפקטיביות מההרצאות ומהתרגולים יחד, חבל שגיליתי עליהן כלכך מאוחר.\nהמסקנה היא שאין מה לעשות ולנצח כולם ימשיכו ללכת להרצאות של חנה ולהיות מבולבלים מהקורס הזה שלא אמור להיות קשה כמו שהוא יצא.\n\nשם המתרגל/ת: דניאל לוזמוב\nחוות דעת - תרגולים:\nבאופן כללי התרגולים בנויים ככה שיש דף תרגול אחיד, עם 4 - 6 שאלות שכל המתרגלים עובדים לפיו. התרגילים לא הדרגתיים מספיק, ודי ארוכים, אז בפועל מספיקים בערך חצי מהם והסטודנטים יושבים מבולבלים בכיתה כל התרגול. המלצה אישית שלי היא לנסות לעבור מראש על דפי התרגול ולעשות אותם לבד, ואז להגיע לכיתה עם המתרגל ולהבין קצת יותר מה הולך ולשאול שאלות יותר טובות. גם אם לא מספיקים מראש, ממליץ לעשות את הדפים כל שבוע אחרי התרגול, זה עוזר לחומר לשקוע ולקראת שיעורי הבית.\nספציפית דניאל מתרגל סבבה, לא מדהים אבל גם לא רע. חוזר על החומר הרלוונטי ומתעכב על נקודות חשובות, למרות שלא תמיד מסביר בצורה הכי טובה. מה שכן קיבלתי רושם שבאמת אכפת לו מהסטודנטים, והוא תמיד עונה על שאלות ומסביר כל דבר שלא ברור.\n\nשעורי הבית: פסיכיים. לכאורה שיעורי הבית עם ציון תקף כדי שאנשים באמת ישבו ויפתרו תרגילים, בפועל חצי מהתרגילים הם אחד לאחד תרגילים מהרצאה ותרגול, כך שפשוט מעתיקים את התוצאה שכבר כתובה איפשהו, והחצי השני זה תרגילים בהיקף מעבר למה שראיתם עד עכשיו, אז בקושי פתירים. בפועל כמעט כל מי שאני מכיר מסתמך על רפרנסים (לא יודע איך הבחור שכותב אותם בכלל מצליח את כל התרגילים). כך או כך שיעורי הבית לא ממש עזרו להשתפר בחומר. מציע לנסות אותם בכל זאת, אבל אל תוציאו את הנשמה.\n\nהמבחן: לא מבין מה כל-כך קשה כשכותבים מבחן אמריקאי לעבור עליו יום לפני ולבדוק שאין טעויות בטפסים. בעיה חוזרת בפקולטה הזו וזה פשוט מביך (בשבילם) ומתסכל (בשביל הסטודנטים).\nמעבר לטעויות אנוש המבחן היה יחסית פתיר. בפועל המבחן לא בודק כמה אתם יודעים את החומר או משהו, אלא רק כמה טוב דף הנוסחאות שהבאתם וכמה אתם יודעים להשתמש בו. ממליץ לעבור לוודא שהדף שלכם מקיף מספיק ושאין בו טעויות.\n\nהשורה התחתונה: מרגיש כאילו הקורס מציב מכשולים בכוונה כדי שלא נצליח בו. אם יש לכם ברירה בנושא קחו את אחת הגרסאות הקלות יותר, אם אין ברירה אז אין ברירה.", "timestamp": 1658739152129}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה מרטיסקאינן\nהרצאות: המרצה הכי טובה בפער. משקיעה ונחמדה מאד לסטודנטים, סבלנית ועונה על שאלות עד שמבינים הכל לגמרי. גם בהרצאות מסבירה דברים לעומק, עם קצת יותר מתמטיקה מהנחוץ אבל אפשר פשוט להתנתק לכמה דקות ולחזור להקשיב כשמסתיימים הפיתוחים\n\nתרגולים: הקלטות של דניאל מלר - מומלץ מאד למי שמסוגל ורוצה ללמוד מהקלטות. התחלתי אצל ליאת אבל היה לי קצת קשה לעקוב אחריה, הרגשתי שהיא מעבירה את החומר בצורה משעממת יחסית ודניאל היה הרבה יותר מעניין, אפילו בהקלטות.\n\nשעורי הבית: גליונות במודל כל שבוע. יש רפרנסים בלי סוף, אבל כדי להיות מאופסים על החומר ולא לנחות רגע לפני המבחן כדאי לשבור על זה קצת את הראש ורק אחרי שמתייאשים לפתוח רפרנס.\n\nהמבחן: אמריקאי, 12 שאלות. חנה כותבת מבחנים ממש לגיטימיים, מועד א היה די קשה אבל היתה טעות בשאלה אז פיקטרו בקטנה. בגדול לעבור הרבה על מבחנים לפני יעזור להכיר כמעט את כל סוגי השאלות, והכי חשוב - דף נוסחאות טוב. יכול להציל ויכול להפיל.\n\nהשורה התחתונה: כל הסמסטר בקושי הבנתי מה רוצים מהחיים שלי עם כל האינטגרלים, אבל בלמידה למבחן שהיתה אחרי המבחן בחדו\"א2ת פתאום הכל נראה ברור והגיוני, אז לא להתייאש אם לא מבינים את ההגיון לאורך הסמסטר כי בסוף הכל מתחבר ביחד", "timestamp": 1658994941433}, {"author": "סטודנט בינוני", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: יותר מדי פיתוים מתמטיים בהרצאות, אבל תמיד משקיעה אקסטרה עם הסרטונים שלה או עם שעות קבלה ותמיד תעזור לכל מי שיבקש \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: ניסיתי כמה מתרגלים, כולם גרועים ללא יוצא מן הכלל.\nלא שולטים בכלל בחומר\n\nשעורי הבית: קשים, בגלל שאין רקע מתמטי דרוש לא מבינים בכלל מה הולך בהרצאות ובתרגולים וזה מתבטא בשיעורי בית.\n\nהמבחן: המבחן אצל חנה היה סביר לחלוטין. ראיתי גם מבחנים הרבה יותר גרועים אבל.\nבאמת תלוי מרצה איך המבחן יהיה, סביר או גיהנום\n\nהשורה התחתונה: לא מבינים כלום עד שבועיים לפני המבחן(לפחות מי שאין לו את הרקע המתמטי), שבועיים לסוף כבר מסיימים חדווא 2ת שמכסה את המתטיקה ואז עוברים על כל החומר מההתחלה ודברים מתחילים להתסתדר.\nלתרגל הרבה מבחנים, כי השאלות חוזרות על עצמן מבחינת רעיון", "timestamp": 1659021133904}, {"author": "עומר", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין על חנה\n\nשם המתרגל/ת: ליאת\nחוות דעת - תרגולים: מסודרת ומסבירה מעולה\n\nשעורי הבית: קשים מהמבחן, מי שפותר אותם לבד זה 100 בטוח.\n\nהמבחן: לא נורא.\n\nהשורה התחתונה: להשקיע בש\"ב ובדף נוסחאות וזה קורס של 100", "timestamp": 1660058706159}, {"author": "a", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה מרטיסקינאן\nחוות דעת - הרצאות: \nהמרצה הכי טובה שיש. עונה על הכל, מסבירה הכל ברור, נותנת דוגמאות והכי חשוב-זמינה לסטודנטים ברמות הכי גבוהות שאפשר לדמיין. כל שעת קבלה היא יושבת עד שהאחרון סיים לשאול והבין, מצלמת סרטוני עזר לתרגילים (חלקם לפי השעון באמצע הלילה!), עונה לכל מייל ולכל שאלה ואת הכל היא עושה עם חיוך ושמחה. היו טענות שבהרצאות לפעמים יש יותר מידי מתמטיקה, אבל מהחוויה שלי זה הקורס ואין לה כל כך הרבה ברירות, והיא כן יודעת מתי להגיד שזאת הוכחה מתמטית יותר (=>לא כזה חשוב) ומתי פיזיקלית יותר (=>קצת יותר חשוב). הרבה מאוד מהתרגילים שמופיעים בהרצאות ובשיעורי הבית שלה יופיעו בצורה כזאת או אחרת גם במבחן, והיא גם מדגישה מה יכול להופיע במבחן. \nאם כל זה לא מספיק-אחרי בקשה מצד הסטודנטים הסכימה שנוסיף עוד דף נוסחאות וזה עזר משמעותית בבחינה.\nשם המתרגל/ת: ליאת נימורבסקי לוי\nחוות דעת - תרגולים: \nבאופן כללי התרגולים בפיזיקה הם פשוט דף במודל שהמתרגל כותב על הלוח. הם לא סופר חשובים, אבל כן עוזרים להבין ולפתור כל מיני תרגילים בשיעורי בית, ולפעמים יש דברים שרואים רק בתרגולים אז כדאי ללכת. ליאת בסך הכל טובה, לפעמים התבלבלה קצת אבל זה מובן בקורס הזה. אם יש לה שני תרגולים שונים עדיף ללכת לאחד שקורה מאוחר יותר באותו שבוע, היא די עושה את הטעויות על הקבוצה הראשונה ומגיעה מפוקסת לשנייה.\nשעורי הבית: \nברובם סבירים לגמרי. בכל גיליון יש בין 1 ל3 תרגילים מזעזעים, לרוב יש רפרנסים ולמה שלא חנה עוזרת בשעת קבלה. שאר התרגילים נעים בין שנייה וחצי של תרגיל למשהו שראינו בתרגול/הרצאה.\nהמבחן: \nלדעתי המועד א היה הוגן אבל קשה. אין ספק שהמבחנים של חנה הוגנים יותר משל מרצים אחרים, אבל גם בו היו כל מיני דברים קטנים ומעצבנים שעם קצת יותר ריכוז או פחות בלבול היה אפשר להוציא ציון גבוה יותר.\nהשורה התחתונה: \nקורס שיצא לו שם רע ומפחיד מאוד, הרגשתי שהוא פחות מאיים ממה שאמרו עליו. אולי זה בזכות חנה, אבל לטעמי חוץ מהקטע שבחצי הראשון של הקורס משתמשים בכלים מתמטיים שלומדים רק בסוף הסמסטר בחדוא 2 הוא סביר לגמרי.", "timestamp": 1660738136623}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: הרצאות מעניינות. חנה עושה הרבה הדגמות מגניבות שעוזרות להפנים את החומר. יחד עם זאת, יש בקורס הרבה פיתוחים מתמטיים שצריך לחזור עליהם פעם-פעמיים כדי להבין עד הסוף. בעיקר כדאי להבדיל בין עיקר לתפל: עיקר - הבנה פיזיקלית, ושם להתעכב עד שמבינים. תפל - מתמטיקה שנראית מסובכת במהלך הקורס, כי לומדים אותה בחדו\"א רק בסוף הסמסטר. ממליצה לקבל את זה שזה לא מובן, לקחת את המתודה לפיתרון ולהבין בחדו\"א. לקראת סוף הסמסטר כדאי להתחיל חזרה על החומר, כי שם כבר יש את רוב המתמטיקה ואז החומר בפיזיקה מרגיש הרבה יותר מובן.\n\nשם המתרגל/ת: דניאל מלר - הקלטות\nחוות דעת - תרגולים:  לקראת מועד ב' למדתי מההקלטות של דניאל מלר והן מצויינות. בהקלטות של דניאל יש כמעט את כל התרגילים, והוא מתמקד בהבנה הפיזיקלית ולא במתמטיקה (שזה עושים בחדו\"א) וזה מעולה. \n\nשעורי הבית: ארוכים. שווה להשתדל לא לרפרנס וללכת לשעות קבלה כשנתקעים. \n\nהמבחן: סה\"כ המבחנים של חנה הוגנים.\n\nהשורה התחתונה: קורס יפה ומעניין. הקושי שלו בעיקר מתמטי וחבל שהוא לא בא אחרי חדו\"א 2. מצד שני, לקראת סוף הקורס פתאום המתמטיקה היא פחות הבעיה וחזרה על החומר תעזור לדברים להתיישב טוב יותר. אפשר להוציא ציון טוב, אבל דורש הרבה השקעה.", "timestamp": 1664719032807}, {"author": "דנאל", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין צורך בלהוסיף כמה שהיא המרצה הכי טובה\n\nשם המתרגל/ת: דניאל לומזוב\nחוות דעת - תרגולים: מתרגל מצויין. מדי פעם היה מעט איטי אך יש לו רצון עז לעזור ובשוטף הוא עונה למיליים מהר\n\nשעורי הבית: קשים- נעזרתי רבות מסרטונים באינטרנט.\n\nהמבחן: מועד א' היה מתחשב אך עם המון טריקים. השיטה היא לעשות כמה שיותר מבחנים.\n\nהשורה התחתונה: דורש הרבה זמן ועם מספיק זמן לעשות מבחנים ניתן לקבל ציון טוב", "timestamp": 1666339205506}, {"author": "אחמד בסלר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: חנה מרצה של ליגת אלופות \n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: משעמם רצח\n\nשעורי הבית: מחציתם לא פתירים\n\nהמבחן: ואי ואי ואייי חנה מה עשתה בנו במבחן, הכי טריקי שיש, לא מכירים חנה ככה\n\nהשורה התחתונה: עדיין ניתן להביא אחלה ציון", "timestamp": 1675176569418}, {"author": "אחמד בסלר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: מצטער על מה שאמרתי על חנה מקודם\nלמרות הממוצע המאוווד גבוה היא נתנה פקטור טיייייל :)\nאוהבים אותך חנה", "timestamp": 1675255777979}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nבדיוק כמו שאמרתי בפיסיקה 1מ, חנה היא המרצה הכי טובה הטכניון והיא תעשה הכל בשביל לגרום לכם להבין את החומר. \n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: \nהתרגולים יחסית חשובים, לפעמים עושים תרגילים שצריך אותם בשביל לפתור את התרגילי הבית, ובמבחן היו 2 תרגילים שהסתמכו על תוצאות מהתרגולים, אז כן חשוב לעבור עליהם.\nלגבי דניאל, מרגיש שרוב התרגול הוא מקריא מהדף, לא כל כך התחברתי.\n\nשעורי הבית: שיעורי בית סבירים, לא כל כך עמוסים.\nישנם תרגילי בית שאפשר לסיים בכמה שעות, יצא לי אולי 2 תרגילי בית שיצא לי להשקיע יותר כי היו יותר קשים, אבל בסה\"כ תרגילי בית לא כאלה עמוסים\n\nהמבחן: ממש הוגן, מי שעקב אחרי כל ההרצאות והתרגולים ועשה את השיעורי בית אין סיבה שלא יצליח\n\nהשורה התחתונה: אני חושב שיש איזושהי הגזמה כלשהי לגבי פיסיקה 2ממ, שמתארים אותו בצורה קיצונית, אבל לפי דעתי זה קורס ממש סבבה, לפחות כל עוד חנה מעבירה אותו.\nישנם דברים שבהרצאות לפעמים פחות מובנים , אבל זורמים עם זה , אחרי תרגול של תרגילי בית וכו מבינים את החומר , או לקראת החזרה בסוף הסמסטר", "timestamp": 1675362047037}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: דניאל מלר \nחוות דעת - תרגולים: מתרגל רמה גבוהה מאוד . מאוד מובן \n\nשעורי הבית: פיירים ביחס לשב של 1מ , חלק מהשאלות רעות\n\nהמבחן: המועד שלנו היה לא פשוט בכלל ולכן קיבלנו פקטור. לא להקשיב לבחור האנונימי לפניי שרשם שזה פשוט. הוא צריך אישפוז בכפייה ככל הנראה . \n\nהשורה התחתונה: לתת תחת לקוות לטוב .", "timestamp": 1675703852465}, {"author": "BaronCabbage", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  חנה מרטיסקאינן\nחוות דעת - הרצאות: כידוע כנראה המרצה הכי טובה ומתחשבת בטכניון. משדלת להסביר גם את הידע המתמטי שחסר לרוב הסטודנטים בקורס \n\nשם המתרגל/ת: זיו מיקוליצקי\nחוות דעת - תרגולים: עובד לאט ובזהירות שולט בחומר ועונה על כל השאלות, לפעמים לא מספיק את כל הדף תרגול המיתולוגי שגם ככה מעלים למודל למי שצריך\n\nשעורי הבית: קשים וארוכים, הרבה מעל רמת המבחן ויש רפרנסים להכל בגדול. אם רפרנסתם פחות משליש מהגיליונות כנראה מצבכם ממש טוב או שיש לכם יותר מידי זמן. לא ממליץ להשקיע יותר מכמה שעות עליהם.\n\nהמבחן: כל עוד הוא נשאר אמריקאי יהיה בסדר, יש טריקים פה ושם, מסתמכים ממש על דף נוסחאות אז תוודאו שיש לכם אחד טוב. היה פקטור בגלל בעיה עם הניסוחים\n\nהשורה התחתונה: אחלה קורס - במיוחד עם חנה, סתם מגזימים עם הביקורות הרעות עליו. בערך אותה הרמת עומס כמו פיזיקה 1מ למרות ההבדל נקז. אני אישית לא עשיתי חדוא 2ת והיה ממש קשה בלי הידע באינטגרלים משטחיים ודברים דומים שלא היו באינפי 2מ. אבל שרדתי יפה יפה בכל זאת אז ניחא.", "timestamp": 1676213717058}, {"author": "Dambi", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה המלכה\nחוות דעת - הרצאות: מלכה גם בפרונטלי וגם במוקלט. ממליץ לבוא פרונטלי כי יש ניסויים מגניבים שיותר כיף לראות בכיתה.\n\nחוות דעת - תרגולים: ראיתי מוקלט מהקלטות די מאעפנות. רק בסוף הקורס גיליתי שיש הקלטות עם איכות יותר טובה:\nhttps://panoptotech.cloud.panopto.eu/Panopto/Pages/Sessions/List.aspx#folderID=%22eb7f5a54-0fe6-4b11-adfe-d100150a43c7%22\n114075 - פיסיקה 2ממ - תרגול\n\nשעורי הבית: כמו השאלות במבחן. לא סתם לרפרנס כי זה גם חשוב להמשך הקורס וגם מחליף ברובו את הלמידה למבחן.\n\nהמבחן: היה קליל למי שעשה שיעורי בית כמו שצריך. חלק גדול זה להעתיק מהדף נוסחאות את הנוסחא המתאימה.\n\nהשורה התחתונה: טוב למי שאוהב פיזיקה ואינטגרלים. או שהמבחן קל או שחנה מפרגנת בפקטור. זה עדיין קורס של 5 נק\"ז אז זה הרבה חומר.\nהערה: לא להיכנס לפאניקה בחלק של היחסות. זה בעיקר חנה עושה הוכחות מורכבות ואז בסוף אנחנו פשוט מעתיקים מהדף נוסחאות.", "timestamp": 1676534726120}, {"author": "איריס שורות", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אין על חנה. כמו שכבר אמרו לפניי ויגידו עוד אחריי, חנה מרצה מעולה. חוץ מזה שהשיעורים ב8:30 וזה מרדים, סך הכל היה אחלה, חנה מסבירה ברור, נותנת הרבה מקום לשאלות ורואים שבאמת אכפת לה מהסטודנטים. ההוכחות קצת משעממות...\n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: ממש אהבתי את מלר. לדעתי מלר מסביר טוב והתרגולים עוזרים מאוד להבנה ולפתירת שיעורי הבית ובסופו של דבר גם למבחן. יש שאלות מהתרגול שמופיעות גם בשיעורי בית אז שווה לבוא או לפחות להסתכל על הרשימות. לא תמצאו בחור ציני כמו מלר ואין עליו.\n\nשעורי הבית: קשים, ארוכים, חלק קטן מהשאלות (באותו סגנון) מופיעות במבחן. בכל מקרה כדאי לעשות את שיעורי הבית כדי להבין את החומר יותר טוב ואז להגיע ללמידה למבחן עם רקע טוב. \n\nהמבחן: חרא של דבר. לדעתי היה מבחן קשה, מלא עבודה שחורה והדף נוסחאות לא היה ממש משמעותי הפעם כי היו הרבה אינטגרלים לפתור לבד ופחות להיעזר בנוסחאות הקיימות. בתכלס קורס שמלא בדברים מחדוא 2ת, אבל המבחן בחדוא שלנו היה אחרי פיזיקה אז היה קצת קשוח ליישם את כל הדברים משם. בכל מקרה חנה נתנה פקטור מפנק ונחמד שהיא גם יודעת להודות בטעויות שיש לפעמים. אמנם הממוצע גבוה, אבל באמת שהיה קשה ומי שיגיד אחרת שקרן וסתם אומר בדיעבד. \n\nהשורה התחתונה: מזל שיש את חנה, מבחנים אמריקאים זה חרא, מלר מלך.", "timestamp": 1676998807247}, {"author": "OG", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה👑 (הקלטות)\nחוות דעת - הרצאות: \nלמדתי את הקורס עצמאית מהרצאות של חנה, פשוט מלכה\n\nשם המתרגל/ת: דניאל מלר (הקלטות)\nחוות דעת - תרגולים: \nטיפה מפוזר אבל בסך הכל מעביר את החומר סבבה, יש רשימות מסודרות לתרגולים במודל אז שווה לראות כשהן פתוחות ולקרוא אם יש פערים\n\nשעורי הבית: \nממוחזרים ברובם אבל קשים ממש, גרם לו להרגיש שאני לא שולט טוב בחומר למרות שבפועל המבחנים קצת יותר קלים\n\nהמבחן: \nהוגן בעיניי, חבל שכל טעות קטנה באמריקאיות יכולה להפיל אותך חזק\n\nהשורה התחתונה: \nאין יותר מדי ברירה, תתרגלו הרבה ויהיה טוב🤷‍♂️", "timestamp": 1690134614923}, {"author": "11", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nהמרצה הכי טובה בטכניון!! (כידוע...). מרצה מעולה, ההרצאות היו מעניינות ומועברות שצורה טובה, וגם ביחס לסטודנטים בשעות קבלה/הרצאות/פורום היא תמיד עונה ומסבירה בצורה שאין סיכוי לא להבין.\nשם המתרגל/ת: אורי יחזקאל\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב ועוזר להפנים את החומר של ההרצאה. בניגוד לפיזיקה 1מ כאן הרגיש לי שהתרגולים נצרכים ומוסיפים.\n\nשעורי הבית: \nקשים, כדאי לנסות לבד ומה שלא הולך לרפרנס/שעת קבלה של חנה.\nהמבחן: \nדי קשה, היו כמה דברים יצירתיים שלא ראינו שאלות דומות למה שהיה במבחן, חוץ מזה זה אמריקאי ככה שעל +/- זה שמונה נקודות. אבל תכלס מי שלמד טוב כל הסמסטר היה אפשרי להוציא ציון טוב\nהשורה התחתונה: אחלה קורס, אחלה סגל. קשה אבל אפשרי להוציא ציון טוב.", "timestamp": 1690143716418}, {"author": "D", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: זאת חנה, שמה הולך לפניה.\n\nשם המתרגל/ת: מלר מוקלט\nחוות דעת - תרגולים: שנתיים עברו מאז שהוקלטו ושום דבר לא השתנה. אני אישית ממש אהבתי.\n\nשעורי הבית: קשים, יצא לי לרפרנס לא מעט. אבל חשוב לא לרפרנס על עיוור ולהבין מה עושים.\n\nהמבחן: המבחן גורם קצת להזיע, אבל הוא פתיר ברובו. חנה בונה את המבחן כך שאם השאלה ממש בלתי פתירה - אפשר פשוט לפסול תשובות (ע\"י הצבת תנאי שפה או גבולות) ואז לא באמת צריך לפתור. בשאלות האחרות - אפשר בקלות להגיע לאחת התשובות הלא נכונות, אז לבדוק 8 פעם גם אם התשובה שהגעתם אליה מופיעה בטופס.\n\n\nהשורה התחתונה: אחלה קורס, אחלה צוות, אחלה חומר. מבחן טריקי.", "timestamp": 1690185086261}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מעבירה את הקורס בצורה מאוד מסודרת. יש רשימות להרצאות והיא די נצמדת אליהן, עונה לכל שאלה שיש ובאופן כללי הקורס מרגיש מאוד מסודר. יש הרבה אינטגרלים וחומר מחדו\"א 2ת' בקורס, למי שלוקח אותו במקביל אולי יהיה קצת קשה בהתחלה אבל חנה מודעת לזה ומנסה לגשר על זה.\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: בסדר, בשלב מסוים הפסקתי להגיע ועברתי על הסיכום של התרגול, הרגיש לי שהספיק באותה המידה. יש תרגילים מסוימים שהרעיונות שלהם לא הועברו בהרצאה אלא רק בתרגול ולפעמים מופיעים במבחנים, אז חשוב לעבור על התרגולים. \n\nשעורי הבית: גיליונות די קשים, אבל יש רפרנסים.\n\nהמבחן: המבחן לא פשוט, לפעמים המסיחים בשאלות מאוד מבלבלים. חנה משתדלת לעשות את המבחן הוגן לדעתי, היא לא נוהגת לתת פקטור גם אם הממוצע נמוך. המבנה של המבחן כרגיל מכשיל, מבחן אמריקאי שבו כל שאלה שווה 8 נקודות ולכן קל לאבד נקודות על טעויות קטנות, אז צריך לשים לב. אחרי שעושים הרבה מבחנים רואים תרגילים שחוזרים על עצמם ורעיונות דומים, אז חשוב לתרגל הרבה מבחנים ולבוא עם דף נוסחאות טוב.\n\nהשורה התחתונה: קורס לא פשוט, אבל אפשר להוציא ציון טוב אם מתרגלים מספיק מבחנים. אין על חנה.", "timestamp": 1716226863886}, {"author": "Jad Ghanayem", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: ההרצאות מסודרות מאוד והכל קל להבין, הכל מוקלט באופן מסודר. חנה מעולה, והיא מסבירה הכל באופן שקל להבין. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: גם המתרגל האחראי טוב מאוד, והכל מוקלט וקל להבין.\n\nשעורי הבית: אחד כל שבוע, אם הבנתם את התרגול אז שיעור הבית לא יקח יותר מיד זמן, כמה שעות וזה הוא.\n\nהמבחן: אני ממליץ לדאוג שאתם מבינים כל החומר לפני לעבור כל מבחנים משנים קודמות, אז אם פתרתם את כל ת\"ב וכל המבחנים של חנה (כמעט 8) אז אתם מוכנים למבחן\n\nהשורה התחתונה: אל תפספסו אף הרצאה ותרגול ות\"ב והקורס יהיה קל", "timestamp": 1716810138337}, {"author": "פופו", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: אין על חנה וכל מילה מיותרת\n\nשם המתרגל/ת: מוקלט של דניאל מלר \nחוות דעת - תרגולים: לדעתי לא משהו אבל כל החלופות גם היו לא משהו. דניאל פשוט מונוטוני ממש והחומר קשה מה שגורם לחומר קשה להיות משעמם ואז הוא עוד יותר קשה.\n\nשעורי הבית: מודל פעם בשבוע, קשים ממוחזרים וממש חשובים להבנה ממליץ לא לרפרנס אלא אם חייבים.\n\nהמבחן: כיאה לחנה - מבחן קשה ולא מתפשר אבל אי אפשר להגיד שלא הוגן. חנה פיתחה אומנות בלכתוב מבחנים קשים אבל הוגנים.\n\nהשורה התחתונה: קורס מעניין וקשה", "timestamp": 1719004245406}]}