{"posts": [{"author": "שוורצשילד", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: נועם\nחוות דעת - הרצאות: אחלה גבר בלי קשר\nבהרצאות עצמן נותן פרספקטיבה טובה על הוראה, כמה השקעה באמת מינימלית מוסיפה לקורס. הוא לא עבד ימים כלילות על הדגמות ולא יודע מה אבל כן נתן את האקסטרה טאץ עם בדיחות מידי פעם והבנה של קושי. בנוסף נתן אחלה אינטואיציה לקורסים אחרים, פתאום זורק הערות שקשורות לסטתרמית/אופטיקה/מצב מוצק. בקיצור מומלץ\n\nשעורי הבית: גיליון כל שבוע, קצת תיק ביחס לזה שזה 2 נקז. זה הרגיש כאילו בא במקום תרגול, בהרבה תרגילים הוא ממש מנחה אותך מה לעשות ונותן מוטיבציה. ממוחזרים 1:1 משנה לשנה\n\nהמבחן: סבבה לגמרי. הרבה אנשים לא באים להרצאות ו״מדפדפים״ את הקורס, לדעתי בגלל זה הממוצע נמוך. מי שמגיע להרצאות ועושה את הגיליונות בלי לרפרנס לרוב מקבל ציון ממש גבוה\n\nהשורה התחתונה: מומלץ מאוד. ניכר שלא אכפת לו מלזכור בע״פ או מטכניקות אלא מאינטואיציה פיזיקלית כי זה באמת מאוד מנותק מדברים שאנחנו מכירים (דוגמה בשלוף מהראש-שני גופים מתמזגים והמסה שלהם יורדת) \nיצאתי משם עם הבנה בסיסית של מה זה יחסות כללית והבנה עמוקה מאוד של יחסות פרטית (לפחות 3 הרצאות רק על זה), כמובן הבנה עמוקה על חורים שחורים וטעם של עוד", "timestamp": 1660322923070}, {"author": "Tamir Manoach", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: סוקר נועם\nחוות דעת - הרצאות: מרצה מעולה, בן אדם טוב.\nתתכוננו לבדיחות אבא/סבא.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל שבוע, אך ממש הרוב ממוחזר, לא עמוס בכלל\n\nהמבחן: חומר פתוח ברמה אחרת, ( מחשבים וטאבלטים )\n\nהשורה התחתונה: ממש ממליץ, נותן הבנה רחבה כללית לנושא מעוד מסובך", "timestamp": 1691500873009}, {"author": "אקוסטו", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נועם\nחוות דעת - הרצאות: מרצה הצגה , אני בדרך כלל לא מגיע להרצאות וזה אחד הקורסים שממש השתדלתי להגיע כי באמ היה כיף ומעניין \nמעבר לזה נועם משקיען ונותן תחושה שאתה יכול לפנות אליו תמיד לכל שאלה \nשעורי הבית:כל שבוע גליון אבל די קצר ,לוקח 1-2 שעות  יכול להיות גם פחות \n\nהמבחן: חומר פתוח עם מחשבים/טבלטים בעיני זה ממש טוב \nכל מבחן הוא באותו סגנון אבל באמת שאלות שונות כל פעם ,באמת יצירתי , מי שלמד בסמסטר 3 ימי למידה יספיקו \n\nהשורה התחתונה: בעיני קורס חובה, כי הוא לא קשה/מתמטי \nאבל נותן לראות את כל היופי ביחסות כללית וממוצע גבוה יחסית ,אין סיבה לא לקחת", "timestamp": 1691599546265}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: נועם\nחוות דעת - הרצאות: אחלה גבר. צריך להבין שלא לומדים בקורס יחסות כללית, זה יותר כמו שעת סיפור (אבל בקטע טוב).\n\nשעורי הבית: הייתי צריך את הרפרנס צמוד אליי בעיקר כדי להבין מה ביקשו ואיך לתקוף את התרגיל, אחרי שרואים את השורה הראשונה אין בעיה להמשיך לבד. אבל אם פתאום הוא יוציא גליונות חדשים אז בתכלס הם די קשים.\n\nהמבחן: המבחן עם חומר פתוח וגם יחסית קל. החיסרון היחיד הוא שיש ממש מעט שאלות וסעיפים (במצטבר נדמה לי שהיו 5 סעיפים - 20 נקודות לסעיף), ככה שאו שמצליחים בענק - או שנופלים בענק.\nממליץ לנועם להוסיף עוד לפחות שאלה אחת למבחן (ואז גם להאריך אותו ל-3 שעות).\n\nהשורה התחתונה: תכלס זה קורס מל״ג עם קצת משוואות, פשוט צריך לדעת באיזו משוואה להציב. אבל זה קורס פנאן סה״כ ובלי הרבה השקעה. לא יודע אם הייתי ממליץ לכולם, זה אינדיבידואלי. מציע שתכלו לשיעור הראשון ותראו אם בא לכם עליו.", "timestamp": 1697092071328}, {"author": "שוורצשילד", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נועם סוקר\nחוות דעת - הרצאות: \nיש לי חברים שקיבלו ציון מעולה בקורס בלי לבוא להרצאות, אבל לפי דעתי הם הפסידו. היה פשוט ממש כיף בהרצאות עם נועם - זה היה יותר אתנחתא קומית מקורס. \nויש גם בהרצאות האחרונות מצגות ממש יפות ומעניינות שאי אפשר להשלים כמו שצריך \n\nשעורי הבית: \nפשוט תרפרנסו בלי לחשוב פעמיים. רוב השאלות שם אי אפשר לפתור ברמת הידע שניתנת בהרצאות ולפי דעתי זה יותר נועד להעשיר את הידע מלתרגל על החומר \n\nהמבחן: \nהאמת לא קשה כי יש חומר פתוח במחשב וטאבלט, ואחרי שעושים מבחני עבר מבינים את העקרונות. אבל חייב לציין שזה מדהים שנועם תמיד ממציא את עצמו מחדש בשאלות - כמעט שאין מחזור שאלות.\n\nהשורה התחתונה: \nהיה קורס מעניין, לא יותר מדי קשה (קצת כמו מלג אבל כן צריך ללמוד אליו טיפה יותר) והכי חשוב ממש ממש מעניין אחרי שעוברים את הקטע של יחסות פרטית (אגב הוא ממש מחזק את ההבנה של יחסות פרטית למי שמרגיש שקצת התפספס לו ב1פ)", "timestamp": 1704493915810}]}