{"posts": [{"author": "SR", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "לא עמוס. יש גיליון פעם בשבוע שאפשר לרפרנס אותו בכמה דקות, אבל כן רצוי לעשות כדי להבין מה הולך שם (מדובר על כמה שעות של עבודה).", "timestamp": 1595708271000}, {"author": "שם", "semester": "201902", "text": "למי שעשה פיסיקה 1מ, פיסיקה 2 הוא קורס יחסית קליל.\nחנה היא מרצה מקסימה ורשימות ההרצאה שלה שמתפרסמות לפני כל הרצאה מצויינות.\nעודד זילברמן מתרגל ממש טוב והסרטונים של רון בסלר (בעיקר פתירת שאלות ממבחנים) מדהימים.\nאפשר לרפרנס את שעורי הבית במהירות, אבל לשים דגש על מה מלמדים בתרגולים.\nיש \"בחני\" הכנה לתרגול שהם רשות, אבל עוזרים להטמיע את החומר.\nלמידה למבחן:\nאם יש זמן - (יותר מ3 ימים) לעבור על ההרצאות בקטנה והתרגולים ואז להשקיע לפחות 3 ימים של מבחנים (בערך 3-מבחנים ליום).\nאם אין זמן - להשקיע לגמרי במבחנים משנים שעברו של המרצה האחראי, לראות את הסרטונים של רון בסלר על פיתרת שאלות שאין להם פיתרון רשמי (כל סרטון הוא בערך 5-6 דקות ואם לא מבינים משהו, פשוט שואלים בצ'אט ומקבלים תשובה תוך כמה שעות). כדאי לעשות בערך 7-9 מבחנים של שנים שעברו כדי להצליח בקורס.\nדף נוסחאות - כדאי להדפיס בתחילת הסמסטר ולהוסיף מידע/להדגיש את מה שתמיד שוכחים. לחלק מדפי הנוסחאות \"נראה\" שיש חומר שלא רלוונטי (כמו כמה זה מגה וגיגה) אבל יכולים להציל שאלה בבחינה עצמה.", "timestamp": 1597237440000}, {"author": "Lir", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חנה מרטיסקינן\nחוות דעת - הרצאות: חנה מדהימה. הרצאות ברורות, והיא מעלה את כל מה שהיא אומרת וכותבת על הלוח (הרשימות שלה) למודל לפני כך שאין צורך להעתיק, רק להקשיב.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: מאוד משקיע ויש הכל ביוטיוב, יש לו גם פתרונות של תרגילים ממבחנים משנים קודמות והוא יחד עם חנה זו החבילה המושלמת להצלחה בקורס.\n\nשעורי הבית: לא עמוסים, יוצרים פעם בשבוע ולא קשים מידי. כדאי להשקיע ולפתור אותם לבד, להעזר ברפרנס כשנתקעים כן- אבל להבין.\n\nהמבחן: היה הוגן.\n\nהשורה התחתונה: קורס נחמד ומעניין.", "timestamp": 1597741641681}, {"author": "Yazan Nasser", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: חנה מרתניאנסקי\nחוות דעת - הרצאות: נושאים מעניינים וחלק משעמם \n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: על הכיפק\n\nשעורי הבית: קל-בינוני\n\nהמבחן: סביר מאוד\n\nהשורה התחתונה:", "timestamp": 1597755690874}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עומר צור\nחוות דעת - תרגולים: מתרגל תותח. נותן העשרות נוספות ונשאר הרבה מעבר לתרגול כדי לתת עוד מידע ולענות על שאלות. נותן יחס אישי ולא מוותר על אף סטודנט שרוצה ללמוד ולהצליח.\n\nשעורי הבית: לא קשים ולא ארוכים. כשעה-שעתיים בשבוע.\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה:", "timestamp": 1597880699925}, {"author": "yuval", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מסודרת מאוד, כותבת את כל חומר ההרצאות על דפים ומפרסמת אותם - פיתוחים ברורים ומובנים\n\nשם המתרגל/ת: עודד זילברמן\nחוות דעת - תרגולים: מסודר מאוד, קשוב ואחראי\n\nשעורי הבית: עמוסים מדי שבוע\n\nהמבחן: אמריקאי והוגן\n\nהשורה התחתונה:", "timestamp": 1598538397657}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: בסדר, משעמם עם די הרבה חומר\n\nשם המתרגל/ת: עודד זילברמן\nחוות דעת - תרגולים: ממש נחמד, עוזר ומסביר ממש טוב\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602483572422}, {"author": "פיסיקה 2", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מעולה, מסבירה בשיטה יפה ומסודרת.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: רמה גבוהה יותר משאלות מבחנים, אבל מגן אז לא צריך לפתור, עוזרות בהבנת החומר.\n\nהמבחן: מבחן טכני לגמרי, עם דף נוסחאות מסודר אפשר לקבל 85+.\n\nהשורה התחתונה: ממוצע גבוה יחסית, מאגר פתרונות והסברי חומר מעולה.", "timestamp": 1602853018681}, {"author": "akiva zonenfeld", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אחלה מרצה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1602926001572}, {"author": "Asaf", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: הרצאות מעניינות, חנה מרצה מדהימה. קצת פיתוחים מתמטיים, קצת דוגמאות. הדיון ברמה מאוד high level אז תכלס לומדים דברים מעניינים אבל בלי להיכנס לחפירות.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: \nתרגולים די טובים ומועילים לתרגילי הבית. התרגולים המוקלטים של רון מומלצים ויאמר לזכותו שהוא גם מעלה סרטונים מעבר לתרגולים עצמם עם עזרה על תרגילים ספציפים מתרגיל הבית או נושאים שנראה לו שאנשים לא הבינו עד הסוף. \n\nשעורי הבית: \nקלילים ויש גם אקסל כמובן. \n\nהמבחן: \nקל אם מתכוננים - בסוף זה אותן נוסחות שצריך להציב בהן את הנתונים כדי להגיע לפיתרון, פשוט צריך לעשות מספיק שאלות כדי לראות סוגים שונים של שאלות ולהבין איך לפתור אותן. מאוד חוזר על עצמו בין מבחנים. בכל מבחן יכולה להיות אולי שאלה אחת שמחדשת משהו וצריך לחשוב עליה. \n\nהשורה התחתונה: קורס מומלץ מאוד. די קל, לא עמוס במהלך הסמסטר וגם די מעניין.", "timestamp": 1607967849988}, {"author": "מיכאל", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: מעניינת ונחמדה.\n\nשם המתרגל: רון בסלר ביוטיוב \nחוות דעת - תרגולים: מתרגל נהדר ומסור.\n\nשעורי הבית: מאד מלמדים למי שלא מרפרנס.\n\nהמבחן: היה מקוון דרך המודל, היה מבחן הוגן באורך רגיל ועם יציאה לשירותים. מבחן אמריקאי עם תשובות בעיקר פרמטריות.\n\nהשורה התחתונה: עשיתי את זה כקורס בחירה בשרשרת מדעית ולא התחרטתי.", "timestamp": 1612465280964}, {"author": "צבא החיילים של חנה", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: \nמושלמת, מעבירה בדיוק את החומר שצריך ויודעת להרחיב גם דברים אם מעניין. מאוד מאורגנת וזה עוזר להבין את החומר\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: \nלא הייתי בתרגולים. ההרצאות של חנה מספיקות ב90%. לקראת המבחן אפשר \"לחזק\" בתרגולים מוקלטים של רון בסלר שהוא תותח\nשעורי הבית: \nקל לרפרנס. רצוי לנסות לפתור לבד את הרוב אבל לא ממש קריטי\nהמבחן: \nסה\"כ הוגן. נושאי השאלות לא מאוד משתנים והמבחן אמריקאי. תמיד יש כמה שאלות מתחכמות אבל כן פתיר\nהשורה התחתונה: \nקורס נחמד, יותר קל מפיזיקה 1 למרות שהוא יותר נק\"ז. רצוי להיות על החומר של חדוא 2 (או גרסאות אחרות שלו) כי חלק גדול מהקורס מתבסס על אינטגרלים של חדוא 2 וזה חוסך המון זמן וטעויות", "timestamp": 1613511144167}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חנה מרטיסקינן\nחוות דעת - הרצאות: \nחנה מעבירה את החומר מדהים, אין כמוה והיא מצליחה להפוך גם את חשמל לברור.\n\nשם המתרגל/ת: עודד זילברמן\nחוות דעת - תרגולים: \nעודד מסביר מעולה וטוב והוא גם חתיך בנוסף:)\nשעורי הבית: \nקשים אבל אפשריים\nהמבחן: \nמבחן הוגן למי שחרש והשקיע לפני\nהשורה התחתונה: קורס קשה אבל אפשרי עם הרבה השקעה.", "timestamp": 1615813448879}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה אחלה מרצה, מעבירה את החומר בצורה ברורה ומעניינת. ההרצאות יכולות גם לסגור את הפינה של התרגולים אם לומדים אותן כמו שצריך\n\nשעורי הבית: כל שבוע גיליון במודל, יש כאלה שלוקחים 5 דקות ויש כאלה שלוקחים שעתיים. סך הכל בסדר\n\nהמבחן: 12 שאלות, אמריקאי. שאלת בונוס\nהשורה התחתונה: אחלה קורס", "timestamp": 1626104235551}, {"author": "ד", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  חנה\nחוות דעת - הרצאות:  מלמדת מעולה, נותנת אינטואיציה טובה ובכללי מרצה מעולה\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: יודע את החומר טוב.\n\nשעורי הבית: עוזרים להבין את החומר, מומלץ לעשות\n\nהמבחן: אמריקאי, אם מתכוננים טוב אפשרי לגמרי. עוד אין ציונים אבל. יש וידאו של רון בסלר פותר שאלות מכל מיני מבחנים שזה ממש עוזר", "timestamp": 1626433148974}, {"author": "אופיר ביננטל", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסקיאנן\nחוות דעת - הרצאות: המרצה האהובה עליי. מסבירה ברור ולאט. כיף להגיע לשיעורים שלה\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: ראיתי את התרגולים של רון ביוטיוב. מסביר ברור ומשתדל מאוד לעניין את הסטודנטים\n\nשעורי הבית: גיליון כל שבוע\n\nהמבחן: 12 שאלות ושאלת בונות\n\nהשורה התחתונה:", "timestamp": 1626714597975}, {"author": "ד", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מרצה מעולה באמת, אבל העובדה שהיא משתפת את הרשימות שלה ומאפשרת חזרה על החומר היא פשוט priceless, הלוואי והיה ככה בכל קורס. \n\nשם המתרגל/ת: דניאל לומזוב ועודד זילברמן\nחוות דעת - תרגולים: מתרגלים ברורים וטובים.\n\nשעורי הבית: ישנם גיליונות שיוצאים בערך אחת לשבועיים. הגיליונות מהווים 15% מגן שזה לא יותר מדי אבל מורכבים משאלות מבחנים ולכן מומלץ לפתור אותם.\n\nהמבחן: מבחן הוגן מאוד. יש דף נוסחאות ובמבחן שפתרתי הייתה שאלת בונוס מה שבפועל איפשר בחירה קטנה במבחן.\n\nהשורה התחתונה: אחלה קורס ולא נוראי כמו 1מ. רון בסלר משתף אקסל שיש בו קישורים לסרטוני יוטיוב בהם הוא פותר שאלות מבחנים וזה אחד הדברים הנהדרים שנתקלתי בהם בתואר. קורס נחמד עם סגל ממש טוב.", "timestamp": 1626799330688}, {"author": "1", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אחלה מרצה, מעניינת, מסודרת, מסבירה טוב\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: מלך\n\nשעורי הבית: חלק קשים יותר, חלק פחות, לא לוקחים המון זמן וחשובים סהכ\n\nהמבחן: מבלבל אבל לא מאוד קשה, חשוב לתרגל כמה שיותר לפני\n\nהשורה התחתונה:", "timestamp": 1626871936806}, {"author": "Ari Cohen", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מיכל נוימן\nחוות דעת - הרצאות: \nהמון המון הוכחות ופלפופלים מתמטיים בלי להסביר תכליס מה חשוב לפתרון בעיות בפועל. \nשם המתרגל/ת:  רון בסלר\nחוות דעת - תרגולים:  מנסה מאוד לעשות התרגולים \"כיף ומעניין\" אבל זה בא על חשבון להעביר את החומר כמו שצריך. מומלץ להתמקד בסרטונים המוקלטים שבהם הוא פותר בעיות ממבחנים.\n\nשעורי הבית: קפיצה גדולה מרמת התרגולים וההרצאות אבל זה ברמת המבחן. עדיף ללמוד איך לפתור כאלו שאלות במהלך הסמסטר במקום שבוע לפני המבחן.\n\nהמבחן: קשה מאוד, באים עם מלא טריקים ושטיקים.\n\nהשורה התחתונה: קורס קשה שדורש המון עבודה עצמאית.", "timestamp": 1626934915752}, {"author": "אלון", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה מרצה מעולה חובה ללכת!\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: ערוץ יוטיוב עם כל התרגולים דוגמאות ועוד מלא דברים. ראיתי רק את זה ולא הלכתי לתרגולים האמיתיים.\n\nשעורי הבית: כל שבוע גיליון. לרוב לא קשים.\n\nהמבחן: 12-13 שאלות. בגדול כל שאלה על נושא אחר בקורס.\n\nהשורה התחתונה: קורס לא קשה מדי, יש המון דברים מעניינים.\nממליץ להיות על החומר של חדוא 2 נורא מקל על החישובים וככה אפשר להתעסק בפיזיקה ולא במתמטיקה.", "timestamp": 1627384080101}, {"author": "Omer Gino", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמעניינת וכיפית\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים\n\nהמבחן: נחמד\n\nהשורה התחתונה: קורס שכדאי לעשות כשרשרת מדעית", "timestamp": 1627804329030}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מהממת כהרגלה, מסבירה את החומר בצורה מאוד ברורה. ראיתי אותה חצי מוקלטת וחצי לייב בזום וזה היה אחלה.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: תרגולים בסך הכול טובים, לפעמים נוטה להיות פריפריאלי או להביא הדגמות קצת מיותרות, אבל כשיודעים להתמקד איתו בעיקר הוא אחלה. יש גם הכול מוקלט ביוטיוב כמה שנים אחורה אז אם אין לכם כוח, ההקלטות שלו ממש מספקות.\n\nשעורי הבית: \nמעיקים אבל מרופרנסים כמעט לחלוטין. ביחס לפיזיקה 1מ ממש סבירים.\n\nהמבחן: \nאיכשהו במועד א' היה מבחן מאוד סביר (ממוצע 84, חציון 92 בכל זאת), כאשר מבחני עבר כן היו קשים יותר. לא ברור מה קרה שם אבל זכינו מההפקר.\n\nהשורה התחתונה:\nאם אתם מחפשים קורס לשרשרת מדעית וממש ממש לא רוצים כימיה ויש לכם כן קצת זמן להשקיע אז זה יכול להיות הקורס בשבילכם. קל מפיזיקה 1מ בצורה השוואתית.", "timestamp": 1628076575760}, {"author": "פג סיני", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חנה (מרסקינן?)\nחוות דעת - הרצאות: מספר 1, חנה המרצה הכי טובה שפגשתי ביי פר מכל שאר המרצים. מסודרת, מסבירה בצורה מדוייקת, זמינה לשאלות במייל, ופשוט בן אדם מרשים ומדהים. הלוואי הייתי יכול ללמוד אצלה כל התואר.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: האמת שלא כולם התחברו אליו, אני התחברתי, מסביר טוב, משקיע המון מעצמו כדי להשתפר ולעזור לסטודנטים ומבחינתי עשה את העבודה.\n\nשעורי הבית: סבבה לגמרי, לא עמוס מידיי ועדיין עוזר להבין את החומר בצורה טובה.\n\nהמבחן: היה פייר לגמרי, מבחינת הרמה ומבחינת אופי השאלות לגמרי התאים בעייני לצורה שבה החומר הועבר במהלך הסמסטר.\n\nהשורה התחתונה: קורס באמת מעניין וחנה ורון פשוט עשו אחלה עבודה, באמת נהניתי ללמוד את הקורס הזה.", "timestamp": 1628625837684}, {"author": "Elad Kay", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ראיתי מוקלטות של חנה\nחוות דעת - הרצאות: זאת חנה, מה אתם מצפים? כמובן ההרצאות היו מצוינות!\n\nשם המתרגל/ת: רון בסלר \nחוות דעת - תרגולים: מבין המתרגלים הטובים בטכניון. מאוד מושקע בקורס ומשקיע בו המון. הוא כתב ספר עזר לקורס שהוא לדעתי נחמד אבל ברמה קצת נמוכה. הוא פתח ערוץ יוטיוב לקורס עם מלא שאלות ממבחנים וסרטוני עזר. בתרגולים כל הזמן הוא מוסיף הדגמות ועוד תכנים ועוד שאלות ומראש כל שאלה בתרגול היא עם ״נושא״ במטרה להראות לנו שהקורס פרקטי. כל הכבוד לו!\n\nשעורי הבית: במודל שבועיים ולוקחים את ה־10 הטובים, לא קשים. אצלנו היה 15% מגן.\n\nהמבחן: לא קשה, ציונים גבוהים \n\nהשורה התחתונה: מומלץ!", "timestamp": 1628959954552}, {"author": "ר.ק.", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: סעיד\nחוות דעת - הרצאות: מרצה ממש סבבה\n\nשם המתרגל/ת: רון - יוטיוב\nחוות דעת - תרגולים: צריך הרבה משמעת עצמית, אבל רון הוא אחלה\n\nשעורי הבית: בסדר, צריך אבל להבין את הקונספט כדי שזה ירוץ\n\nהמבחן: היה בסדר גמור\n\nהשורה התחתונה: רון הוא מלך והסרטונים שלו ממש עזרו לי ללמוד למבחן ולהצליח בקורס", "timestamp": 1629107686171}, {"author": "משה", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nחנה במאית, שחקנית ועורכת מעל ומעבר. כל שבח שתגידו עליה, כבר נאמר וחנה עושה ככל שביכולתה להפיח חיים בסרט המשעמם ביותר שנקרא \"פיסיקה\". בעזרת בדיחות שנונות וציניות על החיים, חנה חושפת מציאות עגומה למדי שנקראת פיסיקה 2. חנה מעבירה את המסר לצופים בצורה מרגשת אך בסופו של יום, הם יפתרו את המבחן בעיקר בעזרת דף הנוסחאות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1629307824185}, {"author": "איתמר זייד", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: חנה מסבירה לאט וטוב. החומר בהרצאות קצת מפורט מדי\n\nשם המתרגל/ת: עודד זילברמן\nחוות דעת - תרגולים: בסדר\n\nשעורי הבית:  קשים\n\nהמבחן: לא קשה\n\nהשורה התחתונה: סה\"כ סבבה", "timestamp": 1631170398985}, {"author": "חן", "difficultyRank": 4, "generalRank": 4, "semester": "202003", "text": "שם המרצה: זיו\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: אלוף ! מסביר טוב ותמיד עוזר \n\nשעורי הבית: כמו פיסיקה 1מ רק יותר זורם \n\nהמבחן: זיו עשה מבחנים קשים ולא משקפים שום דבר, הוא שם שאלות מפיסיקה 1 כדי להוריד את הממוצע אז כל עוד אתם לא עם זיו אז המבחנים סבבה, אם מבינים את החומר ומתרגלים מספיק\n\nהשורה התחתונה: סבבה", "timestamp": 1637437830514}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: גידי אלון\nחוות דעת - הרצאות: בסדר גמור. מרצה נחמד עם הרבה מוטיבציה והסברים ברורים. \n\nשם המתרגל/ת: אנטון (הקלטות)\nחוות דעת - תרגולים: תרגולים ברורים ומסודרים. \n\nשעורי הבית: די קלים, בסך הכול תואמים את הרמה של החומר הנלמד בקורס. \n\nהמבחן: לא מאוד קשה. \n\nהשורה התחתונה: קורס סביר בהחלט, מעט משעמם אבל דורש השקעה מינימלית.", "timestamp": 1644261799067}, {"author": "דניאל", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: חנה וגידי מעולים, הלכתי וראיתי את של שניהם ומאוד מומלץ\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: מעולה, מסביר טוב וענה לי במייל לכל שאלה  \n\nשעורי הבית: מטלת מודל שבועית צריך להגיש רק 10/13, לא נורא בכלל\n\nהמבחן: אני חושב שהיה הוגן, נראה שמי שלמד הוציא ציון טוב למרות שבסוף היה ממוצע נמוך קצת (68). הייתה התנהלות מעולה של הסגל במהלך המבחן עצמו, גידי נכנס ושאל כמה פעמים אם יש שאלות\n\nהשורה התחתונה: הקורס הזה מומלץ כשרשרת מדעית וזה הכל בזכות הסגל המצוין שלו, דאגו לענות לשאלות לפני המבחן.\nרון בסלר גם מצוין הוא העלה סרטון פתרון לכל שאלה שהייתה במבחן ישר אחר.\nהסגל נותן את הכלים להצליח", "timestamp": 1644651759056}, {"author": "סטודנט/ית", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הרצאות מעניינות ומאוד מלמדות, כמעט לא היה צורך בתרגולים. חנה מרצה מדהימה, לדעתי הכי טובה בטכניון כיום.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: ברובם לא הכרחיים אם הולכים להרצאות של חנה. רון בבירור מאוד מתלהב מהקורס ומאוד חשוב לו שכולם יאהבו אותו כמוהו, אבל לדעתי אנרגטי מידי ומבלה יותר בזמן ביצירת עניין מאשר בלימוד, עד כדי כך שהמסר הלימודי נאבד בתוך הסיפורים שהוא מספר מסביב. גם, חורה לי שהוא ממליץ בקולי-קולות על חוברת הקורס שלו, שאינה זולה כלל ולדעתי הייתה מיותרת לגמרי - קניתי לצערי, ואני מתכנן למסור אותה בחינם כי אפילו למכור ב-20 ש\"ח (נקנתה במעל ל-100 ש\"ח) כיד שנייה מרגיש לי לא מוסרי.\n\nשעורי הבית: סבבה, לא עמוסים מדי\n\nהמבחן: לא פשוט, אבל הוגן.\n\nהשורה התחתונה: קורס מעניין עם מרצה אחראית תותחית.", "timestamp": 1645199985702}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: אולי המרצה הכי טובה בטכניון, פשוט מעולה.\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: מתרגל מדהים, מסביר מעולה ואכפתי.\n\nשעורי הבית: כמו פיזיקה 1מ, גיליון כל שבוע, אפשר לרפרנס.\n\nהמבחן: מבחן קל יחסית.\n\nהשורה התחתונה: משעמם למי שלא מתחבר, אבל חד משמעית בחירה נכונה בעיניי בתור בחירה מדעית.", "timestamp": 1646391771411}, {"author": "ג", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מדהימה, לא לפספס.\n\nשם המתרגל/ת: זילברמן עודד\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: חביבים סה\"כ, לא קשים יותר מדי ובדר\"כ גם לא לוקחים הרבה זמן.\n\nהמבחן: סה\"כ הוגן.\n\nהשורה התחתונה: קורס נחמד, כן ירבו.", "timestamp": 1649882351880}, {"author": "אתם יודעים מי זאת", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה הראשונה לשמה מלכת הפיזיקה\nחוות דעת - הרצאות: \nחנה היא אישה כל כך מיוחדת לא נחליף אותה באף אחת אחרת. היא יודעת פיזיקה הכי טוב שראיתי בחיים שלי, חמודה וחייכנית פשוט מרצה אמיתית. לכו אליה אם יש לכם שכל ואתם לא תתחרטו! היא קצת מהירה אבל זה בגלל שיש מלא חומר בקורס הדחוס הזה.\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: \nאיתי פשוט איש מקסים ונהדר הוא כל כך מרגיע ונחמד. לכו אליו הוא טוב.\nשעורי הבית: \nבניגוד לפיזיקה 1 בפיזיקה 2 שיעורי הבית לא עזרו לי אלא סיבכו לי את החיים. השאלות שם הם לא שאלות שנותנים בבחינה והם היו מאוד ארוכות ומתוסבכת עם פיתוחים מלאים. לא להילחץ אלה לא השאלות ששואלים בבחינה. פשוט להיעזר במתרגלים וללכת לכל שעות הקבלה.\nהמבחן: \nמבחן חזק מאוד של חנלה. כתבה מבחן יפה. עם קצת מחשבה ושכל ניתן להצליח.\nהשורה התחתונה: קורס עמוס מאוד מאוד להכין דף נוסחאות פגזי המלצה שלי.", "timestamp": 1658236353298}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: דפי ההרצאה של חנה מדהימים ומכסים הכל. יש גם מוקלטות מסמסטר שעבר אם רוצים לעבור על נקודה ספציפית לא מובנת. הייתה אחלה של מרצה והעבירה את החומר בצורה ברורה לאורך כל הסמסטר. יש לציין שגם תפעלה פורום שאלות של תרגילי הבית וענתה לכולם מהר. פשוט הצנזור של פיזיקה בטכניון. לא לפספס.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: קראתי את דפי התרגול. לדעתי היו מאוד מובנים ונחמדים לקריאה. הרמה נמוכה משמעותית מתרגילים להגשה.\n\nשעורי הבית: ארוכים ועמוסים. יש קלים יותר ויש פחות (אהמ גיליונות 3 של גאוס, 8 של אמפר ו9 של השראות). די מפקסים על החומר אבל יש כמה שלא פתירים. אל תהססו לרפרנס.\n\nהמבחן: הכי הוגן שראיתי בחיים שלי. שאלות שאתה מסתכל עליהם בזמן בחינה ואומר וואו מאיפה היא הביאה את השאלה היפה הזאת. המבחנים בכללי לא פשוטים בכלל אבל חנה במועדים שלה כתבה מבחנים הוגנים והמשיכה במגמה הזו.\n\nהשורה התחתונה: עמוס ביחס לנק\"ז אבל הרבה יותר קל להוציא 90+ לדעתי בהשוואה לביולוגיה/ כימיה ממה שיצא לי לחוות.", "timestamp": 1658253863390}, {"author": "רז אמזלג", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: זיו\nחוות דעת - הרצאות: \nמסביר את החומר מעולה מבחינה הבנתית, יחסית ריק אצלו אז מי שלא אוהב ללמוד באולם עם עוד 300 סטודנטים ומחפש יחס אישי זה לגמרי הכיוון. \nשם המתרגל/ת: \nאנטוני\nחוות דעת - תרגולים: \nמרוצה ממנו ממש\nשעורי הבית: \nלא קשים מדי\nהמבחן: \nהוגן, שווה לפתור הרבה מבחנים לפני רוב הפואנטות חוזרות על עצמן\nהשורה התחתונה:", "timestamp": 1658268332236}, {"author": "איש", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ד\"ר זיו מיקוליצקי\nחוות דעת - הרצאות: בעייתיות. מצד אחד זיו מרצה טוב, אפילו מאוד. מסביר את החומר בצורה יסודית ומתעכב על הוכחות, ומנסה לוודא שכל הסטודנטים מבינים את החומר. בנוסף הכיתה אצלו קטנה מאוד (יש הרצאות עם חמישה–עשרה סטודנטים) ולכן סביבה נוחה יותר לשאול בה שאלות. הבעיה היא שכל התענוג הזה מגיע עם מחיר: קצב למידה איטי מאוד של הקורס. במהלך רוב הסמסטר היינו בדיליי די רציני אל מול קבוצת ההרצאה של חנה, וזה השפיע מאוד בכמות הזמן שהייתה לנו לפתור את שיעורי הבית. בנוסף בשלב מסוים ההרצאות והתרגולים יצאו לגמרי מסנכרון וכבר לא היה שווה להגיע בכלל לתרגולים. אפילו הורידו כמה נושאים מהמבחן כי הקבוצה של זיו לא הספיקה ללמוד אותם.\n\nשם המתרגל/ת: שרה לחצר\nחוות דעת - תרגולים: טובים. מתעכבת על ההבנה של החומר. לדעתי התרגולים לא מספיקים, ומומלץ מאוד לראות את רון בסלר ביוטיוב. בסופו של דבר בלעדיו לא הייתי יודע את החומר.\n\nשעורי הבית: מאתגרים יחסית, אבל חשובים. יש לא מעט והם גם תופסים נפח גדול (תקף) מהציון הסופי.\n\nהמבחן: המבחן הוגן, ועם למידה טובה לגמרי אפשר להגיע מוכנים. ממליץ מאוד ללמוד עם מאגר הסרטונים של רון בסלר, הוא ממש מסייע בהבנת החומר.\n\nהשורה התחתונה: קורס לא רע.", "timestamp": 1658395642255}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: ציפיתי בהקלטות של חנה מסמטר חורף (סמסטר קודם), היו 🔥, הרשימות שלה מדהימות! (לקח 4-5 ימים לסיים כל החומר).\n\nשם המתרגל/ת: רון\nחוות דעת - תרגולים: ציפיתי בכמה תרגולים מוקלטים (4-5), היו 🔥!\n\nשעורי הבית: תוך כדי הסמסטר - רפרנס, חזרתי על הכל בהכנה למבחן (ממש ממליץ לפתור לבד לפני המבחן).\n\nהמבחן: התחלתי ללמוד למבחן 14 יום לפני (לא הייתי יודע כלום על החומר בקורס - התחלתי מ-0 - מדובר במועד א) סיימתי הקורס ב- 100, המבחן היה קל (פתרתי 5 מבחנים - כל עבודות הבית - לפחות 2 שאלות היו ממבחנים משנים קודמות).\n\nמבנה המבחן: 13 שאלה, 1 בונוס (8.33 נק' כל שאלה כולל הבונוס - ציון מ- 108.33).\n\nהשורה התחתונה: לדעתי, הכי קל בתואר.", "timestamp": 1658421470799}, {"author": "(;", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: \n*דעה לא פופולארית* \nלא התחברתי. כן, חנה מרצה מעולה, כן היא אכפתית ומאוד ברורה, הדפים שלה מצוינים, וכן נשמע שהיא בן אדם מקסים ומעורר השראה בלי קשר.\nאבל עדיין מאוד מונוטונית לדעתי מה שמקשה על היכולות לשמור על ריכוז. תוסיפו את זה לעובדה שההרצאות שלה מפוצצות, והחומר לא מלהיב במיוחד (לפחות לדעתי) וזה שילוב מנצח לשנ״צ. בשלב מסוים עברתי להקלטות על x2 כי לא הייתי מסוגל יותר.\n\nשם המתרגל/ת: רון/אנטון\nחוות דעת - תרגולים: \nאפשר לראות את הסרטונים של רון ביוטיוב. טיפה חופרים לטעמי אבל סוגר את הפינה. גם אנטון לא רע בכלל, אבל באופן כללי התרגולים לא יותר מידי חשובים לטעמי בשביל להצליח. אפשר גם נטו לעבור על דפי התרגול שמפורסמים במודל ולהסתדר.\n\nשעורי הבית: \nזוועה. לא להתבייש לרפרנס כי לא שווה לשרוף על זה שעות.\n\nהמבחן: \nאפשר לעבור אותו וגם לעבור בציון יפה. לחרוש מבחנים לפני, ודף נוסחאות מתאים הם המפתח להצלחה כאן.\n\nהשורה התחתונה: \nלא התחברתי לחומר בכלל, ריפרנסתי כל גיליון שהיה כמעט ועדיין די הצלחתי בבחינה. לחרוש מבחנים ויהיה בסדר..", "timestamp": 1658523188705}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מרצה מדהימה. כיף ללכת להרצאות ומסבירה בצורה אינטואיטיבית. רואים שממש אכפת לה שכל אחד יבין. ללכת להרצאות זה לא מספיק בשביל לפתור תרגילי בית\n\nשם המתרגל/ת: איתי ארז\nחוות דעת - תרגולים: אחלה גבר. \n\nשעורי הבית: קשים יחסית. פותר תמיד עם הרפרנס מולי אבל משתדל שלפתור בלי \n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס כיף ושווה שאפשר בקלות להוציא בו ציון 90+. כנראה הקורס שהכי נהניתי ממנו הסמסטר", "timestamp": 1658573622395}, {"author": "io", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: כולם ממש מתלהבים ממנה היא כל כך משעממת לא הייתי מסוגלת להקשיב לה דקה\n\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: ממש אכפת לו מהסטודנטים וגם מסביר ממש טוב אבל לא הצליח לגשר על כל הפער שחנה גרמה לי\n\nשעורי הבית: מעיקים ומעצבנים\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1658815769789}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: הרצאות מדהימות כשרואים על כפול 2.\nמרצה מצוינת, יסודית, יודעת לעבור על הדקויות החשובות בחומר. רואים שאכפת לה מהסטודנטים. אישית לא הלכתי לפרונטלי כי איבדתי ריכוז מהר מאוד וגם כי האולם היה מפוצץ באנשים ולכן ממליץ מאוד על המוקלט שלה.\n\nשם המתרגל/ת: רון מוקלט\nחוות דעת - תרגולים: אם יכולתי לומר מי המתרגל הכי פחות מועדף עליי - זה כנראה הוא. השיטות שלו לזכור דברים הם טיפשיות, לא חיוניות ובשלב מסוים הוא מתחיל לעלות על העצבים (כל כך על העצבים שצריך לדלג על חלקי הקרינג' שלו בתרגול). מבחינת איכות ההוראה - ממוצעת. לא יודע מה הבאז סביבו ולמה כל הקורס הזה נראה כמו קורס שיווק של \"הקורס של רון בסלר\".\n\nשעורי הבית: כן ממליץ לעשות לבד למי שיש זמן בסמסטר, למי שאין - לרפרנס. לא להתבייש.\n\nהמבחן: אני חושב שההיסטוגרמה מדברת בעד עצמה. חציון 93 במועד א. היה מבחן סופר קל. 13 שאלות שמתוכן צריך לענות על 12 נכון וכל שאלה הייתה או בדף הנוסחאות או משהו יחסית טריוויאלי שראינו 1000 דוגמאות שלו. אפשר היה לא ללמוד את הקורס כל הסמסטר, להקדיש שבוע וחצי הכנה ועדיין להוציא 100 עבור המבחן הספציפי הזה. לא יודע כמה הייתי ממליץ על זה באופן כללי לקורסים אחרים. \n\nהשורה התחתונה: אני אישית מאוד אהבתי את תוכן הקורס ולכן עקבתי אחריו כל הסמסטר וככה בשלושה ימים הספקתי ללמוד למבחן ולהצליח בו בקלות. למי שיש הרבה זמן למידה למבחן, לגמרי יכול להזניח אותו וללמוד את הקורס בשבוע וחצי / שבועיים אבל זה מאוד תלוי במרצה האחראי כמה תרוויחו במבחן. \nעצה נוספת, תתרחקו מרון בסלר. לדעתי מספיק רק לצפות בחנה.", "timestamp": 1658840240661}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nמסבירה טוב אבל די משעממת.. קצת אוברייטד\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: אחלה מתרגל, עונה על שאלות וסבלני וממש נחמד לסטודנטים \n\nשעורי הבית: הרבה יותר קשים מהמבחן\n\nהמבחן: לא היה קל ממש, אבל סך הכל סבבה\n\nהשורה התחתונה:", "timestamp": 1659081899329}, {"author": "מאיה אלון", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: מאוד מתמטית לא מצליחה להעביר את עולם הפיזיקה בצורה מעניינת. לדעתי פחות טובה \n\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: מצויין ממש, מצליח להעביר את נושא התרגול בצורה מאוד ברורה. \nשעורי הבית: חשובים הרבה יותר קשים מהמבחן\n\nהמבחן: לתרגל מיליון מבחנים לפני ויהיה בסדר\n\nהשורה התחתונה: בעיני מקצוע שהתפספס- סופר מעניין אבל לא מלמדים כמו שצריך", "timestamp": 1663151445376}, {"author": "שלומקה", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: משעממות\nחנה כל כך מונוטונית ואי אפשר להקשיב לה ישנתי כל ההרצאות\n\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: מקסיםםםם ממש רוצה שכולם יבינו ומסביר טוב \n\nשעורי הבית: לא יודעת.. ריפרנסתי\n\nהמבחן: משום מה היה ממש קל לכולם אבל קיבלתי 30 היה מזעזע גם המועד ב שחרשתי אחיו חודש היה מחריד\n\nהשורה התחתונה: קורס משעמם וקשה", "timestamp": 1665230285628}, {"author": "לא חשוב", "difficultyRank": 4, "generalRank": 4, "semester": "202103", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: \nהרצאות מתמקדות על פיתוחים מתמטים הרגשתי שרמת ההרצאות היא מעל הקורס ומעל לרמת המבחן, הייתי כאילו מתקשה בהבנת ההרצאות אבל הכל הסתדר בסוף \n\nשם המתרגל/ת: מני מנשס מוקלט\nחוות דעת - תרגולים: מעולה , ישר ולעניין , מסביר את החומר בצורה הכי פשוטה\n\nשעורי הבית: עוזרים מאוד בהבנת החומר אבל באופי שונה מהמבחן\n\nהמבחן: מועד א היה קשה, צריך שתהיה זוכר את חומר של פיסיקה 1 , שאלות משלבות בין מכניקה לחשמל , המבחן התמקד על נושאים קשים בקורס וכמעט לא היו שאלות על החומרים הנחשבים קלים בקורס\n\nהשורה התחתונה: לא ממליץ לבזבז זמן וללכת שעות קבלה אצל זין שהוא המרצה היחיד בסמסטר, פשוט אם הלכת לו עם שאלה הוא אפילו לא מחזיק עט ומסביר לך במופרש איך פותרים , מסביר מילולי והעזרה הזות הסתודנט יכול לקבל מהרפרנסים", "timestamp": 1666127053959}, {"author": "Daniel Litvak", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "תראו את חנה\nתפתרו את המטלות, תעזרו ברפרנסים ותלמדו מהם במידת הצורך\nאם תלמדו למבחן ברצינות לא יהיו יותר מידי הפתעות ויהיה קל יחסית", "timestamp": 1666533936953}, {"author": "לולאת אמפר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nשלוש שעות של מלחמה. חנה לא מפסיקה לכתוב/לדבר/להדגים ומי שלא מרוכז מאבד את זה מהר. חשוב כן להיות חד בהרצאות כי יש חומר בהרצאה שלא עובר בתרגול. חנה עצמה מדהימה אבל ההרצאות עמוסות מידי בחומר.\nשם המתרגל/ת: ליאת\nחוות דעת - תרגולים: \nבינוניים.. כשיש רק שעה אחת תרגול על 3 שעות הרצאה קשה מאוד לכסות את רוב החומר הנלמד.\nשעורי הבית: \nקשים. אפשר ורצוי להיעזר ברפרנסים, העיקר להבין בסוף מה עושים.\nהמבחן: \nהמועד של חורף תשפ\"ג א' היה ממש קשה בפער ממה שראינו שנה שעברה ואפילו היה פקטור של 8.33 נקודות(שווה ערך לשאלה אחת במבחן). בד\"כ המבחנים בפיסיקה יותר הוגנים ואפשר להוציא גבוה.\nהשורה התחתונה: \nקורס עמוס מאוד ולא פרופורציונלי לנק\"ז שמקבלים עליו. לא בהכרח הבחירה המדעית הקלה למי שמתלבט עליו.", "timestamp": 1675692527215}, {"author": "YT", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: ראיתי מוקלטים, אחלה חנה. להריץ על פי 2 וההרצאה עוברת אחלה.\n\nשם המתרגל/ת:  עודד מוקלט\nחוות דעת - תרגולים: מתרגל סביר ולא יותר מזה, בדיעבד בזבוז זמן ואפשר לא לראות הקלטות של התרגולים אם לא מתכננים לעשות שיעורי בית\n\nשעורי הבית: מרופרנסים לגמרי, ואפשר לעשות בכמה דקות. אם באמת פותרים יכול לקחת מעל יום לגיליון(שבועי)\n\nהמבחן: יחסית חזרתי לאחר שפותרים הרבה מבחנים ולגמרי אפשר ללמוד אליו בשבוע וחצי אם לא עקבתם כל הסמסטר בכלל\n\nהשורה התחתונה: החומר לא פשוט אבל לא חייב לעקוב על הקורס בזמן סמסטר כדי להוציא אחלה ציון בלמידה של 10 ימים.", "timestamp": 1676296176165}, {"author": "כריס", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: לפעמים מתעמקת הרבה יותר מדי אבל היא הבסיס להבנה של הכל. חשוב מאוד להבין את כל הדוגמאות שלה. \n\nשם המתרגל/ת: ליאת נמירובסקי\nחוות דעת - תרגולים: מתרגלת מעולה. סבלנית ממש ופותרת את התרגילים באופן ברור, שלב אחרי שלב. \n\nשעורי הבית: לא מכבידים מדי, מאוד תורמים להבנת החומר. \n\nהמבחן: לתרגל כמה שיותר מבחנים לפני ויהיה בסדר. \n\nהשורה התחתונה: אחלה קורס, גם למי שלא אוהב פיזיקה.", "timestamp": 1676379387029}, {"author": "סטודנט מן המניין", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: תראו מוקלט מסמסטרים קודמים, מספיק לגמרי. רק תוודאו שלא שינו משהו בסילבוס (גם אם כן שינויים מינורים). חנה מעולה אין מה לפרט...\n\nשם המתרגל/ת: עודד\nחוות דעת - תרגולים: גם הקלטות מסמטרים קודמים, מומלץ מאוד, יודע להעביר את החומר ומדבר בשפה שלנו.\n\nשעורי הבית: לא קשים מדי ולרובם יש רפרנסים. כל שבוע גיליון אך נפתחים הרבה מראש לכן אפשר לפתור כמה יחד ולקבל שקט להמשך. הם מלמדים אך אינם חובה להצלחה בקורס.\n\nהמבחן: פייר. 12 שאלות אמריקאיות. בכל מבחן יש בין שאלה אחת לשלוש שהן קשות/לא מובנות ושם צריך אינטואיציות וידע אך את רוב השאלות ניתן לפתור עם דף נוסחאות טוב.\n\nהשורה התחתונה: אחלה של קורס, מעניין ולא דורש הרבה השקעה לאורך הסמסטר. אפשר גם להזניח לגמרי וללמוד שבועיים מראש במידה ולמדתם פיסיקה בתיכון. \nהמלצה, השקיעו זמן בגישה והבנת אינטגרלים של שטחים ורוצו לפתור הרבה מבחני עבר פשוט.", "timestamp": 1677421633604}, {"author": "L", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות:\n מרצה טובה, מסבירה את נושאים ישר ולעניין \n\nשם המתרגל/ת:ליאת \nחוות דעת - תרגולים: \nמתרגלת טובה שמבירה את נושאים כמו שצריך.פותרת את שאלות בתרגול בצורה מובנת.לפעמים לא מספיקה את כל שאלות של תרגול שצריך אחר כך להשלים אחרי תרגול.\nשעורי הבית: \nברמה סבירה\nהמבחן: \nמועד א היה מבחן נוראי\nמועד ב היה יותר סבבה\nהשורה התחתונה:", "timestamp": 1677536284770}, {"author": "----", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: ראיתי הקלטות, מקצוע כבד מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: משום מה יש להם נטייה לפתור דרך האינטגרלים הכבדים ולפי הגדרה במקום בדרכים הפשוטות.. קורס כבד מאוד. צריך לתרגל המון המון מבחנים כדי להגיע מוכנים ויש שאלות שחוזרות על עצמן\n\nשעורי הבית: הרוב נלקח ממבחנים\n\nהמבחן: היה פקטור של 8 נקודות\n\nהשורה התחתונה:", "timestamp": 1678965649854}, {"author": "Malak Azzam", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nבמוקלטים הכל מובן וסבבה מביאה הרבה דוגמאות שעוזרות בפתרון השעורי בית\nשם המתרגל/ת: רון \nחוות דעת - תרגולים: תרגולים אחלה ממש מעניינים והכל מובן חוזר על החומר בצורה טובה וכיפית\n\nשעורי הבית: דיייי ארוכיםםםםם !!!\n\nהמבחן: היא מביאה שאלות מפיזיקה 2מ או ממ וזה מעצבן ! ניתן להביא ציון אבל קשה\n\nהשורה התחתונה:", "timestamp": 1679232211297}, {"author": "ג", "difficultyRank": 3, "generalRank": 3, "semester": "202003", "text": "שם המרצה: זיו\nחוות דעת - הרצאות: מסודר, אבל ההסברים לא תמיד מובנים. \n\nשעורי הבית: לוקחים זמן, אבל סבירים\n\nהמבחן: באתי מוכן למועד א, קיבלתי איזה 30.\nבאתי לא מוכן למועד ב, קיבלתי איזה 80.\nמסקנה - אין קשר בין הציון להבנת החומר הנלמד.\n\nהשורה התחתונה: אין מה להתחיל את הקורס יותר מדי במתח, מכיוון שפוטנציאל הכישלון איננו גבוה. תזרמו.", "timestamp": 1679240791609}, {"author": "no", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: hanna\nחוות דעת - הרצאות: the best\n\nשם המתרגל/ת: ron besler on youtube\nחוות דעת - תרגולים: the best \n\nשעורי הבית: idk\n\nהמבחן: was ok for peaople who learned and have a good daf noshaot\n\nהשורה התחתונה: really good course", "timestamp": 1679305879936}, {"author": "מאיה", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: פעם ראשונה שראיתי את כל ההרצאות בקורס. \n\nשם המתרגל/ת: לא הלכתי \nחוות דעת - תרגולים: ללא \nראיתי פקל של מישהו תותח לא זוכרת מה השם שלו באתר של סטאדיס- זה היה בול החומר שלנו זה נראה לי תואם במיוחד לטכניון, ופשוט ראיתי את הפקל תוכ הסימסטר ואז שוב לקראת המבחן והלך סבבה \n\nשעורי הבית: חמודים \n\nהמבחן: פייר מאוד\n\nהשורה התחתונה: קורס אחלה", "timestamp": 1684842755992}, {"author": "פיסיקה 2", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: ממש ברורה. מדגימה ונחמד. צריך ללכת קיצור. הרצאות נעימות.\n\nשם המתרגל/ת: מנגל עילי\nחוות דעת - תרגולים: נחמד מאוד. תרגולים ברורים אם יש מומלץ לשאול אותו שאלות\n\nשעורי הבית: טובים וברורים. סופר חשוב לפתור כי חצי מהמבחן זה זה.\n\nהמבחן: אמריקראי\n\nהשורה התחתונה: קורס כיף! החלק הכי חשוב זה להבין את הרעיון המתמטי/פיסיקלי של האינטגרלים בקורס כי זה בסיס להנדסה.", "timestamp": 1691238446977}, {"author": "מיכאל חזן", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: \nמדהימה, מלמדת טוב, עושה גם תרגילים בכיתה. יש לה רשימות והקלטות מצוינות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1691612789537}, {"author": "חרוט עבה וחלול", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: ראיתי הקלטות של חנה, והיא מעולה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא ראיתי.\n\nשעורי הבית: העתקתי הכל.\n\nהמבחן: סבבה סה\"כ.\n\nהשורה התחתונה: נחמד, לא קשה מדי. למדתי את כל החומר + להתכונן למבחן בשבוע - שבוע וחצי ואפשר להוציא ככה אחלה ציון.", "timestamp": 1691736594230}, {"author": "אוסילטור הרמוני 3: מעגל RLC", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דר. חנה מרטיסקאינן\nחוות דעת - הרצאות: \nלדעתי ההרצאות היו טובות, אבל לא ממש נהדרות כמו שאנשים רשמו בשנים קודמות. חנה היא מרצה טובה והיא מעבירה את החומר ברור ובהספק טוב אבל העניין הוא שהיא מסבירה אותו לפרטי פרטים וחוזרת על הרבה דברים בסיסיים. חוץ מזה, רוב ההרצאות זה פיתוחים מתמטיים שמבוססים בעיקר על חדוא2 ומלא מלא אינטגרלים ככה שיש ממש קצת חוקי פיסיקה אמיתיים. גם היו מלא אנשים בהרצאה, משהו כמו 300+ באולם של 350-400 ככה שאין מצב שאפשר לשבת קרוב. אבל סך הכל אני ממליץ להגיע להרצאות אם יש לכם זמן לזה, גם אם משעמם.\n\nשם המתרגל/ת: יש כמה וזה לא רלוונטי מי\nחוות דעת - תרגולים: \nאחרי התרגול ה-3 הבנתי שהתרגולים לא תרמו לי יותר מידי, ובניגוד לפיסיקה 1 זה לא בגלל המתרגלים אלא בגלל שדוחפים 3 שעות הרצאה בשעה אחת תרגול, שזה לא מספיק בעליל. מה גם שבהרצאות חנה פותרת יותר דוגמאות מבתרגולים עצמם, ויש גם את רון בסלר ביוטיוב ככה שאפשר לוותר על התרגולים לגמרי.\n\nשעורי הבית: \nאותו סגנון כמו פיסיקה 1. עד לגיליון 8 הרמה הייתה סבירה, גיליון 8 היה מגעיל ואחר כך אני די רפרנסתי כי לא היה לי זמן. מי שפותר הכל לבד יכול להוציא במבחן ציון טוב.\n\nהמבחן: \n12 שאלות אמריקאיות. חוץ משאלה אחת שהייתה מאוד מסובכת ולא מובנת שאר המבחן היה פתיר. המלצה שלי- תפתרו שאלות ממבחנים של פיסיקה 2ממ של חנה, יש לה מנהג להביא שאלות משם, ותכינו לעצמכם דף עם דוגמאות פתורות ממבחנים לצרף לדפי נוסחאות.\n\nהשורה התחתונה: \nקורס עם מלא חומר, מעט מאוד פיסיקה אמיתית- הרוב חדוא2 אבל בגלל שהקורס הוא 3.5 נקז זאת אחלה הזדמנות להעלות ממוצע.", "timestamp": 1691835429800}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הקלטות של חנה\nחוות דעת - הרצאות: \nהקלטות די מעניינות וחשובות, לצפות על 1.5. אל תסכמו אתם לא תקראו את זה בחיים. חנה מרצה מעולה!\nשם המתרגל/ת: נעה קשת\nחוות דעת - תרגולים: \nהיא מתרגלת תותחית ברמות, סופר אנרגטית, מרימה ונותנת אינטואיציה ממש טובה לחומר בקורס, לא ברור איך לא שומעים עליה יותר. \nשעורי הבית: \nבגדול לא רפרנסתי אותם, קשים למדי החל משלב מסוים אבל לדעתי מאוד מכינים לבחינה. מה שכן שמעתי על המון אנשים שרפרנסו הכול והצליחו מאוד בקורס אז זה לא תנאי הכרחי להצלחה.\nהמבחן: \nהייתה לנו שאלה אחת מאוד מאתגרת - מעטים הצליחו לפתור אותה. שאר השאלות היו סבירות, המון דברים שדומים לגליונות ובלי הפתעות מיוחדות.\nהשורה התחתונה: \nהדבר הכי חשוב בקורס זה להפנים את השימוש באינטגרלים, זה חוזר בהמון נקודות בקורס וזה בגדול מה שמבדיל אותו מהבגרות בחשמל. אני מאוד התעניינתי בקורס וזו לדעתי אחלה בחירה מדעית - לא באפס השקעה.", "timestamp": 1691955616579}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה מוקלט\nחוות דעת - הרצאות: אחלה הרצאות, זורם ממש לצפות בX1.5 וחנה מן הסתם מרצה מצוינת ומסבירה נהדר.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: הסתפקתי רק בלקרוא את הדפי תרגול שפורסמו במודל, תכלס זה די הספיק לי לפחות.\n\nשעורי הבית: די מאתגרים, במיוחד בשבועות האחרונים יותר. ממליץ כן לנסות לפתור אבל לא לפחד מהרפרנס ולא להיתקע על זה יותר מדי זמן, המבחנים הרבה פחות קשוחים מהם.\n\nהמבחן: יומיים של חזרה על החומר + שלושה ימים של לחרוש מבחנים מספיקים לדעתי. ממש ממליץ לפני/תוך כדי שמתחילים לפתור בחינות לצפות בסרטונים של רון בסלר/חנה פותרים ומדגימים שאלות ממבחנים, כי יש המון שאלות שחוזרות על עצמן וזה מאוד עוזר להבין איך לגשת לשאלות. המבחן הוגן ודי יודעים למה לצפות.\n\nהשורה התחתונה: במהלך הסמסטר די הייתי עליו חצי קלאץ' אבל היה נחמד סה\"כ. כדאי להיות משופשפים על אינטגרלים כי יש הרבה מהם אבל חוץ מזה קורס בסדר גמור.", "timestamp": 1691958183583}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: הרצאות מעניינות וברורות, אוהבת להרחיב בפיתוחים מתמטיים ואינטרלים. חוץ מזה מלכה, כהרגלה. עונה על שאלות לפני מבחנים בפירוט רב, מסבירה מאוד ברור.\n\nשם המתרגל/ת: נועה קונפורטי\nחוות דעת - תרגולים: נראה שזאת הפעם הראשונה שהיא מתרגלת את הקורס, אבל רואים שהיא השתדלה שנבין ושיהיה ברור מה למדנו בתרגולים.\n\nשעורי הבית: גליונות במודל, שווה להשקיע מאמץ. אם נשאר נסיון אחרון- לרפרנס, הגליונות הם 15 אחוז תקף.\n\nהמבחן: 12 שאלות אמריקאיות, לפחות בחצי מהן מציבים בנוסחא מדף הנוסחאות שמביאים למבחן.\n\nהשורה התחתונה: קורס קצת עמוס, אבל חובה. אם בונים דף נוסחאות טוב ויושבים על החומר בסמסטר- אין סיבה לא לקבל 80+", "timestamp": 1692178893893}, {"author": "***", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשעורי הבית: \nמרפרנסים, לא משהו קשה\n\nהמבחן: \nהמבחן היה הוגן \n\nהשורה התחתונה: \n\nממליצה מראש לקחת את הפקל של ערן אברהם שיעשה לכם סדר בקורס. ניסיתי לראות את ההרצאות וגם את התרגולים והרגשתי שהם ממש סיבכו את הקורס, ערן לימד את הכל בצורה פשוטה (לקחתי פקל מוקלט לפני המבחן) וזה הציל לי את הקורס.", "timestamp": 1704611465914}, {"author": "סטודנטיתתתת", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חנה מוקלט \nחוות דעת - הרצאות: \nמעולה ואישית מעדיפה אותה על 1.5 /2 במוקלט. \nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: מתרגלת ממש טוב וברורה מספיקה את כל החומר + שאלות\nשעורי הבית: במודל, בסהכ בסדר ולא לוקחים יותר מדי זמן ותמיד יש רפרנס אם מתעצלים.\nהמבחן: הוגן כשמבינים את החומר כמו שצריך. \nהשורה התחתונה: קורס מעניין וחנה מרצה מעולה.", "timestamp": 1704635519560}, {"author": "זרם דק קולח", "difficultyRank": 3, "generalRank": 5, "semester": "202203", "text": "שם המרצה: חנה (הקלטות)\nחוות דעת - הרצאות: חנה כל כך טובה שגם אנשים שמשלמים אלפי שקלים על סמסטר קיץ לא הולכים פרונטלי ורואים הקלטות שלה. מעבירה את החומר בצורה מעניינת וברורה.\n\nשם המתרגל/ת: רון בסלר (יוטיוב)\nחוות דעת - תרגולים: התרגולים של רון ביוטיוב מעולים. יש גם המון שאלות ממבחנים שהוא פתר שעזרו לי מאוד. אל תפספסו.\n\nשעורי הבית: זה מסוג הקורסים שכדאי לנסות לפתור בראש את השאלה ואז לרפרנס. המתמטיקה שם הרבה יותר קשה מהמבחן ולא שווה להתעכב על זה.\n\nהמבחן: יש הרבה חומר אבל אין הפתעות אחרי שעוברים על 10-15 מבחנים. הרבה יותר קשה מפיזיקה 1.\n\nהשורה התחתונה: לפני תחילת הקורס מומלץ לעשות אימוני גמישות לאצבעות יד ימין, שחלילה לא ייתפסו לכם באמצע המבחן וכל התוצאות יצאו לכם הפוכות.", "timestamp": 1705262238054}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חנה \nחוות דעת - הרצאות:  חנה אלופה,  מי שעשה פיזיקה 1מ עם חנה לא צריך יותר מידי סיבות כבר למה כדאי ללכת להרצאות שלה. קצב טוב, הסברים ברורים ותמיד נכונה לעזור.\n\nשם המתרגל/ת: התייאשתי מהם באמצע, לא מתחרט\nחוות דעת - תרגולים:  אני הפסקתי בערך באמצע הסמסטר. הכמה הראשונים חשובים בשביל הבסיס המתמטי , את כל השאר אפשר למצוא ברשומות של ההרצאות ולהסתדר לגמרי.\n\nשעורי הבית: סבבה , יש רפרנסים. לא להעתיק כי התרגול מכין לרמת המבחן (אפילו קצת יותר קשה אבל זה שווה את זה).\n\nהמבחן: אמריקאי. אפשר לשמוח, הוא פחות קשה מ-1מ. בדכ שאלות מורכבות מאלמנט מרכזי 1 בשונה מ1מ שעושים לפעמים סלט.\nלתרגל הרבה מבחנים ותצליחו.\n\nהשורה התחתונה: לעשות ש.ב ולא לזלזל בהם, לעשות הרבה מבחנים.\n\n*הערה חשובה*  אם רוצים לסמן קובייה שכבר הושחרה בטופס הטורי- מוחקים אותה בטיפקס ומציירים קובייה שוב ועושים x. תקראו את זה שוב ואולי תחסכו עוגמת נפש רצינית.", "timestamp": 1706786201298}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202203", "text": "שם המרצה:  חנה הרצאות\nחוות דעת - הרצאות:  מרצה מעולה, ההקלטות מאוד נוחות ועוזרות למי שאין כח ללכת לשיעור. \n\nשם המתרגל/ת:  רון בסלר יוטיוב\nחוות דעת - תרגולים: רון אחלה מתרגל, אבל לפעמים מגזים בצורה שהוא מלמד. אפשר גם ללמוד את הקורס בלעדיו וזה ממש בסדר. \n\nשעורי הבית:\n גליון בשבוע, מאוד קשה. בלי לרפרנס זה לשבת שעות על כל גליון. בסופו של הדבר הש\"ב הרבה יותר קשים מהמבחן. \n\nהמבחן: \nאמריקאי, רובו דיי אותו סגנון שאלות של שנים קודמות, אבל מדיי פעם זורקים איזה שאלה או שתיים שמצריכה הבנה מאוד טובה של החומר. אם עוברים על מלא מבחנים לפני מקבלים ציון טוב.\n\nהשורה התחתונה: \nקורס קשה, הרבה מאוד מתמטיקה ואינטגרלים. הגליונות עם המועקה העיקרית בקורס, אבל המבחן יחסית קל יותר אז זה בסדר", "timestamp": 1707218090862}, {"author": "צור", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nמיכל\nחוות דעת - הרצאות: \nמעולה ומעניינת, כתב לא ברור\nשם המתרגל/ת: \nנועה קשת\nחוות דעת - תרגולים: \nמושלמת\n\nשעורי הבית: \nטיפה ממוחזרים מהדרייב, לא קשים מאוד\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713362691981}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה מרטיסקאינן\nחוות דעת - הרצאות: יש סיבה ששמה הולך לפניה, מרצה מושלמת.\nמסבירה את החומר וכל בעיה (לא משנה עד כמה היא מרגישה לא פתירה) בצורה ברורה, מעניינת, ברוגע ובנועם. הרשימות שלה מעולות, מסודרות וההסברים ממש מפורטים, גם של המבחנים. אין כמו חנה!\n\nשם המתרגל/ת:  נועה קשת\nחוות דעת - תרגולים: מעולה! מסבירה בצורה מאוד ברורה ומובנת את התרגולים מומלצת מאוד. \n\nשעורי הבית: מאתגרים, יש הרבה חומר וקל ללכת לאיבוד, אבל מכינים טוב לרמה של המבחן.\n\nהמבחן: צריך להתכונן טוב, דורש לחשוב, מאתגר אבל הוגן ואפשרי לגמרי רק חשוב לעבוד מסודר, הכוונה שיש דף נוסחאות ותרגילים שנראים סופר דומים אחד לשני אז קל להתפתות לנסות לעבוד מהסוף להתחלה.\n\nהשורה התחתונה:", "timestamp": 1713466400950}, {"author": "המדמחיסט", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nנכתב כאן בביקורות קודמות ואכתוב שוב, חנה מרצה מצויינת. ממליץ מאוד ללכת להרצאות שלה.\n\nשם המתרגל/ת: קונפורטי נועה\nחוות דעת - תרגולים: \nמתרגלת טובה, מסבירה טוב את התרגילים. כשצריך וכשיש שאלות היא מתעכבת ועונה על הכל. ממליץ בחום.\n\nשעורי הבית: \nגיליון במודל כל שבוע. תרגילים קלילים (יחסית לפיזיקה 1מ), אם יודעים את החומר אין שום בעיה לפתור אותם לבד, ואם לא אפשר להצליח עם עזרה מינימלית בשעת קבלה.\n\nהמבחן: \nמבחן אמריקאי קליל (יחסית לפיזיקה 1מ), בקלות אפשר לקבל ציון ממש טוב אם יודעים את החומר. אם תבחרו לעשות דף נוסחאות בעצמכם ממליץ במהלך הסמסטר להוסיף אליו נוסחאות כדי שבסוף הסמסטר דף הנוסחאות יהיה מוכן, מקסימום תוסיפו כמה נוסחאות שימושיות אחרי פתירת שאלות ממבחנים אם צריך. בכללי לא צריך איזה הברקה או חשיבה עמוקה כדי לפתור שאלות ברמת מבחן, סוגי השאלות חוזרות על עצמן ואחרי הצבה בנוסחא הנכונה אין הרבה עבודה כדי להגיע לפתרון.\n\nהשורה התחתונה: \nקורס לא קשה בכלל. הסמסטר הזה היה מקוצר בגלל המלחמה, 12 שבועות במקום 13, אז כמה נושאים ירדו מהחומר. הייתי אומר שכדאי ללכת לתרגולים כי יש לפחות מושג אחד שהיה בתרגולים ולא בהרצאות, ולצערי גיליתי את זה רק במבחן. למי שמתלבט בין פיזיקה 2 ו-3 לבין פיזיקה 2ממ (כבחירת שרשרת מדעית), ממליץ על 2 ו-3 כי למרות הנקז, הקורסים הרבה פחות עמוסים ורק יעלו לכם את הממוצע.", "timestamp": 1713724723753}, {"author": "aviv avital", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה\nחוות דעת - הרצאות: \nהיו מעולות, יש גם הרבה הקלטות כדי לחזור על דברים וגם עונים על שאלות בהרצאה \nשם המתרגל/ת: שי בלום\nחוות דעת - תרגולים: \nהתרגולים היו מצומצמים מבחינת כמות אנשים, זה נתן את האופציה לשאול מלא שאלות ואני בעד, בכללי התרגולים בפורמט של לפתור שאלות על הלוח שיש להם פתרון בטופס אז לא היה הרבה מקום לטעויות\nשעורי הבית: \nלי הרגישו מועילים, יש רפרנס שהשתמשתי בו להשוואה כדי לא לבזבז הגשות אבל בסך היו מאוד דומים (ולפעמים קשים יותר בקצת) למבחן\nהמבחן: \nדי הוגן, אולי שאלה אחת שהרגשתי שהיא פחות בסקופ של דברים שעשינו בקורס\nהשורה התחתונה: קורס משלים סביר לסמסטר אבל כן צריך לעקוב לאורך הסמסטר כדי להצליח", "timestamp": 1713884699797}, {"author": "גאוס", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חנה \nחוות דעת - הרצאות: \nחנה מלכה , אחת המרצות הנדירות בטכניון , מלמדת בצורה מעניינת , מאוד ברורה , אין עליה \nשם המתרגל/ת: נועה \nחוות דעת - תרגולים: סבבה \n\nשעורי הבית: רפרנסתי \n\nהמבחן: \nמועד א היה הוגן , מועד ב היה יותר קשה אבל עדיין פתיר , חשוב להיות עם דף נוסחאות טוב \nהשורה התחתונה: קורס סבבה ואפשרי", "timestamp": 1716195068956}]}