{"posts": [{"author": "בולצמן", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: קצת לא מסודרות ולפעמים לא הכי ברור אבל לקחת קורס עם עמית זו חוויה בפני עצמה\n\nשם המתרגל/ת: רוי רבליה\nחוות דעת - תרגולים: ה-מתרגל של הטכניון. מעולם בקורס פיזיקה לא היו תרגולים מובנים כל כך, שעוזרים ללמד כל כך, שקשורים לחומר כל כך.\n\nשעורי הבית: מעולם בקורס פיזיקה לא היו שיעורי בית מובנים כל כך, שעוזרים ללמד כל כך, שקשורים לחומר כל כך.\n\nהמבחן: בסדר, למי אכפת\n\nהשורה התחתונה: הנושא של הקורס בסיסי וחשוב מאוד. לא טראומטי כמו 2פ, לא הכי קל בעולם וצריך להשקיע זמן.", "timestamp": 1599385619604}, {"author": "סטתרמית", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: קצת מבולגנות אבל כתב סיכומים לכל החומר שעזרו ללמוד בסופו של דבר. עבר על החומר קצת מהר מדי.\n\nשם המתרגל/ת: רוני גופמן\nחוות דעת - תרגולים: מושלמת\n\nשעורי הבית: ממש מעניינים וכיפיים לפתור!\n\nהמבחן: הוגן אבל לא קל.\n\nהשורה התחתונה: עבר טוב עם הסגל הזה, קורס מעניין שבאמת מלמד סוף סוף דברים רלוונטיים בתואר.", "timestamp": 1609761439988}, {"author": "כללי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: לפי הבנתי הקורס עובר בצורה שונה בין כנרת ועמית. אצל כנרת ממש חילקנו את הקורס לשני חלקים, חלק ראשון של תרמודינמיקה וחלק שני של פיזיקה סטטיסטית. בגדול יש כמה קונספטים חדשים שלומדים.\n\nשם המתרגל/ת: עידן בן דור\nחוות דעת - תרגולים: התרגולים לרוב ממשיכים את ההרצאות ולכן הם חשובים. הועברו בצורה טובה ולא נשארה שאלה פתוחה.\n\nשעורי הבית: קשים בנסיון ראשון אבל לאט לאט נכנסים לראש של השאלות.\n\nהמבחן: מועד א היה קשה אך לא מידי. יותר קל לדעתי ממבחני עבר.\n\nהשורה התחתונה: קורס נחמד עם כמה קונספטים מעניינים, הרבה הנחות שעשו בדרך להוכחות בהרבה מקרים.", "timestamp": 1629444120733}, {"author": "s", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: מרצה טובה מאוד, הסבירה את החומר מאוד טוב ונתנה דוגמאות תוך כדי (מה שאצלי לפחות הפך את התרגולים למיותרים).\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יש תרגולים כתובים במודל שכתוב בהם הכל בצורה ברורה.\n\nשעורי הבית: גליון שבועי, לא ארוך יותר מדי.\n\nהמבחן: היה הוגן, שאלה אחת על תרמודנימיקה ושלוש על סטטיסטית.\n\nהשורה התחתונה: קורס מעניין מאוד.", "timestamp": 1631199606659}, {"author": "סטודנט כללי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: כנרת בסך הכל ברורה ומשתמשת בלא מעט דוגמאות כדי להסביר את החומר. מרגיש שהבנייה של הקורס בשני חלקים נפרדים של תרמודינמיקה ומכניקה סטטיסטית פגעה קלות ביכולת עיכול החומר וזכירתו עד למועד הבחינה.\n\nחוות דעת - תרגולים: בגדול מעבים את החומר של ההרצאות תוך מתן עוד דוגמאות.\n\nשעורי הבית: גיליון שבועי כיאה לקורס של 5 נק\"ז, לא קלים אך בנויים על החומר שנלמד בכיתה.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס שמלמד כמה דברים נחמדים בפיזיקה :)", "timestamp": 1634564416650}, {"author": "Jared Goldberg", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: כנרת עקבה אחד לאחד אחרי הספר של קרדר. אין לי ממש תלונות ספציפיות על ההרצאות, היא הייתה מסודרת, עניינית, כל הזמן עם הקשר של התמונה הגדולה של הקורס. פשוט היה רושם מאוד גדול שיש דקויות חשובות, בעיקר בחלק של סטטיסיקה קוונטית והחלק של אנטרופיה, שהיא לא ממש שולטת הכי טוב בחומר. בנוסף, בעיניי הקורס נתן דגש בחלק של התרמודינמיקה יותר מידי גדול על ניסוחים ופורמולציות מיושנות ופחות רלוונטיות לפיזיקה מודרנית.\n\nשם המתרגל/ת: יונית מרודס-זקס\nחוות דעת - תרגולים: שוב, היה רושם לצערי שיונית לא ממש שלטה על החומר. היא הרגישה קצת לחוצה ברוב השיעורים, ולא ממש העבירה אותם מעבר ללהקריא. היא סופר נחמדה ואיכפתית, פשוט לא כזאת מתרגלת דינמית. חומר התרגולים כן היה אבל מאוד רלוונטי לקורס ובסה\"כ הרשימות שלהם היו מעולים ומאוד עזרו.\n\nשעורי הבית: בהתחלה (תרמודינמיקה) רנדומליים, לא קשורים, הזויים, מעורפלים וחסרי הקשר או קשר גלוי לחומר.\n\nהמבחן: מועד א מאוד מכשיל, שהיה בו גם צורך בנוסחא שלא נלמד בקורס, וגם עניין מאוד חריג של שאלה שדרך הפתרון המוצע אינו בהכרח נכון... מועד ב מאוד הוגן. \n\nהשורה התחתונה: קורס *יפהפה* שלצערי קצת איכזב בגלל סגל יחסית חלש. יש ספר של Richard Swendon שאם אתם מוצאים את עצמיכם שאותה סיטואציה (סגל חלש) שמציג את הנושא בצורה נפלאה ונגישה.", "timestamp": 1634914183381}, {"author": "/", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: כנרת קרן\nחוות דעת - הרצאות: כנרת מרצה טובה. היא חילקה את הקורס לשני חלקים, חלק תרמודינמיקה וחלק פיזיקה סטטיסטית.\nהגישה של כנרת הייתה גישה פחות מתמטית בקורס. יש הרבה מתמטיקה אבל היא מאד ניסתה שלא להכנס לזה אם לא חייב, ומאד העריכה חשיבה פיזיקאלית להסברים של דברים שנלמדים בקורס מעבר להסבר מתמטי, שזו גישה מרעננת עד כה בקורסים שנלמדו בפיזיקה.\nהחלק של התרמודינמיקה כמעט בכלל לא התבסס על מתמטיקה. אחר כך בסטטיסטית הוכחנו אותם מחדש בשימוש מתמטי, והכל מתחבר. כך שאם לא מבינים על ההתחלה את החלק של התרמו זה בסדר, לגיטימי שאסימונים ייפלו מאוחר.\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: מושלמים. מתרגל מעולה. זמין מאד במייל לשאלות ומסביר נפלא.\nהתרגולים עצמם קצת עמוסים, אבל כמה שיותר דוגמאות יותר טוב.\n\nשעורי הבית: היו קשים, מאד שברתי עליהם את הראש. אבל בדיעבד עזר במבחן אז לא לוותר\n\nהמבחן: מועד א היה בסדר. לא קשה מדי ולא קל מדי. התבסס על החומר הנלמד, תרגולים הרצאות ושיעורי בית, ולא היו יותר מדי הפתעות\n\nהשורה התחתונה: קורס מדהים וקשה, מאד נהנתי בו, לדעתי הקורס הכי יפה שעובר בסמסטר רביעי.", "timestamp": 1634977546967}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יריב כפרי\nחוות דעת - הרצאות: \nיריב מעולה בעיקר בגלל שממש חשוב לו ללמד. הוא מאוד קשוב לשאלות, מוודא הבנה ומערב את הכיתה. ההרצאות עצמן בנויות בצורה מצוינת ויריב מפרסם רשימות מאוד מסודרות שמכילות את כל הפיתוחים המתטיים שהוא עושה בכיתה.\n\nשם המתרגל/ת: יונית מרדוקס\n\nחוות דעת - תרגולים: \nקצת מבוהלת לפעמים אבל מלאת מוטיבציה ללמד כמו שצריך לכסות את החומר. התרגולים עצמם עמוסים אבל לרוב מתכתבים עם מה שצריך לדעת באותו שבוע.\n\nשעורי הבית: \n7 גליונות לאורך הסמסטר. בגלל שהחומר בקורס זר מאוד ביחס לפיזיקות אחרות הם נעים בין קלים מאוד כשתופסים את הקונספט לקשים מאוד. הכל ממוחזר משנים קודמות ויש בדרייב פתרונות מפורטים שכדאי לעבוד איתם כשלא מבינים.\n\nהמבחן: \nדומה לשיעורי בית.\n\nהשורה התחתונה: \nאחד הקורסים הכי טובים בתואר לדעתי. החומר והתפיסה שונה לחלוטין מכל מה שלומדים עד אז. חצי מהקורס מתמקד בתרמודינמיקה (קל מתמטית וקשה תפיסתית) והחצי השני במכניקה סטטיסטית (קשה מתמטית וקצת פחות קשה תפיסתית). יריב עשה הקבלות כל הזמן בין שני הנושאים, מקשר לדברים בעולם האמיתי והאווירה באופן כללי נעימה. הדבר היחיד שבעייתי זה שהוא לא מסכים להקליט בדרך כלל. העומס בקורס לא מאוד גדול ביחס לזה שהוא 5 נקודות כי אין המון הגשות, אבל חשוב להיות עליו כי החומר נבנה וקשה להשלים במהלך הסמסטר.", "timestamp": 1657644819741}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יריב\nחוות דעת - הרצאות: לא הייתי. ייאמר לזכותו שהוא בחור חריף. אני לא מתחבר לגישה שלו ולדגש שהוא שם על דברים טריוויאליים (לדוגמה הצברים) לעומת הדפדוף על דברים מעניינים וכבדים (לדוגמה אנטרופיה ואנרגיות חופשיות) אבל מה ששלו שלו\n\nשם המתרגל/ת: יונית/עומר\nחוות דעת - תרגולים: מרגיש שיש גבולות גזרה מאוד ברורים. 0 אינטואיציה, 0 עניין, 0 העשרה. מה שכתוב בדף וזהו. ממש מתחרט שהלכתי חבל על הזמן\n\nשעורי הבית: קופי פייסט, הכל מרופרנס. יש 7 גיליונות לא ארוכים יחסית לזה שהם רק 7. משעממים, כמעט רק טכניקה\n\nהמבחן: 60 נקודות בחינם ו40 בדם יזע ודמעות. לא רוצים שניכשל אבל אין כל כך מוטיבציה שנצליח. זה בכל המבחנים.\n\nספציפית במועד א שלנו נראה שהוא בא להוציא עצבים על מי שלא הגיע לכיתה.\n\nהשורה התחתונה: יכול להיות בקלות הקורס הכי טוב בתואר אבל נראה שבDNA שלו יש זריקת... יש מיליון סרטונים ביוטיוב שמלמדים את כל החומר ברמה שאשכרה תבין מה הולך אבל מרגיש שהמטרה של הפקולטה היא בעיקר שנסמן עליו וי, נלמד 4-5 טכניקות מאוד ספציפיות ונמשיך הלאה בחיים שלנו בלי להבין שום דבר", "timestamp": 1659865294026}, {"author": "אלוף המזרנים", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nיריב כפרי\nחוות דעת - הרצאות: \nיריב הוא איש מאוד מאוד פדגוגי, בא ערוך היטב להרצאות ויודע בדיוק מה ללמד ואיזה דגשים חשובים לו. לדעתי יריב מסביר טוב את החומר ויש ערך מוסף בלבוא אליו להרצאות.\n\nשם המתרגל/ת: \nעומר\nחוות דעת - תרגולים: \nהתרגולים המוכנים שעומר העביר קצת יבשים, אבל עומר כן עזר להבין את החומר ולדעת מה לעשות. פשוט אני חושב שהתרגולים לא מספיק דומים למבחן ובגלל זה לא כזה מכינים אליו טוב.\n\nשעורי הבית: \n7 גליונות קשים מאוד אבל קצרים. הגליונות ישנים והם אותו דבר בכל סמסטר, הם מאוד עוזרים להבנה ויחסית לזה שהקורס הזה 5 נקודות טכניוניות באמת לא ארוכים בכלל.\n\nהמבחן: \nבטופס בחינה שלי הייתה בדיקה סופר סופר מפרגנת. בכל סעיף שהייתי בכיוון בערך, והראתי שאני יודע בערך משהו בחומר, קיבלתי נקודות. \nהמבחנים של יריב קשים באופן כללי לדעתי. אבל בניגוד להרבה מבחנים קשים אחרים שהיו לי, יריב שואל שאלות קשות על החומר של הקורס, ולא שואל על הנפצות לא קשורות או מחפש טריקים של אלגברה. לדעתי למרות הקושי, מי שיודע את החומר כן יכול להצליח ומצד שני מי שלא בטוח כל כך בדברים, יכול להתרסק חזק.\n\nהשורה התחתונה: \nקורס נחמד ולא עמוס יחסית למה שהייתי מצפה. החלק של התרמודנמיקה מאוד תאורטי ובלי הרבה דוגמאות קונקרטיות של מה עושים עם השיטה הזאת, מה שהפך את הנושא הזה ליותר קשה להתחבר מבחינתי. סטיטסטית לדעתי יותר מעניין והחלק של גזים קוונטים שמפתחים בסוף מעניין מאוד ונותן הרבה ידע על תופעות יום יומיות (או מי שלוקח חשמל פיזיקה, מסביר בדיעבד את הקורס במל\"מ).", "timestamp": 1659886471909}, {"author": "Tamir Manoach", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יריב כפרי\nחוות דעת - הרצאות: מרצה טוב\n\nשם המתרגל/ת: סתו מרכוס\nחוות דעת - תרגולים: מתרגלת נוראית, היא רוצה לעזור, אבל היא לא באמת מבינה יותר ממה שרשום לה לומר\n\nשעורי הבית: רובם ממוחזרים, פעם בשבועיים בערך\n\nהמבחן: המבחן הוגן, אבל צריך לזכור הכל באל פה. הכל.\n\nהשורה התחתונה: קורס חובה, לא הרגשתי שיצאתי עם הבנה רחבה יותר באופן משמעותי", "timestamp": 1691500288657}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יריב כפרי\nחוות דעת - הרצאות: בעיניי יריב מרצה מצוין. יש לו שליטה מצוינת בחומר, ולדעתי הוא הצליח להעביר את האינטואיציה הפיזיקלית מאחורי הדברים בצורה טובה. יש רשימות שעוקב אחריהן בגדול אחד לאחד והוא משקיע את ה-15 דק' הראשונות (~) של כל שיעור לחזרה על מה שלמדנו שזה מדהים. הבאסה היחידה שדווקא החלק של סטטיסטית קצת התפספס בגלל השביתה + אילוצים נוספים של יריב, אז היו פחות הרצאות איתו בחלק הזה וזה חבל כי בטוח שזה היה מסייע להבין את הנושא יותר טוב.\n\nשם המתרגל/ת: סתו מכרוס\nחוות דעת - תרגולים: לדעתי מתרגלת טובה. עוקבת אחרי דפי התרגול, יש כאלו שפחות אהבו אבל לי זה עשה ממש סדר כי הדפי תרגול מפורטים יחסית. איפה שלא היו סתו כן הוסיפה מעבר ובסך הכל הרגיש לי שאני מבין את החומר טוב בעזרתה. למי שאוהב לעבוד עם הדפי תרגול ממליץ ללכת אליה.\n\nשעורי הבית: 7 גליונות אחת לשבועיים (אצלנו ספציפית היו 6 בגלל השביתה), יחסית ארוכים אבל מרופרנסים באופן מלא ב-99%. כמו בכל מקצוע אחר כדאי לעשות אותם לבד כי אחרת מאוד קשה לעקוב אחרי החומר + עוזרים להתרגל למתמטיקה הלא פשוטה שמגיעה בחצי השני של הקורס.\nאצלנו היה גם בוחן אמצע, אמור להיות רק על החלק של תרמודינמיקה. לא פשוט, אבל אם מצליחים אותו נותן קצת יותר מגן.\n\nהמבחן: סך הכל הוגן. הבדיקות היו הוגנות לתחושתי, וספציפית אצלנו לפחות במועד א' גם לא הייתה שאלה על תרמודינמיקה אלא 3 שאלות על סטטיסטית שזה די חריג ולתחושתי כן הקל. סך הכל גם אם מתבלבלים בחישוב ומראים שיש הבנה פיזיקלית עדיין מקבלים לא מעט מהנקודות כמו שלרוב המצב בפיזיקה.\n\nהשורה התחתונה: בעיניי קורס סופר מעניין שקצת כמו קוונטית מציג בפעם הראשונה בעיות מסוג אחר ממה שמכירים עד כה (פשוט גם אחרות מהבעיות של קוונטית). יריב מרצה מצוין שמאוד נהניתי ללמוד ממנו, אבל הבאסה שאצלנו החצי השני של הקורס די התפספס בגלל שנראה שהסגל לא כל כך הצליח להתמודד בצורה אידיאלית עם השביתת לימודים שהייתה. כן הרבה קונספטים יחסית מאתגרים מבחינה מתמטית אז שווה להשקיע לאורך כל הסמסטר כדי להצליח לשמור על הקצב. חשוב להבין את הפיזיקה בחלק הראשון של תרמודינמיקה כדי להקל על החלק השני של סטטיסטית.", "timestamp": 1692556252254}, {"author": "בולצמן", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: כפרי\nחוות דעת - הרצאות: \nמרצה חביב. לצערי עם כל השביתה והעניינים מסביב יצא שלימד אותנו בעיקר תרמו ואת סטטיסטית למדנו חצי איתו, חצי עם עומר וחצי לא למדנו. את החלק שהוא כן לימד הוא לימד ביסודיות והיה אפילו מעט כריזמטי.\n\nשם המתרגל/ת: עומר גרנק\nחוות דעת - תרגולים: \nהלכתי אליו תכלס כי הסתדר לי במערכת והתרגולים כתובים מספיק טוב כדי להשלים לבד מה שלא מבינים. \nללמוד עם עומר זה קצת כמו ללמוד עם ChatGPT - הוא בקיא בחומר ויודע מה להגיד אבל לא יודע לתרגם את זה לסטודנט הממוצע. אם אתם צריכים הסבר טכני על חישוב הוא מעולה לזה אבל לא מעבר. אה וגם אין לו חוש הומור בדרך כלל שזה מוריד \n \nשעורי הבית: \nגיליון כל שבועיים. תכלס די רפרנסתי. מרגיש לי שזה מהמקצועות שאם עוברים על הפתרונות לפני המבחן אז זה מספיק. \n\nהמבחן: \nמועד א היה הוגן ממש. מועד ב שכפרי בדרך כלל עושה ברמת קושי מוגזמת היה די בדיחה - 2 שאלות קלות מתוך 3 (אחת הייתה מגיליון שיעורי בית אפילו). בקיצור הבחור בה לפנק בגלל המצב הקשה של המלחמה ויצא חמוד רציני\n\nהשורה התחתונה: \nקורס טוב ומעניין. תקראו את הרשימות של כנרת היא מרחיבה מעט יותר מיריב (הרשימות די זהות). תהיו על החומר במהלך סמסטר, במיוחד על צברים כי תרמו זה כמעט רק משחקים מתמטיים. ותהנו מהיופי של הקורס כי הוא ממש יפה (או שלא אני לא שוטר)", "timestamp": 1704651878889}]}