{"posts": [{"author": "Alon", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: מיותר\n\nשם המתרגל/ת: נעה קשת\nחוות דעת - תרגולים: מומלץ\n\nשעורי הבית: גליונות במודל שאפשר לרפרנס\n\nהמבחן: כמו של פיסיקה 2 הרגיל\n\nהשורה התחתונה:", "timestamp": 1597995185806}, {"author": "נלי קוגן", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "קורס מעניין, אך דורש הרבה התמדה לאורך כל הסמסטר,\n6 שעות שבועיות ולכן דורש גם הרבה זמן (במקוון זה להקשיב להרבה הרצאות, ומומלץ מאוד להמשיך ולעקוב לאורך הסמסטר ולא לצבור פערים)\nשיעורי בית גם לוקחים זמן, יש גליונות קצרים יותר וארוכים אבל לא ארוך מדי. שווה להשקיע בהם וגם לסכם נוסחאות חשובות לפני או אחרי כל נושא.\nהקורס נבנה מבחינה נושאית בתוך כל אחד מהנושאים הראשיים \"חשמל, מגנטיות, גלים\" לכן אם עוקבים אחרי הנושאים בתוך חשמל למשל אפשר להסתדר יפה כשהם נבנים אחד על השני.", "timestamp": 1598112537928}, {"author": "yam alaluf", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: רואים סרטוני עכאשה ביוטיוב ובמקום שעות הרצאה יש שעות קבלה אבל העומס הרצאות הוא דיי גדול ככה שאף אחד לא הולך לשעות הרצאה/קבלה כי הן לא ממוקדות \n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: מקצועית זריזה יודעת על מה היא מדברת .. ממש אחלה \n\nשעורי הבית: כמו כל שיעורי בית בקורסי פיזיקה .. יש אקסל \n\nהמבחן: לא באמת חובה להבין בשביל לעבור .. אני עברתי על 7 ניחושים מושכלים \n\nהשורה התחתונה: פיזיקה 1 היה יותר סבבה .. אולי בגלל שהפעם היה מקוון 🤷🏽‍♀️", "timestamp": 1602952167899}, {"author": "eden", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: נועה קשת\nחוות דעת - תרגולים: תרגולים ממש טובים\n\nשעורי הבית: יש כל שבוע גליון, מרופרנס ברובו\n\nהמבחן: כמו המבחן של פיזיקה 2\n\nהשורה התחתונה: ממש ממש עמוס", "timestamp": 1603209291473}, {"author": "Nikol Seleznev", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: ממש קשה ללמוד ממנו ולהבין משהו, צפיתי במוקלטות של מוחמד עכאשה ביוטיוב.\n\nשם המתרגל/ת: איתי מנגל\nחוות דעת - תרגולים: מתרגל לא כל כך טוב... אני לא הצלחתי להבין אצלו בתרגולים אז צפיתי במוקלטות של מתרגלת אחרת \n\nשעורי הבית: שיעורי הבית ברמה ממש גבוהה ולא היה מובן למה צריך להתעלל בנו ככה. (חלק מהשאלות נקלחו לפעמים משיעורי הבית של פיזיקה 2 ממ !)\n\nהמבחן: סביר\n\nהשורה התחתונה: הקורס מעניין אבל היה ממש מבאס שהוא עולה 1000 שח כמעט ואין סגל נורמלי שיעביר את הקורס, הייתה הרגשה שזה הקורס הכי מוזנח ולא היה להם חשוב שנקבל מרצה[ מתרגל כמו שצריך.", "timestamp": 1626601854149}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: מרצה טוב ומנוסה, טיפה מבולגן, יש לו המון דוגמאות ותרגילים והמון סבלנות.\n\nשם המתרגל/ת: איתי מנגל\nחוות דעת - תרגולים: לא מסביר כלכך טוב, הרבה פעמים לא מסונכרן עם המרצה אבל סה\"כ בסדר בזכות שיש שלוש שעות תרגול.\n\nשעורי הבית: גיליון כל שבוע, לא קלים בכלל. יש רפרנסים להכל.\n\nהמבחן: קשה, אבל פייר\n\nהשורה התחתונה: כדאי לנצל את העובדה שהקורס המון שעות, מאוד עוזר למי שלא טוב בפיזיקה.", "timestamp": 1626795139416}, {"author": "גאוס", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דוד אגמון\nחוות דעת - הרצאות: קשה להבין אותו בזום, העדפתי לראות הרצאות מוקלטות של עכאשה\n\nשם המתרגל/ת: איתי מנגל\nחוות דעת - תרגולים: סבבה, מסביר טוב בסך הכל.\n\nשעורי הבית: קשים אבל עוזרים להבנה של החומר\n\nהמבחן: קשה יחסית\n\nהשורה התחתונה: קורס קשה, אפשר להוציא ציון טוב אם משקיעים.", "timestamp": 1627043972075}, {"author": "*", "difficultyRank": 5, "generalRank": 4, "semester": "202003", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: אורן מרצה מצוין, חשוב לו מאוד ההבנה של הסטודנטים ועונה לכל שאלה. \n\nשם המתרגל/ת: דניאל מלר\nחוות דעת - תרגולים: מתרגל מצוין שגם לו ממש אכפת מהסטודנטים. התרגולים היו אחרי 4 שעות הרצאה ולכן לפעמים היה קצת קשה להתרכז.\n\nשעורי הבית: קשים, אבל תורמים להבנה \n\nהמבחן: לא נורא, סביל לחלוטין\n\nהשורה התחתונה:", "timestamp": 1635414326655}, {"author": "א", "difficultyRank": 5, "generalRank": 3, "semester": "202103", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nאורן מרצה מקסים. הכי אכפת לו בעולם מהסטודנטים , והוא תמיד מוכן להישאר ולעזור למי שצריך. הוא גם עוזר דרך מיילים ונותן מעטפת שלמה. אפשר גם תמיד \"לחזק\" עם הרצאות של עכאשה של 2ל שזמינות ביוטיוב.\n\nשם המתרגל/ת: אורי יחזקאל\nחוות דעת - תרגולים: אני אישית לא הצלחתי להתרכז ב4 שעות הרצאה רצוף וגם ללכת לתרגול לאחר מכן, לכן לא הלכתי לתרגולים שלו אלא ראיתי את התרגולים של רון בסלר ביוטיוב\n\nשעורי הבית: השיעורים בסדר בסהכ,לא ארוכים בדרכ, אורן תמיד התחיל כל שיעור ב\"שאלות משיעורי הבית?\". תנצלו את זה, תשאלו כמה שיותר. כדאי לנצל את הזמן והשעות הרבות של הקורס בשביל באמת ללמוד אפקטיבית ולא רק לספוג חומר.\n\nהמבחן: היה קשה ממש! בקטע מפתיע. קיבלנו פקטור של 5 נק בלי קשר לשאלת הבונוס. לדעתי זה גם לא מספיק ביחס למועד א שהיה לסמסטר אביב 2021.. \n\nהשורה התחתונה: קורס סהכ מעניין לדעתי, בגדול לא ממליצה לעשות כקורס קיץ אלא אם אין ברירה מבחינת שרשראות.\nבהצלחה!", "timestamp": 1666173371403}, {"author": "שיר", "difficultyRank": 4, "generalRank": 4, "semester": "202103", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nנהנתי מאוד בהרצאות של אורן. היינו קבוצה מאוד קטנה (הרוב בחרו ללמוד מהקלטות) וזה גרם לכך שיכלנו לשאול כמה שאלות שרצינו. אורן מרצה ממש טוב, מסביר לאט מספיק (בסוף אנשים בלי רקע) אבל גם איכשהו החומר עף.\nענה לי תוך שנייה כששלחתי מייל, תמיד אפשר לדבר איתו ולשאול אותו והוא ממש נחמד. גם ממש נחמד וגן מרצה טוב. 10/10\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: הלכתי פעם אחת, פחות התחברתי אבל אולי בגלל שזה כבר אחרי בוקר ארוך של 4 שעות הרצאה.\n\nשעורי הבית: כדאי לעשות, ברמת מבחן\n\nהמבחן: אז ככה. נכשלתי במועד א ועברתי עם ציון טוב מאוד במועד ב. המבחנים בשני המקרים היו יחסית באותה רמה. מומלץ מאוד לחרוש בטירוף על מבחנים קודמים. היו לי כמה שאלות דומות מאוד.\n\nהשורה התחתונה: קורס לא קל. לחרוש על מבנים זאת העצה הכי טובה לקורס הזה.", "timestamp": 1667757715741}, {"author": "ה", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "לא הייתי בהרצאות+תרגולים של 2ל' והלכתי לחנה של פיזיקה 2 וראיתי תרגולים ביוטיוב של רון בסלר . בשיעורי בית הייתי צריכה קצת \"לעמוד בקצב\" כי באופן \"מפתיע\" 2ל היו מהירים יותר מ2 הרגיל אבל בגדול מאוד שמחה על הבחירה שלי ללמוד יותר לבד ולא ללכת לכפול שעות ש2ל דורש . בתוך סמסטר אין לך זמן לזה, זה כמו עוד קורס .. תשקיעו בבית, תלמדו לבד/ חנה/ מוקלטות ותפתרו כמה שיותר תרגילים ומבחנים לפני המבחן ויהיה בסדר, בסוף זה חוזר על עצמו", "timestamp": 1692522976231}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דוד\n\nחוות דעת - הרצאות: \nהקושי העיקרי הוא להגיע ל-6(!) שעות הרצאה בשבוע, ככה שיצא שפספסתי לא מעט הרצאות. אני כן חושבת שההרצאות עוזרות, דוד מאוד נחמד ופותר הרבה דוגמאות (חלקן היו זהות לשאלות שהיו במבחן), ככה שאני ממליצה לנסות להגיע להרצאות לפחות בהתחלה.\n\nשם המתרגל/ת: נתן\n\nחוות דעת - תרגולים: \nחמוד אבל מאוד מאוד מבולגן. היה נורא קשה להבין משהו בתרגולים, הוא כותב ומוחק ומתבלבל וחוזר על עצמו וקשה לעקוב בתרגול. באיזשהו שלב הייתי אבודה לגמרי ועברתי להקלטות.\n\nשעורי הבית: \nקשים אבל רובם ברמה של מבחן אז זה תרגול מצויין. יש רפרנסים כמעט להכל אם נתקעים.\n\nהמבחן: \nהוגן מאוד, מי שידע טוב את החומר הוציא אחלה ציון.\n\nהשורה התחתונה: \nקורס לא קל בכלל ומאוד מאוד עמוס(שוב- בעיקר בגלל השעות). כדאי לעקוב במהלך הסמסטר ולא לצבור פערים כדי לא להשלים יותר מדי חומר לפני הבחינה.", "timestamp": 1693665561587}]}