{"posts": [{"author": "ל", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המדריך: דמיטרי שישקין\nחוות דעת - מעבדות: קפדן מאוד\n\nשעורי הבית: דוחות מעבדה ארוכים שנבדקים בקפדנות\n\nהשורה התחתונה: מעבדות מעניינות, קורס כשלעצמו קצת מעיק", "timestamp": 1634896568026}, {"author": "אא", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המדריך: יואב שגיא \nחוות דעת - הרצאות: בניגוד לתדמית שלו בפיזיקה 2פ' הוא מדריך סבבה לגמרי. מסביר טוב ובצורה מעניינת את המעבדות ואת החומר. הוא כן קצת קשוח בשאלות ובבדיקות (הבנתי שהחוויה הייתה שונה לכל אחד בקבוצה שלנו), אבל זה עדיין מעבדה אז אין פה יותר מידי מקומות ליפול בהם מבחינת ציון.\n\nשעורי הבית: מעבדות עצמן מעניינות מאוד, דוחות מעבדה מעיקים ושואבים כל רצון לחיות. אתן קרדיט לכך שפחות מקפידים על מבנה הדוחות כפי שמפרטים בהנחיות שלהם במודל (שהרבה פעמים סותרות אחת את השנייה).\n\nהשורה התחתונה: תבואו מוכנים נפשית לדוחות מעבדה ויהיה בסדר (ואפילו כיף אם למדתם אלקטרוניקה בתיכון, הרבה דברים פה יהיו מוכרים לכם)", "timestamp": 1646835985312}, {"author": "--", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: \nהיה ממש אחלה איתו, ממליץ להרשם לקבוצה של יואב או אלכס כי הם באמת מפרטים ומסבירים דברים כהוגן, וזה יוצר חוויה מתקנת ל2פ'.\n\nהשורה התחתונה: המעבדה סבבה סך הכל אבל היא שותה המון זמן! 3 שעות בשבוע + שעה - שעתיים הכנה לניסוי/למידה לבוחן +  זמן השלמות בעיקר לחלק הראשון כי הלומדות ארוכות יותר ממה שלומדים אז מצאתי את עצמי מגיע פעמיים להשלמות בצהרי יום ד למרות שלא פספסתי כלום", "timestamp": 1647613238642}, {"author": "-", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: נירית\nחוות דעת: לא ללכת אליה! היא חדשה ובקושי יודעת מה היא עושה+ הבדיקה שלה שוחטת.\n\nשעורי הבית: יש שלוש או ארבע דוחות מלאים על הלומדות, הם מעיקים ארוכים ולא תורמים שום דבר להבנה. בנוסף אף אחד לא מלמד אותך איך לכתוב דוח מעבדה נכון. במקרה של נירית כל הדוחות נבדקו *אחרי* שנגמר הסמסטר והגשנו כבר את כל הדוחות.\nאח״כ יש מן דפי עבודה על הניסויים הרציניים יותר, הם סבירים ודורשים פחות עבודה. גם הניסויים האלה יותר מעניינים.\n\nהשורה התחתונה: קורס של נק״ז אחד שמרגיש כמו ארבע, שותה את הזמן בסמסטר. בגדול לא מתאים לדעתי למי שרק עשה קורס חשמל ודורש ידע מעבר. דורש גם ידע במאטלאב שזה כלי העבודה המרכזי במעבדה. כדאי ללכת למדריך שיודע להסביר על התוכנה/ ללמוד לבד לפני המעבדה", "timestamp": 1650086227935}, {"author": "צ", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המדריך: גבריאל (גבאי) ויינרוט\nלהתרחק כמו מאש. קפדן מאוד וחושב שאנחנו מינימום בהכנה לפרסי נובל ומוריד נקודות על כל טעות או מסקנה קטנה שלא נראית נכונה. כל זה עם הערות לא ברורות שאפילו לא עוזרות להשתפר ולהבין איך לשפר את הציון. בקיצור, פשוט אל, תעשו לעצמכם טובה.", "timestamp": 1655390875516}, {"author": "???", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם האחראית: הדר הורן \nחוות דעת: \nמלכת עולם! הפכה מעבדה גרועה שנראה כאילו לא בדקו בכלל את מה שכתבו את מהלך הניסוי להייליט של הסמסטר. חובה לעשות עם הדר ולא עם אף אחד אחר!!", "timestamp": 1657630297041}, {"author": "מחסידי גבי גבאי", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גבי ויינרוט האגדי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nמעניין אבל עמוס ביותר, לא מלג מומלץ", "timestamp": 1661166700870}, {"author": "Omry Maor", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דימה\nחוות דעת - הרצאות: \nמדריך מצוין, נותן את הכלים הנחוצים ומתעסק בעיקר ולא בתפל.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nהרבה יותר סבירים ממעבדה 1מ, אך כיאה למעבדה גם כאן ניתן לצפות לכמות שעות מסוימת של התעסקות שבועית\nהמבחן: \n\nהשורה התחתונה: \nמעבדה הרבה יותר צ'יל מ-1מ, וחובה...\nממש כדאי לקחת במקביל לתורת המעגלים כי החומר חופף", "timestamp": 1675803498601}, {"author": "Tamir Manoach", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: מנחה חדש, אבל בן אדם טוב, מקשיב ועוזר איפה שניתן, לא רק איפה שצריך\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הגיליונות לוקחים זמן עם כל הגרפים האלה\n\nהמבחן: אין\n\nהשורה התחתונה: אם צריך אז צריך", "timestamp": 1691500103817}, {"author": "תותח אלקטרונים", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המנחה: אלכסנדר \nחוות דעת: \nמנחה מלך! מסביר טוב את הניסויים, סבלני כשצריך עזרה, והוגן בבדיקת הדו״חות. הוא בעיקר מסתכל על הגרפים אז מומלץ לוודא מולו בדיוק מה הוא רוצה לראות.\n\nהשורה התחתונה: \nהחצי הראשון יחסית צ׳יל, החצי השני די עמוס. כדאי למצוא שותף רציני וחד ולהכיר טוב את ספריית numpy בפייתון לפני.", "timestamp": 1716721098453}]}