{"posts": [{"author": "פיקסי", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: פרופ' יואב שגיא\nחוות דעת - הרצאות: \nמרצה מעניין אבל מעט מפוזר\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: \nקשוב ומסביר בצורה ברורה מאוד\nשעורי הבית: \nארוכים מאוד אך לרוב פתירים\nהמבחן: \nבלתי פתיר בעליל. שאלות שכל קשר ביניהן לבין הקורס זניח.\nהשורה התחתונה: קורס מרתק שפותח את החשיבה, אבל מבחן נוראי שמוציא את כל הכיף", "timestamp": 1603493541620}, {"author": "116", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יואב שגיא \nחוות דעת - הרצאות: העביר את החומר בצורה ברורה ומקצועית תוך התמודדות מצויינת עם הלמידה המקוונת. עם זאת הוא מאוד מתנשא וברמה האישית בלתי נסבל, ובעייני הוא התעכב יותר מידי על החלק הקל של הקורס על חשבון זמן בחלק הקשה שהוא מרכיב בתכלס את המבחן\n\nשם המתרגל/ת: ניצן בלאו \nחוות דעת - תרגולים: מצויינים. תרגולים למופת אין לי מילה רעה להגיד לא עליהם ולא עליו.\n\nשעורי הבית: קשים, אך תרמו מאוד להבנת החומר\n\nהמבחן: המואד א היה פשוט בדיחה. בושה של דבר, שבו היו לפחות 3 סעיפים שבהם נכלל חומר שלא נלמד בקורס עם ניסוחים מכשילים ולא ברורים. אסון. מועד הב היה מאוד ארוך אך שאלות הוגנות. \n\nהשורה התחתונה: קורס מדהים, עם חומר מטריף שמעורר מלא סקרנות לגבי העולם והייקום שלנו. חומר מאתגר ומחייב אך שמביא איתו המון סיפוק, עם חתיכת זוועה של בחינה בסוף שעושה את זה כממעעעטטט לא שווה אבל שווה", "timestamp": 1603571013910}, {"author": "אמיר משיעל", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: יואב מרצה ברור, קשוב לשאלות. חומר מעניין.\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: רועי מתרגל טוב, מסביר טוב את החומר וקשוב לשאלות. שם הרבה דגש על פיתוח התפיסה והחשיבה הפיזיקליות מאחורי השאלות.\n\nשעורי הבית:  יש גיליון בכל שבוע אך שבועיים להגשה, השאלות ברמה גבוהה וחלק ניכר מהן היו גם במבחנים. פתרון שיעורי הבית בהחלט תורם להבנה ולחידוד החומר.\n\nהמבחן: \n\nהשורה התחתונה: קורס חובה שאם משקיעים בלמידה, אני ממליץ להיעזר גם בספר הקורס ניתן להצליח בו.", "timestamp": 1607447876875}, {"author": "yosi dedik", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: מרצה בצורה מעניינת מאוד, יודע מאוד טוב את החומר, מאוד אהבתי את יואב למרות ששמעתי עליו דברים לא טובים אז בהתחלה חששתי.\n\nשם המתרגל/ת: ניצן בלאו\nחוות דעת - תרגולים: מעולה אין מילה אחת רעה\n\nשעורי הבית: קשים אבל עוזרים מאוד להבין \n\nהמבחן: עוד לא היה \n\nהשורה התחתונה: מבחן סופי קשה מאוד (לפחות לפי מה שראיתי משנים קודמות)", "timestamp": 1626692850932}, {"author": "Yusra Matar", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: כל כך מסובכות והמרצה לא באמת מעביר החומר בצורה ברורה \n\nשם המתרגל/ת: ניצן\nחוות דעת - תרגולים: מעביר החומר בצורה ברורה אבל בתרגולים לא קשורים בכלל למבחן או לתרגילי הבית הם פשוט עוזרים להבין החומר \n\nשעורי הבית: קשים וצריכים הרבה השקעה אבל עוזרים גם להבין החומר\n\nהמבחן: \n\nהשורה התחתונה: המרצה מכשיל והקורס קשה מאוד", "timestamp": 1626889494519}, {"author": "סטודנטית לפיזיקה", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: בגדול-מעביר את החומר בסדר. אני לא ממש אהבתי אותו אישית, אני חושבת שהוא ממש מתנשא ומלא מעצמו. אבל עברתי את הקורס וזה מה שחשוב\n\nשם המתרגל/ת: ניצן בלאו\nחוות דעת - תרגולים: אחלה מתרגל. העביר את התרגולים במצגת ולא כתב על הלוח, יש כאלה (אני לדוגמא) שהתחברו, מי שלא- שילך למתרגל אחר. אישית אהבתי שהוא דילג על החלקים המתמטיים והתמקד בפיזיקה, שזה מה שחשוב, והוא יכל לעשות את זה פשוט כי זו מצגת (יש איזו גזירה מסובכת- הוא פשוט העביר סלייד וראינו את התוצאה, והוא לא היה צריך לכתוב איך הוא הגיע לזה).\n\nשעורי הבית: קשים, די חשובים בשביל לדעת שאתה מבין את החומר. שאלה אחת במבחן לקוחה מהתרגילי בית/תרגולי כיתה, אז חשוב\n\nהמבחן: קשוח, אבל הוגן, במיוחד ביחס למבחני עבר של יואב שהם פשוט בלתי פתירים\n\nהשורה התחתונה: הקורס הכי מעניין שיצא לי לעשות עד כה בטכניון, שזה מעולה כי זו הסיבה שבגללה הלכתי ללמוד פיזיקה :)", "timestamp": 1627897551202}, {"author": "יובל המטורלל", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  \nיואב שגיא\nחוות דעת - הרצאות: \nמרצה לדעתי ממש ממש טוב, מבין ומסביר את החומר לעומק. קורס עם מלא חומר שלדעתי יואב מנגיש בצורה מעולה.\nשם המתרגל/ת:  \nרועי רחין\nחוות דעת - תרגולים: \nהיה אצלנו מתרגל אחראי, מבין את חומר הקורס לעומק מאוד ויודע מה מופיע במבחנים. רץ יחסית מהר כדי להספיק הכל אם מאבדים אותו קצת זה בעיה. \nהתרגולים לא מאוד עזרו לי בהבנה של החומר, רוב התרגולים היו 2 שאלות קלות רצח ועוד 2 שאלות טכניות או קשות מאוד שבקושי היה אפשר לעקוב אחריהן.\n\nשעורי הבית: \nיש גליון כל שבוע, לצערי הרגשתי שאין המון זמן לעשות אותו כי עד שמסיימים את החומר ותרגול הרלוונטי היו נשארים כמה ימים להגשה. נסו להתחיל אותם מוקדם כדי שיהיה זמן לשבת ולחשוב עליהם, אם תתקחו יום יומיים לעשות לא תצליחו לבד ולא תבינו מהם כלום.\nחשוב לעשות לבד לדעתי ולא לרפרנס, כי אז לא מבינים כלום בהמהלך הסמסטר.\n\nהמבחן: \nמבחן קשה ברמות, תדעו מראש פשוט שזה מקצוע עם סופי נמוך יחסית ושיוריד לכם בממוצע. לעשות הרבה מבחנים מהעבר ולקוות לטוב.\n\nהשורה התחתונה: \nמקצוע מעניין בטירוף, שמלומד ברמה גבוהה ונותן מלא ידע על החומר של חשמל ומגנטיות. תבואו בראש של קורס מעניין מאוד שמקבלים בו ציון נמוך ואתם תהיו בסדר. \nבנוסף, העצה הכי טובה שיש לי אליכם, לכו לספרייה קחו את ספר הקורס, תלמדו איתו למבחן, תקראו כדי לוודא הבנה במהלך הסמסטר. זה לוקח מלא זמן, אבל לגמרי שווה את זה.", "timestamp": 1627903936230}, {"author": "סטודנטית לפיזיקה", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: \nמרצה בצורה ממש ברורה ומעניינת. עושה הרבה הדגמות ומסביר אותן שזה מצד אחד נחמד מצד שני מבזבז מלא זמן.\nשם המתרגל/ת: ניצן בלאו\nחוות דעת - תרגולים: ניצן יודע את החומר מעולה ומסביר טוב אבל הוא השתמש במצגת אז מתקדמים נורא מהר בתרגילים והם מאוד קשים אז קל ללכת לאיבוד. מצד שני הוא יענה על כל שאלה אז אפשר לעצור אותו\n\nשעורי הבית: חלק היו קשים מאוד וחלק היו דיי קלים אבל כולם עוזרים ממש להבנה של החומר\n\nהמבחן: קשה ובעיקר ארוך, לא מכירה מישהו שסיים את כולו.\n\nהשורה התחתונה: ללא ספק הקורס הכי מעניין שיצא לי ללמוד עד עכשיו! אני מאוד נהנתי ממנו כל השנה והייתי במתח לפני כל שיעור מה עוד נלמד היום. נכנסים ממש לעומק ומבינים בצורה ממש יפה חשמל ומגנטיות.\nהמבחן קצת מוציא את הכיף במיוחד כשיש הבנה טובה של החומר וציון שלא משקף את זה. \nאז הקורס הזה הוא בשביל ההנאה ולא בשביל להעלות את הממוצע", "timestamp": 1627906962343}, {"author": "אא", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר בצורה מעניינת וברורה (עד כמה שאפשר, כי החומר מסתבך ממש לקראת סוף הקורס). גם מבצע הדגמות.\n\nשם המתרגל/ת: ניצן בלאו\nחוות דעת - תרגולים: מתרגל בסדר, יש לו מצגות מעולות שזה טוב אבל זה גם גורם לו לעבור על החומר ממש מהר.\n\nשעורי הבית: קשים מאוד, אבל אני ממליץ לתת את ההשקעה הזאת כי בסופו של דבר זה עוזר להטמיא את החומר במידה מסוימת.\n\nהמבחן: קשה. המבחנים של יואב שגיא בעבר היו בלתי פתירים, אבל דווקא הפעם היה יחסית הוגן (אבל עדיין ארוך). אפשר לראות זאת בהיסטוגרמות. עם זאת, לא הייתי מבטיח שגם המועדים הבאים יהיו ככה, אז תניחו שהמבחן שלכם יהיה כמו ב2018-2020.\n\nהשורה התחתונה: קורס חובה, אז אין לי ממש מה לומר. החומר מאוד מעניין, אבל תכינו את עצמכם נפשית ותנסו כמה שאתם יכולים לעקוב אחרי החומר לקראת סוף הקורס כי זה החומר שתכלס מופיע במבחן והוא גם הכי קשה להבנה.", "timestamp": 1628098357461}, {"author": "אילון", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: המרצה הכי חזק בטכניון\n\nשם המתרגל/ת: ניצן בלאו\nחוות דעת - תרגולים: ממש מגניבים, סוגרים פינות לא רק מההרצאה, הרבה גם במתמטיקה. התרגולים שלו עזרו ממש בחדוא 2ת\n\nשעורי הבית: קשים אבל לא מידי. עושים את העבודה \n\nהמבחן: שאלות קלות אבל יותר מדי. כמעט אף אחד לא הצליח לעשות הכול. בדיקה מפרגנת\n\nהשורה התחתונה: להיות עם יד על הדופק, להתמקד בלהבין את הקונספט וכשאפשר אז לעשות אנליזת מימדים", "timestamp": 1629110504468}, {"author": "!", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: מרצה טוב וברור שניכר שאוהב את המקצוע, אבל החומר מאוד מורכב ותיאורטי בהרצאות. יש המון פיתוחים מתמטיים שחשוב להבין כי שאלות שלמות במבחן יכולות להתבסס עליהם. חשוב לבוא לכל הרצאה עם מוטיבציה ולעקוב אחרת מאבדים אותו ולסגור פער בקורס הזה כמעט בלתי אפשרי\n\nשם המתרגל/ת: נעה קשת\nחוות דעת - תרגולים: מתרגלת נהדרת עם המון מוטיבציה, שם בפועל לומדים איך להשתמש בחומר.\n\nשעורי הבית: גיליון שבועי, מתחילים ביחסית קלילים ולאט לאט נעשים מאוד קשים.\n\nהמבחן: בדיחה ענקית, הרבה פעמים אין שום קשר בין מה שנלמד לבין מה שנבחנו עליו. שם דגש ענק על שילוב בין כמה תופעות שנלמדו ומצפה ממך להיות יצירתי במקום.\n\nהשורה התחתונה: שימו המון דגש על החומר בחדוו\"א 2ת' כי משם חלק גדול מהטכניקה מגיעה (אינטגרלים, שימוש במערכות קוארדינאטות) ותתעסקו הרבה יותר בלפתור תרגילים מאשר ללמוד את החומר, לראות כמה שיותר שיטות שונות. זה קורס חובה, לגיטימי לגרד בו עובר ולהמשיך הלאה.", "timestamp": 1634109074482}, {"author": "ל", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: כריזמטי ומעניין, טיפה קשה לעקוב לפעמים עקב רמת הקושי הגבוהה של החומר אבל מומלץ לנסות לעקוב\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: מתרגל אחראי, וויב סביר פלוס ועם זאת הכי טוב שהיה להציע כיוון ששולט בחומר בצורה נהדרת, מעביר טוב והכי חשוב - נותן דגשים פרקטיים לפתרון שאלות\n\nשעורי הבית: רק שם תוך תרגול עצמי מבינים את החומר, לעשות ולא לרפרנס\n\nהמבחן: מבחנים של יואב ידועים בהיותם קשים עד לא פתירים, הפעם נפלנו על מבחן שהיה בסדר. הטיפ הכי גדול הוא להיות עם יד על הדופק מההתחלה, בסופו של דבר המבחן על אף רמת הקושי מכיל חומר שנלמד לכן זה אפשרי. בסופו של דבר במתכונתו הנוכחית זה קורס שכדי להיות מרוצים מספיק לעבור וזה בסדר\n\nהשורה התחתונה: קורס קשה אבל יפיפה, אפשר למצוא בו עניין ויופי פיזיקלי גדול מאוד. כאמור, לנסות להיות על החומר מההתחלה ולא לפתוח פער", "timestamp": 1634896348161}, {"author": "חורי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים מאוד\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: הקורס קשה מאוד וצריך למידה ועבודה קשה במהלך הסמסטר", "timestamp": 1635413406608}, {"author": "צ", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: בן אדם נחמד ורואים שהוא מחובר לחומר, אבל למרות זאת ההרצאות היו די משעממות. זאת שנה ראשונה של צוות הקורס ויכול להיות שבגלל זה כל הסידור של הלמידה היה מאוד לא 100. בתחילת הסמסטר התעכנו על קטעים מתמטיים לא חשובים מה שגרם לכך שבסוף הסמסטר היינו צריכים להשלים הרבה חומר לבד במטלות הכנה (חלק מפיילוט שנעשה). \n\nשם המתרגל: גידי אלון\nחוות דעת - תרגולים: כמו ב1פ, הוא מתרגל ובן אדם פשוט מקסים. רואים שיש לו תשוקה לפיזיקה ולללמד באופן כללי, עוזר במה שצריך, משקיע מאוד בתרגולים ובשעות הקבלה עד שאחרון הסטודנטים יבין.\n\nשעורי הבית: לא קשים מדי וגם ממוחזרים, במקרה הכי גרוע אפשר לרפרנס\n\nהמבחן: הבוחן אמצע היה הוגן  ונקווה שגם המבחן הסופי יהיה ככה (נכתב לפני המבחן)", "timestamp": 1657269487956}, {"author": "נפתלי בנט", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן ברגמן המיתריסט\nחוות דעת - הרצאות: \nאורן מדבר קצת לאט וזה בהתחלה שיעמם, אבל כמו בירה, אורן הוא טעם נרכש. הוא מסביר דברים בצורה ריגורוזית ומדוייקת ועקבי עם האמירות שלו. לי זה עזר מאוד. \nשם המתרגל/ת: אלוןןןןןן\nחוות דעת - תרגולים: \nתרגולים ממש כמו ב1פ' נהנתי מאוד :) \nשעורי הבית: \nמעניינים, לא מעיקים מידי כמו ב1פ'. עוזרים מאוד להבין את החומר\nהמבחן: קשה מאוד\n\nהשורה התחתונה: \nהמבחן קשה וזה באסה  אבל חוץ מזה קורס ממש מעניין ומהווה ציון דרך בחיים", "timestamp": 1658058944461}, {"author": "גבי ויינרוט", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן \"המיתריס\" ברגמן\nחוות דעת - הרצאות: \nוואו, מלך. פשוט מלך. אין מילים לתאר. ההוכחות הכי מסודרות שראיתי בכל הקורסים שעשיתי עד כה, ועשיתי אינפי עם צנזור.\nידיים מתנופפות בחדר וצריך להיזהר שלא להיפגע.\nאני רק לא מבין למה אין שגיאות מדידה, למה אין יחידות ולמה המרצה נראה כמו רונן צור.\nשם המתרגל/ת: גידי גדעון אלון המלך האחד והיחיד\nחוות דעת - תרגולים: \nאין על גידי בעולםםםםםםםםםםםםםםםםםםם.\nשעורי הבית: \nקשיםםם. חייבים לעבור על הספר של ברקלי לפני הקורס ולפתור את כל התרגילים שיש שםם. וואו יותר עומס מזה לא יכול להיות.\nהמבחן: \nהכי קשה שנראה בטכניון עד כה. לא היה מבחן עם ממוצע נמוך מזה. שלא לדבר על ה P value של העקומה שנוצרת מההיסטוגרמה.\nהשורה התחתונה: \nקורס מדהים", "timestamp": 1658321898442}, {"author": "לקרוא בעירבון מוגבל", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן ברגמן\n\n\nהמבחן: היה ב-21.7.22, בעוד ששתי הביקורות שמלפני טוענות שהמבחן קשה נכתבו לפני מועד זה ....\n\nהשורה התחתונה: זה קורס חובה, מה אתם קוראים פה ביקורות בכלל? ביקורות וציונים על מתרגלים אפשר לקרוא בstudents.", "timestamp": 1658392278410}, {"author": "James Clerk Maxwell", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ברגמן\nחוות דעת - הרצאות: קצת מונוטוני ואפור. טיפה מבולגן על הלוח ולא מסביר ברור הוכחות ופיתוחים. מסביר לאט לאט ועונה יפה לשאלות. \n\nשם המתרגל/ת: רותם המלכה\nחוות דעת - תרגולים: כולם תותחים ועזרו לי מלא בהמון הזדמנויות ושעות קבלה. רותם בפרט מעולה והסבירה הכל ממש טוב ונתנה דגשים טובים למבחן.\n\nשעורי הבית: היו תרגילים מברקלי, תרגילים ממוחזרים, ותרגילי הכנה להרצאות. בסוף יוצא כמו עומס של כל קורס מתמטי/פיזיקלי. לפעמים היו מאוד רלוונטיים למבחן, לפעמים מאוד לא. עזרו להבין את הקורס.\n\nהמבחן: מאוד קשה. פחות מתמטי מיואב שגיא, אבל מאוד מתבסס על הבנה ועל דברים דומים שראינו בתרגולים ותרגילי הבית. סך הכל הוגן אבל קשה בטירוף. לדעתי יותר מאתגר מהמבחנים של אורי סיון למשל.\n\nהשורה התחתונה: אפשר לקרוא לקורס \"יישומי חדווא\". היו רגעים מעניינים (להבין שחשמל ומגנטיות זה אותו הדבר!!!!! מטורף!!!!!) אבל בואו נגיד שאני מאוד מקווה שבאנליטית וקוונטים אשמח יותר שבחרתי תואר בפיזיקה. זה קורס מאוד קשה, אבל אם אתם לא מפחדים ממתמטיקה אז הוא לא קשה כמו שאנשים מספרים (בייחוד כשלוקחים אותו עם ברגמן ולא עם יואב)", "timestamp": 1658429264976}, {"author": "*", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: סביר, לפעמים מעניין לפעמים קצת קשה לעכוב\n\nשם המתרגל/ת: איתי דוידוביץ\nחוות דעת - תרגולים: מסביר מעולה ואחלה אווירה, ממליץ בחום\n\nשעורי הבית: סבירים, לפעמים קצת מונפצים\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס קשה צריך ללמוד הרבה זמן לקראת המבחן", "timestamp": 1658485341525}, {"author": "Yaniv Slor Futterman", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: מרצה מצוין. מאוד ברור ויסודי. ממש מלמד טוב\n\nשם המתרגל/ת: גידי\nחוות דעת - תרגולים: מתרגל פשוט מדהים אין מה להגיד. רואים כמה אכפת לו וכמה הוא משקיע בתלמידים ובהוראה\n\nשעורי הבית: גליונות חובה וסדנאות שבועיות. הסדנאות כללו סרטונים של חנה, קריאה בספר ושאלת הגשה שבועית. זה מוסיף עוד עומס אבל מאוד מומלץ ומאוד עוזר. הסמססטר הזה הם ממש ניהלו את הקורס מדהים והוא הפך מאחד הקורסים הכי קשים בכל התואר לקורס פשוט יחסית קשה אבל לא נורא מידי.\n\nהמבחן: \n\nהשורה התחתונה: קורס מאוד מעניין אך קשה. לוקח הרבה זמן והשקעה אבל זה שווה את זה.", "timestamp": 1658682466520}, {"author": "שמעון", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: אורן סך הכל אחלה מרצה. עובד מסודר בהרצאות, נראה שהוא יודע מה הוא רוצה להספיק ולפי זה הוא עובד. לפעמים נתקע משאלות מהקהל\n\nשם המתרגל/ת: רותם\nחוות דעת - תרגולים: אחלה מתרגלת\n\nשעורי הבית: 13 גיליונות. 10 סבירים, 3 לא פתירים בעליל. זה לצד הדרישה לקרוא באנגלית כל שבוע פרקים מברקלי - היה עמוס מאוד.\n\nהמבחן: היה פייר (לעומת כל מבחני יואב שגיא...)\n\nהשורה התחתונה: קורס מדהים, מעניין מאוד", "timestamp": 1659171980984}, {"author": "~~", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: מרצה טוב בסך הכל. אורן מכיר את החומר היטב, ועונה על שאלות כמו שצריך. לפעמים שאלה הייתה מתקילה אותו, אבל אני דווקא הערכתי שהוא יודע להגיד \"שאלה טובה לא יודע\". ההרצאות לא הכי מלהיבות בעולם, אבל החומר עצמו יכול להיות מגניב מאוד לפרקים אז זה מתאזן.\n\nשם המתרגל/ת: איתי דוידוביץ'\nחוות דעת - תרגולים: מתרגל מצוין! מכיר טוב את החומר ומעביר אותה בצורה נינוחה מאוד. האווירה בתרגול טובה ואיתי עונה על כל שאלה שהיא, נשאר גם לרוב אחרי לשאלות של סטונדטים.\n\nשעורי הבית: \nהסמסטר היה קונספט קצת אחר שבמקום גיליון שבועי מאוד ארוך, השיעורי בית חולקו ל\"מטלות קדם\" שכללו לרוב סרטונים / קטעי קריאה ושאלות יחסית פשוטות עליהם. לצד זאת היה גם גיליון שבועי עם 2-3 שאלות שהן באמת נטו להיות מאתגרות (היו פעמים שמאוד מאוד קשות, אבל ככה זה קורס של פיזיקה). בסך הכל אני חושב שהקונספט היה טוב ברובו וכן אפשר למידה יותר מוצלחת.\n\nהמבחן: קשה, כמו שאפשר לצפות מ-2פ', אבל יותר טוב ממבחנים של יואב שגיא. דורש הבנה טובה מאוד של החומר, אבל לא יצירתיות מופרכת בעיניי. אם הייתי צריך לדרג, קשה יותר מהמבחנים של אורי סיון, קל יותר מהמבחנים של יואב שגיא.\n\nהשורה התחתונה: קורס קשה (גם בפורמט הנוכחי) עם חומר מאוד מעניין. בעיקר מעריך מאוד את העובדה שניכר שהסגל באמת ניסה לבצע כל מיני שינויים במבנה הקורס ואיך שהחומר מועבר כדי שהלמידה תהיה יותר יעילה.", "timestamp": 1659621217333}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: \nמשעמם ומאוד רובוטי, מקריא מהספר במקום לחדש\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: סביר\n\nשעורי הבית: קשים אבל סבירים יחסית לפחות, המון עומס\n\nהמבחן: מזעזע, קונספטים שבקושי נגעו בהם\n\nהשורה התחתונה:", "timestamp": 1660038791043}, {"author": "גיא דוידוביץ'", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: מרצה טוב. נצמד לספר הלימוד של ברקלי\n\nשם המתרגל/ת: איתי דוידוביץ'\nחוות דעת - תרגולים: מתרגל מעולה. \n\nשעורי הבית: קשים\n\nהמבחן: קשה, רמה מעל לשיעורי הבית\n\nהשורה התחתונה: קורס חובה", "timestamp": 1660736923067}, {"author": "P=NP", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: אורן מרצה טוב, נצמד לחומר, סבלני לשאלות, מסביר טוב יכול להיות קצת יבש, בייחוד בהתחלה, אז שווה לבוא אליו מרוכזים, גם ככה הקורס קשה אז עדיף לשמור את הקשב להרצאות שלו.\n\nשם המתרגל/ת: רותם בן זאב\nחוות דעת - תרגולים: רותם מתרגלת מצוינת, אם גידי מתרגל אבל התרגול שלו עמוס, כדאי ללכת אליה, מביאה תרגילים מאוד טובים ומסבירה את החומר מצוין.\n\nשעורי הבית: סבירים עד קשים, תלוי\n\nהמבחן: קשה מאוד, אמנם זה כבר לא מבחני יואב שגיא, אבל מדובר במבחן קשה בהתאם לקורס שהוא פיזיקה לפיזיקאים. להתכונן הרבה, להבין שלפעמים יש טריקים מעצבנים, כדאי לעשות את כל שיעורי הבית של הקורס לפני\n\nהשורה התחתונה: קורס חובה מעניין, דורש השקעה וקריאה נוספת של החומר. חשוב לציין לטובה שהיו כל מיני מטלות בית לאורך הסמסטר- קריאה, מטלות במודל וגיליונות, בנוסף היו תרגילים נוספים לא להגשה, היה הרבה חומר ללמוד ממנו ואם משקיעים מספיק בקורס, אפשר להוציא גם ציון מעל 80, פשוט צריך להשקיע המון בקורס.", "timestamp": 1663417088755}, {"author": "י", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: חשוב תזכור ניואנסים קטנים\n\nשם המתרגל/ת: איתי דוידוביץ'\nחוות דעת - תרגולים: איתי מתרגל מדהים. מעביר ומסביר את החומר בצורה מצוינת ומשרה אווירה מאוד נעימה\n\nשעורי הבית: לפעמים קצת מונפצים, חשוב לפתור אותם באמת\n\nהמבחן: קשה מאוד, בדיקה הוגנת מאוד\n\nהשורה התחתונה: קורס קשה מאוד עם סגל מעולה", "timestamp": 1665730140478}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: הוא פשוט מקריא מהספר אחד לאחד, הוא די ברור ועונה על רוב השאלות סבבה, אבל אין באמת סיבה לא לראות את המוקלטות במקום - אין בעיניי ערך מוסף להרצאות בלייב שלו ביחס למוקלטות.\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: מתרגל סבבה.\n\nשעורי הבית: קלים מאוד ביחס לבחינה, אבל עוזרים לתרגל דברים.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס די מעניין וסבבה, צריך לדעת טוב חדו\"א", "timestamp": 1690278126853}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: \nמאוד יבש. מסביר טוב, אבל שמים לב שהוא פשוט מרחיב על מה שכתוב בספר של ברקלי\nשם המתרגל/ת: רותם ואז גידי\nחוות דעת - תרגולים: \nגידי מצוין כרגיל - זהה ל1פ. רותם גם מעולה, ועוזרת מאוד.\nשעורי הבית: \nדי קלילים. אין סיבה לרפרנס סתם כדי להעביר - כדאי לעשות באמת \nהמבחן: קשה. לא מאוד מומלץ לעשות מבחני עבר, אלא יותר לעבור על גליונות והספר.\n\nהשורה התחתונה: קורס מאוד קשה ומאוד עמוס בחומר.", "timestamp": 1690879692285}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרופ אורן ברגמן\nחוות דעת - הרצאות: הרצאות עתירות פיתוחים ותאוריה לפעמים מהנה לפעמים לא כל כך מהנה\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: מתרגל ממוקד שמעביר את החומר בצורה טובה\n\nשעורי הבית: שיעורי בית מברקלי, אם מבינים מה שואלים בכלל אז זה שיעורי בית מאתגרים, אם לא מבינים מה שואלים אז לא אפשרי\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס חובה למי שעושה תואר בפיזיקה", "timestamp": 1690895412362}, {"author": "בועז מונטיליה", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: \nתראו הקלטות של אורן, יותר ברור ואפשר להריץ על כפול 2\n\nשם המתרגל/ת: ירד גולדברג\nחוות דעת - תרגולים: מתרגל מדהים! \nהבנה של החומר גם עם אספקטים מתמטיים, תמיד עונה על שאלות, גם כאלו שלא הכי קשורות ישירות לחומר\n\nשעורי הבית: \nאחד לאחד השיעורים של שנה שעברה עד לרמת התרגיל מברקלי.\nמטלות קדם שבוע לא בסנכרון עם קצב לימוד החומר, דבר שמקשה על למידה שלהן.\n\nהמבחן:  אורך מאוד,  דורש יותר מ3 שעות לפתירה נוחה והגיונית\n\nהשורה התחתונה: \nחומר מעניין, הועבר גרוע", "timestamp": 1691427437627}, {"author": "ללניה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: \nבסדר, שווה לעבוד עם רשימות, אני השתמשתי ברשימות של אופק\nשם המתרגל/ת: ירד\nחוות דעת - תרגולים: \nמעולה, עונה על שאלות בצורה ברורה ומעמיקה, בונה בסיס הבנתי, מפוקס על החומר. ממליץ בחום.\nשעורי הבית: \nחלק סבירים חלק הרגישו בקפיצת מדרגה משאר החומר. צריך קצת להבין אנגלית כדי לענות על חלק מהשאלות. אבל מאוד מדוייקים כהכנה למבחן\nהמבחן: היה קשוח, יותר מד''ר מפיזיקה. הרבה שאלות על מעגלים חשמליים כאשר בפועל הם היוו לא יותר משעה אחת בכל ההרצאות.\n\nהשורה התחתונה:", "timestamp": 1691480855695}, {"author": "מיפ", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן ברגמן\nחוות דעת - הרצאות: אחלה, כותב הכל על הלוח, ועונה לשאלות\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגל מצויין גם מסביר טוב את החומר , הוא מראה את הצורת חשיבה איך לגשת לשאלה\n\nשעורי הבית: \nהמון שיעורי בית, גם לפני כל שבוע יש שאלות הכנה, וגם גיליון כל שבוע. השאלות הכנה טובות בשבועות הראשונים אבל אחכ הם לא כל כך מסונכרנים וקצת מאבדים את החומר. התרגילים בגיליונות אחרי לפעמים סופר טכניים ומתמטיים ולפעמים סבבה, אבל יש מלא רפרנסים\n\nהמבחן: \nיש מבחן אמצע -  אצלנו היה ממש בסדר 30%\nומבחן הסופי היה 4 שאלות, הוא היה קצת טכני וארוך אבל בבדיקה ממש ריחמו.\nסה\"כ הסיגנון של השאלות הוא יש נושא מסויים, ובכל סעיף משנים קצת את הנתונים ויש טריק אחר שצריך לשים לב אליו.\n\nהשורה התחתונה: קורס עמוס אבל מעניין (כדאי ממש לקחת עם מעבדה 2 כי היא גורמת לחומר לשבת טוב יותר)", "timestamp": 1705059213519}, {"author": "א.ב.", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות:\nהיתרון הגדול של אורן זה הסדר. החומר מוצג בצורה מאוד מסודרת, לפי הנושאים והפרקים. גם הלוח תמיד מסודר, וזה מאוד עוזר לעקוב. בנוסף, ההרצאות וההסברים בנויים בצורה ברורה ומסודרת, ככה שהרבה יותר קל להבין את החומר.\nלפעמים אני מרגיש שיש נקודות קצה לא כ\"כ ברורות, למשל כשסטודנטים שואלים שאלות יותר מעמיקות, או כשמגיעים למקרים שקשורים לחומר אבל הם לא בדיוק חלק מההרצאה המתוכננת.\n\nשם המתרגל/ת: ירד\nחוות דעת - תרגולים:\nירד מסביר מעניין וברור! בדרך כלל החומר והפתרונות מוצגים בצורה מאוד חלקה, וזה עוזר להבין איך משתמשים במה שנלמד בהרצאות כדי לפתור את התרגילים.\nלפעמים הלוח קצת מלא ומבולגן, וזה קצת מקשה.\n\nשעורי הבית: קשים, דורשים הבנה של החומר.\n\nהמבחן: קשה, אבל הוגן (לפחות כשאורן אחראי)\n\nהשורה התחתונה:\nקורס עמוס, ודורש הרבה מעקב, חזרות והבנה. אבל בסוף גם מאוד יפה, וניכר שהצוות רוצה לעזור ולא להקשות.", "timestamp": 1711535182200}]}