{"posts": [{"author": "יעקב טקץ'", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: מרצה מעולה, יודע לתפוס קשב ולתת המחשות לעניין. \n\nשם המתרגל/ת: אביאור אלמועלם\nחוות דעת - תרגולים: מתרגל ברמה מאד גבוהה, מדבר תכלס ולעניין. סבלנות שיא.\n\nשעורי הבית: ברמה יותר גבוהה מהמתורגל בכיתה, הכנה טובה למבחן\n\nהמבחן: הוגן, אפילו קל יחסית לשיעורי הבית\n\nהשורה התחתונה:", "timestamp": 1644507552670}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עכאשה \nחוות דעת - הרצאות: \nמרצה מצויין סבלני ויודע להסביר, הוא מבין שהרבה בלי רקע בפיזיקה ויודע להתאים את עצמו\nשם המתרגל/ת: אביאור\nחוות דעת - תרגולים: \nעמוסים. ממליצה לעבור עליהם לפני התרגול ולהתסכל עליהם לפני התחלת פתרון ההגשה. העקרונות חוזרים על עצמם, וגם במבחן. הטיפים של ביאור מצויינים. יש גם סדנת עזר שבעיניי מצילת חיים.\nשעורי הבית: \nקשוחים, עדיף לפתור לבד או להיעזר בחברים אבל לא להסתמך נטו על רפרנסים או פתרונות. אפשר לבקש מאביאור שיפתור בסדנה את התרגילים, אבל תנסו לפני כן לבד\nהמבחן: \nקל יותר מההגשות, מאוד הוגן. תכינו לבד דף נוסחאות ותכניסו אליו תרגילים וטיפים ותהיו בסדר\nהשורה התחתונה: קורס קשוח למי שבלי רקע, אבל עוברים אותו", "timestamp": 1647336752487}, {"author": "יייי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עכאשה\nחוות דעת - הרצאות: מצויין\n\nשם המתרגל/ת: אביאור\nחוות דעת - תרגולים: מצויין\n\nשעורי הבית: דורשים זמן\n\nהמבחן: קליל\n\nהשורה התחתונה: אין ברירה אבל 90 ומעלה", "timestamp": 1648367096456}, {"author": "גיל ישראל", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מומלץ\nעכאשה ואביאור אלופים אין עליהם", "timestamp": 1657019648906}, {"author": "Randa", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: המרצה מצויין, גאון, ונחמד מאוד\n\nשם המתרגל/ת: רוני אנה גופמן\nחוות דעת - תרגולים: \n\nשעורי הבית: רמת שאלות גבוהה, 5 נסיונות הגשה.\n\nהמבחן: רמת שאלות מאוד סבירה. 10 שאלות אמריקאיות ושאלתה נוספת בונוס\n\nהשורה התחתונה:", "timestamp": 1677323333923}, {"author": "76 פרייאר", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעכאשה ממש מקסים ומנסה כמה שיותר להתחשב בכם ובהתאם המבחן גם סבבה \nשם המתרגל/ת: רוני\nחוות דעת - תרגולים: \nפותרת בדרכים אחרות שבעיני זה בונוס\nשעורי הבית: \nמשוחזרים, שונים מהמבחן אבל תורמים להבנה. \nהמבחן: אמריקאי, חלק משוחזר, שאלות אפשריות אם למדתם במהלך הסמסטר ותרגלתם מבחנים\n\nהשורה התחתונה: יכול להיות קשה ועמוס למי שאין לו רקע אבל יש איך להתמודד! הקלטות של ההרצאות, תרגולים, סדנת עזר, סרטונים ביוטיוב באמת לא חסר", "timestamp": 1677750495230}, {"author": "ס", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: \nעכאשה מושלם, ההרצאות שלו כיפיות והוא מלמד באיטיות ומוודא שכולם מבינים.\nהמרצה הכי טוב שהיה לי הסמסטר! \nלמי שלמד פיזיקה בתיכון: החומר של הקורס קל יותר, אם יש לכם מזל ואתם זוכרים משהו משם...\n\n\nשם המתרגל/ת: רוני\nחוות דעת - תרגולים: \nאחלה. בגדול כל מה שהיא כותבת על הלוח קיבלנו גם במסמך שמסכם הכל, אבל אי אפשר לסמוך על זה ולא להגיע לתרגולים, כי לפעמים לא יהיה ברור מהמסמך מה קורה.\nכדאי לשים לב מה הביטויים והנוסחאות שמגיעים אליהם בתרגולים ולזכור אותן. \n\nשעורי הבית: \nיכולים להיות מאוד קשים. \nהייתה סדנאת עזר עם רוני למי שהתקשה בהם.\n\nהמבחן: \nממש הוגן. אפשר להגיע אליו עם דף נוסחאות של 6 עמודים שאפשר לכתוב בו מה שרוצים וזה מאוד עוזר במבחן.\n\nהשורה התחתונה: \nעכאשה נפלא ומאוד עוזר וזה קורס שאפשר לא לדאוג יותר מידי ממנו, כנראה שתעברו, מקסימום במועד ב.", "timestamp": 1678640395086}, {"author": ":)", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  מחמד עכאשה\nחוות דעת - הרצאות: אין עליו, פשוט מבין מה המטרה שלו ומבין את קהל היעד ועושה הכל כדי שהכל יהיה מובן. משקיע, מסביר, נחמד ברמות ואכפת לו באמת. ובסופו של דבר גם חשוב לו שכולם יצליחו. סופר מקצועי, מלך אמיתי, המרצה הכי טוב שאפשר לבקש. אה וההרצאות גם מוקלטות וגם בזום והוא באמת דואג שיראו הכל טוב גם בהקלטות!\n\nשם המתרגל/ת: רוני\nחוות דעת - תרגולים: אחלה, מאוד מסודרים ומאורגנים ותמיד יש תיאום עם מוחמד, אין הרבה זמן או מקום לשאלות בתרגולים עצמם אבל תמיד יש לזה מקום בסדנה, בשעות קבלה או במייל\n\nשעורי הבית: הוגנים, לא ארוכים מדי, אבל לפעמים יש שאלות קשות. יש רפרנסים ואפשר להיעזר\n\nהמבחן: הוגן ממש, הוא לא קל אבל מחמד מבטיח שנצליח ועושה מאמץ כדי שכולם יסיימו עם ציון טוב. צריך להבין את החומר ולדעת איך לגשת לשאלות אבל ממש אין לו כוונה להכשיל.\n\nהשורה התחתונה: אפילו שהחומר לא קל - אין על עכאשה וזה הופך את כל החוויה לטובה יותר!", "timestamp": 1678973535868}, {"author": "nak_nik", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  ד״ר מוחמד עכאשה.\nחוות דעת - הרצאות: \nנו, מה כבר לא אמרו על אדון עכאשה. כל הרצאה זה כמו זוג כרטיסים לאדיר מילר.\nלהגיע ערניים להרצאות, ולא לכתוב בהרצאה. פשוט אין טעם - הוא כותב תוך כדי השיעור כל דבר שהוא אומר ומסביר, ככה שבסוף יוצא סיכום פצצה אטומית בשביל המבחן.\nהתגובה במייל מעכאשה תהיה תמיד מורכבת מ-2 מילים בעלות 5 או פחות אותיות (דוגמאות: ״כן״, ״לא״, ״סנאי מעופף״).\n\nשם המתרגל/ת: ד״ר נירית.\nחוות דעת - תרגולים: \nנירית היא מאוד נחמדה, צוחקת עם הסטודנטים ומרגיעה לפני המבחן. \nבכדי לפתור את השאלות המופיעות בתרגולים לבד צריכים להיות פרופסור לפיסיקה קוונטית גרעינית מודרנית שימושית. \nלמזלכם - הקשר בין רמת התרגילים בתרגול לבין המבחן היא מקרית בהחלט.\nהגעה לתרגול - לפי המרגש:\nאם קמים בבוקר, והייתה הרצאה כבדה באנטומיה, וחם בחוץ אז קצת מרגישים מנומנמים, לא להגיע.\nאם יש יום נחמד, פרפרים בחוץ, בדיוק זכית ב-150 בווינר, אחרי איזה כוס קפה, ויש חשק - להגיע.\nכל התרגולים מוקלטים, לכן אפשר לראות הקלטות (אף אחד לא רואה).\nקיימת סדנת תרגול ועזרה בפתרון שיעורי בית. \n\nשעורי הבית: \nדומים ביותר למה שמופיע במבחן. חובה לעשות את כל המטלות!\nפתרונות מלאים בדרייב, לכן אם נתקעים תמיד אפשר לראות את הפתרון.\nמומלץ לשבור את הראש על השאלות לבד ולא לראות את הפתרונות, ואם כבר מגיעים לראות פתרון - אז קודם פתרון סופי, ולא להתפתות ישר לפתרון מלא.\n\nהמבחן: \nמפתיע, מהנה, מרגש, שאלות לא פשוטות.\nצריכים לדעת את החומר. אך אל דאגה - מי שעובר על כל מה שעכאשה לימד, עשה את כל שיעורי הבית, ופתר מבחני עבר - ההצלחה מובטחת.\n\nהמבחן מציג קונספטים מאוד דומים לשאלות שכבר הופיעו בשיעורי הבית ובמבחנים קודמים. לא ממציאים את הגלגל מחדש - לכן כדאי לשים דגש על פתרון מבחני עבר, ולבוא עם דף נוסחאות מפוצץ כמו מנה פלאפל.\n\nהשורה התחתונה: \nלעשות את שיעורי הבית, לפתור מבחנים קודמים, להנות מזמן האיכות עם עכאשה.", "timestamp": 1715866005363}, {"author": "Bar", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מוחמד עכאשה\nחוות דעת - הרצאות: \nהרצאות מעניינות, עכאשה מרצה סופר מתחשב שרוצה בטובת הסטודנטים. היה סבלני, דאג לפשט את החומר כמה שניתן ואף הראה תרגילים לדוגמה במהלך השיעור\nשם המתרגל/ת: נירית\nחוות דעת - תרגולים: \nמתרגלת אכפתית, לעיתים היה קשה להבין אותה אך תמיד ענתה בסבלנות וניכר כי היא מאוד רצתה בהצלחה שלנו\nשעורי הבית: \nרמת הקושי של מטלות הבית עלתה בהדרגה, אך המתרגלת תמיד עזרה איתן\nהמבחן: \nהמבחן היה הוגן\nהשורה התחתונה: אין על עכאשה בעולם! מרצה מספר אחת", "timestamp": 1718630018322}]}