{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מרכדי שגב\nחוות דעת - הרצאות: \nהרצאות  מועברות באופן מסודר מאוד , מעניין ומובן\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: \nמעביר את התרגולים באווירה ממש נחמדה וקלילה . רוב התרגולים היו מובנים ומאוד עזרו בהבנה . כדאי מאוד לבוא לתרגולים בעיקר כי מועבר שמה  לפעמים חומר שלא מלמדים בהרצאות.\nשעורי הבית: \n\nהמבחן: \nמותר חומר פתוח אז מומלץ מאוד להדפיס  את כל התרגולים , סיכומי הרצאות .חצי שאלה שלמה מהמבחן הייתה פשוט להעתיק כמעט מילה במילה פיתוח מסויים מהתרגול\nהשורה התחתונה: \nקורס חשוב ומעניין דורש השקעה אבל לא  באופן מוגזם.", "timestamp": 1613925116819}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: מאוד נלהב להסביר על כל נקודה מה היישום שלה בדברים מתקדמים יותר. מצד אחד זה מעניין ומצד שני גורם להרצאות להיות לא סופר קוהרנטיות\n\nשם המתרגל/ת: אלכס דיקופלצב\nחוות דעת - תרגולים: בסך הכל ממש סבבה. צריל לשים לב כי הרבה פעמים התרגול ישמש להעברת עוד חומר בנוסף למה שנלמד בהרצאות ולאו דווקא לתרגול מה שנלמד בה\n\nשעורי הבית: לגמרי סבירים\n\nהמבחן: נראה שהרצון הוא שנקבל ציונים טובים\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1615812708301}, {"author": "Eilon Zohar", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורן (מוטי)\nחוות דעת - הרצאות: ראיתי הקלטות של מוטי בפנופטו ולמדתי קצת מהאינטרנט. היה ממש נחמד\n\nשם המתרגל/ת: גיל\nחוות דעת - תרגולים: הבן אדם מלך, אבל התרגולים די מעפנים. הרגישו כמו הרצאות על חומר שהוא לא של ההרצאה\n\nשעורי הבית: לא קשורים בשום צורה להרצאות ולתרגולים. לא קלים, לא קשים\n\nהמבחן:שאלה 1- שרשרת מסות וקפיצים, יחס דיספרסיה....\nשאלה 2- מיתר חצי אינסופי, למצוא מקדם העברה החזרה וכו\nשאלה 3- התאבכות. משוואות מקסוול, פוינטינג, עוצמה.\nמבחנים רפטטיביים אבל קשים מאוד. קצת הרבה כתיבה אבל לא בקטע מעיק. לא קשור לשיעורי בית לתרגולים או להרצאות. תעשו מבחני עבר ויהיה בסדר\n\nהשורה התחתונה: פותח את הראש, לא כבד, ממוצע סבבה", "timestamp": 1644311276743}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: קרן עמית\nחוות דעת - הרצאות:  מעביר את ההרצאות בצורה כיפית אבל מגיע לא מסודר לשיעור.\nקרה לא פעם אחת שהוא התעכב על פיתוח של נוסחה למשך מספר דקות או רשם אותה לא נכון והיה צריך לחזור ולתקן אותה במהלך השיעור.\n\nשם המתרגל/ת: גל גומפל\nחוות דעת - תרגולים: אחלה מתרגל. מבין בחומר ומעביר אותו תכלס.\nהתרגולים עצמם הם פחות \"תרגולים\" כי לרוב הם עוברים על חומר שלא לומד בהרצאה. \n\nשעורי הבית: יש גיליון להגיש כל שבוע וחובה להגיש את כולם מלבד אחד. זה יוצא די עמוס במיוחד באזור הבוחן אמצע.\nכמו התרגולים לא היה סנכרון בין השיעורי בית להרצאות בשבועות הראשונים של הסמסטר.\n\nהמבחן: משך 3 שעות ומורכב משלושה שאלות על נושאים שונים.\nהשאלות ברמה של השיעורי בית. (לא קשה במיוחד) \nחלק מהשאלות לא היו ברורות אז במהלך המבחן הגיעו לרשום הבהרות על הלוח.\n\n\nהשורה התחתונה: קורס לא קשה במיוחד אבל מבולגן רצח.\nיתרון ליכולת למידה עצמית.", "timestamp": 1676396154588}, {"author": "קליין-גורדון", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה:  עמית קרן\nחוות דעת - הרצאות:  משעמם, מבולגן, לא ברור, כל הקורס זה פיתוח אחד מתמשך בלי כותרות וסיומות ברורות. מדבר הרבה שטויות ולפעמים יותר מדי חסר טאקט וגבולות בניסיון שלו להצחיק. \n\nשם המתרגל/ת: גל/נועה/נדב\nחוות דעת - תרגולים: עדיף נדב, אבל התרגולים באופן כללי כתובים מבולגן ולא ברורים. הסדנאות (של נדב) היו הדבר הכי טוב, כתובות מעולה ורק מהן הצלחתי ללמוד משהו בקורס הזה, ונשמע שגם נדב מתרגל טוב (לי התנגש). בקיצור ממליץ רק על נדב וחבל שהוא לא כותב גם תרגולים חדשים.\n\nשעורי הבית: מרופרנסים כולם מ2014. לפעמים צריך לכתוב טיפה קוד. באופן כללי יש גיליון כל שבוע וצריך להגיש את כולם פחות אחד בשביל לקבל מגן. זה מציק\n\nהמבחן: רמה סבירה, הרבה אלגברה וטריקים מתמטיים. היה מאוד קשה לכולם ונתנו פקטור של יותר מ15%!\n\nהשורה התחתונה: קורס שיכל להיות נחמד וקליל ולתת ידע בסיסי בפיזיקה שיעזור לקוונטים, אבל הועבר רע. לא נהניתי בכלל", "timestamp": 1676747176657}, {"author": "1", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: עמית קרן\nאחד המרצים הכי טובים שהיה לי בתואר, הרבה לא התחברו עליו. אבל אני נהנתי\n\nשעורי הבית: \nכל שבוע גליון, רובם היו קלילים, חלקם כלל תכנות שזה היה סיוט\n\nהמבחן: \nקשה ברמות,היה פקטור רציני, אבל עדיין המבחן לא קשור לחומר\n\nהשורה התחתונה: \nקורס מעניין אך המבחן לא קשור", "timestamp": 1676807318389}, {"author": "עמית קרן", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: די מבולגנות ולא תמיד הכי ברורות, בקצת יותר מחצי הראשון של הקורס קשה לראות את התמונה הגדולה ולאיפה מכוונים בסוף (מדברים על מטוטלות וקפיצים כמו ב-1פ') אבל בסופו של דבר הדברים מתחברים ואז רואים את היופי של הקורס.\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: אחד המתרגלים הטובים, מסביר בצורה מעולה עם הרבה אינטוציה לדברים, מראה שחמושים של הדברים, ובאופן כללי פשוט מעביר את התרגולים באופן מעולה.\nנדב גם העביר את הסדנאות של הקורס, והן נעו בין להיות ממש שימושיות להבנה של הקורס לבין מאוד מעניינות ומעשירות מעבר לחומר. \n\nשעורי הבית:  שיעורי הבית היו ממחוזרים משנים שעברו באופן חלקי, כולל ניסוחים לא ברורים, ובמה מקרים אף לא נכונים, דבר שהקשה על הבנת הפתרון, אך היו גם שאלות שעזרו להבין את החומר\n\nהמבחן: מועד א' של הקורס היה קשה (נתנו 15% פקטור), אבל הוא היה הוגן, עמית והמתרגלים לא המציאו שאלות חדשות והם גם לא נתנו דברים סתם כדי להכשיל, אבל כן היו חישובים לא הכי פשוטים.\n\nהשורה התחתונה: קורס חובה לרוב המסלולים של פיזיקה ולכן חייבים לקחת, אבל בסה\"כ קורס נחמד מאוד.", "timestamp": 1676898257943}, {"author": "הויגנס", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: מאוד מבולגן, קשה להבין אותו, השורות התחתונות שלו מתחבאות היטב בין הבדיחות המוזרות שלו.\nבלמידה לקראת המבחן נפלו לי המון אסימונים, הצלחתי לחזור אחורה להקלטות שלו ולהבין למה הוא התכוון.\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: אחלה מתרגל אם אתה בראש שלו, טיפה מבולגן אבל מכפה על זה עם רשימות מוקלדות שהן אחלה.\n\nשעורי הבית: לא נוראיים, אבל בסוף צריך להבין את החומר כדי לבצע - שזה הקושי המרכזי.\n\nהמבחן: קטלו את אמא שלנו במבחן, הורידו על כל דבר אפשרי - ומצד שני 15% פקטור. \n\nהשורה התחתונה: מאוד מתמטי, לא מספיק פיזיקה, וקשה מאוד להבין מה השורות התחתונות והדברים החשובים של הקורס", "timestamp": 1677453071362}, {"author": "Daniel Oukhanov", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:  מורגש מאוד שעמית מגיע להרצאות לא מוכן באמת , הוא מאוד מבולגן ומבולבל , זה מקשה מאוד לעקוב אחריו \nעסוק יותר בלהריץ בדיחות מאשר ללמד אותנו משהו . בקיצור לא באמת איכפת לו מהקורס וחבל ..קורס מעניין \n.הייתי ממליץ ללמוד עם הרשימות + ללכת שעות קבלה ולבקש עזרה עם מה שלא מובן\n\nשם המתרגל/ת: נדב אוריון \nחוות דעת - תרגולים:  ההיפך המוחלט מעמית , חושב לו מהקורס ומהסטודנטים , חשוב לו שבאמת נבין את החומר לעומק , טיפה מהיר בתרגולים אבל אם מבקשים להאט אז הוא כן מוריד קצב \nעשה עלי רושם ממש טוב , אחד המתרגלים המקצוענים שהיו לי \nקיבלתי בסוף מעל 80 ורק בזכותו \n\nסדנאות : בעיני חובה ,הרשימות של נדב ממש טובות \nחלק מהחומר אתה מבין רק לקראת סוף הקורס זה טוב שזה שם \n\n\nשעורי הבית:  חלק קשים ומייגעים וחלק ממש קלים \nבעיני ממש חשוב לעשות אותם באמת ולהבין אותם המבחן בסוף היה די מבוסס על שעורי בית \n\nהמבחן: כמו שיעורי בית רק רמה מעל \nמבחן קשה , ויותר מזה ארוך ..הבדיקה הייתה קשוחה יותר משחשבתי \nממש רצו שתרגיע בדיוק לתוצאה \nהמון אלגברה והמון טכניקה לצד הבנה \nאבל כן חשוב ממש להשקיע באלגברה\n\nהשורה התחתונה: לא להתרגש מעמית , ללמוד לבד+תרגולים+סדנאות+שעות קבלה יעשו את העבודה אבל צריך ממש להשקיע", "timestamp": 1677682748852}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: על הפנים, מבולגן לא ברור\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: נותן קצת תקווה לקורס\n\nשעורי הבית: גיליון כל שבוע\n\nהמבחן: קשה ובדיקה עוד יותר קשה\n\nהשורה התחתונה: לברוח", "timestamp": 1677757642389}, {"author": "מוטי שגב", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: \nעמית בחור טוב. אם אתם לא מסוג האנשים שלחוצים על החומר ורק רוצים שהמרצה ילמד אתכם אז אתם תסתדרו כי היה מצחיק סך הכל בהרצאות. האם למדתי משהו בהרצאות? וואלה לא, אבל באיזה הרצאות כן לומדים? אישית אני מבין לרוב בתרגולים ושיעורי בית \n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: \nבהתחלה הייתי אצל גל אבל מהר מאוד עברתי (כמו שאר הקורס), אני לא התחברתי לאיך שגל מלמד אבל אני לא מאמין בלרדת על מתרגלים כי כל אחד והסגנון שלו, מה שכן בתור מתרגל אחראי הוא התנהל בצורה לא עניינית רוב הזמן ומי שהיה דה פקטו אחראי זה נדב. \nנדב רץ מהר לפעמים על החומר וזורק מלא שיט של מתמטיקה לאוויר אז קל לאבד אותו\\, במיוחד כי התרגולים בנויים לשעתיים ולא לשעה אבל חשוב לו שיבינו והוא מוכן תמיד להסביר גם על חשבון הזמן הפרטי שלו ואני מאוד מעריך אותו על זה. החיסרון הגדול אצל נדב היה כל הפיזמטיקאים המתחכמים שלא נתנו לו ללמד את התרגול, ולכן אני ממליץ על ביטול המסלול הזה - אם הייתי רוצה לשמוע חבורה של ילדים מבלבלים את השכל כדי להישמע חכמים הייתי רואה חדשות\n\nשעורי הבית: \nכל שבוע גיליון. כמו כל דבר בחיים - בהתחלה זה קשה ואז זה נהיה קל יותר. לרוב כן לומדים מזה כי זה מכריח אותך לחזור על הסדנאות והתרגולים אבל חלק מהגיליונות היו מיותרים בדיעבד\n\nהמבחן: \nוואלה מבחן לא קל אבל גם לא כזה קשה אם לומדים מספיק זמן לפני וחוזרים על מבחנים של עמית קרן כי השאלות שלו חוזרות על עצמן\n\nהשורה התחתונה: \nזה קורס נחמד שהיה יכול להיות הרבה יותר נחמד אם היו מעבירים אותו אחרת", "timestamp": 1679903449691}, {"author": "נדב צלניקר", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: \nלא הייתי בהרצאות למדתי מהרשימות שרן קירי עשה על ההרצאות של מוטי מ2017 \nיש המון חומר והוא מלומד בצורה מאוד מבלבלת\nבתרגולים ובסדנאות מלמדים חומר חדש שצריך גם לדעת...\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא הייתי\nשעורי הבית: \n8 גליונות ממוחזרים אז אפשר לרפרנס אבל עדיין ארוך\nהמבחן: \nמבחן עם חומר פתוח\nוהיה עוד מלא הטבות מילואים אז היה סבבה\nהשורה התחתונה: \nקורס מעפן כל הבדיחות על קורסים בפיזיקה זה מפה\nקורס חובה אבל אפשר לדחות אם לא בא לכם בסמסטר 3 זה לא באמת קדם לקורסי סמסטר 4", "timestamp": 1713702462762}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: לא הגעתי להרבה כי בבוקר אבל מרצה טוב וממש חשוב לו להעביר איך החומר רלוונטי לדברים אחרים. לא מרים את הראש לפעמים מהלוח והדף לפרקים ארוכים וזה לא טוב למי שמחכה לשאול שאלות.\n\nשם המתרגל/ת: מתן אבן צור\nחוות דעת - תרגולים: מתרגל נחמד ממש, עוזר להבין את התכלס של החומר ובאמת איך פותרים תרגילים.\n\nשעורי הבית: ארוכים כמו הגלות, ממש מוגזם אבל לפחות אפשר לרפרנס.\n\nהמבחן: הוגן, חומר פתוח ומומלץ להביא כמה שיותר אם אפשר. דגש על הבנה ולא על חישובים מיותרים.\n\nהשורה התחתונה: קורס נחמד, די מעניין ולא יותר מידי קשה.", "timestamp": 1714660624006}, {"author": "מלך הריש והמפנק הראשי", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מוטי שגב \nחוות דעת - הרצאות: מזעזע. לא מעניין בקטע מפחיד \n\nשם המתרגל/ת: עמית קם במוקלט (יכולתי ללכת למתן בפרונטלי אך בבירור עדיף עמית)\nחוות דעת - תרגולים: מקור האור היחיד בקורס הזה. רק שם מבינים על מה מוטי דיבר בהרצאות.\n\nשעורי הבית: ארוכים ודי קשים, אך מרופרנסים ושווים 20% מהציון\n\nהמבחן: סביר בקושי שלו, והבדיקה מאוד מפרגנת\n\nהשורה התחתונה: לא ממליץ, אבל אם אתה צריך לקחת את הקורס הזה, כנראה שזה חובה ואין לך אפשרות אחרת...", "timestamp": 1715156200901}, {"author": ".", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מרדכי שגב\nחוות דעת - הרצאות: \nעל הפנים. לוחש ללוח למשך שעתיים. מנותק לחלוטין מצרכי הסטודנטים. עונה על שאלות בצורה מבלבלת.\nשם המתרגל/ת: עמית קם\nחוות דעת - תרגולים: \nנקודת אור יחידה בקורס הזה. יודע להסביר את החומר וכריזמטי. עונה על שאלות בצורה מדוקדקת ועניינית. מומלץ!\nשעורי הבית: \nאיומים. כל קשר ביניהם לחומר המועבר בהרצאות מקרי בהחלט. ממוחזרים אחד לאחד עם גליונות עבר של מוטי. \nהמבחן: \nהמבחנים של מוטי יחסית קלים. מותר להביא כמה חומר פתוח שרוצים.\n\nהשורה התחתונה: \nאילולא מוטי היה מוביל את הקורס, הוא יכל לעבור בטוב.", "timestamp": 1716200847737}, {"author": "ֶ;", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מוטי שגב \nחוות דעת - הרצאות: \nמשעמם מאוד, מנהל רומן עם הלוח. \n\nשם המתרגל/ת: עמית קם \nחוות דעת - תרגולים: \nאחלה מתרגל חבל שתקעו אותו עם קורס כזה גרוע\n\nשעורי הבית: \nמיותרים ולא רלוונטיים, פשוט לרפרנס יחסוך המון רע. אין כלל קשר בינם לבין ההרצאות, התרגולים, הקורס והחומר הנלמד\n\nהמבחן: \nמעבר לשאלה אחת שהוא המציא היה די ממוחזר, בודקים הבנה ולא מתמטיקה אז גם אם נראה שרוצים פיתוח אין צורך בכך. מאוד \n\nקשה להבין מה נדרש שם באמת אבל איכשהו קיבלנו נקודות על תשובות אז תנחשו אם אין לכם מושג או זמן\n\nהשורה התחתונה: \nלא להתרגש מהקורס יותר מידי, ללמוד למבחן ממבחני עבר עם פתרונות לא נכונים אז שימו לב, במהלך הסמסטר אין מה להשקיע כלכך כי זה לא מועיל כלל.", "timestamp": 1716452151781}, {"author": "סטודנטית מסכנה לפיזיקה", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: \nמעביר את ההרצאה ללוח, מבטיחה שאם הרצאה אחת לא היה מגיע אף סטודנט הוא לא היה שם לב.\nממלמל מלא דברים וכותב עקום ולא ברור, גם כמעט בלתי אפשרי לקבל הסבר למה שנכתב על הלוח כי הוא פשוט לא שם לב שמחכים לשאול שאלה ועד שהוא כן שם לב כבר יש לך שאלות חדשות.\n\nשם המתרגל/ת: עמית קם\nחוות דעת - תרגולים: אחלה מתרגל, הסיבה היחידה שהצלחתי להבין משהו בקורס הזה.\n\nשעורי הבית: ממוחזרים, פשוט לרפרנס את כולם הדרייב כי הקשר בניהם למה שמועבר בהרצאות ונשאל במבחן מקרי בהחלט וחבל סתם לשבור את הראש.\n\nהמבחן: ארוך ברמה מוגזמת, במבט אחורה מתברר שרצו שנראה הבנה במקום פיתוחים מתמטים אבל נתנו לנו עמוד שלם לכל סעיף אז זה לא היה ברור תוך כדי המבחן.\nיש חומר פתוח בלתי נגמר וחלק מהשאלות ממוחזרות ממבחני עבר אז ממש אפשר להדפיס אותם ולהעתיק תוך כדי והבדיקה הייתה מאוד מפרגנת.\n\nהשורה התחתונה: חרא קורס, אבל לצערנו קורס חובה ולכן אין ברירה.\nממליצה להשקיע מינימום מאמץ תוך כדי הסמסטר וללמוד ממבחני עבר (למרות שיש טעויות בחלק מהפתרונות הרשמיים) לקראת המבחן", "timestamp": 1716467652523}, {"author": "אברהם טל", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: לא טובות - לדעתי העניין הוא שלמוטי יש אינטואיציה כל כך גדולה לגבי החומר ככה שהחומר מאוד ברור לו והוא לא מצליח לדמיין שלסטודנטים אין כבר את ההבנה שלו של החומר, אז מה שקורה זה שמוטי אומר המון דברים במילה ומצפה שנבין, וכשאנשים שואלים שאלות הוא לא מצליח להסביר. גם ההרצאות ברובן הן פשוט מוטי מעתיק פיתוחים מתמטיים מהמחברת שלו ומסמן עוד ביטויים בעוד אותיות.\nלהגנת מוטי אני כן אגיד שאני חושב שאכפת לו ושהוא אוהב ללמד, והוא אפילו מנסה להכניס דוגמאות רלוונטיות מהחיים ומפיתוחים טכנולוגים, אבל זה פשוט לא עובד וגם את הדוגמאות שהוא נותן אי אפשר להבין. אני ממליץ ישר לעבור ללמוד מהרשימות שיש בדרייב של רן קירי ולתגבר איפה שצריך עם הספר של David Morin (אפשר למצוא באינטרנט).\nחבל כי זה דווקא חומר שכן יכול להיות מאוד מעניין ורלוונטי מהקצת שקראתי בספרים על הנושא לאורך הסמסטר.\n\nשם המתרגל/ת: קצת מתן אבן צור וקצת עמית קם\nחוות דעת - תרגולים: הלכתי לשני תרגולים בהתחלה אבל הפסקתי כי הרגיש לי שמתן בעיקר מקריא מרשימות.\nבתרגולים מסוימים שהיו על חומר שהרגשתי שחשוב אז ראיתי הקלטות של עמית. עמית סך הכל יודע להעביר את החומר בצורה מעניינת אבל לפעמים הוא מדלג על הסברים דווקא בנקודות הקריטיות וגם כשהלכתי אליו לשעת קבלה בשביל להבין משהו הרגשתי שהוא קצת מחרטט אותי (טריק קלאסי של פיזיקאים), אבל אולי זה היה נכון ואני סתם טעיתי.\n\nאני אוסיף כאן שבנוסף לתרגולים היו גם כמות לא מבוטלת של סדנאות שלדעתי זה לא קול כי זה סתם דרך של הסגל לדחוף עוד חומר לקורס בלי שזה יתבטא בכמות נק\"ז של הקורס.\n\nשעורי הבית: קשים וארוכים בטירוף, לא סבירים בכלל. הם כן ממוחזרים אז מי שאין לו בעיה לרפרנס יכול, אבל בתור מישהו שלא אוהב לרפרנס יצא שמשהו כמו 50% מהסמסטר שלי הלך על פתרון שיעורי בית בגלים, ואני באמת לא מגזים. משהו לא פרופורציונלי בכלל כשבמקביל אני לוקח קורסים כמו מכניקה אנליטית ואינפי 3.\n\nהמבחן: דווקא המבחן יחסית סבבה, ונקודה לציין לחיוב היא שאני באמת מרגיש שמוטי יודע לבנות מבחנים ככה שהם באמת בוחנים הבנה של החומר ולא רק יכולת לפתור תרגילים.\n\nהשורה התחתונה: על הפנים מכל בחינה שהיא, אם יש לכם אופציה לא לקחת אז תברחו", "timestamp": 1716492768114}, {"author": "סטודנט עייף", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: מאוד מתפזר. אבל חשוב ממש להיות אצלו בהרצאות. בודק במבחן דברים ספציפיים.\nלא אוהב את המרצה בכלל..אבל אם חייב לעשות את הקורס אין ברירה חוצמאשכרה לבוא להרצאות\n\nשם המתרגל/ת: מתן אבן צור\nחוות דעת - תרגולים: סביר\n\nשעורי הבית: קשים. 99 אחוז מהזמן ריפרונסים\n\nהמבחן: קשה ממש. אוהב להתקיל עם קונספטים שלא פגשת\n\nהשורה התחתונה: חשוב ממש להגיע אצלו להרצאות ולוודא שמסכמים.", "timestamp": 1716928758020}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מרדכי שגב\nחוות דעת - הרצאות: \n\nהיה לי קשה להתרכז בהרצאות, יותר מדי חישובים ומעט לוגיקה.\nלמדתי מרשימות של רן קירי שבדרייב, רשימות טובות, אבל הקורס עצמו מאוד מבלבל. ניגשתי למבחן עם הרגשה שאין לי מושג מה זה גל. אם זאת, בדיקה הייתה מאוד נחמדה וקיבלתי ציון טוב.\n\nשם המתרגל/ת: מתן\nחוות דעת - תרגולים: \n\nלפעמים היה קשה לעקוב אחרי כל החישובים שבתרגולים. מתרגל נחמד מאוד, באתי כמעט כל שבוע לשעת קבלה, מאוד עזר\n\n\nשעורי הבית: \n\nממש ארוכים ומעצבנים.\n\nהמבחן: \n\nלא קל, אבל בדיקה מאוד נחמדה.\n\nהשורה התחתונה: \n\nלא צריך להילחץ מהקורס. קורס מעצבן, אבל בסוף לא קשה לעבור אותו עם ציון טוב.\nמשעמם ממש.\nלא מומלץ כלל למרות שבממומלצת.", "timestamp": 1717507180499}, {"author": "ליים בת אל", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מוטי שגב \nחוות דעת - הרצאות: רע: הרבה אלגברה קשה לראות מה עיקר ומה תפל. חסרות דוגמאות חיות של הנושאים שנלמדים בשיעור (הדגים לנו גל במיתר בעזרת מוט מעץ, go figure) טוב: הרבה דוגמאות שמקשרות את הנושא למציאות.\n\nשם המתרגל/ת: עמית קם \nחוות דעת - תרגולים: המלך של הקורס אין לי מילה אחרת לתאר את זה. כריזמטי, ענייני, מסביר בדיוק מה עיקר ומה תפל, ומה התמונה הגדולה שצריך להסתכל עליה (גם אם לא אומר את זה מפורשות). הדבר היחיד שהחזיק לי את המערכת בקורס. \n\nשעורי הבית: ארוכים ומייגעים, חלקים מאוד מתמטיים סזיפיים. לא כל כך קשורים למבחן.\n\nהמבחן: חומר פתוח, צריך לדעת לסדר אותו טוב ולשים את החומר הרלוונטי. הקונספטים (קפיצים ומסות, גלים במיתר, אלקטרומגנטיים) לא משתנים אבל השאלות כן. שווה להביא מבחנים שפתרתם. \n\nהשורה התחתונה: קורס עמוס מבחינת גיליונות ארוכים. להגיע לעמית קם הוא הישועה של הקורס, לא יודעת להגיד עד כמה ההרצאות עזרו לי.", "timestamp": 1718533380057}]}