{"posts": [{"author": "Avi", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "הרבה הגשות שדורשות השקעה, המשוב על ההגשות לא תמיד תואם למה שנלמד בכיתה.", "timestamp": 1597923356146}, {"author": "א", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "קורס הזוי. מאוד מאוד מיותר לחשמלטורים. לסיים כמה שיותר מהר ולהתקדם. מאוד לא מובן כל חישובי השגיאות, הגרפים, הדרך לכתוב את הדו\"ח. כל מדריך שם דגשים אחרים.\nדורש מלא זמן, ובסוף הציונים במילא מנורמלים.\nנראה שקבלת הציונים תלויה במדריך שקיבלת ולא בכמה השקעת במעבדה. \nבסוף מקבלים ציון טוב, אבל חבל שרק 1 נק\"ז שלא באמת שווה לכמה זמן שהשקעת בקורס.", "timestamp": 1598963624203}, {"author": "מירמורי", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גבי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא שווה את הזמן מבחינת נקז, בחני כניסה לא פתירים הם 20 אחוז מהציון", "timestamp": 1616361976211}, {"author": "חשמלמל", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "מרצה:  גבי וירנוט\nחוות דעת -לא ממליץ, עונה על שאלות אבל נותן לך הרגשה שאתה נמצא בכיתה א לא בטכניון מאוד מאוד קפדן בבדיקה של הדוחות מחסיר נקודות אפילו על מילה שגויה שנמצאת בדוח \n\nשעורי הבית: יש דוחות ומדידות מגישים כל שבוע , כתיבת הדוח לוקחת לפחות 6או 5 שעות וזה אם מבינים טוב מה שאומר המדריך אם לא לפעמים 10 שעות\n\nהמבחן:אין מבחן\n\nהשורה התחתונה: מעבדה מאוד עמוסה לא הגיונית מבחינת נקודות שרפה לי את הזמן של הסמסטר אבל בסופו של דבר היא חובה .אין מה לעשות", "timestamp": 1625247425408}, {"author": "***&", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: גבי\nחוות דעת - הרצאות: תתרחקו ממנו !\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות ומדידות , צריך להשקיע (בלי הזמן של המעבדה) 5-8 שעות לכתיבת הדוח , נוראית !\n\nהמבחן: אין\n\nהשורה התחתונה: המטרה של המעבדה הזו היא גזילת הזמן של הסמסטר לא מועילה לא ברורה ולא כלום", "timestamp": 1626365424336}, {"author": "חיי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: גבי ויירנוט\nחוות דעת - הרצאות: אל תתקרבו ממנו ! לא מומלץ בכלל בכלל , זאת הטעות הכי גדולה שעשיתי שהמשכתי איתו במעבדה זו \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש דוחות להגשה ששורפות את רוב הזמן , ניסויים מגעילים , פשוט בזבוז זמן \n\nהמבחן: אין\n\nהשורה התחתונה: מיותרת לחלוטין , אבל בגלל ש יא חובה אין מה לעשות , צריך לסבול", "timestamp": 1626446229340}, {"author": "מישהו", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: מתן אבן צור\nחוות דעת - הרצאות: \nמשעמם ממש אבל עונה על שאלות ומסביר טוב\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nלעשות את המעבדה בזום, סיוט אחד גדול עכשיו תוסיפו לזה 5 דוחות בסמסטר וקיבלתם את בזבוז הזמן הכי גדול של חייכם\nהמבחן: אין\n\nהשורה התחתונה: אם אפשר להתרחק כמו מאש!", "timestamp": 1626782327424}, {"author": "Eden Ninary", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: היה לי מדריך מעולה שממש השקיע אבל הקורס פשוט מייותר. לא למדתי כלום וגזל מיליון זמן.", "timestamp": 1626867723400}, {"author": "mimi", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: גבריאל ויירנוט (מכנה עצמו כ- \"גבי\")\nחוות דעת - הרצאות: מדריך זוועה ! זוועה לא מילה שמספיקה לתאר אותו , מבחינת הרצאות , בדיקה , פשוט הכל , אם יש לכם מרצה אחר תרוצו אליו ולא להתקרב מגבי!!! \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: דוחות הגשה מגעילים ברמות , לוקחות את רוב הזמן ובסוף מקבלים 0 מ 2 על הדוח ( ציון נמוך מאוד) , חושבים שנולדנו יחד עם איינשטיין ורוצים ממנו לכתוב דוח שלא מכיל טעויות, אפילו על טעות בדקדוק המדריך הזה מחסיר נקודות , המדריך חושב שאין בעולם קורס אחר מזה ששלו , לא מתחשבים בעומס הרב על הסטודנטים , פשוט זוועה\nהמבחן: אין\n\nהשורה התחתונה: סיימתי אותה ועדיין לא מבין מה הייתה המטרה ממנה , רק לשבת מול פני המדריך 3 שעות בשבוע , ו 2 שעות נוספות בביצוע הניסוי , ו 7 שעות לפחות בכתיבת הדוח. הכל תלוי במדריך, כל הציונים בשליטה שלו, מעבדה מיותרת לחלוטין לסטודנט של הנדסת חשמל , אפילו קורס הספורט מועיל יותר מהמעבדה הזו !", "timestamp": 1627139921042}, {"author": "גבי ויינרוט", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המדריך: גבי ויינרוט (המלך)\n\nחוות דעת:\nאני לא מבין מאיפה הגיעו כל הביקורות הנוקבות. גבי הוא הבן אדם הכי מדהים שפגשתי בתואר שלי. הוא כל כך קסום שאפילו תליתי פוסטר ענק שלו מעל המיטה. כולם בוכים שהוא דקדקן אבל תחשבו על זה שמעכשיו אתם תעדו לכתוב דוחות מעבדה כמו שצריך. (סליחה, מה שכתבתם אלו לא דוחות מעבדה). חוץ מזה, יש לגבי שלנו תגובות יפות ונחמדות על טעויות מטומטמות שאתם עושים, אז תצחקו קצת ותקבלו את ה - 60 בכיף.\nיום טוב. \n\nשעורי הבית: \nקלילים. אני לא מאמין שזה כל מה שאנחנו עושים\nהמבחן: \nאין\nהשורה התחתונה: רוצו *אל* גבי, הבן אדם מדהים ויהיה איתו כיף חיים שלא היה כמותו.", "timestamp": 1655620564590}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המתרגל/ת: עביר חסן\nחוות דעת - תרגולים: מכל מדריכי המעבדה ששמעתי עליהם ויצא לי להשלים אצלם, עביר ממש מעולה. היא נחמדה, מסבירה את החומר בצורה ברורה (יחסית לשאר) ועוזרת אם נתקעים במטלב אח\"כ עם הדו\"ח. גם מפרגנת בציונים של הדוחות ולא מתקטננת בניגוד לשאר\n\nשעורי הבית: דו\"חות מעבדה שצריך להגיש כל שבוע, פלוס בחני הכנה קצרצרים במודל שמרופרנסים בדרייב. הדו\"חות עצמם די מזעזעים, לא באמת מכינים אותך לאיך לכתוב אותם או איך להציא את הנתונים והגרפים ממטלב, שזאת בכלל תוכנה שממש לא כיף לעבוד איתה אם לא יודעים/מכירים מישהו שיודע לעבוד איתה. הבנתי שאמורים לעבור מתישהו לפייתון ואז יהיה יותר נסבל, אבל כל עוד זה לא קרה תתכוננו נפשית להמון כאב ראש בקורס.\n\nהמבחן: רק זה היה חסר לנו\n\nהשורה התחתונה: המעבדות עצמן די קלילות ולא מסובכות מדי, הדו\"ח השבועי לוקח הרבה יותר זמן ממה שלגיטימי לקורס של נק\"ז.", "timestamp": 1657217220188}, {"author": "עומר", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "קורס מיותר\nלדחות לסוף התואר אם חייבים לעשות אותו.\n\nלרפרנס את כל הדוחות במילא מקבלים ציון נמוך אז לפחות תחסכו זמן.", "timestamp": 1660058774402}, {"author": "חילזון הפרא", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המתרגל/ת: איגור גיטלמן\nחוות דעת - תרגולים: איגור אחלה מדריך, לא דורש הרבה הכנה מראש למעבדה ועוזר במהלך הניסוי בכל דבר. בנוסף תמיד מסביר בצורה ברורה מה יש לכלול בדו\"ח\n\nשעורי הבית: לכתוב דוחות מעבדה. בגדול תכתבו אותם בלי להשקיע יותר מדי, ציון על נז אחד לא שווה את הבזבוז זמן הזה. בנוסף יש בחני כניסה לכל מעבדה, פשוט תעברו לפני על הרפרנסים ותקוו שלא תיפלו על שאלות מונפצות\n\nהמבחן: אין\n\nהשורה התחתונה: מעבדה שבעיקר מבזבזת זמן אבל לא נוראית", "timestamp": 1660153958338}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת:  גיא שני\nחוות דעת - תרגולים: מדריך ממש טוב! חוץ מזה שהוא נחמד הוא גם ממש עוזר. \n\nשעורי הבית: יש שני מפגשים כל שבוע, בכל מפגש עושים ניסוי שונה וצריך להגיש דוח על כל ניסוי.\nבתחילת המפגש יש הסבר על הרקע התיאורטי של הניסוי ולאחר מכן בוחן במודל. הבוחן לא קשה אבל התשובות מוזרות לפעמים אז כדאי להיעזר במדריך.\nעשיתי את הקורס בקיץ לכן היה צריך להגיש שני דוחות כל שבוע, קצת מעמיס והדוחות משעממים אבל לא קשים מדי.\n\nהמבחן: אין\n\nהשורה התחתונה: מרגיש מיותר", "timestamp": 1667286360629}, {"author": "L", "difficultyRank": 3, "generalRank": 3, "semester": "202103", "text": "שם המרצה: אין\nשם המתרגל/ת: אין\nיש מדריכים במעבדה.\nאני הייתי אצל יעל והיא מדריכה טובה ועוזרת כשצריכים עזרה. \nשעורי הבית: אין\nיש דוחות מעבדה שצריך להכין אותם לבד לפי תבנית מסוימת שצריכים לכלול בהם פריטים מדויקים והסברים מדויקים של מעבדה ותוצאות ניסויי המעבדה.\nהדוחות מעבדה דורשים זמן גדול של מחשבה וכתיבה בצורה נכונה לבודקים.\nהמבחן: אין\nיש כמעט בכל מפגש של מעבדה בוחן כניסה ממוחשב שמהווה חלק מציון סופי של קורס.\n\nהשורה התחתונה: המעבדה דורשת זמן ולכן ממליץ לקחת אותה בסמסטר קיץ אותה כשאין קורסים אחרים לקחת בסמסטר קיץ.", "timestamp": 1667549890352}, {"author": "מר שגיאה", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם הממדריך:  קטיה\nחוות דעת - תרגולים: בסדר כזה\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nדוחות: נוראיים, תרפרנסו עד כמה שניתן, תכלית המעבדה היא לשתות זמן וללמד כלום , תדריכי המעבדה כתובים גרוע ואין בהירות לגבי מה צריך ומה לא צריך להופיע בדוח הסופי.\n\n\nהשורה התחתונה: לא לומדים כלום, מתישהו צריך לעשות בשביל לסיים אז תדחפו את זה בסמסטר שמתאים לכם, סהכ 6 מעבדות, לנו היה 5 דוחות מעבדה ואחד מן הדוחות היה הגשה תוך כדי המפגש - מה שהקל וקיצר.\nהייתי אומר בממוצע 5 שעות לדוח (לבן זוג כשמחלקים) עם רפרונס די כבד", "timestamp": 1673894547245}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אקטרינה\nחוות דעת - הרצאות: לא ממליצה. מבזבזת הרבה זמן על שטויות ואז נלחצים בזמן עבודה. \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: מאוד מקפידים (בקטע מעצבן) על כתיבת הדוח. ללכת ראש בקיר וזהו. \n\nהמבחן: -\n\nהשורה התחתונה: לא מומלץ, אבל חובה (אין ברירה)", "timestamp": 1679235539305}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202203", "text": "שם מנחה: מר ויינרוט גבריאל\nממש בחור מקסים. מאוד עוזר להבין את הדרישות ואם עושים בדיוק מה שהוא רוצה מצליחים!\n\n\nסיכום:\nקורס שחובה להיפטר ממנו בקיץ. אחרת מאוד מציק..", "timestamp": 1704979499748}]}