{"posts": [{"author": "פיזיקאי אלמוני", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: גידעון (גידי) אלון\nחוות דעת - הרצאות: גידי מרצה מדהים. גם ברור, גם מעניין, אווירה ממש טובה ומתעכב על כל סטודנט ושמח לעזור.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הרבה דוחות, וזה דוחות ככה שאין משהו טוב להגיד בנושא.\n\nהמבחן: \n\nהשורה התחתונה: קורס נוראי. זאת מעבדה למה ציפיתם? ביום שבו לא יהיו יותר מעבדות גם לא יהיה יותר רעב עולמי.", "timestamp": 1614180992067}, {"author": "ל", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גידי (גדעון) אלון\nחוות דעת - מפגשי מעבדה: מסביר היטב ועוזר במה שצריך, נהדר.\n\nשעורי הבית: הסמסטר (בגלל קורונה?) לא היו כלל, רק דפי מעבדה שמבוצעים בזמן המפגשים.\n\nהמבחן: אין\n\nהשורה התחתונה: חביב מאוד, לבוא להיות רציני בכיתה ולקבל ציון גבוה, מומלץ לקחת יחד עם פיזיקה 1פ' שכן מהווה פרקטיקה טובה לחומר.", "timestamp": 1615837390599}, {"author": "yos", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: כל המתרגלים\nחוות דעת - תרגולים: מאוד לא ברור מה רוצים ממך, מעטים המקרים בהם ברור במה להתמקד, ומה נדרש, חשבתי שאבוא להנות אבל היה כל כך מתיש 3 שעות לרוץ אחרי המטלות וכל מיני דברים טכניים מידי, מבלי לראות לאן זה הולך.\n\nשעורי הבית: כמעט ואין וזה המזל.\n\nהמבחן: לא היה השנה..\n\nהשורה התחתונה: דורש יכולת לאלתר, אחרת מאבדים את זה.", "timestamp": 1644153057736}, {"author": "שגיאה בשגיאה", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המנחה: גברת ג׳וליה סאלח\nחוות דעת: לא אהבתי את הקורס. המנחה הסבירה ממש גרוע ולא הביאה מקום לסקרנות. היא הייתה קשוחה מדי לטעמי ואפילו הביאה לי 0 על דוח שמילאתי בו כמעט הכל.\n\nשורה תחתונה: אני פיזמטיקאי אז כמובן שסבלתי חלקית. למלא לגמרי את כל הדוחות כדי שלא תקבלו 0.", "timestamp": 1644939225188}, {"author": "0", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: קטיה\nחוות דעת - הרצאות: היינו במעבדה של יום חמישי והיה נראה שקטיה רק רוצה שנסיים ונלך ... היה מאוד לא רציני ומאוד לא מלמד. לא קיבלנו משובים רציניים על הדוחות, באנו תקתקנו את הניסוי והלכנו.\n\nהשורה התחתונה: אחלה, כמו מעבדה בתיכון.", "timestamp": 1645391792913}, {"author": "Bob Bobinson", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המתרגל/ת: ג'וליאן נורדי\nחוות דעת - תרגולים: ג'וליאן מנחה מעולה. הוא תמיד הסביר את החלק התיאורטי לכולם על הלוח ועזר בחישובים, והתמקד בניסוי עצמו. הוא גם נתן הרבה טעימות מקורסים הבאים והסביר קצת מעבר על כל ניסוי. אחרי כל ניסוי הוא גם שלח הערות מפורטות לכל סטודנט, וגם סיכום כללי של הניסוי עם דגשים וטעויות נפוצות. באופן כללי, הוא ממש עזר לי גם להבין את החומר של פיזיקה 1פ' וגם להינות מהמעבדות - מומלץ בחום!\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: הקורס לא עמוס כמעט בכלל, אין בו שיעורי בית או מבחן - צריך רק לבוא לשלוש שעות בשבוע. בנוסף, הוא היה לדעתי מאוד מעניין, ועזר להבין את החומר התיאורטי של 1פ'.", "timestamp": 1647265889745}, {"author": "Yaniv Slor Futterman", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nיש דברים מעניינים, אבל מרגיש יחסית מיותר. קצת חופר, אבל לפחות אין דוחות אז זה כן 2 נקז עם ציון גבוה וכן לומדים קצת. אבל בסך הכל, זה קצת קאדר ואם הייתי יכול לבחור לא לעשות את זה, לא הייתי עושה את זה.", "timestamp": 1647350833064}, {"author": "פיזיקאי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "השורה התחתונה: מאוד קשוחים בבדיקת הדוחות. קורס לא מעניין בכלל ופשוט בזבוז של זמן ומאמץ.", "timestamp": 1658070691302}, {"author": ":)", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: גידי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: דוחות רק במעבדה עצמה. מעבדה די כיפית קצת סיזיפית.", "timestamp": 1660568307728}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שמעון סוחולוצקי\nחוות דעת - הרצאות: מעביר את המעבדה טוב.\n\n\nהשורה התחתונה: חצי מהזמן להסתבך עם ה-Tracker, חצי שני לחשב שגיאות מדידה", "timestamp": 1660728244682}, {"author": "לא תודה", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המדריך: אנסטסיה וינבאום\nחוות דעת - מדריך: טובה. מסבירה הכל בבירור, נותנת תמיכה איפה שצריך.\n\nהשורה התחתונה: אנסטסיה הרשתה לתת ל wolfram לעשות הצבות של שגיאות. מומלץ בחום. יש גם מדריכים שמאפשרים לתכנת קוד בפייתון שיעשה זאת. לחשב במחשבון לא מומלץ. צריך להביא את דוח הניסוי מראש (אבל לא למלא אותו מראש). מי שמכיר Tracker - תכירו יותר טוב.", "timestamp": 1675604881857}, {"author": "עוד סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מתן גראור\nחוות דעת - הרצאות: מתן מדריך מעולה, נחמד מאוד, מסביר לעומק ודאג שתמיד נצליח.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין, מושלם.\n\nהמבחן: אין, מושלם.\n\nהשורה התחתונה: מאוד מעניין! חשוב ממש להבנה של החומר התיאורטי. בסוף כל מעבדה מגישים דו\"ח ואין התעסקות אחרי הזמן במערכת.", "timestamp": 1676107857201}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה:\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: באמת נחמד, רב המעבדות עזרו לי להבין את החומר המלמד בכיתה טוב יותר", "timestamp": 1676212607876}, {"author": "ללניה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: מתן\nמתן היה מעולה, הרחיב מאוד את הידע ועזר לי להבין דברים בפיזיקה מעבר למעבדה. תרם באופן ישיר להצלחה בפיזיקה 1פ\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nאין\nהשורה התחתונה:", "timestamp": 1676881781641}, {"author": "א.ב.", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המדריכה: אנסטסיה\nחוות דעת: \nבאופן כללי, המעבדה בנויה בצורה מאוד מסודרת. הניסויים לא מאוד מורכבים, והדברים מונגשים בצורה טובה.\nאני אישית לא כ\"כ מתחבר לניסויים, אבל למי שכן זה אחלה הזדמנות לראות איך מה שלמדנו בהרצאות מתבטא בפועל.\nעובדים הרבה עם tracker - תוכנה שמקבלת סרטון ומנתחת תנועה של גופים. זה היה די מעצבן, אבל גם עבד בסוף ברוב המקרים.\nיש כמות מוגזמת של חישוב נגזרות חלקיות (בשביל לחשב שגיאה נגררת). לפעמים זה יכול לקחת כמעט חצי מהזמן. כדאי להגיע מוכנים נפשית...\nספציפית לגבי אנסטסיה - לדעתי היא מדריכה ממש מומלצת, מכווינה ומסבירה. דורשת לעבוד ולכתוב בצורה מסודרת.\n\nשעורי הבית: \nאין שיעורי בית. אמורים לסיים הכל במסגרת שעות המערכת.\n\nהשורה התחתונה:\nבסך הכל הפסקה מתודית די נחמדה בתוך העומס של הסמסטר...", "timestamp": 1678054639368}, {"author": "Tamir Manoach", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיא\nחוות דעת - הרצאות: המדריך הכי טוב שהיה ולעולם לא יהיה כי הוא פרש\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין באמת, מסיימים הכל באותו יום.\nגם אם לא בזמן המעבדה, באותו יום\n\nהמבחן: אין\n\nהשורה התחתונה: מעבדה מדהימה,  שלא ישנו אותה אמן", "timestamp": 1678261181363}, {"author": "Leeyam bat el", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: הדר גבלינגר \nחוות דעת - הרצאות: מנחה חמודה מאוד, הוגנת מאוד בציונים, אבל לפעמים לא יודעת להסביר את המעבדה כמו שצריך ומפספסת דברים טכניים של סביבית העבודה שהיו עוזרים לסיים את המעבדה בזמן. יש הצגה קצרה של נושא המעבדה, ואז עושים אותה. שווה לעבור על הקובץ של המעבדה מראש, כי לפעמים היא לא מסבירה הכי טוב.\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין \nחשוב לציין שלא אמורים לעבוד על הקורס הזה מחוץ לזמן המעבדה - אמורים להספיק את כולו במהלך שעות השיעור. למרות זאת, מתוך 11 מעבדות לפחות על 6 מהן עבדנו בין שעה לארבע אחרי סיום השיעור.\nלקחת בחשבון.\n\nהמבחן: אין\nהציון הסופי הוא ממוצע ציוני המעבדות.\nהשורה התחתונה: \nקורס שלא לוקח הרבה תשומת לב והשקעה מחוץ לשעות השיעור, ואין בו מבחן. אבל, במהלך הסמסטר יכול לקחת זמן יקר שאם מתקשים בקורסים אחרים, הוא נחוץ. שווה לשקול לעשות בקיץ.", "timestamp": 1678946764590}, {"author": "אחלה גבי", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  גבי ויינרוט\nחוות דעת - הרצאות: \nמצוין, מומלץ מאוד! קשוח מאוד ביחס לשאר (בעיקר בהתחלה), אבל משקיע מאוד ודואג שאשכרה תצאו עם כלים והבנה מהמעבדה.\n אם באים נטו בשביל הציון במטרה לא לעבוד קשה לא כדאי.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין, מסיימים הכל במעבדה\nהמבחן: \n\nהשורה התחתונה: \nאחלה גבי", "timestamp": 1679734694814}, {"author": "Vexomous", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המתרגל/ת: רומן\nחוות דעת - תרגולים: \nאם אתם צריכים עזרה להבין מה קורה - האחרים יותר יעזרו, אבל אם אתם מרגישים בנוח עם מה שקורה, תקבלו טיפים נחמדים\n\nשעורי הבית: \nאין\n\nהמבחן: \nאין\nהשורה התחתונה: חובה לפיזיקה, תצפו ששום דבר לא יעבוד כמו שאתם מצפים, אבל מבוא נחמד לרעיון של מעבדות.", "timestamp": 1710801863812}, {"author": "איתמר", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המדריך/ה: קטיה\nחוות דעת - מעבדה: מדריכה מעולה. מסבירה את הרקע לכל ניסוי בצורה ברורה, תמיד עונה על שאלות ונותנת משובים טובים על הדפים שמגישים אחרי הניסוי. בד\"כ גם מפרגנת בציונים.\n\nשעורי הבית: כלום. מסיימים הכל בשלוש השעות שנמצאים במעבדה.\n\nהמבחן: אין.\n\nהשורה התחתונה: קורס קליל ונחמד. באים למעבדה, עושים ניסוי והולכים בלי שצריכים לחשוב על הקורס עד שבוע הבא. ציון גבוה וניסויים קלים. לא להילחץ אם תוצאות הניסוי סותרות את החישובים, זו פחות או יותר המטרה.", "timestamp": 1713693705673}, {"author": "Ar No", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: תום רשף\nחוות דעת - מעבדות: \nהמעבדות עם תום היו מצוינות. תום הסביר כל מעבדה בצורה מאוד ברורה לפני שהתחלנו לבצע את הניסויים, הוא נתן ליווי די טוב והסביר לנו בצורה ברורה מה הוא רוצה שיהיה בדוחות המעבדה ואיך אנחנו אמורים לחשב דברים. \n\nשעורי הבית: \nאין באמת שיעורי בית אבל קיים הסיכוי הזה שלא תסיימו את דוח המעבדה במעבדה עצמה - תום היה מאוד חופשי בקטע הזה וכל עוד הגשנו עד לבוקר למחרת הכל היה בסדר - לעומתו שמעתי שיש מנחי מעבדה שאם לא הספקתם אצלם אז תגישו מה שיש אז זה יכול ללכת לכאן ולכאן\n\nהשורה התחתונה: \nתוודאו שהמנחה שלכם מאפשר להגיש דוחות מעבדה גם יותר מאוחר, ושימו לב שזה שלוש שעות ולא שעתיים כמו הרצאה רגילה, ברוב המקרים אתם תזדקקו לשלוש שעות האלה", "timestamp": 1714083809089}, {"author": "אור שרון", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ג'ף\nחוות דעת - הרצאות: לא מסביר כמעט בכלל בזמן הניסויים ונותן לנו להבין לבד - יש מקרים שזה טוב, אבל גם יש שלא. אם מסיימים הוא לא סתם מנפיץ משימות לעשות עד סוף 3 שעות שזה טוב. כל הציונים מעל 90 - סך הכל אי אפשר ממש להתלונן, למרות שלדעתי היה עוזר אם הוא היה מסביר קצת יותר ועונה על שאלות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: קורס לא קשה בכלל, אבל מרגיש קצת טיפשי לפעמים.", "timestamp": 1715353864964}, {"author": "א", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המדריך:  ג'ף\nחוות דעת: בניגוד למדריכים אחרים הוא לא מסביר או מתעמק בתיאוריה או בניסוי עצמו בכלל, ניגשים ישר לעבודה, כמעט כל ציון שלו הוא מעל 95. הוא לא דורש המון חשיבה/ניתוח/חישובים בדוח הסופי. מעולה למי שמגיע ורוצה לקבל ציון גבוה, פחות אחלה למי שימשיך אח\"כ לקורסים נוספים של מעבדה עם מדריכים הרבה יותר רציניים ומעמיקים. עשיתי השלמות עם גבי מדי פעם ואין ספק שהוא דורש יותר ולא מעגל פינות אבל ייאמר לזכותו שהוא אשכרה מלמד כלים חשובים ודרך נכונה יותר להסתכל על התיאוריה ועל אופן הניסוי עצמו והוא עונה על שאלות באופן ענייני וממוקד.\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: אם התמזל מזלכם להיות עם ג'ף תהנו מלסיים מעבדות בשעה וחצי ולא בשלוש ולהתפנק עם ציונים גבוהים רק קחו בחשבון שאם בקורס המשך תקבלו מדריך רציני יותר תקבלו קצת שוק כי ג'ף לא ממש יכין אתכם לדרישות רציניות יותר.", "timestamp": 1715670846214}, {"author": "מעבד", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המנחה: מתן בורנובסקי ואז רומן קוליאדה החליף אותו באמצע הסמסטר\nחוות דעת: אצל מתן היה לי פשוט כיף כי הוא נותן לך להתמודד עם אתגרים בעצמך בדיוק במידה הנכונה וגם עוזר כשצריך, חוץ מזה שהוא גם אחלה בן אדם וממש נחמד. \nעם רומן גם היה לי אחלה - קצת פחות כיף, נראה לי גם כי המעבדות חוזרות עליהן בשלב מסויים וגם כי ממש התחברתי למתן אבל אין לי משהו רע לומר על רומן הוא באמת היה אחלה.\n\nשניהם נתנו ציונים גבוהים.", "timestamp": 1716493250860}, {"author": "עדן", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: (אחראי מעבדה) מתן גראואר.\nחוות דעת - הרצאות: נסיך עולם! כל זמן מחפש לעזור ולייעל אותנו תוך כדי המעבדה. תמיד יש אצלו תחושה טובה ויש תחושה שהוא אילו מתרגש להעביר לנו נושאים מסוימים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: סוג של דו\"ח מעבדה מקוצר- יחסית קלילים ולא דורשים הרבה זמן.\n\nהמבחן: אין.\n\nהשורה התחתונה: מעבדה עם ניסויים די קלילים ללא דו\"חות רשמיים.", "timestamp": 1716726297613}]}