{"posts": [{"author": "Guy Yoffe", "difficultyRank": 5, "generalRank": 4, "semester": "201901", "text": "שם המרצה: אריק אקרמן\nחוות דעת - הרצאות: מרצה טוב, אבל מאוד משונה. מלמד בצורה מאוד שונה מרוב המרצים. אני התחברתי - אחרים פחות.\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: מתרגל מעולה. מסביר טוב, יודע את החומר מעולה, עזר מאוד להבין את החומר.\n\nשעורי הבית: לנו היה גיליון אחד (מרופרנס) להגיש, והיו בחנים בע\"פ, שלדעתי מאוד עזרו להיות על החומר במהלך הסמסטר.\n\nהמבחן: סביר. אקרמן רפרנס אותו ממבחן ב2012 שהוא כתב.\n\nהשורה התחתונה: קורס מעניין מאוד.", "timestamp": 1597782231102}, {"author": "mark levit", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אריק אקרמן\nחוות דעת - הרצאות: מעניינות, הרבה פרטים טכניים שאפשר ללכת לאיבוד, אבל כמרצה אריק אחלה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nסבירים, בעיקר טכניים\nהמבחן: \nמתמקד בהבנה, מומלץ להסביר כל צעד גם אם נראה טריויאלי\nהשורה התחתונה: \nsurvive", "timestamp": 1616412601525}, {"author": "סטודנט כללי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מרצה טוב.\nהחומר מורכב מהרבה פיתוחים מתמטיים שלרוב לא קלים כל כך לעיכול אז לפעמים קשה להבין מה קורה ומי נגד מי אבל בסוף דברים מתחברים ולומדים הרבה פיזיקה.\n\nשם המתרגל/ת: יובל אבולעפיה\nחוות דעת - תרגולים: התרגולים מאוד עוזרים להבין את החומר ואיך משתמשים במה שלומדים בהרצאות. יובל מסבירה טוב ודואגת שהסטודנטים יבינו.\n\nשעורי הבית: \nגיליון שבועי שבהחלט עוזר להטמעת החומר, מאוד מומלץ לעשות כמה שיותר גיליונות.\n\nהמבחן:  מועד א היה הוגן עם ממוצע גבוה (אולי אף קל יחסית).\nבהחלט מבוסס על הבנת החומר שהיה בקורס.\n\nהשורה התחתונה: \nקורס לא קל אבל מעניין.", "timestamp": 1645113817780}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מושלמות!!! הקורס הכי טוב עם ההרצאות הכי טובות שעשיתי בתואר. מאד מאד מעשירות ומלמדות.\nהמרצה גם זמין מאד במייל ובשעות קבלה לכל שאלה שהיא. יש לו הבנה עמוקה מאד ומעניינת על מכניקת קוונטים ופיזיקה בכללי והוא ניסה לערב מאד ולשתף את ההבנה שלו עם הכיתה, וזה היה מוצלח מאד\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: עמית מתרגל נהדר, גם הוא זמין מאד, והתרגולים היו ברורים עם תרגילים שהתקשרו מאד למה שדובר בהרצאה. ההרצאה הייתה יותר תיאורטית ובתרגולים התעסקנו יותר בפרקטיקה, של איך לגשת לשאלה ואיך לפרק את מה שנלמד בהרצאה בפתרון בעיות פיזיקליות.\n\nשעורי הבית: לא קשים מדי ומעודדים הבנה של מה שדובר בהרצאות ובתרגולים\n\nהמבחן: מועד א ' היה מאד מאד הוגן, היו חלקים שדרשו חישובים יותר טכניים וחלקים שיכלת לפתור רק על סמך הבנה בלבד ללא חישוב אחד. \n\nהשורה התחתונה: אם אתם בפיזיקה אין לכם יותר מדי ברירה אך אל דאגה, הקורס עצמו מעניין ממש ועבר בצורה מעולה עם הסגל הזה", "timestamp": 1645160015656}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלמה\nחוות דעת - הרצאות: שלמה מרצה מדהים, מבין את החומר בצורה הכי עמוקה ויודע להעביר את ההבנה ואהבה שלו למקצוע הלאה. לוקח ברצינות כל שאלה של סטודנט בכיתה.\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: עמית מתרגל מעולה ומאוד מומלץ לבחור ללכת לתרגול שלו! מבין את החומר טוב, מגיע לתרגולים מוכן, ויודע לענות טוב על השאלות של הסטודנטים, ואם הוא לא יודע מיד את התשובה הוא לוקח את זה ברצינות ומחזיר תשובה שבוע אחרי, וזה ממש מוערך.\n\nשעורי הבית: יחסית קלים בהשוואה לקורסי עבר בפקולטה, לא מאוד עמוס ביחס לכמות הנק״ז.  הם מכינים מאוד טוב לרמה של המבחן של שלמה.\n\nהמבחן: מבחן מאוד הוגן, באמת דורש בעיקר להבין את החומר ולא התחכמויות מעבר.", "timestamp": 1645257838224}, {"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מצתרף לכל ההמלצות לפני, מרצה מעולה שמאוד אכפת לו מהסטודנטים\n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: גם פה, מצתרף לכל ההמלצות הקודמות, מסביר בצורה מאוד טובה ותמיד זמין לשאלות\n\nשעורי הבית: גליון שבועי, בדרך כלל לא עמוס במיוחד, בהתחשב בזה שזה 30% תקף, מאוד עוזר להבין את החומר \n\nהמבחן: היה מאוד הוגן\n\nהשורה התחתונה: קורס לא עמוס במיוחד אבל צריך לתרגל כדי להבין", "timestamp": 1646553715140}, {"author": "אנונימי.", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: מרצה מדהים, מתעכב על דברים ודואג שסטודנטים יבינו.  \n\nשם המתרגל/ת: עמית גופט.\nחוות דעת - תרגולים: מסביר את החומר בצורה טובה וגם מספיק לעבור על כל התרגול.  \n\nשעורי הבית: שיעורי בית שאפשר גם לפתור לבד. עוזרים בהבנת החומר ולא עמוסים (במיוחד כשמדובר בקורס של 5 נקז). \n\nהמבחן: מבחן שנועד לבדוק הבנה של החומר שהועבר במהלך הסמסטר ללא התחכמויות וניסיון להכשיל בכוונה. המבחן היה ללא דף נוסחאות אבל כל הנוסחאות הרלוונטיות לשאלה הופיעו מתחתיה בצירוף רמזים, ככה שאם למדת למבחן כנראה שתצליח. \n\nהשורה התחתונה: קורס מעניין ומועבר בצורה טובה (ע\"י הסגל הזה).", "timestamp": 1647255821447}, {"author": "Jared Goldberg", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: קצת מבולגנות, והבחירה של מה ללמד ואיך קצת מוזר. מאוד התמקד על טכניקה ולא על פרשנות פיזיקלית, וזה היה מאוד מאוד מוזר במיוחד שהגענו להתכונן למבחן וראינו מבחני עבר שהיו מאוד מוכוונים פרשנויות פיזיקליות. סה\"כ סבבה אבל, מרצה *סופר* חמוד, תמיד זמין לשאלות ועונה בצורה סופר סבלני. חוויית לימוד ממש ממש כיפית ומהנה. \n\nשם המתרגל/ת: עמית גופט\nחוות דעת - תרגולים: בהתחלה הוא קצת קשוח, סגור, אבל אחרי איזה שלושה תרגולים הוא נפתח וחוויית הלימוד משפתפרת ממש. בלי קשר לכמה כיף בשיעורים, הוא מתרגל מעולה. משקיע, בקיא מאוד מחומר, יודע לשים את האצבע על הדברים הכי מבלבלים ויודע לפשט אותם. ממש ממש אחלה\n\nשעורי הבית: טכניים מאוד, מה שעזר למבחן שהיה גם הוא מאוד טכני. גם 30% מגן שזה טוב\n\nהמבחן: טכני עד כדי שהיה מאוד מבלבל. הניסוחים מוזרים וזה מוזר לקבל מבחן בפיזיקה שכמעט והיה אפשר לפתור אותו בלי לעשות את הקורס, אבל הוגן מאוד עד אפילו קל. \n\nהשורה התחתונה: צריך לקרוא לזה מכניקה קוונטית 1.5 בעיניי, אבל יש פה דברים ממש מגניבים ודי רלוונטים לקורסי המשך - במיוחד חלקיקים זהים וחיבור תנ\"ז. סגל *מעולה*", "timestamp": 1647437778050}, {"author": "א", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: אלוף. בחור נחמד מאוד, מרצה מצוין, חומר מעניין.\n\nשעורי הבית: יחסית קלים, יש הרבה הדרכות ורמזים.\n\nהמבחן: הוגן מאוד, גם כאן היו הרבה רמזים והדרכות והכוונות.\n\nהשורה התחתונה: קורס מעניין בטירוף עם מרצה מצוין", "timestamp": 1648047545771}, {"author": "עודד", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שלמה\nחוות דעת - הרצאות: מצוין\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים מאוד, פעם ראשונה בתואר שלא הייתי צריך לרפרנס הכל \n\nהמבחן: בסדר גמור\n\nהשורה התחתונה: אני בדרכי... בדרכי לקוונטית 3 לישיבה של בחורים טובים", "timestamp": 1675774424811}, {"author": "רביד פלוטניק", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שלמה\nחוות דעת - הרצאות: מלמד לאט, רואה שכולם מבינים ונותן טיפים טובים\n\nשם המתרגל/ת: הקלטות של עמית גופט \nחוות דעת - תרגולים: אותו דבר\n\nשעורי הבית: קלים בקטע מחשיד, יש הדרכות והכול ממש סבבה \n\nהמבחן: טריקי. צריך לבוא מוכנים. הבדיקה מבאסת קצת\n\nהשורה התחתונה: תיקחו מה יש לכם ברירה?", "timestamp": 1677242986762}, {"author": "קליין גורדון", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות: \nמרצה מעולה, אכפתי, סבלני ומבין סטודנטים. הכי טוב שהיה לי בתואר בפער. יש רשימות מוקלדות באנגלית והן מצוינות.\n\nשם המתרגל/ת: ורד כהן\nחוות דעת - תרגולים: \nורד מעולה! מראה ומעבירה ידע. היא מעתיקה את התרגילים אל הלוח לפני שפותרת וזה נותן זמן להתכונן קצת לפני הפתרון, לדעתי זה מועיל. לדעתי התרגולים חשובים להפנמה של החומר.\n\nשעורי הבית: \nקלים בדר\"כ אבל ארוכים. לדעתי דרושים שינוי כי הם לא מכינים טוב לרמה של המבחן.\n\nהמבחן: \nמועד א'- שאלה 1 ו3  קשות אך הוגנות, שאלה 2 קשה. בדיקה הוגנת.\nלדעתי כדאי להתכונן דרך מעבר יסודי על הרשימות באנגלית והתרגולים, לוודא הבנה ושליטה בטכניקות העיקריות של הקורס.\n\nהשורה התחתונה: \nקורס מעניין מאוד עם סגל מעולה.", "timestamp": 1677932110237}, {"author": "אנרסט חלימוב", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nשלמה רזמט\nחוות דעת - הרצאות: \nמרצה מדהים אולי הכי טוב שהיה לי בתואר. מסביר הכל מאוד ברור. מוכיח כל מה שהוא מדבר עליו, אין את ה\"לטאטא מתחת לשטיח\" הרגיל, כל דבר הוכח מתמטית. אבל ההרצאות לא רק מתמטיות, שלמה תמיד מחבר את כל מה שהוא עושה לפיזיקה אמיתית, נותן אינטואציה על הכל ומסביר מתי כל קירוב שעשינו נופל ומתי הוא קירוב טוב. שלמה גם כתב סיכום מצויין באנגלית של הקורס.\n\nשם המתרגל/ת: \nעמית גופט (מוקלט)\nחוות דעת - תרגולים: \nמתרגל מעולה, אבל לא היה מתרגל בסמסטר שלנו בכלל. באופן הכללי התרגולים היו טובים מאוד בקורס ועזרו מאוד להבנה.\n\nשעורי הבית: \nגיליון שבועי, שהיה 20% עם חובת הגשה. השיעורים היו ממש סבבה עם מלא הדרכות ורמזים והיה אפשר לוודא איתם אם הבנת את החומר של השבוע. רוב הגליונות היו לא חופרים בכלל והיו מאוד לעניין. היו הרבה יותר קלים מהמבחן בפער.\n\nהמבחן: \nהמבחן לדעתי היה בהרבה יותר קשה מהסמסטר הראשון ששלמה העביר בו את הקורס. היה צריך לשלוט ולהבין טוב מאוד את העקרונות של המקצוע. אני חושב שבעיקר לקרוא את הסיכום של שלמה ולוודא שמבינים את מה שהולך שם זה הדרך הכי טובה ללמוד למבחן. מבחן קשה כמו שהגיוני שיהיה מקורס חובה של 5 נק\"ז אבל אפשר להצליח אם לומדים אליו.\n\nהשורה התחתונה: \nקורס מדהים לדעתי. זה קורס פיזיקה שמרגיש שמלמד ברמה מאוד גבוהה נושאים מתקדמים, והוא קורס הכי טוב שהיה לי בפיזיקה בוודאות. זה מרגיש כמו קורס ששלמה ניהל אותו לסטודנטים \"יותר בשלים\" והראה פיזיקה ממש יפה. \nקורס שתחת שלמה הוא תענוג!", "timestamp": 1679324578223}, {"author": "קירי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניינות, גם הפיתוחים הארוכים עברו ממש סבבה עם שלמה. הוא בד\"כ מוצא דרך להקליל את החומר המורכב ולשמור על עירנות.\n\nשם המתרגל/ת: יובל אבולעפיה\nחוות דעת - תרגולים: מדהימה. היא קצת לחוצה להספיק הכל בזמן אבל תמיד יש לה זמן לשאלות והסברים. תקבעו איתה שעות קבלה אישיות! היא תשב ותסביר עד שאין מצב שלא תבינו, כמה זמן שתצטרכו.\n\nשעורי הבית: מרופרנסים אבל גם בלי רפרנס לא מסובכים. יש הרבה הדרכות אז הם בסה\"כ כיפיים.\n\nהמבחן: הייתי קצת בשוק ממועד א' כי הוא היה מועד שונה מהמועדים של שלמה בשנה שעברה, אבל במועד ב' ואחרי תרגול של מבחני עבר והבנה עמוקה יותר של החומר, מועד ב' היה הוגן וממש לא מסובך. ממליצה בערך 50:50 על חומר תיאורטי של הרצאות+תרגולים מול תרגול מבחנים.\n\nהשורה התחתונה: אחלה קורס, שווה ממש, ולכו ליובל כי אין עליה", "timestamp": 1679335895443}, {"author": "סטודנטית ממוצעת", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שלמה רזמט\nחוות דעת - הרצאות:  מרתקות ממש, שלמה בין המרצים הטובים ביותר. ממליצה לעבוד עם הקלטות, כי כל מילה שיוצאת לו מהפה חשובה, אז אם מאבדים ריכוז לרגע קשה להבין.\n\nשם המתרגל/ת: ורד\nחוות דעת - תרגולים: ורד גברת על חלל, מומלצת בחום\n\nשעורי הבית: מרופרנסים, ובאופן מפתיע קלים גם בלי רפרנס\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679772619045}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דניאל פודולסקי\nחוות דעת - הרצאות: \nדניאל הוא אחלה, באמת חשוב לו שיבינו, אבל ההרצאות קצת איטיות לטעמי. הסיכומים שהוא העלה הם ממש טובים ומובנים ומכסים כמעט את כל החומר.\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \nקראתי את התרגולים המוקלדים והם מאוד ברורים ומפורטים. במקרים שהיה צריך קצת עוד הסברים ההקלטות של יובל ניצב עזרו.\nשעורי הבית: \nדי קצרים לרוב\nהמבחן: \nמאוד מתכונתי חוץ משאלה אחת שהיה קצת טריקי להבין באיזה כלים להשתמש בשביל לפתור אותה (כביכול הייתה על אטום מימן אבל בתכלס פשוט הייתה שאלה על תנע זוויתי)\nהשורה התחתונה: \nקורס חשוב שמסביר לראשונה איך אשכרה משתמשים בפיסיקה קוונטית, החומר יותר קשה מהקורס הראשון אבל המבחנים לא כאלה שונים ברמה.", "timestamp": 1715604753466}]}