{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "המון עבודה קשה לאורך הסמסטר, צריך להתרגל למתמטיקה כבדה וחדשה. לא לפספס כלום במהלך הסמסטר כי הכל נבנה מאוד מהר אחד על השני ולחזור כל הזמן על החומר, להתעקש להבין הכל וזה אפשרי, אם עובדים קשה זה בסוף משתלם (ומאוד מומלץ לשלב עם הרצאות של 8.04 של MIT של אלן בשביל האינטואיציה). המבחן בסוף בעיקר טכני ובראש קצת אחר מהחומר הנלמד ויהיה קל למי שהתמיד והשקיע לאורך הסמסטר, מומלץ מתחילת הלמידה למבחן להתחיל לעבוד עם דף נוסחאות ולהוסיף לו תוך כדי דברים ואינטגרלים בפרט.", "timestamp": 1595712734000}, {"author": "Chen Tasker", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: \nההרצאות בנויות רע מאוד. אסא טוב בלהעביר חומר לדעתי אבל החומר עצמו מסודר רע, ולוקח הרבה דברים מורכבים כטריוויאלים. צריך לדעת לסנן את העיקר מהתפל בשביל לא לאבד את ההרצאות.\n\nשעורי הבית: גיליון שבועי, חלקם רצים מהר אבל רובם עמוסים. סהכ קורס עמוס מאוד.\n\nהמבחן: המבחן עצמו טכני ברובו. הרבה פתירת אינטגרלים ואלגברה. הוגן בסהכ.\n\nהשורה התחתונה: רוב הקורס הרגשתי אבוד אבל בסוף למבחן מבינים מה חשוב וזה מסתדר.", "timestamp": 1597740648283}, {"author": "פאולי", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אסא\nחוות דעת - הרצאות: לא ברורות ולא מסודרות במיוחד.\n\nחוות דעת - תרגולים: השם ישמור\n\nשעורי הבית: לא עוזרים מי יודע מה\n\nהמבחן: לא קשה\n\nהשורה התחתונה: חומר נפלא שהיה אפשר ללמדו בצורה הרבה יותר טובה.", "timestamp": 1599385728351}, {"author": "קוונטית", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: קצת מבולגנות ואיטיות, אם אפשר לראות ווידאו על פי 2 אז זה עדיף בהרבה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: טכניים וממוחזרים משנים קודמות.\n\nהמבחן: טרוויאלי, אין הפתעות, מאוד דומה למבחנים קודמים של אסא.\n\nהשורה התחתונה: קורס שנראה מפחיד אבל בפועל הוא פחות.", "timestamp": 1609761103435}, {"author": "סטודנט כללי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: אסא מרצה טוב שמעביר בקורס הזה הרבה חומר מתמטי ופיזיקלי באופן די מוצלח. באתר הקורס הוא פרסם את הרשימות שלו שאיתן הוא עובד (התעדכנו גם במהלך הסמסטר) אז מאוד נוח ללמוד את החומר שבסך הכול הוא מעניין ממש!\n\nשם המתרגל/ת: יובל אבולעפיה\nחוות דעת - תרגולים: התרגולים מדגימים בצורה מאוד ברורה איך מיישמים את הכלים התאורטיים שנלמדים בהרצאה בפתרון בעיות.\n\nשעורי הבית: גיליון שבועי (חובה להגיש 10 מתוך 12) שמבוססים על התרגולים. לא קשים מידי לרוב, אולי ארוכים ומייגעים.\n\nהמבחן: יש מספר קטן של בעיות שונות שיודעים לפתור בצורה מדויקת בקוונטית אז המבחן היה בנוי על סט מוכר של בעיות. מעבר על מבחני עבר של אסא מעניק ניסיון לא רע להתמודדות עם בעיות כאלה. עם זאת המבחן היה שונה מרוב מבחני העבר של אסא.\n\nהשורה התחתונה: אחלה קורס :)", "timestamp": 1626451819289}, {"author": "Jared Goldberg", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה:  אסא אורבך\nחוות דעת - הרצאות: הרצאות ענייניות, בניות היטב, אשר גם הועבר בהם את החומר של הקורס וגם נתן לסטודנטים מקום להתרגש ולהתרשם מפגשיתם הראשונה עם מכניקה קוונטית.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: תרגילים מעולים. אחד הקורסים היחידים בתואר שבהם כל מה שתרגלנו היה באמת רלוונטי לחומר ובאמת עזר לי מאוד להבין אותו. יובל היה סבלני, עידד סקרנות והערשה, והפגין גם שליטה בחומר ואיכפתיות רבה להצחת הסטודנטים. מתרגל מצויין!\n\nשעורי הבית: לפעמים קצת מוגזמים מבחינת אורכם גם של הגליון וגם של חלק מהחישובים, אבל לרוב מאוד ענייניים ופרקטיים, הכנה טובה למבחן סוף.\n\nהמבחן: המועד א היה מעט שונה ממבחנים קודמות, והייתה בה שאלה שבה קצת התקטננו על מעברי מתמטיים שלא באמת רלוונטים לפיזיקה של הדבר, אבל סה\"כ מבחן הוגן.\n\nהשורה התחתונה: הקורס הכי טוב שעשיתי בתואר נקודה.", "timestamp": 1634913560424}, {"author": "קוונטית 1", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות:  די טכני, ולא בודק שהסטודנטים איתו. טעויות אלגבריות לבקרים שמאוד מקשות במעקב. הרשימות שלו רהוטות , מסודרות וטובות - נכס\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יובל אבולעפיה - מצויינת\n\nשעורי הבית: ברובם בסדר, מאוד קשורים לתרגולים.\n\nהמבחן: \n\nהשורה התחתונה: לפתור הרבה תרגילים, מקצוע די טכני", "timestamp": 1657202797066}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אסא\nחוות דעת - הרצאות: אחלה גבר\nהרשימות שלו זהב.\nכשזה נוגע לתאוריה הוא מסביר מצוין אבל לפעמים הוא עושה חישובים בכיתה ושם הוא הולך לאיבוד וקשה לעקוב אחריו. בכל מקרה רוב הזמן זה תאוריה אז ממש כיף\n\nשם המתרגל/ת: יובל אבועלפיה/ניצב\nחוות דעת - תרגולים: עשיתי פינג פונג בין שניהם כל הסמסטר. שניהם חריפים מאוד, סבלניים ונותנים מקום לדיון וכו'\nהבעיה שהתרגילים עצמם מאוד עמוסים וארוכים סטייל אינטגרלים מעצבנים או דברים כאלה ורק הסעיף האחרון באמת מלמד משהו, אז כשפותרים תרגיל זה לפעמים משעמם וקל לאבד קשב\n\nשעורי הבית: כמו המבחן. מייגעים ארוכים וטכניים. מצד אחד בהרצאות נראה שאסא רוצה שנבין לעומק ומצד שני בשיעורי בית ובמבחנים זה פשוט רצף ארוך ולא נגמר של לכסון מטריצות ואינטגרלים כפולים\n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס, אהבתי מאוד חוץ מהמבחן ושיעורי הבית. יש הקלטות של אסא ויובל מ2021 מומלצות בחום", "timestamp": 1657448277562}, {"author": "???", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אסא\nחוות דעת - הרצאות: \nמזעזע. לא מובן בעליל. הוא יכול לדבר על משהו 3 הרצאות בלי להסביר מה זה בכלל. 0 אינטואיציה 0 הבנה פיזיקאלית. מרגיש שעשיתי קורס באלגברה עם מרצה שמתעקש לפתור בעצמו את האלגברה בזמן ההרצאה ולא להסביר מה הוא עושה. עצוב מאוד כי זה חומר מרתק.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: \nמצויין. מסביר טוב ונותן הבנה פיזיקאלית שלא הייתה קיימת בהרצאות. מרגיש את הכיתה ותמיד עוזר לכל שאלה. נקודת אור בקורס עם סגל הזוי.\n\nשעורי הבית: \nזוועה. ארוך בצורה לא פרופורציונלית. שיעורי הבית נותנים 10 אחוז מגן אבל השקעתי בהם יותר זמן מקורסים ששיעורי הבית הם 40 אחוז וגם 5 נקז. שוב, כל קשר בין שיעורי בית להבנה פיזיקאלית מקרי בהחלט. שיעורי בית במתמטיקה בלי להבין מה אתה עושה.\n\nהמבחן: \nרע. הקורס מועבר כקורס אלגברי עם ממש קצת אינטואיציה ותיאוריה (דרך אגב זה מבחירה. אסא הבהיר בתחילת הקורס שככה זה הולך להיות). אבל החליטו לכתוב מבחן תיאורטי ולא מובן. בדיחה ממש לא מצחיקה.\n\nהשורה התחתונה: \nחומר מרתק עם סגל מזעזע. חובה ללכת ליובל ניצב או אבולעפיה. בתקווה שישנו אותו לשנה הבאה.", "timestamp": 1657630100293}, {"author": "*", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אסא אויברך\nחוות דעת - הרצאות: \nמזעזע. לא קשוב לכיתה, קופץ בין נושא לנושא בלי הסבר ולא קשוב לשאלות. הוא מניח שהסטודנטים עשו כל קדם מתמטי ופיזיקלי אפשרי לפני הקורס. עם זאת, יש לו כוונות טובות - סיימנו את הקורס מוקדם מהצפוי והוא השקיע בסוף הסמסטר בסרט ופיצות אז לא הכל גרוע. הרשימות של אסא מכסות את כל מה שצריך לדעת (הוא כותב אותם במפורש על הלוח), וההקלטות שלו מ-2020 היו הרבה יותר ברורות מההרצאות הפרונטליות הסמסטר.\n\nשם המתרגל/ת: יובל ניצב\n\nחוות דעת - תרגולים: \nמלך, מלך, מלך. מסביר בצורה מאוד ברורה בדיוק את מה שצריך לדעת, ויש לו הרבה ידע מעבר שיודע להחזיק אותך מעוניין. התרגולים עצמם מסוכמים מעולה ומסונכרנים טוב כך שהם בדיוק מה שצריך לדעת בשביל לפתור את הגליון השבועי.\n\nשעורי הבית: \nגליון שבועי ארוך וממוחזר משנים קודמות. חוץ מבמבחן שלנו, נראה שהוא בדיוק מה שהיה צריך לדעת למבחן.\n\nהמבחן: \nאחרי שכל המבחנים של אסא ב-15 שנה האחרונות היו בדיוק באותו פורמט, שלנו איכשהו היה הזוי לגמרי עם המצאות חדשות של אטום מימן, בלי אוסילטור הרמוני/תורת הפרעות/Ylm/כל דבר אחר שראינו בכיתה. ביזיון גדול\n\nהשורה התחתונה: \nקורס מתמטי בלי ממש קשר לפיזיקה. אסא לא מעביר אותו משהו וקל מאוד להכנס לשביזות ממנו, אבל גם אפשרי לגמרי לסנן ממנו את מה שצריך לדעת ולהמשיך הלאה לקוונטית2 שאמור להיות יותר מעניין. צריך לדעת אלגברה לינארית מעולה בשביל להצליח - כל מה שקשור במרחבים וקטורים ולכסון. מעבר לזה? לא למדתי פה כלום", "timestamp": 1657643051721}, {"author": "אופרטור החיסול", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: ניכר שהוא אוהב להרצות ורוצה בטובת הסטודנטים, אבל די מובלגן בהרצאות וקצת לא מודע לרמת ההסברים שלו ולכתיבת המתרגילים שלו לפעמים (יכול לתת הסבר שבעיניו ממש ברור ואינטואיטיבי, אבל פשוט לא מצליח לקלוע להבנה של הרבה סטודנטים). הרשימות שלו ממש טובות. \n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: מתרגל טוב, קצת הולך לאיבוד לפעמים אבל משקיע מאוד בהסברים ובמתן אינטואיציה לדברים השונים שלומדים. קבצי התרגולים מצוינים.\n\nשעורי הבית: תרגיל בית כל שבוע, שניים מהם כללו כתיבת קוד קצת מעצבנת אבל לא מזעזעת. תרגילי הבית לא ממש מאוזנים, חלק מהם יכולים לקחת שעה וחצי בסה\"כ ובחלק מהם אפשר לבלות יותר משעה וחצי רק על שאלה אחת. נראה שברוב השנים, שיעורי הבית מכינים לא רע למבחן (המשך בשורה הבאה).\n\nהמבחן: הזוי. השנה אסא בחר לשנות כמעט ב-180 מעלות את סגנון המבחן, וזה גרם לכך שפתירת מבחנים ישנים לא מאוד עזרו בפתירת המבחן הזה. יש קונצנזוס די רחב בקרב כל מי שניגש למבחן, שהוא היה ארוך וקשה בצורה קיצונית, והרוב המכריע יצא החוצה בפה פעור ובתחושת כשלון. באמת אין שום סיבה לתת לסטודנטים לעשות מבחן כזה.\n\nהשורה התחתונה: קורס ממש מעניין, ופותח עיניים לתחום חדש. לי אישית היה לי מעניין מאוד ברוב הקורס, וחבל שהמבחן משאיר כזה טעם מר בפה.", "timestamp": 1657985240357}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אסא\nחוות דעת - הרצאות: הפסקתי להגיע באמצע הסמסטר. מתישות ולא תורמות להבנה של החומר כמעט. אסא ״טס״ על החומר עם הרבה טעויות חישוב והרבה חורים לא מובנים, הוא בקושי בודק עם הסטודנטים אם יש שאלות או מוודא שמבינים על מה הוא מדבר. הרשימות שלו סבירות אבל ארוכות בטירוף.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: חמוד אבל לא משהו. מתבלבל הרבה בחישובים/בחומר.\nממליץ ללכת למתרגלים אחרים (לי לא הייתה ברירה עקב אילוצי מערכת).\n\nשעורי הבית: יש ויש, חלק היו יחסית קצרים ופשוטים וחלק באורך הגלות עם חישובי אינטגרלים מזעזעים.\n\nהמבחן: גולת הכותרת של הקורס - נוראי! שלוש שאלות ארוכות מאוד עם כל-כך הרבה משימות בכל סעיף שבאיזשהו שלב כבר לא שמתי לב אליהן - ניסיתי רק לסיים את מה שאספיק.\nהשאלות פתירות למי שהיה בקורס ולמד את החומר ברצינות, פשוט היה יותר מדי דברים להספיק בשלוש שעות...\n\nהשורה התחתונה: ציפיתי לקורס הכי יפה בתואר והתאכזבתי קשות בזכות המרצה.", "timestamp": 1658074568067}, {"author": "***", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: ההרצאות גרועות, מלאות בפיתוחים מתמטיים מיותרים שהוא מעתיק מהרשימות שלו ועדיין טועה מלא בדרך, הלוח בבלאגן ופשוט אי אפשר לעקוב אחריו. עדיף לראות הקלטות או לקרוא את הרשימות שלו.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: המתרגל הכי טוב!! למדתי את הקורס הזה רק ממנו, הכי סבלני שיש, עונה על כל שאלה, מסביר מעולה ומתעדף נכון את הזמן בתרגול. \n\nשעורי הבית: גליון שבועי, חלק קצרים וחלק ארוכים בהגזמה אבל כמעט הכל ממוחזר ויש רפרנסים. הוסיפו השנה שני תרגילי מאטלב בתוך הגליונות. לא ברור למה כל העבודה הקשה הזאת שווה רק 10% מהציון.\n\nהמבחן: לא דומה לשום דבר שהיה לפני.\n\nהשורה התחתונה: קורס בעיקר באלגברה. להשקיע בגליונות, ללכת לתרגולים ולקרוא את הרשימות. אולי המבחן יהיה קשור לזה בסוף", "timestamp": 1658085917414}, {"author": "השבלול", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nאסא אוירבך\nחוות דעת - הרצאות: \nאסא מעביר חלק מהדברים טוב לדעתי, כמו החלקים היותר תאורטים של האלגברה וכל הבסיס של התאוריה של הקוונטים, וחלק לא כל כך טוב בעיקר בבעיות קונקרטיות שצריך לפתור, שמרגיש שהוא מפוזר ונכנס לפינות ממש ספציפיות של חשבונות ואינטגרלים. \nיצא לאסא שם ממש רע בקורס כמרצה אני חושב שהוא בסדר סך הכל, מה שאי אפשר לקחת ממנו זה את ההתלהבות של מהחומר.\nיש לאסא ספר של ההרצאות שהם מעולות ומסודרות מאוד, כדי מאוד לעקוב אחריו.\n\nשם המתרגל/ת: \nיובל ניצב\nחוות דעת - תרגולים: \nיובל ניצב מתרגל מצויין, לוקח את הדברים שנלמדו בההרצאה ומסביר מעולה איך אשכרה לפתור שאלות. בנוסף, תוך כדי נותן אינטואיציה וטריקים. התרגולים בכלל בנויים מעולה בקורס הזה.\n\nשעורי הבית: \n10% מגן על שיעורים קשים וארוכים בטירוף, זה באמת לא נורמאלי כמות ההשקעה בשביל 10% שיש פה אבל תקף אז אין מה לעשות.\n\nהמבחן: \nבאופן כללי המבחן בקורס הזה הוא בדרך כלל די ממוחזר וטכני, ספציפית המבחן שלנו היה הזוי לגמרי כי אסא החליט להיות מקורי אחרי איזה 10 פעם שהוא מעביר את הקורס. ברוב הסמסטרים אבל לדעתי, עם תרגול ממבחנים ישנים אפשר להוציא ציון טוב.\n\nהשורה התחתונה: \nהרבה אנשים חווים משבר בקורס הזה, ומתאכזבים ממנו רצח. זה קורה בגלל ששומעים מכל מיני מקומות של מדע פופלרי על \"מה זה מכניקה קוונטית\", רוב התיאורים האלה הם הפשטות או אפילו די שטויות. אנשים מחכים שהקורס הזה יפוצץ להם את המוח, כמו שהם שמעו לפני, וזה לא קורה. \nאז תיאום ציפיות, זה קורס שמראה איך בעזרת כלים תאורטים של אלגברה אפשר לקבל תוצאות. אז כשאתם שואלים את עצמכם \"מתי נגמר המטמתיקה התאורטית הזאת? תביא כבר את הפיזיקה\", היא לא נגמרת, זה הקורס. הקורס מדבר בשפה של אלגברה ליניארית וזה משיג תוצאות. אם זה המיינד-סט שבאים איתו, אפשר לראות איך התאוריות שלמדתם בקורסים קודמים נותנות חיזויים על הטבע ולדעתי זה דבר די יפה.\n\nבקיצור, תבואו בראש פתוח, מכניקה קוונטית זה לא מה שאומרים בריק ומורטי, בקורס הזה רואים הרבה אלגברה, תדעו למה לצפות.", "timestamp": 1658090372982}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "אנשים אוהבים להגזים.\nנכון, אסא לא המרצה הכי טוב שהיה לי עד עכשיו בתואר, אבל הוא גם לא הכי גרוע. בסופו של דבר הוא מעביר את החומר בצורה סבירה, והרשימות שלו מעולות.\nנכון, השיעורי בית מאוד ארוכים וקשים ומגיע להם יותר ממגן של 10%, אבל זה נכון גם להרבה קורסים אחרים.\nנכון, בדרך כלל המבחנים של אסא מאוד טכניים וסטרייט פורוורד והפעם הוא הלך על קונספט יותר תיאורטי וקשה, אבל מבחני עבר של למשל אריק אקרמן יותר גרועים, ובסופו של דבר הממוצע לא היה כזה גרוע.\n\nבכל מקרה זה קורס חובה אז זה לא שיש לכם ברירה. אבל תקחו את כל הדברים שאנשים רשמו פה בפרופורציה. הקורס קשה, מעניין, ואפשרי בהחלט להוציא בו ציון סביר פלוס.", "timestamp": 1658385120859}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: אישית לא התחברתי בכלל להרצאות, היה המון פיתוחים שלקחו שעות על הלוח והיה מאוד קשה לעקוב. ממליץ מאוד על ספר הקורס\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: התרגולים מעולים, מאוד תכלסים ויש הרבה דברים מעניינים. יובל מתרגל ממש טוב\n\nשעורי הבית: ארוכים כמו הגלות ומייאשים לא פחות. הצבות שלוקחות שנים ופיתוחים שמרגישים כאילו לא ייגמרו לעולם. כל קשר שהיה בין הגיליונות לחשיבה פיזיקלית או אינטואיציה היה מקרי בהחלט ורוב הפעמים השאלות היו נטו מתמטיקה של מדח או הסתברות \n\nהמבחן: מזעזע. \n\nהשורה התחתונה: החומר פצצה, סופר מעניין ומאוד מאוד מגניב. עם זאת, הקורס מועבר בצורה לא טובה. אין קשר בין ההרצאות לתרגולים, ובכללי ההתנהלות הייתה לא טובה", "timestamp": 1658419435180}, {"author": "Arnold Cheskis", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: PDF\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: PDF\nחוות דעת - תרגולים: מעולות\n\nשעורי הבית: ארוכים בצורה מוגזמת! מיותר לחלוטין, בעיקר מי שעושה חשמל ומגיע עם רקע מאותות (ש.ב 2 פשוט תעשו רפרנס, לא שווה את הזמן...)\n\nהמבחן: קל, אבל המון המון המון חישובים.... מומלץ להיות עם הארכת זמן :)\n\nהשורה התחתונה: אולי הקורס הכי חשוב לפיזיקאים. ידע וקונספטים שמאד מפתחים את החשיבה", "timestamp": 1658946398242}, {"author": "מטריצייה", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: וינסנט\nחוות דעת - הרצאות: הסמסטר וינסנט העביר פעם ראשונה את הקורס, ותוך כדי הסמסטר הוא כתב רשימות באמת מעולות, אלא שהוא הרבה פעמים היה מפרסם אותן אחרי ההרצאה, או מעדכן אותן לקראת סוף הסמסטר בשביל להוסיף כל מיני הערות שהוא הרגיש שחשוב להוסיף אז זה יצר הרבה אי סדר. הרשימות כבר כתובות ולכן לסמסטרים הבאים(במידה ווינסנט ילמד) יהיה מאד נוח ללמוד את הקורס. בנוגע לוינסנט עצמו - הוא מאד חכם, והוא וכל הסגל היו סופר מתחשבים וקשובים לסטודנטים, אבל בהרצאות עצמן הוא קצת לא ברור או שהוא נוטה להתחיל הרצאות \"מהאמצע\" ורק אחרי שקוראים את ההקדמה הכתובה שמופיעה ברשימות שלו מבינים ויוצא כזה אההה. סה\"כ הכי טוב לעקוב אחריו ואחרי הרשימות שלו תוך כדי ותצאו עם הבנה מעולה.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: לתרגולים יש רשימות מעולות ששוכללו במשך השנים עד כדי כך שאפשר ממש להשלים את התרגול רק מלקרוא אותן אם מפספסים(למרות שכן כדאי לבוא לתרגולים בשביל האינטואיציה). יובל אחלה מתרגל ומביא גם דרכים קצת שונות ממה שמופיע ברשימות ומעביר גם הרבה טריקים וטיפים לחומר.\n\nשעורי הבית: הגיליונות הראשונים ארוכים בטירוף והם חזרה על אלגברה אז קצת מבאס. האחרונים גם לא הכי קצרים אבל סבילים. באמצע יש שני גיליונות באמצע שכוללים שאלה של לכתוב קוד(פייתון/מאטלב וכו') שהיא ממש ממש לא נעימה.\n\nהמבחן: לדעתי היה הוגן חוץ מסעיף אחד אלגברי שהתקיל הרבה. באמצע המבחן הם גם נלחצו שהוא ארוך מדי והוסיפו עשרים דקות ככה שהסגל באמת טוב לבב.\n\nהשורה התחתונה: אמנם הקורס נקרא קוונטית 1 אבל זה קורס באלגברה - הגיליונות, התרגולים, המבחן - בכולם יש אלמנט הבנתי על קוונטים ואז אלגברה עד הסוף. מבין הקורסים של סמסטר 4 הוא נחשב הכי קל ואפשר לקבל בו ציון טוב פלוס עם פחות השקעה משאר הקורסים של 5 נק\"ז.", "timestamp": 1689944844928}, {"author": "אקוסטו", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: וינסנט \nחוות דעת - הרצאות: זה פעם ראשונה שהוא מעביר את הקורס , זה ניכר, אבל הוא נראה אחלה בן אדם ונראה שיש לו כוונות טובות \nאני עדין למדתי לרוב עם הרשימות שלו ושל אסא \n\nשם המתרגל/ת: יובל \nחוות דעת - תרגולים: אחלה מאוד פרקטי , מלמד את התכלס אבל כן הייתי ממליץ את נדב יותר , פשוט כי הוא מעמיק יותר \n\nשעורי הבית: חוץ מגליון 8 שקרע אותי גליונות יחסית סבבה במיוחד האחרונים ,כן צריך להשקיע \n\nהמבחן: מבאס , 2 מתוך 3 שאלות הייתי יכול לא ללמוד קוונטית בסמסטר \nשאלה אחת חדווא ..סתם לגזור דברים מגעילים \nשאלה אחת קשה שקשורה לחומר(יש לומר אבל בלי הרבה חישובים )\nשאלה שלישית -אלגברה ב׳ (מי שלקח כיף לו,מי שלא,חבל!) \nהשורה התחתונה: קורס ממש מעניין ,אפילו שזה רק מבוא \nאיכזב אותי המבחן, ווינסט היה נראה מרצה שבאמת חשוב לו שנבין את עיקר וציפיתי ליותר שאלות על החומר הנלמד ,חוץ מזה אני כן מבסוט על הקורס", "timestamp": 1690134386366}, {"author": "שרודינגר", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: וינסנט\nחוות דעת - הרצאות: שנוי מאוד במחלוקת, אני אוהב אותו בסך הכל. קיים קושי בשפה, הוא רושם באנגלית על הלוח ולא תמיד הוא מכיר את כל המונחים בעברית, אבל, לעומת מרצים אחרים לפיזיקה הוא בעיניי מצליח להגיע לפואנטה.\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: תודה לפקולטה לפיזיקה שייצרה מתרגל כזה, וחבל שאין כמוהו יותר. אין עליו בעולם.\n\nשעורי הבית: המון חישובים, פשוט קופי פייסט של השנים הקודמות. מה גם שלא שינו את התאריכים על הגיליונות. \n\nהמבחן: פייר. לא חישובי בטירוף כמו אסא, אבל סביר. שאלה של תורת ההפרעות שממש הצהירו בפנינו 'תהיה אחת כזו במבחן' ועוד שתי שאלות עם טיפה אלגברה.\n\nהשורה התחתונה: קורס שבנוי דיי מוזר בסך הכל. כל התרגולים הראשונים מתעסקים בפונקציות דלתא ובהתמרות פורייה שפשוט לא ראינו במהלך הקורס, שיעורי בית שבונים לך בסיס מתמטי לכלום, ובמקביל בהרצאה מדברים על ניסויים שעשו שעזרו להבין למה צריך מכניקה קוונטית.\nבגדול רק משבוע 6 (אחרי שמסיימים את ההנחות של מכניקה קוונטית) הקורס מתחיל להתגלגל ולהיות מעניין.", "timestamp": 1690898055653}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: וינסנט דז'אק\nחוות דעת - הרצאות: זו פעם ראשונה שוינסנט מעביר את הקורס, היו לו רשימות שהוא הכין לאורך הקורס ועל פניו הן טובות, פשוט הסמסטר הן לא היו מעודכנות לגמרי לפני כל הרצאה ווינסנט עדכן אותן באופן די תדיר, מאמין שסמסטר הבא שהוא יעביר עם רשימות מלאות זה יותר יעיל. מעבר לכך וינסנט כן מעוניין שהסטודנטים יבינו ומסביר כל שאלה שעולה, אבל כן לפעמים מרגיש שהוא מדלג על איזושהי הנחת יסוד / מסקנת ביניים שאם היה מבהיר אותה ההסבר הכולל היה יותר ברור.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: מתרגל מצוין, מעביר היטב את החומר וגם את הנקודות היותר חשובות שצריך לקחת מכל תרגול. כן הרבה פעמים לא הספיק את התרגול כולו אבל זה נראה לי יותר בגלל שהם ארוכים יחסית.\n\nשעורי הבית: גיליון כל שבוע, חלקם די ארוכים אבל ברובם ממוחזרים. כמו כן היו שני גיליונות עם שאלות קוד שלוקחות יותר זמן.\n\nהמבחן: אגע בזה יותר בשורה התחתונה, אבל יחסית לקורס פיזיקה יש \"מעט מאוד פיזיקה\", וזה גם בהתאם מה שיש במבחן. שאלה אחת שיש בה יותר שיקולים פיזיקליים, ושתיים נוספות שהן בגדול היו 90% מתמטיקה שאמנם תרגלנו בפיזיקה, אבל עם מעט שיקולים פיזיקליים.\n\nהשורה התחתונה: קורס שברובו הרגיש שהמטרה שלו זה להקנות את הכלים של פיזיקה קוונטית - כתיב דיראק, לחשוב במונחים של מצבים עצמיים, האינטגרלים הספציפיים שצריך כדי לפתור בעיות מהסוג הנ\"ל וכו. לצד כל זה, נוגעים בכל מיני דוגמאות פיזיקליות שאת חלקן גם פותרים, אבל זה פשוט מרגיש פחות הדגש של הקורס, ולכן שונה מקורסים פיזיקליים אחרים שעוברים עד כה.", "timestamp": 1691124144325}, {"author": "Tamir Manoach", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דז'אק וינסנט\nחוות דעת - הרצאות: כוונות טובות, הוא מלמד הרבה מהספר של סאקוראית מרצה טוב.\n\nשם המתרגל/ת: יובל ניצב\nחוות דעת - תרגולים: הכי טוב בארץ, אם הוא לא בארץ... תסתדרו\n\nשעורי הבית: כל שבוע, הרבה ממוחזר, והרוב באצם אלגברה לינארית. עמוס, אבל לא יותר מידי\n\nהמבחן: המבחנים הוגנים, דפי נוסחאות תוצרת בית...\n\nהשורה התחתונה: רוב הקורס זה הבנה, ואלגברה לינארית עם מכפלה פנימית.", "timestamp": 1691500470329}, {"author": "שרדינגר", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: וינסנט\nחוות דעת - הרצאות: יש ספרים טובים והוא הולך לפיהם\n\nשם המתרגל/ת: נדב\nחוות דעת - תרגולים: עושים סדר\n\nשעורי הבית: מייגעים\n\nהמבחן: קל אם טובים במתמטיקה (חישובים)\n\nהשורה התחתונה: תדעו טוב אלגברה וקצת פורייה ויהיה טוב. זה קורס טכני שלומדים בו שפה חדשה, אולי זה חשוב אבל לא מרגש", "timestamp": 1694872309714}, {"author": "שטרן גרלך", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: וינס \nחוות דעת - הרצאות: \nהרשימות שלו מעולות. בהרצאות פחות עקבתי כי הוא היה לי מפוזר טיפה יותר מדי והוא קרא למטריצה מטריצייה שזה שאב את כל הריכוז שלי אבל וואלה נהנתי סך הכל.\n\nשם המתרגל/ת: נדב\nחוות דעת - תרגולים: \nהמתרגל הכי טוב בפקולטה אולי. מסביר ממש טוב את התרגולים וגם מוכן לעזור כמה שצריך על חשבון הזמן הפנוי שלו - פשוט מלך!\n\nשעורי הבית: \nבסך הכל בסדר, לפעמים יותר מדי אלגברה מעצבנת שלא באמת קשורה ולפעמים יש גם תרגילי תכנות מוגזמים - ברמה שכולם כמעט פשוט העתיקו את הגרפים מהרפרנס בדרייב כי חלאס. הגיליונות כן עוברים על החומר אבל ועוזרים לתרגל אותו כי בסוף זה קורס די טכני.\n\nהמבחן: \nמועד א היה ממש קל. מועד ב היה מוגזם בצורה מוגזמת אפילו אם לא מתחשבים בזה שהוא התקיים חצי שנה אחרי סוף סמסטר ובאמצע מלחמה. ציפיתי לראות יותר התחשבות מצד הסגל כי הוא היה ממש אחלה עד אותה נקודה אבל בסדר לא הולכים עם ציון למכולת, במיוחד כשיש עובר בינארי\n\nהשורה התחתונה: \nתכלס רק קורס מבוא לכל התחום של קוונטית. חד משמעית הקורס היותר קל מהשילוש הקודש ואין סיבה לא להוציא בו ציון טוב שייתן ביטחון לקוונטית 2", "timestamp": 1704650874109}]}