{"posts": [{"author": "1", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: מגניבות ממש. ממש פותחות את הראש. באופן כללי יואב מלמד טוב אבל רואים שיש לו חדווה לנושא הזה, במיוחד בהקשר הניסיוני, אבל גם התאורטי. היה כיף\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: 3 גיליונות ארוכים לא מאוד. קשורים לחומר ולהרצאות, הוא לא ממציא שם דברים מוזרים אבל כן צריך לעבוד קשה בשביל לפתור ולרוב זה לא טכני\n\nהמבחן: מבחן בית על תיקון שגיאות, נושא שלא למדנו בקורס בכלל. על הנייר נשמע קטע מסריח אבל דווקא יש בזה משהו מגניב כי הקורס עצמו בנפח מאוד קטן וזו אחלה הזדמנות ללמוד משהו חדש. חשוב לציין שהשאלות היו מאוד אלמנטריות ככה שרוב הקושי היה פשוט להבין מה זה זיהוי שגיאה ואיך מתקנים אותה. ברגע שהבנת את הקונספט ברמה הכי נמוכה שיש השאלות כבר ממש מתנה כמעט. \n\nהשורה התחתונה: יש אופציה להצליח אבל צריך לעבוד קצת. מי שממש into it אני ממליץ בחום ומי שפחות אז עדיף לא לקחת", "timestamp": 1677243651599}, {"author": "ניל לפלמה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: \nהרצאות מעניינות, יואב מרצה כריזמטי שיודע להעביר את החומר בעניין. \n\nשם המתרגל/ת: אין\n\nשעורי הבית: \n3 תרגילים שפתוחים להרבה זמן. עוזרים להבין את החומר. בהחלט דורשים השקעה ותחת.\n\nהמבחן: \nמבחן בית הוגן, בנוי טוב ואפילו מלמד. יש לציין שהוא לא קל ובהחלט דורש השקעה וזמן.\n\nהערה אישית:\nבשבילי זה היה הקורס הראשון שלקחתי בתחום (בשנה שלישית במקביל לקוונטית 2 ולפני אינפו) הגעתי אליו עם הרבה חששות ובסופו של דבר אני שמח מאוד שבחרתי לקחתי אותו.\nהרבה פעמים הרגשתי שהקורס הזה גדול עלי, ואז כשהייתי צריך להתמודד עם השיעורי בית בעצמי, לאחר מאבקים רבים הגיעה הבנה והחומר נהיה יותר ברור.\n\nהשורה התחתונה: \n עשה לי חשק לעשות עוד קורסים בתחום. \n+ הערה לשיפור, אם היו רשימות מוקלדות לעקוב אחריהן הקורס היה מקבל מומלץ מאוד.", "timestamp": 1677930668427}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יואב שגיא\nחוות דעת - הרצאות: הרצאות מעניינות עם המון פרטים, חלק מהחומרים מתקדמים (ולפחות לי) היה קשה לעקוב אחרי הכל בהרצאות. מה שכן לומדים הרבה נושאים שונים אז אם לא לגמרי מבינים נושא אחד זה לא קריטי לשאר הנושאים.\n\nשם המתרגל/ת:  \nחוות דעת - תרגולים:  אין תרגולים\n\nשעורי הבית:  היו 3 תרגילי בית שהיו 50% מהציון ולדעתי ברמה מאוד סבירה (אחרי ההרצאות חששתי שהשיעורים יהיו מאוד קשים אבל הם היו ממש אחלה)\n\nהמבחן:  לא היה מבחן אלא עבודה מסכמת. העבודה היוותה 50% מהציון והייתה מאוד דומה לשאר תרגילי הבית רק יותר ארוכה וברמה מאוד סבירה (העבודה גם הייתה מאוד מעניינת ומלמדת). היא הייתה במהלך תקופת במחנים שזה היה די מבאס אבל חוץ מזה היה אחלה.\n\nהשורה התחתונה:  קורס מעניין וניתן להוציא ציון גבוה בלי המון מאמץ אבל לא קורס קל.", "timestamp": 1678808105236}, {"author": "קוראים לי קובי, קובי קובי", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "קודם כל לפני הביקורת, כתוב בUG שקוונטית 2 זה קדם אבל יואב אישר בסמסטר שלנו לקחת את הקורס עם קוונטית 2 כצמוד, אז שווה לברר איתו אם אתם רוצים ואין לכן קוונטית 2. \n\nשם המרצה: \nיואב שגיא\nחוות דעת - הרצאות: \nלמרות שזה לא כתוב בUG, הקורס הועבר באנגלית, ליואב יש אנגלית טובה וזה לא הפריע לשטף של ההרצאה בכלל אבל מי שמפריע לו קורס באנגלית שווה לקחת בחשבון.\nההרצאות טובות מאוד לדעתי. בהרצאות לרוב יואב יפתח משהו תיאורטי במשך שעה ומשהו. אחרי זה הוא יראה מאמר עדכני שמימש את מה שהוא פיתח על הלוח במערכת פיזית, והוא ידון איתנו בניסוי, איך הוא נעשה ובתוצאות. \nחשוב להגיד שזה לא קורס שמדבר רק על מחשוב קוונטי, יואב העביר מגוון רחב של תחומים כמו אינפורמציה קוונטית Quantum sensing ובערך חצי סמסטר דיבר על ה5 טכנולגיות המובילות למימוש של מחשב קוונטי. היו גם 2 הרצאות אורח שבהם מומחים לטכנולוגיה ספציפית באו לדבר איתנו עליה.\n\nשעורי הבית: \nהיו 3 גליונות במהלך הסמסטר שהיו שווים 50% מהציון. הגליונות היו ממש סבבה, הם כן לקחו זמן אבל לא משהו שהרגיש מוגזם במיוחד. השיעורי בית לא היו משהו מההרצאה אלא רוב השאלות היו לפתח משהו חדש שלמדנו את הכלים לפתח אותו בהרצאות. הגליונות היו מאוד מודרכים והיה אפשר לגמרי להצליח אותם. בכל חוסר בהירות יואב שמח לעזור. באופן כללי זה הייתה דרך די מגניבה ללמוד אינטראקטיבית עוד נושאים שקשורים לטכנולוגיה קוונטית.\n\nהמבחן: \nעבודת בית שהייתה שווה 50% יואב פתח אותה לבערך שלושה שבועות בתקופת המבחנים. העבודה הייתה דומה מאוד לגליונות, הייתה טיפה יותר ארוכה מגליון שקיבלנו במהלך הסמסטר. גם במבחן היינו צריכים לפתח משהו שלמדנו את הכלים עליו (שלדעתי היה מעניין רצח גם). המבחן היה מאוד מודרך והבדיקה הייתה אחלה רצח.\n\nהשורה התחתונה: \nהנושא הזה של טכנולגיות קוונטיות הוא משהו מאוד נישתי ועוד מאוד בתיחולים, זה לא שמי שעשה את הקורס הזה יוכל לעבוד בנושא. אני אישית לקחתי את הקורס בלי שאני חושב ללכת אליו. הקורס היה ברמה גבוה מאוד והרגיש לי שיואב עשה איזון טוב בין ללמד טוב, לבין עומס במהלך המסמטר וגם פרגן מאוד בציונים (ההיסטוגרמה מדברת בשם עצמה). \nזה קורס שעובר לגמרי שונה מכל קורס של תואר ראשון, הכיתה אינטימית מאוד ויואב ממש פותח מאמרים עדכניים שקראנו בכיתה ודנו בהם, זה משהו שלא היה לי אף קורס אחר וזה ממש שינוי מרענן.\nלא הייתי לוקח את הקורס אם לא נראה שהתחום מעניין אותכם כי הוא כן דורש השקעה, אבל מי שחושב שאולי זה כן מעניין אותו זה קורס פצצה לקחת לדעתי.", "timestamp": 1679341579503}, {"author": "???", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "הקורס כבד מתמטית אבל בלי תרגול וזה אומר שאם אתה לא חם על החומר של קוואנטית אתה יכול לאבד את עצמך דיי מהר. אני חושב שהקורס הזה אופטימלי כצמוד לקוואנטית 2. אם הייתי עושה את זה ככה אני בטוח שהייתי נהנה ממנו יותר. חוץ מזה במהלך הסמסטר 3 הגשות חצי חופרות וגיליון במקום מבחן בתקופת המבחנים שהיה ממש סבבה.", "timestamp": 1716894889255}]}