{"posts": [{"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ארי לאור\nחוות דעת - הרצאות:  החומר מעניין אבל המרצה קצת מפוזר ולפעמים ההרצאות מרגישות קצת משעממות ומיותרות אך רוב החומר של הקורס נמצא בשני ספרים שמציגים אותו בצורה מעולה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  אין תרגולים\n\nשעורי הבית:  הציון של הקורס מורכב מציון של 7 תרגילי בית. בתרגילי הבית כותבים קוד בכל שפה שרוצים (הוא לא בודק את הקוד רק דוח שמגישים עם התוצאות). בתרגילים מתבקשים לפתור בעיות פיזיקליות בעזרת הכלים הנומריים שלמדנו בשיעור.\nהקושי והעומס של תרגילי הבית תלויים באדם שפותר אותם, הקוד הסופי עצמו באף תרגיל לא היה ארוך אבל עד שמבינים בדיוק מה לעשות ובנוסף לדבג התרגילים, הם יכולים להיות עמוסים או זורמים תלוי כמה מהר מבינים את העיקרון.\n\nהמבחן:  אין\n\nהשורה התחתונה: אם מעניין אותכם פתרון בעיות בצורה נומרית ואתם לא מפחדים מתכנות זה אחלה קורס", "timestamp": 1678808848834}, {"author": "אלי קופטר", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ארי לאור\nחוות דעת - הרצאות:  \nאז מאיפה להתחיל? זה לא משנה אם ארי או מישהו אחר היה מעביר את הקורס, אין יותר מידי פואנטה להרצאות. לא לומדים דברים בתיאוריה מסויימת או היגיון מסויים זה פשוט שיטות שאפשר ללמוד אותן לבד בבית מול הודים ביוטיוב. אז מי שרוצה יכול לבוא להרצאות כי ארי מצחיק ומי שרציני שלא יבוא פשוט. \nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nכאן לב הבעיה, עבור קורס של 2 נקז יש כל שבועיים גליון וזה לוקח כל כך הרבה זמן, זה לא כל כך מספק שלא תחשבו שאתם עושים את זה ואומרים \"אה וואו זה לימד אותי משהו זה מכניס הרבה שכל\". לא אתם פשוט תראו אליפסה על המסך ותגידו טוב קול. התגובה של ארי להגשות של הגליונות היא לא פרופורציונלית באף מידה. אתם יכולים לעבוד על זה ולהשקיע בצורה מטורפת והוא ידפוק לכם 70. וזה משנה כי הציון של כל הקורס נשען על זה.\n\nהמבחן: אין ואולי אם היה היה אשכרה עדיף כבר\n\nהשורה התחתונה: אני הולך להעיף את הקורס הזה מתואר ראשון ולפחות שיחשב לי בשני. כל כך לא שווה את המאמץ שלו ואם היו אומרים לי את זה קודם הייתי יכול להשקיע יותר בסמסטר בדברים אחרים ולחסוך עצבים ושעות של עבודה על הגליונות שמביאים תמורה של 0.5 נקודות לממוצע או פחות מזה אם ארי קוטל אותכם.", "timestamp": 1717068855977}]}