{"posts": [{"author": "Guy Yoffe", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: נתנאל לינדר\nחוות דעת - הרצאות: עדיף לקרוא מהספר. מסביר פי אלף יותר טוב מהמרצה הזה, שבצורה עדינה לא מאוד נחמד.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים כתובים מעולה ועדיף ללמוד מהם לבד.\n\nשעורי הבית: מרופרנסים ויחסית סבבה אפילו בלי רפרנס.\n\nהמבחן: קשה מאוד, אבל קולטים את זה אחרי כמה מבחנים שמתרגלים.\n\nהשורה התחתונה: קורס מעניין מאוד.", "timestamp": 1597782139312}, {"author": "Arex 36", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: מסודר אבל קצת משעמם\n\nשם המתרגל/ת: רוני גופמן\nחוות דעת - תרגולים: כפרה עליה\n\nשעורי הבית: לא קשים במיוחד טיפה חופרים\n\nהמבחן: הוגן", "timestamp": 1612349203798}, {"author": "R", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: ההרצאות היו מבולגנות מדי בעיניי, היה קשה לעכוב\n\nשם המתרגל/ת: רוני גופמן\nחוות דעת - תרגולים: רוני מסודרת ומתרגלת מעולה\n\nשעורי הבית: גיליונות שבועיים, 15% תקף, צריך להגיש 10 מתוך 12. מאוד דומים למה שנעשה בתרגולים, אך לפעמים היו מתישים ועמוסים.\n\nהמבחן: \n\nהשורה התחתונה: קורס ממש מעניין אבל מאוד מאוד עמוס וצריך להשקיע!", "timestamp": 1612432248342}, {"author": "S", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: קצת קשה לעקוב אחריו, לפעמים נכנסים לפרטים הקטנים ככה שהתמונה הגדולה (והרבה פעמים דווקא היא זו שמעניינת) מתפספסת. בסך הכל הוא מאוד רוצה שנבין ונתעניין אבל במבחן התוצאה מאוד קשה \"להתקדם\" בהבנה של הקורס דרך ההרצאות\n\nשם המתרגל/ת:  אביאור אלמועלם\nחוות דעת - תרגולים: הוא מבין את החומר מעולה, אבל מעביר אותו בצורה מאוד מאוד טכנית, בעיקר פותרים את התרגיל ולא דנים במשמעויות אלא אם מישהו שואל (בין היתר כתוצאה מכך שיש רק שעת תרגול אחת). בסך הכל בסדר ואולי לא באשמתו שלא יותר מזה.\n\nשעורי הבית: קצת חופרים, ניתן להגיש בשלשות וזוגות אצל עמית וזה מקל על העומס כשיש כזה, מומלץ מאוד כן לפתור את השיעורים, כי הם ממש דומים ברמתם למבחן וגם לתרגולים. \n\nהמבחן: מועד א' לא היה קשה בכלל, אבל היה ארוך כאורך הגלות, המון סטודנטים לא הספיקו לסיים ובעיקר הזמן היה המכשול הרציני מלקבל ציון גבוה מ-85 במועד הזה (עשה רושם שאצל כל מרצה צריך לבוא מוכנים ל\"ספרינט\" לאורך כל המבחן)\n\nהשורה התחתונה: קורס ממש מעניין, שעובר מסיבות כאלו ואחרות בצורה לא מעניינת. רק לקראת המבחן אפשר באמת לראות את היופי שבקורס לדעתי.", "timestamp": 1613145561884}, {"author": "חוות דעת", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: ארוכות, לרוב לא ברורות אבל כן מעניינות לפעמים\n\nשם המתרגל/ת: רוני גופמן\nחוות דעת - תרגולים: קצרים מדי ועמוסים מאוד, מסבירים יחסית ברור את החומר ומתאימים לשיעורי הבית.\n\nשעורי הבית: ארוכים ולרוב בלי סיבה, מתאימים לחומר בתרגולים ולא להרצאות כל כך.\n\nהמבחן: בדיקה קשוחה וממש לא בצדק! \n\nהשורה התחתונה: קורס יחסית בסדר אבל לא מומלץ במיוחד.", "timestamp": 1616233656280}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: ההרצאות היו קשות, וברוב ההרצאות פשוט לא הבנתי שום דבר בגלל הדרך שבה עמית מלמד - קופץ מנושא לנושא, מתבלבל כל הזמן בפיתוחים המתמטיים...\nמצד שני הוא כתב רשימות לקורס שהיו מאד ברורות ומקיפות, ורוב הלמידה נעשתה מהרשימות וזה אכן סגר את הפינה.\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: מתרגל ממש טוב, ניכר שהוא מבין את החומר מעולה וידע לענות על כל שאלה ששאלו אותו. הסביר בצורה ברורה ועניינית. התרגולים עצמם הם מאד עמוסים ויש רק שעה אחת לתרגול ולכן לפעמים הוא היה בלחץ להספיק (ואפילו לא סיימנו את כל התרגול ברוב המקרים), אבל כן היה לו חשוב לתת דגשים קטנים בהם נופלים וכל מיני דקויות שהולכות לאיבוד כשעוברים מהר על החומר.\n\nשעורי הבית: גליון שבועי, ארוכים מאד ומעמיסים.\n\nהמבחן: המבחן היה ארוך ממש ורוב הסטודנטים לא סיימו אותו. שאלה אחת הייתה עמוסה מאד, עם מלא סעיפים, ולא ברורה בכלל תחת לחץ של זמן. ניתן פקטור ממש גדול לבחינה בשביל לתקן את הממוצע\n\nהשורה התחתונה: הקורס עצמו והחומר שלומדים בו מעניין ממש ורק בלמידה למבחן הבחנתי בכמה החומר יפה ומעניין. היה לי קשה מאד להתחבר לזה במהלך הסמסטר בגלל הדגשים השונים של המרצה. הקורס עמוס מאד ביחס לקורסי בחירה 3.5 נקז אחרים וצריך להשקיע יחסית הרבה כדי לעבור אותו בהצלחה ולהרגיש שהפקת משהו מהלמידה", "timestamp": 1644656207586}, {"author": "Quasi-boi", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: בסדר\n\nשם המתרגל/ת: רוני\nחוות דעת - תרגולים: לא יכול להעיד\n\nשעורי הבית: לפעמים היו תרגילים רטובים שלא ברור מה הם באו ללמד\n\nהמבחן: עמוס מאוד\n\nהשורה התחתונה: לא לקחת", "timestamp": 1645541766176}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: לא מאוד מעניינות או ברורות, אבל יש רשימות הרצאה נהדרות שהוא כתב ונמצאות במודל. גם צריך לדבר על הפיל שבחדר והוא הגישה שלו לסטודנטים, שמנסה להיות מצחיקה וטיפה מעליבה בו זמנית. יש אנשים שאוהבים את זה ויש כאלה שממש לא ממש לא. בכמה מהמקרים לדעתי הוא חצה את הקו והיה פוגעני או טיפה קריפי, גם אם ברור שהכוונה שלו טובה\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: בשורה התחתונה, לא היה מספיק זמן אליהם ולמרות שהוא ניסה ממש הוא לא הצליח להספיק את כולם בשעה האחת המסכנה שהוקצתה לו. הם כן היו רלוונטיים לחומר והבנה של התרגולים נותנת הבנה של מה שצריך לדעת למבחן\n\nשעורי הבית: ארוכים ומייגעים, אבל אפשר היה להגיש בזוגות\n\nהמבחן: לא קשה, אם היה מוקצה לו יותר זמן. הוא פשוט היה ארוך מדי, ורוב הסטודנטים לא הספיקו לסיים\n\nהשורה התחתונה: קורס עם פונטציאל טוב שמועבר בצורה לא אידאלית", "timestamp": 1646000443015}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עמית קרן\nחוות דעת - הרצאות: מרצה בסדר, לא מאוד מסודר בהרצאות אבל הסיכומים שלו מאוד ברורים ושווה מאוד לעבור עליהם\n\nשם המתרגל/ת: רוני\nחוות דעת - תרגולים: לא מומלץ, עייפה מאוד ובלי הרבה חשק ללמד, מורגש שזה כלכך אכפתית לסטודנטים גם בתרגולים וגם בתור מתרגלת אחראית \n\nשעורי הבית: מאוד עמוסים ומאוד לא מתגמל. בערך 5 שעות עבודה שבועייות בשביל 10 אחוז מגן זה בדיחה ורוני לא הייתה מוכנה לגעת בזה.\n\nהמבחן: היה כתוב מזעזע, ולא פתיר בזמן סביר בחיים. עוד דוגמא לחוסר אכפתיות של הסגל\n\nהשורה התחתונה: קורס מאוד מעניין, הסגל הרס את החוויה", "timestamp": 1646554048587}, {"author": "דורון בכר", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עמית קרן \nחוות דעת - הרצאות: \n\nיש אווירה של צחוקים וכיף בכיתה אבל יש חוסר דיוקים שכנראה גם חוזרים על עצמם כל שנה, כי הוא לא מתקן את הקובץ הרצאות שלו\n\nשם המתרגל/ת: נדב אוריון\nחוות דעת - תרגולים: \n\nעל הכיפאק, אבל יש מצב שרוני גופמן שכבר מעבירה כמה שנים תרגולים יותר טובה.\n\nשעורי הבית: סבבה סהכ, הייתה פעם אחת או שתיים שהיה גיליון ארוך וקשה במיוחד אבל סהכ חשוב לעשות אותם כדי לתרגל את כל המושגים החדשים שלומדים\n\nהמבחן: \nטכני ומשעמם אבל קשה - לא היה זמן לפתור את הכל והיה בסוף פקטור שורש.", "timestamp": 1647677638976}, {"author": "בולצמן", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אסא\nחוות דעת - הרצאות ותרגולים: לא הייתי. יש אחלה דרכים ללמוד הכול באינטרנט \nשעורי הבית: טכניים מייגעים ארוכים ומעצבנים. לרוב גם לא לומדים מהם שום דבר. 7 גיליונות\n\nהמבחן: ארוך אבל ממש קל. הממוצע \"נמוך\" כי הם בדקו בדיקה קשה, בבדיקה רגילה בפיזיקה היה ממוצע 90\n\nהשורה התחתונה: קורס מטורף. מאוד בסיסי. מוזר שהוא בחירה. היה אחלה סגל אבל השיעורי בית די ממוחזרים אז בסוף הקורס כל מה שיודעים לעשות כמעט זה חישובים, וזה צובע בצבע קצת מסריח את החווייה הכללית מהקורס. בכל מקרה יוצא הרבה פעמים לגלות דברים מגניבים על הולכה, התמרות פורייה, מכניקה סטטיסטית ואפילו דברים שנראה נאיבית שהם לא קשורים כל כך למצב מוצק. בקיצור מומלץ בחום בעיקר למי שטוב בללמוד לבד ומתעניין בדברים שלא מדברים עליהם בכיתה, אבל מי שלוקח שיידע שזה חתיכת תיק", "timestamp": 1675687575152}, {"author": "צ'אדמית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nאסא אוירבך\nחוות דעת - הרצאות: \nההרצאות של אסא היו מבולגנות מאוד, ממש הורגש שזה הפעם הראשונה שהוא מעביר את הקורס. מאמין שסמסטר הבא הוא יעביר יותר מסודר את החומר, הוא גם כתב רשימות תוך כדי הסמסטר. יש המון מקורות חיצוניים לקורס והקלטות נגישות של אורי סיוון בפנופטו, כשלא הבנתי או רציתי חזרה הלכתי והשלמתי.\n\nשם המתרגל/ת: \nאיתי דוידוביץ\nחוות דעת - תרגולים: \nאיתי מתרגל טוב. התחיל תמיד בחזרה על החומר התיאורטי ואחר כך פתר תרגילים והדגיש איך לגשת לשאלות בקורס. למרות זאת, שעה תרגול לא ממש מרגיש מספיק בקורס כזה קשה. יש סדנה שאולי עזרה קצת בקטע הזה אבל אני לא יודע כי לא הייתי.\n\nשעורי הבית: \nהשיעורים היו 7 גליונות ששווים 10% מגן, היה גם 10% מגן על שאלת שיעורי בית במבחן. הגליונות היו ארוכים ומציקים ברמות. היה בהם מלא אלגברה מעצבנת והרגיש שהם לא לימדו טוב את החומר וההבנה שלו אלא רק היו לעשות חישובים מעצבנים.\n\nהמבחן: \nהמבחן היה ארוך מאוד אבל השאלות היו סטנדרטיות מאוד. אני חושב שמי שתרגל הרבה מבחנים הצליח. אסא גם העמיד ממוצע טוב מאוד.\n\nהשורה התחתונה: \nקורס בנושא מעניין בטירוף, לומדים דברים שנראים בסיסיים לכאורה. כמו למשל למה מתכות מוליכות ויש חומרים שלא מוליכים, עם מוטיבציה של מכניקה קוונטית וזה מטורף כמה זה עמוק וכל כך מסובך יותר ממה שנראה מכל קורס קודם. \nהחומר של הקורס הוא מאוד קשה וקונספטואלי. זה אחד הקורסים עם החומר הכי עמוק בתואר לדעתי. הקורס ממש מרגיש כמו קורס שהיה יכול להיות קורס חובה בפקולטה.\nהקורס הוא גם קדם לחלק גדול מהתחומים בפיסיקה בפועל ואסא העמיד ממוצע טוב. \nלדעתי זה קורס בחירה שמאוד כדי לקחת.", "timestamp": 1679313774398}, {"author": "סוס מוטרד", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות: אסא באמת נחמד והכל, אבל לא ניחן בכושר הרצאה בלשון המעטה. אמנם במהלך הסמסטר פרסם רשימות שלו אבל גם הן היו חצי מובנות במקרה הטוב, וההרצאות עצמן בכלל היו די מפוזרות, בלי הרבה הקשרים בין משפט למשנהו. רוב מוחלט של הסטודנטים בקורס למד את הקורס דרך ספרי הקורס, והיה קהל מאוד מועט בהרצאות של אסא. אישית למרות שהלכתי להרצאות, הלימוד המועיל היחידי שלמדתי היה לפני המבחן עם מבחני עבר.\n\nשם המתרגל/ת: רז פירנקו הגיבור\nחוות דעת - תרגולים: לא היה חלק גדול מהסמסטר בגלל מילואים, אבל כשהיה הוא תרגל טוב, עזר אם דברים לא היו מובנים והסביר את החומר טוב בסך הכל.\n\nשעורי הבית: כאמור, אין ממש למידה יעילה של הקורס במהלך הסמסטר, אז כל גליון הוא זוועה חדשה שאתה צריך להתמודד איתה כשאין לך מושג מימינך ומשמאלך. ארוכים ולפעמים מרגישים כמו חישובים מטמטמים אבל לפחות שווים 20% שזה גם משהו. מה שכן הפתרונות הרשמיים שמעלים הם יחסית מובנים, וגם עוזרים ללמוד (ביחס להרצאות ולתרגולים)\n\nהמבחן: שנה שעברה היה ממוצע גבוה וכנראה אסא החליט שזה לא מתאים לו. נתן שאלת הבנה לא ברורה שהפילה לא מעט אנשים, ועוד שאלות הרבה יותר מהותיות והבנתיות בקורס שבגלל האופי שלו הלמידה בו היא יותר טכנית.\n\nהשורה התחתונה: קורס בנושא מעניין שחבל שזאת הצורה שעובר", "timestamp": 1713099143853}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אסא אוירבך\nחוות דעת - הרצאות:\nאסא מנסה להעביר את החומר בצורה שהוא חושב שמובנת וניכר שהוא כן מעוניין שהסטודנטים יבינו, אבל בעיקר בדרך שלו. בפועל יוצא שלפחות במתכונת הנוכחית קשה מאוד לעקוב אחרי מה שאסא מעביר בכיתה. הוא הסתמך לפרקים על ספרים שונים שאפשר לעקוב אחריהם אבל בפועל השנה לפחות הוא עשה שילוב בין 3 שונים שזה מעט הקשה - למרות שבפועל החומר שמופיע במבחן יחסית זהה בין כולם. גם הרשימות שיש של אסא לא מובנות במיוחד. אסא הקליט את כל ההרצאות והעלה למודל שזה מוערך.\n\nשם המתרגל/ת: רז / נעם\nחוות דעת - תרגולים:  יצא שמאילוצי לוזים חילקתי את התרגולים ביניהם. תכלס שניהם טובים מאוד, יודעים היטב את החומר ומנסים לדחוס כמה שאפשר לשעת תרגול אבל למול ה-3 שעות שבהן יש את אסא שאלוהים יודע מה הולך שם זה לא מספיק. הוסיפו שעה וקצת של סדנה ברוב השבועות שזה עוזר.\n\nשעורי הבית: 6 גליונות ארוכים מאוד, לפחות השנה ברובם לא היו מרופרנסים כי חידשו את השאלות. בתכלס זה הדבר שהכי למדתי ממנו בקורס, אבל אני לפחות הרגשתי שקשה מאוד לעשות אותם על בסיס הידע שמקבלים מהתרגולים וההרצאות והיה צורך בהרבה שאלות למתרגלים ושעות קבלה. בסוף כן סייעו ללמוד למבחן אבל אחרי שבירת ראש שמרגיש שפעם ראשונה שאתה באמת לומד את החומר זה בשיעורי בית.\n\nהמבחן: קשוח יותר מהמבחן של שנה קודמת של אסא, אפשר לראות גם שהממוצע ירד, אבל בסופו של דבר כן יחסית הוגן - שאלות שדומות למדי למה שעשינו בשיעורי בית חוץ מ-15-20 נק' שהיו שונות / דרשו הבנה יותר מעמיקה של החומר.\n\nהשורה התחתונה: קורס עם חומר סופר מעניין, אבל לצערי מפוספס בגלל ההרצאות של אסא שאפשר להבין מהן מעט מאוד למול התרגולים שעוזרים אבל לא מספיקים. בפועל יצא שרוב השבועות השקעתי את אותו זמן של ההרצאות בלקרוא ולעבור על חומר משלים כדי להבין מה הולך.", "timestamp": 1716474422696}]}