{"posts": [{"author": "Guy Yoffe", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: מרצה מדהים. כותב הרצאות מעולה, ומסביר אותם מעולה.\n\nשם המתרגל/ת: אייל בארי.\nחוות דעת - תרגולים: בזום קשה היה לראות מה הוא כותב על הלוח, סה\"כ בנאדם נחמד ומאמין שבלייב הוא מתרגל טוב.\n\nשעורי הבית: עמוסים, ארוכים, חלקם מרופרנסים, ומאוד עוזרים להבין את החומר. יש 12 גיליונות - הרבה מאוד ביחס לשנה שבה לומדים את הקורס.\n\nהמבחן: תלוי סמסטר, אבל תמיד איתי ואייל דואגים שיהיו ציונים סופיים גבוהים שמשקפים את ההשקעה בקורס.\n\nהשורה התחתונה: קורס מעולה ומעניין מאוד.", "timestamp": 1597753743347}, {"author": "ברק", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: ההרצאות מעניינות ומלמדות, לא נכנסנו לרוב לפינות טכניות מדי אם הן לא מהותיות. בגלל שההרצאות היו אונליין, איתי פרסם את הרשימות שלו לפני ההרצאה כדי שנוכל לעבור עליהם לפני. אפשר היה להסתדר בלי המעבר, אבל זה ממש משפר את הלמידה.\n\nשם המתרגל/ת: אייל בארי\nחוות דעת - תרגולים: מורידים לקרקע הרבה מהחומר שלמדנו ועוזרים להבין מה העיקר.\n\nשעורי הבית: בזוגות, גיליון כל שבוע שדורש השקעה, אבל מלמד ומספק.\n\nהמבחן: הוגן ולא מתחכם, עם בחירה של 3 מתוך 5 שאלות (יש לציין שהוא היה אצלנו אונליין וקצר יותר מהרגיל).\n\nהשורה התחתונה: מאוד ממליץ, קורס מרתק וחשוב לכל מי שרוצה לדעת קוונטית באמת (לדעתי רוב החומר מהשבועות הראשונים של הקורס צריכים להיכנס לאחד מקורסי הבסיס של פיזיקה קוונטית). הסגל מעניין, אדיב ועוזר בכל מה שניתן.", "timestamp": 1598177654080}, {"author": "Nir Gutman", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: איתי\nחוות דעת - הרצאות:  מרצה מעולה ומשקיע ומאוד ברור. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחן משלב הבנה תיארוטית מההצראות וגם פרקטיקה בחישובים שנלמדו לעומק בתרגולים. המבחן הוגן.\n\nהשורה התחתונה: קורס נהדר", "timestamp": 1600685663458}, {"author": "קורס נורא", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: \nאיתי מקסים, אך התוכן של ההרצאות פשוט הזוי. מדברים בגבוה גבוה על מתמטיקה סופר מורכבת ומופשטת, בלי להוריד את זה לקרקע. כל הרצאה צריך לראות לפחות פעמיים בשביל להבין מה בכלל הלך שם, ואי אפשר לדעת מה העיקר ומה הטפל.\n\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים:\nאיכות ההקלטה הייתה רעה מאוד, ואיכות ההוראה רעה אפילו יותר. אי אפשר להבין מה הוא כותב, אי אפשר להבין מה הוא אומר, והתרגולים מלאים שגיאות שאת רובן הוא לא טורח לתקן.\nמה שהכי גרוע - התרגולים מוסיפים חומר תיאורטי על ההרצאות, במקום להוריד לקרקע את כל הסבל הזה.\n\nשעורי הבית: \nארוכים, מייגעים, וכמובן, איך לא, מטופשים מאוד. מוכיחים לאורך עמודים על גבי עמודים כל מני משפטים איזוטריים, במקום לתרגל אותי על החומר שלמדנו בכיתה ובתרגול, בעצם מוסיפים לי חומר נוסף בדמות המשפטים שאני מנסה להוכיח.\nכל גליון שרף לי יומיים בשבוע, ויוצא גליון כל שבוע.\n\nהמבחן: \nנגלה בקרוב, דווקא מהתבוננות במבחני עבר נראה טכני יחסית לדרישות בשיעורי הבית ובתרגולים.\n\nהשורה התחתונה:\nלהתרחק כמו מאש. כשקראתי את הסילבוס חשבתי לעצמי שזה יהיה הקורס הכי מעניין שעשיתי בחיים, אבל זה פשוט קורס חסר תועלת באלגברה. יש כמה נקודות אור בקורס, כשמלמדים על אלגוריתמים קוונטיים, אבל לחלוטין לא מפצה על הסבל הממושך שנגרם לי.\nלא מומלץ בשום צורה.", "timestamp": 1625232547004}, {"author": "גורמים_ראשוניים_של_15", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: מאוד מסודר ומסביר הכול.\nכדאי להיות על החומר כדי להבין את הלוגיקה- הוא מסביר מעולה אבל פעם אחת במהלך השיעור- חוץ מחזרה זריזה בתחילת כל שיעור. יש רשימות מפורטות ומסודרות- שמאוד עוזרות במהלך הלמידה למבחן.\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: לא יכולתי להגיע לתרגולים עקב התנגשות, והייתה בעיה באיכות השמע של התרגולים אז לא ראיתי את ההקלטות.\nאבל הייתי בשעות קבלה- ורז מסביר מעולה, ממש נחמד ותמיד מוכן לעזור :)\n\nשעורי הבית: סבירים, לפעמים היה קשה להבין מה דורשים או שהיו חישובים מתמטיים סתם ארוכים. עזרו בהבנה של החומר.\n\nהמבחן: הוגן, צריך לדעת את כל החומר כולל הנושא האחרון (תיקון שגיאות).\n\nהשורה התחתונה: לא תאמינו כמה זמן לוקח לחשב את הגורמים הראשוניים של 15 :)\nוברצינות- קורס מעניין שנותן המון כלים לדברים קוונטיים, וכיף להבין סופסוף על מה כל הרעש של מחשוב קוונטי.", "timestamp": 1629146101550}, {"author": "אינפו", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: מרצה מעולה. יש רשימות מוקלדות במודל מפורטות מאוד עם שרטוטים וכל מה שצריך. מסביר בכיתה בבהירות וממש נחמד ועונה על שאלות במקצועיות.\n\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: גם מוקלדים ומסודרים במודל. רז מסביר את החומר בבהירות אבל לרוב אין זמן לסיים את התרגול אז משלימים מהמוקלד לבד. עונה על שאלות בחיוך ומקצועיות. רואים שמשקיע.\n\nשעורי הבית: פעם בשבוע, לוקח חצי יום בערך אם הקצב טוב. מלמדים את החומר, מרגישים שהושקע בהם זמן. אזהרה - מלא חישובים מתמטיים ארוכים.\n\nהמבחן: הוגן. לפעמים יש גם בונוס של כמה נק'. אצלנו היה בחירה 3 מתוך 4. צריך להיות על כל החומר, גם הסוף (תיקון שגיאות).\n\nהשורה התחתונה: קורס מעולה, מומלץ ביותר! מתמטי אבל מעניין ממש.", "timestamp": 1629220610699}, {"author": "s", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: \nמרצה טוב.\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: \nהתרגולים עזרו להבהיר נקודות בהרצאות שהיו חשובות למבחן, יש גם תרגולים מוקלדים שבהם יש כל מה שצריך.\nשעורי הבית: \nגליונות שבועיים אבל אפשר להגיש בזוגות כך שבסה\"כ לא היה כל כך עמוס.\nהמבחן: \nהוגן.\nהשורה התחתונה: ממליץ לקחת.", "timestamp": 1631199043930}, {"author": "חגגחחגכ", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: איתי \nחוות דעת - הרצאות: סבירות\n\nשם המתרגל/ת: רז\nחוות דעת - תרגולים: בסדר, קצת מבולגן\n\nשעורי הבית: שבועיים כל פעם על החומר של אותו שבוע. קשה מאוד לעקוב ולא הכל ממוחזר ימח שמם\n\nהמבחן: עוד לא ניגשתי, אבל נראה שיהיה קשה יש הרבה חומר\n\nהשורה התחתונה: לקחתי כי זה חובה לשרשרת. החלק הראשון על קוונטים שזה נחמד אבל שני על אלגוריתמים ואני לא יכול לסבול", "timestamp": 1632646072768}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: איתי ארד\nחוות דעת - הרצאות: מעניינות מאוד ועמוסות. איתי מעביר את ההרצאות טוב, אך יש כל כך הרבה מושגים חדשים שהוא מעביר בהרצאות, שהייתי צריך לא פעם לחזור עליהן (גילוי נאות - כנראה שזה מרגיש לי חדש, משום שאני לא לומד תואר בפיזיקה)\n\nשם המתרגל/ת: רז פירנקו\nחוות דעת - תרגולים: רז מתרגל טוב. הוא טיפה מפוזר אך מקצועי מאוד ויודע לענות על כל שאלה\n\nשיעורי הבית: יוצאים בערך כל שבוע ובקושי ממוחזרים. למרות זאת, הרמה שלהם בדרך כלל לא קשה מאוד, והם מלמדים הרבה \n\nהמבחן: הלמידה למבחן מעט קשה, משום שיש המון חומר שצריך לשלוט בו, אך המבחן הוגן מאוד ולרוב לא מתחכם מדי\n\nהשורה התחתונה: קורס עמוס מאוד אך מומלץ למי שאוהב מכניקת הקוונטים. כמו כן, הסגל טוב מאוד ומתחשב בסטודנטים\n\nמי שלא לומד תואר בפיזיקה (כמוני) לא צריך לחשוש לקחת את הקורס. הקושי העיקרי הוא בהתחלה (בגלל הצורך להשלים מושגים באלגברה ליניארית), אך בהמשך הדברים מסתדרים", "timestamp": 1660913608264}]}