{"posts": [{"author": "Arex 36", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אהוד בכר\nחוות דעת - הרצאות: מאוד משעמם\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: המממ....\n\nשעורי הבית: אין קשר כמעט להרצאות ותרגולים, מאוד שטחי\n\nהשורה התחתונה: חכו שסוקר יעביר", "timestamp": 1612349467780}, {"author": "Alon Strogetsky", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אהוד בכר\nחוות דעת - הרצאות: שונה מאוד מסוקר, פחות דגש על כוכבים אלא על יותר טעימות מהמון נושאים שונים. ככה יוצא שהקורס פחות עמוס בפיזיקה, ויותר בהכרת התחומים הנחקרים\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: אין מילים רעות\n\nשעורי הבית: לא עמוסים בכלל \n\nהמבחן: לא קשה.\n\nהשורה התחתונה:חוות הדעת לא רלוונטית אם לוקחים עם סוקר. בכל מקרה הרגשתי כמו במלג מורחב, לא בהכרח לרע.", "timestamp": 1614183514705}, {"author": "--", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אהוד בכר\nחוות דעת - הרצאות: הרצאות מעניינות. סך הכל קורס מבוא אז אין פה יותר מדי מקום להעמיק כי יש הרבה נושאים שצריך לגעת בהם, אבל זה גם טוב כי זה חוסך הרבה מתמטיקה מגעילה. מומלץ\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: כמה גיליונות, רובם ניתנים לרפרונס\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מצוין. אין מבחן בסוף אלא מעבירים הרצאה וזה מדהים כמה שניתן להנות מזה ולהעמיק בנושא שאתה בוחר ספיציפית לעניין האישי שלך ובליווי הסגל. הסגל באמת בא ללמד את המקצוע וזה יוצר קורס מאוד מוצלח. לא יותר מדי עומס תוך כדי הסמסטר. נטו להגיע להרצאות/תרגולים ולרפרנס גיליונות כשצריך, אבל כן צריך להשקיע בעבודת הסיום שכיפית.", "timestamp": 1647613454051}, {"author": "הראשונה לשמה", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אהוד בכר\nחוות דעת - הרצאות: נכחתי ברובן, המרצה לא הכי מרתק בעולם אבל החומר עצמו מעניין. המרצה מאוד בקי בתחום, שמר על אווירה טובה בהרצאות ותמיד ענה על שאלות. ההרצאות לא מאוד הכרחיות בשביל הבוחן, זה נטו בשביל הידע והעשרה.\n\nשם המתרגל/ת: רועי רחין\nחוות דעת - תרגולים: התרגולים היו סבבה, לא גרועים ולא מאוד הכרחיים. רועי היה מאוד נחמד בסיור ובעבודה על הפרזנטציות והשקיע המון כדי שהחוויה תהיה מוצלחת. \n\nשעורי הבית: קלילים ממש. יש רפרנס אבל ממש לא צריך, כמה שאלות מונחות/מבוססות על שאלות מהתרגול.\n\nהמבחן: חלק מהציון מורכב מבוחן של 20 שאלות מתוך מאגר ידוע מראש (להתכונן אליו יום אחד ואתם מסודרים). רוב הציון זה פרזנטציה על נושא שאתם בוחרים. דורש קצת השקעה אבל אני ממש נהניתי מזה. יום הפרזנטציות היה מושקע (אוכל!) ומעניין. הרבה יותר כיף מסתם עוד מבחן.\n\nהשורה התחתונה: בהול להירשם! לנו היה סיור בחנוכה לD-MARS ולטלסקופ במצפה רמון. הסיור סופר מושקע וכיפי. סך הכל קורס באמת חוויתי עם ציון טוב ותחושה טובה.", "timestamp": 1660513805338}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "אמלק: ממש לא. ממש ממש לא. ממש. חכו לסגל אחר אולי.\nשם המרצה: אהוד בכר\nחוות דעת - הרצאות: \nמבולגן ולא ככ כריזמטי, בברור אוהב את התחום, אבל לא להרצות. לא מפרסם הקלטות, המצגות סהכ סבירות מינוס, לא שהוא משתמש בהן באמת. יעשה לכם ריגשי אם תסתכלו בטלפון. יפרסם סילבוס עם מדיניות ציוני שיעורי בית לא נכונה. יגיע רק פעם אחת במהלך כל הבחינה לענות על שאלות.\nלא מצאתי סיכום טוב שלהן בענן.\n\n\nשם המתרגל/ת: ג'וליה\nחוות דעת - תרגולים: \nלא ככ טובה בלהסביר את עצמה, סהכ משתדלת. אבל השאלות בשיעורי הבית לא מובנות בכלל, מה נתון, מה בכלל שאלו, נכון הבדיחה שנותנים במבחן שאלה 'נתון כי g=9.8, חשב את מסת השמש'? אז כזה. זה הוביל לכ''כ הרבה תסכול במהלך הסמסטר שהזדקנתי בלפחות עוד שנה. אגב, מעולם לא פורסמו פתרונות רשמיים לגיליונות כי 'זה ידרוש ממנה יותר מדי זמן' - אז בהצלחה בלהפיק לקחים למבחן.\n\nשעורי הבית: \nכאמור, לא מובנים בשיט. במלוא רוע מובן המילה ועמוסים. כשמבינים מה רוצים ממך הם בדרך כלל סבירים, ידרשו לחפש בגוגל הרבה ערכים מספריים (אלא אם אתם כבר זוכרים מהם מסת ורדיוס צדק). \n\nהמבחן: \nחוץ מהמבחן היה בנוסף בוחן בהרצאה האחרונה (לשנן תשובות למאגר של 90 שאלות).\nהייתה אופציה לעשות פרוייקט במקום המבחן הסופי, לא עשיתי אז לא יכול להעיד.\n\nאז המבחן:\nחומר סגור, עם דף נוסחאות קטן שלהם, אז בהצלחה בלזכור את הנוסחה לרדיוס ננס לבן. לא פרסמו בכלל מבחני עבר בטענה שהסילבוס שונה, אבל גם לא פרסמו מבחן לדוגמה. אפילו את המבנה הכללי פרסמו רק כמה ימים לפני הבחינה. היה יותר מובן מתרגילי הבית, אבל עדיין עם סעיפים לא ברורים. עוד לא נתנו ציונים אז לא יכול להעיד על חומרת הבדיקה, על סמך תרגילי הבית היא תהיה כנראה קשוחה.\n\nהשורה התחתונה: \nחומר מעניין, אבל קורס מנוהל בצורה מזעזעת לוגיסטית ועם שאלות שמנוסחות בצורה אפילו יותר מזעזעת, אז אם באמת חשוב לכם לדעת את הנושא, תקראו פשוט את ספר הקורס, גם ככה אתם תעשו את זה לפני המבחן.\n\nהערה תחתונה: היה סיור לפלנטריום עם הנחייה של 2 סטודנטים מהקורס שהיה מגניב, בעיקר בזכותם. אבל עדיין נחמד שהסגל תיאם.", "timestamp": 1675861775316}, {"author": "סבלתי כדי שאתם/ן לא תצטרכו", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "במשפט אחד: אל תעשו את הקורס הזה כל עוד הסגל הזה מעביר אותו חד וחלק.. עדיף שתעשו קורסי אסטרו אחרים!!!\nשם המרצה: אהוד בכר\nחוות דעת - הרצאות: עם כל הכבוד, הראה שהוא אינו מעוניין להעביר את החומר.. הוא מעביר את הקורס הכי מעניין לטעמי בכל התואר ופשוט גורם לי לרצות להירדם 5 דק לאחר תחילת ההרצאה.\nוכל זה היה עוד איכשהו בסדר אילולא גם היכולות הפדגגוגיות שלו כמרצה אחראי על הקורס היו, לדעתי האישית, מתחת לכל ביקורת. \nנותן לנו אופציה לעשות עבודות במקום מבחן זה מבורך. לא מפרסם הישגים נדרשים מהעבודה ורוצה שנחשוב לבד ואז כשחושבים לבד ומציגים מתעצבן שזה לא מה שהוא רצה.. כל איש סגל אומר שצריך להגיש דבר אחר.. תסכול שאין שני לו ואומר את זה מי שעשה פיזיקה 2פ עם יואב שגיא!\nכמו כן, החומר מועבר כלכך מהר ובצורה כלכך שטחית שאני לא חושב שהקורס הזה נתן איזשהו ערך מוסף כלשהו יותר מסרטונים ביוטיוב.\nשם המתרגל/ת: ג'וליה\nחוות דעת - תרגולים: \nבחורה נחמדה ורואים שרוצה לעזור אבל נראה כאילו היא לא עברה על החומר לפני ואם כן, זה נראה כאילו היא לא מבינה אותו עד הסוף. בתחילת הסימסטר שאלו אותה שאלות במהלך התרגול והיא או שלא סגורה על התשובה שהיא נותנת או שהיא נותנת תשובה שבבירור לא נכונה שרק מובילה לעוד שאלות ולעוד בילבול. בשלב מסוים במהלך הסימסטר הפסיקו לשאול אותה שאלות כי זה הרגיש מיותר וחסר משמעות כי בסוף פשוט נחפש באינטרנט את התשובה וזהו.\nשעורי הבית: \nהרגשתי שאני עושה שיעורי בית בלשון בנושא הבנת הנקרא... רק בשפה אנגלית ובמילים בעברית... אצל מורה שלא יודע לא אנגלית ולא עברית. מאוד מתסכל אבל כן לפעמים מבדר (לא ידעתי שיש כוח חזק חלש ו\"בינלאומי\"). נתונים שאנחנו לפעמים צריכים לחשב ולפעמים להוציא מהאינטרנט בלי שכתוב מתי זה אופציה א' ומתי אופציה ב'. ודרך אגב רוב השאלות הם מתורגמות מהספר של הקורס או לקוחות מגיליונות משנים קודמות אבל גם אז משום מה היא עושה איקס בבדיקה ולא כותבת למה...\nהמבחן: \nאהוד נתן אופציה לבחור בין מבחן לעבודה שזה היה מבורך מאוד. חבל שזה לא משנה מה הייתי בוחר, כי בשניהם ההתנהלות היתה ביזיון. אני בחרתי בעבודה. הסטודנטים לא מבינים מה הסגל רוצה שנעשה,\nהסגל לא מבינים מה אהוד רוצה, אהוד לא מבין איך אנחנו לא יודעים לקרוא מחשבות ולהבין מה הוא רוצה שנבין בלי להגיד לאף אחד.\nהשורה התחתונה:\nבתור מי שמהתיכון החלום שלו לעסוק באסטרופיזיקה ובגלל זה הלכתי ללמוד תואר בפיזיקה.. אני מצטער שלקחתי את הקורס הזה. ושלא תבינו אותי לא נכון, הציון שלי היה דיי טוב בסופו של דבר אבל התנהלות הקורס הזה פשוט גרמה לי לסלוד מהתחום ולחפש תחום אחר לחקור אותו ואם כן לעשות אסטרו אז לא בטכניון.\nבמשפט אחד: אל תעשו את הקורס הזה כל עוד הסגל הזה מעביר אותו חד וחלק.. עדיף שתעשו קורסי אסטרו אחרים!!!", "timestamp": 1676782131114}, {"author": "צ'אנדרהסקר", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אהוד בכר\nחוות דעת - הרצאות: מרצה ברור ולוגי. עוקב רוב הקורס אחרי הספר ומפנה לפרקים הרלוונטיים למי שרוצה להעמיק (למעט בסוף הקורס שעוסק בקוסמולוגיה ובו הוא קצת מערבב בין כמה ספרים אחרים). זמין למדי במייל ובפגישות (במקום שעת קבלה קבועה הוא מבקש שישלחו לו מייל ויקבעו באופן פרטני). \n\nשם המתרגל/ת: ג'וליה\nחוות דעת - תרגולים: פעם ראשונה שהיא מתרגלת וזה ניכר עליה. התרגולים עברו בצורה לא כל כך ברורה. בנוסף, באמצע הסמסטר ג'וליה החליטה להפוך את ציוני שיעורי הבית למספריים במקום בינאריים, מה שפגע בציונים הסופיים (ובאופן כללי לא תקין). \n\nשעורי הבית: לא מתחכמים יותר מדי מבחינה פיזיקלית אבל היו לא מעט שאלות שנוסחו באופן גרוע. תרגיל פעם בשבועיים בערך. \n\nהמבחן: בוחן בקיאות בשבוע 13 שכלל שאלות מל\"ג על חומר הקורס. השאלות עצמן לא מסובכות למי שעקב אחרי הקורס, אבל הבדיקה הייתה די קשוחה והורידו נקודה אחת מלא מעט שאלות שבהן ההגדרה לא הייתה שלמה לטעמם. \nבנוסף אליו, היה אפשר לבחור בין מבחן לסמינר. הסמינר נבנה לאורך הסמסטר תוך הנחייה של אחד מאנשי הסגל. באופן כללי התחושה הייתה שמנסים לעזור בו ולא להכשיל. לא יכול להעיד לגבי המבחן מכיוון שלא עשיתי אותו. \n\nהשורה התחתונה: קורס ממש מעניין ולא מאוד עמוס. בגלל שנוגעים בהרבה נושאים הוא יחסית שטחי ופחות ריגורוזי מקורסים מתקדמים אחרים (אבל זה לאו דווקא דבר רע). אלמלא הבעיות הניהוליות הוא היה ממש מצויין.", "timestamp": 1680345678916}, {"author": "תברחו", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: שמואל ביאלי\nחוות דעת - הרצאות: \nשמואל העביר את הקורס בפעם הראשונה, זה היה ניכר מאוד! \nהכל היה לא ברור, הוא לא פירסם סילבוס עד שבוע 9 מהסמסטר, הרגיש שהוא מעופף ושהוא מצפה שנכיר ונדע מלא דברים שלא למדנו כי מבחינתו זה ״ידע כללי״ הרגיש שהוא קצת מנותק מהכיתה ולדעתי בגלל זה רוב הכיתה לא המשיכה את הקורס, בשבועות האחרונים היינו פחות מ 15 בכיתה כשיש מעל 50 רשומים לקורס\n\n\nשם המתרגל/ת: גוליה\nחוות דעת - תרגולים: \nהיה ניכר שהיא מעוניינת לעזור לסטודנטים אבל גם היא הייתה מאוד מנותקת מהסטודנטים ועל אף שהראתה שחשוב לה שנבין לא הרגשתי שנעשה מאמץ להנגיש לנו את הגליונות שהיו הרבה פעמים לא קשורים לחומר ואף בלתי פתירים.\nסך הכל הייתה נחמדה\n\nשעורי הבית: \nבאורך הגלות!\nפשוט סבל \nהיו שאלות שגם הסגל לא ידע לפתור וכל גליון לקח לי לפחות 12 עמודים (גליונות שבועיים)\n\nהשורה התחתונה: \nקורס של 3 נקז שהרגישו כמו 6\nסבלתי מכל רגע\nהסגל לחלוטין הרס את הקורס מקווה שלפחות לא ידפקו אותנו עם הציונים", "timestamp": 1710948014663}, {"author": "JonGaming", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שמואל ביאלי\nחוות דעת - הרצאות: מרצה מטורף, מאוד מעניין והרים לנו ערב תצפית משוגעת ומושקעת בסוף הסמסטר. שמואל הצליח לחשוף אותנו להמון אזורים שונים באסטרופיזיקה כמו שמצופה מקורס מבוא לתחום. אני וחברי מאוד לא מסכימים עם הביקורת הקודמת שניכר שנכתבה כפורקן על תסכולו מהלימודים וחוסר יכולתו לסגור את התואר של כותב הביקורת. \n\nשם המתרגל/ת: גוליה \nחוות דעת - תרגולים: אחלה מתרגלת, אכפתית ומשקיעה אם כי לדעתי התרגילים בקורס יכולים להיות מעניינים יותר והם בכללי פחות רלוונטים\n\nשעורי הבית: היו ארוכים אבל מסתדרים\n\nהמבחן: סומך על הצוות המטורף שלנו\n\nהשורה התחתונה: בסופו של דבר הקורס מרחיב אופקים ולפחות בסמסטר שלנו לגמרי השיג את המטרה שלו כקורס מבוא. חוץ מזה שמואל גם נתן אפשרות לקבל נקודות בונוס על ידי הצגת נושאים נבחרים 5 דקות מול הכיתה וזה היה מאוד נחמד.", "timestamp": 1714144653254}, {"author": "לא לקחת", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שמואל\nחוות דעת - הרצאות: \nההרצאות משעממות מאוד, והמרצה לר מסודר בכלל, לא פרסמו רשימות להרצאות ואין סיכום להרצאת בכלל.\nשם המתרגל/ת: גוליה\nחוות דעת - תרגולים: \nמנסה לעזור אבל היא מנותקת מהסטודנטים, שולחת מיליים ב 2 בלילה, והתרגולים מבלבמלים וארוכים מדי לשעה אחת.\nשעורי הבית: \nסבל. 7 שאלות עם סעיפים כגליון שבועי זה לא בסדר. ויש שאלות שאפילו הסגל לא ידע איך לעות עליהם.\nהמבחן: \nלא היה עדיין, אבל אין לנו שאלות כדי לתרגל, ובכלל אין לנו מושג איך אפשר ללמוד למבחן.\nהשורה התחתונה: \nלא לקחת, בתור מישהיא שאהבה אסטרופיזיקה בילדות, זה היה הקורס הכי לא מעניין שלקחתי בתואר הזה (וכן אפילו פחות מעניין מאלקטרו)", "timestamp": 1715005225562}, {"author": "Ray", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שמואל\nחוות דעת - הרצאות: \nהרצאות נורא מבולגנות. יש רצון להעביר קו מחשבה אבל פשוט השורה התחתונה מתפספסת.\nהסלבוס הופיע רק באמצע הסמסטר אחרי בקשות חוזרות ונשנות.\nשם המתרגל/ת: גוליה\nחוות דעת - תרגולים: \nהתרגולים רשומים בצורה מפורטת חוץ מזה אין באמת ערך מוסף בתרגול חוץ מהעתקה והקראה של הדף ללוח. \n\nשעורי הבית: \nלפחות 7 שאלות שבועיות שמצריכות השקעה רבה בחיפוש באינטרנט ובספרים, אין את הכלים המתאימים בהרצאה או בתרגול.\nאף גיליון לא נבדק תוך כדי הסמסטר וגם לא בסמוך לבחינה.\nחלק ראשון של פתרונות לגליונות פורסמו פחות משבועיים לפני הבחינה, כאשר גיליונות 10-11 שנאמר לנו שבוודאות תיהיה שאלה משם פורסמו 4 ימים לפני הבחינה.\nיצר תחושה של זלזול בזמן ובהשקעה שלנו מצד סגל הקורס\n\nהמבחן: \nדף נוסחאות מקבלים בצמוד לבחינה כאשר גוליה אמרה בתחילת הסמסטר וגם באמצע שתפרסם נוסחאון לפני כדי שנוכל ללמוד איתו-לא קרה\n\nהשורה התחתונה: \nעומס שלא תואם קורס בחירה ואת הנקז עליו- כמות הזמן שצריך להשקיע כאן מספיקה לקוונטית 1 ו2.\nמשהו כאן התפספס וחבל", "timestamp": 1715017054857}, {"author": "כמו שאמר ביידן - Don't", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שמואל\nחוות דעת - הרצאות: החומר מועבר בצורה מבולגנת ורוב המידע נאמר בע\"פ, אז קשה לעקוב\n\nשם המתרגל/ת: ג'וליה\nחוות דעת - תרגולים:  ג'וליה מותק! ממש באה לקראת הסטודנטים ועוזרת וזמינה והתרגולים ברורים\n\nשעורי הבית: מזעזע, 7 שאלות ארוכות כל שבוע. עמוס בטירוף ובלתי אפשרי ל3.5 נקז. המון מידע היה צריך להשלים מהאינטרנט ומספרי הקורס.\n\nהמבחן: מקווים לפקטור\n\nהשורה התחתונה: אני מקווה שבפעם הבאה ששמואל יעביר זה יהיה הרבה יותר מסודר, הוא מעניין ורוצה להעביר לנו את הידע אבל ציפה לרמת השקעה של סטודנטים לתואר מתקדם. אמרו בתחילת הקורס שלא תהיה התאמה של 100% בין התרגולים וההרצאות והגיליונות, אבל כמות החומר שהיינו צריכים להשלים בין לבין הייתה נוראית. ג'וליה בודקת התרגילים ואפילו היא לא הספיקה לבדוק עד המבחן מרוב העומס בגיליונות.", "timestamp": 1715346365831}, {"author": "student", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שמואל ביאלי\nחוות דעת - הרצאות: אמ;לק: שמואל מאוד נחמד, מרצה סביר, מרצה אחראי ממש לא טוב.\nלאורך כל הסמסטר שמואל היה מאוד נחמד ודאג לאווירה טובה בקורס. כמו בכל שנה לקח את הסטודנטים בקורס לערב תצפית מושקע ונחמד מאוד. ההרצאות עצמן היו סבירות מינוס, המון מידע לא מסודר, לרוב חסר קשר לוגי ואין שום דבר דומה בין פיתוח נושא מסוים לפיתוח נושא אחר. המון שימושים בקירובים והנחות על מנת לפתח עשרות ביטויים שונים שציפה שנזכור למבחן. לדעתי האישית בנוסף לזה היה משעמם. בהיבט הניהולי היה רע מאוד, הסכים לפרסם הקלטות של ההרצאות רק לקראת המבחן, הכניס שאלות מונפצות והזויות לשיעורי בית ולא יכל לעזור כששאלו אותו. במהלך הסמסטר המתרגלת אמרה לנו שיהיה בהמשך דף נוסחאות כדי שיהיה לנו עם מה להתכונן למבחן אך שמואל החליט לא לעשות את זה ולתת לנו חמישה דפים של דף נוסחאות רק יחד עם המבחן. לבסוף, הממוצע בקורס אחרי 35 אחוז מגן (100) ואחרי טריקים של להעלות את ציוני הנכשלים ככה שעדיין יהיו נכשלים אך עם ציון 50 (כדי לא להוריד את הממוצע), הממוצע הוא 70, וחישוב פשוט מראה שזה אומר שהממוצע במבחן הוא בערך 43 (בכוונה לא פורסם). אחרי מתן הציונים של קורס שהיה של 90 והפך לקורס של 60, שלח לכולנו מייל שהבדיקה הייתה סלחנית. \n\nשם המתרגל/ת: ג'וליה\nחוות דעת - תרגולים: ג'וליה ממש נחמדה ומאוד עוזרת. התרגולים עצמם היו מדף מוכן מראש שהיה במודל, לא ברור אם בתרגולים היה עוד חומר לקורס או שאלות שצריך לפתור. כשכן היו שאלות הן היו מאוד לא ברורות, עם פתרון מאוד לא ברור בהתאמה. אין שום הסבר מה גורם למעבר משורה לשורה וכשיש אז לרוב זה לא נכון. לא היה מספיק סנכרון בין ג'וליה לשמואל, לדוגמה כששאלו אותה על שאלות בשיעורי הבית שלא יכלנו לפתור ענתה שזה שאלות של שמואל ושהיא לא יודעת לעזור.\n\nשעורי הבית: כל שבוע גיליון שיעורי בית מאוד מאוד ארוך, כשכל קשר בינו לבין מה שנלמד בקורס מקרי בהחלט. המון חיפושים באינטרנט ובמקורות אחרים כדי להבין מה קורה שם ורמת השקעה יותר משני קורסים של 5 נקודות. זוועה רצינית.\n\nהמבחן: כשפנינו לסגל בקשר לזה שאין מבחני עבר רלוונטיים ואנחנו לא יודעים איך להתכונן אמרו לנו שהמבחן יהיה על מה שנלמד בהרצאות תרגולים שיעורי בית. כשביקשנו לפרסם את דף הנוסחאות מראש למועד ב כיוון שזה מאוד מקשה לתת 5 דפים של נוסחאות רק עם המבחן שמואל לא הסכים ואמר שחשוב לו שנבין את החומר ושלא סתם נציב בנוסחאות. הוא הוסיף דוגמה על שאלה עם נפילה חופשית, ואמר שאם היה לנו את הנוסחה היינו פשוט מציבים בנוסחה אך אם אין אותה צריך להבין כדי לפתור. מה הקשר בין זה ללפרסם את הדף מראש? לא ברור. ציינתי כבר את הנתונים של המבחן קודם, אחרי טריקים ו35 אחוז מגן, ממוצע 70. במקום שהסגל יראה שהממוצע במבחן שלהם הוא 40 ויעשו בדק בית, החליטו שהסטודנטים לא מספיק טובים.\n\nהשורה התחתונה: מכל הבחינות זה הקורס הכי גרוע שלקחתי בטכניון, ממליץ להתרחק.", "timestamp": 1718370317999}]}