{"posts": [{"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מוטי\nחוות דעת - הרצאות: עוברות בצורה מאוד מעניינת עם הרבה העשרה של איפה התחום נמצא היום. הבעיה של מוטי שהוא לא הכי מחובר לסטודנטים ודי רץ עם החומר ולא שם לב שיש שאלות ושאנשים איבדו אותו.\n\nשם המתרגל/ת: מתן\nחוות דעת - תרגולים: העביר את התרגולים בסדר בסך הכל, אפשר גם להבין אותם די טוב מהדפים לבד\n\nשעורי הבית: מרורפרנסים, חלקם לא פשוטים ויש כמה ארוכים במיוחד\n\nהמבחן: מהקשים שנתקלתי בהם בתואר, זה שהממוצע גבוה הוא כי מוטי דואג לסדר אותו עם פאקטור לצורת ה\"שגביאן\" המפורסמת של 2 המקלות שלו.\n\nהשורה התחתונה: קורס כבד עם הרבה חומר  אבל מאוד מעניין ופררטי להמשך מחקר בתחום", "timestamp": 1676310258648}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "הערה - אני כותב את זה בתור מהנדס חשמל ולא פיזיקאי\n\nשם המרצה: מוטי שגב\nחוות דעת - הרצאות: הנושא ממש מעניין, ומוטי הוא פשוט מכונת ידע. עם זאת, היה לי ממש קשה לעקוב אחרי ההרצאות. רק לפני המבחן הבנתי אותן\n\nשם המתרגל/ת: מתן אבן-צור\nחוות דעת - תרגולים: מתרגל טוב. התרגולים מוסיפים על מה שמלמדים בהרצאה\n\nשיעורי הבית: קשים ולפעמים ארוכים ולא מובנים\n\nהמבחן: עם חומר פתוח. הרגיש הוגן ברמה, אך לא הבנתי מה רוצים ממני בחלק מהסעיפים. הביאו פקטור של 10% לציון המבחן\n\nהשורה התחתונה: קורס מאוד מעניין ומומלץ למי שאוהב אופטיקה. למרות זאת, הוא מהקורסים המאתגרים שלקחתי", "timestamp": 1677150660010}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוטי שגב\nחוות דעת - הרצאות: \nההרצאות נעות בין מאוד משעממות כשמוטי מעביר חומר יבש או מפתח נוסחאות, לבין מרתקות בכל הנוגע לכמות ידע שיש לו על ההיסטוריה של התחום ועל מה שקורה בתעשייה וטיפים הנדסיים.\nיש לו הרבה הערות חשובות שיכולות לצוץ במבחן, אז כשמרגישים שהוא עובר למשהו חשוב (יש שינוי בטון שלו והוא נהיה מעניין), תהיו מרוכזים ותקשיבו טוב.\n\nשם המתרגל/ת: מתן\nחוות דעת - תרגולים: \nקצת מפוזר, בכנות לא הייתי ברוב התרגולים.\nכדי לפחות לעבור עליהם ולהיעזר בהם בשיעורי בית.\n\nשעורי הבית: \nממחוזרים ברובם, לא תמיד מרגישים רלוונטים ולא ממש דומים למבחן.\n\nהמבחן: \nלעומת אורן שמכניס שאלות חישוביות, מוטי מכניס בעיקר שאלות ידע והבנה, מומלץ להתמקד בעיקר בלימוד מקיף של החומר מאשר פתרון מבחנים.\n\nהשורה התחתונה: \nהקורס מפתיע בכמות החומר הרלוונטי שהוא מכיל לתחום האופטיקה ולא רק בלייזרים , כדאי לבוא להרצאות ולהקשיב למוטי בחלקים המעניינים כי הוא מביא הרבה מאוד אינטואציה.\nיהיו מלא נושאים שיכולים להיות לא קשורים בכלל ופתאום תבינו אותם כי הם עלו בקורס.", "timestamp": 1677717304822}]}