{"posts": [{"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יעקב קרסיק\nחוות דעת - הרצאות: פיזיקה מעניינת, בעיות מעניינות, קירובים שחשוב להכיר. נחמד מאוד לקחת נושא יחסית ספציפי וללמוד אותו לעומק. ההרצאות עברו באנגלית הסמסטר, ויעקב מן הסתם מומחה בתחומו, אבל האנגלית פגעה באיכות ההוראה. \n\nשעורי הבית: מעט גיליונות, מאוד קלים\n\nהמבחן: היה מאוד שונה לעומת שנים שעברו והציונים היו בהתאם, היו פקטורים וגם אחריהם הממוצע היה נמוך בהשוואה לשנים קודמות. חומר פתוח, ממליץ לסכם את ההרצאות.\n\nהשורה התחתונה: קורס מעניין ולא עמוס, אפשר בקלות להוציא ציון מאוד גבוה אם יודעים איך ללמוד למבחן.", "timestamp": 1648047763458}, {"author": "~", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: Yakov Krasik\nחוות דעת - הרצאות: Yakov is truly an expert in his field and this is clear throughout the lectures. Sometimes this can be frustrating, such as when he moves quickly through challenging material or asks difficult questions. In general though he makes a great effort to help us understand what's going on from a fundamental physics perspective (which is very refreshing), and he is overall a very kind and intelligent person.\n\nשם המתרגל/ת: Yang Cao\nחוות דעת - תרגולים: Yang is also very knowledgeable in his field, and a very nice person. The TA's were a bit too easy though, they didn't really match the level of difficulty and rigor of the lectures, which was unfortunate. Yang graded the homeworks nicely and graded the final exam very nicely, but it took him quite some time to return the grades - this wasn't so helpful. \n\nשעורי הבית: Five homeworks which were very easy, they usually matched the level of the tutorials. Grades were great.\n\nהמבחן: The Moed Aleph was a written exam, unfortunately it was quite difficult since it deviated from the exams given in previous years and didn't match the level of the homeworks or tutorials. Yang graded the exam as nicely as he could, but the grades still weren't so great. The Moed Bet was an oral exam, soitting with Yakov in his office for an hour while he asked very fundamental (yet challlenging) questions about the underlying physics of plasmas. Quite stressful but Yakov did his best to nudge our answers in the right direction and give as many points as he felt was right. This was the first time I studied for a physics course in this manner, really trying to understand the deep physics of everything down to the molecular level. I thought this was very unique.\n\nהשורה התחתונה: Super interesting course, the field of plasma physics is a cool combination and expansion upon the other subjects we've studied so far in our degree. The material can be challenging to understand, but rewarding if you put in the effort to study it properly. Yakov and Yang are interesting and nice, and I would recommend this course to anyone curious about the field.", "timestamp": 1657557232950}]}