{"posts": [{"author": "מצולק מארי לאור", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ארי לאור\nחוות דעת - הרצאות: ארי המרצה הכי גרוע בפקולטה, אי אפשר להבין אותו, אי אפשר ללמוד ממנו, הוא לא מסודר ורצוי לפטור אותו מהוראה \n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: הקורס ללא תרגולים\n\nשעורי הבית: הקורס מורכב מ5 תרגילי בית כבדים ביותר (הקורס הכי כבד שלקחתי בתואר הראשון+השני). כל תרגיל מהווה 20% מהציון הסופי ובהתאמה עובדים עליו במשך כשבועיים רצופים. רוב התרגילים כוללים הרבה מאוד נומריקה ועבודה קשוחה במטלב. הקשר בין התרגילי בית לבין החומר הנלמד בכיתה רופף ביותר והם קשים ב-5 סדרי גודל יותר ממה שלמדנו (הפער קיצוני בהרבה מכל קורס אחר). נדרש להשקיע המון המון זמן בשביל להצליח לענות אכשהו על השאלות (כולל לשוטט ב arxiv במטרה לחפש משהו אולי דומה ותוצאות ביזאריות באסטרופיזיקה). אחרי ההגשה של התרגיל ארי בודק אותו לחומרה ממש ובצורה בינארית, הכל או כלום, בלי משוב הגיוני. היה גיליון אחד שקיבלתי בו 40 כאשר המשוב על התרגיל היה \"wrong results, -33 points\" (פעמיים), בלי שום התייחסות למה הטעות ולמה זה לא נכון (תזכורת: כל תרגיל 20% מהציון הסופי). ביזיון רציני והתנהגות מזלזלת ביותר של המרצה. גם כאשר ביקשתי פרטנית במייל אישי התייחסות וביקורת הוא ענה שאם אני מעוניין לערער אז אני צריך לנסח מייל ערעור מנומק בכתב, ועליו הוא יגיב ולא יענה לי ככה \"סתם\" במייל. בקיצור, ממליץ להתרחק מהקורס הזה כמו מאש. הוריד לי את הממוצע של התואר השני בצורה קיצונית וארי מרצה (הן מבחינת יכולות הוראה והן מבחינת יכולות אנוש) מתחת לכל ביקורת - בחיים לא נתקלתי במרצה כזה. \n\nהמבחן: אין. ציון 100% שיעורי בית. נשמע חלום? חובה לקרוא את הפירוט עליהם לעיל.\n\nהשורה התחתונה: מתחרט על כל שנייה שהשקעתי בקורס הזה, בחיים לא הייתי ממליץ לקחת אותו. פירוט ב\"שעורי בית\". אל תטעו ותחשבו שההיסטוגרמה משקפת את העולם האמיתי. ארי פינק את הסטודנטים שלו בלבד בציונים של ה95-100. שאר הסטודנטים (כמוני) קיבלו את הציונים הנמוכים יותר. אפליה מזעזעת. כמוכן, אילו הייתי משקיע את השעות שלי בכל קורס אחר הייתי מקבל 100 עגול. הקורס הכי תובעני ומגעיל שעשיתי בחיי. *המציל נפש אחת כאילו הציל עולם ומלואו*", "timestamp": 1666375197207}]}