{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: ישראל שכטר\nחוות דעת - הרצאות: מבולגנות, לא ברורות\n\nשם המתרגל/ת: מור לוי\nחוות דעת - תרגולים: לא ברורה, אומרת שכל החומר שמתורגל לא רלוונטי לבחינה\n\nשעורי הבית: אין\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598339537396}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: הרצאות קלילות ומעניינות, דוד מעביר אותן בצורה עניינית ומעניינת. רובן חזרה על החומר של יסודות הכימיה, חלקן הרגישו קצת מיותרות אבל באופן כללי ההרצאות קלילות, דוד משתדל לתת דוגמאות מחיי היומיום ולהפוך את ההרצאה למעניינת\n\nשם המתרגל/ת: נועם זיסר\nחוות דעת - תרגולים: תרגולים של שעה, לא מספיקים הרבה, בעיקר סיכום קצר של ההרצאה ותרגיל אחד או שתיים בנושא\n\nשעורי הבית: לא כבדים\n\nהמבחן: ברמה סבירה, דומה לרמה של תרגילי הבית והתרגולים ועם הרבה תרגול אפשר להצליח\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1629138586386}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דוד איזנברג \nחוות דעת - הרצאות: \nדוד בין המרצים הכי טובים בפקולטה! בהתחלה ההרצאות קצת משעממות כי הנושאים משעממים אבל ברגע שמתחילים הדברים המעניינים (בערך מאמצע הסמסטר) ההרצאות הופכות למרתקות, דוד נותן דוגמאות מהחיים ודוגמאות יישומיות של החומר וזה ממש מעניין! בנוסף דוד לא מנסה להכשיל ובאמת רוצה שנצליח\nשם המתרגל/ת: אמיר אילן\nחוות דעת - תרגולים: על הפנים, לא מבינים כלום מה תרגולים שלו, רק מבלבל \n\nשעורי הבית: מבולגנים, תמיד יש טעויות ואז מתקנים וזה ממש בלאגן\n\nהמבחן: פייר ממש\n\nהשורה התחתונה: מומלץץץ אבל רק עם דוד!!", "timestamp": 1659082077807}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דויד אייזנברג\nחוות דעת - הרצאות:  מרצה מצוין ומעניין. מעביר את השיעורים באווירה טובה עם הרבה דוגמאות מעניינות, יחס אישי ונעים.\n\nשם המתרגל/ת: אמיר אילן\nחוות דעת - תרגולים: תרגולים לא מסודרים ולא ברורים בלשון המעטה. שעה של חוסר אונים.\nיצוין לטובה הרצון הטוב וההשקעה של אמיר במתן שעות קבלה אישיות וגמישות, ומענה מהיר במייל לכל שאלה.\n\nשעורי הבית: הדבר הכי נורא שיצא לי לעשות השנה וכל זה בשביל נקודה בודדת לציון הסופי. אין שום קשר בין התרגולים (שגם ככה לא ברורים) לבין שיעורי הבית. \nלא היה גליון אחד שלא הייתה בו איזשהי טעות שתיקנו בדקה ה 90 ולפעמים גם בלי להודיע, וזאת בנוסף לניסוחים לא ברורים.\n\nהמבחן: בניגוד לחרדה שעושים שיעורי הבית, המבחן הרבה יותר הוגן ופתיר. \n\nהשורה התחתונה: תעבדו צמוד עם הספר המצוין של הקורס והפתרונות של התרגולים - ותצליחו. במבט לאחור הטראומה של שיעורי הבית לא שווה את הנקודה הבודדת שזה הוסיף לציון הסופי - לא להתרגש יותר מדי.", "timestamp": 1659433225831}, {"author": "1", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: דוד מרצה מדהים, כיף ללמוד איתו, הוא מעביר את החומר בצורה מעניינת ונעימה. אחד המרצים המוערכים והטובים שיש. \n\nשם המתרגל/ת: אמיר אילן\nחוות דעת - תרגולים: אמיר מתרגל מעולה! ניכר שאכפת לו מהסטודנטים ותמיד שמח לעשות שעות קבלה ולעזור כמה שיותר בהבנת החומר. אישית אמיר עשה לי סדר בחומר וממש עזר (: \n\nשעורי הבית: רובם די קשוחים ולא פשוטים\nהמבחן: הוגן לחלוטין", "timestamp": 1666653426694}, {"author": "iGGor", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דוד המלך\nחוות דעת - הרצאות: \nאחד המרצים הטובים בפקולטה לכימיה, אם לא בטכניון. מעביר את השיעורים בצורה דינמית ומעניינת ומנסה לערב סטודנטים ולעורר את הסקרנות. מאוד פייר ומתחשב בסטודנטים. החיסרון היחיד ההוא שהתבטלו מלא שיעורים, בין אם בגלל שביתת המרצים או ימי מחלה של דוד ולכן הלימודים לא היו רציפים.\n\nשם המתרגל/ת: אריאל (לייפר)\nחוות דעת - תרגולים: \nבן אדם טוב ודי נחמד אבל בגלל שזאת פעם ראשונה שלו בקורס הורגש שהוא מתבלבל בתרגולים וטיפה מתעכב על מיקרו-תסביכים בפתרון השאלות. התרגולים עצמם ממוחזרים ולי אישית הרגישו די מסובכים. כמו גם, רוב הסמסטר הייתה רק שעה אחת של תרגול וזה בקושי הספיק. ואם זה לא מספיק הייתה את השביתה שחיראה לגמרי את סדר התרגולים וזה יצר בלאגן. אבל סה\"כ התרגולים לא היו גרועים.\n\nשעורי הבית: \nמתוך n גליונות חובה לעשות n-1 כדי לגשת למבחן. לנו היו 4 סהכ בגלל השביתה. הגליונות ממוחזרים ויש פתרונות רשמיים ישנים אבל זאת מלכודת לתפוס העתקות ככה שאם רוצים להיעזר במשהו עדיף לשאול סטודנטים אחרים, כי דוד *מאוד* קשוח לגבי העתקות. ממה שהוא סיפר,הוא פסל ל-3 סטודנטיות את הקורס בשנים קודמות בגלל העתקות בשיעורי בית.\n\nהגליונות עצמם לא קלים, והניסוחים יכולים להיות מבלבלים, אבל עדיין פתירים אם יושבים עליהם כמה שעות. אה, והגליונות בכתב יד.\n\nהמבחן: לא היה עדיין, אבל מהשמועות דוד מאוד פייר במבחנים. הוא אפילו מפרסם מבחן דמה שהרמה שלו זהה (כביכול) למבחן האמיתי. אני אישית בונה על דוד שיהיה נחמד במבחן כמו שהוא היה נחמד כל הסמסטר.\n\nהשורה התחתונה: קורס לא קל אבל מעניין, במיוחד אם דוד מרצה. הוא בכל מקרה קורס חובה שהוא קדם למעבדה באנליטית 1, ושם באמת קשה ממה ששמעתי.", "timestamp": 1688466831682}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: המרצה הכי טוב בכימיה. חד משמעית. מלמד עם תשוקה ורצון שנבין.\n\nשם המתרגל/ת: אריאל לייפר\nחוות דעת - תרגולים: פעם ראשונה שמתרגל את הקורס, אז לפעמים היה מתעכב על פרטים קטנים. למרות זאת, ראיתי שהוא רוצה שנבין והיה לו חשוב שהכול יהיה ברור.\n\nשעורי הבית: גליונות הגשה ידניים, לא. לרפרנס. בשום. אופן!! \nיש רפרנסים, אבל הם ממולכדים, ועולים על זה מאוד בקלות. גם דוד וגם אריאל מאוד(!) נוקשים לגבי העתקות.\n\nהמבחן: ארוך, מסובך ולא ברור. היה פקטור של 5 נקודות ובדיקה מאוד מאוד מרחמת.\n\nהשורה התחתונה: קורס מעניין, צריך להשקיע המון כדי להצליח.", "timestamp": 1690806914167}, {"author": "שעון קיר בכימיה 4", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: פרופ.ח דוד אייזנברג\nחוות דעת - הרצאות: \nמרצה מעולה. לכל נושא שאנחנו לומדים הוא נותן כמה וכמה דוגמאות פרקטיות שקשורות בין היתר למעבדה באנליטית 1 שעושים אחרי הקורס. יודע להסביר מצוין ובהרחבה אבל לפעמים קצת מבולגן. \n\nשם המתרגל/ת: אריאל לייפר\nחוות דעת - תרגולים: \nאריאל פעם ראשונה מתרגל את הקורס ככה שיש דברים שכדאי לשפר אבל חוץ מזה הוא די נחמד וזמין במייל לשאלות. \n\nשעורי הבית: \nגליונות בכתב יד. כל אחד יכול לקחת בין 3 שעות ליומיים (זה הזמן שלקח לי) אבל סה\"כ לא קשים יתר על המידה. מה שכן ממש לא מומלץ לרפרנס כי אם יתפסו אותכם (והם תופסים אנשים) יש מצב שתצטרכו לחזור על הקורס.\n\nהמבחן: \nבניגוד למבחנים הקודמים של דוד, והמועד לדוגמא שהוא פרסם- זוועת עולם. אם לא היו מפקטרים הממוצע היה לפחות ב-10 נקודות נמוך יותר. מה שכן דוד מאוד הוגן ככה שהיה פקטור יחסית נדיב ובדיקה מקלה מאוד.\n\nהשורה התחתונה: \nקורס מעניין אבל קשוח, מומלץ לקחת גם אם זה קורס בחירה, והסגל מצויין.", "timestamp": 1690812052488}, {"author": "נעה", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דוד \nחוות דעת - הרצאות: ההרצאות עם דוד היו מעניינות ומעשירות אבל הוא העביר את החומר בצורה קצת מבולגנת והיה קשה להבין בסוף מה צריך לדעת למבחן.  \n\nשם המתרגל/ת: אריאל\nחוות דעת - תרגולים: לאריאל יש כוונות טובות אבל הרגיש שהוא לא בטוח בעצמו איך לפתור את השאלות, מצאנו המון פעמים טעויות בפתרון והתעכבנו על שטויות וזה הגיע למצב שלא תרגלנו נושאים עד הסוף. \n\nשעורי הבית: לא פשוטים, אם עושים אותם לבד ולא נעזרים ברפרנסים זה יכול לקחת לא מעט זמן אבל זה ממש חשוב למבחן כי אריאל בודק את כל התרגיל בית (ולא מדגם של שאלות) וכותב הערות חשובות שאפשר ללמוד מהן למבחן. \n\nהמבחן: המבחן היה מאוד קשה אבל ביטלו שאלה אחת ונתנו פקטור, בסוף רוב הכיתה עברה וחלק גדול גם הוציאו ציונים טובים.\n\nהשורה התחתונה: קורס מעניין עם סגל אכפתי, בתכלס מבינים באמת על מה דיברנו בקורס רק אחרי המעבדה שלו.", "timestamp": 1695188166872}]}