{"posts": [{"author": "עמית", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: מעניינות עם הרבה פרטים איזוטריים שיכולים להופיע במבחן.\n\nשם המתרגל/ת: אליהו\nחוות דעת - תרגולים: לא היה סנכרון מלא בין התרגולים להרצאות. תרגולים סבירים\n\nשעורי הבית: לא קשים, לא דורשים הרבה זמן. מכסים את רוב החומר שבתרגול והרצאה ומטמיעים לרוב את העקרונות החשובים של הקורס.\n\nהמבחן: עשר שאלות נכון לא נכון עם נימוק. הרוב בנוגע לעקרונות בסיסיים שמי שלמד בקורס יודע. שתיים שלוש שאלות קצת מונפצות על פרטים איזוטריים שצריך לזכור מהרצאה.\n\nהשורה התחתונה: קורס נחמד לא עמוס ולא קשה. מלא בכללי אצבע לגבי התנהגויות אטומים בטבלה המחזורית.", "timestamp": 1616066631043}, {"author": "itay amzalag", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: מעולות!\n\nשם המתרגל/ת: אליהו פרבר\nחוות דעת - תרגולים: סבירים\n\nשעורי הבית: בינוניים\n\nהמבחן: בינוני\n\nהשורה התחתונה: קורס קליל ומעניין", "timestamp": 1616304371151}, {"author": "HOMO-LUMO", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: מרצה מדהים, מאוד אכפת לו מהסטודנטים. ההרצאות מעניינות ומלאות בסיפורים מהחיים- ובהסברים בנפנופי ידיים.\n\nשם המתרגל/ת: אליהו פרבר\nחוות דעת - תרגולים: סבירים מינוס. לדעתי לא הסביר מספיק את צורת החשיבה הדרושה אלא בעיקר נתן את התשובה, אבל עדיין חשוב מאוד להקשיב כי לומדים חומר חדש בתרגולים.\n\nשעורי הבית: אפשר לפתור מהר ואפשר לנסות להבין לעומק ואז זה יכול לקחת המון זמן- אבל הבנה של החומר במהלך פתרון הש.ב יכולה לעזור במהלך הלימוד למבחן.\n\nהמבחן: אם יודעים את החומר *לגמרי*-אין סיבה לא להצליח. חשוב לדעת ולהבין את כל הפרטים הקטנים מההרצאות והתרגולים, ולהראות \"חשיבה כימאית\".\n\nהשורה התחתונה: תתכוננו להמון נפנופי ידיים :)", "timestamp": 1616438357786}, {"author": "אני", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: זאב גרוס\nחוות דעת - הרצאות: נוראי. לא מעביר את החומר בכלל, ההרצאות בנויות מאנקדוטות שלא קשורות לחומר ושאלות חסרות מענה. מאחל לכל מי שלוקח את הקורס ללמוד אותו תחת דוד אייזנברג ולא תחת זאב.\n\nשם המתרגל/ת: שירי מעוז\nחוות דעת - תרגולים: לא יודעת את החומר וזה ניכר! לא עונה על שאלות בצורה ברורה ולא נותנת תשובה חד משמעית, בודקת בחינות וגיליונות בצורה שאם התשובה שנכתבה לא מוצאת חן בעיניה היא תוריד את כל הניקוד. נוראית נוראית נוראית!\n\nשעורי הבית: קלילים, אבל אם שירי בודקת אותם הציונים יהיו נמוכים בכל מקרה.\n\nהמבחן: עוד לא היה אבל זאב המרצה אז אי אפשר לצפות למשהו טוב.\n\nהשורה התחתונה: קחו את הקורס רק עם אייזנברג!!! הקורס עצמו מעניין אבל זאב ושירי זה הצוות קורס הכי נורא שיש:(", "timestamp": 1644388487407}, {"author": "פאולי", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: זאב גרוס\nחוות דעת - הרצאות: \nיותר עסוק במסביב מאשר בתכלס, מבלה את רוב זמן ההרצאה בסיפורים על שטויות ודברים שלא רלוונטיים לקורס ולחומר, הוא מסביר לא טוב בעיניי והרמה של הקורס קפצה פי 3 לעומת עם אייזנברג.\nשם המתרגל/ת: שירי מעוז\nחוות דעת - תרגולים: \nמתרגלת לא טובה, תשובות מאוד פשוטות או לא ברורות לשאלות שנשאלה, תרגולים די מיותרים מאחר והמבחן בנוי ברמה הרבה יותר גבוה ולא קשורה לחלוטין למה שהועבר.\nשעורי הבית: \nלא קשים מאוד אבל נבדקים בצורה מאוד מאוד קפדנית ויש הורדת נקודות על דברים כמו ''ביבליוגרפיה'' .\n\nהמבחן: \nהיה בוחן באמצע הסמסטר שהיה מזוויע, מבחן מאוד מאוד קל עם הורדת נקודות מאסיבית על שטויות, גם אם רשמת תשובה נכונה אבל לא זאת שכיוונו אלה קיבלת הורדת נקודות כמעט מלאה.\nהמבחן עצמו היה לא פשוט, ולא הרגיש קשר בין התרגולים למבחן, תרגולים ברמה 1 ומבחן ברמה 10.\nלא הועלו מבחנים לדוגמא של זאב אלא רק של דוד שהחומר שהוא העביר שונה מהותית .\n\nהשורה התחתונה: \nלא לעשות את הקורס הזה עם זאב בשום מצב.\nלחכות שדוד יעביר אותו, גם הרבה יותר מעניין וגם הרבה יותר מפרגן.\nעם זאב גם ככה צריך להתמודד בביו אי אורגנית...", "timestamp": 1647002454461}, {"author": "אלין אסרף", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: \nדוד מדהים כל כך, הוא המרצה הכי טוב בפקולטה! כיף ללמוד איתו, הוא מעביר את החומר בצורה מעניינת עם סיפורים מרתקים. נהנתי מאד מההרצאות וזה אחד הקורסים היפים לדעתי! \nשם המתרגל/ת: ענבל אופן\nחוות דעת - תרגולים: \nענבל מתרגלת ממש טובה, מסבירה טוב ואכפת לה שכולם יבינו את החומר. התרגולים היו קלילים ומעניינים.\nשעורי הבית: הוגנים, משקפים את החומר הנלמד בהרצאות ובתרגולים \n\nהמבחן: הוגן מאד ומשקף את החומר הנלמד גם בהרצאות וגם בתרגולים (ההרצאות חשובות למבחן כי יש דברים שנלמדו רק בהרצאות ולא בתרגולים) \n\nהשורה התחתונה: קורס מעניין ויפה, מומלץ", "timestamp": 1677201448965}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד\nחוות דעת - הרצאות: המרצה הכי טוב בכל הטכניון, כמעט הוא היחידי שבאמת אכפת לו מהסטונדטים וההרצאות שלו מאוד ברורות וכייפיות והוא גם מקליט ומפרסם ההקלטות במודל.\n\nשם המתרגל/ת: ענבל\nחוות דעת - תרגולים:  סופר נחמדה ומסבירה את החומר בצורה מדהימה והיא גם מקליטה.\n\nשעורי הבית: יש כ 10 שב שצריך להגיש לפחות 7 והם ממש סבבה.\n\nהמבחן: לדעתי הוגן, שאל בדיוק על מה שלמדנו בכיתה והבדיקה הייתה מפרגנת.\n\nהשורה התחתונה: הקורס הזה מאוד תלוי בסגל, מומלץ מאוד לקחת עם דוד, הלוואי היו כל המרצים והמתרגלים כמו דוד וענבל.", "timestamp": 1677228195918}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד איינזברג\nחוות דעת - הרצאות: מעניין מאוד! קליל וכייף\n\nשם המתרגל/ת: ענבל אופן\nחוות דעת - תרגולים: תמציתיים ומעבירים את המסר. חשוב לעבור על ההרצאות לפני כדי להיות בלופ\n\nשעורי הבית: קלילים\n\nהמבחן: לנו הוא עשה 10 שאלות של נכון לא נכון, אפשר לסיים אותו בשעה, אבל לא לחפף\n\nהשורה התחתונה:", "timestamp": 1677672909001}, {"author": "1", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: \nהרצאות טובות. חשוב לבוא כי יש מידע שמועבר בכיתה ולא נכתב במצגת.\nשם המתרגל/ת: ענבל אופן\nחוות דעת - תרגולים: \nמתרגלת טובה. רואים שהיא באה מוכנה לתרגולים. \nשעורי הבית: \nיחסית פשוטים, אבל כדאי לעשות אותם.\nהמבחן: \nעוד לא היה.\nהשורה התחתונה: קורס נחמד.", "timestamp": 1713196146436}, {"author": "Ilya Katz", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: הרצאות מעניינות וקלילות, נראה שדוד מאוד אוהב ללמד ועושה את זה טוב מאוד!\n\nשם המתרגל/ת: ענבל אופן\nחוות דעת - תרגולים: תרגולים קצרים וממוקדים. ענבל ממש נחמדה, יודעת על מה לתת דגש בתרגולים.\n\nשעורי הבית: 11 גליונות פתוחים, מתוכם חייבים להגיש לפחות 7. חלק מהגליונות קלים, חלק קצת פחות. לכל גיליון יש שבוע להגשה. בדיקה הוגנת\n\nהמבחן: 10 שאלות נכון/לא נכון עם נימוק קצר. הרוב יסיימו תוך שעה וקצת, אם לא מחרטטים.\n\nהשורה התחתונה: קורס מעניין ומעשיר על הטבלה המחזורית. אין על דוד וענבל!", "timestamp": 1715188002167}, {"author": "מגיב קואורדנטיבי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דוד אייזנברג\nחוות דעת - הרצאות: \nמרצה מעולה!  בבירור אוהב ללמד וגם מלמד טוב. תמיד נותן דוגמות מגניבות על החומר הנלמד בכיתה\n\nשם המתרגל/ת: ענבל אופן\nחוות דעת - תרגולים: תרגולים נהדרים, קצרים יחסית, אבל מראים איך לחשוב על החומר\n\nשעורי הבית: ברובם סבבה, פעם ב היו שאלות על תגובות ספציפיות שפשוט לא היה לי מושג איך לגשת אליהן\n\nהמבחן: מבחן מאוד הוגן, 10 שאלות נכון/לא נכון כולל פירוט, שאמור לבחון הבנה ויכולת חשיבה כימית.\n\nהשורה התחתונה: קורס מעניין. בתכלס, מרגיש קצת כמו פיתוח יכולת חיטוט כי כימאים לא באמת מבינים איך תגובות עובדות אז מלמדים אותך לראות תוצאה ולנסות להסביר למה היא קרתה", "timestamp": 1716319044421}]}