{"posts": [{"author": "מוווווווווווווווווווווווווווווווות", "difficultyRank": 1, "generalRank": 1, "semester": "201902", "text": "שעורי הבית: \nאין למה?\nהמבחן: \nנוראי\nהשורה התחתונה:  תהרגו אתי זה קורס של עברת קברת", "timestamp": 1598168334690}, {"author": "דשגשד", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אשר שמידט\nחוות דעת - הרצאות: מקריא מדפים שלו, קצת מיותר אבל מעביר את השיעור בחינניות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין שיעורים\n\nהמבחן: בינוני\n\nהשורה התחתונה: קורס טכני יחסית, למידה כל הסמסטר + 3-4 ימי למידה לפני המבחן אמורים להספיק.", "timestamp": 1599662782170}, {"author": "י.י", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אשר שמידט\nחוות דעת - הרצאות: צפיתי בהקלטות במהירות x2. אשר מרצה מצוין אך השעה בה התנהל הקורס הייתה קשה מאוד.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: מיותרת\n\nשעורי הבית: אין\n\nהמבחן: חצי ממוחזר\n\nהשורה התחתונה: קורס מיותר שלא חידש יותר מדי.", "timestamp": 1626092816151}, {"author": "כימיהההה", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אשר שמידט\nחוות דעת - הרצאות: הרצאות מעולות, מעניינות מאוד. מאוד אכפת לו מהסטודנטים, אין דבר כזה שאלה לא טובה! הוא עונה בכיף ובהרחבה על הכל.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: תרגולים טובים מאוד, נהנתי בתרגולים, המתרגלת יודעת את החומר ומסייעת מאוד בהבנתו. אפשר לשאול בתרגול כל שאלה, היא מסייעת הרבה גם מייל לאחר התרגול.\n\nשעורי הבית: בעיקרון שיעורי הבית לא חובה אבל מומלץ מאוד לעשות כדי לתרגל את החומר הנלמד בקורס.\n\nהמבחן:  המבחן היה הוגן מאוד. חלק מהמבחן ממוחזר.\n\nהשורה התחתונה: קורס מעניין מאוד, אם משקיעים אפשר להוציא ציונים טובים.", "timestamp": 1634898237550}, {"author": "הרמ", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אשר שמידט\nחוות דעת - הרצאות: \nוואלה אחד המרצים הנדירים\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nלא ברור איך הגיעה להיות מתרגלת, כל הזמן רק מתחכמת ונראה שלא פתרה את התרגולים לפני ולא אסרטיבית\n\nשעורי הבית: אין\n\nהמבחן: וואלה היה קשה רצח זה כאילו ניסו לרפרנס אבל להיות מקוריים זה אחד הלא פתירים לא ברור מה הקטע להתעלל ככה\n\nהשורה התחתונה:", "timestamp": 1659084277945}, {"author": "(;", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אשר\nחוות דעת - הרצאות: לא הייתי, נראה שלא פספסתי יותר מידי\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: יחסית מסודרת ומקצועית, אבל כן יש מקום לשיפור מבחינת הנגשת החומר לסטודנטים. אישית ראיתי את ההקלטות שלה משנים קודמות ועבד יותר טוב מפרונטלית לדעתי.\n\nשעורי הבית: אין באמת.\nיש גיליונות שמפורסמים במודל אבל אין עליהם משוב ולכן הרוב לא עושים. \n\nהמבחן: די ממוחזר ורוב השאלות לא קשות במיוחד. \n\nהשורה התחתונה: החומר יחסית מעניין וגם לא מורכב במיוחד, המבחן ממוחזר והצוות בסדר גמור. קל מאוד להתעלם מקיום הקורס הזה במהלך הסמסטר, אבל מהניסיון שלי אפשר להצליח גם עם כמה ימי למידה בודדים.", "timestamp": 1659448377659}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אין לי מושג\nחוות דעת - הרצאות: לא יודעת לא הלכתי, נראה שלא הפסדתי הרבה\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: נטע הייתה המתרגלת שלנו גם בקורס יסודות ואז פחות התחברתי, אבלל בקורס הזה היא פשוט הייתה מדהימה!! השתפרה מאוד, מאוד מסודרת ועוזרת המון במייל ובשעות קבלה. לרוב היא עוברת מהר על ההרצאה בתחילת התרגול וזה ממש עוזר להבין את החומר\n\nשעורי הבית: מעצבנים אבל עוזרים להבין את החומר", "timestamp": 1687900616182}, {"author": "is", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אהרון בלאנק\nחוות דעת - הרצאות: הגעתי להרצאה הראשונה שהייתה סבבה ואהרון היה נראה חביב ומצחיק אבל בהרצאה השניה הוא התחיל לעשות מלא פיתוחים הזויים אז עזבתי\n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: נטע ממש חמודה וממש משתדלת להסביר עד שמבינים \n\nשעורי הבית: הסמסטר פעם ראשונה שהיו שיעורי בית אז היו הרבה תקלות אבל נטע פתחה פורום שבו היא עונה על שאלות מהשיעורי בית והיא עונה ממש מהר ומתקנת את התקלות כשצריך\nהשיעורי בית ממש ממש מקדרים וגם לא באמת עזרו למבחן כי במבחן היו שאלות הזויות\n\nהמבחן: המבחן היה הזוי לחלוטין\nהיו 2 שאלות סך 45 נקודות שהיו יחסית רגילות אבל עדיין לא פשוטות\nוהיו עוד 2 שאלות שאהרון כתב סך 55 נקודות, שהיו פשוט בלתי פתירות \nאחת השאלות הייתה תרמודינמיקה סטטיסטית ולא פתירה ובקורס של תרמוס יש לפחות חומר פתוח, במבחן הזה אהרון החליט להוריד 6 מתוך 10 דפי נוסחאות והקשה את המבחן פי 300 בערך\nוהייתה עוד שאלה עוד יותר הזויה שלא היה אפשר לפתור בכלל לא משנה כמה דפי נוסחאות הינו מביאים\nלא היה אפשר לעבור את המבחן הזה\n\nהשורה התחתונה: אחרי שהתחלף מרצה הקורס הפך למזעזע", "timestamp": 1695373210743}]}