{"posts": [{"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202103", "text": "בסמסטר קיץ היו לנו 10 ניסויים (הורידו את ניסוי בדיקת מים). סך הכל היה ממש סבבה, המדריכים היו ממש נחמדים ובעיקר נתנו לנו לעבוד על השיטות השונות, מדי פעם עזרו או הכווינו.\n\nבתחילת כל מעבדה יש בוחן, לא קשה יותר מדי, כמעט תמיד יש שאלה שצריך לזכור בה את התגובות העיקריות, ולפעמים יש גם שאלות על השיטות בהן משתמשים בניסוי.\n\nהדוחות עצמם די סבירים, חשוב ממש לדייק בחישובים, כי בעיקר מורידים נקודות על חישוב שגוי.", "timestamp": 1663663320203}, {"author": "שלומקה", "difficultyRank": 5, "generalRank": 2, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: בחני כניסה די קשים למדתי אליהם כמה שעות\nהמעבדות עצמן לא ממש קשות אבל ארוכות ומלא מלא טיטרציות נוראיות \nהדוחות יחסית סבבה", "timestamp": 1666467341107}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "צריך ללמוד טוב לבחנים, לרוב יש שם שאלות שרק מקריאה בפרוטוקול אי אפשר לענות. כדי להסתכל על השאלות בדרייב.\n\nהמעבדות עצמן סבירות, כנל הדוחות\n\nהמריכים אחלה", "timestamp": 1673799876704}, {"author": "ins", "difficultyRank": 4, "generalRank": 1, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: המעבדה ממש קשה פיזית, מי שלא יודע טוב אנליטית הבחני כניסה יהיו לו קשים, הדוחות די סבבה", "timestamp": 1684747961610}, {"author": "א", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "איריס: חושבת שהיא מ\"כית טירונים, חוץ מלנסות להפחיד סטודנטים לא תרמה בכלום\nמדריכים: \nחוות דעת : \nפשוט בזיון, כל אחד נותן ציון איך שבא לו.\nממש חסרי פרופורציה, מרגיש שעושים תחרות מי יותר קשוח ושנוא על ידיי סטודנטים\nלדוגמא: אחד המדריכים נתן בוחן אמצע עם שאלה של 20 נק שאף אחד לא הצליח לפתור חוץ ממישהי אחת, המדריך היה ככ מופתע ואמר לה \"איך הצלחת?\"- כאילו וואטדפאק \n\nהשורה התחתונה: חרא של קורס, סבלתי מכל רגע כולם שם הזויים", "timestamp": 1690209604994}, {"author": "כימאי למחצה", "difficultyRank": 4, "generalRank": 3, "semester": "202203", "text": "חוות דעת - מעבדות: \nיש סה\"כ 11 ניסוים (בקיץ 10), מתוכם 2 \"ניסויי מבוא\" שכולם עושים ביחד ואז מתחלקים לקבוצות כך שסדר הניסויים משתנה מקבוצה לקבוצה. המעבדות עצמן סבירות ברובן- יש אחת או שתיים שדורשות מאמץ מעבר לרגיל אבל חוץ מזה בדרך כלל מסיימים אפילו לפני הזמן. בכל מעבדה דורשים למצוא ריכוז של נעלם כלשהו. הקבוצות קטנות אבל בד\"כ יוצא שיש שתי קבוצות על מדריך וזה טיפה מקשה. מה שכן מאוד מאוד חשוב להקפיד על דיוק כי בניגוד ליסודות א\\ב פה עד ל-0.5 או 0.8 אחוז שגיאה נחשב סביר. ובכללי אם יוצאת סטיה גדולה מהנעלם יכולים להוריד הרבה מאוד נקודות (לפעמים יותר מ-50 רק על זה).\n\nחוות דעת - צוות:\nבניגוד ליסודות א\\ב הצוות של המעבדה ממש נחמד. את איריס כמעט לא פגשנו ובד\"כ פונים לטכנאים או למדריכים. המדריכות שלנו היו לרוב נחמדות ככה שלא היו בעיות מיוחדות... \n\nהדוחות: \nעובדים עם אותו מבנה קבוע של דוח ככה שאפשר לקצר תהליכים ולסיים דוח בערך ב-6 שעות עבודה, אם עובדים יעיל. הדוחות בד\"כ יוצאים לא יותר מ-15 עמודים כולל נספחים והכל...\nכפי שנאמר- רוב הציון זה על המרחק של התוצאה שלך מהריכוז האמיתי של הנעלם (שלא יודעים אותו) ככה שבתכלס גם אם הדו\"ח שלך היה רשום ברמה של דוקטורט אבל קיבלת תוצאה גרועה אתה תקבל 30 נקודות פחות, לפחות.\n\nבחני כניסה:\nאם יש משהו שמונע מאנשים לקבל מעל 95 במעבדה הזאת אלה הבחני כניסה. לכל בחן לוקח כמה שעות ללמוד וצריך לעשות סקירה מאודד מקיפה על החומר. גם במעבדות האחרונות כשכבר ידענו איך ללמוד היו כל מיני שאלות בעייתיות שאתה לא יודע איך לגשת אליהן. מי שנכשל בבוחן- לא נכנס למעבדה ומקבל אוטומטית 0 על הדוח והערכת המדריך בניסוי הספציפי .\n\nהשורה התחתונה: \nקורס מתיש (במיוחד בקיץ) נטו בגלל שני דברים: בחני הכניסה והדרישה לדיוק (למרות שעובדים בשיטות יחסית פרימיטיביות. הדיוק האמיתי הוא באנליטית 2). מומלץ לעשות רק בקיץ בגלל ניסוי 11.", "timestamp": 1694013978545}, {"author": "נעה", "difficultyRank": 3, "generalRank": 4, "semester": "202203", "text": "מעבדות : מתחלקים לקבוצות של 3 או 4 וכל קבוצה מבצעת את המעבדות בסדר אחר. המעבדות לא קשות מאוד פיזית אבל זה כן סביבת עבוד חדשה שצריך להתרגל אליה ולא נחשפנו אליה במעבדה של יסודות. בתכלס ברוב המעבדות מקבלים נעלם והמטרה שלנו היא למצוא את ריכוז שלו בצורה המדוייקת על ידי שיטה ספציפית שמגדירים לנו. הם מאוד רציניים סביב זיוף תוצאות, מבקשים שנכתוב את כל הנתונים שקיבלנו במחברת מעבדה והם חותמים עליה.\n\nמדריכות : המדריכות יחסית אחלה, מפרגנות בהערכת מדריך ובדוחות כמה שהן יכולות (הציון מושפע מאוד מהקרבה לריכוז הנעלם אז לא תמיד יש להן איך לעזור אם הריכוז שחושב שונה מאוד מהריכוז בפועל). \n\nדוחות : חוץ מכמה דוחות ספציפיים שבהם מבקשים לענות על שאלות מעצבנות (4 ו8 אם אני לא טועה) רוב הדוחות מאוד ישירים, רקע תיאורטי מאוד בסיסי, תוצאות ומסקנות בקטנה, דוח יכול לצאת 5-6 עמודים ולא דורש המון זמן (אני הצלחתי לסיים חלק מהדוחות עוד באותו היום של המעבדה). \n\nבחנים : הבחנים לא פשוטים מאוד אבל גם לא מאוד קשים, אני לא חושבת שהיה במעבדה שלנו מקרה של מישהו שלא נכנס למעבדה כי לא עבר את הבוחן. צריך לזכור בעל פה את דרך החישוב שנבצע אחר כך בדוח, מה הסיבה להוספה של כל חומר לניסוי ותגובות רלוונטיות. \n\nסגל מעבדה : איריס, יפה, רוני ופיני פשוט מדהימים, יחסית לסגל של המעבדה ביסודות שלפעמים היה מאוד לא נעים הסגל פה אכפתי ועוזר בכל בעיה.\n\nשורה תחתונה : אחלה מעבדה, קצת קשוח לעשות בקיץ (כל החומר של כל המעבדות מתערבב בראש כי צריך ללמוד ל2 מעבדות בשבוע) אבל זה ממש אפשרי.", "timestamp": 1695189219295}]}