{"posts": [{"author": "יהיה בסדר", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: נעם אדיר \nחוות דעת - הרצאות: מאוד מונוטוני ותיאורטי. לי אישית היה ממש קשה לשמור על הריכוז. ההרצאות הרגישו יותר כמו קורס בהיסטוריה של הכימיה, מה שיצר פער מטורף בין ההרצאה לתרגול. חוץ מזה ההתרשמות שלי מנעם הייתה שהוא אחלה בן אדם, אבל לא אהבתי את צורת הלימוד שלו.\n\nשם המתרגל/ת: נטע כספין \nחוות דעת - תרגולים: לא טוב. לא בטוח שזאת אשמתה של נטע (כי שוב לדעתי לא באמת למדנו משהו בהרצאה עצמה) אבל כמעט כל תרגול מחדש הייתה תחושה שחצי כיתה לא איתה. \nיאמר לזכותה שהיא כן הייתה זמינה לשאלות ועזרה במייל, והתרגולים שלה התנהלו בצורה מסודרת יחסית.\n\nשעורי הבית: \nגיליון אחת לשבוע (לפעמים נטע פינקה בשניים).\nחלקם לקחו חצי שעה וחלקם חצי שבוע, תלוי בנושא. שאלות מעצבנות שברובן יותר קשות מרמת המבחן.\n\nהמבחן: \nדי קשה. הממוצע היה די נמוך. כן היו יחסית פיירים בבדיקה ונתנו נקודות על תשובות לא נכונות בכמה שאלות מתקילות בהגזמה.\n\nהשורה התחתונה: \nקצת מבאס שזו הייתה ההתנהלות בקורס שאלה שלוקחים אותו צריכים את הרקע הכי חזק בכימיה בטכניון. הרגיש מהצד שבקורס המקביל יסודות הכימיה המצב בהרבה יותר טוב. \nאצלנו פתחו פקל מיוחד באמצע הסמסטר, ואירגנו לנו דוקטורנטית שתעשה שעת קבלה שבועית, ככה שכל הסגל היה מודע למצב הקורס, ועדיין התקילו במבחן שלדעתי קשה יותר מהמועדים האחרונים.\nבלי קשר מרגיש שההשקעה בקורס שווה יותר מ3 נקז, וזה עוד לפני שהתחלנו לדבר על מעבדות..", "timestamp": 1645352035546}, {"author": "אביעד בר שי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רננה פורן- גרשוני\nחוות דעת - הרצאות: כאדם היא מקסימה אבל פחות התחברתי אליה כמרצה. הייתה תחושה חזקה של אי סדר בנושאים ולא מספיק הוסבר על הקשר ביניהם (קצת כאילו הקורס קורה בחנות מכולת שמקבלים קצת מכל דבר בנפרד). והייתי מצפה שיהיה יותר דגש על זה בקורס שכל מי שלוקח אותו לומד לתואר בכימיה כזו או אחרת ובהגדרה זה לא קורס שאמור להצריך ידע קודם בכימיה אבל בפועל זה ממש לא היה ככה.\n\nשם המתרגל/ת:  גיא לוצקי\nחוות דעת - תרגולים: מעולה. אם אתם יכולים לבחור- לכו אליו. הוא מסביר נהדר גם את התיאוריה וגם את הדרך לגשת אל התרגילים בנושא בצורה מעניינת ומובנת וגם משתף את הסטודנטים במהלך של הפתרון וזה מאוד תורם להבנה ולריכוז\n\nשעורי הבית: קצת מציק שיש טעויות שהתשובה לא מספיק מעוגלת אבל חוץ מזה שיעורי בית די קלים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676564472077}, {"author": "iGGor", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ד\"ר רננה פורן-גרשוני\nחוות דעת - הרצאות: סך הכל מרצה מעולה ובן אדם מעולה. ביחס למי שהיו בעבר היה שיפור משמעותי, לפחות ממה שהבנתי. רננה באה עם מצגות משלה ולא ממחזרת חומר מאוס ולא רלוונטי וזה כבר בונוס כי זה מאוד עזר לנו להתמקד בלמידה למבחן. כמו כן, היא ניסתה להעביר את ההרצאות בדרך הכי מעניינת שאפשר וגם אם לא תמיד זה עבד זה עדיין היה נחמד. מה שכן, בחלק מההרצאות ובמיוחד בתחילת-אמצע הסמסטר היא ממש רצה על החומר בגלל חוסר זמן אבל זאת לא אשמתה כי באמת יש הרבה נושאים להספיק ומעט מאוד זמן. רננה באה בגישה של לעניין אותנו ולא סתם להעביר את החומר וזה הקל מאוד על רבים שלא כל כך הבינו את הנושאים. כמו כן, היא ממש באה לקראת הסטודנטים ורואים את זה בשעות קבלה, במבחן ובהכנה אליו.\n\nשם המתרגלים: נטע כספין וגיא לוצקי\nחוות דעת - תרגולים: בהתחלה היו רק את התרגולים של נטע והם היו לא משהו אבל לא בגלל נטע אלא בגלל שהקבוצה הייתה מאוד גדולה ביחס לתרגול- כל הקורס, 50+ איש על מתרגלת אחת וזה העיק מאוד כי היו הרבה שאלות, חלקן לא רלוונטיות לגמרי או מיותרות וזה הקשה על התרגולים, אבל שוב זאת לא אשמתה של נטע.\nכשהוסיפו את גיא המצב השתפר כי יכולנו להתחלק לשניים והתרגול הפך לפרטני יותר. גם גיא היה מאוד נחמד ולא התעכב על שטויות ובאמת שהעביר את התרגול בצורה חוויתית ואפקטיבית, וגם לנטע היה קל יותר. בקיצור שני המתרגלים היו מצוינים ומאוד נחמדים כלפי סטודנטים וכמו המרצה גם הם באו מאוד לקראתנו.\n\nשעורי הבית: 15 גליונות, מתוכם 10 חובה וה-2 האחרונים נטו בשביל חזרה למבחן. יש גליונות של 20 דקות גג ויש של כמה ימים, אבל הגליונות הם לא הבעיה העיקרית אלא המעבדות.\n\nמעבדות: שתי מעבדות, כל אחת עם בוחן כניסה מעצבן של 20 דקות ואז 6 שעות על הרגליים, מלא לחץ, צעקות מגבריאלה (אחראית המעבדה) על שטויות וזה עוד החלק הקל. אחר כך צריך לכתוב דוח של 20-30 עמודים תוך שבוע, לפעמים על חומר שלא נלמד. רק המעבדות מרגיש כמו השקעה של 1 נקז נוסף.\n\nהמבחן: שונה משנים קודמות, ומסיבה טובה. 15 היגדים נכון\\שגוי (15) 5 שאלות אמריקאיות (10) ו-6 שאלות פתוחות של 10-15 נקודות כל אחת עם 3-6 סעיפים. מבחן הוגן ברמה שלו אבל ארוך מאוד.\n\nהשורה התחתונה: קורס עם סגל מצטיין אבל דורש השקעה לא פרופורציונלית ל-3 נקז נטו בגלל המעבדות. מי שלמד כימיה בתיכון אוכל אותו בלי מלח, מי שלא- נדפק. אה ויש גם יסודות ב", "timestamp": 1676617060829}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רננה פורן\nחוות דעת - הרצאות: חיוניות מאוד להבנה של החומר אבל רוב העבודה וההטמעה שלו מתרחשת בתרגולים\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: סך הכל קלילים ממה שהייתי. נטע דואגת מאוד לעזור לכל הסטודנטים ועונה למיילים בכל שעה בערך. היא הקליטה את כל התרגולים ככה שהיה קל מאוד ולפעמים נוח יותר לא לבוא, במיוחד בשבועות הראשונים של הסמסטר.\n\nשעורי הבית: דורשים השקעה ואין ממש רפרנסים. היו גמישים איתנו עם הכמות הגשות ככה שאין סיבה לא לקבל 100 במגן\n\nהמבחן: סך הכל הוגן לדעתי.\n\nהשורה התחתונה: קורס לא פשוט, במיוחד העומס במהלך הסמסטר של המעבדות, מצריך השקעה", "timestamp": 1677003126150}, {"author": "Ilya Katz", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רננה פורן-גרשוני\nחוות דעת - הרצאות: הרצאות קצת מבולגנות, אבל רואים שרננה משתדלת מאוד להסביר ולענות על שאלות. המצגות מסודרות מאוד ואפשר לעבור עליהן גם אחרי ההרצאות במודל, כדי להשלים פערים/חורים בהבנה\n\nשם המתרגל/ת: נטע קספין וגיא לוצקי\nחוות דעת - תרגולים: מתרגלים מצוינים. אישית, התחברתי יותר לסגנון הלימוד של נטע (חזרה קצרה על ההרצאה הקודמת והרבה תרגילים מסוגים שונים, תוך כדי מתן דגש על טעויות נפוצות). למרות שחלק גדול מהכיתה העדיפו את גיא בגלל הסיוע והיחס, לפי מה שהבנתי.\n\nשעורי הבית: 10 גליונות חובה מתוך 15, חלק מהגליונות לוקח 20-30 דקות וחלק יכולים לקחת יומיים-שלושה. אין רפרנסים (וגם אם יהיו- לא להשתמש! הגליונות נותנים חזרה טובה על החומר)\n\nהמבחן: 15 היגדים של נכון/לא נכון, 5 שאלות אמריקאיות, 5-6 שאלות פתוחות עם מספר סעיפים לכל אחת. המבחן לא היה קשה, מרגיש שבהחלט כיסה את החומר בצורה טובה. \n\nהשורה התחתונה: אם לא לוקחים בחשבון את המעבדות (6 שעות של עמידה כמעט בלי הפסקה ולחץ מהמדריכים)- קורס סביר למי שלמדו כימיה ברמה תיכונית.", "timestamp": 1677076511111}, {"author": "Eli", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רננה\nחוות דעת - הרצאות: \nממש ממש נחמדה ומאוד עוזרת, עונה על כל שאלה. די מבלבלת ולא מלמדת מאוד טוב. חוץ מזה ההרצאות והתרגולים התחלפו כל הזמן מה שהיה קצת מבלבל\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: \nמאוד נחמד מאוד עוזר. מאוד עזר במה שלא היה ברור בהרצאה\nשעורי הבית: \nכל שבוע קיבלנו גיליון אבל היה מלא זמן לעשות אותו\nחלקם היו ממש קלילים וחלקם הרבה יותר קשים מבהרצאה, רובם קשים יותר מהמבחן עצמו\nהמבחן: \nלא דומה בכלל לשנים הקודמות אבל הרוב הגדול של השאלות הוגנות\nהשורה התחתונה: \nקורס בסדר אם יש ידע קודם בכימיה, אם לא יותר קשה", "timestamp": 1678787520820}, {"author": ",", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רננה\nחוות דעת - הרצאות: \nזו שנה ראשונה של רננה אבל היא היתה מעולה! סדר ההרצאות לא תמיד נראה לי הגיוני והקורס מאוד לא טריוויאלי לאנשים בלי רקע בכימיה אבל רננה ממש השתדלה לענות על שאלות ולעזור כמה שאפשר. המצגות שלה סופר מסודרות ועזרו לחזור על החומר\n\nשם המתרגל/ת: נטע \nחוות דעת - תרגולים: \nהתרגולים היו ברורים והיא קצת כפתה השתתפות כדי לראות אם היא מעבירה את החומר באופן מובן\n\n\nשעורי הבית: \nרוב התרגילי בית היו ברמה סבירה ואמנם דרשו השקעה אבל לא מעבר לשעה-שעה וחצי. התרגיל בית היחיד שממש ישבתי עליו ימים היה שיווי משקל שהיה מזעזע\n\nהמבחן: \nסופר הוגן. השאלות היו ברורות וברמה של התרגילי בית והתרגולים פחות או יותר וזה שכל הצוות ערב בכיתות בזמן המבחן ואיפשר שאלות היה ממש משמעותי\n\nהשורה התחתונה: אחלה קורס וצוות מעולה", "timestamp": 1679136361881}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רננה פורן גרשוני\nחוות דעת - הרצאות: \nרננה מדהימה! היא מעבירה את החומר ממש טוב ומסבירה מעולה, נותן דגשים על נושאים יותר מורכבים ובגדול ניכר שהיא רוצה שנבין ונלמד ונהנה מהכימיה. למרות שבסוף הסמסטר המודל קרס הצוות (גם רננה וגם המתרגלים) דאגו להיות ממש קשובים ולהנגיש את כל החומר בדרכים חלופיות כדי שנוכל להתכונן וללמוד למבחן, הם עשו כמה שעות קבלה ונתנו עוד שאלות חזרה והורגש שהם ממש השתדלו לעזור כמה שיותר.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nנטע אחלה מתרגלת. בתחילת הסמסטר היתה רק קבוצת תרגול אחת והיה לה קשה להתמודד לבד עם 60+ סטודנטים אבל אחרי שהוסיפו קבוצת תרגול נוספת היה ממש אחלה, היא ענתה על שאלות, נתנה המון דוגמאות והעבירה את החומר באופן מסודר ומעמיק. שעות הקבלה של נטע לאורך הסמסטר היו ממש משמעותיות ונתנו אפשרות לשאול שאלות על תרגילי הבית והזדמנות לראות כמה שיותר שאלות שונות.\n\nשעורי הבית: \nהיה אמור להיות ממוצע 10 התרגילים הטובים ביותר מתוך 12, בפועל בגלל הפריצה לטכניון והשבתת המודל היה הממוצע של 8 הגיליונות הטובים ביותר. התרגילים היו ממש בסדר, ברמת השאלות שהועברו בתרגול ואל היו בעיות נטע עברה על חלק מהשאלות בשעות קבלה ואיפשרה עוד ניסיונות למי שהתייעץ איתה וביקש.\n\nהמעבדות:\nהסמסטר היו רק שתי מעבדות במקום 3 שהיו בסמסטרים קודמים. בגדול מעבדה זה סיוט והחלק הנורא מכל הוא הדוח. אין איך להתחמק מזה. בכל זאת כמה נקודות חשובות- חשוב לבקש מהצוות ובעיקר מהמדריכים שיסבירו על איך עובד ומתפלג הציון של הערכת המדריך שהם נותנים, בסוף זה קובע 60% מהציון של כל המעבדה וזה המרכיב הכי משעותי בציון שם. לדעתי כדאי גם ללכת לשעות קבלה ולשאות על הבחני כניסה. הבחני כניסה הסמסטר היו נוראיים וגם לא באמת היתה לנו הכנה נורמלית אליהם, היה קשה לדעת מה לצפות ומה צריך ללמוד ובאופן כללי איך להתכונן למעבדה. היתה גם בעיה עם הכנה של הדוח המכין שהיה לא ברור מה מצפים שיהיה בו. לגבי הדוחות עצמם, כל מדריך מעבדה בדק אחרת לגמרי ולפי דגשים שונים וזה היה ממש מתסכל לנסות להבין מה הם מצפים ואיך זה אמור להיראות. גם לגבי זה הייתי מבקשת שעת קבלה עם המדריך מעבדה לפני/אחרי המעבדה ומבקשת דגשים והסברים כדי לדעת איך לבנות את הדוח לפי הדגשים שחשובים למדריך, אחרת סתם מורידים הרבה נקודות על שטויות\n\nהמבחן: \nהיה מאוד שונה משנים קודמות כי זו השנה הראשונה שרננה העבירה את הקורס וכל השאלות היו מקוריות לגמרי (אפילו לא דומות לשאלות מסמסטרים קודמים). למרות זאת המבחן הרגיש הוגן, הצוות הכין את השאלות והתרגולים ממש ברמת המבחן ולמרות שהיו כמה שאלות על נושאים קצת נקודתיים המבחן היה סביר\n\nהשורה התחתונה: \nקורס נהדר לאוהבי כימיה, מכסה המון נושאים בכימיה ברמה בסיסית שנותנת מקום ללמידת המשך מעמיקה שלהם, מומלץ בחום. חוץ מהמעבדות. מעבדות זה סיוט.", "timestamp": 1689570853078}, {"author": "איתן 67", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ד\"ר רננה גרשוני-פורן\nחוות דעת - הרצאות:\nרננה העבירה את החומר בצורה יחסית ברורה ויצרה קשר דיי טוב עם הסטודנטים בקורס, אם כי יש לציין שהיא עוברת על החומר דיי לאט ואז לעיתים דוחסת הרבה חומר לסוף השיעור. המצגות באתר הקורס מאוד מועילות.\n\nשם המתרגל/ת: גיא לוצקי\nחוות דעת - תרגולים:\nגיא העביר את החומר בצורה יחסית ברורה אבל טיפה איטית ובעיקרון פשוט פתר תרגילים ולא באמת עבר על החומר. יכולתי כנראה להגיע לאותו מצב בלי ללכת לתרגולים באמצעות עיון בדפי התרגולים הפתורים באתר הקורס (שהיו מאוד מועילים).\n\nשעורי הבית:\nלא קשים מדי, ואפילו דיי נחמדים.\n\nהמבחן:\nהוגן מאוד, ואפילו הייתי אומר יחסית קל. יותר מדי שימוש בנוסחאות (דף הנוסחאות מאוד מאוד הקל) ומעט מדי חשיבה וכימיה.\n\nהשורה התחתונה:\nסך הכל קורס חביב, אבל זה מאחר שאני מאוד אוהב כימיה.", "timestamp": 1715172832895}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רננה\nחוות דעת - הרצאות: רננה מאוד נחמדה, הרגשתי שהצלחתי לעקוב אחרי החומר ולהבין במהלך הסמסטר.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגול: גיא סך הכל הסביר בסדר ונתן כלים לפתור תרגילים, לפעמים היה נראה שהוא נהיה קצת מתוסכל כשהסטודנטים לא הבינו משהו שהוא הסביר.\n\nשעורי הבית: היו ברמה הוגנת ונתנו 4 נסיונות לפתור אותם נכון, ואפילו עוד אם מישהו ביקש עוד ניסיון לפתור תרגיל מסוים.\n\nהמבחן: במהלך הסמסטר הבנתי את החומר גם בהרצאות וגם בתרגולים, אבל המבחן היה לי קשה וארוך ובעיקר הרגשתי מצוקת זמן שגרמה לי לעשות הרבה טעויות, ואפילו לפספס כמה סעיפים.\n\nהשורה התחתונה: הקורס הרגיש בסדר במהלך הסמסטר אבל המבחן היה נפילה עבורי. הרמה של השאלות בתרגול ובשיעורי הבית לא מייצגת את המבחן, תתכוננו מהמבחנים הפתוחים הכי קשים שאתם מוצאים אם אתם רוצים להצליח במבחן.", "timestamp": 1715289203610}, {"author": "חן השילוני", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רננה\nחוות דעת - הרצאות: הקושי של ההרצאות מאוד משתנה. יש נושאים שיותר קלים להבנה, ויש כאלה שצריך לשבור את הראש עליהם (כן אורביטלים,אני מסתכל עליכם.). רננה מנסה לעשות את ההרצאות כמה שיותר אינטראקטיביות ומעניינות, ובאמת שהיא בן אדם חמוד, אבל חלק מהנושאים לא עברו אלי במלואם. \n\nשם המתרגל/ת:  גיא\nחוות דעת - תרגולים: אחלה בחור, מאוד חברי ובתכלס איתך, נותן רמזים עבים למה כן יהיה או לא יהיה במבחן. אבל גיא לא יסביר לך הכל אם לא הבנת משהו מאפס, אז לא לבוא לתרגולים בלי להבין כלום מההרצאה ולצפות שגיא יעזור בזה. \n\nאחראית מעבדה: גבריאלה\nמעבדות: המעבדות עצמן דורשות למידה עצמית לפני, והן ממש לא מסונכרנות עם החומר שלומדים בקורס. הדוחות לוקחים גם המון זמן ולא ממש מלמדים אותנו איך לכתוב דוח מעבדה, למרות שכל מי שלוקח את הקורס הזה, זאת המעבדה הראשונה שלו. מה שכן, יש רק 2/3 מעבדות בסמסטר, אז זה אפשרי להתגבר עליהן. תשתמשו ברפרנסים!!\n\nשעורי הבית:  זוועה. לא נראה שגיא או רננה כתבו אותם, אלא פשוט הם לקחו משהו שהיה קיים מראש ופשוט זרקו לנו לעשות את זה בלי אפילו לבדוק שהכל רלוונטי לנו. הרבה פעמים היו בשב מושגים ומקרים יוצאי שלא למדנו בהרצאה ובתרגולים, שרק אחרי ששאלנו אותם הם הסבירו \"אה כן זה בעצם...\". \n\nהמבחן: מאוד קשה, באמצע המבחן נתנו לנו הערכת זמן כי לא העריכו נכון את רמת הקושי שלו, אבל בגלל זה, יכול להיות שהמקרה שלנו יוצא דופן.\n\nהשורה התחתונה: קורס קצת בלאגן, אבל הסגל ממש נחמד וחברותי (חוץ מהאחראית מעבדה, שמרגיש שמנסה להוריד לך ציון).", "timestamp": 1715961936562}, {"author": "אנונמי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דר' רננה פורן\nחוות דעת - הרצאות: ניכר כי מאוד אכפת לה מהקורס ומהתלמידים, היא שינתה את המבנה שלו מהשנים הקודמות בשביל שהחומר יועבר לנו בצורה הגיונית. מרצה מעולה! פלוס היא הכינה לנו עוגיות בסוף הסמסטר- אייקונית.\n\nשם המתרגל/ת: דר' דינה שפסר\nחוות דעת - תרגולים: הצטרפה באמצע הסימסטר כי היינו קבוצה גדולה מידי בשביל מתרגל אחד. מתרגלת מעולה. היא תמצא אלף דרכים להסביר לך שאלה אם לא הבנת. \n\nמעבדה: \nבהצלחה, תצטרכו את זה. עם כמה שמעבדות זה מעניין ואפילו כיף, המעבדות ביסודות א' (עם גבריאלה) עמוסות, מלחיצות, לא פשוטות ותופסות כמעט שבוע שלם (אם אתם משקיעים). תכינו דו\"ח מכין מסודר ותדעו את החומר כי יש בוחן כניסה (רצחני) ואם אתם לא עוברים אותו אתם פשוט לא נכנסים ומעבדת ההשלמה היא בסוף הסמסטר ותצטרכו לעבוד על הדו\"ח מעבדה במקום ללמוד למבחנים. \nחשוב שבזמן המעבדה תקחו אותה ברצינות כי א. יש חומרים מאוד מסוכנים שלאו דווקא מזהירים לגביהם וב. המדריך נותן לכם ציון על סמך התרשמות, אין סיבה לא לקבל מעל 90.\n\nשעורי הבית: כ-10 גיליונות. לא קשים אבל גם השאלות הן מהמאגר של כימיה כללית כך שלפעמים לא רלוונטיות ויש עיסוק רב בהמרת יחידות- דבר שרננה לא אוהבת בעצמה.\n\nהמבחן: זאת השנה השנייה שרננה מרצה בקורס כך שאין הרבה מבחנים להשוות אליהם, אבל מבנה המבחן וסוג השאלות די חוזר על עצמו. המבחן שלנו היה מאוד ארוך ולא פשוט, הוסיפו לכולם זמן נוסף ועדיין לא כולם סיימו. מקווה בשבילכם שהצוות למד את הלקח.", "timestamp": 1716929163540}]}