{"posts": [{"author": "R.G", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: \nהקורס מורכב מ2 חלקים עיקריים. בחלק הראשון לומדים בעיקר את המקור הקוונטי לקשרים מולקולוריים והוא כולל מושגים קוונטים קצת מתקדמים שנלמדים בקורס של קוונטית 2 (למשל סינגלטים וטריפלטים שמבינים לעומק רק לאחר נושא חיבור ספין). החלק השני יותר קל ובו מלמדים מגוון מושגים מעולם הכימיה, למשל קשרי לואיס, תגובות כימיות וצורות של מולקולות. המרצה מעביר את הקורס בצורה טובה ומשתדל לתת הסברים ברורים ולשלב דוגמאות רלוונטיות מעולם הכימיה.\nהמעבדה - מעבדה די קשוחה שכוללת 4 מפגשים (היה פחות בסמסטר קורונה), כשבהתחלה עוברים בוחן בכתב שללא ציון עובר לא נותנים לבצע את המעבדה. רוב הדגש הוא על ביצוע המדידות במעבדה עצמה והדוח שכותבים לאחריה הוא ברמה נמוכה ביחס לדוחות שכותבים במעבדות בפיזיקה.\nשם המתרגל/ת: אנאל בן שחר\nחוות דעת - תרגולים: \nמתרגלת סבירה. \nשעורי הבית: \nבסה\"כ 4 גליונות לאורך כל הסמסטר עם כ-4 שאלות בכל אחד. הגליונות יחסית פשוטים אבל לפעמים יש שאלות טריקיות, אך עדיין ניתן לסיים אותם מהר. בכל מקרה, הרבה פחות גליונות מכל קורס אחר בפקולטה לפיזיקה.\nהמבחן: \nהוגן, בעל חומר פתוח ומבנה זהה לחלוטין לשנים קודמות. מומלץ מאוד לתרגל מבחני עבר כהכנה.\nהשורה התחתונה: \nקורס שנותן היכרות עם עולם הכימיה ומבוא לכימיה קוונטית ולא קשה במיוחד. \nלסטודנטים במסלול פיזיקה תלת שנתי - הקורס הוא קורס חובה אז אין לכם ברירה.\nלשאר - לא מומלץ לבחור אלא אם ממש מעניינת אתכם כימיה, ואם בוחרים אז ללא מעבדה.", "timestamp": 1625654756917}, {"author": "tbubhnh", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות:\n מאוד משמימות, עד לרמה שלקראת סוף הסמסטר הכיתה הייתה ריקה לגמרי. המרצה לא התייחס טוב לסטודנטים וזרק כמה הערות בחוסר טקט.\n\nמעבדה:\n זה הנקודה שהופכת את הקורס מסתם קורס לא טוב לאחד הקורסים הכי נוראיים שיש בתואר. מעבדה ארוכה ומייגעת, עם אפס קשר בין הניסויים למה שלומדים בקורס, שמועברים בצורה לא טובה, עם בחני כניסה שלא קשורים לתדריך ומי שנכשל בהם לא נכנס למעבדה. \n\nשם המתרגל/ת: אמיר אילן\nחוות דעת - תרגולים: \nמתרגל טוב, בערך הדבר היחיד שטוב בקורס\nשעורי הבית: \nסבירים, אין יותר מדי מהם\n\nהמבחן: \n\nהשורה התחתונה: קורס נוראי, וצריך לעבור שינוי מאוד רציני בשביל להיות סביר. ממליץ לא לקחת אם לא חייבים.", "timestamp": 1643546970413}, {"author": "דורון בכר", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: סהר רהב\nחוות דעת - הרצאות:\nמשעמם ולא מחובר למציאות ולחיים. חצי סמסטר דיברנו על קוונטים של אטומים ומולקולות מבלי להיות מסוגלים לפתור כלום וזה לא היה חשוב למבחן בכלל. בהמשך הקורס, כשכבר הברזתי מההרצאות באופן קבוע התחילו ללמד כימיה כללית יותר וזה חומר יותר קשה למי שלא עשה כימיה בתיכון. חבל שהקורס בנוי ככה.\n\nשם המתרגל/ת: אמיר אילן\nחוות דעת - תרגולים: \nאווירה ממש טובה ואפשר להגיע רק לתרגולים\n\nשעורי הבית: \nלא היה מספיק מהם, בעיקר לחומר של כימיה כללית (לעומת חומר שמבוסס על קוונטית) והתרגול הזה נחוץ כדי לא להיות בשוק בתקופת מבחנים מכמה שהחומר הזה לא קל.\n\nהמבחן: \nסביר בקושי שלו אבל צריך להתכונן הרבה הרבה זמן כי בסוף לומדים את החומר לבד.", "timestamp": 1647677956132}, {"author": "'", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: סהר\nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: אילנה\nחוות דעת - תרגולים: לא הייתי\n\nשעורי הבית: מטופשים אך מרופרנסים\n\nהמבחן: מוזר אבל אפשר להצליח\n\nהשורה התחתונה: ביזיון", "timestamp": 1677243168114}, {"author": "מטען פורמלי", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: סהר\nחוות דעת - הרצאות: ראיתי הקלטות, 90% של בלבולי שכל, ו10% של תכלס. ממליץ על כפול 3...\n\nשם המתרגל/ת: המוקלטות\nחוות דעת - תרגולים: סבבה, לא כל התרגולים של השנה היו שנה שעברה.\n\nשעורי הבית: קלים, לא דורשים הרבה.\n\nהמבחן: נורא.\n\nהשורה התחתונה: חובה אז מה זה משנה", "timestamp": 1679172528583}, {"author": "הארטרי פוק", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: הוא נחמד מאוד ועונה בהרחבה לשאלות, אבל די קשה לעקוב אחרי ההרצאות עצמן. הקורס הוא בשני חלקים, כשהראשון הוא המשך ישיר לקוונטית 1 והשני יותר דומה לכימיה כללית (וכביכול נגזר מהראשון אבל לא באמת). סער השקיע יותר זמן ממה שהוא היה אמור על החלק הראשון, ולכן יצא שעל החלק השני עברנו בזריזות במשהו כמו שלושה שבועות. המבחן הוא 60 נקודות על החלק השני ו-40 על הראשון, ולכן למי שמגיע בלי ידע קודם בכימיה כללית (או לפחות כימיה של תיכון) זה עשוי להיות טריקי. \n\nשם המתרגל/ת: אילנה\nחוות דעת - תרגולים: נחמדה ועושה את המיטב, אבל אין לה מושג קלוש על החומר של החלק הראשון. \n\nשעורי הבית: מרופרנסים לחלוטין. בחלק הראשון התרגילים מזכירים יותר עינוי אלגברי ונמשכים עמודים ארוכים. יש בסך הכל ארבעה תרגילים, והראשון משוחרר רק סביב אמצע דצמבר. \n\nמעבדות: יש ארבע מעבדות לאורך הסמסטר. לא כולן קשורות לחומר הקורס, וגם אלה שכן מקדימות אותו. המעבדות עצמן מעיקות אבל הבדיקה הרבה יותר מקלה מאשר במעבדות בפיזיקה (ו-70% מהציון במעבדה הוא על \"ההתנהלות במעבדה\" שבו כולם מקבלים 95+-3) כך שבפועל זה אחלה ציון מגן של 20% (בנוסף ל-16% ש\"ב מהקורס העיוני). \n\nהמבחן: 6 שאלות אמריקאיות שעוסקות ברובן בחלק השני, ושתי שאלות פתוחות גדולות (אחת על כל חלק). השאלה הפתוחה הקוונטית עשויה להשתמש בטריקים אלגבריים נישתיים, אבל הרבה מהטריקים האלה הופיעו בתרגול או בש\"ב אז שווה לחזור עליהם. השאלה הכימית בדרך כלל פשוטה חישובית אבל דורשת הבנה די מעמיקה של החומר (מה שקשה להשיג כשרצים על החומר מהר בסוף הסמסטר). הבדיקה השנה הייתה מפרגנת יחסית בשאלה הכימית וקשוחה יחסית בשאלה הקוונטית. \n\nהשורה התחתונה: קורס שהיה יכול להיות מעניין עם כמה תיקונים קלים. עם ה-36% מגן (מעבדה והגשות) אפשר להגיע לציונים סבירים גם בלי הבנה עמוקה של החומר.", "timestamp": 1680345083052}]}