{"posts": [{"author": "משה", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גלית פישבך\nחוות דעת - הרצאות: ההרצאות הסמסטר היו חצי במתכונת \"כיתה הפוכה\" וחצי במתכונת רגילה. גלית משתמשת במעוות קול ולא מראה את עצמה, קשה יותר להתרכז בשיעורים שלה בגלל זה, עם זאת מבין 3 האופציות שהיו, עידו או לילך, אין ספק שהיא הטובה ביותר, מאד אכפת לה והיא מאד אוהבת את החומר.\n\nשם המתרגל/ת: רעות\nחוות דעת - תרגולים: מסבירה מצויין ואכפת לה מהסטודנטים.\n\nשעורי הבית: לא לוקחים יותר מדי ביחס לכמות הנק\"ז של הקורס.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612725322580}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  עידו גילרי\nחוות דעת - הרצאות: \nהרצאות מעניינות. עידו מעביר אותן בצורה מעולה\nשם המתרגל/ת: מורן לוי\nחוות דעת - תרגולים: \nהמתרגל הכי טוב בטכניון וכנראה בכל העולם האקדמי\nשעורי הבית: \nבסדר סה\"כ. היו קשים אבל הרוב סבבה\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612725402113}, {"author": "אופיר ביננטל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: מסביר בצורה ברורה ומשתדל לפשט את הדברים, משתף את הסטודנטים במהלך השיעור.\n\nשם המתרגל/ת: מורן לוי\nחוות דעת - תרגולים: מתרגל מעניין, לא מוותר שאף סטודנט ישאר מאחור. מפתח גם התעניינות מעבר לחומר הנלמד\n\nשעורי הבית: היא תרגילי קדם- שאלות פתוחות. 4 נסיונות. נדרש לקבל בהם לפחות 60 כדי להתקדם לתקף. ש\"ב תקף- ניסיון אחד. בד\"כ אמריקראיות\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612953081235}, {"author": ",", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גלית ורד פרברי\nחוות דעת - הרצאות: הסמסטר התנהל במתכונת כיתה הפוכה - רואים הרצאה מוקלטת בשעה הראשונה, ושואלים שאלות בשעה השנייה. ההרצאות המוקלטות של גלית היו בפער יותר טובות משל המרצים האחרים, אבל הן היו גם ארוכות יחסית, אז היה צריך לראות אותן לפני השיעור כדי להספיק. בשעה השנייה היו שאלות והדגמות, ולא היתה חלוקת זמנים טובה (פעם אחת דיברנו כל השיעור על רק על שאלה אחת).\n\nשם המתרגל/ת: עימאד עיד\nחוות דעת - תרגולים: מתרגל מדהים! אמנם לא הייתי בכל התרגולים שלו (התרגול היה באמצע השבוע, ועד אז היו מעלים את התרגול והפתרון שלו, אז הייתי מסתכל בפתרונות במקום ללכת לתרגול), אבל אין שום ספק שהוא בא לתת מעצמו, בשביל שאחרים יצליחו. בנוסף, הוא עשה חידוני kahoot, שזה תמיד בונוס :)\n\nשעורי הבית: כל שבוע משתחררים 2 גיליונות - תרגילי קדם ותרגילים תקפים, בכל אחד מהם 4-5 שאלות.\n\nתרגילי קדם - 4 ניסיונות, אבל קשים בכמה רמות ממה שהיה בתרגול.\n\nתרגילים תקפים - ניסיון אחד בלבד (לפי דעתי זה רעיון רע, כי פשוט יותר אנשים מפחדים על הציון שלהם, אז הם מחכים שאחרים יענו קודם), מצד שני - ביחס לקדמים אלה תרגילים בדיחה. \n\nיאמר לזכותם שהחשיבו חלק מהתרגילים כבונוס/מחליפים ציון נמוך יותר, אבל היה נחמד יותר לדעת את זה בתחילת הסמסטר ולא בסופו.\n\nהמבחן: 21 שאלות אמריקאיות (שאלה אחת בונוס). חלק מהשאלות ממש סבבה, וחלק יותר מתייחסות לפרטים הקטנים. לחרוש שבוע לפני, כי יש הרבה חומר שצריך לעבור עליו.\n\nהשורה התחתונה: קורס קשה יחסית, הרעיון של הכיתה ההפוכה היה יכול להיות מעולה, כי אז כל אחד יכול ללמוד בקצב שלו. הביצוע, לעומת זאת - פחות.", "timestamp": 1614152682888}, {"author": "דביר דימינסקי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות:  מרצה מעולה למרות שבזום היא מרצה עם קול מטושטש אז קשה להקשיב.\n\nשם המתרגל/ת: רעות\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: אחלה אבל יש הרבה.\n\nהמבחן: הוגן", "timestamp": 1614597906060}, {"author": "andrey", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גלית פרברי\nחוות דעת : מרצה טובה \n\nשם המתרגל/ת: עימאד\nחוות דעת - תרגולים: מתרגל מעולה, עושה סדר בנואים\n\nשעורי הבית: לא קלים, דורשים השקעה\n\nהמבחן: לא קשה, הרבה שאלות שחוזרות על עצמם, , מבחן הוגן\n\nהשורה התחתונה: קורס עמוס וכבד אבל אפשר להצליח בו בגדול", "timestamp": 1615885187015}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: היא מרצה מעולה וממש אכפתית. אבל לדעתי אפשר לוותר על ההרצאות וללמוד מסיכום או מהספר.\n\nשם המתרגל/ת: עימאד עיד\nחוות דעת - תרגולים: אחלה מתרגל, התרגולים שלו חובה. מזכיר ניקודות עדינות ועונה לשאלות בסבלנות ובצורה הכי ברורה שיש.\n\nשעורי הבית: יש גיליון כל שבוע , רוב הגליונות קלילים כך שאם מבינים את החומר טוב לא צריכים לקחת יותר מכמה שעות לפתור. \n\nהמבחן: הסמסטר הרגיש קשה מהרגיל אבל באופן כללי הוגן ולא מכיל התפעות\n\nהשורה התחתונה: הכי חשוב תשארו על החומר כל הסמסטר.", "timestamp": 1616338045382}, {"author": "דניאל", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: מרצה קשובה וסבלנית, מלמדת את החומר בתשוקה שגורמת לך להישאר מרוכז גם בשעות הבוקר המוקדמות. מקליטה את ההרצאות שלה אבל יש לה מעוות קול שלפעמים פוגע באיכות ההקלטה והזום בלייב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עמית מנור\nאחלה מתרגלת, סבלנית ודואגת לרשום הכל על הלוח ולחזור כמה פעמים אם התקשנו בהבנה\n\nשעורי הבית: קלילים", "timestamp": 1643909536618}, {"author": "דניאל", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מרצה מעולה, טיפה קשה בזום עם מעבד קול.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס שמחסה את החומר מתיכון, אבל נכנס בהרבה יותר לעומק.", "timestamp": 1644247204375}, {"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: הוא מדהים!! מסביר טוב את החומר, עונה על כל השאלות וגם מכניס בדיחות פה ושם.\n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: מתרגל טוב, עונה על כל השאלות ועוזר להבין את החומר ואיך לפתור תרגילים בצורה טובה יותר.\n\nשעורי הבית: תלוי בנושא, חלק קלים וחלק קצת יותר מאתגרים ודורשים יותר זמן. צריך לקבל לפחות 70 כדי שזה ייחשב כ100 אז לא צריך לתקן עד שמצליחים 100.\n\nהמבחן: היה קשה, שאלות קצת הזויות, אבל אני אישית הרגשתי שלא למדתי הכי טוב למבחן. בכל זאת עברתי כי יש גם שאלות קלילות.\n\nהשורה התחתונה: אחלה קורס, אני למדתי כימיה בתיכון אז כן עזר לי שאני יודעת את הבסיס אבל זה נכנס יותר לעומק.", "timestamp": 1645370996378}, {"author": "שמוליק", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מרצה מעולה, לטעמי מקדישה יותר מדי זמן על מענה על שאלות(והיו הרבה מאוד), אבל בסך הכול מרצה את החומר בצורה מעולה.\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: בסדר בסך הכול.\n\nשעורי הבית: במודל,  לוקח שעתיים במקרה החמור. לא קל אבל יש 4 ניסיונות ובערך חצי זה אמריקאי והחצי השני פתוח.\n\nהמבחן: אמריקאי, אם לומדים ומבינים את החומר הוא ממש קל. אם לא מבינים אז אפשר לעשות הרבה טעויות.\n\nהשורה התחתונה: אצלי זה קורס בחירה של מדעי המחשב, לדעתי קורס יחסית קל שאפשר להוציא ציון גבוה מאוד ב5 נקודות. אין השקעה במהלך הסמסטר. אם באים עם רקע חזק מהתיכון אפשר גם ללמוד את החומר שבוע לפני המבחן, אבל אני פחות ממליץ.", "timestamp": 1645429282195}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית/ עידו\nחוות דעת - הרצאות: להרבה הרצאות לא הלכתי כי באתי עם רקע יציב מהתיכון ויש הרבה דברים שחוזרים אליהם. כן יש גם מן הסתם הרחבות בנושאים שנלמדו בתיכון אז חשוב להיות עם היד על הדופק.\nגלית מרצה מעולה עם המון תשוקה. עונה לכל שאלה אבל מדברת יחסית מהר.\nשימו לב שהיא לא פותחת מצלמה ומשתמשת במערבל קול בזום ובהקלטות.\nעידו אחלה מרצה, אני באופן אישי יותר התחברתי לגלית בזכות התשוקה והשמחת חיים.\n\nשם המתרגל/ת: גיא מן\nחוות דעת - תרגולים: מתרגל חמוד. מצד אחד כן מסביר ומשקיע אבל מצד שני לדעתי בורח מהר מידי ל\"זה מעבר לחומר הקורס\" מה שמשאיר פערים בהבנה.\nבאופן כללי ההתרשמות שלי היא שרוב המתרגלים לא מכירים את החומר מספיק טוב. יכול לנבוע מכך שלומדים בקורס הרבה תחומים וחלק מהמתרגלים מתמחים בתחום מסוים וחלשים יותר בתחום אחר.\n\nשעורי הבית: 6-8 שאלות אמריקאיות במודל על בסיס שבועי. חצי מהשאלות אמריקאיות.\nארבע ניסיונות הגשה של הטופס.\nציון מעל 70 בכ-10 גיליונות מקנה 10 אחוז מגן בציון הממוצע של ההגשות, כאשר מעל 90 מעוגל ל 100.\n\nהמבחן: 21 אמריקאיות, חמש נקודות כל אחת (5 נק' בונוס, אצלנו לא נרמלו למתוך 105).\nמועד א' היה הוגן. רוב השאלות היו ברמה בינונית והיו עוד 3-4 שאלות יותר קשות.\nלפני המבחן קבעתי שעת קבלה עם גלית שהתבררה ממש כשיעור פרטי (כנראה זה הקונספט). ממליץ מאוד להשתמש כמה שאפשר (להבנתי אפשר גם במהלך הסמסטר). מרצה מעולה אחד על אחד... מה צריך יותר מזה?\nגם עידו עשה הרצאת חזרה שהייתה מוצלחת מאוד.\n\nהשורה התחתונה: *סטודנט ממדמח*\nממליץ על הקורס כקורס מדעי כי ההשקעה ורמת הקושי למי שיש רקע חזק מהתיכון היא לא גדולה ועוד מדובר בחמש נקז, מה שכן תראו איך מסתדרים עם קורס המשך (אורגנית/פיזיקלית) או שרשרת אחרת.\nחסרון שהשפיע הוא שכמעט לכל המבחנים אין תשובות מלאות, אלא רק תשובות סופיות (וחלק מהמבחנים מפורסמים אפילו כטופס אפס...).\nממליץ מאוד להשקיע בלהבין מבנה וקישור כמה שיותר טוב. זה הבסיס לכל הנושאים. לדוגמה, תרכובות היפר-ולנטיות, זה נושא שלוקח 10 דקות להבין וזה יכול מאוד לעזור במבני לואיס ותרכובות כאלה מופיעות המון במבחן כשבפועל (עד כמה שאני יודע) לא מלמדים פורמלית את הנושא.", "timestamp": 1645552894673}, {"author": "מכונה א-דטרמיניסטית", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: קצב מהיר מאוד, אבל מרצה טובה, אכפתית ונותנת הרבה מהידע האישי שלה והרבה דוגמאות ודגשים טובים\n\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: רומי מתרגלת מצוינת, תסביר את אותו הדבר כמה פעמים שצריך עד שכולנו נבין, ועדיין מספיקה את החומר בתרגול\n\nשעורי הבית: כל שבוע יוצא גיליון של 6-8 שאלות אמריקאיות במודל. אם חדים על החומר זה משהו כמו שעה, שעתיים, ממש לא עמוס.\n\nהמבחן: המבחן אמריקאי ולא קשה, הממוצע מעיד בעצמו. עם זאת טריקי, לא מעט שאלות שיש בהן איזה מסיח, או מסיח בתשובות. די מציק ודורש להיות טיפה חד.\n\nהשורה התחתונה: אני לקחתי את הקורס בשרשרת מדעית של כימיה במסלול של מדעי המחשב. לדעתי עבור מי שלמד כימיה בתיכון הקורס די קליל וכיפי אם גם אהבתם את זה. סך הכל ממליץ", "timestamp": 1646114702988}, {"author": "...", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: מרצה מצוין, מעביר את החומר בצורה ברורה ומוסדרת. ממש מומלץ.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: כל התרגולים עוברים לפי מצגת אחידה ככה שרמת התרגילים והחומר המתורגל זהה בין כל הקבוצות. פשוט לבחור את המתרגל שאתם הכי מתחברים אליו ושהתרגול שלו עובר בשעות שנוחות לכם.\n\nשעורי הבית: גיליון שבועי עם 7-8 שאלות על החומר שתורגל באותו השבוע. יש שבועות שבהם התרגילים קצת כבדים וצריך להשקיע בין שתיים לארבע שעות. היו שבועות עם תרגילים קלילים שלקחו לי לפעמים רק 20 דקות. תואמים לרוב את הרמה של המבחן.\n\nהמבחן: מבחן אמריקאי עם 21 שאלות, כשכל שאלה שווה 5 נק' (כלומר ניתן לטעות בשאלה אחת ועדיין לקבל 100). חלק מהשאלות חישוביות וחלק שאלות הבנה. סך הכל מבחן ממש פייר - משתקף גם בהיסטוגרמות של הקורס.\n\nהשורה התחתונה: קורס מעניין ובנוי טוב, צוות מרצים ומתרגלים טוב. לא עמוס ביחס ל5 נק\"ז שהוא שווה.", "timestamp": 1646571554775}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: \nמדברת מאוד מהר, מתלהבת מאוד ויכולה להיסחף עם ההסברים. לא להיבהל מזה- מתרגלים ואם לא, אפשר לראות מההקלטות. אפשר לראות גם את עידו, לחלק יותר מתאים. גלית מאוד סבלנית ואכפתית, אפשר לקבוע איתה שנת קבלה שמאוד סוגרת את הפינה\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: \nמאוד טכני (טוב ורע, קצת יותר קשה להבין רציונל אבל יותר קל לפתור ב״תכלס״) מקסים ומספיק את כל התרגילים. ממליצה לעבור על התרגילים או החומר לפני התרגול כדי שתבינו בערך מה הולך (הם מאוד מהירים).\nשעורי הבית: \nמאוד מתמטיים. לא בדיוק כמו במבחן, קחו בחשבון. בתחילת השנה הם יותר מעיקים ועמוסים, אחר כך הרמה יורדת וזה נהיה בסדר. לא להשתמש מרפרנסים כי התרגול חשוב.\nהמבחן: \nהיה מאוד הוגן.\nהשורה התחתונה: הקורס דורש השקעה לאורך הסמסטר, לא להזניח אותו. לחזרה על החומר ובמהלך - הסמסטר הספרים של עמנואל פאר מומלצים. תתרגלו מדפי העזר, שעורי בית ויהיה בסדר.", "timestamp": 1647337135273}, {"author": "Chen Gal", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: מרצה נהדרת, ממש מתלהבת ללמד את החומר\n\nשם המתרגל/ת: גיא מן\nחוות דעת - תרגולים: נחמד, מעט קלים מדי\n\nשעורי הבית: די מעט, היה אפשר אולי קצת יותר\n\nהמבחן: בסדר גמור\n\nהשורה התחתונה: אחלה קורס, צוות מעולה", "timestamp": 1647697880598}, {"author": "shir", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: טובה אבל מהירה\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: יודע את החומר אבל עייף. בסוף הסמסטר הלכתי לשעות קבלה למרצה אחרת- רומי, והצטערתי שכל הסמסטר לא הייתי איתה כי ההבדל היה גדול\n\nשעורי הבית: סביר\n\nהמבחן: מועד א סביר, מועד ב קשה מהרגיל והיה פקטור\n\nהשורה התחתונה: להקשיב", "timestamp": 1647872240636}, {"author": "עדן הוכלר", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: קצת מבולגנת, רואים שהיא אוהבת כימיה ויש לה תשוקה ללמד. מסבירה טוב וממש משתדלת שכולם יבינו. קיימה שעות קבלה בהתאם לשעות שנוחות לאנשים שביקשו (משנה-לא הייתה שעה קבועה). בזום-על הפנים! משתמשת במעוות קול (לצורך הפרטיות שלה) ובקושי מבינים מילה. ללכת אליה רק פרונטלי!!!!\n\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: מצד אחד היא הייתה סבבה,  מצד שני היו דברים שהיא הסבירה בדרך שלי הייתה קצת עקומה ולקח לי הרבה זמן להבין. אין ספק שהיא באמת מנסה לעזור ולהסביר לכולם. בתרגול תרמוכימיה הרגשתי שאף מתרגל לא סגור על החומר כמו שצריך והורגש שחלק גדול מהמתרגלים לא התכוננו לתרגול- מבאס מאוד ומייאש. בתרגול חזרה למבחן נטע היה פצצה (בגלל אילוצי מערכת לא יכולתי ללכת אליו במהלך הסמסטר)\n\nשעורי הבית: בחלק מהנושאים סבירים ממש ואפילו קלים. בחלק אחר הזוים ומרגיש שלא קשור למה שנלמד בהרצאות או בתרגול.\n\nהמבחן: מועד א היה סבבה, מועד ב קשה באופן חריג. תרגול של מבחנים קודמים לא הועיל לגמרי במועד ב היות והיו שם לא מעט שאלות שלא הופיעו בשום מבחן אחר.\n\nהשורה התחתונה: קורס עמוס עם מספר נושאים קשים ומעיקים.", "timestamp": 1648457782054}, {"author": "י", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: מרצה לא טובה. לא מביעה שום אכפתיות כלפי הסטודנטים, ואפילו זלזול. משדרת עייפות בהרצאות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בינוניים פלוס. כדאי לעשות כדי לתרגל את החומר ולהבין אותו.\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1649081512052}, {"author": "כ", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: ההרצאות של הקורס עוברות על החומר בצורה יסודית ממש מההתחלה גם למי שאין לו רקע בכלל. גלית מעבירה את החומר בהתלהבות וחשוב לה מאוד שכל הסטודנטים יבינו. מדברת מעט מהר אבל מאוד מודעת לזה\n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: בסך הכל מתרגל בסדר גמור. היה קצת לא ברור בחלק מהמקרים וקצת מבולגן ולחוץ.\n\nשעורי הבית: דורשים קצת עבודה אבל לא נוראיים\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1657437812671}, {"author": "Shirel Gavrielove", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  עידו גילרי\nחוות דעת - הרצאות: מרצה מאוד מפוזר, הלכתי אליו כי הוא היחיד שהסתדר לי במערכת. לא סיים את החומר ודילג על המון נושאים חשובים. לא מומלץ!!!\n\nשם המתרגל/ת: עמית ערמון\nחוות דעת - תרגולים: מתרגלת מהממת- נתנה מענה תמיד ועזרה מאוד בהשלמת הפערים שנוצרו מההרצאות.\n\nשעורי הבית: קשים ודורשים מחשבה. לא לוותר עליהם!!\n\nהמבחן: קשה אבל פתיר, תרגול של המון מבחנים והליכה לשעות קבלה עוזרים מאוד.", "timestamp": 1663318845860}, {"author": "Shira Hanuka", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: מעביר את החומר בצורה מעניינת, עונה על שאלות רלוונטיות ויודע לעצור מתי שזה כבר לא רלוונטי - דבר שמאוד חשוב בעיני\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגלת מעולה! מסודרת מאוד, אכפת לה מכל אחד ואחת. ממליצה!\n\nשעורי הבית: לוקחים זמן, אבל קריטיים להבנת החומר. חשוב מאוד להקדיש להם זמן ומחשבה.\n\nהמבחן: דורש הכנה ודורש ״להיות על זה״ במהלך הסמסטר- אפשרי להוציא ציון גבוה \n\nהשורה התחתונה: קורס מאוד חשוב לפקולטות שזה במומלצת שלהן, ממליצה ללמוד לא רק בשביל המבחן אלא גם כדי להבין כי בסוף זה הבסיס להמון דברים שתלמדו בתואר, תשקיעו והציון ישתלם!", "timestamp": 1665237250389}, {"author": "אושרת חניא", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בוריס\nחוות דעת - הרצאות: מרצה מעולה, רואים את ההשקעה שלו בשיעורים\n\nשם המתרגל/ת: עימאד\nחוות דעת - תרגולים: מתרגל מעולה, מסביר בצורה מעניינת ומסור\n\nשעורי הבית: סבירים\n\nהמבחן: סביר\n\nהשורה התחתונה:", "timestamp": 1672135441427}, {"author": "נעמה לילה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: מעולות, יש לו כל כך הרבה ידע והוא מעביר אותו מצויין בעיני, היה ממש כיף ללמוד אצלו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676625791075}, {"author": ":)", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: פרופ' מוריס אייזן\n\nחוות דעת - הרצאות: \nהתחלתי אצל עידו שהרבה אוהבים, אני פחות התחברתי, להרגשתי הוא היה קצת מפוזר (גם השעות היו קשות).\nמוריס מרצה מדהים ובן אדם מדהים עוד יותר! מרגישים שהוא אוהב ללמד, והוא עושה את זה בהמון קלילות וחוש הומור. הוא באמת מחובר לכיתה, מתעכב ומסביר, ועושה מאמץ לזכור את שמות התלמידים.\n\nהמבחן:\nמועד א' - בהשוואה לשנים קודמות, דרש קצת יותר הבנה תיאורטית. אבל בסך הכל אפשר לעבור עם ציון יפה.", "timestamp": 1676733242018}, {"author": "דבורית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: הרצאות מאוד מעניינות לדעתי, העביר את החומר בצורה מעניינת ואוהב לסכם בנקודות את החומר, מתרגל את החומר במהלך ההרצאה. מאוד ממליצה. ההרצאות היו בשעות הערב כך שהיה קשה גם לנו הסטודנטים וגם למרצה אבל עדיין היו הרצאות מועילות, מאמינה שבשעות נורמליות יהיה בכלל טוב.\n\nשם המתרגל/ת: עיד עימאד\nחוות דעת - תרגולים: מתרגל מדהים מומלץ מאוד, אך הכיתה מאוד מאוד עמוסה כי הוא ידוע כמתרגל טוב, הקרב על מציאת מקום כל תרגול היה מתיש. אם ניגשים אליו אחרי הרצאה לשאול שאלות הוא עונה לכולם אבל קחו בחשבון שהתור הוא ארוך.\n\nשעורי הבית: היו שיעורים יותר קלים והיו כאלה קשים שלא הבנו את הקשר בין הרמה שתרגלנו לרמת השאלות בשיעורים. \n\nהמבחן: מרגיש שבא לבלבל\n\nהשורה התחתונה: קורס מרתק ובעיניי חייב להיות רקע דיי נרחב בכימיה כדי להיות על חומר במהלך הסמסטר.", "timestamp": 1676971137379}, {"author": "pKb", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: פרופ' מוריס אייזן\nחוות דעת - הרצאות:  מוריס מרצה בהנאה רבה. משקיע בטירוף בסטודנטים. כל הרצאה מתחילה ב 10 דק לפחות של סיכום של ההרצאה הקודמת, שלא נאבד אותו. עונה לכל השאלות, מרגיש שהוא ממש נהנה ללמד, הנושאים עוברים ברור ומובן. כל הראצה הייתה חוויה. מומלץ בחום! \n\nהחסרון היחיד: המצגות שהוא משתמש בהן יחסית עמוסות לשאר המצגות של מרצים אחרים בקורס. כלומר הוא מעביר את אותו החומר בהרבה יותר שקפים. נקודה למחשבה. \n\nשם המתרגל/ת: עידן אביגדורי - בהתחלה הלכתי אליו ולא התחברתי, הוא לא מתרגל רע אבל מרגיש שהוא \"עייף\" וזה ניכר באיך שהתרגול עובר. \nפעם אחת בתחילת הסמסטר החליפה אותו המתרגלת עמית מנור-ערמון, ומאז עשיתי מאמץ להתאים את המערכת שלי כדי שיסתדר לי ללכת לתרגול שלה. מאד מסודרת, אכפת לה מאד ועונה המון לשאלות של סטודנטים, מרגיש שחשוב לה שנבין את החומר. \n\nשעורי הבית: לעיתים קךים יותר ולעיתים קשים יותר, ולא תמיד יש מתאם בין ש.ב לתרגול להרצאה. למרות זאת ממש ממליץ לעבור שוב לפני שניגשים לגיליון על התרגול וההרצאות של אותו שבוע, זה עושה סדר בראש ומקצר משמעותית את זמן הפתרון. \n\nהמבחן: היו המון טענות שהוא היה קשה יותר משנים קודמות או דרש יותר ידע תיאורטי. הוא לא היה קל - אבל בטח לא קשה בצורה בלתי רגילה. לחרוש טוב טוב לפני המבחן יביא אתכם לציון סבבה. \n\nהשורה התחתונה: לא הייתי לוקח כקורס בחירה אם אני לא חייב, כי הוא עמוס ומפוצץ בחומר, אפשר לשאול על המון סוגי דברים ואין מבנה קבוע למבחנים. מי שכן חייב לקחת, ממש ממליץ לא \"לאבד\" במהלך הסמסטר ולהיות על, בגלל כמות החומר הגדולה, כדי להביטח שכשאתם מגיעים למבחן אתם מגיעים הכי מוכנים שיש.", "timestamp": 1677052862181}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: אחת המרצות הטובות ביותר שלמדתי אצלן. יודעת את החומר בצורה מצוינת, מעבירה אותו באופן מעניין ומשתדלת לענות על מקסימום שאלות בכל הרצאה. מעבר לכך היא בן אדם מאוד נחמד, ותמיד מעודדת לבוא לשעות קבלה (לעיתים היא מקיימת כמה בשבוע) ולשלוח לה מיילים עם שאלות במידה ומשהו לא מובן. אני מאוד נהניתי מההרצאות במהלך הסמסטר וממליץ להגיע.\n\nשם המתרגל/ת: עידן אביגדורי\nחוות דעת - תרגולים: עידן מתרגל טוב, לעיתים יכול להרגיש מעט עייף אבל הוא נחמד מאוד ויודע להסביר טוב. הוא גם עונה לכולם על שאלות וזה מאוד מועיל. \n\nשעורי הבית: אצלנו שיעורי הבית היו גיליונות במודל עם 5 עד 8 שאלות (בממוצע) שחלקן אמריקאיות וחלקן פתוחות (עם תשובה מספרית). היה צריך להוציא 70 בגיליון כדי לעבור, והיה צריך לעבור 9 מתוך 12 גיליונות בשביל מגן מלא של 10%. בסה\"כ הגיליונות היו סבבה לגמרי ולא עמוסים במיוחד, היו כמה בודדים שהיו בהם שאלות טיפה קשות אבל לא משהו בלתי פתיר. הם סיפקו מגן טוב ועזרו לעכל את החומר.\n\nהמבחן: בעיני המבחן היה די הוגן, היו מעט שאלות שעסקו במקרים חריגים או שהיו מעט טריקיות אבל מעבר לזה היה מבחן הוגן בסה\"כ, במיוחד גם בגלל שאפשר לצבור 105 נקודות בסה\"כ (אבל הציון חסום ע\"י 100).\n\nהשורה התחתונה: אולי אני לא הכי אובייקטיבי כי יש לי רקע בכימיה מהתיכון, אבל בתור סטודנט למדמ\"ח שלוקח את הקורס כבחירה מדעית מאוד נהניתי ממנו במהלך הסמסטר. הסגל מצוין ואכפתי, החומר לא היה קשה והועבר בצורה מעניינת, ובאופן כללי הקורס התנהל בצורה מצוינת.", "timestamp": 1677497239892}, {"author": "76 פרייאר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאין הקלטות, גלית נחמדה אבל רצה מהר ובתכלס לרוב מתעכבת כלכך הרבה על הסיפור שעד שמגיעים לתכלס מאבדים ריכוז. הפקתי יותר מללמוד מהספרים של עמנואל ולא לבוא. חשוב לוודא מה בסילבוס הפעם מהספר כל שנה ולהבין באמת מה הולך שם, כניינים מתחילים להסתבך בחלק ב וחלק ג שלו קצת קשה להבנה\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: \nחמודה ומסבירה. התרגולים בנויים טוב ומכילים דוגמאות לדברים שגם יכולים להופיע במבחן לעיתים \nשעורי הבית: \nשבועיים, ממוחזרים צריך להוציא בהם 70 כדי לקבל 100 בחלק שיעורי בית ולא צריך ממש להתאבד על כל שאלה, מספיק להבין\nהמבחן: \n\nהשורה התחתונה: קורס שאפשר להצליח בו גם למי שאין בסיס בהנחה ומודעים לזה שאפשר וכדאי לא לבוא להרצאות.\nתדאגו כבר במהלך הקורס לבקש שיוסיפו דברים לדף נוסחאות ותשימו דגש על המרות כי המבחנים מניאקים בזה ויש ממש מסיחים עם המספר שיוצא לכם לפני המרת יחידות.", "timestamp": 1677750875415}, {"author": "סטונדט לרפואה", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: גלית \nחוות דעת - הרצאות: \nגלית מדברת ממש מהרררר וקצת קשה לעקוב אחריה. כמעט בלתי אפשרי לעקוב אחריה וגם לסכם, בהצלחה :)\nההרצאות בהתחלה לא מותאמות לכך שסטודנטים לרפואה ללא סיווג בכימיה עוברים אותה, כך שהקורס מתחיל קשה ולא ברור. בסופו של דבר מתחילים להבין מה קורה.\nעדיין, קורס קשה והרצאות שיכולות להיות מאוד מאוד קשות.\nיאמר לזכותה שגלית חמודה ויוצרת אווירה נעימה ונחמדה בכיתה. היא מאוד אוהבת את החומר ורואים את זה.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: \nסבבה. קריטיייםםםםםםםםםםםםםםם.\nאי אפשר להבין את הקורס בלי התרגולים. ללמוד מההרצאות לא מלמד איך לפתור תרגילים, אז חשוב לבוא.\n\nשעורי הבית: \nבסדר. יש קטע שמרנדמים תרגילים ככה שאפשר ליפול על שאלות קליליות וכיפיות ובפעם אחרת ליפול על השאלות הכי קשות בעולם.\nאפשרי ממש לקבל בהם מספיק כדי להשיג את ה100 על התרגולים.\n\nהמבחן: \nקשה. המרצים אוהבים לחדש :,) \nלדעתי, לא הוגן.\nמעלים לאורך הקורס תרגילי עזר בכל מיני נושאים עם פתרונות ועוזר לתרגל אותם לפני המבחן, אם המודל לא נופל במתקפת סייבר :)\n\n\nהשורה התחתונה: קורס קשה אבל אפשרי. מומלץ להיעזר בעוד דברים מעבר להרצאות ותרגולים.", "timestamp": 1678638628585}, {"author": "סטודנט לרפואה", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: ההרצאות היו מאוד עמוסות ומבולגנות וברוב הסמסטר היה קשה לעקוב אחריה. עם זאת לגלית באמת אכפת מהסטודנטים והיא נותנת הרבה מהזמן האישי שלה, לכן מומלץ לקבוע איתה שעות קבלה לאורך הסמסטר\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: לעמית מאוד חשובה ההבנה והתרגולים בקצב טוב ומאוד עוזרים להטעמת החומר\n\nשעורי הבית: רמת הקושי משתנה בהתאם לנושאים\n\nהמבחן: המבחן היה טריקי בעיני ובחן דברים מאוד ספציפים\n\nהשורה התחתונה: קורס עמוס שדורש השקעה לאורך הסמסטר בגלל כמות החומר הגדולה", "timestamp": 1678992228443}, {"author": "nitzanL", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: עידו מרצה טוב אבל יש ככ הרבה חומר תאוריה בקורס ולא מוצאים את הפרקטיקה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עימאד המלך! \n\nשעורי הבית: הזייה \n\nהמבחן: קשה רצח \n\nהשורה התחתונה: צריך לעבור", "timestamp": 1679222820084}, {"author": "Razan", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: ניסיתי את עידו אבל השעות שלו היו בערב וזה ממש היה משעמם לי אז עברתי למוריס , (לא הייתה לי אפשרות להיות עם גלית) מוריס הוא המרצה האחראי ואוהב מאוד לדבר על דברים שהם לא קשורים והרבה פעמים הוא מבלבל ומדבר מהר אבל בעיקרון איכשהו הצלחתי לעקוב אחריו. אני לא מסוגלת ללמוד לבד ולהיות עם משמעת עצמית ולכן העדפתי ללכת להרצאות למרות שלא יודעת עד כמה תרמו לי.\n\nשם המתרגל/ת: עיד עמאד\nחוות דעת - תרגולים: \nהוא היה ממש ממש חמוד , הכיתה שלו די עמוסה אבל הוא הכי טוב מבין המרצים , רמת התרגולים ממש נמוכה ביחס למבחן אבל חשוב להיות בתרגול על מנת להבין את הבסיס ומצאתי שעיד עמאד תירגל דברים שחלק מהמתרגלים לא תורגלו והדברים האלה הופיעו במועד ב .\n\nשעורי הבית: מתסכלים רצח ודורשים כמה שעות טובות ! והם די אינטנסיביים לא הייתי אומרת שהם ברמת המבחן אבל חשוב ממש לעשות אותם בשביל הבנה , השב דורשים תשובה סופית מספרית והרבה פעמים עשרונית.\n\nהמבחן: אמריקאי 21 שאלות (שאלת בונוס אחת) , הרמה שלו ממש מעל התרגולים , תתרגלו מהספר של כימיה מהייסוד או ממבחנים של שנים קודמות רק ככה מצליחים להבין מה הרמה שצריך למבחן \n\nהשורה התחתונה: קורס בסיס להרבה דברים להנדסות הכימיות למיניהן אז תשקיעו בו ותעברו לפחות כי הוא קורס קדם להרבה קורסים.", "timestamp": 1679691314085}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מוריס \nהרצאות: לא הבנתי כלום מההרצאת, למדתי מ3 ספרים מאס\"ט (ממליצה מאוד).\n\nשם המתרגל/ת: עיד עימאד\nתרגולים: אומרים שהוא מתרגל מדהים. \n\nהמבחן: ניגשתי למועד ב והיה קשה מאוד ביחס לשאר המבחנים.\nקורס לא קל בכלל וצריך השקעה(לא קשה להשיג ציון גבוה, צריך להבין החומר מאוד מאוד טוב), תשקיעו טוב בקורס 5 נקודות!!!.", "timestamp": 1680111638798}, {"author": "יוני", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מומלץ מאוד\nשעורי הבית: לא הרבה", "timestamp": 1713636216241}, {"author": "נטע", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מוריס אייזן\nחוות דעת - הרצאות: מוריס מתוק אמיתי. רואים את התשוקה שלו למקצוע והוא ממש מנסה ליצור אווירה נעימה בהרצאה ולזכור את השמות של כולם! לא מובן מאליו. לפעמים העברית שלו לא הכי מחודדת ורוב המצגות באנגלית. ממליצה גם על עידו ממש! החליף את מוריס כמה פעמים והוא מעולה, פשוט ההרצאות שלו קבוע ב16:30 ולי זה ממש קשה.\n\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: מלאת אנרגיה, וזה חשוב כשהתרגולים שלה בסוף היום יחסית. מסבירה את החומר בצורה מעולה ומחברת את זה ליומ-יום, מה שעוזר ממש להבנה. היא מוכנה להסביר גם מיליון פעם כדי שנבין ונצליח.\nבתאכלס גם המתרגלים האחרים מעולים- רואד ועימאד. אז שווה לראות מי הכי מתאים לכם. לא תפסידו אצל אף אחד. כולם מעבירים את אותה מצגת תרגול, ככה שיש קו אחיד וקצב אחיד. מושלם.\n\nשעורי הבית: 10% מגן. נפתח כל שבוע, ביום קבוע. יש תאריכים מראש לכל הסמסטר (היה נוח לתכנן את הזמן בהתאם). היו הוגנים ממש. צריך לעבור 8 או 7 מתוך עשר, כשעובר זה 70, ואז פשוט מקבלים 100 למגן.\n\nהמבחן: היה ממש הוגן! מוריס קצת אוהב לשחזר שאלות שלו, אך אין הרבה מבחנים בהם הוא היה מרצה אחראי. \n\nהשורה התחתונה: קורס חמוד, כשכל הצוות באמת תותחים ומעניינים. שווה להשקיע בו כי 5 נק\"ז ולהבין את החומר לעומקו כי הוא באמת הבסיס להמשך.", "timestamp": 1715153914745}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: \nמרצה טוב שיודע מה שהוא עושה , מסביר בצורה מאוד מעניינת ויודע לעניין את הסטודנטים .\nאיתו הצלחתי להתרכז במשך שעתיים רצוף בלו לאבד אותו לרגע.\n\nשם המתרגל/ת: עימאד עיד\nחוות דעת - תרגולים: \nמלך!!\nשווה להגיע אליו!\nשעורי הבית: \nסבירים, פעם בשבוע שאפשר לסיים באותו יום\nחשובים להבנת החומר\nהמבחן: \nאמיריקאי, מבחן טיפוסי של מוריס, תאורטי ומצריך חשיבה והבנה עמוקה של החומר, יחד עם זאת אפשר לעבור עם ציון טוב מאוד, שווה לשים לב להערות של מוריס לאורך כל הסמסטר לגבי המבחן כי ההערות האלו יצילו לכם את הקורס.\nהשורה התחתונה: קורס חובה אבל מעניין, עמוס קצת אבל לא בלתי אפשרי, להרבה מסלולים נכשל בקורס יעכב לכם את התואר לכן אל תקחו סיכון ותשקיעו עד הסוף.\nמי שמחפש קורס בחירה מדעית אתם בטח לא יודעים כלום בכימיה אז לכו לכימיה כללית .", "timestamp": 1715156763256}, {"author": "ו", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: עידו \nחוות דעת - הרצאות: עידו חמוד אבל לא מצליח להגיע לשורה האחרונה בהרצאות שלו אז ויתרתי על להגיע באיזשהו שלב. יש ספרים מעולים של עמנואל פאר מאסט שמסכמים את החומר ממש טוב \n\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: מתרגלת כיפית מאוד, מסבירה את החומר בגובה עיניים והופכת את התרגול לכיפי ומעניין \n\nשעורי הבית: סבבה לגמרי \n\nהמבחן: קשה מאוד וחסר פרופורציה לשיעורי בית ולתרגולים. מומלץ להשקיע הרבה בלהבין את החומר כי רוב המבחן תיאורטי\n\nהשורה התחתונה: קורס גדול של 5 נקז עם היקף חומר גדול ולא פשוט", "timestamp": 1715179718848}, {"author": "OX", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: מסביר טוב, אם כי מרגיש מפוזר, קשה קצת לעקוב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מתעתע, שאלות טריקיות.", "timestamp": 1715513092578}, {"author": "change2000", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: אחרי שוק טוטאלי ממולים אצל מוריס עברתי לעידו. עידו מרצה מעולה. הוא מסביר הכל עד שכולם מבינים והוא גם מסביר טוב. הבעיה איתו שהוא מלמד בשעות מאוחרות. מצד שני זה גם יתרון כי הכיתה קטנה יחסית.\nלקראת סוף הסמסטר הרגיש שהוא יותר מידי נגרר לדוגמאות, אבל המצב אצל מוריס לא היה יותר טוב.\n\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: לא יצא לי להיות עם המתרגלים האחרים אבל היא פשוט תותחית. מסבירה את התכלס באיך לפתור תרגילים. הבעיה הייתה כשהסטודנטים שלמדו אצל מוריס היו מעכבים את התרגול והופכים אותו להרצאה, שואלים שאלות בסיסיות שאם רק היו עוברים 5 דקות שוב על החומר או שואלים את מוריס בהרצאה עצמה היו מבינים. זה גרם לכך שאוריה הייתה ממש רצה את השאלות האחרונות של התרגול כדי להספיק ואלה היו השאלות הכי חשובות ממבחנים.\n\nשעורי הבית: קלים. אל תאמינו להם זה שמקבלים בהם 100 זה שקר לקראת המבחן\n\nהמבחן: קשה להחריד. לא תואם את רמות השאלות של שיעורי הבית או של התרגולים.\n\nהשורה התחתונה: בגלל המבחן הקורס הזה קשה מאוד לעבור ולא להסתכל אחורה בהצלחה באורגנית", "timestamp": 1715897456183}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: הוא אוהב מה שהוא מלמד, עונה על שאלות, מציין מתי כדאי להדגיש בלמידה, אבל לפעמים הוא מגזים בהסבר (נכנס לפרטים לא חשובים באיך הגיעו לנוסחה למשל)\n\nשם המתרגל/ת: אוריה\nחוות דעת - אחלה מתרגלת, מצחיקה, נותנת מדביקות, מלמדת בדיוק איך צריך לגשת לשאלה ולא יותר או פחות.\n\nשעורי הבית: נעימים, לא כל כך קשים, אבל עוזרים בהבנה\n\nהמבחן: מבחן הוגן, יש 3-4 שאלות קשות אבל אפשריות", "timestamp": 1716228910542}, {"author": "Shahar", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: \nעידו מרצה טוב, הוא ממש אוהב את החומר. הוא ברור ועונה לשאלות של כולם בלי לתת הרגשה שאתם טיפשים (נדיר בטכניון). \n\nשם המתרגל/ת: שרון אוריה\nחוות דעת - תרגולים: מושלמת, אל תלכו לאף אחד אחר אם יש לכם אפשרות ללכת אליה. היא מאוד ברורה, מסבירה את החומר והתרגילים בצורה מדהימה. \n(בונוס, היא נותנת מדבקות וזו כל המוטיבציה שצריך). \n\nשעורי הבית: קיימים אבל לא נוראים יותר מדי\n\nהמבחן: מזעזע, הם מרכיבים אותו כך שבכל התשובות יש מסיחים והניסוח בעברית מאוד מוזר. ממליצה להתחיל לתרגל מבחנים מוקדם כדי להתרגל. \n\nהשורה התחתונה:", "timestamp": 1716829607747}, {"author": "בני", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: \nבהתחלה היה קשה לעקוב אחריו אבל די מהר הסתדרתי.\nמרצה מצוין ורואים שהוא אוהב את העבודה שלו, אכפת לו מאוד שהסטודנטים יצליחו, ההרצאות סופר אינטראקטיביות, מגיע 45 דקות לפני כל הרצאה ופנוי לשאלות בזמן הזה. \n\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: \nנחמדה, מעבירה תרגולים טוב. הרבה מימז.\n\nשעורי הבית: \nקלילים, רק במודל.\n\nהמבחן:\nסביר פלוס. \n\nהשורה התחתונה: \nתעשו הרבה מבחנים מהעבר, לא קשה להשיג ציון טוב.", "timestamp": 1718763932802}]}