{"posts": [{"author": "כימיהההה", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אלי קולודני\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, החומר מוסבר בצורה טובה ורחבה אבל לפעמים בתחילת ההרצאה יש הקדמות לא רלוונטיות כל כך.\n\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: תרגולים מעולים! יצאתי מהתרגולים בהרגשה שאני יודע את החומר. המתרגלת עונה על כל שאלה בצורה מקצועית ואם צריך אפשר להגיע לשעות קבלה.\nשעורי הבית: לא מעמיסים יותר מידי, מומלץ לעשות.\n\nשם מדריכת המעבדה: מעיין סויסה\nחוות דעת- לעיתים מגיעה לא מוכנה לניסוי, מורידה בדוחות על דברים שהיא אומרת לעשות. מורידה נקודות על הדברים הכי קטנים. דוח שמקבל אצלה 80 כנראה היה מקבל 100 אצל מדריך אחר. עונה במייל אחרי הרבה מאוד זמן. אני הרגשתי שהיא מחפשת על מה להוריד.\n\nהמבחן:  קצת יותר קשה משיעורי הבית, אבל אפשר להצליח בו.\n\nהשורה התחתונה: למדתי הרבה בקורס, קורס מומלץ.", "timestamp": 1634899138868}, {"author": "ליאור מאיר", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: לא רלוונטיות.\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: מתרגלת אלופה ברמות\n\nשעורי הבית: רק 5 גליונות לא סיפור\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1658424301864}, {"author": "io", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: משעממות\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: המתרגלת הכי טובה שפגשתי! גם מלמדת בצורה ממש טובה וגם ממש אכפת לה מהסטודנטים\n\nשעורי הבית: אין כמעט אבל הם לא פשוטים\n\nהמבחן: נגלה בקרוב\n\nהשורה התחתונה:", "timestamp": 1658815599460}, {"author": "ליאור מאיר", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: הצאות גרועות ביותר\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1660405899558}, {"author": "שלומקה", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: לא מאוד מעניינות וברורות.. גולשת לנושאים לא קשורים\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון!!!! לא הייתי כמעט בהרצאות אבל מורן הצילה את הקורס הזה!!!\n\nשעורי הבית: אין כמעט אבל די קשים ולא ברורים\n\nהמבחן: קשה ומוזר עם חומר פתוח \nאצל לילך הממוצע היה נמוך ב10 נקודות\n\nהשורה התחתונה:", "timestamp": 1665229739272}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ילך עמירב\nחוות דעת - הרצאות: לא הכי מעניינות ובשעה מאוד לא נוחה\n\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: מדהימה! מורן היא הסיבה שעוברים את הקורס.\n\nשעורי הבית: הגשות במודל, לא פשוטות אבל עוזרות להבין את החומר\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס חובה", "timestamp": 1690806607436}, {"author": "הצרחות של גבריאלה", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: לילך עמירב\nחוות דעת - הרצאות: \nלילך טוענת שהיא מעבירה את הקורס לא בגלל כישורי ההרצאה שלה, והיא די צודקת. ההרצאות היו מאוחר יחסית, בסוף היום, וכל הרצאה היא פשוט מלמלה משהו בצורה מפוזרת מול ה-15 אנשים שעדיין הגיעו אליה. היא גם גרמה לחלק ניכר מהאנשים להתעצבן עליה בהרצאה הראשונה כשהיא התחילה לדבר על פוליטיקה בסוף ההרצאה... יש לי תחושה שהיא פשוט מכחישה את קיום הקורס הזה...\n\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: \nאם יש משהו שמפצה על כל הדברים הרעים בקורס אלה התרגולים עם מורן. אפשר להגיד שמורן הייתה בשבילנו גם המרצה וגם המתרגלת, והיא מעולה בזה. אתם תשמעו מלא פעמים במהלך הסמסטר, גם מלילך, שמורן היא מתרגלת מצטיינת מתמידה שכבר שנים סוחבת את הקורס המגעיל הזה איתה ועושה הרבה מעבר למה שצריך בשבילו.\n\nשעורי הבית: \nלא הרבה, היו 3 גליונות חובה מתוך 5 סה\"כ כי אין הרבה על מה לשאול. יש רק 3-4 נושאים בקורס.\n\nהמבחן: \nלי הרגיש די מגעיל, כי רובו (לפחות 60%) היה על אנטרופיה ורובו המוחלט על תרמודינמיקה, נושא שאני אישית שונא. היו בו גם כל מיני שאלות לא רגילות, לאו דווקא מסובכות אבל מאוד לא מובנות. חבל לי שמורן תצטרך לבדוק עכשיו את המבחנים של כל הקורס...\n\nמעבדות:\nזהה ליסודות א. אותו המקום, אותן השעות, אותה גבריאלה שצורחת על סטודנטים. זה החלק המסריח של הקורס אבל אין מה לעשות איתו. היתרון היחיד זה שהן מהוות עוד 15% תקף ורוב הסטודנטים מוציאים מעל ל-80 בהן.\n\nהשורה התחתונה: \nקורס משלים ליסודות א, שמרגיש כמו מבוא לתרמודינמיקה. מורחים 4 נושאים על סמסטר שלם, מה שאפשר היה לסיים בקלות בחצי סמסטר אם המרצה של יסודות א (רננה) הייתה מלמדת את הקורס. סהכ קורס פח ומיותר", "timestamp": 1690811385673}, {"author": "ד מ ו ק ר ט י ה", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: קשות מאוד, גם בגלל השעה אבל גם בגלל האווירה והמרצה. בהרצאה הראשונה הרגשתי שהיא מנסה לכפות עלינו לנהל שיח פוליטי על הרפורמה ולהצטרף למחאה על חשבון סוף ההרצאה. באופן כללי מאוד מונוטונית ומפוזרת. ביקשו ממנה להעלות את המצגות למודל, אך זה לקח לה מעל חודש. באופן כללי הבנתי בשלב מסוים שההרצאות לא מועילות יותר עבורי, כנראה שעוד הבינו את זה כי בהרצאה הראשונה היו באזור ה40 ולקראת הסוף באו 10-15.\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: היא מפצה על לילך, אבל גם כאן השעות היוו אתגר עבורי, קשה ללמוד בארבע וחצי... בכל מקרה מרגיש לי שאכפת לה ושהיא מחפשת להקל בכל דרך שהיא. \n\nשעורי הבית: היו סה\"כ 4 גיליונות ועוד גיליון לתרגול. סה\"כ הייתי מעדיף שהיו יותר כדי להישאר על זה לאורך הסמסטר, לדעתי הם מתחת לרמת המבחן.\n\nהמבחן: דיי נורא, ארוך מאוד ומבוסס מאוד על נושא אחד  (אנטרופיה) שנלמד בסוף הסמסטר. המבחן עם חומר פתוח ולכן הוא יותר קשה ומתקיל, מביאים שאלות של נכון/לא נכון עם נימוקים שזה מזעזע בפני עצמו, יחד עם שאלות אמריקאיות שמזכירות חדוא 1. יש גם 2 שאלות פתוחות עם מיליון סעיפים. בהצלחה עם זה, לא מקנא בכם.\n\nהשורה התחתונה: הקורס מאוד מוזר ודיי חוזר על חצי מקורס יסודות א, בכל מקרה אל תבזבזו זמן על ההרצאות, חבל על הזמן ועל כאבי הראש בשש בערב.", "timestamp": 1691434004572}, {"author": "נעה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לילך\nחוות דעת - הרצאות: הייתי בהרצאה אחת והבנתי שאין סיבה להמשיך ללכת, לילך מבזבזת זמן הרצאה על דברים שלא קשורים לקורס וזה הרגיש כמו בזבוז זמן \n\nשם המתרגל/ת: מורן \nחוות דעת - תרגולים: הצילה את הקורס הזה, מבינה טוב מאוד שלילך לא מלמדת ולימדה את כל הקורס בעצמה, אכפתית מאוד ועזרה לנו בכל דבר.\n\nשעורי הבית: 3 או 4 גליונות לא מאוד מסובכים, חשוב לעשות כדי לוודא שמבינים את החומר \n\nהמבחן: לנו היה עם חומר פתוח, מבחן קצת מבלבל וטריקי אבל בסך הכל אפשר להוציא ציונים טובים מאוד. \n\nהשורה התחתונה: קורס שאמור להשלים את יסודות א', בפועל לומדים בו יחסית מעט חומר לקורס הקודם. ממליצה ממש (במיוחד עם לא הולכים להרצאות) להכין סיכום מסודר של החומר שנלמד עוד במהלך הסמסטר שיהיה לחומר הפתוח וגם לשים לב שלא נאבדים \nוכמובן הספרים של עמנואל פאר הם הצלה רצינית גם בקורס הזה.", "timestamp": 1695187833253}]}