{"posts": [{"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אמנון סטנגר.\nחוות דעת - הרצאות: מיותרות, מאוד מרחיב בתיאוריה שלא באמת צריך להבין אותה לעומק.\n\nשם המתרגל/ת: איתי מסד.\nחוות דעת - תרגולים:  מתרגל מעולה, אפשר ללמוד הכל נטו מהתרגולים. הוא עונה על כל שאלה ומסביר בצורה טובה.\n\nשעורי הבית: מאוד עמוסים, יש אחת כ שבוע , סך הכל 12 הגשות, צריך להשקיע מלא זמן על כל הגשה אבל זה שווה את ההשקעה כי המגן הוא 35%.\n\nהמבחן: היה 50% מהמבחן משוחזר משיעורי בית, שאר המבחן היו שאלות מאתגרות אבל למי שלמד כל הסמסטר יכול להסתדר.\n\nהשורה התחתונה: קורס מעולה ומעניין מאוד אבל צריך להקפיד על למידה רציפה לאורך כל הסמסטר כי כל דבר חדש מסתמך על מה שלמדנו קודם.", "timestamp": 1645004824858}, {"author": "דילס-אדלר", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אמנון שטנגר\nחוות דעת - הרצאות: באמת איש מעניין ומביא הרבה עניין והקשר לתהליכים אמיתיים בהרצאות אבל לפעמיים סוטה הרבה מהנושא ומקל מאוד לאבד אותו. מלמד ממצגות משנות ה-80 עם אנימציות מוזרות ומצגות לא אינפורמטיביות בעליל. כדאי להגיע לכל ההרצאות אם רוצים להצליח בקורס\n\nשם המתרגל/ת: איתי מסד\nחוות דעת - תרגולים: נסיךךךךך!!! עוזר בהכל מסביר לעומק כל נושא.\n\nשעורי הבית: כל שבוע הגשה, לרוב 2 שאלות שקיים להם רפרנס משנים קודמות ושאלה אחת לחדשה. השאלה החדשה לא פשוטה. שיעורי בית תקף אז כדאי להשקיע בהם\n\nהמבחן: 50% מהמבחן הוא שאלות משיעורי בית/תרגולים, 2-3 שאלות מתרגל שמי שהיה בקורס אמור לדעת לענות עליהם ושאלת מרצה שרמת הקושיה שלה תלויה באיך המרצה קם בבוקר לפני שהוא כתב אותה. מי שהגיש את כל שיעורי הבית ונכח בתירגולים יכול להוציא 80 \n\nהשורה התחתונה: קורס קשוח! אם יש אופציה לקחת קורס כימיה אורגנית אחר לעשות את זה!!", "timestamp": 1645456398139}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: צפיתי בכולן אבל הרגישו מיותרות, מצגות לא אינפורמטיביות ובאופן כללי הרגיש שזה מידע אקסטרה אבל לא נחוץ כדי להצליח\n\nשם המתרגל/ת: איתי מסד\nחוות דעת - תרגולים: קצת מבולגן על הלוח אבל מעבר לזה אחלה מתרגל, למדתי רק מהתרגולים וזה הספיק\n\nשעורי הבית: ממוחזרים חוץ משאלה אחת חדשה שלוקחת זמן אבל הערך שלהם חשוב\n\nהמבחן: קשה מאוד, יותר קשה מהשיעורי בית והתרגולים אבל אמנון נותן 50% מהתרגולים אז זה מקל \n\nהשורה התחתונה:", "timestamp": 1649184671052}, {"author": "malek igbaria", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אמנון שטינגר\nחוות דעת - הרצאות: \nיצא לפנסיה הסמסטר לא רלוונטי\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: \nתרגולים טובים מאוד תמיד הוא בא מוכן ומספיר באופן מסודר וברור, רק לפני התרגולים ממליץ לעבור טוב מאוד על ההרצאות\nשעורי הבית:\nחלק מהן היה מאוד בעייתי תריך להשקיע הרבה אבל לפחות היה לנו 50% מהמבחן משעורי הבית\nהמבחן: ארוך מאוד מאוד, המבחן השנה היה יחסית משמעותית יותר קשה עם 50% שיעורי בית היה ממוצע א 61, אז במילים אחרות צריך להתכונן טוב מאוד ובדרך כלל אפשר לקבל ציון גבוה\nהשורה התחתונה: המפתח להצלחה בקורס הוא השקעה לאורך הסמסטר.", "timestamp": 1679732897612}, {"author": "כלורופום", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יואב איישן\nחוות דעת - הרצאות: אישית התחברתי להרצאות, יואב השתדל שנבין ודאג להעלות את המצגות כוידאו אחרי כל הרצאה. המצגות היו באנגלית משום מה.\n\nשם המתרגל/ת: יובל זרטל\nחוות דעת - תרגולים: מתרגל לא רע. היה יכול להספיק יותר שאלות לתרגול אם לא היו מפריעים לו עם שאלות מטומטמות כל 5 דקות...\n\nשעורי הבית: לא היו\n\nהמבחן: 5 שאלות, בוחרים 1 מתוך ה-2 הראשונות ו-2 מה-3 האחרות. היה הוגן בסה\"כ, כן דרש לזכור מנגנונים ותגובות לא מדף הנוסחאות. \n\nהשורה התחתונה: קורס יחסית עמוס, צריך להשקיע, להבין ולעבור על המצגות לפני כל הרצאה. אם מתחברים לנושא- יכול להיות כיף.", "timestamp": 1714740618826}, {"author": "Iohannes Magnvs", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: פרופ. יואב איישן\nחוות דעת - הרצאות: \nבגדול הבנתי שיואב טוב יותר מהמרצים שהיו לפניו. הרבה חומר היה לא מובן אבל לא בגלל יואב אלא בגלל שהחומר עצמו קשה להבנה, ויואב יודע את זה. זאת פעם ראשונה שהוא מלמד כימאים (לרוב מלמד את הרפואנים) וניכר כי הוא השתדל לעשות הכל כדי שנבין. הוא שאל ווידא אם כולם הבינו הכל ואם מישהו לא הבין הוא מוכן להסביר לו עוד פעם. לפעמים היו לו גם יציאות מצחיקות על פטנטים וצרפתים :)\n\nשם המתרגל/ת:  יובל זרטל\nחוות דעת - תרגולים: \nיובל הוא (נכון לרגע זה) הסטודנט היחיד שעושה תואר מתקדם אצל יואב ולכן הם קצת הזכירו לי אבא ובן . הוא כל הזמן הגיע להרצאות והיה בקשר עם יואב. התרגולים עצמם הרגישו לי מועילים, וגם שיעורי הבית, ולדעתי יובל העביר אותם בצורה מספיק טובה. הבעיה היא שכש-80% מהסטודנטים בכיתה (בסביבות ה10-15 איש) לא הבינו בכלל את החומר התרגולים הופכים לשעות קבלה ואז כל שניה קוטעים אותו.\n\nשעורי הבית: \nלא חובה, אבל לדעתי היה להם הרבה ערך מוסף להבנה של החומר. גליונות שבועיים שיובל נותן עליהם משוב. הם לא קלים מידי אבל הקושי מוצדק.\n\nהמבחן: \nבניגוד למה שציפיתי המבחן היה ממש סביר. היה צריך לבחור שאלה אחת מ-2 גדולות (סביבות ה50 נק) ועוד 2 מתוך 3 ששוות כ-20\\30 נק כל אחת. 3 מכל ה-5 שאלות היו סינתזה, והאמת שיואב די רמז לזה. החיסרון היחיד הוא שהמבחן הוא 100% מהציון אצל יואב אז שווה להשקיע בלמידה מעבר למה שצריך.\n\nהשורה התחתונה: \nאני אישית מתעב כימיה אורגנית אבל זה קורס חובה אז אין לי הרבה ברירה. אם אתם רוצים להיות על החומר כל הסמסטר ויואב הוא המרצה אז המלצה שלי- אל תעתיקו בהרצאות, תקשיבו למה שהוא אומר.", "timestamp": 1714809179768}, {"author": "ציקלו-הקסן חוף מתקפל", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יואב אישן\nחוות דעת - הרצאות: אחלה מרצה! ניכר מאוד שאכפת לו מהתלמידים, ענה לי על כל השאלות במייל ואף שלח לי מקורות לחומרים שהתקשיתי איתם, תמיד בהרצאה היה מוודא שכולם מבינים ומדגיש שוב ושוב שלא להתבייש לשאול שאלות.\n\nשם המתרגל/ת: יובל זלצר\nחוות דעת - תרגולים: אחלה מתרגל, ממש עוזר להבין ולהפנים את החומר\n\nשעורי הבית: די מאתגרים, דורשים חשיבה יצירתית טובה, בניגוד לכל קורס אחר יש משוב מיידי ומפורט, אז גם אשכרה עוזרים לשפר טעויות\n\nהמבחן: היה קל יותר ממה שחשבתי שיהיה\n\nהשורה התחתונה: קורס מדהים! תחום מרתק, ממש שוקל לעשות תואר שני בתחום הסינתזה וכימיה אורגנית", "timestamp": 1716320279196}]}