{"posts": [{"author": "שם", "semester": "201902", "text": "בתחילת הסמסטר הקורס קליל וקל להבנה וככל שמתקדמים יותר ההרצאות נהיות יותר עמוסות וקשה לעקוב אחרי החומר.\nרק אחרי שעוברים על כל החומר (בדגש על התמרות, אלמנציות ושיחלופים) אפשר להבין את ההרצאות המאוחרות יותר.\nכמעט כל שבוע יש הגשה שלוקח שעה/שעתיים לעשות - כדאי מאוד לעבור על התרגולים/דפי העזר וההרצאות כדי לעשות את ההגשות.\nאיך לומדים למבחן - מעבר על כל ההרצאות ופתירת כמה שיותר מבחנים משנים קודמות", "timestamp": 1597217880000}, {"author": "אני מעדיף למות", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות:  לא הועברו נכון פשוט זרקה על הסטודנטים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  בקושי סבירים ולא ברורים\n\nהמבחן: מוווווווווווווווות\n\nהשורה התחתונה: לא שווה כל שנייה של סבל שעברתי שם", "timestamp": 1598168279379}, {"author": "יניב יוקוביץ'", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: המרצה הכי טובה שהייתה לי בטכניון! שיטת הלימוד מצוינת! אין דבר אחד רע להגיד עליה\n\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: קצת שקטה אך שולטת בחומר כהלכה\n\nשעורי הבית: לא קלים אך ברובם מרופרנסים. יש 40% מגן בקורס.\n\nהמבחן: חוץ משאלה אחת רעה שניסתה לבדוק את יכולה ההסקנה שלנו על חומר שלא למדנו בקורס, הוא היה די הוגן.\n\nהשורה התחתונה: קורס חביב אך קל יותר לבעלי רקע כימי.", "timestamp": 1626092912017}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: מרצה חביבה סה\"כ, אך לא מעבירה את החומר מספיק ברור...\n\nשם המתרגל/ת: גיא מן\nחוות דעת - תרגולים: אחלה מתרגל, שולט בחומר, מסביר מצוין ומצחיק על הדרך \n\nשעורי הבית: כל שבוע גליון, לא פשוט... לרוב יש רפרנס אך לא לכולם.\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס מאתגר, דורש תפיסה מרחבית (דמיון בתלת מימד של מולקולות) וזיכרון טוב. די עמוס.", "timestamp": 1626099258772}, {"author": "Nikol Seleznev", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: מרצה טובה, מסבירה ברור\n\nשם המתרגל/ת: גיא מן \nחוות דעת - תרגולים: מתרגל טוב סהכ, אבל יש רק שעת תרגול שבועית אחת וזה בשום צורה לא מספיק\n\nשעורי הבית: גליון שיוצא אחת לשבוע, לא לקח יותר מ3 שעות לסיים אותו\n\nהמבחן: מבחן סהכ סבבה מי שלמד יוצא מעל 80 \n\nהשורה התחתונה: מעניין ממש אבל הקורס עצמו היה סופר מבולגן, ולא היה ברור במה צריך להתמקד. יש המון טעויות במבחני העבר לכן אני לא בחרתי ללמוד למבחן ע\"י פתרון מבחנים משנים קודמות", "timestamp": 1626601666232}, {"author": "ברוך שפטרנו", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: אחלה מרצה סהכ, מעבירה את החומר בצורה ברורה ומסודרת. בתחילת הסמסטר החומר הועבר ברוגע, ובסוף הסמסטר בצורה ממש מהירה מה שיצר קצת סלט בשני הנושאים האחרונים. \nלפעמים, מכניסה העשרה (בלי לומר שזו העשרה) מה שיוצר מעט בלאגן בלמידה למבחן. \nמדברת לאט קצת, לכן העדפתי לצפות בהקלטות.\n\nשם המתרגל/ת: עמית מנור + עידו אביגדורי\nחוות דעת - תרגולים: מתרגלים סבבה. לפעמים היה קשה להתרכז, אבל בסה\"כ החומר הועבר בצורה טובה.\n\nשעורי הבית: גיליון פורסם בערך אחת לשבועיים/ שבוע וחצי (לקראת סוף הסמסטר). כל גיליון לקח בערך 3-4 שעות. \nלא תמיד השאלות לא תאמו את מה שלמדנו. \nמומלץ ללכת לשעת קבלה. \nהרמה של העבודות כמו הרמה של המבחן.\n\nהמבחן: המבחן הוגן. מי שלמד במהלך הסמסטר יוציא מעל 80.\n\nהשורה התחתונה: קורס סבבה לגמרי. חשוב להיות על החומר במהלך הסמסטר ולהגיש את העבודות. \nלשים לב שהקורס משתנה דרסטית משנה לשנה, לכן לא מומלץ לתרגל מבחני עבר. אישית, בחרתי להפסיק להגיע לתרגולים לקראת סוף הסמסטר ולפתור אותם כהכנה למבחן. מומלץ למי שאוהב כימיה ויש לו ראיה מרחבית.", "timestamp": 1657625116034}, {"author": "Amjad Okasha", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מרק\nחוות דעת - הרצאות: מרצה מעולה וסבבה , אבל מסביר בעומק שהוא מעל רמת הקורס\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: סבבה / לא לוקחים הרבה זמן.. חשובים מאוד למבחן ורלוונטים מאוד לשאלות המבחן .. ממולץ להשקיע בהם\n\nהמבחן: סבבה והוגן.. ניתן מאוד לקבל ציון גבוה 85+ למישהוא לומד טוב לפני המבחן\n\nהשורה התחתונה:", "timestamp": 1658168578157}, {"author": "Anne Onimus", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: רעות מסבירה מעולה וההרצאות מעניינות\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: עידן מתרגל תותח, מסביר טוב, מתייחס יפה לסטודנטים, מקליט את התרגולים ופותח זום, עובר על דגשים חשובים ועוזר לפתור את השיעורי בית בשעת קבלה ובאופן כללי גם עושה המון דברים קטנים שמראים שאכפת לו.\n\nשעורי הבית: ממש סבבה, לא עמוסים מדי מבחינת תדירות וזמן שלוקח לכל גיליון. שואלים בול את מה שנלמד בתרגולים. עידן עוזר לפתור את הגיליונות עצמם בשעת קבלה שלו.\n\nהמבחן: הוגן מאוד, שואל בול את מה שנלמד בכיתה, לא פחות ולא יותר, בלי שאלות מכשילות וטריקים מעצבנים. מי שלמד למבחן ובמהלך הסמסטר יוציא ציון טוב.\n\nהשורה התחתונה: קורס מעניין בניגוד לכל הסטיגמות שיש עליו, לא עמוס מדי, סגל קשוב ומבחן הוגן מאוד. מלג מומלץ!", "timestamp": 1658350337204}, {"author": "--", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: רעות- הייתה סבבה, מאוד מנסה לשתף את הכיתה ולהשאיר את כולם מרוכזים\nחוות דעת - הרצאות: \nבסהכ ההרצאות היו סבבה, הייתה הרגשה שנמרחים כמעט כל הסמסטר על 2-3 תגובות יחסית פשוטות ואז את הדברים המסובכים דחפו בשבועיים האחרונים ממש בריצה\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: ממש אחלה, עונה על שאלות וגם עוזר בשעות קבלה שלו לפתור את התרגילי בית\n\nשעורי הבית: זוועה! הגליונות עצמם לא היו בעייתים, מה שהיה בעייתי זה הבדיקה של המתרגלת האחראית שקטלה על כל פסיק לא במקום והורידה נקודות על דברים שעידן אמר שהם בסדר. לא היה תיאום בין המתרגלים בכלל וזה ניכר בציונים של התרגילי בית\n\nהמבחן: הוגן, לא היה איזה התחכמות מיוחדת\n\nהשורה התחתונה: באופן כללי זה קורס די מעניין אבל סגל הקורס לא היה ברור בקשר לשום דבר- איזה מגנונים בדיוק צריך לדעת, איזה שאלות ממבחני עבר רלוונטיות לנו, העלו פתרונות למבחנים ורק אחרי שבוע נזכרו להגיד שזה פתרונות שלא נכונים במאה אחוז... עצה שלי כל מנגנון שלומדים בכיתה לשאול 1000 פעם האם הוא למבחן כי בסוף הסמסטר לא תקבלו תשובות", "timestamp": 1658915954952}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: גליה\nחוות דעת - הרצאות: מעצבנת\n\nשם המתרגל/ת: אין לי שמץ\nחוות דעת - תרגולים: \n\nשעורי הבית: נראה שזה הדבר היחיד שעזר לי להשאר על החומר הסמסטר הזה\n\nהשורה התחתונה: על הפנים, גרוע. ואני מתכוונת לצוות הקורס!\nאין לי מושג בכלל מי לימד אותנו ומה, ועוד עם השביתה הזאת בכלל הרגו אותנו\nקיצר יש מצב שזה היה יכול להיות קורס סבבה אם לא הייתי צריכה ללמד את עצמי הכל לבד!", "timestamp": 1687900901101}, {"author": "תמר", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: גליה \nחוות דעת - הרצאות: מקסימה אבל עדיף ללמוד אצל רעות לדעתי, יותר ברורה. \n\nשם המתרגל/ת: תאמר \nחוות דעת - תרגולים: דוגרי לא מבינים כל כך מה הוא רוצה, די פותר לעצמו אבל בסוף אפשר לשחזר פלוס מינוס את מה שהוא אומר ולהבין מה לעשות בגיליון. בדיעבד הייתי הולכת לרומי. \n\nשעורי הבית: כל שבוע יוצא גיליון ש\"ב פתוח, רמה סבירה. \n\nהמבחן: קצת קשה \n\nהשורה התחתונה: כמו תמיד לא מלמדים דברים לעומק באמת אז אתה חצי מבין חצי מקבל את הדברים כעובדות.", "timestamp": 1689152553057}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גליה מעיין\nחוות דעת - הרצאות: \nאחת המרצות הטובות בטכניון. בדרכ ממש קשה לי להתרכז אבל אצלה זה היה סבבה, הגעתי להכל וזה היה מועיל\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: \nבקושי הגעתי היה קשה מידי להתרכז חח\nשעורי הבית: \nרלוונטי להבנה של החומר והמבחן, שווה לשבת על זה עם עוד מישהו ולדבר על השאלות\nהמבחן: \nהיה ממש הוגן, מילימטר אחרי סיום הסמסטר אבל בכל זאת היה אחלה. דומה לשיעורי בית.\nהשורה התחתונה: \nהגרסא הלא מפחידה של כימיה אורגנית. קורס כיף מעניין ורלוונטי לתואר, לא צריך להיבהל", "timestamp": 1689497293855}, {"author": "ליאור", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: רעות\nחוות דעת - הרצאות: סך הכל נחמדה, השיעורים היו בשמונה וחצי בבוקר אז היה קשה להשאיר את העיניים פקוחות\n\nשם המתרגל/ת: תאמר\nחוות דעת - תרגולים: מדבר בעיקר לעצמו, אם נשארים ממש בקשב כל השיעור אז אפשר להבין והתרגול עוזר ממש, בפועל מרדים וקשה להישאר מרוכזים.\n\nשעורי הבית: קלים יחסית, גיליון לא אמור לקחת יותר משעה שעתיים\n\nהמבחן: סביר, הייתי מוותרת עליו\n\nהשורה התחתונה: התנהלות הסגל הסמסטר הזה הייתה מזעזעת, עם השביתות והעיצומים פשוט הרגשנו כמה לא אכפת להם כשאמרו לנו \"לא נשלים לכם הרצאות\" ובנוסף פרסמו במודל רק שני מבחנים כחזרה למבחן ומתוכם היו לא מעט תשובות שגויות או שאלות שירדו מהחומר ולא טרחו להוציא מהמבחן.", "timestamp": 1689597875472}, {"author": "is", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גליה\nחוות דעת - הרצאות: מזעזע!!\nהיא לא יודעת להסביר כלום סתם מיותר שהלכתי\nבגלל השביתה היו כמה הרצאות מוקלטות של רעות שהייתה פי מליון יותר טובה אם יש לכם אופציה תלכו לרעות\n\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: מושלמת\n\nשעורי הבית: קצת קאדרים וצריך ממש לוודא את עצמך מליון פעמים מול אחרים כדי לראות שצדקת כי מורידים את כל הניקוד על טעויות ממש קטנות\n\nהמבחן: לדעתי קליל אבל הציונים מראים אחרת\n\nהשורה התחתונה: קורס חמוד עדיף לוותר על הרצאות אם אי אפשר ללכת לרעות", "timestamp": 1689755782311}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: רעות \nחוות דעת - הרצאות: רעות מרצה מעולה. חשוב לה שהסטודנטים יבינו והיא עושה הכל בצורה נעימה, מביאה מודלים להדגמות וכו.. מומלצת \n\nשם המתרגל/ת: רומי לוי \nחוות דעת - תרגולים: מתרגלת טובה, לעתים לא מספיקה את כל החומר אבל זה גם בגלל שהתרגול כולה שעה. \n\nשעורי הבית: בסדר סה\"כ, לא לוקחים יותר מדי זמן וחשוב להבין אותם כי הם באמת עוזרים למבחן. \n\nהמבחן: היה לא ממש הוגן לדעתי.. לא הספיקו ללמד את כל החומר אז המבחן היה על נושא עיקרי אחד ומאוד קשה. בסוף המגן הוא 40% לכן הפוטנציאל כישלון מאוד נמוך אבל עדיין. \n\nהשורה התחתונה: קורס שיש לו פוטנציאל להיות קורס מעניין וטוב ויחסית קליל לסמסטר הנוכחי, בפועל הצוות לא מסודרים עם החומר והשיעורי בית מה שיוצר בלאגן.", "timestamp": 1690011045480}, {"author": "נופר", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מעין גליה\nחוות דעת - הרצאות: חשובות, לא לפספס, המרצה חמודה לאללה וקשובה לסטודנטים. מסבירה טוב\n\nשם המתרגל/ת: רומי לוי\nחוות דעת - תרגולים: מתרגלת בסדר סה\"כ, חשוב ללכת לתרגולים\n\nשעורי הבית: \n25% מגן הגשה נטו של הש\"ב ו-15% מגן בדיקה מעמיקה של שני הגשות (לא ידוע מראש אלו יבדקו) חשוב להשקיע בכולם וזה מאוד מכין למבחן. סה\"כ מגן מעולה ששווה להשקיע בו, אין חובה לעבור ציון מסוים במבחן על מנת לקבל את המגן\n\nהמבחן: קשה, דורש הבנה מעמיקה של כימיה אורגנית. צריך לתרגל המון ולזכור את כל התגובות. הכי חשוב לתרגל. ממוצע הקורס טוב רק בגלל המגן שמעלה בטירוף.\n\nהשורה התחתונה: קורס קשה, לא דורש המון מאמץ במהלך הסמסטר אבל חשוב להשקיע עצמאית ולתרגל לבד בשביל לקבל ציון טוב", "timestamp": 1690116563159}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nשתי המרצות טובות ומסבירות את החומר בצורה טובה. ההרצאות כל כך חשובות כדי להבין את החומר וכדי לקבל ציון טוב במבחן. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהיה תרגולים מוקלטים והם היו בסדר\nשעורי הבית: \nחשובים וניתן לקבל ציון מגן גבוה. \nהמבחן: \nהגיוני, מי שלמד במהלך הסמסטר מקבל 80 פלוס בקלות. \nהשורה התחתונה: קורס מעניין.", "timestamp": 1704107775649}]}