{"posts": [{"author": "ב", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  שאול\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אלינור, מהמוקלטים\nחוות דעת - תרגולים: \n\nשעורי הבית: די מעמיסים, בעיקרון הכי טוב לפתור לבד כדי לתרגל דרכי פתרון וחשיבה, אבל הרבה פעמים הם מתארכים ומסתבכים\n\nהמבחן: הרבה יותר שאלות חשיבה מבדר\"כ, עמוס מאוד, הרבה לא הצליחו לענות על כל הסעיפים.\n\nהשורה התחתונה:  כימיה כללית 2, די חופר", "timestamp": 1612964746103}, {"author": "גיבס", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: הוא מסביר בסדר.. אין כל כך מה לסבך בחומר, כי חלק גדול מזה הרחבה של כימיה כללית\\יסודות הכימיה.\n\nשם המתרגל/ת: אלינור\nחוות דעת - תרגולים: באיזשהו שלב וויתרתי על התרגולים, ופתרתי את דפי התרגולים עם תרגילי בית. אבל היא טובה!\nשעורי הבית: 1 כל שבוע. אם עושים מיד אחרי ההרצאה, לא תרגישו בהם.\n\nהמבחן: ארוך! צריך לתרגל היטב עם הקפדה על הזמן. מצריך הבנה אך יש חלק טכני.\n\nהשורה התחתונה: קורס מיותר. אולי רק תזכרו מזה שכל פעולה מעלה או לא משנה את אנטרופיית היקום.", "timestamp": 1613467019946}, {"author": "הלמהולץ", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שאול\nנהניתי מאוד בהרצאות, מסביר את הדברים ברור וטוב.\nניתנו הסמסטר שאלות בונוס מחשבתיות כדי לעודד השתתפות פעילה בשיעורים הפרונטליים - זה היה די טוב ועזר מעט בציון הסופי.\nחוות דעת - הרצאות: \nזהה אחד-לאחד להרצאות המוקלטות. למי שקצר בזמן מומלץ לצפות בהרצאות המוקלטות...\nשם המתרגל/ת: אלינה\nחוות דעת - תרגולים: \nצפיתי רק בתרגולים המוקלטים של אלינה - היא פשוט מעולה.\nמכיוון שהתרגולים שלה היו בתצורה הישנה של הקורס, הם נמשכו שעתיים אבל זה היה מעולה כי היא הספיקה הרבה יותר שאלות ודוגמאות על כל נושא.\nכדאי מאוד לצפות באלינה על מהירות פי 2 - כך ניתן גם לחסוך בזמן וגם להספיק יותר שאלות ודוגמאות.\nאלינה - הצלת לי את הקורס הזה - תודה רבה!\n\nשעורי הבית: \nחישוביים ומאפשרים לחזור על החומר הנלמד.\nהמבחן: \nהוגן בסך הכל - הייתה הסמסטר בעיה קלה בהבנה של אחת השאלות. חוץ מזה היה מבחן שמשקף את החומר הנלמד.\nהשורה התחתונה:", "timestamp": 1613482120933}, {"author": "שם", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: ההרצאות טובות אבל בשעה לא סימפטית.\n\nשם המתרגל/ת: התרגול המוקלט\nחוות דעת - תרגולים: מדהימים, במיוחד לאור כך שחלק מהמתרגלות של הקורס לא משהו.\n\nשעורי הבית: לא קשה למצוא מישהו עם אותם נתונים כמו שלך ולקבל 100 בשעורי בית\n\nהמבחן: היה פקטור של 7 נקודות למבחן - בנוסף לבונוס של 5 נקודות לציון הסופי ו15% שעורי בית תקפים.\nחלק מהשאלות במבחן לא היו מובנים, ורוב הסטודנטים היו בטוחים שחסר נתון אחד או שניים. השאלות היו כתובות כך שסעיף אחד היה מבוסס על הסעיף הקודם. בקיצור - המבחן היה קשה \n\nהשורה התחתונה: תהליך מעגלי, תמיסות, שיווי משקל - הנושאים שתמיד ישאלו עליהם במבחן", "timestamp": 1613513002545}, {"author": "--", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: מקסים ומעשיר. המצגות מסודרות וכתוב בהם הכל. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית שבועיים אבל לא הרבה שאלות וזה דרך המודל.\n\nהמבחן: עם חומר פתוח והשאלות במבחן בערך ברמה של התרגולים והשאלות בהרצאות אז זה בסדר\n\nהשורה התחתונה:", "timestamp": 1625146595808}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: היה מבחן שונה לגמרי השנה הזאת , לא דומה בכלל למה שפתרתי בבית , \n\nהשורה התחתונה:", "timestamp": 1644516382881}, {"author": "Nikol Seleznev", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: המרצה ממש מקסים אבל השעות של ההרצאות קשות\n\nשם המתרגל/ת: אלינה\nחוות דעת - תרגולים: המתרגלים של הסמסטר היו נוראיים. ראיתי תרגולים מוקלטים של אלינה מלפני 8 שנים והיא מדהימה.\n\nשעורי הבית: משקפים את הרמה של המבחן ותורמים להבנה של החומר. יש רפרנסים להכל אבל מומלץ לא לרפרנס כי זאת עבודה של גג 2-3 שעות בשבוע והשב ממש עוזרים להבנת החומר\n\nהמבחן: יש הרבה שאלות תאוריה אז כדאי להבין את המשמעות של דברים (במיוחד אנטרופיה ואנתלפיה). במועד שלי ( חורף א 2022) היו המון בעיות ניסוח וחצי מהסטודנטים בכלל לא הבינו את השאלות אז המבחן היה מבאס ממש.\n\nהשורה התחתונה: קורס נחמד, מאוד טכני", "timestamp": 1644821975962}, {"author": "בולצמן", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שאול מיכלסון\nחוות דעת - הרצאות: מרצה מושלם! הכל כתוב אצלו בפירוט במצגות והוא מסביר ברור. עושה שאלות בונוס לציון הסופי תוך כדי ההרצאה, אבל ההרצאות שלו בשעות לא סימפטיות וחבל\n\nשם המתרגל/ת: אלינה\nחוות דעת - תרגולים: התחלתי בתרגולים פרונטליים אבל המתרגלים פשוט לא היו מוצלחים, עברתי לראות תרגולים מוקלטים של אלינה שהצילה את הסמסטר\n\nשעורי הבית: קלילים, גיליונות שמתוכם רק 7 חובה ובסה\"כ 5 שאלות בכל גיליון, יש רפרנסים אבל שווה להשקיע זמן לפתור\n\nהמבחן: בד\"כ השאלות היו דומות מאוד לשיעורי בית, השנה המבחן היה מאוד תיאורטי ולא דומה בכלל למבחנים קודמים\n\nהשורה התחתונה: חשוב להבין את המושגים והנספחים מההרצאות של שאול, הם תמיד באים לידי ביטוי במבחן. קורס טכני ונחמד להעלאת ממוצע", "timestamp": 1644936185467}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שאול מיכאלסון\nחוות דעת - הרצאות: מסביר דברים ברור, מאוד נחמד ומאוד עונה על שאלות. ממליצה כן לעקוב אחרי ההרצאות ולא לראות הקלטות כי זה עוזר להישאר על החומר.\nחוץ מזה, במהלך הסמסטר היו 4 שאלות בונוס (כשכל אחת שווה נקודה בציון הסופי) שהיו במהלך ההרצאות, ולכן אם הגעת באופן סינכרוני קיבלת עוד 4 נקודות.\n\nשם המתרגל/ת: ניקולא\nחוות דעת - תרגולים: מתרגל מדהים!\nמסביר הכול כמו שצריך, עובר על הנקודות החשובות ועל המשוואות החשובות, קובע שעות קבלה אקסטרה אם צריך ועונה על מיילים.\n\nשעורי הבית: 7 גיליונות חובה מתוך 9, קצת מעיקים סטייל כימיה כללית אבל ממש לא נוראיים. יש רפרנסים וגם המתרגלים עונים בפורום (ובאמת עוזרים).\n\nהמבחן: חומר פתוח. המבחן מצד אחד הרגיש קשה והיה תיאורטי יותר, מצד שני מועד א' (אליו ניגשתי) היה עם ממוצע סופי של 84 שזה גבוה משנים קודמות, אז אין על מה להתלונן. כן צריך לתרגל מבחנים משנים קודמות ולהכין חומר פתוח טוב, אבל כל דף נוסחאות שיש בדרייב עם תיקונים יעשה את העבודה.\n\nהשורה התחתונה: קורס די חמוד סך הכול (גם רק 2.5 נק\"ז). מניחה שכל מי שלוקח אותו זה חובה אבל אפשר להוציא בו מעל 80.", "timestamp": 1645119594946}, {"author": "סתם לנסות", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שאול מיכלסון\nחוות דעת - הרצאות: מרצה נחמד ומעניין בסך הכל. המצגות שלו מסודרות ממש ונוחות ללמידה מהן. הבעיה - ההרצאות בשעות ממש מאוחרות וזה די קשוח... \nהיו 4 שאלות בונוס בהרצאות כדי לשמור עלינו ערים, וכל שאלה נתנה נקודה (שלמה!) לציון הסופי\n\nשם המתרגל/ת: ניקולא!\nחוות דעת - תרגולים: כמעט והתייאשתי מהתרגולים בגלל שלא התחברתי לאף אחד מהמתרגלים, ניסיתי גם אותו והצטערתי שלא הייתי איתו מההתחלה... הפעם הוא היה בתרגולים שמוגדרים לרפואנים אבל לא היה הבדל בתרגולים ולא הייתה בעיה עם זה שהצטרפתי לשם. מומלץ ממש! מסודר, מסביר טוב, מבין את מה שמלמד, נחמד ומדוייק.\n\nשעורי הבית: שבועיים. כדאי להיות על החומר ולעשות את השיעורי בית כמו שצריך בלי לרפרנס, ממש עוזר במבחן הסופי. יש הרבה דיוקים כמו מלא המרות של יחידות אז צריך להיות על זה...\n\nהמבחן: הוגן לגמרי. עם חומר פתוח אז חשוב לבנות את הסיכום/המחברת כבר מההתחלה כדי שהחומר יהיה יעיל ועד המבחן תכירו אותו. \n\nהשורה התחתונה: בסדר סך הכל. הרבה חומר והרבה דברים קטנים שצריך לשים לב אליהם, אבל מתרגלים לראש הזה ובסוף זה אחלה קורס", "timestamp": 1646208862370}, {"author": "Avi Cohen", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: מרצה מדהים! הרצאות כיפיות ומעניינות, חומר מגניב ממש!\n\nשם המתרגל/ת: ניקולא\nחוות דעת - תרגולים: מרצה נחמד ונעים, מסביר טוב ארת הדברים ועונה על שאלות, עושה שעות קבלה ומסביר כל מה שצריך להבין בשביל לפתור שיעורי בית ומבחנים.\n\nשעורי הבית: ממליץ לעשות מסודר וכמו שצריך, תרגילים במודל אבל מומלץ לכתוב פתרון מלא שכן המבחן הוא עם שאלות פתוחות. לא עמוס מדי - שעה שעתיים מקסימום.\n\nהמבחן: אם יש הבנה של הקונספטים המועברים בקורס אפשר לקבל ציון מאוד גבוה - המבחן עם חומר פתוח. ממליץ להכין סיכום מתומצת, סיכום יותר מפורט למקרה הצורך ופתרונות של מבחני עבר למקרה הכי גרוע שכלום לא עוזר...\n\nהשורה התחתונה: קורס ממש מעניין וכיפי, לא עמוס ומבחן עם חומר פתוח שיכול להקפיץ אץ הממוצע קצת.", "timestamp": 1656325336885}, {"author": ".", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: לא צריך ללכת להרצאות כדי להבין\n\nשם המתרגל/ת:מורן גבע \nחוות דעת - תרגולים: אחלה מתרגלת, במיוחד בשעות קבלה\n\nשעורי הבית: יותר קשים מהתרגולים אבל כן שווה לעשות כדי להבין על מה מדובר בקורס בכלל. יש רפרנסים להכל\n\nהמבחן: מה זה היה לעזאזל\n\nהשורה התחתונה: קורס שצריך להיות בגדר עובר בינארי. לא מרגיש חשוב להמשך ושעמום בגדול. גם באופן אובייקטיבי אין נושא שמעניין בשום צורה. לסמן וי ולעבור הלאה", "timestamp": 1676236920349}, {"author": "אאא", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: \nמשעמם ברמות. הלכתי לכל ההרצאות ובכולן נרדמתי לפרקים. בדיעבד כנראה שלא הייתי הולכת ופשוט עוברת על המצגות. כן חשוב להבין את השאלות למחשבה שיש לאורך המצגות כי זה חוזר כמו בומרנג במבחן. \nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: \nמורן מתרגלת ממש ממש טובה ומומלצת. מסבירה מצוין, עונה על שאלות בצורה מכבדת ומפורטת ובכללי חמודה מאוד. היא יחסית מסודרת על הלוח אבל הכתב שלה לא משהו. אסור לוותר על התרגולים, עוזר להבין את החומר ולפתור את השיעורי בית.\nשעורי הבית: תכלס תמיד לקח לי יותר מידי זמן ממה שזה אמור לקחת. פה ושם נופלים על שאלות מגעילות כאלה אבל יש את הפורום שיעורי בית שהמתרגלים עוזרים בו מאוד ותמיד אפשר למצוא רפרנסים בדרייב של ביורפואה. חשוב לעשות את התרגילי בית כדי להיות על החומר. \n\nהמבחן: מזעזע ולא הגיוני. הקשר בינו לבין התרגילי בית מקרי בהחלט. אם חשבתם שזה הקורס שיעלה לכם את הממוצע תחשבו שנית. החומר הפתוח או בשמו השני: אפילו חומר פתוח לא יעזור לכם, באמת חסר תועלת מול המועד א שהיה. פתרתי את כל המבחנים של שאול שהיו במודל ועדיין ישבתי מול המבחן ולא ידעתי מה לעשות בו. בגדול צריך להבין דברים לעומק כדי לדעת אשכרה לפתור את השאלות ב100%.\n\nהשורה התחתונה: כימיה כללית 2.0. לא לזלזל בקורס הזה למה המבחן יבוא עליכם בהפוכה.", "timestamp": 1677510978358}, {"author": "לא חשוב", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: מרצה משעמם, כמעט נרדמתי בכל ההרצאות , לא מסביר בצורה מעניינת\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: ממליץ לכם בחום לראות את התרגולים המוקלטים הישנים במודל, המתרגלת סופררר תותחיתתת\n\nשעורי הבית: בזבוז זמן , לא מספיק להבין את החומר כדי להבין אלא ממש דיוק בחישובים שזה לוקח הרבה זמן, ולא כל כך אלוונטיות למבחן, שיעורי הבית בעולם והמבחן עולם אחר\n\nהמבחן: אוי אבוי מה הלך בסמסטר הזה, מבחנים זוועתים, למרות שפתרתי את כל המבחנים שבמודל שאול הביא מבחנים מגלקסיה אחרת , מבחנים קשיםם ולא מתאימים לרמת הלימוד בכיתה, המבן היה נמוס בשאלות וברעיונות והרגשתי שהזמן לא מספיק כדי לפתור מבחן כזה, וניסוח השאלות לא משהוא , בכמה שאלות לקח ממני הרבה זמן רק להבין מה הם רוצים בשאלה ,! כנראה ששאול לא יודיע שהקורס הזה סה\"כ 2.5 נקודות\n\nהשורה התחתונה: לפני הקורס הזה הייתי מת על כימיה, אחרי הקורס הזה אני סוגר את האוזנים שלי אם אשמע את המילה \"כימיה\" , וזה בזכות מבחני שאול", "timestamp": 1678026521556}, {"author": "Idan Orgad", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה:. \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: .\nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש רפרנס אבל שווה לפתור ולהבין\nהמבחן: לא פשוט בכלל\n\nהשורה התחתונה: קורס קשה לרפואנים כי הוא מזכיר את קורסי היסוד של שנה א׳", "timestamp": 1678891827175}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: שאול מרצה מצוין, אבל השעות שלו קשות קצת להגעה אז ראיתי אותו בהקלטות וגם ההקלטות שלו . טובות מאוד. הוא ברור מאוד ומקסים  \n\nשם המתרגל/ת: הילה קצנלסון \nחוות דעת - תרגולים: אחלה מתרגלת על 1.5 בהקלטה. בלייב קצת איטית לי מדי אבל תמיד עושה מצגת מסודרת ומעלה את המצגות למודל כך שקל לעקוב ולחזור על הדברים. \n\nשעורי הבית: העתיקו את התרגילים מכימיה כללית, לא רלוונטים ב כ ל ל למבחן לכן אם זה מבזבז לכם יותר מדי זמן לרפרנס. \n\nהמבחן: המבחן שלנו היה יחסית הוגן לשאר השנים ובנוסף  הבדיקה הייתה קצת מקלה כי היה מלא רעש בזמן מבחן וכו'.. יש מבחנים ממש קשים משנים עברו, מקווה שתיפלו על מבחן סבבה. צריך להבין ממש לעומק את החומר בשביל להוציא ציון טוב במבחן לדעתי, בעיקר את ההרצאות. \n\nהשורה התחתונה: במהלך הסמסטר הקורס היה סבבה, הלמידה למבחן הוציאה לי שערות לבנות. לסיכום- לא התחברתי ותודה שנגמר :)", "timestamp": 1715520081916}, {"author": "D", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: אחלה מרצה סך הכל ומאוד אכפת לו מהסטודנטים. החצי הראשון של הסמסטר מזכיר את השבוע של תרמודינמיקה בכימיה כללית, החצי השני של הסמסטר זה מה שבעיקר מופיע במבחן. \n\nשם המתרגל/ת: לא הייתי\nחוות דעת - תרגולים: \n\nשעורי הבית: גיליונות במודל, לא דורשים יותר מדי השקעה אבל פה ושם יש שאלות שנתקעים עליהן. \n\nהמבחן: הסמסטר היה יותר קל מסמסטרים קודמים\n\nהשורה התחתונה:", "timestamp": 1717264722981}]}