{"posts": [{"author": "Guy Yoffe", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: סהר רהב\nחוות דעת - הרצאות: ההרצאות הכי משעממות שקיימות בטכניון. המרצה פשוט אומר מילים. כל קשר בין מילה אחת לשנייה הוא מקרי. פשוט גיבוב שטויות.\n\nהשורה התחתונה: \nחרא קורס", "timestamp": 1610876996508}, {"author": "~", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: סהר\nחוות דעת - הרצאות: בזיון. לא לומדים כלום, בזבוז זמן גדול מאוד. ראיתי מוקלטים על X2 וזה עדיין היה איטי ולא עזר לכלום.\n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: הייתי ב2 תרגולים, הבנתי שהיא לא יודעת את החומר שהיא מלמדת והפסקתי להגיע.\nאפשר לראות מוקלט משנים קודמות או פשוט לקרוא את הPDF זה הרבה יותר ברור מלהקשיב לה...\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אל תצפו ללמוד כימיה בקורס הזה. לומדים לפתור מבחנים. גם אם מאוד תרצו ללמוד פה משהו תגלו שזה לא אפשרי כי הקורס בנוי  בצורה מאוד בזויה.\nחד משמעית הקורס הכי גרוע שעשיתי בתואר", "timestamp": 1678350458152}, {"author": "slowed + reverb", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nיובל שגם\n\nחוות דעת - הרצאות: \nמרצה מאוד אכפתי. ההרצאות חדשות לגמרי גם הרכב הנושאים די השתנה.\nיובל מרצה טוב שמסביר הרבה אינטואיציה. הוא טיפה מפוזר אבל אפשר לשאול אותו 700 פעם והוא יסביר מחדש בשמחה הכל. \nגם בניהול הקורס הרגיש שהוא מאוד רוצה שנצליח הנגיש רשימות, הקלטות, זום לייב ובגדול כל מה שעוד ביקשנו.\n\nשם המתרגל/ת: \nאליענה ולך\n\nחוות דעת - תרגולים: \nמתרגלת מעולה! כתבה מחדש את התרגולים, עכשיו הם מסודרים וברורים. מבינה בחומר מעולה וממש סוגרת את מה שצריך לדעת מההרצאה וגם איך לפתור שאלות דוגרי. יש גם אווירה ממש טובה אצלה וממש נחמד להיות בתרגול.\n\nבגדול אני יודע שרוב האנשים לוקחים את הקורס בשלב שכבר לא באים לתרגולים כי למי אכפת מתרגול בכימיה. לדעתי ממש כדאי בכל זאת לבוא לאליענה כי זה פשוט שווה נקודות במבחן.\n\nשעורי הבית: \n20% מגן. רוב השיעורי בית היו שאלות אמריקאיות כאלה במודל. בכללי זה היה אחלה תרגול ולא לקח הרבה זמן. מי שהיה בתרגול לא אמור להסתבך. היה גם כמה גיליונות פתוחים ורטוב אחד לא ממש ארוכים. בשביל 20% מגן ממש סבבה\n\nהמבחן: \nיובל הבטיח שיהיה 90 נקודות על דברים שראינו כבר בקורס ו10 מאתגרות. המבחן באמת הרגיש ככה. מי שהיה בהרצאות ובתרגולים הצליח. מי שלא, בבעיה, כי החומר שונה לגמרי מכל דבר לפני. \nבשורה התחתונה חציון 90 בסופי א', מה עוד אפשר להגיד...\n\nהשורה התחתונה: \nאחלה קורס! יובל ואליענה לקחו את הקורס הישן ששמעתי רק דברים רעים עליו והפכו את הקורס למעניין מאוד. הקורס שונה לגמרי עם הרצאות ותרגולים חדשים ונושאים קצת שונים. \nהכל הרגיש ברור למרות שזה חומר מאוד שונה ממה שמכירים, לא רואים דברים דומים באף קורס. תוסיפו שיעורי בית אחלה ומבחן סבבה רצח ותקבלו קורס מעולה בעיניי, מעניין, סגל טוב וציונים טובים.", "timestamp": 1717168103566}]}