{"posts": [{"author": "---", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שעורי הבית: \nממוחזרים אבל לוקח 3 שעות לרפרנס או שבוע אם לא מרפרנסים, הבדיקה שלהם חסרת תועלת וכולם מקבלים 100\nהמבחן: \nתופת, מתוך 3 שאלות אחת היא מהגיהנום ושאר השאלות עם כמה סעיפים לא סבירים בעליל\nהשורה התחתונה: גם להיות על הקורס במהלך סמסטר לא יציל אותך", "timestamp": 1597760463820}, {"author": "Nina Tucker", "difficultyRank": 2, "generalRank": 2, "semester": "201902", "text": "מי חשב שלשלב מכניקה קוונטית עם סטטיסטיקה בתקווה ליצור תרמודינמיקה זה נכון.\nזה זוועה שלא נועדה להשתחרר על העולם. זאת קימרה מכוערת. היוצר של  הקורס הזה עשה זוועות יותר חמורת מאשר Shou Tucker", "timestamp": 1598169973177}, {"author": "א", "difficultyRank": 3, "generalRank": 1, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: ראינו הרצאות מוקלטות בפנופטו מ2018 והמרצה העביר שעת קבלה שבועית. כדי לעודד השתתפות ולמידה פעילה הוא הקנה בונוס למתחברים לשעת קבלה שיענו לו במייל לשאלות שהוא שאל.\n\nשם המתרגל/ת: אילנה בוגוד.\n\nחוות דעת - תרגולים: ב2 מילים: אלוהים ישמור. ב3 מילים: אלוהים ישמור ויציל.\n\nשעורי הבית: זהים לשנים קודמות אז אפשר לרפרנס\n\nהמבחן: קשוח ברמות, בדיקה ממש אובר קפדנית ולא בדקו דרך, עניין אותם רק התשובה הסופית. היה פקטור של 7 נקודות.\n\nהשורה התחתונה: לא מומלץ למי שלא חייב חחח", "timestamp": 1598444236544}, {"author": "/", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: סער\nחוות דעת - הרצאות: ראינו הרצאות מוקלטות מ2018, מאוד תאורטיות. בסה\"כ החומר מוסבר היטב. \nבמהלך הסמסטר נתן שאלות בונוס (עד 4 נק'), לא קשות (ולא נבדקו בפועל). \n\nשם המתרגל/ת:  אילנה\nחוות דעת - תרגולים: מפורסמים תרגולים עם תשובות מלאות. התרגולים עצמם היו לא רלוונטים, ולא עזרו - בפועל היה יעיל יותר לפתור לבד. \n\nשעורי הבית: 4 הגשות חובה, שאלות ממבחנים - קשות, אבל יש פתרונות זמינים בדרייב. לא קריטי להשקיע, רוב השאלות יופיעו אחרי זה בתרגול למבחן. \n\nהמבחן: קשה. בדר\"כ 2 קונספטים שחוזרים על עצמם בין המבחנים, ועוד שאלה קצת חריגה. חלק מהסעיפים מצריכים הבנה מעמיקה של החומר + הגיון בריא, אחרים רק שימוש בנוסחאות שפותחו בהרצאה. \n\nהשורה התחתונה: אפשר ללמוד לבד לגמרי, בצורה אסינכרונית מההרצאה. הקורס עצמו קשה, ורצוי להבין את הקונספטים לפני שנבחנים. \nהקורס עצמו לא מאוד רלוונטי למי שלא מתכוון לעסוק בנושא, אבל כן מגיעים מדי פעם לביטויים מוכרים.", "timestamp": 1602702713921}, {"author": "לא לקחת", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: מאד משעממות, צריך לראות על פי 2 \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תרגולים לא מובנים, בעיני הייה בזבוז זמן\n\nשעורי הבית: יחסית מאתגרים אבל יש רפרנס\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1625840884600}, {"author": "י.י", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: צפיתי בהרצאות המוקלטות מלפני כמה שנים במהירות x2. חצי מהזמן - חצי מכאב הראש.\n\nשם המתרגל/ת:  הילה ויסמן\nחוות דעת - תרגולים: לא מתחשבת, לא אכפתית ורק רוצה ברעתם של הסטודנטים! נשמעת כאילו היא מדברת מתוך תפוח אדמה\n\nשעורי הבית: מרופרנסים כולם וקשים מאוד!\n\nהמבחן: \n\nהשורה התחתונה: חבל שהקורס במומלצת.", "timestamp": 1626092746215}, {"author": "---", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: הרצאות די מסובכות, בעיקר כי הועבר בשעות קשות, אבל סך הכל המרצה מנסה להעביר את הידע בצורה טובה\n\nשם המתרגל/ת: הילה ויסמן \nחוות דעת - תרגולים: התרגולים לרוב קלילים ומדי פעם יש שאלות מאתגרות אבל יש הרבה דפי עזר ופתרונות מלאים\n\nשעורי הבית: \nמאוד מאתגרים ברמה מאוד קשה אבל יש רפרנסים\nהמבחן: עם חומר פתוח, הקונספט די חוזר על עצמו כל מבחן אם מתרגלים מספיק ומבינים את הפתרונות אין סיבה לא לעבור, בדרך כלל אחת השאלות במבחן ממש מאתגרת ביחס לאחרות \n\nהשורה התחתונה: לא צריך להשקיע הרבה במהלך הסמסטר בעיקר להבין את הפתרונות ולתרגל הרבה למבחן", "timestamp": 1659378223792}, {"author": "------", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: סהר רהב\nחוות דעת - הרצאות: טובות. עוזרות להבין את החומר\n\nשם המתרגל/ת: הילה כצנלסון\nחוות דעת - תרגולים: פחות התחברתי לשיטת הלימוד של המתרגלת. ממליץ ללמוד מקבצי התרגול במודל\n\nשעורי הבית: \n\nהמבחן: אפשרי למי שלומד לאורך הסמסטר ומתרגל בעצמו\n\nהשורה התחתונה: קורס לא פשוט. אבל אפשרי.", "timestamp": 1661962752696}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: סער\nחוות דעת - הרצאות: תתכוננו לישון עמוק כמו שלא חלמתם.\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: לא ברור איך הגיעה להיות מתרגלת, היא לא יודעת את החומר ולא מסבירה טוב, שום דבר לא מובן,היא לא מוכנה לעשאת כלום למען הסטודנטים, לא הקלטות , לא זום לא שום דבר וחבל שיש רק מתרגלת אחת. תלמדו לבד.\n\nשעורי הבית: יש רפרנס \n\nהמבחן: לא הוגן וקשה מאוד\n\nהשורה התחתונה: קורס מבולגן מסריח", "timestamp": 1663855892550}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: סער\nחוות דעת - הרצאות: משעמם רצח\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: המתרגלת הכי גרועה בכל הטכניון.\nתתיחסו לקורס כאילו אין מתרגלת\nאל תתאמצו ותנסו לשלוח לא מיילים, לא עונה.\n\nשעורי הבית: קשים\n\nהמבחן: נוראי\n\nהשורה התחתונה: תברחו", "timestamp": 1664004111830}, {"author": "סטירלינג", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: סער\nחוות דעת - הרצאות: מרצה סבבה מלמד את החומר כמו שצריך ויש לו הקלטות ישנות שהוא מפרסם שזה +- אותו חומר אבל שווה להגיע לכיתה לשאול אותו שאלות כי בכלל הקורס הזה לא פשוט ודורש המון הבנה וכל מילה שהוא אומר עלולה להיות שאלה במבחן.\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: מתרגלת גרועה.. לא התחברתי אליה והייתי מעדיף שיחליפו אותה אבל מה לעשאת זה מה שיש..\n\nשעורי הבית: מאוד קשים וארוכים אבל יש רפרנס ואפשר לקבל 100 בכולם\n\nהמבחן: אם זה מועד א אז אפשרי לקבל עבר רק צריך לתרגל ממש ממש הרבה ולהכניס למבחן את כל המבחנים ואת כל ההרצאות ואת כל דפי הנוסחאות כי יתכן שיהיה משהו דומה במבחן עצמו וזה חומר פתוח\nלגבי מועד ב אתה צריך להיות מאוד בקיא ותותח בחומר אחרת תכשל..מועדי ב נורא קשים אצלו פשוט תראו את הממוצע..\n\nהשורה התחתונה: קורס מאוד קשה, אנשים חולמים לעבור אותו ולסיים את סיוט חייהם.", "timestamp": 1691312728725}, {"author": "is", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: סער\nחוות דעת - הרצאות: סער בסך הכל מלמד בסדר, אבל החומר פשוט מחריד ואי אפשר לבין\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: הילה לא הכי מבינה את הסטודנטים וכל דבר מפריע לה וקוטע את השיעור אבל היא בסך הכל בסדר, לא מלמד טוב אבל גם לא רע\n\nשעורי הבית: הזויים אבל אפשר לרפרנס\n\nהמבחן: צריך ממש להשקיע בלמידה לפחות 5 ימים ואז אפשר לעבור אבל המבחן באמת ממש קשה\nכשניסיתי ללמוד ממועדי ב זה היה נראה פשוט מבחנים של קורס אחר לא קשור ופי אלף יותר קשה אז שווה להשקיע ממש למועד א\n\nהשורה התחתונה: קורס ממש קשה אבל כשעוברים על המון מבחנים רואים קונספטים דומים", "timestamp": 1695372798652}, {"author": "-", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: סער  \nחוות דעת - הרצאות: \nההרצאות די חשובות כדי להבין את החומר ועל מה מדובר. \nשם המתרגל/ת: הילה  \nחוות דעת - תרגולים: \nמרצה הכי גרועה בכל הטכניון!! \nשעורי הבית: \nיש רפרנס \nהמבחן: \nקשה מאוד אכל כך ארוך\nהשורה התחתונה: תברחו :)", "timestamp": 1704107539116}]}