{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלון הופמן\nחוות דעת - הרצאות: \nהרצאות שהועברו פעם ראשונה בזום על ידו, קצת מסורבל בהסברים אבל ממש מנסה להבהיר ולענות לשאלות. לא תמיד היה קל לעקוב ולהבין הכל בהרצאה, אבל מומלץ להיות בהרצאות כדי שהכל יקלט בתרגול. \n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nהתרגולים חשובים כדי להבין את החומר ולהטמיע את המשוואות. לא תמיד היה ברור אבל ניכר שניסתה לעשות מה שיכלה. בנוסף ממש התחשבו עם הגליונות האחרונים בשיעורי הבית.\nשעורי הבית: \nתרגיליים שבועיים במודל של כ7-10 שאלות. קצת מעצבן ולרוב יותר קשה מרמת המבחן. היו 15 תרגילים ומתוכם 10 טובים ביותר לציון.\nהמבחן: \nמבחן הוגן מאוד, שאלה ממוחזרת.\nהשורה התחתונה: \nקורס בסדר, חומר חשוב, דורש השקעה אך שווה את הציון עם אלון.", "timestamp": 1612619728034}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון\nחוות דעת - הרצאות: \nמרצה מקסים. המון רקע תיאורטי ופיתוחים מתמטיים. לפעמים קשה להבחין בין עיקר לתפל מה רלוונטי ומה לא. נכון לענות על שאלות אבל ההסברים לא תמיד ברורים.\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nהפסקתי להגיע לתרגולים מאוד מהר. לא הרגשתי שיש ערך מוסף מעבר למה שכתוב בדפי התרגול (שהם ממש טובים).\nשעורי הבית: \nהרבה ש.ב. כל שבוע גיליון אחד והם נמשכו גם לאחר סוף הסמסטר. החשיבו לנו 10 מתוך 15. הכנה טובה למבחן. כל גיליון בין 3-6 שעות שבועיות.\nהמבחן: \nהוגן. מומלץ לפתור מבחני עבר של אלון כדי לקבל מושג למה מצפה כבר מסוף תרמודינמיקה. הייתה שאלה משוחזרת אחת.\nהשורה התחתונה: \nלראות הרצאות על X2, לקרוא את התרגולים, לפתור ש.ב ומבחני עבר ויהיה בסדר.", "timestamp": 1613152318153}, {"author": "Baraah Rashed", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון הופמן\nחוות דעת - הרצאות: מומלץ מאוד להגיע לכל ההרצאות-  יש הרבה פיתוחים מתמטיים ומשוואות תיאורטיות.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: התרגולים מכסים את רוב חומר ההרצאה\n\nשעורי הבית: גליון שבועי שמכיל 7-10 שאלות, ממש ארוך\n\nהמבחן: \nהוגן , היה שחזור של שאלה שלמה\nהשורה התחתונה: שווה לקחת את הקורס עם אלון!", "timestamp": 1613304484560}, {"author": "Rawaa", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלון הופמן\nחוות דעת - הרצאות: לא מלמד חומר תיאורטי אלא פיתוח משוואות מתמטיות. מומלץ להגיע ולהקשיב.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: מסבירה טוב, החומר של התרגולים מכסה כמעט את כל החומר של ההרצאות.\n\nשעורי הבית: 15 גליונות. ה10 הטובים ביותר ייכנסו לציון מגן 20%. 7-10 שאלות בכל גליון שזה ארווווך ומשעמם. \n\nהמבחן: אם מבינים את החומר טוב ומתרגלים אותו לאורך כל הסמסטר אז לא תהיה בעיה להשיג ציון גבוה. המבחן עם חומר פתוח.\n\nהשורה התחתונה:", "timestamp": 1615216532035}, {"author": "אנונמי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל שגם\nחוות דעת - הרצאות: \nהרצאות קצת באויר יותר מתמטי ממה שצריך אבל יובל באמת נשמה ורוצה שהסטודנטים ממש יצליחו,ניכר שאכפת לו\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nמקריאה את הפתרון.. די מיותר ללכת ,חשוב לתרגל הרבה\nשעורי הבית: \nהוגנים ,במודל, אותו עיקרון בערך\nהמבחן: \nרובו היה הוגן,בדיקה הוגנת לפי הבנה ולאו דווקא עפ תשובה סופית\nהשורה התחתונה: \nקורס סביר,לא קליל אבל סגל הקורס מצוין מבחינה בין אישית", "timestamp": 1644520193047}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יובל שגם\nחוות דעת - הרצאות: מרצה חמוד אבל ממש מבולגן. הוא לא ידע מה הקדמים שהגענו איתם וזה היה מורגש בנושאים שעליהם או התעכב ובנושאים שדילג עליהם. היה מורגש שזו פעם ראשונה שהוא מרצה. היה קשה מאוד ללמוד איתו אבל הוא מאוד רצה שנצליח והשקיע בנו הרבה.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: חמודה והתרגולים עוברים בנחמד אבל לפעמים קשה להבין אותה. חברה קצת אסרטיביות אל מול הסטודנטים.\n\nשעורי הבית: קשוח אבל אפשרי. כל שבוע נפתח גיליון ובסוף הסמסטר נפתחו כמה במכה. היה צריך להגיש 10 מתוך 16 אז היו הרבה אפשרויות לשיפור הציון.\n\nהמבחן: הדבר הכי נוראי שחוויתי בטכניון. המבחן היה כל כך רחוק ממה שלמדנו והיה מאוד מלחיץ ואינטנסיבי. היה ארוך מידי לזמן שניתן (3 שעות) אז הוסיפו עוד רבע שעה. מיותר לציין שזה לא הספיק. אבל הבדיקה הייתה מקלה ע\"מ שהציונים יהיו גבוהים.\n\nהשורה התחתונה: קורס קשה. מאוד. מאוד.", "timestamp": 1644758138720}, {"author": "----", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יובל שגם\nחוות דעת - הרצאות: קצת מבולגן וקשה לעקוב\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: ממש אחלה, מסבירים ועוזרים לענות על שיעורי הבית\n\nשעורי הבית: יש כל שבוע, לוקח זמן\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675712324343}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יובל שגם\nחוות דעת - הרצאות: \nהרבה פיתוחים מתמטיים והרבה תאוריה, לא הכל רלוונטי לתרגילי בית ולמבחן, אבל הייתה אווירה מאוד טובה בהרצאות ויובל באמת מושלם- הוא עשה בשבילינו המון והיה זמין תמיד לכל שאלה, באמת אחד המרצים האכפתיים שיש. ממליצה להגיע להרצאות גם אם יש עומס או שמסתדרים עם התרגילים.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nמסבירה טוב, השאלות בתרגולים עוברות על כל החומר שצריך. מעבר לזה היא גם עושה חזרה קצרה על נוסחאות\\ נושאים שצריך לדעת וזה מאוד מקל על התרגולים ואחר כך גם על התרגילי בית.\n\nשעורי הבית: \nכל שבוע נפתח גיליון, סה\"כ השיעורי בית מהווים 15% מהציון. חלק קשים יותר וחלק פחות, אבל רובם לוקחים זמן והם לא קלים. דורשים לא מעט השקעה במהלך הסמסטר.\n\nהמבחן: \nקשה. מעבר לעובדה שהוא היה קשה וחלק מהשאלות היו ברמה גבוהה בהרבה מכל מה שנלמד, הוא גם היה ארוך מדי- בודדים הסטודנטים שהצליחו לסיים אותו בזמן.\nאבל היה פקטור שמאוד העלה את הציונים.\n\nהשורה התחתונה: \nקורס קשוח שדורש הרבה השקעה, אבל כמו שכתבו גם לפניי- הסגל מצויין ועושה כל מה שאפשר כדי שהסטודנטים יצליחו.", "timestamp": 1676898282748}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שגם יובל\nחוות דעת - הרצאות: חשובים! אל תפספסו אותם! רובם פיתוחים מתמטים אך בלעדם קשה להבין את החומר ולכן מאוד קשה לפתור תרגילים.\nלמרות שיובל קצת מבולגן על הלוח וזה היה מקשה על ההבנה וקצת מעצבן, אך הוא היה מאוד מתחשב ומנסה לעזור ולהסביר כל דבר אם שואלים אותו, הוא בא לקראת הסטודנטים וזה הכי חשוב.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: חשובים מאוד והם ברמת המבחן. \nהייתי מעדיפה לצפות בתרגולים מוקלט ולנסות ופתור אותם לבד, כי על נטע לא הייתי מבינה כלכך בתרגולים, אך  בשעות הקבלה שלה היא מאוד עוזרת וזה עזר הרבה בפתירת תרגילי הבית המעצבנים\n\nשעורי הבית: לא קלים ודורשים השקעה. צריך להגיש 11/13 והם מהווים 15% מהציון הסופי\n\nהמבחן: קשה וארוך ודורש הבנה טובה לחומר והרבה תרגול.\n\nהשורה התחתונה: קורס לא קל, דורש השקעה, ההרצאות והתרגולים בו חשובים", "timestamp": 1678058855768}, {"author": "..,", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל שגם\nחוות דעת - הרצאות: כוללות המון פיתוחים מתמטיים של נוסחאות. הטענה היא שהמטרה של הפיתוחים היא שנבין יותר טוב את הנוסחאות, אבל אני לא בטוחה כמה זה עזר לי. יובל אחד המרצים הכי מקסימים שפגשתי בטכניון. ממש חשוב לו שנבין את החומר ותמיד אפשר לשאול אותו שאלות. הוא מלמד בצורה קצת מבולגנת, אבל זה במגמת שיפור.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: התרגילים בתרגול ממש עוזרים לתרגל את החומר וקשה לפתור את שיעורי הבית בלעדיהם. נטע לפעמים מסבירה את החומר בצורה לא הכי ברורה בתרגולים (למשל מדלגת על שלבי פיתרון רבים וקצת מלמלת לעצמה את ההסברים), אבל היא ממש משקיעה ועוזרת בשעות קבלה, אז אם אתם מרגישים שאתם צריכים את זה חד משמעית תשתמשו בזה.\n\nשעורי הבית: הרבה שיעורי בית, והרבה מהם לא קלים. מצריך כמה שעות עבודה בכל שבוע. מומלץ להיעזר בתרגילים מהתרגול בפיתרון שיעורי הבית.\n\nהמבחן: קשה מאוד. אנחנו היינו המחזור השני של יובל ונטע. אין ממש מה להסתכל על מבחנים של מרצים קודמים כי הסגנון של יובל שונה. בשני הקורסים שהוא העביר היה מבחן קשה בצורה חריגה ביחס לשיעורי הבית, ומאוד ארוך. תמיד יש שאלה עם טוויסט שדורש הבנה מעמיקה. מנגד, כמו שכבר צוין יש לקורס הזה אחלה צוות, והם בודקים את המבחן בצורה מקלה (השאלות במבחן פתוחות וככה גם אם לא הגעתם לתשובה הנכונה אבל הדרך שלכם הייתה נכונה ברובה תקבלו את מרבית הנקודות). בנוסף גם קיבלנו פקטור נדיב (הציון הוכפל ב1.1 והוספו עוד 6 נקודות). סך הכל בזכות הבדיקה המקלה והפקטור קיבלתי 30 נקודות יותר ממה שציפיתי לקבל.\n\nהשורה התחתונה: קורס לא קל, הרבה פיתוחים מתמטיים בהרצאות, תרגילי בית רבים ולא קלים, מבחן קשה, אבל סגל הכי מתחשב שיש.", "timestamp": 1678266225807}, {"author": "...", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: יובל חמוד ביותר וגם מבולגן. הוא רושם ומוחק מה שמאוד הקשה עליי. עברתי לצפות בהקלטות שלו ב 1.5 או ב 2.\n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: הגעתי לתרגול אחד ופרשתי. חשוב מאוד לעבור על התרגולים ועשיתי את זה לבד. מה שגם לא מספיקים לעבור על הכל בכיתה. \n\nשעורי הבית: נוראים. על רובם ישבתי במשך שעות. טוב שיש קצת רפרנסים. ממליצה לפתור את כולם לבד כי הם התרגול הכי טוב למבחן.\n\nהמבחן: מועד א- נכשלתי וגם היה קשה. להגנת הקורס אומר שלא סיימתי לעבור על כל החומר כשהגיע המבחן.\nמועד ב- מבחן נורמלי וציון נורמלי. היה הוגן.\n\nהשורה התחתונה: קורס קשה. לא להשאיר לדקה האחרונה (כמוני) ולעשות את כל השיעורי בית.", "timestamp": 1679509834463}, {"author": "ה", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: לא הייתי באף הרצאה שלו כי לא הצלחתי להקשיב לו אבל הוא מותק של בן אדם ומרצה חמוד מאוד שתמיד נענה לבקשת עזרה, פשוט החומר משעמם מאוד \n\nשם המתרגל/ת: נטע \nחוות דעת - תרגולים: נשמה אמיתית . קשה לה מאוד עם הכריזמה ולכן אני ממליצה לשבת בשורה ראשונה כדי לשמוע משהו אבל היא האדם הכי מתוק בעולם, תמיד עזרה לנו, תמיד רצתה לעשות הכל כדי שנבין והשקיעה כל מה שיכלה .  \n\nשעורי הבית: קשים, אך כדי להישאר על החומר מומלץ לעשות בהבנה. ממה שידוע לי אין רפרנסים\n\nהמבחן: היה קשה מאוד, כולם יצאו מהמבחן מזועזעים .. אבל הייתה בדיקה מאודדדדדדד מקלה שעזרה לעבור את הקורס הזה בשלום\n\nהשורה התחתונה: סגל מקסים, חומר משעמם, חובה מה נעשה", "timestamp": 1689425924497}, {"author": "**", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סהר רהב\nחוות דעת - הרצאות: \nאישית מאוד אהבתי את ההרצאות (אציין שהרוב לא אהבו), הוא היה קצת מבולגן ומפוזר, לקח לו זמן להגיע לפואנטה אבל לדעתי הן כן היו נחמדות. בדיעבד ואחרי המבחן - ההרצאות לא קריטיות בכלל למבחן. מעבר רציני על התרגולים ולטחון מבחנים מספק בדיוק באותה המידה \n\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nעברתי על התרגולים המוקלטים שלה במקום, הם היו אותו דבר רק שכאן אפשר לשים אותה על מהירות 1.5 \nהתרגולים נדרשים להבנת החומר ולראות את כל הטריקים החשובים, לא הייתי מוותרת, בדיעבד אפילו הייתי שמה עליהם יותר דגש\n\nשעורי הבית: \nמהווים 20% מגן! מה גם, שאין מגבלה על מספר ההגשות (אינסוף הגשות אפשריות). התרגילים לא קלים ודורשים מחשבה, אבל אם מתעקשים הם פתירים, ביחד עם העובדה שהם 20% מהציון ואפשר  להגיש כמה שרוצים עד לקבלת 100 זה פספוס לא לעשות, גם אם קצת קשה \nהערה - היה צריך להגיש 10 מתוך 14 תרגילים שפורסמו. תשימו לב שתרגילים 11 12 היו קלים משמעותית מ-8,9 לדוגמא, אם נמצאים בלחץ של זמן זה די שווה \n\nהמבחן: \nדומה מאוד למבחני עבר, לא היה פשוט אבל עם הרבה למידה בדגש על התרגולים ומבחני עבר אפשר להצליח בו. \n\nהשורה התחתונה: \nקורס חמוד, אישית החומר פחות מעניין אותי אז היה קצת יותר קשה ללמוד אליו, אבל באמת שיחסית ל-4.5 נקז אפשר להוציא בו ציון אחלה עם השקעה בהתאם לנקז שהוא", "timestamp": 1713451405076}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: הייתי בראשונות והיה משעמם עד מרדים אז הפסקתי להגיע. לדעתי אפשר להסתדר בלעדיהן.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: אחלה מתרגלת, בהתחלה הגעתי לתרגולים ולקראת סוף הסמסטר צפיתי בהקלטות. התרגולים הם חובה להבנה של שיטות פתרון, וכל תרגול מאוד עוזר לפתור את תרגיל הבית באותו נושא. \n\nשעורי הבית: הרבה תרגילי בית במהלך הסמסטר, בלי הגבלה על כמות ניסיונות ההגשה. לי הם לא היו קשים מידי, אם נתקעים על משהו יש הרבה דרכים לקבל עזרה (פורום שאלות, שעת קבלה, חברים עם שאלות דומות) אז מבחינתי היו סה\"כ בסדר ולא לקחו יותר מידי זמן. \n\nהמבחן: לדעתי תאם לגמרי את הרמה של התרגולים ובחלק מהנושאים תאם גם את הרמה של שיעורי הבית (היו נושאים בהם שיעורי הבית היו קלים יותר), חוץ משאלה אחת שהייתה די מכשילה והרבה לא הצליחו בה. אבל סך הכל לדעתי לא היה מפתיע במיוחד.\n\nהשורה התחתונה: עדיף לעקוב ולא לזלזל, גם אם רואים מוקלט- להיות באותו קצב עם המתרגלת תוך כדי הסמסטר. אם מצליחים את שיעורי הבית ומתרגלים מבחנים יהיה בסדר.", "timestamp": 1714463879600}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: סער רהב\nחוות דעת - הרצאות: \nהרבה אנשים לא הגיעו, אני מניחה שזה בגלל שיש הקלטות משנים קודמות, בנוסף לכך שסער הקליט גם השנה, אבל בעיני היה שווה להיות. ההרצאות היו ממש מעניינות, גם בגלל שהחומר מעניין (בעיני לפחות), וגם בגלל שסער מלמד עם המון התלהבות ושמחה. הוא לפעמים גולש קצת לדברים שהם לא 100% פרטים טכניים שאנחנו צריכים לדעת כדי לפתור את המבחן, אבל זה תמיד מעניין(: באופן כללי מרגישים שהוא לוקח את תפקידו כמרצה ברצינות, והוא תמיד שמח לעזור ולענות על שאלות.\n\nשם המתרגל/ת: נטע כספין\nחוות דעת - תרגולים: \nנטע סופר מקסימה ונותנת מעל ומעבר מהזמן שלה כדי לעזור לסטודנטים עם שיעורי הבית או עם הבנה של החומר. \n\nשעורי הבית: \nשיעורי הבית סבבה. הכי כיף זה שיש אינסוף נסיונות להגשת התרגיל, אז זה גם לא מלחיץ.\n\nהמבחן: \nסה\"כ לא מתחכם במיוחד, תואם את רמת הלימוד בקורס ואת הרמה של מבחנים קודמים. היה סעיף אחד שדרש הבנה קצת יותר מורכבת ואחוזי ההצלחה בו היו אפסיים, אבל בסוף פקטרו אותו.\n\nהשורה התחתונה: \nקורס חביב עם סגל מעולה. אם אתם מתעניינים בכימיה ופיזיקה, מומלץ מאוד(:", "timestamp": 1716120926201}]}