{"posts": [{"author": "Lir", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ישראל שכטר\nחוות דעת - הרצאות: שעה אחת בשבוע. מעניין וקצר. כדאי לשים לב לכל הדברים גם הקטנים שהוא ור כי הוא ממש אוהב פי המבח שהיה לנו לשאול על הדברים הקטנים והזניחים כביכול.\n\nשם המתרגל/ת: יונתן צימרמן\nחוות דעת - תרגולים: מתרגל מעולה!! מאוד משקיע ומאוד אכפתי. אוהב לתת העשרה שזה נחמד למי רוצה לדעת. תרגול של שעה, קצר ופשוט מאוד.\n\nשעורי הבית: אין\n\nהמבחן: היה לנו 4 שאלות לעומת 10 בשנים קודמות, ולכן כלטעותהיתה קריטית לציון. ישראל ממש אוהב כנראה שאול על דברים קטנים יחסית שהוא דיבר עליהם 2 דקות ולכן כשמתכוננים מומלץ לעבור על הכלל ולדעת כל מה שאמר.\nיש לומר שרוב השאלות אצל ישראל הן תיאורטיות (תשובות מילויות) ויש איזה שאלת חישוב אחת במבחן.מאוד חשבו להבין את התיאוריה למבחן. החישובים / פיתוחים עצמם מאוד פשוטים והוא מבקש אחד כזה במבחן אז בשורה תחתונה כדאי פשוט לדעת את התיאורטי והחישובים הם לא סרט, תבדקו רק שאתם מכירים אתהנוסחאות המתאימות וזהו.\n\nהשורה התחתונה: מכיוון שזה קורס של מעט נקז לא הרגשתי צורך להשקיע בו בכלל במהלך הסמסטר פרט לנוכחות בשיעורים כדי לעקוב.", "timestamp": 1597743073165}, {"author": "Nir Abramovich", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ישראל שכטר\nחוות דעת - הרצאות: הראה של שעה בשבוע. שכטר מעביר את החומר בצורה ברורה. שווה להקשיב ולרשום כי המבחן ברובו הוא תיאוריה.\n\nשם המתרגל/ת: יונתן צימרמן\nחוות דעת - תרגולים: מתרגל מאוד טוב, אכפתי וזמין. הלוואי והוא יהיה מתרגל בקורסים יותר כבדים\n\nשעורי הבית: אין\n\nהמבחן: שכטר לא נוהג לפרסם מבחנים משנים קודמות. לרוב המבחנים מורכבים מ4-10 שאלות. יש 1-2 שאלות חישוביות, והיתר זה תיאוריה. שואלים הרבה פעמים על דברים ממש קטנים ושוליים ולכן כדאי מאוד לדעת את הכל. \n\nהשורה התחתונה: קורס קל, רק לזכור ולשפוך את הכל במבחן.", "timestamp": 1600267199690}, {"author": "ש", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: הקורס עוסק בעיקר בספקטרוסקופיה , הרבה חומר בעיקר לשנן ולזכור למבחן\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא חובה ללכת לתרגולים אבל כן כדאי להסתכל על החומר כי למבחן יש דבר או שניים שלימדו בתרגול ולא בהרצאה\n\nשעורי הבית: שיעורי הבית באופן מכוון מעל רמת הקורס ולא מייצגים את המבחן אלא מן העשרה ( לפי מה שהמתרגלת אמרה) - הם מגן\n\nהמבחן: לא קשה ולא קל פשוט צריך להכיר טוב את החומר כמו ש אמרתי הרבה לשנן\n\nהשורה התחתונה: נחמד למי שמתעניין בספקטרוסקופיה ולמי שלא אז פחות", "timestamp": 1625779676630}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: נדב אמדורסקי\nשם המתרגל/ת: אנה יוחנובסקי\nשעורי הבית: לא רלוונטים בכלל למבחן\n\nהמבחן: טכני, משעמם. לשנן כמה שיותר, להקיא במבחן ולשכוח שנייה אחר כך.\n\nהשורה התחתונה: קורס מאוד משעמם, חסר תכלית אפילו. אך חובה. הוא סביל כי הוא קל מאוד", "timestamp": 1626703856445}, {"author": "נדב דויטש", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: נדב אמדורסקי\nחוות דעת - הרצאות: \nהרצאות קצרות של שעה אחת, עמוסות מן הסתם. לא תמיד ברור לאן זה מתקדם, אבל בסוף הקורס החומר מתחבר.\nסמסטר ראשון שנדב מעביר את הקורס, הוא שינה את התוכן די הרבה והפוקוס עבר להיות יותר תיאורטי מאשר חישובי כמו שהיה בעבר\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: \nאנה מתרגל חדשה יחסית, לא טובה כל כך. גם להקריא מדף צריך לדעת. היא כן בקיאה בחומר הקורס וכן מנסה להעביר בצורה מעניינת, אבל קצת חסרת כריזמה.\nשעורי הבית: \n4 גליונות שהם מגן, מתוכם לקחו את ה3 הכי טובים.\nברמה גבוהה יחסית לרמת התרגולים\n\nהמבחן: \nבגלל שאופי הקורס שונה לחלוטין, נדב פרסם לפני המבחן רשימה של שאלות בכל נושא שנלמד. נאמר על ידו שהשאלות האלו מכינות טוב למבחן, בפועל סגנון השאלות במבחן עצמו היה שונה ודמה יותר לשאלות שהיו בשיעורי הבית אבל ברמה פחות גבוהה. \nהשורה התחתונה: \nקורס חובה, אבל לא נורא כל כך.", "timestamp": 1627195879963}, {"author": "רז בוזגלו", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: נדב אמדורסקי \nחוות דעת - הרצאות: מרצה מאוד לא טוב. הוא מדבר בשפה של עצמו בלבד בלי לקחת בחשבון שיש סטודנטים בכיתה. מאוד לא מועיל להבנה של החומר ואפילו רק מסבך את הכל. \n\nשם המתרגל/ת: חנה יוחונובסקי \nחוות דעת - תרגולים: סבירה. לא מנוסה בלתרגל. התרגולים באופן כללי לא משקפים את רמת המבחן והיו יותר יבשים מאשר מעמיקים. \n\nשעורי הבית: 10% מגן, לא חובה להגיש אותם. היו מאוד ארוכים, לא משתלם לעשות אותם. בסוף זה לא תורם לציון הסופי באמת. הבדיקה מאוד דקדקנית ומעמיקה, מורידים על כל דבר הכי קטן. הקשר בין שיעורי הבית למבחן הוא מאוד מקרי, ואפילו שלא קיים. \n\nהמבחן: היה מבחן מוזר, לא נחמד. לא היה ניתן לצפות לשאלות מאוד מוזרות. אפשר לעבור אותו אבל צריך להיות מאוד בקיא בחומר לעומק וגם מאוד להיכנס לראש של נדב המרצה, שניסוח השאלות שלו בעברית הוא כזה שניתן לקרוא את זה בלפחות שני מובנים. \n\nהשורה התחתונה: קורס לא מעניין ולא נחמד. אפשר לעבור אותו וגם בציון גבוה. לא משתלם להשקיע בו, הוא רק 1.5 נקודות (מל\"ג שווה יותר אפילו) ולא למדתי בו שום דבר, חוץ מזה שהמוח שלי רק התפגר יותר ויותר ממנו.", "timestamp": 1631700062004}, {"author": "סתם סטודנט", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nהמרצה בכלל לא טוב, לא מסביר טוב, נוראאא משעמם, לא כזה אכפת לו מהסטודנטים, קשה מאוד להבין מה הוא מלמד ויש הרבה דברים שוליים שאמר בעל פה וכמובן שהופיעו במבחן.\nהיתה הרצאה אחרונה לפני 3 ימים מהמבחן ולימד חומר חדש!!!\nאם המרצה עשה משהו אחד טוב זה היה להקליט ולפרסם את ההרצאות.\n\nשם המתרגל/ת:  אנה\nחוות דעת - תרגולים: אין טעם לדבר הרבה עליה זאת פעם אחרונה שהיא מתרגלת וטוב שכך.\n\nשעורי הבית: לא היה\n\nהמבחן: קשה יותר מפעמים קודמות, יש מלא מלא מה לשנן ולפענח ולזכור כל דבר קטן שהועבר ואחר כך לנתח, לדעתי מבחן לא הוגן עם כמות חומר ענקית.\n\nהשורה התחתונה: \nקורס מפגר, חסר מטרה, רק גורם לכאב ראש ויש בו מלא חומר בהגזמה כאילו זה קורס של 4 נק\"ז והסגל רק גורם לקורס להיות יותר ויותר בלתי נסבל.", "timestamp": 1689017417514}, {"author": "בר-למברט", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נדב אמדורסקי\nחוות דעת - הרצאות: לא הגעתי להרצאות, נדב כן פירסם הקלטות עדכניות (נדיר בפקולטה לכימיה)\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: באמת משתדלת אבל רואים שלא נוח לה ללמד. שנה אחרונה שהיא מתרגלת אז לא אפרט יותר \n\nשעורי הבית: לא היו\n\nהמבחן: טריקי, דרש ידע מעמיק של חלק מהדברים אבל עביר אם עושים חרישה של שלושה-ארבעה ימים לפני המבחן\n\nהשורה התחתונה: יכול להיות מעניין אבל באמת טכני (איך הטכנולוגיה של ספקטופוטומטרים עובדת) ודורש שינון\nחומרים/כימיה - קורס חובה אין מה להגיד. כימית - למה לבחור את זה כבחירה?!", "timestamp": 1689327829476}, {"author": "פלורסטנציה", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: ואלה הצליח לשעמם אותנו ברמות שאי אפשר לדמיין.\nאבל הוא מקליט (נדיר שמרצים עושים את זה) ולכן מגיע לו המון כבוד.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: טוב היא סיימה לתרגל, וזה ממש בשורה טובה לסטודנטים הבאים בתור.\n\nשעורי הבית: לא היו\n\nהמבחן: קשה מאוד, עם 18 נק פקטור? אפשר להבין כמה זה היה הזוי ולא הוגן ומבלבל\n\nהשורה התחתונה: בטח לא מומלץ, אבל קורס אפשרי. אל תלמדו אליו רק לפני המבחן כי יש לא מעט חומר.", "timestamp": 1690295527351}, {"author": "סטודנט להנדסה", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: משעמם ולא ברור.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: בזבוז זמן.\n\nשעורי הבית: אין.\n\nהמבחן: נכון לא נכון חרטט בביטחון.\n\nהשורה התחתונה: לא התלהבתי.", "timestamp": 1704489906579}]}