{"posts": [{"author": "סתם סטודנטית מצולקת", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עידו גלרי\nחוות דעת - הרצאות: זוועה לא ברור ומבלבל עם המתמטיקה \n\nשם המתרגל/ת: לינוי \nחוות דעת - תרגולים: מתרגלת טובה בלעדיה שום סיכוי שהייתי עוברת \n\nשעורי הבית:  קשים ונבדקים בדקדקנות \n\nהמבחן: היה זוועתי רבע מהקורס נכשל *אחרי * פקטור בנוסף מבחני עבר של מרצה אחר ואין מאיפה לתרגל וגם את המבחנים שהעלו העלו בלי פתרונות \n\nהשורה התחתונה:  זוועה זה בכלל לא כימיה זה ללכסן מטריצות שהאיברים שלהם הם אינטגרלים", "timestamp": 1613305725834}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: משעמם, מונוטוני, מרדים ובעיקר לא יודע ללמד את החומר! הפקולטה לכימיה צריכה רענון שורות דחוף מבחינת מרצים! \n\nשם המתרגל/ת: לינוי נגר שאול\nחוות דעת - תרגולים: לא בקיאה בשום דבר שקשור לחומר הלימוד! מטעה ועונה על שאלות שלאחר מכן מופיעות בהגשות והן מתבררות כטעויות שמורידים עליהן נקודות.\n\nשעורי הבית: כל הסמסטר ניתנו הגשות ממוחזרות, ברמה סבירה בהחלט\n\n\nהמבחן: פי 1000 יותר קשה מהרמה שנלמדה בקורס. שום התחשבות ומענה שונה ממתרגלים שונים על שאלות במהלך המבחן - היה דרוש פקטור שמן כדי שכלפי חוץ תהיה נראות שהמבחן היה סביר.\n\nהשורה התחתונה: חבל שזהו לא קורס בחירה!", "timestamp": 1613490485486}, {"author": "עקרון אי הוודאות", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: \nאוי הברוך. אי אפשר להבין שום דבר. יכול להתחיל להסביר משהו ולסיים את הנקודה חצי שעה אחר כך כשכבר לא זוכרים מה הייתה המטרה. ההרצאות רלוונטיות אבל אי אפשר להבין הרבה\nשם המתרגל/ת: לינוי \nחוות דעת - תרגולים: \nמצילת הקורס. אי אפשר לצלוח את הקורס בלי להיות בכל תרגול שלה. המקור היחיד להבין מה קורה בקורס\nשעורי הבית: \n4 מטלות בית כשלוקחים את ה3 עם הציון הכי גבוה. הרוב ממוחזר ממבחנים שיש בדרייב (עם פתרון)\n\nהמבחן: בלתי אפשרי, כתוב מבלבל עם כוונה להכשיל\n\nהשורה התחתונה: \nמי שלא *חייב* את הקורס הזה שלא יקח אותו. לפחות לא במתכונת הנוכחית", "timestamp": 1613511506125}, {"author": "ParticleInABox", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עידו גלרי\n\nאפשר מאוד לאהוב את הקורס הזה ואפשר מאוד לשנוא אותו תלוי בעיקר בגישה, בעיני זה הקורס הכי מוצלח ומעורר השראה (תרתי משמע) שעשיתי בתואר עד כה, מאפשר הצצה לעולם הכימיה התיאורטית, אומנם עידו שם דגש בעיקר על הפן המתמטי (קצת מעצבן לפעמים) אבל מי שבאמת מתעניין ימצא באינטרנט את ההקשר הפיסיקלי.", "timestamp": 1613561497663}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: עידו גלרי\nחוות דעת - הרצאות: עמוסות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מומלץ להיות בכולם\n\nשעורי הבית: היו 4 לאורך כל הסמסטר אבל כל שבוע היו גם שאלות לתרגול עצמי.\n\nהמבחן: קשה, רוב המבחן היה על 3 השבועות האחרונים של הקורס כששאלה שלמה הוקדשה לשבוע האחרון בפרט!!\n\nהשורה התחתונה: קורס קשה ועמוס, כדאי לפתור את כל השאלות לתרגול עצמי ולדעת לפתור לבד את התרגולים. להשקיע לאורך הסמסטר כולו בגלל ריבוי החומר קשה יהיה להשלים פערים גדולים בסוף.", "timestamp": 1613653466911}, {"author": "Gil Bar Haim", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: הרצאות מעניינות, המון פיתוחים מתמטיים לא מאוד מסובכים. אורי דואג להראות חיבור בין מכניקת הקוונטים לשימושים שלה בכימיה ומעביר את החומר בצורה מעניינת ואינטואיטיבית כמה שאפשר.\n\nשם המתרגל/ת: לינוי נגר שאול\nחוות דעת - תרגולים: אין על לינוי, תרגולים קלילים שמציגים את החומר בצורה מאוד מובנת.\n\nשעורי הבית: לא קלים בכלל, יש רק 4 הגשות אבל על כל הגשה צריך לשבת ולעבוד. בסופו של דבר מי שפותר את הגיליונות לבד מבין את החומר בצורה עמוקה, שווה את ההשקעה.\n\nהמבחן: מזעזע! אחרי תוספת של חצי שעה הרוב לא הספיקו לסיים 2 שאלות מתוך 3:(\n\nהשורה התחתונה: קורס חמוד מאוד ומעניין, לא מאוד כבד תאורטית ולא מאוד עמוס.", "timestamp": 1644388085259}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות והתיאוריה נחמדה. אבל הסיוט בקורס הזה זה המטמטיקה.\n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: תרגולים סבירים, אין שום דבר חוץ ממטמטיקה וחישובי אינטגרלים מסריחים.\n\nשעורי הבית: מאוד קשים.\n\nהמבחן: מזעזע. \n\nהשורה התחתונה: אל תקחו את הקורס הזה אם זה לא חובה כי פשוט סיוט ורמת קושי מוגזמת", "timestamp": 1645903746959}, {"author": "המילטוניאן", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: הרצאות אינפורמטיביות אך עם המון פיתוחים מתמטיים לא רלוונטיים כך שבקלות ניתן ללכת לאיבוד ולשכוח למה התחלנו עם זה בכלל. עם זאת, שווה להיות נוכח בכל ההרצאות.\n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: התרגולים עמוסים קצת אך בהחלט עוזרים להבין את החומר. רמת השאלות הקשות שהובאו בתרגולים לא שיקפה בכלל את הרמה שנדרשה במבחן. \n\nשעורי הבית: 4 גיליונות סה''כ. גם שיעורי הבית לא שקפו בכלל את הרמה שנדרשה במבחן, אך כן דרשו זמן ועזרו להטמיע את החומר.\n\nהמבחן: עמוס ובכמה רמות יותר קשה מכל מה שהובא בקורס. \n\nהשורה התחתונה: זה יותר שילוב של פיסיקה וליניארית מכימיה , עם רמת קושי סופר מוגזמת .", "timestamp": 1646918160964}, {"author": "c", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: אחלה מרצה, ההרצאות מעניינות אבל מלאות בפיתוחים מתמטיים\n\nשם המתרגל/ת: לינוי שאול\nחוות דעת - תרגולים: מתרגלת טובה, רצה על החומר בתרגולים אבל אין ברירה\n\nשעורי הבית: קשים!! לא ברורים!!\n\nהמבחן: נורא ואיום, קשה מאוד מאוד\n\nהשורה התחתונה: קשה", "timestamp": 1675676301354}, {"author": "ins", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \nמלמד ממש טוב רק שאי אפשר להבין מילה ממה שהוא אומר פשוט כי החומר הזוי ולא מובן בעליל\n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: התרגולים הם תרגולים באלגברה 2 אז הם מאוד מתמטים ולא ברורים אבל היא מעבירה את התרגולים צורה טובה\n\nשעורי הבית: לא הבנתי כלום בקוונטית אז מזעזע אבל ריפרנסתי (והם בזוגות)\n\nהמבחן: מחריד ברמה קיצונית, אבל היו דווקא ציונים סבבה איכשהו \n\nהשורה התחתונה: קורס מזעזע!!!! לא משנה כמה למדתי לא הבנתי כלום. אני יודעצ עכשיו קוונטית בדיוק כמו לפני 4 חודשים", "timestamp": 1677508430411}, {"author": "(;", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: \nקודם כל אורי הוא מרצה מעולה. מעבר לזה, לדעתי ההרצאות בקורס היו מההרצאות היותר מעניינות שהיו עד כה בתואר. כן יש המון פיתוחים מתמטיים מייגעים, אבל גם לא מעט הוכחות מעניינות וסך הכל די נהניתי.\n\nשם המתרגל/ת: לינוי \nחוות דעת - תרגולים: \nגם לינוי מתרגלת מעולה. התרגולים כן היו מאוד עמוסים מבחינת הקצב והקושי, אבל לינוי לגמרי נתנה את המקסימום גם בשעות התרגול וגם לאחר מכן, בשעות הקבלה.\n\nשעורי הבית:\nהיו ארבעה גיליונות, והם היו ארוכים, קשים ולא ברורים.  \nצוות הקורס ניסה להיות מקורי בכתיבת השאלות, אבל זה הוביל בעיקר לטעויות בשאלות, ודי דפק את הסטודנטים.. \nלכן ממליץ לחכות כמה ימים לפני שמתחילים את הגיליון, או לשלוח מייל לסגל כשחושדים שיש טעות.\nהייתה גם מטלת בונוס קלילה, מומלץ לעשות.\n \nהמבחן: \nכמצופה פחות או יותר. לא היה קל בכלל, אבל אי אפשר להגיד שלא היה הוגן. בסופו של דבר המבחנים די חוזרים על עצמם (ברעיונות הכלליים) אז לתרגל המון מבחנים ושאלות (רצוי מהמבחנים של אורי ולינוי) ואמור להיות בסדר.\n\nהשורה התחתונה: \nקורס לא קל, עמוס, ולפעמים מייגע אבל לדעתי מאוד מעניין והסגל מעולה.\nמה שכן, מעבר לכמה נגיעות לקראת הסוף, הרבה כימיה לא תקבלו כאן.", "timestamp": 1678633207566}, {"author": "malek igbaria", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אורי פיסקין\nחוות דעת - הרצאות: \nההרצאות של אורי מאוד מסודרות ומאוד קריטי להבין אותם כדי לקבל ציון גבוה אבל כדי רק לעבור אפשר ללא הרצאות\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: תרגולים יחסית טובים אבל לא תמיד מובנים צריך לחזור הביתה ולעבור עליהם עוד פעם\nשעורי הבית: היה לנו 4 הגשות הראשונה חזרה מתמטית ואחר כך פיתוח בעיות לפי החומר הנלמד בקורס.\nהמבחן: אפשר לעבור אותו בקלות כאילו בכל שאלה יש שאלות חימום בסיסית אבל הסעיפים שאחרי שאלות החימום דורשים הבנה ויש חלק של שאלןת טכנית מאוד\nהשורה התחתונה: צריך לשלוט טוב בקדמים של הקורס", "timestamp": 1679733365421}, {"author": "Iohannes Magnvs", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: האחד והיחיד פרופ. אורי פסקין\nחוות דעת - הרצאות: \nאוהבים אלגברה? שונאים כימיה אורגנית? זה הקורס הכי טוב בשבילכם. ועכשיו ברצינות:\nפסקין מרצה מעולה, שנים מעביר את הקורס הזה ואני מאחל למחזורים הבאים גם ללמוד איתו. הוא יודע להעביר את החומר בצורה ברורה ועם כמה שפחות סיבוכים,  אבל לצערי לא הכל תלוי במרצה. הרוב המוחלט של הקורס זאת מזבלה אלגברית , אבל התמצית עצמה מעניינת ונותנת הסבר להמון תופעות בטבע ובכימיה בפרט. החלק הכי רלוונטי לחומרים/כימאים זה בעיקר החלק של ספין ואורביטלים, שאותו גם לומדים ביסודות הכימיה רק בצורה מצומצמת. חשוב לזכור כל פעם שמתחילים עוד הרצאה ב8:30 בבוקר שאולי זה נראה דרעק אבל לנושאים האלה יש חשיבות מכריעה בקורסים בהמשך, במיוחד מצב מוצק וספקטרו.\n\nשם המתרגל/ת: לינוי נגר שאול \nחוות דעת - תרגולים: \nלינוי בן אדם טוב, ובאמת שהיא באה מאוד לקראתנו בהכל ומנסה לעזור במידת האפשרות. עם זאת, כל מה שעשינו בתרגולים זה לטחון אלגברה 2 ואינטגרלי חפיפה ככה שהערך המוסף של התרגולים להבנה התיאורטית של החומר, לפחות בשבילי, היה מזערי.\n\nשעורי הבית:  4 גיליונות, הרוב מהספר של אורי (כן, הוא כתב ספר על קוונטים, רק באנגלית) שלדעתי קשים יותר מהרמה הממוצעת של הקורס אבל היו בהם כמה דברים חשובים וספוילרים להרצאות.\n\nהמבחן: במקרה הכללי, המבחנים של אורי חוזרים על עצמם במבנה- שאלה על מודל כלשהו, שאלה על הפרעות ושאלה על אורביטלים/ספין/ היקל. המבחנים לא קלים אבל הוגנים,  והממוצע סביר. במיוחד כשמועד א כמעט זהה למועד ב וזה עם חומר פתוח.\nבמבחן *שלנו* היו הפתעות: הרוב המוחלט של הסעיפים עסקו בחלק האחרון של הקורס- ספין ואורביטלים. המבחן היה מתיש ומלא באלגברה,  אבל לא קשה מידי להבנה. בייחוד שני סעיפים מהחוג השביעי של הגיהינום שביחד מהווים 19 נקודות וכללו כמויות מזוויעות של אלגברה. \n\nהשורה התחתונה: כל הקורס הזה הוא בעצם פיסיקה קוונטית 'For Dummies' אבל בהחלט אפשר לעבור אותו. וכימאים שקוראים את זה- הקורס הזה עדיין עדיף על אורגנית.", "timestamp": 1713359614093}, {"author": "Ilya Katz", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: הרצאות מעניינות, אורי מרצה כריזמטי ויודע איך ועל מה לדבר. חסרון מובהק (אישית) זה שההרצאות הן ב-08:30 בבוקר. מצד שני, הסמסטר היו הקלטות, למרות שלהשלים פערים במהלך הסמסטר זה לא קל.\n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים:  מתרגלת מצוינת, למרות שהתרגולים מהירים ולא תמיד ברורים בהתחלה. לינוי יודעת על אילו נושאים לתת דגש יותר ארוך על המושגים והבסיס ואילו נושאים צריך יותר תרגול ושאלות כדי להבין.\n\nשעורי הבית: 5 גליונות תקפים (סה\"כ 16% תקף) להגשה במהלך הסמסטר+ גליון בונוס (עד 15%). מהתקפים לוקחים את ה-4 הכי טובים. הגליונות לא מאוד קלים, אבל לחלקם יש טריק שברגע שמפצחים- אפשר לפתור די מהר. גיליון בונוס לא עשיתי, דורש תכנות וזמן שלא היו לי.\n\nהמבחן: מבחן לא קל, אבל מאוד הוגן. כל שאלה מתחילה עם סעיפי מתנה- לנרמל פונקציה, פ\"ע ו-ע\"ע של מודל ידוע, משוואה סקולרית בצורה כללית. סעיפים נוספים לתוך השאלה עולים ברמה וכן דורשים הבנה של החומר. אם פותרים מבחני עבר ושולטים טוב בחומר- אין סיבה לקבל פחות מ-80.\n\nהשורה התחתונה: קורס מעניין שמקשר בסופו את המתמטיקה לנושאים בסיסיים בכימיה (ספין, אורביטלים, קשרים כימיים). קורס עמוס ודורש השקעה לאורך הסמסטר אבל.", "timestamp": 1713690977472}, {"author": "ב", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי \nחוות דעת - הרצאות: \nאורי היה ממש נחמד ואכפתי אבל בהרצאות היו הרבה פיתוחים למשוואות שממש קשה להבין איך הם נקשרים לכימיה\nבהתחלה חשבתי שהקורס יהיה מעניין אבל אין דרך להבין על מה מדובר ואיך הגיעו למסקנות מסיימות \nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: \nלינוי גם מאוד נחמדה ומאוד חשוב לה שנבין ונוציא ציונים טובים \nשעורי הבית: \nהיה 4 תרגילים שהיו מאוד קשים ולקחו הרבה זמן אבל נותנים עליהם ציונים טובים ובנוסף תרגיל בונוס שאין סיכוי לפתור אותו\nהמבחן: \nשאלות חוזרות על עצמן משנים קודמות כך שגם אם החומר לא מובן כד הסוף ניתן להוציא ציון טוב ובנוסף החומר פתוח \nהשורה התחתונה: \nצוות הקורס מאוד נחמדים ונותנים יחס מעולה ואפשר לסיים את הקורס בציון טוב אבל אחרי הרבה עצבים כדי להבין את החומר", "timestamp": 1713979191731}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: \nמרצה טוב, מנסה להנגיש את החומר ועונה על כל השאלות, רוב ההרצאות עצמן זה הוכחות ופיתוחים מתמטיים\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: \nאחת המתרגלות הגרועות שהיו לי. רוב התרגולים בכלל לא פותרים שאלות שתראו במבחן אלה שאלות של הוכחות שלא הספיקו בהרצאה (אולי כי קוצר הסמסטר אבל לא ברור) גם נוטה לדלג על שלבים בפתרון. הייתי מביאה את הפתרונות של התרגולים מהדרייב (היא מסרבת להעלות אותם מראש) ועוברת עליהם במקביל בשביל להבין את כל השלבים\nשעורי הבית: \nלא קשורים בכלום למבחן עצמו, בעיקר הוכחות מתמטיות שוב של נושאים שלא הספקנו בהרצאה או בתרגול, לא מאוד קשה לקבל ציונים טובים\nהמבחן: \nקשה אבל חומר פתוח\nהשורה התחתונה: לא מה שציפיתי בכלל מהקורס אבל הרצאות מעניינות", "timestamp": 1715017287637}, {"author": "רוטור קשיח", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי פסקין\nחוות דעת - הרצאות: סה\"כ מרצה לא רע, השעות בבוקר כן מקשות, אבל הוא כריזמטי ומחפה על כך. יש מלא מתמטיקה בהרצאות וכל השדים מהעבר צצים (חדואות, אלגברה, מדר) וגם מההווה (הסתברות, מדח). \n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: היא סבבה לגמרי, קצת רצה, אבל גם השעות היו קשות (אחהצ) אז מודה שלא הכל בגללה. סה\"כ גם מאוד באה לקראת הסטודנטים, מאריכה הגשות אם צריך, זמינה לשאלות בהפסקות וגם עשתה שאלת קבלה מרוכזת באמצע הסמסטר לסגירת פערים.\n\nשעורי הבית: לא קשורים בכלל לכלום, הרגיש לי שחלקם בשביל לחסוך זמן בהרצאות/תרגולים. בהתחלה עוד היו תרגילים של חישובים בדומה למבחן, אך בסוף רק הוכחות חסרות פואנטה שמציבים נוסחאות מהספר של אורי.\nהיה תרגיל בונוס שחלקו הראשון היה בשימוש עם פייתון/מטלב וחלקו השני היה הוכחות מהספר של אורי. לוקח זמן אבל שווה את המאמץ (יכול והעלה עד 15% לציון הסופי).\n\nהמבחן: הרגיש לי הוגן, אומנם הייתה בו שאלה שלמה שלא היה משהו דומה לה במבחנים קודמים, אבל סה\"כ מרגיש לי שהשאלות תואמות את הרמה של מבחנים קודמים. \n\nהשורה התחתונה: לא מרגיש לי שאני יודע כימיה קוונטית על אף שהצלחתי בקורס. סה\"כ קורס במתמטיקה ולא בכימיה.", "timestamp": 1715067949878}, {"author": "7890", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: ההרצאות חשובות. החומר של הקורס קשה אבל המרצה מנסה כמה שיותר לפשט את החומר.\n\nשם המתרגל/ת: לינוי\nחוות דעת - תרגולים: תרגולים עוזרים להבנת החומר לינוי מדהימה ועוזרת הרבה בהגשות במהלך הסמסטר וגם לקראת המבחן עזרה מאוד.\n\nשעורי הבית: ארוכים ולא קשורים לתרגולים , אין רפרנס אבל עדיף לפתור אותם כי עוזרים להבין את החומר.\n\nהמבחן: מועד א, 3 שאלות, 2 שאלות ראשונות היו לרוב טכנים ו2 סעיפים אחרונים בכל שאלה צריכים הבנה של החומר, שאלה שלשית הייתה מאוד קשה, היו שאלות בונוס במבחן(6 נק). לפי דעתי הדרך הנכונה ללמוד למבחן היא לפתור כמה שיותר מבחנים ועדיף ללמוד טוב ולהוציא ציון ממועד א ולא לגשת למועד ב. \n\nהשורה התחתונה: קורס שצריך הרבה השקעה בסמסטר אבל אם לומדים טוב למבחן ניתן להוציא ציון טוב.", "timestamp": 1716361988735}]}