{"posts": [{"author": "גיבס", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה:  אלי קולודני\nחוות דעת - הרצאות: \nמפוזר קצת אבל רואים שהוא מבין טוב מאוד על מה הוא מדבר. שווה קצת לכוון אותו לפעמים שיתעכב על דברים פחות מובנים\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: \nלא הייתי ברוב התרגולים וחבל. מתרגלת ממש טובה\nשעורי הבית: \nארוכים וקשים אבל עם ממוחזרים כבר עשור עם פתרון בדרייב\nהמבחן: \nחומר פתוח ויש לפעמים שאלות ממוחזרות אז כדאי לבוא עם מבחני עבר. העקרונות חוזרים על עצמם. מבחן הוגן יחסית\nהשורה התחתונה: \nמעניין מאוד, אם זוכרים טוב תרמודינמיקה מיסודות אז אין בעיה", "timestamp": 1613511719775}, {"author": "trEnopy", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלי קולודני\nחוות דעת - הרצאות: קל מאוד לאבד את הקשב, מומלץ לשמוע כשלא נרדמים בלילה.\n\nהמבחן: פיתוחים פיתוחים פיתוחים\n\nהשורה התחתונה: הנושאים של התרמודינמיקה מאוד מעניינים למי שמתעמק חוקר ומנסה להבין, הקורס קצת הורס את זה.", "timestamp": 1613563389192}, {"author": "קלאוזיוס", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עידו גילרי\nחוות דעת - הרצאות: \nמאוד מאוד מעניינות, נורא נהניתי מלהבין את התרמודינמיקה לעומק ולא רק לרוץ על פיתוחים מתמטיים.\nדואג תמיד להסביר את עצמו כמו שצריך.\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: \nמתרגלת מעולה! מסבירה בצורה מאוד טובה את החומר והורגש שחשוב לה שנצליח ונשאל שאלות, תמיד הייתה זמינה לשאלות במייל או בשעת קבלה!\nשעורי הבית: \nלא קלים בכלל, עידו ציפה לרמה מאוד גבוהה מאיתנו והמון פעמים נאלצנו להיעזר אחד בשני מאחר והיה מאוד מורכב ומסובך, שיעורי בית נבדקו בקפידה.\nהמבחן: \nמבחן בית, היה מאוד מאוד מאוד לא פשוט.\nמבחן של 3 שאלות מתוכם צריך לענות על 2 כאשר בכל אחת יש קרוב ל10 סעיפים כבדים הדורשים פיתוחים ושימוש באקסל.\nניתנו תחילה 12 שעות למבחן אך גם זה לא הספיק ולכן התבקשה הערכה של מס' שעות (עד 00).\nלמרות קושי המבחן נראה שהם התחשבו בבדיקה והציונים היו סבירים מאוד, בנוסף הם היו פתוחים לאופציה של מבחן בית במקום פרונטלי מה שמאוד משמח לשמוע.\nהשורה התחתונה: \nקורס מעניין מאוד אבל גם קשוח.", "timestamp": 1647002878765}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלון הופמן\nחוות דעת - הרצאות: \nאלון מרצה מעניין, מעביר את החומר בצורה נעימה וניכר שהוא רוצה שנצליח. \nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: \nמורן פשוט מושלמת. גם מסבירה את החומר טוב וגם מעבירה את התרגולים באווירה כיפית.\nשעורי הבית: לא מאד קשים אבל גם לא הכי קלים\n\nהמבחן: הוגן \n\nהשורה התחתונה: קורס מעניין", "timestamp": 1677202114873}]}