{"posts": [{"author": "Nir Abramovich", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "אני לקחתי את המעבדה בסמסטר קורונה ומספר המעבדות ירד בחצי. לבחנים יש משקל גדול בציון הסופי ולכן שווה מאוד להשקיע בהם ולזכור טוב את המגנונים. המעבדה עצמה יותר פשוטה לעומת כימיה אנליטית 1 (כי אין צורך ברמת דיוק גבוה בכל שלב) ולפעמים נחים בחוץ עד שמתקבל התוצר. שווה להשקיע ואפשר לקבל זה ציון מעולה. המדריכים ממש טובים ונחמדים", "timestamp": 1598269523307}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "בסמסטר קורונה היו לנו רק חצי מהמעבדות. הבחנים לא קלים, במיוחד אם לא זוכרים כימיה אורגנית מושלם. אני הקדשתי יום שלם לפני המעבדה ללמידה אליה. המעבדה עצמה לא סוף העולם אבל גם לא מאוד קלה.", "timestamp": 1610011922118}, {"author": "כימיק", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "המעבדות עצמן מאוד נחמדות וכיפיות. ממש עזר להבין את החומר של אורגנית.\n\nשיעורי הבית: הדוחות המסכמים די קלים, אין הרבה דרישות.\n\nהמבחן: יש מבחן לפני כל מעבדה, המבחנים די הוגנים.\n\nהשורה התחתונה: קורס מומלץ אבל יוצר קצת עומס", "timestamp": 1626015732114}, {"author": "נדב דויטש", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאין הרצאות\nשם המתרגל/ת: ורה\nחוות דעת - תרגולים: \nהייתה ממש קלילה ונחמדה, ראתה שהקבוצה מבינה את החומר ופשוט נתנה לנו לעבוד מבלי לשבת עלינו יותר מידי.\nכן עזרה כשהיה צריך. \nשעורי הבית: \nהדוחות בקורס הם 10% מהציון הסופי. הם בדיחה וכולם לוקחים אותם ככאלה. כל מה שחשוב למדריכים זה שמנגנוני התגובה יהיו נכונים, כל השאר זה בונוס. לא ראיתי מישהו אחד שקיבל על דוח פחות מ90\nהמבחן: \nבחני הכניסה הם סיפור אחר לגמרי. לפני כל בוחן צריך ללמוד את כל הנושא של המעבדה מחדש. אם לא לוקחים את הקורס בסמסטר עוקב לקורס העיוני (וגם אם כן תכלס) זה נעשה מאוד מאוד עמוס. דורש השקעה של כמה שעות טובות כדי לדעת כל נושא ברמת הפרטים שנדרשת מהסטודנט. ככל שמתקדמים במעבדות אז גם מצפים מהסטודנטים לזכור וגם לענות על שאלות שקשורות למעבדות קודמות.\nהשורה התחתונה:\nהמעבדה עמוסה מאוד. דורשת הרבה זמן התכוננות.\nבפועל העבודה במעבדה היא לא קשה בכלל ויש הרבה זמנים מתים. הייתה רק מעבדה אחת או שתיים שממש דרשו מאיתנו את כל זמן המעבדה, לרוב סיימנו כמה שעות מוקדם יותר", "timestamp": 1627196306537}, {"author": "רז בוזגלו", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "קורס מעבדה, צריך להתכונן היטב לבחני הכניסה הדורשים שינון מדויק מאוד של המנגנונים (בבחנים לא בהכרח שואלים על התגובות המתרחשות בניסוי עצמו). הדוחות מאוד ארוכים וגוזלים לא מעט זמן. עם כל זאת, הקורס מאוד מלמד ומעשיר את הידע. אם משקיעים במהלך הסמסטר - בסוף הציון גבוה מאוד ומשתלם.", "timestamp": 1631699800651}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "אז ככה:\nעשינו סך הכל 10 מעבדות כל הסמסטר, לא כולל שבוע הראשון שהיתה פגישת היכרות.\nמבחינת זמנים זה לא תמיד 8 שעות לפעמים מספיקים את זה ב 4-5 שעות. רק המעבדה הראשונה היתה 8 שעות עם חצי שעה הפסקה. במעבדה עצמה יש הרבה זמנים מתים שפשוט מחכים לחימום ודברים כאלה.\nחלוקת ציון זה היה 50% הערכת מדריך, 40% בחני כניסה ו 10% דוח מסכם.\nמבחינת הערכת מדריך : מבחינתם אף אחד לא אדיאלי ולא נותנים 100 , הציונים הם בערך 85- 95.\nהבחנים מאוד מאוד מאוד קשים !!! זה לוקח יום שלם לפני ללמוד להם והקושי נובע מזה שמסתמכים על דברים שלמדנו בקורס אורגנית 1 ואפילו אורגנית 2 וגם דברים אקסטרא שלא למדנו בכלל וצריך להשלים לבד מהספרים. והבחנים לאו דווקה שואלים על הניסוי אלא יותר על מנגנונים ותגובות לא רלוונטיות מאוד מאוד קשים שלא ראינו אף פעם ולא הוגנים. אני חושב שהם יותר קשים ממבחן סופי של אורגנית 1.\nהדוח תלוי במדריך יש כאלה שמבקשים הרבה ויש כאלה שרוצים רק את התכלס, לדעתי לא שווה את ההשקעה.\n\nהשורה התחתונה: אם זה לא חובה אז אל תקחו.", "timestamp": 1654709125659}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: מדריכה-יוליה גולדשטיין\nחוות דעת - הרצאות: \nלהתרחק כמו מאש מהמעבדה בחורף. יש רק קבוצה אחת, ככה שכל המעבדות תלויות בגחמות של מדריך אחד. המדריך מאוד משפיע על האווירה במהלך המעבדה וכמובן גם ציונים. בסמסטר חורף המדריכה היתה מאוד קשוחה, בחנים קשים ובדיקה רצחנית. גם בדוחות וגם בבחנים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: תלוי מאוד במדריך- לעשות בדיקה לפני שלוקחים את הקורס", "timestamp": 1673529673087}]}