{"posts": [{"author": "2024", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: \nקורס עמוס מאוד, המון נושאים דחוסים לסמסטר אחד ומי שמגיע בלי רקע בכימיה מרגיש שהוא במרדף אחרי החומר מהשבוע הראשון. גלית המרצה מהממת, מחויבת בטירוף להצלחה של הסטודנטים ועושה מעל ומעבר גם מחוץ לשעות ההרצאה, אם זה בשעות קבלה ואם זה במתן שעות תגבור נוספות. קצת קשה להבין אותה בהתחלה בגלל שהיא מדברת בקצב גבוה, אבל אם מבקשים ממנה להאט בזמן הרצאה היא משתדלת. \n\nשם המתרגל/ת: נטע - מתרגל אחראי\nחוות דעת - תרגולים: מסביר נהדר, הסנכרון בינו לבין גלית לא היה 100% והיו מספר מקרים שתרגולים נבנו על נושאים שעוד לא למדנו בכיתה. מעבר לזה הוא נשמה וגם מאפשר להגיע לשעות קבלה, עונה למיילים ומאוד זמין באופן כללי.\n\nהשורה התחתונה: סך אולי הקורס הכי קשה שהיה לי בסמסטר, אבל הכל עביר, ומומלץ בחום להיעזר בעמנואל פאר, 85% מהחומר בקורס מופיע בספרים שלו וזה מאוד מקל.", "timestamp": 1713950763141}, {"author": "גלית", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: \nגלית מחוץ לכיתה נשמה שברור עד כמה היא אוהבת את הכימיה שהיא מלמדת, אבל היא פשוט מרצה גרועה, טסה בחומר, מצפה מאיתנו שנלמד כל השבוע רק כימיה שזה ממש לא ראילי, גם לא שלחה מספר הקלטת שלטענתה ״אבדו״, בגדול אחד הקורסים היותר כבדים בסמסטר ראשון, וחבל שהיא מקשה אותו עוד יותר, ממש לא יודע מה 60% מהכיתה היו עושים בלי ספרי עמונאל למרות שזה לא מכסה את כל החומר החדש\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: לא יודע מה היינו עושים בלעדיו התרגולים ממש מועילים ביחס להרצאות.\n\nשעורי הבית: \n\nהמבחן: \nעוד לא עשינו אבל שינתה את הקונספט השנה ויהיו שאלות פתוחות בניגוד לשנים שעברו\nהשורה התחתונה: קורס שלדעתי דורש המון השקעה תוך כדי הסמסטר", "timestamp": 1714587175854}, {"author": "לא חשוב", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מי שלפניי צודק ב 100% !! פשוט אין מה להוסיף", "timestamp": 1715105615531}, {"author": "..", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: בסך הכל גלית מרצה טובה, היא מדברת מהר ולפעמים אפשר לאבד אותה בעקבות זה אבל היא מראש גם אומרת שהיא מנסה לדבר לאט ולפעמים מאיצה, ומעריכה את זה שמבקשים ממנה להאט.\nעונה לשאלות בלי סוף, עד שהיא כבר לא יכולה כי פיזית אין מספיק זמן לשיעור, יושבת שעות עם סטודנטים בזמן שעות קבלה ועוד בשביל שהם יבינו, עונה מהר במיילים ומסבירה כמה שרק אפשר כדי שיבינו אותה עד הסוף. הקורס עמוס וכולל הרבה חומר, בהרשמה לקורס מקבלים חוברת הכנה שמומלץ מאוד לעבור עליה, היא מארגנת את הבסיס הנדרש. \n\nשם המתרגל/ת: נטע\nחוות דעת - תרגולים: נטע מתרגל מעולה, מראה את דרך פתרון התרגילים היעילה ביותר ומסביר כמה שצריך בשביל שכולם יבינו בדיוק איך לגשת לשאלה\n\nשעורי הבית: משוחזרים משנים קודמות, לא קלים בכלל אבל ברגע שמצליחים אותם זה אומר שההבנה בנושא הזה היא לגמרי ברמה של להצליח שאלה במבחן\n\nהמבחן: מאוד פייר, פעם ראשונה שבמבחן בכימיה הוא מחולק לחלק אמריקאי (שבו הרמה של השאלות נעה מקלות מאוד לכמה מאתגרות, לא משהו שאי אפשר להצליח), וחלק פתוח שבו השאלות היו קלות והוא נועד לנקודות חינם עבור אנשים שגם אם טעו בתשובה הסופית, עיקר הנקודות יגיעו על הדרך\n\nהשורה התחתונה: קורס עמוס, אבל עם השקעה והקשבה לגלית ולנטע אפשר להצליח בו, סגל מאוד מתחשב ועוזר", "timestamp": 1715279695141}, {"author": ":)", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דר. גלית פרברי\nחוות דעת - הרצאות: \nגלית מרצה מעולה, קשובה ואכפתית. האהבה שלה לכימיה באה לביטוי בדרך ההוראה שלה - היא מקשרת את נושאי הקורס לעולם הרפואה, יורדת לפרטים ומסבירה את ההגיון העומד מאחורי כל חוקיות. פשוט כיף להגיע להרצאות. \nנוטה לדבר מהר אך ברגע שמסבים את תשומת ליבה, היא מסבירה שוב בשמחה.\n\nשם המתרגל/ת: נטע בן ארי\nחוות דעת - תרגולים: \nמתרגל מדהים! מסביר שלב-שלב ומלמד גישה לפתרון שאלות. סבלני, אכפתי ומעודד השתתפות בתרגול. \n\nשעורי הבית: חשובים ותורמים להבנת החומר.\n\nהמבחן: הוגן מאוד, ניתן לקבל עד 8 נקודות בונוס.\n\nהשורה התחתונה: צוות מדהים שחשובה לו הצלחת הסטודנטים. הקורס דורש השקעה במהלך הסמסטר, בהתאם לכמות הנק\"ז, מומלץ להתעקש על הבנת הנושאים ולא להזניח.", "timestamp": 1715503351032}, {"author": "...", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ד\"ר גלית פרברי \nחוות דעת - הרצאות: \nגלית מרצה עם הרבה מאוד תשוקה למקצוע. מסבירה הכל ברגש ובפירוט אך לעיתים נוטה לדבר מהר מדי וניתן לאבד קשב בקלות. גלית מודעת לכך ומעודדת את הקהל לבקש ממנה להאט את הקצב כשצריך. תוכן ההרצאות הוא לעיתים רב, לא פשוט ודורש הרבה השקעה בבית כדי להבין אותו אך הסגל זמין כמעט 24/7 לכל שאלה וסייע לנו המון, גם בתרגולים, שעות קבלה והרצאות חזרה מעבר למתוכנן בקורס. גלית משתדלת לקשר כמעט כל נושא לעולם הרפואה כדי שנבין למה אנחנו צריכים ללמוד כימיה. טרם הקורס מקבלים חוברת הכנה, חשוב מאוד ואפילו חובה לדעתי לעשות אותה. ההסברים שם מובנים והיא מקנה בסיס הכרחי לקורס. בקורס לא חוזרים על התוכן שלה וחבל להתחיל את הקורס עם פער שיהיה קשה להשלים.\n\nשם המתרגל/ת: נטע בן ארי\nחוות דעת - תרגולים: \nנטע מתרגל מצוין. מסביר כל דבר לאט ובסבלנות ולגמרי מודע לכך שכימיה זה לא הצד החזק של רפואנים. כל תרגול עשה סדר בחומר ההרצאות שהיה לעיתים לא פשוט לעיכול והקנה שיטות עבודה שהוכיחו את עצמן במבחן.\n\nשעורי הבית: \nברמת קושי משתנה, דומים לשאלות בינוניות-קשות במבחן. חשוב מאוד לעשות את כולם לבד ולהבין את דרך הפתרון אחרת צוברים פער שיהיה קשה להשלים לקראת המבחן.\n\nהמבחן: \nמאתגר אך הוגן. מחולק לחלק פתוח ולחלק סגור. בחלק הסגור השאלות ברמת קושי עולה כשהקשות ביותר (2-3 שאלות) דורשות הבנה מעמיקה מאוד בחומר וקשה להצליח אותן. החלק הסגור מחולק גם לשאלות חישוביות ולשאלות הבנה אז אל תזלזלו בללמוד את התאוריה, יש 12 נקודות שהן לא \"רק להציב בנוסחה\". החלק הפתוח ברמה קלה-בינונית ומורגש שהוא קיים כדי לסייע לנו למקסם את הציון. בהמשך למוטיב מההרצאות המבחן כלל גם כמה שאלות שמקשרות בין כימיה לעולם הרפואה.\nשימו לב שמדובר בקורס חדש ואין מבחני עבר פרט למחזור שלנו, מומלץ לתרגל מבחני יסודות הכימיה (מכסה 70-80% מהחומר) ושאלות מהתרגולים על כימיה פיסיקלית (אותן טכניקות לפתרון הופיעו במבחן)\n\nהשורה התחתונה: \nקורס קשה, בתחרות עם אנטומיה על הקורס הכי קשה בסמסטר אבל לחלוטין אפשר לצלוח אותו בציון טוב עם השקעה לאורך השנה, פתרון שיעורי בית ועזרה אחד לשני במחזור. זו הפעם הראשונה שהוא עובר וכנראה היו כמה חבלי לידה שיתוקנו בעתיד. תגיעו להרצאות ולתרגולים פיזית(!), חשוב מאוד לא לזנוח אותו ולא לחכות לסוף אחרת צוברים פער שקשה להשלים", "timestamp": 1715854886399}, {"author": "nak_nik", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "לפני חוות הדעת הקלאסית, ארצה לציין לטובה את ספריו של עמנואל פאר (חלק א׳-ג׳), זהו איננו ספונסר. \nמבחינתכם זה התנ״ך החדש. ידיעת הספרים משמעותה קבלת ציון טוב בקורס. הספרים מציגים את כל סוגי השאלות האפשריים, נימוקים ופתרונות מלאים. לא היה מישהו אחד שלא רכש את הספרים.\n\nשם המרצה:  ד״ר גלית פרברי.\nחוות דעת - הרצאות: \nגלית היא בן אדם מדהים. יש לה הרבה רצון שהסטודנטים יבינו, והיא עונה על שאלות ללא הפסקה. היא דואגת לבצע שעות קבלה מרובות, ואף להישאר עם סטודנטים לאחר שעות ההרצאה כדי לענות על כל מה שלא מובן. היא מאוד רוצה להעביר את האהבה לכימיה דרך ההרצאות.\n\nההרצאות ברובן תיאורטיות, וחשוב לדעת את התיאוריה (לפחות במידה). ה-״פיסיקלית״ בשם של הקורס הוא פיקציה, שכן כמעט בכלל לא הייתה כימיה פיסיקלית (וטוב שכך, אלוהים ישמור את כולנו).\n\nעם זאת, יש ללא ספק בעייתיות. ההקלטות הן כמו פרק בכלבוטק. החומר לא פשוט, וקיים ״אפקט הגלית״ -  ניתן להבין את הרצאותיה של גלית רק לאחר שמבינים משהו מהחומר.\nלכן, מומלץ מאוד (ואף חובה) לקרוא את הנושא בספרי עמנואל פאר לפני ההרצאה, או לצפות בסרטון של \"chad's prep\" ורק אז לבוא להרצאה, כי אם לא - אז בקושי מבינים בחלק מהנושאים.\n\nשם המתרגל/ת: ד״ר נטע בן ארי\nחוות דעת - תרגולים: \nבן אדם פשוט זהב, כל תרגול יצירת מופת. \nעונה על כל שאלה, מחזיר תשובות מהירות במייל ודואג שיהיו הקלטות באיכות טובה. לא לחשוש לפנות אליו גם אחרי זמן התרגול / בשעת קבלה ולשאול כשמשהו לא מובן.\nדואג לשבץ בכל תרגול שאלות שמנסות לעבור על כמה שיותר נושאים.\n\nמומלץ להתאמן בהתחמקות מסוכריות לפני הסמסטר, כי הוא יודע לכוון ישר לעין.\n\n\nשעורי הבית: \nנדרש לפתור n-2 מהמטלות בכדי לקבל את הבונוס לציון (כ-5 נקודות). שאלות שבאות ברמות קושי שונות, ובודקות הבנה (שזה מצוין). \nפתרון של שיעורי הבית בלבד לא יבטיחו הצלחה במבחן, אבל זו חובה בשביל להיות ״על החומר״. לא כדאי לפספס אף מטלה!\nהחלק הזוועתי - אין תשובות מלאות, וכל סטודנט מקבל שיעורי בית עם נתונים שונים. לך תדע למה טעית, תשמח כשהצלחת לגרד 4 מתוך 5 שאלות, ותתפלל לקבל במטלה הבאה שאלות שלא יגרמו לך לרצות לקפוץ מקומה 2 בבניין אמדו.\n\nהמבחן: \nגלית והצוות עשו כל שביכולתם על מנת לשלב את החומר של כימיה פיסיקלית (שהיה מועט ביותר) כדי ליצור מבחן הוגן. \nהמבחן היה ארוך יתר על המידה, ובקושי הספקנו לסיים אותו.\nעם זאת, השאלות היו ברמה הוגנת, בדיוק כפי שהופיעו בתרגולים ובשיעורי הבית (ובספריו של עמנואל פאר האגדה המהלכת).\n\nהשורה התחתונה: \nהקורס הוא בר השגה!\nעמנואל פאר הוא גבר גבר.", "timestamp": 1715864785266}, {"author": "שחר דה טולדו", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  גלית פברי\nחוות דעת - הרצאות: \nהרצאות בקצב גבוה צריך להיות מרוכזים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא לפספס הם עוזרים מאוד להבנה\nשעורי הבית: \nכדאי לעשות נותן בונוס למבחן\nהמבחן: \nקשה יחסית וארוך.\nהשורה התחתונה: \nלהשקיע בקורס לאורך כל הסמסטר", "timestamp": 1716659727606}]}