{"posts": [{"author": ",", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "מעבדות שבסמסטר הזה היו 4 מעבדות (במקום 5 בסמסטר רגיל)\nמעבדות שניתן להריץ מהר מאוד. לא מעיקות וממש נחמדות (לפעמים נגמר לפני הזמן). בוחן כניסה אצלנו היה במודל שאחרי רפרוף קצר ברקע תיאורטי (אם בכלל), אפשר לגמור תוך 2 דקות. בכל מקרה יש לך שלוש ניסיונות, ככה שזה לא נורא בכלל.  \n\nשעורי הבית: דוח אחרי כל מעבדה. זה פשוט שאלות שעונים עליהם. אין חפירה מיותרת. קצר ולעניין. ציונים גבוהים\n\nהמבחן: אין\n\nהשורה התחתונה: קורס נחמד וקליל. ציונים גבוהים. לא עושים משהו מיוחד :)", "timestamp": 1598295556821}, {"author": "Yaakov L.", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nאין\nהשורה התחתונה: מרפרנסים את כל הדוחות ומקבלים ציון טוב", "timestamp": 1598347627772}, {"author": "Re", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "דוחות: דוחות עמוסים שלוקחים הרבה זמן אם מנסים לכתוב אותם לבד (ממליץ לרפרנס). לפחות במקרה שלי הבדיקה של הדוחות הייתה מאוד קפדנית ומעיקה.\n\nהמבחן: אין.\n\nהשורה התחתונה: דרישות גבוהות ביחס לקורס של חצי נק\"ז. בסופו של דבר הציונים מאוד גבוהים.", "timestamp": 1615546406820}, {"author": ":)", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "אחד הקורסים שהכי לא מייצגים את כמות הנק\"ז שהם שווים - חצי נק\"ז ושעות על גבי שעות של השקעה. בסוף רוב הציון הולך בכלל על ההתנהגות במעבדה ככה שמאוד כדאי לא לתת לדוחות יותר מידי זמן והשקעה. שעה וחצי לדו\"ח זה מעל ומעבר.", "timestamp": 1626634577368}, {"author": "עמית", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אין\nחוות דעת - הרצאות: אין \n\nשם המתרגל/ת: משתנה \nחוות דעת - תרגולים: בסמסטר שלנו היו רק 4 מעבדות כשאחת מהן הייתה ממוחשבת(לא בזום, פשוט שלחו מצגת עם הסבר המעבדה ותוצאות להתייחס אליהן). הבנתי שבסמסטר רגיל(לא קורונה) היו יותר, אבל אני לא יודע. המעבדות נחמדות אבל לא מאד מעניינות. בד\"כ לוקחות פחות זמן מהזמן המוקצב. לשים לב שהם מוציאים מהמעבדה אם נכשלים בבוחן כניסה, ואז סתם צריך לעשות השלמה.\n\nשעורי הבית: יש דף עבודה במקום דוח מעבדה. אפשר לסיים תוך שעתיים- שלוש\n\nהמבחן: אין\n\nהשורה התחתונה:", "timestamp": 1626932452656}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המתרגל/ת:  גל\nחוות דעת - תרגולים: מעניינים סה\"כ. לא קשה בכלל.\n\nשעורי הבית: ארוכים ולא מאחוז תואמים למה שנעשה במעבדה. לא ברור בכלל מה רוצים חצי מהזמן. \n\nמבחן: יש בוחן כניסה לכל מעבדה. חייבים לעבור. צריכים להתכונן מראש, אבל מי שהצליח להבין על מה יהיה הבוחן והתכונן עובר. \n\nהשורה התחתונה: קורס שהוא בזבוז זמן מוחלט. לא לומדים שום דבר חדש. כיף לשחק במעבדה אבל.", "timestamp": 1626937157764}, {"author": "לירון לובל", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: פאטמה\nחוות דעת - תרגולים: כפרה עלייה \n\nשעורי הבית: מרפרנסים\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מיותר\nכפרה על פאטמה", "timestamp": 1627294430570}, {"author": "an", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אחד הקורסים הכי משעממים ולא מוסיפים דבר או מידע", "timestamp": 1629039402819}, {"author": "---", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מוחמד\nחוות דעת - הרצאות: ממש נחמד!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס פשוט, דוחות קלילים יחסית", "timestamp": 1629117417640}, {"author": "ג", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "הדוחות דורשים קצת זמן לעבודה אבל הם לא קשים ועם קצת מחקר ורפרנסים קל להוציא ציון גבוה.\n\nהמעבדות עצמן נחמדות מאוד אם אתם מתעניינים בכימיה.", "timestamp": 1634645371349}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "קצת על הקורס:\nיש סה\"כ 4 מעבדות אחת לחודש בערך(תלוי אם סמסטר אביב או חורף). לפני כל מעבדה צריך ללמוד את החומר התיאורטי ואת המהלך של המעבדה. המעבדות די שטויות והן מורכבות מניסויים כמותיים שממש מודדים דברים ומתצפיות שרק רושמים מה שהמדריכה עושה. תשתדלו למצוא פרטנרים שאתם סומכים עליהם לפני כי המעבדה בזוגות.\n המתרגל/ת: איריס אגמי\nתרגולים: \nאחלה מדריכה סה\"כ. לרוב מסיימים איתה לפני הזמן כי היא מאוד יעילה. \nשעורי הבית: \nיש דוחות מעבדה לעשות, אפשר לרפרנס בקלות. יחסית קשה לקבל 100 אבל רוב הציונים הם מעל 90.\n\n\nהשורה התחתונה: \nקורס מיותר אבל לא מזיק.", "timestamp": 1657460267139}, {"author": "~", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: Gabriele Halevi\nחוות דעת - הרצאות: Gabriele was rude to us the whole semester with very little reason for being so. For a course only 0.5 credits, she takes her job wayyy too seriously and is super harsh with the students.\n\nשם המדריכה: Anastasia Behar\nחוות דעת: Ana was a super nice lab instructor, it's sad that her time is wasted on a pitiful course like this one.\n\nדוחות: There are 4 lab reports total. Super easy to reference, required minimal effort for good grades. \n\nבחנים: The entrance quizzes for the labs are quite challenging and very stressful. If you don't pass them you're not allowed to do the lab, and if you fail too many of them they kick you out of the course. Doesn't even seem like an effective way to help us learn the material.\n\nהשורה התחתונה: Why do we have to take this course???? Avoid if you can. Really just a waste of time.", "timestamp": 1657554424705}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "ראו הוזהרתם: הדבר הכי קשה בקורס הזה אלו בחני הכניסה אל המעבדות. מותר להיכשל רק פעם אחת, ואי אפשר לדעת על איזה מדריך מעבדה תיפלו ואם הוא אוהב להכשיל או לא. השאלות לא קשורות תמיד לחומר וקצת הזויות. \nהעצה הכי טובה שיש לי לתת היא שתיקחו את המעבדות המאוחרות יותר, ככה שמי שעשה את המעבדה שבוע לפניכם יוכל לספר לכם איזה שאלות שאלו בבוחן.", "timestamp": 1657616109484}, {"author": "mip", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: יכולים לקחת המון זמן וחבל! הקורס בסהכ 0.5 נקז. \nמומלץ לסיים עם כתיבת הדוח ביום של המעבדה ולא לדחות את זה!\n(להיעזר בדוחות בדרייב שלא יורידו לכם על שטויות)\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1658762823672}, {"author": "L", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "זה מעבדות מעייפות וארוכות שיש בהן בוחני כניסה נוראיים, דוחות מעבדה דורשים השקעה\nהשורה התחתונה: היה די מעניין במעבדה עצמה(חלק של ניסויים)", "timestamp": 1659110271724}, {"author": "גיא וילקומירסקי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המדריך: מיכאל\nחוות דעת - תרגולים: אחלה גבר, מעביר את המעבדות בצורה ממש מעניינת ואפילו כיפית. רואים שיש לו אהבה לתחום. \n\nשעורי הבית: הדוחות מייגעים ומעצבנים. מזל שיש רפרנסים טובים.\n\nהמבחן: בתחילת כל מעבדה יש בוחן כניסה קטן שהוא די קליל אם באמת קראת את החומר לפני ואת שאלות ההכנה/פתרת בחנים מחברים שעשו.\n\nהשורה התחתונה: חשוב מאוד מאוד לבחור בן/בת זוג טובים לעבוד איתם גם תוך כדי וגם בשביל הדוחות שמכינים אחרי. רצוי מראש לקבוע עם חבר שמכירים ושסומכים עליו. חשוב לבוא מוכנים ולא שוקיסטים למעבדה כדי שלא תפלו בבוחן כניסה.\nכל מעבדה מתפרשת על שבועיים של תאריכים בהם אפשר להגיע למעבדה, ממליץ להגיע לאלה שבשבוע השני כי עד אז כבר תוכלו לשאול חברים מה היה בבוחן.", "timestamp": 1665138959035}, {"author": "לא משנה", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "קורס של חצי נקודה ומשגעים אותנו כדי להשיג אותה", "timestamp": 1689339956584}, {"author": "A", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המדריך: לא זוכרת \nחוות דעת - מעבדות: 3 חלקים למעבדה:\n1. בוחן כניסה - לרפרנס. תנסו למצוא בדרייבים רפרנסים אין טעם ללמוד אליו איזה שעה, חוץ מזה שהבחנים בדיחה בפני עצמם.\n2. מעבדה- יש 4 מעבדות שעושים בזוגות, במשך 3 שעות שבהם עושים די שטויות, קליל.\n3. דוח- לרפרנס\n\nהמבחן: אין\n\nהשורה התחתונה: חצי נקז לא להתרגש יותר מידי", "timestamp": 1689808921384}, {"author": "Hanoch Egyes", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n.\nשעורי הבית: \n דוחות המעבדה חופרים, להשתמש ברפרנסים ו chat gpt \nהמבחן: \nצריך להתכונן לבחנים\nהשורה התחתונה:", "timestamp": 1692083876073}, {"author": "Tim Manor", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אין\nחוות דעת - הרצאות: \nאין\nשם המדריך/ה: ניקול\nחוות דעת - מעבדות: \nניקול אחלה של מדריכה, עוזרת ומסבירה מעולה, משרה אווירה טובה במעבדה.\nדו\"ח מעבדה: \nחופר ולפעמים לא בהכרח קשור למה שעשיתם במעבדה עצמה, ממליץ לשבת על הדו\"ח ממש אחרי המעבדה איזה שעתיים וסיימתם.\nהמבחן: \nיש מבחן כניסה לכל מעבדה, בדרך כלל המבחנים עוברים בקבוצות וואטסאפ אז מתכוננים לפי זה. אבל לפעמים שואלים על דברים שלא לימדו בכימיה כללית. \nהשורה התחתונה: \nלא הרגשתי שלמדתי הרבה מהמעבדה והדו\"ח די מעצבן לעשות.\nלטעמי, אם אתם לא חייבים אל תעשו אותה.", "timestamp": 1704703966170}, {"author": "ויקטוריה", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ענבל \nחוות דעת - הרצאות: מעבירה את המעבדות בצורה טובה, לא מחפשת וגם היא רואה שעובדים טוב במעבדה אז מקבלים ציון טוב על המעבדה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: תלוי מי בודק את הדו״ח אבל אם לעשות דו״ח מפורט כמו שצריך אז ציון גבוה\n\nהמבחן: אין מבחן \nיש בוחן כניסה לפני כל מעבדה ואפשר להיכשל רק באחד ואז זה גם מוריד משמעותית את הציון, חשוב לעבור על הפרוטוקול לפני המעבדה ולהיזכר טוב טוב מה היה בכימיה  \n\nהשורה התחתונה: יש לשמור על החלוקים \nאת הדוח עושים בזוגות \nמומלץ להשתמש בשעות קבלה כדי להבין ולא ליפול על שטויות", "timestamp": 1704732337102}]}