{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: מוריס מאוד משתדל אבל נראה שבזום פחות מוצלח, מעט מהיר ומבולגן.\n\nשם המתרגל/ת: עימאד\nחוות דעת - תרגולים: עימאד מתרגל פדוט מדהים עושה הרבה סדר \n\nשעורי הבית: קשים ודורשים חשיבה רבה\n\nהמבחן: קשה \n\nהשורה התחתונה:קורס חובה אחד המסובכים בפקולטה בכימיה, צריך להשקיע המון במהלך הסמסטר ובמיוחד לקראת המבחן. ממליץ ללכת להרבה שעות קבלה במיוחד של עימאד ולהיות \"על זה\" עוד במהלך הסמסטר", "timestamp": 1608648802923}, {"author": "Mohammad A'.A'zab", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "שם המרצה: מוריס אייזן\nחוות דעת - הרצאות:  בסמסטר קורונה ראשון, הוא היה המרצה היחיד. הם העלו סרטונים קצרים שלו במודל, והוא גם עשה הרצאות בזום. ההרצאות הרגילות יותר טובות כי הן פחות עמוסות ויותר אנושיות.\n\nשם המתרגל/ת: עימאד עיד\nחוות דעת - תרגולים: טוב מאוד, מסודר. התרגולים היו במצגות דרך הזום, ממש ברור ומסודר. עימאד מתרגל ממש טוב בכללי.\n\nשעורי הבית: 5 או 6 בסמסטר, פתוחים, צריך להדפיס אותם, לפתור ואז לסרוק ולעלות למודל. לא קלים בדרך כלל, ומהווים הכנה טובה לבחינה.\n\nהמבחן: הסמסטר שלנו היה בתבנית אחרת לגמרי, רוב רובו אמריקאי, ושתי שאלות פתוחות. באופן כללי המבחן לא קל, אבל תסדרו טוב טוב את החומר בראש, ותפתרו שאלות קשות כמו שאלות סינתזה ושאלות פאזל, כך יכולים להבטיח ציון טוב בקורס.\n\nהשורה התחתונה: אין ספק שהוא קורס מאתגר, ומצריך הרבה דברים: לזכור, להבין, ולנתח. אבל בסופו של דבר זה לא אינפי, אפשר להגיע לציון טוב בקורס. בסמסטר שלנו נתנו לנו חומר פתוח בבחינה כהקלה, וזה באמת מקל כי החומר גדול. גם אם אתם צריכים לזכור הכל זה לא סוף העולם בכלל. למישהו שלומד מדמ\"ח לא הייתי ממליץ לקחת את הקורס, למרות שהוא חשוב, אבל זה עדיין מאתגר, אלא אם כן אין לכם בעיה בשינון.", "timestamp": 1616507020939}, {"author": ".", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ד\"ר גלית פרברי\nחוות דעת - הרצאות: מרצה שנהנת ממה שהיא מלמדת וזה מאוד מורגש. היא רצה על החומר במהירות ולא עוצרת לנשום לרגע, מכניסה תוך כדי הרבה סיפורים מהמעבדה בנושא ומרחיבה עם העשרות בנושאים שונים. קשוח לעקוב אחריה כל ההרצאה אבל בהחלט מהנה למי שמצליח.\n\nשם המתרגל/ת: עימאד עיד\nחוות דעת - תרגולים: המתרגל הכי טוב בפקולטה לכימיה (גם ביסודות). תמיד נעים להגיע לתרגול, תמיד עונה על שאלות ברמה גבוהה.\n\nשעורי הבית:  קשוחים, דורשים הרבה אבל מאוד מאוד מלמדים. אי אפשר לעבור את הקורס בלי לעשות אותם.\n\nהמבחן: יש הרבה מה ללמוד וזה מאוד קשוח, אם אבל עוברים עלהתיאוריה היטב ומתרגלים הרבה הוא מאוד הוגן.\n\nהשורה התחתונה: בי הקורסים הקשים שלקחתי את הסמסטר, אבל מאוד מעניין וחשוב.  סגל קורס מעולה.", "timestamp": 1627543956615}, {"author": "איתמר זייד", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: קצב מהיר מאוד אבל סה\"כ מרצה טובה שמסבירה טוב את החומר\nשם המתרגל/ת:  אנתוני כהן\nחוות דעת - תרגולים: \nהתרגולים היו בקצב טו ומפורטים\nשעורי הבית: \nקשים\nהמבחן: \nיחסית לא קשה\nהשורה התחתונה: קורס עמוס מאוד ולא קל, אבל אפשר להצליח בו", "timestamp": 1631170055843}, {"author": "Dvir Bnei-Dereh", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: גלית \nחוות דעת - הרצאות:  מדהימה. אצלךנו עשתה את זה עם קול מתושתש אבל אין ספק שהיא בכל זאת הייתה נפלאה. היא נגשת לזה בתור חוקרת ולא נותנת לנו לשנן סתם.", "timestamp": 1634489418632}, {"author": "ליאור", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: \nגלית מרצה טובה מאוד ואכפתית וזמינה לשעות קבלה כל הזמן. \nאבל הסמסטר הרגיש שאין דרך טובה ונוחה להעביר את החומר. \nחלק מן החומר הועבר בעלפה וחלק בכתב וחלק במצגות. \n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: מתרגל מאוד טוב, עונה על שאלות וזמין לשאלות גם מעבר לתרגולים. \n\nשעורי הבית: \nלא חובה\nהמבחן: \nלדעתי היה קצת קשוח, בעיקר בעובדה שיש המון מנגנוני תגובה וצריך להכיר אותם. \n\nהשורה התחתונה: ללמוד במהלך הסמסטר ולתרגל המון מבחנים לדעתי יכולים לסייע במבחן ובהצלחה של הקורס.", "timestamp": 1658941743788}, {"author": "EK", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מרצה מעולה, מסבירה לעומק. יתרון וחיסרון עונה על כל שאלה של הסטודנטים.\n\nשם המתרגל/ת: יאיר\nחוות דעת - תרגולים: המתרגל הכי מקצועי שיש. בעל ידע רב בכימייה אורגנית. נותן יחס מעולה לסטודנטים.\n\nשעורי הבית: טובים מאוד לתרגול החומר\n\nהמבחן: הוגן, על החומר הנלמד\n\nהשורה התחתונה: צריך להשקיע, אבל בסוף אפשר להצליח!", "timestamp": 1659298297896}, {"author": "T", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גלית \nחוות דעת - הרצאות: רצה מהר מאוד על החומר כי יש כל כך הרבה להספיק. מדברת מאוד מהר ויש לה מלא אנרגיות.\n\nשם המתרגל/ת: עימאד\nחוות דעת - תרגולים: מתרגל מדהים, עונה על כל שאלה, מסביר טוב ועוזר להבין את החומר לעומק.\n\nשעורי הבית: לא היו חובה, ברמה מאוד מאוד גבוהה שלא קשורים בכלל למה שעושים בתרגולים. אני לא עשיתי ובגלל זה היה לי פער מטורף בחומר.\n\nהמבחן: ממליצה מאוד לראות את הסרטונים בקמפוס של מוריס, עזר לי מאוד לקראת המבחן להבין את החומר. המבחן היה הוגן, לא קשה מדי ולא קל מדי.\n\nהשורה התחתונה: חשוב להשקיע במהלך הסמסטר בהבנה של החומר אם לא רוצים לחרוש שבוע לפני המבחן", "timestamp": 1661423844075}, {"author": "...", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מרצה מצוינת! מסבירה מצוין את החומר ואכפתית בצורה יוצאת דופן (קובעת שעות קבלה מתי שנוח לסטודנטים, אפילו עשתה מאמצים להעביר אותנו לאולם הרצאה במיקום נוח בקמפוס - ממש לא מובן מאליו). תמיד אומרים עליה שהיא מרצה קצת מבולגנת אז חששתי מזה לפני שהתחלתי ללמוד אצלה, אבל ממש לא הרגיש לי ככה במהלך הסמסטר (היא גם אמרה לנו בתחילת הסמסטר שהיא מאוד תשתדל ללמד בצורה מסודרת - היא מודעת לזה שזאת בעיה אצלה).\n\nשם המתרגל/ת: יאיר\nחוות דעת - תרגולים: בכללי חשוב להגיד שצוות המתרגלים של הקורס מצוין (אנתוני, עימאד ויאיר) - לא משנה למי אתם הולכים, תקבלו מתרגל מצוין. התרגולים ממש חשובים להבנה של החומר. אסור לוותר בשום פנים ואופן. ברוב התרגולים לא מספיקים לעבור על כל התרגילים (זה קורס עם המוןןן חומר). אם יש זמן ממש מומלץ לפתור את שאר התרגילים מהתרגול כדי לתרגל את החומר יותר טוב. \n\nשעורי הבית: קיבלנו 6 גיליונות הגשה במהלך הסמסטר ברמת קושי גבוהה, שהיו רשות (אין עליהם ציון תקף או מגן). מאוד מאוד מומלץ לעשות אותם. זאת הצורה הכי טובה לתרגל את החומר תוך כדי הסמסטר. המתרגלים בודקים את הגיליונות, ממשבים אותם ונותנים ציון (שכאמור אין לו השפעה על הציון בקורס). זאת הדרך שלכם לראות שבאמת הבנתם את החומר - לא לוותר על ההזדמנות הזאת! (למרות שזאת השקעה של כמה שעות טובות בכל גיליון)\n\nהמבחן: 100% מציון הקורס, אז די מפחיד. מבחן לא קל, אבל אפשר להשיג בו ציונים טובים. אצלנו הייתה גם שאלת בונוס של 10 נקודות שזה נחמד.\nזה מבחן שחייבים לקחת ברצינות וללמוד אליו בצורה מסודרת והרבה זמן מראש (חזרה על כל ההרצאות, פיתרון מחדש של כל התרגולים, של כל גיליונות שיעורי הבית ושל כמה מבחני עבר)\n\nהשורה התחתונה: לא סתם יש לכימיה אורגנית שם של קורס קשה. יש בו המון המון חומר והוא לא כזה פשוט להבנה. אם אתם שוקלים אותו כקורס בחירה, לא מומלץ. אם זה קורס חובה - תיקחו אותו ברצינות ותשתדלו להינות ממנו, כי בסופו של דבר החומר של הקורס די מעניין ומאוד רלוונטי לפקולטות שהקורס הזה חובה בשבילם.", "timestamp": 1662364254966}, {"author": "סטודנט להנדסה", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: אני חושב שגלית מרצה מאוד קשה לסטודנט הממוצע שפחות מבין את החומר. היא אומרת הרבה מאוד מידע בקצב מאוד מהיר שלא ברור מה טפל בו ומה עיקר ועונה על שאלות לא חשובות של סטודנטים. רוב חוות הדעת פה טובות אבל אני מאמין שאני מייצג קבוצה מאוד גדולה שחושבת כמוני. באופן כללי צוות הקורס לא מאורגן במיוחד ולא תורם להצלחת הסטודנטים.\n\nשם המתרגל/ת: עימאד\nחוות דעת - תרגולים: עימאד הוא נקודת האור בצוות הקורס. מדבר בגובה עיניים, עונה על השאלות וזמין תמיד גם במייל וגם לשעות קבלה.\n\nשעורי הבית: שיעורי הבית הראשונים יחסית סבירים. האחרונים ברמה של המבחן. לא חובה לעשות אותם אבל מומלץ ברמה של חובה.\n\nהמבחן: המבחנים קשים למי שלא יודע כלום והוגנים למי שיודע את החומר, לכן גם לפתור מבחנים לא יעזור, ידיעת החומר הכרחית.\n\nהשורה התחתונה: הקורס מאוד קשה ולכן בשביל להצליח במועד א' צריך להשקיע בו את מרב המאמצים לאורך הסמסטר ולהיות \"על זה\". אבל אם נכשלתם במועד א' אז אל תתחילו ללמוד שבועיים לפני המבחן, תשקיעו כל הקיץ וזה יהיה שווה את הציון הסופי. באופן כללי לא להתייאש, הבנת החומר דורשת זמן ובסוף הוא שוקע, כל אחד בקצב שלו.", "timestamp": 1665149698295}, {"author": "-הלוגן רדיקלי", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: הקלטות של מוריס אייזן\nחוות דעת - הרצאות: ניסיתי ללכת לגלית במהלך הסמסטר, היה לי קשה לעקוב אחריה בגלל הבלאגן שבו היא מרצה. המרצה השני, אשרף, העביר בצורה יותר ברורה ופשוטה.\nבשורה התחתונה לא למדתי את החומר כמו שצריך בסמסטר, לכן עשיתי מההתחלה ועד הסוף את הקורס המקוון באתר קמפוס של פרופ' אייזן (לינק: https://campus.gov.il/course/course-v1iitacd-iit-orgchem125/)\nהחומר תואם כמעט אחד לאחד (זה הקורס של החורף), ההסברים קצרים וברורים לרוב, התרגול העצמי באתר מיידי.\nלדעתי, מומלץ- גם אם נעזרים בו רק בחלק מהחומר שלא מבינים.\n\nהמבחן: למבחן עצמו שווה לעבור ולפתור לבד את כל התרגולים ושיעורי הבית. רק אחר כך לעבור למבחנים- ההבנה של החומר הכרחית להצלחה, זה קורס תיאורטי ולא טכני. \nהמבחנים הוגנים \n\nהשורה התחתונה: האינטואיציה שמקבלים בקורס חשובה למי שלומד כל דבר שקשור לביולוגיה.\nלמי שמתלבט אם לקחת אורגנית כקורס בחירה- \n א. הקורס 5 נק\"ז לא סתם, זה קורס כבד ואין טריקים שחוסכים בזמן ובעצבים שהוא שואב.\nב. יש וריאציה קלה יותר של הקורס שמתאימה יותר למהנדסים שאינם מתחום הכימיה והביולוגיה.", "timestamp": 1666089972414}, {"author": "הבמ", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: מרצה נהדרת, היו הרבה שאלות שעיקבו את ההרצאה\n\nשם המתרגל/ת: יאיר כהן\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: לא מספיק, אלה שיש ללא ציון אך קשים\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס מעניין, הרבה חומר, קשה", "timestamp": 1666287113159}, {"author": "Shira Hanuka", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מדהימה! מרצה שפשוט כיף ללמוד ממנה- רואים שהיא אוהבת את המקצוע שלה וזה נותן המון דרייב ללמוד להצליח. מסבירה מעולה ומשקיעה המון זמן בסטודנטים, גם מעבר לשעות ההרצאה ושעות הקבלה. מעט מהירה אך מודעת לזה- ברגע שתאמרו לה היא תשים לב ותאט.\n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: מתרגל מעולה- מסודר וענייני, מאתגר את הכיתה לעיתים בשאלות שבודקות שהבנו את החומר. מעט מהיר, אך היתרונות עולים על כך\nממליצה להגיע עם קובץ התרגול מהמודל כך שלא תצטרכו להתעסק בהעתקות מהלוח\n\nשעורי הבית: קשים, מאתגרים, לא פשוטים. חובה לעשות אותם! אפילו שהם לא חובה- אל תתפתו לא להגיש. הגשת שיעורי הבית ופתירה שלהם לבד- מפתח להצלחה.\n\nהמבחן: הוגן לחלוטין. בלמידה למבחן ממליצה לעבור קודם על התרגולים, לאחר מכן לפתור מחדש את עבודות הבית ולבסוף לפתור מבחנים. חשוב מאוד להגיע להבנה עמוקה של החומר\n\nהשורה התחתונה: לא סתם יש לאורגנית שם של קורס קשה. הוא עמוס, דורש הבנה עמוקה ולא טכני בכלל. עם זאת- אפשרי לגמרי להוציא ציון טוב ואפילו להנות מהקורס. חשוב ללמוד לעומק ולתת לחומר לשקוע. בהצלחה!!", "timestamp": 1666902452426}, {"author": "Maya Sharon", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: אינטנסיבי- אבל שווה את זה. מי שמסוגל לרשום או להקליד מהר את מה שהיא אומרת רק ירוויח. גלית מרצה מדהימה, הכי טובה שפגשתי בטכניון, אכפתית וקובעת שעות קבלה לכל מי שמעוניין בכל זמן פנוי שיש לה \n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: מתרגל מעולה! קצת מהיר אבל עונה על כל שאלה באופן מפורט.\n\nשעורי הבית: לא מוסיפים מגן לציון אבל משמעותיים להבנת החומר\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קורס קשה אבל בשבילי היה מאוג מעניין, מי שנשאר בעניינים יכול להרוויח הרבה", "timestamp": 1689664142215}, {"author": "SN1", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: גלית מרצה מדהימה, וכמו כל בן אדם יש לה חסרונות - היא מעט מבולגנת והיא מאד מהירה. אבל כשלומדים להסתדר עם זה מרוויחים מרצה מעולה, שמסבירה את החומר בצורה סופר ברורה וממש עושה הכל למען הסטודנטים. ההשקעה שלה בשאלות לפני / תוך כדי / אחרי השיעור, שעות קבלה זה פשוט משהו שחבל לא לנצל, היא באמת עושה את זה מהלב ואני לא חושב שיש בטכניון מרצה כל כך אכפתי כמוה. הייתי מגיע בכיף להרצאות.\n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: אנטוני מתרגל מעולה. מאד מסודר, יודע בדיוק מה להגיד ואיך להסביר, נתן דגשים חשובים במהלך הסמסטר. ממליץ ללכת אליו. בשיעור חזרה לקראת המבחן הלכתי לרומי שהייתה פחות טובה ממנו בעיני, כן ממליץ ללכת אליו אם יש לכם אפשרות. חסרון - קצת מהיר. \n\nשעורי הבית: 5 גיליונות, קשים, כבדים, דורשים הבנה עמוקה של החומר. מה שכן, מאד עוזרים לקראת המבחן. ממליץ מאד לא לוותר עליהם כי תכלס זה הדרך היחידה ללמוד את החומר ולהפנים אותו במהלך הסמסטר.\n\nהמבחן: מי שתרגל לקראת המבחן, והיה \"על\" במהלך הסמסטר יכול להוציא ציון סבבה, למרות השם הקשה שיצא לקורס הזה. \n\nהשורה התחתונה: מאד מאד חשוב להיות \"על\", אסור להכחיש את הקורס הזה בשום שלב, כי אחרת פשוט הולכים לאיבוד - הקורס בנוי כמו מגדל קלפים. כשאין בסיס לא מבינים מה קורה הלאה. מי שזה קורס חובה עבורו אז לפחות שינסה להנות מזה שהחומר עצמו די מעניין, אבל כבחירה לא הייתי עושה את הדבר הזה לעצמי ולוקח אותו (לא סתם זה קורס של 5 נק\"ז).", "timestamp": 1690866801992}, {"author": "דבורית", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: גלית בן אדם מדהים, היא תעזור כמה שצריך. גלית מדברת נורא מהר, אחרי השעה הראשונה מאוד קל לאבד אותה, הלוח מאוד מבולגן אבל אפשר להבין מה הולך בו אם מקשיבים היטב. \n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: מתרגל טוב אין תלונות.\n\nשעורי הבית: לא חובה, מומלץ להגיש למרות שהאחרונים מאוד מאתגרים.\n\nהמבחן: המבחן לא היה פשוט, אך פייר. המבחן היה שעתיים וחצי ולא שלוש מסיבה בלתי ברורה. מי שלחוץ בזמן במבחנים זה יכול להיות בעיה. \n\nהשורה התחתונה:", "timestamp": 1691753364092}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אשרף\n\nחוות דעת - הרצאות: \nאם יש אפשרות- תלכו לגלית. אשרף מאוד נחמד אבל הוא מדבר הרבה באוויר בלי לעשות דוגמאות, מה שמאוד מקשה על ההבנה. אצלינו התבטלו המון הרצאות ולא הושלמה אפילו הרצאה אחת ככה שכל החומר הועבר בצורה מאוד מהירה ועל רגל אחת.\n\nשם המתרגל/ת: \nאנטוני\n\nחוות דעת - תרגולים: \nמעולה!! מסביר טוב, מסודר, עונה על שאלות. קצת מהיר אבל שווה את זה.\n\nשעורי הבית: \nרובם קשים אבל כדאי לעשות אותם. ההגשה לא חובה אבל כדאי לעשות בככל זאת כי הרבה מהשאלות ברמת מבחן. הבדיקה לקחה המון זמן (לפעמים מעל חודש) ככה שאני ממליצה להגיש ולהשוות עם הפתרון ולא לחכות לבדיקה.\n\nהמבחן: \nקשה\n\nהשורה התחתונה: \nאחד הקורסים היותר קשים שיש. המון חומר, דרושה הבנה ברמה גבוהה ויש הרבה פרטים שצריך לזכור. כדאי ללמוד כל הסמסטר כי להשלים את הקורס הזה לבד זה מאוד קשה.", "timestamp": 1693666721559}, {"author": "מיפ", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אשרף בריק\nחוות דעת - הרצאות: אחלה מרצה, מסביר מאד מסודר, ונותן זמן לשאלות (אבל לא הרבה)\n\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: מתרגל ממש טוב, התירגולים עזרו להבין את החומר בצורה הכי טובה. נותן זמן לשאול שאלות ועושה מין סיכום כזה ברבע שעה הראשונה של התירגול\n\nשעורי הבית: לא חובה, אני עשיתי והם עזרו לתרגל את החומר אבל לא קיבלנו עליהם כל כך פידבק (חוץ מאשר כשאנטוני בדק)\n\nהמבחן: קשה, אבל די הוגן. צריך ללמוד אליו 4-5 ימים לפחות. ממליצה לסכם את כל המנגונים ואז להתחיל מבחנים (ולאט לאט פחות להשתמש בסיכום)\n\nהשורה התחתונה: קורס מאתגר אבל סופר מעניין ומלמד קצת כמו לפתור סודוקו ברמה קשה מאד (פיזיקאים שבא להם להרחיב כן אפשרי אבל דורש השקעה)", "timestamp": 1705058560992}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גלית פרברי\nחוות דעת - הרצאות: מרצה טובה, קצת מהירה צריך להיות בקשב. מאוד אכפת לה מהסטודנטים ומההבנה שלהם וזה חשוב.\n\nשם המתרגל/ת: תאמר סעאידה\nחוות דעת - תרגולים: מתבלבל הרבה ולא תמיד ברור בהסברים שלו.\n\nשעורי הבית: אין חובת הגשה אבל תעשו לעצמכם טובה ותגישו, אם לא מתרגלים במהלך הסמסטר לא עוברים את המבחן!\n\nהמבחן: קשה, דורש הבנה עמוקה של הדברים ולזכור מלא מנגנונים, 5 שאלות פתוחות ויש דף נוסחאות אבל הוא מאוד מצומצם אז צריך לזכור הרבה נקודות חשובות ולא להסתמך עליו. \n\nהשורה התחתונה: קורס קשה ברמות, למי שהוא חובה בהצלחה, למי שלא חובה תתרחקו.", "timestamp": 1715628422496}]}