{"posts": [{"author": ",", "difficultyRank": 3, "generalRank": 2, "semester": "201901", "text": "שם המרצה: נדב אמדורסקי\nחוות דעת - הרצאות: מסביר טוב אבל צריך להיות בפוקוס ולא לאבד. קל מאוד לאבד אותו. \n\nחוות דעת - תרגולים: אם לא באים להרצאות, מומלץ. אם באים להרצאות ושולטים בחומר מהתיכון אפשר להסתדר על ידי קריאה של קבצי התרגולים. אבל בסך הכול מומלץ ללכת לתרגולים מאשר ההרצאות כי שם פותרים תכלס תרגילים. \n\nשעורי הבית: גיליונות במודל תקף. 11/13 חלקם קלילים ולוקחים דקות. חלקם ארוכים ומייגעים שאתה נופל על יחידות ואתה לא מבין איפה אתה טועה, יכול לגרום לשבת על השיעורים שעות. \n\nהמבחן: 20 שאלות אמריקאיות. מפילים על יחידות, חלוקה בשתיים ועוד שטויות. להיות חד במבחן, אחרי זה מאבדים מלא נקודות על כלום, וחבל. \nהשורה התחתונה: קורס שדורש הבנה  (יש שאלות תיאורטיות במבחן- כל מיני דברים מההרצאות) והרבה תירגול של מבחנים. +ריכוז שיא במהלך המבחן.", "timestamp": 1598297240113}, {"author": "Yaakov L.", "difficultyRank": 3, "generalRank": 3, "semester": "201901", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה, יודע להעביר את החומר בצורה מעניינת ומובנת\n\nשם המתרגל/ת: מורן גבע\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה את החומר מעולה\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347051786}, {"author": "לידור אוסמו", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: ההרצאות מועברות בצורה טובה (בזום), שי מסביר ודואג לענות על שאלות ומחדד הבנה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: גיליון פעם בשבוע. חלק מהגיליונות מאתגרים ודורשים השקעה של כמה שעות טובות.\n\nהמבחן: אמריקאי, לא פשוט בכלל.\n\nהשורה התחתונה: צריך לאהוב את הנושא כדי להתחבר. למי שמגיע עם רקע מהתיכון החומר יזרום יותר במהלך הסמסטר.", "timestamp": 1598354160593}, {"author": "Maor Kovler", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: שי מלמצן\nחוות דעת - הרצאות:  הרצאות מעניינות מאוד רק חבל שכל שבוע לומדים נושא שלם בכימיה\n\nשם המתרגל/ת: אסתי ריטוב\nחוות דעת - תרגולים: מתרגלת מעולה ובעלת סבלנות רבה  \n\nשעורי הבית: יש כמה שיעורי בית קשים שלוקחים המון זמן \n\nהמבחן: בסדר\n\nהשורה התחתונה: קורס עמוס אבל אפשר לעבור (אפשר ללמוד את כל החומר בתקופת מבחנים)", "timestamp": 1613546101903}, {"author": "נ.א.", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: מומלץ \n\nשם המתרגל/ת: טארק טרביה\nחוות דעת - תרגולים: מומלץ \n\nשעורי הבית: לוקחים זמן אבל הרמה סבירה ומאוד מאוד מאוווד מומלץ לפתור לבד. הקורס מחולק ל13 נושאים ובסוף כל שבוע יש תרגיל בית על הנושא של השבוע. \n\nהמבחן: לא קל ולא קשה, צריך להבין את החומר כדי לפתור אותו\n\nהשורה התחתונה: קורס מאוד מעניין, אם תשקיע במהלך הסמסטר, יהיה נוח ללמוד למבחן ולקבל ציון טוב.", "timestamp": 1613745812445}, {"author": "עמית", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה! מעביר את החומר בצורה מעניינת וקלילה.\n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מתרגל מאוד מוצלח. משקיע מאוד בסטודנטים וסבלני לשאלות תמיד. \n\nשעורי הבית: מבחינת עומס קלילים מאוד. \n\nהמבחן: לא קשה.\n\nהשורה התחתונה: קורס מעניין וקליל.", "timestamp": 1613986371147}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה:  אמנון שטנגר\nחוות דעת - הרצאות:  קצרות וענייניות\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: משעממים\n\nשעורי הבית: לפעמים קשים יותר ולפעמים פחות, תרגול חשוב שגם די מייצג את המבחן\n\nהמבחן: לא קל בכלל, מומלץ ללכת לתרגול של מיקו לפני \n\nהשורה התחתונה: קורס מעיק", "timestamp": 1614683745433}, {"author": "אייל מעוז", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שי מלצמן\n\nחוות דעת - הרצאות: \nשי מרצה נהדר. ברור מאוד, נחמד, קשוב. מעביר את ההרצאות בצורה אינטראקטיבית וכיפית. תענוג ללמוד איתו!\n\nשם המתרגל/ת: אנה יוחנובסקי\n\nחוות דעת - תרגולים: \nאנה מתוקה! כל כך הרבה תשוקה למקצוע, זה גורם לרצות ללמוד כימיה למרות שזה אחד המקצועות השנואים עליי. מומלצת ביותר!\n\nשעורי הבית:\nבמודל. חלקם קלילים ממש, וחלקם קשים בטירוף. כדאי לנסות לתרגל את החומר בתרגולים, כי זה מאוד עוזר להבין את החומר. לא רק לשבת להקשיב\n\nהמבחן:\nקשה! היה קצת דברים שהייתי אומר שהם לא הוגנים.\n\nהשורה התחתונה: \nקורס עמוס הרבה יותר מדי, והחומר מועבר קצת \"על רגל אחת\". חבל שלא פורשים את הקורס ליותר מסמסטר.", "timestamp": 1615127228112}, {"author": "מיכל", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: הרצאות מעולות! שי מרצה ממש טוב, מסביר בצורה מעניינת מאוד.\n\nשם המתרגל/ת: אנה יוחנובסקי\nחוות דעת - תרגולים: אנה עשתה המווון סדר בתרגולים, עד שלא מגיעים לתרגול קשה להגיד שמבינים את החומר. מתרגלת מדהימה. תרגולים חובה כדי להבין על מה לעזאזל דיברו איתנו בהרצאה\n\nשעורי הבית: לרוב היו סבירים\n\nהמבחן: הוגן מאוד, צריך לתרגל ולהבין את החומר וזה מספיק\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1615576129604}, {"author": "א.ק.", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אמנון שטנגר בהרצאות מוקלטות\nחוות דעת - הרצאות: סמסטר קורונה - הייתה כיתה הפוכה. ראיתי את ההרצאות ולא הלכתי לשעת קבלה שלו. מסביר טוב, אבל יש את החסרונות של הרצאות מוקלטות כמובן.\n\nשם המתרגל/ת: עידן אביגדורי\nחוות דעת - תרגולים: בסדר גמור\n\nשעורי הבית: ש\"ב פעם בשבוע, רובם בסדר גמור\n\nהמבחן: המבחן היה הוגן\n\nהשורה התחתונה:", "timestamp": 1615992961778}, {"author": "עמית", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה. מסביר את החומר בצורה מובנת מאוד. \n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מתרגל מעולה. יש אצלו בדר\"כ הרבה סטודנטים\n\nשעורי הבית: קלים לרוב ולא לוקחים הרבה זמן\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1616011497504}, {"author": "noam nissim", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה ומצגות טובות.\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: מתרגל טוב, אבל יכול להסביר יותר טוב לפעמים\n\nשעורי הבית: בסדר יחסית, לא דורשים הרבה זמן\n\nהמבחן: מבחן קשה בגלל עומס הנושאים ולא בגלל קושי השאלות\n\nהשורה התחתונה: קורס מעניין מאוד, אבל יש כמות נושאים מאוד גדולה שמקשים מאוד את הלמידה למבחן", "timestamp": 1616260279177}, {"author": "אלעזר", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: טארק מומלץ!\n\nשעורי הבית: \n\nהמבחן: אמריקאי עם 20 שאלות, מי שהשקיע יכול לעבור את הקורס אבל בשביל להצליח צריך לדעת טוב את התאוריה כי הם אוהבים לתת שאלות על מקרי קצה ויוצאים מן הכלל.\n\nהשורה התחתונה:", "timestamp": 1616274260133}, {"author": "Gilad sella", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  שי מלצמן\nחוות דעת - הרצאות:  המרצה שמעביר את החומר בצורה הטובה ביותר , מפרט בהרצאות שלו יותר מהמרצים האחרים, ומעודד השתתפות של הסטודנטים בהרצאות שלו - היחיד שעשה זאת מכל המרצים שלמדתי איתם הסמסטר. חד משמעית המרצה הכי טוב לכימיה כללית ועדיף ללכת אליו גם אם השעות לא נוחות.\n\nשם המתרגל/ת:  מעיין סוויסה - שלייף\nחוות דעת - תרגולים:  כמו שי, גם היא מוסיפה אקסטרות לתרגולים שלה , אבל קשה להתרכז על שלב מתקדם בקורס. עונה מהר על שאלות במייל.\n\nשעורי הבית: קשים, אבל ברמת מבחן ולעיתים קשים יותר. ממליץ לשבת עליהם לבד או עם עוד אנשים אבל לא להשתמש ברפרנס. תדירות של פעם בשבוע, שניים - שלושה מהם לא נכנסים למגן\n\nהמבחן:  אותה רמה של שיעורי הבית - קשה מאוד, צריך לשבת פיקס על החומר ולהיות מרוכז לגמרי בכל שאלה כי כל שאלה נועדה להפיל.\n\nהשורה התחתונה:  קורס חובה וברמה קשה יחסית, אפשר ללמוד את כל החומר לפני המבחן אבל ממליץ למצוא מרצה ומתרגל טובים בשביל לא ליפול בקורס הזה.", "timestamp": 1616359417366}, {"author": "ההוא שגר ליד אולמן", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שי\nחוות דעת - הרצאות: תותח אמיתי, מסביר מצויין שיעורים מעניינים.\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: גם תותחית, מסבירה היטב וסבלנית, באמת אכפת לה.\n\nשעורי הבית: לא עמוס מידי, רמה סבבה, ממש מומלץ לעבור על התרגולים גם. הש.ב והתרגולים ביחד סוגר את הפינה.\n\nהמבחן: קצת קשוח כי יש הרבה חומר אבל פייר בתכלס.\n\nהשורה התחתונה: ממה שאני חוויתי, החומר ממש מעניין רוב הזמן, לפעמים קצת מסובך אבל רוב הזמן סבבה. התרגילים קצת קשים (לא למדתי כימיה לפני זה בכלל) אבל עם הרבה תרגול אפשר לקבל ציון טוב.", "timestamp": 1616404032150}, {"author": "אוהד קטרי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ד\"ר שי מלצמן\nחוות דעת - הרצאות: מרצה מדהים\nמערב את הסטודנטים בהרצאה ושומר אותם בקשב בצורה שלא מתישה יחסית.\nהמרצה הכי טוב לקורס הזה נקודה.\nאת כל המערכת שיניתי בשביל להיות בהרצאות שלו, ממליץ לכולם לעשות ככה\n\nשעורי הבית: לא יותר מדי, אבל כיוון שכל שבוע חומר אחר זה שורט ממש\nבכל מקרה, לא לרפרנס ולא לדאוג, ברוב הגליונות השאלות מעט מעל רמת מבחן ולא לחלוטין משקף את הרמה של הבחינה הסופית\n\nהמבחן מבלבל\nהמרצה האחראי אצלנו (אמנון) נתן כמה שאלות עם 5 תשובות נכונות ורק אחת נכונה יותר. נופלים על קטנות וכל טעות 5 נק... \nתלמדו טוב למבחן\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1616439840397}, {"author": "ג", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מסביר בסדר, קצת רץ על החומר (בעיקר לקראת הסוף)\n\nשם המתרגל/ת: מעיין סוויסה\nחוות דעת - תרגולים: מסבירה יפה את התרגילים שפותרים, בהחלט ממליץ ללכת אליה.\n\nשעורי הבית: לא עמוס, אבל יכולים להיות מאתגרים למי שלומד כימיה פעם ראשונה בחייו.\n\nהמבחן: מבחן סביר, רמה אחת מעל השיעורי בית אבל עדיין לא קשה במיוחד.\n\nהשורה התחתונה: ההתנהלות בקורס לא מדהימה אבל זה מה שיש, סך הכל קורס בסדר. כאמור רקע בכימיה בהחלט מקל.", "timestamp": 1626604085882}, {"author": "אלון", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: די משעמם. המרצה מקריא מתוך מצגת באותה מידה ניתן לקרוא לבד ולהבין.\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: מתרגל מדהים! \nמסביר בצורה טובה את הנקודות הקטנות שהרבה פעמים מתפספסות. משקיע בסטודנטים מעל ומעבר, פתח איתנו קבוצת וואטסאפ שיהיה לנו יותר קל לשאול אותו שאלות.\nמומלץ מאוד!!\n\nשעורי הבית: גיליון כל שבוע. 2-3 גליונות האחרונים יותר קשים מהאחרים אבל לא בצורה מזוויעה.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס לא הכי מעניין, מי שלא חייב כנראה שלא הייתי ממליץ.", "timestamp": 1627384700439}, {"author": "אביב כימיה", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: טובים מאוד ! הם מאוד רלוונטים למה שמופיע בסוף במבחן במיוחד התרגילים במצגות.\nהחומר התאורטי בתרגולים היה טוב ומתומצת. \n טארק מאוד אכפתי ונכון לעזור בשעות קבלה תמיד \n\nשעורי הבית: מאוד דומים למה שקורה במבחן, ומאוד דומים למה שמופיע בתרגולים. \n\nהמבחן: הוגן\n\nהשורה התחתונה: מומלץ לקחת כמקצוע מדעי ופשוט להיות בקצב של הכיתה ולעשות את השיעורי בית", "timestamp": 1635325011320}, {"author": "Ron Dahan", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרבה תיאוריה, כמעט ואין דוגמאות ותרגילים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלפעמים כבדים ולפעמים קלילים\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643888641896}, {"author": "..", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n/\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nלא הכי מענין רוב הזמן", "timestamp": 1643917187980}, {"author": "מיקי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רעות\nחוות דעת - הרצאות: \nאחלה של מרצה סך הכל. נוטה להתחיל בקצב איטי, לשים לב ב3/4 ההרצאה שאין לה זמן ואז מתחילה לרוץ ממש מהר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nתחילת הסמסטר אם באתם בלי רקע בכימיה, הש.ב קשים, אמצע הסמסטר נהיים קלילים, סוף סמסטר שוב פעם קשים\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643997357662}, {"author": "אבישג.ד", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צ’ארלס\nחוות דעת - הרצאות:\nצ’ארלס חמוד. ממליצה ללכת אליו למי שלמד כימיה בתיכון. הוא מקריא מהמצגת אבל עונה יפה לכמה שאלות שאתם רוצים.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: \nאנה מלחיצה מאוד ונותנת הרגשה לא טובה. ממליצה ללכת לטארק. הוא נהדר ומאוד רגוע פותר הכל עם הרבה הסברים ונותן לכם לשאול כמה שאלות שתרצו. או לחלופין לכו למיקו גם כמו טארק נותן לכם יחס אישי והבנה ורוגע.\nשעורי הבית: \nקלים מאוד, מהירים ופשוטים למי שעשה כימיה בתיכון. אך יש תרגילים טריקים אז מומלץ לעבוד עם הנוסחאות.\nהמבחן:\n20 אמריקאיות. לא קשות מידי. ממליצה ללכת לשיעור ההכנה של מיקו לפני הוא די רומז על מה שיהיה במבחן.\n\nהשורה התחתונה:\nקורס כיפי", "timestamp": 1644960419275}, {"author": "sahar", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: צארלס\nחוות דעת - הרצאות: \nמשעמם ומרחא ממצגת\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: \nמלך מלך מלך, מסביר הכל כמו שצריך, עונה על הל השאלות ודואג שכולם יבינו את החומר, ומשרה אווירה רגועה בכיתה.\nשעורי הבית: קשים בהתחלה, קלים באמצע וקשים בסוף\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1645052179509}, {"author": "Saar Levy", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מרתק. רואים את העניין והאהבה שלו לנושא. עונה על שאלות בצורה מאוד עניינית ומסביר מאוד ברור. קצת איטי ולפעמים לא מספיק את כל החומר. רחו בחשבון שההרצאות זה בעיקר כדי לקבל היכרות ראשונית עם החומר. קשה ממש להבין לעומק ולפתור תרגילים נטו על בסיס מה שנלמד בהרצאה.\n\nשם המתרגל/ת: אנטוני כהן\nחוות דעת - תרגולים: תותח. מסביר בצורה הכי ברורה שיש. סבלנות בלי סוף והרבה פעמים מספיק יותר שאלות מהדרוש כל תרגול.\n\nשעורי הבית: לדעתי לא קשים מדי. כן דורשים את המחשבה וההבנה. יש גיליונות לא פשוטים בכלל ויש כאלה שאפשר לעשות בחצי שעה או פחות.\n\nהמבחן: לא קל אבל גם לא סיוט. יותר קל משיעורי הבית. לא לזלזל ולהשקיע בלמידה ותרגול מבחנים ישנים.\n\nהשורה התחתונה:", "timestamp": 1645119901814}, {"author": "ה.מכונות", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: \nמרצה מעולה, נותן סדר והמון דוגמאות, שלא לדבר שהוא ממש נחמד.\n\nשם המתרגל/ת:  אנטוני כהן\nחוות דעת - תרגולים: \nמאוד מקצועי, מבין ממש בכל הקשור בכימיה (ואפילו בהיסטוריה שלה), מה שכן הכתב שלא יכול להיות לא ברור והוא מודה לזה.\nשעורי הבית: \nבמודל, שיעורים שיכולים להיות קשים מאוד או פשוטים ממש, לא באמצע. לרוב בין 5-8 שאלות בשבוע, כל שבוע.\nהמבחן: \n20 שאלות אמריקאיות, על כל החומר. המבחן שלנו היה הרבה יותר הבנתי ופחות חישובי אז הוא היה קשה. במחנים משנים קודמות רק עם פתרונות של מה התשובה הנכונה ולא למה היא נכונה שזה די מעצבן.\nהשורה התחתונה: \nהסגל אחלה, החומר די משנה מבחינת קושי כי יש חומר ממש פשוט ויש ממש מורכב, צריך פשוט לשאול כמה שיותר על מה שלא מובן.", "timestamp": 1645179837203}, {"author": "צ", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צרלס\nחוות דעת - הרצאות: אחלה מרצה, צריך טיפול פסיכולוגי.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא חייב לעשות הכל אז כדאי להשקיע בהתחלה כי לאט לאט הרמת קושי עולה\n\nהמבחן: אין לי מושג לא עשיתי\n\nהשורה התחתונה: כפרה על צרלס שלא נאבד אותו", "timestamp": 1645384762038}, {"author": "I.V", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שי \nחוות דעת - הרצאות: שי נעים וכיף בהרצאות שלו, ומכיוון שהן די מאוחרות הן בדרך כלל לא עמוסות. נשאר תמיד אחרי ההרצאה ומדבר בגובה העיניים, הפך את הקורס הזה לכיף.\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: מיקו מכיר את הקורס היטב ובתרגולים שלו נותן אחלה טיפים לשיעורי הבית ולמבחן. שואל את כל מי שבזום שאלות מה שיוצר מצבים מוזרים לפעמים, אבל זה דורש באמת להקשיב אז אולי זה עדיף.\n\nשעורי הבית: במקביל לתרגילים פותחים הקלטה של התרגול של מיקו/טארק מאותו השבוע וכל המידע כבר יהיה שם. יש כמה תרגילים קשים בחלק מהשבועות אבל סה\"כ לא נורא.\n\nהמבחן: הוגן. 20 שאלות אמריקאיות (שזה המון) ולכן דרגת הקושי משמעותית יותר נמוכה ממה שנתקלים בו בשיעורי הבית.\n\nהשורה התחתונה:אחלה קורס, ואני אומר את זה בתור מישהו שלא ממש חובב כימיה", "timestamp": 1645393685311}, {"author": "---", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צ'רלס דיזנדרוק\nחוות דעת - הרצאות: מרצה מצויין ובעל חוש הומור. מעביר את החומר בצורה ברורה וקלילה.\n\nשם המתרגל/ת: עידן אביגדורי\nחוות דעת - תרגולים: מתרגל מעולה. מדבר בגובה העיניים, קצר ולעניין ונותן דגשים רלוונטים.\n\nשעורי הבית: גיליון במודל כל שבוע.\n\nהמבחן: מבחן אמריקאי. הוגן בסה\"כ.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1645452936480}, {"author": "ג", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רעות שפירא\nחוות דעת - הרצאות: מסבירה טוב את החומר ונותנת מקום לשאלות אבל לפעמים מתפזרת עם השאלות ואז לקראת סוף ההרצאה רצה על החומר כדי להספיק\n\nשם המתרגל/ת: אנטוני כהן\nחוות דעת - תרגולים: המתרגל הכי טוב, אולי חוץ מטארק, ועושה סיכום של ההרצאה לפני שהוא מתחיל לפתור תרגילים ככה שקודם מבינים את החומר ואז אפשר לפתור ולהבין מה עושים. אבל יש בעיה אחת וזה הכתב שלו והוא יודע שהוא נוראי אבל בסוף מתרגלים\n\nשעורי הבית: יש כאלה קשים יותר יש כאלה קלים יחסית ויש פעם אחת שהם ברמה גבוהה מאוד אפילו הרבה יותר מהמבחן\n\nהמבחן: אמריקאי ודי סבבה, יש חלקים קשים יותר ויש פחות אבל אצלנו גם הייתה שאלה עם טעות הקלדה אז כולם קיבלו עליה 5 נקודות\n\nהשורה התחתונה: קורס נחמד ובתור אחד שלא למד כימיה לפני לא היה קשה מדי", "timestamp": 1645541629578}, {"author": "קורס זוועה", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מסביר הכי טוב, לא אשמתו שהקורס קשה פיצוצים\n\nשם המתרגל/ת: טארק, עידן, מיקו\nחוות דעת - תרגולים: טארק סבבה, התרגולים שלו מפוצצים, צריך לבוא שעתייפ פלוס לפני ומשום מה כולם מדברים אבל אפשר ללמוד מההקלטות שלו.\nעידן סבבה, מלמד מסודר, קצת אדיש ומרדים.\nמיקו סבבה, משתף מאוד את הסטודנטים בשיעור, קליל ומצחיק, לפעמים התכלס טיפה מתפספס.\nהבעיה הכללית שלי עם כל המתרגלים היא שכולם סהכ סבבה, אבל הם כימאים אז להם החומר קל ומשעמם וככה הם מלמדים אותו, בפועל הוא קשהההה ומשעמם\n\nשעורי הבית: או זוועת עולם (1-4, 10-13) או קלים ממש (5-9)\n\nהמבחן: עוד יותר זוועת עולם. לגרד עובר ולחגוג\n\nהשורה התחתונה: זוועת עולם. מי שלא חייב ואין לו רקע בכימיה ממליץ להתרחק", "timestamp": 1646248333999}, {"author": "mip", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: אנה יחונבסקי\nחוות דעת - תרגולים: כאשר היא מתרגלת בכיתה קטנה זה מעולה, או תרגולים מוקלטים של שי\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1646297973133}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שי\nחוות דעת - הרצאות: ההרצאות של שי מלמדות ומעניינות מאוד. \n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: הסברים בסדר לא תמיד הכי ברור אבל מאוד עוזר בשיעורי בית וקשוב.\n\nשעורי הבית: קצת קשים ודורשים לראות את התרגול היטב.\n\nהמבחן: הרבה יותר קל משיעורי הבית\n\nהשורה התחתונה: קורס מאוד נחמד וקצת הרבה חומר אבל לא עמוס.", "timestamp": 1647611799502}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: צ'רלס\nחוות דעת - הרצאות: אווירה ממש נחמדה בכיתה, צרלס מסביר מעולה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 10-11 גליונות סגורים במודל. נופלים על שגיאות חישוב מפה עד הודעה חדשה, וזה תקף, אז מומלץ קודם להשוות עם חברים שקיבלו את אותן שאלות (או לחפש רפרנס).\n\nהמבחן: \nאין הפתעות, כל מבחן בכמעט אותו הסגנון עם כמעט אותן השאלות. אחרי מספיק שאלות מתחילים לתפוס את התבניות.\nהשורה התחתונה: הקורס מאוד מאוד טכני. יש כל כך הרבה נושאים שנוגעים בהם על קצה המזלג, ככה שבסוף רק צריך לזכור את השורה התחתונה והנוסחאות הרלוונטיות.\nגם אם לא מודים בזה, הקורס יוצא מנקודת הנחה שלמדתם כימיה בתיכון- לא בשביל התאוריה, אלא בשביל האינטואיציה לכל מיני נושאים. לכן:\nלמי שאין רקע- מומלץ להיצמד למה שמלמדים, לתרגל כמה שיותר ולהיות על זה.\nלמי שיש רקע (בתור אחת עם)- מומלץ לפתור את התרגולים לבד (עד הסוף) במקום לבוא אליהם, ולתרגל מבחנים כמה שיותר מוקדם.", "timestamp": 1647771844908}, {"author": "May", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "קורס קשה.\nמשעמם\nשיעורים שבועיים\nמתרגל שמגלה תשובות-\"יתרון\" אם אתם אלה שגילו להם\nאם לא חייבים לקחת לא מומלץ- לבחור מדעי אחר.", "timestamp": 1649683839951}, {"author": "אההה", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שי\nחוות דעת - הרצאות: המרצה הכי טוב\n\nשם המתרגל/ת: טארק, עידן\nחוות דעת - תרגולים: טארק מצויין אבל הכיתה שלו מפוצצת, ממש קשה.. עידן גם סבבה, קצת עייף\n\nשעורי הבית: או קשים ממש או קלים ממש, מתחלק בערך חצי חצי וגם תלוי מאוד בהגרלה האקראית של השאלות שכל אחד מקבל אישית במודל (מחדל!!!)\n\nהמבחן: זוועה!! ברמה של הש.ב הקשים ואפילו מעל, עברתי על חודו של פקטור\n\nהשורה התחתונה: קשה מאוד למי שאין לו רקע בכימיה, ובנוסף מאוד אוהבים לשחק ולבלבל עם יחידות (כאילו לא מספיק מסובך). למי שזה לא קורס חובה לא ממליץ בכלל!", "timestamp": 1652877515169}, {"author": "Yuval Bar-Ratson", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  צארלס\nחוות דעת - הרצאות: \nמרצה טוב, רוב החומר הוא חומר של תיכון ולמי שלמד פעם כימיה מאוד פשוט.\nשם המתרגל/ת: אנטוני\nחוות דעת - תרגולים: \nתרגולים טובים, מסביר טוב ועוזר להבין איך עונים על שאלות.\nשעורי הבית: \nיחסית פשוטים, לא דורשים הרבה זמן\nהמבחן: \nכמה שאלות מטעות אבל ברובו כמו השעורי בית\nהשורה התחתונה: \nאם זה לא במומלצת זה קורס טוב להעלות ממוצע", "timestamp": 1656922847038}, {"author": "זאת אני", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: טיפה מרדים אבל ההרצאות חשובות כדי להבין את התיאוריה של הדברים. הרבה פעמים שואלים במבחנים שאלות של הבנה תיאורטית.\n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: אחלה מתרגל, מסביר טוב, אבל הכי חשוב זה לפתור את השאלות של התרגול לבד!! אחרת זה לא כל כך יעיל, המתרגלים מדלגים על דברים שמבחינתם מובנים מאליו ולמי שלא למד כימיה בתיכון אלה דברים שממש לא מובנים בלי הסבר מעמיק. לכן למי שלא למד כימיה בתיכון, תתכוננו, אתם צריכים ללמוד בעצמכם הרבה דברים שלא מוסברים טוב אם בכלל בקורס.\n\nשעורי הבית: מעצבנים מאוד, עלולים לקחת זמן, אבל חייב אותם למגן.\n\nהמבחן: 20 שאלות אמריקאיות, המון מסיחים מאוד קשים. מועד א' הוגן אבל לא קל, מועד ב' קשה בהרבה!! \n\nהשורה התחתונה: למי שלא למד כימיה בתיכון, זה קורס קשה! \nבעיקר כי לא מלמדים טוב את הקורס ואתם צריכים ללמד את עצמכם דברים קריטיים למבחן. \nאם עשיתם כימיה בתיכון, הרמה לא בהרבה יותר גבוה, יש לכם סיכוי טוב להוציא ציון גבוה.", "timestamp": 1658996880595}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שי\nחוות דעת - הרצאות: ממש ממליצה על ההרצאות של שי. הוא מסביר בצורה ממש ברורה שכמעט אין צורך לחזור על החומר בסוף הסמסטר. \n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: תרגולים ברורים.\n\nשעורי הבית: ת\"ב כל שבוע תקף. יש בערך 7 שאלות. ממש עוזר להבנה והשאלות דומות במבחן אז מומלץ להשקיע. צריך בערך שעתיים לפתור.\n\nהמבחן: 20 שאלות אמריקאיות. דומה לשאלות בתרגולים ובת\"ב. מבחן הוגן לגמרי.\n\nהשורה התחתונה: קורס ממש סבבה אם אתה עושה את התב והולך להרצאות ותרגולים.", "timestamp": 1659264200348}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: אל תלכו להרצאות זה בזבוז זמן, תלמדו דרך הקלטות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חוץ מאחד על תרמודינמיקה אפשר לקבל בכולם 100 בלי הרבה מאמץ\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675420501788}, {"author": "מישל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: שי מרצה טוב, הוא מלמד עם מצגת אבל מצליח לעשות את זה בצורה מעניינת. \n\nשם המתרגל/ת: אנה יוחננובסקי\nחוות דעת - תרגולים: מצויינת! עושה סיכום די יסודי של החומר התיאורטי בתחילת התרגול עם דגשים על דברים חשובים ומספיקה את כל התרגילים. תמיד היתה מוכנה לעזור בכל שאלה. ממש עשתה לי סדר בחומר.\n\nשעורי הבית: כל אחד מקבל סט שונה של שאלות. חלק מהגליונות ממש קלים וחלק בלתי פתירים, תלוי במזל.\n\nהמבחן: \n\nהשורה התחתונה: סהכ קורס נחמד, נותן ידע כללי שטחי אבל מגוון.", "timestamp": 1675621857739}, {"author": "Hanoch Egyes", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רעות\nחוות דעת - הרצאות: לא מובן בכלל ולפעמים לא קשור לשיעורי הבית\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: ככה ככה\n\nשעורי הבית: לפעמים קלים ולפעמים קשים מאוד. תרגיל כל שבוע\n\nהמבחן: אמריקאי אבל צריך להבין את החומר טוב\n\nהשורה התחתונה: לא ממליץ למי שלא חייב/מעניין אותו/ למד כבר כימיה גמגמה בתיכון", "timestamp": 1676215909837}, {"author": "אנונומי2", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מאוד טוב\n\nשעורי הבית: קשים מאוד\n\nהמבחן: קשה קשה\n\nהשורה התחתונה: קורס 0", "timestamp": 1676349716249}, {"author": "Anonymous", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רעות\nחוות דעת - הרצאות: \nנחמדה\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: \nמשעמם\nשעורי הבית: \nקשים\nהמבחן: \nמגעיל\nהשורה התחתונה: הקורס הכי מיותר שראיתי בחיים אפשר לקבל התקף לב רק מרוב שעמום וחוסר עניין מי שלא חייב לעשות שיברח", "timestamp": 1676400692520}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נעם אדיר\nחוות דעת - הרצאות: \nלדעתי מרצה מעולה, ניכר שאוהב להרצות ואת הכימיה ומעביר בצורה מעניינת , יש נושאים לא מעניינים אבל ההרצאות חשובות להבנה לדעתי\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מתרגל נדיר, מאוד מובן וברור מצליח להסביר את מה שלא הבנת בהרצאה בצורה הטובה ביותר. כן התרגולים שלו מאוד עמוסים ולפעמים עם הרבה רעש אז לא מתאים לכל אחד \n\nשעורי הבית: יש גליונות קשים יותר ופחות, לרובם לקח לי 3-6 שעות בגדול לסיים. מעולה להבנה לא לוותר\n\nהמבחן: לא מבחן קל אבל לא קשה מדי, לדרוש את ההבנה בנושאים במהלך הסמסטר ולא לחכות עם זה ללפני המבחן\n\nהשורה התחתונה: קורס אחלה בגדול, מי שבא עם רקע כימי אני חושבת שהקורס ילך לו יותר בקלות ומי שלא (כמוני) קצת יתאמץ בהתחלה להבין את השפה אבל ברגע שקולטים מאוד מעניין", "timestamp": 1676613857465}, {"author": "tbu", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מדהים. מנגיש את החומר בצורה ברורה ועניינית, מצגות שכוללות את כל החומר הנלמד באופן ברור ופשוט. שיעור אחד בשבוע\n\nשם המתרגל/ת: מיה\nחוות דעת - תרגולים: מיה מקסימה ומסבירה את כל הניואנסים (:\nטארק מדהים! מומלץ בחום!\n\nשעורי הבית: גיליון פעם בשבוע, שיעורי בית עפי החומר הנלמד בהרצאה\n\nהמבחן: לדעת היטב את כל תריגלי שיעורי בית ולתרגל מבחנים. יש חזרתיות. המבחן אמריקאי 20 שאלות\n\nהשורה התחתונה: אחלה קורס, קליל אך דורש השקעה במהלך הסמסטר. ניתן להוציא צין גבוה בקורס", "timestamp": 1676992120215}, {"author": "Shir Ben Meir", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי \nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר בצורה מעניינת ובאווירה טובה\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: בעיניי היא קוסמת, מלמדת בצורה מעניינת ויודעת לחזות בערך כל טעות שסטודנט יכול לעשות בשאלה. מקפידה לעשות בריף קצר על כל החומר בתחילת התרגול ורק אז לגשת לשאלות, לי אישית זה עשה סדר.  \n\nשעורי הבית: יש גליונות קשים יותר ופחות, הרוב לקחו בין שעה לחמש. \n\nהמבחן: לא קל בכלל. \n\nהשורה התחתונה: קורס לא פשוט אבל מעניין.", "timestamp": 1677003041343}, {"author": "ניקול", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מסביר את החומר בבהירות, מומלץ לשאול שאלות, הוא עונה בצורה ברורה וזה עוזר כדי לא לפתוח פערים בהמשך. מאוד מומלץ.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מדהימה! מסבירה הכל מאוד ברור.\n\nשעורי הבית: חלקם לוקחים חמש דקות וחלק חמש שעות. חלק מהשיעורי בית יותר קשים מהמבחנים אז אל תלחצו, אם לא מובן עדיף לשאול ולא לפתוח פער.\n\nהמבחן: אם הצלחתם את כל התרגילי בית אתם מוכנים, מספיק לעבור על קצת מבחנים כדי להבין איך פותרים.\n\nהשורה התחתונה: מאוד מומלץ, קליל למי שעשה כימיה בתיכון", "timestamp": 1677163951396}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: אנה מתרגלת מצוינת! התרגול המעשי עם הלוח ופתרון בזמן אמת ולא על בסיס מצגת עוזרים מאוד להבנה של החומר.\n\nאנה המתרגלת הכי טובה בסגל לדעתי - בדקתי שלושה מתרגלים שונים\n\nשעורי הבית: משתנה במהלך הקורס - רוב שיעורי הבית סבירים לחלוטיןת האתגר הוא קבועי הזמן להגשה וקצב ההגעה של שיעורי הבית. כמו כן ציון שיעורי הבית תקף ולכן יש להם משמעות גבוהה יותר משל מקצועות בהם שיעורי הבית הינם מגן.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677760593923}, {"author": "tbu", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי למצמן\nחוות דעת - הרצאות: מומלץ בחום\n\nשם המתרגל/ת: מאיה, טארק\nחוות דעת - תרגולים: מדהימים , לגמרי מומלץ\n\nשעורי הבית: לכל שבוע - מטלת בית בנושא ( 3 ניסיונות להגשה)\n\nהמבחן: דורש תרגול ולמידה טובה אבל יש חזרתיות ועם למידה טובה אפשר להגיע ל100 בקלות\n\nהשורה התחתונה: אחלה כימיה", "timestamp": 1678181259972}, {"author": "אא", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מרצה טוב וברור. אחלה מצגות אחלה העברת תוכן\n\nשם המתרגל/ת: אנה יוחנובסקי\nחוות דעת - תרגולים: מותק אמיתית הדבר הכי טהור שיצא לי לראות, רוצה לטובת כל הסטדונטים שלה, עונה על השאלות משיעורי בית (גם במייל) ודואגת לצרף דרך פתרון כי באמת חשוב לה שכולם יבינו. לפעמים מתעכבת על שאלות, אבל לא מורגש.\n\nשעורי הבית: יש עומס ויש כאלה שהם ממש לא הכי ברורים. בגדול - צריך לעשות 10/12 ככה שזה סביר אבל יש שיעורים שאתה באמת תוהה אם זה משהו שלמדת בכלל בקורס\n\nהמבחן: 20 אמריקאיות הוגן לחלוטין.\n\nהשורה התחתונה: קורס לא פשוט אבל מי שמבין את החומר יהיה לו ממש לא קשה.", "timestamp": 1678388737607}, {"author": "Nir Karl", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: לדעתי שי קצת מורח את הזמן, יש לו נטייה לתעכב על דברים לא חשובים ולא להספיק את כל החומר, אבל מה שהוא מסביר, הוא מסביר סבבה לגמרי.\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: מתרגל סבבה סך הכל, דואג לתלמידים, זמין תמיד בווצאפ, מעלה הקלטות של התרגולים.\n\nשעורי הבית: פעם בשבוע, אם מבינים את החומר, השב ממש סבבה.\n\nהמבחן: המבחן אחלה, הוא ברמה הוגנת, אם מבינים את החומר אפשר להוציא ציון טוב.\n\nהשורה התחתונה: להשקיע בלהבין את החומר במהלך הסימסטר ואתה מסודר.", "timestamp": 1678692092875}, {"author": "נ", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שי מלחין, רעות\nחוות דעת - הרצאות: דילגתי קצת בין שתיהם בגלל אילוצי מערכת אישיים- זה אפשרי לגמרי כי לכל הרצאה יש ממש נושא חדש. שניהם מעולים. רעות ממש מפרטת נותנת הרבה דוגמאות, שי יותר רץ על החומר ואולי קצת יותר מעניין. באמת שניהם מעולים.\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: הכי טובה שיש!!\n\nשעורי הבית: אחלה\n\nהמבחן: אחלה\n\nהשורה התחתונה:", "timestamp": 1678879783879}, {"author": "בן", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: טארק\nחוות דעת - הרצאות: כיפיות אך מיותרות\n\nשם המתרגל/ת:  רומי לוי\nחוות דעת - תרגולים: טובה אך נוטה לרוץ לקראת סוף השיעור כדי להספיק\n\nשעורי הבית:\nהשאלות יותר קשות מהשאלות במבחנים. \nממליץ לפתור אותם אחרי התרגול כשהכל תרי ולוודא הבנה\n\nהמבחן: \nלא בשמיים אבל צריך להשקיע כדי לעבור את ה80\nהשורה התחתונה: \nהבנה > הכל\nאין מה לעשות, חוקי הטבע גמישים יחסית לחוקי המתמטיקה אז לא להתרגש כשטועים בשאלה כי מדובר במקרה יוצא דופן.\n\nהנושאים עצמם מגניבים.", "timestamp": 1678882620214}, {"author": "gil blank", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שי הולצמן\nחוות דעת - הרצאות: שי מסודר מאוד ומסביר ברמה גבוהה. הוא אוהב שניגשים אליו בסוף או רק בשלבים שהוא פותח לשאלות. \n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת נהדרת שמאוד מאוד חשוב לה שתבינו את החומר. היא מדבתר קצת מהר אז מי שלחוצ.ה קצת פחות מתאים ללכת אליה היא היא משרה אווירה לחוצה למרות שהיא נהדרת. \n\nשעורי הבית: קשים יותר מהמבחן\n\nהמבחן: הוגן", "timestamp": 1678959855511}, {"author": "פאקטור", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: כל מיני\nחוות דעת - הרצאות: לרוב מיותר, יש הטוענים שרעות בסדר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאנה אחלה, כל השאר להתרחק \nשעורי הבית: מזעזעים ובכלל לא רלוונטיים למבחן, לרפרנס ובמקום זה להתעקש על הקבצים שעושים בתרגול. \n\nהמבחן: \nמועד א סביר\nמועד ב מזעזע ממוצע 56, אל תצפו לפקטור כי לא יהיה\nהשורה התחתונה: קורס מעניין שהוציאו לו (ולי) את הנשמה. לא להזניח, ולפתור את כל התרגילי כיתה שמעלים למודל (לא השיעורי בית)\nבסוף יהיה טוב", "timestamp": 1678998139792}, {"author": "matan arad", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: נעם\nחוות דעת - הרצאות: מרדימות\n\nשם המתרגל/ת: מיקו\nחוות דעת - תרגולים: לבוא רק קרוב למבחנים\n\nשעורי הבית: אין קשר למבחן הרבה יותר קשים\n\nהמבחן: קל אם אתה יודע ללמוד עצמאית\n\nהשורה התחתונה: הלך טוב ולא בזכות הצוות, קורס לא קל בכלל בשב ומבחן סבבה", "timestamp": 1679497358218}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רעות\nחוות דעת - הרצאות: ההרצאות היו טובות, למי שעשה בגרות בכימיה יכול להיות שקצת מיותר, לי לא היה רקע בכלל אז עזר.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת מעולה, נרגשת ומסבירה גם את החומר וגם איך לגשת לשאלות. מעבר לזה, עונה לשאלות על שיעורי בית גם במייל שזה מאוד עוזר.\n\nשעורי הבית: לרוב סבירים, יש 2 שבועות עם תרגילי בית קשים במיוחד אבל לרוב סגל הקורס כן זמין לשאלות ומתחשב\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1679764051107}, {"author": "~", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לא ראיתי הרצאות\nחוות דעת - הרצאות: הרצאות מיותרות, חוזרים על הכל בתרגול. מספיק לעבור על המצגות של ההרצאות לפני התרגול\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: המתרגלת הכי טובה, מסבירה הכל בצורה הכי מובנת שיש ועונה על כל השאלות (כולל שאלות על שב). \n\nשעורי הבית: לקראת הסוף השיעורי בית קצת עולים רמה, אבל ברוב המוחלט של הקורס הם די קלילים, ממש על החומר של התרגול. דורשים לא יותר מ3-4 שעות שבועיות \n\nהמבחן: אני לא בטוחה למה היה ממוצע ככ נמוך הסמסטר, אבל לדעתי הרמה הייתה רגילה לחלוטין- אם לומדים מספיק ומתרגלים מבחני עבר ממש סביר להוציא מעל 80\n\nהשורה התחתונה: קורס ממש נחמד שנהניתי ממנו מאוד, לא מומלץ למי שמחפש בחירה מדעית שלא דורשת השקעה בכלל, אבל למי שאוהב את הנושא זה אחלה של קורס", "timestamp": 1679772369135}, {"author": "המלך", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מצחיקול, חורג מהחומר, הרצאות קצת מיותרות לעתים, בעיקר משבוע 6 עד 10\n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מתרגל מעולה, ברור וכריזמטי. \n\nשעורי הבית: 10 גליונות מתוך 12, לא קשים בכלל. רובם 15 דק, חוץ מתרגול 4. תרמודינמיקה, השטן בהתגלמותו.\n\nהמבחן: בדיחה, 20 אמריקאיות.\n\nהשורה התחתונה: קורס מבולבל", "timestamp": 1680166074420}, {"author": "ליים בת אל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי מלצמן \nחוות דעת - הרצאות: אפשר לראות מוקלטות, ולאנשים עם הפרעות קשב אפילו מומלץ. השעות של ההרצאות לא נוחות והאולם מפוצץ.\nשי יכול להיות מרצה טוב, לא עם כ״כ הרבה אנשים.\nיש מצגות.\n\nשם המתרגל/ת: רומי לוי \nחוות דעת - תרגולים: מקסימה, סבלנית. לא מספיקה הרבה תרגילים בשיעור אבל אם לא הולכים להרצאות טובה מאוד כי היא מסבירה את החומר מסודר, וכל תרגיל שעושים, עושים מא׳ עד ת׳.\nשעורי הבית: קשים, לא ברורים לפעמים, ומאוד מתסכלים. שווה ללכת לכימיקלי ולפתור עם עוד אנשים כדי לחסוך זמן. \n\nהמבחן: בעיקר שימוש בדף נוסחאות, הבנה של התחכמויות וחזרה על מבחנים. המבחן לא משוחזר, אבל ככל שעושים יותר מבחנים מבינים יולר את השאלות.\n\nהשורה התחתונה: שיעורי בית קשים, מבחן חלק קשה חלק לא.", "timestamp": 1680380432502}, {"author": "ליים בת אל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שי מלצמן \nחוות דעת - הרצאות: \nבסמסטר חורף וגם בסמסטר אביב ההרצאות של המקצוע הזה בשעות לא טובות לאנשים שקשה להם להתרכז מאוחר - 16:30-18:30 שי עם המון ידע, אבל בחורף הכיתה ענקית ויש המון רעש. \nשם המתרגל/ת: רומי לוי \nחוות דעת - תרגולים: \nאחלה מתרגלת, כותבת הכל על הלוח בצורה די מסודרת. לא עובדת עם מצגות לשאלות, מה שלמי שקשה להתרכז גם בלכתוב וגם בלהבין יכול להקשות - מומלץ לצלם את הלוח או לעבור למישהו עם מצגת. מסבירה בצורה טובה וממש סבלנית.\nשעורי הבית: חלקם בלתי אפשריים, עד כדי כך שגם החונכים בכימיקלי לא מצליחים לפתור וגם למתרגלים לוקח זמן להבין מה רוצים. חלקם ממש סבבה. תלוי בנושא באותו השבוע. מאגר השאלות מטורף, לכן קשה למצוא רפרנסים. \n\nהמבחן: 25 שאלות אמריקאיות שמערבות גם תיאוריה טהורה וגם פתרון בעיות חישוביות. יש לפעמים קאצ׳ בעברית בשאלות. מבחן סביר ביחס לשיעורי הבית.\n\nהשורה התחתונה: ללכת לכימיקלי לפתור את שיעורי הבית, אם לא מצליח לבד לא להיאבק בזה, יש בחלק מהשאלות טריקים שלא קשורים למבחן. המבחן יכול להיות מכשיל.", "timestamp": 1688073391016}, {"author": "A", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מרצה מעולה, מומלץ בחום\n\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: מתרגל מצוין, וממש מומלץ, אבל שמעתי שהוא עוזב אז זה לא יעזור לכם ממילא\n\nשעורי הבית: קשים. אבל המבחן דומה לתרגילי הבית אז זה יעזור לכם לדעת איך אתם עם החומר\n\nהמבחן: הוגן יחסית. לא היה בו משהו שלא ראינו בתרגול\n\nהשורה התחתונה: קורס לא כזה קשה בעיניי, ואפילו מעניין", "timestamp": 1690728965674}, {"author": "טל חן", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: אחלה מרצה, מסביר טוב וגם יש הקלטות עבר שלו\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: מדהימה! אכפת לה שנבין ורואים שהיא משקיעה את הנשמה. אורך התרגולים היה מצויין\n\nהמבחן: אמריקאי והוגן\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1706431321771}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמותר ללכת להרצאות, אפשר להסתפק בהרצאות של שי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמאוד חשוב ללכת לתרגולים \n\nשעורי הבית: \nלפעמים קשים אבל בסך הכל רמה גבוהה\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713206493434}, {"author": "צור", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nמעולה\nשם המתרגל/ת: לא הלכתי \nחוות דעת - תרגולים: \nלא הלכתי\nשעורי הבית: \nממוחזרים ולא קשים במיוחד\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713362737968}, {"author": "Margarita Birchanskiy", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שי\nחוות דעת - הרצאות: המרצה הכי טוב שהיה הסמסטר, אך בפני עצמו חסר כריזמה ומרדים בהרצאות. אם יש נטייה להבנה עצמית, עדיף לא לבזבז זמן על הרצאות וללמוד מהמצגות.\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: המתרגלת הכי עמוסה ולכן לרוב תשבו מאחור, במיוחד עם יש לכם משהו לפני. מתייחסת רק לשתי השורות הראשונות ובהתחשב בכל שלא תספיקו לשבת במקדימה, אם תנסו להבין את החומר, כנראה לא תצליחו, ולא תוכלו אפילו לשאול שאלה בשיעור כי היא פשוט לא תתייחס.\n\nשעורי הבית: קשים משמעותית מהמבחן ומהרמה בתרגולים. מגיע פקטור על השיעורי בית. במיוחד שהם עם מספר נסיונות מאוד מוגבל. ברמה של פעם הגעתי לשעת קבלה של מספר מתרגלים עם שאלה מש.ב. ואף אחד לא ידע לפתור אותה עד שלא פתחו את הפתרון.\n\nהמבחן: \n\nהשורה התחתונה: קורס קליל אם יש ידע מוקדם בכימיה. לכל השאר בהצלחה, מקווה שתשרדו", "timestamp": 1713537107302}, {"author": "אלון ספיר", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איילי מרכס\nחוות דעת - הרצאות: \nבואו נתחיל מזה שההרצאות לא ממש מועילות ובהחלט אפשר לוותר עליהן: ההרצאות מועברות באמצעות מצגת שקל להבין ממנה את התיאוריה. זה לא מרגיש שיש למרצה הרבה מה להוסיף, ופחות או יותר מספיק להסתכל במצגת ולהישאר בעניינים לפני שמגיעים לתרגול. וזאת הסיבה שאני לא ממש בטוח עד כמה בוער להידחס בסגו 1 בהרצאות של שי מלצמן בשעות שקשה מאוד לשמור בהן על ריכוז. וזה חלילה לא לרעת שי, שלפי מה שהבנתי הוא מרצה טוב מאוד(אף על פי שיש מי שיגיד שהוא אוברייטד).\nאיילי היא המרצה הכי חמודה בטכניון כנראה: היא עונה על *כל* השאלות מכל הלב, שואלת בתדירות גבוהה אם הכל מובן ובאה לקראת הסטודנטים, בעיקר כאלו שצריכים לצאת להרצאה ישר אחרי. אבל באותה המידה זה יכול להיות חיסרון: קל לאבד את הקשב בהרצאות של איילי מרוב שאלות(ואני אומר את זה דווקא כמי ששאל הרבה שאלות) ויש הרבה רעש בהרצאות של איילי.\nמבחינת העברת החומר, כפי שאמרתי- ההרצאות לא ממש חיוניות. אבל בכל אופן, איילי ממש משתדלת להעביר את החומר בצורה טובה. הבעיה היא שהיא לא מסתירה שהיא מגיעה מרקע ביולוגי ופחות כימי, וזה מקשה עליה לענות על חלק מהשאלות בהרצאות בצורה הטובה ביותר.\nעוד בעיה קטנה עם איילי היא תחושת המחסום השפתי שיש לה: זה מרגיש שהיא לא ממש מבינה עברית. מורגש שיש לה אנגלית בריטית ושזו שפת האם שלה, ולוקח כמה הרצאות להתרגל לזה.\nשם המתרגל/ת: מעיין סוויסה שלייף\nחוות דעת - תרגולים: \nגם כאן, התרגולים מועברים באמצעות מצגת. אבל בניגוד להרצאות, כן הייתי משקיע בלהיכנס לתרגולים: לפתור את השאלות לבד זה לא תמיד הכי טוב, ואתה כן צריך מתרגל מנוסה שיחבר לך את האינטואיציה לפתרון תרגילים.\nמעיין הייתה הסמסטר המתרגלת האחראית. אני הייתי בתרגול דיי עמוס שלה, אבל בגלל שהייתי בשורות הראשונות תמיד אז הפקתי מהתרגול שלה המון. היא מתרגלת ממש טובה ומומלצת, גם אם היא לא ממש מספיקה את כל מצגת התרגול כי היא מסבירה המון.\nאם לא היה לי מתרגל מושלם בפייתון, סביר להניח שכן הייתי נכנס לתרגולים של טארק טרביה: הוא ממש ממש לא אוברייטד, הוא מסביר בצורה מאוד מאוד טובה ומקצועית, ולדעתי במהירות יותר טובה משל מעיין. קחו בחשבון שהתרגולים שלו עמוסים, אבל מי אני שאגיד אחרי שהייתי בתרגול העמוס של מעיין?\nשעורי הבית: \nסיוט שבועי. השאלות ברמה הרבה יותר קשה מהשאלות במבחנים, ומה שיוצא זה שאתה מקבל שוק מכימיה ובמקום להטמיע את החומר אתה מרוכז בלנסות למצוא רפרנסים או שיפתרו לך בכימיקלי של אס\"ט או בשעת קבלה את השאלה כדי לקבל כמה שיותר ב15% תקף של הש.ב. ושלא נדבר על זה שלפרקים המתרגלים בעצמם לא מצליחים בשאלות, כשהם מודים שאלו שאלות ישנות שנכתבו מזמן. בין כה וכה אתם תסתכלו עוד פעם על השאלות כשתתכוננו למבחן, אז כנראה שככה זה הכי טוב.\nהמבחן: \nמבחן דיי תבניתי בן 20 שאלות שפחות או יותר חוזרות על עצמן ביחס למבחנים(המועטים, מ2020 בלבד. אבל לפחות הסגל, בהובלת טארק, העלה 3 סימולציות עדכניות למודל עם משוב מיידי) מסמסטרים קודמים, אך השאלות הטריקיות הן מאוד טריקיות ומתקילות ומצריכות הבנה עמוקה של החומר, כשלא תמיד יש אותה במלואה.\nהשורה התחתונה: \nבאופן שמאוד הפתיע אותי, הקורס הזה היה לי הקורס הקשה ביותר הסמסטר. כן, אפילו יותר מחדו\"א. ללמוד כימיה זה ללמוד שפה, שהיא מאוד לא אינטואיטיבית ומאוד טכנית עם חישובים מעצבנים שלא תמיד ברור לאן הם מקדמים אותך. נכון, התיאוריה יכולה להיות מעניינת בהרבה מאוד נושאים, אבל אופן היישום שלה מזוויע ומייגע. למי שלמד כימיה בתיכון היה קל באופן מאוד משמעותי לצלוח יותר את הקורס הזה, ולכאלו כמוני שלא למדו כימיה זה היה קורס מזוויע. ותצרפו לזה את העובדה שלומדים את הקורס הזה כקורס חובה בפקולטות כמו הנדסה אזרחית(לא, להנדסת מיפוי וגיאואינפורמציה כמוני אין קשר ולו הקטן ביותר לכימיה) ואווירו. מאוד מאוד מומלץ לעבור על החומר בכימיה לפני הקורס ואולי אפילו לשקול לעשות מבחן סיווג בכימיה לפני כן. תנצלו כל עזרה שיכולה להיות. בתקופת המבחנים אולי תצליחו להפנים את החומר ברמה לתרגל תרגילים, אבל לצערי ככל הנראה נשכח את זה מהר מאוד.", "timestamp": 1715184043968}, {"author": "י", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: מרצה מעולה אבל השעה שלו הייתה ממש מבאסת \n\nשם המתרגל/ת: דנה שקולניק\nחוות דעת - תרגולים: המתרגלת הכי טובה. מסבירה ממש טוב גם חומר מסובך, מהירה מספיק כדי להתקדם אבל מצליחה שכולם יבינו ולוקחת ברצינות כל שאלה של כל סטודנט. התרגולים באווירה כיפית ונעימה.\n\nשעורי הבית: כל שבוע, לא הרבה.\n\nהמבחן: אמריקאי 20 שאלות לא נורא\n\nהשורה התחתונה:", "timestamp": 1715253327807}, {"author": "Daniella Shim'on", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שי מלמצן מוקלט\nחוות דעת - הרצאות: מרצה נהדר, הסביר ממש טוב וממש נהניתי\n\nשם המתרגל/ת: שי מלמצן מוקלט\nחוות דעת - תרגולים: בקיצור שי מלצמן העביר לי את הקורס, המוקלטים של התרגול ישנים אבל אחד לאחד עם התרגולים העדכניים, מאוד עזרו להבין את החומר ומסכמים הכל בתחילת המצגת אז זה ממש נוח, ממליצה אחרי כל הרצאה לראות את התרגול כי זה מאוד עוזר ליישב את החומר\n\nשעורי הבית: אני באתי בלי רקע והיו גליונות שלא הצלחתי לפתור בכלל, הנושאים של תרמודינמיקה, לחץ, שיווי משקל ממש הרגישו פיזיקה והיו ממש קשים. לקראת סוף הקורס נהיים עוד יותר קשוחים מומלת למי שיש זמן ומתקשה ללכת לשעות קבלה\n\n\nהשורה התחתונה: קורס קשה למי שמגיע בלי רקע, מאוד מעניין אבל קשוח.", "timestamp": 1715430523556}, {"author": "יל", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שי מלצמן \nחוות דעת - הרצאות: בסדר גמור , משתדל שהחומר יהיה מעניין \n\nשם המתרגל/ת: ים אלאלוף \nחוות דעת - תרגולים: מעבירה את החומר בצורה טובה \n\nשעורי הבית: גיליונות במודל פעם בשבוע, תלוי בחומר אבל לרוב אפשרי לעשות בלי לשבור את הראש יותר מדי \n\nהמבחן: אין אפשרות ללמוד בצורה נוחה למבחן הזה, לא מעלים פתרונות מלאים וקשה מאוד לשחזר פתרונות או להבין איך לגשת לתרגילים, והחומר במבחנים לא קרוב למה שיש במהלך הסמסטר \n\nהשורה התחתונה: חרא של קורס", "timestamp": 1715705141271}, {"author": "לא כימאי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שי\nחוות דעת - הרצאות: המרצה היחיד שהלכתי אליו הסמסטר, הרצאות ביום שני בערב שלאף אחד אין כוח אליהם, אבל חייב להקשיב. מקריא ממצגת\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: חובה להגיע שעה + קודם, אם לא לא יהיה לכם מקום שתוכלו לשמוע אותה, היא שלעצמה אחלה אבל שואלים אותה מלא שאלות ובקושי מספיקים את המצגת\n\nשעורי הבית: ברובם קלים, לקראת הסוף הרמה עולה אבל הם לא חובה (ממליץ לעשות בכל מקרה)\n\nהמבחן: היה נחמד לגמרי, המטרה הייתה לעבור ועברתי\n\nהשורה התחתונה: קורס פח", "timestamp": 1716297637613}, {"author": "sahar", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נדב אמדורסקי\nחוות דעת - הרצאות: \nאומנם מדבסר במונוטוניות רבה אבל מעביר את החומר בצורה ברורה ועונה על כל שאלה\nשם המתרגל/ת: מעיין סויסה\nחוות דעת - תרגולים: \nמתרגלת מדהימה שבזכותה הצלחתי להבין את כל החומר, עוזרת מלא בשעות קבלה ומעבירה את החומר בצורה ברורה\nשעורי הבית: \nבחלק מהשב יש פער בין מה שמלמדים בתרגולים לשב עצמם שקשים יותר\nהמבחן: \nהיה הוגן מאוד ויחסית קל מבחן אמריקאי של 20 שאלות\nהשורה התחתונה: \nקורס קליל שאפשר להשיג בו ציון גבוה ולדעתי לא גוזל יותר משעתיים ישיבה עליו בשבוע", "timestamp": 1716362369911}, {"author": "סטודנט באוויר", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nמאוד קשה להתרכז בהרצאות, הקורס מאוד תיאורטי וקשה מאוד לקשר את זה בין הנושאים לטבע. כל שיעור עוברים בין נושא לנושא ולכן קשה להטמיע את החומרים.\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים:\nתומר אחלה גבר אבל הוא לא היה מספיק מחובר לקורס הרגיש הרבה פעמים שהוא פותר את השאלות איתנו תוך כדי. אני בהרצאות ובתרגולים לא הבנתי כלום - רק כשעשיתי שיעורי בית הצלחתי.\n\nשעורי הבית: \nשיעורי הבית מאוד מאוד מאוד קשים, ממליץ לשבת ולפתור את כל התרגול לפני שבכלל נגישים לשיעורי בית. \nהמבחן: \nהמבחן מורכב מ20 שאלות אמריקאיות שמסודרות לפי סדר הנושאים שנלמד בקורס, אם עושים מספיק מבחני עבר ואת הסימולציות במודל אפשר לקבל ציון טוב.\nהשורה התחתונה: \nהסגל מלמד את החומר מהמצגות - לא איך לקבל ציון טוב במבחן.", "timestamp": 1716496961136}, {"author": "אבי", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אילי מרכז \nחוות דעת - הרצאות: מרצה נוראית, מקריאה מהמצגת כמו רובוט ואפשר בקלות להירדם בהרצאה \n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: חמוד, מקריא מהמצגת ולא יודע כל כך לענות על שאלות. הרבה פעמים ביקשנו עזרה בשיעורי הבית והביא לנו תשובה לא נכונה.\n\nשעורי הבית: יש קשים יותר יש קלים יותר. הקשים היו קשים ממש, לקח לנו כמה ימים טובים ויש רק 3 ניסיונות.  \n\nהמבחן: ארוך ולא כל כך הוגן. הרגיש כמו ניסיון להכשיל. \n\nהשורה התחתונה: לכו רק לתרגולים ותקראו את המצגות", "timestamp": 1716630949446}, {"author": "Tony", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: סהכ שי מסביר טוב, לדעתי לא חובה להגיע פיזית כי ההקלטות הן בדיוק עם אותו החומר\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: מעין מקסימה ומסבירה בצורה טובה, מרגיש שנותנת אחלה של יחס אישי\n\nשעורי הבית: יחסית קלים, גליון כל שבוע ולא עמוס מדי\n\nהמבחן: סהכ היה די הוגן, יש גם מבחני סימולציה לפני שהם באותה רמה ומכינים טוב\n\nהשורה התחתונה: קורס מקיף עם הרבה חומר אבל אפשר להסתדר בלי להיות עם הלשון בחוץ", "timestamp": 1716706663905}, {"author": "Tom", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שי\nחוות דעת - הרצאות: הכי טוב מבין המרצים אבל השעה שלו קצת קשה\n\nשם המתרגל/ת: ים\nחוות דעת - תרגולים: לא ברור למה אין עליה המלצות אבל היא הכי טובה בפער (בדקתי גם את מעיין וטארק והם לא מתקרבים) מסבירה את החומר מעולה ועונה לשאלות\n\nשעורי הבית: מטרד כל שבוע\n\nהמבחן: הוגן באופן מפתיע, שום דבר חריג, 20 אמריקאיות.  מה שכן צוות הקורס מעלה רק שלוש סימולציות עם פתרונות מלאים וזהו אז קשה ללמוד למבחן\n\nהשורה התחתונה: קורס סביר, ההבנה חשובה יותר מתרגול", "timestamp": 1716833919780}, {"author": "hamode", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שיי\nחוות דעת - הרצאות: מקצועי ומאוד סבלני ואוהב את מה שהוא עושה מסביר כמו שצריך אחלה שי ממליץ בחום\n\nשם המתרגל/ת: טאריק\nחוות דעת - תרגולים: אגדהההה הוא רץ מהר בחומר ומסביר טוב מאוד\n\nשעורי הבית: יש קלים ויש קשים שאי אפשר לפתור\n\nהמבחן: סבבה\n\nהשורה התחתונה: לפתור כמה שאפשר מבחנים והכי חשוב לפתור את הסומליות שהם נותנים בסוף הסמסטר בהצלחה", "timestamp": 1717269803334}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שי מלצמן\nחוות דעת - הרצאות: \nהשעה שלו קצת בעייתית ויש מליון אנשים,\nבאותו שבוע של ההרצה היה מעלה הקלטה מתאימה מסמסטר קודם, הייתי צופה בה לפני התרגול והיה לי אחלה! מסביר הכל בסבלנות ובלי רעש הכיתה\nאם אתם סומכים על עצמכם לצפות בהן כל שבוע לפני התרגול אז אני ממליצה , וכך אז תבואו מוכנים לתרגול\nשם המתרגל/ת: טארק\nחוות דעת - תרגולים: \nמתרגל מעולה ומסביר הכל ועונה על שאלות הסטודנטים בסבלנות\nהבעיה היחידה היתה שהיו אצלו מלא אנשים ולפעמים היה רעש\nשעורי הבית: \nחלק קלים חלק קשים, \nממליצה לפתור ישר אחרי התרגול זה ממש עוזר, גם אם לא תצליחו לפתור הכל ותיעזרו ברפרנס אז אל תתיאשו ותבינו עד הסוף!\nהמבחן: \nהיה ממש אחלה מסיבה אחת : פתרתי כל המבחנים שהעלו לנו + הסימולציות , ולא ויתרתי על להבין כל כל כל שאלה בכל מבחן\n\nהשורה התחתונה: \nאל תשימו הקורס בצד כל הסמסטר ואז כשיגיע המבחן תתחילו ללמוד! לא תספיקו!\nאני אישיתי עשיתי כך : התרגול שלי היה ביום רביעי 14:30\nאז כל יום רביעי 12:30-14:30 הייתי צופה בהרצאה ואז תרגול 14:30-16:30 וישר הייתי מתחילה לפתור תרגיל הבית עד שאסיים אותו!\nלקראת המבחן עברתי בקטנה על החומר, ואז רק התחלתי לפתור את המבחנים עד יום המבחן \n(היה לי שבוע אז יום חזרות והשאר פתירת מבחנים)\nבהצלחה!", "timestamp": 1717931020025}]}