{"posts": [{"author": "כימיהההה", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איזנברג דוד\nחוות דעת - הרצאות: ההרצאות לא תורמות הרבה. אני לא חושב שזה באשמת המרצה אלא מאחר שההרצאות באורך של שעה.\n\nשם המתרגל/ת: אילן אמיר\nחוות דעת - תרגולים: מתרגל מעולה! מעביר את התרגולים בכיף, יודע את החומר בצורה טובה מאוד. עונה על כל שאלה. אני ממליץ עליו מאוד.\n\nשעורי הבית: קלילים\n\nהמבחן: המבחן שהיה לנו הזניח לגמרי חצי מהקורס והתמקד בעיקר בטיטרציות. אז לקראת המבחן ממליץ לוודא שיודעים את כל החומר ב-100% ולא לסמוך על כך שיודעים נושא מסוים.\n\nהשורה התחתונה: בשביל מי שעשה יסודות הכימיה א' וב' הקורס ממש ממש ממש מיותר ולא מחדש שום דבר. אבל בשביל מי שלא הקורס הזה מעולה.", "timestamp": 1634899514541}, {"author": "ליאור", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: גרוע מאוד. לא רלוונטי. עדיף לקרוא מצגת לבד יהיה ברור יותר\n\nשם המתרגל/ת: אמיר\nחוות דעת - תרגולים: לא מוצלח במיוחד\n\nשעורי הבית: קשים מאוד, גליון כל שבוע ודורש כמה שעות\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1658424433499}, {"author": "ב", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שעורי הבית: קשים יחסית לקורס של 1.5 נקז\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קורס מיותר", "timestamp": 1659094086683}, {"author": "חאריס", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: חאריס\nחוות דעת - הרצאות: מוריס בעל ידע רב, אבל ההרצאות מאוד לא מתאימות לחומר שבאמת צריך לדעת בשביל המבחן. אפשר לוותר אם יש מקור יותר טוב.\n\nשם המתרגל/ת: אמיר\nחוות דעת - תרגולים: לזרוק לפח. אין יכולת הסברה ואין יכולת כתיבה על לוח. הבעיה שאין מרצים אחרים יותר טובים. כל צוות הקורס פשוט גרוע.\n\nשעורי הבית: סבל שלא יתואר\n\nהשורה התחתונה: הקורס הכי מסריח בקמפוס, 1.5 נקז שחושב שהוא לפחות 5. פשוט הכל גרוע, אני מצטער שיש סטודנטים וסטודנטיות שחייבים לקחת את הקורס פוייה הזה.", "timestamp": 1659298640421}, {"author": "(;", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: זוועה. עושה רושם שמוריס יהיה אחלה מרצה בקורס אחר, אבל כאן זה פשוט לא עבד. ההרצאות לא רלוונטיות ולא תורמות להבנת החומר לדעתי, ולכן בשלב מסוים הפסקתי להגיע.\n\nשם המתרגל/ת: גלעד/אמיר\nחוות דעת - תרגולים: שניהם לא הטובים ביותר שפגשתי. לא ממליץ על אף אחד מהם.\n\nשעורי הבית: זוועה. כל שבוע גיליון, ויש שבוע להגיש. חלק מהגליונות קלים אבל חלק לא מצדיקים את משקל הקורס.\n\nהמבחן: לא מכשיל במיוחד. די טכני אז לחרוש מבחנים.\n\nהשורה התחתונה: זבל של קורס. סגל לא מוצלח במיוחד, שיעורי בית שמוציאים את הנשמה, וחומר שגורם לך לתהות למה רצית ללמוד כימיה מלכתחילה, וכל זה בשביל נקז וחצי. \nזה פשוט קורס הכלאה של כל הנושאים המסריחים ביסודות א׳ וב׳ אז למי שעשה את שניהם הקורס מיותר כמעט לחלוטין..", "timestamp": 1659603194019}, {"author": "Shir", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: מה אפשר לומר על קורס שיש בו הכל?\nגיליון ארוך עמוס וקשה כל שבוע\nמרצה שלא יודע להרצות\nמתרגלים שלא בטוחים בחומר\nתרגילי בונוס ברמה של סוף תואר שבקושי נותנים בונוס\nקורס הזיה שחש את עצמו קורס של 5 בזמן שהוא 1.5.\n\nועוד קצת על מוריס- מרצה גאון (כמובן) שלא יודע להסביר כלום ושום דבר. הוא בא לעשות צחוקים על חשבוננו ועם כמה שהוא חמוד ההרצאות שלו פשוט נוראיות.\nכמה שניסיתי להיות על זה ולשאול שאלות, מרוב הפער ביננו מוריס לא הבין מה אני שואלת ועונה תשובה לא קשורה בעליל. נהדר.\nנ.ב. - לא לצאת החוצה, מוריס מתחיל לשאול למה יוצאים וזה לא לחלשים.\nשם המתרגל/ת: גלעד\nחוות דעת - תרגולים: מתרגל ככה ככה, העדפתי אותו מאשר אמיר (למרות שהרב העדיפו את אמיר). ביננו, שניהם לא משהו אבל חייבים תרגולים בשביל לנסות להבין משהו לפחות כי בהרצאות לא מבינים כלום.\n\nשעורי הבית: גיהנום. חייבים 10 גיליונות רק בשביל לגשת למבחן. כל גיליון שעות רבות שיוכלו להיות מושקעות בקורסים יותר חשובים.\n\nהמבחן: דווקא בסדר? יחסית דומה לשנים הקודמות. \n\nהשורה התחתונה: לא לקחת אבל אין ברירה.", "timestamp": 1659614949027}, {"author": "...", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מוריס אייזן\nחוות דעת - הרצאות: ההרצאות קצת מתישות, אבל לפחות הן רק שעה בשבוע. יש לפחות שתי הרצאות בקורס שחוזרות על החומר של יסודות הכימיה. מה שכן, מומלץ לא להתייאש מההרצאות כי היו לנו שאלות במבחן על חומר שעברנו עליו רק בהרצאה (דברים שלא תרגלנו בתרגול ולא בשיעורי בית.\n\nשם המתרגל/ת: גלעד גני\nחוות דעת - תרגולים: קצת מבולגן, לפעמים לא מסביר הכי ברור ומרגיש שיש נקודות בחומר של הקורס שלא יושבות אצלנו ב100%. כמעט אף פעם לא היה מספיק לסיים את התרגילים של התרגול. בכללי התרגולים מאוד עמוסים ביחס לשעה שיש להם בשבוע, והרבה מהתרגילים מתעסקים בדברים שהם מסביב לחומר (המון סטויכומטריה!!!) ולא בחומר עצמו)\n\nשעורי הבית: עומס לא סביר ביחס לקורס של נק\"ז וחצי. יש גיליון במודל כל שבוע וחובה לפתור לפחות 10 כדי לגשת למבחן. חלק מגיליונות מצריכים עבודה של מעל לחמש שעות, ומאוד קל להתבלבל בחישובים.\nבמהלך הסמסטר היו גם שלושה תרגילי בונוס. תרגילים קצת מוזרים, והיו איתם קצת קשיים לוגיסטיים בהתחלה, אבל בסופו של דבר אפשר להשיג מהם עד 5 נקודות לציון הסופי של הקורס שזה נחמד.\n\nהמבחן: מבחן אמריקאי עם 12 שאלות, חלקן חישוביות חלקן תיאורטיות. אפשר להגיע לציונים גבוהים, אבל גם מאוד פשוט ליפול בחלק מהשאלות על שטויות.\n\nהשורה התחתונה: לומדים חומר חשוב בקורס, אבל הקורס מאורגן בצורה מאוד בעייתית, בעיקר בגלל שהוא לא שווה הרבה נק\"ז (ואז אין מספיק שעות תרגול, והעמוס ש\"ב לא הגיוני ביחס למשקל הקורס)", "timestamp": 1662364730102}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: מוריס אייזן\nחוות דעת - הרצאות: לא ממש הקשבתי, מוריס חמוד אבל הוא מעביר את החומר בצורה מסובכת ומשעממת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים יותר ממה שראוי שיהיה לקורס של נקז וחצי\n\nהמבחן: פייר וקצת ממוחזר\n\nהשורה התחתונה:", "timestamp": 1664298347910}, {"author": "שלומקה", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מוריס\nחוות דעת - הרצאות: לא ברור בכלל\nלא מבינה מה שמו אותו באנליטית הוא לא מבין בזה.. וגם מדבר ממש חזק ולא ברור כדי להראות שישלו קריזמה אבל זה ממש לא עובד\n\nשם המתרגל/ת: גלעד\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: מזעזעיםםםםםם\n\nהמבחן: לא כיף בכלל\n\nהשורה התחתונה: קורס מזעזעעעע השקעתי בו ובמבחן הכי הרבה הסמסטר והוא כולה נקז וחצי שמרגיש כמו 5!!!!", "timestamp": 1665229852406}, {"author": "הבמ", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מוריס אייזן\nחוות דעת - הרצאות: חומר קשה להבנה אך לא צריך להבין אותו. אווירה טובה, מצחיק.\n\nשם המתרגל/ת: אמיר \nחוות דעת - תרגולים: נחמד באווירה טובה\n\nשעורי הבית: הרבה\n\nהמבחן: בסדר\n\nהשורה התחתונה: עמוס מדי בשביל נקודה וחצי, לא צריך להילחץ", "timestamp": 1666287228266}, {"author": "דבורית", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עידו גילרי \nחוות דעת - הרצאות: שעה אחת של הרצאה אז לא מספיקים יותר מידי, אבל המצגות שלו ממש טובות וכותב מאוד מסודר על הלוח. \n\nשם המתרגל/ת: אוריה \nחוות דעת - תרגולים: לא מועילים בכלל, מספיקים שאלה אחת בלחץ. לפעמים השאלות שהיא פתרה איתנו הם בדיוק אותם שאלות מההרצאה ולכן הרגיש כמו בזבוז זמן. לרוב אם שאלו אותה שאלות במהלך התרגול היא לא ידעה לענות. מתעכבת על החומר הקל במקום הקשה ואז כשמגיעים לשיעורי בית לא מצליחים. \n\nשעורי הבית: הסמסטר החליטו להמעיט בכמות שיעורי הבית אבל אלא שכן היו, היו דיי קשים. \nבנוסף היו שתי הדמיות מעבדה, אחת הייתה בזמן סביר והשנייה פורסמה כמה ימים לפני סוף סמסטר כשההרצאה בנושא הייתה ביום האחרון של הסמסטר. \n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1691754461115}, {"author": "עדן", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עידו\nחוות דעת - הרצאות: לא מועילות בכלל, כתב לא ברור ומסביר בצורה די משעממת \n\nשם המתרגל/ת: אוריה\nחוות דעת - תרגולים: זוועה, הייתה תמיד נתקעת על שאלות ולא מסבירה טוב בכלל\n\nשעורי הבית: \n\nהמבחן: מזעזע. לא קרוב אפילו לרמות התרגולים\n\nהשורה התחתונה: קורס של נקז וחצי אבל סיוט. החומר מועבר בצורה לא טובה בכלל מה שמקשה מאוד על הסטודנטים. הסגל לא משקיע ועונה על שאלות רק כי הוא חייב.", "timestamp": 1704200263324}]}