{"posts": [{"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: מאוד מתמטיות, יחסית משעמם. ההרצאות האחרונות מדברות על יישומים (וגם יותר מעניינות). \n\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: מאוד חד על החומר, כותב קצת בבלאגן. אפשר להוריד מהדרייב את הפתרונות לפני התרגול ואז יותר קל לעקוב.\n\nשעורי הבית: ממוחזרים, לא הרבה עבודה. יחסית דומים למבחנים. \n\nהמבחן: מועד א' היה סביר, מועד ב' קשה מאוד. חלק מהשאלות מתבססות נטו על לזכור פיתוח מהתרגול/הרצאה ולא על ידע (=לשנן). שאלות אמריקאיות שחלקן ממוחזרות, אבל בקושי קשורות לחומר. הסמסטר הוסיפו שאלה תאורטית פתוחה של לשרטט גרף שראינו בהרצאה, אז רצוי לשנן. \n\nהשורה התחתונה: קורס חובה, אז זה מה יש - להגיע לתרגולים ולהבין את המהות של ההרצאות + פיתוחים שנראים סבירים.", "timestamp": 1616311100825}, {"author": "אין ברירה זה מה יש", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אפרת \nחוות דעת - הרצאות: \nלא כל כך מועיל הרבה מאד התעסקות בדברים לא חשובים במהלך השיעור, שווה בסוף לעבור על הפיתוחים ולהבין איך עושים אותם\nשם המתרגל/ת: אנטון\nחוות דעת - תרגולים: תרגולים טובים. קשה לכסות על כל החומר של ההרצאות בזמן כל כך קצר ולכן אי אפשר לבנות על התירגולים בלבד בשביל להבין הכל\n\nשעורי הבית: \nמועילים, חשוב לוודא שגם מבינים את העיקרון של מה שעושים בדפים ולא סתם מרפרנסים\n\nהמבחן: הוגן אבל לא פשוט\n\nהשורה התחתונה:  קורס קשוח יחסית", "timestamp": 1644416268264}, {"author": "אני", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פרופ. ליפשיץ אפרת   \nחוות דעת - הרצאות: \nפרופ. אפרת היא מרצה די טובה ובסה\"כ היא מסבירה את החומר, אבל היא בדרך כלל די מונוטונית לדעתי, אז לא פשוט להתרכז בהרצאות שלה.  \n\nשם המתרגל: אנטון ציגנוק   \nחוות דעת - תרגולים: \nמתרגל טוב שיודע להסביר את החומר. קחו בחשבון שכל החלק החישובי ותכלס מה שצריך לעשות ברוב החלקים של המבחן נלמד בתרגולים, אז ההמלצה שלי היא לא לפספס אותם.  \n\nשיעורי הבית: \nממוחזרים, אבל ההמלצה שלי היא לנסות ולפתור כמה שיותר מהם לבד. בסופו של דבר, רובם די דומים למה שתראו במבחן.  \n\nהמבחן: \nלא פשוט בכלל, אבל הוגן. אם למדת ותרגלת מספיק מבחנים משנים קודמות, כנראה שתצליח.י לעבור את ה- 65 - 70. הבדיקה לא קוטלת, סה\"כ הוגנת ואפילו מפרגנת בדרך כלל.  \n   \nהשורה התחתונה:  \nקורס קשוח. הוא אמנם מעניין, אבל אם הוא לא חובה אצלכם.ן, תחשבו פעמיים (ואפילו שלוש), לפני שתיקחו אותו. \nלמי שזה קורס חובה אצלו.ה - עברנו את זה, גם את.ה תצליח.י. \nבהצלחה :)", "timestamp": 1647174110553}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אפרת ליפשיץ\nחוות דעת - הרצאות: ארוכות ולא יעילות\n\nשם המתרגל/ת: אריאל לייפר\nחוות דעת - תרגולים: התרגולים חשובים\n\nשעורי הבית: לרוב הם היו מעיקים אבל סבילים ביותר\n\nהמבחן: מתוך 3 שאלות פתוחות, 2 מהם היו שאלות שראינו כבר. מבחן בסדר גמור\n\nהשורה התחתונה: קורס חשוב, ההרצאות אולי פחות", "timestamp": 1677673150715}, {"author": "סתם סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה:  אפרת\nחוות דעת - הרצאות: ארוכות עם מלא מתמטיקה אי אפשר להבין מה חשוב ומה לא, ומבחן יש שאלות אמרקיוצ שקשורות להרצאות שאפילו דברים שלא הסבירה כמו שצריך. אומרים לנו להיעזר ב 3 ספרים כל אחד מסובך יותר מהשני.\n\nשם המתרגל/ת:  אריאל\nחוות דעת - תרגולים: לא כל כך טוב ולא כל כך רע אבל חשוב להיות נוכח.\n\nשעורי הבית: יש רפרנס ועוזרים להבנת החומר קצת.\n\nהמבחן: אפשרי אבל צריך הרבה הרבה השקעה ומזל באמרקאי\n\nהשורה התחתונה: קורס קשוח ולא כייפי.", "timestamp": 1677953154210}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אפרת \nחוות דעת - הרצאות: לא הייתי, ראיתי הקלטות על פי 2. אני הרגשתי שזה תרם לי כי זה גם קורס מעניין בעיניי אבל בתכלס ההרצאות לא כאלה  קריטיות, היא לא מפתחת מאפס בעיקר מראה משוואות אז קשה לעקוב ככה אבל כן מתעכבת על החומר התיאורטי מבחינת קונספטים שזה די חשוב \nשם המתרגל/ת: אריאל\nחוות דעת - תרגולים: הדעות עליו היו מאוד חלוקות. אני אהבתי, אומנם הוא לא לגמרי היה על החומר וזה יכול לגרום בלבול למי שלא עוקב, אני הצלחתי לעקוב אחריו גם ההרצאות עוזרות בזה ואז הוא אחלה מתרגל באמת רוצה לעזור ולהסביר ובא לקראת\n\nשעורי הבית: מרופרנסים ברובם, בדרך כלל אריאל מוסיף שאלות תיאורטיות חדשות\n\nהמבחן: היה יותר ארוך מבדרך כלל כי הוסיף עוד 2 אמרקאיות. האמריקאיות זה החלק הקשה של המבחן כי הם מאוד מבלבלות וקצת מרגיש שמנסים להפיל על מילה פה מילה שם ולא באמת מעיד על הבנה. פשוט לתרגל כמה שיותר אמרקאיות ולקוות שימחזרו/יעשו משהו דומה. בפתוחות הייתה אחת אחד לאחד מהשיעורי בית וממש דומה למועד ב של שנה לפנינו(שלא פרסמו את הפתרון שלו כנראה בכוונה), עוד אחד קצת יותר מאתגרת ועוד אחת גם דומה למועד ב של שנה לפנינו, סך הכל סבבה \n\nהשורה התחתונה: קורס מעניין ממש למי שאוהב קוונטית זה ממש השילוב של קוונטית בתוך עולם החומרים ומוליכים למחיצה. אפשר לקבל בכיף 85+", "timestamp": 1714296253348}, {"author": "is", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: רואים שהיא מבינה את החומר אבל היא לא יודעת להסביר. כששואלים אותה שאלות היא עונה על דברים אחרים לא קשורים\nהיא איטית ממש, עדיף לראות הקלטות על כפול 2\n\nשם המתרגל/ת: אריאל\nחוות דעת - תרגולים: אריאל מושלם\nממש מתחשב ומסנה לעזור\nלפעמים בתרגולים הוא קצת התבלבל אבל הסביר ממש טוב\n\nשעורי הבית: לא משהו\n\nהמבחן: השאלות האמריקאיות מזעזעות אבל חוץ מזה השאלות הפתוחות היו ממוחזרות ולא היה משהו מפתיע\n\nהשורה התחתונה: קורס סופר מעניין \nצריך ללמוד את החומר התיאורטי של ההרצאות כדי להצליח אבל לא ללכת להרצאות, התרגולים ממש חשובים ומלמדים", "timestamp": 1714557234876}, {"author": "ליאור מאיר", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: הרצאות ארוכות עוברים על הכל תאכלס בתרגול לא הרגשתי צורך להגחע\n\nשם המתרגל/ת: אריאל לייפר\nחוות דעת - תרגולים: תרגולים מעולים מתרגל בדיוק מה שצריך אחכ לשיעורי בית ולמבחן, מתרגל ממש אכפתי\n\nשעורי הבית: ארוכים אבל יש רפרנסים\n\nהמבחן: דיי הוגן, חוזר על עצמו לאורך השניל\n\nהשורה התחתונה:", "timestamp": 1715192137424}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: קשה להקשיב בהרצאות, אפרת מדברת הרבה אבל נותנת מעט מידע, ויתרתי מהר מאוד על ההרצאות\n\nשם המתרגל/ת: אריאל\nחוות דעת - תרגולים: אריאל מדהים. מאוד אכפת לו מהסטודנטים והוא גורם לחומר להיות מעניין. לפעמים הוא מתבלבל תוך כדי התרגול אבל מפצה על זה די טוב לדעתי\n\nשעורי הבית: חשובים להבנת החומר, לא קשים מדי ויש רפרנסים יחסית מובנים\n\nהמבחן: ממוחזר מלפני שנה, מי שלמד כמו שצריך הוציא ציון טוב בלי יותר מדי טריקים\n\nהשורה התחתונה: קורס מעניין מאוד ומאתגר אבל בקטע טוב", "timestamp": 1716469697213}]}