{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שי\nחוות דעת - הרצאות: מעניינות, לעתים קצת הולכים לאיבוד בדוגמאות. \n\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: עשינו עבודה עצמאית בזמן התרגול, זה לא מדהים - חרגנו לא מעט מהזמן ולא תמיד הצלחנו. אולי אם יהיו פתרונות זה יזרום יותר. \n\nשעורי הבית: תרגילים בזזוגות. יש הרבה זמן להגיש והתרגילים (למעט האחרון) לא מאוד קשים. צריך לדעת פייתון לפני הקורס. \n\nהמבחן: עבודה ואז הצגה שלה בכיתה. בוחרים נושא ביולוגי וכותבים קוד בתור פתרון. מעניין, אבל שיטת הניקוד לא מאוד ברורה. הציונים היו טובים בסה\"כ. \n\nהשורה התחתונה: קורס טוב - בדיוק מה שצריך בשביל להתנסות בפייתון ובחבילות הרלוונטיות לשאלות ביולוגיות. הקורס לא מאוד עמוס אם מגיעים עם הרקע בפייתון.", "timestamp": 1616313384153}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שי\nחוות דעת - הרצאות: הנושאים מעניינים, המרצה מסביר לאט וברור.\n\nשם המתרגל/ת:  הדס\nחוות דעת - תרגולים: בתרגולים עובדים יחסית עצמאית והמתרגלת עוברת בין הסטודנטים. זה עוזר בשביל שיעורי הבית.\n\nשעורי הבית: בפייתון, למישהו עם נסיון בתכנות הם לרוב לא מאד מסובכים. למישהו בלי נסיון עלול להיות קשה.\n\nהמבחן: אין מבחן, יש פרויקט, אפשר לבחור איזה נושא שרוצים. גודל הפרויקט מאד סביר (לא עמוס מדי)\n\nהשורה התחתונה: מומלץ, מעניין", "timestamp": 1616431269543}, {"author": "anonymous", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שי\nחוות דעת - הרצאות: \nהרצאות מעניינות , נשמע בהצלחה קצת קשה ויש הרבה פייתון , אבל זה מסתדר עם הזמן , שי מאוד נחמד ועוזר אם שואלים אותו\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: \nהדס מהממת \nשעורי הבית: \nקצת ארוכים אבל הדס תמיד עוזרת אם שואלים אותה , יש הרבה חלקים שאפשר פשוט להעתיק מהתרגולים , והציון הוא בינאר עובר לא עובר (עובר מקבל 100)\nהמבחן: \nאין מבחן יש עבודה בזוגות, לא יותר מדי ארוכה , ומקבלים ציונים טובים\nהשורה התחתונה: חבל לפספס", "timestamp": 1643190866952}, {"author": "גזר", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שי\nחוות דעת - הרצאות: ההרצאות נותנות רקע בהרבה נושאים במדעי המחשב בלי להיכנס לפרטים יותר מדי, בקטע טוב. הסמסטר היו גם הרצאות אורח של מרצים אחרים, מי שהגיע בשביל להרחיב אופקים הרוויח.\n\nשם המתרגל/ת: פלג\nחוות דעת - תרגולים: בתרגולים יש הרבה עבודה עצמית ופלג עוזרת מאוד.\n\nשעורי הבית: השיעורי בית מבוססים על העבודה העצמית בתרגולים, הוגנים מאוד, עם הדרכה מפורטת, ונותנים ניסיון פרקטי בפייתון\n\nהמבחן: אין מבחן, יש פרויקט שצריך להציג ולהגיש. זה הפרויקט הכי מהנה שעשיתי בטכניון- אין הגבלה על הנושא הביולוגי שצריך לחקור או על הכלים שאפשר להשתמש בהם, אפשר להיות מאוד יצירתיים ועל הדרך להוסיף פרויקט קטן לרזומה. קביעת הציון לא ממש ברורה אבל גם לא מקבלים ציון נמוך.\n\nהשורה התחתונה: כדאי להסתכל על הקורס הזה כקורס פרקטי בפייתון ובביולוגיה חישובית, לדעתי זה קורס מתנה לכל מי שבמסלול ביולוגי כזה או אחר, במיוחד אם אין להם רקע במדמח. אמנם זה קורס קל יותר עם רקע, אבל תמיד כדאי ללמוד דברים חדשים, ותכנות נראה פחות מפחיד אחרי שמצליחים להריץ משהו מגניב.", "timestamp": 1680171278149}]}