{"posts": [{"author": "קיץ", "difficultyRank": 3, "generalRank": 4, "semester": "202003", "text": "שם המתרגל/ת: \nחוות דעת - תרגולים: ענבר מתרגלת מעולה \n\nשעורי הבית: ברובם מבוססים על טריקים ומלכודות, השאלות נראות תמימות אבל דורשות להכיר טוב את החומר ומדי פעם להציץ בהרצאות בשביל לוודא שלא מפספסים.\n\nהשורה התחתונה: קורס מעניין שעוסק בהרבה סטטיסטיקה על הדרך.", "timestamp": 1601665885042}, {"author": "אמיר", "difficultyRank": 4, "generalRank": 4, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין הרבה תרגילים, אבל כל אחד היה מאוד ארוך עם בדיקה רצחנית\n\nהמבחן: \nפרויקט במקום מבחן, היה בסדר גודל של תרגיל בית + סיכום על אחד מהניסויים החשובים בקורס\nהשורה התחתונה: קורס מעניין מאוד מבחינת נושא הקורס, לא פשוט אבל גם לא מסובך למי שעוקב במהלך הסמסטר", "timestamp": 1603523098627}, {"author": "student", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: יש רק מרצה אחת. ההרצאות לא מלהיבות. 3 שעות יותר מדי לראות לייב, בקצב דיבור איטי כזה. \n\nשם המתרגל/ת: בלה \nחוות דעת - תרגולים: עניינית והכל מובן איתה.\n\nשעורי הבית: הייתה בעיה רצינית עם בודקי תרגילי הבית, מורידים על כל שטות. אבל התרגילים עצמם עוזרים מאוד להבנת החומר.\n\nהמבחן: \n\nהשורה התחתונה: אם זה קורס בחירה בשבילכם, ואתם לא בטוחים אם לקחת, אל תקחו.", "timestamp": 1612894058971}, {"author": "Lama kacha chazak", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: איילת\nחוות דעת - הרצאות: מלמדת יחסית לאט ובלי יותר מידי עניין. סביר כשאפשר לראות על *1.75\n\nשם המתרגל/ת: בלה\nחוות דעת - תרגולים: מדהימה. עוזרת לכל מה שצריך והסיבה היחידה שעברתי את הקורס הזה\n\nשעורי הבית: קשים מאוד על מנת להכין למבחן אבל הניקוד מתקטנן על כל שטות וממש מחפשים על מה להוריד (ציון תקף 30%)\n\nהמבחן: נפלנו על מבחן קורונה שנראה כאילו בנו אותו במיוחד כדי להכשיל אותנו. מחולק ל2 חלקים שלכל חלק 2 שאלות ומותר רק שעה. לחץ מטורף של זמן והמבחן מאוד קשה ובמיוחד בזמן הנתון.\n\nהשורה התחתונה: צוות מדהים של מתרגלות. אך לצערי עושה רושם שמישהו בצוות של הקורס ממש מנסה למרר את החיים של הסטודנטים ולהקשות בכל דרך אפשרית. מי שלא חייב שלא יקח.", "timestamp": 1613129214610}, {"author": "student", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: ללא עניין, מדברת לאט, אין התחשבות בסטודנטים.\n\nשם המתרגל/ת: בלה\nחוות דעת - תרגולים: אין על בלה בכל העולם! הכי מדהימה שיש, רק בזכותה הצלחתי להנות ולעבור את הקורס. \n\nשעורי הבית: לוקחים הרבה זמן בגלל הנימוקים המפורטים שסגל הקורס דורש, מורידים ניקוד על כל דבר קטן, מגבילים בעמודים ולא בודקים אם יש חריגה של שורה אחת אפילו.\n\nהמבחן: קשה, ארוך , חסר זמן, הגבילו לענות עד עמוד לשאלה ולא עדכנו מראש את הסטודנטים.\n\nהשורה התחתונה: קורס שהיה יכול להיות נהדר אם לא היחס של צוות הקורס כלפי הסטודנטים. יש לציין כי צוות המתרגלות מעולה.", "timestamp": 1613135884111}, {"author": "Someone", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: מאוד איטית וקשה לשרוד 3 שעות, אם אפשר לראות הקלטות במקום ללכת ללייב אני ממליץ.\n\nשם המתרגל/ת: שאילה רויטמן\nחוות דעת - תרגולים: מאוד נחמדה, מסבירה טוב את החומר, עונה לשאלות, ממליץ ללכת.\n\nשעורי הבית: לא פשוטים והבדיקה קטלנית, צריך לשים לב מאוד למה שרושמים ואיך שרושמים אותו אחרת הולכות נקודות לפח.\n\nהשורה התחתונה: קורס מעניין אבל הסגל לוקח אותו יותר מדי ברצינות וצריך להתמודד איתו בהתאם.", "timestamp": 1613412557432}, {"author": "Dominant(Is)Negative", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אילת\nחוות דעת - הרצאות: אילת חמודה ממש, הרצאה קצת איטית, מומלץ לראות על X2 (גם למי שרגיל לראות על X1.5).\n\nחוות דעת - תרגולים: אין צורך להגיע.\n\nשעורי הבית: קלילים, לוקח שעתיים פלוס מינוס לפתור.\n\nהמבחן: קל מאוד. \n\nבאופן כללי ההשקעה שלי בקורס הסתכמה בלתת פוש פעם בכמה שבועות (הרצאות X2 + תרגיל בית) לאיזה חצי יום/יום + למידה יומיים לפני המבחן (אבל זה משהו סובייקטבי וזה משתנה מבן אדם לבן אדם), קיבלתי תמורה יפה מאוד יחסית להשקעה (משהו שלא רואים בהרבה קורסים).\nהחומר בקורס קצת משעמם ולפעמים מעצבן (כמו כל קורס בביולוגיה) אבל אני כן רואה איך החומר הזה פוגש אותי בהמשך וזה חומר שיחסית די חשוב להכיר.\nהשורה התחתונה: בהצלחה((((;", "timestamp": 1613568206992}, {"author": "אנונימוס", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: הרצאות ממש מעניינות, משלבת גם שאלות תוך כדי, עוזר להיות בפוקוס על החומר.\n\nשם המתרגל/ת: בלה בן עוז\nחוות דעת - תרגולים: מתרגלת מדהימה, משתמשת במצגות ממש מעולות שעושות סדר בחומר, התרגולים סופר חשובים כדי לדעת להתמודד עם שאלות.\n\nשעורי הבית: 6 גליונות, בדיקה מאוד מאוד קפדנית. כמה שעות עבודה + שעת קבלה לסגירת קצוות וזה סבבה.\n\nהמבחן: סבבה, חשוב להבין את החומר וכמובן לפתור מבחנים קודמים (לסמסטר חורף רלוונטיים בעיקר מבחני חורף) כדי להבין את רוח השאלות.\n\nהשורה התחתונה:", "timestamp": 1614357059094}, {"author": "גבריאל", "difficultyRank": 3, "generalRank": 1, "semester": "201902", "text": "שם המרצה: נביה איוב\nחוות דעת - הרצאות: מעניינות, קצת ארוכות\n\nשם המתרגל/ת: ענבר ערמן\nחוות דעת - תרגולים: מאוד טובה, מסבירה טוב מאוד ועוזרת למי שלא מבין\n\nשעורי הבית: לא פשוטים \n\nהמבחן: קשה, לדעתי בנוי ממש כדי להכשיל סטודנטים ולא כדי לבדוק ידע או הבנה. בסמסטר קורונה היה אפילו יותר גרוע כי קיצרו את המבחן ככה שהיו לנו רק 2 שאלות בעלות 3-4 סעיפים כל אחת עם תלות בין סעיפים, ככה שאם נפלת בשטות קטנה בסעיף אחד יש מצב שנפלת בכל השאלה ונכשלת אוטומטית. דבר הזוי ממש... \n\nהשורה התחתונה: אם לא חובה לכם אז לא מומלץ לקחת, בפרט עם נביה בתור מרצה. \nמה שבאמת היה מעצבן עם המרצה הזה (חוץ מהמבחן) היו 2 בחנים מגן במהלך הסמסטר של 15 דקות כל אחד לא פתירים בכלל בזמן הזה, וזה פשוט בושה שהמרצה גם לא הסכים לתת הארכת זמן למי שבעל אישור לזה, ממש זלזול בסטודנטים שאף פעם לא ראיתי דבר כזה במהלך התואר.", "timestamp": 1614780010299}, {"author": "מורן ויצמן", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: ההגשות השבועיות עמוסות וכבדות. הקורס מצריך השקעה בהבנת החומר אך מעניין מאוד. המבחן לא כל כך פשוט.", "timestamp": 1615715449531}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: מרצה מדהימה, מעוררת עניין במקצוע\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615971244679}, {"author": "כדדשדגכ", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אילת\nחוות דעת - הרצאות: משעממת\n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: אחלה\n\nשעורי הבית: חופרים ובודקים אותם ממש בקפדנות\n\nהמבחן: המועד א היה סבבה, מועד ב היה שטן\n\nהשורה התחתונה:", "timestamp": 1616327559491}, {"author": "ז. כהן", "difficultyRank": 3, "generalRank": 5, "semester": "201903", "text": "שם המרצה: עידן ילין\nחוות דעת - הרצאות: מרצה מרתק, הרצאות מעולות, מסביר את החומר כמו שצריך ומוסיף מדי פעם העשרה נחמדה.\n\nשם המתרגל/ת: ענבר ערמן\nחוות דעת - תרגולים: התרגולים מאוד תורמים ללמידה, ענבר מאוד נחמדה (בבדיקה של התרגילים קצת פחות D;).\n\nשעורי הבית: השיעורים נראים תמימים אבל הם דורשים הבנה מאוד מעמיקה של החומר והבדיקה ממש קפדנית ומדוקדקת אבל בסופו של דבר די הוגנת.\n\nהמבחן: לא היה מבחן אלא עבודה מסכמת שכללה שאלות בסגנון תרגילי הבית ומטלת סיכום על אחד מהניסויים המרכזיים שהופיעו לאורך הקורס.\n\nהשורה התחתונה: קורס מומלץ מאוד לכולם, גם אם זה לא ה-cup of tea שלכם - פשוט חוויה!", "timestamp": 1619277198313}, {"author": "כרומוזום", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דדי\nחוות דעת - הרצאות: מרצה מעולה, הרצאות מעניינות אבל די מיותרות. אפשר להיכנס רק לתרגולים ועדיין לקבל 90+ במבחן.\n\nשם המתרגל/ת: בלה\nחוות דעת - תרגולים: מתרגלת ממש טובה, עושה סיכומים קצרים לפני כל תרגול שמכסים את כל החומר שנלמד בהרצאה. \n\nשם המתרגל/ת: ענבר (זום)\nחוות דעת - תרגולים: מעולה.\n\nבאופן כללי הצוות בקורס היה מדהים.\n\nשעורי הבית: 5 תרגילי בית קשים וארוכים, במיוחד האחרון. הבדיקה מאוד דקדקנית ומורידים על כל דבר קטן. אבל חשוב לנסות ולעבור עליהם הרבה לבד כי זה מה שעוזר להבין את החומר.\n\nהמבחן: זה היה מבחן ראשון של דדי והמבנה היה קצת שונה. הייתה שאלה אחת פתוחה שהייתה קשה והשאר אמריקאיות שהיו די דומות לשאלות משנים קודמות. \n\nהשורה התחתונה: קורס מעניין ומומלץ בתור בחירה מדעית. הרצאות מיותרות ולכן תרגול של שעה בשבוע + 5 תרגילי בית לגמרי שווים את הנק\"ז.", "timestamp": 1629020027825}, {"author": "עפרה", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אילת\nחוות דעת - הרצאות: לא הלכתי בכלל ולא עברתי על המצגות. לדעתי מיותרות לגמרי כי חוזרים על הכל בתרגולים.\n\nשם המתרגל/ת: בלה\nחוות דעת - תרגולים: הכי ברורה והכי טובה שיש. ממליצה ממש את התרגולים שלה.\n\nשעורי הבית: לא כזה ארוכים כמה שעות מספיקות כדי לסיים אותם. ממש מומלץ לעשות אותם כי יש בידיוק אותו סוג של שאלות במבחן הסופי.\n\nהמבחן: הוגן. שאלות שלמדנו לפתור בתרגולים ושיעורי בית.\n\nהשורה התחתונה: קורס ממש מעניין ולא קשה.", "timestamp": 1645019047059}, {"author": "Eran Karan", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אילת לם\nחוות דעת - הרצאות: לא הייתי (קראתי סיכומים)\n\nשם המתרגל/ת: בלה בן-עוז\nחוות דעת - תרגולים: מצוינים, בלה מתרגלת ממש ממש טובה ומסבירה את החומר הרלוונטי למבחן בצורה ברורה. המלצה ענקית על בלה.\n\nשעורי הבית: לא קשים מידי אבל צריך להיות על החומר.\n\nהמבחן: הוגן, הרבה שינון של מקרים אבל סה\"כ דיי חזרתי אם מתרגלים מספיק.\n\n\nהשורה התחתונה: אחלה קורס לסגור איתו שרשרת מדעית (שמעתי שפיזיקה 3 יותר קל, אבל גנטיקה מעניין לדעתי)", "timestamp": 1645171063831}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: חלק מההרצאות מועברות בצורה טובה יותר וחלק פחות, יש מצגות ארוכות אבל החומר לא מוסבר בהן בצורה מספיק טובה אז הן לא מספיקות כדי ללמוד מהן.\n\nשם המתרגל/ת: בלה בן עז\nחוות דעת - תרגולים: מתרגלת מעולה!! ממש אכפתית ומסבירה מצוין את החומר, התרגולים שלה ממש טובים.\n\nשעורי הבית: 5 תרגילי בית לאורך הסמסטר, כל אחד לוקח לפחות כחצי יום עבודה. בסמסטר הזה היה מספיק לקבל ציון מעל 70 בגיליון בשביל לקבל מגן מלא של 2% בציון הסופי, אבל הבדיקה קפדנית. ממש מומלץ לעשות את תרגילי הבית, הם בנויים בצורה טובה ומתרגלים את החומר כמו שצריך.\n\nהמבחן: מבחן פתוח, הרבה חישובים, ויחסית לא הרבה זמן. אם לומדים טוב למבחן אפשר לקבל ציון גבוה, השאלות די חוזרות על עצמן אז אפשר להבין את הטריקים.\n\nהשורה התחתונה: קורס מעניין ומומלץ, נותן הרבה ידע כללי שכיף לדעת. הוא די שונה במבנה שלו ובמבחן מביולוגיה 1 אז צריך לקחת את זה בחשבון.", "timestamp": 1647174978405}, {"author": "ירדן", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: הרצאות מצוינות וממש מרחיבות את הדעת. מאוד נהניתי מהדרך שבה איילת מעבירה את ההרצאות. איילת מראה יחס ממש טוב לסטודנטים ויש לה המון סבלנות לכל השאלות. \n\nשם המתרגל/ת: בלה בן עוז\nחוות דעת - תרגולים: בלה מתרגלת מעולה! מעבירה בצורה ברורה, מספיקה המון.\n\nשעורי הבית: שיעורי בית סבבה לגמרי, בדיעבד ברוב הזמן מזכירים את המבחן\n\nהמבחן: צריך להיות על החומר של הקורס ולתרגל לא מעט כדי להצליח במבחן. אבל בתחושה שלי זה לגמרי אפשרי.\n\nהשורה התחתונה: קורס כיפי וממש מעניין. שווה לכל מי שמתעניין בעולם הזה.", "timestamp": 1647850827887}, {"author": "בושי איילת לם.", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: אל תלכו להרצאות, מרצה ממש גרועה, כמו כן היא גם בן אדם נוטף רוע, כל שאלה בהרצאה/בקשה/טענה היא לא תעזור ותגרום לך להרגיש לא בנוח, מרצים כאלו מביישים את המוסד וצריך לגדום את המשכם בטכניון. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מתרגלת מעולה.\n\nהמבחן: אל תיגשו למועד ב, אגיד את זה שוב, אם איילת לם, המרצה שלכם, אל תגישו לשום מועד מלבד מועד א.\n\nהשורה התחתונה: קורס מאוד מעניין, אולם לא יודע אם אפשר לקרוא לדבר הזה ש\"מלמד\" מרצה.", "timestamp": 1650348999507}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: \nמעניינות, לפעמים קשות, זה לא ביולוגיה זה יותר מורכב. תחילת הקורס קלה ומואץ בהמשך\nשם המתרגל/ת: בלה\nחוות דעת - תרגולים: \nמעולה מלמדת כל מה שצריך\nשעורי הבית: \nסבירים, כדאי לעשות זה ממש עוזר למבחן\nהמבחן: \nקשה מאוד, מצופות קפיצות הבנה והנחות לא סבירות לפעמים\nהשורה התחתונה: מומלץ לחובבי ביולוגיה (לקחתי כבחירה מדעית)", "timestamp": 1653397096050}, {"author": ";", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: נביה איוב\nחוות דעת - הרצאות: מרצה טוב ומאוד אכפתי כלפי הסטודנטים. דאג בכל 20 דקות ראשונות של שיעור להביא מרצה אורח מהפקולטה של ביולוגיה להסבר על המעבדה שלו\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים:  מתרגלת טובה מאוד, מסבירה מאוד ברור ויודעת על מה לשים דגש\n\nשעורי הבית: לא כבדים יותר מדי ברובם, היו 4 מתוך 5 גליונות להגשה.\n\nהמבחן: הוגן בסך הכל, לא היו הפתעות\n\nהשורה התחתונה: אחלה קורס, לא הרבה חומר, אחלה סגל", "timestamp": 1659459038600}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202103", "text": "שם המרצה: ענבר\nחוות דעת - הרצאות: \n:)\n\nשם המתרגל/ת: אלונה\nמתרגלת ממש טובה וואי בזכותה הבנתי את החומר\nחוות דעת - תרגולים: \n\nשעורי הבית: לא היה נורא\n\nהמבחן: היה מועד קשה יחסית אבל בסך הכל אם מתרגלים מבחנים הרבה חוזר על עצמו\n\nהשורה התחתונה: קורס מעניין ולא קשה", "timestamp": 1666898359259}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איילת\nחוות דעת - הרצאות: החומר מעניין מאוד, איילת לא וואו \n\nשם המתרגל/ת: בלה \nחוות דעת - תרגולים: מלכת עולם. המתרגלת הכי טובה שראיתי בטכניון בפער. אכפתית, תקתקנית, פשוט מטורפת. \n\nשעורי הבית: סבבה\n\nהמבחן: \n\nהשורה התחתונה: לא עשיתי את המבחן עדיין אבל בינתיים נראה אחלה קורס בסך הכל", "timestamp": 1676728267909}, {"author": "נשא טרנסלוקציה רוברטסונית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איילת לם\nחוות דעת - הרצאות: אין לי מושג, לא הלכתי להרצאות (זה מיותר)\n\nשם המתרגל/ת: בלה בן-עוז\nחוות דעת - תרגולים: מצויינת! התרגולים שלה סוגרים את כל החומר הדרוש לבחינה. בתרגול היא מסבירה את החומר ואז פותרת תרגילים שרובם מבחינות. מומלצת מאוד!\n\nשעורי הבית: 5 תרגילי בית מגן. אם מקבלים מעל 70 אז הציון נחשב כ-100 במגן. לא עמוסים מדי, אפשר לסיים תוך כמה שעות רציפות של פיתרונות. שיעורי הבית לרוב מכילים תרגילים ממבחנים לכן מומלץ לפתור ולתרגל פתרונות.\n\nהמבחן: מועד א' (שלצערי לא ניגשתי אליו) היה פתיר, הבעיה היחידה היא זמן. תנסו למצוא מתוך 4 השאלות את ה-3 הקלות ולפתור אותן ואם נשאר זמן לפתור את האחרונה. הממוצע היה 77.\nמועד ב' היה הרבה יותר קשוח והייתה בו שאלה שלא ראינו כמותה באף תרגול (לדעתי זה לא הוגן). בהתאם הממוצע ירד ב-10 נקודות ל-66. שאר השאלות היו קצת יותר קשות ממועד א'.\n\nהשורה התחתונה: קורס מעניין לאוהבי ביולוגיה. לא עמוס. לא ממליץ ללכת להרצאות כי יש שם המון חומר מיותר, עדיף פשוט לעבור זריז על המצגת של ההרצאה במקום.", "timestamp": 1680690611705}, {"author": "אברציה כרמוזומלית", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נביה איוב\nחוות דעת - הרצאות: הוא ממש משתדל שיהיה מעניין, והחומר של הקורס גם מרתק, אבל הוא מרצה די לאט ומרגיש כאילו היו יכולים להוריד את כמות ההרצאות פי 2. אם יש אפשרות לראות מוקלט, זה לגמרי בסדר\n\nשם המתרגל/ת:  בלה בן- עוז\nחוות דעת - תרגולים: המתרגלת הכי טובה בטכניון, אכפתית, קשובה ותמיד דואגת שנבין, כל מה שלא ברור היא מסבירה שוב מזווית אחרת, תענוג ללמוד ממנה. מכסה את כל החומר שצריך למבחן\n\nשעורי הבית: 5 גיליונות, חלקם קשים יותר חלקם פחחות אבל הם ממש חשובים להפנמה של החומר\n\nהשורה התחתונה:  מעניין ומומלץ מאד כבחירה מדעית למי שיכול", "timestamp": 1689584703948}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: בלה\nחוות דעת - הרצאות: \nמרצה מצויינת, הסברים ברורים ויחס מצויין לסטודנטים, בנוסף היא מעבירה את החומר בצורה ממש מעניינת. \n\nשם המתרגל/ת: עלמה + מוקלט לילא\nחוות דעת - תרגולים: \nעלמה חמודה ומעבירה את החומר בצורה טובה, בהמשך הסמסטר בגלל בעיות לוז עברתי למוקלט של לילא שגם היה סבבה\n\nשעורי הבית: \nבגלל שהיה סמסטר מלחמה התרגילי בית היו מגן 10% במקום תקף. שווה לעשות אותם בשביל התרגול והפידבק, קחו בחשבון שהם נבדקים בצורה מאוד קפדנית.\n\nהמבחן: \nלא ברור מה קרה במועד א' הזה. תרגלתי כמות לא קטנה של מבחני עבר ואת כולם סיימתי בקלות. אבל במועד הזה משהו לא עבד כמו שצריך. השאלה הראשונה הייתה רגילה ופתירה אבל 3 השאלות הבאות היו לא סטנדרטיות, שונות ממבחני עבר והכילו סעיפים ראשונים קשים שאם לא מצליחים לפתור אותם הלכה כל השאלה. אנשים יצאו מהמבחן בהלם, ראיתי כמה שבכו. בקיצור חוויה ממש לא נעימה.\nלפי סקר שעשינו אחרי המבחן רוב הסטודנטים לא פתרו משהו כמו 2 שאלות שלמות (50 נקודות מהמבחן). \n\nהשורה התחתונה: \nזה קורס שלקחתי כבחירה מדעית, הוא היה סופר מעניין במהלך הסמסטר עם אחלה סגל והלוואי שיכולתי להמליץ עליו אבל משהו במבחן ממש התפקשש להם בצורה לא ברורה. נקווה שלא יהיה ככה גם המועד ב.", "timestamp": 1714973249525}, {"author": "Anne Onimus", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "קורס מזעזע. אם אתם לא מביולוגיה והוא לא קורס חובה עבורכם, לא לקחת אותו. הסגל לאורך כל הסמסטר היה נראה מקסים ושינן את המנטרה של \"אנחנו לא באים להכשיל אתכם, אנחנו רוצים שתבינו את החומר, המבחן יהיה הוגן\" וממש האמנו להם, שלא לדבר על זה שבלה היא הצנזור\\עליזה מלק\\מוחמד עכאשה של גנטיקה ושכולם מתים עליה וכל הזמן מדברים על כמה שהיא מרצה טובה ומקסימה ומתחשבת,\nואז מועד א היה פשוט קטסטרופה גרעינית. רמת מבחן שלא דומה לשום מבחן שהיה בשנים הקודמות, 2 שאלות שסעיף א שלהם לא פתיר בעליל וזה תוקע את שאר השאלה כי הכל מבוסס עליה(רוב הקורס השאיר 2 שאלות שלמות בשווי 53 נקודות, ריקות לחלוטין)\nברמה שהסגל היה צריך לתת הארכת זמן של חצי שעה למבחן מרוב שהוא היה לא פתיר, אבל הבעיה הייתה לא הזמן אלא רמת הקושי אז כמובן שזה לא עזר.\nבקביעת הציונים הייתה אפס התחשבות מהסגל וטענתן הייתה שהמבחן פתיר ושזו בעיה שלנו.\nאני לא יכולה לדבר בשם אחרים אבל אעיד על עצמי שהייתי על זה כל הסמסטר, פתרתי עצמאית והגשתי את כל תרגילי הבית, לקראת המבחן פתרתי את *כל* מבחני העבר שהיו אי פעם (כן, כולל המבחנים מ2009) ואת רוב שיעורי הבית משנים קודמות הכל על 93+, ואפילו זה לא הציל אותי משאלות 3 4 ימח שמן.\nבקיצור לא לקחת את הקורס הזה, הוא ישבור לכם את הלב. רבייב וצנזור לפחות אומרים לכם ישירות שהם יכשילו אתכם ושהמבחן יהיה לא פתיר, בגנטיקה אתם חושבים שהסגל בצד שלכם ואז הוא תוקע לכם כזאת סכין בגב.", "timestamp": 1715254536343}, {"author": "-", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "במקום ביקורת, מספיק שתקראו את התגובה של בלה לציוני המבחן:\n\"סטודנטים יקרים,\nציוני מועד א׳ פורסמו במערכת ה-upgrade  יחד עם הציונים הסופיים של הקורס.\nהמבחנים הועברו לסריקה ויהיו זמינים עבורכם ככל הנראה ביום ראשון.\nנוהל ערעורים:\nסטודנטים המבקשים להגיש ערעור, מתבקשים לעשות זאת בהתאם לנוהל הערעורים המפורסם באתר המודל של הקורס.  ערעורים ניתן להגיש עד יום ראשון ה-19.05.24 בשעה 20:00.\nלהלן מספר הודעות לגבי מועד א׳:\n1)      חישוב ציונים בקורס\nחישוב ציון סופי - \n•\tציון תרגילי הבית חושב כממוצע תרגילי הבית שהוגשו.\n•\tהמרכיב של תרגילי הבית בציון הקורס הסופי נקבע על בסיס מספר תרגילי הבית שהוגשו. למשל עבור סטודנט שהגיש 5 תרגילי בית, תרגילי הבית מהווים 10% מהציון של הקורס, והבחינה 90%.\n•\tעבור סטודנטים שציונם במבחן הנו 54 ומטה, חושב הציון הסופי כציון הבחינה בלבד.  \n2)      הפתרון של המבחן מופיע באתר הקורס.\n3)      כל השאלות בבחינה היו פתירות.\nבאופן ספציפי:\nשאלה 3 :\n•\tכל הסעיפים בשאלה היו פתירים.\n•\tסעיפים ה', ו' (ששוויים 10 נקודות) היו לחלוטין בלתי תלויים בשאר סעיפי השאלה, ומרבית הסטודנטים קיבלו עבורם ניקוד מלא.\n•\tהתחשבנו בטעות נגררת ספציפית בשאלה הזו וגם במבחן כולו.\n שאלה 4 :\n•\tסעיף א׳ (מסלול מטבולי) – מספר רב של סטודנטים קיבלו ניקוד מלא עבור סעיף זה. התקבלו גם מספר מסלולים חלופיים ששונים מזה המוצע בפתרון הרשמי, כל עוד הם תאמו את הנתונים. בנוסף ניתן ניקוד חלקי לסטודנטים שלא הצליחו לפענח את המסלול במלואו.\n•\tעבור סטודנטים שטעו בפתרון המסלול, התחשבנו בטעות נגררת.\n•\tניתן היה לפתור את שאר סעיפי השאלה גם מבלי לפתור את המסלול.\nשאלת הבונוס: על מנת לבוא לקראתכם נתנו 5 נקודות עבור שאלת הבונוס. התשובה לשאלה נידונה מספר פעמים בהרצאות, התקבלו גם תשובות נוספות כל עוד ההסבר תאם את נתוני השאלה.\nומספר דברים נוספים בנוגע לחששות שהועלו על ידי נציגות הסטודנטים:\nברמה האישית, צוות הקורס נרתם כדי לתמוך ולסייע לכם מראשית הקורס ועד לאופן הבדיקה של הבחינה, למשל:\n•\tכל ההרצאות והתרגולים הוקלטו והיו זמינים עבורכם לאורך הסמסטר ולפני הבחינה. \n•\tתרגילי הבית היו מגן ולא תקפים על מנת להקל עליכם בסמסטר מורכב שכזה, לצערי 30% מהסטודנטים לא הגישו אף תרגיל בית, ואחוזים בודדים הגישו את כל החמישה.\n•\tעל מנת לסייע לכם בהכנה לבחינה צוות הקורס היה זמין עבורכם ונתן מענה לעשרות שאלות בפורום הקורס במודל.\n•\tבנוסף, קיימנו תרגול חזרה כדי לענות על שאלות שלושה ימים לפני הבחינה. התרגול שודר והוקלט לטובת סטודנטים שלא יכלו להגיע.\n•\tצוות הקורס עבר בין הכיתות וענה על שאלות לאורך הבחינה כולה.\n•\tלאור הבקשות שלכם ניתנה תוספת זמן משמעותית של חצי שעה לבחינה.\n הקורס \"גנטיקה כללית\" דורש הבנה והעמקה בחומר לאורך הסמסטר. השאלות במבחן, כמו שאמרנו תמיד, הן אינטגרציה של החומר ובודקות הבנה ולא שינון. סגנון המבחן דמה מאוד למבחנים משנים קודמות, וכך גם ממוצע הציונים.\nלאור התקופה הקשה שאנחנו נמצאים בה והמורכבות של הסמסטר, ועל מנת לבוא לקראתכם, הוחלט על תוספת של 5 נקודות פקטור לציון הבחינה.  \nממוצע הבחינה הוא 66. לידיעה, ממוצע הבחינה יחד עם הציונים של אנשי המילואים הוא 65.7. ממוצע הציונים הסופי של הקורס הוא 67.1.\nבברכה,\nצוות הקורס\"\n\nבאמת עשיתי כמה קורסים ביזיוניים כבר בטכניון אבל תגובה שכולה סנגור ללמה המבחן בסדר והסטודנטים הם הגרועים חוצה כל גבול בעיני. (גם אתם חושבים שכל מה שכתוב מעלה ה פשוט דרישה טכניונית בסיסית, למשל לעבור בין הכיתות במהלך המבחן/ לעשות שאלות פתירות/ לענות על שאלות במהלך המסטר)\n\nהקורס מעניין, בלה וכל שאר המתרגלות יודעות ללמד. פשוט ברמה הרבה יותר נמוכה מאשר המבחן שהן עשו, במקום לקחת את זה כמסר (בכל זאת חצי מהקורס השאיר שתי שאלות שלמות ריקות) הן החליטו להיכנס בנו על 200 קמ\"ש. שום דבר לא מצדיק את ההתנהלות בקורס. פשוט תתרחקו ממנו אם הוא לא חובה.\n\nאם החלטתם להמשיך לקרוא עד כאן אז אציין שההרצאות הן אחלה, אבל הן שלוש שעות שבהן לא עובר יותר מידי חומר, אם יש זמן שווה ללכת. ש\"ב דיי קשוחים, הבעיה העיקרית בכלל בשאלות בקורס היא שיש כמה פתרונות אפשריים ומתוכן צריך לפסול אופציות וזה פחות פשוט ממה שזה נשמע.", "timestamp": 1715257117853}, {"author": "סטודנטית מאוכזבת", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "מחזקת מאוד את הביקורת שנכתבה לפני. המועד א שהיה לנו היה זוועה אטומית, והקטע הכי עצוב זה שהסגל לאורך כל הסמסטר חזר ואמר ש\"המבחן יהיה הוגן ובא לבחון על החומר שלמדנו\" בפועל הם יצרו מבחן הרבה יותר קשה מכל מבחן עבר שיצא לי לתרגל, שהסעיפים הראשונים בכל שאלה בו הם סעיפים קשים במיוחד שמכילים אלמנטים שונים ומורכבים יותר ממה שראינו בהרצאות ותרגולים.\n\nאני אומרת את זה בתור סטודנטית עם ממוצע 94+ ממדמ\"ח שהציון בקורס הזה זה הציון הכי נמוך שקיבלתי אי פעם מבחן בכל בחיי. הגעתי לכל ההרצאות של גנטיקה, השקעתי בקורס לא מעט, בכל מבחן עבר שתרגלתי הוצאתי ציון כמעט מושלם והמבחן הזה היה פשוט מסריח ומכשיל.\n\nלא ממליצה לאף אחד להתקרב לקורס הזה למרות שהוא מעניין מאוד (לדעתי). אם מעניין אותכם תצפו בסרטוני יוטיוב בנושא ותחסכו לעצמכם לקבל 60 בקורס הבחירה הבזיוני הזה.", "timestamp": 1715263566285}, {"author": "בא לי לפרוש", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "נכון אתם מהאנשים האלה שקוראים ביקורות קשות ואומרים \"פחח, אני מצטיין דיקן, בטח כתב את זה איזה לוזר ממורמר שלא השקיע בקורס\", לוקחים את הקורס בכל זאת ואז אומרים \"וואי ביקורות בצ'יזפורק זה שטויות, סטודנטים הם כזה עם בכיין\"? \nאז תנו לי להגיד לכם שאני כמוכם. ממוצע 89 במדמ\"ח, מצטיינת דיקן, מאיות בקורסים מתמטים שכנראה יבחילו אתכם, אבל בגנטיקה? הציון הכי נמוך שלי בתואר.\nעכשיו אתם אומרים \"טוב בסדר אז קורס אחד שאין לה אוריינטציה אליו, סתם בכיינית, אני יותר טוב ויש לי יותר גדול\".\nאז תנו לי לעצור אתכם כאן. ראיתי את כל ההרצאות בקורס פעמיים *תוך כדי הסמסטר*. למה? כי אני חננה. בכל תרגול עצרתי את ההקלטה וניסיתי לענות בעצמי, והצלחתי. פתרתי את כל תרגילי הבית וקיבלתי אחלה ציונים. פתרתי סימולציות החל מאמצע הסמסטר. לקראת המבחן פתרתי 16 סימולציות וקיבלתי 85+ בכל אחת מהן, כשבאחרונות זה כבר היה יותר קרוב ל-100, והגעתי למצב שאני מסיימת סימולציה קשה בשעה וחצי. ניגשתי למבחן בבטחון שעכשיו הממוצע שלי עולה.\nבמבחן היו 4 שאלות. בשאלה 1 עוד הייתי פלוצה נפוחה וחשבתי שאקבל 100. בשאלה 2 היו כמה דברים פחות שגרתיים אבל אחרי כמה דקות מחשבה פתרתי אותם גם. הגעתי לשאלה 3, שלא ראיתי שום דבר כמוה באף מבחן עבר. כמות הקומבינציות שניסיתי על הטיוטה כדי רק לנסות לענות על השאלה אילצה אותי לבקש עוד מחברת טיוטה. אחרי 40 דקות של נסיון ניסיתי לראות אם המשך השאלה פתיר - הכל מתבסס על סעיפים קודמים. עברתי לשאלה 4. שם כבר הבנתי שאני לא מצליחה למלא מספיק נקודות כדי לעבור את המבחן. \nהגשתי את המבחן רק עם 55 נקודות שפתרתי, אחרי שנתנו עוד הארכת זמן כי הבינו שהמבחן קשה. קיבלתי את הציון הכי נמוך שקיבלתי בחיי.\nהסגל איבד כל קשר למציאות, וגם כשנשלח אליהם מייל מטורף עם סקר שענו עליו יותר ממאה סטודנטים, שמראה שהרוב המוחלט של הקורס נמצא במצב דומה לשלי, הם סנגרו על עצמם יותר טוב מביבי. עדיין לא הצלחנו להבין איך הממוצע בכלל הצליח להגיע ל-62. סליחה, 67, כי הסגל כל כך התחשב שהם נתנו - אתם יושבים??? - 5 נקודות פקטור. אם זה לא מעשה אצילי אני לא יודעת מה כן.\nבקיצור - קחו פיזיקה במקום, שם הם יודעים לכתוב מבחנים. עזבו עניין. עם עניין בגנטיקה לא הולכים לראיונות עבודה בגמפ\"א. \n\nשם המרצה: בלה\nחוות דעת - הרצאות: הערצתי אותה עד המבחן.\n\nשם המתרגל/ת: בלה במוקלט \nחוות דעת - תרגולים: מעולה כמתרגלת, חבל שלא נשארה בתפקיד הזה.\n\nשעורי הבית: סבירים, אם אתם חושבים שזה יכין אתכם למבחן אז חחחחחחחחחחחחחחחחחחחחחחחחחחח\n\nהמבחן: מוטציה לטאלית קשה\n\nהשורה התחתונה: אם בלה מרצה אחראית, ואכפת לכם מהממוצע שלכם, אני ממליצה לכם לברוח.", "timestamp": 1715271412018}, {"author": "זיו", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה\nחוות דעת - הרצאות: הייתה מרצה זהב, מעולה, עונה על שאלות, מראה נכונות להעביר ידע, עד המבחן, שם היא פשוט הפכה להיות מרצה טכניונית קלאסית שכל המטרה שלה היא להראות כמה הקורס שלה קשה ומיוחד, בלה אהבנו אותך ופשוט חירבת את זה במבחן.\n\nשם המתרגל/ת: לילא\nחוות דעת - תרגולים: בחורה מקסימה, מהממת, קשובה, יצרתית, אוהבת את המקצוע, אין מה לומר הצוות פה ברמה גבוהה.\n\nשעורי הבית: \nנבדקים בקפידה, חשבתי שזה יכין אותי למבחן, זה לא.\n\nהמבחן: \nכשכל חבריי החליט בקורס הבחירה שלהם לקחת פיזיקה 2, אמרתי לא, אני אבחר משהו מעניין, משהו שיש לי בו אינטואציה כי קיבלתי בבילוגיה 98 וזה קורסים קצת שונים מכל המתמטיקה שאנחנו עושים ביום יום.\nטעות\nטעות איומה\nהגעתי הכי מוכן למבחן שאפשר, עשיתי את כל התרגילי בית שוב, עשיתי את כל המבחנים משנים קודמות, התאמצתי, היו מבחנים קשים.\nשומדבר לא הכין אותי ל3 שאלות קשות מתוך 4 שרוב האנשים עם דוקטורט בגנטיקה לא יצליחו לפתור.\nמה אני מגיע פה למשחקי הרעב? מה אני צריך לשבת 4.5 שעות במבחן עם הארכת זמן בלנסות לייצר טבלה שבחיים לא ראיתי כמותה? מה אני צריך לנחש מה זה יחס 2:1 שלא קיים כלל בחומר שראינו? מה אני צריך לנחש ולהבין מה זה הריצוף הגנומי הזה עכשיו ולהבין מי אני ומהמ אני? אתם יודעים מה זה לשבת במבחן ופשוט להרגיש שאתם 100% על החומר אבל לא מצליחים? זה בדיוק מה שקרה, הקורס הזה הזכיר לי כמה זוועה התואר בטכניון וכמה יזיינו אתכם אפילו שתהיו הכי טובים שיש.\n\nאל תקחו את הקורס הזה\nאל\nתקחו\nאת הקורס\nהזה\nכבחירה\n\nבלה, איכזבת אותי, כשמסתכלים על ממוצע ורואים שהוא ירד גם לאחר הפקטור במעל 7 נקודות, כנראה שמשהו לא בסדר. \nתהיו קשובים לסטודנטים שלכם. כשהם אומרים שקשה להם, תודה על החצי שעה במבחן, חצי שעה על שאלה שיכלה להיות שאלה בקומבינוטריקה מתקדמת, אני יודע אני מתרגל את זה.\n\nדי!  \nהשורה התחתונה:", "timestamp": 1715330955767}, {"author": "אהבתי גנטיקה", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "האם אתם לוקחים קורס בשביל הנאה ולא אכפת לכם מהממוצע? לכו על זה\nאם לא, תברחו.\nזה היה ללא ספק הקורס הכי מעניין שלי בתואר, היה נראה שלסגל אכפת, עונים על הכל, רוצים ש\"תצליחו\", אבל אז מגיע המבחן ואתם מגלים שהסגל כבר לא כל כך נפלא. \nוהיופי הוא, שלדעתם היה מבחן הוגן ומטוב לבם נתנו לנו 5 נקודות פקטור, כשכל כך הרבה אנשים יצאו מהמבחן הזה מזועזעים. כי כל האכפתיות והנחמדות זה שקר אחד גדול, ובתכלס הם פשוט לא שמים עליכם. \nתקחו פיזיקה!!!!! לא להיכנע לזה שזה מעניין עדיף לכו תראו סרטונים של גנטיקה ביוטיוב לבד או משהו", "timestamp": 1715339912700}, {"author": "איש הד'", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "TLDR: לא לקחת את הקורס בשום צורה אם בלה בן עוז מעבירה אותו כמרצה אחראית!  \n\n\nשם המרצה: בלה בן עוז\nחוות דעת - הרצאות: מרצה טוב מאוד, מעבירה את החומר בצורה ברורה. קצת מתעכבת בשיחות ארוכות עם סטודנטים שכבר מבינים את החומר ושואלים שאלות העשרה, שלא כל כך רלוונטיות (בדרך כלל מרצים אחרים בולמים אותם בשלב הזה). בלה הייתה מרצה מעולה לפחות עד למבחן. לאורך כל המבחן הדגישה כמה ש\"לא רוצים שיהיה קשה\", \"אנחנו פה בשבילכם\", \"אין לנו כוונה להכשיל אתכם\", \"המבחן יהיה הוגן ואנחנו לא שואלים דברים שלא למדתם עליהם\". אבל אז בזמן אמת מועד א' היה קשה בטירוף, שאלות לא פתירות שסעיפים מתקדמים מתבססים על סעיפים קודמים, וזה בעיה כשהסעיף הראשון לא פתיר.\n\nאחרי שהעלנו בפני בלה את הטענות שלנו לגבי המבחן, בצורה מסודרת מאוד, בלה שלחה בתגובה מכתב שלא היה מבייש משרד של עורכי דין. היא בעצם \"באה לקראתנו\" בזה שהואילה לתת לנו 5 נקודות פקטור, אפילו עזרו לנו בזה ש\"עברו בין הכיתות בזמן המבחן\", ואפילו באו לקראתנו בזה שנתנו חצי שעה הארכת זמן. אין מילים באמת, מכתב עלוב שמבייש את בלה, ואולי הוא בעצם חושף את העמדת הפנים שלה לאורך הסמסטר כמרצה נחמדה ואדם הוגן.\n\n\nהמבחן: \nגועל נפש\nהסמסטר היה סמסטר חורף, שבו הקורס מורכב מרוב מוחלט של סטודנטים שלוקחים אותו כקורס בחירה. בדרך כלל הממוצע גבוה בלפחות 7 נקודות ממה שיצא לנו הסמסטר. בלה החליטה שאנחנו בתור לוקח קורס בחירה נצטרך לקבל מבחן שיותר קשה מכל המבחנים עד כה ואפילו יותר קשה מסמסטרי אביב שבהם זה קורס חובה לפקולטה לביולוגיה.\n\nאחרי מועד א' ציפינו לקבל הודעה שתבהיר שמועד ב' יהיה ברמה יותר נורמלית, ולא יהיה מבחן כזה מכשיל כמו מה שהם בנו לנו. אבל במקום לקבל איזושהי הבהרה כזאת, קיבלנו מכתב הגנה מתגונן מאת בלה... גועל נפש! אני לא רואה סיבה אפילו לגשת למועד ב' עם ההתנהגות והגישה הדוחה הזאת. בפקולטה שלי, מדעי המחשב, כשהיה מבחן קשה מדי שהכשיל המון אנשים בקורס \"אלגוריתמים נומריים\", המרצה באופן אישי שלח לנו מייל והתנצל, ובאמת במועד ב' המבחן היה יותר נורמלי. כנראה שבפקולטה לביולוגיה זה לא המצב - לברוח מהקורס הזה כמו מאש.\n\n\n\nהשורה התחתונה: \nתברחו מהקורס הזה ואל תקחו אותו בחיים כל עוד בלה מרצה אחראית!", "timestamp": 1715343029024}, {"author": "מעריץ לשעבר", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "איך תדעו אם גנטיקה זה בשבילכם?\nאם אתם רוצים קורס בחירה מעניין שבמבחן שלו תקבלו 25 נקודות מתחת לממוצע שלכם - זה הקורס בשבילכם\nאם בא לכם להתאהב בסגל ולא להבין איך סגל כזה טוב יגרום לכם לכל כך הרבה באסה - זה הקורס בשבילכם\nאם בא לכם להתאכזב מעצמכם שאמרו לכם שפיזיקה יותר קל ופיזיקה 3 זה בכלל מלג אבל בכל זאת בחרתם ללכת אחרי מה שמעניין אתכם - זה הקורס בשבילכם\nאם אתם רוצים לספר לבוס שלכם שאתם לא חוזרים לעבוד בזמן שקבעתם כי קיבלתם את הציון הכי נמוך בתואר בקורס שלא קשור בכלל לעבודה ועכשיו יש לכם מועד ב - זה הקורס בשבילכם\nאם אתם בדיוק על הממוצע שחלמתם עליו כל התואר ובא לכם קצת לקלקל - זה הקורס בשבילכם\n\nשם המרצה: בלה\nחוות דעת - הרצאות: קשה לי להגיד עליה משהו חיובי עכשיו אבל במהלך הסמסטר היא הייתה מעולה\n\nשם המתרגל/ת: לילא\nחוות דעת - תרגולים: מהממת\n\nשעורי הבית: לוקחים כמה שעות וגורמים לך לשמר את האשליה שתצליח בקורס\nאגב אם הסגל נותן אותם כמגן כדי להקל עליכם בזמנים קשים אבל חלילה לא תספיקו להגיש את האחרונה כי היה לכם מבחן אחר יומיים אחרי סוף הסמסטר אז הם ישכנעו את עצמם שזה למה לא הצלחתם גם אם עשיתם אותם כהכנה לפני המבחן\n\nהמבחן: לא ברור מה הקשר בינו לבין מה שקרה בקורס... הקורס הזה היה בית של ממתקים באמצע היער ורק במבחן הבנתי מה קורה בתוך הבית הזה\nהדבר הכי עצוב זה שהסגל באמת מאמין שהם כתבו מבחן הגיוני... הם פרסמו הודעה עם הציונים והדגישו שהשאלות במבחן היו פתירות\nלספר להם שגם בעיות deep learning פתירות אבל עדיין למחשבי על יכול לקחת כמה שעות לפתור אותן? \nלספר להם שאנשים עם עבודה ועם ילדים לוקחים את הקורס הזה כי הם פשוט חייבים מקצוע מדעי? \nלספר להם שבפעם הבאה שהסגל הזה יעביר את הקורס כל מי שבכלל שקל לקחת גנטיקה יקבל מבול של הזהרות ממצטיינים שלקחו אותו עכשיו?\nאם המטרה שלהם הייתה לצמצם את נפח הקורס הם ממש הצליחו\n\nהשורה התחתונה: רק פיזיקה", "timestamp": 1715343996220}, {"author": "מעריץ לשעבר", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "קורס מעולה אם בא לכם קורס שיגרום לכם לחשוב שאתם בתוכנית ריאליטי של מדענים. כשסטודנטים עם ממוצע 90+ יוצאים בוכים מהמבחן, זה אומר משהו. וכשהמרצה חושבת שהכל הולך חלק? זו כבר סיבה לדאגה\nהסגל הבטיח שוב ושוב שהם פה בשבילנו ורוצים לא להוריד לנו נקודות אלא לחפש איפה לתת אותן. בלה המרצה ממש הייתה מצוינת בהבטחות האלה אבל הייתה פחות טובה במימוש\nהמבחן היה כמו לפתוח דלת למימד אחר שבו הכל מורכב משאלות שלא שמעת עליהן קודם גם אם עשית כל מבחן עבר שהעלו למודל", "timestamp": 1715344590030}, {"author": ":(", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה בן עוז\nחוות דעת - הרצאות: היא מעבירה את החומר בבהירות עד שמגיע המבחן, ושם הכל נראה כאילו לא למדנו כלום מה שנדרש\n\nהמבחן:\nמה שכיסינו בכיתה לא התאים בכלל לשאלות שהופיעו במבחן. זאת אומרת אם תשאלו את הסטודנטים, אם תשאלו את בלה היא תגיד שזה ממש דומה. המבחן היה מורכב לקורס אחר לגמרי. התחושה הכללית הייתה שהמבחן מיועד להפיל סטודנטים ולא לבדוק את הידע שרכשנו.\nלאחר שהבענו את דאגותינו על המבחן בלה ניסתה \"לבוא לקראתנו\" עם הודעה שהייתה יכולה להיות כתובה על ידי עורך דין מקצועי, ולא במובן החיובי. היא הוסיפה לנו כמה נקודות בונוס, אבל הכל הרגיש כמו ניסיון לשקט אותנו ולא באמת לתקן את הנזק שנגרם\n\nבאתי עם ציפיות גבוהות שהובילו לאכזבה גדולה. התקווה למועד ב' שיהיה יותר סביר התנפצה לאחר שבלה שלחה מכתב שבו הגנה על הקושי של המבחן, תוך כדי הפקרת הסטודנטים שבאמת השקיעו ממש ונפגעו ממנו\n\nהשורה התחתונה:\nהקורס יכול להיות נפלא אם תנהלו אותו נכון, אבל תחת הנהלתה של בלה ייתכן שתזדקקו להרבה מזל כדי להצליח", "timestamp": 1715345049204}, {"author": "קחו. פיסיקה.", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "לא. לקחת. אם. בלה. בן. עוז. היא. המרצה. האחראית.\nאגב במשפט הזה יש יותר נקודות ממה שקיבלתי בחצי השני של המבחן, למרות שידעתי את החומר מעולה", "timestamp": 1715345564140}, {"author": "סטודנטית שפעם אהבה גנטיקה", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה בן-עוז\nחוות דעת - הרצאות: פשוט לא לקחת אם בלה מרצה!!! היא מעולה ואז במבחן כל התקוות שתליתם בה מתנפצות!!! היא לא בודקת הבנה בחומר כמו שהיא אומרת במהלך הסמסטר, היא בודקת כמה מהר אתם מצליחים לחשוב על כמות קומבינציות לא אפשרית של פתרונות רק כדי בסוף להשאיר את השאלה ריקה\n\nשם המתרגל/ת: עלמה\nחוות דעת - תרגולים: ממש אהבתי אותה ואני ממש מנסה להדחיק את האפשרות שגם היא הייתה אחראית לדבר הזה\n\nשעורי הבית: כמה שעות פעם בשבועיים ולא דומים בשום צורה לרמה של המבחן\n\nהמבחן: באמת אמרו מספיק לפני אבל אם עוד לא הבנתם אז חצי קורס הגיש חצי מבחן ריק\n\nהשורה התחתונה: לברוח", "timestamp": 1715345892709}, {"author": "mendel not mendeling", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה\nחוות דעת - הרצאות: \nמרצה מעולה, אני בד\"כ בן אדם שלא יכולה לסבול שעתיים הרצאה, תמיד בשעה השנייה בהרצאות הרגילות מאבדת ריכוז ,אז חשבתי שלא אשרוד הרצאת 3 שעות אבל להפתעתי מצאתי את עצמי עוקבת אחרי כל מה שהיא אומרת מתחילת ההראצה עד סופה בלי להירדם, היא באמת מעבירה החומר בצורה הכי ברורה שיש,והבטיחה שבהנת החומר שמועבר תגרום להצלחה במבחן כי מבחן בודק הבנה ולא בה להכשיל, אוי ואוי איזו בדיחה עצובה,סגל מעולה שחבל שהתנהג בצורה מבזה לקראת הסוף\n\nשם המתרגל/ת: מוקלט בלה+לילא\nחוות דעת - תרגולים: שוב גם המתרגלות הן אחלה ,כולן שולטות בחומר ברמה גבוה ואכן אוהבות מה שהן מעבירות,גם בפורום עונות מוקדם ככל האפשר-שזו הפעם הראשונה שאחווה סגל שבאמת בקשר עם הסטודנטים ולא משאיר שאלות שבוע ללא מענה-פיאצה -מדמח אחם אחם-\n\n\nשעורי הבית: בדיקה קפדנית כמו שאמרו אבל לא הרגשתי שהתרגילים היו קשים במיוחד,אם מבינים פותרים,את האמת הייתי לחוצה במהלך הסמסטר אז לא הקדשתי הרבה זמן לת\"ב, לכן סה\"כ לקחו 3 שעות *מקסימום* ולא הצטרכתי לחזור על החומר בשביל לפתור אותם ,-בכל התרגילים קיבלתי מעל 85-\n\nהמבחן: פה הזוועה האמתית והשוק הכי גדול,בתור סטודנטית למדמח תמיד היה לביולוגיה ותחומה מקום בלב שלי והיה לי יותר קל להבין את התחום הזה מהתחום שלי:( -בביולוגיה הוצאתי ציון מעולה ללא למידה רצינית- ובמהלך הקורס הרגשתי ואכן הייתי על החומר -למרות שלא השקעתי המון זמן לשיעורי הבית -זה לא אומר שלא הבנתי את החומר ולא הייתה עליו כל הסמסטר- ולקראת המבחן פתרתי מעל 10 מבחנים שכמעט בכולם קיבלתי מעל 85, אז נכנסתי למבחן כל כך בטוחה שהציון שלי לא ירד מתחת ל80 בשום מקרה,והוופ בשאלה השנייה נתקעתי בסעיפים האחרונים אז החלטתי לעבור לשלשית,,הסעיף הראשון היה לא פתיר ומנע התקדמות לסעיפים האחרים,אוקי בוא נראה שאלה אחרונה שבד\"כ טבלה קלילה-בכל המבחנים שפתרתי היתה אותה טבלה- אבל לאאאאא הסמסטר החליטו להביא טבלה שלא פתרנו בכיתת התרגול או ההרצאה או בתרגילי הבית או במבחני עבר משהו שדומה לה!!\nהן אכן הוסיפו חצי שעה אבל מה תעזור חצי שעה אם אין איך לגשת לשאלות?\n\nהשורה התחתונה: כמו שאמרתי וכמו שאמרו לפני, סגל מומחה,מכיר את החומר, חומר מעניין ,באמת מעניין אבל אם המבחן כל כך זוועתי ואם תחזרו בחוות דעת מישהו פרסם תגובת בלה, אז תוכלו לראות איזה התייחסות או התעלמות מ הסטודנטים יש,אז מה אם הסגל מקסים?בסוף רוצים ציונים כי רוצים ממוצע טוב לא?אם כן אז תברחו זה לא הקורס לקבל אפילו ציון סביר-גם אם מבינים החומר", "timestamp": 1715354648623}, {"author": "סטודנטית מבואסת", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה בן-עוז\nחוות דעת - הרצאות: בלה היא מרצה מעולה. היא הצליחה להפנט אותי לחלוטין במהלך הסמסטר, ולרגש אותי בנושאים שהיא בחרה להעלות במהלך ההרצאות מיוזמתה. אני חושבת שהיא בין המרצות היותר טובות, אם לא הכי טובה שיצא לי לחוות. בדיוק בגלל כל מה שכתבתי כל כך כאב לי איך שהסתיים הקורס עבורי. אני מרגישה כאילו אני בחלום רע ומחכה שיבואו להעיר אותי להרצאה בגנטיקה, ושם אראה שבלה היא בדיוק אותה הבלה שכל כך הערצתי.\n\nשם המתרגל/ת: לילא\nחוות דעת - תרגולים: היא באמת ממגנטת בעיניי. היא מעבירה את החומר בכזו התלהבות וחיבור לנושא שזה באמת מדהים.\n\nשעורי הבית: מפורסמים כל שבועיים, לקחו לי כמה שעות בכל פעם ונבדקים בקפידה. \n\nהמבחן: פה מתחילה הבעיה. זה חבל להגיד, אבל בעיניי המבחן הוא סיבה מספיקה לא לקחת את הקורס. הקורס מעניין בטירוף, לא עמוס מידי, הסגל מדהים, *אבל* המבחן הוא ההיפך הגמור ממה שחשבנו שנקבל. גם אנשים שהצליחו במבחן בצורה יחסית מתבאסים לגמרי על מה שקרה שם ועל התחושה שקיבלנו. השאלה הראשונה הייתה ממש דומה למבחני עבר ולשיעורי הבית האחרונים, והיא בערך היחידה. השאלה השנייה הייתה עדיין דומה למבחני עבר אבל הייתה טריקית וכללה חיבורים של נושאים שעוד לא ראיתי קודם. היה לי קשה בשאלה הזו ולא הרגשתי בטוחה בעצמי לגבי התשובה שלי, אבל יכול להיות שבאמת פשוט לא עברתי על סימולציה שבה עשו משהו דומה (למרות שפתרתי מעל 15 סימולציות). בשאלה 3 ובשאלה 4 נתקעתי לחלוטין, השקעתי בהן משהו כמו שעתיים וחצי ועדיין הגשתי אותן כמעט ריקות לגמרי. הן פשוט היו קשות יותר מכל דבר שראינו. \nהרבה ממי שכן הצליח במבחן הצליח בזכות זה שהוא וויתר על שאלה 3 לגמרי (חוץ מ-10 נקודות אולי שלפי הסגל היה עדיין אפשר לענות עליהן גם אם נתקעת בהתחלה, אבל אני אישית לא ראיתי סעיפים שלא היו קשורים לקודמים), עבר לשאלה 4, רשם על הסעיף הראשון איזשהו פתרון גם אם הוא לא היה נכון, ומשם המשיך בידיעה שיחשיבו את זה כטעות נגררת (וככה הם גם עשו).\nמבאס שרק אם הצלחת לחרטט בביטחון, גם אם למדת הרבה והשקעת הרבה, הצלחת להגיע למעל 70 במבחן. זה לא המבחן שחשבנו שנקבל כשהסגל הדגיש בכל הזדמנות שהמבחן בא לבדוק ידע, לא להכשיל, ושהם רק מחפשים איפה לתת נקודות גם אם ההסבר לא מושלם.\n\nהשורה התחתונה: באמת הקורס הכי מעניין שעשיתי בתואר, עם סגל מדהים שעונה בזריזות ובנחמדות על כל שאלה, אבל המבחן בעיניי כל כך לא מייצג שבאמת חבל לקחת את הקורס. אולי הייתה דרישה מלמעלה להפוך את הממוצע לנמוך יותר, אבל זה באמת קיצוני ברמות. הלוואי שהמועד ב יהיה מספיק סביר כדי שאוכל לחזור לכאן ולהגיב אחרת.", "timestamp": 1715429401593}, {"author": "סטודנט פחות ממורמר", "difficultyRank": 2, "generalRank": 4, "semester": "202302", "text": "שם המרצה: בלה בן עוז\nחוות דעת - הרצאות: \nהאמת שלא ראיתי כמעט הרצאות. הבנתי שלא נצרכות למבחן, שהתרגולים מספיקים.\n\nשם המתרגל/ת: בלה מהקלטות עבר.\nחוות דעת - תרגולים: צריך לשים לב, כי ההקלטות לא היו מסונכרנות לסדר של החומר שהועבר הסמסטר. גם בגלל המלחמה אז ירד נושא, אז מי שיראה אותם, לשים לב מה הנושא של התרגול של אותו שבוע.\n\nשעורי הבית: לא עמוסים, אני לקחתי את הקורס יחד עם משרה מלאה, השקעתי משהו כמו 4-5 שעות בתירגול+שיעורי בית, אחת לשבועיים.\n\nהמבחן: בתחושה במהלך המבחן באמת הרגיש קרוב ללא פתיר. אני מבין את כל מי שכתב פה לפניי, אני גם אחד שלא חשוב לו ציון עובר ולא אכפת לי בין 55-100 אז אני לא מתרגש מהציון הסופי, שאני אגב קיבלתי 79, ולא שהתכוננתי הרבה, היה לי בערך יום אחד, שחצי ממנו השלמתי חומר של סוף סמסטר, וחצי פתרתי מבחן והסתכלתי על פתרון של מבחן אחר. \nעוד לא ראיתי סריקה, אבל בשאלות האלה לא חיפשתי תבנית שבלונית לשאלה, אלא מה האפשרויות הניתנות. אולי דווקא כי לא התכוננתי הרבה אז הייתי מוכן יותר לחשוב מחוץ לקופסא.\nאבל בסופו של דבר, באמת יש חוסר התאמה בין דרגת הקושי של שאלות שיעורי הבית, שאתה מניח שזה מה שפחות או יותר יכין אותך לבחינה, לבין המבחן עצמו. \nהשורה התחתונה: חומר מעניין, הסגל לאורך כל הסמסטר זמין לשאלות, גם לפניות להארכה בהגשה על רקע עניינים אישיים, והראה באמת נכונות כל הסמסטר שהוא מבין את המצב של המלחמה ובא לקראתנו. \nסופו של דבר ממוצע המבחן בסוף נמוך ב10 נקודות מהעבר, וגם 10% יותר נכשלים.", "timestamp": 1715507129066}, {"author": "פנקייק", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בלה\nחוות דעת - הרצאות: מרצה בצורה טובה, לפעמים מרגיש שמתעכבת יותר מדי על חלקים מסויימיים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דורשים קצת זמן והשקעה, אבל לא קשים מדי\n\nהמבחן: פשוט זוועה. לא לקחת את הקורס עם בלה. כל הסמסטר הבטיחו לנו שהרמה של הש.ב. מייצגת את הרמה של המבחן. בפועל, המבחן שהיא הביאה לנו יותר קשה מכל מבחני עבר שהיו בקורס אי-פעם, כולל כאשר הקורס מועבר באביב (רק לביולוגים). בנוסף, לאחר שהממוצע היה נמוך משמעותית משנים קודמות, היא לא הייתה מוכנה לקחת אחריות ולבצע שינויים במועד ב' כדי שיהיה ברמה סבירה יותר.\n\nמתוך 4 שאלות במבחן אחת הייתה פשוט לא פתירה, ומי שהצליח לפתור אותה זה רק עניין של מזל (פשוט לנסות מיליון אפשרויות שונות בתקווה שאחת תעבוד), ושאלה נוספת הייתה על נושא שמופיע במבחני עבר (מסלולים מטאבוליים) אבל ברמה הרבה הרבה יותר קשה מבעבר, ושום שאלה דומה לה לא הופיעה בעבר, אף פעם. \n\nהשורה התחתונה: לא לקחת עם בלה. דפק לי את הסמסטר האחרון. לא ראיתי בשום קורס מבחן כל כך מנותק מהקורס, ואני בטכניון 4 שנים.", "timestamp": 1716654932196}, {"author": "~", "difficultyRank": 2, "generalRank": 1, "semester": "202302", "text": "חיכיתי עם לכתוב תגובה עד אחרי המועד ב' כי הייתה לי תקווה שלמרות שהסגל לא היה מוכן להודות בטעות (הענקית) שעשו במועד א', לפחות הם ילמדו ממנה וישפרו את מועד ב לרמה הגיונית. \nכמובן שזה לא קרה\n\nעוד מבחן ארוך מדי עם מקרים שהפעם הראשונה שאנחנו רואים אותם היו במבחן עצמו ושדורש בדיקה של כל האפשרויות, רק כדי להגיע למצב שאתה כותב תשובה שאתה יודע שלא מסתדרת כי אחרי מועד א אמרו לנו שלא משנה מה היינו כותבים, היינו מקבלים נקודות. אז לא צריך באמת לדעת את החומר, פשוט לדעת לחרטט\nזה ממש דופק את מי שאשכרה מבין את החומר ולא רוצה לכתוב שטויות כי זה מזלזל גם בו וגם בסגל שלימד אותו, אבל כנראה שלבלה ולמתרגלות זה לא אכפת כל עוד הן לא צריכות להודות שעשו טעות\n\nכל זה בלי לציין שתיקנו טעות קריטית בשאלה הראשונה, שמשנה את כל התשובה, חצי שעה אחרי תחילת המבחן, ולא נתנו שום תוספת זמן כדי שנספיק לענות על מבחן שגם ככה היה ארוך מדי לזמן שניתן לו\n\nהשורה התחתונה: קורס מעניין, חבל על כאב הלב", "timestamp": 1717143941895}, {"author": "סטודנט שנמאס לו", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "כמו רוב האנשים עשיתי בינג לסרטונים של בלהה,  הגעתי למבחן מוכן אחרי שפתרתי יותר מ20 מבחני עבר עם יכולות סבבה. מה שהיה במועד א ו ב שלנו היה בדיחה, אם תצליחו להשיג את סרטון השעת קבלה של בלה אחרי המועד א תבינו למה ללמוד בטכניון זה הכי גרוע שיש, מרצה שפשוט בטוחה שהיא צודקת, מעדיפה שנכתוב שטויות על המבחן כדי לקבל נקודות מאשר שהיא תלך לסגן דיקן שלה ותגיד היי שלום פישלתי תן להם פקטור. אבל לא. גם זיינה אותנו במועד ב' שאלות מוגזמות שמערבבות את כל הנושאים. מילא שאלה אחת מתוך 4, אבל כל ה4? התעללות..\nמילאאא כל זה, אבל גם לפרסם שאלה עם טעות קריטית, כאילו כל הפאשלות היו פה וכמובן מי שנדפק בסוף זה אנחנו...\nקיבלתי 70 אז למי אכפת .,.", "timestamp": 1717920459945}]}