{"posts": [{"author": "ביותא", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: בני פודבילביץ'\nחוות דעת - הרצאות: מרצה משעמם ברמות, לא כ\"כ מבין הרבה שאלות של סטודנטים אז לא יכול לענות באופן עוזר. הפסקתי ללכת אחרי כמה הרצאות כי זה הרגיש כמו בזבוז זמן. \n\nשם המתרגל/ת: אנואר \nחוות דעת - תרגולים: אנואר חמודה, מתרגלת סבבה. \n\nשעורי הבית: 6 הגשות (להגשה תוך שבוע), מתוכן 5 עם הציון הכי גבוה תקפות. די בסדר. \n\nהמבחן: בסדר  \n\nהשורה התחתונה: קורס שמועבר בצורה משעממת שבא לבכות, אבל אם לומדים בעיקר מהספר ולא מהמרצה - עובר בסדר ואפילו מעניין.", "timestamp": 1600361749118}, {"author": "/", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה:  בני \nחוות דעת - הרצאות: החומר עצמו מעניין, אבל יש קושי שפה + הרבה מושגים, מה שהופך את ההרצאות למשעממות (וחבל). בני מאוד משתדל לעניין, להראות סרטונים וכ\"ו.\nהמצגות עצמן בנויות לא טוב (מאוד ארוכות ולא ברורות), אז להיות חדים איפה הוא בהרצאות. \n\nשם המתרגל/ת: יעל / אנואר \nחוות דעת - תרגולים: לא קשים, שעה אחת אם לא הרבה חומר. חלק מהתרגולים לקחו 15-20 דק' מוקלטות. רמת העמקה בתרגול לא מאוד גבוהה, לא פותרים תרגילים (שזה חבל)\n\nשעורי הבית: גליונות קשים, אבל הציונים שניתנו היו טובים ברובם. בחלק היה צריך לתאם שעת קבלה כדי להבין את השאלות (הרבה מלל, לעתים מיותר לחלוטין).\n\nהמבחן: סמסטר קורונה (2020), המבחן היה קל בכמה רמות מבדר\"כ. טעות של המרצה, לא יקרה שוב. \n\nהשורה התחתונה: קורס חשוב, אבל קשה להתחבר אל ההרצאות.", "timestamp": 1602703293577}, {"author": "Rachel Bitton", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: המרצה והצוות מאוד נחמדים. מאוד באו לקראת הסטודנטים בכל פניה. רק שהם לפעמים לא מסודרים בנוגע להגשות ותאריכים. \nשם המתרגל/ת: \nחוות דעת - תרגולים:  היה קשהלעקוב אחר המתרגלת, היא לא הייתה הכי ברורה\n\nשעורי הבית:  היה צריך לשבת בערך 3-5 להגשה, הגשות מאוד קלילות\n\nהמבחן: \n\nהשורה התחתונה: ממילצה בלום", "timestamp": 1626087430472}, {"author": "א.", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: בנימין פודבילוביץ\nחוות דעת - הרצאות: לא ברורות ומבולגנות\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: מדהימה\n\nשעורי הבית: עמוסים, בדיקה מוגזמת\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1632319030884}, {"author": "ביואינפורמטיקה", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: בני / איילת\nחוות דעת - הרצאות: בני ואיילת העבירו בסמסטר שלנו חצי חצי את תוכן הקורס. הרצאות משעממות ולא מובנות. המון חומר, ירידה לפרטים לא רלוונטיים, מצגות לא מסודרותו זה חבל כי התוכן של הקורס חשוב ומעניין מאוד!\n\nשם המתרגל/ת: מחאסן\nחוות דעת - תרגולים: אחלה מתרגלת, תרגולים מוסיפים חומר על ההרצאות.\n\nשעורי הבית: 3/4 תרגילי בית תקפים. לקרוא מאמרים ולענות על שאלות ולעיתים גם שאלות על החומר מההרצאות/תרגולים. לא קשים במיוחד.\n\nהמבחן: אין מבחן. בסמסטר אביב 22 הקורס הועבר במתכונת של 30% שיעורי בית תקפים (3/4), 40% קריאת מאמר והכנת מצגת של 8 דקות שמסכמת ממצאים עיקריים, מציאת חולשות והצעות להמשך, ומטלה מסכמת ארוכה מאוד (השקעה של חמישה ימי עבודה עליה) שמשקלה 30%.\n\nהשורה התחתונה: אפשר להוציא ציון גבוה. חבל שהקורס לא מועבר בצורה טובה כי החומר מעניין וחשוב.", "timestamp": 1660287076543}, {"author": "eden", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: בני\nחוות דעת - הרצאות: מאוד משעממות (3 שעות!!) ולא מועילות בהבנת החומר. באיזשהו שלב הפסקתי ללכת אליהם. אפשר ללמוד לפני פתירת תרגילי הבית מהסיכום ואפשר גם להיעזר באינטרנט כך שלא צריך להיות נוכחים בהרצאות\n\nשם המתרגל/ת: מחאסן\nחוות דעת - תרגולים: לא מומלצת בכלל, לא הייתה בקיאה הרבה בחומר\n\nשעורי הבית: זוועה, קשים ובמיוחד שהבדיקה הייתה קטנונית מאוד. הפרזנטציה הייתה מאוד לא פיירית מבחינת ניקוד. גם בלי אכיפת נוכחות הם נתנו ציונים מאוד נמוכים אפילו לאנשים שנכחו כל שבוע. \n\nהמבחן: אין\n\nהשורה התחתונה: קורס בלי מבחן אבל כדי להוציא ציון טוב צריך הרבהההה השקעה מכיוון שהם מורידים נקודות סתם", "timestamp": 1666520913898}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אילה ובני\nחוות דעת - הרצאות: שניהם מרצים משעממים, גם המצגות שלהם משעממות וזה מרגיש 3 שעות סיוט. אבל החומר חשוב וגם די מעניין.\n\nשם המתרגל/ת: מחסאן ושי\nחוות דעת - תרגולים: הייתי בקבוצה של שי אבל מחסאן החליפה אותה לפעמים, הרגיש לי ששתיהן לא מתרגלות כאלה טובות, זה הרגיש שהן לא על החומר עד הסוף ולא סגורות בעצמן מה קורה בקורס הזה, היה די בלאגן. ההרצאות והתרגולים מבחינת חומר לא ממש חופפים. \n\nשעורי הבית: מעצבנים ממש, כל מתרגלת כותבת שתי שאלות בערך ובשעת קבלה הן עונות רק על שהאלות שהן כתבו(הזיה בעיני). יש קצת שאלות על החומר ושאלות שצריך לקרוא בשבילן מאמרים, לפעמים די קשים ולא מובנים ולא ברור איך זה קשור לחומר בכלל, סתם מעצבן כי לי זה לא עזר להבין את החומר יותר טוב.\n\nהמבחן: אין, הציון הסופי מורכב מהשיעורי בית ומצגת באורך 7 דקות(אילה עומדת עם סטופר) בזוגות. לא משהו קשה מדי אבל זה הרגיש שהציונים היו רנדומלים והם לא נתנו הערות נורמליות.\n\nהשורה התחתונה: קורס שמועבר בצורה מעצבנת ולא טובה לדעתי, היה עדיף מבחן כי סך הכח זה חומר בסיסי וסופר חשוב להמשך. חבל אבל אין ברירה צריך לעשות אותו.", "timestamp": 1672746170680}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אילה\nחוות דעת - הרצאות: משעממת ביותר, הגעה חובה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nתירגולים לא רלוונטים, נוכחות חובה. \nשעורי הבית: \nציונים גרועים לא משנה מה מידת ההשקעה. ציון טוב נחשב 85. \nהמבחן: אין\n\nהשורה התחתונה: \nאנשים שזה קורס בחירה עבורם תתרחקו כמו מאש, קורס משעמם ברמות ולא מלמד. יש תחושה שצוות הקורס מחפש איפה להוריד ציון לסטודנטים. בקיצור ביוטכנולוגיה ומזון לא ממליצה בכלל תעשו דברים יותר מעניינים.", "timestamp": 1687691532472}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: איילה\nחוות דעת - הרצאות: \nהרבה פוטנציאל להעביר את החומר בצורה מעניינת יותר.\nשם המתרגל/ת: קמילה\nחוות דעת - תרגולים: \nמעניינים, אבל לדעתי אין קשר בין התרגולים לשיעורי הבית\nשעורי הבית: \nמזעזעים, עמוסים, מורכבים. לא משנה כמה השקעתי וישבתי הציונים היו בינוניים, התקטננות מצד הבודקים. \n\nהמבחן: אין מבחן, יש עבודת בית גדולה שמסכמת. עוד לא נפתחה אבל מאמינה שתהיה דומה לשיעורי הבית העמוסים. בנוסף, יש פרזנטציות בזוגות, שהסטודנטים בקהל יכולים לשאול שאלות ולקבל על זה נקודות, לא נראלי לתת נקודות על שאילת שאלות, זה לא יפה בלשון המעטה.\n\nהשורה התחתונה: נוכחות חובה. מי שלא חייב לקחת את הקרוס, אל תתקרבו לקורס הזה!!!!!!!!!", "timestamp": 1687691885586}, {"author": "אורטל מאור", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: איילה\nחוות דעת - הרצאות: ארוכות ומתישות, החומר עצמו מעניין מאוד אבל ההרצאות לצערי פחות\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: הייתי אצלה פעמיים או שלוש במהלך הסמסטר, אכפתית, מעבירה את החומר בצורה מעניינת ועונה על שאלות בצורה טובה\n\nשעורי הבית: \n30%-על הגשת 3 שיעורי בית, בוחרים 3 מתוך 4 \n30%- פרזנטציה בזוגות על מאמר בנושא הקורס (בוחרים מתוך רשימת מאמרים שהם מביאים)\n30%- משימה סופית מסכמת, היה לנו 24 שעות מרגע הפתיחה של המשימה בגוגל\nהציונים על שיעורי בית בינוניים מאוד לרוב 70-80 היו כאלה שהצליחו יותר\nהציונים על הפרזנטציות מעל 90 לרוב \n\n\n\nהמבחן: אין\n\nהשורה התחתונה: קורס עמוס מאוד, בדיקה מאוד קשוחה של תרגילי הבית והתרגיל בית מסכם \nאם הקורס לא חובה אצלכם לא לקחת", "timestamp": 1695203684893}]}