{"posts": [{"author": "Lir", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: מספר סיפורי אלף לילה ולילה בהרצאות. בקושי מדבר לעניין. אמנם מספר לפעמים דברים מענייניםאבל בגדול חסרי תועלת מבחינת התקדמות בחומר.\n\nשם המתרגל/ת: ניר סלינס\nחוות דעת - תרגולים: הוא מעולה\n\nשעורי הבית: במודל, לא קשים, כדאי להשקע ולהבין במהלך הסמסטר, לי זה חסך צורך לחרוש למבחן כי את הרוב ידעתי (הייתי עם יד עלהדופק במקצוע כל הסמסטר).\n\nהמבחן: מילולי ותיאורטי מעצם אופי המקצוע. נחמד והוגן. יש לשים לה שהבודקים מחפשים שתסבירו על ידי מילים ומושגים שלומדים בקורס ולכן תתרגלו לענות ככה על שאלות.\n\nהשורה התחתונה: קורס נחמד ומעניין.", "timestamp": 1597744791409}, {"author": "yam alaluf", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מיכאל גליקמן \nחוות דעת - הרצאות: איטי מאוד ונוטה להתעסקות בתפל .. כל מיני אנקדוטות לא רלוונטיות מומלץ לראות מוקלט במהירות גבוהה ולא הרצאות בלייב \n\nשם המתרגל/ת:מאי  \nחוות דעת - תרגולים: אחלה .. ממוקדת מקצועית ממש עוזרת להפנים את המריחות בהרצאה \n\nשעורי הבית: לא הכי פשוטים אבל גם לא מהגיהנום \n\nהמבחן: דיי קשוח .. אפילו שיש חומר פתוח  \n\nהשורה התחתונה: החומר מעניין הקורס מעיק", "timestamp": 1602951915994}, {"author": "שדגש", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חגי מיכאל גליקמן\nחוות דעת - הרצאות: שעמום בטריוף חבל לבזבז שעתיים בשבוע\n\nשם המתרגל/ת: מאי \nחוות דעת - תרגולים: מהממת מסבירה את החומר מצוין.\n\nשעורי הבית: קצת מבלבלים צריכים השקעה בינונית בערך\n\nהמבחן: \n\nהשורה התחתונה: לא משהו", "timestamp": 1612294475024}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: נחמד, ראיתי מוקלט\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: מדהימה! מלמדת ממש טוב ועושה אווירה כיפית!\n\nשעורי הבית: קצת מעיקים אבל לא קשים\n\nהמבחן: סביר\n\nהשורה התחתונה: לא עפתי", "timestamp": 1613548210801}, {"author": "מאי ליו בתוקלו", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: מיכל גליקמן\nחוות דעת - הרצאות:  \n\nשם המתרגל/ת: מאי ליוון\nחוות דעת - תרגולים: \nלא יודעת את החומר, לא מתייחסת עם סטודנטים בצורה טוה! בן אדם מגעיל!\nשעורי הבית: מבאסות\n\nהמבחן: הוגן אך מורידים נקודות על גלום\n\nהשורה התחתונה: אם זה לא במומלצת אל תקחו את הקורס, או חכו עד שמאי תצא מהסגל :)", "timestamp": 1613568288598}, {"author": "..", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: סבבה, המרצה נחמד, קצת איטי ולפעמים נמרח על משהו או מרחיב מעבר לדרוש.\n\nשם המתרגל/ת: מאי לוין\nחוות דעת - תרגולים: מתרגלת מדהימה! (אחת הטובות ביותר שראיתי) נחמדה מאוד ואכפתית לסטודנטים, מסבירה את החומר בצורה מצוינת, ברורה ומדויקת, כיף להיות בתרגולים שלה. היא גם עונה לשאלות בפורום במודל בתדירות ממש גבוהה וזה מאוד מוערך.\nהתרגולים בכללי נותנים פוקוס טוב לחומר הנדרש בקורס, אפשר ללמוד למבחן כמעט רק מהם.\n\nשעורי הבית: סבבה, לפעמים לוקחים קצת זמן אבל לא נורא (הרוב אמריקאי/הקלדת תשובה סופית, חלק קטן תשובות פתוחות)\n\nהמבחן: לא קל אבל הוגן בהחלט.\n\nהשורה התחתונה: קורס מעניין לדעתי למי שמתעניין בנושא (וכמובן חייב לקחת אותו לפי המומלצת חח)", "timestamp": 1613648814018}, {"author": "שם", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: לא כל כך שימושיות. כל החומר כתוב במצגות והוא לא מוסיף מידע רלוונטי בהרצאות. באופן כללילוקח בערך 2 הרצאות (4 שעות) כדי לעבור על מצגת אחת, ולפעמים אפילו זה לא מספיק וצריך להשלים מהקלטות. גם אפשר לאחר ב5 - 10 דקות להרצאה - לא מפספסים שום דבר.\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: ה-מתרגלת! הודיה מצליחה לגרום לחומר להיות מעניין וקל להבנה גם בשעות מאוחרות (תרגול של 16:30)\n\nשעורי הבית: יש 5 - חלק מהשאלות מרופרנסות, חלק חדשות. המתרגלות מקיימות מפגשי זום שבו אפשר להשוות תשובות עם סטודנטים אחרים ואז אפשר לשאול בקבוצה את המתרגלת שמובילה את המפגש שאלות על החומר.\n\nהמבחן: ממש הוגן - היה לנו אפשרות להשתמש באקסל שהיה ממש אחלה. היה לי יומיים ללמוד למבחן (אחרי מד\"ח וטו\"פ) והצלחתי להוציא ציון ממש גבוה. המבחן היה ממש כמו הבוחן אמצע, שהיה כמו שעורי הבית.\n\nהשורה התחתונה: קורס יחסית קליל שלא דורש המון למידה לפני המבחן.", "timestamp": 1614593526833}, {"author": "Rawaa Nijem", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: לא הלכתי לאף הרצאה אך ממליצה כן להגיע למרות שזה לא מוסיף הרבה להבנת הקורס\n\nשם המתרגל/ת: מאי\nחוות דעת - תרגולים: מתרגלת מדהימה, מסבירה את החומר בצורה פשוטה ומעניינת\n\nשעורי הבית: 5 גליונות תקף, רוב השאלות מרופרנסות\n\nהמבחן: חלק מהשאלות היו די פשוטים, חלק אחר טיפה מורכבות. 5 שאלות עם 4/5 סעיפים לכל שאלה שצריך לפתור ב3 שעות. \n\nהשורה התחתונה: קורס מאוד יפה ומעניין, צריך להיות במעקב לאורך כל הסמסטר ולא ללמוד את הכל מאפס שבוע לפני המבחן", "timestamp": 1614607655810}, {"author": "ביו", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל חגי\nחוות דעת - הרצאות: לא נכנסתי, לרוב גם לא קראתי את המצגות.. רוב החומר מועבר בצורה ממש ברורה ושימושית בתרגולים (שעה בשבוע)\n\nשם המתרגל/ת:  הודיה פרבר\nחוות דעת - תרגולים:  הודיה מדהימה!!! אשכרה גרמה לי להתעניין ולהתלהב מחומר של ביולוגיה וכימיה, 2 נושאים שאני לא ממש מסמפטת.. מסבירה ברור, נותנת דוגמאות מהיומיום, ובכללי אדם נחמד וקשוב.  אחת המתרגלות!\n\nשעורי הבית:  לוקחים זמן, אבל חשוב לעשות לבד ולא לרפרנס על אוטומט - זו הדרך הכי טובה באמת להבין ולהפנים את החומר.\n\nהמבחן:  די עמוס, 3 שעות אבל אין רגע דל.. לגמרי עזר שהיה לנו אופציה לאקסל, למרות שהרבה שאלות חישוביות הלכו לפח אפילו רק אם טעיתי בפלוס/מינוס..\n\nהשורה התחתונה:  קורס די חופר, אבל בסוף עם השקעה לאורך הסמסטר בשיעורי בית - מובן וסביר לחלוטין!\nהרצאות מיותרות, תרגולים נחוצים מאוד.", "timestamp": 1615368531417}, {"author": "Mohammad A.Azab", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות:\nבאופן כללי הוא מסביר טוב, אבל יש נקודות שהוא לא נכנס אליהן, ואז תהיו קצת נודניקים כדי להבין עד הסוף. (דוגמא טובה: זוויות פי וטטא). כדאי לצפות בהם, אבל התמצית שלהם בתרגולים.\n\nשם המתרגל/ת: מאי, אנואר, הודיה.\nחוות דעת - תרגולים: \nשלושתן טובות מאוד. להבין כל מילה בתרגול, כי כל מילה יכולה להיות בסיס לתשובה על שאלה בבחינה.\nשעורי הבית: 5 או 6 בסמסטר, יש רפרנסים אבל לא לכל השאלות. תפתרו ביחד זה מועיל.\n\nהמבחן: לא ממש קשה כפי שאומרים, אבל עמוס מאודדדד. אין לכם דקה אחת לחזור אחורה. הבנה טובה של החומר ולפתור כמה מבחנים מבטיחים ציון טוב בקורס. יש חומר פתוח במבחן וזה דבר מקל מאוד כי לא צריך לזכור, רק להבין ולהכין חומר כתוב/מודפס.\n\nהשורה התחתונה: מעניין, לא קשה, אבל צריך השקעה מסוימת. והכי חשוב: קורס ביולוגי שלא צריך בו לשנן!", "timestamp": 1615555091137}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: מרצה טוב אבל גולש לפעמים לנושאים לא קשורים ולידע כללי, מאוד מעניין למי שאוהב את החומר וגם אוהב לקשר את זה לעולם שבו הוא חי. \n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: הודיה מדהימה והיא הפכה את הקורס הזה לקורס המעניין ביותר בסמסטר! אנרגטית מעניינת ומשתפת וגם בזום היה ממש טוב. בתכלס התרגולים מספיקים כדי לכסות גם תיאוריה אבל לא בכל הנושאים אז כן ממליצה להמשיך עם ההרצאות גם \n\nשעורי הבית: יוצאים אחת לשבועיים בערך ולוקחים זמן אבל מומלץ לעשות ביחד כדי להבין. לא דרוש הרבה זמן וכדאי כי זה נותן הרבה המשכיות והבנה לקורס ולמבחן עצמו\n\nהמבחן: פיירי אבל עמוס עם מעט זמן. צריך לתרגל הרבה מבחנים כדי להצליח בו\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1617109692207}, {"author": "פרולין", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: מעניינות ובקצב טוב, לא מהיר מדי. הרבה פעמים גלש לתחומים מעניינים וקישר את הקורס למציאות.\n\nשם המתרגל/ת: מאי לוין\nחוות דעת - תרגולים: מושלמת! ברורה וסבלנית אבל גם מתקדמת בקצב טוב (למרות שהיו 2 תרגולי השלמה במהלך הסמסטר, אבל לא נורא).\n\nשעורי הבית: היו 6, לרוב פתירים בלי רפרנס. אולי מדי פעם צריך להשוות קצת, ובמקרים נדירים לשבור את הראש למה לעזאזל התכוונו (אבל הפורום שאילת שאלות במודל ממש עוזר וענו שם הרבה).\n\nהמבחן: לצערי עשיתי רק מועד ב' שהרגיש לי עמוס מהרגיל וזה גרר כמה טעויות טיפשיות. רוב המבחנים שתרגלתי היו בסדר, צריך פשוט לתרגל הרבה והשאלות בסוף לא מאוד מאתגרות.\n\nהשורה התחתונה: קורס מעניין וכמעט ולא מעמיס", "timestamp": 1621755559495}, {"author": "---", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: לא ברור לפעמים אם מה שנאמר זה העשרה או החומר שצריך..\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: מתרגלת מדהימה שעושה סדר!!\n\nשעורי הבית: \n\nהמבחן: רמה קצת יותר גבוהה ממה שקורה במהלך הסמסטר. אבל חומר פתוח ולגמרי אפשרי.\n\nהשורה התחתונה:", "timestamp": 1625146680028}, {"author": "איתמר זייד", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  מיטל לנדאו\nחוות דעת - הרצאות: חומר הקורס עבר שינויים השנה ולכן הועבר בצורה מפוזרת ולא כ\"כ ברורה. מאמין שישתפר עם הזמן\n\nשם המתרגל/ת: איציק גולדנברג\nחוות דעת - תרגולים: מפוזרים, אבל כנראה בגלל השינויים בחומר\n\nשעורי הבית: לא תמיד כ\"כ מובנים\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס מעניין בסה\"כ", "timestamp": 1631170568869}, {"author": "ביורפואי :)", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיכאל חגי גליקמן\nחוות דעת - הרצאות: הרצאות מעניינות ממש, מרצה מאוד אכפתי לסטודנטים ומרענן מאוד לראות מרצה כזה. לפעמים מעט נסחף בסיפורי העשרה אבל בעיניי זה מה שגם הפך את הקורס לרלוונטי ומעניין יותר מקורסים אחרים\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: פשוט מדהימה!! מפשטת ממש את החומר, נותנת בדיוק את השורות התחתונות שצריך. עצם זה שהיו לה תרגולים מוקלטים במהלך הסמסטר ממש עזר לחזור על החומר ולסגור את כל הפערים הקטנים\n\nשעורי הבית: לא קצרים אבל לא ארוכים מדי. חשובים להבנה וכדי להיות על החומר, לוקחים בערך שעתיים ויש 5 כאלה במהלך הסמסטר אז זה ממש סביר\n\nהמבחן: בעיניי הוא לא היה קל יותר מסמסטרים קודמים, אבל משום מה ההיסטוגרמה יפה הסמסטר. היה יותר תיאורטי והבנתי ופחות טכני, לטוב ולרע.\n\nהשורה התחתונה: קורס מעשיר ומעניין, לבחירת הסטודנט אם להשקיע ולהכנס לעומק של הדברים או לעבור אותו כעוד קורס. בכל אחת מהאופציות אפשר להוציא אחלה ציון בכל מקרה", "timestamp": 1645974021892}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חגי-מיכאל גליקמן\nחוות דעת - הרצאות: הלכתי בתחילת הסמסטר ואז איבדתי אותו, מאוד מתפזר, בעיניי אפשר להסתדר עם קריאה של המצגות שלו והתרגולים.\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: אין מילים, אחת המתרגלות הכי טובות שפגשתי. תמיד מוכנה לעזור בהכל ויודעת להעביר את החומר בצורה פשוטה ומעניינת. אפשר לראות גם על כפול 2.\n\nשעורי הבית: מתבססים מאוד על החומר שלימדו בתרגול, אחלה דרך לתרגל. בסה\"כ 5 גליונות, הדבר היחיד הוא שהגליונות תקפים ואוהבים להוריד על כל דבר אז צריך לשים לב. יש רפרנסים משנים קודמות בדרייב וזה עוזר\n\nהמבחן: מבחן הוגן, לא שונה משנים קודמות ובאותה רמה של הבוחן אמצע והשיעורי בית\n\nהשורה התחתונה: קורס מומלץ ומעניין, אפשרי מאוד להוציא ציון גבוה", "timestamp": 1646049634179}, {"author": "א", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חגי - מיכאל \nחוות דעת - הרצאות: חגי מרצה מאוד חביב ונעים אין ספק אבל ההרצאות בתכלס מיותרות ולא תורמות לכלום. זה נטו בשביל לא לשמוע את המושגים של התרגול בפעם הראשונה.\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: הודיה האחת והיחידה!! רק להודיה רק. בלעדיה הקורס הזה סתם משעמם. היא מביאה עניין ומסבירה מושלםם בקיצור מביאה איתה חיים לקורס. \n\nשעורי הבית: 5 תרגילים במודל סהכ בסמסטר . חשוב להביו אותם מאוד כי במבחן שאלות דומות . \n\nהמבחן: \n\nהשורה התחתונה: קורס לא מרתק במיוחד אבל גם לא קשה לסיים אותו בציון סבבה שיועיל לכם.", "timestamp": 1646259441212}, {"author": "BME", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חגי מיכאל גליקמן\nחוות דעת - הרצאות: די מעניינות אבל איטיות ויותר משמשות כהעשרה וכניסה קצת יותר לעומק ממה שתכלס צריך למבחן. באיזשהו שלב ויתרתי עליהן, לגמרי אפשר להצליח בקורס בלעדיהן (או לפחות לעבור על המצגות של ההרצאות בקצרה).\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: מתרגלת מעולה, מסבירה מאוד ברור ואת כל מה שצריך לדעת והאווירה בתרגולים ממש טובה.\n\nשעורי הבית: 5 גליונות בסמסטר, חשובים להבנה של החומר. לא יוצר יותר מדי עומס.\n\nהמבחן: הוגן, עם חומר פתוח. אולי היה טיפה יותר קשה משנים קודמות. היה גם בוחן אמצע (גם עם חומר פתוח).\n\nהשורה התחתונה: מהקורסים היותר מעניינים שהיו עד עכשיו ועם מספיק השקעה לגמרי אפשר לסיים עם ציון גבוה.", "timestamp": 1646339504217}, {"author": "-פולי הפפטיד", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: ההרצאות מעניינות, אבל נמרחות מאוד. יש תחושה שמה שמועבר בהרצאה לא כל כך קריטי למבחן, אבל זה לא נכון אם רוצים להוציא ציון גבוה. צריך לדעת על מה המרצה שמה דגש. בסמסטר הזה מיטל הקליטה, ולראות את ההקלטות על מהירות גדולה עזר לי ממש להיות על זה.\n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: לגבי התרגולים עצמם: זה החומר היותר \"תכלסי\" למבחן, לא כדאי לפספס אפילו אחד.\nלגבי הודיה: בלי להגזים, אחת המתרגלות הטובות שיצא לי לפגוש בתואר. לא כולם יתחברו לסגנון ההומוריסטי בהעברת החומר, אבל לדעתי המוטיבציה והאנרגטיות הגבוהה רק עזרה לי לזכור ולהבין. תרגול עם הודיה היה ההיילייט השבועי שלי, עד כדי כך.\n\n\nשעורי הבית: 15% תקף, 4 שאלונים במודל, שאלות קלות יותר מבמבחן אבל קשות יותר מהתרגול. אם פותרים אותן לבד (ומשווים עם חברים) זה מספיק כדי להיות \"על זה\" בסמסטר. \n\nהמבחן: ארוך!!\nהמון שאלות פתוחות וחצי פתוחות (להערכתי לפחות 15 +סעיפים). השאלות מתחכמות ומצריכות הבנה לעומק של החומר. יש נושאים שמופיעים בכל מבחן, ויש נושאים שמופיעים אחת לכמה מבחנים.\nמומלץ להשקיע ולהדפיס סיכום טוב (יש בדרייב) אבל אין צורך להגזים ולהדפיס את כל ההרצאות והתרגולים (אפילו לא כדאי).\n\nהשורה התחתונה: \nקורס חובה אבל מעניין, מבחן ארוך, אבל ריאלי להוציא ציון טוב אם נשארים בעניינים לאורך זמן", "timestamp": 1658225047589}, {"author": "גל", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: מעניינות, אבל זה פחות החומר שבתכלס צריך למבחן. \n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: מדהימה! המתרגלת הכי טובה שנתקלתי בה. מעבירה באמת בצורה מעולה את החומר, בקצב מעולה.\n\nשעורי הבית: לא קשים, יותר קלים מהמבחן.\n\nהמבחן: ארוך מאוד. עם חומר פתוח, מומלץ לדעת בדיוק איפה נמצא כל דבר בחומר שמביאים, אחרת החיפוש יבזבז את הזמן שאין במבחן.\n\nהשורה התחתונה: לא קשה מידי, מעניין.", "timestamp": 1658941555077}, {"author": "הילה", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: אחרי ההרצאה הראשונה הבנתי שלראות אותה בלייב זה להירדם, לא היה דייט שני .\n\nשם המתרגל/ת: הודיה המלכה\nחוות דעת - תרגולים: אין מילים חוץ ממלכה, אין את הקורס הזה בלעדיה והיא כל הקורס . לכו לתרגולים שלה, תהנו, תצחקו ותוציאו ציון גבוה במבחן .\n\nשעורי הבית: לא היו הרבה ומה שהיה, לקח לא יותר משעה \n\nהמבחן: היה ארוך כאורך הגלות (בערך 50 סעיפים במבחן) אבל אם הבנתם את החומר כשלמדתם ואתם זריזים יחסית בכתיבה, אפשר לחלוטין להוציא בו ציון גבוה .\n\nהשורה התחתונה: תלכו לתרגולים, תלמדו ותבינו את החומר טוב לפני המבחן ויהיה ממש בסדר . והודיה מלכה .", "timestamp": 1659093446123}, {"author": "דוד", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: משעממות. מיטל מדברת המון על נושאים שקשורים לחומר, אבל לא על החומר של הקורס עצמו. אפשרי לגמרי לוותר\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: מעולה! הודיה מסבירה בצורה ברורה מאוד, ומביאה המון דוגמאות שעוזרות להבנה\n\nשעורי הבית: לא קשים מדי ולא עמוס. צריך ללכת לתרגול כדי לפתור, מתקטננים בנקודות מורידים על כל שטות\n\nהמבחן: ארוך. התקטננו בבדיקה על הכל.\n\nהשורה התחתונה: סה''כ קורס לא קשה, קצת משעמם ולא יותר מדי עמוס.", "timestamp": 1660724303945}, {"author": "...", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: ההרצאות קצת מרוחות, בעיקר בתחילת הקורס (מרגיש לי שהיה אפשר לצמצם את החמש שש הרצאות הראשונות להרצאה או שתיים). סך הכול החומר של הקורס מעניין, אבל ההרצאות לא תמיד עברו בצורה מעניינת (בעיקר בגלל הקצב האיטי של ההרצאות)\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: המתרגלת הכי טובה שנתקלתי בה, אבל כנראה שהיא מפסיקה לתרגל אז באסה לכם.\nהתרגולים קלילים ודי חשובים להבנה של הקורס ושל אופי השאלות במבחן.\n\nשעורי הבית: קלילים. 3-4 גיליונות במודל, בעיקר שאלות אמריקאיות. הציון עליהם תקף, אבל סך הכול הם די הוגנים.\n\nהמבחן: עמוס ברמות. היו בערך 40 סעיפים במבחן (רובם שווים 2-3 נקודות), אין שנייה לנשום. מה שכן המבחן עם חומר פתוח שזה נחמד.\nדי קשה להוציא במבחן מעל 90 (ובלתי אפשרי להוציא 100), אבל ממש ריאלי לקבל ציון סביב 80.\n\nהשורה התחתונה:  לדעתי קורס ממש מעניין, אבל מועבר בצורה קצת מרוחה.", "timestamp": 1662365394421}, {"author": "הבמ", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: לא טוב, מרצה גרועה ללא כריזמה\n\nשם המתרגל/ת: הודיה פרברי\nחוות דעת - תרגולים: נהדרת\n\nשעורי הבית: בסדר\n\nהמבחן: מסובך מעט, הרבה מקום להתחכמויות\n\nהשורה התחתונה: קורס נחמד, מרצה גרועה", "timestamp": 1666287316025}, {"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: סהכ ממש חמודה, לפעמים מתפזרת בהרצאות אבל רואים שהיא מלמדת את החומר בכיף ועניין \n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: הלוואי הייתה מתרגלת את כל הקורסים שלי\nמתה על החומר ומצליחה להדביק את כולם בהתלהבות שלה\nממש ממש מסבירה טוב גם דברים לא טריוואלים\n\nשעורי הבית: \nלא עמוסים, גליון פעם בשבועיים \nהמבחן: \nבעיניי הסמסטר היה קשה יותר ממבחנים קודמים.. אבל נחכה לציון\nהשורה התחתונה: אין על הודיה", "timestamp": 1676731157566}, {"author": "נופר", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מיטל לנדאו\nחוות דעת - הרצאות: מעניינות אך היא מרחיבה לנושאים רבים בעיקר העשרה שלא רלוונטים למבחן ולתרגולים. בכל מקרה לא הייתי מוותרת, ממליצה לצפות בהקלטות שלה על 1.5 לפחות \n\nשם המתרגל/ת: הודיה פרבר\nחוות דעת - תרגולים: כפרה עליה, מתרגלת עם המון שמחת חיים. בתרגולים מעבירים את מה שצריך לדעת בתכלס, אבל עדיין, השאלות בתרגול ברמה מאוד קלה ולא תרגלנו שאלות ברמת מבחן\n\nשעורי הבית: 15% תקף, בעיקר שאלות אמריקאיות ולפעמים פתוחות במודל, ברמה די נמוכה ולא משקפות את הרמה במבחן\n\nהמבחן: החליטו הסמסטר לשנות את מבנה המבחן ואת אופי השאלות, מבחן מאוד קשה, לא הכינו אותנו לשאלות כאלו בכלל, שאלות עם המון סעיפים שלא הספקנו לפתור במסגרת הזמן. מאוד מבאס ולא הוגן\n\nהשורה התחתונה: קורס מעניין אבל לא באמת נתנו לנו מספיק תרגול וכלים על מנת לפתור את המבחן הזה.", "timestamp": 1677329586684}, {"author": "Alex Kantorowitz", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות:הרצאות מעניינות עם הרבה ערך מוסף אבל קצת איטיות. יש הקלטות נוחות מאד. \n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: מעבירה את החומר בצורה מעניינת ברורה  ונגישה. יש אווירה טובה בכיתה והשיעורים עוברים מהר.\n\nשעורי הבית: לאקשים במיוחד, לפעמים יש שאלות מטעות אבל צוות הקורס מאד זמין לשאלות.\n\nהמבחן: הרבה יותר קשה מהשיעורי בית. דורש הבנה מעמיקה ומדוייקת של החומר.\n\nהשורה התחתונה:", "timestamp": 1679306615554}, {"author": "מ", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: הכי טובה אבל אמרה שכבר לא תתרגל, בטח יהיו הקלטות שלה, ממש מומלצת\n\nשעורי הבית:  סבבה לא עמוסים מידיי , בשאלות הפתוחות לוודא עם חברים ועם המתרגלים לפני שמגישים אבל כל השאר אמריקאיות רגועות\n\nהמבחן: אצלנו היא ממש התלהבה פתאם ממוטציות והיה קצת קשוח אבל יחסית פייר. החומר פתוח אבל הייתי ממליץ לבנות דף נוסחאות במהלך הסמסטר של מה שבאמת צריך ולא להביא הרבה מידיי חומר כי אז סתתם הולכים לאיבוד\n\nהשורה התחתונה: החומר עצמו מעניין בטירוף! קורס סבבי", "timestamp": 1679667815314}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיכאל גליקמן '  \nחוות דעת - הרצאות: אמיתי לא הייתי בהרצאות \nהקצב שלו איטי יוצא מהנושא לפעמים וקשה להתרכז איתו עומד באותו מקום שעה וחצי \nכדאי לראות את ההרצאות מוקלט במהירות *2  \n\n' שם המתרגל/ת: הודיה  ובדר מוקלט\n חוות דעת - תרגולים: שניהם מקסימים והתרגולים שלהם מסקמים \n\nשעורי הבית:לא קשים כדאי להבין את החומר ואז שעורי בית יהיו קלים\n \nהמבחן: הוגן \nהשורה התחתונה: קורס מעניין וכדי להשקיע מהתחלה", "timestamp": 1689349288667}, {"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חגי מיכאל\nחוות דעת - הרצאות: \nבקושי הגעתי אבל הוא הקליט בזום אז היה אפשר להשלים\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: \nמדהיםםםם. הסתמכתי רק על התרגולים, ויש הקלטות משנים קודמות\nשעורי הבית: \nלי היו קצת קשים אבל רק 5 גיליונות לאורך הסמסטר\nהמבחן: \nחומר פתוח, דורש חשיבה\nהשורה התחתונה: \nקורס ממש מעניין, לי היה טיפה קשה אבל בכללי ממש מומלץ", "timestamp": 1689497388844}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: \nמיכאל בסך הכל מרצה חביב. אמנם ההרצאות שלו לא מועברות הכי מדהים ויש לו כמות לא פרופורציונלית של סיפורי רקע אבל הוא מאוד מתלהב מהחומר וממש חשוב לו שסטודנטים יבינו על מה הוא מדבר. בגדול אם הוא היה מוריד את כמות סיפורי אלף לילה ולילה וממש מתמקד בהעברה של החומר לדעתי זה היה יותר טוב אבל הוא בכל זאת הקדיש זמן לשאלות ולהסברים נוספים. אישית פחות אהבתי את הפישוט של החומרים שקשורים לכימיה שהוא העביר וזה הרגיש לי לא ממצה וההסברים היו עקומים, מצד שני אני כימאית אז נראה לי שהצפייה שלי גבוהה מהממוצע בכל מה שקשור לכימיה.\n\nשם המתרגל/ת: בדר ריאן\nחוות דעת - תרגולים: \nבדר מתרגל מדהים! הוא מעביר את החומר בפשטות, מוודא שכולם מבינים, נותן המון מקום לשאלות ומביא שאלות נוספות מעבר לתרגול הסטנדרטי. הוא נותן המון דגשים חשובים והמלצות איך לגשת לשאלות והוא עשה לנו שני תרגולי חזרה למבחן כי הוא סיים את החומר מוקדם ביחס למתרגלות האחרות.\n\nשעורי הבית: \nהיו 5 תרגילי בית, כולם חובה. בגדול התרגילים סבירים אבל הם הרבה פעמים הונחתו עלינו, אמרו לנו ביום של פרסום התרגיל שהוא יפורסם היום ונתנו בערך שבוע להגשה. התרגילים היו ברובם קשורים לחומר ורלוונטיים לנושאים שנלמדו אבל היו גם כמה שאלות שהיו מנותקות ולא קשורות בכלל.\n\nבוחן אמצע:\nיחסית לזה שזה קורס של 2.5 נ\"ז זה שהיה בוחן אמצע זה די הזיה. מצד שני הבוחן אמצע היה מגן ונתן אפשרות להכיר את סגנון השאלות והניסוחים של סגל הקורס (בעיקרון כל חבר סגל כתב שאלה). בבוחן היו שאלות על דברים אנקדוטליים שהועברו בשלוש דקות בסוף הרצאה והוא היה ממש אורך מידי ביחס לזמן שנקבע עבורו. אמנם נתנו פקטור של 4 נקודות אבל ביחס לזמן שהושקע ללימודים לבוחן הזה ובכמה הוא משמעותי ביחס לציון הסופי אני לא בטוחה שהיה כזה שווה לגשת.\n\nהמבחן: \nסך הכל המבחן לא היה קל אבל היה הוגן, לא היו המצאות ולא היו שאלות אנקדוטליות. השאלות כן היו מורכבות ודרשו המון הבנה של החומר ושל ניואנסים שהועברו להרגשתי ממש טוב בתרגולים אז אם אתם יכולים לכו לתרגולים של בדר (או לכל הפחות תקשיבו להקלטות). \n\nהשורה התחתונה: \nקורס חמוד מאוד שנותן בסיס לעבודה ביולוגית ולהבנה של חלבונים בכלל ואנזימים בפרט (למרות שהאנזימים הוזכרו רק בשתי ההרצאות האחרונות של הקורס). אם אתם נהנים מביולוגיה וחושבים שהבנה של איך חלבונים עובדים זה מגניב לגמרי הייתי לוקחת את הקורס.", "timestamp": 1689568959840}, {"author": "היסטידין 143", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: מיכאל גליקמן\nחוות דעת - הרצאות: איטיות, לא ממוקדות. הוא בורח להמון \"נושאים מעניינם\" שמעניינים רק אותו. קשה לעקוב אחריו, לא מאד כריזמטי. עם זאת, כן מאד חשוב אני חושב להגיע להרצאות / לפחות לראות מוקלט כי הקורס הזה בבסיסו תיאורטי וקשה להבין את כל החומר של התרגולים בלי לראות את ההרצאות. \n\nשם המתרגל/ת: פלג\nחוות דעת - תרגולים: פלג מאד חמודה וסבלנית אבל עדיין קצת פחות טובה מהודיה, אם יש לכם אפשרות תלכו להודיה, אבל גם פלג בסדר. \n\nשעורי הבית: 5 גיליונות קלילים במודל. לא השקעתי בהם יותר מדי זמן כל הסמסטר\n\nהמבחן: לחרוש לפני ויהיה בסדר. חשוב להבין את החומר ברמה התיאורטית הרבה יותר מברמה הטכנית\n\nהשורה התחתונה: לא הייתי לוקח כבחירה, אבל אם זה קורס חובה בשבילכם - תנסו למצוא בו עניין, החומר באמת מעניין, רק צריך לנווט דרך הסגל", "timestamp": 1689584899569}, {"author": "...", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: הייתי בהרצאה הראשונה ומאז לא חזרתי. הרצאות מעניינות אבל מיכאל מדבר סופר לאט ועל מלא דברים מסביב שזה טוב אם ממש מתעניינים אבל בזבוז זמן טוטאלי הלכתי רק לתרגולים וזה מספיק.\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: הכי טובה שיש בפער אבל היא מפסיקה לתרגל כנראה..\n\nשעורי הבית: פעם בשבוע אפילו פחות, הם לא קשים מאוד אבל דורשים חשיבה מעמיקה. \n\nהמבחן: היה הוגן מאוד, אם יודעים את החומר כמו שצריך הוא אפילו די קל.\n\nהשורה התחתונה: קורס ממש נחמד לא כבד מבחינת חומר והבנה, דלגו על ההרצאות ממש מספיק רק תרגולים.", "timestamp": 1689669671615}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיכאל\n\nחוות דעת - הרצאות: לא מסכימה עם מה שאומרים על זה שההרצאות מיותרות- אני דווקא כן הרגשתי שהן עוזרות לי להבין יותר את החומר. אפשר (ואפילו מומלץ) לראות רק את ההקלטות על 1.5.\n\nשם המתרגל/ת: הודיה\n\nחוות דעת - תרגולים: \nטובה ממש אבל אצלינו לפחות הכיתה שלה הייתה מפוצצת מה שמאוד הקשה. ראיתי גם הרבה הקלטות של המתרגלים האחרים והם גם טובים, אם אין מקום לגמרי אפשר ללכת אליהם.\n\nשעורי הבית: \n5 גלינות במודל, הרוב אמריקאי אבל גם כמה שאלות פתוחות. לחלק מהשאלות יש רפרנסים, כדאי לוודא שהתשובה באמת נכונה אם רוצים לקבל ציון טוב. השיעורי בית לא קלים אבל גם לא מאוד ארוכים ככה שהם לא דורשים יותר מדי השקעה במהלך הסמסטר.\n\nהמבחן: \nלא קל אבל הוגן.\n\nהשורה התחתונה: \nקורס מעניין סה\"כ, לא דורש יותר מדי השקעה אבל מצד שני גם לא מאוד קל כמו שמתארים אותו.", "timestamp": 1690733874566}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ארנון\nחוות דעת - הרצאות: הייתי פעם אחת ולא הלכתי שוב. בגדול הוא מרצה לתואר שני שהרצה פעם ראשונה לתואר ראשון וזה די הורגש. הוא מאוד מתלהב מהחומר ומדבר המוןןן, הבנתי מחברים שכן היו בהרצאות שהוא גלש לדבר כלכך הרבה על דברים שלא היו במצגות/ לא חלק מהחומר הנדרש. הוא היה ממש נחמד ואכפתי וקשוב לסטודנטים בשעות קבלה.\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: הלכתי רק לתרגולים! בתרגולים לא בדיוק מתרגלים שאלות אלא יותר המתרגלת פשוט מעבירה את החומר בעצמה... זה לא לגמרי מכסה הכל אבל הודיה הייתה מהממת והסבירה ממש טוב. כן עשינו כמה שאלות בודדות בסיום כל תרגול. \n\nשעורי הבית: היו סהכ 4 כל הסמסטר, היו יחסית סבבה, לא עמוסים, לפעמים לא היו מובנים כלכך ושאלנו עליהם בשעות קבלה כי לא היה ברור למה מתכוונים אבל ממש לא עמוס\n\nהשורה התחתונה: קורס חמוד עם חומר ממש אחלה! לא עמוס מדי", "timestamp": 1714246703615}, {"author": "Aviva Peimer", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ארנון\nחוות דעת - הרצאות: מאוד נחמד אבל די מונוטוני, הולך מסביב לנקודה. לא נהנתי במיוחד ואף פעם לא הייתי ממש מרוכזת. באתי בעיקר בגלל הפומו.\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: בין המתרגלות היותר טובות שיצא לי ללמוד אצלן.\n\nשעורי הבית: לנו היו רק 4 משימות. קצת ארוכות אבל כדאי להשקיע בהן (בסוף 20 אחוז מהציון הסופי וכן מחדד הבנה)\n\nהמבחן: פייר. לא ניסו להתחכם איתנו ולא בדקו בצורה מרושעת.\n\nהשורה התחתונה: לאוהבי הביולוגיה מומלץ בחום. לשונאי הביולוגיה - תחזיקו חזק זה יעבור בשלום.", "timestamp": 1716741595722}, {"author": "D", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: מעולה, מסבירה את החומר מההרצאות\n\nשעורי הבית: 5 גיליונות לא קשים\n\nהמבחן: עם חומר פתוח, די הוגן.\n\nהשורה התחתונה:", "timestamp": 1717265087793}, {"author": "ליים בת אל", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ארנון חן \nחוות דעת - הרצאות: הוא מתוק מתוק מתוק. ממש עוזר במהלך הסמסטר ותקופת המבחנים, עונה לשאלות במהרה, ממש גרם לי להרגיש מוערכת בקורס. מרצה סביר. \n\nשם המתרגל/ת: הודיה פרבר חן \nחוות דעת - תרגולים: מלכה. למי שלא יהיה אותה, תראו את ההקלטות שלה אפילו את זה אף מתרגל אחר לא מביס כרגע. \n\nשעורי הבית: יש 4 גיליונות ממוחשבים במהלך הסמסטר, לא קשים אבל כן צריך לשבת 2-3 שעות לפתור ולשאול שאלות. \n\nהמבחן: חומר פתוח, שאלות פתוחות מרובות סעיפים. אם אתם לא יודעים קצת לא יורדות הרבה נקודות, אבל יש הרבה סעיפים אז כמו שיש הרבה הזדמנויות להרוויח נקודות יש הזדמנויות ליפול. להביא את הסיכום של שיר איתן, מבחנים שפתרתם, ואולי סיכום של ההרצאות (אם שואלים על משהו איזוטרי).\n\nהשורה התחתונה: קורס נחמד האמת, לא עמוס יותר מידי", "timestamp": 1718533735080}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ארנון חן \nחוות דעת - הרצאות: מרצה סביר סה\"כ, פעם ראשונה שהרצה את הקורס הזה, בהתחלה היה בטוח שהוא מלמד תואר שני אבל זה השתפר מעט.. כן ממליצה להגיע להרצאות כי ההקלטות לא ממש אפשריות לצפייה. בן אדם מאוד חמוד וחשוב לו אבל. \n\nשם המתרגל/ת: הודיה בהקלטות, ואנואר בלייב \nחוות דעת - תרגולים: אנואר מתרגלת אחראית מהממת וחמודה חשוב לה שנצליח ונבין! באיזשהו שלב עברתי להקלטות שם הודיה גם מצחיקה ומעבירה את התרגולים בזרימה כזאת עם המון כריזמטיות. \n\nשעורי הבית: 4 גליונות לא מסובכים מדי וכן קשורים לחומר. עוזר להתחבר לחומר הנלמד דרכם. \n\nהמבחן: חומר פתוח- אני אישית לא מתחברת לקונספט.. מועד א היה הוגן ומועד ב טיפה יותר קשה לדעתי- עדיין, מאוד מתחשבים בבדיקה ואם אתה מסביר את עצמך טוב תקבל נקודות גם על תשובה לא מדויקת בהכרח. \n\nהשורה התחתונה: קורס ממש מעניין וחמוד, צוות טוב, אוהבי הביולוגיה ממש יהנו לדעתי.", "timestamp": 1718557514704}]}