{"posts": [{"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל מנדל גויטפרוינד\nחוות דעת - הרצאות: סכה\"כ בסדר. יעל שומרת על אווירה נעימה ומנסה להראות את רלוונטיות הנושא לתארים ביולוגיים.\nבסוף את נושא העבודה הסטודנטים בוחרים ויש סיכוי טוב שהרבה מהחומר הנלמד לא יהיה רלוונטי לטובת ההערכה. \n\nשם המתרגל/ת: דור שליו\nחוות דעת - תרגולים: טובים, אינפורמטיביים. בתרגולים הראשונים בעיקר מתכנתים ומדברים על כלים בR. המידע שצריך לשיעורי הבית נמצא ברובו בתרגול. קשה לתרגל תוך כדי התרגול עצמו אבל צריך לעבור על זה בבית כדי לפתור את ההגשות. דור ממש נחמד וזמין לשאלות ושעות קבלה.\n\nשעורי הבית: 3 הגשות, אחת מאוד ארוכה, 2 סבירות. ההגשה הרביעית היא פרזנטציה לכיתה על הנושא שבוחרים לפרוייקט.\n\nהמבחן: \nפרוייקט פוסטר. לעבוד בתוכנת תכנות על נושא כלשהו מתוך רשימה של נושאים שהוצעו ע\"י יעל ודור. יעל\\דור\\דוקטורנטית חיצונית מלווים את הפרוייקט. מאוד תלוי כמה מבקשים עזרה. את הפרוייקט עושים עצמאית ומעצבים בסופו פוסטר שמגישים ביום פוסטרים ל2-3 בוחנים.\nהחווייה של בחינה שכזו הייתה קצת שנוייה במחלוקת, לעומת ההשקעה שעשינו בפוסטר וההכנה להציג אותו- ההרגשה הייתה מאוד בוחנת ולעתים לא נעימה מצד הבוחנים.\nהשורה התחתונה: \nציונים גבוהים מאוד, אפשר לצאת עם 90+ אם משקיעים במטלות גם אם היה יום פוסטרים לא מוצלח", "timestamp": 1650821721135}, {"author": "עדן", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: יעל לא עוזרת בכלל. תמיד מחפשת על קטנות. הציונים שהייא נותנת לא משקפים את ההשקעה לאורך הסמסטר\n\nשם המתרגל/ת: דור\nחוות דעת - תרגולים: דור מהמם. עוזר ממש\n\nשעורי הבית: סיוט\n\nהמבחן: אין\n\nהשורה התחתונה: קורס בחירה אך צריך הרבה השקעה", "timestamp": 1680177002803}, {"author": "גטסבי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יעל \nחוות דעת - הרצאות: הרצאות מועברות בצורה טובה, מסבירה את תחום הביואינפורמטיקה בצורה מעולה. \n\nשם המתרגל/ת: דור\nחוות דעת - תרגולים: \nדור מקסים וממש רוצה לעזור לכם, מפשט את הנושאים הקשים והתרגולים שלו ממש טובים.  \n\nשעורי הבית: היו 4 שיעורי בית, צריך לכתוב קוד ב R, אם תתקלו במשהוא ( זה יקרה ) דור יעזור לכם.\n\nהמבחן: אין\nיש פרויקט סופי, שצריך לעשות פרזנטציה במהלך הסמסטר, ופוסטר שמציגים אותו לאחר הבחינות.\nהשורה התחתונה: \nקורס ממש מומלץ למישהוא שמתעניין בתחום הביואינפורמטיקה, אתם נחשפים להרבה כלים והרבה קוד.", "timestamp": 1713461188548}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יעל מנדל\nחוות דעת - הרצאות: ההרצאות משעממות ואין שום סיבה להגיע להרצאות. \n\nשם המתרגל/ת: דור\nחוות דעת - תרגולים: מתרגל מעולה, ברור, מובן. התרגולים בנויים בצורה טובה. \n\nשעורי הבית: 4 תרגילי בית בתכנות\n\nהמבחן: אין מבחן, יש פרוייקט. סתם הנפיצו ציונים וזה מאוד מכעיס. המרצה אפילו לא הגיעה לבדוק את הפרוייקט, אין לה מושג מה עשינו בפרוייקט והיא סתם נתנה לנו ציון. אם המרצה תאהב אתכם תקבלו ציון גבוה גם אם לא תשקיעו בכלל. היא נותנת ציונים לפי מה שהיא רוצה ולא לפי הפרוייקט.\nהשורה התחתונה: לא מומלץ בגלל ההרצאות ודרך מתן הציון.", "timestamp": 1718534354215}]}