{"posts": [{"author": "בקרה", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יעל מנדל\nחוות דעת - הרצאות: וואו יעל מדהימה! מרצה מעולה, מעניינת, כריזמטית, ומקסימה. באמת תענוג. היא גם מעדכנת בשוטף את הקורס, כך שהוא מאוד אקטואלי - נלמדים מאמרים חדשים לגמרי ומנגנונים שהרגע התגלו. דבר נדיר יחסית ומאוד מורגש. \n\nשם המתרגל/ת: אמיר ארגואטי, עופרי לוי\nחוות דעת - תרגולים: שני המתרגלים מעולים - אמיר קצת יותר מהיר בעוד עופרי יותר איטי ומסביר לעומק יותר. בכ\"מ, מורגשת ההשקעה שלהם ותשומת הלב לסטודנטים, עם רצון כן שכולם יבינו לעומק. \n\nשעורי הבית: 5 ת\"ב עם שבועיים להגשה, כאשר לאחרון יצא ~10 ימים ובכך כך הנפח שלו היה קטן משל הקודמים. התרגילים קשים ובאמת דורשים הרבה השקעה ומחשבה רצינית - אבל מכינים מעולה למבחן. מומלץ לעשות בהשקעה. \n\nהמבחן: דורש הבנה אמיתית, חרישה לפני לא תספיק. לא קל אבל מי שמבין - מסתדר טוב. גם אם ההסבר שלך לא היה בדיוק מה שהם כיוונו אליו, אם היה הגיון ביולוגי במה שכתבת, זה התקבל. אז באמת 100% קורס הבנתי, מעט מאוד זיכרון (יש דף נוסחאות 4 עמודים שכל אחד מביא לעצמו).\n\nהשורה התחתונה: קורס מעניין עם סגל מדהים. מומלץ בחום.", "timestamp": 1600361382876}, {"author": "not important", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יעיל\nחוות דעת - הרצאות: חומר ההרצאות מעניין ומרתק!\n\nשם המתרגל/ת: עופרי לוי\nחוות דעת - תרגולים: המתרגל הכי טוב\n\nשעורי הבית: קשים מאוד\n\nהמבחן: המבחן מגיהינום :[  \n\nהשורה התחתונה: good luck passing :P", "timestamp": 1601766704710}, {"author": "/", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מצוינות. יעל מאוד מעניינת, החומר עדכני ורלוונטי, ומועבר בצורה ברורה ומדויקת.  \n\nשם המתרגל/ת: עופרי / אמיר\nחוות דעת - תרגולים: שניהם טובים. מדבריחם בעיקר על שיטות ביולוגיות (קריטי בשביל להבין את המבחן אחרי זה)\n\nשעורי הבית: קשים, ברמה של המבחן. הציונים היו בסדר ברוב הגליונות. \n\nהמבחן: מאוד דומה לשיעורי הבית. מתבסס על ניתוח של תוצאות ניסוי (תרגול) והתאמה לחומר הקורס (הרצאה). \nאפשר להביא 4 דפים, לא צריך יותר מזה. בסה\"כ זרמו על תשובות כל עוד היה הגיוני. \n\nהשורה התחתונה: קורס מומלץ, מאוד מעניין + מועבר טוב.", "timestamp": 1602704032546}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: פרופ' יעל מנדל\nחוות דעת - הרצאות: איטי מאד. מעניין אם שומעים במהירות כפולה אחרת אי אפשר להקשיב ברצף ומאבדים ריכוז\n\nשם המתרגל/ת: עופרי לוי\nחוות דעת - תרגולים: מסביר טוב ומעניין\n\nשעורי הבית: קצת חופרים, חובה להגיש הכל, כמעט ולא מרופרנס\n\nהמבחן: בסדר\n\nהשורה התחתונה: קורס חשוב גם אם הוא קצת משעמם לפעמים, כדאי לקחת", "timestamp": 1608819791425}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: קשה להבחין בין חומר הקורס לבין סיפורי רקע, חומר בינוני מבחינת עניין \n\nשם המתרגל/ת: עופרי/ אמיר\nחוות דעת - תרגולים: מתרגלים סבבה לגמרי \n\nשעורי הבית: 5 תרגילים אחת לשבוע- שבועיים לא נוראיים \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626006156562}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות. החומר ענייני ועזר לדעתי להבין הרבה מאמרים בהמשך. עדיף לצפות במהירות כפולה.\n\nשם המתרגל/ת: עופרי\nחוות דעת - תרגולים: כדאי להגיע\n\nשעורי הבית: תרגילי הבית דומים מאוד למבנה המבחן ומתרגלים את החומר. אפשר להבין מתרגילי הבית על מה הם רוצים שנתמקד. תרגילי הבית כן דורשים הרבה זמן מחשבה ולא תמיד הדברים ברורים. לרוב אין רפרנסים.\n\nהמבחן: סגנון תרגילי הבית. לדעתי זמן המבחן קצר יחסית למבחן עצמו. הרבה לא סיימו את המבחן בזמן. המבחן דורש הרבה מחשבה ועם לחץ של מבחן ולחת הזמן זה דיי קשה. השאלות ארוכות עם הרבה סעיפים לפעמים הולכים לאיבוד.\n\nהשורה התחתונה: קורס מאוד מעניין סה״כ. חבל רק שהמבחן מאוד קשה.", "timestamp": 1631184632287}, {"author": "ביואינפורמטיקה", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעל מנדל גוטרפרוינד\nחוות דעת - הרצאות: החומר מעניין וחשוב אבל ההרצאות יכולות להיות קצת משעממות (כפול 2 מומלץ)\nלא מסובך, אין המון חומר וירידה לפרטים לא רלוונטיים, נלמד ברמת המאקרו.\n\nשם המתרגל/ת: מאיה / אמיר\nחוות דעת - תרגולים: שניהם מתרגלים טובים, תרגולים לא קשים ובעיקר מוסיפים חומר על ההרצאות- שיטות ניסוייות וחישוביות ועוד.\n\nשעורי הבית: חמישה תרגילי בית לא פשוטים ודורשים השקעה, ללכת לשעת קבלה כדי לקבל הבהרות. 20% תקף.\n\nהמבחן: מבחן לא קל. יש דף עזר (4 עמודים) כך שלא צריך לשנן שום דבר ובעיקר להבין. אם פותרים הרבה מבחנים מבינים את הרעיון.\n\nהשורה התחתונה: קורס מעניין ומקיף, דורש השקעה של בערך 9 שעות בשבוע (כולל הרצאות, תרגולים ותרגילי בית)", "timestamp": 1660286741820}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: משעממות כי היא מרצה די משעממת, אם יש הקלטות עדיף כי אפשר להריץ אותה היא מדברת לאט ממש.\n\nשם המתרגל/ת: מאיה\nחוות דעת - תרגולים: סך הכל התרגולים בסדר, מאיה ממש חמודה וממש מנסה להסביר את החומר בצורה טובה.\n\nשעורי הבית: לא פשוטים, מצריכים חשיבה, חזרה על החומר והבנה טובה שלו, אבל עוזרים למבחן. \n\nהמבחן: לא קל, יעל והמתרגלים גם מודעים לזה, אבל אם עושים מבחנים משנים קודמות הקונספט חוזר על עצמו ואפשר להוציא ציון טוב.\n\nהשורה התחתונה: קורס חובה אין ברירה", "timestamp": 1672746376451}]}