{"posts": [{"author": "לידור אוסמו", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא היו שיעורי בית.\n\nהמבחן: מבחן בחלקו אמריקאי, חלק מהשאלות ממוחזרות, לא קשה בכלל. חלק שני 5 שאלות פתוחות, בחירה מתוך 6. חלק מהשאלות הופיעו בשאלות הכנה שניתנו במהלך הסמסטר, על החומר ובלי התחכמויות.\n\nהשורה התחתונה: המקצוע כמעט ולא דורש, מעניין יחסית והלמידה למבחן קלילה (יום אחד מספיק).", "timestamp": 1598353907991}, {"author": "הברירה הטבעית", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: שי מהמרצים המסודרים והרציניים ביותר שיצא לי לפגוש. ללא ספק העלה את רמת הקורס לרמת איכות גבוהה מאוד ביחס לנקז ולמרצי עבר. בכל הרצאה מדברים על היבט אחר באבולוציה, מה ששומר על קו מסוים משבוע לשבוע.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: המבחן טריקי. אל תקשיבו לאנשים שקיבלו 100 וישר שכחו כמה עצבים הם שרפו עליו. המבחנים מהשנים הקודמות סותרים אחד את השני, לכן כדאי לקחת שאלות מסוימות בעירבון מוגבל ולהיצמד עד כמה שניתן לסיכום. שי ממחזר הרבה מהשאלות, לכן גם אין סריקות לאחרונה, אבל מה שיש מספיק. הרוב היה אמריקאי והיו 5 שאלות פתוחות, לקח 3-4 ימי למידה לא לחוצים.\n\nהשורה התחתונה: קורס מעניין מאוד, שמספק את התמונה הגדולה למדע הביולוגיה ככלל. אם לחוץ, אפשר להכחיש קצת במהלך הסמסטר, אבל לא לשכוח שבסוף נבחנים על מה שנאמר בכיתה.", "timestamp": 1626381387488}, {"author": "אל", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שיר יעיש\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: פתוח+אמריקאי, הרבה ממוחזר, לא קשה\n\nהשורה התחתונה: אפשר ללמוד מ0 ב4 ימים ואפילו פחות", "timestamp": 1626956214190}, {"author": "Yaniv Slor Futterman", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: מרצה משעמם. לא מומלץ להגיע פיזית. עדיף לראות הקלטות מ-2012. החומר כמעט זהה והמרצה שם מצוין.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: \n\nהשורה התחתונה: קורס חמוד. מאוד מאוד קל.", "timestamp": 1658682531078}, {"author": "סטודנט ממדמ\"ל", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: \nשי מרצה טוב - הוא מכיר את התחום ומסביר בצורה טובה, המצגות טובות והוא מדגיש נושאים מעניינים וחשובים, ותמיד פתוח לשאלות מהסטודנטים ועונה לעניין. הגעתי לכל ההרצאות פיזית, ממליץ לכם לעשות את זה! אחרת כשתתרגלו לקראת המבחן לא תבינו מה רלוונטי ומה לא רלוונטי, בגלל שחלק מהנושאים שנשאלים לגביהם במבחנים ישנים לא רלוונטים כבר. מאוד מומלץ להגיע להרצאות פיזית לדעתי ולהקשיב, לא רק כי ההרצאות מעניינות אלא גם כי כך הלמידה למבחן תהיה קצרה יותר ויותר נסבלת. חשוב להגיד שלא מסכים *בכלל* עם הביקורת שטוענת ששי מרצה גרוע ומשעמם שקיימת משנה שעברה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש אפשרות לבחור חיה אקזוטית/מעניינת/שקשורה להתפתחויות אבולוציוניות ולהציג מצגת לגביה בכיתה לבד/עם שותף, במשך כ5-10 דקות. זה מוסיף בין 2 לבין 4 נקודות לציון הסופי. מומלץ, זה יכול להגן עליכם מאיזה שאלה אמריקאית שאולי לא מנוסחת בצורה הכי טובה.\n\nהמבחן: מבנה המבחן הוא 6 שאלות פתוחות מתוכן צריך לבחור 5 בלבד, ולענות בלכל היותר 3 משפטים. אלו שאלות שמצריכות יכולת לבטא במילים ולהבין בצורה יחסית טובה את החומר. האפשרות לבחור עוזרת. בנוסף יש 20 שאלות אמריקאיות שכל אחת מהן היא 3 נקודות. השאלות האמריקאיות ממוחזרות, להערכתי לפחות חצי ממוחזרות. המיחזור הוא בעיקר ממבחני עבר של שי, יש בדרייב של ביולוגיה את 2 המבחנים שלו מאביב 20. בנוסף חלק מהשאלות לקוחות מהמבחנים של 2013-2014. בקיצור מומלץ לעבור על הדרייב ולתרגל את כל הבחנים והמבחנים משם, ולהבין מה לא רלוונטי למתכונת הנוכחית של הקורס. עברתי על החומר של הקורס במשך יומיים, ועוד יום אחד של נטו תרגול מבחנים (וגם בחנים שזמינים בדרייב) וזה לגמרי הספיק (אבל זה גם בגלל שהייתי בקשב לאורך הסמסטר). בסוף השאלות חוזרות על עצמן.\n\nהשורה התחתונה: קורס מעניין, שווה לקחת אותו גם מעבר לציון הטוב שאפשר לקבל אם משקיעים.", "timestamp": 1688993741999}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שי שטרן\nחוות דעת - הרצאות: \nמרצה טוב, מעביר את החומר בצורה מסודרת ומעניינת. לאורך הסמסטר הגעתי כמעט לכל ההרצאות הפרונטליות וזה השתלם כי החומר ששי מעביר לפעמים קצת שונה מהמוקלט וגם כי בסופו של דבר נבחנים על מה שנאמר בכיתה ויצא שלאורך ההרצאות שי כל הזמן שאל בכיתה שאלות שבסוף הופיעו במבחן. באמת ממש סבבה וכדאי להגיע פרונטלית.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין, אבל מי שרוצה יכול להציג מצגת שבה הוא מדבר על חיה כלשהי ועל הדברים המעניינים לגביה ולקבל על זה בונוס של 2-4 נקודות לציון הסופי.\n\nהמבחן: מבחן הוגן, נשאלנו על מה שנלמד בכיתה, רוב השאלות היו מנוסחות בצורה יחסית טובה (וגם אם משהו לא ברור שי הסביר במהלך המבחן). צריך לענות על 5 מתוך 6 שאלות פתוחות ועל 20 שאלות אמריקאיות. הרבה מהשאלות (גם הפתוחות וגם הסגורות) ממוחזרות ממבחני עבר אז חשוב לתרגל אותם, אבל עם הסתייגות קלה - יש בחלק מהם גם שאלות מתסבכות שמנוסחות לא טוב ולא ממש תואמות לחומר ששי מלמד אז לא להלחץ מזה יותר מידיי.\n\nהשורה התחתונה: בתור סטודנטית לא מהפקולטה לביולוגיה אבל עם אהבה לתחום ממש נהנתי ללמוד בקורס וזה לא משהו שקל להגיד על רוב קורסים בטכניון :)", "timestamp": 1688994946618}]}