{"posts": [{"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יואב ערבה\nחוות דעת - הרצאות: הרצאות מאוד מעניינות, יואב מסביר טוב (+מכניס בדיחות מידי פעם). היה עושה בוחן בקאהוט כל כמה שבועות (על השיעורים האחרונים) ונותן נקודה בונוס למי שענה על 4 מתוך 5 שאלות נכון. זה היה ממש טוב כי ככה כל פעם חזרנו על החומר של השבוע/שבועיים אחרונים (לא יותר מידי בבת אחת) וזה עזר להישאר \"על החומר\".\n\nשם המתרגל/ת: עופרי\nחוות דעת - תרגולים: מתרגל מומלץ!\n\nשעורי הבית: לקחו לי לרוב פחות מיום.\n\nהמבחן: -\n\nהשורה התחתונה: קורס מעניין, בגדול נכנס לעומק בנושאים שלמדנו באופן כללי בביולוגיה 1.", "timestamp": 1612460749221}, {"author": "פולימראז", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יואב\nחוות דעת - הרצאות: מרצה מעולה באופן אישי ומקצועי, רואים שאכפת לו ממה שהוא מלמד וחשוב לו שסטודנטים יבינו ויזכרו את החומר.\n\nחוות דעת - תרגולים: מאוד חשוב להגיע, ברוב התרגולים לומדים דברים שלא לומדים בהרצאות ושיהיו ביצוג נרחב בתרגולים ובמבחן.\n\nשעורי הבית: לוקחים המון זמן, יש 6 תקפים ולקראת סוף הסמסטר זה היה קצת מעיק.\n\nהמבחן: מבחן בדיד (המון סעיפים קטנים, נקודה שתיים לסעיף) למי שאוהב (ולמי שלא), צריך בעיקר לשנן המון ויש המון לשנן אבל אז המבחן עצמו קלי קלות.\n\nהשורה התחתונה: אני אישית פחות התחברתי, לא הרגשתי שזה יתרום לי כל כך לזכור את כל השמות האלה, מצד שני זה כן פותח קצת את התפיסה וכן חשוב והאכפתיות של יואב קצת מפצה על השיעמום, אני חושב שאנשים שאוהבים ביולוגיה כן יוכלו להתחבר לקורס הזה, בהצלחה!!!", "timestamp": 1613566428256}, {"author": "eden", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יואב ערבה\nחוות דעת - הרצאות: מעניינות וקצת עמוסות, עשה קהוט כל כמה שיעורים וזה ממש עזר לחזור על החומר\n\nשם המתרגל/ת: עופרי\nחוות דעת - תרגולים: היה אחלה, נחמד ותמיד עונה על השאלות\n\nשעורי הבית: היו 6 לאורך הסמסטר תקפים, לפעמים היו קצת עמוסים ולא ברורים. \n\nהמבחן: המון שאלות פתוחות, מתבסס גם על החומר מהתרגולים, אבל לא קשה סה\"כ (המון מתבסס על זיכרון)\n\nהשורה התחתונה: די סבבה", "timestamp": 1615127176227}, {"author": "תלמידת מדמ״ח", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עפרי\nחוות דעת - תרגולים: מתרגל מעולה\n\nשעורי הבית: לא קשים 6 גליונות סה״כ עם תשובות של 2-3 שורות \n\nהמבחן: יחסית קל והוגן\n\nהשורה התחתונה: תקחו!", "timestamp": 1646556522943}, {"author": "-הלוגן רדיקלי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואב ערבה\nחוות דעת - הרצאות: יואב הוא איש חינוך, כמו צנזור של הביולוגיה, ממש זכות ללמוד אצלו. ההרצאות בקצב מהיר (יש המון חומר ומושגים), אבל הוא תמיד גורם לאווירה מאוד טובה וזורם על שטויות שפשוט מעלות חיוך.\n\nשעורי הבית: לא כאלה פשוטים! ואין רפרנסים כי השאלות די מקוריות. בדיעבד זה רק לטובה, זה גרם לי לחזור על החומר בסמסטר.\n\nהמבחן: יש ה-מ-ו-ן חומר. כל הדקויות שראיתם בהרצאה ואמרתם \"אין מצב שזה חשוב\"? אז זה במבחן. יש הרבה סעיפים בשאלות, מבנה דומה לשב, אפשרי להוציא ציון טוב אם משננים טוב טוב את כל המושגים. לא מצאתי קיצורי דרך.\n\nהשורה התחתונה: אחד הקורסים הבסיסיים והחשובים בתואר למי שמעניינת אותו בקרה גנטית.", "timestamp": 1677602473485}, {"author": "Shira Hanuka", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואב\nחוות דעת - הרצאות: \nההרצאות עמוסות בחומר, הרבה מהדברים שיואב אומר בהרצאה ואפשר לחשוב שהם שוליים/לא יהיו במבחן- הם יהיו. חשוב להבין את החומר של ההרצאות לעומקן. מעבר לכך יואב מרצה מעולה שתמיד מביא דוגמאות ״מהחיים האמיתיים״ מה שהופך את החומר לעוד יותר מרתק, תמיד יש אווירה נעימה ומעודדת למידה בהרצאות.\n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים: \nהתרגולים ברובם מהווים עוד חומר- שלא מופיע בהרצאות. חומר זה יהיה גם במבחן ובשיעורי הבית ולכן חשוב להיות על הדברים \n\nשעורי הבית: \nארוכים, לוקחים זמן לגמרי. בחלקם לקוחים ממבחנים ולכן חשוב לעשות אותם בתשומת לב כי זה יכין אתכם למבחן.\n\nהמבחן: \nמרובה שאלות ומרובה סעיפים, נוגעים כמעט בכל החומר בקורס (שזה המון חומר.) צריך ללמוד כמה ימים טובים ולשלוט בחומר ברמה גבוהה.\n\nהשורה התחתונה:\nקורס מעניין מאוד ולא קשה מדי, אבל כן עמוס בעיקר ביחס לכמות הנקז (2.5) , בהצלחה!(:", "timestamp": 1679437868765}, {"author": "mRNA", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יואב ערבה\nחוות דעת - הרצאות: מעביר את ההרצאות בצורה מאוד טובה ומעניינת, המרצה היחיד שידע את השם שלי שתואר (ולא כי דיברתי הרבה). כך שבתור במרצה הוא בהחלט ברמה גבוהה. אבל מבחינת התחשבות במילואימניקים או בקשות קצת חריגות בהתאם למצב הוא מקובע ולא באמת בא לקראת הסטודנטים.\n\nשם המתרגל/ת: מלק דרוואשה\nחוות דעת - תרגולים:  סבבה לגמרי, יודעת את החומר טוב ומעבירה אותו בצורה טובה וברורה.\n\nשעורי הבית: כמו רוב הקורסים בפקולטה- שאלות פתוחות בלי רפרנסים של ממש. קצת מעיקים והבדיקות קצת מתקטננות אבל סה\"כ לא מעיקים יותר מדי.\n\nהמבחן: מלא שאלות עם משקל של נקודה/ שתיים. קצת מעצבן אבל עם קצת שינון ולהבין את הקטעים של יואב במבחנים (ויש כאלו- כמו לתת להתאים 4 תשובות ל4 היגדים רק שיש היגד שמתאים ל2 תשובות והיגד שלא מתאים לאף תשובה והוא לא אומר על זה משהו מראש) אפשר להוציא ציון סבבה.\n\nהשורה התחתונה: קורס מעניין עם מרצה טוב אבל מקובע.", "timestamp": 1716495253823}, {"author": "Anne Onimus", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יואב ערבה\nחוות דעת - הרצאות: \nיואב מרצה מעולה, הוא מסביר ממש טוב ומעניין ותמיד יש אצלו צחוקים. הסמסטר הוא נעל אותנו באולם ההרצאה בתור חדר בריחה ולא הסכים לפתוח לאף אחד את הדלת עד שנפתור את החידה ונמצא את המפתח. מומלץ בחום כמרצה. יש הקלטות של ההרצאות מ2021 (או 2020?) והן אחד לאחד ההרצאות הפרונטליות. מאוד נח למי שמעדיף למידה מקוונת או שצריך להשלים הרצאות פה ושם.\nמה שכן, ההרצאות מפוצצות בחומר. היו סטודנטים שטענו שמרוב שיש הרבה חומר והרבה פרטים קטנים קשה לדעת מה למבחן ומה לא. ובכן, אצל יואב אין את הבעיה הזאת. הכל למבחן. הכל. מספר הבסיסים בסיבוב של דנא? למבחן. המודל ההזוי של הדנא התלת גדילי שהזכירו פעם אחת בהרצאה 1 למשך חצי שניה? למבחן. הכיוון שבו כל OH מתחבר לריבוז? למבחן.  איך קראו לחבר הכי טוב של יואב מהילדות? מותק יש לי חדשות בשבילך, גם זה למבחן.\n\nשם המתרגל/ת: מלק דרוושה\nחוות דעת - תרגולים: מלק מתרגלת סבבה לגמרי, מעבירה את החומר בצורה מובנת ולא נמרחת איפה שלא צריך. חשוב להדגיש שבהרצאות ובתרגולים מועבר חומר שונה (כמעט) לגמרי ולכן חשוב להיות גם בתרגולים. אין הקלטות לתרגולים. \n\nשם המתרגל/ת: נועם נגו\nחוות דעת - תרגולים: נועם הוא מתרגל שמאוד נאמן לעקרונות שלו ואני מאוד מעריכה את זה. העקרונות שלו מסתכמים בלא לענות לאף שאלה בצורה ישירה אף פעם. אם תשאלו אותו שאלה הוא לא יענה לכם ישירות אלא יתן לכם חידות עד שתתייאשו, גם אם שאלתם שאלה מאוד קונקרטית והגיונית. כמתרגל הוא סבבה, אני אישית מעדיפה את מלק ולדעתי היא יותר מובנת ומעניינת.\n\n\nשעורי הבית: 5-6 גיליונות שמהווים 30% תקף והבדיקה קטנונית ומעצבנת, אז חשוב להשקיע בהם.\nבנוסף יואב עושה בתחילת כל הרצאה בוחן קאהוט של 5 שאלות ומי שעונה נכון על לפחות 4 מתוך 5 מקבל בונוס של חצי נקודה לציון הסופי, אז שווה ללמוד אלהם ואפשר להשיג ככה 3-4 נקודות בונוס לציון הסופי. לכל שאלה יש משהו כמו 30 שניות לענות אז צריך להיות מאוד על זה, אבל זה באמת לא קשה כי זה ללמוד בע\"פ חומר של הרצאה אחת כל פעם וזה מאוד עוזר להשאר חדים על החומר. לא חייבים להגיע פיזית כדי להשתתף בבחנים, פשוט תמצאו חבר שכן מגיע פיזית שישלח לכם את הקישור לבוחן (אבל אל תגלו ליואב).\nבנוסף ליואב יש מסורת, כל שנה הוא נותן משימת קרינג' כלשהי שמי שעושה אותה מקבל עוד חצי נק לציון הסופי. השנה הוא נתן לנו לכתוב סיפור על איך 2 סטודנטיות הופרדו בלידתן ואחת מהן גודלה על ידי קופים ושנה שעברה הוא נתן להם לכתוב משהו על סנדוויצ'ים(???).\n\nהמבחן: כל המבחן מורכב מסעיפים קטנים בשווי של 1-3 נקודות, יש שיגידו שזה מציק ומלחיץ אבל בעיניי זה מעולה כי זה אומר שגם אם לא ידעת משהו ספציפי לא תלך על זה שאלה ענקית כך שהניקוד עצמו מאוד הוגן לדעתי. בהרגשה שלי הבדיקה הייתה קצת מסריחה וחיפשה איפה להוריד אבל סה\"כ בסדר.", "timestamp": 1716726536106}]}