{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: לי אישית היה די קשה לעקוב אחרי המרצה. \n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: מתרגלת מצויינת! התירגולים יותר עוזרים להבין את החומר מאשר ההרצאות.\n\nשעורי הבית: לא קלים, אבל עוזרים להבין את החומר. \n\nהמבחן: עוד לא היה.\n\nהשורה התחתונה: קורס לא קל בעיני. צריך לזכור המון שמות כדי לעקוב (למרות שלא צריך לזכור הכל בע\"פ, אי אפשר לעקוב אם לא זוכרים את רובם...).", "timestamp": 1612461015612}, {"author": "Pfk1,Pfk2,PK", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: ככה ככה..\n\nחוות דעת - תרגולים: לא השתתפתי, סבלתי מספיק בהרצאות.\n\nשעורי הבית: אותו רעיון כל סמסטר, נתפסים על איזה כמה נקודות שטותיות בחומר, אותה גברת בשינוי הדרת.\n\nהשורה התחתונה: קורס לא מעניין, לא תורם בשום דבר, לא משפר את ההבנה בשום נושא, המטרה בקורס היא בעיקר לשנן שמות של כמה אנזימים רנדומליים שמשום מה החליטו להיתפס עליהם, אין העמקה, אין הבנה, אין כלום.\nהקורס גם לא קשה במיוחד אבל לא הייתי עושה אותו גם אם היה מובטח לי מאה מראש.", "timestamp": 1613564665886}, {"author": "--", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: לדעתי קצת מיותרות. הן היו מעניינות בהתחלה אבל ארוכות מדי ואחר כך הרגשתי שאין באמת צורך לראות אותן, אולי רק לעבור על המצגת כשעושים שיעורי בית.\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: מתרגלת מדהימה שמצליחה להעביר את החומר מצויין. התרגולים ממש חשובים והתרגילים שפותרים מאוד דומים לשיעורי הבית ולמבחנים ככה שחשוב להקדיש לזה הרבה תשומת לב.\n\nשעורי הבית: לפעמים ארוכים ולא פשוטים, מצריכים הרבה מחשבה אבל דרך מעולה להבין את החומר.\n\nהמבחן: הטיפ הכי טוב שאני יכולה לתת זה להקדיש יום שלם או יותר לשינון אינטנסיבי של כל האנזימים המשתתפים בכל תרשימי הזרימה, גם באלה שלא מופיעים בדפי העזר, מי המעכבים והמאקטבים של כל אנזים ועל מה הוא אחראי ובאיזה עוד מסלולים הוא משתתף. בסופו של דבר המבחן לא קשה אם יודעים לשלוף בדיוק איזה אנזימים יכולים להשפיע ואם הם מתאימים לכל הנתונים של השאלה. לרוב גם אם לא צודקים ב-100% בתשובה אבל יודעים לנמק כמו שצריך מקבלים את רוב הנקודות.\n\nהשורה התחתונה: קורס מעניין, שיעורי הבית קצת עמוסים אבל הלמידה למבחן לדעתי לא צריכה להיות ארוכה אם משננים קודם ואז פותרים מבחנים.", "timestamp": 1617710062739}, {"author": "שם", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: משעממות רצח ובזבוז זמן. הייתי בהרצאות רק למשך חצי סמסטר ולא למדתי בהם יותר ממה שלמדתי בתרגול.\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: הסיבה היחידה למה הבנתי משהו מהקורס הזה בכלל. היא נורא ממוקדת ומסבירה מעולה.\n\nשעורי הבית: יש 5 הגשות - שבועיים לכל הגשה. בוחרים 4 הטובים ביותר מתוך חמישה בשביל מגן של 10%. כמו המבחן, יש הגבלה של כמות השורות שניתן לענות (מעצבן בטירוף). מומלץ להשוות בין כמה אנשים כדי לוודא שכתבתם את כל האנזימים הנכונים.\n\nבוחן אמצע: בדרך כלל יש בוחן אמצע שנותן מגן של 20% על כל החומר עד וכולל שרשרת מעבר אלקטרונים. לא נורא אם לא מצליחים בו, כמעט תמיד מקבלים יותר במבחן. אם יש זמן ללמוד אליו - מומלץ לעשות כמה בחנים משנים קודמות ולעבור על כניסה של פירובט וגליצרול לתאי כבד.\n\nהמבחן: תמיד נגשים למועדי א כי הם יותר קלים! (גם אם אין זמן לנשום בתקופת מבחנים).\nיש הגבלת שורות כמו בשעורי בית שבהם ניתן לענות.\nמומלץ לעבור על החומר טוב טוב לפני שפותרים, ולפתור כמה שיותר מבחנים משנים קודמות.\nזמן מינימלי ללמידה - 3 ימים (יום אחד כדי לעבור על החומר, ויומיים כדי לעבור על מבחנים). אפשר להתחיל למקבל את הלימוד לקורס הזה ביחד עם קורסים אחרים.\nכדאי לעבור טוב טוב על האנזימים הבאים (מעכבים ומאקטבים):\nפירובט קרבוקסילאז, פירובט דיברדרוגנז, מלאט דהידרוגנאז, G6PDH, DHFR, גלוטטיון, גלוטטיון רדוקטאז, ACC, פירובט קינאז, PFK1, PFK2, PKA, גליקוגן סינטאז, גליקוגן פוספורילאז, PEPCK. \nללמוד טוב טוב את קסקדת התגובות עם אינסולין וגלוקגון.\nלא לזלזל ולהגיד שאין סיכוי שלא ישאלו במבחן על כניסת פירובט או גליצרול לכבד!\n\nהשורה התחתונה: קורס מגעיל, צריך לשנן בו מלא אנזימים כדי להצליח לענות על שאלות, ההרצאות כמעט לא רלוונטיות (מומלץ לקרוא סיכום של הקורס), אבל אפשר להצליח בו.", "timestamp": 1646049163104}, {"author": "ביואינפורמטיקה", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: מעייף\n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: סגרו את כל החומר.\n\nשעורי הבית: 4 גליונות סה״כ, לא נוראי\n\nהמבחן: הוגן בול על החומר של התרגולים\n\nהשורה התחתונה: לראות רק את התרגולים ולפתור מלא מבחנים", "timestamp": 1646556732133}, {"author": "ביורפואן אקראי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יורם רייטר\nחוות דעת - הרצאות: אין שום סיבה להגיע אליהן. יש סיכום מצוין לקורס בדרייב שגם הוא לחלוטין מקיף הרבה יותר משהמבחן הסופי דורש.\n\nשם המתרגל/ת: ענבר ערמן\nחוות דעת - תרגולים: תשקיעו בתרגולים - תכתבו כל פרט, הסבר ודוגמה שהיא נותנת כי זה מאוד יעזור בשיעורי בית ובמבחן. ענבר מתרגלת מעולה שבקיאה מאוד בחומר.\n\nשעורי הבית: לא פשוטים וטריקיים. מאוד דומים לשאלות המבחן ולכן צריך לעשות אותם בהבנה מלאה של התשובות.\n\nהמבחן: אין מה לעשות - צריך לשנן המון אנזימים ולהבין טוב מאוד מה הם עושים ועל איזה מסלול משפיעים. כל עוד הבנתם את הנ\"ל לעומק - אתם תצליחו במבחן.\n\nהשורה התחתונה: קורס אחלה ויחסית מעניין.", "timestamp": 1647766132487}, {"author": "kl", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יורם רייטר\nחוות דעת - הרצאות: לא מאוד תורמות למבחן, ןבסוף גם מה שכן יש רק בהרצאות ורלוונטי למבחן הוא עובר מהר ולא מספיק ברור. בסוף כמרצה הוא סביר\n\nשם המתרגל/ת: אופיר\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: 5 גליונות פתוחים עם התקטננות על פרטים קטנים\n\nהמבחן:  מתקטנן. יחס לא מכבד לסטודנטים, לא כותבים על מה הורידו נקודות ובערעורים לא מתייחסים למה שכותבים.\n\nהשורה התחתונה: שינון ובהצלחה. כנראה שלא יהיה פוטוסינתזה במבחן (מוזמנים לחפש שנים עברו שאלות על זה, אני לא מצאתי)", "timestamp": 1679777056406}, {"author": "עדן", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: מיותרותת יש הכל בתרגולים\n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: פיראס אלוף! אוהב לעזור ותמיד בא לקראת הסטודנטים.\n\nשעורי הבית: ארוכים אבל רלוונטים מאוד למבחן \n\nהמבחן: קשה\n\nהשורה התחתונה: קורס קשה צריך השקעה", "timestamp": 1680176897727}, {"author": "ה", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לא זוכרת\nחוות דעת - הרצאות: הייתי באחת ומשם ויתרתי, היה ארוך מידי ובסוף יום מידי וגם בדיעבד- מיותר מידי\n\nשם המתרגל/ת: אילנה המהממת\nחוות דעת - תרגולים: לא היו אצלה הרבה אנשים בתרגול ואני ממש אהבתי את זה . היא מתרגלת מעולה, מסבירה הכל כמו שצריך ובקצב טוב, היא מאוד מנוסה ויודעת לקלוע למה שצריך\n\nשעורי הבית: יושבים עליהם קצת אבל בגדול הם בסדר ואפשר לבקש עזרה מהמתרגלות והם עוזרים מאוד להבין את החומר \n\nהמבחן: ללמוד ממבחנים . לפתוח מבחנים ולהתחיל לפתור אותם, זה יהיה קצת ארוך ומעצבן בהתחלה אבל זאת הדרך הכי טובה ללמוד למבחן הזה ולקבל ציון טוב . צריך לזכור בע\"פ לא מעט דברים אבל זה באמת חומר שניתן להבין ולא לשנן. \n\nהשורה התחתונה: ממליצה מאוד כן לגשת למבחן אמצע זה מכניס לחומר ומפקס אותך, אחלה קורס, אפשר להוציא מעל 80 גם בלי מאמץ עילאי .אני די אהבתי", "timestamp": 1689426427874}, {"author": "לא חשוב", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: הייתי רק בחלק מהם, לדעתי מיותרות, יורם כן טוב אבל להיות 3 שעות בהרצצאה זה קצת קשה \n\nשם המתרגל/ת: ענבר\nחוות דעת - תרגולים: אין על ענבר, התרגולים ממש מובנים, מכסים כל  החומר למבחן, מבחנתי התרגולים היו מספיקים במהלך הסמסטר וגם ללמידה למבחן \n\nשעורי הבית: היו בסדר, כן צריך להבין ולהשקיע אבל היו סבבה \n\nהמבחן: לא קל אבל לא קשה, ניתן להוציא ציון טוב אם מבינים את החומר ויודעים מה כל אנזים עושה \n\nהשורה התחתונה: אחלה קורס, אהבתי מאוד, נהניתי מאוד, החומר מעניין וממש ניתן להוציא אחלה ציון", "timestamp": 1690241204932}, {"author": "...", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: \nבעיקר בזבוז זמן אבל לא כל מה שדובר בהרצאה ידובר בתרגול וזה לא מונע מהם לשים נושאים כאלה במבחן.\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: \nמסביר ממש טוב, ממש מומלץ.\nשעורי הבית: \nלא קשים אבל מורידים נקודות על שטויות, בסוף כל הציונים מעל 90 אבל לגמרי יכלו להיות 100 אם הם לא היו קרציות\nהמבחן: \nצריך הבנה בחומר כדי להצליח אבל הוא ממש לא קשה, יותר קשה להבין מה הם רוצים בשאלה מאשר לענות עליה.\nהשורה התחתונה: \nקורס ממש נחמד מבחינת תוכן, התנהלות לא משהו של הצוות.", "timestamp": 1713422817307}, {"author": "**", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: \nהייתי בשתיים הראשונות ומשם הפסקתי, אפשר להצליח נהדר בקורס גם בלעדיהן, חבל על השלוש שעות המבוזבזות. יורם דאג לעשות כל מה שהוא יכול כדי להפוך את הקורס הזה לסיוט, היחס היה מזלזל ולצערי הרב, למרות ההנאה הרבה מהחומר היה קשה להנות מהקורס בגלל ההתנהלות של צוות הקורס. \n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: \nהמלאך של הקורס! התרגולים עוברים בטוב, אומר את כל מה שחשוב. המלצה גדולה גם על התרגולים המוקלטים של ענבר, שילוב של שניהם במקום ללכת להרצאות ויש לכם את ה90+ בקורס. \n\nשעורי הבית: \nמציקים, אסור בכתב יד, כל שאלה מגבילים במספר השורות האפשריות. מצאתי את עצמי שורפת יותר זמן על איך לקצר תשובה של 2.5 שורות ל-2 שורות כי חריגה במספר השורות גוררת הורדת ציון. התרגילים כן ברמת מבחן אז מומלץ לשבת עליהם ברצינות. \n\nהמבחן: \nהמבחן היה מפוצל לשניים כאשר כל חלק היה שעה וחצי (בגלל המלחמה יצאו מהתבנית הסטנדרטית של המבחנים). המבחנים כן דורשים שינון, הבנה וזמן ללמוד אליהם. זה לא קורס קליל, ולא קל להוציא בו את ה-90+ \n\nהשורה התחתונה: \nכן דורש יותר השקעה יחסית לכמות הנקז שלו, החומר מעניין הצוות קורס מזעזע", "timestamp": 1713427373852}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: הקלטות של ענבר\nחוות דעת - תרגולים: מעולה!! אני כן ממליצה ללכת לתרגולים פיזית אבל אם אין ברירה או שמפסידים כמה תרגולים ההקלטות שלה מצויינות.\n\nשעורי הבית: 10% תקף, חובת הגשה של 4 תרגילים מתוך 5. רובם ארוכים ומעיקים אבל הם כן ברמת מבחן אז שווה לשבת עליהם בשביל להבין טוב את החומר.\n\nהמבחן: השנה בגלל המלחמה פיצלו את המבחן לשני בחנים תקפים, אחד באמצע הסמסטר ואחד בשבוע האחרון. זה יצר המון עומס אז מקווה שזו פעם אחרונה שזה קורה, אבל באופן כללי הבחנים היו הוגנים ודי ברמה של מבחנים קודמים ותרגילי בית. צריך לזכור המון המון דברים בע\"פ והמון שמות של אנזימים אז כדאי לא להיות שאננים. בד\"כ אם לא עונים מה שהם רוצים הם פוסלים את כל הסעיף אז תהיו כמה שיותר בטוחים בתשובה!\n\nהשורה התחתונה: קורס מעניין אבל לא קל בכלל. דורש הרבה שינון והרבה תרגול אבל מי שמשקיע יכול להצליח.", "timestamp": 1713435345712}, {"author": "סטודנטית לביו רפואה", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: האמת שלא הלכתי, היו מיותרות \n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים:  מצוינים! בול החומר למבחן, עינייני וברורים מאוד\n\nשעורי הבית: 5 תרגילי בית, שאלות טובות שעושות חזרה טובה על החומר \n\nהמבחן: סך הכל הוגן, מאוד תואם את התרגולים \n\nהשורה התחתונה:", "timestamp": 1713942361337}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: לא הלכתי\n\nשם המתרגל/ת: אופיר\nחוות דעת - תרגולים: מדהימה, מאוד אהבתי את השיטה שבה היא מלמדת. מסבירה בצורה מובנת ודואגת כל הזמן לקשר בין הדברים כדי שהכל יתחבר לנו מהתחלה בתמונה הגדולה. לפעמים רצה על החומר אבל זה מובן כי יש לה שעה של תרגול בשבוע להספיק חומר של 3 שעות הרצאה. \n\nשעורי הבית: 5 הגשות, לא קלות אבל מהוות חזרה מעולה על כל הנושאים, וזאת דרך טובה להיות \"על זה\" ולהתעמק ולהבין את החומר מעבר לתרגולים.\n\nהמבחן: תאם את הרמה של שיעורי הבית ושל התרגולים. היה הוגן מאוד ולא קשה. \n\nהשורה התחתונה: אחלה קורס, גם היה מעניין", "timestamp": 1714464379501}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יורם\nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: הקלטות של ענבר\nחוות דעת - תרגולים: \nענבר לא תרגלה הסמסטר אבל ראיתי הקלטות שלה. מתרגלת ממש ממש טובה, מסבירה ברור, חוזרת על דברים כמה פעמים, מכווינה לשאלות של המבחן. מומלץ ביותר!!!\n\nשעורי הבית: 4/5 גיליונות חובה. עוזרים מאוד להבין את החומר ויחסית חביבים. לחלק מהשאלות יש רפרנסים, מעט חופרים אבל סה\"כ הם באמת בסדר, לא משהו מעמיס.\n\nהמבחן: היו 2 בחנים הסמסטר במקום מבחן. לי באופן אישי זה יצא ממש טוב ובשני הבחנים קיבלתי 90+ (לא היה קשה במיוחד בעיני). לדעתי זה היה טוב כי היה צריך לזכור פחות חומר וזה יותר מיקד על הכיוון של התשובות לשאלות. יש כאלה שפחות אהבו, אני דווקא התחברתי. \n\nהשורה התחתונה: אחלה קורס שבעולם וממש מעניין, לדעתי אחד מהקורסי חובה הכי טובים בתואר של ביורפואה.", "timestamp": 1715019761059}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יורם ריטר\nחוות דעת - הרצאות: \nאמנם לא נכחתי ברוב המוחלט של ההרצאות, אך שווה לציין כי יורם בן אדם מדהים ומאוד אכפתי\nשם המתרגל/ת: פיראס משעור\nחוות דעת - תרגולים: \nשולט בחומר ויודע להעבירו בצורה ברורה. אחלה מתרגל!\nשעורי הבית: לא קשים אבל מתישים\n\nהמבחן: לא ממש קשה אבל צריך להיות חד על החומר\n\nהשורה התחתונה:", "timestamp": 1715249878860}, {"author": "~~", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הלכתי להרצאות, הן די מיותרות למבחן\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת מדהימה, מעבירה את החומר בצורה מאוד מובנת ומתעכבת על דגשים חשובים. \n\nשעורי הבית: גליון פעם בשבועיים. סבבה, לא יותר מדי עמוסים, אבל עוזרים להישאר על החומר במהלך הסמסטר.\n\nהמבחן: בסמסטר שלנו היו 2 בחנים שכל אחד מהם 45% מהציון הסופי, אז המבחן הראשון היה רק על החומר עד שבוע 5/6 והשני היה על השאר. בסה\"כ המבחנים די הוגנים והקונספטים של השאלות חוזרים על עצמם. חשוב להיות על זה במהלך הסמסטר כי הרבה מהחומר נבנה אחד על השני אז זה ממש יעזור להבנה לקראת המבחן \n\nהשורה התחתונה: קורס חמוד, מעניין ועם סגל די טוב. מומלץ גם לבחירה.", "timestamp": 1716453392330}, {"author": "^", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יורם רייטר\nחוות דעת - הרצאות: מרצה טוב מומלץ\n\nשם המתרגל/ת: אנה יהושוע יואנב\nחוות דעת - תרגולים: מושלמת חייב ללכת אליה מסבירה מצוין ובקצב טוב, מאוד נחמדה כלפי הסטודנטים ורוצה בטובתנו\n\nשעורי הבית: ברמת מבחן מאוד טובים להבנת החומר\n\nהמבחן: משלב אינטגרציה של כל החומר, לוקח הרבה זמן להבין איך הכל משתלב ביחד אבל ברגע שמבינים המבחן באמת הוגן כמעט תמיד ומי ששולט בכל המעגלים והקונספטים של מעגלי אנרגיה יצליח לגמרי\n\nהשורה התחתונה: קורס ממש ממש טוב אחד הטובים שהיו בפקולטה לביו רפואה, נהניתי מאוד מהחומר ומהסגל המאורגן והמסודר", "timestamp": 1716846902679}, {"author": "Anne Onimus", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "זה לא באמת מעניין הביקורת על הסגל, בואו אני אתן לכם טיפים מצילי חיים ללמידה. קודם כל!!! ההרצאות מיותרות לגמרי. התרגולים סוגרים בול את כל מה שצריך בשביל לדעת למבחן. לוותר על ההרצאות יהיה הדבר הכי טוב שתוכלו לעשות בסמסטר הזה, זה יתן לכם גם אקסטרה 3 שעות בשבוע שתוכלו לנצל לדברים החשובים וגם ימקד אתכם רק על החומר שצריך במקום סתם למרוח אתכם. זה פשוט הופך את הקורס מקורס עמוס של המון שעות לקורס קליל של רק שעה תרגול בשבוע.\nדיסקליימר חשוב - החומר היחיד שצריך לדעת למבחן והוא מועבר רק בהרצאות זה קואופרטיביות (אבל גם שם הוא לא מועבר בצורה הכי מובנת ותכלס אתם כבר יודעים את זה מביוכימיה) אז חשוב לדאוג ללמוד אותו בנוסף לתרגולים.\nהשיעורי בית הם 10% תקף והם בדיוק באותו סגנון של המבחן אז מומלץ לעשות אותם כדי ללמוד למבחן.\nזה קורס שהוא בסוף די טכני והדרך הכי טובה ללמוד זה לוודא שזוכרים את כל המסלולים והאנזימים שצריך לזכור ואז לפתור הרבה מבחנים, תרגולים ותרגילי בית.\nהמבחנים מאוד הוגנים, שואלים בדיוק על מה שלמדנו ואין בהם הפתעות.\nבנוסף יש הקלטות לתרגולים משנים קודמות שהם אחד לאחד התרגולים של הסמסטר הנוכחי והמתרגלת (ענבר) פשוט מעולה. הסגל לא מפרסם אותן, תחפשו בדרייב או אצל חברים שעשו את הקורס. אם אתם מעריצים של פרונטלי אז פיראס מומלץ.\nמידע חשוב - כנראה שלפני תחילת הסמסטר תקבלו סקר שבו ישאלו אתכם האם אתם מעדיפים מבחן אחד בסוף הסמסטר (כמו בכל קורס נורמלי) או 2 בחנים - אחד בשבוע 6\\7 ואחד בשבוע 13 כשכל אחד 50% מהציון. חשוב שתדעו מה היתרונות ומה החסרונות של כל צד כדי שתוכלו לקבל בחירה מושכלת.\nיתרונות למבחן אחד:\n*הסגל ישקר לכם שהוא רוצה לעשות 2 בחנים כדי שתצטרכו לשנן ככה פחות חומר לכל אחד מהמבחנים ושזה יקל עלכם אבל זה שקר גס. החומר של החצי השני מבוסס על הראשון ונכון שיש הרבה פרטים קטנים מהחצי הראשון שלא צריך לזכור בעל פה לחצי השני, אבל בגדול מה שיקרה זה שאתם תלמדו פחות או יותר את כל הקורס לבוחן השני במקום רק חצי ממנו כפי שהובטח לכם.\n* 2 הבחנים יפלו לכם על הסמסטר וזה יצור עומס פסיכי. אתם תמצאו את עצמכם משגעים את נציגי הסמסטר שלכם עם בקשות להזיז תאריכי הגשות ותאריכי מעבדות והסגלים של כל שאר הקורסים ישנאו אתכם.\n*יש הרבה יותר מבחני עבר שהם מבחנים על כל החומר מאשר חומר מפוצל. כשתלמדו לכל אחד מהבחנים אתם תבזבזו המון אנרגיה על לנסות להבין איזה שאלות רלוונטיות לכם ואיזה לא. זה לא סוף העולם אבל זה כן מעצבן.\nיתרונות ל2 בחנים:\n*זה יוצר מצב שבו החומר היותר קל מהווה 50% מהציון הסופי, לעומת סיטואציה של מבחן סופי גדול שבו המשקל שלו הרבה יותר קטן.\n*מאפשר לכם לסיים מוקדם עם הקורס הזה.\n*הבחנים הם על חשבון ההרצאות - כלומר יש פחות חומר בסמסטר כזה, לפחות תאורטית.\nאם אתם הולכים על 2 בחנים, תתעקשו שמועד ב יהיה בתקופת מועדי ב ולא בתקופת מועדי א כמו שהיה אצלנו כי אחרת זה סתם יתקע לכם מועדי א חשובים.", "timestamp": 1717308221853}, {"author": "גאוס", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לא הייתי\nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: ענבר מוקלט\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: סבבה\n\nהמבחן: חוזר על עצמו \n\nהשורה התחתונה: קורס קליל", "timestamp": 1717756369484}]}