{"posts": [{"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: בני \nחוות דעת - הרצאות: אפשר לעבור על המצגת, חצי רלוונטיות (ראיתי בדיעבד). לפעמים עוזר קצת בדו\"ח מכין. \n\nשם המתרגל/ת: מרים \nחוות דעת - תרגולים: מצויינת. העבירה את המעבדות בצורה זורמת ונעימה. המעבדות עצמן לא קשות והשיטות מאוד בסיסיות, בעיקר לעבוד עם פרוטוקולים פשוטים. המעבדה של הזבובים יותר ארוכה וקצת יותר מתישה (אנחנו עשינו את הרוב בזום). \n\nשעורי הבית: דו\"חות מכינים לא קשים, דו\"חות מעבדה בזוגות קצת ארוכים אבל המדע \"פשוט\" והכל ממוחזר. אפשר לקבל ציונים טובים.\n\nהמבחן: בוחן כניסה לכל מעבדה, חלק ממוחזר. הציונים היו הוגנים.\n\nהשורה התחתונה: מעבדת חובה, אם עושים בתחילת התואר זו הזדמנות להתנסות בשיטות מאוד בסיסות (עבודה עם פיפטור, מעקב אחרי פרוטוקולים, PCR..).", "timestamp": 1616311397603}, {"author": "ביואינפורמטיקה", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: לא רלוונטי\n\nשם המתרגל/ת: אליאור חלו\nחוות דעת - תרגולים: לקרוא את הפרוטוקול לפני ולעבור על בחנים מסמסטרים קודמים\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: העבודה במעבדה הייתה מהנה ושווה את זה, לקח לי יום שלם בשבוע (מעבדה + להתכונן לבוחן + כתיבת דוחות מסכמים)", "timestamp": 1646556660685}, {"author": "c", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nהרצאות משעממות - שיעור היסטוריה מתמשך. בכל בוחן יש שאלה על איזה שקופית מההרצאה.\nבחנים שבועיים: קשים, לא מנוסחים היטב\nדוחות: בדיקה נוקשה, דוחות חופרים\nהמעבדה עצמה: עושים דברים קצת מיושנים.. הרבה התעסקות עם בינוקולרים שעושים כאבי ראש ועיניים.. בסך הכל היה מעניין", "timestamp": 1675676216779}, {"author": "c", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nמשעממות, שיעורי היסטוריה. נלקחה נוכחות רק ב1.1\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  דוחות ארוכים וחופרים, בדיקה מתקטננת, במיוחד בדוח הראשון רצו כנראה לזעזע אותנו ונתנו ציונים ממש נמוכים\nבחנים: צריך לקרוא לעומק את חומר הקריאה וגם לזכור פרטים שוליים מהפרוטוקולים כמו טמפ׳ אופטימליות לאנזימים:\n\nהשורה התחתונה: חלק מהמעבדות מעניינות אבל בעיקר עול", "timestamp": 1678127689489}, {"author": "דנא פולימרז דלתא", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: \nכפי שאמרו לפני- שיעור היסטוריה מתמשך, בבוחן כניסה למעבדה מקבלים ״הפתעה״- שאלה על הערה שולית מההרצאה.\n\nבחנים: don’t even get me started על הבחנים. היה מזעזע. שאלות הזויות, נותנים 40 עמודים באנגלית מהספר ואז שואלים על דברים שבכלל לא הופיעו שם.. הזוי! \n\nדוחות: מייגעים.. לוקחים די הרבה זמן אבל אם משקיעים הציון יהיה בסדר\n\nהשורה התחתונה: מעבדות שברובן היו די ארוכות אבל כן מעניינות לרב . בחנים קשים ולא פיירים", "timestamp": 1679439264221}, {"author": "זבוב דורזופילה", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נדב\nחוות דעת - הרצאות: עוברים על חומר תיאורטי. זה קריטי כי המתרגלים יושבים איתכם בהרצאה ובונים את הבוחן בדיוק לפי מה שנאמר שם. לפעמים בכוונה לא יעלו את המצגת כדי שלא יהיה איך לשחזר את זה למי שמפספס. לא קשה ,רק להתרכז.\nרשום שזה נוכחות חובה, אבל הוא מעביר פתק רק כמה פעמים בסמסטר, ואפילו שנעדרתי כמה פעמים לא שמתי לב שהיה לזה השלכות\n\nשם המתרגל/ת: יונתן\nחוות דעת - מעבדות: כל שבוע מ12:30 בד\"כ מסיימים 15:30-16:30 אבל לפעמים זה נמשך. בגדול יש בוחן בתחילת כל מעבדה, לפעמים על החומר מהספר \\ הרצאה \\ דוח מעבדה \\ חומר מקורס גנטיקה. זה מעצבן להתכונן כל שבוע אבל הבחנים באופן כללי לא מאוד קשה אם הייתם על קורס גנטיקה. יש גם הרבה בחנים אז כל אחד לחוד לא שוקל הרבה. \nהמעבדות עצמם נחמדות וקצת חופרות, בעיקר תשימו לב לבטיחות כי המתרגלים צריכים לתת לכם הערכה לזה. הדוחות כתובים מזעזע וכלום לא ברור, אז תקשיבו גם להסברים שלהם.\n\nשעורי הבית - דוחו\"ת: הדוחות יותר קלים משהיו, אבל הרבה סעיפים והכי קשה זה שצריך לתת תשובה מוגבלת מאוד במילים. הבדיקה מאוד קשוחה. לוקח יומיים-שלוש מלאים. שימו לב להתחיל מוקדם, כדי להבין איזה שאלות יש לכם ולשאול את המתרגל האחראי על הדוח בתרגולים. בתשובות להיות ממוקדים ולענות בדיוק על מה ששאלו אתכם. זה דוחות קשים אבל אפשריים.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מאוד עמוס בין מעבדות של יום שלם לדוחות שלוקחים כמה ימים, אבל לא מאוד קשה. ממש נחמד להתנסות בכמה שיטות ביולוגיות והמתרגלים די טובים ויש יחס אישי בהצלחה!", "timestamp": 1714501013313}, {"author": "כרומוזום X", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נדב שרון\nחוות דעת - הרצאות: חייב להגיד שבאתי עם רושם ראשוני מאד מוטעה שההרצאות הולכות להיות נוראיות מתוך הביקורות פה באתר, נדב הוא בטח לא המרצה הכי טוב בטכניון אבל ההרצאות בעיני היו מעולות, נתנו קצת אינ-סייט מעבר, ונגעו בחומר שבסוף הוא כן רלוונטי. הדבר היחיד שהפריע זה שהם לא מעלים את מצגות ההרצאה למודל וזה מקשה להשלים במקרה של חיסור \\ להתכונן לבחנים\n\nשעורי הבית: הדוחות ארוכים, קשים, חלק מהשאלות הן שאלות חשיבה מסדר גבוה שחייבים שם ממש להמציא את כל המדע מחדש. אני לא מבין מה הקושי לעשות דוחות שאשכרה שואלים על מה שהתעסקנו איתו. הבדיקה קשוחה ומחפשת.\n\nהמבחן: אין מבחן, יש בחני כניסה, וזה יותר גרוע. אמנם הרגיש שצוות הקורס היה קשו ב(בדיעבד) ולעיתים פקטר שאלות, וכמעט תמיד הם הוסיפו עוד זמן לבוחן, אבל בסך הכל הבחנים קשים, יכולים לשאול על פרטים ממש ספצייפים בחומר הקריאה \\ ההרצאה וגם הבדיקה מתקטננת. מומלץ ללמוד כמה שיותר טוב את הפרוטוקולים ואת חומר הקריאה כדי להצליח בבחני כניסה למעבדה כמה שיותר, בסוף זה פקטור חשוב מאד בקביעת הציון. \n\nהשורה התחתונה: הזדמנות טובה להתנסות בהמון שיטות שככל הנראה יהיו רלוונטיות להמשך לכל מי שמתעסק בביולוגיה, מצד שני שיטת ההוראה בקורס יכולה להשתפר, מרגיש שמנסים להרחיק אותנו מהחומר ולא לקרב אותנו אליו.", "timestamp": 1715018833980}, {"author": "מהנדס כימי", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: נדב שרון\nחוות דעת - הרצאות: \nאם פספסת מילה או שתיים שנזרקו בהרצאה אפילו לקראת הסוף שלה , אתה עלול להכשרת בשאלה הבחן הכניסה. \nכאשר הייתה היעדרות עם אישור , הסגל לא התחשב. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין תרגולים , יש מעבדות ארוכות ומייגעות. \nלאורך הסמסטר הרגיש שהסגל מתנכל בשאלות הבחנים והדוחות גם כן היו ארוכים ומייסרים. \nבנוסף, לאורך המעבדה עבדנו כצוות והעבודה הייתה בסדר גמור אך בסופו של דבר הערכת המדריך הייתה נמוכה מאוד מהמצופה. \nבקיצור , אני לא ממליץ לקחת אם אין צורך. \nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718097696515}]}