{"posts": [{"author": "גרייבס", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פיליפה\nחוות דעת - הרצאות: הרצאות מעניינות. פיליפה נותנת תרגילי בונוס (לכתוב שאלה למבחן, להציג ב2-3 דקות מחלה או סינדרום, להציג גרפים מספר הלימוד, בחן). כל שאלת בונוס מקנה 0.5-1 נק' לציון הסופי- כדאי. היא לא מקבלת בהכרח את של כולם. רוב החומר נמצא במצגות אבל מאוד מומלץ לסכם את מה שנאמר בנוסף. יש המון חומר וצריך להבין את האינטגרציה של הצירים האנדוקריניים למבחן.\nלא מפרסמת הקלטות.\n\nשם המתרגל/ת: מאיה ובן\nחוות דעת - תרגולים: תרגולים טובים לטובת חזרה על החומר והקייס סטאדיז עוזרים בהכנה למבחן. בתרגולים האחרונים נוכחות חובה בזום\\פרונטלי כי יש מטלות (הצעת ניסוי המשך למאמר קצרצר שקיבלנו מראש, פרזנטציה- הצגת דילמה אנדוקרינית ומשוב על פרזנטציה של קבוצה אחרת)\n\nשעורי הבית: 4 מתוך 5 מטלות כתובות ופרזנטציה. 20 אחוז תקף. שב 1- מבוא, מענה על שאלות בעקבות סרטון שרואים בכיתה. שב 2-3, יותר השקעה, קריאת מאמרים ובחירה של מחלה אנדוקרינית\\פגיעה ברצפטור אנדוקריני. שב 4- קריאת מאמר ומענה על שאלות בכיתה בקבוצות. שב 5- פרזנטציה, שב 6- משוב על פרזנטציה. סכהכ ניקוד הוגן. \n\nהמבחן: שעתיים, בוחרים 4 מתוך 5 שאלות. כל שאלה מתמקדת בציר אנדוקריני אחד (בדר\"כ) אולי שניים. צריך להכיר את המחלות והסימפטומים שפיליפה מלמדת לאורך הסמסטר. עונים בתשובה ממוקדת על כל סעיף, כמה משפטים לכל היותר. אין פתרון רשמי.\n\nהשורה התחתונה: ממש מעניין, כדאי להשקיע לאורך הסמסטר כדי להצליח בשיעורי הבית ובמבחן. קצת עמוס ביחס לנק\"ז.", "timestamp": 1644829265985}, {"author": "סטודנט/ית", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: פיליפה\nחוות דעת - הרצאות: נוכחות חובה, הרצאות בצורת דיון. פיליפה לא מעלה את המצגת לפני ההרצאה ומאוד חשוב לה בעיקר בהרצאות הראשונות הדיון בכיתה. היא אוהבת לפעמים לשאול אנשים ספציפיים שהרגיש לה שלא השתתפו מספיק אז חשוב להיות עירניים ולעקוב. החומר עצמו מאוד מעניין. כל שיעור היא הגרילה מי יסכם ב3 דקות את ההרצאה הקודמת. זה היה מבאס למי שלא יצא בהגרלה עד השיעורים האחרונים והיה צריך כל שבוע מחדש להתכונן לזה. יש בחנים כמעט כל שיעור. לרוב לא קשים מדי ולפעמים יש שאלות בונוס אבל צריך לזכור שמות של אנזימים, הורמונים ותפקידים ולעבור טוב על הסיכומים. לפעמים נתנה חומר קריאה קצת ארוך לקראת ההרצאה.\n\nשם המתרגל/ת: מאיה\nחוות דעת - תרגולים: תרגולים ממש סבבה, עוזרים לסכם קצת את ההרצאה. הרבה פעמים היה צריך לקרוא מאמר לקראת התרגול ולהציג איור מהמאמר לכיתה, זה היה קצת עמוס. היה כתוב שהנוכחות בתרגולים חובה אבל לא הרגיש שמאיה בודקת את זה והיא גם אפשרה להתחבר בזום למי שצריך\n\nשעורי הבית: סך הכל 4 מטלות שיעורי בית שהיו לרוב שאלות שמצריכות לעשות סקירה ספרותית. חלק משיעורי הבית היו על המאמרים שדיברנו עליהם בכיתה. היו ארוכים, אבל פורסמו כל שבועיים ומאיה מאוד מתחשבת אם מבקשים הארכה בזמן. בסוף הקורס היה צריך להעביר פרזנטציה על נושא כלשהו שבחרנו מתוך רשימה ובשיעור נוסף היה צריך להגיש משוב על פרזנטציה של מישהו אחר. בסוף הקורס לוקחים את הציון של רק 4 מתוך 5 מטלות ונאמר שגם יורידו את 2 הבחנים הכי פחות טובים/שלא עשו כי לא הגיעו לשיעור.\n\nהמבחן: לא היה מבחן, הייתה עבודה סופית בזמן ההרצאה האחרונה שבה שאלו שאלות שקשורות לציר אנדוקריני לבחירה. היה צריך לדעת מחלות ותסמינים והשפעה על צירים אחרים ולחשוב על שאלת מחקר לעתיד הקשורה לציר. קצת צפוף בזמן אבל עדיף על מבחן וזה היה עם חומר פתוח.\nהייתה גם תחרות בונוס שבה היה צריך להביא משהו יצירתי על אנדוקרינולוגיה, שיר, ציור, אוכל וכו'.. הייתה הצבעה ורק 3 מציגים קיבלו בונוס.\n\nהשורה התחתונה: קורס עמוס וזה הועבר לפיליפה אז אולי היא תשנה משהו בפעם הבאה שתעביר את הקורס. חוץ מזה, קורס מעניין בטירוף שלגמרי שווה את ההשקעה.", "timestamp": 1675330777585}, {"author": "אל תקחו את הקורס!", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: פיליפה\nחוות דעת - הרצאות: הרצאות גם נוכחות חובה ב-8:30, היה כל שבוע בחן בהתחלת ההרצאה שלא ממש הבננו על מה היא תשאל והרבה פעמים היא שאלה על דברים קטנים שהיה קשה לזכור אותם, בנוסף כל שבוע היא בחרה באקראי שם שייסכם את השיעור שעבר, היה מאוד מיותר ולקח המון זמן לחזור ולסכם שיעור שלם ב-10 דקות!! בבחנים היא הורידה על כל דבר נקודות והיה להם אחוז לא קטן בציון הסופי. בשיעור האחרון הייתה מטלה סופית עם חומר פתוח, היא הגבילה במספר השורות ובסוף הורידה המון נקודות על כך שהיה חסר דברים בתשובה (?!), סיימתי את המטלה בהרגשה מאוד טובה ובסוף גיליתי שהיא פשוט הורידה המון נקודות על שטויות ורק בגלל שזה לא מה שהיא רצתה שיהיה בתשובה. \n\nשם המתרגל/ת: מאיה\nחוות דעת - תרגולים: נחמדה, התרגולים עזרו קצת בלחזור על החומר ולהבין מעבר קצת, חוץ מזה לא היה סנכרון בין התרגולים להרצאות כל כך.\n\nשעורי הבית: היה 4 תרגילי בית, תרגילי הבית בכלל לא קשורים לחומר ההרצאה ודרשו המון השקעה וקריאת מאמרים על מנת לפתור אותם (הרגשתי שהיה לי 2 קורסים של 5 נקודות ולא קורם של 2.5 נק\"ז), בנוסף היה הצגות ומשובים בשני התרגולים האחרונים.\n\nהמבחן: חרא של ציונים ועל כלום.\n\nהשורה התחתונה: שורה תחתונה,תחסכו לעצמכם ואל תקחו את הקורס אפילו אם זה נשמע מעניין!! הקורס הכי לא שווה בכל התואר למרות שהחומר היה מעניין, השקעתי בו המון בסמסטר ובסוף הציון היה מאוד מבאס.", "timestamp": 1678120349242}]}