{"posts": [{"author": "פיזיולוגית הצמח", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: סיגל סבלדי-גולדשטיין\nחוות דעת - הרצאות: סיגל חמודה נורא אבל לא מרצה מדהימה (קצת משעממת ואיטית). יש כמה הרצאות אורח, עם רמות שונות של הצלחה. \n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: אין \n\nשעורי הבית: 2 הגשות לאורך הסמסטר, תקפות, נבדקו בקפידה. \n\nהמבחן: קשה. הרגשתי שליטה מאוד גבוהה בחומר ויצאתי בבכי. \n\nהשורה התחתונה: קורס נחמד לחובבי צמחים, אבל מבחן קשה.", "timestamp": 1600361607382}, {"author": "--", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: סיגל\nחוות דעת - הרצאות: \nההרצאות בסה\"כ דיי אינפורמטיביות. לרוב במהלך השעה השלישית המרצה מתחילה מעט להתעייף וקצת יותר קשה להבין את החומר הנלמד. שמה דגש על קשר אישי והיכרות עם כל סטודנט כי הקורס קטן. לטוב ולרע...\n\nשעורי הבית: שלוש הגשות, שאלות פתוחות גדולות. הניסוח של השאלות לא מספיק ברור ולכן נגררו הורדות גבוהות בציון בשל חוסר הבנה בין המרצה לסטודנטים. בנוסף יש שאלות שנכתבו לא ע\"י מרצת הקורס ואז בכלל קשה לקבל מהסגל מענה לגבי כוונתם בשאלות. מסרבת לפרסם פתרון רשמי.\n\nהמבחן: \nדומה לשיעורי הבית, מנוסח באופן מעט מעורפל. כל שנה היא מחליטה מחדש האם לשים יותר משקל על שאלות אמריקאיות או פתוחות. מסרבת לפרסם פתרון רשמי.\nהשורה התחתונה: החומר לא קשה, ההתנהלות מול הסגל קשה.", "timestamp": 1630566509805}, {"author": "נ.ד", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: סיגל\nחוות דעת - הרצאות: סיגל סה\"כ נחמדה אבל מרגישים שהיא מתאכזבת מסטונדטים שלא מגיעים להרצאות פרונטליות ובודקת אם הם יודעים את החומר. ההרצאות ארוכות מאוד ובשעה השלישית גם הסטונדטים וגם סיגל כבר מאבדים ריכוז. חלק מההסברים לא ברורים.\nמעבר לכך, יש הרצאות מסויימות שהן של אורחי חוץ. המרצים האורחים גם כוצבים חלק מהשאלות לשיעורי הבית והמבחן, וניכר שסיגל לא יודעת לענות על שאלות שהן לא כלולות תחת החומר שלה.\n יש הרבה מאוד חומר. לא הקורס הכי פשוט. עם זאת כן היו הרצאות שעניינו אותי.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים:  -\n\nשעורי הבית: יש 3 מטלות שכל אחד הינו 15% מהציון. חלק מהשאלות כתובות בצורה מאוד ברורה והבדיקה קפדנית. השאלות של המרצים האורחים היו ממש ממש לא ברורים וכסיגל נשאלה עליהם, היא בעצמה לא ידעה לענות. צריך להשקיע הרבה זמן ומחשבה בשיעורים כדי לקבל ציון טוב בהם.\nמה שכן, 3 מטלות במקום 5 או 6 כמו בקורסים אחרים, גורם לפחות עומס בקורס.\n\nהמבחן: מעט שאלות אמריקאיות, הרבה שאלות פתוחות (תשובות קצרות). חלק מהשאלות ממוחזרות. יש הרבה מאוד חומר והשאלות שואלים על פרטים ממש קטנים, דברים ממש ספציפיים, ופחות על הבנה כללית. צריך ללמוד ממש טוב למבחן, כדאי לעבור על המצגות/סיכומים כמה פעמים ולשנן שמות ופרטים.\n\nהשורה התחתונה: לא קורס קל, הרבה חומר, חלק מההרצאות מעניינות וחלק לא, סיגל יכולה להיות ממש נחמדה וגם לעיתים לא כל כך. צריך להשקיע הרבה זמן בשיעורי בית ובלמידה למבחן.", "timestamp": 1630567757283}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: סיגל\nחוות דעת - הרצאות: הרצאות ארוכות של 3 שעות, המון חומר. קשה בהתחלה להיכנס לעניינים ולזכור את כל המוסגים אבל במהלך הסמסטר זה משתפר (אם לומדים טוב). הרבה התייחסות לניסויי ביקורת ואיך גילו את כל החומרים, גנטיקה..\nאבל ממש מעניין!\n\nשם המתרגל/ת: לא היה\nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית קצת קשים, דורשים קריאה עצמית והבנה של החומר ברמה גבוהה תוך כדי הסמסטר. זה קשה אבל עוזר לקראת המבחן. היא אמרה שהמבחן יהיה בסגנון השאלות של השיעורי בית.\n\nהמבחן: פעם ראשונה שהוא היה רק שאלות פתוחות, בלי חלק אמריקאי. היו שאלות ברמה הגיונית, עם הכוונה או בקשה לדוגמאות ולא לפרט את כל החומר בעל פה. לקח שעתיים. סך הכל היו ציונים טובים.\n\nהשורה התחתונה: קורס ממש מעניין למי שאוהב צמחים וביולוגיה. המון חומר.", "timestamp": 1664793678721}]}