{"posts": [{"author": "/", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: סימה + עודד\nחוות דעת - הרצאות: מחולק בין 2 מרצים. סימה מתעסקת בתחום היותר פרקטי, עודד בתחום של התפתחות אורגניזמים, קלסיפיקציה. החלק של עודד מבולגן.\n\nשם המתרגל/ת:  אין\nחוות דעת - תרגולים: \n\nשעורי הבית: 2 תרגילים, כמעט ולא קשורים לחומר. יוצא שלא מתרגלים את החומר עד למבחן. \n\nהמבחן: אצלנו היו שאלות פתוחות, התעסקו בחומר העיקרי שנלמד בקורס (לא היו הפתעות). \n\nהשורה התחתונה: קורס שבחלקו מאוד פרקטי (ושימושי להמשך), וחלק רק מעניין (ולא רלוונטי בכלל להמשך). קורס לא קשה, הרבה נק\"ז ביחס לעבודה שנדרשת.", "timestamp": 1602704214370}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: פרופ' עודד בז'ה ופרופ' סימה\nחוות דעת - הרצאות: סימה מרתקת נהנתי מכל השיעורים, גם השיעורים של עודד מעניינים אבל אותי אישית הנושא עניין פחות\n\nשעורי הבית: רק 2 ת\"ב, אחד רציני וקצת מעיק אבל לא יותר מיומיים עבודה גג. התרגיל השני זה לכתוב שיר...\n\nהמבחן: קליל ביותר\n\nהשורה התחתונה: קורס בחירה הכי מומלץ שיש", "timestamp": 1608819945496}, {"author": "shaked dery", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עודד וסימה\nחוות דעת - הרצאות: אני יותר אהבתי את ההרצאות של סימה, מאוד מעניינות. ההרצאות של עודד הרגישו לי טיפה פחות מובנות.. אבל לא נורא. בכל מקרה כל אחד מעביר חלק אחר בקורס, אז אין בחירה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: מידי פעם היו תרגילים רשות, בפועל חלקם היו בסדר, ובחלק ממש כיסחו בניקוד. המגן לא עזר לי בכלל. הייתי ממליצה לעשות רק תרגילי בית שרואים שלא ידרשו המון השקעה.\n\nהמבחן: די ממוחזר, אבל יש פתרונות משנים עברו רק לחלק האמריקאי. הם לא מפרסמים סריקות אחרי המבחן, כנראה בגלל שהם ממחזרים...\n\nהשורה התחתונה: בסך הכל קורס מאוד מעניין שאפשר להוציא בו ציון טוב מאוד אם לומדים כמה ימים טוב למבחן. ושווה 3 נקז אז לדעתי שווה בהחלט.", "timestamp": 1626869565542}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: סימה ירון ועודד בזה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 3-4 מטלות לאורך הסימסטר פלוס לומדות ובחנים במודל\n\nהמבחן: הוגן ברמתו אך יורד לפרטים.\n\nהשורה התחתונה: לפני המבחן צריך לשנן סיכום מוצלח ולתרגל מבחנים קודמים", "timestamp": 1628087079502}]}