{"posts": [{"author": "Anne Onimus", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "מעבדה סבבה לגמרי, הצוות יחסית נחמד וקשוב לסטודנטים (יש כאלה שיותר וכאלה שפחות) ולדעתי המעבדה נורא כיפית.\nעכשיו בואו שבו במעגל למה אני אספר לכם טיפים מצילי חיים \nקודם כל טל מדריך מעבדה הכי טוב בפער למרות שכל השאר גם סבבה לגמרי, תאמינו לי שאתם רוצים להיות עם טל. אם יש לכם אפשרות לבחור אצל מי להיות לכו רק לטל.\nבמעבדה עצמה יש בוחן כניסה ודו\"ח שכותבים תוך כדי המעבדה ומגישים בסופה. את הדו\"ח כותבים על דף (!) בצורה ידנית (!!!) ולא במחשב כאילו אנחנו בימי הביניים, וגם חלק מרכזי במעבדה זה לצייר ציורים אז מומלץ להביא הרבה טושים ומרקרים.\nהמעבדה מתחלקת חצי חצי לשני חלקים, חסרי חוליות ובעלי חוליות.\nדוחות המעבדה עצמם משוחזרים ב100% משנים קודמות אז כשלומדים למעבדה מומלץ גם ללמוד מהם ולוודא שאתם יודעים לענות על כל השאלות בדוח, אבל מאוד חשוב לא להסתמך רק על זה. תשובות שהתקבלו כנכונות לפני שנה לא בהכרח יהיו נכונות היום וגם לכל מדריך יש את הג'וקים שלו ואת מה שהוא חושב לנכון אז תמיד תוודאו עם המדריכים שלכם שמה שאתם חושבים שהוא התשובה הנכונה הוא אכן התשובה הנכונה, אפילו אם זה מצוטט אחד לאחד מרפרנס.\nנורא מומלץ להתכונן למעבדה עצמה ולא רק לבוחן, אני הייתי מכינה קובץ שהוא פרוטוקול המעבדה ויש עליו את כל ההערות והציורים שצריך לצייר מראש, את התשובות לכל השאלות + צילום מסך של המקור לתשובה מהקובץ הכנה וזה מאוד הקל על העבודה ומנע את הצורך להתרוצץ בין הדף של הפרוטוקול לדף רשימת הציורים לחומר התאורטי, וגם הכין אותי ממש טוב לבוחן.\nהבחנים של חסרי החוליות משוחזרים במשהו כמו 70%-80% והבחנים של בעלי החוליות ב99%-100% אז תשננו היטב בעיקר את הבחנים משנים קודמות.\nבחסרי חוליות בשביל להתכונן ל2 הבחנים הראשונים צריך ללמוד בעל פה את פרוטוקול המעבדה וגם את כל מה שהועבר בהרצאה המקבילה בזואולוגיה. בשאר המעבדות של חסרי חוליות יש סיכום נורא ממוקד ומובן בפרוטוקול המעבדה עצמו ומספיק ללמוד אותו (ואת בחני העבר) כדי להוציא ציון שואף ל100.\nבבעלי חוליות לכל מעבדה יש קובץ הכנה עם חומר תאורטי של 90 עמודים בממוצע(!!!), מן הסתם אף אחד לא הולך לקרוא את כל זה בשביל מעבדה של 1.5 נקז. ההמלצה שלי היא ללמוד לזה כמו אנסין - לפתוח את קובץ השאלות של המעבדה, לחפש בחומר התאורטי את התשובה לשאלה וללמוד רק את הפסקאות המתאימות + את כל הציורים שמופיעים בקובץ.\nוזהו אחלה מעבדה תהנו ממנה", "timestamp": 1716722606769}]}