{"posts": [{"author": "בלום", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פרופ עדו רול\nחוות דעת - הרצאות: מעניינות מאוד מרצה ממש טוב. גם לא באמת לקחו נוכחות, אבל עקבו אחרי האנשים דרך השתתפות בכל מני דברים בשיעור (לטענתם).\n\nשם המתרגל/ת: אימאן\nחוות דעת - תרגולים: ממש מתרגלת מעולה עזרה המון בפרויקטים ושיעורי הבית.\n\nשעורי הבית: \nיש 4 שיעורי בית שעושים את רוב העבודה בזמן התרגול, ופרויקט בסוף שגם עובדים עליו בזמן השיעורים. הפריקט מוגדר טוב ואפילו אפשר להשתמש בשיעורי בית קודמים לבניית הפרויקט\nהמבחן: איו\n\nהשורה התחתונה: \nקורס סופר מעניין ובסוף מציגים את הפרויקטים מול מרצים מפקולטות שונות שזה ממש נחמד. אולי קצת עמוס בשביל מל\"ג אבל מי שמעניין אותו שווה את זה.", "timestamp": 1690536768914}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עדו רול\nחוות דעת - הרצאות: מעניינות ממש וכיפיות. רלוונטיות לנו בתור סטודנטים באקדמיה.\nעדו אחלה של בן אדם, יודע לייצר עניין ומשתדל גם להציע לנו להיות מעורבים בעניינים ותוכניות של הפקולטה למי שעולם החינוך מעניין אותו\n\nשם המתרגל/ת: אימאן.\nחוות דעת - תרגולים: גם כן ממש נחמדה ותמיד באה לקראתנו. התרגולים הם תכלס זמן לעבודה על המטלות.\n\nשעורי הבית: יש 4 מטלות + פרוייקט סיום שעובדים עליהם בזוגות בשעה השנייה של ההרצאה (השעה של התרגול). בפועל זה לא תמיד מספיק וכן צריך להקדיש קצת זמן לעבודה בבית.\n\nהמבחן: אין\n\nהשורה התחתונה: מומלץ כי מעניין והסגל מדהים אבל לא כזה קליל וכן דורש עבודה יחסית למלג", "timestamp": 1692030570629}, {"author": "RAZ", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עידו \nחוות דעת - הרצאות: מרתקות, התחברתי להם. \n\nשם המתרגל/ת: אימאן\nחוות דעת - תרגולים: ממש נחמדה, עוזרת בהכל, מבינה את העניין.\n\nשעורי הבית: יש, הרבה, עשינו 4 מטלות לסמסטר ועוד כמה מטלות ופרויקט סופי (הכל בזוגות).\n\nהמבחן: אין, יש פרויקט + דוח + הצגה.\n\nהשורה התחתונה: עמוס, מל\"ג יפה ואחלה וממש מעניין, אך לצערי לא יכול להצליץ עליו. לדעתי לא שווה את ה2 נק\"ז (צריך יותר). דורש הרבה השקעה בסמסטר (אחרי הסמסטר). לא הייתי לוקח אם ידעתי ממש את העומס. (למרות שקיבלנו 95-100)\nמדרג אותו \"עמוס\" כי הוא עמוס ביחס למל\"ג וביחס ל 2 נק\"ז.", "timestamp": 1712742666151}, {"author": "2", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עדו\nחוות דעת - הרצאות: מעולות. עדו מעביר את החומר בצורה ממש מעניינת ונותן הרבה מקום לחידושים ודעות שונות\n\nשם המתרגל/ת: אימאן\nחוות דעת - תרגולים: אחלה, עזרה בפרויקטים ונתנה נקודת מבט\n\nשעורי הבית: יש 4 מטלות במהלך הסמסטר ופרויקט סופי שמציגים בסוף הקורס. עמוס יחסית למל\"ג אבל גם מעניין אז מי שיהנה מהתוכן של הקורס יהנה לעבוד על המטלות. יש הרבה מקום ליצירתיות\n\nהמבחן: -\n\nהשורה התחתונה: אחלה של מל\"ג, כן דורש עבודה אבל לדעתי שווה את זה", "timestamp": 1715155225408}]}