{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ארי\nחוות דעת - הרצאות: בחלק הראשון של הקורס אין נוכחות חובה ולכן לא הייתי, בחלק השני הוא אומר שיש נוכחות חובה אבל בפועל לא בדק אף פעם וגם הרבה מהקורס לא הגיע אז לא בטוח שחייב להגיע. ההרצאות נחמדות מדברות על דרכי למידה ודרכי הוראה. מי שמתעניין בזה זה יכול להיו נחמד אותי זה טיפה שעמם כי אין לי עניין בהוראה. אבל סך הכל לא דורש שום השקעה וגם אפשר להיות עם מצלמה סגורה בזום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא היה תרגולים, במערכת זה רשום שזה 3 שעות אבל בפועל זה שעתיים.\n\nשעורי הבית: אין\n\nהמבחן: אין מבחן, יש מטלת סיום של הקורס שהייתה לצלם את עצמנו מעבירים שיעור על נושא כלשהו (ברמה תיכונית) במשך רבע שעה. סה\"כ מטלה יחסית קלילה, בסמסטר פרונטלי המטלה תהיה להעביר את זה מול כיתה ואז יכול להיות קצת מלחיץ לאנשים עם פחד קהל אבל התנסות נחמדה.\n\nהשורה התחתונה: מל\"ג מומלץ ציונים מאוד גבוהים בלי הרבה השקעה ובלי מבחן.", "timestamp": 1615198454915}, {"author": "Elad Kay", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ד\"ר ארי גרו\nחוות דעת - הרצאות: מרתק! בנוסף לכך שהוא בעצמו חוקר ומרצה עטור פרסים בטכניון, ארי מעביר את המל\"ג הזה שמועבר בפקולטה לחינוך. ההרצאות מאוד מעניינות ונקודת המבט היא תמיד מדעית-הנדסית (התואר הראשון של ארי בעצמו היה בחשמל-פיזיקה). ארי נחמד ומתחשב, מהיר בתגובות במיילים וסה\"כ בן אדם טוב. בסמסטר שלי הוא אפשר להתחבר להרצאות מהזום, בדק נוכחות מדגמית (אולי פעמיים-שלוש פעמים כל הסמסטר) ואפשר לא להגיע להרצאות עם סיבה מוצדקת שמודיעים לו מראש במייל. אני בכל זאת הגעתי להרצאות ואני ממליץ, כי ההרצאות מאוד מעניינות!\n\nשעורי הבית: כל הציון בקורס מתבסס על כמה מטלות במהלך הסמסטר - מערך שיעור של שיעור באורך 20 דקות, הקלטה בפועל של השיעור, דפי תצפית שרואים שיעורים של עוד 5 סטודנטים וכותבים מה דעתנו ובסוף דוח מסכם. סה\"כ ממש לא הרבה עבודה וזה די נחמד ובאמת לומדים מזה. מאוד מאוד מומלץ.\n\nהמבחן: אין!\n\nהשורה התחתונה: כנראה המל\"ג הכי טוב שהיה ויהיה אי פעם, בין היתר כי ראו היסטוגרמה, בין היתר כי אין מבחן, בין היתר כי ההרצאות מעולות", "timestamp": 1646572592532}, {"author": "-----", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ד\"ר ארי גרו\nחוות דעת - הרצאות: \nרשום במערכת שעה של הרצאה ושעתיים של תרגול אבל זה פשוט שעתיים של הרצאה כמו כל מל\"ג.\nמרצה מדהים, יודע ליצור עניין, החומר מעניין וארי יודע להעביר שיעור בצורה מאוד מאוד כיפית.\n\n\nשעורי הבית: הציון של הקורס הוא רק משיעורי בית (אין מבחן), רק צריך לצלם את עצמך מעביר שיעור של 20 דק' על חומר תיכוני ולהעביר ביקורת בונה על הרצאות של סטודנטים אחרים ואם לא מזלזלים ארי מבטיח שיוצאים מהקורס עם ציון של לפחות 95.\n\nהמבחן: אין\n\nהשורה התחתונה: המל\"ג היחיד שלקחתי שהיה שווה את זה.", "timestamp": 1654619135314}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דר. ארי (אהרון) גרו \nחוות דעת - הרצאות:  ההרצאה היא שעתיים ולא שלוש כמו שכתוב בלוח. חשבתי שאעשה וובוורקים באינפי בזמן הזה ובפועל לא הייתי בפלאפון בכלל. ארי מאוד מעניין, בגובה העיניים ואוהב לדבר עם הסטודנטים בלי קשר. נוכחות חובה פרונטלית אבל בדק ארבע פעמים בסמסטר שזה מספר ההיעדרויות שלא צריך אפילו להודיע עליהן. חוץ מזה יש בקורס הרבה טיפים מוצלחים איך ללמוד למבחנים ולארגן חומר.\n\nחוות דעת - תרגולים: אין \n\nשעורי הבית: במהלך הסמסטר אין שיעורים *בכלל*. \nהעבודה היחידה היא הקלטת מערך שיעור של 15-20 דק בנושא תיכוני לבחירתכם, משוב לכמה חברים ולכתוב סיכום על המשובים שנתנו לכם.\nסה\"כ אם השקעתם ממש 4 שעות עבודה כולל הכל.\nתראו את ההיסטוגרמה ותשתכנעו לבד  :)\n\nהשורה התחתונה: נהניתי מכל רגע, ממליץ ממש \nכדאי לכתוב לארי מייל בסוף הסמסטר שלפני זה אליו אתם רוצים להירשם כי המלג מבוקש מאוד", "timestamp": 1662114514081}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: \nמצוינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nמל\"ג הכי טוב, מעניין ומועיל שלקחתי בטכניון. ח ו ב ה !", "timestamp": 1674326199065}, {"author": "Best", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: מעניינות מאוד! חובה לדעתי לכל מרצה ומתרגל לקחת את הקורס הזה. ארי מרצה בחסד, אוהב ללמד, יש לו ידע מקצועי בהמון תחומים והשיעורים מרתקים!\n\nשעורי הבית: אין שיעורי בית. \n\nהמבחן: עבודת גמר, צריך לבנות מערך שיעור ולהעביר אותו ולדרג עוד חמישה שיעורים של חברי צוות לקבוצה. סה\"כ בערך יומיים השקעה, ואצלנו היה אפשר להגיש עד סוף מועדי א ככה שלא יוצא מאוד לחוץ.\n\nהשורה התחתונה: אין מלג יותר מומלץ מזה.", "timestamp": 1678621259929}, {"author": "BaronCabbage", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: פשוט מקסים, מעניין, משתף את הסטודנטים יפה יפה ורק דברים טובים עליו\n\nהמבחן: אין, יש מטלה סופית ששם מקליטים את עצמכם מעבירים שיעור של 15-20 דקות - כל עוד עשיתם את זה בצורה לא מזלזלת יש לכם 100 בכיס\n\nהשורה התחתונה: טופ 1 מלגים.\nמומלץ בהחלט ואפילו לא בגלל החציון\nהחומר מעניין ורלוונטי - תכננתי במהלך הסמסטר לא להקשיב בכלל ומצאתי את עצמי מקשיב רוב הזמן. הלוואי כל המלגים היו ככה", "timestamp": 1678658380224}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ארי\nחוות דעת: קורס ממש מעניין מומלץ בחום\n\nשעורי הבית: אין\n\nהמבחן: אין", "timestamp": 1679414605550}, {"author": "A", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ארי\nחוות דעת - הרצאות: מרצה מעולה, לא סתם הוא מרצה מצטיין כבר כל כך הרבה שנים, הוא מעביר את החומר בצורה מעניינת וגם מיישם בקורס של עצמו את העקרונות שהוא מלמד, אז ההוראה שלו ממש יעילה וטובה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין, יש עבודה להגיש, צריך לצלם את עצמך מעבירה שיעור של 15-20 דקות בנושא לבחירתך מתוך רשימה אפשרית, לא כדאי לזלזל כי אפשר להוציא 100 אבל לא מחפפים. תיישמו את מה שלמדנו בקורס ותקבלו 95-100 בקלות\n\nהשורה התחתונה: מאוד מאוד מומלץ!", "timestamp": 1690728441598}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "השורה התחתונה: אחלה קורס עם הרצאות מדהימות שמאוד לימדו אותי. עבודה שדורשת קצת זמן במקום המבחן אבל הציונים מאוד טובים", "timestamp": 1691669910703}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארי\nחוות דעת - הרצאות:\nמרצה תותח. מאוד נהנתי להקשיב להרצאות שלו, ולמרות שהוא לא בדק נוכחות, היה שווה להגיע לכל הרצאה שלו. \n \nהמבחן: פרוייקט - אין מבחן.\nצריך להקליט את עצמן בין 15 ל - 20 דקות מעביר שיעור.\nבסה\"כ את כל העבודה, אפשר לסיים בכמה שעות.\n\nהשורה התחתונה: \nממאוודדד ממליץ", "timestamp": 1691930416927}, {"author": "ש", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: גרו\nחוות דעת - הרצאות: \nהלוואי ויהיו לי עוד מרצים בתואר כמוהו, אין מלים לתאר כמה אכפת לו מהסטודנטים.\nשעורי הבית: \nלאורך הסמסטר אין שיעורי בית *בכלל* יש עבודת גמר שלוקחת כמה שעות בודדות אם עושים אותה כמו שצריך 100 מובטח\nהמבחן: אין\n\nהשורה התחתונה: \nמל״ג מאוד מומלץ חייבים לקחת!", "timestamp": 1694159422291}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארי\nחוות דעת - הרצאות: בבקשה, פשוט תקחו את הקורס הזה! ארי המרצה הטוב ביותר שפגשתי לאורך התואר שלי. הנושאים מאוד מעניינים והוא גם מיישם את מה שהוא מלמד ולכן פשוט תענוג להקשיב לו. בין המרצים היחידים שלא מתנשאים אלא מדברים בגובה העיניים ובאמת חשוב לו שנבין ונהנה. \nשעתיים שבועיות של נחת.\n\n\nשעורי הבית: אין\n\nהמבחן: אין מבחן אלא עבודה קצרה מאוד של לצלם את עצמנו מעבירים שיעור. הציונים כמובן בהתאם.\n\nהשורה התחתונה: מל\"ג חובה וכל מילה אחרת מיותרת. :)", "timestamp": 1715758760961}]}