{"posts": [{"author": "גבי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אילת ברם-צברי\n\nחוות דעת - הרצאות:\nההרצאות התחלקו להרצאות אונליין (בערך 80%) והרצאות פרונטליות שכללו בעיקר שיחות בין האנשים כדי להמחיש את איך \"מתקשרים מדע\". היה מגוון די רחב באנשים שלקחו את הקורס - מסטודנטים לתואר ראשון ועד דוקטורים, אז היו כל מיני פרספקטיבות. דווקא נחמד.\nההרצאות אונליין היו בפורמט של ראיונות, לפעמים כללו הרבה תוכן שקצת חזר על עצמו אבל סך הכל די מעניין.\n\nשעורי הבית: שלוש-ארבע משימות שידרשו אולי כמה שעות במצטבר אם מחליטים להשקיע. בשבילי זו היתה מנוחה נחמדה מהמטלות הכבדות של מהלך הסמסטר.\n\nהמבחן: אין מבחן, תרקדו :)\nהציון מתקבל לפי המטלות, ולפי מענה על שאלות שמקבלים תוך כדי הצפייה בסרטונים - עם מספר נסיונות לא מוגבל.\n\nהשורה התחתונה: קורס קליל ומעניין, עם מאמץ מינימלי גם עם ציון גבוה. מומלץ!", "timestamp": 1647197520162}, {"author": "יאיר שרקי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: איילת ברעם צברי\nחוות דעת - הרצאות:\nחוץ מ3 מפגשים, כל ההרצאות הם פשוט הקלטות שצופים בהם דרך איזה אתר מובנה לקורס.\nהאמת שההרצאות דיי משעממות, וחייב לראות אותם כדי שיסומן באתר שראית אותם.\nאז אפשר פשוט להעביר לסוף כל פעם וללחוץ על זה כמה פעמים וזה יסמן שראיתם. \n\nשם המתרגל/ת: לא זוכר את השם.\nחוות דעת - תרגולים: \nהאמת שהתרגולים טיפה יותר חשובים כי הם קשורים למטלות.\nגם הם מוקלטים באתר.\nמוסברות מצויין.\n\nשעורי הבית: \nיש את הסרטונים שצריך להשלים באתר ואחרי כל סרטון יש גם שאלות - דיי חופר.\nיש ארבע מטלות מרכזיות - לכתוב כתבה על מאמר, לכתוב פוסט לפייסבוק, לצלם סרטון של עצמכם, לעשות ראיון עם חוקר ולבצע על זה כתבה.\nבנוסף לזה אחרי כל מטלה יש ביקורת עמיתים שצריך להשקיע בה אחרת הציון נפגע.\nדיי עמוס יחסית לקורס שהוא כמו מלג, קחו את זה בחשבון שכדי לקבל מעל 95 צריך להשקיע זמן במהלך הסמסטר יותר ממה שהייתם משקיעים במלג רגיל.\n\nהמבחן: \nאין מבחן - יתרון משמעותי.\n\nהשורה התחתונה: \nמבחינת עניין - הקורס לא כזה מעניין לדעתי וכן שורף זמן במהלך הסמסטר, היתרון הוא שמובטח ציון גבוה ואין מבחן.\nאם אתם לא מוצאים משהו יותר טוב הייתי לוקח אותו.", "timestamp": 1678960991427}, {"author": "מתקשר המדע", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה:  איילת\nחוות דעת - הרצאות:  יש כמה מפגשים של 3 שעות \nסרטונים בבית מעיקים - תכלס מריצים את זה על פי 2 בלי להיות ליד המחשב אבל יש מלא סרטונים שצריך להעביר אז קשה להתרכז במשהו אחר שעושים תוך כדי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nחופרים ברמה קשה, יש כתיבת ידיעה ואז לתקן את הידיעה לפי ביקורת שעמיתים נתנו לך, בנוסף צריך לרשום 2 ביקורות עמיתים בעצמך.\nאחרי זה יש פוסט פייסבוק שצריך לרשום ואז להגיב בפייסבוק\nאחר כך יש לעשות ראיון עם מישהו מהאקדמיה ולרשום 700 מילים על הראיון, אחר כך לשפר את הראיון מביקורות שרושמים לך ובנוסף אתה צריך לרשום ביקורות על אחרים.\nבסמסטר רגיל יש עוד משימה \nהמבחן: \n\nהשורה התחתונה: \nלא לקחת!!!!!!!!!!!!!!!\nהממוצע אולי נראה מפתה אבל יש קורסים שווים פי כמה. הקורס הזה משאבת זמן וכבר ראיתי היסטוגרמות מפתות מזה. \nלוקח המון זמן לעומת מלג או בחירה חופשית, במקום זה תלכו תהנו באיזה קורס חביב בפקולטה נחמדה או תעשו ספורט", "timestamp": 1710422525296}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "חוות דעת - הרצאות: הקורס הוא בעצם מקוון כמעט לגמרי. צופים בסרטונים באתר קמפוס ואחר כך עונים על שאלות. חלק מהראיונות בסרטונים היו לי נורא מעניינים וחלק פחות.. עניין של טעם אישי. המשימות בקמפוס לא קשות בכלל ויש מספר בלתי מוגבל של נסיונות. \n\nשם המתרגל/ת: איילת ויעל\nחוות דעת - תרגולים: יש שלושה מפגשים פרונטליים סה\"כ. הם היו בעיניי ממש כיפיים ואפשרות להתנתק קצת מהקורסים הקשים יותר של הסמסטר. הקורס מאוד מגוון מבחינת האנשים שלוקחים אותו כך שאפשר לעשות דיונים עם סטודנטים מתואר ראשון ועד לדוקטורנטים וזה היה נורא מעניין. \n\nשעורי הבית: בסמסטר רגיל יש 4 מטלות והסמסטר הזה הייתה לנו אפשרות לעשות רק 3. כן, המטלות דורשות זמן ומאמץ וכוללות יחסית המון כתיבה. אז אם אתם אוהבים לכתוב אתם ממש תהנו מהן כי הן באמת מעניינות (במיוחד המטלה השלישית של לראיין חוקר) אבל אם כתיבה זה פחות הקטע שלכם, אולי הן יהיו לכם מעיקות יותר. \n\nהמבחן: אין :)\n\nהשורה התחתונה: מה שנחמד בקורס הזה שהכל פתוח ומפורסם בתחילת הסמסטר. סיימתי הכל כולל הכל חודש וחצי לפני סוף הסמסטר וגם נהנתי ממש כי איילת ויעל מרצות מצוינות והיה כיף ללמוד אצלן (גם פרונטלית וגם באתר קמפוס). \nזה כנראה לא מסוג המל\"גים שמקבלים בהם 100 באפס מאמץ אבל בעיניי הוא מעניין וחשוב מאוד ושווה את ההשקעה.", "timestamp": 1711281362088}]}