{"posts": [{"author": "Bar Gabbay", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: מעניין מאוד לדעתי, לא חובה להגיע בחצי הראשון של הקורס \n\nשעורי הבית: היו בגדול 2 משימות:\n1. ניתוח מאמר אקדמי - לכתוב סיכום של עמוד וחצי ועוד חצי עמוד דעה על מאמר אקדמי מתוך רשימה שניתנה (עד היום האחרון של הסמסטר)\n2. העברת שיעור על נושא בינתחומי (משלב מדע וטכנולוגיה) בקבוצה של 5-6 סטודנטים ולאחר מכן כתיבת משוב עצמי על השיעור.\n\nהמבחן: אין!\n\nהשורה התחתונה: קורס נחמד מאוד, פותח את הראש לאיך מלמדים מדע וטכנולוגיה, ציונים גבוהים מאוד ולא הרבה השקעה. ממליץ מאוד (ניתן לקחת כבחירה חופשית)", "timestamp": 1645349742247}, {"author": "--", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: \n\nשעורי הבית: אין. רק מטלה אחת קצרה של הגשת מאמר והרצאה קבוצתית כמטלת סיכום. \n\nהמבחן: אין\n\nהשורה התחתונה: קורס מעניין, מרצה טוב, ניקוד גבוה, יחסית מעט השקעה. מומלץ להעלאת ממוצע סמסטר. וההרצאות סתם כיפיות לבוא אליהן ולהקשיב.", "timestamp": 1647519511045}, {"author": "אופק גינת", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ארי\nחוות דעת - הרצאות: מעניינות, ארי בין המרצים הטובים שפגשתי. אין צורך להשקיע שניה במהלך השבוע רק להגיע ולהנות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  אין תרגולים, סתם רשום במערכת כאילו יש תרגול\n\nשעורי הבית: הכנת שיעור והצגתו לפי העקרונות שנלמדו בקורס בקבוצות של 4, כל אחד מציג 10 דקות. בנוסף צריך לבחור מאמר מרשימה ולסכם אותו באורך של עמוד וחצי + לכתוב דעה אישית באורך חצי עמוד, סה\"כ 2 עמודים של כתיבה לא לוקח יותר משעה הכל.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס הבחירה הכי טוב שזכיתי לקחת", "timestamp": 1675348554360}, {"author": "ע.", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארי\nחוות דעת - הרצאות: הנוכחות בקורס חובה (הוא בדק רק פעם אחת) ההרצאות מאוד כיפיות בכללי ואין סיבה להשתעמם\n\nשעורי הבית: \nיש רק 2 מטלות בכל הקורס!\nניתוח מאמר מדעי כעמוד וחצי ועוד חצי עמוד חוות דעת (אפשר לסיים אותו בחצי שעה) - בבודדים\nמטלה של קבוצות (5-6) אשר בה בוחרים נושא שמשלב מדע וטכנולוגיה ומציגים שיעור כ 40 דקות.\nמאוד קליל ואם מחלקים את העבודה בין הצוות בצורה טובה כל אחד עובד מקסימום שעה. \nהמבחן: אין\n\nהשורה התחתונה: היסטוגרמה למטה משקפת את מה שאמרתי - השקעה של 3-4 שעות בכל הסמסטר! ו 100 מובטח", "timestamp": 1713422900872}, {"author": "1", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארי גרו\nחוות דעת - הרצאות: הרצאות ממש נחמדות, גם כיף להשתתף, מעביר את הזמן יותר מהר.\n\nשעורי הבית: לעשות איזשהו חוות דעת על מאמר מסוים, שעתיים וחצי וגמרתם ואם עשיתם את זה במינימום רצינות קיבלתם 100.\n\nהמבחן: אין מבחן, יש שיעור של 45 דק' להעביר ואם רואים שהייתם רציניים ובאמת התכוננתם לשיעור הזה אז הכל טוב.\n\nהשורה התחתונה: קורס מומלץ לקחת עם חברים מהתואר ולקבל 100 קל שמעלה את הממוצע.", "timestamp": 1715434054291}]}