{"posts": [{"author": "רון", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: מר איהאב וותד\nחוות דעת - הרצאות: \nמרצה טוב, מסביר את החומר בצורה נהירה ומובנת\nשם המתרגל/ת: גיא ברשצקי\nחוות דעת - תרגולים: \nמתרגל מצוין, מסביר את החומר בצורה מובנת ונותן אינטואיציה טובה להבנת עקרונות חשובים בקורס\nשעורי הבית: 5 ש\"ב עמוסים, בייחוד ת\"ב 3, ומהווים 10% תקפים מהציון הסופי. שיעורי הבית נותנים דגש על הפן התכנותי. אין קשר (למעט ת\"ב 5) בין השאלות שמופיעות במבחן הסופי לבין השאלות בתרגילי הבית. \n\nהמבחן: המבחן מתבסס על ידיעת האלגוריתמים שנלמדו בקורס: בעיות בסיבוכיות לוגריתמית, היסטוגרמות, שיטת החלוקה, מיונים ,חישוב סיבוכיות של קודים, פתרון בעיות בעזרת עקרון backtracking \n\nהשורה התחתונה: \nעבור מי שלא למד תכנות בבית הספר: יהיה קשה, ויצריך לא מעט זמן כדי להבין ולהסתגל למציאות הזו. חשוב לעבוד על הבנת החומר ולא לסחוב את זה. על מנת לצלוח את תרגילי הבית חשוב להבין היטב את התרגולים וללכת לשעות הקבלה אם משהו לא מובן. ממליץ להדפיס ולכרוך את התרגולים \nחשוב להבין כמה שיותר מהתרגולים ולראות בעיקר את שלוש ההרצאות האחרונות - כי משם ישנם לא מעט רעיונות שעשויים להופיע במבחן הסופי.", "timestamp": 1599169259446}, {"author": "א", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מסבירה לא רע.\n\nשם המתרגל/ת: עומר דהרי\nחוות דעת - תרגולים: מסביר טוב ומשתדל להעביר בצורה ברורה.\n\nשעורי הבית: עוזרים להטמעת הנושאים שנלמדו.\n\nהמבחן: הוגן מאוד.\n\nהשורה התחתונה: הקורס מעניין. הוא לא נוטה להיות קל למי שאין רקע בתכנות, אך ניתן להצליח בו גם אז.", "timestamp": 1602406663925}, {"author": "That's a secret I'll never tell", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:\nמרצה מדהימה מדהימה מדהימה! נותנת מקום לשאלות. בתור אחת ללא רקע, ממליצה מאוד לראות את כל ההרצאות ולהתעמק בהבנה, הרבה פעמים אנשים בעלי רקע אומרים שזה מיותר- well, אם אין לכם רקע, אל תחשבו אפילו על לוותר.\nשם המתרגל/ת: נאג'יב- יוטיוב\nחוות דעת - תרגולים: אולי היתרון העיקרי אם לא היחיד של סמסטר זום, זה שלא מרגישים 'רע' על זה שלא מגיעים להרצאות ולתרגולים בלייב. נאג'יב מעולה ומסביר את החומר מצוין.\n\nשעורי הבית: למי שבלי רקע, מאוד קשה ודורש המון זמן. ממליצה להגדיר מראש כמה זמן להקדיש לש\"ב, ואם לא הולך אז לעצור, יכול לגזול המון זמן שבסופו לאו דווקא תצליחו.\n\nהשורה התחתונה: אם אין לכם רקע, הרצאות של יעל+ נאג'יב ביוטיוב, המון תרגול ואתם תהיו בסדר.", "timestamp": 1610019198947}, {"author": "Oded Schiller", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דניאל פודולסקי \nחוות דעת - הרצאות: \nמעולות, יש גם רשימות שהוא כתב שזה הדבר שהכי עוזר בהבנת החומר. בנוסף, החודש האחרון (שבו 2 הנושאים האחרונים) קשה ועמוס ברמות, שאר הקורס הרבה פחות קשה.\nשם המתרגל/ת: גידי אלון\nחוות דעת - תרגולים: \nמעולה, מנוסה ומתרגל מעניין רצח, יש רשימות מעולות של התרגול גם\nשעורי הבית: \nקשים, ארוכים מעיקים. חשוב רצח לעשות לבד זה הכי עוזר למבחן. לוודא שעושים ומבינים הכל.\nהמבחן: \nקשה, יש שינויים בחומר וקשה ללמוד אליו, אבל הוא פייר ודומה לשיעורי בית. בקיצור תעשו לבד את השיעורי בית תצליחו\nהשורה התחתונה:", "timestamp": 1612811058642}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: תומר שלומי\nחוות דעת - הרצאות: מרצה מעולה, לפעמים קצת מונוטוני אבל אני מאשים את החומר יותר מאשר אותו.\n\nשם המתרגל/ת: תומר לאנז\nחוות דעת - תרגולים: מתרגל מעולה, מסביר מובן, נותן מקום לשאלות ומתייחס ממש יפה לסטודנטים\n\nשעורי הבית: לי לא היה נסיון בתכנות אז הם לא באו לי בקלות, אבל סבירים ועוזרים להבנה של החומר\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס די משמים, אבל חשוב", "timestamp": 1612898124374}, {"author": "אופק גינת", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: המרצה הכי מדוייקת ומשקיעה מבין המרצים. לא חוסכת שום פרט חשוב למבחן. ממליץ לראות מוקלט על מהירות כפולה כי מדברת לאט.\n\nשם המתרגל/ת: הראל וקנין\nחוות דעת - תרגולים: מתרגל מצויין , אכפתי ומשקיע.\n\nשעורי הבית: מאתגרים ומעניינים, אפשר להוציא 100 עם מעט השקעה.\n\nהמבחן: פתיר מאוד חוץ מהשאלה האחרונה על הbacktracking\n\nהשורה התחתונה: קורס חשוב ומעניין", "timestamp": 1613396574589}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "חוות דעת - הרצאות: ההרצאות לא באמת עוזרות בכלום, מלמדים רק תיאוריה שלא עוזרת, למי שאין עבר בתכנות בהצלחה בתחילת הקורס כי הוא לא מובן בכלל בהתחלה.\n\nמתרגל: הראל וקנין\nחוות דעת - תרגולים: המתרגל תותח, הציל לי את הקורס עונה על כל שאלה שתרצו ומספיק את כל החומר, ומלמד ממש טוב למי שאין עבר בתכנות, מסביר כמו שצריך מה זה כל דבר ולמה משתמשים בפקודות מסוימות.\n\nשעורי הבית: מעצבנים\n\nהשורה התחתונה: הראל וקנין", "timestamp": 1613470309707}, {"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: מעביר את החומר בצורה טובה, אך ההרצאות הרבה פחות משמעותיות מהתרגולים\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: המתרגל הכי טוב בקורס הזה נקודה. הוא מתרגל מדהים, עוזר בכל דרך שרק אפשר לחשוב עליה.\n\nהשורה התחתונה: לפתור הרבה מבחנים כדי להבין את הקונספט כי הוא קצת חוזר על עצמו", "timestamp": 1613548502910}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה מעולה! מסבירה את כל החומר בצורה מאורגנת, בניגוד למרצים אחרים שיצא לי לנסות ללכת אליהם. ממליץ מאוד ללכת אליה.\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: מסביר טוב ואכפתי מאוד כלפי הסטודנטים אבל מאוד מאוד (מאוד!) איטי. בפועל ראיתי רוב הסמסטר את נג'יב ביוטיוב.\n\nשעורי הבית: לא קלים ודורשים הרבה השקעה, אבל בסוף לומדים מהם המון וחשוב לעשות אותם כדי להצליח במבחן.\n\nהמבחן: לא קל אבל די חוזר על עצמו. חשוב לתרגל הרבה מבחנים משנים קודמות ואפשר להוציא די בקלות ציון גבוה.\n\nהשורה התחתונה: קורס נחמד מאוד ומעניין, דורש לא מעט השקעה למי שאין רקע בתכנות.", "timestamp": 1614191083756}, {"author": "חופרת", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: אני אהבתי אותו כי הוא היה מצחיק והתחברתי אליו ברמה האישית. האם הוא המרצה הכי מסודר? לא. אבל אני נהניתי\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: הרבה פעמים התרגולים וההרצאות חזרו זה על זה אז איכשהו בפעם השנייה שציינו משהו תמיד הבנתי את החומר.\n\nשעורי הבית: הגעתי ללא שום רקע בתכנות, ואפילו קצת סלידה מתכנות. שיעורי הבית הם בתכלס הדבר הכי חשוב שאפשר לעשות כדי לתרגל את החומר לקראת המבחן. לפעמים היו שיעורי בית שלקחו לי אפילו שבוע עבודה (והרבה דמעות), כי באמת היה לי מאוד קשה להבין את החומר וליישם אותו. עם זאת, אני שמחה מאוד שעשיתי אותם בעצמי ושלא ויתרתי לעצמי, כי ברור לי שלא הייתי מצליחה במבחן בלי התרגול הזה.\nטיפ לאנשים אחרים ללא רקע - תדאגו שיהיה לכם בסביבה לפחות בן אדם אחד, \"חבר טלפוני\", שיכול לעזור לכם כשאתם באמת מגיעים לנקודת ייאוש ולא יודעים איך להתקדם בשיעורי הבית. בשבילי זה היה אבא שלי, לכם זה יכול להיות החונכים של אס\"ט, מורה פרטי או סתם חבר תותח. זה נורא חשוב שהבן אדם הזה לא יגלה לכם את התשובה (כי מזה אתם לא תלמדו) אלא יכווין אתכם לפיתרון.\nעוד טיפ לאנשים ללא רקע - תאמינו בעצמכם, אתם ממש מסוגלים לקבל 90+ בקורס הזה אם תחרשו מספיק, ואל תהיו מאויימים מזה שיש בהתחלה הרבה אנשים שמבינים יותר ממכם, תתמקדו בלהיות טובים.\n\nהמבחן: באופן כללי זה באמת \"קורס קל למי שעובד קשה\". ברגע שמתרגלים מספיק מבחנים, הדברים מתחילים לחזור על עצמם. שימו לב שמתכונת המבחן השתנתה בסמסטר שלנו והפכה למתכונת מקוונת שבה אנחנו ממש כותבים קוד במחשב. זה קצת שונה ממה שהיה בשנים שלפני (שבהן כתבו עם דף ועט), ולכן כשאני למדתי למבחן אני כתבתי את התשובות עם דף ועט, כי שמתי לב שזה הולך לי ככה יותר מהר. תעשו מה שנוח לכם.\nהמבחן שלנו היה הוגן.\n\nהשורה התחתונה: \"קורס קל למי שעובד קשה\". \nחבר'ה בלי רקע, אלא אם כן אתם עילוי מטורף אתם תצטרכו לעבוד קשה כמוני. אבל אני באמת רוצה לעודד אתכם שאפשרי לחלוטין להוציא בקורס הזה ציון גבוה מאוד (אני הוצאתי 93), אם אתם רק משקיעים מספיק בזמן הסמסטר עצמו. יהיה בסדר ולא לדאוג.\nגם אם אתם לא מתחברים לתכנות בהתחלה - אני התחלתי להתחבר רק כשלימדו אותנו באקטראקינג (שזה הנושא האחרון). אז תחכו בסבלנות ומתישהו תמצאו בתכנות משהו מגניב.", "timestamp": 1615103505324}, {"author": "ruben fitoussi", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תומר\nחוות דעת - הרצאות: טוב\n\nשם המתרגל/ת: youtube\nחוות דעת - תרגולים: טוב מאוד\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615193970796}, {"author": "סטודנט שעבר את זה", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: איהב וותד\nחוות דעת - הרצאות: איהאב מסביר מצויין, גם לאלו שבאים עם רקע וגם לאלו שלא. מאוד יסודי ועובר על כל הדגשים שצריך לדעת. ממליץ מאוד.\n\nשם המתרגל/ת: עמית ברכה\nחוות דעת - תרגולים: אני מאוד נהניתי עם עמית. למדתי בעיקר ממנו מאשר בהרצאות (התרגולים וההרצאות חופפים ברה מתסכלת, כל נושא תשמעו פעמיים). הוא נותן דוגמאות ושואל אותנו שאלות במהלך השיעור, ונותן לאנשים לשאול עד שיבינו. הוא מפתח את החשיבה בצורה שהוא לא נותן מיד את התשובה, אלא שואל שאלה נגדית ואתה חושב ומבין בעצמך מה שלא היה לך ברור לפני. בסוף כמובן הוא יענה אם לא הבנת. \n\nשעורי הבית: אחת לשבועיים בערך. בתור אחד שבא עם רקע לא מעמיס בכלל, יושב בשבת ועושה. מה שכן, לאנשים ללא רקע, זה כן יכול להיות עמוס מאוד. חשוב שתשבו מול המצגות של התרגולים כשאתם תעשו את שיעורי הבית, הרב דברים לקוחים משם.\n\nהמבחן: המבחן היה הוגן, חוץ משאלת הבאקטראקינג (שאלה 4). הם תמיד נותנים שאלה יחסית קשה, עם פתרון של 4 עמודים ומאוד מסורבלת מבחינת הבנה. המלצה שלי, תנסו להוציא 75\\75 מ3 השאלות הראשונות ואז תנסו לפתור את שאלה 4. \n\nהשורה התחתונה: אחלה קורס, תלוי בבחירת מרצה ומתרגל.", "timestamp": 1615448981790}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: מרצה מעולה , מסביר טוב ודואג\n\nשם המתרגל/ת: הראל ווקנין\nחוות דעת - תרגולים: המרצה הכי טוב בקורס לדעתי \nמצוייך מסביר כמו שצריך\n\nשעורי הבית: שיעורי הבית לוקחים קצת זמן ! צריך לעשות. הם לא מוסיפים ממש לציון סופי אבל אם לא עושים אז אוכלים אותה\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1615627860976}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אהאב וותד\nחוות דעת - הרצאות: מרצה נחמד, אך הוא לא עונה על שאלות בצורה ברורה והרמה שבו הוא מעביר את החומר נמוכה.\n\nשם המתרגל/ת: הראל ווקנין\nחוות דעת - תרגולים: מתרגל מצויין! הוא סבלני, עונה על שאלות, מסביר בצורה מובנת ומוודא שכולם מבינים אותו. \n\nשעורי הבית: \nברמה הרבה מעל הרמה שנלמדת בהרצאות. ממליצה להיעזר בשעות הקבלה של המתרגלים או בסטודנטים אחרים.\nהמבחן: \nבהתחלה הלמידה למבחן לא פשוט, אבל דברים נהיים יותר מובנים עם הזמן. בסך הכל המבחן פתיר.\nהשורה התחתונה: \nקורס שבכלל לא מובן בהתחלה, אבל אם בוחרים מתרגל טוב, כמו הראל, לגמרי אפשר לעבור את הקורס. גם אם בהתחלה קשה, דברים יהיו יותר מובנים בהמשך הסמסטר.", "timestamp": 1616665052540}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המתרגל/ת: קתרין חדד\nחוות דעת - תרגולים: סה\"כ אחלה, מלמדים מה שצריך. אני אישית לא הגעתי עם רקע קודם בתכנות והיה שם את הבסיס הטכני שצריך כדי לפתור את השיעורי בית בגדול.\nלגבי ההרצאות - לא הלכתי, את ההרצאות האחרונות של הסמסטר השלמתי מהקלטות כי זה כן חומר קשה יותר שמומלץ להתאפס עליו.\n\nשעורי הבית: מזעזעים, שורפים מלא מלא זמן ואם אתה לא מבין בתכנות אז גם מתסכלים מאד. מה שכן, תכלס הם מכינים אותך ואתה יוצא מהם יותר עם ידע ולקחים איך לעבוד.\n\nהשורה התחתונה: קורס קשה יחסית למי שלא מגיע עם רקע, אבל בסיסי וחשוב להמשך. השיעורי בית לוקחים המון זמן אבל חשוב לשבת עליהם כדי שהחומר ייכנס למוח.", "timestamp": 1643904003902}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: תומר שלומי\nחוות דעת - הרצאות: תומר אחלה של מרצה לדעתי. קצת מונוטוני בצורה שבה הוא מעביר את החומר אבל הוא יודע להסביר אותו בצורה מדויקת ובהירה. יצא מצב שבכל הרצאה אצלו היו גג 15 איש באולם (אין לי מושג למה, כנראה בגלל השעות) אז היה אפשר לשאול אותו כל הזמן שאלות והוא היה עונה. ממליץ בחום.\n\nשם המתרגל/ת: נג'יב ביוטיוב.\nחוות דעת - תרגולים: לא חושב שצריך תרגול אחר, במיוחד אם אתם באים עם רקע בשפה שהיא לא C ועושים את המעבר לC. אחלה תרגולים באיכות טובה ומכסים את כל הקורס.\n\nשעורי הבית: יש חמישה תרגילי בית להגשה ביחידים (שישה אם מחשיבים את תרגיל בית 0 שהוא סתם הכנה לשאר). בכל התרגילים יש בין 1-3 משימות שצריך לכתוב בהן קוד, בהתאם מן הסתם לנושא של המשימה. בהתחלה זה מכניס קצת לשוק, במיוחד בשביל מי שלא נגע בקוד קודם, ובתרגיל בית 3 שהוא הכי ארוך ושם דגש על תכנון קוד יעיל בקנה מידה גדול כנראה תרגישו שבא לכם לשבור את המחשב, אבל זה בסוף בסדר. תרגילים 4 ו5 די קלילים כי כבר יותר מנוסים בתכנות וזה זורם יותר. ממליץ מאוד לא לדחות את המטלות עד מאוחר ולהתחיל אותן הכי מהר שאפשר, כדי לפנות זמן אחר כך לשאר הקורסים. מניסיון מר וכואב - אל תדחו אותן לרגע האחרון או שתתחרטו על זה ממש.\n\nהשורה התחתונה: מרגיש שהצוות של הקורס די זורק בכל מה שקשור אליו. הבדיקה של המטלות בית מרגישה ממש לא רציונלית, והיו כמה פאקים פה ושם במהלך הסמסטר שדי דפקו סטודנטים בכל מה שקשור להגשות. סה\"כ אתם חייבים לקחת את הקורס אז תוציאו ממנו את המיטב. אם אתם קוראים את זה לפני שאתם מתחילים את הלימודים, תתחילו ללמוד C מאיזה פלייליסט ביוטיוב כדי שתהיה לכם נחיתה רכה - זה עוזר.", "timestamp": 1644092836910}, {"author": "Bar David", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nאחלה מרצה, יש הקלטות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nנ'גיב ביוטיוב.. חבל לבזבז זמן ולהגיע לכיתה\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644307310901}, {"author": "ל\"א", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איהאב/ שלומי תומר/ יעל ארז\nחוות דעת - הרצאות: ההרצאות דיי משמימות, הקורס לא כל כך מעניין, רק לקראת הסוף מגיעים לחומר מעניין ושאשכרה הולך להופיע במבחן, ולא נכנסים אליו יותר מידי לעומק ובעיני זה פיספוס כי מבחנים כמה רמות מעל מה שמלמדים ומעל לשיעורי הבית שנותנים.\n\nשם המתרגל/ת: הראל וקנין\nחוות דעת - תרגולים: בעיני אל תלכו אליו, הייתי אצלנו כל הסמסטר, בהתחלה הוא היה סבבה ואז הוא קצת התחיל לזרוק, ביטל תרגולים ברגע האחרון וקבע ברגע האחרון, את התרגול האחרון שלו הוא כלל לא עשה, פשוט ביטל ושבוע לאחר סוף הסמסטר הודיע שהוא לא ישלים אותו. בכללי הפקולטה הזו לא שמה עליך כסטודנט יותר מידי אבל זה היה מוגזם לי\n\nשעורי הבית: שיעורי הבית גוזלים המון זמן, במיוחד שיעורי בית 3 שהם מתייעצים עם השטן איך לרשום אותם ככה שיהיו הכי נוראיים שאפשר. הם עושים בדיקות סטייל ונותנים 50% ציון זה קוד תקין ו50% זה הסטייל כתיבה שלך שבעיני זה אבסורד. הם נותנים לתקן רק אם הקוד לא עבד לא את הסטייל ואת בדיקות הסטייל מפרסמים רק בסוף אחרי אפשרות ההגשה החוזרת, זה נבדק אוטומטית אז אין באמת סיבה, זה סתם מגעיל לעשות כך בעיני\n\nהמבחן: כדי להצליח במבחן צריך לפתור מלא מבחנים שלהם וללמוד מלא טריקים שהם אוהבים, אבל גם אז יכול להיות שתגיע למבחן שרוצה שתעלה על טריק ספציפי שהם חשבו עליו ואתה תיתקע שנים, המבחן כמה וכמה רמות מעל שיעורי הבית ברמה, ואתה צריך לכתוב 3 קודים שונים ולפתור שאלת סיבוכיות ב3 שעות, זה לא זמן מספיק בכלל. המבחן בעיקרון צריך להתפלל לאיזה אלוהים שאתם מאמינים בו שתיפלו על מבחן הוגן וסבבה מבחינת טריקים אחרת אכלם אותה\n\nהשורה התחתונה: אם אתם לא חייבים לקחת את הקורס אל תיקחו אותו, קורס ממש לא וואו הסגל לא שם עליך בכלל, עושים מה שבראש שלהם והקורס עמוס בטירוף, לא ממליצה בכלל", "timestamp": 1645459904162}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעל / יוסף\nחוות דעת - הרצאות: יוסף לא מובן, מתייחס בזלזול לשאלות ומשרה אווירה לא נעימה בכיתה. הפסקתי לבוא להרצאות שלו.\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: מושלם.\n\nשעורי הבית: לא קשורים למבחן\n\nהמבחן: קשה פצצות\n\nהשורה התחתונה: לא לבוא להרצאות. לראות רק את התרגולים של נגיב ביוטיוב, ואת ההקלטות של יעל מ2020.", "timestamp": 1645522785523}, {"author": "_", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: תומר שלומי\nחוות דעת - הרצאות: מרצה די סבבה, קצת מונוטוני אבל זה פחות אשמתו ויותר החומר שעד סוף הקורס לא כזה מעניין. בקושי באו להרצאות שלו במהלך הסמסטר אז היה די ריק והוא ענה על הרבה שאלות שזה אחלה.\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: אני ראיתי רק את התרגולים של נג'יב ודי הסתדרתי, לא חושב שצריך יותר מזה אבל כן אם אתם מוצאים מתרגל פרונטלי שאתם אוהבים אולי זה גם אחלה אופציה.\n\nשעורי הבית: יש שישה תרגילים. רובם המוחלט ממש סבבה (חוץ מתרגיל 3, הוא חרא).\nממליץ ממש להתחיל אותם בהקדם האפשרי כי אם דוחים זה ממש מעמיס על המשך הסמסטר.\n\nהמבחן: היה מבחן סביר. כן היה קשה אבל זה לא שהתעללו בנו או משהו. מלא טריקים שצריך לעלות עליהם בזמן מבחן ולא לכולם זה בא כל כך בקלות. אם פותרים מספיק מבחני עבר לאט לאט מבינים את העקרון ואפשר להסתדר.\n\nהשורה התחתונה: קורס די משמים, הסגל שלו לא משהו ברמת ההתנהלות וההגשות של הש\"ב. מי שבא עם רקע יש לו יתרון חד משמעית ומי שלא מרגיש רוב הזמן שהוא נשרך מאחור. ממליץ ממש ללמוד C לפני שאתם מתחילים את הלימודים כי זה רק יעזור לכם.", "timestamp": 1645726528004}, {"author": "תנע זוויתי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה טובה, עונה על כל השאלות בחיוך ומסבירה עד הסוף. למי שאין רקע בתכנות - מומלץ מאוד!\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: בתרגולים עוברים על החומר שנלמד בהרצאות ובנושאים מסוימים גם מעמיקים יותר. בחצי הראשון של הסמסטר עברתי בכל שבוע למתרגל אחר, השתעממתי והרגשתי שזה בזבוז זמן. במיוחד בשלב שחלק מהמתרגלים עברו לזום כמה שבועות רצוף בגלל גשם (מה?), העבירו שיעורים בזום בלי לצלם את עצמם (פשוט רואים עט אדום מצייר על המסך וקול עולה לו מאי שם...) אז בכלל.\nהכל השתנה כשעברתי לרואי. מתרגל סופר מקצועי, מצד אחד עונה לכל שאלה ומצד שני מעביר את החומר בצורה ממוקדת ועניינית. בתרגולים שלו יש אווירה נעימה והוא תמיד מסביר עד לפרטים הכי קטנים. עם מתרגל טוב אפשר להתרם מהתרגולים ולחדד הבנה, במיוחד למי שבא בלי רקע בתכנות.\n\nשעורי הבית: יש 5 עבודות בית. ש\"ב 1 יחסית קצרים, ש\"ב 2 לוקחים יותר זמן, וש\"ב 4 ו-5 יחסית קצרים. ש\"ב 3 ארוכים מאוד וכדאי להתכונן לכך בהתאם - מדובר על קוד בסדר גודל של כמה מאות שורות קוד (600+ ללא תיעוד :)) ולא מלמדים בקורס איך להתמודד עם קוד בסדר גודל כזה. עצה ממני - תתחילו ביום שמפרסמים ותקדישו לזה שעה ביום. ככה לא תעמיסו על עצמכם מדי כשהסמסטר תופס תאוצה, ותגיעו לשבוע שלפני ההגשה עם קוד בשלבי סיום. בגדול - יש שבועות שהקורס לא מורגש, באמצע הסמסטר עם ש\"ב 3 מעמיס מאוד.\n\nהמבחן: אין קשר בין המבחן לבין הקורס מלבד ששניהם בשפת C :) ועכשיו בנימה רצינית - המבחן לא פשוט. אם יש קורס שצריך לתרגל בו הרבה מבחנים, זה הקורס. אמנם קוראים לקורס \"מבוא למדמ\"ח\" אבל המבחן בסוף הוא על כתיבת אלגוריתמים שמתבססים על האלגורימים שנלמדים בקורס. לרוב הטריקים חוזרים על עצמם, אבל יש מועדים בהם מופיעות שאלות מאוד מורכבות לפתרון ב-3 שעות. \nשאלת הסיבוכיות לרוב הוגנת. השאר - תלוי מועד. לרוב הרכב המבחן הוא 3 שאלות יחסית פתירות ואחת מוזרה.\n\nהשורה התחתונה: יהיה בסדר! תשקיעו במהלך הסמסטר, תעבדו קשה ותתרגלו טוב לקראת המבחן ואתם תסתדרו. המבחן לא מאוד הוגן ביחס למה שנלמד בקורס, אבל עם הרבה תרגול אפשר להסתדר.", "timestamp": 1645730546893}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יוסי/תומר\nחוות דעת - הרצאות: הייתי אצל יוסי קצת בתחילת הסמסטר ואז עברתי לתומר בעיקר משיקולי מערכת. יוסי נראה כמו אחלה מרצה לפחות בהתחלה ובחור די חביב אבל לא הייתי אצלו יותר מדי בשביל לשפוט. תומר מרצה די טוב לדעתי, עונה על שאלות ומעביר את החומר בצורה טובה ובהירה.\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: לא חושב שצריך יותר. עברתי ליוטיוב שוב בעיקר משיקולי מערכת ולא הרגשתי חוסרים כלשהם במהלך הקורס.\n\nשעורי הבית: נראה לי שיש מספיק חוות דעת עליהם ואני לא רוצה לחזור על דברים של אחרים, אז רק אגיד שתרגיל 3 די מסריח וכל השאר סטנדרטי וסבבה. אם אתם באים עם רקע יהיה לכם ממש קל ואם לא אז בהצלחה.\n\nהמבחן: קשר אפסי לכל מה שעושים בקורס, השאלות במבחן בכלל לא בסגנון של מה שמתעסקים בו בש\"ב ובתרגולים. עם זאת המבנה של המבחן די קבוע. ברוב המוחלט יש שאלת סיבוכיות עם 3 סעיפים, שאלה על מערכים שהיא או מיונים, או חיפושים מסוג כלשהו עם סיבוכיות משתנה, שאלה של מחרוזות ועיבוד טקסט ושאלת באקטראקינג. רוב הטריקים לפתרון השאלות די חוזרים על עצמם ועם פותרים מספיק מבחנים אפשר להסתדר. הייתי אומר שהבאקטראקינג הוא הנושא הכי כבד במבחן כי לומדים אותו ממש בשבוע האחרון של הקורס ובכללי זה קונספט קצת קשה לעיכול שיכול ממש להרתיע, הדרך הכי טובה להתמודד עם זה זה פשוט לעשות את זה עד שמבינים מה הלוז. \n\nהשורה התחתונה: זה קורס חובה אז אתם בכל מקרה תיקחו אותו אבל בסה\"כ אם משקיעים ולא מחפפים בו אפשר להסתדר. ממליץ בחום לא לדחות את ההגשות של השיעורי בית אחרת זה יתנקם בכם, תעשו אותם הכי מהר שאפשר.", "timestamp": 1647363910556}, {"author": "DS", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יוסי ותומר\nחוות דעת - הרצאות: \nיוסי מרצה בסדר, אבל דיי משעמם. עברתי בתחילת הסמסטר לתומרץ תומר מעביר את החומר בצורה ממש טובה, הוא מבין את החומר טוב מאוד ומנסה לגרום לכולם להבין אותו בצורה הטובה ביותר. \n\nשעורי הבית: \n5 תרגילים במהלך הסמסטר. התרגיל הראשון והשני הם בסדר, לא משהו מיוחד. \nהתרגיל השלישי ברמה של פרויקט קטן, בסדר גודל של 500-600 שורות קוד. ממליץ לעשות ברגע שמקבלים אותו, ולא לדחות אותו ליותר מאוחר. \nתרגיל 4 גם בסדר, ותרגיל 5 יחסית קשה.\n\nהמבחן: \nלא קשר בשום דרך או צורה למה שבאמת נלמד בקורס. המבחן קשה, וצריך לשבת על הרבה מאוד מבחנים עד שבאמת מבינים מה רוצים ממנו. המבחנים דיי חוזרים על עצמם מבחינת שלד הקוד, אבל ההבנה של מה שרוצים ממך מאוד קשה.\n\nהשורה התחתונה: \nמבאס שהמבחן כזה קשה לקורס שהוא רק מבוא. הקורס עצמו בסדר רק המבחן באמת ממש קשה.", "timestamp": 1648623077500}, {"author": "P=NP", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה מצוינת, מסבירה את החומר בגובה העיניים\n\nשם המתרגל/ת: לא רלוונטי, סיים את תקופתו בטכניון לצערי\nחוות דעת - תרגולים: לא רלונטי\n\nשעורי הבית: לא הוגנים,\n\nהמבחן: לא הוגן\n\nהשורה התחתונה: תשקיעו בקורס באופן לא פרופורציונאלי לנק\"ז שהוא מקנה, אם אין לכם רקע בתכנות קחו מורה פרטי.", "timestamp": 1648719573547}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: תומר שלומי\nחוות דעת - הרצאות: תומר אחלה מרצה, אני ממליץ בחום. מעביר את החומר ממש בבהירות ובכללי הוא ממש נחמד. יצא טוב שגם היו אצלו כלום אנשים בהרצאות (כנראה כי השעות שלו היו ישר אחרי צה\"ד ולא כאלה נוחות), בכל מקרה מי שהגיע הרוויח לדעתי.\n\nשם המתרגל/ת: נג'יב ביוטיוב ודמיטרי\nחוות דעת - תרגולים: דמיטרי סבבה סה\"כ. הסמסטר הוא תרגל רק מהזום וניצל את זה בשביל להדגים את הנושאים בתרגול על קוד שהוא כותב בלייב במקום דרך המצגות. לא כזה התחברתי בעיקר כי יצא שהתרגולים היו די איטיים אבל היו כאלה שממש אהבו. \nההקלטות של נג'יב מעולות. כל נושא שלא יושב לכם טוב - תצפו בהן וזה אחלה סיפתח כדי להבין אותו. \n\nשעורי הבית: 5 תרגילי תכנות שניתנים לאורך הסמסטר, בהתאם למה שלומדים. 1 ו-2 קלילים כי זה עדיין די הבייסיק. תרגיל 3 ארוך מאוד, בא לבדוק תכנון יעיל של קוד במסות רחבות ובהתאם יש המון מקומות לפקשש בו. תרגילים 4 ו-5 היו יותר סטנדרטיים כש-5 היה טיפה מאתגר מהשאר כי זה לקראת סוף הקורס והנושאים הם היותר קשים.\nהקוד שמגישים נבדק אוטומטית על השרתים של הקורס ומקומפל על קומפיילר של קודבלוקס, אז גם אם אתם לא סובלים את התוכנה (ובצדק, יש מספיק סיבות) תעבדו על הIDE שאתם אוהבים אבל תריצו במקביל את הקוד דרך הקודבלוקס כדי לחסוך לכם ים זמן של תיקונים של שגיאות שלא ברא השטן.\n\nהמבחן: המבחן לא קשור בשום צורה למה שנעשה בקורס. הוא בנוי ככה שיש שאלה של ניתוח סיבוכיות עם שלושה סעיפים, ושלוש שאלות שכותבים בהן קוד (על נייר, כמו בבגרות במחשבים). הקשר בין השאלות ודרכי הפתרון למה שרואים בתרגילים ובתרגילי בית לא קיים, והיתרון היחיד שיש הוא שהטריקים כדי לפתור אותן חוזרים על עצמן בכל מבחני העבר. במועד א' לא היה הרבה זמן ללמוד וחצי מהזמן הלך לי בכלל על להסתגל למבנה הבחינה אז קיבלתי ציון די מבאס, במועד ב' אחרי שלמדתי שבוע וחצי ופתרתי כמעט את כל מבחני העבר שהיו, הבאתי שיפור של מעל 20 נקודות וסיימתי עם ציון ממש סבבה. כל מה שצריך לעשות כדי להצליח זה פשוט לפתור מבחני עבר, וכמה שיותר. בסוף כל הטריקים לפתרון יישבו אצלכם בראש וכשתקבלו שאלה אתם תדעו ישר איך לגשת אליה.\n\nהשורה התחתונה: הקורס סה\"כ משיג את המטרה שלו. אתם תצאו ממנו כשאתם יודעים לתכנת בC ויש לכם היכרות בסיסית עם אלגוריתמים שונים, אז אין יותר מדי תלונות על זה. סה\"כ זה באמת משהו שפשוט עושים כי צריך וזה 4 נקז שיכולות להציל את הממוצע של סמסטר א' (לי הציון במדמח ממש עזר לכפות על קורסים יותר קשים שהלך לי בהם פחות טוב בסמסטר א').\nאל תתפשרו על ציון נמוך במבחן כי כדי לשפר באמת שצריך פשוט לחרוש מבחנים.", "timestamp": 1648844666312}, {"author": "....", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יעל ארז - מוקלט\nחוות דעת - הרצאות: \nלא הייתי בהרצאה אחת הסמסטר, לדעתי בזבוז זמן. אפשר בכיף לראות את ההרצאות על x2\n\nשם המתרגל/ת:  נג'יב מוקלט\nחוות דעת - תרגולים: \nאחלה תרגולים, שוב, לא רואה צורך להגיע במהלך הסמסטר יותר מדי\nאני הייתי בתרגול האחרון שפותרים בו שאלות ממבחנים וזהו.\n\nשעורי הבית: \nדיי מציקים, אבל קוד לומדים דרך הידיים אין מה לעשות. מה שמעצבן זו ההתנהלות של צוות הקורס, כי לא מעט פעמים היו טעויות בשאלות או דברים לא ברורים, וגם לוקח להם חודש וחצי להחזיר תשובות\n\nהמבחן: \nהקורס היה קל (יחסית לאחרים בסמסטר) אבל המבחן לדעתי מהקשים. הממוצע אצלנו לפני פקטור היה 57. לא לזלזל בקורס וכדאי להתחיל מבחנים כמה שיותר מוקדם. בכל השאלות יכולים להיות מוקשים.\nבכל מקרה אני חושב שדואגים לפקטר מבחנים קשים.\n\nהשורה התחתונה: \nהקורס כנראה משיג את המטרה שלו שזה ללמד אותנו לכתוב בc אבל הרגשתי זלזול רב מצוות הקורס בכל הנוגע להתנהלות בסמסטר בשיעורי הבית והמבחן. המבחן עצמו לא ממש דומה למה שלומדים וצריך לעבוד קשה כדי להצליח. בהצלחה :)", "timestamp": 1659795251631}, {"author": ":)", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אין לי מושג\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: כנל\nחוות דעת - תרגולים: \n\nשעורי הבית: קצת מעצבנים אבל למי שיש רקע לא יותר מידי\n\nהמבחן: שונה ככ מהקורס עצמו. פשוט לתרגל מבחנים מהעבר ותופסים את הקטע.\n\nהשורה התחתונה: אם יש רקע בתכנות לפני קורס בקטנה. אם לא קורס די עמוס אז להיות על זה.", "timestamp": 1660568272610}, {"author": "גיא דוידוביץ'", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסף ויינשטיין\nחוות דעת - הרצאות: בסדר\n\nשם המתרגל/ת: אוראל אדיבי\nחוות דעת - תרגולים: מתרגל טוב. תרגולים בעיקר חוזרים על מה שהיה בהרצאה\n\nשעורי הבית: קפיצה אדירה ברמה מתרגיל 2 לתרגיל 3. בדיקה אוטומטית מתסכלת ולא ידידותית של שיעורי הבית.\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס חובה. מי שעשה מדעי המחשב בתיכון ישתעמם", "timestamp": 1660727949428}, {"author": "Gil Caplan", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא הלכתי, לדעתי מיותר \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא הלכתי, לדעתי מיותר \nשעורי הבית: \nזה תרגול טוב, שווה לשבור את הראש על זה. \nהמבחן: \nסבבה לגמרי, מומלץ לשים דגש על תרגול של סיבכיות וbacktracking שהם נושאים שטיפה יוצר קשים ללמוד.\nהשורה התחתונה: קורס יחסית קל, אם יש לך רקע בתוכנה אז ממליץ ללמוד לבד", "timestamp": 1675340550162}, {"author": "s", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: מסביר טוב אבל אין לו הרבה כרזימה\n\nשם המתרגל/ת: אמיר אלקלעי\nחוות דעת - תרגולים: אמיר מתרגל מעולה עבור אנשים ללא רקע בתכנות, ובכללי.\nהייתי גם אצל עדי גרוס שהוא מתרגל טוב- בעיני לא מתאים עבור אנשים ללא רקע בתכנות.\n\nשעורי הבית: \nקשים, ותרגיל 3 הכי ארוך בהיסטוריה\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676043377412}, {"author": "liaaa", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: הייתי אצל יוסף בהתחלה ועברתי ליעל.. הבדל משמעותי. יעל מראה בלייב תכנות ושומרת על השיעור מאוד אינטרקטיבי עם התלמידים מה שהופך אותו להרבה יותר מעניין.\n\nשם המתרגל/ת: ירון\nחוות דעת - תרגולים: לא ממליצה.\n\nשעורי הבית: אם לא נגעתם בתכנות לפני השיעורי בית יהיו ממש קשים מאוד מהר. ממליצה בחום גם לעשות עצמאית כל מיני תרגילים שמוצאים באינטרנט או כאלה שמראים בתרגולים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676377839349}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: מרגיש קצת כאילו לא רוצה להיות שם לא מאוד כריזמטי אבל רואים שיש לו ידע נרחב\n\nשם המתרגל/ת: אמיר אלקלעי\nחוות דעת - תרגולים:  בכנות המתרגל הכי טוב שיכול להיות. מראה את דרך הפעולה של איך ניגשים לתרגיל, מבין בחומר ברמה מאוד מאוד גבוהה ויחד עם זאת ממש מלמד בגובה העיניים ומסביר מדהים.. באמת מומלץ מאוד\n\nשעורי הבית: תרגיל בית 3 לוקח המון זמן אבל חוץ מזה יחסית סבבה\n\nהמבחן:\n\nהשורה התחתונה:", "timestamp": 1676553118695}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: מתרגל ממש טוב. אין אצלו הרבה אנשים אז הוא ממש מקדיש לכל אחד יחס והוא  מעביר את החומר נהדר.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678105160467}, {"author": "Tom Nir", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לב יוחננוב\nחוות דעת - הרצאות: לדעתי אין מה להגיע להרצאות בשום שלב של הקורס, במיוחד אם קיים רקע תכנותי קודם. כן צריך ללמוד בקמפוס או ביוטיוב את החלקים היותר תיאורטיים במחצית השנייה של הסמסטר.\n\nשם המתרגל/ת: טל זהר\nחוות דעת - תרגולים: מתרגל טוב מאוד, מאוד זמין ואכפתי לשאלות בשעות הקבלה, ומעביר את תרגילים הרלוונטים בצורה טובה. לדעתי כדאי להגיע לתרגולים לפחות מהמחצית השנייה של הסמטר אם לא מוקדם יותר.\n\nשעורי הבית: היו לי מאוד קשים, הקורס שבו השקעתי הכי הרבה זמן למטלות וגרם לתסכול רב וקושי.\nשווה לחכות איזה יום-יומיים אחרי פרסום מטלת הבית כדי שיתקנו בעיות ניסוח בשאלות (יש תמיד ולא מעט).\n\nהמבחן: עוד לא עשיתי...\n\nהשורה התחתונה: הקורס הכי פחות אהוב עליי, תכנות לא מעניין אותי במיוחד אך למי שיש זיקה לזה וטוב בזה הוא יכול להיות מעניין ויחסית קל", "timestamp": 1679089543577}, {"author": "o.k", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יוסף\nחוות דעת - הרצאות: אל תהיו אצל יוסף,אנא מכם.\n\nשם המתרגל/ת: אמיר\nחוות דעת - תרגולים: מתרגל טוב מאוד , ממליץ\n\nשעורי הבית: תתכוננו בקפיצה ברמה בתרגיל בית 3\nהמבחן: בסדר\n\nהשורה התחתונה: קורס עם סגל שמתנהל בצורה זוועתית, ממליץ מאד ללמוד מcampus il  , המרצים לא מסבירים בצורה כריזמטית , מעניינת וברורה.", "timestamp": 1679329578872}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: וויינשטיין יוסף\nחוות דעת - הרצאות: מסביר טוב, עוצר לשאלות, מומלץ בחום.\n\nבדיעבד בגלל שיש לי ניסיון, ההרצאות והתרגולים מיותרים לגמרי. הידע שצריך למבחן זה לפתור חידות leetcode (או לחילופין לתרגל הרבה מבחני עבר), ואיך לפתור אותן ב-c. חוץ מהרצאות הסיבוכיות! מסבירים בהן שיטות שימושיות לפתור את שאלת הסיבוכיות במבחן, ממליץ להגיע.\n\nשעורי הבית: לא קשים למי שיש ניסיון. מומלץ לא לדחות לרגע האחרון.\n\nהמבחן: היה על המחשב בסמסטר הזה. מרגיש שלקחו את השאלות ישירות מleetcode, אם אתם טובים בשאלות המסוג הזה המבחן לא קשה, אם לא אז צריך לתרגל הרבה מבחנים גם אם יש ניסיון קודם.\n\nהשורה התחתונה: הקורס מלמד טוב את הבסיס לתכנות. למי שיש ניסיון זה רק עניין של להגיש את שיעורי הבית ולהגיע לבחן (שניהם תקפים), ומומלץ להגיע גם להרצאות הסיבוכיות. למי שאין ניסיון זה קורס לא קל, דיי מלמדים את החומר של שנה/שנה וחצי של מדמח בתיכון רק בחצי מהזמן. בכל מקרה העיקר לתרגל כמה שיותר מבחני עבר לקראת המבחן.", "timestamp": 1679342182749}, {"author": "זה רק אני או שהוא נרדם על הבמה?", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ויינשטיין יוסי\nחוות דעת - הרצאות: יבשות כמו המרצה אבל ממליץ בחום לא לזלזל בחומר ולחשוב שאתם באתם עם נסיון וזה מספיק כי אז זה יתהפך עליכם מאוד מהר. אבל לא אשקר שעדיף לא לבוא להרצאות ולראות מוקלטות כי כל המרצים פשוט חסרי כריזמה ומרדימים אחד אחד\n\nשם המתרגל/ת: ירון \"מת\" חי\nחוות דעת - תרגולים: הוא את החומר יודע אם אתם מבינים למה אני מתכוון (בן אדם חכם אבל עם וייבים של מורה ביסודי שמשתיק את כולם ולא מייצר אווירה לימודית כמו שצריך)\n\nשעורי הבית: פשוט איכס. תשלבו את השפץ תכנות הכי מגעילה שיש (או לפחות שנתקלתי בה) עם המשימות הכי מטומטמות שלא באמת באות ללמד אלא לעצבן ולרצות לשבור את המחשב כשבפעם המאה משהו לא הולך ולבכות מאושר כשמסיימים את המטלה.\n\nהמבחן: ימח שמם של ההאקרים שבגללם היה לי יום חופש אחד בחופשת סמסטר הראשונה שלי. חוץ מזה די קשה אבל הוגן.\n\nהשורה התחתונה: אל תצפו להנות או להתלהב מהחומר כי המרצים והמתרגלים יכבו אותכם מאוד מהר אבל בסך הכל זה מקצוע שאפשר לעבור אותו אם נותנים לו את מידת ההשקעה שראויה לו.", "timestamp": 1679503463326}, {"author": "הרוכל היהודי", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יוסי \"שבלון\" ויינשטיין\nחוות דעת - הרצאות: יבשות ומשעממות. באמת מרגיש כאילו יוסי הוא אדם עם כריזמה שלילית. הוא מקריא מהמצגת כשהוא לא עסוק בלהתעצבן על המרצה האחראית (יעל ארז הזוועתית לא פחות ממנו), אבל הוא מסביר לא רע. יש התעקשות מוזרה בקורס על כל מיני ניואנסים קטנים ומעצבנים בדרך שבה כותבים C, שזה די מעיק. היה בסמסטר שלנו האקרים שפרצו לאתר של הטכניון והורידו את המודל (שבו אנחנו כתבנו את כל הקוד), מה ששיבש את הקורס שלנו ספיצפית אבל בתכלס, למרות שהוא כן מרצה מוזר ומשונה, בעיני שווה יותר מלראות מוקלט (אבל לא בהרבה).\n\nשם המתרגל/ת: ירון חי\nחוות דעת - תרגולים: מתרגל בסדר אבל לא מדהים. מתעסק יותר מדי בלנסות להשתיק את העשר תלמידים שאיתו בתרגול כמו גננת כזה, אבל הוא מסביר די טוב, חבל שהסגל של הקורס הזה דאג לכך שהתרגולים וההרצאות יהיו כמעט אותו דבר, אז גם אתם תרגישו שזה ממש מעצבן... \n\nשעורי הבית: 5 מטלות יחסית גדולות. ממליץ בחום לא לדחות אותן, למרות שלנו היו הרבה דחיות למטלות כי אנשים לא הספיקו, אבל לא כדאי לכם להגיע למצב הזה.\n\nהמבחן: די מגעיל, אבל פתיר - בסופו של דבר. חבל שההאקרים לא יכלו לטפל גם בזה..\n\nהשורה התחתונה: לא קורס נחמד, אבל אין ברירה", "timestamp": 1679503662706}, {"author": "11", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: לב יוחננוב\nחוות דעת - הרצאות: \nלא משהו, מרצה נחמד אבל מרגיש שההרצאות חוזרות על עצמם ולא תורמות יותר מדי תכלס לכתיבת קוד\nשם המתרגל/ת: נסים\nחוות דעת - תרגולים: \nמתרגל טוב, מאוד מנסה לעזור. הבעיה היא במצגות של התרגולים שכולם מעבירים מהם, מרגיש הרבה פעמים שחוזר על ההרצאות ולא באמת תורם\nשעורי הבית: \nקשים מאוד! בטח למי שאין רקע בתכנות. מרגיש לא קשורים בכלל להרצאות ולתרגולים (בניגוד לקורסים אחרים)\nהמבחן: \nקשה\nהשורה התחתונה: \nקורס גרוע, מרגיש שהקורס מאוד לא בנוי למי שאין רקע בתכנות. ההרצאות והתרגולים מיותרים מרגיש שבונים נטו על יכולת שלך ללמוד c לבד.", "timestamp": 1679516696322}, {"author": "עד מתי הפקולטה למדמח", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה:  איהאב\nחוות דעת - הרצאות: \nקצת מרדים אבל טוב. אם למדתם כבר עדיף להתחיל להגיע רק לקראת האמצע.\nשם המתרגל/ת: נג'יב מוקלט + אמיר מוקלט לקראת המבחן\nחוות דעת - תרגולים: \nשניהם מעולים, אם אפשר ללכת לאמיר שווה (בעיקר החל משבוע 4~).\nשעורי הבית: \nארוכים (במיוחד 3), לא קלים ביחס לרמה שרואים במהלך הקורס\nהמבחן: \nזוועה. לא קשור בשום צורה לרמה שרואים במהלך הקורס. מומלץ מאוד להתחיל לפתור מבחנים כמה שיותר מוקדם (במיוחד אם כבר למדתם C), הימים הראשונים מתסכלים מאוד אבל זה יכול להשתפר\nהשורה התחתונה: \nהקורס שמנוהל הכי גרוע מכל אלה שפגשתי/יצא לי לשמוע עליהם. אל תסמכו או תבנו על זה שיעזרו לכם להצליח אפילו קצת - התשובות למבחנים מזלזלות (חלק לא עובדות, כולן לא מוסברות), רוב המתרגלים מתוסכלים מהשכר ולכן לא משקיעים דקה מעבר להכרח ויעל לגמרי לא שולטת בכמות האנשים המטורפת כמתרגלת+מרצה אחראית.", "timestamp": 1679734545004}, {"author": "מיון בועות", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: קורס באינטרנט\nחוות דעת - הרצאות: \nהלכתי בהתחלה לאיהאב, אבל הקורס די קל למי שלמד מדמח בתיכון, פשוט חזרה ומה שלא בנוי לגמרי על התיכון. הקורס בקמפוס מסביר ממש טוב ולא צריך יותר מזה.\n\nשם המתרגל/ת: לא הלכתי.\nחוות דעת - תרגולים: \nהלכתי בהתחלה אבל גם נהיה מיותר.\n\nשעורי הבית: \nלא כאלה קשים, פשוט יכולים להיות עמוסים לפעמים. לא ברור למה לקח שבועיים לבדוק אותם כשאף אחד לא בדק ופשוט התכונה בדקה אוטומטית.\n\nהמבחן: התנהלות גרועה של הקורס, לא אמרו מתי הוא עד ממש לפני ורגע לפני המבחן החליטו לתת לנו להוריד תוכנה חדשה למחשב. הייתי בסבב ב שלא היה נורא.\n\nהשורה התחתונה: \nקורס קל מדי למי שלמד מדמח בעבר וקשה מדי למי שלא, לא ברור לי למה לא מפרידים ביניהם, ועם צוות שלא שם עלינו וזלזל בנו לאורך הקורס.", "timestamp": 1680163192521}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: משעמם ומרגיש כאילו הוא לא רוצה להיות שם.. לא ממליצה בכלל הפסקתי ללכת בשלב כלשהו\n\nשם המתרגל/ת: אמיר אלקלעי\nחוות דעת - תרגולים:  המתרגל הכי טוב בהיסטוריה!!!! באמת שהתרגולים שלו כל כך טובים הוא מסביר כל כך טוב, איך לגשת לתרגיל ותמיד מסביר בגובה העיניים ומוודא שכולם יבינו. באמת שהוא מדהים\n\nשעורי הבית: תרגיל בית 3 זה השטן חוץ מזה יחסית סביר\n\nהמבחן: חוסר תיאום בכל מה שקשור למערכת הטכניונית. בבחן אמצע נפל הvpl. \n\nהשורה התחתונה: \nבשביל קורס במדמח רמת הטכנופוביה שהייתה במהלך הסמסטר מחשידה", "timestamp": 1680468718274}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: טוב, אך הפסקתי להגיע להרצאות בשלב מסוים כי הרגשתו שהם יעילוצ והסתפקתי בתרגולים.\n\nשם המתרגל/ת: נסים יחיא\nחוות דעת - תרגולים: בהתחלת הסמסטר הלכתי לכמה מתרגלים שבעיניי היו גרועים עד שהגעתי לנסים. נסים מתרגל מצוין מסביר הכל בצורה ברורה ופשוטה, והוא מוכן לעזור לכולם בצרוה שלא מובנת מאילו. וגם מפנק את הסטודנטים שלו בעוגיות.😉\nממליץ בחום. \n\nשעורי הבית: סיבירים\n\nהמבחן: סביר, אך אני חושב ששני הסבבים לא היו על אותה רמת קושי, וגם לא היה פקטור. \n\nהשורה התחתונה: ההתנהלות של סגל הקורס הייתה זוועה, אבל קורס שניתן לעבור אותו בקלות למי שיש לו רקע בתכנות.", "timestamp": 1681289454492}, {"author": "Ori", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: נותנת דגשים על הדברים החשובים אבל קצת איטית\n\nשם המתרגל/ת: ללא\nחוות דעת - תרגולים: הלכתי פעמיים ובשתיהן עזבתי אחרי שעה. מיותר למי שיודע לתכנת מלפני.\n\nשעורי הבית: \n\nהמבחן: מבחן הוגן, backtracking מאוד תבניתי.\n\nהשורה התחתונה: קורס יחסית קליל למי שמתכנת, דורש מעט מאוד השקעה ביחס לשאר הקורסים.", "timestamp": 1681370066437}, {"author": "2711", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איהאב וותד \nחוות דעת - הרצאות: \nמעניינות, אהבתי ללכת כי איהאב מבין את החומר המון ורוצה שאנו נבין אותו גם, לפעמים הוא נראה שהוא לא רוצה להיות כאן אבל מאוד נהניתי איתו. מרצה חכם ויכול למשוך תשומת לב.\n\nשם המתרגל/ת: נסים יחיא/ נג'יב נבואני (the absolute best) מוקלט\nחוות דעת - תרגולים: קצת מיותרים (אבל לא זניחים, אם לא הולכים אליהם אנחנו הולכים לאיבוד במיוחד בסוף הסמסטר), נסים מתרגל מעולה, נראה שהוא אוהב לתת ומבין מה הוא עושה, אבל אישית התחברתי לנג'יב ועברתי לצפות רק למוקלט שלו בסוף, מתרגל אחלה שיודע איך להפוך את התרגול למעניין וכיפי.\n\nשעורי הבית: צריכים השקעה וחשיבה מחוץ לקופסה אבל פתירים, שיעורי הבית 1-2 קלים, 3 ארוכה, 4 צריכה השקעה של חשיבה וללכת לשעות קבלה להבין את הרעיון, 5 באקטרקינג שצריך לשבת ולשבור את הראש איתה בכדי להבין איך פותרים.\n\nהמבחן: מזעזע, חשבתי שאצליח בקלות בקורס ולא אצטרך להתאמץ יותר מדיי, שקרו עלינו, שאלת הבאקטרקינג מזעזעת, מלמדים את החומר בשתי ההרצאות אחרונות ולא אומרים עליה משהו במהלך הסמסטר. \nבסוף הצלחתי אבל הייתי צריכה להשקיע המון זמן.\nהמבחן מלא  מלא טריקים שאם לא שמים לב אליהם הולכים לאיבוד!\n\nהשורה התחתונה: קורס מאוד יפה במהלך הסמסטר, במבחן לא כל כך.", "timestamp": 1689103325969}, {"author": "~", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: איהאב וותד\n\nחוות דעת - הרצאות: \nהיה לי רקע בתכנות לפני כן, ולכן עד אמצע הסמסטר לא הייתי ברוב ההרצאות כי לדעתי לא היה צריך, בכל מקרה איהאב מרצה טוב אבל ההרצאות היו לפעמים משעממות, אבל בסה״כ היה סבבה.\n\nשם המתרגל/ת: נג׳יב נבוואני (מוקלט)\n\nחוות דעת - תרגולים: \nהלכתי לתרגול הראשון בסמסטר וממש התאכזבתי מהמתרגל ומאז לא נכנסתי לשום תרגול. כולם המליצו על נג׳יב ביוטיוב אז עברתי לצפות בהקלטות שלו לקראת המבחן והוא ממש נהדר ומעביר את החומר בצורה איכותית. \n\nשעורי הבית: \nהיו לנו 4 שיעורי בית, השניים הראשונים ממש קלים, השלישי לדעתי היה הקשה ביותר - בעיקר כי הוא לוקח הרבה זמן יחסית אבל הוא עדיין לא ברמה קשה במיוחד, האחרון לפי דעתי היה קליל.\n\nהמבחן: \nלדעתי היה הוגן, לא הכי קשה אבל לא קל, בעיקרון צריך לתרגל הרבה שאלות ממבחנים כדי להבין את הקונספט מאחורי שאלות מסוימות ואז זה חוזר על עצמו רק בדרכים אחרות. בנוגע לשאלות של סיבוכיות אין במודל הסברים על איך פותרים אותן, אבל יש קובץ בדרייב שיש בו פתרונות מלאים ומפורטים באופן נהדר ככה שמבינים את הרעיונות.\n \nהשורה התחתונה: \nלמי שיש לו עבר בתכנות זה כנראה אחד מהקורסים הכי פחות עמוסים בסמסטר א׳, אבל  למישהו שלא כתב קוד לפני כן הקורס קצת יותר עמוס אבל עם תרגול במהלך הסמסטר אני חושב שאפשר להצליח ולקבל ציון טוב.", "timestamp": 1715379018876}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יוסי ויינשטן\nחוות דעת - הרצאות: \nלא אדם רע, פשוט מרצה קצת משעמם וניכר  שהוא מעדיף ללמד קורס אחר.  הייתי בהרצאת חזרה של איהאב לפני המבחן, הוא טוב משמעותית\n\nשם המתרגל/ת: גיל אלגריסי\nחוות דעת - תרגולים: \nסביר, אחלה בן אדם, אבל התרגולים זה נטו מצגת, לא הרגשתי שאפשר להבין מהם משהו בכלל\n\nשעורי הבית: \nנוראיים. ארוכים וקשים, אין להם קשר למבחן, ההנחיות לא ברורות, והם בקלות יכולים לשרוף לכם יותר זמן מאינפי ואלגברה ביחד. זה נטו משרפת זמן אחת גדולה, וניכר שיעל (המרצה האחראית של מדמח מ וח) מאוד רוצה לעשות שרירים עלינו בלי סיבה ניכרת. גם לקח להם מלא זמן להחזיר תשובות למרות שהבדיקה אוטומטית לחלוטין. זה היה סיוט עצום. ואני אומר את זה בתור מישהו עם ידע בתכנות\n\nהמבחן: \nבדרך כלל מגעיל להחריד תודות ליעל, אבל השנה היה סביר בגלל המלחמה וזה שירד backtracking. בכל מקרה בהכנה למבחן כמעט רציתי לעבור תואר בגלל הקורס הזה . היתרון היחיד זה שזה על מחשב אז אפשר לדבג\n\nהשורה התחתונה: סגל רחוק מסמפטי , יעל היא ההוכחה שלא צריך לתת למישהי ללא דוקטורט לנהל קורס, אבל אפשר לשרוד את זה ואפילו לצאת עם ציון סבבה", "timestamp": 1715419671235}, {"author": "ליני", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: מרצה לא ברור. המצגות לא השתנו כבר מיליון שנה הן ברור בצורה לא ברורה בכלל ולא קריאה.\n\nשם המתרגל/ת: שלי גולן\nחוות דעת - תרגולים: מקסימה! נותנת טיפים והעשרה מהניסיון האישי שלה. \n\nשעורי הבית: בתור מישהי ללא ניסיון היה לי מאוד קשה\n\nהמבחן: קשה מאוד, יצאתי עם מגרנה נוראית. השאלות מנוסחות בצורה לא ברורה/קריאה וכתיבת הקוד ארוכה ומייגעת.\n\nהשורה התחתונה:  קורס קשה מאוד לאנשים ללא רקע בתכנות, ממליצה להיעזר בבינה מלאכותית וסרטונים של הודים כי הסגל של הקורס לא יודע ללמד בכלל", "timestamp": 1715539134674}, {"author": "תלמידה חמודה", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nיעל מרצה משעממת ברמות, חצי מהזמן מתבזבז גם על תקלות טכניות שלה\nרוב בזמן היא לא ברורה \nבגדול ההרצאות מיותרות מאוד\nשם המתרגל/ת:  שלי גולן\nחוות דעת - תרגולים: \nשלי מתרגלת מעולה, סבלנית ואכפתית\nחושבת אבל שנג'יב הרבה יותר טוב (התרגולים ביוטיוב)\nשעורי הבית: \nקשים מאוד למי שאין רקע \nלוקחים הרבה מאוד זמן \nהניסוחים של השאלות מזעזעים\nהמבחן: \nקשה מאוד להבין מה רוצים ממך בכל שאלה \nקשה להספיק בזמן הנתון \nתמיד נכנסים מתרגלים ומחדדים את השאלות אם לא להתעכב\nהשורה התחתונה: \nקורס חרדות, \nלא מלמד את הדברים הרלוונטיים באמת", "timestamp": 1715682661555}, {"author": "מבוא למדמ''ח C", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איהב\nחוות דעת - הרצאות: הרצאות די משעממות לצערי. מומלץ לצפות בקורס של campus.il (אותו קורס בדיוק). אבל מומלץ להגיע להרצאות של סיבוכיות בנוסף.\n\nשם המתרגל/ת: מר' לזר צביקה\nחוות דעת - תרגולים: חמוד מאוד ומסביר כמה שצריך אם משהו לא מובן.\n\nשעורי הבית: ארוכים וקשים למי שלא תכנת בעבר\n\nהמבחן: לי אישית היה קשה מאוד.\n\nהשורה התחתונה: קורס שלא דורש הרבה זמן סך הכל אבל דורש המון השקעה למי שלא תכנת בעבר. הקורס עצמו מאוד מבולגן וחוץ מלחפור על הפורומים אין באמת אפשרות להישאר מחובר. מומלץ להתחיל לפתור מבחנים כמה שיותר מוקדם. למרות שהפתרונות של המבחנים לא ברורים בכלל ומאוד קשה להבין אותם לפעמים. תתאמנו על leetcode וneetcode. שמה תמצאו שאלות ברמת מבחן ועם היסבירים.", "timestamp": 1715971030965}, {"author": "עלמה", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: קורס בקמפוס אי אל \nחוות דעת - הרצאות: ההרצאות משעממות, ומועברות בצורה גרועה לדעתי. למדתי עם הקורס בקמפוס שהיה מצויין וברור מאד.\n\nשם המתרגל/ת: גיל אלגריסי\nחוות דעת - תרגולים: מאד נהנתי עם גיל, עשה אווירה כיפית וקלילה, ניסה לגרום לנו באמת להתחבר למהות ולהבין. אבל עדיין בסוף התרגולים פשוט לא מכינים למבחן, לא באמת מביאים שאלות ברמה של מבחן.\n\nשעורי הבית: קשים ומעיקים ובכלל לא נותנים כלים להתמודד עם שאלות ברמה כזאת.\n\nהמבחן: פער תהומי בין ההרצאות והתרגולים לבין הרמה הנדרשת במבחן. \n\nהשורה התחתונה: קורס מעצבן בגלל הפער מטורף בין הכלים שנותנים לבין מה שדורשים במבחן. לי מאד עזר לעשות את הקורס בקמפוס לפני הקורס עצמו אבל תכלס כדאי להתחיל לראות מבחנים במהלך הסמסטר כדי להתחיל להבין את הרמה.", "timestamp": 1716837738899}, {"author": "אני", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: גרוע הפסקתי ללכת \n\nשם המתרגל/ת: לא הלכתי בזבוז זמן \nחוות דעת - תרגולים: בזבוז זמן \n\nשעורי הבית: סבירים, שימו לב לא להתחיל ברגע האחרון \n\nהמבחן: קשה ולא תואם לתרגולים א להרצאות \n\nהשורה התחתונה: גם אם יש לכם נסיון זה לא כזה עוזר, בהצלחה", "timestamp": 1716976253734}, {"author": "סטונדט לנתונים", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסף ויינשטיין\nחוות דעת - הרצאות: רוב המרצים די גרועים, אבל לפחות היה מצחיק עם יוסי. למי שיש רקע לא חייב ללכת להרצאות, כן ממליץ להצטרף לקראת הסוף שעוסקים בסיבוכיות ו-backtracking. מי שאין לו רקע, בהצלחה.\n\nשם המתרגל/ת: גיל אלגריסי\nחוות דעת - תרגולים: מתרגל תותח. בהתחלה היה יחסית ריק אצלו אבל כנראה שאנשים הבינו שהוא טוב, באמצע הסמסטר היינו צריכים לעבור כיתה והתרגולים אצלו היו מפוצצים. מסביר את החומר תכלס שיהיה קל להבין, מדגים קוד בלייב ואפילו נתן קצת העשרה לקורסים עתידיים שעזרה להבין את החומר. גם למי שיש רקע ממליץ ללכת לתרגולים שלו, נותן הרבה טיפים פרקטיים.\n\nשעורי הבית: סבירים לגמרי, חוץ מת\"ב 3 שייקח לכם הרבה זמן. נותנים ניסיון פרקטי בתכנות שהוא חשוב, החיסרון זה שמקבלים תשובות על התרגילים חודש+ אחרי שעשית אותם אז קשה ליישם משהו מהטעויות שלך.\n\nהמבחן: היה סביר והוגן. בגלל המלחמה לא הייתה לנו שאלת backtracking אלא שאלת רקורסיה \"רגילה\", לצערי ההנחיות אליה לא היו ברורות וירדו לאנשים הרבה נקודות על פונקציות מעטפת לפונקציות רקורסיביות. סיבוכיות - רצים קבצים בין אנשים / בדרייבים של תרגול סיבוכיות, חשוב לעשות הרבה כאלה לפני.\n\nהשורה התחתונה: קורס בסיסי שיכול לעבור בצורה טובה עובר בצורה רעה על ידי סגל שלא מסביר טוב את החומר וחושב שכולם יודעים לתכנת מהבית (חוץ מגיל המלך).", "timestamp": 1717050018783}]}