{"posts": [{"author": "SR", "difficultyRank": 3, "generalRank": 5, "semester": "201702", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: יעל מרצה טובה מאוד. בדיעבד אני חושב שאולי ההרצאות היו קצת מיותרות בקורס, והיה אפשר לעבור עליהן לבד במצגות. ממליץ פשוט לנסות כמה הרצאות ולהחליט מה הכי טוב לכם.\n\nשם המתרגל/ת: נג'יב נבואני\nחוות דעת - תרגולים: נג'יב מתרגל מעולה, באמת אין לי מה לפרט מעבר. יש אותו גם בווידאו ואני גם לגמרי ממליץ עליו.\n\nשעורי הבית: יש 5 תרגילי בית שהייתי אומר שרמת העומס שלהן היא בינונית. מי שמגיע בלי רקע - כנראה יהיה לו קשה יותר, ולכן חשוב להשקיע את הזמן ובמידת הצורך להיעזר בשעות הקבלה.\n\nהמבחן: באופן כללי, המבחן מתאפיין בכך שיש בו שאלות קצרות יותר משיעורי הבית, אבל ברמת קושי גבוהה יותר. נדרש לתרגל הרבה מבחנים, אבל מי שיעשה את זה כנראה יצליח להוציא ציון יפה מאוד.\n\nהשורה התחתונה: קורס מבואי, שכנראה הרבה ממנו יהיה מוכר לאנשים עם רקע קודם, אבל עדיין מציג הרבה רעיונות חדשים, בין היתר בשל העובדה שהוא נלמד בשפת C שהיא קצת יותר low level ממה שמלמדים בתיכונים. סה\"כ היה מעניין ונחמד.", "timestamp": 1597744394924}, {"author": "YT", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ניר אילון\nחוות דעת - הרצאות: מרצה חסר כריזמה ולא מעניין. בכללי, זהו קורס שהרצאות בו הן בזבוז זמן מוחלט ולא מומלץ לבזבז עליהן זמן. אם בכל זאת רוצים יש הרצאות נחמדות של ראובן בר יהודה ביוטיוב והן גם יותר קצרות מאורך ההרצאות הפרונטליות.\n\nשם המתרגל/ת: גיא בשרבצקי\nחוות דעת - תרגולים: מתרגל נשמה ותותח, נשאר בתרגולים שעה וחצי ושעתיים מעבר לזמן התרגול כדי להספיק את כל החומר לעומק ולוודא שכולם הבינו הכל. נותן במה לשאלות מכל הסוגים ובלי הגבלה (לפעמים יכול להעיק, אבל זה לטובת הסטודנטים בסופו של דבר)\n\nשעורי הבית: קלים, 5 תרגילי בית. חלקם לוקחים 5-6 שעות, אחרים לוקחים יומיים-שלושה( לא מלאים)\n\nהמבחן: לא משקף לטעמי את החומר הנלמד. ממליץ לנסות לגשת למבחנים אחרי שלומדים מיונים וסיבוכיות.\n\nהשורה התחתונה:", "timestamp": 1597752632681}, {"author": "1", "difficultyRank": 5, "generalRank": 5, "semester": "201901", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: מרצה מצויין ומסביר הכל בצורה מעניינת.\nההרצאות לא כל כך חשובות בקורס הזה, אפשר לראות המוקלט ביוטיוב וזה מספיק\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים המוקלטים ביוטיוב של נגיב מומלצים!\nשעורי הבית: \nעמוסים וקשים למי שבא ללא רקע וקלים למי שבא עם רקע.\nהמבחן: לא כל כך קשור לחומר להרצאות תרגולים ושיעורי בית\nצריך לפתור הרבה מבחנים. \n\nהשורה התחתונה: לא כל כך קורס \"מבוא\"!\nקורס עמוס מאוד למי שמגיע ללא רקע, תרגילי הבית הראשונים במיוחד ייקחו מספר ימים כי לא לומדים את כל הבאגים שיכולים לראות בהם ואז מבזבזים ימים על debugging לעומת מי שבא עם רקע ויכול לסיים תרגילי הבית תוך מספר שעות קטן.", "timestamp": 1598018744134}, {"author": "י", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמיותרות - תלכו רק לחלק השני של ההרצאות \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nגיא חמוד. אם הוא נמצא תלכו אליו. נותן מכל הלב.\nשעורי הבית: \nקשים, אבל כיפים ומעניינים.\nהמבחן: \nמוזר,קשה ולא כלכך קשור למה שלמדנו במהלך הסמטטר. אין ברירה..\nהשורה התחתונה: \nלחרוש למבחן כמה שיותר וזה יעבור...", "timestamp": 1598380861796}, {"author": "מבין עניין", "difficultyRank": 2, "generalRank": 5, "semester": "201901", "text": "שם המרצה: תומר שלומי\n\nחוות דעת - הרצאות: \nהוא אוהב להתעקב על שאלות בסיסיות של סטודנטים, ככה שאם יש לכם רקע בתכנות אתם כנראה תרדמו בהרצאה.\n\nשם המתרגל/ת: גיא ברשבסקי\n\nחוות דעת - תרגולים: \nמתרגל מעולה. הוא לא מסתמך על מה שראינו בהרצאות אלא מסביר את כל החומר בעצמו, והוא עונה לכל שאלה.\n\nשעורי הבית: \nשיעורי בית מאוד קלים למי שמבין את החומר בהרצאות.\n\nהמבחן: \nהסיבה היחידה שהקורס שווה 4 נק\"ז היא בגלל המבחן.\nבשביל לקבל 100 בקורס צריך לבנות אינטואיציה לשאלות, להבין מה כנראה רוצים. חלק מהשאלות במבחן לקוחות מהאתר leetcode ככה שאני מאוד ממליץ לפתור משם שאלות בנושאים הרלוונטים למבחן. בכל מקרה, חשוב לעבור על כל הטריקים ממבחני עבר (היסטוגרמה, 2 מצביעים, וריאציות של חיפוש בינארי, שינוי מחרוזות וכמובן סיבוכיות). \n\nהשורה התחתונה: \nאם יש לכם רקע בתכנות אל תזלזלו בקורס, במיוחד בחצי השני שלו. כדאי לבוא לכל התרגולים, ולהרצאות כדאי לבוא מהרצאה 5 ואילך (אם יש לכם רקע).", "timestamp": 1599039393369}, {"author": "רועי ששון", "difficultyRank": 2, "generalRank": 3, "semester": "201901", "text": "שם המרצה:  תומר שלומי\nחוות דעת - הרצאות: \nהרצאות סבירות למי שיש מעט רקע אני ממליץ לא ללכת זה יכול להיות משעמם לא רלוונטי למבחן ולציון בכלל. אפשר לעבור על המצגות לבד.\nסגל לא משהו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאפשר למצוא מתרגל יותר טוב.\nממליץ לחפש טוב ולעבור כמה מתרגלים עד שמוצאים מישהו ממש טוב. בטוח יש מישהו ממש טוב וכל החומר למבחן ולהגשות מועבר רק בתרגולים.\n\nשעורי הבית: \nשיעורי הבית הם ציון תקף בקורס ודורשים זמן עבודה רב. הם נבדקים במערכת אוטומטית אז חשוב שהם יהיו מושלמים. לכל הגשה יש גם אפשרות לתיקון ושיפור.\n\nהמבחן: \nאם לומדים טוב ועונים על הרבה שאלות לפי נושאים אפשר להצליח מאוד במבחן.\nהוא דורש להכיר טריקים אבל הם חוזרים על עצמם.\n\nהשורה התחתונה: \nאם זה קורס חובה אין מה לעשות. באופן כללי אני לא ממליץ", "timestamp": 1600446423637}, {"author": "סיריוס בלק", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: לא זוכרת \nחוות דעת - הרצאות: ההרצאות מיותרות לקורס\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: מצויין\n\nשעורי הבית: לוקחים ים זמן\n\nהמבחן: סבבה\n\nהשורה התחתונה: אני נהנתי אבל הקורס לא פשוט", "timestamp": 1603570861994}, {"author": "רועי ששון", "difficultyRank": 4, "generalRank": 3, "semester": "201901", "text": "שם המרצה: לא מעביר יותר את הקורס\nחוות דעת - הרצאות: \nלא רלוונטי\n\nשם המתרגל/ת: לא מעביר יותר\nחוות דעת - תרגולים: \nלא רלוונטי\n\nשעורי הבית: \nלוקחים הרבה זמן, קשים, הרבה פעמים התחלתי לעשות את שיעורי הבית ואז רק בתרגול שבוע אחרי לימדו את מה שצריך בשביל שיעורי הבית.\nממליץ לעבור על כמה תרגולים קדימה לפני שמתחילים לפתור הגשות.\n\nהמבחן: \nממש שונה מההגשות, צריך ללמוד אליו בנפרד ולחרוש מלא מבחנים לפני נושאים. יש שניים שלושה רעיונות שתמיד חוזרים על עצמם.\n\nהשורה התחתונה:", "timestamp": 1608391504830}, {"author": "That's a secret I'll never tell", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nמרצה מדהימה מדהימה מדהימה! נותנת מקום לשאלות. בתור אחת ללא רקע, ממליצה מאוד לראות את כל ההרצאות ולהתעמק בהבנה, הרבה פעמים אנשים בעלי רקע אומרים שזה מיותר- well, אם אין לכם רקע, אל תחשבו אפילו על לוותר. \nשם המתרגל/ת: נאג'יב- יוטיוב\nחוות דעת - תרגולים: אולי היתרון העיקרי אם לא היחיד של סמסטר זום, זה שלא מרגישים 'רע' על זה שלא מגיעים להרצאות ולתרגולים בלייב. נאג'יב מעולה ומסביר את החומר מצוין.\n\nשעורי הבית: למי שבלי רקע, מאוד קשה ודורש המון זמן. ממליצה להגדיר מראש כמה זמן להקדיש לש\"ב, ואם לא הולך אז לעצור, יכול לגזול המון זמן שבסופו לאו דווקא תצליחו.\n\nהמבחן: \n\nהשורה התחתונה: אם אין לכם רקע, הרצאות של יעל+ נאג'יב ביוטיוב, המון תרגול ואתם תהיו בסדר.", "timestamp": 1610019066223}, {"author": "שיר חסקל", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תומר שלומי\nחוות דעת - הרצאות: בסדר גמור, לימד לפי המצגות. למי שמגיע בלי רקע אני ממליצה להכנס בעקביות להרצאות \n\nשם המתרגל/ת: טום הרמן\nחוות דעת - תרגולים: מתרגל מצויין, שולט בחומר ועונה בצורה מובנת וסבלנית על כל שאלה. ממליצה!\n\nשעורי הבית: לא לדחות לרגע האחרון, לוקח המווןןן זמן להכין אותם וזה 10% תקף לציון הסופי.\n\nהשורה התחתונה: אל תרוצו להתקין קוד בלוק לפני תחילת הסמסטר, יש תוסף של הטכניון ועוד כמה הגדרות ((-:", "timestamp": 1612574537344}, {"author": "hamou sarah", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:תואצ היא אחלה מרצה  אבל ההרצאות במבוא מיותרות \n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: רק נג'יב אין עליו\n\nשעורי הבית: קשוח \n\nהמבחן: הוגן", "timestamp": 1614065249401}, {"author": "A", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: סה\"כ מרצה סבבה, מתעכבת על הרבה שאלות של הסטודנטים, אבל זה מעולה למי שמגיע בלי רקע בכלל.\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: מתרגל מעולה, עושה מעל ומעבר בשביל הסטודנטים. במהלך הסמסטר הוא תמיד נשאר אחרי הזמן לשאלות ופרסם כמה סרטונים נוספים כהכנה למבחן שמאוד עזרו. אבל, הוא מאוד פופולרי אז בד\"כ יש הרבה סטודנטים בתרגולים שלו וזה יכול ליצור עומס שאלות ולפעמים עיכובים מיותרים.\n\nשעורי הבית: אפשריים, לוקח זמן כדי לעשות אותם (תלוי תרגיל, בין יום ל3 ימים בערך) אבל הם מאוד עוזרים להבין את החומר. \nכדאי לשים לב, שלפעמים מקבלים מטלה ורק הרצאה אחרי לומדים חומר רלוונטי, אז לא לרוץ ישר לפתור ומצד שני לא למשוך אותם ליום האחרון.\n\nהמבחן: סביר, אם פותרים מספיק מבחנים לפני מצליחים בלי בעיה.\nהסמסטר המבחן לא היה כתוב, ממש כתבנו קוד בסביבת עבודה שלנו והגשנו אותו בדומה למטלות במהלך הסמסטר. לכן ממליצה לבחור סביבת עבודה נוחה וללמוד לדבג עוד במהלך הסמסטר כדי להגיע למבחן מוכנים.\n\nהשורה התחתונה: הקורס הכי סביר בסמסטר א", "timestamp": 1614159331902}, {"author": "עדן ותד", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רוי\nחוות דעת - תרגולים: \n\nשעורי הבית: צריכים הרבה זמן (לא לבהל)\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614349806593}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: /\nחוות דעת - הרצאות: /\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים: להיכנס להרצאות ולתרגולים זה בזבוז זמן כשיש את הסרטונים של נג'יב, הגעתי בלי רקע בכלל והוא מלמד הכל בצורה יסודית.\n\nשעורי הבית: קלים למי שעם רקע, למי שבלי יקח זמן, אבל הם מאוד עוזרים להבין את החומר ולהגיע למבחן מוכנים.\n\nהמבחן: הוגן, בייחוד כשבסמסטר שלנו הוא היה על מחשב. בסופו של דבר הכלים בקורס הם בסיסיים, אז אין יותר מדי גיוון בשאלות.\n\nהשורה התחתונה: דורש את הזמן שלו, אבל לא קשה.", "timestamp": 1614353378708}, {"author": "Maya Lavi", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: לא נכחתי בהרצאות בכלל. בדיעבד כדאי מאוד להיות על זה, אם לא בהרצאות אז לפחות לעבור על המצגות. \n\nשם המתרגל/ת: רואי בנימין/ מוקלטות של נג'יב\nחוות דעת - תרגולים: שניהם מעולים, מסבירים כמו שצריך את הכל. התרגולים חשובים להבנה של החומר, יותר מההרצאות.\nאם יש רקע, אולי קצת מיותר אבל כדאי עדיין לוודא שיודעים מה הולך שם.\n\nשעורי הבית: אחת לשבועיים, יש מספיק זמן להגיש. יש תרגילים שלוקחים כמה שעות, יש כמה ימים- הקומפיילר שלהם קצת עצבני אז אפשר לשבת על טסטים די הרבה.. \nחלק מהציון אז כדאי לעשות אותם.\n\nהמבחן: לא קרוב אפילו לתרגילי הבית. לתרגל, לתרגל ולתרגל!! \nככל שתפתרו יותר מבחנים, תחשפו ליותר שאלות ותתחילו לזהות דפוס שאח\"כ במבחן יבוא לטובתכם. \n\nהשורה התחתונה: בעלי רקע- תוודאו שאתם לכל הפחות על זה. אלה שבלי- תתרגלו המון, תשאלו שאלות (הצוות מקסים ועונה על הכל).", "timestamp": 1614941267796}, {"author": "בשארה", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: היא סבבה ומקדישה זמן לשאלות ופותרת את הבעיות בvisual בזמן ההרצאות שלדעתי זה עזר.\nאבל לא נכחתי בכל ההרצאות כי זה היה קצת משעמם ולא באמת עזר לי בחומר (מלא עשו כמוני).\n\nשם המתרגל/ת: עמית וסרטוני נגיב. \nחוות דעת - תרגולים: \nעמית ממש סבבה הוא הולך קצת בקצב מהיר אבל היה לי רקע אז היה סבבה בשבילי לא ממליץ למי שאין להם רקע.\nבשליש האחרון התחלתי לראות את הסרטונים של נגיב ואני מתחרט שלא ראיתי את התרגולים שלו לפני הוא מתרגל. מדהים\nשעורי הבית: ממש חשובים ומומלץ לעשות לוקחים קצת זמן לעשות אבל בשבילי היה ממש כיף לעשות וזה ממש מספק כשזה עובד(אומנם רוב הזמן התעסקתי בdebug).\n\n\nהמבחן: שמתי לב שהמחנים לא באותו הרמה של התרגולים בכלל!! יחסית למבחני עבר המבחן היה ממש קל. \n\nהשורה התחתונה: הקורס היה ממש כיף למי שאין לו רקע כדאי להשקיע לעשות שיעורי בית ולפני המבחן לתרגל ולפתור מבחני עבר וכך יהי קל לקבל ציון גבוה.", "timestamp": 1615031264511}, {"author": "angry student", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: משעמם\n\nשם המתרגל/ת: נג'יב ביוטיוב\nחוות דעת - תרגולים:  לא לבזבז זמן - לכו ישר על נג'יב\n\nשעורי הבית: קשה מאוד\n\nהמבחן: לא הוגן בעליל\n\nהשורה התחתונה: לא מומלץ", "timestamp": 1615058954707}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איהב\nחוות דעת - הרצאות: קצת משעמם בהתחלה לקראת הסוף נהיה טוב\nשם המתרגל/ת: נגיב ביוטיוב\nחוות דעת - תרגולים: נגיב מתרגל מעולה\nשעורי הבית: בזבוז זמן במיוחד שבסהכ 10%\nהמבחן: קשה ובפורמט החדש שחטו בבדיקות\nהשורה התחתונה: הסגל בסמסטר היה לא טוב , לא הייתה תקשורת ובעיקר המתרגל האחראי ( דימיטרי ) שעונה בצורה רעה לשאלות ומבאס אותך שבכלל שאלת .", "timestamp": 1615104538208}, {"author": "רועי", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה סבבה.\n\nשם המתרגל/ת: נגיב יוטיוב\nחוות דעת - תרגולים: אין על נגיב, תראו אותו ביוטיוב, מסביר את החומר נהדר.\n\nשעורי הבית: עמוסים ומעיקים בעיקר. אבל עוזרים להכניס את החומר לראש.\n\nהמבחן: לדעתי כדאי להתחיל לפתור מבחנים עוד במהלך הסמסטר, מחיפוש בינארי ומחרוזות בערך. כי אף אחד לא יכין אותכם למבחן הזה.\n\n\nהשורה התחתונה: הסגל שלנו היה לא פחות מביזיון, התנהגות מבישה ובדיקה מגוכחת לכל תרגיל בית ולמבחן בפרט. ממליץ ללמוד על סיבוכיות ובאקטראקינג מהאינטרנט כי פה לא ילמדו אתכם. אה ואגב זה 50 אחו מהניקוד הסופי.", "timestamp": 1615462745613}, {"author": "ארבל", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מסבירה ממש טוב, המצגות מעולות, מתקדמת בקצב טוב בלי לרוץ\n\nשם המתרגל/ת: רואי\nחוות דעת - תרגולים: מסביר ממש טוב, אכפתי, נותן זמן לשאלות ומתקדם עם החומר. ממליץ מאוד\n(אני מגיע עם ניסיון וראיתי מוקלטים במהירות גבוהה) \n\nשעורי הבית: בהתחלה צריך ללמוד את הסינטקס, אבל לא מאוד נורא, לקראת הסוף דורשים משמעותית יותר זמן, ממליץ להשקיע בראשונים כי זה באמת נקודות חינם\n\nהמבחן: הוגן", "timestamp": 1615802067511}, {"author": "סוסיה", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "בתור אחד שידע C מראש - לא הגעתי לתרגולים ולהרצאות.\n\nשעורי הבית: \nקלים למי שיודע C, ערב אחד לכל תרגיל שמתפרסם אחת ל-10 ימים בערך\n\nהמבחן: \nשאלות סיבוכיות ובאקטרקינג יהיו טריקיות מאוד לאנשים שלא חוו שאלות מהסוג האלה מראש, גם אנשים שיודעים לתכנת היטב. \nגם אם אתם יודעים לתכנת, לא לזלזל בקורס.\nבמהלך הקורס עושים הרבה שאלות ממבחנים ולומדים את ה-\"ראש\" של המבחן.\nככה שמי שמחליט לא להגיע להרצאות ותרגולים - ראו הוזהרתם.\n\nהשורה התחתונה: \nלא לזלזל בקורס הזה גם אם הוא נראה לכם כמו חומר שאתם כבר יודעים.", "timestamp": 1616012075979}, {"author": "Nitai", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: תומר \nחוות דעת - הרצאות: תומר מסביר אחלה, ההרצאות די מונוטוניות. לא מתעכב יותר מידי להמון שאלות אבל כן נותן לשאול. אני הייתי מבסוט ממנו, אבל מי שבלי רקע בכלל במדמח אולי יעדיף מישהו אחר.\n\nשם המתרגל/ת: מג'ד, נג'יב ביוטיוב\nחוות דעת - תרגולים: סהכ בסדר, אני העדפתי לראות את התרגולים ביוטיוב וממליץ עליהם\n\nשעורי הבית: יחסית בסיסיים, ש.ב 3 ו4 מעט ארוכים יותר מהרגיל\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1617038153623}, {"author": "idan", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: אחלה מרצה, מסבירה טוב מאוד את החומר.\n\nשם המתרגל/ת: דמיטרי\nחוות דעת - תרגולים: מתרגל מעולה לדעתי, מאוד פרקטי ומסביר מה שבאמת חשוב לדעת ולהבין. הוא עונה על כל השאלות ומסביר באופן ברור מאוד.\nמה גם שהוא תמיד זמין במייל ועונה על שאלות.\n\nשעורי הבית: קשים מאוד למי שאין רקע בתכנות, צריך לשבת עליהם הרבה זמן.\n\nהמבחן: קשה מאוד , לדעתי יש פער גדול מאוד בין מה שנלמד במהלך הסמסטר לבין הרמה הדרושה במבחן, צריך לשבת ולטחון כמה שיותר מבחנים.\n\nהשורה התחתונה: אציג את נקודת המבט שלי, לי לא היה רקע בתכנות.\n קורס קשה שלוקח הרבה מאוד זמן במהלך הסמסטר, המבחן מאוד ערמומי וקשה להוציא ציון גבוהה אבל אפשרי אם עוברים על מספיק מבחנים ובאים מוכנים.\nלדעתי יש קצת בעיה של תיאום בין אנשי הסגל בקורס וזה בא על חשבון הסטודנטים.", "timestamp": 1617523412486}, {"author": "catto", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מירי בן חן\nחוות דעת - הרצאות: מירי ממש נחמדה, ומעודדת שאלות מהסטודנטים במהלך ההרצאה; אבל אני חושב שנקודתית עבור הקורס הזה, סמסטר קורונה לא הטיב איתו. השיעורים היו קצת מונוטוניים, והיה קשה לעקוב אחרי השקופיות, כשלפעמים אנחנו מדלגים 10 עמודים קדימה, ואז 5 אחורה.\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: מדגים את החומר בצורה מאוד קוהרנטית. גם כאן היה שימוש בשקופיות, אבל בליווי של כתיבה על הלוח, ואני חושב שזה היה שילוב לימודי מאוד מוצלח. ראינו קוד על המסך, ואז ניתחנו אותו על הלוח.\n\nשעורי הבית: שיעורים 3 ו-5 היו די קשים\n\nהמבחן: סבבה לגמרי, המבחנים של מירי לאורך השנים ממש הוגנים\n\nהשורה התחתונה: קורס נחמד. לטעמי מאוד רצוי להגיע עם ידע בתכנות, לפחות רק בסינטקס. מאוד עוזר בשבועות הראשונים, למרות שאחרי זה כבר כולם נכנסים לשוק באותה מידה", "timestamp": 1627506967423}, {"author": "Meowster", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוסי וינשטיין\nחוות דעת - הרצאות: ההרצאות היו מעניינות, מי שלא יכל להגיע היו הקלטות שהיה אפשר להשלים מהם, המרצה העביר את החומר טוב אך לא היה משעמם, היה אפשר לראות שהוא נהנה מלהעביר את החומר.\n\nשם המתרגל/ת:  אברהם טל\nחוות דעת - תרגולים:  לא הרבה נשארו בתרגולים עד הסוף, אך אני אישית כן ובאמת נהנתי מהתרגולים, המתרגל לפעמים היה קצת מבולבל, אבל בסך הכל היה כיף לשבת בחדר כמה חברים ולחשוב על הפתרון של התרגיל.\n\nשעורי הבית: לא עמוסים בכלל, חוץ מתרגיל 3 שתמיד כדאי להתחיל כמה ימים לפני.\n\nהמבחן: המבחן קל למי שפותר מבחנים משנים קודמות, תתאמנו הרבה על סוג החשיבה שדורשים ותקבלו ציון טוב.\nעצה: אל תצאו לפני סוף המבחן, תנסו למצוא את כל הטעויות הקטנות שאפשר.\n\nהשורה התחתונה: קורס מאוד כיף, ממליץ בחום לכולם, תפנו זמן לתרגיל 3 ובהצלחה!", "timestamp": 1627821690420}, {"author": "long bool", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מירי בן חן\nחוות דעת - הרצאות: אחלה של מרצה, מסבירה מעולה\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: נורא מסודר בדרך ההוראה שלו, ויודע להעביר את החומר בצורה מעולה. אחד מהמתרגלים הכי טובים שיצא לי לפגוש הסמסטר (סמסטר ראשון).\n\nשעורי הבית: הגעתי לקורס עם ניסיון בתכנות אז הם דרשו קצת זמן (במיוחד תרגיל 3) אבל לא היו כ\"כ קשים. שיעורי הבית האחרונים הם היחידים שהיו קשורים לאלגוריתמים שלמדנו במהלך הקורס, לכן היו קצת יותר מאתגרים.\n\nהמבחן: סבבה לגמרי. חשוב נורא לתרגל כמה שיותר מבחני עבר כי בסופו של דבר, רוב התרגילים במהלך הסמסטר לא קשורים לחומר של המבחן, לכן את כל הטריקים והדרכים השונות לפתרון של מבחנים לומדים ממבחני עבר.\n\nהשורה התחתונה: \n1. עוזר להגיע עם רקע בתכנות כי זה מוריד מהעומס של הקורס. בהנחה והגעתם עם רקע בתכנות, כנראה לא שווה להגיע לתרגולים והרצאות, ומספיק רק לעבור על המצגות וההקלטות אם יש (יצא שהייתי בפלאפון חצי מהזמן בכל תרגול/ הרצאה ואז הפסקתי לבוא).\n2. אין בקורס יותר מדי עניין, אבל אם אין רקע בתכנות, הוא הכרחי כדי להבין את הלוגיקה ודרך החשיבה שנדרשים בתכנות.", "timestamp": 1628194027931}, {"author": "Gil Shahar", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מירי בן חן\nחוות דעת - הרצאות: ההרצאות היו רק בזום, כשהיה צריך לכתוב על השקופיות היא כתבה עם העכבר והיה מאוד לא מובן ומבולגן\nאבל בסך הכל ההסברים המילוליים שלה היו טובים והיא העבירה טוב את המצגות\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: התרגולים היו קצת מקובעים, היינו עוברים על המצגת המוכנה שיש לכל המתרגלים והיינו עוברים על החומר שהיה בהרצאה ואז \"פותרים\" תרגילים, רק שלא באמת פתרנו אלא הוא רק הראה לנו את הפתרון ועברנו עליו..\nקצת חבל כי לא באמת יצא לנו לכתוב קוד ביחד מאפס, אבל ככה זה כל המתרגלים.\nרואי היה טוב בהסברים שלו ואני ממליץ בכל זאת עליו.\n\nשעורי הבית: לוקחים כמה שעות אז לא כדאי לדחות\n\nהמבחן: נחמד\n\nהשורה התחתונה: אם לא תכתבו קוד בעצמכם, שאלוהים יעזור לכם", "timestamp": 1634541565424}, {"author": "מעיין מרואני", "difficultyRank": 3, "generalRank": 4, "semester": "202003", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:  \nיעל היא מרצה פשוט מדהימה, מעבירה את החומר טוב וברור ובעיקר מראה דוגמאות ומממשת את האלגוריתמים מולנו בשיעורים ולא רק קוראת מהמצגות ככה שההבנה הרבה יותר טובה ועמוקה. \nממליצה בחום!\n\nשם המתרגל/ת: מתן ממיסטבלוב\nחוות דעת - תרגולים: \nמתרגל סוף העולם, בא לקראתנו, שיעורי בית התחשב מאוד בהגשות... \nרק המבחן שהוא כתב היה טיפה מאתגר לדעתי:)\n\nשעורי הבית: \nכעיקרון, הם סבבה למי שלא עמוס מדי, אבל לקראת הסוף הם לא קלים ועזרה ממישהו שמתמצא בחומר מצילה אותם לגמרי!\n\nהמבחן: \nלא קל, אבל חושבת שפחות או יותר עונה על דרישות הקורס...\nתחרשו על סיבוכיות באמת זה שאלת מתנה שמה כמו שזה לא..\n\nהשורה התחתונה: \nבאמת שזה קורס סבבה לגמרי , אבל לדעת אלגוריתמים ובאקטרקינג זה באמת כלל ברזל בו אז שימו לב\nואם יש לכם את מתן כמתרגל או את יעל כמרצה אז שתדעו שזכיתםם", "timestamp": 1634587749740}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202003", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה מעולה, יודעת להסביר כל נושא בצורה ברורה, סבלנית לשאלות ונותנת טיפים מעולים לפתרון תרגילים\n\nשם המתרגל/ת: מתן\nחוות דעת - תרגולים: לא ברור לי איך הוא המתרגל האחראי, היו המון בעיות עם בדיקת תרגילי הבית וחוסר מענה באופן קבוע ממנו. \n\nשעורי הבית: חוץ מתרגיל בית 3 שהיה קצת ארוך, כל שאר תרגילי הבית משקפים את הנושאים שלומדים בקורס\n\nהמבחן: לא קל אבל אפשרי\n\nהשורה התחתונה: תעבדו טוב על סיבוכיות ובאקטראקינג לפני המבחן", "timestamp": 1635194918452}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:  מסבירה בסדר את החומר, יודעת על מה היא מדברת אבל איטית מאוד ותמיד בפיגור בחומר. מלמדת נושאים שהיו בשיעורי בי רק לאחר שהיה צריך להגיש אותם מרוב שהיא בפיגור\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: מתרגל מדהים, סביר את החומר בצורה מעולה, עוזר לתלמידים שצריכים עזרה באופן פרטני, שורמ על הקשב של התלמידים ועומד בקצב המהיר של הקורס מבלי לרדת ברמת הלימוד\n\nשעורי הבית:  קשים ועמוסים, כל מטלה יכולה לקחת צפונה ל10-15 שעות אם אתה לא חד על החומר\n\nהמבחן: לא עשיתי אותו עדין\n\nהשורה התחתונה: הקורס מתיימר ללמד הכל מהתחלה, אבל רוב(מוחלט ממש כ75 אחוז(היה KAHOOT בשיערו הראשון) כבר יש להם רקע בתכנות והקצב הוא לפיכהם ולא לפי מי שאין לו רקעת אז למרות שממדים הכל מהבסיס מהר מאוד ממשיכים הלאה ואתה תרגיש אבוד אם אין לך רקע קודם למרות שזה קורס מבוא", "timestamp": 1644434005389}, {"author": "רועי סולד", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: פרזי\nחוות דעת - תרגולים: מאוד טובים\n\nשעורי הבית: יחסית בסדר ומתאימים לרמה של התרגולים\n\nהמבחן: יותר מדי קשה החומר שמועבר ברמה הרבה יותר נמוכה\n\nהשורה התחתונה: תלמדו הרבה למבחן", "timestamp": 1645052427754}, {"author": "Yo", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:  היא אחלה בכפול 2. אם אתם יודעים לתכנת אפילו קצת אין מה לבוא להרצאות.\n\nשם המתרגל/ת:  הקלטות\nחוות דעת - תרגולים: יש הרבה הקלטות אחלה, ספציפית רואי בנימין מצויין אבל באמת שלא חסר, תנסו תראו מה מתאים לכם. למי שיש קצת נסיון אפשר לראות ב1.5 בלי בעיה.\n\n\nשעורי הבית: אם אין לכם נסיון הם יכולים להיות קשים, במיוחד יש קפיצה באמצע הקורס אבל  זה נהיה בסדר אחרי.\n\nהמבחן: קפיצת מדרגה משמעותית משאר החומר של הקורס, שימו לב שצריך להתכונן אליו במיוחד!\n\nהשורה התחתונה: די קל למי שיודע לתכנת, די קשה למי שלא", "timestamp": 1645098789818}, {"author": "BaronCabbage", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  לא רלוונטי\nחוות דעת - הרצאות: יש לי רקע ב-C אז היה מיותר לגמרי עבורי ההרצאות\n\nשם המתרגל/ת: דניאל ליברמן\nחוות דעת - תרגולים:  בקושי הדעתי לתרגולים גם אבל ממה שהיית הוא מסביר ממש סבבה\n\nשעורי הבית: תרגיל 3 קצת ארוך כל השאר סטנדרטיים אבל לא משקפים את רמת המבחן בשום צורה\n\nהמבחן: חד משמעית יותר קשה מכל מה שהיה בקורס אבל הטריקים ממש חוזרים על עצמם וצריך לפתור כמה מבחנים כדי להבין את הרעיון הכללי. \n\nהשורה התחתונה: בתור מישהו עם רקע הקורס היה דיי קל אם יש רקע אפשר לקחת בשאנטי ואיפלו עוד קורס אחר אולי", "timestamp": 1645276458173}, {"author": "ל\"א", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות:\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הגבתי כבר על הכל באותו קורס עם 7 בסוף, זה פשוט אותו קורס לחשמל ולמדמח אבל סיומות שונות קורס מגעיל והסגל לא שם עליךלא ממליצה בכלל אם לא חייב לקחת אותו לתואר שלך", "timestamp": 1645460359763}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nחשבתי שמיותר להגיע אבל בדיעבד החל מסיבוכיות (בערך הרצאה 10) כדאי להכנס, במיוחד מי שאין לו רקע.\nאיטית.\n\nשם המתרגל/ת: רועי\nחוות דעת - תרגולים: \nאין עליו , מסביר מעולה ומתכעב על שאלות.\n\nשעורי הבית: \nאחת לשבועיים שיעורי בית, ארוכים מאוד, אם אין רקע מומלץ להקדיש כמה ימים.\n\nהמבחן: \nמהרקע שלמדתם סיבוכיות ורקורסיה תתחילו לפתור מבחנים, זה הסוד. שאלות שבגדול חוזרות על עצמן.\n\nהשורה התחתונה: \nאחלה קורס מאוד נהנתי, מבחן ארוך אבל פתיר", "timestamp": 1645470164922}, {"author": "Daniel Hamzany", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: לא חשובות, העיקר התרגולים\n\nשם המתרגל/ת: יואב פרץ\nחוות דעת - תרגולים: מעולים ומעניינים, מתרגל מעולה עם דרכים יצרתיות להעביר חומר, בנוסף התרגולים שלו היו מוקלטים כך שהיה אפשר בקלות להשלים, עונה על כל השאלות ומסביר מעולה.\n\nשעורי הבית: סהכ מהנים, אבל ההתנהלות של הקורס מאוד לוקה בחסר, דבר שבא לידי ביטוי גם בשיעורי הבית. למשל, באחת המטלות התבקשנו להשתמש בפעולות עזר, ו50% מהציון ניתנו על ה\"סטייל\" של הקוד. כל הקורס בערך איבד נקודות, והתברר שהסיבה היא שהבודק סטייל האוטומטי שבו השתמשו בבדיקה הוריד ציון לפעולות העזר שצוות הקורס עצמו כתב.\n\nהמבחן: הוגן לדעתי, למרות שהיה קצת יותר קשה מבשנים קודמות. כדאי לתרגל שאלות מתחומים שונים, ולהיות מאוד טובים בשאלות בנושאים שתמיד מופיעים במבחן.\n\nהשורה התחתונה: קורס עם חומר מעניין שיכל להיות משמעותית יותר מוצלח, אם לא ההתנהלות המתסכלת של צוות הקורס.", "timestamp": 1645494254610}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מרצה סבבה, מעבירה את החומר בצורה טובה, בדרך כלל מתעכבת ואז יש פיגור בין ההרצאות לתרגול , ובכלל למועד ההגשה של תרגילי הבית\n\n\n\nשם המתרגל/ת: רואי\nחוות דעת - תרגולים: \nמתרגל טוב, אבל מרגיש לי שהוא מאוד מתעכב על דברים, ואז בסוף השיעור רץ על החומר בשביל להספיק הכל, הגענו למצב שלא באמת תרגלנו הרבה תרגילים\n\nשעורי הבית: \nשיעורי בית סבירים , תרגיל בית 3 לוקח הכי הרבה זמן .\n\nהמבחן: חשבתי שאני פותר מבחנים של קורס אחר , עד שהבנתי שאני בקורס הנכון.\nאין באמת קשר בין המבחן למה שהולך בהרצאות או התרגול, רמה שונה לגמרי\n\nהשורה התחתונה: \nקורס מעניין אבל מועבר בצורה נוראית על ידי הסגל", "timestamp": 1645640338786}, {"author": "if and only if", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nמרצה מעולה, מעט איטית אז למי שאין בעיה עם לראות הקלטות עדיף להריץ אותה כדי להעביר את זה יותר מהר.\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: \nמתרגל תותח, אכפת לו מאוד מהסטודנטים ומאוד מתאמץ, קצת מתעכב על תפל לעתים ולא מגיע לתוכן של השיעור אבל אפשר גם להעיר לו על זה והוא מקבל ביקורת מעולה.\nשעורי הבית: \nלא פשוטים בכלל, ברמה יותר גבוהה ממה שעושים בהרצאות ובתרגולים, בתור מישהו שבא בלי רקע, די מזלזלים ורצים מאוד על החומר.\nהמבחן: \nאם השיעורי בית ברמה גבוהה בכמה רמות מההרצאות אז המבחן ברמה יותר גבוהה גם מהשיעורי בית, מלא טריקים מעצבנים שאתה צריך לנסות להבין לבד כי אף אחד לא לימד, אין הסברים לפתרונות של מבחני עבר באתר.\nהשורה התחתונה: הבודקים של השיעורי בית והמבחנים בודקים בצורה מאוד מזלזלת בלי מתן הערות משמעותיות שיוכלו לחזק את הסטודנט ורק זריקת ציון באוויר וציפייה שנתחיל לחפש בעצמנו מה הבעיה שהם מצאו.", "timestamp": 1646063825499}, {"author": "ES", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה מעולה וגם עונה על שאלות בסבלנות, היו קצת עיכובים בקצב הלימוד של החומר אז נדרש שיעור השלמה\n\nשם המתרגל/ת: יואב מתן פרץ\nחוות דעת - תרגולים: מעולה! מסביר מצוין ונותן דוגמאות רלוונטיות, תמיד הייתה אווירה חיובית וקלילה בתרגולים, לפעמים מוצא דרכים יצירתיות להמחיש את החומר הנלמד וזה ממש עוזר. מומלץ בחום!", "timestamp": 1646095751379}, {"author": "אפסי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nבתור מישהו שבא עם רקע מועט מאוד ההרצאות היו מאוד ארטילאיות בהתחלה ומשמימות בהמשך, בערך מאמצע הסמסטר התחלתי לעבור רק על חומר הקורס ונעזרתי בסטודנטים שיש להם רקע בסי כדי להבין את מה שחסר לי. סה\"כ קורס מעניין אפילו שחלק מהנושאים קשוחים להבנה, ממליץ לחסוך את זמן ההרצאות ולעבור על המצגות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nנזערתי בסרטונים של נג'יב ביוטיוב באופן בלעדי אז אין לי מה לרשום על התרגולים.\n\nשעורי הבית: \nלוקחים הרבה זמן, במיוחד התרגיל השלישי, אבל הם מאוד עוזרים ללמוד את השפה. התרגילים ממצים את כל החומר הנלמד וחשוב לעבור על המצגות הרלוונטיות לפני ותוך כדי פתירה של תרגיל בית.\nהמבחן: \nיצאתי מהמבחן בתחושה של 80+ וקיבלתי עובר בקושי (55) אז מומלץ להשקיע בפרטים הקטנים ביותר בפתרון של מבחני עבר, ולבקש הרבה פידבקים מהמתרגלים.\nהשורה התחתונה: \nקורס מעניין, הרצאות מיותרות, נג'יב ביוטיוב ולהשיג פרספקטיבה על אופן בדיקת המבחן.", "timestamp": 1646128007919}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יעל ארז (מוקלטות)\nחוות דעת - הרצאות: \nבאתי בלי רקע בתכנות או ב c ולמרות זאת חלק מההרצאות הרגישו מאוד איטיות, אז העדפתי לראות את המוקלטות ולהריץ מהר את החלקים שבהם היא מתעקבת.\n\nשם המתרגל/ת: רואי בנימין ואחר כך נג'יב\nחוות דעת - תרגולים: \nרואי מסביר טוב אבל מרוב שהוא נחמד הוא כל הזמן עונה לשאלות וזה מקשה אז בשלב מסויים עברתי לנג'יב בפנופטו. הוא מצויין ולדעתי מאוד מומלץ לצפות בו מההתחלה.\n\nשעורי הבית: \nחוץ מתרגיל 3 שהיה נורא וגם פורסם בדיוק בתקופה של הבחני אמצע. שאר התרגיל היו סבירים.\nשימו לב שהסגל של הקורס (לפחות בסמסטר שלנו) היה מאוד מבולגן. היו הרבה שינויים במטלות הגשה, טסטים שנפלו על רווח מיותר בסוף שורה ועוד כל מיני שטויות.\n\nהמבחן: \nאין הרבה קשר בין המבחן לבין המטלות הגשה או החומר שלומדים בסמסטר.\nהדבר היחיד שמכין אותכם למבחן במהלך הסמסטר אלה השאלות מהמבחנים שלפעמים מופיעות בסוף התרגול וגם שם אין את כל הטריקים שתצטרכו לפתרון. בדרך כלל המתרגלים גם בכלל לא מספיקים ממש לעבור עליהן. כדאי בסוף כל תרגול להכנס למצגות ולנסות להבין את השאלות מהמבחנים שיש בסוף. בעיקר באלגוריתמי מיון, בקטרקינג ומחרוזות.\n\nהשורה התחתונה: \nפחות נורא מהקורסים המתמטיים אבל הסגל מבולגן והמבחן לא ממש קשור לחומר - טריקי וכמה רמות קושי מעל.", "timestamp": 1646291526883}, {"author": "אלחנן בלוך", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל / תומר\nחוות דעת - הרצאות:\nהחומר יחסית פשוט. יעל מסבירה היטב, וגם מדגימה בפועל, ותומר רץ על החומר ומספיק יותר.\n\nשם המתרגל/ת: נג'יב ביוטיוב.\nחוות דעת - תרגולים: \nבכיתה אין באמת זמן לחשוב על תרגילים, והמתרגל מראה ישר את התשובה. לכן עברתי ליוטיוב - אפשר להריץ, ומידי פעם לעצור ולנסות לפתור שאלה בעצמי.\nבאופן כללי, ברור שנג'יב תותח!\n\nשעורי הבית:\nדורשים הרבה זמן (ודיבוג ותסכול).\n\nהמבחן:\nלא קל, אבל הוגן. ודי אהבתי את הסגנון של השאלות.\n\nהשורה התחתונה:", "timestamp": 1646602185955}, {"author": "=", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nסבבה לגמרי\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: \nהמתרגל הכי טוב שיש בטכניון!בפער!\nחייב ללכת אליו!!\n\nשעורי הבית: \nחוץ מתרגיל 3 הש\"ב לא לוקחים הרבה זמן, יש הורדת נקודות די מיותרת על style אם לא רושמים כל דבר אפשרי בערך בdefine וכל מיני דברים קטנים שצריך לזכור.\nלמי שאין רקע התרגילים חובה להבנה של החומר, הם בכמה רמות מהתרגולים.\n\nהמבחן: במבחן הראשון שפתרתי, בדקתי אם אני באמת פותר את המבחן של הקורס הזה ולא של קורס אחר.\nמבחן לא קל.\nמצד שני, יש המון מבחנים לתרגל מהם ויש די חזרה על אותם עקרונות של שאלות, אני ממליץ להתחיל לפתור שאלות מבחן אחרי כל נושא שלומדים.\n\nהשורה התחתונה: קורס חובה, למי שאין רקע, ממליץלהשקיע בקורס הזה ולא להשאיר נושאים לסוף.", "timestamp": 1647182854855}, {"author": "Yaniv Slor Futterman", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: לא משהו. קצת סתמית. לא מלמדת עם ענין רב ולא אחראית. היא לא זוכרת איפה עצרנו ולפעמים מתחילה הרצאה ממקום שכבר עברנו. לא מרגיש שעד כדי כך אכפת לה. היא כן ברורה אז לפחות מבינים, אבל זה לא כזה מעניין ואם אתם יודעים כבר תכנות, לא הייתי מגיע לאף הרצאה עד לפחות אמצע הקורס (הייתי מתחיל להגיע רק כשמגיעים לרקורסיה וסיבוכיות, אם בכלל). יעל גם לא מספיקה מספיק מהחומר בשיעורים, ההרצאות תמיד היו בפיגור למול התרגולים.\n\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: סתיו מותק. מסבירה לא רע בכלל, נכונה לעזור ורוצה שנבין באמת. מספיקה את כל מה שרוצה ומספיקה שנעבור על יחסית הרבה תרגילים, שזה מאוד טוב. \nההרצאות לא ממש מומלצות, אבל התרגולים כן. העיקר לתרגל שאלות בעצמכם.\n\nשעורי הבית: \nלוקחים הרבה מאוד זמן. לדעת להתכונן לזה שלפעמים זה ישרוף את כל הסופש. גודל הגליונות משתנה. כולם לוקחים יחסית הרבה זמן, אבל היה אחד באמצע הסמסטר שלקח כמעט פי שתיים מגיליון רגיל. \nכן עוזרים מאוד בתרגול של כתיבת קוד ולמידת החומר, אבל לא עד כדי כך רלוונטי למבחן. \n\nהמבחן: \nבפועל החומר למבחן לא כזה דומה לחומר שנלמד בקורס. המבחנים בכל שנה זהים במבנה שלהם והדרך הכי טובה ללמוד לזה בפער היא פשוט לתרגל כמה שיותר מבחנים משנים קודמות. תמיד יש:\n3 שאלות סיבוכיות (פשוט תתרגול מספיק סיבוכיות עד שתהיו טובים בזה ותדעו לזהות את כל הטריקים השונים שנותנים)\nשאלה אחת לרוב של חיפוש בינארי באופן כזה או אחר\nשאלה אחת לרוב של STRING ועיבוד טקסט או שאלת מיון\nותמיד השאלה האחרונה היא של BACKTRACKING, שזה סוג מסוים של שאלות רקורסיה שלומדים רק בסוף הקורס. עד שמבינים את זה, זה מאוד קשה ומבלבל, אבל אחרי שמבינים זה נהיה יחסית פשוט. שוב, פשוט לתרגל מספיק כאלו עד שתתרגלו לסוג השאלות ותכירו את הטריקים שנותנים.  \n\nהשורה התחתונה: \nאחלה קורס. באמת פרקטי ומכריח אותך לכתוב הרבה קוד (שזה מאוד טוב!) רק ההרצאות משעממות מאוד, שיעורי הבית טובים (לפעמים כיפיים, כמו לתכנת משחק 4 בשורה) אבל ארוכים מאוד, והלמידה למבחן היא דבר אחר לגמרי מהלמידה בהמלך הסמסטר של ההרצאות ושל הגליונות. לקראת המבחן צריך להתמקד ב5 הדברים ששואלים (חיפוש בינארי, אלגוריתמי מיון, שכן צריך לשנן אותם, ניתוח סיבוכיות, עבודה עם טקסט וBACKTRACKING).", "timestamp": 1647350451736}, {"author": "meseri asaf", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: איהאב/יעל\nחוות דעת - הרצאות: \nהתחלתי עם פרונטלי עם איהאב, הבנתי שמיותר ועברתי להקלטות של יעל משנה שעברה. הרצאות ארוכות ומיגעות\nשם המתרגל/ת: הראל/רואי\nחוות דעת - תרגולים: \nעברתי להקלטות של רואי באמצע, שניהם מתרגלים טובים וזה החלק החשוב בקורס\nשעורי הבית: \nארוכים בקטע לא פרופורציונלי והכי גרוע שהם 85 אחוז מיותרים. לוקחים אין ספור שעות ובסוף לא קשורים למה שעושים במבחן. אם הם לא היו תקפים לא היה בשביל מה לעשות אותם.\nהמבחן: \nמזעזע, עדיין לא יודע איך עברתי.\nהשורה התחתונה: \nקורס גרוע שמנוהל גרוע ומרגיש כאילו מעבירים אותו בפעם הראשונה", "timestamp": 1647947794001}, {"author": "תלמידה", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ראובן בר יהודה (יוטיוב)\nחוות דעת - הרצאות: מסביר את החומר בצורה מעולה ואפשר להעביר מהר את החומר ביוטיוב.\n\nשם המתרגל/ת: נג'יב \nחוות דעת - תרגולים: אותה חוות דעת כמו על ראובן\n\nשעורי הבית: חשובים, בעיקר שיעורי הבית האחרונים, לפעמים שאלות המבחן יהיו באותו הסגנון, בעיקר מבחינת הבאקטרקינג.\n\nהמבחן: לא קל, דורש הרבה תרגול.\n\nהשורה התחתונה: הקורס מתחיל קל עבור כל מי שלמד קצת תכנות פעם, אבל מגיעים לנושאים - מיונים, רקורסיה, באקטרקינג, סיבוכיות בהם יופיע שאלות מסובכות במבחן ולכן כדאי לא להיות שאננים ולהשקיע בלמידה והתרגול של הנושאים האלה.", "timestamp": 1648045005559}, {"author": "אלי", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: משעממות, מרדימות, בדיליי מהתרגולים. לפחות בסמסטר שלי אפשר היה לוותר עליהן. אחת לכמה שעות אולי יש איזו הערה רלוונטית.\nאם יש תחליף טוב ליעל- לכו עליו. בסמסטר שלי לא היה. היתה מצידה תחושה של זילזול בסטודנטים (ברמה שחזרה כל תחילת שיעור במשך חצי שעה על חומר שכבר לימדה כי לא טרחה לכתוב את זה לעצמה ושכחה שכבר לימדה, ובכל מקרה אף אחד לא טרח לומר לה כי למדנו הכל בתרגול לפני שבועיים)\n\nשם המתרגל/ת: יואב מתן פרץ\nחוות דעת - תרגולים: סופר נחמד ואנרגטי (סמסטר ראשון שלו בכל זאת). עונה בכיף לכל שאלה. טיפ-טיפה רץ אבל מאפשר לעצור אותו. יש אולי תותחים כבדים יותר.\n\nשעורי הבית: לא ממש יעזרו לכם לעבור את המבחן אבל הם תקפים אז בכל מקרה תעשו. תשקיעו בטסטים. \nמי שנהנה מכתיבת קוד (מקווה שכל מי שלוקח את הקורס) יהנה מהם. לא כבדים ממש ולא דורשים יותר מדי זמן ממי שיש לו קצת רקע.\n\nהמבחן: יש שאלות סבבה ויש שאלות של אללה איסטור. בעיקר צריך להסתגל לצורת החשיבה הנכונה שהצוות מכוון אליה.\nתכתבו הערות וכמה שיותר מהן.\nהבדיקה לא כל כך הוגנת אז אל תוותרו על לעבור על הסריקה ולערער אם אתם חושבים שמגיע יותר.\n\nהשורה התחתונה: סגל קורס- על הפנים. תקוו שלא תצטרכו ממנו שום דבר ותשתדלו להסתדר בכוחות עצמכם. \nתתחילו לתרגל מבחנים כמה שיותר מוקדם כי זה לא דומה לשום דבר שעושים בקורס במהלך הסמסטר.", "timestamp": 1648112042622}, {"author": "REL", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nבזבוז זמן. הקצב נורא איטי (גם של הדיבור), והאולם החשוך מהווה תנאים מושלמים להירדם. לצפות בהקלטות בקצב פי 2 או יותר.\n\nשם המתרגל/ת: רואי בנימין\nחוות דעת - תרגולים: \nמתרגל ממש טוב. מסביר טוב, מתעכב על שאלות ומביא הרבה תרגילים ממבחני עבר. \n\nשעורי הבית: \n5 תרגילים תכנותיים, רובם היו יחסית קלילים חוץ מתרגיל בית 3, שלקח המון המון זמן ובהחלט היה הכי מסובך וארוך. סהכ ציון תקף 10%.\n\nהמבחן: \nטריקי, לא קשור לשיעורי הבית בעליל ובודק בעיקר שינון של האלגוריתמים שלימדו בהרצאות. \n\nהשורה התחתונה: \nקורס סביר, הרגיש שלרוב הסגל לא היה אכפת יותר מידי בלשון המעטה.", "timestamp": 1648323520880}, {"author": "תומר בירן", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מירי\nחוות דעת - הרצאות: חמודה אבל קצת משעממת\n\nשם המתרגל/ת: רואי\nחוות דעת - תרגולים: מדהים אבל עוזב אז לא רלוונטי\n\nשעורי הבית: ארוכים ומייגעים ולא בהכרח קשורים לחומר של הקורס", "timestamp": 1657181123924}, {"author": "Anonymous", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מירי\nחוות דעת - הרצאות: מעולות, אבל אי אפשר ללמוד לתכנת רק מלהגיע להרצאות.\n\nשם המתרגל/ת: מג'ד חורי\nחוות דעת - תרגולים: כאחד שהגיע עם אפס רקע, העדפתי את מג'ד כי הוא מסביר ומתעכב יותר. רוב המתרגלים לוקחים את הקורס כמובן מאליו (כי הרבה סטודנטים מגיעים עם רקע קודם) וזה מתסכל כי קשה לעכוב אחריהם.\n\nשעורי הבית: תורמים להבנת הקורס, אבל הרגישו לי ממש קשים.\n\nהמבחן: הוגן\n\nהשורה התחתונה:  קורס עמוס מאוד למי שמגיע בלי רקע, לכן הייתי ממליץ להכיר דברים לפני. (לומדים שפת C). קורס מעניין מאוד.", "timestamp": 1657447060619}, {"author": "לא יודע מה זה רלוונטי", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "הגעתי עם ידע מקדים וכל ההרצאות וחלק גדול מהתרגולים היו מיותרים לגמרי, כנראה היה עדיף שלא הייתי הולך.\nלמבחן צריך לתרגל כמה ימים כי יש שם דברים לא טריוויאלים בכלל (גם עם נסיון)\nהשיעורי בית פשוט לוקחים קצת זמן, אבל לא נוראיים מידי.", "timestamp": 1658304147064}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מירי \nחוות דעת - הרצאות: מרצה טובה. עודדה שאלות. אבל הרגשתי שאין באמת צורך להגיע לההרצאות. התרגולים מספיקים.    \n\nשם המתרגל/ת: רואי \nחוות דעת - תרגולים: מצויין מאוד. מתעכב ומסביר כמו שצריך ופשוט אפשר להרגיש שהוא רוצה לעזור. \n\nשעורי הבית: חובה. לא קשים מדי... אבל מייגעים מדי  \n\nהמבחן: דורש השקעה לאורך כל הסמסטר. יש לסגור פערים לפני תקופת המבחנים ולא לזלזל. וכן יש לתרגל כמו שצריך לפני המבחן. לדעתי יש להתעכב ולהבין את כל מבחן שפותרים, ולשים דגש על האיכות של הלמידה מכל מבחן שפותרים ולא על כמות המבחנים שפותרים. \n\nהשורה התחתונה: קורס קשה לדעתי, אם משקיעים כמו שצריך משיגים ציונים טובים. הסוד הוא לקודד ככל האפשר. אין ברירה", "timestamp": 1660314693408}, {"author": "anon", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מירי \nחוות דעת - הרצאות: לא באמת הייתי מגיע לההרצאות. לא צריך לדעתי... מספיק לעבור על המצגות לבד ואם יש שאלות אז ללכת לשעות הקבלה.  \n\nשם המתרגל/ת: רואי\nחוות דעת - תרגולים: מצטיין. מתעכב ומסביר ונותן טיפים פרקטיים. \n\nשעורי הבית:  \nלא קשים... כן מייגעים.\n\nהמבחן:\n דורש הרבה השקעה במהלך הסמסטר ולא רק לפני המבחן. לא קשה במיוחד למי שמתכונן היטב.  \n\nהשורה התחתונה: \nקורס פרקטי... יש לקודד הרבה כדי באמת לשלוט בו.", "timestamp": 1665336499409}, {"author": "גלי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעל \nחוות דעת - הרצאות: סך הכל אחלה, מסבירה די טוב ועונה על כל השאלות אם יש. קשה בהתחלה למי שלא למד שפת תכנות מעולם כמוני, אבל סוגרים את הפער יחסית מהר.\n\nשם המתרגל/ת: יואב פרץ\nחוות דעת - תרגולים: מתרגל תותח. נהניתי ממש במהלך הסמסטר וגם חוץ מזה שהעביר את החומר בצורה טובה, הייתה אווירה טובה בשיעור וצחוקים. באסה לכם שהוא לא מתרגל יותר...\n\nשעורי הבית: נוראיים ומזעזעים, במיוחד תרגיל 3 שלוקח מלא זמן ובסופו של דבר נותנים רק 10% תקף מהציון שלכם, לא משקף בכללל את המאמץ ומה שמגיע. מומלץ להיעזר במישהו אם קשה לכם כי בכל זאת כדאי לקבל בזה 100 (אפשר גם לשפר אחרי ההגשה למרות שלוקח להם מלא זמן לבדוק). חוץ מזה שאר התרגילים סבירים, אבל פחות התחברתי.\n\nהמבחן: על הפנים, מאז שעברו למבחן במחשב הוא נהיה יותר קשה ובמיוחד למישהו שלא למד תכנות ואין לו ניסיון של החשיבה הזו למשך הרבה זמן. היה מלא פקטור אז לפחות זה חיפה על זה שהיה מבחן קשה ממש וציונים גרועים. גם מועד א' וגם מועד ב'. \n\nהשורה התחתונה: היה יכול להיות יותר נחמד, סך הכל סביר ובכל מקרה אין מה לעשות זה חובה...", "timestamp": 1667160455696}, {"author": "Adam Liberov", "difficultyRank": 2, "generalRank": 4, "semester": "202103", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מסבירה את החומר היטב אבל יחסית איטית ומשעממת לפי דעתי\n\nשם המתרגל/ת: יואב מתן פרץ\nחוות דעת - תרגולים: מתרגל פצצה חבל שהפסיק לתרגל , אין מה להגיע להרצאות מספיק להגיע לתרגולים מסבירים את החומר מחדש גם ככה\n\nשעורי הבית: די קלים מלבד 3 שסתם ארוך \n\nהמבחן: יותר קשה בפער של כל מה שנעשה בקורס עד כה, והרמת קושי והפאקטור תלויים באיזה מצב רוח קם הסגל היום\n\nהשורה התחתונה: אפילו עם ניסיון לא רע בסי המבחן היה ממש קשה, להתחיל לתרגל מבחנים כמה שיותר מוקדם!!!", "timestamp": 1671963898016}, {"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: טובות\n\nשם המתרגל/ת: איהב ביוטיוב\nחוות דעת - תרגולים: ממליץ מאוד על הסרטונים שלו לכל מי שלא רוצה ללכת לתרגול פיזי\n\nשעורי הבית: חלקם קלים ממש חלקם קשים ממש\n\nהמבחן: לא היה עדיין\n\nהשורה התחתונה: לא לזלזל רק כי קל בהתחלה (למי שבא עם רקע)", "timestamp": 1675617649179}, {"author": "yanis", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: איהב\nחוות דעת - הרצאות: \nמרצה טוב. לא נותנים לו ללמד כלכך.. יש הרבה רעש במהלך ההרצאות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675937168081}, {"author": "O", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nלא עזר לי מאד, קצב מאד איטי ובלי הרבה ערך נוסף.\nאח\"כ עברתי לאיהב שמלמד את אותו הקורס בחשמל וגם יש לו מוקלט, היה הרבה יותר טוב\n\nשם המתרגל/ת: נתי קולר\nחוות דעת - תרגולים: אחלה מתרגל, לפעמים קצת מהיר ומבולגן אבל עושה כיף בתרגולים, עונה בסבלנות.\n\nשעורי הבית: \nיש 5 תרגילים לאורך הסמסטר, שדורשים כתיבת קוד. חלקם מאד ארוכים ומומלץ להקדיש להם זמן בתכנון. \nכמו כן, יש כמות טסטים מצומצמת שהסגל מביא, מומלץ לכתוב בעצמכם/לקחת מהדרייב עוד טסטים כדי לוודא שאתם מכוסים.\n\nהמבחן: \nעוד לא היה\n\nהשורה התחתונה:", "timestamp": 1675955177907}, {"author": "ע", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: לא נכנסתי להרצאות - למדתי הכל מהמצגות.\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא נכנסתי לתרגולים - למדתי הכל מהמצגות.\n\nשעורי הבית: נחמדים ועוזרים בהבנה של החומר. תרגיל הבית בו תכנתנו את המשחק RUSH HOUR היה ארוך מאוד ולקח לי כ-10 שעות, כל השאר פחות.\n\nהשורה התחתונה: אם יש לכם ידע כלשהו בתכנות, אז אין לכם סיבה להיכנס להרצאות או לתרגולים.", "timestamp": 1676819874095}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המתרגל/ת: אוראל אדיבי\nחוות דעת - תרגולים: יודע המון ומעביר הרבה חומרי העשרה, מאוד אוהב את הנושא ומשקיע. עם זאת, לעיתים זה בא על חשבון ההבנה שלי של המצגת עם החומר שאינו העשרה כי לא נשאר זמן אליה.", "timestamp": 1677074270914}, {"author": "..", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: לטעמי קצת משעממת אבל סך הכל היא מרצה טובה שיודעת את החומר מעולה ותמיד זמינה ועונה על שאלות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים התרגיל השלישי קצת ארוך אז לא להתחיל ברגע האחרון\n\nהמבחן: מרגיש שהוא קצת מנותק מהקורס ברמת קושי, רוב הקורס יחסית קליל אבל פתאום המבחן כמה רמות קושי מעל לא לזלזל במבחן ללמוד טוב בקטראקינג כי יכולות להיות שאלות מאוד קשות. \n\nהשורה התחתונה: מקנה בסיס טוב בשפת c", "timestamp": 1678088064063}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעקב בביצנקו\nחוות דעת - הרצאות: \n\nיעקב בחור נחמד, מעשן פרלמנט כשהוא בדד \nאת הנושא הוא יודע מצויין אבל להעביר הוא יודע פחות. \nלא ממליץ ללכת לשום הרצאה. יש מוקלט. עדיף להבין כלום על מהירות של פי 2 מאשר לבזבז 3 שעות כל שבוע על להיות בטלפון בהרצאות. \nהמבחן לא מובן, מסורבל, ורק הגאונים יצליחו לפענח את אשר על ליבו. \nהמון בהצלחה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678978592469}, {"author": "DP", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעל ארז ואחר כך יוסי ויינשטן\nחוות דעת - הרצאות: יעל ארז ממש מרדימה, נרדמתי בשיעור שלה כמה פעמים. היא כותבת קוד בלייב בשיעור אבל הקוד בדרכ ממש לא טוב ולא מעביר את הנקודה. \nאצל יוסי היה יותר קל, מעט מאוד אנשים בשיעור אז היה אפשר לשאול יותר שאלות. יוסי יותר מוצלח, אבל בסוף הסמסטר גיליתי את ההקלטות והתחרטתי שלא למדתי איתם כל הסמסטר.\nבקיצור ממליצה על ההקלטות, אל תבואו להרצאות.\n\nשם המתרגל/ת: הקלטות של נג'יב\nחוות דעת - תרגולים: אין מה לעשות, קשה ללמוד לתכנת בכיתה, אז בסופו של דבר ויתרתי על התרגולים ובסוף הסמסטר השלמתי את החומר עם הקלטות של נג'יב. ממליצה\n\nשעורי הבית: ממש מציקים אבל עוברים אותם. תרגיל פעם בשבועיים בערך. להכין את עצמיכם לתרגיל בית 3 כי תמיד יש לתכנת משחק.\n\nהמבחן: \n\nהשורה התחתונה: קורס נוראי ומציק אבל אין מה לעשות כי הוא חובה. את רובו למדתי עצמאית בחודש האחרון של הסמסטר, הסגל לא הכי קשוב (חוץ מכשזה מגיע להארכות לתרגילי בית, לפחות זה).", "timestamp": 1678978655995}, {"author": "..", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: משעממת מאוד, מי שמגיע עם רקע אין לכם מה לחפש בהרצאות עד אמצע הסמסטר בערך וגם אז תראו הקלטות לא שווה את הזמן שלכם להגיע להרצאות בקורס הזה. \n\nשם המתרגל/ת: אוראל אדיבי \nחוות דעת - תרגולים: רובוט, לא התחברתי\n\nשעורי הבית: דורשים זמן והשקעה, כדאי להשקיע ולעשות בעיקר כי זה ציון תקף אבל גם כדי להתמיע את החומר במהלך הסמסטר, קל מאוד לשכוח מהקורס הזה כשיש את שאר הקורסים של סמסטר א' על הראש.\n\nהמבחן: יחסית קל, אחרי תרגול של מספיק מבחני עבר כל הקונספטים חוזרים על עצמם ולא יוכלו להפתיע אותכם\n\nהשורה התחתונה: התנהלות מביכה מאוד לאורך כל הסמסטר מצד סגל הקורס אבל גם זה קורס חובה ואין מה לעשות", "timestamp": 1679136362174}, {"author": "--", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nהרצאות די יבשות, לא ממש ברור עד אמצע הסמסטר על בכלל בוחנים אותנו\nשם המתרגל/ת: שלי\nחוות דעת - תרגולים: \nמקסימה לגמרי, הסבירה לנו כל מה שצריך (וגם מה שלא) ועשתה כל מה שיכלה כדי לסדר לנו לפחות קצת את החומר\n\nשעורי הבית: \nהשאלה השלישית היתה קשה בהרבה משתי הראשונות, מרחו אותה חצי סמסטר ואז דחפו את השתיים האחרות כבר על תקופת המבחנים.\nהרגשתי שלא נתנו לנו מספיק תרגול רשמי על רוב הנושאים הכי מרכזיים שאחר כך היו בחומר למבחן\n\nהמבחן: \nהשאלה של בקטרקינג היתה יותר מסובכת ממה שנתקלנו עד אז אבל סך הכל הוגן\n\nהשורה התחתונה:\nבאלגן מוחלט, שום דבר לא חד משמעי או ברור.\nנכון שהיו עניינים שאין בהם שליטה (כמו הנפילה של השרתים) אבל גם לפני זה שום דבר לא היה ברור", "timestamp": 1679256045455}, {"author": "מאיה", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: \nאיטי ברמות, תראו הקלטות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהקלטות\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679328183548}, {"author": "צנזור", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: קמפוס IL\nחוות דעת - הרצאות:\nלא הלכתי, חוץ מהרצאה אחת של יעל. היה בסדר אבל מה שיש בקמפוס מספיק והרבה יותר מתומצת, קצר וקולע. בעיניי מי שיש לו רקע מסוים בתכנות יכול להסתפק בסרטונים מהקמפוס. הנושא האחרון (Backtracking) מתומצת מדי בעיניי, חסר עוד קצת פירוט.\n\nתרגולים: לא הלכתי, לא התחברתי למתרגלים, הקמפוס הספיק.\n \nשעורי הבית: 5 מטלות בית, יש מספיק זמן להגיש אותן ולרוב הסגל גם מתחשב בעומס ונותן הארכות. המטלות ברמה סבירה, קצת מאתגרות. אני אהבתי.\n\nהמבחן: הוגן, מתבסס בעיקר על ה3-4 שבועות האחרונים של הקורס.\n\nהשורה התחתונה: קורס חביב בסך הכל.", "timestamp": 1679328395592}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: לא להגיע להרצאות, לראות מוקלט או לראות מצגות. הרצאות זה בזבוז זמן.\n\nשם המתרגל/ת: נג׳יב נבואני מוקלט\nחוות דעת - תרגולים: נג׳יב פשוט מלך, מסביר הכל בצורה מושלמת\n\nשעורי הבית: לא קשים, פשוט הסגל לא סגור על עצמו. הם בודקים לא לפי ההנחיות שלהם וזה לפעמים מעצבן.\n\nהמבחן: המבחן שלנו היה המבחן הראשון שמועבר במחשב. וזה היה פשוט קשה מאוד ביחס למבחנים אחרים. \n\nהשורה התחתונה: לראות הכל מוקלט. ולא לבטוח בצוות הקורס, הם לא בודקים לפי ההנחיות שלהם, הם כותבים שבסקרים שלהם הם מחשבים לפי שיטת מתן ציון ״הניסיון הגבוה ביותר״ ואז מחשבים את הציון לפי ״ניסיון מענה אחרון״.", "timestamp": 1679507781710}, {"author": "נועם קרן", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעל ארז / איהאב הקלטות\nחוות דעת - הרצאות: יעל ארז פשוט לא מצליחה להתרכז בעיקר, הקול שלה מונוטוני מאוד והיא מתעכבת על כל מה שלא חשוב בעיני ומה שחשוב עושה במהירות הבזק (כמו ליטרלי לכתוב קוד שזו כל מהות הקורס) \nיש הקלטות למיניהן של איהאב, אותן אהבתי מאוד אבל קשה להבין את הסדר שלהן ואם הן מכסות הכל.\n\nשם המתרגל/ת: אוראל מוקלט\nחוות דעת - תרגולים: הגעתי אליו בלייב והיה לי ממש קשה להתרכז, במוקלט הוא מעולה, עובר על כל החומר.\nהבעיה העיקרית בלייב זה שנדמה שהוא מדבר בעיקר לעצמו אבל בהקלטה שומעים את זה טוב ורואים את המצגת ולכן זה ממש סבבה\n\nשעורי הבית: לוקחים זמן אבל סבילים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679652049941}, {"author": "lifo~", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל+ איהאב(שניהם מוקלט)\nחוות דעת - הרצאות: מסבירים את כל החומר בצורה טובה מאוד, איהאב פותר יותר דוגמאות בהקלטות שלו שתורמות להבנת החומר. \n\nשם המתרגל/ת: נג'יב מוקלט\nחוות דעת - תרגולים:  ההקלטות של נג'יב פשוט מעולות!\n\nשעורי הבית: לא קשים מדי, חוץ מתרגיל 3 שדרש ממני המון עבודה. \nהם עוזרים להבנת החומר לכן ממליץ לפתור לבד\n\nהמבחן: המבחן היה סבבה, חוץ משאלת ה Backtracking, שם הסתבכתי רצח, מקווה שיהיה פקטור:(\n\nהשורה התחתונה: קורס מעניין, למי שאין רקע לא לפחד, זה אפשרי, פשוט צריך לעבוד קצת יותר חזק.", "timestamp": 1679898912183}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעל מוקלט\nחוות דעת - הרצאות: \nההרצאות עוזרות קצת בהבנת החומר אבל לא חובה ולא הכי קריטי אם רק הולכים לתרגולים כל הזמן\nשם המתרגל/ת: \nנגיב מוקלט\nחוות דעת - תרגולים: \nאחלה מתרגל. \nשעורי הבית: \nלא הכי קשים \nהמבחן: \nאם מתרגלים מספיק זה סבבה. אז פשוט לפתור כמה שיותא מבחנים ואתם מסודרים \nהשורה התחתונה: \nלא קורס קל אבל ניתן לקבל ציונים טובים.  ההנהלה של הקורס הייתה גרועה והיו הרבה בלגנים כל הזמן ובמיוחד לקראת המבחן עם הבלגן של הפריצה כי המבחן הוא על המחשב.", "timestamp": 1680203438014}, {"author": "מייק אוקסלונג", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nהרגיש שנותנים קצת יותר מדי פוקוס על דברים שוליים שלא רלוונטיים לתרגילים או למבחן (וחלק גל לא לתכנות בכללי), אבל בסך הכל בסדר.\nהגעתי לכל ההרצאות אבל בכולן הייתי רק חצי מרוכז ועשיתי דברים אחרים, ובדיעבד היה עדיף לוותר על ההרצאות (לפחות בחצי הראשון), למרות שזה עזר להבין את העקרונות של C. אני חושב שאנשים עם רקע תכנותי, בעיקר אם זה ב C, יכולים בכיף להרשות לעצמם לפספס את החצי הראשון של הסמסטר.\n\nשם המתרגל/ת: נתי קולר\nחוות דעת - תרגולים: \nנתי מתרגל ממש אחלה. עובר בפירוט על הרבה תרגילים, ומסביר גם את צורת החשיבה בשביל להגיע לפתרון, ותמיד מתעכב אם משהו לא מובן. התרגולים יותר רלוונטיים למבחן מההרצאות אז לדעתי כדאי כן להגיע, גם אם זה רק להקשיב תוך כדי שעושים תרגילי בית או גיליונות בקורסים אחרים.\n\nשעורי הבית:\nדי סבבה, מתוך 6 תרגילים היו 2 או 3 ממש בדיחה לכל אחד שיודע תכנות בסיסי, וגם תרגיל 3 שאומרים שממש משחיר לא כזה נורא. יום או יומיים בסופ\"ש וסיימתם. כן כדאי להשקיע בתרגילי בית כי ככה מתרגלים לכתיבת קוד. \n\nהמבחן: היה ממש סבבה, רמה זהה למבחנים קודמים, ובאופן כללי הרמה מרגישה קבועה משנה לשנה. גם העקרונות של התרגילים ממש חוזרים על עצמם, ככה שאחרי תרגול של 6-7 מבחנים אפשר כבר להרגיש את החזרתיות ולהסתדר עם המבחן לא רע. היה קצת בלגן לפני המבחן (כל השרתים נפלו) אבל בתכלס זה בא לטובתנו- היה הרבה זמן ללמוד ויכלנו לכתוב בקומפיילר חיצוני. גם ה VPL סבבה אז אם היינו צריכים לכתוב במודל זה לא היה מפריע יותר מדי.\n\nהשורה התחתונה: אין ספק שלאנשים עם רקע בתחום יהיה הרבה יותר קל, אבל גם אנשים שלא כתבו שורת קוד בחיים יכולים להצליח, אם כי יצטרכו לעבוד הרבה יותר קשה, כי די רצים על החומר. בסך הכל קורס די סביר שחשוב לעשות בתחילת התואר.", "timestamp": 1680203740700}, {"author": "מישהו", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מירי\nחוות דעת - הרצאות: חמודה מאוד, עוצרת לכל שאלה וממש אפשר להבין הכל. לקראת המבחן הגעתי לשעות קבלה שלה כי יעל ארז הפחידה אותי. \n\nשם המתרגל/ת: מג'ד חורי +יואב פרץ\nחוות דעת - תרגולים: הייתי אצל מג'ד בהתחלה, כדי להבין את החומר אבל כשהתחלתי יותר לא להבין את החומר ולא להצליח לפתור שאלות הגעתי לשעות הקבלה של יואב ולא רק שהוא מאמי ממש, גם רואים שהוא יודע את החומר ממש טוב.\n\nשעורי הבית: תרגיל בית 3 היה ארוך ועמוס אבל כל השאר ממש סבבה\n\nהמבחן: היה במחשב שאלות באמת הכי קלות שפגשתי. ועוד נתנו 10 נקודות פקטור.\n\nהשורה התחתונה: הכי בייסד שראיתי", "timestamp": 1688919284338}, {"author": "אביב", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: יעל ארז טובה לדעתי, למרות שמי שלא יודע לתכנת יתקשה לעקוב.\n\nשם המתרגל/ת: אלעד גרוס\nחוות דעת - תרגולים: מתרגל טוב ואחלה בן אדם.\n\nשעורי הבית: יש 4 בסמסטר, לפעמים נחמד לפעמים מאוד מציק.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713190610720}, {"author": "-", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: איהאב\nחוות דעת - הרצאות: \nכולם מקריאים גם בהרצאות וגם בתרגולים מאותן מצגות ממוחזרות, בלי הרבה מעבר\nשם המתרגל/ת: נתי\nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשים ביחס להרצאות ולתרגולים, הרבה ציון תקף על עבודות בית יחסית לקורסים אחרים בסמסטר א\nהמבחן: \nעוד לא היה\nהשורה התחתונה: \nקורס מועבר בצורה לא טובה, עדיף לכם ללמוד C לפני הלימודים כמה שיותר", "timestamp": 1714978696541}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יוסי ויינשטיין\nחוות דעת - הרצאות: יוסי מלך, הוא מסביר את החומר מאוד טוב ורגוע, ולמרות זאת מספיק להכניס גם חומר להשערה ובדיחות (למרות שלא כולם מתחברים להומור שלו, אבל מי שכן מרוויח).\nרק עם סיבוכיות הייתה לי בעיה כי פשוט לא מלמדים את זה בהרצאות (והתסכלתי גם על ההרצאה של יעל לוודא), צריך לחפש פתרונות לתרגילים ממבחנים, ואין בפתרונות של המבחנים הסברים אבל מישהו העלה קובץ מדהים לדרייב עם הסברים, בזכותו אני יודע סיבוכיות, ממליץ לכם ממש.\n\nשם המתרגל/ת: תמיר שור (אבל לא באמת הלכתי)\nחוות דעת - תרגולים: אני לא יודע אם זה תמיר או כל המתרגלים אבל בגדול התרגולים בקורס הזה לא טובים, פשוט רצים על תרגילים בלי באמת לעבור על הקוד, ומסיימים 40 דקות לפני הזמן ומשחררים אותנו.\nשמעתי גם מאחרים שהתרגולים שהם הולכים אליהם לא טובים אז פשוט ויתרתי על זה.\nכשהוא מסביר אז הוא מסביר ברור אבל פשוט לא הלכתי לתרגולים גם ככה זה לא עזר.\n\nשעורי הבית: לכל מי שיש לו קצת רקע בתכנות (גם בגרות במדמ\"ח זה מספיק) השיעורי בית יהיו ממש לא עמוסים.\nשמתי 2 כוכבי עומס כדי לאזן עם אלה שאין להם רגע ואז הם סובלים הרבה יותר :(\nדרך אגב השיעורי בית הם תקף ולא מגן אז חייבים להגיש אותם, וצריך להגיש את כולם אין רק את הX הכי טובים או משהו כזה.\n\nהמבחן: מצד אחד יחסית הוגן, מצד שני ההוראות לא טובות\nעוד לא קיבלנו ציונים אז אני לא יודע אם מתייחסים לזה או לא אבל אנשים ששאלו את הסגל קיבלו עוד הוראות שלא הופיעו בטופס (למשל דרישות שמסתבר שצריך אבל לא מופיעות בטופס)\n\nהשורה התחתונה: לדעתי הקורס לא טוב, ואני מאוד אוהב לתכנת ובכללי ממש מרוצה מהלימודים בטכניון.\nהנקודה הכי בעייתית היא שכל מי שאני מכיר שהגיע בלי רקע בתכנות פשוט סבל מהקורס הזה ואני ממש מבין אותם.\nאם אין לכם רקע בתכנות אני ממליץ לכם בחום ללמוד C לפני שאתם מגיעים לקורס, יש את הקורס בCampusIL וביוטיוב, ההקלטות האלה מעולות.\nובלי קשר לזה התרגולים לא טובים, השיעורי בית הם תקף וצריך להגיש את כולם, מחזירים ציונים על התרגילי בית ממש מאוחר (למרות שזאת בדיקה אוטומטית בכלל), חוץ מהשיעורי בית יש גם רפלקציות ושאלונים מעצבנים שצריך לענות עליהם אחרת יורד ציון, יש עוד אבל נראה לי שהבנתם את הפואנטה.\nלמי שזה קורס חובה אז אין מה לעשות, רק מאוד חשוב שתלמדו C אם אין לכם רקע בתכנות. \nאם הוא לא חובה בשבילכם ויש לכם אפשרות ללמוד קורס אחר אז לדעתי עדיף.\nובשביל לסיים בחיובי, יוסי מלך והרבה מרוצים גם מיעל, ולתכנת זה ממש כיף ויוצא כבר על הסמסטר הראשון.", "timestamp": 1715289340469}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  יעל ארז\nחוות דעת - הרצאות: \n!!לא להגיע להרצאות של יעל!!\nהבן אדם הכי מרדים שפגשתי. בדיעבד כל ההרצאות הן זמן מבוזבז.\nיש לה כישרון מיוחד לקחת דברים פשוטים להבנה ולסבך אותם מאוד עד כדי שזה לא מובן בכלל.\n\nשם המתרגל/ת: - \nחוות דעת - תרגולים: \nלא הלכתי לתרגולים חוץ מפעם אחת אצל צביקה - היה נורא, אי אפשר לחייך בלי שהוא עוצר את השיעור ומעיר לך, מאוד לא נעים.\nלקראת המבחן ראיתי תרגולים של אוראל ואת השעת קבלה שלו וואוו 10/10 סגר לי פינות.\n\nשעורי הבית: \nהתרגילי בית היו מנוסחים בצורה מזוויעה ומכשילה, זה הרגיש כאילו בוחנים את הבנת הנקרא שלי ולא את ההבנה שלי של החומר... אבל ברגע שמבינים מה הם רוצים ממך אז הפתרון בסדר ולא מסובך.\nתרגיל בית 3 לא קשה כמו שכולם מאיימים פה בביקורות אבל הוא כן לוקח הרבה זמן אז קחו את זה בחשבון.\nקצת חבל שתרגילי הבית קלים מאוד ביחס למבחן - בתקופת מבחנים מקבלים קצת שוק מהפער בהתחלה.\n\nהמבחן: \nהיה קצת טריקי אבל בסוף היה סבבה לגמרי, הסיבוכיות היתה קצת קשה אבל לא נוראית.\nהטריקים במבחנים חוזרים על עצמם מאוד זה תמיד פחות או יותר אותו פתרון והולכים לפי הסיבוכיות.\n\nהשורה התחתונה: \nמי שלא יודע תכנות מלפני יצטרך לעבוד קצת קשה בהתחלה כי הם רציםםם על החומר, מי שכן יודע לתכנת - עדיף לדעתי לא לבוא להרצאות וללמוד את החומר לבד בבית עם הקלטות.\n\nלקורס יש הרבה פוטנציאל והוא חשוב להמשך אבל מועבר בצורה נוראית.\nאבל זה קורס חובה ואין לנו ברירה אז יהיה בסדר :)", "timestamp": 1715290512419}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יוסי ויינשטיין\nחוות דעת - הרצאות: לא הלכתי להרצאות אבל השלמתי מההקלטות קצת דברים שהיו חסרים לי והוא מסביר נהדר.\n\nשם המתרגל/ת: אוראל אדיבי\nחוות דעת - תרגולים: הלכתי לתרגולים רק בשליש האחרון של הקורס, בסך הכל אוראל אחלה של מתרגל, לפעמים מרגיש לי שקצת מורח אבל בגדול מעביר טוב את החומר.\n\nשעורי הבית: על הפנים. כל שאלה זה מגילה של הוראות, יותר קשה להבין מה רוצים שאני אעשה מאשר לפתור בפועל את השאלה. תרגיל בית 3 לא באמת קשה, אבל מאוד ארוך שלא לצורך.\n\nהמבחן: אותה בעיה כמו השיעורי בית, הרבה יותר מדי הבנת הנקרא.\n\nהשורה התחתונה: קורס גרוע מאוד, דרך נוראית ליצור הכרות ראשונה עם התחום לכאלו שבאים לתואר בלי שום רקע.\nשיעורי הבית במהלך הסמסטר ברמה מאוד נמוכה ולא קשורים בכלל לרמה של המבחן, ההבדל ממש קיצוני.\n\nמי שמגיע לתואר ללא רקע בכלל בתכנות אני ממש ממליץ ללמוד קצת לבד לפני תחילת הסמסטר, זה יקל משמעותית על כל הסמסטר ויאפשר להתמקד יותר בקורסים המתמטיים.\nאלו שמגיעים עם רקע לא לזלזל בקורס, המבחן בסוף יותר קשה מהרמה שהם מציגים במהלך הסמסטר.", "timestamp": 1715638005250}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: ההרצאות של מבוא למדמ\"ח משעממות מאוד. במיוחד לאנשים בעלי רקע תיכוני, חצי קורס מדברים על כלום ושום דבר, ואז מגיע פיק ריצה על נושאים קצת יותר סבוכים שעוברים באותה רמת שעמום וניתוק מהמציאות. עוברים על מצגות בצורה מרדימה, לא רואה סיבה ללמוד תכנות ככה.\n\nשם המתרגל/ת: סער צור שדי\nחוות דעת - תרגולים: הגעתי רק בחלק השני, סער חמודה ומשתדלת להסביר לכולם עד שיבינו, עשה רושם שלא הספקנו את כל מה שהיה במצגות (אולי רוחבי לכלל המתרגלים והמצגות עמוסות מדי, לא יודע), בכל מקרה - גם פה, זה מצגות ללא הרבה ערך מוסף.\n\nשעורי הבית: תלוי ברקע שאיתו אתה מגיע, אני חושב שאם אתה סטודנט ללא רקע תכנותי בכלל שיעורי הבית די מאתגרים, כבעל רקע תיכוני הם לא דרשו ממני יותר מדי זמן.\n\nהמבחן: קשה, רמת המבחנים לא תואמת לא לתרגולים ולתרגילי הבית, יש צורך במרתון לפני המבחן כדי לראות את כל הטריקים והשיטות כי הם חוזרים על עצמם.\n\nהשורה התחתונה: קורס חובה אך מנוהל בצורה בזיונית, מועבר בצורה לא מעניינת ולא מלמדת, מצאתי את עצמי לומד הכל מהיוטיוב, ממליץ בחום ללמוד C ואת כל החומר של הקורס לפני תחילת הלימודים, יחסוך לכם המון זמן בסמסטר שגם ככה עמוס. עושה רושם ראשוני די רע לפקולטה.", "timestamp": 1716305448488}, {"author": "Yuval", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רמי - הקלטות בקמפוסIL\nחוות דעת - הרצאות: קצרות ולעניין, אבל חסרות לפעמים מרגיש שחסרות עוד דוגמאות.\n\nשם המתרגל/ת: נג'יב - הקלטות ביוטיוב\nחוות דעת - תרגולים: אחלה.\n\nשעורי הבית: בינוניים, לפעמים קצת ארוכים מעבר למצופה. קיים פער מסוים בין מה שמועבר בכיתות לבין השיעורי בית אז שווה להתכונן לזה.\n\nהמבחן: הוגן.\n\nהשורה התחתונה: אומרים שמתאים לחסרי רקע בתחום ושהפערים נסגרים מהר מאוד, לא יודע כמה זה באמת נכון. באמת מלמדים מאפס אבל הקצב די מהיר ומצפים לרמה יותר גבוהה מהתחלתית, ובאמצע הסמסטר מגיעים לנקודה שבה לכאורה מי שחסר ומי שעם רקע נמצאים ביחד בחומר, אבל מי שעם רקע פנוי להתעסק בחומר חדש ומי שלא עוד מתעכב על דברים קודמים. בקיצור, למי שאין רקע ממליץ ללכת לקורס הכנה (אם יש) או להתחיל ללמוד את הקורס מלפני ולפתור תרגילים פשוטים כדי להתחיל לתרגל בעיקר את החשיבה.", "timestamp": 1716486328339}, {"author": "אין", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: איהאב וותד\nחוות דעת - הרצאות: איהאב מרצה מעולה, מאוד שולט בחומר ועונה על שאלות.\n\nשם המתרגל/ת: נגיב מוקלט\nחוות דעת - תרגולים: הלכתי כמה פעמים לתרגולים פרונטליים, הרגיש לי בזבוז זמן. התרגולים המוקלטים של נגיב מעולים\n\nשעורי הבית: דורשים השקעה והבנה של החומר.\n\nהמבחן: אני הרגשתי שהמבחן היה דיי פייר אך הרוב אמרו שהיה הרבה יותר קשה ממבחני עבר, שיטת הבדיקה שלהם קשוחה מאוד מאוד. מורידים מלא ציונים על כל טעות קטנה או אי עמידה בדרישות\n\nהשורה התחתונה: קורס שצריך להיות אחלה, אך סגל הקורס עושה אותו הרבה יותר מסובך ומעצבן, למי שיש רקע בתכנות זה קורס קליל, אך למי שלא אז הולך להיות מאתגר במיוחד עם הסגל הנוכחי.", "timestamp": 1716503738486}, {"author": "פסגותניק אלמוני", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לא הלכתי להרצאות\nחוות דעת - הרצאות: ממה שהבנמתי מחברים, היו הרבה תקלות טכניות אצל יעל ארז.\n\nשם המתרגל/ת: אלעד גרוס\nחוות דעת - תרגולים: מתרגל ממש נחמד, מעביר את החומר בצורה טובה.\n\nשעורי הבית: קלים\n\nהמבחן: נחמד ממש\n\nהשורה התחתונה: קורס שהחומר בו מאד בסיסי, לא קשה בכלל, וחשוב. \nאבל - הקורס מועבר בצורה מזעזעת, המון כשלים טכניים, המון דברים לא ידועים, ופשוט הקורס מתנהל זוועה.", "timestamp": 1717501735526}, {"author": "נפגע מבוא למדמ\"ח", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מוקלט יעל ארז\nיעל מרצה אחראית נוראית בכל הקשור לבניית המבחנים ואדמיניסטרציה כללית של הקורס, אבל המוקלט שלה סבבה לגמרי ומובן - אישית ציפיתי בה על כפול 2 כי היא מדברת לאט. להגיע פרונטלי בקורס הזה בעיני ביזבוז זמן ומיותר לחלוטין.\n\nשם המתרגל/ת: נג'יב נבוואני ביוטיוב\nחוות דעת - תרגולים: נג'יב מעבר למצוין אין מה להוסיף, אני מאמין שהרוב לומדים ממנו.\n\nשעורי הבית: בגדול כל התרגילים (חוץ מתרגיל בית 3 שנכתב על ידי השטן בכבודו ובעצמו ונועד לשרוף לכם זמן) קלילים ודי זורמים - ואני אומר את זה בתור אחד שהגיע בלי רקע בתכנות בכלל. התרגילים בעיקר נועדו לכך שתתנסו יותר בתכנות hands on - כל קשר בין מה שתראו בתרגילי בית למה שתראו בבחינה הוא מקרי בהחלט.\n\nהמבחן: אני לא חושב שזה סביר לפתור את המבחן על מלא ברמה של לפחות להצליח את כל הטסטים הגלויים ב3 שעות - זה באמת כלום זמן גם למועדים שיש בהם שאלות הוגנות, מה שבדרך כלל לא המצב - תמיד יש לפחות שאלה אחת שדורשת איזה טריק הרבה יותר יצרתי שאם לא ראית אותו לפני היא תשתה לך המון זמן מהמבחן או שלא תצליח אותה בכלל. אם אתה סטודנט שהגיע בלי רקע ואתה לא זכאי להארכת זמן - כנראה שנדפקת אלא אם כן יהיה לך מזל או שאתה עילוי.\n\nבעיניי זה שהמבחן על מחשב עם גישה לאינטרנט זה בגדר בדיחה - זה ברור לי שיש המון סטודנטים שכנראה נעזרים בGPT או מיליון ואחת דרכים לרמות בבחינה כשיש לך פאקינג גישה מלאה לאינטרנט, יוצר מצב מאוד לא הוגן כלפי סטודנטים שהם כן הגונים ולא ירמו למרות שלדודות שמביאים אין חצי מושג במה אתה מתעסק במחשב.\n\nממליץ בחום לעשות הכל, אבל באמת הכל, כדי לגשת ולסיים עם הקורס הזה במועד א', יכול להעיד על הסמסטר שלי לפחות, שהבדל הרמות בין מועד א' למועד ב' היה פשוט מטורף - ניגשתי למועד ב' כדי לשפר ציון סביר מינוס שקיבלתי במועד א' וכנראה שרק החמרתי את המצב - כמובן הודות ליעל ארז שפשוט החליטה לקיים טבח במועד ב' ההזוי הזה.\n\nהשורה התחתונה: בסוף מדובר בקורס סופר בסיסי וחשוב, זה אלפבית של מדעי המחשב ממש - לומדים לראשונה אלגורתמים בסיסיים, את כל הקונספט של סיבוכיות, רקורסיה ובקטרקינג וכולי, וגם מקבלים ניסיון ראשוני בתכנות דרך שיעורי הבית. לצערי הבחינה מאוד לא הוגנת. יש הרבה דיבור סביב זה שביחס לשאר הקורסים של סמסטר א במדמ\"ח זה הקורס הכי קל - זה חד משמעית חרטא אחת גדולה, הקורס הזה לדעתי הקורס הכי קשה בסמסטר הראשון, בעיקר בעיקר למי שמגיע בלי רקע מהתיכון - הוא דורש צורות חשיבה אחרות לגמרי, לפתח חשיבה אלגורתמית ורקורסיבית וללמוד יסודות של C זה לא משימה טריוויאלית בכלל לפרק זמן של סמסטר אחד (בכל שאר הקורסים שלי לא ירדתי מ95 ומבוא יש סיכוי לא קטן שאפילו לא עברתי אחרי המועד ב' הלא הגיוני הזה).", "timestamp": 1717546771586}]}