{"posts": [{"author": "YV", "semester": "201901", "text": "הקורס לא קל, יש שימוש נרחב באלגברה א (חוזרים על חלק מהחומר בקורס). שיעורי בית לא קלים אבל גם לא כלכך עמוסים.", "timestamp": 1590923923000}, {"author": "SR", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "קורס לא פשוט עם המון חומר. הרבה פעמים במהלך הסמסטר הרגשתי שאני הולך לאיבוד, אבל איכשהו אחרי שפותרים את תרגילי הבית זה יותר מסתדר. מאוד ממליץ לפתור אותם אפילו שהם ארוכים רצח.\nהמבחנים בשנים האחרונות הולכים ונהיים קשים יותר.", "timestamp": 1596485910000}, {"author": "M", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "קורס יחסית קליל למי שלוקח אותו בשלב מאוחר יחסית בתואר, מהווה המשך ישיר ופרקטי של אלגברה. ש\"ב שבעיקר יבשים וממש לא עמוסים, מה שכן המבחן קצת נהיה קשה יותר בסמסטרים האחרונים אז צריך לבוא מוכן באמת.", "timestamp": 1597736343993}, {"author": "מיכאל", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: מעולות\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים:  מעולים\n\nשעורי הבית: סביר\n\nהמבחן: זוועה לא נורמלית\n\nהשורה התחתונה: זה קורס חובה, אז לקחת אותו.", "timestamp": 1597759169984}, {"author": "ANON", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: מיקי אלעד (מוקלט)\nחוות דעת - הרצאות: סביר, חומר משעמם אבל איתו קצת פחות משעמם\n\nשם המתרגל/ת: מיקי אלעד (מוקלט)\nחוות דעת - תרגולים: כנ\"ל\n\nשעורי הבית: ארוכים, אבל טובים להבנה\n\nהמבחן: סיוט\n\nהשורה התחתונה: לא הקורס הכי מעניין, חומר די גדול, לא לקחת בסמסטר שני", "timestamp": 1600186924155}, {"author": "Eyal", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: הרבה חומר, לא קל אבל מאוד מעניין.\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: בעיקר עושה חזרה על ההרצאה ולא מראה דוגמאות פרקטיות לפתרון תרגילים שיש בשיעורים או במבחן. עדיף לראות הרצאות שלו ותרגול של משהו אחר.\n\nשעורי הבית: חשובים מאוד להבנת החומר. בינוני פלוס.\n\nהמבחן: זוועת עולם, אבל לפחות לא הוגן.\n\nהשורה התחתונה: קורס עם חומר מאוד מעניין, אבל מבחן קשוח.", "timestamp": 1601573994938}, {"author": "hod badichi", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: עירד יבנה\nחוות דעת - הרצאות: \nלראות את מיקי בוידאו\n\nשם המתרגל/ת: איתי עברון\nחוות דעת - תרגולים: \nחשובים להבנת החומר , בעיקר לפני גליונות.\nלראות את מיקי בוידאו + חיזוקים בתרגולים\n\nשעורי הבית: \nגליונות לא קשים אבל מאוד עמוסים , עוזרים להבנת החומר.\n\nהמבחן: \nלצערי לא היה קשר בין המבחן לחומר הנלמד \n\nהשורה התחתונה:", "timestamp": 1603269838983}, {"author": "Ido", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nההרצאות של מיקי מצוינות, מיקי מרצה בחסד.\n\nשם המתרגל/ת: מיקי + איתי עברון\nחוות דעת - תרגולים: \nסמסטר קורונה, ראיתי את התרגולים המוקלטים של מיקי, ולאחר מכן את התרגולים בלייב של איתי עברון להעמקת הידע בנושאים החשובים.\n\nלדעתי התרגולים של מיקי, קצת פחות רלוונטים (בחלקם המועט יש חומר שמוצג רק שם ולא בהרצאות), אבל ברוב הזמן יש דמואים ודוגמות שקצת פחות רלוונטיות למבחן, מספיק להבין באופן כללי את המטרה (אין צורך להתעמק בקוד וממש להבין אותו ).\n\nממליץ בחום ללכת גם לתרגולים בלייב של המתרגלים, עושה הרבה סדר בראש, ואיתי מתרגל מעולה.\n\nשעורי הבית: היו 4 גליונות בזוגות, לא קשים במיוחד\n\nהשורה התחתונה:  קורס מאוד מהנה, בהתחלה קצת עמוס עד שנכנסים לקצב ואז די רגוע במהלך הסמסטר.", "timestamp": 1612530307549}, {"author": "Aviram Shovali", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: תותח על - מרצה בצורה מעניינת ומהפנטת\n- לראות את ההקלטות\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: לראות את ההקלטות \n\nשעורי הבית: מחברות לחומר ומכינות למבחן בצורה טובה\n\nהמבחן: סמסטר קורונה -- מבחן אמריקאי 10 שאלות הוגן לחלוטין.\nבסמסטר הזה היה גם בוחן אמצע של 25% מגן\n\nהשורה התחתונה: \nבין הקורסים המעניינים שלקחתי, הרבה עבודה עם מטריצות ומתמטיקה", "timestamp": 1614100848435}, {"author": "YT", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: ההקלטות שלו מדהימות, באמת מרצה בחסד ואיכשהו מצליח להפוך את הקורס הזה לקצת מעניין, למרות שהחומר לדעתי ממש לא.\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: גם מוקלטים. מלא מלא מלא מלא DEMOS מיותרים, לא רלוונטיים, פשוט תדלגו. חוץ מזה רוב התרגול חזרה על ההרצאה, כך שלא מרגיש יעיל מדי. \n\nשעורי הבית: רק 4 גיליונות בסמסטר שזה ממש אחלה, לא דורשים המון השקעה וגורמים לך לא לשכוח מהקורס. היה לנו 15 אחוז מגן גיליונות+ בוחן לא קשה במיוחד 25 אחוז.\n\nהמבחן: פשוט מוזר, מרגיש מנותק מהקורס. היה לנו אמריקאי שלא בדק שום ידע כך שלא היה איך ללמוד והרגיש כמו מילוי טופס לוטו. בקיצור, בסמסטר שלנו היה צריך הרבה מזל\n\nהשורה התחתונה: קורס בסדר, חבל שהוא שם דגש כל כך גדול על אלגברה למרות שזה קורס של מדמח. די מתסכל במיוחד הנושאים בסוף אבל נסבל סך הכל. יש יותר גרועים.", "timestamp": 1614101726506}, {"author": "מבין עניין", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיקי אלעד\n\nחוות דעת - הרצאות: \nאיש יקר. תמיד מראה בתרגולים דוגמאות פרקטיות לחומר התיאורטי. לדעתי הוא אחד המרצים הטובים בטכניון.\n\nשם המתרגל/ת: איתי אברון\n\nחוות דעת - תרגולים: \nמתרגל מצוין. שם דגש על הדברים החשובים למבחן ותמיד עונה לשאלות ואפילו מרחיב עליהן. בתרגולים שלו הוא לפעמים מביא הסברים לחומר מנקודת מבט קצת שונה. רואים שממש אכפת לו מהסטודנטים. אפילו בשעת הקבלה לקראת מועד א הוא הביא כל מיני שאלות ברמת מבחן ופתר איתנו ביחד. תלכו אליו, מבטיח שלא תצטערו.\n\nשעורי הבית: \n4 גיליונות בזוגות שמקיפים את החומר הנלמד, לא קשים אבל לוקחים כמה ימים אם אתם פותרים הכל לבד.\n\nהמבחן: \nהסמסטר היה מבחן אמריקאי, אבל באופן כללי צריך להבין את החומר התיאורטי ממש טוב (כמו באלגברה א'), ולעשות כמה מבחני עבר בשביל להבין קצת את הטכניקה. אם אתם על החומר כל הסמסטר, לא תהיה בעיה לקבל ציון גבוה.\n\nהשורה התחתונה: \nמרגיש כמו קורס המשך לאלגברה א' אבל הרבה יותר פרקטי. מי שמתעניין קצת במערכות לומדות יאהב את הדוגמאות בתרגולים של מיקי. בסך הכל קורס מאוד חביב.", "timestamp": 1614157105527}, {"author": "I", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "קורס חמוד, המון הגדרות ואלגברה אבל מבחן לא קשה.\nקורס חובה, תרגילי הבית לא עמוסים מדי (הגשה בזוגות, כ6 שעות לכל שותף אם מחלקים עבודה)", "timestamp": 1614529427246}, {"author": "י", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: מעולה - מעביר את החומר בצורה ממש טובה ומעניינת תוך שילוב הדגמות חיות.\n\nשם המתרגל/ת: מיקי אלעד + איתי עברון\nחוות דעת - תרגולים: במהלך הסמסטר ראיתי את התרגולים המוקלטים של מיקי, שהם טובים כחזרה על ההרצאה ומשלבים הדגמות מאוד יפות שכדאי לראות. אבל, בשביל תרגול ״קלאסי״ יותר שעובר על הדברים שיותר חשובים לשיעורי הבית ולמבחן, כדאי לראות גם את התרגולים של איתי. ראיתי אותם במרוכז לפני המבחן, והם עזרו לי מאוד.\n\nשעורי הבית: 4 גליונות להגשה בזוגות, די ארוכים ולא פשוטים למי שלא סגור עדיין על החומר. חוץ מזה, היה גם בוחן אמצע לא קשה, שמאוד עזר להטמיע את החצי הראשון של הקורס.\n\nהמבחן: מבחן אמריקאי במודל, 10 שאלות ב-90 דקות. השאלות היו ברובן תיאורטיות ובדקו הבנה של הניואנסים הקטנים של ההגדרות והמשפטים. לדעתי המבחן היה הוגן בסך הכל.\n\nהשורה התחתונה: קורס מעניין, אבל עמוס מאוד בהמון חומר לא קל בכלל להבנה ראשונית. הקורס בעל אופי מתמטי-תיאורטי, ולכן חשוב להיות על החומר ולהבין היטב את ההגדרות והמשפטים. בנוסף, הכלים הנלמדים באלגברה א׳ מאוד חשובים לקורס ולכן כדאי לחזור עליהם, פלוס כמה תוספות (נורמות ומכפלות פנימיות) שלא נלמדות באלגברה א׳ אך מהוות חלק מרכזי מהקורס.", "timestamp": 1614811063531}, {"author": "S", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: מיקי מרצה מעולה, יודע להסביר את החומר מכמה נקודות מבט, תמיד זמין לשאלות (גם במייל), ובאופן כללי הרצאות הקורס בנויות בצורה מאוד מאוד טובה (חזרה על הנושאים החשובים בכל תחילת הרצאה / תרגול, בנייה מאוד מושכל של נושאים עם קשר ברור בינהם)\n\nשם המתרגל/ת: גלעד צ'ייס\nחוות דעת - תרגולים: מתרגל טוב, נותן טיפים מעולים לגבי איך לגשת לחומר הקורס ואיך לגשת לשאלות בקורס. שמח לענות על שאלות ושמח להתעמק בהן. יש לו נטייה להתעכב עם החומר דבר שהרבה פעמים גרר שתרגול מתחיל בחובות מתרגול קודם. אבל סה\"כ הספקנו הכל.\n\nשווה לשים לב שסמסטרי הקורונה המתרגלים ביצעו דיונים אחרי צפייה בתרגולים מוקלטים של מיקי. התרגולים מעולים (תכלס כל מה שכתבתי על מיקי רלוונטי לכאן) והם מוסיפים הרבה פעמים חומר חדש להרצאות (בין אם זה המון דוגמאות שימוש ובין אם זה אלגוריתמים יעילים / שונים מאלו שהוצגו בהרצאה לאותן הבעיות)\n\nשעורי הבית: רלוונטיים וסבירים, גם מבחינת רמה וגם מבחינת זמן. נוגעים גם באספקטים תיאורטיים וגם באספקטים פרקטיים (לעיתים).\n\nהמבחן: הוגן. צריך לדעת את החומר טוב אבל אין ניסיון להכשיל או להקשות. הזמן צפוף ולכן צריך להיות סגורים על הגדרות ושימוש בהם (יש אמנם 8 דפי עזר, אבל זה מבזבז זמן להסתמך עליהם).\n\nהשורה התחתונה: קורס מעולה, נותן כלים מאוד פרקטיים שמאוד רלוונטיים לקורסי המשך. הקורס בנוי בצורה נפלאה, והסינרגיה בין ההרצאות לתרגולים (ולדיונים בסמסטר קורנה) תורמת מאוד. ניכר שהושקעה מחשבה בבניית הקורס, והסגל רוצה בהצלחת הסטודנטים מאוד.", "timestamp": 1615457674433}, {"author": "Bob Bobinson", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "(סמסטר זום)\nשם המרצה: מיקי אלעד\nחוות דעת - הרצאות: הרצאות טובות מאוד. מיקי מעביר את החומר בצורה מהירה ולעניין, וראוים שהוא ממש מבין במקצוע וכל חלקיו. אבל זה לפעמים גם הופך אותו למנותק מהמציאות ולהתעמק בחלקים הלא נכונים של החומר.\n\nשם המתרגל/ת: גלעד צ'ייס\nחוות דעת - תרגולים: מתרגל מעולה, שמדבר תמיד לעניין ועל מה שבאמת צריך לדעת, ומתעמק בחלקים הקשים יותר והחשובים יותר. נותן המון עצות לשיעורי בית ולמבחן מעבר לחומר, ופותר המון תרגילים לדוגמה כדי לחדד את החומר. מומלץ מאוד. \n\nשעורי הבית: מגן. שיעורי הבית ארוכים יחסית, אבל בשותפים. הדבר המבאס בעיקר הוא שלא ממש בודקים אותם (אצלינו סיימו לבדוק אחרי המבחן!) ואז אין ממש פידבק ולא יודעים מה המגן עד ממש הסוף.\n\nהמבחן: המבחן הסמסטר היה מטורף - 10 שאלות אמריקאות, שמוגרלות באקראי ושונה לכל תלמיד מתוך מאגר של איזה 25. היה יותר על מזל של לקבל שאלות קלות/בחומר שטובים בו מאשר על ידע. גם סמסטר שעבר ממה שהבנתי עשו ניסויים במבחן. מקווה שלא יקרה שוב.\n\nהשורה התחתונה: קורס מעניין יחסית על שימוש של אלגברה א' במדעי המחשב, אבל עם אחראי שקצת מנותק מהמציאות והתלמידים. כדאי לבדוק מה קורה עם השיעורי בית והמבחן ולא להדפק בסמסטר \"ניסוי\" כמו שהיה עכשיו.", "timestamp": 1615464998641}, {"author": "asma", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיקי אלעד-מוקלט\nחוות דעת - הרצאות: השיעורים היו בצורת כיתה הפוכה אך הסתפקתי במוקלט,מיקי מרצה מעולה,רואים שהוא שולט בחומר ואוהב את מה שהוא מלמד וזה הפך את השיעורים למאוד מעניינים בעיני,ממליצה בחום!! \n\nשם המתרגל/ת: מיקי מוקלט+איתי עברון\nחוות דעת - תרגולים: השיעורים היו בצורה שאנלנו צופים במוקלט של מיקי ואז הולכים לדיונים\nהקלטות של מיקי מעולות (מה שנאמר על ההרצאות תקף פה)ואיתי עבר על הנקודות העיקריות של המוקלט,הסביר מה שלא היה ברור,הביא שיטת חדשות,תכלס אחלה מתרגל\n\nשעורי הבית: 4 גליונות בשותפות,לא עמוס בכלל,התרגילים היו ברמת מה שנלמד בכיתה,אין משהו קיצוני או קשה במיוחד אבל קצת ארוכים ודורשים מחשבה,אבל אם נכחתם בהרצאות ותרגולים ,אז תוכלו לפתור את הכל בקלות\n\nהמבחן: היה אמרקאי שונה משנים שעברו,היה יותר תאורתי מטכני ודורש הבנה עמוקה לחומר ושליטה טובה בו,לדעתי לא היה כל כך קשה והיה אפשרי להוציא 80+\n\n\nהשורה התחתונה: אחד הקורסים המעניינים ביותר,מראה שימוש למה שנלמד במציאות מה שמושך התלמידים לחומר יותר,סגל מעולה,שולט בחומר ברמה,ויכולים לראות את זה!", "timestamp": 1615883516467}, {"author": "BT", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: מיקי (מוקלט)\nחוות דעת - הרצאות: מרצה מעולה. אין יותר מדי תלונות על ההרצאה. מעביר את החומר בצורה ברורה, למרות המורכבות של חלק מהנושאים.\n\nשם המתרגל/ת: מיקי (מוקלט) \nחוות דעת - תרגולים: התרגולים פחות טובים, אבל זה פועל יוצא של מבנה התרגול בקורס. מוקדש יותר מדי זמן לחזרה על ההרצאה עצמה, ופחות מדי זמן לפתירת תרגילים שעוזרים להבין את החומר.\n\nשעורי הבית: יחסית סבירים. דורשים השקעה במהלך הסמסטר, ששווה אולי יותר מהערך שלהם (15 אחוז מגן אצלנו). חבל שכל מהות הקורס היא \"איך מחשב היה פותר את מה שלמדנו באלגברה א'\", ולא נגענו במחשב פעם אחת. \n\nהמבחן: מאז הקורונה סגל הקורס שינה את המבחן למבחן אמריקאי (לא ברור אם זה יימשך). בסמסטר שלנו (אביב 21), המבחן היה קשה במיוחד, והממוצע שלו ירד בשמונה נקודות ל 69. \n\nהשורה התחתונה: קורס מעניין מאוד - עם מבחן מגעיל מאוד", "timestamp": 1625642932181}, {"author": "Idan", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיקי\nחוות דעת - הרצאות: מיקי מרצה מצויין, ראיתי את כל המוקלטים שלו והוא מסביר את החומר בצורה מאוד מעניינת ומאוד ברורה, בנוסף תמיד עונה לשאלות במייל במידה ומשהו מההרצאה לא מובן.\n\nשם המתרגל/ת: איתי עברון\nחוות דעת - תרגולים: ראיתי את כל המוקלטים של איתי עברון(הוקלט בסמסטר קודם) במהלך הסמסטר והוא מתרגל ברמה הכי גבוהה שיש.\n\nשעורי הבית: לא היו עמוסים מדיי, גליון של 5 שאלות פעם בשבועיים, סך הכל 4 גליונות שהיינו צריכים להגיש.\nכן עזרו להטמיע את החומר.\n\nהמבחן:  לא הוגן ביחס לכלים שניתנו בקורס, אין מה להשוות אותו למבחני עבר והפקטור המנופח שניתן אכן העלה את הממוצע (שעדיין נמוך יחסית) אך ללא הלימה בין רמת הסטודנט לבין הציון, אלא בין רמת המזל של סטודנט לבין הציון שקיבל.\n\nהשורה התחתונה: אחד הקורסים הכי מעניינים שיצא לי לעשות, סגל הקורס ממש אחלה לדעתי אך הם נכשלו בכתיבת המבחן.", "timestamp": 1625648092394}, {"author": "U.H", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיקי אלעד (מוקלט)\nחוות דעת - הרצאות: אחד המרצים הכי טובים שלמדתי אצלם מעביר את החומר מתוך אהבה למקצוע ובצורה הכי מרתקת שיש.\n\n\nשם המתרגל/ת: מיקי אלעד (מוקלט)\nחוות דעת - תרגולים: ההערה על ההרצאות תקפה גם לתרגולים.\n\nשעורי הבית: לא קשים מידי אבל קצת ארוכים. \n\nהמבחן: המבחן הסמסטר היה אמריקאי, בדרכ זה עדיף על מבחן פתוח, אבל הסמסטר צוות הקורס נכשל כהוגן בכתיבת במבחן, היה מבחן מבלבל וקשה בצורה לא רגילה, הממוצע ירד בכ8 נקודות מסמסטרים קודים וגם זה לאחר שצוות הקורס הוסיף תשובות נכונות נוספות לכמעט כל השאלות והוריד מהחישוב של כל אחד תשובה שגויה אחת\n\nהשורה התחתונה: אחד הקורסים המעניינים שלקחתי, חבל שבגלל המבחן הקשה הציון לא היה בהתאם לרמת הידע של הסטודנטים לאורך כל הסמסטר.", "timestamp": 1625936391903}, {"author": "גלעד אל-דור", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: ראיתי את המוקלטים שלו והיה מעולה, הוא יורד לפרטים קטנים ומדבר בהתלהבות מהחומר.\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: ראיתי את התרגולים המוקלטים שלו, אותה חוויה אם כי ההבדל בין תרגול להרצאה לא מורגש לפעמים. \n\nשעורי הבית: 4 גיליונות עם זמן מרובה לעשות אותם.\n\nהמבחן: 15 שאלות אמריקאיות של שעתיים, השאלות במבחן כללו נושאים שלא ירדו איתנו בהם לפרטים קטנים מה שפגע בציון הכולל של הסטודנטים. לאחר מכן מיקי התנצל בפני הקורס מה שהיה יפה.\n\nהשורה התחתונה: קורס מעניין מאוד", "timestamp": 1626100661378}, {"author": "יגל מימון", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מיקי\nחוות דעת - הרצאות: אלוף! מסודר ומקצועי\n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: כל כך ברור שזה מרגיש קל\n\nשעורי הבית: לא פשוטים בכלל\n\nהמבחן: היה לנו מועד ממש הוגן ברוך ה'\n\nהשורה התחתונה: קורס שדורש הבנה מעמיקה בלינארית ומטריצות, הרבה חומר, (מאטלב - דלגו לא רלוונטי לציון)", "timestamp": 1626166829771}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מיקי מוקלט\nחוות דעת - הרצאות: אחלה הרצאות, חומר מעניין, מועבר בצורה טובה מאוד (ועם זאת קצת מוגזמת). לי אישית קשה ללמוד ממצגות אבל הם באמת ברמה גבוהה.\n\nשם המתרגל/ת: מיקי מוקלט, עירא הפוך.\nחוות דעת - תרגולים: התרגולים עצמם קצת מוזרים. חצי שיעור חוזרים על החומר ועוד חצי רואים הדגמות במאטלב. השלוש דקות האחרונות בשיעור מוקדשות לפתור תרגיל. זה טוב לחזור על החומר אבל לא הרגשתי שקיבלתי הרבה ערך מוסף מהתרגולים (חוץ מהתרגולים שמעבירים בהם חומר חדש).\nלעומת זאת, אני כן הרגשתי שקיבלתי הרבה ערך מוסף מהתרגולים ההפוכים. מדברים על החומר בצורה אקטיבית ופותרים ביחד תרגילים חדשים. ממליץ אפילו שזה מאוד מעמיס על המערכת. ספציפית עם עירא היה אחלה, הוא מבין את החומר ממש טוב ומסביר מנקודות מבט שונות ומשתדל לתת אינטואיציה.\n\nשעורי הבית: 4 גליונות, לא לוקחים המון זמן ולא קשים כל כך.\n\nהמבחן: היה מבחן אמריקאי קשה, לא הרגיש שההרצאות והתרגולים עזרו ממש להתמודד איתו. קיבלנו פקטור הזוי (ועדיין ממוצע נמוך יותר משנים קודמות).\n\nהשורה התחתונה: קורס מעניין שמועבר בצורה מעניינת, אחלה הקלטות, חרא מבחן.", "timestamp": 1626274148352}, {"author": "עדי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: ראיתי את ההרצאות המוקלטות של מיקי, בסה\"כ מרצה טוב, המצגות שלו מפורטות וטובות, אבל הוא לא תמיד מנגיש את החומר לסטודנטים בצורה טובה.\n\nשם המתרגל/ת: מיקי אלעד ואיתי עברון\nחוות דעת - תרגולים: התרגולים המוקלטים של מיקי הם המשך ישיר להרצאה ולא באמת תרגול, אמנם חוזרים על החומר שהיה בהרצאה אבל לא באמת מתרגלים שם תרגילים שדומים לש\"ב או למבחן ,פרט לחמש דקות האחרונות של התרגול,\nלכן צפיתי גם בתרגולים ההפוכים של איתי עברון. התרגולים שלו מצוינים, והוא יודע להנגיש את החומר לסטודנטים.\n\nשעורי הבית: ברמה סבירה, פתירים בהינתן הבנה של החומר.\n\nהמבחן: הסמסטר הייתה בחינה אמריקאית. הבחינה (מועד א') הייתה לא הוגנת ,תקדימית מבחינת השאלות ,קצרה מבחינת זמנים ומנותקת מהסמסטר. הסגל אכן הודה שהמבחן היה ברמה לא סבירה ונתן פקטור מוזר לבחינה (בכל שאלה התקבלו שתי תשובות כנכונות). ככלל המבחנים של הקורס הזה לא קלים, וצריך להבין טוב את החומר.\n\nהשורה התחתונה: בסה\"כ החומר עצמו של הקורס מעניין, אבל יכל להיות מועבר הרבה יותר טוב. לי באופן אישי הוא לא היה כזה עמוס לאורך הסמסטר.", "timestamp": 1626452369636}, {"author": "גלעד אל-דור", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מיקי אלעד - מוקלט\nחוות דעת - הרצאות: ההרצאות ההקלטות מעולות, מעביר את החומר בצורה ברורה ובהתלהבות\n\nשם המתרגל/ת: מיקי אלעד - מוקלט\nחוות דעת - תרגולים: מעביר באותה התלהבות, תמיד החצי הראשון של התרגול מאוד דומה להרצאה והחלק השני מוקדש לדוגמאות\n\nשעורי הבית: ארבעה גיליונות יבשים שלא דורשים יותר מדיי זמן, ההגשה בזוגות כך שאם מחלקים את העבודה העומס בכלל לא מורגש. \n\nהמבחן: המבחן היה אמריקאי עם 15 שאלות, היה קצת מרחץ דמים כי בחרו לשאול הרבה שאלות טריקיות שבקושי מתעסקים בהם במהלך הקורס, אז הציונים במועד א' היו נמוכים.\n\nהשורה התחתונה: קורס מעניין מאוד, מרגיש שיהיה שימושי", "timestamp": 1627462932272}, {"author": "בעיית מינימיזציה", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מיקי אלעד (מוקלט בזום)\nחוות דעת - הרצאות: מעולות וברורות.\n\nשם המתרגל/ת: מיקי אלעד (מוקלט בזום)\nחוות דעת - תרגולים: מעולים וברורים.\n\nשעורי הבית: סבירים. לא קשים מדי אבל כן עמוסים. לפחות תורמים היטב להבנת החומר.\n\nהמבחן: אמריקאי במחשב. לדעתי הוגן. \n\nהשורה התחתונה: אמנם קורס חובה אבל לפחות מהמומלצים. אגב מתמטיקאים/מדמחים יקרים - לכם יש אפשרות לבחור בין מבוא לאנליזה נומרית לבין אלגוריתמים נומריים. נראה לי שהתשובה לגבי איזה קורס מומלץ יותר - ברורה. נומריים סולל לכם דרך בטוחה ונוחה מאוד לקורסי המשך באנליזות נתונים (למשל מבוא למערכות לומדות שמסתמך מאוד על נומריים).\nגם איכות ההוראה, זמינות החומר, איכות ההקלטות.. קורס זה בנוי היטב ללמידה מקוונת.", "timestamp": 1627933762743}, {"author": "Elad Kay", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: ממש מגניבות וטובות, החומר מגניב ומעניין וחשוב לדעתי\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: גם חוזרים על החומר וגם יש כמות לא מבוטלת של חומר חדש שאחר כך שואלים עליו במבחן! שימו לב\n\nשעורי הבית: די ארוכים ובהתחלה רצו שיהיו רק 10% מגן שלדעתי זה ממש לא קול.\n\nהמבחן: אם לצטט את מיקי אלעד: חולני\n\nהשורה התחתונה: נקווה שהמועד ב׳ יהיה שפוי", "timestamp": 1628959395363}, {"author": ":|", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: באופן כללי מרצה טוב, קצת חי בעולם שלו, יש נושאים חדשים שמיקי מניח שאנחנו מכירים למרות שהרוב לא מכירים.\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: התרגולים לכאורה מיותרים, אם כי, במועד א היה שאלה במבחן שהיה חייב לראות את התרגול בנושא כדי לפתור.\n\nשעורי הבית: \n\nהמבחן: מבחן אמריקאי עם הרבה שאלות שלא ממש בודקים את הידע שלך בקורס אלא בודקים את היכולת שלך לפתור שאלות אמריקאיות. הפקטור במועד א היה לא פייר, הוא פשוט החליט לסמן תשובות נוספות שעליהם יקבלו ניקוד חלקי. שיטה הזויה.\n\nהשורה התחתונה: ממליץ בחום להשאיר את הקורס הזה לסוף התואר, אחרי שיש לכם עבודה מסודרת", "timestamp": 1635074581121}, {"author": "I need OCB", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: מיכאל מוקלטות\nחוות דעת - הרצאות: מזעזעות ותלושות מהמציאות ואין להן שום קשר למבחן ולשאלות במבחן\n\nשם המתרגל/ת: מיכאל מוקלטות\nחוות דעת - תרגולים: העתק הדבק של ההרצאות המפגרות\n\nשעורי הבית: פנאני חובה לרפרנס ולהקליד אחלה מגן\n\nהמבחן: אמריקאי תלוש מהמציאות והכי מזעזע ונאצי שראיתי. שילוב של היטלר ולנין ברמת אכזריות והקשר שלו להרצאות ולתרגולים הוא כמו הקשר בין מיכאל לשיער שופע. זה היה מבחן ביזיוני ומפגר שלא נראה כמוהו אבל אני לא מופתע שנשבר פה שיא חדש של ניתוק בין החומר למבחן. עבורי שאשכרה ניסה והשקיע בלמידה זה היה כמו טופס לוטו וככה כולם גם, קיצור זבל של קורס עם סגל ערמומי ועוקץ.\n\nהשורה התחתונה: זבל טהור ומלוכלך, לעבור ולא לחזור עם מבחן כזה גם צריך לשרוף עם להביור את הבניין.", "timestamp": 1637511049826}, {"author": "רועי", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: הקלטות טובות עם הסברים עמוקים\n\nשם המתרגל/ת: מיכאל\nחוות דעת - תרגולים: כמו ההרצאות רק עם יותר בשר ועניין\n\nשעורי הבית: די קשים, דורשים זמן\n\nהמבחן: קשה מאוד אך אם לומדים כמו שצריך אמורים להצליח\n\nהשורה התחתונה: קורס לא קל שדורש השקעה אך לבסוףף נופל האסימון במיוחד אם יש אמריקאי עם טריקים", "timestamp": 1637511553111}, {"author": "Adan", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: מיקי\nחוות דעת - הרצאות: מיקי באמת מרצה טוב ו מסביר הכל אבל הקורס עצמו אינו קל לכן עדיין קשה להבין את הנושאים של הקורס\n\nשם המתרגל/ת: חמזה\nחוות דעת - תרגולים: לוקח את חוות דעת הסטודנטים והבנתם בחשבון אז אם יש משהו לא הבנתם או לא אהבתם בתרגול אתם יכולים פשוט לשתף איתו\n\nשעורי הבית: קשים ו לוקחים זמן והרבה מחשבה אבל עוזרים בהבנת החומר\n\nהמבחן: עדיין לא עשיתי אבל אני יודעת שלא יהיה קל\n\nהשורה התחתונה:", "timestamp": 1644575859730}, {"author": "Daniel Litvak", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה:\nמיקי אלעד\nחוות דעת - הרצאות:\nמלא אנרגיה, יכול להיות יותר מידי מהיר, אבל תמיד עונה על שאלות\n\nשם המתרגל/ת: אירע\nחוות דעת - תרגולים: \nמעולה, התרגולים עמוסים ולכן לא מספיק אבל שולט בחומר ומסביר טוב\n\nשעורי הבית: \nעמוסים ולא פשוטים בכלל, קיבלנו 10 נקודות בונוס על הקלדה, ממוצע כל התרגילים מעל 100\n\nהמבחן: \nמאתגר, שעתיים ל15 שאלות אמריקאיות. חלק קלות יותר חלק קשות.\n\nהשורה התחתונה: \nקורס מעניין ומאתגר ועמוס", "timestamp": 1645118818855}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיקי אלעד \nחוות דעת - הרצאות: ההרצאות המוקלטות טובות אבל החומר קשה, חייב גם תרגולים ושיעורי בית כדי להבין מה הולך בקורס\n\nשם המתרגל/ת: גם מיקי אלעד\nחוות דעת - תרגולים:  כמו ההרצאות\n\nשעורי הבית:  יש רפרנסים אז לא נורא, עוזרים להבין את החומר\n\nהמבחן: אמריקאי אז זה מעצבן\n\nהשורה התחתונה: קורס קשה, חשוב להבין טוב את החומר", "timestamp": 1645184751290}, {"author": "Gil Shahar", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: הרצאות ברמה גבוהה, יש מוקלט מ2019 ויש פרונטלי, הם אחד לאחד אז אפשר לבחור.\nמיקי יודע להסביר דברים בשפה מאוד יפה ומעניינת.\n\nשם המתרגל/ת: מוקלטים של מיקי\nחוות דעת - תרגולים: מרגיש כמו הרצאה, יש חומר חדש בתרגולים לפעמים והרבה demoים. לפעמים בסוף הוא עושה שאלה ממבחן אבל היה יכול לעשות יותר.\n\nשעורי הבית: סבירים חוץ מהאחרון שסתם היה בזבוז זמן. תמצאו רפרנסים ואל תשברו את הראש אם לא הולך.\n\nהמבחן: היה מאתגר והרגיש כמו מבחן בקורס \"בתורת המטריצות\"/\"אלגברה א חלק 2\".\n\nהשורה התחתונה: קורס עם הרבה חומר, כדאי לעבוד מסודר ולארגן דף נוסחאות שיודעים להתמצא בו כי אין הרבה זמן במבחן.", "timestamp": 1645376028261}, {"author": "שילֹה בוחניק", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיקי אלעד, הקלטות מסמסטר שעבר\nחוות דעת - הרצאות: לא מובן מאליו שמיקי העלה אותן גם לסמסטר הזה + דאג שיהיו מסונכרנות לחומר הנוכחי. ההסברים היו ברורים, והוא דאג להסביר מה המוטיבציה מאחורי כל נושא\n\nמה שכן, החומר לעיתים מרגיש מבולגן, וקשה להבדיל בין עיקר לטפל. ממליץ לסכם את ההערות הצהובות/ירוקות.\n\nשם המתרגל/ת: מיקי אלעד, הקלטות מסמסטר שעבר\nחוות דעת - תרגולים: התרגולים הם פשוט הרצאה נוספת, עם התמקדות בדוגמאות ומשפטים ספציפיים יותר, שנוטים להופיע פחות במבחנים\n\nשעורי הבית: הוגנים, אבל די ארוכים\n\nהמבחן: הוגן.\n\nהשורה התחתונה: קורס קצת מבולגן, אבל החומר מעניין. ממליץ לסכם בעצמכם ולא להסתמך על סיכומים של אחרים", "timestamp": 1645392401548}, {"author": "גלעד חיובי בהחלט", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: מיקי אלעד - מוקלט\nחוות דעת - הרצאות: מיקי מרצה מעולה, אני לא רואה סיבה לבוא פיזית אם אפשר את המוקלט.\n\nשם המתרגל/ת: מיקי אלעד - מוקלט\nחוות דעת - תרגולים: מיקי מתרגל מעולה, אני לא רואה סיבה לבוא פיזית אם אפשר לראות את המוקלט.\n\nשעורי הבית: מעט ארוכים, לא מסובכים במיוחד ונבדקים לא בקפדנות יתר, אם מקלידים אותם יש בונוס של 10 נקודות כך שהממוצע של תרגילי הבית עבר את ה100 בכל התרגילים.\n\nהמבחן: בגדול וויילד קארד, כל מבחן אמריקאי שונה מקודמו והם עדיין לא מצאו את הנוסחה במיוחד, המבחן לא היה פשוט ו15 שאלות בשעתיים זה קצת לחוץ, אבל רוב השאלות ממש אפשריות בזמן הזה - ככה שתנסו כמה שפחות להיכנס ללחץ ואפשר גם להוציא ציון טוב במקצוע.\n\nהשורה התחתונה: \nקורס מעניין מאוד, שנראה שהחומר שבו רלוונטי ממליץ לקחת בצמוד עם אלגברה במ' אם אתם חושבים לקחת גם אותו, כי החומר חופף משלב מסוים וזה עוזר לתת אינטואיציה לשני הקורסים.", "timestamp": 1645611965831}, {"author": "מתפרק LUQRSVD", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יניב רומנו + מוקלטות של מיקי אלעד\nחוות דעת - הרצאות: ההקלטות של מיקי מדהימות ותכלס אפשר ללמוד את כל הקורס רק מהן, אבל רוב הסמסטר הייתי אצל יניב, שפשוט היה תותח, הסביר את הדברים בצורה ברורה, ובגלל שהיינו קבוצה קטנה יחסית היה יותר מקום לשאול שאלות ואפילו להרחיב טיפה מעבר פה ושם.\n\nשם המתרגל/ת: מוקלטות של מיקי אלעד\nחוות דעת - תרגולים: האיכות של התרגולים מדהימה כמו של ההרצאות, אבל הקטע הוא שרוב הזמן החומר שמוצג בהם הוא חומר חדש שלא נלמד בהרצאות, או דוגמאות ב-MATLAB של החומר הנלמד. בסופו של דבר החומר שם הוא הכרחי בשביל תרגילי הבית, אבל מבאס שזה לא באמת תרגול, אלא פשוט עוד הרצאה.\n\nשעורי הבית: היו 5 גליונות להגשה, כאשר גיליון יוצא כל שבועיים שלושה. בדרך כלל השאלות שם לא יותר מדי מסובכות ופשוט מסתמכות על משהו נורא ספציפי שאם פשוט חוזרים למצגות אפשר לפתור אותו בקלות, אבל מדי פעם יש שאלות בלתי פתירות שפשוט כדאי לרפרנס. יש בונוס 10 נקודות על תרגיל מוקלד, וממוצע כל תרגיל מעל 100.\n\nהמבחן: המבחן אמריקאי, עם שאלות שמנוסחות בצורה מאוד טריקית, ופשוט אסור לאבד בו ריכוז, כי אם זה קרה, אכלתם אותה. מה גם שהוא אורך רק שעתיים, וזה מרגיש מאוד גבולי יחסית למה שצריך לעשות שם, והדבר שהכי הפריע לי הוא שדוחפים שאלות שלא בהכרח קשורות לקורס באופן ישיר, אלא דברים שמזכירים קצת יותר אלגברה א'.\n\nהשורה התחתונה: הקורס היה אחד המעניינים שיצא לי לקחת כי מציגים בו כל מיני שימושים אמיתיים של האלגוריתמים שלומדים, ועושים את זה בצורה מדהימה. אבל המבנה של הקורס הוא לא מושלם, והמבחן משאיר בסוף טעם רע בפה.", "timestamp": 1647292773335}, {"author": "ז'אק אדמר", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: מסביר ברור ועונה על שאלות, נותן דוגמאות. מעבר לזה, הוא בנה את כל הקורס והחומר קשור למחקר שלו אז מאוד בקיא בו. לפעמים יש קצת נפנופי ידיים ודברים פחות ברורים מתמטית\n\nשם המתרגל/ת: תיאו\nחוות דעת - תרגולים: מסביר טוב ועונים על שאלות. תיאו יודע לתת אינטואיציות גאומטריות ברמה מטורפת.\n\nשעורי הבית: לא כבדים מדי לא קלים מדי. לא דומים למבחן. לדעתי לא קשורים לקורס, נראה שהמטרה שלהם זה לחזק יכולות מתמטיות יותר מאשר ללמוד את החומר של הקורס.\n\nהמבחן: אמריקאי, 15 שאלות, שעתיים. מתחכם טריקי ומעצבן מאוד. לבוא חדים על הזמנים ולהיות מוכנים לאלתר. להכיר טוב את דף הנוסחאות\n\nהשורה התחתונה: קורס מעניין בטירוף, שנראה שהכלים שלומדים בו חשובים להמשך התואר. מבחנים על הפנים. נראה שהקורס מנסה ללמד כלים חשובים תוך כדי שהוא מנסה גם לשפר את היכולות אלגברה א של הסטודנטים, ולפעמים אין כל כך קשר בין הדברים. סך הכל נחמד וכיף אבל קשוח.", "timestamp": 1649410663507}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיקי אלעד מוקלט\nחוות דעת - הרצאות: לא אהבתי, אבל זו האופציה הכי טובה.\nמיקי מאוד מתלהב מהחומר, הוא עוסק בו שנים אז הכל מאוד פשוט לדעתו וברור מאליו. אני אישית פחות התחברתי.\n\nשם המתרגל/ת: מיקי מוקלט\nחוות דעת - תרגולים: \nאני אתחיל בזה שלא מדובר באמת בתרגול אמיתי. ה\"תרגולים\" הם פשוט חזרה על ההרצאה ודמואים במטלאב. חצי מהדמואים לא ברורים בכלל וסוטים מהחומר (חלק קטן שלהם כן מועיל בצורה כלשהי). מתוך תרגול של שעה וחצי פותרים בפועל תרגיל אחד ב 5 דקות אחרונות של ההקלטה. אני הבנתי שבתרגולים הפרונטליים הסמסטר התחילו לפתור בסוף התרגול עוד 3 שאלות קצרות ממבחנים של השנים האחרונות, זה מבורך אבל עדיין ממש לא מספיק. לטעמי הסגנון הזה של \"תרגולים\" מאוד מעצבן.\n\nשעורי הבית: \nצריך להגיש 5 גליונות כדי לקבל 15% מגן. אם מגישים 4 מקבלים 10%. אם מגישים פחות לא מקבלים כלום. כל הגיליונות מאוד ארוכים, לפעמים יש שם שאלת תכנות במטלאב שזה ממש מעצבן כי מעולם לא לימדו אותנו איך לתכנת במאטלב ומעבר לזה אין שום קשר בין מאטלב לבין תרגילים במבחן.\n\nהמבחן: הסמסטר היה שינוי במבחן, העלו את הזמן משעתיים ל-3 שעות והפכו את השאלות להרבה יותר חישוביות וקצת פחות טריקיות. בפועל מה שזה אומר זה שהרבה זמן יחסית הולך על חישובים, ועלולות להיות הרבה טעויות חישוב אבל יש קצת פחות טריקים. הזמן יחסית סביר ומאפשר להצליח לפתור את השאלות אבל אם אתם מאוד סובלים מחישובים השינוי לאו דווקא לטובתכם - טעויות חישוב בשאלות אמריקאיות :( \n\nהשורה התחתונה: \nההרצאות סבבה, התרגולים מתסכלים, בכללי החומר לדעתי לא פשוט וזה שהתרגולים לא באמת מתרגלים אותו מקשה. חשוב לציין שהמרמור שמשתקף בחוות הדעת הזאת לא נובע מציון נמוך, לאחר הרבה השקעה כן הצלחתי בקורס, אבל הדרך לשם הייתה מתסכלת.", "timestamp": 1657040759593}, {"author": "ניצן חיים ליסטמן", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיקי אלעד מוקלט. גם הרצאות  גם תרגולים.\nחוות דעת - הרצאות: אין על מיקי בעולם, שנאתי את הקורס בחודש הראשון כי לוקח זמן להבין מה רוצים ממך בכלל. ברגע שהאסימון נפל זה נהיה הקורס האהוב עליי (אחרי מתמ).\nההקלטות של מיקי טובות מאוד והחומר זהה אחד לאחד למה שהיה אצלנו בסמסטר. ההקלטות של התרגולים קצת מוזרים, יש שם רק את גרישה המתרגל בקהל והוא תמיד שואל שאלות מונפצות. לקראת המבחן הלכתי לתרגול של מיקי בלייב והוא היה מדהים, אז ממליץ כן ללכת אליו פרונטלי או לתרגול אחר, עזבו את ההקלטות של התרוגלים.\n\n\nשעורי הבית: גליון פעם בחודש בזוגות, לא קשה מידי. הם יוצאים רק אחרי שמסיימים פרק גדול בחומר שזה בעיה כי חודש בלימודים זו תקופה רצינית. אני הכנסתי את עצמי לדיליי מכוון בהקלטות ככה שראיתי את ההרצאות קרוב יותר לגליונות וזה עזר לי. השותף ואני היינו יושבים על גליון כמה שעות בפגישה או שתיים וסוגרים. יש בונוס על הקלדת התרגיל אבל זה לוקח ים זמן אז לשיקולכם.\n\nהמבחן: אמריקאי, כמעט כולן בנויות על הבנה וטריקים ואפשר להוציא ציון טוב אם עוברים טוב על החומר ועושים מבחנים. יש גם דף נוסאחות ואפשר לדחוף שם מה שרוצים אז אין צורך לשנן.\nהיה ממוצע מאוד גבוה אצלנו.\n\nהשורה התחתונה: קורס מאוד מעניין ולא קשה מידי אני אהבתי. המשך כמעט ישיר לאלגברה לינארית אז מי שאהב אותו יהנה גם פה", "timestamp": 1658567126624}, {"author": "Me", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיקי מוקלט \nחוות דעת - הרצאות: מעניינות. רואים שמיקי אוהב את המקצוע\n\nשם המתרגל/ת: מיקי מוקלט\nחוות דעת - תרגולים: מקסים. שימו לב: יש בפנופטו מתרגל שנקרא איתי והוסיף תרגילים ורעיונות. שווה לבדוק ״דיונים של איתי״\n\nשעורי הבית: ארוכים, כוללים שאלות מטלב למרות שלא מלמדים את זה בקורס. בסוף לא כאלה נוראיים\n\nהמבחן: אני מניח שזה תלוי בסמסטר, בדרך כלל ברמה סבירה, יש צורך בהבנה של החומר ברוב המקרים כדי לקבל ציון גבוה, מומלץ להשקיע ולא לזלזל\n\nהשורה התחתונה: קורס ממש מעניין למי שמתחבר", "timestamp": 1658627240230}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: מיקי אלעד (מוקלטות)\nחוות דעת - הרצאות: מיקי חי ונושם את הקורס הזה וככה מרגישים כששומעים אותו בהרצאות. הוא מסביר מעולה ואפילו די מעניין ותכלס אין סיבה ללכת לפרונטלי.\n\nשם המתרגל/ת: מיקי אלעד\nחוות דעת - תרגולים: שוב, מסביר טוב. אסייג ואגיד רק שלפעמים דברים שנראים עבורו טריוויאליים הם דברים שלסטודנטים ששומעים אותם פעם ראשונה קצת יותר קשה לתפוס. המסקנה שלי היא לא להיבהל אם יוצאים מהתרגול מבולבלים, לקראת המבחן דברים מחלחלים.\n\nשעורי הבית: גיליונות ארוכים, הרבה דברים שמרגישים לא רלוונטיים. השאלות מטלב במיוחד מציקות. נסו להריץ אותם כי הרוב לא דומה בכלל למבחן. אבל כן די עוזר כדי להיזכר בחומר ולהטמיע אותו. בכל מקרה זה מגן וממוצע 100 אז מומלץ להגיש.\n\nהמבחן: לא נורא בסך הכל. מה גם שממוצע 80 במבחן די מדבר בעד עצמו.\n\nהשורה התחתונה: הקלטות מעולות, תשתמשו בהן. אפשר להוציא ציון סבבה, יחסית במעט מאמץ.", "timestamp": 1659099499151}, {"author": "Yair Berman", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיקי אלעד מוקלט\nחוות דעת - הרצאות: מיקי אנרגטי ומנסה להפוך את הקורס למעניין, לדעתי בהצלחה. ניסיתי את שתי המרצים שהיו לנו וזה לא היה טוב. \n\nשם המתרגל/ת: מיקי אלעד מוקלט ופרונטלי\nחוות דעת - תרגולים: ההדגמות היו מגניבות. ממליץ לבוא פרונטלי בשביל להרגיש את כמה שמיקי אנרגטי.\nממליץ לראות גם מוקלט בשביל לנסות להבין\n\nשעורי הבית: סבירים ממש. לא צריך להשקיע בפתרון נכון בשביל לקבל 100, מספיק להקליד.\nהייתה לנו שאלת שיעורי בית אז כדאי לחזור עליהם \n\nהמבחן: אקראי לגמרי, פשוט אוסף טריקים שאיכשהו אמור לייצג את הקורס.. תביאו דף נוסחאות טוב.\n\nהשורה התחתונה: זה אלגברה 1.5 עם הדגמות מגניבות, קחו אחרי אלגברה א אם אתם יכולים", "timestamp": 1659260587682}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מיקי אלעד (מוקלט)\nחוות דעת - הרצאות: \nמרצה מטורף. הרצאות ממש מעניינות.. גם אם בהתחלה זה נראה קצת תלוש, בהמשך מגיעים לדברים האמיתיים ומבינים טוב יותר גם את ההתחלתיים.\nחלק מההרצאות קשוחות. לא לפחד לחזור ולשמוע שוב ושוב.\nמתבסס מאוד על אלגברה א'.\n\nשם המתרגל/ת: מיקי אלעד (פיזי)\nחוות דעת - תרגולים: חזרה על החומר של ההרצאות והרבה דוגמאות ויישומים. מי שמתעניין בתחום של למידת מכונה - הנאה מובטחת.\nממליץ בחום רב.\n\nשעורי הבית: גיליון של כמה שעות (בדר\"כ מסונכרן עם קומבי - שבוע שבוע) עם ציון. הרוב מרופרנס.\nהממוצע היה מעל 100 לדעתי בכל מטלה.\nהרבה טריקים, חלקם לא סבירים אבל שווה לנסות לבד בהתחלה.\nחלק מהשאלות במאטלב. דורש ידע די בסיסי ומקסימום מחפשים רגע באינטרנט.\n\nהמבחן: היה יחסית קל, גם משתקף בממוצע. \nלשים לב לדקויות בחישובים.\n\nהשורה התחתונה: קורס מדהים למי שמתעניין בתחום. הרבה אלגברה א'. חלק בהתחלה קשה אבל כשמתקדמים מבינים גם את הדברים הקשוחים.\nמומלץ מאוד להשתמש באינטואיציה דומה לזו של אלגברה א' על מרחבים וקטוריים וכו', יכול לעזור גם כאן.", "timestamp": 1661074590736}, {"author": "-בסוף יהיה טוב", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: הקלטות של מיקי\nחוות דעת - הרצאות: מומלץ לדלג על כל דבר שיש בו את המילה demo ולחזור לזה רק כשעושים שב. להשתדל לספוג את החומר בחלקים, לחזור ולחזור לזה עד שמבינים לפחות קצת למרות העומס שזה יוצר בסמסטר. \nההקלטות הן משאבות זמן וצריך לדעת את זה\n\nהמבחן: במועד א היה הוגן מאוד ומבחן של 3 שעות במקום שעתיים, כמו שצריך\n\nהשורה התחתונה: זה אחד הקורסים הקשים ביותר שניתן לקחת לסטודנט מתחיל במדמח, בגלל העובדה הפשוטה שמדלגים עם מדמחיסטים על כל האינטואיציה במתמטיקה השימושית, לפני הקורס הזה מתעסקים רק במשפטים והוכחות. השיטה ידועה, וזה פוגע בנו- אבל בסוף מבינים את החומר וזה פותח עולמות חדשים ומטורפים", "timestamp": 1662201961478}, {"author": "אלחנן בלוך", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: ממש נהניתי. החומר יחסית מסובך, והייתי צריך מידי פעם לעבור עליו אחרי ההרצאה. אבל זה חומר ממש מעניין ומגניב.\n\nשם המתרגל/ת: תיאו\nחוות דעת - תרגולים: מעולה! תיאו מסביר היטב, חשוב לו שיבינו, וגם מדגים על הלוח מידי פעם (בשבילי אישית זה יעיל הרבה יותר ממצגת).\n\nשעורי הבית: קלים יחסית לרמה של הקורס. מצד שני, זה גם אומר שהם לא מספיקים כדי להפנים היטב את החומר, והם לא מספיק מכינים למבחן.\n\nהמבחן: \n\nהשורה התחתונה: מומלץ לכל מי שהסתדר עם אלגברה - זה שימושים באלגברה, בצורה פחות פורמאלית ויותר מעניינת.", "timestamp": 1664714875535}, {"author": "קריף אלמוג", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: המצגות מצוינות, הרבה חומר אבל סה״כ מועבר בצורה מאוד טובה.\n\nשם המתרגל/ת: נעם קורן\nחוות דעת - תרגולים: מתרגלת מעולה! עוצרת תמיד לשאלות, מסבירה קצת מעביר, מכירה את החומר מעולה ממש, סגרה לי הרבה פינות שלא הבנתי בהקלטות, ממליץ בחום.\n\nשעורי הבית: ארוכים וחצי לא רלוונטיים לקורס (לפחות אלה שבמאטלב)\n\nהמבחן: הוגן, עדיף לגשת במועד א׳\n\nהשורה התחתונה: קורס מלמד ומעניין.", "timestamp": 1674480303153}, {"author": "מת-Lab", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אחלה מיקי אלעד מוקלט\nחוות דעת - הרצאות: אחלה הרצאות, כיף שהן זמינות ומקיפות ב-100%. בשלב מסוים במהלך הסמסטר כבר היה לי קשה לראות את ההרצאה המוקלטת, זה מעט שוחק, ולכן ממליץ למי שמעדיף פרונטלי, לא לחשוש וללכת לפרונטלי.\n\nשם המתרגלת: נועם קורן\nחוות דעת - תרגולים: אחלה מתרגלת שבעולם. ברורה עם ניסיון, סוגרת פינות שלא הובנו בהרצאה, יודעת לומר מה דורש יותר תשומת לב ומיקוד ומה פחות, ויודעת לתת את ההסברים שגורמים להבין את החומר כמו שצריך. יש תרגולים מוקלטים מצוינים של מיקי אבל היה לי מספיק ממנו בהרצאות.\n\nשעורי הבית: גיליונות כל שבועיים שחשובים להבנת והפנמת החומר. אם מגישים מוקלד מקבלים בונוס של 10 נקודות לגיליון. סך הכל ניתן לצבור % מגן.", "timestamp": 1676012014546}, {"author": "מפורק SVD", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מיכאל לינדנבאום\nחוות דעת - הרצאות: \nמאוד נחמד ונעים הליכות, אבל ניכר שלא היה חד על החומר כמו מיקי.\nלקראת סוף הסמסטר עברתי להרצאות המוקלטות של מיקי, ומעבר לזה שמיקי לפעמים קצת מהיר מאוד נהניתי.\n\nשם המתרגל/ת: שון מן\nחוות דעת - תרגולים: \nמתרגל נהדר שמתחבר עם הסטודנטים.\nמעביר את התרגולים ממש לפי הסגנון של מיקי, אבל במקביל מנהל דיון בכיתה, עונה על שאלות ומוסיף לפעמים דברים משלו למצגת.\nמומלץ ממש.\n\nשעורי הבית: כל קשר ביניהם למבחן מקרי בהחלט.\nתרגילים לא קלים ודי מעצבנים, אבל בסופו של דבר מקנים 10~15% מגן, אז חבל לוותר.\n\n\nהמבחן: הוגן ופתיר מאוד במסגרת הזמן של 3 שעות, מה שמתבטא בממוצע הדי גבוה של 82 (מה שאומר שלא היה פקטור).\nחשוב לציין שהמבחן הוא אמריקאי, ולכן הרבה מההתעסקות היא בפסילת תשובות ומציאת דוגמאות נגדיות. חשוב מאוד להתכונן בהתאם.\n\nהשורה התחתונה: קורס מעניין מאוד, שבגדול מאוד אפשרי להוציא בו ציון סביר לגמרי. \nתהיו חזקים על אלגברה א׳ ותנסו לפתח אינטואיציה חזקה למושגים ולמשפטים.", "timestamp": 1677073088700}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מיקי אלעד (הקלטות)\nחוות דעת - הרצאות: \nאני חושב שמגזמים בביקורות לגבי מיקי אלעד, עד כמה מרצה טוב הוא, לא שהוא לא מרצה טוב, אולי פרונטלית הוא יותר טוב, אבל בהקלטות הרגשתי שהוא בקושי מסביר את החומר, ויותר מעביר אותו. בסה\"כ נסיתי גם את הפרונטלי אבל בסופו של דבר הכי התחברתי להקלטות (מיקי אלעד לא העביר את הסמסטר את הקורס)\nבקיצור הכי מומלץ ממה שיש.\n\nשם המתרגל/ת:  מיקי אלעד (הקלטות)\nחוות דעת - תרגולים: \nהתרגולים לא באמת מכינים למבחן, אלא פשוט עוברים על החומר שהועבר בהרצאות , עם כמה דוגמאות מהמטלב , ושאלה ממבחן (נוסח ישן).\nהסמסטר הוסיפו בפרונטלי, גם שאלות ממבחנים.\n\nשעורי הבית: \nהוכחות - רפרנס.\nכל השאר, מומלץ לעשות\n\nהמבחן: \nפתיר ב 3 שעות , אפשרי ב 2 איך שהיה קודם אם ממש חדים על החומר.\n\nהשורה התחתונה: \nקורס מעניין בסה\"כ, אבל אני חשוב שהוא לא מועבר בצורה הכי טובה שיש.", "timestamp": 1677088211348}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיקי אלעד (הקלטות)\nחוות דעת - הרצאות: \nמרצה ברמה הכי גבוהה שיש. מעביר את החומר בצורה מעניינת וברורה\n\nשם המתרגל/ת: מיקי אלעד (הקלטות)\nחוות דעת - תרגולים: \nהתחלתי את התרגולים עם שון, שהיה מעולה. אחרי פעם אחת שלא יכלתי להגיע השלמתי תרגול בהקלטות של מיקי ונשארתי עם זה. התרגולים די מוזרים, בעיקר חזרה על החומר של ההרצאה ודמו במאטלב. כמעט ואין פתירת שאלות כמו ברב התרגולים. התרגולים של מיקי מעולים אבל בדיעבד- לדעתי היה קצת טו מאצ׳ לראות גם את התרגולים וגם ההרצאות במוקלט והיה עדיף להישאר עם שון. למי שממש אוהב מוקלט אז ממליצה\n\nשעורי הבית: \nגליון כל שבועיים, לא משהו עמוס מדי והגשה בזוגות. די שונה מהמבחן אבל לא דורש השקעה מוגזמת אז שווה את המגן וההפנמה של החומר.\n\nהמבחן: \nאמריקאי והוגן ממש. תחזרו על החומר, תתרגלו את כל האמריקאים האחרונים (יש בערך 10) ותוודאו שאתם מבינים טוב את כל התשובות ותצליחו :)\n\nהשורה התחתונה: \nאחלה קורס. מתבסס מאוווד על לינארית אז צריך לבוא חדים. אני עשיתי לינארית בפתוחה די מזמן אז לקח לי זמן להיכנס לזה אבל בערך מאמצע הסמסטר כבר נהיה די חלק. ההרצאות כבדות לפעמים ולוקח קצת זמן לאסימון ליפול, אבל בתרגול חוזרים על החומר בצורה יחסית מעמיקה וזה עוזר. קורס ממש מעניין לדעתי ומבחן שלא בא לדפוק את הסטודנטים.", "timestamp": 1677102706903}, {"author": "1111", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: הקלטות של מיקי אלעד\nחוות דעת - הרצאות: מרצה מדהים אין יותר מה לומר.\n\nשם המתרגל/ת: הקלטות של מיקי אלעד\nחוות דעת - תרגולים: גם התרגולים מצוינים.\n\nשעורי הבית: לא מאוד עמוסים, לא הייתי משקיעה בהם יותר מדי זמן לפני פתיחת רפרנסים פשוט כי אין בהם הרבה תועלת ללמידה למבחן.\n\nהמבחן: יש להשקיע זמן בלהתכונן אליו נטו בגלל שהוא אמריקאי וזה סוג שאלות שצריך להתרגל אליו, הרבה פעמים תצליח לפתור מבחן גם בלי יותר מדי הבנה של החומר ונטו מתוך מלא דוגמאות נגדיות שמצליחים להוציא.\n\n\nהשורה התחתונה: לדעתי כן כדאי להתעמק קצת ולהבין את החומר ולפחות את התכלס של הקורס, כי הוא מעניין. \nחשוב לבוא עם ידע חזק באלגברה, קבוע יש כל מבחן 2 שאלות לפחות שהצלחתי לפתור נטו עם ידע מאלגברה.", "timestamp": 1678293908297}, {"author": "BaronCabbage", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיקי אלעד מוקלט\nחוות דעת - הרצאות: מיקי אלעד הקליט ייעודית את כל ההרצאות והתרגולים כדי שזה יהיה זמין לסטודנטים וזה רעיון ממש טוב אפשר להרביץ את ההקלטות השבועיות בצפייה על כפול 2 הוא מסביר את החומר מעולה והחומר עצמו ממש מעניין - אישית היו דברים שנגנבתי עליהם ממש\n\nשם המתרגל/ת: מיקי אלעד מוקלט\nחוות דעת - תרגולים: התרגולים קצת מיותרים כי הם בעיקר חזרה על החומר ודמואים במאטלב שממש ממש מגניבים ומעניינים אבל לא תורמים כל כך להבנה, פותרים אולי תרגיל אחד וגם זה לא רלוונטי מידי\n\nשעורי הבית: 5 ת''ב שכל אחד לוקחת כמה שעות ופחות או יותר מתחלק כך:\nרבע לבצע ידנית אלגוריתם\nרבע ptsd לאלגברה ליניארית עם איזה הוכחה\nרבע לרפרנס כי לא ברור מה רוצים ממך\nורבע מטלת מאטלב\n\nהמבחן: המבחן אמריקאי, הוגן ממש, דף נוסחאות נורמאלי זה חשוב והרבה פעמים יש מלא טריקים מליניארית שחשוב לזכור וממש לשים לב לקטנות ולפסול תשובות כמו פסיכומטרי\n\nהשורה התחתונה: קורס אחד היותר מעניינים שעשיתי, נוח והסגל מעולה באופן כללי, מומלץ לכולם לעשות אותו בסמסטר השני ולא לדחות", "timestamp": 1678656895636}, {"author": "מה הטעם?", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיקי אלעד - מוקלטים (הרצאות + תרגולים)\nחשבתם שאתם אוהבים את צנזור? חכו שתכירו את מיקי אלעד.. המרצה הכי טוב שפגשתי עד כה. הן ברמת הבהירות והן ברמת העניין. פשוט תראו את המוקלטים.\n\nשעורי הבית: \nממחישים חלק מהחומר.\nבאחת ההגשות מכינים מסווג לינארי לספרות 0-9 ואני לא מגזים, זאת המשימה הכי מעניינת שקיבלתי עד כה בשיעורי בית בטכניון\n\nהמבחן: \nלא קשה. מי שידע את החומר הצליח\nהשורה התחתונה: \nקורס מעניין וחשוב בטירוף למי שמעוניין בתחום של דאטה ושל למידה, מיקי אלעד הופך את הקורס הזה למהנה", "timestamp": 1679378865542}, {"author": "SM", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יניב רומנו\nחוות דעת - הרצאות: יניב מרצה מדהים, מרגיע וברור. ההקלטות של מיקי מעולות אבל לדעתי כן שווה להגיע גם להרצאות, בטח עם יניב.\n\nשם המתרגל/ת: חן דוידוב\nחוות דעת - תרגולים: מבין את החומר לחלוטין ויודע להסביר על הכול.\n\nשעורי הבית: מרופרנסים בחלקם, ארוכים אבל מאוד עוזרים להבין את החומר.\n\nהשורה התחתונה: הקורס הכי מעניין עד עכשיו.", "timestamp": 1687367807164}, {"author": "בנאי נתונים", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה והמתרגל: מיקי אלעד (מוקלט)\nחוות דעת - הרצאות ותרגולים: \n\nכל מה שנאמר עליו נכון. הוא מרצה מצוין ורואים את זה גם בהרצאות וגם בתרגולים. \n\nשעורי הבית: \n\nארוכים טיפה אבל חשובים.\n\nהמבחן: עוד נראה\n\nהשורה התחתונה: קורס שבסוף עניין אותי מאוד, למרות שלא נכנסתי אליו במחשבה שהוא הולך להיות טוב כל כך", "timestamp": 1689408712893}, {"author": "*", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יניב רומנו\nחוות דעת - הרצאות: \nמרצה ממש טוב לדעתי. יש לו המון ידע וכיף להקשיב לו. אכפת לו מהסטודנטים, תמיד עונה לכל השאלות בהרחבה. אצלנו הרוב ראו מיקי מוקלט אז היו ממש מעט אנשים בהרצאה וזה דמה לתרגול מבחינת יחס אישי.\n\nשם המתרגל/ת: חן דוידוב\nחוות דעת - תרגולים: \nעברתי את רוב המתרגלים של הקורס וחן ללא ספק הכי טוב. בקיא בחומר, עונה על שאלות ומסביר בצורה ברורה.\n\nשעורי הבית: \n5 גליונות להגשה לאורך הסמסטר. קצת ארוכים במיוחד אם מקלידים אבל סופר עוזרים להטמעה והבנה של החומר.\n\nהמבחן: \nאמריקאי. קשה ומבלבל. הדרך הכי טובה להתכונן היא לעשות כמה שיותר שאלות בסגנון הזה וללכת לשעות קבלה.\n\nהשורה התחתונה: \nחומר סופר מעניין ורלוונטי וקורס ממש מושקע. אני נהניתי חוץ מהמבחן :)", "timestamp": 1691507411252}, {"author": "מוחמד עסאף", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מיקי אלכד מוקלט\nחוות דעת - הרצאות + תרגולים הוא מרצה מדהים לאני חושב עליו כמו שחושב על צנזור באינפי\n\nשעורי הבית: היו קצת ארוכים אבל בסוף הכל מסתדר.\n\nהמבחן: לדעתי היה ממש מבחן קשה ודומה מאוד בבלבול שלו למבחן שהיה באביב 2021 היו בו מלא טעיות ושאלות שלא רגילים אליהם גם כן הפ פרסמו פתרון ומחקו אותו בגלל כל מני טעיות\n\nהשורה התחתונה: נהניתי מהקורס אבל המבחן היה ממש מבאס", "timestamp": 1691603201203}, {"author": "ריבוע פחות", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "יש הקלטות טובות של הרצאות ותרגולים של מיקי אלעד. (רשום באתר הקורס שזה מכסה את כל החומר).\n\nשעורי הבית: \n5 גליונות לא קצרים, רוב השאלות ממוחזרות מסמטרים קודמים. 15% מגן, ואם יש מטלה עם ציון נמוך מהמבחן אז המגן הוא 10% עבור 4 המטלות עם הציון הכי גבוה.\nאם מגישים מוקלד אז יש בונוס של עד 10 נקודות (בחישוב המגן הציון של כל מטלה חסום ע\"י 100). \n\nהמבחן: \n15 שאלות אמריקאיות.\nמועד א' הסמסטר היה ברמה גבוהה יותר מסמטרים קודמים (חוץ מאביב 2021) והממוצע של המבחן היה נמוך ביותר מ- 20 נקודות מסמסטר קודם.\nהיו 4 שאלות קשות (באחת מהן הסגל טעה ולכן קיבלו 2 תשובות), 2 שאלות לא קשות אבל עם הרבה חישובים ובכך קל לטעות בחישוב ולסמן תשובה דומה, שאלה אחת מבלבלת בגלל הגדרה, והשאר בסדר.\n\nטיפים למבחן:\n- מותר להביא דף נוסחאות של עד 4 דפים דו\"צ (8 עמודים). יש כמה דפי נוסחאות בדרייב אבל תבדקו אותם טוב כי יש טעויות.\n- אם יש שאלה במבחן על פירוק כלשהו אז תשאלו מתרגל מה המבנה של כל מטריצה בפירוק (למשל הייתה שאלה על פירוק LDV, ולפי ההגדרות בהרצאות ובתרגולים, באלכסון של D אין אפסים, אבל לפי התשובה הנכונה זה בסדר שיהיו אפסים באלכסון).\n- מטריצה סימטרית (אם היא לא סימטרית אז המשפט לא נכון) היא חיובית מוגדרת אם\"ם כל הערכים העצמיים שלה חיוביים והיא חיובית חצי מוגדרת אם\"ם כל הערכים העצמיים של אי-שליליים.\n- אם מטריצה ממשית (לא בהכרח סימטרית) היא חיובית מוגדרת אז גם כל מטריצה שהיא כפל שלה בסקלר חיובי היא חיובית מוגדרת, וגם המטריצה המשוחלפת שלה היא חיובית מוגדרת. אותו דבר עבור חיובית חצי מוגדרת.\n- מטריצה חיובית מוגדרת היא בפרט חיובית חצי מוגדרת.\n- סכום של מטריצה חיובית מוגדרת ומטריצה חיובית חצי מוגדרת הוא מטריצה חיובית מוגדרת.\n- סכום של שתי מטריצות שהן חיוביות חצי מוגדרות יכול להיות מטריצה חיובית מוגדרת.\n- השחלוף של כל סקלר שווה לעצמו, לכן \nx^TAx + x^TA^Tx = 2x^TAx = 2x^TA^Tx\n- הע\"ע של A^T שווים לע\"ע של A.\n- מטריצה אורתונורמלית היא מטריצה ריבועית שכל העמודות שלה מאונכות (אורתוגונליות) ומנורמלות. אם המטריצה לא ריבועית אז היא לא אורתונורמלית.\n- אם העמודות של מטריצה A הן אורתונורמליות אז \nA^TA = I (לכן אם השורות אורתונורמליות אז AA^T=I כי השורות של A הן העמודות של A^T).\n- אם A הפיכה אז rank(AB)=rank(BA) = rank(B), כלומר הכפלה של מטריצה כלשהי B במטריצה הפיכה שומרת על הדרגה של B.\n- לבעיית ריבועים פחותים min||Ax-b||_2^2  תמיד יש פתרון, והוא יחיד אם\"ם עמודות A בת\"ל (כי אז המטריצה A^TA תהיה הפיכה).\n- בפרק של LS הוגדר היפוך מוכלל (pseudo inverse) רק עבור מטריצה עם עמודות בת\"ל. בפרק של SVD יש הכללה לכל מטריצה. היפוך מוכלל של A כפול A שווה ל- I רק אם A היא לא מטריצת האפס.\n- לכל מטריצה A, המטריצה A^TA סימטרית ולכן לכסינה והע\"ע ממשיים (והם אי-שליליים כי היא חיובית חצי מוגדרת). הערכים הסינגולריים של A שווים לשורשים של הערכים העצמיים של A^TA. אם A סימטרית אז A^TA = A^2 ולכן הערכים הסינגולריים של A שווים לערכים העצמיים שלה בערך מוחלט (כי שורש של סקלר a^2 שווה |a|).\n- לכל מטריצה ריבועית מסדר n יש n ע\"ע. הדרגה של מטריצה כזו היא n-r, כאשר r שווה לריבוי הגאומטרי של 0. אם היא לכסינה אז ר\"א = ר\"ג ואז הר\"א של 0 שווה לכמות שורות האפסים שיש לאחר הדירוג שלה.\n- בשיטות איטרטיוביות צריך לחשב את הרדיוס הספקטרלי של מטריצת האיטרציה T ולא של A.\n- התנאים שיש בהרצאות להתכנסות של Jacobi, GS הם מספיקים אך לא הכרחיים (למשל אם מטריצה A היא לא DD אז זה לא אומר ששיטת Jacobi לא תתכנס).\n- אם מטריצה היא DD אז היא הפיכה, אבל אם היא לא DD זה לא אומר שהיא לא הפיכה.\n- עמודות מטריצת Hadamard הן א\"ג, ואם הן מנורמלות אז המטריצה היא אורתונורמלית.", "timestamp": 1691671027228}, {"author": "שורד", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיקי אלעד (מוקלט)\nחוות דעת - הרצאות:  מצטרף להמלצות, מיקי מרצה מעולה ובאופן קבוע עד כה החומר המחייב הוא החומר המועבר בהקלטות של מיקי (לדעתי בצדק). (החומר מורכב אז אל תרגישו רע עם זה שצריך לעבור על כל דבר כמה פעמים וגם אז לא הכל תמיד מובן ב100 אחוז).\n\nשם המתרגל/ת: מיקי (מוקלט)\nחוות דעת - תרגולים: מי שאומר שהתרגולים לא חשובים לדעתי מטעה מאוד, לפחות 5 שאלות במבחן האחרון התבססו על חומר שנלמד רק בתרגולים ולא נגעו בו בכלל בהרצאות. \nחשוב מאוד להגיד- בחלק גדול מהתרגולים מופיעים יישומים של החומר והדגמות במאטלב, תבדקו עם צוות הקורס אבל עד כה ידע במאטלב לא נדרש במבחנים בכלל וניתן להצליח בלעדיו, חלק גדול מאוד מהיישומים נועדו ליצור עניין ומשיכה לתחום של למידה ואופטמיזציה כדי לעודד סטודנטים לקחת קורסי המשך בתחום (לפחות לתפיסתי כך זה התפרש) לכן אם אתם קצרים בזמן צריך לדעת לעשות את ההפרדה בין יישומים פחות חשובים למבחן כמו FLD לכאלו יותר חשובים כמו אלגוריתמים של שיטות איטרטיביות, אילוץ דרגה, גראם שמידט ועוד (בהם נדרשת לעיתים הבנה עמוקה בחלק מהשאלות במבחנים) וכדומה.  אני ממליץ מאוד לראות את בתרגולים גם את היישומים כי בשביל המגן של שיעורי הבית כן תצטרכו לעבוד קצת עם מאטלב והמגן לדעתי מאוד שווה את ההשקעה. (אם לא בא לכם לראות מוקלט ושון מתרגל אצלכם בסמסטר הייתי אצלו בהכנה למבחן והוא היה מעולה אז ממליץ ללכת אליו).\n\nשעורי הבית: לדעתי חוץ מקטעי הקוד (שאין כמעט), סופר חשובים בשביל לרענן ולראות שהבנתם את החומר בנושא הרלוונטי, מה גם שהמגן הציל הרבה מאוד חבר'ה אצלנו במבחן. ממליץ מאוד לעשות בלי רפרנסים ועם דף נוסחאות כדי להתחיל להבין עקרונות חשובים בכל נושא. אני כן אגיד כאן- תדרשו לקבל ציונים לשיעורי בית במהלך הסמסטר, הביזיון הזה של החזרת ציונים לתרגילי בית שבוצעו בתחילת הסמסטר תוך כדי תקופת מבחנים (כלומר שלושה חודשים לחכות לפידבק)  לא צריך לקרות באף קורס של אף פקולטה, בטח לא באופן שיטתי ויצא לי להתקל בזה רק בקורס פקולטיים של מדמ\"ח.  \n\nהמבחן: לא רוצה להפחיד אף אחד אבל בתור אחד שקיבל ציון גבוה (מעל 90) המבחן היה לא פחות מהזוי. תרגלתי מעל 15 מבחנים והמבחן היחידי שהיה ברמה יחסית דומה הוא מועד א אביב 21 (מועד ידוע לשמצה שלווה בפקטור רציני והתנצלות מהצוות). בכל אחת מהשאלות הייתה תשובה אחת של \"כל התשובות לא נכונות\" ולפחות 5 שאלות (מתוך 15) דרשו מיומנות או ידע שפשוט לא קיבלנו את הכלים בקורס כדי לפתור ולהגיע לתשובה סופית אלא רק להתלבטות בין תשובה כלשהי לתשובה של \"כל התשובות לא נכונות\" מה שהפך את המבחן למבחן שבודק את היכולת להמר. בדיעבד קיבלנו פקטור 10 נקודות ובחלק קטן מהשאלות (שבאחת מהן ממש הייתה טעות כי היו 2 תשובות נכונות) קיבלו 2 תשובות. אני רוצה להאמין שהמבחן היה חריג כי זו פעם ראשונה שרומנו אחראי ושממועד ב' והלאה יחזרו למבחנים שפויים והוגנים.\n\nהשורה התחתונה: קורס מעולה, סופר מעניין בעיקר למי שהתחבר לאלגברה לינארית. חשוב לציין שהחומר של הקורס ברובו ברמה יחסית גבוהה ודורש הבנה עמוקה כדי להצליח במבחן, מה גם שכמות החומר גדולה מאוד ובגלל זה לא כדאי להזניח במהלך הסמסטר . ממליץ מאוד מאוד על הדיונים המוקלטים של איתי בפנופטו.\nחייב להגיד- פגשתי את רומנו פעם ראשונה במבחן והרגיש לי שהוא הגון ואני באמת חושב שלא הייתה כוונה להכשיל. אבל מנגד, אפילו שלמדתי מהמוקלט הייתה הרגשה רצינית של זלזול מהצוות לאורך כל הסמסטר (דוגמת שיעורי הבית). מקווה שיהיה לכם צוות טוב כי זה אחלה קורס.", "timestamp": 1691940511995}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רומנו יניב + מיקי מוקלט\nחוות דעת - הרצאות: יניב מרצה טוב, מעביר את החומר בצורה מובנת ועונה על שאלות. כמובן שגם מיקי. הבחירה בינהם תלויה רק בהעדפה שלכם בין מוקלט לפרונטלי, העברת החומר כמעט זהה.\n\nשם המתרגל/ת: מיקי מוקלט\nחוות דעת - תרגולים: \nהיייתי אצל רוב המתרגלים, התרגולים מועברים במצגות ונראה שהמתרגלים לא תמיד יודעים בעלפה את הפתרון לתרגילים שהם מציגים. בנוסף, בגלל שהחומר מועבר במצגות אין (לפחות לי) מספיק זמן לסכם, ובלי לסכם התרגולים דיי משעממים, למרות שהחומר מעניין. לכן עברתי למוקלט כדי שאוכל לסכם.\n\nשעורי הבית: \nשיעורי בית חשובים ולא קשים במיוחד, אבל יכולים לקחת הרבה זמן אם מגישים מוקלד ללא ניסיון בלהקליד תרגילי בית (קיבלנו 10 נק' בונוס על מוקלד). יש בשיעורי בית מטלות עם קוד MATLAB, המטלות עצמן מאוד רלוונטיות לקורס אבל המבחן לא כולל קוד בכלל, לכן ממומלץ להשתמש בChatGPT אם נתקעים בבאגים או קשיים בשפת MATLAB כי לא מלמדים איך להשתמש בה בקורס.\n\nהמבחן: \nכולו אמריקאי, מועד א' היה קשה הסמסטר, ממוצע 61.4 לפני פקטור. הרבה שאלות מכשילות וכמה שאלות שהתשובה הנכונה היא \"אף תשובה לא נכונה\", ואפילו בפתרון השרמי היו טעויות. בהתאם קיבלו מספר תשובות נכונות ותשובות נכונות חלקית בכמה שאלות, והיה פקטור של 10 נקודות. בשני הסמסטרים הקודמים היה מבחן הרבה יותר קל. צריך לתרגל את מבחני העבר כדי לראות את כל הטריקים, ולהכין/למצוא דף נוסחאות טוב ולתרגל איתו כמה שיותר מבחנים. לרוב המבחנים אין דרך לפתרון, רק תשובה סופית, לכן מומלץ להתחיל לתרגל מבחנים ללא פתרונות מוקדם לפני השאר כדי שיהיה סיכוי גדול יותר שיענו לכם בפיאצה בזמן קצר.\n\nהשורה התחתונה: \nקורס מאוד מעניין, נותן נגיעה בלמידת מכונות ורואים שימוש של החומר שנלמד באלגברה א'. למי שמסכם אני ממליץ לסכם מהקלטות כי רצים על שקופיות בהרצאות ותרגולים, ואם נשאר זמן ללכת להרצאות. לתרגולים הייתי הולך רק אם יש משהו לא מובן מהמוקלט, אבל לי אישית זה לא קרה.", "timestamp": 1692522834573}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מיקי מוקלט\nחוות דעת - הרצאות: ההרצאות המוקלטות של מיקי מעולות, הוא מרצה מעולה! הוא יודע להסביר את החומר ממש טוב ולהנגיש אותו לסטודנטים. ממליצה מאוד.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: רוב הסמסטר לא הלכתי לתרגולים וראיתי מוקלט (שזה גם אחלה, פשוט באסה שאי אפשר לשאול ככה שאלות) ואז התחלתי ללכת לתרגולים של שון לקראת הסוף, מתבאסת שניסיתי ללכת אליו כלכך מאוחר - מתרגל מעולה! מסביר את החומר ברור, עונה על שאלות.\n\nשעורי הבית: אם מקשיבים להרצאות ולתרגולים, תרגילי הבית לא מאוד קשים. אפשר להיעזר במצגות בשביל לפתור אותם, וגם להכל יש רפרנסים.\n\nהמבחן: ניגשתי למועד א, היה לתחושתי ממש קשה אבל הסגל היה בסדר גמור והיה גם פקטור וגם על כמה שאלות בסוף קיבלו כמה תשובות נכונות\n\nהשורה התחתונה: קורס ממש מעניין, נהניתי ללמוד אותו והסגל אחלה. ממליצה ממש על ההרצאות המוקלטות של מיקי!", "timestamp": 1704921268373}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "המרצה + המתרגל: מיכאל אלעד (מוקלט)\nחוות דעת: מיקי מעביר את החומר בצורה מעניינת ושמים לב שהוא שולט בחומר. החומר הוא כבד ומלא במידע ולוקח זמן לפעמים עד שאסימונים נופלים, עם זאת זה מאוד חשוב לוודא הבנה של החומר כי בסמסטר הזה המבחנים היו קשים יותר (ראו ממוצע ביחס לשנים קודמות) וההצלחה הייתה מאוד תלויה ברמת ההבנה העמוקה והגאומטריה של החומר.\nיש עכשיו פתרונות מלאים למבחנים מה שמאוד עוזר. \n\nחוות דעת - תרגולים: התרגולים ברובם חזרה על החומר בשונה מהרבה קורסים בפקולטה, לדעתי הם עם חשיבות פחותה ביחס להרצאות, אבל צריך להבין את השורות התחתונות של הניסויים והמטריצות שבונים שם כי לפעמים שואלים על זה במבחן.\n\nהמבחן: אמריקאי, דורש הבנה טובה של החומר, אבל יש שאלות מתנה ומוטיבים חוזרים.\n\nהשורה התחתונה: \n1. לא להיבהל מההדגמות במטלב, עד עכשיו חוץ מש.ב אין צורך ושימוש במטלב במבחנים.\n2. הקורס בנוי היטב מסודר ויש רצף ברור מאוד.\n3. המונחים וההבנה של החומר (בעיקר LS והטלות) צריכים לשקוע ולכן כדאי לעבור על החומר שוב ושוב במהלך הסמסטר.\n4. אם רואים מוקלט אל תשימו את ההרצאות והתרגוליחם באותו יום - זה כבד.\n\nבהצלחה!", "timestamp": 1706785785316}, {"author": "אליהו", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיקי אלעד - מוקלט\nחוות דעת - הרצאות: \nההרצאות טובות, החומר לא פשוט.\nשם המתרגל/ת: ארקדי\nחוות דעת - תרגולים: \nאחלה מתרגל. טיפוס קצת מצחיק עם הרבה סיפורים טובים על מבחנים רעים. \nשעורי הבית: \nסבירים לגמרי. יש רפרנסים.\nהמבחן: אמריקאי, קל.\n\nהשורה התחתונה: \nקורס מעניין, החומר קשה והמבחן קל.", "timestamp": 1715184048999}, {"author": "bruh", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יבנה עירד\nחוות דעת - הרצאות: קול משמים ומרדים אבל רואים שהוא אוהב את הקורס ואת החומר שהוא מעביר. בכללי יש הכל מוקלט אז אין סיבה ללכת פרונטלית\n\nשם המתרגל/ת: פיבן ארקדי\nחוות דעת - תרגולים: לא העביר את החומר במלואו, אבל שוב יש מוקלטים אז בתכלס לא צריך לבוא\n\nשעורי הבית: לא קשה מדי, אם יושבים מול החומר בו\"ז אפשר לסיים תוך כמה שעות. לפעמים היו תרגילים בmatlab ממש פשוטים\n\nהמבחן: אמריקאי 15 שאלות, למדתי יומיים וקיבלתי עובר\n\nהשורה התחתונה: בסדר כזה", "timestamp": 1716572103293}, {"author": "Refael hadad", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מיקי הרצאות מוקלטות. אין מה להכביר במילים. מיקי מרצה נהדר והמוקלטים שלו ממש איכותיים - כל הרצאה שלו היא הופעה. אם הוא מרצה בסמסטר שלכם - לכו אליו פיזית. אם לא, צפו בהקלטות שלו. \n\nשם המתרגל/ת: פיבי ארקדי\nחוות דעת - תרגולים: אין אין אין על ארקדי הבנאדם הוא המתרגל הכי טוב בטכניון by farrr\nעברתי על הרבה מתרגלים אבל אף פעם לא נתקלתי במתרגל עם שילוב כה מוצלח של ידיעה עמוקה של החומר, יכולת להעביר אותו בצורה עמוקה בקלילות, התחשבות בסטודנטים והכי חשוב חוש הומור משובח וחיוך תמידי. הבנאדם יודע איך להעביר תרגול בצורה מהנה תוך כדי כך שהוא דואג שתדע כל מה שאתה צריך למבחן ואף מעבר. ארקדי היה מתרגל בקורס הרבה שנים ואף מתרגל בקורסי המשך של הקורס. הוא יודע מה הסטודנט צריך לדעת בדיוק עבור המבחן ויודע היכן כדאי להשקיע עוד 5 דקות כדי שהסטודנט יבין משהו חשוב בצורה איכותית והיכן אפשר לדלג או להעביר בצורה שטחית (כמובן בהתאם לרצון הסטודנטים שבתרגול). באמת שאין על ארקדי, אני ממליץ לכם בחום ללכת אליו. מי יודע? אולי אף תזכו לראות את אחד מהשרטוטים הרב ממדיים שלו (אתם תזהו אותם אם\"ם תראו גמל מטושטש על הלוח). כשהתחלתי את הקורס חשבתי שאני לא ממש אתחבר לנושא כי לא הסתדרתי עם אלגברה אמ לפני אבל ארקדי הצליח להעביר את החומר בצורה כל כך טובה והחומר אשכרה התחיל להיראות כיפי. וכן בסוף זה השתלם והוצאתי 100. רוצים גם ציון גבוה ? רוצים לפנק את הממוצע שלכם בעוד כמה מספרים עשרוניים? עשו לעצמכם טובה, לכו לארקדי\n\nשעורי הבית: קלילים, 4-5 שעות בזוגות וסיימתם. \n\nהמבחן:  אמריקאי, קליל בקושי מפתיע אחרי מעבר על הרבה מבחנים באתר הקורס. 90+ אם אתם רק טכניים. עם הבנה אפשר לקבל 95-100 בכיף. \n\nהשורה התחתונה: אחלה קורס, מעניין מאוד. מקווה לראות קורסים דומים לו בהמשך.", "timestamp": 1718057624507}]}