{"posts": [{"author": "SR", "difficultyRank": 2, "generalRank": 4, "semester": "201801", "text": "שם המרצה: רון רוטבלום\nחוות דעת - הרצאות: לדעתי רון מרצה מעולה. בחצי הראשון של הקורס הייתי אצל גדי אלכסנדרוביץ' שהוא מרצה תותח, אבל ההרצאות שלו היו מפוצצות בקטע מוגזם מה שגרר כל שנייה שאלות והתקדמות איטית של החומר. אצל רון ההרצאות יותר זרמו ולכן היה אפשר להתקדם בצורה יותר סבירה בחומר, ובכל זאת הוא היה משאיר זמן לשאלות.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: שונית מתרגלת תותחית. על אף שהיה מדובר רק בשעה של תרגול (נכון לחורף 18-19), עדיין היא הספיקה לעשות כמעט כל מה שצריך בשעה הזו ובכל זאת לענות על שאלות תוך כדי. מתרגלת מאוד ברורה ומסודרת.\n\nשעורי הבית: שיעורי הבית לא עמוסים. יש תרגיל אחת לשבועיים, ואפשר לסיים אותם עם יום עבודה.\n\nהמבחן: המבחן היה מאוד קל, ואפשר גם לראות את זה לפי הממוצע של אותו סמסטר. מה שכן, לשים לב להיות פורמלי כמה שיותר, כי דווקא מפני שהמבחן יחסית קל הם יכולים להוריד ניקוד על כל אי דיוק.\n\nהשורה התחתונה: סה\"כ מדובר בקורס מאוד בסיסי שהמטרה שלו היא לשחק עם הגדרות. חביב ונחמד, ושימושי להמון קורסי המשך בתואר.", "timestamp": 1597746366139}, {"author": "Yan Tomsinsky", "difficultyRank": 2, "generalRank": 1, "semester": "201902", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה טובה, משקיעה בסטודנטים. ממליץ.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: תותח אמיתי, יודע את החומר לעומק ומסביר אותו בצורה מדהימה ואיטית.\n\nשעורי הבית: גיליון פעם בשבועיים. תרגילים קשים. יש רפרנסים מוקלדים מצוינים בדרייב.\n\nהמבחן: קל מאד יחסית לרמה המוצגת בתרגולים/הרצאות ותרגילי בית. מספיק 3 ימי למידה.\n\nהשורה התחתונה: קורס משעמם וחסר פואנטה. מאד פדנטי. בסמסטר ראשון מאד קשה להבין מה הולך שם ואת כל המושגים שמנחיתים עלייך אבל בסוף הסמסטר זה יחסית מסתדר.", "timestamp": 1597752861228}, {"author": "דניאל", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: \nמרצה מאוד נחמדה. עונה על כל השאלות ומעבירה באופן מעולה את החומר.\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: \nבכל תחילת תרגול הוא עושה חזרה מקיפה על החומר שיהיה בתרגול ,ככה שלא משנה ממש אם ראיתם את ההרצאה.\nשעורי הבית: \nלכל גיליונות הבית יש רפרנסים באתר הקורס של הסמסטר הקודם. הגיליונות פתירים ותואמים מאוד את החומר הנלמד בקורס. ההגשה לא חובה אבל אני ממליץ לעשות אותם כי הם דומים לשאלות שיהיו במבחן.\nהמבחן: \nמבחן הוגן מאוד שאפשר לקבל בו בקלות 90+ אם לומדים כמו שצריך במהלך הסמסטר. השאלות במבחן תואמות לגמרי את השאלות מהתרגול ומגיליונות הבית (חלקן אפילו קלות יותר).\nהשורה התחתונה: \nמי שמתרגל ומבין את החומר בהמהלך הסמסטר לא יתקשה להוציא ציון גבוה במבחן.", "timestamp": 1597829031066}, {"author": "שחר", "difficultyRank": 1, "generalRank": 2, "semester": "201901", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: הרצאות טובות שמעבירות את כל החומר מבחינת משפטים שניתן להשתמש בהם במבחן. הרצאות קצת משעממות ואיטיות. שרי עונה על כל השאלות עד שמובן.\n\nשם המתרגל/ת: הדר\nחוות דעת - תרגולים: בתרגולים פותרים תרגילים דומים לשיעורי הבית/ מבחן, ולומדים את רמת הפורמליות (המאוד גבוהה) המצופה במבחן. הדר מתרגלת מעולה, מעבירה שיעור כיפי ומעניין. נותנת טיפים טובים לפתירת תרגילים.\n\nשעורי הבית: לא חובה ואין עליהם ציון, לא פתרתי או הגשתי. כדאי לפתור בתור הכנה למבחן/ בוחן אמצע. בוחן אמצע מתבסס כולו על שאלות מתרגילי הבית.\n\nהמבחן: הוגן, אך צריך לשים לב לפורמליות התשובות, דבר שיורדות עליו הרבה נקודות.\n\nהשורה התחתונה: קורס בסיס, דיי משעמם ומאוד פורמלי.", "timestamp": 1598179047022}, {"author": "...", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה פשוט מעולה, מצחיקה, נחמדה, ברורה ויסודית. מעבירה את החומר בצורה קלילה ונעימה, מומלצת בחום!\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: המתרגל מספר אחד, יסודי, ברור ומובן- ללכת אליו בלי לחשוב פעמיים! דואג להסביר מכל הלב, נותן תחושה טובה וביטחון.\n\nשעורי הבית: אין חובת הגשה. שיעורים לא מסובכים מדי, כדאי לפתור למרות שאין חובת הגשה- השיעורים עוזרים להבין טוב יותר את החומר.\n\nהמבחן: המבחן היה פייר, לא קשה, משקף לחלוטין את הרמה המצופה בקורס.\n\nהשורה התחתונה: אחלה של קורס, לא קשה בכלל, מאד נחמד וקליל!", "timestamp": 1601502732997}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: לא רלוונטי\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: מגן, קלילים\n\nהמבחן: מבחן קליל\n\nהשורה התחתונה: קורס לא קשה במיוחד, טיפה השקעה ומקבלים ציון גבוה", "timestamp": 1601894072796}, {"author": "Venn", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יובל + שרי\nחוות דעת - הרצאות: בתחילת הסמסטר התחברתי בלייב ליובל (הוא היה די בסדר, הסביר ברור ומסודר), אבל בערך באמצע עברתי לראות את ההקלטות של שרי (משיקולי חיסכון בזמן) והיא גם מרצה מצויינת.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: שונית מדהימה- היא מסבירה מאוד ברור, ועוזרת מאוד לראות על מה שמים דגש ואיך כדאי לגשת לשאלה.\n\nשעורי הבית: לא חובה (אין עליהם מגן אפילו), אבל מאוד מומלץ לעשות כדי לקבל ביקורת על הפתרונות וכדי לתרגל.\n\nהמבחן: מועד א' היה ממש סבבה, ומועד ב' היה מזעזע ממה ששמעתי\n\nהשורה התחתונה: קורס נחמד, לא הכי מעניין אבל לא דורש המון המון השקעה בשביל ציון גבוה. מאוד קל לאבד אותו (בעיקר בגלל שההגשות לא חובה), אז חשוב מאוד להיות עם יד על הדופק.", "timestamp": 1607386108114}, {"author": "A", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מעולה ומסבירה בצורה מאוד ברורה\n\nשעורי הבית: כדאי לעשות שעורי בית \n\nהמבחן: מעוד א היה ממש כיף, מי שלמד היה פשוט מקבל 100, אני אישית עשיתי מועד ב והיה מזעזע", "timestamp": 1610738015170}, {"author": "פ", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות לא מסודרות ולא מעניינות עדיף להגיע רק לתרגולים\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: \nעדיף לבוא לתרגולים מאשר להרצאות", "timestamp": 1612279879856}, {"author": "Roni Schreuer", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה:שרי\nחוות דעת - הרצאות: מדהימה\n\nשם המתרגל/ת: אופיר\nחוות דעת - תרגולים: ברור מאוד!\n\nשעורי הבית: אחלה ומתאימים לעבודה ביחד\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1612353741902}, {"author": "Evyatar Ziv", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר שרי שינולד\nחוות דעת - הרצאות: הרצאות טובות, לעיתים המרצה קצת התעכבה על שאלות של אנשים שלא ממש היו קשורות להרצאה אבל סה\"כ ממליץ.\n\nשם המתרגל/ת: שי בן אסייג\nחוות דעת - תרגולים: התרגולים בקורס הזה סופר חשובים, למעשה כאן תראו חלק מהחומר לראשונה. כדאי להקפיד להגיע ולכתוב. עד כמה ששמעתי המתרגלים בקורס היו טובים כולם, ובכל אופן אני הייתי מרוצה מהמתרגל שלי.\n\nשעורי הבית: יש גיליון כל שבועיים בערך, חזרה טובה על החומר. ההגשות לא חובה, אבל כדאי להגיש כדי להבין מה צורת ההתנסחות שהקורס דורש.\n\nהמבחן: הוגן, לא קל ולא קשה הרבה יותר מחומר ההכנה.\n\nהשורה התחתונה: קורס חובה אז אין ברירה, אבל די מעניין ולא מתיש.", "timestamp": 1612361216324}, {"author": "אורטל", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: שרי מרצה מעולה, מסבירה היטב וגם כיף בשיעורים איתה. מומלץ!\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: שונית ממש תותחית, היא מסבירה בצורה מאוד טובה. \n\nשעורי הבית: לא חובה, אבל כדאי לעשות\n\nהמבחן: לעומת מבחנים משנים קודמות שהיו די קלים, המבחן היה בינוני-קשה\n\nהשורה התחתונה: זה לא קורס קשה במיוחד אבל כן צריך לעקוב אחרי החומר ולוודא הבנה של ההגדרות ושל הלוגיקה. מומלץ לעשות את שיעורי הבית למרות שהם לא חובה כי זה עוזר להבין.", "timestamp": 1612370569341}, {"author": "Ido Frankel", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שקי שינולד\nחוות דעת - הרצאות: \nמרצה טובה מאוד, מסבירה את החומר טוב, אבל לטעמי קצת איטית.\nהיה סמסטר קורונה אז הייתי רואה את ההקלטה במהירות גבוהה, לדעתי עדיף.\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מעולה!\nמעלה סיכומים מצויינים, סעיניי התרגולים חשובים יותר מההרצאות.\n\nשעורי הבית: יש 6 גיליונות, חשוב לא לזלזל ולהגיש, הקורס אמנם לא קשה, אבל קל ללכת לאיבוד בחומר.\n\nהמבחן:  הוגן, היו 4 שאלות.\n\nהשורה התחתונה: קורס חביב, לא קשה מדי, אבל חשוב לא לזלזל וללכת לאיבוד.", "timestamp": 1612381791663}, {"author": "חח", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות:  מעולה !\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: אין מתרגלות כמוהה, מובנת כל כך, מסודרת \n\nשעורי הבית: לא חובה\n\nהמבחן: יש שאלה אחת שהיא שווה 25 נקודות שבדרכ ממש קשה\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1612446822973}, {"author": "Y", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה ממש טובה ומעבירה את החומר בצורה כיפית ומעניינת.\n\nשם המתרגל/ת: שונית.\nחוות דעת - תרגולים: שונית מרצה מעולה ומשקיעה ממש בסטודנטים. מומלצת.\n\nשעורי הבית: קשים מאוד וארוכים, אבל מכינים אותך ברמה טובה למבחן.\n\nהמבחן: 3 שאלות היו הוגנות, אחת הייתה קשה.  \n\nהשורה התחתונה: קורס שמלמד על קונספטים מעניינים, אבל מלא בפורמליות. לא פשוט בכלל לדעתי בניגוד למה שהרוב כתבו פה.", "timestamp": 1612553129289}, {"author": "Ariel Brock", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה:שרי \nחוות דעת - הרצאות: \nשרי מדהימה!! מסבירה בצורה ממש ברורה ומעניינת, עושה בתחילת כל הרצאה חזרה על ההרצאה הקודמת ונשארת בהפסקות כדי לענות על שאלות.\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: שי אחלה מתרגל.\nההסברים שלו ממש טובים והוא דאג להתעכב על שאלות עד שהכל היה ברור לכולם.\n\nשעורי הבית: לא חובה אבל הם עוזרים ממש להבין יותר טוב. ממליצה לפתור את כל השאלות גם אם לא מגישים.\n\nהשורה התחתונה: קורס נחמד,קצת משעמם אבל מאוד רלוונטי, יצא לי להתקל הרבה בחומר מהקורס הזה בקורסים אחרים.", "timestamp": 1612789977446}, {"author": "idan", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: השילוב המושלם בין אווירה טובה למקצועיות.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: עומר מתרגל תותח! תמיד ימצא את הדרך להסביר דברים אבסטרקטים באופן שניתן להתחבר אליו.\n\nשעורי הבית: קשים אבל עוזרים להבנת החומר\n\nהמבחן: יחסית לשנים קודמות היה לנו מבחן קשה לדעתי, באופן כללי ניתן לראות שהרמה של המבחנים עולה עם השנים, והממוצע יורד..\n\nהשורה התחתונה: קורס מעניין ולא קשה כל כך.\nהסגל של הקורס מדהים - לא עושה הנחות כמובן אבל הגישה שלהם לסטודנטים ראויה להערכה.", "timestamp": 1613130971798}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מעולה, משרה אווירה טובה והומוריסטית בשיעורים, מעבירה באופן ברור את החומר.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מעולה - מסודרת וסבלנית מאוד. \n\nהסמסטר הוסיפו אופציה לקבל שתי נקודות בונוס למי שמגיע לתרגולים בלייב (נאכף בעזרת שאלונים אקראיים) - זה יצר קצת בלאגן בתחילת הסמסטר כי הדרישה הייתה שהבונוס תקף רק למי שרשום לאותה קבוצת תרגול. אם הסגל ממשיך עם זה בסמסטרים הבאים, עדיף שיאפשרו את הבונוס לכל מי שמגיע לתרגול ולא רק אם הוא רשום אליו.\n\nשעורי הבית: לא חובה להגיש, אבל עוזרים מאוד לתרגל ולהבין את החומר, לכן מומלץ לעשות אותם בכל זאת כשהם יוצאים ולקבל משוב (כי יש דגש מאוד גדול בקורס הזה על ניסוחים ופורמליזם).\n\nהמבחן: הוגן - יש שם שאלות ברמה אפילו יותר קלה מהתרגולים ותרגילי הבית, ובדרך כלל יש שאלה אחת שהיא ברמה קצת יותר גבוהה. הם לא מחפשים להכשיל - מי שמבין היטב את תרגילי הבית, התרגולים, ההרצאות והמבחנים משנים קודמות יכול לקבל בקלות ציון גבוה. מומלץ מאוד כשעוברים על מבחנים משנים קודמות, להסתכל גם על הקובץ של \"טעויות נפוצות\" שהסגל מפרסם תמיד, ובנוסף להסתכל על סריקות, כדי להבין איפה הם שמים דגש.\n\nהשורה התחתונה: קורס נחמד ולא קשה למי שעל החומר כל הסמסטר. במיוחד לסטודנטים חדשים (שהם רוב הקהל של הקורס הזה) לוקח קצת זמן להתרגל לסימונים ולפורמליזם. הסגל מעולה ומאוד מקצועי ומתחשב.", "timestamp": 1613227604933}, {"author": "Shay Hacohen", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: שרי מרצה ממש טובה! אווירה כיפית בהרצאות והחומר עובר מצוין. עם זאת, חשוב לשים לב שחלק מהחומר עובר *רק* בתרגולים.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: שונית מתרגלת ממש טובה: מעבירה את דרך הפיתרון בצורה ברורה מאוד. התרגולים בקורס הזה ממש קריטיים כי רואים שם איך לפתור תרגילים מסוימים (שלא רואים בהרצאות) בפעם הראשונה.\n\nשעורי הבית: תרגילי הבית עוזרים מאוד להטמיע את החומר. התרגול היחיד שביצעתי לקראת המבחן היה לעבור על תרגילי הבית ולפתור אותם (לא הספקתי לפתור מבחנים בכלל), ולמרות שלא היה תרגיל מש\"ב במבחן, הם הכינו אותי לקראתו מצוין. עם זאת, אם העומס רב מדי במהלך הסמסטר, אלו שיעורי הבית הכי פחות \"דחופים\" (ביחס לאלו של אינפי, אלגברה ומבוא למדמ\"ח); לדעתי סביר לגמרי לפתור תרגיל או שניים בשבוע כדי לוודא שהחומר יושב בסדר, ולבצע מרתון תרגילי בית כהכנה למבחן. (מלבד, אולי, הגיליון הראשון והשני: בתחילת הסמסטר יש פחות עומס אז טוב לנצל את זה.)\n\nהמבחן: הוגן ממש. עם הבנה של החומר אפשר להוציא ציון מצוין.\n\nהשורה התחתונה: קורס מעניין וסגל טוב. נראה קצת מאיים בהתחלה, אבל הרבה פחות אחרי שנופל האסימון.", "timestamp": 1613492071403}, {"author": "קיפוד", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מסודרת מסבירה טוב את החומר. ממליץ מאד ללכת להרצאות שלה.\n\nשם המתרגל/ת: אמיל\nחוות דעת - תרגולים: היו פעמים שהוא רץ על החומר וסמסטר הקורונה לא עזר להבנה אבל סהכ אחלה מתרגל.\n\nשעורי הבית: יעזור לקבל משוב. אני לא עשיתי שיעורי בית עד לחודש לפני המבחן מה שגרם לי ליותר עומס בלמידה בשבועות האחרונים בקורס.\n\nהמבחן: היה הוגן. אם מתכוננים טוב לא יהיו הפתעות. חשוב לקבל משוב במהלך הסמסטר כדי לא לאבד נקודות סתם.\n\nהשורה התחתונה: אפילו שהנושאים נראים חסרי טעם ומרגישים לא קשורים למתמטיקה, הקורס מלמד לכתוב הוכחות פורמליות מסודרות. ברגע שמבינים את זה ומתרגלים מספיק ניתן להנות מהקורס ולהצליח בו.", "timestamp": 1613554349449}, {"author": "matan solomon", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה מעולה, הרצאות מעולות אין מילים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: לא קשה, חוזר על עצמו מתרגלים הרבה מבחנים וקולטים את הדפוס.\n\nהשורה התחתונה:", "timestamp": 1614082169519}, {"author": "A", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את החומר בקלילות עם דוגמאות וחוש הומור. \n\nשם המתרגל/ת: אמיל בראל\nחוות דעת - תרגולים: אחלה של מתרגל, קצת מבולגן והכתב שלו לא הכי ברור. אבל יש לו סבלנות מדהימה והוא תמיד מוכן להסביר ולהדגים כל דבר עד שכולם מבינים.\n\nשעורי הבית: גיליון אחת לשבועיים, פתיר לגמרי\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס סבבה, פורמלי מאוד.", "timestamp": 1614159849198}, {"author": "עדן ותד", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רון\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: \n\nשעורי הבית: מומלץ מאוד להגיש\n\nהמבחן: טוב\n\nהשורה התחתונה:", "timestamp": 1614349861861}, {"author": "Maya Lavi", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את החומר כמו שצריך.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: מסבירה היטב, לא מתפזרת, מובנת. לפעמים משאירה תרגילים נוספים במחברת שלה, כאלה שלא ראינו בשיעור, אז מומלץ להסתכל מדי פעם שלא פספסתם משהו.\n\nשעורי הבית: אחת לשבועיים (בערך), בקבוצות אך אין חובת הגשה. ממליצה מאוד לעשות לקבלת חוות דעת על אופן הכתיבה (אמנם המשוב מתקבל מאוחר, אבל לקראת המבחן טוב לדעת את רמת הפורמליות שלכם)\n\nהמבחן: יש הבדל מאוד גדול בין המרצים האחראים. תוודאו שאתם יודעים את החומר כמו שצריך, ושאתם יודעים לענות על שאלה ברמת הפורמליות שהם מצפים. אל תסתנוורו מהסגל המקסים כי הבדיקה די קשוחה.\n\nהשורה התחתונה: כמו בכל הקורסים, אם תהיו על זה ותדעו היטב את החומר אין סיבה שלא תוציאו ציון גבוה.\n*בעיקרון אם לא חובה לכם לקחת את הקורס, לא הייתי ממליצה עליו..", "timestamp": 1614941711604}, {"author": "Maplestory", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: נחמדה ברמות, מציגה את החומר כאילו הוא קליל. מלא שואלים שאלות והיא עונה לכולם. בקורס אין הרבה חומר אז היא מרשה לעצמה להיות נחמדה אבל זה נורא פוגע ביכולת להתמודד עם תרגילים שמגיעים בשיעורי בית או במבחנים בכלל.\n\nשם המתרגל/ת: נועה מראלי\nחוות דעת - תרגולים: נחמדה, עונה על שאלות. מתאמצת להשאר גם אחרי התרגולים לענות על שאלות נוספות. החומר שמביאים בתרגול ממש לא מספיק כדי לענות על שאלות בשיעורי בית ובמבחן.\n\nשעורי הבית: סבירים עד כדי קשים, יש רפרנסים אבל ממליץ לא לרפרנס עד שאתם בטוחים בתשובה וגם אז לנסות להגיש. מורידים במבחנים על כל שטות. על המבחנים שהם מציגים כפתרונות מלאים הם לא יביאו 100 אז להיות זהירים ממש.\n\nהמבחן: ללמוד רק מסריקות!!! מורידים על הכל, צריך לפרמל ברמה שלא מלמדים. יש שאלות תביניתיות שמופיעות בכל מבחן. מציגים את התבנית בתרגולים ובהרצאות ומי שמעתיק 1 ל 1 לא מקבל ניקוד מלא, חסר מלא דברים שלא מציגים(בכוונה!!!) כדי שלא תקבלו ציון גבוה כי הקורס \"קל\"...\nמפני שלקורס אין הרבה חומר נורא קל להתעלם ולהזניח אותו(לוקחים בדכ אינפי ואלגברה תו\"כ) אז אני ממליץ כן לשבת על השיעורי בית וכן לנסות לפתור בלי רפרנס כדי שהלמידה למבחן(עם סריקות) תהיה חלקה.\n\nהשורה התחתונה: לא כיף, אלא אם יש פטיש מוזר לפרמול לא אנושי.", "timestamp": 1614948593279}, {"author": "רועי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: שרי מרצה מצוינת, מקצועית, אדיבה ומעניינת. ממליץ בחום.\n\nשם המתרגל/ת: שונית אגמון/הדר.\nחוות דעת - תרגולים: שונית באמת תותחית ברמות גבוהות, מסודרת, מסבירה ממש ממש טוב את החומר הנלמד. ונותנת אינטואציה.\nהייתי בתרגולים גם הדר אבל לא כל כך ממליץ.\n\nשעורי הבית: קשים מאוד, אבל ברמה של מבחן, לנסות בלד ואחרי 30 דקות ללכת לרפרנס וללמוד ממנו טוב.\n\nהמבחן: מבחן הוגן.\n\nהשורה התחתונה: קורס ממש חמוד, מעניין ולדעתי מאוד חשוב לשאר הקורסים בסמסטר ראשון.\nממליץ ללכת לסדנאות שעוזרות המון, לראות מתרגלים פותרים את שיעורי הבית. ולתרגל המון שאלות שחוזרות על עצמן.\nזה נתפס לפעמים כקורס קשה אבל זה באמת קורס מאוד קל אחרי שמבינים.", "timestamp": 1615462910789}, {"author": "אכזבה עצמית", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: השילוב המושלם של אנושיות ואהבה למקצוע. מסבירה הכל ברור ועונה על שאלות, השיעור מאוד מסודר. מה שכן- שרי כל כך נחמדה שזה מתעתע- הקורס עצמו בכלל לא נחמד כמוה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא חובה, לא עשיתי\n\nהמבחן: רמה- קצת פחות משיעורי בית, הרבה יותר ממה שנלמד. הורידו לי המון נקודות סתם, יש בודקים עצבנים שמחפשים להכשיל. מורידים הרבה על פורמליות.\n\nהשורה התחתונה: *אל תעשו את הטעות שאני עשיתי:* זה קורס טכני עד כדי הקאה, פורמלי ברמות מוגזמות ורק מוסיף לשוק של סמסטר א'. מצד שני, בהתחלה הוא נראה מאוד קל ונורא מפתה לזלזל בו. מה התוצאה של זלזול+קורס מגעיל שדורש להיות על החומר ברמת פרטים קטנים מאוד? מועד ב שבהחלט לא יהיה לכם זמן או רצון לעשות אותו. אל תגיעו למצב הזה, עם כמה שלפעמים החומר מזעזע ברמת השעמום, תזכרו שהמרצה האחראי יבוא אליכם בהפוכה וידאג שתסבלו יותר זמן ממה שצריך. בהצלחה", "timestamp": 1615489152279}, {"author": "טל", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מצויינת! מעבירה את החומר מעולה, יוצרת אווירה כיפית אבל גם לא נותנת להתפזר\n\nשם המתרגל/ת: הדר פרנקל\nחוות דעת - תרגולים: רואים שחשוב לה שנבין ונצליח, אבל הייתה מפוזרת מדי ולא מסודרת לטעמי, ואני איבדתי אותה ברוב השיעורים. בשלב מסויים התחלתי לראות את ההקלטות של התרגולים של שונית, שהייתה בעיניי יותר מובנת.\n\nשעורי הבית: ארוכים ועוזרים רק חלקית, לא בטוחה שהייתי משקיעה בהם את האנרגיה. במיוחד שעכשיו אין שאלת שיעורי בית במבחן (או בוחן אמצע שמבוסס על שיעורי בית)", "timestamp": 1616231025702}, {"author": "catto", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: ההרצאות הועברו בצורה בהירה וברורה, שרי ממש נחמדה וסבלנית עבור שאלות\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: תרגולים מצויינים, המחברת של שונית מעולה בשביל סיכומים וחזרה למבחן\n\nשעורי הבית: ניתנים אחת לשבועיים, והם קשים. עם זאת, המבחן עצמו קצת פחות קשה\n\nהמבחן: יש דגש גדול על פרמול נכון והסבר לכל צעד שאתם עושים. לפעמים תיתקלו בשאלות שנראות מאוד ברורות, אבל ההוכחה לוקחת חצי עמוד. חשוב לעבוד על זה לפני, וגם בגיליונות בית לפרמל נכון\n\nהשורה התחתונה: לא לזלזל בקורס הזה, זה לא קורס קל, למרות שהוא נראה ככה ממבט ראשוני", "timestamp": 1626338568283}, {"author": "אדם גדבאן", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מהחלומות, מסבירה את החומר היטב.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: מאחד המתרגילים התותחים ביותר שפגשתי בתואר (אני סמסטר 4). מסביר היטב ומתעקש על הקטנות, מתייחס לסטודנטים באופן ממש מכובד ונוטה לעזור הרבה.\n\nשעורי הבית: \nקלולה, לא חובה\nהמבחן: \nקל, טריקי אבל קל. פרמול, פרמול, פרמול...\nהשורה התחתונה: קורס קל, חבל לא להוציא בו 90+.", "timestamp": 1626553617984}, {"author": "המלכסן", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שרי שינוולד\nחוות דעת - הרצאות: מרצה מעולה, מסבירה הכל כמו שצריך בצורה רציפה ושוטפת, ממליץ בחום\n\nשם המתרגל/ת: הדר פרנקל\nחוות דעת - תרגולים: זה היה המחזור האחרון שלה, אז לא רלוונטי\n\nשעורי הבית: לא חובה להגשה אבל ממליץ מאוד לעשות. יחסית קשים, אבל לא משהו שאי אפשר לפתור.\n\nהמבחן: מבחן טריקי אבל לא קשה במיוחד. אפשר להוציא בכיף מעל 90 עם מספיק חזרה על החומר וחזרה על מבחני עבר.\n\nהשורה התחתונה: החומר של הקורס נחמד. בתור מישהו שהיה בשעות קבלה של כל אחד מחברי הסגל, כל אחד מהם פשוט מעולה!", "timestamp": 1627579413042}, {"author": "Gil Shahar", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: משעממות קצת, היא כותבת את הכל מסודר אז לפחות החומר מועבר.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: היינו קבוצה קטנה, שונית כותבת על אייפד אז הארגון שלה הוא מעל ומעבר. לדעתי התרגולים שלה קצת מקובעים ומרגישים כמו הצגה. הייתי רוצה שיהיה יותר אדפטיביות להבנה הכללית של הסטודנטים ולפעמים שהסקריפט ישתנה. קרה הרבה פעמים שהיא רצה עם אחד הסטודנטים שהבין הכל בזמן שהרבה נשארו מאחורה.\n\nשעורי הבית: סתם קשים ביחס לחומר והמבחן\n\nהמבחן: קל אבל צריך היה להיזהר\n\nהשורה התחתונה: קורס סבבה אבל משעמם", "timestamp": 1634541810482}, {"author": "Shlomi Zvenyashvili", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה סבירה, החומר בקבוצות לא הכי מעניין, אבל אוטומטים כבר יותר נחמד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא היו חובה\n\nהמבחן: מבלבל וקצת מתחכם\n\nהשורה התחתונה: לא הכי נוראי בעולם", "timestamp": 1635093352259}, {"author": "שון", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שרי שיינוולד\nחוות דעת - הרצאות: הרצאות סבבה, לא היה משהו מיוחד\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: שונית מתרגלת מעולה, הכל ברור , מסבירה לעומק וממש מתחשבת בתלמידים, ממליץ בחום\n\nשעורי הבית: הגליונות היו לא להגשה אז לא עשיתי עקב עומס.\n\nהמבחן: המבחן היה הוגן לגמרי\n\nהשורה התחתונה: בגדול אין יותר מדי חומר בקורס, אני הפסקתי ללמוד אותו באמצע לגמרי עקב העומס והשלמתי לקראת המבחן, קורס נחמד שבעיקר מתמקד בפרמול של הסברים ומלמד ממש איך לנסח מתמטית פתרונות, סך הכל קורס שעם קצ השקעה אפשר להוציא בו ציון מלחיץ.", "timestamp": 1636382849703}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nראיתי מוקלטות מסמסטר אביב 2021, ההרצאות טובות, היא מסבירה דיי ברור את החומר אבל אל תצפו להבין איך לפתור את התרגילים מההרצאות זה בעיקר ההוכחות התאורטיות של המשפטים.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: גם כאן ראיתי מוקלטים של שונית מאביב 2021. שונית באמת מקסימה מעבר לזה שנעים להקשיב לה, היא באמת מעבירה מצויין את החומר, בצורה מאוד מסודרת - מומלץ.\n\nשעורי הבית: \nכדאי לעשות בעיקר בתחילת הסמסטר כשאין עומס לפחות שאלה מכל נושא, אני לא עשיתי וזה סתם גרם לכך שאת רוב הלמידה עשיתי רק לפני המבחן (וחבל).\n\nהמבחן: \nיש מגמה מאוד ברורה של העלאת רמת הקושי בבחינות שהתחילה בחורף 19-20. מאז המועד הזה הם התחילו לשים שאלות פחות סימפטיות באוטומטים (שבדרך כלל גם מנסחות בצורה מעורפלת). \nבמועד שלנו הם גם שמו שאלה מאוד קשה ושונה ממועדים קודמים בהפרכת למת הניפוח.\nבגדול 3 שאלות היו בסדר מתוך 5 - פעם המבחנים היו הרבה יותר קלים, חשוב לפתור את המועדים האחרונים כדי להבין את הרמה.\n\nהשורה התחתונה: \nבהתחלה לפחות תנסו להיות על זה בחומר כדי שלא תצטרכו להשלים את כל החומר של הקורס שבוע לפני המבחן.\nכדאי ללכת לסדנאות (ממליצה על עומר רפפורט) שבהן הוא פותר תרגילים מהשיעורי בית.", "timestamp": 1643722204428}, {"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה:  שרי\nחוות דעת - הרצאות: מעולות. יש לציין כי באתר הקורס נמצאים סיכומי שיעורים מלאים ומפורטים ואפשר בכיף לוותר על ללכת להרצאות ולקרוא את הסיכומים. הייתי גם בשיעור וגם קראתי את הסיכומים ואין דבר שנלמד בשיעור ולא הופיע בסיכום. מומלץ\n\nשם המתרגל/ת: עומר, שונית\nחוות דעת - תרגולים: שניהם מתרגלים מצוינים. רמה אחרת מכל שאר המתרגלים (והייתי אצל כמה). עומר המתרגל האחראי ומאוד עוזר לכתיבה פורמלית ומדויקת אבל יכול להיות קשוח לפרקים. שונית מסבירה מצוין וההקלטות שלה מאוד עוזרות\n\nשעורי הבית: לא להגשה, משוב רק על שאלה - או שתיים. לא ממש רלוונטי אם כי חשוב מאוד לעשות את הגיליונות כדי להפנים את החומר\n\nהמבחן: רמה די גבוהה. הייתה עלייה משמעותית מהסמסטרים שעברו. חובה לעשות את כל המבחנים מהאתר אבל הרמה בשנים הראשונות של הקורס לא מייצגת. המבחן של מועד א כולל גם חומר חדש שלא היה במבחנים שעברו.\n\nהשורה התחתונה: אתם בכל מקרה צריכים לעשות את הקורס כנראה, אבל תעשו אותו בסטייל", "timestamp": 1643908608823}, {"author": "The meme lord", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nנחמדה מאוד, אבל באיזשהו הרגשתי שההרצאות לא כל כך חובה\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: \nמתרגל מעולה, בעיקר כי ניכר (או שהוא מוכר את זה ממש טוב) שהוא אוהב ונהנה מהחומר בקורס. מעביר עם חיוך ועונה על כל שאלה.\nשעורי הבית: \nעקב אכילס של הקורס, בתור קורס יחסית תיאורטי, שנמדד על כתיבה, אין כמעט משוב. יש שישה גליונות שיעורי בית, שחייבים להגיש בקבוצות, ומתוכן נבדקת רק שאלה אחת. לאחר מכן מתפרסם פתרון כללי.\nהמבחן: \nהוגן מאוד, אין סיבה ללמוד ולא להצליח\nהשורה התחתונה: \nבסוף, החומר לא כזה מעניין. שבוע לפני המבחן לא ידעתי כלום, קראתי את הסיכומים שיש באתר ולבסוף הבנתי. סגל הקורס מעולה, ניכר שהם באמת רוצים בטובת הסטודנטים", "timestamp": 1644148770225}, {"author": "BaronCabbage", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרי \nחוות דעת - הרצאות: מרצה בסדר גמור באיזשהו שלב עברתי להקלטות משנה שעברה שלה היו טובות באותה מידה אולי אפילו יותר.\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: מצויין ללכת רק אליו. מסביר מעולה ועונה לכל השאלות \n\nשעורי הבית: לא חובה אבל ממש מומלץ לעשות בשביל להבין מה רוצים ממך. הבדיקה של ההגשות לא שווה כלום.\n\nהמבחן: אני חושב שבבגרות בהיסטוריה כתבתי פחות, הדגש העיקרי הוא על נימוקים ופורמליות ברמות לא סבירות.\nלשים לב ממש שבשנים האחרונות הרמה עלתה כמה מדרגות ולא ליפול לזה שהמבחנים הראשונים ממש קלים ונחמדים. למת הניפוח תמיד הייתה אותו הדבר חוץ מבמועד שלנו.\n\nהשורה התחתונה: קורס לא מעניין במיוחד, נחשב דיי קל אבל לא לטעות הוא לא כזה נחמד כמו שהוא נראה בהתחלה. אם ממש רוצים אפשר ללמוד את כל החומר מאפס בשבועיים האחרונים של הסמסטר. ולא לזלזל במבחן הרמה שלו רק עולה עם השנים.", "timestamp": 1644183791884}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה טובה מאוד, נתנה לנו הרגשה שהחומר קל והכל יהיה בסדר בסוף. ההרגשה הייתה מוטעית דרך אגב אז לא יודע אם זה דבר טוב או רע.\nהיו כמה נושאים שממש לא הצלחתי להבין מהסיכומים לפני ההרצאה, אבל ברגע שהיא הסבירה את אותם הנושאים הכל היה פתאום ממש ברור וקל.\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: אני חושב שזאת הפעם הראשונה שהוא מתרגל איי פעם. היינו צריכים להעיר לו כל הזמן שיגביר את הקול או שיכתוב בכתב גדול יותר כי היה קשה לראות ולשמוע אותו. הוא התבלבל הרבה ועשה את הקורס משמעותית יותר קשה בשבילי.\n\nשעורי הבית: קלים יחסית ומתאימים לרמה של המבחנים (רק חבל שזה מבחנים של סימסטרים קודמים, ולא הסימסטר הזה)\n\nהמבחן: רואים שבשנה-שנתיים האחרונות הם מנסים להעלות את הרמה של המבחנים, והסמסטר הזה לא יוצא מהכלל.\nהרמה עוד פעם עלתה מפעם שעברה והשאלות נהיות מבלבלות ומורכבות יותר. \n\nהשורה התחתונה: קורס נחמד ומעניין, אבל אסור להרגיש יותר מידיי בנוח איתו ולהזניח אותו לעומת אינפי ואלגברה. יש לו פוטנציאל להיות הקורס הכי קשה בסימסטר אם תזניחו אותו.", "timestamp": 1644255938073}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: מרצה טוב אבל מאוד מהיר, אם עוצרים אותו אז הוא מתעקב ומסביר פשוט צריך ולא לפחד לשאול. רואים שהחומר מעניין אותו וזה גורם לקורס להיות יותר מעניין.\nכיתה יחסית קטנה לזו של שרי אז נוח יותר לשאול שאלות.\n\nשם המתרגל/ת: שי גנדלמן\nחוות דעת - תרגולים: \nקצת מבולבל\nשעורי הבית: \nשיעורי בית לא חובה, מגישים אם רוצים בזוגות ומעלה בשביל פידבק בערך פעם בשבועיים\nהמבחן: בודקים את המבחן ממש נחמד (אני לא הבנתי נכון את השאלה ועניתי על משהו אחר והורידו לי 3/20)\nמבחן לא כל כך קשה\n\nהשורה התחתונה: קורס מעניין ולא קשה במיוחד", "timestamp": 1644439948076}, {"author": "Itamar", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: שרי מרצה טובה ומאוד נחמדה, אבל לדעתי קצת איטית בהעברת החומר. אני ראיתי את ההקלטות שלה משנה שעברה שהיו מצוינות.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: מתרגלת מצוינת. מעבירה שיעורים רק בזום אבל למי שזה לא מפריע מומלץ מאוד.\n\nשעורי הבית: גליון פתוח כל שבועיים, לא חובה להגשה אבל מומלץ להגיש כי מקבלים פידבק חלקי.\n\nהמבחן: מבחן לא קל, הקורס יחסית חדש אז החומר משתנה קצת בכל שנה ויש נושאים שאין להן שאלות במבחנים ישנים.\n\nהשורה התחתונה: קורס מאוד פרומלי, אז נתפסים להגדרות ומונחים ספציפיים. לעקוב אחרי החומר במהלך הסמסטר ולא להשאיר את הלמידה לסוף.", "timestamp": 1644482891537}, {"author": "ניצן חיים ליסטמן", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: שרי אלופה. יש אווירה טובה בהרצאות והיא מסבירה מעולה לדעתי. משאירה גם מקום לשאלות. בונסף היא כותבת הכל ב Onenote ככה שהכל זמין לצפיה מאוחר יותר \n\nשם המתרגל/ת: עומר \nחוות דעת - תרגולים: פשוט מלך. החיסרון היחיד הוא בשעות התרגול (אצלנו היה ארבע וחצי עד שש וחצי), אבל לדעתי ממש שווה את זה\n\nשעורי הבית: גליון פעם בשבועיים, לא מגן אבל מומלץ לעשות כדי להשאר בלופ של הקורס. קל להכחיש אותו ואז ללכת לאיבוד והגליונות משאירים אותך בכושר\n\nהמבחן: היה יחסית הוגן וגם די צפוי מבחינת המבנה\n\nהשורה התחתונה: קורס מגניב מאוד אני נהנתי", "timestamp": 1645045880352}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שרי \nחוות דעת - הרצאות: מרצה מעולה. הסברים טובים, לי הספיק גם להקשיב רק להקלטות של סמסטר קודם אבל אם אתם רוצים לשאול שאלות, היא מאפשרת גם את זה לא מעט.\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: לא הייתי בתרגולים. לדעתי די מיותר. עושים יחסית מעט שאלות בתרגול ועוברים עליהם לאט\n\nשעורי הבית: כדי מאוד לעשות, למרות שהם מגן. ממש בסטייל של המבחנים ועוזר להבין אם לא מבינים את החומר. ההבנה של החומר לאו דווקא אומרת שקל ליישם אותו ולכן שווה לוודא את זה בשיעורים.\n\nהמבחן: פייר לגמרי. במבחן שלנו היה קונספט קצת שלא הראו קודם אבל סך הכל אם מבינים לעומק את כל המושגים אין בעיה להכליל.\n\nהשורה התחתונה: קורס מהיותר חביבים בשנה הראשונה של התואר. כדי לא לזלזל, למרות שהוא פחות עמוס. נטפלים לפורמליות. אם יש לכם רקע קודם במושגים מתמטיים יהיה יחסית פשוט.", "timestamp": 1645463094315}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה מעולה. מסבירה בצורה ברורה ועם חוש הומור. נהנתי ללמוד אצלה. כותבת באייפד בONENOTE ככה שאפשר להתחבר ולראות הכל בלייב מסתנכרן ואפשר גם לראות אחרי זה.\n\nשם המתרגל/ת: שונית אגמון (בזום)\nחוות דעת - תרגולים: מצד אחד מסבירה מעולה, מאוד מאוד מסודרת ומשקיעה (כותבת באייפד ומעלה הכל לדרייב), מצד שני עמוסה ולפעמים עונה לכל שאלה קטנה, למרות שזה השתפר.\n\nשעורי הבית: גיליון פתוח פעם בשבועיים (אין WW). מומלץ מאוד לעשות ולא להכחיש. קשוחים אבל פתירים ומאוד מלמדים.\nההגשה אצלנו הייתה לא חובה (רק לטובת קבלת משוב), אבל מי שרצה אז רק בזוגות, וגם אז הבדיקה היא מדגמית (בגדול שני סעיפים נבדקים).\n\nהמבחן: הקורס יחסית חדש, ואפשר לראות את זה בא לידי ביטוי במבחנים. בהתחלה הם היו די בסיסיים, לאחר מכן הרמה עלתה ומסמסטר אביב 2020 כשהתחלף המרצה האחראי וד\"ר שאול אלמגור התחיל להיות אחראי על הקורס הרמה עלתה עוד טיפה והסגנון מעט השתנה. שאול חוקר את תחום האוטומטים ככה שהוא מאוד מתחבר לנושא ונלהב. זה יכול קצת לבוא להיות בידי במבחן. יותר שאלות חשיבה (נראה שמאוד אוהב שאלות הוכח/הפרך ושאלות בנייה של אוטומטים...).\nהתחושה המרכזית שלי הייתה שהמבחן בעיקר מבלבל וצריך לשים לב לכל פסיק ולכל סימן. אם שמים לב לכל דבר שכזה, הוא לגמרי פתיר ולרוב קל יותר מאינפי/אלגברה.\n\nהשורה התחתונה: קורס מעניין וחשוב שמהר מאוד משתמשים במה שלומדים בו באינפי/אלגברה. הבסיס של הבסיס של המתמטיקה שכדאי מאוד להבין טוב כדי להבין לעומק דברים אחרים. חשוב לשים לב למה שהמרצה האחראי מכוון אליו ולהיזהר לא ליפול בפח. אצלנו היו כמה מקרים בולטים כאלה במבחן.\nבקורס עושים שאלוני נוכחות (בחנים בתרגולים שרמת השאלות בסיסית ביותר, המטרה לראות שהגעת). מי שעונה נכון על 3/4 מקבל 2 נקודות בונוס לציון הסופי.\nבאופן כללי - סגל איכותי ביותר !\nבהצלחה !", "timestamp": 1645475925424}, {"author": "Daniel Hamzany", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מעניינות וחשובות, שרי מרצה מעולה ומצחיקה, שמעבירה את החומר באופן טוב ועונה על שאלות באופן מדויק \n\nשם המתרגל/ת: אסף ישורון ועומר רפפורט\nחוות דעת - תרגולים: שני המתרגלים מעולים ממש, שניהם נותנים טיפים חשובים ומסבירים את החומר באופן עמוק שמאפשר הבנה בזמן שפותרים תרגילים. כמו כן, חשוב להגיע לקבוצת הרישום אליה רשומים, כיוון שלאורך הסמסטר ישנם 4 \"בחני נוכחות\", ואם מצליחים ב3 מהם מקבלים בונוס של 2 נק' לציון הסופי.\n\nשעורי הבית: לא חובה, אבל מאוד מומלץ לעשות למרות שהם יחסית מאתגרים\n\nהמבחן: המבחן הכי קשה שהיה עד כה בקורס, למרות שזה לא אומר הרבה כי זה קורס די חדש. לקראת המבחן חשוב לעבור על המשפטים וההגדרות כדי שישבו טוב בראש, ומומלץ לפתור כמה שיותר ממבחני העבר כדי להיחשף לכל סוגי השאלות באופן נרחב\n\nהשורה התחתונה: קורס מעניין עם סגל מעולה, מאוד מומלץ", "timestamp": 1645494908963}, {"author": "שם", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: בערך באמצע הסמסטר התייאשתי מלהגיע להרצאות ועברתי להקלטות של שרי. הן די זהות אז זה היה נוח. שרי אחלה, אם כי מתקדמת קצת לאט לפעמים בשיעור וקל מאוד לאבד אותה\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: עומר תותח, אבל בגלל זה הכיתה שלו תמיד עמוסה ומפוצצת אז זה מרגיש לפעמים כמו עוד הרצאה ואין כל כך יחס אישי למרות שהוא מנסה - אז לשיקולכם\n\nשעורי הבית: לא היו חובה, לא עשיתי. עקרונית הם דורשים שההגשה תהיה בזוגות/קבוצות.\n\nהמבחן: אם חוזרים על מבחנים משנים קודמות אז לא אמור להיות משהו מפתיע. הטריקים חוזרים על עצמם והחומר לא כל כך מקיף כדי שיהיה מה לחדש יותר מדי\n\nהשורה התחתונה: קורס די פשוט מבחינת כמות חומר. לפעמים יש דברים קטנים שטיפה קשים להבנה/דורשים תרגול אבל סך הכול סביר.", "timestamp": 1645544604663}, {"author": "עומר", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי (הקלטות)\nחוות דעת - הרצאות: אחלה מרצה, קצת מונוטונית (אולי זה גם החומר), אבל מסבירה בצורה ברורה את החומר. ההרצאות מאוד חשובות במקצוע הזה כי אפשר להסתמך רק על מה שקורה בהן וחשוב להכיר את ההגדרות כפי שהן בהרצאה.\n\nשם המתרגל/ת: שונית (הקלטות)\nחוות דעת - תרגולים: מתרגלת מצוינת, מסבירה טוב את החומר. מתרגלת את הקורס מההתחלה שלו ורואים את זה.\n\nשעורי הבית: ללא שום השפעה רק בשביל משוב, ארוכים ולא קלים, אבל חשובים להבנה של החומר.\n\nהמבחן: דורש הכנה, אבל סביר ביותר.\n\nהשורה התחתונה: חומר לא מאוד מעניין, אבל גם קורס לא מאוד עמוס שאם לוקחים אותו ברצינות אפשר לקבל ציון גבוה.", "timestamp": 1645644731126}, {"author": "נוי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את החומר בצורה טובה ומתחילה כל שיעור עם משהו נחמד.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מתרגלת מעולה!!!\nהייתי איתה כשבעבירה שיעורים בזום וזה היה ממש טוב.\n\nשעורי הבית: \nאין חובת גשה אבל ממש מומלץ לעשות אותם.\n\nהמבחן:\nהמבחן לא פשוט רמת הקושי עלתה בסימסטרים האחרונים, מומלץ להשקיע בכתיבה פורמאלית נכונה ויהיה בסדר. \n\nהשורה התחתונה: קורס לא פשוט אבל אפשר להוציא בו ציון טוב.", "timestamp": 1646035647422}, {"author": "ES", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: שאול מרצה מצוין! ניכר שהוא אוהב את התחום ומוצא אותו מעניין, והוא מצליח להעביר את זה גם לסטודנטים. והוא גם לא רק מסביר את החומר היבש אלא נותן העשרה נוספת וזה הרבה יותר מעניין ומגוון ככה.\n\nשם המתרגל/ת: עומר רפופורט\nחוות דעת - תרגולים: וואו, איזה מתרגל מעולה! הלוואי שהוא היה יכול להיות המתרגל גם בשאר הקורסים שלנו... ההסברים שלו מאוד ברורים ומובנים, והיחס שלו סבלני וחיובי כלפי שאלות של סטודנטים. רק בזכות התרגולים של עומר הצלחתי בקורס הזה. הכיתות שלו תמיד מלאות, ובצדק. מומלץ מומלץ מומלץ!\n\n\nשעורי הבית: אין חובת הגשה ואין ציון על שיעורי הבית, וממילא בודקים ונותנים פידבק רק על תרגיל אחד מתוכם. מצד שני, ממש לא מומלץ לוותר עליהם, כי זאת ההזדמנות הכי טובה לתרגל כתיבה של הוכחות פורמליות (שזה באמת אחד הדברים היותר מאתגרים בקורס הזה) ולקבל פידבק וטיפים לליטוש של ההוכחות. מטעמי לוגיסטיקה, לא מאפשרים להגיש את שיעורי הבית ביחידים, וזה די מעיק, במיוחד שזה סמסטר א' ובהתחלה עדיין לא כזה מכירים אנשים וזה יכול להיות מאתגר למצוא שותף להגשות.\n\nהמבחן: המבחן היה הוגן בעיניי, לדעתי הוא תואם למה שלמדנו ולרמה של שיעורי הבית. בכל זאת היה פקטור ממש קטן, שלא היה זהה אצל כולם - הפקטור חושב ככה שהציונים הנמוכים קיבלו יותר פקטור ביחס לגבוהים, וזה יפה לעשות את זה ככה. הדבר הכי חשוב למבחן הזה זה לשנן ממש ממש טוב את כל ההגדרות והחומר התאורטי, תוודאו שאתם יודעים לדקלם את כל ההגדרות בע\"פ גם אם יעירו אתכם באמצע הלילה, זה באמת מה שיעשה את ההבדל. ועוד טיפ - כשאתם מתרגלים לקראת המבחן שימו דגש ותוודאו שאתם פותרים המון תרגילי ליכסון מכל מיני סוגים, פשוט תכירו את כולן ושאלת הליכסון תהיה קטנה עליכם.", "timestamp": 1646097272967}, {"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מרצה מצויינת! מעבירה את החומר בצורה ברורה ומעניינת\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: מסביר בצורה יסודית, ממליצה ממש\n\nשעורי הבית: אין חובת הגשה, אבל עוזרים ממש להבנה אז כדאי להשקיע בהם\n\nהמבחן: קשה, ורמה הרבה יותר גבוהה מהתרגולים ומשיעורי הבית. דורש הבנה של החומר אבל בזוך זה אפשרי ממש\n\nהשורה התחתונה: קורס שנוטים 'לזלזל' בו ולהקדיש לו פחות זמן, אבל זו טעות ! תשקיעו כל הסמסטר", "timestamp": 1647762346849}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שריי\nחוות דעת - הרצאות: מרצה טובה, אבל אפשר לוותר על ההרצאות ולראות את ההקלטות שלה, חוסך זמן והחומר עובר באותה צורה. אני עשיתי את זה רק לקראת סוף הסמסטר כי המבחן היה ממש ישר אחרי והיה צריך לסיים את החומר לפני קצב ההרצאות\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: תרגולים מדהימים, החומר עובר בצורה ברורה ועוזר לחדד נקודות מההרצאות ומראה איך אמורים לפתור שאלות מהשיעורי בית ובמבחן.\n\nשעורי הבית: הגליונות לא חובה ולא משפיעים על הציון אבל ממש כדאי לעשות אותם כי זה התרגול הכי טוב למבחן במהלך הסמסטר. ההגשה בזוגות אבל כדאי לעשות את כל הגיליון לבד ואז להשוות תשובות עם הבן זוג לפני ההגשה.\n\nהמבחן: המבחן פחות או יותר ברמה של מה שמלמדים בקורס ולא צריך לענות על השאלות בצורה כלכך פורמלית כמו בשיעורי בית.\nחשוב להיות חד על הלכסון ולמת הניפוח כי זה שתי שאלות שתמיד מופיעות\n\nהשורה התחתונה: קורס נחמד ומעניין לרוב, בכל מקרה חייבים לעשות אותו", "timestamp": 1647857484244}, {"author": "ירדן", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי שינוולד (הקלטות)\nחוות דעת - הרצאות: בדיוק מה שצריך לדעת כדי לעבור את הקורס, לא פחות ולא יותר. מרצה מעולה, מסבירה ענייני ונחמדה. אל תוותרו על ההרצאות, תצפו x2 ובתרגול תעמיקו בזה.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: יש קצת בעיה של חוסר תאימות למבחן (שלא באשמת שונית)- מתרגלים הרבה הוכחות ארוכות וכבדות שבסוף לא נשאלים עליהן במבחן מפאת אורכן, אלא על הוכחות יותר קצרות ופשוטות ושאלות הרבה יותר טכניות.\nשונית מתרגלת לא פחות ממדהימה. מסבירה מעולה, סופר בקיאה בחומר, עונה לכל שאלה (לפעמים אפילו לקצת יותר מדי שאלות) ובסבלנות ומשתדלת שיהיה שיעור פעיל ומעניין לכולם.\n\nשעורי הבית: אותה בעיה של חוסר תאימות למבחן, אבל בכל מקרה עוזרים להבין ולהטמיע את החומר- לא לוותר אחרת תתעוררו שבוע לפני המבחן ותגלו שאתם לא יודעים מה זה מתק\"א.\n\nהמבחן: תרגלו כמה שיותר מבחנים, לרוב אין הפתעות. הוגן בסה\"כ.\n\nהשורה התחתונה: לא להיות שאננים כי אמרו לכם שזה קורס קל. הוא פחות דורש מבחינת השקעה ושיעורי בית אבל בהחלט יכול לקחת זמן להטמיע את ההבנה. אל תוותרו על ציון טוב בו, זה אפשרי בהחלט.\n(דרך אגב- סגל הקורס הכי טוב שיש בפער)", "timestamp": 1648110909480}, {"author": "REL", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרי שינוולד\nחוות דעת - הרצאות: \nשרי מרצה נהדרת, כותבת כל הרצאה במחברת שיתופית שלכולם יש גישה אליה - מאוד נוח. מביאה הרבה דוגמאות לאינטואיציה. \n\nשם המתרגל/ת: דגנית \nחוות דעת - תרגולים: \nדגנית מאוד חמודה אבל התרגולים היו מיותרים. ממליצה במקום על התרגולים של עומר רפפורט ( המתרגל האחראי), או על הזום/ההקלטות של שונית אגמון - מסבירה מצויין, עם הרבה דוגמאות ומעלה את כל הרשימות שלה.\n\nשעורי הבית: \n5 גליונות, הגשה בזוגות ולא הייתה חובת הגשה. היו ברמה גבוהה - כמו של המבחן רק יותר ארוכים וסיזיפיים.\n\nהמבחן: \nלא קשה מידיי אבל התחושה היא שהרבה ממנו קם ונפל על הבנת הנקרא. הניסוחים היו מתעתעים. דומה מאוד ברמה למבחני עבר של השנתיים-שלוש האחרונות לכן מומלץ ללמוד מהם (מבחנים קודמים יותר היו ברמה יותר קלה).\n\nהשורה התחתונה: \nקורס חמוד מאוד, יחסית קליל ולא עמוס.", "timestamp": 1648323941874}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: לא להתלבט. להיכנס לעומר. מושלם\n\nשעורי הבית: גליונות לא חובה להגשה. אני לא הגשתי והסתדרתי עם החומר גם במבחן \n\nהמבחן: מועד א בדרך כלל ממה שראיתי לא קשה במתקא, לעומת מועדי ב' וג' אם יש. אז מומלץ לגשת בראשון.\n\nהשורה התחתונה: קורס כיפי. בהתחלה היה לי ממש קשה לקלוט אותו והוא היה לי יותר קשה אפילו מאינפי, אבל לקראת אמצע הסמסטר זה מתהפך מאוד מהר והוא נהיה מובן וסבבה.", "timestamp": 1657819365473}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: שרי\nחוות דעת - הרצאות:  מרצה סבבה , מסבירה יחסית טוב\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: מתרגל סבבה , מסביר יותר מידי, מרגיש לי שלא עושה יותר מידי תרגילים ומתמקד יותר בלהסביר איך לפתור כל סוג של תרגיל.\n\nשעורי הבית:  ארוכים ולא ממש מכינים למבחן, \nאבל כן חשוב לעשות אותם בשביל להבין את החומר\n\nהמבחן: המבחן היה מבחן הוגן\nתמיד יש שאלה של לכסון + למת הניפוח ( 99 אחוז מהמקרים) ולכן חשוב להבין איך לפתור תרגילים מהסוג הזה.\nלשאר השאלות הייתי ממליץ לעבור על הגדרות וחלק מהוכחות של ההרצאה + תרגול , שהן נותנות אינטואציה לפתרון\n\nהשורה התחתונה: קורס חביב לא עמוס מידי", "timestamp": 1657974682978}, {"author": "לא יודע מה זה רלוונטי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  שאול\nחוות דעת - הרצאות:  מרצה מעולה, קצת ממהר אבל מרגיש שהוא ממש אוהב את החומר ומתעניין בללמד. המרצה שהכי נהנתי איתו בשני הסמסטרים הראשונים. החומר בהרצאות די מקביל לתרגולים, אבל מגדירים הרבה דברים ועושים הרבה דוגמאות, שווה ללכת.\n\nשם המתרגל/ת:  אנטוניו\nחוות דעת - תרגולים: כבר לא מתרגל אז לא רלוונטי.\nדי מכפילים את ההרצאות, אבל הרבה יותר תרגול, בגלל שזה קורס עם מלא הגדרות שווה ללכת לשניהם.\n\nשעורי הבית: \nלא נוראיים, קצת הרבה עבודה כל פעם שיוצא גליון כי זה דו שבועי ונועד לעבודה בזוגות. מידי פעם יש סעיפים ממש קשים אבל הם בדרך כלל לא בבחינות.\n\nהמבחן: \nממש פדנטים על כל נימוק ומעבר. אבל בעייני אם מתרגלים לכתוב את כל הנימוקים לאורך כל הסמסטר זה לא כל כך נורא.\n\nהשורה התחתונה: \nקורס מעולה, ממליץ מאד :)", "timestamp": 1658303875377}, {"author": "anon", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: שרי מרצה מעולה! הייתי בכל ההרצאות שלה ולא וויתרתי עליהן, גם בהינתן הסיכומים באתר שדי זהים להרצאות, כי היא נתנה לי אינטואיציה בכמה נושאים, מה שעזר לי. גם אפשר לצפות בהקטות שלא פחות טובות כמובן, אבל צריך לוודא שהן רלוונטיות. \nגם כן בחצי הראשון של הסמסטר, באתי מוכנה להרצאות (כלומר הסתכלתי בסיכומים) כדי \"לספוג\" כ\"כ יותר מידע ולהתרכז בלקבל אינטאיציה ולשאול שאלות. \nהייתי כותבת את הכל אחריה אבל בסופו של דבר היא מעלה את הכל לאתר הקורס.\nשם המתרגל/ת: 2 התרגולים הראשונים הייתי אצל עומר, אח\"כ אצל דגנית\nחוות דעת - תרגולים: ממליצה מאוד על עומר כי הוא המתרגל האחראי בד\"כ וגם כ\"כ תותח... אבל אם מעדיפים יחס אישי אז הייתי ממליצה על דגנית. הכיתה שלה קטנה בד\"כ . היה כ\"כ חופש לשאול והייתה מקנה יחס אישי לסטודנטים, כי הכיתה הייתה קטנה. בד\"כ אנשים מעדיפים ללכת לעומר עומר, אבל השיעורים שלו הם די מאוחרים (לפחות בסמסטר הזה) בשבילי וגם הכיתה שלו כ\"כ מפוצצת כי הוא תותח חח. ובכל זאת לא הרגשתי כ\"כ הבדל בינו לבין דגנית.\n\nשעורי הבית: לא חובה. מומלץ מאוווד לעשות. ולשאול בפיאצה. ואם נתקלים במשהו שלא יודעם לפתור אז הסדנאות עוזרות. וגם הם מפרסמים פתרונות חלקיים. אישית לא הגשתי את כולם (3 מתוך 6), אבל כן עשיתי את כולם.\n\nהמבחן: \nלא כל כך קשה או מסובך יחסית לשאר הקורסים. צריך לדעת לפרמל ולדעת הגדרות היטב (וזה עוזר הרבה בקורס הזה בלי קשר). דורש קצת השקעה בהתחלה ללמוד אבל לא נורא ובסופו של דבר מגלים שהכל חוזר על עצמו וכי כל ההוכחות בשאלות כמו לכסון או למת הניפוח די זהות ויכולים גם למצוא תבנית להן. גם כן הממוצע בד\"כ בסדר יחסית (משהו כמו 73-77). מומלץ מאוד להיות במעקב לאורך הסמסטר כי זה עוזר הרבה לדעת איפה אתם נמצאים ובמה להתרכז כאשר לומדים להמבחן.\n\nהשורה התחתונה: יש האומרים שזה קורס מייגע או פורמלי מדי, אבל לדעתי זה קורס מרתק ואינו מסובך וכן אפשר ליהנות ממנו.  בכל זאת הוא קורס חובה אז אין ברירה. להוציא ציון מעל 90 בקורס הזה לדעתי הוא דבר אפשרי מאווווד עם קצת השקעה... אז לא להתבאס... גם אם מקבלים ציון גרוע בבוחן אמצע, ולהמשיך לעבוד היטב ולהשתפר, ולשאול בפיאצה אם נתקלים במשהו שלא מבינים :). \nalthough it could just be survivorship bias", "timestamp": 1658727175274}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: שרי שיינולד\nחוות דעת - הרצאות: שרי מרצה ממש טובה ומאד ברורה ומובנת. החומר מועבר בצורה ממש נגישה וטובה.\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: עומר מתרגל מלך! ממש חשוב לו והוא מסביר בצורה ממש מדהימה את החומר.\n\nשעורי הבית: מאד תואמים לרמת המבחן.\n\nהמבחן: הוגן מאד. מי שלומד כמו שצריך מצליח.\n\nהשורה התחתונה: קורס כיפי אבל צריך ללמוד ולא לזלזל.", "timestamp": 1663142303113}, {"author": "I", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: אווירה טובה, חומר משעמם ובלתי נסבל\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: כל התרגולים משנים קודמות זהים ומוקלטים \n\nשעורי הבית: לא חובה, אחת לשבועיים יוצא גליון, אם רוצים לשמור על פוקוס בקורס הזה מומלץ לעשות.\n\nהשורה התחתונה: קורס מאוד משעמם ברמת קושי סבירה", "timestamp": 1672514586564}, {"author": "נעה מויאל", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: טובות\n\nשם המתרגל/ת: עומר יצחק\nחוות דעת - תרגולים:  עומר מתרגלת מעולה! היא מבינה טוב את החומר ומגיע מוכנה לשיעור. ממליצה עליה בחום! \n\nהמבחן: עוד לא היה", "timestamp": 1674469642293}, {"author": "...", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: הרצאות פרונטליות סבבה לגמרי, המרצה טובה. באתר הקורס יש סיכומים מוקלדים של ההרצאות והתרגולים שמכילים את כל ההגדרות והמשפטים כולל הוכחות. תכלס ניתן ללמוד מהם מבלי להגיע להרצאות או התרגולים.\n\nשם המתרגל/ת: ----\nחוות דעת - תרגולים: לא הכרחי להגיע. חומר התרגולים במלואו באתר. ניתן להבין ב20 דקות מה שלוקח בכיתה שעה+.\n\nשעורי הבית: אין חובת הגשה. 6 גיליונות. סה\"כ לא קשים. ממליץ לפתור באופן עצמאי ולהשוות תשובות כשמעלים פתרונות לאתר.\n\nהמבחן: מבחן הוגן, ברמה סבירה.\nבאופן כללי רמת המבחנים עלתה בשנים האחרונות, לדעתי.\n\nהשורה התחתונה: קורס חובה, די קליל, לא עמוס בכלל.", "timestamp": 1675334219787}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: \nאחלה מרצה, מסביר הכל כמו שצריך. לפעמים קשה לעקוב אחרי ההוכחות, אבל אני לא חושב שזאת אשמתו.\n\nשם המתרגל/ת: עינב אוהד\nחוות דעת - תרגולים: \nמתרגל מצויין, ממש יש הרגשה שאנחנו פותרים את התרגילים ביחד. מומלץ ביותר.\n\nשעורי הבית: \nרשות (ללא ציון) אבל מומלץ מאוד לעשות, אחת קשה לעקוב אחרי מה שקורה בתרגולים. בנוסף ההגשה רק בזוגות ומעלה ובודקים רק שאלה אחת, אבל עבור השאלה שבודקים יש משוב מפורט.\n\nהמבחן: \nלא קשה מדי, אך לא טריוויאלי. המגן היחיד היה בחן האמצע, והממוצע בו היה 56, אז לרוב הסטודנטים המבחן מהווה 100% מהציון.\n\nהשורה התחתונה: \nצריך לפרט במידה שלפעמים מרגישה מוגזמת במבחן, ובסוף מסתבר שאפילו חסר ניפוק פה ושם, אבל הקורס לא קשה בהשוואה לאינפי ואלגברה. אין יותר מדי משפטים, צריך בעיקר לדעת את כל ההגדרות במדוייק כי רוב ההוכחות בנויות בעיקר על הגדרות.\nבתחילת הקורס החומר ממש קל, אחרי זה הרמה עולה קצת.", "timestamp": 1675359058228}, {"author": "Shiri", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: \nההרצאות סבבה, שאול מסביר די טוב ומספיק מסודר.\n יש את הסיכומים שלו באתר, שכתובים בצורה מאוד נגישה ומובנת, אז גם אם לא הבנת משהו בכיתה יש לאן ללכת.\n\nשם המתרגל/ת: דגנית חנניה בוכריס\nחוות דעת - תרגולים: דגנית ממש טובה בפשטות את החומר ולהרגיש אותו, היה לי ממש כיף איתה בתרגולים והיא ממש מקסימה.\n\nשעורי הבית: אין חובת הגשה ואם מגישים זה בזוגות ומעלה, אבל מומלץ לעשות אותם כדי שתהייה למידה משמעותית במהלך הסמסטר. השיעורים עוזרים להבנה של הקורס.\n\nהמבחן: היה יחסית קשה והיו שאלות יצירתיות שלא נתקלנו בהם, אבל עדיין היה מבחן הוגן ולא משהו שלא ידענו לפתור.\n\nהשורה התחתונה: קורס חמוד, הסגל מאוד טוב ונהנתי ממנו בסהכ", "timestamp": 1675368542608}, {"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: שאול אגדי ומדהים\n\nשם המתרגל/ת: שונית בהקלטות\nחוות דעת - תרגולים: ממליץ דווקא לא לזלזל וללכת להקלטות אלא לנסות כן ללכת לתרגולים, אבל לגמרי שונית הכי טובה\n\nשעורי הבית: ממליץ לא להגיש כי זה לא חובה אז פשוט לפתור ואז להסתכל על פתרון של השיעורי בית משנה שעברה בgr++ (אותם שיעורי בית בדיוק)\n\nהמבחן: לא היה עדיין\n\nהשורה התחתונה: חפשו את שאול ביוטיוב", "timestamp": 1675617791173}, {"author": "מתק\"א", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: טובים, מצחיקים, אבל אם לא עוקבים אחרי ההוכחות באינדוקציה זה קשה לחזור לרצף של ההרצאה\n\nשם המתרגלת: עומר יצחק\nחוות דעת - תרגולים: היו טובים, לעומר יש מודעות לכיתה ומצליחה להתאים את הווי התרגולים לסטודנטים\n\nשעורי הבית: לא היו חובה, לא עשיתי (עדיף היה אם היו חובה, גם אם רק מגן)\n\nהמבחן: היה טוב עד שדיברתי עם הסטודנטים האחרים והבנתי איפה טעיתי, אבל היה הוגן פחות או יותר\n\nהשורה התחתונה:", "timestamp": 1675671955305}, {"author": "O", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: \nמרצה מעולה. כיף לראות כמה הוא נרגש מתורת הקבוצות!\nלפעמים קצת מבולגן - מי שזה מפריע לו שישים לב, לי לא הפריע ונהנתי מזה שהוא הכניס העשרות והעביר את החומר בצורה מעניינת.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: \nמעולה. פתר המון תרגילים על הלוח, תמיד כאלה קשים במיוחד. מאד סבלני ועזר. הכתב הכי יפה בטכניון.\n\nשעורי הבית: \nיש 6 גיליונות, ההגשה רשות ובקבוצות. זה שזה רשות גרם להרבה אנשים לחפף, ואחרי זה לשלם מחיר במבחן\n\nהמבחן: \nהיה לגמרי הוגן. הקורס עבר כמה גלגוגלים, אבל למבחנים של שאול יש \"ליין\" (יותר הבנה פחות שינון וטכניקה) והוא לגמרי היה עליו, וגם לא הפתיע בשאלות הזויות\n\nהשורה התחתונה: \nהקורס שהכי אהבתי בסמסטר א'. היקף החומר לא גדול, החומר סה\"כ מעניין והמבחן הוגן.\nעדיין חשוב להזהר לא לזלזל - זה עדיין קורס מאתגר וצריך להשקיע", "timestamp": 1675955407770}, {"author": "יונתן רייכר", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שאול אלמגוג\nחוות דעת - הרצאות: אני אישית נהניתי מההרצאות, לא ממש הקשבתי בחלק הראשון של הקורס כי אני באתי עם רקע על תורת הקבוצות. אוטומטים גם כן הכרתי מבית הספר, אבל מהר מאוד החומר בנושא היה לי חדש\nשאול מעביר לדעתי את החומר בצורה טובה ומצליח להיות מעניין ולהגיע ישר לדוגרי של איך זה רלוונטי ומה צריך לדעת למבחן\nההרצאות בקורס מחולקות לתורת הקבוצות בהתחלה ואוטומטים בסוף, לדעתי מאוד חשוב להגיע ולהקשיב אם אתם לא מנוסים עם תורת הקבוצות והסגנון מחשבה שהקורס דורש\nממליץ מאוד לרשום את ההגדרות ששאול מציג, ובהוכחות רק להקשיב ולנסות לעקוב בלי לכתוב\n\nשם המתרגל/ת: סתיו ועומר\nחוות דעת - תרגולים: הלכתי לסתיו ולעומר מתי שהתאים לי יותר באותו שבוע. שניהן לא עוברות על הרבה תרגילים בזמן התרגול אבל הן עונות על שאלות נהדר ומביאות דוגמאות שעוזרות להפנים את ההבנה. בגלל שהכרתי את החומר, עשיתי גיליונות אחרים בתרגולים אבל הרגשתי שלבוא ולראות את השאלות כן עזר לי\n\nשעורי הבית: \nרשות. זו מלכודת!! שווה לעשות את התרגולים. ואם אין זמן לעשות את כל הגיליון, לפחות לעשות חצי. ואם אין זמן לחצי, אז לתרגיל אחד. רק להציץ זה לא מספיק\n\nהמבחן: המבחן הרגיש לי הוגן, ולדעתי בדק טוב את השליטה בחומר ואת יכולת הניסוח שלי בהוכחות. שווה לפני כל שאלה שמכילה אוטומטים או שפות לשבת ולחשוב: איך אני רוצה לפתור את השאלה? יש שאלות שיש להם פתרון ארוך מאוד שאם לוקחים קודם מבט אחורה ונזכרים בכלים פחות מובנים מאליו כמו ביטויים רגוליים או תכונות סגירות נהיות קלות ממש\n\nהשורה התחתונה: קורס נחמד עם סגל נחמד שמעביר חומר שרוב האנשים כנראה יחשבו בהתחלה שהוא משעמם, ואז בסוף יבינו שוואלה זה די כיף.  בסמסטר יחד עם אינפי ואלגברה כנראה הוא הפוגה נעימה עם טיפה פחות מספרים", "timestamp": 1675970525916}, {"author": "Gg", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: \nשאול מדהים, כיפי ומצחיק. לפעמים בהרצאות יש שלבים שהוא מראה הוכחות טיפה מונפצות ולא ברורות, וכשמסיים אומר שהן היו לא רלוונטיות למבחן, קצת מבלבל אבל מי שמצליח לעקוב מאוד עוזר. היו שלבים שההרצאה הפכה לשיעור יוונית אבל סך הכל החומר היה מאוד ברור והאווירה בהרצאות הייתה טובה.\nשם המתרגל/ת: איתי חסון/אוהד\nחוות דעת - תרגולים: \nהתחלתי עם אוהד שהיה נהדר, סולידי והסביר טוב. עברתי לאיתי בגלל נוחות במערכת וגם הוא היה מעולה. \nהתרגולים מאוד עזרו ומאוד חשובים ממליץ ללכת.\nשעורי הבית:  \nלעשות.\nעוזרים מאוד.\n\nהמבחן: \nהיה לא פשוט ביחס למבחני עבר וגם זה השתקף בממוצע. קיבלנו פקטור שלהבין אותו היה יותר קשה מהמבחן עצמו.\nחשוב להתכונן מראש ולהיות על החומר.\nהשורה התחתונה: קורס נחמד מאוד אפשר להצליח להוציא ציון סבבה גם בלי להיות על החומר כל הסמסטר אבל מי שרוצה ציון טוב לדעתי זה מאוד מאוד עוזר.", "timestamp": 1676214004346}, {"author": "*", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שרי שינוולד\nחוות דעת - הרצאות: \nמרצה ממש טובה! כותבת בצורה ממש ברורה ומסודרת וגם ההסברים והדוגמאות שהיא נתנה העבירו את החומר בצורה טובה. רואים שהיא מנוסה ויש לה ידע טוב של החומר.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: \nמתרגלת מעולה, כותבת את התרגילים בטמפלייט מראש וזה מאפשר לדעתי לא להתעכב על לכתוב את התרגיל אלא על הנקודות הקשות והחשובות. מסבירה ברור ובסבלנות ורואים שממש אכפת לה מהסטודנטים.\n\nשעורי הבית: \nלא היו חובה, אני עשיתי אותם ולדעתי שווה לעשות. היו 6 גליונות לאורך הסמסטר אז העומס יחסית סביר. רמה דומה לרמה של המבחן.\n\nהמבחן: \nלא היה קל, דורש הבנה עמוקה של החומר ולא שינון, אבל אם משקיעים בלמידה ועוקבים תוך כדי הסמסטר זה אפשרי לקבל ציון טוב.\n\nהשורה התחתונה: קורס מושקע וסגל מדהים, נושאים מעניינים וחשובים.", "timestamp": 1676286295534}, {"author": "Shahar", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: \nשרי מסודרת מאוד (והמחברת שלה מפורסמת ומתעדכנת תוך כדי ההרצאה) היא מעבירה את החומר בצורה מעניינת כמה שאפשר.\nשם המתרגל/ת: דגנית\nחוות דעת - תרגולים: היו מעט מאוד אנשים אצל דגנית בגלל החפיפה לצנזור והתרגולים היו מצוינים, דגנית ענתה לכל שאלה ונתנה יחס אישי.\n\nשעורי הבית: קלים, מרופרנסים.\n\nהמבחן: הוגן ויחסית פשוט.\n\nהשורה התחתונה: קורס פשוט יחסית, מתקטננים מאוד על ההוכחות וחוץ מזה אין יותר מדי קושי.", "timestamp": 1676758108224}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול אלמגור\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: התרגול מאוד מסודר והייתה בו אווירה טובה. רובנו הרגשנו בנוח לשאול שאלות ואיתי תמיד ענה והסביר לנו בסבלנות רבה.", "timestamp": 1677073831400}, {"author": "אוטו", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: הקלטות של שרי\nחוות דעת - הרצאות: לא עמוסות, ההקלטות טובות כי אפשר לחזור לחלקים החשובים כשצריך ולהריץ כשצריך.\n\nשם המתרגל/ת: הקלטות של שונית\nחוות דעת - תרגולים: מתרגלת מעולה, ממש מסודרת ומסבירה גם איך חושבים במקצוע ולא רק איך פותרים.\nגם התרגולים לא עמוסים. \n\nשעורי הבית: לא להגשה אבל כדאי לעשות כדי להיות על החומר במהלך הסימסטר.\n\nבוחן אמצע: הבוחן היה ממש קשה, לדעתי זה כדי שנקבל שוק ונדע על מה צריך לחזור. חשוב ללמוד אליו כי אז יש ללמוד פחות למבחן :) \nהמבחן: לא משהו מיוחד. \n\nהשורה התחתונה: מפתה לא ללמוד במהלך הסמסטר אבל אם מתרגלים מספיק במהלך הסמסטר אז הלמידה הופכת לקלה יותר.\nההקלטות מאוד עוזרות להצליח.", "timestamp": 1678029411315}, {"author": "..", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דר שאול אלמגור\nחוות דעת - הרצאות: אני מאוד אהבתי את ההרצאות של שאול, לדעתי הוא מרצה מעולה ומאוד מעניין רואים שהוא ממש אוהב את מה שהוא עושה והוא מעביר את האהבה שלו לחומר לסטודנטים. ממליץ במיוחד בחלק של האוטומטיים לא להעתיק את ההוכחות אלא רק להקשיב ולבוא עם הסיכומים שהוא מעלה לאתר, ההוכחות הרבה פעמים מסובכות ולא רלוונטיות ועדיף להקשיב ולא להעתיק.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: אחד המתרגלים היותר טובים שהיו לי בסמסטר א, הוא מעביר את החומר בצורה ממש טובה וברורה, בנוסף הוא גם מאוד מסודר וזה ממש עוזר לעקוב אחרי התרגול ואחרי מה שהוא עושה. אם מתרגל בסמסטר ממליץ ללכת.\n\nשעורי הבית: לא חובה יש 6 תרגילי בית אני לא עשיתי, אבל אני חושב שכן מומלץ לעשות את חלקן גם אם לא מגישים לעשות אפילו תרגיל מיליון כי אחרת מגיעים לבוחן אמצע בלי לכתוב אף שאלה בצורה פורמלית שנדרש בקורס וקשה ללמוד בקתת זמן.\n\nהמבחן: לתרגל מבחני עבר בסוף זה די חוזר על עצמו\n\nהשורה התחתונה: קורס מומלץ מאוד ומעניין עם סגל מעולה.", "timestamp": 1678088552800}, {"author": "Adam Liberov", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שאול ושונית ושריי מוקלט\nחוות דעת - הרצאות: חומר ממש משעמם והרצאות איטיות ומרדימות לדעתי\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מתרגלת פצצה מסבירה היטב את החומר\n\nשעורי הבית: 6 גליונות של 4 - 5 שאלות מומלץ לעשות כדי לתרגל את החומר \n\nהמבחן: קשה יותר ממבחני עבר חשוב להבין את כל החומר היטב ולפתור הרבה תרגילים\n\nהשורה התחתונה: קורס די משעמם ומעצבן לא אהבתי כל כך אבל חובה", "timestamp": 1678286989882}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: \nשאול אחלה גבר ממש ומעביר את החומר סבבה, אבל עובד קצת מסורבל עם הלוח, שווה להוריד את סיכומי ההרצאות שלו מהאתר ולקרוא במקביל להרצאה. חוץ מזה יש הקלטות מצוינות של שרי מ2020.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מלכה, באמת אין מילה רעה להגיד.\nמעבירה את החומר בצורה טובה מאוד וחשוב לה שכולם יבינו הכל.\n\nשעורי הבית: אין חובת הגשה, אז לקראת סוף הסמסטר קצת זרקתי על זה, אבל זאת הזדמנות טובה לקבל איזשהו פידבק מהסגל. כן חשוב בעיניי לקרוא את הטעויות הנפוצות בשיעורי בית לקראת המבחן כדי לדעת על מה לא ליפול.\n\nהמבחן: ממש סבבה, שאלות מאוד תבניתיות שהחשיבה בהן מצומצמת לכדי חלק אחד או שניים בהוכחה. תתרגלו מספיק מבחנים כדי להכיר את צורת העבודה והמבחן יזרום לכם ממש.\n\nהשורה התחתונה: קורס חמוד מאוד לסמסטר ראשון, אבל לא לזלזל", "timestamp": 1678536991658}, {"author": "בום", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרי מוקלט של הקורונה\nחוות דעת - הרצאות: שרי מעולה! הכל היה ברור ומובן, לדעתי עדיף ללכת פרונטלי כי זה ממש קורס כיפיי!\n\nשם המתרגל/ת: סתיו וכמה תרגולים מהמוקלט של שונית \nחוות דעת - תרגולים: סתיו מדהימה! מזה אהבתי אותה, שולטת בחומר טוב מאוד \n\nשעורי הבית: לא חובה, אבל אם רוצים לקבל +90 במבחן (וכן ניתן לקבל) תעשו שיעורי בית! זה בעצם מה שעזר לי להוציא ציון טוב במועד ב (כי פשוט לא עשיתי אותם תוך כדי הסמסטר והיגעתי למועד א לא יודעת מזה מתק\"א (אל תעשו את זה!!!)\n\nהמבחן: לדעתי אם לומדים כמו שצריך ומשקיעים בשיעורי בית ופיתרים כמה מבחנים אין סיבה שלא תקבלו +90\n\nהשורה התחתונה: תיהנו מהקורס הזה! והכי חשוב לשמוע את השירים שהם עושים בסוף הסמסטר!! סגל מדהים", "timestamp": 1678955705028}, {"author": "אנונימיץ", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול אלמגור - סיכומים\nחוות דעת - הרצאות: \nהסיכומים מספיקים ומכסים את החומר היטב, הם אפילו שנונים! \n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: \nמעולה! נותנת אינטואיציה, המון נכונות לעזור. ההקלטות שלה גם נפלאות. שרה יפה!\n\nשעורי הבית: \nלא טרחתי להגיש בגלל הדרישה לעבודה בקבוצות. ניתן להסתדר בלי להגיש.\n\nהמבחן: \nכמעט הכל כצפוי, שאלות פתירות וחזרה על החומר היא חיונית.\nאין סיבה לצאת מהקורס עם ציון נמוך מ85.\n\nהשורה התחתונה: \nלהיט המצעדים \"קנטטה לקנטור\" יישאר חקוק בליבי לעד. מומלץ להאזין!", "timestamp": 1678991673249}, {"author": "ITZIK", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה:הקלטות של שרי כפול 2\n\nשם המתרגל/ת: הקלטות של שונית\n\nשעורי הבית: חופרים אבל עוזרים לסכם את החומר\n\nהמבחן: לא קשה, תלמדו איך לעשות (זה תבנית ממש פשוטה אז כל אחד יכול לשנן אותה בעל פה)\nלמת ניפוח, לכסון, ובניית והוכחות נכונות של אוטומט זה ביחד עם קצת הגיון בריא וסימונים של תורת הקבוצות ואתם מקבלים מעל 80 בטוח\nאני בבחינה ממש זלזלתי בנושא של תורת הקבוצות כי הוא יחסית הכי קל, אבל הם ממש קוטלים שם מבחינה של להוריד נקודות אז תשימו לב איך לכתוב תשובה מלאה \n\n\nהשורה התחתונה: קורס קל, אבל חופר ומשעמם בקטע מוגזם. אבל ממש חופר.", "timestamp": 1679090217919}, {"author": "בועז מונטיליה", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "חוות דעת - הרצאות: לא ניגשתי להרצאות, רק קראתי מצגת פעם ב\n\nחוות דעת - תרגולים: לא באתי לתרגולים\n\nשעורי הבית: קלים ממש, אבל כן דורשים זמן, כדאי לדאוג לפנות אותו.\n\nהמבחן: עוד לא עשיתי\n\nהשורה התחתונה: אם למדתם בתיכון- חבל על הזמן שלכם, אל תבואו להרצאות, תדאגו רק לקרוא מצגות פעם ב ואם הגיעו חומר שלא הכרתם תתחילו לבוא.", "timestamp": 1679167206873}, {"author": "--", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nברורה ועניינית, מאוד נהניתי מההרצאות. החומר מועבר באופן די חוויתי, וזה מאוד נוח שמקבלים את סיכום ההרצאה מהמרצה עצמה בסוף כל הרצאה, ככה שתמיד יש איפה לבדוק ולהשוות.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: \nסדר וארגון ברמה אחרת לגמרי, כל השיעורים בנויים על תבנית קבועה ככה ששום דבר לא מתפספס. \nתמיד דואגת להסביר למי שלא הבין (אבל גם יודעת לא לעכב את שאר הכיתה ולהסביר בסוף השיעור באופן אישי)\n\nשעורי הבית: \nסוקרים את החומר באופן מאוד נוח ומסודר, מאוד יעילים להתכוננות למבחן \n\nהמבחן: \nבדיוק מה שלמדנו ומה שראינו בגליונות.\n\nהשורה התחתונה: \nקורס מעניין ומהנה, כנראה הקליל ביותר בכל הסמסטר", "timestamp": 1679256297213}, {"author": "צנזור", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: בסך הכל סבבה, מסבירה כמו שצריך את החומר ובצורה די מתומצתת, נותנת דוגמאות ונותנת מקום לשאול שאלות. קצת מונוטונית אבל בעיניי עדיפה על שאול, הוא היה מבולגן מדי בשבילי ואיבדתי אותו באמצע ההרצאה.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מושלמת. משקיעה ממש בתרגולים, מסבירה כל דבר בהרחבה, נותנת המון מקום לשאלות ומתעכבת עד שכולם מבינים כמו שצריך. דואגת שהסטודנטים ישתתפו כמה שיותר במהלך התרגול ובאופן כללי ממש אכפתית.\n\nשעורי הבית: לבחירה, מאוד מומלץ לפנות זמן ולעשות בכל זאת, אחרת נוצר פער בהבנה של החומר. אני לא נגעתי בהם ובדיעבד אני מתחרט על זה, סתם יוצר לחץ לעבור על הכל מההתחלה לקראת סוף הסמסטר.\n\nהמבחן: די הוגן, העיקרון במבחנים די חוזר על עצמו אז מי שילמד מספיק ויתרגל מספיק מבחנים כנראה יצליח במבחן.\n\nהשורה התחתונה: בסך הכל קורס נחמד, חשוב לא להזניח אותו למרות שזה מפתה בגלל העומס משאר הקורסים.", "timestamp": 1679329366623}, {"author": "בנדיקט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: שאול מאוד נחמד ועונה על כל שאלה, אבל די מבולגן, עם כתב יד לא ממש ברור ולפעמים נתקע על דברים שוליים.\nההרצאות הן כמעט אחד-לאחד הסיכומים שיש באתר, עם קצת תוספות פה ושם.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: הוא שולט בחומר באופן יוצא דופן ויודע לענות על כל שאלה, אבל המון דברים נראים לו ברורים מאליהם, אז הוא לפעמים קצת רץ על תרגילים כי מבחינתו כולם יודעים להשלים לבד את הפתרון. אם אתם טמבלים כמוני ולא יודעים להשלים לבד את הפתרון, הוא ישמח להסביר לכם.\n\nשעורי הבית: אין חובת הגשה.\nפתרתי אותם רק לקראת המבחן והיוו תרגול לא רע לפני שהתחלתי לפתור מבחני עבר.\n\nהמבחן: ניגשתי רק למועד ב'. היה יחסית קשה ודרש תרגול רציני. הממוצע *אחרי* פקטור במועד ב' היה שווה לממוצע של מועד א' *לפני* פקטור. אם יש אפשרות תעשו כל מאמץ לגשת למועד א'.\nכשמכירים מספיק דוגמאות ומבינים את התיאוריה - הכל פתיר.\nמאוד נדיר שתידרשו להמציא את הגלגל מחדש כדי לפתור תרגיל במבחן.\n\nהשורה התחתונה: היה כמו סינית בשבילי, אבל בדיעבד זה קורס מאוד נחמד (יחסית לקורסים המזעזעים האחרים בסמסטר א') שעיקר הקושי בו הוא זיהוי דרך הפיתרון, ולא פירמול הפיתרון עצמו.", "timestamp": 1679437839043}, {"author": "נועם קרן", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: אין כמו שרי בעולם, מרצה בחסד. מעבירה את החומר בצורה נהירה ומעלה את הסיכום אחרכך לוובקורס.\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: אין יותר טובה משונית, הסיבה העיקרית שאהבתי את המקצוע הזה\n\nשעורי הבית: כדאי לעשות\n\nהמבחן: קל אם לומדים טוב\n\nהשורה התחתונה:", "timestamp": 1679652128406}, {"author": "אליהו", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nמרצה מעולה. עוברת כמו שצריך על החומר, מסבירה שוב, מציירת על הלוח ואפילו עם מוט הצבעה מתקפל, כמו מקצוענית. כל החומר הכתוב נמצא בענן, והקלטות מצוינות נמצאות באתר.\nשם המתרגל/ת: סתיו\nחוות דעת - תרגולים: \nמתרגלת מדהימה. נותנת את הלב, משקיעה ואכפתית. \nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689600226694}, {"author": "הלורד", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שרי \nחוות דעת - הרצאות: התחלתי את הסמסטר עם שרי בלייה ועברתי באמצע למוקלטות. שרי ממש אחלה ומעבירה את החומר בצורה טובה, ההקלטות זהות אחד לאחד למה שקורה בכיתה.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מלך \n\nשעורי הבית: לא חובה לא עשיתי\n\nהמבחן: בדרך כלל מבחן די קל, הסמסטר הרגיש שמועד א היה כמה רמות מעל הרמה הרגילה\n\nהשורה התחתונה: \"מתקא קורס קליל וכיף\" (רוב הזמן)", "timestamp": 1690488461761}, {"author": "שי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הסיכומים בוובקורס וההקלטות\nשם המתרגל/ת: הסיכומים בוובקורס וההקלטות\nחוות דעת: \nההקלטות היו מעולות\nשעורי הבית: \nלא עשיתי\nהמבחן: \nהיה קצת מעל הרמה הרגילה אבל היה עדיין קל יחסית למי שלמד טוב..\nהשורה התחתונה: \nקורס אחלה", "timestamp": 1690655896408}, {"author": "חוות דעת סופית דטרמניסטית", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: בהתחלה הגעתי פרונטלי, מסבירה טוב אבל הקצב היה איטי מדי אז עברתי להקלטות. כל עוד לא בוצע שינוי בחומר הקורס ממליץ מאוד על ההקלטות. \n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: כנ\"ל, עברתי להקלטות והיה מעולה. מומלצת מאוד.\n\nשעורי הבית: לא חובה אבל לא לוקחים הרבה זמן ועוזרים לוודא הבנה, מומלץ לא להתעצל ולעשות.\n\nהמבחן: היו שאלות קצת שונות והפעם המבחן היה פחות בתבנית \"הרגילה\" של מבחנים בקורס, אבל בגדול אם מתרגלים הרבה ומבינים טוב את החומר אז אפשר להצליח גם במבחן כזה. בסוף הרבה מהדגש זה על שימוש נכון בהגדרות ופורמליות.\n\nהשורה התחתונה: קורס חמוד, לא מאוד עמוס, יש כמה נושאים מעניינים. מומלץ לא לזלזל וכן להשתדל להיות בעניינים כי אז אפשר להוציא ציון יפה.", "timestamp": 1690826706234}, {"author": "אביב", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: אהבתי את ההרצאות של שאול מאוד. הוא לא רק הסביר את החומר בצורה יבשה אלא גם הסביר את ההיגיון והסיבות מאחורי החומר - משהו שהיה לי חסר בקורסים אחרים.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מתרגל מעולה. מסביר מצוין. מאוד מומלץ.\n\nשעורי הבית: לא קלים אבל מלמדים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713190722939}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: שרי פשוט מלכה. רואים שהיא ממש אוהבת את החומר. ממש חשוב לה שהסטודנטים באמת יבינו את החומר, והיא מוכנה להתעכב בשביל זה אבל לא יותר מדי. מכניסה לפעמים בדיחות נחמדות ומוודאת שכולם איתה.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: איתי חסון פשוט מלאך. הלכתי לכל אחד מהמתרגלים שהיו בכמעט כל קורס שלי, ולא אהבתי אף מתרגל כמו איתי. אכפת לו בקטע אחר מהסטודנטים, הוא מצחיק, מסביר פשוט מצוין, ובאופן רציף מספיק יותר בשיעור ממה שדרוש למרות שהוא מצליח לענות לשאלות ההזויות של כיתה מפוצצת. אם אפשר, לכו אליו(למרות שגם שמעתי דברים נחמדים על שונית)\n\nשעורי הבית: 5 גליונות, רובם די קשורים למה ששואלים במבחנים אך מרגישים טיפה שטחיים יותר, מומלץ לעשות- בעיקר בגלל הבונוס.\n\nהמבחן: עוד לא היה. אבל ממבחני עבר שתרגלתי, די בסדר.\n\nהשורה התחתונה: קורס ממש מומלץ, לא שיש לכם בחירה... אבל כנראה הקורס הכי כיפי בסמסטר א'.", "timestamp": 1714512319468}, {"author": "Ofek Y", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: הרצאות קצת משעממות, אפשרי ללמוד מהקבצים אבל שרי מאוד נחמדה \n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: מתרגל underrated ברמות, בזכותו ההבנה שלי בתורת הקבוצות הייתה כלכך עמוקה וטובה, מאוד נחמד ועונה על כל שאלה שיש לך\n\nשעורי הבית: (סמסטר מלחמה) בשבילי השיעורי בית היו ברמה מאוד גבוהה ולא פרופורציונלית למה שלמדנו בתרגול ובהרצאות, המבחן משמעותית יותר קל משיעורי בית\n\nהמבחן: \nהמבחן היה בסדר, פה ושם דברים שבחיים לא ראיתם אבל התבנית חוזרת על עצמה\nהשורה התחתונה:", "timestamp": 1714906668748}, {"author": "בת מנייה", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  שרי\nחוות דעת - הרצאות: \nהרצאות יחסית קלילות ונחמדות, לא קשות מידי אבל גם לא מעניינות מידי, היו רק שני מרצים אז האולם מפוצץ\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: איתי מקסים וגם מסביר ממש טוב בעיניי, מומלץ אפילו שהכיתה יחסית מלאה\nשעורי הבית: \nלא דרשו עבודה ברמה מוגזמת, קצת קשים לקראת הסוף ודיי תואמים לרמה של שאלות ממבחנים\nהמבחן: \nקצת שאלות מונפצות אבל סהכ הוגן ונתראה במועד ב\nהשורה התחתונה: \nאמור להיות הקורס הכי חביב בסמסטר א", "timestamp": 1714932464099}, {"author": "מלכסן הקבוצות", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי שינולד המלכה.\nחוות דעת - הרצאות:\nלשרי הצטרפתי באמצע הסמסטר לאחר ניסיונותי הממושכים להתרכז בהרצאות של שאול, כמובן, ללא הצלחה (שום דבר אישי נגד שאול, איש מקסים מקסים מקסים, פחות התחברתי לשיטת ההוראה שלו). אני רוצה לחשוב על ההרצאה הראשונה שלי עם שרי כמן לידה מחדש, מתוך הקור והאופל של אמדו 232 לתוך האוויר הצח והצלול (והמזגן שתמיד על חום) שבקאהן 6. שרי מושלמת, מרצה מצויינת, קפדנית, מתוקה ואף פעם לא תתבייש לשאול אותה שאלה. אהבתי מאוד את ההרצאות ואת החומר והרגשתי ששרי תרמה בתהליך הזה המון.\nכשאתה נמצא בהרצאות של שרי, אתה מרגיש שאין עליך שום דאגה בעולם, איכשהו ההרצאה הזאת לקחה ממני את כל הלחץ של הסמסטר והרגשתי את המתקא פשוט נכנסת ושוטפת אותי כאילו אני בים המלח וכל מה שנותר הוא לצוף. \n\nשם המתרגל/ת: שונית אגמון המלכה\nחוות דעת - תרגולים:\nגם לשונית הצטרפתי באיחור וחבל על כל שניה שהחמצתי. שונית מצחיקולה, אך שולטת בחומר ויודעת להעביר אותו בדיוק כמו שצריך ומתעכבת על הנקודות החשובות. אין ספק שהג'ינגלים עוזרים. אימוני הרגליים בטיפוס לבניין דיוויס (ביקורת חריפה על מיקומי ההרצאות והתרגולים), היו הקסם ואבן הפינה של ימי החמישי שלי בסמסטר. \n\n\nאיתי חסון המתרגל האחראי הכי איכפתי שפגשתי. אם זה בשעות הקבלה או בתרגולים המקולטים. כל כך אכפת לו מהקורס וכנראה שאם זה היה מסתדר במערכת הייתי הולך אליו. מהתרגולים המוקלטים התחברתי לשיטה שלו יותר והוא יסודי ויודע בדיוק מה צריך לעשות כדי להצליח בקורס.\n\n\nשעורי הבית:\nחמישה גיליונות בהגשה בשלישיות, חובה מוקלד (היה די תסביך). לא חובה להגשה בסמסטר שלנו אך נתנו עד 2% מגן כל אחד מהם (תלוי כמה מוצלחים הם היו). היה הקורס היחידי בסמסטר שבדק שיעורי בית ונתן עליהם משוב מנומק. גם הקורס היחידי שעשה בוחן אמצע להגשת רשות ונתן עליו משוב מנומק היטב (חחחח מוגדר היטב). פשוט דוגמה לשאר הקורסים.\n\n\nהמבחן:\nפייר. אם הקשבתם בהרצאות ובתרגולים ועשיתם את כל שיעורי הבית בלי לחפף אין שוב סיבה שלא תצליחו ולא תקבלו ציון טוב בקורס. \n\nהשורה התחתונה:\nכל קורס אחר בסמסטר הראשון צריך לקחת כדוגמה את סגל מתקא, סגל שאכפת לו, היחידי שעשה בוחן אמצע לא חובה עם הערות כאילו זאת בדיקה אמיתית (זה היה כל כך חשוב כדי להבין איפה אתה נמצא בחומר). אין על השירים שלכם- לשמוע קנטטה לקנטור גורם לי לחייך כל פעם מחדש.", "timestamp": 1715189119777}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: שרי מעולה, היא ממש מקצוענית ומסודרת (מעלה בלייב את המחברת onenote שלה, יש לה אפילו מקל מתקפל להצביע על הלוח) וגם מרגישים שהיא מאוד אוהבת את החומר.\nהחסרון היחיד זה שהיה מפוצץ אצלה.\n\nשם המתרגל/ת: רועי גרוס.\nחוות דעת - תרגולים: רועי ממש אחלה! לא היו אצלו הרבה אנשים ואני לא מבין למה, הוא באמת מסביר בסדר גמור ומרגישים שאכפת לו מהסטודנטים. \nההרצאה של צנזור יצאה על התרגול שלו אז אולי זה מסביר.\n\nשעורי הבית: 5 גיליונות לאורך הסמסטר, בהתחלה ממש בסדר ובהמשך הקורס יש שאלות קשות אבל סבבה סה\"כ.\nמגישים את הפתרונות שלכם מוקלדים (למשל בוורד או בLyX), אם אתם לא יודעים אז הקורס ייאלץ אתכם ללמוד, שזה קצת מייגע בהתחלה אבל לדעתי חשוב לדעת.\nמגישים בשלשות, צריך להירשם לשלשות בתחילת הקורס.\nבהמשך הקורס הגיליונות נהיים קשים וארוכים יותר.\nאם אתם מחלקים את הגיליונות לשליש גיליון לכל אחד זה די קליל.\nאם אתם רוצים לפתור את כל הגיליון אז זה קצת עמוס, לפחות יחסית ל3 נק\"ז.\n\n*אם אתם מגיעים לבד ולא מכירים אנשים להירשם איתם אז אל תדאגו, יש לזה פורום ייעודי וכולם מסתדרים, חוץ מזה שכבר בהתחלה אתם תכירו אחלה אנשים :)\n\n\nהמבחן: הוגן לגמרי, יש שאלות על נושאים לכל אורך הקורס אז חשוב שתעברו שוב על כל החומר.\nעוד לא קיבלנו ציונים אז לא יודע להגיד אם קוטלים בבדיקה אבל לפי ציוני עבר ואיך שבדקו את השיעורי בית, הם ממש בסדר.\nבגדול השאלות הן שכאילו ממציאים לכם משהו חדש אבל בסוף זה כמובן מסתמך על מה שלומדים בקורס, אז לא להיכנס סתם ללחץ שלא מכירים.\n\nהשורה התחתונה: קורס טוב מאוד. חייב לציין לטובה גם את הסגל: ההרצאות והתרגולים מעולים, יש סיכומים מפורטים להכל במודל, החזירו ציונים ממש מהר על התרגילי בית וגם רשמו הערות מפורטות כדי שנדע להשתפר למבחן.\nהשיעורי בית גם בכלל לא עמוסים.\nאבל החומר מאוד תיאורטי, גם יחסית לקורסים של סמסטר ראשון, אני אישית פחות מתחבר לחומר כזה תיאורטי (סטודנט להנדסת מחשבים בכלל) ורק בגלל זה נתתי 4 ולא 5.\nמי שאוהב חומר מדמ\"חי תיאורטי לדעתי זה יהיה בשבילו הקורס שהוא הכי יאהב בסמסטר, ולמי שפחות אוהב אז לא נורא הקורס עדיין מעניין סה\"כ, ובכל מקרה הוא רק 3 נק\"ז.", "timestamp": 1715290817806}, {"author": "אורי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: מסבירה מעולה ובנועם.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מעולה. מסביר טוב ואחלה גבר.\n\nשעורי הבית: הגשה כל שבועיים, שאלות ממבחני עבר.\n\nהמבחן: הוגן מאוד, דומה לתרגילי בית\n\nהשורה התחתונה: צוות קורס מקסים", "timestamp": 1715330992684}, {"author": "Evyatar Reif", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: הקלטות של שרי\nחוות דעת - הרצאות: \nהקלטות מעולות וגם סיכומים מעולים.\nשם המתרגל/ת:  לא הלכתי\nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי הבית קשים בקטע מוגזם ממש ולא קשור למבחן.\nהמבחן: המבחן מאוד תבניתי, תפתרו מספיק מבחנים וזה כל פעם אותו דבר, פה לנפח שם ללכסן וכו' וכו'\nהשלמתי את הקורס ב5 ימים של לפני המבחן כי לא יכלתי ללכת להרצאות. היה ממש אפשרי\n\nהשורה התחתונה: באופן מפתיע היה הקורס האהוב עליי הסמסטר, הם ממש מקסימים כל הסגל שם.", "timestamp": 1715715497434}, {"author": "אחד שיודע", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שאול אלמגור\nחוות דעת - הרצאות: שאול מרצה טוב, ובעל תשוקה עמוקה לחומר שהוא מלמד. בנוסף יש לו רשימות ממש מסודרות שנורא קל לעקוב אחריהן וללמוד מהן. הביקורת היחידה שלי כלפיו היא שלעיתים ההוכחות שלו פחות מסודרות ורשומות כמו סיפור, בניגוד למה שמשתדלים להראות בתרגולים.\n\nשם המתרגל/ת: שונית אגמון\nחוות דעת - תרגולים: שונית מתרגלת מעולה, נינוחה מאוד, מצחיקה, יודעת את החומר בצורה מושלמת ויודעת להעביר אותו בעניין וברצון רב, רואים שאכפת לה. בנוסף בונוס ענק הוא ששונית מעבירה את התרגולים על גבי אייפד, ומפרסמת קבצי שלד לתרגולים כך שאין צורך לכתוב בלי סוף את כל השאלות, רק לעקוב (יש קבצים מלאים) ואו לכתוב רק את הפתרונות (קבצי שלד), ממליץ על שונית בחום.\n\nשעורי הבית: קשים מאוד, אצלנו בסמסטר שיעורי הבית היו חובה ומאוד מאתגרים, חייב לציין שבסופו של דבר משקל המגן שלהם היה די קטן ומאכזב, בדיעבד לא הייתי משקיע עליהם את כמות הזמן שהושקעה, בנוסף יש דרישה להגיש אותם מוקלדים, דרישה שגוזלת המון זמן ולא ברור למה קיימת.\n\nהמבחן: היה מבחן מאוד הוגן לטעמי, כלל התרגילים היו הוגנים וכאלה שאת הרעיון הכללי מאחורי הפיתרון שלהם ראינו או בתרגול או באחד מגליונות שיעורי הבית.\n\nהשורה התחתונה: קורס מעניין וחביב, ניתן להוציא ציון מאוד טוב.", "timestamp": 1716305887776}, {"author": "Yuval", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: שרי - יוטיוב\nחוות דעת - הרצאות: אחלה הקלטות, רק לפעמים הרגיש לי שקצת חסרה \"פרקטיקה\", כי בפרונטלי אנשים שואלים שאלות ואז יש יותר דוגמות ורואים את זה גם בפער בין אורך הסרטונים לבין הזמן של ההרצאות. אבל לא חושב ששווה ללכת להרצאות (המפוצצות יש לציין) נטו בגלל זה.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מתרגל טוב ולא סתם מומלץ כבר הרבה סמסטרים, למי שמפריע - התרגולים שלו כמעט מלאים לגמרי אז לפעמים פחות נשאלות שאלות ויוצא שעוברים די מהר על השאלות, בכל מקרה השאלות בתרגולים קשות ומומלץ לעבור עליהן אחר כך שוב לוודא הבנה.\n\nשעורי הבית: די קשים אבל יחסית קצרים ויש יחסית הרבה זמן, וגם בדרך כלל מבחינת חומר אפשר כמעט תמיד להתחיל לפתור את שיעורי הבית הבאים לפני ההגשה של הקודמים ככה שאפשר לתפוס פער בהגשות.\n\nהמבחן: הוגן וחלקו מאוד שבלוני וחוזר על עצמו, מאוד דומה לשאלות מהתרגולים.\n\nהשורה התחתונה: סגל קורס מאוד תומך ונחמד, ויש פורום לשאול שאלות מקצועיות שעונים בו *מאוד* מהר.", "timestamp": 1716483586769}, {"author": "bruh", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלמגור שאול\nחוות דעת - הרצאות: תותח על אין הרבה מרצים כאלה\n\nשם המתרגל/ת: חסון איתי\nחוות דעת - תרגולים: מתרגל נחמד, לא תמיד הספיק את החומר אבל הצליח להתאקלם לקראת סוף הסמסטר עם מצגות משלימות. מעביר את החומר בצורה מעולה.\n\nשעורי הבית: בסיסי, אם עוברים על החומר מההרצאות והתרגול אפשר לסיים תוך כמה שעות\n\nהמבחן: אם מתרגלים מספיק השאלות חוזרות על אותם עקרונות, 5 שאלות פתוחות של הוכחה/ הפרכה ושטויות כאלה\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1716572209319}, {"author": "בן שגב", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: \nמעבירה טוב את החומר. ההרצאות ממש עמוסות.\nשם המתרגל/ת: רועי גרוס\nחוות דעת - תרגולים: מתרגל תותח מעביר את החומר ממש טוב ומשתדל לענות לכולם על כל השאלות.\n\nשעורי הבית: \nמאתגרים וקשורים לחומר הנלמד.\nהמבחן: \nהוגן\nהשורה התחתונה: אחלה קורס החומר לא טריוויאלי אבל מעניין.", "timestamp": 1716982278717}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שרי/שאול\nחוות דעת - הרצאות: ממש רואים שגם שרי וגם שאול באמת אוהבים את התחום הזה ומאוד נהנים ללמד אותו, עם זאת היה לי מאוד קשה עם שניהם. שרי טיפה הרדימה אותי ושאול קצת מבולגן והיה קשה לעקוב אחריו. בסוף ראיתי הקלטות של שרי ביוטיוב והיה סביר\n\nשם המתרגל/ת: שונית\nחוות דעת - תרגולים: מתרגלת מעולה ובן אדם ממש נחמד, אבל היא מעבירה את התרגולים שלה דרך האייפד מוקרן על הלוח וגם היא מדברת קצת חלש אז אם לא יושבים ממש מקדימה מאוד קשה לעקוב אחריה. אחרי פעמיים עברתי למוקלט שלה ולדעתי משמעותית עדיף, גם שומעים וגם רואים הרבה יותר טוב.\n\nשעורי הבית: קצת ארוכים אבל לא מאוד קשים, רוב השאלות הן ממבחנים ככה שהן מאוד רלוונטיות ובאמת עוזרות להפנים את החומר במהלך הסמסטר.\n\nהמבחן: סך הכל השאלות עצמן היו הוגנות, הבדיקה קצת קטנונית ומורידים על ממש שטויות אז מאוד ממליץ להסתכל על סריקות משנים קודמות כדי לדעת לאיזה דברים לשים לב במבחן\n\nהשורה התחתונה: קורס מעט מוזר, משלב לתוך קורס אחד שני תחומים שלא באמת קשורים אז הוא נוגע די בקצה המזלג של שניהם. אבל זה גם הופך את הקורס ליחסית קל ופחות לחוץ לעומת הקורסים האחרים הסמסטר, בגלל המחסור בזמן באוטומטים מאוד מחפפים בהוכחות ורמת הפורמליות שנדרשת די נמוכה. בגדול קורס חמוד", "timestamp": 1717363797361}, {"author": "פסגותניק אלמוני", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: מרצה מעולה, מסבירה את החומר טוב ומפשטת את הדברים.\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מתרגל מדהים, מסביר הכל בצורה מאד מאד טובה וברורה, תמיד עוצר כדי להסביר דברים שלא היו ברורים למי שלא היה ברור.\n\nשעורי הבית: נחמדים מאד\n\nהמבחן: המבחנים היו ממש בסדר והוגנים, לא קשים מדי, לא קלים מדי. המועד א היה יחסית כיפי לדעתי, המועד ב קצת יותר מאתגר, אבל גם חמוד.\nהבדיקה לעומת זאת די קטנונית, נתפסת על קטנות, וממש ממש רוצים פרמול(לגיטימי כן?). הדרך היחידה(ככל הידוע לי) לדעת עד איזה רמה לרפמל היא להסתכל על מה שכותבים לכם בבוחן אמצע. אז שימו לב שאתם לא מאבדים כמות גדולה של נקודות רק כי פספסתם מילים בודדות שדי טריוויאליות.\n\nהשורה התחתונה: קורס מאד חביב ונחמד, חומר כיפי ומעניין. אבל שימו לב לדאוג לרמת פרמול מספקת.", "timestamp": 1717501386553}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: שרי מוקלט\nאחלה ממש\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  שונית מוקלט\nקצת משעמם אבל בסדר סה\"כ\n\nשעורי הבית: \nחופרים, אבל יותר קשים מהמבחן וזה תרגול טוב\nהמבחן: \nאחלה סה\"כ, אבל הבדיקה כ\"כ קטנונית שזה מוריד המון נקודות על כלום. מציע לבדוק טוב כל מילה וכל פסיק כי הם באמת מעיקים.\n\nהשורה התחתונה: \nמן הסתם זה הקורס הקל בסמסטר א', אבל יש מלא התקטננויות, הסגל סביר מינוס, לי הרגיש חוסר אכפתיות גדולה מצד איתי חסון ושאול המעצבן. ממליץ לבוא עם סבלנות ולהיות מסודרים בכל הנוגע לדרכי פתרונות רצויים לשאלות הקבועות במבחן כי הם באמת מורידים נקודות על כל דבר שרק אפשר.", "timestamp": 1718223236971}, {"author": "אין", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שרי\nחוות דעת - הרצאות:  משעממות\n\nשם המתרגל/ת: שונית,איתי,עומר\nחוות דעת - תרגולים:  האמת שלא התחברתי לאף אחד מהמתרגלים, הרגשתי שעומר הכי שולטת בחומר\n\nשעורי הבית: סבירים\n\nהמבחן: קשה בטירוף, לא מבין מה קרה למרצה האחראי שאול שלקח קורס עם ממוצע של 80 ובסוף מועד ב הממוצע עמד על 55\n\nהשורה התחתונה: קורס שאמור להיות הכי קל בסמסטר הראשון, אך כרגיל, עושים אותו מסובך וקשה ומייאש, לא משנה כמה תשקיעו תוך כדי הסמסטר ולפני המבחן, כלום לא מובטח עם המבחנים שלהם", "timestamp": 1718276088195}, {"author": "לא אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי ושאול\nחוות דעת - הרצאות: סבבה סה\"כ, שניהם טובים למדי\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: מתרגל ברמה גבוהה מאוד, יודע לגשת לאנשים באופן שמעטים יכולים. באסה שהוא עוזב\n\nשעורי הבית: קשים אבל מלמדים. תקפידו על שותפים טובים, נכון היה לנו בקבוצה אחד שלא מי ישמע עשה אבל עם השניים האחרים עבדתי היטב וזכינו להגיע רחוק\n\nהמבחן: מועד ב היה קשה משמעותית ממועד א, אבל אם מקפידים על פירמול ושומרים על רוגע (הכי חשוב!!!!!! רק באתם לכתוב כמה דברים, לא פחות ולא יותר, פשוט תעשו את המבחן ולכו הביתה לאכול טוב) אפשר לקבל מעל ומעבר. (ה 100 היחיד שלי הסמסטר)\n\nהשורה התחתונה: באמת שזה קורס חביב סה\"כ. ומכין טוב למדמ\"ח התאורטי. יש לי תחושה שאתגעגע לסגל הזה", "timestamp": 1718289492232}, {"author": "~", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: שרי\nחוות דעת - הרצאות: הרצאות דיי קלילות וחמודות, חומר בחלק הראשון דיי בסיסי ובחלק השני קצת יותר מוזר אבל מעניין\nבאופן כללי ניכר שהסגר מאוד נהנה להעביר את הקורס הזה וחבל שהרבה פעמים בהרצאות של שרי היה רעש ולא נתנו לה להעביר את החומר כמו שצריך\n\nשם המתרגל/ת: איתי חסון\nחוות דעת - תרגולים: באמת מתרגל תותח אין לי מילה רעה להגיד עליו, יודע להסביר וגם נותן עזרה עניינית בשעות קבלה (בשונה ממתרגלים אחרים שנותנים את התשובות או שהם חסרי תועלת לגמרי). תרגולים מוקדמים ועמוסים שזה קצת באסה אבל בעיניי בצדק \n\nשעורי הבית: 5 גיליונות של מבחני עבר להגשה בשלשות, המגן לא היה שווה יותר מידי בציון הסופי וגם לקבל פידבק על עבודה בשלשה קצת מיותר ביחס לזה שמתמודדים בסוף עם המבחן לבד, שווה להשקיע כדי לראות איך נראות שאלות ממבחן\nייאמר לזכותם שעשו בוחן אמצע עם פידבק בשונה משאר הקורסים בסמסטר א שלא נתנו פידבק על כלום כל הסמסטר\n\nהמבחן: מועד א יחסית עם שאלות סטנדרטיות ובדיקה דיי קשוחה\nמועד ב עם שאלות קצת מונפצות ולא שגרתיות אבל בדיקה יותר רחמנית ופקטור יותר גבוה\n\nהשורה התחתונה: קורס כיף, סגל פגז, צריך לקחת אותו בפרופורציות הנכונות \n\nחבל שהסמסטר לא היה שיר וקליפ :(", "timestamp": 1718369262014}]}