{"posts": [{"author": "rita ibrahim", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: 5/5\n\nשם המתרגל: רותם \nחוות דעת - תרגולים: 5/5\n\nשעורי הבית: ממליתה מאוד לפתור", "timestamp": 1598094238202}, {"author": "ח", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מסבירה את החומר בצורה טובה אבל יחס נוראי, אין מענה מצידה גם לדברים שחובה לתת כקורס רגיל, או סליחה, מתייחסת אבל רק לצד הגברי בקורס, אני לא אקח שום קורס שלה בעתיד.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ממש נחמדים וכיפים\n\nהמבחן: תלוי.\n\nהשורה התחתונה: זה קורס חובה אז אין ברירה רק תקוו שהמרצה האחראית היא לא יעל.", "timestamp": 1603822400026}, {"author": "Salwa Khafaga", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יונתן אלול\nחוות דעת - תרגולים: אכפתי מאוד, דואג לסטונדטים רציניים ומסביר יותר טוב מהמרצה.  \n\nשעורי הבית: להגיש את כל שיעורי הבית!! חשוב מאוד להפנמת החומר\n\nהמבחן: \n\nהשורה התחתונה: לא תבינו כלום עד שתנסו לכתוב קוד בעצמכם :) \nתיעזרו בגוגל כמה שיותר", "timestamp": 1614605695937}, {"author": "ניק", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: מרצה באופן ברור ומובן אך מאוד מאוד לאט כך שהיה קל לאבד אותו.\nמרצה מאוד מפוזר שהתנהל כלא אחראי, לא העלה הקלטות, לעיתים לא נכנס לשעות קבלה בלי להודיע מראש, לא ענה להודעות במייל וגם לא ענה לנציגי הסימסטר.\n\nשם המתרגל/ת: גיא עזרן \nחוות דעת - תרגולים: לא ברור מה קורה אצלו, דברים לא הוסברו עד הסוף. יכל להשתפר בתקשורת מול הסטודנטים אבל מבחינתי היה סביר.\n\nשעורי הבית: לא נורא בכלל. 6 עבודות לא קשות מדי לאורך הקורס.\n\nהמבחן: היה מבחן במחשב אז הוא היה קשה יותר מתמיד. היה פקטור נחמד אך עדיין ממוצע נמוך יחסית. \n\nהשורה התחתונה: קורס בסיסי מאוד", "timestamp": 1621974088914}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: קשה מאוד להקשיב ולעקוב, מאוד מונוטוני ותאורטי\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: הרגשתי שכל מה שלמדתי בקורס זה נטו מהתרגולים. יונתן לגמרי יודע מה הוא עושה, רואים שיש לו הבנה מאוד עמוקה של התוכנה. \n\nשעורי הבית: עוזרים להבנה של החומר אבל למי שאין רקע קודם אז די קשה לפתור אותם לבד\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1643980665132}, {"author": "( :", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: נחמד\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: תותח\n\nשעורי הבית: בהתחלה נחמדים, אחרי זה לא פשוטים בכלל.\n\nהמבחן: קשה- על המחשב זה לא פשוט בכלל והטסטים מפילים על כל דבר קטן.\n\nהשורה התחתונה: צריך להשקיע, קורס מעניין.", "timestamp": 1645721274323}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: כל המצגות וההקלטו של ההרצאות משנה שעברה נמצאים באתר הקורס אז בעיקר למדתי משם ופחות פרונטלית אצל רמי. \n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: ראיתי את ההקלטות של התרגולים שלו. מתרגל מצוין ובהחלט רואים שהוא מבין לעומק את החומר שהוא מעביר. אכפת לו מאוד מהסטודנטים שלו :)\n\nשעורי הבית: שאלות כתיבת קוד פעם בשבועיים. השאלות הראשונות פתירות מאוד. האחרונות ברמה די גבוהה והיה לא פשוט לפתור אותן. \n\nהמבחן: מבחן ממוחשב שהיה די הוגן אבל כמות שאלות גדולה מדי ביחס לזמן שניתן לנו בעיניי.\n\nהשורה התחתונה: קורס לא פשוט וממש לא ברמת \"מבוא\" לרוב האנשים, אבל עם המון תרגול אפשר להצליח בו לא רע :)", "timestamp": 1647501177254}, {"author": "היי:)", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: בסדר, קצת קשה להשאר בריכוז אבל הכל מסודר מאוד במצגות\n\nשם המתרגל/ת: גסוב\nחוות דעת - תרגולים:  מאוד נחמד, מסביר הרבה דרך המצגת. משווה הרבה פעמים להבדלים בשפת סי.\n\nשעורי הבית: יש כאלה שיותר קשים וכאלה שפחות.\n\nהמבחן: ממליצה לתרגל הרבה כתיבת קוד לקראת המבחן. יעילות זמן ומקום להשקיע אבל לא הכל הכל כי זה בסוף רק חלק מהמבחן למרות שזה נושא שקשה להבין קצת לפעמים\n\nהשורה התחתונה: קורס נחמד אבל מומלץ לתרגל הרבה למבחן", "timestamp": 1657622210428}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: אחלה מרצה- אין משהו רע להגיד עליו, מאוד נחמד ומאוד אכפת לו מהסטודנטים שלו\n\nשם המתרגל/ת: יונתן אלול\nחוות דעת - תרגולים: מקצוען, סה\"כ את רוב החומר לומדים מהתרגולים לדעתי.\n\nשעורי הבית: תרגילים אחת לשבועיים. בלי רקע הם קשים יחסית, מי שמגיע עם רקע לא יסתבך יותר מדי\n\nהמבחן: \n\nהשורה התחתונה: לאנשים בלי רקע הקורס יהיה עמוס יחסית", "timestamp": 1675879722560}, {"author": "רשא דאהר", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: \nמרצה מעולה יחד עם זאת לדעתי ההרצאות הם בזבוז של זמן תרגולים מספיקים\nשם המתרגל/ת: יונתן אילול\nחוות דעת - תרגולים: \nלדעתי התרגולים שלו מספיקים לכל חומר הקורס ואין צורך להרצאות אחלה מתרגל , הוא המתרגל המצטיין של הסמסטר \nהוא מסביר הכל בצורה הכי פשוטה ומובנת\nשעורי הבית: \nקשים אך מאוד עוזרים בהבנת הקורס\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676119073705}, {"author": "Zeinab Habeb Allah", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רמי כהן \nחוות דעת - הרצאות: מיותרים ו בזבוז לזמן אני חושבת שהתרגולים מספיקים \n\nשם המתרגל/ת: יונתן \nחוות דעת - תרגולים: ואללה אחללה מתרגל מעביר את כל החומר עם שיטות ו מתייחס לסטודנטים ו כן אכפת  לו שנעבור ו נבין את החומר , הוא יודע מה עושה ו מבין את הקורס לעומק \n\nשעורי הבית: לא קלים  , צריכים המון השקעה ו זמן - ממליצה לפתור בלבד כי זה באמת מכין אותכם גם למבחן\n\nהמבחן: סביר מאוד ו היה לי כיף אני ממליצה לפתור כמה שיכולים שאלות לרמי כשהיה אחראי ו גם  לתת יום רק סיבוכיות ו להבין לעומק , בטח חזרה על התרגולים ו לנסות לפתור את השאלות לבד \n\nהשורה התחתונה: קורס נחמד ו הצוות הכי טוב בעולם :)", "timestamp": 1677232702552}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רמי \nחוות דעת - הרצאות: שולט ממש בחומר הקורס \n\nשם המתרגל/ת: אקי שרמה\nחוות דעת - תרגולים: עוזרים ממש להבין את החומר הנלמד ולתרגל קצת פרקטיקה\n\nשעורי הבית: רמה הגיונית של תרגילים שמשתמשים בחומר הנלמד אבל הטסטים שמקבלים לא מספיק עוזרים (מה גם שלא ממש מלמדים איך לבנות טסטים לבד)\n\nהמבחן: היה הוגן וגם כשהבדיקה שלו הייתה מחמירה מידי הסגל ידע לתקן אותה ולשפר ציונים\n\nהשורה התחתונה: קורס סבבה לגמרי גם למי שאין רקע בתכנות, מי שישקיע יקבל ציון טוב.", "timestamp": 1677581926525}, {"author": "למה אכלתי אמא", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: משעממות, לא מחדש משהו מעבר למצגת.\n\nשם המתרגל/ת: יעקב\nחוות דעת - תרגולים: תרגולים ראשונים חסרי תועלת. למרות שגם אחרכך זה לא נעשה יותר טוב\n\nשעורי הבית: יש ויש. נורא על כל גליון אחראי מתרגל אחר. הש\"ב של שירה מהגיהנום, אקי בדר\"כ נותן ש\"ב סבירים. בדר\"כ תשבו על השיעורי בית כמה ימים.\n\nהמבחן: בעיקר קשה החלק של הסיבוכיות. שאלות הקוד די פתירות בעיקר כשיש לך קובץ של קודים שנלמדו בכיתה. הבדיקה של המבחן לא הייתה מובנת בעליל. על ערעור מורידים נק', אז לפעמים לא שווה לערער.\n\nהשורה התחתונה: כביכול קורס חשוב אבל הסגל לא משהו. בעיקר יונתן ושירה", "timestamp": 1677838859103}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: \nהרצאות יסודיות ומפורטות, רואים שאכפת לו.\nשם המתרגל/ת: שירה הרשקוביץ\nחוות דעת - תרגולים: \nתרגולים מעולים, יחס אישי ודואגת שכולם יבינו את החומר.\nשעורי הבית: \nישנם שישה תרגילי בית, השלושה הראשונים אפשריים ורצוי להתנסות לבד, אחר כך יש קפיצת מדרגה משמעותית ולמי שאין רקע התרגילים יהיו מאוד קשים\nהמבחן: \nלנו היה מבחן הוגן, החלק של חישובי סיבוכיות קשה לכולם ושאר השאלות היו אפשריות\nהשורה התחתונה: \nאפשר להגיע בלי רקע אבל זה ידרוש מאמץ במהלך הקורס, ממליץ למי שיש לו זמן לנסות לעבור על החומרים לפני ולהתנסות קצת.", "timestamp": 1679409921763}, {"author": "סמי הסטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: מרצה סבבה. הבנתי שהמרצה השנייה יעל, הרבה יותר נוראית.\n\nשם המתרגל/ת: שירה\nחוות דעת - תרגולים: סבבה. ממליץ לראות את ההקלטות במקום ללכת לתרגולים. הן באיכות הרבה יותר טובה.\n\nשעורי הבית: קשים, בעיקר למי שאין רקע.\n\nהמבחן: מועד א היה קל יחסית לשנים קודמות. מועד ב לא היה קל יחסית. בדרכ יש פקטורים. השנה לא נתנו\n\nהשורה התחתונה: מומלץ לנסות לרכוש ניסיון למי שאין.", "timestamp": 1679607417463}, {"author": "S", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: רמי נשמה, הוא מראה בלייב לתכנת ושינויים חשובים בקוד. יש הליך מסודר לשיעור, לכן כדאי לעקוב, בעיקר כדי לקלוט חשיבה אלגוריתמית. הוא גם בכללי נחמד ואכפת לו. מי שמגיע עם רקע בפייתון יכול להיכנס לשיעורים רק ממתי שמתחילים ללמוד על סיבוכיות.\n\nשם המתרגל/ת: שירה הרשקוביץ\nחוות דעת - תרגולים: שירה מקסימה, עונה על כל שאלה ועוזרת בכל מה שצריך. באמת אכפת לה ממך. מה שכן- זה פעם ראשונה שהיא מתרגלת ולפעמים היה צורך שהיא תעצור את השאלות החוזרות ותתקדם בשיעור (הרבה פעמים לא הגענו עד הסוף- איפה שיש שאלות ממבחנים על הנושא של התרגול). גם היו קצרים בין המתרגלים והמרצה על לאן הגיעו כל שבוע בחומר, ועל השיעורי בית.\n\nשעורי הבית: המטלה הראשונה חמודה. וזהו. משם קפיצת מדרגה מטורפת. חלק מהמטלות גם ארוכות ומסועפות ויכול לקחת לכם כמה ימים טובים לשבת עליהן, בתקווה שבסוף הקוד יעבוד לכם. הרבה פעמים הם היו צריכים להפיץ כל מיני הבהרות ודברים שהם לא חשבו עליהם, שזה גרר סתם תסכול והארכות. היתרון היחיד אבל משמעותי- השב היו ברמת מבחן, וגרמו לאנשים באמת להצליח בו.\n\nהמבחן(על מחשב-יש דיבאג!): מועד א היה ממש סלאמתק באופן מפתיע. הרבה הצליחו בו ואפילו לא היה פקטור (אחרי שהמתרגל האחראי חפר על זה שתמיד יש פקטור, אז לא היה). הקודים לא היו יותר מדי מסובכים, ואפשר להשתמש באלגוריתמים שלמדנו שכבר על המחשב (כמו דף נוסחאות). הסיבוכיות זה החלק הקשה, אבל זה תמיד.\n\nהשורה התחתונה: קורס לא קל בכלל אבל מלמד וחשוב. מצטערת שלא הגעתי עם רקע מינימלי בפייתון כדי להקל עליי, אבל כמובן שאפשר בלי. בסוף זה הבסיס לכל התכנות בהמשך ומזל שהפתיח לתכנות בחיים שלכם יהיה פייתון.", "timestamp": 1680556480083}, {"author": "o", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: לא מוסיפות משהו חדש, ניתן ללמוד עצמית את החומר דרך המצגות שמעלים לאתר הקורס.\n\nשם המתרגל/ת: שירה\nחוות דעת - תרגולים: מסבירה הכל, אין לה בעיה לעצור ולהסביר שוב עד שמבינים. בסה\"כ ממליצץ.\n\nשעורי הבית: צריכים זמן ומאמץ, במיוחד שהטסטים שמביאים עם מלא טריקים\n\nהמבחן: אאל תגשוו למועדד ב!! היתה אכזבה נוראית!! אחרי שמועד א היה ברמה מצויינת, המועד ב היה נורא נורא קשה כך שממוצע המבחן היה 33!! ולא רצו לעשות פקטור עד שנציג סמסטר ביקש מהם. בכלל לא הוגן ולא הגיוני גם כן!\n\nהשורה התחתונה: למי שמצליח ללמוד עצמית בקצב שלו שפשוט לא ילך להרצאות ותרגולים וישלים את החומר לבד. תלמדו טוב טוב למועד א כי בד\"כ לא שווה לגשת למועד ב.", "timestamp": 1683298583831}, {"author": "איתן", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: לא כלכך מלמד משהו בהרצאות אלא רק עובר על המצגות\n\nשם המתרגל/ת: יונתן ואקי\nחוות דעת - תרגולים:  מתרגלים מצוין, מסבירים טוב יותר בתרגול מאשר בהרצאה\n\nשעורי הבית: \nלעיתים קשים ויכולים לקחת יום שלם, אבל בסוף הוגנים \nהמבחן: היה סופר קשה, הממוצע היה 24.4\n\nהשורה התחתונה: זה לא משנה מה לומדים כל השנה, אפשר ללמוד לכתוב קוד בשבוע, בסוף משנה רק אם אתה יצירתי מספיק לחשוב על פתרון לבעיה. ואני לא חושב שמבחן עם זמן זאת אינדיקציה מספיק טובה", "timestamp": 1715803966830}, {"author": "שלומית", "difficultyRank": 3, "generalRank": 2, "semester": "202302", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: לא מובנות, מרפרף על דברים\n\nשם המתרגל/ת: אקי \nחוות דעת - תרגולים: אקי אחלה ממש\n\nשעורי הבית: לא מסובכים אבל לפעמים השאלות דורשות מעבר למה שנלמד\n\nהמבחן: הזוי, ממוצע של פחות מ25 בהתחלה ופקטור שהוא לא פרופורציונלי\n\nהשורה התחתונה:", "timestamp": 1716575825791}, {"author": "abc", "difficultyRank": 4, "generalRank": 1, "semester": "202302", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: די משעמם אבל מסביר לא רע\n\nשם המתרגל/ת: יונתן אלול\nחוות דעת - תרגולים: גרוע, מתנשא, לא מומלץ בכלל, אקי הרבה יותר נחמד.\n\nשעורי הבית: לא פשוטים ודורשים קצת זמן, בעיקר גם להתרגל לבדיקה האוטומטית\n\nהמבחן: קשה מאד, לא לזלזל בקורס הזה, תשקיעו לפני המבחן בלמידה\n\nהשורה התחתונה:", "timestamp": 1716660435843}]}