{"posts": [{"author": "מחבת פסים", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מרצה מעולה, מאוד מומלץ, מעביר מעניין וטוב את החומר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: את התרגולים ראיתי בוידאו ואני מאוד ממליץ החומר מועבר שם ממש טוב\n\nהמבחן: ממליץ לחרוש על מבחנים ולהבין את התבניות ואת מה שהם דורשים", "timestamp": 1597743679707}, {"author": "SR", "difficultyRank": 4, "generalRank": 5, "semester": "201802", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: ארז מרצה פשוט מעולה, תענוג לשבת אצלו בהרצאות. גם בעיניי המצגות שלו הן הטובות ביותר והברורות ביותר.\n\nשם המתרגל/ת: יונתן יניב (בווידאו)\nחוות דעת - תרגולים: הווידאו בקורס הזה מעולה ממש. על אף שהוא לפני הרבה שנים, הוא עדיין מאוד רלוונטי. מה שאני אוהב שגם המתרגל מקדיש יותר מ-50 דקות בווידאו, ולכן מספיק לעבור על הכל בצורה יסודית וברורה.\n\nשעורי הבית: יש 2 רטובים ו-3 יבשים. היבש הראשון ארוך בטירוף וגם הרטוב הראשון די עמוס. אחריהם, העומס בסמסטר יותר סביר. היבשים לא פשוטים בכלל ויכולים לקחת לפעמים ימים, אבל מומלץ להשקיע בהם כי ברמה של שאלות ממבחנים.\n\nהמבחן: המבחן לא פשוט בכלל וגם די לחוץ בזמנים. חשוב לפתור כמה שיותר מבחנים לפני, כי יש הרבה טריקים או רעיונות שחוזרים על עצמם אחרי מספיק תרגול.\n\nהשורה התחתונה: קורס באמת מעניין לדעתי וגם צורת ההוראה שלו מעולה. אני אישית הייתי מוותר על הרטובים בקורס כי לדעתי זו לא כל כך המהות שלו, אבל מעבר לזה אין לי תלונות.", "timestamp": 1597749057209}, {"author": "נגה", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שעורי הבית: היבש הראשון מאוד סיזיפי (נתנו לנו בתור תרגיל השוואת סיבוכיות של 15 פונקציות). הרטוב הראשון הוא מאוד ארוך, מומלץ להקדיש לו הרבה זמן. משתמשים במבנים שתכנתתם בתרגיל הזה גם בתרגיל השני אז תכתבו קוד טוב :) אם יש לכם מימוש של עץ AVL/ רשימה/ טבלת האש מראש כנראה שזכיתם.\n\nהמבחן: מאתגר, דורש הרבה יצירתיות. כדאי להתכונן ביסודיות ולעבור על סריקות.\nאם יש סמסטר קורונה שוב, קחו בחשבון שהסגל לא כל כך טוב בלכתוב מבחנים של שעתיים (אובייקטיבית הזמן היה קצר מדי, הממוצע לא כ\"כ נמוך כי לאנשים שלא יכלו לבוא למבחן פרונטלי כתבו מבחן נורמלי והגיוני).\n\nהשורה התחתונה: החומר מאוד מעניין, תרגילי הבית עמוסים. באופן אישי, נהניתי ממנו מאוד (בניגוד למת\"מ ולמבוא למדמ\"ח).", "timestamp": 1599225879459}, {"author": "אני", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: וידאו\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: וידאו\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: עמוסים, אבל תורמים להבנת החומר\n\nהמבחן: הסמסטר בגלל הקורונה המבחן היה מקוצר עם שתי גרסאות- שעתיים עם 4 שאלות (פרונטלי), או שעה וחצי ל-3 שאלות (מקוון). זה הראה עד כמה הסגל לא מחובר למציאות כשזה מגיע לרמת הקושי של כל שאלה בפני עצמה וכמה זמן סה\"כ צריך לקחת, כשהמבחן המקוון היה קל בהרבה מהפרונטלי. השאלות עצמן במבחן המקוון היו זהות לאלו במבחן הפרונטלי כאשר השינוי שנעשה בו הוא הורדת שאלה אחת (שהייתה by far הקשה ביותר)\n\nהשורה התחתונה: קורס חובה לכל מסלול של מדמ\"ח, אין שאלה של אם כדאי לעשות במשך התואר או לא. בסופו של דבר הוא כן מאוד מלמד.", "timestamp": 1600006825869}, {"author": "Gadi Nabet", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: לא היו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  קשים וארוכים\n\nהמבחן: קשה\n\nהשורה התחתונה:", "timestamp": 1603181425188}, {"author": "רון", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "השורה התחתונה: \nקורס מעניין אבל קשה עם המון חשיבה. חשוב למצוא שותף טוב לתרגילי בית", "timestamp": 1603293600650}, {"author": "עץ 2-3", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: מרצה מאוד ברור ובהיר. יחס אדיב לסטודנטים למרות שהקבוצה ענקית\n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: דחוסים מדי, לחוצים מדי, הקבוצה הייתה ענקית וזה הרגיש המוני. \nאי אפשר לבוא בטענות למתרגלת שניסתה ככל יכולתה להתמודד עם חומר רב וקבוצה ענקית, כ100 איש. \nשעורי הבית: יש הרבה גם ביבש וגם ברטוב. \n\nהמבחן: הוגן. מי שעשה שיעורי בית ותירגל מבחנים משנים קודמות, מסוגל להוציא ציון טוב. אני התבלגנתי רק בשאלה אחת מתוך 5 השאלות שם כי לא יצא לי לחזור מספיק על הנושא האחרון וכי כנראה שזו הייתה השאלה הקשה שאמורה לבוא כדי לייצר הפרדה בציונים. \n\nהשורה התחתונה: קורס נחמד ומעניין בהקשר של איך מארגנים מידע בצורה יעילה, באמצעות אלגוריתמים שימושיים. הקורס עמוס מאוד ביחס למספר הנקודות", "timestamp": 1610242739706}, {"author": "Gur Telem", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהייתי בערך ב30% בlive. השאר ראיתי הקלטות. \nבעיניי מסביר טוב אם כי יש חורים שהיה יכול להיות נחמד אם היה מתיחס אליהם. מניח שזה מה שאני מקבל אם אני לא בהרצאה לבקש בlive :-P.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי בית עמוסים, הרבה קוד, סה\"כ לא מטלות הכי קשות למימוש (מבחינת הרטובים). היבשים זה מאוד בעייתי, כי או שעלית על הנקודה ואז מקבלים את כל הנקודות, או שאפשר לפספס משהו קטנטן ולאבד 20 נקודות.\nיש גם קטע שמורידים 5 נקודות אם אתה צריך לתקן משהו בהגשה (בנוסף להגבלה של סדר גודל של 5 שורות תיקון). צריך לקחת בחשבון כי הסגל לא מספק איזה  finalCheck כמו באת\"מ, אז יכול להיות שמשהו בסיסי לא עובד אבל אי אפשר לדעת עד שמקבלים ציון.\n\nהמבחן: \n\nהשורה התחתונה: \nקורס עמוס, בעיניי חשוב, לא רואה את האדם הממוצע משתמש באפילו 20% אבל מהחומר. אנשים שילכו לפיתוח אלגוריתמים או יתעסקו בsotrage או משהו בסגנון בוודאות ישתמשו בחומר, אבל כנראה שלרוב המפתחים לא יהיה בזה שימוש ישיר.", "timestamp": 1612697983966}, {"author": "Trie again", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: המרצה אדיב ומתייחס יפה לסטודנטים ומכבד את השאלות. הוא גם מסביר טוב אבל לא מעולה, היה קל לאבד אותו ולאבד ריכוז בהרצאה, במיוחד שהוא מדבר בצורה קצת ״מנמנמת״. לי היה קשה להישאר מרוכז לאורך כל ההרצאה. אבל בסך הכל אפשר לצפות בדן גייגר או לעבור חזרה על השקופיות לבד.\n\nשם המתרגל/ת: גיל בן שחר ו עידו גליל\nחוות דעת - תרגולים: שניהם פשוט מעולים ומסבירים אחלה. הבונוס של עידו הוא ההוספות הויזואליות שהוא עושה למצגות שזה מאוד תרם לי בהבנת החומר(גם הבדיחות הקצרות שהוא לפעמים זורק ואף אחד לא שם לב :) \n\n\nשעורי הבית: רטוב ראשון קשה במיוחד, ליטרלי לקח יותר משבועיים עם ההארכה שנתנו לנו, מאוד קשה ולא באמת תורם להבנת החומר לדעתי.\nהיבשים קשים אבל שווה להשקיע בהם כי זה שאלות ממבחנים לרוב. העומס העיקרי היה ביבש1 ורטוב1, אחר כך פחות.\n\nהמבחן: \nעוד לא עשיתי אבל ממבחני עבר אני כבר רואה שזה ממש מאתגר ודורש המון השקעה\n\nהשורה התחתונה: קורס מעניין מאוד, חשוב ופותח אופקים. שווה להשקיע בו ,וליהנות.", "timestamp": 1613939519809}, {"author": "L", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: \nאורי מרצה טוב, מפרט ומסביר את כל מה שהוא מעביר בצורה טובה. צריך להיות בקשב 100% מהזמן כי הוא מדבר ברצף בלי לעצור, אלא אם עוצרים אותו לשאלות. לא לבעלי קשב וריכוז שצריכים לנשום ולעכל מה שנאמר כי הוא רץ.\n\nשם המתרגל/ת: גיל בן שחר\nחוות דעת - תרגולים: מתרגל בסדר גמור, מסביר את החומר בצורה טובה ואת התרגילים. נותן מעצמו אקסטרה זמן ותמיד נשאר ועונה על השאלות (בזום). סה\"כ בסדר.\n\nשעורי הבית: 3 יבשים, 2 רטובים. משאבת זמן אינסופית. היבש והרטוב הראשונים בעיקר לוקחים מספר ימים טובים של עבודה עליהם, כל אחד. \n\nהמבחן: קשה מאוד, לא חזרתי, וצריך להמציא את הגלגל כל מבחן מחדש.\n\nהשורה התחתונה: קורס סופר מעניין ורלוונטי, דורש הרבה השקעה.", "timestamp": 1614700927099}, {"author": "איציק", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: \nהעביר את החומר בצורה ברורה ומעניינת\n\nשם המתרגל/ת: יונתן יניב מהמוקלט\nחוות דעת - תרגולים: \nהתרגולים המוקלטים מעולים, ובסמסטר שלנו החומר היה חופף כמעט לגמרי(מלבד אולי שאלה בודדת שלא הופיעה במוקלט). לדעתי אפשר וכדאי להסתמך עליהם לגמרי ולעבור על המצגות המעודכנות תוך כדי רק כדי לוודא ששום דבר לא השתנה.\n\nשעורי הבית: \nרוב שיעורי הבית היבשים לקוחים ממבחנים ככה שהם באמת משקפים את הרמה שיש להגיע אליה.\nבסמסטר שלנו הרטוב הראשון היה ארוך ומייגע לפחות כמו תרגיל במת\"מ והשני היה קליל וקצר.\n\nהמבחן: \nלפני שפותרים מבחני עבר, כדאי לחזור על החומר התאורטי שהועבר בהרצאות/תרגולים ולחזור גם על שיעורי הבית, כי בלי להיות סגורים על החומר קשוח להתחיל מבחנים, אבל אחרי החזרה על החומר אפשר להצליח גם בלי לתרגל יותר מידי. \n \nהשורה התחתונה: \nקורס עמוס אך מאוד מעניין.\n3 נק\"ז שלא משקפים את כמות ההשקעה הנדרשת כדי להצליח בקורס", "timestamp": 1616153423045}, {"author": "amir alkalay", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי רוטנשיירך\nחוות דעת - הרצאות: מעבירות את המסר, אבל מצאתי את עצמי חוזר על כמה הרצאות בגלל שלא הבנתי בפעם הראשונה.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: אחלה מתרגל, מויסף אקסטרה משלו, אחלה הסברים.\n\nשעורי הבית: כבדים ומגעילים.\n\nהמבחן: צריך ללמוד אליו חזק מאוד, המבחן קשה, אבל ברגע שקולטים את כל הטריקים הוא נהיה קצת יותר קל.\n\nהשורה התחתונה: קורס מצוין, חשוב מאוד מעניין וקשה באותה המידה.", "timestamp": 1616228274528}, {"author": "ליאור", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: מרצה נחמד, הרצאות לא פשוטות ולפעמים צריך לעבור עליהן פעם נוספת.\n\nשם המתרגל/ת: גיל בן-שחר\nחוות דעת - תרגולים: מתרגל ממש טוב בעיניי, יודע את החומר בעיניים עצומות וענה כל הזמן לשאלות בפיאצה\n\nשעורי הבית: קשים, אבל ממש רלוונטים למבחן\n\nהמבחן: קשה מאוד, כמו תמיד תרגול של הרבה מבחנים עוזר לא מעט\n\nהשורה התחתונה: קורס קשה מאוד ומעניין מאוד, לא ברור איך הוא רק 3 נק\"ז", "timestamp": 1616234899985}, {"author": "יגל מימון", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ארז \nחוות דעת - הרצאות: בהתחלה הייתי אצל רמי, מעט התאכזבתי, וכשעברתי לארז מאד אהבתי\n\nשם המתרגל/ת: גיל\nחוות דעת - תרגולים: בן אדם גאון, משקיע כל כך בסטודנטים בהרבה סבלנות\n\nשעורי הבית: התרגילים הרטובים מאד עיכבו אותנו, צריך לגשת לתרגיל בית רטוב ראשון עם הבנה איך לבנות עץ AVL בפרט איך למחוק צומת, עם שמירה על יציבות העץ. אם עשית את זה כמו שצריך ה26 אחוז תקף דיי מובטח (גם תרגיל רטוב 2 מסתמך על AVL), ראוי לציין שמה שמכין באמת למבחן זה דווקא היבשים\n\nהמבחן: מסתמך על הבנה כללית של החומר וטריקים יצירתיים של השילוב ביניהם, היה קשוח וכיף בו\"ז\n\nהשורה התחתונה: אחלה קורס מעניין וחשוב, להשקיע ברטוב הראשון, להתכונן ממבחני עבר ושעות קבלה.", "timestamp": 1625991010765}, {"author": "מר קומבי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חצי סמסטר עם ארז חצי סמסטר עם רמי\nחוות דעת - הרצאות: \nשניהם מוצלחים מאוד\nמסבירים את החומר בצורה ברורה מאוד ונותנים אינטואיציה טובה\nמדי פעם ההוכחות קצת חופרות (בתור סטודנט ממתמטיקה אפילו) אבל לא קשות באופן מחשבתי\n\nשם המתרגל/ת: גיל בן שחר\nחוות דעת - תרגולים: \nאדם נפלא, מתרגל מאוד מוצלח\nהקבוצה קצת עמוסה ולכן קצת מתקדמים לאט\n\nשעורי הבית: קשים אך סבירים, תוקנו במהלך ההגשות כמה פעמים\n\nהמבחן: היה ממש קשה, לא סביר בעליל\n\nהשורה התחתונה: קורס חובה, אין יותר מדי מה לעשות", "timestamp": 1626017873694}, {"author": "YT", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: מרצה מעולה ומכבד. תמיד עונה על שאלות הסטודנטים ומסביר.\n\nשם המתרגל/ת: גיל בן שחר\nחוות דעת - תרגולים: מתרגל מעולה ואיכפתי עם המון המון ידע. מלמד בצורה מאד טובה. ממליץ!\n\nשעורי הבית: עיקר העומס של הקורס זה רטוב 1. באמת נורא ולא כיף וממליץ להתחיל כמה שיותר מוקדם. לדבג עץ זה מזעזע. רטוב 2 ממש קצר וסביר. היבשים סבירים, רוב השאלות הם מהמבחנים. ממליץ להיעזר בסריקות/רפרנסים ולהבין אותם כמו שצריך אבל לא להתעכב יותר מדי. יבש 1 הכי עמוס.\n\nהמבחן: מבחנים קשים קשים קשים, חייב לתרגל המון וכמה שיותר. הסמסטר מועד א היה לנו לא הוגן לטעמי שכן היה בו 25 נקודות בלתי פתירות, לעומת 75 נקודות קלות מאד מה שיצר התפלגות ציונים לא הוגנת.\n\nהשורה התחתונה: אני לא כל כך נהנתי מהקורס הזה, לדעתי הוא מעיק וקשה שלא צורך. לפחות הסגל הוא טוב.", "timestamp": 1626764208458}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  הרצאות מוקלטות של סמסטר קודם\nחוות דעת - הרצאות:  לא ממש מומלץ, לא היה לי אופציות אחרות כי ארז לא הקליט.\n\nשם המתרגל/ת: עידו גלילי\nחוות דעת - תרגולים:  מתרגל ממש טוב. יודע טוב את החומר ונותן בסוף עוד חלק של פיתרון תרגילים קשים ממבחנים.\nשעורי הבית: 3 יבשים ו2 רטובים. היבשים די עמוסים, שאלות מאוד קשות. יש גם שאלות ממבחנים שהן קצת יותר קלות. \nהרטובים מאוד עמוסים, כוללים הרבה קוד וגם חשיבה לפני.\n\nהמבחן:  מבחן קשה מאוד. שאלות חדשות כל פעם.\n\nהשורה התחתונה:  קורס מעניין וחשוב אבל עמוס וקשה.", "timestamp": 1627280896321}, {"author": "Omer Gino", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים \n\nהמבחן: קשה\n\nהשורה התחתונה: עמוס וקשה", "timestamp": 1627804355324}, {"author": "Elad Kay", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: ממש טוב וממש מעניין! ההרצאות לא קריטיות למבחן סך הכול נראה לי, הרבה ממה שעושים בהרצאות זה מוטיבציה, אלגוריתמים מדויקים (איך באמת מממשים את המבני נתונים ולא רק איך משתמשים בהם) וכמה מבני נתונים שמוצגים רק בהרצאה ולא בתרגול ובמילא לא מופיעים אף פעם במבחן (רשימת דילוגים, תור עדיפויות…). עדיין הייתי בא להרצאות.\n\nשם המתרגל/ת: גיל בן שחר\nחוות דעת - תרגולים: מצוין! יודע טוב טוב את החומר ויודע להסביר. ממש נחמד. לוקח לו קצת זמן לענות למיילים אבל לא נורא. התרגולים גם עוברים על החומר וקצת באמת על האלגוריתמים המדויקים שהם רלוונטיים רק לרטובים וכמעט ולא למבחן וליבשים, אבל יש גם שאלות שהן ממש טובות\n\nשעורי הבית: 2 רטובים שגרמו לי לרצות לפרוש מהתואר. הרטובים ממש לא ארוכים אבל ההתעקשות על לממש אותם בשפה כמו C++ חסרת טעם ומיותרת לטעמי. מי שמורגל באחת מבין C או C++ יצליח בלי בעיה. 3 יבשים עם שאלות מבחנים \n\nהמבחן: קשה\n\nהשורה התחתונה: מעניין ממש וממש חשוב", "timestamp": 1628959282966}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: דיי מובנות ולא משעממות, המרצה מראה נכונות להסביר עד להבנה. \n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: אחלה מתרגל, נהניתי מאוד להקשיב. מסביר טוב מאוד. \n\nשעורי הבית: דיי עמוס.", "timestamp": 1628959769897}, {"author": "Noam Wolf", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: רמי \nחוות דעת - הרצאות: על הפנים. נראה שהוא עובר על המצגת בפעם הראשונה איתך. מבלבל ומסבך את החומר. המרצה השני הרבה יותר טוב.\n\nשם המתרגל/ת: מיכל פרידמן\nחוות דעת - תרגולים: טובה מאוד, מסבירה היטב ובאווירה טובה.\n\nשעורי הבית: קשים בצורה מוגזמת, לוקחים כמות זמן לא פורפוציונלי לנק\"ז. חובה שותף רציני. \n\nהמבחן: קשה, לא בגדר הלא אפשרי אבל מאוד קשה \n\nהשורה התחתונה: קורס חובה, לא מועבר בצורה הכי טובה וקשה. אבל חשוב האמת וכן מקנה ידע רב.", "timestamp": 1635229149228}, {"author": "Adelson-Velskii", "difficultyRank": 3, "generalRank": 4, "semester": "202003", "text": "שם המרצה: סתיו פרלה\nחוות דעת - הרצאות: סתיו הסבירה בצורה מדוייקת וברורה וענתה על כל השאלות בסבלנות. הצליחה ליצור עניין ולהסביר את החומר בצורה שבאמת אפשר להתחבר ולהבין.\n\nשם המתרגל/ת: גיל בן שחר\nחוות דעת - תרגולים: גיל שולט בחומר ברמה מעוררת התפעלות, וגם מסביר אותו בצורה ברורה. אין אצלו מצב שסטודנט שבאמת רוצה להבין את החומר לא יבין, כי הוא יסביר שוב ושוב בהמון דרכים שונות וישקיע 4 שעות ב\"שעת קבלה\" שוב ושוב עד שכולם יקבלו תשובות מפורטות. \n\nשעורי הבית: הרבה פחות עמוס ממתמ, הרבה יותר קשה ממתמ/קומבי. יש 3 יבשים ו2 רטובים. הרטוב הראשון זה לממש מבנה נתונים שנקרא עץ AVL ואז להשתמש בו בשביל תרגיל אחר בכל סמסטר. הרטוב השני יותר משתנה, אבל שוב החלק הכבד זה לממש את מבני הנתונים שצריך בשביל התרגיל שנותנים. הרטובים פחות רלוונטיים למבחן, ויותר נועדו בשביל עוד הזדמנות בתואר להתנסות בתכנות. מה שכן, אלו רטובים שבאמת נהנתי מהם (במתמ סבלתי) כי הם דורשים המון חשיבה ותכנון לעומק, ו(יחסית) מעט כתיבה.\nהיבשים הם כמעט אך ורק שאלות ממבחני עבר. הם קשים בטירוף, ואני ממליץ לקחת אותם ברצינות ולהשקיע בהם כמות מכובדת של זמן (לרפרנס זה קל כי יש סריקות בדרייב). זו ההכנה הכי טובה שאפשר לעשות למבחן תוך כדי הסמסטר. בשני היבשים האחרונים קצת פחות השקעתי וזה מאוד התנקם בי בלמידה למבחן.\n\nהמבחן: המבחנים הכי קשים שראיתי בפקולטה למדמח. באמת. בהתחלה הם גובלים בלהיות בלתי-פתירים, אבל אחרי שקוראים מספיק סריקות וצופים במספיק שעות קבלה מוקלטות, מתחילים להפנים את הרעיונות שחוזרים על עצמם ולהיות מסוגלים ליישם אותם בפתרון. מה שכן, לא כל השאלות הן לשלוף רעיונות מוכרים, והרבה פעמים צריך להמציא את הגלגל מחדש, אבל כן מתרגלים לדרך החשיבה של הקורס. מאוד חשוב - הזמן משחק תפקיד גדול במבחן הזה. במועד א לא הצלחתי, כי פירטתי יותר מדי ולא השארתי זמן לשאלות הקשות. במועד ב הצלחתי כי שיניתי אסטרטגיה - חשוב לעבור על המבחן כולו, לחשוב על כל שאלה, כשנתקעים להמשיך הלאה, ולהגיע בסוף למצב (בשאיפה) שלכל שאלה כותבים רעיון לפתרון שבטוחים בנכונות ובסיבוכיות שלו. רק אחרי זה להתחיל לפרט על כל פונקציה ולנמק נכונות וכו, אחרת הולכים לאיבוד עם הזמן.\n\nהשורה התחתונה: מבני נתונים = קומבי+מבוא למדמח+קצת אינפי + עוד המון דברים חדשים. זה הקורס הכי מעניין בפקולטה למדמח עד כה, אבל גם קשה בהתאמה.", "timestamp": 1635794059852}, {"author": "AVL", "difficultyRank": 3, "generalRank": 3, "semester": "202003", "text": "שם המרצה: רמי (מהקלטות של סמסטר אביב)\nחוות דעת - הרצאות: טובות, מסביר ברור ונותן אינטואיציה טובה\n\nשם המתרגל/ת: עידו (מהקלטות של סמסטר אביב)\nחוות דעת - תרגולים: מתרגל מעולה, מסביר סופר ברור, ואפילו נותן תרגילים אקסטרה מעבר לזמן של התרגול.\n\nשעורי הבית: עמוסים במידה בינונית (3 יבשים ושני רטובים), לי מאוד עזר לממש את המבני נתונים שלמדנו עליהם ברטובים כדי להבין יותר טוב.\n\nהמבחן: הוגן יחסית, אבל ממש ממש ארוך\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1635854441845}, {"author": "עמנואל זלצמן", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשוח למות\n\nהשורה התחתונה: תתכוננו טוב למבחן", "timestamp": 1644093904564}, {"author": "אא", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשווה להשקיע ביבשים כי הם דומים למבחן, הרטובים ביחד זה 7 אחוז מהציון אבל עמוסים מאד מאד במיוחד למי שאין ניסיון של כתיבת קוד - שווה לחשוב אם בכלל להשקיע בהם\nהמבחן: \nקשה מאד מבחן לא סטנדרטי, חצי מהמבחן היה שאלות טריקיות ומתחכמות שמי שיודע את הטריק יוכל לפתור אחרת זה יקח זמן לא סביר לפתור אותן. מה עוד אפשר לומר על מבחן עם שאלת סיבוכיות רקורסיבית שהיא סה\"כ 5 נק אבל כדי לפתור אותה צריך 3 -4 החלפת משתנים כדי לפתור אותה.\nהשורה התחתונה:", "timestamp": 1644224883814}, {"author": "ד", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: ראיתי את המוקלטות שלו, הוא מרצה טוב, שווה ללכת אבל רק להעמקה נוספת ( התרגולים בתכלס מה שחשוב)\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: גם כן ראיתי את המוקלטים שלו. הוא מעולה! המצגות שלו מסבירות בצורה טובה את השאלות והחלק של האקסטרה עזר בלמידה למבחן\n\nשעורי הבית: לא היה נורא כמו שמצפים, בעיקר מפחידים שהולך להיות קשה אבל בפועל לא באמת אם מתכננים בצורה נכונה מראש.\n\nהמבחן: קשה אבל פתיר, מומלץ לפתור מבחנים \nאת השאלות שלא מצליחים לראות את המתרגל פותר בשעות קבלה המוקלטות שכבר קיימות זה תורם מאוד להבנה.\n\nהשורה התחתונה: קורס חובה ככה שאין ברירה, מאוד מעניין מבחינת הכלים שמלמדים לאורך הקורס.\nסגל הקורס מתנהל בצורה מאוד לא מקצועית בבדיקת ש.ב והיחס כלפינו מבחינה מנהלתית, חבל כי מאוד קל לשפר את זה אם רוצים.", "timestamp": 1644239160140}, {"author": "שמוליק", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורי - הקלטות\nחוות דעת - הרצאות: אחלה הקלטות, מרצה טיפה מנומנם אבל בסך הכול הקלטות מעולות\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: תותח על\n\nשעורי הבית: עמוסים, הבדיקה מאוד מרושלת ואין משוב.\n\nהמבחן: קשה\n\nהשורה התחתונה: הסגל במחזור הזה(בעיקר המתרגל אחראי) היה גרוע מאוד, עצוב מאוד. התנהל בצורה מחפירה רוב הסמסטר. מניח שהרוב זה בגלל המתרגל אחראי, המרצים לא התערבו בהתנהלות.", "timestamp": 1644834049915}, {"author": "s", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: אחלה מרצה. מעביר את החומר בצורה נהדרת. לפעמים ממהר קצת אבל תמיד עונה על שאלות אם יש.\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: מזעזע. שומר נפשו ירחק. יחס מזעזע. התנהגות מזלזלת ובאמת שאין צורך שארחיב עוד כי כנראה הבנתם שעדיף להתרחק. אם גם איכשהו אתם יכולים לבחור מתי לעשות את הקורס אז עדיפות ראשונה היא מתי שברק *לא* מתרגל אחראי.\n\nשעורי הבית: קשים בטירוף. המון זמן של תכנון ופחות כתיבה. אם ברק המתרגל האחראי תתכוננו בסיכוי גבוה לבדיקה מזלזלת בטירוף.\n\nהמבחן: קשה מאוד. לתרגל כמה שרק אפשר ואפילו יותר.\n\nהשורה התחתונה: קורס יפה. מתרגל אחראי מזלזל בצורה שלא נתקלתי במהלך התואר.", "timestamp": 1644866354101}, {"author": "זאב", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nאחלה מרצה. מעביר את החומר בצורה נהדרת. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nברק - מאוד משקיע וקשוב לבקשות הסטודנטים. לאחר בדיקה ראשונה של הרטוב, שינה את המפתח בדיקה בשביל לעלות את הממוצע של הרטוב. \nהיינו צריכים להגיש תרגילי בית מספר פעמים ואפשר לנו לתקן את התרגילים ולבצע הגשה חוזרת. \nשעורי הבית: \nקשים, אך ניתנים לפתרון במידה ומשקיעים.\nהמבחן: \nאם לומדים למבחן כמו שצריך, המבחן מאוד הוגן. \nהשורה התחתונה:", "timestamp": 1645113288449}, {"author": "רועי", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אורי - הקלטות\nחוות דעת - הרצאות: אחלה הקלטות.\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: תותח על\n\nשעורי הבית: עמוסים, הבדיקה של היבשים מאוד מרושלת.\nברטובים ברק (המתרגל האחראי), בתקופת ערעורים הקשה את הטסטים אך אפשר לנו להגיש מחדש מעל העשר שורות קוד שמותר, מה שמאוד עזר. \nהממוצע של תרגילי הבית הרטובים יצא בסוף גבוה. \n\nהמבחן: קשה אבל עם חומר פתוח. צריך לדעת את החומר טוב בשביל להצליח. \n\nהשורה התחתונה: הסגל במחזור הזה היו קשובים לבקשות שלנו, אך היה צריך לדבר איתם. אפשר היה לראות שמאוד איכפת להם בכל בקשה שביקשנו.", "timestamp": 1645114728124}, {"author": "Ziv Mor", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מרצה מעולה, מעביר מצוין את החומר עם אינטואיציות ודוגמאות.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: חגורה שחורה במבני נתונים. שפיץ על, נותן ים דוגמאות ומשקיע זמן לתת אקסטרא (הא' במקור) תרגילים\n\nשעורי הבית: שני רטובים ושלושה יבשים. הרטובים לא הכי קשים בהיסטוריה אבל כן לוקחים זמן. היבשים פחות קשים אבל לקראת סוף הקורס כבר נגמר הכוח. לא לכתוב קוד מגעיל כי משתמשים בו שוב + בתי הכלא מלאים באנשים שכתבו קוד מגעיל.\n\nהמבחן: יש 50+ מבחני עבר (אין פתרונות אבל יש סריקות ויש פתרונות של מתרגלים מתרגולים) אז לא חסר מאיפה לתרגל. רמת קושי לא אחידה.\n\nהשורה התחתונה: להיזהר מהמסיחים בקאהוט. קטע מסריח", "timestamp": 1645342851832}, {"author": "הארנבת המעופפת", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: רןעי אנגלברג/אורי מוקלט\nחוות דעת - הרצאות: \nקשה לי להבין את אלו שאומרים שרועי מרצה מעולה. הייתי מדרג אותו כמרצה ממוצע. לי היה לא פשוט להבין אותו- כנראה שזה שילוב של השעה ושל החומר המורכב ולכן זה אינדיבידואלי. בהמשך הסמסטר עברתי לצפות באורי מוקלט (מאילוצי בידוד) וזה היה מעולה. סה\"כ שני המרצים די יסודיים בעבודה שלהם ואכפתיים. מבחינת איכות ההסברים- סביר מאוד אבל טעון שיפור.\n\nשם המתרגל/ת: תומר כהן\nחוות דעת - תרגולים: \nמתרגל מעולה ויסודי. הלכתי אליו כל הסמסטר גם כשכולם עברו לעידו במוקלט. מאוד עזר לי להבין דקויות קריטיות בחומר ותמיד היה לו זמן פנוי לאחר התרגולים כדי לשבת ולהתעמק בשאלות שפתר. מאוד אכפתי ומתחשב.\n\nשעורי הבית: \nיש 2 תרגילים רטובים שמתבססים אחד על השני. חשוב לעשות את הראשון כמו שצריך על מנת שהשני יעבוד. מבחינת רמת הקוד הדרושה, בינונית. רוב העבודה היא תכנון ומחשבה כיצד יעבדו מבני הנתונים. עם תכנון מדויק, אפשר לסיים קוד ראשוני גם תוך כמה ימים בודדים ולהתחיל לדבג.\nיש 3 תרגילי בית יבשים עם שאלות שונות ברמות מורכבות שונה, סה\"כ הייתי אומר שהם בסדר. צריך לחשוב קצת מחוץ לקופסה אבל זה מכין אותך למבחן ולכן זה חשוב לעשות אותם ולנסות לשבור עליהם את הראש.\n\nהמבחן: \nמבחן סטנדרטי במבני נתונים, יש שאלות בסדר ויש שאלות קשות, לפעמים מתקטננים על שטויות בבדיקה מה שמאוד מבאס. חשוב לתרגל כמה שיותר מבחנים כדי להבין טריקים ולהתייחס להכנה למבחן ברצינות מאוד. אני לא הרגשתי 100% על החומר במהלך הסמסטר וכן הצלחתי באמצעות הכנה מסודרת, להגיע לציון משביע רצון.\n\nהשורה התחתונה: היה לי קשה להתחבר לקורס במהלך הלמידה בסמסטר, תרגילי הבית והחומר היו נראים לי מוזרים ולא הבנתי את המטרה הכוללת. רק במהלך הלמידה למבחן הבנתי כמה הקורס מפתח את החשיבה וקורס חשוב מאוד להמשך התואר במדעי המחשב.", "timestamp": 1645633199235}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עושים מלא טעויות בבדיקה, מתרשלים באופן קבוע, מחפשים בקטנות, הממוצע של הרטוב השני היה 20 עד שהם הבינו ש״אולי יש פה בעיה״.\n\nהמבחן: שני מבחנים מסריחים עם בדיקה נוראית, על כל שטות מורידים חצי מהניקוד, ממוצע 60 במועד ב אחרי פקטור (הכי נמוך בהיסטוריה של הציזפורק).\nנראה שהסגל חושב שהוא יותר מוצלח ככל שהציונים יותר נמוכים, בושה וחרפה.\n\nהשורה התחתונה: מציע לסגל לשנות כיוון.", "timestamp": 1646919888145}, {"author": "~", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \nמדבר מאוד מונוטוני, מרצה בסדר\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: אם הוא אופציה - ללכת אליו. מסביר מעולה, משקיע, מתרגל תותח!\n\nשעורי הבית: רטובים קצת פחות גרועים ממתמ, אבל עדיין עמוסים בטירוף, תיתכוננו להיות בלי חיים בתקופה הזאת.\nלדעתי אצלנו בסמסטר הם היו בערך באותו היקף עבודה, ותרגיל 2 היה לא פחות עמוס מתרגיל 1\n\nהמבחן: מזעזע, מועד ב עוד יותר. ממוצע 65 אחרי פקטור. השאלות היו ממש לא סטנדרטיות ועל נושאים מאוד איזוטריים מהקורס.\n\nהשורה התחתונה: קורס מעניין, שיעורי בית ארוכים ועומסים מאוד, מבחן נוראי - נראה כאילו הסגל בכוונה בא לדפוק. המתרגל האחראי - ברק: בין האנשים היותר לא נחמדים ואטומים שפגשתי, עשה לנו קטע מסריח בתרגילי בית וענה בצורה לא נחמדה. אני לא אופתע אם הוא לקח חלק מהמועד ב שהיה לנו. מקווה מאוד שהוא לא יהיה מתרגל אחראי בקורסים הבאים.", "timestamp": 1647074274005}, {"author": "--", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי\nחוות דעת - הרצאות:\nמרצה בסדר, לא הלכתי לכל ההרצאות.\n\nשם המתרגל/ת: ברק\nחוות דעת - לא הלכתי לתרגולים של ברק, אבל בתור מילואימניק ביקשתי עזרה רבה, ותמיד ברק היה קשוב ומוכן לעזור. גם בלתת הארכות לתרגילי הבית וגם בלקבל ערעורים בזמן מאוחר.\n\nראיתי את עידו בוודאו ואני מאוד ממליץ עליו, תמיד מוסיף עוד לתרגול ומשקיע ממש. \n\nשעורי הבית: רטובים פחות גרועים ממת״מ אבל עמוסים בטירוף. אצלנו תרגיל בית 2 בהתחלה הממוצע היה מאוד נמוך, ולאחר מכן הסגל תיקן את הממוצע באמצעות בדיקה שונה. \n\nהמבחן: המבחן קשה, אבל יש מלא מבחנים לתרגל מהם.\n\nהשורה התחתונה: \nקורס קשה, עם הרבה חומר וש״ב קשים.", "timestamp": 1647185881173}, {"author": "Bob Bobinson", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: רועי מרצה ממש מעולה. הוא מאוד מעניין ונחמד, ועושה הרבה מעבר לנדרש, עם כל מיני אתנחתות קומיות וקהוט אחרי כל הרצאה. מומלץ מאוד.\n\nשם המתרגל/ת: רנא שחות\nחוות דעת - תרגולים: רנא מתרגלת מעולה. היא מסבירה טוב את החומר ועונה על כל השאלות. היא גם דואגת שתמיד נסיים את התרגול בזמן ועדיין נספיק לפתור את כל השאלות בו, מה שמאוד עוזר אם יש תרגול/הרצאה אחרים אחריה. מומלצת מאוד.\n\nשעורי הבית: נוראיים. בלי קשר לחומר הקורס התיאורטי לחלוטין, יש שני תרגילים רטובים ב-C++ אפילו יותר גרועים ממת\"מ. יש גם עוד שלושה תרגילים יבשים לא פשוטים וארוכים גם הם. בסך הכל הקורס הכי עמוס שהיה לי עד עכשיו בתואר. לא עוזר העובדה שהסגל (או לכל הפחות, מתרגל אחראי אחד מסויים) ממש רעים - לא אכנס כאן לדרמה הרצינית שהייתה לקראת סוף הסמסטר, אבל בקצרה הגישה של הסגל היא תמיד \"סטודנטים טועים\", גם כאשר זה 80% מהם ויש הוכחות אחרת.\n\nהמבחן: הסמסטר היה נוראי. שאלות טריקיות ולא דומות למה שהיה קודם, דגשים הזויים (הוכחת סיבוכיות נוראית, שאלת הגיון פתוחה על חומר שהועבר בשעה בהרצאה האחרונה...) והגישה של הסגל שהוזכרה למעלה - עשרות סטודנטים היו צריכים לערער על אותה שאלה עם אותו פתרון לפני שהסגל הסכים לקבל אותו. הממוצע של המבחנים (אחרי פקטור ושיעורי בית) היה 70 במועד א' ו-65 בב' - יותר נמוך מכל הסמסטרים הקודמים.\n\nהשורה התחתונה: בתור אחד שבאמת אהב את החומר ונהנה בהרצאות והתרגולים, ממש עצוב איך שהקורס הועבר הסמסטר בטכניון. שיעורי הבית והמבחן פשוט הורסים לגמרי את הכיף והעניין בקורס, והסגל כאן הכי נוראי שראיתי עד עכשיו בטכניון. הייתי ממליץ על הקורס אם לא הסגל ושיעורי הבית.", "timestamp": 1647267208077}, {"author": "---", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: רועי\nמרצה אחלה, משקיע, ועשה גם קאהוט.\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: \nתומר מאוד השקיע בתרגולים, ותמיד גם ענה בפיאצה שהיה מאוד נוח. הוא היה המתרגל היחיד שענה תשובות יחסית מלאות בפיאצה לפני המבחן.\n\nשעורי הבית: \nהרטובים בקורס היו כבדים והטסטים בדקו כל מקרה קצה שקיים. תשקיעו בטסטים כי הסגל מנסה לחשוב על כל המקרי קצה שקיימים. המתרגל האחראי אפשר לעשות הגשות חזרות, וכמעט לא קנס. \nאנחנו עוד הגשנו באיחור מאוד גדול כי ביקשנו אישור לזה, והוא הסכים ובדק ידנית לנו.\n\n\nהמבחן: \nהמבחן מאוד קשה, צריך לפתור הרבה מאוד מבחנים ולהכיר טריקים. הממוצעים בסמסטר שלנו היו נמוכים. המועד ב׳ היה קשה יותר ממועד א׳ אבל שני המבחנים בחנו על כל החומר. \nהשורה התחתונה:", "timestamp": 1647372219833}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: מרצה די טוב, ראיתי הקלטות מסמסטרים קודמים, קצת איטי בלייב.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: מתרגל מעולה שמנסה להכניס כמה שיותר דגשים לתרגולים שלו. מומלץ!!\n\nשעורי הבית: עמוסים ברמה הזויה ומוגזמת. נראה כאילו תרגילי הבית הרטובים באו לבדוק את היכולות שלנו בתכנות ולחכות שנישבר מאשר לבדוק אם אנחנו מבינים את מה שהועבר בהרצאות. תרגילי בית רטוב לוקח בממוצע שבוע-שבוע וחצי של עבודה מהבוקר עד הלילה ולפעמים גם זה לא מספיק.\n\nהמבחן: בחיים שלי לא ראיתי מבחן כל כך לא פתיר, ואני לא יכול להדגיש את זה יותר. \n\nהשורה התחתונה: אם לא חובה, לא לקחת!!! ואם כן חובה, ברכות נדפקתם.", "timestamp": 1647991431249}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: לא ראיתי מאחר ואני חוזר על הקורס. סביר להניח שבפעם השנייה אחרי המבחנים בסמסטר.\nוחשוב לי לציין שלפני ההקורס הממוצע שלי עמד על 95 ככה שהטענות לא מוצגות כאן משום שאני סטודנט חלש.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא ראיתי \n\nשעורי הבית: תרגילי הבית הרטובים לא סבירים בכלל לקורס של 3 נק\"ז. הטסטים בנויים להכשיל אותך גם אם הקוד שלך עבר טסטים ארוכים וקפדניים לפני כן. אין קשר ביניהם לבין המטרה האמיתית של הקורס שהיא ללמוד על מבני נתונים.\n\nהמבחן: אם בתרגילי בית חשבתם שסיימתם עם הסיוט הזה אז תחשבו שוב! הסגל כותב מבחנים כדי שיהיה ממוצע 56.2 ללא פקטור. במבחן מועד ב הורידו לי חצי שאלה על זה שלא סיימתי את הנימוק ב\"לפי ההרצאות\". כל שאלה היא או חידה שלמה או חצי חידה ומצופה מכם גם לפתור את החידה נכון וגם לרשום על הדף את כל מה שעובר לבודקים בראש.\n\nהשורה התחתונה: קורס עם חומר מעניין שמנוהל בצורה נוראית ביחס לכל קורס שלקחתי עד היום בטכניון. אני כבר יודע שבתחום הזה אני לא אבחר כהתמחות.", "timestamp": 1648197737464}, {"author": "J", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: מתרגל מדהיםםםםםםםםםםםם\n\nשעורי הבית: תתמקדו ביבשים, הם אשכרה מהמבחנים\n\nהמבחן: קשוח ברמות\n\nהשורה התחתונה: אם ברק מתרגל אחראי בקורס תעשו הכל בשביל לדחות אותו לסמסטר שהוא לא שם. דיס ענק על המתרגל הזה, התנהגות מחפירה שאין דברים כאלה, גם בבדיקות וגם בערעורים וגם במבחנים. תודו לי אחר כך.", "timestamp": 1648914971483}, {"author": "-", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: רועי מרצה ממש מעולה, רואים שהוא לא חבר סגל. \n\nשם המתרגל/ת: רנא שחות\nחוות דעת - תרגולים: רנא מתרגלת מעולה, תמיד דואגת שנסיים בזמן ומסבירה טוב את החומר.\n\nשעורי הבית: יש שני תרגילים רטובים ב-C++ אפילו יותר גרועים ממת\"מ. יש גם עוד שלושה תרגילים יבשים לא פשוטים וארוכים גם הם, אבל הם חשובים למבחן. בסך הכל הקורס הכי עמוס שהיה לי עד עכשיו בתואר. \n\nאם ברק מתרגל אחראי, תדעו שתרגילי הבית יהיו קשים ויבדקו כל דבר שאפשר לבדוק, אבל יהיה לכם בונוסים למי שישקיע. הוא תמיד זמין באימייל וסה״כ הוא הוגן במהלך הקורס אך קשוח. יש כאלה שלא אהבו את הקשיחות הזאת בתרגילי הבית, מצד שני זו אוניברסיטה. \n\nהמבחן: המבחנים הסמסטר היו קשים אבל הממוצע אחרי מועד ג׳ יצא בסדר בסוף. הממוצע הסופי היה 74.5, כנראה שסגל הקורס כיוון שיהיה מועד אחד קשה יותר בשביל שהממוצע לא יהיה גבוה מדי.", "timestamp": 1649414547386}, {"author": "~", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: אחלה, מעביר את החומר בצורה מעניינת וברורה\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מדהים! רואים כמה הוא משקיע וכמה חשוב לו שנצליח. נקודת האור היחידה בקורס הזה\n\nשעורי הבית: עמוסים\n\nהמבחן: מזעזע וקשה\n\nהשורה התחתונה: החומר כיפי אבל הסגל מתסכל, ומרגיש שהם באים במטרה להרוס לך את היום", "timestamp": 1650020562112}, {"author": "fox", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המתרגל/ת: ברק \nחוות דעת - תרגולים: \nברק נתן מלא דוגמאות טובות וכללים בסיסיים לכל המבנים השונים. מאוד נהניתי ללכת לתרגולים שלו במהלך הסמסטר. מאוד ממליץ ללכת לתרגולים שלו, מדבר בצורה מעשית ומסביר ממש טוב את החומר.\n\nשעורי הבית: \nהתרגילים הרטובים היו קשים אבל קיבלו משקל הוגן בציון שלנו. לסגל היה מאוד איכפת שנצליח ברטובים והשקיעו הרבה בלענות לנו על הכל. \n\nהשורה התחתונה: \nקורס קשה, אבל הסגל מאוד איכפתי וקשוב לסטודנטים", "timestamp": 1656064049622}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: \n\nשעורי הבית: בדיקה לא הוגנת, לא בודקים בכלל שהבנתם את מבני הנתונים, מחפשים למצוא באג לוגי קטנטן ולהפיל את כל הטסטים.\n\nהמבחן: נוראי. פשוט נוראי. שאלות שלא דומות בכלל לשום שאלה ממבחני עבר או משיעורי הבית, הוסיפו שאלה שלמה למבחן והכפילו את מספר הסעיפים בכל השאלות.\nשאלות לא פתירות בכלום זמן לפתור, שאלות מבלבלות שבאות להכשיל בכוונה, שעם הזמן המועט שיש לפתור אותן סיכוי טוב לטעות גם אם אתם יודעים את התשובה הנכונה ומבינים את החומר.\nפשוט סגל שבא לדפוק את הסטודנטים.\nביזיון שזו רמת הסגל בטכניון.\n\nהשורה התחתונה: סגל שבא להכשיל, יוצאים מהמבחן בתחושה שדפקו אתכם.", "timestamp": 1657555225659}, {"author": "Vecna", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "חרא סגל\n\nשעורי הבית: \nקשים מאוד, קשים יותר מסמסטר קודם. פונקציות שהיו בונוס סמסטר קודם היו אצלנו חובה.\nטעות קטנה יכולה לגרור לאפס, וכשאתה שולח מייל למתרגלים הם נותנים לך הרגשה שאין להם כוח לטפל בך.\n\nהמבחן: \nזוועה, השאלות היו ארוכות ומתישות. המבחן היה מבולגן והן שינו שאלה אחרי שהמבחן הודפס וחילקן דפים של השאלה המתוקנת.\nבכלל הרגיש לי שהסגל מרגיש שהוא מעלינו ושהוא מקטין אותנו שוב ושוב ושוב. הם לא נחמדים בשיט, הם לא מתחשבים, תרגילי בית קשים ומבחן יותר קשה אפילו.\n\nהשורה התחתונה: \nכנראה אצטרך לקחת שוב סמסטר הבא אז אעדכן, בתקווה שהאחראים ישתנו, ושיתנו לנו סגל עם אגו לא בשמיים.", "timestamp": 1657559037008}, {"author": "#היה_עדיף_ללמוד_חשמל", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ארז\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מתרגל מצויין, מאוד ברור ותמיד נותן דוגמאות עם אנימציות שממש עזרו לי להבין את החומר במהלך הסמסטר\n\nשעורי הבית: כל כך עמוסים שאם אתה שואף להצליח ולקבל ציונים טובים בשעורי בית זה חייב לבוא על חשבון הקורסים האחרים בסמסטר (הסתברות ז\"ל). בנוסף, הצוות בא ממש לרעת הסטודנטים בבדיקת התרגילים ומורידים על דברים חסרי משמעות. אציין גם כי הקורס הכפיל את העומס שלו בסמסטר האחרון ואני ממליצה בחום לדחות את הקורס כמה שאפשר ולחכות שיתחלף הצוות כי לי מבני גמר את הסמסטר.\n\nהמבחן: עשיתי עשרות מבחני עבר- תמיד יש שאלה מפלצתית ובלתי פתירה אבל המבחן הזה היה מפוצץ בשאלות מפלצתיות ובלתי פתירות- אני באמת הייתי על החומר כול הסמסטר, עשיתי את השיעורי בית והבנתי אותם, התכוננתי טוב לבחינה ולמרות זאת אני יודעת שאני בדרך לנכשל. המבחן היה כל כךךךך ארוך חבנוסף לעובדה שהיה קשה ברמה לא פרופורצינלית שזה היה מייאש.\n\nהשורה התחתונה: הקורס הכי מזעזע בתואר עד כה ואני ממליצה לכם לנסות בכול דרך לא לקחת את הקורס כרגע כי חבל על הציון אחרי שכול הסמסטר הזנחתם את שאר הקורסים בשביל להצליח במבני \"כי זה קורס חשוב\"", "timestamp": 1657622657024}, {"author": "למדתי הכל מMIT", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: מעביר סבבה את החומר, לרוב לא מבין את השאלות ששואלים אותו\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים:  עידו עובד קשה על המצגות שלו וזה עוזר להמחיש את השאלות אבל מרגיש שהוא טיפה מדקלם מסקריפט שהוא כתב לעצמו בצד לכל תרגול.\nאבל סך הכל הוא אחלה\n\nשעורי הבית: \nקורס של מבני נתונים אבל בפועל בודקים אותנו על תמיכה במספרים גדולים וחומר של מת\"מ\nסתם בזבוז זמן שפוגע בשאר הקורסים שלוקחים\n\nהמבחן: תראו את הממוצע ותחליטו לבד\n\nהשורה התחתונה: אמא אני לא אוהב את החוג הזה יותר", "timestamp": 1657644784209}, {"author": "אין לי כוח", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ארז \nחוות דעת - הרצאות: הרצאות בסדר סך הכל \nקצת משעמם אבל שורדים עד סוף הסמסטר \n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: מתרגל מעולה  \n\nשעורי הבית: מתישים ועמוסים מאוד \n\nהמבחן: נורא , בתור מישהו שפתר כמות טובה של מבחני עבר והיה על החומר לאורך הסמסטר, המבחן היה מאוד קשה, \nבנוסף הוא היה מנוסח בצורה נוראית , וארוך ברמות .\n\nהשורה התחתונה: צריך להתפלל שבוע לפני המבחן", "timestamp": 1657695018094}, {"author": "Donkey", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: הרצאות בסדר סך הכל\nקצת משעמם אבל שורדים עד סוף הסמסטר\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: מתרגל מעולה, הכללי קסם שלו ממש עזרו לי במהלך הסמסטר\n\nשעורי הבית: שיעורי בית קשים \n\nהמבחן: המבחן היה מנוסח לא טוב, תיקנו מלא על הלוח. והיה מאוד ארוך וקשה", "timestamp": 1657792782674}, {"author": "----", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nהרצאות משעממות.\n\nשם המתרגל/ת: תומר אדר\nחוות דעת - תרגולים: \nעונה מאוד לא יפה באימיילים, ותמיד מרגישים שאין לו סבלנות. בפיאצה ענה יפה. \nשעורי הבית: \nמאוד עמוסים, התרגילים הרטובים קשים, אבל שאלו עליהם גם במבחן ומי שהשקיע השתלם לו\nהמבחן: \nהמבחן היה מאוד קשה, היו שאלות בלתי פתירות, היה מבחן ארוך והמלל היה לא ברור בחלק השאלות.\n\nבכללי הסגל נתן תחושה לא טובה באימיילים, אבל בפיאצה כולם ענו טוב ומהר \n\nהשורה התחתונה:", "timestamp": 1657987824904}, {"author": "your mom", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "אמלק: חרא סגל, חרא יחס, חרא מבחן\n\nשעורי הבית: \nקשים מבדרך כלל, הסמסטר הם הקשו אותם משמעותית מסמסטר שעבר, והממוצע של תרגילי הבית היה זוועה.\nהמתרגלים לא היו נחמדים במייל, לא התחשבו באף אחד, לא אכפת להם מאף אחד, ולא באמת אכפת להם שתצליח. מרגיש שהן שם כי הכריחו אותם להיות שם\nהגל מתנשא על כל סטודנט, מדבר בזלזול לכל סטודנט שפונה אליהם כי יש לו בעיה, ולא אכפת להם לדפוק אותך על ימין ועל שמאל\n\nהמבחן: \nמזעזע, מבולגן, חסר סדר, שאלה לא פתירה, שאלה ששונתה אחרי שהמבחן הודפס והם הביאו לנו דפים אחרי זה.\nהייתה טעות גם באחת השאלות והם רק תיקו אותה אחרי 20 דקות מתחילת המבחן, ולא אכפת להם שבזבזנו זמן בלנסות לפתור אותה\nהמבחן היה קשה ברמות מסמסטרים קודמים, אבל זה לא הזיז להם, הם הוסיפו פקטור רק לסטודנטים ״נבחרים״ כנראה, ולא אכפת להם אם זה דופק את השאר.\nהעיקר הם כותבים תגובות בקונפשנס על זה שהם משקיעים יותר מידיי בקורס, אבל לא אכפת להם מאף טענה הגיונית שעלתה מסטודנט כלשהו\n\nהשורה התחתונה: \nאם זה לא חובה, תעשו לעצמכם טובה ותברחו, ואם זה כן חובה, תתפללו שהאחראיים בקורס הזה ישתנו. ממש מפחיד שהמתרגלים האלה יכולים להפוך למרצים בקרוב, מה שרק ידפוק סטודנטים עתידיים.\nלברוח לברוח לברוח.", "timestamp": 1658399887360}, {"author": "I Trie-d", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: מעביר את החומר בצורה ברורה, וההרצאות עצמן סבבה.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: עידו מעביר את התרגולים מעולה ומוסיף חלק \"אקסטרה\" לתרגול שמכיל או תרגילים נוספים או דגשים נוספים שחשובים לו להעביר והופך את התרגולים לאזור השעה וחצי ולא שעה אחת, וזה די עוזר. בכללי עידו משקיע ועושה מעל ומעבר בשביל לעזור לסטודנטים להבין ואני מעריך את זה מאוד.\n\nשעורי הבית: עמוסים וקשים בצורה לא פרופורציונאלית לנק\"ז. שני תרגילים רטובים שלוקחים בין שבוע לשבועיים (לחרוש על זה שבוע או רק כמה שעות ביום ובמשך שבועיים) שלא ברור לנו כסטודנטים מה הסגל מצפה מאיתנו (מבחינת מוסכמות בקוד או האם להתייחס למקרים מסויימים כמו בדיקה של \"מספרים גדולים\") ובגלל זה נופלים בטסטים. יש גם עוד 3 יבשים עם שאלות קשות ברמה כזאת שאין טעם לנסות לפתור לבד...\nאם אני משווה את הקורס הזה למת\"מ, אז מת\"מ בפירוש פחות עמוס ממבני.\n\nהמבחן: ישבתי וחזרתי על מבחנים והרגשתי שאני מוכן, אבל אז ראיתי את המועד א'. חלק מהשאלות היו סטנדרטיות, אבל החלק האחר הרגיש כאילו הוא נחת מהירח. חידות שלא יצא לי לראות עד המבחן הזה, שהביאו קונספט חדש לחלוטין. עבור השאלות הללו לפתור מבחני עבר לא עזר לי בכלום והייתי צריך לחשוב איך מתמודדים איתן על המקום, אבל עדיין מומלץ לעשות כמה שיותר כי בסופו של דבר גם הזמן במבחן הוא אתגר לא קטן. \n\nהשורה התחתונה:\nקורס עמוס בצורה לא פרופורציונלית עם מבחן מאתגר בטירוף, אבל בסופו של דבר החומר עצמו מעניין, ודי התחברתי אליו.\nהסגל הוא נוקשה ולא לגמרי ברור מה הם מחפשים בחלק הרטוב של התרגילים, אבל הם כן עונים בפיאצה מהר ובפירוט.", "timestamp": 1658401227727}, {"author": "I dislike it here", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "זה הולך להיות חופר מאוד אז אמלק - הסגל לא יודע מה הוא עושה ולא אכפת לו בשום צורה מהזמן של הסטודנטים.\n\nחזרתי הסמסטר על הקורס אחרי שעשיתי אותו בחורף 22 כך שלא ראיתי אף הרצאה ותרגול הסמסטר. מניסיון של סמסטר קודם אני יכול להגיד שעידו מתרגל מעולה, מאוד מומלץ. \n\nהלך לי מצוין הסמסטר ואני מאוד מרוצה מהציון שקיבלתי במועד א', אז אין לי איזה bias כתוצאה מכישלון וחשוב לי לומר את זה כי לדעתי הסגל מתנהל בצורה ביזיונית.\n\nשעורי הבית: \nזה ידוע כקורס עמוס אז אין לי הרבה מה לחדש בנושא. מה שכן הסמסטר התרגילים הרטובים היו אובייקטיבית קשים וארוכים יותר מסמסטר קודם כי מדובר בסך הכול בתרגילים שעשו להם העתק הדבק והוסיפו תכונות מסוימות לתחזוק \\ פונקציות שהיו בונוס נהיו חובה וגם התווספו יותר פונקציות. אי אפשר להעביר שיעורי בית מסמסטר קודם למרות שהדמיון כמעט מוחלט בין התרגילים, אז מדובר בבזבוז זמן מוחלט (הבעיות הקשות שדורשות חשיבה עמוקה בקורס מגיעות בתרגילים היבשים).\n\nהבעיה העיקרית היא שנראה שהסגל משקיע 0 מחשבה בתרגילי בית במובנים מסוימים וגם מראה 0 אכפתיות לזמן של הסטודנטים.\nזה התחיל בתרגיל ביבש הראשון, שנתנו שאלות הזויות ואז גם זרקו בפיאצה הערות הזויות (קרוב לתאריך ההגשה) כמו איסור על שימוש בכלים שרכשנו באינפי (כדי לפתור את התרגילים בצורה פורמלית אין ספק בכלל שהיה צריך להשתמש בכלים מאינפי).\n\nבתרגילים הרטובים החלק היבש לקח 15% מהציון לעומת 50% בסמסטר הקודם, מה שזה אומר בתכלס זה שיש סיכוי לא רע בכלל שמקרה קצה טיפשי סטייל מת\"מ ישפיע על הציון יותר מאשר הבנה תיאורטית טובה של הידע הנרכש בקורס. \n\nהסמסטר הם גם יצאו בדרישה מוזרה שנתמוך במקרה קצה של מספרים מאוד גדולים, זה פורסם בפיאצה ולדברם זה מקרה קצה שהיינו צריכים לחשוב עליו לבד (אולי בסמסטר הבא לא יטרחו אפילו לציין את הדרישה הזו). אולי הם היו צודקים אם היה מדובר בקורס מת\"מ, אבל זה כל כך טיפשי לחשוב על זה לבד בקורס מבני נתונים כי אין קשר מהותי בין נכונות האלגוריתם לשימוש בint לעומת long, וזה גם לא פאקינג קשה לכתוב טסטים שבודקים טווח מספרים סביר. יש שמועה שאולי קל יותר לבדוק timeout עם מספרים גדולים (וכך לבדוק את סיבוכיות הקוד) אבל אם זו כל המטרה, השימוש ב-64 ביט צריך להיכתב פשוט בהוראות התרגיל. הם גם התאמצו לתת תשובה מעורפלות בפיאצה בנושא כשכל מה שהם היו צריכים לכתוב זה \"תחליפו כל int ב-long ליתר ביטחון\" וזהו, במקום זה סטודנטים (שלא רצו לעשות פתרון טיפשי brute force להחליף הכול אם אין צורך) אכלו את הראש לגבי אילו משתנים צריכים להיכנס תחת ההגדרה.\n\nבסמסטר הקודם הממוצע של תרגיל בית 2 היה באזור ה-100\\5 כי מקרה קצה סטייל מת\"מ שלא הובהר כמו שצריך הפיל את כל הסמסטר והסגל אשכרה שם את המקרה הזה כמעט בכל אחד ואחד מהטסטים, והיה צריך להתווכח איתם עד שהסכימו שלא הגיוני שמקרה קצה אחד יפיל את כל הטסטים! זה כל כך אלמנטרי איך הגיוני שקורס שרץ כל כך הרבה זמן טועה בדבר כזה?\n\nהסמסטר קבצי ה-main והטסטים הנלווים פורסמו עם טעויות או שהיה חסר בהם קוד של הדפסה והם לא ידעו מה לעשות עם עצמם בנושא, בהתחלה הם רצו שהסטודנטים ישלימו את ההדפסה (בלי שהייתה הוראה בתרגיל לאיך ההדפסה צריכה להיראות) ואז הם שינו את הmain ככה שההדפסה לא תקרה שם אלא בקוד של הסטודנטים. התרגילים ובייחוד קבצי ה-main שלהם משתנים בצורה בעיקר טריוויאלית בין סמסטר לסמסטר, אז אני אישית לא מצליח להבין איך נוצר להם בלאגן כזה, התשובה היחידה היא שכנראה באמת לא היה אכפת להם בכלל.\n\nהמבחן: \nהמבחנים באופן כללי קשים. בהתייחסות למבחני עבר (לפני חורף 22) נראה שהשיטה למבחן הייתה 4 שאלות סבירות (לרוב בינוניות בקושי ולעיתים יש סעיפים יותר קלים\\קשים) ושאלה אחת שהיא בבירור ברמה גבוהה יותר. היה היגיון מסוים למבחן מבחינת התמקדות בנושאים, סגנון וכד'.\nבשני הסמסטרים האחרונים משום מה החליטו להיפרד מהתבנית לשלום. בסמסטר הקודם לא רק שהמבחנים היו מאוד שונים ממבחני עבר (גם של אותו מרצה) אלא גם היו מאוד שונים בין מועד א למועד ב, הסמסטר לקחו השראה מסמסטר קודם והוסיפו כל מיני קשקושים משלהם אז אי אפשר לדעת למה לצפות. בגדול לא מרגיש שהמבחנים לא הוגנים או קשים יותר בהכרח אבל כן מרגיש שמבחני עבר בחנו את הידע הנרכש בקורס בצורה טובה יותר.\n\nהשורה התחתונה: \nקורס מעניין וחשוב מאוד, הלוואי שישנו גישה בעתיד כי נראה שהוא רק הולך ומתדרדר...", "timestamp": 1658736646972}, {"author": "Min-Grade", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nההרצאות יחסית משעממות. \n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: \nברק לא הסכים להקליט תרגולים שלו במהלך הסמסטר. הוא רק מסכים להעביר בצורה פרונטלית. הלכתי לחלק מהתרגולים והיה מאוד שווה ללכת. הוא משתדל לשתף את כולם בתרגול ולעבור על כל החומר ולסיים בזמן. לחלק מהשיעורים יש לו כללים שעוזרים לזכור דברים למבחן. \n\nשעורי הבית: \nהשיעורי בית מאוד עמוסים בקורס. בתרגילים היבשים הייתה שאלה לא ממוחזרת מאוד קשה והשאר היה ממוחזר, תקווה שזה יישאר ככה ולא יהיה הכל לא ממוחזר.\nהתרגילים הרטובים מאוד כבדים, ארוכים. אצלנו מימשנו תרגיל בית שדומה לתרגול, ובמבחן גם שאלו על זה. אבל הסגל בודק מלא מקרי קצה ושווה ממש לוודא לא לאבד נקודות. \nהמבחן: \nהמבחן מאוד קשה. היו שאלות קלות, היו שאלות\nקשות ובלתי פתירות. הסגל מנסה לגוון את השאלות וזה ממש מקשה את המבחנים. פתרתי מלא מבחנים וזה לא ממש עזר לדעתי. \nהשורה התחתונה:\nקורס קשה, הסגל מאוד מקשיב אבל הקורס עמוס מאוד.", "timestamp": 1659011981815}, {"author": "Daniel Litvak", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nמרצה טוב\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: \nמתרגל טוב\n\nשעורי הבית: \nעמוסים וקשים\n\nהמבחן: \nאל תצפו לקבל 100 אין זמן לחשוב על השאלות קשות\n70% - פתיר\n30% - פחות פתיר\n\nהשורה התחתונה: \nקורס חובה, ארז מרצה טוב, וברק מתרגל טוב, התרגולים של עידו גם מעולים ומוסיפים אקסטרה", "timestamp": 1659174905270}, {"author": "Bh", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nהרצאות מעניינות ומעשירות,מוסיף המון ידע מהתעשיה ככה שאתם מבינים את הרלוונטיות\nשם המתרגל/ת: סאג׳י חשב\nחוות דעת - תרגולים: \nתרגולים מצוינים,מוסיף המון ידע נוסף ושאלות נוספות שבפועל עזרו המון למבחן.\nקשוב ביותר ובשעות הקבלה עושה את המעבר וישב איתי שעות עד שהצלחתי הכל\nשעורי הבית: \nעמוסים בטירוף,היבשים הם שיקוף מעולה לחומר הקורס,הרטובים מרגישים רוב הזמן התעסקות לא רלוונטית של כתיבת קוד,ערעורים על שיעורי בית לא הוגנים ולא משאירים מקום לטעויות\nהמבחן: \nקשה מאוד,הרבה הבנה שנדרשת תוך כדי המבחן,הציונים לא היו מדהימים והפקטור היה רק לציונים הגבוהים\nהשורה התחתונה: \nמאוד עמוס,לא לקחת במקביל לקורסים עמוסים אחרים", "timestamp": 1659356403936}, {"author": "catto", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: סבבב\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: המגדלור היחיד של תקווה בקורס ההזוי הזה. ערך את המצגות של התרגולים והשקיע בהן מאוד. הוא גם עושה אקסטרה של שאלות ממבחני עבר בסיום כל תרגול, שדי עוזרות להטמעה.\n\nשעורי הבית: הממוצע במטלה השנייה היה 50 כי הסגל רצה שנדפיס לפי הפורמט שלהם, אבל סירב לתת לנו את הפורמט שלהם. אז שיחקנו ניחושים והיה מאוד כיף סה\"כ.\nמבני נתונים זה חלק מאוד שולי מעבודות הבית הרטובות בקורס הזה שנקרא מבני נתונים. לקרוא את הדוקומנטציה של printf ישרת אתכם הרבה יותר.\n\nהמבחן: אז ככה:\n1) שאלה אחת של הוכח/הפרך שהם נתנו כהוכחה, אבל אופס, *מסתבר שזו הפרכה* שבוע אחרי שהציונים יצאו. לא נורא, כל התשובות מתקבלות\n2) באמצע המבחן היינו צריכים ליטרלי לשדך דפים נוספים למבחן כי הם..התחרטו על שאלה ורצו לשים שאלה אחרת או משהו\n3) בנוסף לכך עוד 3 טעויות שתיקנו על הלוח שעה לתוך המבחן (אבל זה כבר רגיל בפקולטה)\n4) כדי שהעקומה לא תראה חשודה הוחלט לתת פקטור רק למי שהוציא מעל ציון מסויים\n5) התווספה עוד שאלה למבחן הכבר מאוד עמוס הזה, שבכלל בסוף הייתה שאלה בהסתברות\n\nאני לא אהיה מופתע אם אחד הסטודנטים בקורס כתב את המבחן.\n\nהשורה התחתונה: זוועת עולם, בקלות הסגל הכי גרוע שנתקלתי בו. עידו אתה פשוש", "timestamp": 1659549551781}, {"author": "Hash", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ארז\nחוות דעת - הרצאות:\nהרצאות מעניינות ומעשירות.\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים:\nתרגולים מצוינים,מוסיף המון ידע נוסף וכללים שבפועל עזרו במבחן.\nמאוד קשוב בשיעור ורוצה שלכולם לא יהיו שאלות.\nשעורי הבית:\nעמוסים בטירוף - הרטובים מרגישים נורא, מאוד קשים ,ערעורים על שיעורי בית מאוד נוקשים ולא משאירים מקום לטעויות.\nהיבשים הם שיקוף מעולה לחומר הקורס.\nהמבחן:\nהיה פקטור רק לציונים גבוהייםםםםםםםם\nהשורה התחתונה:\nמאוד עמוס.", "timestamp": 1659618871915}, {"author": "omar shadafny", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי \nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: עידו \nחוות דעת - תרגולים:  מעולה\n\nשעורי הבית: רטוב ארוכים ולא רלוונטיות למבחן\nיבש יפים ומלמדים\n\nהמבחן: קצת קשה אבל משקף \n\nהשורה התחתונה: קורס טוב", "timestamp": 1675525906148}, {"author": "ג'ורג'י", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: \nהרצאות ממש מעניינות, חומר מאוד רלוונטי גם לחיים האמיתיים ובמיוחד לראיונות עבודה\n\nשם המתרגל/ת:  עידו גלילי מוקלט\nחוות דעת - תרגולים: \nהבן אדם תותח, מחזיק את כל הקורס על הרגליים\n\nשעורי הבית: \nארוכים אבל קלים נורא, לרוב הטסטים אינם באים לבחון מקרי קצה מיותרים , אם ניסית לעשות טסט-שניים ועברו לך כנראה תקבל 100 \n\nהמבחן: \nקליל. לא ברור למה נותנים 3 שעות שלמות ל5 שאלות קצרצרות. חלק מהסטודנטים התלוננו כי עודף הזמן מנע מהם ללמוד למבחנים אחרים באותו השבוע. \nלאור כך צפוי פקטור רציני מאוד.\n\nהשורה התחתונה: הקורס הכי איזי בתואר, תהנו ממנו כל עוד אפשר", "timestamp": 1675542045362}, {"author": "סוקה", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: \nמרצה נהדר! מלמד בגובה העיניים וממש סבלני, הוא הופך את החומר למאוד מעניין.\nההרצאות ממש מעניינות לדעתי, בנוסף לידע היבש והמשפטים, מסבירים איפה זה רלוונטי בעולם האמיתי. בונוס - יש kahoot בסוף כל הרצאה, שווה להישאר\n\nשם המתרגל/ת: עומר ירושלמי\nחוות דעת - תרגולים: \nמתרגל מעולה, ממש חיכיתי לתרגולים בסוף כל שבוע.\nמסביר מעולה ונחמד מאוד, אווירה ממש כיפית ולא יבשה בכיתה\n\nשעורי הבית: \nלא קלים, יש 3 יבשים ו2 רטובים. \nהרטובים מאוד ארוכים ותמיד יש בהם טריקים, ברטוב הראשון אצלנו היה ממוצע מאוד נמוך כי הרבה נפלו בטסטים. \nהיבשים יחסית סבבה, היה ביבש 2 איזה כמה סעיפים מאוד קשים שכולם ישבו עליהם המון - היבשים הם ממש סגנון השאלות במבחן (וחלק מהשאלות אפילו שאלות ממבחנים) לכן הייתי ממליץ לפתור הכל לבד ולא לרפרנס, וכמובן שכשאתם מחלקים את העבודה על היבש עם השותף, תפתרו אחכ בעצמכם (או לפחות תבינו את הפתרון) כי יש שם המון טריקים שחוזרים על עצמם גם במבחן.\n\nהמבחן: \nלא קל, דורש בנוסף להבנה טובה של החומר הרבה חשיבה ויצירתיות. עם זאת, יש הרבה טריקים שחוזרים על עצמם ועם הרבה תרגול אפשר להבין למה מכוונת כל שאלה. \nיש המון המון מבחנים לתרגל, אז אל תפחדו ״לשרוף״ מבחנים - כלומר לא לפרמל אותם, אלא לעבור שאלה שאלה ולחשוב רק רעיונית איך הייתם פותרים. זה עוזר לכם להכיר המון סוגים של שאלות וטריקים בזמן קצר.\n\nהשורה התחתונה: \nלדעתי קורס ממש חשוב, כנראה בין החשובים בתואר. החומר מאוד מעניין וכמובן בסיס לכל כך הרבה תחומים במדעי המחשב", "timestamp": 1675634844810}, {"author": "כריס", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר באופן ברור ואכפת לו מאוד שסטונדטים יבינו חומר לא קל. \n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: מניח שכבר הספקתם לקרוא עליו מספיק תוך כדי הסיור פה, פשוט מעולה, מומלץ מאוד לעקוב תמיד אחרי האקסטרה ולהבין אותה כי היא תמיד כוללת עקרונות מתוחכמים שחוזרים על עצמם במבחן.\n\nשעורי הבית: הרטובים - בעזרת תכנון נכון לפני שמתיישבים לכתוב את הקוד עוברים אותם בשלום. לתכנן במדויק, מילה במילה איך מממשים כל פעולה בסיבוכיות הנדרשת עד כדי רמה של לכתוב את הקוד בצמוד לתכנון. ככה לפחות אפשר להגיע יחסית מהר לשלב של הדיבוגים. היבשים - שווה להשקיע. שאלות בסגנון של מבחן שחוזרות על החומר כמו שצריך. \n\nהמבחן: לא קל בכלל. בעיקר בעיה של זמן. תכנון זמן נכון הוא הפקטור הכי חשוב.\n\nהשורה התחתונה: קורס מעניין, מבחן קשה.", "timestamp": 1676379062830}, {"author": "HASH", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי מוקלט\nחוות דעת - הרצאות: \nמרצה טוב בסך הכל, הסברים מובנים. לאחרונה התחילו לשים במבחנים שאלות תיאורתיות שקשורות לחומר של ההרצאות (כל מיני דברים שקשורים לחישובי הסתברות של מבני נתונים) אז שווה להקשיב לזה.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: \nמתרגל מצויין ומאוד חד על החומר, נראה שהוא באמת נהנה ללמד ולעזור לסטודנטים. התרגולים בקורס הם רק שעה אחת ועידו מוסיף לתרגול שלו עוד חצי שעה בערך שבה הוא פותר שאלות ממבחני עבר שקשורות לחומר של אותו שבוע. זה ממש עוזר כי התרגילים של המבחנים הם אוסף של חידות נוראיות וכדאי להתרגל לזה כמה שיותר מוקדם.\n\nשעורי הבית: \nרטוב 1 - זוועה, דרש המון עבודה והטסטים היו מאוד קטנוניים והפילו הרבה אנשים על שטויות.\nרטוב 2 - פחות זוועה אבל עדיין דיי נורא.\nיש גם 3 יבשים, הראשון דיי מציק, השניים האחרים מכילים שאלות ממבחנים אז שווה באמת לפתור אותם בעצמכם. \nטיפ לתרגילי בית הרטובים - תכינו טסטים בעצמכם ואל תסתמכו רק על דברים שאחרים מפרסמים.\n\nהמבחן: \nהמבחן זה אחד הדברים שהכי הורסים את הקורס הזה. כל מבחן מכיל אוסף של חידות קשות ובסמסטרים האחרונים נראה שהם כל הזמן משנים את המבנה שלו לרעה. הדבר הכי חשוב הוא לתרגל המון מבחני עבר כדי להתרגל לשאלות ברמה של מבחן ולהחשף לכמה שיותר רעיונות שונים. \nבסופו של דבר המבחן הזה הוא הימור רציני, כמעט בכל מועד יש לפחות סעיף אחד לא פתיר ושלל חידות מגוונות ושונות - המטרה שלכם היא לגרוף כמה שיותר נקודות מהשאלות שאתם כן מסוגלים לפתור ולקוות לפקטור הולם.\n\nהשורה התחתונה: \nהחומר מעניין ובאמת חשוב מאוד לעתיד, אבל הקורס עמוס בצורה לא סבירה ומרגיש לאורך הסמסטר כמו 5 נק\"ז. בנוסף המבחן שלו דיי מזעזע ודורש המון תרגול וגם אז השאלות לפעמים כל כך הזויות ולא פתירות שיש מצב שזה לא יספיק. זה באמת עצוב כי נהנתי מהחומר אבל המבחן הלא הוגן פשוט הרס לי את החוויה הסופית. מקווה שהמתרגל האחראי יתחלף כדי שהמבחנים יחזרו להיות יותר סבירים.", "timestamp": 1676500308362}, {"author": "bloom", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות:\nמרצה טוב, ותמיד שם גם קהאוט שזה ממש עוזר ומחזיר לשיעורים.\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים:\nמתרגל טוב מאוד, ניכר שמאוד איכפת לו שהסטודנטים יצליחו להבין את החומר בשיעורים, ותמיד מנסה לפקס על מה חשוב יותר ומה חשוב פחות. \nבמענה להודעות אימייל ברק תמיד עונה מהר ופותר את כל הסוגיות שמעלים, אם זה ציונים או ערעורים. \n\nשעורי הבית:\nיש בקורס 2 רטובים קשים אבל אם מתכננים נכון את הזמן, הם בסדר גמור. אצלנו הרטוב השני היה קל יותר מהרטוב הראשון.\nהיבשים מאוד דומים למבחנים. \nהמבחן:\nהדבר הכי חשוב הוא לתרגל המון מבחני עבר כדי להתרגל לשאלות ברמה של מבחן ולהחשף לכמה שיותר רעיונות שונים.\nכמעט בכל מועד יש לפחות סעיף אחד לא פתיר והמטרה היא לגרוף כמה שיותר נקודות.\n\nשורה תחתונה,\nהקורס מתנהל בצורה מאוד שוויונית בין הסטודנטים, כל שיעורי הבית כולל ערעורים חזרו לנו לפני המבחן. \nאנחנו שמענו שתפסו על חשד להעתקה בתרגילי הבית הרטובים אבל לא העלו לוועדות משמעת, אלא הביאו קנסות. זה קורס קשה אבל קורס חשוב.", "timestamp": 1676638201733}, {"author": "Union Find", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nתותח על, היחיד שנותן לך תקווה בקורס\n\nשעורי הבית: \nרטוב 1 נוראי\n\nהמבחן: \nקשה, תמיד יש איזה 2 סעיפים לא פתירים\n\nהשורה התחתונה: \nמה לעשות זה קורס חובה", "timestamp": 1676837068786}, {"author": "המילטון", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי אלנברג\nחוות דעת - הרצאות: \nהרצאות טובות, לא מאוד קשה לעקוב (וכשקשה לעקוב, לא כזה קריטי. נגיד ההוכחות המתמטיות לא קריטיות).\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: היה בסדר.\nראוי לציין שיש לעידו גליל הקלטות מדהימות, גם של תרגולים וגם של מלאאא פתרונות מלאים לתרגילים.\n\nשעורי הבית: \nהיו לנו 2 רטובים ושלושה יבשים. רטוב 1 היה מוגזם, הרבה לילות לבנים.\nהשאר היו \"יחסית סבירים\" - עדיין דרשו סדר גודל חצי שבוע-שבוע עבודה כל אחד, ואם יש לכם עוד קורסים בסמסטר זו בעיה. קורס של 3 נ\"ז שחושב שהוא 6.\n\nהמבחן: \nמכירים את זה שאתם קמים בבוקר כי מפלצת רדפה אחריכם בחלום, ואז היא מול הפנים שלכם כשאתם ערים? אז ככה מרגיש המבחן במבני, אימה אחרי אימה.\nהמתרגל הראשי לא הצליח לכתוב מבחן הוגן אז \"פיצו\" ב8-16 נקודות פקטור.. תאמינו לי שזה רע.\n\nהשורה התחתונה: \n\nקורס חובה, חומר מעניין וחשוב, עומס של 6 נ\"ז במהלך הסמסטר ומבחן מזוויע", "timestamp": 1676884140937}, {"author": "spec", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי אלנברג\nחוות דעת - הרצאות:\nהרצאות טובות.\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: היה סבבה, לרוב ברק מתחיל את התרגולים בשאלות של איך הקורס ומנסה להבין מה המצב של כולם בשביל לתת עצות או לעזור. הרבה מהעצות שלו מאוד מועילות. \nבתור מישהו שעשה מילואים הסמסטר, ברק היה מאוד קשוב ונכון לעזור בכל מה שזה הצטרך.\nלעידו יש הקלטות מדהימות. \n\nשעורי הבית:\nהיו לנו 2 רטובים ושלושה יבשים. רטוב 1 היה מוגזם, הרבה לילות לבנים אבל היה לנו גם בעיות בטסטים.\nשאר התרגילים היו יחסית סבירים. השקענו מלא בקורס בתרגילי בית.\n\nהמבחן:\nהמבחן היה קשה, היו לו שאלות קלות ושאלות קשות. 2 שאלות מאוד קשות. \n\nהשורה התחתונה:\n\nקורס חובה, חומר מעניין וחשוב, עומס של 6 נ\"ז במהלך הסמסטר ומבחן מזוויע", "timestamp": 1677077775248}, {"author": "avl", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות:\nרועי מסביר את החומר בצורה טובה. הוא אומנם קצת מונוטוני, אבל מסביר בצורה שמבינים וגם עונה על כל שאלות הסטודנטים כמו שצריך. בנוסף, בכל סוף הרצאה הוא עושה חידון קאהוט חביב שעוזר לך להבין כמה באמת מההרצאה ספגת. \n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: \nלא חושב שיש הרבה מה להוסיף על עידו מעבר למה שאחרים כבר אמרו, ממליץ!\n\nשעורי הבית: \nהיו 2 רטובים די כבדים, כמצופה מקורס עם רטובים. 3 יבשים שלוקחים קצת זמן, אבל מכינים היטב למבחן וחשובים. ממליץ מאוד כל הזמן לעשות טסטים תוך כדי כי לפעמים קשה מאוד לתקן באגים אם לא תופסים אותם מוקדם.\n\nהמבחן: \nרמת קושי די גבוה, וכן מצפים במובן מסוים קצת לחשוב מחוץ הקופסה לפעמים. יש שאלות קלות שחוזרות על עצמן, ויש שאלות חדשות ומסובכות. ההמלצה שלי היא באמת לפתור כמה שיותר מבחנים, ותכלס לא חייבים להתעמק בלכתוב פתרון, לפעמים מספיק להבין רק את הרעיון ולהמשיך, כי באמת יש סוגים של שאלות שחוזרות על עצמן. בנוסף, תמיד יש שאלת מחרוזות (ממה שראיתי), והיא בדרך כלל קשה, אז שווה להתאמץ יותר עליהן להכיר את הטריקים.\n\nהשורה התחתונה: \nקורס ממש חביב עם אחלה של סגל. בנוסף, יש הקלטות של הרצאות ותרגולים. המבחן קצת קשה, אבל אם משקיעים בשיעורי בית אפשר לצבור מגן יפה, וזה מאזן את המבחן", "timestamp": 1677088404577}, {"author": "רועי", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: מעולה\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: יבשים חשובים למבחן, רטובים לא.\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס טוב", "timestamp": 1677155540614}, {"author": "tina belcher", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: מרצה סה\"כ סבבה, מעביר את החומר בצורה טובה ומובנה,אבל אישית לא חושבת שההרצאות כל כך מועילות(אולי כן בנושא רשימות דילוגים שלא הועבר בתרגולים)אך ממליצה להסתפק בסיכום/מעבר על השקופיות אם אין לכם כח לשבת בהרצאה\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: אם עוברים על שאר חוות הדעת תוכלו לראות עד כמה הוא מתרגל טוב ואהוב וזה בצדק, הוא אחד אפילו המתרגל הכי טוב שפגשתי עד עכישו, לא רק שהוא בקיא בחומר גם היחס שלו כלפי הסטודנטים מראה אכפתיות והזדהות לפעמים שמתקשים בשאלה/נושא\n הוא היה נקודת האור היחידה  בקורס הזה ואני יכולה לכתוב חיבור של עמודים על כמה הוא אדם טוב :) (הלוואי ומתרגל מסוים ילמד ממנו ;)  )\n\nשעורי הבית: היבשים סבבה, צריכים הבנה של החומר ועוזרים להטמעתו,\nרטובים-במיוחד רטוב 1- מזעזע!!! גרוע יותר ממטלות המת\"ם לדעתי,וגם ללא טעם, לא מבניה למה צריך מטלות כאלה שמתמקדות בכתיבת קוד ובדיקת תקינות ודיבאגים בקורס שההתמקדות/המטרה שלו ללמד מבני נתונים !!\n\nהמבחן: קשה! יש 2 שאלות \"סבירות\" והשאר קשה קשה קשה, צריך לפתור מלנאת אלפי מבחנים, להיות על החומר ולקוות לפקטור מכובד\n\nהשורה התחתונה: קורס בעל פוטנציאל להיות אחד המעניינים ביותר בתואר,כולל חומר בסיסי וחשוב לעבודה בעתיד אך נוהל שיעורי הבית וגם צורת המבחן בשנים האחרות הפכו אותו לקורס מציק ,אבל חובה אז אין ברירה", "timestamp": 1677486051600}, {"author": "פקטור עומס", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: מאוד מעניינות, עונה על כל שאלה.\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: \nממליץ על עידו בוודאו. יש לו תרגולים מעולים מוקלטים. אני הלכתי גם לתרגולים של ברק כי זה הסתדר לי בשעות, והתרגולים היו מאוד טובים.\nהוא גם עונה מאוד מהר לאימיילים ועוזר בכל שאלה. ישב איתי אישית בזום והסביר לי שאלות ששאלתי.\n\nשעורי הבית: \nרטוב 1 היה מאוד נוראי. מאוד קשה. \nרטוב 2 היה סבבה לגמרי. \nיבשים מאוד חשובים למבחן. \nהמבחן: \nחייבים לתרגל מלא מבחנים בשביל לצלוח את המבחן. בכל מבחן מצפים לפתוח את הראש, תמיד יש 1-2 שאלות מאוד קשות והשאר סבירות.\n\nהשורה התחתונה: \nקורס עמוס, קורס קשה אבל קורס חשוב. \nהסגל באמת מנסה לבוא לטובת הסטודנטים.", "timestamp": 1677697173157}, {"author": "~", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מנוסה מאוד, חד מאוד על החומר, משלב הומור.. מומלץ מאוד.\n\nחלק קשות להבנה על ההתחלה בגלל עומס של פרטים ומקרים אז צריך לחזור על זה.\nבחלק מההרצאות יש הוכחות מתמטיות כבדות. לא להילחץ אם לא מבינים הכל על ההתחלה, זה לא הלב של הקורס (ולא של המבחן) אבל לאחרונה כן התחילו לשאול על דברים מתוך הוכחה, ככה שלמבחן כן צריך להכיר בגדול אבל בעיקר את החלקים שקשורים לחומר ופחות חלקים שהם נטו מעברים וטריקים מתמטיים.\n\nשם המתרגל/ת: ברק גחטן + מוקלט יונתן יניב\nחוות דעת - תרגולים: מצד אחד ברק עושה הרבה כדי להשקיע בסטודנטים (זמינות גבוהה במיילים ותמיכה בש\"ב) מצד שני אני הרגשתי שברק לא בקיא בחומר כמו שהייתי רוצה שמתרגל יהיה.\nיונתן יניב מתרגל מעולה, חזק מאוד בחומר ומשתדל לשלב אינטואיציה.\nלעידו גליל יש קובץ מושקע עם פתרונות תרגילים (לרוב) ממבחנים.. לדעתי כדאי רק אם יש לכם זמן להתעמק אחרי שבאמת הבנתם את החומר.\n\nשעורי הבית: שלושה יבשים ושני רטובים.\nהיבשים לא קלים, אך באורך סביר. הרטובים כידוע ארוכים ולא קלים (אצלנו במיוחד הראשון). חשוב הוא לתכנן את הכל לעומק לפני שמתחילים לכתוב, אבל גם לא יותר מידי כי יש דברים שקשה מאוד לחשוב עליהם בתכנון. ברק הציע להראות למתרגל את דרך התכנון הכללי לפני שמתחילים במימוש כדי שלא נצטרך אחר כך למחוק הכל - מומלץ.\nבניגוד למת\"מ, במבני אין במבחן כתיבת קוד אלא רק תיאור של המימוש במילים, ולכן מומלץ להשתמש בכל כלי שיעזור לכם לכתוב מהר כמו GITHUB COPILOT.\n\nהמבחן: הסגל מכוון לממוצע 75 בציון סופי. המבחן הוא 75% מהציון הסופי ולכן כדי להגיע לשם הממוצע של המבחן צריך להיות בערך 70 וככה גם היו נראות השאלות והבדיקה.\nהמבחנים לרוב בנויים מ 70 נק' שאפשר לקבל מלמידה מינימלית (אבל ברור שמהלחץ גם שם מאבדים נקודות) ובשביל ה - 30 הנוספות צריך לעבוד קשה.\nיש הרבה טריקים שחוזרים על עצמם בין מבחנים אז מומלץ לנסות לרכז כל מה ששומעים כבר מתחילת הסמסטר.\nבמבחן אצלנו היו תשובות לא אחידות בין מתרגלים גם על שאלות טכניות (איפה אפשר לכתוב כל תשובה) וגם על שאלות על החומר אז מומלץ להיזהר.\n\nהשורה התחתונה: מעניין ופותח את הראש. הסגל טוב אבל לפעמים יש נקודות מעצבנות.", "timestamp": 1677924354751}, {"author": "מועד ב׳ מגיע", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מנוסה מאוד, חד מאוד על החומר\nבחלק מההרצאות יש הוכחות מתמטיות כבדות, אבל זה לא מהות הקורס. פה ושם שואלים על זה במבחנים.\n\nשם המתרגל/ת: ברק גחטן + מוקלט עידו גליל\nחוות דעת - תרגולים: ברק עושה הרבה כדי להשקיע בסטודנטים זמינות גבוהה ותמיכה בש\"ב כולל עזרה בתכנון תרגילי הבית.\nעידו מתרגל מעולה, חזק ממש בחומר ומשלב אינטואיציה.\nיש גם קובץ עם מלא דברים מוקלטים שלו שיש באתר הקורס.\n\nשעורי הבית: \nהיבשים לא קלים, אך באורך סביר. חשוב לתכנן את הכל לעומק לפני שמתחילים לכתוב, אבל גם לא יותר מידי כי יש דברים שקשה מאוד לחשוב עליהם בתכנון. ברק הציע להראות למתרגל את דרך התכנון הכללי לפני שמתחילים במימוש כדי שלא נצטרך אחר כך למחוק הכל - מומלץ ממש, תיעזרו בסגל, הסגל באמת עוזר. \n\nהמבחן: \nהמבחנים לרוב בנויים מ 60-70 נק' שאפשר לקבל מקצת למידה  ובשביל ה - 30 הנותרים צריך לעבוד קשה ולהבין טוב את החומר. \nשווה לרכז את הכלים מתחילת הסמסטר לסוגים שונים של מבנים. \n\nהשורה התחתונה: הסגל טוב אבל לפעמים יש דברים מעצבנים, אין מה לעשות זה קורס חובה", "timestamp": 1677942612917}, {"author": "א.ב.", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות:\nההרצאות מושלמות! רועי מסביר הכי טוב שיש, ושם דגש על הנקודות החשובות. בסוף כל הרצאה יש kahoot שמראה לנו שלא הבנו כלום...\nהחומר של הקורס מעניין ואפילו מגניב, וגם לא מאוד קשה.\n\nשם המתרגל/ת: עומר ירושלמי.\nחוות דעת - תרגולים: עומר תותח! משתדל ממש שנבין הכל. לא עובד בצורה הכי פורמאלית, אלא יותר עם שכל ישר, שנבין מה אנחנו עושים.\n\nשעורי הבית:\nהתרגילים הרטובים עמוסים בכל קנה מידה. היו בערך שלושה שבועות שזה הדבר העיקרי שהמחזור שלנו עשה... וגם בבדיקה החזירו ציונים מזעזעים, על סמך טסטים נוראיים.\nהתרגילים היבשים יחסית קשים, אבל בהתחשב בזה שיש רק שלושה זה לא מאוד עמוס יחסית לקורסים אחרים.\n\nהמבחן: \nמאוד קשה. בגלל שהחומר לא כ\"כ קשה, השאלות במבחן מפצות על זה... לא מספיק לדעת טוב את החומר, אלא צריך גם להבין את התיאוריה, ובעיקר לדעת להשתמש במבני הנתונים שלמדנו. והאמת שגם צריך להיות מבריק באופן כללי כדי לפתור מבחן שלם.\n\nהשורה התחתונה:\nבלי העומס המטורף של התרגילים הרטובים ושל המבחן הייתי אומר שזה קורס די נחמד.", "timestamp": 1678034997663}, {"author": "סלים", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי \nחוות דעת - הרצאות: \nאורי מרצה בינוני+, יודע מעולה את החומר ומעביר בצורה סבירה לגמרי\nשם המתרגל/ת: ברק/עידו גליל מוקלט\nחוות דעת - תרגולים: \nהלכתי לברק פרונטלי, ברק אחלה מתרגל יודע את החומר ממש טוב ומעבר לזה הוא גבר שבגברים! תמיד עוזר עם חיוך, מדבר בגובה העיניים ובכללי אחד המתרגלים היותר אנושיים שפגשתי.\nהמוקלטים של עידו- עידו בעיניי הוא סוג של עילוי ברמת החומר. אין מילה מיותרת בתרגולים שלו הכל סופר ברור ומובן\nשעורי הבית: \nרטוב 1- הדבר הכי נורא שקרה לכם בחיים. לא צוחק שישבתי במצטבר איזה שבועיים ובסוף קיבלתי 30. זה קורס של 3 נק\"ז ומרגיש כמו 10. פשוט נורא ואיום ולא כזה קשור לקורס \nרטוב 2- גם נוראי אבל לא כמו 1 \nיבשים- קשים אבל חשובים רצח! מכינים מאד למבחן. לתת להם כבוד \n\n\nהמבחן: \nהמבחן קשה מאד. אבל מצד שני זו הרמה וזה מה שמצופה מסטודנט בטכניון. פשוט לטחון מבחנים עד שיוצא דם מהעיניים ולקוות לטוב \n\nהשורה התחתונה: סה\"כ סגל הקורס הוא טוב. חבורה של אחים יקרים. רק בבקשה תורידו עומס ברטובים!! מעבר לכך זה הקורס הכי מעניין שעשיתי בטכניון עד בה.", "timestamp": 1678092784816}, {"author": "תור ישראלי", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: מדהים. בקיא מאוד בחומר, חמוד בטירוף ומעניין. מחזק את כל מה שאנאמר לפניי.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: הנסיך הבלתי מעורער של מבני נתונים. מאוד עמוס בחצי הראשון של הסמסטר אז יש גם הקלטות למי שלא אוהב צפיפות. לי היה חשוב לבוא ולהשתתף כשאפשר וכמובן להשאר לאקסטרה. אקסטרה אוהב אותו.\n\nשעורי הבית: ארוכים מאוד ושלא לצורך לדעתי. תפנו 50% מהזמן הפנוי שלכם כי אתם הולכים לשבת המון זמן עליהם ותכינו את האצבעות שלכם (כי תצביעו המון). אני אישית חושב שהחלק החשוב הוא סיעור המוחות והחלטת על מבני הנתונים שתשתמשו בהם לפיתרון ופחות כתיבת הקוד, כי בסוף במבחן אתם כותבים עברית ולא CPP. התרגילים היבשים הרבה יותר מכינים למבחן לדעתי (והם באורך יחסית סביר חוץ מתרגיל בית 2 שהיה אצלנו ארוך בקטע קיצוני).\n\nהמבחן: כמעט בכל מבחן יש 20-25 נקודות קשות בקטע הזוי וכל השאר הוגן ואפילו קל. יש תבניות שמופיעות כמעט כל מבחן וכדאי לתרגל אותן על ידי פתירת מבחנים. אצלנו היה חומר פתוח אז לא צריך היה לזכור יותר מידי.\n\nהשורה התחתונה: הקורס מעניין מאוד ופותח את הראש לנושאים בסיסיים ומושגים חשובים. החומר עצמו לא מורכב אבל היישום שלו כן, לכן חשוב לתרגל הרבה.\nכמו כן השלוש נקז הכי עמוסות שתיקחו.", "timestamp": 1678530657080}, {"author": "BaronCabbage", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מעולה, בקיא בחומר ומעביר אותו בצורה טובה אינטואיטיבית ומסודרת\nקיימות גם הקלטות של אורי מסמסטרי קורונה והן גם מצויינות להשלמות\n\nשם המתרגל/ת:  עומר ירושלמי\nחוות דעת - תרגולים: אחד לאחד אותה החוות דעת כמו על רועי\nכמו כן גם פה קיימות הקלטות של עידו גליל שמצויינות לא פחות וטובות להשלמות ולצפייה לפני המטלות בשביל לחסוך זמן.\nאצל עידו יש גם אקסטרה ששם הוא פותר תרגילים ממבחנים ונותן גם טיפים - כדאי לעבור על זה לפחות פעם אחת\n\nשעורי הבית: אני אהייה הכבשה השחורה ואגיד שהשיעורי בית לא עמוסים כמו שכולם מתארים אותם. כן הם ארוכים אבל סה״כ הם בסדר.\n3 מטלות יבשות ששם בעצם יש שאלות כמו במבחן לוקח כמה שעות כל אחד מהם וממש חשוב להפנמת החומר.\nיש 2 תרגילים רטובים:\nהראשון והגדול מבין השניין זה בדרך כלל לממש עץ חיפוש מאוזן ולהשתמש בו במבנה נתונים הדרוש, את האלגוריתמים של העץ יש בהרצאות ורוב שאר המבנה הוא בסגנון מת''מ עם בערך 2 פונקציות שבאמת דורשות חשיבה מעבר כדי לעמוד בסיבוכיות.\nהשניה היא בדרך כלל מימוש של טבלת ערבול ו-UF וגם שימוש בעץ מהמטלה הראשונה המטלה משמועתית יותר פשוטה ובסוף כמו הראשונה מתחברת למבנה נתונים שרובו זה תכנות בסגנון מת''מ.\nחשוב מאוד לעשות טסטים מקיפים כמה שיותר למטלות שלכם כי קל ליפול על מקרי קצה והטסטים של הסגל גדולים בצורה לא סבירה ויכולים לתפוס על קטנות.\n\nהמבחן: פשוט נורא. מאז שברק מתרגל אחראי המבחנים קפצו בכמה רמות, יש יותר ויותר שאלות הבנה מאוד ספציפיות ופחות שאלות קלאסיות כמו ביבשים. עדיין חשוב להבין את כל החומר כי על כל דבר יכולה להיות שאלה ( כן כן גם על רשימות דילוגים וbloom filter) וכמעט תמיד יזרקו עליכם שאלה לא פתירה כי היא לא הכי קשורה לחומר ודורשת טריק מאוד ספציפי שלא היה בעבר.\nמה שכן הבדיקה לא אחידה ולפעמים יש בכלל סעיפים או שאלות שנראה כאילו לא בדקו וסתם זרקו ציון או קראו רק את הרעיון הכללי ולא מעבר.\nחשוב מאוד שגם אם לא יודעים לפתור את השאלה כמו שצריך עדיין לכתוב משהו בין אם להתעלם מאחת הדרישות או חירטוט שנשמע טוב - אולי תפגעו בכיוון ותקבלו נקודות חינם או לפחות תגרדו כמה.\n\nהשורה התחתונה: קורס ממש מעניין וחשוב לדעתי, עמוס בשביל 3 נק''ז אבל לא סוף העולם. חשוב להשקיע בו כי הוא גם רלוונטי למשרות עבודה ולכן המבחנים בהתאם.\nהסגל עצמו מאוד טוב מכל הבחינות (למעט המבחן עצמו, אירוני) ותמיד שמח לעזור ולענות על שאלות.\nתקוו למבחן הוגן וכל השאר יהיה טוב", "timestamp": 1678659533138}, {"author": "רדיקס", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מעולה, בקיא בחומר ומעביר אותו בצורה טובה אינטואיטיבית ומסודרת\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: מעולה, בקיא בחומר ומעביר בצורה של לנסות להעביר גם את האינטואיציה וההבנה. \nקיימות הקלטות של עידו שמעולות לא פחות וטובות להשלמות ולצפייה לפני המטלות בשביל לחסוך זמן.\n\nשעורי הבית:\nשיעורי בית ארוכים אבל סה״כ הם בסדר.\n3 מטלות יבשות-  שאלות כמו במבחן, לוקח כמה שעות כל אחד מהם, חשוב ממש למבחנים. \n\nיש 2 תרגילים רטובים: הראשון זה בדרך כלל לממש עץ חיפוש מאוזן ולהשתמש בו במבנה נתונים הדרוש. \n.\nהשני היא בדרך כלל מימוש של טבלת ערבול ו-UF וגם שימוש בעץ\n\nחשוב מאוד לעשות טסטים מקיפים כמה שיותר כי קל ליפול על מקרי קצה. הטסטים של הסגל גדולים ויכולים לתפוס על קטנות.\n\nהמבחן: ממש ממש קשה. \nמאז שברק מתרגל אחראי המבחנים , יש יותר ויותר שאלות הבנה עמוקות על החומר. חשוב לדעתי להבין את כל החומר כי על כל דבר יכולה להיות שאלה. \n\nהבדיקה לא אחידה ולפעמים יש שאלות שנראה כאילו לא בדקו וסתם זרקו ציון. חשוב מאוד לנסות לכתוב לא משנה מה בשביל לנסות לגרד נקודות. \n\nהשורה התחתונה: קורס ממש מעניין וחשוב לדעתי, עמוס בשביל 3 נק''ז אבל לא מוות. חשוב להשקיע בו כי הוא גם רלוונטי למשרות עבודה ולכן המבחנים בהתאם.\nהסגל עצמו מאוד טוב מכל הבחינות, עונה מאוד מהר לבעיות, הרבה שעות קבלה, כולל אישיות בזום ותמיד שמח לעזור ולענות על שאלות.", "timestamp": 1678683212807}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: רועי תותח. הוא שולט בחומר ברמות ונוהג לספר סיפורים ואנלוגיות לטובת אינטואיציה. הוא גם משלב כל מיני דברים אינטראקטיביים והמחשות, סה\"כ אפשר לומר שהוא מוציא את המקסימום מחוויית ההרצאה שהיא כשלעצמה לא הכי מעניינת.\nלמי שתוהה אם אפשר לוותר על ההרצאות, הדעה שלי בעניין היא חד משמעית לא. ההרצאות זה כל הרקע התאורטי שחשוב לא פחות מהיישום בתרגילים והטכניקה.\n\nשם המתרגל/ת: עידו (מוקלטות)\nחוות דעת - תרגולים: מתרגל מעולה. ממש עושה סדר בחומר, נותן עצות והאקסטרות שלו סופר חשובות למבחן ולתרגילי הבית אז כדאי לא לוותר עליהן.\n\nשעורי הבית: עמוסים. 2 רטובים שגורמים למתמ להיראות שטויות לידם ועוד 3 יבשים שהם לרוב שאלות ממבחני עבר אז כדאי לעשות ברצינות כדי להתחיל להתכונן ולהתרגל לסגנון.\n\nהמבחן: רוב ההשאלות די קלות אבל אז מכניסים איזה שתיים לא פתירות ושוחטים בבדיקה של הקלות וככה מנרמלים את הממוצע של הקורס לאיזור 70.\n\nהשורה התחתונה: החכמים שביניכם שקוראים את החוו\"ד הזו ועומדים לקחת את הקורס, יעשו עכשיו screenshot למה שאני עומדת לכתוב ויחזרו לקרוא את זה כמה שבועות לתוך הסמסטר:\n0. תתחילו ללמוד לדבג כבר מעכשיו, אל תחכו כי אף אחד לא ילמד אתכם באף שלב של התואר.\n1. תעשו טובה אל תממשו עץ 2-3 בתרגילי הבית.\n2. אל תשתמשו במצביעים חכמים, גם כשממש נדמה לכם שזה מתבקש.\n3. אל תממשו swap של nodes ע\"י החלפה של הdata, זה יגרום לבאגים ובעיות זיכרון מהסיוטים.\n4. במבחן - תכתבו כמה שיותר. תופתעו לגלות איך שגם פתרון מחורטט יכול לקבל את רוב הנקודות, לא להשאיר שום שאלה ריקה גם אם נראה לכם שאתם לא בכיוון.", "timestamp": 1678779392663}, {"author": "הייטקס", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: ההרצאות נחמדות, יש הקלטות רלוונטיות. השקופיות שימושיות לבחינה. \n\nשם המתרגל/ת: עידו גליל מוקלט\nחוות דעת - תרגולים: עידו מצויין. התרגולים עוברים זריז על החומר ואז יש פתירת שאלות פלוס 10 דקות אקסטרה עם תרגילים ממבחנים. השקופיות מאוד רלוונטיות למבחן. \n\nשעורי הבית: השואה זה צ'יפס. עמוסים בטירוף. \nלא לדחות את הרטובים. להתחיל בתכנון של המבנה על דף, כולל מעבר על כל הפונקציות ורק לאחר שעשיתם תכנון מקיף וכולל, להתחיל לכתוב קוד. זה לוקח ים זמן, בעיקר בגלל דיבוג ומעבר על מקרי קצה.\nתתכוננו למעבר על לפחות עשרת אלפים שורות קוד במקרי הקצה. \n\nהמבחן: 2.5 - 3 שאלות יחסית פשוטות, והשאר כמעט תמיד בלתי פתירות. נרמול קלאסי לממוצע 63.\nלכתוב הרבה הרבה ובכתב יד הכי לא ברור שיש. זה עוזר. \n\nהשורה התחתונה: 80 וממשיכים.", "timestamp": 1678981435621}, {"author": "מה הטעם?", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \nההקלטות סבבה\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: \nכל מה שנאמר עליו נכון, מתרגל מדהים\nשעורי הבית: \nארוכים.\nממליץ בחום לבדוק כל פונקציה ופונקציית עזר מיד אחרי שרושמים אותה (בדיקה מעמיקה, לא משהו בקטנה) כדי גם לחסוך זמן בדיבאגינג וגם לוודא שהפונקציונליות תקינה. להסתמך על טסטים של סטודנטים זה נחמד, אבל ספציפית הסמסטר זה לא הספיק בחלק מההגשות, וטעות של 2-3 שורות קוד גררו ירידה משמעותית בציון\nהמבחן: \nחוץ משאלה לא הגיונית ומבדיקה מעניינת ביותר המבחן היה סבבה, מי שידע את החומר הצליח (כמובן חוץ מהשאלה המדוברת ומהבדיקה המאוד מעניינת)\nהשורה התחתונה: \nהחומר מעניין וחשוב מאוד, המבחן והבדיקה שלו מבאסים", "timestamp": 1679378124894}, {"author": "~~", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: מרצה מצויין ואדם לבבי, שווה להגיע להרצאה פרונטלית אבל הוא גם מפרסם הקלטות שהן לא רעות בכלל\n\nשם המתרגל/ת: עידו מוקלט\nחוות דעת - תרגולים: שמו הולך לפניו, ההקלטות הכי טובות שאפשר לבקש בקורס הזה (ובטכניון בכלל)\n\nשעורי הבית: 2 רטובים ב CPP ארוכים להחריד שכל אחד מהם כולל בתוכו גם יבש. בגדול נהנתי מהם והם אימון מעולה בתכנות אבל היו לי יותר עמוסים ממת\"ם\nבנוסף עוד כמה יבשים, שממש תורמים להבנה של החומר.\n\nהמבחן: עוד לא היה אבל לפי מבחני עבר מדובר בחידות שנבדקות לא באחידות אז בהצלחה.\n\nהשורה התחתונה: אחלה קורס, וחשוב למציאת עבודה", "timestamp": 1689246323014}, {"author": "בנאי נתונים", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: \n\nמרצה בסדר גמור. בעיני ההקלטות של ארז קצת יותר טובות, אבל השתמשתי בהן רק כשלא יכולתי להגיע לרמי. אני לא מרגיש פספוס משמעותי כי לא יכולתי ללכת לארז.\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: \n\nמתרגל נהדר. הטוב ביותר שיש עבור הקורס הזה בעיני, בפער, אפילו טוב יותר מעידו גליל. עונה על שאלות, מבין את החומר ברמה מאוד מאוד מאוד גבוהה, חכם בצורה בלתי רגילה (תרגיל הבית שהוא היה אחראי עליו היה קשה בהתאם :)), ובאופן כללי בחור חביב מאוד. \n\nשעורי הבית: \n\nיבשים 1,3 לא קשים כל כך, 2 של ברק כן היה בגלל שאלות עץ דרגות מאוד מורכבת. התרגילים היבשים מכינים טוב מאוד למבחן. התרגילים הרטובים פחות רלוונטיים למבחן אבל כן עוזרים להבין את החומר ואת החשיבות המעשית שלו, והם כיף גדול למי שאוהב לתכנת.\n\nהמבחן: \n\nהמבחן קשה, ודורש הבנה עמוקה של החומר ויכולת ליישם אותו במקומות שלא בדיוק קל לראות את הקשר שלו אליהם, אבל המבחנים בסופו של דבר הוגנים ובסופו של דבר נחמדים.\n\nהשורה התחתונה: \n\nקורס מאוד מעניין, ובוודאי מאוד חשוב, שכל מי שאוהב את התחום של מדעי המחשב אפילו טיפה יהנה ללמוד. קשה, אבל טוב.", "timestamp": 1689408245747}, {"author": "ע", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ארז פנטרנק \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: מתרגל מעולה, הוא נותן טיפים לגבי גישה לשאלות ששווה לרשום אותם.\n\nשעורי הבית: היבשים מאוד נחמדים וגם די מכינים למבחן.\nהרטובים הם סיוט, לגבי רטוב ראשון מאוד חשוב לתכנן איך המערכת הולכת לעבוד ובאיזה פונקציות אתם הולכים להשתמש.\nגם מומלץ להתחיל במימוש עץ חיפוש רגיל ורק אז avl, זה עוזר לדעת שהבעיות הן לא בעץ.\nיש עוד דברים שצריך להחליט אם אתם עושים עץ של מצביעים או אובייקטים והאם אתם רוצים להשתמש במצביעים חכמים.\n\nהמבחן: יש הרבה טריקים בעיקר במחרוזות שצריך לעבור בשבילם על הרבה מבחנים, אני ממליץ על מבחן שכותבים בו את התשובות באופן מלא לעשות שניים בזמן של שעה לאחד בו רק מתארים את הפתרון באופן כללי בלי כתיבה מפורטת\n\nהשורה התחתונה: קורס חשיבתי נחמד, רק חבל שמוסיפים אליו מרכיב תכנותי כבד", "timestamp": 1689415799963}, {"author": "Z", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: לא ראיתי הרצאות\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: \nתותח על ,הכי טוב מבין כולם בעיני (בפער גדול) , שולט בחומר ברמה גבוהה , מעביר אינטואיציה והבנה, נותן טיפים חשובים מאוד לבחינה , כל מה שנאמר עליו או נכתב פה בצורה שלילית לא אמיתי , היחידי שאכפת לו מהסטודנטים ומקדיש הזמן שלו בשבילם , היחידי המבין איך הקורס אמור להיות מועבר בשביל שיהיה פיר לכולם, אנשים נפלו עליו בגלל שלא ידעו מי להאשים ,הכי אכפיתי וחביב, מוכן לעזור למשך שעות לכל סטודנט בקורס בכל עניין . הדבר היחידי הטוב בקורס הזה הוא ברק.(תפללו שיהיה מתרגל אחראי בסמסטר שאתם לוקחים הקורס).\n\nשעורי הבית: \nעמוסים , אבל חביבים.\n\nהמבחן: \nהסגל (או יותר נכון מי שכותב הבחינה) כל פעם ממציאים את עצמם מחדש , לא כל כך אכפת להם מהסטודנטים , מבחנים לא מסונכרנים עם עליות וירידות כל סמסטר .\n\nהשורה התחתונה: \nכל עוד ברק מתרגל אחראי אתם בסדר , אחרת זה חובה אין מה לעשות.", "timestamp": 1689431152624}, {"author": "יובל", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ארז \nלא הלכתי להרצאות. \n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים:\nאני חוזר על קורס, ועכשיו כשראיתי איך הקורס מתנהל שלא ברק אחראי, ממש מעריך אותו על ניהול הקורס. \nניגשנו למבחן הסמסטר בלי ציונים לתרגילי הבית ובלי בדיקה על רוב תרגילי הבית. תקופות ערעורים לא היו מסודרים, ולחלקם עוד לא היה לנו בכלל, הקורס ממש בבאלגן בניגוד לסמסטר כשברק היה אחראי. \n\nתרגולים הייתי חלק אצל ברק וחלק ראיתי את עידו בהקלטות. שניהם מעבירים את החומר ממש טוב ותלכו למי שמתאים לכם. ברק נותן קצת טיפים ואינטואיציה איך לגשת לשאלות שממש עוזרים כשפותרים מבחנים. כל עזרה שתבקשו מברק הוא יעזור לכם, גם אם זה יהיה בזום בלי קשר לשעות קבלה שלו. \n\nשעורי הבית:\nעמוסים, תשקיעו יבשים - הם חשובים למבחן. \n\nהמבחן:\nקשה. צריך לדעת את החומר טוב. \n\nהשורה התחתונה:\nתקוו שברק יהיה אחראי ושיהיה לו כוח לחזור להיות אחראי, אחרת יהיה לכם קורס בבאלגן, ומה לעשות זה חובה", "timestamp": 1689536594114}, {"author": "מעריץ של הסופר", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nמרצה תותח ובן אדם מדהים\nגם מקצועי וברור וגם כיף ונעים אצלו בשיעור \nאל תחמיצו\n\nשם המתרגל/ת: עידו גלילי\nחוות דעת - תרגולים: \nמעולים\nממליץ להשתדל ללכת לתרגולים של עידו\nמרגישים שהוא כבר מנוסה ולכן שם דגשים ונותן אינטואיציה במקומות מסוימים מעבר לתרגול הבסיסי\n\nבנוסף האקסטרה בסוף עוזרת לדעתי וזה עניין של עוד 20-30 דקות לכל היותר\n\nשעורי הבית: \nדורשים זמן, מעולים להפנמה של החומר\nהרטובים כמובן דורשים זמן מכובד\nביבשים כמעט תמיד יש שאלה אחת חדשה עם רעיון חדש שהיא קשה באופן ניכר מהאחרות, והיא כנראה שואבת זמן\nשאר השאלות ביבשים לא דורשות יותר מדי עבודה\n\nהמבחן: \nהפעם היה הוגן, קצת לחוץ בזמן \nאצלנו הייתה שאלה שהסתמכה על משהו שהיה בתרגול 4, והופכת את השאילה לפתירה במהירות ובקלות לכן כדאי לשקול לעבור על התרגולים בסמוך למבחן\n\nהשורה התחתונה: \nקורס מעניין ויותר חשוב מכך לדעתי - סגל מעולה \nאם תפלו על מבחנים קשוחים כמו בסמסטרים קודמים אז כמובן שמבאס, אבל חוץ מזה תהנו", "timestamp": 1689680238483}, {"author": "ל", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רמי\nחוות דעת - הרצאות:\nאחלה של מרצה, הרבה ניסיון\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים:\nמעולים, מלא ניסיון, נותן גישה איך היה ניגש לשאלות שזה ממש עוזר. נותן דוגמאות אקסטרא מעבר למה שיש בשקפים, ואחלה גבר תמיד עוזר כשמבקשים. \n\nשעורי הבית:\nיבשים קשים וחשובים למבחן\nרטובים שואבים זמן וכבדים. תבדקו כל שורה בקוד. \n\nברדק בערעורים ובהחזרת שיעורי בית. נתנו לנו לערער על הרטובים רק 4 ימים באמצע תקופת מבחנים. \nלא החזירו ציונים בזמן וזה ממש פוגע, גם יבשים וגם רטובים. \nהמבחן:\nלתרגל הרבה מבחנים, הלחץ של הזמן במבחן ממש קריטי\n\nהשורה התחתונה:\nסגל ממש טוב, כל אחד מהמתרגלים ממש נחמד ורוצה לעזור.", "timestamp": 1689735759031}, {"author": "בנאי נתונים", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז פטרנק (צפיתי בהקלטות שהועלו במהלך הסמסטר)\nחוות דעת - הרצאות: מרצה מדהים, מסביר מצוין, היה לי מעניין ונהניתי להקשיב לו.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: מתרגל מעולה, מסביר בפירוט ונותן טיפים שימושיים. ממליץ מאוד להשאר ל\"אקסטרה\" בסוף כל תרגול (20-30 דקות מהשעה שאחרי שעת התרגול הפורמלי).\n\nשעורי הבית: הרטובים דורשים המון זמן עבודה, לתכנן הכל מראש ולהקצות מספיק זמן לעבודה. היבשים גם לא קלים, אבל חשובים - יש שם שאלות שדומות (ולעתים ממש לקוחות) ממבחנים.\n\n\nהמבחן: \nקשה ויש לחץ של זמן אבל עם מספיק זמן התכוננות מראש (לפחות 5 ימים) הוגן למדי.\n\nהשורה התחתונה: \nקורס מעניין מאוד, ועמוס מאוד.", "timestamp": 1689766258903}, {"author": "E", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עידו (הקלטות)\nחוות דעת - תרגולים: מדהים אחד המתרגלים האהובים אליי\n\nשעורי הבית:השיעורי בית ממש עמוסים וארוכים (למראות שיש רק 2 רטובים). החומר עצמו מעניין ולא קשה מדי\n\nהמבחן:  באמת שהיה מבחן שכולם הרגישו שהיה מוגזם הסמסטר. אבל לא צריך הרבה memorizing בעיקרון זה שאלות מחשבה.\n\nהשורה התחתונה: קורס רלוונטי אבל עמוס ל3 נק\"ז והמבחן שומר על ההיסטוגרמה שרואים\n(sorry for hebrew mistakes lol)", "timestamp": 1689779765834}, {"author": "קריס", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המתרגל/ת: ברק\nחוות דעת - תרגולים: אחד המתרגלים הנחמדים שפגשתי בטכניון. כל התרגול עם חיוך ונותן דגשים של תכלס מה חשוב להבין ואיך צריך להסתכל על שאלות. ממש מומלץ. \n\nשעורי הבית:2 רטובים מאוד כבדים ששווים הרבה. \n\nהמבחן: מבחן ממש ממש קשה, חייבים לתרגל מלא. \n\nהשורה התחתונה:  עמוס", "timestamp": 1689791355849}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: \nמרצה פשוט מעולה!! מעניין עם הסברים טובים וזורם עם שאלות במינון טוב. החומר לפעמים מתמטי מידי וקל לאבד אותו אבל זה החלקים הפחות קריטיים\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מתרגל אש, מומלץ להישאר לאקסרה \n\nשעורי הבית: אצלנו בסמסטר הם היו סבבה סה\"כ.\nמאוד עמוסים וארוכים אבל מי שאוהב קוד הרטובים נחמדים פשוט דורשים זמן, והיבשים זה תרגול מעולה לבחינה אז שווה להשקיע. אחד היבשים אצלנו גם היה קשה באופן חריג, אבל בסוף הפכו את השאלה החריגה לבונוס.\n\nהמבחן: צריך ללמוד המון כי המבחן קשה, אבל בסמסטר שלנו הוא היה הוגן. (הממוצע נשאר אותו דבר פשוט פחות פקטור וכנראה בדיקה יותר קפדנית)\n\nהשורה התחתונה: קורס שכיף ומעניין להשקיע בו כי הוא אשכרה רלוונטי לתואר אבל בהחלט דורש השקעה.", "timestamp": 1689855424171}, {"author": "~", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: מרצה מצוין, ברור ונחמד, מעביר את החומר בצורה טובה ושמח לענות על שאלות של סטודנטים, גם אם באים אליו בהפסקה ושואלים על דברים מעבר לחומר הרשמי.\n\nשם המתרגל/ת: עידו גליל מוקלט, סאלי טרוטוב מתרגלת אחראית\nחוות דעת - תרגולים: מומלץ מאוד, משקיע בתרגולים שלו ומוסיף אקסטרה פיתרון תרגילים. ממליץ גם לראות את שעות הקבלה המוקלטות שלו לפני המבחן.\nלא יצא לי ללכת לתרגולים של סאלי, אבל כשפניתי אליה בנוגע לנושאים מנהליים היא ענתה מהר ושמחה לעזור.\n\nשעורי הבית: הרטובים ארוכים וקצת מייגעים, אבל סך הכל מנוסחים בצורה הרבה יותר ברורה ממת\"ם. שמעתי הרבה שמועות על בדיקה זדונית מסטודנטים שלקחו את הקורס בסמסטרים קודמים אבל הסמסטר הבדיקה הייתה הוגנת. תרגילי הבית היבשים בסך הכל בסדר, חוץ מיבש 2 שהיה ארוך וקשה באופן קצת מוגזם. מה שכן, הבדיקה שלהם הרגישה די מקלה והם מאוד עזרו להפנים את החומר והיו רלוונטיים למבחן.\n\nהמבחן: היה מבחן הוגן ונראה שגם הבדיקה הייתה הוגנת.\n\nהשורה התחתונה: קורס מעניין וחשוב מאוד, עמוס אבל מרגיש הרבה פחות גרוע ממת\"ם. תמצאו שותף שאתם נהנים לעבוד איתו.", "timestamp": 1689860890609}, {"author": "a", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: אחלה של מרצה.\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים: הלכתי פרונטלי לברק, מעביר את החומר ממש טוב, ומאוד איכפתי. \n\nשעורי הבית: הרטובים מאוד עמוסים, היבשים חשובים למבחן.\nלקח זמן שנקבל ציונים על תרגילי הבית שזה באסה. \n\nהמבחן: מבחן הוגן אם לומדים מספיק. \n\nהשורה התחתונה: קורס מעניין וחשוב מאוד.", "timestamp": 1689861930297}, {"author": "Eddie Cohanim", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי בטכניון. מעניין, אכפתי, בקיא ממש בחומר, מתעקב כשלא מבינים(אבל לא יותר מידי) נותן מעבר ומשנה תוך כדי השיעור את ההתנהלות בהתאם להבנה של התלמידים ולא סתם ממשיך כי זה מה \"שצריך לעשות\". ממליץ בחום\n\nשעורי הבית: ארוכים ומייגעים ברמות, הנקז משקר בקורס הזה. \n\nהמבחן:  חידות ועוד חידות ועוד חידות... תפתרו מלא מבחני עבר ואתם תהיו בסדר\n\nהשורה התחתונה:  קורס מעניין עם סגל טוב בסך הכל, לצערי השיעורי בית זוועתים ודורשי המון המון זמן. תמצאו שותף שאתם עובדים איתם טוב.", "timestamp": 1689937393510}, {"author": "סטודנט/ית", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: ההרצאות חשובות לתרגילי הבית. ארז מרצה מדהים, אהבתי איך הוא מעביר את החומר, מנסה תמיד לבוא לקראת הסטודנטים, מפשט את מה שנלמד ככל הניתן ועונה על כל שאלה שנשאלת בהרצאה.\n\nשם המתרגל/ת: עידו (מוקלט)\nחוות דעת - תרגולים: הקלטות מעולות ומצגות מושקעות, חשובות לתרגילי בית ולמבחן.\n\nשעורי הבית: עמוסים בטירוף, גוזלים את רוב שעות השבוע. השותף שלי לא היה משהו, דפק אותי ברטוב 1, לשמחתי אישרו לי להגיש לבד. תמצאו שותף טוב שניתן לסמוך עליו ושכן יכולים לנהל איתו שיחה נורמלית ולקבל החלטות / לעשות תוכנית עבודה ביחד.\n\nהמבחן: מבחן הוגן בסה״כ לא היה משהו חדש. לפתור כמה שיכולים לפני הבחינה וזה יסתדר. \n\nהשורה התחתונה: אישית לקחתי את מבני עם את״מ ועוד כמה קורסים עם הגשות שבועיות, לא היה קל בכלל. קורס חשוב ומעשיר, אהבתי מאוד את החומר שנלמד בו. נכון שהקורס עמוס מבחינת הגשות אבל אם מתחברים לחומר ומפתחים אינטואציה לדברים ניתן להצליח בו. בהצלחה.", "timestamp": 1690023643353}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז \nחוות דעת - הרצאות: מרצה מעולה ! מאוד ממליץ ללכת להרצאות שלו. \n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: מתרגל מעולה, מסביר את החומר בצורה טובה ונותן אינטואיציה \n\nשעורי הבית: נחמדים.\nהרטובים והיבשים לא לוקחים כל כך הרבה זמן, כפי שאמרו לי לפחות. יכול להיות כי עבדנו מסודר, וכתוצאה מכך זה לקח פחות זמן מאשר שלקח לרוב הסטודנטים\n\nחוץ מיבש 2 שאלה 3, שעדיף לא לדבר על השאלה הזאת, שלקחה לי כמה ימים טובים\n\nהערה: לא ממליץ ללכת לברק לשעות קבלה, ממש מיותר - הוא כנראה לא ממש מבין את המשמעות של שעת קבלה.\n\nהמבחן: ממש הוגן, טיפה לחוץ בזמן\n\nהשורה התחתונה: \nהיה קורס ממש מעניין.", "timestamp": 1690090510930}, {"author": "e", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ארז\nחוות דעת - הרצאות: מרצה מעולה\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: ממליץ בחום. יודע לשנות את התרגול במידת הצורך לפי הבנה, להתעכב יותר או פחות על חומר ולתת דגשים ממש חשובים. \n\nשעורי הבית: קשים וארוכים.\n\nהמבחן: חייבים לפתור מלא מבחנים בשביל להצליח, וגם אז יש חידות.", "timestamp": 1690092420631}, {"author": "שי", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רמי כהן\nחוות דעת - הרצאות: \nמרצה טוב. היינו בקבוצה מאוד קטנה והוא רץ על החומר אבל השאיר מקום לשאלות. יש גם הקלטות טובות של ארז שיצא לי לראות.\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: \nמתרגל מעולה. הקשבתי להקלטות שלו חצי מהסמסטר והם גם ממש טובים.\nשעורי הבית: \nמאוד מאוד מאוד עמוס. חשוב לתכנן את כל הפרוייקט מראש כי הדברים האלה מסתבכים. ממליץ להתחיל לעבוד על הרטובים מוקדם כי רק הדיבוג יכול לקחת למעלה משבוע.\nהמבחן: \nחמוד, דומה ליבשים. אם משקיעים לאורך הסמסטר ועוברים על מבחנים מסמסטרים קודמים לא אמור להיות קשה במיוחד.\nהשורה התחתונה: \nקורס הכי כיף שהיה לי בתואר עד כה, מה שכן זה צריך להיחשב לפחות 5 נקודות זכות...", "timestamp": 1690557383350}, {"author": "יונתן", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: קבוצנ קטנה בהרצאות ועונה תמיד לשאלות\n\nשם המתרגל/ת: ברק\nחוות דעת - תרגולים:\nתותח על, שולט בחומר ברמה גבוהה , מעביר אינטואיציה והבנה ובונה ביחד איך לנתח מהניסוח של השאלה מה מקבלים לתשובה. טיפים חשובים מאוד לבחינה, ממש אכפיתי , מוכן לעזור למשך שעות לכל סטודנט בקורס בכל עניין. מאחל לכם שיהיה אחראי כי ממש איכפת לו מהכל. \nשעורי הבית:\nעמוסים, עמוסים עמוסים .\n\nהמבחן:\nלא צריך לזכור, אבל מלא חידות וצריך להבין את החומר.", "timestamp": 1690605041112}, {"author": "o", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: מרצה מדהים, מסביר באופן ברור ועונה תמיד לשאלות, מומלץ מאוד!\n\nשם המתרגל/ת: ברק פרונטלי ועידו מוקלט\nחוות דעת - תרגולים: \nברק ועידו הם השילוב המנצח, ברק בין המתרגלים היותר אכפתיים שנתקלתי בהם, ישב איתנו על הרטובים והיה תמיד פתוח לשאלות, עידו מקצועי ברמות והמוקלטים שלו כולל האקסטרה מכסים את כל מה שצריך!\nשעורי הבית: אצלנו הרטובים היו אמנם לא פשוטים ודרשו זמן, אבל עם זאת מאוד סבילים ובסך הכל נהניתי לעשות אותם.\n\nהמבחן: \nהמבחן שלנו היה מאוד הוגן\nהשורה התחתונה: \nסגל אגדי!!! כיף סוף סוף להגיע לקורס שבאמת איכפת למתרגלים ולמרצים, תמיד יש מענה והכל מתנהל כמו שצריך.", "timestamp": 1691735143934}, {"author": "עץ סיומות דחוס", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: אחלה של מרצה. ממש נהניתי ללכת להרצאות שלו והוא מסביר באופן מאוד ברור ומובן. ממליץ בחום.\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: אחד המתרגלים הכי טובים שנתקלתי בהם בתואר, מאוד איכפת לו ויודע איך להעביר חומר. ממליץ מאוד.\n\nשעורי הבית: עמוסים רצח, גרמו לי להזניח קורסים אחרים כדי לקבל בהם 100. וטיפ של אלופים, *לא* לכתוב עץ AVL לבד, ניסיתי ושרף לי את כל הזמן בסמסטר.\n\nהמבחן: מועד א היה מאוד הוגן, עדיין היה חידות אך לא משהו בלתי פתיר.\n\nהשורה התחתונה: חומר הקורס מאוד מעניין וחוץ משיעורי הבית העמוסים ממש נהניתי מלקחת הקורס.", "timestamp": 1691877138598}, {"author": "עדן", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רמי\nחוות דעת - הרצאות: הרצאות טובות, גם המצגות, חשוב לתרגול ולבחינה (לפעמים מביאים במבחן שאלות תיאורטיות שפותחו רק בהרצאה)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: תרגול טוב עם שאלות לדוגמה שעוזרות ליישם את החומר\n\nשעורי הבית: תרגילים רטובים - גדולים, בהחלט גרמו גם לי ולרבים לנטוש עבודה בקורסים אחרים כדי להשלים אותם (אולי לתשומת לב הצוות, זה לא סביר =/). מזל שיש רק 2 מהם. אחרת, אני ממליצה פשוט לחלק עבודה בצורה טובה, עם תכנון מקדים משולש לפני כתיבת הקוד, ולבדוק מימושים מעשיים של המבנים באינטרנט. \nיבשים, לא עמוסים בכלל, אם קשה אפשר להתייעץ עם עוד חברי קורס.\n\n\nהמבחן: עשיתי מועד ב׳ אחרי הדחייה שלו - היה נדמה יותר קשה ממועד א׳. ההמלצה - לראות שעות קבלה מוקלטות וללכת לשעות קבלה עם בעיות משלכם בתרגול לבחינה. יש כמה מבנים ״משודרגים״ שכדאי לזכור לעזרתכם, ונסו להקפיד על כתיבה מלאה ומתומצתת של פתרון, גם בשביל זמן המבחן וגם בשביל הבדיקה. \n\n\nהשורה התחתונה: קורס חובה סה״כ, מועבר טוב, יש הקלטות טובות. לפעמים המבחן מגיע עם שאלה טריקית אבל גם אפשרי. בהצלחה.", "timestamp": 1704624055814}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: \nאחלה גבר שבעולם, מעביר את החומר מעניין ודי סוחף לדעתי. אחרי ההרצאות עושה קאהוט של איזה 6 שאלות על הנושא של ההרצאה, שזה תמיד משעשע. בא לקראת הסטודנטים מלא, ובאופן כללי אהבתי אותו ממש.\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: \nמתרגל אגדה, משקיע רצח בתרגול עצמו וגם לפני ואחרי. ממליץ בחום להישאר גם לאקסטרה שהוא מעביר, יש שם שאלות ממש טובות (ספציפית במבחן שלנו הופיעה שאלה אחד לאחד מה שהוא פתר בתחילת הסמסטר)\n\nשעורי הבית: \n3 יבשים, 2 רטובים. היבשים די בסדר, אפשר לתפור אותם ביומיים שלושה. הרטובים כמובן עינוי שלא ברא השטן, מלא עבודה אבל סך הכל פתירים.\n\nהמבחן: \nוואלה היה קשה אבל הוגן\n\nהשורה התחתונה: \nהקורס עצמו ממש טוב, וחוץ מזה שהוא חובה אז אין לכם ברירה אני אישית גם ממש עפתי עליו", "timestamp": 1713273124272}, {"author": "ארד פירון", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: סופר מעניין, סופר כיפי- מומלץ!\n\nשם המתרגל/ת: עידו גליל(י)\nחוות דעת - תרגולים: אין שום סיבה שתלכו למתרגל אחר, אף פעם, בלי יוצא מן הכלל, אף פעם.\nאם וקרה שמשהו נופל לכם על התרגול תראו מוקלט.\nשעורי הבית: לנו היו שני תרגילים רטובים ו3 יבשים, היבשים מעניינים ולוקחים כמה שעות, הרטובים גם מעניינים אבל לוקחים ימים של עבודה. אל תטעו ותחשבו שבגלל שזה קורס 3 נקז השיעורים לא עמוסים- אתם תדבגו את הרטובים לאורך כל הסמסטר- בהצלחה עם זה.\n\nהמבחן: יחסית הוגן, אבל עדיין קשה- צריך כמות ימים טובה ללמוד אליו כי חייב לחרוש מבחנים.\n\nהשורה התחתונה: קורס חובה אבל באמת הכי כיף שהיה בתואר עד עכשיו.", "timestamp": 1713279596241}, {"author": "binaryTree", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: תותח, מעביר את ההרצאה בכיף ובצורה מעניינת, בסוף שיעור יש Kahoot שעשה את השיעור עוד יותר כיפי.\n\nשם המתרגל/ת: עידו גליל מוקלט\nחוות דעת - תרגולים: אגדה הבחור הזה, אם הוא לא היה לא יודע מה הייתי עושה.\n\nשעורי הבית: היו שני רטובים ושלושה יבשים, היבשים היו די סבבה ופתירים. הרטובים עמוסים מאוד מלא דיבוגים אבל פתירים. \n\nהמבחן: ארוך וקשה, אבל הוגן כי רוב השאלות ממוחזרות. 10 דקות אחרונות במבחן זה מרתון כתיבה כדי להספיק הכל.\n\nהשורה התחתונה: קורס שווה 5 נק\"ז ולא 3! \nהחומר מאוד מעניין שווה להשקיע ולנסות לפתח אינטואיציה למבנים. סה\"כ קורס מעניין, הוא מהקורסים היפים שלקחתי עד כה (רק שהרטובים עשו לי חיים קשים ושנאתי את החיים שלי).", "timestamp": 1713337029598}, {"author": "Heap", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רועי ואורי\nחוות דעת - הרצאות: רועי תותח, מעביר את ההרצאה בצורה מעניינת, וממש שולט בחומר.\nאורי מעביר את ההרצאה בצורה משעממת, ולא תמיד שולט בחומר. הוא לא אוהב ששואלים אותו שאלות ממבחנים, רק מההרצאות.\n\nשם המתרגל/ת: ברק גחטן - זום\nחוות דעת - תרגולים: מתרגל מעולה, איכפתי ורואים שיש לו מלא ניסיון. תמיד נשאר אחרי התרגול לכמה זמן שצריך, עד שלאף סטודנט יש עוד שאלה. תמיד מנסה לבנות ביחד עם הסטודנטים את האינטואיציה וגם מראה עוד דוגמאות על אותם שאלות של התרגול - מה היה משנה בשאלה ובהתאם את התשובה. \nהתחיל לתרגל רק באמצע הסמסטר מה שהיה חבל. \n\nשעורי הבית: היו שני רטובים ושלושה יבשים. יבשים סבבה, תמיד שאלה חדשה והשאר ממוחזר. רטובים - קשים, ארוכים אבל מלמדים. אצלנו גם שאלו במועד א משהו על הרטוב.\n\nהמבחן: ארוך וקשה, אבל הוגן כי רוב השאלות ממוחזרות.\nהקורס: הסגל של הקורס מתנהל בצורה מדהימה, ממש מסודר, והכל בזמן. קיבלנו מענה לכל בעיה ממש מהר, והכל היה מוסבר היטב. \n\nהשורה התחתונה: קורס עמוס, אבל מעניין, וגם חובה אז אין ברירה. החומר מאוד מעניין שווה להשקיע ולנסות לפתח אינטואיציה למבנים.", "timestamp": 1713605778732}, {"author": "ע.", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: הקלטות של ארז\nחוות דעת - הרצאות: \nמרצה מדהים מסביר את החומר בצורה הכי טובה שאפשר\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: תותח על! מקווה שיהיו עוד מתרגלים כמוהו בהמשך התואר\n\nשעורי הבית: היבשים די סבבה\nהרטובים עמוסים ודורשים הרבה זמן השקעה לכן תתכננו זמן מראש.\n\nהמבחן: ארוך מאוד רמת הקושי בינונית עד קשה.\n\nהשורה התחתונה: קורס חובה, החומר אחלה אבל עמוס מאוד.", "timestamp": 1714667792784}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ההקלטות של ארז\nחוות דעת - הרצאות: מרצה מצויין ויודע להסביר את החומר.  \n\nשם המתרגל/ת: עדו מוקלט\nחוות דעת - תרגולים: אין לי מה להוסיף מעבר למה שנאמר פה. הוא אחד המתרגלים הכי טובים שיש בפקולטה הזו. \n\nשעורי הבית: אישית אני חזרתי על הקורס בסמסטר הזה. וברטרוספקטיבה, שיעורי הבית הרטובים בסמסטר הזה היו קשים פי כמה מהרטובים בסמסטר אביב. \nובאופן כללי הרטובים קשים ועמוסים. \nהיבשים הם ברמת קושי של המבחן. יש שאלות שפחות קשות ויש שאלות שיותר קשות.\n\nהמבחן: \nקשה ודורש הרבה הרבה השקעה. \nהרבה סטודנטים חוזרים על הקורס בגלל רמת הקושי של המבחן.\nאבל בהחלט ניתן לעבור את הקורס עם 80+ ממועד א/ מועד ב אם לומדים כמו שצריך גם במהלך הסמסטר וגם לקראת המבחן (תלמיד מתמיד+ לפתור כמה שיותר מבחנים מהעשור האחרון+ לדעת איך לכתוב את הפתרונות). \n \nהשורה התחתונה: דורש הרבה הרבה השקעה. והוא חשוב בשביל למצוא עבודה גם כן. אז תנסו לסיים עם ציון טוב (80+).", "timestamp": 1715075784579}, {"author": "SS", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: \nמרצה לא משהו, בעיקר מקריא מהמצגת בקול די מונוטוני\n\nשם המתרגל/ת: יצחק\nחוות דעת - תרגולים: \nאחלה מתרגל, די נהניתי מהתרגולים \nהרגשתי שלמדתי מהם הרבה יותר מההרצאה\n\nשעורי הבית: \nעמוסים בלי שום פרופורציה לנקז של הקורס, ויש להם קשר מאוד כללי לקורס עצמו ולמבחן\n\nהמבחן: \nקשוח אבל אם להכיר את החומר טוב ולהבין את המשמעות של המבנים אפשר לעבור\nיותר מלהתבסס על החומר הפתוח עדיף לרכז לדף אחד/שתיים את המבנים הבסיסיים ואת הסימנים שרומזים אליהם", "timestamp": 1715161860969}, {"author": "Omer Ben-Laish", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי / מוקלט של ארז\nחוות דעת - הרצאות: \nהרבה יותר התחברתי לאיךשארז מעביר את זה, הרבה קישור לחיים \n\n\nשם המתרגל/ת: עידו גליל מוקלט\nחוות דעת - תרגולים: \nמושלם. הכל כבר נאמר. עידו נותן אינטואיציה ממש טובה למה שקורה, והויזואליזציות שלו מאד עוזרות. ממליץ להשאר לשעת אקסטרה - שעת תרגול אחת ממש לא מספיקה למקצוע וזה נותן הרבה.\n\nשעורי הבית: \nקשים מאד מאד, במיוחד הרטובים. final boss music plays :)\n\nהמבחן: \nקשוח, דורש הבנה מעמיקה של החומר וגם לא מעט יצירתיות. עוזר מאוד להכיר טוב ולפרטים את כל מה שהלך בתרגולים - הרבה שאלות הם טוויסטים על דברים שראינו.\n\nהשורה התחתונה: \nקורס קשה מאד כמו שכולם אומרים, בעיניי", "timestamp": 1715280340494}, {"author": "Daniella Shim'on", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מאוד נהניתי מההרצאות ומהשיטת לימוד, עשה קאהוט בסוף כל הרצאה אצלנו, מסביר ממש טוב ולא מרדים, אני אישית נהניתי\n\nשם המתרגל/ת: עידו גליל מוקלט\nחוות דעת - תרגולים: באמת כמו שאמרו רמה מאוד גבוה של תרגולים מאוד מאוד מומלץ לראות גם את שעות הקבלה המוקלטות והאקסטרה\n\nשעורי הבית: היו רטובים קשוחים ותובעניים מבחינת זמן, להשקיע ולהתחיל מוקדם אבל שווה לחכות שעוד אנשים ישברו את הראש ולהתייעץ כי אתם לא רוצים לכתוב חצי מהרטוב ואז לגלות שמשהו שתכננתם לא עובד בסיבוכיות הנדרשת, לא להיבהל כי בסוף כמעט כולם מגיעים לאותו פיתרון. למרות שהציונים בתרגילים בסוף היו סבבה לגמרי ויש להם משקל של 26% אז אפשר ממש להקפיץ את הציון.\n\nהמבחן: 5 שאלות, אם מחולקים לסעיפים אפשר לגרוף הרבה נקודות שאלות שלא חילקו לסעיפים היו בלתמ כי הבדיקה הייתה נוראית אז להיזהר שם ולתכנן את התשובה טוב, יש חומר פתוח אז לא צריך לזכור בעל פה אבל \n\nהשורה התחתונה: קורס אחד המעניינים שהיו לי, חוץ מחישובי סיבוכיות אין פה יותא מידי מתמטיקה אז היה פנאן.", "timestamp": 1715430157941}, {"author": "YyyZzz", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רועי אנגלברג\nחוות דעת - הרצאות: מרצה אדיר\n\nשם המתרגל/ת: ברק גחטן זום\nחוות דעת - תרגולים: רמה גבוהה, הרבה ניסיון ואכפתיות שכולם יבינו עד הסוף הכל\n\nשעורי הבית: הרטובים לוקחים זמן, חייבים לתכנן מראש כמו שצריך. היבשים הם שאלות ברמה של מבחן\n\nהמבחן: המבחן קשה אבל הוגן\n\nהשורה התחתונה: קורס חובה בהצלחה", "timestamp": 1715680208753}, {"author": "רועי ש.", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: קצת משעמם, אפשר גם לראות את ארז בוידאו.\n\nשם המתרגל/ת: ברק \nחוות דעת - תרגולים:\nברק בין המתרגלים היותר אכפתיים שנתקלתי בהם, עזר לנו מלא בזום על השיעורי בית אפילו בצורה פרטנית.  תמיד היה פתוח לשאלות, ותמיד מחזיר תשובות לכל דבר. משתדל לתת גם דוגמאות שונות במהלך התרגולים. \nיש לעידו מלא דברים מוקלטים שממש חשוב לראות, בעיקר שעות קבלה מוקלטות.\n\nשעורי הבית: אצלנו הרטובים היו לא פשוטים ודרשו זמן. תתכנו את הזמן כמו שצריך\n\nהמבחן:\nבמבחן שלנו היו שאלות קלות ושאלה אחת סופר קשה. תלמדו טוב מבחני עבר ותבינו טוב את התרגולים. \n\nהשורה התחתונה:\nכיף להגיע לקורס שבאמת איכפת למתרגלים ולמרצים, תמיד יש מענה והכל מתנהל כמו שצריך.", "timestamp": 1716493782632}, {"author": "anonemus", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: אחלה של מרצה, לא משהו מיוחד אבל פשוט טוב אין משהו רע להגיד עליו\n\nשם המתרגל/ת: עידו גליל\nחוות דעת - תרגולים: המתרגל האהוב עליי בטכניון, אהבתי את הקורס בגללו, ממליצה בחום על שעות הקבלה שלו, הוא פתר שאלה בשעת הקבלה שהיתה במבחן!!! ממליצה בחום.\n\nשעורי הבית: כבדים ודורשים השקעה, היבשים מאוד דומים למבחן, הרטובים מאוד לוקחים זמן\n\nהמבחן: סביר אבל השקעתי ביבשים ובמהלך הסמסטר הרבה. \n\nהשורה התחתונה: קורס כבד, ממליצה על עידו כמתרגל ועל השקעה ביבשים", "timestamp": 1716649779152}, {"author": "מי", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי ואח\"כ ארז מוקלט\nחוות דעת - הרצאות: ההרצאות של אורי מאוד משעממות ולכן אחרי כמה שבועות עברתי למוקלט של ארז וזו ההחלטה הכי טובה שלקחתי\nהחומר נחמד אבל יש הרבה מה לזכור אז מומלץ להשקיע בהבנה\n\nשם המתרגל/ת: עידו גליל התותח\nחוות דעת - תרגולים: המתרגל הכי טוב שפגשתי עד כה, דואג לסטודנטים, משקיע הרבה, אכפתי ומסביר טוב 3>\n\nשעורי הבית: רטובים ארוכים רצח ומעצבנים אבל אין מה לעשות\nיבשים קלילים עם ציונים גבוהים\n\nהמבחן: בסמסטר שלנו מועד א' היה מעצבן וקשה אבל היו סלחניים בבדיקה אז מומלץ לא להשאיר סעיפים ריקים (גם אם לא יודעים תנסו לחרטט משהו ואלי תקבלו נקודות) גם בסריקות רואים שכמעט תמיד זה עובד\n\nהשורה התחתונה: חומר יפה אבל הקורס קשה ודורש השקעה רבה אבל בסוף מצליחים :)", "timestamp": 1716716259442}, {"author": "עוד אחד", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארז מוקלט\nחוות דעת - הרצאות: אין עליו, מאוד ברור ושובה לב. הקשב שהוא נותן לשאלות של סטודנטים מפליא אותי כל פעם מחדש. גורם להכל להיראות כל כך בר השגה.\n\nשם המתרגל/ת: עידו גליל מוקלט\nחוות דעת - תרגולים: בין המתרגלים הטובים שיש!! האקסטרה שלו חיוני בעיני, הוא פותר שאלות מורכבות ממבחנים וזה סופר חשוב. חצי השעה הזו מעבר לתרגול נותנת עוד זמן חשוב להפנים את החומר והיישומים אז גם אם רואים תרגולים פרונטליים הייתי שוקל לראות בנוסף את האקסטרה. בכל מקרה לברק ולעידו יש דף אקסל של ריכוז פתרונות של שאלות ממבחנים בשעות קבלה - זה עוזר מאוד בלמידה למבחן.\n\nשעורי הבית: כבדים. מאוד. 2 תרגילים רטובים בהיקף גדול. השני יכול להסתמך בחלקו על הראשון ובכך לחסוך לכם עבודה רבה. תקפידו מאוד על בדיקות, לכו לסמסטרים מעליכם ותקרו סקריפטים שמג'נרטים בדיקות ותשוו פלטים עם חבריכם כדי לבדוק שאין SEGFAULT ושאתם מסכימים על הפלט, ותודו לי אחר כך.\nחוץ מזה היבשים דומים מאוד למבחן (ובחלקם השאלות לקוחות ממבחנים), הזדמנות טובה לקבל פידבק.\n\nהמבחן: מועד א' אצלינו היה סביר חוץ משאלה 4 שהייתה מוקש רציני, וקיבלה פקטור נפרד. אני חושב שזה בין המבחנים שכתבתי בהם הכי הרבה.\n\nהשורה התחתונה: קורס חשוב ומעניין מאוד, אבל עמוס רצח. הציונים על תרגילי הבית יכולים לפגוע לכם בציון הסופי ללא קשר לכמה הבנתם את החומר אלא לא מלמדים אותנו לבדוק קוד כמו שצריך, אז תשקיעו בזה.", "timestamp": 1716885050376}, {"author": "איציק", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארז מוקלט ורועי פרונטלי\nחוות דעת - הרצאות: ארז מרצה מעולה, אבל תמיד כיף ללכת להרצאות אמיתיות. רועי מעביר את החומר ממש טוב. \n\nשם המתרגל/ת: ברק גחטן זום\nחוות דעת - תרגולים: בין המתרגלים הטובים שיצא לי לראות, מאוד וותיק מכיר את החומר טוב ותמיד מוסיף דוגמאות בתרגולים של עוד שאלות על אותו חומר שלא מופיע במצגות. \n\nשעורי הבית: מאוד ארוכים. \nהתרגילים היבשים הם כמו מבחנים אז חשוב להבין אותם כמו שצריך וחלק מהשאלות הם גם ממבחני עבר. בקורס מקבלים אשכרה פידבק על היבשים.\nהתרגילים הרטובים כבדים, אבל אם עושים אותם נכון זה לא סטייל מתמ ולילות לבנים, צריך להשקיע בטסטים.\n\nהמבחן: קשה אבל בודק על החומר ולא את רמת הזיכרון. \nבמועד א׳ שלנו הייתה שאלה קשה והשאר היה בסדר \n\nהשורה התחתונה: קורס חובה חשוב ומעניין, אבל עמוס. צריך להשקיע בשיעורי בית כי זה תקף", "timestamp": 1716892274616}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: סביר. ההרצאות עצמן מועברות באופן לא ממש מעניין, אבל ברור. בסוף כל הרצאה חידון עם שאלות מכשילות שמחדד נקודות מההרצאה.\n\nשם המתרגל/ת: יצחק וקנין\nחוות דעת - תרגולים: טוב מאוד. מסביר ברור, שם דגש על הבדלים בין פתרונות נאיביים, טובים יותר ואופטימליים, איך לחשוב על שיפורים ואיך להגיע לפתרון הנכון. לדעתי חשוב להגיע גם להרצאות וגם לתרגולים.\nגם ההקלטות של עידו גליל ממש טובות ועם אותו חומר.\n\nשעורי הבית: היבשים בסמסטר הזה היו פשוט תרגילים מסמסטרים קודמים, לכן לא לקחו זמן והציונים היה בהתאם. הרטובים היו ההפך הגמור - שני הרטובים גזלו ממני הרבה הרבה יותר מדי זמן לקורס של 3 נ\"ז. חשוב מאוד להתחיל את הרטובים מוקדם ככל האפשר ולהריץ כמה שיותר טסטים. ברטוב הראשון הממוצע היה נכשל לפני ערעורים ושיפורים. צוות הקורס בא לקראתנו במידה רבה בערעורים וגם בדחיית הגשות.\n\nהמבחן: כדאי להכיר כמה שיותר שיטות וטריקים שחוזרים על עצמן לפתרון תרגילים. כמובן שלא הכל חוזר על עצמו וצריך גם להבין לעומק - לתרגל ניתוח סיבוכיות, להבין לעומק איך האלגוריתמים ומבני הנתונים עובדים, איך אפשר לשפר על ידי מידע נוסף או שילוב כמה מבנים או טריקים אחרים. הקלטות שעות קבלה של עידו גליל מועילות מאוד - יש מסמך אקסל מסודר באתר הקורס עם קישורים להקלטות לפי נושאים.\nמועד א' של הסמסטר היה ארוך, ברמה גבוהה יחסית. האורך היה החלק הבעייתי בשבילי וחשוב לדעת לתכנן זמנים טוב. מועד ב' היה נורא ואיום - אורך לא נורמלי, פורמט מוזר ורמה גבוהה יותר.\n\nהשורה התחתונה: קורס חשוב מאוד. צוות הקורס מצוין. עמוס, לדעתי זה יכל להיות קורס של יותר מ-3 נ\"ז.", "timestamp": 1716983344510}, {"author": "מילואימניק", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורי רוטנשטרייך\nחוות דעת - הרצאות: סביר.\n\nשם המתרגל/ת: ברק גחטן\nחוות דעת - תרגולים: אני פה כדי להרים לברק, היה מתרגל אחראי בחורף, דאג למילואימניקים לכל דבר, הגשות מאוחרות, ציונים מקסימליים מבין תרגילי הבית, אפילו הייתה קבוצת וואצאפ למילואימניקים בלבד.\nהוא קיים שעות קבלה רק לסטודנטים המשרתים המילואים, בנוסף לשעות קבלה הרגילות שלו. \nעוד עניינים: מילואימניקים יכלו להצטרף לזוגות ולהיות שלשה ואפילו הזוגות שלהם יכלו.  במבחן היה מתווה מילואים שבו כל מילואימניק יכל לבחור איזה שאלה להוריד מהמבחן. \nרואים שהוא בעצמו מילואימניק. \n\nשעורי הבית: היבשים והרטובים קשים, אבל נו טוב זה מבני. אין מה לצפות. הסגל מאוד משקיע בסטודנטים. \n\nהמבחן: חייבים להכיר את כל הטריקים בשביל להצליח. צריך לפתור הרבה מבחנים ולהבין טוב את היבשים. \n\nהשורה התחתונה: קורס חובה.", "timestamp": 1721431271673}]}