{"posts": [{"author": "םם", "semester": "201901", "text": "קורס קליל לכל מי שאי פעם נגע בתכנות. 90+ בלי להשקיע יותר מדי.", "timestamp": 1592743847000}, {"author": "OT2468", "semester": "201902", "text": "קורס של העתק הדבק מההרצאה.\nבמבחן יש שאלות שאם לא כתבת בדיוק כמו בהרצאה תקבל 0 נק על השאלה (גם אם הקוד עובד בצורה מושלמת ועונה על דרישות של השאלה).\nלמי שיש ניסיון בתכנות זה יכול לעזור בש.ב אבל למבחן חשוב לשנן בע\"פ את הקודים שנלמדו בהרצאות (בדגש על ה GCD)", "timestamp": 1595930896000}, {"author": "שם", "semester": "201902", "text": "רוב הלמידה נעשית ע\"י התרגולים ושעורי בית (שיכולים להיות ארוכים ומתישים).\nאין הרבה ערך להרצאות אפילו לסטודנטים שאף פעם לא תיכנתו בחייהם - אפשר בקלות לעבור על המצגות של ההרצאות לבד ולהבין את כל החומר (ומלמדים את החומר הרבה יותר טוב בתרגולים).\nעדיף לעשות את שעורי הבית כמה שיותר מהר ולוודא שהקוד עובד כמו שצריך כל פעם כשנותנים דוגמאות חדשות בFQA. חשוב לקרוא את כל ההוראות לשעורי הבית, אחרת יורידו נקודות על שטויות.\nלקראת המבחן: אין הרבה מבחנים (עדיין כי זה קורס חדש) ולכן:\nלעבור על התרגולים ולנסות לפתור את השאלות שם - אלו שאלות ששאלו במבוא לשפת C שהמירו לפייתון\nיש כמה שאלות ממבחנים של C בהרצאות (בעיקר ברקורסה ומיון)\nלעבור על האלגוריתם של היסטוגרמה, חיפוש בינארי, GCD, מיון מיזוג, מיון דליים ומיון רקורסיבי (הסיכויים שישאלו על מיון בחירה/בועות נמוך). כדאי לדעת גם חציון.", "timestamp": 1597214400000}, {"author": "Lir", "difficultyRank": 5, "generalRank": 4, "semester": "201901", "text": "שם המרצה: יעל \nחוות דעת - הרצאות: מרצה סבבה.\n\nשם המתרגל/ת: רוג'ה\nחוות דעת - תרגולים: מעולה, מסביר לאט ודברים לכאורה ברורים מאליהם שמאוד עוזרים לעשות סדר בשבילמי שאין לו שום נסיון עבר בתכתנות ולא מבין בזה בשיט.\n\nשעורי הבית: כדאי להשקיע, משמעותי בציון ובסוף זבה תרגול לא רע.\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס סבבה, מסודר, המצגות טובות ממש. הקרוס עמוס למי שלא תותח בזה/ ללא נסיון יכול להתקע על שיעורי בית ממש הרבה זמן.", "timestamp": 1597744558848}, {"author": "Yaakov L.", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nמרצה טובה\nשם המתרגל/ת: גארי\nחוות דעת - תרגולים: \nמתרגל מצוין עם הרבה סבלנות \nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598347268914}, {"author": "Shahar Betzalel", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: לא הלכתי אפילו לאחת, לא הרגשתי חוסר בידע (בלי ניסיון קודם בתכנות)\n\nשם המתרגל/ת: יותם/יונתן\nחוות דעת - תרגולים: שניהם תותחים, החלפץי ביניהם לפי הנוחות של השעות בגדול. ממליצה על שניהם מאוד\n\nשעורי הבית: תקף, אחת לשבועיים-שלושה, נותנים יחסית מספיק זמן לעבוד עליהם.\n\nהמבחן: בוחן גם ידע וגם הבנה. תכלס אם היית על החומר במהלך הסמסטר, אין יותר מדיי מה ללמוד למבחן עצמו\n\nהשורה התחתונה:", "timestamp": 1599388128828}, {"author": "Ok", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא מאוד קשים, יש צורך בידע מוקדם בתכנות כי הקורס לא מלמד לתכנת אלא מלמד לכתוב קוד בפייתון.\n\nהמבחן: \nהוגן עם מספיק זמן\nהשורה התחתונה: קורס אחלה למי שיש ידע קודם בתכנות", "timestamp": 1599460081142}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אלינה נוםרי\nחוות דעת - הרצאות: משעממות בטירוף, קולות להבנה - עדיף לעבור רק על המצגות וזהו\n\nשם המתרגל/ת: אוהד\nחוות דעת - תרגולים: ממש אחלה - מסביר את החומר היטב\n\nשעורי הבית: ארוכים ולעיתים קרובות צוות הקרוב משנה את אחד הסעיפים ברגע האחרון לפני ההגשה כך שצריך לשנות את הקוד שלך. עדיף לעשות 7 ימים לפני ההגשה, אך לא פחות מ5 ימים\n\nהמבחן: לא לעשות מועד ב!!! הוא הרבה יותר קשה ממועד א!! (נתנו בסמסטר אביב 2020 פקטור של 10 נקודות)\n\nהשורה התחתונה: לא לעשות מועד ב", "timestamp": 1601832853224}, {"author": "Nate", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: ההרצאות מיותרות ומתעסקים הרבה בידע כללי של מחשבים ולא דברים שרלוונטיים למבחן. אך למי שאין בכלל רקע כן חשוב להקשיב אבל אם לא מבינים אז אין צורך להתעמק ולבזבז על זה זמן!! מה שחשוב זה רק התרגולים ורק ההבנה שלהם.\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: מתרגל מדהים! דואג שנדע איך לתכנת בשביל המבחן, איך לפתור שאלות במבחן. מסביר טוב מאוד.\n\nשעורי הבית: מרגע פרסום שיעורי הבית ועד ההשגה שלהם הסגל משנה כל פעם את מה שצריך לעשות בשיעורי הבית. לכן מתסכל מאוד וכל פעם הנציגי סמסטר צריכים להתערב ולדבר עם הסגל. התנהלות בזויה.\n\nהמבחן: אמרו שתהיה שאלת רקורסיה ובסוף לא הייתה, שיגעו אותנו! אך מבחן מועד א' היה ברמה טובה וידידותית.\n\nהשורה התחתונה: קורס קשה מאוד למי שאין רקע במחשבים. למי שיש רקע בתכנות- אחלה קורס ותעזרו לחברים שלכם.", "timestamp": 1611739235500}, {"author": "dana", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מיותרות\n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: ארוכים", "timestamp": 1612790969832}, {"author": "נכון זה אני", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "הקורס הכי מזעזע שעשיתי עד כה\nשעורי הבית: ארוכים ומחרפינים\nאבל עם זאת יש המון סטודנטים שלא מבינים ממש בתכנות ועוברים בציון גבוה", "timestamp": 1612814759168}, {"author": "א", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: משתנה\nחוות דעת - הרצאות: \nלא יעילות כלכך יעל אחלה מרצה האחרים פחות \nמתקדמיים ממש ממש לאט בהרצאות וגם לא תמיד רלוונטי לשיעורי בית\nעדיף ללמוד לבד\n\nשם המתרגל/ת: ספיר\n\nחוות דעת - תרגולים: \nתרגולים זה תכלס מה שצריך לתרגילי בית\nהמתרגל בסכ אחלה \nאבל גם פה עדיף ללמוד לבד \n\nשעורי הבית: \nזוועת עןלמים\nכל תרגיל בית לוקח שעות על גבי שעות\nהמבחן: \nלא התקיים עדיין\nהשורה התחתונה: \nחייבים לקחת אבל זוועתי", "timestamp": 1612977333097}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: ההרצאות אחלה, החומר מסובך להבנה בפעם הראשונה. יש הכל במצגות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: בהתחלה קלים וככל שמתקדמים נהיים  קשים. סה\"כ 7 הגשות.  \n\nהמבחן: קשה מאוד  \n\nהשורה התחתונה: קורס קשה מאוד למי שאין רקע בתכנות וקל למי שיש, מה שמעמיק ומגדיל את הפערים בין אלה עם הרקע לאלה שזה חדש להם.", "timestamp": 1614104676454}, {"author": "Dani dragon weaver", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: יעל מרצה מאוד נחמדה. היא מעבירה את החומר בצורה טובה ומעניינת. היא עונה על שאלות ואפילו כששואלים אותה על משהו שמעבר לחומר הקורס היא מזמינה לשלוח לה מייל ועונה בזמנה האישי.\n\nשם המתרגל/ת: ילנה\nחוות דעת - תרגולים: לפי דעתי היא מרצה לאט מדי. קל מאוד להירדם בתרגולים שלה.\n\nשעורי הבית: טובים להבנה ולתרגול.\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1614205649192}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יעל ארז \nחוות דעת - הרצאות: אחרי הרצאה אחת הבנתי שזה לא בשבילי, מרדימה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: פשוטים יחסית למי שיש לו רקע במדעי המחשב\n\nהמבחן: לא קל בכלל\n\nהשורה התחתונה: עדיף ללמוד מהמצגות לבד, אבל להתכונן טוב למבחן", "timestamp": 1614683850315}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל ארז\n\nחוות דעת - הרצאות: \nהרצאות נחמדות מאוד! יעל מעבירה את החומר בצורה כיפית ומעניינת, רואים שיש אהבה למקצוע. \n\nשם המתרגל/ת: דור מירון\n\nחוות דעת - תרגולים: \nדור מתרגל ממש נחמד! התרגול חשוב למי שאין לו רקע בתכנות.\n\nשעורי הבית:\nלא קשים במיוחד, ולא לוקחים המון זמן.\n\nהמבחן: \nהיה קשה! ממוצע נמוך בהרבה מממוצעים קודמים. צריך לשים לב לפרטים הקטנים בקוד.\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1615127478128}, {"author": "Lio Samueli", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nהמון שאלות מהסטודנטים ויעל בהתחלה לא ידעה מתי למתן. סך הכל מרצה טובה מסבירה את החומר כמו שצריך.\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: \nמתרגל ממש טוב, מעדיף שנהיה עם מצלמות וזה עדיף בשבילי בשביל להיות יותר בשיעור. עונה על כל השאלות ויודע גם מתי לעצור אותם כשצריך. נפגש לשאלות גם מעבר לשעת קבלה במקרה שיש צורך. תותח.\nשעורי הבית: \nמזעזעים. אין שום קשר בין תרגיל 0 לשאר התרגילים. לוקחים המון המון המון זמן לאנשים שלא יודעים תכנות. תרגיל בית 5 לקח לי שבוע שלם, יש לנו קורסים נוספים ומי שכתב את התרגיל כנראה שכח את זה.\nהמבחן: \nהמבחן שלנו היה מאוד קשה, הממוצע 61 לעומת 82 בסמסטר לפני כן, הקורס חדש ואין כל כך מבחנים לתרגל מהם. ובינתיים גם לא התגבש סטטוס לקורס אם זה קורס קל או קשה.\nהשורה התחתונה: \nקורס קל למי שיודע תכנות. מי שלא יודע תכנות בהצלחה.", "timestamp": 1615136613030}, {"author": "הביולוג", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nהשיעורי בית לוקחים יחסית הרבה זמן מהגשה 3 \nהמבחן: \nהמבחן מאתגר \nהשורה התחתונה:", "timestamp": 1615485372523}, {"author": "אלעזר", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: יעל מעולה!\n\nשם המתרגל/ת: וויסאם \nחוות דעת - תרגולים: \nמסביר טוב וסבלני\nשעורי הבית: \nסבבה, אבל הניסוח לפעמים ממש גרוע\nהמבחן: \nסביר\nהשורה התחתונה: למי שיש רקע זה קורס ממש קל, למי רקע יצתרך להשקיע יותר זמן על תירגולים וש.ב.\nלמי שאין רקע  ממליץ לקחת את הקורס בסמסטר פחות עמוס", "timestamp": 1616274118783}, {"author": "Gilad sella", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  יעל ארז\nחוות דעת - הרצאות: היה קשה להתרכז אצלה בגלל שהיה סמסטר קורונה, ממליץ לעבור על ההרצאות לפני ואת מה שלא מובן לשאול בתרגולים.\n\nשם המתרגל/ת:  דור מירון\nחוות דעת - תרגולים: מתרגל מעולה, מסביר את החומר בצורה טובה ומחדד נושאים שטוב לדעת לפני המבחן. בנוסף גם עונה על שאלות שלא מחומר הקורס וברמה קשה יותר ומסביר איך לגשת לשאלות.\n\nשעורי הבית:  בהתחלה ברמה סבירה, ולאחר חודש וחצי - חודשיים נהפכים לקשים מאוד. מפורסם תרגיל כל שבוע - שבועיים.\n\nהמבחן:  הוגן+, בודק הבנה של החומר וניואנסים קטנים בשאלות. כאשר מבינים את החומר ובאים עם רקע מקדים יכול להיות קל לפי סטודנטים אחרים.\n\nהשורה התחתונה: קורס קדם, המתרגלים טובים מאוד ודואגים לכך שהחומר יישב טוב אצל מי שמשתתף בשיעורים ופעיל.", "timestamp": 1616362337950}, {"author": "ג", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מעט מבולגנת, לא תמיד מעבירה את החומר של הקורס בצורה כל כך טובה, אבל את התיאוריה היא מסבירה בסדר.\n\nשם המתרגל/ת: יותם אמיתי\nחוות דעת - תרגולים:  קשה מדי פעם לעקוב אחרי מה שהוא עושה, אבל עדיין אפשר ללמוד טוב מהתרגולים איתו.\n\nשעורי הבית: הראשונים סבבה, האחרונים זה סיוט ששואב זמן באופן שאינו פרופורציונאלי לשווי הקורס. ברוכים הבאים לתכנות.\n\nהמבחן: מרגיש יותר תיאורטי מתרגילי הבית, הייתה לנו שאלה שנראה לי שכמעט אף אחד הצליח לענות עליה.\n\nהשורה התחתונה: למדתי לשנוא רקורסיה", "timestamp": 1626604644306}, {"author": "פג סיני", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: אם יש לכם חוש טכני אפשר לוותר על ההרצאות ולראות רק תרגולים או לראות הקלטות על 2+, ילנה אוהבת לשאול שאלות כמו \"כמה זה 1+1?\" ואשכרה לחכות לתשובה חח\n\nשם המתרגל/ת: עדי חביבי\nחוות דעת - תרגולים: אחלה מתרגלת, מדברת לעניין, תמציתית, מסבירה טוב את החומר ועשתה עבודה מצויינת.\n\nשעורי הבית: היו 2-3 מטלות קשות אבל הרוב די סבבה.\n\nהמבחן: כל המבחן היה באמת פייר וסבבה חוץ מהשאלה האחרונה שהמון נפלו בה (נתנו עליה פקטור 7 נק') שהייתה ממש הזייה.\n\nהשורה התחתונה: קורס מעניין, למי שיש חוש למחשבים אך אף פעם לא למד תכנות (כמוני) זה זורם די בקלילות ואפילו מהנה. מאמין שגם יהיה שימושי יום אחד, מומלץ.", "timestamp": 1628626050412}, {"author": "משה", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nבתור במאית הסרט, ילנה בחרה לקחת את הסרט לכיוון מאד גינרי. אין הפתעות או חידושים, מרגיש כאילו צריך ללמוד שפה חדשה בשביל להבין את מה שהיא מנסה להגיד. מכיוון שאני הרגשתי שהסרט לא מתקדם, צפיתי בו על כפול 2, אחרת הייתי נרדם.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nשיעורי הבית דורשים מצופה לחשוב על המעבר, לצאת מהקופסה שלו ולדפוק את הראש בקיר המון שעות.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1629307965928}, {"author": "חנה רובינס", "difficultyRank": 4, "generalRank": 4, "semester": "202003", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: באלה שהייתי היה ברור וחומר חשוב\n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים: \n\nשעורי הבית:  חשוב לעשות בשביל התרגול, לוקחים זמן.. \n\nהמבחן: לדעתי, בערך ברמה של שיעורי הבית\n\nהשורה התחתונה:", "timestamp": 1635193841514}, {"author": "אבישג.ד", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nיעל היא מרדימה. לא תצליחו להישאר אצלה ערים מילה שלי. היא לא עונה על שאלות ותמיד שוכחת איזה שפה היא מלמדת ומתבלבלת בין פייתון לשפות אחרות. היא מרצה לא טובה אבל חייבים ללכת להרצאות כי אי אפשר להבין לבד מהמצגת.\nשם המתרגל/ת: דור מירן\nחוות דעת - תרגולים: \nדור הוא מתרגל מושלם וטוב. לכו אליו. אכפת לו מהסטודנטים והוא נשאר חבר שלכם אחרי המבחן ואחרי הקורס. עונה על מה שתרצו ועל כל השאלות שיש. נותן טיפים, מתעניין בכם והיה לי מעולה וכיף איתו. דור מסביר נהדר והוא פשוט מקסים.\nשעורי הבית:\nהשיעורי בית היו בושה וחרפה. אופן הגשת השיעורים הוא תהליך בפני עצמו אז תכינו את עצמכם לעצבים. ושיעורי הבית עצמם הם קשים מנשוא ונראה כאילו חושבים שאנחנו סיימנו תואר במדמח. הגשת השיעורים היא די מסובכת אז לכו בשבוע הראשון לשעת קבלה ושיעבירו לכם אחד על אחד איך להגיש. יש הרבה שיעורים וזה לוקח ימים שלמים אז עדיף לכם לעשות בסופש.\n\nהמבחן: \nהמבחן עם שאלת רקורסיה אחת. תתאמנו על זה.\nהשורה התחתונה:\nהקורס הכי גרוע והכי לא מהנה שיש. אתם צריכים לעבור אותו וזהו. הרבה דמעות נשפכו בגלל השיעורים בקורס הזה.", "timestamp": 1644962090568}, {"author": "ג", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: באמצע הסמסטר הפסקתי ללכת להרצאות כי הן ממש מיותרות במיוחד שבתרגול חוזרים אחד לאחד על ההרצאה, בנוסף יעל לא הסבירה בצורה הכי ברורה והרבה פעמים הסתבכה עם המצגת\n\nשם המתרגל/ת: דוד ולנסי\nחוות דעת - תרגולים: זה היה הקורס הראשון שלו וזה מאוד הורגש, היה חלקים שפחות חשובים שהוא נתקע עליהם ולפעמים היה משעמם, לפחות מאמצע הסמסטר היינו קבוצה קטנה ככה שהיה יותר קל לו לענות על שאלות\n\nשעורי הבית: ה- 3 הראשונים קלים מדי וה- 4 האחרונים קשים פי 200 ולמי שאין רקע בתכנות ולא הכי הבין את החומר יכול להתקע שעות על כל שורת קוד, גם למי שיש רקע עדיין נתקע\n\nהמבחן: אותו מבנה מאז הסמסטר הראשון בחורף 2020 ויש חלקים קצת יותר קשים אבל הוא יחסית הוגן\n\nהשורה התחתונה: לנסות לא לאבד בקורס כי הוא קורס חובה ואין ברירה אלא להשלים אותו", "timestamp": 1645541919139}, {"author": "Saar Levy", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שעורי הבית: אם למדתם כבר לתכנת בעבר אז יחסית פשוטים. לא הכי קשורים למה שלומדים בכיתה.\n\nהמבחן: יותר קשה מרוב שיעורי הבית. לא לזלזל.\n\nהשורה התחתונה: קורס די גרוע לדעתי. מלמדים הרבה נושאים בצורה לא נכונה ומבלבלת. מי שלמד לתכנת בעבר עובר את הקורס בקלות מי שלא נשאר מאחור.", "timestamp": 1645606316581}, {"author": "יהיה בסדר", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ילנה/יעל\nחוות דעת - הרצאות: הייתי אצל שתיהן פעם-פעמיים והבנתי שזה לא בשבילי. משעמם בטירוף ומרגיש לא רלוונטי.\n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: אחלה גבר. מעביר את התרגולים בצורה עיניינית והומוריסטית יחסית. חבל שהשיעורי בית יחסית לתרגולים זה שמים וארץ.\n\nשעורי הבית: \nעינוי. מתחיל נחמד, והופך לבלתי נסבל בהמשך. שעות של שבירת ראש ועצבים על הדבר הכי קטן שיכול להיות, אבל אם תגיש תקבל אפס כי הבדיקה היא אוטומטית.\nלמרות שזאת משאבת זמן לא ממליץ להתחיל את השיעורים מיד כשנותנים, כי כמעט תמיד נתנו הבהרות למטלה אפילו שבוע אחרי שנתנו אותה, ואז אתה צריך לחזור ולתקן את הקוד..\n\nהמבחן: \nהרגיש שדי בסדר אבל בסוף הממוצע היה מאוד נמוך וניתן פקטור של עשר נקודות. לדעתי המבחן יותר קל משיעורי הבית. לתרגל את המנגנונים של ההרצאות האחרונות ואת צורת החשיבה של מבחנים, לרוב זה חוזר על עצמו.\n\nהשורה התחתונה: \nגועל נפש של קורס. כמות הנקז באה לידי ביטוי בשיעורי הבית. מי שהיה לו רקע, או (מסיבה שלא ברורה לי) נהנה מתכנות ומהקורס, לרוב הצליח. אחרים לקחו מורה פרטי שיעשה להם את השיעורים, או נשענו חזק על חברים (גם לא מאוד אידאלי מהפחד שתקבל אפס על העתקה). לא התנהלות אידיאלית בקורס לטעמי. \nבקיצור, בהצלחה", "timestamp": 1645999699043}, {"author": "Yuv", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מרדימה \n\nשם המתרגל/ת:עדי \nחוות דעת - תרגולים: \nיותר חשובים מהרצאות אבל עדיין לא כל כך עוזר להבנה\nשעורי הבית: \nאם אין לכם רקע בתכנות כמוני זה בלתי אפשרי תחפשו מורה פרטי או חבר שיעזרו לכם\nהמבחן: \nקשה \nהשורה התחתונה: קורס סיוט הרצאות ו גם התרגולים לא עוזרים להבין איך לפתור מבחנים ו שיעורי בית אם אין לכם רקע בתכנות אז בהצלחה ..", "timestamp": 1646001256002}, {"author": "עומר", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מסבירה בסדר למי שיש קצת רקע, אך הרבה פעמים מתבלבלת עם שפת C, רוב הזמן די משעממת\n\nשם המתרגל/ת: דורון\nחוות דעת - תרגולים: מתרגל טוב, מסביר בצורה עניינית ועונה על שאלות, בנוסף הוא נותן לסטודנטים להציע פתרון לרוב השאלות\n\nשעורי הבית: מתחלקים ל-2, או שהם ממש קלים או שצריך לשבור את הראש שבוע בשביל טריק אחד שרצו לעשות. הבדיקה אוטומטית ולכן טעות הכי קטנה בפלט הסופי (ברמה של רווח מיותר בסוף) יכולה לפסול סעיף שלם. \n\nהמבחן: מועד א' היה קשה בהרבה משעורי הבית ולא הקציבו מספיק זמן כדי לפתור.\n\nהשורה התחתונה: יש הרבה הגבלות בקורס והצורה שמתכנתים בה רוב הזמן לא קשורה לאיך שמתכנתים מחוץ לקורס, ולכן הוא לא פרקטי למי שבסך הכל צריך ללמוד לתכנת ולא צריך ללמוד מדעי המחשב.", "timestamp": 1646032099331}, {"author": "*", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: הרבה אומרים שההרצאות מיותרות, אני אישית באתי בלי רקע בתכנות בכלל ודווקא יעל עזרה לי מאוד להבין את החומר, בלי ההרצאות התרגול היה הרבה פחות אפקטיבי עבורי. עונה על כל השאלות של הסטודנטים. \n\nשם המתרגל/ת: ספיר גרשוב\nחוות דעת - תרגולים: מתרגל מעולה, מצליח להעביר את החומר  בצורה מעניינת ומחדד נקודות חשובות, יודע על מה לשים דגש. יש דברים שמועברים בתרגול ולא מועברים בהרצאות, לשים לב.\n\nשעורי הבית: \nזוועה. הרבה יותר קשים מהדוגמאות שנותנים בהרצות ובתרגולים, מתחכמים, גוזלים זמן בצורה לא פרופורציונלית ומרגיש שבלתי אפשרי לעשות אותם לבד. שעות על גבי שעות של לשבור את הראש. מי שמצליח לעשות אותם לבד לדעתי יצליח בוודאות במבחן. \n\nהמבחן: \nלדעתי סה\"כ הוגן, מתמקד בדיוק בדברים שסגל הקורס בחר להדגיש לנו לקראת הסוף (או לפחות ספיר ויעל). הביאו פקטור של 10 נק'.\n\nהשורה התחתונה: \nמה שהופך את הקורס הזה לסיוט (לכל מי שלא למד תכנות מעולם) הם תרגילי הבית. אבל אי אפשר להגיד שהם לא מכינים למבחן....", "timestamp": 1646129509960}, {"author": "יונתן", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: דורון\nחוות דעת - תרגולים: הדבר הטוב היחיד שאפשר להגיד על הקורס הזה הוא שדורון מתרגל מעולה. לומדים יותר בתרגולים מאשר כל חלק אחר בקורס הזה.\n\nשעורי הבית: לא באמת עוזרים בתהליך הלימוד, מי שכתב אותם וחשב שאנשים שלא למדו פייתון או מכירים מישהו שיודע פייתון יצליחו אותם לבד קצת מנותק מהמציאות.\n\nהמבחן: ממש תלוי במי בודק לך אותו, יש בודקים שחושבים שאחרי 3 חודשים אנחנו אמורים להיות אשפי תכנות ולדעת לכתוב קודים מושלמים בפחות משעתיים וחצי, ויש בודקים יותר מציאותיים שיודעים שזה לא באמת החלק מתהליך כתיבת הקוד שצריך לבחון עליו. אז רק תתפללו שאתם נופלים על בודק שמחובר למציאות ולא חי בסרט.\n\nהשורה התחתונה: הפקולטה למדעי המחשב היא פקולטה נוראית מלאה באנשים שחושבים שכולם יודעים לתכנת מלידה כמוהם, אין יישור קו בין החומר שהם אמורים ללמד ובין החומר שהם בוחנים אותנו עליו. בנוסף האתר שלהם מזעזע ולא נוח עם שלבים מיותרים, שזה די אירוני כי הם פקולטה למדעי המחשב.\nבסופו של יום הציון בקורס תלוי רק במי שבודק לכם את המבחן.", "timestamp": 1646839030022}, {"author": "טל משיח", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלים למי שיודע לתכנת\n\nהמבחן: קל למי שיודע לתכנת\n\nהשורה התחתונה: מי שכבר למד שפת תכנות בעבר לא ירגיש כלום ולא יצטרך להשקיע בכלל, למי שלא למד שפת תכנות בעבר הקורס יהיה מאוד עמוס וקשה", "timestamp": 1647431146515}, {"author": "שחר", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: למדתי את כל הקורס מצנזור ביוטיוב\nחוות דעת - הרצאות: יוסי לא התעכב על דברים שלא הבנתי גם כשביקשתי ממנו\n\nשם המתרגל/ת: ויויאן/איריס\nחוות דעת - תרגולים: מעולות אכפתיות ומרגישים שחשוב להן שנבין את החומר\n\nשעורי הבית: עלו בצורה מסודרת סהכ , הגליונות מאד רלוונטיים הww קצת פחות\n\nהמבחן: המבחן היה לי קשה אבל גם החומר היה לי קשה\n\nהשורה התחתונה: בהצלחה", "timestamp": 1647798391115}, {"author": "Student", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "אם אתם בלי רקע ממליץ לעבור על זה :)\nשם המרצה: יעל\nחוות דעת - הרצאות: באלה שהייתי נרדמתי :)\n\nשם המתרגל/ת: עדי שמחי\nחוות דעת - תרגולים: \nלדעתי התרגולים יותר חשובים מהרצאות ו מלמדים  הטכניקות שם אבל עדיין זה לא מספיק בכלל לדעת איך לפתור תרגילי בית או מבחן עדי מתרגלת טובה ו אכפת לה מהסטודנטים לא נסיתי מתרגלים אחרים אבל ממליץ עליה\nשעורי הבית: זווווועת עולם אין סיכוי שתצליחו לבד אם אתם בלי רקע בתכנות תחפשו חבר או מורה פרטי שיעזרו לכם (הראשונים סבבה אבל אחר כך זה נהיה הרבה יותר קשה )\n\nהמבחן: \nמבחן מועד א היה מאוד מאוד קשה ו ממוצע נמוך ביחס לסמסטרים קודמים מועד ב לדעתי היה קצת יותר הוגן אבל גם לא קל\nהשורה התחתונה: קורס קשה מאוד למי שהגיע בלי שום רקע בתכנות בהתחלה לא הבנתי כלום אבל כשהתחלתי ללמוד למבחן לאט לאט זה הפך להיות יותר ברור אפילו כיף הבעייה היא שקשה מאוד ללמוד מהרצאות ו תרגולים איך להתמודד עם הקורס לכן אני ממליץ לכם לחפש מישהו שיעזור לכם במהלך הסמסטר או מורה פרטי", "timestamp": 1648077334754}, {"author": "אחד שיודע", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nילנה- מרצה טובה אם כי החומר של ההרצאות ניתן גם בתרגולים אז ההרצאות לדעתי לא חובה\n\nשם המתרגל/ת: \nעדי שמחי- אלופה, מעבירה את החומר בצורה מעניינת וכיפית.\n\nשעורי הבית: \nשיעורי בית מאתגרים אבל מלמדים הרבה, ממליץ לעשות.\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1659603308435}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: לא מרצה ואוו בכלל... אפשר לא לבוא אם יש הבנה קודמת של תכנות\n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: מתרגל מעולה, נותן דגשים טובים\n\nשעורי הבית: קשים מידי לעומת רמת המבחן\n\nהמבחן: קשה, יש כמעט תמיד פקטורים בשביל להגיע לממוצע 70 בערך\n\nהשורה התחתונה:", "timestamp": 1660592442809}, {"author": "ברוך שפטרנו", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ילנה נופברי \nחוות דעת - הרצאות: אין לי מושג, ברחתי אחרי ההרצאה הראשונה.\n\nשם המתרגל/ת: ספיר גרשוב\nחוות דעת - תרגולים: מתרגל מעולה, החרטה היחידה שלי היא שלא התחלתי ללכת לתרגולים מוקדם יותר במהלך הסמסטר.\nמעביר את החומר בצורה ממש ברורה ויחסית מעניינת.\n\nשעורי הבית: מתחיל פשוט ואחר כך זה מסתבך. לא תמיד ברורות הדרישות, מומלץ לפנות למתרגל הרלוונטי במייל לשאלות.\n\nהמבחן: יש במבחן שאלות קשות ושאלות יותר קלות. חשוב לשלוט באלגוריתם לחיפוש בינארי וברקרוסיה. מומלץ לתרגל את כל המבחנים שפורסמו ואם יש זמן לפתור את כל השאלות של מה יודפס פעמיים (גם בשאלות אלו מומלץ לפנות למתרגלים במייל). בסך הכל, אם לומדים כמו שצריך אפשר להוציא ציון יפה. כמעט תמיד יש פקטור, הממוצע מנורמל ל- 70.\n\nהשורה התחתונה: קורס סבבה שהיה יכול להיות הרבה יותר טוב אם ההרצאות היו מועברות כמו שצריך וההנחיות לתרגילי הבית היו ברורות.", "timestamp": 1661719491928}, {"author": "דרקון אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202103", "text": "שם המרצה:  ילנה\nחוות דעת - הרצאות: סהכ סבבה עדיף ללמוד לבד ומהתרגולים\n\nשם המתרגל/ת: גל יונה\nחוות דעת - תרגולים: מלך על ואכפתי, מסביר מעולה הלוואי יהיה גם בקורסי המשך\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1662015866839}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202103", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: היה הקלטות מהסמסטר הקודם, סה\"כ מאוד מדוייק למה שדורשים אחרי זה במבחן \n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים: ראיתי גם את ההקלטות, השיעורי בית מתבססים כמעט רק על התרגולים אז מאוד חשוב לראות שמבינים את החומר, החומר יכול להיות טיפה מבלבל למי שלא נגע בכלל בקוד לפני אבל התרגול מאוד עוזר לפשט את הדברים\n\nשעורי הבית: יכולים להיות מאוד קצרים או מאוד ארוכים, בעיקר מתבססים על החומר של התרגולים אבל מתחבאים הרבה טריקים שצריך לשים לב אליהם\n\nהמבחן:  החלק הראשון יחסית טריקי, דורש ידע די טוב של קריאת קוד אבל אחר כך זה הרבה יותר אלגורתמים ידועים ואם עולים על איזה מהם להשתמש זה כמעט העתק הדבק מהחומר\n\nהשורה התחתונה: אם אתם מגיעים בלי שראיתם בכלל קוד , לא קל בכלל דורש עבודה ועלול לשאוב הרבה זמן.  אם כבר הכרתם מה זה אלגוריתם חיפוש וריקורסיה לא נורא בכלל", "timestamp": 1663863228251}, {"author": "אנונימי אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202103", "text": "שם המרצה: יילנה\nחוות דעת - הרצאות: לא הגעתי, עברתי על המצגות וזה יותר ממספיק. אבל באופן כללי התנהלות עם יילנה סביב המבחן הייתה לא נעימה בכלל.\n\nשם המתרגל/ת: ספיר גרשוב\nחוות דעת - תרגולים: מעולה! מסביר בסבלנות ובפירוט, מאתגר את הסטודנטים ומאפשר להם זמן לחשוב. ובאופן כללי בנאדם מאוד נעים. נעזרתי גם בהקלטות של אורן אלמקיס שהיו מעולות. \n\nשעורי הבית: רובם סבירים, אך דורשים זמן והשקעה. בסמסטר קיץ היו סך הכל 7 תרגילי בית כולל ת.ב 0. התרגיל האחרון ברקורסיה היה מחריד. 2/3 מהקורס לא הגישו.\n\nהמבחן: לא קל אבל חוזר על עצמו יחסית. חשוב לדעת חיפוש בינארי ולהבין טוב עבודה עם רשימות.\n\nהשורה התחתונה:האתגר העיקרי בקורס הוא הוא הבנת החשיבה ואיך לדבר עם מחשב, השפה עצמה פשוטה.\n בתור מישהו שעשה לפני 7 שנים בגרות 5 יח\"ל מדמ\"ח ומאז לא נגע בכלל בתכנות הקורס היה יחסית נחמד ומעניין ולא קשה מדי. ככה שאם יש רקע כלשהו אתם תהיו בסדר כי הקורס עוסק בדברים הבסיסיים ביותר של תכנות.", "timestamp": 1665325585947}, {"author": "iGGor", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר ילנה נופברי\nחוות דעת - הרצאות: לא כל כך גרוע כמו שמתארים פה בסמסטרים קודמים. לא היה וואו כי זה קורס מאוד טכני והכל מאוד חוזר על עצמו, מי שיש לו ידע בסיסי בתכנות יכול לישון עד הרצאה 8 לפחות כי יש דרישות מאוד ספציפיות לגבי פתרון תרגילים. זה לא שילנה מרצה גרועה, הקורס עצמו די פח ולמי שלומד תואר מדעי (לא מתמטיקה או מדמח) הוא מאוד מיותר.\n\nשם המתרגל/ת: מיכאל טוקר\nאחלה בנאדם, מעביר את התרגולים מאוד בצ'יל ובאמת זאת לא אשמתו שמכריחים אותו לקרוא מילה במילה מהמצגת. מסביר טוב מאוד ועונה לשאלות, אפילו נותן זמן לפתור תרגילים בצורה עצמית ואז בודקים ביחד.\n\nחוות דעת - תרגולים: מאוד דומים להרצאות. בהרצאות ילנה מביאה מלא דוגמאות, גם ממבחנים, אז זה לא משנה הרבה אם ללכת להרצאה או לתרגול, זה בערך אותו הדבר בקורס כי זה קורס מאוד טכני.\n\nשעורי הבית: 7 תרגילי בית (0 עד 6) שעולים ברמה. ת\"ב 0 עד 3 בדיחה בעיקרון ואז הרמה עולה משמעותית. למשל ת\"ב 5 לקח לי אישית איזה שבוע בין היתר כי יש המון הגבלות ואסור להשתמש בחצי מהפונקציות או השיטות האפשריות. תרגיל בית 6 בדיחה.\n\nהמבחן: עדיין לא היה אבל ממבחני עבר נראה שהמבחן ברמה הרבה יותר נמוכה משיעורי הבית או מחלק מהדוגמאות בקורס. מה שכן המבחן בכתב מה שדי אירוני בגלל שרוב הקורס ממוחשב...\n\nהשורה התחתונה: לא קורס מומלץ אבל 4 נקז לקורס של 2.5 ומי שיש לו ידע בתכנות יכול להוציא 90+ בלי להתאמץ.", "timestamp": 1673974328573}, {"author": "מישל", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:\n\nשם המתרגל/ת: ספיר גרשוב\nחוות דעת - תרגולים: ספיר מעולה, למדתי את החומר מהתרגולים שלו. הוא נותן זמן לחשוב לבד על שאלות לפני שהוא מציג פתרון. \n\nשעורי הבית: ארוכים מאוד אבל יחסית קלים למי שבא עם ידע מהתיכון. לסגל יש נטייה לשנות את ההנחיות של שיעורי הבית ממש לפני ההגשה אז לשים לב.\n\nהמבחן: \n\nהשורה התחתונה: אם לא חייבים לקחת אותו - עדיף ללמוד פייתון מהאינטרנט.", "timestamp": 1675623106155}, {"author": "hello dolly", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: ההרצאות קצת מיותרות, אך אין זה אומר שילנה לא טובה. פשוט רוב החומר מרוכז במצגות ואין שום חידוש משמעותי בהרצאות.\n\nשם המתרגל/ת: אורן אלמקיס\nחוות דעת - תרגולים: המתרגל מהטובים שיש לטכניון, נחמד מאוד ורואים שאכפת לו. תמיד לפני התרגולים היה מספר על הדוקטורט שלו, שואל לשלומנו (ובאמת מתעניין) ועוזר בשאלות במידת הצורך. כמובן שגם התרגולים עברו מעולה והוא היה מביא דוגמאות מעבר למצגות. תלכו אליו.\n\nשעורי הבית: מעצבנים קצת, כמה פעמים שינו הנחיות. למשל התירו להשתמש בפונקציה מסוימת ולאחר מכן הוציאו הודעה שאסור. לימדו אותנו פונקציות מסוימות ואז פתאום אי אפשר להשתמש.\n\nהמבחן: עוד לא הגיע.\n\nהשורה התחתונה: אני לא חובב תכנות גדול ובטח שחוסר הסדר עם שיעורי הבית לא הוסיף.", "timestamp": 1676195920038}, {"author": "Anonymous", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nמשעממת ומסבירה כאילו היא עושה טובה\nשם המתרגל/ת: אורן/יארא\nחוות דעת - תרגולים: \nשניהם מצוינים \nשעורי הבית: \nלא קלים\nהמבחן: \n\nהשורה התחתונה: קורס לא קל לחסרי רקע", "timestamp": 1676401049489}, {"author": "אביעד בר שי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  ילנה נופברי\nחוות דעת - הרצאות: בגדול מסבירה טוב את החומר אבל קצת רצה במקומות שהיה צריך להתעכב יותר (בעיקר לקראת סוף הקורס) וההרצאות עוברות בצורה מאוד מונוטונית אז צריך להחזיק ראש טוב טוב אצלה.\nמה שכן אני לא ממליץ לוותר על ההרצאות כי יש שם הרבה דגשים קטנים לגבי אופן הפעולה של קודים ויהיה קשה להשלים את זה לבד אפילו אם הולכים לתרגולים\n\nשם המתרגל/ת: יארה סמסום\nחוות דעת - תרגולים: מתרגלת מעולה. ניהול זמנים מצוין והסברים מובנים\n\nשעורי הבית: לא מעט עבודה. מאוד מציק שלפעמים מגיעות הוראות חדשות זמן מאוד קצר לפני שההגשה נסגרת. אבל אם אתם נהנים מחידות היגיון הם יכולים להיות גם די כיפיים (עד שצריך לכתוב את האלגוריתם כקוד)\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676564734464}, {"author": "נופר", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ילנה נופרברי\nחוות דעת - הרצאות: אני לא הלכתי להרצאות. התרגולים די מכסים את החומר שצריך לדעת. אבל מי שיודע שקשה לו בשפות תכנות ממליצה ללכת בשביל לחזור על החומר\n\nשם המתרגל/ת: אמיתי יותם\nחוות דעת - תרגולים: מתרגל מאוד נעים אבל לא ממליצה, מקריא מהמצגת, הסברים לא מובנים מספיק. ספיר מאוד מומלץ\n\nשעורי הבית: לוקחים המון זמן, וצריך לשים לב לדקויות, מאוד כדאי לשבת עם עוד אנשים ולהיעזר בהם, מאוד קשה לפתור לבד. בתור אחת שאין לה ניסיון בתכנות בכלל, זה לא היה כזה נורא. סה\"כ 15% תקף\n\nהמבחן: קשה, מרגיש שאין מספיק זמן לענות על כל השאלות. את הציון הסופי דואגים תמיד לנרמל ל70-75 אז לפעמים יש פקטור\nצריך להיות חזקים לקראת המבחן בחיפוש בינארי וריקורסיה, לומדים אותם רק בתרגולים האחרונים ואין מספיק תרגול.\n\nהשורה התחתונה:  מאוד נהניתי מהקורס וחשוב להשקיע בו, לא קל למי שאין ניסיון בשפת תכנות", "timestamp": 1677330547566}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nמסבירה לאט ועוברת על הכל אבל לי אישית היה קשה מאוד להישאר ערה בהרצאות שלה. היא מאוד מונוטונית ומשתמשת בעיקר במצגות, ככה שההרצאות לא תמיד יותר מדי עוזרות.\n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים: \nמהיר אבל עובר על כל החומר בצורה ממש טובה. לא מסתמך על המצגת אלא מסביר את כל שלבי הפתרון, משתף את הכיתה וגם מראה את כל התהליך של הכתיבה (וכמובן שהקוד עובד והכל רץ). מאוד עזר לי להבין את החומר במהלך הקורס.\n\nשעורי הבית: \nזוועה, באמת. מי שאין לו רקע בתכנות, ממליצה למצוא עזרה כי בלתי אפשרי לעשות אותם לבד. התרגילים הראשונים קלים ואחריהם יש קפיצת מדרגה מטורפת, שעות שלמות של לשבת ולשבור את הראש ולנסות להבין מה לא עובד. מעבר לזה שזה סיוט אחד גדול, סגל הקורס נוטה להוציא הנחיות חדשות בדקה ה-90 ואז צריך לשנות את הקוד ולהגיש שוב. תענוג אמיתי.\n\nהמבחן: \nקשה וארוך. מומלץ בחום לשלוט בחיפוש בינרי, סיבוכיות ורקורסיה בצורה מעולה כי זה מופיע בכל מבחן ובמבחן האחרון גם היווה את רוב הנקודות. הציונים היו נמוכים, נתנו פקטור- והם עדיין נשארו נמוכים יותר ביחס לסמסטרים קודמים.\n\nהשורה התחתונה: \nחבל שזה קורס חובה. הקורס מועבר בצורה מאוד לא טובה, הוא דורש המון המון השקעה במהלך הסמסטר והרבה תסכול שמתלווה לזה. נחמד אולי למי שיש לו רקע בתכנות, אבל למי שאין- בהצלחה.", "timestamp": 1677664921300}, {"author": "רועי חיון", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נופברי ילנה\nחוות דעת - הרצאות: הרצאות דיי מונוטוניות אך מקיפות את רוב החומר. הבעיה שברקורסיה ההרצאה לא משהו וקשה מאוד להבין איך לפתור רקורסיה. לראות סרטונים ביוטיוב בנושא הזה הכי עזר לי.\n\nשם המתרגל/ת: מיטל בוזן\nחוות דעת - תרגולים: היינו הקורס הראשון שלה ובגדול היא הייתה ממש אחלה. ענתה על שאלות ותמיד ניסתה לעזור.\nכשהיינו מסיימים מצגת גם היינו מסיימים ככה שלפעמים היו יוצא שעה חופשית :)\n\n\nשעורי הבית: מדכאים עד מאוד. שורפים המון זמן שלא תמיד יש וגם קשה מאוד להבין איפה הטעות. מה שכן עדיף לעשות לבד ולהבין כי זה הבסיס למבחן.\n\nהמבחן: המבחן היה קשה ברמות ביחס לשנים קודמות אך יצא פקטור דיי הוגן. בגדול המבחן בכל סמסטר חוזר על רקורסיה, סיבוכיות, ולדעת פלט של מה יודפס. חוץ מלדעת מה יודפס כל התרגילים הם על אותו רעיון של מה שלומדים בכיתה פשוט צריך קצת לפרמל את זה ככה שיענה על התשובה במבחן. \n\nהשורה התחתונה:", "timestamp": 1677748000300}, {"author": "😭", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: הרצאות מאוד משעממות\n\nשם המתרגל/ת: יארה\nחוות דעת - תרגולים: יארה מצוינת\n\nשעורי הבית: קשים בטירוף!\n\nהמבחן: סיוט!\n\nהשורה התחתונה: לדעתי עדיף ללמוד לבד, ואם יש אפשרות עדיף להתחיל ללמוד לפני תחילת הסמסטר.", "timestamp": 1678168889567}, {"author": "..", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: בסדר סך הכל. לא יכולה להגיד שהיה מעניין ולא יודעת עד כמה הן הוסיפו לי להבנה, אבל סך הכל סבבה\n\nשם המתרגל/ת: מארווה\nחוות דעת - תרגולים: מתרגלת מצוינת, יודעת להסביר טוב את החומר. לצערי היינו קבוצת תרגול ממש גדולה, ואני חושבת שזה קצת מוריד מערך התרגול. אני חושבת שזה קורס שמומלץ אם אפשרי לתרגל בו בקבוצה קטנה, וככה אפשר להיות יותר פעילים בפתירת התרגולים בתרגול ולוודא הבנה.\n\nשעורי הבית: אני אתחיל ואגיד שבאתי לקורס ללא ידע בתכנות, אבל עם הבנה כללית של איך תכנות עובד והיכרות עם כמה פונקציות של פייתון. שיעורי הבית היו ממש סבבה מבחינתי. יש סה\"כ 6 תרגילים (+תרגול היכרות שהוא ממש בדיחה) שמתפרסמים פעם בשבועיים. התרגילים הראשונים קלילים (לקח לי גג שעתיים לפתור) והתרגילים בהמשך הקורס קצת יותר כבדים, אבל למי שמתמצא בחומר של הקורס אמור להיות סבבה (חושבת שהכי הרבה שלקח לי לשיעורי בית זה חמש-שש שעות).\n\nהמבחן: לא קל, אבל זה לא בלתי אפשרי להוציא ציון טוב אם הצלחתם בשיעורי בית. המבחן מורכב מארבע שאלות. תמיד יש שאלת \"מה יודפס\" שהן שאלות מאוד טריקיות (לעקוב אחרי קטע קוד ולהבין מה יודפס בסוף הריצה שלו) ושאלת רקורסיה. בדרך כלל באחת מהשאלות הנוספות יש אלמנט של חיפוש בינארי, אז חשוב להבין את האלגוריתם לעומק ולשלוט בו. ממש ממש חשוב לפתור הרבה מבחני עבר כדי לתרגל את סגנון השאלות של המבחן.\nכמעט תמיד יש למבחן פקטור גדול (אצלנו היה של 13 נקודות) כדי לנרמל את הממוצע (כי יש גם לא מעט אנשים שלא הולך להם הכי טוב בקורס). בזכות הפקטור, אם הלך לכם טוב במהלך הקורס לא מופרך שתסיימו אותו עם ציון של 100.\n\nהשורה התחתונה: מבחינתי היה קורס יחסית קליל, ואחלה להעלאת הממוצע. מנגד, יש הרבה אנשים שמתקשים בו מאוד.", "timestamp": 1678265677796}, {"author": "אא", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: הגעתי להרצאות שלה לתפוס תנומה ולהתרענן לקראת יום ארוך. המונוטוניות בהחלט הרגע את הסקרנות \n\nשם המתרגל/ת: רני \nחוות דעת - תרגולים: מותק, מסביר ברור ולעניין  \n\nשעורי הבית: לא פרופורציונאליים לנלמד בתרגולים והרצאות. למדתם לעשות הדפסה למסך וחשבון בסיסי? מעולה - תפרצו לפנטגון, ההגשה היא עד מחר. \nמזל שיש צ'ט gpt\n\nהמבחן: אם חשבתם ששיעורי הבית לא הוגנים חכו שתגיעו למבחן. מזל שכתבתי את התעודת זהות שלי כמו שצריך אחרת היו מורידים לי גם על זה את מירב הנקודות. אין הגיון בלכתוב קוד על נייר בציפייה שהוא ירוץ כמו שצריך על מחשב. מבוא למחשב שפת פייתון כשהציפייה ממך שאתה תהיה המתרגל הבא. \n\nהשורה התחתונה:", "timestamp": 1678389307420}, {"author": "Eli", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nהלכתי לכל ההרצאות בעיקר בשביל לשמוע את המושגים פעם ראשונה\nשם המתרגל/ת: מועלם מרוה\nחוות דעת - תרגולים: \nמאוד נחמדה ועוזרת, לא תמיד יודעת לענות על הכל. למדתי יותר פה מאשר בהרצאות אבל באופן כללי לא הרגשתי שהסגל של הקורס מלמד אותו טוב\nשעורי הבית: \nהראשונים ממש בסדר אבל ככל שהתקדם זה היו דברים ברמה הרבה יותר גבוהה מההרצאות והתרגולים, צריך להשקיע הרבה זמן ומחשבה בפיתרון\nהמבחן: \nדומה לשנים קודמות אבל קשה\nהשורה התחתונה:", "timestamp": 1678787664934}, {"author": "בן", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:   מלמדים פונקציות ספציפיות בהרצאות שלא מופיעות בתרגולים שחשובות למבחן.\nתכלס אפשר למצוא רשימה שלהם ואז ההרצאות מיותרות לגמרי. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  חשוב מאוד לתרגל כתיבה והרצה של קוד על מנת להשתפר, תרגולים זה אחלה סביבה לעשות את זה.\n\nשעורי הבית: \nלוקח יותר זמן לבדוק את התשובות עם המערכת שלהם מאשר לפתור את השאלות אבל לדעתי הש.ב הם מה שבאמת מלמדים אותך לתכנת.\n\nהמבחן: \nאם הבנת רקורסיה ואיך ליישם חיפוש בינארי עברת את המבחן.\nמטלטל אבל לרב יש פקטור של 10+ נקודות\n\nהשורה התחתונה: התרגול סבבה למי שחדש אבל בסופו של דבר צריך לשבת ולתכנת על מנת להבין ולהשתפר", "timestamp": 1678882957528}, {"author": "gil blank", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל ארז\n\nשם המתרגל/ת: ע'אני\nחוות דעת - תרגולים: מתרגל מקסים. מדבר בשקט וברוגע. מסביר כל דבר גם פעמיים ושלוש בדרכים שונות אם חלקנו לא הבנו.\n\nשעורי הבית: הוגנים. לוקחים בהתחלה 10-15 דקות ובסוף שעתיים.\n\nהמבחן: מאוד לא הוגן, הבדיקה לא שוויונית", "timestamp": 1678960040760}, {"author": "פאקטור", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות:  מיותרות\nאלא אם כן, בא לכם להשלים קצת שעות שינה על כיסאות ממש נוחים\n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: בן אדם נחמד ממש, אני אישית הייתי זוועת עולם בפייתון אז הוא לא הועיל לי בכלום :(((((((((((\n\nשעורי הבית: CHAT GPT \nלא לשרוף על זה שעות וימים, הם לא קשורים למבחן בשום צורה\n\nהמבחן: קשהההההההה, כלום זמן. מנרמלים לכיוון ה70-75.\n\nהשורה התחתונה: אם אתם קוראים את ההמלצה הזאת לפני שכף רגלכם דרכה בטכניון - תעשו לעצמכם טובה ותרכשו רקע בפייתון. ה50 שקל שתשימו על קורס בUDEMY יחסכו לכם כל כך הרבה דמעות ותסכול. הקורס מלומד בצורה מחפירה בטכניון, מצגות לא מוצלחות ומעט מאוד רצון לגרום לנו להצליח. מי שבא בלי רקע בתכנות (כמוני) עומד לסבול. הוראות אלו נכתבו בדם :(", "timestamp": 1678998987420}, {"author": "tbu", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: ממש לא\n\nהשורה התחתונה: פשוט לא.", "timestamp": 1679328003884}, {"author": "יוחאי יהב", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: יעל מעולה\n\nשם המתרגל/ת: ננ\nחוות דעת - תרגולים: מתרגלים מעולים אבל הבנייה של התרגולים פחות \n\nשעורי הבית: בסדר גמור\n\nהמבחן: בסדר גמור\n\nהשורה התחתונה:", "timestamp": 1679345556062}, {"author": "matan arad", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ילנה?\nחוות דעת - הרצאות: נורא ואיום הפבקתי לבוא\n\nשם המתרגל/ת: דוד\nחוות דעת - תרגולים: נחמד אבל גם לשם הפסקתי לבוא היה קצת לא ברור\n\nשעורי הבית: קשים \n\nהמבחן: לא פשוט אבל אפשר להצליח\n\nהשורה התחתונה: קורס קצת מעצבן", "timestamp": 1679497604181}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: חיים\nחוות דעת - הרצאות: מאוד מבולגן, לא מצליח הרבה פעמים להסביר את עצמו או לענות על מה ששואלים.\n\nשם המתרגל/ת: דוד\nחוות דעת - תרגולים: מאוד נחמד, אבל לא ממש יודע להסביר את החומר או למה דברים קורים באופן הזה\n\nשעורי הבית: בהתחלה קלים מאוד ואחרי כמה שבועות יש קפיצת מדרגה והם יכולים להיות מטחנת זמן לא קטנה. הייתי ממליצה לכתוב את הכתוב לבד ואם לא עובד לבדוק בchat gpt כדי לא לבזבז זמן. הרבה פעמים הוראות תרגילי הבית שונו כמה ימים לפני ההגשה- מאוד מאוד מתסכל אז תבדקו..\n\nהמבחן: מועד א' היה קשה אך קצת מעבר לרמות בשנים הקודמות, לעומת זאת מועד ב' הייתה שחיטה רצינית-שאלות שלא נראו מעולם.\n\nהשורה התחתונה: קורס פשוט רק למי שיש לו רקע, סגל קורס שלא מתחשב ושם מקלות בגלגלים. מעבר לזה ציפייה לא הגיונית שקוד שנכתב על דף יעבוד כשיש 3 קודים בדר\"כ לכתוב בשעתיים.קורס מנוהל גרוע ממש ממש חבל", "timestamp": 1679764343189}, {"author": "דנא פולימרז דלתא", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: למדתי יותר מהתרגולים\nשם המתרגל/ת: מרוה\nחוות דעת - תרגולים: נקודת אור יחידה בקורס, תמיד עונה לשאלות שלא ברורות ותמיד עם גישה נעימה, שולטת בחומר.. קיצור מומלצת!\n\nשעורי הבית: ז ו ו ע ה !!!!  עד שב 3 הכל טוב החל משם- פשוט מזעזע, אתם תמצאו את עצמכם יושבים ימים שלמים על הדבר הזה. תנסו למצוא מישהו ששולט בתכנות כי למי שאין רקע זה פשוט סיוט לא נורמלי.\n\nהמבחן: הפרדוקס הכי גדול. אל תאמינו לממוצע! זה שהממוצע כל שנה הוא 74-76 זה לא על דרך מקרה. הממוצע מהונדס עם פקטור ענק שנותנים כל מבחן אחרי שהממוצעים הרצפה. בשני המבחנים (שהיו זוועה, ומועד ב היה הרבה יותר קשה) ממוצע המבחן היה נכשל\n\nהשורה התחתונה: ברוך שפטרנו מעונשו של זה!!!!!! שיהיה לכם בהצלחה", "timestamp": 1680010293372}, {"author": "המלך", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: אין לי שום ידע קודם בתכנות, סולד מהנושא! לא הלכתי לאף הרצאה מעולם, פשוט בזבוז זמן, בתרגול חוזרים על הכל עם דוגמות.\n\nשם המתרגל/ת: מיטל בוז’ן\nחוות דעת - תרגולים: חמודה, אנרגטית. מעט מבולבלת עם עצמה, אבל מאוד מאוד בעדניקית.\n\nשעורי הבית: סופר קריטיים להבנה של החומר. יכולים להיות מאוד מתסכלים למי שמתקשה.\n\nהמבחן:קשה מאוד, מורידים נק בלי למצמץ פעמיים. \n\nהשורה התחתונה: נחמד", "timestamp": 1680166245828}, {"author": "ריקורסיה", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורז יעל\nחוות דעת - הרצאות: בזבזוז זמן,הלכתי רק בגלל להרגיש טוב עם עצמי אבל תכלס היא לא מסבירה טוב,חוץ מההתנהדות הלא נעימה שלה עם הסטודינטים\n\nשם המתרגל/ת: אורן\nחוות דעת - תרגולים: \nלא הכי מושלם שיש אבל סבבה\nשעורי הבית: \nקשוחים ברמות נעזרתי בחבר שעזר לי לפתור\nהמבחן: \nמועד א היה קשה ברמות מועד ב הייה בלתי פתיר ממש,מרגיש לי שהצוות בכוונה רוצה להכשיל את הסטודינטים,גם ככה הסטודינטים שלומדים את הקורס לא נדרשים להגיע לרמת התכנות שבמבחנים,אני ממש לא יודעת למה צוות הקורס מתנהגים ככה.בושה\nהשורה התחתונה: קורס סיוט אני סבלתי מהקורס הזה במהלך הסמסטר והייתי כל הזמן עוקבת ,נכון שעברתי אבל הציון בכלל לא משקף את ההשקעה שלי במהלך הסמסטר", "timestamp": 1680430805719}, {"author": "הילה", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: הגעתי לכולן, הרגשתי שזה נתן לי בסיס והכנה טובה מאוד לקראת התרגולים, אני כן ממליצה להגיע\n\nשם המתרגל/ת: ספיר המלך \nחוות דעת - תרגולים: כאמור, מלך, הוא גם כותב את המצגות וחלק מהמבחנים וכל טיפ שהוא אומר- קחו לתשומת ליבכם . גם אם התרגול שלו לא בשעה הכי נוחה לכם- תשקיעו ותגיעו, הוא באמת הטוב ביותר\n\nשעורי הבית: לא קלים בכלל, דורשים לפחות יום השקעה\n\nהמבחן: תלוי במצב רוח של מי שכתב אותו, שלנו היה מזעזע ובדיקה לא מקלה בכלל, ממליצה לטחון כמה שיותר מבחנים\n\nהשורה התחתונה:", "timestamp": 1681982154799}, {"author": "Dominvs Von Magnvs", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ד\"ר ילנה נופברי \nחוות דעת - הרצאות: לא הכי מועילות ואנרגטיות. הסגל פשוט לוקח חומר שאפשר ללמוד ביוטיוב במקסימום 5 שעות ומורח על סמסטר שלם, עם תוספת של דברים לא הכי שימושיים.\n\nשם המתרגל/ת: מיכאל\nחוות דעת - תרגולים: מתרגל שנה ראשונה בקורס אבל ממש מצוין. בדיעבד אולי היה עדיף ללכת רק לתרגולים כי המתרגלים בקורס מלמדים את אותו החומר שבהרצאה רק עם דוגמאות שימושיות ומובנות וגם הרבה יותר נחמדים מהסגל. אגב שאפו למיכאל ספציפית שהכין את תרגיל הבית האחרון שהיה קליל ועזר לנו לסיים את הקורס בהרגשה טובה.\n\nשעורי הבית: 6 גיליונות. 1 ו-2 בדיחה, 3-4 משמעותית יותר קשים, 5 מרגיש כמו פרויקט גמר ו-6 היה בדיחה.\n\nהמבחן: במועד א יצאתי בתחושה של 80, בסוף גירדתי את ה-60. אבל נתנו 13 נקודות פקטור לציון הסופי בתור כיסוי תחת (לא רוצים לבייש את הסגל). הבדיקה יותר קשוחה מחדו\"א של אלון ורוב השאלות לא משקפות את הרמה שלך בהבנת הקורס, שכן גם אנשים עם 10 שנות ותק בתכנות לא יעברו את המבחן עם מעל ל-80. ממש מגבילים אותך מלהשתמש ברוב החומר שנלמד בקורס, כולל פקודות בסיסיות כמו INT.\nלמועד ב לא הלכתי אבל היה פשוט מרחץ דמים ממה שהבנתי.\n\nהשורה התחתונה: קורס פח, לקחת בסמסטרים מתקדמים אם אפשר, אבל לא ממש בסמסטר האחרון כי הסיכוי להיכשל גבוה יחסית. רק אם יחליפו את הסגל עדיף ללכת.", "timestamp": 1682596159959}, {"author": "Sofa Latash", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: הרצאות ברורות עם מלא דוגמאות פרקטיות\n\nשעורי הבית: תרגילים ממש עוזרים להרגיש את החומר ולהתקונן למבחן\n\nהמבחן: לא קל מאוד, אבל גם לא קשה\n\nהשורה התחתונה: קורס כיפי, יהיה טיפה קשה לאלה שלא למדו תכנות אף פעם", "timestamp": 1688918652531}, {"author": "ה", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: הייתי בכולן, אני חושבת שזה עזר להבין את התרגולים טוב יותר ובגדול אני ממליצה דווקא כן להגיע להרצאה \n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: מלך אמיתי, ספיר הוא אחד המתרגלים הכי טובים שפגשתי, התרגולים שלו עוברים מהר, מעניינים והוא פשוט מעביר את החומר טוב . מה שכן רב הסיכויים שתצאו מהתרגול בהרגשה מעולה שהבנתם הכל ואז בשיעורי בית תבינו שאתם לא מבינים כלום . זה בסדר\n\nשעורי הבית: קשים, אני ישבתי עליהם המון זמן כל פעם כדי לפצח כל פעם את \"הטריק\" התורן, חשבתי שזה יעזור לי במבחן הסופי .. זה לא .\n\nהמבחן: היה קשה מאוד, ממוצע נמוך מבדרך כלל, הבעיה העיקרית הייתה שברגע שהשורת קוד הראשונה שלך לא הייתה נכונה הם פשוט הפסיקו לקרוא ונתנו 0 .. היה מאוד קשה, עברתי על הקשקש ולא העזתי לגשת למועד ב (וטוב שכך)\n\nהשורה התחתונה: אחלה קורס, מבחן פחות", "timestamp": 1689425741530}, {"author": "A", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: לא הייתי (טעות חמורה ביותררר)\nאם אין לכם רקע בתכנות, וגם אם יש לכם תלכו! \n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: מעביר את המצגת של התרגולים בצורה נהדרת.\n\nשעורי הבית: ארוכים ברמות ולא שווים את הזמן, כל מה שמופיע בשב לא קשור בכלל למבחן.\n\nהמבחן: מועד א היה קשה (כאלה שמתכנתים בפייתון שנים נכשלו) ומועד ב היה בלתי פתיר בעליל. הרגיש שזרקו עלינו וכשפנינו לסגל בשם כל הסטודנטים פשוט *סיננו* אותנו.\n\nהשורה התחתונה: עכשיו למי שאומר שהקורס קליל, די . בקיצור, למי שתכנת בעברו הקורס סביל ולמי שאין עבר בזה (כמוני) הקורס היה זוועה! מעבירים חומר במצגות, ומבחן שלא משקף את מה שהועבר בתרגול או בכלל. ממליצה בחום לקחת איזה קורס לפני הטכניון או מורה פרטי או וואטאבר, העיקר לעבור.", "timestamp": 1689808440870}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: הקלטות של יעל \nחוות דעת - הרצאות: האמת שרוב הסמסטר לא ראיתי את ההרצאות והלכתי רק לתרגולים, בדיעבד מהרצאה 9 בערך כן חשוב לראות. אבל יש הקלטות של יעל שהיא מעולה אז לא יודעת אם הייתי הולכת פרונטלי. \n\nשם המתרגל/ת: מרווה \nחוות דעת - תרגולים: אחלה מתרגלת, עוברת כל הדגשים ומאוד נעימה, מסבירה טוב, טיפה מונוטונית. \n\nשעורי הבית: גליונות שיעורי בית די מציקים שלוקחים הרבה זמן אם אין לך מישהו צמוד שיעזור (שיודע תכנות ומבין טוב). פשוט לא להישבר נפשית ולהיעזר בכל מי שאפשר.  \n\nהמבחן: המבחן היה הוגן ביחס לשנים אחרות, ניתן פקטור של 6 נק. ממליצה פשוט לטחון מבחנים כי זה בסוף די חוזר על עצמו. \n\nהשורה התחתונה: קורס מעייף נפשית. די עמוס ומעצבן, החומר בתרגולים ובהרצאות לא עוזר לפתירת שיעורי הבית. פשוט תשרדו אותו כי אני מניחה שהוא חובה לכל מי שהולך אליו.", "timestamp": 1691483347227}, {"author": "מיכאל חזן", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא הייתי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nקראתי רק את המצגות של התרגולים והספיק\nשעורי הבית: \nהעומס של התרגילים עולה במהלך הסמסטר\nהמבחן: \nלפי תבנית חזרתית. \nהמבחן על נייר...\nהשורה התחתונה:", "timestamp": 1691613193758}, {"author": "Hanoch Egyes", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nילנה\nחוות דעת - הרצאות: \nבעיקר מקריאה מהמצגת אבל לפעמים יש דברים שאין במצגת ושווה לשמוע\nשם המתרגל/ת: יארא/מרוא \nחוות דעת - תרגולים: \nשתיהן מאוד טובות\nשעורי הבית: \nהראשונים קלים אבל נהיה מאוד קשה\nהמבחן: \nמאתגר\nהשורה התחתונה:", "timestamp": 1692084728776}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: לפעמים המרצה אומרת דברים חשובים ועל מה להדגיש לכן ממליצה להיות בהרצאות לפחות בהרצאות האחרונות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אני ממליצה לצפות במוקלט של יארא זה מספיק וממש מובן\n\nשעורי הבית: שיעורי הבית קשים לוקח הרבה זמן במיוחד תרגיל בית 5 ו6\n\nהמבחן: מספיק לפתור הרבה מבחנים זה חוזר על עצמו עשיתי מועד א ומועד ב- ומועד ב היה סבבה כי פתרתי הרבה מבחנים תמיד יש פקטור שגם זה עוזר\n\nהשורה התחתונה: קורס קשה צריך השקעה אבל אפשר לקבל ציון ממש גבוה", "timestamp": 1703843815597}, {"author": "Margarita Birchanskiy", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מרצה רגילה, לא משהו לרעה או לטובה. אם יש ידע קודם בתכנות (לאו דווקא בפייתון) אפשר לא להגיע, רק לעבור ברפרוף על המצגות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אם החומר ברור ויש ידע קודם בתכנות, אין טעם להגיע ולבזבז את הזמן. אחרת, כדאי כי פותרים ממש שאלות ומנתחים קודים.\n\nשעורי הבית: בהתחלה נחמדים אך מהר מאוד נהפכים לבלתי נסבלים. \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1713537230483}, {"author": "(חוצניק)", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: מסודרים, לפי מצגות, ואפשר לנסות את מה שאתה לומד תוך כדי\n\nשם המתרגל/ת: מיכאל טוקר\nחוות דעת - תרגולים: \n\nשעורי הבית: מתחילים קלים מאד ובהמשך דורשים יותר יצירתיות וידע. הרבה זמן מתבזבז בתהליך הטכני של ההגשה.\n\nהמבחן: \n\nהשורה התחתונה: אם יש לך אפילו מעט ניסיון בתכנות, קורס קל. אם לא יכול להיות קשה.", "timestamp": 1714041787527}, {"author": "Ar No", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: זה משנה בכלל?\nחוות דעת - הרצאות: \nלא הגעתי ליותר מדי הרצאות אבל מאלה שכן הייתי בהן וממה ששמעתי מחברים שעוד המשיכו ללכת -  המרצים מקריאים מהמצגת, מסבירים בחוסר עניין ודי ברור שלא מעניין אותם להעביר את הקורס הזה (סהכ אני מבין אותם)\nשם המתרגל/ת: דויד\nחוות דעת - תרגולים: \nבתרגולים המעטים שהייתי נראה שגם הוא לא התעניין יותר מדי בחומר הקורס, אבל הוא היה מאוד נחמד ועשה את המיטב כדי לענות על שאלות.\nשעורי הבית: \nתעבדו עם הדיףמרג' שלהם. זה כלי נוראי, אבל לא משנה עד כמה טוב הקוד שלכם ועד כמה המימוש שתעשו גאוני, אם יתפלק לכם איזה פסיק בהדפסה אתם לא תקבלו אפילו לא נקודה אחת, השאלה היחידה שהם באמת יבדקו בעצמם ולא יריצו בתוכנה תהיה כנראה השאלה האחרונה. מה שאפשר להגיד לטובה על הקורס זה שהיה המון מרווח זמן עם השיעורי בית ויכולתם לעבוד עליהם בהדרגתיות ולאט - חבל שזה היה הדבר היחיד שחיובי בו\n\nהשורה התחתונה: \nאם אתם יכולים להימנע מהקורס הזה תימנעו, אם לא, תמצאו חבר שכבר יודע פייתון למה כאן לא באמת לומדים לכתוב קוד", "timestamp": 1714084120131}, {"author": "יל", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: שני אוחיון \nחוות דעת - תרגולים: מתרגלת מעולה \n\nשעורי הבית: לא רלוונטיים, לא מכינים אותך לרמה של מבחן, מגיעים פעם בשבועיים ברמת קושי גבוהה מאוד למי שאין לו עבר בתכנות \n\nהמבחן: לא פשוט \n\nהשורה התחתונה: לא מכינים אותך במהלך הסמסטר לרמה הנדרשת למבחן", "timestamp": 1715705224763}, {"author": "אלון ספיר", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לב יוחננוב\nחוות דעת - הרצאות: \nמקריאת חוות דעת מסמסטרים קודמים ידעתי לצפות לכך שההרצאות לא יהיו חיוניות. ובכל זאת, שביצתי לעצמי במערכת את ההרצאות של לב יוחננוב, בעיקר כדי להתגבר על תחושת הפומו. למטרה הזאת לב היה המרצה המושלם: ניכר שלב רוצה להיות בהרצאה הזאת אפילו פחות מאיתנו, כשהוא מסיים את מצגת ההרצאה שעה לפני הזמן(בהרצאה של שעתיים, כן?) ומיד משחרר אותנו. ההרצאות שלו מרגישות כמו טקס בבית ספר שנועד ליידע אותנו על קיום החומר ותו לאו. מההרצאות אין ערך מוסף, ומספיק להסתכל במצגת ההרצאה שעולה לאתר הקורס בGR(המתחרה של המודל מבית הפקולטה למדמ\"ח). כן מומלץ לעשות את זה כי יש בקורס שני אלגוריתמים שלומדים רק בהרצאות ולא בתרגולים, אבל מספיק להסתכל במצגת כדי להכיר אותם. גם בנושאים היותר חשובים זה לא הרגיש שללב יש ערך מוסף כלשהו. הפלוס היחיד אצל לב היה לשבת על כיסאות ממש נוחים בקאהן 6. וזהו.\nאם באמת הייתי צריך את ההרצאות כדי להבין חומר(מה שכפי שאמרתי, אני לא חושב שיכול לקרות), ככל הנראה הייתי נכנס ליעל ארז: אומרים שהיא מסבירה את החומר ממש טוב, ומשעת הקבלה שלה לפני המבחן ראיתי שהיא ממש מנסה לעזור. \nשם המתרגל/ת: שחף אריכא\nחוות דעת - תרגולים: \nבניגוד להרצאות, התרגולים כן יותר חשובים להבנת החומר: בתרגולים אתה באמת רואה יישום של החומר שנלמד, כמו גם טריקים פה ושם שעוזרים בשיעורי הבית והמבחן. נכון שגם כאן המצגות עולות לאתר הקורס בGR ואפשר להשלים אותן לבד, אבל אני כן ממליץ להיכנס פיזית לתרגול. גם אם אתם קשובים בו רק בחצי אוזן, לפעמים ניואנסים קטנים יכנסו לכם לראש ויעזרו לכם בהמשך.\nשחף מתרגל פשוט מושלם!!! זאת שנה ראשונה שלו כמתרגל בטכניון אז ניכר שהוא עוד עם אנרגיה לתרגל(גם אם לפרקים מורגש שגם לו נמאס מהבסיסיות הרדודה של הקורס הזה). הוא מקפיד לשמור על האווירה הכי טובה שיכולה להיות בכיתה(כל 5 דקות בדיחה), עורך את המצגות שלו בעצמו(למרות שסגל הקורס לא אישר לו להעלות אותן לGR) כולל פינות מצחיקות ודאג לשלב אינטואיציה לכל נושא שהוא מלמד. שחף השקיע מעל ומעבר למצופה למרות שהוא היה שקוע הסמסטר במילואים. מספר הסטודנטים המועט בכיתה יעיד שהוא אנדרייטד, אבל מקווה בשבילו שבסמסטרים הבאים אם הוא יתרגל הוא יהפוך ליותר פופולרי, כי מגיע לנשמה כמוהו.\nשעורי הבית: \nהדבר הכי מעצבן שיש בטכניון כנראה: הסגל בקורס מתעקש על כתיבת השיעורים בפלטפורמה מעצבנת שלוקח יותר מידי זמן ללמוד לעבוד איתה. לא תמיד השיעורים מובנים ולדעתי אי אפשר באמת להפנים בעזרתם את החומר אם אין לך רקע קודם בתכנות.\nהמבחן: \nהתבנית הכללית של המבחן חוזרת על עצמה מ2019(שאלו מבחני העבר שסגל הקורס שם באתר הקורס בGR), כשמה שמשתנה זאת רמת השאלות. הסמסטר הורגש שרמת השאלות(חרף הסמסטר המיוחד עקב המלחמה) הייתה גבוהה מהרגיל. עוד לא ידוע כמה פקטור יהיה, אבל זה מבחן לפקטור.\nהשורה התחתונה: \nלמזלי הרב הגעתי לטכניון עם בגרות של 5 יח\"ל במדעי המחשב(ואני עוד עתודאי, אז זה ממש טרי לי), אבל אני באמת מרחם על מי שמגיע בלי שום רקע בסיסי בתכנות לקורס הזה. כמו בכימיה כללית, זה ללמוד חומר של 3 שנות לימודים בתיכון בסמסטר הכי עמוס בטכניון. אין לי כל כך על איזה חומר עזר אינטרנטי להמליץ, אבל אני משוכנע שיש מלא מקורות אינטרנטיים להיעזר בהם כדי ללמוד את הבסיס של התכנות.", "timestamp": 1715953269695}, {"author": "ד", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לא הלכתי להרצאות\nחוות דעת - הרצאות: אין לי ניסיון ישיר כי לא הלכתי להרצאות כי אני יודע פייתון מקודם, אבל כל החברים סיפרו שהן זוועה ושפשוט מקריאים ממצגת וגם אז לא מבינים כלום, את כל החומר כל מי שאני מכיר למד עצמאית.\n\nשם המתרגל/ת: לא הלכתי לתרגולים\nחוות דעת - תרגולים: אין לי ידע בנושא\n\nשעורי הבית: אם אתם יודעים פייתון, 15 דקות גג, חוץ מההגשה האחרונה. הסגל הסמסטר החליט לתת שיעורי בית שניתנו בעבר בקורס מבוא בC, אבל שכחו לשנות כל מיני דברים בשיעורי הבית בשביל שהם יתאימו לפייתון. חוץ מזה, היו לפחות 3 טעויות בשיעורי הבית שהיינו צריכים להראות לסגל בשביל שיתקנו, וההנחיות להגשה היו כל כך מבלבלות ולא ברורות שאני מכיר אנשים שקיבלו 0 בגלל שלא הצליחו להבין איך להגיש.\n\nהמבחן: לרוב קשה אבל הוגן. הסמסטר היה קשה בצורה כל כך קיצונית שזה פשוט לא הגיוני. בסמסטר הזה הסגל החליט לתת מבחן שפשוט לא קרוב אפילו לרמת הקושי של המבחנים של סמסטרים קודמים או בכלל בהסטוריה של הקורס. אני מהבודדים שהצליחו לפתור את אחת השאלות ששווה 25(!) נקודות. המבחן גם לא קשור בשום צורה להרצאות, לתרגולים, ולשיעורי בית. זה פשוט לא קשור בכלל. בוחנים על דברים שלא לימדו ומצפים שתלמד את זה לבד. רוב המבחן בכלל לא בודק כמה אתם יודעים להשתמש בפייתון ולתכנת בכללי אלא אלגוריתמיקה - שזה משהו שבכלל לא לימדו. בשביל להצליח במבחן צריך לפתוח מבחני עבר ופשוט לקלוט מה הטריקים שמשתמשים בהם בדרך כלל וזהו.\n\nהשורה התחתונה: קורס זוועה. אם לא הייתי יודע פייתון ולתכנת מלפני, לא הייתי יוצא עם הידע הזה (ולא הייתי עובר את המבחן כנראה). הסגל בבירור לא רוצה ללמד את הקורס הזה, ומשקיעים את המינימום של המינימום. אפילו דברים כמו בדיקה ממוחשבת כמו בC אין, אז מכריחים את הסטודנטים לעשות את זה בעצמם. התחושה שמקבלים היא שמבחינת הפקולטה למדמ\"ח הקורס הזה הוא נטו עול. ממליץ בחום ללמוד פייתון ותכנות לבד לפני תחילת הלימודים. עצוב שזה המצב של קורס בכלי חשוב מאוד (תכנות) ובשפה כיפית ושימושית כמו פייתון. פשוט חבל.", "timestamp": 1715958550793}, {"author": "איתן 67", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ד''ר ילנה נופברי\nחוות דעת - הרצאות:\nהייתי בשתי ההרצאות הראשונות והפסקתי להגיע. אם אתם בכל זאת רוצים ללכת, ילנה העבירה את החומר בצורה ברורה אך מאוד משמימה. לפני כל תרגיל בית רלוונטי עברתי על המצגות של ההרצאות ולפני המבחן עברתי שוב.\n\nשם המתרגל/ת: יותם אמיתי\nחוות דעת - תרגולים:\nהייתי בשני התרגולים הראשונים והפסקתי להגיע. אם אתם בכל זאת רוצים ללכת, יותם העביר את החומר בצורה ברורה ויחסית מעניינת (עד כמה שאפשר להעביר חומר בנושא אופרטורים בצורה מעניינת). לפני כל תרגיל בית רלוונטי עברתי על המצגות של התרגולים ולפני המבחן עברתי שוב.\n\nשעורי הבית:\nקשים ברמה לא פרופורציונלית (ואקספוננציאלית) ביחס לכמה הקורס הזה רלוונטי לשאר התואר, או ביחס לחומר שנלמד בהרצאות ומתורגל בתרגולים. תרגילים 0 ו־1 בדיחה, 2 ו־3 קלים יחסית, 4 טיפה קשה וב־5 אתם כבר שואלים את עצמכם מה הם רוצים מכם.\n\nהמבחן:\nקשה בהרבה מהמבחנים הקודמים בשנים האחרונות.\n\nהשורה התחתונה:\nידעתי לתכנת מראש (10 יח\"ל בתיכון) אז הקורס הזה היה חסר ערך עבורי. אחרי השבוע השני הפסקתי להגיע להרצאות ולתרגולים ורק עברתי על המצגות באתר (עשר דקות במקום שעתיים של שיעור). אני ממליץ בחום להשתמש ב־Pycharm או בכל IDE אחר שאינו Jupyter מאחר שהוא אינו מתאים למישהו שלומד לתכנת (למרות שהוא טוב יותר לעיבוד נתונים).", "timestamp": 1715958727033}, {"author": "1", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: הרצאות הקורונה המוקלטות יעילות יותר.\nאבל מרצה טובה. \n\nשם המתרגל/ת: מור\nחוות דעת - תרגולים: מתרגלת טובה, מסבירה טוב ובסבלנות לכלל הסטונדנטים\n\nשעורי הבית: אין קשר בין הנלמד בתרגול ובהרצאות לשיעורים, הרמה גבוהה בהרבה החל מתרגיל בית 4. המתרגלים האחראים לא עונים על שאלות או שעונים בצורה מזלזלת \n\nהמבחן: מזעזע, רמה כזו של מבחן פשוט ייעדה את כל הסטודנטים ללא רקע לכישלון. לא ניכר שמישהו עבר על הבחינה או שהיה אכפת לו מהרמה עצמה שהיא מנותקת מהרמה של הקורס או מרמת המבחנים שקדמו לו.\n\nהשורה התחתונה: צוות מנותק, אין קשר בין הנלמד בהרצאות ובקורס לבחינה הסופית או לשיעורי בית", "timestamp": 1716193071014}, {"author": "האחד שהבריז מההרצאות כי הוא מלך בפייתון", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: חחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחחח\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: ספיר \nחוות דעת - תרגולים: הלכתי קצת, הוא מדבר מאוד מעניין, קול חזק, נראה שהוא יודע מה הוא עושה, אחלה של בחור\n\nשעורי הבית: ללא קשר למציאות, שב 5 פח אשפה וממליץ לרפרנס, כל השאר מאוד קלים אם תכננתם בכל רמה בעבר\n\nהמבחן: המיץ של הזבל\n\nהשורה התחתונה: בכללי זה קורס צ'יפס אבל דפקו אותנו במבחן", "timestamp": 1716297752940}, {"author": "צ", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: לב\nחוות דעת-הרצאות:\nסך הכל ההרצאות לא מעניינות ממש כל המרצים קוראים מאותה מצגת שיש במודל, כל הרצאה עשיתי משהו אחר בזמן והקשבתי פאסיבית או שלהכתי\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: \nשני מתרגלת ממש טובה ואכפת לה מהסטודנטים, עובדת על פי המצגת כמו כל המתרגלים בקורס.\nשעורי הבית: \nשיעורי הבית לא קשורים ממש לחומר היו ממש קלים עד השניים האחרונים שדרשו יותר השקעה והאחרון היה ממש ארוך ודיי מיותר סך הכל.\nהמבחן: \nהמבחן היה קשה יותר ממבחני עבר ויותר ממה שנלמד בקורס, שיעורי הבית לא קשורים בשום צורה למבחן\nהשורה התחתונה: \nמבחינת עומס בזמן הסמסטר עצמו שיעורי בית אחת לשבועיים שלרוב לא לוקחים יותר משעה, דורש למידה למבחן אבל לעומת שאר הקורסים הוא ממש בקטנה.", "timestamp": 1716374059582}, {"author": "לולאה אינסופית", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: עד המילואים נכחתי בהכל, לילנה אין שום רצון ללמוד או לכל הפחות לענות לסטודנטים בצורה מכבדת. והיא ממש לא עוזרת למילואימניקים או מתחשבת בהם.\nשם המתרגל/ת: מיכאל\nחוות דעת - תרגולים: נחמד מסביר סבבה\n\nשעורי הבית: זוועת עולם עם 0 קשר למבחן, ארוכים ובלתי נגמרים. \n\nהמבחן: היה קשה מאוד עם פקטור מביך\n\nהשורה התחתונה: \nהמבחן הוא יותר מבחן באלגוריתמים מאשר בפייתון\nמי שאין לו רקע בתכנות\\פייתון שישאר חזק וישים פתק בכותל.\nממליצה על הפקל של אליאור באסט. עזר לי לעבור את הקורס הנורא הזה איכשהו", "timestamp": 1716380625124}, {"author": "ערפילית", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ילנה נופברי\nחוות דעת - הרצאות: מנסיוני האישי, לא ממליצה (במיוחד לא לאנשים עם ידע בשפה). גם לא התחברתי להוראה שלה. במהלך הסמסטר חבר'ה שנכחו ברצאות נשרו והעדיפו תרגולים על פניהן, במחשבה לאחור אני מסכימה עם זה. \n\nשם המתרגל/ת: מור ונטורה\nחוות דעת - תרגולים: חדה, מסבירה נהדר.\n\nשעורי הבית: נמוכים ברמתם מרמת המבחן.\n\nהמבחן: בכתב. כל שנה כמעט ניתן פקטור.. עצה , כי למדתי בדרך הקשה, להתאמן בכתיבת קוד עובד בתוכנה ורק לאחר מכן להעביר לוגיקות על דף. אין קיצורי דרך.\nהשורה התחתונה:  :(:", "timestamp": 1716393427601}, {"author": "e^i𝜋", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: לב\nחוות דעת - הרצאות: למי שיש קרע בתכנות -  אין צורך להגיע להרצאות. למי שאין רקע בתכנות - ההרצאות לא כל כך יעזרו.\n\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: ממש נחמדה, תמיד מדוואת שכולם מבינים את התרגילים.\n\nשעורי הבית: מיותרים לגמרי. תרגילים 1-4 ברמה נמוכה מאוד (שעה מקסימום) ולא קרובים לרמה של מבחן. תרגיל 5 - ארוך ונוראי, לא בחומר של הקורס, ומוציא את הרצון לחיות.\n\nהמבחן: ידוע שהממוצע בפייתון תמיד נמוך, ולכן תמיד נותנים פקטור כדי \"לצאת ידי חובה\". המבחן השנה לא היה דומה למבחנים קודמים, ממוצע 55(!) לפני הפקטור.\n\nהשורה התחתונה: אם אתם יודעים לתכנת - קורס מעולה בשביל להעלות את הממוצע. אם אתם לא יודעים - נסו להימנע ממנו כמה שיותר, סתם גורם ללחץ וחוסר יעילות.", "timestamp": 1716404291121}, {"author": "סטודנט באוויר", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: לב\nחוות דעת - הרצאות: \nהגעתי ללב בעיקר כי הוא מסיים את ההרצאות שעה יותר מוקדם, קשה מאוד להבין מה קורה בהרצאה, ממליץ ללכת למרצה השני. \n\nשם המתרגל/ת: שחף \nחוות דעת - תרגולים: \nלשחף מאוד חשוב שכולם יבינו - הבעיה המרכזית של התרגולים הם שאין להם הרבה קשר למבחנים, לימדו אותנו דברים שבאמת אתה לא יכול לעשות מבחן - ממליץ מאוד להתחיל לפתור מבחנים חודש לפני התקופת מבחנים ולבקש להגיע בשעות קבלה\nשעורי הבית: \nקשים בטירוף בערך לקח לי 15 שעות בבמוצע כל תרגיל, כדאי להראות לחברים לפני שמגישים כי הם הרבה פעמים מוצאים לך באגים \nהמבחן: \nקשה פיצוצים אבל נותנים פאקטור לציון הסופי \nהשורה התחתונה: \nלא ממש מלמדים פה פייתון וגם המבחן דיי לא קשור ללמידה.\nתגיעו להכל אבל אם אתם נתקעים בשיעורי בית על משהו אל תעשו מזה ביג דיל", "timestamp": 1716497190197}, {"author": "נתנאל", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: מובנות מאד, ומומלץ לתרגל תוך כדי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא בטוח ששוה להגיע בפועל. המיגע החשוב נמצא במצגות.\n\nשעורי הבית: אוכלות זמן \n\nהמבחן: קשה, לחץ זמן רציני אלא אם כן תרגלת המון\n\nהשורה התחתונה:", "timestamp": 1716802322747}, {"author": "Tom", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: מי שיש לו רקע (לי הייתה בגרות במדמ״ח) לא צריך ללכת להרצאות. למעט אולי הרצאות שקשורות לחיפוש ומיון\n\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: מדהימה! קשובה לסטודנטים, מעבירה את החומר כמו שצריך ובאווירה טובה\n\nשעורי הבית: לא רלוונטיים בשום צורה למבחן. מתחילים קלים מאוד והופכים להיות מורכבים בצורה בלתי רגילה. \n\nהמבחן: קשה מאוד, נתנו פקטור כי הממוצע היה 55\n\nהשורה התחתונה: קורס קל למי שיודע לתכנת, אם לא זה קורס מורכב ואינטנסיבי. לא להילחץ מזה שהשיעורים קשים לכם :)", "timestamp": 1716833745651}, {"author": "אאאאלף", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יעל ארז\nחוות דעת - הרצאות: \nיעל מסבירה ממש טוב, והיא נותנת גם קצת ידע על מאחורי הקלעים של איך דברים עובדים. אני נהניתי בהרצאות. הבעיה היא שהקשר בין מה שלומדים בהרצאות לבין מה שנבחנים עליו בסוף די קלוש\n\nשם המתרגל/ת: מור ונטורה\nחוות דעת - תרגולים: \nמור מצוינת. האווירה בכיתה ממש נחמדה, החומר עובר בצורה ברורה ואם למישהו יש שאלות אז היא עוצרת ומסבירה. התרגולים די חשובים להבנה של שיעורי הבית, שהם 15 אחוז מהציון בערך, אז לא הייתי מוותר עליהם\n\nשעורי הבית: \nרוב התרגילים היו בסדר גמור. החמישי היה בנוי מזעזע.\nלאנשים עם רקע בתכנות רוב התרגילים די קלילים, לאנשים ללא רקע הם יכולים להיות מאתגרים.\nאם אתם קוראים את זה מספיק זמן לפני פתיחת הסמסטר, אני ממליץ על הקורס בקמפוס איי אל של \"מבוא למדעי המחשב בשפת פייתון\" של אוניברסיטת תל אביב, הוא די מכסה את החומר החשוב עד השלב של רקורסיה בערך (מספיק לרוב השיעורי בית)\n\nהמבחן: \nמזעזע.\nקצת הרגיש שהוא בנוי בכוונה להכשיל. \nשלושה סעיפים של \"מה יודפס\"- תעברו טוב על slicing, mutable/immutable.\nשאלה על מימוש כללי של פונקציה.\nשאלה על מיונים/ חיפושים. בדרך כלל חיפוש בינארי או ווריאציה שלו.\nשאלת רקורסיה. \nהרבה פעמים השאלות דורשות חשיבה אלגוריתמית ברמה הרבה יותר מתקדמת ממה שמלמדים בקורס. תהיו מוכנים\n\nהשורה התחתונה:\nלא קורס מוצלח במיוחד. אפשר להנות מההרצאות או מהתרגולים, אבל ההתנהלות של הקורס די גרועה והמבחן (שהוא מה שנשאר בסוף מהקורס) די השמיד את החוויה גם אם קיבלת ציון טוב", "timestamp": 1717183651113}, {"author": "נ", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הלכתי להרצאות \n\nשם המתרגל/ת: שני\nחוות דעת - תרגולים: יודעת ממש טוב את התרגול, לא מעבר. אבל מעבירה אותו טוב\n\nשעורי הבית: דורשים זמן \n\nהמבחן: קשה\n\nהשורה התחתונה: אם לא חייב לא לקחת", "timestamp": 1717507985740}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: ילנה בן אדם רע , מזלזלת באנשים ולא עונה למיילים , משתדלת לעשות את המינימום האפשרי כדי לעזור.\nחייב לאמר שבתור מילואימניק היא המרצה היחידה בטכניון שהרגשתי ממנה שלא מתחשבת בהמצב.\nאני מאמין שהיא במקצוע הלא נכון , היא עכבר מעבדה קלאסי שצריך לשבת בבית ולכתוב קוד ולא להיות בקשר עם בני אדם.\nלברוח ממנה היא השטן בהתגלמותו !\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718381011748}]}