{"posts": [{"author": "YV", "semester": "201901", "text": "התרגיל הראשון עמוס בצורה חריגה, אם אתם רוצים לסיים בזמן צריך להתחיל ביום שהוא יוצא. לקח לנו בערך 15 ימים מלאים (ממוקדם בבוקר עד מאוחר בערב של עבודה, כמעט בלי הפסקות). תרגיל 2 ו-3 משמעותית פחות עמוסים. עדיין לא יודע לגבי 4.", "timestamp": 1590914776000}, {"author": "SR", "difficultyRank": 5, "generalRank": 5, "semester": "201901", "text": "הקורס עבר רענון קל החל מסמסטר חורף 2019-2020, ולכן מה שאני כותב תקף מכאן והלאה.\n\nקורס כבד מאוד עם כמות חומר אינסופית...\nמה שמאפיין אותו שהכל נלמד בצורה ספירלית - אתה לומד נושא אחד, קופץ לנושא אחר, בהמשך חוזר לנושא שכבר ראית וכך הלאה. לכן מאוד מאוד חשוב לשלוט היטב בחומר (ורצוי אף לעשות עליו חזרות במהלך הסמסטר).\n\nיש 4 תרגילי בית (כל תרגיל מורכב מחלק רטוב וחלק יבש). תרגיל הבית הראשון היה העמוס ביותר ובאמת דרש המון זמן, אבל התרגילים שאחריו היו יותר הגיוניים (תרגילים 2-3 סבירים בעומס, תרגיל 4 היה קצת יותר עמוס אבל לא ברמה של תרגיל 1). החלקים היבשים חשובים מאוד, בהרבה מקרים מדובר בשאלות שכבר היו במבחנים והם באמת בודקים את ההבנה והשליטה בחומר.\n\nהדבר הכי מתסכל בקורס זה הלמידה למבחן - יש שאלה של כ-25 נקודות שהיא שאלת מרצה שבודקת כמה אתה טוב בשינון החומר (ולא חסר מה לשנן...)\n\nהמתרגלים בקורס באמת תותחים ואני ממליץ להגיע אליהם. לגבי ההרצאות, אני אישית עברתי עליהן באופן עצמי והיה בסדר.", "timestamp": 1590933869000}, {"author": "מיכאל", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: ליאוניד רסקין\nחוות דעת - הרצאות: המרצה מעולה אבל לא עוקב אחרי השקפים.\n\nשם המתרגל: עידו עמנואל\nחוות דעת - תרגולים: מעולה, מסביר טוב ונחמד בכללי.\n\nשעורי הבית: עמוסים, אבל תורמים להבנת החומר.\n\nהמבחן: הקורס עמוס מאד בנושאים והמבחן נוגע ב-4 מתוכם בלבד. צריך קצת מזל כדי שהשאלות עליהם נבחנת יהיו על החומר שבו אתה שולט (עדיף כמובן לשלוט בכל החומר).\n\nהשורה התחתונה: אין", "timestamp": 1597760142706}, {"author": "לינוקס", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: לאוניד \nחוות דעת - הרצאות: מרצה ברור שמסביר טוב את החומר. חסר סבלנות לסטודנטים לפעמים. אך בכל זאת עונה על שאלות כשהוא חושב שיש זמן. \n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: אחלה מתרגל, נותן הסברים ודוגמאות ומסביר בסבלנות. האמת שגם היינו ממש קבוצה קטנה אז זה היה אינטימי יותר וכמעט כמו שיעור פרטי. \n\nשעורי הבית: המון!!!! גם רטוב וגם יבש. תשיגו רפרנס לתרגילים הרטובים אחרת תשקעו עמוק בביצה טובענית. היבשים פתירים גם בלי רפרנס, אבל תחסכו זמן ותשיגו גם להם כי תוכלו לחזור על החומר לקראת הבחינה עם תרגילים של מבחנים משנים קודמות. \n\nהמבחן: הוגן. \n\nהשורה התחתונה: עמוס אבל מעניין. אם כי אני פחות מאלו שבאמת היו ממשיכים עם התחום הזה הלאה.", "timestamp": 1610243378471}, {"author": "Omer Gino", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לאוניד רסקין\nחוות דעת - הרצאות: קשה \n\nשם המתרגל/ת: מוחמד אגבאריה\nחוות דעת - תרגולים: קשה\n\nשעורי הבית: ארוכים מאד\n\nהמבחן: קשה מאד\n\nהשורה התחתונה: קורס מעניין אבל עמוס מאד וקשה להבנה", "timestamp": 1612269951451}, {"author": "nadav david", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: \nההרצאות עמוסות, אבל לאוניד עוצר ועונה על כל שאלה.\n\nשם המתרגל/ת: מוחמד\nחוות דעת - תרגולים: \nמוחמד מתרגל מצוין, מסביר הכל בצורה נעימה ושומר על סדר בתרגול.\n\nשעורי הבית: \nעמוסים. עמוסים מאוד. אבל לומדים מהם את החומר בצורה טובה.\n\nהשורה התחתונה: חובה.", "timestamp": 1612365687391}, {"author": "student", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: ההרצאות היו מעניינות בעיני, לאוניד מסביר טוב.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יותר עוזרים כשניגשים לתרגילי בית (ביחס להרצאות).\n\nשעורי הבית: לוקחים זמן. תרגיל בית 1 היה ארוך מאוד. 2 היה יחסית קצר ו-3,4 לא היו קצרים אבל לא ארוכים כמו 1. התרגילים היבשים גם לא ממש קצרים.\n\nהמבחן: עוד לא היה, נראה...\n\nהשורה התחתונה: קורס עמוס, אבל לדעתי לא שונה מקורסים עמוסים אחרים בפקולטה (והשלב הכי עמוס היה בתחילת הסמסטר עם תרגיל 1 הרטוב). אני נהניתי, בעיני הקורס מעניין (: .", "timestamp": 1612460425850}, {"author": "רון", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: \nמרצה מעולה תמיד עונה על שאלות ומאוד משקיע בסטודנטים\n\nשעורי הבית: \n4 תרגילי בית, 2 מהם כבדים מאוד ו2 יחסית קצרים שאפשר לסיים ביום/יומיים את החלק הרטוב.\n\nהמבחן: \nאמריקאי עם הסברים ברובו, ככה שגם בטעויות יכולים להתחשב במידה וההסבר משכנע.\n\nהשורה התחתונה: \nקורס עמוס אבל חשוב, הרגשתי שכן יש רצון שנצליח מטעם הסגל ובמיוחד מטעם המרצה האחראי.", "timestamp": 1614073277235}, {"author": "ron maishlos", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליאוניד רסקין\nחוות דעת - הרצאות: \nמרצה עם הרבה ידע אבל לא תמיד יודע להסביר בצורה פשוטה וגם לא תמיד סבלני לשאלות.\n\nשם המתרגל/ת: מוחמד אגבריה\nחוות דעת - תרגולים: \nמתרגל מעולה \n\nשעורי הבית: \nקשים ועמוסים מאוד\nהמבחן: \nהיה הוגן\nהשורה התחתונה:", "timestamp": 1614447829078}, {"author": "yiftach edelstein", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ליאוניד רסקין\nחוות דעת - הרצאות: אל תאמינו לו, הבן אדם אולי אומר בהרצאה ראשונה שאתם מוזמנים לשאול שאלות, אבל הוא אדם לא נחמד ולא נעים שעונה על שאלות בצורה מעליבה, לא ממליץ בכלל\n\nשם המתרגל/ת: תרגול וידאו\nחוות דעת - תרגולים: מומלץ בחום בקורס, יש תרגול בוידאו מאוד מאוד חדש ומאוד מוצלח\n\nשעורי הבית: עמוסים פחות מהדיבור, אך בנויים ברובם בצורה לא טובה ולא מאוד מהנים, למעט תרגילים מסויימים\n\nהמבחן: לא כיף, אבל לא הכי נורא שיש. דורש לשנן המון חומר ולדעת בצורה מאוד מהירה חומר מההרצאות שלאוניד מאזכר בשקף או שניים, עבור שאלות מאוד גדולות במבחן\n\nהשורה התחתונה: לא קורס כיף אבל חובה אז מה תעשה", "timestamp": 1615794725500}, {"author": "עומר", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניינות, עמוסות מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חשובים לא תמיד ברורים ועמוסים\n\nשעורי הבית: עמוסים, קשים, מאוד מלמדים, מאוד תורמים להבנת החומר. תמצאו שותף מדהים ♥\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: קורס קשה אך מעניין מאוד.", "timestamp": 1616099008418}, {"author": "ק", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: ליאוניד\n\nחומר הקורס ממש מעניין ומציג דברים שככל הנראה הסטודנט הפשוט עדין לא הכיר (כמו איך מריצים כמה תהליכים במקביל על המעבד).\n\nשעורי הבית: 4 תרגילים עמוסים וארוכים המורכבים מחלק רטוב וחלק יבש (שלרוב אין ביניהם קשר). לצערי הסגל הסמסטר לא נתן תמיכה מתאימה לתרגילי הבית (למשל, עבור אחד הרטובים ניתן לנו קוד עם טעויות שתוקן רק לאחר שבוע מבלי להגיד איפה בוצעו התיקונים. עבור רטוב אחר לא ניתנו מספיק הסברים עבור מה נדרש ומה מיותר - מה שיכול לזלול ימים של עבודה ללא מטרה). לכן, אולי ההמלצה הטובה ביותר עבור הרטובים היא לא להתחיל לתכנת מיד...\n\nהמבחן: טריקי. לצד שאלות על נושאים קבועים (תזמון תהליכים, מנעולים ו-Deadlock, זיכרון וירטואלי ו-COW. את הנושאים הללו שננו טוב!) יש בכל מבחן כמה שאלות שבעייני מתעסקות בהיבטים קטנונים יחסית מהקורס (למשל הסמסטר היו שאלות על וירטואליזציה - חומר שאין עליו בכלל תרגול, ועל FAT - חומר שדיברו עליו דקות בודדות במהלך כל הסמסטר).\nיכול להיות שאתה כבר עובד בחברת תוכנה, יש לך ניסיון רציני במערכות ובקוד, ועדין לא תצליח במבחן... הפתרון הוא למידה רצינית ושינון של חלקים רבים מההרצאות והתרגולים.\n\nהשורה התחתונה: העזרו בסטודנטים שסיימו את הקורס בשביל האינפוטים הקטנים - מה חשוב יותר ללמוד ומה לא, מה קריטי שהקוד בתרגילי בית ידע לעשות ומה לא. \nכולי תקווה שבעתיד הסגל ידע לעזור בדיוק באותן נקודות קריטיות לטובת הסטודנטים.", "timestamp": 1616318024378}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: מכילות הרבה חומר שבהרבה מקרים צריך לחזור עליהם כדי לעכל את כל הפרטים. ליאוניד מסביר מעולה , שונא שאלות טפשיות אבל בסוף הוא עונה.\n\nשם המתרגל/ת: מוחמד אגבאריה\nחוות דעת - תרגולים: אכפתי ומסביר בצורה מסודרת וברורה. \n\nשעורי הבית: עמוסים אך מלמדים מאוד וממש מעניינים, מה שכן הטסטים של הרטובים לא יורדים לפרטי פרטים ולא בודקים הרבה מקרים אז אפשר להיות פחות קטנוניים במקומות מסוימים. לא להתחיל ישירות בת\"ב כי הסגל מתקן או מבהיר הרבה דברים בימים ראשונים.\n\nהמבחן: יש הרבה חומר וצריך לדעת את כולו טוב מאוד, יש נושאים שתמיד מופעים במבחן אבל בנוסף תמיד יש התפעה.\n\nהשורה התחתונה: אין לכם ברירה", "timestamp": 1616337485754}, {"author": "Menucha Benisti", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: לאוניד רסקין\nחוות דעת - הרצאות: הרצאות עמוסות, מעביר את החומר בצורה דיי משעממת ולא הכי מסודרת...\n\nשם המתרגל/ת: מוחמד אגרביה\nחוות דעת - תרגולים: מסביר מאוד טוב.\n\nשעורי הבית: עמוסים מאוד, חשוב להשקיע מאוד כדי להוציא ציון 100. \nהמבחן: קשה! שאלות על נושאים שוליים. \n\nהשורה התחתונה: קורס עמוס, קשה, צריך להשקיע המון כדי להצליח בציון גבוה במהלך הסמסטר ולקראת המבחן.", "timestamp": 1627315116919}, {"author": "s", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: \nראיתי משולב הרצאות של ליאוניד ושל דן. לדעתי שניהם טובים מאוד, ליאוניד קצת יותר. החומר מעניין רוב הזמן אבל לא כולם מתחברים אליו.\n*חובה* לראות את ההרצאות לפני המבחן כי הם שואלים המון שאלות מהשקפים (ברמה של שאלות מחומר שהיו עליו רק 3 שקפים).\n\nשם המתרגל/ת: עידן יניב\nחוות דעת - תרגולים: ראיתי את התרגולים שמוקלטים מסמסטר אביב 2020, עידן מעולה אבל התרגולים ממש ממש ארוכים והמון פעמים הוא לא מספיק ומשאיר את התרגולים ללמידה עצמית.\nהתרגולים גם מעניינים מאוד לדעתי, מומלץ ללמוד לבד ומה שלא מבינים לראות בוידאו כי הוא כמעט ולא מוסיף על החומר שבשקופיות.\n\nשעורי הבית: \nדורשים זמן והשקעה, תרגיל בית 1 לוקח מינימום שבוע וחצי והשאר (חוץ מ-2 שהוא קצר יחסית) לוקחים 3-4 ימים לפחות.\n\nהמבחן: \nהמבחן היה בסדר חוץ משאלה 1 שהייתה ממש מבלבלת ומטעה בכוונה.\nנראה שהסגל מנסה להוריד את הציון בכוח, ההתייחסות שלהם הייתה מגעילה. וגם אחרי תרגילי הבית הם סירבו לענות לפיאצה במבחנים.\n\nהשורה התחתונה: \nקורס חובה, אין מנוס ממנו, אבל כל בן אדם שרוצה להבין איך המחשב עובד חייב לקחת את הקורס.", "timestamp": 1630064678528}, {"author": "anonymous", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: \nהחומר מעניין מאוד לדעתי אבל חוסר שליטה בלינוקס יכול לגרום לך ללכת לאיבוד בעיקר בהתחלה בהסברים של דן\n \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא הייתי\n\nשעורי הבית: \nדורשים זמן אבל לא היה עמוס כמו שחששתי\nהתרגיל הראשון די עמוס אבל השאר הרבה יותר קצרים\nאם יש לך נסיון קודם/תכנתת לפני התואר זה לא אמור לסבך אותך יותר מדי\nאם אין לך אז תכונן לעבוד הרבה\n(ממליץ מאוד ללמוד git אם אתה לא יודע)\n\nהמבחן: \nלא באמת בודק שליטה בחומר\nצריך *לשנן* את כל המצגות כולל פרטים נידחים ולא רלוונטים כמו מהירות קריאה של רכיב משנות ה80\n\nהשורה התחתונה: \nקורס מאוד מעניין עם מבחן גרוע", "timestamp": 1634555492035}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: \nראיתי דרך הזום. לא העביר את ההרצאות בצורה הכי מסודרת וברורה, אבל חשוב לשמור על פוקוס ולשים לב לפרטים כי במבחן שואלים גם על הפרטים הכי קטנים שראיתם.\nשם המתרגל/ת: אביתר\nחוות דעת - תרגולים: \nדרך הזום. מתרגל מצויין, מסביר דברים בצורה ברורה ויחסית לעומק. מומלץ ללכת לתרגולים שלו\nשעורי הבית: \nיש 4 תרגילי בית רטובים ויבשים. ברטובים הראשון והאחרון עמוסים למדיי ודורשים תחילת עבודה מיידית. השניים האחרים יותר סבירים אבל גם לא בדיוק קלילים. מומלץ להתחיל לעבוד על התרגילים ישר עם השחרור שלהם.\nהמבחן: \nמומלץ לחזור על החומר לעומק לפני המבחן ולתרגל מבחנים. הם יכולים להיות טריקיים.\nהשורה התחתונה: \nקורס מעניין אבל קשה להבין כמו שצריך מההרצאות. כדאי להשקיע.", "timestamp": 1634900283614}, {"author": "Ms", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שעורי הבית: עמוסים מאוד וקשים. חשוב להיות עם שותף טוב.\n\nהמבחן: יש התקלות במבחן כאילו בכוונה כדי להפיל, אבל הרוב חוזר על עצמו, ואם לומדים טוב לגמרי אפשרי להוציא ציון מעולה.\n\nהשורה התחתונה: קורס קשה, אבל אין לכם ברירה :)", "timestamp": 1641203388584}, {"author": "Gur Telem", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: \nלא הייתי כמעט בכלל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nלא הייתי כמעט בכלל\n\nשעורי הבית: \nהרטובים: בעיניי לא מורכבים במיוחד אבל כן דורשים זמן (לפחות אחת מהן ממה שאני זוכר).\nהיבשים: לא ממש זוכר.\n\n\nהמבחן: \nסביר מינוס. כמה מלכודות של פרטים קטנים שלא הרגיש הכי הוגן. אבל עביר למי שלומד ברצינות.\ndisclaimer: הגעתי עם רקע ביינוני בתחום.\nהשורה התחתונה: \nקורס מומלץ להרחבת ההבנה של הפעולה של מערכת ההפעלה. נותן insight לאיך, מתי ולמה תוכנות מתקשרות עם מערכת ההפעלה. אין לכם ברירה כנראה אלא לקחת אותו בתארים שאפשר לקחת אותו.", "timestamp": 1642351022851}, {"author": "YT", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: לאוניד רסקין\nחוות דעת - הרצאות: מרצה עם המון ידע וכן יודע להעביר את החומר בצורה טובה מאד. הוא רק צריך לשפר את היחס שלו כלפי הסטודנטים והדרך שבה הוא עונה על שאלות של סטודנטים.\n\nשם המתרגל/ת: מוחמד אגבריה\nחוות דעת - תרגולים: ממליץ מאד, מתרגל עם ידע רב ומעביר את התרגולים בצורה מעולה.\n\nשעורי הבית: קשים ומייגעים. \nרטוב 1- הכי ארוך, לממש mini shell. ~שבועיים עבודה\nרטוב 2- לשחק עם משהו בקרנל. מאד קליל יחסית ~יום עבודה\nרטוב 3- תקשורת וחוטים. תרגיל לא ברור בעליל ומאד קשה להבין מה רוצים אבל לא ארוך. ~5 ימים\nרטוב 4- לממש מאלוק בכמה גרסאות. ~5 ימים\nסך הכל ממליץ מאד למצוא רפרנסים טובים לתרגילים שכן הם ברובם ממוחזרים.\n\nהמבחן: לא יודע מה להגיד עליו. יש יותר מדי שאלות הזויות שבוחנות האם אתה זוכר פרט שהופיע בשקף 13 בהרצאה 1, באיזה תמונה קטנה שהייתה בתוך השקף. היה לנו שאלה של 20 נקודות על נושא מאד שולי ולא רלוונטי של power pc. מעבר לדרישות זיכרון מטורפות, רמת המבחנים לא מטורפת והממוצע יעיד. סך הכל עם קצת מזל, שינון טוב ותרגול הרבה מבחנים אפשר להוציא ציון טוב.\n\nהשורה התחתונה: הקורס והתכנים שמועברים בו לדעתי סופר חשובים ומאד מעניינים, להבין איך מערכת הפעלה עובדת וכו'. לדעתי צריכים לשנות את הקונספט של המבחן.", "timestamp": 1645127386121}, {"author": "Elad Kay", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אנסטסיה ברגינסקי\nחוות דעת - הרצאות: מעולות, אנסטסיה מעניינת ומצחיקה ובקיאה מאוד בחומר.\n\nשם המתרגל/ת: אילה פוסטיק-טור\nחוות דעת - תרגולים: מעולה!!! אווירה טובה, סבלנית, נחמדה ומסבירה מצוין. מאוד מומלץ!\n\nשעורי הבית: שני תרגילים מאוד ארוכים, שני תרגילים יחסית קצרים. תקצו לזה הרבה זמן כדי לא להגיע למצב שאתם ביום שלפני ההגשה והתרגיל לא עובד. יצא לי כבר בשני תרגילים לקבל 60 ובשני תרגילים לקבל אפס בהגשה ראשונה, וזה לא נעים, וצריך להתעסק עם הגשות חוזרות וחבל.\n\nהמבחן: לא קל אבל מי שלומד יכול להוציא ציון טוב, צריך לשים לב שיש הרבה חומר גם בהרצאות וגם בתרגולים וצריך ללמוד את כולו. כן, כולל את ה-8 שקופיות על PowerPC שהיו פעם אחת בסוף הרצאה. כן, למרות שכבר 15 שנה אין PowerPC בעולם. הייתה על זה שאלה של 20 נקודות במבחן שלי.\n\nהשורה התחתונה: לדעתי אחד הקורסים הכי מעניינים וחשובים שעשיתי. עוסק בנושאים מאוד מגוונים ורחבים. הקורס לא קל ודורש הרבה מאמץ אבל סה\"כ קורס מעולה.", "timestamp": 1646571908865}, {"author": "ארד קוצר", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה:  לאוניד רסקין\nחוות דעת - הרצאות: סבבה, אחלה של מרצה.\n\nשם המתרגל/ת: ארד קוצר\nחוות דעת - תרגולים: \nוואי וואי וואי לא תאמינו אם אני אגיד לכם אבל הוא המתרגל הכי טוב בקמפוס. הבן אדם מביא פיצוחים וחטיפים לתרגולים, עושה שמייח. הוא חושב שהוא יכול להראות שיש לו בטחון אז הוא מאחר באיזה 5 דקות לתרגול, וזה מצליח!!!!!\nכתבנו לו חמשיר אבל די אין כוח יותר, הקורס זוועה. מזל שהיה את ארד שיעשה טוב על הלב.\n\nשעורי הבית: \nזוועתיים\nהמבחן: זוועה\n\nהשורה התחתונה: אל תלכו!! ארד גם עוזב בסוף השנה אז בכלל אין מה לעשות בקורס הזה", "timestamp": 1655620270731}, {"author": "Shai Natapov", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "לכו להרצאות של דן צפריר אם אתם יכולים \n\nהמבחן: \nצריך לזכור הגדרות של הרבה מאוד מושגים, אם אפילו הזכירו את זה בהרצאה או תרגול זה יכול להיות במבחן.\n\nהשורה התחתונה: \nכיפי אבל המבחנים לא כיפים.", "timestamp": 1658758000827}, {"author": "סמפיק", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: מעניינות ומרחיבות אופקים ממש, עם זאת נוגעות בהרבה חומר ובקצרה. הרבה מהשאלות במבחן נכנסות לעומק הבנה על נושאים שנגענו בהם ממש מעט מבלי להכנס לפרטים (לדוג' POWER PC). לדעתי ההרצאות לא מונגשות היטב, אינן קוהרנטיות ומכילול מלא מלל לא מובן לאדם הפוגש את החומר לראשונה. \n\nשם המתרגל/ת: קוצר אלעד\nחוות דעת - תרגולים: \nבין המתרגלים המשקיעים והכי טובים שהיו לי בתואר, היה לי ממש כיף ללמוד איתו. היה משקיע בתרגולים ונותן טיפים טובים להבנת החומר שאינן נמצאים בשקפים של התרגולים. \n\nשעורי הבית: עמוסים אך רלוונטים (פרט לת\"ב 2 שאף אחד לא ידע מה עושים שם באמת). מומלץ לעזר בשעות קבלה ורפרנסים כי לא תמיד מובנת הדרישה בתרגיל.\n\nהמבחן: קשה מאוד, היה פקטור. לדעתי גם לא הוגן מכיוון שהרבה נקודות בשאלות מתבססות על *שורה* אחת שמופיעה באיזה שקף בהרצאה מס' 1 שספק אם המרצה בכלל הקריא אותה בהרצאה. מתסכל מאוד ואין דרך להצליח במבחן אלא אם כן תלמדו מטעויות של אחרים במבחנים קודמים. \n\nהשורה התחתונה: הקורס אמנם חובה מעניין, נותן זווית חדשה על מחשב מערכת הפעלה ומה שבינהם. אציין כי לומדים רק מערכת הפעלה אחת למרות שם הקורס.", "timestamp": 1659692951857}, {"author": "צפרדע אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לאוניד (מוקלט)\nחוות דעת - הרצאות: \nקשה לומר הרבה על לאוניד. הוא איש ממוקד מאוד בחומר שהוא מנסה להעביר ובוודאות יש לו הרבה ידע להעניק לסטודנטים אך מסגרת הקורס כה תובענית, שהריצה על החומר לא עושה לו שבחים כמרצה. \nיאמר לזכותי שניסיתי בהתחלה את דן ההרצאות פרונטליות ופשוט לא הצלחתי להבין מה הוא רוצה. לא היה ברור מתי מדבר על החומר, מתי סוטה מהנושא ושלא אתחיל לדבר על היחס המזלזל לשאלות של סטונדטים שראיתי ממנו. האווירה הלא טובה הזו, והיותו של לאוניד מרצה ב8:00 גרמה לי לעבור למוקלט.\n\nמבחינת תוכן ההרצאות: עמוס ברמות! לא משהו שמורגש במהלך הסמסטר כי התרגולים עושים עבודה מצוינת בכיסוי החומר אבל הרמה של היכרות עם ההרצאות שנדרשת למבחן היא *בלתי* אפשרית. (יותר מזה, ב״מבחן״). \nהחומר לכשעצמו מאוד חשוב במדעי המחשב. היכרות עם קונספטים ונושאים שהם המכלול כולו של פעולת המחשב העיקרית. ברמת הרזולוציות הכי קטנות (שלפעמים הם גם ביטים) כדי להבין לעומק נושאים מסוימים.\n\nשם המתרגל/ת: אילה פוסטיק\nחוות דעת - תרגולים: פשוט מצוינים. \nבניגוד לתרגולים פקולטיים אחרים, התרגולים הם כמו ״מיני הרצאות״. אין חזרות על החומר אלא רק העמקה בנושאים נוספים בחומר. ברכה וקללה כאחד. חייב להיצמד להרצאות, אך מצד שני היקף החשיפה רחב יותר ואפשר לקבל תמונה הרבה יותר רחבה על החומר הנלמד.\nאילה מסבירה בצורה יסודית, מצוינת ומקצועית. היא אחראית ובאה מאוד מוכנה לשיעור. המתרגלת היחידה שהרוויחה 5 בהכל במשוב מרצה-מתרגל. \nחשוב מאוד להיות קשובים בתרגולים גם אם ממש קשה כי הם קריטיים למבחן כמו ההרצאות.\n\nשעורי הבית: 4 תרגילי בית ברמות קושי שונות.\nהתרגיל הראשון היה לכתוב shell משלנו והיה הכי עמוס.\nהתרגיל השני היה להוסיף קריאות מערכת ללינוקס. משהו ממש בקטנה.\nהתרגיל השלישי, תכנות עם חוטים. תכנון מדויק ואפשר לסיים גם ביומיים שלושה. אבל הבאגים הכי מוזרים שראיתי והכי קשה לדבג אותם.\nהתרגיל הרביעי, לסמלץ מרחב זיכרון. דווקא מאוד מעניין לראות איך עובדות הקצאות זיכרון ומאוד יישומי. לא מורכב למימוש. בינוני ברמת הקושי. דורש קצת תכנון.\n\nהמבחן: \n5 שאלות אמריקאיות מהגיהנום. נושא רנדומלי שנבחר מבין כל הנושאים של הקורס ונשאלים על פרטים ספציפיים והזויים משקופית או שניים שספק אם המרצה הזכיר אותה בכלל. יאמר לזכותי שגם עם היכרות עם הנושאים, התשובות לא היו טריוויאליות ובלתי אפשרי לענות נכון.\nשאר השאלות (3) הן בסדר יחסית. לפעמים יש שאלה שדורשת היכרות בעל פה עם אחת המצגות של התרגולים כך שאין ברירה גם כאן אלא ללמוד בעל פה. לא מבין איך הממוצע כזה גבוה. המבחן באמת בלתי אפשרי בהמון מובנים.\nהשורה התחתונה: קורס קשה. ולא סתם קשה- הכי קשה שהיה לי עד עכשיו. אם זה התפיסה ההבנתית של החומר בהרצאות ובתרגולים ובין אם זה ההתמודדות עם תרגילי הבית והבאגים החדשים ובין אם מדובר באופי הלמידה למבחן והמבחן עצמו- לשם צריך לשנן בעל פה כל הרצאה וכל תרגול, מה שברור לכולם שבלתי אפשרי.\nאסכם ואגיד שביחס לקורסים כמו מבני, לוגיקה, קומבי, מתמ ועוד, יש סיבה שהקורס הזה הוא הקורס עם הכי הרבה נקז בפקולטה. \nלסיכום: 4.5 נקז, feels like 10.", "timestamp": 1664735408105}, {"author": "רק תלונות", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: לאוניד \nחוות דעת - הרצאות: יותר מדי חומר. לא ממש רלוונטיות לתרגילי בית וכמובן מאוד רלוונטיות למבחן.\n\nשם המתרגל/ת: איילה \nחוות דעת - תרגולים: אין דבר רע להגיד על איילה, קשובה ובהירה.\nספוילר - התרגולים הם לא באמת תרגולים, הם עוד הרצאות! כיף חיים!\n\nשעורי הבית: בזוגות\nרטובים: השני קצר יחסית, את השאר כדאי להתחיל מוקדם - מייד כשיוצא. הרבה עבודה, דיבוג ומה לא, הפיאצה היא החבר הכי טוב שלכם.\nיבשים: סבירים, יש כמה שאלות שדומות לשאלות ממבחנים אז כדאי לקחת ברצינות.\n\nהמבחן: גועל נפש, לא ברור מאיזה קורס הביאו אותו אבל מערכות הפעלה זה לא. לפחות 10 ימים לפנות ללמידה, לקוות לפקטור שמן, להתפלל לשאלות אמריקאיות פתירות ויהיה בסדר.\n\nהשורה התחתונה: אין ממש ברירה אבל כדאי לקחת כששאר הסמסטר לא עמוס ולמצוא שותף תותח.", "timestamp": 1665911232008}, {"author": "..", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ליאוניד רסקין\nחוות דעת - הרצאות: ליאוניד מרצה טוב, יש המון חומר בהרצאות והוא מסביר אותו מובן. ההרצאות מאוד מאוד מאוד חשובות! כל פרט הכי קטן עשוי להופיע במבחן. כן, גם המשפט שהוזכר בשקופית הבודדת הזאת יכול להיות שאלה באמריקאי ולהיות שווה 5 נקודות. חשוב מאוד *לשנן* אותן לפני המבחן.\n\nשם המתרגל/ת: איילה פוסטיק/סארי\nחוות דעת - תרגולים: שני מתרגלים מעולים. התרגולים מאוד חשובים לתרגילי הבית אבל במיוחד למבחן! נוסף בהם המון המון חומר חדש ושואלים על הרבה ממנו במבחנים.\n\nשעורי הבית: תרגילי הבית מאוד עמוסים אבל לא לפחד. לקחתי עם הקורס עוד שני קורסים תכנותיים יחסית כבדים וסמסטר די עמוס באופן כללי והיה בסדר גמור :) כן להיסגר על שותף טוב שיש לכם כימיה איתו כי קצת קשה לחלק עבודה (על אף שעשינו את זה) ולכן כשמחלקים צריך לדעת טוב מה השותף השני עושה או שהוא יסביר לכם.\nתרגיל בית 1 די נחמד ומבינים באמת מה זה shell אבל הוא לוקח די הרבה זמן אז לשבת עליו כשהוא יוצא.\nתרגיל בית 2 הכי קצר.\nתרגיל בית 3 היה לי לפחות יחסית אבסטרקטי וקשה להבין בהתחלה מה ממש צריכים אבל זה מסתדר. היו שם בעיות דיבגינג הזויות (ככה זה עם חוטים).\nתרגיל בית 4 די נחמד אבל תדאגו לסיים אותו לפני סוף הסמסטר כדי לא לשבת עליו במקום ללמוד למבחנים.\n\nהמבחן: לקחת כמה ימים טובים ללמידה (שבוע בערך עם למידה מאומצת זה מספיק). כדאי לעבור על כל המצגות של ההרצאות (מספיק אותן אפילו בלי סיכום) ולשנן אותן כי באמת כל פרט בהן חשוב. על התרגולים גם כדאי לעבור על המצגות ולקרוא את ההערות שיש במצגות. ואז לפתור מבחנים כמובן. \nלשים לב שאתם חדים על החומר ואם הבחירה היא בין לעשות עוד מבחנים או לעבור על חומר שלא סגורים עליו - אז תעברו על החומר.\nבסוף המבחן באמת בסדר, הוא לא מאוד מפחיד ואם חדים על החומר ופותרים מבחני עבר שמים לב שיש דברים ששואלים עליהם יותר אבל תמיד ישימו סעיפים קצת יותר טריקיים שעבורם צריך את השליטה המלאה בחומר.\nעוד טיפ - מה שלי עזר זה יום לפני המבחן לעבור על כל המצגות של ההרצאות ולראות שאני יודעת הכל וזה ממש עזר כי בדיוק כמה דברים שלא זכרתי כל כך היו כמה שאלות אמריקאיות.\n\nהשורה התחתונה: קורס שאותי מאוד עניין שעושים מהמבחן שלו מאוד מפחיד אבל הוא באמת בסדר. אם להוציא את עניין השינון - הקורס מלמד המון ולכן הוא לדעתי אחד הקורסים החשובים בפקולטה.", "timestamp": 1666211467775}, {"author": "B", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דן ואז ליאוניד\nחוות דעת - הרצאות: \nהכל חשוב, כל פיפס שהמרצה אומר יכול להיות במבחן, שורה 3 מהרצאה מספר 7 תהיה במבחן אם זה יעלה בגורל.\nוקצת יותר רצינות, ליאוניד יודע את החומר ממש טוב עד כדי שהוא לא הכי סבלני (לפעמים) אבל לרוב הוא בסדר.\nגם דן יודע את החומר אבל הרגשתי שהוא נתקע קצת על דברים ורוב ההרצאה הרגישה מאוד איטית.\nהקטע שמדברים כמה דקות ואז עוברים פתאום 5-6 שקופיות קדימה, סטודנט רגיל יחשוב שב-5 הדקות הללו דיברו על 5-6 השקופיות שהרגע דילגו עליהם אבל זה ממש לא המצב, כנראה שדיברנו רק על אחת ולאחר מכן יש עוד 4-5 שקופיות של דגשים מעצבנים שיגיעו במבחן אז לחזור ולקרוא את כל זה.\nשם המתרגל/ת: מוקלט - עידן יניב\nחוות דעת - תרגולים: \nהתרגולים המוקלטים פשוט פצצה, מתרגל מעולה שמסביר מעולה את החומר. המלצה שלי היא להוריד את קבצי ה-power point מאחר ויש שם ב-section של ההערות דברים חשובים ששואלים במבחן!!!! ולא תמיד המתרגל אומר!!!\nשעורי הבית: \nגיהינום אבל אם תשבו מספיק זמן לפני יהיה בסדר.\nהמבחן: \nגיהינום 2, גם למידה של שבוע ריק לפני המבחן לא תעזור אם לא תעשו את הדבר הבא:\nהקונספט של המבחן לא הכי הוגן מאחר ויש כמויות לא סבירות של חומר ובודקים שם את הידע (או את הזיכרון שלכם) על שורות ספציפיות מההרצאה.\nכדי ללמוד יעיל למבחן המאוד פייר הזה מומלץ מאוד *לשנן* את החומר לפני שניגשים בכלל לפתור בחינות.\nאיך לעשות את זה? תעשו כרטיסיות של כל התרגולים וכל ההרצאות על כל דבר שנראה לכם חשוב (ראו שורה ראשונה - כל פיפס חשוב).\nכל זה מניסיון אישי של מועד א ציון 55 ומועד ב ציון 80+ וריצה הכי מהירה שאפשר מהקורס.\nהדרך הטובה ביותר לדמות לכם את המבחן היא - מבחן באת״מ *ללא* חומר פתוח ועל יותר דקויות וכמות חומר יותר גדולה.\nהשורה התחתונה: \nהקורס באמת מעניין, מי שאוהב low level זה קורס אחד המעניינים שיצא לי לעשות.\nשיעורי בית מציקים אבל מעניינים, התכנות שם מכניס קצת שוני מכל מה שסטודנט במדמח עשה עד עכשיו.\nמבחן שהלמידה אליו קשה למי שישר ניגש לפתור מבחנים ולא שינן טוב את החומר לפני.\nבהצלחה ואל תהיו שאננים!", "timestamp": 1666675487269}, {"author": "Gang scheduling", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לאוניד רסקין\nחוות דעת - הרצאות: סבבה, בין המרצים הטובים שנתקלתי בהם. לא מתחיל להיכנס לכל שאלה מעצבנת ששואלים ואז הרצף של ההרצאה לא נקטע ומרגישים כאילו בתוך הצגה.\n\nשם המתרגל/ת: Maymana Hasan\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: 4 תרגילים שכל אחד כולל חלק רטוב וחלק יבש. היבשים קצרים יחסית והרטובים בדרך כלל דורשים עבודה והם די עמוסים אבל לא באופן קיצוני מדי.\n\nהמבחן: הקורס היה בסדר לגמרי עד שהגענו למבחן. מבחן מזעזע שבקושי בודק הבנה, ויותר בודק אם זכרתי מה כתוב בשקף 43 בהרצאה מספר 7.\nההמלצה היחידה למבחן היא לשנן. רק ככה תצליחו לענות על המשחק זיכרון הזה שהם קוראים לו \"מבחן\".\nתעשו גם מבחני עבר כי יש סגנונות של שאלות שלפעמים הם חוזרים עליהם, אבל תדעו שזאת לא אינדיקציה בכלל לאם ילך לכם טוב במבחן כי אתם יכולים להגיע ולראות שאלות בסגנון שונה ממה שהכרתם, או להיתקל בחומר שהופיע רק ב-3 שקפים בכל הקורס ויש עליו שאלה של 25 נקודות.\n\nהשורה התחתונה: הקורס עצמו מעניין, אבל המבחן נוראי.", "timestamp": 1679678382909}, {"author": "Oni Giri", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  לאוניד רסקין.\nחוות דעת - הרצאות: לאוניד יודע את החומר טוב מאוד. \nבחורף מומלץ ללכת אליו.\n\nשם המתרגל/ת: המוקלטים.\nחוות דעת - תרגולים:  המתרגל מעולה , מסביר בצורה ברורה מאוד .לפעמים יש דברים שהוא לא מספיק  ולכן צריך לחזור ולהבין אותם.\n\nשעורי הבית: עמוסים, במיוחד התרגיל הראשון שלוקח שבוע / שבוע וחצי. צריך להשקיע הרבה בהן , הדבר שמקיל הוא שיש רפרנסים ושהן כמעט 1 ל- 1 משנים קודמות.\n\nהמבחן: צריך לדעת הכל למבחן !!!.\nבמיוחד שקופיות ההרצאות כי הם אוהבים לשאול על דברים ספיציפים מאוד , במיוחד בשאלה הראשונה שהיא אמרקאית .\nהשאלות האחרות בד\"כ יהיו על דברים שנלמדו בתרגולים .\nבמבחן שלנו הביאו נושא שעליו 4 שקופיות בלבד ולכן הרבה סטודינטים לא ידעו את הנושא . אך נראה שלקחו את זה בחשבון.\n\nהשורה התחתונה:\nצריך להשקיע הרבה בקורס כדי להצליח.\nקורס מעניין מאוד , הבעייה היא שהמבחן מבוסס על כך שצריך לדעת כל שקופית היא בהרצאה והיא בתרגול . ולכן תעשו לעצמכם טובה ותלמדו את כל החומר.", "timestamp": 1679758103349}, {"author": "למדתי הכל מMIT", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: אוהב לשאול את הכיתה שאלות שרק הוא יודע את התשובה. לפחות רבע מכל הרצאה מתבזבזת על לחפש את הסטודנט שהצליח לעשות טלפתיה.\nבונוס: תנסו לספור בכמה חברות הייטק לאוניד עבד לפי הmerch שהוא לובש\n\nשם המתרגל/ת: מוחמד עד שגיליתי שיש הקלטות קורונה של עידן\nחוות דעת - תרגולים: \nמוחמד מבין את החומר מעולה, אבל הוא מעביר את החומר בצורה קצת משעממת וקשה לזכור דברים חשובים.\nלעומת זאת ההקלטות של עידן מרגישות כמו livestream בtwitch, הבן אדם נולד סטרימר, עונה תמיד לשאלות מהצאט (שאגב היו כמה שאלות מעולות) והוא אפילו השקיע בלוח מחיק בשביל שיהיה יותר קל להמחיש נושאים מסובכים.\n\n\nשעורי הבית: סתם בזבוז זמן (והרבה), תעשו את המינימום בשביל לקבל כמה שיותר קרוב ל100, לא כדאי להשקיע בבונוסים כי הציונים גם ככה חסומים ב100.\n\nהמבחן: ארבעים דקות של לפתור מה שיודעים ועוד שעתיים ועשרים של להתאמץ להיזכר מה זה לעזאזל gang scheduling.\nוכל מה שעולה לראש זה שעשו לנו שם gangbang רציני.\n\nהמתרגל שנכנס אפילו לא יכל לענות איך קוראים לו. \nכל שאלה ששאלו אותו הסתכמה ב\"אתה צריך לדעת את זה מההרצאה\" / \"אני לא יכול לענות לך על זה, זה משתמע מהנתונים\"\nהרגיש שאת רוב השאלות הם ניסחו בעזרת google translate, שאלות אמריקאיות של 5 נקודות הולכות לפח על ניסוח בלבד\n\nהשורה התחתונה: קורס מסוכן, לא משנה כמה זמן יש לכם להתכונן למבחן בסוף תפלו על שטויות שהופיעו ב2 שקופיות נידחות או על ניסוח של שאלה שלא מוכנים להסביר בעל פה.\n\nשישים וממשיכים", "timestamp": 1679772381994}, {"author": "~", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: מרצה מזעזע. אולי יודע את החומר, אבל גם לא יודע להעביר אותו וגם מתנהג כמו חרא לסטודנטים.\n\nשם המתרגל/ת: מוקלט (איילה)\nחוות דעת - תרגולים: טובה, מסבירה את החומר מעולה.\n\nשעורי הבית: רטובים, לא קשים ודי סבבה.\n\nהמבחן: המבחן הכי גרוע שהיה לי בתואר. מועד ב' מבחן עם ממוצע 47. שאלות מבלבלות ומנוסחות גרוע, שאלות על משפט מסויים בשקף ספציפי בהרצאה כלשהי, והכי גרוע-  שאלות אמריקאיות עם מקרים שבהם שהתשובה הרשמית לא נכונה אבל אחת אחרת כן. לא מתייחסים לערעור דרך הנציג לגבי שאלות בעייתיות, אלא רק למי שערער בנפרד (מדובר על 10-15 נקודות יותר).\n\nהשורה התחתונה: כל עוד ליאוניד שם, אל תקחו אם לא חובה.", "timestamp": 1683762229556}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: לא אכפת לו מהסטודנטים, אבל יודע את החומר ממש טוב.\n\nשם המתרגל/ת: מוחמד \nחוות דעת - תרגולים: מתרגל הכי טוב שנתקלתי בתואר, מאוד אכפת לו מהסטודנטים, מעביר את החומר בצורה הכי ברורה שיש.. ממליצה מאוד.\n\nשעורי הבית: \nעמוסים, במיוחד תרגיל הבית הראשון. לא קלים חשוב להתחיל בהם מוקדם ככל הניתן.\nהמבחן: \nלצערי הרב המבחן הוא אחד החסרונות בקורס ולדעתי הסגל חייב להתייחס לזה בצורה רצינית.(למרות שהחומר של הקורס הוא הכי מעניין שיש המבחן גרם לנו לשנוא את הקורס)\nהנוסח של השאלות אינו ברור בכלל במיוחד במועד ב הסמסטר, הממוצע של המבחן (שהיה 47) כבר אומר שיש בעיה רצינית, וצריך לקחת בחשבון ולהתייחס לזה שהסטודנטים למדו למשך כל כך הרבה זמן (במיוחד לאחר שהמבחן נדחה בגלל מתקפת הסייבר) והם כל כך מבינים את החומר ופתרו עשרות מבחני עבר(חשוב לזכור שזה לא קורס פורמלי והחומר שלו מובן וברור). \nמאוד מתסכל ..לדעתי זה כישלון של הסגל וצריך לנקוט בצעדים  ולחקור את נסיבות הכישלון העצום כדי להימנע מכישלון חוזר בעתיד..\nהשורה התחתונה: אני חוזרת על הקורס בסמסטר אביב הבא מקווה שיהיה יותר טוב. אעדכן אתכם.. בהצלחה לכולם:)", "timestamp": 1687013436161}, {"author": "אלף אפס", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דן וגם לאוניד \nחוות דעת - הרצאות: \nדן - כשסטודנטים היו שואלים את דן על דברים שהוא לא הסביר טוב הוא היה אומר שהקורס הזה זה קורס מדוייק ולכן צריך להגדיר היטב את השאלות. כל זאת בזמן שהוא היה מקפיד לסתור את עצמו בכל הרצאה ולתת הסברים רופפים. הוא היה מעופף בקטע לא סביר, הרצאה ראשונה, דן מספר לנו שכל סמסטר הוא לא מבין למה כל פעם לוקח לו שעה וחצי להעביר את ה10 שקופיות הראשונות של המצגת. מהר מאוד הבנו למה, הבנאדם ניסה במשך 15 דקות ארוכות להיכנס ליוטיוב ולשים קטע מתוך \"המטריקס\" כל זה רק כדי להגיד מה שהיה אפשר לומר במשפט אחד: \"מערכות הפעלה מייצרות מצג שווא לתוכניות שרצות עליהן\" (כי הן עושות ניהול משאבים בצורה LAZY).\n\nסטודנט שאל אותו על איזה משהו, אחרי 10 דקות שהוא מדבר פתאום דן אומר \"רגע מה שאלת?\" ואז הסטודנט עונה לו \"אני גם לא זוכר\".\n\nלאוניד- \nהוא מרצה יותר טוב מדן אבל הייטר בטירוף, הוא ממש כעוס והוא לא מסביר טוב ואז מתעצבן על סטודנטים ששואלים אותו שאלות.\n\nמה שעצוב בכל זה זה שהחומר בכלל לא קשה, פשוט מעבירים אותו גרוע ואז בוחנים על שטויות שלא קשורות למערכות הפעלה בכלל.\nכמובן שהמרצים מתנגדים להרצאות המוקלטות. המזל זה שיש אותן פיראטי אז הם לא כל כך יכולים לעשות עם זה משהו. \n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: \nנקודת האור היחידה בקורס הזה, אני לא יודע אם הוא מתרגל עדיין, אני ראיתי הקלטות שלו מהקורונה, הן ממש אחלה והוא מסביר ממש טוב מה שבהרצאה \"מעבירים\".\n\nשעורי הבית: באתי עם ניסיון קודם אז הם לא היו כל כך קשים, מבני היה משמעותית הרבה יותר עבודה שחורה.\n\nהמבחן: \nללמוד מצגת בעל פה.\nהשורה התחתונה: \nאין ספק שאם הקורס לא היה חובה אני בספק שמשהו היה לוקח אותו. אין קשר בין הידע הנרכש בקורס למה ששואלים במבחן או למערכות הפעלה.", "timestamp": 1688048352643}, {"author": "אנונימוס", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ליאוניד (מוקלט)\nחוות דעת - הרצאות: \nניסיתי את ליאוניד פרונטלי, דן צפריר פרונטלי, וסיימתי עם ליאוניד מוקלט.\nבעיניי ההרצאות עוברות על הפנים, וחבל שככה עובר הקורס הזה.\nבסוף הלכתי למוקלט של ליאוניד כי זה היה הדבר היחיד שאפשר לי יחסית לעקוב. אבל בסופו של דבר, זה מתנקז להמון נושאים שמועברים מהר (ולפעמים גם דקויות חשובות שלהם מועברים כבדרך אגב) מבלי להיכנס לעומק ומבלי לתרגל לעניין, ובסוף במבחן לשאול על העומק (מעלה סימן שאלה? גם אצלי).\n\nשם המתרגל/ת: עידן יניב (מוקלט)\nחוות דעת - תרגולים: מתרגל מצוין, הקלטות מצוינות, עוזר לעשות סדר ומעט מקל על עומס החומר.\n\nשעורי הבית: \n4 רטובים+יבשים.\nהרטוב של לשנות את גרעין ההפעלה בלינוקס - בעיניי חובה לקחת רפרנס ולעבוד לצידו - חס וחלילה (לא בציניות) בקטע של העתקה, אלא בקטע שיהיה להם אסמכתא עובדת לצידכם שתתקן אתכם אם אתם עושים שטויות אם מתברברים. אם עושים טעות ברטוב הזה - מאוד מאוד קשה לדבג כי מדובר בחוטים. לעבוד עם רפרנס טוב ליד יחסוך לכם שעות ואולי ימים.\nאבל שוב - לא בקטע של העתקה (חבל סתם להתעסק בסיכון הזה), אלא בווידוא שלכם.\n\nהמבחן: \nנורא. לדעתי אי אפשר להגיע למבחן הזה 100% מוכן, מהסיבה הפשוטה שאפשר לשאול על כל שורה בבשקף בהרצאות או בתרגולים. המבחן לא בא לבדוק רק הבנה, אלא גם הרבה שינון של המצגות, וזו אחת הסיבות שהקורס מחטיא את מטרתו.\nמומלץ ללמוד באופן הבא: כל יום - חצי יום מבחן, חצי יום מעבר על החומר. יש כאן דגש ענק על לשנן את החומר גם על חשבון לפתור מבחנים (אבל לא במקום! יש דברים שמתרגלים או לומדים רק במבחנים).\n\nהשורה התחתונה: \nקורס חובה אז אין מה לעשות. החומר יכול להיות מעניין, אבל שווה פשוט לנסות לעקוב כמו שצריך שמהלך הסמסטר, ולפנות זמן טוב ללמידה למבחן.", "timestamp": 1690746274276}, {"author": "bruh", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ליוניד מוקלט\nחוות דעת - הרצאות: בתחילת הסמסטר הלכתי להרצאות של ליוניד פרונטלי ומהר מאוד וויתרתי, עובר על נושאים חדשים(ולצורך העניין חשובים) מהר, מתעצבן ששואלים,ואם לא הקשבתם טוב טוב לשתי שניות איבדתם אותו(או כך הרגשתי) אז במוקלט אפשר לעצור אותו מה ששיפר את המצב טיפונית\n בסופו של דבר ההרצאות עמוסות ומלאות חומר שיכולים לשאול עליו, גם אם התייחסו אליו למילישנייה :)\n\nשם המתרגל/ת: מוחמד מוקלט ואז עידן\nחוות דעת - תרגולים: מוחמד מתרגל טוב, יודע את החומר ואפשר לראות את זה, אך התרגולים שלו הרגישו לי יבשים מדי וכמעט נרדמתי בהן, אז החלטתי להקשיב להמלצות פה על עידן ופשוט התחרטתי שלא עברתי אליו מוקדם יותר, מתרגל מדהים, מעביר השיעור בצורה מעניינת, עונה לכל השאלות שהיו בצ\"אט(שאגב חלקן חשוב וברר עניינים בעיני)\nתרגולים גם כן עמוסים\n\nשעורי הבית: עומס בלתי הגיוני בלי צורך,-אם עושים הכל בעצמכם- אישית נעזרתי מאוד ברפרנסים בכל התרגילים מה שהקל/הפחית את עומס השיעורים, ואני אגיד בבטחה שאם נעזרים/מסתמכים ברפרנס זה לא ישפיש על הבנתכם לחומר, לדעתי בקורס הזה יותר חשוב להביןן העניין בכללי ולא לממש(זה לא כמו מת\"ם שחשוב לעשות התרגילים) אז תיעזרו ברפרנסים לחיים קצת יותר קלים :)\n\nהמבחן: הזוועה האמיתית, כמו שכולם אומרים הדרך להצליח היא לרוב לסנן, כן חשוב להבין עקרונות של מלא דברים, אבל הם שואלים על דברים שהזכירו פעם/ראינו בשקופית אחת ולכו תיזכרו מה זה\nיש מלא חומר להבין ולזכור, אומנם החומר מעניין (מאוד לדעתי)אבל בסופו של דבר כדי להצליח צריך לעבור את המבחן-> צריך לסנן ולזכור ולעבור על החומר המוןןןןןןןןןן\n\nהשורה התחתונה: מועד ב here we come", "timestamp": 1690782677008}, {"author": "קורס חובה", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: מעביר את ההרצאות מהר מידי, מדלג על שקופיות ומסביר כאילו אתם כבר יודעים את החומר, הבנתי גם שדן לא יותר טוב. שורה תחתונה - תראו מוקלט, תקראו בעצמכם כל שקופית מהמצגות ותיעזרו בסיכום.\n\nשם המתרגל/ת: עידן מוקלט\nחוות דעת - תרגולים:  מתרגל טוב. תראו את ההקלטות שלו. אין מה לבוא פרונטלי אלא אם כן יש לכם משהו ספציפי לשאול.\nבתרגולים בנוסף לחזרה על החומר של ההרצאה מעבירים גם עוד חומר שלא הועבר בהרצאה.\n\nשעורי הבית:  30% תקף, 4 רטובים ו 4 יבשים. עמוסים מאוד, חלק יגידו יותר ממבני נתונים. היבשים לקוחים ישירות ממבחנים ברובם אז כדאי לפתור לבד. הרטובים ממוחזרים ברובם ולא מאוד קריטים למבחן אז אפשר להיעזר ברפרנס אם אתם ממש טובעים בעומס של הסמסטר.\n\nהמבחן:  ברובו בודק ששיננתם את כל החומר בעל פה, ויש הרבה חומר. אין חומר עזר לבחינה בכלל. כדי לקבל ציון טוב צריך לזכור כל שורה מתוך 1281 השקופיות (ספרתי) של ההרצאות + תרגולים. יש הרבה פינות שצריך לזכור והם מצליחים לדחוף את כל הנושאים המרכזיים של הקורס לתוך כל מבחן + כמה נושאים נידחים ששכחתם שלמדתם בכלל שהופיעו פעם אחת בשורה 23 במצגת 8 של התרגול.\n\nהשורה התחתונה: קורס מאוד עמוס, מי שלא אוהב את הנושא של מערכות הפעלה ו low level כנראה יסבול. מי שכן אוהב כנראה יהנה בהתחלה ויסבול בסוף כי המבחן באמת מוציא את החשק מהנושא.  אבל בסך הכל טוב לדעת את רוב הנושאים שמלמדים בקורס בכללי.", "timestamp": 1690970451538}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דן צפרירי ולאוניד\nחוות דעת - הרצאות: \nיצא לי ללכת גם לדן וגם ללאוניד.\nלדעתי שניהם לא מנגישים את החומר בצורה לא טובה, סטודנט שמגיע עם אפס ידע במערכות הפעלה, לינוקס, רשתות וכו' הרבה פעמים יתקשה להבין את ההסברים שלהם. לצורך העניין, ברוב ההרצאות הם זורקים לאוויר כל מיני מושגים מתקדמים בקורס שעדיין לא לימדו ולא ברור על מה מדובר. בנוסף, הם לא מסבירים טוב מושגים מסויימים שכנראה ברורים מאליו להם בתור אנשים שעוסקים כל כך הרבה שנים בתחום. \nלאוניד ספציפית מאוד ממהר עם החומר ומדלג הרבה פעמים על חומר ועל שקופיות שכן רלוונטים למבחן.\nלעומת זאת, דן פשוט מפרט על כל דבר ויכול להכנס למונולוגים שלא נגמרים ברמת פירוט והעמקה עד שגולשים לדברים שכבר לא ממש קשורים למה שמלכתחילה דיברו עליו.\n\nשם המתרגל/ת:  עידן יניב מוקלט\nחוות דעת - תרגולים: \nהוא מצויין, עושה סדר בבלגן של ההרצאות. מדבר בצורה ברורה ורהוטה, חד, עונה בצורה מכבדת ומדוייקת לשאלות של סטודנטים בהקלטות ככה שההקלטה ממש זורמת. התרגולים מאוד עמוסים אז לפעמים הוא לא מספיק הכל וצריך לעבור על כמה שקפים שנשארו לבד.\n\nשעורי הבית: \nרטובים: אם נעזרים ברפרנס הם סבירים, בדגש על להעזר ולא להעתיק. לדעתי מומלץ לקרוא את התרגיל, להסתכל בגדול מה עשו ברפרנס ואז לממש בעצמכם תוך העזרות ברפרנס אם נתקעים. תזכרו גם שלא כל הרפרנסים בהכרח קיבלו 100, תפעילו שיקול דעת ובאמת תבינו את מה שאתם כותבים.\nיבשים: כמעט כל השאלות שם ממבחני עבר, מומלץ להשקיע בהם.\n\nהמבחן: \nקשה מאוד גם מחשבתית, גם מבחינת כמות החומר.\nלפנות לפחות שבוע (רצוי יותר), לעבור שוב על כל החומר כולל הרצאות וכולל תרגולים (עדיף יותר מפעם אחת) ולפתור מבחני עבר כדי להתחדד על טריקים. הם בדרך כלל לא נוטים לשחזר שאלות אבל יש לפעמים רעיונות שחוזרים על עצמם וכדאי להכיר.\nבמבחן שלנו לא היה את השאלות האמריקאיות הידועות לשמצה. כן היו 4 תרגילים ארוכים, עם המון סעיפים, תתי סעיפים וטבלאות. היו סעיפים טריקים , סעיפים שבוחנים שינון של פרטים ספציפים וגם כמה סעיפים מוזרים שלא ברור מה התכלית שלהם. \n\nהשורה התחתונה: \nאתם תלמדו למבחן הזה פי 4 מלכל מבחן רגיל ועדיין זה יהיה אחד הציונים היותר מבאסים שלכם, אבל קורס חובה ואין מה לעשות.\nמבחינת עניין (בתור בן אדם שלא מתחבר לlow level) היו כמה נושאים שבאמת עניינו אותי והרגשתי שחשוב להכיר, שאר\nהנושאים הרגישו לי כמו התעמקות מציקה בפרטים קטנים שלדעתי ממש לא מעניינים (אבל מאוד קריטים במבחן, אז חייב ללמוד ולשנן).", "timestamp": 1691822340733}, {"author": "Kruskal", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דן צפריר + לאוניד רסקין מוקלט\nחוות דעת - הרצאות: התחלתי עם ההרצאות הפרונטליות של דן ואחרי כשבועיים עברתי למוקלט של לאוניד.\nהיה לי קשה עם חוסר הסדר של דן. הוא ביזבז המון זמן על דברים מיותרים (כמו לנסות להפעיל קטע מתוך המטריקס כחלק מהמצגת), ענה על שאלות באופן לא ברור, בקיצור לא התסדרתי איתו. \nלעומת זאת ההקלטות של לאוניד (במגה) היו הרבה יותר מסודרות, הרגיש לי שלאוניד עובר על רוב החומר באופן מסודר וענה לכל הסטודנטים על השאלות (המאוד חשובות אגב) שלהם.\n\nשם המתרגל/ת: אורי בן צור + עידן יניב מוקלט\nחוות דעת - תרגולים: אז שוב, התחלתי עם הפרונטלי של אורי אבל מהר מאוד הבנתי שהוא לא בשבילי. קודם כל זה לא בגללו אלא בגללי. אורי מעביר את החומר מצויין ועונה על כל השאלות עד שכולם אומרים לו שהבינו - הוא מחכה לפידבק שאשכרה כולם סבבה עם מה שנאמר הרגע. מה שהפריע לי זה שהוא התהלך הרבה והיה מאוד קופצני וזה ממש פגע לי בריכוז אז נאלצנו להיפרד כידידים. \nההקלטות של עידן יניב היו פשוט וואו. מסביר את הכל נפלא והיה פשוט תענוג לראות אותן. הרגיש לי שהוא ממש משלים את ההרצאות המוקלטות של לאוניד אז בקיצור לעצלנים שאין להם כוח ללכת להרצאות פרוטנליות, לאוניד + עידן זה שילוב מנצח כמו אש ופיקצ'ו.\n\nשעורי הבית: קודם כל מאוד מאוד מעניינים. התכנות בהפעלה הוא ממש שונה ממה שהכרתי לפני כן במבוא, מת\"מ וכו'.\nהיו 4 רטובים ו-4 יבשים כאשר הרטוב והיבש מתפרסמים ביחד. \nהרטובים רובם עמוסים, במיוחד הראשון והרבה פעמים קרה לי שלא ידעתי ממה להתחיל מרוב שהיה כל כך הרבה עבודה, אבל אחרי קצת נשימות עמוקות ותכנון מקדים הכל הסתדר. הציונים בהם גבוהים - נושקים ל-100 לאחר ערעורים/תיקונים, ובגלל שהם 30% מהציון הסופי כדאי להשקיע. עוד משהו חשוב, כדאי להתחיל לכתוב את הרטוב ברגע שהוא התפרסם ולא לחכות לרגע האחרון, זה חוסך המון לחץ לקראת הסוף.\nהיבשים היו די קלים, נטו לשבת עם ההרצאה/התרגול ולענות על השאלות (שהרבה מהן היו במבחני עבר אז זה תרגול של איך לענות על המבחן).\n\nהמבחן: ארוך בטירוף! הקטע בהפעלה (וגם באת\"מ) שיש יםםםםם חומר והם יכולים לשאול על כל פסיק שמופיע בהצראה או בתרגול ואני לא מגזים. לדוגמה - באחד ממבחני העבר הייתה שאלה שהתייחסה לכותרת של שקופית. אף אחד לא אמר בעל פה את המילה שהייתה כתובה בכותרת אבל הייתה שאלה של לזכור מה כתוב בכותרת.\nלמדתי למבחן כאילו אני לומד לביולוגיה 1. צריך לשנן כמות מטורפת של חומר ולדעת לענות על שאלות.\nהסמסטר למשל בשאלה הראשונה במבחן קיבלו את שתי התשובות (כן/לא + נימוק) וניתן ניקוד מלא למי שידע להסביר את עצמו. חלק גדול מהלמידה למבחן זה להבין מה הם רוצים שנכתוב במבחן ואיך.\n\nהשורה התחתונה: לא כזה משנה מה דעתי על הקורס כי הוא חובה בכל מקרה אבל בסך הכל הוא קורס באמת מעניין עם חומר שרלוונטי ליומיום כמדעני מחשב.\nחבל שהוא מנוהל בצורה גרועה ומזלזלת כי הוא באמת חשוב אבל IT IS WHAT IT IS.", "timestamp": 1691931806225}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: דן בן אדם לא נחמד ולא נעים. מה שקרה זה שכולם פחדו לעצור אותו לשאלות כדי שלא לקבל שיימינג והוא בכיף שלו רץ קדימה ומתפלא איך זה שהוא מצליח להריץ שתי מצגות בהרצאה אחת.\nאת ההרצאות שהפסדנו בגלל המחאה הוא פשוט קבע מתי שמתאים לו ולא טרח אפילו לפתוח זום (אחת מהן אפילו היתה בשישי). בגדול פשוט בן אדם שלא צריך להיות מרצה.\n\nשם המתרגל/ת: עידן יניב (הקלטות)\nחוות דעת - תרגולים: נקודת האור של הקורס הזה. מתרגל מדהים עם הקלטות מדהימות שעושה סדר בבאלגן ומסביר הכי טוב שאפשר לבקש.\n\nשעורי הבית: הרטובים ארוכים, בעיקר רטוב 1 (אבל הזמן שניתן לו הוא בהתאם) אבל די מעניינים והציונים סהכ טובים (כשהקוד לא נופל בbuild בגלל שטויות בדרך). היבשים סבבה כי הם שאלות ממבחנים אבל עם חומר פתוח ורפרנסים.\n\nהמבחן: לכאורה צריך לזכור המון פרטים, לדעתי זה קם ונופל בעיקר על הבנה. כן יש פה ושם שאלות שקמות ונופלות על לזכור פרט אחד שולי כמה מה המהירות של גישה לזיכרון אבל את הרוב אפשר להצליח אם רק מבינים מספיק טוב ולא מבלבלים מושגים. המלצה שלי להתחיל מלקרוא את *כל* המצגות (הרצאות + תרגולים) כמה שיותר זמן מראש.\nמה שכו, מפתח הבדיקה הוא די רע ועוקץ בנקודות על שטויות כמו מילה מסוימת שלא הוזכרה בהסבר.\n\nהשורה התחתונה: קורס ממש מעניין עם מבחן נוראי וסגל הפנים", "timestamp": 1692029158434}, {"author": "טור מספרים מתבדר", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: מצגות\nחוות דעת - הרצאות: \nליאוניד המרצה שהכי לא הצלחתי ללמוד אצלי עד היום בתואר.\n\nלמשל, יש לליאוניד טקס של לשאול שאלה חדשה ואז לעשות סבב ירידות של 5 דקות על כל מי שעונה לא נכון.\n\nמאוד לא נעים בהרצאות ומרגיש שההסברים לא טובים ולא לומדים כלום, והתחושה הזאת לא השתנתה גם כשצפיתי במוקלטות שלו ביוטיוב.\n\nדן קצת יותר טוב, אבל עדיין רץ על המצגות ולפעמים קצת לא נחמד.\nהקש ששבר את גב הגמל הוא שבתקופת המחאות הוא התחיל לזרוק השלמות על ימין ועל שמאל, לפעמים אפילו בהתראה של ערב לפני, וסירב להקליט או להציע אפשרויות השלמה.\n\nבסופו של דבר, החלטתי לא לבזבז את הזמן שלי יותר והתחלתי ללמוד רק מהמצגות ומהתרגולים המוקלטים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עידן יניב (מוקלט)\n\nמצליח להעביר את הרעיונות החשובים שנדרשים בקורס בצורה אלגנטית ותמציתית. ממליץ בחום לצפות במוקלטות שלו.\n\nשימו לב שמשום מה יש הרבה פרטי מידע חשובים שרשומים רק בהערות של קבצי ה-PowerPoint ולא מועברים בשיעור.\n\nשעורי הבית: הרטובים קצת מעיקים, אבל מרגיש כמו הפעם הראשונה שבאמת כתבתי קוד בתואר. היה ממש מעניין להכין אותם ונהניתי מזה מאוד.\n\nהיבשים הרגישו קצת חסרי פואנטה ולא הרגיש שהם תרמו יותר מדי.\n\nהמבחן: בגדול הרגיש הרבה יותר הוגן משנים קודמות (אולי בגלל שדן צפריר המרצה האחראי), חוץ משני סעיפים שהרגישו טיפה לא פתירים ואיזו שאלה הזויה על לממש מנעול עם פקודת xchg (שהופיעה בבערך חצי שקופית באיזו הרצאה).\n\nהשורה התחתונה: קורס עם חומר מעניין בטירוף ותרגולים מוקלטים טובים. המבחן לא טריוויאלי, אבל בהחלט אפשרי אם אתם אוהבים את התחום.\nההוראה והמשאבים המקוונים בין הגרועים ביותר שנתקלתי בהם בטכניון. צריך לבצע שינוי רציני ולהכין הקלטות נורמליות לסטודנטים.", "timestamp": 1692799764099}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לאוניד\nחוות דעת - הרצאות: די מעניינות, חלקן די כבדות עם המון פרטים. קשה לקלוט הכל בפעם הראשונה. המון דימויים שעוזרים לזכור טוב את החומר. לעיתים סוטה מהחומר וחוזר לקראת הסוף ומתחיל לרוץ.\n\nשם המתרגל/ת: עידן יניב (מוקלט)\nחוות דעת - תרגולים: אלוף. שימו לב אם יש שינויים במצגות שלכם לעומת מה שבהקלטות של עידן.\n\nשעורי הבית: 4 רטובים + 4 יבשים. היבשים סבבה. הרבה שאלות ממבחני עבר, שאפשר לרפרנס אך שימו לב אם שינו משהו. הרטוב הראשון הכי עמוס, אך הזמן בהתאם. אם עושים באביב, נסו לדאוג שיפורסם לפני פסח, יכול לחסוך לכם הרבה עומס. שאר הרטובים אחלה וגם די מעניינים, רק שימו לב שלפעמים זה לא תכנות כמו במבני והדיבוג קשוח, צריך ללמוד גם מהאינטרנט, מקורסים אחרים ולהתמצא בסיסית בקוד של לינוקס. מציע לוודא עם רפרנס/ מתרגל/.. לפני שכותבים כדי לוודא שאתם בכיוון ולמנוע בזבוז זמן.\n\nהמבחן: קשוח. דורש המון שינון. כמו בש\"ב, הם מכוונים למשהו מסוים ולא תמיד זה ברור לאן. לטעמי גם הרבה בעיות ניסוח. מציע לכתוב הרבה כדי להגדיל את הסיכוי שתימצא המילה שהם מחפשים.\n\nהשורה התחתונה: קורס מעניין, חשוב אך יכול להעיק בגלל המבחן.", "timestamp": 1693824769564}, {"author": "Power PC", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות:  אני התחברתי אל דן, לדעתי החומר הועבר בצורה מעניינת. הוא גם עונה על שאלות אבל יש סיכוי שהוא ייכנס בך, תלוי מה השלה ומה המצב רוח שלו (איך הוא התעורר כשעשו לו SIGCONT). \n\nשם המתרגל/ת: עידן יניב (זה ששר סרט הודי)\nחוות דעת - תרגולים: את יפהההההה כל כך יפהההההה הכי יפה בעולם 3>\nתותח אמיתי, לא הרגשתי צורך אפילו לנסות מתרגל בלייב כי עידן הוא נסיך. הכל עובר בצורה ברורה והידע שלו בחומר מדהים כמעט כמו יכולות השירה שלו. החיסרון היחידי בהקלטות הוא שסדר החומר בסמסטר לא תמיד חופף למה שהיה בהקלטות אך כן אציין שהסגל סידר את ההקלטות מראש בGR לפי הסדר של הסמסטר שלנו.\n\nשעורי הבית: 4 רטובים ו4 יבשים. היבשים ממש אחלה ולא ארוכים מידי. השאלות שם דומות מאוד לשאלות במבחן.\nהרטובים ארוכים יותר. אזור דו ספרתי (אבל לא יותר מ20) של שעות עבודה משותפות על תרגיל. התרגיל הראשון ארוך יותר משמעותית מהשאר אבל הוא גם הכי קל מבחינת קוד. תרגיל בית ארבע היה על חומר של אתמ בכלל (מימוש allocator).\nהדדליינים היו נוחים אבל עדיין יצא שכל שבוע עובדים על תרגיל אחר.\n\nהמבחן: כמו שכתבו פה, אין לי מה להוסיף\n\nהשורה התחתונה: הקורס עמוס ויש הרבה חומר, אבל בהחלט אפשר להצליח אם משקיעים והוא מעניין והרטובים ממש מגניבים", "timestamp": 1696428286568}, {"author": "ferberonix", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לאוניד רסקין\nחוות דעת - הרצאות: לאוניד מרצה בעל ידע רב ומצחיק. אל תשלו את עצמכם- מדובר במרצה המזלזל בסטודנטים. כאשר סטודנט שואל שאלה לאוניד כועס עליו שהוא לא מבין את החומר. בנוסף, שיטת הלימוד שלו היא הסברים בעל פה נטו תוך מעבר מהיר על המצגות. בקורס כל משפט בכל שקף בהרצאות חשוב ולכן ההרצאות של לאוניד לא מועילות כמעט. נדרש מכם לעבור על כל ההרצאות והתרגולים של הקורס כדי להבין את כל החומר. כשאני אומר הכל אני מתכוון הכל- ההערות, התמונות, הדוגמאות המסובכות ואפילו תאריך יצירת ה- pdf של ההרצאה.\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: ללכת לתרגולים פרונטליים זה בזבוז זמן. כדי להבין את החומר יש לצפות בתרגולים המוקלטים של עידן. כדי להיות מומחה ובעל ידע מספיק טוב בקורס יש לצפות בתרגולים מוקלטים של מוחמד שהם יותר עדכניים. זה בנוסף למעבר עצמי על כל שקפי התרגולים כדי לא לפספס אף מידע.\n\nשעורי הבית: רטוב ראשון קשה כי הוא ארוך מאוד- יותר מכל מה שהיה עד עכשיו בתואר. השאר בסדר. הגיליונות היבשים לא כל כך קריטיים להצלחה משום שבין כה וכה הם לקוחים ממבחנים ותעשו אותם כהתכוננות למבחן כאשר אתם אמורים לדעת את כל החומר.\n\nהמבחן: ביזיון אחד גדול. מועד א' ארוך אך די הוגן. דן בנה אותו. מועד ב'- שואה גרעינית. \nלאחר מתקפת ה-7 באוקטובר נראה שלאוניד רצה לייצא את זעמו על חמאס (דרך pipe) אל המבחן. הנושא שנלמד הכי גרוע בקורס- תקשורת, הופיע בשאלה אמריקאית שדורשת דיוק רב. כתוצאה מכך המון סטודנטים נפלו בהרבה שאלות. כולל עבדכם הנאמן שלראשונה בחייו טעה בכל האמריקאיות בשאלה. שימו לב שמטרת האמריקאיות היא להכשיל שכן הסגל ולאוניד לא מוכנים לקבל תשובות אחרות אפילו שהשאלות מנוסחות בלאונידית מתקדמת. יתרה מכך, כדי להעמיק את תחושת האכזבה מהסטודנטים כל החלק האחרון של הקורס (4 הרצאות ו-4 תרגולים - זיכרון וירטואלי ומערכות קבצים) לא נכלל במבחן על ידי הסגל. \nכמו כן, במייל לפני המבחן חוט בשם לאוניד טען בפניי שהמבנה זהה למועד א' ולמבנה שלא השתנה בשנים האחרונות- שקר וכזב. במועד א שחוט בשם דן בנה, לא הייתה שאלה אמריקאית ולא היה ניסוח לאונידי. ניכר כי הסנכרון בין החוטים (המרצים) לא קיים אפילו שמדובר בנושא בסיסי שנלמד בהרחבה בקורס.\n\nמסקנה: ראו הוזהרתם- אדם החושב שיודע כל בהפעלה סופו שימצא דרכו לכשלונו באדיבות הסגל.\n\nהשורה התחתונה: הקורס חשוב ביותר. אחריו מרגישים שניתן להביס כל קורס בתואר. כמו כן, הוא מעניין מאוד. הכלל המנחה בקורס הוא תזכור או שיכשילו אותך.", "timestamp": 1704710563778}, {"author": "א.ב.", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דן\nחוות דעת - הרצאות:\nאצל דן רואים שהוא חי את החומר, וממש מכיר את הדברים מבפנים. בגלל זה, למרות שהחומר יחסית טכני, אצל דן הוא יותר מעניין. לפעמים זה קצת מקשה על ההבנה, כשדן מדבר בשפה מקצועית יותר ממה שאני רגיל. עם הזמן התרגלתי לזה, ובסופו של דבר אני חושב שזה עוזר להיכנס לעולם המושגים של מדעי המחשב.\n\nשם המתרגל/ת: הראל\nחוות דעת - תרגולים: \nהראל מסביר את החומר בצורה מאוד מסודרת וברורה. בלי התרגולים היה מאוד קשה להפנים את החומר של הקורס. בנוסף, הרבה פעמים נשאר זמן, ואז הראל היה מוסיף תרגילים ממבחני עבר, ונותן טיפים טובים איך לגשת לשאלות מסוגים שונים, ובאופן כללי למבחנים בקורס.\n\nשעורי הבית: \nהיבש די קל, בד\"כ צריך רק לזכור איפה במצגות הדברים כתובים.\nהרטוב מאוד עמוס, דורש שבועות של כתיבה ודיבוג.\n\nהמבחן:\nמעצבן, נראה שרוצים להכשיל. צריך לשנן כמויות של חומר.\n\nהשורה התחתונה:\nזה קורס חשוב ובסיסי. הוא בנוי היטב, גם מבחינת החומר והסדר שלו, וגם מבחינת היחס בין ההרצאות לתרגולים. לי אישית היה קצת קשה עם כל הפרטים הטכניים שצריך לזכור. אבל הרעיונות שהועברו הם גם קריטיים כמעט לכל דבר שאפשר לעשות בהמשך התואר והתעסוקה, וגם חשובים כדי להבין איך ליצור ולנהל מערכות בצורה חכמה.", "timestamp": 1711535524927}, {"author": "שלמה אבנון", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ליאוניד\nחוות דעת- ליאוניד מעביר את החומר בצורה ממש מעניינת\nהרצאות: הוא לא מכסה את כל החומר בהרצאה, אבל TRADEOFF משתלם\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: דניאל ממש מומלץ, סבלני וברור\n\nשעורי הבית: הראשון עמוס רצח, השאר סבירים מאוד\n\nהמבחן: דורש לשנן את החומר, לא הרבה יצירתיות\n\nהשורה התחתונה: קורס מעניין מאוד(לא שיש לכם ברירה בכל מקרה)", "timestamp": 1714927922727}, {"author": "Adan", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אנאסטזיה\nחוות דעת - הרצאות: לא מדלגת על אף הערה חשובה ולפעמים כותבת דברים על הלוח הצעתי שתצלמו אותם ותכתבו הערות שהיא אומרת בעל פה כי אחד הדברים שהיא הסבירה ולא היה כתוב במפורש בשקפים בא במבחן.\n\nשם המתרגל/ת: מאלק\nחוות דעת - תרגולים: מסביר טוב ולפעמים אומר הערות כמן \"חשוב שתבינו את זה למבחן\" או \"חשוב שתבינו את זה לתרגיל בית 4\" למשל וזה באמת עוזר לצמצם את כמות החומר שצריך לזכור בעל פה.\n\nשעורי הבית: מאוד עמוסים וארוכים אבל חלק מהם עוזר בהבנת החומר.\n\nהמבחן: יש הרבה details שצריך לזכור בעל פה למבחן ואפילו יותר הרבה דברים שצריך להבין לעומק, תתחילו ללמוד במהלך הסמסטר ותשאלו שאלות כי כל דבר קטן עשוי להיות במבחן.\n\nהשורה התחתונה: קורס מאוד עמוס ודורש הרבה השקעה ואנרגיה אבל גם קורס כיפי למי שאוהב את התחום ומאוד מעניין אם מבינים את החומר נכון.", "timestamp": 1716067391300}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ליאוניד\nחוות דעת - הרצאות:\nממש אהבתי את שיטת הלימוד שלו. \nלא ממש מבין למה סטודנטים מתלוננים. אני לא צריך מרצה שיקריא לי שקופיות, אלא מרצה שמעביר את החומר בצורה ממש מעניינת, ובצורה מקיפה.  בסופו של דבר, צריך לשנן את כל החומר, אז זה לא משנה בין אם תלכו למרצה אליו או למרצה אחר. \nאישית מאוד נהנתי את מההרצאות שלו. \n\nשם המתרגל/ת: עידן מוקלט\nחוות דעת - תרגולים: \nאני חושב שאלו התרגולים הכי טובים. היה גם את דניאל שהוא המתרגל האחראי, שגם כן שולט בחומר, אבל הרגשתי שהוא לא מכסה חלק ממש גדול מהתרגולים, אבל כן מבהיר נקודות חשובות. ניתן לבחור מבין השניים\n\nשעורי הבית: \n4 תרגילי בית רטובים, לא ממש קשים וברמה סבירה.\n\nהמבחן: \nכפי שצויין, צריך לשנן את כל החומר, ואני מתכוון לכל שורה בכל שקופית. זה המון חומר, ולכן במידה ואין לכם מספיק זמן ללמוד, כדאי להתחיל כבר בזמן הסמסטר.\n\nהשורה התחתונה: \nאחלה קורס", "timestamp": 1716478611962}]}