{"posts": [{"author": "Alon", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: פרופ' גיל ברקת\nשם המתרגל/ת: גיל בן־שחר, סתיו פרל\nחוות דעת: *סמסטר קורונה מקוון*\nהרעיון של הקורס הוא להכשיר צוות מתאים שישתתף בתחרות בינ\"ל. כל הקורס עוסק בהכנה לשאלות של התחרות.\n1. בכל שבוע יש מפגש של 3 שעות: שעה ראשונה לומדים נושא, בשעתיים שלאחר מכן יש תחרות ומקבלים שאלות שצריך לפתור בנושא הנלמד.\nכל שאלה שפותרים שווה נקודה, כל שאלה שלא מספיקים לפתור בכיתה אפשר לפתור עד המפגש הבא והיא תהיה שווה 0.25 נקודות, אז ממש כדאי לשים דגש על השאלות שבכיתה ולפתור בזמן. אלו לא שיעורי הבית, אלו שאלות כיתה. צריך לבוא עירני וחד כי אלו שעתיים של לחץ של לפתור שאלות ולהספיק יותר מצוותים אחרים ובדר\"כ מסיימים מותשים את הסדנה בגלל אווירת התחרות.\n2. החל משבוע 3/4 כזה הכל מפסיק להיות ביחידים (הסדנאות ות\"ב) והופוך להיות בקבוצות של 3 כמו שיהיה באמת בתחרות הסופית (מחשב אחד לכל השלשה!). במהלך הסדנה אפשר לשאול שאלות את הסגל ולקבל הכוונה על דברים שנתקעים בהם.\nהערה: אין טעם לנסות לבחור צוות לפני שמקבלים אישור רשמי שהתקבלתם לקורס כי בסוף יש מצב שאחד מהחברים שלכם לא יתקבל לקורס (מבדיקה שעשינו אנחנו חושבים שממוצע של 84 בשני הקורסים: מבני נתונים ובאלגוריתמים, זה מה שצריך כדי להתקבל).\n3. החומר של הקורס נחמד מאד, אבל יש הרבה מאד מקרים נישתיים ולא מעניינים. הבעיות בבסיסן לפעמים דומות קצת לשאלות של ראיונות עבודה, אבל אני לא מרגיש שהקורס עזר לי בתחום הזה בכלל, והשאלות בעיקר מתישות לדעתי, הרבה פעמים אפילו סתם צריך להכיר טריק או להשתמש בטריק שלימדו או לא לימדו וזה באמת מרגיש חסר טעם.\n4. הסגל של הקורס על הפנים, במיוחד במענה למיילים ולפניות של סטודנטים. את המרצה ראינו במצטבר ל־5 דקות. כשסתיו לימדה נושאים זה היה סבבה. לא טרחו לעדכן את הסילבוס ויש כל מיני טעויות ופאשלות לאורך הסמסטר שגורמות להרגיש שלצוות לא אכפת ממך בכלל.\n5. הממוצע והחציון מאד גבוהים כמו שאפשר לראות, חבל שהתרגילים שנותנים ממש מעצבנים והרבה פעמים פשוט מרגיש כמו בזבוז זמן אדיר ובסוף הרבה מהסטודנטים מרפרנסים מפתרונות שמוצאים ב־github. חשוב להכיר גם את האתר הזה: udebug.com\n\nשיעורי הבית:\nפשוט עוד שאלות שצריך לפתור והציון עליהן תקף, בלי קשר לשאלות מהכיתה שלא מספיקים. בממוצע יש 2 שאלות ש\"ב בשבוע (בהתחלה ביחידים, בהמשך זה בקבוצות והעומס קצת פוחת). אבל הרבה פעמים רוצים להספיק לפתור את השאלות מהכיתה בבית ואז זה כבר נעשה עוד יותר עמוס.\n\nעומס כולל:\nאני מעריך יום השקעה בשבוע או 2-3 אם רוצים גם לעשות את השאלות שלא מספיקים בכיתה.\n\nהמבחן:\nבמקור המבחן אמור להיות בסוף הסמסטר, כולם נפגשים לתחרות משותפת. משום מה, זה לא כתוב בלוח מבחנים ועלול להתנגש או להפריע, והם מפרסמים את התאריך באיחור. הסמסטר היה מקוון והמבחן בסוף בוטל ועשינו עוד ת\"ב במקום.\n\nהשורה התחתונה: \nלדעתי האישית יש יותר מידי 'הייפ' סביב הקורס הזה. ממליץ רק למי שאוהב לפחות 7 מתוך עשרת הדברים האלו: CPP, מבני נתונים, אלגוריתמים, תכנות דינאמי, גיאומטריה חישובית, שאלות קנטרניות, סגל מזלזל, תחרותיות, ממוצע גבוה.", "timestamp": 1597997884754}, {"author": "nivimani", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "* לשים לב - כדאי לבחור קבוצה מוקדם כי הציון תלוי בהם.\n\nשם המרצה: לא רלוונטי\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: תומר כהן, גיל וסתיו\nחוות דעת - סדנאות: תחרויות כיפיות (צריך להגיש ~5 בעיות ביחיד או בקבוצה, והניקוד נקבע לפי מספר ההצלחות), לפעמים קצת לא הוגנות (משהו לא הוסבר כמו שצריך או שהשרת איטי), אבל בסופו של דבר שווה להגיע פיזית.\nהייתי צריך לשלוח הרבה מיילים בגלל חוסר הבנות, והגשות שנסגרו או לא נפתחו, אבל ענו לי בסוף (גיל אחראי על מיילים).\n\nשעורי הבית: השלמות מהסדנאות - לפעמים לא שווה את הזמן (מקבלים ניקוד חלקי).\n\nהמבחן: ארוך ומאתגר,  יש כיבוד :)\nהציון מתפלג סביב 90, לפי ש\"ב והתחרות הסופית\n\nהשורה התחתונה: קורס מאוד מעניין, המתרגלים קצת עצלנים לפעמים אבל זה לא משפיע משמעותית על הקורס.", "timestamp": 1626164797274}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: תומר כהן, גיל וסתיו\nחוות דעת - תרגולים: לא מועילים במיוחד. כדאי גם ככה לעבור על החומר שלהם לפני התרגול כי מיד אחריו יש את התחרות על הנושא של התרגול.\nההתנהלות של הסגל הייתה די מזלזלת אבל לא השפיע יותר מדי על הקורס.\n\nשעורי הבית: יש שני תרגילי בית ארוכים ממש. הראשון ביחידים והשני כצוות אז פחות עמוס.\nאת התרגילים שלא פתרתם בתחרות שיש כל שבוע אפשר להשלים אחרי התחרות בשביל ניקוד חלקי. אלא אם כן כבר ממש יש לכם את הפתרון - אל תעשו את זה. זה ממש לא שווה את ההשקעה. \n\nהמבחן: תחרות של 5 שעות. יש כיבוד אבל בקושי נוגעים בו כי תחרות. אווירה לחוצה ואינטנסיבית כמצופה.\n\nהשורה התחתונה:\nהיחידים שאני אמליץ להם לקחת את הקורס הם אלו שמנסים להכנס לתחום של תחרויות תכנות תחרותיים כי רק לזה הקורס הזה מועיל.\nהקורס מאוד עמוס במהלך הסמסטר. במיוחד אם אתה מנסה להשקיע כי אכפת לך מהנושא. עם זאת, בסופו של דבר התחרות היא 50% מהציון הסופי ואין מועד ב אז אם לא הלך טוב בתחרות - תקבל ציון באזור ה80 עבור ההשקעה שלך. ממש לא משתלם לדעתי.", "timestamp": 1626632449244}, {"author": "s", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גיל ברקת\nחוות דעת - הרצאות: אין הרצאות, רק סדנאות.\n\nשם המסדנת/ת: גיל בן שחר/סתיו פרלה/תומר כהן\nחוות דעת - סדנאות: כל פעם מישהו אחר (מה-3 הנ״ל) מעביר את הסדנאות, בשעה הראשונה מועבר חומר ואחרי זה יש תחרות.\nהסדנה כיפית והחומר מעניין (לרוב), אבל יש המון שאלות מאתגרות וקשות.\n\nשעורי הבית:\nיש את התרגילים שהם בונוס (אלה שלא משלימים בכיתה) ויש את 2 תרגילי הבית הגדולים. התרגילים מאתגרים ולא קלים בכלל. ויש תחרות סופית בסיום הקורס שהיה לנו המזל לעשות פרונטלית והיא הייתה ממש כיפית.\n\nהשורה התחתונה: \nהקורס כיפי ומעניין אבל דורש קצת השקעה ותרגול כדי להצליח לפתור את הבעיות, אז מי שאין לו זמן שלא ייקח.", "timestamp": 1630065731333}, {"author": "anon", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אין\nשם המתרגל/ת: גיל בן שחר, תומר כהן, אוריאן ליצירגוחכלקך\nחוות דעת - תרגולים: \nכל שבוע יש תרגול של שעה ואז תחרות של שעתיים.\nהתרגולים חשובים לקראת התחרות.\nהמתרגלים טובים ומפגינים יחס מעולה לסטודנטים \nשעורי הבית: \nאת התרגילים שלא מספיקים בתחרות בכיתה אפשר לעשות כתרגילי בית, וזה מוסיף לציון (אבל במשקל קטן יותר אז עדיף לפתור כמה שיותר בכיתה). התרגילים האלו הופכים לסוג של מטלה שבועית כי נדיר שיש תחרות שבה מישהו מסיים את כל התרגילים.\nיש גם שני תרגילי בית שלוקחים הרבה זמן.\n\nהמבחן: \nאין.\nיש תחרות בסוף הקורס.\n\nהשורה התחתונה: \nקורס ממש כיף. בגדול פותרים חידות שחלקן קשורות למבני ואלגו, וחלקן לא, ואז מתכנתים אותם.", "timestamp": 1657611014255}]}