{"posts": [{"author": "Shahar Itzko", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: מירי בן חן\nחוות דעת - הרצאות: המרצה מושלמת, ההרצאות דיי מעניינות\n\nשם המתרגל/ת: מיכל אדלשטיין\nחוות דעת - תרגולים: התרגולים לא היו מספיק אינפורמטיביים. החומר שהיה צריך לתרגילי הבית נלמד אצלנו ברובו המוחלט מהאינטרנט. גם המצגות מכווינות לאתרים ופחות מלמדות את מה שנדרש לתרגילי הבית, וחבל.\n\nשעורי הבית: עמוסים מאוד מאוד מאוד מאוד מאוד מאוד מאוד מאוד מאוד. אבל התוצאה אדירה\n\nהשורה התחתונה: לא לקחת את הקורס עם עוד קורסים רטובים או בכלל בסמסטר עמוס", "timestamp": 1612370511777}, {"author": "Saar Shechter", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: מירי בן חן\nחוות דעת - הרצאות: בהרצאה הראשונה נפתחו לי העיניים לרווחה, סוף סוף קורס טכניוני שקולע בול לתחום העניין שלי.\nהמון רפרנסים לסרטים, סדרות, משחקים. אני ממש אהבתי. היו כמה נושאים שפחות התחברתי אליהם, אבל ככה זה בכל קורס. מירי גם סבלנית ומסבירה טוב, וגם מפרגנת במשימות קטנות שנותנות בונוס לציון הסופי\n\nשם המתרגל/ת: מיכל אדלשטיין\nחוות דעת - תרגולים: אני פחות התחברתי לתרגולים, הרבה פעמים זה הרגיש קצת כמו תצוגת תכלית של מה אפשר לעשות עם הכלים, ואם אתם רוצים ללמוד איך לעשות את זה - לכו ללמוד לבד באינטרנט. מיכל היתה סבלנית ותמיד הסבירה שוב אם אנשים ביקשו, אבל לצערי זה לא הספיק, לא הרגשתי שהתרגולים עזרו לי להבין את החומר ונאלצנו בעיקר ללמוד לבד ממדריכים באינטרנט (הודים ביוטיוב לשלטון)\n\nשעורי הבית: שיעורי הבית הכי עמוסים שנתקלתי בהם בתואר בפער גדול. *אל* תיקחו את הקורס יחד עם קורס כבד אחר (בטח לא ריוורס!!!! ותודה לאורן)\nחשוב ממש להשקיע כי זה 50% מהציון\nלמרות שהיה עמוס בטירוף - אלה שיעורי הבית שהכי נהניתי לעשות, ותחושת הסיפוק של אחרי שבועיים של דיבוג אתם מצליחים לרנדר ארנב על המסך היא פרייסלס\nעושים המון דברים מגניבים בש.ב כמו רינדור, הצללות, טרנספורמציות, אנימציות ואפילו toon shading שזאת שיטת הצללה שמשתמשים בה במשחקים כמו borderlands. מטורף\n\nהמבחן: המבחן קצת מוזר ומתמקד בעיקר בדברים שתרגילי הבית לא נוגעים בהם, אז צריך להשקיע בו קצת זמן. אבל הוא נבדק בצורה הוגנת, והמגן המטורף מתרגילי הבית מקפיץ את הציון\n\nהשורה התחתונה: הקורס הכי עמוס והכי כיף שעשיתי בתואר\nאם היה גרפיקה 2 הייתי לוקח\nאל תיקחו עם קורס עמוס נוסף, אלא אם אתם ממש אוהבים לסבול\nתשקיעו בש.ב, תלמדו טוב למבחן ותצאו גם עם ציון טוב וגם עם הבנה בסיסית פלוס של מה קורה מאחורי הקלעים כשאתם רואים סרט, משחק או הדמיה אחרת.\nמי שמתחבר לתחום - בעיניי זה קורס חובה\nמומלץ מאוד מאוד מאוד", "timestamp": 1614592365701}]}