{"posts": [{"author": "SR", "difficultyRank": 5, "generalRank": 3, "semester": "201801", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: ההרצאות היו בעיניי ממש מרדימות ומשעממות. בדיעבד הייתי מוותר עליהן לגמרי, די מיותרות.\n\nשם המתרגל/ת: סיפן נוה\nחוות דעת - תרגולים: סיפן מתרגלת תותחית ממש! מסבירה הכל מ-א' עד ת' ותמיד משתדלת לענות על כל השאלות עד שיהיה ברור.\n\nשעורי הבית: תרגיל בית 1 היה עמוס בטירוף. ממליץ להתחיל לעבוד עליו בהקדם ולא לדחות לרגע האחרון. תרגיל 2 היה קליל והיה אפשר לסיים בכמה שעות.\nתרגיל בית 3 היה יותר עמוס מתרגיל 2 אבל פחות מתרגיל 1. הבעיה העיקרית איתו הייתה המון המון אי בהירויות של המתרגל האחראי, שגם ענה בצורת קצת מזלזלת לסטודנטים על השאלות - מה שעיכב את ההגשה בהרבה ממה שהיה צריך.\n\nהמבחן: המבחנים בקורס ארוכים בטירוף ואתה מרגיש במירוץ נגד הזמן במשך שלוש שעות. במבחן שאני עשיתי החלק הכי מייאש הייתה שאלת המרצה- 15 נקודות שבהן שואלים אותך על כל מיני שגיאות קומפילציה / קישור שאף אחד לא באמת זוכר מההרצאה.\n\nהשורה התחתונה: קורס חשוב ויחסית טכני שהמטרה העיקרית שלו היא להתנסות בתכנות יחסית \"כבד\". \nאבל אישית אני לא כזה נהניתי ממנו כמו קורסי המשך תכנותיים אחרים.", "timestamp": 1597746045828}, {"author": "יונתן", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nקורס מעניין מאוד, לומדים תכנות מתקדם בפעם הראשונה וזה מאוד מרחיב את האופקים בכל מה שקשור לתכנות.", "timestamp": 1597852458333}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רון רובינשטיין\nחוות דעת - הרצאות: \nאני מדבר על סמסטר קורונה.\n\nההרצאות די חפפו לתרגולים עם מעט תוספות ,דגשים ועקרונות ששווה להגיע להרצאות בישבלן כי הן עוזרות בהכוונה לשיעורי הבית.\n\nליאב היה פחות מוצלח ורון היה מעולה \nשם המתרגל/ת: המתרגל ב ZOOM\nחוות דעת - תרגולים: \nתותח,מומלץ\nשעורי הבית: \nשיעורי הבית מאוד מאוד עמוסים , תבחרו את בן הזוג שלכם בצורה טובה.\nת.ב 1 לוקח סדר גודל של 80 שעות עבודה\nת.ב 2 סדר גודל של 15~20 שעות\nת.ב 3 סדר גודל של 80 ~ 100 שעות עבודה\n\nתיעזרו המון בפורום ותיקראו מה אנשים שאלו שם , הרבה פעמים זה ייסגור לכם פינות שלא חשבתם עליהם\n\nלא כדאי לרוץ להתחיל ראשונים את הפרויקט , אם יש לכם עומס במקצועות אחרים תטפלו בו ואז  תיגשו לפרויקט כי לרוב חברים \\ אנשים מסביב יוכלו לענות על רוב השאלות והחלודה של ההתחלה.\n\nתכתבו טסטים לעצמכם! ותפרסמו , לא לסמוך על טסטים של אחרים\n\nהמבחן: \nאצלנו הייתה עבודה.\nהשורה התחתונה: \nקורס מאוד עמוס מבחינת שיעורי הבית ,\nמעניין ובחירת בן הזוג היא קריטית", "timestamp": 1597910450584}, {"author": "ליאור", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: מרצה טוב אך מי שלא חזק בידע הבסיסי קשה להבין אותו לפעמים. המבחנים שלו ארוכים מאוד וקשה לסיים אותם\n\nשם המתרגל/ת: נוי מאור\nחוות דעת - תרגולים: אחלה מתרגלת מסבירה די טוב\n\nשעורי הבית: 3 תרגילי בית רטובים שלוקחים זמן, כדאי לפנות להם זמן ולא לדחות אותם לכמה ימים לפני הגשה כי יש באגים\n\nהמבחן: \n\nהשורה התחתונה: מעניין ועמוס", "timestamp": 1598012929695}, {"author": "שחר", "difficultyRank": 4, "generalRank": 4, "semester": "201901", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: הרצאות לא מאוד מעניינות אך חשובות כשגרשון הוא המרצה האחראי, מכיוון שהוא אוהב להכניס שאלת מרצה למבחנים שהוא כותב. מסביר תהליכים שקורים כשתוכנית רצה שלווא דווקא רשומים במצגת (ממליצה להדפיס את השקופיות ולהגיע איתן להרצאות ולהוסיף הסברים עליהן, גם ככה יש חומר פתוח במבחן אז תדפיסו הכל לקראתו).\n\nשם המתרגל/ת: נוי\nחוות דעת - תרגולים: מתרגלת טובה שדואגת שכולם יבינו את החומר. סה\"כ אין המון חומר חדש ללמוד כל תרגול והוא בעיקר חזרה על ההרצאות ומתן כלים קצת יותר פרקטיים למימוש תרגילי הבית. בסוף כל שיעור יש שאלה קלה ממבחן שתכלס עד לשלב ההתכוננות למבחן לא הבנתי איך זה קשור כ\"כ.\n\nשעורי הבית: 3 תרגילים רטובים. בראשון והשלישי בהתחלה מממשים מבנה נתונים כלשהו, ואז משתמשים בו בחלק השני של התרגיל. בתרגיל השני כותבים תוכנית קצרה בפייתון תוך שימוש בספרייה שנכתבה ב-C, לא מסובך בכלל למי שמכיר פייתון, ולמי שלא מכיר קצת עזרה מהכרת הפעולות השונות באינטרנט סוגרת פינה.\n\nהמבחן: ארוך מאוד. ממליצה בתחילת ההתכוננות למבחן לפתור רוחבית- לעבור על ההרצאות של C ואז לפתור שאלות ב-C ואח\"כ אותו דבר ב-C++. בסוף לפתור מבחנים על זמן שכן במבחן אין הרבה ממנו. כל הזמן להסתכל על סריקות כי יש יותר מדרך נכונה אחת לפתור כל שאלה, וטוב לקבל אינדיקציה על מה מורידים נקודות.\n\nהשורה התחתונה: החומר לא מאוד מסובך או מחדש למי שמגיע עם רקע בסיסי במחלקות/ מבני נתונים. העומס של תרגילי הבית וההכנה למבחן הם החלק המתיש בקורס.", "timestamp": 1598212928904}, {"author": "Aviram Shovali", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהיה פרוייקט במקום מבחן, מאתגר מאוד ומלמד\nהשורה התחתונה:  אחד הקורסים המעניינים", "timestamp": 1598345525450}, {"author": "Bjarne Stroustrup", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: רן + ליאב\nחוות דעת - הרצאות: בגלל הקורונה ההרצאות היו מוקלטות מראש. הן היו ממש בסדר, הסבירו בצורה יחסית טובה.\n\nשם המתרגל/ת: וידאו\nחוות דעת - תרגולים: בגלל הקורונה שלחו אותנו לוידאו של לפני כמה שנים. החומר לא הכי מעודכן, אז די חילקו לנו מאיזה דקה עד איזה דקה לראות כל שבוע. המתרגל בוידאו די בסדר, לא בטוח שבסמסטר רגיל הייתי הולך על האופציה הזו.\n\nשעורי הבית: 4 תרגילי הגשה תקפים, השני (C) והרביעי (C++) מאוד מאוד עמוסים וקשים (הראשון הוא הגשת חימום כזאת כדי להכיר את הסביבת הרצה שלהם, והשלישי הוא פייתון די קליל).\n\nהמבחן: בגלל הקורונה קיבלנו עבודה במקום- היה מאוד מאוד עמוס, וכמות העבודה לא הייתה מותאמת לכמות הזמן שקיבלנו. גם הבדיקה הייתה מאוד מוזרה- הרבה טסטים בכלל לא היה ברור מהם, והיו כמה פעמים שנבדק מחדש בגלל טעויות שלהם בבדיקה.\n\nהשורה התחתונה: הקורס עצמו די מעניין, אבל הסגל היה על הפנים והקורס הסתיים בצורה ממש גרועה.", "timestamp": 1607386755786}, {"author": "מנשק גנרי", "difficultyRank": 5, "generalRank": 2, "semester": "201803", "text": "שם המרצה: קופרשטוק\nחוות דעת - הרצאות: על הפנים. כבר היה עדיף לחפש הרצאה בוידאו. ההרצאות הרגישו כמו סשן שאלות תשובות עם אנשים שיש להם כבר רקע בתכנות שהסיטו את הדיון פעם אחר פעם.\n\nשם המתרגל/ת: ישראל גוטר\nחוות דעת - תרגולים: חוויה בלתי נשכחת. כל מה שלא הבנו בהרצאה, ישראל הסביר מחדש. היו ימים שהוא תירגל אותנו עד 22 בלילה. נשבע לכם. עשה זאת בשבילנו. היו ימים שישבנו כמעט כל היום בתרגולים איתו, בנוסף לשעתיים הרצאה של הקורס. אחחח סמסטר קיץ בלתי נשכח. ישראל תיאטרלי מאוד, יש לו חוש הומור, והלוואי שהיו מתרגלים כמוהו בקורס. \nאך בכל זאת היה חסר בתרגול דוגמות ופתירת שאלות שרואים במבחנים. \n\nשעורי הבית: המון המון. התרגילים רטובים תפסו את כל הזמן למיטב זכרוני. שעות על גבי שעות של כתיבת קוד. היבשים היו בסדר. \n\nהמבחן: קשה ולא הוגן במועד ב'. סגנון שאלות אחר לחלוטין ממבחנים בשנים קודמות. לראשונה קיבלתי ציון נמוך יותר במועד ב' למרות שהתכוננתי היטב. \n\nהשורה התחתונה: הכי טוב להיות שומע חופשי בתרגולים של ישראל. אבל מה לעשות שזה קורס חובה עם המון שיעורי בית. ומבחן זוועה.", "timestamp": 1610241324402}, {"author": "ת", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גרשון\nחוות דעת - הרצאות: Top\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לוקחים המון זמן, צריך להתחיל כמוקדם יותר \n\nהמבחן: \n\nהשורה התחתונה: צריך השקעה", "timestamp": 1612451660193}, {"author": "c'tor", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: על גבול המרדימות, לא רלוונטיות לרוב החומר שדרוש לדעת לש\"ב או למבחן ומרגיש שהם סתם\n\nשם המתרגל/ת: נלסון\nחוות דעת - תרגולים: מתרגל מדהים, מסביר מצויין\n\nשעורי הבית: בעיקר ארוכים, אבל לא חכמים במיוחד, אבל ארוכים, ממש\n\nהמבחן: \n\nהשורה התחתונה: לא קורס מהנה במיוחד, לדעתי גם לא מלמד במיוחד", "timestamp": 1613638573116}, {"author": "מונטי פייתון", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גרשון \nחוות דעת - הרצאות:מרצה מצויין\nשם המתרגל/ת:  אורטל כהן\nחוות דעת - תרגולים:  אחלה מתרגלת, מאוד סבלנית ומסבירה נהדר את החומר, הסמסטר היה בזום אז חלק מהתרגולים ראיתי גם את המוקלט.\n\n\nשעורי הבית:  לא פשוטים אבל מאוד מלמדים\n\nהמבחן: הסגל צריך לפרסם פתרונות למבחנים, זה הזוי שיש מספר מאוד מצומצם של בחינות פתורות ואת השאר מסתכלים בscanf \n\nהשורה התחתונה:", "timestamp": 1613639580428}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גרשון \nחוות דעת - הרצאות: סביר\n\nשם המתרגל/ת: נלסון\nחוות דעת - תרגולים: לדעתי מתרגל מעולה מסביר ברור ועונה לשאלות\n\nשעורי הבית: עמוסים מאוד, צריך להתחיל כל מטלה מתי שמקבלים כדי להספיק לשלב עם שאר הקורסים ולהגיש בזמן\nחלק מהמטלות מורכבים מחלק יבש וחלק רטוב היבש לוקח מס שעות בודדות אבל הרטוב לוקח פי 10 זמן \n\nהמבחן: השאלות סבירות, אם מתרגלים הרבה מבחנים זה מתחיל לחזור על עצמו אבל יש הרבה נקודות קטנות שצריך להיות על הכל וכמובן הזמן הוא פקטור מאוד גדול במבחן\n\nהשורה התחתונה: קורס עמוס מאוד, המטלות לוקחות ים זמן אבל מאוד כדאי להשקיע בהם כי לומדים ממש טוב \nהקורס יחסית מבולגן כי אין ככ תיאום בין המרצה למתרגל אבל שורדים", "timestamp": 1613853106627}, {"author": "טריוויאלית", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: גרשון חד ועובר על החומר בזריזות, אם כי כן חשוב לו שיבינו והוא עונה על שאלות.\n\nשם המתרגל/ת: אפרת לבקוביץ'\nחוות דעת - תרגולים: מתרגלת מדהימה ואכפתית! הייתה לי פינת אור פעם בשבוע :) חשוב לה שיצליחו ושיבינו.\n\nשעורי הבית: קשים, עמוסים! גוזלים את רוב זמן הסמסטר. תקף 30% אז עדיף לקחת בסמסטר לא עמוס מדי.\n\nהמבחן: תואם לרמה הנדרשת בקורס.\n\nהשורה התחתונה: קורס קצת מציק עם ש.ב וגזלן זמן, אבל זה מה שצריך כדי להשתפשף בתיכנות. תמצאו שותף טוב.", "timestamp": 1614207132826}, {"author": "מבין עניין", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: \nמרצה סביר מינוס, מדבר מאוד לאט, לא עושה הפסקות, ומשום מה הוא העדיף לא להשתמש במצגות מסמסטר שעבר, אלא במצגות מ2011 שהן בכלל לא מסודרות. לא ממליץ.\n\nשם המתרגל/ת: דור\nחוות דעת - תרגולים: \nהמתרגל היחיד שבאמת מבין את החומר שהוא מעביר לעומת השאר. בכל מקרה, ממליץ לצפות בתרגולים המוקלטים בפנופטו של תומר גולני, ורק בפייתון לבוא לדור.\n\nשעורי הבית: \nיש 3 תרגילים סה\"כ, השותף שלי לא תפקד ולכן עשיתי את הרוב המוחלט לבד. תרגיל 1 הוא בC, לוקח כ20 שעות, הסוד להצלחה הוא לחלק את הקוד למבנים שונים.\nתרגיל 2 הוא בפייתון, לוקח בערך שעתיים שרובם הולכים על קריאה מחדש של המצגות.\nתרגיל 3 מפורסם יחסית מוקדם ולכן יש חלקים שניתן להתחיל לעבוד עליהם רק בשבוע האחרון לסמסטר. קצת פחות עמוס מתרגיל 1, אבל עדיין לוקח כ25 שעות. \n\nהמבחן: \nמבחן עם חומר פתוח, תדפיסו הכל! יש בכל סמסטר שאלה שנכנסת לפרטים הקטנים (שגיאות בזמן קומפילציה \\ ריצה \\ פרה-קומפילציה, בדיקת נכונות של קוד תבנית \\ פולימורפיזם) אז כדאי שתכינו עוד מתחילת הסמסטר רשימה של כל מיני דקויות שמראים בהרצאות, זה יכול להציל אתכם במבחן.\nהסמסטר היה סגל הזוי, קיצרו את המבחן לשעתיים אבל השאירו 4 שאלות שבכל אחת היו כמה סעיפים ואז במהלך המבחן הם נתנו הארכה של רבע שעה אבל לא כולם קיבלו את ההודעה, בקיצור, clown fiesta.\n\nהשורה התחתונה: \nקורס מאוד מעניין, לומדים C, C++,python וקצת משתמשים בssh. חבל שנפלתי בסמסטר עם סגל ביזיוני, אבל לפחות יש אחלה הקלטות לקורס. סה\"כ קורס מומלץ.", "timestamp": 1614539722474}, {"author": "Elad Kay", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אהרון קופרשטוק\nחוות דעת - הרצאות: הרצה מאוד לא טוב בזום. מאוד לא ברור, אפילו לא היה על מחשב (היה צריך לבקש שמישהו יפתח לו את המצגות ויעשה שיתוף מסך), בהמשך בכלל לא היה עם מצלמה. לא מומלץ בכלל.\n\nשם המתרגל/ת: נלסון גולדשטיין\nחוות דעת - תרגולים: מתרגל נהדר. הביע בקיאות בחומר ונכונות לעזור.\n\nשעורי הבית: ארוכים כמו המוות ופדנטיים ברמות על\n\nהמבחן: סביר\n\nהשורה התחתונה: לא הייתי עושה את זה לעצמי מבחירה", "timestamp": 1614858387898}, {"author": "Moriya Ben Naim", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות:  נורא קשה לא להירדם, מאוד משעמם בהרצאות שלו. מצד שני יש שאלת מרצה ולכן חשוב לנכוח בהרצאות שלו כי הוא אוהב לשאול על דברים שהוא אומר. המלצה שלי - לצפות בהקלטות שלו, ככה אפשר לצפות במהירות יותר גבוהה ולעשות הפסקות כשממש מתחילים להירדם ממנו. \n\nשם המתרגל/ת: המתרגל בפנופטו\nחוות דעת - תרגולים:  המתרגלים שהיו בסמסטר חורף תשפ\"א לא היו כל כך טובים - הקריאו מהמצגת , לא התכוננו מראש לשיעור. עדיף פשוט לצפות במתרגל בפנופטו, הוא מסביר מעולה ורק בחלקים שהוא לא מלמד כגון פייטון להצטרף לתרגול בזום.\n\nשעורי הבית: מאוד מאוד מאוד מאוד עמוסים. תמיד תתחילו מלקורא אותם מההתחלה ועד הסוף, ולא משנה כמה הם ארוכים. הסגל מאוד אוהב להחביא הפתעות לא נעימות בהמשכם ואז דברים שתכננתם ואפילו כבר כתבתם צריכים לעבור שינוי! ומאוד חשוב לא לחכות לרגע האחרון - הם גוזלים מלא זמן, וחשוב גם לתת זמן לתכנון נכון שלהם.\n\n\nהמבחן: קשה בטירוף, מאוד מקווה שלא ימשיכו במתכונת של לקצר אותו, כי הם רק מקצרים את הזמן ולא מורידים שאלות או את הקושי של השאלות. \n\nהשורה התחתונה: קורס ממש מעניין, אך בעיקרון תתכוננו להרבה חיפוש בגוגל, הרבה תסכול, ותתנחמו בעובדה שתצאו בסופו מתכנתים יותר טובים, לא בזכות הסגל אלא בזכות ההתמדה שלכם.", "timestamp": 1615199864647}, {"author": "Bob Bobinson", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "(סמסטר זום)\nשם המרצה: אהרון קופרשטוק\nחוות דעת - הרצאות: מרצה מאוד איטי, שמדבר מקוטע, דבר שממש מוציא מהריכוז. מעבר לכך, ברוב הקורס אין שום חשיבות להרצאות - כל מה שצריך לשיעורי בית מועבר בתרגולים. הבעיה היחידה היא שיש שאלות תיאורטיות במבחן שמועברות בעיקר שם.\n\nשם המתרגל/ת: אפרת\nחוות דעת - תרגולים: מתרגלת טובה, שמעבירה את החומר טוב ומסבירה הכל. התרגולים חשובים ביותר וממש לא מומלץ לפספס אותם או חלקים, כי כמעט הכל חשוב לשיעורי הבית (אפילו כאשר רשום שלא - התרגולים די מבולגנים מהבחינה הזו).\n\nשעורי הבית: שיעורי הבית נוראיים. ארוכים ביותר, חוזרים על עצמם (בעיקר C) וסיוט לדבג. שיעורי הבית של פייתון אבל קלילים.\n\nהמבחן: המבחן הסמסטר היה קצר בשעה בלי ממש סיבה, ועם יותר שאלות תיאורטיות. בדרך כלל אבל בעיקר חשוב פשוט לפתור המון מבחנים משנים שעברו, ולשנן את כל הטעויות הנפוצות מכיוון שהמבחנים ממש חוזרים על עצמם.\n\nהשורה התחתונה: קורס משעמם, עם חומר מיושן (אין שום סיבה להשתמש ב-ADT של C כשיש C++, אין סיבה ללמוד C++ 11 כשיש 20 וכו'), ארוך מאוד וחוזר על עצמו. לסבול ולשכוח.", "timestamp": 1615463773762}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גרשון\nחוות דעת - הרצאות:  לא הכי ברור שיש, אבל כשהוא מרצה זה ממש חשוב להגיע כי יש שאלת מרצה במבחן \n\nשם המתרגל/ת: נלסון\nחוות דעת - תרגולים: מתרגל מדהים, סבלן, קשוב לשאלות, בקיצור, מאוד מומלץ\n\nשעורי הבית: הדבר שהלוואי שידעתי קודם: החומר בתרגולים סופר חשוב כדי להצליח בתרגילי הבית! משתלם מאוד לחזור כמה פעמים על הוידאו ולוודא שהבנתם לפני שבכלל תתחילו לקרוא את תרגיל הבית\n\nהמבחן: לתרגל מלא מבחנים לפני ומסתדרים\n\nהשורה התחתונה: עמוס מאוד, חשוב למצוא שותף טוב", "timestamp": 1616406861087}, {"author": "Adan Wattad", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאב\nחוות דעת - הרצאות: חשובות למבחן\n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים: ממליצה מאוד \nברור ומסודר\n\nשעורי הבית: לוקחות הרבה זמן\nממליצה לפתור ולהתייעץ עם חברים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1625838010176}, {"author": "~", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: הייתי אצל ליאב בהתחלה, אבל עם העומס של הסמסטר הפסקתי ללכת - בדיעבד ההרצאות די מיותרות ואפשר להשלים דברים ביוטיוב אם צריך, ולקרוא פשוט את המצגות של ההרצאות. בסה\"כ מכסים הכל בתרגולים.\n\nשם המתרגל/ת: איתי אלפסי\nחוות דעת - תרגולים: \nאיתי היה הנקודת אור היחידה בכל הקורס הנוראי הזה. הסביר ברור, ענה על כל השאלות וראו שבאמת אכפת לו מהסטודנטים. התרגולים היו לדעתי התכלס של הקורס, ושם באמת היה אפשר להבין את החומר כי זה היה יותר אינטראקטיבי.\n\nשעורי הבית: תתכוננו שלא יהיו לכם חיים.\nתרגיל בית 1 - עמוס בטירוף, לוקח מלא זמן והסגל כל שניה מחליט לשנות את ההוראות של התרגיל. בשבוע שבועיים שלפני עבדנו על זה כל הזמן וזה די גרם לזנוח את שאר הקורסים הצידה כי בקושי היה זמן.\nתרגיל בית 2 קצת פחות עמוס - אבל לא בכזה מעט. עדיין לוקח הרבה מאוד זמן.\nתרגיל בית 3 של פייתון אפשר לגמור תוך שעתיים\n\n\nהשורה התחתונה: \nהקורס הזה היה עמוס בצורה מוגזמת, לא היה לי זמן לכלום במהלך הסמסטר ולאינפי וכל שאר הקורסים בקושי היה זמן.\nהולכים להיות הרבה לילות של דיבוג עד 12 בלילה ומעט מאוד חיים עם הקורס הזה.", "timestamp": 1626028770552}, {"author": "Idan Baruch", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים: \n\nשעורי הבית: קשוח מאוד, גוזל המון זמן\n\nהמבחן: \n\nהשורה התחתונה: קורס שגוזל המון המון זמן", "timestamp": 1626163825013}, {"author": "valgrind", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: לא הלכתי\nחוות דעת - הרצאות: אל תלכו להרצאות, זה רק בזבוז של זמן והם לא עוזרות לאף אחד\n\nשם המתרגל/ת: מחמוד מסארוה\nחוות דעת - תרגולים: הוא עוזר בשעות קבלה, זו לפחות נקודת אור קטנה בקורס המבאס הזה, שמתנהל בצורה מבאסת.\n\nשעורי הבית: אם יש מילה לתאר את תרגיל בית הראשון, אז המילה הזו היא \"סיוט\", הנחיות התרגיל לא ברורות, מתרגילים טועים, בדקה ה-120 משנים פונקציה של מבני נתונים הגנרי, אשר החלק השני של התרגיל מתבסס עליו ועקב כך נאלצתי לשנות את הטסטים שעשיתי ואת הקוד מהחלק השני, כל 5 שניות ממציאים הנחיה חדשה, יומיים לפני ההגשה אמרו שאסור להשתמש ב-list, התרגיל עבר 4 עדכונים. פשוט ביזיון, וזה כמובן בא על חשבון הזמן(המעט) שלי בסמסטר שנאלצי לדחות וראות רק מוקלט. בסוף קיבלתי 100 בתרגיל אף זה אחרי סיוט גדול.\nהתרגיל השני c++ היה פחות עמוס מהתרגיל השני וההנחיות היו הרבה יותר ברורות ביחס לתרגיל הראשון.\nהתרגיל השלישי python היה משחק ילדים, מסיימים אותו בשעתיים.\n\nהמבחן: לא היה שאלת מרצה למרבה המזל, צריך לפתור מלא מבחנים לפני המבחן.\n\nהשורה התחתונה: \nהקורס הזה מבאס במיוחד, חומר הקורס יפה אבל האופן שבו הקורס מתנהל מאוד גרוע, אומרים שבמדריך התקנת ה-vscode יש את הכל זו אמירת שקר, במדריך לא מוסבר שאי-אפשר להפעיל cmake מ-terminal, והרבה סטודנטים שאלו על זה בקבוצה, נאלצתי ללכת לשעות קבלה כדי להבין איך זה עובד, התרגילים עמוסים מאוד מאוד. והסגל כנראה לא אכפת לו אז הוא לא מפרסם מבחני עבר עדכניים, ועוד יותר גרוע מזה, הוא מפרסם מבחנים בלי פתרון.", "timestamp": 1626357844990}, {"author": "B.E", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ליאב עדי\nחוות דעת - הרצאות: הוא מרצה מאוד טוב. לפחות מעניין, משלב את החומר עם התעשיה, מבחינת חומר הוא מגיע מוכן יותר טוב מהמרצה האחראי.\n\nשם המתרגל/ת: יניב \nחוות דעת - תרגולים: המתרגל הכי טוב לדעתי, אך הוא מדבר כמו מטוס וזה יוצר בעיה לסטודנטים שאינם יהודים או שעברית אינה שפת האם שלהם (קשה לקלוט מייד!)\n\nשעורי הבית: סוד ההצלחה הוא שתמצאו שותף טוב. תתחילו הכי מוקדם שאפשר כי הן יבזבו לכם את הסמסטר. צוות הקורס לא אכפת לו מכם אז כדי שתגיעו מוכנים, תנסו ללמוד לבד לפני תחילת הסמסטר.\n\nהמבחן: \n\nהשורה התחתונה: חומר מעניין ויפה אבל גועל נפש של קורס.", "timestamp": 1627237753936}, {"author": "נקודה פסיק", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ליאב עדי (או עדי ליאב? אין לדעת)\nחוות דעת - הרצאות: בסמסטר אביב הקורס פחות תיאורטי ונראה שההרצאות פחות קריטיות להצלחה בקורס. בכל זאת הלכתי, בעיקר כי נהנתי מהן. ליאב ממש משתדל לדבר על איך לכתוב קוד נכון ומה קורה בתעשייה ומתגאה בזה שהוא מהראשונים בארץ שכתבו בcpp (אין לי מושג אם זה נכון)\n\nשם המתרגל/ת: יניב גופט/איתי אלפסי\nחוות דעת - תרגולים: שניהם מעולים - תלוי בכם. יניב יותר מתאים למי שבא עם קצת רקע/רוצה לשמוע רק את התכלס. איתי יותר מתאים למי שרוצה לשאול הרבה שאלות ולהעמיק, אבל הקצב של התרגול בהתאם. הם די הפכים אחד של השני, אז אולי אפשר לנסות מתרגלים נוספים.\n\nשעורי הבית: איכס טפו גועל נפש זוועת עולם אהאהאהאהאה. התרגיל בית ב-C היה הכי ארוך ובלתי נסבל אצלנו. כנראה כי הסגל לא ניהל זמנים טובים הCPP דווקא היה קצר וקליל. אבל - הסגל מכסח בבדיקה היבשה אז שימו לב שאתם מקפידים על כל מה שנאמר בכיתה. כמו כן - המפתח להצלחה בקורס הוא שותף חזק. שותף לא טוב יכול להרוס לכם את כל הסמסטר (כולל בקורסים אחרים, כי הקורס הזה תובעני ובא על חשבון פתירת גליונות באינפי ודומיהם)\n\nהמבחן: טכני בטירוף, פשוט תתרגלו מלא מבחנים על זמן ויהיה טוב.\n\nהשורה התחתונה: תמצאו שותף חזק!!!!!!!!! באמת. אה, וסגל הקורס מתנהל בצורה ביזיונית לגבי תרגילי בית - הנחיות מאוד לא ברורות. הייתי אומר שהקורס לא מומלץ אבל זה חובה אז שיהיה בהצלחה (עדיין נהנתי ממנו ממש, אבל גם סבלתי. מאוד)", "timestamp": 1628187499162}, {"author": ".", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: מוקלטות רן רובינשטיין/ ליאב עדי\nחוות דעת - הרצאות: הרצאות מעניינות, שניהם מסבירים טוב ולדעתי עדיף על הפרונטליות. אפשר בקלות לראות על 1.5.\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: מתרגל מעולה, מסביר טוב ובצורה מעניינת.\n\nשעורי הבית: עמוסים מאוד אבל הרמת קושי לא נורא גבוהה.\n\nהמבחן: היה יחסית קל לשנים קודמות.\n\nהשורה התחתונה: קורס מעניין וחשוב. למצוא שותף טוב לתרגילי בית.", "timestamp": 1628498969198}, {"author": "Anonymous", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ליאב\nחוות דעת - הרצאות: \nמרצה מומלץ מאוד. מעביר את החומר בצורה מאוד ברורה ומעניינת.\n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים: \nמתרגל מעולהה! אין מילים!\n\nשעורי הבית: \nארוכים מאודדדד!\nחייבים לחפש שותף רציני.\n\nהמבחן: \nסגל הקורס לא מחפש להכשיל אותנו, רק צריך להראות להם שאנחנו שולטים בחומר ויודעים מה אנחנו עושים.", "timestamp": 1630435425330}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איזה מישו ביוטיוב, חבל על הזמן ללכת להרצאות\nחוות דעת - הרצאות:  ההוא ביוטיוב אחלה תחפשו קישור זה מישו מהטכניון\n\nשם המתרגל/ת: איתי אלפסי\nחוות דעת - תרגולים: הבנאדם המקסים ביותר שקיים, תמיד בא עם מלא אנרגיות, ומוכן לעזור ולהשקיע בסטודנטים שלו\n\nשעורי הבית: קשים ועמוסים ומתסכלים\n\nהמבחן: קשה ומתסכל, כול מה שאתה עושה בבחינה זה להתפלל שלא תצטרך לחזור על הקורס והשיעורי בית *שוב*.\n\n\nהשורה התחתונה:", "timestamp": 1633982073078}, {"author": "היורש", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: הרצאות יוטיוב\nחוות דעת - הרצאות: קצת מיותרות, חוזר על החומר של התרגול ולא מחדש יותר מדי\n\nשם המתרגל/ת: איתי אלפסי\nחוות דעת - תרגולים: תותח על, מלמד עם חשק ואווירה טובה. מקצועי מאוד! \n\nשעורי הבית: ניהול ביזיוני של הסגל, הש.ב קלים אבל הסגל דאג בחוסר מקצועיות מוחלטת לתת תרגילים לא ברורים שמנוסחים גרוע ולא לענות לסטודנטים לשאלות בזמן סביר. \n\nהמבחן: בדומה לת\"ב, מישהו שם צריך לבדוק את עצמו. המבחן לא עובר בדיקה נוספת גם מבחינת הקוד שנותנים לנו וגם מבחינת ניסוח בעברית. \n\nהשורה התחתונה: רוב הלימוד בקורס הוא הרטובים. החומר עצמו לא מורכב. כדי להצליח את המבחן צריך ללמוד סינית וחבל שכך.", "timestamp": 1634190238561}, {"author": "שימי", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יוטיוב\nחוות דעת - הרצאות: אחלה הרצאות, מאוד עניינות, אין שאלות. החומר ברור מאוד.\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: מתרגל בסדר גמור.\n\nשעורי הבית: מנוסחים מאוד גרוע, מלא שאלות שלא נענות. גוזל מלא זמן לא בגלל התרגיל עצמו אלא בגלל חוסר הבהירות.\n\nהמבחן: לא קשה בכלל, אבל צריך להשתפשף. כמו כן הניסוח בדומה לש.ב לוקה מאוד \n\nהשורה התחתונה: קורס נחמד שמלמד המון, חבל שהש.ב והמבחן מנוסחים בצורה עקומה", "timestamp": 1634739999694}, {"author": "Shahar Cohen", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רן רובינשטיין- הקלטות\nחוות דעת - הרצאות: ברור ורהוט, ההרצאות יחסית לא רלוונטיות לפרקטיקה. לדעתי אפשר להעביר את רוב הסמסטר בצפייה בתרגולים\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: מצוין בעיניי\n\nשעורי הבית: עמוס עמוס עמוס עמוס", "timestamp": 1634816522253}, {"author": "tina", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רן-מוקלט\nחוות דעת - הרצאות: אין צורך באמת להגיע להרצאות,מבחינתי היה מספיק לקרוא המצגות מלבזבז שעתיים,אם יש משהו לא ברור יש מוקלט של רן שהוא ממש אחלה,ישר לעניין ולא נרדמים דקה ארי שהוא מתחיל לדבר:)\n\nשם המתרגל/ת: תומר גולני-מוקלט\nחוות דעת - תרגולים: תומר אחלה מתרגל,למרות שהתרגולים קצת ישנים ולא מלמד פייתון אבל ממליצה בחום לראות התרגולים שלו ב C וC++ ואפשר לקרוא המצגות של פייתון\n\nשעורי הבית: תרגיל בית 1-C שטן,הכי קשה מבין השלושה וגוזל הרבה זמן -לעקוב אחרי דליפות הזיכרון,בעיות במצביעים וכוכוכו- תרגיל בית 2 C++ בהשוואה לC מרגיש כמו מתנה-לא הכי קל אבל בהשוואה לסיוט של C היה סבבה לגמרי-שפה מאוד נוחה לעבודה\nתרגיל  בית 3 פייתון אפשר לסיים בכמה שעות,קל מאוד\n\nהמבחן: למי שפתר תרגילי הבית וממש עבד עם השפות לא יהיה באמת בעייה,טכניקת המבחן חוזרת על עצמה מאוד ואחרי פתירת כמה מבחנים אפשר לראות את סגנון השאלות,באמת לא קשה למי שעבד עם שפות התכנות האלו כל הסמסטר והשקיע בהן,ומה שנותר הוא לפתור המון המון מבחנים ותצליחו!\n\nהשורה התחתונה: קורס עמוס לא בגלל החומר אלא בגלל שיעורי הבית,אם עדיין טריים בתכנות אל תעמיסו קורסים אחרים יחד אתו,חשוב לתרגל את השפות אשר נלמדו,לא מספיק להבין מה שנאמר אלא צריך לכתוב קוד להבין את השפה לעומק,למרות כל השמועות על הקורס הזה,אל תפחדו,המבחן לא קשה,תשקיעו בשיעורי הבית,ובסוף תוכלו לצאת עם 80+", "timestamp": 1635484649346}, {"author": "..", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ליאב עדי\nחוות דעת - הרצאות: ניתן הרבה מידע מהעולם האמיתי והרצאות מאוד מעניינות. בשלב מסוים כבר ויתרתי עליהן בשל העומס אך לא הרגשתי בהבדל. למי שאין כל כך רקע אולי עדיף שלא לוותר.\n\nשם המתרגל/ת: איתי אלפסי\nחוות דעת - תרגולים: לצערי לא יכלתי להגיע אליו בלייב אז צפיתי במוקלט והבן אדם פשוט תותח!! מעביר לך את ההתלהבות שלו מכל נושא ויודע להסביר באופן מצויין. רואים את ההשקעה שלו ושחשוב שנבין ואפילו כשהייתה לו תקלה באחד התרגולים וזה לא הקליט אז הוא הלך במיוחד והקליט הקלטה חדשה.\nבאופן כללי התרגולים די מכסים את כל החומר הנדרש לתרגילי הבית.\n\nשעורי הבית: הפחידו אותי על הקורס ועל שיעורי הבית העמוסים ולצערי צדקו. השיעורים היו עמוסים ביותר והיה מאוד קשה לשלב עם כל הסמסטר העמוס אבל אם מדבגים טוב מספיק ועושים הרבה טסטים אז אין סיבה שלא להגיע לציונים מאוד מאוד גבוהים בהם- וכדאי מאוד כי הם חלק נכבד מהציון.\nחשוב מאוד גם למצוא שותף טוב שיש לכם כימיה איתו כי תשבו איתו הרבה זמן. וכמובן- לתכנן את הפתרון לפני שכותבים אפילו שורת קוד אחת!! זה יחסוך לכם המון זמן.\n\nהמבחן: מעט קשה אך עם מעבר על החומר התיאורטי וידיעתו וכן פתרון המון מבחנים מסתדרים. ככל שתפתרו יותר תרגילים תראו שיש המון מוטיבים חוזרים ותרשמו לכם אותם בצד. \nכדאי בתחילת ההתכוננות לסדר לכם את החומר הפתוח ולתרגל מבחנים איתו כבר. ממליצה מאוד גם להדפיס מבחנים שעברתם עליהם ולבוא איתם למבחן כי בסוף זה די חוזר על עצמו. תעשו לכם טבלה של איפה כל דבר נמצא (למשל פתרון באמצעות מאפ של מאפים שיש במבחן X ) וככה במבחן יהיה לכם קל למצוא. חשוב מאוד לעבוד עם השעון במבחן כי אין הרבה זמן ולכן מומלץ לתרגל מבחנים על זמן יחד עם החומר הפתוח שהדפסתם שתוכלו להתרגל אליו.\n\nהשורה התחתונה: קורס עמוס אבל עם תכנון נכון, שותף טוב ומעבר על המון מבחנים אין סיבה שלא להוציא ציון מאוד טוב!", "timestamp": 1637837962722}, {"author": "אמנון טיטינסקי", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יבגני ליפובצקי/גל ללוש לסירוגין\nחוות דעת - הרצאות: ההרצאות היו מעניינות וכן הביאו רקע נחמד. שניהם מעבירים את החומר בצורה ברורה יחסית עם יתרון קטן לגל. גל רץ על החומר ומנגד יבגני לפעמים נסחף למעין הופעת יחיד, מה שמעכב את ההתקדמות והוביל להרצאות השלמה ולכך שלמדנו חומר שהכרחי לתרגיל בית 2 רק בשבוע האחרון של תרגיל הבית. \n\nשם המתרגל/ת:  יניב גופט\nחוות דעת - תרגולים: מתרגל אחראי וחזק שתכלס מחזיק את הקורס מלקרוס לחלוטין. מגדיר את עצמו כבעל בעיות קשב וריכוז קשות אז כל שאלה שיש לסטודנטים בתרגול שלו הוא מתעקש שישאלו אותו מה שלא מעט פעמים גרם לשיעור להימרח אבל מצד שני הוא מדבר בטבעי על מהירות 1.25 כך שזה מתאזן. סך הכל מעביר את החומר מצוין ומביא דגשים חשובים מאוד להצלחה בקורס(שבעצם די שלו).\n\nשעורי הבית: כל מה שקראתם עד התגובה הזאת נכון וצריך להיות מוכפל פי 1.5 מבחינת העומס. עד שבוע 3-4 אתם לא מרגישים שיש לכם קורס נוסף במערכת אבל מתרגיל בית 1 הוא הופך להיות משאבת הזמן הכי גדולה שפגשתם. יש המון טענות למתרגלים אבל לא משנה כמה הם ינסו להשתפר עדיין אי אפשר לשחרר תרגילי בית בסדר גודל כזה כשהכל מושלם. תמיד יש מקומות של חוסר וודאות בכל תרגיל, בצורה שיכולה להשפיע על כל המימוש שלכם. בנוסף, כנראה שתקבלו פידבק אמיתי על התרגיל בית הראשון רק אחרי המועד א'. הטיפים נאמרו לפניי אבל רק אגיד שבעת בחירת שותף חשוב לשים לב לשעות העבודה המועדפות על שניכם ועל כמות הזמן ששניכם רואים לנכון להקדיש לעבודה ביחד אל מול עבודה לבד.\n\nהמבחן: נכון לכתיבת שורות אלו לא היה עדיין מבחן, אבל כן אציין שהמרצים מנסים משהו חדש וזה לצמצם את הנפח ש-ADT ב-C תופס במבחן ולכן המבנה שלו יהיה מעט שונה. לפי יניב מהסמסטר הבא הולכים בכלל להוריד את הקונספט של ADT בשפת C וזה מבורך. בגלל השינוי בקונספט המרצים היו מאוד גלויים איתנו בנוגע למבנה המבחן ולדברים שצריך לשים עליהם דגש וזה ייאמר לזכותם.\n\nהשורה התחתונה: \nהחומר של הקורס יפה ומעניין בטירוף. אל תתייאשו או תוותרו בתרגילי הבית כי הם 30% תקף. תזכרו שעברו את זה לפניכם ויעברו את זה אחריכם :)", "timestamp": 1645049143759}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה: גל ללוש \nחוות דעת - הרצאות: כל הזמן יורד על זה שהקורס דפוק ומלמד c וcpp במקום שפות יותר ידידותיות לירושה. חוץ מזה הוא אחלה\n\nשם המתרגל/ת: יניב גופט \nחוות דעת - תרגולים: אחלה גבר ראיתי את המוקלטות והוא מסביר שם טוב\n\nשעורי הבית: ארוכים בטירוף, התרגיל של c לקח לי בערך שבוע וחצי של עבודה רצופה.\ncpp לקח קצת פחות ופייתון היה ממתק\nהמבחן: עוד לא עשיתי \n\nהשורה התחתונה: תפנו הרבה זמן לשיעורי בית, קורס ממש לא מסובך", "timestamp": 1645184614542}, {"author": "עדן לוי", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איבגני ליפובטסקי\nחוות דעת - הרצאות: מאוד מעניינות ומקיפות. מרצה טוב סך הכל\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים:  בין המתרגלים הטובים בטכניון, מומלץ מאוד\n\nשעורי הבית: מאוד עמוסים ויכולים לקחת הרבה זמן, שווה להקדיש יותר זמן על תכנון נכון מראש כדי להימנע מבזבוז זמן על מציאת בעיות אחר כך\n\nהמבחן: הוגן\n\nהשורה התחתונה: קורס מעניין אבל עמוס במטלות, מהבחינה הזאת הנק\"ז לא משקף בכלל את עומס הקורס", "timestamp": 1646147812678}, {"author": "OOP", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "הערה: החומר של הקורס עומד להשתנות בסמסטרים הקרובים, אז יכול להיות שחוות הדעת הזאת לא תהיה רלוונטית באותה מידה בעתיד.\n\nשם המרצה: גל ללוש\nחוות דעת - הרצאות: אחלה מרצה, מסביר את החומר בצורה ברורה, ונותן דגש קצת יותר מודרני על החומר של הקורס. \n\nשם המתרגל/ת: יניב גופט (מתרגל אחראי)\nחוות דעת - תרגולים: מעביר את החומר מעולה. יניב גורם לזה שכל דבר יהיה מסודר וברור, בין אם זה החומר המועבר בתרגול או ההתנהלות של שאר המתרגלים.\n\nשעורי הבית: כן, שמעתם נכון, הקורס הוא קורס עמוס, כנראה יותר מכל אחד מהקורסים שלקחתם עד עכשיו, ונוסף על זה שהתרגילים עמוסים, בדרך כלל התרגילים לא כתובים מושלם על התתחלה, אז תוך כדי העבודה, צריך להתעדכן בשינויים שיש בהם.\nהתרגיל הראשון שלנו היה ב-C ADT, חומר שכנראה ירד בסמסטרים הבאים, אבל לקח משהו כמו שבועיים, כשבכל יום עובדים 3 שעות ומעלה (לא מהנה במיוחד, אבל גורם לכם להבין את החומר).\nהתרגיל השני היה ב-C++, והוא פשוט היה כתוב מזעזע, ככה שהיו שינויים עד כמה ימים בודדים לפני ההגשה. הרגיש שכל מה שניסו לעשות שם זה לדחוס כמה שיותר חומר, בלי הקשר אמיתי בין חלקי התרגיל, אבל בסופו של דבר, הוא עוזר להבין את הלך המחשבה של C++ ותכנות מונחה עצמים.\nהתרגיל האחרון היה ב-Python. יחסית קליל, לא יותר מדי עבודה ולא מסובך מדי.\n\nהמבחן: סה\"כ מבחן הוגן.\nהמבחן עבר שינוי במבנה שלו הסמסטר. במקום שאלה על C ADT, הכניסו שאלה שבודקת יותר הבנה של C/C++. בעקבות השינוי ייבגני (המרצה האחראי) יצא גבר וממש הסביר במפורט מה הולך להיות בשאלה הזאת (שנדע עם מה להתמודד אבל לא הסגיר את כל מה שיהיה שם). השאלה הזו הייתה קצת מאתגרת, אבל שאר המבחן היה בעיקר טכני.\n\nהשורה התחתונה: קורס עמוס בצורה זוועתית ביותר (מקווה שישתפר בהמשך) אבל החומר מעניין, ומרגיש הרבה יותר שימושי מאשר מה שלמדתם במבוא.", "timestamp": 1646254909658}, {"author": "💩", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "בתור אחד שהצליח מאוד בקורס, זהו ללא ספק הקורס הכי גרוע בטכניון.", "timestamp": 1646309847168}, {"author": "Benjamin Mayan", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גל ללוש\nחוות דעת - הרצאות: \nגל הוא אחלה מרצה, ההרצאות היו די מעניינות (למרות שהן היו דומות לתרגולים) ומאפשרות לעבור על החומר שוב ויותר לעומק מהתרגולים, גל שם דגש על הנושאים שרלוונטים בעיניו לתכנות באופן כללי  וזה נתן נקודת מבט יותר רחבה על הקורס. \nאני חושב שיש טעם ללכת להרצאות, כי בסוף במבחן יש שאלת מרצה (שהסמסטר הייתה שליש מהניקוד של המבחן) שכדי לדעת אותה כדאי להגיע להרצאות ולהכיר את הדברים שהמרצה שם עליהם דגש. \n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: \nהתרגולים היו די מענייינים, הרבה חומר שמועבר במעט זמן ככה שהקצב מהיר ויש הרבה סינטקס חדש ופרטים טכניים. \nחשוב ליניב שהסטודנטים יבינו את החומר ויצליחו (תמיד עונה על כל השאלות) והוא דאג בתור המתרגל האחראי שהמבחן יהיה בפורמט יותר מוצלח משנים שעברו. \n\nשעורי הבית: \nשלושה תרגילי בית.  2 עמוסים מאוד בC וב C++ עם חלק יבש ורטוב ותרגיל בית סביר בפייתון. \nהתרגיל בית בC היה עמוס ומייגע מאוד אבל ההוראות של התרגיל היו די ברורות, לעומת זאת התרגיל בC++ היה די בזיון...  הוא היה ארוך ועמוס וההוראות היו לא ברורות בעליל וצוות הקורס שינה את דרישות התרגיל כמה וכמה פעמים. \nהתרגיל בפייתון די קליל (כמה שעות עבודה).\nבסך הכל התרגילים מאוד מלמדים ונותנים נסיון חשוב שאי אפשר להשיג בדרך אחרת ואם יש לך שותף מוצלח שמתחלק איתך בעבודה אז הם לגמקי אפשריים. \n\nהמבחן: \nהמבחן הסמסטר היה בפורמט שונה משנים שעברו ( ללא ספק מוצלח יותר), לא הייתה שאלת ADT בשפת C ובמקומה הייתה שאלת מרצה גדולה (ודי פשוטה למי שבקיא בסינטקס של C וC++), השאלת פייתון הייתה ארוכה מדי וגם השאלת C++.\nמקווה שימשיכו עם אותה מתכונת של מבחן בסמסטרים הבאים. \n\nהשורה התחתונה: \nקורס מעניין וחשוב, אבל הנושא של ADT בשפת C מיותר ומייגע בעיניי (גם בעיני המרצים והמתרגלים...).", "timestamp": 1646913346067}, {"author": "catto", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יבגני\nחוות דעת - הרצאות: מסביר היטב, אבל לפעמים ההרצאות מרגישות קצת מפוזרות\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: סביר, אין ממש סיבה ללכת לתרגולים, אפשר לקרוא את המצגות\n\nשעורי הבית: אולי חוץ מ-HW1, זה לא ששיעורי הבית קשים כמו שהסגל (למרות שמאוד נחמד) פשוט התנהל בצורה ביזיונית. כל תרגיל צריך לצאת עם 15 תיקונים, חצי מהם בכלל מפוזרים בשאלות נידחות בפיאזה (וזה כשהם עושים טובה ועונים לשאלה אחת מתוך 70) ולא נשלחים במייל. ותרגיל HW2 היה השיא - 15 עמודים של ג'יבריש לא ברור שגרם לכך שהיינו צריכים לשנות חלקים נרחבים בקוד 3 פעמים.\n\nהמבחן: קצת ארוך אבל הוגן, אחרי שמסיימים לערוך בתוכו את כל התיקונים שהמתרגל כתב על הלוח; כי באותו רוח של השיעורים - הוא מלא בשגיאות וטייפוס.\n\nהשורה התחתונה: עמוס, אבל ילמד אתכם איך להתמודד עם בלת\"מים", "timestamp": 1647620455517}, {"author": "karm", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יבגני\nחוות דעת - הרצאות: מרצה אחלה, מצחיק ומובן\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: נורא וזה לא נראה שהוא רוצה בהצלחת הסטודנטים\n\nשעורי הבית: עמוסים וכל פעם יש שינוי, נראה שהם בעצמם לא יודעים מה רוצים\n\nהמבחן: ארוך ואין מצב לסיים לפני הזמן, אין מקום יותר מדי לחשוב, היה צריך לירות את התשובות\n\nהשורה התחתונה:", "timestamp": 1648457113949}, {"author": "גולן", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גל ללוש \nחוות דעת - הרצאות: יש טענה שרווחת שלא צריך לבוא להרצאות והתירגולים מספיקים, זה אכן נכון ואפשר להוציא ציון מדהים בשביל לשבת בהרצאה ובלי לעבור על המצגות בכלל . \nאבל אני הלכתי לאורך כל הסמסטר להרצאות של גל כי ראיתי בהן ערך מוסף , הוא שם דגש על הדברים שבאמת חשובים לעולם האמיתי וכשמופיע משהו לא קשור במצגת הוא אומר \"טוב זה שטויות\" וממשיך. אני אישית מצאתי את זה מרענן והרגיש לי שהדברים עליהם הוא מתעכב באמת רלוונטים וכדאי שאני אקשיב . נראה לי שזה שווה את השעתיים בשבוע. \n\nשם המתרגל/ת: יניב \nחוות דעת - תרגולים: אין לי הרבה מה להגיד\n\nשעורי הבית: המטלות הן העיקר של הקורס. בגלל שעובדים בזוגות ובגלל שיושבים על המטלות שעות רבות זה נורא מפתה לוותר על ההבנה ולזרום עם השותף העיקר לסיים. אני ממליץ להישאר עם היד על הדופק ולוודא שמבינים כל שורת קוד שנכתבת. זה יחסוך המון בילבולים כשתגיעו לרגע שלומדים למבחן .\n\nבנוסף ממליץ לא למהר לפתור את המטלה כי היא עוברת המון שינויים במיוחד בהתחלה . המון שאלות צצות בפיאצה והם מעדכנים בהתאם את הדרישות. בנוסף חשוב מאוד לשמור על קשר עין עם הפיאצה אחרת מפספסים את הדרישות של הסגל \n\nהמבחן: המבחן לא קשה מדי, והאמת שחלקים בו נורא קלים. למשל שאלת הcpp דורשת הבנה קלה של ירושה ותבניות וחוץ מזה נורא טכני. אחרי 3, 4 סימולציות הכל מרגיש כאילו זה חוזר על עצמו , מגדירים מחלקות מטודות וכו על אוטומט. \n\nשאלת הפייטון אולי היא הכי קשה מכיוןן שבקושי נגענו בפייתון ואין מאיפה לתרגל, וצריך שליטה בכל הפעולות שאפשר לעשות על רשימות כי אי אפשר לדעת על מה הם ישאלו. והם גם מכוונים אותך להשתמש בפעולות האלו כשהם דורשים - \"אסור להשתמש בלולאות\". \n\nשאלת ה-C הייתה סבירה. ידענו בדיוק מה יהיה מבנה השאלה ולכן היה קל להתכונן .\n\nהשורה התחתונה: קורס טכני דורש טיפה הבנה אבל לא יותר מדי.. הוא עמוס רק א םהסגל לא מתפעל נכון את המטלות ואתה מבלה את רוב הזמן לטאטא אחריהם .", "timestamp": 1650141818060}, {"author": "סטודנטית", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "עמ\"לק - היה לא נעים להיות סמסטר \"ניסוי\".\n\nשם המרצה: עדי ליאב\nחוות דעת - הרצאות: הסמסטר נכנס לקורס הרבה חומר חדש, ועדי התקשה לפעמים להבחין בין העיקר לטפל. הוא כל הזמן מוסיף הערות ביניים שלא תמיד קשורות לנושא הנוכחי מה שמקשה לעקוב ולהבין מה הולך (ולפעמים גם לא ברור מה מהדברים שהוא אומר תכלס רלוונטים מבחינת חומר הקורס).\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: \nיניב מאוד חד על החומר, מומלץ.\n\nשעורי הבית: \nבניגוד לפורמט של שנים קודמות הפעם היו 6 תרגילי בית (כולל תרגיל בית 0).\nבגדול התרגילים כצפוי היו עם מלא שינויים ודרישות שקשה לעקוב אחריהן. הרבה פעמים לא קבלנו מענה או שקיבלנו תשובות סותרות. קחו בחשבון שלפתור את התרגיל יכול לקחת כמה ימים בודדים אבל תמיד יהיו מלא שינויים של הרגע האחרון בהנחיות שידפקו אותכם ויגזלו מכם המון זמן. \n\nהמבחן: \nשאלה מספר 1 שהייתה קשורה לירושה ודיזיין פטרנס הייתה מבלבלת ומעיקה ממש. היו בה הרבה תיקונים, הוראות דו משמעיות ועוד הרבה בעיות ניסוח ודברים מציקים שפשוט הופכים שאלה שמלכתחילה מעיקה ודורשת מלא כתיבה להרבה יותר מבלבלת וקשה ממה שהיא אמורה להיות. שאלות 2,3 היו סבבה לדעתי.\nרוב האנשים שיצא לי לדבר איתם לא הספיקו לסיים את המבחן, כמעט לכולם נשאר סעיף שלא הספיקו, הוא היה מאוד עמוס ודרש המון כתיבה ובו זמנית דיוק והקפדה על פרטים.\n\nהשורה התחתונה: \nנראה לי שבתכלס הוסיפו לקורס הרבה יותר חומר ממה שהורידו, וחלק מהחומר שנוסף הועבר בצורה לא יסודית ולא ברורה.\nמעבר לזה, נראה שחלק מהמתרגלים בעצמם לא בקיאים בכל הדיזיין פטרנס ולא מבינים מספיק טוב את החומר החדש שנוסף.\nחוץ מ ADT שירד מהחומר, לכאורה נאמר לנו שכלללל שאר הנושאים עדיין בחומר למבחן + כל החומר החדש שהוסיפו בC++ ובתכלס נראה לי שזה בנטו הגדיל את החומר של הקורס וסתם תסבך והקשה כי אין שום מיקוד לגבי הכמות האדירה של החומר זה.\n\nהדירוג הכללי שנתתי הוא מומלץ נטו בגלל שזה הקורס הכי רלוונטי לתואר עד כה, לא משום סיבה אחרת.", "timestamp": 1658945590403}, {"author": "סטודנט רנדומלי", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: גל ללוש המלך\nחוות דעת - הרצאות: מסרב להרחיב\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: מתרגל פצצה, יש לו טעם נהדר בחולצות\n\nשעורי הבית: תואמים לחומר ב99%, ממליץ לעשות כמה שיותר מהם לבד (גם אם מגישים בזוג) כי זה באמת כל החומר\n\nהמבחן: הוגן, בלי שאלות טריוויה\n\nהשורה התחתונה: השינוי שעשו לקורס היה מאוד לטובה, אתם תהנו", "timestamp": 1658951993200}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ליאב עדי\nחוות דעת - הרצאות: הרצאות אחרונות שכבר איבדתי את ליאב לגמרי, עברתי לראות את גל ללוש בהקלטות, בדיעבד חבל שלא ראיתי אצלו את כל הסמסטר. אין ספק שליאב מנוסה בתעשייה וחד וגם יש לו יחס נעים כלפי הסטודנטים, אבל הוא מייגע בהסברים שלו, לעיתים קרובות סוטה מהנושא, קשה קצת לזקק את התכלס (ועשינו שתי הרצאות השלמה). פחות ממליצה.\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: יניב חד בטירוף, מסביר מעולה ובקצב שלא מאפשר לאבד עניין. לא ממשיך לפני שכולם מבינים. בקיצור תותח.\n\nשעורי הבית: ארוכים, דורשים ים השקעה, אבל עם תכנון זמן נכון תספיקו להגיש הכל כמו שצריך ואפשר אפילו להנות מהם. הם מתוכננים ככה שהם סופר-רלוונטיים לחומר מההרצאות והתרגולים so pay attention.\n\nהמבחן: לא מאוד קשה אבל מאודד ארוך. תכננו נכון את הזמן שלכם ככה שיהיה לכם מה להגיש כשהדודה תגיד להניח עטים.\n\nהשורה התחתונה: אחלה קורס, מי שאוהב תכנות יהנה ממנו.", "timestamp": 1659098577314}, {"author": "שורדת מת\"מ", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: עדי ליאב\nחוות דעת - הרצאות: \nמסכימה עם הביקורת הקודמת, אין לי מה להוסיף.\n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים:\nמתרגל טוב, נותן טיפים טובים. \n\nשעורי הבית: \nמייגעים, בעיקר בגלל שהסגל כל הזמן עושה מלא שינויים בפיאזה וההוראות לא ברורות. הם מאוד עוזרים להטמעה של החומר, תוודאו שאתם מבינים אותם כמו שצריך. \n\nהמבחן: \nממוצע מועד א בלי פקטור היה 57 וזה מדבר בעד עצמו...\nמבחן ארוך, בקושי אפשר לסיים אותו. בתכלס רוב האנשים לא הצליחו לסיים את כולו. זה מבחן שאין באמת זמן לעצור ולחשוב בו יותר מידיי. כדאי להתאמן על להקיא את התשובות ולכתוב הכי מהר שאפשר בגדול.\nאה, וכמו שבשיעורי בית השאלות לפעמים מנוסחות בצורה מבלבלת וגרועה - אז זה קורה גם במבחן.\nבאופן יחסי די הצלחתי בקורס, אבל לדעתי כשהמבחן לא פתיר בזמן שמקציבים לו - הוא לא משקף כמו שצריך את היכולות של הסטודנטים.\n\nהשורה התחתונה: \nהחומר חשוב ומעניין, אבל הקורס מנוהל בצורה קצת בזיונית. לא חושבת שזה כל כך ראוי שהגיעו למצב שהממוצע של מועד א בלי הפקטור נמוך עד כדי כך.", "timestamp": 1660146207228}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גל ללוש\nחוות דעת - הרצאות: \nהמון חומר שרצים עליו.. קשה באמת לקלוט דברים, במיוחד אם אין לך היכרות קודמות. לדעתי מומלץ להתרכז בלהבין את הרעיונות הכלליים ופחות בסינטקס ומה המשמעות של כל פסיק (בש\"ב תבינו).\nגל גם מרצה בקורסים מתקדמים של הנדסת תוכנה, ככה שבחלק של דיזיין הוא מוסיף ידע חשוב.\nבנוסף גם משתף על העבודה בתעשייה, דבר מאוד נחמד.\n\nשם המתרגל/ת: יניב גופט\nחוות דעת - תרגולים: מתרגל מעולה. מומלץ למרות שעמוס.\n\nשעורי הבית: בסמסטר שלנו היו לא נוראיים אבל מלאי בלאגן.\nמומלץ לחכות יום - יומיים שיצאו תיקונים לפני שמתנפלים.\nאם משהו לא ברור - קודם תשאלו בפיאצה ואז תממשו ולא להפך.\n\nהמבחן: ארוך ודקדקני. מומלץ מאוד לנסות להבין במהלך הסמסטר מה חשוב לסגל ומה הם אוהבים וליישם את זה במהלך המבחן גם אם אתם חושבים שיש דרך אחרת שעובדת.. בסמסטר שלנו למדנו על בשרנו שאם זה לא בדרך שהם אוהבים, זה לא נכון.\nתשאלו כל דבר שנראה לכם לא ברור\nאם אתם עושים הנחה כלשהי - תכתבו אותה.\n\nהשורה התחתונה: בפועל לומדים את החומר בש\"ב. \nמומלץ מאוד להיות בראש של הסגל מבחינת דרכי מימוש מועדפות, גם אם בכוח.", "timestamp": 1661073588103}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: גל ללוש הגבר\nחוות דעת - הרצאות: נקודת האור של הקורס. מעביר את החומר בצורה טובה ומשלב הרבה הומור ודוגמאות מהתעשייה.\nמה שכן לדעתי זה די מיותר לבוא להרצאה פיזית, בסופו של דבר לומדים בעיקר סינטקס של CPP ולדעתי עדיף לעשות את זה על מהירות כפולה לקראת העבודה על תרגילי הבית ולא לבזבז זמן בכיתה.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nבתחילת הסמסטר הייתי אצל מתרגל/ת אחר/ת שלא אזכיר את שמם כדי לא לעשות להם שיימינג פומבי אבל אחרי שהבנתי שהם עוברים על המצגת בפעם הראשונה איתי בכיתה החלטתי לוותר ולעבור לראות את ההקלטות של התרגולים של אלעד. אחלה מתרגל, מאוד מומלץ.\n\nשעורי הבית: \nנתחיל בטוב- שיעורי הבית מאוד רלוונטיים לחומר הקורס והם אלו שבאמת מלמדים אותו לעומק. מעבר לזה זאת גם הפעם הראשונה ובין היחידות מקורסי החובה בתואר שבאמת כותבים קוד וזה נותן טעימה טובה מהנדסת תוכנה.\nנמשיך ברע- משום מה, בעוד שברוב הקורסים בטכניון נהוג קודם כל לכתוב את שיעורי עד הסוף ולשחרר את לסטודנטים את הגרסה הסופית, הסגל של מת\"מ אוהב לערוך שינויים גם שבוע ויותר אחרי פרסום התרגילים. בנוסף, במקום לרכז את כל ההנחיות באופן מסודר בקובץ, שולחים את הסטודנטים לנווט בין קובץ התרגיל, דף השאלות והתשובות ופורום הפיאצה, כשהיופי הוא שבהרבה מהפעמים ההוראות שכתובות במקומות שונים סותרות זו את זו.\nאפילו יותר גרוע מחוסר המקצועיות של הסגל הוא חוסר השקיפות שלהם בדרישות בשיעורי הבית. לא פעם ולא פעמיים הורידו נקודות בבדיקה ידנית על חלקים בקוד שלא תאמו דרישות מימוש כאלו ואחרות שכלל לא פורטו בשום מקום. במקרים אפילו יותר גרועים, סטודנטים שאלו במפורש לגבי דרישות מימוש בפיאצה ונענו שזה \"נתון לבחירתם\" רק כדי שהסגל יוכל להוריד להם נקודות בבדיקה על זה.\nדוגמה כיפית- בחלק היבש של תרגיל בית 4, רוב הקורס איבד 15 נקודות על כך שלא השתמשנו בחומר שהופיע בחצי משפט באחד מהתרגולים וכביכול הפרנו קונבנציה אף על פי שהקוד עובד. כמובן שהדבר לא הופיע מראש כדרישה בקובץ התרגיל. ה15 נקודות האלו היו שוות לכמעט חצי נקודה מהציון הסופי, ככה שמדובר במחדל משמעותי. לפי מה שהבנתי הייתה התארגנות של הסטודנטים לפנות לסגל בנושא זה (הרי כמות כל כך גדולה של סטודנטים שנפלו על אותה טעות מעידה על כך שהסגל לא לימד את החומר כמו שצריך או לא היה ברור בדרישותיו) אך לא יצא מזה כלום.\n\nהמבחן: \nבניגוד לחלק מהביקורות הקודמות על מועד א, אני דווקא לא הרגשתי שהוא עמוס או קשה מדי. השוק האמיתי הייתה הבדיקה- מרגיש שהיא הייתה הרבה יותר קשה וקטנונית מבעבר. ממוצע מבחן לפני פקטור 56 מדבר בעד עצמו. אתה יוצא מהמבחן, מעריך שתקבל ציון מסוים ובסוף מקבל 15 נקודות פחות. אמנם נתנו פקטור של 8 נקודות אבל היה עדיף שיבדקו בצורה נורמלית.\nהסגל אשכרה הוריד נקודות על קוד שעובד בגלל חריגה מקונבנציות (אחרי שנכתב במפורש שאין צורך להקפיד עליהן), וכשסטודנטים ניסו לערער אז הסגל נימק את ההחלטה ואמר שאלו בכלל לא קונבנציות אלא \"כללי תכנות תקין\". וואלה לא יודע מה איתכם אבל לי זה נשמע כמו דרך מתוחכמת להגיד קונבנציות.\nלמשל, הורדו נקודות על שכפול קוד והסגל אפילו הגדיל לעשות והוריד נקודות בסעיפים מסוימים אם פתרת אותם מבלי להשתמש בפונקציות שהוגדרו בסעיפים קודמים (דרישה שלא הוגדרה בשום מקום).\n\nהשורה התחתונה: \nקורס חשוב ולפעמים אפילו מעניין שנהרס בגלל סגל ביזיוני שכמות הליצנים בו לא הייתה מביישת קרקס. \nבנוגע לשינויים בחומר הקורס שקרו בסמסטר הנוכחי- נראה שסך הכל הם לטובת הסטודנטים, מרגיש שנוסף פחות חומר ממה שירד. מה שכן, עוברים עליו בצורה די שטחית ולא מרגיש שלומדים יותר מדי. בכלל, רוב הקורס מתעסק בCPP ולא באמת בתכנות מערכות, וגם בעבודה על שיעורי הבית הרוב הוא מאבק עם השפה עד שהקוד מתקמפל ועובד ופחות תכנות מתקדם או מעניין.", "timestamp": 1661117688592}, {"author": "דפוס עיצוב", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עדי ליאב וקצת ללוש\nחוות דעת - הרצאות: המצגות של רובינשטיין והן נהדרות, המרצים פחות. תבדקו אם אתם יכולים ללמוד לבד מהמצגות ואם כן אפשר לדלג על ההרצאות\n\nשם המתרגל/ת: אלעד קינסברונר\nחוות דעת - תרגולים: מתרגל מעולה, רץ בחומר, גם מקליט. בסופו של דבר זה גם לעבור על קוד במצגות אבל אלעד גם משנה שקופיות וההסברים שלו טובים\n\nשעורי הבית: החל מהסמסטר שלנו הקורס התהפך לגמרי ויש הרבה תרגילים קטנים במקום, כולם להעתיק חתיכות מהמצגת ולגגל את השאר. ועדיין, הן יכולות להיות time sink רציני אז לא לשכוח להשקיע גם בקורסים האמיתיים. כרגיל - לסגל אין מושג מה הוא רוצה, לכל תרגיל יש אלף תיקונים, לעקוב אחרי הדרישות בפיאצה, לכו בדרך הברורה שלהם מהמצגות של ההרצאות והתרגולים כי אין עם מי לדבר\n\nהמבחן: די ארוך אבל לא באמת קשה, בסופו של דבר 0 לוגיקה ואלגוריתמיקה אלא רק boilerplate של ++C, יש מלא לכתוב, מלא טעויות במבחן ומלא הוראות לא ברורות, ככה שהממוצע יצא איזה 57 רק כדי שהם יתקנו אותו חזרה עם פקטור משוגע. תשאלו לגבי כל חוסר בהירות כדי שיהיה לכם גיבוי, מחזירים הכל בסוף בערעורים. לא לשכוח const!\n\nהשורה התחתונה: למי שיש ניסיון רלוונטי הקורס מיותר, למי שאין ניסיון במקרה הטוב לא מבין ובמקרה הרע מקבל הרגלים גרועים. אף אחד לא יודע מה הוא רוצה, בטח כשאנחנו סמסטר ניסוי, לסיים ולברוח", "timestamp": 1661377043732}, {"author": "אלחנן בלוך", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עדי ליאב\nחוות דעת - הרצאות: בד\"כ הוא מסביר טוב, אבל לפעמים הרגשתי שזה קצת מסורבל, ולא ברור מה הנקודה שהוא רוצה להגיד.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: הכי מומלץ שיש!!\nעדי גם מסביר טוב וברור, גם מתייחס מעולה לסטודנטים - אפשר בכיף לשאול וכד', וגם תותח בלי קשר, ומכניס אווירה טובה לתרגולים.\n\nשעורי הבית: תכל'ס, ארוכים ומעצבנים. בד\"כ לוקח הרבה זמן להבין איך עובדים עם השפה...\n\nהמבחן: סתם מעצבן. אין הרבה חומר שהוא באמת מעניין, אבל צריך ללמוד המון סינטקס וחוקים של תכנות נכון. קל מאוד לשכוח המון דברים קטנים, ומורידים על זה נקודות בנדיבות...\n\nהשורה התחתונה: לי הקורס היה די מעצבן, חוץ מהתרגולים...", "timestamp": 1664653708153}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גל ללוש\nחוות דעת - הרצאות: \nמרצה אחלה, מדלג על הרבה חומר שהוא חושב שלא רלוונטי\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nבחור חמוד ומצחיק ואכפת לו שהתלמידים יבינו את החומר, הוא חדש וזה מורגש אבל\n\nשעורי הבית: כל כך הרבה זמן ולא רלוונטים למבחן בכלל אבל חובה כי הם תקפים. חשוב מאוד לבחור בן/בת זוג שאתם תעבדו איתו טוב\n\nהמבחן: \nארוך ומייגע\n\nהשורה התחתונה: \nקורס עמוס עם שיעורי בית ארוכים וים חומר", "timestamp": 1665405094924}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ליאב עדי\nחוות דעת - הרצאות: בשנה האחרונה הפכו את החומר בקורס להרבה יותר רלוונטי ומעניין, ולכן זה אחד הקורסים החשובים לתואר ולתכנות בכלל. ליאב אחד המרצים הכי מעניינים שהיו לי. הוא איטי מאוד, היו כמה שיעורי השלמה שהוא היה צריך לעשות בגלל פערים בקצב עם המרצה השני. בדרך כלל אני לא אוהב מרצים איטיים, אבל הוא מלמד את החומר בצורה כל כך מעניינת ורלוונטית, מהניסיון שיש לו בהייטק, שזה לגמרי שווה את זה.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: אלעד מתרגל מעולה, מסביר את החומר בצורה טובה, מעניינת וכיפית.\n\nשעורי הבית: התרגילים הרטובים מאוד קשים, דורשים הרבה מאוד עבודה, דיבוג ועבודת צוות. אז מצד אחד זה טוב ומכין לעבודה על פרוייקטי קוד גדולים, אבל הבעיה העיקרית היא שההוראות של התרגיל מכסות רק חלק קטן מהציפיות מאיתנו, צריך לעקוב גם אחרי הפיאצה וגם אחרי השאלות והתשובות באתר (ויש הרבה הרבה שאלות שם), כשכל תשובה של הסגל היא חלק בלתי נפרד מההוראות ויכולה לשנות את כל הדרך בה צריך לפתור את התרגיל, ואפילו אז קורה שמפספסים איזשהו אספקט שהמתרגל לא טרח לציין ומאבדים הרבה מאוד נקודות מהתרגיל. צריך לשקול בקפדנות את הדרך בה כותבים את הקוד ולוודא שהוא כתוב טוב ושלא מפספסים אף הוראה.\n\nהמבחן: המבחן היה לא קל אבל הוגן, אבל הבדיקה הייתה קשוחה מאוד והורידו הרבה מאוד נקודות על פרטים קטנים.\n\nהשורה התחתונה: הקורס עצמו מעניין וחשוב, השינויים שעשו בו מדהימים ושיפרו אותו מאוד, אבל הניהול של שיעורי הבית על ידי הסגל לא טוב בכלל ודורש הרבה עבודה מעבר לכתיבת הקוד לתרגיל.", "timestamp": 1666788337442}, {"author": "Daniel Yitzhak", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: עדי ליאב\nחוות דעת - הרצאות: \nהרצאות מעניינות ורלוונטיות. עדי ליאב מרצה עם אהבה למקצוע ועם המון סבלנות ודוגמאות ליישומים של החומר בתעשייה\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: מעביר את החומר בצורה ברורה ומעניינת.\nתמיד מגיע ברוח טובה וחיוך. תמיד מעודד את הסטודנטים לשאול עוד עד שהכל ברור.\n\nשעורי הבית: עמוסים אך מעניינים ומביאים את רוב החומר מהתרגולים וההרצאות לידי יישום\n\nהמבחן: היה ארוך ומבלבל. יותר מדי התייסות לסינטקס ולא ברורה המטרה\n\nהשורה התחתונה: קורס מעניין ומספק כלים מעשיים עם מבחן מתסכל.", "timestamp": 1667330976804}, {"author": "anon", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: עדי ליאב\nחוות דעת - הרצאות- באמצע הסמסטר אולי קצת אחרי, קרתה תקלה רפואית וההרצאות עברו לזום, מה שגם לעוד יותר מריחות זמנים, אם אין לכם הרבה לחץ של זמן ממליץ מאוד, ליאב בן אדם מאוד נחמד ומעביר את החומר יחסית בצורה מעניינת.\nהייתה לנו הרצאת השלמה כי הוא לא הספיק חלק מהדברים וגם כל שיעור נמרח 20 דקות\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: \nאם הייתי צריך לתאר את עדי חריף באמצעות שיר אחד זה היה זה:\nhttps://www.youtube.com/watch?v=QJJYpsA5tv8\nשעורי הבית: \nעמוסים, רובם במצגות,במחזור שלנו הרבה קיבלו חשד להעתקה בגלל שטענו שהעתיקו מהמצגת \nהמבחן: \nעוד לא עשיתי :(\nהשורה התחתונה:", "timestamp": 1675354283903}, {"author": "שירה מאירי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה:  נאדר בשותי\nחוות דעת - הרצאות:  ההרצאות היו ממש חמודות לדעתי. כן, נאדר מקריא מהמצגת, אבל זה בעיקר כי אין השתתפות של הסטודנטים. גילוי נאות, הצטרפתי לקורס בשבוע החמישי לסמסטר. ברגע ששאלתי שאלה נאדר היה מאושר להסביר, לפרט, לחזור ולהוסיף כמה שצריך עד שאבין היטב את החומר. למרות השאלות שלי, ההרצאות שלו עדיין הסתיימו לפני הזמן והרגישו קלילות ויחסית חמודות. פשוט צריך לשאול שאלות עד שמבינים והוא יענה בשמחה :)\n\nשם המתרגל/ת: עדי אמוזיג\nחוות דעת - תרגולים:  וואו! היא מ ד ה י מ ה! כל כך נהנתי מהתרגולים שלה, הם עברו לי בכיף ומהר, היא הספיקה לענות על שאלות, לשתף את הכיתה ותמיד לתת את התחושה שמותר לעשות טעויות והכל טוב ככה לומדים. היא עשתה הכל כדי שהכיתה תהיה נעימה ומעולם לא נתנה תחושה רעה אם ההסבר שלה היה לא ברור למישהו או שמישהו נתן תשובה לא נכונה, רק שאלה אותנו שאלות עד שנוכל להבין איפה הטעות או מה לא ברור. היא הספיקה את כל החומר לאורך הסמסטר והשעות קבלה שלה הן פשוט זהב! רק ללכת אליהם כמה שיותר, אפילו אם רק לשבת להקשיב לשאלות של אחרים. אני צריכה בקורס הזה ציון מאוד גבוה בגלל ענייני אפיק מעבר והיא הייתה מאוד תומכת ואכפתית ומאוד הרגיעה אותי בשעות קבלה שלה ונתנה לי את התחושה שציון כמו 92 הוא מטרה אפשרית. \nבאופן קבוע היא הספיקה את כל החומר לתרגולים שלה, תוך כדי שהיא מעודדת אותנו לשאול עד שנבין ולנסות לענות על השאלות בעצמנו😇\nהיא קודם כל בת אדם!❤️\n\nשעורי הבית:  גיליון פעם בשבועיים, לא לוקחים הרבה זמן בכלל אבל הגשה חובה עם שותפים. ממליצה לבחור שותף שיש לכם כימיה מינימלית איתו. לא הייתה לי כימיה מי יודע מה עם השותף והרגשתי שאני שורפת זמן בללמד אותו הרבה מהחומר במקום להגיש את הגיליון ולהמשיך למטלות ודברים אחרים שאני צריכה להספיק. יש סדנאות לשיעורי בית שלא יצא לי ללכת אליהם, אבל שמעתי שהן מעולות, כמובן שתמיד גם אפשר להיעזר בשעות הקבלה. השיעורי בית חשובים יחסית כי יכולה להיכנס שאלה מהם למבחן והם בדרך כלל מקיפים הוכחות ותרגילים ברמה בסיסית בנושא שעוזרים לבסס הבנה. השאלות בתרגילי בית כמובן הרבה הרבה הרבה יותר קלות מהמבחן ולא משקפות את הרמה של המבחן בסוף. מסקנה: השיעורי בית הם כלי לימודי, חשוב להגיש אותם כי יש בונוס של חצי נקודה על כל גיליון שמגישים (עד מקסימום של שתי נקודות) ומקבל ציון עובר. ציוני השיעורי בית הם בעובר או לא עובר. לא עמוס בכלל במהלך הסמסטר.\n\nהמבחן: המבחן היה כתוב באופן מבאס קצת. \n65-70 נקודות בתוך ארבע שאלות שהיה קל להשיג וכללו שאלה מהשיעורי בית ושאלות קלות יחסית שהיה מאוד פשוט לענות עליהן. ה30-35 נקודות האחרות היו הרבה הרבה פחות טריוויאליות ומאוד טריקיות (כנראה כדי להימנע מלתת פקטור על המבחן). מקווה שבכל זאת יהיה פקטור כי אני צריכה ציון גבוה בקורס הזה. חשוב מאוד לפתור קודם את השאלות הבאות בקלות כדי ששאר הזמן יהיה פנוי להתעסק עם השאלות המורכבות יותר משמעותית.\n\nהשורה התחתונה: קורס בסדר יחסית, מרגיש קצת כמו פתרון חידות - רק שנותנים כלים שיעזרו לנו לגשת לפתרון המיטבי שלהן. דורש יצירתיות והמון תרגול לפני המבחן. ממליצה להתחיל לטפטף פתרון מבחנים כבר בחודש האחרון לסמסטר עם מבחן בשבוע ובשבוע האחרון של הסמסטר להיכנס לחרישה רצינית כי חייבים לראות כמה שיותר שאלות מכמה שיותר סוגים כדי להתמודד עם היצירתיות של כותבי המבחן.\nאל תצפו שלא ימציאו לכם את הגלגל בבחינה, זה הקורס שבו הם מוכיחים שאפשר להמציא את הגלגל כל מבחן מחדש.", "timestamp": 1675524537667}, {"author": "שירה מאירי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  ליאב עדי / יובל פילמוס \nחוות דעת - הרצאות: התחלתי אצל יובל בגלל אילוצי מערכת והיה מאוד בינוני... הוא אומנם לא היה בפיגור בשום שלב, אבל לא התעכב על הדוגמאות או הנקודות החשובות. לעומתו ליאב היה בפיגור בחומר פה ושם, וההרצאות שלו נגמרו מאוחר, אבל השתדל לתת דגשים חשובים ולהתעכב על הדוגמאות - אז היה להרצאות שלו ערך מוסף לדעתי. ההרצאות של ליאב עברו באמצע הסמסטר להיות בזול ומודה שזה היה מאוד נוח כי זה איפשר לי לעבוד על התרגילי בית בזמן ההרצאות שלדעתי מאוד מתאימות לזה כי לפעמים הקצב מרגיש קצת איטי. לענות על השאלות שלו מדי פעם עזר לי להישאר בלופ של השיעור למרות שאני עובדת על קוד אחר תוך כדי.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: וואו! המתרגל והאגדה! הוא מצויין ואני ממליצה בחום לכל מי שיכול ללכת לתרגולים שלו לעשות את זה. התרגולים שלו היו מהנים, מגניבים ומצחיקים ונהנתי מכל תרגול ותרגול. הוא נתן את התחושה שאכפת לו מהסטודנטים ומההצלחה שלנו בקורס והיה קשוב אלינו. הסדנאות איתו היו נהדרות הוא שמח לתרום מניסיונו לכל מי שרק ישאל ויתעניין. מתרגל מאוד חכם שהוא גם קודם כל בן אדם שאכפת לו❤️\n\nשיעורי הבית:  לא פשוטים ודורשים זמן. חשוב למצוא שותף או שותפה מעולים שאיתכם באותו ראש. זכיתי בשותפה מדהימה שהכרתי בהרצאה הראשונה והכימיה שלנו נהדרת. חלוקת העבודה שלנו הייתה שאני מתחילה את התרגיל (כי אני מספיקה והאמת שממש נהנתי לכתוב את התרגילי בית באופן כללי) והיא מתערבת ברגע שאני מגיעה למבוי סתום או שהיא מצליחה להיכנס לענייני התרגיל (בדרך כלל הקדמתי אותה בכמה ימים נטו כי היה לי סמסטר רגוע יחסית). חשוב לקרוא את ההוראות היטב, להתעדכן בפיאצה ולשים לב לכל פרט הכי קטן. ממליצה להתעקש לעשות כמה שיותר טסטים, הרבה מעבר למה שהסגל נותן. יש לשותפה שלי עדן ולי מאה בכל התרגילים, אז זה לגמרי אפשרי. דורש השקעה אין ספק.\n\nהמבחן: עוד לא היה, אבל יש מעט מאוד מבחנים לתרגל מהם. השאלות חזרה בתרגול היו נראות חמודות... הסמסטר הקודם נפלו חזק במבחן אז מקווה שעם שבועיים לחרוש היטב יהיה ציון במבחן שישאף לזה של השיעורי בית;)\n\nהשורה התחתונה: קורס שדורש המון השקעה, הסגל לא תמיד אחיד והשיעורי בית כבדים. לעבוד טוב עם השותפ/ה ולהבין שהכימיה צריכה להיות אידיאלית. להשקיע, להתקטנן, לשאול הכל ולא לוותר על אף פרט קטן. העבודה הקשה משתלמת!", "timestamp": 1675525962179}, {"author": "עידו", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: הקלטות גל ללוש\nחוות דעת - הרצאות: לא ראיתי שום סיבה להגיע להרצאות הרגילות לכל מרצה היה חסרון משמעותי אחר. ההקלטות של גל  מעולות ועוברות על כל החומר (הוא גם זה שכתב את המצגות)\n\nשם המתרגל/ת: עדי חריף!!\nחוות דעת - תרגולים: \nאין על עדי חריף בעולם הזה! מתרגל מעולה, עושה את השיעורים מעניינים ואינטראקטיביים (קהוט נושא פרסים!)\n\nשעורי הבית: \nארוכים אבל לא מאוד מציקים, ההגשות לא תמיד מסתדרות עם החומר של התרגולים (לפעמים צריך להגיש מטלה בנושא שלומדים בתרגול יומיים לפני) אז צריך ללמוד לבד ולדעת לקרוא את המצגות של התרגולים לפני \nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676477996075}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  ליאב עדי\nחוות דעת - הרצאות: \nמצד אחד , זה כיף להיות בהרצאה של ליאב, הוא מעביר את זה בצורה מעניינת.\nמצד שני, יש לו פה ושם טעויות, וגם אם שואלים אותו שאלה, והוא לא סגור עליה , הוא תמיד יגיד לכם שהוא יחזור עם תשובה בהרצאה הבאה, אבל זה אף פעם לא קורה.\nבסה\"כ מרצה מעולה.\n\nשם המתרגל/ת: יניב מוקלט\nחוות דעת - תרגולים: \nאני לא התחברתי לאף אחד מהתרגלים הסמסטר, וראיתי הקלטות של יניב, הם ממש ממש ממש טובות, מאוד ממליץ.\n\nשעורי הבית: \nמצד אחד, השיעורי בית מלמדים, הם ממש עוזרים להבין את החומר, ולהשתפר.\nמצד שני, יש שאלה במבחן של 50 נקודות, שעליו אין תרגיל בית, אז זה לא ממש מספיק.\nממליץ לעשות ממש את השיעורי בית. ( 30% תקף בכל מקרה חייב, אבל הכוונה שלי , היא שרצוי שתשקיעו בהם)\n\nהמבחן:\nהמבחן שלנו במועד א , שהיה היום, היה ממש לא הוגן וברמה הרבה יותר גבוה:\nהביאו את הדף של השאלות עם הדף של התשובות, זה חרפן את כל הסטודנטים. היינו צריכים לדפדף 1000 פעמים במהלך הבחינה, וזה פשוט העיקקקקקקקקקקקקק.\nבנוסף, הביאו בשאלה 1 ג להשתמש במשהו שהוא בסעיף 1 ד, לכו תבינו את זה.\nהמבחן היה ארוך בקטע לא הגיוני. הרוב לא סיימו את הבחינה, וגם מי שסיים לא בטוח לגביה\n \n\nהשורה התחתונה: קורס ממש מעניין ומאוד מומלץ\nלצערי מועד א לא יצא לטובתנו, בכל מקרה בתקווה שלפחות מועד ב יהיה הוגן.", "timestamp": 1676809205270}, {"author": "אנונימית", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גל ללוש (הקלטות)\nחוות דעת - הרצאות: \nממש אחלה. מסביר בצורה ברורה ומעניינת. \n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: \nכמעט כל הביקורות הטובות פה זה עליו ובצדק, באמת בן אדם ממש מיוחד. מעבר לזה שהוא אחלה מתרגל, באמת ממש אכפת לו, הוא מדבר בגובה העיניים ונותן הרבה מנסיון העבר שלו כסטודנט. היה מרענן ביחס ליחס המזלזל שנתקלנו בו לפעמים מהמתרגל האחראי :( מומלץ בחום!\nבכללי על התרגולים- אני הרגשתי שהסנכרון בין ההרצאות לתרגולים על הפנים, החומר מועבר בסדר שונה, לפעמים למדנו בתרגול דברים שהיו רלוונטים לתרגיל בית שהיינו צריכים להגיש יומיים אחרי התרגול.\n\nשעורי הבית: \nארוכים ודורשים השקעה אבל לא השקעה מוגזמת והזמן שנותנים ממש מספיק. לא הרגשתי שזה הפריע לקורסים אחרים בסמסטר או משהו כזה. לפעמים יש הנחיות לא ברורות וסותרות מצד הסגל אז תהיו על הפיאצה, אבל התרגילי בית היו ממוחזרים מסמסטר שעבר אז בסמסטר שלנו היה הרבה פחות בלאגן. אני ממש ממש ממליצה להשקיע בתרגילי בית- ההרצאות והתרגולים היו טובים אבל מבולגנים, לתחושתי בהרצאות בעיקר זורקים עליך מלא מידע והלמידה היא בעיקר עצמאית תוך כדי התרגיל ושם כל האסימונים נופלים. למשקיעים- אפילו ממליצה לא לחלק את העבודה עם השותף ולעשות הכל ובסוף למזג. התרגילים לא מטורפים בעומס שלהם וזה אפשרי וזה ישתלם לכם :)\n\nהמבחן:\n2 שאלות cpp- כשאחת יותר ממוקדת דיזיין, ושאלה אחת פייתון. בגדול היה הוגן- אבל השאלה הראשונה הייתה מאוד לא ברורה, לקח המון זמן להבין בכלל מה רוצים מאיתנו ועוד יותר זמן לחשוב איך לממש את זה, הסעיפים היו בסדר לא הגיוני (מימוש מחלקה ובסעיף אחרי מימוש מחלקה שמשפיעה על המימוש הקודם). גזל מלא זמן וגרם לזה שאת כל המבחן פתרנו בחוסר זמן- מתכון למלא טעויות קטנות שבקורס ממש שמים עליהן דגש ומכחסים עליהן בבדיקה ממה שראינו. אז קצת באסה \n\nהשורה התחתונה: \nלמרות שהקורס מבולגן ולפעמים שמים דגש על דברים שמרגישים ממש שטותיים, אני נהניתי. לדעתי קורס מעניין ורלוונטי.", "timestamp": 1677102051492}, {"author": "מעריץ של הסופר", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גל ללוש (הקלטות)\nחוות דעת - הרצאות: \nאני אישית אהבתי.\n\nבהתחלה הייתי הולך לליאב, והוא היה מאוד איטי בשבילי.\nהרגיש שהוא העמיק ונתקע בכל שקופית, בלי להבחין בין מה חשוב ומה פחות. גל בדיוק ההפך. \n\nבנוגע להרצאות עצמן, לדעתי מסודרות בצורה קצת מבלבלת.\nהיה קשה לי להפנים ולזכור את הדברים שלמדתי בהרצאה.\n\nהחומר נקלט באמת אך ורק בתרגילי הבית.\n\nשם המתרגל/ת: אלעד \nחוות דעת - תרגולים: \nממליץ. \nמקצועי, ברור, וגם מצחיק - אם נהנים מסוג ההומור שלו. \nהייתי פעם אצל עדי חריף, וגם אחלה לגמרי. \n\nהתרגולים יכולים לעזור קצת להפנים את החומר יותר מבהרצאה ולהקל במעט על פתרון שיעורי הבית. לפעמים גם מועבר חומר שאין בהרצאה.\n\nשעורי הבית: \nדורשים זמן אבל חשובים מאוד.\nאם נתקלתי בקושי, זה בעיקר בגלל שיש אי-תיאום בזמנים בין ההרצאות, התרגולים, ומטלות הבית. רק אחרי שהמטלה יוצאת, נחשפים לכלים השימושיים לפתירה בתרגולים ובהרצאות. חשוב לשים לב לזה, מי שרוצה להתקדם יכול לפתוח את המצגות שעוד לא הועברו ולבדוק אם יש הסבר על כלים רלוונטים למטלה.\n\nמרבית הציון נקבע לפי הבדיקות הרטובות, שזה טסטים אוטומטיים שהסגל מריץ ולצערי זה גורם לניקוד כסחני ולא מתאים לדעתי. הרבה נקודות יורדות בגלל דברים שטותיים ולא בדיקה של תכנות נכון.\n\nהמבחן: \nלדעתי המבחנים בפורמט החדש הוגנים. \nגם המבחן שלנו הרגיש לי הוגן. \nמבחינת זמן באמת היה לחוץ, וכן השאלה הראשונה הייתה במעט מבלבלת, אבל לא דורש טריקים או שיטות שלא נחפשנו אליהם.\n\nהשורה התחתונה: \nאותי הקורס די שעמם, מתעסקים בהתחלה הרבה בשפת C, סיוט. לוקח זמן עד שמגיעים לדברים חשובים כמו תבניות וירושה.\n\nבנוסף חוסר התיאום בלוז בין הרצאות, תרגולים ושיעורי בית די מעיק ומבלבל. שיטת הניקוד על מטלות על הבית גם היא מבאסת. \n\nהיחס של המתרגל האחראי (אלעד) בפניות אליו לרוב ציני ולא נעים.\n\nאבל בסופו של דבר, החומר מופנם, והמבחנים בסך הכל הוגנים מבחינת רמת קושי (אולי מבחינת זמן קצת פחות).", "timestamp": 1677419858848}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יוסי וינשטיין\nחוות דעת - הרצאות: מרצה תותח ממש, מסביר מצוין מקשיב לשאלות ואווירה טובה בשיעור, בונוס- נותן דעה אובייקטיבית על החומר והמצגות ולא מורח את הסטודנטים\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: \nעמוסים ומלאים בשטויות אבל שווים המון ומומלץ מאוד להשקיע כי זה משתלם ותכלס עוזר להפנים את החומר\n\nהמבחן: \nסביר, ארוך ומתיש\nהשורה התחתונה: מי שנהנה לתכנת ולכתוב קוד - קורס חביב בגדול", "timestamp": 1677749471795}, {"author": "ITZIK", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: הרצאות של ליאב ואז החלפה להרצאות מוקלטות של גל כי ליאב טיפה מורח את ההרצאות למרות שהוא אחלה בן אדם והיה כיף ללמוד ממנו\nגל אחד המרצים התותחים \nתראו את ההקלטות של גל, רק תוודאו שלא שינו את החומר כי כל הזמן ליאב מוסיף שקופיות ועושה דגשים שונים\n\nשם המתרגל/ת: מוקלטים של יניב\nחוות דעת - תרגולים: הרבה פעמים הם סתם רצים (כל המתרגלים) אז עדיף גם לקרוא את השקופיות בבית אם יש זמן או בתקופת מבחנים כמו שאני עשיתי\n\nשעורי הבית: \nהעבודות הראשונות היו נוראיות כי לא הייתי רגיל לעבודה עם GIT אבל אחרי שלומדים להשתמש בכלים של הקורס הכל יותר זורם. האמת התרגילים היו כיפים וממש נתנו טעימה מגניבה לאיך מפתחים מערכת של משחקים\n\nהמבחן: ארוך אבל לא כל כך קשה אם תרגלתם הרבה ועשיתם את העבודות בית\nאם באמת למדתם בתרגילי בית (ולא עשיתם קופי פייסט) אז אני מאמין שיהיה לכם די סבבה במבחן\nרק תתרגלו על זמנים כי יש לחץ של זמן בקטע של להספיק לכתוב הכל גם אם אתם יודעים הכל חלק\n\nהשורה התחתונה:\nלא כזה אהבתי את הסגל אז ראיתי הרוב הקלטות (גם היחס לא היה אידאלי בהרבה מקרים)\nאבל החומר של הקורס מעניין אז תנסו להפיק את המיטב", "timestamp": 1679089198665}, {"author": "anon", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ליאב עדי\nחוות דעת - הרצאות:  \nבסדר בסה\"כ \nהיה גולש בהרבה מההרצאות מעבר לזמן ההרצאה\nהתעכב על כל דבר (שזה לא כל כך רע)\nשתי ההרצאות האחרונות היו קצת מבולגנות אבל אם חוזרים עליהם מבינים \nאישית נהניתי מההרצאות. אבל אני מכריה הרבה שלא. אז תנסו... \nשם המתרגל/ת: אלעד \nחוות דעת - תרגולים: בתרגולים הוא ממש מצויין רץ על החומר והיה ישר לעניין. בסדנאות היה בסדר.\n\nשעורי הבית: מעמיסים אבל לא כל כך קשים או טריקיים. היה מצב שבאחד מהם הניסוח היה מבלבל והוסיפו תנאים בפיאצה יום/יומיים לפני ההגשה וזה היה סיוט אבל בסוף הכל הסתדר והתרגיל הוארך. \n\nהמבחן: ניגשתי לשני המועדים. במועד א לא ממש הסתדרתי עם השאלה הראשונה... הייתה קצת מבלבלת אבל בסה\"כ מעבר לזה היה ממש בסדר ופקטרו בהתאם. מועד ב' היה באותו הסגנון. גם כן הניסוח היה קצת מבלבל באחד ההערות בשאלה הראשונה אבל בסה\"כ הוגן (וגם פקטרו בהתאם)\nמעבר לזה,אין במבחן טריקים. זה לא אינפי. אין דרישות סיבוכיות. שאלות הפייתון בד\"כ קלות. בסה\"כ אפשר להוציא ציון טוב (85+)     \n\nהשורה התחתונה: קורס מעניין. התחברתי מאוד. המבחן בסה\"כ בסדר. החלק הכי קשה בקורס זה שיעורי הבית.", "timestamp": 1680251453933}, {"author": "The disciple", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: ליאב עדי \nחוות דעת - הרצאות: סה\"כ מרצה ברור נותן דוגמאות ואינטואיציות, לפעמים טיפה מתפזר (ניכר גם בכמות ההקלטות הנדרשות ואורכן). סה\"כ הסתדרתי איתו ולדעתי המוקלט של ללוש פחות מובן.\n\nשם המתרגל/ת: אלעד חוות דעת - תרגולים: \nכמתרגל נטו ברמה המקצועית אי אפשר לקחת ממנו את הבקיאות וסה\"כ יכולת בינונית+ לנהל שיעורים. אבל כבן אדם וכמתרגל אחראי הוא פשוט היה נורא. הערות לא ברורות, התעמרות בסטודנטים, יחס מתנשא ובכללי מאוד קשה לדבר איתו כמו בן אדם, ממש מרגיש כאילו עונה לך בוט. זה בא לידי ביטוי בשיעורי הבית וגם במבחן סוף ובערעורים עליו.\n\nשעורי הבית: \nהיו מרופרנסים מסמסטר קודם עם שינויים קלים. סה\"כ לא מעיקים אם אתם חדים על החומר מלבד ת.ב 4 שהוא ארוך ברמות אבל לא מורכב ככ מבחינה מחשבתית.\nהמבחן: \nזוועה.\nהחליטו בסמסטר שלנו לשנות את הנוסח של השאלת תכן ולפזר את הסעיפים באופן לא הגיוני בעליל בשביל למקסם את הבלבול של הסטודנטים. בשורה התחתונה? זה עבד. ציון ממוצע לפני פאקטור של 48 יעיד על כך. \n\nבנוסף, כל ההתנהלות עם הפתרון הרשמי והערעורים הייתה חובבנית ומקוממת.\n\nהשורה התחתונה: \nקורס שיכל להיות חביב+ אם הסגל היו יותר בני אדם ואולי גם טיפה יותר מקצועיים. במצב הנוכחי עם אלעד כמתרגל אחראי, זה לא יקרה.", "timestamp": 1680277975895}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: \nצוות בזיוני, גועל נפש.", "timestamp": 1680346209930}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ליאב עדי + ללוש מוקלט\nחוות דעת - הרצאות: \nבעיקרון רציתי ללכת ליוסי אבל לא הסתדר במערכת… אז הלכתי לליאב (ליאב, לא עדי). הוא מותק, כיף להקשיב לו ובדיבור שלו נורא מורגשת התשוקה לחומר. הוא מרחיב קצת מעבר עד כמה שיכול, לפעמים זה מעיק. \nבאמצע הסמסטר הרגשתי שהשעות המאוחרות לא בשבילי, אז עברתי למוקלט של ללוש. הוא אחלה, אבל לא ברמה שמצדיקה את כל ההייפ סביבו. \n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: חייבת לציין שכל המתרגלים חמודים מתוקים, באמת אנשים זהב. אז עדי, אחלאם, ואסף, אתם אגדות! שמחה שהכרתי אתכם למרות שלא הייתי בתרגולים שלכם מעולם 3>\nועכשיו לאלעד- אלעד מאוד מקצועי, ניכר ששולט בחומר ושהוא שפיץ לא קטן. ממש נהנתי בתרגולים שלו. במקביל, הוא היה די שנוי במחלוקת מצד הסטודנטים בשל ההתנהגות המזלזלת שלו לפעמים. באסה קצת.\n\nשעורי הבית: סבבה רצח. לא ארוכים מדי, אבל לא קצרים. דורשים המון מחשבה והתמקדות בפרטים הקטנים, אז כדאי לשבת עם המצגות במקביל כדי שתהיה לכם דוגמה. לי אישית היה ממש כיף להכין אותם. בכללי זה מדהים בעיניי שכל שאלה במתמ מכניסה אותך לתוך סיפור מגניב כזה שאתה בונה מאפס בעזרת קוד.  \n\nהמבחן: מועד א היה לי קשוח. מעל שעתיים ישבתי על שאלה 1, למרות שהמבחן בגדול היה הוגן לגמרי. ממליצה מאוד לתרגל כתיבה על דף! תמשיכו לפוצץ מחברות כל עוד אין לכם דלקת פרקים. במועד ב זה עזר לי מאוד.\n\nהשורה התחתונה: כללי ברזל: לא להתכסח עם אלעד, לא להעתיק ממש מהמצגות כדי להימנע מחשד להעתקה, לתרגל מלא כתיבה על דף לפני המבחן, ולהנות- כי זה קורס מגניב, מעניין ורלוונטי :)", "timestamp": 1681245387543}, {"author": "*", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ליאב עדי מוקלט\nחוות דעת - הרצאות: \nהלכתי בהתחלה ליוסי אבל התייאשתי מהר (לא ממש שם על הסטודנטים, קשה להקשיב לו, מפרט מלא על נושאים לא רלוונטיים ולא עונה לשאלות). ליאב טיפה חופר אבל מרצה יותר טוב, מגניב שהוא מביא דוגמאות מהתעשייה.\n\nשם המתרגל/ת: אסף במברגר\nחוות דעת - תרגולים: \nלדעתי היה ממש טוב! מסביר ברור אבל בקצב טוב, לא מתעכב על שטויות, עושה אווירה טובה בתרגול.\n\nשעורי הבית: \nהיה לנו תרגיל אחד מזעזע שלקח המון זמן, והיתר כבדים אבל הרבה יותר אפשריים. בסה\"כ שיעורי הבית הם העומס והקושי המרכזי של הקורס, חשוב לא לזלזל בהם ולהתחיל אותם מוקדם ולכתוב טסטים!\n\nהמבחן: \nגם קשה מבחינת זמנים, גם לא מנוסח מדהים וגם התמקד קצת בדברים נישתיים ולא בעיקר החומר שלמדנו בקורס. ממליצה ללכת לפני המבחן לשעת קבלה כי יש המון קטנות שהם מצפים במבחן שאין ממש דרך להבין לבד.\n\nהשורה התחתונה: \nקורס שיכול להיות ממש מעניין אבל לדעתי קצת מפוספס כי הסגל מפשל.", "timestamp": 1691507141391}, {"author": "אין לי כוח", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: מוקלט ליאב עדי\nחוות דעת - הרצאות: כל המרצים ממש גרועים, ואנשים די קקות, חוץ מליאב שמשום מה לא העביר את הקורס הסמסטר (היחיד גם עם ניסיון אמיתי), מסביר די טוב חומר סופר משעמם.\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: תותח, היינו בממוצע 3.5 סטודנטים אצלו, מה שגרם לתרגולים להיות שיעור פרטי של שעתיים. גם בחור די טוב, שאר המתרגלים די פוצים.\n\nשעורי הבית: נוראים, אין דבר שעשיתי בחיי שהיה יותר גרוע מזה. מנוסחים בצורה מזוויעה, מרגיש כאילו ילד בן 12 רשם אותם, פשוט ביזיוני ברמה אחרת (ממוצע 29 בתב 1 מעיד על כך). בנוסף הסגל מחלק ציונים רנדומליים לפעמים ככה שאם קיבלתם ציון כלשהו תבדקו אם זה באמת הציון שלכם.\n\nהמבחן: לא ברור מה צריך לעשות שם, יש אובר דגש על לדעת להשתמש בconst, נעשה על דף. יש מאגר של בערך 10 מבחנים שניתן לתרגל מהם, מומלץ לעשות את כולם, ואת האלו מהשנים האחרונות פעמיים + לעבור על design patterns ולא לשכוח להדפיס את כל המצגות למבחן, כי המבחן עם חומר פתוח (חשוב מאוד). בכללי קיבלתי ציון מאוד גבוה בקורס, ואני יכול להגיד שאין לי מושג עדיין מה למדתי. מרגיש כאילו הגרילו ציונים.\n\nהשורה התחתונה: קורס חרא, סגל די גרוע, שיעורי בית נוראים, ומבחן שבודק כמה אתם יודעים להשתמש בconst", "timestamp": 1692199314243}, {"author": "תור ישראלי", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יוסי ויינשטיין\nחוות דעת - הרצאות: לדעתי הוא נוטה להתעכב יותר מדי על שאלות של סטודנטים ועל שקפים מסוימים במצגות שאפשר היה לעבור עליהם יותר בתמצות. חוץ מזה הוא מסביר בסדר, ראיתי את ההקלטות שלו על 1.75 והיה סבבה.\n\nשם המתרגל/ת: אמיר אלקלעי\nחוות דעת - תרגולים: תותח, מלמד את החומר דרך ה-VS Code במקום דרך מצגות וזה עוזר ממש להתרכז ולהבין יותר טוב מה הפואנטה. הוא כן פספס חומר מסוים שהיה במצגות (וגם במבחן) אז כדאי לעבור על המצגות ולוודא שאין חומר שהתפספס. חוץ מזה אחלה בחור ויש אווירה סבבה בתרגולים.\n\nשעורי הבית: תרגיל בית 0 היה מבלבל מבחינה טכנית, למי שלא רגיל לעבוד עם git או לעבודה בשרת של הפקולטה זה יכול להיות מאוד מעיק להבין מה בדיוק הם רוצים שנעשה. תרגיל בית 1 היה הבעיה האמיתית, הוא היה כתוב בצורה לא טובה וברמת קושי לא פרופורציונלית והציונים היו בהתאם. אבל הסגל והנציגים של הסטודנטים מצאו פתרון הוגן סה\"כ ושאר תרגילי הבית היו בסדר, אמנם חלק קצת ארוכים אבל היה הרבה יותר ברור מה צריך לעשות וגם אפשר היה לסגור אותם ביומיים-שלושה של עבודה.\n\nהמבחן: הוא די ארוך ויש הרבה מאוד מלל, אבל אם השקעתם ברטובים במהלך הסמסטר ופתרתם את המבחנים מהשנים האחרונות אז אפשר להצליח. הבעיה העיקרית היא שהבדיקה די קשוחה ומורידים כמעט על כל דבר קטן, אז מומלץ לשים לב לדקויות ולנסות להיכנס לראש של המתרגלים ולחשוב על מה אפשר להוריד.\n\nהשורה התחתונה: סה\"כ קורס מאכזב, לדעתי הוא יכול באמת ללמד המון דברים חשובים ולתת להרבה סטודנטים הרגלי תכנות טובים אבל בגלל ההתנהלות הכללית של הסגל והדגשים המוזרים במבחן ובתרגילי בית הוא מפספס את המטרה.", "timestamp": 1692625200323}, {"author": "🥸", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יוסי ויינשטיין\nחוות דעת - הרצאות: הגעתי להרצאה הראשונה של מתן ומשהו לא עבד לי. המשכתי את הסמסטר עם יוסי ולמרות שהוא קצת controversial מאוד אהבתי את ההרצאות והרגשתי שהחומר עבר בהן בצורה טובה.\n\nשם המתרגל/ת: אסף במברגר\nחוות דעת - תרגולים: מושלם.\n\nשעורי הבית: תרגיל בית 1 היה פשוט רע אבל אחרי לחץ מצד נציגת הקורס הגיעו לפתרון הוגן עם הסגל, חוץ ממנו הכל היה די נחמד ואפילו כיף.\n\nהמבחן: ארוך, קצת מייגע וכתוב בצורה לא מאוד ברורה. הבעיה הכי גדולה היתה שאנשים שונים בסגל ענו תשובות סותרות ולפעמים הטעו סטודנטים (כנראה בגלל חוסר היכרות עם המבחן או חוסר תשומת לב לשאלה). מומלץ מאוד לכתוב על טופס המבחן מה שאלתם את הצוות ומה התשובה שקיבלתם ליתר ביטחון. ואם שאלתם \"האם מותר לי להשתמש ב-...\" וקיבלתם את התשובה לא - תכתבו גם פתרון עם וגם פתרון בלי.\n\nהשורה התחתונה: קורס מעניין, חומר רלוונטי, רוב הצוות מוצלח אבל היו גם נפילות.", "timestamp": 1696598752961}, {"author": "לאפר דלף", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: מצגות\nחוות דעת - הרצאות: המרצים מאוד לא חברותיים והעדפתי ללמוד לבד את החומר.\n\nשם המתרגל/ת: מצגות.\nחוות דעת - תרגולים: לא הלכתי אבל חריף מתרגל פצצה.\n\nשעורי הבית: תרגיל בית 1 היה מזעזע. כתוב בצורה לא מובנת - בכלל. הממוצע היה 29. מישהו שם קפץ מעל הפופיק בניסיון להרשים איזה בכיר וזה היה פיאסקו מוחלט. שאר התרגילים היו סבירים ומובנים יחסית.\n\nהמבחן: הרבה התמקדות בפרטים קטנים ולא חשובים מאשר במהות האמיתית של תכנות מערכות. תתרגלו הרבה מבחנים משנים קודמות.\n\nלסיכום: אם לא חייב - אל תעשו.\n\nהשורה התחתונה:", "timestamp": 1703266449435}, {"author": "-", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יוסף ויינשטיין\nחוות דעת - הרצאות: הלכתי כמה פעמים למתן והוא לא לגמרי ידע  איך להעביר את החומר והיה איטי ברמות. המשכתי את הסמסטר עם יוסף והוא היה האופציה הטובה יותר אבל עדיין היה איטי, לא נעים לסטודנטים ששואלים שאלות (אפילו צועק), ובמצגות היו המון טעויות.\n\nשם המתרגל/ת: אמיר אלקלעי\nחוות דעת - תרגולים: מתרגל מושלם, בתרגולים העביר עם vs code כך שהיה אפשר לראות איך מיישמים את החומר הנלמד, נעים לסטודנטים ומעביר הכל ממש טוב. עדיין מומלץ לשבת בתרגול עם המצגת כדי שיהיה סנכרן עם החומר.\n\nשעורי הבית: במילה אחת - זוועתיים. פשוט סיוט. התחיל מתרגיל בית 0 שהיה קליל אך לא מובן בהסבר שלו והמשיך לתרגיל בית 1 הידוע לשמצה, היה בו ממוצע 29!!!! הוראות לא ברורות, לא פרופורציונלי למצב של תחילת סמסטר, נוראי בכל קנה מידה. אנשים ישבו 24 שעות ביממה על התרגיל הזה ובסוף קיבלו 0 בגלל בדיקה לקויה, הוראות לא מובנות ותרגיל לא מובן בשום צורה, בסוף, אחרי אמצע הסמסטר כבר ולאחר 2 תרגילי בית נוספים סגל הקורס החליט להציע נוסחא לחישוב הציון שלא כוללת את התרגיל הזה (תרגילי הבית תקפים). אחר כך תרגילי הבית היו כבדים וארוכים אבל הרבה יותר מובנים וקשורים לחומר הקורס. מומלץ להתחיל אותם ביום שהם יוצאים.\n\nהמבחן: היה קשה יותר ממבחני עבר. במיוחד השאלה של פייתון שאמורה להיות הקלילה, הייתה די לא מובנת (המתרגל האחראי כתב אותה). תחזרו על הדברים הכי קטנים ותוודאו שהם נמצאים במיקום בולט בחומר הפתוח שלכם.\n\nהשורה התחתונה: הקורס הכי קשה שהיה לי עד עכשיו, חשוב לבחור פרטנר טוב לתרגילי הבית.", "timestamp": 1703419945023}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ---\nחוות דעת - הרצאות: לא ראיתי את ההרצאות, עברתי על המצגות. לי זה הספיק להבין את החומר.\n\nשם המתרגל/ת: אמיר \nחוות דעת - תרגולים: מתרגל ממש טוב! לא מעביר מצגת אלא ממש כותב איתנו את הקוד, מסביר טוב ועונה על כל השאלות. ממליצה מאוד!\n\nשעורי הבית: ארוכיםם. כדאי לשבת עליהם ישר כשמפרסמים אותם כי בסוף אפשר להיתקע עם הדיבוג וזה באסה. תרגיל בית 1 שהיה בסמסטר שלנו היה קשה ממש ולא נתנו לו מספיק זמן והוא היה לא ברור, אבל בסוף מצאו לזה פיתרון הוגן. שאר תרגילי הבית היו נחמדים ונהניתי לעשות אותם. חשוב לבחור שותף טוב!\n\nהמבחן: ארוך מייגע ודורש הרבה כתיבה. לפחות יש חומר פתוח שזה נחמד, זה עדיין לא מנע מהם לשים כמה שאלות על דברים שבקושי עברו עליהם בהרצאה ובתרגולים.\n\nהשורה התחתונה: החומר חשוב ורלוונטי, כדאי לתרגל כתיבה על דף לפני המבחן. אלעד היה אצלינו המתרגל האחראי וההתנהלות שלו והיחס שלו לסטודנטים היה גרוע, זה השאיר קצת טעם רע לקורס. חוץ ממנו שאר המתרגלים היו אחלה.", "timestamp": 1704922932709}, {"author": "ש", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה:  - \nחוות דעת - הרצאות: \nלא הלכתי, עברתי על השקופיות, ויש גם הרצאות מוקלטות לעדי ליאב שהיו גם טובות. הייתי מציע לנסות ללכת להרצאות ואם לא השתלם לכם אז לעבור למוקלט.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: אחלה מתרגל. אפשר להסתדר גם בקריאת המצגות.\n\nשעורי הבית:\n היו יותר מדי ארוכים ודורשים השקעה, במיוחד תרגיל בית 1 שהיה בעייתי מבחינת ניסוחים והנחיות, אבל עשו דרך חשיבת ציונים הוגנת בסוף. בעיקר תחזרו טוב על החומר לפני שתתחילו בתרגילים, ותתחילו בהם מיד אחרי פרסומם, *ותבחרו שותף טוב*. \n\nהמבחן: \nהיו קשים וקצת זוועתיים, אבל בעיקר אם מתכוננים טוב אפשר להשיג ציון טוב. עדיף לחזור על החומר טוב לפני המבחן אפילו הדברים הכי קטנים, ולתרגל על מבחני עבר כמב שאפשר, החומר פתוח אבל תוודאו שהוא מסודר ואם צריכים משהו אתם יכולים למצוא אותו.\nהשורה התחתונה: \nקורס חובה, לא קל בכלל, אבל אם משקיעים בו כמו שצריך יכול להיות נחמד קצת.", "timestamp": 1705075130814}, {"author": "הדיסטראקטור🤓", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: \nתברחו. דחוף. תעברו ליוסי או למוקלט. אין לי דרך לתאר לכם כמה זמן אני חוסך לכם עכשיו. \n\nשם המתרגל/ת: עדי חריף🌶️\nחוות דעת - תרגולים: \nמושלם, הבחור הציל לי את הקורס. כל כך כיף אצלו והוא יודע את החומר פיקס, ועונה על שאלות וממש אכפת לו מהסטודנטים שלו. יש קהוט כל סוף נושא, והוא מכין אחלה כדורי שוקולד!\n\nשעורי הבית: \nמעצבנים אחושלוקים. \nלוקחים המון זמן ותתכוננו לבכות הרבה.\n\nהשורה התחתונה: \nקורס כיף בטירוף אם ממש מתאמצים לראות את היופי בו.", "timestamp": 1713421299863}, {"author": "BBB", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יובל פלמוס\nחוות דעת - הרצאות: איטי, אבל בגדול בסדר\n\nשם המתרגל/ת: ברא אגבריה / עדי\nחוות דעת - תרגולים: שניהם טובים ומסבירים באופן טוב, נוכחתי בתרגול של ברא ולפעמים כשפספסתי ראיתי מוקלט של עדי, ברא בחור מאוד נחמד ומעביר את החומר בצורה כיפית מאוד, מכין מימז ומשלב אותם בשקופיות של התרגולים, הוא גם נותן אינטואיציה מעולה מדוע אנחנו צריכים את הנושא שאנחנו נלמד ואיך זה חשוב לחיים/תעשייה לפני כל נושא חדש, אם אתם בקטע של אינטואיציות יכול להיות מאוד נחמד, (אגב, לבחור יש מבטא טוב באופן מפתיע).\nהמתרגלים הסמסטר העבירו quiz (סוג של קהוט) בסופו של כל נושא, מי שניצח קיבל מירצ׳ פקולטי, בגדול היה ברור שאכפת להם שהסטודנטים יגיעו פרונטלית ויבינו את החומר.\n\nשעורי הבית:\nלדעתי הבעיה היחידה בקורס היא תרגילי הבית. הסמסטר פשוט לא אפשרו לנו הגשה חוזרת, וכל תרגיל היה שווה בערך 5% תקף מהציון הסופי שלכם, אם ההגשה לא התקמפלה בגלל שלא עברתם על איזה הנחיה טיפשית בתרגיל 0, או פשוט לא עברתם טסטים, הלך עליכם הציון, נכון שהם בגדול ממוחזרים עם שינויים קטנים, אבל זה לא משנה, יקח לכם קצת (הרבה) זמן להבין איך אני מתחיל.\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: \nאחלה קורס, אחלה סגל, אהבתי", "timestamp": 1713539667354}, {"author": "almog levi", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nסבבה , יש נקודות חשובות שמופיעות במבחן אבל גם הרבה דברים לא משמעותיים , ממליץ שברגע שנתקלים במשהו סינטקס או עקרון חשוב להבין אותו ולסמן אותו להכנה לקראת המבחן. \n\nשם המתרגל/ת:  בראא אגבריה \nחוות דעת - תרגולים: מושלמים והחלק הכי חשוב בקורס ! \nבראא אחלה מתרגל וקל לראות שהוא חזק מאוד בנושאים המועברים בקורס , מעביר את החומר בצורה ברורה , נותן הרבה מקום לשאלות ומסביר לעומק עד שכולם מבינים, בנוסף נותן דגשים על הנושאים החשובים לשיעורי בית ולמבחן. האווירה בתרגולים טובה וכיפית. \n\nשעורי הבית: רמה בינונית , צריך להיות מאוד ערניים למקרי קצה ולהנחיות שמקבלים מהמתרגלים , חשוב להתחיל את התרגיל מוקדם כי יש הרבה דקויות שצריך לבדוק ולהריץ , בבקשה שימו לב לניהול זיכרון ! ראיתי הרבה סטודנטים שנפלו כי לא בדקו! \n\nהמבחן: מהמבחנים האחרונים ברור שהקורס עובר שינוי לטובה וזה בזכות צוות הקורס והמתרגלים שעובדים קשה שלסטודנטים יהיה כמה שיותר ברור ונוח , בסמסטר שלי המבחן היה קצת ארוך אבל סה\"כ פייר בעייני. ממליץ להתכונן הרבה לפני ולהסתכל על הרבה תרגילים כדי להבין את הסגנון והדרישות וכמובן להקשיב לדגשים של המתרגלים לפני המבחן. \n\nהשורה התחתונה:  קורס שעבר שינוי לטובה אבל עדיין מאתגר ויש להישאר על החומר ועבודות בין במשך הסמסטר , דורש השקעה.", "timestamp": 1714762574470}, {"author": "אליהו", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: \nיוסי רץ מהר מאוד על החומר. בהרצאה שנייה סיימנו את המצגת הרביעית.\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: \nמתרגל מצוין. בן אדם נחמד, יודע את החומר ויודע להעביר אותו.\nלדעתי יש קצת יותר מדי קהוטים, אבל לא נורא.\nשעורי הבית: \nעם שותף טוב וידע קודם הם די סבירים. ההוראות היו ברורות, היה מענה טוב בפיאצה. יש שבועיים לכל הגשה, וזה אמור להספיק.\nהמבחן: \nהיה קצת קשה יותר משנים קודמות. יש חומר פתוח ללא הגבלה. סך הכל המבחנים די חזרתיים - הצלחת את הראשונים, תצליח את האחרונים.\nהחיסרון הוא שהקורס השתנה לפני שנתיים אז אין הרבה מבחנים לתרגל מהם. היתרון הוא שהקורס השתנה ועכשיו הוא הרבה יותר כיפי - בלי C ובלי Bash. לגמרי שווה את זה.\nהשורה התחתונה: \nעם קצת רקע קודם הקורס קליל. בלעדיו הוא קצת יותר מאתגר. השיעורים לוקחים הרבה זמן והם הרבה יותר גדולים משאלות במבחנים.", "timestamp": 1715184381396}, {"author": "אורי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: הקלטות של יוסי\nחוות דעת - הרצאות: יוסי מסביר טוב וברור אבל מדבר קצת לאט, ממליץ לראות בx1.75.\n\nשם המתרגל/ת: עדי חריף (המלך)\nחוות דעת - תרגולים: עדי מתרגל נהדר, מאפשר לשאול שאלות ומסביר מעולה. יש חידונים (עם פרס) בסוף כל נושא והוא מכין אחלה כדורי שוקולד. \n\nשעורי הבית: סבירים אבל די נחמדים. מומלץ לא לעשות באמצע הלילה כי אחרת עושים שטויות וצריך לדאבג שעות... תרגילים 3 ו-4 לוקחים הרבה זמן, מומלץ להתחיל מוקדם.\n\nהמבחן: הוגן ודומה מאוד לחומר הקורס. תרגילי הבית מאוד עוזרים (המבחן הסמסטר קצת מתחכם אבל בסך הכל פייר).\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1715330248776}, {"author": "shared_ptr", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: קראתי מהשקופיות\nחוות דעת - הרצאות: רע מאוד תראו מוקלט עדיף או תלכו להרצאות. \n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: אגדה אין עליו, אכפתי ודואג שכולם יבינו את החומר. תמיד יש רוח טובה איתו בכיתה באמת תותח!\n\nשעורי הבית: למי שאין לו נסיון, תתכוננו שיהיה כבד וארוך ומלא דיבוג(ספציפית תרגילי בית 1+3+4), למי יש רקע בתכנות מאוד קל, לוקח 4-5 שעות לסיום הרטוב לא ממש קשה:)\n\nהמבחן: היה סביר, שאלה 2 הייתה קצת שונה אבל בסדר.\n\nהשורה התחתונה: קורס משעמם רצח מלמד סינטקס וקונבציות  לא יותר. למי שירגיש שקשה לו בקורס הזה תקופה ועוברת תצברו הרבה נסיון בשפה אז לא להיות בלחץ.", "timestamp": 1715534771458}, {"author": "unique_ptr", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: פשוט תחסכו לעצמכם זמן ותראו מוקלט\n\nשם המתרגל/ת: בראא אגבאריה \nחוות דעת - תרגולים: בראא הוא אחד המתרגלים הכי טובים שעברו עלי בתואר, בן אדם כריזמטי, מעביר את התרגול בצורה מסודרת, ודואג לענות על כל השאלות של הסטודנטים!, והוא רק בן 22!!, ניתן לראות בקלי קלות כמה הוא יודע וחזק בחומר וכמה זה מעניין אותו, ולכן ממש מרתק גם ללמוד ממנו!, ואולי הדבר כי חשוב, הוא באמת דואג שנדע את החומר וממש מדגיש על הדברים החשובים בקורס!. \nהשעתיים הכי כיפיות במהלך השבוע, לגמרי ממליצה 3>\n\nשעורי הבית: \n5 רטובים שלוקחים זמן, לא קלים במיוחד אך גם לא בלתי אפשריים, מאוד עוזרים להבנת החומר כך שאם תפתרו לבד לא תבזבזו את זמן המבחן שלכם על דפדוף בחומר הפתוח, אתם תדעו לכתוב קוד בשפה בלי לחשוב על סינטקס בזמן מבחן, כמו שעשיתם במבוא נגיד. \n\nהמבחן: לדעתי המבחן שלנו לא היה מתוחכם במיוחד. המבחנים הם לרוב תבניתיים, צריכים להיות חדים על החומר ולא לבזבז זמן עם החומר הפתוח שיש לכם בבחינה.\n\nהשורה התחתונה: אחלה קורס, אני לא אשקר, ממש היה לי כיף בגלל בראא.", "timestamp": 1715547916154}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: הקלטות של גל ללוש ואתר בשם refactoring guru\nחוות דעת - הרצאות: זה כמו לראות מירוץ פורמולה 1. מהירות 1x זה עדיין מהיר מספיק כדי לאבד אותו\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: \nאין אחר מלבדו. איש חריף\n\nשעורי הבית: \nשטן.\n\nהמבחן: \nקשוח. תכנות בדף ועט זה לא סימפטי. שווה אולי להביא עט מחיק (?)\n\nהשורה התחתונה: \nקורס חובה. קורס חשוב שהציון בו חשוב. יש נושאים מעניינים אבל מרגיש שרוב הקורס משחקים בקקי של השפה והקומפיילר", "timestamp": 1715753553991}, {"author": "segmentation fault", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דר. ויינשטיין יוסף מוקלט\nחוות דעת - הרצאות: \nיש לי רקע אז ראיתי מוקלט על x2, יוסי סה\"כ מרצה טוב. הלכתי להרצאות שלו גם במבוא למדמ\"ח. מומלץ.\n\nשם המתרגל/ת: דניאל נור מוקלט\nחוות דעת - תרגולים: \nגם ראיתי מוקלט על x2. מתרגל טוב, ממליץ עליו.\n\nשעורי הבית: \n6 תרגילי בית (כולל ת\"ב 0), תרגילים תכנותיים ברובם. עוזרים להבנה של החומר. ממליץ מאוד לכתוב טסטים משלכם למרות שיש בגיט את הטסטרים עם מאות טסטים, כי הם לא בודקים את כל מקרי הקצה. גם ממליץ לא לדלג על בדיקת דליפות זיכרון, עלה לי כמה נקודות טובות בציון. הייתה גם תחרות מימז והמנצחים קיבלו 5 נקודות לתרגיל בית שזו הייתה תוספת חמודה.\n\nהמבחן: \nלמי שיש רקע בcpp ו-python אין מה לדאוג, כל המבחן על כתיבת קוד טוב בשפות האלו ואולי כמה סעיפים על design patterns. למי שאין רקע אני מאחל בהצלחה, במיוחד בpython שבקושי עוברים עליו והוא רבע מהמבחן. המבחן גם עם חומר פתוח, אפשר אפילו להביא ספר על cpp אם בא לכם. תעשו מבחני עבר ויהיה בסדר.\n\nהשורה התחתונה: \nקורס קשה למי שאין רקע וקל למי שיש, בכל מקרה מלמדים דברים חשובים מאוד בכתיבת קוד נכון, תכנות מונחה עצמים, ומתעמקים בcpp. סגל טוב, ואפילו יש כמה מימ לורדים בינהם וזה משתקף במבחן בשאלות יצירתיות על קבוצת המימז או על אוואטאר. עונים על השאלות בפיאצה בקצת טוב.", "timestamp": 1715759746107}, {"author": "עיד", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  מוקלט - ליאב עדי\nחוות דעת - הרצאות: באופן יחסי בסדר, לדעתי איטי מידי ולא תמיד הכי ברור אבל פער יותר טוב מהפרונטלי, ניסיתי ללכת להרצאות אבל המרצים מתחת לכל ביקורת, למי שלא יצא לתכנת הרבה בCPP לפני הקורס ממש קשה ללמוד לתכנת עם מצגות גם אם המרצים היו טובים אבל באמת שהמרצים על הפנים מה שמחייב לראות את המוקלט. \n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: מתרגל מעולה אבל יותר מהכל הוא מתרגל אחראי מהטובים שהיו לי, אם לא הטוב שבהם. במהלך הקורס יש סדנאות לעזרה עם השיעורי בית (הידועים לשמצה) ועדי דאג להישאר לפעמים אפילו 3 שעות אחרי הזמן של הסדנה על חשבון הזמן הפנוי שלו כדי שכולם יקבלו מענה. \n\nשעורי הבית: \nעמוסים בטירוף כמו שכבר אמרו שותף טוב זה חובה, לדעתי אחד הקורסים היחידים שעשיתי עד עכשיו שמצדיקים עמוס כזה בשיעורי בית כי זו הדרך היחידה ללמוד את החומר של הקורס. \nהמבחן: \nמהקשים שעשיתי, לא רק בגלל החומר אלא בעיקר כי אין זמן לסיים את המבחן. יש מלא טעויות במבחן (לא כלכך ברור למה זה קורה כל סמסטר מחדש) ואז צריך לעשות תיקונים ולא נותנים הארכה ובלי קשר מבחן סופר קצר בזמן.  במועד שלנו יובל שהוא המרצה האחראי החליט להתחכם בצורה הזויה ונתן תרגיל שדרש מלא הבהרות תוך כדי מה שעוד יותר גרם לא להספיק. \nהשורה התחתונה: \nקורס קשה ועמוס ממש למי שלא תכנת בCPP לפני אבל מצד שני לדעתי ממש מעניין. ממש חשוב שהמתרגל האחראי יהיה טוב אחרת הקשה הופך לקשה מאוד.", "timestamp": 1715784844789}, {"author": "גלעד", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: \nיובל מקריא את המצגות. לא ראיתי ערך מוסף להיכנס להרצאות. \nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: \nעדי מצויין. חייבים להיכנס לתרגולים (או ללמוד את המצגות שלהם) כי זה חומר שונה מההרצאות. (גם ההרצאות זה חומר שונה מהתרגולים)\nשעורי הבית: \n6 מטלות רטובות, רובן בזוגות. לוקח את הזמן שלו. הבדיקה של החלקים הרטובים היא נטו טסטים, ובהצלחה להבין למה הטסט לא עבר לכם כי הם לא מסבירים יותר מדי. \nהמבחן: \nעל הפנים. ירידה לפרטים מעצבנת. אבל חומר פתוח שזה לפחות משהו. כדאי להביא הרבה פתרונות עבר כדי להעתיק כמה שיותר מדויק את הרעיונות. \nהשורה התחתונה: \nקורס עמוס. מתרגלים מצוינים, מרצים פחות… כנראה אין לכם ברירה אז זה לא מאוד משנה", "timestamp": 1715846678538}, {"author": "g", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גל ללוש מוקלט + קריאת מצגות עדכניות \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: בראא אג׳באריה\nחוות דעת - תרגולים: \nבראא מתרגל מעולה!! ומסביר החומר בצורה מאוד ברורה  וגם עונה על כל השאלות בתרגול ומוכן להסביר שוב ושוב והקצב שלו טוב מאוד, ובנוסף לזה הוא תמיד היה שואל אותנו שאלות קטנות ועמוקות שבודקות הבנה. \nהטיפים שהיה נותן בתרגול היו עוזרים הרבה בתרגילי בית.\nשעורי הבית: \nלא קשים(אין חשיבה) אבל ארוכות ודורשות הרבה זמן והכי חשוב לתכנן הכל לפני שמתחילים כי אחרת תבזבזו הרבה זמן בעבודה על דיבוג. \nהמבחן: \nמועד א׳ היה מאוד הוגן.", "timestamp": 1716056902768}, {"author": "const student", "difficultyRank": 5, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוסי\nחוות דעת - הרצאות: \nהוא מרצה טוב ויודע להסביר את החומר אבל יש לו יחסי אנוש מפוקפקים. אפשר להסתפק בקריאת השקפים של ההרצאות לדעתי, ואם משהו לא מובן אז לעבור למוקלט.\n\nשם המתרגל/ת: עדי חריף \nחוות דעת - תרגולים: \nבן אדם מאוד נחמד, מסביר את החומר כמו שצריך, ואשף בהכנת כדורי שוקולד :). לדעתי אפשר לוותר על ההרצאות הפרונטליות ולעבור להקלטות או קריאה של שקפי התרגולים אם זה יותר נוח.\n\nשעורי הבית: \nארוכים ועמוסים עד מאוד עם הוראות שלא ממש ברורות תמיד. חשוב להתשמש בפיאצה בשביל כל ההבהרות. סגל הקורס עונה תמיד. וגם חשוב לבחור שותף טוב, אחרת תיאלצו לעשות את כל התרגילים בעצמכם וחבל.\n\nהמבחן: \nהיה הרבה יותר טוב מהסמסטר הקודם, חשוב לפתור הרבה מבחנים כדי להבין את הרעיונות שחוזרים על עצמם. בנוסף גם חשוב להקפיד על עקרונות התכנות של הקורס שכן במבחן לא כתובה במפורש כל הוראה והוראה אז צריך להתאמן על זה.\n\nהשורה התחתונה: \nקורס חשוב מאוד ולא לזלזל בו :)", "timestamp": 1716556594321}, {"author": "null", "difficultyRank": 3, "generalRank": 3, "semester": "202302", "text": "שם המרצה: \nחוות דעת - הרצאות: \nרואה מוקלט\n\nשם המתרגל/ת: דניאל אלגריסי\nחוות דעת - תרגולים: \nתרגולים ממש טובים (עד כה) ומקצועיים. עונה לעומק על שאלות של הסטודנטים ונותן תחושה טובה במהלך התרגול. הוא תמיד נשאר אחרי השיעור לענות על שאלות נוספות במידה ויש. \n\nשעורי הבית: \nלצערי אני חוזר על הקורס (שיפור ציון) והשיעורי הבית היו לי דיי סבבה, הם כן יכולים להעמיס במהלך הסמסטר אבל הם לא בלתי פתירים כמו הרבה שיעורי בית בקורסים אחרים בפקולטה הזאת.\n\nהמבחן: \nצריך להתעמק בדקויות של התרגולים וההרצאות, בסך הכל הוגן.\n\nהשורה התחתונה: אני התחברתי (:", "timestamp": 1717703290773}, {"author": "מועד ב", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ליאב עדי (מוקלט)\nחוות דעת - הרצאות: סבבה, הוא וגל ללוש במוקלט עדיפים לדעתי על האחרים, בכל מקרה לא מבינים כמעט כלום עד התרגילי בית.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: אלוף העולם , משקיע תתפללו שהוא המתרגל אחראי כי בניגוד לקורסים אחרים זה משפיע על ההתנהלות ועדי מלך.\n\nשעורי הבית: \nקשים, ארוכים אבל בלעדייהם אם לא יצא לכם לתכנת הרבה לפני פשוט לא תבינו כלום. סה\"כ אפילו שהיה עמוס מאוד נהנתי מהם והרגשתי שלמדתי והבנתי באמת את החומר רק תוך כדי שפתרנו אותם.\nהמבחן: קשה,  המבנה אמנם חוזר על עצמו אבל ממש קצר בזמן אז אסור להיתקע יותר מכמה דקות על כל סעיף. צריך לתרגל כמה שמספיקים והכי חשוב לדעת design patterns טוב כולל מימוש (גם כאלה שנראים לכם שלא ישאלו בחיים כמו singleton כי אצלנו פעמיים הפתיעו עם כאלה). המלצה אחרונה - אם יש שעות קבלה של רגב במהלך הסמסטר לכו אליהן, רגב מסביר מעולה ויודע את החומר ברמה ממש גבוה ככה שהרגשתי שכשהלכתי הוא ידע תמיד לענות על הפערים שהיו לי בחומר. הלכתי לשתי שעות קבלה שהוא עשה לפני המבחן והוא הציל לי את המבחן.\n\nהשורה התחתונה:", "timestamp": 1719003701905}]}