{"posts": [{"author": "מסיים סמסטר 3", "semester": "201802", "text": "מפני שזה קורס חדש כן הייתי ממליץ ללכת להרצאות ולתרגולים. המרצה סמסטר הבא היא תותחית אמיתית (קרן) וממה שיצא לי לראות המתרגלים בקורס ממש אחלה. בכל אופן הסמסטר הרבה העלו סיכומי הרצאות ותרגולים לקבוצה בפייסבוק, אבל בכל זאת אני חושב שזה קורס שמאוד כדאי להיות בהרצאות והתרגולים הפרונטליים", "timestamp": 1564946918000}, {"author": "SR", "difficultyRank": 3, "generalRank": 3, "semester": "201802", "text": "שם המרצה: ארנה גרימברג\nחוות דעת - הרצאות: ההרצאות היו קצת מבולגנות לפעמים\n\nשם המתרגל/ת: גלי שפי\nחוות דעת - תרגולים: גלי מתרגלת מעולה, ממליץ מאוד!\n\nשעורי הבית: יש גיליון אחת לשבועיים, והוא די ארוך. הוא מכיל שאלות ממבחנים, ולכן הוא מכין בצורה מעולה. מומלץ מאוד לפתור לבד, ובמידת הצורך להיעזר ברפרנסים ולוודא שמבינים את הפתרון.\n\nהמבחן: המבחן לא היה קשה, אבל סגל הקורס עשה קטע די נבזי שהוא בדק את כל המבחנים מחדש כדי להוריד בכוונה את ממוצע הקורס.\n\nהשורה התחתונה: קורס לא הכי מעניין לדעתי וגם לא הכי קל, אבל אחרי תרגול של מספיק מבחנים הוא ממש חוזר על עצמו.", "timestamp": 1597748742453}, {"author": "מיכאל", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: הוא לא הרצה בעצמו בגלל הקורונה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ארוכים אך חשובים למבחן\n\nהמבחן: תבניתי, צריך לפתור מלא מבחנים\n\nהשורה התחתונה: אין", "timestamp": 1597759321825}, {"author": "E.T.", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "הקורס לא קשה מדי.\nהמבחנים דיי חוזרים על עצמם מבחינת המבנה.\nוהחומר עצמו לא מסובך מדי אם מנסים באמת להבין.\nממליץ לסיים את החומר בשבוע הראשון של הסמסטר כדי להקל על העומס במהלך הסמסטר.", "timestamp": 1598337842855}, {"author": "aa", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: קרן\nחוות דעת - הרצאות: קרן מרצה מעולה - רוב הסמסטר למדנו מוידאו שהקליטה לפני השיעור (באורך של שעה בערך), ואז עוד שעה של למידה פעילה. מסבירה מאוד ברור, ולי הלמידה פעילה עזרה לחדד ולסגור כל מיני פינות.\n\nשם המתרגל/ת: רון\nחוות דעת - תרגולים: רון אחלה מתרגל - מסביר ממש טוב וברור, ומאוד עזר בשעות קבלה להבין תרגילי בית.\n\nשעורי הבית: 5 גיליונות, על כל גיליון בציון מעל 75 מקבלים נקודה בונוס (אם עוברים את המבחן). לא פשוטים והרוב לא ממוחזר, אבל עוזרים להבנה.\n\nהמבחן: מזעזע. בגלל הקורונה היה מקוון, אז קוצר לשעה וחצי. השאלות כלל לא התאימו לאורך, והיה דרוש עוד זמן (או פחות שאלות).\n\nהשורה התחתונה: אם זה לא קורס חובה, ולא ממש נהניתם ממתק\"א, לא מומלץ.", "timestamp": 1613407517582}, {"author": "מבין עניין", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: \nאחלה של מרצה, מסבירה הכל בבירור. שייכת למשפחת צנזור אז לא מפתיע.\n\nשם המתרגל/ת: גלי שפי\nחוות דעת - תרגולים: \nמתרגלת טובה, תמיד מציינת מה צריך לדעת למבחן ועל מה אפשר לוותר. היא כותבת קצת מהר בזום ככה שקשה בו זמנית להעתיק ולהקשיב, אבל סה\"כ היא מסבירה טוב.\n\nשעורי הבית: \nהשיעורי בית ברמה של שאלות מבחן ואפילו יותר, כל סעיף בדרך כלל לוקח עמוד שלם. מזכיר קצת את מתק\"א אבל על סטרואידים.\n\nהמבחן: \nאמנם השאלות במבחן פתירות, אבל הבעיה היא שאין זמן לחשוב. בדרך כלל יש שעתיים וחצי למבחן, אבל משום מה החליטו לקצר את המבחן הסמסטר לשעה וחצי ועוד להכניס סעיפי הוכח\\הפרך + הגדרות חדשות... קיצר ממוצע 57 לפני הפקטור המיסתורי שהם נתנו.\n\nהשורה התחתונה: \nמתק\"א על סטרואידים. אם הלך לכם טוב במתק\"א ילך לכם טוב בקורס.", "timestamp": 1613468938326}, {"author": "Elad Kay", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: קרן צנזור־הלל\nחוות דעת - הרצאות: מרצה טובה, הרצאות ברורות, הרבה דוגמות. ברמה האקדמית אין לי תלונות.\n\nשם המתרגל/ת: אדר אמיר\nחוות דעת - תרגולים: מתרגל סביר\n\nשעורי הבית: 5 גיליונות לא חובה, לא סופר קשים אבל חשובים מאוד \n\nהמבחן: המבחן היה בלי הלימה לכמות הזמן שניתנה לו.\n\nהשורה התחתונה: קורס מופשט, לא לכולם", "timestamp": 1614858663591}, {"author": "kilek", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: משעממים\n\nהמבחן: מעצבן מאוד. במקום שיהיה מבחן בזמן סביר בגלל הקורונה החליטו לעשות מבחן של שעה וחצי. לטעמי חוסר אמון בסטודנטים עם נגיעות של \" לא אכפת לי שהמבחן לא בודק ידע אל עבודה תחת לחץ \"\n\nהשורה התחתונה: יש אנשים שיהיה להם קל מאוד כי החומר לא קשה ויש כאלו שיסבלו ממבחן קצר מדי. אם אתם לא טובים תחת לחץ וזה לא קורס חובה לא הייתי לוקח.", "timestamp": 1615654075652}, {"author": "asma", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: מסבירה טוב\n\nשם המתרגל/ת: גלי שפי\nחוות דעת - תרגולים: מסבירה את החומר בצורה ברורה ישר לעניין ומדגישה על החומר החשוב למבחן\n\nשעורי הבית: ארוכים ומשעממים\n\nהמבחן: סיוט!!!!!!!!!!! הביאו את מועד ב מגהינום ללא הגזמה והיה משהו בלתי פתיר בשעה וחצי\n\nהשורה התחתונה: קורס משעמם לדעתי לא מענייןאם לא חובה אל תקחו:,)", "timestamp": 1615883976848}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: קרן הלל צנצור\nחוות דעת - הרצאות:  מדהים, מרצה מ ע ו ל ה!\n\nשם המתרגל/ת: גלי שפי \nחוות דעת - תרגולים: מאוד מומלצת, סופר מקצועית\n\nשעורי הבית: במהלך הסמסטר לא פתרתי, הרמה באמת גבוהה מאוד, רמת מבחן אז עוזר לתרגול\n\nהמבחן: מומלץ לחזור על הרצאות ותרגולים (וידאו) לפני המבחן, שווה כל דקה! ורק אחר כך לפתור מבחנים\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1616406997736}, {"author": "Bob Bobinson", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: ראיתי בהקלטות מכיוון שיקיר לא העביר הרצאות פרונטליות רגילות. קרן מרצה טובה. היא מעבירה את החומר באופן מאוד מסודר, ומורידה מההקלטת דברים שלוקחים זמן כמו מחיקות לוח, מה שמוריד את זמן ההרצאות לשעה בלבד.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: אסף מתרגל מעולה. הוא נותן תמיד זמן לחשוב על התרגילים ושואל את התלמידים, ואחר כך פותר בצורה פורמלית ומלאה, מה שמאוד חשוב בקורס הזה שכולו על פורמליות. אך כמו כל שאר סגל הקורס, הוא לא מפרסם פתרונות רשמיים לתרגולים, מה שמאוד מבאס.\n\nשעורי הבית: שיעורי הבית ארוכים מאוד, בעיקר כי כל התרגילים בקורס דורשים המון כתיבה. גם הבדיקה מאוד קפדנית, ויכולים להוריד עשרות נקודות בקלות. יש ארבעה גיליונות בסמסטר, שלכל אחד נותנים בדרך כלל שלושה שבועות ושווה נקודת בונוס אחת. לבסוף, הסמסטר לפחות בדקו רק שאלה אחת (למרות שאמרו מראש שייבדקו את כולן), מה שהפך את הניקוד לאפילו יותר תלוי מזל. לא היו פתרונות רשמיים לגיליונות הבית הסמסטר.\n\nהמבחן: המבחן די נוראי, והסמסטר היה קשה במיוחד. החלק הכי חשוב בלמידה הוא להתרגל לרשום מהר והמון, כי פתרונות של מבחן בלוגיקה נוטים להיות מספר עמודים. גם אין בשום מקום פתרונות רשמיים (הסגל ככל הנראה לא רוצה שתדעו איך פתרונות פורמליים נראים בקורס על פורמליות), מה שעוד יותר מקשה על הלמידה. יקיר גם שינה את שתי ההרצאות האחרונות עם חומר חדש, רק כדי להודיע בסוף שהוא לא נכלל במבחן.\n\nהשורה התחתונה: הקורס מעניין יחסית, ויכל אפילו להיות נחמד, אבל הסגל ממש לא מתחשב בתלמידים - ממרצה שלא מרצה, ל\"אי הבנות\" בשיעורי הבית והסילבוס ודגש יתר על פורמליות יחד עם סירוב מוחלט לפרסם פתרונות רשמיים לכל דבר בערך - מה שמאוד מוריד מהחוויה של הקורס.", "timestamp": 1626625278527}, {"author": "....", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: מוקלט של קרן\nחוות דעת - הרצאות: קרן מעוווווולה !!!\n\nשם המתרגל/ת: גלי שפי\nחוות דעת - תרגולים: אחלה של מתרגלת\n\nשעורי הבית: סבירים ממש ויש רפרנס לרובם\n\nהמבחן: הוגן אבל מאוד ארוך\n\nהשורה התחתונה:", "timestamp": 1627490915265}, {"author": "YT", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: קרן הלל צנזור\nחוות דעת - הרצאות: ההרצאות המחייבות הסמסטר אצלנו היו הרצאות מוקלטות של קרן מסמסטר חורף 2021, מרצה חמודה מאד. הרצאות קצרות, תמציתיות ולעניין. לא צריך יותר מזה.\n\nשם המתרגל/ת: גלי שפי\n\nחוות דעת - תרגולים: \nחלק הייתי בלייב של הסמסטר וחלק מוקלטים מסמסטר חורף 2021, החומר היה זהה אחד לאחד. מתרגלת טובה שיודעת ומסבירה את החומר טוב אבל לא הכי נחמדה ומרגיש שהיא מזלזלת בסטודנטים.\n\nשעורי הבית: \n4 גיליונות שכל אחד נותן בונוס נקודה לציון הסופי שזה שווה מאד. גיליונות מייגעים,ארוכים וקשים מאד אבל מזל שיש רק 4. לרוב השאלות אני לא הרגשתי שקיבלנו מספיק כלים מהתרגול כדי לפתור אותן. ממליץ להיעזר ברפרנסים ולהבין אותם טוב. חלק מהשאלות ממוחזרות וחלק ממבחנים עם שינוי נתונים.\n\nהמבחן: \nהרמה של המבחנים בקורס מאז סמסטר אביב 20 עלתה בכמה רמות. מבחנים קשים אשר דורשים הבנה מאד עמוקה של החומר והכרת טריקים רבים. ממליץ לתרגל הרבה מבחנים ולשים דגש על המבחנים מהסמסטרים האחרונים בעיקר. מבחנים מלוגיקה ותורת הקבוצות רלוונטיים כחימום בלבד.\nלנו היה גם כן מבחן קשה מאד וארוך אבל מי שלמד אליו כמו שצריך יכל להוציא ציון מעולה וסך הכל הוא היה הוגן.\n\nהשורה התחתונה: \nאני לא נהנתי מהקורס בכלל ולא התחברתי לחומר הזה אבל זה קורס חובה אז אין מה לעשות. במהלך הסמסטר הוא בקושי לוקח זמן. פוטנציאל לציון גבוה אם לומדים למבחן כמו שצריך.", "timestamp": 1627741569222}, {"author": "עידו", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה: Yakir Vizel\nחוות דעת - הרצאות:  מוקלט של קרן צנזור עובר על כל החומר עבד מאולה\n\nשם המתרגל/ת: Asaf Yeshurun\n\nחוות דעת - תרגולים: ברור יאיל ועונה על שאלות\n\nשעורי הבית: לא יותר מדי זמן\n\nהמבחן: קצת קשה ובעיקר בדיקה קשוחה מאוד.\n\nהשורה התחתונה: קורס קצת מציק אבל לא עמוס", "timestamp": 1635017248111}, {"author": ".", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: Dr. Yakir Vizel\n\nחוות דעת - הרצאות:  לא נוכחתי בהרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא נוכחתי בתרגולים\n\nשעורי הבית: \n\nהמבחן: נוראי!!!!!! \nלמרות שלא נוכחתי בהרצאות ובתרגולים (אני לקראת הסוף בתואר וקל לי יותר ללמוד לבד את הכל) למדתי את הכל ממש טוב ! הקורס לא עמוס בכלל!! מאוד מעניין ומאוד נהניתי ממנו !! אבל מועד ב היה בלתי פתיר !!!! ניגשתי אליו כדי לשפר ציון ! בסוף קיבלתי 55 אחרי פקטור של 20 נקודות!!  \nעם פקטור כזה ממוצע מועד ב היה 59 :) לפני פקטור היה 42.\nקצת על מועד ב: שאלה ראשונה 6 סעיפי הוכח הפרך שלא קלים בכלל . \nשאלה שנייה פתירה אבל לוקחת המון זמן כי גם היתה שונה בקצת משאר המבחנים הקודמים\nשאלה שלישית בלתי פתירה בלחץ הזמן ! לוקח המון זמן להבין אותה .\n\nהשורה התחתונה: \nאחד הקורסים המעניינים ! אבל סגל נוראי ברמות !\nלדעתי מטרת מועד ב היתה להכשיל את כולם !", "timestamp": 1635074487697}, {"author": "Ms", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שעורי הבית: הפתרונות דיי ארוכים, יכול לקחת הרבה מאוד זמן לפתור ובעיקר לפרמל. \n\nהמבחן: קשה לעמוד בזמנים.\n\nהשורה התחתונה: קורס סבבה, מבחן קשה", "timestamp": 1641203621745}, {"author": "420/69", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: מתכונת של כיתה הפוכה-המוקלט מעולה.\n\nשם המתרגל/ת: וסים\nחוות דעת - תרגולים: מסביר באופן ברור ואט לאט.\n\nשעורי הבית: 5 תרגילי בית, כמעט לכל יש רפרנס, עלול לקחת הרבה זמן לכתוב את הפתרון באופן מסודר ומפורמל.\n\nהמבחן: הוגן, ממוצע כמו שנים קודמות, סמסטר ראשון שבו החומר החדש בסוף הקורס נכנס בחומר למבחן והיתה על זה שאלה במבחן של 20 נקודות והשאלות (עם שינוי קטן) הופיעו בתרגיל בית שלא היה להגשה.\n\nהשורה התחתונה: קורס חובה אין מה לעשות, אפשר להנות ממנו אם עוקבים אחרי החומר במהלך הסמסטר ולהוציא ציון מצוין.", "timestamp": 1645986974601}, {"author": "verka", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: קרן \nחוות דעת - הרצאות: \nמתכונת של כיתה הפוכה. לא אהבתי בכלל. מרגיש לי כאילו המרצה אינה מתאמצת ללמד את החומר שהיא אמורה ללמד ובמקום זה עושה הקלטה של שעה שבה היא רק אומרת את החומר בלי להסביר יותר מדי. \n\nשם המתרגל/ת: גלי \nחוות דעת - תרגולים: יש סיכום בדרייב. הוא אחלה. \n\nהשורה התחתונה: חובה. אין כל-כך מה לעשות.", "timestamp": 1646765340677}, {"author": "תלמידה", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: מסבירה את החומר בצורה ברורה. ההקלטות שלה מאוד נוחות ומקצרות את זמן ההרצאה.\nממליצה ללכת ללימידה הפעילה - בעיקר חזרה על הגדרות (יש הרבה הגדרות בקורס ודרכי פתרון שצריך לזכור -עוזר לחזור על זה כמה שיותר) וגם דגשים שעוזרים בפתירת שיעורי הבית. אם לא הולכים - שווה לעבור על סיכום של הכיתות ההפוכות.\n\nשם המתרגל/ת: ווסים מח'ול\nחוות דעת - תרגולים: אחלה מתרגל, מסביר את החומר בצורה ברורה, עונה על שאלות בצורה ברורה ומכבדת ונותן דוגמות טובות להבנת החומר.\n\nשעורי הבית: ארוכים, בהחלט פתירים בעזרת שעות קבלה, שווה ללכת לשעות קבלה שמסבירים הכל בצורה מובנת. בעיקר אצל ווסים, גלי וגל.\n\nהמבחן: מבחן קשה, חשוב ללמוד לפחות 5 ימים ולפתור הרבה מבחנים.\n\nהשורה התחתונה: קורס לא פשוט מבחינת המבחן, עם שיעורי בית פתירים אך ארוכים, החומר מעניין למי שאוהב את תורת הקבוצות.", "timestamp": 1648044298355}, {"author": "ע.ר", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: קרן הלל צנזור\nחוות דעת - הרצאות: המוקלטות שלה לגמרי סוגרות את הפינה, דוגלת במתכונת של כיתה הפוכה שנשמע שלא הייתה חיונית ממש.\n\nשם המתרגל/ת: וסים מחול\nחוות דעת - תרגולים: מתרגל טוב\n\nשעורי הבית: לוקחים זמן אבל השיעורים הם ברמת מבחן, אם הצלחתם אותם בלי לרפרנב מצבכם מעולה\n\nהמבחן: לצערי נבצר ממני מלהבחן במועד א' עקב קורונה, מחויותי מהמועד ב אנסה לנפץ את האשליה שאתם אשכרה מגיעים למבחן שבודק את היכולות שלכם ושיש לכם סיכוי להוציא בו ציון מספק. היה ברור לכל הדעות שהמבחן היה ארוך בהרבה ממסגרת הזמן שהוקצתה לו, כמובן שהסגל לא התחשב בזה תוך כדי מבחן וכשפורסמו הציונים (בספק אם תפורסם לכם היסטוגרמה של המועד הנורא הזה) התגלה לא במפתיע כי הממוצע הוא 57 וש(כנראה) לא ניתן שום פקטור. הסגל הזה שובר שיאים ביחס שלו אל הזמן שהסטודנטים משקיעים ללימוד למבחן ונראה שהם הפכו את המועד ב לכלי להורדת ממוצע נטו. לכן, אם הגעתם למצב שבו אתם צריכים מועד ב אצל קרן הייתי ממליץ לעשות את הקורס בסמסטר אחר.\n\nהשורה התחתונה: מבחינת החומר לקורס יש המון פוטנציאל והוא פותח את הראש, חבל שלסגל לא אכפת אם תלמדו ותדעו את החומר הזה אלא רק מהכבוד שהם יקבלו על כך שהם אמללו סטודנטים והורידו ממוצע.", "timestamp": 1648103369967}, {"author": "סטודנט אומלל", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות:  קרן הקלטות, אחלה.\n\nשם המתרגל/ת: ווסים\nחוות דעת - תרגולים: מעביר הכי משעמם בעולם, אבל זה או הוא או גלי שלא מחייכת אף פעם.\n\nשעורי הבית: לרפרפנס.\n\nהמבחן:  באמת שלא יודע מה תקוע לה בחור, נתנה מבחן הזוי במועד ב' עם ממוצע 57 בלי פקטור. כרגיל ממשיכים לזיין אותנו וכל הלוזרים שותקים.\n\nהשורה התחתונה: קורס קליל חומר קליל מבחן קשה אבל מה חדש.", "timestamp": 1648125594093}, {"author": "תחשיב הפסוקים", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: האופציה היחידה בסמסטר שלנו הייתה לצפות בהקלטות של קרן, לא היה אף מרצה שמעביר פרונטלי. בהקלטות קרן מסבירה טוב את החומר אבל ברמה די נמוכה שלא קרובה למה שמצופה מכם בשיעורי בית או במבחן. לי אישית פחות מתאימה הצורת למידה שמבוססת על הקלטות בלבד ואני חושב שזה הזוי לחלוטין שלא הייתה אופציה גם להרצאה פרונטלית - הקורס היחיד בטכניון שנתקלתי בו ששולח אותך להקלטות מבלי שום אלטרנטיבה.\n\nשם המתרגל/ת: גלי+וסים\nחוות דעת - תרגולים: וסים מתרגל מעולה, אכפתי שמסביר טוב את החומר ואי אפשר לצאת מתרגול שלו מבלי להבין הכל. דואג גם לפתור פורמאלית ולתת אינטואיציה לפיתרון שזה הכי חשוב.\nממליץ לקחת את הקורס כאשר גלי לא מתרגלת אחראית אם יש לכם אופציה - בשיעורים ובשעות הקבלה שלה ניכר חוסר החשק שלה להיות שם, ואני בכמה הזדמנויות מצאתי את עצמי לא מבין את ההסברים שלה ולאחר שניסיתי לשאול ונעניתי בזלזול הרגשתי לא נעים לשאול שוב.\n\nשעורי הבית: יש שישה גיליונות, כל גיליון שמקבלים עליו מעל 75 מזכה בנקודה לציון הסופי עד מקסימום של 5 נקודות. הגיליונות לא מורגשים יותר מדי במהלך הסמסטר, אבל רמת הקושי שלהם די גבוהה (לעיתים מעל רמת המבחן) ואם אתם מצליחים אותם מצבכם טוב.\n\nהמבחן: לצערי לא ניגשתי למועד א' שהיה הוגן. במועד ב' הייתה תחושה של \"סגירת חשבונות\" אחרי הציונים היחסית גבוהים במועד א' (יחסית גבוהים למרות שהממוצע עדיין היה 67 במועד א' עצמו, אבל כנראה לסגל זה לא בא טוב בעין שהרבה אנשים קיבלו 100). המבחן היה קשה מאוד ולא קשור למבחני עבר בשום צורה, לא תואם לזמן שניתן לו, והרגיש פשוט לא פתיר כשמטרתו היחידה הייתה להוריד את הממוצע אחרי המועד א' (הממוצע במועד ב' עצמו - 54!!!). נראה שהסגל חושב שיש לו יותר גדול ככל שהממוצע יותר נמוך, לא ברור על מה הם באו לפצות עם ממוצע כזה ביזיוני ועוד בלי פקטור.\n\nהשורה התחתונה: במהלך הסמסטר קורס קליל ונחמד. המבחנים לעיתים קרובות הזויים ברמתם ובעיקר במועד ב' ראיתי הרבה מבחנים לא פתירים כולל שלנו. תיגשו למועד א' לא משנה מה.", "timestamp": 1648140280158}, {"author": "אורי דקל", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: הייתה כיתה הפוכה כל הסמסטר, קונספט שאמנם דורש יותר עמידה בזמנים וכו' אבל דווקא בקורס הזה עבד לדעתי טוב מאוד. צנזור מסבירה מצויין בהקלטות אבל מומלץ לנסות לפתור תרגילים תוך כדי, גם את התרגילים שהיא נותנת, כי בקורס הזה להתאמן על כתיבה זה הדבר החשוב ביותר.\n\nשעורי הבית: החלק הכי חשוב בקורס. הפידבק אמנם לא מלא אבל חיוני כדי להבין מה רוצים מכם, ולפתור את שיעורי הבית בכתיבה (ולא במחשב) ובצורה מלאה ומנומקת כמה שרק אפשר זאת הדרך הכי טובה להתכונן למבחן.\n\nהמבחן: המבחן הוא מירוץ נגד הזמן בכתיבת ההוכחות פורמליות. רוב השאלות, חוץ מחלק מהשאלות על גדירות הן עם תשובה כמעט ברורה אבל דורשות כתיבה על דף שלם בלי לפספס שום נימוק. לכן כדאי לכתוב כמה שיותר במהלך הסמסטר ולהתאמן עם טיימר.\n\nהשורה התחתונה: קורס שאמנם יש בו חלקים מעניינים אבל הוא בעיקר ניסיון לפרמל את הברור מאליו, עם כמה שיותר נימוקים ובכמה שפחות זמן.", "timestamp": 1648565448600}, {"author": "~", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: קרן צנזור\nחוות דעת - הרצאות: בסדר סהכ\n\nשם המתרגל/ת: גלי שפי\nחוות דעת - תרגולים: מתרגלת טובה אבל מביעה מאוד את חוסר החשק שלה לעזור, וזה מוריד מוטיבציה. כשלא יכולתי ללכת אליה ראיתי את המוקלט של ואסים, שהוא ממש אחלה.\n\nשעורי הבית: קשים אבל חשובים, מאוד מכינים למבחן\n\nהמבחן: מועד א היה הוגן מאוד, ואז הסגל החליט להתנקם וכיסח במועדי ב וג. מועד ב - ממוצע 54, אין פקטור. מועד ג - ממוצע 41(!), ואז הוסיפו פקטור של 3 נקודות.\n\nהשורה התחתונה: די נהניתי מהחומר, אבל היחס של הסגל מתסכל ומוריד כל חשק להמשיך", "timestamp": 1650020451278}, {"author": "לוגיקה", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יקיר ויזל \nחוות דעת - הרצאות:  \n\nשם המתרגל/ת: שיר \nחוות דעת - תרגולים: מתרגלת מעולה , מעבירה כל השאלות באופן ברור \n\nשעורי הבית: שיעורי בית לא קלים ולא קשים דורשים הבנה עמוקה לחומר ויכולת כתיבה פורמלית , הכנה טובה למבחן \nלהיות על זה לאורך כל הסמסטר  \n\nהמבחן: לדעתי המבחן הוגן , הדבר העיקרי במבחן הוא ההתמודדות עם הזמן , לרוב הפתרון של השאלות יהיה די ארוך \n\nהשורה התחתונה: אישית התחברתי לקורס , ברגע שהצלחתי לפתח אינטואיציה הכל השתנה", "timestamp": 1658312261007}, {"author": "תלות סופית", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: ההרצאות במתכונת של כיתה הפוכה. ההרצאות אצל יקיר היו אחלה, ונכנסנו לכל מיני נקודות לעומק, אבל החיסרון הוא שהוא לא כותב את הדברים בצורה מסודרת אז לפעמים קצת קשה לעקוב.\n\nשם המתרגל/ת: עידן מהלל\nחוות דעת - תרגולים: אחלה, עובר על הדברים בצורה ברורה.\n\nשעורי הבית: בערך חצי מהשאלות בשיעורי הבית מורכבות מהשאלות היותר קשות שהיו במבחני עבר ככה שהם פתירים, אבל יכולים להיות די ארוכים (אצלנו קיבלו נקודה בונוס על כל תרגיל מעל 75)\n\nהמבחן: הזמן זה כנראה הדבר הכי מאתגר במבחן. חסר שנתקעתם על משהו אחד יותר מ-10-15 דקות ויהיה לכם קשה מאוד לסיים את המבחן. מעבר לזה הרמה של השאלות הייתה בסדר והן היו יחסית הוגנות.\n\nהשורה התחתונה: הקורס נורא אבסטרקטי אז באופן אישי לא לגמרי התחברתי אליו אבל הוא היה בסדר.", "timestamp": 1659008202143}, {"author": "השמה מתקנת", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: קרן + שרי\nחוות דעת - הרצאות: \nההקלטות של קרן סבירות, היתרון בהם שהן קצרות יחסית.\nההרצאות ההפוכות קצת מיותרות, לרוב חצי שיעור רק חוזרים על הגדרות ובסוף עושים קצת תרגילים כדי לפתח אינטואיציה. אם יש לכם זמן - כדאי ללכת. אחרת, ממש אפשר לוותר (הייתי בפחות מחצי).\nההקלטות של יקיר גרועות מאוד, לא מסיים לכתוב משפטים והגדרות ורק אומר בע\"פ באודיו באיכות ירודה, משתמש במצגת לא מובנת.\n\nחוות דעת - תרגולים: \nוואסים מוקלט - מתרגל מעולה. בתרגולים האחרונים שלא היו להם הקלטות הייתי עם עידן והיה אחלה, יכול להעיד גם על עומר שהוא תותח.\n\nשעורי הבית: \nממש ממש ארוכים וחופרים. לא שווה לבזבז על זה זמן, פשוט תחפשו מאיזה מבחן זה מועתק ותרפרנסו.\n\nהמבחן: \nשאלות לא קלות אבל תבניתיות מאוד - תפתרו מספיק מבחנים וזה מספיק בשביל להוציא ציון טוב אפילו אם לא הייתם על החומר במהלך הסמסטר ולא פתרתם תרגילי בית.\n\nהשורה התחתונה: \nלא אהבתי את הקורס במהלך הסמסטר (גם בקושי השקעתי בו), לקראת המבחן ישבתי ולמדתי אותו כמו שצריך ודי אהבתי את החומר. קצת פדנטי אבל מעניין.", "timestamp": 1659015061542}, {"author": "Daniel Litvak", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יקיר\nחוות דעת - הרצאות: \nהרצאות טובות שעוזרות להבין את החומר שנלמד בהקלטה\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: \nתרגולים טובים\n\nשעורי הבית: \nמתחיל קל ומתגבר עד עמוס מאוד\n\nהמבחן: \nצריך לכתוב הרבה יותר מידי", "timestamp": 1659175051466}, {"author": "כריס", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: קרן צנזור - הקלטות\nחוות דעת - הרצאות: מסבירה מעולה. שווה מאוד לעקוב אחריה כל שבוע ולא לצבור פער של הרצאות להשלים, לא תופס נפח בכלל כמעט במהלך הסמסטר.\n\nשם המתרגל/ת: ואסים\nחוות דעת - תרגולים: סה\"כ מתרגל טוב. לפעמים טיפה איטי אבל מעביר את העקרונות הטכניים בצורה ברורה. \n\nשעורי הבית: כדאי מאוד לעשות, לפחות כל עוד אין עומס בסמסטר. תורמים הרבה להטמעה של החומר. \n\nהמבחן: תכנון זמן נכון הוא המפתח. מבחן שהוא בעיקר טכניקה ועבודה על אוטומט. \n\nהשורה התחתונה: אחלה קורס, מעניין, חשוב ולא מכביד.", "timestamp": 1676379241499}, {"author": "אלחנן בלוך", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: הקלטות של קרן, וכיתה הפוכה של שרי\nחוות דעת - הרצאות: \nההקלטות מאוד ברורות. באופן כללי החומר לא כ\"כ קשה, אבל די מעיק.\nהכיתה הפוכה עוזרת להפנים את החומר, אבל לא ממש קריטית להצלחה בקורס.\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: אחלה. מסביר טוב, ונותן דגשים חשובים. משתדל לרוץ על החלקים הפחות מעניינים, אבל לצערנו יש הרבה כאלה... לפעמים רץ קצת מהר מידי...\n\nשעורי הבית: \nלא חובה, אבל תכל'ס מי שלא עושה צריך ללמוד את הקורס מהתחלה לפני המבחן.\nהרמת קושי בינונית. אבל זה די ארוך.\n\nהמבחן:\nרמת קושי בינונית. אבל ארוך בצורה לא סבירה - גם אם כותבים כל השלוש שעות אי אפשר לכתוב הכל בצורה הפורמאלית שהם מלמדים.\nאולי בגלל זה נתנו אצלנו פקטור משמעותי.\n\nהשורה התחתונה:\nלומדים לפרמל את עצמנו למוות. מי שאוהב את זה - שיערב לו. מי שלא - הקורס די מעיק...", "timestamp": 1678034042111}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרי שינולד\nחוות דעת - הרצאות: הקלטות של קרן צנזור של שעה בשבוע ושעה עם שרי פרונטלית של כיתה הפוכה.\nהמוקלטות של קרן מאוד מסודרות אבל עמוסות.\nההפוכות עם שרי כוללות חזרה על מושגים ומענה על שאלות ששרי הביאה. יש כאלה שפחות אהבו את ההפוכות, אני אישית חושב שהן היו מועילות, גם לטובת להיות על החומר.\nחומר שיכול להיות משעמם לעיתים. בסוף רואים נגיעה מהשימוש של החומר באימות פורמלי ובתחומים אחרים של מדמ״ח ומתמטיקה.\n\nשם המתרגל/ת: רומי פלד\nחוות דעת - תרגולים: תרגולים לחוצים ביותר. לרוב לא הספקנו הכל. בחלק מהפעמים חזרנו שוב (בפעם השלישית - אחרי המוקלט של קרן וההפוכה של שרי) על המושגים, מה שהיה מיותר, ולכן לא נשאר זמן לפתרון השאלות. גם כשרוב הזמן הוקדש לשאלות, פתרון כל שאלה יכול להיות די ארוך ולגזול הרבה זמן. לדעתי צריך לחזור בתרגול על ושגים רק בעל פה או עם מצגת, אם בכלל.\n\nשעורי הבית: גיליונות דו-שבועיים של כ - 3 שאלות.\nבסמסטר שלנו הגיליונות לא היו חובה והציון הסופי היה 100 אחוז מבחן.\nבקורס יש פורמט מוסדר איך כל תשובה צריכה להראות, ממליץ לעשות את הגיליונות כדי להבין אותו. לזכות הסגל ייאמר כי הבדיקה של הגיליונות הייתה רצינית מאוד.\n\nהמבחן: באופן כללי המבחן די תבניתי בסמסטרים האחרונים. בסמסטר שלנו המבחן היה הגון אך היו כמה סעיפים שהיו קשים מהרגיל. המבחן ארוך וצריך מצד אחד לא למהר מידי כדי לא לפספס פרטים חשובים אבל מצד שני להגיע ברמה מספיק גבוהה בחומר כדי לא לחשוב יותר מידי על כל שאלה. אין פפתרונות רשמיים, אז מומלץ מאוד לחקור טוב את הסריקות ולהבין אילו דברים הבודקים מחפשים בכל תבנית של תשובה (פרסמומ אלנו טעויות נפוצות, לפחות למועד א׳)\n\nהשורה התחתונה: אחלה קורס עם אחלה סגל. הכתיבה לפעמים קצת מעיקה אבל לא פעם גיליתי תוך כדי כתיבת הפתרון המלא טעויות שלא שמתי לב אליהן בפיתוח בראש. אהבתי גם את ההוספה של החומר האחרון שאמנם חדש (ואין עליו הרבה תרגול), לא קל אבל מעניין ויישומי.", "timestamp": 1678379226410}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: שרי שינוולד (כיתה הפוכה), קרן (מוקלטות)\nחוות דעת - הרצאות: מוקלטות משעממות אבל חשובות. כיתה הפוכה אפשר היה לוותר אולי אבל זה בסך הכל שעה אז לא יכול להזיק יותר מדי.\n\nשם המתרגל/ת: רומי\nחוות דעת - תרגולים: חשובים, שאלות בסגנון מבחן. רומי היתה טיפה מבולגנת, בעיקר בגלל הלחץ של הזמן אבל בסה\"כ רואים שמאוד אכפת לה ואפשר להבין את מה שחשוב.\n\nשעורי הבית: גיליונות שבסמסטר שלנו לא תרמו לציון בכלום. אפשר היה להגיש רק כדי לקבל עליהם משוב חלקי. הרוב בחרו להכחיש את קיומם והמסקנה שלי היא שעם מספיק זמן להתכונן למבחן אפשר להתגבר על זה ולהשלים את הפער. \n\nהמבחן: אני אישית חזרתי על כל התרגולים, חזרתי על כל הגיליונות ואז התחלתי לתרגל מבחני עבר ועד שהגיע המבחן כבר די שלטתי בחומר. כל זה לא קשור לעובדה שהמבחן היה ארוךך ברמות וקשה אבל הבדיקה היתה בסדר והפקטור היה מטורף. השארתי מאחוריי.\n\nהשורה התחתונה: קורס משעמם נורא אבל מה שטוב הוא שלאורך הסמסטר אפשר להרשות לעצמכם להכחיש אותו.", "timestamp": 1678780124097}, {"author": "מעריץ של הסופר", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: קרן מוקלט / שרי כיתה הפוכה\nחוות דעת - הרצאות: \nמוקלטות של קרן - מעולות, קצרות ומהנות לצפייה (באמת)\n\nכיתה הפוכה עם שרי - הייתי פעמיים והפסקתי. לא הרגשתי חוסר בזמן הלמידה למבחן. אם אתם עם קליטה מהירה ומאלה שאוהבים להשתתף בתרגולים אז אולי תהנו מזה, כי זה הסטייל.\n\nשם המתרגל/ת: ויסאם מוקלט\nחוות דעת - תרגולים: \nאחלה לגמרי, ברור\n\nשעורי הבית: \n*עצה למתמידים* \nאין לתרגילים פתרון רשמי ואין רפרנסים קריאים כל-כך.\nממליץ למי שרוצה לתרגל את החומר, לפתור שאלות ממבחנים אחרי כל נושא. השאלות בתרגילי בית הן ממש שאלות ממבחנים, אז אין הבדלי רמה. היתרון הוא שיש הרבה סריקות ולא מעט עם כתב קריא. (העצה לא רלוונטית עבור המטלה הראשונה והשנייה)\n\nהמבחן: \nלי הרגיש מבחן הוגן. \n\n*עצה נוספת* \nבמהלך הלמידה למבחן זהו דפוסים חוזרים של תשובות ודרכי הוכחה. יש כמה נושאים שממש חוזרים על עצמם ואז זה ברור שצריך לזכור, אבל יש גם סוגי שאלות שלא מופיעות כל מבחן ועדיין יש בהן דפוס משלהן שחוזר על עצמו מדי פעם. לי זה עזר.\n\nהשורה התחתונה: \nקורס לא מעניין אבל בסך הכל חביב. \n\n*עצה אחרונה*\nאל תזניחו את הצפייה בקורס! \nההרצאה השבועית היא שעה, התרגול השבועי הוא שעה. \nצופים במוקלט על קצב כפול ומסיימים בשעה את שניהם. \nבנוסף הרמה של החומר בהרצאה ובתרגול ממש קלילה ולכן באמת לא מכביד על הלוז או על המוח. \n\nתרגילי בית ברובם לא עשיתי בגלל המחסור ברפרנס קריא, אבל שבוע של פתירת מבחנים הספיק.", "timestamp": 1690025717235}, {"author": "anon", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: שרי (כיתה הפוכה) + קרן (הקלטות) \nחוות דעת - הרצאות:\nקרן מסבירה את החומר בצורה טובה. זה יכול להיות משעמם קצת (לי לפחות) אבל יש פה ושם דברים מעניינים.\n\nהכיתה ההפוכה הרגישה לי קצת מיותרת ואני מאמינה שמי שלא נכח לא הייתה לו בעיה בלהבין ולהפנים את החומר. אבל בכל זאת שרי מרצה מעולה ונחמדה וגם חוזרים על ההגדרות קצת, אז למה לא?! \n\nשם המתרגל/ת: וסים \nחוות דעת - תרגולים: \nמתרגל מעולה... והוא מקליט את התרגולים שלו. \nהוא לא מעלה את המצגות או את הפתרונות אז תרשמו אצלכם את הפתרונות במהלך התרגול.\n\nשעורי הבית: \nלא חובה. \nהסתכלתי עליהם פה ושם במהלך הסמסטר ולא ממש פתרתי. הם גם קצרים כך שניתן להשלים אותם במהלך הלמידה למבחן. לרוב הם מכילים שאלות שהיו במבחני עבר אז גם אם לא תפתרו לא תהיה בעיה אבל אני ממליצה שכן תעברו ותוודאו שהכל היה במבחנים שפתרתם ואם מצאתם משהו חדש תפתרו אותו! \n\nהמבחן: \nהיה הוגן. פתרתי את כל המבחנים שהיו בעבר (כי פשוט אין הרבה והיה מספיק זמן) ובאמת לא היו רעיונות חדשים.  \n\nהשורה התחתונה: קורס בסדר. קצת משעמם אבל לא נורא...", "timestamp": 1690124651992}, {"author": "ניק", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: קרן מוקלט\nחוות דעת - הרצאות: דיי אפשר לוותר ולחיות עם עצמך בסדר\n\nשם המתרגל/ת: ואסים מוקלט\nחוות דעת - תרגולים: חשוב - והוא מתרגל תותח\n\nשעורי הבית: ניתנים להזנחה\n\nהמבחן: אם אתם הולכים לתרגולים/צופים במוקלט ועל החומר חמש ימים של למידה ממש בצ'יל הספיקה (וזה גם כל המבחנים שקייימים באתר) מקצה לקצה להוציא ציון של 80\n\nהשורה התחתונה: \nניתן להכחשה, ממש פדנטיים - יכול להיות שאם הוא היה קורס בחירה והממוצע היה יותר גבוה היה שווה לקחת אותו", "timestamp": 1690821312361}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: קרן + שרי\nחוות דעת - הרצאות: \nראיתי את ההקלטות של קרן. חייב לציין שבניגוד לשאר הסטודנטים, אני חושב שההרצאות בכלל לא טובות. תמיד מתחילים את ההקלטה הבאה בלי שום חזרה על החומר הנלמד, או איך זה מתקשר, ותמיד קופצים הלאה והלאה והלאה.\nממש ממליץ לעשות את החזרה על החומר בעצמם לפני כל הרצאה.\n\nשרי - בכיתה ההפוכה היה נחמד. בדיעבד הייתי מוותר על זה\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים:\nבדיעבד לא הייתי הולך אליו. הוא חושב שהוא בא להעביר הרצאה, אבל הוא מעביר תרגול...\nהוא כן יודע את החומר בצורה טובה, אבל מתעכב על דברים פחות רלוונטים. \n\nשעורי הבית: \nשיעורי הבית לא עמוסים במיוחד, והם לא חובה. כן ממליץ לעשות אותם כי הם עוזרים להבין את החומר בצורה יותר טובה.\n\nהמבחן: \nהמבחן די חזרתי.\nתעשו כמה שיותר\n\nהשורה התחתונה: לא ממש התחברתי לקורס.", "timestamp": 1691930160225}, {"author": "נימי אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: מוקלט קרן צנזור\nחוות דעת - הרצאות: אחלה של הקלטות, קרן ערכה אותן והוציאה קטעים לא חשובים כמו מחיקות לוח. מאוד מסודרת וכיף להקשיב לה.\n\nשם המתרגל/ת: מאור סולימה \nחוות דעת - תרגולים: תותח\nבא לתקתק, מרגישים שהוא רציני ויודע את החומר (קצת יותר טוב בחצי הראשון של הסמסטר), וגם מרגישים בנוח לעצור אותו ולשאול שאלות כשצריך בלי שזה יעכב.\nמעולה למי שאוהב שהחומר עובר בצורה מהירה, חדה ולעניין.\n\nשעורי הבית: די קשים, אבל עוזרים לשמור על פוקוס במהלך הסמסטר אם עושים אותם \n\nהמבחן: סה\"כ די תבניתי. עושים מספיק מבחנים ולומדים את הקטע\n\nהשורה התחתונה: די משעמם במהלך הסמסטר וקל להזניח אותו, אבל דווקא די נחמד כשמתחילים לתרגל מבחנים, ואפשר להגיע לציון טוב גם אם לא ממש הייתם על זה במהלך הסמסטר", "timestamp": 1694965937509}, {"author": "מקווה לטוב", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ויזל/שרי \nחוות דעת - הרצאות: \nההרצאות בקורס הן במתכונת כיתה הפוכה יש הקלטות של קרן שהן ממש אחלה ומסודרות בצורה מדהימה!\nלא הלכתי לפרונטלי\nשם המתרגל/ת: וסים מכול\nחוות דעת - תרגולים: \nהתרגולים שלו בסכ״ה בסדר הוא מעביר את העיקר בצורה טובה ומדהימה.\nלדעתי היה צריך לתרגל קצת על הפורמליות בתשובות. \nשעורי הבית: \nלא חובה להגשה בחלק גדול מהם יש שאלות ממבחני עבר\nהמבחן: \nניגשתי למועד א מבלי להבין כל כך את תבנית השאלות אחר כך למועד ב הבנתי את התבנית של השאלות ואיך לגשת לכל שאלה מה שעזר לי הרבה במועד ב ולקבל ציון עם הפרש של 30+ נקודות ממועד א.\nהשורה התחתונה: \nצריך להבין את הקונספט ויעבור בטוב", "timestamp": 1698141986105}, {"author": "עדן", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ויזל/שרי\nחוות דעת - הרצאות: מצטערת שלא הלכתי יותר, אבל אהבתי מאוד לכן ממליצה. צריך לראות חלק בבית ואז לבוא לכיתה לחלק השני, בהחלט מוריד מהעומס אהבתי את הפורמט. \nמושגים חדשים רבים ושיטות רבות, שוב מומלץ לעבוד עם סיכומים כי זה חוזר על עצמו.\n\nשם המתרגל/ת: לא הלכתי\n\nשעורי הבית: לא מגן, לא עשיתי אבל לפי מה ששמעתי תרגול טוב לחומר בזמן אמת \n\nהמבחן: כמה צריך לכתוב וואו...הלוואי והייתה לי הארכת זמן. אוקי. הפורמט של השאלות והתשובות דומה לכל מבחן, אחרי כמה מזהים את התבנית . צריך להבין אם הוכחה / הפרכה, ואיך מוכיחים או מפריכים, אין דרך אחרת חוץ מלתרגל ולראות כמה שיותר תרגילים. \n\nהשורה התחתונה: לא הכי קשה אבל לא קל בכלל, ממליצה לתרגל מבחנים ולחשוב על הגבל הזמן לקראת המבחן.", "timestamp": 1704623485548}, {"author": "גלעד", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: קרן \nחוות דעת - הרצאות: \nההרצאות הן במודל של כיתה הפוכה. רואים הקלטות בבית ובאים להרצאה כדי לתרגל. ההרצאות המוקלטות הן של קרן והן טובות. גם ההרצאות הפרונטליות שלה טובות וחשובות להפנמה של החומר. \nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: \nמתרגל מצויין, אבל מלמד מהר מאוד. אם אבדת אותו בהתחלה בהצלחה בהמשך התרגיל\nשעורי הבית: \nלא מאוד קשים, אבל לוקחים את הזמן שלהם. הגשות בזוגות\nהמבחן: \nכמו שיעורי הבית, לא מאוד קשה אבל מאוד ארוך. בלי הארכת זמן לא היה לי סיכוי לסיים בזמן.  צריך לתרגל הרבה כדי לקבל אינטואיציה שתעזור לקצר תהליכים כדי להספיק בזמן. \nהשורה התחתונה: \nקורס מעניין, לא קשה אבל גם לא מאוד קל.", "timestamp": 1715846414733}, {"author": "noa", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: קרן הלל צנזור\nחוות דעת - הרצאות: וואו ללכת לכיתות ההפוכות שלה! מסדרות את הראש ועוזרות ממש להכניס את החומר. קל להכחיש את הקורס וכשהולכים אליה זה נהיה קשה יותר להכחיש. \nגם שרי מתוקית\n\nשם המתרגל/ת: מאור אבל הביקורת מופנית לכולם\nחוות דעת - תרגולים: המתרגלים לא יודעים את החומר של הקורס. אני יודעת יותר טוב מהם ויכולה ללמד את חברים שלי יותר טוב וזה גם מה שקרה. עצוב מאוד ומראה הרבה על הסגל. \nמאור אחלה מתרגל, טיפה לחוץ ומהיר מדי, אבל נראה שיש לו כוונות טובות. \n\nשעורי הבית: וואו מושלמים, רמה ממש סבבה אפשר לרפרנס אבל לא חייבים כי נחמד לפתור. \n\nהמבחן: שאלות במבנה ספציפי שחוזרות על עצמן וזה ממש נחמד\n\nהשורה התחתונה: \nאני אסכם בציטוט שקיבלתי משני מתרגלים שונים:״אני לא יודע את החומר כי לא היה תרגול על זה״.", "timestamp": 1716189083732}, {"author": "ג", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nההקלטות נהדרות, קצר ברור ולעניין\n\nשם המתרגל/ת: וסים מחול\nחוות דעת - תרגולים: מצוין,\n\nשעורי הבית: ארוכים, אבל לגמרי פתירים אם רואים את ההרצאות והתרגולים\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1716557820107}, {"author": "קומפקטיות", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: קרן כיתה הפוכה\nחוות דעת - הרצאות: קצר ולעניין\nלדעתי הלמידה הפעילה לא באמת עוזרת\n\nשם המתרגל/ת: מאור\nחוות דעת - תרגולים: מספיק טוב, התגולים מכינים טוב ומאור מסביר בצורה ברורה\n\nשעורי הבית: חשובים והשאלות בהן דומות למבחנים\n\nהמבחן: באופן כללי הוגן ודי תבניתי, תעשו כמה שיותר מבחנים ותסתדרו \nשלנו (מועד ב) היה מאוד שונה ממה שהיה במחני עבר ולדעתי הרבה יותר קשה\n\n\nהשורה התחתונה: די אפשר להזניח בסמסטר", "timestamp": 1717630063190}]}