{"posts": [{"author": "SR", "difficultyRank": 2, "generalRank": 3, "semester": "201801", "text": "שם המרצה: נאדר בשותי\nחוות דעת - הרצאות: סה\"כ נאדר מרצה בסדר, למרות שלפעמים קצת קשה לעקוב אחריו. \n\nשם המתרגל/ת: דודו ינאי (בווידאו) + איתי רוזנברג\nחוות דעת - תרגולים: את החצי הראשון של הקורס העברתי בתרגולים של איתי רוזנברג, והוא ממש תותח.\nאת החצי השני העברתי בווידאו של המתרגל דודו ינאי התותח. התרגילים זהים כמעט אחד לאחד למה שהיה בתרגולים שלנו, למרות שהווידאו היה קצת ישן - אבל עדיין רלוונטי מאוד.\n\nשעורי הבית: שיעורי הבית לא הכי פשוטים, אבל עוזרים לתרגל את החומר. העומס לא גדול במיוחד, יש גיליון פעם בשבועיים ואפשר לסיים אותו אחרי כמה שעות עבודה. ההגשה בסמסטר שלי הייתה בזוגות.\n\nהמבחן: לי אישית המבחן היה ממש קשה וארוך\n\nהשורה התחתונה: אני פחות התחברתי לקורס, אבל מניח שזה עניין של טעם. עם זאת, הוא חשוב להרבה נושאים במדעי המחשב.", "timestamp": 1597745552582}, {"author": "שחר", "difficultyRank": 3, "generalRank": 4, "semester": "201901", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: עובר על המצגות ומסביר בעיקר את התיאוריה. קצת מונוטוני. לא תמיד הצלחתי להבין הכל בהרצאות אך זה לא הפריע לפתירת התרגילים אחר כך.\n\nשם המתרגל/ת: אלון רשף\nחוות דעת - תרגולים: בתרגולים פותרים שאלות דומות לשאלות בתרגילי הבית ובמבחן. אלון תותח. מתעכב כשלא מובן ומסביר איך להגיע לפתרון שלא תמיד אינטואיטיבי.\n\nשעורי הבית: לא קלים ובקריאה ראשונה לא ברור איך לפתור אותם. נעזרתי בסדנאות שמתקיימות אחרי כל פרסום גיליון. המלצה- לנסות לפתור את התרגילים לבד, ועם הטיוטה להגיע לסדנאות ולתקן/ ללמוד איך כדאי לפתור את התרגילים\n\nהמבחן: לא קל. מורכב משאלות דומות ברמתן לשאלות בתרגילי הבית, שבשילוב לחץ זמן הופכות לקשות.\nלמידה למבחן- לפתור את כל תרגילי הבית, וכמה שיותר מבחני עבר.\n\nהשורה התחתונה: קורס חביב ומאתגר", "timestamp": 1598210614530}, {"author": "Aviram Shovali", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nפייר לגמרי\nהשורה התחתונה: לא קשה מדי", "timestamp": 1598345487598}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: נאדר בשותי\nחוות דעת - הרצאות: הרצאות בנויות טוב, נאדר מרצה מעולה ובעיקר עם חוש הומור מצוין. לא כמות גדולה של חומר, אבל חומר לא קל, דורש הבנה ובעיקר אינטואיציה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יחסית רלוונטים למבחן(גם שאלה משם מופיעה במבחן), לא עמוסים- הגשה פעם בשבועיים, משקל נמוך על הציון הסופי(עד 2 נקודות בונוס)\n\nהמבחן: המבחנים בד\"כ הוגנים, מקיפים את רוב החומר ואם מתרגלים הרבה מבחנים(!) זה אמור להיות מספיק טוב.\n\nהשורה התחתונה: אחד הקורסים הכיפיים, קומבינטוריקה זה פשוט תחום מעניין.", "timestamp": 1602240192215}, {"author": "....", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: טובי עציון\nחוות דעת - הרצאות: \nטובי מרצה נהדר, קצת הסתבך עם הטכנולוגיה והזום, אבל ההרצאות היו מעולות.\n\nשם המתרגל/ת: טל אלון\nחוות דעת - תרגולים: \nאני חושב שזאת פעם ראשונה שטל מתרגלת קומבי, אבל רואים שיש פוטנציאל גדול ושהיא יודעת את החומר כמו שצריך.\n\nשעורי הבית: \nהוגנים\n\nהמבחן: \n*סמסטר קורונה*\nמועד ב' היה הוגן, שני חלקים במשך שעה וקצת כ\"א.\n\nהשורה התחתונה: \nקורס חשוב ומעניין", "timestamp": 1602654194885}, {"author": "hod badichi", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: \nמרצה טוב , קשה להבין מהמצגות ומהזום שלו את כל הפרטים.\nיש פער בינו לבין הוידאו שאומרים שאין בעיה לראות של ראובן.\n\nשם המתרגל/ת: גלי\nחוות דעת - תרגולים:\nהיא ואלון באותה רמה , די מפורטים נותנים דגש איפה שצריך.\nהמתרגל בפנופטו מעולה \n\nשעורי הבית: \nלא עמוסים אבל גם לא פשוטים.\nממליץ לפתור לבד גם אם ההגשה בזוגות , עוזרים מאוד להבנה של החומר.\nממליץ לעבוד מראש עם הדף נוסחאות שיהיה במבחן\nהמבחן: \nלא פשוט, הרבה טריקים. \nצריך לתרגל המון מבחני עבר וממליץ ללמוד רוחבית מה booklet שנמצא בדרייב.\n\nהשורה התחתונה: \nקורס טריקי , חשוב מאוד להמשך התואר", "timestamp": 1603269773527}, {"author": "מסלול אוילר", "difficultyRank": 3, "generalRank": 2, "semester": "201803", "text": "שם המרצה: לא זוכר\nחוות דעת - הרצאות: בסדר. \n\nשם המתרגל/ת: לא זוכר\nחוות דעת - תרגולים: גם בסדר. \n\nשעורי הבית: אין הרבה, יש רפרנס. בסמסטר קיץ זה יוצא כל שבוע גיליון שדורש זמן, אז עדיין היה עמוס. \n\nהמבחן: באופן מפתיע קשה ממש. החומר כנראה לא חילחל לי לראש למרות שפתרתי לא מעט בחינות משנים קודמות כדי לתרגל. \n\nהשורה התחתונה: meh. קורס חובה אז זה מה יש. לא מעניין במיוחד.", "timestamp": 1610240972321}, {"author": "סט", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מעולות. מסביר הכל בצורה ממש מובנת, ולא מהר מדי. המצגות טובות. בקושי היו שאלות בהרצאות. הקורס מורכב משני חצאים - קומבינטוריקה (בעיות ספירה), ותורת הגרפים.\n\nשם המתרגל/ת: גלי\nחוות דעת - תרגולים: \nהתרגולים סך הכל שעה בשבוע אבל גלי ממש השתדלה לנצל אותם עד הסוף, ידעה להסביר את התרגילים מעולה. ממליץ.\n\nשעורי הבית: \nיש גיליון של בערך 6 שאלות פעם בשבועיים (6 גיליונות סך הכל). חלק מהשאלות יותר קלות וחלק ויותר קשות, אבל כמעט כולן ממוחזרות משנים שעברו ככה שאם נתקעים יש רפרנס. בנוסף יש סדנאות שהמתרגלים מעבירים שבהן הם פותרים את השאלות יחד עם הסטודנטים.\n\nהמבחן: \nהיה השנה מבחן עמוס אבל שאלות לא קשות מדי. ההכנה הכי טובה זה לעשות הרבה מבחנים משנים שעברו.\n\nהשורה התחתונה: \nבעיניי קורס ממש מעניין שנותן כלים פרקטיים של קומבי וגרפים, אבל ברמה גבוהה של מתמטיקה ופורמליות (בעיקר בגרפים).", "timestamp": 1612947294971}, {"author": "YT", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מרצה יחסית טוב, אבל משעמם ומונוטוני. ממליץ לראות הקלטות במהירות גבוהה ולא לבוא להרצאות עצמן.\n\nשם המתרגל/ת: לב יוחננוב\nחוות דעת - תרגולים: מתרגל מעולה, יודע את החומר בצורה מדהימה ומסבירה אותו ממש טוב. נותן כל הזמן טיפים מדגיש מה חשוב ומה לא.\n\nשעורי הבית: קשים, ממליץ להקדיש יום אחד במקסימום לגיליון. הכל מרופרנס.\n\nהמבחן: לטחוןןן מבחנים! המבחן מאד קשה, דורש המון יצירתיות בשתי חלקי הקורס.\n\nהשורה התחתונה: קורס לא קל בכלל, לי אישית היה מאד קשה במהלך הסמסטר, אבל אם מתרגלים מספיק לפני המבחן זה מסתדר.", "timestamp": 1613117547598}, {"author": "Euler", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רוני\nחוות דעת - הרצאות: מרצה בסדר, הרבה פעמים קרה שחרג מהזמן (הרבה פעמים היה פשוט ממשיך בהפסקה ומקצר אותה/גולש אחרי סוף ההרצאה).\n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: מתרגלת מדהימה, מסבירה תכלס איך ניגשים לשאלות ואיך לפתור, וההסברים שלה מאוד ברורים.\n\nשעורי הבית: 5 גיליונות בערך, כל אחד נותן חצי נקודה לסופי עד 2 נקודות (מספיק להגיש רק 4 בשביל לקבל את הבונוס המקסימלי). יש רפרנס לכולם, אבל כן כדאי לפתור לבד כדי לתרגל (הבונוס הוא נטו על הגשה, והם לא ממש בודקים את התרגיל). הגשה בזוגות, בגלל הקורונה אישרו להגיש גם לבד הסמסטר.\n\nהמבחן: היה יחסית קשה.\n\nהשורה התחתונה: קורס חובה אז אין מה לעשות, לתרגל הרבה.", "timestamp": 1613407128518}, {"author": "אפרת כהן", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: רוני\nחוות דעת - הרצאות: פחות התחברתי, אני צפיתי באיתן מסמסטר קודם והוא מעולה \n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: אחלה ממש מסבירה טוב\n\nשעורי הבית: מטלות קלילות, חשוב לעשות אותם כדי לתרגל את החומר\n\nהמבחן: לא קל צריך לדעת טוב הכל כדי להצליח\n\nהשורה התחתונה: קורס בסדר, צריך לחרוש לדעתי לאורך הסמסטר ולתרגל כמה שיותר כדי להיות על החומר", "timestamp": 1613853256041}, {"author": "Orad Barel", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רוני\nחוות דעת - הרצאות: מלמד טוב\n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: מומלצת. מסבירה בקצב טוב וברור. העבודה שלה עם האייפד(בלימודים בזום כמובן) הייתה מאוד נוחה לי כצופה. \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1614192581391}, {"author": "Elad Kay", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יובל פילמוס \nחוות דעת - הרצאות: מרצה די טוב, מרבה לתת דוגמות והסברים\n\nשם המתרגל/ת: לב יוחננוב\nחוות דעת - תרגולים: מתרגל טוב, נותן דגשים על החומר\n\nשעורי הבית: 6 גיליונות לא חובה ועם השפעה מזערית על הציון. השאלות עוזרות למוכנות למבחן.\n\nהמבחן: סטנדרטי. לפתור מספיק מבחנים ומצליחים\n\nהשורה התחתונה: אישית? לא הקורס האהוב עליי. אבל זה דורש קצת חשיבה ובסוף מצליחים", "timestamp": 1614858806138}, {"author": "מבין עניין", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רוני רוט\n\nחוות דעת - הרצאות: \nמרצה חביב, 90% מהזמן הוא עם חיוך. מסביר באופן מצוין ככה שבדרך כלל אין שאלות בהרצאה. מה שכן, מדבר קצת לאט, אז אם יש אפשרות עדיף לראות את ההקלטה של ההרצאה על פי 2 מהירות.\n\nשם המתרגל/ת: דניאלה בר לב\n\nחוות דעת - תרגולים: \nסה\"כ מתרגלת טובה, אבל בקורס הזה זה לא רלוונטי כי המתרגלים פשוט מעתיקים את הפיתרון מדף השאלות של התרגול (שמופיע כבר באתר הקורס) ככה שאם אתם מבינים איך הגיעו לפיתרון שמופיע בדף,  לבוא לתרגולים זה בזבוז זמן.\n\nשעורי הבית: \nלא קשים, והם מהווים חזרה טובה על החומר. בנוסף, הם מוסיפים 2 נקודות לציון הסופי.\n\nהמבחן: \nלא קל, בדרך כלל 3 השאלות הראשונות הן בעיות ספירה קלאסיות בקומבינטוריקה (החלק הראשון של הקורס + מספרי קטלן) ו2/3 השאלות האחרות עוסקות בהוכחות בתורת הגרפים (החלק השני של הקורס).\nבשביל לקבל ציון גבוה במבחן צריך לפתור כמה שיותר מבחני עבר, כלומר להבין את הטכניקה עד הסוף, ולשים דגש על מבחני עבר של המרצה האחראי, כי יש שאלות שממחזרים (בדרך כלל יש שאלות דומות).\n\nהשורה התחתונה: \nצריך לדעת להבדיל בין החצי הראשון של הקורס, שהוא מאוד טכני, לבין החצי השני, שהוא מאוד תיאורטי ויש בו יותר שאלות הוכחה מאשר חישוב ישיר. במהלך הסמסטר קל מאוד להזניח את הקורס, אבל לקראת המבחן צריך לתרגל המון.", "timestamp": 1615839123261}, {"author": "Hussam Awad", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: \nההרצאות עוזרות להבין את החומר אז ממליץ מאוד לראות אותם, בבעיות ספירה אני ממליץ לא להסתכל על הוכחות כיוון ששאלות הספירה בד\"כ אם לא תמיד לא קשורות להוכחות, אני ממליץ מאוד לשים דגש על הוכחות גרפים.\n\nשם המתרגל/ת:  דניאלה לב\nחוות דעת - תרגולים: \nהמתרגלת מעולה מאוד, אוהבת לעזור, מסבירה ממש טוב, בהחלט ממליץ לראות את התרגולים שלה אם זה מוקלט או אם זה לייב\n\nשעורי הבית: \nלא עמוסים, ולא קשים במיוחד\n\nהמבחן: \nלצריך לפתור הרבה מבחני עבר כדי להצליח, ולשים דגש על הוכחות בגרפים\n\nהשורה התחתונה: \nקורס לא מעניין במיוחד אבל מצד שני לא משעמם", "timestamp": 1625506074386}, {"author": "יגל מימון", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איתן\nחוות דעת - הרצאות: תותח\n\nשם המתרגל/ת: דניאלה וגלעד צייס\nחוות דעת - תרגולים: דניאלה אלופה וגלעד גם גאון לא קטן\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1626356673478}, {"author": "--", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן\nחוות דעת - הרצאות: מרצה סביר, מרצה ממצגות של סמסטרים קודמים ומוסיף הסברים בשוליים תוך כדי שהוא מדבר. התוספות שלו לא תמיד ברורות והיה עדיף רק ההסבר המילולי שלו.\n\nשם המתרגל/ת: גלעד צ'ייס\nחוות דעת - תרגולים: מתרגל מושלם, מסביר הכל בצורה ברורה ונותן דוגמאות או הקבלות לנושאים מהחיים או לנושאים מעניינים יותר. באופן כללי הוא לא מתנשא על הסטודנטים ויש הרגשה מאוד נעימה בתרגולים שלו. \nכותב קצת מבולגן, אבל יש באתר הקורס את כל התרגולים מוקלדים.\nבלי קשר, שעה אחת של תרגול לא מספיקה וכמעט רוב המתרגלים גלשו מהזמן של התרגול לעוד איזה 10-15 דקות נוספות.\n\nשעורי הבית: סבירים, גיליון אחת לשבועיים עם 7 שאלות בד\"כ. השאלות מתמקדות בחומר שלמדנו באותו השבוע וזאת חזרה מצויינת על החומר.\n\nהמבחן: הוגן, היה לנו מבחן עם 7 שאלות. בהתחלה המבחן היה אמור להיות 3 שעות, אבל באמצע המבחן הוסיפו לנו חצי שעה כי הייתה שאלה (על גרפים) מאוד מבלבלת ונכנסו כמה פעמים לכיתה כדי להסביר עליה. \nבגדול, תפתרו מלא מבחנים ותחזרו על הוכחות של גרפים ותהיו בסדר.\n\nהשורה התחתונה: קורס חובה, לא מאוד קשה אבל חייבים לקחת אותו ברצינות.", "timestamp": 1627372593318}, {"author": "גלעד אל-דור", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: מרצה מעולה, לעיתים לוקח לו קצת זמן להבין מה בדיוק שואלים אותו (יכול להיות שזאת אשמת הסטודנטים השואלים גם) \n\nשם המתרגל/ת: ניר - מוקלט\nחוות דעת - תרגולים: מתרגל ברמה גבוהה מאוד, מסביר בצורה יסודית.\n\nשעורי הבית: שישה גליונות יחסית מסובכים, לוקח קצת זמן להקליד והשאלות לא קלות במיוחד, אבל לא משהו שיתפוס יומיים פתאום.\n\nהמבחן: המבחן מורכב משאלות על גרפים וספירות, היה יחסית הוגן, העובדה שיש מספר שאלות בהם מצפים רק לתשובה סופית אולי יורידו את הציונים של הסטודנטים שעשו טעויות חישוב, אך לא משהו קריטי לדעתי.\n\nהשורה התחתונה: קורס מעניין מאוד, ולא עמוס כל כך.", "timestamp": 1627463099684}, {"author": "א", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן \nחוות דעת - הרצאות: ההרצאות פחות מעניינות, אפשר לראות כפול 2 ולהתעלם מההוכחות של המשפטים.\n\nשם המתרגל/ת: דניאלה בר לב\nחוות דעת - תרגולים: דניאלה מדהימממה , מסבירה ממש בצורה מעולה.\n\nשעורי הבית: היו 6 ת\"ב ,כן מומלץ לפתור כי רוב השאלות ברמה של מבחן.\n\nהמבחן: היה ממש ארוך, אבל מבחינת קושי הוא היה סבבה לגמרי.\n\nהשורה התחתונה:", "timestamp": 1627491204029}, {"author": "ארתור קיילי", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איתן יעקומבי\nחוות דעת - הרצאות: איתן קצת מונוטוני אז בהתחלה די השתעממתי ממנו, אבל כשבאמת התאמצתי להקשיב לו הוא ממש אחלה ומסביר בצורה מאוד ברורה וחביבה. אחלה אווירה. \n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: דניאלה מושלמת, אבל באופן כללי גם גלעד עידן ואילן אלופים, ונראה שכל הסגל ברמה ממש גבוהה - נראה שרובם באמת מבינים בנושא של קומבי וכנראה מתעסקים בו גם במחקר שלהם וזה ניכר - ויש להם גם ניסיון בלתרגל את הקורס. הייתי מציע ללכת למי שיש אצלו מעט סטודנטים ככה שיהיה אפשר לשאול שאלות. ראיתי את דניאלה כי לא היה לי זמן ללכת פרונטלי אלא רק למוקלט לצערי\n\nשעורי הבית: מאתגרים מאוד אבל ממש רלוונטיים למבחן\n\nהמבחן: קשוח, זה קורס שצריך לפתור המון מבחנים ובאמת להבין אותם לעומק. אפשרי לחלוטין להוציא ציון גבוה מאוד אם באים חדים\n\nהשורה התחתונה: הקורס הכי יפה שלקחתי בטכניון עד עכשיו כנראה. קל להזניח במהלך הסמסטר, אבל לשים לב שעושים את זה רק אם יש שבועיים טובים ככה ללמוד למבחן בשיא הריכוז, וגם אז - חשוב כן ללמוד במהלך הסמסטר ולנסות לעקוב, גם אם לא מצליחים להיות 100 על החומר ולפתור את התרגילי בית לגמרי לבד. ללמוד מאפס את הקורס לפני המבחן זה רעיון גרוע כי זה קורס שדורש אינטואיציה שנבנית במהלך הסמסטר, וטכניקה וגם יכולת פירמול די גבוהה. קורס שמי שאוהב מתמטיקה/הוכחות פורמליות/חידות ממש יהנה ממנו.", "timestamp": 1628187035376}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן יעקובי מוקלטות\nחוות דעת - הרצאות: מסביר טוב, החומר לא מאוד מעניין. אפשר לדלג על ההוכחות המסובכות.\n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: מתרגלת טובה. התרגולים נורא קצרים אז לא מספיקים הרבה.\n\nשעורי הבית: 6 גליונות שנותנים בונוס עד 2 נקודות. הרוב לא קשים במיוחד, אפשר לסיים תוך כמה שעות.\n\nהמבחן: היה קצת לא מובן וארוך מהרגיל (נתנו תוספת זמן של חצי שעה לכולם) אבל רמה הוגנת.\n\nהשורה התחתונה: קורס לא מעניין מאוד אבל לא עמוס ואפשר להשיג ציון גבוה אם לומדים טוב למבחן.", "timestamp": 1628498675922}, {"author": "Gur Ladizhinsky", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: איתן מרצה בסדר. הוא מסביר את כל החומר, וגם מתעמק הרבה פעמים בהוכחות של דברים. בעוד שההוכחות עוזרות שבחצי השני של הקורס - גרפים - שם צריך לדעת איך נראות הוכחות פורמליות, בחלק הקומבינטורי הן פחות מועילות.\n\nשם המתרגל/ת: עידן מהלל וגלעד צ'ייס\nחוות דעת - תרגולים: הלכתי לתרגולים הפרונטליים של עידן במהלך הסמסטר וצפיתי במוקלטים של גלעד לקראת המבחן.\nעידן מתרגל בסדר. הכיתה הייתה מאוד קטנה, מה שהקל לשאול שאלות והאווירה הייתה טובה. הוא מסביר גם את כל החומר. מה שכן, הוא מתרגל איטי יחסית, ולרוב לא מספיקים לפתור את כל התרגילים.\nגלעד מתרגל מעולה. הוא מעביר את הנושא באנרגיה רבה ורואים שהוא מאוד אוהב את החומר, והוא גם מאוד נחמד לסטודנטים. הוא כן מדבר ופותר תרגילים מהר יחסית, מה שיכול להקשות לעקוב.\n\nשעורי הבית: עם שותפים, שישה גיליונות, צריך להגיש ארבעה בשביל 2 נק' בונוס (כל גיליון חצי נקודה). שבעה תרגילים פתוחים בכל גיליון. לא עשיתי את שיעורי הבית הסמסטר בגלל עומס בקורסים אחרים.\n\nהמבחן: המבחן מכיך שילוב של שאלות פתוחות וסגורות, בערך חצי על קומבינטוריקה (בעיות ספירה) וחצי גרפים. ברוב המבחנים היו 5-6 שאלות, אבל הסמסטר היו 7, והמבחן היה מאוד ארוך - נתנו הארכה של חצי שעה במהלכו. חוץ מזה, המבחן היה הוגן יחסית.\n\nהשורה התחתונה: החומר של הקורס די שונה משאר הקורסים, וצריך אינטואיציה רבה. אני אישית פחות התחברתי לחומר, אבל יש אנשים שמאוד אוהבים אותו.", "timestamp": 1628927617375}, {"author": ":|", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: לא קל לעקוב אחרי ההרצאות. לדעתי, המרצה לא מתאמץ יותר מידי להסביר.\n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: מתרגלת מעולה!!!\n\nשעורי הבית: \n\nהמבחן: מבחן קשה יחסית\n\nהשורה התחתונה: ממליץ לא לקחת את הקורס עם איתן.", "timestamp": 1635074051801}, {"author": "דני", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: מרצה טוב, לא נכנס לתיאוריה יותר מידי וטוב שכך. \n\nשם המתרגל/ת: דניאלה בר-לב\nחוות דעת - תרגולים: מתרגלת מעולה, יסודית. עם זאת שעת תרגול אחת שבוע לא תמיד מספיקה.\n\nשעורי הבית: \nלא עמוסים, ופעמים רבות לא פתירים ללא עזרה ממתרגל בשעת קבלה (כנראה שזה בכוונה)\nהמבחן: ניגשתי למועד ב'. ניסוח השאלות היה נורא לא מובן (בניגוד למבחנים קודמים) והיו לא מעט אנשים שלא הצליחו במועד זה. פקטור של 10 נק'.\n\nהשורה התחתונה: להיות עם \"יד על הדופק\" במקצוע הזה ויותר חשוב - לפתור כמה שיותר מבחנים לפני, רק ככה מבינים את החומר.", "timestamp": 1635590028998}, {"author": "Omer Huly", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: פרופסור יובל פילמוס\nחוות דעת - הרצאות: ההרצאות יכולות לעניין מידי פעם אבל מרגיש שהן מתקדמות בקצב איטי ומתעכבים הרבה זמן על נושאים פחות חשובים.\n\nשם המתרגל/ת: גלעד צ'ייס\nחוות דעת - תרגולים: התרגולים סופר חשובים להבנת החומר ואיך מיישמים אותו בתרגילים.\n\nשעורי הבית: יש גליונות, לא הייתה חובת הגשה בסמסטר זה. מי שרצה להגיש היה צריך להגיש בזוגות והמשוב היה חלקי ביותר.\n\nהמבחן: היה מבחן שונה לעומת סמסטרים קודמים, דרש יותר חשיבה והתמודדות עם שאלות שלא נראו בעבר.\n\nהשורה התחתונה: הקורס נוגע בהרבה תחומים חשובים במדעי המחשב (בעיקר גרפים ובפרט עצים).", "timestamp": 1644318307845}, {"author": "De Bruijn", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: מרצה בצורה די משעממת לטעמי, ומרגיש שמתעכב יותר מדי על דברים לא רלוונטיים באמת (כמו איך מבטאים שמות של מתמטיקאים...).\nהוא היה המרצה היחיד, והיו שתי הרצאות אפשריות, או היברידית או פרונטלית. בהרצאה ההיברידית נראה שלא ממש אכפת לו האם מי שבזום שומע אותו או לא, וגם אחרי מספר בקשות והערות שלא מבינים אותו כמו שצריך, לא היה נראה שיש בכוונתו לעשות משהו בנידון. אני הלכתי להרצאות הפרונטליות בעקבות זה, ולקראת סוף הסמסטר החלטתי שנמאס לי ועברתי לראות הרצאות מוקלטות מאביב 2021 של איתן יעקובי, שהיה הרבה יותר טוב מיובל.\n\nשם המתרגל/ת: אילן דורון ארד\nחוות דעת - תרגולים: סה\"כ תרגולים בסדר אם כי לא מדהימים במיוחד. בנוסף בגלל שיש רק שעה לתרגול, לא באמת מספיקים להפנים את כל החומר, ורוב ההבנה והתרגול בא לידי ביטוי בשיעורי הבית.\n\nשעורי הבית: מאתגרים קצת, אבל לא אמורים לקחת יותר מדי זמן. אצלנו ההגשה הייתה אופציונאלית, ולא היה מגן עבורם, אבל קיבלתי אחלה של משוב עליהם, מפורט עם הרבה טיפים, אז ממליץ לעשות ולהגיש אותם.\n\nהמבחן: המבחן הרגיש קצת שונה מסמסטרים קודמים, אבל עדיין היה יחסית הוגן, למרות שהסגל הכינו את המבחן בידיעה שיש שאלה אחת שהיא יותר קשה מהשאר.\n\nהשורה התחתונה: סה\"כ קורס די נחמד, קשה להבין קצת את הדברים בהתחלה אבל עם הזמן ועם התרגול הכל מסתדר. בסופו של דבר על מנת להצליח צריך לעשות כמה שיותר תרגילים (כרגיל...), ולא לזלזל בתרגילי הבית", "timestamp": 1644575195500}, {"author": "Daniel Litvak", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nיובל פילמוס\n\nחוות דעת - הרצאות: \nההרצאות יותר מבלבלות מאשר מלמדות\n\nשם המתרגל/ת: אילן\n\nחוות דעת - תרגולים: \nמסביר הכל בצורה טובה ומספיק לכסות את כל התרגול וגם להוסיף שאלות אקסטרה ממבחנים\n\nשעורי הבית: \nלא חובה, אבל חשוב לתרגל אם מתאפשר\n\nהמבחן: \nקשה, דורש המון תרגול מראש\n\nהשורה התחתונה: \nקורס קשה אבל אם תתרגלו תצליחו", "timestamp": 1645119093401}, {"author": "הדיל ריאן", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הכי חשובים ואכן צריך לשבת ולשבור את הראש כדי לפתור אותם , מאוד עוזרים \n\nהמבחן: מאוד הוגן , צריך לפתור מבחנים כדי לתרגל \n\nהשורה התחתונה: הקורס יפה והחומר יחסית קל , לא דורש הרבה השקעה תוך כדי הסמסטר אבל צריך כן להבין את ההרצאות ולפתור את התרגולים לבד כדי לתרגל אבל לא דורש הרבה זמן , שעורי הבית מאוד עזרו לי למבחן יחסית קשות", "timestamp": 1645197738613}, {"author": "Gil Shahar", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: הייתי בכמה הרצאות הראשונות פרונטלית והיה משעמם. עברתי להקלטות של איתן יעקובי עד שיובל החליט לשנות את החומר.\nלא שמעו את יובל טוב בהקלטות ולכן נאלצתי להשלים לבד את החסר.\n\nשם המתרגל/ת: אילן דורון ארד\nחוות דעת - תרגולים: היו הרבה אנשים אז לפעמים התעכבנו על שאלות. הוא עובד מהמצגת כמו כל המתרגלים אז היה טיפה משעמם \n\nשעורי הבית: בזבוז זמן לא עשיתי\n\nהמבחן: קשה מדי אבל היו בסדר בבדיקה שלו, לפחות אצלי\n\nהשורה התחתונה: קורס משעמם ומבלבל.. לא התחברתי בכלל ולא מצאתי בו עניין. מקווה לא לשמוע יותר על בעיות ספירה", "timestamp": 1645375752897}, {"author": "catto", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: ההרצאות לרוב נעו ממשעממות ללא מובנות. עברתי די מהר להקלטות של איתן מסמסטר שעבר.\nגם קצת חבל שהייתה התעלמות מהבעיות הטכניות בזום\n\nשם המתרגל/ת: אילן ארד\nחוות דעת - תרגולים: קצת רץ על החומר, אם כי קשה להאשים אותו כשכל התרגול הוא רק שעה\n\nשעורי הבית: אין ציון עליהם, אבל חשוב לעשות אותם. עוזרים להטמיע את החומר\n\nהמבחן: יובל יצא גבר. לא הרבה הגיעו להרצאות, והוא יכל להתנקם על זה במבחן, אבל היה מבחן הוגן וקל בהשוואה לשנים קודמות. גם החומר שהתווסף הסמסטר לא הופיע בכלל.\n\nהשורה התחתונה: קורס לא ממש מעניין, ברוך שפטרנו", "timestamp": 1645393185108}, {"author": "נתן פרנקו", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: בסמסטר שלנו יובל היה המרצה האחראי והיחיד, ובסמסטרי עבר נראה שהוא היה שותף בסגל. מבלי להוריד מכבודו,  עדיף לראות את איתן במוקלטים אם יובל הוא המרצה האחראי אצלכם ונסתפק בזה.\n\nשם המתרגל/ת: אילן דורון ארד חיים\nחוות דעת - תרגולים: אילן מתרגל אחראי והתרגולים הועברו בצורה טובה מאוד. היה קשוב לשאלות של סטודנטים וגם עזר הרבה בשעות קבלה. לרוב היה מסיים את התרגולים מעט מוקדם יותר ואז משאיר זמן לשאלות ממבחני עבר שזה בונוס שתורם להבנה.\n\nשעורי הבית: 6 גליונות, עמוסים וקשים, להרגשתי כרמה או שתיים מעל התרגולים. היתרון הוא שיש רפרנסים לרוב השאלות. בסמסטר שלנו הסגל החליט שכולם גם ככה מעתיקים את השיעורי בית ולכן אין תרומה שלהם לציון בכלל, מי שרוצה יכול להגיש ולקבל משוב על דרך הפתרון שלו. בכל אופן מומלץ לפתור כדי להישאר בעניינים, אציין שוב שהרמה של הגליונות גבוהה.\n\nהמבחן: במועד א' הייתה שאלה אחת מאוד בעייתית עם רפרנס חזק לשאלה מתרגילי הבית, כנראה זו הדרך של הסגל לבדוק מי באמת עבד לאורך הסמסטר ומי לא. בכל אופן מועד א' היה לא קל והרגיש כמו הרבה חידות שאספו אותן לכדי קובץ אחד שנקרא מבחן סופי. זה מסתדר עם זה שפילמוס פתח את הסמסטר באמירה ש-\"בקורס בקומבינטוריקה פשוט נלמד לפתור חידות\". היה גם פקטור מוזר שהתאימו לכל שאלה משקל מחדש בהתאם לממוצע הסופי שהסגל רצה שיהיה בקורס.\nבמועד ב' לא הייתה שאלה בעייתית ספציפית, הכל הרגיש קצת מונפץ ומעיק אבל היו הוגנים בבדיקה.\n\nהשורה התחתונה: קורס שבמהלך הסמסטר לא מורגש כל כך אבל המבחנים *קשים*. ממוצע מועד א' 70 אחרי הפקטור המוזר וממוצע מועד ב' 67 אחרי פקטור של 3 נקודות. מתחושות שלי ושל חברים שלקחו את הקורס הסמסטר, מאוד קשה להתחבר לחומר ובשורה התחתונה- לעבור ולסיים עם זה.", "timestamp": 1646846020165}, {"author": "Yonez", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: \nההרצאות היו משמימות ומייגעות (רוב הסטודנטים בכלל לא הגיעו אליהן) וכל הקורס מועבר עם מצגות (מה שנראה לי די הזוי בקורס מתמטי).\nיובל מרצה לא מוצלח ולא ברור בכלל. \n\nשם המתרגל/ת: אילן/גלעד\nחוות דעת - תרגולים: \nבתחילת הסמסטר הלכתי לתרגולים של אילן, סך הכל מתרגל סבבה, הוא מעביר את התרגול עם מצגות והוא די מובן וברור ולרוב נשאר זמן בסוף התרגול לעבור על שאלות נוספות ממבחנים. \nבהמשך עברתי לגלעד, שבניגוד לאילן כותב על הלוח ולא עובד עם מצגות שבעיני זה הרבה יותר מוצלח (קל יותר לעקוב אחרי המהלכים הלוגיים ולכתוב תוך כדי התרגול) גלעד מאוד אכפתי וממש חשוב לו שהסטודנטים יצליחו ויבינו היטב, אבל התרגולים שלו תמיד נגמרו הרבה מעבר לשעה שהוקצאה להם והוא היה בפיגור של תרגול אחד משאר המתרגלים\n. \nשעורי הבית: \nשיעורי בית לא חובה ובלי ציון פעם בשבועיים כזה.  ההגשות הן בזוגות ונועדו בעיקר לתרגול וכדי לקבל פידבק על פתרון. \nחשוב לעשות אותם גם אם הם לא חובה כי בלי התרגול הזה קשה להבין את החומר באמת. \n\nהמבחן: מועד א' היה רצחני.  החלק הראשון שלו היה  קל אבל 2 השאלות האחרונות היו שאלות ברמת קושי מאוד גבוה\n\nהשורה התחתונה: \nבעיני קורס לא מאוד מעניין (לא התחברתי לענף הזה במתמטיקה) ולא מאוד עמוס, חד משמעית לא מומלץ לקחת עם פילמוס את הקורס (או לקחת ולראות הרצאות מוקלטות של מרצים אחרים)", "timestamp": 1646915017555}, {"author": "אורגו", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: לא יודע אם זו יכולת הוראה או חוסר חשק ללמד אבל אני פרשתי להקלטת מהר מאוד\n\nשם המתרגל/ת: גלעד\nחוות דעת - תרגולים: היה כיף לבוא ללמוד איתו, עוזר לחלשים ומאתגר את החזקים ולא הכי מפוצץ אצלו. נתן נקודות וטיפים כל הזמן עם מלא ניסיון בקורס.\n\nשעורי הבית: כדאי לפתור בזוגות\n\nהמבחן: הייתה גם אלגברה במבחן, מפתיע\n\nהשורה התחתונה: נחמד, אבל יותר קשה משנדמה לכם אז תשקיעו", "timestamp": 1647803043235}, {"author": "תלמידה", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: מסביר את החומר בצורה לא ברורה. אך שווה לתת עליהן דגש וללכת כי החומר שם מופיע במבחנים.\n\nשם המתרגל/ת: גלעד צ'ייס\nחוות דעת - תרגולים: אחלה מתרגל, התרגולים לרוב גולשים מעבר לשעה לפעמיים גם שעתיים.\n\nשעורי הבית: לא פשוטים, שווה ללכת לשעות קבלה בהן פותרים אותם.\n\nהמבחן: קשה ביותר, בעיקר עם פילמוס יש דגש על הרצאות ועל אלגברה א ועל חומר שפחות נותנים עליו דגש בתרגולים. \nרצוי לחזור על כל החומר של ההרצאות\n\nהשורה התחתונה: קורס קצת מטעה, במהלך הסמסטר אין יותר מידי השקעה ועומס אך מבחן קשה, ולעיתים קרובות המרצה נותן שאלות יצירתיות שקשה לפתור.", "timestamp": 1648044612488}, {"author": "אורי דקל", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יובל פילמוס\nחוות דעת - הרצאות: מצד אחד מרצה מאוד נחמד שמסביר על דברים בצורה מעניינת, אבל מצד שני החומר טיפה מפוזר והרבה מההוכחות לא לגמרי מובנות ולא ברור מה יותר רלוונטי למבחן ומה פחות.\n\nחוות דעת - תרגולים: לא מציגים חומר חדש אבל עוזרים להבין טוב מאוד את החומר מהקורס, ממליץ לראות עד כמה אתם מצליחים לפתור תרגילים ולפי זה להחליט אם שווה ללכת.\n\nשעורי הבית: שיעורי הבית הכי מעניינים שהיו לי, קשים אבל במידה סבירה, ומבחינת הגשה הם לא חובה וגם אין הרבה פידבק. כדאי לפתור את כל השאלות בעל פה ולהתאמן על כתיבה פורמלית לפחות בחלק מהשאלות.\n\nהמבחן: המבחן יחסית קשה, בייחוד בנושאים של משפט קיילי ומטריצות של גרפים. חשוב לכסות את כל הנושאים והמשפטים ולוודא הבנה של ההוכחות מההרצאות. היתרון הוא שיש כמות עצומה של מבחני עבר שאפשר לעבור עליהם.\n\nהשורה התחתונה: קורס מאוד כיף ומעניין, אבל המבחן לא קל בכלל וחשוב לוודא שמבינים את כל החומר", "timestamp": 1648564916698}, {"author": "Mike Alexandrovsky", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: לב יוחננוב\nחוות דעת - הרצאות: הרצאות מעניינות, מועברות בצורה טובה, עם אווירה קלילה ונחמדה. מובאות הוכחות משכנעות לכל הטענות.\n\nשם המתרגל/ת: דניאלה בר לב (הקלטות מסמסטרים קודמים)\nחוות דעת - תרגולים: כותבת על טאבלט מסודר וברור, פותרת שאלות ומסבירה הכל מצוין. בנוסף חוזרת על חומר מההרצאה לפני תחילת פתירת השאלות.\n\nשעורי הבית: כמעט כל השאלות ממוחזרות מסמסטרים קודמים. הרבה שאלות מובאות ממבחני עבר לכן זה מכין טוב לקראת המבחן. נבדקות רק שתי שאלות מכל הגיליון והציון בינארי אבל על השאלות שנבדקו יש משוב מפורט.\n\nהמבחן: קשוח.\n\nהשורה התחתונה: קורס נחמד.", "timestamp": 1657376959680}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: איתן יעקובי מוקלט\nחוות דעת - הרצאות: \nמסביר יחסית בסדר, הסמסטר המרצה האחראי היה נאדר אז לפעמים החומר בהקלטות לא היה 100% מה שהעבירו בכיתה אבל קרוב מספיק.\n\nשם המתרגל/ת: דניאלה בר לב - מוקלט\nחוות דעת - תרגולים: \nמתרגלת ממש טובה, לא הסתדר לי במערכת ללכת פרונטלי וזה היה ממש מספיק.\n\nשעורי הבית: \nשאלות טובות לתירגול עוזרות להטמעת החומר - חבל שבניגוד לשנים קודמות הן לא ממש מזכירות את השאלות בבחינה.\n\nהמבחן: \nלא ברור מה עובר על סגל הקורס בשני הסמסטרים האחרונים, בניגוד ל5 השנים בקודמות (שזה בערך טווח הבחינות שיצא לי לנסות לפתור) הבחינות החל מסמסטר שעבר הפכו לטריקיות, מאוד \"חידתיות\", לא קשורות כמעט לשיעור בית. במקום בעיות קומבינטוריות קלאסיות של סידורים נותנים לנו לפתור חידות שמורכבות גם כן מהגדרות של קבוצות מה שמוסיף קושי, מבלבל ומסתכל.\nשינוי תמוה ממש, אני יודעת שאם הייתי נגשת לבחינה שנה שעברה הציון שלי כנראה היה עולה ב20 נקודות... פשוט עצוב.\nזאת גם התחושה הכללית של שאר הסטודנטים שיצא לי לדבר איתם.\n\nהשורה התחתונה: \nהמבחנים מהשנים הקודמות והמבחנים מהשנה הנוכחית הם רכיבי קשירות שונים.\nאיך לסכם את הבחינה במילה אחת: ....11111111111111111\n(המבין יבין)", "timestamp": 1658483893617}, {"author": "לספור זה קשה", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: לב יוחננוב/איתן יעקובי הקלטות\nחוות דעת - הרצאות: בהתחלה הייתי בהרצאות של לב מחוסר ברירה בגלל המערכת. אחרי כמה הרצאות של טיעונים לא משכנעים ולא ברורים עברתי להקלטות. אני אישית חושב שלב לא מסביר טוב והעובדה שהקורס מלומד דרך מצגת שנורא קל לרפרף עליה לא תורמת. עם זאת אני די בטוח שהייתי בהכרה רק בחצי מזמן כל הרצאה כי זה לא המקצוע הכי מרתק, אז אולי אני לא מקור אמין. איתן יעקובי מעביר את החומר בסבבה, מס ביר טוב והכי חשוב מהיר פי 2.\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: \nאילן אחלה מתרגל וכנראה שבלעדיו לא הייתי מבין את החומר מעבר להרצאה הראשונה, מתעכב ומוודא שכולם מבינים בניגוד מוחלט להרצאות.\nשעורי הבית: \nסבבה, לא עמוסים.\nהמבחן: \nלא משנה כמה תלמדו בסוף לא תבינו אם יש חשיבות לסדר או אין ותטעו, למזלי במבחן הנוכחי זה לא קרה ובמקום זה התברכנו בשאלה ש99 אחוז מהאנשים כתבו עליה אני לא יודע.\nהשורה התחתונה:", "timestamp": 1658500364672}, {"author": "סטודנט מיואש", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: איתן מוקלט\nחוות דעת - הרצאות: \nמרצה טוב, מסביר בצורה ברןרה יחסית, יש הרצאות שהייתי צריך לראות פעמיים כדי להבין באמת מה הולך שם כי למרצים באופן כללי יש נטייה לפעמים לדפדף על שקופיות וקצת קשה לעקוב אחרי זה לפעמים.\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: מתרגל טוב, חשוב לו שאנשים יבינו באמת את החומר, הלכתי גם לסדנאות שלו על הגיליונות, מה שממש עזר לי להבין טוב יותר את החומר ואת הגישה לפתירת תרגילים.\n\nשעורי הבית: \nרוב השאלות פתירות, חלקן טריקיות אז גם אם פתרת חשוב לוודא שבאמת הגעת לתשובה נכונה. בגדול מכל הגיליונות היה במבחן סעיף קטן של 7 נקודות שהזכיר שאלה מהגיליונות, אבל שאר השאלות היו ממש שונות.\n\nהמבחן: \nכמה קווים כללים שמתארים את המבחן - \nהייתה שאלה אחת על מספרים ראשוניים שאף אחד כמעט לא הצליח לפתור והייתה שווה 9 נקודות.\nבכללי, כמעט לכל שאלה שדרשה פתרון בעית סידור היו לפני כל מיני הגדרות של קבוצות, חיתוכים, פעולות בין קבוצות וכו'. ברור שכסטודנט מצופה ממך להתמודד עם דברים כאלה, אבל זה הופך את השאלה לפי 2 קשה יותר, וזה גם בעייתי, כי בכל המבחני עבר לפני סמסטר חורף האחרון וגם בכל הגיליונות בעיות הסידור היו סיפור מילולי - הגיעו סטודנטים לקולנוע, רוצים לחלק להם x, יש אי עם ערים, רוצים לחבר אותם בגשרים. יש כדורים.. וכו'. אז אתה בכלל לא מבין מאיפה זה נופל עלייך פתאום. \n\nהשורה התחתונה: \nעד סמסטר שעבר היה מבחן סבבה יחסית למה שקורה כאן עכשיו. גם נראה שמלא חוזרים על הקורס בגלל מה שקרה בסמסטר קודם עם המבחן (שגם היה בעייתי). בקיצור, לא ברור מה קורה עם המבחנים בשני הסמסטרים האחרונים אבל מישהו צריך לעשות עם זה משהו.", "timestamp": 1658553799994}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יעקובי מוקלט\nחוות דעת - הרצאות: מרצה ממש ממש טוב. הרבה יותר טוב ממרצה אחראי מסוים ששמו מתחרז עם קאדר\n\nשם המתרגל/ת: אילן ארד דורון חיים\nחוות דעת - תרגולים: המתרגל הכי טוב שיש!! מקסים, מהיר, מסביר מעולה ומוסיף המון. שווה ללכת!\n\nשעורי הבית: חמודים, לא קשים מידי\n\nהמבחן: ברמה סבירה, לפעמים יש שאלות קשות מידי (קרה כבר כמה סמסטרים) אבל שאר המבחן בהחלט פתיר ואפילו סביר אם לומדים כמו שצריך. מומלץ לתרגל כמה שיותר מבחנים כדי לראות הרבה רעיונות. \n\nהשורה התחתונה: קורס קליל בסמסטר, פחות במבחן", "timestamp": 1658627497500}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: נאדר בשותי / איתן יעקובי (הקלטות)\nחוות דעת - הרצאות: אם לא בא לכם לבוא להרצאה פרונטלית כדי לשמוע את נאדר מקריא לכם את המצגת מהאתר, ממליצה על הקלטות של איתן יעקובי. מסביר די טוב סה\"כ והרוב רלוונטי. אפשר לגשר בקלות על ההבדלים.\n\nשם המתרגל/ת: אלמוג צור\nחוות דעת - תרגולים: מסביר נחמד סה\"כ וכן שמח לענות על שאלות. לפעמים קצת מסתבך עם עצמו או נעלם כשהוא כותב לעצמו דברים בלי להסביר יותר מדי. ממליצה גם על עדי, היא באמת תותחית אבל קצת רצה אז קחו בחשבון למי שפחות מתאים.\n\nשעורי הבית: אותם גיליונות כבר בכמה שנים האחרונות. כדאי לנסות לבד כדי כן להטמיע את החומר, אבל אפשר להיעזר ברפרנס כי הם באמת לא קלים.\n\nהמבחן: חוץ מסעיף אחד מהשטן, היה הוגן. הוגן אבל לא קל, תתרגלו כמה שיותר מבחנים, כמה שיותר מוקדם.\n\nהשורה התחתונה: סגל הקורס לא מספק יותר מדי תמיכה, וגם שעה בתרגול בשבוע לא באמת מספיקה. תדאגו בשביל עצמכם להיות כל הזמן על החומר ולתרגל כמה שיותר.", "timestamp": 1659099041414}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: הרצאות מזעזעות , נאדר פשוט מקריא מהמצגת בלי ממש להסביר. אם בא לכם לראות מישהו קורא מהמצגת מולכם זה אחלה הרצאה. איכשהו הוא מסיים את ההרצאה חצי שעה לפני הזמן ( כי הוא מוציא דוגמאות מהמצגות שאין לו כוח כנראה להעביר ) \nהרצאה אחרונה הוא סיים אחרי 15 דקות ואמר \"מי שרוצה מוזמן לבוא לשעת קבלה במקום ההרצאה, אבל לא לבוא בין 11:30 ל 12:00 אני רוצה ללכת לאכול \" \nאין לי מילים, פשוט אל תלכו אליו עצה שלי\nיש את המוקלטות של איתן , הם יחסית טובות\n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: \nעדי מתרגל מעולה, ממש שמחתי ללמוד אצלה , היא מתעכבת בשביל הסטודנטים עד שכולם יבינו , וגם היא עדיין מספיקה את כל החומר.\nהם בד\"כ מראה איך לפתור באופן רשמי כתשובה מלאה במבחן, ומעבירה את הרעיון של איך לפתור שאלות\n\nשעורי הבית: לפי דעתי שיעורי הבית הם ארוכים , יש בד\"כ הרבה שאלות 6-9. רמת הקושי משתנה בין תרגיל לתרגיל , יש כמה לא מובנים , ויש כמה סבירים \nבסה\"כ , נחמדים\n\nהמבחן: מזעזע.\nהמרצה האחראי ( נאדר ) כנראה הוא בכלל לא כתב את המבחן ונתן למתרגלים לכתוב אותו.\nבכל מקרה יצא מבחן ששונה בצורה שלו , שאלה 1 הייתה הרבה יותר מסובכת כי הכניסו גם קבוצות אליה וזה מעלה את רמת הקושי.\nהניקוד על השאלות ממש שונה , 4 נקודות אם אני זוכר נכון על שאלת הוכחה קומבינטורית ( בדיחה )\nשאלה 2ג - בהצלחה למי שרוצה לפתור אותה ( 90% + ) לא הצליחו אותה\nכל השאר המבחן סביר\n\nהשורה התחתונה: \nהייתי נהנה הרבה יותר מהקורס אם היה מרצה יותר נורמלי ,\nהחומר אפשר להתחבר ואפשר שלא , אני התחברתי לחלק גדול ממנו, אני חושב שזה קורס די מעניין", "timestamp": 1659414692205}, {"author": "Nobody", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: הלך יד ביד עם המצגות, אבל הייתה אווירה טובה בכיתה והוא מתעכב עם סטודנטים שלא הבינו.\nבסוף החומר עצמו לא ככ מסובך להבנה, ולכן ההרצאות היו יותר באיזי.\n\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: אחלה מתרגל, היינו קבוצה די קטנה שזה היה נחמד, אבל היו דברים שהוא לא הספיק שזה יצר אצלי קצת פער למבחן.\nסהכ ממליץ.\n\nשעורי הבית: קשים וארוכים מאד אבל מומלץ לנסות לבד ואז להגיע לסדנה של אילן אחרי שלא מצליחים.\nסדנה של שעה וחצי פעם בשבועיים והוא עובר על כל הגליון.\nהשב נותנים שתי נקודות בסופי, שזה הרבה\nהמבחן: מבחן קשוח, קצת שונה מהמבחנים הקודמים שהיו.\nהיה הרבה תורת הקבוצות והשאלות בחלק של קומבי היו מסובכות יותר מרוב המבחני עבר.\nבחלק של הגרפים זה היה די סבבה, אותו קו עם המבחנים בשנים האחרונות.\n\nהשורה התחתונה: קורס סבבה סהכ, החלק הראשון זה כמו חידות.", "timestamp": 1659424319624}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: נאדר חזק מאוד בחומר.\nקצת קשה להבנה, אבל ההסברים על הלוח, מחוץ למצגת, מאוד עוזרים.\n\nשם המתרגל/ת: עדי\nחוות דעת - תרגולים: מתרגלת סבבה.\nבאופן כללי היה נראה שסגל המתרגלים לא מדהים, חלק מזה שהחומר מאוד מבלבל.\nעדי מאוד השתדלה שנבין והיה אחלה.\n\nשעורי הבית: גיליון פעם בשבועיים. לוקח כמה שעות בממוצע.\nחייב לציין שהבדיקה הייתה יחסית דקדקנית והיו פידבקים יחסית מפורטים על מה שנבדק.\n\nהמבחן: היה די קשוח אבל אפשרי, שימו לב לכל דקות קטנה\nלפעמים מספר הנקודות יכול לרמוז על דרך הפתרון (הרבה נקודות בדר\"כ זה הכלה והפרדה, אבל תזהרו עם זה)\n\nהשורה התחתונה: \nבעיות ספירה - כדאי להתעכב על הדקויות (עם חזרות/ בלי חזרות...) כי זה מסתבך בהמשך.\nגרפים - הרבה דרכי פתרון שחוזרות על עצמן (יצירה של מעגל...).", "timestamp": 1661074244339}, {"author": "אלחנן בלוך", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יובל פילמוס (הקלטות)\nחוות דעת - הרצאות: ברור שהמרצה אוהב את החומר, ולי זה היה כיף. אבל הוא לא בהכרח מסביר הכי טוב...\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: מסביר ברור ולאט. אבל לפעמים הוא יחסית מדלג על נקודות שלדעתי הן ממש לא מובנות מאליהן. אבל תמיד אפשר לשאול, והוא עונה בשמחה.\n\nשעורי הבית: אחלה. לא דורשים השקעה מוגזמת, וגם מכינים למבחן בצורה יחסית טובה.\n\nהמבחן: לנו היה מבחן מוזר, הוא התמקד בנושאים יחסית שוליים, ודילג על נושאים חשובים. מבחינת הרמה הוא היה בסדר...\n\nהשורה התחתונה: קורס חביב. את רוב החומר יחסית קל להבין אינטואיטיבית (חוץ מפונקציות יוצרות), ולכן אם קצת משקיעים אפשר לעקוב ולהפנים את החומר.", "timestamp": 1664653114634}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202103", "text": "שם המרצה: מצגות\nחוות דעת - הרצאות: \nלא הייתי/צפיתי, אבל שמעתי שהמוקלטות של איתן יעקובי טובות.\nשם המתרגל/ת: מצגות\nחוות דעת - תרגולים: -\n\nשעורי הבית: שישה גיליונות, לוקחים כמה שעות טובות לגיליון. יש רפרנסים כמעט לכל השאלות והבדיקה היא עובר בינארי אז אין מה לדאוג מהם, אבל כן ממליץ לקחת אותם ברצינות ולוודא שמבינים.\n\nהמבחן: \nנראה שבשנה האחרונה די שינו את הפורמט של המבחנים. חלק מהשאלות הן פחות תבניתיות וממוחזרות מאשר בשנים קודמות ודורשות המון חשיבה יצירתית בשביל לפתור אותן כמו שצריך. לא יודע אם הפורמט הזה ימשיך אבל אני מאוד ממליץ לפתור מבחני עבר של 2022 בשביל להיות מוכנים לכל תרחיש.\n\nהשורה התחתונה: \nקורס תיאורטי ומעניין, מבחן לא פשוט.", "timestamp": 1666722056748}, {"author": "קירקהוף", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: איתן יעקובי מוקלט\nחוות דעת - הרצאות: \nבסמסטר שלנו כמעט כולם צפו במוקלטות של יעקובי. שני המרצים ההאחרים היו לא מוצלחים.\n\nשם המתרגל/ת: גלי מוקלט\nחוות דעת - תרגולים: \nגלי ממש טובה, מסבירה בצורה מובנת וקל לעקוב אחריה. במוקלט היא לא מדלגת על אף תרגיל גם אם התרגול גולש מעבר לזמן. \n\nשעורי הבית:\n6 גיליונות, הגשה לא חובה אבל אם מגישים מקבלים על ה- 4 הראשונים חצי נקודה בונוס לציון הסופי. אפשר לצבור עד 2 נקודות בונוס ככה. לוקח כמה שעות לפתור כל גיליון אבל ממש חשוב לעשות את זה כי השאלות במבחנים לפעמים דומות לשאלות שיעורי בית.\n\nהמבחן: \nמועד א לא היה פשוט בכלל והציונים היו לא טובים, אז יצא שהרבה אנשים נגשו למועד ב שהיה ממש זוועה מבחינת רמת הקושי. לא מעט ממי שעברו את מועד א ונגשו כדי לשפר חושבים שהם יכשלו במועד ב. מבחן ארוך בצורה לא הגיונית עם שאלות ממש יצירתיות שלאף אחד אין זמן להתחיל לחשוב על איך לפתור אותן כשיש רק 3 שעות. בקיצור המבחנים בשנה האחרונה ממש על הפנים וחבל.\n\nהשורה התחתונה: \nלהתפלל שתעברו כי זה קדם למבני נתונים.", "timestamp": 1666762909957}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: איתן יעקובי (הקלטות)/לב יוחננוב\nחוות דעת - הרצאות: רוב הסטודנטים צופים בהקלטות של איתן. הן סבבה לגמרי ואפשר ללמוד באמצעותן את כל הקורס (גם יש ביוטיוב סרטונים של גדי אלכסנדרוביץ (מתמטיקה דיסקרטים למדעי המחשב)- עוזר מאוד לחזרה נקודתית. \nהלכתי לכמה הרצאות של לב. לפעמים הוא לא כל כך ברור אבל הוא תמיד מסכים להסביר שוב פעם, והסתדרתי גם איתו. \n\nשם המתרגל/ת: אילן שם משפחה ממש ארוך\nחוות דעת - תרגולים: מתרגל נהדר. מסביר מעולה ומספיק הרבה יותר מכל האחרים. לפעמים הוא רץ על החומר ולכן חשוב לא להתבייש ולשאול. הוא תמיד שמח לענות ולהסביר שוב. \n\nשעורי הבית: לא קלים, אבל הם עוזרים להטמעה של החומר. אם לא מצליחים - ללכת לסדנאות של אילן!! הוא מספיק לפתור את כל הגיליון בשעתיים, שאלה אחר שאלה, כולל הסברים!!\n\nהמבחן: סביר לגמרי. לפתור כמה שיותר מבחנים משנים קודמות. הרגיש לי שהמבחנים קשים יותר מרוב השאלות בתרגול/ש.ב (לא להיבהל מזה!) אבל אם פותרים הרבה מבחנים נופל האסימון. \n\nהשורה התחתונה: לא קורס פשוט. חשוב לוודא שמבינים את החומר. לא מספיק להבין את הפתרון הנכון, צריך לדעת למה תשובות אחרות שגויות - ובשביל זה צריך להשקיע. אבל החומר מעניין וזה היה הקורס שהכי נהניתי ממנו עד עכשיו", "timestamp": 1667111017161}, {"author": "אופק גינת", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ראובן בר יהודה - יוטיוב\nחוות דעת - הרצאות: מרצה מעולה, הרבה יותר מובן מכל שאר המרצים שהעבירו את הקורס הזה והוקלטו בשנים האחרונות\n\nשם המתרגל/ת: התרגולים הישנים המוקלטים בפנופטו + גלעד מוקלט\nחוות דעת - תרגולים: עשה את העבודה מצויין.\n\nשעורי הבית: צריך להגיש 4 גליונות בשביל 2 נקודות מגן. הכל מרופרנס\n\nהמבחן: 0% טכניקה 100% הוכחות ותאוריה, פשוט לפתור חידות. יש לא מעט תרגילים שהם פשוט לא פתירים. בדיקה רצחנית\n\nהשורה התחתונה: קורס מעניין מאוד, מבחן על הפנים", "timestamp": 1675348731528}, {"author": "שירה מאירי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נאדר בשותי\nחוות דעת - הרצאות: ההרצאות היו ממש חמודות לדעתי. כן, נאדר מקריא מהמצגת, אבל זה בעיקר כי אין השתתפות של הסטודנטים. גילוי נאות, הצטרפתי לקורס בשבוע החמישי לסמסטר. ברגע ששאלתי שאלה נאדר היה מאושר להסביר, לפרט, לחזור ולהוסיף כמה שצריך עד שאבין היטב את החומר. למרות השאלות שלי, ההרצאות שלו עדיין הסתיימו לפני הזמן והרגישו קלילות ויחסית חמודות. פשוט צריך לשאול שאלות עד שמבינים והוא יענה בשמחה :)\n\nשם המתרגל/ת: עדי אמוזיג\nחוות דעת - תרגולים: וואו! היא מ ד ה י מ ה! כל כך נהנתי מהתרגולים שלה, הם עברו לי בכיף ומהר, היא הספיקה לענות על שאלות, לשתף את הכיתה ותמיד לתת את התחושה שמותר לעשות טעויות והכל טוב ככה לומדים. היא עשתה הכל כדי שהכיתה תהיה נעימה ומעולם לא נתנה תחושה רעה אם ההסבר שלה היה לא ברור למישהו או שמישהו נתן תשובה לא נכונה, רק שאלה אותנו שאלות עד שנוכל להבין איפה הטעות או מה לא ברור. היא הספיקה את כל החומר לאורך הסמסטר והשעות קבלה שלה הן פשוט זהב! רק ללכת אליהם כמה שיותר, אפילו אם רק לשבת להקשיב לשאלות של אחרים. אני צריכה בקורס הזה ציון מאוד גבוה בגלל ענייני אפיק מעבר והיא הייתה מאוד תומכת ואכפתית ומאוד הרגיעה אותי בשעות קבלה שלה ונתנה לי את התחושה שציון כמו 92 הוא מטרה אפשרית.\nבאופן קבוע היא הספיקה את כל החומר לתרגולים שלה, תוך כדי שהיא מעודדת אותנו לשאול עד שנבין ולנסות לענות על השאלות בעצמנו😇\nהיא קודם כל בת אדם!❤️\n\nשעורי הבית: גיליון פעם בשבועיים, לא לוקחים הרבה זמן בכלל אבל הגשה חובה עם שותפים. ממליצה לבחור שותף שיש לכם כימיה מינימלית איתו. לא הייתה לי כימיה מי יודע מה עם השותף והרגשתי שאני שורפת זמן בללמד אותו הרבה מהחומר במקום להגיש את הגיליון ולהמשיך למטלות ודברים אחרים שאני צריכה להספיק. יש סדנאות לשיעורי בית שלא יצא לי ללכת אליהם, אבל שמעתי שהן מעולות, כמובן שתמיד גם אפשר להיעזר בשעות הקבלה. השיעורי בית חשובים יחסית כי יכולה להיכנס שאלה מהם למבחן והם בדרך כלל מקיפים הוכחות ותרגילים ברמה בסיסית בנושא שעוזרים לבסס הבנה. השאלות בתרגילי בית כמובן הרבה הרבה הרבה יותר קלות מהמבחן ולא משקפות את הרמה של המבחן בסוף. מסקנה: השיעורי בית הם כלי לימודי, חשוב להגיש אותם כי יש בונוס של חצי נקודה על כל גיליון שמגישים (עד מקסימום של שתי נקודות) ומקבל ציון עובר. ציוני השיעורי בית הם בעובר או לא עובר. לא עמוס בכלל במהלך הסמסטר.\n\nהמבחן: המבחן היה כתוב באופן מבאס קצת.\n65-70 נקודות בתוך ארבע שאלות שהיה קל להשיג וכללו שאלה מהשיעורי בית ושאלות קלות יחסית שהיה מאוד פשוט לענות עליהן. ה30-35 נקודות האחרות היו הרבה הרבה פחות טריוויאליות ומאוד טריקיות (כנראה כדי להימנע מלתת פקטור על המבחן). מקווה שבכל זאת יהיה פקטור כי אני צריכה ציון גבוה בקורס הזה. חשוב מאוד לפתור קודם את השאלות הבאות בקלות כדי ששאר הזמן יהיה פנוי להתעסק עם השאלות המורכבות יותר משמעותית.\n\nהשורה התחתונה: קורס בסדר יחסית, מרגיש קצת כמו פתרון חידות - רק שנותנים כלים שיעזרו לנו לגשת לפתרון המיטבי שלהן. דורש יצירתיות והמון תרגול לפני המבחן. ממליצה להתחיל לטפטף פתרון מבחנים כבר בחודש האחרון לסמסטר עם מבחן בשבוע ובשבוע האחרון של הסמסטר להיכנס לחרישה רצינית כי חייבים לראות כמה שיותר שאלות מכמה שיותר סוגים כדי להתמודד עם היצירתיות של כותבי המבחן.\nאל תצפו שלא ימציאו לכם את הגלגל בבחינה, זה הקורס שבו הם מוכיחים שאפשר להמציא את הגלגל כל מבחן מחדש.", "timestamp": 1675524731260}, {"author": "מעריץ מספר אחת של דניאלה המתרגלת", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רוני רוט/איתן יעקובי/יובל פילמוס\nחוות דעת - הרצאות: \nרוני מעביר פרונטלית בצורה ממש אחלה, אחרי שבוע 6~ הפסקתי ללכת להרצאות כי לא הסתדר לי עם העבודה, ניסיתי לראות הקלטות של יובל פילמוס והנ״ל היה איום ונורא. לבסוף ראיתי את ההקלטות של איתן יעקובי, אחלה מרצה.\n\nשם המתרגל/ת: תומר לנג׳ (נראה לי ככה קוראים לו), דניאלה לב\nחוות דעת - תרגולים: \nתומר אחלה, מעביר את החומר בצורה מעניינת וקשוב לשאלות, באופן דומה להרצאות, הפסקתי ללכת פרונטלית עקב אילוצי לו״ז. ההקלטות של דניאלה הדבר הכי טוב שקרה לי, מעבירה את החומר בצורה סופר ברורה ומרגישים שאכפת לה מהסטודנטים.\nשעורי הבית: \nלא קשים במיוחד, למען ההגינות עשיתי רק את ה4 הראשונים כי היתר לא נכנס למגן.\nהמבחן: \nדי פשוט, ממליץ בחום לפתור את התרגילים מהחוברת תרגילים שבאתר (מחולק לנושאים). פתרתי את כולה ולאחר מכן רפרפתי על איזה שני מבחנים והגעתי למבחן מוכן לגמרי.\nהשורה התחתונה: \nקורס בסיסי אבל מעניין, ממש טיפה מגן אז אם יש סמסטר עמוס אפשר לוותר על המטלות.", "timestamp": 1675787195318}, {"author": "מעריץ של הסופר", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: \nבסדר גמור, לרוב מצליח לא לשעמם. \nלפעמים ההרצאות הופכות לפורמליות מדי וזה מקשה לעקוב.\nלרוב החלק הפורמלי לא חשוב כדי להצליח לפתור תרגילים.\n\nהחלק הראשון של הקורס עוסק בבעיות ספירה. החלק הזה לדעתי יחסית סבבה, כמובן אחרי הפנמה.\n\nהחלק השני של הקורס עוסק בתורת הגרפים. \nלדעתי הוא די בעייתי. פתרון תרגילים בו הוא לרוב מילולי ומצריך טענות מדויקות ופורמליות, אך הרגיש שלא תרגלנו זאת מספיק בסמסטר. ממליץ כן להיות קשוב, גם להוכחות הפורמליות הכבדות בהרצאה, רק כדי לספוג את המיומנות הזו.\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: \nממליץ.\nיודע להעביר תרגול טוב, כזה שגורם לסטודנטים לחשוב ולא רק מציג לנו תשובות. \n\nשעורי הבית: \nגליון שבועי, צבירה של עד 2 נקודות תוספת לציון סופי.\nעל פניו כל גליון נראה ארוך, אבל רמת הקושי סבירה ולכן זה לא צורך הרבה זמן. יש רפרנס.\n\nהמבחן: \nהסמסטר היה מבחן הוגן (מועד א׳).\nעם זאת, ממבחני עבר נראה שהמבחנים לפעמים ברמה גבוהה מדי ביחס למה שהיה בקורס ובשיעורי הבית בפרט.\n\nכפי שציינתי לפני כן, אני הרגשתי את הפער הזה בעיקר בתורת הגרפים. הרבה שאלות שדורשות אלגוריתמים שקשה לנסח, או דורשות הוכחה פורמלית ומדוייקת מאוד. מאמין שעם תרגול חזק על הנושא הזה ספציפית אפשר להגיע לרמה מספיקה.\nבמבחנים אחרים הבעיה היא לפעמים דווקא בשאלות בחלק הראשון של הקורס, קורה שיש שאלות ממש מונפצות, אין לי עצה להתמודדות עם זה.\n\nהשורה התחתונה: \nקורס כיפי כמעט בכל חלקיו.\nסגל מסודר.\nעם זאת, מבחנים ברמה גבוהה יותר לפעמים ממה שנחשפים אליו בסמסטר. חשוב לתרגל בצורה יסודית.", "timestamp": 1677052289565}, {"author": "אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: \nבגדול מקריא את המצגת ודי הורגש שלעמוד ולהרצות לנו זה לא הדבר שהכי בא לו לעשות כרגע. אבל! הוא תמיד ענה על שאלות בשמחה והסביר בצורה ממש טובה, ואני כן הרגשתי שיש ערך מוסף להרצאות שלו. ולפעמים היה אפילו מצחיק\n\nשם המתרגל/ת: אילן\nחוות דעת - תרגולים: \nאלוף אלוף אלוף, ממליצה!! נראה לי שהוא מתרגל כבר הרבה סמסטרים וזה הורגש, הוא מסביר בצורה מושלמת לדעתי וממש מכווין לחשיבה שצריכה להיות בקורס ובמבחן. השיעור ממש עובר בפינג פונג בינו לבינינו והוא מעודד השתתפות ואני ממש נהניתי.\n\nשעורי הבית:\nגליון פעם בשבועיים, ממש לא ארוך מדי. מקבלים במגן חצי נקודה על כל גליון, בגבול של עד 2 נקודות. לכן זה מגן די מעפן לציונים הנמוכים אבל מכובד מאוד לגבוהים. הציון על כל תרגיל הוא עובר או לא עובר והם מפרסמים תשובות מפורטות. השאלות ברמה די גבוהה, פחות מבמבחן אבל לגמרי מכין אליו, ממליצה לגמרי לעשות אותם ולהשקיע בהם כי ההשקעה הנדרשת לא מוגזמת אבל הם עוזרים מאוד להפנמה של החומר ולפיתוח החשיבה שצריך למבחן.\n\nהמבחן: \nהמבחן די ידוע לשמצה ברמה שלו אבל אל תיבהלו. לדעתי מי שמשקיע במהלך הסמסטר, משתתף בתרגולים ופותר ומבין את התרגילי בית, יש לו סיכוי לא רע להצליח.\n\nהשורה התחתונה: \nהקורס שהכי אהבתי הסמסטר", "timestamp": 1677103525748}, {"author": "ITZIK", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: הרצאות של איתן יעקובי\nחוות דעת - הרצאות: מוקלטות\nנחמדות, חלק מההסברים שלא התחברתי אליהם אז השלמתי עם ראובן בן יהודה ביוטיוב\n\nשם המתרגל/ת: דניאלה הקלטות מסמסטרים קודמים ביחד עם תרגולים ישנים של דודו בפונפטו\nחוות דעת - תרגולים: לדעתי היו יותר חשובים מההרצאות נתקלים בהרבה טריקים ודברים שחוזרים גם במבחן\n\nשעורי הבית: חשובים מאוד, רוב השאלות הן ממבחנים גם אז זה מכין אותכם לרמה שמצופה\nיש גם שאלה  1:1 מהשיעורי בית במבחן בקטע הזוי, אז תחזרו על כל הגיליונות יום יומיים לפני המבחן כדי שהמידע יהיה זמין בזכרון של הטווח הקצר גם\n\nהמבחן: \nנחמד לא כזה קשה אבל צריך להיחשף למלא טריקים שחוזרים ומבנה של תשובות\nהשורה התחתונה: לא התחברתי בכלל אבל על טעם ועל ריח...", "timestamp": 1679088850618}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: נאדר\nחוות דעת - הרצאות: מרצה גרוע ביותר\n\nשם המתרגל/ת: מוקלטות של גלי\nחוות דעת - תרגולים: מתרגלת מעולה\n\nשעורי הבית: יש 6 גליונות, מתוכם חובה להגיש 4. לא יותר מדי קשים, אם כי טיפה ארוכים וחופרים. ממוחזרים לגמרי. \n\nהמבחן: קשה\n\nהשורה התחתונה: קורס באמת מעניין, נורא נהנתי מהחומר. לצערי המבחן בנוי כולו מכל מיני טריקים והוא גם נורא ארוך- לסיים את כולו ב3 שעות זה לא תמיד אפשרי", "timestamp": 1679773082328}, {"author": "Srp", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: איתן יעקו(מ)בי\nחוות דעת - הרצאות: בחור קצת מבולגן וקשה למעקב. התחרטתי במהלך הסמסטר שלא הלכתי לגדי כי גדי הרבה יותר ברור ומסודר. עם זאת, בחור חביב שדי קשוב לסטודנטים ולפעמים גם משעשע\n\nשם המתרגל/ת: תומר לנגה \nחוות דעת - תרגולים: תומר מתרגל מצויין, מסודר וברור. הוא מאוד מנגיש את החומר וגורם לו להרגיש פשוט יותר. ממש אהבתי את התרגולים.\n\nשעורי הבית: גיליון בשבועיים, סבירים. כדאי לפתור גם אם עושים בזוגות!\n\nהמבחן: קצת ארוך ומייגע, אבל אין מה לעשות\n\nהשורה התחתונה: קורס חובה, ממש חשוב לבאות אז להשקיע בו", "timestamp": 1690881008854}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא ראיתי\nשם המתרגל/ת: ינאי\nחוות דעת - תרגולים: \nמתרגל סולידי, מסביר היטב\nשעורי הבית: \nלרפרנס\nהמבחן: \nקשה, ניתן לעבור גם בלי לראות אף הרצאה\nהשורה התחתונה: \nקורס קליל, אחד מהיותר נעימים שתעברו בתואר \nלדעתי ניתן להוציא ציון טוב גם בלי להשקיע בו כלל והחשיבה שלכם אמורה להספיק במיוחד עם דף הנוסחאות המורחב שיש במבחן", "timestamp": 1691252910358}, {"author": "*", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: \nאיתן כריזמטי, מדבר מעניין ומסביר טוב את החומר. עם ההרצאה הוא מבין שהוא לא מספיק ומאיץ את הקצב אז כמעט תמיד לקראת הסוף לא מבינים כלום. אבל סה\"כ מרצה טוב, גם מביא הרבה עזרים חיצוניים.\n\nשם המתרגל/ת: עדי אמוזיג\nחוות דעת - תרגולים: \nמושלמת! סופר מנוסה, בקיאה בחומר, מסבירה טוב, מעודדת את הסטודנטים להשתתף ולחשוב גם, עונה על שאלות עד שכולם מבינים.\n\nשעורי הבית: \n6 גליונות כמעט לגמרי ממוחזרים. לפעמים לוקח קצת זמן (לא ברמת אינפי 2) אבל ממש כדאי לדעתי כדי להישאר על החומר.\n\nהמבחן: \nסביר, בסוף הקונספטים חוזרים על עצמם אז אם מתרגלים הרבה מבחני עבר אפשר להצליח.\n\nהשורה התחתונה: \nקורס ממש כיפי ומעניין וסגל מעולה. אחד האהובים עליי עד כה בתואר.", "timestamp": 1691507648465}, {"author": "A", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "הרצאות:\nאיתן יעקובי מוקלט בשביל להתעמק ובאמת לעבור על כל החומר, פלוס הסרטונים ביוטיוב של גד אלכסנדרוביץ', וגם הייתי בכמה הרצאות פרונטליות של לב יוחננוב.\n\nבהתחלה ניסיתי רק לקרוא את המצגות וזה לא מספיק בשביל באמת להבין את החומר, יש הרבה דברים שנאמרים בע\"פ ולא כתובים במצגות, וזה נותן אינטואיציה והבנה הרבה יותר טובות, אל תוותרו על זה.\nאיתן יעקובי ממש חזק על החומר, מומלץ.\nאומרים שגם גד טוב, צפיתי ביוטיובים שלו לפני כל שיעור בנושא מסוים, זה סרטונים של כמה דקות בודדות והוא מסביר בצורה ממש קלילה עם אנימציות ודברים, ואז כשהייתי בהרצאה המלאה של איתן זה היה הרבה יותר מובן.\nלב קצת פחות חד על החומר מהאחרים, ולפעמים אפשר להתקיל אותו עם שאלות, אבל הוא באמת בן אדם ממש נחמד אז לפחות האווירה טובה.\n\nגם התרגולים מאוד מאוד חשובים, לצערי ניסיתי כמה ולא מצאתי מתרגל שהתחברתי אליו בסמסטר הזה, מקווה שיהיה יותר טוב אצלכם... בכל מקרה תלמדו ממש טוב את המצגות כי השאלות במבחן מבוססות על התרגילים האלה, וכנ\"ל לגבי תרגילי הבית. ותפתרו הרבה מבחני עבר כדי לקבל חשיבה קומבינטורית וגרפית טובה.\n\nבקשר לאלגברה:\nאינפי1 הוא קדם לקומבי ואיתן ממש מתעקש על זה, ולא ברור לי למה כי חוץ מאיזה אזכור שרירותי של טיילור מתישהו באמצע הסמסטר (ולא באמת היה צריך לדעת מה זה טיילור בשביל החלק הזה) באמת שלא היה שום דבר שקשור לאינפי. מה שכן היה, וזה ממש בסוף הסמסטר, זה הרבה מאוד אלגברה, ספציפית דטרמיננטות. זה חלק חשוב מהנושאים האחרונים של תורת הגרפים, אז מוזר שדווקא אלגברה לא קדם לקומבי. מסתמכים על זה שאנחנו יודעים היטב דטרמיננטות, ואין חזרה משמעותית על זה, אז לדעתי באמת שלא כדאי לעשות קומבי לפני אלגברה, גם אם יש לכם אינפי, כי מי שלא הכיר דטרמיננטות די הסתבך בהרצאה הזאת.", "timestamp": 1693310193449}, {"author": "מעגלי אוילר", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: מרצה מעולה, מעביר את החומר בצורה אינטואיטיבית.   \n\nשם המתרגל/ת: דניאלה מוקלט\nחוות דעת - תרגולים: אישית לא היה לי זמן ללכת פרונטלי אז הצטרכתי לראות מוקלט, דניאלה ממש טובה וחזקה בחומר. מסבירה די טוב. ממליץ.\n\nשעורי הבית: היו 6 גליונית ניתן להגיש 4 מתוך 6. אפשר לרפרנס לא מומלץ. לא קלים(לא ברמה של אינפי) אבל ניתנים לפתירה אחרי קצת התייעצות עם חברים\\מתרגלים.\n\nהמבחן: מועד א' לא ניגשתי\nמועד ב'- היה מבחן יחסית מאוד הוגן, קל יותר ממבחני עבר (יש מצב בגלל המלחמה).\n\nהשורה התחתונה: קורס קליל, מאוד התחברתי לתורת הגרפים, החומר מעניין ולא משעמם. אפשר להצליח בקורס עם ציון גבוה.\nהערה: לדעתי אינפי ואלגברה לא מדד להצלחה בקורס הזה למרות שהם קדמים. אין שום קשר בינם לבין הקורס הזה, למעט פונקציות יוצרות (טורים שלא כלכך נכנסים לעניין של אינפי) וקירכהוף(היה שימוש בדירוג מטריצות ודיטרמיננטה לא כלכך מסובך).", "timestamp": 1702901492147}, {"author": "עידו", "difficultyRank": 4, "generalRank": 4, "semester": "202203", "text": "שם המרצה: איתן מוקלט וראובן בר יהודה ביוטיוב \nחוות דעת - הרצאות: איתן סבבה אבל ראובן זה עולם אחר, פשוט מרצה מעולה. הסרטונים של ראובן ביוטיוב מכסים את רוב החומר ( אפילו כמה נושאים שכבר לא נכללים בקורס) אבל ליתר ביטחון ממליץ לראות במקביל גם את הנושאים אצל איתן לראות שעוברים על הכל \n\nשם המתרגל/ת: דניאלה ועידן מוקלט\nחוות דעת - תרגולים: התחלתי עם דניאלה מוקלט שהיא אחלה אבל עברתי לעידן שהיה מעולה בגדול גם דניאלה גם גלי וגם עידן מעולים במוקלט\n\nשעורי הבית: \nממוחזרים ממש, לא קלים ומומלץ לפתור לבד כי השאלות ממש \nדומות למבחן \nהמבחן: היה מועד קשוח מאוד צריך להתרגל לשאלות הוכחה אבל בגדול אם פותרים מספיק מבחנים אפשר להצליח\nהשורה התחתונה: קורס לא קל בכלל על אף שלא דורש המון במהלך הסמסטר. לוקח זמן לפתח חשיבה קומבינטורית ולהתרגל לשאלות על גרפים אבל סה״כ קורס מעניין וחשוב.", "timestamp": 1703541204909}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: מרצה טוב, כריזמטי, מעביר את החומר בצורה טובה וברורה\n\nשם המתרגל/ת: עמית זריהן\nחוות דעת - תרגולים: מתרגל ממש טוב! לי זה עזר שהוא כתב על הלוח ולא העביר מצגת (זה עוזר לי להבין יותר טוב את החומר). היינו גם כיתה קטנה אז היה לו זמן להתעכב ולענות על שאלות. מסביר ברור ודואג שכולם יבינו.\n\nשעורי הבית: ממוחזרים לגמרי. אפשר לרפרנס הכל. בקושי מגן, אבל כדאי לעשות כדי להיות על החומר במהלך הסמסטר.\n\nהמבחן: ארוך, קצת קשה.\n\nהשורה התחתונה: החומר לא היה לי מאוד מעניין אבל הוא כן חשוב להמשך אז כדאי לוודא שמבינים.", "timestamp": 1704922186510}, {"author": "ש", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: טוב מאוד.\n\nשם המתרגל/ת: תמר כהן\nחוות דעת - תרגולים: היה מאוד טוב, מסביר בצורה מעולה.\n\nשעורי הבית: \nחזרתיים מאוד מסמטרים קודמים ולכן יש המון רפרנסים אבל לא מומלץ. לא היו קשים אבל דורשים קצת השקעה בשביל לתרגל על אופן פתירת שאלות בקומבי והוכחות קומבינטוריות, והיו סדנאות פתירת שעורי הבית, מומלץ מאוד ללכת.\nהם לא חובה, ומקבלים בהם ציון 1 או 0, כל ציון 1 מוסיף חצי נקודה בונוס לסופי, וניתן לצבור עד 2 נקודות בונוס.\n\nהמבחן: \nלא היו קלים, אבל אם לומדים טוב ומתכוננים כמו שצריך היה ניתן לקבל ציון טוב.\n\nהשורה התחתונה: \nקורס מעניין, לוקח קצת זמן להתרגל על החומר והשיטות שלו אבל בעיקר היה נחמד", "timestamp": 1705075592847}, {"author": "noa segev hami", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מרגיש כמו סבא אורי שבא ללמד קומבי... לא דופק חשבון לאף אחד וזה מצחיק אבל היה לי קשה להבין אותו כי הוא מאוד בעולם משלו \nפרשתי למוקלטות של יעקומבי שהוא גם נראה טוב וגם מלמד טוב \n\nשם המתרגל/ת: תומר לנגה\nחוות דעת - תרגולים: וואו מתרגל מצוין \nיודע את החומר ויודע להעביר את החומר, מאוד חשוב לו שכל הסטודנטים יבואו.. סוג של אנדרייטד לא הרבה באים אליו ואז התרגול קטן וזה מושלם\n\nשעורי הבית: גליונות עם רפרנסים, רמה סבירה\n\nהמבחן: מעצבן מאוד וחייבים לפתור את כל השאלות בקומבי אי פעם כדי לנסות להבין וגם זה לא מספיק\n\nהשורה התחתונה: חייבים לקחת אז מה זה משנה?", "timestamp": 1714468025224}, {"author": "גרף סופי (וגם סופני)", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מצחיקול, בן אדם מאוד משעשע, אבל הוא מעביר את החומר בצורה מעניינת מאוד, למרות שהחומר מאוד קשה להבנה.\n\nשם המתרגל/ת: דניאלה מוקלט\nחוות דעת - תרגולים: ממש נחמדה ומסבירה את החומר היטב.\n\nשעורי הבית: \nמעצבנים ביותר וקטנוניים, אבל כדי מאוד לעשות אותם כדי לקבל את הבונוס של 2 נק' לציון הסופי\n\nהמבחן: \nמבחן הוגן אבל קשה, טוב קומבי זה קורס קשה ולא מובן... שיהיה לנו בהצלחה D:\nהשורה התחתונה: קורס ג'חרי אך מעניין וחשוב בשביל שאר הקורסים שתעשו.", "timestamp": 1716557407969}]}