{"posts": [{"author": "עדן", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אלי ביהם\n\nחוות דעת - הרצאות: \nכשההרצאות חיצוניות הן מעניינות אך מונוטוניות מבחינת המידע המועבר. בכל הרצאה חוזרים מחדש על למה חשובה אבטחה.\nהרצאות של מרצה הקורס בקושי היו.\n\nשעורי הבית: \nסופר עמוסים יחסית לנק\"ז האחד שהקורס הזה נותן. שעות של השקעה ובדיקה רצחנית.\n\nהשורה התחתונה: \nמרצה לא מתחשב בסטודנטים. מחפש איך להוריד ציונים ובמקום לגרום לעניין במקצוע, הוא גורם לסלידה ממנו ומהקורסים שאותם הוא מריץ.", "timestamp": 1625350198247}, {"author": "האדם שפיתח AES", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  אלי ביהם\nחוות דעת - הרצאות:\nמשעממות ולא לומדים מהן כלום.\nשעורי הבית: \nנוראיים ארוכים לא קשורים להרצאות ולא שווים 1 נקז\nהשורה התחתונה: \nקורס נורא, אם אתם שוקלים לקחת אותו תפנו לער\"ן.", "timestamp": 1625477895126}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "(לקחתי את קורס זה בסמסטר הראשון שלימדו אותו - יתכן שמבנה הקורס ישתנה בסמסטרים אחרים והוא יהיה מעניין יותר)\n\nשם המרצה:  אלי ביהם\nחוות דעת - הרצאות: בתחילת הסמסטר היו הרצאות (של אלי וגם של מרצים אורחים) שהתמקדו במגוון התקפות שונות שהיו יחסית מעניינות אבל לא הוסברו בצורה ברורה מאוד, ולאחר שהתלוננו על כך סטודנטים, רוב ההרצאות היו רק על נושאים כלליים מאוד ולא מעניינים במיוחד.  \n\nשעורי הבית:  שיעורי בית ארוכים, רובם דרשו להעמיק בחומר שלא למדו בהרצאות (היינו צריכים להקשיב לפודקאסטים / לחפש מידע באינטרנט). היו 4 תרגילי בית (היה חמישי שלא היה להגשה), ובאחד מהם היה תרגיל רטוב. צריך להשקיע, כי שיעורי הבית הם חצי מהציון הסופי והמרצה מוריד יחסית הרבה על טעויות / אי דיוק.\n\nהמבחן:  רוב השאלות פתוחות - צריך ללמוד ולזכור הרבה חומר כדי להצליח , אבל אם לומדים הוא לא קשה מדי. יום לפני המבחן אלי הודיע שמותר דף נוסחאות (חד צדדי, עמוד אחד).\n\nהשורה התחתונה: הקורס עמוס מדי בשביל נקודת זכות אחת, וההרצאות לא מספיק מעניינות - לא הייתי ממליץ לסטודנטים לקחת אותו אלא אם נעשים שינויים משמעותיים למבנה הקורס והחומר אשר נלמד בו בסמסטרים הבאים.", "timestamp": 1625821450106}, {"author": "יגל מימון", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: מעניינות מאד, הרבה הרצאות אורח מגניבות, לעיתים יש מושגים גבוהים. ראוי לציין שהקורס מאד מאד עמוס הרבה מדיי ביחס לנקז בודד יותר מדיי השלמות לבד בבית, פודקסטים וציפייה לדעת הרבה חומר מתקדם \n\nשם המתרגל/ת: אלי ביהם\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 5 תרגילי בית עמוסים מאד שבד\"כ לקחו יותר מדיי זמן ובדרישה לשמוע פודקסטים באנגלית עם מושגים גבוהים בלי שום עזרה בהבנה, זרקו אותנו למים בלי מצופים, בדיקה מאד נוקשה של התרגילים (50 אחוז תקף).\n\nהמבחן: לא עשיתי.\n\nהשורה התחתונה: לא מומלץ בכלל למי שרוצה שהציונים שלו לא ייפגעו, מאד מאכזב, מאד נוקשה.", "timestamp": 1625991346975}, {"author": "סטודנט מאוכזב", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "הקורס לא מתעמק באף נושא שמועבר ולכן הוא לא מעניין.\nהקורס דורש יותר מדי זמן לקורס של נקז אחד.\nגם בשיעורים וגם במבחן המרצה רק מחפש איפה להוריד נקודות בכוח גם כשהתשובה נכונה.\n\nשורה תחתונה:\nלהימנע מהקורס הזה בכל מחיר", "timestamp": 1626097953262}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה:  אלי ביהם\n\nחוות דעת - הרצאות: \nהיו הרצאות מעניינות אבל רוב ההרצאות היו מיותרות.\n\nשעורי הבית: \nשיעורי בית  ארוכים נורא שדורשים מלא השקעה. בשיעורים צריך ללמוד נושאים חדשים לבד ונבדקים בסוף על דעות ולא על עובדות.\n\nהמבחן: \nהמבחן סביר אבל גם כשהתשובות היו נכונות אלי תמיד מצא איפה הוא יכול להוריד.\n\nהשורה התחתונה: \nהקורס מבזבז יותר מדי זמן ופוגע בממוצע.", "timestamp": 1626098235449}, {"author": "נפגע מבוא לאבטחת סייבר 2021", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "לאורך כל הסמסטר השקעתי בקורס רק בשביל שבסוף ירדו לי נקודות על תשובות נכונות וירד לי הממוצע.\nאל תעשו את הטעות שאני עשיתי...", "timestamp": 1626098381486}, {"author": "יוסי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "לא רק שהקורס פוגע בממוצע\nאפילו לא דיברנו על גרון עמוק במהלך הסמסטר\n\nשורה תחתונה:\nהקורס הוא כמו מל\"ג רק שהוא פחות מעניין ולא מעלה את הממוצע", "timestamp": 1626098757400}, {"author": "לא מגזים", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אלי\nחוות דעת - הרצאות: \nרוב ההרצאות הן הרצאות אורח, נוגעות על קצה המזלג בהרבה מושגי אבטחה וסוגי תקיפות ועל חשיבותה של האבטחה במגוון תחומים שונים.\n\nשעורי הבית: \n4 תרגילים יבשים בבודדים, מאוד קלים, בעיקר לעשות העתק הדבק של מושגים מהמצגות. היו 2 תרגילים בהם היה צריך להקשיב ל20 דקות של פודקאסט ולענות על מה דיברו בו.\nהתרגילים לא ארוכים מידי וניתן לסיים כל תרגיל בכמה שעות, אך בשביל קורס של 1 נ\"ז מרגיש שזה יותר מידי.\n\nהמבחן: \nמבחן קל, שאלה אחת על איך נראת מחסנית הקריאות בזמן קריאה לפונקציה, 2 שאלות של בעיקר להסביר מושגים, שאלה רביעית מורכבת מכמה סעיפים אמריקאים שגם די מבוססים על המושגים.\nהיה ניתן להכניס דף עזר למבחן ככה שכל המושגים היו איתנו במבחן והשאלה היחידה שהיה צריך טיפה לחשוב היא השאלה הראשונה.\n\nהשורה התחתונה:\nחומר קל ולא עמוס עם ממוצע גבוה, לא בטוח שרמת ההשקעה שהוא דורש (גם אם היא לא גבוהה) שווה בשביל 1 נ\"ז בלבד. \n\nנ.ב מה שרשמתי סותר את רוב מי שרשם תגובה לפני כי אלו בעיקר אנשים שתסכל אותם כמות ההגשות ולא ניגשו למבחן/רשמו תגובה לפני שנבחנו.", "timestamp": 1626124714894}, {"author": "מבנין עניין", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אלי ביהם\n\nחוות דעת - הרצאות: \nהרצאות אורח מעניינות, אפשר לראות את רובן על מהירות כפולה ולהסתדר (במילא צריך לחזור על ההקלטות מחדש בשביל הש\"ב). ההרצאות של אלי לא נכנסות בכלל לעומק, והוא רק סוקר מלא נושאים שקשורים לאבטחת סייבר. משעמם ומעיק.\n\nשעורי הבית: \nבתחילת הסמסטר אלי אמר שהוא יתחשב בנו כי זו פעם ראשונה שהקורס מועבר, ואז הלך ופיצץ אותנו בשיעורי בית עמוסים מאוד עם בדיקה סופר סופר קפדנית (מורידים חצי מהשאלה על אי דיוק קטן).\n\nהמבחן: \nמשום מה אלי נזכר להגיד לנו 24 שעות לפני המבחן שמותר דף נוסחאות של מושגים (בפונט בגודל 13 ומעלה), חבל שהוא פשוט לא אמר זאת שבוע לפני. על פניו המבחן לא היה קשה אם עשיתם את השיעורים (שהם 50% תקף) ובאתם לכל ההרצאות, אבל הייתה בדיקה קפדנית ומעצבנת מאוד.\n\nהשורה התחתונה: \nקורס לא מומלץ בעליל, להתרחק כמו מאש.\n\nנ.ב:\nהחוות דעת שלפני ככל הנראה שייכת לנציג הסמסטר שלא באמת הפעיל לחץ כלשהו על אלי, אז קחו את כל מה שרשום שם בעירבון מוגבל.", "timestamp": 1626155695799}, {"author": "234493", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "קןרס של נקודה שצריך השקעה קקורס רגיל בפקולטה של 2.5-3 נקודות, יתר על כך ממוצע נמוך קורס מאוד לא ממולץ", "timestamp": 1626521499656}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: הרצאות קצרות שמדברות הרבה מסביב ובתכלס לא מועילות בכלום. מאכזב\n\nשעורי הבית: אתה מצפה שיחסית לקורס של 1 נקז תקבל תרגילי בית בהיקף מתאים. היו עמוסים בטירוף, ודורשים ידע שלא ניתן בהרצאות. רוב העבודה הייתה חיפוש באינטרנט והקשבה לפודקאסטים מתישים ששוב, לא באמת מועילים.\nהייתה חובה להגיש את הגליונות (תקף 50 אחוז- סהכ 4 תרגילים להגשה) ככה שלא באמת יכולת לוותר עליהם ללא פגיעה משמעותית בציון. אלי תמיד חיפש איפה להוריד נקודות, אפילו כשהתשובות היו נכונות, הוריד על ניסוח והמשוב היה מזלזל. (מספר סטודנטים קיבלו אפילו תרגילי בית עם ציון מתחת ל60!). רוב תרגילי הבית קיבלו משוב רק לאחר המבחן.\n\nהמבחן: אני ועוד סטודנטים לא ניגשנו למבחן כדי לא להוריד את ממוצע הציונים ומהבחינה שעדיף \"לא השלים\" מאשר לקבל נכשל.\n\nהשורה התחתונה: לא להתקרב!! הקורס נפתח הסמסטר לראשונה ולדעתי הוא ביזיון.", "timestamp": 1626865670862}, {"author": "שרית חדד", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אליק בליק ביהם\nחוות דעת - הרצאות: הרצאות אורח די מעניינות, גם של אלי סבבה.\n\nשעורי הבית: רוב מי שלוקח את הקורס ומתלונן על העומס לא עשה עדיין קורס של רשימה א', יצא לי כבר לעשות קורס של רשימה א' שהיה 2 נק\"ז אבל ש\"ב פי 5 יותר עמוסים מאלה. \nאכן אנשים ציפו שאם זה 1 נק\"ז לא יהיה ש\"ב או שהם ייקחו שעה, אבל השקעה מאוד סטנדרטית יחסית לרשימה א' (4 גליונות, כל אחד בערך 4-5 שעות השקעה)\n\nהמבחן: היה מותר דף חומר פתוח מה שהפך את המבחן לסבבה, ואת הממוצע הסופי ל-90\n\nהשורה התחתונה: יותר עמוס ממל\"ג מן הסתם (מבחינת ש\"ב), אבל אחלה קורס בשביל להכיר מושגים כלליים בשלב הזה של הלימודים כמו מערכות Embedded, ענן, רשתות, ובכללי על העולם הזה.\nמה שכן פחות מומלץ לדעתי לסטודנטים בסמסטר שני (מי שלא צריך לעשות), לומדים בקטנה על דברים שלומדים יותר לעומק בספרתיות (וגם את\"מ והפעלה), וזה קשה בלי הרקע הזה.", "timestamp": 1627308068140}, {"author": "ש", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אליק בליק ביהם\nחוות דעת - הרצאות: \nמענינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חוזרות על עצמן והן שאלות המבחן \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1660646132402}, {"author": "העוקץ הרוסי", "difficultyRank": 1, "generalRank": 5, "semester": "202302", "text": "שם המרצה: סתיו אלבר ואנשים מהתעשייה\nראשית אחסוך לכם זמן ואגיד שהקורס השתנה המון וחוות דעת קודמות כבר לא רלוונטיות. המבחן קל ובאמצע הסמסטר כך שהוא לא תופס זמן בתקופת המבחנים, והשיעורי בית קלים למדי.\n\nחוות דעת - הרצאות: בקושי יצא לי להיות בגלל קורס מסוים \nשקובע מיליון סדנאות אבל היה נחמד ומעניין כשהייתי. יש כ3 \nשעות תוכן שבהם לומדים עם סתיו והשאר הרצאות אורח מעניינות עם אנשים מהתעשייה.\n\n\nשעורי הבית:  הכי קלים שיהיו לכם בתואר, ברמה של מלג. 2 דפים של 15-20 שאלות, כ5-10 דקות לשאלה, פעם בשבועיים\n\nהמבחן: המבחן קל ברמות אבל הבדיקה קשוחה.\nבמבחן יש 15 שאלות מהן צריך לבחור 10, בסטייל של השיעורי בית. השאלות קלות אבל על חצי מהן הורידו לי 1-3 נקודות בטענה שזה נימוק חלקי. למי שמתכנן לא להגיע להרצאות שיידע שחצימה שאלות  היו על מה היה בהרצאות ועל מושגים שלא נמצאים בחומר\\בשיעורי בית. \n\nהשורה התחתונה: לדעתי קורס חובה לכל מי שבפקולטה למדעי המחשב, גם אם אינו מתכנן להתעסק בסייבר: הקורס מכיר לכם את העולם הזה בדרך קלילה וכיפית, מספק טעימות מקורסי בחירה רלוונטיים, ובעיקר מעלה ממוצע. 90 באפס מאמץ.", "timestamp": 1721649631519}]}