{"posts": [{"author": "SR", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "אחרי שהיו סיפורי אימה על הקורס במתכונתו הישנה, אפשר להגיד שהקורס החדש לגמרי בסדר.\n\nהקורס עוסק ברובו בלימוד שפת אסמבלי, אבל בהמשך נכנסים לנושאים נוספים מעניינים כמו דיבאגר, רשתות, מכונה וירטואלית ועוד.\n\nיש 4 תרגילי בית שמורכבים מחלק יבש ורטוב כל אחד.\nסה\"כ הם לא היו ארוכים מדי ברובם, מה שבעיקר היה קצת קשה זה להתרגל לכתוב באסמבלי. ברגע שתופסים את זה, הדברים יותר זורמים. \nהביקורת היחידה שיש לי לגבי שיעורי הבית (לפחות בסמסטר שלנו) היא שהייתה אי בהירות גדולה מאוד בחלק מהסעיפים מצד המתרגל שכתב אותם, וזה גרר עיכוב לא קטן בהגשה.\n\nהמבחן היה הוגן מאוד.\n\nנ.ב המרצה ערן יהב והמתרגל נועם יפת מומלצים מאוד!", "timestamp": 1590934655000}, {"author": "אסף", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: ההרצאות היו מעולות, אפילו שהחומר יכול להיות קצת אפור ומשעמם לפעמים ערן אחלה בן אדם והעביר אותו לדעתי בצורה טובה.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: בועז מתרגל מצוין! העביר את החומר בצורה טובה מאוד לדעתי, ידע לענות על כל השאלות שנוגעות בחומר התרגול. בדברים קצת מעבר לפעמים היה צריך לבדוק ולחזור אלינו עם תשובה, אבל את העבודה שלו הוא עשה בצורה מצוינת.\n\nשעורי הבית: היו דיי קלילים ולא מעמיסים, לרוב לקח יום-יומיים לפתור את היבש ואותו זמן לפתור את הרטוב. הבעיה הייתה שלסגל לקח מ-ל-א זמן להחזיר ציונים עליהם (אנחנו כבר אחרי מועדי א' ועוד אין ציון לשיעורי בית) אבל כן נתנו פתרונות רשמיים ליבשים.\n\nהמבחן: היה במתכונת מקוונת שזה היה מאוד עמוס ולחוץ בזמן, אבל הממוצע בסוף היה בסדר(76). היו לנו 23 שאלות , מתוכן 1 הייתה חובה והיינו צריכים לבחור עוד 19 שאותן נגיש. רוב השאלות היו אמריקאיות, והשאר היו פתוחות עם הסברים קצרים. המבחן עצמו היה שעה.\n\nהשורה התחתונה: אחלה קורס, הרבה יותר טוב ורלוונטי מהקורס הישן ממה שהבנתי והסגל מצוין", "timestamp": 1597750070970}, {"author": "sari", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: \n10ֿ/10. עם כל הקושי בסמסטר מקוון, ערן העביר את ההרצאות בצורה מושלמת בעיניי. החומר קצת משעמם לפעמים אבל מאוד שימושי לחיים. אחרי כל ההרצאות אני באמת מרגיש שרכשתי ידע רב מהקורס, וזה הרבה בזכות ערן.\n\nשם המתרגל/ת: נטע פרידמן \nחוות דעת - תרגולים: \nהתרגולים מסכמים את החומר וחיוניים לפתירת תרגילי הבית. נטע העביר את התרגולים בצורה טובה מאוד.\n\nשעורי הבית: \nלוקחים המון זמן והשקעה, אבל לומדים הרבה מיומנויות מהם ולא רק חומר.\n\nהמבחן: \nהיה הוגן, היו טריקים שהפילו על דקויות מיותרות בעיניי אבל יכול להיות שהן לא באמת מיותרות.\n\nהשורה התחתונה: \nקורס מצוין, רואים שלערן אכפת שהקורס קודם כל יעניק לנו ידע שימושי לתחום שלנו, והוא משתף פעולה עם הסטודנטים.", "timestamp": 1599330262337}, {"author": "XXX", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: מרצה מדהים, המרצה הכי טוב שהיה לי מתחילת התואר. ממליץ בטירוף\n\nשם המתרגל/ת: נטע פרידמן\nחוות דעת - תרגולים: ראיתי את ההקלטות שהוא העלה והוא היה נהדר, והוא ענה מהר למיילים ששלחתי לו בעקבות שאלות שעלו.\n\nשעורי הבית:  העומס בין התרגילים לא שווה. תרגיל בית 2 היה לא ממש קשור לכלום, אבל חוץ ממנו תרגילי הבית הרטובים היו סבבה, וביבשים נכנסו להרבה דקויות אבל לא ממש כיסחו.\n\nהמבחן: בסוף הממוצע הוא גבוה. בסמסטר קורונה מועד א הרגיש כמו חפש את המטמון כי היה חומר פתוח ולחצי מהשאלות הייתה את התשובה איפשהו בחומר והיה צריך לחפש. במועד ב היה צריך לחפש את הטריק בכל שאלה כי הן נראו מאוד קלות במבט ראשון ובמבט שני אתה מבין שפספסת איזה טריק בשאלה. בסוף מפוקטר לממוצע סבבה.\n\nהשורה התחתונה: קורס חובה, אבל בכל מקרה שווה לקחת כל עוד ערן מרצה אחראי. ההתנהלות של שיעורי הבית והמבחן הייתה קצת ביזיונית כי לא קיבלנו ציון לאף תרגיל בית עד אחרי שבדקו את המבחנים, וגם את הערעורים למבחנים לקח שנה לבדוק, אבל הקורס עצמו מבחינת תוכן חשוב ודי מעניין והסגל יודע להעביר ברמה טוב", "timestamp": 1604412454668}, {"author": "ron", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "חוות דעת - הרצאות: \nערן מרצה מעולה, מעביר את החומר בצורה ברורה ועם דוגמאות בשידור חי שזה נחמד.\n\nחוות דעת - תרגולים: \nיש התאמה בין התרגולים להרצאות, למעט 2/3 נושאים שאין בתרגולים.\n\nשעורי הבית: \nלא עמוסים מידי אם יש שותף טוב, גם מעניינים יחסית במגוון נושאים.\n\nהמבחן: \nמבחן היה בzoom  בחירה של 20 מ23 שאלות אמריקאיות.\n\nהשורה התחתונה: \nאחלה קורס, מעניין מאוד ונותן סריקה כללית על הרבה נושאים בתחומים שונים בלי לרדת לקטנות יותר מידי (חוץ מאסמבלי)", "timestamp": 1609769836961}, {"author": "64 ביט", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: ערן יהב \nחוות דעת - הרצאות: מרצה נחמד, אדיב לשאלות סטודנטים, בדרך כלל ההרצאות היו מועילות אבל לפעמים לא תפסנו את הצדדים הטכניים עד הסוף\n\nשם המתרגל/ת: נועם \nחוות דעת - תרגולים: פצצה ממש. קודם כל הקדיש לנו תרגולים של שעה וחצי כדי שנספיק את החומר ונעשה זאת לאט וביסודיות. היינו קבוצה קטנה וזה היה כמעט כמו שיעור פרטי ואינטימי. היה תענוג בתרגולי הזום, היה עונה על שאלות באריכות ועובר על התהליך עד שנבין כמו שצריך. \n\nשעורי הבית: גם יבשים וגם רטובים, עמוס, טוב שיש הגשה בזוגות. \n\nהמבחן: לא באמת התעניינתי בחומר הקורס ולא היה לי כוח להתכונן כראוי ולהתעמק בפרטי הפרטים בצד הטכני אז היה מה שהיה והמשכתי הלאה. מתכנת באסמבלי או ברמת הקרביים של לינוקס ו/או מעבד אני כבר לא אהיה אז מה. \n\nהשורה התחתונה: טוב זה קורס חובה מה לעשות - לא היה מעניין בתכל'ס. אבל היה סגל הוראה מצוין.", "timestamp": 1610243901196}, {"author": "סטודנט מבסוט :)", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חסן אבסי\nחוות דעת - הרצאות: המרצה בעיקר מדבר על הדברים החשובים שלפי דעתו הסטודנטים צריכים להבין מהחומר הנלמד, על דוגמאות או דברים ספציפים או כל מיני מקרי קצה לא חשובים, לדעתו, הוא עובר מהר מאוד. עונה תמיד לשאלות של הסטודנטים ומשתדל להתעמק איתם מאוד אם הם לא מבינים את מה שהוא מרגיש שחשוב שיבינו (החומר שהוא מתעמק בו יותר). הסמסטר זה סמסטר קורונה, בו הועבר החומר בצורה מקוונת ולכן לדעתי הוא לא הצליח להספיק את כל החומר של הקורס. בנושא של קידודי פקודות הוא עבר מהר (הבנתי שככה גם קרה עם המרצה במסמסטר הקודם, ערן יהב) ולכן החומר של קידוד פקודות אינו שקע אצל הסטודנטים כמו שצריך, זה בעיקר כי החומר הזה מועבר אך ורק בהרצאות כמו נושאים נוספים, למשל איסוף אשפה, רשתות (סוף הקורס), כל מיני דברים שקשורים לJVM ועוד. חשוב להגיע להרצאות, כי אחרת תפספסו חומר שלא יועבר בתרגולים וגם כדי שהוא יוכל לוודא איתכם שהשאלות שעולות לכם עקב החומר הן לא פוגעות בהבנה של החומר הקלוונטי.\n\nשם המתרגל/ת: איתי אילת\nחוות דעת - תרגולים: מתרגל תותח! מבסוט ממנו מאוד, השקיע מאוד בסטודנטים שלו ולא חסך באף דקה שהסטודנטים יבינו ונתן הרבה דגשים לדברים שבד\"כ סטודנטים מפספסים או לא מבינים כמו שצריך. בעיקר הבעיה בתרגולים (לא קשור לאיתי ספציפית) התרגולים לא מותאמים לזמני התקגול (אצלי תרגול היה רק שעה) ולכן כל המתרגלים חרגו מהזמנים ב80% מהתרגולים בסמסטר, זה קרה ככה גם בסמסטר לפני זה. תרגולים 2 ו3 הועברה בצורת \"כיתה הפוכה\" זה כי התרגולים טכניים ומעלים הרבה שאלות קצה שגרמו להארכה של התרגול עצמו (לפי סמסטרים קודמים) ולכן הם החליטו לנסות לבצע אותם בצורה כזאת, בתרגול עצמו הם חזרו בקצרה על החומר ולאחר מכן פתרו תרגילים. שאר התרגולים גם כן, כמו שכבר אמרתי, חרגו מהזמנים בד\"כ וזה כי פשוט יש הרבה נקודות חשובות שיש צורך להעביר ולצער הסטודנטים והמתרגלים (לדעתי ולדעת עוד כמה מתרגלים שהייתי אצלם) לא ניתן לביצוע בזמן המוקצב, אז קחו בחשבון שתרגול לא הולך בפועל 50 דק' אלא לפחות 90 דק'.\n\nשעורי הבית: שיעורי הבית לא עמוסים מידי, אך דורשים מחשבה והכרה טובה של החומר הנלמד. מומלץ מאוד (!!!) מתחילת התרגילי בית ללמוד לדבג עם GDB של LINUX ולא להתבסס על דיבגרים של IDE אחרים. זה בגלל שהתרגילים בנויים על תכנות בשפות נמוכות ודרישה להבין בדיוק מה קורה באותו רגע בזיכרון התוכנית, תבינו את זה כבר בעצמכם כשתיקחו את הקורס.\n\nהמבחן: (בזמן כתיבת החוות דעת עוד לא התקיימה הבחינה). המבחן מתקיים באופן מקוון דרך מערכת המודל והוא יהיה במשך שעה, ולכן השאלות יהיו (ככל הנראה) יותר שאלות הבנה ופחות שאלות טריקים. כמו כן יהיה חומר פתוח בבחינה (נכון לעכשיו מודפס, יכול להיות שבהמשך יוחלף לדיגיטלי). לגבי החומר הפתוח, לדעתי, תחסכו הרצאות ותרגולים, ויותר תשתמשו בסיכומים וכל מיני תזכורות על התהגות של פקודות באסמלי, פרטים קטנים כמו פעולות כלליות של אסמבלר, לינקר סטטי, לינקר דינמי, ג'אוה בייטקוד ורשתות, ממש ממש אין צורך להדפיס את כל החומר! קחו בחשבון שככל הנראה גם לא תהיה לכם אפשרות לקרוא יותר מידי מהחומר הזה אם בכלל לא משנה באיזה פורמט תתקיים הבחינה. במיוחד אם הבחינה תהיה באופן שמועברת אצלינו, בעיקר צריך תזכורות ולא להתחיל ללמוד את כל החומר מ0!\n\nהשורה התחתונה: קודם כל, זה קורס חובה אז תנסו להינות ממנו ולא לסבול! מעבר לזה קורס מעניין מאוד, אני אישית אוהב תכנות LOW-LEVEL ולהבין איך התוכנה שכתבתם ב-א-מ-ת ולהבין כל מיני מקרי קצה שיכולים להיות עקב התפקוד. תבינו איך עובד דיבאגר, איך עובד ניהול זיכרון דינמי מבחינת הקצאות וטיפול בפרגמנטציה של הקצאות. תבינו איך עובד קומפיילר, אסמבל ולינקר. לפי דעתי קורס ממש ממש חשוב! ושווה להבין את החומר הנלמד בו על מנת להיות מתכנת יותר טוב!", "timestamp": 1612292311862}, {"author": "Magneticset11", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חסן עבאסי\nחוות דעת - הרצאות: הייתי צופה בהקלטות של סמסטר קודם של ערן הוא מצויין\n\nשם המתרגל/ת: בועז \nחוות דעת - תרגולים: אחלה של מתרגל\n\nשעורי הבית: איו הרבה עומס חוץ מתרגיל אחד\n\nהמבחן: הרגשתי שהיה קצת קשה מהשנים הקודמות\n\nהשורה התחתונה: קורס חובה אין מה לעשות ואפשר לצאת עם ציון טוב אם לומדים טוב", "timestamp": 1613512929926}, {"author": "אבצ", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "מה לומדים בקורס?\nממש איך המחשב מאורגן ומתוכנת - בעיקר על x86 - אסמבלי, קריאות מערכת, איך פועלים interrupts, לינקינג... גם נוגעים קצת על איך מנוהל הזיכרון, איך עובדת ג'אווה (זה מעניין כי זה בעזרת מכונה וירטואלית) וקצת בסוף על רשתות (אנחנו לא כל כך הספקנו וחסן רפרף על זה בשעתיים).\n\nשם המרצה: חסן עבאסי\nחוות דעת - הרצאות: אחלה מרצה, מתעכב על נקודות שלדעתו ממש חשובות (יכול לחזור על הסבר אפילו 5 פעמים) ומרפרף על דברים פחות חשובים.\nיש אנשים שראו את הוידאו של ערן יהב מסמסטר קודם והבנתי שגם הוא ממש טוב.\nאלא אם יש לכם סיכום טוב (והסיכום של 100+ עמודים שרץ בפייסבוק לא מספיק טוב לדעתי) צריך להגיע להרצאות כי בתרגולים בכלל לא נוגעים בנושאים מסויימים והשקפים לא מובנים מספיק בשביל ללמוד מהם.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: מתרגל מעולה, מסביר הכל ברור, ממליץ בחום.\nהוא לפעמים גלש מזמן התרגול, ובאמת לדעתי צריך לתת לתרגולים יותר זמן.\nלדעתי צריך גם להגיע לתרגולים כי גם בהם לומדים חומר חדש ומעבר לזה הם מאוד עוזרים להבנה.\n\nשעורי הבית: יש עמוסים יותר ויש עמוסים פחות. כל תרגיל מחולק לחלק יבש וחלק רטוב. היבש לוקח בערך 6 שעות והרטוב לוקח בערך 15. בשונה מרטובים במתמ או מבני, אין המון כתיבת קוד אלא יותר דיבוג וניסיון להבין מה בעצם רוצים שתעשה. לדוגמה, בתרגיל הרטוב השלישי היינו צריכים לשנות את ההיסטוריה של ה-bash ככה שיוכל לשמור (תיאורטית) אינסוף פקודות (באופן כללי הוא שומר את ה-500 האחרונות).\nבמסגרת התרגיל היינו צריכים לכתוב בערך 5 שורות קוד אבל לקח המון זמן להבין מה לעשות (וזה בעצם היה התרגיל) שכן זה לא משהו שלמדנו עליו בהרצאות או בתרגולים.\nאבהיר כי שאר התרגילים יותר קשורים לחומר הנלמד\n\nהמבחן: אמריקאי עם חומר פתוח במחשב/מודפס. היה צריך לבחור 20 מתוך 23 במשך 70 דקות. הרעיון הוא שהזמן לחוץ אז אי אפשר לחפור עמוק בחומר הפתוח. זה נותן תחושה שהמבחן מאוד לחוץ כי מה שקורה בפועל הוא שמחפשים הרבה בחומר הפתוח ואז מאוד לחוצים בזמן.\nרוב השאלות היו די בסדר ופשוט צריך להבין את החומר בשביל לפתור אותן. יש כמה שאלות מתחכמות כאלה על מקרי קצה ועליהם נופלים אבל בגלל שיש בחירה זה מאוד עוזר.\n\nהשורה התחתונה: השם \"ארגון ותכנות המחשב\" זה שם די מוזר לקורס כי לא ברור מה מלמדים בו, אבל למעשה אין דרך טובה יותר לתאר אותו. לומדים איך המחשב מאורגן ומתוכנת. זה קורס שמלמד את הבסיס של איך פועל המחשב ומאוד חשוב להבנה. אני יכול די בקלות לראות איך הרבה אנשים לא יתחברו לקורס ובאופן אישי גם אני לא התחברתי לכמה נושאים שהועברו בקורס אבל סך הכל זה קורס נחמד שמלמד איך פועל המחשב. זה קורס חובה אז כדאי להשתדל להנות ממנו.\nאעיר גם כי בעיניי הנושא הכי קשה זה הנושא של לינקינג, יש שם הרבה דברים שלא מבינים אותם במבט ראשון שני או שלישי ורק לקראת סוף הסמסטר (עם הלמידה למבחן) הרגשתי שאני מגיע לרמה מסויימת של שליטה בנושא.", "timestamp": 1613647770448}, {"author": "י", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: חסאן עבאסי\nחוות דעת - הרצאות: לא תמיד הכי מסודר, אבל מאוד סבלני. המצגות אינן מספיק ברורות ללמידה עצמאית, לכן כדאי לצפות בהרצאה בלייב/מוקלט (שזה היה בעייתי הסמסטר כי ההרצאות המוקלטות עלו באיחור רב). \nכמו כן, יש חומר שעובר רק בהרצאות (לדוגמא שיטות ניהול זיכרון) ולכן לא כדאי לדלג על ההרצאות.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: ראיתי אותו מוקלט, אבל רואים שהוא אוהב ללמד את המקצוע. לרוב חרג מהזמן המוקצב לתרגול, לכן כדאי להקצות שעתיים תרגול במקום שעה.\nשימו לב שיש חומר שעובר רק בתרגולים (לדוגמא קבצי ELF ו-Debugger), וגם התרגולים עוזרים יותר לפתרון תרגילי הבית מאשר ההרצאות.\n\nשעורי הבית: נחמדים ולא עמוסים מידי - 4 תרגילים שכוללים חלק יבש וחלק רטוב, שניתן לסיים תוך יום-יומיים:\n1. לכתוב כל מיני פונקציות באסמבלי.\n2. לכתוב מחשבון באסמבלי שמקבל קלט ממשתמש.\n3. לערוך את ה-Bash של לינוקס (לא כל כך קשור לחומר הקורס).\n4. לכתוב Debugger ב-C.\n\nהמבחן: קשה (ובעיקר טריקי) יותר מסמסטרים קודמים, ומאוד לחוץ בזמן (20 שאלות אמריקאיות/סגורות ב-70 דקות).\n\nהשורה התחתונה: קורס מעניין, מי שאוהב חומרה ואסמבלי יתחבר אליו מאוד, וגם מי שלא אוהב ימצא דברים נחמדים בו (בכל מקרה, זה קורס חובה אז זה לא משנה). שמעתי דברים רעים על הקורס הישן, ואני שמח שלקחתי את הקורס החדש כי הוא פחות עמוס וגם לומדים ארכיטקטורה מודרנית (x86). חלק מהנושאים בקורס יותר מאתגרים להבנה (לדוגמא כל הנושא של קישור סטטי ודינאמי), ולכן כדאי להיות על החומר כל הסמסטר, גם כדי להצליח בתרגילי הבית וגם כדי להצליח במבחן.", "timestamp": 1613722053404}, {"author": "Gadi Nabet", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: ממש מעניין ובא לקראת הסטודנטים \n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: שולט בחומר ומאוד עוזר לסטודנטים \n\nשעורי הבית: רובם ארוכים ודורשים הרבה דיבאגינג\n\nהמבחן: לא פשוט עם הרבה שאלות על הדקויות של הקורס\n\nהשורה התחתונה: קורס מאוג מעניין ומומלץ", "timestamp": 1614674963121}, {"author": "עומר", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: לא להיט\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מעולים\n\nשעורי הבית: לא כל כך קשורים למבחן עצמו, לא תמיד אפילו לתוכן שעובר בקורס.\n\nהמבחן: מעצבן.\n\nהשורה התחתונה: לטעמי לא קורס מעניין, מרגיש כמו כל מה שלא לימדו באף קורס והכניסו לקורס אחד מעורבב.", "timestamp": 1616098952802}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ערן יהב \nחוות דעת - הרצאות:  מרצה מעולה. הרצאות סופר מעניינות. יש אווירה טובה, הוא עובר על החומר לאט ומסודר.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים:  מתרגל ממש טוב. יש לו ידע גדול מאוד בתחום והרבה ניסיון. מעביר את החומר בצורה טובה ועונה על שאלות.\n\nשעורי הבית: 4 יבשים ו4 רטובים שמתפרסמים ביחד. היבשים לא מאוד קשים ועוסקים בדיוק בחומר של הכמה תרגולים האחרונים. הרטובים די ארוכים לוקחים הרבה זמן לדבג ולא ממש רלוונטים למבחן אבל הם מעניינים ועושים בהם משהו שונה ממה שמכירים לפני כן.\n\nהמבחן: \n\nהשורה התחתונה: קורס ממש מעניין, סגל טוב מאוד.", "timestamp": 1627280601348}, {"author": "x86", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ערן\nחוות דעת - הרצאות: \nאחלה מרצה! ברור ואכפתי.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים:\nאחלה מתרגל! ברור ואכפתי. \n\nשעורי הבית: \nיבשים ורטובים\nארוכים ומייגעים אבל חשובים להבנה.\n (לעיתים יש ניצוצות של מעניין)\nהמבחן: \nארוך ומייגע אבל חשוב לציון.\nחומר פתוח מודפס בלי הגבלה (עד מתי??? בזבוז נוראי של דפים. חייבים לשנות את זה כבר).\nאין הרבה מבחנים משנים קודמות לתרגול כי הקורס עבר טרנספורמציה, אז שווה לעשות את כולם בהתכוננות.\n\nהשורה התחתונה:\n14% להבין קונספטים חשובים בהנדסת תוכנה. שווה!\n86% ללמוד להיות קומפיילר אסמבלר ולינקר ידני כדי להעריך את קיומם. אני סבלתי מאוד.\n\nהמלצות :\nאני ממליץ לנסות להבין את החומר בגדול במהלך הקורס ולקראת המבחן להכנס לדקויות.\nלא להזניח שיעורי בית לרגע האחרון ולמצוא שותף טוב(!!!!!!!!!!!!).", "timestamp": 1627899131470}, {"author": "ל.א", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: סמסטר היברידי, מרצה מעולה. דואג שכולם יבינו, עושה המון הדגמות חיות על החומר הנלמד שמאוד עוזר להבנה. הוא מאוד אכפתי.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: מתרגל מעולה! פשוט מעביר את החומר בצורה ברורה, משקיע בשעות קבלה.\n\nשעורי הבית: 4 תרגילי בית, כל אחד מורכב מחלק יבש שהוא לא דורש יותר מדי זמן (עד יום עבודה) וחלק רטוב שהוא בדרך כלל עמוס יחסית ודורש כמה ימי עבודה.\n\nהמבחן: הוגן ובוחן באמת את מה שלמדנו בלי טריקים ושאלות משום מקום.\n\nהשורה התחתונה: קורס מעניין וקצת עמוס.", "timestamp": 1628494717399}, {"author": "daniel lachino", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: \nההרצאות מעניינות מאוד. מלא התעסקות ב Low level:\nLinking, Assembly, Linux kernel ועוד.\n\nשם המתרגל/ת:  \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמעניינים אך קשוחים מאוד. יש לבדוק מצבי קצה קיצוניים יחסית.\nהמבחן: \nפיירי לחלוטין\nהשורה התחתונה: \nאחלה של קורס לחובבי ה Low level", "timestamp": 1632814109133}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: אחלה מרצה, שנון וכנה, לא מחפש להכשיל אבל זה לא אומר שיעשה חיים קלים.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: מתרגל חבל על הזמן, משקיען ברמות ומסביר מעולה.\n\nשעורי הבית: עמוסים וארוכים.\n\nהמבחן: קצת ארוך, לא קל אבל גם לא מהקשים בפקולטה. לרוב המבחן עם חומר פתוח.\n\nהשורה התחתונה: לדעתי הקורס קצת משעמם ופשוט מאגד כל מיני נושאים קטנים שרצו שנידע ולא משהו ספציפי, אבל הסגל מפיח חיים בקורס המשמים. כן נותן טיפה טעימה לעולם ה-security שזה חביב", "timestamp": 1633927329774}, {"author": "LT", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חסאן\nחוות דעת - הרצאות: קצת משעמם, אבל מרצה טוב סה\"כ\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: מתרגל מעולה, מאוד עוזר להבין את התכלס של החומר ואיך הכל עובד \n\nשעורי הבית: 4 תרגילים יבשים ו4 רטובים. קצת מעיקים ועמוסים, אבל מאוד מעניינים ועוזרים להבין את החומר של הקורס. חשוב מאוד למצוא שותף טוב.\n\nהמבחן: מאוד הוגן, ניסוחים מעט מבלבלים אבל לא משהו נוראי. השאלות באמת בדקו הבנה של החומר.\n\nהשורה התחתונה: קורס עמוס, אבל מאוד מעניין. סה\"כ נהניתי.", "timestamp": 1634296397616}, {"author": "דני", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: חסן עבאסי\nחוות דעת - הרצאות: לא הכי מסודרות, לפעמים יש טעויות בשקפים. מרצה שמשקיע *מאוד* בלענות על שאלות הסטודנטים ומוודא הבנה. \n\nשם המתרגל/ת: איתי אילת\nחוות דעת - תרגולים: מתרגל תותח, משקיע מאוד בסטודנטים ונשאר גם מעבר אם צריך. \n\nשעורי הבית: הרטובים לא קלים, מצריכים הבנה מאוד יסודית של איך הכל עובד מאחורי הקלעים. יבשים יחסית קלים. \n\nהמבחן: סה\"כ נחמד.\n\nהשורה התחתונה: כל סגל של אביב 2021 היה מצוין, היה בתקשורת מצוינת עם הסדטונטים דרך הפיאצה, דבר שתרם המון להבנה של כלל הסטודנטים. קורס מאוד מעניין, בטח בהשוואה לאת\"מ הישן.", "timestamp": 1635590372465}, {"author": "JFK", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: חסאן עבאסי\nחוות דעת - הרצאות: יודע את החומר אבל קורא מהמצגות כמו רובוט.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: יש בהם חלקים מעניינים אבל רובם פשוט דורשים עצבים של ברזל ולא עוזרים להבנת החומר בשום דרך.\n\nהמבחן: חומר הקורס נלמד ברמה מאוד נמוכה אז לסגל הקורס אין שאלות מעניינות שהם יכולים לשאול על הקורס, מה שגורם לכך שהמבחן מנוסח בצורה גרועה בכוונה, לדוגמה במועד ב' סמסטר אביב 2021 הייתה שאלה אמריקאית שיש לה 3 תשובות נכונות.\n\nהשורה התחתונה: חומר סביר שמועבר בצורה גרועה.", "timestamp": 1644233019803}, {"author": "איתי בנימין", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חסן עבאסי\nחוות דעת - הרצאות: \nמאוד מבולגן והיה קשה לעקוב אחריו בהרצאות. לרוב התחיל את ההרצאות באיחור ולעיתים קרובות הילדים שלו היו נכנסים לאולם ומפריעים. לפי דעתי מומלץ לראות את ההרצאות של ערן יהב, הוא גם בנה את הקורס. אצלנו בסמסטר חסן היה המרצה היחיד לכן המוצא האחרון בהרצאות היו ההקלטות של ערן מסמסטרים קודמים שעזרו לי להשלים חורים (pun intended).\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: \nמצויין, ובכללי סגל המתרגלים בקורס הזה. עשו מעבר למצופה מהם, היו זמינים בפיאצה לשאלות וענו יחסית מהר על פוסטים.\nבועז יודע את החומר על בוריו וגם מסביר ברור, ונשאר גם לפעמים מעבר לזמן התרגול לענות על השאלות.\n\nשעורי הבית: \nעמוסים, לוקחים יחסית הרבה זמן וכדאי שלא להשאיר אותם לרגע האחרון. אך הם מעניינים ונוגעים בנושאים רלוונטים לקורס (פרט אולי לתרגיל השלישי אצלנו שלא היה קשור אבל עדיין היה ממש מגניב, נהנתי לבצע אותו).\nהמתרגלים זמינים לעזרה בשעות הקבלה ובפיאצה וכדאי להיעזר בהם.\n\nהמבחן: \nטריקי מאוד וקל ליפול על שטויות. מה שכן יש גם שאלות שבוחנות על הבנה. המבחן הוא עם חומר פתוח לכן מומלץ לסדר סיכום נוח ומתומצת עם רוב החומר של הקורס. \n(אני אישית הדפסתי את הסיכום בדרייב של ניב יעל והוספתי עליו עוד הערות שהיו לי) עזר מאוד במבחן והייתה לי שאלה שלמה של 20 נקודות שהתשובות אליה היו רשומות לי בסיכום :).\n\nהשורה התחתונה:\nלדעתי הקורס מעניין מאוד, סגל המתרגלים מצויין וזמין לכל שאלה, לגבי ההרצאות זו לדעתי הבעיה בקורס. כמו כן, יש כמעט בכל שבוע סדנה שבה המתרגלים פותרים שאלות ממבחנים או ברמת מבחן - חובה להגיע לדעתי, עוזר מאוד והקל עליי בלמידה למבחן.", "timestamp": 1644916069096}, {"author": "Elad Kay", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לא ראיתי\nחוות דעת - הרצאות: כנראה מיותר עד כדי שאלות יבשות בודדות שבמילא אפשר לחפש בסיכום בזמן המבחן כי יש חומר פתוח\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: מתרגל מעולה!\n\nשעורי הבית: לא קלים ולא קצרים, אבל לטעמי מאוד נחמד\n\nהמבחן: לא קשה, אפשר להוציא ציון טוב, חומר פתוח\n\nהשורה התחתונה: קורס מעולה, לא קל אבל חשוב", "timestamp": 1646571707043}, {"author": "rotem", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חסן \nחוות דעת - הרצאות: \nמרצה מעולה, מוודא שכולם מבינים ומוכן לחזור ולהסביר כמה פעמים. קחו את זה בחשבון כי זה לעיתים דורש סבלנות, אבל בסך הכל הרבה יותר קל להבין ולזכור ששומעים הכל כמה פעמים\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: פשוט מלך!!! מסביר מעולה, קשוב אכפתי, זמין לסטודנטים.\n\nשעורי הבית: כל תרגיל בית לקח משהו כמו יומיים וחצי בממוצע\n\nהמבחן: דורש תרגול ומיומנות, לפתור הרבה מבחנים בסוף זה עם חומר פתוח. \n\nהשורה התחתונה: אחלה קורס ממליצה, אה זה חובה :)", "timestamp": 1646905076185}, {"author": "Nir b.a", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חסאן\nחוות דעת - הרצאות: \nחשובה לו ההבנה של הסטודנטים והאינטרקציה איתם. לדעתי ההרצאות עוזרות.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: \nבועז מתרגל מעולה. גם איתי שהייתי בכמה סדנאות שלו אחלה.\n\nשעורי הבית: \nהיבשים מאוד רלוונטיים. הרטובים בחלקם רלוונטיים ובחלקם ברמה באמת גבוהה שפחות קשורה לאופי הקורס.\n\nהמבחן: \nמי שלמד כמו שצריך ועל החומר יכול להוציא ציון גבוה. המבחן עם חומר פתוח. \n\nהשורה התחתונה: \nממליץ מאוד להיות על הקורס לאורך הסמסטר. הקורס עם הכי הרבה דקויות שהיה לי עד כה בתואר ולדעתי פשוט חייב ללמוד אותו בעקביות ולא להזניח.\nיש קונספטים מעניינים אבל גם הרבה דברים טכנים שמצריכים עצבי פלדה.\nמי שאוהב low level יכול לעוף עליו. מי שלא שינשוך שפתיים.", "timestamp": 1647305522162}, {"author": "YT", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חסאן עבסי\nחוות דעת - הרצאות: אחלה מרצה. מסביר טוב ומוודא הבנה של כלל הסטודנטים. בכלל לא רץ על החומר וחוזר בתחילת כל הרצאה על ההרצאה הקודמת.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: בועז מעולה, מסביר טוב והוא מכיר את כל הדקויות של הקורס כמו שצריך.\nגם איתי מתרגל מעולה!\n\nשעורי הבית: היבשים אחלה, רלוונטיים לחומר ולמבחן אבל הרטובים מזעזעים. לא קשורים לשום דבר ובכלל לא ברור למה בקורס הזה יש אותם. הם אמנם לא ארוכים אבל מעצבנים, לא ברורים ומתסכלים. ממליץ מאד לרפרנס כי אין להם שום תועלת לחיים.\n\nהמבחן: המבחנים בקורס באמת הוגנים מאד וברמה סבירה מאד והממוצעים יעידו. כמה ימי למידה ומעקב בסיסי תוך כדי הסמסטר על החומר לגמרי מספיקים.\n\nהשורה התחתונה: קורס לדעתי די מיותר וחוזר על הרבה דברים שרואים בקורסים אחרים. סה\"כ לא עמוס ומבחן עם פוטנציאל לציון מאד גבוה.", "timestamp": 1647432552174}, {"author": "plt", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חסן עבאסי\nחוות דעת - הרצאות: \nההרצאות שלו לא מקוצעיות לדעתי, קודם ההסבר שלו לא ברור מעת לעת, לפעמים הוא שוכח להסביר דברים חשובים מאוד.\nבנוסף, הוא לפעמים בא באיחור להרצאה.\nוחשוב לציין שבן שלו תמיד בא ומפריע בסוף כל הרצאה, זה נחמד אבל לדעתי זה מקצועי.\nראיתי את ההקלטות של ערן ונושאים שחסן לא העביר אותם בצורה טובה ולדעתי הם מעולים.\nשם המתרגל/ת: בועז מאוב\nבועז מכיר את החומר טוב מאוד מאוד, תמיד בא מוכן, סבלני ומעביר את החומר בצורה ברורה ומעולה מאוד, עונה הרבה בפיאזה. בקיצור אפשר להגיד מתרגל מעולה מאוד.\nחוות דעת - תרגולים: \nחשובים מאוד למבחן.\nשעורי הבית: \nיש 4 תרגילי בית, השניים הראשונים היו פונקציות באסימבלי, לפי דעתי קלים וקצרים (וגם חשובים). ת\"ב 3 קצר, אבל קשה מאוד ואני לא רואה איך התרגיל קשור לקורס. ת\"ב 4 גם קשה אבל כן קשור לקורס.\nהמבחן: \nלדעתי הוגן, הם שואלים על החומר שנלמד בהרצאות,תרגול,תרגילי בית. אם באמת הבנתם את החומר ואתם בפוקוס במבחן ניתן להוצא ציון טוב.\nהשורה התחתונה: \nקורס מעניין לדעתי, חשוב לפתור הסדנאות בשביל להצליח, עמוס אם השותף לא טוב.", "timestamp": 1647639535582}, {"author": "nop", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: חסן\nחוות דעת - הרצאות: על הפנים. לא הצלחתי להבין מילה.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: ממש ממש ממש טוב. הציל לי את הקורס.\n\nשעורי הבית: מעצבנים, לוקחים ימים בודדים\n\nהמבחן: אפשרי. הזמן לא משחק תפקיד כמעט. צריך לבוא מאורגנים טוב עם חומר פתוח.\n\nהשורה התחתונה: אם הנושא לא מעניין אתכם אז זה לא כיף, אבל מזל שהקורס לא קשה.", "timestamp": 1649410958919}, {"author": "גלעד אל-דור", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: ערן מרצה מעולה, קפצתי בין ההקלטות שלו, לבין לפעמים להגיע לשיעורים. ההתעסקות שלו בטרמינל תוך כדי שיעור הפכה אותו לטעמי ליותר מעניין ויותר מובן, למרות שלפעמים מה שהוא עושה עבר לי מעל הראש.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: אגדה.\n\nשעורי הבית: ארבעה תרגילים יבשים, וארבעה רטובים. היבשים לוקחים זמן קצר, תרגילים קצרים שעם הבנה טובה של החומר ששואלים עליו מספיקה בשביל לסיים בפחות מיום עבודה. \nהרטובים לוקחים יותר זמן אם אתם חדשים לאמסבלי, אבל אף אחד מהם לא אמור לקחת ימים.. הם מלמדים את החומר בצורה בסדר, ואם לוקחים את זה בכיף זה גם יכול להיות מלמד. הטסטים שעושים ברטובים מקרי קצה נידחים ממש, לא כזה קשה לקבל באיזור 90 בעבודה, אבל ממש ממש קשה להוציא 100.\n\nהמבחן: איזה מבחן הזוי... ממש שונה בפורמט מהמבחנים הרגילים שעשו עד כה, הרבה יותר תיאורטי מחישובי - מה שבדרך כלל לא קורה. מזל שהיה חומר פתוח כי הוא עזר לי להבין דברים.\n\nהשורה התחתונה: קורס די מגניב בעיניי, גם בתור מישהו שעולם הlow-level לא ממש קורץ לא, אני חושב שהסגל מעולה והעבודות הגיוניות.", "timestamp": 1659387855718}, {"author": "סימבה", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: הקלטות של ערן יהב\nההקלטות שהוא ביצע בסמסטר אביב 2020 טובות.\nאין הרבה הפרעות והוא מסביר את החומר בצורה ברורה ומעניינת. הוא אומר בע\"פ דברים חשובים (גם חשובים באופן כללי וגם שאחרי זה מופיעים במבחנים...) ולכן ממליץ לעקוב ולרשום דברים שלא מופיעים במצגת.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: \nבועז מתרגל מצוין, מסביר ברור, מתמקד במה שחשוב ורואים שאכפת לו. אין לי מילה רעה. פעיל מאוד בפיאצה (זמן מענה ממוצע של 3 שעות) מה שעוזר מאוד לקבל פידבק. \n\nסדנאות: הסגל ממליץ לקחת חלק בסדנאות. לדעתי להגיע לסדנאות זה די בזבוז זמן ועדיף לעבור עליהן לבד לפני הסדנה ולראות אם מצליחים את התרגיל לבד. אם לא, רק אז להגיע. לחלקן יש הקלטות ככה שאפשר לחזור עליהן שוב לקראת המבחן.\n\nשעורי הבית: \nבניגוד לכל הקורסים שעשיתי עד עכשיו, התרגילים לא ארוכים אבל לא קלים. (לוגיקה מסובכת באסמבלי, קרנל מודול, דיבאגר) היה מעניין מאוד והטסטים של הסגל מקיפים (כל מקרה קצה מופיע בטסטים שלהם) ולכן חשוב להקפיד להגיש קוד יעיל וברמה גבוהה. \n\nהמבחן: הוגן מאוד. \nבניגוד למה שכולם אומרים, כדאי (מאוד מאוד) לחזור על התיאוריה ולהבין בדיוק איך כל מנגנון עובד ולמה הוא עובד בדיוק ככה. \nלצערי יש גם חלק טכני במבחן שבודקים אם אתה קומפיילר אנושי (תרגום פקודות, מילוי חורים) ולכן צריך לתרגל גם את זה לא מעט כדי לא סתם לאבד על זה נקודות.\nיש מבחני עבר עם פתרונות מלאים ככה שיש מאיפה ללמוד.\n\nהשורה התחתונה: \nקורס ממש טוב כי הסגל טוב. לומדים על איך המחשב עובד ומי שאוהב את זה יהנה מאוד. מי שלא, זה קורס חובה וזה מה יש...", "timestamp": 1659605262589}, {"author": "צפרדע אנונימית", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: \nהלכתי לכל הרצאה שהייתה במהלך הסמסטר ולא הקשבתי לאף אחת מהן. ערן מרצה מעולה, יסודי ומסודר אבל החומר לפעמים פשוט כל כך משמים שאי אפשר להקשיב. את מירב החומר בקורס לומדים מהתרגולים.\nכשהשלמתי חומר של ההרצאות למבחן, נעזרתי בסיכום מעולה שערן העלה לדרייב שלו ולכן אני לא יודע כמה נחוץ בכלל להגיע להרצאות.\n\nשם המתרגל/ת: בועז מואב (מוקלט)\nחוות דעת - תרגולים: מתרגל יסודי שאוהב לרדת לשורש העניין. חשוב לו מאוד שהסטודנטים יבינו אבל כמו המרצה, החומר לא עושה עימו חסד וקל לאבד את עצמך במיוחד בחומר חדש שבו לא ניתן לדעת על מה לשים דגש ומה לא. באופן כללי איכות ההוראה גבוהה מאוד אבל גם נדרש ריכוז גבוה.\n\nשעורי הבית: \nחלק מתרגילי הבית בכלל לא היו רלוונטיים למבחן או לחומר של הקורס. חלק מהם דווקא היו קשים אך מאוד מעניינים והיינו צריכים לחקור לעומק דרך קוד, נושאים שנחשבים יחסית תיאורטיים וזה היה מאוד מעניין.\n\nהמבחן: המבחן הוגן מאוד. הסגל עושה את המיטב כדי שהסטודנטים יצליחו. חומר פתוח, דפי עזר שהם מחלקים, נספח נוסף למבחן. הסגל יחד עם המרצה האחראי, רוצים את ההצלחה של הסטודנטים בקורס.\n\nהשורה התחתונה: מי שמתחבר לתחום של low level יהנה מאוד לראות איך נושאים כה פשוטים מצליחים לבנות מערכות מחשב שלמות ולתחזק אותם. זה אפילו יכול להיות מרתק במידה מסוימת. מי שלא מתחבר, החזיקו חזק ונסו לשרוד, הקפידו להבין את הדקויות שבחומר ותלמדו טוב למבחן. ככה אפשר להוציא ציון מאוד גבוה בקורס.", "timestamp": 1664109684988}, {"author": "רק תלונות", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: -\nחוות דעת - הרצאות: מיותרות, בתרגולים יש הכל\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: אחלה מתרגל, מסביר נהדר.\nלשים לב, יש מלא פרטים קטנים שהמתרגלים אומרים בעל פה ולא מוזכרים בשום מקום אחר.\n\nשעורי הבית: בזוגות\nרטובים - מעניינים אך גם קשים, מאלצים לחשוב בצורה שונה ולבצע מחקר יסודי אצל מר גוגל.\nיבשים - לא קשים אבל ישנן שאלות וסעיפים שיקחו כמה שעות טובות.\n\nהמבחן: הוגן יחסית לקורסים אחרים, צריך להשקיע הרבה בשביל להצליח.\n\nהשורה התחתונה: אין לכם ממש ברירה אם לקחת את הקורס, מומלץ למצוא שותף/ה רציני/ת, להתחיל יבשים מוקדם ורטובים מאוחר ולהשתדל להנות מהדרך.", "timestamp": 1665910209638}, {"author": "Ziv Mor", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ערן יהב\nחוות דעת - הרצאות: איזה גבר טורבו. אכפת לו מסטודנטות, אם כמה אנשים שואלים שאלות דומות הוא מבין שהוא העביר נקודה לא טוב וחוזר עליה, בניגוד לכל מיני מרצים שפשוט מאשימים את הסטודנטים שהם מטומטמים. בלי קשר הוא גם מרצה טוב.\n\nשם המתרגל/ת: בועז משהו (החלון של החווד מסתיר), מוקלט \nחוות דעת - תרגולים: מצוין, בטוח שבפרונטלי אפילו יותר.\n\nשעורי הבית: תקפים. אסמבלי, מחולקים ליבש ורטוב, מי שלא מנוסה בזה כנראה יעבוד הרבה על הרטוב.\n\nהמבחן: \nלא אסון, חומר פתוח. תבקשו מסמסטרים קודמים כי החומר לא משתנה ואנשים מדפיסים תועפות דפים סתם.\n\nהשורה התחתונה: אמנם קדם לכלום בערך אבל כן יחסית עמוס ולא הייתי דוחה לסמסטרים מאוחרים כשלמי יש כוח", "timestamp": 1666769625238}, {"author": "we're_completly_f'd", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גאלה משהו\nחוות דעת - הרצאות: לרוב זה לא יהיה רלוונטי כי היא לא תעביר את הקורס עוד פעם, אך בכללי, היא מרצה טובה ונחמדה, אכפת לה משאלות הסטודנטים והיא מתעקשת על השאלות הרבה עד שכולם יבינו. (חשוב להדגיש גם שהיו הרבה שאלות שהיא לא הצליחה לענות עליהן).\n\nשם המתרגל/ת: Tal Sarah Rose Neville (טל)\nחוות דעת - תרגולים: כולם מדברים על המוקלט של בועז, אך אם אתם כאלה שמעדיפים פרונטלית ולא מוקלט, טל היא הכתובת שלכם!\nאחלה מתרגלת, פשוט מלכה! המתרגלת שהתרגולים שלה היו הכי פחות משעממים מתחילת התואר, היא ממש כריזמטית, אלגנטית וחכמה, מעבירה את החומר בצורה יפה עם מימז בשקופיות כדי שזה יהפוך לכיפי, קיצור, תלכו לתרגולים שלה, תאמינו לי, אתם לא תתחרטו אפילו טיפה!\n\nשעורי הבית: לא כזה עמוסים, לא כמו מתם או מבני, אפילו לא קרוב לשם, אם אתם חזקים בחומר, היבשים יקחו לכם כמה שעות טובות פיר תרגיל (חוץ מיבש 3). ולגבי הרטובים, אם אהבתם את האסמבלי של מערכות ספרתיות, אתם תאהבו את התרגילים הרטובים (אגב, זה לא אותו אסמבלי). הרטובים קצת יותר עמוסים, תרגיל 1 ו- 2 יקחו יומיים של עבודה, תרגיל 3 יהיה תלוי בכמה אתם על החומר (קישור סטטי), וכמה אתם טובים בשפת c (לקח לי יום וחצי של עבודה), ותרגיל 4, ממש עמוס, תקצו לו לא מעט זמן.\n\nהמבחן: בועז יא בועז, ראיתי את אובליסק הטכניון מחלון החדר שנבחנתי בו, ופשוט הרגשתי (אתם יודעים מה הרגשתי, אין טעם להמשיך את המשפט)ֿ.\nלא רוצה לעשות מזה big deal כי המבחן בגדול היה פתיר, אבל הוא היה דיי ארוך וטריקי, שאלה 2 בלבלה הרבה אנשים, השאלות פשוט נועדו כדי לרמות איתכם, אתם חושבים שהנה, הצלחתי את השאלה, אבל לא! יש איזשו טריק שמסתתר איפשהו שהופך את הפתרון שלכם לשגוי. \nהרבה סטודנטים הגיעו בלי מחשבונים למבחן, כי במבחני עבר באמת לא היה צורך באחד, אבל לא!! זו בעיה שלכם שצריך לחשב kilo bytes ו mega bytes ולא הבאתם מחשבון.\nבנוסף, לא היה אצלנו שאלות קישור כלל, לא דינמי ולא סטטי, למרות שהקישור הוא ליבת הקורס. \nאני חושב שבועז רצה להראות לסגל הבכיר שהוא אכן ראוי להיות מרצה בקורס ולא רק מתרגל אחראי, ושהוא יודע לנהל ת׳קורס איך שבטכניון אוהבים לנהל דברים, מבחן קשה או שונה בסגנון שלו.\nאל תבינו אותי שגוי, הבן אדם באמת תותח, הוא על החומר, והוא מצויין בהוראה, אחד המתרגלים הכי טובים בפקולטה, אבל אני חושב שבחירת השאלות הייתה מזעזת בכוונה, כדי להשיג מטרות אישיות. ( i love conspiracy theories)\n\nהשורה התחתונה: אחלה קורס, אחלה סגל, אחלה חומר, והמון מזל במבחן (המבחנים לא אחידים כלל, ייתכן שבכל המבחנים שפתרתם בבית הבאתם 95+, ובמחן תקבלו בראש)", "timestamp": 1675871909394}, {"author": "לינקר קז'ואלי", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: אחלה, היא העבירה את החומר טוב, והיה ניכר כמה היה חשוב לה שאנשים ישאלו וילמדו מהשאלות שלהם.\nבלי קשר אליה, החומר של ההרצאות זה הדבר הכי משעמםםםםםםםםםםםםםםםםםםם שנתקלתי בו עד עכשיו, והדבר הכי מחרפן זה לשבת בהרצאה ולשמוע אנשים שואלים שאלות על סינטקס כאילו google ו-chatGPT לא קיימים.\n\nשם המתרגל/ת: עידו סופר\nחוות דעת - תרגולים: אחלה מתרגל שבעולם, רואים שהוא תותח בחומר, ממליץ ביותר.\n\nשעורי הבית: 4 יבשים ו-4 רטובים. לפעמים קצת מעצבנים אבל לא כאלה נוראיים.\n\nהמבחן: המבחן היה פתיר, אבל היו הרבה חלקים טריקיים, וחומר שהשקיעו 3 שבועות כדי ללמד אותו פשוט לא הופיע במבחן בכלל. באופן כללי ניכר שהסגל מעולה בלא למחזר דברים מהעבר.\n\nהשורה התחתונה: הקורס לא כזה עמוס, ובסופו של דבר החומר זה לא הדבר הכי מסובך בעולם, אבל הוא משעמם פיצוצים", "timestamp": 1676491109505}, {"author": "למדתי הכל מMIT", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: היו הרצאות משעממות אבל היא הסבירה בסדר את החומר\nהיו אנשים שלא הפסיקו לשאול שאלות מפגרות וסתם עיקבו את כולם ועשו לעצמם שיעור פרטי\n\nשם המתרגל/ת: עידו סופר\nחוות דעת - תרגולים: המתרגל מספר אחד בקורס, יחס אישי מטורף, עונה על שאלות בצורה מקצועית ונותן אינטואיציות ושיטות שעוזרים בתרגילי בית ובמבחן\n\nשעורי הבית: היה תרגיל בית ממש מגניב (עם הROP), חוץ מזה היה סתם בזבוז זמן\n\nהמבחן: יש הרבה טריקים ודברים שצריך לשים לב אליהם ולא לפתור מהר, סך הכל היה הוגן\n\nהשורה התחתונה: קורס עם חומר קצת מונוטוני, אם משקיעים כמה ימים טובים בלפתור מבחנים אפשר לעבור אותו בקלות", "timestamp": 1676823322405}, {"author": "RIP", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: סבבה. לא ידעה לענות לכל השאלות, אבל ניכר שהיא רצתה שהסטודנטים יבינו את החומר.\n\nשם המתרגל/ת: מוקלט של בועז\nחוות דעת - תרגולים: מושלם, תרגולים באמת ברמה גבוהה\n\nהמבחן: סבבה, חוץ מזה שלא הייתה שאלה על טבלת רילוקיישן ):\n\nהשורה התחתונה: קורס הכי משעמם שלקחתי בפער. אין לי מושג למה סטודנט ב-2023 צריך לדעת לקודד פקודות ולתרגם קידוד פקודות, זה מרגיש כמו מטלה שנתנו לשבויי מלחמה לעשות במלחה\"ע ה-2 כדי לתת להם תעסוקה.\n\nאם כי ברגע שמתרגלים מספיק מבחנים, יש הרבה קונספטים שחוזרים על עצמם. רק לא ללכת לאיבוד באמצע הסמסטר, כי יש הרבה חומר וניואנסים להבין.", "timestamp": 1677861671243}, {"author": "Oni Giri", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גלה.\nחוות דעת - הרצאות: היו הרצאות שבה היא הייתה מאוד טובה בהסבר ויש כאלה שפחות , נראה לי זה קרה כי זאת הפעם הראשונה שלה בקורס(ואולי האחרונה) , היא דואגת לכך שהסטודנטים יבינו את החומר ומתעקבת מאוד על השאלות.\n\nשם המתרגל/ת: המוקלט של בועז.\nחוות דעת - תרגולים: סבבה , שמעתי שהמתרגילים הפרונטליים גם מצוינים.\n\nשעורי הבית: לא עמוסים , הרבה יותר קצרים משעורי בית של מבני/הפעלה . היבישים עוזרים לשלוט בחומר והרטובים לא ארוכים.\n\nהמבחן: קצת שונה במבנה ממבחנים קודמים אך לא אסון, \nהיה הוגן , אם הייתם על החומר + תרגלתם מספיק מבחנים\nאז אין מה לפחד.\n\nהשורה התחתונה: חומר הקורס לא מסובך, הסגל אכפת לו שהאנשים יצליחו, היו עונים על השאלות בפיאצה תוך כמה שעות עם הסברים טובים.", "timestamp": 1678130887900}, {"author": "DEADBEEF", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ערן יהב - מוקלט\nחוות דעת - הרצאות: \nסבבה של הרצאות ללמוד מהן. הייתה לי התנגשות עם קורס אחר ולכן לא יכולתי להגיע להרצאות של גלה.\nשם המתרגל/ת: שליו ריסין\nחוות דעת - תרגולים: \nאחלה מתרגל בסך הכל, לי היה ברור איתו. ממליץ.\nשעורי הבית: \nקצת ארוכים אבל היה לי שותף טוב אז הלך סבבה. חשוב למצוא שותף טוב, כמו תמיד.\nהמבחן: \nקצת מבלבל וטריקי - לשים לב לפרטים הקטנים.\nהשורה התחתונה: קורס נחמד בעיניי ולא נורא קשה, אבל כן קצת עמוס.", "timestamp": 1678791452491}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גליה ידגר\nחוות דעת - הרצאות: גליה מרצה נפלאה, ממוקדת וסבלנית.\n\nשם המתרגל/ת: בועז מתרגולים מוקלטים, אחלה מתרגל!\n\nשעורי הבית: יש ויש, התרגילים הראשונים היו סבירים וזה נהיה קשה מאוד לקראת הסוף\n\nהמבחן: קשה וטריקי\nללמוד הרבה וזה יעבוד! :)", "timestamp": 1679328600581}, {"author": "GO(a)T", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גליה\nחוות דעת - הרצאות: מאוד טובות ומעמיקות, נותנת הרבה זמן לשאול שאלות ולהבין טוב את החומר \n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: לקחתי את התרגול שלו בצמוד לסדנא, ממש ממליץ מתרגל טוב שמסביר מדהים את החומר ונותן תמיד אקסטרא זמן לשאלות והמון מעצמו, וגם מתחבר לראות את התרגול והסדנא ברצף \n\nשעורי הבית: לא קלים כלל, את ה-2 הראשונים עשיתי בעצמי מה שעזר להבנה טובה בחומר, את ה-2 האחרונים השתמשתי ברפרנס כדי לעשות אותן, קריטי להבין את הקוד מאחר ובמועד א היה שאלה של הרבה נקודות לכתוב דיבאגר במבחן.\n\nהמבחן: מבחן מאוד הבנתי(מועד ב), שנגע בנקודות קצה של הקורס ודרש הבנה של החומר כדי לפתור אותו ולהצליח ולא רק ידע טכני. לדעתי האישית מבחן הוגן. לא דומה למבחני עבר כלל והפריד את אילו שלמדו טכנית את החומר לאילו שבאמת הבינו אותו.\n\nהשורה התחתונה: תלמדו את ההרצאות טוב טוב ואת התרגולים(לקרוא סיכום לפני המבחן לא מספיק), וברגע שמבינים את ההרצאות טוב ומתרגלים קצת מבחנים אפשרי לגמריי לסיים בציון ממש טוב בקורס. קורס עם חומר מעניין, מאוד low level אבל נותן הבנה מעמיקה לאיך דברים עובדים ופותח עולמות חדשות.", "timestamp": 1680526700361}, {"author": "~~", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הקלטות של ערן\nחוות דעת - הרצאות: אחלה הקלטות\n\nשם המתרגל/ת: בועז - מוקלט\nחוות דעת - תרגולים: ההקלטות הכי טובות שפגשתי עד כה בתואר\n\nשעורי הבית: \n4 רטובים, 2 מהם באסמבלי 2 מהם מערבים גם C. נחמד מאוד לא סבלתי יותר מידי.\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: הקורס נחמד ובגדול נהנתי מהתוכן, סגל קשוב שניהל את הקורס בצורה מופתית. לא אופייני לפקולטה למדמח אז שאפו!", "timestamp": 1689247056312}, {"author": "Jbe", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חסאן\nחוות דעת - הרצאות: \nמעניינות, הוא מעביר יחסית לאט\n\nשם המתרגל/ת: \nבןעז מוקלט, אחלה תרגולים\n\nחוות דעת - תרגולים: \n\nשעורי הבית: \nהרבה אסמבלי, סך הכל מגניב, יותר עמוס מקורס רגיל של 3 נקז\n\nהמבחן: \nמבחן בסדר\n\nהשורה התחתונה: \nלא יודע כמה הקורס באמת חשוב, מאוד low level", "timestamp": 1691352844875}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חסן (פרונטלי) וערן יהב (מוקלט)\nחוות דעת - הרצאות: בהתחלה הלכתי פרונטלי לחסן.. הוא הסביר בגדול טוב אבל התעכב המון על שאלות עד שכולם יבינו כל פסיק. ככה, בשילוב עם זה שהוא איחר למספר הרצאות, גרר עיכוב רציני בחומר ועברתי למוקלטים של ערן יהב. ערן אלוף וההקלטות די זורמות, רק יש חומר שקצת שונה וזז אז צריך לשים לב למה רואים.\nהסמסטר מתחיל עם אסמבלי ודומה מאוד לחלק הזה בספרתיות, לאחר מכן יש קצת חומר שנראה שהעבירו מהקורס מערכות הפעלה, לאחר מכן אחד הנושאים המרכזיים והקשים (לינקרים) ולבסוף ניהול זיכרון שנראה שגם קשור מאוד לקורס מערכות הפעלה. לרוב די מעניין, לעיתים עמוס ומבלבל אבל מסתדרים.\n\nשם המתרגל/ת: טל רוז\nחוות דעת - תרגולים: משקיעה מאוד ומנסה שיהיה גם נחמד ומצחיק. בחלקים מהקורס יש ירידה לפרטים באזורים יחסית חשוכים ויש המון פרטים ומקרי קצה שלא תמיד ברור מה צריך לדעת ומה לא.. באזורים האלה לפעמים הרגשתי שטל לא מספיק בקיעה בחומר (גם אם לפעמים זה קצת מעבר לחומר הקורס, אבל עוזר להבין את החומר).\nבועז המתרגל האחראי תותח על. ידע עצום, השקעה ומענה רציף... לפני המבחן לא עזב את הפיאצה לרגע וענה תשובות מפורטות ומועילות.\n\nשעורי הבית: ארבעה תרגילי בית. כל תרגיל כולל יבש + רטוב.\nעומס בינוני.. הדיבוג קצת קשה, ממליץ ללמוד איך לעבוד בסיסית עם GDB כי יכול מאוד לעזור לכל אורך הקורס.\nחלק מצריכים חיפוש באינטרנט ועבודה עם כלים שלא נלמדים בקורס. אל תבזבזו על זה יותר מידי זמן אם לא מצליחים למצוא, אבל תשדלו להבין טוב את מה שריפרנסתם.\nחלק מגניבים וקשורים לחולשות אבטחה.\n\nהמבחן: הוגן, חשוב לשים לב לפרטים הקטנים.\n\nהשורה התחתונה: קורס מעניין שנוגע באזורים יחסית חשוכים (כמו לינקרים)... לדעתי, גם אם לא נעסוק בזה באופן ישיר בעתיד, נחמד וחשוב להבין איך הדברים האלה עובדים. על הדרך גם לומדים על חולשות אבטחה ומבינים איך ולמה הן קורות. ידע טוב בספרתיות יכול מאוד לעזור וכמו שבטח כתבו כבר מאוד מתקשר לקורס מערכות הפעלה.", "timestamp": 1691852455197}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חסן\nחוות דעת - הרצאות: \nכעקרון, הוא מסביר את החומר בצורה טובה. הוא טיפה איטי ונותן לשאול הרבה שאלות ולכן טיפה מתעכבים עם החומר. הוא היה תמיד מאחר להרצאות, שזה לא בסדר בכלל... כתוצאה מכך הוא עשה הרבה הרצאות השלמה.\n\nשם המתרגל/ת: טל \nחוות דעת - תרגולים:\nמעבירה את החומר בצורה טובה - נהנתי ללמוד אצלה.\nמה שכן, יש דברים שהיא לא יודעת תמיד ב - 100%, אבל היא לרוב בודקת ומחזירה תשובה.\n \n\nשעורי הבית: 4 רטבים + יבשים. לי הם היו טיפה עמוסים, יש כאלה שקלים ויש כאלה שפחות. לקראת הסוף הם יותר עמוסים.\n\nהמבחן: \nהסמסטר המבחן כן היה הוגן אבל הוא היה ארוך מהרגיל\n\nהשורה התחתונה: כן נהנתי ללמוד את הקורס. כמה נצטרך את החומר שיש בו? לא יודע, כנראה אבל שלא.", "timestamp": 1691929969019}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ערן יהב (הקלטות)\nחוות דעת - הרצאות: רובן די משעממות, אולי גם מיותרות (חוץ מההרצאות בנושא זיכרון) אבל ערן אחלה של מרצה, מדבר תכלס ובגובה העיניים וההקלטות שלו מתקופת הקורונה לגמרי רלוונטיות אז מומלץ, אם כבר רוצים לראות הרצאות (חסן מסביר לאט בטירוף, בלתי אפשרי עבורי להתרכז ככה)\n\nשם המתרגל/ת: בועז מואב (הקלטות)\nחוות דעת - תרגולים: למרות שאמרו שיש קצת הבדלים בין ההקלטות לבין החומר המועבר הסמסטר מבחינת רמת ההתעמקות, הסתמכתי עליהן והסתדרתי יפה.\nהתרגולים משעממים אולי אפילו קצת יותר מההרצאות אבל חשובים ממש ובועז מתרגל מעולה.\n\nשעורי הבית: די כבדים. יש 4 יבשים + 4 רטובים שיוצאים ביחד. היבשים ארוכים אולי אפילו יותר מהרטובים אבל ממש חשובים למבחן. הרטובים חשובים גם הם אבל לרוב התרומה שלהם להבנת החומר היא מינורית יחסית לכמות ההשקעה בהם, לכן לא הייתי מהססת לרפרנס.\n\nהמבחן: מבחן לא פראייר בכלל אבל הוגן לגמרי. האמת היא שרק כשהתחלתי לתרגל מבחנים אז התחלתי גם להתחבר לחומר של הקורס ולראות את היופי בו. יש דברים מגניבים והמבחן דורש מחשבה והבנה מעמיקה של החומר.\n\nהשורה התחתונה: די משעמם לאורך הסמסטר אבל קורס חשוב ויש בו יופי. כמה טיפים ברמת הפרקטית:\n- לעשות את היבשים כמו שצריך, זה סופר רלוונטי למבחן \n- לעשות גם את הרטובים כמו שצריך אבל לרפרנס\n- תלמדו את עצמכם קידוד פקודות ברמה גבוהה, זה קריטי ובתרגולים לא לומדים את זה מספיק לעומק (אל תתחילו לתרגל מבחנים בלי זה)\n- תבינו קבצי ELF וrelocations, זה אולי מרגיש שולי אבל זה חצי מהמבחן\n\nמה שכן, סגל מהטובים שראיתי בפקולטה (ובועז בעיקר, אתה מלך)", "timestamp": 1692028493956}, {"author": "PTRACE", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ערן יהב מוקלט\nחוות דעת - הרצאות: \nערן בן אדם מקסים, באמת חריג בנוף של המרצים בטכניון. ההרצאות שצפיתי בהן הוקלטו באביב 20 ובאביב 21. החומר דיי זהה למה שהועבר הסמסטר בהרצאות. בסך הכל החומר שצריך להעביר בהרצאות דיי משעמם, לכן קשה לי להאשים את ערן בכך שלפעמים הוא חיפף והרגיש שהוא לא מסביר כל דבר לעומק. רוב החומר שבאמת חשוב לבחינה מסונן לתוך התרגולים.\n\n\nשם המתרגל/ת: בועז מואב מוקלט מחורף 21-22\nחוות דעת - תרגולים: \nהחסרון היחיד בהקלטות האלו הן שאיכות האודיו לא טובה כל כך, זה קצת מעצבן לפעמים. ממליץ ללכת אחורה בGR לסמסטר אביב 21 ולצפות בבועז מוקלט שם, האיכות הרבה יותר טובה והכל כמעט אותו דבר. בנוגע לאיכות התרגולים - בועז מתרגל ממש טוב, שולט בחומר בצורה מעולה. לדעתי מה שחסר בתרגולים זה הסבר יותר טוב על addends, והסבר יותר טוב על הקשר הדינאמי, המון דברים שם באוויר ומרגיש שדברים חשובים מאוד (שיש מבחנים ששואלים עליהם המון) מוסברים רק בכמה דקות בתרגול של קישור דינאמי. בנוסף חשוב לציין לטובה את זה שבועז זמין בצורה ממש חריגה (בקטע טוב) בפיאצה, ובמיוחד לקראת המבחן הוא ענה בפירוט מדהים על כל שאלה של כל סטודנט, משהו שעזר לי מאוד לקראת הלמידה למבחן.\n\nשעורי הבית: יש 4 רטובים ו4 יבשים. היבשים בקורס מלמדים, ולרוב הם פתירים והגיוניים. מומלץ מאוד לעשות אותם לאורך הסמסטר כדי להשאר חד על החומר ולצמצם את המאמץ שתצטרכו לעשות לקראת המבחן. הרטובים לא קלים, יש עבודה עם אסמבלי וזה משהו שלא רגילים אליו כל כך, קשה מאוד לדבג את זה. רטוב 3 היה סבבה. רטוב 4 עם הדיבאגר היה קשה מאוד, ובאמת כמעט בלתי אפשרי לעשות אותו בלי רפרנס בכלל (במסגרת הלחץ זמן של סוף סמסטר)\n\nהמבחן:\nמועד א' היה הוגן, מועד ב' היה יותר קשה, אבל כדי לתקן את זה עשו בדיקה יחסית מקלה וניקדו סעיפים בצורה קצת משונה, והייתה שאלה מונפצת לגמרי בשאלת הזכרון הקבועה שיש בכל מועד. יש מגמה דיי מבאסת של הממוצע בקורס, בכל סמסטר נראה שהוא יורד בעוד נקודה או שתיים, וחבל, כי זה היה קורס נחמד בסמסטר 4 שבדרך מסיימים אותו עם ציון טוב, לעומת קורסים אחרים קשים בסמסטר 4 כמו הפעלה ואלגו.\n\nהשורה התחתונה: \nהמגמה של המבחנים שנהיים קשים יותר דיי מבאסת, חוץ מזה, יש חלקים מעניינים יותר ומעניינים פחות. בהתחלה הכל נראה כמו סינית אבל יכול להיות שבשלב מסוים כשתחזרו על החומר אולי תגלו בו עניין ואפילו יופי מסויים (רק חלק מהחומר, יש חלקים שהם דיי נבזיים כמו אינליין אסמבלי)", "timestamp": 1696240841060}, {"author": "ferberonix", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חסן\nחוות דעת - הרצאות: \nחסן אחלה מרצה. קצב הלמידה אצלו די איטי כי הוא מתעקש להסביר כל דבר כמה פעמים. ההרצאות לא עמוסות ולא קשות.\n\nשם המתרגל/ת: בועז (מוקלט)\nחוות דעת - תרגולים: \n90 אחוז מהחומר במבחן הוא מתוך התרגולים. הם מצוינים לדעתי ובועז מתרגל אלוף. מסביר מצוין, זמין במייל ובפיאצה. מתרגל משכמו ומעלה. שימו דגש על קישור דינאמי (תרגול 10)- זה החומר \"הכי קשה\" בקורס וזה גם התרגול הכי פחות מוצלח של בועז. אני צפיתי בתרגול 5 פעמים עד שהבנתי לגמרי את החומר.\n\nשעורי הבית: \nקצת עמוסים. אני אהבתי אותם מאוד משום שנדרשנו לבטא את ההבנה שלנו בחומר- מי שמבין פותר אותם \"במהרה\".\n\nהמבחן: \nדורש התכוננות של שבוע לפחות עד שמפנימים מה מצופה מאיתנו ולומדים את כל הטריקים משנים קודמות. אל תזניחו אף נושא ושימו דגש על תרגולים 8-10 (הנושאים בהם שכיחים במבחנים). ישנה מגמת שינוי במבחנים בשנתיים האחרונות. השאלות בודקות יותר הבנה עמוקה מאשר חישובים אריתמטיים. מועד א' היה הוגן מאוד אם כי קצת ארוך. מועד ב' היה המועד הכי פחות חישובי עד עתה- המון שאלות פתוחות שדרשו הבנה די עמוקה. יש הטוענים כי זה היה המועד הכי קשה בקורס עד עתה (והפקטור הנדיב היה בהתאם).\nהשורה התחתונה: \nאני נהניתי מאוד בקורס. ברגע שמבינים באמת את כל הנושאים בו מצליחים לראות את התמונה הכוללת (והחשובה) שהקורס מנסה להעביר.", "timestamp": 1697699658609}, {"author": "אמיר", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חסן, ערן מוקלט\nחוות דעת - הרצאות: החומר מעניין אבל הקצב סופר איטי, חסן מרצה טוב יחסית בעייני חוץ מהקצב המשממים, ההקלטות קצת יותר טובות אם זה עובד בשבילכם לא משנים את החומר\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: מתרגלת מעולה ממש, מאד ממליץ\nבעיקר בהתחלה יש תרגולים, פרי תרגולים וסדנאות ואז זה מתיש ומעיק, אבל הם חשובים לתרגילי בית\n\nשעורי הבית: לוקחים קצת זמן אבל לא נוראיים, צריך אבל להיות על החומר לפני שמתחילים אחרת זה נראה כמו סינית\n\nהמבחן:  בסדר\n\nהשורה התחתונה: אין לכם ברירה, קחו ותשאירו זמן ללמוד לזה, עדיף עם שותף שהיה טוב בספרתיות.", "timestamp": 1704963485432}, {"author": "אמיר", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "מאד low level ודי טכני, צריך להשקיע קצת זמן כדי ללמוד לעשות הכל", "timestamp": 1709136146601}, {"author": "א.ב.", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חסן / הקלטות של ערן\nחוות דעת - הרצאות:\nאת חסן עזבתי אחרי שתי הרצאות. הוא התקדם כ\"כ לאט בחומר, שלא יכלתי להמשיך לשבת בכיתה.\nההקלטות של ערן מעולות - הוא חי את החומר, ובד\"כ גם מסביר טוב.\n\nשם המתרגל/ת: נדב\nחוות דעת - תרגולים: \nקודם כל, נדב הכי נחמד שאפשר – תמיד שמח לענות על שאלות, או לחזור ולהסביר גם כשלוקח לנו הרבה זמן להבין, ובאופן כללי האווירה בכיתה ממש טובה.\nאני אישית חושב שבלי התרגולים לא הייתי מצליח כמעט להבין את החומר. התרגולים גם סדרו את החומר, גם עזרו להבחין בין עיקר לטפל, והיו ממש הכרחיים כדי לדעת איך ליישם את החומר ולפתור את שיעורי הבית.\n\nשעורי הבית: \nיחסית עמוס. הרטוב בעיקר מעצבן, כי כל פעם צריך לעבוד עם דברים חדשים, וזה תמיד תוקע... היבש בד\"כ דורש הבנה בחומר שמגיעים אליה אולי לקראת המבחן, ולכן זה יוצא המון עבודה.\n\nהמבחן: \nלא פשוט, אבל הוגן בסך הכל. דורש שליטה בחומר, והבנה מעמיקה, אבל לא נראה שרוצים בכוונה להכשיל.\n\nהשורה התחתונה:\nלדעתי הקורס יחסית מבולגן. יש תחושה שהוא מורכב מאוסף של דברים שהיה חשוב לפקולטה שנדע, אבל זה לא מובנה בצורה מסודרת, ולא תמיד יש קשר ישיר בין הנושאים.\nבנוסף, יש בו דגש מאוד גדול על פרטים טכניים, שהופכים אותו לפחות מעניין. אבל בהחלט יש גם כמה נושאים מעניינים וחשובים.", "timestamp": 1711535777064}, {"author": "פויינטר לנדר", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: פנאן,גלה נחמדה ממש אבל שולטת על הכיתה אם יש אנשים שתוקעים את התקדמות ההרצאה. כמו שצריך\n\nשם המתרגל/ת: גל קפצנאל \nחוות דעת - תרגולים: פנאן גם\n\nשעורי הבית:\nכאדר לא נורמלי, בסמסטר שלנו היו רק 2 רטובים במקום 4, עדיין משעממים מוות. לכתוב קוד C ולקמפל זאת הדרך.\nחשוב: יש סדנאות מוקלטות שעוזרות לדעתי.\nהמבחן: עוד לא היה.\n\nהשורה התחתונה: קורס משעמם *מאוד*, למי שלא מעוניין אפילו קצת בתחום זה מייגע ומאוד לא מתיש, לא באמת עוזר להבין את הפעלה כשהוא אמור להיות קדם\\צמוד אליו.\nאם הקורס חובה לך אז זה מה שיש, אם לא אז לשקול את הבחירות שלכם בחיים.", "timestamp": 1715347962911}, {"author": "..", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "השורה התחתונה: \nקורס מבולגן מאוד , כשמגיעים לחלק של dynamic linker עושים עבודה מאוד לא טובה בהסברת החומר , מרגישים כאילו המרצים בעצמם לא מבינים את החומר שהם מלמדים.", "timestamp": 1715529079202}, {"author": "~~", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: גלה\nחוות דעת - הרצאות: מרצה בסדר, לפעמים נתקעת על משהו שאפשר היה להסביר בעשר דקות למשך שעה שלמה\n\nשם המתרגל/ת: גל \nחוות דעת - תרגולים: סבבה, תרגולים קצת משעממים, אבל זה הקורס\n\nשעורי הבית: עמוסים, במיוחד הרטוב הראשון שלקח כמות זמן בלתי סבירה. בסה\"כ עוזרים להבין את החומר של הקורס אבל באמת לוקחים הרבה זמן אז צריך לקחת בחשבון שצריך לפנות לזה לא מעט זמן במהלך הסמסטר\n\nהמבחן: הוגן, דומה מאוד למבחני עבר\n\nהשורה התחתונה: קורס די משעמם, לא באמת מסביר לעומק את כל הקונספטים שמועברים שם. קורס חובה אין ממש מה לעשות. מומלץ לקחת ברצינות את השיעורי בית כי זה מה שיעזור הכי טוב להבין את החומר, ולפתור מלא מבחני עבר לקראת המבחן. אפשרי לגמרי להוציא ציון סבבה", "timestamp": 1716453095584}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "אני לא נוהג לכתוב ביקורות אבל אף אחד לא כתב את זה כאן והייתי חייב לציין את מה שיש לי לומר.\n\nבמהלך הסמסטר זה היה הקורס השנוא עליי, לא הצלחתי לעקוב בכלל אחרי ההרצאות והתרגולים והייתי ממש אבוד. תרגילי הבית היו יחסית עמוסים ועזרו להבין את החומר, הייתי ממליץ להשקיע בהם ולנצל אותם כדי לחזור שוב על התרגולים.\n\nלפני המבחן עברתי על כל הקורס מההתחלה ולשם שינוי הסתכלתי גם על הסדנאות, והראייה שלי על הקורס השתנתה מאוד. קודם כל הסדנאות האלו הן זהב!!!! בבקשה תראו את זה ואל תהיו טמבלים כמוני. הדבר שהכי בלט לטובה הוא היחס מהסגל- הם משקיעים בצורה מטורפת (למשל בועז מכין חוברת שמסכמת את כל החומר, ממש ממליצה להציץ), וזמינים מאוד בפיאצה (שזה מרענן מאוד ביחס לקורסים אחרים של סמסטר 4 שלא אציין את שמם). \n\nקיצר זה לא הקורס הכי מעניין שיש אבל הוא ממש חמוד בדיעבד. התרגולים וההרצאות מכסים כמעט את כל החומר אז אם לא מתאפשר לכם להגיע להרצאה אל תתבאסו.\nאחלה של סגל, באמת אלופים. המבחנים הוגנים ובאותה הרמה פחות או יותר בכל סמסטר שראיתי", "timestamp": 1716974769244}, {"author": "123", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ידגר גלה \nחוות דעת - הרצאות: מסבירה את החומר בצורה טובה \n\nשם המתרגל/ת: מוקלט של בועז\nחוות דעת - תרגולים: בועז תותח על מסביר את הכל ממש בצורה מסודרת ועניינית ויודע איפה לתת דגש ולחדד כמה שיותר \n\nשעורי הבית: בגלל המצב היו 2 יבשים ו 2 רטובים היבשים היו ממש בסדר. הרטוב הראשון היה יחסית קשה אבל השני היה יותר סבבה.\n\nהמבחן: \nשניהם היו הוגנים, והסגל לא מחפש להכשיל את הסטודנטים.", "timestamp": 1718718982416}]}