{"posts": [{"author": "כינוי", "difficultyRank": 5, "generalRank": 1, "semester": "201801", "text": "השורה התחתונה:\n1) אם אתה לא בהנדסת תוכנה - לברוח מהקורס כמו מאש.\n2) אם אתה לא עתודאי וכן בהנדסת תוכנה - לעבור מהר לתלת שנתי ולקרוא את 1)\n3) אם אתה עתודאי וכן בהנדסת תוכנה - נדפקת.", "timestamp": 1598178818549}, {"author": "עבד", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "קורס אשפה, לא לבחור בהנדסת תוכנה נטו בגלל הקורס הזה. הסיבה שצה\"ל מכריח עתודאים לקחת הנדסת תוכנה זה הסכם חתום סודי בינו לטכניון שמשיג כוח אדם זול שאפשר להשפיל ולתת לו ציון על סמך ביורוקרטיה ופרזנטציות.", "timestamp": 1621506332192}, {"author": "peasant", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "הציון שלך נקבע על פי כמה אתה יכול להגן על הפרוייקט זבל שהם הכריחו אותך לעשות. אם קיבלת פרוייקט חסר פואנטה שאין סיבה לקיום שלו, מי שנפגע זה אתה. בנוסף, אתה מפתח מוצר לא תוך מחשבה של מה יטיב עם המשתמשים והלקוח, אלא מה יתן לך להראות במצגות שעשית משהו, פיתוח \"agile\" בשקל.", "timestamp": 1621949866437}, {"author": "עתודאי מאוכזב", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "המנחים לא מקצועיים, יש תחושה שהאחראים של הקורס רק רוצים לתת ציונים נמוכים, הפגישות החזרתיות של הקורס משעממות ולא מועילות, ההנדסת תוכנה גרועה, ההרצאות אורח לא רלוונטיות לכלום.\nמה עוד אפשר לומר על קורס שיש בו הכול?", "timestamp": 1713743722012}, {"author": "~ אמת", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "מה עוד לא נאמר על הקורס הנוראי הזה?\nבקיצור אוסף של מנחים גרועים לא יודעים בעצמם את הבסיס הנדרש למימוש הפרויקט. מתפקדים כשוטרים. פגישות שבועיות חסרי תועלת רק בזבוז זמן. בהתחלת הסמסמטר זורקים עלך פרויקט בלי קווים מנחים או הרצאות העשרה ולצערי למנחים עצמם אין מושג איך לממש את הפרויקט. אתם צריכים לחפש הכל ולחשוב על הכל ואם נתקלתם בבעיה לא לצפות למענה כי המנחים לא יודעים. במקרה הטוב יקח להם שבועיים לענות.", "timestamp": 1716031352279}, {"author": "תברחו!", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "סגל מעפן מעפן מעפן! כדאי שהם יקחו קורס בהנדסת תוכנה.", "timestamp": 1717338854811}]}