{"posts": [{"author": "אופ", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: מפוזר בהרצאות, משנה את המצגות תוך כדי, לא מסונכרן עם התרגולים. \n\nשם המתרגל/ת: בועז בן דב\nחוות דעת - תרגולים: מתרגל מצוין, מעביר את החומר בצורה ברורה עם הרבה דוגמאות. את הנקודות הקשות יותר לסטודנטים דואג להסביר בפירוט.\n\nשעורי הבית: עמוסים מאוד. כשיוסי גיל מרצה אחראי, אחוז המגן מאוד לא מתגמל - תלוי בציון המבחן, כך שפחות מ80 על הטופס שיעורי הבית שווים פחות מ20 אחוז. \n\nהמבחן: קשה, המון מקרי קצה ונושאים נישתיים שעולים בהרצאות\\תרגולים.\n\nהשורה התחתונה: מעניין, מלמד, אך קשה מאוד וההשקעה בשיעורי הבית לא כל כך מתגמלת מבחינת הערך בציון הסופי.", "timestamp": 1598017229715}, {"author": "Michael Marjieh", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה:\n יוסי\nחוות דעת - הרצאות: \nהרצאות מעמיקות בתחום\nשם המתרגל/ת: \nבועז\nחוות דעת - תרגולים: \nתרגולים של בועז מאוד טובים\nשעורי הבית: \nשיעורי בית לא קלים ועמוסים\nהמבחן: \nקשה וצריך להבין חומר הרצאות ותרגולים טוב\nהשורה התחתונה:  קורס יפה למי שאוהב להבין יותר מה המושגים של תכנות מונחה עצמים אומרים", "timestamp": 1598017820490}, {"author": "OOP", "difficultyRank": 3, "generalRank": 1, "semester": "201902", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: משעמם\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קשה מאוד, דורש יותר זמן \n\nהשורה התחתונה: קורס משעמם ומיותר, מכשיל. הכי לא מומלץ, לא חשוב לא עבודה.", "timestamp": 1602852554323}, {"author": "SR", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס ליבוב.\nחוות דעת - הרצאות: אחלה מרצה, סבלני מאוד ועונה על כל השאלות.\n\nשם המתרגל/ת: בועז בן דוב\nחוות דעת - תרגולים: תותח ממש, אין מה לפרט מעבר :)\n\nשעורי הבית: לא פשוטים ודי עמוסים, אבל מלמדים מאוד.\n\nהמבחן: קשוח. נכנסים איתך לפינות מאוד קטנות מההרצאות ומהתרגולים. צריך לזכור פרפקט את כל המונחים וגם להבין אותם לעומק. אם הבחירה היא בין לעבור על החומר לעומק לבין לטחון מבחנים - הייתי הולך על לעבור על החומר לעומק. היה לי שבוע בערך ללמוד ואת רובו הקדשתי ללעבור על ההרצאות והתרגולים לעומק. ביום האחרון עברתי על שניים-שלושה מבחנים.\n\nהשורה התחתונה: סה\"כ קורס מעניין לדעתי, הרבה יותר מוצלח מהקדם שלו שפות. המבחן קצת מעצבן ודורש ממך להיות קומפיילר אנושי, אבל מעבר לזה היה ממש אחלה ולמדתי הרבה.", "timestamp": 1613755815485}, {"author": "רון", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אלכס\n\nחוות דעת - הרצאות: \nהרצאות יחסית קצרות אבל עם הרבה נקודות עדינות, מרצה טוב.\n\nחוות דעת - תרגולים: \nתרגולים עמוסים שחלקם קשורים לחלקים לתרגילי בית וחלקם קשורים לחומר התיאורטי. \n\nשעורי הבית: \n2  בשפת squeak, שמלמדים בעיקר בשביל ידע תאורטי. לא כיף גדול, במיוחד שעובדים בסביבת עבודה שיכולה לקרוס מתי שבאלה ולא שומרת אוטומטית. תעשו fileout כל 10 דקות שלא תיפלו כמוני.\n2  בגאווה. תרגילים לא קשים במהות שלהם, ומשלבים יפה כלים של גאווה וחומר תאורטי של הקורס. מלמד תכנות בגאווה ברמה יפה לדעתי.\n1 בCPP. לוקח הרבה זמן אבל מלמד טוב templates. גם לא מסובך, רק הסינטקס לוקח זמן.\n\nהמבחן: \nדורש הבנה/שינון של כל מיני מקרי קצה.\nיש שאלת שיעורי בית שבשבילה צריך ממש להבין ולזכור לעומק איך פתרתם את התרגילים.\n\nהשורה התחתונה: \nקורס שנהנתי בו ונתן כלים טובים, יש הרבה מימז וסגל ממש מוצלח ואכפתי.\nהמינוס הגדול מבחינתי זה המבחן הקשה והתכנות בsqueak.", "timestamp": 1614285261596}, {"author": "U.H", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: קרן לנץ\nחוות דעת - הרצאות: הרצאות מעניינות, מלוות בהרבה דוגמאות, החומר קשה ומלא בטריקים שחשוב לשים לב אליהם לאורך כל הסמסטר\n\nשם המתרגל/ת: מיקול\nחוות דעת - תרגולים: נחמדה מאוד, מסבירה בצורה ברורה מאוד.\n\nשעורי הבית: עמוסים, נראים לא כל כך קשים אבל צוות הקורס מפגיז בטסטים על המון מקרי קצה. \n\nהמבחן: קשה, מלא בטריקים שחייב לשים לב אליהם לאורך כל הסמסטר ויש המון סעיפים מבלבלים מאוד.\n\nהשורה התחתונה: קורס מאוד מעניין, מלמד תכנות מונחה עצמים ברמה גבוהה מאוד, חשוב מאוד לעקוב לאורך כל הסמסטר, להתכונן בשבועות שלפני המבחן לא יספיק אם החומר לא השתקע כמו שצריך לאורך כל הסמסטר.", "timestamp": 1625936110883}, {"author": "Rotem Ben Shlush", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nאלכס\nחוות דעת - הרצאות: \nמעביר את ההרצאות בצורה מעניינת עם הרבה דיונים\n\nשם המתרגל/ת: וידאו מסמסטר קודם\nחוות דעת - תרגולים: \nניסיתי בהתחלה ללכת לאחד המתרגלים הסמסטר ולפי דעתי התרגולים הועברו בצורה לא ברורה. סגל הקורס פרסם לנו תרגולים מהסמסטר הקודם שהיו נהדרים.\n\nשעורי הבית: \nהיו 5 תרגילים:\n2 בסקוויק\n2 בג'אווה\nואחד בCPP.\n\nהתרגילים הבסיסיים בג'אווה וסקוויק היו יחסית בסדר. סקוויק אבל הוא די נוראי, הממשק מזעזע וחשוב כל פעם לדאוג לייצא את השינויים, תיזהרו מזה. אחת הבעיות הגדולות מבחינתי היו שהם לא פרסמו אפילו טסט בסיסי כדי להימנע מטעויות טפשיות של typo או של האופן שבו הם מצפים שנשלח דברים.\nהתרגיל המתקדם בג'אווה הוא נחמד אבל הקושי הוא שהרבה מקרי קצה וההתמודדות איתם לא באמת מפורטים בהוראות התרגיל, אבל אם מתעקשים, מנסים להבין עד הסוף מה צריך לעשות ומציקים עם הרבה שאלות למתרגל האחראי של התרגיל יהיה בסדר.\n\nהמבחן: \nדורש לזכור מלא דברים, יש שאלות שממש צריך להיות קומפיילר.\nבמבחן שלנו זה היה בסדר, אבל במבחני עבר יצא לי לראות ששאלת שיעורי הבית היא די מעצבנת, הם מצפים ממש לזכור את המתודות והחתימות שלהן.\n\nהשורה התחתונה: \nקורס מעניין מאוד, אבל מבחן קשוח", "timestamp": 1647612517702}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שעורי הבית: \n\nסגל לא מקצועי, בתב1 קיבלנו 70, התברר שהיה טעות בבדיקות וקיבלנו לבסוף 100.\nתב 5, אותו סיפור, בהתחלה קיבלנו 33, לאחר בדיקה שלהם קיבלנו 100.\n\nיש סיכוי גבוה שיקרה גם בסמסטר אצלכם, לכן מציע לכם להיות חדים על זה.", "timestamp": 1648482244412}, {"author": "---", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: \nאחלה אלכס! מסביר מצוין ומעניין\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nדורשים השקעה, לא סופר קשים\nהמבחן: \nמשהו לא סבבה בפורמט בלשון המעטה\n- שאלה שקשורה לתרגילי בית, חילקתם עומס עם השותף? השאלה תהיה הרבה יותר קשה...נייס\n- שאלה ממוחזרת מ7 שנים אחרונות - נשמע טוב בהתחלה, אח\"כ אתה מבין שיש 28 מבחנים לעבור עליהם אז 20 נקודות מתנה למי שנפל טוב ולשאר עוד שאלה לא קלה.\n- עוד 3 שאלות על חומר לא קשה, אבל בלחץ של מבחן לשלוח אותנו לחפש טעויות ספציפיות בקוד (על לא פחות מ-4!!! שפות שונות ברמה יחסית מעמיקה) או לבנות שאלות שכל הסעיפים תלויים זה בזה זה קצת חסר אחריות כשיש כל-כך הרבה חומר. ממש אפשר לראות שינוי כשעוברים על מבחני עבר, הרבה יותר שאלות שבוחנות את הידע גם בלי לבזבז חצי שעה על לקרוא ולהבין קטע קוד לא קצר ב3 שפות שונות, או שאלה שלמה על תכונה ספציפית של שפה שראינו בהרצאה אחרונה (לראיה מועד ג' נוכחי ממוצע 66 אחרי 10 אחוז פקטור)\nנוסיף לזה סגל מתרגלים נחמד ביותר אבל סופר לא מקצועי - סטודנטים מצאו טעות במבחן, פנו למתרגלים שאישרו שזו טעות והתקדמו בלי להגיד אפילו לשאר הנבחנים בכיתה\nהשורה התחתונה: \nההמלצות על שפות-אופ-תיכון הן לא הזויות, קורס חשוב ומעניין, אבל בסמסטרים האחרונים זה לא שווה את זה...קחו קורסי בחירה קלילים וכיפיים יותר בלי התסכול הזה.", "timestamp": 1649089986056}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: מרצה מדהים, שווה לבוא בלייב\n\nשם המתרגל/ת: מיני מוקלטים\nחוות דעת - תרגולים: לא הכרחיים, לגמרי אפשר לקרוא את המצגות ולהסתדר. מי שמעדיף יש מוקלטים טובים, המתרגלים בלייב גם היו סבבה ממה ששמעתי\n\nשעורי הבית: חמישה רטובים, השניים הראשונים די קלים אבל שלושת האחרונים קצת עמוסים. הגשה בזוגות, התרגילים בנויים לחלוקת עבודה אז זה לא חייב להיות עמוס מדי.\n\nהמבחן: בסה\"כ מבחן ברמתת קושי סטנדרטית, רק צריך להכנס לראש של הקורס. חשוב לתרגל מבחני עבר. יש שאלת תרגילי בית, אז ממומלץ לעבור על התרגילים והפתרונות שלהם לפני המבחן, אבל בעקרון אפשר להצליח גם בלי. \n\nהשורה התחתונה: יש בקורס הרבה חומר מעניין, במיוחד בחלקים שמדברים על המימושים של מנגנוני פולימורפיזם ב-cpp. זה לא ציון קל אבל מומלץ לגמרי בעיני.", "timestamp": 1667555266416}, {"author": "-", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: אחלה של מרצה.\n\nשם המתרגל/ת: מוקלטים של בועז\nחוות דעת - תרגולים: בועז אשששש פשוט אין עליו\n\nשעורי הבית: עמוסים מאוד, במיוחד של ה- advanced java וגם advanced squeak. \n\nהמבחן: לא פשוט, צריך לזכור כל מיני מקרי קצה מהתרגולים ומהרצאות. כדאי להיות חדים מאוד על החומר במהלך הסמסטר זה יקל מאוד ללמידה למבחן.\n\nהשורה התחתונה: קורס מאוד כדאי, ומלמד המון.", "timestamp": 1677686879413}, {"author": "כריס", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: טל כהן\nחוות דעת - הרצאות: מרצה מדהים. חוויה שונה לגמרי מכל המרצים שנתקלתי בהם עד כה, מדבר תמיד מעניין ולעניין, פרקטי בטירוף.  לדעתי חשוב להגיע להרצאות, מלאות בדוגמאות והסברים מעולים על החומר, ועם הליווי של טל בכלל יוצאים עם כל מה שצריך. \n\nשם המתרגל/ת: ג'וליאן + מיקול מוקלט\nחוות דעת - תרגולים: בתחילת הסמסטר אצל ג'וליאן, סה\"כ מעביר את החומר טוב ורואים שיש לו ניסיון עם הקורס, אבל טיפה מרדים לפעמים. באמצע הסמסטר בערך עברתי להקלטות של מיקול, שהייתה מעולה. \n\nשעורי הבית: מעצבנים אבל שווים את העצבים, לרוב לא נתקלים בבאגים משוגעים אלא סתם בהתעסקויות טכניות קטנות שגוגל לגמרי יכול לפתור. שווה מאוד להשקיע ולעשות כי אם אתם על השיעורי בית לרוב תהיה לכם שאלה מתנה של לפחות 20 נקודות במבחן. \n\nהמבחן: עמוס קצת במושגים תאורטים, אבל עם הכנה טובה והיכרות סבבה עם החומר לא מפתיע אותך יותר מדי - כדאי להיות חדים על כל שפות התכנות (טמפלייטים בcpp, עבודה עם streams ו - reflections ב - java, בלוקים ומחלקות בsqueak וכו) ולהבין טוב את כל המנגנונים מההרצאות - רוב השאלות זה פשוט להקיא את החומר הבסיסי על הדף .\n\nהשורה התחתונה: קורס מעולה, לא עמוס מדי ומבחן בהחלט הוגן, ממש מומלץ.", "timestamp": 1689758948547}, {"author": "צפרדע אנונימית", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אלכס (מוקלט)\nחוות דעת - הרצאות: \nאל תתנו לשם הקורס להטעות אתכם. אם היו נותנים לסטודנט שסיים את הקורס לבחור את השם, כנראה שהייתי בוחר בשם: \"התנהגות עצמים בזמן קומפילציה וזמן ריצה בJAVA, C++, C# וסקוויק\" אבל כמות התווים בשם ארוכה מדי לשם הקורס. תאלצו להסתפק בשם המטעה שהוא \"תכנות מונחה עצמים\". למה מטעה אתם שואלים את עצמכם? כי כל מה שתעשו בהרצאות ובתרגולים זה להבין דקויות הזויות של פעולה של אובייקטים ב4 שפות תכנות שונות ואילו דברים קורים בזמן ריצה ובזמן קומפילציה. ההרצאות הן מתישות אך ההקלטות של אלכס מקלות כי הן קצרות. חשוב לראות את ההרצאות למבחן - הן חלק בלתי נפרד מהקורס.\nטל (המרצה בפועל) הוסיף נושא נוסף לחומר של הקורס, לא נושא קשה במיוחד וסביר.\n\nשם המתרגל/ת: מיקול (מוקלט) \nחוות דעת - תרגולים: \nהחומר של התרגולים לא תמיד חופף עם ההרצאות ושזה חשוב להבין את זה כדי לדאוג להבין את ההרצאות עד הסוף. ממשיכים להעמיק בדברים שעשינו בהרצאה ויחד עם זאת מסתכלים קצת על אלמנטים פרקטיים.\nהתרגולים של מיקול חורגים לפעמים מהזמן של תרגול ממוצע אבל לחלוטין שווה לראות אותם. היא מתרגלת מצוינת ומסבירה מעולה את כל הדקויות שצריך להבין בקורס.\n\nשעורי הבית: במילה אחת? הזויים.\nתרגיל בית ראשון ושני מאוד חביבים ובאמת לא דורשים הרבה עבודה.\nתרגיל בית שלישי רביעי נכתבו כנראה ע\"י כת השטן או משהו ולא ברור איך אפשר ומצופה בכלל מסטודנט בקורס להתמודד איתם. ממולץ לרפרנס (עדיין לא ברור לי איך מישהו עשה את זה ללא רפרונס). מה שכן, כנראה שלאחר הרפרונס יהיה לכם מושג מה ציפו מכם בתרגיל עצמו (וכנראה לא הייתם מסוגלים להגיע להכל לבד, פשוט לא הגיוני).\nתרגיל בית חמישי - סביר, קצת דורש ידע ברקורסיות והוא יכול להיות קצת חופר במיוחד שהוא לסוף הסמסטר אבל אפשר לעשות אותו לגמרי לבד ולהסתדר.\nאני יודע מה אתם חושבים, בדוק chat GPT יכול לעזור. לא. הוא לא. הוא לא מכיר את הדקויות ההזויות האלה בתרגילי הבית. מישהו מאוד נבון שכתב את תרגילי הבית, דאג שהם יהיו מספיק הזויים שהוא כנראה לא יוכל לעזור לכם בכל מקרה.\n\nהמבחן: \nאי אפשר שלא להרגיש במבחן את האופי של יוסי גיל, מייסד הקורס הזה. המבחנים דורשים רמת היכרות לפרטי פרטים של ההרצאות וזה לא תקין ולא נחוץ. זה למה שם הקורס מטעה, המבחן אינו דורש לבצע \"תכנות מונחה עצמים\" אלא דורש ממך לבצע מניפולציות על אובייקטים ולהבין מתי דברים עובדים: זמן קומפילציה וריצה וזה יכול להיות מאוד מבלבל (למי שלא לקח קומפילציה לפני כן).\nיש שאלה אחת מבוססת שיעורי בית שזה יכול להיות קונספט נחמד אם באמת עברתם עליהם כמו שצריך (גם אם לא עשיתם לבד) אבל הסמסטר החליטו משום מה לא לשים תזכורת לתוכן התרגיל והיינו אמורים לנחש לבד את הסינטקס.\nיש שאלה אחת ממוחזרת מ7 השנים הקודמות (כמה פרקטי!) אבל בפועל זה מאוד סביר שתגיעו לשאלה הזאת גם ב3 השנים האחרונות.\nשאר השאלות הן מקוריות ע\"י הסגל ובעיני היו סבירות יחסית. היו דברים קצת מתחכמים אבל לא יותר מדי. ברגע שלומדים את כל הטריקים שהם דורשים בעל פה וזוכרים כל פרט - המבחן ממש זורם ואפשרי. ברגע שלא... תאלצו לחרטט (כנראה לא יעזור).\n\nהשורה התחתונה: מרגישים ברוח הקורס את יוסי גיל גם אם אינו מעביר את הקורס. תרגילי הבית הזויים, ההרצאות נכנסות לרזולוציות לא נורמליות ולא הכרחיות (בעיני) והמבחן מוזר (אבל עם שאלה ממוחזרת - כיאה ליוסי). לא חושב שהייתי ממליץ על הקורס, אבל יש אנשים שמתחברים לקונספטים. לנקודת מבטכם.", "timestamp": 1690382274887}, {"author": "~~", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלכס מוקלט + פרונטלי\nחוות דעת - הרצאות: מרצה מצויין עם אנרגיה טובה ומסביר מעולה. ההקלטות זהות לפרונטלי.\n\nשם המתרגל/ת: בועז מוקלט\nחוות דעת - תרגולים: אחלה מתרגל ממליץ. האלטרנטיבות לא מתקרבות לרמה שלו\n\nשעורי הבית: \n2 בסקוויק\n2 בג'אווה\n1 בC++\n\nלא קשים במיוחד ולא ארוכים במיוחד אבל אני לא אהבתי סקוויק הרגיש כמו בזבוז זמן רציני\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: \nמשום מה יצא לקורס הזה שם של קורס שממש כדאי לקחת ואני לא מבין למה. חוץ מכמה עקרונות חשובים הקורס מלא בפינות חשוכות של קומפילציה וזמן ריצה, רבע ממנו לומדים סקוויק -  שפה שנוצרה למטרה פדגוגית בלבד בזבוז זמן. סה\"כ קורס נחמד אבל לא יותר מזה", "timestamp": 1711820292226}, {"author": "delegator", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלכס ליבוב\nחוות דעת - הרצאות: ראיתי מוקלט, ההרצאות יותר קצרות משעתיים שזה נחמד. פחות יורד לפרטים והסברים אבל סה\"כ לא חומר קשה במיוחד.\n\nשם המתרגל/ת: מוקלט מיקול.\nחוות דעת - תרגולים: מעולה, שווה לראות את המוקלט שלה! היא גם מסבירה בקצב טוב והשקיעה מאוד.\n\nשעורי הבית: רטובים, לא קשים במיוחד אבל הסקוויק בזבוז זמן.\nהדבר היחידי שטוב בת\"ב זה קצת להתעסק עם java.\n\nהמבחן: לא קשה מאוד אבל צריכים לזכור המון דקויות בין שפות\nמה שמעיב על הלמידה.\nהשורה התחתונה: קורס נחמד, מי שמחפש ללמוד מהבית זה אחלה קורס לזה. פשוט לא לצפות לתכנות מונחה עצמים אמיתי.", "timestamp": 1714570655510}, {"author": "l", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: צפיתי במוקלט היה סבבה, יש דברים שלא מכוסים בתרגולים (מימושים שונים למבנה אובייקט, דברים שקשורים ל- templates..)\n\nשם המתרגל/ת: ג'וליאן\nחוות דעת - תרגולים: ג'וליאן הוא אחד המתרגלים הכי טובים שעברו עלי בתואר. רואים כמה הוא בקיא בחומר וכמה זה מעניין אותו ולכן מעניין גם ללמוד ממנו. הוא מעביר את התרגול בצורה כריזמטית ומסודרת ודואג לענות על כל השאלות של הסטודנטים והכי חשוב אצלו שנבין את החומר. שעתיים של תרגול הכי כיפיות שהיו לי כל שבוע, לגמרי ממליצה!!!! בנוסף יש לו הקלטות מסמטרים קודמים אבל לי אישית היה יותר נוח ללכת פרונטלית ויותר סיכוי להישאר על החומר לאורך כל הסמסטר\n\nשעורי הבית: 5 רטובים כל אחד לוקח כמה ימים\nלא טריוויאלי אבל לא בלי אפשרי, מאווווד עוזר להבנה של החומר וגם יש שאלה תב במבחן כך שכדאי לעשות את כל התרגילים ביחד ולא לחלק\n\nהמבחן: קשה ויש בו מלא חומר. אבל תבניתי ואם יש מספיק זמן ניתן להוצאי ציון טוב. אין בו יותר מדי טריקים הם יותר בודקים הבנה\n\nהשורה התחתונה: קורס מעניין למי שמתחבר, אם לוקחים חייבים ללכת לתרגולים של ג'וליאןןןןן!!!!!", "timestamp": 1714655401762}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: אחלה מרצה. מסביר בצורה מאוד ברורה את החומר, וגם שלא מבינים ושואלים הוא מסביר עד שמבינים. \n\nשם המתרגל/ת: מיקול/בועז מוקלט\nחוות דעת - תרגולים: לרוב אני הולך לפרונטלי גם בהרצאות וגם בתרגולים, פחות התחברתי אבל למתרגלים הסמסטר. יש כאלה שממש אהבו אז זה תלוי בן אדם. \nאישית אהבתי את המוקלטים של מיקול ובועז (התחלתי עם אלה של בועז ואז עברתי לאלה של מיקול).\n\nשעורי הבית: 5 תרגילי בית.\nהתרגילי בית לא קלים ולוקחים זמן, הם לא ממש ממש עמוסים אבל הם לא קלים. מרגיש לי מיותרים האלה של ה squeak, לא מבין למה ממש צריך 2 תרגילי בית בזה. התרגילי בית של ה java חמודים אבל לא קלים. \n\nהמבחן: מבחן הוגן, אבל בגדול צריך לזכור הרבה דברים מההרצאות והתרגולים, כל מיני דקויות קטנות.\nאפשר להוציא בזה ציון גבוה\n\nהשורה התחתונה: קורס נחמד, הוא לא קורס בחירה ואוווו, אבל לא קורס בחירה גרוע, פשוט נחמד", "timestamp": 1715261102639}, {"author": "Polymorphic class", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אלכס מוקלט\nחוות דעת - הרצאות: די בסדר\n\nשם המתרגל/ת: כולם\nחוות דעת - תרגולים: עברתי על כל המוקלטים, חבל שמתרגלים בקורס בטכניון לא יודעים את החומר, לא יודעים לענות על שאלות, בקושי מעבירים את התרגול, וכמובן בסוף כותבים מבחן כאילו נולדנו עם ידע בתמ״ע. תלכו על מוקלט של ניקול, לא מצויין אבל די בסדר כדי להבין את החומר\n\nשעורי הבית: תת רמה של תרגילים ועמוסים בטירוף.\n\nהמבחן: מבן הפעלה 2, צריך לשנן הרבה מאוד חומר שזה לא שווה כלל לקורס שהוא 3 נקודות, דקויות קטנות עד רמת שקופית אחת, שאלה ממוחזרת מ-7 שנים האחרונות שאם תתחיל לפתור תסיים אותם אחרי מועד ב של הסמסטר הבא.\n\nהשורה התחתונה: אל תיקחו, זה הקורס הכי לא מעניין, לא יפה, לא קשור לתעשייה, כלום.", "timestamp": 1716147187117}, {"author": "עייפתי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: ראיתי את המוקלטים של אלכס, לדעתי הם אחלה. אלכס כבנאדם גם אחלה לדעתי.\n\nשם המתרגל/ת: גוליאן -> מיקול מוקלטים -> בועז ונתן מוקלטים\nחוות דעת - תרגולים: נתן ובועז לדעתי טובים יותר מכל שאר האופציות\n\nשעורי הבית: הגשה בזוגות של תרגילים דיי כבדים כשיש שאלה במבחן שמבוססת עליהם ובגלל זה קשה לחלק עבודה בין השותפים\n\nהמבחן: \nכמו שאמרו פה לפני, מבחן שבנוי על המון דקויות מעצבנות ומצפים ממכם להבין את זה מספיק לעומק כדי לבנות קוד שמכסה את העיניין.\nקשה להגיד כמה המבחן שלכם יהיה קשה כי הקושי שלהם נע בין סבבה לקשה מאוד בין מועד למועד באופן לא צפוי.\n\nהשורה התחתונה: קורס עמוס מאוד מבחינת חומר, אם אין לכם זכרון מעולה או המון התנסות עם השפות, קשה לנווט את הקורס לקראת המבחן.\nאבל יש בונוסים על מימז טובים (לפי טעם הבודק), אז זה הולך בשביל הקרוס הזה.", "timestamp": 1716290106646}, {"author": "Metaclass class", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: חצי סמסטר הלכתי להרצאות פרונטלי ובחצי השני ראיתי הקלטות. למרות שזה ממש נוח שיש הקלטות רלוונטיות לגמרי כמו אלו שאלכס מפרסם באתר, אולי שווה ללכת להרצאות שלו כי יש לא מעט נושאים שמעלים שאלות וחשוב לסגור פינות לא ברורות על החומר של ההרצאה כי בסוף כל מה שמועבר בהרצאה יכול להיות במבחן (כן, הכל - לא סיבה להלחץ כי אין כל כך הרבה חומר, אבל חשוב מאוד להבין דברים שאלכס מתעכב עליהם, לא סתם הוא מתעכב עליהם - מאוד סביר שהוא ישאל עליהם במבחן :) ). אלכס מרצה טוב, עונה בכיף לשאלות ושמח לקיים דיון בהרצאה, וגם נשאר אחריה לענות על שאלות בשמחה.\n\nשם המתרגל/ת: ג'וליאן לכמה תרגולים, מוקלט של בועז רוב הסמסטר, מוקלט של מיקול פה ושם.\nחוות דעת - תרגולים: בועז מתרגל מדהים!!! שולט בחומר, מסביר מעולה, ובאמת אחלה של בנאדם (אלה הקלטות אבל בכל זאת). ממש ממליץ. גם מיקול ממש אחלה, שווה לנסות. ג'וליאן שולט בחומר מצויין אבל התקדם מהר מדי בשבילי. \n\nשעורי הבית: לא קשים מדי, פשוט דורשים השקעה. לנו היו תרגילים קצת מקוצרים בגלל שהסמסטר התקצר בשבוע, אבל נראה שהם לא רחוקים מהרמה הרגילה. למי שקורא כאן ביקורות שאומרות שהתרגילי בית מפחידים ועמוסים והזויים ואמאלההה... לא. הם בסדר. באמת. לא יותר עמוסים מכל קורס תכנות שהיה לכם עד כה, ועם הנסיון שצברתם עד כה (ואם אתם חרוצים ורציניים) יהיה ממש בסדר. אם תקחו משהו אחד מהביקורת הזאת, ואני מבקש שתזכרו את זה - לא משנה איך את מחלקים את העבודה על התרגילי בית - תהיו מעורבים בצורה כזאת או אחרת בכל חלק של כל תרגיל בית! כמו שבטח כבר ראיתם, יש במבחן שאלה אחת שמבוססת על תרגיל בית. לפעמים השאלות האלה יותר הבנתיות וזה לא נורא אם לא ממש עשיתם את אותו התרגיל בית ששואלים עליו, ולפעמים הן ממש מתבססות על זה שכבר פתרתם את התרגיל ואתם זוכרים (גם אם במעורפל, וזה בסדר גמור) חלקים מהתרגיל עצמו. זה לא יהיה סוף העולם אם לא תדעו כל פסיק בכל תרגיל בית כל עוד אתם יחסית שולטים בחומר, אבל זה די הימור, אז תשתדלו להיות מעורבים בהכל (ובטח לא לוותר לגמרי על תרגיל בית כלשהו כי השותף יפתור אותו ואתם תפתרו את הבא בתור או משהו כזה).\n\nהמבחן: יש ויש. רוב המבחנים באמת באמת סבבה, בודקים הבנה ולא מתחכמים יותר מדי. יש מבחנים קצת יותר קשים עם שאלות מתקילות. בגדול, אם למדתם בצורה סבירה במהלך הסמסטר והקדשתם לקורס זמן בנסיון להבין את החומר ולפתור תרגילי בית (שמאוד מאוד תורמים להבנה! שלא יגידו לכם אחרת), ויש לכם זמן לפתור כמות סבירה של מבחני עבר, אתם יכולים להוציא אחלה ציון.\n\nהשורה התחתונה: לדעתי האישית, קורס פשוט מעולה. למי שאוהב תכנות, חשוב לו להבין טוב יותר את השפות שהוא כותב בהן, להבין איך הן בנויות ומה הן מאפשרות/איפה הן יכולות להיות בעיתיות, זה פשוט קורס מעולה לזה. לומדים יותר לעומק על ++C, לומדים על Java בצורה שמאפשרת היכרות לא רעה יחסית לזה שלא לומדים רק עליה (התרגולים של Java קצת עמוסים בחומר כדי להספיק ללמד לא מעט), קצת על #C אבל ממש בקטנה, וכן, לומדים על סקוויק, שפה מגניבה ממש! סבבה, כנראה אין לה שום שימוש בחיים האמיתיים ותוך חודשיים לא תזכרו אותה, אבל היא מראה בצורה מעולה עקרונות של OOP וברור לי לגמרי למה בחרו להשתמש בה כדי ללמד. בכללי, לדעתי שפה ממש כייפית וקלילה שקצת מזכירה פייתון אבל יותר מטורללת. רק לציין שזה לא שתצאו מהקורס הזה מומחים ב++C או בJava, אבל כן תצאו עם עוד קצת ידע לגביהן ותכירו צדדים חדשים של שפות תכנות מונחות עצמים שכנראה לא הכרתם עד עכשיו ולא יודע איפה עוד תצברו ידע כזה בזמן כזה קצר. אציין שלא לקחתי לפני כן שפות תכנות, אז למי שמתלבט לגבי זה, לדעתי אין שום צורך בקורס הזה כקדם ואפשר להסתדר בלי שום בעיה בלעדיו.", "timestamp": 1716940059822}]}