{"posts": [{"author": "-----", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יונתן בלינקוב\nחוות דעת - הרצאות: \nהקורס בנוי בצורה שונה מקורסים רגילים בטכניון.\nיש במערכת שעתיים הרצאה ושעה תרגול ברצף, אבל בפועל איך שזה עובד זה שלפני כל שיעור שולחים פרקים מספר כלשהו לקרוא ואז כשמגיעים לכיתה (נוכחות חובה) אז פותרים תרגילים בכתיבת קוד על החומר.\nלרוב נדרש לקרוא משהו בין 8-20 עמודים לפני השיעור והתרגילים עצמם בשיעור לא ככ קשים אבל דיי מלמדים.\nבכללי יונתן בחור מאוד נחמד ומאוד עוזר וגם שאר הסגל אנשים מאוד נחמדים שרק מחפשים לעזור להבין.\n\nשעורי הבית: יש 4 מטלות שמתפרסמות לאורך הסמסטר בנוסף לעבודות בכיתה, העבודות גם כן לא קשות וחוזרות על חומר שראינו בכיתה רק טיפה יותר לעומק. משיגים בהם לרוב ציונים טובים.\n\nהמבחן: אין מבחן, יש 2 בחנים קצרים של שעה וחצי לאורך הסמסטר, הבוחן הראשון באמצע הסמסטר והבוחן השני לקראת סוף הסמסטר. הבחנים לא קשים יותר מידי אבל כן מרגישים לחוצים בזמן.\n\nהשורה התחתונה: לאנשים שאוהבים להבין חומר מקריאה ותרגול (כמוני) זה קורס נהדר ומעניין. הבחנים קצת קאדר ולא ברור למה צריך אותם כשיש ככ הרבה דרכי הערכה חלופיות אבל הם לא סוף העולם.\nסה\"כ אחלה קורס, מומלץ", "timestamp": 1655549758210}, {"author": "Noam Koren", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם מרצה: יונתן בלינקוב\nחוות דעת - הרצאות: \nעמוס\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nעמוס\nשעורי הבית: \nעמוס\nהמבחן: \n\nהשורה התחתונה: עמוס", "timestamp": 1662316074806}, {"author": "epsilon", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: יונתן בלינקוב\nחוות דעת - הרצאות: הקונספט של הקורס הוא כיתה הפוכה. קוראים את החומר בבית, ואז מגיעים לכיתה ומתחילים לעבוד על משימה (קוד) שקשורה לחומר. פעם בכמה שבועות יונתן נותן הרצאת מבוא על הנושאים שיהיו בשבועות הקרובים בקורס. ההרצאות של יונתן מצוינות. אני ממש אהבתי את הקריאה העצמית, כל שאלה שהייתה לי נענתה בפיאצה במהירות וזה היה לי יותר אפקטיבי מאשר להקשיב להרצאה.\n\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: חמודה מאוד! נכונה לסייע.\n\nשעורי הבית: קצת ארוכים, מזכירים את למידה עמוקה אם כי הם יותר קלים מאשר למידה עמוקה. לא צריך ממש לכתוב דברים מאפס ברוב המקרים אלא להשלים שורות קוד חסרות. \n\nהמבחן: היו 2 בחנים קלים. אם עשיתם כמו שצריך את המשימות של הקוד ועברתם עליהן לפני המבחן, זה 100 קל.\n\nהשורה התחתונה: ממש מעניין, אני ממליצה מאוד. יונתן מקסים. זה כן קורס קצת עמוס, משהו בין מבוא לבינה (שלדעתי לא עמוס) לבין למידה עמוקה (שלדעתי כן עמוס). הציונים היו בסופו של דבר ממש גבוהים.", "timestamp": 1663921564954}, {"author": "סטודנט שאוהב דיפ", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "קצת על התפלגות הציון:\n\n1. יש שני בחני אמצע, כל אחד היה 25 אחוז מהציון - אחד בערך באמצע, אחד לקראת הסוף. המועדים שכתובים באתר לא קשורים, אחד מהם הוא היום שעושים בו את המועדי ב של שניהם (לא באותו זמן).\n\n2. יש תרגילי בית די עמוסים, עם שותף שאתם בוחרים, היו 4 כאלה בסמסטר. דומים מאוד למעבדות ומאוד הסתמכנו עליהן.\n\n3. המעבדות - החלק המעניין והשווה של הקורס.\n\nמבחינת שותפים - הקורס מחולק ל-4 חלקים, לכל חלק יש נושאים שונים, בכל אחד יש תרגיל בית גדול, ובכל אחד *מגרילים* שותף במעבדה מתוך האנשים בקורס. כולם מעל הממוצע וחזקים אז אין מה לדאוג, המעבדות גם קלות.\n\nהמעבדות - אין הרצאות ותרגולים, יש 3 שעות בשבוע עם חובת הגעה.\nמפרסמים בתחילת המעבדות את 2 המעבדות (דוחות/מחברות jupyter) שצריך לעשות. יונתן והמתרגלים מסתובבים ועוזרים עם שאלות וגם סתם מדברים על התחום. יונתן מקסים ומכיר את רוב האנשים בשם הפרטי.\nצריך להשלים כל מיני דברים במחברות, לעשות ריצות ידניות על אלגוריתמים של עיבוד שפה, ולבנות מודלים בסיסיים של שפה (Naive-Bayes, Markov Chains, RNN, LSTM, Transformer) \nיש המון חפיפה עם התרגילי בית.\n\nרוב המעבדות קלות יחסית, בערך חצי מהן אני והשותף התורן סיימנו אחרי שעה, השתיים האחרונות עם טרנספורמרים היו עמוסות יותר מכל הקודמות ביחד שזה קצת חבל בסוף סמסטר.\nההגשות של כל המעבדות הן ליומיים אחרי המעבדה אם צריך להשלים או משהו.\n\nהשורה התחתונה: \nהקורס הכי טוב שעשיתי בטכניון, ככה צריך ללמד וללמוד ובבקשה שכולם ילמדו מיונתן איך מלמדים ושומרים אנשים על החומר.\nתעשו לפני הקורס הזה לומדות, מומלץ דיפ צמוד/לפני אבל לא חובה.\nנהנתי מכל רגע, הייתי עושה שוב גם פעמיים אם היו נותנים לי.\nקורס די עמוס, אבל בפער הכי טוב שעשיתי.\n5 נפצים.", "timestamp": 1673344242011}, {"author": "Noam Wolf", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: בלינקוב\nחוות דעת - הרצאות: אין כמעט הרצאות, רק מעבדות שהם סבבה, לא קשים מדי בדרך כלל חוץ מבסוף. אבל יש רפרנסים\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: המתרגלים סבבה, לא כל כך רלוונטים האמת. מרובם הרגשתי שהם סתם שם\n\nשעורי הבית: ממש עמוס האמת, לא תואם את ניקוד הקורס.\n\nהמבחן: מועד א סבבה. במידה ולא הצלחתם אל תנסו לגשת אפילו למועד ב. פשוט לא שווה את זה. \n\nהשורה התחתונה: \nקורס עמוס לכמות הנקז. לא מעודכן ממש, כמעט לא נוגעים בטכנולוגיות החדשות שיש היום. המרצה די מתנשה, ולא מתחשב. אני אישית לא חשבתי שהקורס שווה את זה. זה רק מתמלא בגלל השם שלו לפי דעתי. לא כל כך נהנתי ולא הרגשתי שזה מאוד רלוונטי. לא הייתי ממליץ עליו, לפי דעתי זה מהקורסים שהבתילה היה ממוצע גבוהה אז אנשים עפו על זה, ועכשיו כבר מנרמלים למטה והסגל כבר עייף לגמרי.", "timestamp": 1689516894912}, {"author": "pay attention", "difficultyRank": 5, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יונתן בלינקוב\nחוות דעת - הרצאות: היו 4 הרצאות במהלך הסמסטר, אחת לפני כל חלק חדש בקורס. בגדול עוברים על שקפים ומקבלים תחושה ראשונית לחלק שעומד לבוא. יונתן מרצה סבבה וסך הכל נחמד מאוד.\n\nשם המתרגל/ת: יש 3 מתרגלים שמסתובבים, שקד זאק וטל.\nחוות דעת - תרגולים: לפי הרגשתי זאק היה הכי נכון לעזור ורואים שהוא עושה הכל מהלב. לפני המועד א' גם נתן 2 שעות קבלה על החלק האחרון של הקורס והיה ניכר שחשוב לו שנבין. נשמה טהורה.\n\nשעורי הבית: 4 פרוייקטי בית עם שותף לבחירה. לא כיף, די עמוס, לא מאוד רלוונטי למה שקורה היום בתחום.\n\nהמבחן: יש בוחן אמצע ועוד מבחן שהוא כמו בוחן אמצע. שאלות לא קלות, מבלבלות, ומאוד עמוסות יחסית לזמן שניתן. כתוצאה מכך בבוחן מועד א' + מועד א' של מבחן נתנו תוספת של 20 דק.\n\nהשורה התחתונה: האווירה הכללית הייתה של באסה. מצד אחד לקורס קוראים מבוא, מצד שני אתה מצפה ללמוד על דברים שהם אולי לא state of the art אבל קרובים לזה, וזה לא קרה כאן. מדברים על טרנספורמרים רק במעבדה האחרונה ביותר, וכדי שנצא עם איזשהו ידע בסיסי בנושא, זאק עשה 2 שעות קבלה לפני המבחן. מי שרוצה ללמוד באמת את התחום צריך לקחת קורס המשך וחבל.\nכמה דברים חשובים:\n- כמו שאמרתי הקורס מיועד לתת יותר סקירה היסטורית של מודלים שהשתמשו פעם, לא תחוו ממש טכנולוגיות חדשניות, אולי עדיף להתעניין בקורס של נתונים ולראות מה קורה שם.\n- שיעורי בית עמוסים, לוודא שיש שותף טוב.\n-לא התחברתי לקונספט של האקראיות של השותפים במעבדות, סיכוי לא קטן ליפול על מישהו שלא תורם.\n-בחנים קשים שכנראה באו לנרמל ממוצע.\n-תרגיל בית 4 יוצא ***לתוך תקופת מבחנים ועד לסופה*** והוא גם הכי עמוס, ראו הוזהרתם. כרגע הקורס לא מוכר כפרוייקט, אולי זה ישתנה בעתיד.", "timestamp": 1689858893163}]}