{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המתרגל/ת: מתרגל אחראי תום סופר\nחוות דעת - תרגולים: אין כ\"כ תרגולים, רק בתחילת הסמסטר.\n\nהפרויקט:\nהחיובי: כל צוות מחליט מה הוא עושה ומגיש הצעה, הצוות נותן נקודות לשיפור - אז בגדול אפשר להחליט מה עושים, כמה הפרויקט הולך להיות מורכב, מידת השקעה נדרשת, וכו'.\nהשלילי: הסגל לא עוזר *בכלום*. שום דבר. לקח לפעמים שבועות רק לקבל תשובה במייל, שלא לדבר על לקבוע פגישה להכוונה. \nגם בפגישה, היחס מזלזל עד כדי משפיל, בלי שום התייחסות לעבודה שהצוות כבר עשה. קיבלנו תשובות מזלזלות ומביכות ברמה שלא הייתה מתקבלת באף קורס חובה מאיש סגל, חוסר ידע בסיסי מצד המתרגלים בחומר הרלוונטי לפרויקט שהם אחראים עליו (לכל פרויקט יש מתרגל שאחראי עליו באופן אישי). \nעושה רושם שרוב המתרגלים הם סטודנטים שעשו את הקורס בסמסטר הקודם, ולא טרחו להרחיב את הידע כדי להיות מסוגלים לעזור למי שהם אחראים עליו.\nהסגל אפילו לא יודע להגיד מתי ההגשה הולכת להיות. פשוט ביזיון.\n\nהשורה התחתונה: \nאם עובדים באווירה טובה, הפרוקט יכול להיות כיפי.\nלא לצפות לשום דבר מהסגל, ולא להתאכזב.\nמידת ההשקעה תלויה במידת האמביציה של הפרויקט שאתם מחליטים לעשות.", "timestamp": 1624977275951}, {"author": "מיכאל", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לא הייתי לוקח אותו בדיעבד. זה התעסקות בשטויות וציונים לא גבוהים. הסגל לא תומך.", "timestamp": 1633249950869}, {"author": "נפגעת הקורס", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המתרגל/ת: תום סופר\n\nאמל\"ק: הפרויקט הכי מזעזע שקיים בטכניון!!!!!!\n\nבהרחבה:\nמעבר לזה שאין שום עזרה טכנית לאורך הקורס (וזה לא חומר שקל ללמוד לבד, מי שאין לו רקע או סיוע די אכל אותה) - הסגל פשוט מזעזעעעעעעעעע!!!\nהסגל הכי גרוע שהטכניון ראה אי פעם.\nבקורס הזה הציונים מחולקים בצורה יחסית, ז\"א שגם אם תעשו פרויקט מושלם שעובד - אתם יכולים לקבל רק 90 (ולפרויקט מושלם זה נמוך).\n\nתום קובע בשבילכם מה הפרויקט שתעשו - חלק מהפרויקטים יותר מעניינים וחלק פחות. בסופו של דבר הציון נקבע לפי מה שמעניין ומוציא לסגל שם טוב - ז\"א שאם תעשו רובוט מצייר אוטומטית תקבלו יותר מפרויקט שעושה משהו פחות מגניב (ולא משנה אם הפרויקט השני קשה ומורכב יותר!!!).\nהציונים מחולקים בצורה פופוליסטית!!!!!!!!!!\n\nעל מה עוד מורידים ציון?\n-נתקלם בבעיה ופתרתם אותה? בום מינוס ניקוד (אז מה אם פתרתם אותה תוך יום ואפילו עזרתם לאחרים, הסגל מוריד ניקוד).\n\nבנוסף, אין גם אפשרות לערער. טכנית, הסגל נותן זמן עירעורים אבל בפועל הוא לא יקרא את העירעור שלכם בכלל, ויחזיר תשובה מזלזלת. חבל על הזמן שלכם, לכו תעשו פרוייקט מרופרנס בבינה.\n\nחיובי: תחת תום יש מנחה שנפגשים איתו מדי שבוע, ושלנו היה יותר נחמד בהרבה. בנוסף איתי דברן אדם מאוד נחמד וסימפתי, אבל זה פשוט לא מספיק בשורה התחתונה, כי מי שקובע את הציון זה תום ולא הוא, ואצלו הכל פוליטיקה. \n\nבושה לפקולטה שקיים קורס כזה, שמחלק ציונים בצורה פופוליסטית, מזלזל בסטודנטים שלו ועם סגל שאכפת לו רק מנירמול ממוצע ומכתבות בynet. \n\nתברחו.", "timestamp": 1662596922093}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "202203", "text": "שם המרצה: איתי דברן\nחוות דעת - הרצאות: \nאיתי הוא אדם מאוד נחמד ואהבתו לתחום מורגשת, למרות שלא נכחתי בכל ההרצאות אבל כיף ללמוד ממנו.\n\nשם המתרגל/ת: יוסף\nחוות דעת - תרגולים: \nאחלה של מתרגל, מי שמקבל אותו כמנחה לפרויקט זוכה.\nרואים שאכפת לו מהסטודנטים ושהפרויקטים יהיו ברמה גבוהה, תמיד עזר לנו כשפנינו אליו וידע לתת הכוונה וחוות דעת עניינית ומקצועית.\n\nהמבחן: \nמבחן קל יחסית, צריך לדעת את כל החומר שבהרצאות והתרגולים.\n\nהשורה התחתונה: פרויקט מעניין, מלמד המון וכיף לעבוד עליו.", "timestamp": 1718055915783}]}