{"posts": [{"author": "כינוי", "difficultyRank": 4, "generalRank": 1, "semester": "201901", "text": "שם המרצה: אסף שוסטר\nחוות דעת - הרצאות: מאוד משעממות ותיאורטיות. מרגיש שהן לא עוזרות ולא תורמות להמשך.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מלמדים קצת על איך לחלק עבודה באימון רשת נוירונים. בנוסף, לומדים על ספריות לחישוב מקבילי בפייתון (אפשר ללמוד את זה גם לבד ולא צריך את הקורס בשביל זה).\n\nשעורי הבית: מאוד לא ברורים. יש צורך לפנות למתרגל כ5 פעמים לכל תרגיל בית כדי להבין מה רוצים שנעשה בתרגיל.\n\nצריך שיהיו משאבים (gpu, cpu) פנויים בשרת כדי להריץ את הקוד (לבדוק שהוא עובד וכדי להציג את הפלט של הקוד בדו\"ח).\nבסופו של דבר יוצא שסטודנטים משאירים את הקוד רץ על השרת ואז אי אפשר להריץ וזה תוקע אותך במשך כמה ימים....\n\nמלמדים בעיקר על איך לחלק נכון עבודה לתהליכים ואיך להשתמש בספריות של חישוב מקבילי.\n\nהוחזרו עם משוב לא ראוי ולא תמיד ברור על מה ירדו נקודות.\n\nהמבחן: אצלינו הורידו נקודות על דברים שלא למדנו ולא ראינו כלל בקורס (לי אישית הורידו 6 נקודות על דברים כאלה).\nנדרשו מאמצים רבים מהנציגים כדי שיעלו את הנקודות בחזרה (בסוף החזירו את הנקודות).\nזה מוכיח שהסגל בעצמו לא ידע מה הולך בקורס.\n\nבנוסף, הסגל לא עמד בכללים של להחזיר תשובות לערעורים מספר ימים לפני המועד ב'.\n\nהשורה התחתונה: \nהדבר היחיד שלקחתי מהקורס זה לחלק עבודה בין תהליכים והספריות לחישוב מקבילי, אפשר ללמוד את זה גם לבד. \n\nמההתנהלות של הסגל לא הייתי ממליץ לקחת את הקורס.\nהסגל סותר את עצמו, ולא יודע מה מימינו ומה משמאלו.\nההממוצע הגבוה נובע מכך שנתנו 5 נקודות מתנה למבחן למי שמילא את משאל המרצה והמתרגל.", "timestamp": 1598178580587}, {"author": "ליל שיפי", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: שוסטר\nחוות דעת - הרצאות: משעממות רצח. חומר מפגר. המרצה מעביר בצורה די משעממת, \nאבל גם הוא לא אשם שהחומר מפגר ולא מובן בעליל. אין לי מושג עד עכשיו על מה הוא דיבר בהרצאות שלו. אם מישהו צריך חומרי הרדמה מומלץ ללכת להרצאות, אבל בכללי במבחן בסוף שואלים שאלות על מה שהיה בהרצאה אז באסה רצח.\n\nשם המתרגל/ת: עמית איזינגר\nחוות דעת - תרגולים: משעממים נורא, החומר מאוד לא ברור ומשעמם רצח. עמית העביר אותו בצורה טובה בסהכ אבל גם הוא היה מתבלבל לעיתים... הוא לא אשם בזה שהחומר מתסבך ומבלבל ולא ברור לאפחד.\n\nשעורי הבית: קשים מאוד אבל מרופרנסים משנים קודמות. הסגל לא מבין מה הוא רוצה מאיתנו כשהוא מפרסם תרגיל.\n\nהמבחן: דפוק, קשה ומתסבך. חלק רטוב מזעזע וחלק אמריקאיות עוד יותר דבילי ומבלבל.\n\nהשורה התחתונה: הקורס הזה גורם לשפות תכנות ולאת\"מ להיראות מעניין רצח. תתרחקו, אל תיקחו, משעמם רצח, לא פרקטי ומלמד על דברים איזוטריים שגם אפשר ללמוד לבד אבל לא שימושיים בכלל. הסגל לא מבין בעצמו מה הוא רוצה מאיתנו, הוא לא מתואם על שום דבר וכל הקורס הזה מזעזע בצורה מחרידה ומועבר בצורה משעממת ולא מעניינת בכלל", "timestamp": 1613744730607}, {"author": "Lamport", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "משפט: מקבוזר קורס מעצבן\nהוכחה: \"ברשות סגל הקורס נתוני הצפייה בכל הסרטונים של הקורס ונתוני הנוכחות במפגשי הזום. רוב הסטודנטים מתקדמים כראוי ודואגים לצפות בסרטונים בלוח הזמנים של הקורס.\nקיימת קבוצה קטנה של סטודנטים שנמצאת מאחור ולא מסונכרנת עם שאר הקורס ואנחנו מודאגים מהיכולת של חבריה לעבור את הקורס.\nקבוצה זו עשויה לקבל התחשבות פחותה כשיגיע הרגע לדבר על ציונים\"\n\nשורה תחתונה: אסף לא מאוד נחמד, מהמרצים האלה שלא מבינים את הפרספקטיבה של סטודנט מתקשה. אצלנו ספציפית היו מתרגלים ממש נחמדים (עמית ושגיא קבלו shout out), אבל זה לא מחפה על זה שהקורס משעמם ולא מלמד מאוד.", "timestamp": 1613851949629}, {"author": "איתי אלפסי", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: אסף שוסטר\nחוות דעת - הרצאות: הרצאות מזעזעות. אסף מרצה לא טוב בלשון המעטה, ובקושי יש קשר בין הרצאות בקורס.\n\nשם המתרגל/ת: עמית איזינגר\nחוות דעת - תרגולים: מתרגל ממש טוב. אם ישאר הוידיאו של הסשנים שלו, ממליץ :)\n\nשעורי הבית: שלושה תרגילים רטובים, לא בעייתיים אם חוזרים על התרגולים לפני. עבודת פייתון לא סופר מורכבת.\n\nהמבחן: למבחן אין שום קשר למבנה הקורס. שאלות אמריקאיות על שקופיות נשכחות מההרצאות, ושאלות תכנות מבוססות על התרגולים. מבחנים לא ברורים בלשון המעטה.\n\nהשורה התחתונה: אם אתם לא חייבים לקחת את הקורס, חכו עד שמישהו יחליף את שוסטר.", "timestamp": 1614067136616}, {"author": "טסטר צ'ויס", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אסף שוסטר\nחוות דעת - הרצאות: מזל שהקורונה הגיע הסמסטר כי אז אפשר לשמוע הרצאות מוקלטות של אסף בפי 2 מהירות. חייב לציין שמרדים גם במהירות כזו. מעבר לכך שלא העביר את החומר בצורה טובה, הרגיש שהוא ממש ראש בקיר ואין עם מי לדבר. במועד א שאל שאלות על שורה וחצי שאמר בהרצאה בעל פה, ועוד כמה שאלות שיש כמה תשובות נכונות (אמר במופרש בהרצאה שמשהו מתקיים) אבל במבחן האמריקאי נתן כמה אופציות וקיבל רק אחת מהן. מעבר לכך הוא מתבלבל הרבה בין מושגים ואומר דברים מבלבלים ומטעים והסגל לא סגור ב100% מה נכון. יש מספר תשובות (לא גדול אבל קיים) במבחנים שפשוט אומרים דברים שונים לחלוטין בין שנה לשנה. התנהלות לא כיפית של המרצה בסמסטר.\n\nשם המתרגל/ת: שגיא לבנון\nחוות דעת - תרגולים: נקודת אור של הקורס הזה. גם שגיא וגם עמית מעולים. זמינים מאוד במייל ועונים די מהר בפיאצה, ובאמת אכפת להם מהסטודנטים, נוסף לכך שהם מעבירים את החומר די טוב.\n\nשעורי הבית: דווקא די מעניינים, ומאוד רלוונטים לדברים שאפשר לעשות (ללמוד איך לכתוב לGPU יכול לעזור בהרבה מקומות)\n\nהמבחן: איזה רעות. חלק רטוב של כתיבת קוד שהוא סבבה וחלק אמריקאי שגם אם אתה לומד טוב אי אפשר לדעת מאיפה הוא מביא שאלות הזיה והאם הן בכלל בחומר. בסוף אבל מפוקטר לממוצע גבוה\n\nהשורה התחתונה: החומר של התרגולים מעניין. החומר של ההרצאות מעניין את התחת. תלוי בנאדם. לדעתי אם ההרצאות היו מועברות בצורה סימפטית והמבחן היה סבבה אז זה קורס מומלץ מבחינת רלוונטיות לחיים וממוצע די גבוה. יכול להיות שבכל זאת שווה לקחת אותו", "timestamp": 1615822822315}, {"author": "צפרדע אנונימית", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אסף שוסטר\nחוות דעת - הרצאות: \nנדיב לקרוא להן הרצאות.\nרוב הסמסטר אסף פירסם הקלטות וביקש לצפות בהם בטענה שהוא מקיים כיתה הפוכה. הכיתה ההפוכה הייתה בראשון בבוקר ולפעמים הוא לא טרח לפרסם את ההרצאות עד ליום ראשון עצמו. גם כשפרסם הוא נטה לפרסם הקלטות באורך של 2.5-3.5 שעות אז כמו שניתן להבין, רעיון הכיתה ההפוכה נזנח בשבוע 1 לסמסטר.\nשאר הסמסטר היו הרצאות אורח/הרצאה פרונטלית של אסף (4 כאלו לדעתי).\nמבחינת תוכן ההרצאות: מ-ש-ע-מ-ם! האם זה קורס בתוכנה? האם זה קורס בחומרה? אוסף של נושאים רנדומליים וחסרי קשר שהתסבכו אחד בשני ויצרו את הקורס הזה שנקרא \"תכנות מקבילי ומבוזר\". אני לא מגזים כשאני אומר ש90% מתוכן הקורס הזה מיותר ולא נחוץ בכלל. יש אולי נושא אחד או שניים שבאמת פרקטיים לתעשייה והם GPU וMPI ואפשר ללמוד אותם לגמרי לבד גם בלי הקורס הזה.\nאוסיף ואגיד שאם ההקלטות של אסף היו שוות צפייה, אולי לא הייתי כותב ביקורות כה נוקבת אבל הוא גם כל כך לא ברור שזה עוד יותר מסתכל.\nעצה שלי בנוגע להרצאות - יש סיכום נהדר של חורף 2020 ל8-9 הרצאות שתואמות לסמסטר ההוא: אפשר לקרוא אותו ולהסתדר בלי לראות את התכנים המתאימים. פשוט מיותר, מבזבז את הזמן וחבל על הכאב ראש.\n\nשם המתרגל/ת: דניאל נור\nחוות דעת - תרגולים: \nכמו איכות ההרצאות כך התרגולים מוזנחים לא פחות. לא יודע אשמתו של מי זה אבל כשתוכן התרגול מתנקז ל28 דקות זה סימן שבוצעה עבודת תכנון וחלוקת זמנים לא טובה.\nדניאל מנסה לעשות סדר בבלאגן שאסף יוצר אך ניכר שגם הוא מבולבל בנושאים מסוימים בחומר מה שמקשה על ההבנה ומעיד על חוסר מקצועיות.\nאסתייג אבל ואגיד באופן כללי שההסברים של דניאל בחומר היו די טובים.\n\nשעורי הבית: 3 תרגילי בית (10% תקף כל אחד מהם) שנועדו ללמד את 2 התחומים המעניינים והחשובים היחידים בקורס הזה. מורכבים מחלק רטוב שבו צריך להשלים קוד כדי למקבל עבודה של רשת ניורונים וחלק יבש שהוא דוח על הקוד שכתבתם. אזהרה! הדוח באורך הגלות, משעמם, מייגע ויכול לקחת גם יותר זמן מהמימוש של הקוד. כמו כן, ההסברים של התרגילים לא היו הכי ברורים אבל הסגל היה זמין לענות על שאלות בקבוצת הווצאפ של הקורס. התרגילים גם ממוחזרים משנים קודמות (כולל שגיאות הכתיב).\n\nהמבחן: כמו הקורס, כך גם המבחן. הצטברות של 10 שאלות אמריקאיות (במשקל של 60 נקודות) מטופשות ותלושות מהמציאות בחומר שלהן שדורשות לזכור פרטים הזויים ונשכחים משקופיות במצגות של ההרצאות וההצלחה בהן היא עניין של מזל בלבד. חלק רטוב שהוא יחסית נחמד, ישיר וקליל.\nשלא לדבר על זה שמבחני העבר מפורסמים כמעט בלי פתרון, אין כמעט סריקות וגם כשרואים פתרון, עדיין אי אפשר להבין למה תשובה אמריקאית אחת נכונה והשנייה לא.\n\nהשורה התחתונה: קורס מיותר. אין כמעט חומר חשוב בו ואי אפשר להבין בכלל מבין כל הנושאים שלמדנו איך הם מתחברים כמו שצריך. אם זה לא חובה עבורכם - ממש חבל שתיקחו אותו. הסגל ניסה להיות זמין לשאלות בקבוצת הווצאפ של הקורס בנוגע למבחן ותרגילי הבית ויאמר לזכות המתרגלים שהם נתנו תמיד מענה מפורט והסברים טובים מה שעזר להתקדם בתרגיל.", "timestamp": 1676886351457}, {"author": "מק", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: שוסטר\nחוות דעת - הרצאות: משעממות מאוד - נורא קשה להתרכז, מומלץ לכתוב או לסכם בזמן ההרצאה כדי לא להירדם\n\nשם המתרגל/ת: אוראל אדיבי + דניאל נור (מוקלט)\nחוות דעת - תרגולים: אוראל יודע את החומר אבל הוא לא כל כך מעניין, דניאל לא יודע את החומר כל כך אבל הוא קצת יותר מעניין, בכל מקרה שניהם לא נהדרים, אבל התרגולים לא כל כך קשים אז אפשר פשוט להקשיב לאחד מהם בחצי אוזן ולעבור על זה לקראת המבחן, בכל מקרה חצי מהתרגולים הם העתק מדויק של ההרצאות וחצי מהם זה קוד, אז זה לא נורא\n\nשעורי הבית: לא קשורים לכולם ולא מעניינים, אבל הציונים גבוהים וזה לא כל כך הרבה זמן עבודה\n\nהמבחן: חצי אמריקאי וחצי פתוח. אמריקאי זה שאלות מההרצאה וקצת מהתרגולים. צריך לדעת את כל ההרצאות בעל פה בשביל זה. תלוי בסמסטר, בדרך כלל יש כמה שאלות הזויות שאי אפשר לפתור אבל אצלנו לא היה משהו חריג. הפתוחות זה פשוט שאלות בסגנון דומה לתרגולים ולשנים שעברו, ואחרי פתרון של כמה מבחנים ממש קל להוציא בהם ציון גבוה.\n\nהשורה התחתונה: חרא קורס, יש בו ממש קצת דברים חשובים אבל זה לא מחפה על זה שהמרצה גרוע, המתרגלים לא משהו, ובאופן כללי בשאלות האמריקאיות יש לפעמים תחושה של לחפש נקודות לא רלוונטיות או קריטיות מההרצאה ולשאול עליהם", "timestamp": 1717028078337}, {"author": ".", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: פרופ' אסף שוסטר\nחוות דעת - הרצאות: ההרצאות מוקלטות ביוטיוב. \nעוד לא הוסיפו למילון את המילים שיתארו את תחושותיי. \nמבלבל, אף הרצאה לא קשורה לשנייה (טוב אולי חוץ מ2).\nיש 4 הרצאות אורח שבסיומן מובטח שלא תדעו על מה הן היו (אני עדיין לא יודע מה זה קוברנטיס). לי לקח איזה 4 שעות לפחות לראות אותן, ולא נהניתי כמעט באף רגע.\nאה חשוב לציין שלהרבה הרצאות אין קשר לתרגולים ולכן המתרגלים גם לא בקיאים בחומר.\n\nשם המתרגל/ת:  אוראל ודניאל נור (הקלטות)\nחוות דעת - תרגולים: אם חשבתם שהתרגולים יעברו על החומר מההרצאה ואתם תהיו בסדר, כנראה שלא קראתם ברצינות את השורות שלמעלה. \nרוב התרגולים הם עוד חומר, אוראל סה\"כ סבבה אבל לשניהם יש חלקים שהם בעצמם לא בטוחים בהם ונראה שיש נקודות בקורס שלא ידועות לאף אחד.\n\nשעורי הבית: GPU, MPI.\nמבלבלים, לא ארוכים וטוב שיש חברים להתייעץ. אם בחרתם שותף טוב זה ילך סבבה.\n\nהמבחן: 10 אמריקאיות , 2 פתוחות.\nהאמת שהתפילות נענו והפעם היה ניתן להבין מה רוצים באמריקאיות והתשובות לא היו נראות כולן אותו דבר, מה שהפך את זה להגיוני באיזו שהיא מידה , למרות שזה עדיין מרגיש שלוקחים חתיכה רנדומלית מההרצאה והופכים אותה ל6 נקודות.\nהפתוחות היו הרבה הרבה יותר מאתגרות מבד\"כ שהפתרון הוא ממש ברור כשקוראים את השאלה.\nאגב תהיו רגועים , אין כמעט פתרונות לאף מבחן, גם לא לאמריקאיות.\n\nהשורה התחתונה: מומלץ לחובבי לוטו וקרקס", "timestamp": 1717941480687}, {"author": "ferberonix", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אסף שוסטר (מוקלט)\nחוות דעת - הרצאות: לא ראיתי אפילו את כל ההרצאות המוקלטות. כהתכוננות למבחן שילבתי צפייה בחלקן וקריאת סיכום חביב שמסתובב במאגרי הפקולטה. ההרצאות הללו הן בין הדברים היותר מיותרים על פני כדור הארץ (בתחרות עם מקקים, חולדות ואנשובי).\n\nשם המתרגל/ת: גלעד שמרלר\nחוות דעת - תרגולים: הלכתי לחמשת התרגולים הראשונים. היה נחמד עד הבנתי שיש תרגולים מוקלטים של אוראל ואז הפסקתי ללכת לאלו של גלעד. אחלה מתרגל.\n\nשעורי הבית: ביזיון, משמעם, סבל, נורא ואיום, לא מלמד, מלבלבל, מתסכל וכו'\n\nהמבחן: הסמסטר המתרגלים דאגו שהמבחן לא יהיה טופס לוטו ובשילוב עם הארכת זמן להרבה אנשים בקורס קיבלנו ממוצע גבוה מהרגיל. המתרגלים נהדרים ועזרו להתמקד במבחן בחומר הקורס ולא באיך לממש פעולות אריתמטיות בפייתון. חלק מהמבחנים תלושים מהמציאות וחלקם סבירים יותר. מה שלוטו כאן הוא איזה מבחן תקבלו- גרוע, סביר או זוועה.\n\nהשורה התחתונה: הקורס הכי שנוא עליי עד עתה בטכניון. אמליץ לקחת אותו רק אם אתם אנשים מוזרים שאוהבים סבל ומכורים להימורים (שכן תמהרו פה על הממוצע שלכם בטכניון כי הציונים מתפלגים בהתפלגות שוסטרית).\nלקחתי מהקורס הזה 2 דברים:\n- רק אסף שוסטר הוא המחליט והקובע, בכל סוגיה בקורס.\n- משפט (שוסטר): אלגוריתם djit הוא כל כך טוב שאפשר להוכיח בעזרתו ש- P=NP.", "timestamp": 1718198254057}]}