{"posts": [{"author": "Elad Kay", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: גיל ברקת\nחוות דעת - הרצאות: נחמדות, לא מפתיע שגיל בקיא מאוד בנושא כי הוא עוסק בזה כבר 25+ שנה.\n\nשם המתרגל/ת: ראיתי מוקלטות של גיל בן-שחר\nחוות דעת - תרגולים: מתרגל מצוין\n\nשעורי הבית: 3 יבשים ורטוב, הרטוב לא קשה אבל דורש זמן, היבשים קשים ודורשים זמן\n\nהמבחן: קשה!\n\nהשורה התחתונה: הממוצע הגבוה והקדמים המועטים עשוי לגרום לכם לחשוב שזה קורס מומלץ לכל נפש. זה לא. זה קורס למאסטרנטים שרוצים לעסוק בתחום הזה, ורמת הקושי וההפשטה שלו היא בהתאם. מצד שני, גם היחס לסטודנטים הוא בהתאם, וגיל מאוד מתחשב ונחמד ומאפשר. לא הייתי לוקח בשביל ציון.", "timestamp": 1646572239631}, {"author": "נגה קרן", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיל ברקת\nמתרגל: תומר אדר\n\nלא ממש הייתי בהרצאות ובתרגולים בגלל אילוצי לו\"ז ובעיקר למדתי מהמצגות. בהרצאה היחידה שכן הייתי בה היה מעניין.\n\nשעורי הבית: 3 גיליונות יבשים של 4-5 שאלות וגיליון רטוב אחד. השאלות ממוחזרות משנים קודמות ולרובן יש הצעות פתרון באינטרנט.\n\nהמבחן: כמה שאלות פתוחות, הוגנות מאוד. לא מחפשים בקטנות בבדיקה.\nאין כמעט מבחנים מהשנים האחרונות, אבל לקראת המבחן גיל שולח אוסף שאלות להתכונן עליהן (בלי פתרונות). קצת קשה להתכונן בלי הפתרונות למבחנים האלו ולכן הייתי ממליצה לקחת את הקורס עם עוד חבר/ה כדי ללמוד ביחד.\n\nהשורה התחתונה: \nאחת הביקורות שיש כאן כמעט גרמה לי לא לקחת את הקורס ולא בצדק. \n\nהקורס מעניין, המרצה והמתרגל נחמדים, מתחשבים ומסודרים.  \nמומלץ בחום לכל מי שמתעניין באלגוריתמים ובמבני נתונים :)", "timestamp": 1675809081083}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גיל ברקת\nחוות דעת - הרצאות: נכחתי מעט, מרגישים בבירור שגיל מומחה בתחום.\n\nשם המתרגל/ת: תומר אדר\nחוות דעת - תרגולים: לא הייתי.\n\nשעורי הבית: לא קלים אבל ממוחזרים.\n\nהמבחן: המבחן היה עם חומר פתוח, והשאלות היו הוגנות וככלל יותר קלות משיעורי הבית. כיוון שלא נכחתי בשיעורים למדתי בעיקר מהמצגות, שמפורטות ומכילות את החומר הנדרש ברובן.\n\nהשורה התחתונה: קורס מעניין מאוד, שפותח עולם נוסף בתחומי האלגוריתמיקה ומבני הנתונים. מומלץ מאוד, גיל מאוד מתחשב והקורס באווירה \"משפחתית\" (למשל, קיימת קבוצת וואטסאפ למקצוע עם המרצה והמתרגל, בה אפשר לשאול גם שאלות על החומר).", "timestamp": 1677939046388}, {"author": "לא", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גיל\nחוות דעת - הרצאות: גיל מבין טוב מאוד את החומר, אבל המילה שהכי שמעתי ממנו הסמסטר זה \"זה טריוויאלי\" אבל לי זה פחות. אני למדתי מיוטיוב את רוב החומר אז לא באמת צריך להיות בהרצאות.\n\nשם המתרגל/ת: תומר אדר\nחוות דעת - תרגולים: לא בא מוכן לתרגולים לדעתי, מרגיש לי שהוא קורא את השקפים איתנו וזהו. \n\nשעורי הבית: ממוחזרים אבל דורשים זמן (יום יומיים) אולי הרטוב דורש יותר זמן.\n\nהמבחן: אכזבה אכזבה אכזבה, קשה בטירוף עם בדיקה על דקויות. חוץ מזה שאין מבחנים באתר, וגיל מפרסם מבחנים משנות ה-90 שלא ברמה של המבחן עצמו הייתי צריך ללמוד מהמבחנים של תל-אביב כדי לעבור.\n\nהשורה התחתונה: לא מומלץ בכלל, לברוח.", "timestamp": 1714931317666}, {"author": "המרפרנס", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה:  גיל ברקת\nחוות דעת - הרצאות: \nהחומר מעניין -עוסק בגיאומטריה שנזנחת בעצם מאז הבגרות ממתמטיקה. אין התעסקות במקרי קצה (שימו לב! רק במסגרת ההרצאות והתרגולים אין התעסקות בזה לא בש\"ב ובמבחנים) ואין פורמליות סטייל אינפי. אז הדבר מאוד מקל להבנה וגם בשיעורי בית היבשים (לא ברטוב ולא במבחן!).\nיש נקודות שמצוינות בשקפים כשאלות - התשובות נאמרות בעל פה בלבד ולכן מי שלא מגיע צריך להשלים מהאינטרנט.\n\nשם המתרגל/ת: תומר אדר\n\nחוות דעת - תרגולים: \n\nהוא מתרגל טוב. התרגול מאוד אינטראקטיבי והוא מאתגר אותנו עם שאלות במהלך התרגול במקום להקיא עלינו את החומר.\nאך לתומר יש אופי של מתרגל במבני נתונים (אופי שדומה לרס\"ר בצבא) בשיעור בית הרטוב הוא הביא לנו קוד עזר שלא עבד טוב בכוונה וניסה להכשיל ולהוריד נקודות. בכלל יש טקטיקה כזאת של \"להרדים\" את הסטודנטים שזה קורס שמתעקב רק על העיקר ולא מנסה לתפוס אתכם בקטנות ואז מגיע תרגיל בית הרטוב שפשוט הוליך אותנו שלל. וכן הייתה התקננות על מקרה קצה ממש זניח שהוריד 60% מהניקוד (התייחסות לקטע מגודל אפס). אל תפלו למלכודת ותתייחסו לקורס כמו קורס של מבני נתונים (בעיקר מבחינת הרטוב והמבחן - אולי פחות ביבשים)\n\nשעורי הבית: \nהיבשים - צריך לרפרנס יש שאלות מורכבות שממש אותו דבר מסמסטר שעבר שיש תשובות בדרייב. שאלות מורכבות אבל קל לרפרנס.\n\nהמבחן: \nהסמסטר היה מאתגר היה דברים שקשורים לחישוב סיבוכיות קצת עם אינפי. והיה גם פקטור. אין מבחני עבר עם תשובות. אין גם מבחני עבר באמת. יש איזה מבחני עבר משנים מאוד קודומות משהו כמו 2001-2002 הכי מאוחר והם בלי תשובות (ובאימייל תומר חד חידות אם שואלים אותו על אחת השאלות)\n\nהשורה התחתונה:\n\nאם ללימודים בטכניון מבחינת תואר ראשון יש שני קריטריונים: הכשרה והערכה. מבחינת הכשרה אני חושב שהעבודה נעשתה מהטובים שיש בתואר - גם המרצה וגם המתרגל מהטובים שהיו לי בתואר בדרך שהעבירו את החומר. מבחינת הערכה - התרגיל בית הרטוב השתמש בטריקים מאוווודדדד מלוכלכים כדי לנרמל את הממוצע (אבל אנחנו רגילים לזה בטכניון) והדרך ללמוד למבחן יותר קשה כי אין תשובות למבחני עבר. כרגיל בטכניון אין דבר טוב שבא לבד הוא תמיד בא עם איזשהי סתירה לצידה. קשה להמליץ או דיסלהמליץ. תזהרו ברטוב, תשץמשו בחברים לענות ביחד ולמבחן תשמשו בחברים כדי להשוות תשובות (זו כנראה הדרך האולטימטיבית להתמודד עם טריקים מלוכלכים לנרמול הממוצע)", "timestamp": 1715167956764}, {"author": "someone", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גיל ברקת\nחוות דעת - הרצאות: \nההרצאות היו מאד מעניינות ועוקבות באופן צמוד אחרי הספר של הקורס.\nגיל מכיר טוב את החומר, והכיתה קטנה אז אפשר לשאול שאלות. יש גם קבוצת וואטסאפ לקורס עם גיל, ואפשר לשאול שם שאלות.\nחוץ מזה, גיל לא עושה שעות קבלה, וזה די מבאס כי יש תרגילי בית לא טריוויאלים.\nשם המתרגל/ת:תומר אדר.\nחוות דעת - תרגולים: \nמצד אחד, רוב התרגולים היו טובים וברורים ולא עמוסים יותר מדי .\nמצד שני, חלק מהמצגות של התרגולים ממש לא מובנות, ברמה שלא מבינים מה הקשר בין שקופית לשקופית, וחייב לקרוא את הפרק המתאים בספר בשביל להבין מה בכלל רצו שם.\nמבחינת המתרגל, תומר היה מאד קשוב במייל ועוזר במה שצריך, אבל היו לו כמה תרגולים שהוא גם לא הבין מה הולך במצגת.\nבתרגילי בית היו לו קטעים שהוא בדק קשוח, אבל סה\"כ הוא היה די הוגן.\nשעורי הבית: \nיש 3 תרגילי בית יבשים ואחד רטוב.\nהיבשים לוקחים זמן, אבל לא משהו שהוא לא פתיר.\nבד\"כ יש 3 שאלות סבבה ואחד שקצת מצריכה מחשבה, וגם הכל ממוחזר אז אפשר לרפרנס.\nהרטוב הוא לא כ\"כ מסובך, אפשר לשבת עליו שבוע ולסיים אותו (12.5 אחוז מהציון הסופי), אני לא יודע על איזה מקרי קצה מונפצים דיברו החוודים הקודמים, התרגיל היה מנוסח ממש כדי להוריד כל מקרה קצה מסריח, וגם סיפקו לנו קוד עזר בC ובפייתון.\nהמבחן: \nהמבחן די סבבה, יש שאלה אחת שנמצאת בכל מבחן, ועוד 4 שאלות שדי פתירות.\nקצת קשה ללמוד למבחן כי אין מבחני עבר, אבל סה\"כ, ביחד עם החומר הפתוח, המבחן די הוגן.\nהשורה התחתונה: \nאני לא יודע על מה דיברו החוו\"דים הקודמים, זה באמת אחד הקורסים היותר מעניינים שלקחתי בתואר.\nהסגל די זורק וזה מבאס, אבל החומר ממש מעניין.\nזה לא קורס לקחת כדי להעלות מממוצע ולהכחיש כל הסמסטר, אבל מי שאוהב מבני ואלגו, יכול להתחבר ממש לקורס.\nבאופן כללי, הייתי ממליץ לעבוד צמוד לספר של הקורס, הוא הרבה יותר מובן מההרצאות והתרגולים ויש בו 98 אחוז מהחומר שמועבר.", "timestamp": 1716911553495}]}