{"posts": [{"author": "Alon", "semester": "201902", "text": "ארז מרצה נהדר שמכיר את הנושא לעומק ויודע לענות על הכל. היו 3 ת\"ב יבשים (בזוגות) קצת חופרים אבל אם מקשיבים בהרצאות אז בסה\"כ הם לא קשים במיוחד ולוקחים יומיים כ\"א. בסמסטר שלי המתרגל היה מאד מאד קפדן בבדיקה של התרגילים אבל זה לא השפיע יותר מידי על הציון הסופי בכל מקרה.\nיש מבחני עבר, והמבחן עצמו הוגן ואפשר לראות לפי הממוצע שלא קשה להצליח. לדעתי האישית הקורס מעניין כי הוא מתעסק גם במקביליות ובפתרון בעיות מורכבות, אם כי חלק מהחומר הנלמד הוא כבר לא רלוונטי ולא נמצא בשימוש היום. בקבוצת פייסבוק יש קצת סיכומים ישנים. בקיצור ל־2 נק\"ז זה ממש נחמד ובמיוחד אם התחום של ה־heap ומאחורי הקלעים מעניין אתכם.", "timestamp": 1594819023000}, {"author": "D.B", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: \nארז מרצה מעניין מאד ומומחה עולמי בתחום ה-GC. הרבה מהאלגוריתמים שלומדים במהלך הקורס מבוססים על דברים שהוא בעצמו פיתח. החומר מעניין מאד, ואמנם נשמע שהנושא מאד נישתי אבל הקונספטים שמדברים עליהם בקורס דווקא מועילים בהרבה תחומים אחרים במדעי המחשב. עוסקים הרבה בנושאים של אלגוריתמים מקביליים ובאופן כללי לומדים אלגוריתמים מאד יפים שאפשר ליישם על אפליקציות שונות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nשלושה גיליונות יבשים. רוב השאלות ממוחזרות משיעורי בית ומבחנים קודמים. יומיים עבודה מקסימום לכל גיליון.\nהמבחן: \nבאופן מפתיע לקורס של 2 נק\"ז יש המון חומר, ואמנם הציונים במבחן בסופו של דבר גבוהים אבל דרושה השקעה ולמידה מעמיקה כדי להיות מסוגלים לפתור שאלות ברמת מבחן. \nהשורה התחתונה: \nקורס מעניין, מרצה מעולה. \nהערה כללית למי ששוקל לקחת את הקורס בתואר ראשון - שימו לב שהרבה מהסטודנטים שלוקחים את הקורס הם בתואר שני ולכן כדאי לקחת את זה בחשבון. ההיסטוגרמה אמנם נראית טוב אבל זה לא קורס מתנה..", "timestamp": 1613556355749}, {"author": "הוד מקסימיותו", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: \nארז מרצה טוב. ההרצאות קריטיות להצלחה בקורס. צריך להבין כל פרט קטן, ובמיוחד כאלו שארז מרפרף עליהם במהרה. \nביחס לקורס של 2 נז, יש הרבה חומר וההרצאות עמוסות. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nסהכ 3 יבשים בזוגות, 20% מהציון. לא עמוס בכלל במהלך הסמסטר. התרגילים ברמת מבחן, והבדיקה שלהם יחסית קשוחה - כך שחשוב להשקיע בשביל ציון טוב. \n\nהמבחן: \nקשה משציפיתי. בסוף ההיסטוגרמה טובה (ממוצע 86 אחרי מועד א), אבל צריך לקחת בחשבון שרוב הסטודנטים בקורס מאוד חזקים - תארים מתקדמים וסטודנטים מצטיינים. \n\nהשורה התחתונה: \nקורס מעניין, בעיקר למי שאוהב מקביליות, מערכות הפעלה, זיכרונות, מבנה מחשבים - ובכללי להבין איך דברים עובדים מתחת למכסה המנוע. \nעומס נמוך במהלך הסמסטר, מרצה טוב, וציונים טובים, אבל חשוב להשקיע!", "timestamp": 1645714311948}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ארז פטרנק\nחוות דעת - הרצאות: \nהחומר מעניין וארז מעביר אותו בצורה טובה ואינטראקטיבית.\n\nשעורי הבית: \nלא לוקחים הרבה זמן אבל דורשים מחשבה. תבדקו טוב את התשובות שלכם כי זה ציון תקף ובודק התרגילים לא יהסס להוריד נקודות על טעויות.\n\nהמבחן: \nהוגן מאוד.\n\nהשורה התחתונה: \nאחלה קורס פרקטי למי שאוהב אלגוריתמים, אחלה קורס אלגוריתמי למי שאוהב low-level.", "timestamp": 1716329578162}]}