{"posts": [{"author": "Alon", "semester": "201902", "text": "1. כשמו כן הוא \"הנדסה לאחור\": ברוב המקרים בהינתן קובץ exe או שורת פקודה – להבין מה קורה מאחורי הקלעים ולמה.\n2. יש 4 תרגילים רטובים עמוסים שכוללים גם חלק יבש. היבש לרוב סבבה – בודק קצת תיאוריה ולרוב ממוחזר. החלק הרטוב מאוד שונה מכל קורס רטוב אחר – במקום מטלה מוגדרת שצריך לממש, מתפרסמת לך תוכנה שהיא כמו crackme שצריך לפרוץ, כאשר אין לך הנחיות מיוחדות כלשהן אלא רק צריך לחקור אותה בעזרת הכלים שלומדים בקורס וזה מאוד זורק אותך למים כזה – התרגילים יכולים לקחת די הרבה זמן אבל בסופם אתה באמת יכול להגיד בלב שלם שהתנסית טוב בחומר שניסו להעביר לך.\nלדעתי יותר עמוס מאת\"מ/מת\"מ/הפעלה וכדומה הרבה כי הסגנון שלהם שונה מהסגנון של מה שהכרנו עד כה בתואר. אצלנו \nהמתרגל היה טל שנקר (שכבר התגייס) והעומס הרבה לזכותו, אבל הבנתי שת\"ב שהוא הכין עשויים להישאר להמשך. ת\"ב הכי מושקעים שעשיתי בתואר, כבוד לטל על זה.\n3. החלק הראשון של הקורס עושים את זה באמצעות ida – שזה ממשק גרפי נוח לקריאת קוד אסמבלי. מקבלים \"crackme\" ואז כשמבינים את דרכי הפעולה שלו מצליחים \"לפתור\" אותו. משתמשים בכל מיני טריקים נחמדים כמו overflow או underflow, הרצת קוד מהמחסנית, ניצול חריגות, ועוד הרבה. ממש לנתח ידנית קוד אסמבלי, עם הזמן נעשים טובים בזה (זיהוי מבני נתונים, קריאות לפונ' מערכת, הכנת פרמטרים במחסנית ועוד).\n4. החלק השני של הקורס הוא בגדול \"הזרקות\" ו־hooking – שזה ממש ממש בפשטות אומר שמריצים את ה־exe דרך \"מעטפת\" שאנחנו הכנו, ואם התוכנית רוצה למשל להשתמש בספריות מובנות של windows אז אולי אנחנו נפנה אותה לקטע קוד שאנחנו כתבנו ונעשה מניפולציות.\nלומדים גם על שיטות שאמורות למנוע \"הנדסה לאחור\" ואיך את חלקן ניתן לעקוף. למשל, שוב ממש בפשטות, אם אי אפשר להוסיף קוד לתוכנית (למשל יש לנו רק שורת פקודה ולא גישה לקוד עצמו או להרצה שלו), אבל אפשר להשתמש בקוד שכבר קיים בתוכנית כדי ליצור שרשרת פקודות שתבצע מניפולציה.\n5. אישית, לא ממש התחברתי למרצה שהיה אצלנו (קדמיאל), למרות שהתוכן מרתק.\n6. סה\"כ אם אהבת הפעלה/את\"מ אז זה ממש מעניין וקורס מאד מעשי ופרקטי יחסית, כנראה קורס ה\"סייבר\" הכי טוב בפקולטה שממש מלמד את אופן החשיבה בתחום וחלק מהכלים הנפוצים.\n7. מזכיר שהמבחן הוא מול מחשב עם חומר פתוח בספריה, 3 שעות, שעתיים הפסקה ואז עוד 3 שעות. בכל מקרה הממוצע יוצא ממש אחלה כמו שאפשר לראות.", "timestamp": 1594885634000}, {"author": "Alon", "difficultyRank": 5, "generalRank": 3, "semester": "201901", "text": "שם המרצה: עמר קדמיאל\nחוות דעת - הרצאות: התוכן מעניין, המרצה משעמם\n\nשם המתרגל/ת: טל שנקר המלך\nחוות דעת - תרגולים: טל שנקר מלך אבל לצערכם הוא סיים את התואר\n\nשעורי הבית: הכי ארוכים/קשים מכל הקורסים שעשיתי בטכניון", "timestamp": 1597996068500}, {"author": "T", "difficultyRank": 5, "generalRank": 5, "semester": "202001", "text": "שם המרצה: Omer Kadmiel\nחוות דעת - הרצאות:  ההרצאות ממש מעניינות אבל קשות. \nשם המתרגל/ת: Idan Raz\nחוות דעת - תרגולים: אחלה מתרגל ובסופו של דבר הוא דיי מוריד את החומר חזרה לקרקע . \n\nשעורי הבית: הכי קשים שהיו לי עד עכשיו בטכניון (לוקח את כל הקורסי חובה של מדמ\"ח בהליכה)\n\nהמבחן: בסמסטר שלנו הוא היה שני חלקים של שלוש וחצי שעות כל אחד בלי השגחה ועם אינטרנט זמין - בקיצור אמרו לנו תעשו מה שאתם רוצים רק לבד.\nכל חלק היה חצי יבש וחצי רטוב . סה\"כ גם מי שלא סיים את החלק הרטוב אבל תיעד והסביר היה יכול לקבל ציון גבוהה .\nהחלק היבש היה הוגן  (בעיקר כי יש אינטרנט זמין).\nאני מעדיף את המבחן הזה על פני הרבה מבחנים אחרים בטכניון.\n\nהשורה התחתונה: קורס מאוד מומלץ (לא רק לחברה שרוצים ללמוד על הגנה) . הקורס מסביר בלי הפשטות והנחות איך תוכנות רצות על המחשב ומה אפשר לעשות כדי לשנות אותן. בתכלס סופר מעניין ומאוד מלמד אבל שואב זמן.", "timestamp": 1616513742510}, {"author": "n' OR DROP TABLE Users", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עומר קדמיאל\nחוות דעת - הרצאות: משעמם אבל חשוב למבחן\n\nשם המתרגל/ת: עידן רז\nחוות דעת - תרגולים: אחלה מתרגל, לשים לב שלפעמים מחליפים בין התרגולים וההרצאות, או ששעת קבלה זזה אם התרגול נגמר מוקדם\n\nשעורי הבית: כדאי להתחיל מוקדם כי לא תמיד ברור מה החלק הקשה או מתי הוא נגמר. כדאי להיעזר ב- ida cheat sheet ובכל המדריכים ל- hook ב- drive (לא להעתיק את הקוד, אלא להיעזר בו)\n\nהמבחן: TODO\n\nהשורה התחתונה: קורס מאתגר וכיפי", "timestamp": 1626161710248}, {"author": "GL", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "הקורס הכי טוב בטכניון.\n\nאולי לפני הכל כדאי לציין שהקורס ישתנה החל מהפעם הבאה שבה הוא יועבר אז מה שכתוב פה עלול להיות לא מדוייק.\n\nהקורס בגדול מתחלק ל-4 חלקים:\n- בחלק הראשון לומדים איך לבצע \"ניתוח סטטי\" לקבצי exe, כלומר ממש לעבור על האסמבלי של הקובץ ולהבין ככה בדיוק מה הוא עושה ולמה הוא עושה את זה.\nבמבט ראשון זה נשמע לא סביר בעליל, אבל מסבירים בקורס איך להשתמש בתוכנה בשם IDA שמציגה את תוכן הקובץ (ובין היתר את הקוד עצמו) בצורה הרבה יותר קריאה מאשר סתם לבהות בבלוק ענק של פקודות.\nעם הזמן גם משתפרים בלקרוא אסמבלי כי יש דברים חוזרים על עצמם המון (איך נראות קריאות לפונקציות, איך נראה שימוש במשתנים/ארגומנטים של פונקציות, איך נראה איתחול זיכרון...) ואז זה הולך חלק יותר ויותר עד שמגיעים לרמה שבה אפשר לקרוא אסמבלי של קובץ דיי גדול ובאמת באמת להבין מה הוא עושה דיי מהר (בתחילת הקורס לקח לי כמעט שעה להבין איך נראת קוד עם פונקציה אחת. בסוף הקורס הייתי עובר על קבצים שלמים עם משחקים פשוטים כמו סודוקו או סולמות ונחשים בשעה וחצי בערך).\nחוץ מזה מסבירים על איך אפשר להשתמש בדיבאגר בשביל לקצר משימות כאלו (זה נקראי \"ניתוח דינמי\"), אבל זה לא החלק העיקרי.\n- בחלק השני לומדים איך לעשות משהו שנקרא \"hooking\". זה תהליך שבו \"מיירטים\" קריאות לפונקציות* לפני שהן קורות ומעבירים את התוכנית להריץ קוד שאנחנו כתבנו, כאשר בדרך כלל מחזירים את התוכנית לאיפה שהיא הייתה לפני שחטפנו ממנה את השליטה. למשל, אם יש פונקציה שמקבלת כארגומנט מחרוזת כלשהי ומחזירה את המחרוזת מוצפנת, אפשר לחטוף את השליטה מהתוכנית ישר אחרי שקוראים לפונקציה הזו, להדפיס את הארגומנט שלה (המחרוזת הלא מוצפנת), ולהחזיר את התוכנית לתחילת הפונקציה, כדי שהתוכנית תריץ את הפונקציה ולא תשים לב שעשינו משהו בכלל (אם התוכנית קוראת לפונקציית ההצפנה כמה פעמים היינו רוצים לקבל את כל ההודעה, ובשביל זה צריך שהיא לא תקרוס ישר).\n- בחלק השלישי מדברים על חולשות זיכרון. מתחילים מחולשה בשם buffer overflow שהיא דיי פשוטה (כל תהליך הניצול של החולשה כולל שלב אחד), ורואים איך להגן עליה. ואז רואים לעקוף את ההגנה, ואיך להגן נגד ההתקפה הזו. עושים את זה משהו כמו 3 או 4 פעמים, כשבכל פעם מכסים חולשות/הגנות מפורסמות ונפוצות מאוד שממש רואים במציאות, ולומדים עוד קצת על איך חלקים ב-windows עובדים באמת (איך עובד מנגון החריגות, איך עובד ה-heap).\nבחלק מהשאלות בתרגילי הבית/מבחנים רואים קוד/מתוארת סיטואציה שיש בו חולשה כלשהי מאלו שנלמדו, וכותבים התקפה שמנצלת אותה.\n- בחלק הרביעי מדברים באופן לא מאוד מעמיק על \"טכניקות אנטי ריברסינג\" (הגנה נגד כל מה שלומדים בחלק הראשון והשני), \"התקפות ערוץ צד\" (איך לתקוף חומרה, למשל על ידי הסתכלות על כמה זמן לוקח לה לבצע פעולות מסויימות, או כמה חשמל היא צורכת כשהיא עושה דברים שונים), ומסתכלים קצת על איך חוקרים קבצים זדוניים (וירוסים וחברים) אמיתיים ואיך נראית הנדסה לאחור בעולם האמיתי.\n\nיש 4 תרגילי הבית שממוחזרים כל סמסטר ויש לזה סיבה טובה מאוד - הם ממש ממש ממש ממש מושקעים, ומלמדים את החומר בצורה טובה מאוד (הייתי אומר שהם גם ממש ממש כיפיים).\nבכל תרגילי בית יש חלק יבש שהוא דיי שולי, ולרוב בודק שאתה מבין מה הולך מבחינה תאורטית. החלק הרטוב הוא החלק העיקרי - יש אתר שנוצר במיוחד בשביל הקורס ויש כל מיני דברים שאפשר לפרוץ בו, כשבכל תרגיל מקבלים הנחייה דיי כללית ומטרה סופית שאנחנו מנסים להשיג (למשל בתרגיל הראשון מציגים את האתר עם קצת סיפור רקע, והמטרה היא להשיג את הסיסמאות ושמות המשתמשים של המשתמשים שרשומים לאתר). במהלך התרגילים נתקלים בכל מיני אתגרים ובעיות שמצריכות להשתמש בטכניקות שנלמדו בקורס כדי להתקדם קדימה, וכך אתה מוכרח להתנסות בחומר על אמת כי בשום שלב אין לך מושג למה לצפות או מה הולך ואתה חייב לגלות כדי להצליח.\nמטבעם, האורך והתוכן של התרגיל לא מוגדרים, אך למרות זה הם לגמרי פתירים וסגל הקורס תמיד שם בשביל לעזור ו/או לתת רמז.\n\nהמבחן הסופי הוא בשני חלקים של 3 שעות (עם הפסקה של שעתיים באמצע), כשבכל חלק יש שאלה יבשה ושאלה רטובה (השאלות רטובה אחת על החלק הראשון והשנייה על החלק השני, ושהשאלות היבשות הן בדרך כלל על החלק השלישי והרביעי).\nלאור זה שהמבחן נעשה על מחשב עם אינטרנט כחומר עזר, והמבנה שלו דיי דומה בכל מועד, הוא ממש סבבה ופתיר לגמרי (החלקים הרטובים בגודל סביר לגמרי והעקרון בהם לא משתנה הרבה ממועד למועד [אם כי בכל מועד עולה סיטואציה אחרת שמבדילה אותו מהשאר]).\n\nהמרצה (עומר קדמיאל) היה בחור מאוד נחמד, ונהנתי מתוכן ההרצאות למרות שלפעמים מאבדים מה הולך ואז זה נהיה קצת משעמם.\n\nהמתרגל (איתמר ג'ווילר [כנראה לא ככה כותבים את זה]) גם היה בחור ממש נחמד שתמיד זמין ומוכן לעזור, והתרגולים הפכו את החומר ליותר ברור ופחות תאורטי מה שעזר מאוד.\n4 פעמים בסמסטר יש סדנה של 3 שעות במקום תרגול (וההרצאה שיש באותו השבוע), שבה מקבלים משימה לעבוד עליה בהתאם לחומר שנלמד באותה התקופה, והמתרגל שם בשביל לעזור להבין מה הולך ומה צריך לעשות. הן היו כיפיות וכנראה החלק הכי מועיל בהפנמת החומר חוץ מתרגילי הבית.\n\nבסך הכל הקורס באמת מלמד כלים וטכניקות להנדסה לאחור, ויש דגש גדול מאוד על להבין בדיוק מה הולך מאחורי הקלעים, בלי שום מאגיה שחורה או חירטוטים כאלו ואחרים (אצטט את המרצה - \"המוטו של הקורס הוא 'שום גמדים קטנים לא יבואו'\"), כמו גם דגש מאוד גדול על לקפוץ למים ולהתנסות בשיטות ובכלים שנלמדים כדי באמת להצליח להנדס לאחור דברים וליישם את שאר הטכניקות שנלמדות.\nנהנתי מאוד מאוד מאוד, אני ממש ממליץ לכל מי שזה נשמע לו מעניין אפילו קצת, הקורס עמד בכל הציפיות שהיו לי, ועשה הכל הרבה יותר טוב ממה שהייתי מסוגל בכלל לדמיין שאפשר.\nהיה כיף לא נורמלי וחוויה אדירה.", "timestamp": 1666557121652}, {"author": "צפרדע אנונימית", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עמר קדמיאל\nחוות דעת - הרצאות: מרצה טוב, אבל יש הרבה יותר מדי חומר בקורס, מספיק שנייה לאבד פוקוס וזהו, הלכה ההרצאה. מגיעים למצב לקראת אמצע סמסטר שבכלל לא מבינים מה הולך ומשם רק נהיה יותר גרוע, אי אפשר לעשות את הקורס הזה בלי לעבור על ההרצאות פעמיים לפחות בשבוע\n\nשם המתרגל/ת: איתמר יובילר\nחוות דעת - תרגולים: טוב, אבל באמת שאחרי ההרצאות האלה כלום לא יעזור\n\nשעורי הבית: בלתי אפשריים. לוקחים שבועיים לכל רטוב, אין רפרנסים עדכניים והבדיקה מחמירה ממש. \n\nהמבחן: קשה בטירוף, תחשבו על תרגיל רטוב שלוקח שבוע, אבל יש לכם 3 שעות ועוד אחרי זה חלק שני שהוא קשה בטירוף.\n\nהשורה התחתונה: יכל להיות נחמד אבל עמוס מדי בקטע מטורף, כנראה הכי עמוס בטכניון. ראיתי שיש הרבה ביקורות של עתודאים שמתלהבים אז אמרתי אני אזהיר את השאר מה באמת הולך פה. אל תבואו אם אתם רוצים שיהיו לכם חיים בזמן הסמסטר.", "timestamp": 1676377413766}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: עמר קדמיאל\nחוות דעת - הרצאות: \nהרצאות מתישות ומסורבלות בטירוף, אין קשר בין המועבר בהרצאה לחומר של הקורס, ובפרט לתרגילי הבית.\nאין סיכוי להבין משהו, תורידו את הקורס או שתלמדו ללמוד לבד.\n\nשם המתרגל/ת: איתמר יובילר.\nחוות דעת - תרגולים: \nאחלה מתרגל, ניסה להציל את מה שנשאר מהקורס הזה, אבל בשלב הזה לא הייתה הרבה תקווה.\nלתרגול הגיעו המון עתודאים שניכר שהתלהבו מהקורס - לא ברור למה, אבל ברור שיש להתרחק.\n\nשעורי הבית: \nבלתי אפשריים.\nלא אפשריים בערך, לא אפשריים עם רפרנס, פשוט לא אפשריים.\nמחסל הזמן הכי גדול - לא מומלץ לקחת את הקורס בצמוד למל\"ג.\n\nהשורה התחתונה: \nבדומה לביקורת הקודמת של צפרדע אנונימית - תברחו כל עוד נפשכם בכם.", "timestamp": 1676377900186}, {"author": "משה משה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה:  עומר\nחוות דעת - הרצאות: \nנחמד, סבלני ומעביר את ההרצאות בכיף \n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: \nהקורס דורש מהמתרגל הרבה יותר מכל קורס רגיל מבחינת כמות ההשקעה והזמינות. לצערי לא נראה שאלעד עמד בזה. \nשעורי הבית: \nאזוטריים מתסכלים ומיותרים.\n\nהשורה התחתונה: \nהקורס לא התנהל בצורה מיטבית לדעתי. מרגיש שלפעמים זרקו אותנו למים וציפו להתמודד אבל לא תמיד נתנו את הכלים לעשות את זה.\nהסדנאות היו מתסכלות ואלעד חד לנו חידות רוב הזמן במקום לעשות סיכום  בסוף הסדנאות שכולם יבינו בערך מה עבר ומה הכיוונים האפשריים לפתרון הסדנאות.\nלא ממליץ, הקורס עמוס ואני באופן אישי מרגיש שיצאתי מתוסכל ונוצר לי אנטי למקצוע", "timestamp": 1690355418220}, {"author": ".", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עמר קדמיאל\nחוות דעת - הרצאות: מעביר את הקורס כבר הרבה זמן ובקיא בחומר, אבל לי היה ממש קשה לעקוב בגלל שאלות נונסטופ בכיתה, לא היה לי כיף להיות בשיעור פרטי של בערך 3 סטודנטים שהשתלטו על הכל. \nכן מוקלט אז השלמתי לקראת המבחן.\n\nשם המתרגל/ת: אלעד\nחוות דעת - תרגולים: לדעתי זה קורס שהמתרגל בו צריך ממש להיות חד על החומר ולא רק להקריא מהשקפים ולצערי זה הרגיש הרבה יותר כמו הקראה מהשקפים. יש הקלטות שהן סבבה\n\nשעורי הבית: עמוס...\nהתרגיל הראשון מעצבן אבל אפשר לסיים אותו תוך יום. נוגע בדברים שרואים בתרגולים הממש ראשונים\nהשני והשלישי ארוכים ברמות אבל מלמדים לקראת המבחן.\nהרביעי היה בסדר.\n\nהמבחן: מועד א'. כמו שכתבו כאן קודם, המבחן הוא של 6 שעות ויש שני חלקים.\nבחלק הראשון היבש היה די נורא אבל היה חלק רטוב סבבה.\nהחלק השני היה ממש ארוך ומתיש אבל סה\"כ אפשרי.\n(לפני ציונים או פידבק).\nסה\"כ היה ממש הוגן\n\nהשורה התחתונה: \nאם התחום מעניין אתכם כדאי לקחת את הקורס, למרות העומס. לומדים המון וזו מקפצת ידע מטורפת.\nמומלץ עד כדי, כי בסוף למרות כל העומס התרגילי בית הם רק 30% מהציון הסופי והמבחן לאו דווקא ממש הוגן.", "timestamp": 1691080778945}]}