{"posts": [{"author": "בעז בן-דב", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: מעניינות, אווירה טובה והתקדמות מהירה אבל יציבה בחומר. נהניתי מאוד.\n\nשם המתרגל/ת: איתן סינגר\nחוות דעת - תרגולים: לא היו תרגולים.\n\nשעורי הבית: לא עמוסים מדי, מעניינים ועם משוב טוב.\n\nהמבחן: פרויקט חמוד, מספיק כדי להבין בצורה יפה את החומר אבל לא מספיק בשביל לקרוע את השיערות מהראש.\n\nהשורה התחתונה: קורס מומלץ מאוד.", "timestamp": 1598357824728}, {"author": ":|", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: שחר יצחקי\nחוות דעת כללית: לא יצא לי לסיים את הקורס (ולכן אל תיקחו את הדעה שלי באופן מלא ומחייב, אבל אני מבטיח לכם שהיא כנה) אבל לדעתי הקורס לא מתאים לכולם. אם אתם מאמינים שאתם בעלי יכולת למידה מהירה והסקה טובה ועד כה הרגשתם שהתואר לא מאוד אתגר אתכם או שאתם מכירים חלק גדול מהחומר של הקורס, אז הקורס הזה יותר מתאים עבורכם. הקורס נראה מאוד מפתה בממוצע שלו, אבל הסיבה לכך היא שכנראה רוב האנשים שלא מתחברים לקורס או קשה להם איתו פורשים אחריי התרגיל בית הראשון (או אפילו המעבדה הראשונה).\nהקורס הוא בשותפים, אז אם לפחות אחד מכם עומד בקריטריונים שציינתי מקודם אתם תסתדרו מעולה. אבל בכל מקרה אחר הייתי אומר לכם להתרחק מהקורס הזה, כדי שלא תמצאו את עצמכם באמצע סמסטר עוברים לקורס אחר.\nבקורס עוברים על המון חומר בתקופת זמן קצרה (חומר שהוא לא טריוויאלי ולא קל להבנה). בנוסף גם מצפים ממכם שתדעו להסתגל לסביבות עבודה שונות במהירות האור (לאלו מכם שלא כתבו קוד בפייתון או עבדו עם תוכנה בשם Coq).\nלמען הסר ספק שאני סטודנט לא רציני (ואו שהבעיה אצלי), אני והשותף שלי בסמסטר 5 בתואר עם ממוצע 90, וככה שנינו מצאנו את הקורס. שוב פעם, לא מבטיח שכל מה שאני אומר יהיה תקף לגביכם, אבל אני ממליץ לכם להיות זהירים.", "timestamp": 1619268569732}, {"author": "Yair Twito", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: נושאים מעניינים\n\nשם המתרגל/ת: איתן סינגר\nחוות דעת - תרגולים: אין\n\nשעורי הבית: מעט ודיי קלים\n\nהמבחן: אין, יש פרויקט קטן במקום\n\nהשורה התחתונה: קורס מעניין כדאי לקחת. חושב שלבוא עם רקע בתכנות פונקציונלי (נגיד משפות תכנות) יכול לעזור.", "timestamp": 1648141809732}]}