{"posts": [{"author": "אסף", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: סבבה\n\nשם המתרגל/ת: מיקי\nחוות דעת - תרגולים: גבר\n\nשעורי הבית: קורס עמוס אבל מלמד מאד\n\nהמבחן: די קל\n\nהשורה התחתונה: מומלץ עבור 5 נקז, לא הייתי לוקח בסמסטר עמוס כי זה קורס שקל לא להשקיע בו אבל זה מפספס את המטרה", "timestamp": 1619435952040}, {"author": "E.A", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המתרגל/ת: אופק \nחוות דעת - תרגולים: \nמגיע מוכן לסדנאות ומעביר אותן בצורה מעניינת\n\nשעורי הבית: \nיש 3 שיעורי בית ב-3 השבועות הראשונים של הפרויקט. מאוד עמוסים יחסית לזמן שניתן להם. \n\nהשורה התחתונה: \nהפרויקט עצמו עמוס מאוד אפילו ביחס ל-5 נק\"ז, אך זה גם תלוי באפליקציה שתבחרו לממש.\nהפרויקט מעניין אבל כדאי לקחת רק בסמסטר לא עמוס. מבחינת ציונים - בפרויקטים אחרים לבטח תקבלו ציון יותר טוב ביחס להשקעה בפרויקט. כאן ההשקעה ואיכות האפליקציה שלכם תשפיע לכל היותר על 10 נקודות מהציון הסופי, בין אם הייתם גרועים או טובים, ויתר הציון מרגיש שנקבע על ידי הגרלת מספר בין 80-85, למרות שכביכול יש ציון לכל דבר שתעשו בפרויקט.", "timestamp": 1676884488167}, {"author": "צפרדע אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "הפרויקט:\nהפרויקט הוא אינדיבידואלי ולכן אכתוב בקווים כלליים מה דעתי על רוח ההתנהלות. אין ספק שלומדים הרבה מאוד בקורס הזה איך לתכנת נכון ואיך לכתוב אפליקציה נכונה. זה קורה אך ורק אם באמת מקפידים לעבוד על האפליקציה במקביל לסדנאות של הקורס. באופן אישי, כתבתי את האפליקציה בצורה כזו שלא בדיוק שיתפה פעולה עם הקונבנציות של הקורס ורק בדיעבד כשלמדתי למבחן הבנתי כמה זה הקשה עליי, אז זו נקודה שהייתי שם לב אליה.\nהפרויקט עמוס וגם קצת מאיים. יש מסגרות זמן שצריך לעמוד בהן (סוף ספרינט 1 וסוף ספרינט 2) וזה הגשת פרויקט לכל דבר. חשוב מאוד לעמוד ביעדים שהצבתם לסוף הספרינטים כי זה מתבטא בציון שלכם בסופו של דבר.\nהייתי משקיע תכנון מאוד מדויק לגבי הפיצ'רים שמתכננים להכניס לאפליקציה (ברמת הכפתור) לפני שמתחילים לתכנת כי תכנון שאינו מוגדר עד הסוף - גורר קצת בלאגן ולפעמים יכול לגרום להשפעה גדולה על האפליקציה כולה (וזה הדבר האחרון שבא לכם להיתקל בו בדקה ה90).\nבסך הכל הסגל היה נחמד אבל כמות ההשקעה בפרויקט לא שווה לציון הסופי. \n\nשעורי הבית: \nיש 2 תרגילי בית ביחידים שיש להגיש והציון עליהם זה חלק מהציון של הפרויקט. הם לא קשים אבל דורשים עבודה. התפקיד שלהם זה לבנות את הבסיס להיכרות עם הדברים הבסיסיים בפיתוח אפליקציה.\nהמבחן: \n\nהשורה התחתונה: עמוס אבל לומדים הרבה דברים חדשים. בשלב מסוים זה ממצה את עצמו וכבר מתים לסיים עם זה.", "timestamp": 1716636930354}]}