{"posts": [{"author": "כינוי", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניינות, הפך קצת לתיאורטי יותר אחרי שרון רוטבלום נכנס להיות מרצה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עסקו בעיקר בתורת המספרים ובהתקפות על DES.\n\nשעורי הבית: עוסקים בעיקר בהתקפות על צופן DES\n\nהמבחן: המבחן לא פשוט. הבעיה העיקרית היא שאין כמעט סריקות למבחנים אז קשה לדעת אם אתה צודק או טועה כשאתה פותר מבחן.\n\nהשורה התחתונה: קורס מאוד קשה שרוב הסטודנטים שלוקחים אותו הם מצטיינים.\nמלמדים חומר מעניין שיכול לעזור בהמשך אם רוצים ללכת לכיוון של קריפטוגרפיה והצפנה.", "timestamp": 1597819535931}, {"author": "FHE", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: רון\nחוות דעת - הרצאות: \nמרצה מצויין, רואים שהוא אוהב את החומר שהוא מעביר. מלמדים גם חומר יחסית מתקדם כמו FHE וזה לגמרי mind blown וכיפי.\nהקורס הפך להיות הרבה יותר תיאורתי מפעם.\n\nשם המתרגל/ת: שאפיק\nחוות דעת - תרגולים: \nממש אחלה של מתרגל, יודע להעביר את החומר בצורה טובה וכיפית.\n\nשעורי הבית:  30 אחוז תקף\nהיה 4 תרגילי בית, לא הכי פשוטים אבל תורמים להבנה של החומר ובשונה מתרגילי בית בקורסים אחרים הם ברובם תרגילים מעניינים ומוכיחים דברים שימושיים והם לא סתם בשביל \"לתרגל\".\n\nהמבחן: המבחן יחסית קשה, הממוצע של המבחן היה 56 אבל היה פקטור של 16 נקודות אז סך הכל סבבה. לדעתי האישית אם מבינים טוב את החומר המבחן ממש ממש לא נורא.\n\nהשורה התחתונה: ממליץ מאוד. זה קורס מצויין לכל מי שרוצה להכנס לקריפטו(גרפיה).", "timestamp": 1658343028928}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רון רוטבלום\nחוות דעת - הרצאות: ההרצאות מעניינות אבל קשות, במיוחד לקראת הסוף. המצגות לא מכילות חלק נכבד מהחומר, שוב במיוחד בסוף הקורס, אז חשוב להגיע פרונטלי. יש הקלטות אבל הן לא טובות בכלל לדעתי.\n\nשם המתרגל/ת: שפיק נסאר\nחוות דעת - תרגולים: תותח, בין המתרגלים הכי טובים שהיו לי בכללי. מסביר חומר לא פשוט בצורה מאוד נגישה, ונותן אווירה ממש טובה בשיעור.\n\nשעורי הבית: בדיקה פדנטית לפעמים, חשוב מאוד להבין את כל ההערות. מאוד חשובים להבנת החומר ובדרך כלל לא פשוטים.\n\nהמבחן: קשה, אבל נותנים פקטור. מועד א שלנו היה די הוגן יחסית למבחני עבר, שזה עדיין קשה יחסית לקורס ממוצע אבל פתיר למי שעל החומר.\n\nהשורה התחתונה: מומלץ ביותר למי שסקרן.ית בכל מה שקשור לתחום. הקורס כן הולך יותר ויותר למחוזות של תיאוריה בשנים האחרונות, אז לאנשים ששנאו חישוביות או קורסי תיאוריה בכללי הייתי ממליץ לרפרף על הסילבוס והמצגות לפני שלוקחים.", "timestamp": 1689930459722}, {"author": "P=NP", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: רון רוטבלום\nחוות דעת - הרצאות: מעולה, מעניין, שווה ממש\n\nשם המתרגל/ת: שפיק נסאר\nחוות דעת - תרגולים: המתרגל מספר אחד בטכניון\n\nשעורי הבית: לא קלים אבל ניתנים בחוכמה ומאוד מלמדים\n\nהמבחן: היה סבבה\n\nהשורה התחתונה: שווה", "timestamp": 1691936655904}]}