{"posts": [{"author": "בועז", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: רוני מרצה מצוין וגם הקורונה לא עצרה בעדו. היה מאוד ברור ומובן ובנוסף העובדה שעובדים עם ספר קורס שהוא כתב מאוד עוזרת כי אפשר לא לסכם ורק להקשיב לו.\n\nשם המתרגל/ת: אין תרגולים בקורס, אך מריה הייתה על תקן המתרגלת ועזרה מאוד בשיעורי הבית ובשאלות כלליות על החומר.\n\nשעורי הבית: קשים, אבל מלמדים ומאתגרים בצורה טובה ולא מעצבנת (לרוב). היה נחמד לעשות אותם, למרות שהם לקחו זמן.\n\nהמבחן: מבחן בית של 4 ימים - מספיק זמן למרות שזה בסוף הסמסטר לפני תקופת המבחנים. להוציא 80 במבחן זה מאוד סביר. להוציא 90+ זה כבר קשה. בדיקה לא מאוד קשוחה.\n\nהשורה התחתונה: קורס מאוד מומלץ למי שחובב אלגברה לינארית ולמי שאוהב לחשוב קצת.", "timestamp": 1598025498804}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות:\nההרצאות דיי מעניינות. רוני מרצה טוב.  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין - ולכן אתם הולכים לסבול מאוד בתרגילי הבית.\n\nשעורי הבית: \nארוכים וקשים מאוד! אמרנו למרצה שקשה לנו וקיבלנו יומיים הארכה, אבל אפס הכוונה.\nהציונים מבישים. \n\nהמבחן: \nהמבחן הוא מבחן בית של 3 יממות. המרצה יגיד שלא צריך לשבת 3 ימים מלאים על המבחן וזה יהיה שקר.\nאני הגשתי 40 עמודים כתובים במבחן הזה!\n\nהשורה התחתונה: \nזה חתול בשק. חשבתי שזה יהיה קורס קליל יחסית. רק תרגילי בית יבשים מבחן בית. בסוף הקורס הזה גזל לי המון המון זמן במהלך הסמסטר והציון בו בטח יהיה כל כך גרוע שגם כל זה היה לשווא. \nאפילו אי אפשר להגיד שלמדנו משהו מועיל, זה לא היה משעמם אבל גם לא מעניין במיוחד ולא יתן לנו כלום לעתיד.\nמאוד לא מומלץ.", "timestamp": 1688484307094}, {"author": "אנונימית", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: רוני מעביר את ההרצאות מצוין, לדעתי היה מאוד מעניין\n\nשם המתרגל/ת: אין תרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: קשים מאוד. אולי כי אין תרגולים, אבל לוקחים ימים, קיבלנו הארכות וקצת רמזים אבל עדיין לקחו המון זמן.\n\nהמבחן: מבחן בית של 3 ימים, מזכיר את השיעורי בית (קשה, לוקח הרבה זמן).\n\nהשורה התחתונה: קורס תיאורטי מאוד. בפועל זה קורס של מצטיינים ואנשים מתואר שני (ולכן הממוצע הטוב) אז לקחת בחשבון. לדעתי היה מאוד מעניין, אבל זה קורס קשה מאוד מבחינת המטלות ושיעורי הבית. לא לקחת בשביל ציון או עומס (כי עמוס מאוד ביחס לנקז), לקחת רק אם מעניין אתכם.", "timestamp": 1690364647765}]}