{"posts": [{"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "201901", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: מרצה מעולה, משקיע, מעניין, מסודר, מסביר טוב, נחמד. אהבתי! המשך של הנושא הראשון של בינה מלאכותית-אלגוריתם A* עם הרחבות רבות ומשונות שלו בהקשרי רובוטים, וקצת גיאומטריה חישובית. יש גם הרצאות של מרצה אורח. החומר מאוד עדכני ומרגישים בחזית המחקר-אמנם לא נכנסים לדברים מסובכים מידי אבל עדיין לומדים אלגוריתמים מ10 שנים האחרונות שזו הרגשה מספקת למדי לדעתי\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין כאלה . המתרגל רק עוזר בחלק הטכני של תרגילי הבית וזהו\n\nשעורי הבית: יש שלושה תרגילים רטובים ברובם(לפעמים חלק יבש קצר מאוד), בפייתון, מותר בזוגות או ביחידים ולפעמים גם שלישיה אבל שלישיה צריכים להשקיע יותר.\nזמני הריצה לפעמים גדולים, אבל התרגילים עצמם אם לא מסתבכים יותר מידי מבחינת קוד ואינם כל כך ארוכים-אלה לא אלגוריתמים פשוטים בכלל... אבל זה פייתון והסגל מאוד משתדל לעשות אותם ברורים ולעניין. בדיקה ידנית עם ממוצעים גבוהים מאוד. \nיש פרויקט סיום שאפרט עליו תחת סעיף המבחן\nהמבחן: אין כזה, אבל יש פרויקט סיום לא קטן שכולל מחקר ומימוש שינויים לאלגוריתם/תוכנה כלשהי שהמרצה מציג. רמת הקושי תלויה מאוד בנושא שבחרתם ויש כאלה שהפכו את זה אפילו לתזה שלהם לצד כאלה שלא, וכך גם כמות התכנות. יש להגיש דוח-לא ארוך מידי בדרך כלל. הקושי הוא לרוב להבין את הקוד שהוא תוכנה אמיתית גדולה ומסובכת למדי שנעשה בה שימוש אמיתי.\nממוצעים גבוהים מאוד והמרצה מאוד עוזר וגמיש.\nהשורה התחתונה: הפרויקט יכול לקחת זמן אבל אם נמנעים ממועדי ב אז אפשר לעשות אותו בלי בעיה בזמן שבין סיום מועדי א לתחילת הסמסטר. הציונים גבוהים והמרצה מצוין והנושא מעניין-לכו על זה", "timestamp": 1609620886678}, {"author": "#$#$#$#", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מיקי אלעד\nחוות דעת - הרצאות: \n6 או 7 ההרצאות הראשונות מועברות ע\"י מיקי ושאר ההרצאות מועברות ע\"י הסטודנטים ככה שכל סטודנט מציג מאמר, הקורס עוסק במודלי דיפוזיה שזה נושא חם ומעניין מאוד.\nמיקי מרצה מצויין שמעביר את החומר בצורה ברורה מאוד.\n\nשם המתרגל/ת: נועם אלטה\nחוות דעת - תרגולים: \nלא היו תרגולים, נועם ליווה את הסטודנטים בפרויקט סיום.\nנועם מקצועי מאוד ויודע להכיוון בצורה ממש טובה את הסטודנטים בפרויקט. הוא היה זמין ואדיב.\n\nשעורי הבית: \nצריך להכין הרצאה של 20 דק' על מאמר מתוך רשימה שמיקי ונועם הכינו. לא מסובך אך נדרשת הצגה איכותית. מיקי בודק את המצגות מראש ודואג שיהיו באיכות גבוהה ומובנות.\n\nהפרויקט:\nבscope רגיל של פרויקט של סוף קורס, עמוס כמו שאר הקורסים.\nבסוף נדרש רק להציג את הפרויקט והתוצאות \n\nהשורה התחתונה: \nקורס מומלץ סה\"כ", "timestamp": 1716464610747}]}