{"posts": [{"author": "Microsoft Azure", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: רועי פרדימן\nחוות דעת - הרצאות: החומר טהוא די מעל הממוצע של מה שלומדים ורואים בטכניון אז קשה לעכל אותו בהתחלה אבל רועי מרצה טוב ומסביר אחלה\n\nשם המתרגל/ת: ירון\nחוות דעת - תרגולים: לא מתרגל וואו בלשון המעטה אבל עם המון רצון טוב להסביר ולהטמיע את החומר. לב רחב לסטודנטים.\n\nשעורי הבית: הופה הנה הגענו לחלק העיקרי פה אז שבו ותקשיבו טוב! מזעזע!! מחריד!\nיש 2 ת\"ב יבשים שהם לא עמוסים בכלל אבל יש גם פרויקט שצריך לעשות בתור ת\"ב 2 שיוצא בערך בשבוע 8. זה פרויקט מזעזע!!!!!! הוא שאב המון המון המוןןןןן זמן והוא באמת לגמרי לא שווה את זה. הפרויקט הזה גם בקוטלין שאפחד לא מכיר אז צריך ללמוד על הדרך שפה חדשה. הסגל דחה את ההגשה של הפרויקט הזה 3 פעמים, כשבפעם האחרונה הוא דחה אותו ליום האחרון של הסמסטר, ואפילו קיצץ אותו במשהו כמו 60 אחוז ועדייןןןןן זה פרויקט מחריד, קשה, מגעיל ואכזרי שבאמת שואב כל שנייה פנויה שהייתה לי משבוע 8 עד שבוע 13 האחרון ואני לא מגזים! כל יום במשך 5-6 שבועות ישבתי עליו כל היום ובקושי הצלחנו משהו לעשות שם! לא לקחת את הקורס ולהתרחק כמו אש מהפרויקט הזה שהוא לגמרי לא שווה את המאמץ על הקורס!! המשקל שלו משהו כמו 30% מהסופי רק. לתחושה הזאת שותפים לא רק אני אלא כל מי שלקח את הקורס וזה באמת חבל... סה\"כ החומר מעניין אבל הפרויקט הזה אמאלה איזה גועל איזה מחלה קשה הוא חתיכת אבולה.\nבקיצור, לא לקחת את הקורס.\nאני לא מגזים, לא לקחת בגלל הפרויקט הזה! לא שווה את זה! פרויקט ששואב כל שנייה במשך 5-6 שבועות עם שבירת ראש של מה לעזאזל רוצים מאיתנו והמאמ. באמת לא שווה את זה. כולה 3 נקז שיכולים להיות מכוסים ע\"י קורס אחר הרבה יותר קל ולא עמוס.\n\nהמבחן: לא קשה\n\nהשורה התחתונה: לא, פשוט לא, באמת לא לקחת את הקורס! הפרויקט הזה אכזרי יותר מהשטן ומגעיל יותר מלא יודע מה.", "timestamp": 1645462432837}, {"author": "מי_שלא_קופץ_אדום", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "קראתי את חוות הדעת הקודמת שכתבו פה. יש נקודות שאני מסכים איתן, אבל לדעתי קצת נכתב שם בהגזמה ומתוך תסכול. קחו את זה בחשבון.\n\nהרצאות ותרגולים:\nמבחינת חומר, לדעתי אחד הקורסים היותר פרקטיים ומעניינים שיש בתואר. ממש מדברים על כל הנושאים החמים שיש עכשיו כמו ביטקוין ושאר קריפטו ומדברים על איך הם עובדים ואיך עובדות מערכות מבוזרות אחרות לדוגמת ביטורנט ועוזריהם.\nהמרצה ומהתרגל (רועי וירון) הם די סבבה, מה שכן ההלקטות על הפנים (במיוחד הראשונות, האחרונות קצת פחות) כי זה הוקלט באולמן ויש שם בעיית אודיו אז לא שומעים כזה טוב, לכן לא בטוח שכדאי לסמוך על הקלטות ואולי שווה להגיע פרונטאלי (למרות שלהרצאות יש הקלטות לא רעות מחורף 2020-2021 כי זה היה בזום).\n\nשעורי הבית: 2 תרגילי בית קלילים עם ממוצע גבוה (92 ממוצע, 20% סה\"כ) ועוד פרויקט של 30% באמצע הסמסטר שהוא באמת מזוויע. דפק לי את כל סוף הסמסטר, וישבנו עליו פשוט שעות על גבי שעות לכתוב קוד בקוטלין. מה שכן, הסגל באמת באמת ניסה לבוא לקראתנו והוריד עומס משמעותי מהפרויקט והוסיפו בונוסים, והם מבינים שזה קורס בחירה ושהשקענו את נשמתנו בפרויקט למרות שלא הגענו לתוצאות כאלה גבוהות ובסוף הממוצע של הפרויקט היה 95 (מסקר קטן שעשיתי לא שמעתי על מישהו שקיבל פחות מ80-82, אז בסוף הסגל ממש התחשבו בקטע הזה). בנוסף, הנושא על מול הסגל וזה באמת מהקורסים שלסגל אכפת והם עושים הפקת לקחים, ואני מאמין ומקווה שהפורמט של הפרויקט ישתנה מעט ממה שהוא היה הסמסטר. בכל מקרה אבל, לדעתי זה קורס ששווה יותר מ3 נק\"ז, קחו את זה בחשבון כשאתם מתכננים מערכת כי עד שבוע 8 זה קורס קליל ומשחרור הפרויקט זה נהיה עמוס בטירוף.\n\nהמבחן: רק 50% מהציון הסופי, ובנוסף מבחן יחסית קל. לא מחפשים אתכם בקטנות וגם הבדיקה לא שוחטת אתכם. המטרה של הסגל היא באמת שתצאו עם ידע ואהבה לתחום, והם לא מחפשים סתם לדפוק.\n\nהשורה התחתונה: קורס מהמרתקים שהיו לי בתואר, אבל ללא ספק הפרויקט הוא עקב האכילס. קחו את זה בחשבון, וגם תכננו מערכת בהתאם כי זה קורס עמוס מ3 נק\"ז רגיל. זה שיש בסוף ממוצע 90 לא אומר שזה קורס קליל בלי השקעה.\nנקודת האור האמיתית זה באמת הסגל האכפתי, אז שווה לקחת גם את זה בחשבון ואני באמת מאמין שהם ינסו לשפר את הפרויקט. גם אם הפרויקט עדיין יהיה קצת מוגזם- דברו איתם, הם באמת קשובים לביקורת ורוצים לשפר את הקורס ואת חווית הסטודנטים.\n\n#יאללה מכבי ושיפטרו כבר את ניקולה", "timestamp": 1645951620961}, {"author": "Google ThiccTable", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "אני ברצינות לקחתי את הקורס כי רציתי לדעת מה זה Docker סך הכל, אבל כמו שאומרים המטרה היא לא היעד אלא החוויות שצוברים במהלך הדרך 3> לשם. אז בזכות הקורס הבנתי שאני בחיים לא ארצה בחיים לגעת בדברים שקשורים לסנכרון, מערכות אחסון, ומטבעות קריפטו. חומר מאוד רלוונטי אבל בין המשעממים!! הוא הועבר בצורה יבשה, אבל בהלימה לקורס הנדסי.\n\nרועי וירון חמודים בכל זאת, הלכתי להרצאות והתרגולים אבל מאז שיצא הפרוייקט לא היה לנו בכלל זמן לנשום אז פשוט ויתרתי עליהן. ראוי לציין שהויתור פה לא היה רק על השיעורים אלא בכללי על קורסים אחרים, זמן פנוי, והחיים. הפרוייקט מתוכנן בצורה כזאת פשוט.\nבשלב מסוים הם הבינו את זה והיו מאוד מתחשבים, אבל הנזק כבר נעשה.\nתחילת הקורס מאוד חמודה ומרגישה לי ממש העקרונות הפילוסופיים של מערכות מבוזרות, ממשיך את החשיבה של סנכרון מהפעלה ומקבוזר. זה מתדרדר בהמשך ומאוד קל ללכת לאיבוד בסוף הקורס כי יש מלא מערכות מהחיים האמיתיים שמיישמות את העקרונות האלה אבל כולן דומות וזה עושה סלט בראש. טכנולוגיות עכשוויות של גוגל ואמזון עם שמות שלא היו מביישים מחלות מין. בעיניי היה yikes.\n\nהמבחן עקרונית קל אבל זה לא מל\"ג. לאור הוויתור שתואר לעיל יצא לי להשלים בערך חצי קורס בשבוע, לא כיף במיוחד אבל בעיה שלי.\n\nהאם הייתי ממליץ לכם? לא. האם תיקחו את זה בכל מקרה כי הממוצע גבוה והברירה שלכם זה או זה או קורס בחירה פח אחר בפקולטה עם ממוצע 70? כן. 012 סמייל סתם כי בא לי לדבר!", "timestamp": 1646082911353}, {"author": "Google Spammer", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "Unless you think that you're destined to learn Distributed Systems 236351, you should:\nrun - תברח - اهرب - бегать - 跑步 - ...\nYou get the point.", "timestamp": 1648741678878}]}