{"posts": [{"author": "anonymous", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: טל מור\nחוות דעת - הרצאות: \nמצד אחד לקורס אין קדמים שדורשים ידע קודם בקוונטים מצד שני טל לא הולך להסביר לך מה זה קוונטים יותר מדי..\nבתור אחד שהכיר את הרעיונות הבסיסיים עוד הצלחתי להבין את הרעיון הכללי לפעמים אבל אנשים שלא הכירו פשוט בהו בו בשיעורים הראשונים\nמשם הקורס ממשיך בלעבור על חומר ברפרוף ללא הסבר מעמיק על אף נקודה\nוחבל כי החומר ממש מעניין פשוט הרגשתי שלא מלמדים אותו\n\nשם המתרגל/ת: איתי\nחוות דעת - תרגולים: \nבאמת ניסה להציל את המצב של ההרצאות אבל זה הרגיש קצת מדי \nבעיקר בגלל שבתרגולים לומדים עוד הרבה חומר שלא מועבר בהרצאות ולא רק חוזרים על החומר\n\nשעורי הבית: \nלא עמוסים מדי וכן גרמו להבין יותר את החומר אבל זה רק בגלל שאי אפשר להבין כלום מההרצאה אז הרגיש שהיית צריך ללמוד הכל מאפס לפעמים ולהבין רק כשקיבלת ציון שלא הבנת עקרונות נכון\n\nהמבחן: \nפתירת מבחני עבר מרגישה כמו לדפוק את הראש בקיר\nהניסוח די גרוע ואם לא הבנת בדיוק מה הכוונה אתה יכול לבהות בשאלה שעות\nהמבחן שלנו הרגיש הוגן יחסית בניסוח עד לחלוקת ציונים\nהשאלות דורשות הרבה יצירתיות ולא רק את ידיעת החומר שזה לגיטימי אבל הרבה יותר קל ליפול במבחן כזה על פספוסים קטנים\n\nמפרגנים בפקטור ודואגים שהציון הסופי יהיה באיזור ה80\n\nהשורה התחתונה: \nקורס שממש ממש רציתי לאהוב וביאס בסוף\nלא עמוס אבל גם לא מובן\nסיכוי סביר להוציא ציון סבבה אבל הוא יבאס אותך עדיין כי הוא יגיע אחרי פיקטור מ60", "timestamp": 1644427429244}, {"author": "student", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: Tal \nחוות דעת - הרצאות: couldn't keep up with the lectures as in the middle of each lecture he would start talking about irrelevant things, it felt like he was jumping subjects which made it hard to track. Tal is passionate about the subjects but i think he lets his passion control him and that's why he wants to explain everything related and unrelated to the syllabus.\n\nשם המתרגל/ת: itay\nחוות דעת - תרגולים: watched the recorded tutorials, itay is amazing, he is passionate about the subject he is a great tutor and made it possible to pass the course.\n\nשעורי הבית: referenceable if you know someone that already taken the course, they do light checks and they represent 20% of the final grade so that's easy 20 on the final grade\n\nהמבחן: \nI still didn't do it but from my research and the histograms it looks like they want everyone to succeed so they just give a big factor for everyone to pass\nהשורה התחתונה: \ntough experience, it's not nice to feel lost in such a futuristic course.\non a personal level, I found mathematics hard at the beginning since they just start using these weird notations that as a CS student I've never seen before where I had to research it on my own to understand.\nto conclude, Tal has a potential of a great teacher, but he is not organized, and keeps jumping subjects in lectures, the mathematical notation for none physics students is a struggle at the beginning,", "timestamp": 1675959683639}, {"author": "שרדינגר", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "נתחיל מזה שזה קורס מעניין - לומדים את הכללים הבסיסיים לחישובים קוונטיים וכן גם אלגוריתמים כמו טלפורטציה ופירוק לראשוניים של שור. כן גם מדברים על החתול של שרדינגר ודברים נוספים ששמעתם עליהם בpopular science. מקבלים סך הכל הבנה בסיסית ביותר של חישובים קוונטיים.\n\nההרגשה שאני קיבלתי מהקורס היא שמניחים שתחילת הקורס קלה לנו. זה לא המצב. חצי מהקורס התעסקתי בלהבין את האלגברה מאחורי הדברים. יכול להיות שהבעיה היא בנו הסטודנטים שלא עצרנו את הספרינט אבל אין ספק שכרגע הקורס רץ בלי שהסטודנטים מצליחים להבין עד הסוף מה רוצים מהם.\n\nתרגילי הבית לעיתים כבדים אבל לא משהו מיוחד.\n\nהמבחן - בדרך כלל קשה וארוך, לעיתים לא פתיר. עם זאת יש פקטור עד שהממוצע מגיע ל80+, ככה שקשה להתלונן.\n\nהשורה התחתונה - אל תפחדו לקחת אם הנושא מעניין אתכם. כן תשתדלו להוריד את הסגל לקרקע ולגרום להם להסביר בבירור הכל. זה לא רק אתם שלא מבינים.", "timestamp": 1716823392219}]}