{"posts": [{"author": "מישהו", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: בני קיממפלד\nחוות דעת - הרצאות: ההרצאות היו סבבה אבל טיפה כמו ההיסטוריה של האינטרנט. אותי אישית זה פחות עניין והרגיש לי מעט לא פרקטי. \n\nשם המתרגל/ת: אפרת ובני\nחוות דעת - תרגולים: נוצר רושם שהמתרגלים לא תמיד יודעים את החומר ברמה של ללמד אותו לאחרים וזה מעט מאכזב בקורס שחלק מהסטודנטים כבר מגיעים עם ידע (לפחות מעט ידע) מהתעשייה.\n\nשעורי הבית: 3 השיעורי בית הראשונים קלים, הפרויקט מאוד מאוד כבד והוא החלק הכי משמעותי בקורס. תכלס הפרויקט די מלמד ונחמד. אין קשר בין השיעורי בית לתרגולים ולהרצאות שזה חבל. הבדיקה של הפרויקט היתה מעט מוזרה, היו כל מיני דרישות שהופיעו רק במהלך הבדיקה ולא נאמרו לנו מראש.\n\nהמבחן: מבוסס על שיעורי בית ופרויקט\n\nהשורה התחתונה: מעניין, נחמד, היו דברים שהייתי משנה אבל תכלס שווה את הנקז בסוף", "timestamp": 1647850690543}, {"author": "מישהו", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ניסן אוחנה\nחוות דעת - הרצאות:  הרצאות ותרגולים מועברים ביחד, סה\"כ מעניינים ורלוונטיים אבל ה3 שעות הרצופות וקיום השיעור ב9 וחצי בבוקר מקשות על הריכוז.\n\nשם המתרגל/ת: ניסן אוחנה\nחוות דעת - תרגולים: מה שנאמר על ההרצאות\n\nשעורי הבית: עומס נוראי, הקורס הכי עמוס שהיה לי בתואר חוץ מקומפי. ההגשות באות על חשבון כל הקורסים האחרים וכמעט לאף אחת מהן לא היה מספיק זמן כדי לעשות אותן כמו שצריך.\n\nהמבחן: אין מבחן. פרוייקט סופי בחודש האחרון של הסמסטר. עניין העומס רלוונטי גם לפה. השקעתי את הלב והנשמה וויתרתי כמעט על כל דבר אחר שהיה לי בחודש כדי להספיק את הפרוייקט (מפגשים עם חברים, כושר, הגשות אחרות שהפלתי קצת את העומס על השותף השני באופן לא הוגן), ובסוף גם אחרי כל זה לא הספקתי לסיים אותו והתוצר הסופי לא יצא כמו שצריך.\n\nהשורה התחתונה: מאוד תלוי בסיטואציה האישית של הסטודנט. מצד אחד חומר מעניין והכי רלוונטי לעבודה בתעשייה היום, מצד שני עומס ברמה שאם לא מוכנים שכל הסמסטר יהיה סובב סביב הקורס הזה ממליץ לתפוס מרחק.", "timestamp": 1674587181823}, {"author": "JD", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "generally fun course, taught well, the HWs take a bit of work but it is still fun for anyone into frontend and backend development. final project submitted before semester end makes it a short time for it, but you can still have it done on time.\ngenerally high grades.", "timestamp": 1679394787956}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניסן אוחנה\nחוות דעת - הרצאות: ההרצאות מועברות מעולה, ניסן מסביר ממש טוב ומאוד משקיע. ההרצאות מעניינות ורלוונטיות מאוד לתרגילי בית ולתעשיה\n\nשם המתרגל/ת: התרגולים הם המשך ישיר להרצאות. אין הפרדה בין תרגול\\הרצאה. (לפחות בסמסטר הזה)\n\nשעורי הבית: מאוד מאוד עמוסים, לוקחים ים זמן על חשבון שאר הקורסים. הפרויקט להגשה ליום האחרון של הסמסטר והוא מאוד מאוד עמוס. מי שאין לו שותף לקורס, ממליץ להתרחק. אם נופלים על מישהו שלא עוזר במקרה הטוב או הורס במקרה הרע אפשר להגיד שלא יהיה לכם (לך) מספיק זמן לסיים הכל, כי השיעורי בית \n והפרויקט בנויים כך שיש כמות עבודה לזוג.\n\nהמבחן: אין. פרויקט ארוך ולא פשוט.\n\nהשורה התחתונה: מי שיש לו זמן, שותף ורוצה ללמוד - מאוד מומלץ. אחרת כדאי לוותר", "timestamp": 1681316510048}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ניסן אוחנה\nחוות דעת - הרצאות: 3 שעות ברצף (הרצאה + תרגול) שגם מועבר בזום ומוקלט. סופר מעניין, חומר מאוד רלוונטי לתעשייה וניסן פשוט מעולה.\n\nשם המתרגל/ת: עדי ואור\nחוות דעת - תרגולים: 3 סדנאות בלבד של שעתיים במהלך הסמסטר שמועבר בהן קצת חומר + תרגיל \"קצרצר\" (הרבה לא הספיקו לסיים במהלך הסדנא אבל ההגשה הייתה עד למחרת בערב) שהגשה שלו מקנה נקודה בונוס לציון. הועבר במקביל בזום והוקלט.\n\nשעורי הבית: 3 תרגילים ופרוייקט כאשר רמת העומס עולה. הראשון לא נורא, השני והשלישי כבר יותר כבדים. הפרוייקט די עמוס אבל עם תכנון נכון של הזמן ושותף טוב לגמרי אפשרי להספיק הכל (ב-4 שבועות האחרונים של הסמסטר). הפרוייקט מהווה 80% מהציון של הקורס ומכיל בתוכו עקרונות מכל מה שנלמד בקורס, היה כיף ומעניין לעבוד עליו (מתכננים ובונים  מערכת מיקרוסרביסים ו-UI).\n\nהמבחן: הצגה בעל פה (בזום) של הפרוייקט (כוללת שאלות על ה-design של המערכת) ו-3 שאלות קצרות לכל שותף, רנדומליות על החומר של הקורס. בחלק מהשאלות על החומר נכנסו לפינות אבל זה היווה רק 10 נק מהציון של הפרוייקט.\n\nהשורה התחתונה: קורס ממש מעניין וסופר רלוונטי לתעשייה ובאמת מלמד איך אתר אינטרנט עובד. לא ממש טכניוני באופי (לטובה לדעתי - לא תיאורטי כמו הרבה קורסים בפקולטה). אכן קורס עמוס (בעיקר בחודש האחרון של הסמסטר כשעובדים על הפרוייקט) אבל שווה לדעתי - נחשב גם כפרוייקט.", "timestamp": 1716040263698}]}