{"posts": [{"author": "קורונית", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמעניינים וארוכים\n\nהמבחן: \n\nהשורה התחתונה: \nאחלה רקע לתחום", "timestamp": 1597916476810}, {"author": "טל", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: קורס מעניין מאוד, המשך של אלגוריתמים ( אלגוריתמי חיפוש וכדומה ) כמו כן יש מעט מערכות לומדות לקראת סוף הקורס\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא עמוס מאוד ומעניין. \n\nהמבחן: הסמסטר בגלל הקורונה היה מבחן בית שדמה מאוד לשיעורי הבית. ניתנו שלושה ימים לפתרון המבחן שהיה מורכב מרטוב ויבש כמו שיעורי הבית.\n\nהשורה התחתונה: מאוד ממליץ על הקורס למי שאהב אלגוריתמים. עד כה הקורס שהכי אהבתי בתואר.", "timestamp": 1603314619483}, {"author": "-", "difficultyRank": 4, "generalRank": 5, "semester": "201902", "text": "שם המרצה: פרופ' שאול מרקוביץ'\nחוות דעת - הרצאות: מעניין, המצגות מספיקות למי שלא אוהב להקשיב להרצאות\n\nשם המתרגל/ת: רפאל גד\nחוות דעת - תרגולים: מסביר מצויין, מומלץ\n\nשעורי הבית: 3 תרגילי בית רטובים, חלקם קשים יותר וחלקם פחות אך סה\"כ לא עמוס מדי והתרגילים נחמדים\n\nהמבחן: בסדר\n\nהשורה התחתונה: קורס בחירה מעניין ומומלץ", "timestamp": 1608820119180}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "201801", "text": "שם המרצה: שאול מרקוביץ'\nחוות דעת - הרצאות: מרצה טוב ומצחיק, ומעניין, עם זאת היה לנו פורמט הרצאה מוזר בגלל אולם הרצאות ענק שלא ממש אפשר לשאול שאלות אלא רק לשלוח למרצה שאלות דרך איזה אתר והוא מסתכל מידי פעם. לפעמים הוא קצת מעופף.\nלא כל נושאי הקורס מועברים טוב לטעמי-בעיקר הנושא של למידה מועבר לא מספיק טוב.\n\nשם המתרגל/ת: מיכל בדיאן\nחוות דעת - תרגולים:  מתרגלת מעולה-מומחית אמיתית בחומר, מעניינת ויודעת להסביר, תרגולים מעניינים ומועילים מאוד.\n\nשעורי הבית: פחות עמוסים לדעתי ממה שעושים מהם. 3 תרגילים כאשר הראשון נחשב ארוך ולמרות שהוא בגדול ממוחזר יש סמסטרים שהוא יותר מובן מאחרים-אצלנו היה ארוך למדי אבל זורם ולעניין. תרגיל שני מאוד כיף-מדובר במשחק! יש תחרות בין הסטודנטים כאשר המקומות הראשונים מקבלים בונוס לסופי אבל זו השקעה מיותרת-עדיף לעשות את מה שצריך לתרגיל וזהו. תרגיל שלישי אצלנו היה לא מובן אבל זה לא תמיד ככה.\nהתרגילים בפייתון עם חלק יבש משתנה באורכו-לרוב הסברים שקשורים לחלק התכנותי וסיכום בסוג של דוח על הפרויקט. \n\nהמבחן: קשה ומלא מלא חומר! המבחן ללא שום חומר עזר וצריך לזכור כמויות אדירות של מידע, לפעמים יש שאלות קשות. לפחות התרגילים 40% מהסופי והממוצע בהם טוב...\n\nהשורה התחתונה: אני אישית אהבתי וממליץ למרות המבחן. מה שכן למי שלא מתחבר לאלגוריתמים או לא אוהב שפות עילית-זה לא בשבילכם.", "timestamp": 1609620537734}, {"author": "טל רוזנצוויג", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: משעמם וארוך יתר על מידה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא הלכתי לתרגולים.\n\nשעורי הבית: שיעורי בית רטובים שנדרש להשקיע בהם הרבה זמן בערך שבוע לתרגיל.\n\nהמבחן: בסמסטר שלי לא היה מבחן, והסתמכו על תרגילי הבית בלבד.\n\nהשורה התחתונה:\nאני ממליץ על הקורס כי החומר קליל, ואם אין מבחן זו מציאה.", "timestamp": 1612869988074}, {"author": "נמר הכסף", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שאול\nחוות דעת - הרצאות: אחלה הרצאות, אווירה טובה וקלילה. שקפים מעולים.\n\nשם המתרגל/ת: לא היו בפועל\nחוות דעת - תרגולים: החליטו הסמסטר כל שבוע להעלות תרגול של מתרגל אחר, זה לא עובד. הם לא העבירו תרגולים באופן סדיר, וזה ניכר ברמת \"האכפתיות וההשקעה\".\nלא היה כ\"כ רלוונטי בכל מקרה - השקפים וההרצאות די כיסוי.\n\nשעורי הבית: \n\nהמבחן: היה תרגיל בית מסכם. עדיף.\n\nהשורה התחתונה: קורס נחמד מאוד.", "timestamp": 1613554309860}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: \nמרצה מקסים, מסביר טוב והחומר מעניין מאד\n\nשם המתרגל/ת: היו כמה\nחוות דעת - תרגולים: כולם מעולים, כל הסגל נהדר\nשעורי הבית: מאד מאד מעניינים, לומדים מהם המון\n\nהמבחן: היה מאד קשה, אבל התחשבו והביאו בדיקה מקלה\n\nהשורה התחתונה: קורס מאד מאד מומלץ ואורן מקסים", "timestamp": 1626893472316}, {"author": "Omer Gino", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: מעניין מאד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מאד נחמד\n\nהשורה התחתונה:", "timestamp": 1627804290069}, {"author": "Gadi Nabet", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמצגות מאוד ישנות... צאיך לעדכן אותם ולפרט יותר מה שלומדים\nשעורי הבית: \nארוכים מאוד\nהמבחן: \nקשה, החומר חדש על בלמן לא הוסבר ובכלל לא תרגלנו אותו מה שהקשה מאוד על המבחן...\nהשורה התחתונה: \nקורס לא הכי מעניין אבל זה רק מבוא...", "timestamp": 1635016836188}, {"author": "נס", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: \nמאוד לא ברור בעיני. חומר פשוט מאוד שמועבר בצורה מבלבלת, אבל המצגות נחמדות\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \nלא מצאתי מישהו שנותן ערך מוסף על פני פשוט לקרוא את המצגות - וזו פעם ראשונה בתואר שבחרתי לעבור על מצגות התרגול במקום להגיע אליו\n\nשעורי הבית: \nכיפיים ומעניינים אבל הכי לא ברורים שהיו לי בתואר עד כה(אפילו יותר ממת\"מ). השאלות מנוסחות בצורה שניתן להבין אותה בכמה דרכים, והצוות עונה כל כמה ימים לשאלות בפיאצה, וכשיש מענה הוא בעצמו לא חד משמעי. רוב התרגילים לקחו לנו המון זמן בעיקר כי נתקענו כל הזמן והתלבטנו איך להמשיך, ותמיד המסקנה הייתה שפשוט לא ניתן לעשות יותר מידי כי באמת אפשר להבין את הדרישה בכמה אופנים.\nבנוסף הסגל הרבה לשנות את התרגיל ברמה שדרשה השקעה נוספת ושינוי מימוש שלקח שעות. ממש הרס את החוויה\n\nהמבחן: \nסביר סה\"כ\n\nהשורה התחתונה: \nקורס מעניין, שב מעניינים וסגל מתסכל", "timestamp": 1652470530538}, {"author": "YT", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרה קרן\nחוות דעת - הרצאות: לא יודעת להעביר את החומר כמו שצריך. המון טעויות בשקופיות ותיקונים תוך כדי הרצאה. בשלב מסוים ויתרתי על ההרצאות לגמרי וזה לא הרגיש לי חסר בשום צורה, יש אולי 2 תתי נושאים קטנים שמועברים בהרצאה ולא בתרגול ואפשר בקלות להשלים לבד.\n\nשם המתרגל/ת: ספיר טובול\nחוות דעת - תרגולים: מתרגל סבבה, המצגות של התרגולים טובות וסה\"כ התרגול מועבר בצורה ברורה וכל שיעור יש חזרה קטנה של השיעור הקודם.\n\nשעורי הבית: 3 רטובים, מעצבנים ממש ודי ארוכים אבל לא סוף העולם.\n\nהמבחן: \nיש מועדים מאד קשים ויש קלים יותר, אצלנו היה מועד לא קשה אך ארוך. הלמידה למבחנים די קשה כי מרגיש שהצורה שבה הקורס מועבר בכלל לא מזכירה את מה שיש במבחנים. בסוף הממוצע גבוה.\n\nהשורה התחתונה: סה\"כ הקורס עצמו והנושאים של הקורס מעניינים, אך לטעמי כל הדרך שבה הוא מועבר טעונה שיפור. מניח שזה קורס בחירה שווה כי הממוצע גבוה ואם מרפרנסים תרגילי בית הם לא באמת כל כך ארוכים.", "timestamp": 1677182697689}, {"author": "אמא של בידוסה", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: יוסי BAD, מרצה מטריד ודוחה.\n\nשם המתרגל/ת: בידוסה\nחוות דעת - תרגולים: בידוסה GOOD, אחלה גבר.\n\nשעורי הבית: כיף\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: כן", "timestamp": 1677523686758}, {"author": "יובל הופמן", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: שרה קרן\nחוות דעת - הרצאות: \nהרצאות מעניינות סה\"כ מסודר, השתתפות פעילה בכיתה נותן מוטיבציה גבוהה ללמידה\n\nשם המתרגל/ת: ספיר\nחוות דעת - תרגולים: מתרגל אלוף ברור, בהיר, וסבלן. מומלץ בחום\n\nשעורי הבית: אחד מהקורסים הכי עמוסים שלקחתי. אם זאת, היה כיף לפתור את הת\"ב המשימות היו מעניינות.\n\nהמבחן: מבחן טריקי, שואלים הרבה על פינות ופחות על על עיקר החומר\n\nהשורה התחתונה: תפנה זמן בסמסטר וקח אותו (אבל תפנה, אחרת הלך לך על החיים)", "timestamp": 1678036760743}, {"author": "יומולדת", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שרה\nחוות דעת - הרצאות: \nהמרצה ממש אוהבת את החומר אבל ההעברה שלו הרגישה מבולגנת והיה קשה להבין מה הולך לפעמים. אם הלכת לאיבוד לרגע די קשה לחזור להקשיב. סה\"כ אבל החומר לא הכי מורכב ואם מנסים להיות מעורבים בשיעור ולהשתתף אפשר לקחת את המידע שצריך מההרצאות ובסוף מבינים בתרגול מה שחסר.\nשם המתרגל/ת: בידוסה\nחוות דעת - תרגולים: \nמתרגל בין הטובים שהיו לי בתואר!\nמשקיען ברמה מטורפת.\nתרגולים מצחיקים ומהנים ותמיד היה מגיע קצת לפני התרגול בשביל לכתוב דברים על הלוח שיעזרו בהמשך.\nמעביר את החומר בצורה ממש ברורה ומסודרת ויודע לתת אינטואיציות חשובות לקורס שמתבסס על הבנה ותחושות בטן.\nלאורך התרגול מקפיד לערב את הסטודנים ולוודא הבנה.\n\nבכללי אפשר לראות את ההסברים שהוא עונה בפיאצה וזמין תמיד למיילים ולשעות קבלה שאין דברים כאלה. גרם לי להעריך את הפיאצה.\n\nלקראת מועד ב עשה לנו שעת קבלה של 3.5 שעות מפורטת שעזרה המון ולהרבה אנשים ועילאי\n\nסה\"כ ממליץ בטירוף, מתרגל שיודע את החומר כמו שצריך ומבין מה זה להיות סטודנט ואת נקודת המבט של אחד.\n\nשעורי הבית: \n3 תרגילים - חלק רטוב וחלק יבש בכל אחד.\nחמודים. חובה לפתור את הרטובים מול המצגות של התרגול כי זה פרטיקלי לממש את האלגוריתמים שראינו שם. \nהחלק היבש של כל תרגיל מצריך הבנה וחשיבה אבל בעיקר אינטואיציות נכונות.\nאני ממליץ לא להתחיל ישר את התרגיל אלא לחכות יומיים שלושה שאנשים כבר ישאלו שאלות עליו ולא יהיו בעיות שאתם תצטרכו לגלות.\nבאיזור היומיים עבודה לכל תרגיל בהנחה שעובדים עם שותף סבבה.\nהמבחן: \nמבחן סבבה. לא קשה, אבל ארוך. חשוב להבין את החומר ולהרגיש בנוח עם הפרמטרים של כל אלגוריתם כי כנראה יהיו שאלות הבנה על מה יקרה אם אחד ישתנה לכאן או לכאן ודברים דומים.\nחשוב גם לדעת לפתור דברים במהירות כמו לחשב מדיניות ב MDP ודברים כאלה, ולשים לב לדרכים לקצר את הפתרון בצורה הבנתית - מה שיכול לקרות רק אם יש הבנה של החומר.\nהציונים טובים בסוף.\n\nהשורה התחתונה: \nקורס חמוד.\nאני לא בטוח כמה ידע הוא תרם לי אבל הוא היה מהנה.\nאני ממליץ למי שמחפש נקז במערכת ורוצה להתעניין בתחום.\nעם שרה גם מועבר נושא של RL שלא מועבר בסמסטרים אחרים ,אז אולי זה גם יתרון לקחת איתה את הקורס.\nשוב מזכיר, לנסות את התרגולים של בידוסה.", "timestamp": 1678315321674}, {"author": "er", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nמרצה מצויין ומרגישים שאיכפת לו שיבינו את החומר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמתרגלים מצויינים\n\nשעורי הבית: \nעמוסים: רטוב: בעיקר מימוש אלגוריתמים שלומדים בקורס (כמעט אחד לאחד). יבש: המון שאלות הבנה על החומר. תרגילי הבית 45% מהציון הסופי\n\nהמבחן: \n\nהשורה התחתונה: \nקורס מעניין, יש עומס בתרגילי הבית ונדרשת הבנה", "timestamp": 1689689582750}, {"author": "ע.ג", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: זלמן אורן\nחוות דעת - הרצאות: מעניינות אבל לא כזה עוזרות ללמידה כי חוזרים על הכל בתרגולים \n\nשם המתרגל/ת: בידוסה אור רפאל\nחוות דעת - תרגולים: מסביר בצורה ברורה ולוקח את הזמן\n\nשעורי הבית: ממש חשוב לעשות אותם טוב טוב ולהבין אותם כי הם מאפשרים להבין את החומר. יש 3 ת\"ב 15% כל אחד אז גם שווה לקבל ציון טוב. \nהם ארוכים - המון שאלות וסעיפים-  אבל יש המון זמן לעשות את הראשון והשני אז להתחיל מוקדם ולהתקדם קצת כל שבוע ויהיה בסדר. \n\nהמבחן: הוגן אבל ממש ארוך. יש שאלות דומות לשאלות של הת\"ב. יש שאלות ממש קלות ושאלות יותר קשות כמו כל מבחן. \n\nהשורה התחתונה: מומלץ. מעניין וסה\"כ ציונים טובים.", "timestamp": 1690455866368}, {"author": "צפרדע אנונימית", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: צפיתי בהקלטות של אורן. ההרצאות הן בסדר, מפורטות למדי ויורדות להרבה דקויות שבממוצע על כל המבחנים לא נשאלים עליהן. מצד שני כמעט בכל מבחן מופיעה על תוכן ספציפי מהרצאה שחבל לא להכיר. ההרצאות לא מתישות ולכן מומלץ ללכת או לצפות בהן. מה גם שאורן מאוד נחמד ומסביר טוב.\n\nשם המתרגל/ת: אופק/רון/ספיר (מוקלט)\nחוות דעת - תרגולים: תרגולים מאוד מתומצתים ומסבירים היטב את הנקודות העיקריות מההרצאות שזה נהדר. בלמידה למבחן מומלץ לעבור עליהם היטב לפני ההרצאות כי זה מאוד מחדד את מה שצריך להכיר מהקורס. גם התרגולים לא כבדים, מאוד זורמים ואפילו כיפים בחלקם. הנושאים עצמם גם כן מאוד קלילים.\n\nשעורי הבית: 3 תרגילי בית (15% תקף לכל אחד) - כלומר 45% תקף שזה המון וצריך באמת להשקיע הרבה כדי לקבל את ה100. מומלץ לחלק חצי-חצי עם השותף, מאוד מקל וכל אחד לומד משהו מהחומר. להשוות את התשובות עם לפחות 3-4 מקורות אמינים ואתם תהיו בסדר גמור. \n\nהמבחן: לעבור על התרגולים וההרצאות ועוד משהו כמו 4 ימים למבחנים ויהיה ממש בסדר. יש מבחנים הזויים, יש מבחנים פחות. זה מאוד תלוי מועד וסמסטר אבל זה מנורמל היטב בפקטור. אצלנו היה מאוד ארוך ולכן ביטלו 3 סעיפים (במשקל 8 נקודות), הציון היה מתוך 105 (אז היו 5 נקודות אקסטרה) וגם 3 נקודות פקטור. תוסיפו לזה 45% מגן וזה באמת מקפיץ את ציון המבחן, לכן זו פחות הדאגה.\n\nהשורה התחתונה: ניכר שסגל הקורס רוצה שתתבצע למידה איכותית. התוכן מעניין ונחמד (לא הדבר הראשון שחושבים עליו כשאומרים בינה מלאכותית אבל סגנון אלגו 'לייט') ותרגילי הבית גם לא כבדים במיוחד. מומלץ מאוד.", "timestamp": 1690490441456}, {"author": "אמא של בידוסה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: יוסי BAD, מרצה מטריד ודוחה.\n\nשם המתרגל/ת: בידוסה\nחוות דעת - תרגולים: בידוסה GOOD, אחלה גבר.\n\nשעורי הבית: כיף\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: כן", "timestamp": 1692077093000}, {"author": "לא המסווג הכי לינארי", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: מרצה מעולה, ממליץ מאוד ללכת לפרונטלי איתו. 10/10\n\nשם המתרגל/ת: מוקלטות\nחוות דעת - תרגולים: \n\nשעורי הבית: מעניינים מאוד, התרגיל האחרון נבדק בצורה מבזה קצת אבל נתעלם מזה..\n\nהמבחן: קצת ארוך מדי, אבל השאלות היו ברמה הוגנת\n\nהשורה התחתונה:", "timestamp": 1693497541305}, {"author": "-", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "לרוב אני נגד ביקורות בזועמות ב- cheesefork אבל עכשיו באמת לא נשארה ברירה.\n\nהגעתי לקורס מתוך סקרנות כללית לעולם תוכן כמו הרבה סטודנטים אחרים בטח. התאכזבתי מהרבה בחינות.\n\nהחומר של הקורס שטחי מצד אחד, הרבה התעכבות על קונספטים מאלגו ובאופן כללי הוכחות בנפנופי ידיים ודוגמאות לא רלוונטיות למציאות, ולא רחב היקף מצד שני. בעיקר לא ברור למה צריך להשקיע שליש מהקורס ללמד חומר בהיקף של שבוע וקצת מלומדות בזמן שהיה אפשר להעמיק הרבה הרבה יותר בנושאים המעניינים והחשובים של בינה קלאסית. ההרצאות והתרגולים לא נוראיים, ומי שאוהב אלגו לגמרי יכול להתעניין, אבל באופן אישי לא הצלחתי להתעלם מתחושת הפוטנציאל המבוזבז של הקורס.\n\nוהשיא מגיע בתרגילי בית. אני קרוב לסיום התואר ואני יכול לומר בלב שלם שלא חוויתי תרגילי בית פחות מקצועיים מבקורס הזה (וחוויתי):\n1. התרגילים מנוסחים גרוע בצורה קיצונית, ועד שכולם מגיעים לאיזושהי הסכמה מבולבלת מתרגל ידאג לשנות אותם לגמרי באיזו הערה לא מחושבת בפיאצה שוב ושוב ושוב ושוב. אתם תמצאו את עצמכם עושים את אותו סעיף משעמם ומשכתבים את הרטוב, שבכל מקרה סיוט לכתוב עם הסביבות המסורבלות שמסופקות, המון פעמים לאורך העבודה.\n2. התרגילים לא מלמדים ובטח שלא בינה ברובד מעשי. בתרגיל בית 1 היינו צריכים לממש אלגוריתם כבד בצורה לא מעשית בזמן הריצה שלו, והרבה יותר גרוע, בתרגיל בית 2 היינו צריכים לכתוב אלגוריתמים על בעיה שהם בכלל לא התאימו אליה. התכנון של התרגיל היה שגוי לגמרי כי לא הייתה שום דרך לדעת שהוא עובד (אם האלגוריתם שנכתב נכון התוצאות אמורות להיות רעות). זאת, בזמן שיש כל כך הרבה בעיות מעניינות מהעולם של בינה להתעסק בהם.\n3. התרגילים ארוכים בלי סיבה ברורה, פשוט מלא סעיפים מלאים בשאלות פשוטות ותיאורטיות שראינו כבר אחד לאחד בהרצאה ובתרגול. בנוסף הרטובים הם פשוט לכתוב בפייתון את האלגוריתמים מהרצאות והתרגול אחד לאחד, אז אפילו אין תחושת ערך לזמן ולמשקל הרב שיש להם מהקורס.\n\n\nלסיכום, מי שלוקח מתוך אהבה לאלגו, לקחת קורס מתקדם כלשהו באלגוריתמיקה במקום, ומי שלוקח מתוך אהבה ללמידה ותחומים מעשיים מהסוג הזה ייקח לומדות דיפ ופרויקטים בסגנון במקום. \nקורס שיגרום לכם להגיד \"חבל זה היה להיות מעניין\" פעם פעמיים בשבוע.", "timestamp": 1712315617982}, {"author": "BarTzi", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "האמת היא שלא רציתי לקחת את הקורס הזה בסמסטר הזה. אבל, בגלל שהטכניון עדכן את תאריכי המבחנים של סמסטר אביב בערך יומיים לפני שהוא התחיל, הייתי חייב לקחת אותו עכשיו, עקב התנגשות מבחנים.\n\nבדיעבד, זאת היתה טעות. חשוב להסביר למי שלא לקח את הקורס, שהשם הנכון שלו הוא בעצם 'אלגוריתמים 1 + רטובים' - אז אם לא אהבתם אלגו, יש מצב שתהיה לכם בעיה. חלק משמעותי מהקורס עוסק באלגוריתמי חיפוש על גרפים ובמימוש שלהם. החלק האחרון (שירד בסמסטר שלנו) , עוסק במבוא ללמידה. \n\nלמרות הכוונות הטובות של סגל הקורס, זה הקורס היחיד בסמסטר הזה שעשה הפוך על הפוך והפך ליותר קשה, מהסיבות הבאות:\n\n1. שינויים / ניסוחים לא ברורים / אי הבהרות קריטיות בנוגע לתרגילי הבית. תשאלו כל מי שלקח את הקורס הסמסטר, והוא יגיד לכם שהוא בזבז כמות לא הגיונית של זמן בפענוח הדרישות של הסגל, בהבנה למה הפונקציות שהסגל *סיפק* עושות משהו הפוך לגמרי ממה שהן אמורות ובקריאה של פוסטים עלומים בפיאצה ע\"מ לנסות להבין מה לעזאזל אנחנו אמורים לעשות. בשורה התחתונה: למרות שהתרגילים לא קשים תכנותית, הקושי היה להבין מה אנחנו אמורים לעשות.\n\n2. חוסר הבהרה לגבי נוסחאות שמשתנות בין התרגולים להרצאות (MDP), או אלמנטים שמופיעים במבחנים לאחר התייחסות מינורית בהרצאה (מונטה קרלו)\n\n3. קביעת שעות קבלה לקראת המבחן שהיא בעיניי לא פחות מביזיונית. שתי שעות קבלה - על הראשונה קיבלנו עדכון במייל שהיא תהיה למחרת (פחות מ 24 שעות להתכונן / לשלוח שאלות. כל זאת בעוד שרוב הקורס בכלל לא התחיל עוד ללמוד למבחן ולפתור מבחנים), והשניה נקבעה יום לפני המבחן (מטופש ולא עוזר). \n\nזה בפער משמעותי הקורס הכי מוזר שלקחתי בטכניון. אני מעריך את ההתאמות של הסגל למילואימניקים (בעיקר את האפשרות לתת להם להיבחן עם חומר פתוח), אבל זה לא היה שווה את השטויות שהיינו צריכים להתמודד איתן ברטובים. \n\nעד שיהיה שינוי משמעותי באופן ההעברה שלו, במיוחד בהתנהלות הסגל הזוטר (שיעורי בית, שעות קבלה למבחן וכו') - אני לא ממליץ על הקורס, למרות החלוקה המאוד הוגנת שלו בין ציון המבחן לציון תרגילי הבית (כן ירבו).", "timestamp": 1714382534663}, {"author": ":/", "difficultyRank": 3, "generalRank": 2, "semester": "202302", "text": "סגל לא מקצועי, מומלץ לחכות ולקחת את הקורס אחרי שהסגל יתחלף.\nחבל כיוון שהקורס יכול להיות נחמד אבל הזלזול של הסגל בעיקר כשזה מגיע לשיעורי בית ובימיוחד בתרגיל השלישי היה מתחת לכל ביקורת.", "timestamp": 1714554780576}, {"author": "אכזבה גדולה", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה:  אורן\nחוות דעת - הרצאות: בסדר. ההרצאות שלו היו הדבר היחיד הסביר בקורס הזה.\n\nשם המתרגל/ת: דניאל\nחוות דעת - תרגולים: פשוט לא. אני בהתחלה הלכתי אליו והיה ממש גרוע אז עברתי למוקלטים שהיו סבבה.\n\nשעורי הבית: פשוט ביזיון. אינספור שינויים עד ליום האחרון של התרגילים. תרגיל 1 ו-3 היו מזעזעים והמענה עליהם היה גם פח אשפה. הרגיש שממש זרקו עלינו ולא היה להם אכפת בכלל מההצלחה שלנו.\n\nהמבחן: פשוט היה מביך כמה המבחן עצמו בדק טכניקה ארוכה וסיזיפית והוכחות מטורפות וכל זה בשלוש שעות. אפס התחשבות בסטודנטים וההרגשה היא שרוצים לדפוק אותנו.\n\nהשורה התחתונה: אם לא צריך לעשות את הקורס הזה אז אני ממליצה לא לעשות אותו למרות שזה כאילו מפתה 45% שיעורי בית.", "timestamp": 1714645775684}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "אם הייתי יודע שזה מה שיקרה עם הקורס הזה הסמסטר בחיים לא הייתי לוקח אותו. 3 נק\"ז שהם משאבת זמן נוראית שהסתיימו במבחן מאכזב.\n\nשם המרצה: אורן\nחוות דעת - הרצאות: \nהצורה שבה הוא מעביר את ההרצאה זה לנהל דיון עם הסטודנטים על החומר, היו 2-3 אנשים קבועים שהוא דיבר איתם ובתכלס כל הדיונים האלה פשוט מקשים להתרכז ולהבין. אחרי כמה שבועות אנשים פשוט הפסיקו להגיע. \n\nשם המתרגל/ת: מוקלטים\nחוות דעת - תרגולים: \nהיה בסדר, המוקלטים מהסמסטר שלנו יצאו סבבה.\n\nשעורי הבית: \nמשאבת זמן לא נורמאלית. זה סמסטר 5 שלי בתואר, בחיים לא נתקלתי בתרגילי בית כאלה גרועים!  ולא כי הם היו קשים אלא כי היו מנוסחים גרוע עם 1000 תיקונים וגם נבדקו בצורה רשלנית ובזויה (יש 2 פונקציות בתרגיל בית 3 ש90% מהסטודנטים קיבלו עליהם ציון של 0 ולא ברור לאף אחד למה).\nלמי שמעניין אותו להבין לעומק מה קרה אני אשאיר פירוט *נרחב* על התרגילי בית בסוף.\n\nהמבחן: \nאף אחד בסגל לא קלט שזה הולך להגמר רע כשהם כתבו (ובתקווה גם ניסו לפתור) את המבחן הזה?\nאי אפשר לסיים את המבחן כמו שצריך ב 3 שעות. \nלמה לכתוב שאלה על שתי בחורות בשמות קים וקלי? כן זה בטח מצחיק לכם בתור סגל אבל קשה לכם לראות שזה מבלבל? ולמה לשים שאלת משחקים שכדי לפתור אותה צריך לעשות חישובים מייגעים ומלא עבודה שחורה. אפשר לבחון על החומר גם בלי שנבזבז את הזמן היקר של המבחן על חישובים קטנים.\nולמה לעשות שאלה עם 5 סעיפים של כל מיני הוכחות שבדרך כלל אין במבחנים וגם אפילו אין לך את הזמן לחשוב על זה ולהוכיח כמו שצריך כי המבחן גם ככה עמוס במלא סעיפים של עבודה שחורה של חישובים.\n\nהשורה התחתונה: \nאם רציתם לקחת את הקורס כי ראיתם שהממוצע גבוה והתרגילי בית הם 45% תחשבו שוב. כל מי שאני מכיר ללא יוצא דופן מצטער על היום שבו הוא נרשם לקורס הזה. \nהסגל של הקורס הזה צריך לעשות עם עצמו חשבון נפש על מה שקרה הסמסטר. \n\n\nפירוט נרחב על תרגילי הבית הסמסטר:\nתרגיל בית 1 היה נורא, ניכר שמי שכתב אותו עשה את זה פעם ראשונה בחייו ושאף אחד לא עשה עליו בקרה. היה בלאגן אחד גדול ודחייה בהגשה שגררה גם דחיה בפרסום תרגילי הבית הבאים.\nתרגיל בית 2 היה היחיד שנכתב כמו שצריך (תודה לך אופק).\nכשחשבנו שאולי זה משתפר הגיע תרגיל בית 3, בגלל הדחיות וקיצור הסמסטר היה לנו שבוע אחד פחות להכין אותו מאשר בסמסטר רגיל והסגל החליט להוסיף לנו עוד 2 פונקציות חדשות שבסמסטרים קודמים היו בונוס. אלה 2 פונקציות לא מוגדרות טוב שהיה איתן הרבה בלגן ושינויים ובאופן לא מפתיע מסתבר שבבדיקה 90% מהסטודנטים קיבלו עליהן 0.\nבגלל שלא היה זמן לסיים את תרגיל בית 3 עד סוף הסמסטר דחו לנו את ההגשה לסוף מועדי א (כאילו שזה עוזר או שיש לך זמן להתעסק בזה בזמן תקופת המבחנים).", "timestamp": 1714656209023}, {"author": "מצטיין נשיא", "difficultyRank": 5, "generalRank": 1, "semester": "202302", "text": "השורה התחתונה:  לברוח !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! הקורס הכי ביזיוני ולא רלוונטי שיש בטכניון", "timestamp": 1714904988956}, {"author": "קים וקלי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אין\nחוות דעת - הרצאות: \nלא הגעתי, לא יודע.\n\nשם המתרגל/ת: אור רפאל בידוסה\\אופק גוטליב במוקלט\nחוות דעת - תרגולים: \nמתרגלים מדהימים כפרה עליהם, לא יודע איך הייתי שורד את הקורס בלעדיהם (לא הייתי, אבל לא שרדתי גם איתם אז לא יודע).\n\nשעורי הבית: \nתקראו את הביקורות הקודמות מהסמסטר, היה באמת נורא וסבלתי מכל רגע. חוץ מתרגיל בית 2.\n\nהמבחן: \nלא יודע, לא ניגשתי אבל שמעתי דברים לא טובים.\n\nהשורה התחתונה: \nכמו שביידן אמר: \"אל תקחו את הקורס בינה\".", "timestamp": 1714925690712}, {"author": "סטודנטית מאוד מאוכזבת", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שעורי הבית: מסורבלים , מיליון טעויות של הסגל מלא שעות עבודה בשביל להבין מה הם רוצים ולתקן טעויות שלהם וקחו בחשבון שיש שיעורי בית על חשבון  תקופת בחינות.\n\nהמבחן: זוועה, לא יודעת איך החציון היה 88 סמסטר קודם אבל נראה שהקורס תפס תפנית רעה ואני שידעתי את החומר מצויין קיבלתי 58- כלומר סופי באזור ה75 שזה מבאס ממש לקורס בחירה\n\nהשורה התחתונה:  רימו אותי, נרשמתי לקורס בשביל לעלות ממוצע וזה רק הוריד. תתרחקו תתרחקו תתרחקו - יש קורסים טובים יותר", "timestamp": 1715586954549}, {"author": "סטודנט אנונימי ממוצע", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "הסמסטר סגל של בינה הגדיר מחדש את המושג \"מתחת לכל ביקורת\"\n\nאם אין סגל זמין להעביר קורס של 150 סטודנטים היה אפשר או להגביל מקומות או לא להעביר את הקורס אבל מה שקורה עכשיו זה חרפה וזה זלזול בזמן שלנו. \nזה פגיעה בסטודנטים שהתחילה בחוסר תכנון של תרגילי בית מותאמים לסמסטר, שהיו ארוכים והכילו אין סוף בעיות ונמשכת עד עכשיו בחוסר פתרון לבעיות בתרגיל בית האחרון כי המתרגלים במילואים.\n\nאם הסגל של הקורס עסוק במחוייבויות אחרות כמו מילואים (שלדעתי חשובות יותר ללא ספק) לאורך הסמסטר וגם המתרגל שאחראי על התרגיל בית במילואים והטסטים לתרגיל בית שגויים ומכשילים חצי קורס וכבר 3 שבועות אין פתרון, אז אולי הדבר האחראי היה לא לפתוח את הקורס הסמסטר מלכתחילה.\n\nכי יש בקורס הזה מעל ל 100 סטודנטים שחלקם במילואים וכולם עוברים סמסטר מאוד קשה ש70% מהעומס שלו נגרם מהקורס \"מבוא לבינה\", מבעיות בניסוח של תרגילי בית ומתרגיל בית 15% תקף שפוצל ל 2 חלקים. והחלק הראשון שהיה להגשה לפני סוף הסמסטר נבדק בצורה שבה עשרות אנשים קיבלו 0 על ההגשה, ככל הנראה בגלל בעיות בבדיקה.\n\nהממוצע של המבחן גם ככה לא מדהים הסמסטר, התרגילי בית נגררו והכילו בעיות ותקלות גם בכתיבה וגם בבדיקה הרבה מעבר למה שסביר.\n\nתמצאו כבר פתרון לסבל המתמשך הזה.", "timestamp": 1715846654355}, {"author": "not Greedy", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: הלכתי ל~4 הרצאות פרונטלי והתייאשתי,עברתי למוקלט והתייאשתי, הוא מלמד בצורה שהוא מנסה שהסטודנטים יעלו על הרעיון,אני מודה שזו שיטה טובה רוב הזמן אבל לדעתי לא הייתה מוצלחת פה, כי מאבדים ריכוז ושוכחים השאלה, וכבר היה קשה לי עם החומר החדש,הוא מתעמק יותר מדי בפרטים שלא רלונטיים לא בש\"ב ולא במבחן\nהלכתי להרצאות לפי הצעת חבר,הצעה לא הייתה טוה ואני מציעה-אם בכלל תכחו את הקורס-ללא ללכת ולצאת עם כאבי ראש\n\nשם המתרגל/ת: ספיר/בידוסה ואופק\nחוות דעת - תרגולים: ספיר ובידוסה-היו מעולים,מסבירים טוב ולא פשוט קוראים מהמצגת ומדגשים מה שצריך להדגיש,אין צורך לראות ההרצאות הם מכסים את הנדרש לדעתי\nלא התחברתי לשיטת הלימוד של אופק והרגיש לי שהיא פשוט קוראת מהמצגת,לא הייתה מסבירה ומתעקבת בנקודות חשובות כמו האחרים לכן העדפתי פשוט לקרוא השקופיות של התרגולים שהיא מעבירה ולא ללכת\nשעורי הבית: עמוסים,במיוחד ת\"ב1 ,הרעיונות שאנו ממשים מעניינים אבל לא יודעת מה קרה אתם הסמסטר,\nצריכים שותף טוב ולפנות זמן לתרגילים.מומלץ לחלק השאלות ביניכם שלא יגזול יותר זמן\n\nהמבחן: במבחן הייתה שאלת הוכחה שלא הייתה כמוה במבחני עבר, ראיתי רק שאלת הוכחה של MDP במבחן עבר שתשובתה הייתה כתובה ממש בתרגול,אבל חוץ ממנה לא היה\nאבל למזלי הרע במבחננו הביאו שאלת הוכחה,השאלה עצמה לא נראלי הייתה מסובכת במיוחד אבל שהמבחן באמת ארוך לא יישאר לכם זמן לחשוב על הוכחת/הפרכת 5 סעיפים,לא כי אתם לא יודעים את החומר אלא כי אין זמן לחשוב ללא לחץ ולהצליח להגיע לפתרון,זו הייתה השאלה שפגעה בי כי לא פתרתי וזה ממש מבאס כי שאר השאלות-למרות שאחת מהן הייתה טריקית-היו סבירות\n\n\nהשורה התחתונה: אני לקחתי בגלל הממוצע וכי לשיעורי הבית יש 45% אבל לא שווה, שיעורי בית זוועה ואני חושבת שחוות הדעת לפני מכסות את זה,המבחן ארוך בצורה מוגזמת כך שהבטיחו שידפקו אותנו בשניהם :)", "timestamp": 1715877717926}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: מוקלט\nחוות דעת - הרצאות: משעמם מאוד\n\nשם המתרגל/ת: מוקלטים של הסמסטר (ספיר, אופק, אור)\nחוות דעת - תרגולים: מושלמים!\n\nשעורי הבית: אני סמסטר 8 ועברתי רטובים של הפעלה וקומפילציה וכל שאר הרטובים המייאשים ואלו היו הכי הזויים שעברו עלי בתואר למרות שאני חוזר על הקורס ויש לי כבר רטובים מוכנים מלפני שני סמסטרים!\n\nהמבחן: ניגשתי לשפר ציון סופי של 76, השקעתי בקורס ובחומר ובלמידה למבחן, לבסוף קיבלתי 60 במועד א שזה 75 סופי! לא איגש למועד ב כי קיבלתי חרדות.\nהיה לא הוגן וארוך מאוד ועם שאלת הוכחות של 28 נק.\n\nהשורה התחתונה: לא ממליץ בכללללל!", "timestamp": 1716377603494}, {"author": "המרפרנס", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "אתם הרי יודעים שרוצים 'להוריד את הממוצע'.\nזה כל המטרה של המוסד בפקולטה שלנו.\nואתם יודעים שעבור זה עושים דברים מגעילים.\nאז עכשיו הגישה הזאת זולגת לקורסי התמחות ולא רק בקורסי חובה.\n\nהחומר עצמו קל, אבל מנסים לייאש, להתקטנן, לתת הנחיות לא ברורות, לשנות דברים בשניה האחרונה.\n\nבשיעורי בית שינו דברים להנחיות לא הגיונויות ופשוט שרפנו לנו זמן ואנרגיה על פארש (פשוט נסיון לייאש ולהתיש).\n\nהמבחן היה ארוך מידי ובלי הבונוס שהיו בסמסטרים קודמים.\n\nאיך אנחנו בתור סטודנטים מאפשרים לכזו התנהגות לא הוגנת ויחס ביזיוני כלפינו להמשיך באופן תעשייתי והכל בשביל 'הלשמור על ממוצע נמוך' ולשמור על \"ההילה\" של המוסד. איך נוכל לשנות את זה? להתאגד ולדרוש הגינות במקום שקיוונו שילמד אותנו דבר אחד או שניים. לרוב האנשים ברור שככה זה לא אמור להיות.\n\nאם לקחת או לא לקחת את הקורס זה כמו השאלה של אם ללמוד בטכניון או לא ללמוד בטכניון - אתה מקבל את מהות הלימודים בטכניון על כל השיט שזורקים עליך כאן.", "timestamp": 1716402638330}, {"author": "MCTS", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nהוא מנסה לעניין את הסטודנטים ולהציג כל נושא בצורה מעניינת עם הקדמה וממש לבנות את כל הסיפור תוך כדי דיונים בכיתה. לפעמים כל הדיונים והסיפורים נחמדים ולפעמים סתם מבלבלים.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: היה ברמה טובה, הקלטות עדכניות מהסמסטר שלנו.\n\nשעורי הבית: \nהיום בשעה טובה סיימתי להגיש סוף סוף את חלק 2 של תרגיל בית 3 שנדחה לאחרי מועדי א של הסמסטר ואז החלטתי לאור המאורע המרגש הזה לפרסם חוות דעת. \nבואו נגיד שמי שכתב את תרגיל 1 ו3 כנראה בחיים לא כתב תרגיל בית לפני כן וכנראה שאף בן אדם שיודע איך לכתוב תרגיל בית כמו שצריך לא עשה ביקורת על הזוועה הזאת.\nומי שהחליט בתרגיל בית 3 להפוך את הפונקציות שבסמסטר שעבר היו בונוס 5 נקודות לפונקציות חובה הוא פשוט בן אדם לא סבבה.\n\nהמבחן: \nבשנים האחרונות בקורס הזה המבחן הוא מתוך 104-107 נקודות. זה הסטטוס קוו. \nהסמסטר הסגל החליט לחרוג ממנהגו ולעשות את המבחן מתוך 100 נקודות. האם זה חוקי? - ברור. \nהאם נחמד פתאום לעשות את זה בסמסטר מלחמה ובלי להודיע מראש או לפרסם דף שער? - לא. \nמעבר לזה המבחן היה ארוך מידי והכיל לא מעט חישובים שלקחו זמן והסיבה היחידה שהממוצע בו לא היה פח היא כנראה שלחצי מהסטודנטים בפקולטה יש הסמסטר הארכת זמן ועוד כל מיני הקלות.\n\nהשורה התחתונה: \nלא לקחת. \nלא העלה לי את הממוצע.\nלא שווה את הסבל, את בזבוז הזמן או את העצבים.\nלא שווה את התחושה המחורבנת שאתה בסמסטר מלחמה ולמרות זאת מעמיסים עליך ומקשים עליך עוד במבחן.", "timestamp": 1716506223143}, {"author": "בינה מזוייפת", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: \nמורגש שהוא מנסה באמת להשקיע ולהפוך את השיעור למעניין וזה מאוד מוערך לדעתי, אבל אז כשניגשים למבחן ועוברים על המצגות רואים שחצי מהקורס זה כל מיני סיפורים והקדמות. \n\nשעורי הבית: \n3 הגשות לא כאלה עמוסות, לא רלוונטיות למבחן ובחלק הרטוב הם לא מפרסמים את הטסטים אז אי אפשר לדעת על מה נכשלת בכלל.\n\nהמבחן: \n****אוקי זה החלק החשוב****:\nהמבחן לא ״קשה״ או ״מתוחכם״ ומי שאומר לכם את זה פשוט לא העביר נכון את המסר, **המבחן פשוט מלא בטעויות של מי שכתב אותו!!!**. לדוגמא שאלה אמריקאית אמיתית מתוך המבחן:\n״סמן את המשפט *הנכון ביותר* מבין המשפטים הבאים: ״\nוהתשובה כמובן: ״כל התשובות נכונות״.\nנחמד לבזבז על זה ככה איזה רבע שעה ובאמת ככה נראות רוב השאלות.\nאם הם באמת היו בוחנים על החומר כולם היו מקבלים 100 כי זה סתם הכל וריאציות של BFS וdijkstra.\n\nהשורה התחתונה: \nהקורס לא באמת מלמד בינה מלאכותית, בפועל זה קורס באלגוריתמי משחק. זה הקורס היחיד הסמסטר שאני מתחרט מכל הלב שבחרתי. מידת ההשקעה לא תואמת את הציון וזה באמת קורס מעפן.", "timestamp": 1716572648587}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "** דעה דיי שונה מכל ההשמצות פה מהסמסטר **\nשם המרצה: פרופ' אורן זלצמן\nחוות דעת - הרצאות:\nאני חייב להודות שההרצאות היו דיי מתסכלות. בד\"כ היו כמה סטודנטים שחשבו שזה שיעור פרטי והתפרצו כל הזמן כדי להשתתף. אורן מנסה לתת הרבה אינטואיציה עד שתשכחו מה הנושא בכלל של ההרצאה. חוסר הקו הברור תסתכל אותי כל הרצאה מחדש. תבואו כדי לקבל התרשמות והבנה כללית וזה מספיק.\n3 ההרצאות האחרונות יהיו קלים מאוד למי שעושה לומדות.\n\nשם המתרגל/ת: בידוסה (התותח)\nחוות דעת - תרגולים:\nהאמת שכל הסמסטר הרגשתי דיי מבולבל מהקורס הזה, יש פרטים טכניים שצריך להבין , בייחוד הנושא של MDP שהוא שלושה תרגולים. אבל אין ספק שגם בתוך זה שמים לב שבידוסה מתרגל ממש טוב, הוא מדבר לאט ונותן למוח זמן לעכל דברים, נותן מקום לשאלות והוא בקיא בחומר. ממליץ מאוד עליו.\n3 התרגולים האחרונים יהיו קלים מאוד למי שעושה לומדות.\n\nשעורי הבית:\nאוקיי פה אני מתחיל ממש לחלוק על אנשים.\nבתור סטודנטים שרוצים לקחת את הקורס, כנראה שכבר עשיתם סמסטר או שניים בטכניון, ואתם יודעים מה זה תרגילי בית רטובים.\nברוכים הבאים לעולם בלי דליפות זיכרון כי העבודות בפייתון.\nנכון , היו *הרבה* שינויים בתרגילי בית וזה היה מתיש. נכון, בתרגיל אחד היו להרבה בעיות בציון עד כדי שהריצו לכולם שוב. אבל אני לא חושב שזה מצדיק את ההשחרות על הקורס הזה כי התרגילי בית לא כאלו נוראיים (מממשים אלגוריתמים שיש לכם את הפסאודו קוד שלהם בתרגול) וזה לא שהתיקונים גורמים לכם לשנות את כל העבודה. פשוט stay tuned.\nיש גם יבשים והם בסה\"כ באמת בסדר.\n\nבקיצור- תקחו אתכם שותף אחראי שאפשר לסמוך עליו כדי שלא יהיו עדכונים שפספסתם. זה חשוב.\nהשב לא מדגדגים בכלל את הרמת קושי של הפעלה וגם לא של מתמ לדעתי. אז אתם תהיו בסדר.\n\nהמבחן:\n55% מהציון הסופי, והם בסה\"כ חוזרים על הרעיונות, למרות שהסמסטר הוא היה יותר ארוך ותיאורטי מבדרך כלל.\nאני הרגשתי מאוד מבולבל בחלק מהנושאים לכל אורך הסמסטר אפילו שעשיתי את התב, אבל אם יש לכם 6 ימים להתכונן אתם תספיקו לתפור את התרגולים ולעשות מבחנים ולהיות מוכנים.\n(אין טעם לעבור על ההרצאות חוץ מנושאים ספציפיים).\n\nהשורה התחתונה:\nההרצאות לא העיקר, מתרגלים טובים, שיעורי בית מציקים אבל עם ממוצעים של 96 (תרגיל 3 התפצל לשניים 44,56 נק לכן הממוצעים האלו).\nלפי המשקל הגבוה של תרגילי הבית, מספיק 85 במבחן אחרי פקטור ועברתם את 90", "timestamp": 1716625635468}, {"author": "מני מקס", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "הטוב: אורן מרצה נדיר, בידוסה ואופר מתרגלים נהדרים והחומר מעניין. אם אהבתם אלגו (את החומר, לא ההוכחות) אתם תתחברו.\nהרע: בגדול כל השאר. מה שכתבו לפניי נכון ואישית היה לי הכי כואב ההתנהלות הלא רצינית על גבול המזלזלת בתרגילי הבית.\nנתתי 5 בעומס כי ככה היה הסמסטר, בפועל איפשהו באזור 3.\nממליץ להתרחק בינתיים ולתת לקורס להתאפס על עצמו אחרי הביזיון שהיה הסמסטר.", "timestamp": 1716799610803}, {"author": "---", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שלושה תרגילים רטובים עם יבש. העומס של הרטובים הרגיש לי בערך כמו מת\"ם. יש עניין שלפעמים הם לא ברורים על כול מיני פרטים וצריך ממש להתעסק עם זה כי זה לפעמים משנה די הרבה. יש גם דברים מוזרים, למשל בתרגיל השני, הם ציפו שנשבה את המסוגלות של ה\"AI\" שבנינו דרך זה שנשלח את הקוד שלנו לסטדנטים אחרים ונראה שאנחנו לא מפסידים יותר מדי, אבל זה נראה לי דרך לא מסודרת בכלל לבדוק אם הקוד שלנו הוא טוב מספיק נגד הטסטים של הסגל. אבל בסופו של דבר, צריך ליישם את הפסאודוקוד של אלגוריתמים שאתה רואה בכיתה. בדרך כלל זה לא רק להעתיק משקופית, זה קשה יותר, בעיקר בגלל הסיפורים שיש להם סביב שיעורי הבית.\n\nהמבחן: אפשר ליפול על דברים מטופשים, אבל בהשוואה לקורסים אחרים, לא מבחן קשה מדי. יש חלק שהוא כמו החלק האמריקאי של אלגו והשאר די סטנדרטי. לפעמים אבל יש שאלות הוכחה די קשות \n\nהשורה התחתונה: לא היה כול כך מעניין, יותר הרגיש כמו קורס על אסטרטגיות משחק.", "timestamp": 1717581573940}, {"author": "nobody", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: לא הלכתי, המוקלטות היו סבירות\n\nשם המתרגל/ת: אור/אופק/ספיר\nחוות דעת - תרגולים: ראיתי את המוקלטים שפרסמו הסמסטר, שלושתם היו טובים, בדגש על אור. לקח את הזמן להסביר אינטואיציה ושאל שאלות מנחות, שממש עזרו לי להבין את הנושאים.\n\nשעורי הבית: \nכולם כבר לכלכו על הבעיות של הסמסטר, אז אסכם כל תרגיל במשפט:\nהראשון היה מנוהל בצורה לא טובה עם כמה סעיפים ארוכים מהרגיל.\nהשני היה ממש בסדר ומענה טוב בפיאציה(כל הכבוד אופק!).\nהשלישי פוצל לשני חלקים (אחד מהם היה בתקופת מבחנים), לדעתי מזעזע מבחינה ניהולית והסעיפים שנוספו היו לא מוגדרים ומעצבנים במיוחד.\nאציין שכל שלושת התרגילים לא היו עמוסים במיוחד, גם עם המענה הגרוע, התיקונים הרבים לתרגיל הראשון והשלישי והטעם הרע שזה השאיר בתקופת המבחנים. בסמסטר רגיל כנראה שהתרגילים חמודים למדיי ולא לוקחים יותר מכמה ימים רגועים.\n\nהמבחן(מועד א): \nהמבחן ארוך מאוד. הייתה לי הארכת זמן ובקושי סיימתי. מרגיש שהיו יותר סעיפים נישאתיים מהרגיל, ויחסית הרבה סעיפי הוכחה. יכול להיות שאלו נוספו בגלל שירד למידה ו RL מהחומר אז הם חיפשו בקרקעית השקפים האבודים כדי למצוא את שאלה 2. היו עוד קצת קטעים מלוכלכים אצלנו (ראו ביקורות קודמות) אבל בממוצע ממבחני העבר, נראה שזה לא מבחן סופר קשה. \n\nהשורה התחתונה: \nאני חושב שהסגל לא ניהל את הקורס בצורה מקצועית, אבל הקורס עצמו חמוד מבחינת חומר. הביקורת הזו (ואולי גם הקודמות לה) מכילות bias לניהול הגרוע של הסמסטר, אז לקחת בעירבון מוגבל את מה שנאמר.\nנ.ב. הסגל מתחלף, לדעתי שווה לקחת עכשיו שיש מתרגל אחראי אחר.", "timestamp": 1717964044771}, {"author": "ferberonix", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אורן זלצמן\nחוות דעת - הרצאות: בהתחלה חשבתי שהן חשובות אבל אורן הופך אותן לשיחות פרטיות עם סטודנטים מסויימים וכתוצאה לא ממש לומדים בהן. כפי שאורן אמר: \"הסיבה היחידה שלכם לבוא להרצאות היא כדי שנוכל לבצע אינטרקציה\".\nמסקנה: לכו להרצאות אם אתם אוהבים לפטפט על החומר.\n\nשם המתרגל/ת: ספיר + בידוסה + אופק\nחוות דעת - תרגולים: \nספיר היה מושלם כמתרגל מבחינתי. תרגוליו היו ברורים, מהנים ומלמדים. בידוסה הראה הבנה רבה ב- MDPs ואהבה לנושא וכתוצאה העביר את החומר הכי מבלבל בקורס בצורה מובנת (עד כדי aliasing למלא מושגים).\nלא אהבתי ממש את התרגולים של אופק שכן עשתה מאמץ להסביר ולא לקרוא הרבה מהשקופיות אבל ניכר היה שהיא התקשתה במעט בהסבריה.\n\nשעורי הבית: בניגוד לדעת חבריי אציין שהסמסטר תרגיל בית 1 היה הביזיון היחידי. כל סטודנט וסטודנט פתר אותו בממוצע 5 פעמים כי הניסוחים היו של צפרדע על ערש דווי שמנסחת שיר פרידה. תרגיל בית 2 היה מנוסח כראוי והוגן מאוד (ישר כוח לאופק על כך). תרגיל בית 3 פוצל ל- 2 חלקים עקב העיכוב של תרגיל בית 1 שכל הקורס הגיש אותו 3 שבועות מאוחר יותר. את החלק הראשון וההוגן הגשנו לפני מועדי א' ואת החלק השני בין מועדי א' ל- ב'. שמעתי שהחלקים הרטובים היו הבעייתיים בתרגיל הזה אבל לא עסקתי בהן אלא התמקדתי ביבשים שהיו הגונים מאוד.\n\nהמבחן: (מדובר רק על מועד א') הסמסטר פעם ראשונה שהמבחן לא יה מתוך 105-104 נקודות אלא מתוך 100. בנוסף הוא היה ארוך מהרגיל ועם המון הוכחות (לא כבדות מידי) שדרשו הבנה מלאה של אלגוריתמים. לדעתי חשוב שיהיו שאלות כאלו אבל הבעיה הייתה שהסגל הכניס 5 סעיפי הוכחות למבחן כאשר בסמסטר שעבר היו 2. לעניות דעתי המבחן היה יותר הוגן מהמועדי זוועה שהיו בסמסטר הקודם. אציין גם שלאחר ערעורים הסגל נאלץ לפסול 4 נקודות במבחן (כי אף תשובה לא הייתה נכונה) ולכן זה כאילו המבחן היה מתוך 104 נקודות (לא באמת כי הפסילה הייתה אחרי המבחן שלמעשה היה אפשר לצבור בו עד 96 נקודות ולא 100 ולכן זה לא שקול למבחן עם 104 נקודות).\n\nתלמדו טוב למבחן- 5 ימים מספיקים, ותוציאו ציון אחלה.\n\nהשורה התחתונה: אהבתי מאוד את הקורס על ההרגשה \"שדפקו\" אותנו הסטודנטים הן במבחן והן בשיעורי הבית. ממליץ מאוד למי שאוהב אלגוריתמים.", "timestamp": 1718199817789}]}