{"posts": [{"author": "alon borin", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ראובן כהן\nחוות דעת - הרצאות: בסדר גמור. ראובן מרצה טוב אבל לפעמים מרגיש לי שהוא כבר עייף.\n\nשם המתרגל/ת: דור האריס\nחוות דעת - תרגולים: מתרגל אחלה. התרגולים היו משמעותית יותר קצרים כמעט תמיד - עד 40 דקות בדרך כלל. מסביר הכל לעניין וברור.\n\nשעורי הבית: היו 5 גליונות, עם שילוב בין יבש לרטוב. הרטובים לא קשים במיוחד, רוב ההתעסקות הייתה להתרגל לעבוד עם הכלים שמלמדים בתרגיל. היבשים היו קלים מאוד, פשוט לעבור על ההרצאה/תרגול המתאימים ולפעמים לקרוא עוד כמה קטעים שנותנים.\n\nהמבחן: לא קל, אבל אפשר לומר שהוגן. ראובן אוהב לתת במבחן חלקי קריאה מתוך הגדרות הרשמיות של הפרוטוקול ולשאול על זה שאלות. מרגיש לפעמים כמו מבחן בהבנת הנקרא באנגלית.\n\nהשורה התחתונה: קורס לא עמוס ולא קשה מדי, אבל גם לא מאוד מעניין. אולי יהיה יותר מעניין אם אתם רוצים להכנס לתחום.", "timestamp": 1625767675257}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: \nההרצאות ברובן מעניינות. ראובן גם נותן בונוס של חצי נקודה על כל פעם שמגיעים להרצאה, אז שווה להגיע\n\nהתרגולים והשיעורי בית די משעממים. בשיעורי בית הרבה פעמים צריך לקרוא חלקים ממסמכי RFC (מסמכים שמתארים את הפרוטוקולים לעומק), ויש גם חלקים \"רטובים\" (פחות לכתוב קוד, עובדים עם סוג של רשתות וירטואליות כאלה שמכינים לכם מראש, אבל זה מאוד מוכוון וסה\"כ די קל). סה\"כ הקורס לא דורש הרבה השקעה, כן צריך ללמוד טוב למבחן.\n\nהמבחן: קשה, אבל הממוצע יחסית גבוה\n\nהשורה התחתונה: קורס נחמד למי שמתעניין בתחום", "timestamp": 1625822807410}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: משמימות. ראובן לא הכי כריזמטי, ואותי החומר פשוט לא כל כך עניין. בניגוד למבוא לרשתות/ רשתות 1 הקורס לא ״פוקח עיניים״ אלא פשוט מתעמק יותר בפרטים קטנים וטכניים של דברים שהיו בקורס הקודם. הנושא המרכזי שהוא חדש לגמרי, פרוטוקול QUIC (שלהבנתי התחיל להכנס בסמסטרים האחרונים גם למבוא לרשתות) לא מוצג באופן מעניין במיוחד. \nהקורס מוצג משום מה בכל מיני רשימות כקורס באבטחת מידע, ולמרות שיש כמה שקפים על שיקולי אבטחה, כל החומר מופיע בהגנה ברשתות והדיון בקורס בנושאי אבטחה שטחי לחלוטין. יכול מאוד להיות שההיכרות היותר מעמיקה עם חלק מהטכנולוגיות שהוצגו בכלליות במבוא לרשתות מועיל בעיסוק באבטחת מידע, אבל הקורס לא נותן תחושה שזה המיקוד שלו.\nיש בונוס נוכחות של חצי נקודה לכל הרצאה, אבל קחו בחשבון שלעיתים קרובות הרצאות מתבטלות ומשלימים ממוקלט, ככה שלא באמת תקבלו 7 נקודות בונוס.\n\nשם המתרגל/ת: ערן תבור\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: חמישה תרגילי בית, ארבעה ״יבשים״ ארוכים, שבכל אחד שאלה כבדה שדורשת להריץ ניסויים על מכונה וירטואלית. תרגיל אחד רטוב שכותבים בו מאפס load balancer, שזה דווקא היה מגניב.\n\nהמבחן: המבחן כתוב באופן עמום ולא מוגדר היטב. הבדיקה של מועד א הייתה בלי הערות, ולפעמים הייתה תחושה שירדו נקודות באופן שרירותי. הרבה שאלות שצריך לנחש מה הסגל התכוון, וגם לשאול את המרצה או המתרגל זה לא ערובה לכך שתגלו את הפרשנות לפיה תיבדק השאלה.\nלהגנת הסגל יאמר שמפקטרים בנדיבות כדי לתקן את הבעיות האלה, אבל זה עדיין משאיר טעם רע.\n\nהשורה התחתונה: לא מומלץ. יש דברים יפים בקורס, אבל הסגל לא מדהים והעומס גבוה ממה שנדמה.", "timestamp": 1690284261376}, {"author": "המתקשר", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ראובן כהן\nחוות דעת - הרצאות: \nההרצאות מעניינות, ענייניות. יש שאלוני קהוט לא ברורים אבל לפחות מעוררים קצת ונותנים מקום לבחון את עצמך.\n\nבסמסטר לא היתה חובת נוכחות, אך ההרצאות והתרגולים לא הוקלטו,  והיה בונוס נוכחות למי שהגיע פיזית.\n\nשם המתרגל/ת: ערן תבור\nחוות דעת - תרגולים: \nמעולים, ענייניים, נכנסים לעומק של הדברים ובו בזמן מצליחים להסביר איך לפתור שאלות.\nשעורי הבית: \nלא קשים במיוחד, חלקם רטובים- שימוש בסימולציות ע\"י ספריית mininet.\nהמבחן: \nהמבחן היה הרבה יותר קשה ממבחנים קודמים, אבל ניתן פאקטור של Grade*1.1+4.\nהשורה התחתונה: \nבניגוד לקורס הקדם,  בקורס הזה ההרצאות הרבה יותר ת'כלסיות ומלמדות תהליכים יותר מאשר חישובים מעצבנים של הסתברות או אלגוריתמיקה ( יש תרגול אחד בלבד שהוא ממש אלגוריתמי). מלמדים גם נושאים יחסית עדכניים (צוטטו RFCs מ2018, ואף יותר חדשים).\nקורס מעניין ממש, בייחוד למי שמתחבר לעולם של אינטרנט ותקשורת.", "timestamp": 1690361562141}, {"author": "חן", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: \nיש שקופיות ממש ענייניות אפשר להבין מהם את החומר אבל הייתי ממליצה כן להגיע להרצאות בשביל לשאול שאלות ולהבין את החומר יותר טוב\nשם המתרגל/ת: ערן\nחוות דעת - תרגולים: \nאלוף, גם ברשתות היה המתרגל שלי ותמיד עוזר ועונה על שאלות ואכפת לו מהסטונדטים.\nשעורי הבית: \nלא כל כך עוזרים להבין את החומר יותר כמו מעבדה ברשתות.\nהמבחן: המבחן ברמה המצופה, למרות ששיעורי הבית לא מכינים אותך לזה. הבעיה לדעתי במבחן שיש ציפייה לקלוע בול לפתרון הרשמי.\nהשורה התחתונה: אני ממש נהננתי מהקורס ומהחומר.", "timestamp": 1692010012683}, {"author": "--", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ראובן\nחוות דעת - הרצאות: הלכתי כי היה בונוס על נוכחות, אם לא היה בונוס אז לפחות 8-9 ההרצאות הראשונות שכן היו בחומר של שנים קודמות לא הייתי הולך להן. ראובן לא שומר על קשר עין עם הסטודנטים (או לפחות אני הרגשתי כך) אז היה קל לפעמים לאבד אותו.\n\nשם המתרגל/ת: מוקלט שביוטיוב של סהר\nחוות דעת - תרגולים: תרגולים מעולים. \n\nשעורי הבית: יבשים חוץ מתרגיל רטוב אחד שלא לוקח זמן, היבשים ארוכים ומשעממים מאוד.\n\nהשורה התחתונה: בדיעבד לא הייתי לוקח את הקורס.", "timestamp": 1695061158424}]}