{"posts": [{"author": "TS", "semester": "201901", "text": "הקורס היחיד שבו לא להבין את כל מה שאומרים בשיעור גם בניסיון השני-שלישי זה בסדר. הקורס מאוד קשה מבחינה תיאורתית ומכיוון שאין מבחן גם לא מצפים מהסטודנטים להיות 100% על החומר.\nרוב הדברים מסתדרים בראש הרבה יותר טוב אחרי שעוברים על התרגולים (המצויינים!) כמה פעמים, ושיעורי הבית גורמים לך להיכנס מספיק לבפנים כדי להשלים את כל החורים.\nציונים כמו שאפשר לראות למעלה זו לא הבעיה שלך. אם השקעת בשיעורי הבית (כלומר, הצלחת לסיים אותם וענית על השאלות הפתוחות בצורה סבירה), והגשת את הפרוייקט במלואו (אין סיבה שלא, הוא מאוד מלמד ולדעתי גם בכלל כיף), תקבל אחלה ציון.", "timestamp": 1591124846000}, {"author": "nader karayanni", "difficultyRank": 5, "generalRank": 4, "semester": "201902", "text": "שם המרצה: ( alex ( video\nחוות דעת - הרצאות: \ntoppp\nשם המתרגל/ת: video \nחוות דעת - תרגולים: \nalso topppp\nשעורי הבית: \nhard veryhard\nהמבחן: \nthere is none\nהשורה התחתונה: very nice", "timestamp": 1597902651915}, {"author": "Alon", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "הקורס מתנהל בשיטת \"כיתה הפוכה\" שרואים את הוידאו לבד ואפשר לבוא לשיעור לשאול שאלות. בתרגולים היה אפשר לשאול שאלות על התרגולים, בהרצאות בגלל שהיו מעט שאלות הועברו נושאי העשרה נוספים.\nחשוב: הקורס הוא הרבה יותר \"למידה עמוקה\" (DL) מאשר \"מאיצים חישוביים\" (GPU).\n\nשם המרצה: חיים בסקין\nחוות דעת - הרצאות:\nבפועל רואים את הוידאו של אלכס ברונשטיין שהוא נחמד מאד. אפשר גם לראות כל וידאו אחר (למשל MIT) ואפשר גם לא לראות כלום כי אין מבחן, ופשוט ללמוד \"מה שצריך\" בכל ת\"ב. לדעתי ההרצאות של אלכס ממש אחלה, ופעם בשתי הרצאות הוא נכנס לחישובים ממש ממש ממש מסובכים + מתמטיים + אלגבריים + הסתברותיים שלא באמת צריך להבין עד הסוף, אז אפשר פשוט לנסות רק להבין את העיקרון וזה אמור להספיק לת\"ב בדר\"כ.\n\nשם המתרגל/ת: אביב רונזברג\nחוות דעת - תרגולים: \nהמחברות של התרגולים ממש אחלה, ואפשר גם לראות את הוידאו של אביב שהוא גם מצויין.\n\nשעורי הבית: יש 4 ת\"ב שהם עמוסים, הכל מחברות בפייתון ב־pytorch, הרבה מאד דברים יחסית עדכניים ומעניינים מאד. כל תרגיל לוקח כמה ימי עבודה מלאים.\nהפרויקט הסופי: יש הרבה אפשרויות בחירה, וצריך לכתוב מאמר המסכם את מה שעשיתם בפרוייקט. העבודה עצמה היא אחד מהבאים: א) לקחת מאמר עם מימוש ולנסות לשפר אותו עם איזה טריק או פי'צר. ב) לקחת מאמר בלי מימוש ולכתוב מימוש. ג) לקחת שני מאמרים ולשלב/לחבר אותם. ד) אחר.\nאת הפרויקט עושים אחרים שמסתיים הסמסטר ואין יותר מידי לחץ להגיש אותו, וגם אין המון הכוונה (זה כבר ממש תלוי מי המנחה של הפרוייקט שלכם מבין סגל הקורס).\n\nהשורה התחתונה: \nהקורס ממש מעניין וממש מלמד ונותן קפיצה אל מעמקי התחום. לומדים הרבה תתי־נושאים בתחום ומקבלים הבנה טובה על התחום. לדעת איך מכפילים מטריצות וגוזרים אותן וקצת פייתון ואלגוריתמים נומריים יכול מאד לעזור, ומעבר לזה לא צריך הרבה ידע קודם לדעתי. הממוצעים בסוף ממש גבוהים.", "timestamp": 1598001426533}, {"author": "Aviv Shrem", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "קורס מעניין, תרגילי בית בנויים מצויין וציונים גבוהים יחסית. הגשות עמוסות מאוד ודורשות השקעה.", "timestamp": 1598600137601}, {"author": "kilek", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מעולים. שב באמת עוזרים להבין את החומר.\n\nהמבחן: \n\nהשורה התחתונה: קורס מומלץ מאוד למי שאוהב את התחום.", "timestamp": 1615653902745}, {"author": "SR", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אלכס ברונשטיין / אבי מנדלסון\nחוות דעת - הרצאות: ההרצאות יחסית קשות להבנה, הרבה חומר תאורטי והמון מתמטיקה. המרצים אחלה.\n\nשם המתרגל/ת: אביב רוזנברג\nחוות דעת - תרגולים: אחלה מתרגל, בזמן סמסטר קורונה נתן אקסטרה זמן לכל תרגול כדי להספיק לעבור על כל החומר כמו שצריך.\n\nשעורי הבית: עמוסים מאוד. הרבה פעמים קשה להבין את כל החומר רק מההרצאות ומהתרגולים, ואת הפערים האלו משלימים במהלך שיעורי הבית שבאמת מאוד מלמדים. חשוב לתכנן את הזמן שלכם ורצוי להתחיל כמה שיותר מוקדם.\n\nהמבחן: היתרון הכי גדול של הקורס הוא שאין מבחן. הציון הוא רק על סמך תרגילי בית. בסמסטר שלנו היו 4 תרגילי בית, כאשר הרביעי מביניהם כלל מיני פרויקט והיה ניתן להגיש אותו גם אחרי תקופת המבחנים.\n\nהשורה התחתונה: סה\"כ קורס מעולה, אבל חשוב לדעת שהוא דורש המון השקעה.", "timestamp": 1619351234691}, {"author": "236781", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "הקורס העמוס ביותר שלמדתי בתואר, לדעתי לא שווה לקחת אותו בפרט אם יש לכם קורסים רטובים אחרים בסמסטר", "timestamp": 1626422427295}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "אביא את דעתי האישית בנוגע לקורס הנ״ל שאולי הולכת לאכזב כמה ממכם, אבל לדעתי כדאי שתאמר כי הדעות פה משום מה טובות.\nבחרתי ללמוד את הקורס הזה אחרי שסמסטר לפניו למדתי בינה מלאכותית ומאד התעניינתי ואהבתי את התחום של הלמידה.\nאחרי שעשיתי את הקורס הנ״ל, אני יכול להגיד באופן חד משמעי שזה הקורס הכי מגעיל שעשיתי (וכנראה אעשה) בכל התואר ושכל המוטיבציה והרצון ללמוד את התחום של למידה עמוקה כבר לא קיים אצלי בכלל.\nמלבד שהקורס הזה מאד מאד משעמם ועמוס, ההרגשה היא שכל המטרה שלו היא לשאוב לך את הזמן.\nהקורס יוצא מנקודת הנחה שאתה יודע למידה עמוקה בצורה מעולה ובעצם רק מבצע חזרה על החומר- ככה שלגמרי לא ברור מה לומדים.\nמדובר על 3 גיליונות בית ארוכים ביותר במהלך הסמסטר (חלקים רטובים ויבשים ארוכים בטירוף) ועוד אחד סופר ארוך ומוגזם בתקופת מבחנים (שכולל מלבד חלק רטוב ארוך מאד, פרק של 30 שאלות יבשות מיותרות- גם פרויקט מוגזם).\nכמעט בכל תרגילי הבית אתם תבזבזו כמה ימים טובים מהחיים שלכם לבחור מספרים (עשרוניים) להמון פרמטרים כאשר הסיכוי שלכם לפגוע במספרים הנכונים הוא 0 (כדי לדעת אם צדקתם תצטרכו להריץ מודל שבניתם והרצת מודל כזה עלולה לקחת גם כמה עשרות דקות). אין בפעולה הזאת שום חכמה, נטו להציק ולהעיק עליכם, אבל היא חלק מהותי מהשיעורי בית בקורס.\nהקורס עצמו מועבר באנגלית וחבל שכך- כי לא כל חברי הסגל יודעים לדבר אנגלית ברמה מספיק טובה כדי להעביר את החומר, אבל היי! העיקר להיות fancy.\nלא הפקתי מהקורס הזה כלום ושום דבר, סתם עצבים ועומס מיותרים ואני לגמרי מתחרט על כל שנייה.\nמי שאוהב לבזבז את הזמן שלו- זה הקורס עבורכם!", "timestamp": 1628240981208}, {"author": "יוסי", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "קורס פשוט מזעזע, אין מילים לתאר. א-ל ת-ק-ח-ו!", "timestamp": 1628703831405}, {"author": "Gur Telem", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nדי משעממות. מאוד כבדוד מתמטית. מאוד מומלץ לעבוד על חדוו\"א בעיקר על גרדיאנטים ונגזרות של מטריצות.\nעוברים על המתמטיקה מאוד מהר ויש תחושה של אובדן ריכוז בגלל שאין זמן להבין את הכל. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nטכניים בעיקר ובעיניי המקור הטוב יותר כדי להבין את החומר.\n\nשעורי הבית: \nכבדים וארוכים אבל הם 100% מהציון.\n\nהמבחן: \nאין.\n\nהשורה התחתונה: \nקצת מתחרט שלקחתי אותו בלי שיש לי את הידע המקדים המתאים (כי לא היה בקדמים). אומנם קיבלתי ציון טוב אבל כל הקרדיט לשותף שאני מרגיש שדפקתי אותו.", "timestamp": 1642351239901}, {"author": "ע", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: ההרצאות באנגלי למרות שחיים לא דובר אנגלית טוב במיוחד, קשה מאוד להבין את ההרצאות והחומר שם לא ממש דרוש למטלות. אני הפסקתי להגיע אחרי שני הרצאות ולא היה חסר לי ממש\n\nשם המתרגל/ת: אביב\nחוות דעת - תרגולים: תרגולים טובים מאוד, מעבירים את החומר טוב ועוזרים לתרגילי בית(למרות שתכלס גם בלעדיהם אפשר לפתור את התרגילים עם קצת מאמץ)\n\nשעורי הבית: ארבע תרגילים די ארוכים (למרות לא הייתי אומר שהם הכי עמוסים שהיו לי), טיפה עמוס אבל בהתחשב בזה שזה במקום מבחן הייתי אומר שזה פחות עמוס מקורס רגיל, מה שכן הסגל ממש קשה בכל מה שנוגע לפידבק על התרגילים, לא מקבלים פידבק מסודר וקשה מאוד לערער.\n\nהמבחן: אין, הציון מבוסס על השיעורי וזה מתבטא בציונים גבוהים מאוד יחסית\n\nהשורה התחתונה: ממליץ בחום, אחלה קורס כדי להיכנס לתחום של למידה עמוקה וגם אחלה ציון", "timestamp": 1649943518070}, {"author": "student", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "מדבר כמישהו עם ניסיון קודם בדיפ בעבודה ובפרוייקטים אישיים. ראיתי את כל הביקורות הקודמות על כמה הקורס עמוס וכדאי לברוח, אבל חשבתי שיש לי מספיק רקע ובסוף הציונים גבוהים אז הקורס שווה את זה.\nטעיתי.\nממש טעיתי.\n\nבתחילת הסמסטר חיים הודיע שהם מתכננים להוריד את הממוצע, ואין ספק שמאז הרגשנו מאמץ מרוכז מצד הסגל לאמלל אותנו. \n\n-הרטובים מסמסטר קודם היו כבר מפלצתיים, אבל הסמסטר הם **הכפילו** את כמות המשימות בכל רטוב. מדובר על מימוש מאפס של כל דבר קטן באלגוריתמי ML ורשתות - מכל חישובי הנגזרות של כל שכבה ועד הרצה ואימון של מודלים גדולים על דאטהסט אמיתי. *הכל, מאפס*\nאין ספק שזאת הולכת להיות משאבת הזמן הכי גדולה שנתקלתם בה בתואר.\n\n-שבועיים לפני ההגשה של רטוב 2 הם הכריזו שחלק גדול מהציון בו יהיה תחרותי, וימדד ביחס לסטודנטים אחרים.\nכמובן שהעומס על השרתים היה גדול מדי והרבה אנשים קיבלו ציון נמוך רק כי לא הייתה להם את אותה כמות ניסיונות לאמן את הרשת שלהם בשרת.\n\n-סמסטר קודם ה\"פרויקט\" היה פשוט גיליון 4, שהיה עמוס אבל היה דומה בהרכבו לרטובים הקודמים. הסמסטר הם פשוט זרקו לנו את אחד הפרויקטים שמועברים אצלהם במעבדה כפרויקט שצריך לבנות בעצמנו בקיץ מאפס. פרויקט שאמור לדרוש לפחות סמסטר, עם הנחיה צמודה מועבר לנו בתור מטלת קיץ. מדובר על נושא מחקרי שאפילו לא נלמד בקורס(ולא נלמד באף קורס בטכניון לצורך העניין), שעליו צריך לכתוב *מאמר* ו50% מהציון עליו יהיה *תחרותי*.\n\n\nמילה על ההרצאות:\nדיי יבשות - בד\"כ יש הרבה דגש על כל הפיתוחים המתמטיים אבל מעט מדי דגש על התמונה הכוללת. הקורס מועבר בכיתה הפוכה, לכן ההקלטות נמצאות באופן זמין ביוטיוב. אל תרשמו לקורס, פשוט תראו אותן בעצמכם ותחסכו את הסבל. אין פה הרבה חומר, הרבה הרצאות הן \"מבוא ל-\" נושא שיש עליו קורס שלם בפקולטות אחרות(אופטימיזציה, למידה מחיזוקים, unsupervised), ולראות עליו הרצאה אחת לא יתרום לכם הרבה חוץ מתירוץ לסגל להכניס אותו לרטובים.\n\nהשורה התחתונה: \nהקורס הכי גרוע שראיתי בטכניון, או בכל אונ', וזה חבל כי זה הנושא הכי חם ומעניין.\nהייתי במקביל צופה חופשי בקורס של למידה עמוקה בחשמל ואין מה להשוות - ההוראה שם הרבה יותר טובה, הסגל הרבה יותר מוצלח, ההגשות הגיוניות וסבירות, הפרויקט בסוף הסמסטר הוא בנושא לבחירתך ובקנה מידה סביר לקורס.", "timestamp": 1657361773089}, {"author": "YOLO", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "הנושא של למידה עמוקה נהיה נושא חם ומבוקש -> נוצר הרבה ביקוש לקורס -> הוחלט להוריד את הממוצע ולא משנה באיזה מחיר.\n\nגם אם נשים בצד את זה שההרצאות מיושנות (בתחום שההתקדמות היא מאוד מהירה, איך לעזאזל אתם מעבירים קורס שלם בדיפ בלי לדבר על transformers??) ולא מעניינות. הסגל הוא אנטגוניסט מובהק לסטודנטים, ופשוט תקראו את הביקורת הקודמת, זה די מסכם את העניין.\n\nלא מומלץ. גם אם זה קורץ שאין מבחן.", "timestamp": 1657369285652}, {"author": "deep_in_deep", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "הכל נאמר לפני, אני אשאיר אתכם עם השורה התחתונה כי אם אתם כאן צפוי לכם סמסטר עמוס, חבל על הזמן שיתבזבז בקריאת עוד ביקורת\n\nהשורה התחתונה: \n\nתברחו כל עוד נפשכם בכם.\nכל עוד המשפחה שלכם יודעת לזהות אתכם, החברה עוד לא נפרדה מכם, הילדים עדיין אצלכם במשמורת ויש אוכל במקרר.\nכל מי שקורא את הביקורת הזו, עכשיו, תסתכלו על המסך, תסתכלו על המקלדת. עכשיו שוב על המסך, שוב על המקלדת, שוב עלי, תפתחו את הstudents ותבטלו הרשמה. פשוט ככה, תבטלו הרשמה.", "timestamp": 1660839101374}, {"author": "Parachute", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "הקורס הזה עורר בי במהלך הסמסטר רגשות מעורבים, אבל בסוף הסמסטר כבר נהיה ברור שהסגל של הקורס פשוט לא בסדר. זה הולך להיות ארוך אז אמ;לק נמצא בסוף.\n\nנתחיל ממהלך הסמסטר. ההרצאות המוקלטות מושקעות אבל קשות להבנה ומתמטיות. הבעיה בעיני היא שהרבה פעמים המרצה בא עם פיסות מתמטיות מורכבות יתר על המידה - שהסטודנט הממוצע שניגש לקורס פשוט לא מכיר - ומתנהל כאילו כל המעברים המתמטיים ברורים. חשוב לציין שהבנה מושלמת של החומר בהרצאות בכלל לא נחוצה בשביל השיעורים והפרויקט, אבל מי שבאמת רוצה להבין מה שנאמר בהרצאות לדעתי צריך לעשות הרבה מאמץ בכוחות עצמו. השורה התחתונה כאן היא שאני חושב שלא יזיק להעביר את החומר יותר בגובה העיניים, כי הרבה פעמים המעברים המתמטיים הם סתם עול טכני שלא מניב שום תועלת.\n\nהתרגולים כוללים מעבר מהיר על החומר בהרצאות ומעבר על מחברת שמממשת את החומר בpytorch. לדעתי התרגולים נחוצים כדי להבין איך החומר התיאורטי-מתמטי שהועבר בהרצאות מתורגם למשהו פרקטי.\n\nלגבי שיעורי הבית, מאוד מושקעים ועוזרים להבין את החומר תוך כדי שמלכלכים את הידיים בpytorch. מממשים הרבה דברים יחסית מהבסיס וגם זה עוזר להבין איך דברים עובדים. חלק קטן מהם דורש קצת חשיבה מתמטית אבל הרוב המוחלט הוא תכנותי. חשוב לציין שהם דורשים הרבה השקעה וזמן (מעבר למה שמצופה מקורס ממוצע של 3 נק\"ז) וזה כן צרם להרבה אנשים שלקחו את הקורס, אבל בדיעבד לדעתי זה הדבר הכי טוב בקורס הזה.\n\nעכשיו מגיעים לסוף הסמסטר, אחרי שלושה גיליונות לא פשוטים אנחנו מצפים לגיליון רביעי ואחרון שיתרגל את החומר של הסוף הסמסטר (שלא יצא לנו לתרגל), או פרויקט יחסית חופשי שאנחנו בוחרים את הנושא שלו (ככה זה התנהל בסמסטרים קודמים). אבל הנה קיבלנו פרויקט שנחשב 3 נק\"ז *בפני עצמו* באתר של הפקולטה, על נושא נישתי שבכלל לא למדנו. יותר מכך, הפרויקט בכלל לא על למידה עמוקה! הוא כולל בתוכו רשת מוכנה שמשתמשים בה בתור קופסה שחורה, אבל התפקיד שלנו היה להתעסק באופטימיזציה ולנסות לשפר ביצועים בצורה הכי סיזיפית שאפשר. הפרויקט מתבסס על מאמר שאחד המתרגלים פרסם עם המרצים של הקורס, אז אפשר בגדול לומר שהם השתמשו בנו, הסטודנטים, בתור שוליות שיבצעו הרבה ניסויים שישפרו את הביצועים שהם השיגו במאמר. אם לא השתכנעתם שזה המצב, אז אולי כדאי לומר ש-50 אחוזים (!) מהפרויקט הם על החלק התחרותי, ורק אחרי התחננות מתמשכת של הסטודנטים הסגל בחסד ורחמים הוריד ל-40 אחוזים. שאר האחוזים היו על דו\"ח במבנה של מאמר מדעי. כבר אמרתי שהפרויקט ניתן אחרי סוף הסמסטר, כדי שנעשה אותו במהלך הקיץ? ושהפרויקט ארוך ולקח לרוב הסטודנטים שבועיים של עבודה? ושהקוד שקיבלנו מהסגל בכלל לא היה מתועד?\n\nהשורה התחתונה: הקורס ברמה גבוהה, אבל במובן הלא טוב, במובן שהסגל המתנשא של הקורס לא מוכן להיות בגובה העיניים של הסטודנטים ולהבין שהם באו לקורס בלי ידע מוקדם על הנושא. הממוצע של הקורס היה גבוה עד כה אבל יש שמועות שמנסים להוריד אותו וזה נחת עלינו הסמסטר בצורה של הפרויקט הביזיוני הזה. אם לא הפרויקט הזה אולי הייתי ממליץ על הקורס, אבל חשוב לומר שהוא דורש מאמץ הרבה יותר מקורס 3 נק\"ז טיפוסי.", "timestamp": 1663836252945}, {"author": "האחיין הקטן של הדודה הגדולה", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: הקלטות של אלכס\nחוות דעת - הרצאות: סך הכל סבירות, פחות קשורות לתרגילי הבית ויותר לרקע התיאורטי של מה שעושים. אישית מאוד אהבתי.\n\nשם המתרגל/ת: הקלטות של אביב רוזנברג\nחוות דעת - תרגולים: מתרגל מעולה, היה מאוד סבלני בהקלטות שלנו למרות שהיו אנשים מעיקים (מי שמכיר מכיר).\n\nשעורי הבית: עמוסים מאוד, אבל ללא ספק חשובים להבנה של הנושא. מממשים הכל מאפס בערך, לומדים מזה המון.\n\nהמבחן: לא היה אצלינו מבחן אלא פרויקט עם נפח גדול בצורה לא פרופורציונלית, שלא נגע כמעט בכלל ברשתות אלא באופטימיזציה שמבצעים עליהן. אני חושב שזה היה אחלה פרויקט אם הקורס היה נושאים מתקדמים בלמידה עמוקה או משהו בסגנון, אבל ביחס לעובדה שזה בסוף היה קורס בלמידה עמוקה ולא בכל מיני נושאים מתקדמים, הפרויקט היה חסר משמעות כמעט לחלוטין (הוא גם כמובן עסק בנושא שלא דיברנו עליו בכלל).\n\nהשורה התחתונה: קורס עם פוטנציאל אדיר וסגל גרוע. אני כן ממליץ על הקורס, אבל חשוב לדעת למה נכנסים, ויותר מזה חשוב להיכנס לקורס במיינדסט שהסגל ביזיוני לחלוטין ואתם הולכים לדאוג לעצמכם במשך כל הסמסטר.", "timestamp": 1668330340725}, {"author": "סטודנט שאוהב דיפ", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חיים בסקין (אלכס מרצה אחראי אבל לא מרצה)\nחוות דעת - הרצאות: \nההרצאות לא קשורות לתרגילי הבית, מדברים על החומר והעולם של דיפ. מגניב, אבל לא מבינים הרבה. ההרצאות המוקלטות של אלכס מעניינות ולדעתי הוא מעביר טוב יותר מחיים.\n\nשעורי הבית: \n4 תרגילי בית, 3 הראשונים כל אחד 20% מהציון, הרביעי 40 אחוז\nהקורס עמוס בצורה מטורפת, לא מבינים הרבה ממה שעושים אבל צריך בעיקרון להשלים שורות קוד בכל מיני חלקים בקוד, בעיקר שעושים חישובים - אין מצב להבין כלום או להצליח לבד אלא אם זה הקורס היחיד בסמסטר, *חייבים* לעשות עם רפרנסים.\nהתרגיל בית האחרון היה מוגזם, היינו צריכים לממש כמה שיפורים לתזה של הבודק תרגילים. לקח לי ולשותף את כל הקיץ, אנשים שטסו לחול חזרו מוקדם ואנשים שהתחתנו בקיץ חשבו פעמיים אם באמת צריך את מוסד הנישואין או שפרויקט בדיפ יותר רלוונטי כרגע.\nהגשנו דוח על ה״מחקר״ שעשינו למרות שכולם מימשו את אותם 2-3 מאמרים, הנושא לפחות היה ממש מעניין (איך לגרום לרחפן שטס בין גורדי שחקים לסטות מהמסלול על ידי הדבקה של משהו בסדר גודל של שלט חוצות על בניין אחד, ולנסות לגרום לסטייה כמה שיותר גדולה.\n\nהשורה התחתונה: \nתראו, לא תלמדו כאן איך מממשים על אמת דיפ. נכנסים לבטן של מה זה דיפ, מבינים לאט לאט מה זה בכלל רשתות. \nחיים ניסה לדחוף את הפרויקט להיות יותר רציני בסמסטר הזה, היה כישלון מוחלט ובערך שליש קורס פרש אחרי סמסטר שלם בגלל העומס המטורף של הפרויקט - ראו הוזהרתם. \nואני לא יכול להדגיש את זה מספיק אבל חייבים חייבים חייבים רפרנסים לתרגילי בית, לפחות יש בגיטהאב מלאכים.", "timestamp": 1673343474916}, {"author": "מישהו", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלכס ברונשטיין + חיים בסקין\nחוות דעת - הרצאות: בסקין העביר את ההרצאות בסמסטר שאני עשיתי. הוא יודע את החומר אבל מעביר אותו באופן לא ברור בגלל איך שהוא מדבר + בגלל איך שהאנגלית שלו, אז צריך לפעמים ללכת לאינטרנט כדי להבין טוב יותר, וזה חבל.\n\nשם המתרגל/ת: משה קמחי\nחוות דעת - תרגולים: אחלה של מתרגל\n\nשעורי הבית: עמוסים מאוד מאוד. אני עשיתי אותם כסטודנט לתואר שני אז היה לי יותר זמן להשקיע. סטודנטים לתואר ראשון בטח צריכים לרפרנס את המטלות כי בטח אין להם זמן לזה.\n\nהמבחן: אין. יש מיני-פרויקט. הוא לא כזה קשה.\n\nהשורה התחתונה: מאוד מומלץ אם אתם מעוניינים להיכנס לתחום הזה.", "timestamp": 1678197703262}, {"author": "VAE", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: חיים לדעתי מרצה מעולה, ההרצאות שלו שהיו בעברית היו מהמהנות שעברתי בזמן שלי בטכניון. כשהוא מרצה באנגלית הוא שובר שיניים, אני הבנתי שהקורס הולך לעבור בעברית בזמן הקרוב - מה שמעודד ממש.\n\nשם המתרגל/ת: משה קמחי\nחוות דעת - תרגולים: האנגלית שלו כל כך טובה שאתה לא קולט שהוא מתרגל די מעפן. בסוף כל תרגול שלו פלוס הרצאה אחת שהוא עבר לא ספגתי שום ידע בסוף שלה.\n\nשעורי הבית: כל מה שסיפרו לכם נכון.\n\nהשורה התחתונה: קורס מעניין, עבודות קשות רצח, מי שחושב לקחת את הקורס - חובה אחרי לומדות כי זה סתם יצבור לכם עוד תסכול.", "timestamp": 1689598124928}, {"author": "deep night learner", "difficultyRank": 5, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: לא יודע אנגלית מספיק טוב, מקשה מאד להבין את ההרצאות, בסך הכל מעביר חומר מעניין אבל מדלג מהר מידי על ההבנה של מאחורי הדברים ישר לדברים חדשים ומגניבים.\n\nשם המתרגל/ת:  משה קמחי\nחוות דעת - תרגולים: אפשר לעבור את התרגולים לבד, אבל הוא מתרגל ממש מעולה ונתן לי הרבה מעבר למה שכתוב בתרגול. התרגולים גם נותנים עזרה בתרגילי הבית אז היה שווה להגיע.\n\nשעורי הבית: ארוך כמו הגלות, אבל אחרי הסבל אגיד שלמדתי המון על המון דברים וזה גם עזר לי ממש להתניע תואר שני\n\n\nהשורה התחתונה: קורס קשה ועמוס, אבל מאד מלמד, מאד. ממליץ ממש למי שרוצה להתעסק בתחום. אפשר לדלג על ההרצאות ולקרוא לבד, כנ\"ל על התרגולים למרות שלי עזר לדבר עם המתרגל...", "timestamp": 1705823818358}, {"author": "המשורר", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: חיים אולי בן אדם נחמד, אולי בנבכי מוחו/ליבו מבין את החומר - אבל - הוא לא יודע לדבר. ותוסיפו על זה אנגלית שמביישת תלמיד יסודי. הוא מדלג, קופץ, בולע מילים, לא מסביר טוב, אנגלית גרועה מאוד. ההרצאות בתת-רמה (אין לי מילה יותר טובה). צריכים ללמד אותו לדבר או להחליף מרצה. אבל מה יש מלא יוטיוב והרצאות מוקלטות אחרות שאפשרי להעזר בהם כדי להבין דברים. (החומר לא מורכב כי בדיפ אין מתמטיקה אז הכל ניסוי וטעיה וראו מה עובד ואמרו קחו זה עובד הכי טוב וגם בש\"ב עושים ניסוי וטעיה ובודקים מה יכול לעבוד הכי טוב)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: קמחי\nכשהם מועברים בעברית אפשר להבין - ובהחלט יכול לעזור בש\"ב ובהבנה של החומר (בהנחה שאת ההבנה הבסיסית כבר קיבלתם מסרטון ביוטיוב ואז באים לתרגול ומבינים את הרמה הגבוהה יותר שהוא מעביר בתרגול). כשזה באנגלית זה קטע ראפ שלא היה מבייש אף ראפר לבן ממוצא אקזוטי.\n\nשעורי הבית: \nקבלו סוד - יש רפרנסים. וגם יש צ'אט ג'י פי טי ויש גם סטודנטים חברים שהם אחים (גם הבינלאומים אחים ואחיות)\n\nהמבחן: \n\nאין - במקום יש פרויקט שנמשך לתוך הקיץ ככה בכיף. (לפחות מוריד את הדרישה לפרויקט בתואר בחצי מחיר). צ'אט ג'י פי טי בכל הכוח ושותף טוב.\n\nהשורה התחתונה:\n\nמה אני אגיד דוגמה עצובה וקלאסית לקורס חשוב שפשוט חסר כל סטנדרט בסיסי של הוראה. הוא גם הכרחי להבנתי כדי להמשיך לשאר קורסים וגם כנראה לעבודה בנושא (אם אתם תואר שני או תואר ראשון בעלי הישגים גבוהים)\n\nשיהיה לכולנו בהצלחה.", "timestamp": 1708419289230}, {"author": "אל תקחו", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: \nאחד המרצים הגרועים שהיו לי בתואר. לא יודע לדבר, בולע מילים, לא יודע להסביר שום דבר מהחומר. הוא אשכרה לא מסביר כלום, רק מצביע על המצגת ושואל \"שאלות?\". ההקלטות באיכות זוועה ולפעמים בכלל לא מועלות לאתר למרות ההבטחה למילואימניקים בתחילת הסמסטר. \n\nשם המתרגל/ת: משה קמחי\nחוות דעת - תרגולים: \nאין לי מילה אחרת להגיד עליו חוץ מחלאה. מתרגל פשוט גרוע, מסנן במייל במשך שבועות ארוכים, שם *** על מילואימניקים למרות שגרף 300 לייקים על פוסט שתומך בהם. \nחוץ מזה הוא מתרגל ברמה מאוד נמוכה, ממליץ בחום על התרגולים המוקלטים של אביב רוזנברג שהוא מעולה.\n\nשעורי הבית: \nזוועה, בנויים בצורה שאין לך דרך להצליח אותם בלי רפרנס ושבוע עבודה רצופה. (ואני אחד שלא משתמש ברפרנסים בתואר)\n\nהמבחן: אין\n\nהשורה התחתונה: \nקורס גרוע ביותר, הוריד לי כמעט את כל העניין מהתחום בגלל סגל מגעיל שלא יודע ללמד.", "timestamp": 1713560138812}, {"author": "רועי", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: חיים מבזבז שעתיים בלנהל שיחה פרטית עם אותם שני סטודנטים בזמן שכל השאר הכיתה בוהה בתקרה. חיים גרוע, אבל הקורס טוב והחומר חשוב. \n\nשם המתרגל/ת: משה קמחי\nחוות דעת - תרגולים: טוב. מדבר תכלס.\n\nשעורי הבית: בזוגות, הרבה רטוב עם קצת יבש, לכל אחד לקח בסביבות 3-4 ימים מלאים לכל תרגיל, היו לנו 3 תרגילים. מכניס לעולם של רשתות ניורונים, בונים רשתות מההתחלה ועד RNN, נוגעים גם בטרנספורמרים.  \n\nהמבחן: יש פרוייקט, לנו היה קצת מקוצר. פשוט עוד משימה של שיעורי בית.\n\nהשורה התחתונה: ההרצאות עם חיים בזבוז זמן, אבל התרגילים, המתרגלים והחומר מספיק חשובים בשביל לקחת. אם יחליפו מרצה יהיה אחלה קורס.", "timestamp": 1714033780255}, {"author": "OPTIMUS", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: גרועות. בהרצאות אתם יושבים שעתיים, מתאמצים להקשיב ואז יוצאים בהרגשה שלא למדתם כלום. הסיבה היא שחיים לא מלמד כלום. הוא לא מדבר ברור, וגם כשהוא טיפה נהיה יותר מובן זה לא עוזר יותר מדי. בנוסף יש בכל הרצאה סטודנטים טרחנים ששואלים אותו מלא שאלות במהלך ההרצאה, וממשיכים לשאול למרות שחיים לא יודע לענות או להסביר והופכים את ההרצאות הגרועות, לבלתי נסבלות (מאמין שזה לא עניין נקודתי כי יש אנשים כאלה כל הזמן).\nממליץ לוותר עליהן וללכת ללמוד את החומר לבד כי ללכת להרצאות זה פשוט בזבוז זמן.\n\nשם המתרגל/ת: משה קמחי.\nחוות דעת - תרגולים: סבבה, מהיר. עדיף ללמוד את החומר לבד לפני שבאים לתרגול.\n\nשעורי הבית: לעבוד עם רפרנס/chatgpt. עוזרים בכל מיני בעיות עם python/pytorch ובלעדיהם ייקח הרבה יותר זמן. איתם התרגילים לוקחים משהו כמו שבוע-שבועיים.\nהתרגילי בית באים עם הרבה דברים מוכנים מראש, מה שעוזר להריץ דברים (להבדיל מלומדות למשל) ובסופו של דבר הם הדבר המרכזי בקורס שממנו לומדים.\n\nהמבחן: אין, יש פרוייקט. סבבה סה\"כ, דומה לתרגילי בית פחות או יותר.\n\nהשורה התחתונה: קורס שהיה יכול להיות טוב, אבל בפועל גרוע מאוד. לא מרגישים שלומדים יותר מדי, וכל דבר שמלמדים בקורס אפשר למצוא איזה מקום באינטרנט שמעביר אותו יותר טוב.\nהסיבה היחידה לקחת אותו היא פשוט כי הוא קדם להרבה קורסים מתקדמים בנושא, אבל אם אתם לא בטוחים ב-100% שזה הנושא שמעניין אתכם, הייתי ממליץ לוותר עליו.", "timestamp": 1714472567661}, {"author": "SGD", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה:  חיים בסקין\nחוות דעת - הרצאות: בעברית, לא תורמות יותר מדי, מומלץ להבין משם את הנושאים ואז לראות על זה כמה סרטונים ביוטיוב\n\nשעורי הבית: כיפיים!! לבנות מודלים לכל מיני משימות מעניינות\n\nהמבחן: אין, יש פרוייקט שהיה ממש כיף לשחזור תמונות MRI\n\nהשורה התחתונה: כל מי שהתחום מעניין אותו שיקח", "timestamp": 1717230005865}, {"author": ".", "difficultyRank": 5, "generalRank": 2, "semester": "202302", "text": "שם המרצה: חיים בסקין\nחוות דעת - הרצאות: החומר מאוד מעניין \n\nשם המתרגל/ת: תמיר שור\nחוות דעת - תרגולים: דואג שכולם מבינים את החומר\n\nתרגילי בית: מאוד ארוכים, לא מרגיש שלמדתי מהם חדש על למידה עמוקה או מימוש של מודלים. הפרויקט כן מעניין אבל השרת לא תמיד עובד, והעבודה עליו מאוד לא נוחה.\n\nהשורה התחתונה: לא קדם לשום קורס שאני מכיר, ממליץ לעשות את הקורס של הנדסת חשמל או להגיע כשומע חופשי ולעשות פרויקט.", "timestamp": 1720521669641}]}