{"posts": [{"author": "ט", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ממוחזרים חוץ מהרטוב\n\nהמבחן: לא קשה בדר\"כ, הסמסטר היה יחסית קשה בגלל שהמבחן קוצר\n\nהשורה התחתונה: נורא משעמם", "timestamp": 1598254743739}, {"author": "ד", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: לעתים כשהיו אמורול להיות מוצגות דוגמאות הפנתה אותנו לוידאו, מה שפחות התחברתי אליו כי ישנם נושאים קצת מסובכים להבנה, אך סה\"כ מרצה בסדר אם כי קצת מונוטונית.\n\nשם המתרגל/ת: גל גרימברג\nחוות דעת - תרגולים: מתרגל נחמד שהרגשתי כי חשובה לו ההבנה של הסטודנטים.\n\nשעורי הבית: ישנם ארבעה תרגילי בית כאשר השני רטוב. התרגילים לא היו ממחוזרים, אך לא קשים יתר על המידה והמתרגלים ענו על שאלות שהיו בפיאצה. התרגילים דומים לשאלות מהמבחנים.\n\nהמבחן: סמסטר קורונה. המתרגל האחראי שיחרר מיקוד לקראת מועד הא' ואף הסכים להעלות למודל סיכום שהיה מוסכם על הסטודנטים, מעשה מתחשב ביותר.\nפרט לכך, המבחן היה הוגן. אציין כי הייתה שאלה על נושא שלא נשאלים עליו בדרך כלל (טרנזקציות ומנעולים)\n\nהשורה התחתונה: יש בקורס דגש תיאורטי יותר חזק ממה שציפיתי ולדעתי הוא יכול לעבור ריענון בחלק מהנושאים המועברים אך סך הכל קורס נחמד.", "timestamp": 1614176823494}, {"author": "אנונימוס", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: אחלה מרצה, בחלק מהחומר לא נכנסה לעומק והפנתה לוידאו של בני.\n\nשם המתרגל/ת: אסף ישורון\nחוות דעת - תרגולים: העביר את החומר בצורה ברורה ומתומצתת. התרגולים בכללי עם דוגמאות די פשוטות, אבל זה עוזר להבין את הבסיס.\n\nשעורי הבית: 3 תרגילים יבשים (הראשון והאחרון קלילים, השלישי היה קצת חופר), ותרגיל רטוב אחד שכולל כתיבת שאילתות ב SQL, לא עמוס ודי זורם.\n\nהמבחן: סבבה לגמרי.\n\nהשורה התחתונה: אחלה קורס, לומדים דברים די חשובים אם כי לא נכנסים לעומק יותר מידי, אבל די טוב בשביל להבין דברים בסיסיים בתחום.", "timestamp": 1614356869097}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: חגית עטיה \nחוות דעת - הרצאות: היה קל לראות שחגית לא שולטת בחומר בכלל וככה גם ההסברים שלה בהתאם, לא מומלץ בכלל.\n\nשם המתרגל/ת: אסף ישורון\nחוות דעת - תרגולים: מתרגל נחמד מאוד ומסביר ממש טוב , זה כן מומלץ.\n\nשעורי הבית: לא ארוכים ולא קשים(חוץ מהרטוב שלוקח יומיים 3 בערך)\n\nהמבחן: הוגן\n\nהשורה התחתונה:", "timestamp": 1614368287080}, {"author": "ירדן", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: גלית עטיה\nחוות דעת - הרצאות: ההרצאות היו די מעניינות וגלית גם מרצה שממש מעבירה את החומר בצורה מעניינת ומדברת עם הסטודנטים  בגובה העיניים. \n\nשם המתרגל/ת: אסף ישורון \nחוות דעת - תרגולים: ראיתי את התרגולים המוקלטים שלו שהיו ממש אחלה ובדיוק כיסו את החומר שצריך.\n\nשעורי הבית: בסה'כ לא עמוסים ודי עובדים על מה שצריך בשביל להבין את החומר.\n\nהמבחן: היה מבחן הוגן.\n\nהשורה התחתונה: קורס מעניין שגם נותן יכולות חשובות.", "timestamp": 1616255475005}, {"author": "SR", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: בני קימלפלד\nחוות דעת - הרצאות: אחלה מרצה\n\nשם המתרגל/ת: גיא הורוביץ\nחוות דעת - תרגולים: ראיתי אותו בהקלטות, מתרגל על הכיפאק. מסביר מעולה ותמיד מוכן לענות על שאלות ולחזור על דברים. גם שאר הסגל בקורס היה ממש אחלה\n\nשעורי הבית: 4 תרגילי בית, כאשר השני הוא רטוב. לא קשה מדי אבל כן לוקח זמן. היבשים בסה\"כ סבירים.\n\nהמבחן: היה הוגן. \n\nהשורה התחתונה: אחלה קורס בחירה לדעתי.", "timestamp": 1627936232042}, {"author": "אילון", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: בני קימלפלד\nחוות דעת - הרצאות: חביבות בלבד\nה-4 שבועות הראשונים נורא משעממים אבל  תחזיקו מעמד, אחרי זה נהיה מעניין יותר\n\nשם המתרגל/ת: גיא הורוביץ\nחוות דעת - תרגולים: אחלה תרגולים, עוזרים להבין מה קרה בהרצאה בצורה יותר פשוטה\n\nשעורי הבית: \nיש 4 תרגילים, לא עמוסים מדי וסה\"כ טובים בלעזור בהבנת החומר. כולם יבשים מלבד 2 אבל הוא לא עמוס מדי\n\nהמבחן: \nהמבחן מקיף את כל הקורס, כלומר צריך לדעת טוב את החומר מכל הסמסטר ולא השבועיים האחרונים כמו קורסים אחרים\nמה שכן, כל שבוע כמעט הוא די standalone אז להתכונן זה יחסית מסודר כי אפשר לסמן וי על נושא אחר נושא ולראות שסגורים עליו בשאלות מבחנים\n\nהשורה התחתונה: \nקורס חשוב ובסיסי בהכרה של מסדי נתונים, אם שורדים את השבועות הראשונים שהם בעיקר פורמליות מגיעים לחלקים מעניינים", "timestamp": 1628343056927}, {"author": "Elad Kay", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: בני קימלפלד\nחוות דעת - הרצאות: מרצה מצוין, נחמד ומתחשב. המצגות ערוכות מעולה.\n\nשם המתרגל/ת: רואי קיסוס\nחוות דעת - תרגולים: בתרגולים הוא מעולה, הוא מסביר טוב ומוכן גם להישאר אחרי ולענות. שימו לב שאי אפשר לשאול במייל, יש פיאצה.\nאגב, גם הייתה לי בקשה מיוחדת שהפניתי אליו בתור מתרגל אחראי לפנים משורת הדין והוא לגמרי עשה את המיטב להתחשב בה ולעזור לי ובאמת כל הכבוד לו כי זה לא מובן מאליו\n\nשעורי הבית: סה״כ 4 תרגילים שהם 20%, כל תרגיל 4% חוץ מהרטוב שהוא 8%\n\nהמבחן: לא כזה פשוט אבל רובו ממש בסדר\n\nהשורה התחתונה: קורס מומלץ כדי לראות אם מתחברים. יש גם תאוריה ולא רק פרקטיקה ואני אישית לא התחברתי להרבה מהקורס, אבל אי אפשר לדעת בלי לנסות", "timestamp": 1628959793033}, {"author": "פלוני", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חגית\nחוות דעת - הרצאות: בסדר\n\nשם המתרגל/ת: גאי \nחוות דעת - תרגולים: טובים \n\nשעורי הבית: טובים, מתרגלים טוב את החומר.4 ת\"ב, כאשר השני רטוב ולוקח יומיים/שלוש עבודה, אבל לא כמו שאר הרטובים במדמח שהורגים אותך.\n\nהמבחן: היה לנו מבחן מאוד מאוד קשה, שנגע בכל השפות והתחומים שראינו. היה גם מאוד ארוך!\n\nהשורה התחתונה:", "timestamp": 1646164708726}, {"author": "נ.ס", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חגית\nחוות דעת - הרצאות: \nקשוח...\n\nשעורי הבית: \nקלים ולא עמוסים יחסית לקורסים אחרים בפקולטה.\n\nהשורה התחתונה: \nאני הרגשתי שהצורה שבה הועברו ההרצאות הפכה את החומר לקשה ומבלבל, למרות שבפועל הקורס קל והחומר מאוד פשוט.\nקל לזלזל בקורס במהלך הסמסטר אבל יש לא מעט חומר שצריך לשלוט בכולו כדי להיות מוכנים למבחן.", "timestamp": 1673779091752}, {"author": "~", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המתרגל/ת: מעיין\nחוות דעת - תרגולים: מתרגלת מעולה. מסבירה בצורה מאוד ברורה ובהמון סבלנות\n\nשעורי הבית: יש ארבעה תרגילים. השני ארוך מאוד אבל לא מאוד קשה. השאר סבבה", "timestamp": 1675864665178}, {"author": "הסטודנט הרע", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס משעמם פיצוצים , להתרחק כמו מאש", "timestamp": 1686994542002}, {"author": "הצורה הנורמלית השלישית", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: בני \nחוות דעת - הרצאות: בני רטורית מרצה לא משהו, בעיקר עומד עם ידיים משולבות ומסביר בצורה מונוטונית, הרבה פעמים לא מצליחים להבין למה עושים אנחנו עושים דברים מסוימים. אבל כששואלים אותו הוא תמיד עונה, והיחס שלו הוא אחלה ממש\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: ארבעה תרגילים, שלושה יבשים ואחד רטוב - בגדול שווה לעשות (זה תקף, אבל בכל מקרה), השאלות הן קשות ביחס לשאלות מבחן ככה שצריך לעשות השלמות ידע, שזה מועיל אחר כך. \n\nהמבחן: היה מבחן די ארוך, אבל לדעתי הוגן בסך הכל - אולי קצת יותר קשה מהרגיל.\n\nהשורה התחתונה: לדעתי שינוי פורמט לקורס יכול להיות מבורך, לומדים כל כך הרבה שפות שאילתה בצורה מאוד רדודה, ובכללי המון נושאים באופן הזה, שמורגש שלא צוברים הרבה יותר מדיי ידע בקורס הזה. בפורמט הזה הוא משעמם.", "timestamp": 1689597829008}, {"author": "er", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש הרבה תרגילים בסגנון הוכחות מתמטיות.\nהמבחן: \n\nהשורה התחתונה: \nלומדים על מסדי נתונים עם דגש על התאוריה (normal forms, אלגברה רלציונית וכו'). מרגיש כמו קורס מבוא שמגרד את קצה הקרחון של תחום מסדי נתונים. מומלץ למי שמתעניין", "timestamp": 1689689824184}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: בני קימלפלד\nחוות דעת - הרצאות: לא המרצה הכי כריזמטי בטאוב אבל בן אדם נחמד, אפשר להרגיש בנוח לעצור אותו שאלות וכשמצליחים להתרכז במה שהוא אומר, שומעים שהוא גם מסביר בסדר.\nרוב ההרצאות מאוד תאורטיות ומשעממות. השיא היה כשהוכחנו שמערכת הוכחה היא שלמה ונאותה.\n\nשם המתרגל/ת: מעיין\nחוות דעת - תרגולים: פשוט מתוקה ברמות. מזקקת את התכלס מכל התאוריה המוגזמת של ההרצאות בצורה הכי פשוטה שיש ותמיד שמחה להסביר ולענות על שאלות.\n\nשעורי הבית: 3 יבשים ורטוב אחד. ארוכים ומתישים עם בדיקה קשוחה. הרטוב לקח 3 ימים מלאים של עבודה אינטנסיבית ובסוף הממוצע גם היה על הפנים והרשו להגיש תיקון רק מציון 40 ומטה.\n\nהמבחן: מאוד טכני ועם בדיקה קשוחה. ממוצע לא וואו יחסית לקורס בחירה.\n\nהשורה התחתונה: תחשבו פעמיים, הקורס לא כזה פרקטי וגם את מעט הפרקטיקה שלומדים אפשר להשלים בכמה שעות של קורסים ביוטיוב. כן יש קצת עקרונות חשובים אבל רובם תאורטיים מדי ככה שאם התחום לא מאוד מעניין אתכם, כנראה שלא תהנו מהקורס וגם ההמוצע שלכם ספק אם ירוויח ממנו.", "timestamp": 1692030272170}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: בני קימלפלד\nחוות דעת - הרצאות: במהלך הסמסטר צפיתי בהקלטות של בני משנים קודמות. בני נהג לפרסם הקלטות מהסמסטר הנוכחי במידה ושינה משהו בחומר מה שעזר. אני כן ממליץ בסמסטר עם בני לצפות בהקלטות איתו ולא בהקלטות של חגית כי הסדר אצלם שונה בקורס.\nלגבי אופן ההרצאות: מאוד מונוטוני ומשעמם. בני מאוד מנסה להסביר טוב את החומר אבל זה פשוט לא יוצא לו. באמת ניכר שהוא מבין אותו היטב ומכיר כל פרט בו אבל ההסברים שלו לא בהירים וגם כששואלים אותו התשובה שלו מעט מעורפלת לפעמים.\nלגבי תוכן ההרצאות: לא מעניין במיוחד בעיני. יש חומר חשוב כמו SQL, mongoDB, Xml אבל זה לא מספיק כדי לכסות 12-13 שבועות ולכן נאלצים למלא את החומר בDesign Theory וRA שמי שאהב לוגיקה, יתחבר לזה מאוד אבל מי שלא - יסבול. יש הרבה אלגוריתמים שלומדים שההוכחות שלהם לא ברורות עד הסוף ורק אחרי שעוברים עליהן משהו כמו 4 פעמים מבינים אותן. כמו כן יש את Currency Control ו-Index שהם מרגישים כמו בני דודים של הקורס במובן מסוים ולא חלק רציף וישיר ממנו.\n\nשם המתרגל/ת: מעיין \nחוות דעת - תרגולים: מעיין מתרגלת מצוינת! מסבירה את החומר ממש טוב ויורדת לסוף דעתם של הסטודנטים. היא מסבירה במפורט הכל ועונה על כל שאלה.\nתוכן התרגולים ברובו הוא קצת חזרה על ההרצאות אבל לפעמים יש חומר חדש. דווקא החומר הכי קשה שהוא אינדקסים, לא מועבר בו תרגול וחבל מאוד שכך. כל שאר החומר מאוד זורם בתרגול כי הוא מוסבר מהפעם השנייה וגם מה שלא מאוד נחמד וסביר. הסמסטר הם אמרו לנו שכדאי מאוד להגיע לתרגולים כי \"הרמה עלתה\" והם משנים את זה גם בתרגולים, בפועל התרגולים היו אותו דבר כמו במוקלט והרמה התבטאה במבחן.\n\nשעורי הבית: \n3 יבשים שצריך להיות בהם על החומר די טוב כדי להצליח אותם ולהשוות עם לפחות 2-3 אנשים שונים כדי לוודא שיש לכם את ה95+. לכן צריך להיות על הקורס במהלך הסמסטר כדי שיהיה אפשר לעשות אותם כמו שצריך. בסה\"כ הם די מלמדים והם גם כמעט אף פעם לא ממוחזרים.\nיש תרגיל רטוב אחד של כתיבת שאילתות בSQL והוא לימד אותי הרבה, ובפועל לדעתי הוא גם זה שהכי חשוב לחיים האמיתיים כי הוא מלמד המון.\n\nהמבחן: נגשתי למועד ב' (אנחנו בדצמבר 2023 עכשיו) והיה קשה ולדעתי קפץ ברמה הרבה יותר ממועדים קודמים. המבנה של המבחן די זהה: שאלות Design, אלגברה רלציונית, שאילתות SQL, בקרת גישה ואחרי זה בחירה בין שתי שאלות: Xml וmonogoDB. אבל רמת החשיבה שם קפצה מדרגה אחת לפחות (כנראה כי הרבה אנשים אומרים שזה קורס בחירה קל אז הסגל החליט לתקוע אצבע בעין). היה פקטור של 10+ נקודות (אנשים קיבלו פקטורים שונים) ועדיין הממוצע של המבחן של מועד ב היה 63 שזה גרוע ממש לקורס בחירה.\n\nהשורה התחתונה: הסגל מאוד מתאמץ כדי שהקורס יהיה מסודר וברור: באופן שבו הם מעבירים את הקורס, בכתיבת תרגילי הבית ובהסברים שלהם והמענה התמידי בפיאצה. יחד עם זאת, זה לא מספיק כדי שזה יהיה קורס בחירה ששווה את ההשקעה הזו בשביל ציון של 85+.", "timestamp": 1703683664933}, {"author": "סטודנט רלציוני", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: סה\"כ אחלה. נחמד שהיא כביכול \"לא מהתחום\" של מסדי נתונים, היא מלמדת בקצב ובשפה שבני אדם וניוביז כמונו יכולים להבין ולא באיזה ז'רגון מקצועי ודקדקני.\n\nשם המתרגל/ת: ארז+וידאו\nחוות דעת - תרגולים: אנחנו רק באמצע הסמסטר, ובגלל התרגולים החלטתי לכתוב את הביקורת הזו כבר עכשיו, בתקווה שזה יעזור למישהו כבר בסמסטר הנוכחי.\nארז כאילו מעביר את התרגולים בסדר, אבל בתכלס הוא רק אומר מה כתוב בשקפים, הוא ממש לא מבין את הראש של הסטודנט הממוצע ומה המטרה שבשבילה באים לתרגול. הוא רץ כל כך מהר ולא מסביר מעבר, שכמעט בלתי אפשרי לחשוב ולהבין תוך כדי שיעור ונניח גם לשאול ולבקש הבהרות, אבל בכל מקרה גם כששואלים אותו משהו אז בדרך כלל הוא יענה על משהו 4 רמות מעל מה ששאלנו בלי להבין שאין לנו מושג על מה הוא מדבר ושאנחנו מגיעים בלי רקע.\nהשותף שלי הולך לתרגולים של שיר, וכשאנחנו יושבים על התרגילים זה מרגיש כאילו אני יודע את החומר והוא גם מבין אותו, ונראה לי שזו בדיוק הבעיה בתרגולים של ארז (לא יודע אם זה ודאי, הייתי רק בשעת קבלה של שיר שממש עזרה וסגרה לי פינות, השותף אומר שככה זה גם בתרגולים שלה ושההבנה שלו זה רק מהתרגולים (הוא לא הולך להרצאות, משלים בוידאו רק את מה ששואלים עליו בשיעורי בית). הייתי פעם אחת בתרגול של איתי בתחילת הסמסטר והוא גם עשה רושם של אחלה).\nאני כבר לא יכול להגיע לשני התרגולים האחרים אז עברתי לוידאו הישן. החומר מספיק דומה והמתרגל מעולה, אז אם מישהו בסמסטר הנוכחי רואה את זה - מומלץ.\n\nבשורה התחתונה - אל תלכו לתרגולים של ארז, זה בזבוז זמן, גם ככה הוא מקליט אותם והתועלת היחידה שיש בלהגיע היא האפשרות לשאול שאלות, אבל בכל מקרה לא תבינו מה הוא עונה לכם אז חבל. יש הקלטות טובות יותר.\n\nשעורי הבית: התרגיל הראשון היה סבבה. עכשיו אנחנו בתרגיל השני, וגם שם אני לא מבין את הגישה של ארז שאחראי עליו. הוא אשכרה עושה מה שבראש שלו ולא שם ז*ן על זה שיש סטודנטים בצד השני. התרגיל בקושי שבוע באוויר, וכבר הוא שינה אותו איזה 3-4 פעמים (לא יודע בדיוק כמה, הוא גם לא טורח להודיע על זה, אני יודע על זה רק מהקבוצת וואטסאפ שאנשים שואלים בה על כל מיני דברים שלא מופיעים אצל אחרים). הוא לא מבין שאנחנו עובדים על הקבצים שהוא פרסם (זה קוד כזה שצריך להשלים), ושברגע שהוא משנה אותם אנחנו צריכים להתחיל להעביר את כל מה שעשינו למקום אחר. גם תיקונים שהוא עשה היו כי סטודנטים מצאו טעויות, למה הוא לא יכל לבדוק שמה שהוא מפרסם תקין? אנחנו צריכים לחפש את הטעויות שלו ואז עוד לנחש שהוא תיקן אותן? חתיכת זלזול בסטודנטים. הוא גם עונה על שאלות בפיאצה בצורה מאוד שרירותית, על חלק הוא עונה בדיליי ולחלק בכלל לא מתייחס. שאר הסגל גם נמצא שם, לא מבין למה אף אחד לא אומר לו כלום. יש מרצה ומתרגלת אחראיות שמאוד נוכחות, מישהי מהן בטוח יכולה להבהיר לו שכל ההתנהלות הזו לא לעניין.\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: תלכו למתרגל טוב או תראו הקלטות ישנות", "timestamp": 1708588783946}, {"author": "ההוא שיושב מאחור", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "חוות דעת - הרצאות: ראיתי מוקלט, ממליץ למי שמסתדר עם הקלטות אבל הבנתי שהמרצה גם אחלה.\n\nשם המתרגל/ת: ארז\nחוות דעת - תרגולים: ניכר שהביקורת הקודמת נכתבה על ידי סטודנט כושל כפורקן על מרמורו מהלימודים. ארז אחלה מתרגל לדעתי ובעל ידע רחב בתחום.\n\nשעורי הבית: מוגזמים", "timestamp": 1713352516418}, {"author": "ERD", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: מיותרות. חגית לא שולטת בחומר, וחלק ניכר מההרצאות זה רפרוף על שקפים שהיא לא התכוננה עליהם מראש.\n\nשם המתרגל/ת: שיר רוטמן\nחוות דעת - תרגולים: סבירים, בדיעבד היה עדיף לקרוא את השקפים בעצמי.\n\nשעורי הבית: תקפים, אני חושב שהם כן מהווים תרגול טוב לחומר.\n\nהמבחן: לא קשה ביחס למבחני עבר, אבל מאוד דו-משמעי, וניכר שלא עשו לו proof read. מתרגלים לא יודעים לענות על שאלות בסיסיות הנוגעות לשאלות במבחן שהם, לכאורה, כתבו. זה מתקשר היטב לאיך שההרצאות והתרגולים הועברו הסמסטר.\n\nהשורה התחתונה: הייתי לומד בצורה יותר איכותית ובפחות זמן אם פשוט הייתי לוקח קורס ביודמי.", "timestamp": 1715422881613}, {"author": "סטודנט נורמלי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חגית\nחוות דעת - הרצאות: בסדר, אבל לא הרגשתי שקיבלתי איזשהו ערך מוסף מההרצאות. תכלס אפשר לוותר עליהן, לא באמת מצדיקות השקעה של שעתיים בשבוע.\n\nשם המתרגל/ת: שיר\nחוות דעת - תרגולים: אחלה, ניכר שיש לה היכרות עם הנושאים של הקורס, ושמאוד אכפת לה ושהיא משקיעה. הרגשתי שברוב הנושאים הבנתי ממנה את החומר יותר טוב ממה שהבנתי בהרצאות, אז עוד סיבה לוותר על ההרצאות. הבעיה היחידה היא שהמצגות ממש מסודרות ומכסות הכל אז גם התרגולים לא הכרחיים, אבל יש מקומות שההסברים בכיתה כן עזרו לי לפתח אינטואיציה.\n\nשעורי הבית: היו תרגול טוב, אבל הרגישו קצת לא פרופורציונליים.\n\nהמבחן: בעייתי ממש, מלא דברים שמנוסחים לא טוב ודרישות לא הגיוניות שהודיעו עלין רק באמצע המבחן. הוא לא היה קשה, אבל כשלא ברור מה רוצים ממך ואחר כך עוד משנים את זה, זה לא באמת משנה. החלק הלא רלציוני, שהוא כאילו השולי בקורס, הוא היחיד שהיה ברור ובלי בעיות, וזה רק מראה כמה המבחן דפוק - החלק המרכזי שעליו שמו דגש כל הסמסטר הרגיש כאילו הסגל בעצמו לא הבין מה הוא רוצה שם, אבל על הנושאים הלא קשורים שלפעמים הם בכלל בחירה כן הקפידו. נראה לי הזוי. \nבסוף הציונים בכל זאת היו סבבה, אבל עדיין זה מעצבן.\n\nהשורה התחתונה: אחלה כקורס בחירה עם נושאים שימושיים שמפצים על זה שזה לא ציונים כמו של סמינרים, אבל תלוי במבחן וזה כבר הימור.", "timestamp": 1716202021196}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חגית\nחוות דעת - הרצאות: \nלא שולטת בחומר של הקורס. נתקעת ומתבלבלת הרבה פעמים תוך כדי ההרצאה, מה שגם כן מוציא מריכוז.\nהיה איזה משהו מציק גם, שכל פעם שמישהו שאל שאלה, הייתה מציינת אותו איזה 5 פעמים אחרי זה, לא מובן לי למה.\nשם המתרגל/ת: ארז/ עידו מוקלט\nחוות דעת - תרגולים: \nהתרגולים של ארז בהתחלה היו ממש לא טובים. הוא מתרגל חדש, כנראה שלמד מהטעויות שלו, ולאחר מכן ממש השתפר.\nכן ממליץ עליו\n\nשעורי הבית: \nישנם 2 תרגילי בית יבשים , אחד רטוב.\nהתרגילי הבית ארוכים, ולוקחים יחסית הרבה מאוד זמן.\n\nהמבחן: \nהמבחן הסמסטר הרגיש יותר קשה מהרגיל. בגדול, הוא גם ממש ארוך וצריך די לשלוט בחומר, כדי להספיק בזמן\n\nהשורה התחתונה: \nקורס סביר, לא הכי מעניין שלקחתי אבל לא רע. מרגיש לי שלומדים הרבה דברים מיותרים.", "timestamp": 1716478378422}]}