{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: משתנה\nחוות דעת - הרצאות: סופר מעניינות ברובן\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: לכתוב כמה מילים על חלק מההרצאות, לא יותר מ10 דקות בשבוע\n\nהמבחן: לא רלוונטי\n\nהשורה התחתונה: כל שבוע הרצאה חדשה על נושא מחקר של חבר סגל. בסוף צריך לכתוב עבודה על סמך מאמר של חבר סגל שבחרת. קצת עבודה אבל לא סוף העולם.", "timestamp": 1601971757119}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "קורס משעמם ומיותר.\nהמטרה המרכזית של הקורס זה לעזור לסטודנטים לפני תואר שני למצוא מנחים פוטנציאליים לתזה.\nלי זה בעיקר עזר למצוא את מי שאני בהחלט לא רוצה בתור כזה, אבל אולי אם נופלים על חברי סגל סבבה החוויה יוצאת קצת יותר חיובית...\n\nהרצאות:\nמשעממות ברובן, הרבה פעמים ההבנה שלהם דורשת לפחות היכרות שטחית עם תחום המחקר של המציג וזה לא תמיד המצב.\nמצד שני הן כן יכולות לעיתים לחשוף אתכם לתחומי מחקר שלא הכרתם או חשבתם עליהם, שייראו לכם מעניינים.\n\nשעורי הבית: \nבגדול זה לכתוב עבור חלק מההרצאות סיכום קצר על נושא המחקר, ועל אחד המאמרים שהוצגו בה. לא ביג דיל.\n\nהמבחן: \nאין מבחן.\nיש עבודה סופית שעושים על סמך מאמר של אחד מחברי הסגל, אבל אלא אם נופלים על חבר סגר נורמלי שאכפת לו, אין לה ממש פואנטה.\n\nהשורה התחתונה: \nזה קורס שאולי כדאי לקחת אם אתם באמת תקועים במציאת מנחה לתזה (וגם אז בעירבון מוגבל), לא הייתי לוקח אם המטרה להשלים נקודה חסרה בתואר.\nהקורס לא עמוס, אבל ה\"הגשות\" השבועיות כן יכולות להרגיש קצת תקועות לפעמים.", "timestamp": 1611930918496}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "כל שבוע מגיע.ה מרצה אחר.ת לדבר על המחקר שלו.ה, ואז צריך לעשות איזה עבודה של רבע שעה על ההרצאה (כזה להסביר מה המרצה עושה, ולקרוא את ה abstract של איזה מאמר).\nבערך אחרי 7 שבועות אין יותר הרצאות וצריך לעשות מיני הצעת מחקר עם אחד מהמרצים. זה לא פרוייקט מטורף אבל כן דורש השקעה, אז לדעתי באמת מומלץ רק למי ששוקל תואר שני.\nמבחינת נוכחות - בגדול הנוכחות היא חובה (בפועל אצלנו היה בשיטת אמון, שכל אחד מסמן על עצמו בקובץ אקסל אם הגיע)", "timestamp": 1645608245530}]}