{"posts": [{"author": "לא משנה", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "סמינר במערכות לומדות והתנהגות אנושית\n\nשם המרצה: ניר רוזנפלד\nחוות דעת - הרצאות: היה אפשר לקחת את הכותרות לכיוונים יותר מעניינים מהמאמרים שהוצגו בכיתה בפועל. לא כל כך מעניין לשמוע כל פעם מחדש על איך העובדה שמכניסים מערכות המלצה לעוד חלקים בחיים שלנו הופך אותנו לצפויים ויוצר אפקטים קיצוניים בחברה. הנושאים עצמם מאוד מעניינים והיה מעניין לחשוב דווקא על מה שלא דיברנו ולקראת ההרצאה שלי והפרויקט.\n\nשעורי הבית: משימה קצרה כל שבוע. לא היה הרבה טקסט אבל היה די מעיק, במיוחד שהוא מבקש כל שבוע מחדש להיות יצירתיים (נסו למנות עכשיו 13 מערכות שונות שנכנסות לקטגוריה של מערכות המלצה/ רשתות חברתיות/ מנועי חיפוש ומשתמשות במערכות לומדות. הצלחתם? יופי, אתם מוכנים לשיעורי הבית).\n\nהשורה התחתונה: נושא מעניין, ביצוע יכל להשתפר.", "timestamp": 1614685031733}, {"author": "א.י.", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "סמינר על קודי מחיקות במערכות אחסון מבוזרות\n\nשם האחראי: איתן יעקובי\nהשורה התחתונה: סמינר מעניין ונחמד.  בזוגות. עוזר לבוא עם ידע קודם בתורת הצפינה, אבל לא הכרחי. כן הכרחי לדעת מודרנית לכל מאמר. המאמרים בקורס מחולקים בין מאמרים תיאורטיים (מתמטי, בעיקר לינארית ומודרנית) ומאמרים פרקטיים (גם קצת תיאוריה, אבל הרבה תוצאות של ניסויים במערכות). המאמרים יחסית קריאים ודורשים כשבוע של הכנה לפני ההרצאה.\n\nמטלות מעבר להכנת הסמינר בשבוע שהזוג שלך מעביר - נוכחות חובה ועונים על שאלון כלשהו כל שבוע כ\"הקדמה\" לסמינר הבא. לוקח 15 דק' ביום", "timestamp": 1626953350420}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: \nחומר מעניין בטירוף בהתחלה, ואז מתחיל לחזור על עצמו איפשהו משבוע 7 ועד הסוף ונהיה קצת משעמם.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \nאין\nשעורי הבית: בקטנה ממש, לקרוא חלק מהמאר לפני ולהדגיש מטלה קטנה באינטרנט כדי לבוא יותר מוכנים להרצאות\n\nהמבחן: אין\n\nהשורה התחתונה: נחכה לציונים אבל אם זה נשאר כמו סמסטרים קודמים אז החומר אחלה והציונים סבבה ואיתן ממש חמוד, מומלץ.\nהערה:\nהקורונה דחתה חלק מהשיעורים לתוך תקופת מבחנים.", "timestamp": 1658483324687}]}