{"posts": [{"author": "Alon", "semester": "201902", "text": "יש בקורס כמה יבשים, וסה\"כ הוא מדבר על דרכים לנהל ולייעל את המטמון ואת הגישות לזיכרון. רוב האנשים שעושים את הקורס עושים אותו כי הם חייבים (תואר 4 שנתי) או כי הוא קל (לדעתי הקורס היה לא מעניין וחבל שלא לקחתי משהו מעניין יותר).", "timestamp": 1595525222000}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "201802", "text": "שם המרצה: רוני פרוטנשוק(אם אני זוכר נכון)\nחוות דעת - הרצאות:  מרצה נחמד, אבל מעביר הרצאות די משעמם ומסתבך לא אחת, קשה לעקוב. גם החומר לא מעניין שזו חלק מהבעיה.\nהחומר הוא בעיקר כל מיני דרכים לייעל שימוש בזיכרון, הרצת פקודות שלא לפי הסדר ועניינים כאלה בחומרה. נשמע מעניין אבל בפועל מאוד מאוד טכני.\n\nשם המתרגל/ת: אבירם אמבר\nחוות דעת - תרגולים: המתרגל עשה אחלה עבודה, גם התרגולים טובים. הבעיה היא בסילבוס-אי אפשר לעשות תרגולים מעניינים בקורס כל כך משעמם וטכני.\n\nשעורי הבית: עומס בינוני, טכניים ומשעממים.  4 תרגילים יבשים שרוב השאלות דומות למבחן שגם הוא מאוד מעצבן(אפרט על זה בהמשך), 20% תקף. בעיקר מעקב אחרי טבלאות גדולות של זיכרון/שלבי מעבדים.\n\nהמבחן: שאלות טכניות, חופרות למדי לדעתי ומעצבנות של מעקב אחרי טבלאות ומצבי זיכרון וזמני ריצה. לעיתים דווקא יש שאלות יותר מקוריות-וזה לא בהכרח לטובה כי אפשר ליפול גם בהן. יש לציין שהמתרגלים ב2019 הצליחו להוביל לכך שהמבחן יהיה קצת פחות טכני.\nהיו סמסטרים שלא צריך להבין הרבה מהחומר רק לדעת לפתור את השאלות הסופר טכניות כדי להצליח במבחן.\nמי שמצליח במבחן הזה לקבל 100 הוא למעשה מחשב ויש חשש שלא יעבור מבחן טיורינג...\n\nהשורה התחתונה:  רק למי שחובה עבורו, או רוצה קורסי המשך, או חייב נקודות בלי עומס גבוה ושאפשר ללמוד למבחן בלי לעקוב במשך הסמסטר.", "timestamp": 1609621182272}, {"author": "רז הדרי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליהו\nחוות דעת - הרצאות: \nהרצאות מעניינות והמרצה מעולה. יש נושאים בהרצאות שלא תמיד נכנסים למבחן .\nשם המתרגל/ת: אלעד שטייגמן\nחוות דעת - תרגולים: \nמתרגל תותח, ממליץ מאוד ללכת אליו.\nשעורי הבית: \nלא קשים במיוחד, אם עוקבים אחרי התרגולים אפשר לעשות אותם בלי הרבה בעיה. הם מכינים טוב מאוד לקראת המבחן.\nהמבחן: \nמבחן די חזרתי מבחינת מבנה הבחינה, בסמסטר 19-20 השתנה המבנה קצת ונהיה יותר קשה.\nהשורה התחתונה: \nקורס לא עמוס, אני לקחתי בתור חובה בהנדסת תוכנה אבל ממליץ גם כבחירה. רוב הקורס מדבר על זיכרון cache, פניות לזיכרון וביצוע מקבילי של פעולות במעבד.", "timestamp": 1612622200796}, {"author": "asaf bialystok", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליהוא רפפורט\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, חשוב לראות אותן לדעתי. \n\nשם המתרגל/ת: אלעד שטיגמן \nחוות דעת - תרגולים: תרגולים מעולים, אלעד מתרגל ממש טוב, כשהוא פותר שאלות רואים שהוא מבין מה יבלבל סטודנטים והוא יודע על מה להתעכב\n\nשעורי הבית: \n4 גליונות יבשים, די פשוטים, היו ציונים גבוהים. לא לוקחים המון זמן. לעתים מנוסחים על הפנים ולוקח זמן עד שמקבלים תשובות מהסגל. \n\nהמבחן: \nלא כזה פשוט. צריך לעשות הרבה מבחנים ולהכיר טוב את הנושאים ששואלים עליהם. צריך לומר שבקורס יש די הרבה חומר אבל בסוף במבחן שואלים על כמה נושאים ספציפיים אז תוך כדי שפותרים מבחנים אפשר להבין אילו נושאים כדאי להבין טוב ומה פחות קריטי. \n\nהשורה התחתונה: \nקורס מעניין מאוד לדעתי, למתכנת הממוצע הוא די העשרתי כי ממש לומדים על מיקרו-ארכיטקטורה של מעבד, וזה לא משהו שאיש תוכנה פוגש ביום יום שלו. לא עמוס לאורך הסמסטר אבל מבחן לא טריוויאלי.", "timestamp": 1613554224158}, {"author": "בן גביר", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: לא זוכר\nחוות דעת - הרצאות: לא רלוונטי הם גם ככה לא חשובות ולא צריך לראות אותם.\n\nשם המתרגל/ת: אלעד שטייגמן\nחוות דעת - תרגולים: המלך של העולם הזה.\n\nשעורי הבית: קלים מאוד, גג יומיים.\n\nהמבחן: טכני רצח, חשוב לתרגל הרבה ולהבין.\n\nהשורה התחתונה: משעמם אבל קל וגם המבחן לא קשה. ממליץ לקחת יש ציונים גבוהים והחומר מאוד קליל.", "timestamp": 1620896077761}, {"author": "מתרגל באת\"מ & מואלי", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שעורי הבית:  טכני הרבה עד מאוד. לא לוקחים הרבה זמן, אבל מומלץ להשוות עם אנשים אחרים כי לא תמיד מבינים את השאלות נכון.\n\nהמבחן:  נוראי. ללמוד למבחן זה כמו לנסות לפתור 2 משוואות עם 10 נעלמים. לא ברור מה מתכוונים וגם אם כן ברור, אז צריך להתייחס לכל מקרה קצה שצוין/לא צוין בשאלה ולקוות שגם הסגל תפס בדיוק את אותם מקרים.\n\nהשורה התחתונה: קורס עם חומר תאורטי סביר ויכול לעניין אנשים, אבל שמנסים להביא את זה לפתרון של שאלה קונקרטית יוצא סלט של הנחות שלא ברור מאיפה הן באו ולאן הן הולכות.", "timestamp": 1626619101480}, {"author": "A", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ליהוא רפופורט\nחוות דעת - הרצאות: מאוד ברור ומעביר את החומר בצורה שקל לקלוט אותו. ההרצאות איטיות, כי הוא חוזר על דברים הרבה פעמים בניסוחים שונים, בתקווה להגיע לכמה שיותר סטודנטים. בסך הכל היה די מעניין ועשה חשק לבדוק עוד כיוונים בתחום.\n\nשם המתרגל/ת: פרנק סלה\nחוות דעת - תרגולים: פרנק מאוד נחמד, למרות שההקלטות שלו לא ברורות בכלל. בכיתה הוא היה מעולה ומאוד מומלץ לבוא אליו - נותן טיפים איך לפתור שאלות ברמת מבחן, וגם מסביר באופן כללי איך לגשת לדברים בקורס.\n\nשעורי הבית: ברמה של מבחן ומאוד מלמדים ועוזרים להתמיע את החומר. הבעיה, שכמו במבחן, יש ניסוחים בעיתיים.\n\nהמבחן: מאוד מאוד טכני. לא דורש הבנה מעמיקה של החומר, רק להבין איך לפתור סוגים שונים של שאלות שחוזרות על עצמן. יום אחד של מעבר זריז על החומר ועוד 3-4 ימים של פתירת מבחנים זה די והותר.\n\nהשורה התחתונה: אחלה קורס. יחסית לקורסי בחירה בפקולטה, כנראה הקורס הכי קל. אבל באותה נשימה, גם הקורס הכי טכני ו\"מציק\" שיש מבחינת שיעורי הבית והמבחן.", "timestamp": 1644572934137}, {"author": "Mips", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ליהוא\nחוות דעת - הרצאות: משעממות, אפשר להסתדר בלי\n\nשם המתרגל/ת: פרנק סלה\nחוות דעת - תרגולים: בינוני פלוס, השקפים של התרגולים טובים ויש הקלטות מסמסטרים קודמים למתרגלים אחרים.\n\nשעורי הבית: יבשים, לא דורשים הרבה זמן לפתור\n\nהמבחן: מבחן מועד א' היה קל מדי, מועד ב' וג' היו קשים בטירוף, וגם אחרי הפקטור (ב': 18, ג': 10) הממוצע נמוך משמעותית ממועד א'. (5 ו 11 נקודות בהתאמה)\n\nהשורה התחתונה: לא לקחת בכלל בחורף. אם כבר לקחתם, אז תעשו הכל כדי לגשת למועד א'.", "timestamp": 1649335385485}, {"author": "מיכאל", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אבי מנדלסון\nחוות דעת - הרצאות: לא השתתפתי, אין לי מושג.\n\nשם המתרגל/ת: שליו ריסין\nחוות דעת - תרגולים: טוב מאוד.\n\nשעורי הבית: יש 5 גיליונות יבשים מבוססים ברובם על מבחני עבר. בסמסטר הזה היו בהם הרבה טעויות, ניסוחים לא בהכרח ברורים ותיקונים מאוחרים מה שהפך אותם לסיוט.  \n\nהמבחן: היה מבחן די מזעזע. הוא היה ארוך מידי וכלל שאלות הזויות עם מידע רלוונטי, בדומה לתרגילי הבית גם במבחן היו ניסוחים לא בהכרח ברורים ובשעה הראשונה של המבחן היו הרבה תיקונים והבהרות. בסיכום העניינים היה פקטור שחיפה על זה.\n\nהשורה התחתונה: אני לקחתי את הקורס במקביל לעבודה במשרה מלאה, המטרה הייתה להשקיע מינימום במהלך הסמסטר ולעבור את הקורס, המטרה הושגה.\nמי שאלו הם שיקוליו אני ממליץ בחום.", "timestamp": 1658060594126}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אבי מנדלסון\nחוות דעת - הרצאות: הלכתי בדיוק ל2 הרצאות שלו לפני שהתייאשתי לחלוטין. מעביר את ההרצאות בצורה מאוד איטית וחסרת כריזמה, מאוד קשה להתרכז ככה.\nיש נושאים שאפשר היה לראות שהוא לא כל כך שולט בהם היטב ויש נושאים שאפשר היה לראות שהוא מבין בהם מצוין.\n\nיאמר לזכותו שהוא הקליט כל הרצאה והרצאה ותמיד בא לקראת הסטודנטים וביקש שישאלו אותו שאלות, כך שמבחינה התנהלותית הוא היה הוגן מאוד.\n\nשם המתרגל/ת: שליו ריסין\nחוות דעת - תרגולים: בסדר.\nהתרגולים היו סבירים, עד כמה שאפשר עם הקורס הזה. לפעמים היה מורגש אחד מהשניים:\n1. שליו יודע את החומר כל כך טוב שיש דקויות שהוא מדלג עליהן כי הוא לא חושב שסטודנטים צריכים הבהרה מסוימת בנושא כלשהו.\n2. שליו לא יודע את החומר ולכן מדלג על דקויות אלה.\nעד היום אני לא כל כך יודע מה מהם נכון יותר. אני משער שהאמת איפשהו באמצע. כמתרגל, הרגשתי שהוא כן מחויב להעביר את החומר בצורה טובה אך משהו כן היה משתבש קצת בתקשורת מול הסטודנטים.\n\nשעורי הבית: 5 תרגילי בית יבשים.\nהראשונים סבירים אבל הניסוח בתרגיל בית 4 היה מזעזע ודרש עשר תיקונים לפחות מה שמאוד הפריע להתקדם בו כראוי. \nהתרגילים לא עמוסים, אפשר לשבת ולסגור אותם ביום עבודה אחד.\n\nהמבחן: נחמד. השאלות היו סבירות (למעט אחת שפוקטרה בהתאם) והכל היה יחסית ברור. קצת מעצבן ללמוד למבחן היות וכל שנה מתחלפים המתרגלים השונים וגם המרצה האחראי לא כל כך קבוע.\n\nהשורה התחתונה: \nקורס קצת מגעיל למי שלא מחפש טכניקה במבנה המחשב. בפועל כמות התיאוריה מינורית ומצטמצמת עוד יותר כשלומדים למבחן וקולטים את החזרתיות של השאלות השונות. גם כשקולטים את זה, זה לא הופך את הלמידה לסבירה. אני פחות נהניתי מהקורס ופחות ממליץ.", "timestamp": 1658839829985}, {"author": "YT", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ליהוא רפפורט\nחוות דעת - הרצאות: ראיתי מוקלטים מסמסטר חורף 20-21 מהזום. איכות ההקלטות טובה מהסמסטר הזה. לא הרגשתי שההרצאות הוסיפו איזשהו ידע ולדעתי לגמרי מספיק תרגולים. ליהוא מרצה סבבה לגמרי.\n\nשם המתרגל/ת: אלעד שטיגמן\nחוות דעת - תרגולים: גם מוקלט. אחלה מתרגל שמסביר את החומר בצורה טובה.\n\nשעורי הבית: 4 גיליוניות יבשים, קלילים וזהים לסמסטרים קודמים. פחות מחצי יום עבודה לעבור על החומר הרלונטי ולהבין מה אתה מרפרנס.\n\nהמבחן: אין הרבה קשר בין חומר הקורס למבחן והרבה דברים לומדים תוך כדי הלמידה עצמה. היומיים-שלוש הראשונים של הלמידה קצת קשים אבל לאחר מכן המבחנים מאד מתחילים לחזור על עצמם. מבנה הבחינה כל סמסטר ממש זהה. \n\nהשורה התחתונה: סה\"כ קורס בחירה מאד שווה למי שרוצה כמה שפחות השקעה ויש אחלה פוטנציאל להוציא ציון טוב אם פותרים הרבה מבחנים לפני המבחן.", "timestamp": 1676660433447}, {"author": "MESI", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ליהוא רפפורט\nחוות דעת - הרצאות: בהרצאות הראשונות קצת משעמם (בעיקר כי החומר משעמם) אבל כשעברנו לנושאים קצת יותר מעניינים ליהוא מאוד התחבב עלי. מדבר מאוד בגובה העיניים ויש לו ידע עצום ורלוונטי מהתעשייה. בסך הכל יש מעט חומר למבחן - זיכרון מטמון, out of order execution, זיכרון וירטואלי, branch prediction, power. השיעורים האלה די משעממים. אבל יש עוד הרבה נושאים שעוברים בהרצאות ובפועל לא הייתה עליהם אף שאלה באף מבחן בחורף באף מבחן שיצא לי לראות וההרצאות עם הנושאים האלה מעניינות, רלוונטיות ואפילו מהנות.\n\nשם המתרגל/ת: אנטון מוקלט\nחוות דעת - תרגולים: התרגולים בקורס מוזרים, לא מאוד מסודרים ולא מאוד ברורים. אבל ההקלטות של אנטון סבבה ברובם.\n\nשעורי הבית: 4 גליונות, הראשון היה קצת ארוך אבל השאר דרשו 3-4 שעות ולא מאוד קשים.\n\nהמבחן: השאיר לי טעם רע בפה. אין פתרונות רשמיים לאף מבחן (יש למבחן אחד אבל יש המון טעויות בפתרון). סריקות לא מועילות כי אין הערות של הבודק על מה הטעות ואיפה. הלמידה למבחן היא מאוד מתסכלת כי אין איך ללמוד ממבחני עבר ואין דרך להבין אם הפתרון שלך נכון או לא. לגבי המבחן עצמו - כמו שאמרתי יש כמה שאלות קבועות עם שינוי נתונים, לא שזה עוזר במיוחד כי אתה לא יודע מה הדרך הנכונה לפתור אותם. שאלות די מסריחות שאין בהם שום בדיקה של הבנה אלא סתם בואו תעשו כמה חישובים כדי שיהיה לנו על מה להוריד נקודות.\n\nהשורה התחתונה: לדעתי קורס חשוב ומעניין. יש לציין ששם הקורס הוא מבנה מחשבים אבל בפועל מדברים כמעט אך ורק עד מבנה מעבד כפי שאינטל תכננה (הסגל בחורף הוא מהנדסי אינטל). אחלה הרצאות, תרגולים ומבחן על הפנים, אבל עדיין ממליץ.", "timestamp": 1676667251885}, {"author": "OO", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: ליהוא רפפורט\nחוות דעת - הרצאות: ליהוא מרצה טוב, בעל ידע רב. לא תמיד ההרצאות היו הכי מעניינות אבל החומר לא מסובך מדי.\n\nהתנהלות הקורס: הקורס היה מנוהל בצורה ממש לא טובה, אין מענה מהמתרגלים ומהמרצה במייל, הייתה שעת קבלה אחת בלבד לפני כל מועד, הלמידה למבחן הייתה מתסכלת כי אין פתרונות רשמיים למבחנים (לא ממש ברור למה, זה מבחן שהתשובות בו הן מספריות ומדויקות) ואין דרך אפקטיבית ללמוד מסריקות כי אנשים עונים על מה שבא להם ומקבלים ניקוד (במיוחד בשאלות של מטמונים וזיכרון וירטואלי)\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים:\n\nשעורי הבית: לא הכי עמוסים, לפעמים נמרחו במשך שבוע או שבועיים בגלל שאלה שלא הייתה ברורה\\לא מנוסחת טוב ולוקח זמן רב עד שמקבלים מענה כלשהו מהסגל\n\nהמבחן: כמו שיעורי הבית, ניסוחים לא ברורים - תתכוננו לשאול הרבה שאלות במהלך המבחן\n\nהשורה התחתונה: קורס לא עמוס מדי במהלך הסמסטר, למבחן מספיק ללמוד 6 ימים, מומלץ להדפיס את כל ההרצאות כי לפעמים יש סעיף שקשור לחומר מההרצאה שלא מופיע במבחנים אחרים. (במועד א' היה סעיף על side channel attack)\nתלמדו עם חברים ותחסכו לעצמכם תסכול אישי ותהיו מתוסכלים בקבוצה", "timestamp": 1679731941529}, {"author": "Ana", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: Lihu Rappoport\nחוות דעת - הרצאות: מוקלט. \nיכולים לראות שהוא אוהב מה הוא עושה, הוא מבין מה הוא מלמד ומלמד אותו טוב, זה מבחינה לימודית.\nמבחינת שהוא המרצה האחראי: לדעתי הוא רע, מאוד. פנינו לו יותר מפעם אחת, לא מקשיב ולא מתחשב. \n\nשם המתרגל/ת: Anton hanna\nחוות דעת - תרגולים: הייתי נוכחה בכל התרגולים שלו, הדבר היחיד החיובי בקורס זה אנטון. דואג שכולם יבינו את החומר. יש גם מוקלט כך שאם פספסתי משהו אז בקלות חוזרת על זה מסמסטרים קודמים, הוא מעולה:). \nFriendly, passionate, devoted.\n\nשעורי הבית: קצר, אפשר לרפרנס גם כן בקלות. \n\nהמבחן: חברי הסגל הם עובדי אינטל במשרה מלאה, לא יודעת בכלל למה הם מלמדים, אבל יש כן תחושה שהקורס לא חשוב להם מספיק כדי לדאוג לסטונטים. זה הקורס הראשון שהיה לי תחושה כזאת של התעוללות, מבחינת מבחן ומבחינת התייחסות הסגל.\nהיה במבחן עצמו טעויות לא קטנות, בשני המועדים, מרגיש כמו מי שכתב את השאלה לא קרא אותה עוד פעם. \nהיה מאוד ארוך גם כן, 6 שאלות כך שהמשקל של ההשקעה לעומת הציון של השאלה לא מוצדק, ואי אפשר לוותר כי כך היה כל המבחן. \nפנינו לליהוא שהיה טעות במבחן מה ששרף זמן יקר של סטודנטים על שאלה עיקרית במבחן, לא התחשב. \nהקורס מבחינת חומר הוא די מעניין, אבל לא ממליצה להתעסק עם ליהוא, לא יודעת מה קורה באביב אבל שווה לבדוק את האופציה לקחת באביב, גם כן הממוצע יותר טוב מאשר חורף.\n\nהשורה התחתונה: לקחת מבחינת חומר, לא לקחת בחורף.", "timestamp": 1679965036788}, {"author": "El", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: אבי מנדלסון\nחוות דעת - הרצאות: חסר כריזמה, קשה מאוד לעקוב, מהלך ההרצאה מבולגן, יוצא להסברים של חצי שעה עקב שאלה של מישהו עם קשר קטן מאוד לחומר. מצד שני כדאי לעבור על החומר מלבד התרגולים (יכול להופיע במבחן).\n\nשם המתרגל/ת: דן\nחוות דעת - תרגולים: התרגולים היו יחסית קטנים אז היה הרבה מקום לשאול שאלות ודן ענה באדיבות. המצגות די טובות והתרגול מכסה את רוב החומר של הקורס. ממליצה ממש ללכת\n\nשעורי הבית: ארוכים, מעייפים, אין סוף טבלאות ופרטים קטנים. יש רפרנס לחלק גדול והרבה מהשאלות מזכירות את המבחן אז כדאי לעשות כי זה תרגול טוב של החומר.\n\nהמבחן: מזעזע. יש חומר פתוח אבל הוא כל כך ארוך שזה מרגיש כמו פסיכומטרי, מבחן נגד הזמן. אין זמן להסתכל בחומר הפתוח וזה גם לא יעזור לכם יותר מידי. השאלות לא ברורות בכלל ומרגיש שבעיקר ניסו להוריד את הממוצע.\n\nהשורה התחתונה:  אם לא חייבים לעשות את הקורס, לא לעשות. לא מועבר בצורה מעניינת, מבחן מזעזע, לא ממליצה. אולי בחורף (עובר קצת שונה עם סגל שונה).", "timestamp": 1690364068583}, {"author": "מטמון", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אבי מנדלסון\nחוות דעת - הרצאות: אבי מאוד זמין לשאלות, גם במייל וגם פרונטלית, וניכר שהוא שולט מאוד בחומר ומתעסק בו ביומיום.\nבכלל, הוא סבבה עם לגלוש לנושאים אחרים, ולהגמיש קצת את החומר של ההרצאות, בהתאם לעניין של הסטודנטים.\n\nאמנם ההרצאות לא ממש מובנות, והמצגות בכלל לא, אבל אפשר להסתכל על ההרצאה כהעשרה, ועל התרגול כהרצאה אמיתית.\nשם המתרגל/ת: שליו ריסין, יונתן שקבתור (מוקלט)\nחוות דעת - תרגולים: יונתן היה סבבה; שליו היה קצת מהוסס בנוגע לחומר. סה\"כ התרגולים לא קשים.\n\nשעורי הבית: סבבה. הרבה חישובים, אבל עדיין משמעותית יותר קל מהיבשים בכל קורס חובה של מדמ\"ח. לא יותר מיום לכל גיליון.\n\nהמבחן: המבחן של הקורס הזה הוא הדבר הכי הזוי שראיתי בתואר. בייסקלי כל מבחן מתחיל בהצהרה \"אם אתם מרגישים שחסר נתון לשאלה, תוסיפו הנחת יסוד, ואם היא סבירה אנחנו נאשר\", שזה נשמע כאילו באים לקראתנו - עד שמבינים שזה תחליף ללעשות proof read למבחן שאתם כותבים, ופשוט לתת לי לכתוב את המבחן וגם לפתור אותו. המבחן באמת נראה כמו טיוטה ראשונית, מלא בשגיאות לשוניות, דו משמעות וחוסר בהירות.\n\nזה גם מסתדר עם העובדה שעוד לפני שהמבחן התחיל תיקנו 2 טעויות על הלוח, ואז עוד 2, אבל לזה כבר התרגלנו.\n\nאגב, הסמסטר הייתה הפעם הראשונה במבחן ששאלו על נושא רק מההרצאות, אבל זה היה סביר יחסית, כי יש חומר פתוח והתשובה הופיעה ממש בשקפים\n\nהשורה התחתונה: סך הכל זה באמת לא קורס קשה, ובכלל לא עמוס. קורס סבבה לסגור איתו את התואר.", "timestamp": 1690403024562}, {"author": "~~~", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "תעשו לעצמכם טובה ותברחו. הקורס לא שווה יותר. מבחן זוועתי, הוראה לקויה וממוצע נמוך.\n\nשמחתי לעזור :)", "timestamp": 1704395610919}, {"author": "שולמית", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אבי\nחוות דעת - הרצאות: ראיתי מוקלט. מאוד לא ברור. די חבל על הזמן. בסך הכול הוא נחמד ומנסה לעשות את המיטב, אבל לא ברור.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: מעולים.\n\nשעורי הבית: שיעורי בית לא עמוסים בכלל. אפשר לסיים כל גיליון תוך יום אחד. 20% תקף.\n\nהמבחן: מבחן לא ברור בכלל. ארוך מאוד. שאלות לא מובנות. אפשר ליפול חזק רק על הבנת השאלות.\n\nהשורה התחתונה: קורס לא עמוס בכלל. החומר די מעניין ואפשר ללמוד בכיף,  אבל המבחן בסוף הוא מאוד לא ברור. לקחת רק אם מוכנים לזה שאפשר ליפול במבחן ואז לעשות מועד ב'. למרות שבסופו של דבר אפשר לקבל אחלה של ציון גם בלי הרבה להשקיע. לשיקולכם.", "timestamp": 1705227029017}, {"author": "cache me outside", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: ליהוא\nחוות דעת - הרצאות:\nבמילה אחת - משעמם. הייתי בכמה הרצאות פרונטליות והשאר ממוקלטים של סמסטר קורונה. \n\nשם המתרגל/ת: איתי רביד מוקלט.\nחוות דעת - תרגולים: \nרלוונטים למבחן, אבל די משעממים.\n\nשעורי הבית: הסמסטר, בגלל המצב, היו רק 3 תרגילים במקום 4. אבל בניגוד לסמסטרים קודמים הם החליטו לא למחזר ולכתוב שאלות עם טעויות וניסוחים לא ברורים. בגלל שהמענה במייל היה כמעט לא קיים, בחלק מהתרגילים היינו צריכים לחכות בערך שבוע עד שהצלחנו להתחיל בכלל את התרגיל ובתרגיל האחרון אפילו קיבלנו הארכה בגלל טעות שלהם.\nבאופן כללי הגיליונות רלוונטים למבחן - חשוב לעשות אותם. \nבסופו של דבר, מהרגע שהתחלנו לפתור את הגיליונות (בזוגות) לקח לנו כמה שעות טובות לסיים אותם - בערך חצי יום-יום לכל גיליון.\nכראוי לסגל, לא קיבלנו פידבק על תרגילי הבית עד כשבוע לפני המבחן וגם מה שקיבלנו היה בלי הערות אלא רק ציון.\n\nהמבחן: כרגיל, ניסוחים לא ברורים. לפני שהמבחן התחיל כבר היו תיקונים - ליהוא נכנס לכל הכיתות וכתב את התיקונים למבחן. המבחן בפני עצמו היה סטנדרטי יחסית אבל הבדיקה הייתה הזויה. נראה שלא היה להם מפתח בדיקה - סטודנטים קיבלו ניקוד שונה עבור אותן תשובות ובאופן כללי נראה שקטלו אותנו יותר מבד\"כ.\n\nהשורה התחתונה: מי שאמר שזה קורס נחמד לסגור איתו את התואר.... למה?\nאני בד\"כ לא נמצא באינטראקציה עם הסגל וחשבתי שלא יפריע לי חוסר תשומת לב מהסגל, אבל מסתבר שטעיתי.\nבקשר לחומר עצמו, כל נושא בנפרד לא מאוד מסובך בפני עצמו, אבל כשמתחילים לשלב בין נושאים אפשר ללכת לאיבוד בקלות.\nאין לי מושג עד כמה זה רלוונטי לתעשייה, אלא אם כן אתם מתכננים לעבוד בצוות של ליהוא באינטל.", "timestamp": 1715609339324}, {"author": "dram", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "קורס הזיה בדיוק כמו החברה שלהם, רק מראה מדוע החברה ההזויה הזאתי הולכת לאיבוד.\nתדמיינו לכם שיש לי אותו פתרון 1:1 כמו למישהו שקיבל 100, קיבלתי 6 מ-13 לשאלה והוא קיבל ניקוד מלא.\nוהליהו הזה,  no wonder הוא אוכל לבד בהפסקת האוכל באינטל. \nגועל נפש של קורס, של התנהלות, ושל בדיקה. \nאם המטרה שלכם בחיים אינה לעבוד באינטל, אל תיקחו, ואפילו, קטסטרופה אם המטרה שלכם בחיים היא לעבוד שם. \nלא חשבתי שבחיים אגיד את זה, אבל עדיף לקחת עם החברה מהטכניון, ת׳אנק מי ליתר", "timestamp": 1715737231203}, {"author": "...", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "אני אתחיל מזה שחבל שסגל כזה מנהל קורס בטכניון..\nסגל עם אפס מקצוענות, ואפס אכפתיות. זה הוא הסגל הכי אדיש שיצא לי לפגוש במהלך התואר וזה ממש לא מתאים לטכניון.\nלי אישית הורידו יותר נקודות יותר ממספר הנקודות שיש לסעיף בגלל שבמקום לבצע שני שלבים במקביל ביצעתי אותם סדרתית.\nועל אף שהשאלה באה לבדוק את ההבנה של נושא מסוים (שממש מתבטאת בפתרונות שלנו) הורידו לנו יותר מחצי השאלה :(. \nלעומת זאת בשנים קודמות ניתן לראות סריקות של סטודנטים שנתנו להם ניקוד מלא והתעלמו מטעויות קטנות כאלה או שהורידו להם מקסימום נקודה אחת על זה, ובגלל זה אני אומר שהסגל הזה הוא סגל עם אפס מקצוענות והכי לא ענייני.. אין איזשהו מפתח או משהו שמכוון את הבודקים.. זה תלוי אך ורק במצב הרוח של אותו בודק באותו יום.\nמאכזב מאוד.", "timestamp": 1716123456133}, {"author": "OOO", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ליהוא רפפורט\nחוות דעת - הרצאות: מעניינות וברורות. סך הכל אהבתי את החומר עצמו, למרות שבסוף בפתירת השאלות בשיעורי הבית ובמבחן נכנסים לפינות מעצבנות.\n\nשם המתרגל/ת: מוקלטים של אלעד לרוב\nחוות דעת - תרגולים: סהכ אחלה, כבר לא מתרגל היום אבל החומר לא השתנה ממש\n\nשעורי הבית: סבירים, 3 גליונות (בגלל סמסטר מקוצר של 12 שבועות) שכל אחד מהם יומיים עבודה אולי כולל השוואות עם אחרים כדי לקבל ציון טוב.\n\nהמבחן: מעצבן, צריך לפתור הרבה שאלות ממבחני עבר כדי להכיר כל מיני טריקים ואפשר ליפול ממש הרבה על קטנות. צריך הרבה פעמים לחשב ולהבין בדיוק מה המצב של המעבד\\זיכרון ולא לטעות בפסיק. אחרי הרבה תרגול (בערך 10 מבחני עבר הייתי אומר, בשבילי ככה עבד) אפשר לקבל ציון טוב.  בנוסף, הסגל לא ממש נותן הערות על שאלות שטעית בהם וזה די מעצבן, ואחרי תלונה זה לא ממש השתנה. אני אישית נפלתי במועד א' כי חשבתי שהעיקר זה שאני מבין את החומר התיאורטי ולא תירגלתי מספיק, ואז הצלחתי לשפר משמעותית לציון סבבה במועד ב'.\n\nהשורה התחתונה: מומלץ מבחינת עניין בחומר התיאורטי והעומס, פחות מומלץ מבחינת תוכן השאלות שמביאים, אם כי ניתן לשרוד ולקבל ציון בסדר. הרבה סטודנטים התלוננו על יחס של הסגל, אני יחסית לא הרגשתי כי גם ככה לרוב אני לא באינטראקציה עם הסגל כל כך.", "timestamp": 1718439979273}]}