{"posts": [{"author": "קומפיילר", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "קורס מעצבן", "timestamp": 1599235092440}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: יודע את החומר, אבל לא מרצה טוב, מתרברב ללא צורך בקושי של הקורס. אין שעות קבלה. לפחות מענה טוב באתר הקורס.\n\nשם המתרגל/ת: שניהם\nחוות דעת - תרגולים: התרגולים מוקלטים מראש, בלי אפשרות לשאול שאלות. יש סדנאות מוזרות שלא מוקלטות בהן פותרים שאלה(זה למעשה הוספת שעות לקורס שלא באופן תקני למספר הנקודות שלו). בסדנאות פותרים בו זמנית כולם את השאלה בלוח משותף בלי שאפשר להבין כלום. נורא. יש לציין שהם נחמדים המתרגלים.\n\nשעורי הבית:  נורא ואיום. קורס עמוס ביותר, שמחולק באופן לא סימטרי על הסמסטר שהסוף נוראי לצד שבועות רגועים. תרגילים ממוחזרים כבר שנים על שנים(תמצאו במי להיעזר-זה ממש יעזור) ובנויים רע תוך שימוש בכלים ענתיקים שגורמים לקושי לא נחוץ והתעסקות בתפל במקום בעיקר, לדעתי לפחות. אצלנו הוסיפו תוספת לתרגיל החמישי שבמקום להיות משהו קטן למנוע העתקה הפך למפלצת אסמבלי של לממש סט!\nפידבק ניתן באיחור רב מאוד.\nיש לציין לטובה מענה מהיר על השאלות, אם כי גם פה נציין שהיעדר שעות קבלה מקשה מאוד.\n\nהמבחן:  עוד לא היה המבחן אבל מהלמידה אליו-יש שאלות הזויות בחומר שלא תמיד נלמד כמו שצריך. קשה מאוד להבין איך פותרים \"פורמלית\", שונה מאוד מתרגילי הבית. לפחות לרוב \nהסטודנטים עוברים אם כי לא בציון גבוה כל כך.\n\nהשורה התחתונה:  קורס גרוע מאוד-כל מי שיכול להתרחק כמו מאש. השאר-לפנות המון זמן ללמוד למבחן, והמון זמן לתרגילים, ולהשיג סיוע מסטודנטי שנים קודמות.", "timestamp": 1613492156739}, {"author": "ד", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: \nניכר ששחר מתחבר לחומר המועבר בקורס אך אינו המרצה הברור ביותר.\nחלקים נכבדים מהרצאות מסוימות התבזבזו על דוגמאות באתר שהוא בנה והיה נראה שסטודנטים מתקשים לעקוב אחרי הדוגמאות.\nבשלוש ההרצאות האחרונות רצנו על החומר ועל אף שנאמר שלא נישאל במבחן על חלק מהנלמד בגדול כן נשאלנו.\n\nשם המתרגל/ת: עומר בלחסן\nחוות דעת - תרגולים: התרגולים היו הקלטה קצרה של הקראה יבשה של המצגות באתר. היו \"כיתות הפוכות\" שהמתרגלים סירבו להקליט על אף שפתרו בהן שאלות יחד עם הסטודנטים.\nהכיתות ההפוכות לא התנהלו בצורה מיטבית משום שאנשים נכנסו אחד לשני בדברים ולא הספקנו יותר מדי.\n\nשעורי הבית: ישנם ארבעה שיעורי בית רטובים ושיעור בית אחד יבש. \n\nשיעורי הבית הרטובים מתבססים אחד על השני. הראשונים לא לוקחים המון זמן והאחרונים כן (האחרון לוקח המון זמן). \n\nהמבחן: המבחנים קשים. הקורס לא מכין אותנו למבחן במהלך הסמסטר שכן השאלות שונות לחלוטין משיעורי הבית (פרט לשאלה אחת שמתבססת על הרטובים). ייתכן כי ניתן לפתור את שאלות המבחן בהצלחה אם מספיקים לפתור מספיק מבחנים בעלי שאלות מגוונות ולהיתקל במקרה בשאלות בעלת מבנה דומה.\n\nהשורה התחתונה: קורס עם כמות חומר גדולה שיש לו סיכוי להיות מעניין אך הוא מרגיש מיושן. \nלדעתי הקורס יכול להשתפר אם יוסיפו תרגילי בית דומים למבחנים שאפשר לתרגל בעזרתם את החומר הנלמד.", "timestamp": 1614178040446}, {"author": "D.B", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: \nשחר מרצה מעולה! מסוג המרצים שמבין באמת את הנושא וכל פינה בחומר בצורה הכי מדויקת שיש , ועושה מעל ומעבר כדי לנסות להעביר את החומר לסטודנטים. מתוך הבנה שיש המון חומר וחלקו קשה להבנה, המצגות בנויות בהשקעה מטורפת, עם אינסוף דוגמאות ואנימציות. בנוסף שחר בנה אתר שהוא מדגים בו בלייב תוך כדי ההרצאות קונספטים חשובים. אני מודה שלפעמים לעקוב אחרי זה בלייב זה קשה מאד, אבל במיוחד כשהכל מוקלט זה מדהים שאפשר לחזור אחר כך בהכנה למבחן וכל האסימונים לאט לאט נופלים. \n\nשם המתרגל/ת: מתן פלד\nחוות דעת - תרגולים: \nמזעזע. בחסות הקורונה המתרגלים החליטו להקל אל החיים שלהם כמה שאפשר. קודם כל, תמיד התרגולים בקורס הזה לא מותאמים ל-50 דק' אלא לשעתיים. אז במקום להתמודד עם הבעיה (לצמצם חומר או לתת עוד נקז לקורס), פשוט החליטו להקליט מראש חצי מהתרגול לצפיה עצמית, ואז את החצי השני של התרגול לבצע בלייב. כמובן שככה גם כל מתרגל צריך להעביר רק 4 תרגולים בסמסטר במקום 13, ובחלק של הלייב רק פותר שאלה או שתיים ועונה על שאלות. היחס מהמתרגל האחראי מתן הוא מזלזל, מתנשא בצורה בלתי נסבלת וממש לא עושה רושם שמזיז להם למרות אינספור בקשות מהסטודנטים לשנות את פורמט התרגולים. אגב, את התרגולים בלייב אפילו לא הסכימו להקליט (וככה המתרגלים לא היו צריכים באמת להתכונן ולומר משפטים כמו \"וואלה לא זוכר זה לא היה בתרגול שאני העברתי\"). \nהמלצה חמה אם הפורמט הזה נמשך - לצפות בהקלטות של תרגולים מלפני שני סמסטרים (אם ההקלטות עדיין זמינות). המצגות של התרגולים לא משתנות בכלל אז אין מה לדאוג.\n\nשעורי הבית: \nבקצרה - הקושי והעומס בשיעורי בית עולים בצורה אקספוננציאלית מתרגיל 1 עד תרגיל 5. \nבפירוט - יש 5 תרגילי בית. תרגיל 1,3,5 הם רטובים ותקפים. תרגיל 2 רטוב מגן ותרגיל 4 יבש מגן. \nכל התרגילים הרטובים הם המשך אחד של השני כאשר בפועל לאורך כל הסמסטר בונים קומפיילר מההתחלה ועד הסוף. תרגילים 1,2 מאד פשוטים (יום עבודה) . כדאי לעשות את תרגיל 2 כי הוא גם ככה חלק מתרגיל 3 לכן יכול לחסוך עבודה ולהרוויח על הדרך מגן. תרגיל 3 כבר קצת יותר כבד, דורש קצת עבודת OOP ולוקח יומיים - שלוש. \nתרגיל 4 הוא יבש ומגן והציונים בו די נמוכים, אז כדאי להשקיע בו רק למי שיש זמן וגם חזק מאד בחומר ויכול להבטיח ציון גבוה. אחרת חבל על הזמן ואפשר פשוט לפתור כהכנה למבחן.\nתרגיל בית 5 - הרטוב הכי עמוס בתואר ללא ספק. חשוב לפנות המון זמן לעבודה עליו. להתחיל אותו כמה שיותר מוקדם ולקוות לטוב..\n\nהמבחן: \nסך הכל המבחן בסגנון גס של מבחנים במקצועות כמו מתמ-הפעלה-אתמ . כלומר, מי שילמד כמו שצריך ויתרגל כמו שצריך יהיה בסדר. לא כמו מבחן באלגו שאפשר ללמוד חודש ובסוף להוציא 40. יש הרבה סעיפים טכניים והרבה שאלות שעם הבנה טובה של החומר אפשר לפתור יחסית בקלות. מה שכן, החיסרון הוא שגם ההרצאות וגם התרגולים חשובים באותה מידה. ולכן יש המון חומר לכסות..\n\nהשורה התחתונה: \nהסטיגמה הרעה שיצאה לקורס היא בעיקר כי מי שעושה אותו זה סטודנטים בסמסטר אחרון שרק מחפשים את העובר ולסיים את התואר. בפועל , הקורס מציג קונספטים ממש יפים מעולם מדעי המחשב. נחמד לראות איך דברים ממתם , אלגו, מבני, אתמ ואפילו חישוביות מתחברים ביחד.", "timestamp": 1614942623740}, {"author": "a", "difficultyRank": 5, "generalRank": 2, "semester": "202001", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: מרצה ממש נחמד, מסביר את החומר לא בצורה הכי מעניינת אבל נראה שמאוד חשוב לו הקורס והסטודנטים בו. משקיע מזמנו לענות על שאלות בפיאצה ובכללי אכפת לו שיבינו.\n\nשם המתרגל/ת: המתרגל האחראי היה מתן פלד, אבל לא הלכתי לכמעט אף תרגול הסמסטר, העדפתי לראות וידאו מסמסטר קודם.\nחוות דעת - תרגולים: מהניסיונות ללכת לכל אחד משלושתם המתרגלים לדעתי כולם היו לא מוצלחים בכלל. לא נראה היה ששלטו בחומר, ואף אחד לא הביא ערך מוסף לתרגול מעבר ללקרוא את השקפים. בנוסף, התנהלות הסגל הייתה מזעזעת ברמה חדשה. עונים למיילים אחרי כמה ימים טובים או שלא עונים בכלל, לא מוכנים להקליט את התרגולים (על אף ההוראה מלימודי הסמכה שתרגולים חייבים להיות מוקלטים), לא עונים בפיאצה או שעונים באיחור מוגזם, מחזירים את תרגילי הבית שנבנים אחד על השני רק כמה ימים בודדים לפני המבחן. ההכנה למבחן ממש משאירה את הסטודנטים אבודים, כשאין מענה מצד הסגל כמעט בכלל בזמן סביר (למעט מהמרצה שהשתדל לענות על כל מה שיכל בפיאצה) ובכללי תחושת זלזול רצינית כלפי הסטודנטים.\n\nשעורי הבית: קשים ודורשים זמן, אבל הם הכנה טובה למבחן.\n\nהמבחן: הרבה חומר, לא קל אבל גם לא איום ונורא.\n\nהשורה התחתונה: אם אתם במסלול שלא מחייבים לקחת את הקורס - לדעתי האישית לא כדאי לקחת בעיקר בגלל התנהלות הסגל. אם יהיה סגל אחר שיתנהל בצורה יותר מכבדת אולי שווה כן לשקול לקחת כי בסך הכל החומר יחסית פרקטי בכל מיני חלקים, ומאפשר להבין קצת דברים מהעולם האמיתי (נוסף כמובן גם על הרבה תיאוריה).", "timestamp": 1615042465867}, {"author": "דיבאגר2.0", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: די בסדר\n\nשם המתרגל/ת: תראו פשוט את ההקלטות של אדם מסמסטר אביב 20. תקוו שהן עדיין על השרת כי התרגולים המוקלטים שהיו לנו היו על הפנים\n\nשעורי הבית: רטוב שממוחזר ברובו מסמסטרים קודמים. תרגיל בית 2 הוא מגן אבל כדאי לעשות אותו כי בכל מקרה צריך לממש את החלק הזה בתרגיל 3 אז חבל לא לקבל על זה 2.5% מגן. תמצאו שותף טוב וקחו בחשבון שכל תרגיל נהיה יותר ויותר עמוס. תרגיל בית 5 הוא וריאנט של האבולה ולוקח הרבה זמן לעשות אותו.\n\nהמבחן: מבחן קצת מפחיד עם ממוצע לא משהו אבל במבנה די דומה בכל שנה. תפתרו מספיק מבחנים יהיה בסדר, החומר לא כזה נורא אחרי שקצת מתרגלים מבחנים ומבינים אותו.\n\nהשורה התחתונה: קורס חובה אז אין ממש מה להתלבט פה", "timestamp": 1615822384321}, {"author": "SR", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אייל זקס\nחוות דעת - הרצאות: מרצה נחמד מאוד, לפעמים קצת רץ על החומר אבל היה וידאו מה שעזר לחזור על הדברים.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: אישית לא הלכתי לאף אחד מהתרגולים הסמסטר. ראיתי הקלטות מסמסטר קודם שהיו ממש טובות ורלוונטיות גם לסמסטר שלנו.\n\nשעורי הבית: רמת הקושי והעומס עולה מתרגיל לתרגיל, כאשר התרגיל האחרון (תרגיל 5) הוא העמוס ביותר ולוקח ה-מ-ו-ן זמן. רצוי להתחיל כמה שיותר מוקדם.\n\nהמבחן: הסמסטר החליטו ללכת על מבחן אמריקאי, סה\"כ היה הוגן.\n\nהשורה התחתונה: סה\"כ החומר שעובר בקורס מעניין, אבל הבעיה עם הקורס ששיעורי בית לא דומים למה שעושים במבחנים (למעט התרגיל הרביעי), ואז כשמגיעים למבחנים זה מרגיש שצריך ללמוד די מאפס. אם מתרגלים מספיק מבחנים יש הרבה דברים שיחזרו על עצמם, רצוי לתת לפחות שבוע להתכוננות.", "timestamp": 1626034827296}, {"author": "null_terminated", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "אני מסכים עם החוות דעת הקודמת (של SR), פרט למבחן:\nשימו לב שהניסוח מאוד מבלבל ודו-משמעי. זו בעיה שחוזרת על עצמה מסמסטר קודם (אני חוזר על הקורס), כנראה בגלל שיש אותו מתרגל אחראי שוב. \nהייתי צריך לשלוח +5 שאלות במבחן.", "timestamp": 1626165028794}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: קודם כל שחר הוא אדם ממש נחמד. אבל ההרצאות ברובן משעממות. יש הרבה חלקים טכניים (בייחוד בהתחלה, בשלב מסויים זה משתפר)\n\nשם המתרגל/ת: ראיתי הקלטות של התרגולים של אדם. מומלץ\n\nשעורי הבית: יש סה״כ 5 ת״ב, מתוכם 4 ת״ב רטובים. הת״ב השני הוא לא חובה, אבל בכל מקרה צריך לעשות אותו בשביל ת״ב 3 אז לא לדלג עליו! גם התרגיל היבש הוא לא חובה (והוא מגן), אבל לדעתי כדאי לעשות אותו כדי להבין נושא שממש קריטי לת״ב האחרון.\nת״ב 3,5 הם עמוסים (והחמישי הוא ממש עד סוף סמסטר, אז אם יש לכם מבחנים בתחילת התקופת מבחנים כדאי שתכננו את הזמן בהתאם ותתחילו אותו כמה שיותר מוקדם)\n\n\nהשורה התחתונה: קורס שיש בו כמה דברים נחמדים, אבל הוא די עמוס ורובו משעמם. לא רואה סיבה לקחת אם הוא לא חובה", "timestamp": 1645607750262}, {"author": "3", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: בסדר, אבל לא הקליטה אז אם פספסת אתה הולך לוידאו של מרצה אחר שהיה קצת מבלבל\n\nשם המתרגל/ת: אלון קיטין\nחוות דעת - תרגולים: מדהים! מתרגל הכי טוב שיש, הציל אותי בקורס.\n\nשעורי הבית: דיי קשים , בעיקר האחרון שנופל על תקופת המבחנים\n\nהמבחן:  קשוח, הרבה טריקים\n\nהשורה התחתונה: לא הייתי ממליץ במיוחד אבל זה חובה לרוב האנשים", "timestamp": 1657694388482}, {"author": "Hi", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: היא הייתה עם המסכה על הפנים לאורך כל הסמסטר והיה קשה לעקוב אחרי כל מה שהיא אומרת ואפשר בקלות לאבד אותה.\nכדי להיות על החומר 100% הייתי צריך לצפות גם בהקלטות של שחר.\n\nשם המתרגל/ת: ההקלטות של אדם \nחוות דעת - תרגולים: הוא אלוף.\n\nשעורי הבית: עמוסים מאוד, במיוחד האחרון לוקח המון זמן, הייתי ממליץ למצוא רפרנס מסמטרים קודמים.\n\nהמבחן: חלק סגור וחלק פתוח, שאלת האנליזה סטטית בחלק הפתוח מכשילה ופחות הוגנת אבל השאר סבבה.", "timestamp": 1658406727817}, {"author": "YT", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: הייתה עם מסיכה כל הסמסטר, לא ברורה בכלל ובקושי אפשר היה להבין משהו בהרצאה. לא הקליטה, היה הרבה בלאגן בחומר ובמצגות. \n\nשם המתרגל/ת: אדם(מוקלט) \nחוות דעת - תרגולים: מזל שיש את אדם, כל המתרגלים בסמסטר היו לא טובים. רק בזכותו אפשר לעבור את הקורס הזה. \n\nשעורי הבית: לרפרנס הכל, לא מעניינים ולא חשובים. עם רפרנסים אפשר לסיים כל תרגיל ביום. \n\nהמבחן: קשוח מאד, הרבה ניסוחים לא ברורים במיוחד באמריקאיות. חשוב לתרגל הרבה מבחנים. \n\nהשורה התחתונה: לטעמי קורס לא מעניין בעליל, מאד טכני ומעצבן וממש לא נהנתי ממנו, לצערי חובה ואין כ\"כ ברירה. שיהיה בהצלחה", "timestamp": 1658855070728}, {"author": "לקסמה", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: ההרצאות ברורות ומעניינות. הילה היא מצוינת. יש לא מעט השתתפות פעילה. לצערי לא הסכימו להקליט. העניין הוא - בכל הסמסטר המרצה הייתה עם מסכה וזה היה מקשה על ההבנה. מצד אחד דורשים שנגיע פיזית לכיתה ולא מקליטים. מצד שני המרצה זקוקה למסכה וזה פוגע באיכות ההוראה. אם יש סיבה בריאותית לכך, כבר עדיף שהיא תעשה את ההרצאות בזום כדי שלפחות נראה אותה מדברת. או - לא היה עדיף לה לצמצם את מספר האנשים בכיתה באמצעות העברת השיעור גם דרך הזום וכך לצמצם עוד יותר את החשיפה האפשרית לקורונה?  לא היה עדיף בנוסף להצעה הזו גם לדרוש ממי שמגיע לכיתה להיות עם מסיכות והיא יכלה לתת הרצאה בלי מסכה?\n\nשם המתרגל/ת: מתן עין אבי.\nחוות דעת - תרגולים: המתרגל נחמד וחביב מאוד בתור בן אדם אבל חסר תועלת. הוא לא הכיר את החומר, ובעיקר מה שהיה זה שהוא למד את התרגול ביחד איתנו במהלך התרגול ובעצם חוץ מלהקריא את המצגות ולהזדהות עימנו שהחומר קשה לעיכול - הוא לא עזר מעבר. בשלב מסוים עברתי לתרגולים מוקלטים של אדם בוטח. הוא באמת תותח, ועדיין יש לי ביקורת (כללית) על כך שבתרגולים לא מלמדים אותנו לחשוב ולפתור שאלות אלא מציגים פתרונות ואומרים - \"תכף תבינו למה זה צריך להיות ככה\". במבחן אנחנו לא יכולים לראות מרחוק את הפתרון ולדעת את זה הרי. אין הקניית אינטואיציה, אין זמן בכלל לנסות לגרום לנו לחשוב ולפתח הרגלי חשיבה. בקורס כזה עמוס וקשה, שבו עושים מבחנים קשים במיוחד בכוונה כדי להוריד ממוצעים, הייתי מצפה שיעשו סדנאות ויתנו גיליון הגשה שבועי כתרגיל בית יבש, באמצעותו נתרגל כל נושא, נלמד ונקבל משוב. ולא שנחטוף תרגיל בית יבש לקראת סוף סמסטר בו *כמעט כל החומר* מוכנס במכה אחת וזה הופך את זה לתרגיל ארוך ומורכב ביותר עם מעט מדי זמן לעבוד עליו.\n\nשעורי הבית: אז בהמשך למה שכתבתי, יש תרגילי בית רטובים ואחד יבש. בלי רפרנס אין לכם סיכוי בכלל להתקדם אפילו קצת ברטובים. פשוט תרפרנסו את הרטובים ויהיה בסדר. תעבדו קשה וכמה שאפשר גם עצמאית על התרגיל היבש כי זו הדרך היחידה שאפשר להתכונן למבחן וגם לקבל משוב ראוי מהבודק.\n\nהמבחן: \nקשה רצח. אני לא זוכר קורסים שבהם עושים את המבחן ברמה כל כך גבוהה, ודורשים לעבוד כל כך הרבה ב-3 שעות. השאלות האמריקאיות טריקיות ביותר, ואין כמעט סיכוי לענות עליהן נכון בלי לדעת בדיוק את החומר ולדעת לבצע את האנליזות היטב. עברתי כי היה לי יותר מזל מכוח ללמוד. \nהשורה התחתונה: קורס חובה מה לעשות. היה דווקא מעניין בהרצאות וזה הקנה לי כלים להבין איך קומפיילרים ודיבאגרים עובדים. רק שעשו את המבחנים כל כך קשים ואת תרגילי הבית עמוסים. זה קורס של 3 נק' שמרגיש כמו 5 נק'. כמו כל קורס חובה במדמ\"ח.", "timestamp": 1666988574639}, {"author": "מנתח האסימונים", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: ראיתי מוקלט - ההרצאות המוקלטות סבירות פלוס. \n\nשם המתרגל/ת: אדם - מוקלט\nחוות דעת - תרגולים: אדם מעולה, עובר על המון חומר וזה עוזר להבנה.\n\nשעורי הבית: התרגיל בית האחרון הוא זה שלוקח מלא זמן. הסמסטר עשו אותו יותר קשה אפילו וזה גרם לרוב הסטודנטים לקצץ את הזמן למידה למבחן בקומפי, כי הוא צמוד לסוף סמסטר.\n\nהמבחן: אתה לומד כל הסמסטר, משקיע בצורה פסיכית ואז המרצה מלמד חומר חדש בשיעור האחרון ששווה 30 נק' שאלה פתוחה במבחן.\nהשיעור מוקלט לטובת מי שלא יכול להגיע אבל בקושי עם אפשרות לשמוע או לראות מה הוא כותב על הלוח, ללא תרגול אמיתי וגם מה שהמתרגלים ניסו חלקם לא באמת הראו הבנה בחומר החדש.\nבקיצור, 30 נקודות מהמבחן לפח על מהלך מלוכלך.\n\nהשורה התחתונה: לא לקחת אם לא חייב", "timestamp": 1675157927165}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: רואים ששחר אוהב את החומר ומתעסק בתחומים דומים במחקר שלו, אבל הוא לא מרצה בחסד. היו מספר נושאים מרכזיים בקורס שלא הבנתי בהרצאה בכלל, ובמעבר על החומר באופן עצמאי אח״כ היו הרבה יותר מובנים.\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: זה קורס מצוין לעבור על המצגות של התרגולים, למי שאוהב את צורת הלמידה הזו. יש שם חומר חשוב שלא עובר בהרצאות או מוזכר בהן בקושי, אז מומלץ ללמוד אותם באיזשהו אופן. \n\nשעורי הבית: יש רפרנסים כמעט שלמים, ממליץ דווקא לא לגעת בהם ולעשות הכל בעצמכם, זה מאוד מאוד משפר את השליטה בחומר לקראת המבחן. הרטובים עצמם בעומס רגיל של מדמח, יותר כבדים לקראת סוף הסמסטר אבל קלים מהממוצע בהתחלה.\n\nהמבחן: יש במבחן 70 נקודות סבירות מאוד אם עשיתם את תרגילי הבית עצמאית או לפחות לא עשיתם קופי פייסט מהרפרנס. הבעיה היא שבסמסטרים האחרונים שחר נותן שאלות מרצה על סך 30 נקודות בערך, על נושא אחד שנלמד בחצי השני של ההרצאה האחרונה. אם זה לא מספיק אז השאלות מאוד מוכוונות לפתרון שהסגל חשב עליו, ואם ניגשתם לבעיה אחרת אתם בצרות. להגנת הסגל יאמר שהבדיקה של השאלות האלה גמישה יחסית וכן מנסה לאפשר גישות אחרות, אבל זה עדיין די בזוי כל הסיפור עם השאלות האלה.\n\nהשורה התחתונה: קורס מעניין שמערב תאוריה ופרקטיקה באופן די נדיר. בסה״כ הייתי ממליץ, אבל קחו בחשבון שזה כנראה לא יהיה הקורס שיעלה לכם את הממוצע.", "timestamp": 1676500376711}, {"author": ".", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: ראיתי מוקלט חוץ מההרצאה האחרונה בסוף הסמסטר. שחר מאוד מאוד אוהב את החומר אבל יצאתי בתחושה שהוא לא יודע להעביר אותו טוב, והיה די קשה להיות על זה במהלך סמסטר.\nיש הרצאות מוקלטות של ערן יהב שחופפות בערך לחצי הראשון של הקורס ושווה לראות אותן במקום ההרצאות לדעתי...\n\nשם המתרגל/ת: הילה \nחוות דעת - תרגולים: תותחית על והלוואי שהייתה מתרגלת כל סמסטר. היא עשתה את הקורס לאחרונה אז היא באה חדה על החומר וחדה על הנושאים החשובים, ידעה לדייק ולחדד את הנושאים במהלך הקורס ובשעת קבלה למבחן ובכלל! \n\nשעורי הבית: מרופרנסים, עד תרגיל בית 5 שבו מנסים להמציא את הגלגל מחדש ואיכשהו הסמסטר יצא להם משהו בלתי פתיר. \nתרגיל בית 4 הוא תרגיל בית יבש שזו הפעם היחידה בסמסטר שתצליחו לחזור על קצת חומר, הוא לא פשוט אבל שווה לעבוד עליו כדי לחדד את ההבנה של נושאים כמו backpatching וקצת אנליזה.\n\nהמבחן: חצי אמריקאי שלא בא לבדוק בהכרח הבנה של החומר אלא הבנת הנקרא, 30 נקודות של אנליזה שנלמדה בהרצאה האחרונה והיא בין הנושאים הלא ברורים בקורס, 20 נקודות של backpatching שאצלנו היה אחלה. מבחן מעצבן בעיקר, אפשר לדעת את החומר ממש טוב וליפול על שטויות בגלל אופן כתיבת שאלות.\n\nהשורה התחתונה: לא הייתי עושה את הקורס הזה אם הוא לא היה קורס חובה...", "timestamp": 1676578198991}, {"author": "צפרדע אנונימית", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שחר יצחקי\nחוות דעת - הרצאות: הקורס הזה הוא דוגמה מדהימה למה שהפקולטה למדמ\"ח מצטיינת בו - לקחת משהו טריוואלי ולסבך אותו כל כך כדי להגיע לממוצע מנורמל ל65. זה ביזיון שזה דבר מקובל ואף אחד לא אומר דבר על זה.\nבכל אופן, הקורס מלמד על קומפיילרים ואיך הם עובדים מה שמאוד מעניין אבל לא ברור איך חומר של שבועיים יכול להימרח ל13 שבועות. \nאני אגיד לכם גם למי זה עוד לא ברור - למרצה: שחר יצחקי. בגלל שהוא גם מבין שאין מספיק חומר ללמד, הוא מוסיף נושא מטופש בסוף הסמסטר ושואל שאלה של 30 נקודות במבחן עליו (כל עוד על השאלה המפורסמת ב\"המבחן\").\nחוץ מזה הוא מרצה סביר, כן מלא מוטיבציה ורוצה להסביר לעומק דברים שסטודנטים לא מבינים. הוא משתמש בכלי אינטרקטיבי כדי לשמור על אינטרקציה עם הסטודנטים ועקביות בחומר. ממליץ לשחק איתו אם יש זמן.\nאוסיף ואומר שאם רוצים להגיע להגעה עמוקה בחומר - מומלץ לעבור על החומר של ההרצאה הקודמת לפני ההרצאה הבאה כי הקורס הזה מאוד תהליכי ונבנה אחד על השני.\n\nשם המתרגל/ת: ניסיתי את תומר/הילה ועברתי לאדם במוקלט\nחוות דעת - תרגולים: אינטנסיביים בחלקם ודורשים הרבה ריכוז ולכן עברתי למוקלט כדי לעצור ולחשוב תוך כדי. תומר היה ממש מפוזר ומבולגן ולכן אני פחות ממליץ אם אתם לא חושבים מהר כמוהו. הילה הייתה מאוד מסודרת אבל מהירה (מאילוצי הקורס), מאוד ממליץ עליה באופן כללי אם יש לכם זמן פנוי והרבה ריכוז בשעות התרגול שלה. תוכן התרגולים כולל בתוכו חזרה חלקית על ההרצאות ולפעמים גם מיותר בחלקו אך נחוץ ברובו לתרגילי הבית.\n\nשעורי הבית: 5 תרגילי בית.\n1. תרגיל חובה - משהו ממש בסיסי.\n2. תרגיל מגן (במסווה לחובה, כי תרגיל בית 3 נבנה עליו) - גם לא ארוך ויחסית קליל ומסיימים מהר.\n3. תרגיל חובה ודורש עבודה קצת - הייתי אומר שהוא שקול לתרגיל בית 4 בהפעלה ברמת העומס.\n4. מגן ולא קשור לאחרים ולכן לא עשיתי.\n5. תרגיל חובה והכי כבד מכולם - שקול ברמת העומס לתרגיל בית 1 בהפעלה. מומלץ לשבת לתכנן היטב כל דבר כי הדברים הקטנים הם אלה שמפילים את התרגיל.\n\nהתרגיל דומה כל סמסטר עד כדי שינוי קטן בו ולכן יש חזרתיות. ספציפית בסמסטר שלנו השינוי הקטן יצר בעיות גדולות מאוד, כאלה שדרשו תוספות מאוד גדולות בקוד וברור שבקומפיילר אמיתי לא משתמשים בטכניקות כאלה מה שמעט מאבד את הפואנטה.\n\nהמבחן: 50 נקודות אמריקאיות שאם אתם תותחים בריכוז זה לגמרי בכיס שלכם (או לפחות 40-45) מתוכם. שאלת backpatching במשקל 20 נקודות שהיא סופר טכנית ואפשר לתרגל אותה ממבחני עבר וממש אפשר לקבל את הרוב המוחלט של הניקוד. \nוגולת הכותרת - שאלה שטנית במשקל 30 נקודות שמבחני עבר היא סבירה ואפילו אפשר להוציא שם 20-25/30 נקודות בלי הרבה מאמץ אבל בסמסטר הזה אם לא היה לך כישורי חירטוט מטורפים ויכולת קריאת מחשבות של המרצה - כנראה שלא היית פותר אותה, או אולי מוציא שם מספר חד ספרתי של נקודות. מילא אם השאלה הזאת הייתה מכסה חלק חשוב מהחומר בקורס או חלק משמעותי בקומפיילר אבל זה אפילו לא המצב. זה פשוט נסיון נואש של סגל הקורס לסחוט נקודות מסטודנטים נואשים שרק רוצים לשים את קורס החובה האחרון הזה מאחוריהם.\n\nהשורה התחתונה: חומר נחמד ואפילו קצת מעניין לראות איך הכל עובד מאחורי הקלעים (בתור אחד שאוהב low level). איכות הוראה סבירה עד כדי טובה. מבחן שמשאיר טעם מר בפה.", "timestamp": 1682951795884}, {"author": "null", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: הילה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הילה והילה. בקיצור מאוד, ביזיון של סגל.", "timestamp": 1686166744406}, {"author": "!NULL", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: הילה\nחוות דעת - הרצאות: אחלה הרצאות\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: תרגולים מפחידים\n\nשעורי הבית: קשים אבל מה לעשות\n\nהמבחן: אנערף עוד לא עשינו\n\nהשורה התחתונה: כל מה שהבחור לפני אמר שקר וכזב", "timestamp": 1689169565547}, {"author": "the compiler", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: ההרצאות בבסיסן לא מובנות והמצגות הן ממש רק על פני השטח, הילה בהחלט הסבירה את הטוב ביותר שיכלה אבל החומר בחלק מהנושאים מסובך(גם היתה שביתה אז הכל היה צריך להיות מהר)\n\nשם המתרגל/ת: תומר כהן\nחוות דעת - תרגולים: מעולה, מסביר מצוין ומאוד עירני לסטודנטים ולהבנה שלהם, לפעמים טיפה לא מסודר\n\nשעורי הבית: תרגיל בית 5 הוא גיהנום, כל השאר לא כאלה רעים, אבל זה מהקורסים שהלחץ מתנקז לסוף הסמסטר אז קחו בחשבון\n\nהמבחן: מועד א' היה הוגן בהחלט, פשוט החומר קשה אין מה להוסיף תסבוכים במבחן\n\nהשורה התחתונה: אני נהנתי אבל לדעתי זה מאוד אינדבידואלי", "timestamp": 1689448671145}, {"author": "Oni Giri", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: הילה פלג והמוקלטים של שחר \nחוות דעת - הרצאות: הלכתי שלוש פעמים להרצאות הפרונטליות והיו סבבה , לגבי המוקלטים , שחר יודע את החומר אך נראה לי שהוא לפעמים מתקשה לעביר אותו בצורה חלקה/ברורה .\n\nשם המתרגל/ת: המוקלטים של אדם \nחוות דעת - תרגולים: יודע את החומר טוב מאוד , מעביר אותו בצורה ברורה , היו כאלה הקלטות של שעה וכמה דקות שבהן פותר שאלה ממבחנים , לפעמים עוזר לחזור עליהן.\n\nשעורי הבית: אם רוצים לעשות את תרגילי הבית מ 0 אתם צריכים המון זמן להם במיוחד להחמישי , ממליץ להיעזר ברפרנס .\nהמומצעים של שיעורי הבית היו גבוהים מאוד בסמסטר שלנו. \n\nהמבחן: 50 נקודה אמרקאית על החלק הראשון של הקורס שמהן 20 נקז יהיו על השפה שבינתם לה קומפיילר בתרגילי הבית נראה לי ששאלות אלה הם שם כי הסגל יודע שהרבה סטודנטים משתמשים ברפרנס. \nה 50 האחרות יהיו על ייצור קוד + אנליזה סטטית , במועד א השאלה על האנליזה הסטטית לא הייתה כל כך קשה , שאלת ייצור הקוד הייתה יותר מתוחקמת אך סה\"כ המבחן היה סביר מאוד.\n\n\nהשורה התחתונה: לא קורס כזה קשה שעושים ממנו.", "timestamp": 1690193788406}, {"author": "ע.ג", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: הילה\nחוות דעת - הרצאות: פספסנו 3-4 הרצאות בסמסטר - בגלל השביתה ודברים אחרים - ולא היתה השלמה ועדיין כמעט לא הורידו כלום מהחומר אז הרצאות מהירות\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: הכי טובה. ממש מסבירה עד שכולם יבינו. \n\nשעורי הבית: 5 ת\"ב מתוכם 4 רטובים. ארוכים אבל בסוף הטסטים קלילים אז קל לקבל 100\n\nהמבחן: הוגן וטכני. צריך לחזור על כל שלבי קומפילציה ולהבין כל אחד טוב טוב + backpatching + static analysis. \n\nהשורה התחתונה: פחדתי כי כולם אמרו לי שזה קורס קשה אבל בסוף זה לא כזה סיפור", "timestamp": 1690215964809}, {"author": "סטודנט מן המניין", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אייל זקס - מוקלט מסמטרים קודמים\nחוות דעת - הרצאות: עדיפים וממש אחלה, יש מכמה סמסטרים רק צריך לשים לבד כי לפעמים מורידים/מוסיפים חומר בהרצאות האחרונות.\n\nשעורי הבית: דורשים להבין טוב את החומר, חלקם קלים וחלקם קשים ומורכבים. החלק החשוב הוא שהם נבנים אחד על השני לכן חשוב להשקיע ולהבין מה עשיתם.\n\nהמבחן: קשה אך פייר ביחס לשנים קודמות. חצי ממנו שאלות אמריקאיות ועל הפתוחות ניתן לענות טוב אם מתרגלים המון ממבחנים כי הן חוזרות על אותו רעיון.\n\nהשורה התחתונה: קורס קשה ודורש מאמץ והשקעה רבה לאורך כל הסמסטר, אך היא משתלמת בלמידה למבחן.", "timestamp": 1690265965352}, {"author": "ריצ'רד סטולמן", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: הפסקתי ללכת פרונטלית אחרי ההרצאה שהיא אמרה ש\"עושים ספידראן\" על החומר בגלל השביתה, כאילו זה מריו קארט. הרי במבחן לא ישאלו אותי שאלות ברמת \"ספידראן\". המשכתי לראות את המוקלטים של שחר יצחקי, והיה..ממוצע מאוד. חומר מאוד טכני, יבש, שנשען על הרבה תיאוריה מתמטית שאין לך סיכוי להבין לעומק כי זו הפעם הראשונה שאתה נתקל בהם בכלל בתואר (דקדוקים חסרי הקשר, סריגים, נגענו אפילו בגלואה), אז אתה משנן תבניות ואלגוריתמים כמו קוף תכנותי.\n\nשם המתרגל/ת: אדם (מוקלט)\nחוות דעת - תרגולים: כל המתרגלים שהלכתי אליהם לא עשו יותר מלהקריא מהמצגת, אז ראיתי את המוקלט של אדם, והוא בסדר. חלק מהתרגולים נראו שמתסכלים אותו, אבל האמת שגם אני הייתי מתוסכל אם היו נותנים לי להעביר תרגול של 55 שקפים בשעה אחת, אז לא מאשים אותו.\n\nשעורי הבית: קח את תרגיל בית ראשון, תקרא את האסימונים של השפה. קח את תרגיל בית שני, תקרא את כללי הגזירה. סיימת? אחלה, זה הדבר היחיד שרלוונטי למבחן.\n\nהמבחן: תבניתי, וזה מפצה על זה שאף אחד לא באמת מבין את התיאוריה לעומקה. קיבלתי 85 בלי להבין בכלל על מה הקורס הזה, ואני חושב שזה אומר הכל.\n\nהשורה התחתונה: מיועד רק למי ששונא לדעת, שונא להבין ושונא ידע באופן כללי.", "timestamp": 1690403766576}, {"author": "הליקאז", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: שחר במוקלט\nחוות דעת - הרצאות: הרצאות משעממות אבל זה כי החומר מאוד טכני. המצגות מכילות המון שקופיות וזה נראה שהמרצה בקושי מספיק אותן. בסופו של דבר ההבנה של החומר מגיעה מהתב ופתירת מבחנים. \n\nשם המתרגל/ת: אדם במוקלט.\nחוות דעת - תרגולים: אדם מסביר בצורה טובה ומצגות התרגול יחסית מפורטות. החומר של התרגולים חשוב מאוד למבחן.\nהתרגול האחרון הוא על אנליזה אבסטרקטית שזה נושא שנכנס בסמסטרים האחרונים ולא מופיע במוקלט, לכן הגעתי פרונטלית לתרגול של הילה אבל לא הרגשתי שהוא תרם לי מעבר ללקרוא את המצגת.\n\nשעורי הבית: 4 תב רטובים ואחד יבש. התב עמוסים אבל לדעתי זה לא קורס החובה הכי עמוס כמו שעושים ממנו. בעקרון בכל סמסטר התב הרטובים ממוחזרים ונבנים אחד על השני. צריך לממש את שלבי הקומפיילר של שפת תכנות הדומה ל-C, כאשר בכל סמסטר הסגל מכניס פיצ׳ר אחר נוסף לשפה (אצלנו היה לתמוך בהעמסת פונקציות). לכן לרוב אין צורך בתיקונים לתב למעט מקרים בהם הפיצ׳ר החדש מסבך את התרגיל כמו שקרה אצלנו בתב 3. אפשר לשאול בפיאצה שאלות הבהרה על התב וגם על החומר באופן כללי ולרוב המתרגלים עונים בזמן סביר.\nאת התב עשיתי לבד. תב 1 לקח לי שבוע, תב 2 כמה שעות, תב 3 שבועיים אבל זה בגלל שחלק מהדרישות בתרגיל היו קשות למימוש והסגל עדכן את התרגיל אחרי שכבר בזבזתי זמן לממש אותן. תב 4 יבש 2 שאלות קלות אבל ללא רפרנס. תב 5 לקח שבוע והיה סבבה, למרות שהוא כלל הכי הרבה קוד ביחס לשאר התב. לרוב מפחידים שתב 5 הוא עמוס מאוד, אבל יכול להיות שזה תלוי בפיצ׳ר שהסגל בחר להוסיף באותו סמסטר. \nהציונים על התב גבוהים. מספיק לעבור את הטסטים שסטודנטים שולחים כדי לקבל 100.\n\nהמבחן: מאז חורף 21-22 השתנה הפורמט של המבחן וכעת הוא חצי אמריקאי (לרוב 13-15 שאלות) וחצי פתוח (שאלה על backpatching ושאלה על אנליזה אבסטרקטית). השאלות האמריקאיות לרוב ממש סבבה, חלקן הבנה וחלקן טכניות ועוסקות בנושאים מרכזיים בקורס. לעיתים יש שאלות הבנה שאינן ברורות או עם טעויות ואז מקבלים כמה תשובות. עם הרבה תרגול וקצת ריכוז אפשר לפתור את החלק האמריקאי תוך שעה.\nהשאלה על backpatching מאוד תבניתית ואפשר להשיג בקלות את כל הנקודות בה אם פותרים הרבה שאלות בסגנון הזה ממבחני עבר, כולל כתיבת הקוד באופן מלא.\nהחלק הכי בעייתי במבחן וידוע לשמצה הוא שאלת מרצה במשקל 30 נקודות על אנליזה אבסטרקטית, נושא שמועבר על רגל אחת בהרצאה האחרונה. כיוון שהשאלה הזו נכנסה למבחנים רק לאחרונה יש מעט שאלות ממבחני עבר להתאמן עליהן ולכן קשה להרגיש שליטה בנושא הזה. באופן כללי, רק הבנת השאלה עצמה לוקחת לא מעט זמן, וזה מרגיש שצריך לקרוא את המחשבות של המרצה כדי להבין למה הוא כיוון בשאלה. לרוב זו השאלה שמאבדים בה את רוב הניקוד. בחלק מהמועדים השאלה הזו כמעט לא פתירה בלי לדעת מראש למה המרצה כיוון והפקטור בהתאם. ספציפית במועד שלנו השאלה הייתה סבירה יותר מבמבחני עבר, הבעיה העיקרית היא שקשה להספיק את כולה כי היא לוקחת מלא זמן. זה מתסכל וגם לא ברור למה יש התעקשות שבכל מבחן תהיה שאלה של 30 נקודות על נושא שנלמד בהרצאה האחרונה וגם לא מרגיש מרכזי בתמונה הכוללת של הקורס. \nבלמידה למבחן מומלץ לפתור מבחנים של הסמסטרים האחרונים. לא כדאי לבזבז זמן על שאלות הבנה ממבחנים ישנים שלא מתאימות לפורמט של שאלות אמריקאיות, או שהן על נושאים שהורידו מהם את הדגש במהלך הסמסטר (למשל רשומות הפעלה בסמסטר שלנו לא הועבר בתרגולים).\nהממוצע של המבחנים לרוב 60 ומשהו, וזה נראה שהסגל נותן פקטור כדי לכוון לממוצע סופי 73-75 בערך.\n\nהשורה התחתונה: הקורס מעמיק באופן הפעולה של שלבי הקומפיילר, כאשר יש חלקים מעניינים יותר וחלקים מעניינים פחות. התב מעניינים ותורמים להבנת החומר אבל לדעתי יכלו להקל בחלק מהדרישות של השפה שלוקחות הרבה זמן לממש אבל אינן ממש מהותיות להבנת החומר. המבחן הוגן למעט השאלה על אנליזה אבסטרקטית.", "timestamp": 1690563019265}, {"author": "לקסי", "difficultyRank": 5, "generalRank": 4, "semester": "202202", "text": "שם המרצה: הילה פלג\nחוות דעת - הרצאות: היו יחסית מעניינות,חומר בהחלט קשה ולכן על אף שהילה מרצה טובה היה קשה להנגיש את החומר\n\nשם המתרגל/ת: תומר כהן\nחוות דעת - תרגולים: מעולה בעיני,חשוב לו מאוד שתצליחו והוא באמת עובד בזה,משקיע את הנשמה\n\nשעורי הבית: חוץ מחלק מתרגיל בית 3 וכל תרגיל בית 5 הם די סבבה,תהיו אבל מודעים שבחודש האחרון של הסמסטר העומס מטורף(לתרגיל בית 4 שהוא מגן אצלנו היה שבוע ואחריו מיד תרגיל בית 5 שהוא סיוט)\nמאוד מומלץ לעשות את תרגיל 4 כי הוא מקביל למשהו כמו 30 נקודות במבחן\n\nהמבחן: היה הוגן מאוד,בשאלה האחרונה שהיתה בנושא קצת יותר מורכב כן נתנו יחס לתשובות חלקיות כך שיצא באמת הוגן\n\nהשורה התחתונה: קורס מאוד מעניין,שווה לדעת את הדברים,אבל הוא בהחלט קשה", "timestamp": 1691747804488}, {"author": "l", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שחר\nחוות דעת - הרצאות: לא הכי מעניין אבל מאוד עוזר ללכת פרונטלית, ההרצאות מאוד קשורות לתרגולים ולמבחן, קשה להתרכז בהקלטות\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: סבבה.. \n\nשעורי הבית: שניים הראשונים והרביעי (יבש) בסדר. השלישי והחמישי עמוסים מאווודדד ולוקחים הרבה זמן, אי אפשר לדעת איך להתחיל לפתור בלי רפרנס. לא היה לי תרגיל בית רטוב כמו החמישי מאז מת\"ם, אז תתכוננו נפשית ותבחרו שותף טוב.\nחשוב: כל ת\"ב רטוב מבוסס ומשתמש בתרגיל הרטוב שהיה לפניו, אז תעשו את כל התרגילים אפילו השני שהוא מגן. הת\"ב מאוד עוזרים למבחן, יש 45 נק' של שאלות אמריקיאות שאם עשיתם את הת\"ב והבנתם אותם, תצליחו לפתור אותם בקלות.\n\nהמבחן: לא הכי קשה, צריך להיות על החומר ולעבור טוב על ההרצאות והתרגולים, לתרגל לבנות אוטומטים מהיר ולעבור על שאלות של אנליזה סטטית ממבחנים. סה\"כ היה הוגן, אבל בסמסטר שלנו לא היה bpatching בחומר\n\nהשורה התחתונה: קורס עם חומר שכדאי לדעת לפני שמסיימים את התואר, מעניין (לרוב), המון שפות חדשות (לקסינג ופרסינג..), ת\"ב אחרונים לא הגיוניים. מבחן הוגן\nאם תלכו להרצאות והתרגולים במהלך הסמסטר ותעשו את כל הת\"ב, עם למידה של לפחות 4 ימים למבחן לא קשה להוציא ציון טוב.", "timestamp": 1713388043529}, {"author": "ASTa", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "*** בסמסטר הורידו מהחומר את backpatching ו-abstract interpretation וגם קיצצו מתרגילי הבית מה שככל הנראה השפיע בצורה ניכרת על הקושי של הקורס ***\n\nשם המרצה: שחר יצחקי\nחוות דעת - הרצאות: בסדר, עדיפות מהמוקלטות שלו.\n\nשם המתרגל/ת: הילה לוי\nחוות דעת - תרגולים: סבבה, לא משהו מיוחד מבחינת ההעברה של החומר אבל הדבר הכי טוב זה שהיא נותנת טיפים מעשיים לשיעורי בית ולמבחן.\n\nשעורי הבית: 5 תרגילים כשתרגיל 4 יבש, ותרגילים 2 ו-4 הם מגן ולא תקף:\nתרגיל 1 קליל יחסית, לוקח בין כמה שעות ליום.\nתרגיל 2 לוקח שעה וממש קל.\nתרגיל 3 היה לדעתי התרגיל הכי ארוך ולקח שבוע וגם היה הכי מאתגר, אבל לא יותר מדי. מבחינת קושי דומה למת\"ם.\nתרגיל 4 (יבש) עוזר לתרגל חומר שצריך בסוף למבחן אז מומלץ לעשות אותו.\nתרגיל 5 לקח משהו כמו יומיים, אבל ממה שהבנתי זה בגלל שלא היינו צריכים להשתמש ב-backpathcing ולא היינו צריכים לתמוך במימוש פונקציות. תרגיל קצת מציק, אבל בסדר סה\"כ.\n\nהמבחן: צריך לתרגל מספיק ולחזור על החומר מההרצאות והתרגולים (שבוע כנראה מספיק). המבחן שלנו היה קל יחסית לשנים קודמות.\n\nהשורה התחתונה: קורס נחמד, ובגלל ההקלות הסמסטר לא היה קשה מדי.", "timestamp": 1714128405880}]}