{"posts": [{"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורן משלי\nחוות דעת - הרצאות: ההרצאות נחמדות אבל אין חובה להגיע אליהן לטעמי, החומר עובר במצגות ארוכות ומפורטות שמספיק לקרוא אותן, לא מדובר בחומר מורכב או מסובך יותר מדי. \n\nשם המתרגל/ת: רז ונטלי\nחוות דעת - תרגולים: התרגולים הרבה יותר חשובים מההרצאות, יש רק 5 (עוברים כסדנאות) והם מאוד פרקטיים לטובת הפרוייקט וגם שאלו בבחינה על החומר מהם.\n\nשעורי הבית: 3 שיעורי הבית הראשונים הם ביחידים והם ממש עם תחילת הסמסטר ובהפרש של שבוע בערך, עבורי זה היה מאוד עמוס וקשה ויש להם משקל זעום בציון יחסית להיקף שלהם (כל אחד 2%).\nהפרויקט עצמו עמוס עוד יותר, אבל הרבה יותר כיף, מלמד ומעניין.\n\nהמבחן: לא כל כך ברור למה צריך מבחן כשהפרויקט כל כך עמוס. לפחות זה היה עם חומר פתוח, עוד לא קיבלנו ציונים אבל הממוצע בו בדרך כלל מאכזב יחסית לקורס בחירה.\n\nהשורה התחתונה:", "timestamp": 1658477405126}, {"author": "סתם", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אורן משלי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: נדחסים לתחילת הסמסטר ולא תמיד מובנים ורוב הפרויקט תלוי בהם\n\nשעורי הבית: תחילת הסמסטר שיעורי בית ארוכים ומוגזמים , תוותרו  על חופש חנוכה/פסח כי הם תמיד נותנים הארכה וגם אז אתה לא מספיק והציונים נמוכים\n\nהמבחן: \nממש לא מובן מה הקטע של המרצה עם המבחן הזה , הפרויקט מספיק קשה למה לעשות מבחן של שלוש שעות בשעתיים, מרגיש כמו פסיכומטרי שאתה רודף אחרי הזמן במקום לעשות מבחן נורמלי שבודק ידע ומחשבה טיפה.\nהשורה התחתונה: אני ממש כועסת על מי שהמליץ עליו ואני ממש לא ממליצה כי זה דברים שאתם יכולים ללמוד בכיף לבד ולא צריך שיתנו לך ציון עליו שלא מתבסס על מה שעשיתם ורנדומלי לפי המתרגל. אה ולא להתאמץ על פיצרים קשים בטח לא לנסות לממש צאט , כי כל מי שניסה בסוף קיבל ציון נמוך ואלה עם הפיצרים הפשוטים קיבלו ציונים גבוהים כי הם הצליחו לממש אותם טוב , תבחרו מימוש פשוט פשוט ואל תעמיסו .", "timestamp": 1661498681429}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורן \nחוות דעת - הרצאות: לא חובה אבל מאוד מעניינות . כדאי להיכנס אם אתם רוצים לחסוך זמן בלמידה למבחן.\n\nשם המתרגל/ת: אופק \nחוות דעת - תרגולים: מתרגל מצוין . התרגולים בהתחלה חשובים בשביל השיעורי בית של ההתחלה. ובשביל הפרוייקט זה תלוי אפליקציה . אצלינו רוב הדברים היינו צריכים לקחת מהאינטרנט.\n\nשעורי הבית: 3 שב , כל אחד שבוע להגשה . השיעורי בית בהתחלה מאוד עמוסים בגלל שלא רגילים לשפת תכנות . \nהפרוייקט עצמו יותר עמוס אבל יותר מעניין . ממליץ לממש פיצ'רים פשוטים למימוש כי הציון נקבע על פיצ'רים שעובדים וUI אחיד ויפה. \nהציון הכי גבוה שיתנו הוא 95 על הפרוייקט ובשקלול עם שב יכול להיות גבוה או יותר נמוך יותר.\nונקודה חשובה: תמצאו אנשים שיתנו עבודה ולא יפקירו אתכם במצע סמסטר.\n\nהמבחן: מבחן עם חומר פתוח , חלק מהחומר קשור לאנדרואיד וחלק תהליכי פיתוח שלא קשורים לקורס .\nהמבחן עם ממוצע נמוך ודי מיותר אחרי כל הפרוייקט העמוס   \n\nהשורה התחתונה: ממליץ לקחת משתי סיבות \nמאוד מעניין לדעת לממש אפליקציה  וזה 5 נק''ז", "timestamp": 1676582146022}, {"author": "צפרדע אנונימית", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורן\nחוות דעת - הרצאות: \nהלכתי למספר הרצאות ראשונות והפסקתי כי העדפתי לעבוד על הפרויקט בזמן הזה. אורן אחלה מרצה, משתף את הסטודנטים ומדבר על נושאים חשובים לתעשייה ולכן זה כן נחמד להקשיב להרצאות אם יש זמן.\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: \nלא באמת היו תרגולים אלא 7 סדנאות שמטרת התוכן שלהן היא לעזור לך לעבוד על הפרויקט, בעיני היה מיותר ללכת כי המצגות די מתומצתות אבל כן חשוב לעבור עליהן במהלך הסמסטר כי הן נותנות דגשים חשובים לגבי מימוש נכון של האפליקציה.\nשעורי הבית: \n\nהמבחן: אחלה לגמרי. יש חומר פתוח ובדרך כלל, לדעת את התשובה נבנה על כמה טוב אתה מכיר את החומר הפתוח ולכן מומלץ לתרגל איתו את כל המבחנים שיש באתר (כי יש תשובה שם להכל - פשוט צריך לחפש טוב)\n\nהשורה התחתונה: בגלל שניתן לקחת את הקורס הזה רק עם הפרויקט, אין באמת שורה תחתונה. החלק הקליל והפחות מורגש של פיתוח אנדרואיד במהלך הסמסטר (לכן דירוג העומס והדירוג הכללי מתייחסים אך ורק לחלק זה של הקורס ולא לפרויקט).", "timestamp": 1714595234272}]}