{"posts": [{"author": "CGPOST", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גרשון אלבר\nחוות דעת - הרצאות: מהמעניינות שהיו לי בתואר, גרשון מלמד בצורה מרתקת. הקונספטים יכולים להיות קשים לתפיסה, וגם אחרי שתופסים אותם - צריך לממש אותם בתרגילי הבית ושם נכנס קושי אחר לגמרי.\n\nשם המתרגל/ת: היית'ם\nחוות דעת - תרגולים: מתרגל שאוהב את הנושא, אכפת לו מהסטודנטים ועוזר המון, אבל התרגולים עצמם לא מועברים בצורה מעניינת כל כך לצערי.\n\nשעורי הבית: עמוסים מאוד ומעניינים מאוד. דורש ידע תכנותי ב-C\\C++ (אם כי יש חופש בבחירת הסביבה עליה תעבדו).\nהתרגילים בנויים ככה שכל תרגיל נבנה מעל התרגיל הקודם. בונים את הGUI בסביבת MFC ב-visual studio. כל פיצ'ר דורש מימוש בקוד ויצירת ממשק מתאים בGUI. בכל תרגיל יש סעיפים בסיסיים שיש לממש וסעיפי בחירה.\nאת ההגשות מציגים מול המרצה ובודק התרגילים באופן פרונטלי במעבדה - האווירה נחמדה ולא לחוצה.\n\nתרגיל בית 1: הכרת הסביבה ומימוש אלגוריתם לציור קווים בדו-מימד.\n\nתרגיל בית 2: הצגה על המסך מודלים המוגדרים במרחב תלת מימדי (ללא המידול עצמו כמובן). ראשית מציירים את המודל רק באמצעות ציור הקווים מתרגיל בית 1), ע\"י מימוש טרנספורמציות לנאריות ממרחב המודל => למרחב העולם => ולמרחב המסך (2D). בנוסף מממשים טרנפורמציות סיבוב, מתיחה והזזה של המודל\\עולם\\מצלמה ועוד פיצ'רים שונים מההרצאות. יש דרישה לטעון מודלים מקבצים שונים, ולהחזיק אותם על מבנה נתונים שתגדירו בעצמכם.\n\nתרגיל בית 3: מממשים צביעה של המודל ע\"י אלגוריתם למילוי פוליגונים. קובעים תאורה בסצנה ומממשים הצללה למודלים באמצעות אלגוריתמים שונים של הצללה שנלמדו בהרצאות.\nלא קל בכלל.\n\nתרגיל בית 4: מימוש פיצ'רים מתקדמים לפי בחירה. כל פיצ'ר מקבל ניקוד מסויים על פי הקושי שלו ככה שצריך לצבור מספר מסויים של נקודות.\n** בנוסף יש תחרות של הצגת 3 סצנות שתבנו בעצמכם (בעזרת התוכנה שבניתם) - מקום ראשון שני ושלישי מקבלים 3, 2, ו-1 נק' לציון הסופי.\n\nהמבחן: מוזר קצת. חומר פתוח. לא קשה במיוחד. אין הרבה מבחני עבר. אישית היה לי המון זמן ללמוד וזה לא עזר במשהו. היה עדיף ללמוד למבחנים אחרים בזמן הזה :)\n\nהשורה התחתונה: לדעתי כל אחד שאוהב גאומטריה ואי פעם תהה לעצמו איך לעזאזל מקרינים סצנות תלת מימד למסך - יהנה. לא ממליץ לאנשים שמחפשים נק\"ז כי זה לא שווה את העומס.", "timestamp": 1689975702651}, {"author": "They who suffered", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מירלה בן-חן\nשם מתרגלת: שיר\n\nאם אין לכם גישה לרפרנסים לתרגילי הבית, תתרחקו מהקורס הזה. הקורס עמוס מאוד, עם תרגילי בית שלוקחים שבוע לפתור ולדבג לפעמים בגלל באגים מטופשים כמו \"צבע בעל ערך לא מנורמל\" או טעות בסוגריים באיזה MACRO שהם נותנים בSKELETON.\nשימו לב: תרגילי בית של מירילה שונים מאלו של גרשון.\n- ת.ב 1+2 אצל גרשון = ת.ב 1 אצל מירילה\n- תב 3 אצל גרשון = ת.ב 2 אצל מירילה (+תוספת פיצ'רים)\n- ת.ב 3 אצל מירילה צריכים לממש את כל מה שעשיתם קודם אבל עכשיו ב OPENGL.\n\nredflag #1: אפשר ואפילו מומלץ להשתמש באינטרנט או CHATGPT כדי לפתור את תרגילי הבית.\n\nredflag #2: תרגילי הבית מהווים 50% מהציון הסופי, כך שאם לא סיימתם אותם בזמן או אם הפיצ'ר לא עובד 100%, אתם בצרות.\n\nהקורס מתמטי מאוד, ההרצאות לא עוזרות להבין את החומר, במיוחד ה5 האחרונות שמתמקדות במתמטיקה למבחן.\n\nהתרגולים בזבוז זמן, לא מספיקים להבין את החומר ולא ממש עוזרים לפתירת תרגילי הבית, סתם נותנים אינטואיציה למה מדובר.\nיש חומר נוסף בתרגולים שלא לומדים בהרצאות והוא נכלל במבחן.\n\nהמבחן קשה במיוחד ומצריך הבנה עמוקה לחומר, השאלות מאוד ספציפיות והחומר אינסופי.\nאין מבחני עבר לתרגול או פתרונות רשמיים, ולרוב אין אפילו סריקות, אז אין דרך לדעת אם הפתרון שלכם בכלל בכיוון.\n\nredflag #3: היו שאלות בשעות הקבלה שאפילו המרצה עצמה לא ידעה לפתור כי לא הבינה על מה מדובר בשאלה.\n\nredflag #4: מבחן עם חומר פתוח, לא משנה מה הבאתם למבחן, לא בהכרח יעזור לכם לפתור.\n\nשורה תחתונה: תברחו.\nאם בכל זאת בחרתם לקחת את הקורס, תדעו שאתם צריכים להשקיע שעות וימים בחיפוש חומר נוסף כדי לעבור את המבחן, אז לא מומלץ לקחת את הקורס בסמסטר עמוס.", "timestamp": 1718815432876}, {"author": "--", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: מירלה בן-חן\n\nאם פעם התעניינתם בgame development וחשבתם לעצמכם איך מרנדרים צסינה למסך, הקורס הזה יכול לעזור לכם ללמוד את המתמטיקה מאחורי התהליך.\nאבל אישית לא הרגשתי שחומר הקורס עזר לי להבין כלום, ההרצאות ממש מפוזרות, והמרצה עוברת על רוב החומר כאילו הכל מובן מאילו. קיצור, אפשר ללמוד את החומר לבד ולהבין יותר לעומק מבלי לקחת קורסים חרא. learnopengl.com\n\nשורה תחתונה:\nקיבלתם ציון ממש טוב בתרגילי בית -> עברתם את הקורס.\nאחרת -> נדפקתם. אין ממש הזדמנות לrecovery כי המבחן ממש ארוך וקשה והשאלת לא מובנות.", "timestamp": 1720082230672}]}