{"posts": [{"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רון רוטבלום\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, רון מסביר את החומר בצורה מעניינן. לעפמים קצת מבולגן בלוח אז צריך לעקוב.\nהחומר תאורטי, לא פשוט למי שאין לו רקע מתמטי או קורסי תאוריה אחרים.\n\nשם המתרגל/ת: תומר גבירצמן\nחוות דעת - תרגולים: תומר מתרגל מעולה!!! מעבר את החומר בצורה טובה וברורה עם הרבה אנימציות איפה שצריך. רואים שהוא מאוד משקיע בתרגולים ושאכפת לו שיבינו. מאוד נחמד ועוזר.\n\nשעורי הבית: לא קשים יחסית לחומר. לשאלות היותר קשות היו רמזים והדרכות.\n\nהמבחן: עוד לא עשיתי. אבל הובטח מבחן קל.\n\nהשורה התחתונה: קורס מומלץ סגל מעולה!", "timestamp": 1713443644470}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: רון רוטבלום\nחוות דעת - הרצאות: רון מרצה מעניין מאוד, ומציג את הנושא בצורה מעולה, הוא זמין לשאלות ומאוד אכפתי כלפי סטודנטים. החומר עצמו לא תמיד קל, אבל יש הרגשה שיש למי לפנות\n\nשם המתרגל/ת: תומר גבירצמן\nחוות דעת - תרגולים: מתרגל תותח, מסודר ואכפתי, מאוד קל להבין את החומר בעזרתו, ניכר שאכפת לו\n\nשעורי הבית: לוקחים זמן, אבל מעניינים\n\nהמבחן: סבבה, היה פקטור משמעותי והממוצע היה גבוה\n\nהשורה התחתונה: למי שאוהב את התחום(מערכות הוכחה) קורס מאוד מומלץ.", "timestamp": 1717500027619}, {"author": "ICUP", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "* הביקורת היא עבור הקורס \"מערכות הוכחה מתקדמות\" *\n\nשם המרצה: רון רוטבלום\nחוות דעת - הרצאות: מעולות. רון מרצה מעולה והחומר מאוד מעניין. כל ההרצאות היו טובות ללא יוצא מן הכלל.\n\nשם המתרגל/ת: תומר גבירצמן\nחוות דעת - תרגולים: אחלה. תומר משתדל להסביר את החומר כמה שיותר טוב, וניכר שהוא עושה מאמץ כדי שההסברים יהיו ברורים ככל הניתן (והמצגות שלו טובות בצורה מטורפת)\n\nשעורי הבית: קשים ,מאתגרים ולוקחים זמן. סה\"כ 4 גיליונות.\n\nהמבחן: בסילבוס כתוב שהמבחן יהיה קל.\nבהרצאה הראשונה אומרים שהמבחן יהיה קל למי שהיה בהרצאות, עשה שיעורי בית ויודע את החומר.\nבפועל - המבחן קשה. יש הרבה חומר לזכור, והחומר קשה, מה שמביא למבחן קשה.\nהיתרון היחידי הוא שיש פקטור מכובד שמעלה את הממוצע של המבחן.\n\nהשורה התחתונה: אחד הקורסים היותר מעניינים שלקחתי, ואישית נהניתי מאוד. ממליץ אם אהבתם קורסים בסגנון של חישוביות ואלגו, ואתם לא נרתעים מהסתברות, אלגברה לינארית ואלגברה מודרנית (הדומיננטי ביניהם הוא הסתברות, ובשאר משתמשים במקומות ספציפיים במהלך הקורס). עם זאת, אם לא בא לכם להשקיע יותר מדי מהזמן שלכם על תרגילי בית ובנוסף להתמודד בסוף הקורס עם מבחן יחסית קשה, הייתי מוותר.", "timestamp": 1717676330902}]}