{"posts": [{"author": "tomer voronov", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: טל\nחוות דעת - הרצאות: מועילות. מרצה טוב מאוד (ונחמד מאוד)\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: חשובים אך לא כל כך מועילים\n\nשעורי הבית: מרופרנסים, לא קשים, חצי יום עבודה\n\nהמבחן: קשה מאוד\n\nהשורה התחתונה: לא ממליץ כקורס הרחבה אלא אם ממשיכים אחר כך לקורס תקשורת.", "timestamp": 1601299569380}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "201801", "text": "שם המרצה: דני רז\nחוות דעת - הרצאות:  מרצה מעולה ומעניין ונחמד-ממליץ מאוד. מה שכן מלא הסתברות...\n\nשם המתרגל/ת: דן אהרונסון\nחוות דעת - תרגולים: די עמוסים וקשה לעמוד בקצב, אבל לא בהכרח אשמתו. הוא עצמו מסביר טוב. יותר מידי הסתברות בתרגולים\n\nשעורי הבית:  יש 4 יבשים ואחד רטוב. היבשים מציקים למדי-חלק מהשאלות ברמת מבחן אבל חלק סתם מציקות, הרטוב לא נורא אם כי זה מאוד משתנה בין סמסטרים אפילו באיזו שפה מותר לתכנת בו\n\nהמבחן:  קשה ולא אחת טריקי, הרבה הסתברות, ממוצע לא מרשים כל כך בסמסטרי חורף\n\nהשורה התחתונה: לצערי החלק המעניין של הקורס הוא רק בחודש האחרון-שאר הזמן זה בעיקר מלא הסתברות. לכאן ולכאן", "timestamp": 1609620259191}, {"author": "A", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: \nמעניינות. לשים לב שטל מוסיף 100-150 שקפים שמדברים על wireshark, ארכיטקטורה של switches וכו' ושואל על זה במבחן.\nשם המתרגל/ת: \nעידו\nחוות דעת - תרגולים: \nעידו חמוד, לא מסביר מדהים אבל זה מה יש.\nשעורי הבית: \nלא עמוסים, די משעממים\nהמבחן: \nקשה, מגעיל, מעייף, מבלבל, חרא\nהשורה התחתונה: \nקורס לא מומלץ בכלל! להתרחק!\nלא לומדים על רשתות, לומדים על חישוב ניצולת של רשתות ועל הסתברות. חבל שהפקולטה מפספסת הזדמנות למשוך אנשים לתחום...", "timestamp": 1627567555341}, {"author": "מיכאל", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דר. טל מזרחי\nחוות דעת - הרצאות: נחמד, הקול קצת מרדים אבל רמת ההוראה טובה. הוא גורם לקורס להיות קצת עדכני כשהוא מדגים הרבה ב-wireshark.\n\nשם המתרגל/ת: עדו ים\nחוות דעת - תרגולים: מתרגל מעולה בכל פרמטר שניתן להעריך. מבחינת ההוראה הוא מסביר מעולה ובסבלנות ומעודד השתתפות ומנסה ליצור עניין, ניכר עליו שהוא אוהב את המקצוע ושאכפת לו מהסטודנטים.\nהוא היה בנוסף גם מתרגל אחראי וגם בזה הוא היה מעולה. התחשב בבקשות של סטודנטים והיה אדיב ולא מתנשא בכלל. בנוסף הוא היה קשוב (לא רק הוא, כל סגל הקורס) למשוב של הסטודנטים ושינה את התרגיל האחרון בעקבות הביקורת.\n\nשעורי הבית: יש תרגיל רטוב תקף שערכו 8 נקודות מהציון הסופי והוא לא קשה אבל גם לא כ\"כ מעניין. בנוסף היו עוד 4 תרגילים יבשים ברמת שאלות מבחן שהיו סבירים וזיכו כל אחד ב-2.4 נק' תקפות לציון הסופי. בנוסף היה תרגיל בית נוסף עם חלק יבש שנתן 2.4% מגן וחלק פסאודו רטוב שנתן נקודת בונוס לציון הסופי, אני עשיתי אותם וזה מומלץ גם בשביל הבונוס וגם החיכוך ב-wireshark תרם לי בסוף למבחן.\n\nבמהלך הסמסטר המרצה נתן אתגר כלשהו ואמר שהטובים ביותר יזכו בשתי נקודות בונוס לציון הסופי. בסוף רק מספר קטן של סטודנטים נענו לאתגר וכולם קיבלו בונוס, בדיעבד חבל שלא עשיתי.\n\nהמבחן: המבחן היה די מבאס, הייתה שאלת פסיכומטרי על wireshark שלא עסקה בחומר הנלמד כמו בהבנת הכלי. בנוסף הרבה ניסוחים לא היו ברורים והם עדכנו תוך כדי מבחן, רבע מהמבחן היה שאלות אמריקאיות שעסקו בטפל והיו מתקילות סתם.\n\nהשורה התחתונה: מי שמתכנן להתמקצע בתחום של רשתות ולקחת קורסי המשך, הקורס מומלץ עבורו כהכנה לקורסים הבאים. אני לקחתי את הקורס מתוך כוונה לקבל הצצה לעולם של רשתות והתאכזבתי. הקורס עוסק רובו ככולו בהסתברות ובפרט בחישוב תוחלות של פרוטוקולים שעבר זמנם.", "timestamp": 1633251355622}, {"author": "מאוכזב", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלא קשים במיוחד.\n\nהמבחן: \nקשה.\n\nהשורה התחתונה: בזבוז זמן, בזבוז של קורס בחירה", "timestamp": 1633536342093}, {"author": "probability hater", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה:tal mizrahi \nחוות דעת - הרצאות: \ninteresting and fun material\n\nשם המתרגל/ת: ido yam - panopto\nחוות דעת - תרגולים: \nare not well written had to spend so much time on solo learning to understand the solution\nשעורי הבית: \ntrash takes time and wet homework was a complete mess \nהמבחן: \ndidn't do it yet\nהשורה התחתונה: \ncourse's theory is interesting and fun, but hw and exam learning process is a pain in the a, full of probability calculations and math, \ni don't recommend it for for full loaded semester if you .have wet home work in the syllabus", "timestamp": 1656567257844}, {"author": "Yosef Br", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: Dr.Tal\nחוות דעת - הרצאות: ממש נחמד מכיר ומבין את התחום.\n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: מתרגל מצויין מתחשב בסטודנטים ומנסה לעזור כמה שניתן. מהמתרגלים הטובים שעברו עלי.\n\nשעורי הבית: קצת קשים! כן בניגוד לחוות דעות קודמות אם אתה לא מכיר מספיק חברה שלוקחים את הקורס הייבשים יקחו לך זמן כך שמלא הסתברות ונונסים קטנים. את התרגיל הרטוב פחות מובן להתחיל מ 0 ייקח כמה ימים טובים. אבל יסתדר בסוף\n\nהמבחן: קשה! בדרך כלל מפוקטר אבל לא קל. צרייך להבין את ההרצאות היטב לעבוד קצת עם Wireshark. הרגשתי שהמבחן פנוי משאלות הבנה מההרצאה ושאלות הסתברות. כדומה בהפעלה יתכן שאלה שלימה על משהו שולי שהיה בהרצאה כלשהי\n\nהשורה התחתונה: קורס מומלץ ונחמד אבל לא קל. למי שתמעניין להכיר יותר על עולם הרשתות מומלץ! בהצמלחה.", "timestamp": 1657027734649}, {"author": "Yosef Br", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: Dr.tal\nחוות דעת - הרצאות: ממש נחמד מכיר את התחום.\n\nשם המתרגל/ת: פראס\nחוות דעת - תרגולים: מתגל מצויין ראוי להערכה. מתחשב ומנסה לעזור כמה שניתן.\n\nשעורי הבית: קצת קשים! בניגוד לחוות דעת קודמות היבשים לוקחים זמן כך שמלא הסתברויות ונונסים קטנים. הרטוב יותר קשה לדעתי ופחות מובן יקח כשבוע תתכנו זמנכם מראש.\n\nהמבחן: קשה! בדרך כלל מפוקטר אבל לא קל. צריך להבין את ההרצאות היטב. בנוסף ליכולת מתמטית בחישוב תוחלות והסתבריות. כדומה במערכות הפעלה תתכן שאלה שלימה על משהו שולי.\n\nהשורה התחתונה: קורס מומלץ ונחמד אבל לא קל. נותן הצצה לעולם הרשתות. בהצלחה", "timestamp": 1657028367121}, {"author": "amir alkalay", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: הרצאות מעייניות מאוד\n\nשם המתרגל/ת: מוקלט אביב 21\nחוות דעת - תרגולים: מעולה, מדויק לשאלות במבחן\n\nשעורי הבית: די קלים, לא צורכים יותר מדיי אם הקשבתם בתרגול\n\nהמבחן: קצת דפיקה ודי הסתברות, אבל דומה מאוד להרצאות ותרגולים\n\nהשורה התחתונה: ממליץ מאוד למי שרוצה לדעת איך הודועת עוברות באינטרט, מה זה ראטור בדיוק וכל המסביב", "timestamp": 1657525883673}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: הרצאות טובות, קצת עמוסות במושגים. בסמסטר שלנו היה בונוס על נוכחות.\n\nשעורי הבית: יבשים ורטוב אחד בפייתון, לא כבדים בכלל.\n\nהמבחן: טריקי ולא פשוט, אבל דואגים שהממוצע של הסופי תמיד 80.\n\nהשורה התחתונה: ידע חובה למדמח לדעתי, לא כזה עמוס אבל המבחן לא קל. אם נשארים על החומר במהלך הסמסטר אפשר להצליח עם שלושה ארבעה ימי למידה.", "timestamp": 1658051063510}, {"author": "SONET", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות:  מעביר את החומר בצורה טובה ומעניינת משלב בהרצאות כמה דוגמאות מwireshark\n\n\nשם המתרגל/ת: פיראס\nחוות דעת - תרגולים: מתרגל על! מעביר את התרגולים בצורה מעניינת וכפי שצוינו מקודם, מתחשב ומנסה לעזור תמיד,  משקיע זמן להסביר.\n\nשעורי הבית: \n4 יבשים חובה - לא ארוכים אבל צריך להשקיע בהם כדי להצליח במבחן, לרטוב צריך להשקיע כמה ימים טובים - אפשר לממש בכל שפה. python is the best!\n\nהמבחן: \nמבחן טריקי, לא קשה, יש חשיבות רבה לנוכחות בהרצאות, שאלה ראשונה לרוב תהיה בה שאלה שמשלבת wire shark\n\nהשורה התחתונה: \nקורס חובה לכל סטודנט בפקולטה, אם הסגל הוא אותו סגל של הסמסטר הרווחתם בגדול.\nידע בהסתברות חובה!", "timestamp": 1658671150292}, {"author": "ARP", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: סך הכל בסדר. מעביר את החומר בצורה די איטית. יש בונוס על הגעה אז באתי.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: די בסדר. התרגולים של ה-PDF לפעמים לא מובנים במיוחד.\n\nשעורי הבית: לא קשים, לפעמים מנוסחים בצורה מאוד לא ברורה. כדאי להכיר עוד מישהו שלוקח את הקורס כדי להתייעץ. יש 4 יבשים ורטוב אחד אם אני לא טועה. גם הרטוב לא עמוס במיוחד.\n\nהמבחן: סך הכל בסדר, בכלל לא הייתי על החומר במהלך הסמסטר והצלחתי להוציא ציון טוב תוך 4-5 ימי למידה.\n\nהשורה התחתונה: קורס לא עמוס, מבחן קצת טריקי, רוב הסמסטר החומר לא מעניין במיוחד. סך הכל לומדים כל מיני דברים מעניינים, רובם בסוף. שימו לב שיש לא מעט הסתברות בקורס, שום דבר מסובך במיוחד ולא קשה להבין מה קורה אם אתם לא טובים בהסתברות (מניסיון)", "timestamp": 1658938768548}, {"author": "cnwd", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אנה לוין\nחוות דעת - הרצאות: לא מובן, מלא חומר, לא מספיקה הכל ומצפה שיושלם על ידינו לבד(תמיד יש פער של סביב ה8 שקופיות לסוף המצגת המוגדר, כן מאוד משקיעה בלהביא אביזרים ועזרי הוראה\n\nשם המתרגל/ת: תומר כהן\nחוות דעת - תרגולים: אחלה ממש, לא צלל לעומק של דברים אבל היה מאוד אכפתי והעביר את מה שהיה בצורה מובנת\n\nשעורי הבית: בסדר גמור, היבשים אחלה פשוט תוודאו שהבנתם את השאלות טוב, הרטוב לא מורכב אבל תחילה מומלץ בפייתון ותדעו שאחרי הבדיקה הראשונה ברטוב הציונים זוועה, בסוף מתקנים את זה\n\nהמבחן: מזעזע, לא מובן, גם ככה יש ערימות של חומר, אין הגדרה במה להתמקד, השאלות נישתיות ועוסקות בקצוות האפלים של החומר בחלקן,אין ציון מובטח\n\nהשורה התחתונה:", "timestamp": 1689449151589}, {"author": "er", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "חוות דעת - הרצאות:\nמרצה מעולה\n\nשעורי הבית:\nשיעורי הבית בזוגות. יחסית לא עמוסים אבל כן נדרש לעבוד. רובן עסקו בשאלות עם חישובים הסתברותיים\n\nהשורה התחתונה:\nקורס מומלץ, לא עמוס במהלך הסמסטר. מבחן קשה, כמו שאר המבחנים בטכניון", "timestamp": 1689689922471}, {"author": "orr gonen", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אנה לוין\nחוות דעת - הרצאות: הרצאות נחמדות, החומר לא מעניין ברובו אבל אנה מעבירה אותו טוב\n\nשם המתרגל/ת: תומר כהן\nחוות דעת - תרגולים: תרגולים טובים, קצר ולעניין\n\nשעורי הבית: שיעורים נחמדים בהסתברות, תרגיל רטוב 1 ממש נחמד\n\nהמבחן: מבחן נורא, סטייל הפעלה אבל יותר גרוע, ככה שלא משנה כמה תלמד יפתיעו אותך, שאלות על נקודות נסתרות בחומר, טעות אחת בחישוב ההסתברות והורידו חצי מהנקודות או שפספסת מילה אחת קטנה בשאלה שבגללה צריך לכפול ב-8(ביט או ביית) או שצריך להוסיף הודעות שכל גשר שולח והורידו חצי מהנקודות. לא רק שהיה מבחן קשה גם בדקו אותו בצורה קפדנית ולא היה פקטור בכלל.\n\nהשורה התחתונה: פרט למבחן קורס מעולה אבל אם לא מעניין אתכם עזבו כי לא שווה את זה", "timestamp": 1690018130386}, {"author": "יובל לנדה", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אנה לוין\nחוות דעת - הרצאות: מרצה מעולה. מעבירה את החומר בצורה טובה, ונותנת הרבה הדגמות כדי לעזור להבין את החומר.\n\nשם המתרגל/ת: תומר כץ\nחוות דעת - תרגולים: סבבה, קצר ולעניין. נהיה יותר מעניין לקראת סוף הקורס.\n\nשעורי הבית: סבבה, לא עמוסים מדי ולא קשים מדי.\n\nהמבחן: לומדים חומר בקורס ומתרגלים אותו בתרגילי בית בתקווה שמה שמתרגלים יופיע במבחן, אבל בסופו של דבר השאלות שם עולות בדרגה, ומנוסחות בצורה לא משהו בלשון המעטה. בסופו של דבר חצי מזה זה חידות בהסתברות שאם לא מבינים אותן נכון סתם מאבדים נקודות, וחצי מזה אלה שאלות סטייל מערכות הפעלה.\n\nהשורה התחתונה: קורס נחמד במהלך הסמסטר, המבחן פחות. אם לא מתחברים לנושא של רשתות תקשורת, ואיך מאפשרים תקשורת, אין סיבה לקחת את הקורס.", "timestamp": 1690312757542}, {"author": "כריס", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: מרצה מצוין. קצת מתמרח לפעמים על קטעים טכניים, הדגמות מwireshark וכו אבל אלה דברים שאח\"כ משלימים בקלות בשיעורי בית אם מאבדים ריכוז. \n\nשם המתרגל/ת: ערן תבור \nחוות דעת - תרגולים: מתרגל סבבה, בכל מקרה לדעתי השקופיות של התרגילים מספיק ברורות כדי להבין לבד גם לא הולכים לתרגולים. אבל בכלל לא כדאי לוותר על התרגולים, הם חוזרים על החומר כמו שצריך ופותרים בהם תרגילים חשובים. \n\nשעורי הבית: כבר פגשתם קורסים גרועים יותר. יבשים לא קשים בכלל, רטוב אחד שלוקח קצת זמן להבין את הרעיון אבל סה\"כ קצר. \n\nהמבחן: טריקי ודורש היכרות טובה עם החומר, אבל תרגול מספיק של מבחנים, והבנה טובה של תורת התורים, פרוטוקולי arq וmac יבטיחו לכם לפחות 75 נקודות. מעבר לזה נדרשת קצת היכרות עם כל מיני פינות בחומר, אז כדאי לעבור על כל ההרצאות והתרגולים לפני המבחן. \n\nהשורה התחתונה: אחד הקורסים המעניינים שלמדתי, מכסה כמות גדולה של חומר שלגמרי מרגיש רלוונטי. כדאי מאוד לנסות לעקוב אחרי ההרצאות והתרגולים לאורך הסמסטר, זה ישתלם לכם בלמידה למבחן.", "timestamp": 1715354055351}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: טל מזרחי\nחוות דעת - הרצאות: בעיני היה מאוד מרדים. חסר לטל קצת כריזמה בהרצאות. הוא מנסה להכניס הדגמות וסרטונים מצחיקים אבל ליטרלי נרדמים משעמום. מה שכן, הוא יודע את החומר ממש טוב. \nהחומר של הקורס הוא ככה-ככה. לא הייתי אומר שזה מעניין במיוחד, לא הייתי אומר שזה לא מעניין. לומדים בהחלט נושאים חשובים אבל מרגיש לי שאין באמת צורך להכיר נושאים מסוימים בקורס הזה כדי להיות בקיא ברשתות מחשבים. \n\nשם המתרגל/ת: ערן/עידו (מוקלט)\nחוות דעת - תרגולים: ערן היה ממש לא ברור כשהלכתי לתרגול הראשון ולכן ראיתי את רוב המוקלטים של עידו. הבעיה הייתה שחלק מהמצגות עודכנו בחורף שעבר או בחורף הזה ולכן לא באמת היה אפשר להסתמך על כל ההקלטות וזה אילץ אותי לצפות בערן מדי פעם. הוא קצת נמרח עם החומר וקצת מבולבל לפעמים. היו פעמים שהרגשתי שהוא גם לא באמת מכיר את החומר כמו שצריך. התרגולים יחסית סבבה ועוזרים לכסות את ההרצאות ולסגור פינות. \nבקורס רגיל הייתי מצפה שהתרגולים יעזרו להבין דברים שלא הבנת מההרצאה אבל פה זה היה הפוך. ההרצאות עזרו לי להבין הרבה חלקים מהתרגולים (אולי בגלל ערן ואולי לא).\n\nשעורי הבית: 4 תרגילים יבשים שהם בדרך כלל ממוחזרים או מבחינות עבר (שיש להם פתרון מלא) או מסמסטרים שעברו. ממש אחלה ואפשר לסיים בכמה שעות. \nיש תרגיל רטוב אחד שהוא דורש קצת הבנה אבל הוא ממש לא כבד.\n\nהמבחן: במבחן יש 4 שאלות. ה3 הראשונות פתוחות ודורשות לדעת לפתור שאלות בסגנון של מה שיש במבחני עבר, קצת תרגול ומסתדרים עם זה. השאלה האחרונה (5 שאלות אמריקאיות עם נימוק) דורשת לדעת ולהבין את כל ההרצאות אז שימו לב שאתם עוברים על החומר היטב. \n\nהשורה התחתונה: אני לא באמת מרגיש שלמדתי משהו בקורס הזה. חלק מהנושאים מסבירים לעומק איך דברים עובדים, חלק לגמרי מיותרים. אפשר לא באמת ללמוד אותו במהלך הסמסטר (בגבול הטעם הטוב) ועדיין לקבל ציון סבבה.", "timestamp": 1716145597675}]}