{"posts": [{"author": "idan fischman", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: הקורס עוסק באלגורתמים לקריאה וכתיבה מהירה מהתקני זיכרון שאינו נדיף (פלאש, הארד דיסק, דיסקים וכו׳), שנגזרים מתוך המגבלות הפיזיות שלהם. האלגורתמים יכולים לאפשר ביצועים גבוהים או תיקון שגיאות (או גם וגם).\nאחרי רקע קצר שמסביר את ״חוקי המשחק״ בכל פעם, ההרצאות הופכות להיות תיאורתיות ומדברים על בעיות מתמטיות וחסמים תיאורתיים שונים.\nבגדול יש שני נושאים מרכזיים שלומדים - אלגורתמים ל-SSD ואלגורתמים ל-DNA Storage.\n\nשם המתרגל/ת: דניאלה\nחוות דעת - תרגולים: לפעמים יש חזרה על חומר מההרצאות אבל בעיקר פותרים שאלות שונות שאחר כך משתמשים בעקרונות של זה בשביל תרגילי הבית. התרגולים עמוסים וכוללים הרבה חומר, בסמסטר קורונה דניאלה הרבה פעמים המשיכה את התרגול מעבר ל-50 דקות ומי שרצה יכל לראות את זה בהקלטה.\n\nשעורי הבית: החלק העיקרי בקורס והיה 60 אחוז תקף. אצלנו היו 4 תרגילי בית קשים. בגלל שזה חלק מאוד גדול בציון הם יותר קשים מתרגילי בית שעשיתי בקורסים אחרים. לרוב מדובר בהוכחות או בפתרון של ״חידות״ שקשורות לחומר. הבדיקה שלהם קפדנית ובדקו לנו את כל השאלות. אני לא חושב שהם משתנים מסמסטר לסמסטר, אבל לא צריך רפרנסים כי דניאלה ממש תשמח לקבוע שעות קבלה על תרגילי הבית ולעזור במה שצריך.\n\nהמבחן: אצלנו בסמסטר לא היה מבחן ובמקום זה עשינו פרויקט. בפרויקט לוקחים שאלת מחקר קטנה מבין הנושאים השונים שלמדנו בקורס ומנסים לענות עליה. רוב הדברים הם סביב DNA Storage ותיקון שגיאות בו. זה יכול להיות משהו תיאורתי או תכנותי, ולרוב הציונים בפרויקט מאוד גבוהים.\n\nהשורה התחתונה: בין הקורסים הכי מעניינים שעשיתי בתואר (אם לא הכי מעניין) ואני ממליץ עליו בחום למי שלא פוחד מתרגילי בית קשים ואוהב לחשוב ולפתור חידות. הקורס הוא קורס מתמטי תיאורתי, אמנם הציונים בקורס בסופו של דבר גבוהים אבל זה לא קורס מתנה. צריך להשקיע לאורך הסמסטר, וגם אחרי תקופת המבחנים כשעושים את הפרויקט.", "timestamp": 1635269875163}, {"author": "K", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: איתן יעקובי\nחוות דעת - הרצאות: ההרצאות הפרונטליות היו מאוד מעניינות וברורות יחסית. איתן יודע איך לשאוב את הקהל שלו לתוך עולם הבעיה ולרצות לפתור אותה יחד איתו. כשההרצאות עברו לזום זה היה סיוט. אי אפשר להבין את הכתב באייפד ובאופן כללי השיעורים היו משמעותית פחות ברורים.\n\nשם המתרגל/ת: דניאלה בר לב\nחוות דעת - תרגולים: מאוד אכפת לה מהסטודנטים, תמיד עונה לשאלות ונשארת לעזור. הבעיה בתרגולים שלה היו שהם בזום כל הסמסטר והיה קשה לעקוב ככה, למרות שהכתב שלה ברור בהרבה מאשר הכתב של איתן. בכל מקרה מתרגלת טובה מאוד ורואים שהיא יודעת את החומר.\n\nשעורי הבית: היו 3 גיליונות, כשהאחרון באורך כפול (במקום 4 שהיו בתכנון). הראשון היה קשה, השני מאוד מאוד קשה והשלישי היה בערך ברמה של הראשון. בסופו של דבר הם מאוד מאתגרים וגורמים להתעמק בחומר ולנסות לחשוב מחוץ לקופסה. רוב הפתרונות לא נמצאים באף מאמר בספרות, לכן חייבים מוח מתפקד בקורס. אה והשיעורים בזוגות.\n\nהמבחן: אין! יש פרויקט סוף בזוגות. עוד לא עשינו אותו, אבל נשמע מעניין. בוחרים נושא ובהכוונה של איתן ודניאלה מנסים לפתור בעיה. יש בעיות פרקטיות, עד לרמת כתיבת קוד, ויש בעיות תיאורטיות גרידא.\n\nהשורה התחתונה: קורס מומלץ לכל מי שאוהב את השילוב בין מתמטיקה למדעי המחשב. פותרים בעיות מתמטיות (בצורה קומבינטורית, הסתברותית, או מבוססת אלגברה מודרנית) שרלוונטיות לבעיות אמיתיות. ועוד יותר מומלץ למי שכבר לקח קורסים כמו תורת הצפינה, או קידודים במערכות אחסון מידע.", "timestamp": 1644572587672}, {"author": "R", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nמיקי אלעד\n\nחוות דעת - הרצאות: \nמעניין מאוד, אבל מדובר בנישה מאוד ספציפית\n\nשעורי הבית: \nקלים\n\nהמבחן: \nהיה מבחן אמריקאי סביר על ההרצאות, משתנה מסמסטר לסמסטר\n\nהשורה התחתונה: \nמעולה, פגשתי שם את חברה שלי", "timestamp": 1647532587117}]}