{"posts": [{"author": "Hamming", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מרצה מעולה. אפילו בזום הצליח לשמור על רמת הרצאות גבוהה ולשלב בין כתיבה על הלוח, להקרנת דוגמאות מהספר שלו. מצליח להסביר גם את הנושאים הכי קשים בצורה ברורה ומעביר את החומר בצורה מעניינת ממש. מראה את היופי של המתמטיקה ואיך היא משפיעה על הפרקטיקה של הקידוד. בנוסף, עוזר מאוד לעקוב במקביל אחרי ספר הקורס (שרוני כתב בעצמו).\n\nשם המתרגל/ת: רמי\nחוות דעת - תרגולים: רמי מתרגל מאוד מאוד חמוד. הוא גם הכין לנו מצגות מפורטות ומועילות הסמסטר. הוא לא מסביר את החומר טוב כל כך (רץ מהר מדי), אבל תמיד שמח לענות על שאלות ולעזור, וזה הכי חשוב. את החומר אפשר גם לקרוא לבד מהמצגת, או מספר הקורס, אחרי התרגול, או בזמן צפיה בהקלטה.\n\nשעורי הבית: 5 תרגילי בית לתקופה של שבועיים כל אחד. תרגילים די ארוכים (מקבץ תרגילים מספר הקורס), רובם לא מאוד קשים. חלקם כן. מאוד מלמדים ומחזקים את ההבנה של החומר.\n\nהמבחן: קשה מאוד, אי אפשר להספיק את כולו, אבל הבדיקה מקלה. הציונים בסוף מסתדרים אם מתכוננים טוב למבחן.\n\nהשורה התחתונה: הקורס הכי טוב שלקחתי בתואר באופן חד משמעי.", "timestamp": 1612857871362}, {"author": "Solomon", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מעולות. המרצה עומד עם לוח, אפילו בזום, ודורש תשובות מהסטודנטים, מה שמגביר קשב בין השאר.\nבנוסף הקורס עוקב אחרי ספר הקורס (שמסופק בחינם) במדויק ולכן כשחוזרים על החומר הוא זמין בצורה כתובה.\n\nשם המתרגל/ת: רמי\nחוות דעת - תרגולים: רמי מתרגל משקיע, ועונה במיילים, אבל התרגולים פחות מובנים.\n\nשעורי הבית: 5 גיליונות, שהם למעשה שאלות מספר הקורס. שאלות קלות לא דורשות זמן, אבל יש שם שאלות קשות שמהוות רוב העומס. לא ניסיתי אבל אני מניח שאפשר לבוא לשעת קבלה ולקבל עזרה וכך להפחית את כמות הזמן שמושקע בתרגילים.\n\nהמבחן: נתנו מבחני הכנה ממש קשים, והייתי בטוח שאני הולך לחטוף במבחן, אבל המבחן עצמו היה בסדר גמור, וביחד עם הבדיקה המקלה (לא נתפסים פה לקטנות) קיבלתי ציון מעולה\n\nהשורה התחתונה: קורס מומלץ לכל מי שנהנה במודרנית (לפחות מהחומר).", "timestamp": 1614587532280}, {"author": "BCH", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: rony rott\nחוות דעת - הרצאות: הצראות מאד מאד מעניינות, צריך להיות תמיד על החומר לארוך כל הסמסטר, כי אחרת הולכים לאיבוד וקל מאד לצבור פערים. \n\nשם המתרגל/ת: בועז \nחוות דעת - תרגולים: תרגולים היו בסדר, לפעמים הרגיש קצת משעמם, אבל בועז היה תמיד עוזר במיילים וענה לשאלות בסבלנות ותמיד היה זמין לכל שאלה.\n\nשעורי הבית: אין רפרנסים להיעזר בהם, בכללי יש שאלות שהם מהווים את רב העומס של התרגילים, ובכללי ת.ב דורשים זמן. \n\nהמבחן: המבחן עצמו לא קל בכלל, המון המון סעיפים וחלקם מאד קשים ודורשים המון זמן ויצירתיות והמבחן דורש יותר מ 3 שעות כדי להספיק את כולו, והוא קשה מאד. \n\nשורה תחתונה: חומר מאד מעניין, ש.ב דורשים זמן, מבחן דיי קשה, מומלץ עם סמסטר לא כ\"כ עמוס ע\"מ להשקיע בו כמו שצריך ולהבין את הכל לעומק.", "timestamp": 1675247940998}, {"author": "Alternant", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: מרצה בקצב של טייס מירוצים. פעם אחת נשארו 2 דקות לסוף השיעור והוא אמר \"בואו נתחיל להוכיח את המשפט\", שירבט קשקוש מתמטי על הלוח ואמר \"נכון יפה?\" ואז שיחרר אותנו דקה לפני הסוף.\n\nשם המתרגל/ת: בועז\nחוות דעת - תרגולים: מתרגל מדהים, ברור, אכפתי ונותן מעצמו מעבר למצופה.\n\nשעורי הבית: קשים עד בלתי אפשריים.\n\nהמבחן: לא החזקתי מעמד עד המבחן.\n\nהשורה התחתונה: בתור מישהו עם 90 ומעלה בחישוביות, קומפי, אלגברה א', אלגברה מודרנית, אלגו, ומה שלא תרצו, אני אומר לכם - תברחו וכמה שיותר רחוק מהקורס הזה. חשבתי שאלה יהיו 3 נק\"ז בחירה שאעביר בכיף, אבל בפועל זה הקורס הכי קשה בטכניון, כמה סדרי גודל יותר מכל קורס שעשיתי. פעם ראשונה שישבתי ימים שלמים מול תרגיל בית ולא הבנתי מה לעשות, ובסוף כשיצא משהו שחשבתי שאני מבין, מסתבר שלא הייתי בכלל בכיוון.\nלמי זה כן מתאים: מישהו שמוכן להשקיע כמה שעות טובות בשבוע כדי לחזור ולהבין את ההרצאות, וגם לקרוא אותן טוב לפני השיעור כי בלי זה אי אפשר לעקוב. כמו כן תעשו חזרה מקיפה על אלגברה א' לפני, גם מודרנית לא יזיק אבל לא חובה כי על זה עושים חזרה בתרגולים הראשונים.", "timestamp": 1692552762034}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: רוני רוט\nחוות דעת - הרצאות: רוני מרצה מעניין, ורץ על ההרצאות בקצב גבוה ככה שקצת קשה לעקוב.\n\nשם המתרגל/ת: בועז מואב\nחוות דעת - תרגולים: מתרגל תותח, אכפתי ומסודר.\n\nשעורי הבית: חלק קלים וחלק קשים בסך הכול סבבה\n\nהמבחן: היה ארוך בצורה קיצונית(20 סעיפים) רובו לא קשה, פשוט היה מחסור בזמן. היה פקטור משמעותי\n\nהשורה התחתונה: קורס מומלץ לאוהבי התחום, אם אתם לא אוהבים את התחום תתרחקו.", "timestamp": 1717499819083}]}