{"posts": [{"author": "מיכאל", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איתי דברן\nחוות דעת - הרצאות: חפירה ענקית ולא קשורה לפרויקט. זה תקציר של של 5 קורסים אחרים בפקולטה. מי שעשה רשתות והגנה ופיסיקה 2 מכוסה כמעט על כל החומר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש להעביר מצגת שקשורה איכשהו ל-IoT במהלך הסמסטר והיא 15% מהציון. הסגל לא עוזר בזה ורק מוריד נקודות באופן שרירותי לאחר ההצגה.\n\nהמבחן: קל אבל חפירה של ההרצאות. לא היה משוב אמיתי להורדת הנקודות במבחן.\n\nהשורה התחתונה: שעמום, אבל בסך הכל 2 נקודות די קלות.", "timestamp": 1633249871534}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איתי דברן\nחוות דעת - הרצאות: \nיש 4 תרגולים שמועברים בשבועות הראשונים ע\"י המתרגלים השונים בקורס בנושאים יותר פרקטיים שאמורים לעזור בפרוייקט. בפועל הרלוונטיות של כל אחד מהתרגולים לפרוייקט מאוד משתנה בין הפרוייקטים השונים. מה שחבל זה שאפילו אם הנושא ממש לא רלוונטי לפרוייקט שלכם, זה חומר למבחן.\n\nחוץ מזה יש מספר לא מבוטל של שעות הרצאה שהולכות על \"שונות\": סמינרים שכל קבוצה צריכה להעביר (לא למבחן), מרצים אורחים שאיתי מביא (לא למבחן), peer review - בערך באמצע הסמסטר כל קבוצה מציגה מה הם עשו עד עכשיו בפרויקט.\n\nיתר הזמן נשאר להרצאות של איתי, וזה מהווה את רוב החומר למבחן. איתי מנסה לענות על השאלה מה זה IOT, והתשובה היא שזה לא ממש ברור לאף אחד, ולכן מועברים בקורס הזה כל מני נושאים שונים קשורים יותר או פחות ובצורה מאוד לא מעמיקה.\n\nשעורי הבית: \nאין, צריך להכין סמינר בנושא שבוחרים מתוך רשימה. 20 דקות הצגה בקבוצה של הפרוייקט. צריך להגיש את המצגת ובנוסף מסמך של 8 עמודים (!) שמפרט את כל תוכן הסמינר.\nציון על הסמינר קיבלנו עם ציון המבחן, ובלי שום פידבק או נימוק למה ירדו נקודות.\n\nהמבחן: \nלא קשה, אבל מהמבחנים הפחות ברורים שיצא לי לחוות. היו הרבה הבהרות של מתרגלים ושל המרצה במהלך הבחינה.\nבנוסף החומר ברובו המוחלט לא רלוונטי לעשייה במהלך הסמסטר, אז כשבאים ללמוד למבחן מרגיש שלומדים הכל דיי מאפס. לפחות אין הרבה חומר.\n\nהם אוהבים לתת שאלות שנתונות לפרשנות, כך שאין תשובה יחידה שהיא בבירור נכונה, אבל הם כן מחפשים מילות מפתח בנימוקים ומורידים נקודות אם לא כתבתם משהו שרירותי שהם החליטו שצריך לכתוב. \nתראו כמה סריקות ותבינו שככה המבחן הזה מתנהל בכוונה (זה לא משהו נקודתי במועד יחיד).\nאז המלצה: תכתבו הרבה, גם אם אתם חושבים שזה לא מתבקש מניסוח השאלה...\n\nהשורה התחתונה: \nהקורס הזה לא נותן הרבה, יכול להיות מתסכל כי הציונים על הסמינר והמבחן מגיעים בלי שום פידבק (אבל עדיין הממוצע בסדר). הפרוייקט מומלץ באופן כללי, למרות הקורס הזה ולא בזכות.", "timestamp": 1657121296886}, {"author": "מודל 7 השכבות", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: איתי דברן\nחוות דעת - הרצאות: באלוהים שאין לי מושג מה הקשר בין הפרויקט לדברים שעוברים בקורס המוזר הזה. אם מישהו רוצה לראות משהו מצחיק שיקרא את המצגות של הקורס.\n\nהמבחן: כמו המצגות בערך\n\nהשורה התחתונה: הפרויקט אחלה, צריך להכיל את הקורס.", "timestamp": 1689597924602}, {"author": "מדמחיסט מסכן", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: איתי דברן\nחוות דעת - הרצאות: ואללה היו מעניינות. גם כן איתי מרצה טוב, כך שהוא מעביר את החומר בצורה מעניינת. הוא מדבר ברוגע ובטון נמוך, ולכן קשה לא להקשיב אליו.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: היינו צריכים להכין סמינר באמצע הסמסטר (כל קבוצה כמובן) שיש עליו משקל של 30%, בצורה של מצגת PowerPoint ואז להציג את זה מול הכיתה. לא משהו רציני, אבל טוב להתכונן לזה. ממוצע הסמינר בסמסטר שלנו היה 91 לצערי.\n\nהמבחן: לא קשה, אבל גם לא כזה דומה לתבנית המבחנים של השנים האחרונות. בחרו לשאול שאלות שוליות על דברים שאף אחד לא ציפה איתך לדעת/לזכור כדי לנרמל ממוצע, כך שלדוגמה הציון המקסימלי במועד א היה 95, וממוצע 86. קשה להסביר, אבל פשוט תראו לדוגמה את שאלות 1 ו- 2 במבחן שלנו ותצחקו. גם קחו בחשבון שציון הסמינר יכול להשפיע (לרעה אם תקבלו ציון יותר גבוה יחסית בבחינה).\n\nהשורה התחתונה: אין עומס בקורס בכלל, בשונה מהפרויקט ששם כן צריך להתאמץ קצת יותר. גם אל תפתחו הרבה ציפיות טובות לגבי הבחינה הסופית שלא תופתעו לרעה. בהצלחה :)", "timestamp": 1716750333042}]}