{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: לא רלוונטי\nחוות דעת - הרצאות: לא רלוונטי\n\nשם המתרגל/ת: אביב נחמן\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: לא רלוונטי\n\nהמבחן: לא רלוונטי\n\nהשורה התחתונה: קורס קליל ביותר, 0 מאמץ, סדנאות בשיעור אחרי הסבר קצרצר וציונים גבוהים", "timestamp": 1601971622347}, {"author": "פישר תסתפר", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלדר פישר תסתפר\nחוות דעת - הרצאות: לא יודע לא הייתי אבל בתכלס לא כזה מרצה ברור. החומר לא פשוט בכלל.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: לא מרופרנסים ומאוד קשים, 4 בכל הסמסטר. אי אפשר למצוא רפרנס באינטרנט, הם קשים ואם אתם לא על החומר אז בהצלחה למצוא סחבק שישלח את הפתרון שלו.\n\nהמבחן: אין\n\nהשורה התחתונה: לא מומלץ אם מתכוונים לא להיות על החומר כל הסמסטר. אם תהיו על החומר אז זה סבבה.", "timestamp": 1656364680653}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלדר פישר\nחוות דעת - הרצאות: מרצה לא ברור בשיט\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: לא ברור מאיפה הוא מביא אותם\n\nהמבחן: אין\n\nהשורה התחתונה: קורס זוועה, אי אפשר להבין מילה של המרצה וגם חוברת הקורס כתובה בשפה בלתי נגישה לחלוטין, ממש לא מומלץ וחבל, חומר הקורס יכול להיות מרתק ביקום מקביל.", "timestamp": 1660660482737}, {"author": "תומר אדר", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלדר פישר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: תומר אדר (גילוי נאות: המלצת המתרגל החדש)\nחוות דעת - תרגולים: החל מסמסטר אביב 2023 נוסף תרגול של שעתיים שבועיות. מספר הקורס השתנה ל-236669 ושם הקורס החדש הוא \"נושאים מתקדמים במבוא לבדיקת תכונות\".\nבבניית התרגולים נלקחו בחשבון חוות דעת של סטודנטים שלמדו את הקורס בגלגולו הקודם (236620). הוספת שעות תרגול צפויה להקל באופן מהותי על הבנת חומר הקורס.\nהעומס בקורס דומה או מעט פחות מ\"שיטות הסתברותיות ואלגוריתמים\".\n\nשעורי הבית: ארבעה תרגילים. התרגיל האחרון מחליף את המבחן. (אותו פורמט של \"236374 שיטות הסתברותיות ואלגוריתמים\").\n\nהמבחן: אין.\n\nהשורה התחתונה: אין הנחתום מעיד על עיסתו, אבל מומלץ בחום לכל מי שאהב את \"שיטות הסתברותיות ואלגוריתמים\" או מתכנן ללמוד אותו.", "timestamp": 1673337053544}]}