{"posts": [{"author": "כינוי", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: יש הרצאות מוקלטות ואז בשעת ההרצאה דנים על החומר שהועבר בוידאו. הדיון הזה לא כל כך תרם לי.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: התרגולים מאוד חשובים ומסדרים כמה עניינים לא ברורים מההרצאה וחשובים לשיעורי בית.\n\nשעורי הבית: רטובים וגם יש חלק יבש של לנתח תוצאות ולהסביר מה עשינו בחלק הרטוב.\nהש.ב עזרו לי להבין יותר טוב את החומר ולהיסגר עליו.\nבדרך כלל שיעורי הבית היו לממש אלגוריתמי אופטימיזציה שראינו בהרצאה וזה מגניב לראות אלגוריתם כזה שמוצא מינימום לפונקציה תוך איטרציה אחת.\n\nהמבחן: אצלינו הודיעו מראש על 33 שאלות ומתוכן יילקחו 2 שיופיעו במבחן. אם עוברים על כל השאלות מספיק פעמים ומספיק טוב אז זו לא בעיה לקבל 100 במבחן (היו הרבה אצלינו שקיבלו 100 ובין היתר אני :)).\n\nהשורה התחתונה: יש הרבה בונוסים שמוצעים לסטודנטים (בסמסטר שלנו כל סטודנט יכל להשיג 4 נקודות לציון הסופי) ככה שבסוף הציון יוצא מאוד גבוה.\nמלמדים בסוף הקורס על רשתות נוירונים ולדעתי זה קורס מומלץ למי שרוצה להיכנס לתחום של למידה עמוקה.\nבכל שימוש בלמידה עמוקה משתמשים בכלים מהקורס.", "timestamp": 1597819984223}, {"author": "כינוי", "difficultyRank": 4, "generalRank": 3, "semester": "201902", "text": "שם המרצה: מיכאל ציבולבסקי\nחוות דעת - הרצאות: במתכונת כיתה הפוכה: רואים מראש וידאויים בבית ובשעות ההרצאה המרצה מסביר את אותו החומר ו/או פותרים שאלות. פחות אהבתי את הוידאויים אבל המרצה אחר כך הסביר טוב וזה עזר ועשה שכל.\n\nשם המתרגל/ת: מר רועי וליץ'\nחוות דעת - תרגולים: התרגולים בהתחלה הוקלטו (בגלל הקורונה) אבל משלב מסויים חלק מהתרגולים נהיו סנכרוניים דרך הזום. היו שני מתרגלים- רועי ונדב. רועי היה משקיע ומפרט תרגולים של שעה במשך שעתיים. נדב בעיקר הקליט סרטונים של עצמו מסביר ממש מהר והיה עדיף לעבור על השקפים שלו לבד. אבל זה בגלל הלמידה הוירטואלית והבלגן שהיה באותו סמסטר- יתכן שבסמסטר רגיל התרגולים מועברים מסודר יותר.\n\nשעורי הבית:  היו אמורים להיות 5 ואיחדו לנו את שני הגיליונות האחרונים לאחד ממש גדול כי ביקשנו. מעט תיאוריה ובעיקר מימוש של אלגוריתמים שלמדנו עליהם. דרשו לי כמה ימים-שבוע, תלוי בגיליון ובכמה מיומנים וחדים על החומר. לפעמים לא היו מנוסחים ברור והיה בלגן.\n\nהמבחן: לרוב יש מבחן רגיל (שטוענים שהוא קל יחסית בדרך כלל). אצלינו בגלל הקורונה היה מבחן דרך הזום במתכונת אחרת של שתי שאלות מתוך מאגר של 33 שאלות ידועות מראש + היינו צריכים להקליט את עצמינו מסבירים 12-20 שאלות בימים שהיו קרובים למבחן. לא חושבת שזה יחזור על עצמו אבל מי יודע. מי שיודע את החומר הציונים גבוהים, לרוב 90-100.\n\nהשורה התחתונה: הממוצע גבוה אבל אני חוויתי את הקורס כעמוס ומאוד מאוד מבולגן. לא מלמד אופטימיזציה בצורה מאוד יסודית ופנדמנטלית אלא יותר כמו קורס טעימות כזה ונותן תחושה של התחום.", "timestamp": 1603125105921}, {"author": "וואלק תקשיבו", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ציבולבסקי \nחוות דעת - הרצאות: מיותר ביותר. התייאשתי אחרי 10 דקות של בלבולי מוח באנגלית-רוסית. כדאי לקרוא את הסיכומים בעברית וגם זה ברפרוף בצעדים קליליים.\n\nשם המתרגל/ת: רועי \nחוות דעת - תרגולים: מ-י-ו-ת-ר. כמעט 95% חומר הוא הקדמה שלא צריך ורק בסוף יש קצת תרגילים קצת מועילים. \n\nשעורי הבית: תרפרנסו בליינד בכיף. לא שווה השקעה.\n\nהמבחן: קל רצח! לגשת רק למועד א'!!!! כדי להתכונן למבחן תעברו על החלק של התרגילים בתרגולים+33 השאלות (לא צריך בצורה קדחתנית מדי)+ לתרגל מבחנים. השאלות חוזרות על עצמן. בגדול אם הסתדרתם עם אלגברה ליניארית בהוכחות מינמליות, כל השאר זה סתם.\n\nהשורה התחתונה: קורס מדהים אבל ממש לא מהסיבה הנכונה. הוא מתאים ביותר למי שמחפש \"למלא משבצות\" ולסגור תואר.", "timestamp": 1627718910746}, {"author": "צצ", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "זבל של קורס\n.", "timestamp": 1634329939279}, {"author": "רועי", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "הרצאות על הפנים, והקורס הזוי בדרישות שלו,\nמאוד לא ממליץ, אולי כדאי לבוא רק בגלל הממוצע", "timestamp": 1652444943409}, {"author": "A", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "2 ביקורות לפני מישהו רשם \"זבל של קורס\", שזו לדעתי ממש חוצפה להגיד כזה דבר בלי להתייחס למה שיש בקורס בכלל, כשיש סגל שעומד מאחורי הקורס והכל...\n\nאבל הסמסטר לקחתי אותו ועוד שנייה הוא נגמר, ו.. וואלה זבל של קורס.", "timestamp": 1655123674488}, {"author": "--", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל זיבולסקי\nחוות דעת - הרצאות:  ההרצאות הן הקלטות משנת 2008 באיכות נמוכה באנגלית לא טובה. קשה מאוד להבין מהן משהו. בנוסף, מתקיימות הרצאות במתכונת של כיתה הפוכה שהסיסמטר היו עם נוכחות חובה ובוחן כניסה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: לא היו תרגולים הסמסטר, וחבל, כי הם הדבר היחיד שאפשר להבין משהו (ראיתי הקלטות מסמסטרים קודמים)\n\nשעורי הבית: מעט ארוכים, אבל סבירים. היתה בדיקת עמיתים, כלומר בדקנו אחד לשני את שיעורי הבית. חבל, כי ככה אי אפשר לקבל ביקורת אמיתית\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: הקורס הכי מבולגן שעשיתי בחיים. נהלי הקורס נקבעו רק אחרי שהוא התחיל, והועברו בחתיכות. המון עבודה שחורה והיקפית שלא תורמת להבנה בכלל. ממליצה להתרחק כמה שאפשר", "timestamp": 1655451927450}, {"author": "פלוני", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: Michael\nחוות דעת - הרצאות: אנגלית, לא מובנות, הקלטות ישנות מאוד. חוץ מזה הוסיפו כל מיני קטעים מעצבנים, נוכחות חובה, מיני בוחן בכל הרצאה...\n\nשם המתרגל/ת: נתנאל\nחוות דעת - תרגולים: לא היו.\n\nשעורי הבית: רובם מרופרנסים, למרות שגם פה יש כל מני קטעים מאוד מעצבנים שמעיקים על הסמסטר ומבזבזים המון זמן. ביקשו להקליט סרטון בו מסבירים את כל ההגשה כולל הקוד. בנוסף הוסיפו שאנחנו צריכים לקבוע את הציון לאחרים, הערכת עמיתים שגם מבזבזת המון זמן. מה גם שאחרי זה הורידו לאנשים נקודות כי לא עשו את הערכה מזפיק טוב לטעמם.\n\nהמבחן: עוד לא היה אבל אנחנו לקראת הסוף וטרם יצאו הנחיות ברורות מה שככל מאפיין את כל הקורס\n\nהשורה התחתונה: מחכה למבחן כדי להגיד אם מומלץ מבחינת ציון סופי...", "timestamp": 1656236434168}, {"author": "מאור סולימה", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל\nחוות דעת -הרצאות: מזעזע, מבולגנים, ארוכים מאוד כאילו זה קורס של 5 נקז. מבטא כבד מאוד ובלתי מובן\n\nשם המתרגל/ת: לא היה\nחוות דעת - תרגולים: \n\nשעורי הבית: רגילים וסבירים\n\nהמבחן: טרם היה\n\nהשורה התחתונה: חרא קורס, מזעזע. חומר חשוב לנושא של ML DL אבל פשוט קורס זבל, הסגל מנפיצן", "timestamp": 1657557796407}, {"author": "אבו ליל", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: זוברוסקי\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים: לא יודע\n\nשעורי הבית: יש רפרנס\n\nהמבחן: קל מאוד\n\nהשורה התחתונה: מי שאומר חרא של קורס או זבל של קורס זה סתום.", "timestamp": 1658016420962}, {"author": "ש", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "באמת זבל של קורס", "timestamp": 1658061927139}, {"author": "איש", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ציבולסקי\nחוות דעת - הרצאות: על הפנים, הקלטות ישנות, לא מובן\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: בסדר\n\nהמבחן: הסמסטר היה לי ספציפית קשה, נחכה לציונים\n\nהשורה התחתונה: פח זבל של קורס , לברוח", "timestamp": 1658422404252}, {"author": "זוהר ארגוב", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "זבל של קורס\nכדאי לסטלנים, למתמטיקאים ומה שביניהם", "timestamp": 1659380551273}, {"author": "קרוש קון טוקר", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל ציבולבסקי\nחוות דעת - הרצאות: המרצה מפנה אתכם להרצאות מוקלטות באיכות בינונית מינוס, מלפני 13 שנה עם \"פאטצ'ים\" של עדכונים מאוחרים יותר. זה די משעמם, באנגלית לא תמיד ברורה, קשה להקשיב ככה. אין פיתוחים אלא בעיקר תוצאות סופיות. את הפיתוחים תעשו במבחן. בשעת ההרצאה המקורית יש כיתה הפוכה מקוונת, בה צריך להגיש בוחן בתחילת כל שיעור וגם פתרונות לבעיות לדוגמה שהמרצה נותן במהלך השיעור. זה משעמם כל כך שקשה מאוד להחזיק מעמד שעתיים שלמות.\nשם המתרגל/ת: לא היה.\nחוות דעת - תרגולים: התרגולים של הקורס מוקלטים אף הם, ויש מצגות ודוגמות. אפשר ללמוד לא מעט מהתרגולים המוקלטים.\nשעורי הבית: מלמדים טוב את החומר, אבל התרגילים הרטובים ארוכים מאוד. אין הדרכות או דוגמות קוד בתרגולים ובחומר הקורס. ואפשר להתקע על המון שטויות בגלל זה. מבאס.\n\nהמבחן: הסמסטר היה מבחן קשה מהרגיל ולא צפוי כל כך. המרצה שינה כיוון לעומת שנים קודמות - מבחינת השאלות ורמת הקושי שלהן. הניסוחים מטעים ומבלבלים, לא הבנתי את כוונת המשורר והרבה נקודות ירדו לפח. הערעור בדרך.\n\nהשורה התחתונה: כנראה שזה באמת קורס גרוע. אל תתנו לממוצע ולחציון להטעות אתכם - אתם לא תהנו בכלל בדרך ל-100 שתקבלו. כל הקורס היה מקוון וזה רע מאוד. בקיצור אם תהיה קורונה-2 זו תהיה הסיבה היחידה ששווה לעשות את הקורס הזה מקוון. לכו לאופטימיזציה של מתמטיקה, כנראה שכל חלופה אחרת תהיה טובה יותר מ236330.", "timestamp": 1659436862922}, {"author": "SR", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל ציבולסקי\nחוות דעת - הרצאות: נוראיות. הקורס מתנהל בשיטה של כיתה הפוכה, שבה צופים קודם כל בהקלטות ואז בהרצאה הפרונטלית דנים על הנושאים שהועברו בהקלטה ופותרים שאלות. ההקלטות משעממות מאוד וגם הרבה פעמים לא מובנות בכלל. גם החליטו להכניס קטע מעצבן שיש חידון שצריך לענות בכל הרצאה עם נוכחות חובה.\n\nשם המתרגל/ת: לא היו תרגולים\n\nשעורי הבית: סבירים. יש 4 תרגילים שכוללים חלקים יבשים ורטובים. אפשר לסיים בכמה ימי עבודה כל אחד. מה שמאוד מעצבן שצריך להקליט את עצמך מסביר את כל התרגיל וגם העובדה שהיה צריך לבצע הערכת עמיתים לסטודנטים אחרים. \n\nהמבחן: היה קשה והציונים היו בהתאם. ניתן פקטור משמעותי, אבל בכל זאת הממוצע לא דומה לסמסטרים קודמים (וכנראה שגם כבר לא יהיה).\n\nהשורה התחתונה: בעיניי הסיבה היחידה לקחת את הקורס היא הציונים, אלא שהם כבר לא כאלה גבוהים כמו שהיה, ולכן אני לא ממליץ על הקורס. כל הבלגן והטרחה העודפת שהוא דורש לא שווים את זה. חפשו קורס בחירה אחר מעניין.\nזבל של קורס.", "timestamp": 1659540317559}, {"author": "צחי המפרום", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: הרצאות מוקלטות, כשכל חלק מהרצאה ממקום אחר, משנה אחרת ובפלטפורמה אחרת (רובם מ2008 או משהו כזה, הן הוקלטו על קלטת), רמת הוראה ממש גרועה ובעיקר נפנוף ידיים ודברים שהמרצה הזה המציא ולא מוגדרים טוב בכלל.\nחוץ מזה יש כיתה הפוכה נוכחות חובה בזום (לא אמרו על זה לפני אלא רק בתחילת הסמסטר) עם בוחן תקף בתחילת כל הרצאה. 30 דקות ראשונות של כל כיתה הפוכה זה דברים טכניים והתעסקות של המרצה בדברים כמו למצוא עוד 2 סטודנטים שיקליטו את הכיתה ההפוכה למרות שאף אחד לא באמת רואה את ההקלטה כי היא מיותרת.\n\nשם המתרגל/ת: היו כמה, לא זוכר את שמם\nחוות דעת - תרגולים: זה היופי, אין! המתרגלים מתפקדים רק כשוטרים בקורס הזה ומתעסקים במנהלות, אז אי אפשר להבין באמת את ההרצאות הבלתי נסבלות\n\nשעורי הבית: דווקא סבירים וכן קצת מלמדים, כמות סטנדרטית לדעתי, אבל אז מגיעות הנפצות:\nכל אחד צריך להקליט את עצמו מסביר על כל הקוד וכל החלק התאורטי שזה מיותר לגמרי. \nאחר כך כל אחד בודק ל2 סטודנטים אחרים את השיעורי בית, והוא חייב למצוא על מה להוריד 2-3 נקודות אחרת יקבל בראש. היו סטודנטים שבאמת לקחו את זה ברצינות וראו את ההקלטות של ההסברים של אחרים, בדקו את הקוד וכו... וזה נראה לי הבדיקה הכי רצינית של תרגילי בית שהייתה אי פעם בפקולטה הזו.\n\nהמבחן: הוא בעצם הסיבה העיקרית שכולם באים לקורס הזה. בסמסטר הראשון של הקורונה המבחן היה בדיחה: כל השאלות היו מתוך מאגר ידוע מראש של 33 שאלות והממוצע בהתאם, אבל זה כבר ממש לא ככה. המאגר של השאלות הסמסטר היה רשימה של כל הסילבוס של הקורס, ולא שאלות אלא פשוט שמות של נושאים, בקיצור כמו כל קורס. הייתה שאלה להוכיח משהו שהמרצה הסביר בנפנוף ידיים בהרצאה  (כמובן בצורה מאד לא ברורה) ועוד שאלה שהיא ממש שאלה מהמאגר בשווי 10 נקודות וכל השאר היה ממש קשה, היה פקטור שורש על המבחן שזה אומר הרבה.\n\nהשורה התחתונה: \nאני 4 שנים פה ועומד לסיים, ראיתי הרבה קורסים שמתנהלים יותר טוב ופחות טוב, אבל הקורס הזה הוא תת רמה שלא יכלתי לדמיין. גם ברמת ההוראה שבפער הכי גרועה שראיתי, וגם במנהלות וביחס ושקיפות כלפי הסטודנטים (נהלי קורס לא ברורים, משתנים במהלך הסמסטר, מודיעים הודעות בקבוצת וואטסאפ במקום מייל).\n\nאם אתם עושים את הקורס בשביל ציון גבוה בקלות - אז המאמץ שתשקיעו בקורס הזה הוא לא פחות ממה שתשקיעו בקורסים מתקדמים אחרים, כדי לקבל את הציון הגבוה תצטרכו באמת ללמוד כמו שצריך כל הסמסטר, לעשות שיעורי בית וללמוד כמו לכל מבחן (אגב הם מסרבים לפרסם מבחני עבר מאחרי 2018 אז זה מאד מאתגר ללמוד) ולא בטוח שתקבלו ציון גבוה. הסמסטר הממוצע קצת ירד וכנראה שימשיך לרדת.\n\nאם אתם עושים אותו בשביל ללמוד או כי הוא מעניין אתכם, זה בכלל לא המקום, יש קורסים מעניינים אחרים ויש קורסים לא רעים באופטיציזציה בחשמל/תעשייה וניהול/מתמטיקה.\n\nכמיטב המסורת אוסיף: זבל של קורס", "timestamp": 1659557084333}, {"author": "מגניבול", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה:  ציבולבסקי מיכאל\nחוות דעת - הרצאות: גרועות\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: לא היו תרגולים בסמסטר הזה \n\nשעורי הבית: בסדר גמור, מלמדים ולא עמוסים יותר מידי. היו 4 תרגילים. אבל הבדיקה שלהם הייתה על ידי בדיקת עמיתים שזה מעיק מאד.\n\nהמבחן: היה מבחן קשה משמעותית ביחס לשנים קודמות. עשו פקטור שורש\n\nהשורה התחתונה: הקורס הזה הוא דוגמה לאיך לא העביר קורס. נהלים מחורטטים שממוצאים תוך כדי הסמסטר, כיתה הפוכה עם הרצאות וידאו באיכות לא טובה, מבחינת איכות הקלטה ומבחינת איכות הוראה.  מרצה שלא מחובר למציאות", "timestamp": 1659621145935}, {"author": "פיקאצו", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא ברור לא מובן \nנוראי .\nמצד שני תעברו על זה לפני הבחינה, כי משם הגיעו 60 אחוז מהשאלות .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין אבל יש מוקלט מהסמסטרים הקודמים שהוא סביר יחסית . ראיתי את התרגולים וזה עזר לפני המבחן.\nשעורי הבית: \nיש רפרנס \n\nהמבחן: \nכולם אמרו שהיה קשה אבל אני למדתי מהתרגולים והיה לי קל יחסית הוצאתי מעל 90 לפני פקטור.היה פקטור שורש אז הממוצע הוא בסביבות 86. \n\nהשורה התחתונה: \nלברוח כי עדיין זה הקורס עם הכי הרבה השקעה לקראת המבחן ואני לא בטוחה שיש איזשהוא שימוש לדבר הזה .מעבר לאיכות הוראה מזעזעת ונהלים לא ברורים .עדיף שלא באמת.. פשוט עדיף שלא. \nפשוט לברוח \nזבל של קורס", "timestamp": 1659631273318}, {"author": "נמר הכסף", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "גם אני ראיתי את הביקורות לפני שהתחלתי את הקורס ואמרתי שזה שטויות והכל שווה ממוצע כזה, אל תעשו את הטעות שלי! מבטיח לכם שתתחרטו, זה פשוט זבל של קורס.", "timestamp": 1659697232245}, {"author": "מאוכזב", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל למיאכפת\nחוות דעת - הרצאות: פשוט נוראי, מועברות באנגלית קלוקלת תוך כדי כל מיני חובות של בוחן בהתחלה והעלאת מה שכתבת תוך כדי, כל השעתיים עובר על דברים שאומר לראות קודם במוקלט בצורה אפילו יותר לא ברורה\n\nשם המתרגל/ת: נתנאל. \nלא היו תרגולים אבל הטעה אותי בצורה בוטה במבחן ואחרי זה לא קיבל את זה בערעור. עשה רושם לא נעים \nחוות דעת - תרגולים: לא היו תרגולים\n\nשעורי הבית: \nמרופרנסים\nהמבחן: היה יותר קשה משנים קודמות\n\nהשורה התחתונה: אל תגעו בקורס הזה, הוא היה האחרון שלי בתואר ופשוט נגעלתי מכל רגע ממנו. חומר נחמד שמועבר בצורה מזעזעת תוך כדי בלבול מטורף של הסטודנטים תוך כדי .\nבבקשה אל תרשמו אליו מגיע לקורס הזה להכחד, הדבר הכי מגעיל שקרה לי בטכניון", "timestamp": 1661242636426}, {"author": "יואב", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: מיכאל\nחוות דעת - הרצאות: האצרות באנגלית שבורה, מאוד לא ברור מה הוא רוצה והרבה בלגן. הכי מעצבן בעולם זה החיוך הקטן שהוא דופק בוידאו כאילו הוא יודע שהוא שורט אותנו בכוונה. אה ואין הרצאות רק וידאו מלפני המון שנים.\n\nשם המתרגל/ת: נתנאל\nחוות דעת - תרגולים: החליטו הסמסטר לא לעשות תירגולים לא ברור למה.\n\nשעורי הבית: אפשר לרפרנס אפשר לעשות, בכל מקרה הם לא כאלה נוראיים\n\nהמבחן: ללמוד ממאגר שאין תשובות רשמיות זה זוועה\n\nהשורה התחתונה: קורס זבל, תקשיבו באמת זבל !!!\nאל תתפתו לקחת אותו למרות הממוצע - קורס זבל", "timestamp": 1664346911309}, {"author": "צצ", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: שנה שעברה ציינתי שזה זבל של קורס ולא הקשבתם לי. \nחוזר שוב השנה להזכיר\n\nזבל של קורס", "timestamp": 1665780802257}, {"author": "רסק בקציצות", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "זבל של קורס...\n\n\n\nבאמת.", "timestamp": 1672240868156}, {"author": "אחד הסתם", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "דווקא קורס נחמד.\n\n\n\n\n\n.", "timestamp": 1676652071996}]}