{"posts": [{"author": "בועז", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות: פרדי מאוד נחמד ומאוד רוצה שנבין את החומר וגם נחשוב על דברים \"מעבר\". לצערי, אני חושב שהקורס מתמקד בעיקר במתמטיקה מייגעת ולא נכנס לשימושים פרקטיים, וזה פוגע בעניין של ההרצאות.\n\nשם המתרגל/ת: תום ויא-ווי (שני מתרגלים)\nחוות דעת - תרגולים: שני המתרגלים מתחלקים בהרצאות חצי-חצי. רוב התרגולים מדמים שאלות אפשריות בשיעורי הבית ובמבחנים ולכן מועילים. שניהם היו מתרגלים טובים, תום קצת פחות נחמד, אבל מתקדם מהר יותר.\n\nשעורי הבית: ארוכים. כוללים גם יבש וגם רטוב במטאלב. מכינים טוב למבחן.\n\nהמבחן: מבחן פתיר והוגן. מי שעושה שיעורי בית ומקשיב בתרגולים, מצליח.\n\nהשורה התחתונה: לא קורס מדהים, אבל נותן יסודות חשובים לתחום ופרדי מרצה שמאוד שמח לספר עוד ולהרחיב, אם שואלים את השאלות, שזה בונוס מאוד נחמד.", "timestamp": 1598025780625}, {"author": "כינוי", "difficultyRank": 5, "generalRank": 5, "semester": "201902", "text": "שם המרצה: פרדי (אלפרד ברוקשטיין)\nחוות דעת - הרצאות: בגלל הקורונה בהתחלה לא היו הרצאות אלא היינו צריכים לקרוא את הרשימות שלו ואחר כך היינו נפגשים דרך הזום לשאול שאלות. במהלך הסמסטר עברנו ללמידה סינכרונית שבה בכל מקרה היינו צריכים לקרוא רשימות ובמהלך ההרצאה פריידי לימד את עיקרי הדברים. לדעתי הוא מרצה מאוד מסודר וטוב, מדבר יחסית לאט (לדעתי זה יתרון). \n\nשם המתרגל/ת: טום דאגס ויא ויי לין\nחוות דעת - תרגולים: היו מועברים משקפים. יחסית מסודרים ורלוונטיים לשיעורי הבית ולמבחן. טום קצת סנוב אבל יותר ותיק ולכן יודע יותר. שניהם היו סבבה בסופו של יום, ענו על שאלות וכו.\n\nשעורי הבית:  בנויים על החומר בכיתה, בזוגות וארוכים. היו 4 גיליונות. הגיליון הרביעי מעט יותר קצר. כל גיליון היה בערך 2/3 יבש ו 1/3 רטוב. היו רלוונטיים למבחן.\n\nהמבחן: היה הוגן והממוצע מעל 80. היה אצלינו דרך הזום אבל עם הנחיות מקלות והם אמרו שהמבחן שלנו קל יותר (אבל האריכו אותו ובסוף נאלצו לתת עוד זמן אז מי יודע..)\n\nהשורה התחתונה: קורס בסיסי בעיבוד אותות, יחסית פנדמנטלי ומתמטי שלדעתי זה יתרון אבל גם מממשים. קורס חשוב ועמוס. הממוצע היה 80 ומשהו במועד א' והבדיקה הייתה סבבה. הסגל היה לפעמים קצת מתנסה (בעיקר תום) אבל זה היה לפעמים אפילו משעשע :-) . יש שמועה שהמבחנים של רון קימל יותר קשים אבל זה תלוי גם במתרגלים.", "timestamp": 1603126251883}, {"author": "מסנן Wiener", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רון קימל\nחוות דעת - הרצאות: רון ממש חמוד. היה נורא כיף להיות איתו בהרצאות למרות שהן קצת מייאשות והן 3 שעות. צריך לדעת מתי הוא מתחיל לבלשט על דברים לא רלוונטיים לקורס, לפעמים ההרצאות יותר מדי מעמיקות, אז תקשיבו רק אם אתם ממש עם תשוקה לקורס/תחום. בן אדם מקסים סה\"כ, גם עשה קטע שעל השתתפות בהרצאות מקבלים נקודות בונוס לציון ש\"ב\n\nשם המתרגל/ת: תום ויא-ויי\nחוות דעת - תרגולים: הם מחלקים בניהם את התרגולים, זה ממש כמו ביצת הפתעה, האם נקבל השבוע מתרגל ממורמר ומתנשא או גברת חיננית ומתוקה? סתם, גם תום סבבה.. הוא טיפה פוץ אבל זה במידה פשוט אל תעצבנו אותו ואם תהיו על הצד הטוב שלו הוא הופך לסביר\nבתרגולים לומדים יותר תכלס ומזקקים את העיקר ממה שלמדנו בהרצאות, לא משהו חדשני.\n\nשעורי הבית: 4 גליונות שצריך להשקיע בהם מאוד. בגיליון הראשון המגמה היא תמיד לתת שאלה אחת סופר תיאורטית שדורשת הרבה מחקר עצמי. חוץ מהשאלה הזאת, מבחינת קושי זה לא משהו מטורף ביבשים והם לא תלושים ממה שיש במבחנים, פשוט לוקח זמן לחתום אותם.\nהרטובים קצת מעצבנים לפעמים כי צריך לממש הכל בעצמך, אבל זה לא יוצא יותר מדי מטורף, יום יומיים עבודה. צריך להגיש אותם עם דו\"ח שמסביר מה עשיתם ומה קיבלתם והציון הוא דיי עליו לא נראה לי הם מריצים, תנסו להגיש סקריפט שמדפיס Hello world ותעדכנו אותי אם הסתכלו.\n\nהמבחן: מועד א' היה שואה. כאילו, ממש. נראה לי הם חשבו שאנחנו חכמים יותר מסמסטרים אחרים כי הממוצע ש.ב עלה קצת, אז אמרו טוב בוא נעשה שאלות בסגנון שונה לגמרי ממה שהיה עד עכשיו נראה איך יהיה. הלוואי הייתי יכול לראות את הפרצוף של רון כשהוא גילה שהממוצע היה איזה 50, ואת הפרצוף של תום כשרון החליט להביא איזה מיליון נקודות פקטור (לא רשמו כמה אבל זה חייב להיות איזה 25). עד המועד הזה המבחנים היו סבבה ותמיד היה סופי 85, מניח שעם הפקטור ואחרי שיפורים של מועד ב' גם לנו זה יגיע לזה בסוף. האינטרס שלהם זה שנצליח ושהממוצע יהיה סבבה.\n\nהשורה התחתונה: קחו אם אתם אוהבים מלא מתמטיקה, חייבים להיות חזקים גם על חדו\"א גם אלגברה וגם הסתברות, הקורס הכי מתמטי שתמצאו בפקולטה למדעי המחשב חותם לכם. אני אישית נהניתי, אולי קצת בכיתי אחרי מועד א' אבל פיצו לפחות.", "timestamp": 1613491665343}, {"author": "א", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "קורס נחמד, מאוד תיאורטי במהות אבל יש גם פרקטיקה מגניבה בשיעורי בית", "timestamp": 1614202813761}, {"author": "איתן ברון", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אלפרד ברוקשטיין\nחוות דעת - הרצאות: \nקראתי בעיקר את הnotes שלו, סה\"כ מסוכמים טוב. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nבעיניי  גרועים. אומנם עוברים על החומר ורוב מה שצריך לדעת למבחן זה אך ורק תרגולים, אבל בפועל לא הרגשתי המשכיות בין חומר לחומר והיה לי קשה להבין את תומאס וואי לין. \nשעורי הבית: \nלא קשים, עוזרים להתפקס על החומר.\nהמבחן: \nהזיה. תומאס מחליט כל מבחן שבא לו לבחון על משהו אחר שלא קשור לחומר הקורס. לפני 2 סמסטרים הם שמו 40 נקודות שאתה חייב בשבילן לדעת זהויות טריגונומטריות, מבחן לפני זה היה צריך להשתמש במשפט קושי שוורץ (אל תבהלו אם אתם לא יודעים, עברנו על זה בקטנה באינפי 2, לא נגענו בקורס והופס 10 נקודות על זה במבחן) ואצלנו היה 30 נקודות על מד\"ר ומד\"ח... בקיצור לקחתי את ה80+ שלי ולא אחזור על הקורס לעולם.\nהשורה התחתונה: \nבאתי לקורס בשביל ללמוד באמת בסיס לעיבוד אותות, לא מרגיש שיצאתי עם ידע נוסף כלשהו. הממוצע גבוהה.\nאגב, תתחדדו על מתמטיקה (אינטגרלים, הסתברות), זה הולך להופיע הרבה.", "timestamp": 1626839573237}, {"author": "Omer Gino", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: פרדי\nחוות דעת - הרצאות:  משעמם מאד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עמוסים\n\nהמבחן: קשה מאד\n\nהשורה התחתונה: קורס שיכל ליהיות מעניין בפועל משעמם מאד ומועבר באנגלית רעועה", "timestamp": 1627804241267}]}