{"posts": [{"author": "כינוי", "difficultyRank": 3, "generalRank": 1, "semester": "201901", "text": "תסתכלו על חוות הדעת שלי על פרויקט שנתי בהנדסת תוכנה שלב א'.\nזה תקף גם כאן.", "timestamp": 1598179024301}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר גלה ידגר\nחוות דעת - הרצאות: מצוינות, משתדל להעביר את החומר בצורה מובנת\n\nשם המתרגל/ת: עופר\nחוות דעת - תרגולים: לפעמים מתפספסים דברים אבל סה\"כ בסדר\n\nשעורי הבית: לא קלים אבל יש רפרנס לרוב\nהמבחן: ממש לא קל\n\nהשורה התחתונה: בסה\"כ קורס מעניין", "timestamp": 1612979804568}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: מרצה מצוינת, אין שום תלונות אליה. קצת קשוחה בדרישות לפעמים, אבל נחמדה, יודעת להסביר מצוין ובעלת ידע אדיר. לצערי חלק מהקורס מתמקד בדברים שלא צריכים להיות חלק ממנו, לדעתי-למשל הנושא של שאילתות.\n\nשם המתרגל/ת: עופר\nחוות דעת - תרגולים: עשה עבודה טובה , יודע טוב ועוזר. אין תלונות.\nיש לציין שמשום מה בהרבה תרגולים לא היו כמעט אנשים ולפעמים היה כמעט שיעור פרטי! \nויש לציין שהמתרגל של הסדנאות משתדל ואדם נחמד ביותר אבל לא מסביר מי יודע מה ויש לא אחת בעיות תיאום בינו לשאר הסגל.\n\nשעורי הבית: קשים מידי לדעתי-5 תרגילים יבשים בזוגות, מצריכים הרבה זמן להבין כמו שצריך ולענות כמו שצריך, וקל מאוד לאבד נקודות על אי דיוקים קטנים.\nעושים ראיונות על תרגילי הבית באופן מדגמי שיכולים להיות מלחיצים ולרסק את הציון אם כי לא להעלות אותו(ממה שאני יודע שהיה). 40% מהציון אני חושב! \n\nהמבחן:  קשה מידי, לא מתאים לזמן הקצוב עבורו. יש חומר פתוח אבל להיעזר בו בהתחשב באורך המבחן זה לא סביר. ממוצע הרבה יותר מידי נמוך לקורס בחירה/מתקדם עם אחוז תרגילי בית \n\nהשורה התחתונה: אני אישית אהבתי את הנושאים של הקורס ברובם אבל אני לא חושב שזה קורס מומלץ למי שזה לא חובה עבורו. אולי כשומע חופשי... פשוט השילוב של עומס לא מבוטל עם ממוצעים נמוכים הופך את הקורס שיכול להיות מעולה להיות לא כל כך מומלץ.", "timestamp": 1615380416218}, {"author": "קורונה21", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: קומסי קומסה. גלה מרצה די טובה ורואים שאכפת לה והיא מנסה אבל החומר משעמם\n\nשם המתרגל/ת: עופר גונטר\nחוות דעת - תרגולים: עופר מאוד נחמד, אבל התרגולים לא היו טובים. הסדנאות של נדב היו מעולות\n\nשעורי הבית: מסתבר שהיה אפשר לרפרנס אותם. תסתכלו בצ'יזפורק על מבחנים משנים קודמות\n\nהמבחן: רעיונות דומים שחוזרים כל שנה. הממוצע של המבחן לא מאוד גבוה אבל לדעתי החומר לא קשה בכלל והרעיונות חוזרים. לרוב אין איזה סגנון שאלות חדש.\n\nהשורה התחתונה: לא עפתי על הקורס, החומר די משעמם, אבל הסגל נחמד והממוצע סביר.", "timestamp": 1615823097724}, {"author": "B+ Tree", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: גלה\nחוות דעת - הרצאות: גלה מרצה מעולה ומעבירה את החומר בצורה מאוד כיפית וחברתית. ממליץ ללכת אליה כי למרות שהחומר מרדים היא עדיין מצליחה להעביר בצורה יחסית טובה ומעניינת.\n\nשם המתרגל/ת: אולג\nחוות דעת - תרגולים: מזעזע, מחריד ולא טוב. לא נותן לשאול שאלות בתרגול יותר מדי כי הוא רוצה להספיק בזמן ולרוץ על החומר. מכיוון שהחומר קשה שואלים אותו לא מעט שאלות שהוא לא מצליח לענות עליהם טוב ואז פשוט רוצה לרוץ על התרגול כדי להספיק, לא אכפת ממענה לסטודנטים - לא ממליץ ללכת אליו.\n\nשעורי הבית: שאלות ממבחנים. לרפרנס.\n\nהמבחן: עם חומר פתוח ואחרי כמה מבחנים טובים הקונספט חוזר על עצמו.\n\nהשורה התחתונה: משעמם תחת ולא לקחת. אם בכל זאת לקחתם אז תשתדלו להיות על החומר.", "timestamp": 1643730396205}, {"author": "YP10", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גלה\nחוות דעת - הרצאות: מרצה נהדרת. \nמדברת בהתלהבות על החומר, למרות שלאנשי תוכנה הוא לא תמיד הכי מרתק. \nעם זאת, אופן ההעברה של החומר של גלה מוסיפה עניין.\n\nשם המתרגל/ת: דניאל מינץ\nחוות דעת - תרגולים: מתרגל תותח, נותן מעצמו והסתדר עם תקלות שהיו בגלל שכל השקפים של התרגולים חדשים.\nתמיד זמין במייל לשאלות וגם לקראת המבחן עשה שעות קבלה מושקעות מאוד.\n\nשעורי הבית: לרוב ממבחני עבר ונותנים מושג לגבי המבחן. הבדיקה של הש.ב היא נוקשה.\n\nהמבחן: לא קל אבל ישנם אלמנטים שחוזרים על עצמם, ממליץ לפתור היטב את הש.ב, לדעת טוב את התרגולים, ולפתור כמות יפה של מבחני עבר ולהבין אותם ואת הניואנסים הקטנים. בהצלחה!\n\nהשורה התחתונה: אם דניאל מתרגל אז אין שאלה בכלל ומומלץ לקחת, אחרת כדאי לעבור על הסילבוס ולראות אם מתחברים לחומר.", "timestamp": 1646071089891}, {"author": "גרורה", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "לא, לא, ועוד פעם לא.", "timestamp": 1646768464939}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה:  גלה\nחוות דעת - הרצאות: \nדיי משעממות לדעתי. החומר בהרצאות האחרונות יחסית מעניין אבל זה ברובו מכוסה גם ככה בקורסים אחרים (שעדיפים בהרבה) כמו מערכות מבוזרות. ושאר החומר לא מעניין, לא מדוייק ולא שימושי בכלל.\n\nשעורי הבית: \n5 תרגילי בית יבשים, מגן. כל אחד בין 3 ל-4 אחוז.\nלא עמוסים מדיי.\nהמבחן: \nמנוסח בצורה מזעזת.\nהשורה התחתונה: \nאולי הקורס השנוא עלי בתואר.\n הממוצע יחסית לקורס \"בחירה\" ממש נמוך ולא מפקטרים בקורס הזה. חומר לא מעניין בכלל ולא שימושי בכלל. מקווה שיעיפו את הקורס המזוויע הזה מהקורסי חובה של הנדסת תוכנה.", "timestamp": 1647430286287}, {"author": "Yosef Br", "difficultyRank": 3, "generalRank": 2, "semester": "202101", "text": "לא לקחת. אין פקטור ובדיקת שעורי הבית דיי נוקשה שמהווים 20% מגן שממש קשה להשיג אותם.", "timestamp": 1648727605186}, {"author": "JD", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "kinda fun, exam is a bit hard", "timestamp": 1679394692364}, {"author": "nobody", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: גלה\nחוות דעת - הרצאות: \nגלה מרצה טובה - יודעת לתת דוגמאות שרלוונטיות, מנסה להעביר את החומר בצורה מעניינת וסה\"כ היה נחמד איתה בהרצאות. לעומת זאת, החומר של ההרצאות היה משעמם בצורה לא נורמלית, והיה ממש קשה להתרכז כשמדברים על חישוב זמן סיבוב של זרוע בדיסק או שילוב של ממן בחישוב כמות גישות לדיסק בקריאות של דאטאבייסים. תביאו כרית למקרה שתהיה לכם התקפת עייפות מהשעמום ולא תרצו להכות את השולחן עם הראש.\n\nשם המתרגל/ת:  אולג\nחוות דעת - תרגולים: \nניסיתי את שניהם, את אולג ראיתי במוקלט מידי פעם ואת השני ניסיתי בלייב. שניהם לא משהו, אבל ההקלטות ממש גרועות. הייתי מעדיף לקרוא מהמצגות אבל חסרים הסברים שבתרגול אמורים להעביר, אבל לצערי לא הרגשתי שהעבירו בצורה כזו טובה.\n\nשעורי הבית: \nהתרגילים הכי לא מוגדרים היטב שעשיתי כל התואר. התרגילים ממבחני עבר, וכתוצאה מכך הם גם קשים. בנוסף, אתה לא בטוח איזה הנחות מותר לעשות ואיזה לא, ובכל שאלה יש כמה סעיפים שצריך לדעת לחרטט בבטחון. הדבר היחיד שטוב בתרגילי הבית הוא שזה מגן אז לא חובה להתעסק בהם, ממליץ לחפש סריקות עם התרגילים (גם אפשר לומר שהייתה בדיקה מקלה אבל אני לא יכול להבטיח את זה בסמסטרים אחרים)\n\nהמבחן: \nהמבחן הכי לא מוגדר היטב שעשיתי כל התואר. אתחיל בחיובי - יש חומר פתוח, אז לא צריך לזכור 1000 נוסחאות לחישובים, ובנוסף הבדיקה לרוב יחסית מקלה, אם היה לך כיוון נכון אבל לא כתבת בצורה הכי טובה הם נותנים נקודות (לפחות אצלי). מצד שני, הרגשתי שכל המבחן אני מנחש את הכיוון לפתרון אליו התכוונו. אל תשכחו שהתרגילים קשים יחסית ואין מספיק זמן להתלבט מה לעזאזל רוצים ממך, אז צריך גם כאן לחרטט בבטחון לכמעט כל אורך המבחן.\nושכחתי לומר שלא נותנים פקטור?\n\nהשורה התחתונה: \nהייתה פה תגובה בעבר של \"לא, לא ועוד פעם לא\". מסכם די טוב את הרגשות שלי עם הקורס", "timestamp": 1681461528388}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: גלה\nחוות דעת - הרצאות: צפיתי במוקלט והוא היה בסדר , לדעתי החומר מעניין ומלמד .\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קשים \n\nהמבחן: ממש קשה , אני רק עשיתי מועד ב ולדעתי היה ממש ממש קשה , וממש מבלבל , היו שם נתונים שכתובים בצורה שמטרתה רק להכשיל סטודנטים, אני במסלול הנדסת תוכנה אז זה חובה :( אבל למי שזה לא חובה והחומר לא מעניין ,לא לקחת , אם החומר כן מעניין אז כן לקחת ... . \n\nהשורה התחתונה: קשה אבל החומר עניין אותי", "timestamp": 1690444051848}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: גלה מרצה מצוינת. צפיתי בעיקר בהקלטות אבל ניכר משם שחשוב לה שהסטודנטים יבינו את החומר היטב. היא חוזרת על נקודות חשובות ומסבירה לעומק, ניכר שהיא מכירה ויודעת את הקורס היטב ושהיא מלמדת אותו היטב.\nהתוכן של ההרצאות בעיני היה מעניין. יש כאלה שפחות מתחברים לחישוב מספר הגישות לדיסק או מהירות הסיבוב ודברים מהסוג הזה אבל בעיני יש משהו חשוב בלהכיר עבודה יעילה מול הדיסק ויצירת מערכת אחסון יעילה.\n\nשם המתרגל/ת: אולג\nחוות דעת - תרגולים: אולג סביר.\nלא יודע אם זה המצגות של התרגולים שלא מעמיקות מספיק או שאולג קצת רחוק מהסטודנטים אבל יש קצת קצר בתקשורת בתרגול. אפשר להתעכב כי לא הבנת שורה אחת ובזמן שחשבת על זה, אולג כבר עבר שני סעיפים קדימה ושכחת על מה הייתה השאלה. ניכר שהוא רוצה להסביר ושהסטודנטים יבינו אבל מסגרת התרגול תובענית ואין הרבה זמן לשאלות.\n\nשעורי הבית: אצלנו היו 4 תרגילי בית. כולם מרופרנסים מבחינות עבר - אבל לא לכולם יש פתרון הולם בסריקות ולכן הם כן דורשים מידה מסוימת של הבנת החומר.\n\nהמבחן: לראשונה מזה שנים עשו מבחן עם חומר סגור ובעיני זו הייתה הברכה הכי גדולה של הקורס. כשמתרגלים בחינות עבר רואים שהבחינות מאוד יצירתיות ומוזרות. היו שם הרבה טריקים הזויים שמתבססים על הבנת הנקרא וקריאת המחשבות של הבודק אבל הפעם - היה סבבה לגמרי. השאלות היו פחות יצירתיות ויותר בדקו הבנה של נושאים בסיסים. חלקן אפילו היו דומים מאוד לסעיפים מהתרגולים.\n\nהשורה התחתונה: אחלה קורס, בעיני מעניין ונחמד. כנראה מאוד אינדיבידואלי לפי הביקורות הקודמות שקראתי.", "timestamp": 1716144336110}, {"author": "ferberonix", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: גלה ידגר\nחוות דעת - הרצאות: אחלה מרצה, חשוב לבוא להרצאות ואין לי עוד מה לומר.\n\nשם המתרגל/ת: הראל+אולג\nחוות דעת - תרגולים: שניהם סבירים. חשוב מאוד לבוא לתרגולים ולשאול שאלות.\n\nשעורי הבית: מלמדים, תעשו אותם !\n\nהמבחן: מועד א' היה הוגן ומועד ב' פחות. צריך 4 ימי למידה כדי להצליח במבחן.\n\nהשורה התחתונה: לא מומלץ. לא אהבתי שום דבר בקורס המשעמם הזה ולא ברור לי מה הוא נותן לנו הסטודנטים. לא אקח ממנו שום דבר לעתיד ואקווה לשכוח הכל במהרה.", "timestamp": 1718199029820}]}