{"posts": [{"author": ":)", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: שרה\nחוות דעת - הרצאות: שרה ממש נחמדה, הרצאות בסדר אבל מלאות בחומר וצריך לחזור עליו הרבה.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: המתרגל הכי גרוע שהיה לי אי פעם, זה היה בסמסטר זום ואפילו לא פתח מצלמה, עם גישה נוראית ולא נחמד בכלל, לא ניסה לבוא לקראתנו בשום דבר ואפילו ביטל את התרגול האחרון ולא השלים.\n\nשעורי הבית: 5 תרגילים, 3 יבשים אבל רובם ארוכים, 2 רטובים קשים מאוד וארוכים. הרטוב האחרון בשבוע האחרון של הסמסטר וזה היה קשה אבל בסוף קיבלנו הארכה עד סוף מועדי א.\n\nהמבחן: \nלא קשה מאוד אבל לדעתי לפעמים השאלות לא הכי ברורות.\nהשורה התחתונה: החומר מאוד עניין אותי אבל הסגל התיש לגמרי והמבחן גם ביאס. אז אם אתם בקטע של סגל מעייף לכו על זה", "timestamp": 1615980767267}, {"author": "פלוני", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרה ביטן\nחוות דעת - הרצאות: שרה נחמדה, אבל לדעתי ההרצאות לא הכי ברורות וזה נובע בעיקר מכמות החומר שדוחסים בקורס הזה ולכן קשה לעקוב. למרות הכל החומר מעניין, אבל שוב הקצב לא מאפשר לעכל אותו באמת ולהנות ממנו.\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: עידן נחמד אבל לדעתי התרגולים קצרים מדיי. בתכלס רובם הם בעצם סדנה לתרגילי בית, אבל לדעתי הם לא מספיק מכינים. יתרה מכך, שוברים את הראש שעות וימים בגלל בעיות טפשיות שמשפט אחד מהמתרגל היה יכול לחסוך.\n\nשעורי הבית: פה כל הבעיה. התרגילי בית עמוסים בטירוף, הם מסתמכים על שעות של חיפושים בגוגל, ושבירת ראש על דברים מטומטמים, וזה מעצבן, כי בשלב הזה של התואר אתה לא רוצה לבזבז שעות בגלל שלא חשבו להגיד לך דברים בסיסיים ולא מתוחכמים במיוחד אבל שפשוט יכלו לחסוך זמן. \n\nהמבחן: קשה. הקושי ממבחנים אחרים בתואר כי פה המבחן מתבסס על 85 אחוז של שינון החומר, וכאמור יש כמות אדירה של חומר.\n\nהשורה התחתונה: קורס מאוד מעניין ומלמד הרבה מושגים באבטחה, אבל צריך להתכונן לסמסטר מתיש במיוחד התרגילי בית (מי שיכול להשיג רפרנס, זה בטח יעזור לו כי התרגילים לא כל כך משתנים מסמסטר לסמסטר), ולהתכונן לשנן הרבה חומר בע\"פ.", "timestamp": 1644779974012}, {"author": "ע", "difficultyRank": 5, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שרה ביתן\nחוות דעת - הרצאות: שרה ממש אחלה, אבל היא זורקת מלא חומר בהרצאות שתכלס לא הבנתי אותו לגמרי עד שהתחלתי ללמוד למבחן כי ממש קשה לעקוב אחריה.\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: עידן גם אחלה מתרגל, התרגולים שלו היו אחלה\n\nשעורי הבית: מהיותר קשים שהיו לי בתואר, שני רטובים, כל אחד מהם נוראי ממש, לוקחים מינימום שבוע עבודה כל אחד ואין ממש רפרנסים לאף אחד מהתרגילי בית.\n\nהמבחן: בעיקר בוחן כמה זוכרים את החומר, השאלות בו לרוב מאוד מבלבלות כי שרה לפעמים מנסחת אותן לא הכי ברור. בסוף רוב המבחן שאלות ידע ושאלה אחת שהיא יותר מאתגרת כזו.\n\nהשורה התחתונה: \nקורס עמוס ולא פשוט, מבחן לא קל, אבל החומר כן מעניין בסופו של דבר, תכלס לומדים בעיקר מנגנוני אבטחה שכבר לא בשימוש, אבל הגישה לאבטחה של מערכות כן ממש נחמדה.\n אם אתם בעניין של אבטחה הייתי לוקח אחרת לא מומלץ.\nאה וכדאי לקחת אחרי הגנה ברשתות והנדסה לאחור.", "timestamp": 1645201629370}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: שרה ביתן\nחוות דעת - הרצאות: שרה מרצה מאוד נחמדה וברורה, אבל בודקת שאלות מרושעת\n\nשם המתרגל/ת: עידן רז\nחוות דעת - תרגולים: מתרגל טוב וברור\n\nשעורי הבית: ארוכים יחסית. היבשים בעיקר מתישים לפעמים\n\nהמבחן: מבחן די מוזר ולא מה שמצפים מקורס כזה. זה ממש לא כמו בהגנה שצריך לחשוב, פה צריך רק לזכור חומר (אבל ממש את כל החומר כי יכולים לשאול על פרטים קטנים). הבדיקה הכי נוראית ושמנסה להוריד נקודות שראיתי בכל שנותיי בטכניון\n\nהשורה התחתונה: הקורס כיפי ומעניין מאוד, מומלץ אם מתעניינים בנושא, ממש לא מומלץ אם מחפשים סתם קורס בשביל הנקודות", "timestamp": 1646233320240}, {"author": "מ", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שרה\nחוות דעת - הרצאות: שרה רעה, מלא חומר בכל הרצאה בלי הפסקה, שצריך הכל למבחן אז חשוב להקשיב ולהבין הכל\n\nשם המתרגל/ת: עידן\nחוות דעת - תרגולים: עוזרים בעיקר לתרגילי בית וקצת למבחן, עידן אחלה מתרגל.\n\nשעורי הבית: נוראי,שתי הרטובים הכי קשים בתואר, להתרחק\n\nהמבחן: עוד יותר נוראי, שרה אוהבת לכתוב שאלות בניסוח לא ברור בשום צורה שאף אחד לא מסוגל להביו בטח לא באמצע המבחן\n\nהשורה התחתונה: להתרחק מהקורס, אלא אם ממש בא לכם ללמוד את הנושא ולא אכפת לכם מהעומס והציון", "timestamp": 1646596558002}, {"author": "SGX", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרה ביתן\nחוות דעת - הרצאות: לא פשוטות, מלא חומר, הרבה דברים טכניים, חלק גדול מהם צריך לדעת למבחן ובכלל, החומר לא כל כך ברור.\nשרה די רצה על החומר אז קשה באמת להבין בזמן ההרצאה. אם אתם לוקחים את הקורס, הייתי רואה את ההרצאות פעמיים.\n\nשם המתרגל/ת: עידן רז\nחוות דעת - תרגולים: תרגולים סבירים סך הכל, הם היו מיד אחרי ההרצאות אז הם לא באמת עזרו לחומר לשקוע, והרבה פעמים ההרצאה הייתה לא מובנת והתרגול לא כל כך עזר.\n\nשעורי הבית: יש שני רטובים שאיתם מגישים דו\"ח ועוד שלושה יבשים. היבשים בסדר, אישית לא קיבלתי בהם ציונים כל כך טובים, אבל הממוצעים הם סביב ה-93.\nהרטובים קשים ממש. באחד צריך לבנות איזה משהו בקרנל שזה מלא התעסקות\nהרטוב השני פשוט זוועה. בלי להיכנס יותר מידי לפרטים: צריך לכתוב תוכנה שנשענת על איזשהו API שמאבטח את הריצה. הבעיה היא שה-API הזה דורש הרצה בשרת מיוחד או ב-VM. ה-VM שקיבלנו היה ממש איטי, אף פעם לא ראיתי משהו רץ כל כך לאט על המחשב שלי (ויש לי מחשב חזק) והשרת בכלל לא עבד כמו שצריך.\nגם אם הכל עובד, התרגיל הזה דורש הרבה זמן.\n\nהמבחן: קשה ולא ברור. הניסוחים של שרה בעייתיים והיא יכולה לשאול *על כל דבר*. צריך שבוע רצוף לפני הבחינה בשביל שיהיה סיכוי טוב להצליח.\nבמבחן אצלנו היו שתי סעיפים שכל אחד מהם שאל על איזה משהו שהופיע בשקופית אחת במצגת של ההרצאה.\nממליץ לסכם את הקורס כי חסר הרבה מידע במצגת. כדאי אפילו לחזור קצת על ההקלטות כשיש נקודות לא מובנות כי באמת אין דרך אחרת.\n\nהשורה התחתונה: אלא אם אתם ממש ממש אוהבים את התחום של סייבר ואבטחה, אל תקחו את הקורס. הוא עמוס ולא ברור. החומר מעניין, שלא תבינו אותי לא נכון, אבל הקורס הוא קצת סבל במהלך הסמסטר והרבה סבל לקראת המבחן.\nאם אתם ממש ממש אוהבים סייבר, זה הקורס בשבילכם, אבל הוא אתגר.", "timestamp": 1647207348482}, {"author": "Rotem Ben Shlush", "difficultyRank": 5, "generalRank": 3, "semester": "202101", "text": "שם המרצה: שרה\nחוות דעת - הרצאות: \nאני ראיתי בוידאו והיה לי קצת קשה להקשיב תוך כדי כי זה מלא חומר ומלא מושגים ובאמת קשה לספוג הכל. בדיעבד אחרי שלמדתי למבחן, החומר מעניין מאוד\n\nשם המתרגל/ת:  עידן\nחוות דעת - תרגולים: התרגולים די קצרים, לפעמים מסתיימים לפני הזמן. עידן אחלה מתרגל, פשוט באמת מדובר בהרבה חומר ולכן קשה לעקוב.\n\nשעורי הבית:  מזעזעים\nהיבשים עוד היו יחסית בסדר, אבל הרטובים דורשים מלא מלא השקעה. \nבתרגיל של ה-LSM הם לא מסבירים יותר מדי מה לעשות.  הם נותנים LSM אחרים שלפיהם צריך להבין מה לעשות. העניין הוא שיש שם מלא דברים שאתם לא תצטרכו לעשות בתרגיל שלכם ואתם צריכים להבין מה רלוונטי אליכם. \nהמלצה אם תעשו את הקורס - תתחילו ממצב שאתם לא טוענים אף הוק ולאט לאט תוסיפו הוקים שרלוונטים אליכם (כי גם הוקים ריקים שלא קשורים יכולים לדפוק דברים)\n\nהמבחן: \nהוא דורש למידה טובה מאוד של החומר.\nאני לא חושבת שהוא מתקיל או מכשיל, אבל הוא דורש לדעת את החומר בצורה מאוד טובה כי הם יכולים לשאול על כל פיפס קטן. \nגם הניסוחים לא תמיד ברורים, יכולה להגיד שאני באופן אישי ביקשתי תוך כדי המבחן מהסגל שיסביר לי שאלה יותר טוב כי לא ידעתי איך לגשת אליה בהתחלה.\n\nהשורה התחתונה: \nמעניין מאוד, עמוס מאוד ודורש לדעת את החומר בצורה מאוד טובה. במהלך הסמסטר לא פעם הצטערתי שלקחתי את הקורס, אבל בסופו של דבר הוצאתי ציון יפה וכן הקורס מעניין", "timestamp": 1647614066914}, {"author": "מובלעת", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: שרה ביטן\nחוות דעת - הרצאות: לא וואו, ההרצאות די מבולגנות וקופצות בין נושאים. יש שקפים שרק בחזרה למבחן הבנתי על מה מדובר כי הם קפצו כמה נושאים קדימה. בהרצאה עצמה שרה מרחיבה הרבה יותר על כל שקף ככה שאי אפשר באמת ללמוד מהמצגת בלבד. רוב ההרצאות היו מעניינות ודיברו על נושאי אבטחה עכשויים והרגיש שהקורס באמת נותן ידע רלוונטי לשם שינוי.\n\nשם המתרגל/ת: אסף\nחוות דעת - תרגולים: ניכר שלאסף לא היה יותר מדי כוח להעביר את השיעורים, הרבה מהם הסתיימו לפני הזמן. אבל הוא כן דאג להעביר את כל החומר ולענות בפירוט על כל שאלה. חוץ מהתרגול של סדנת ה-LSM, התרגולים די מיותרים ולא מביאים ערך נוסף מלבד חזרה שטחית על החומר מההרצאה.\n\nשעורי הבית: לא פשוטים, מנוסחים לא ברור ודורשים השקעה. לנו היה רטוב אחד (בד\"כ יש 2) והוא היה עמוס ולקח הרבה זמן. לא יודע לגבי הבדיקה כי כרגע (שבועיים אחרי מועד א) עדיין לא קיבלנו ציון על אף תרגיל בית.\n\nהמבחן: השאלות די מבולגנות ומנוסחות גרוע, צריך לפתור מספיק מבחנים כדי להבין למה בדיוק מתכוונים ומה רוצים שתכתוב בתשובה. אבל סה\"כ הוגן ואפשר להשיג ציון טוב אם מגיעים להרצאות.\n\nהשורה התחתונה: אחלה קורס, למדתי דברים מעניינים ורלוונטיים, סגל קצת מוזר אבל בכל זאת ממליץ.", "timestamp": 1692351287356}]}