{"posts": [{"author": "%d", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: מרצה טוב.\n\nשם המתרגל/ת: טל נהורן\nחוות דעת - תרגולים: מתרגל מאוד טוב, נחמד ומסביר מציין.\n\nשעורי הבית: \nשיעורי בית קלילים, מבוססים בעיקר על מה שהיה בכיתה או חיפוש בסיסי באינטרנט. יחד עם זאת, בבדיקה חיפשו איפה להוריד על הקטנות וזה פגע בממוצע שיעורי בית.\n\nהמבחן: \nהמבחן עצמו הוגן, אבל כמו בשיעורי בית, בחלק מהשאלות מורידים על דברים מאוד מינוריים באופן לא סביר.\n\nהשורה התחתונה: מומלץ. לא כל החומר שעובר מעניין, אבל רוב החומר שמועבר הוא מעניין. אם אין ידע קודם לדעתי עדיף לעשות את הקורס הזה אחרי שעושים את\"מ או בצמוד לאת\"מ.\nמבני וספרתיות הם לא קדמים רלוונטיים ואני לא מבין למה זה בכלל דרישה פה.", "timestamp": 1646759640065}, {"author": "Ben Gamliel", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: מאוד מלמד, יסודי וריגורוזי \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סה\"כ מועילים להבנת החומר\n\nהמבחן: תואם להרצאות ותרגולים, חשוב לעקוב אחרי הניסוחים של אלי, זה מה שהוא מצפה לראות בתור תשובות במבחן \n\nהשורה התחתונה: אחלה קורס", "timestamp": 1647789022701}, {"author": "Nir", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  אלי ביהם\nחוות דעת - הרצאות: אלי זה אלי, מאוד מקצועי ונחמד.\n\nשם המתרגל/ת: 2 מתרגלים שברחו וטל נהורן\nחוות דעת - תרגולים: 2 המתרגלים בהתחלה ברחו באמצע, טל נהורן בא להחליף אותם בשלב מסויים, אלי החליף גם איזה פעמיים. טל תותח ומסביר בצורה ברורה, בלייב ובהקלטות.\n\nשעורי הבית: 5-6 גיליונות, כל שבועיים בערך והם לוקחים זמן, אבל עוזרים להבין את החומר טוב וקשורים למבחן, להרצאות ולתרגולים.\n\nהמבחן: כרגע הטכניון תחת מתקפת סייבר (אירוני), אז לא רואה את הסריקה, היה מבחן לא פשוט וארןך אבל אפשר לראות לפי הממוצע, כשיתפרסם, האם אלי פקטר בהתאם.\n\nהשורה התחתונה: מה שאהבתי בקורס שהוא פרקטי ומאפשר גם להבין קונספטים בתחום וגם להתנסות בהתקפות. דורש חשיבה ולמידה אבל לא מוגזם.\nמי ששונא low level שישקול אם כדאי לו לקחת את הקורס כי חלק ניכר ממנו הוא כזה.\nחשוב - את\"מ לא קדם אבל אני יודע שאישית אם לא הייתי עושה את\"מ לפני לא הייתי מבין מה הולך שם. אז מי שלא עשה את\"מ גם כדאי לשקול אם לקחת. גם הפעלה רצוי.", "timestamp": 1676588220999}, {"author": "~~~~", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אלי\nחוות דעת - הרצאות: נחמד.\n\nשם המתרגל/ת: היו שני מתרגלים שברחו באמצע הסמסטר\nחוות דעת - תרגולים: \n\nשעורי הבית: 5-6 גליונות ארוכים דורשים זמן.\n\nהמבחן: זוועה זוועה זוועה זוועהה איכס מגעיל. היה לנו מבחן זוועה מועד ב. כ 30 סעיפים שבכולם צריך להציע אלגוריתם או לכתוב פסודו-קוד למרות שאף פעם לא התעסקנו בזה בקורס. ממש מגעיל ממש מגעיל לא לקחת לא לקחת לא לקחת זוועה. בתור אחד שעשה תרגולי הבית ולמד היטב בספק אם עברתי מועד ב. \n\nתעשו טובה לעצמכם אל תקחו ובמקרה ועשיתם תגשו רק ל א.  מגעיל רצחח מגעיל. יעק יעק יעק יעק יעק יעק יעק יעק \n\nחשוב לציין שעבר 15 יום ועדין אין ציונים והמרצה מסנן את הכל\n\nהשורה התחתונה: לא לקחת. תקחו מקבוזר תקחו אימות תוכנה ממס ממן תעשו לעצמכם טובה אל תקחו. המבחן ברמת קושי לא סבירה.  ( בתור מתרגל בפקוןלטה ) אל תקחוווו", "timestamp": 1680188499940}, {"author": "ניק", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות:  חשובות ומלמדות המון\n\nשם המתרגל/ת:  2 שברחו\nחוות דעת - תרגולים: חשובות - יש מוקלט\n\nשעורי הבית: אפשר לסיים ביום-יומיים של עבודה, הרוב זה לעשות חיפוש בהרצאות ובתרגולים- \n\nהמבחן: שתיהם היו זוועה, אבל בעוד שממוצע של בערך 60 במועד א' הפך לציון של 82 וחציון 84, של מועד ב' שהיה בערך אותו ממוצע קיבל פקטור של 0 נקודות\n\nהשורה התחתונה:  או שלנסות לעשות מועד א' או לברוח", "timestamp": 1680417064808}]}