{"posts": [{"author": "ארתור-מרלין", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אייל קושילביץ'\nחוות דעת - הרצאות: מעניינות ונינוחות. כיתה קטנה יחסית בה המרצה כבר מכיר כל אחד. אדיב ועונה לשאלות.\nהיה חסר לי - חוברת הרצאות מפורטת כמו חוברת התרגולים.\n\nשם המתרגל/ת: איתי חזן\nחוות דעת - תרגולים: מתרגל תותח על. הסביר את החומר בצורה מפורטת מאוד, עם תרשימים, צבעים, מסגרות לתזכורות, חלוקה אופטימלית של הלוח והזמן.\nהתרגולים עצמם היו לי בעייתיים רק בגלל שהיו דחוסים מדי ושעה אחת כמעט אף פעם לא מספיקה. זה אומר שקצב ההתרחשויות מהיר מדי בשביל להפנים את החומר אז פשוט צריך להאמין למה שקוראים ולומדים ואחר כך לחזור על זה. יש חוברת תרגולים מפורטת ומושקעת מאוד, פרי יצירתם של אייל וגדי אלכסנדרוביץ'.\n\nשעורי הבית: קשים מאוד מאוד. כנראה שברוב השאלות חייבים רפרנס כגון תרגיל פתור מאיזה ספר או מאמר בשביל פתרון.\nהם גם מהווים את רוב הציון והמשקל של הלמידה הוא בפתרון שיעורי הבית.\nהמבחן: היה קשה לי מדי. בקושי הצלחתי.\n\nהשורה התחתונה: החומר מעניין והקורס לא קל. הוא באמת המשך ישיר לחישוביות - עוד מחלקות שפות, עוד בעיות פתוחות. אני מבחינתי חושב שזו העשרה יפה, לא יצאתי עם ציון גבוה אבל meh, אני שייך לקבוצה של כמה עשרות בודדות של סטודנטים שיודעים חישוביות וסיבוכיות ברמה מתקדמת בשביל לקרוא מאמרים בתחום. מומלץ רק למי ששרוף על טיורינג ופרוטוקולי תקשורת ותיאוריית החישוביות.\nהיה חסר מאוד מאוווד - פתרונות רשמיים לשאלות ממבחנים משנים קודמות. זה מאוד קשה ללמוד למבחן בלי לדעת אם אתה בכלל בכיוון, ולא סביר ללכת לשעת קבלה עם המרצה ולהתחיל לעבור איתו על מה שניסית לעשות במבחנים בשנים קודמות.", "timestamp": 1678620855079}, {"author": "P=NP", "difficultyRank": 5, "generalRank": 5, "semester": "202201", "text": "שם המרצה: איל קושלביץ\nחוות דעת - הרצאות: מעולות, איל מרצה מסודר וברור, והחומר סופר מעניין\n\nשם המתרגל/ת: איתי חזן\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי בטכניון. מסודר, ברור, מעביר את התרגולים בכיף, מרגישים שאוהב ללמד, אוהב את המקצוע, ורוצה להעביר את הידע לסטודנטים בצורה הטובה ביותר\n\nשעורי הבית: קשים משהו מפחיד. המון שיעורים, לוקח המון זמן.\n\nהמבחן: לא הייתי אומר קל, אבל בהחלט פיירי. רוב הדגש הוא על שיעורי הבית, המשקל של המבחן גם רק 40% מהציון.\n\nהשורה התחתונה: הקורס הכי מדהים שלקחתי בחיים שלי", "timestamp": 1679976009071}]}