{"posts": [{"author": "דגו", "difficultyRank": 5, "generalRank": 3, "semester": "202001", "text": "שם המרצה: אלדד\nחוות דעת - הרצאות: לא הייתי \n\nשם המתרגל/ת:  קוסטיה\nחוות דעת - תרגולים:  מתרגל ממש טוב, מעביר את החומר בצורה (עד כמה שאפשר....) ברור.\nזמין מאוד במיילים להודעות.\n\nשעורי הבית: הציון על הקורס בנוי מ-4 תרגילי בית קשים מאוד !\nמאוד מתמטיים, וכוללים הסתברות ברמה מאוד גבוהה.\nקחו בחשבון.\nכמו כן, כל תרגיל בית לוקח כמספר שבועות.\n\nהמבחן: ראו למעלה\n\nהשורה התחתונה: קשה מאוד, אבל אחלה ציון !", "timestamp": 1616454459368}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלדר פישר\nחוות דעת - הרצאות: ההרצאות ממש מעניינות. אלדר נחמד אבל לפעמים קצת רץ, שזה הגיוני כי הוא גאון על חלל\n\nשם המתרגל/ת: קונסטנטין זברני\nחוות דעת - תרגולים: הייתי במעט תרגולים, אבל מתרגל טוב\n\nשעורי הבית: קשים, מאוד. הפתרון בסופו של דבר לא ארוך מדי, אבל יכול להיות מאוד קשה להגיע אליו.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס ממש מעניין, ולא צריך לבוא כשאוהבים הסתברות כדי להנות", "timestamp": 1646237629254}, {"author": "מרטינגל חשיפה", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אלדר פישר\nחוות דעת - הרצאות: ראיתי את ההרצאות בזום. הרגשתי שההרצאות משעממות ומייבשות נורא. היה קשה לעקוב, אם כי יודגש שהמרצה בהחלט סבבה מבחינת יחס לסטודנטים, נעים וחייכן. אבל אני אישית הרגשתי שאני משתעמם.\n\nשם המתרגל/ת: קונסטנטין\nחוות דעת - תרגולים: המתרגל התאמץ מאוד והשקיע בשביל שנבין, אבל משהו בתרגולים - איך שהם נבנו או הוסברו - היה מאוד קשה לעקוב וקשה להבין. היו חסרות לי בעיקר המחשות ויזואליות - תרשים, גרף, דוגמה קונקרטית שנבין לאן חותרים. התרגולים היו יבשים מבחינת התוכן, אבל המתרגל באמת עשה כל מאמץ שנוכל להבין וללמוד ומגיע לו על כך שאפו גדול. \n\nשעורי הבית: \nגיליון ראשון קל ונינוח. שאר הגיליונות - חייבים לחפש רפרנסים בmathexchange או במאמרים או בתרגילים פתורים בספרים כדי לפתור. אין סיכוי לעלות על פתרון בלי רפרנס. וזה מתסכל ומעצבן - בסוף כדי לקבל ציון גבוה אתה צריך לדעת לחפש טוב במקורות מידע ולשכתב את הפתרון בשפה שלך.\nהמבחן: אין, פשוט כי אין שום סיכוי שיש שאלה שאפשר לנסח אותה למבחן. \n\nהשורה התחתונה: לא עפתי על הקורס. יש חוברת קורס מושקעת וגדולה ובכל זאת יש שם לא מעט קפיצות לוגיות ומתמטיות שקשה להבין ככה סתם בקריאה. זה די מצער כי זה אומר שכדי להבין את התרגילים צריך או להאמין למה שכותבים או ממש לפתור בעצמך כל תרגיל ולהשלים את הפערים. לצורך המחשה: היה תרגול אחד שלמתרגל לקח שעה להסביר עיקרון שבחוברת נוסח בשתי שורות. פשוט כי עיגלו שם המון פינות בהסברה. הייתי משנה את הקורס על ידי כך שהחוברת תהיה מפורטת יותר עם פתרונות מלאים ושאלות שיעורי בית שמסתמכות על תרגילים ורעיונות דומים עם וריאציה קלה כדי לנסות לפתור לבד ולא להיות אבודים.", "timestamp": 1678620356845}, {"author": "סטודנט", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אלדר\nחוות דעת - הרצאות: בלתי מובנות בכללי. אלדר מבלה את השעה הראשונה בלהתעכב על דברים פשוטים שראינו בהסתברות ואז בשעה השנייה רץ על הוכחות מסובכות עם זינוקים לוגיים קשים.\n\nשם המתרגל/ת: קונסטנטין\nחוות דעת - תרגולים: התרגולים טובים בסה״כ אבל קשים\n\nשעורי הבית: קשים בטירוף. יש גיליון ראשון קליל, ואז שלושה קשים בטירוף. \n\nהשורה התחתונה: לא ממליץ אלא אם אתם ממש בעניין של גרפים ושטויות. הקורס לא מראה יותר מדי דברים מעניינים לטעמי, ובניגוד למה שנדמה זה לא 100 קל.", "timestamp": 1680189714320}, {"author": "אוטי סת'רין", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אלדר פישר\nחוות דעת - הרצאות: אלדר מאוד משתדל ורואים שהתחום בוער בו, אבל מאוד קשה להבין אותו וכתב ידו לא קריא, מה שעוד יותר מקשה.\n\nשם המתרגל/ת: קונסטנטין\nחוות דעת - תרגולים: מנסה להיות נחמד במסגרת המגבלות שלו. כתב ידו ברור שמציל את המצב, אבל לרוב מדבר אל הלוח עם הגב לסטודנטים וכשעם הפנים לסטודנטים אז לא יוצר קשר-עין.\n\nשעורי הבית: 3-4 גיליונות עם 4 שאלות כל אחד, כאשר כל שאלה היא כמו מאמר בפני עצמו. ההגשה ביחידים. בניגוד לקורסים אחרים, גם בתהליך אתם לבד, אין עם מי ללמוד, כל אחד לעצמו.\n\nהמבחן: אין, הציון לפי תרגילי בית.\n\nהשורה התחתונה: במילה אחת: תברחו! בשתי מלים: תברחו ומהר. הקורס הזה לא אמור להשתייך לפקולטה למדעי המחשב! 75% מהסטודנטים בו הם מתארים מתקדמים במתמטיקה, וגם כאלה שעשו תואר ראשון במתמטיקה טהורה או משולב עם מדמ\"ח. ורק הם מצליחים להוציא ציונים כל כך יפים. לכל מי שממדמ\"ח רגיל, לא משנה כמה מוצלחים הייתם בהסתברות בתואר ראשון, חבל על הזמן והמאמץ שלכם (מניסיון מר מאוד), קורס הכי מתסכל - מעבר לכל דמיון אפשרי. אל תיפלו בפח של ציונים יפים. פשוט לא להתקרב.", "timestamp": 1721631419193}]}