{"posts": [{"author": "סטודנט", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: ההרצאות מאוד נחמדות, ומעניינות. חשוב לחגית שנבין על מה היא מדברת, וזה שהקורס קטן מאפשר ללמידה אינטימית יחסית. היינו בערך בין 2-4 בכיתה פרונטלית ועוד כמה סטודנטים בזום. \nאני נהניתי מאוד בהרצאות. \n\nשם המתרגל/ת: נועה שילר\nחוות דעת - תרגולים: מתרגלת בחסד! מתחשבת מאוד ועוזרת כשצריך. \nבתרגולים עברנו יחסית מהר על החומר, והבנו את הנקודות שצריך. גם היה מהנה בסה״כ.\n\nשעורי הבית: 55% מהציון, בזוגות או ביחידים. בעיני הם היו עמוסים, אבל זה בגלל שבחרתי להשקיע בהם כמו שצריך ועד הסוף. התרגילים לא קשים במיוחד, אבל זה מצריך השקעה, שכמובן מאוד מתגמלת מבחינת הציון הסופי. אני מאמין שגם אפשר לקצר הליכים איתם אם צריך, רק ממליץ לקרוא ולהתחיל את התרגילים קרוב למועד הפרסום שלהם ולא לקראת מועד ההגשה. \nמבחינת החומר לתרגילי הבית: לפי השאלות הלכתי לחומר הספציפי.\n\nהעבודה: 45% מהציון, בזוגות או ביחידים. העבודה לטעמי שאבה הרבה מאוד זמן, היא לא מאוד קונקרטית וחגית (שבודקת את העבודות בעצמה), לא כל כך מכוונת בנושא העבודה. \nמצאתי את עצמי לא בטוח מה אני אגיש בעבודה (בסוף קיבלנו ציון טוב מאוד עליה), וזה באמת היה החסרון העיקרי של העבודה. \nאבל עדיין זה אפשרי, רק חשוב להתחיל את העבודה מייד עם תחילת הסמסטר, ולא לקראת האמצע / הסוף.\n\nהמבחן: אין, וזה יתרון של הקורס, מאפשר ללמוד את החומר ולהקשיב מבלי לזכור אלגוריתמים בע״פ, ולחשוב על כל פיפס שנאמר בכיתה. אפשר ללמוד ולהבין ב-high level.\n\nהשורה התחתונה: קורס תיאורטי מאוד שמאוד עוזר להבין את התחום של אלגוריתמיקה מבוזרת. החומר *מאוד* מעניין לטעמי, ונותן צורת הסתכלות שונה מאשר ׳ורסים שעוסקים בחישוביות וסיבוכיות של מכונות טיורינג. התוצאות שנלמדות יכולות להפתיע. \nאני ראיתי את הקורס כקורס משלים מבחינה תיאורטית ל-236351 ״מערכות מבוזרות״ של רועי פרידמן.\nשיעורי הבית עוזרים להבטיח ציון סופי גבוה אם משקיעים בהם, אך העבודה יכולה להיות בעייתית. דורש השקעה אבל מקנה ידע והבנה בתחום המבוזר שהם מאוד מתגמלים.", "timestamp": 1629279110531}, {"author": "Diana Cohen", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "שם המרצה: חגית עטיה\nחוות דעת - הרצאות: מעניין\n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: קצב דיבור מהיר, ללא עומק, רצה מהר על המצגת וזהו.\n\nשעורי הבית: 4 תרגילי בית שאותם בודקת המתרגלת + פרוייקט תיאורטי שאותו בודקת המרצה.\n\nהמבחן: אין מבחן, יש פרוייקט. \n\nהשורה התחתונה: מאוד נהניתי מהפרוייקט עצמו, מסייע לפתח מיומנויות אקדמיות של בחירת מאמרים, כתיבה מסודרת וכו'. פחות התחברתי לתרגילים ותרגולים.", "timestamp": 1664175965870}]}