{"posts": [{"author": "student", "difficultyRank": 5, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דן\nחוות דעת - הרצאות: מעניינות מאוד! זה בדיוק סגנון ההרצאות שקיוויתי שיהיו בקורס.\n\nשם המתרגל/ת: בר ובוריס מעבירים תירגולים לסירוגין.\nחוות דעת - תרגולים: חשובים לשיעורי הבית. \n\nשעורי הבית: קשים. ארוכים(!). אבל לפחות מאוד מוכוונים, כל תרגיל מכיל הסברים ארוכים על הכל, ככה שהם ממש מלמדים. אני חושבת שבסופו של דבר הם גם מלמדים להתמודד עם מצב שצריך לעבוד עם הרבה קוד שאת רובו לא כתבנו בעצמנו (שזה מאוד חשוב לחיים האמיתיים...).\n\nהמבחן: לא קל, אבל שווה 30% מהציון, אז פחות משפיע מהתרגילים והפרויקט.\n\nהשורה התחתונה: קורס נחמד, בעיני מועיל מאוד. אבל לא קל ולוקח הרבה זמן בסמסטר (וחשוב - למרות שיש הרבה הסברים בתרגילי בית - לפעמים יש הסברים נוספים חשובים במצגת של תירגול שיכולים לעזור ולקצר את הזמן!).", "timestamp": 1626870307657}, {"author": "אילון", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: רוב הקורס אין הרצאות, רק במחצית שניה וזה על נושאים מתקדמים במערכות הפעלה, כל מיני מחקרי עבר של דן. די מעניין אבל חומר לא פשוט, צריך די לשנן כמו תוכי בשביל המבחן\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: בוריס פיסמני\nהתרגולים הם בעיקר לעבור על קוד של XV6 כדוגמא לקחת ממנה השראה לביצוע שיעורי הבית. הרגשתי שזה די מיותר לצפות בתרגולים כי עדיף בזמן ביצוע התרגיל לעבור על הקוד לבד ולהבין מה קורה בו במקום לבהות בהקראה של קוד\nמה שכן, כשנתקעים על קטע לא ברור לבד, נחמד לחזור לתרגול כי לפעמים יש הרחבה בשיעור שעוזרת להבין.\n\nשעורי הבית: \nשיעורי הבית הם הקורס, כל היתר זה ליופי. מאוד כבדים, אבל מעניינים למי שאהב את קורס החובה - הפעלה.\nכל שבועיים יש תרגיל, צריך לשמור לו 3-4 ימים מלאים בממוצע\n\nהמבחן: \nצריך להכיר טוב מאוד את התוכן שלימדו על XV6 שזה די מעצבן  לאור העובדה שזו מערכת הפעלה לימודית ורק מראים אותה כדוגמא בתרגולים, אבל זה המצב.\nשאלות מרצה על ההרצאות בחומר מתקדם - צריך לשנן את ההרצאות, גם די מעצבן. הניקוד על השאלות מרצה היה מחמיר לאללה למי שלא דייק, סה\"כ מבחן לא פשוט אבל הוא רק 30% מהציון\n\nהשורה התחתונה: \nקורס עמוס ומעניין - השקעתי בו חצי מהזמן שלי בסמסטר\n\nהערה חשובה: חובה שותף/ה שמסתדרים איתם טוב כי הולך להיות לכם הרבה זמן איכות ביחד (אי אפשר ככ לפצל עבודה)\n\nהערה חשובה 2: 4 נק\"ז הכי לא משתלמים שתעשו בפקולטה מבחינת יחס של עבודה שהושקעה לנק\"ז שמקבלים עליו.\nאז קחו רק אם אתם באמת רוצים ללמוד יותר על מערכות הפעלה ולא בשביל לתקתק פרויקט", "timestamp": 1628342602973}, {"author": "Student", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: ההרצאות היו מצוינות ומעשירות, אך יש רק חמש הרצאות בסך הכל. הן מגיעות בסוף הקורס כאשר במהלך רוב הסמסטר נלמדים התרגולים. במבחן יורדים לפרטים. \n\nשם המתרגל/ת: בר רווה ובוריס פישמני\nחוות דעת - תרגולים: התרגולים לא תמיד היו בתיאום עם החומר של ההגשות. המתרגלים מתחלפים ביניהם בתרגולים לפי נושאים כך שאי אפשר ללכת רק לאחד וחייבים להגיע לכל התרגולים. לתחושתי התרגולים היו פחות משמעותיים בקורס הזה. קצת מעבר לתרגולים בהפעלה. \n\nשעורי הבית: רטובים ארוכים שלוקחים זמן. אמנם כל התרגילים מועתקים מהקורס המקביל ב-MIT, אך עדיין קשה להבין את המבנה הכולל של המערכת וה-challenge-ים לא פשוטים בכלל. כל עוד הכל עובד זה נהדר, ברגע שדברים משתבשים הדיבוג יכול לקחת ימים. שיעורי הבית גורמים לקורס להיות עמוס מאוד וכבד במהלך הסמסטר. \n\nהמבחן: שאלות לא קלות שמתמקדות בחומר של ההרצאות. הבדיקה מכסחת והממוצע של המבחן נמוך מאוד. החלק הסופי שלו בציון לא גדול בגלל הפרויקט, ולכן עדיין אפשרי לסיים בציון סביר. \n\nהפרויקט: ניתן לבחור מעבדה מוכנה מראש או לממש רעיון עצמאית. הפרויקט לא קל וקשה למצוא משהו שהסגל יגדיר כמעניין. יש הרבה דגש על האם הפרויקט עובד (בסמסטר שלנו אם לא ההצגה מסתכמת בדקה של שאלות על הקורס וחותכים ישר, מבלי לאפשר להציג). \n\nהשורה התחתונה: קורס עמוס, תרגולים פחות מעניינים ומשמעותיים מההרצאות. שיעורי בית קשים להבנה וביצוע, מומלץ רק למי שבאמת מתעניין בתחום ויכול להשקיע את הזמן במהלך הסמסטר.", "timestamp": 1635151244019}, {"author": "O", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: ההרצאות מתחילות לקראת סוף הסמסטר, ויש 5 או 6 כאלו. לא השתכנעתי שהן מאוד מועילות - יותר כמו דברים קצת איזוטריים שאת חלקם נחמד להכיר אבל לא יותר מזה. לקראת המבחן קיבלתי תחושה שההרצאות מלאות בפרטים טכניים קטנים שעליהם ינסו להפיל במבחן, ובדיעבד מרגיש שדי צדקתי.\n\nשם המתרגל/ת: בוריס פיסמניי / בר רווה\nחוות דעת - תרגולים: יש תרגולים פעמיים בשבוע עד סוף הסמסטר, כשבכל פעם יש מתרגל אחר. בגדול מתרגלים טובים (במיוחד בר). המצגות על הפנים ולפעמים היה קצת קשה להבין, אז טוב שהיו הקלטות (וייאמר לזכותי שהגעתי פיזית לרוב המוחלט שלהם).\n\nשעורי הבית: הדבר הכי טוב שהיה בקורס הזה. מועתקים כמעט אחד לאחד מקורס 6.828 ב-MIT, והסגל אפילו לא טורח להסתיר את זה. אני דווקא חושב שיש בזה היגיון, כי עדיף להשתמש בתרגילים שהם כבר 'מלוטשים' מאשר להמציא את הגלגל. הם לפעמים עמוסים, במיוחד לקראת סוף הסמסטר, אבל מרגיש שאיתם אפשר להבין קונספטים לעומק בזה שרואים מימוש (נאיבי) שלהם.\n\nהמבחן: אצלנו היה 3 שאלות בשעה וחצי. המבחן קשה ממש, כמעט לא בודק הבנה אלא בעיקר שינון וזכרון (במיוחד בשאלה מההרצאות של דן), וקורעים בבדיקה כדי שהממוצע ייצא נמוך.\nלמרות זאת, אני חושב שאם אתם לומדים (קשה!) כשאתם יודעים מראש שהמבחן ייראה ככה, כן אפשר להצליח (לי ולעוד כמה זה עבד). ובכל זאת, מדובר רק ב30% אז הכל טוב.\n\nהפרויקט: אפשר לקחת את פרויקט 'ברירת המחדל' (מעבדה מס' 6) או להמציא משהו בעצמך באישור הסגל, כשבכל מקרה צריך להציג את מה שעשיתם. אני לקחתי את הברירת מחדל מרצון והיה די סבבה (למרות עומס סוף סמסטר).\nקצת קשוחים בהצגה אבל בסוף הציונים ממש טובים.\n\nהשורה התחתונה:\nקשה לי לסמן את קבוצת היעד שהקורס הזה מאוד יועיל לה, אולי למי שצריך פרויקט לתואר ומוכן ללמוד קורס שמורכב מהמון עבודה עצמית.\nאם אתם חזקים במערכות הפעלה, אז הקורס הזה לא בשבילכם. הוא לא המשך של הקורס הבסיסי - יותר כמו חזרה עליו עם עוד קצת פרטים ונגיעות אקדמיות (ששוב, לא הרגשתי שהן מועילות) - אז הוא לא יחדש לכם יותר מידי (במיוחד לנוכח העומס שהוא יוצר בסמסטר).\nאם אתם חלשים במערכות הפעלה, הקורס הזה גם לא בשבילכם. מי שהקורס הבסיסי לא יושב לו טוב יאבד די בקלות כי התזכורת (כשצריך) מאוד קצרה.", "timestamp": 1636874033542}, {"author": "Bootloader", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: ההרצאות מתחילות רק לקראת סוף סמסטר, יש 4-5 הרצאות על מחקר של מערכות. לומדים על כמה מערכות הפעלה מיוחדות, לומדים קצת על תופעות שחקרו במערכות ולומדים על וירטואליזציה של IO. מאוד מעניינות.\n\nשם המתרגל/ת: בוריס פיסמני ואיילה פוסטיק-טור\nחוות דעת - תרגולים: בתרגולים לומדים על מערכת הפעלה xv6. בהתחלה מספרים איך המנגנונים שלה פועלים ואחר כך המתרגלים עוברים על הקוד. לא מרגיש שהם נותנים הרבה למי שיודע טוב מערכות הפעלה (בפרט, אם עשה מערכות הפעלה בסמסטר קודם והחומר עוד טרי). למי שלא זוכר טוב, הם מהווים תזכורת די טובה והרחבה מסוימת. המערכת הפעלה דומה מאוד ללינוקס שלומדים במערכות הפעלה, אבל הרבה יותר פשוטה ולכן אפשר לקרוא ולהבין את הקוד.\n\nשעורי הבית: עמוסים בטירוף. הקורס הכי עמוס בתואר. צריך בערך יום-יומיים בשבוע כל שבוע בשביל להספיק, אולי אפילו קצת יותר. יש חמישה תרגילי בית + פרויקט, הכל במהלך הסמסטר.\nאם יש לכם זמן לפני הסמסטר, תתחילו את התרגילים מוקדם. הם ממוחזרים, אז לא צריך לחשוש שישנו אותם, ולא צריך את ההרצאות או את התרגולים בשביל לעשות אותם. גם יש רפרנסים ב-github לקורס של MIT שעליו מבוסס הקורס פה (6.828) אם ממש נתקעים, אבל כדאי להבין מה קורה ולתקן בעצמכם כי ככה לומדים ובסוף צריך לדעת הכל למבחן.\n\nהמבחן: צריך לדעת הכל: את המערכת הפעלה שמממשים (JOS), את המערכת הפעלה שלומדים בתרגולים (xv6) ואת ההרצאות של דן. יש ספר של הקורס שמספר על xv6. ממליץ לקרוא אותו לפני המבחן. יש את המצגות של דן. צריך להבין ממש טוב הכל כמעט עד לרמה של לשנן. כשלומדים, ממליץ לעשות רשימה של העקרונות של כל הרצאה ולוודא שמבינים אותם טוב-טוב. מהתרגולים, הנושאים העיקריים שלדעתי צריך לדעת הם: interrupts, context switch, file system, bootloader כי הם הכי מסובכים. כשתעשו את התרגילי בית יהיו לכם כל מיני דברים שאתם אולי לא מבינים בדיוק למה הם עובדים - שואלים על הדברים האלה במבחן, אז צריך לוודא שמבינים אותם.\n\n\nהשורה התחתונה: התרגילי בית מאוד מעניינים ומהנים, ההרצאות גם מאוד מעניינות, אבל כאמור הקורס מאוד עמוס - אם יש לכם דברים עמוסים אחרים הסמסטר, כנראה שלא כדאי לכם לקחת את הקורס הזה או לוותר על הדברים העמוסים האחרים - כשפשוט יושבים בשקט ובקצב שלכם ומממשים מערכת הפעלה, אלה התרגילי בית הכי מעניינים שיש, אבל ברגע שעובדים עם לחץ של זמן, זה נהיה מאוד מתסכל ומעצבן.\nממליץ לאנשים שנהנו ממערכות הפעלה ולא מתכוונים לקחת קורסים עמוסים אחרים הסמסטר.\nקורס בערך חובה לאנשים שרוצים לעשות תואר שני במערכות/אצל דן.", "timestamp": 1659457788428}, {"author": "מבין עניין", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דן צפריר\nחוות דעת - הרצאות: \nההרצאות שלו מתחילות רק באמצע הקורס, מלמד על נושאי מחקר בעולם מערכות ההפעלה, יש אחלה הקלטות.\n\nשם המתרגל/ת: בוריס אבידן\nחוות דעת - תרגולים: \nמבין טוב את החומר, לדעתי הוא רץ עליו מהר וזה דרש ממני תמיד לחזור לבד על החומר, עדיף לצפות בהקלטות של התרגולים ובמקביל להסתכל על הקוד של XV6.\n\nשעורי הבית: \nנותנים לכם שלד של מערכת הפעלה ומבקשים למממש חלקים אינטגרליים בתוכה (זיכרון וירטואלי, מערכת קבצים, סביבות משתמש ו-IPC) וגם יש שאלות יבשות על כל מיני ניואנסים במימוש, יש רפרנסים להכל בגיטהאב אם אתם לחוצים בזמן.\n\nפרויקט:\nפרויקט הברירת מחדל הוא למממש דרייבר רשת למערכת ההפעלה מתרגילי הבית, ממש מגניב ומלמד למי שמתעניין באמבדד.\n\nהמבחן: \nיכולים לשאול על הכל, צריך לזכור ברמה טובה את המימוש של XV6 ו-JOS, ואת המסקנות מההרצאות של דן, לא קל אבל המבחן לא מהווה את רוב הציון אז קשה להיכשל בקורס עצמו.\n\nהשורה התחתונה: \nקורס חובה למי שמתעניין בתואר שני בתחום מערכות ההפעלה, אני ממליץ עליו בחום למרות כמות ההשקעה שהוא דורש.", "timestamp": 1693033663630}]}