{"posts": [{"author": "lin", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 专爪转 注转  转 专. 专爪 专抓 专  转注 转专  注 专.\n\n砖 转专/转: \n转 注转 - 转专: \n\n砖注专 转: 注住 . 3 专 6 砖 . 砖 拽 爪  注 注专  专 拽  ) 砖注 注专(\n\n:   祝 住转 专转 砖砖  专.  专拽 驻专 注拽专. 爪专    转 专 注专 注  专爪转 转专  注拽.\n\n砖专 转转: 拽专住 注住 .  住转专转 专.  砖转 驻转 转专转.  砖拽 爪专 拽转 砖 砖专 转专 砖 拽专 转专 专 拽 转 拽专住   砖爪注  拽 砖拽祝. 拽专住 专砖 专 砖拽注  住\" 注.", "timestamp": 1627886011843}, {"author": "驻专住驻专 爪", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 专爪 爪, 住专 转 专 爪专 转, 拽爪  转注 注 注 住 砖专砖 砖 注  注拽 专 爪注. 住 转 住,  砖转 砖 转 注 专爪转 砖注.\n\n砖 转专/转: 转 注专\n转 注转 - 转专:  住转 转专 爪. 转  转转-注 转专 砖. 专专 , 砖转祝 转  驻注,  爪.\n\n砖注专 转: \n 注 拽爪'... 砖注专 转 专 注住  拽砖.  砖 专 驻转 注砖 注    拽砖 住转专 专转 砖  注拽专 拽专住 -  .. 爪驻  专 专 驻转 转 注爪. 砖  转专   转 拽    住驻拽 . 砖注专 转 砖 拽 转专 拽爪专 转专.  转专    . \n: \n.  砖  , 专 注 专爪转 转专, 注专 注 砖注专 转 - 拽 爪  . 注 注  爪注 爪. 专爪   转  住专  砖拽转  注,  转拽转 注 专转 专爪转.\n砖专 转转: 拽专住 抓.    转  砖 专爪  专  转专  转转,   砖  住驻拽     爪注专 砖 住驻拽转 驻 转 专. 拽专住 注专  拽     砖转转 住住专 注 砖拽转 专 转 注专转  注住 专, 住祝   拽专住 砖注专 爪 注   拽 . 砖 拽专住  砖砖 专 转注砖   砖注 砖 专转 注 转 -  拽 爪 拽注  专住转 专.", "timestamp": 1627931776459}, {"author": "s", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 拽砖转, 转专转转 住专转 转: 转注拽转 专 住转 驻转  砖驻注  转 拽砖专 专 注砖 (专 转 专 砖 拽 注   转 注砖转). 专 砖拽专住 注专 住住专 转转 驻 砖专 住 砖驻专 转 专爪转.   转 砖 爪注 拽专住 砖住 注专 专 住驻 转专 转 专爪转  砖砖驻专 爪 转 专 专.  砖 住 砖  转  住住专  专爪转  转专 转.\n\n砖 转专/转: 转 注专 /  专 / 专 驻专\n转 注转 - 转专:  专爪转,  转专 住专 转.  转 专专  爪专 拽转  转专   专.  转专 住专.\n\n 砖 注专 砖 转 驻注专 专爪转 转专  驻砖  转 砖 驻专拽  专转 住专  砖.  注专  驻 注拽专 转 砖.\n\n砖注专 转: 注住 : 转拽 砖 住 砖注专:\n6 砖注专 转 砖 砖砖 . 专 注 2-3 砖转 砖转 转  专 ( 注专  注转 注).  拽 砖转 拽转 砖转 住 砖注 转 注 砖砖.\n3 转专 转 专: 注拽专 转专  转转 拽 驻转 -google colab ( jupyter notebook) 拽 注转 注 砖转 砖转 -PDF.  转专 转: 拽 专 转 砖 砖  砖 专 砖 转 住 砖注  注专  砖   砖    专 (+专 转 驻爪'专 砖砖转砖 , 拽转 转 转 专注砖, 拽专 住 砖 注). 专砖转 专  驻转   pandas 砖 拽 砖 拽 专砖转 砖  专 转专转 砖 拽专住 砖 爪 注转 注 砖转 砖转. 注 专转 转专   砖 专  爪注 转转 拽 砖 砖转转 转 :  爪 转 砖 , 注 砖 专 拽  拽  住 砖 注 - 专拽  转 砖砖 拽转 注专 none (null)  驻爪'专 砖专 注 专爪转  转爪转 砖 ( 砖专  砖 砖 拽 砖.   驻转专 注 转 抓 爪注 注 专转 住转 转  驻砖转).\n  砖转  拽砖转 注住转 砖  注 注砖 转专 驻 砖转 专拽 转 拽专住 .  (!) 注   砖注专   砖 转专 转 砖 ML+AI:   砖转 注 转  专 注  住 爪 转转 注 砖转 住转. ,  砖 专爪 转注拽 转 砖 ML, 转 砖 拽  砖转.\n\n: 专 转  砖 ' 专.  专  注专 专  拽砖 转 . 爪转  拽专 转 专 砖 拽专住 (砖 注 拽爪转 专) 砖 砖 . 住祝 砖转 专拽转   砖 专 + 转专 注   砖 砖 拽专住.\n  拽砖  住祝 爪注 爪 驻专.\n\n砖专 转转: 拽专住 拽砖 注住   专祝. \n拽专住 专砖    ' 专 (砖 拽 注) +   (砖 砖 专拽抓):    转  转 住 id3, knn  拽专住  转拽 转  转爪专 拽专  转 拽专 砖,  转  爪  砖 data science.\n\n 砖专爪 专拽 注 注转 砖 ML -AI 转 抓 转    拽 拽专住  (, 注祝 拽转 转   驻 拽专住   砖 专拽注 转专转  砖 转住转 驻转).\n\n专 砖住 注砖 抓 专 砖驻专 转 拽专住   爪驻 砖住住专   注砖 拽专住 爪 驻驻专 ( 注 注住).", "timestamp": 1631084244316}, {"author": "", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 专爪 .\n\n砖 转专/转: 转 注专\n转 注转 - 转专: 转专   住专 爪.  注 转 转 专砖 住 驻专 转 砖   拽专转 住住专,  转专 转 (砖)  .\n\n砖注专 转:  专拽 砖 注住 , 爪驻 专 砖 5-10 拽转 注  砖 住驻转 转专转  专驻. \n\n:  砖专 转 拽 驻  专 专 转 爪注,  专专 . 住驻 砖 注 '  拽爪, 转 爪注 砖 70  注 转专 -10 拽转   驻砖  注转 爪.\n\n砖专 转转:  抓.  砖转 专爪 住 注  转 爪注  拽转   转 砖 砖.", "timestamp": 1646391704481}, {"author": "Anonymous", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "砖砖 转 转 驻", "timestamp": 1646758923524}, {"author": "Nir b.a", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "砖 专爪: 转\n转 注转 - 专爪转: \n注专转, 驻注 驻注 专砖 拽 爪 爪专 注专 砖    转专 (  拽爪注)\n\n砖 转专/转: 转 \n转 注转 - 转专: \n 转专, 转 住 专转\n\n砖注专 转: \n砖 拽 专 注,   专 注 砖专 砖 转注住拽转 注 data 砖 专 驻转 拽  砖住 专爪 砖 转 注拽\n\n: \n 拽  拽 爪 .  专注 专 注 ' 拽专转 注 ' (注   砖转). 注  专 转 住专  注专  住住专 转 转 拽驻爪转 专 专转   专  爪注.  注   砖 砖砖, 转 砖注专 砖.\n\n砖专 转转: \n拽专住 转 注 砖转   砖.  拽 拽 爪   (驻砖 转住转 注 爪注). 专 专砖 专 , 砖 拽爪专.\n住转 抓   转 砖转 砖 注.  ,   砖拽 砖.", "timestamp": 1647304914330}, {"author": "Nitai Kluger", "difficultyRank": 4, "generalRank": 4, "semester": "202102", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 专 专爪 拽爪转 驻专... 驻注 拽砖 注拽 专  专 驻转 转.  爪转 转转 转 砖 转 . \n\n砖 转专/转: 转 注专\n转 注转 - 转专: 转 转专 祝.  砖专 专爪, 转 ;拽 砖 .  转专   爪转 拽专转 .  -   注专 注  专 砖砖 专爪转!\n\n砖注专 转: 3 专 5 砖. 砖  \" 拽爪专 注拽专 转 (转  砖),  专砖  . 专  注爪  专拽 专   \" (拽抓 专) 砖  转 砖砖转拽驻 拽 砖转转. 拽  住  专 转 住驻专转 专转 驻转,   驻砖专 驻注 转拽注 注 砖转. 住\" 注专  转 专 , 转注住拽 注拽专 转 注 . \n\n:  砖   转,  专 驻转 砖专 注砖 专爪 (砖 爪专  ). 驻 ,  3 住住专 专  驻转  转专 转专.  抓   转 专爪转 注专 注 拽专转 . \n\n砖专 转转: 拽专住 砖 注, 砖  转转, 驻爪 住住拽. 砖 拽转 注转  住.  拽专住  驻砖, 转 专转  转砖转   转 驻 驻.", "timestamp": 1657658889762}, {"author": "Vladimir Vapnik", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 专 驻 , 驻注  砖  住专 100% 注  砖转 爪转 (  注 转 专   专 注 砖, 驻砖   爪  专专 转).   砖拽注 爪 专转 转, 住驻专 注 专 注专 专 驻砖专    -      转 专 驻转 ( 拽专住 砖注  转专 砖, 专). 专 拽转 砖 住住专 专祝 砖转 注专 转 拽专住 专 拽爪转 转专 住住转 专专 转注 注 注专 转,   砖  注 砖 住驻专 砖 专 (砖  住祝). 驻  专爪转  拽砖转 专转, 拽 转专 专 砖 拽专住 砖  专 转驻 爪专   专 转专 砖 . 专爪转 3-7 (注拽专 4) 住转 拽砖转 注住转 专 砖 专 . 拽  砖 拽专住  砖拽注 专  专 注 专. 拽专住 拽 砖 砖 砖 转专 拽专住  住专 砖 注专 注 砖转拽砖 砖 转 专  专爪转 砖 .\n\n砖 转专/转: 转 注专\n转 注转 - 转专: 住专 爪专 砖转   砖 专专, 转 爪转 砖 砖. 转专 驻转  专爪转, 注专 转 注  砖专 .\n\n砖注专 转: 3 专 5 砖.  专 拽    砖注 爪 - 转 . 注 拽 , 专 砖专转 专砖. \"转  砖爪专 住专  驻 转 专驻 住专 注拽 驻专 转   砖 注转. 专  驻  注转. 专  砖注砖  砖拽 注 住驻专 (驻专-驻专专) 专转   砖驻注 注 转爪转. 砖 转 拽爪专 (2 砖转 专 , 驻注 拽转 驻注 转专转)   .\n\n: 住住专 注    转. 驻注 专 专 转专, 转专 转, 专爪转  专 砖抓 住转 住驻专  转专   注专 注 转. 专 砖砖  砖 注转 专 .  转转 驻转 砖注  ,   砖转 注 专  住住专.\n\n砖专 转转: 拽专住 专祝, 拽转   转拽  驻 拽爪转 驻转. 砖注 砖   拽专住  注拽 转 砖 住住 住.", "timestamp": 1657731361995}, {"author": "Student", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "砖注专 转: \n砖注专 转 专  注住  专砖  注  砖专 转注住拽转  专转转  注转. 注转 拽 砖注专 转 拽爪专     专 .\n\n: \n 拽 专砖  注拽 砖 专, 爪转 注爪  专 专  专转 住    拽砖   专砖 爪驻 专转 砖 专爪转 砖 拽转. 住祝 住驻专  注专 爪爪.\n\n砖专 转转: \n 抓 注 拽专住, 拽专住   注专 爪专  .  注 转 注专转 转 专  注专 爪专 专 转专  专.", "timestamp": 1658567138272}, {"author": " 注", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: \n专爪  注, 注 转砖拽 专  注 砖 转 ,  注转 注 砖转 专 注 专 砖 专  ( 住专 ).\n\n砖 转专/转: 转 专\n转 注转 - 转专: \n转专 专 ,  砖 专砖转 注爪  抓.\n\n砖注专 转: \n5 砖  (2 砖转  ) 砖转专   砖 拽 转专 转 拽专住 (专 拽专转, 拽专, PCA).\n3 专 转 (1  注住, 2  -3 爪 ), 转 拽 驻转 转砖 住驻专转 专转. 拽砖 住转 拽 转  砖转驻   住注祝 住转 注 拽.\n\n: \n转 专 (住住拽 驻爪),  专砖 注拽专 专 注 专爪转 转专  砖爪专 -80 . 驻砖专   注  注专,   注 专 overfitting \n\n砖专 转转: \n拽专住 转  转拽 砖专  (注转 拽专住 专 砖 砖 转专 high level)   砖 住   专注 砖  转爪 砖住 注  转拽 转 拽.\n拽转 转 拽专住 砖  注 拽爪转 专拽注 驻, 注转 注砖转 转 专 , 拽专住 抓  砖专爪 注 注 砖 machine learning.", "timestamp": 1658575151690}, {"author": "r", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "砖 专爪: \"专 专 专驻\n转 注转 - 专爪转: 专 专 注 注专 转 专注 专  专爪 爪专 注转. 专 专爪转 砖 砖 转 注拽转 转  转专 \"住专 注爪\" . 驻 砖  拽砖 注拽 专  注  转 转转 爪转 转  转 拽专.\n\n砖 转专/转: 转 注专\n转 注转 - 转专: 转专 注! 住专 转 转住  砖住 专爪 注转. \n\n砖注专 转: 砖注专 转 注 专,   拽砖 转专 . 砖转 拽爪专转 转 拽爪专转 转专 转 砖转 驻转转 , 转 转 注专转 驻转 爪  砖转 专拽转 .\n\n: \n住   ,  注专 注 转专 专爪转  砖爪专 砖转  转 住.\n\n砖专 转转: 拽专住 注 砖转   砖 注 ML.", "timestamp": 1658865357603}, {"author": "专注", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: \n 转 注转 拽转, 注转 专 专爪 注 砖 转 注 专爪转.   转 砖 砖 转  专 转 砖转, 转 转 注 转  注    注 拽 转专 转.\n\n砖 转专/转: 转 注专\n转 注转 - 转专: \n转专 砖 , , 爪拽 注专 转 essence 砖  砖 爪专 注\n\n砖注专 转: \n注住 , 转转 拽专住 砖 6 \"\n\n: \n爪专 专 转专 驻, 住住专 注 ' 砖   转   注专  转转 专爪转\n\n砖专 转转: \n拽专住 砖 抓,  专砖 砖转   驻 砖 专拽 3 \"", "timestamp": 1658906778572}, {"author": "Diana Cohen", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: \n\n砖 转专/转: 转\n转 注转 - 转专: 转 砖 专 砖 注,  注住 专 拽爪 砖 拽专住 专 .\n\n砖注专 转: 5 砖注专 转 转专 砖  + 3 转专 转 转转 砖 转专 砖 转. 注住 转专. 注拽专   注 拽专住 .\n\n: 拽砖, 专砖 专 专转.\n\n砖专 转转:  注转  爪驻,  转 拽专住 . 砖拽注 专砖  驻专驻专爪转 .", "timestamp": 1664175089061}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "砖 专爪:  转 拽\n转 注转 - 专爪转: 专爪 , 专 拽 专. 爪转 拽爪转 转 驻注 拽砖 注拽 专.\n\n砖 转专/转: 注 拽专\n转 注转 - 转专:  拽爪 拽  砖转 拽 住 砖 爪 注, 砖  . 转专  注 注专  专砖转 砖 注转 转转 转 砖 注 砖 驻转 专专 转注 注 ( 驻转 砖 住转 爪专 转专 注拽). 爪 !! \n\n砖注专 转: \n  注住  砖转专 转 注专 (   砖 转专 砖 拽转).\n5 转专 转 转拽驻 砖 注 砖 砖,  拽砖  拽驻 转 专 .\n3 转专 转 转拽驻 专 砖 注拽专 注,   注 砖,   转  砖 住 专 注专 爪.\n专拽  转砖 转转 转专转 专驻  砖转 转专  拽转 转专...\n\n: \n注  \n砖专 转转: \n注,  注住   拽砖 . 爪 转专 拽专住 专  转 注 转.", "timestamp": 1674403769673}, {"author": "专注", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 注转, 驻注 拽爪 拽爪转 专 . \n拽砖   转专.\n\n砖 转专/转: 注 拽专\n转 注转 - 转专: 注 转专转 注! 注  砖注专, 住专 转 专 爪专 专专. 注 注 注  砖转,  转专,  , 转 砖驻  拽砖 拽注 砖注转 拽  注转  注专转 砖. \n\n砖注专 转: 注住,  砖 转注拽 注 驻转专 .\n\n: 注  ", "timestamp": 1674475434963}, {"author": "住 拽专转 住祝 拽专住", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 注转 , 专转 砖专 专 注住  注专 爪专 转 转转\n\n砖 转专/转: 转/注 (住转 转专 砖 砖 住专)\n转 注转 - 转专: \n转专 砖 转  砖驻 ,  住 转 , , 住专  注  注拽 砖专 砖 注专.\n\n注 注专 转专 爪专  转转, 注拽 住 砖 住 专  砖 砖转, 注 砖 专专.\n\n砖注专 转: \n驻专拽 (\"专\") 注住,  住  转 专.\n-shorts (\"砖\") 专 拽爪专 拽注", "timestamp": 1674649030987}, {"author": "student", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "砖 专爪:  拽\n转 注转 - 专爪转: 砖注 转, 转专  专 拽\n\n砖 转专/转: \n转 注转 - 转专: \n\n砖注专 转:  ,  转 拽专转 住祝, 转专, 5 \"拽爪专\" 砖  3 专, 住 8 砖转 注专 拽专住 专!! 拽爪专  转 拽爪专, 转转 砖 拽转 注  驻驻住 拽. \n专 拽专住 专 砖 住祝 转专 , 转 砖拽注 驻 转 转专  拽专住 驻注 ,   砖驻!\n\n: 专 \n\n砖专 转转:  注 转 专 注祝 砖转注砖 转      专  拽专住 砖注专 爪注 注 转 砖拽注 转专  爪专 爪 砖 驻注 砖专 拽爪注转  住住专 ,  转 砖 注 注, 转拽 砖 拽 转专.", "timestamp": 1676129113204}, {"author": "", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 注专转 爪专  , 砖 专拽爪 注 住 转 转 拽 \n\n砖 转专/转: 注 拽专\n转 注转 - 转专: 转专转 爪转! 注 住转 住专  爪专 专注 住转. 住祝, 砖注转 拽 砖  注专转  . 爪转 转专\n\n砖注专 转: \n\n: \n\n砖专 转转:", "timestamp": 1676299714559}, {"author": "R", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转:  拽转,  转 注专 转 爪专  砖转  砖 砖 注 专 砖 转专. 爪转 注爪  注住转 驻注 拽砖   转 驻.\n\n砖 转专/转: 注 拽专\n转 注转 - 转专: 注 注! 注转 注转 注  砖转, 转转 爪 爪注转 转, 砖转转 爪注 转 拽砖专   拽 拽专住.  住转 注转 砖 砖转.\n\n砖注专 转: 砖  拽, 专 专, 驻注 住 爪专  -砖注转 (砖转 砖 专专  注拽/专专转 爪驻 转砖)  注  拽转 住转 ( 砖专 转 专砖 注  砖爪驻 转砖 转).\n\n: 专 , 驻专 拽爪转 砖 住住专 拽.   砖转 砖专砖 砖转  注 专 (爪专转 转 转转),  注 专 注爪 砖 转. 专 专砖 砖专 转 拽爪转  转专 住住专 拽.\n\n砖专 转转: 拽专住 注, 专砖 砖拽注  转转.", "timestamp": 1676541430159}, {"author": "", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 专爪 爪, 祝 转 专爪转 砖.\n\n砖 转专/转: 转 \n转 注转 - 转专: 转专   驻注 专  专转 砖注.\n\n砖注专 转: 注   专 注住\n\n: 专 转, 拽砖  专转 住住专 拽\n\n砖专 转转: 拽专住 抓  砖 注 转", "timestamp": 1676620066273}, {"author": "", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 专爪转 注转, 住专转 专专转\n\n砖 转专/转: 转 \n转 注转 - 转专: 转专 注, 注 注专 转 专 爪专 转 专 专   专爪转 \n\n砖注专 转: 住\" 专转 注住 住专  拽爪专爪专    转拽专 住专  砖 专 驻注  转\". 爪专 砖拽注   专. 注 砖拽 转 拽砖.\n\n: 专 转专 转 驻转 拽  砖 拽转. 砖 转 驻专 专 拽 砖驻注  驻砖\n\n砖专 转转: 拽专住  注 住\"", "timestamp": 1677051929148}, {"author": "Loss", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "砖专 转转: 转 砖专 转转- 注祝 注砖转 转 拽专住 砖 砖. 拽专住 爪   转 转专 (驻转 住), 注转  爪 注专 爪 住驻拽 , 砖注专 转 专   住 爪,  砖转 转 转 专 专转   砖.\n\n砖 专爪: 转\n转 注转 - 专爪转: 转转,   住转 转转 爪. 爪转 爪 砖转 爪  注, 砖  转. 住祝 \"砖转 爪\"  驻注转 砖 驻拽转 转.  转 专爪,   专爪, 驻   转.\n\n砖 转专/转: 转 注专\n转 注转 - 转专: 转专 专  转 专 . 砖  转  砖 砖. 砖.\n\n砖注专 转: 砖- 注, 住专 驻转 专. 专- 拽砖 拽驻 , 专砖 砖 注转.  砖转 拽 砖转 爪  砖爪转. 转 专砖 拽 驻砖  注  专 拽, 专转 住转拽 砖 转专转, 转专. \n\n:    专 .   砖注, 住祝  砖 (注) 爪  砖驻 砖 注 注转 砖转  住注驻 砖 转 驻专转.  拽砖专 注 专,  转 转  转专 拽专住 专.", "timestamp": 1677417380440}, {"author": " 住  专", "difficultyRank": 4, "generalRank": 5, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: \n专爪 爪.\n\n砖 转专/转: 转 \n转 注转 - 转专: \n\n砖注专 转: 专  专  专. 驻注 砖 砖转 砖 住转  专专 驻砖专 住转 转.\n\n:  转专 拽砖 住住专 拽. 专 砖砖  砖 注转 转 拽砖 砖  住住专 住住专.\n\n砖专 转转: 住  转  砖 拽专住 转 .", "timestamp": 1679147023275}, {"author": "住", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 专爪 , 驻注 拽爪转 专  注 注 注 砖转 砖\n\n砖 转专/转: 转 注专\n转 注转 - 转专: 转转. 转专   砖  转专, 专转 专  . \n\n砖注专 转:  专. 拽爪转 注爪 注  专驻  住状 住专.\n\n: , 住专.  转 驻拽专, 爪 砖  爪专. 砖 砖转 转转,  砖 专   砖 专专 -  转.\n\n砖专 转转: 抓 注    砖  驻砖 注转 住住. 拽专住  注 住  专 砖驻转 转 专砖.", "timestamp": 1683732484040}, {"author": "BaronCabbage", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转:\n专爪 专 砖 转 专 注专 转 爪专 ,  拽转 转 砖 拽, (专转 砖  砖 专 砖  驻转 ,)    转 1-1 转 专.  拽专 抓 转 驻专  驻砖专\n\n砖 转专/转: 转 注专\n转 注转 - 转专:\n转专 砖  专爪 砖  转 转  , 注专 转 专 爪专  住专 转 专    专爪  注 注  砖转\n  驻注 砖转  祝 转,   转专  拽爪转  驻注\n拽 拽 砖 转    专爪转 -  转 住转\n\n砖注专 转: \n拽 - 3 专 转 专 砖 爪专, 5 砖   -  注住  驻砖专 注 驻注 转   砖  砖转祝\\  拽专住 \n\n3 专 砖   注  专 砖, 拽 '专'   专转 砖 jupyter      专  爪专  专    注爪  拽爪 砖 住驻专转 注 注拽专转 专  转 注  驻转 砖  转拽驻   专驻 砖  专 . 爪专 砖   专 注 20 砖转  专驻.   驻转  拽 注 ,  砖  专 拽     注转   砖 专爪,  转住转 砖 专  砖转 转专转 住 住转 专 专驻 砖.\n爪驻 砖 专 拽   . \n  转 砖  驻转专  专 住 转注拽砖 砖 驻转专 注 砖爪 拽专住 专祝 专 砖注 专拽    转拽 转 住  砖住祝  注    驻转专.\n\n5 砖  专  砖 祝 注砖转 砖 驻砖专 住  砖注转  \n\n:\n  , 住 爪专    砖注转, 砖 注  拽专 拽爪 砖 专 注 拽转 砖专 驻砖 专爪  转专,  专     砖砖 驻转 砖砖  专   驻砖 . 住祝  专拽  砖 砖 专 注 祝 驻注  砖 砖驻注 专拽 砖注专 转 专 \n\n砖专 转转: \n转   注 专 注专 爪专 \n转 转 住转 拽转   转转 转 转  住专 转 专 砖拽专住 0.8  转 注住\n转转 砖 转   爪转 \n\n注 抓 砖  砖注 转    砖", "timestamp": 1689590669653}, {"author": "Kernel SVM", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "砖 专爪: 拽 拽\n转 注转 - 专爪转: \n注转 专转\n\n砖 转专/转: 转\n转 注转 - 转专: \n转专 驻爪爪, 砖 注\n\n砖注专 转: \n注住  注  砖 注转\n\n: \n 拽, 爪专 转  转 专  爪\n  专 ,  砖 转 专   爪  砖专 转 专砖\n\n砖专 转转: \n拽专住 注, 抓 \n  砖转注  ", "timestamp": 1689769993067}, {"author": "BADABOOST", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "砖 专爪: 专 专驻\n转 注转 - 专爪转: 注\n\n砖 转专/转: 转 \n转 注转 - 转专: 注\n\n砖注专 转: 5 砖注专 转 拽爪专 (拽  砖注转), -3 专 (拽  ). 拽爪专 住转 拽, 专 转专 拽砖,  驻转  注住 .\n\n:  砖  住驻拽   驻砖专 爪   砖  转  砖.  拽砖专 专 砖  住 砖转 砖 专 拽砖专转 砖专转 专 拽专住 住 专 砖  砖 注 住转... 专砖 砖砖   专 转专 砖 砖驻砖专 砖 注  专转  砖 专.\n\n砖专 转转: 拽专住 注, 住驻 砖 专  抓    转 住住  专转  转专 转.", "timestamp": 1690313461762}, {"author": "专", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "拽专住     \"\" 拽砖 注 专 砖砖砖 ,   爪 拽爪转 住祝 拽专 砖 专", "timestamp": 1709136216550}, {"author": "A.A", "difficultyRank": 3, "generalRank": 1, "semester": "202302", "text": "砖注专 转:  3 专  注住     注爪 拽 拽驻转 专  住专. 转  转  注  住专 驻 砖  转 . 砖 专 注专 拽 转 专.\n\n:  注  注转 \n\n砖专 转转: 转转专拽!!!!!!!! \n 砖驻砖 转 转专 拽转 拽专住 专 注  转专  转   拽专住 砖.", "timestamp": 1710789230951}, {"author": "住 专注", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 拽爪转 拽砖  转 专   转 住 , 专  注专 注    住转专\n\n砖 转专/转: \n转 注转 - 转专: 转专 住  , 转\n\n砖注专 转: 专  注 , 转 colab  注专 专   注 砖转注砖  砖 ( 爪转) \n砖 砖注专  转 专\n\n:  拽住 砖 \n\n砖专 转转: 驻   拽 100 拽专住 砖 注砖转!", "timestamp": 1711964847587}, {"author": "AI", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 专爪转  专注转. 拽爪转  驻 转 转 转专  注转.  专爪 住专 住\"  砖  注 注转 专爪转, 砖  住转  转住 专爪转 砖转 砖 住. 专 驻转 转 转专 专 拽 注专 转 专注 .\n\n砖 转专/转: 专拽\n转 注转 - 转专: 转专     转 .   专 转 砖驻专砖  住祝  专 住  砖. 住  住专 专专 转 爪转 转 (爪拽 砖)  驻注 专砖 砖 住专 住驻拽 注拽 拽转 专转.\n\n砖注专 转: 转 专转 砖转. 砖转 转 拽爪转 转 砖转 砖砖 . 专转 专转 住转 转  驻注  砖 转 砖 注 拽 砖 .\n\n:  住住专 砖   .  砖驻专注 注拽专  砖住转 注 专 注 转 转 转 转, 专 砖 注 专 注  砖 专.\n\n砖专 转转: 拽专住 住专  抓  砖 转 转. 爪专 拽转 砖 砖 转.", "timestamp": 1713463243038}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "砖 专爪: 转\n转 注转 - 专爪转: \n住专 注 专专,   注拽 驻转 驻专拽拽  住专 转 转 砖 砖 专. 砖 拽转 专注 砖 转 注爪   专    专注,   注专.\n\n砖 转专/转:  专\n转 注转 - 转专: \n转专.  驻专转  拽转. \n住祝 砖 砖 驻注  拽住驻 专爪转 转 砖驻注转   砖 拽专 转 爪转  驻转.\n\n砖注专 转: \n转专 转 拽爪专    驻爪转 注   注 住祝 转专 转 专, 砖 注住     砖驻 转. 住祝   注, 拽爪注 注 注 专 专转 拽专住.\n\n: \n住 , 驻砖专 专 爪  转 转 专爪转.\n\n砖专 转转: \n拽专住 注  注   砖   注  爪注  转,   注拽专转  爪注  砖转 砖转 砖爪专 拽转 砖 爪注 砖.   拽专住  砖 专 注 砖 Data Science   砖拽 注转 拽转 转 爪 砖 驻专拽  拽专住 专 住 砖转 转专 转砖 注  注砖转 ( 专拽 注拽专转 转专 砖).", "timestamp": 1713508119502}, {"author": "microsoft SVM", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 住专 拽爪转,  专爪  注 转 专\n\n砖 转专/转: 转 专 \n转 注转 - 转专: 转专 注, 砖  拽爪 砖 转专 砖转\n\n砖注专 转: \n 专注 转专 砖 拽爪专, 砖转  拽爪专 专专\n 砖砖 转专 专 转专 专, 砖    注住 专.   爪专祝 拽专转 驻,  砖 砖专  专  砖注,   ,  转专  爪专 专  转爪转 转  专驻 砖住专 转 专砖, 爪专 转 专驻专   专砖  砖专 注 砖转 转 拽转  住专.\n\n: \n   拽\n\n砖专 转转: 专 转专 砖注  砖爪驻转 转 转 ,  砖 砖 砖 砖 转注 注 , 拽专住 拽专  转  专拽 转 住住 砖 驻 (砖 注拽专  砖注砖 )", "timestamp": 1713740629483}, {"author": "", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 转 专爪 住专.   拽 砖       专 专爪转 砖   拽专 砖拽驻. 拽转  转专 转  驻转 砖 驻砖专 注专 专 专 \"注专 专\" 砖 注砖 注 .\n\n砖 转专/转: 专拽\n转 注转 - 转专: 专 砖 拽专住. 住 注专转 转.  转专 专. 转 转拽驻  转拽转 转专     注  住住专 专砖 砖 转专 转 拽专住. 砖驻 注拽.\n住祝, 住 注砖 住转 专 拽  拽 注 转专 拽专住. 爪 砖 转 转 注专 砖注砖 注 注专 住转  住专 砖 注专   .\n\n砖注专 转: 专  注 . 拽  转  专注  砖专 拽 祝,  砖专  爪专 专驻 注转 注 砖转 驻转转. 驻注  驻转   砖转 砖 住驻拽 转  转专. 拽 砖 拽驻转 砖 拽爪, 转转驻 90.\n砖 住 专. 专砖 砖注转  砖砖 注  住 转 专  转 转 转注住拽转 转. 注转 转专 转 拽砖 转专  (转祝 注 )  注砖转 转.\n\n:   住住拽 住转专转    转 砖 注转.  砖转 砖转 砖砖 砖  注专转 转   专 转 注驻 拽 砖 住转专转  住住拽.   拽砖   专驻, 驻砖专 转  爪, 抓 注专 注拽专 住专拽转  驻转专 转爪转 ( 住专 转  转爪转 住 住转专).\n\n砖专 转转: 拽专住 专 注  专 驻 驻拽 注转  爪拽.  住转 砖注 转 砖 专  砖注 砖 专 专 转拽. 专 砖转拽 转  拽专  砖 爪 :)", "timestamp": 1713762667778}, {"author": "soft-svm", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 住状 住,   转专  注转.\n\n砖 转专/转: 专拽 驻\n转 注转 - 转专:  住状 住专,   注转. \n\n砖注专 转: . 住 驻专住 转 爪 驻, 砖 注转 注  砖.  砖 砖 转 砖, 驻 转 转砖, 专 转  拽转 注  砖 砖转. 拽 砖 转专 转 转,  住 注爪 专 4 住注驻 转专 转 (砖 转 专), 转转 爪 专拽 注 住 4 住注驻. 转专 转 专 住转 专, 专砖 砖拽注.  专砖  拽.   转   拽 转 转专  砖爪专,   转转 转专 专.\n\n: 注驻. 拽专 拽住 砖 状拽砖 爪注状, 砖 拽砖 拽专住  专 转 爪注. 驻 转 转专转 驻爪转. 砖专  拽转 注  砖 爪转 砖-log   驻拽爪 转,  砖专 专.   转 住专,  转 转 砖专专  专. \n\n砖专 转转: 拽专住 住转   砖专爪 注砖转 拽专 转, 注 转  爪专 拽砖 注. 专 转 转砖转 爪 住,  转 抓 拽转   注 注 转 转 拽专.", "timestamp": 1715014414134}, {"author": "", "difficultyRank": 5, "generalRank": 4, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: \n专爪 住专, 注转   注专 转 专 爪专  . 转 砖 转 -2 住 砖注  转 转砖转 砖 专爪 砖注   砖   注拽 住专 专抓 注 拽 转 砖专   专. \n\n砖 转专/转: 专拽\n转 注转 - 转专: \n 住专, 砖 专  转专. 驻注  住驻拽 转  爪转  转专.\n砖注转 拽 砖 砖 转 驻   注专.\n\n砖注专 转: \n住住专 拽爪专 -12 砖注转  转 砖 专  5 -4 转 专 拽爪专 注,  注  注住 拽专住 砖 3 拽.\n砖 拽爪专 砖 驻 砖 专, 抓 砖拽注   . \n专 注住  , 拽 砖  拽驻转 驻注 专  注 拽 注 专 拽   砖住专 转专转 专祝    拽驻 注 驻专 爪拽 . \n\n: \n砖转 转  转专 转  -  注 2021  砖拽驻 转 专.     2021 拽 转驻转 驻 转 专 转专 拽砖  转转 砖转转. \n住住专 注   住转   注 专 砖,  转拽 转  转  驻转专转. 爪 专 专   注专 拽,    爪 住 拽专住  拽转 砖 专转  拽  专 驻转 驻砖专转  注转 注 砖 砖 ,  爪 爪注  爪专 住转 专. \n转爪 专 砖拽 住  住 注  砖转,  注转 砖 拽   拽住 住专 转砖转 . 砖注转 注 砖 砖专  拽 注  \"住转 \". \n  住专   驻砖 专转 驻 专 驻拽 砖 注 砖转 拽转 砖 住专 转砖转  砖驻  专转 专 拽专住 注爪. \n\n砖专 转转: \n注住 住 拽  注   专. 抓  砖 专转注 转拽  砖 专  拽专住 专爪转  注专 转 拽 转 爪专   .", "timestamp": 1715112680952}, {"author": "Daniel Pe", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "砖 专爪: 转 拽\n转 注转 - 专爪转: 驻注 拽爪转   注 注爪 拽砖 注拽    注 砖 注 砖转 砖 转 拽转 砖 砖驻砖专 专 注  砖 砖   专 住专 转 驻.\n\n砖 转专/转: 专拽\n转 注转 - 转专: 转转    砖 转专    转专  注专  驻专转 注 驻 拽转 砖 转 砖 转专 注爪 转专 \n\n砖注专 转: 4 砖 + 3 专. 砖  注 砖  砖注转 注   爪  爪. 专 专,     驻砖专 驻 爪 转专 拽  住\"  专.\n\n:  . 注 住驻拽 转专 驻砖专  爪 爪 .\n\n砖专 转转: 拽专住 抓 祝  注.", "timestamp": 1716917248648}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "砖 专爪: \"专 转 拽\n转 注转 - 专爪转:  驻转\n专  住 砖 转  驻专转 注 住转 拽  砖 住转专转 驻转 住转 驻爪转 砖转  . 专 砖专爪转  专专转   专爪转 转 驻专转  .  拽专  砖  砖转 住转   砖 砖专 砖注专 注 驻注  转 专 专. 专转 拽 专  砖 拽  转 砖转   爪转.\n\n砖 转专/转: 转 \n转 注转 - 转专: 住\" , 转专 专专 专爪转.\n专 驻注  转专   驻注专     专爪 ,  转 住\" 注砖 住专  砖.\n驻注  住专 专 驻砖 注 转 专转 转  专 转 专 砖 注 转 专 , 住专 砖  住, 专转 砖 驻转 专专  砖住住专 转拽.\n转注专 注 转专  砖   转\".\n\n砖注专 转: \n砖 4 砖 3 专. \n砖 - 专砖   专    拽 住专  砖 5 6 砖注转 注 ,  注专  专转 专 转专.   转驻专 转  .\n专 - 专   住驻专 拽砖 , 注拽专 拽砖 转注住拽  专 驻注 转爪 转 注爪 砖 转 爪  注砖 转  砖拽砖   ,   .  拽爪专    .  专 转专 转 1 注 砖 专爪 8  转  砖  爪拽 砖.\n\n: 转  砖 转  爪 专,   砖 注 专 (   ),  驻爪转  砖转专 住驻拽   爪 爪 砖 .   转驻住 砖 注 拽转  爪注  ,  转砖转 住 住专 拽.\n\n砖专 转转:  砖 转 转 专   砖. 拽 注   转专 砖  拽砖 转  专  砖 拽   拽   驻砖专, ( 砖专    转专 拽砖 注 专拽  专).", "timestamp": 1717940135205}]}