{"posts": [{"author": "OG", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "קיבלתי המלצה מחבר לעשות את הקורס למרות שאין חוות דעת, לא התאכזבתי ואני ממליץ עליו הלאה\n\nשם המרצה: אבי מנדלסון\nחוות דעת - הרצאות: \nאבי מעביר את ההרצאות, נכנסים לעומק של איך עובדים GPU מודרניים, מעניין לשמוע על ההבדלים בין מעבדים רגילים ומעבדים גרפיים שעובדים מאוד טוב עם מערכות לומדות. לפעמים נכנסים קצת יותר מדי לעומק וזה יבש, אבל סך הכל מעניין, אבי היה מהנדס בכיר באינטל ופיתח חלק מהדברים שמראים בקורס. אבי מרצה נחמד, ישבנו 4 אנשים בכיתה כל הסמסטר והייתה אווירה מעולה.\nיש בערך 4 הרצאות אורח מאנשים תותחים שאבי מכיר ומביא, מעניין מאוד לשמוע מה הם עושים.\n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים: \nלפעמים יניב מדבר על דברים שקשורים לתרגילי בית, ולפעמים מדבר על נושאים כללים או נושאי המחקר שלו. החומר של התרגולים ממש מגניב, יניב דיבר גם על המחקר שלו ועל מאמרים חדשים שרלוונטים למה שאנחנו עושים.\n\nשעורי הבית: \nהיו שני שיעורי בית, הראשון היה לתכנת ממש על GPU קצת עם CUDA. פעם ראשונה שנחשפתי לזה, היה חופר קצת והיינו צריכים לקרוא באינטרנט, אני חושב שכולם קיבלו 100. התרגיל בית השני קליל ממש, קיבלנו כרטיסים של AMD Xilinx להריץ עליהם קצת משין לרנינג עם כמה טריקים שלמדנו.\n\nהמבחן: \nאין מבחן. יש פרויקט סוף, כל אחד בוחר לבד מה הנושא ומאשר עם יניב ואבי (שיהיה קשור לקורס). עשינו מצגת על מה כל אחד עושה בפרויקט בהרצאה האחרונה. הם ממש זורמים על האפשרויות לפרויקט, כל אחד מביא מה שהוא מכיר ורוצה להתעסק בו, זה אחלה של מקום ללמוד בו.\n\nהשורה התחתונה: \nאין באמת רלוונטיות לממס אבל כדאי לעשות לפני. מאוד מאוד מאוד מומלץ כי 1) זה קורס ממש כיף 2) בסוף אנחנו מתעסקים במודלים של למידה אבל מאוד שווה לדעת על מה זה רץ ולמה בעצם זה עובד טוב יותר על כרטיסי גרפיקה 3) הסגל ממש זורם ויש אווירת למידה מעולה, הם מאוד תומכים בנו וזה נראה לעין", "timestamp": 1688998400760}, {"author": "Yuval Mandel", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: אבי\nמרצה ממש נחמד ומעניין, מוסיף הרבה אנקדוטות מהניסיון שלו. ההרצאות מכסות מגוון תחומים בהאצה של Deep Learning בחומרה, בין היתר על מאיצים במעבדים עצמם, ב-GPU, ב-FPGA ומעבר לטייטלים שלהם גם מוזכרים רעיונות שהם די אוניברסליים לתחום למידה וארכיטקטורות חומרה. אפשר לשאול על לא מעט דברים מקיפים שקשורים לתחום גם אם הם לא קשורים ישירות למטרת ההרצאה.\n\nשם המתרגל/ת: יניב\nחוות דעת - תרגולים: חלקם המשך פרקטי של ההרצאה שקשורים ישירות לשיעורי בית והם חשובים להצלחה בהם. חלקם זה עוד נושאים שיניב חוקר כמו Adversarial Attacks. יניב מעביר אותם מעולה.\n\nשעורי הבית: אצלנו היו 2 תרגילים למרות שתוכננו 3, בגלל קשיים טכניים. בגלל שמדובר בקורס קטן יחסית מומלץ להתחיל אותם מוקדם כדי שאם תתגלה בעיה טכנית, אפשר להעלות אותה ליניב במהרה.\n\nהמבחן: אין מבחן, יש פרוייקט. במובן מסוים, המטרה של ההרצאות והתרגולים היא להכיר תחומים שונים כדי לבוא אחר כך עם רעיונות לפרוייקטים. אפשר לקחת פרוייקט שאבי ויניב מציעים, אפשר לבוא עם רעיון שקשור ישירות לחומרים שנלמדו ואפשר לבוא עם רעיון חדש לגמרי שקשור לתחום, מה שמתאים.\n\nהשורה התחתונה: קורס מעולה ומומלץ בחום אם אהבתם את הנושא של מבנה מחשבים. מעולה גם כקורס \"סיכום\" אחרי שיש ניסיון בקורסים אחרים רלוונטים כמו מאיצים, וגם כקורס \"התנסות\" כדי לראות האם התחום מעניין אתכם בהינתן שאהבתם את מבנה מחשבים.", "timestamp": 1702199041293}]}