{"posts": [{"author": "Foxy", "difficultyRank": 2, "generalRank": 3, "semester": "201901", "text": "שם המרצה: ארנה גרימברג\nחוות דעת - הרצאות: קצב מאוד איטי למי שבא כבר חד על לוגיקה, ולפעמים מרגיש שרק התרגול מספיק. לא הרגיש שיש בהן הרבה עומק.\nחשוב לי לציין שסבלתי מאוד מהעובדה שהמצגות כתובות ב-Comic Sans :)\n\nשם המתרגל/ת: שרי שינולד\nחוות דעת - תרגולים: \n\nשעורי הבית: לא מאוד מסובכים אם הבנתם את התרגולים כמו שצריך. חלק מהשאלות ממוחזרות, אבל גם את אלה שלא אפשר לפתור ביום בערך לגיליון. \n\nהמבחן: לא קשה. בדרך כלל רוב השאלות בעלות אותו מבנה (ואותם טריקים). אצלנו היה עם חומר פתוח, וזה בדרך כלל ככה - שווה להביא פתרונות של מבחנים ישנים מראש, בגלל שהרעיונות חוזרים על עצמם.\n\nהשורה התחתונה: לא קשה והממוצע די גבוה (~80), שווה למי שלא סבל בלוגיקה.", "timestamp": 1612374972336}, {"author": "מבנה אבסטרקטי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: היה מקוון הסמסטר, הוא העלה ליוטיוב סרטונים של ההרצאות (אותם שקפים כמו של ארנה המרצה הקודמת אבל עם קצת מתיחת פנים) והייתה כיתה הפוכה שאפשר לשאול שאלות. לדעתי זה היה פורמט טוב כי התוכן עצמו שמועבר בקורס הוא לא רב מבחינת חומר, והסרטונים היו קצרים ולעניין וזה היה עדיף מהרצאה של שעתיים. יקיר עצמו נראה בן אדם נחמד מאוד, למרות ששמעתי שבלוגיקה באביב הוא לא היה משהו אני אישית נהניתי ממנו.\n\nשם המתרגל/ת: אוהד חאודסמיד\nחוות דעת - תרגולים: מכסים חומר דיי דומה למה שמועבר בהרצאות, זה מה מהקורסים האלה שהתרגולים תלושים מהן, אבל הם כן חשובים. אוהד ממש נחמד ותמיד רצה לוודא שכולם מבינים. ממש מתרגל מקסים.\n\nשעורי הבית: כל גליון בפני עצמו הוא דיי קל ואפשר לקפל את רובם ביום אבל יש הרבה מהם וזה קצת מחניק לקורס בחירה.\n\nהמבחן: לא היה להיט, נתנו שעתיים וחצי ושאלות מוזרות , אז לא הייתה ממש הצלחה וזה נחתם בממוצע בעייתי. הסגל פירגן בפקטור נדיב במיוחד, אז הממוצע סטנדרטי+ כמו בכל סמסטר רגיל של הקורס.\n\nהשורה התחתונה: כמו לוגיקה אבל בלי כל הבלבולי שכל של גדירות ומערכות הוכחה אבסטרקטית, אפשר לקרוא לזה לוגיקה יישומית. קורס בחירה נחמד לדעתי, לא מתחרט שלקחתי.", "timestamp": 1613647103893}, {"author": "Magner Ido", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא הכי מעניינות, אבל הנושא כן קצת מעניין, תכלס ממש תלוי כמה מעניין אותכם כל הנושא של הרבה תוכנה(והרבה לוגיקה)\nשם המתרגל/ת: \nרועי דויטש\nחוות דעת - תרגולים: \nדומה להרצאות, טוב לתרגול של החומר\nשעורי הבית: \nלא מסובכים מדי, חוזרים על החומר וטובים לתרגול למבחן\nהמבחן: \nהחומר די שיטתי, בהתחלה קצת מסובך אבל אחרי תרגול לא ממש מסובך, כן צפוף בזמן ועדיין יכולים להפציץ בשאלות\nהשורה התחתונה:", "timestamp": 1644417697210}, {"author": "ע", "difficultyRank": 4, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: סרטונים קצרים לראות, כאותו פורמט של לוגיקה, לא מעניינים במיוחד\n\nשם המתרגל/ת: רועי דויטש\nחוות דעת - תרגולים: לא הייתי ברוב התרגולים אבל ממה שהייתי זה בעיקר תרגילים על החומר וקצת חומר חדש\n\nשעורי הבית: \nהרבה תרגילים, עוזרים למבחן, הבודק לפעמים אוהב להתאכזר קצת\nהמבחן: \nקצת טריקי, לחוץ מאוד בזמן אבל אחרי תרגול אפשר להתמודד עם זה\nהשורה התחתונה: \nלא הייתי ממליץ במיוחד על הקורס אלא אם אתם ממש מעוניינים בתחום של אימות תוכנה.", "timestamp": 1645201285247}, {"author": "1", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יקיר\nחוות דעת - הרצאות: לדעתי לא צריך את ההרצאות, אפשר לעבור על המצגות וזה יספיק.\n\nשם המתרגל/ת: עומר רפרופרט\nחוות דעת - תרגולים: עומר מדהים מאוד מומלץ\n\nהמבחן: לחוץ בזמן, כדאי לעבור על כמה שיותר מבחנים והרעיונות יחזרו על עצמן.\n\nהשורה התחתונה: קורס לא כל כך מעניין, אבל אפשר להוציא בו ציון טוב", "timestamp": 1677687025870}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: \nתוכן: מהיוצרים של לוגיקה, אלגוריתמים וחישוביות - מגיעה האחות החורגת המכוערת של הקורסים האלו שנקראת \"מבוא לאימות תוכנה\". קורס שמשלב מספר נושאים שאולי חשובים בתעשייה אבל מי שלא מתחבר לתחום של לוגיקה, ימצא את עצמו משתעמם למוות. מי שכן מתחבר, יופתע לראות איך דברים שנלמדים בלוגיקה וקצת בחישוביות - באים לידי ביטוי בעולם האמיתי ובעלי יישום פרקטי.\nיקיר: פרסם הקלטות באורך של 40-60 דקות צפייה ועשה כיתה הפוכה.\nמניסיון של כמה פעמים, הכיתה ההפוכה הרגישה לא חיונית וקצת מיותרת. אם רוצים להבין לעומק את החומר (ולא הכי אפשר מ50 דק של הקלטה) מומלץ לעבור על המצגת שוב לבד וללכת לתרגול.\n\nשם המתרגל/ת: עומר/רועי/אוהד במוקלט\nחוות דעת - תרגולים: הלכתי למספר מתרגלים מאילוצי לוז.\nעומר - מתרגל מדהים, מסודר ואחראי. אפילו כשבדק מבחנים הביא הערות מפורטות כדי לוודא שהסטודנט הבין את מהות הבדיקה שלו. מסביר בצורה מצוינת ואין שאלה שהוא לא יודע לענות עליה.\nרועי - ההפך הגמור מעומר. מבולגן ולא ברור. אחת הסיבות שעברתי למוקלט של אוהד הייתה שההסברים שלו היו לא טובים בכלל. \n\nשעורי הבית: 6 תרגילי בית שהם 10% תקף עם שאלות שלקוחות ממבחנים עבר ברובן. עוזרות מאוד לתרגל את החומר ולהבין את ההגדרות היטב. אפשר לחלק עבודה עם השותף ואז כל אחד מחזק לעצמו את ההגדרות ויוצאת למידה מאוד אפקטיבית מזה. סה\"כ עוזרים להבנת החומר.\n\nהמבחן: תבניתי מאוד. מתרגול של מבחני עבר אפשר לראות חזרתיות מאוד גדולה בנושאי השאלות ולכן אפילו לא צריך מספר ימים רב של תרגול כדי להצליח בו. המבחן שלנו באופן ספציפי היה אפילו קל מהמועדים של יקיר (שהיו יותר קשוחים) אבל אוזן עם בדיקה קצת נוקשה.\nסה\"כ אפשר לקבל ציון טוב מאוד אם ממש מקפידים לרשום כל מילה במקום שלה (וזאת למרות שהם אומרים לנמק ולא להוכיח).\nהשורה התחתונה: קורס סביר למי שאהב לוגיקה ורוצה לראות את הישומים שלה בעולם האמיתי. המבחן ממש סבבה ולא בא להתקיל יותר מדי וסה\"כ נעשית עבודה מהסגל כדי לוודא שהחומר חלחל היטב. ניכר שהסגל מאוד רוצה שתתבצע למידה איכותית מהקורס.", "timestamp": 1677932174622}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: יקיר ויזל \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: מעולים, עומר מצוין\n\nשעורי הבית: קיימת חובת הגשה ושיעורי הבית הם מגן, לא היה הכי פשוט אבל הם כן עוזרים להבנה\n\nהמבחן: הממוצע נמוך מאוד ביחס לקורס מתקדם ולמרות שרוב הרשומים לקורס הם עם איזושהי זיקה לאימות פורמלי, ממש לא מומלץ למי שהממוצע חשוב לו.  \n\nהשורה התחתונה: היה לי מעניין אבל בדיעבד לא הייתי לוקח את הקורס", "timestamp": 1679308385464}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: משעמות אבל קצרות .\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יפים\n\nשעורי הבית: ממש חשובים כדי להצליח במבחן לדעתי .\n\nהמבחן: הוגן ולמי שלמד טוב מצליח בגדולללל .\n\nהשורה התחתונה: החומר ממש מעניין  , בזכות הקורס עברתי ראיון עבודה בתחום וכרגע עובדת כסטודנטית והתחום ממש ממש מעניין , הקורס מאוד קשור לתעשייה ומעניין ומומלץץץץץ.", "timestamp": 1690444370979}, {"author": "l", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יקיר \nחוות דעת - הרצאות: מעניין מאוד והגישה של כיתה הפוכה מאוד עוזרת ללמוד, הוא מחלק את ההרצאות (כל הרצאה מוקלטת היא שעה סה\"כ) לסרטונים של 20 דק' כך שקל יותר לא לצאת מריכוז. מאווד עוזר ללכת לכיתה ההפוכה, ככה חוזרים על החומר ומתרגלים דברים תאורטיים שנלמדו בהקלטה, הרבה פעמים גם התנסינו בכיתה באימוד פורמלי בתכנות שזה ממש מעניין (שפת דאפני, שימוש בפלויד, cbmc..)\n\nשם המתרגל/ת: עומר רפפורט\nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי בתואר!!!!!!!!! אין מתרגלים כאלה. בקיא בחומר ברמות ורואים שהוא ממש אוהב את הנושא של אימות תוכנה מה שגורם גם לנו להתלהב מהנושא, מוכן להשקיע מזמנו כדי לענות על שאלות (אפילו לא במסגרת שעת קבלה), כריזמטי, מסביר מאווווודדד טוב ואכפת לו. \n\nשעורי הבית: 4 גליונות יבשים ואחד רטוב צריך להגיש 4 מתוך 5, כל גליון יבש לוקח יום-3 ימים תלוי ברמה שלכם בחומר ובשותף, הרטוב לא קשה. התרגילים טובים ומאוד מקיפים את כל החומר וכדאי לפתור כדי להגיע למבחן מוכנים.\n\nהמבחן: עדיין לא עשיתי אבל ממה ששמעתי הוגן..\n\nהשורה התחתונה: קורס לא עמוס, מאוד מאוד מעניין למי שאוהב את התחום ויש בו הרבה מושגים מלוגיקה. אחלה קורס בחירה ממליצה מאוד", "timestamp": 1713388447100}, {"author": "קריפקה", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: ההרצאות היו בפורמט של כיתה הפוכה. היה בסדר, אבל בחצי השני נראה שלמדנו בעיקר מדוגמאות, במקום דרך הגדרות ומשפטים, וזה הרגיש די מפוזר.\nבהרצאה הפרונטלית עצמה היה נחמד, ויצא לנו להתנסות עם שפות לאימות תוכנה.\n\nשם המתרגל/ת: עומר רפופורט\nחוות דעת - תרגולים: מתרגל מצויין, מאוד שולט בחומר ומגיע מוכן לתרגול.\n\nשעורי הבית: 5 גיליונות, מתוכם לוקחים את ה-4 הכי טובים. רוב השאלות נלקחות ממבחני עבר, אז זה תרגול טוב.\n\nהמבחן: היה הוגן בהשוואה למבחני עבר.\n\nהשורה התחתונה: קורס לא קשה בכלל, אבל מומלץ רק למי שהתחבר ללוגיקה.", "timestamp": 1715430427501}, {"author": "MohammadZ", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יקיר ויזל\nשם המתרגל/ת: עומר רפופורט\nמחזיק את *כל* מה שנאמר בחוות דעת האחרונה(בשם קריפרה). \nומוסיף:\n-הקורס מועבר רק בחורף\n-הקורס מחולק לתתי מקצועות שהן לא קשורות אחת לשניה באופן ישיר, כלומר אפשר לתרגל כל מקצוע בנפרד.\n1- שלושת השבועות הראשונות Floywd\n2-שבועות 4-5 בסיס לבאות.\n3- שבועות 6-8\n4- שבועות 9-10\n5- 11 -12\n\nשעורי הבית: \"5 גיליונות, מתוכם לוקחים את ה-4 הכי טובים. רוב השאלות נלקחות ממבחני עבר, אז זה תרגול טוב.\"\n מוסיף: הן גם עוזרות להבנת החומר וההגדרות. מומלץ מאוד לפתור את כולם.\n\n\nהמבחן: הוגן למי שהבין את החומר, בדיוק כמו בלוגיקה\n\nהשורה התחתונה:\" קורס לא קשה בכלל, אבל מומלץ רק למי שהתחבר ללוגיקה \"\n מוסיף: בגלל שהחשיבה בקורס כמו בלוגיקה+ סגנון הקורס, דהיינו איך שהוא מועבר, הסידור, המבחן, הקשר בין רמת המבחן וקורס ושיעורי הבית..", "timestamp": 1718109805850}, {"author": "ferberonix", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יקיר ויזל\nחוות דעת - הרצאות: הלכתי לחלקן. היה נחמד מאוד. לא מצאתי שהן מוסיפות הרבה אבל יקיר מציין בהן פרטים חשובים שלא הוזכרו בהרצאות המוקלטות כגון דיון על יעילות של פעולות BDDs שונות.\n\nשם המתרגל/ת: עומר\nחוות דעת - תרגולים: הכל כבר נאמר על עומר, מתרגל משכמו ומעלה.\n\nשעורי הבית: הוגנים ומלמדים. תעשו אותם !\n\nהמבחן: מועד א' שלנו היה הוגן יחסית- כיסחו בבדיקה על יעילות של פעולות BDDs ואף הורידו נקודות על פעולות שלא פוגעות בנכונות נטו כי הן מיותרות. ראו הוזהרתם !\n\nהשורה התחתונה: בתור אחד שלוגיקה הקורס השני הכי אהוב עליו בפקולטה ואלגוריתמים השלישי חשבתי שזה יהיה הקורס מהנה במיוחד עבורי. אדרבה. מצאתי את הקורס כמשעמם ולא מועיל עבורי ולא התחברתי כמעט לשום נושא בו חוץ מה- BDDs. לא ממליץ בכלל למי שמעוניין לקחת את הקורס כבחירה. הקשר לפורמליות וליופי שבלוגיקה בקורס הזה הוא דל ביותר.", "timestamp": 1718197700647}]}