{"posts": [{"author": "SR", "difficultyRank": 4, "generalRank": 2, "semester": "201902", "text": "קורס חופר ומציק. מרגיש שמתעסקים יותר מדי בהתקטננויות מיותרות שלא תורמות בכלום, וחבל, כי כן מלמדים לדעתי נושאים חשובים. \nיש 6 תרגילי בית שמכילים חלקים רטובים ויבשים. החלקים היבשים מציקים ודורשים לגגל הרבה, והחלקים הרטובים בחלקם סבבה ובחלקם לא פשוטים.\nהמבחן דורש לשנן מלא חומר בעל פה.", "timestamp": 1596485827000}, {"author": "עאטף", "difficultyRank": 3, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: היה כיףףףףףףףףףףףףףף\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: שירים יד מי שלא נהנה מהמבחן\n\nהשורה התחתונה: בזכות ההרצאות גיליתי מהו הסרט האהוב עליי: גרון עמוק!", "timestamp": 1614020411604}, {"author": "חסוי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: לורנץ\nחוות דעת - הרצאות: קצת איטי אבל ממש מסביר את החומר ועובר על הכל, אכפת לו שנבין ומסביר מה שצריך\n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: ברברן, בקורונה בהקלטות הוא מושלם , ממש מעולה אבל בפרונטלי לא מפסיק להתבדח וכבר נהיה ממש לא מקצועי. גם זורק ירידות עוקצניות לסטודנטים ספציפית וזה ממש לא סבבה, ילד שעף על עצמו כי קיבל להיות מתרגל אחראי.\n\nשעורי הבית: לא מבינה למה לא לשים שאלות ממבחנים ושאלות רלוונטיות ביבש שיכינו אותנו במקום כמה תרגילים שלא עוזרים בכלום\n\nהמבחן: גיא לא הפסיק להגיד על המבחן שהוא כתב אז אני מאמינה שהוא כתב את רובו, בכל מיקרה הוא ממש מקשה ועושה שאלות של התכנות מוגזמות לחומר הנלמד (וארוכות).\n\nהשורה התחתונה:", "timestamp": 1626879773093}, {"author": "Br", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: לורנץ\nחוות דעת - הרקצת איטי אבל מסביר את החומר בצורה טובה וברורה\n\nשם המתרגל/ת:גאי\nחוות דעת - תרגולים: בקרונה הוא היה ממש נחמד והסביר את הכל בצורה מעולה.. בפרונטאלי הוא נהפך לפחות ועף על עצמו.. זורק מלא עקיצות לא נחמדים.\n\nשעורי הבית: קיים 6 שעורי בית שדורשים השקעה ומלא מאגרי חיפוש... קורס עמוס.\n\nהמבחן: המבחן ממש לא הוגן ולא משקף את החומר שנלמד בקורס.. מתעסקים בדקיות קטנות שלא נלמדו בקורס. רמת שאלות התכנות במבחן לא משקפת מה שנלמד בתירגלים…\nהשורה התחתונה: קורס לא ממולץ עמוס ומציק.", "timestamp": 1627105661103}, {"author": "מבין עניין", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוד לורנץ\nחוות דעת - הרצאות: \nמרצה חביב. המצגות בקורס מאוד מסורבלות ובאמת קשה לחזור לעניינים אם מפסיקים לעקוב אפילו לרגע (יש מושגים שאין להם הגדרה מפורשת במצגות ולכן חובה להקשיב ללורנץ)\n\nשם המתרגל/ת: גיא שפירא\nחוות דעת - תרגולים: \nמתרגל שהוא אח, תמיד מוודא שכולם הבינו את התרגול גם אם לא מבקשים ממנו לחזור על משהו. לא יודע על איזה עקיצות פתיתי השלג שלפני מדברים, כי גיא אחד המתרגלים הכי פתוחים לביקורת, והוא יורד רק על עצמו אז אולי זה מה שהפריע להם (?).\n\nשעורי הבית: \nיש 6 תרגילי בית, כל אחד עם חלק יבש (3-4 שאלות שהן חיפוש מוגזם בגוגל) וחלק רטוב בSML (רטוב 6 הוא בProlog). אפשר לעשות כל תרגיל בית בערך ב4 ימים לבד, והדבר היחיד שבאמת מעניין בש\"ב זה המפרש שבונים לשפה Lisp בעזרת SML.\n\nהמבחן: \nלא קל, מבוסס על כל החומר התיאורטי, וגם דורש שליטה טובה בSML וProlog. הדרך הכי טובה ללמוד למבחן זה פשוט לעבור על מבחני עבר של לורנץ ולראות על איזה מושגים שואלים ואז לעבור על הש\"ב בשביל להיזכר בSML וProlog.\n\nהשורה התחתונה: \nלקחתי את הקורס רק בשביל OOP אבל האמת שהקורס מעניין, מלמד המון מושגים כללים של שפות תכנות (סוגי שיערוך, סיווג מערכות טיפוסים וכו') ומניסיון אישי אפשר אחרכך ללמוד שפת תכנות חדשה די בקלות מתוך התיעוד שלה.", "timestamp": 1627472304433}, {"author": "Omer Gino", "difficultyRank": 5, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: גיא\nחוות דעת - תרגולים: מעולה\n\nשעורי הבית: עמוס\n\nהמבחן: קשה \n\nהשורה התחתונה: קורס מעניין ועמוס", "timestamp": 1627804062326}, {"author": "Amit", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דוד לורנץ\nחוות דעת - הרצאות: מעייפות  אבל עם חומר חשוב ומעניין .\n\nשם המתרגל/ת: גיא שפירא\nחוות דעת - תרגולים: מסביר טוב אבל מאוד ילדותי ולא מקצועי , לא מתאים להיות מתרגל אחראי שאמור לעזור ולתמוך בסטודנטים מעבר להעביר את החומר.\n\nשעורי הבית: הרטוב נחמד מאוד חוץ מהשפה החדשה שצריך לתכנת שרק בסוף הקורס נותנים מספיק ידע עליה. היבש מיותר, למה לא לשים שאלות ממבחנים ביבש ???\n\nהמבחן: קשה וחבל . במקום לתת פקטור גדול אפשר לעשות מבחן פייר\n\nהשורה התחתונה: לא מומלץ", "timestamp": 1628520119061}, {"author": "Elad Kay", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דוד לורנץ\nחוות דעת - הרצאות: בסדר, הוא יודע את החומר אבל גם כשיש טעויות בשקפים הוא לא מוכן בשום פנים ואופן להודות בזה, הוא ישנה את מה שנכון רק כדי לא להודות בזה שהוא טעה. זה קצת מעצבן. וההרצאות לא סופר 100% ענייניות והיה מלא מהחוברת שקפים לקריאה עצמית. אי אפשר לוותר לא על ההרצאות ולא על התרגולים.\n\nשם המתרגל/ת: גיא שפירא \nחוות דעת - תרגולים: המתרגל הכי טוב שהיה לי עד עכשיו בתואר. לא יודע על מה אלה בחוות דעת לפניי מדברים, הוא צחק רק על עצמו. אווירה מצוינת, יודע את החומר ויודע ללמד ויודע מה יהיה במבחן. \nמומלץ בחום!!!\n\nשעורי הבית: לא קשים. 6 תרגילים. \n\nהמבחן: לא פשוט אבל פתיר\n\nהשורה התחתונה: אני אישית ממש ממש אהבתי, אבל אני לא בטוח שאני מייצג את רוב הקורס בדעה הזאת. אם אתם לא אוהבים לזכור בעל פה מושגים כנראה זה לא בשבילכם, למרות שזה בוודאי לא כל הקורס.", "timestamp": 1628960261039}, {"author": "צפרדע אנונימית", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: \nאין דרך קלה לומר את זה, יוסי גיל הוא אחד המרצים הכי מזעזעים שפגשתי. לכן, אם זה קורס בחירה בשבילכם ויוסי גיל מעביר אותו, אני מפציר בכם- להתרחק! מדובר במרצה מיושן, שמעביר שיעורים על שפות ישנות שאף אחד לא שמע עליהן ואף אחד לא משתמש בהן. לא רק זה, אלא מדובר בשפות לא פשוטות מורכבות, והוא את החומר שלהן לא יודע להעביר. ההרצאות מתנהלות בצורה מפוזרת, בעייתית. אין מצגת ברורה, לפעמים הוא סתם זורק דברים שעולים לו בראש ואין אחד מהיושבים בקרב הצופים בו שמסוגל להבין מה הוא מנסה להעביר. \nכדי להמחיש את המצב הבעייתי של ההרצאות, אקח לדוגמה שלושה אנשים: הראשון, מעולם לא הגיע להרצאות, השני התמיד והגיע לכל הרצאה שיוסי עשה (כולל הרצאות ההשלמה, זה פרק נפרד בפני עצמו), השלישי הגיע לסירוגין- שבוע כן ושבוע לא. לשלושת האנשים הללו, רמת הבקיאות בחומר המועבר בהרצאות היא זהה. זה ממחיש כמה ההרצאות מועברות בצורה מזלזלת, ביזיונית, לא מסודרת וזה חמור. \nהדבר היחיד שהיה מציל את הקורס היו מדי פעם הרצאות השלמה שערך סגל המתרגלים והצליח לצייר תמונה ברורה יותר של החומר, ושלא תבינו לא נכון - לא הייתה להם ברירה כי יוסי גיל לא הגיע לחלק לא קטן של ההרצאות שבוטלו.\nלמעשה, עוד לא הבנתי איך הטכניון מאפשר למרצה שמקבל ציון כה נמוך בקורס הזה, להמשיך ולהעביר אותו סמסטר אחרי סמסטר.\nניקח ונוסיף את הרצון הבלתי פוסק של יוסי להיות מעורב בתרגילי הבית, להוסיף שאלות שאינן ברמה, או סתם להקשות על סטודנטים (כי הרי ברור זה המטרה של הקורס), קיבלתם מרצה מיוחד ואם הגעתם לפה - אני מפציר בכם, אל תקחו את הקורס הזה איתו!\nשם המתרגל/ת: איתמר יוביליר\nחוות דעת - תרגולים: נקודת האור היחידה בקורס הזה היא איתמר, מתרגל מצוין, יסודי, ברור וחכם. יודע לשים דגש על הנקודות הכי חשובות בחומר, מוודא שכולם הבינו אותו ומתעקש לרדת לשורש העניין. אפילו העביר הרצאת השלמה בהיעדרו של יוסי, וזו הייתה הפעם הראשונה שאשכרה נהניתי מהקורס הזה. הוא נותן זווית חדשה, אחרת ומיוחדת לקורס שגורמת למתן את האיבה שצברת כלפיו אחרי שהמרצה האחראי (והיחיד) עשה כל שביכולותו כדי להרוס אותו. \n\nשעורי הבית: אני לא מאמין שמישהו יגיע לכאן בשלב של הביקורת הזאת אבל למען הסר ספק - שיעורי הבית מזעזעים לא פחות מההרצאות, מקווה שזה יהיה מספיק משכנע כדי *לא* לקחת את הקורס. \nשיעורי הבית מורכבים מחלקים \"יבשים\" וחלקים רטובים. אם תבחינו היטב, המילה \"יבשים\" סומנה במירכאות כי למרות השם של זה, הקוד \"היבש\" שתכתבו צריך להתקמפל, מה שהופך את התרגיל לתרגיל רטוב לכל דבר. תרגילי הבית מוגזמים, כיאה לקורס ולאופן שהמרצה האחראי דורש רמה בלתי הגיונית ובלתי סבירה אבל בשיתוף פעולה עם אנשים רבים הם אפשריים. \nלמרות כל זאת, אני חייב לומר בהסתייגות שסגל הקורס ניסה לעשות מאמצים כדי להוריד את הרמה קצת באמצעות הוספת שאלות בונוס, הסרת שאלות, הפיכת חלק משאלות התרגיל לשאלות רשות. אבל אם תשימו לב, הדבר נעשה לאחר וויכוחים ומריבות של נציג הסמסטר אל מול הסגל.\n\nהשורה התחתונה:\nפירטתי פה רבות בנוגע לחסרונות הגדולים של הקורס הזה, בין אם אלו השפות המיושנות וחומר הלימוד, בין אם זה שיטת ההוראה, בין אם זה המרצה האחראי או תרגילי הבית. אבל חשוב לזכור שיש יתרונות לקורס הזה- מכין אותך להרבה למידה עצמית, מלמד אותך לשתף פעולה עם הרבה אנשים ובסופו של דבר כן מפתח חשיבה תכנותית יחסית טובה - גם אם זה בא בחשבון על כמה שנים יפות מהחיים שלך ומחסור בשעות שינה. \nבאשר ליוסי גיל, כן קל לומר שהוא מרצה רע ומנסה להקשות כמה שיותר, אבל יאמר לזכותו שהוא מאוד ניסה - הוא משתדל להיענות לבקשות הסטודנטים, מפרסם חומרי לימוד, כן מוריד שאלות מתרגילי הבית ומתייעץ רבות עם נציג הסמסטר בנוגע למהלכים הבאים שלו והלוואי שמרצים נוספים היו מתייחסים לעבודה החינוכית שלהם כך ברצינות. זה אומנם לא מחפה על איכות הקורס אך זו נקודה חיובית למחשבה על הקורס.", "timestamp": 1641386953890}, {"author": "Gur Telem", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: \nמאוד תיאורטיות וקצת תחושה של נפנוף ידיים. דורש הרבה חשיבה ויכולת יצירתית. לא מזכיר קורס במדמח ובטח שלא מה שהייתי מדמיין משם הקורס.\n\nשם המתרגל/ת: מקסים \nחוות דעת - תרגולים: \nמתרגל מקסים (pun intended). אדם נחמד מאוד ומסביר מעולה את החומר. עזר לי להבין חלק נכבד מהבלאגן שהיה בהרצאות.\n\nשעורי הבית: \nהיבשים מאוד מציקים.\nהרטובים מרגישים חסרי פואנטה ולא מרגיש שתורם skill פרקטי.\nהמבחן: \nלא כיף בכלל.\n\nהשורה התחתונה: \nקורס לא מומלץ. חומר משעמם. הסיבה היחידה לקחת אותו זה אם את/ה עתודעי/ת (או עושה הנסדת תוכנה משום מה) ו/או אתה רוצה מאוד לקחת את OOP ואז אתה חייב את זה כקדם.", "timestamp": 1642351719123}, {"author": "sahar milg", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: חבל שהאו המרצה, החומר בקורס מעניין אבל הוא לא מעביר שום חומר בהרצאות, סתם מדבר על שטויות כל ההרצאה, מה שהוא כן מעביר לא מובן בכלל, לא מתחשב בסטודנטים ולא מתנהג בכבוד לשאר סגל הקורס\n\nשם המתרגל/ת: יאיר טוויטו\nחוות דעת - תרגולים: ממש טוב, מסביר את החומר ומשקיע בתרגולים, שווה להגיע אליו.\n\nשעורי הבית: זוועה, קשים, ארוכים ולא מובנים הרבה מעבר למה שבאמת צריך.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644582427336}, {"author": "עתודאי", "difficultyRank": 4, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל הגדול\nחוות דעת - הרצאות: \nהמרצה הכי מעניין שהיה לי בתואר, הכי גבר בטכניון ובכללי בארץ.\nאדם בעל השכלה רחבה מאוד במגוון רב של שפות ורעיונות בתכנות ובתכנה.\nהוא גם בעל חוש הומור מאוד מפותח ושופע תרבות ושירה.\nכל הרצאה שלו מרתקת מאוד והוא מעביר אותה ברגישות כלפי הסטודנטים ובשום שכל. זאת חוויה שלא תהיה לכם באף קורס.\nחשוב לציין שיוסי גם מקשיב לסטודנטים ושומע רעיונות.\nאני וחבריי מתכוונים לקחת קורסים נוספים עם יוסי ככל שיתאפשר לנו.\n\nשעורי הבית: \nהיו תרגילים קשים אך מלמדים וניתנו הרבה בונוסים.\n\nהמבחן: \nעוד לא היה.\nנראה שהמבחנים שנים קודמות קשים.\nאני מקווה מאוד שלא יקשו עלינו יותר מדי כמו בתרגילי בית.\n\nהשורה התחתונה:\nהקורס הכי טוב שתיקחו!!!!\nבמיוחד בגלל המרצה שהוא 100/100  :-)", "timestamp": 1644852132389}, {"author": "א'", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: \nמרצה נדיר, שכל הרצאה שלו היא כמו מופע סטנדאפ ולומדים נושאים מאוד חשובים ורלוונטיים לחיים. רק שיהיה בריא וימשיך ללמד עוד שנים רבות!\n\nשם המתרגל/ת: יאיר \nחוות דעת - תרגולים:\nאחלה מתרגל. \n\nשעורי הבית: \nלא קלים, רובם גם ארוכים. היה תרגיל של 240 נק'.\n\nהמבחן: \nSoon To Be\n\nהשורה התחתונה:\nלקחתי כי רציתי oop אבל מודה שנהנתי מכל רגע וההרצאות היו הכי מוצלחות שראיתי בתואר. קורס חובה לכל מי שרוצה לעסוק בפיתוח.", "timestamp": 1644852438431}, {"author": "סאר", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: \nההרצאות מאוד מעניינות וחשובות לתואר של מדעי המחשב.\nלצערינו הסמסטר היה טיפה בלאגן בגלל שהרצאות התבטלו, אבל סך היה שווה את זה.\nשם המתרגל/ת: איתמר יובילר\nחוות דעת - תרגולים: \nהתרגולים היה ממש טובים ועזרו להבנה של החומר. חשוב ללכת לתרגולים כי החומר שמועבר שם הוא חומר חדש ולא חופף את זה של ההרצאה.\nשעורי הבית: \nטיפה ארוכים אבל לא יותר מדי ביחס לנק\"ז.\nהמבחן: \nנקווה לטוב\nהשורה התחתונה: \nקורס מעניין ומאוד מומלץ, גם למי שלא מהנדסת תכנה", "timestamp": 1644866549726}, {"author": "פסגותניק לשעבר", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי (יוגי) גיל\nחוות דעת - הרצאות: במילה אחת: וואו, בשתי מילים: ההרצאות הכי טובות שהיו לי בתואר. ברצינות אני מרגיש שיצאתי מההרצאות עם כל כך הרבה מעבר לחומר הקורס!!!  \n\nשם המתרגל/ת:  איתמר יובילר\nחוות דעת - תרגולים: אם היו מבקשים ממני לבחור את האדם המועדף עלי בעולם - כנראה שהייתי בוחר ביוסי. בהינתן שבחירה ביוגי אינה חוקית הייתי בוחר באיתמר. באמת מתרגל מדהים! \n\nשעורי הבית: 6 גיליונות, כמעט ולא מרגישים את העומס והסגל כל כך מתחשב! ניתנו כל כך הרבה בונוסים שהממוצע שלי שואף ל 140.\n\nהמבחן: בקרוב! לפי מבחני עבר קל לראות שהמבחן יחסית פשוט ודורש הכנה קצרצרה.\n\nהשורה התחתונה: הקורס הכי טוב שלקחתי בתואר! קורס חובה לכל מהנדסת.", "timestamp": 1644870429527}, {"author": "אמא של נדב", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: יוסי BAD, מרצה מטריד ודוחה. \n\nשם המתרגל/ת: נדב פליקוביץ\nחוות דעת - תרגולים:  נדב GOOD, אחלה גבר.\n\nשעורי הבית: כיף\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: כן", "timestamp": 1644873917307}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל, האיש וההקלטה\nחוות דעת - הרצאות: \nהמרצה הכי טוב בעולם ואולי אפילו ביקום הנראה לעין\n700 מטר איבר מין זכרי\nנותן בונוסים מפנקים\nמי שלא הולך להרצאות שלו פשוט ליצן...\n\nשם המתרגל/ת: איתמר\nחוות דעת - תרגולים: \nנחמד מאוד\n\nשעורי הבית: \nארוכים ומזוויעים\n\nהמבחן: \nהלוואי יהיה מבחן קל\n\nהשורה התחתונה: \nמצד אחד קורס מלא בעתודאים מעצבנים\nמצד שני יוסי גיל זה חוויה שאסור לפספס", "timestamp": 1644877370367}, {"author": "לארה", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל\nחוות דעת - הרצאות: המרצה מפגין ידע חסר תקדים בכל הנוגע למה שהוא מלמד, הוא משקיע מאמצים רבים על מנת לשפר את הקורס לטובת הסטודנטים.\nההרצאות אומנם מסובכות אך אף פעם לא חסר קצת הפוגה מצחיקה מהחומר הקשה והמעניין, בסך הכל הרצאות טובות ואני מרגיש מוכן למבחן בלי ללמוד.\n\nשם המתרגל/ת: יאיר טויטו\nחוות דעת - תרגולים: מתרגל מצוין, עונה על כל שאלה ואם הוא לא יודע הוא יחזור עם תשובה.\nתמיד לטובת הסטודנטים ומסביר מצוין, יש לו גם מצגות ממש מגניבות עם אפקטים מגניבים של רשימת דילוגים.\nהוא גם אוהב לכתוב קומפיילרים לשפות שונות ולהקליד מהר.\n\nשעורי הבית: מעניינים, מרתקים, כל תרגיל בית היה חדשני לרמה שלא היה ניתן למצוא תשובות באינטרנט או אפילו עזרה. סה\"כ 4 שעות לגליון, 6 גליונות.\n\nהמבחן: עוד לא היה, אבל אני סומך על צוות הקורס בראשות יוסי גיל שיעשה מבחן הוגן כפי שהבטיח\n\nהשורה התחתונה: ממליץ, במיוחד כהקדמה לאו\"פ.", "timestamp": 1644922901521}, {"author": "רהס", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוגי גיל\nחוות דעת - הרצאות: \nהרצאות מדהימות עם המרצה הכי טוב שיש בפקולטה. כל ההרצאות בנויות בצורה מאוד מסודרת ומעניינת. \nשם המתרגל/ת: יוסי גיל\nחוות דעת - תרגולים: \nאמנם היו כמה תרגולים בהם המתרגלים החוצפנים ניסו באמת להעביר את החומר של הקורס, אך באומץ לב ייחודי ובהקרבה יוצאת דופן, אדונינו ומושיענו יוסי גיל הצילנו מידם, והעביר את התרגולים בעצמו, למורת רוחם של המתרגלים.\nשעורי הבית: \nהביקורת היחידה על השיעורי בית זה שהיה חסר הטאץ' הייחודי של יוסי גיל, הטאץ' הייחודי שחוצה עולמות ומגיע עד לחדשות.\nהמבחן: \nהמבחן האמיתי זה איך נשרוד בעוד קורסים אחרי שהיה לנו מרצה מדהים כזה.\nהשורה התחתונה: \nקיבלתי חצי נקודת בונוס על הביקורת הזו אז אין לי על מה להתלונן.", "timestamp": 1644938392877}, {"author": "MACRO LISP", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוגי\nחוות דעת - הרצאות: \nההרצאות מעולות והחומר מעניין וחשוב לתואר. החלק הכי טוב בהרצאות זה שהוא דואג להשלים את החומר שמפספסים ולכן בסופו של דבר מגיעים מוכנים ובצורה מאוד מסודרת למבחן.\nשם המתרגל/ת: תרגולים מיותרים, עיקר החומר מועבר בהרצאות.\nשעורי הבית: \nשיעורים קלילים ולא עמוסים, יש אפשרות לקבל עד 240 נקודות בתרגיל מה שמעלה את הממוצע, שווה את ה3 נק\"ז.\nהשורה התחתונה: קורס מעניין, עם בונוסים ועם מבחן ממוחזר אז מאוד מומלץ.", "timestamp": 1644938854478}, {"author": "MEGA MACRO LISP", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "אל תאמינו לביקורות שכתובות כאן!\nהקורס לא באמת קורס טוב!\n.\n.\n.\nהקורס מדהים! ויש בו את המרצה מספר 1 בארץ ואם לא מספר 1 בארץ אז מספר 1 בחול!\n\nיש בקורס חומר מעניין, בונוסים על הגעה לתרגילים, בונוסים על תרגילים והמבחן ממוחזר.\n\nסך הכל קורס מאוד מומלץ!", "timestamp": 1644939045967}, {"author": "מעריצה", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסף גיל\nחוות דעת - הרצאות: \nפשוט מלךךך\nנותן להביא דף נוסחאות לבחינה\nמחלק בונוסים על כל מיני דברים ;)\nאוהבתותך יוסיייי\nבבקשה תעשה שיהיה קל במבחן", "timestamp": 1644941200020}, {"author": "חובב ספורט אתגרי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוסי גיל\n\nהקורס הזה הוא הקורס הכי מדהים שהיה לי בתואר!\nבתור חובב ספורט אתגרי יצא לי הרבה פעמים להשתעמם בקורסים שמנסים באמת להעביר חומר ולהכין אותנו לשוק העבודה, אך בהרצאות של שפות אין שנייה בלי אקשן.\nאני לא יודע אפילו איפה להתחיל,\nהאם בכך שחזינו בהתאסלמות בשידור חיי,\nשיצא לנו ללמוד על ציור אובססיבי של משולשים,\nשיצא לנו לדון בשמות של הסטודנטים, \nאו בכך שביום לפני המבחן משנים את ההנחיות כל חמש דקות!\n\nקורס מלא אקשן ואדרנלין, מומלץ בחום!", "timestamp": 1644956270728}, {"author": "Richard Stallman", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "I'd just like to interject for a moment.  What you're referring to as Safot,\nis in fact, Safot/Yogi, or as I've recently taken to calling it, Safot plus Yogi.\nSafot is not an course unto itself, but rather another free component\nof a fully functioning Yogi system made useful by the Yogi corelibs, shell\nutilities and vital system components comprising a full course as defined by Yogi.\n\nMany students study a modified version of the Safot course every day,\nwithout realizing it.  Through a peculiar turn of events, the version of Safot\nwhich is widely studied today is often called \"Yogi Safot\", and many of its students are\nnot aware that it is basically the Yogi course, developed by the Yogi.\n\nThere really is a Safot, and these people are studying it, but it is just a\npart of the course they study.  Safot is the material: the material in the course\nthat you get tested on in the exam.\nThe material is an essential part of a course, but useless by itself;\nit can only function in the context of a complete course.  Safot is\nnormally used in combination with the Yogi trolls in the lecture: the whole course\nis basically Safot with Yogi added, or Safot/Yogi”.  All the so-called \"Safot\"\ncourses are really copies of Safot/Yogi.", "timestamp": 1644957112725}, {"author": "בצלאל אלוני", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "הוא היושב לו אי שם במרומים\nהוא המבטל את התרגולים\nהוא הנותן רוב שמחה לילדים\nהוא המחליף מתרגלים\nהוא בקומה 7 והוא היחיד\nהוא האחד עם הרצאות השלמה\nהוא השומר עלינו מצרה\n\nיוגי, שמור נא עלינו כמו ילדים\nשמור נא ואל תעזוב\nתן לנו אור ושמחת נעורים\nתן לנו פקטור עוד ועוד\nשמור נא עלינו כמו ילדים\nופקטור נדיב יעזור\nתן לנו שאלה בפייתון על גנרטור\nתן לנו גם עוד פקטור", "timestamp": 1644957289967}, {"author": "אבא", "difficultyRank": 5, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ug\nבבקשה בבקשה בבקשה תתן פקטור גדול ענק עצום\nפקטור שורש או חזקה", "timestamp": 1645028145898}, {"author": "לא פסגותניק", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי גיל, האיש וההקלטה\nחוות דעת - הרצאות: \nאין מילים, הוא הצליח להעביר יותר הרצאות השלמה בשבועיים משיש בסמסטר רגיל בקורס של 3 נקז.\nואיכשהו כולן היו על נושא אחד שאפילו לא הופיע בבחינה וגם מאוד לא רלוונטי לתעשייה.\nשם המתרגל/ת: יאיר טוויטו\nחוות דעת - תרגולים: \nסבבה סך הכל, לא מספיק בשביל לפתור את תרגילי הבית שהיו בשפות שאין עליהן מידע בstack overflow בהתחשב בקושי המחשבתי שלהם והסינטקסי תכנותי\nשעורי הבית: \nזוועתיים, היו 6 גיליונות שלקחו שעות רבות של מחשבה ושל דיבוג, לא פתירים בעליל, לא מובנים בעליל.\nהמבחן: \nרובו היה סביר, הייתה שאלה שלא למדנו שום דבר בסגנון, שאלה בניסוח עברי ארכאי ושאלה באנגלית ארכאית ושאלה בלטינית שיש לציין שבאנגלית ארכאית ב3/5 סעיפים לא נגענו בסמסטר וב2/5 היה נגיעות קלות אך בגלל האנגלית והאופציות ההזויות גם לא היו טריוויאליות\nהשורה התחתונה: אתן לכם אלגוריתם לגבי הרשמה לקורס שפות:\nשלב 1: אם אתם לא בהנדסת תוכנה תברחו ממנו כמו מאש.\nשלב 2: אם לצערכם אתם בהנדסת תוכנה, תפרשו מהנדסת תוכנה ותסתכלו על שלב 1.", "timestamp": 1645128449223}, {"author": "רק תלונות", "difficultyRank": 5, "generalRank": 2, "semester": "202101", "text": "שם המרצה:\nיוסי גיל\n\nחוות דעת - הרצאות: \nנדיב מאוד לקרוא להן הרצאות, מעט החומר שכן הועבר לא נמצא בשום מקום אחר, הכל באוויר, הכל מבולגן, אין עקביות או קשר. \n\nשם המתרגל/ת: \nיאיר טוויטו\n\nחוות דעת - תרגולים: \nאדם זהב, ראו שחשוב לו שכולם יבינו, הרגיש (לפחות לי) כמו האדם היחיד בסגל שניתן לסמוך עליו.\n\nשעורי הבית: \nהגשה בזוגות.\nבדיחה רעה מתמשכת.\nלא אהבתי.\n\nהמבחן: \nניסוחים מבלבלים, שאלות קשות, המרצה עלה לדבר בתחילת המבחן והזכיר את מועד ב. בקיצור - מופע אימים.\n\nהשורה התחתונה: \nאם לא חייבים - לא לוקחים.\nיכול להיות שהציון הסופי מתעתע ומפתה אבל רק לשים לב שנדרשת רמת השקעה של 6 נקז עם למידה של לפחות שבוע למבחן.\n\nארצה גם לציין שכל הקורס הרגיש כמו קייטנה של תכנית פסגות, אני בטוח שכיף להכיר יותר מחצי סגל ואת בודק התרגילים אישית, אך לשאר הקורס פשוט לא נעים מכל העסק,\nמרגיש מאוד לא מקצועי ולעיתים מפלה.\nאין לי שום דבר נגד אף אחד מהמתרגלים/הבודק/הסטודנטים בקורס, רק משתף את האווירה הכללית לפי תחושותי.", "timestamp": 1645379351285}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יוסי (יוגי) גיל\nחוות דעת - הרצאות: מה יש לומר על יוגי שעוד לא נאמר? איש גס רוח, ביריון מגודל שפורק את התסכול שלו על הסטודנטים ועל הסגל הכפוף לו. מעבר לזה מדובר באחד המרצים הגרועים והפחות קוהרנטיים שנתקלתי בהם בטכניון. ניכר שמשחקי אגו חשובים לו הרבה יותר מרמת ההוראה בקורס. זה מאוד חבל, כיוון שלפי הסילבוס וסיכומים מסמסטרים קודמים, נראה שהקורס עוסק בחומר מעניין מאוד.\n\nשם המתרגל/ת: איתמר יובילר\nחוות דעת - תרגולים: תותח. משקיען ברמות, ובגלל רמת ההשקעה הנמוכה של המרצה (היחיד) יצא שהוא ושאר המתרגלים לימדו את החומר מאפס. כל סטודנט שעבר את הקורס הצליח אך ורק בזכותם.\n\nשעורי הבית: עמוסים. יש שישה תרגילים תקפים, חצי רטובים חצי יבשים, כאשר הקושי העיקרי הוא לימוד עצמי של החומר שלא הופיע בתרגולים ואמור היה להופיע בהרצאות. בסמסטר שלנו לפחות תרגילי הבית הגיעו ליותר מ-100 נקודות מה שהקל בקצת, בכך שאפשר למי שרצה להגיש חלק ועדיין לקבל ציון טוב.\n\nהמבחן: הרבה שאלות במועד א מוחזרו משנים קודמות, לעיתים מילה במילה, אז מי שעשה מספיק מבחנים לפני כן יכל להסתדר. היו כמה שאלות שעסקו בחומר שבכלל לא נלמד בסמסטר, אני מניח שגם הן מוחזרו וליוסי פשוט לא היה אכפת.\n\nהשורה התחתונה: קורס שיכול להיות מצוין, אבל כל עוד יוסי גיל בתמונה עדיף להתרחק. יש מרצים גרועים, ואפשר להתמודד איתם, אבל יוסי הוא גם אדם רע - וזה מתערבב לא משהו עם עמדת הכוח שיש לו כמרצה אחראי ויחיד בקורס. מי שלא בהנדסת תוכנה שלא יגע בזה עם מקל, ומי שכן תנחומי.", "timestamp": 1645445325281}, {"author": "_", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: לורנץ\nחוות דעת - הרצאות: לא הייתי בהרצאות, לפני המבחן עברתי פשוט על הסיכום שנמצא בדרייב וזה הספיק\n\nשעורי הבית: הרטובים סבבה אבל היבשים היו לרוב חיפושים בגוגל ולא היו קשורים כל כך לחומר שהועבר בתרגולים\n\nהמבחן: צריך לשנן את סיכום ההרצאות ולחזור על התרגולים וזה יספיק. (לא משהו מפחיד במיוחד)\n\nהשורה התחתונה: החומר פחות מעניין ויבש, אם לא מעוניינים בקורס OOP אז אין טעם לבזבז קורס בחירה.", "timestamp": 1659809416482}, {"author": "Fake Elad K", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: לורנץ'\nחוות דעת - הרצאות:\nהיה נחמד. החומר הועבר בצורה לא משעממת ועם קישור להיסטוריה של זה והסברים אינטואיטיביים ללמה דברים התפתחו כפי שהם.\nממליץ. \n\nשם המתרגל/ת: אנדריי\nחוות דעת - תרגולים: מתרגל מדהים. מגיע עם חולצות עם איורי חתולים עליהם. עונה על כל השאלות, עוזר גם אחרי בתרגולים או בשעות קבלה. מאוד ממליץ.\n\nשעורי הבית: נחמדים, עוזרים לקלוט את החומר. יש כאלה כבדים יותר וכבדים פחות.\n\nהמבחן: היו חלקים שלא למדתי כי לא ציפיתי שיופיעו (לא הופיעו במבחני עבר) אבל סך הכל היה הוגן אני מאמין\n\nהשורה התחתונה: \nשמעתי דברים רעים על הקורס במתכונת אחרת.. במתכונת הזו מאוד נהנתי ממנו.", "timestamp": 1666694434460}, {"author": "כריס", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: לורנץ\nחוות דעת - הרצאות: סה\"כ בא עם כוונה טובה ותמיד דואג שהסטונדטים יצאו עם הבנה של החומר, אבל מעביר בצורה נורא מונוטונית ואיטית את החומר שגם ככה הוא לא שיא המעניין. מומלץ להגיע להרצאות אבל לא לקחת ללב אם לא מבינים יותר מדי, אפשר להעזר המון בסיכומים מעולים שיש בדרייב.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: כמו תמיד, המתרגל הכי מלך בפקולטה. מסביר מעולה ולעומק, פותר המון תרגילים טובים ברמת מבחן ותמיד ביחסים קרובים עם הסטודנטים, וצחוקים ואווירה טובה בתרגולים.  \n\nשעורי הבית: לא תופסים יותר מדי נפח בסמסטר, כן דורשים מעבר טוב על ההרצאות בשביל היבשים והבנה של הדוגמאות מהתרגולים בשביל הרטובים. שווה להשקיע בהם, ממש תורמים להבנה של החומר וקל להוציא מגן טוב. \n\nהמבחן: אם מגיעים מוכנים לשאלות sml ו - prolog, לדעתי יש 70 נקודות מובטחות כבר, אין שם יותר מדי הפתעות. עם מעבר טוב על ההרצאות/ הסיכום שלהם ושינון של החומר התאורטי לרוב גם שאר המבחן ילך טוב. בקיצור, מי שמגיע מוכן - לא יופתע וכנראה יוציא אחלה ציון. \n \nהשורה התחתונה: אמנם שמעתי דברים מאוד לא טובים על הקורס, אבל האמת שהסמסטר הסגל מדהים וממש הפך את הקורס לנסבל. סה\"כ אחלה קורס, פשוט לא להתרגש יותר מדי במהלך הסמסטר אם לא מצליחים לעקוב, לקראת המבחן עוברים טוב על סיכום ההרצאות והתרגולים, מגיעים מוכנים וציון טוב מובטח.", "timestamp": 1689758296479}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דוד לורנץ\nחוות דעת - הרצאות: \nלא אהבתי ללמוד אצלו. אין לו ממש כריזמה, ודי יחסית קשה להתרכז אצלו בשיעור.\nבנוסף,  החומר במצגות של ההרצאות, עם אנגלית ברמה מאוד גבוה, מה שהופך את זה ליותר קשה להשלים לבד.\nיש הרבה קריאה עצמית, של איזור ה 250 שקופיות, שזה חלק מהחומר של המבחן. אני לא יודע איך מרשים דבר כזה בכלל.\n\nשם המתרגל/ת: עדי חריף\nחוות דעת - תרגולים: \nלא אהבתי אותו כמתרגל בכלל. הוא מתבלבל המון פעמים בשיעורים, וגורם לבלבול אצל הסטונדטים. מרגיש שהוא לא חד על החומר בכלל.\n\nשעורי הבית: \nארוכים. לי לקח יחסית הרבה זמן לעשות את השיעורי הבית, והם לא קלים בכלל.\n6 תרגילים עם חלק יבש ורטוב בכל אחד.\n\nהמבחן: \nלא הוגן. ברגע שמכניסים למבחן שאלות על דברים שראינו באזור ה- 2 דקות בהרצאה בלחץ, על איזה שקופית , מתוך איזה 1000 שקופיות, זה הופך את המבחן ללא הוגן.\nלקורס בחירה, הממוצע יחסית מאודד נמוך\n\nהשורה התחתונה:\nלא ממליץ בכלל לקחת את הקורס. זה הקורס הכי גרוע שעשיתי בתחילת התואר.", "timestamp": 1690431141846}, {"author": "עד מתי טכניון", "difficultyRank": 5, "generalRank": 1, "semester": "202302", "text": "להתרחק! קורס שבנוי במצורה הזויה, כמות רחומר לא הגיונית ובעיקר משעממת שמועברת בצורה עוד יותר משעממת.\n6 תרגילי בית עמוסים יבש+רטוב בשפה מונפצת שיוציאו אותכם מדעתכם.\nבתרגולים לומדים עוד חומר ואין קשר להרצאות. ממש לא שווה 3 נקז.\nמי שלא חייב שיתרחק מהקורס הזה כמו מאש", "timestamp": 1721084733720}]}