{"posts": [{"author": "NOA", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות:\n\nשעורי הבית: ארוכים כמו הגלות\n\nהשורה התחתונה: הקורס הכי מעניין שהיה לי בתואר", "timestamp": 1599461953598}, {"author": "סטודנטית", "difficultyRank": 4, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אלי\nחוות דעת - הרצאות: ההרצאות מעניינות. יש בהן המון חומר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חוץ מתרגיל אחד רטוב התרגילים יבשים.\nהתרגילים יחסית עמוסים.\n\nהמבחן: בגלל כמות החומר מומלץ לעבור על החומר שבוע מראש לדעתי\n\nהשורה התחתונה:", "timestamp": 1601455094600}, {"author": "--", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: \nהמצגות של ההרצאות מעולות. אלי העביר את ההרצאות בצורה משעממת ומונוטונית. \nשם המתרגל/ת: עידן \nחוות דעת - תרגולים: \nמעולים. כל פעם מתמקדים בנושא אחר ולומדים אותו לעומק.\nשעורי הבית: \nביחידים. 5-6 גליונות עמוסים. אחד רטוב (בקטנה) והשאר יבשים. חשוב מאד לעשות את השיעורי בית במהלך הסמסטר.\nהמבחן: \nאם לומדים חזק כל הסמסטר + שבוע של פתירת מבחנים זה אמור להספיק\nהשורה התחתונה: \nאחד הקורסים המעניינים שלקחתי בתואר", "timestamp": 1602061982942}, {"author": "Foxy", "difficultyRank": 3, "generalRank": 5, "semester": "201901", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: הרצאות מעניינות לדעתי - עמיחי מתעסק בעקרונות שצריך לקחת מהחומר ופחות בדברים הטכניים שאפשר ללמוד לבד (וחולק הרבה מהניסיון האישי שלו).\n\nשם המתרגל/ת: ליעם קימל\nחוות דעת - תרגולים: תרגולים טובים. תמיד ליעם היה מזכיר בקצרה את החומר הרלוונטי מההרצאה בתחילת התרגול.\n\nשעורי הבית: לא מאוד קשים, אבל דורשים חשיבה. אלה שאלות ממבחנים, אז הם משקפים בדיוק את הרמה של המבחן.\n\nהמבחן: דורש לזכור המון פרטים קטנים וניואנסים, אבל מי שפתר את שיעורי הבית במהלך הסמסטר כמו שצריך אמור להסתדר. ממליץ להתמקד בעיקר במעבר על החומר בלמידה אליו, בגלל שאין פתרונות עבר ודי קשה למצוא סריקות.\n\nהשורה התחתונה: אחלה קורס. אולי פחות פרקטי מריוורס (236496), אבל מלמד את ה-basics שצריך בתחום הזה.", "timestamp": 1612374600741}, {"author": "never-secure", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: שולמן\nחוות דעת - הרצאות: שולמן מרצה טוב,\nבנוסף יש הרצאות מוקלטות מצויינות של אלי ביהם .\n\nשם המתרגל/ת: הדר סיון\nחוות דעת - תרגולים: תרגולים מעולים, חזרה על החומר עם שאלות\n\nשעורי הבית: עוזרים מאד להבין את החומר וברמה של המבחנים\n\nהמבחן: המבחנים מאתגרים אבל הוגנים.\nהשאלות בהם מנוסחות כמו חידות, ומשקפות הבנה אמיתית של החומר.\n\nהשורה התחתונה: קורס מאד מעניין ומומלץ", "timestamp": 1613124634458}, {"author": "I", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: \nהרצאות מעניינות אבל עוברות לאט, כדאי לראות בוידאו על x2\n\nשעורי הבית: \nשיעורי הבית קלים יחסית אם מבינים את החומר, לוקחים כ4-8 שעות.\nהמבחן: \nעקרונות ממוחזרים משנים קודמות אבל יש טוויסט בכל מבחן\nהשורה התחתונה: \nקורס מעניין מאוד, מומלץ למי שאוהב אבטחת מידע.", "timestamp": 1614529611149}, {"author": "א", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: חמוד ממש, משתדל לספר על מקרים אמיתיים ולתת קצת ערך מוסף לחומר שמדברים עליו. הוא רק מאוד איטי, מניחה שבפרונטלי זה יותר זורם. יש גם הקלטות מורחבות מראש של אלי ביהם שאפשר לראות בכיף במהירות 2.5-3 (אני לא מגזימה, בחיי) והן מעולות ממש.\n\nשם המתרגל/ת: הדר סיוון\nחוות דעת - תרגולים: הדר מעולה, חמודה ממש ומסבירה הכל טוב ובסבלנות.\n\nשעורי הבית: חופרים משהו אבל לא קשים בסופו של יום, אפשר לתפור ביום עבודה של כמה שעות. כל השאלות כמעט ממבחנים אז אין הפתעות ולא קשה להוציא בהם ציון טוב.\n\nהמבחן: טריקי, אבל ברמה הוגנת לדעתי. בטח בהתחשב בזה שזה היה סמסטר קורונה שני ובזה שהמבחן קוצר לשעתיים. יש הרבה דברים טכניים שחוזרים על עצמם וצריך גם להכיר את החומר בצורה טובה, אבל יש הרבה הגיון מאחורי רוב הדברים שנלמדים אז זה באמת לא אסון.\n\nהשורה התחתונה: \nאחד מקורסי הבחירה האהובים עליי בתואר בינתיים. חומר שהרבה ממנו אמנם תאורטי, אבל נוגע לדברים אמיתיים שקורים מחוץ לאקדמיה ונותן טעימה יפה מהרבה תתי תחומים שאפשר להמשיך אליהם. הקורס בנוי טוב ובצורה הגיונית, היה תענוג", "timestamp": 1616013196971}, {"author": "אוהד", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: גבי נקיבלי\nחוות דעת - הרצאות: מאוד מעניין ומרצה מצוין. יודע לגעת בנקודות החשובות ולדלג על הקטעים הטכניים מדי. קצת מבאס שהיו הרצאות עם מרצים מן החוץ - הם היו משמעותית פחות טובים מגבי. 3 הרצאות כאלו היו והן היו מיותרות מאוד ובסוף למדנו את החומר לבד.\n\nשם המתרגל/ת: עידן אלדר\nחוות דעת - תרגולים: מדהים! יודע את החומר טוב ויודע לענות על כל שאלה. עושה את זה גם בנחמדות ובאופן כללי רואים שהוא יודע מראש איפה יהיו הנקודות המסובכות ומסביר אותן.\n\nשעורי הבית: חצי מהם ממוחזרים ממבחנים, אולי אפילו יותר. סה\"כ מאוד עוזרים להבנת החומר. יבשים ודורשים לחשוב (כמו המבחן...)\n\nהמבחן: הוגן. 4 שאלות על נושאים נבחרים מההרצאות והתרגולים. יש דף נוסחאות, אז לא צריך לזכור בע\"פ פרוטוקולים. רק צריך לחשוב ולהבין למה שינויים כאלו ואחרים יכולים להשפיע. יש פקטורים לממוצע סופי 80.\n\nהשורה התחתונה: קורס חשוב לכל בוגר מדמ\"ח באשר הוא לדעתי. לומדים בו עקרונות שיכולים ללוות כל אחת ואחד מאיתנו במהלך הקריירה, אקדמית או בהייטק.", "timestamp": 1626954131882}, {"author": "אילון", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "חוות דעת - הרצאות: \nמעניינות ועמוסות במידע\n\nחוות דעת - תרגולים: \nתרגולים בנויים טוב, די עוזרים בעיכול החומר\n\nשעורי הבית: \nיש 6 תרגילים יבשים (תרגיל 2 הוא חצי רטוב - אבל לא עמוס יותר)\nתרגילים טובים שמכוונים היטב לגרום לכם לתרגל את מה שמחייב תרגול כדי ללמוד באמת\n\nהמבחן: \nהפורמט די חוזר על עצמו על להתכונן למבחן זה חוויה חיובית. לנו היה מועד די קשה עם ניקוד חסר רחמים, אבל עניין של מזל אולי\n\nהשורה התחתונה: \nקורס מאוד מעניין עם הרבה מושגים שמאוד כדאי להכיר כשיוצאים מהאקדמיה", "timestamp": 1628342790018}, {"author": "מיכאל", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: דר. גבי נקיבלי\nחוות דעת - הרצאות: המרצה מעניין ואוהב את התחום. במהלך הסמסטר היו 3 הרצאות אורח של מרצים מהתעשייה וכולם היו פחות טובים ממנו.\n\nשם המתרגל/ת: שגיא לבנון\nחוות דעת - תרגולים: מסביר מעולה ובסבלנות, הייתי בשעות קבלה שלו כמה פעמים והוא סידר לי את הראש בחומר.\n\nשעורי הבית: 5 תרגילים יבשים די ארוכים בדרך כלל ממבחני עבר, העיסוק בתרגילים הכריח אותי להבין את החומר וזה השתלם במבחן. בנוסף יש תרגיל אחד רטוב, אחד היותר כיפיים ומלמדים שהיו לי בתואר.\n\nהמבחן: הוגן ביותר. המרצה התחייב וקיים שאחת השאלות תמוחזר מאחד מששת המועדים האחרונים.\n\nהשורה התחתונה: אני לקחתי את הקורס כדי לקבל הצצה ורקע בסיסי לעולם ההגנה, והקורס עלה על ציפיותי מעל ומעבר. אני מאד ממליץ על הקורס.", "timestamp": 1633251864031}, {"author": "dani rich", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרבה מאוד מידע, אבל לא מאוד תיאורתי. להכיר את ההגדרות היטב עוזר מאוד.\n\nש\"ב חובה, לעיתים רחוקות ממוחזרים. לא מאוד קשים אם מבינים את החומר.", "timestamp": 1634919571921}, {"author": "Gadi Nabet", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: גבי נקבלי\nראיתי את המוקלטות המורחבות של פר' אלי ביהם ממש מעניינות ומרתקות\n\nשם המתרגל/ת: עידן\nממש טוב ומשקיע ומסביר מעולה\n\nחוות דעת - תרגולים: \nמעניינין מאוד\nשעורי הבית: \nקצת ארוכים אבל מעניינים ותמרתגלים טוב את החומר\nהמבחן: \nמורכב ודורש הבנה טובה מאוש של כל החומר\nהשורה התחתונה: \nקורס לא פשוט אבל מאוד מומלץ", "timestamp": 1635016728556}, {"author": "אמא של גיא", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גבי\nחוות דעת - הרצאות: \nגבי אוהב מאוד את הקורס, לדעתי אפשר היה ללמד בצורה יותר מעניינת. מביא הרבה הרצאות אורח ממומחים בתחום. באופן כללי ההרצאות חשובות למבחן וכדאי להבין מהן כמה שיותר כדי לחסוך כאב ראש בתקופת המבחנים.\nשם המתרגל/ת: גיא שפירא\nחוות דעת - תרגולים: \nאחד המתרגלים אם לא ה.. \nמבין את הסטודנטים, יודע מה הנקודות שכדאי להדגיש ויש אווירה מאוד טובה בתרגולים. הולך בדרך הקצרה מA לB.\nהתרגולים מאוד פרקטיים והצילו אותי אחרי שלא הקשבתי בהרצאה של אותו שבוע\nשעורי הבית: \nיבשים חוץ מרטוב קצר אחד. כדאי להשקיע בתרגילי בית כי הם במתכונת המבחן. חלק גדול אפשר לרפרנס.\nהמבחן: \nלא קל, צריך לחזור על הרבה חומר. יש אלמנט של מזל- תעלה על התקיפה או לא תעלה. מצד שני יש גם הרבה שאלות ששליטה על החומר תעזור בהן. בסך הכל הוגן אבל קשה.\nהשורה התחתונה: \nקורס חמוד שנותן חשיפה לעולם של הצפנה, ביטחון מידע ואבטחה ברשתות", "timestamp": 1646032952654}, {"author": "No", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: תום אזולאי\nחוות דעת - תרגולים: מתרגל מקצועי, משקיע מאוד בהכנת השיעורים. עונה לכל שאלה. \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1657483878276}, {"author": "100", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: ההרצאות היו כיתה הפוכה (שאגב אף אחד לא היה מגיע לכיתה ההפוכה), ההרצאות מוקלטות מראש ובסה\"כ מובנות. החומר מאוד מעניין ואלי בן אדם טוב שרואים שאכפת לו מסטודנטים.\n\nשם המתרגל/ת: הדר \nחוות דעת - תרגולים: אין עליה.\n\nשעורי הבית: ברמה של מבחן חלק אפילו ממבחנים קודמים.\n\nהמבחן: בסה\"כ הוגן עם שאלה משוחזרת.\n\nהשורה התחתונה: קורס שאני לא מבין איך הוא לא בין קורסי החובה, מאוד מעניין והסגל מצוין ממליץ בחום.", "timestamp": 1659861534859}, {"author": "matan asban", "difficultyRank": 5, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמעניינות אבל ארוכות .\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהדר סיוון  - מתרגלת טובה וברורה.\nשעורי הבית: \nקשוחים. 6 גליונות עם שאלות שהם מחדשים , אין רפרנסים להרבה שאלות . הגליונות מעניינים ומלמדים אבל לוקח המון זמן לפתור אותם ובסוף גם מורידים נקודות על שטויות..\nהמבחן: \nהוגן , אבל לא פשוט בכלל . צריך לפתור מבחנים ולראות טריקים שחוזרים על עצמם . אין פתרונות רשמיים אז לומדים רק מסריקות אבל סה\"כ הלמידה עצמה חיובית. לעומת זאת הבדיקה של המבחן לדעתי מוגזמת ברמת האינפי 1מ' , כמעט כל סעיף מורידים נקודה או 2 על חוסר דיוק או שטות כזו או אחרת ובסוף זה מצטבר ל-70-80 ובאמת על סתם שטויות וחידודים לא קריטיים לשאלה ולתשובה.. לדעתי ההתקטננות הזאת לא צודקת ופוגעת במטרה של הקורס , בסופו של דבר רוב האנשים שלוקחים אותו לקראת סוף התואר וזה לא זורם לקבל בדיקה קשוחה ומעצבנת ללא רציונל אמיתי.\nהשורה התחתונה: קורס נחמד ומעניין , מאיזה שהוא שלב נהיה יותר מבוא לקריפטוגרפיה וזה נהיה קצת חופר ומיותר לטעמי . חשוב לזכור שהוא עמוס ובכלל לא מובטח ציון טוב בקורס צריך להתאמץ בשביל זה אף על פי שהממוצע 78-80 לרוב.", "timestamp": 1659879440398}, {"author": "YT", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: פרסם הרצאות מוקלטות וזה היה החומר המחייב. ההרצאות הן בפועל סוג של פודקאסטים. משעמם משעמם משעמם. פשוט מרדים בצורה לא רגילה.\n\nשם המתרגל/ת: הדר סיון\nחוות דעת - תרגולים: מתרגלת טובה. מסבירה את מה שצריך.\n\nשעורי הבית: 5 גיליונות לא ארוכים מדי, לוקח פחות או יותר יום ורוב השאלות די רלוונטיות למבחן.\n\nהמבחן: לא קל בכלל, מלא חומר לשנן ודורש יכולות חרטוט גבוהות. לא תמיד מנוסח טוב. יש דף נוסחאות יחסית מפורט שעונה על הרבה שאלות במבחן. ממליץ לא רק לפתור מבחנים אלא גם להשקיע בשינון החומר.\n\nהשורה התחתונה: נשמע כמו קורס עם שם מפוצץ ושלומדים בו דברים מעניינים אך אותי הוא מאד איכזב. פשוט קורס שבו לומדים על עוד ועוד ועוד פרוטוקולים של החלפת מפתחות ותקשורת. אין שום עניין או פרקטיקה.", "timestamp": 1660154913376}, {"author": "אסי", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: \nהרצאות מעניינות לפעמים, חשוב להריץ על פי 2 לפחות.\nהשתיקות הארוכות זה לא בעיה באינטרנט שלכם, זה איך שאלי מדבר :)\n\nשם המתרגל/ת: הדר סיון\nחוות דעת - תרגולים: \nמתרגלת ממש טובה, רוב התרגולים הם דיי סיפוריים ומעניינים\n\nשעורי הבית: \nארוכים ומציקים, אבל הרוב מרופרנס משנים קודמות\nהמבחן: \nארוך, מלא תתי סעיפים, אבל בסף הכל יחסית סבבה\nהשורה התחתונה: \nמומלץ לכל מי שמתעניין בהגנה על רשתות מחשבים וכניסה טובה לתחום", "timestamp": 1662227413663}, {"author": "Diana Cohen", "difficultyRank": 5, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אלי ביהם\nחוות דעת - הרצאות: ישנן הרצאות מוקלטות כקדם להרצאה פרונטלית. השילוב מנצח. מאוד מעניין עם אופי ייחודי.\n\nשם המתרגל/ת: תום אזולאי\nחוות דעת - תרגולים: פחות שולט בחומר, תרגולים שטחיים, לקראת הסוף נהיה יותר מעניין. מתרגלים מומלצים - הדר (מדהימה) ועידן.\n\nשעורי הבית: 6 תרגילי בית בעיקר תיאורטיים עם נגיעה קטנה לקוד שרת-לקוח והתנסות עם ויירשארק. מאתגרים ומעניינים, נדרשת מחשבה והבנה עמוקה. תרגילי בית 5 ו-6 היו מאתגרים מאוד ולקחו זמן רב.\n\nהמבחן: לא פשוט אבל הוגן בסך הכל. הרבה לקרוא.\n\nהשורה התחתונה: מאוד נהניתי מהקורס עצמו ומההרצאות של אלי במיוחד.", "timestamp": 1664175619772}, {"author": "צפרדע אנונימית", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גבי נקבלי\nחוות דעת - הרצאות: \nתוכן: התוכן של ההרצאות הוא מאוד חשוב לכל סטודנט בפקולטה למדעי המחשב. אי אפשר לקרוא לעצמך סטודנט למדעי המחשב (ולמעשה אני לא יודע איך זה לא קורס חובה) אם לא עשית את הקורס הזה. מאוד מומלץ! לומדים אלמנטים סופר חשובים בהיבט של: איך מתנהלות סיסמאות, איך מידע עוברת ברשת בצורה מאובטחת, איך מצפינים בצורה חכמה. תוכן חשוב והכרחי מאוד לסטודנט שכל היום משתמש בדברים האלה מאחורי הקלעים.\n\nההרצאות עצמן: מועבר בצורה לא טובה. מאוד יבש, חסר עניין וקשה להתרכז. מיליון פרוטוקולים שמנסים להסביר אותם בעל פה אבל קשה לתפוס את זה בהרצאה אחת, רק אם עוברים על זה טוב טוב. אולי צריך גישה אחרת להעברת הקורס.\n\nשם המתרגל/ת: הדר (מוקלט)\nחוות דעת - תרגולים: ממש טובים!\nעוזר להבין את הדברים שנשארו מעומעמים בהרצאה ושם דגש. יש קצת חומר חדש, לא הרבה והוא מועבר בצורה יותר פשטנית ונגישה. \n\nשעורי הבית: 5 תרגילי בית שרובם יבשים (רק בתרגיל בית 3 היה צריך להשלים קוד באחת השאלות). התרגילים הראשונים ממש בסדר וקלילים, אלו שבהמשך דורשים חשיבה יצירתית והבנה עמוקה של החומר. זה לא רעיון רע להיעזר במקורות נוספים כדי לפתור אותם כי ככה אפשר להבין את החומר היטב.\n\nהמבחן: בסדר. מבחן סטנדרטי, 4 שאלות. אחת ממוחזרת משנים קודמות ועוד 3 שאלות על נושאים מרכזיים יחסית בקורס שרוצים לוודא שהבנו את החומר הנלמד, קצת קשה לזהות חלק מההתקפות וזה דורש גם חשיבה יצירתית. לפעמים זה משהו שיש או שאין לך פשוט. אפשר לחזק את זה עם תרגול מספק למבחן.\n\nהשורה התחתונה: כשהתחלנו את הקורס, גבי אמר שלא נלמד שום דבר שקשור להתקפה ברשתות. בפועל, 70% מהסעיפים במבחן הם לתאר התקפה על פרוטוקול חדש/קיים. לדעתי זה מאוד חשוב לפתח/להכיר את צורת החשיבה הזאת שלא כמו אלגוריתמים, לוגיקה או מבני נתונים - חוקרים פה גישה אחרת של חשיבה.\nלסיכום, מאוד ממליץ מבחינת התוכן, ולנסות לא לסבול יותר מדי מההרצאות.", "timestamp": 1679352340820}, {"author": "er", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \nיש הרבה חומר, והרגיש שצריך לחזור על החומר כדי לעכל אותו.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nהתרגולים עוזרים \"רובם\" מתרגלים את החומר אבל יש חומר לא חופף.\n\nשעורי הבית: \nתרגילים עמוסים והגשה יחידנית. הבדיקה קפדנית באופן קיצוני.\n\nהמבחן: \n\n\nהשורה התחתונה: \nקורס מעניין, מבוא לתחום של הגנה. ההתעסקות היא על הגנה ברשתות, לא בהגנה על מחשבים או תוכנות.", "timestamp": 1689690122286}, {"author": "תולעת בתחת", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: רוב ההרצאות פשוט עוברים על פרוטוקולים. בשילוב עם האיטיות של עמיחי וטונות של שאלות שאנשים שואלים, רוב הזמן ההרצאות משעממות בטירוף.\n\nשם המתרגל/ת: יוסף גורן\nחוות דעת - תרגולים: לא מעניינים מדי. גם פה עוברים על פרוטוקולים, ובנוסף פותרים קצת שאלות. יוסף מעביר אותם בסדר אבל לא מעבר.\n\nשעורי הבית: 5 תרגילי בית, 4 יבשים ואחד חצי רטוב חצי יבש. לא ארוכים מדי, אבל הבדיקה שלהם בזיונית. כמות הנקודות שמורידים לא פרופורציונלית לטעות שנעשתה, ולפעמים מורידים נקודות על דברים שהם לא ציינו בתרגיל ולא היה לנו איך לדעת אותם. במקרה כזה הייתם חושבים לערער נכון? אז תחשבו שוב, כי הסגל יגרום לכם להצטער על זה שערערתם ובסופו של דבר אנשים לא מערערים על דברים כאלה בגלל החוסר הוגנות של הסגל. בסופו של דבר זה יוצר מצב של ממוצעים של 75-80 על תרגיל בית יבש סתם.\nבנוסף נורא נוקשים בבדיקה על כל הנושא של העתקות, אז ההמלצה היא להשתדל לא להעתיק.\n\nהמבחן: כמו השיעורי בית, גם ברמה וגם בבדיקה.\n\nהשורה התחתונה: לקחתי את הקורס אחרי ששמעתי את ההמלצות עליו, אבל מאוד התאכזבתי. הקורס לא מעניין כמו שעושים ממנו, ורובו די יבש ולא מעשי. בנוסף לכך הסגל הוסיף לאכזבה שלי וגרם לי להצטער שלקחתי את הקורס.", "timestamp": 1691579538802}, {"author": "פרוטוקול WAP", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: מאוד נחמד וזמין במיילים.\nרוב ההרצאות העדפתי לראות מוקלט של אלי ביהם כי הן כוללות חומר מאוד טכני שקצת זגזגו עליו בהרצאה הפרונטלית, ובעיניי היה שווה להתעכב עליו. אחרי שתרגלתי מבחני עבר - נוכחתי לראות שצדקתי.\n\nשם המתרגל/ת: הדר (מוקלט)\nחוות דעת - תרגולים: סביר.\n\nשעורי הבית: 5 גיליונות, כשרמת הקושי קצת עולה במהלך הסמסטר. הבעיה היא לא הגיליונות, אלא מי שבודק אותם. ממוצע ת\"ב ירד ב-10 נקודות מסמסטר קודם, על גיליונות *כמעט זהים* לאלו מהקודם. אנשים חזרו על הקורס, הגישו אותו פתרון, וקיבלו ציון משמעותית נמוך יותר. בת\"ב 2 הורידו לאנשים ניקוד כי הם לא עשו משהו שלא ביקשו מהם לעשות, בתואנה ש\"זה ברור בשלב הזה של התואר, ויש פרצות אבטחה בגלל מתכנתים שלא מגדילים ראש\".\n\nאוברול, אנשים קטנים בקורס קטן. ממליץ לחכות סמסטר או שניים עד שיתנקזו מהמערכת.\n\nהמבחן: סבבה.\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1691936108728}, {"author": "בנק לתומי", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "שם המרצה: עמימי שולחן\nחוות דעת - הרצאות: \nלא הייתי אבל שמעתי שהיה מיליון דולר \n\nשם המתרגל/ת:  לא הייתי, מתרגלת אחראית - דיאנה כהן\nחוות דעת - תרגולים: \nמהווים 20%-30% מחומר הקורס. לא קשים ואפשר להשלים דרך חוברת הקורס המומלצת בחום (לא תמיד הכי מעודכנת).\n\nשעורי הבית: \nאוי.\nאחד הלא מכבדים שלהם. כל תרגיל בת הנפצה שמורידה לכולם 5-10 נקודות בין אם זה \"לא בדקתם תקינות קלט אפילו שלא דרשנו\" או \"לא עניתם משהו שקשור לחומות אש לפני שלמדנו חומות אש\" או \"איך לצד השני יהיה את המידה למרות שכתוב מפורשות בשאלה שיש לו\" ושאר פלאי תבל.\nחוץ מזה, כולנו סטודנטים ובאנו בשביל ללמוד, ומה נעשה, אנחנו גם טועים. על טעויות מינוריות לא פעם החליטו לפסול סעיפים שלמים, על אף שעיקר הסעיף, והחלק הרלוונטי, נכון. כאמור, לא מכבד בכלל.\n\nהמבחן: עד כה מועד א בלבד\nכמיטב המסורת שאלות לא ברורות, מתרגלים רגוזים, בדיקה לא עקבית. \n\nהשורה התחתונה: \nמבחינת חומר פתיחה רלוונטית לעולם התוכן.\nמבחינת מתרגלים ויחס לסטודנטים, דרוש שיפור רציני, מעכיר את חוויית הלמידה בקורס, לא יכול להמליץ פחות.", "timestamp": 1692012046793}, {"author": "ReShA", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: עמיחי שולמן\nחוות דעת - הרצאות: היה קשה לשמור על ריכוז בהרצאות של עמיחי. הוא נוטה לסטות מהמצגות ולדבר קצת באוויר, ולאחר מכן לדלג על שקפים שהוא דיבר עליהם בעל פה. לא הצלחתי לעקוב ככה, ובפועל נאלצתי לראות גם את המוקלטות של אלי, שהרגישו יותר מאורגנות.\n\nשם המתרגל/ת: יוסף גורן\nחוות דעת - תרגולים: גם התרגולים הרגישו מפוזרים, אם כי פחות מההרצאות. התרגולים תרמו להבנת החומר, אך מומלץ לעבור על המצגות שוב לאחר מכן כדי לוודא הבנה.\n\nשעורי הבית: 5 תרגילי בית לאורך הסמסטר, רמת השקעה סבירה. ככל הנראה הבדיקה הכי נוקשה שחוויתי בטכניון. לא מעט שאלות מנוסחות בצורה מעורפלת (כדי לא לחשוף את הפתרון), אך מי שמפרש את השאלה בצורה שונה מאיך שהתכוונו אליה מחברי השאלה, עלול לא לקבל ניקוד כלל.\n\nהמבחן: דומה לתרגילי בית גם באופי המבחן וגם באופי הבדיקה. מזכיר קצת מערכות הפעלה במובן שכדי לענות על השאלות צריך להיכנס לראש של מי שכתב אותן ולהבין למה הוא התכוון. אם מניחים הנחה, טריוויאלית ככל שתהיה, צריך לרשום שמניחים אותה כדי להימנע מהורדת נקודות עודפת (ומומלץ לפתור את השאלה פעם נוספת ללא ההנחה, כי אם היא אינה מוצדקת - עלולים להוריד את כל הנקודות על השאלה).\n\nהשורה התחתונה: שמעתי הרבה מילים טובות על הקורס, ונראה שפיתחתי ציפיות גבוהות מדי. בפועל מקורסי הבחירה הפחות טובים שלקחתי. חלק ניכר מהחומר לא באמת מעניין, או שהוא פשוט מועבר בצורה שלא מעוררת עניין. חוויות שליליות רבות לאורך הסמסטר מסגל הקורס, כולל בין היתר תגובות מזלזלות לערעורים גרמו לסלידה וירידת מוטיבציה.", "timestamp": 1696085437470}, {"author": "A", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nראיתי התרגולים המוקלטים של הדר - טוב \nשעורי הבית: \nיש שאלות לא ממוחזרות ובודקים בקפידה - צריך קצת השקעה אי אפשר רק להסתמך על רפרנסים\nהמבחן: \nצריך לזכור מלא מושגים ופרטים קטנים קצת דומה ללמידה למבחן בהפעלה\nיש סעיפים עם ניסוח בעייתי ולא מובן (אפילו למתרגלים) \nהמבחן עצמו לדעתי לא היה קשה בצורה חריגה אבל הבדיקה לא הגיונית בכלל מורידים מלא נקודות על כלום \nעדיף בדיקה רגילה במקום הפקטור שהם נתנו\nהשורה התחתונה: \nהחומר מעניין אבל לא שווה את עוגמת הנפש במבחן ובעיקר הבדיקות המחמירות גם במבחן וגם בתרגילי בית- לא מומךץ", "timestamp": 1716125064167}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גבי נקבלי\nחוות דעת - הרצאות: מעניין ומועבר בצורה מעניינת ואינטראקטיבית. לפעמים גבי מדלג על חלק מהשקפים ולא תמיד ברור מה הועבר בעל פה ועל מה מדלגים.\nבפועל לומדים הרבה פרוטוקולים עם מטרות שונות. לקראת הסוף אני קצת מיציתי ללמוד עוד ועוד פרוטוקול.\nהיו 3 הרצאות אורח שהיו מעניינות אבל ברמה גבוהה.\n\nשם המתרגל/ת: הדר - מוקלט\nחוות דעת - תרגולים: מעולה.\n\nשעורי הבית: 5 יבשים. כל אחד 2 שאלות עם כ - 8 סעיפים. אפשר לסיים בכמה שעות.  בתרגיל 3 יש חלק רטוב קשוח... עדיף לרפרנס אם לא מבינים את הפרטים הטכניים.\n\nהמבחן: יש הרבה טריקים. לפעמים מציגים משהו ושואלים אם יש בו חולשה. אם אין, קשה להוכיח שבאמת אין ומסבירים בגדול ככה שלפעמים קשה להשתכנע שיודעים את התשובה. בנוסף, לא תמיד ברור מה מותר ומה אסור להניח, כמו איזה יכולות יש לתוקף. ממליץ לשאול במקרה כזה. יש דף עזר שעוזר לזכור את כל הפרוטוקולים. תשימו לב שיש טבלה שאומרת איזה פרוטוקול עמיד בפני איזו התקפה - כששואלים אם יש חולשה בפרוטוקול חדש, ממליץ לעבור על ההתקפות שם ולנסות לראות אם פגיע לאחת מהן. יש שאלה אחת ממוחזרת משלושת הסמסטרים האחרונים. נחמד אבל אין תשובות רשמיות ולא תמיד קל ללמוד מהסריקות.\nבמועד שלנו היו כמה סעיפים לא ברורים עד הסוף. מציע לכתוב כל מה שחושבים כדי שבבדיקה ימצאו את מה שהתכוונו אליו.\nהיה פקטור הוגן.\n\nהשורה התחתונה: אחלה קורס. נותן פתח חשוב לעולם של אבטחה וגם לא מעמיק יותר מידי בפרטים קטנים למי שלא רוצה יותר מידי להעמיק. פותח את הראש. ממליץ.", "timestamp": 1716136719486}, {"author": "ירדן", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גבי נקבלי\nחוות דעת - הרצאות: רובן די משעממות ויבשות אבל אין יותר מדי ברירה, גם ההקלטות לא להיט.\n\nשם המתרגל/ת: דיאנה / מוקלט של הדר\nחוות דעת - תרגולים: דיאנה מעולה, חשוב לה מאוד שהסטודנטים שלה יצליחו ולכן היא דואגת להדגיש נקודות חשובות ולתת טיפים אקסטרה. בשלב מסוים היה לי קשה לעקוב אז עברתי לתרגולים של הדר והם מצויינים.\n\nשעורי הבית: 5 תרגילים יבשים לא כבדים מדי שכל אחד לקח לי כמה שעות. לאחד היה חלק רטוב ממוחזר ונוראי- אל תהססו לרפרנס.\n\nהמבחן: היה מבחן קשה והממוצע מדבר בעד עצמו אבל עם מספיק תרגול אפשר היה לצלוח אותו.\n\nהשורה התחתונה: יש בקורס חלקים מאוד משעממים, המבחן לא קליל וממוצע לא וואו אבל החומר די basic knowledge שכדאי שיהיה לכל אחד בתחום שלנו, גם אם הוא לא חולם להיות איש סייבר.", "timestamp": 1716917511565}]}