{"posts": [{"author": "קוסטה ב", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: לא ממש מובנות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: עוזרים להבנה אך עדיין מעורפלים\n\nשעורי הבית: לא הכי ברורים כי כל הקורס לא הכי מובן\n\nהמבחן: היה מאתגר בגלל שהיה סמסטר זום וכתוצאה מכך שונה מבנה המבחן\n\nהשורה התחתונה: קורס לא ממש מובן, הרעיון הכללי נחמד אך לא רלוונטי במתכונתו הנוכחית לסטודנטים לרפואה לדעתי", "timestamp": 1602857972850}, {"author": "א", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: עומרי ושי שנאור\nחוות דעת - הרצאות: עומרי מרצה טוב ולדעתי ההרצאות המוקלטות לרוב מספיקות. שי מרצה חביב אבל פחות ברור בהרצאות שלו.\n\nתרגולים: מאוד יעילים, יחסית עמוסים. לרוב מספיקים יחסית כדי להבין את החומר.\n\nבכללי: קורס עמוס למדי, אצלנו היה מורכב מכיתה הפוכה+מטלות אישיות כל שבוע+הגשות קבוצתיות כל כמה שבועות. \n\nהמבחן: לא פשוט ולא מאוד ברור, אבל יחסית הוגן.\n\nהשורה התחתונה: קורס עמוס ולא מובן כל כך. הכיתה ההפוכה והתרגולים לרוב מספיקים להבנת החומר, אבל כן דורש השקעה במהלך הסמסטר.", "timestamp": 1659356321130}, {"author": "צכחכ", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "חוות דעת - הרצאות:\nעומרי - יש לו הרצאות מוקלטות שלכאורה אמורות להספיק, אבל לפעמים כמעט ובלתי אפשרי להבין אותו שם. כדאי לעבור עליהם יחד עם סיכום או להתכונן לזה שתצטרכן לשמוע אותן כמה פעמים. הרבה יותר קשה להבין איתן משיטות א.\n\nשי - לא מרצה טוב, בכלל לא ברור על מה הוא מרצה. לפיו ההרצאות בכיתה הן רק העשרה אז אפילו אין סיבה להגיע אליהן, ואת ההרצאות המוקלטות מתמצטים בתרגולים והן רק מבלבלות אז גם אותן לא מומלץ לשמוע. גם פה, סיכומי עבר עדיפים.\n\n\nשם המתרגל/ת:  אביב\nחוות דעת - תרגולים: \nמסבירים את החומר מחדש בשפה של סטודנטים לרפואה. לא כדאי לותר עליהם אם קשה לכם להבין את הכיתות ההפוכות כי הם יעזרו מאוד.\n\n\nשעורי הבית: \nמטלות כל כמה זמן. של עומרי עוד בסדר אבל של שי לא קשורים בשום צורה לכיתה ההפוכה. בדרך כלל כשיש מטלה מדברים בתרגולים על כלים לפתור אותה אז כדאי לחכות לתרגולים לפני שמנסים.\n\nהמבחן: \nהחלק של עומרי בסדר יחסית. החלק של שי מבלבל ודורש יותר הבנת הנקרא והרצונות של הכותב מהבנת החומר ולדעתי לא הכי הוגן.\n\nהשורה התחתונה: \nעוברים וממשיכים", "timestamp": 1694438355004}]}