{"posts": [{"author": "קוסטה ב", "difficultyRank": 3, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: מוקלטות מראש ולא הכי ברורות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: סך הכל תרגולים סבירים, תרגול כל כמה שבועות\n\nשעורי הבית:לא קשים מידי, גיליון פעם בכמה שבועות אך דורש ישיבה של מספר שעות\n\nהמבחן: די קשה ונכנס לפינות הכי קטנות בחומר הנלמד, לפעמים נוגע לתכנים שכלל לא הועברו בשיעור אלא כתובים בספר הקורס (באנגלית אקדמית)\n\nהשורה התחתונה: ללמוד מהסיכומים השונים ולתרגל כמה שיותר מבחנים", "timestamp": 1602858206075}, {"author": "ליאו", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: פלג חסון\nחוות דעת - הרצאות: הרצאות קשות מאוד. עוברות מאוד מהר על החומר, ומי שאין לו רקע בביולוגיה מהתיכון צריך לחתור מאוד חזק כדי להשאיר את הראש מעל המים \n\nשם המתרגל/ת: רותם\nחוות דעת - תרגולים: תרגולים לא קשורים לחומר הלמד בהרצאה. מעניין אבל לא מתרגל\n\nשעורי הבית: סבירים מאוד, אחת לכמה שבועות\n\nהמבחן: \n\nהשורה התחתונה: ללמוד מסיכומים, ולנסות להבין הגדרות ושמות כמה שיותר באופן ברור.", "timestamp": 1655665560153}, {"author": "76 פרייאר", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמוקלטות, קשות להבנה בלייב אבל יש מי שאחרת לא לומד. תכלס לקרוא סיכומים ולתרגל מבחנים. ההרצאה בנושא האחרון על הסרטן- מרתקת! שווה לבוא רק אליה לטעמי\nשם המתרגל/ת: שירה\nחוות דעת - תרגולים: \nהיא מהממת והתרגולים מביאים קצת רפואה בשנה א שאין בה כמעט בכלל אז זה כיף. הבחנים בתחילת השיעורים עשויים להיות רעים אבל תזכרו שזה בקושי נקודה מהציון ויהיה בסדר. מנחים אותן להיות מעט דושיות אז תהיו מנומסים, תשלחו מיילים כמו אנשים גדולים ולא ילדים בגן ותהיו מוכנים לקבל לא בערך עבור כל בקשה כמעט\nשעורי הבית: \nיחסי אהבה שנאה.יש 4 כאלה(לנו היו 3).\nשואלים שאלות על מחלות בהקשר למה שהיה בתרגול(ואסור מן הסתם לענות לפי דברים שאוזכרו בתרגול אז אשכרה תקשיבו שם) וצריך לענות עם סימוכין מאתר מאמרים רפואי בשם פאבמד שמסבירים איך להשתמש בו. כל עוד לא תשמשו בגוגל טרנסלייט ותשימו לב לפרטים הקטנים בשאלות- יש מצב יהיה בסדר אם לא יתפסו איתכם על איזו פינה\nהעבודות בזוגות, לשים לב שעונים על הכל ושמים את השמות והתז וגם מגישים בזמן. אל תתנו לפינות טכניות לבאס אתכם ותזכרו שזה באמת איזו נקודה מהציון לטוב ולרע.\nטיפ לעבודה- חפשו בגוגל את התשובה ואז תדביקו את התשובה בחיפוש בפאבמד, מקל על החיים\nהמבחן: \n\nהשורה התחתונה: הקורס היחיד פחות או יותר שקשור לרפואה חוץ מהקליני בסמסטר א.\nהרצאות שקשה להקשיב אבל יש כאלה שזה טוב להם, שיעורי בית ובחנים באנגלית שמנסים להקאות לכם שלעיתים לאקדמיה הגיון משלה. תתרגלו מבחנים ותכינו כרטיסיות על החומר כי זה ממש עוזר", "timestamp": 1677751831034}, {"author": "ס", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nארוכות וקשות. מכניסים אליהם הרבה יותר מידי חומר, והמרצים בד\"כ מדברים בלי הרבה סדר (אפילו אם מנסים לעקוב אחרי המצגת לא ברור מה קורה).\nבד\"כ יצאתי מהן יותר מבולבלת משנכנסתי אליהן. העדפתי לשבת לבד בזמן ההרצאות ולקרוא את החומר בעצמי.\nחלק מההרצאות מבוססות על נושאים כמו יסודות הכימיה או כימיה אורגנית ואז קשה להבין אותן. \nבנוסף, הסדר שלהן לא ממש מסתדר ומתבססים בחלקן על נושאים שעוד לא נלמדו.\nכשמגיע סוף הסמסטר הכל פתאום מתחבר.\nלא כל המרצים היו ככה, היו הרצאות שדווקא עברו נחמד.\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nקורים פעם בכמה שבועות ולא קשורים לחומר. \nיש להם הרבה זמן בלוז אבל בפועל זה לא ככה. \nיש בחנים כל תרגול, השאלות יכולות להיות קצת מבולבלות ולא ברורות.\n\nשעורי הבית: \nבסדר בסך הכל. הקושי הוא לחפש דברים בפאבמד.\nהשאלות קצרות וענייניות ומותאמות לרמה של סטודנטים ברמתנו.\n\nהמבחן: \nלא נוראי, אבל השאלות מנוסחות בצורה ממש ממש מבלבלת :(\nכדאי להבין איך המרצים אוהבים לנסח דברים כדי להבין אותם.\n\nהשורה התחתונה:", "timestamp": 1678635139047}, {"author": "סטודנט לרפואה", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "חוות דעת - הרצאות: היו מאוד מבולגנות ולרוב לא מובנות מכיוון שדרשו ידע מקדים\n\nשם המתרגל/ת: שירה\nחוות דעת - תרגולים: התרגולים עוסקים ספציפית במאמרים ומאוד נחמדים וקלילים, יש בוחן בתחילת כל תרגול שיש בו לפעמים שאלות טריקיות\n\nשעורי הבית: ישנן עבודות על התרגולים שמטרתן לתרגל אותנו בחיפוש מאמרים בpubmed. בעבודות נדרשת יותר עבודה משנדמה בהתחלה \n\nהמבחן: מבחן הוגן אך רצוי לא להזניח את הקורס במהלך הסמסטר וכן ללמוד על החומר מכיוון שישנה כמות חומר מאוד גדולה ובמבחן נשאלים לפרטי פרטים\n\nהשורה התחתונה: לעבור לאורך כל הסמסטר ולא להזניח", "timestamp": 1678992482066}]}