{"posts": [{"author": "בר לנקרי", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עמרי ברק\nחוות דעת - הרצאות: מרצה מקסים ומלמד בצורה סבלנית ומעניינת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לא קשים מדי\n\nהמבחן: לא להימרח ולעבוד על זה מראש. אין מבחן מסכם אלא מס' מבחנים לאורך הסמסטר שהם עבודות הגשה ומרכיבים ציון סופי\n\nהשורה התחתונה:", "timestamp": 1625393533304}, {"author": "א", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: עומרי ודורי\nחוות דעת - הרצאות: \nההרצאות נעשות במתכונת של כיתה הפוכה- צופים כהן לפני השיעור ועונים על השאלות. יש תחושה שמי שלמד תכנות מסתדר עם הקורס ומי שלא- מסתבך. בפועל התכנות הוא חלק שולי מהקורס, ומתעסקים בעוד דברים, שהם גם בסדר. יש לי רקע בתכנות ומאוד אהבתי את הקורס, עד שהתחיל החלק של דורי שהוא מאוד לא תכנותי ומאוד מתמטי.\nעומרי מצויין, יודע להסביר ומאוד סבלני ואכפתי גם אם התוכן לא הכי ברור.\nדורי מלמד חלק מהקורס. הרבה פחות ברור ומאוד לא מאורגן.\nשם המתרגל/ת: סיוון\nחוות דעת - תרגולים: \nמצויינת, אכפתית (היתה המתרגלת האחראית). הייתי גם אצל שני המתרגלים האחרים (זוהר ואביב) והם גם מצויינים. \nשעורי הבית: \nאין ממש שיעורים, יש הגשות כל כמה שבועות- הן לרוב ממש בסדר. אחרי ההגשה בודקים בעל פה מדגמית אנשים, הבדיקה ממש הוגנת- רוצים רק לוודא שהבנתם מה עשיתם.\nהמבחן: \nלא היה לנו- עשינו עבודה. \nהשורה התחתונה: קורס מוזר, תקבלו באהבה את התכנות ואל תתנו לו חשיבות גבוהה ממה שצריך- זה לא העיקר.", "timestamp": 1647337592455}, {"author": "T.P", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nעמרי- אחלה מרצה, מקיים כיתה הפוכה בצורה מאוד טוב.\nדורי- החומר עצמו מאוד מורכב,אמופרי ולא ברור כיצד מתקשר לחומר שנלמד לפני או בכללי לכל דבר אחד שנלמד בתואר. הרצאות מבלבלות ולא מסודרות\nשם המתרגל/ת: נאדין/בני \nחוות דעת - תרגולים: \nנאדין- אחלה מתרגלת. מאוד משתדלת לעזור ולדאוג שמבינים את החומר. החומר באותות לדעתי פחות הצד החזק שלה. \nבני - מתרגל לא מצקועי מספיק לדעתי. לא ממליץ להרשם לקבוצה שלו.\nשעורי הבית: \nשיעורי הבית לא מאוד קשים למי שיש רקע מסוים בתכנות. \nמי שאין לו רקע- צריך לחרוק שיניים עד שהאסימונים נופלים. \n\nהמבחן: \nמועד א' היה לדעתי לא הוגן, שונה ממועדים קודמים שפורסמ ו+ התמקדות בנושאים הפחות משמעותיים \nהשורה התחתונה: \nקורס כבד בעיקר לאלו שאין להם רקע בתכנות שפות מחשב. דורש השקעה רבה במהלך השבוע מעבר לתרגילי הבית. מבחן בדרגת קושי בינוני-קשה.", "timestamp": 1675602999847}, {"author": "Anon", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: עומרי ברק \nחוות דעת - הרצאות: במתכונת כיתה הפוכה שזה אומר שרואים סרטונים קצרים בבית במקום הרצאות. לדעתי זה פגז וחבל שבקורסים אחרים לא ככה. בסרטונים יש תכלס ולכן הם חוסכים זמן וכאבי ראש. \nלדעתי הקורס קל , בטח בהתחשב בכך שהוא 4 נקז.\nאין הרבה מאוד חומר ואין עומס של הגשות.. רק 4 במהלך כל הסמסטר ואת כל אחת מהן אפשר לתפור תוך שעתיים גג\n\nשם המתרגל/ת: לא הייתי בתרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: קלים יחסית ולא מצריכים השקעה מיוחדת , לדעתי.\n\nהמבחן: 2-3 ימי למידה יספיקו , לתרגל כמה מבחני עבר וזה סוגר את הפינה.\n\nהשורה התחתונה: קורס קל יחסית לכמות הנקז שהוא שווה , מאפשר להתרכז בקורסים היותר כבדים בסמסטר הזה שהם יסודות וביותא", "timestamp": 1676187049923}, {"author": "76 פרייאר", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דורי ועמרי\nחוות דעת - הרצאות: \nלמידה הפוכה בחלק הראשון שזה טיל לטעמי אבל הסרטונים לעיתים לא ברורים, תתעכבו עד שתבינו ואשכרה תעשו תשיעורי בית כי הם תורמים להצלחה במבחן.\nהחלק השני ממש רע, תגיעו לתרגולים ותקראו סיכומים. והכי חשוב- ללמוד ממבחני עבר\nשם המתרגל/ת: בני\nחוות דעת - תרגולים: \nהמתרגלים בעצמם לא היו סגורים על שפת r בהתחלה, שזה לגיטימי כי זו שפה מאוד נישתית מצד אחד מצד שני היית מצפה שהם ילמדו לקראת התרגול לפחות את מה שיופיעו בו. בהמשך השתפר ובני הנסיך הזה תרם מזמנו הפרטי לוודא שאנחנו מוכנים לבחינה מתי שרק ביקשנו וכמה שביקשנו.\nתכלס שווה להגיע לפחות בחלק של אותות\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1677751111146}, {"author": "ס", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: עומרי \nחוות דעת - הרצאות: \nעשה את ההרצאות בצורה של \"כיתה הפוכה\" - היו סרטונים שרואים בבית, ומי שהתקשה בהבנה שלהם יכל להגיע בשעות \"האמיתיות\" של השיעור לעוד הסברים ועזרה.\nלדעתי לא מרצה טוב. מניח שאנחנו יודעים דברים בסיסיים בתכנות ובמתמטיקה ומתבסס עליהם בהסברים שלו. קשה באמת לעקוב ולהבין.\n\nשם המרצה: דורי\nחוות דעת - הרצאות:\nדורי לא עשה כיתה הפוכה והיו שיעורים פיזיים. לא אהבתי את ההרצאות שלו והיה כמעט בלתי אפשרי לעקוב אחריהן ולהבין אותן.\nגם הוא, מניח שאנחנו יודעים חומר בסיסי במתמטיקה וב*הנדסת חשמל*, מה שלא נכון...\n\nשם המתרגל/ת: בני\nחוות דעת - תרגולים: \nמתרגל ממש אחלה. \nהסביר הרבה יותר טוב מהמרצים. \nהתרגולים הצילו את הקורס, בהם באמת למדנו ו*הבנו* את החומר. \nשימו לב- בתרגולים בחלק של דורי גם ממש למדנו חומר חדש ולא רק תרגלנו :(\n\n\nשעורי הבית: \nמגיעים פעם בכמה שבועות ודי קשים, אבל אפשריים.\nכל פעם עוברים על החומר שלמדנו עד אז. קצת קשה להבין בהם מה לעשות. \n\nהמבחן: \nקשה :( \nאם אומרים לכם שהוא יהיה קל אל תאמינו להם.\n\nהשורה התחתונה: \nקורס שלא מבינים מה רוצים ממך בו.\nלאורך הסמסטר בחלק של דורי הוא דווקא היה בסדר, לקראת הסוף נהיה נורא.\nאפשר להצליח לעבור בו.", "timestamp": 1678641010410}, {"author": "Idan Orgad", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: נחמדים. כדאי להיעזר בקבוצות נוספות\n\nהמבחן: יותר קשה ממה שחושבים\n\nהשורה התחתונה:", "timestamp": 1678891857675}]}