{"posts": [{"author": "אנדרה איגואדלה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: \nהיו הרצאות ממש מעניינות (פרט אולי לאחת) לאורך הסמסטר, אסף מעביר אותם באווירה מאוד נעימה ומעניינת, מתייחס לשאלות ועונה עליהם בצורה עניינית ומדויקת. אמנם הנוכחות לא חובה בקורס ,אבל אני ממליץ כן להגיע כי בסופו של דבר מה שדובר עליו בהרצאות היה במבחן - על המצגות של אסף לא כתוב הרבה (את הרוב המוחלט הוא אומר) ואמנם הסיכומים שכתבו סטודנטים בקורס היו טובים אבל לא כיסו באמת את הכל. בנוסף, ממליץ לעשות את שאלות החזרה שהוא נותן בסוף כל הרצאה, הן לוקחות גג 10 דקות והן הופיעו במבחן\n\nשעורי הבית: אין\n\nהמבחן: \nמבחן מעולה ביחס למל\"ג, בשאלות הוא לא נכנס לפינות אלא שואל באופן מאוד כללי על העקרונות שנלמדו בקורס. מי שהיה בהרצאות + למד 4 שעות לפני + עשה את שאלות החזרה שאסף נתן גם לאורך הסמסטר וגם לקראת המבחן, יוציא 100 או 90 גבוה.\nהשורה התחתונה: \nהיה כיף ומעניין לאורך הסמסטר, לא עמוס בכלל והמבחן סבבה לגמרי. מל\"ג מומלץ, תיקחו בלי לחשוב פעמיים", "timestamp": 1688718558383}, {"author": "spaaa", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: \nמעביר את ההרצאה בצורה הכי כיפית שיש, עונה על השאלות שנשאלות בכיתה, ומגיע מוכן להרצאה.\n\nשם המתרגל/ת: \nאין תרגולים.\n\nחוות דעת - תרגולים:\nאין תרגולים.\n\nשעורי הבית:\nאין שיעורי בית אבל בסוף כל הרצאה הוא מעלה למודל קובץ שאלות חזרה לוקחים בערך 15 דקות.\n\nהמבחן: \nקל מאוד, כמעת 90% משאלות המבחן היו מקבצי שאלות חזרה במודל.\n\nהשורה התחתונה: \nמומלץ מאוד והחומר מעניין, הקורס לא עמוס ואין שיעורי בית וגם כן הממוצע מאוד גבוה, ואין נוכחות חובה בקורס.", "timestamp": 1689010741828}, {"author": "אוסטרלופיטקוס בויזיאיי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: \nמעניינות בטירוף! אין מה להוסיף. אסף מרום מלך! \n\nשעורי הבית: אין\n\nהמבחן: 95% מהשאלות הן שאלות ממוחזרות משאלות התרגול שפורסמו כל שבוע. אם פתרתם את שאלות התרגול יש לכם ציון 90. עוד 10 נקודות על קריאת הסיכום לפני המבחן. \n\nהשורה התחתונה: מלג מומלץ", "timestamp": 1689190718384}, {"author": "kl", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: אחד המרצים הטובים שיצא לי לפגוש בטכניון, מעביר את ההרצאות בצורה מאוד מעניינת וגורם לך באמת להתעניין בתחום שלא נשמע בהכרח מעניין לפני זה. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין, ואין נוכחות חובה\n\nהמבחן: אסף העלה בסוף כל הרצאה שאלות לדוגמה, חלק גדול מהן הופיע במבחן כמו שהן וחלק היה מאוד דומה, לא קשה להוציא ציונים גבוהים אבל כן דורש קצת למידה לפני המבחן.\n\nהשורה התחתונה: תענוג של מלג, מומלץ", "timestamp": 1689494203894}, {"author": "לוסי אהובתי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: הייתי באחת, היה וויב טוב\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים:- \n\nשעורי הבית: אין\n\nהמבחן: אסף מפרסם בכל סוף הרצאה רשימת שאלות, מתוך ה40 שאלות שהיו במבחן בערך 35-36 היו מתוך השאלות שהוא פרסם, למדתי את כל החומר בערך ביומיים מהסיכום של סתיו אבירם המלכה\n\nהשורה התחתונה: תיקחו, אחלה מלג, אחלה אסף, אחלה סתיו והכי חשוב - אחלה ציון", "timestamp": 1689758356853}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אסף מרום\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהיה מבחן הוגן, שהתבסס בעיקר על שאלות חרה שניתנו אחרי כל שיעור. היה כמה מקומות שבהן הוא שם תמונה קצת שונה מהתמונה מהתרגילים וזה היה מאוד מבלבל.\nהשורה התחתונה: \nקורס דיי מעניין, למי שמתעניין קצת במוצא האדם. מה שכן הוא כולל לא מעט חומר וצריך לזכור ממש הכל למבחן. דורש קצת יותר השקעה ממל\"ג רגיל.", "timestamp": 1690463296545}, {"author": "שם או כינוי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "קורס מאוד נחמד ומעניין. אסף מרצה מאוד טוב ויודע למלא את החדר גם בכיתה של 200 סטודנטים.\n \nאפשר להגיע ואפשר גם לא להגיע, אם כי החומר מאוד מעניין ואסף מעביר אותו טוב אז כדאי לנסות לבוא לשמוע לפני שמחליטים לא.\n\nשימו לב לשאלות שאסף מפרסם במהלך הסמסטר (אם הוא ימשיך לעשות את זה), המבחן בסך הכל הוגן ומורכב משאלות בסגנון שאלות אלו, בלי הרבה חידושים.", "timestamp": 1694437925990}, {"author": "כסף ואלכוהול", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nאסף מרום\nחוות דעת - הרצאות: \nמרצה פצצה. ההרצאות של אסף ברמה ממש גבוהה, נותן מלא פרטים ממש מעניינים והוא ממש נלהב בנושא הלימוד הזה. אסף מלמד באנרגיה ממש גבוהה וזה מדבק וגורם להתעניין. אני חושב שאסף גם מנגיש את התחום הזה של מחקר האבולוציה וגורם להבין ממש טוב את העקרונות המנחים שלו.\n\nשעורי הבית: \nאין\n\nהמבחן: \nמבחן אמריקאי. אסף פרסם לנו סך הכל משהו כמו 60 שאלות חזרה למודל במהלך הסמסטר. המבחן הסופי 30 שאלות הועתקו מהשאלות חזרה האלה מילה במילה, 5 היו שינוי קטן עליהם ו5 שונות. המבחן היה בדיחה, אסף פשוט נתן לנו את המבחן ומי שעבר על השאלות לפני המבחן הצליח.\n\nהשורה התחתונה: \nמלג מעניין רצח, אפשר לדעת את זה כי היינו רשומים 200 אנשים בערך, וסגו היה מלא לגמרי עד סוף הסמסטר, זאת אומרת שהרוב הגדול החליט לבוא להרצאות. אין שיעורי בית אין עומס ומבחן הכי קל שהיה לי בתואר. בחירה הכי קלה שיש. מל\"ג מומלץ!", "timestamp": 1704030813034}, {"author": "Lucy", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אסף מרום\n\nחוות דעת - הרצאות: לא הלכתי להרצאות, קראתי את הסיכום והיה מעניין (מעניין לקריאה). אם מישהו מנסה לזכור הכל בעל פה זה ממש קשה.\n\nשעורי הבית: אין, המרצה היה מפרסם דף של 5-10 שאלות חזרה (עם התשובות) אחרי כל הרצאה.\n\nהמבחן: ניגשתי רק למועד ב' , לא מן הסתם הממוצע היה 84. המבחן היה זוועה כי המרצה הביא כמה שאלות טובות משאלות החזרה שהיה מפרסם, ושיחק בניסוח של אחת מהתשובות. למשל: להחליף את המשפט \"בעל נפח 600 סמק\" ב \"בעל נפח 900 סמק\",  במקום \"שן\" הוא רושם \"שיניים\" , הוסיף את המילה \"לא\" לפני התשובה וכדומה. (כך שכל שינוי קטן יהפוך את התשובה מנכונה לשגויה או להפך)\nאז נכון שהמרצה יכול להביא מה שהוא רוצה, ונכון שהסטודנט אמור ללמוד הכל, אבל ממש קשה לזכור כל מילה בסיכום של 60 עמודים בעל פה ולהגיע לרמה זו של דקויות קטנות ובמיוחד שנרשמתי לקורס כמל\"ג.\n\nהשורה התחתונה: החומר עצמו יכול להיות מעניין לחלק מכם, אבל במידה והמבחן יישאר בצורה כזאת אז כדאי להתרחק ממנו.", "timestamp": 1704916860880}, {"author": "Duuuun", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "המבחן: \nניגשתי רק למועד ב׳, יש לי רק משפט אחד על הקורס תעשו עם הידע הזה מה שבא לכם: \n\nנרשמתי לקורס כמל״ג, הבטיח שהוא מתכוון לממוצע של מל״ג בתחילת הסמסטר, לא אכפת לא ולא פרסם אפילו הודעה אחת על זה שההמוצע של מועד ב׳ הוא 84. \n\nלא ממליצה, לפחות לא כמל״ג", "timestamp": 1704917751472}]}