{"posts": [{"author": "אורן", "difficultyRank": 1, "generalRank": 2, "semester": "201901", "text": "שם המרצה: עבאסי\nחוות דעת - הרצאות:  -\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  -\n\nשעורי הבית: \n\nהמבחן: \nמבחן אמריקאי של בערך 65 שאלות בנוסף מותר להכניס 4-6 עמ', אפשר ללמוד כמה ימים לפני המבחן ולהוציא ציון טוב, עם אפס השקעה במהלך הסמסטר.\nהשורה התחתונה:", "timestamp": 1599497198613}, {"author": "ביורפואן אקראי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דרור / יעל יניב / אמיר לנדסברג / עבאסי\nחוות דעת - הרצאות: רובן מזעזעות ומרגישות כמו דף ויקיפדיה מוקרא. באופן פרטני: 1. דרור - התאיישתי מהר מההרצאות ולמדתי מהסיכום המושלם בדרייב, אין צורך להגיע. 2. יעל יניב - חשוב להגיע להרצאות כי היא יצירתית להחריד בשאלות למבחן. האם זה עוזר לדעת את התשובה אליהן ברגע האמת? לא. 3. אמיר לנדסברג - האיש והמספרים. כל מספר שהוא אומר בהרצאה להדגיש ולמרקר כי הוא לחלוטין ישאל עליו במבחן. חשוב מאוד למבחן להבין את החומר שלו לעומק כי הוא מתקיל (ממליץ על יוטיוב תכלס). 4. עבאסי - המרצה היחידי שההרצאות שלו היו מעניינות לדעתי, אם כי מהירות 1.75 תעשה להן רק טוב. דף הנוסחאות בדרייב מקיף בצורה טובה את כל החומר על הכליות.\nהמלצה - ריאות = סיכום. יעל = ללכת להרצאות. אמיר = נשימה עמוקה וללכת להרצאות+יוטיוב. עבאסי = אפשר להסתמך על דף הנוסחאות.\n\nשם המתרגל/ת: עידו וייזר ביטון\nחוות דעת - תרגולים: אחלה מתרגל, מאוד אכפת לו שהסטודנטים יבינו את החומר, בקיא מאווווד בנושאים. \n\nשעורי הבית: קלים וממוחזרים.\n\nהמבחן: הרבה ממוחזר (בעיקר ריאות וכליות) אבל גם יכול להיות מפתיע (יעל ואמיר).\n\nהשורה התחתונה: קורס רפואי מעניין אבל לא קל מבחינת הרצאות.", "timestamp": 1647764728669}, {"author": ";", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דרור: מלא גרפים שמתישהו כבר קשה לעקוב אחריהם, סביר\nיעל יניב: עוד פעם עם הקטע של כיתה הפוכה, בדיוק כמו בביופיזיקה.\nאמיר: זורק המון נתונים שנשמעים כמו העשרה (כמו כמה כח סוס הלב מיייצר או משהו כזה) אבל בסוף שואל גם על הדברים האלה במבחן, קשה להתמקד.\nעבאסי: סבא חמוד סה\"כ\nחוות דעת - הרצאות:  תלוי מרצה, בגדול המון פרטים טכניים לא ממש מובנים\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: אין המון תרגולים, אבל משתדל להשקיע ולעזור\n\nשעורי הבית: לא לקוחים הרבה זמן, קצת מטלות פתוחות שלוקות קצת יותר זמן. יש גם בחנים בחלק גדול של ההרצאות בתחילתן, כדאי לעבור 5 דקות לפני השיעור על הדברים ולקבל עוד 10% לציון הסופי\n\nהמבחן:  מלא נתונים מתקטננים, לפחות יש דפי נוסחאות למלא בכל פרט קטן שהמרצין כתבו בתקווה שיופיע גם במבחן ושלא ישאלו על חייזרים (גם זה קורה)\n\nהשורה התחתונה: ביופיזיקה 2 אבל יותר טכני עם פרטים קטנים ודף נוסחאות שהוא  בתכלס דף למילוי מלא פרטים קטנים שלך תזכור", "timestamp": 1676671351261}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: כולם\nחוות דעת - הרצאות: כמעט בלתי אפשרי לשבת בכיתה ולשמוע הרצאות. המון חומר, המרצים מלמדים לא תמיד לפי סדר הגיוני וקופצים קדימה אחורה. אני למדתי הכל מחדש למבחן ולא טרחתי להגיע להרצאות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים:  יש רק 6 תרגולים בסמסטר.\n\nשעורי הבית: \n\nהמבחן: יש 20% בחנים שכדאי מאוד להוציא בהם ציון גבוה + 10% ש\"ב (אותו כנ\"ל). המבחן לא קל. 5 ימי למידה שבהם עוברים על כל המצגות וכותבים הערות בדף נוסחאות + לקרוא את הסיכומים הרלוונטיים בדרייב (יש לא מעט ויש כאלה שלא עוזרים) + דף נוסחאות טוב - אפשר להוציא ציון טוב. כמו כל קורס של רפואה/ביולוגיה: דרושה חרישה רצינית..\n\nהשורה התחתונה: ביופיזיקה 2", "timestamp": 1679213508934}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nכל ההרצאות משעממות ועוד בשעות כאלה מאוחרות בטח שאי אפשר להקשיב. בדיעבד חבל שהלכתי. עדיף לראות הקלטות בזמן חופשי ולסכם/לתמלל לפני המבחן\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: \nלראות הקלטות תרגולים של עידו ( יש הכל חוץ מכליה) כי אי אפשר לשבת עד 18:30 בערב בתרגול \nשעורי הבית: \n\nהמבחן: \nסהכ פייר, אמיר תמיד ינסה להתקיל לא משנה על איזה צד הוא קם הבוקר\nהשורה התחתונה: קורס הקלטות וסיכום עצמאי", "timestamp": 1713766693829}, {"author": "שלושת רבעי מהנדס", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: כל המרצים\nחוות דעת - הרצאות: וואו, הרמה מזעזעת.. עידו (?) הצטרף להיות מרצה והלוואי שכולם היו כמוהו, כל השאר פשוט מביך ומתסכל\n\nשם המתרגל/ת:  \nחוות דעת - תרגולים: תומר היה סבבה\n\nשעורי הבית: לא עמוסים ובסדר ברובם, חלק היו לא מובנים \n\nהמבחן:\n\nהשורה התחתונה: תמצאו סיכומים טובים ותחרשו, סהכ הקורס עצמו לא כזה עמוס אבל מקשה מאוד כשהמרצים כאלה.", "timestamp": 1713980454889}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: הרוב- מגרוע עד זוועה, אמיר- זוועה במיוחד. עידו הצטרף השנה כמרצה והציל את הקורס הזה. הקטע של להחליף שוב מרצים חזק בפקולטה ועדיין לא עובד.\n\nשם המתרגל/ת: אידה/ תומר\nחוות דעת - תרגולים: לא מוצלחים, מוסיפים חומר ולא באמת מספיקים לעבור על כל החומר מההרצאות (עוד פעם הקטע של הרצאות במקום תרגולים).\n\nשעורי הבית: עניין של כמה דקות, לא מובנים וכמעט לא קשורים להרצאות.\n\nהמבחן: מועד א לפחות היה סבבה, דף נוסחאות טוב הכרחי \n\nהשורה התחתונה: אם רוצים ציון טוב- לא חייבים לבוא להרצאות, אבל להיות על הסיכומים (לא חסרים סיכומים ותמלולים בדרייב) לאורך הסמסטר- כמות החומר מטורפת ללמוד בשלושה ימים שיש.", "timestamp": 1714204977980}, {"author": "ביורפואיי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: כולם זבל במיוחד אמיר לנדסברג שכנראה עם חרדת נטישה והתבאס שסטודנטים באים להרצאה שלו רק כדי לעשות בוחן שהוא החליט שיעביר באופן פרונטלי למרות שזה לא היה ידוע מראש... רק עידו וייזר תותח \nחוות דעת - הרצאות: לא ללכת\n\nשם המתרגל/ת: לא ללכת\nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים\n\nהמבחן: סה\"כ בסדר אבל מלא חומר עמוס מאוד \n\nהשורה התחתונה: אחלה קורס שהפך להיות חרא קורס בגלל הסגל הכושל הזה שזורק על הסטודנטים כל סמסטר מחדש ולא מוכן לעשות כלום כדי להקל עלינו, אפילו למצוא את הפתרון רשמי למועד א' היה לא פשוט כי כמובן שזה לא יעלה למודל בצורה נוחה, ונתנו יום אחד בלבד להגיש ערעורים....", "timestamp": 1714680223208}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: הברזתי כמעט מכולן שהייתי צריכה להיכנס למודל כדי להיזכר בשמות של המרצים. \nחוות דעת - הרצאות: \nדרור - הרצאה ראשונה הייתה סבבה, בשנייה היה זוועה ומאז הפסקתי ללכת.\nקתרין - עשתה הרצאה אחת שהייתה בסה\"כ סבבה באופן מפתיע.\nאמיר לנגסברג - ניראלי שהייתי רק בהרצאה אחת וגם שם לא הקשבתי למילה. שימו לב שאמיר לא אוהב סטודנטים ובעיקר אוהב להתנקם בהם בצורת שאלות קשות במבחן ואי העלאה של הקלטות, אז אולי אם תתחבבו עליו יהיה בסדר.\nעידו ווייזר - תותח שאין דברים כאלה, אחד המרצים הטובים שהיו לי. מומלץ מאוד להגיע להרצאות שלו.\nזייד עבאסי - חמווווד!!!! הרצאות מאוד מעניינות ומונגשות לעם, עבאסי מוריד את החומר לרמה של הסטודנטים ובאמת מעביר אותו טוב ומעניין. הוא קצת מרדים אבל אני אהבתי את ההרצאות שלו.\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: חסרי תועלת, אולי שווה ללכת כדי לא לראות את החומר פעם ראשונה כשלומדים למבחן וגם כי המתרגלים כותבים 6 שאלות במבחן. \n\nשעורי הבית: לא ברור מה הקשר של תרגילי הבית לקורס הזה. רפרנסתי את כולם ב100% והם גם לא קשורים למבחן אז באמת אל תבזבזו על זה את הזמן.\n\nהמבחן: ממש חששתי אבל היה הוגן ויחסית קל. צריך לבוא עם דפי נוסחאות טובים כי בסופו של דבר זה מה שתפתרו איתו את המבחן. לתרגל הרבה מבחני עבר! דרור ממחזר שאלות. אמיר כותב שאלות הזיה מומלץ להכניס כמה שיותר מידע בדף נוסחאות על אלסטנס, חוק לפלס וחוק פרנק סטרלינג ויהיה בסדר. כמו שהבנתם לא השקעתי בקורס הזה בכלל וקיבלתי 90+ במבחן אז יש תקווה עם סיכומים טובים ודף נוסחאות מעולה.\n\nהשורה התחתונה: אין מה לעשות, קורס חובה, דף נוסחאות טוב+סיכומים טובים+תרגול מבחני עבר=ציון גבוה.", "timestamp": 1715020640042}]}