{"posts": [{"author": "רוני קשת", "difficultyRank": 1, "generalRank": 4, "semester": "201901", "text": "חוות דעת - הרצאות: כמו הרבה קורסים ברפואה, יש הרבה מרצים לקורס שכל אחד מעביר חלק, החסרון הגדול בזה הוא שיש לפעמים סטירות בין המרצים, לכל מרצה יש את הסיגנון שלו והקצב שלו אז זה גם קצת מקשה, אבל באופן כללי רוב המרצים לא רעים, אסיה מרצה ממש טובה באופן בולט.\n\nהמבחן: יש הרבה מאוד חומר ולא מעט שצריך לזכור בע\"פ כל מני שמות של פקטורים בתהליכים שונים, אבל המבחן היה מאוד הוגן ויש דוגמאות למבחנים בכל מני דרייבים אז יש איך להבין מראש מה רמת השאלות, מאוד מומלץ לעבור לפני על מבחן או שניים לפחות כדי לא להיות מופתעים\n\nהשורה התחתונה: קורס מאוד מעניין, מערכת החיסון היא עולם מדהים ומרתק, כקורס לפעמים קשה קצת לעקוב ולזכור הכל למבחן בסוף, אבל קורס טוב למי שאוהב את הנפלאות של הביולוגיה", "timestamp": 1600856393805}, {"author": "אימונולוגיה בסיסית", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "חוות דעת - הרצאות: יש 4 מרצים בקורס (לא ברור למה) אז קשה להתאפס על ההוראה אחריי כל חילוף כי הם מסבירים בסגנון וקצב שונה, בפרט שכל מרצה כמעט ולא מקשר את החלק שלו באופן אקטיבי לחלקים האחרים ככה שהלמידה מרגישה לא רציפה.\nאסיה ודורון מרצים סבבה לגמרי, דבי ונתי פחות. נתי לרוב מספר סיפורים, עד שמאבדים את הראש בין עיקר לטפל ומה שהוא לא עושה זה להסביר את החומר עצמו בצורה ברורה ורץ מהר מדי איפה שצריך להתעכב, ככה שלנסות לסכם את ה\"חומר\" שהוא מעביר למשהו פרקטי בסוף זה סיוט מהגיהינום.\nבאופן כללי ההתנהלות של כל הסגל בקורס זוועתית בין אם זה במיילים או במבחן עצמו, ניכר הזלזול והניכור מצדם.\n\nהמבחן: בדרך כלל הרבה שאלות ממוחזרות, אם כי השנה הם החליטו להיות קצת יותר יצירתיים עם השאלות. באופן כללי יש הרבה שאלות שמתבססות באופן מוחלט על פרט קטן או פיסת מידע שנאמרה במשפט אחד מתישהו בהרצאה, בדגש על השאלות של דורון ונתי. השאלות של נתי כמו כל שנה גם מנוסחות בצורה גרועה בחלקן (מילולית ו/או עם שגיאות כתיב), וגם ניכר כי מכילות דברים שאו שכלל לא נאמרו בהרצאות ולא ברור מאיפה הדבר הזה נפל, או שכן נאמרו אך כהערת אגב/בדיחה/אנקדוטה \"מעניינת\" מטעמו שייתכן כי במקרה גם הועברה בחצי דקה האחרונה של השיעור, פויה נתי ! - מומלץ להכין קובייה לחלק הזה.\n\nהשורה התחתונה: החומר עצמו מאוד מעניין, המבחנים לא להיט.", "timestamp": 1612349385274}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אסיה, דבי, דורון, נתי\nחוות דעת - הרצאות: מפוצלות - חלק יותר טובים, חלק פחות. החומר מאוד מבולגן והמרצים לעתים חופפים או סותרים אחד את השני. בסוף החומר מאוד מעניין, רלוונטי ועכשיוי. \n\nהמבחן: אמרקאי, שאלות רנדומליות - חלק בקושי הופיעו או ניתנו כהערות - לתרגל המון. חלק ממוחזר.\n\nהשורה התחתונה: קורס מאוד מעניין אבל מועבר בצורה לא טובה. להישאר בעניינים ולהנות מהחומר.", "timestamp": 1616312875511}, {"author": "אני", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יש כמה\nחוות דעת - הרצאות: מעניינות אך קשות לעיכול. המון חומר בזמן קצר\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: חשוב ללמוד אליו טוב כי אין מגנים. מבחן קשוח עם המון המון חומר לשינון, מלא בדקויות ושינון שמות של כל מיני ציטוקינים. נראה בלתי אפשרי בהתחלה אבל לא להיבהל, צריך לקרוא טוב טוב את החומר ולתרגל כמה שרק אפשר מבחני עבר, בסוף העיקרון של השאלות קצת חוזר על עצמו.\n\nהשורה התחתונה: קשה ומורכב אבל מעניין מאוד!", "timestamp": 1678960336430}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: דורון מלמד ועוד\nחוות דעת - הרצאות: ההרצאות של ארי גלסנר היו קשות לעיבוד וקשה להבין אותה. ההרצאות של דורון, נתי ודבי היו מעניינות אבל לדעתי הם יותר מידי מתעכבים על נושאים נישתים ולא באמת נותנים הסברים מעמיקים על הבסיס. זה גורם לידע מאוד ספציפי אבל בסיס ידע חלש.\n\nהמבחן: מבחן מאוד קטנוני, ניסוחים ממש גרועים של שאלות, ושאלות על נושאים מאוד ספציפיים שככל הנראה לא נאמרו בהרצאה. הרבה שאלות שלא באמת בודקות הבנה של החומר, אלא שינון של דברים לא רלוונטיים. \n\nהשורה התחתונה: המבחן מבאס והתוכן לדעתי לא מועבר בצורה נכונה, אבל התחום כל כך מעניין שבשבילי זה שווה את זה. מה שכן אם זה לא חובה, עדיף לבוא בתור שומע חופשי, לא לבנות על ציון מדהים..", "timestamp": 1716114444390}]}