{"posts": [{"author": "idan w", "semester": "201902", "text": "בסמסטר הכתר הקורס הועבר בצורה בזיונית. היתה קבוצת הרצאה אחת וקבוצת תרגול אחת, והמשקל כרגיל הושם על איך לפתור שאלות יותר מאשר על להבין מה בעצם עושים. שיעורי הבית בכלל לא משקפים את החומר הנלמד וצריך להעסק יותר בלהבין את השאלות שמנוסחות מעורפל או להבין את הרזולוציה של הגרפים. את המבחן בכלל העביר מרצה אחר מהמרצה שלימד אותנו, וכמובן שהיו כמה שאלות לא ברורות ולא פיקטרו. הדבר הכי גרוע בקורס הזה הוא המעבדות: המעבדות לא מופיעות במערכת ואז צריך לדחוס אותן איפשהו כשזה גם ככה סמסטר עמוס. בכמה פעמים הנושא של המעבדה בא לפני שהוא נלמד בהרצאה ובעצם מכלה את התכלית של הבנה מעמיקה של החומר. המעבדות עמוסות ולוקחות המון זמן והציונים עליהן נעים סביב ה-90.\nההיסטוגרמות שהם משחררים הן אחרי חישוב של 10% ש.ב ו20% מעבדות (תקפים) כך שהממוצע נראה גבוה סתם.\n\nבקיצור לא מומלץ בכלל!!", "timestamp": 1595917256000}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות:\n\nשם המתרגל/ת: חן משה\nחוות דעת - תרגולים: כאילו עושה טובה שהיא מלמדת בכלל, לא קראה אפילו את המצגות לפני התרגול. \n\nשעורי הבית: קצרים אך לא באמת קשורים למה שנלמד.\n\nהמבחן: יחסית הוגן אבל הרבה שאלות שמנוסחות ממש רע ככה שמאבדים נקודות סתם.\n\nהשורה התחתונה:", "timestamp": 1597944683876}, {"author": "Yaakov L.", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אבנר רוטשילד\nחוות דעת - הרצאות:\nמרצה נחמד אבל מעט מונוטוני דבר שמקשה לעקוב\nשם המתרגל/ת: עמי אזולאי\nחוות דעת - תרגולים: \nמתרגל נהדר, מסביר את החומר בצורה נפלאה\nשעורי הבית: \nכל שבוע אבל לא לוקחים יותר מידי זמן\nהמבחן: \nלא קשה במיוחד\nהשורה התחתונה:", "timestamp": 1598347580991}, {"author": "Shai Baruch", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אבנר\nחוות דעת - הרצאות: לימוד עם מצגות דרך הזום זה מספיק קשה, אבל בקורס הזה כל המצגות כתובות באנגלית. אבנר נראה נחמד בסך הכל אבל קשה להפריד בין העיקר לטפל כי הוא מדבר על המון דברים ולפעמים מסיימים הרצאה ולא באמת יודעים להגיד מה למדנו\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: בתרגולים יש מצגות טובות. חן נשמעת עייפה כמעט כמוני למרות שהתרגול היה ב10 וחצי\n\nשעורי הבית: לפעמים ממש קל ולפעמים גיהנום. מצפים שתסיקו נתונים מדוייקים מאוד דרך גרף שנמצא במודל (כלומר על המסך של המחשב), כשהגרף עצמו ברזולוציה של פיקסל וחצי.\n\nהמבחן: מעיק ומעצבן. מרגיש שמנסים להפיל אותך על קטנות בשביל להשיג התפלגות ציונים גאוסיינית, בטח שלא מנסים לבחון את רמת הידע שלך. מצד אחד הם לא רוים שיהיו ציונים גבוהים ומצד שני הם עצלנים מדי כדי לבדוק מבחנים עם שאלות פתוחות, וכמובן שהסטודנטים מפסידים\n\nהשורה התחתונה: חומר לפעמים מעניין, פורמט מאוד גרוע וסגל פושר. מאמין שיהיה הרבה יותר טוב בסמסטר פרונטלי, אבל אין לדעת. לגבי המעבדות - תזהרו מדיאנה למה הרמה שהיא דורשת הרבה יותר גבוהה משאר המדריכים", "timestamp": 1598379570371}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: אבנר\nחוות דעת - הרצאות: לא טובות מבחינתי, העדפתי לשמוע מוקלט של קורס מקביל (בפקולטה לאווירו)\n\nשם המתרגל/ת: חן\nחוות דעת - תרגולים: לא מועברים בצורה מיטבית, אפשר גם לעבור על המצגת מבלי לראות את התרגול המוקלט\n\nשעורי הבית: סבירים\n\nהמבחן: הוגן\n\nהשורה התחתונה: מעבדות תחת המדריכה דיאנה מייר- לא להתקרב! הציונים אצלה מנורמלים ל75 בערך", "timestamp": 1599553603215}, {"author": "חייב?", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: היו סבבה, היה הרבה טעויות שלהם כשהזנת תשובה נכונה והמודל לא קיבל והיה צריך להתעסק בזה מול הסגל\n\nהמבחן: מלא תיאוריה ולא הכי נחמד\n\nהשורה התחתונה: קורס מעניין אבל הסגל לא הכי משקיע בקורס הזה", "timestamp": 1601882517906}, {"author": "יאיר ריינגוירץ", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: בועז פוקרוי\nחוות דעת - הרצאות:  תותח על מהחלל, בועז והמקל שלו מסבירים את החומר בצורה שאי אפשר להתחרות בה עם המון מטאפורות ודימויים מהחיים האמיתיים\n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: מתרגלת סבבה, מומלץ לראות את התרגולים בהקלטות מיד לפני או תוך כדי הכנת שיעורי הבית\n\nשעורי הבית: לא קשים מאוד ולא קלים מאוד, יש רק 2 ניסיונות אז חשוב לרפרנס", "timestamp": 1625044134531}, {"author": "Malachy Mihlin", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: בועז פוקרוי\nחוות דעת - הרצאות: בועז מרצה פשוט תותח - מסביר מעולה את החומר, ממחיש אותו עם דימויים ומטאפורות שעוזרות לזכור ואכפת לו מאוד מהסטודנטים. תמיד היה קדימה בחומר ושחרר מוקדם מההרצאות. ממליץ מאוד.\n\nשם המתרגל/ת: לוטן פורטל \nחוות דעת - תרגולים: מתרגלת טובה מאוד ומסבירה טוב את החומר. מומלץ לראות את ההקלטות מהסמסטר הזה תוך כדי פתירת תרגילי הבית או לעשותם מיד אחריהן. \n\nשעורי הבית: יוצאים אחת לשבוע ולא קשים במיוחד. חשוב לבדוק עם סודנטים אחרים את התשובות לפני שמגישים בגלל שיש רק 2 נסיונות.\n\nהמעבדות: לא מסונכרנות עם החומר הנלמד ודורשות למידה והכנה לקראתן גם אם החומר טרם הועבר בהרצאה. דורשות הרבה זמן והשקעה, אך מצד שני תורמות מאוד להבנת החומר. \n\nהשורה התחתונה: קורס מאוד מעניין. מבחן מאוד הוגן וברובו תיאורטי. עם הקשבה שוטפת בהרצאות ובתרגולים, יחסית פשוט מאוד ללמוד אליו.", "timestamp": 1626635626172}, {"author": "תרנגול האפרשזיף", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: בועז פוקרי\nחוות דעת - הרצאות: בועז מרצה מעניין מאוד, מסביר ברור, ובשיעורים הייתה אוירה נעימה. מזהיר מראש שיש לו חוש הומור קצת מקאברי ומאוד לא פוליטיקלי קורקט, אבל מי שמסוגל להתמודד עם זה ולא להפגע, מצפה לו אחלה מרצה!\n\nשם המתרגל/ת: עמרם\nחוות דעת - תרגולים: עמרם מתרגל טוב, מסביר ברור ורואים שהוא פשוט אוהב את התחום של חומרים. \n\nשעורי הבית: השיעורים סבבה. הדבר שממנו צריך להזהר זה המעבדות ובמיוחד הדוחות מעבדה!!! הם קשים ולוקחים הרבה זמן למי שלא מרפרנס הכל, והמעבדות לא בסדר של החומר כך שלי למשל יצא לעשות מעבדה בשבוע השני או שלישי, על חומר של אחד השבועות האחרונים בקורס. אבל ממה שהבנתי הולכים לשנות את המבנה של זה.\n\nהמבחן: הוגן לגמרי\n\nהשורה התחתונה: קורס מעולה, באמת נהינתי", "timestamp": 1629394665488}, {"author": "ג", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אבנר רוטשילד\nחוות דעת - הרצאות: אבנר בחור סבבה, אחרים אמרו שזה הסיח את הדעת אבל אני אהבתי את ההרחבות שלו על החומר הנלמד (אבל אני התעניינתי בחומר הקורס).\n\nשם המתרגל/ת: לוטן פורטל\nחוות דעת - תרגולים:  מתרגלת לא רע, קצת רצה על החומר אבל בסמסטר קורונה יש הקלטות אז תמיד אפשר לראות שוב.\n\nשעורי הבית: השיעורים במודל נחמדים ולא דורשים הרבה עבודה, דוחות המעבדה דורשים המון זמן ולא פשוטים בכלל. המעבדות עצמן אבל נחמדות וממש עוזרות להבין את החומר התיאורטי (בדרך כלל).\n\nהמבחן: מבחן הוגן, ממוצע גבוה(רק נכשל אחד אני מאמין). רק לחזור קצת על החומר ולעשות כמה מבחנים.", "timestamp": 1634645821747}, {"author": "pokobar", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: -\nחוות דעת - הרצאות: לא הלכתי רוב הסמסטר, היה יחסית מיותר ומאוד משעמם כי הוא מרח חומר של שעה ל3 שעות\nשם המתרגל/ת: לוטן/דניאלה/איתי\nחוות דעת - תרגולים: קודם כל, הצוות מתרגלים היה מדהים. הם היו מלאי אנגריה ורצון לעזור ומבחינתי זה מה שהפך את הקורס לדיי כיפי (בסך הכל גם החומר היה לא רע)\n\nשעורי הבית: כן קשורים לחומר אבל לא מדהימים וגם לא ארוכים במיוחד\n\nהמבחן: הוגן, בחלקו הקטן ממוחזר גם\n\nהשורה התחתונה: תשקיעו בתרגול וכמה ימים לפני למידה אמיתית ויהיה מגניב", "timestamp": 1658429735207}, {"author": "mip", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אבנר/דן\nחוות דעת - הרצאות: התחלקו חצי סמסטר, בגדול המצגות של הקורס מזעזעות, כתובות באנגלית ועמוסות. המרצים משתדלים ממש אבל זה די משעמם בהרצאה. החומר עצמו מעניין\n\nשם המתרגל/ת: לוטן פורטל\nחוות דעת - תרגולים: אחלה של מתרגלת! מסבירה ממש טוב את הרקע בכל תחילת תרגול. \n\nשעורי הבית: שיעורי בית לא ממש קשים, הקורס די נוסחאתי. \nהדוחות יכולים להיות מעצבנים- לא להשקיע בטירוף בגדול רק רוצים לראות שביצעתם את הניסוי וידעתם להסיק מסקנות רלוונטיות- הם כן מקבלים הרבה נפח מהציון אז לא לזלזל\n\nהמבחן: הוגן\n\nהשורה התחתונה: יש מלא סרטונים ביוטיוב שעוזרים להבין כל נושא", "timestamp": 1658763148423}, {"author": "L", "difficultyRank": 5, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אבנר ודן\nחוות דעת - הרצאות: הרצאות ארוכות ומעייפות,אבנר מלמד לעט מאוד בהרצאה,דן לימד בקצב יותר מהיר.3 שעות הרצאה זה קשה.\n\nשם המתרגל/ת: בר ודניאלה\nחוות דעת - תרגולים: מתרגלות טובות מהן, בתרגולים לומדים את נושאי הקורס יותר טוב מהרצאה.\n\nשעורי הבית: נוראים בעיקר תרגילים מעשיים.\n\nהמבחן: נוראי\n\nהשורה התחתונה: קורס נוראי וגם יש בו רק שעת תרגול אחת ולא מספיקה.", "timestamp": 1659109757813}, {"author": "Igal V", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אבנר ודן\nחוות דעת - הרצאות: \nבזבוז זמן. המרצים סתם מורחים שלוש שעות בלי להעביר חומר. היה אפשר להעביר את זה בארבעים דקות ולא בשלוש שעות.\nאין מה להגיע\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: יש לה יותר ידע מלכל צוות הקורס יחד, אין עליה. אפילו בזום היא סבבה.\n\nשעורי הבית: \nחרטא ברטא, לא תמיד הכל בכלל מהחומר אז תשאלו את המתרגל האחראי אם משהו מוזר.\nשיעורים מעשיים מאולתרים ולא ברורים אבל ציונים גבוהים\nהמבחן: מבחן קל אבל מוזר מאוד. \nמה שחשוב זה שמעל 85 זה ריאלי לגמרי\n\nהשורה התחתונה: \nקורס קצת דפוק אבל הממוצע גבוה.", "timestamp": 1659209950190}, {"author": "Tim Manor", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אבנר רוטשילד ודן מרדכי\nחוות דעת - הרצאות: \nאבנר מרצה די גרוע. נוטה לברוח מהנושא של השיעור והמצגות שלו נראות כאילו הוא בחר באופן אקראי עמוד בספר הקורס ושם צילום שלו בשקופית, לא באמת אפשר ללמוד מזה כלום. דן טיפה יותר טוב ממנו אבל זה די ניכר שהוא לא כל כך אוהב את החומר הנלמד.\nשם המתרגל/ת: לוטן פורטל\nחוות דעת - תרגולים: \nמתרגלת אגדית! מחזיקה את כל הקורס לבד! בלעדיה הממוצע היה יורד ב-20 נקודות! היא מכינה לקראת כל תרגול סרטון הכנה. אני מאוד ממליץ לראות אותו כי אז מגיעים הרבה יותר ממוכנים לתרגול! למדתי את כל החומר של הקורס רק מתרגולים שלה!\nשעורי הבית: \nלפעמים ממש קלים ולפעמים ממש קשים. זה נראה שלכל נושא יש להם בנק ענק של שאלות וזו הגרלה איזה שאלות תקבל. היה לי חבר שקיבל באחד הנושאים 5 שאלות ממש קלות (סיים את כל השאלות ב-48 שניות) בעוד שאני קיבלתי שאלות ממש קשות (לקח לי 2.5 שעות לפתור הכל נכון)\nהמבחן: \nאמנם אין מבחנים במודל אבל בדרייב יש ובנק השאלות שפותחים לקראת המבחן ממש עוזר. המבחן בסך הכל ממש סבבה והוגן.\nהשורה התחתונה: \nקורס שיכול להיות באמת מעניין אם אנשים כמו לוטן יעבירו אותו.", "timestamp": 1704704254667}, {"author": "שם", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המתרגל/ת: נוי\nחוות דעת - תרגולים: \nמתרגלת מעולה!!! היינו קבוצה קטנה והיא ממש השקיעה שנבין הכל.\nשעורי הבית: סבבה, לפעמים מאתגרים, אין המון\nהמבחן: יותר קשה ממה מהתרגולים, צריך ללמוד הרבה לפני", "timestamp": 1706014767217}]}