{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אחלה חזרה והרחבה על כל הנושאים של קורס מבנה ותכונות. רוב הניסויים לא כבדים מדי והדוחות בדר\"כ לא רעים מדי, במיוחד כשיש מלא רפרנסים. צריך לזכור בכל פגישה לשאול את המדריך מה הדגשים הספציפיים שלו/ה לדוח, לכל אחד חשוב דברים אחרים!", "timestamp": 1614882617134}, {"author": "...", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "המעבדות עצמן קלילות ומהירות, המדריכים לא כלכך בוחנים באמת את הבחנים. הדוחות מייאשים וארוכים ולוקחים הרבה זמן.", "timestamp": 1673799935419}, {"author": "Tian Han Shen", "difficultyRank": 3, "generalRank": 3, "semester": "202103", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nדוחות מעבדה לוקחות זמן , לוקח בערך יומיים בשבוע , או יום עבודה שלם לסיים אותם \nהמבחן: \n\nהשורה התחתונה: קורס מאוד חופר , אבל לא סוף עולם", "timestamp": 1673812633539}, {"author": "ins", "difficultyRank": 2, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: עשיתי המון מעבדות וזו הייתה הכי קלילה ונחמדה, ודרשה הכי פחות השקעה", "timestamp": 1677507563426}, {"author": "Iohannes Magnvs", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "חוות דעת - מעבדות: בפועל, אלה פחות היו מעבדות אלא 'סדנאות' כי העבודה הייתה בקבוצה לרוב, ולפעמים המעבדה אפילו לא כללה עבודה שלנו (דיאג. פאזות למשל) אבל במקרים שבהם יצא לעבוד די נהנתי. רוב הנושאים במעבדה קשורים לתכונות מכניות ומיקרו מבנה של מתכות.  אגב, לא זכורה לי פעם אחת שנשארתי כל ה-4 שעות שרשומות במערכת. יש פעמים שמסיימים הכל אפילו בשעתיים.\n\nחוות דעת - מדריכים: בניגוד לחוויות שלי מכימיה, המדריכים לרוב מאוד נחמדים ואפילו 'סחבקים' במידה וממש לא לחוצים מלהספיק את המעבדה. בתכלס חלק לא קטן מהזמן דיברנו איתם על המחקר שלהם ועל תארים מתקדמים ועל נושאים דומים.\n\nדוחות מעבדה: החלק הכי גרוע בקורס. הסמסטר בגלל המלחמה ועוד גורמים יצא שעשינו שני דוחות בתור קבוצה ושני דוחות אישיים, מתוך 8 ניסויים סה\"כ. יש דוחות יותר קלים שיוצאים בסביבות 15-20 עמודים אבל יש כאלה באורך של סיכום של קורס. בסופו של דבר חלק ניכר מהדוח זה רקע תיאורטי ארוך מאוד ונספחים, וקצת חפירה וחרטוטים. גם המדריכים לא שוחטים אותך בדו\"ח - לא זכור לי שמישהו קיבל פחות מ-80.\n\nבחני כניסה: לא קשים במיוחד, אבל דורשים הכנה של כמה שעות בשביל להוציא ציון טוב. בדרך כלל שואלים לפי הפרוטוקול, ולפעמים ממש זהים לשאלות מהפרוטוקול.\n\nהשורה התחתונה: מעבדה מונפצת, לא קשה בכלל, אבל אל תצפו לקבל ציונים על הערכת מדריך\\בוחן כניסה ובמיוחד דו\"ח מיד אחרי שסיימתם את המעבדה... לוקח להם זמן להחזיר", "timestamp": 1711462198673}]}