{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: נוי\nחוות דעת - הרצאות: מרצה מצויין, מסביר בצורה מאוד ברורה את החומר.\n\nשם המתרגל/ת: מיכל \nחוות דעת - תרגולים: טובה, יודעת איך לסנן את החומר הרלוונטי ביותר. \n\nשעורי הבית: חלק ממוחזרים, חלק חדשים. השתמשו בתרגילם ממבחנים. \n\nהמבחן: הגון - שאלות ברורות ועל חומר הקורס, בלי הפתעות. צריכים להיות מאוד מתורגלים, אבל אפשר לקבל ציון טוב. \n\nהשורה התחתונה: נוי והמתרגלים מעבירים את הקורס בצורה טובה, ורמת הקושי סבירה לחלוטין.", "timestamp": 1616311998689}, {"author": "סטודנטית רלוונטית", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דר. נוי כהן\nחוות דעת - הרצאות: הרצאות מעניינות ורלוונטיות, מכילות דוגמאות כשיש צורך. נוי מרצה בהיר וברור וכיף להקשיב לו בהרצאות, גם בזום וגם באופן פרונטלי. ההרצאות מכילות הרבה רקע תיאורטי אבל גם דרכי פתרון ולדעתי משמעותיות להבנה והצלחה בקורס.\n\nשם המתרגל/ת: מיכל לוין\nחוות דעת - תרגולים: \nאמ;לק: התרגולים פצצה וגם מישהו צריך לגרום למיכל לתרגל את כל הקורסים בטכניון. \nתרגולים פרקטיים (כמו שתרגולים צריכים להיות), פתרון שאלות מכל הסוגים שחשובים לבחינה והסברים ברורים. התרגולים מכילים המון נוסחאות שכדאי למסגר במהלך הסמסטר ולשים בדף הנוסחאות הסופי.\nמיכל ממוקדת, יודעת להעביר את החומר ברמה גבוהה ולעזור גם למי שמתקשה בהבנה וגם למי שבא לו יותר בקלות. היא מקפידה לכתוב דרכי פעולה לסוגים שונים של תרגילים באופן מסודר, מאוד עזר לי באופן אישי להבין איך לגשת לתרגילים.\n\nשעורי הבית: \nשיעורי בית שבועיים, לא מאוד קשים אבל דורשים מחשבה. קיימים פתרונות לחלק מהם אבל באמת ממליצה לפתור את כל השאלות בעצמכם, הם חשובים המון להבנה ולתרגול החומר. מקבלים את כל הכלים כדי להצליח לפתור אותם. \n\nהמבחן: \nמבחן הוגן מאוד, 3 שאלות שראינו דומות אליהן בתרגולים בכיתה וגם בשיעורי הבית. מי שהקשיב ופתר את שיעורי הבית במהלך הסמסטר בהחלט יכול להוציא ציון גבוה. חשוב לתרגל ולפתור בחינות כי המבנה של המבחנים דומה ואפשר ללמוד מזה המון.\n\nהשורה התחתונה: \nאחלה קורס שבעולם! סגל מדהים, שאולי בזכותו אני מוצאת את הנושא כל כך מעניין, אבל באמת קורס מעניין. אם אתם אחלה עם פיזיקה 1 אתם תהיו אחלה גם עם זה. תנצלו את הקורס הזה כדי להינות ממנו כי הוא באמת כיפי!", "timestamp": 1625853340902}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: נוי כהן\nחוות דעת - הרצאות: נוי חמוד, אבל לפעמים ההרצאות שלו היו מבולגנות והוא איבד את הסטודנטים\n\nשם המתרגל/ת: מיכל לוין\nחוות דעת - תרגולים: ממליץ על התרגולים שלה לכל אחד\n\nשעורי הבית: בסך הכל קלים ועוזרים להבנת החומרץ יש לציין כי הם לא נבדקים למעט עבודת האמצע (מחליפה בוחן) שהיא טיפה עמוסה יותר \n\nהמבחן: יותר קשה מהמצופה אבל פתיר. חשוב לזכור גם את הפיתוחים מההרצאות\n\nהשורה התחתונה: קורס חמוד", "timestamp": 1646000925372}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: נוי כהן\nחוות דעת - הרצאות:  הרצאות מצוינות. חומר מעניין ומרצה מצוין.\n\nשם המתרגל/ת: מיכל לוין\nחוות דעת - תרגולים: מתרגלת מעולה. מרגישים שממש אכפת לה מהתרגול ונותנת את כל הזמן שצריך אחרי התרגול בשביל לוודא שנבין.\n\nשעורי הבית: עוזרים מאד להבנה והפנמה של החומר מאד רלוונטים \n\nהמבחן: היה די קשה לשים לב שיכולה להיות שאלה על חומר תיאורטי שהועבר רק בהרצאות\n\nהשורה התחתונה:", "timestamp": 1647164527416}, {"author": "ins", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: נוי\nחוות דעת - הרצאות: \nהחומר לא מאוד מעניין אבל נוי מרצה מעולה, מומלץ להגיע להרצאות\nשם המתרגל/ת: ריטה\nחוות דעת - תרגולים: \nהמתרגלת הכי מקסימה בעולם! ממש מתחשבת וממש מנסה לבוא לקראת הסטודנטים ולעזור אבל לדעתי לא מאוד מבינה איפה הסטודנטים נתקלים בבעיות ולא ממש יודעת איך להסביר\nהיתרון הוא שלא הינו הרבה סטודנטים בתרגולים \nשעורי הבית: \nמעיקים ממש ולא כיפים אבל הם די ברמה של מבחן אז מומלץ לעשות באמת ולא לרפרנס, ממליצה להשתמש בדף נוסחאות מההתחלה\nהמבחן: לא היה עדיין כי הוא נדחה :(\n\nהשורה התחתונה: קורס לא מאוד מעניין אבל די טכני", "timestamp": 1677507991623}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נוי כהן\nחוות דעת - הרצאות: מעניינות\n\nשם המתרגל/ת: מיכל לוין\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: אם מבינים את הקטע- זה רץ, מאוד טכני\n\nהמבחן: סבבה\n\nהשורה התחתונה: קורס מאוד טכני- לתרגל ולהצליח", "timestamp": 1677673246320}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נוי כהן\nחוות דעת - הרצאות: \nהרצאות מאוד מעניינות, כל הזמן בודק שכולם מבינים ושאין שאלות, מלמד חלק גדול מהקורס דרך שאלות לדוגמה- לי זה מאוד עזר\nשם המתרגל/ת: מיכל (בהתחלה פרונטלית ואז הקלטות)\nחוות דעת - תרגולים: מהירה אבל טובה ועונה על כל השאלות, מעלה את הקובץ שהיא עבדה עליו למודל בסוף אז לא צריך להעתיק\n\nשעורי הבית: הרוב ברמת מבחן, מאוד דומים לשיעורי בית של שנים קודמות אז אפשר להיעזר\n\nהמבחן: \nהיה קשה מאוד לעומת מבחנים קודמים, מקווים לפקטור\nהשורה התחתונה:", "timestamp": 1715017444354}]}