{"posts": [{"author": "הודיה מאנע", "semester": "201901", "text": "קורס מומלץ מאוד, המרצה מובן ויודע להעביר את חומר הקורס באופן יעיל, תוך שימוש בהומור, בדוגמאות ובדימויים רלוונטיים לחיי היומיום. שיעורי הבית לא עמוסים במיוחד, אך כמו בכל קורס, גם כאן יש להשקיע וללמוד כמו שצריך על מנת להוציא ציון טוב בקורס (אפשרי בהחלט).", "timestamp": 1584438914000}, {"author": "yuval", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "שם המרצה: בועז פוקרוי\nחוות דעת - הרצאות: ממהר, הרצאות באנגלית לא ברורה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: עמוסים מאוד\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1598538302704}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: בועז פוקרוי\nחוות דעת - הרצאות: בועז מרצה מצוין!! מעביר את ההרצאות בצורה מעניינת, מעורר סקרנות ומרחיב אופקים. ההרצאות סוקרות בצורה מינימליסטית את המשך הלימודים והקורסים בפקולטה.\n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: התרגולים טובים ולוטן מעולה.\n\nשעורי הבית: גיליון בשבוע, מכניס את החומר לראש בצורה טובה.\n\nהמבחן: לרוב הוא בסדר, אבל יכולים לתת פה ושם שאלות שדורשות חשיבה.\n\nהשורה התחתונה: קורס מצוין ומעניין", "timestamp": 1625762658329}, {"author": "yosi dedik", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  בועז\nחוות דעת - הרצאות: מסביר מעולה, מצחיק, מעניין מאוד, אחלה קורס \n\nשם המתרגל/ת:  לוטן\nחוות דעת - תרגולים: מעולה!!!\n\nשעורי הבית: לא מוגזמים\n\nהמבחן: הוגן\n\nהשורה התחתונה:  אחלה קורס", "timestamp": 1626692915686}, {"author": "איתמר זייד", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה:  בועז פוקרוי\nחוות דעת - הרצאות: הרצאות ארוכות מאוד אבל יחסית מוסברות טוב\n\nשם המתרגל/ת: ערד לנג\nחוות דעת - תרגולים: מתרגל מעולה. החומר מוסבר לאט וטוב\n\nשעורי הבית: בסדר גמור\n\nהמבחן: סביר\n\nהשורה התחתונה: קורס נחמד", "timestamp": 1631170662022}, {"author": "כימאי", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: בועז פוקרי\nלא התחברתי למרצה, הוא לא רצה לאפשר זום/הקלטות לאף מהתרגולים והרצאות. ההרצאות היו מאוד משעמות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: הקלטות משנה שעברה\nאחלה של תרגולים מסבירה את החומר מאוד טוב\nשעורי הבית: \nמסכמים את החומר בצורה טובה אבל לא כתובים באופן ברור \nהמבחן: \nהוגן לחלוטין\nהשורה התחתונה: \nקורס מבוא משעמם שצפשר לקבל בו ציון טוב בלי כל כך מאמץ", "timestamp": 1658070874767}, {"author": "ליאור", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: בועז\nחוות דעת - הרצאות: מרצה מעולה, הרצעות מעניינות וענייניות. \n\nשם המתרגל/ת: ארד\nחוות דעת - תרגולים: מתרגל מעולה, חד וקצר ולעניין. מסביר מדהים \n\nשעורי הבית: סבבה\n\nהמבחן: סבבה\n\nהשורה התחתונה:", "timestamp": 1658424485826}, {"author": "io", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: בועז\nחוות דעת - הרצאות: החומר ממש מעניין אבל ההרצאות לא תמיד הכי ברורות\n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: מפצה לגמרי על ההרצאות\nהיא גם ממש מעניינת וגם מסבירה מעולה\n\nשעורי הבית: סבבה\n\nהמבחן: סבבה\n\nהשורה התחתונה:", "timestamp": 1658815691607}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: בועז\nחוות דעת - הרצאות: מרצה מצוין, קצת קשוח עם הסטודנטים \n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: מושלמת אין מילים\n\nשעורי הבית: כל שבוע נפתח גליון, אבל הם די קלילים ועושים מעבר טוב על החומר הנלמד באותו שבוע\n\nהמבחן: סך הכל מבחן פייר אבל כן יש שאלות קצת מתקילות בעיקר בגלל ניסוחים לא ברורים\n\nהשורה התחתונה:", "timestamp": 1659082162411}, {"author": "שלומקה", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: בעז\nחוות דעת - הרצאות: החומר עניין אותי אז גם ההרצאות אבל לא מאוד התלהבתי מבעז\n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: מושלמתתתת הופכת את העניין לפרקטיקה\n\nשעורי הבית:סבבה\n\nהמבחן: ממש הוגן\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1665229918735}, {"author": "Sigma-Y", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: בועז\nחוות דעת - הרצאות: \nאחד המרצים (ובכללי מורים) הבודדים שפגשתי שגרם לכל הכיתה להתפקס עליו ורק עליו בשיעור. מעביר את החומר בצורה מעניינת ומוכיח את הרלוונטיות של הנושא עם דוגמא (לפעמים קומית) של משהו יום יומי. גם בניגוד למרצים אחרים, הוא גם מנסה לשתף סטודנטים בהרצאות ולהכיר שמות.\nשם המתרגל/ת: לוטן וילנה\n*לדעתי לוטן מסיימת דוקטורט ולכן אני לא בטוח אם היא תתרגל את הקורס בהמשך. לגבי ילנה אני לא יודע. \nחוות דעת - תרגולים: \nלוטן מתרגלת טובה. באה מוכנה ועם מצגות מסודרות ומובנות שעוזרות אחר כך בשיעורי הבית. היא גם יודעת על מה לתת דגש ומה יהיה חשוב במבחן. בכללי היא מאוד נחמדה ולפעמים שוברת דיסטנס.\nילנה, ממה שהבנתי, גם מתרגל סבבה אבל היה לי איתה רק תרגול אחד ואני פחות התרשמתי. זה לא שהיא מתרגלת גרועה, פשוט הרגיש לי שהיא קצת לא מבדילה בין עיקר לתפל אבל סך הכל שתי המתרגלות מאוד טובות.\n\nשעורי הבית: \nגיליון בכל שבוע. בחלק מהמקרים הגליונות קשים מהתרגולים, ובחלק היו שאלות לא קשורות לגמרי.  אבל לא שווה להזניח אותם, הם דווקא יכולים לעזור.\n\nהמבחן: \nהיה היום, ולי הרגיש שביחס לשנים קודמות הוא היה יותר קשה באופן ניכר. המבנה של המבחן נשאר זהה, 20 שאלות אמריקאיות, אבל הפעם בשאלות היו הרבה טריקים ודברים שקשה לשים לב אליהם בגלל שהשאלות במבחני עבר ובתרגולים לא היו דומות בכלל לחלק מהשאלות במבחן הזה ולכן הוא הרגיש מעיק כמו חדוא, שצריך לנחש שאלות אמריקאיות... \n\nהשורה התחתונה: קורס מאוד מעניין. שווה לבוא להרצאות ולעשות שיעורי בית, כי החומר לא קל מידי, ונקווה שנקבל פקטור על מועד א", "timestamp": 1688995913885}, {"author": "צמנטיט למלרי", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: בועז\nחוות דעת - הרצאות: ההרצאות חלקן מעניינות ובחלקן איבדתי אותו, בכל מקרה מדובר במרצה לא רע שמביא דוגמאות רלוונטיות מהחיים שיוצרות עניין בחומר. \n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: הרבה פעמים באתי לתרגולים שלה שהמושגים הם סינית בשבילי ותוך כמה דקות בתרגול שלה נכנסתי לעניינים והבנתי את החומר. בעיניי המתרגלת הכי טובה שהייתה לי בטכניון. \n\nשעורי הבית: חלקם הקטן לא רלוונטי (לוטן אמרה למשל על איזה נושא שנמצא בשיעורי בית שאין שום סיכוי שהוא יהיה במבחן). היו הרבה תקלות של הצוות - למשל לא התקבלו התשובות הנכונות וכו'. בסך הכל חלק גדול מהתרגילים הם ממבחנים כך שהם ברמת המבחן, כך שכדאי לעשות וזה גם תקף.\n\nהמבחן: הרגיש קשה לעומת מה שתרגלתי, כלומר יותר טריקי ויותר מחפש. בסופו של דבר מי שראה הרבה שאלות כבר הכיר את הטריקים והמסיחים.\n\nהשורה התחתונה: קורס עם הרבה טכניקה אבל אסור לזנוח את ההבנה, כשמבינים הוא גם נהיה מעניין.", "timestamp": 1689274418730}, {"author": "מיפ", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: בועז פוקרוי\nחוות דעת - הרצאות: הרצאות ממש מעניינות, בועז גם תמיד נותן קישורים לאפקלציות מעניינות או לנושאים רלוונטים שקשורים לחומר של אותו שבוע. \nההרצאה היא בקצב דיבור אז קצת קשה לסכם. אבל בועז מפרסם את המצגות שלו לפני השיעור וכדאי לכתוב עליהם הערות.\nאם מספיקים את כל החומר של ההרצאה הוא משחרר יותר מוקדם\n\nשם המתרגל/ת: לוטן\nחוות דעת - תרגולים: בהתחלה תיכננתי לראות את ההקלטות של התירגולים אבל נשארתי פרונטלי כי היה ממש כיף, לוטן מסבירה את החומר מעולה, ונותנת דגשים חשובים למבחן\n\nשעורי הבית: \nגיליון אלקטרוני כל שבוע, לפעמים יש טעיות בהם, מומלץ לעשות אחרי התירגול אבל כמה ימים לפני ההגשה בגלל הטעיות. (אנחנו ביקשנו 3 ניסיונות בשביל זה ואישרו לנו :) )\n\nהמבחן: 20 שאלות אמריקאיות, מבחן הוגן (קצת מבלבל כי בכל זאת אמריקאי... )\n\nהשורה התחתונה: קורס ממש מעניין ומלמד, סופסוף אני יכולה לספר מזה הנדסת חומרים ששואלים אותי :)", "timestamp": 1705058139086}]}