{"posts": [{"author": "ד", "difficultyRank": 3, "generalRank": 5, "semester": "202001", "text": "שם המרצה: פרופ' ווין קפלן\nחוות דעת - הרצאות: מעביר את ההרצאות בכיף ובאווירה טובה, קשה לעקוב אחריו כי יש הרבה חומר ולפעמים לא החומר לא ברור אבל סה\"כ שינה את החומר של הקורס למעניין יותר.\n\nשם המתרגל/ת: לוטן פורטל\nחוות דעת - תרגולים: מתרגלת מעולה! שווה ללכת אליה היא עושה סדר בחומר.\n\nשעורי הבית: לא חובה אבל שווה לנסות או לפחות לעבור על הפתרונות במהלך הסמסטר\n\nהמבחן: עדיין לא היה, אבל במתכונת שאלות אמריקאיות\n\nהשורה התחתונה: קורס חובה להנדסת חומרים. הכי מלמד מבחינת פרקטיקה והבנה אמיתית של הנדסת חומרים.", "timestamp": 1613548825568}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ווין \nחוות דעת - הרצאות: מעניינות והחומר מאוד רלוונטי. לעתים קצת הולכים לאיבוד, אז צריך להיות בעניינים. \n\nשם המתרגל/ת: ערד\nחוות דעת - תרגולים: טוב, יודע את החומר היטב. התרגולים בנויים בצורה ברורה. \n\nשעורי הבית: לא חובה, כמובן רצוי מאוד לעשות (וגם דומה למבחן)\n\nהמבחן: אצלנו היה אמרקאי, שאלות ברורות ועל החומר של הקורס. הציונים היו טובים.\n\nהשורה התחתונה: קורס מעניין, וחשוב להיות בעניינים עליו. מאוד שימושי להמשך.", "timestamp": 1616312693448}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ויין קפלן\nחוות דעת - הרצאות: הבעיה עם שלוש שעות הרצאה בסוף יום זה שנרדמים אלא אם ההרצאה אינטראקטיבית במיוחד, וזאת לא הייתה אינטראקטיבית במיוחד. יאמר לזכות ויין שהוא ניסה, אבל מאוד קשה עם הסלוט הזה. בנושא ההרצאות עצמן, הן יכולות להיות מאוד מאוד מעניינות, למרות שמדובר רק בקורס הקדמה, אך לפעמים גולשות לפרטים מאוד טכניים ולא מעניים\n\nשם המתרגל/ת: ערד לנג\nחוות דעת - תרגולים: מתרגל נהדר עם תרגולים שכתובים טוב ומסבירים את החומר החשוב\n\nשעורי הבית: אופציונליים, מומלץ לעשות אותם (או במהלך הסמסטר או בלמידה למבחן). אם עושים ומבינים אותם זאת לא בעיה להצליח במבחן\n\nהמבחן: לא נועד להפיל אבל כן דורש ידע\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1646001886451}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ווין\nחוות דעת - הרצאות: מאד קשוחות בשלבים הראשונים, אח\"כ קצת יותר קלות. צריך לעשות עבודה רצינית בשביל להבין מה רלוונטי לרמה שלנו ומה לא.\n\nשם המתרגל/ת: לוטן \nחוות דעת - תרגולים: מצוינים מעבירים את החומר בצורה ממש טובה \n\nשעורי הבית: לא חובה אבל מומלץ לראות שלא פותחים פער, חשובים בשביל לעקוב אחרי החוט מהרצאה להרצאה. \n\nהמבחן: אמריקאי עם תלות בין השאלות, מה שאומר שזה או הצלחה גדולה או כישלון רציני\n\nהשורה התחתונה:  קורס קשוח אבל חשוב", "timestamp": 1647164706451}, {"author": "אני", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: פרופ. קפלן וויין  \nחוות דעת - הרצאות:  \nפרופ. וויין הוא מרצה טוב וההרצאות מעניינות, נלמד מגוון של שיטות אפיון, אבל מדובר בשלוש שעות רצופות ולא בבוקר (לפחות אצלנו הן היו אחר הצהריים, כמעט בערב). לכן, ברובן לא פשוט להתרכז.   \n\nשם המתרגל: ערד לנג    \nחוות דעת - תרגולים:  \nמתרגל טוב, מסביר את החומר בבהירות ולעניין, עונה במיילים, אבל קחו בחשבון שהוא מלמד בקצב די מהיר, אז מומלץ לבוא עם קובץ התרגול מראש לתרגולים ולכתוב כמה שפחות.     \n\nשעורי הבית: \nאין בדיקה שלהם ואין עליהם ציון, אלא מתפרסם פתרון רשמי בכל שבוע - שבועיים לכל גיליון. שיעורי הבית לא פשוטים, ההמלצה שלי היא לפתור אותם במהלך הסמסטר (כאילו יש דד ליין להגשה) ולא לחכות איתם לרגע האחרון.   \n\nהמבחן: \nאצלנו הוא היה אמריקאי. היו חלקים פשוטים יותר והיו חלקים לא פשוטים בכלל. ההמלצה שלי היא לעבור על החומר כמה שאפשר לפני המבחן, בדגש על ההרצאות, אם יש לכם.ן זמן.    \n\nהשורה התחתונה:  \nתתכוננו לקורס לא פשוט בכלל ודי קשוח, אבל באותה המידה מעניין וחשוב להמשך התואר. \nבהצלחה :)", "timestamp": 1647173107130}, {"author": ".", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ויין קפלן\nחוות דעת - הרצאות: ארוכות ומייגעות, אבל גם חשובות\n\nשם המתרגל/ת: לוטן פורטל\nחוות דעת - תרגולים: מצוינים\n\nשעורי הבית: אין חובת הגשה, חשוב לעשות בכל זאת!\n\nהמבחן: דורש הבנה של החומר\n\nהשורה התחתונה: קורס סופר סופר חשוב, שווה להשקיע", "timestamp": 1677673344366}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: מעבירה את החומר סבבה אבל החומר פשוט משעמם..\n\nשם המרצה: רחל\nחוות דעת - הרצאות: משעממת+חומר משעמם אז מאוד קשה להקשיב\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: שי מתרגל סבבה, מעביר את החומר טוב\nאבל הוא די מתנשא ואם שואלים שאלה וזה משהו שהוא כבר הסביר הוא יגיד \"אבל הרגע הסברתי\" ולא יענה על השאלה או שיענה לא בנחמדות\n\nשעורי הבית: לא חובת הגשה\nהם קשים אבל תרמו מאוד בלמידה לבוחן אמצע ומבחן\n\nהמבחן: היה ממש קשה! וממש לא דומה לקודמיו \nהרגיש שהסגל לא מבין את הסטודנטים ומה הם לא מבינים ומאוד הקשה\n\nהשורה התחתונה: הקורס לא היה מאוד מעניין והרגיש שהסגל ממש בא להקשות", "timestamp": 1718557439994}]}