{"posts": [{"author": "ניר טורק", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 13 גיליונות שלא לוקחים הרבה זמן, אבל העומס גדול יחסית לכמות הנז\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1597920324056}, {"author": "Itai Freeman", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלילים למי שעל החומר\n\nהמבחן: קצת טריקי- אמריקאי ואפשר ליפול על שטויות קטנות\n\nהשורה התחתונה: קורס לא עמוס", "timestamp": 1602069107787}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הקורס היה מההקלטות וזה היה טוב מאוד, ככה היה קל להעביר את הקורס פי 2 מהר יותר :)", "timestamp": 1602483647598}, {"author": "אנונימוס", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: רונית\nחוות דעת - תרגולים: אחלה\n\nשעורי הבית: מרופרנסים\n\nהמבחן: קצת מבלבל אבל לא קשה\n\nהשורה התחתונה: קורס די קל סהכ", "timestamp": 1625821947065}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שעורי הבית: יחסית קצרים אבל הרבה גליונות. עוזרים בהבנה של החומר לקראת המבחן\n\nהמבחן: אמריקאי, 20 שאלות בלי בחירה. מרגיש שמנסים להפיל אותך על מסיחים בכל שאלה. חשוב להתכונן כמו שצריך גם על הצד התיאורטי ולא רק לדעת לפתור שאלות חישוביות\n\nהשורה התחתונה: קורס ממש בסדר אם לומדים אותו כמו שצריך. קצת יותר מדי השקעה בשביל 2.5 נק\"ז. הכל תלוי בסוף באיזה מבחן מקבלים", "timestamp": 1626104027265}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלא לראות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nשתיהן היו מדהימום \nשעורי הבית: \nלא קשים\nהמבחן: \nלא קשה צריך לראות את כל התרגולים ולקרוא סיכום ומסודרים\nהשורה התחתונה: \nלא קורס קשה אפשר להוציא ציון טוב", "timestamp": 1647351821492}, {"author": "אתם יודעים מי אני", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יונתן קולהורה או קלהרה אין לי באמת מושג\nחוות דעת - הרצאות: \nלא יודע את החומר. בסופו של דבר אני לא ממליצה ללכת להרצאות שלו. זה ביזבוז שעתיים על הבנה רק של מה הנושא ובערך על מה מדובר. הבטיח הסמסטר שיתן 1.5 נקודות לציון הסופי לכל מי שיגיע להרצאה וישתתף בבחני הפתע שלו. עד ליום זה לא ראו עיני את הנקודות המובטחות.\nשם המתרגל/ת: יאנה המושלמת והמלכה\nחוות דעת - תרגולים: \nדעת את החומר פיקס יותר טובה פי 1000^999 מהמרצה.ללכת רק אליה. היא נחמדה מאוד עונה על כל השאלות ומסבירה מעולה.\nשעורי הבית: \n\nהמבחן: \nמבחן שאמור להיות קל וכולם התכוננו אליו וידעו את החומר. הם עשו תרגילים טריקים מאוד. לא היה מספיק זמן בכלל. נתנו שעתיים ל20 שאלות. והיו דברים משובשים במבחן עצמו. חבל שלא סיימו איתנו בטוב.\n\nהשורה התחתונה:", "timestamp": 1657202544407}, {"author": "לא משנה מי - יש קונצנזוס בין כולם", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יונתן קלהורה\nחוות דעת - הרצאות: \nהמרצה לא שולט בחומר בכלל, לא יודע לענות על שאלות הסטודנטים, ובעיקר מראה המון סרטונים. בזבוז זמן אבל יכול להיות אחלה פרומו לתרגולים.\nשם המתרגל/ת: יאנה גרישצ'נקו\nחוות דעת - תרגולים: \nמתרגלת מדהימה! מסבירה הכל כמו שצריך, עניינית, שולטת בחומר יותר מהמרצה בפער!\nשעורי הבית: \nעל בסיס שבועי, תורמים מאוד להבנה של החומר, הבודק היה עקשן וקפדן באופן קיצוני, רק חיפש על מה להוריד נקודות.\nהמבחן: \nהמבחן היה לא הוגן - מלא בשאלות מכשילות, ושאלות שטעות בהן גררה טעויות בשאלות עוקבות. לא הודיעו עד רגע קבלת הבחינה שהיא נמשכת שעתיים במקום שלוש שעות.\nהשורה התחתונה:", "timestamp": 1657211722136}, {"author": "Daniela Kapustina", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יואב\nחוות דעת - הרצאות: הוא מנסה. לא מאוד עובד לו בלשון המעטה, אבל גם לפספס הרצאות זה ריסקי.\n\nשם המתרגל/ת: שי\nחוות דעת - תרגולים: הוא סך הכל בסדר. יודע את החומר ויודע להעביר אותו.\n\nשעורי הבית: השיעורי בית במודל סבבה, לא מאוד קשים אבל מאוד עוזרים להבנה. רק צריך להיזהר כי ניסיון הגשה אחד. הניסויים מעצבנים ומעיקים וסתם מבזבזים זמן ובאמת שפשוט עדיף לרפרנס (ממכונות).\n\nהמבחן: הוגן. קצת ממוחזר מהמבחנים של מכונות.\n\nהשורה התחתונה: במהלך הסמסטר הקורס הזה עלה לי על העצבים. התנהלות על הפנים והיה קשה להבין משהו. בסוף הכל הסתדר והמבחן היה באמת הוגן.", "timestamp": 1689347686435}, {"author": "Aviv", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יואב קלכהיים\nחוות דעת - הרצאות: רואים שהוא מרצה מנוסה אבל כן היו נושאים שהוא העביר והיה ברור מאוד שהוא לא חד בהם (לגודמה עם גרפי מסיסות מלאה וחלקית או עם גרף TTT, בהרצאה הוא התחיל להסתבך עם מה קורה בגרפים וזה בלבל מאוד את רובנו) יש המון סרטונים ביוטיוב שמסבירים מעולה את כל מה שקורה בקורס אז כדאי לצפות אם משהו לא ברור (ספציפית ממליצה על ערוץ של Tylor Sparks).\n\nשם המתרגל/ת: שי לוי\nחוות דעת - תרגולים: אחלה מתרגל, מסביר מעולה וניכר מאוד שהוא רוצה לעזור לכמה שיותר סטודנטים כדי להצליח.\nהבאסה העיקרית היא שחצי מדרך הפיתרון לא רשום במצגת של התרגול. כלומר, שי מסביר בעל פה את הרציונל מאוחרי הפתרון. אם לא כתבת את מה שהוא אמר בעל פה, כשתנסה להיעזר בתרגולים כדי לפתור את שיעורי הביתה אתה תתקשה מאוד.\n\nשעורי הבית: עוזרים מאוד להבנת החומר ואופן הפיתרון.\nאין רפרנסים אז הם לוקחים המון זמן וכמו שציינתי למעלה, אם לא כתבת את הרציונל אתה תשבור את הראש המון זמן עד שמצא את דרך הפיתרון.\n\nהמבחן: היה קשה להתכונן אליו בגלל שכמעט ואין פתרונות מלאים במבחנים קודמים. הייתה תחושה לפני המבחן שמנסים לעשות שינוי (לטובה או לא, לא ברור) ברמה והפורמט של המבחן. זה היה ניכר במבחן שהיה. הוא היה פייר אבל שונה מכל מבחני העבר שהתכוננו איתם.\n\nהשורה התחתונה:", "timestamp": 1689678149605}]}