{"posts": [{"author": "/", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יהונדב\nחוות דעת - הרצאות: מולקטות, רוב ההרצאות היו ברורות וטובות. יש הרבה חומר, שלא בהכרח קשור, אז רצוי להישאר מחוברים.   \n\nשם המתרגל/ת: ראינו תרגולים בוידאו, קצת ישנים אבל לא השתנו הרבה מאז. \nחוות דעת - תרגולים: הוידיאו טוב וברור, יש פתרונות מלאים להכל.  \n\nשעורי הבית: מרופרנסים, שבועיים. חלק לוקחים הרבה זמן וכתיבה. \n\nהמבחן: אצלנו היה בעיקר מתמטי, עם שאלת ש\"ב + שאלה שהופיע באחד התרגולים (נושא שלא נכנסו אליו בהרצאה). סביר להניח שישתפרו בבחירת תרגילים עם השנים. \n\nהשורה התחתונה: קורס קשה, להשקיע לאורך הסמסטר.", "timestamp": 1602703508065}, {"author": "י.כ", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יהונדב\nחוות דעת - הרצאות: \nקשות מאוד לצפייה,  עומס חומר ובלאגן מתמטי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאחלה, ממוחזרים\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1625827591473}, {"author": "יניב יוקוביץ'", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יהונדב בקנשטיין\nחוות דעת - הרצאות: מיותר\n\nשם המתרגל/ת: ע/ארד לנד\nחוות דעת - תרגולים: נ ו ר א י\n\nשעורי הבית: שבועיין, מרופרנסים וקשים מאוד! לא קשורים לחומר הלימוד - בודקים שליטה ב- Excel ובפתרון אינטגרלים ברובם.\n\nהמבחן: לא התרחש עדיין\n\nהשורה התחתונה: עמוס וקשה", "timestamp": 1626092979498}, {"author": "^,^", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יהונדב בקנשטיין\nחוות דעת - הרצאות: מקריא מהשקופיות ועושה טעויות חישוביות בפיתוחים תוך כדי, לא אינפורמטיבי בכלל. מומלץ לא להגיע וללמוד לבד. חוסך זמן ואנרגיות.\n\nשם המתרגל/ת: סשה חלפין\nחוות דעת - תרגולים: מאוד נחמדה ומשתדלת מאוד, לקראת סוף הסמסטר תפסה את הקצב והייתה מובנת מאוד בשביל תרגול בפעם הראשונה.\n\nשעורי הבית: פתירים וממוחזרים, יש טעויות בפתרונות אז חשוב לשים לב ולא לרפרנס על עיוור.\n\nהשורה התחתונה: קורס שעל הנייר נראה חשוב ובסיסי להמשך התואר אבל מועבר בצורה מעוררת רחמים.", "timestamp": 1627684706831}, {"author": "גיבס-דוהאם", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יהונדב בקנשטיין\nחוות דעת - הרצאות: מרצה מעניין והוסיף הסמסטר משימת בונוס שרק לעשות אותה מוסיף 4 נק' לציון הסופי! שנה שנייה או שלישית שהוא מעביר את הקורס ומרגישים חבלי לידה, מאוד מתבלבל לעיתים בעיקר בפיתוחים המטמתיים\n\nשם המתרגל/ת: סשה חלפין\nחוות דעת - תרגולים: באמת מקסימה ועונה למיילים ושאלות אבל לא יודעת להחזיק כיתה או להעביר את החומר בצורה ש\"תופסת\" אותך\n\nשעורי הבית: גיליון כל שבוע, מרופרנסים מאוד, שווה לעשות בעיקר לקראת המבחן\n\nהמבחן: אצלנו הייתה שאלה שלמה משיעורי בית, שאלה אחת תאורטית מקשה ושאלה חישובים מעיקה. בגדול מבחן הוגן למי שהיה על החומר \n\nהשורה התחתונה: קורס חובה אז אין הרבה איך לברוח", "timestamp": 1658906093137}, {"author": "is", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: יהונדב\nחוות דעת - הרצאות: הוא די מקריא מהמצגת אבל גם מסביר די טוב\n\nשם המתרגל/ת: ערד\nחוות דעת - תרגולים: ראיתי את התרגולים המוקלטים שלו שהיו ממש טובים\n\nשעורי הבית: די סבבה ואפשר לרפרנס הכל\n\nהמבחן: המבחן היה ממש הוגן אבל מאוד הבנתי בניגוד לכל המבחני עבר שראינו שהיו חישוביים אז מי שלא הייתה לו הבנה לא יכל להצליח\n\nהשורה התחתונה: קורס שנחשב קל יחסית עם ציונים טובים (לא יודעת איך)", "timestamp": 1695373332866}]}