{"posts": [{"author": "חטפתי פוסט טראמה מהקורס הזה", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "בבוחן אמצע הממוצע היה 37 נתנו פקטור של 20 נקודות\nבמבחן היו 2 נקודות פקטור\nעומס של שיעורי בית שבועיים\nהרצאות לא ברורות\nמלאאאאאאאאא מדח\nוגם לא משווה יפה פאקינג משוואת החום נמאס לפתור אותה\nכל פעם לגאומטריה יותר מורכבת ולתנאים יותר מוזרים\nמלמדים דברים חשובים אבל ממש קשים להבנה:_(\nיכל להיות קורס השנה אבל יצא קורס נוראי שהזום רק עזר לזוועה שחווינוץ אני מפחד סימסטר הבא להגיע לקינטרס של יוגין, אם זה יהיה בקצת דומה לאימה של דיפוזיה שלו:(\n\nאם יש לך אופציה תברח \nאו כפי שהאיסטרי המפורסם ביותר אומר\n\"Fly, you fools!\"", "timestamp": 1598169556111}, {"author": "/", "difficultyRank": 5, "generalRank": 3, "semester": "201902", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: אטיות (ומשעממות לפעמים), אבל יוג'ין מאוד מנוסה (ויודע מה לעשות). יש בdrive תמלול של כל ההרצאות (כמעט לא השתנה מאז).\nההתחלה של הקורס מאוד מתמטית (מד\"ח), לבוא מוכנים.\n\nשם המתרגל/ת: קטיה / יובל + וידאו\nחוות דעת - תרגולים: ראינו תרגולים בוידאו (ישנים באיכות גרועה), ובנוסף שעת סדנה בשבוע. מומלץ להשקיע בשניהם, החומר לא פשוט. \n\nשעורי הבית: מרופרנסים, בדר\"כ כוללים שאלה 1 גדולה (ממבחנים). רצוי להשקיע כדי לקלוט את החומר, אבל לוקח זמן. \n\nהמבחן: 2 שאלות טכניות קשות (בסגנון של תרגולים/סדנה) ועוד שאלה של יוג'ין, שמצריכה הבנה טובה מאוד של החומר (לא טכנית, לא דומה לשום דבר שראית לפני). הציונים מתפלגים סביב 70 (עם מעט מאוד מעל 90).\nבוחן אמצע ממוצע מזעזע - ככה זה כל שנה, לא לדאוג.\n\nהשורה התחתונה: קורס קשה, אבל החומר חשוב - ואם משקיעים ומבינים לעומק, אפשר להצליח.", "timestamp": 1602703871231}, {"author": "is", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: פרונטלית אי אפשר להקשיב לו כי הוא על כפול 0.2 אבל אם רואית את ההקלטות על כפול 2 ההרצאות מעולות, יוגין מלמד ממש טוב וגם מחבר את הנושאים לדברים אישיים יותר או מראה סיפורים על האנשים וזה מאוד מכניס אותך ללמידה.\nהרבה פעמים היו הוכחות, לדעתי מיותר פשוט דילגתי אבל יכול להופיע במבחן\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: יוני מדהים, תרגול של שעה לקורס הזה פשוט לא מספיקה \nכדאי להקשיב ממש טוב ולנסות להבין עוד תוך כדי סמסטר כי זה הרבה חומר והוא לא לגמרי ברור\n\nשעורי הבית: ממש קאדריים, הם לקוחים ממבחנים של שנים שעברו אז מכינים יסית טוב\n\nהבוחן: ממש ממליצה להשקיע בו כי אפשר להוציא ציונים טובים (בניגוד למבחן) \n\nהמבחן: לרוב המבחנים ממש קשים ורק לפענח את התשובות זה בלתי אפשרי אבל אצלנו היה די בסדר חוץ משאלה אחת שלא נוסחה ברור\n\nהשורה התחתונה:", "timestamp": 1690727795039}]}