{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202001", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: לא מאוד מעניינות, אבל החומר בסוף ניתן להבנה ויוג'ין יודע היטב מה לעשות. חלק מההרצאות כוללות בעיקר דוגמאות שזה נחמד אבל פחות רלוונטי.\n\nשם המתרגל/ת: אהוד / יונתן \nחוות דעת - תרגולים: שניהם מצויינים, יודעים לסנן את העיקר מהחומר. התרגולים ישנים יחסית, יש פתרונות במודל/דרייב. \n\nשעורי הבית: ממוחזרים, ברובם רלוונטים לחומר. \n\nהמבחן: 2 שאלות טכניות ושאלה אחת שדורשת הבנה מעמיקה. הציונים לא היו מדהימים.  \n\nהשורה התחתונה: הציונים לא גבוהים, אבל הקורס אפשרי.", "timestamp": 1616313116310}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: הרצאות ממש מעניינות. וטובות בחצי השני של הקורס ישנם כמה פיתוחים די קשים אבל חשוב בעיקר להבין את הרעיון הכללי ולא להילחץ יוני מצליח להסביר הכל מעולה. התוספות שיוג'ין נותן מהידע הכללי שלו הופכות הכל לעוד יותר טוב \n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: ממש ממש טוב, מעביר חומר מורכב בצורה מצוינת \n\nשעורי הבית: חלקם היו קצת מעצבנים בגלל דיאגרמות מבאסות וכדו' לא להילחץ. העיקר להבין טוב ולא קריטי אם עושים הכל מדויק\n\nהמבחן: הוגן מאד לא קל אבל היו לנו את הכלים להתמודד. חלקו היה מאד הבנתי ולא חישובי\n\nהשורה התחתונה: קורס מעולה", "timestamp": 1647164983144}, {"author": "אני", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פרופ' יוג'ין רבקין\nחוות דעת - הרצאות: הייתי מרותקת לכל מילה שיצאה לו מהפה. יוג'ין מדבר לאט, ויש הרבה סטודנטים שחושבים שהוא משעמם, אבל אם מצליחים לעקוב ולהקשיב לו הוא פשוט מדהים. יש לו כל כך הרבה ידע והוא משלב סיפורים מעניינים ומצחיקים ונותן דוגמאות הזויות (ידעתם שלשוקולד יש דיאגרמת פאזות??). בהרצאות משולבים פיתוחים יחסית כבדים, אין מה לעשות זה קורס בקינטיקה בסופו של דבר, אבל יוג'ין מיוחד ביכולת שלו לפתח את המשוואה בלייב מול הסטודנטים אפילו שהפיתוח יושב על המצגת בלוח שליד. הוא עוקב שלב אחרי שלב, מסביר איזה פעולה מתמטית הוא מבצע ולאן הוא רוצה להגיע איתה, את ההיגיון מאחורי כל דבר, נותן טריקים לבדיקה עצמית, עוצר לחשוב על שאלות של סטודנטים וממש נותן תשובה אמיתית וקונקרטית. נהניתי מכל רגע.\n\nשם המתרגל/ת: מור לוי\nחוות דעת - תרגולים: אם בהרצאות של יוג'ין מקבלים את כל המעבר, את ההבנה, התיאוריה, הרקע, הרעיון הכללי, אז מור מומחית בלתכלס את הכל ולזקק באופן ספציפי בדיוק את מה שאתה צריך לדעת באופן ספיצפי מאוד כדי להצליח לפתור תרגיל מבחן בצורה הטובה ביותר. המרצה והמתרגל ממש משלימים אחד את השני בקורס הזה. \n\nשעורי הבית: סבבה לגמרי, שבועיים אז קצת עומס אבל הם תרגול מצויין לכל נושא ואשכרה עוזרים להטמיע את החומר (שלא כמו בהרבה קורסים אחרים). בערך מאמצע הקורס מתחילות להיות שאלות ממבחנים, אז זה גם באמת מכין אותך.\n\nהמבחן: אמ;לק - תתרגלו מבחני עבר עד שיזרום לכם. \nיש במבחן שלוש שאלות, שתי שאלות די רגילות שדומות לשיעורי בית בסך הכל ועוד שאלה אחת שיוג'ין כתב. \nעכשיו תנו לי שנייה לדבר איתכם על שאלת יוג'ין. \nיש לו דרך מיוחדת לכתוב שאלה ברמה יחסית גבוהה יותר משתי האחרות, בגלל שהיא דורשת הבנה מאוד עמוקה של החומר ויכולת יישום גבוהה שלו. \nהוא אוהב לקחת נושא שאנחנו יודעים את העקרונות שלו מהקורס וליישם אותו על גיאומטריה חדשה או בסביבה חדשה (לדוגמא - למדנו על חישוב של משהו בגיאומטריה כדורית, אז במבחן הוא ייתן סיטואציה דומה אבל עם קוביות או משושים. למשל צריך ליישם קונספט אנרגטי במערכת שכביכול נראית הזויה ולא קשורה, אבל כשחושבים על זה רגע, ברור שלכל גורם במערכת יש אנרגיה מסויימת ואפשר להבין איזו מהן יותר גדולה או קטנה מהאחרות). \nכלומר, צריך לקחת צעד אחורה, לחשוב על המערכת עצמה, לא להילחץ מהסיפור מעטפת המוזר ולנסות להבין מה הוא מנסה להגיד לנו.\nזו שאלה שלוקחת קצת יותר זמן, ואולי אני מוזרה, אבל אני נהניתי לפתור את השאלות שלו כל פעם מחדש כי הן ממש מראות לך שאתה מבין קונספטים בסיסיים.\n\nהשורה התחתונה: לא יודעת אם רואים אבל זה הקורס האהוב עליי בתואר. השתמשתי בעקרונות וברעיונות שלמדתי בו בהרבה קורסים אחרים. זה קורס במדע חומרים פרופר, אולי הקורס הראשון שבו הרגשתי שאני סוף סוף לומדת את המקצוע. לא קל אבל שווה כל רגע!", "timestamp": 1676214347792}, {"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: יוג׳ין רבקין\nחוות דעת - הרצאות: לפעמים מעניינות לפעמים פחות, תלוי גם בשעה\n\nשם המתרגל/ת: יוני צימרמן\nחוות דעת - תרגולים: קצרים ועמוסים\n\nשעורי הבית: סבבה כזה\n\nהמבחן: תמיד ימצאו דרך להפתיע\n\nהשורה התחתונה: קורס מעניין", "timestamp": 1677673501033}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: יוג'ין רבקין\nחוות דעת - הרצאות: יוג'ין מדבר לאט ובצורה מאוד מונוטנית ומרדימה. הדרך היחידה לצפות בו זה בהקלטות כפול 2 וגם משם קשה להבין מה רלוונטי ומה לא \n\nשם המתרגל/ת: יונתן צימרמן\nחוות דעת - תרגולים: המתרגל הכי טוב בטכניון, משקיע מאוד ומנסה לתת את מקסימום ההבנה שניתן ב50 דקות\n\nשעורי הבית: מאתגרים אבל מרופרנסים, חלקם ממבחנים גם \n\nהמבחן: המבחן היה מאוד קשה, מאוד שונה ממה שהועבר בהרצאות וברמת מחשבה וקושי הרבה יותר גבוהה\n\nהשורה התחתונה:", "timestamp": 1678803810900}, {"author": "is", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: יוגין\nחוות דעת - הרצאות: לא נחוץ\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: מעביר ממש טוב את החומר הממש קשה\n\nשעורי הבית: די קשים\n\nהמבחן: ממש קשה אבל היו אצלנו ציונים טובים כי הסגל התחשב במצב\n\nהשורה התחתונה: קורס ממש קשה", "timestamp": 1714556924067}]}