{"posts": [{"author": "ins", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: מיטל ממש באה לקראת הסטודנטים וממש מקסימה, אבל לא מאוד קריזמטית אז קשה להקשיב לה לארוך שעתיים הרצאה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים\n\nהמבחן: קצת הזוי ולא קל בכלל, לא קיבלנו ציונים אבל השמועה אומרת שהציונים גבוהים גם אם לא הלך לך טוב במבחן (מקווה שזה נכון)\n\nהשורה התחתונה:", "timestamp": 1677508110641}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות:\nמאוד נחמדה מאוד מנסה לבוא לקראת הסטודנטים: בגלל המלחמה ביטלה את המבחן ובמקום היה עבודה להגשה- עם ממוצע יותר גבוה משנים קודמות, הורידה את מספר תרגילי הבית שהיינו צריכים להגיש, גם יש תרגילי בונוס קלים במהלך ההרצאה עצמה\nחוץ מזה שמתחילה כל הרצאה במימז והרבה פעמים מביאה עוגיות להפסקה\nהיא פשוט לא קריזמטית והרבה פעמים החומר שהיא עוברת עליו בהרצאה מאוד פשוט גם אם בשיעורי בית זה לא תמיד משתקף\nשם המתרגל/ת: אחת לכמה הרצאות תרגול עם מיטל\nחוות דעת - תרגולים:\nלא שונה במיוחד מההרצאות עצמן, בדר\"כ פותרים שאלה דומה מאוד לשיעורי בית של אותו שבוע\nשעורי הבית:\nמאוד לא קונסיסטנטים, חלק ממש קלילים וחלק קשים ממש. הבודק מאוד קשוח ומוריד הרבה נקודות גם על שטויות\nהמבחן:\nהייתה עבודה להגשה, מאוד כללית אבל בסה\"כ לא לקח מלא זמן והיה אפשר לעשות בזוגות ושלישיות", "timestamp": 1715017703459}, {"author": "רונגה קוטה", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: קצת קשה לעקוב, דיי בslow motion, אבל מיטל כן מנסה לתגמל ולעודד סטודנטים להיכנס להרצאות באמצעות תרגילי בונוס לציון וכיבוד בהפסקות. היא באה לקראת הסטודנטים והמירה את המבחן לעבודה מסכמת בזוגות - שלשות, בנוסף לקיצוץ בחובת ההגשות לתרגילי בית. סה\"כ מרצה נחמדה וקשובה.\n\nשעורי הבית: מיטל כאמור קיצצה בתרגילי הבית - בהתחלה 10 הגשות תקפות ולבסוף 7 הגשות מתוך 10. הגליונות היו פעם ארוכים וחופרים עם הרבה פייתון/מטלב ופעם קלילים וקצרים. הבודק של הגליונות הוריד על שטויות, כך ש100 בגליון הוא לא משהו מובטח, מבאס קצת בעיקר שהם תקפים.\n\nהמבחן: לא היה, הומר לעבודת הגשה בזוגות/שלשות. ההוראות היו מאוד כלליות, לבחור שיטה שנלמדה בקורס וליישם אותה בנושא לבחירתנו בהנדסת חומרים. מיטל מבקשת גם לראות את חלוקת העבודה ודורשת שלכל סטודנט יהיה חלק משלו בעבודה. העבודה לקחה זמן אבל בסופו של דבר הרגיש לי שיש שימוש לתיאוריה בקורס, דיי אהבתי. כן ההוראות הכלליות בעייתיות בעיקר למי שלוקח את הקורס בשנה שנייה (מקדים אותו), כאשר עדיין לא יודעים מה זה הנדסת חומרים.\n\nהשורה התחתונה: החומר היה דיי משעמם, ובדיעבד לא מרגיש שלמדתי הרבה, כן נחמד ההיבט היישומי בעבודה המסכמת.", "timestamp": 1715067357605}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יחסית קלים \n\nהמבחן: הייתה עבודה להגשה עם ציונים מוגרלים לחלוטין. ניכר שמיטל לא לוקחת ברצינות את הציון שהיא נותנת לסטודנטים אבל בכל מקרה תסיימו עם ציון מעל 80 ואפילו 90 ומעלה\n\nהשורה התחתונה:", "timestamp": 1716469898659}]}