{"posts": [{"author": "Lir", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה: פנינה רוזנברג\nחוות דעת - הרצאות: מאוד מעניין, הוסיפו לי הרבה ידע על השואה ועל הנאציזם שלא ידעתי לפני. לדעתי מרתק ופנינה מדהימה ומעניינת. הסרטים שהיא בחרה מעולים לדעתי.\n\nשעורי הבית: אין\n\nהמבחן: ממוחזר מסמסטרים קודמים, קל מאוד, גם אם לא היה ממוחזר הייתי יודעת לענות כיזכרתי את העלילות שלהסרטים ואת הדברים שפניהנה דיברה עליהם. אני למדתי אליו יום אחד- קראתי את החומר שהעלתה למודל ועניתי בעצמי ע שאלות ממבחנים קודמים שמצאתי בדרייב. המון שאלות חזרו על עצמן.\n\n\nהשורה התחתונה: אחלה מל\"ג, ממוצע שואף ל100", "timestamp": 1597745631500}, {"author": "SR", "difficultyRank": 1, "generalRank": 5, "semester": "201802", "text": "מלג מומלץ מאוד. מבחן ממוחזר ברובו ויש סיכומים מסודרים להכל במודל. המרצה מקסימה והמלג די מעניין.", "timestamp": 1597749965355}, {"author": "ניצחון הרזון", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "מלג קצת overrated אבל הוא קל אין ספק, ופנינה מאוד חמודה\nהחומר מעניין אם יש לך אשכרה זמן להקשיב לה בזמן שיעור (לי לא היה)\nהיא ביקשה שנראה סרטים ומצגות לפני השיעור שזה חתיכת באסה אבל בטח בפרונטלי זה לא יהיה ככה יותר\nעשתה מבחן יותר טריקי ממה שיש בדרך כלל אצלה אז אני רוצה להודות לך אישית פנינה על זה שחשבת שאנחנו יותר חכמים מסמסטרים קודמים שמגיע לנו מבחן עם קצת שאלות על דברים איזוטריים, אבל אופסי מסתבר שלא!", "timestamp": 1625029886651}, {"author": "אלון", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ד\"ר פנינה רוזנברג\nחוות דעת - הרצאות: קורס מאוד מומלץ (כמו כל הקורסים שפנינה מעבירה בטכניון)- קורס מעניין, מלמד ועם ממוצע מאוד גבוה.\n\nהמבחן: המבחן קל, פנינה לא מנסה להכשיל ובמידה וקראתם את הסיכומים (שהיא מפרסמת) לפניי המבחן, מובטח ציון גבוה.\n\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1656775114134}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פנינה\nחוות דעת - הרצאות: הרצאות מעניינות למי שבאמת מעניין אותו הנושא, פנינה מקסימה ובאמת עושה את השיעורים מהלב.\nכל שיעור היא מסבירה על הסרט מראש ובסוף רואים גרסא מקוצרת. נוכחות חובה- כל שיעור חותמים על דף נוכחות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: יש מטלת אמצע קורס, לא משהו נוראי, דורש אבל כמה שעות אז להיות מוכנים לזה.\n\nהמבחן: אמריקאי וקליל, אם קוראים את הסיכומים לפני ובאמת צופים בסרט בכיתה ומקשיבים לה זה 100 קל.\n\nהשורה התחתונה: המל\"ג הכי מומלץ שיש. גם מעניין וגם 100 קליל. אם יש לכם הזדמנות- תחטפו אותו.", "timestamp": 1690323154031}]}