{"posts": [{"author": "אורן", "difficultyRank": 1, "generalRank": 2, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמבחן קשה ביחס למל\"ג - דורש לימוד של יומיים/שלושה לפחות בכדי להבטיח ציון גבוה\nהשורה התחתונה:", "timestamp": 1599485386576}, {"author": "תו נחימוב", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אביטל פולק\nחוות דעת - הרצאות: ממש ממש מעניינות, מרגישים שאביטל משקיעה בשביל שיהיה מעניין והביאה לנו גם דברים אקסטרה לשיעורים. מאד נהניתי.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלים\n\nהמבחן: קצת מתחכם.. לא מאה ודאי\n\nהשורה התחתונה: נהניתי בשיעורים ומהקורס, אבל צריך קצת להתכונן למבחן ולא מובטח 95+.", "timestamp": 1599885346424}, {"author": "רירי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: מעניינות מאוד, המרצה מעבירה את החומר בצורה ברורה ופשוטה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: צריך לענות על 5 פורומים במהלך הסמסטר, כל פורום מתייחס לנושא שנלמד בהרצאות, כדי לצבור 20 נקודות. אפשר לקבל נקודות בונוס דרך מענה על שאלונים ומבחני קאהוט.\n\nהמבחן: לא היה מבחן, היה פרויקט סיום שזה 80% מהציון.\n\nהשורה התחתונה: קורס סבבה", "timestamp": 1612562547954}, {"author": "האווז", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nאביטל בינה-פולק.\nחוות דעת - הרצאות: \nמעניינות, אבל יש חובת נוכחות. מאז הצבא אני לא אוהב חובה. חבל גם שהיו בזום ועוד בשמונה וחצי בבוקר כשיש לי שיעור פרונטלי אחרי זה. \n\nשעורי הבית: \nקצת פורומים, לענות על שאלות/להביע דעה. נחמד, אבל לא הכי ברור לך לאורך הדרך איך הביצועים שלך מחושבים ומה הציון שתקבל. כדאי פשוט לחפור.\n\nהמבחן: \nלא היה מבחן, היה פרויקט. נחמד סה\"כ.\n\nהשורה התחתונה: \nלא מל\"ג שהייתי ממליץ, עמוס מדי. מל\"ג טוב זה מל\"ג מנוחה. מה גם שהתרשמתי שלמרצה יש דעה קצת חיובית מדי בנוגע למשטר הסיני, חשוד.", "timestamp": 1626108028074}, {"author": "ש.", "difficultyRank": 4, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אביטל \n\nהקורס מאוד מעניין והמרצה נחמדה, אבל לדעתי הדרישות גבוהות מדי וזה דורש יותר מדי השקעה.\n\nהקורס השתנה ככה שעכשיו יש עבודה להגשה במקום מבחן (העבודה לוקחת יומיים-שלושה) ובנוסף יש המון שיעורי בית.\nבסמסטר הנוכחי אביטל ביצעה פיילוט של בינה מלאכותית שנותנת ציונים לשיעורי בית וזה היה מאוד מתיש כי היא גם דירגה לפי הפעילות במערכת מה שדרש מאיתנו להיכנס כל הזמן ולכתוב או להגיב דברים.\n\nמצד שני, אביטל פירגנה בציונים לעבודות. יש נוכחות חובה כמו בהרבה מלגים אחרים.", "timestamp": 1626244394703}, {"author": "dont trust china", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: דורש הרבה יותר מדי. מוגזם ממש\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי בית עם ציון יחסי שצורכים המון כדי להשתתף יותר מחברים בפורומים.\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1637649597574}, {"author": "אמא נמרה", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אביטל מעבירה את ההרצאות באופן מעניין. המון דוגמאות, סרטונים וכו'. לפעמים בדקה נוכחות ולפעמים לא.\n\nשעורי הבית: פורומים. לענות על 3 מתוך 4 מקנה 12 אחוז מהציון הסופי- תקף.\nחופרים מאוד. באמת לא פרופורציונלי למל\"ג. הציונים יחסיים וצריך לכתוב כל הזמן תגובות כדי לקבל את מלוא הנקודות.\n\nהמבחן: ניסוחי שאלות מבלבלים. מסיחים לא פשוטים. 10 שאלות של 2 נקודות (תאריכים חשובים) ועוד 20 שאלות של 4 נקודות (פה היא התחכמה לא מעט). ממוצע מועד א' היה 90, אחרי 12 נקודות של פורומים ונקודת בונוס נוספת.\n\nהשורה התחתונה: מלג שמצריך להיות עם יד על הדופק. לא מאוד מומלץ.", "timestamp": 1643541339428}, {"author": "כינוי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  אביטל\nחוות דעת - הרצאות: מעניין מאוד, יש בהרצאות לא מעט דיונים, וזה פחות חופר ממל\"ג שסתם זורקים עלייך מידע וצריך לשנן אותו בסוף. אביטל מרצה טובה ממש.\n\nשעורי הבית: יש 3 פורומים ארוכים שצריך לענות עליהם. כל פורום הוא שאלה פתוחה, שאתה צריך לכתוב חצי עמוד עליה. אחר כך צריך לעבור על התשובות של כל שאר הסטודנטים ולהגיב להם, ככה במשך שבוע. הציון יחסי, אז אם לא הגבת מספיק ביחס לסטודנטים האחרים תקבל ציון נמוך.\n\nהמבחן: מבלבל מאוד, היו הרבה שאלות עם תשובות מתחכמות ולא חד משמעיות. אין מיחזור שאלות מסמסטרים קודמים. ציונים לא גבוהים יחסית למל\"ג.\n\nהשורה התחתונה: מומלץ רק אם הנושא ממש מעניין אתכם...", "timestamp": 1644762210719}, {"author": "Tamir Shriki", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: \nמעולות. החומר מרתק והמרצה מעולה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nצריך לענות על 3 פורומים ולפתח דיון. קצת מציק אבל לא קשה לקבל 100\nהמבחן: \nאמריקאי. צריך ללמוד ולדעת את החומר, אבל גם בו אפשר להוציא אחלה ציון\nהשורה התחתונה:", "timestamp": 1647505355469}, {"author": "I", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות:\nאביטל מעבירה את השיעורים בצורה טובה מאוד ומעניינת, מעלה הרבה שאלות לדיון בכיתה ובאופן כללי גם בחירת הנושאים המוצגים בקורס מוצלחת.\n\nשעורי הבית: \nאין שיעורי בית, אלא לוג כתיבה בעשר דקות האחרונות של השיעור. לפעמים אביטל מבקשת לקרוא מאמר לטובת הכנה לשיעור ובדרך כלל המאמרים מעניינים ולא לוקח יותר מידי זמן להבין את העקרון.\n\nהמבחן: \nלא היה מבחן בסמסטר שלנו, אלא פרוייקט סיום שכל קבוצה הציגה. לדעתי היה ממש מוצלח וגם היה מעניין לראות מה כל קבוצה עשתה.\n\nהשורה התחתונה: \nקורס מומלץ וכיפי, אפשר ללמוד ממנו הרבה!", "timestamp": 1676378007337}, {"author": "נופר", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביטל פולק\nחוות דעת - הרצאות: מעיינות מאוד, מעלים דיונים מאוד מרתקים במהלך ההרצאות.\n\nשעורי הבית: אין ש\"ב, יש לוג קצר שצריך לעשות במודל בכל סיום שיעור, צריך לעשות לפחות 10 לוגים, אין ציון עליהם, היא רק רוצה לראות שהקשבנו בשיעור. לפעמים יש מטלה לקרוא מאמר באנגלית או בעברית לפני השיעור\n\nהמבחן: היה פרויקט שמציגים בשלשות בסוך הסמסטר שעליו רוב הציון, הציונים נעו בין 85-95\n\nהשורה התחתונה: מאוד מעניין, בכלל לא עמוס, רק הפרויקט צריך לשבת עליו קצת", "timestamp": 1677329789402}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אביטל חמודה רמות וההרצאות מעניינות ממש. יש אווירה יותר של שיח ודיונים ופחות של להעמיס חומר. יש חובת נוכחות אבל בכיתה תעשו מה שאתם רוצים.\nבסוף כל שיעור כותבים לוג למידה שזה פשוט לענות בכמה שורות על דעתכם לגבי עניין מסוים ואז מסומן הגיש/לא הגיש. צריך להגיש 10 כאלה.\n\nשעורי הבית: מדי פעם קיבלנו מאמר לקרוא שאחר כך מתייחסים אליו בלוג למידה. זה היה בקטנה ואפשר גם לענות בלי באמת לקרוא את המאמר כולו.\n\nהמבחן: לא היה. הגשנו פרוייקט שעבדנו עליו במצטבר כמה שעות בערך והציונים היו טובים.\n\nהשורה התחתונה: מומלץ!!! אין על אביטל.", "timestamp": 1678780480127}, {"author": "Ana", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אביטל נחמדה. אבל ההרצאות משעממות ברמות, היא מדברת על הסין שהיא הדבר הכי מעניין שיש בעולם וזה ממש לא מעניין.\n\nשעורי הבית: בכל שיעור יש הגשת לוג - נוכחות.\nצריך לכתוב פסקה על שאלה שהיא שואלת.\nפעם ב- היה קריאת מאמר שאף אחד לא קורא והיא יודעת את זה ולא אכפת לה. \n\nהמבחן: אין מבחן יש פרויקט סופי (כולל הצעת מחקר באמצע הסמסטר) - לא עמוס בכלל - אבל היא מאוד נודניקית ומצפה שכולנו עשינו מחקר קודם. \nהיא שאלה אותנו אם עשינו פרויקט קודם ואמרתי לה שלא, ובקשתי ממנה עזרה לגבי זה, והיא ממש עזרה.\nהקטע הוא שלפני הגשת הפרויקט שאלתי אותה אם הוא מספיק טוב כדי לקבל ציון של מלג (95+) וביקשתי הערות. היא אמרה שצריך להגיש במודל ולא נתנה הערות, ובסוף נתנה ציון של 90 - לא מרוצה מהציון. לא מומלץ. במיוחד שביקשנו הערות ורצינו לשפר ולא אפשרה את זה.\n\nהשורה התחתונה: לא עמוס למלג, אבל היא מבקשת הרבה תיקונים וקשה לה להיות מרוצה מההגשה.", "timestamp": 1689973700309}, {"author": "שם", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: סופר מעניינות. אביטל היא אישה מאוד מעניינת ויש לה המון ידע. הנושאים היחידים שלא אהבתי היו על chat gpt כי הנושא הזה כבר יותר מידי אכול, והאם צריך יצירתיות במתמטיקה. \n\nשעורי הבית: לוג למידה אחרי כל הרצאה, או על שאלה ספיציפית או על משהו שנאמר במהלך השיעור. \n\nהמבחן: אין. יש פרוייקט שנעשה בקבוצות של 3-4. מבחינת פרוייקטים, זה נורא קל. צריך להגיש \"הצעת מחקר\" שזה בעצם סיכומן קצר על הנושא שרוצים להתעסק בו בפרוייקט (סיכום ספרות מ3 מקורות) והשאלה המרכזית של הפרוייקט ואיך ניישם אותו. הפקויירט עצמו זה מצגת שכולם צריכים להציג - שמים סיכום של המקורות (כמו בהצעת מחקר) ואז איך עניתם על שאלת הפרוייקט. ממש מומלץ לבצע את הראיון כי זה חוסף זמן. קבוצה שלי בקושי השקיעה וקיבלנו אחלה ציון, רק צריך לשים לב שממלאים את כל הדרישות  של הפרוייקט\n\nהשורה התחתונה: אחלה מל\"ג", "timestamp": 1690751136825}, {"author": "?????", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: מעניינת ומפרגנת\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: \n\nשעורי הבית: -\n\nהמבחן: יש פרויקט בקבוצות של 4\n\nהשורה התחתונה: מומלץץץץץץץץץץץץץץץץץץץץץץץץ", "timestamp": 1691741718970}, {"author": "מאו 1949", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: \nמשעממות, נוכחות חובה \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: \nהפעם היא החליטה לעשות גם פרויקט וגם מבחן.\nהמבחן 25 שאלות אמריקאיות לא קלות בכלל וצריך לזכור הכל על מנת להשיג ציון טוב.\nמועד ב לא משוחזר (חוץ מ-4 5 שאלות) וכמו כל קורס בטכניון היה קשה ממועד א ודורש הבנה ולא רק לזכור (תופתעו בשאלות שלא ראיתם בסיכום) \nהשורה התחתונה: אם יש מבחן אז להתרחק כמה שאפשר", "timestamp": 1718356207104}]}