{"posts": [{"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות: הועברו היברידית. לרוב ההרצאה מעניינת אבל לפעמים גם נגררים לוויכוחים על נושאים צדדיים תוך כדי וזה יכול קצת להוציא מפוקוס.\n\nשעורי הבית: היו מטלות קטנות אחרי כל שיעור (בוחן של 2 דקות) למי שלא הגיע פרונטלית. מי שמילא את הבחנים או הגיע פרונטלית קיבל עד 10 נקודות בונוס לציון הסופי. בנוסף הייתה עבודת רשות שנותנת מגן של 25%. עבודה קלה יחסית שדורשת רק כמה שעות ואין סיבה שירד עליה ציון.\n\nהמבחן: היה הסמסטר יחסית קשה. היו קצת יותר התקלות. השאלות הפתוחות היו יותר קלות מהאמריקאיות. הייתה בחירה של 20 מתוך 25\n\nהשורה התחתונה: קורס מאוד מעניין. מי שמחפש מלג של ממוצע 98 זה פחות רלוונטי, אבל מי שמתעניין בנושא או שרוצה לפתוח את הראש לגמרי מומלץ. מתאים גם למי שלא בא מרקע דתי.", "timestamp": 1626104672073}, {"author": "Gadi Nabet", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: הרב אליעד דוקוב\nחוות דעת - הרצאות:  \nמאוד מעניינות ומסקרנות עם הרבה דברים שיתרמו לחיים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nקל מאוד למי שעורב במהלך הקורס\nהשורה התחתונה: \nקורס מאוד מומלץ כקורס שמאפשר להרחיב אופקים בכל מיני תחומים לא בהכרח ידועים", "timestamp": 1635018060579}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: הרב דוקוב\n\nחוות דעת - הרצאות: די משעממות \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש שיעורי בית לקראת כל שיעור שתמיד לא יוצאים בזמן. בחלק מהימים היה לנו רק שעתיים להגיש את השיעורים.\n\nהמבחן: עדיין לא ניגשתי למבחן אבל- המבחן לא ממוחזר. אין מבחנים משנים קודמות. אין סיכומים משנים קודמות. לא ברור מה החומר ואיך לומדים למבחן הזה. לא ברור מה למדנו. הייתי פעיל בכל ההרצאות וזה עדיין לא יעזור לי במבחן כנראה.\n\nהשורה התחתונה: נראה שהחבר'ה הדתיים מכירים את החומר הזה גם ככה ולכן המבחן קטן עליהם. נראה שלחילונים אין באמת סיכוי להצליח בקורס. חובה להגיע לכל ההרצאות. מאוד לא מומלץ.", "timestamp": 1655573160329}, {"author": "סטודנטית", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אלעד דוקוב (רב הטכניון, חוות הדעת מתעלמת מכל הבלאגן סביבו ומנסה להעביר את הדעה נטו על הקורס)\n\nחוות דעת - הרצאות: משעממות ממש וקשה לעקוב אחריהן. מתעסקות בהמון פרטים שאחר כך הוא מצפה שנזכור (אבל אומר שלא צריך), לא מסודרות והשורה התחתונה לא ברורה אף פעם בערך. מעבר לזה, רצוף בבייס אישי (וגם בטעויות אבל זה עוד ניחא).\nלא פרסם את המצגות במהלך הסמסטר לפני השיעורים, מה שמקשה לעקוב. גם כשכן פרסם לא ציין על מה חשוב ומה לא (כי היו דברים שעברנו עליהם דקה ובסוף שאל עליהם).\nנוכחות חובה דרך שאלון בדוקס שדורש לכתוב דברים על מה שלמדנו באותו השיעור.\n\nשעורי הבית: כל שבוע יש שיעורי בית שהם הכנה לשיעור, צריך להכין 8 מתוך 12 כדי לקבל 8 נקודות לציון הסופי. \n- אין עליהם אף פעם פידבק\n- המרצה לא מפרסם מעקב עליהם (והם דרך הגוגל דוקס אז אין איך לעקוב אחריהם בעצמך)\n- הרבה פעמים ניתנים ערב לפני השיעור או בבוקר יום השיעור עצמו (או גם שעתיים לפניו), וזה ממש מעצבן\n- לפעמים הם קלילים ודורשים 10 דקות, לפעמים צריך לקרוא מאמר או לראות סרטון מה שיכול לקחת גם חצי שעה או יותר\n\nמעבר לזה הסמסטר הייתה מטלת מגן בזוגות של 25% שהייתה דווקא די סבבה, מצד שני לא קיבלנו עליה פידבק ולא ידענו אם קיבלנו עליה ציון מלא עד היום (וכבר קיבלנו ציונים סופיים). דורשים צמד של אדם דתי ולא דתי.\n\nהמבחן: פח אשפה. צריך לבחור 20 מתוך 24 שאלות לענות עליהן, 15 אמריקאיות והשאר פתוחות. שאלות על פרטים איזוטריים, ברמת \"האם הציטוט מדויק\" (מדובר בציטוט של פסקה שלמה), דורשים לזכור פרטים שוליים או דוגמאות שנאמרו פעם אחת. גם אם יש זיכרון טוב צריך ללמוד למבחן הזה. מי שלא דתי/ה יתקשה לזכור את הפרטים.\n\nהשורה התחתונה: לא ממליצה בכלל, בייחוד אם אין ידע מראש. כביכול המטרה היא לחשוף אבל בתכלס הקורס פונה למי שכבר יש לו ידע.", "timestamp": 1657444206841}, {"author": "יוסי אבוקסיס", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: \nבגדול שעתיים שהרב מדבר על הנושא שהוא רוצה, בד\"כ קשור למצגות אבל לא בהכרח. היו נושאים מעיינים יותר ונושאים מעניינים פחות, הרגשתי שרוב העניין שהקורס עורר היה בזמן הלמידה למבחן וחומר באמת יכול להיות מעניין.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין.\nשעורי הבית: \nיש סיכום שיעור בסוף כל הרצאה וש\"ב קצרים (פרט ל2 שדרשו קצת השקעה) לפני כל הרצאה. כדאי לעשות אותם כי הם מוסיפים 8-9 נק' לציון הסופי.\nבסמסטר שלנו דוקוב נתן אפשרות לעשות עבודה עם 25% מגן לאורך הסמסטר. אני לא עשיתי כי הייתי עצלן והצטערתי על זה במועד א', לכן אני ממליץ לעשות.\nהמבחן: \nהמועד א' בשבילי היה נורא, השאלות הרגישו על פרטים מאוד לא חשובים בחומר ובניגוד למה שדוקוב אמר (שהמבחן יבדוק הבנה כללית ולא נקודות ספציפיות בחומר). למועד ב' למדתי כמו שצריך (כלומר שיננתי כל מיני עקרונות מרכזיים בקורס) ובסופו של דבר הוא היה די משוחזר ביחס למועד א'.\nהשורה התחתונה: \nלא המל\"ג הכי גרוע שיש אבל גם לא בין הטובים. תלכו לשעת קבלה אצל אלעד לפני המבחן (הוא מכווין יחסית טוב לקראת המבחן עצמו) ואם צריך אל תפחדו לגשת למועד ב' (או לגשת ישר אליו) כי בסמסטר שלנו הוא היה מאוד דומה למועד א'.", "timestamp": 1660477741913}, {"author": "דוד", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: הרב אלעד דוקוב\n\nחוות דעת - הרצאות: הרצאות מאוד מעניינות, הרב מציג נושאים ומשתף על הזמן את הסטודנטים.\nאני לא דתי ומאוד נהנתי בשיעורים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש עבודה שמקבלים עליה בונוס והיא מעניינת וקלה\n\nהמבחן: מבחן אם בחירה.. 3 ימי למידה ואפשר לקבל אחלה ציון\n\nהשורה התחתונה: קורס מעולה!! הרבה יותר טוב מכל המלגים המשעממים שיש", "timestamp": 1673121457733}, {"author": "natan borkowski", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: רב דוקוב\nחוות דעת - הרצאות: מי שמחפש לבוא להתווכח עם הרב דוקוב זה המקום. חולה על שאלות וויכוחים! שאר החומר מאוד מבולבל...קופצים בין חוטי מחשבה של הרב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש כל שבוע- לא חובה. ציון מגן \n\nהמבחן: רובו אריקאי שמי שקרה את הסיכום לפני המבחן ידע לענות. השאלות הפתוחות גם אפשר לעבור את רובן עם הסיכום בלבד...אבל יש כאלה שדרשו הקשבה בכיתה.  אבל לזכור שיש הרבה שאלות בחיאה ככה שאפשר למצוא את השאלות שיודעים ולדלג על השאר\n\nהשורה התחתונה:", "timestamp": 1693818314386}]}