{"posts": [{"author": ".", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: בטי \nחוות דעת - הרצאות: נוכחות חובה, פונה מדי פעם לכל אחד שיקרא מהספר/ יקריא שיעורים \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל שיעור יש שיעורי בית שבשיעור אחרי בודקים, היא פונה לכל אחד כדי לבדוק שהוא עשה \n\nהמבחן: בסדר יחסית, נוסף גם לכתוב חיבור על תמונה שהיא מביאה\n\nהשורה התחתונה: קורס עם ציון גבוה אבל עם יחסית הרבה השקעה", "timestamp": 1626269691353}, {"author": "adi fishman", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: בטי קוסובסקי\nחוות דעת - הרצאות: המרצה מהממת! חבל שלא יצא לפגוש אותה בשיעורים פרונטליים. מעבירה את השיעור בקלילות ועם הומור, סבלנית מאוד עם כל הסטודנטים.\n\nשעורי הבית: אחרי כל שיעור יש כמה תרגילים לעשות בבית, שבודקים בשיעור שאחרי. כדאי לעשות כי דברים נבנים אחד על השני תוך כדי הסמסטר, אבל זה לא משהו שלוקח הרבה זמן.\n\nהמבחן: הוגן ולא קשה\n\nהשורה התחתונה: קורס כיף עם ממוצע גבוה, מאוד מומלץ!", "timestamp": 1626811865989}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: בטי\nקורס מאוד נחמד למי שרוצה ללמוד את הבסיס של הספרדית. לומדים לקרוא ולכתוב, פחות דגש על דיבור למרות שמדי פעם המרצה פונה בשיעור וצריך לענות / לנהל שיחה קצרה.\nנוכחות חובה, והיא מקריאה שמות.\n\nשעורי הבית: כמה תרגילים קצרים אחרי כל שיעור. יכול לקחת עד שעה. עוברים על זה יחד בשיעור אחרי.\nצריך להגיש עד סוף הקורס (אצלנו היה אפשר להביא למבחן) חיבור קצר, סדר גודל 5 שורות על נושא שהיא אומרת.\nבשיעורי בית האחרונים היא הביאה מבחן לדוגמא, זה היה יותר ארוך אבל הכנה טובה למבחן.\n\nהמבחן: בכתב, הרוב פורמט סגור של להשלים מילים / להטות פעלים / לסדר מילים מבולגנות למשפט בסדר הנכון. הכל הוגן ובאותו סגנון שאלות שמתרגלים לאורך הסמסטר ודומה למבחן לדוגמא. יש גם חלק שצריך לכתוב חיבור קצר על תמונה. \n\nהשורה התחתונה: יותר השקעה ממלג ממוצע כי באמת צריך לתרגל לאורך הסמסטר. מומלץ למי שרוצה ללמוד את הקורס. אם מחפשים רק ציון עדיף לחפש משהו אחר.", "timestamp": 1675675858915}, {"author": "מ", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: בטי\nחוות דעת - הרצאות: \nחמודה מאוד, לא המרצה הכי טובה בעולם אבל עושה את העבודה ודי נחמד בשיעורים אבל קחו בחשבון שצריך להשקיע יחסית למלג/בחירה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: פייר לגמרי, יום יומיים מספיק ללמוד אליו\n\nהשורה התחתונה: סבבה", "timestamp": 1679668138452}, {"author": "אסקמה גרמטיקל", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: בטי\nחוות דעת - הרצאות: בטי מרצה מקסימה, משעשעת, עם חוש הומור. קלילה, אוהבת לספר לא מעט דברים על עצמה ועל ספרד וארגנטינה. השיעורים מעניינים ונינוחים, לא קשים ולא אינטנסיביים. היה לי קצת מוזר שהכול התנהל בשפה העברית ושלא ממש דיברנו באמת בספרדית חוץ מהקראת טקסטים. עם זאת בהחלט למדנו לקרוא ולכתוב.\n\n \n\nשעורי הבית: אין הרבה. עובדים דרך החוברת, שלצערי לא כל כך ברורה (הכול צילומי דפים) ומיושנת. יש צורך להגיש גם טקסט אחד. היה בוחן אמצע (רשות) שבו לא ממש הפצצנו כי כנראה שלא ידענו על מה היא הולכת לשאול והיו משימות קצת מפתיעות שם.\n\nהמבחן: בניגוד לבוחן אמצע, המבחן היה נינוח ודי קליל. \n\nהשורה התחתונה: עם בטי היה טוב מאוד, המרצה פורשת לפנסיה אז אין לדעת איך החויה תהיה עם מרצה אחרת בעתיד. הקורס נינוח, קליל, לא דורש הרבה השקעה פרט להכנה למבחן עצמו.", "timestamp": 1688402155635}, {"author": "מציל סטודנטים", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: בטי\nחוות דעת - הרצאות: אלופה! אין כמוה בעולם! מעבירה את החומרה בצורה מעניינת ומצחיקה, נותנת תחושה טובה גם למי שמגיע בלי שום רקע ולא יודע מילה בספרדתית.\n\nשעורי הבית:  מידי פעם יש כמה תרגילי בית קצרים שבודקים אח\"כ איתה בכיתה, אף אחד מהם לא היה להגשה באמת אבל היא מוודא שכולם הצליחו לעשות הכל.\n\nהמבחן: סבבה לגמרי, בלי טריקים מיוחדים או דברים שלא ראינו\n\nהשורה התחתונה: אחלה של קורס מבוא למי שמעוניין להתחיל ללמוד ספרדית", "timestamp": 1689174966399}, {"author": "אנריקו אינגלסיאס", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פלורה מנדוזה\nחוות דעת - הרצאות: \nמרצה מושלמת, היה כל כך כיף בהרצאות, הרבה צחוקים, יש קהוטים כל סוף נושא, עם פרסים. כיף ללמוד איתה והייתה לנו קבוצה ממש טובה.\n\n\nשעורי הבית:\nיש מטלות שבועיות של להקליט את עצמך מדבר ספרדית, זה די קליל, נגמר טוב חמש דקות.\nיש בוחן אמצע שהיה במודל והוא היה לגמרי פייר.\nפרוייקט סופי של מצגת/קהוט - ממש סבבה.  \n\nהמבחן: \nפייר לחלוטין, לא משהו שלא ראינו בהרצאות\n\nהשורה התחתונה: \nהקורס הכי כיפי שלקחתי בטכניון.", "timestamp": 1713420814590}]}