{"posts": [{"author": "ענייי", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות מעניינות מאוד, מוסיפות הרבה ידע אם מעניין אתכם מוזיקה ותיאוריה בסיסית\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nמורכב משני חלקים. חלק ראשון שאלות על מושגים, אם מכירים פחות או יותר ועוברים על המקראה הוא לא בעיה בכלל. החלק השני קשוח בטירוף. דורש ידע מעמיק בזיהוי בערך 10 יצירות מוזיקה קלאסית, כאשר כל יצירה היא בין חצי שעה לשעה. משמיעים קטע של כמה שניות וצריך לזהות את היצירה מתוכו.\nהשורה התחתונה: אמנם מעניין, אבל אם אתם לא ממש ממש אוהבים מוזיקה קלאסית ומוכנים לחרוש הקשבה עירנית במשך שבוע לפני הבחינה, לא מומלץ. קיבלתי 79.", "timestamp": 1610873610089}, {"author": "bach", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: \nמעניין סה\"כ, לבוא עם ראש פתוח.\nמקשיבים למוזיקה , מדברים עליה לפי מרכיביה השונים וכו' וכו'\nההרצאות היו בזום וזה טיפה ביאס, בפרונטלי מאמין שהייתי נהנה עוד יותר.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\"להקשיב למוזיקה\"\nהמבחן: \nאמריקאי\n60%  נק' על להיות שזאם אנושי על רשימת האזנה שניתנה בתחילת הסמסטר. אם מקשיבים לה במהלך הסמסטר ומחברים לנאמר בהרצאות זה ממש סבבה.\n40% מושגים מההרצאות (יש במקראה מושגים שלא מופיעים בהרצאות) . היה יחסית קל. מספיק להסתכל על המושגים טיפה במהלך הסמסטר ולקראת מבחן מספיק לעבור על זה בשעה-שעתיים.\n \nהשורה התחתונה: \nמלג מומלץ למי שאוהב מוזיקה קלאסית.\nחשוב לשמוע את הפלייליסט במהלך הסמסטר! אפשר במהלך פתירת שיעורי בית/ לימודים אבל מידי פעם (ובעיקר בשבועות לקראת המבחן) לבצע האזנה יותר מעמיקה.", "timestamp": 1625139109590}, {"author": "Hyunjoon Watterson", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "חוות דעת - הרצאות: \nהיה בזום. עוברים על המצגות. קצת מושגים במוזיקה. שומעים קצת מוזיקה ומנתחים את הרכיבים. קליל.\n\nשעורי הבית: אין\n\nהשורה התחתונה: \nאל תקחו את הקורס אם אתם לא אוהבים מוזיקה קלאסית, ואם אין לכם ידע מוזיקאלי כלשהו.", "timestamp": 1626291798961}, {"author": "עמנואל זלצמן", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דר. אופנהיים רועי\nחוות דעת - הרצאות: חייב לבוא לכולן, מל\"ג מאוד מהנה אבל דורש נוכחות וקשב\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: -\n\nהמבחן: לדעתי היה מאוד מאוד פייר, כן התכוננתי אליו בעיקר לקטעי השמיעה במשך כמה שבועות אבל מי שאוהב מוזיקה קלאסית ואינסטרומנטלית לא יתנגד\n\nהשורה התחתונה: מומלץ למי שאוהב מוזיקה קלאסית ומכיר תאוריה", "timestamp": 1644093866535}, {"author": "אורי דקל", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: מעניינות ממש, כמובן מיועד למי שמתעניין במוזיקה (לא צריך רקע, אבל צריך להיות מוכן להכיר מגוון רחב של שירים וקטעים). בכללי ההרצאות כפיות ממש עם מרצה נהדר, בתחילת כל הרצאה שומעים איזשהו קטע מוזיקלי, ויש המון דוגמאות משירים ישראליים, שירים משנות השישים והשבעים ומוזיקה קלאסית. כן כדאי להקשיב ולכתוב חלק מהדברים כי יכול לעזור במבחן.\n\nהמבחן: מבחן ברמת קושי בינונית עד קל (יחסית למל\"ג). החלק הראשון הוא של זיהוי יצירות מוזיקליות, שקיבלנו רשימה שלהם בתחילת הסמסטר. כדאי לשמוע אותם לכל אורך הסמסטר, המבחן יחסית קל אבל כדאי לזכור את החלקים המרכזיים בכל הקטעים. החלק השני הוא שאלות אמריקאיות על החומר בקורס (ידע כללי במוזיקה). מה שמבאס הוא שאין סיכום של כל החומר בקורס, יש סיכום שמכיל בתוכו את רוב החומר אבל במבחן נדרש לדעת כמה פרטים שהופיעו בהרצאות אבל לא בסיכום. לכן כדאי להתרכז בהרצאות אבל לא צריך לדאוג יותר מדי. \n\nהשורה התחתונה: הרצאות נהדרות ומבחן שעם מספיק הקשבה למרצה ולרשימת השירים אפשר להשיג בו ציון גבוה מאוד.", "timestamp": 1645379339564}, {"author": "רועי אזואלוס", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דר. רועי אופנהיים\nחוות דעת - הרצאות: \nההרצאות מעניינות מאוד למי שמתחבר לעולם המוזיקה(גם קלאסית וגם מודרנית),מעביר את הנושאים בצורה מעניינת ובהחלט נהניתי להגיע להרצאות.\nמה שכן,המל\"ג לחלוטין לא מתאים לכל אחד,ואם אין לכם זיקה לעולם המוזיקה(בדגש למוזיקה קלאסית),עדיף למצוא מל\"ג אחר\n\nהמבחן: המבחן בנוי מ60% של זיהוי יצירות מוזיקליות מתוך רשימת השמעה שמקבלים בתחילת הסמסטר,ו40% לדעת הגדרות מתוך סיכום החומר וההרצאות. ממליץ לשמוע את הרשימת השמעה מתחילת הסמסטר כדי שלפני המבחן כל היצירות יהיו כבר מוכרות לכם.בנוסף,ממליץ לסכם הגדרות כלליות מההרצאות,כיוון שיש דברים שלא מופיעים בסיכום אבל הופיעו במבחן.\n\nהשורה התחתונה: \nמל\"ג מעניין מאוד,אבל אם אין לכם זיקה לעולם המוזיקה ואוזן טובה ליצירות,עדיף למצוא מל\"ג אחר", "timestamp": 1646310999412}]}