{"posts": [{"author": "אין", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "להתרחק מהמל\"ג הזה!!! מאוד לא מומלץ. ציונים נמוכים ושיעורי בית מאוד קשים.\n\nשם המרצה: איילת שביט\nחוות דעת - הרצאות: \nהרצאות נחמדות, אבל זה יותר פילוסופיה מאשר ביולוגיה - אין שום קשר לרבגוניות החיים. רק בסוף הקורס מתברר הקשר בין השניים (רמז: הקשר רופף מאוד).\n\nשם המתרגל/ת: אין תרגולים \nחוות דעת - תרגולים: \n\nשעורי הבית: \nקשים ביותר!!! שיעורי בית ארוכים ובכלל לא פרופורציונליים למל\"ג. ממליץ מאוד להתרחק מהמל\"ג הזה כי הוא מאוד עמוס.\nהמבחן: \nאין מבחן אלא פרזנטציה. אל תתנו לזה להטעות אתכם - הפרזנטציה הזאת קשה ביותר!!! מחלקים אתכם לקבוצות של 4 אנשים בלי לשאול עם מי אתם רוצים להיות. ובפרזנטציה היא קוטלת בציונים. היו כאלה שקיבלו 60 במבחן הסופי למרות שהפרזנטציה שלהם הייתה סבירה עד טובה. לא הגיוני לקורס מל\"ג. \n\nהשורה התחתונה: \nשיעורי בית מאוד ארוכים. גם ביחס למל\"ג, אבל גם ביחס לקורס רגיל הם לא קצרים. (3-4 שעות השקעה כל שבוע!)\nהמבחן/פרזנטציה לא מתגמלים את ההשקעה שלכם בקורס בכלל. להתרחק להתרחק להתרחק.", "timestamp": 1625290613245}, {"author": "עדי", "difficultyRank": 4, "generalRank": 1, "semester": "202002", "text": "אמל\"ק: לא מומלץ\n\nשם המרצה: איילת שביט\nחוות דעת - הרצאות: הרצאות נחמדות, לא סוחף. די חופר בסך הכל\n\nשעורי הבית:  עמוסים מדי. במיוחד ביחס למלג\n\nהמבחן:  קשה מדי ולא מתגמל. יש פרזנטציה אבל היא לפי מחוון ציון נוקשה מאוד.\n\nהשורה התחתונה:  לא מומלץ.", "timestamp": 1625416710526}, {"author": "חיי ברווגוניות", "difficultyRank": 2, "generalRank": 4, "semester": "202003", "text": "שם המרצה: אילת שבית \nחוות דעת - הרצאות: מרצה נחמדה וחביבה, ההרצאות משעממות וסביר להניח שלא תבינו מילה ממה שהיא אומרת אלא אם הרחבתם פילוסופיה בבגרות, אבל היה סמסטר זום ולא בדקו נוכחות אז יכולתי להכחיש את הקורס רוב הסמסטר\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: היא נותנת לקרוא מאמר באנגלית על הוגה פילוסף כלשהו ואז לענות על שאלה פילוסופית, מהר מאוד הבנו שלא חייב באמת לקרוא את המאמר אלא אפשר פשוט להגיב תשובה לא מחייבת כללית שתופסת לכל שאלה פילוסופית שקיימת בעולם \n\nהמבחן: פרזנטציה, מחלקים אותכם לקבוצות באופן אקראי, צריך לבחור איזה הוגה שלמדתם עליו בקורס, לחפש עליו בגוגל, לגלות שאפילו גוגל לא יודע עליו דבר, ואפילו אם היה ידוע משהו לא הייתם מבינים מילה ממה שהם רוצים, ואז לנסות לחרטט איזה טיעון לשאלה פילוסופית ששואלים אותכם. מי שהתנסה בעבר בחרטוט שוטר תנועה על מנת להתחמק מדו\"ח ישגשג בקורס הנ\"ל. בהתחלה קצת פחדנו שהיא תביא ציונים נמוכים אבל בסוף הממוצע היה מעל 90 נראה לי אז הכל הסתדר \n\nהשורה התחתונה: \nהאם היה כדאי להרשם לקורס? האם לא? זאת שאלה פילוסופית שתשובתה נותרה עלומה עד היום (למרות שהממוצע שלי דווקא נהנה מהקורס אז סה\"כ סבבה)", "timestamp": 1626707224407}, {"author": "~", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איילת\nחוות דעת - הרצאות: המרצה כבן אדם מאוד חמודה, אבל קצת חיה בבועה של מרצים של תל חי. המלג הזה היה חפירה אחת גדולה, כל שיעור מחדש היה חירטוטי מוח כלשהם של פילוסופיה (בתור מישהי שלדעתה פילוסופיה זה כן נושא מעניין, אני חושבת שהיא העבירה את זה בצורה מאוד מוזרה) אבל עדיין היה לא נורא לבוא לשיעורים. זאת פעם ראשונה שהמלג הועבר אז לא כל כך ידענו למה לצפות בו גם.\n\nשעורי הבית: כמעט כל שבוע היה צריך לקרוא איזה טקסט פילוסופי ולהגיב עליו. תכלס היה אפשר לחרטט משהו הגיוני וזה היה מספיק, העיקר התגובה. אבל זה כן הצריך זמן ולקח לי בין חצי שעה לשעה בשבוע. זה היה מציק אבל לא כל כך נורא.\n\nהמבחן: היינו צריכים להציג פרזנטציה על סמך דעות של הוגה שהיה באחד הטקסטים. שבוע לפני נפגשנו פעם אחת ועברנו על כל ההוגים כדי להתכונן וזה היה מספיק - לוקח בערך 3-4 שעות לשבת ולעבור על הכל.  ביום של הפרזנטציה היא נתנה לנו טענה ו40 דקות לכתוב את הפרזנטציה - הדעה שלנו, 2 נימוקים בעד נימוק נגד וסיכום וכו' כמו הטקסט של הפסיכומטרי או כמו שעושים בדיבייט. ואז להגיש לה את מה שרשמנו בצורה מסודרת\n\nבמהלך המלג היא גם הוציאה אותנו יום אחד מוקדם בבוקר לטיול לחפש עקבות, זה היה מוזר (כמו כל המלג הזה) אבל היא הביאה מדריך שהיה מאוד נחמד וסהכ היה מרענן לעשות משהו כזה בזמן סמסטר\n\nהשורה התחתונה: לא ידענו מה הולך להיות בו כי זה היה מועבר פעם ראשונה, לי יצא בסדר, וקיבלנו אחלה ציון בפרזנטציה. אבל היו גם כאלה שפחות אז זה קצת סיכון. בסהכ אם באים לכל השיעורים ומקשיבים בכולם אז אפשר להסתדר, אבל בשביל מלג הרגיש עמוס ודרש קצת יותר השקעה.", "timestamp": 1626760797028}]}