{"posts": [{"author": "א", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: כל הרצאה היה מרצה אחר.\nחוות דעת - הרצאות: רוב ההרצאות היו לא משהו, חלק מההרצאות היו מעניינות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: צריך להגיש דף עם כ-10 נקודות שלקחת מכל הרצאה, צריך להיות נוכח ב-10/13 מההרצאות כדי לקבל ציון (נוכח = להגיש דף סיכום)\n\nהמבחן: אין, ואין ציון, יש עובר בינארי.\n\nהשורה התחתונה: קורס חביב, במיוחד אם זה בזום ואפשר לשחק מייפלסטורי תוך כדי שמקשיבים להרצאה.", "timestamp": 1616079672800}, {"author": "א", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "<< משוב עבור סמסטר קורונה שהועבר כולו בזום >>\n\nהקורס הוא השתתפות פעם בשבוע בהרצאה בתחום היזמות, ולשם הוכחת השתתפות צריך לשלוח דף קצרצר עם נקודות שלקחת מההרצאה. הקורס הינו עובר בינארי (ללא ציון מספרי) ולכן לא תופס כמו מל\"ג רגיל.\n\nמאוד מומלץ למי שמתחבר לתחום ואוהב לשמוע הרצאות דומות באינטרנט. היתרון הוא גישה מאוד קרובה ליזמים/מרצים ברמה גבוהה שמוכנים לענות על כל שאלה שיש לך בתחום.\n\nבמהלך סמסטר קורונה, הקורס ממש זרם, איפשר גמישות של הקשבה להרצאות בנוחות של הבית, וכמובן ההרצאות היו מעניינות.", "timestamp": 1616316447123}, {"author": "יזם שלא יוזם", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מרצים מתחלפים\nחוות דעת - הרצאות: \nההרצאות מועברות בכל שבוע על ידי מרצה/יזם אחר.\nישנו על הספות ב-t-hub והקשבנו. הקורס ממש קטן אז לא היה אפשר לעשות דברים אחרים שהם לא להקשיב מבלי שישימו לב.\nהיו הרצאות מעניינות יחסית והיו כאלו שבכלל לא.\nיש חובת נוכחות ואפשר לפספס על 3 מפגשים. היה צריך תוך שבוע לכל היותר להגיש סיכום קצר על ההרצאה ועל דברים שלמדנו ממנה.\nרישום הנוכחות היה במודל, ונפתח רק באמצע ההרצאה, דבר שמאוד הקשה לזכור לרשום נוכחות. חלק קטן מהמפפגשים גם הוקלט כדי שיהיה יותר נוח לסכם את ההרצאות, אבל רוב המרצים לא רצו שיקליטו אותם.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: סיכום שבועי של ההרצאה.\n\nהמבחן: אין\n\nהשורה התחתונה: \nקורס מעניין רק אם אתם מכוונים להיות יזמים, וגם אז לא בטוח.\nשווה רק אם חסר לכם נק\"ז לסגור את התואר, וגם אז אולי כדאי לחפש קורס עם ציון, כי עובר בינארי זה ממש מבאס.", "timestamp": 1678536694396}]}