{"posts": [{"author": "הילה", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אלכסנדר טל\nחוות דעת - הרצאות: וואו, היה לי ממש מעניין ועוד בתור אתאיסטית גמורה. הרגיש כאילו אלכס הציג את חז\"ל כמו שהיו במציאות: כמה אנשים שלוקחים את התנ\"כ שנכתב סה\"כ ע\"י בני אדם בתקופה הרבה יותר עתיקה ולכן הרבה פחות נאורה, ומנסים להתאים אותו להבנת המוסר שלנו כבני אדם בתקופה יותר מאוחרת. עושים הרבה סלטות בשביל זה\n\nהמבחן: היה עם חומר פתוח וכל השאלות ממוחזרות.\n\nהשורה התחתונה: לקחת", "timestamp": 1600178538310}, {"author": "AA", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלכס טל\nחוות דעת - הרצאות: נוכחות חובה אבל בפועל בדק נוכחות פעמיים במהלך הסמסטר.\n\nהמבחן: הסמסטר הוא הוסיף חומר לקריאה עצמית על המשנה (60 ומשהו עמודים) שעל החומר הזה 30 אחוזים מהשאלות במבחן.\nהגעתי למבחן כשאני לא יודע כלום, הדפסתי סיכום ששלחו ואת החומר על המשנה, רוב השאלות היו ממוחזרות וכל מה שלא היה ממוחזר היה אפשר למצוא בקלות בסיכום/בקובץ של המשנה שהוא שלח.\n\nהשורה התחתונה: נבהלתי כששמעתי על החומר לקריאה עצמית אבל בסופו של דבר יצא מלג שווה.", "timestamp": 1644514401600}, {"author": "אא", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלכסנדר\nחוות דעת - הרצאות: סביר, נוכחות חובה אבל הוא בדק רק פעמיים לאורך הסמסטר\n\nהמבחן: אמריקאי עם חומר פתוח ושאלות ממוחזרות. הסמסטר הוסיפו חומר לקריאה עצמית ש30% מהמבחן היה עליו, אז היה פחות ממוחזר הסמסטר. למרות זאת ההכנה למבחן לקחה יום וחצי (אחרי שלא הקשבתי בשום הרצאה), שבהם פשוט עברתי על הסיכום ועל החומר לקריאה עצמית והדגשתי מה שנראה חשוב. במבחן עצמו היה קל יחסית למצוא את התשובות לשאלות הלא ממוחזרות וקיבלתי 100.\n\nהשורה התחתונה: המבחנים החל מסמסטר הבא כנראה יחזרו להיות ברובם ממוחזרים. מל\"ג מומלץ, במיוחד אם אתם מוכנים להשקיע יום אחד להכנת החומר הפתוח לפני המבחן כדי להבטיח 100.", "timestamp": 1645894897959}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אלכס טל\nחוות דעת - הרצאות: \nמעניינות ממש, מסביר בצורה מאוד ברורה. מי שמגיע עם רקע בנושא (למד משנה, גמרא וכו') עלול להרגיש שהקצב איטי לו מדי\nהמבחן: \nמרופרנס כמעט לגמרי. אמריקאי כולו. היו 5 שאלות על שני טקסטים שהוא נתן לקריאה עצמית, אבל השאלות האלה היו קלות ממש למי שקרא פעם או פעמיים את הטקסטים.\nהשורה התחתונה: מעניין ממש, שווה לקחת.", "timestamp": 1647427219381}, {"author": "היי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: טלכסנדר טל\nחוות דעת - הרצאות: \nאין נוכחות חובה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nברובו ממוחזר ויש סיכומים  שעוזרים \nהשורה התחתונה:", "timestamp": 1688739734495}, {"author": "אחד שיודע", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אלכסנדר טל\nחוות דעת - הרצאות: סך הכל בסדר קצת משעממות. הייתי רק ב3 :)\n\nהמבחן: עם יום למידה מהסיכום, מסיימים לפתור את המבחן תוך 5 דקות. סופר ממוחזר ויש הכל בסיכום.\n\nהשורה התחתונה: ה100 הכי קל שתוציאו בתואר ויש בדיקת נוכחות רק פעמיים ככה שאפשר לא לבוא לקורס כל הסמסטר. עקיצה רצינית.", "timestamp": 1689758194084}]}