{"posts": [{"author": "Gur Telem", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: ברוש גיל\nחוות דעת - הרצאות: \nההרצאות מאוד מאוד מעניינות. סגר לי הרבה פינות בתחום ההיטק, מניות, אופציות וכ\"ד שלא ידעתי. דברים שבעייני חשוב מאוד לדעת.\n\nהמבחן: \nאמריקאי אבל.\nמייגע ביותר. כל שאלה 3-5 שורות. כל תשובה (5 תשובות) גם 3-5 שורות.\nהיסטוגרמה מאוד מאכזבת.\n\nהשורה התחתונה: \nעם כמה שהיה מעניין, הלוואי שהייתי לוקח את המל\"ג הזה באיזה פורמט של podcast ולא שאני צריך ללמוד ולהבחן עליו. די הרס לי את החוויה", "timestamp": 1625401768159}, {"author": "Adi", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גיל ברוש\n\nחוות דעת - הרצאות: ההרצאות היו מאוד מעניינות (לדעתי) למי שהתחום של יזמות והייטק מעניין אותו, לומדים על חברות הייטק בישראל מנקודת מבט מאקרו כלכלית, השפעה של חברות בינ\"ל על התחום בארץ, מה נדרש לשם הקמת סטארט-אפ, אקזיט מול צמיחה, ודברים כאלה.\n\nשעורי הבית: אין\n\nהמבחן: 20 שאלות אמריקאיות.\n3 שאלות על קטע קריאה (באורך של כ-3/4 עמוד) שלקוח מתוך כתבה כלכלית כלשהי. כל השאלות ארוכות (3-5 שורות), יש 4 תשובות וגם הן ארוכות (3-4 שורות). לא היו מבחני עבר ללמוד מהם, אבל מי שנכח בהרצאות/צפה בהקלטות אמור להיות מסוגל לענות על המבחן בסבבה.\n\nהשורה התחתונה: קורס מעניין, לא מתאים למי שלא מתכוון בכלל להגיע להרצאות/לראות הקלטות וסומך על סיכומים/שחזורי מבחנים.", "timestamp": 1625403784916}, {"author": "Eden", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  גיל ברוש\nחוות דעת - הרצאות: הרצאות מעניינות מאוד, פותח דלת לכל עולם ההיטק והיזמות. לומדים על סטארטאפים וחברות הייטק בישראל, קצת על מניות ובעלות של חברה, מה נדרש כדי להפוך מסטארטאפ קטן לחברה מצליחה או לעשות EXIT וכל השלבים בדרך, מי הם סוגי המשקיעים השונים, מהן ההשפעות הכלכליות של שוק ההייטק על המדינה ועוד.\n\nהרצאות בזום (סמסטר היברידי), ללא נוכחות חובה.\n\nשעורי הבית: אין.\n\nהמבחן: 20 שאלות אמריקאיות. שאלות ארוכות מאוד שצריך לקרוא בתשומת לב וריכוז. כל שאלה בין 3-5 שורות וכל אחת מהתשובות האפשריות גם הן ארוכות ומבלבלות. 3 שאלות אחרונות מתייחסות לקטע טקסט (לא ארוך במיוחד) שלקוח מתוך כתבה. \nקורס חדש ולכן לא היו מבחני עבר ולא סיכומים. באופן כללי הדרך ללמוד למבחן היא לצפות בכל ההרצאות + לעבור על המצגות. המצגות עצמן לא מספיקות.\n\nהשורה התחתונה: קורס נהדר, היסטוגרמה קצת פחות.\nמי שרוצה קורס קליל שאפשר ללמוד מסיכום יום לפני - כנראה שלא בשבילו...", "timestamp": 1625835644584}, {"author": "Gur Telem", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nכל שאלה (אמריקאיות) באורך של פסקה. רק לקרוא הכל לוקח שליש מבחן.\nהיו כמה שאלות מטעות מאוד והממוצע היה מאוד לא מרשים.\n\nהשורה התחתונה: \nקורס מעניין שהמבחן הרס את החוויה שלו. אפשר לשמוע את ההרצאות בתור podcast תכלס. זה מאוד נחמד.", "timestamp": 1642351511245}]}