{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה:\nדינה רפאל\nשעורי הבית: \nעבור 2 נושאים (מתוך 10) לכתוב 3 טענות בעד ו3 טענות גנד\nהמבחן: \nמקבלים טסקס באורך 2 עמודים. בוחרים מתוכו סוגיה אתית. כותבים 3 טענות בעד ו3 נגד (לא בפסקה, בנקודות, 1,2,3...)\nהשורה התחתונה: \nקורס מעניין ונחמד, מבחן לא קשה", "timestamp": 1600251420277}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: \nאין הרצאות בלייב, המרצה מקליטה מראש ואנחנו יכולים לראות בזמננו הפנוי. חלק מעניין וחלק פחות.\n\nשעורי הבית: \nצריך לכתוב בפורום כל שבוע על סוגיה אחרת, הרעיון הוא שהסטודנטים דנים בינהם על כל מני סוגיות אתיות וחברתיות בהתאם למה שהועבר בהרצאה. הציון על הפורום הוא חלק מרכזי מהציון הכולל בקורס.\n\nהמבחן:\nאין מבחן, יש עבודה שבמסגרתה אנחנו צריכים להקליט את עצמנו דנים בסוגיה אתית/חברתית לבחירתנו במשך כ5 עד 10 דקות. \n\nהשורה התחתונה: \nמל\"ג לא מומלץ. כל הקורס היה נראה שזה קורס קליל שאפשר להוציא בו ציון טוב אם רק כותבים בפורום כל שבוע ומגישים את העבודה בסופו של דבר. בסוף הממוצע היה נמוך משמעותית משנים קודמות. לרבים מהסטודנטים ירד הציון בגלל הדירוג בפורום, למרות שהמרצה אמרה שמבחינתה מספיק לכתוב הודעה אחת בכל דיון, בפועל זה לא היה המצב. לא ממש ברור איך התבצעה חלוקת הציונים בפועל, ולמרצה לא היו תשובות לטענות הסטודנטים.", "timestamp": 1614077935456}, {"author": "מישל פוקו", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: משעממות, מוקלטות מראש בפנופטו ומרגישות ממש באוויר ושקריאה של 5 דקות באינטרנט על הנושא הייתה מלמדת יותר. בשלב מסויים הפסקתי לראות אותן. לא הייתה נוכחות חובה (מי שלא רצה לעשות שיעורי בית יכל להגיע להרצאות בזום במקום)\n\nשעורי הבית: לכתוב בפורום באינטרנט. היה אפשר גם להגיש במודל או להגיע לשיעור בזום במקום. קצת חופר אבל קל למצוא לזה כמה דקות במהלך השבוע.\n\nהמבחן: יש עבודה שהיא 4 שקפים בפאוורפוינט. \n\nהשורה התחתונה: משעמם. קיבלתי 100, אבל היה צריך בשביל זה לחפור די הרבה בפורום ולוודא שהמרצה אוהבת את הנושא שבחרנו לעבודה.", "timestamp": 1626499164437}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: \nסבירות\n\nשעורי הבית: \nלכתוב בפורום כל שבוע + הצגה של מאמר ארוך ומשעמם לכיתה\n\nהמבחן: אין\n\nהשורה התחתונה: לברוח כמו מאש. המרצה החליטה להוריד ממוצעים אז אחרי שאתה כל שבוע משקיע את הנשמה בכתיבה בפורום אתה מקבל על זה ציונים סביב ה 70 בלי שום הסבר. המרצה מגרילה ציונים אקראית. מורידה ציונים על קריטריונים שלא בסילבוס. ביזיון.", "timestamp": 1646084045690}, {"author": "אין", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: \nנחמדות - הועבר בזום\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש מטלה שבועית לכתוב בפורום על סוגיה שהיא מעלה \nהמבחן: \nאין אך יש עבודה בקבוצות, קריאת מאמר וכתיבת מצגת. כל קבוצה מציגה פעם אחת במהלך הסמסטר כך שבפועל כל שבוע יש קבוצה מציגה. \n\nהשורה התחתונה: \nלהתרחק !! על פניו קורס קליל ויחסית מעניין אך למי שחשוב הציונים או לפחות שמידת ההשקעה תשתקף בציון אין טעם להירשם לקורס. \nהמרצה נתנה ציונים אקראית מבלי להתייחס למטלות שהוגשו. \nטווח הציונים 80-95 (הרבה קיבלו סביב ה80)\nמאכזב מאוד.", "timestamp": 1647798868208}, {"author": "DK", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "הקורס הכי משעמם שתעשו בתואר", "timestamp": 1673771351088}, {"author": "G", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: הנושאים דווקא יחסית מעניינים. היא מדברת על דברים יחסית רלוונטיים \nשעורי הבית: לכתוב כל שבוע דעה על הנושא שעוסקים בו\nהמבחן: אין. צריך לעשות פרזנטציה על נושא מתוך רשימה.\nהשורה התחתונה: עמוס מאוד יחסית למלגים.\n\nשימו לב\nמאז חורף 22/23, זה לא בזום, ויש חובת נוכחות", "timestamp": 1673876057152}, {"author": "אני", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: לעיתים מעניינות ולעיתים קשה להבין את הפואנטה. אבל דינה מאוד משתפת את הסטודנטים ובסך הכל כיף להיות בשיעור.\n\nשעורי הבית: לענות בדיונים, דורש קצת לחפור אבל זה ממש קליל ולא מעיק. ועבודה אחת להגשה שהיא ממש ממש בקטנה, אין על המלגים של דינה, אין הרבה השקעה, אין מבחן ואפשר להנות מהשיעורים שלה בכיף בלי צורך לסכם.\n\nהמבחן: אין\n\nהשורה התחתונה: מאוד ממליצה", "timestamp": 1678960731681}, {"author": "בוב", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: עדיף לראות צבע מתייבש. דינה מרגישה מאוד בנוח לדבר על דברים שהיא לא מבינה בהם, וכל פעם שהוא פותחת את הפה אין שום קשר בין ההתחלה של המשפט לסוף של המשפט. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס ממש גרוע ומשעמם, ציון רנדומלי בסוף, לא כזה גבוה לעומת מלגים אחרים. זה היה פשוט שעתיים של סבל פעם בשבוע.", "timestamp": 1691844180566}, {"author": "חוג כדורסל עם יחידה", "difficultyRank": 1, "generalRank": 3, "semester": "202302", "text": "בגדול קורס בסגנון של ״חברות הקרם הגנה המציאו את השמש כדי למכור יותר קרם הגנה״.\nאין כזה הרבה דרישות חוץ מלהגיע ולעשות פעם אחת הרצאה של 20 דקות על מאמר מלפני מלא שנים שכבר לא רלוונטי.\n\nהשורה התחתונה: \nאחלה של דרך לעלות את הממוצע למי שאוהב לקום להרצאה ב8:30 בראשון בבוקר.", "timestamp": 1719686526103}]}