{"posts": [{"author": "דוב", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביטל בינה\nחוות דעת - הרצאות: לא הייתי באף הרצאה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אין מבחן\n\nהשורה התחתונה: אחלה מלג,צריך להגיש איזה עבודה שלוקחת שעתיים וגם ככה מחלקים בה עבודה,וקיבלתי 97 במל\"ג", "timestamp": 1643901114509}, {"author": "YR", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דר. אביטל פולק\nחוות דעת - הרצאות: לא הכי מעניין בעולם אבל כן מציג דעות חדשות.\n\nשם המתרגל/ת:  אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: היה צריך להגיש פרוייקט לקראת סוף שנה. ההוראות היו כלליות מאוד, מה שאיפשר להגיש בערך כל דבר שתרצה, ממצגת פאוור פיונט לתכנון של אפליקציה. הקבוצה שלי הגישה מצגת. כל אחד עבד עליה שעתיים וקיבלנו 97.\nהמבחן: אין\n\nהשורה התחתונה: קורס קליל, כל מי שלא זלזל הוציא ציון קרוב ל-100.", "timestamp": 1656934013837}, {"author": "Yoav Golan", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אחלה הרצאות!\n\nהשורה התחתונה: מל\"ג באווירה טובה בלי מבחן, נוכחות חובה", "timestamp": 1676274153776}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: לא מעניינות, לא משעממות, איפשהו באמצע. צריך לכתוב כמה שורות בסוף כל הרצאה על אחד הנושאים שלומדים (30% מהציון הסופי) ולכן הנוכחות היא חובה\n\nשעורי הבית: אין\n\nהמבחן: אין, צריך להגיש פרוייקט קטן ולהציג אותו, העבודה היא בקבוצות והוא לא גוזל יותר מדי זמן, כמה שעות ואתם תסיימו אותו\n\nהשורה התחתונה: מל\"ג מומלץ", "timestamp": 1677774259081}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אביטל מאוד מאוד חמודה, וראים שאכפת למה מהנושא שהיא מרצה עליו, אבל, חוץ מהרצאת אורחת אחת(שהיה מעניין ומוצלח ברמות), השיעורים מאוד לא מובנים ולא עקביים, חסרי כיוון. לדעתי היה משעמם מאוד.\n\nשעורי הבית: אין\n\nהמבחן: יש בוחן אמצע, רק שאצלנו בסמסטר הוא בשבוע האחרון, 15 אחוז מהציון, לא עשיתי אותו עדין אז לא יודע מה הלגיד בנוגע אליו, אבל בהתחשב בזה שאין חומר באמת שנלמד כל הסמסטר(באמת אין חומר, אפילו שאלנו אותה על מה הובחן והיא לא ידעה להגיד לנו). חוץ מזה, יש פרוייקט שהוא 85 אחוז מהציון והוא לא מוגדר היטב בכלל מה צריך ומה לא ואינו קשור בכלללללל למה שנלמד בכיתה. נראה שהיא מביאה ציונים באופן אקראי לחלוטין, אולם ציונים טובים לכל מי שמקיע\n\nהשורה התחתונה: עוד מלג עם פרוייקט במקום מבחן עם מרצה נחמדה, לא פחות ולא יותר. אם יש לכם את המשמעת העצמית לעשדות את הפרוייקט בתחילת הסמסטר אז ממליץ מאוד.", "timestamp": 1711911132074}]}