{"posts": [{"author": "***", "difficultyRank": 2, "generalRank": 5, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורים מעט מאתגרים אך מעניינים\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1603698860449}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: קובי גופר\nחוות דעת - הרצאות:\nההרצאות הן שעה וחצי רצוף במקום שעתיים עם הפסקה. מעניינות מאוד ונוגעות בנושאים שונים בתחום הצילום גם טכני וגם אמנותי. לא צריך ניסיון קודם.\n\nשעורי הבית: \nכל שבוע צריך להגיש תמונה לפי משימה כלשהי, זה לא דורש הרבה השקעה לרוב אבל לקראת סוף הסמסטר זה היה מעיק.\n\nהמבחן:\nאין מבחן, יש פרויקט שהוא 50% מהציון הסופי שמגישים שתי תמונות ומקבלים ביקורת על אחת מהן בפורום כיתתי.\n\nהשורה התחתונה:\nשווה לקחת למי שחובב צילום אבל הציונים לא מספיק מפרגנים לרמת ההשקעה ביחס לקורס הומניסטי.", "timestamp": 1626469323583}, {"author": "זועבי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: קובי \nחוות דעת - הרצאות: קורס הכי מומלץ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  צילומים לפי מה שלמדנו בכתה\n\nהמבחן: אין מבחן \n\nהשורה התחתונה: מלג מומלץ ולא עמוס", "timestamp": 1646151200496}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: קובי גופר\nחוות דעת - הרצאות: מעניינות בטירוף! מועברות במשך שעה וחצי בלי הפסקה, וזה פשוט טס. קובי מרצה מעולה.\n\nשעורי הבית:  כל שבוע צריך להגיש צילום שהציון עליו הוא בינארי (50 אחוז), ובסוף הקורס צריך להגיש 2 תמונות עליהן מקבלים ביקורת בכיתה וציון רגיל (50 אחוז).\nיש 3 סדנאות צילום במהלך הסמסטר כאשר שתיים מהן בימי שישי (במקום שיעור פרונטלי רגיל).\n\nהשורה התחתונה: למי שמתעניין בתחום זה ממש אחלה קורס, אמנם לא מל\"ג ולא 2 נקז, אבל מגוון ומעשיר מאוד.", "timestamp": 1656671994382}, {"author": "מירב מיכאלי", "difficultyRank": 2, "generalRank": 5, "semester": "202103", "text": "שם המרצה: \nקובי גופר\n\nחוות דעת - הרצאות: \nהרצאות מעניינות מאוד. בקיץ המתכונת זה שעה וחצי הרצאה חצי שעה הפסקה ועוד שעה וחצי.\nיש 3 סדנאות צילום על חשבון שיעור, בכל סדנה לומדים עקרונות מעשיים ומתרגלים אותם.\nקובי מרצה מדהים ומעביר את החומר בצורה מרתקת ולא טכנית.\n\nשעורי הבית: \n50% מהציון אם הגשתם הכל, ההשקעה תלויה בכם, יש כאלו שהשקיעו יותר ויש כאלו שפחות (ציון בינארי על הגשה).\nהגשה אחת לכל שיעור לרוב תמונה אחת בנושא מסויים ופעם אחת הגשת סדרת תמונות בנושא מסויים.\n\nהמבחן: \nאין מבחן, פרוייקט סיום - 2 תמונות כל אחת בנושא אחר שנלמד במהלך הקורס. ציון לפי הפרמטרים שנלמדו בקורס - קומפוזיציה, קשר לנושא, ביצוע טכני וכו'.\nלא חייבים לצלם תמונה של צלם מקצועי כדי לקבל ציון גבוה, רק להראות שיישמתם את הנלמד בקורס.\n\nהשורה התחתונה:\nלמי שמתעניין בתחום, קורס שאסור לפספס. קורס מקצועי ומעניין מאוד. דורש קצת השקעה ביחס לקורסי בחירה, אבל באמת שמקבלים הרבה ערך מוסף.", "timestamp": 1663534445831}, {"author": "the_real_fullframe_gurl", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: קובי\nחוות דעת - הרצאות: במפגש הראשון הוא אומר שחייבים מצלמה מקצועית ומי שרוצה להמשיך בקורס ואין לה צריך לקנות\\להתארגן על אחת, אבל בפועל זה לא באמת נאכף בשיעורי הבית הרבה צילמו באייפון והגישו (כן מומלץ להשאיל מדוד או חבר מצלמת DSLR לסדנאות). בנוסף הוא אומר שהוא לא סובל איחורים ושמי שמאחר שירשום לו מראש בוואטספ את סיבת האיחור או שלא יגיע בכלל, אבל בפועל גם מי שאיחר באופן סדרתי נכנס לשיעור והנוכחות נרשמה. \nבגדול ההרצאות מעניינות, אך לרוב קובי גולש לתחומים מעבר לתחום הקורס. מומלץ להקשיב תוך כדי חשיבה ביקורתית ולקחת דברים בערבון מוגבל. הוא אמר בשיא הביטחון משהו שנשמע לי לא הגיוני אז הלכתי ובדקתי ומסתבר שזה בכלל לא נכון.\nלומדים על קומפוזיציה ועל שלושה זרמי צילום של צלמים מפורסמים ועל הפן הטכני של הצילום.\nקובי אדיב ומכבד אבל גם דורש הרבה כבוד בחזרה, אז אם הוא מרגיש שלא מקבל כבוד הוא עלול להפוך לאדם לא נעים. מומלץ לחשוב פעמיים לפני ששואלים אותו שאלות שמא יפרש אותן כמזלזלות.\n\nיש 3 סדנאות בהן מסתובבים עם מצלמות ומצלמים דברים לפי קווים מנחים, מתאספים מקשיבים להסבר, הולכים לצלם וחוזר חלילה: אחת באמפי בטכניון בשעות השיעור, אחת ביום שישי בבוקר בואדי נסנס (הגעה עצמאית לשם) ואחת ביום שישי בבוקר בפארק הקישון (מתאספים בטכניון ואז נוסעים ברכבים פקטיים).\n\nשעורי הבית: כל שבוע יש משימה לצאת לחצי שעה עם המצלמה ולצלם לפי קו מנחה או תופעה שלמדנו\\נלמד עליה ועם דגש על כללי הקומפוזיציה שלמדנו (תכלס יש כולה 3-4). המשימות לרוב לא מוגדרות טוב וקשה להבין מה לעשות ומאיפה להתחיל. מצד אחד נחמד שיש משהו שמכריח לצאת מהבית משגרת הלמידה, מצד שני לפעמים זה תקוע כמו עצם בגרון. בכל שבוע קובי היה נוזף בכולם ש'יש סטודנטים שלא משקיעים בשיעורי הבית' אבל לקראת סוף הסמסטר הבנתי שאין מצב שהוא באמת עובר על כל התמונות ובודק את כולן או אפילו בכלל אז הורדתי את סף ההשקעה וכמובן שזה לא פגע בציון (40% בינארי הוגש\\לא הוגש). כמו כן יש מבחן במודל על יסודות טכנים של צילום (10%).\n\nהמבחן: יש מטלה אחת של תמונה מבוימת ובשיעור העוקב עוברים על התמונות וכל אחד אומר איך התמונה גורמת לה להרגיש (משקל של הגשה שבועית רגילה) ובסוף הסמסטר צריך להגיש שתי תמונות של סנפ\\רגע מכריע\\דיוקן בדגש על כללי הקומפוזיציה ואז מבקרים את התמונות בשני השיעורים האחרונים בכיתה.\nאנחנו היינו קבוצה קטנה יחסית והספקנו לעבור רק על תמונה אחת לכל אחת אז קחו בחשבון שהתמונה השניה לא צריכה להיות מושלמת (שוב, ספק שהוא באמת מסתכל על התמונות מחוץ להצגה בכיתה). כמו כן עושה רושם שאין דבר כזה תמונה רעה, כל עוד אפשר 'לנמק' אותה. בתכלס העבודות המסכמות לא צריכות להיות מושקעות יותר מההגשות השוטפות. חלק הגישו תמונות שנראות שצולמו כדרך אגב ולא הושקע בהן יותר מידי וההיסטוגרמה מדברת בשם עצמה. כדאי בסדנאות לצלם המון המון ואז אפשר לתפור את אחת התמונות האלו בתור פרויקט גמר ולהוריד עומס בסוף הסמסטר.\n\nהשורה התחתונה: קורס מעניין ומלמד על יסודות הצילום", "timestamp": 1689428690992}, {"author": "הצלם המגניב", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: קובי\nחוות דעת - הרצאות: \nבשיעור הראשון תכירו מי זה קובי.\nבשורה אחת - קובי הוא פינת האור שהייתה לי במהלך השבוע.\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:  הסדנאות מדהימות והלוואי שהיו יותר.\nמחכה שייפתח קורס ההמשך שסיפר לנו עליו", "timestamp": 1694681575458}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202203", "text": "שם המרצה: קובי גופר\nחוות דעת - הרצאות: מדהים!!!! פשוט מרצה נהדר. מסביר בצורה מרתקת גם את הדברים הכי טכניים. בקיץ המתכונת היא שעה וחצי, חצי שעה הפסקה ועוד שעה וחצי וזה באמת פשוט טס. נהניתי מכל רגע! יש גם 3 סדנאות צילום במהלך הקורס שהיו נהדרות.\n\nשעורי הבית: כל שבוע מטלת צילום להגשה כאשר פעמיים במהלך הקורס מציגים תמונה בכיתה ומדברים עליה. \n\nהמבחן: אין יש הגשת 2 תמונות בתור פרויקט גמר.\n\nהשורה התחתונה: קורס ממש מעניין ומועבר בצורה הכי טובה שאפשר!", "timestamp": 1695043537371}]}