{"posts": [{"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "201903", "text": "שם המרצה: קובי גופר\nחוות דעת - הרצאות: מרצה תותח\n\nשעורי הבית: גג שעה עבודה. מקבלים כמה תמונות וצריך לשחק איתן בהתאם למה שנלמד בשיעור\n\nהמבחן: הגשת פוסטר אקדמי שלוקחת בערך יום עבודה\n\nהשורה התחתונה: קליל ביותר, ואחלה בסיס למי שלא יודע פוטושופ", "timestamp": 1626125541344}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: קובי גופר\nחוות דעת - הרצאות: מרצה מעולה, אין יותר כיף מלהקשיב לו. \n\nשעורי הבית: \nכמעט כל שבוע, עושים דברים שראינו בשיעור פחות או יותר. הקלים לוקחים פחות משעה, הארוכים לא יותר משעות בודדות. \n\nהמבחן: \nאין מבחן, יש פרויקט גמר. לא משהו מפוצץ אבל עושים ביקורת כיתתית אז רוצים להשקיע.\nהשורה התחתונה: \nקורס מומלץ ברמות. מהנה, מעניין ושימושי מאוד. מרצה מקצועי ומעביר את השיעורים באווירה כיפית ומיוחדת.", "timestamp": 1675084741768}, {"author": "Oh hai mark", "difficultyRank": 2, "generalRank": 5, "semester": "202203", "text": "שם המרצה:  קובי גופר\n\nחוות דעת - הרצאות: \nהמרצה כיפי, ההרצאות חביבות, זה לא מסוג המרצים שאפשר בקלות להירדם אצליהם, הוא מלמד ומראה הרבה דוגמאות שאח\"כ מופיעות בש\"ב, מלמד ידע כללי שעוזר וזה מעניין.\nהמרצה בד\"כ זמין ועונה לסטודנטים במהלך השבועות בש\"ב, כל עוד שזה בזמן סביר.\n\nקחו בחשבון שהמרצה מצפה מסטודנטים שלא יהיו בטלפון ולא יאחרו (אלא אם מודיעים מראש).  זה לא אמור להיות ביג דיל אבל זה גם אומר שזה לא קורס שאפשר להבריז ממנו.\n\nשעורי הבית: \nש\"ב קלילים, יכול לקחת עד מקסימום 2-3 שעות כי לפעמים יש 8 קבצים לערוך. אני ממש נהניתי מהם.\n\nהפרוייקטים:\nבהתחלה לא היה כל כך מידע על איך מה מי מו לעשות 2 פרוייקטים, את המידע על הפרוייקט גיליתי שבוע או שבועיים לפני ההגשה, ושבוע לפני ההגשה של הפרוייקט השני קיבלתי עוד מידע על הפרוייקט השני. \nיצירת הפרוייקטים היא זריקה למים העמוקים, פה לא עורכים תמונות קיימות אלא יוצרים אותן. אבל זה סבבה כל עוד משקיעים וזה משתלם.\n\nהשורה התחתונה: \nקורס יחסית קליל, כיף ומעניין, ממש מומלץ, הייתי גם מסתכל על קורסים אחרים של המרצה הזה.\n\nחיסרון:\nצריך לטפס לנקודה הכי גבוהה בטכניון, בניין קנדה (לא מעונות קנדה)", "timestamp": 1697391215569}]}