{"posts": [{"author": "פוליטיקאי", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מעניינת ממש וחומר שווה\n\nשעורי הבית: אין\n\nהמבחן: וואלה היה מבחן כמו כל הסמסטרים אבל לא ידוע מה קרה הממוצע ירד ממש, המרצה עקצה אותנו בציונים ואנחנו עד עכשיו לא מבינים איך ולמה היא ככה התהפכה עלינו למה כולה ראינו מלג עם ממוצע סבבה ומרצה אש עם חומר מעניין\n\nהשורה התחתונה: מעניין אבל ממוצע תחת", "timestamp": 1625769912493}, {"author": "מלג", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nמרצה סופר מעניינת ומלהיבה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nמגפת המלג השפיעה גם על המרצה והממוצע ירד בכמה נקודות, מאוד חבל\nמבחן עם חומר פתוח\nהשורה התחתונה:", "timestamp": 1627466883237}, {"author": "Gur Telem", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: עו\"ד תמר\nחוות דעת - הרצאות: \nמאוד מעניין. רואים שהנושא מעניין את תמר ושהיא סוחפת את הכיתה להשתתף.\nקצת לא אהבתי את הקטע שהיא דוחפת מאוד להפעיל מצלמות בזום. הייתי כל הזמן עם מצלמה אבל התזכורות כל כמה דקות גרמו לי להרגיש כאילו מסתכלים עלי כל הזמן.\nיש אלמנט לציון של השתתפות בהרצאות.\n\nהמבחן: \nהוגן מאוד. דורש **הרבה** כתיבה בכתב יד. כל כך הרבה שהיד כל כך כאבה לי שלא הצלחתי במועד א לסיים לכתוב פתרון מלא כמו שרציתי לכל השאלות ורק במועד ב קיבלתי אישור הקלדה במחשב ובקלות (בלי ללמוד אפילו שעה נוספת בין המועדים) קיבלתי 100.\n\nהשורה התחתונה: \nקורס מעניין וממומלץ. מרצה נחמדה וסוחפת.\n+ תמיד טוב לעשות רושם טוב על עו\"ד למקרה הצורך בעתיד :-P", "timestamp": 1642351954825}, {"author": "משפט, אי שיוויון ואי צדק חברתי", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מלג לא מומלץ! על פניו תמר נחמדה, כריזמתית ומעבירה את התוכן בצורה מעניינת, אבל בתור אחד שלקח את הקורס מתוך ציפייה להעלות את הממוצע בצורה משמעותית יצאתי מאוכזב מאד. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: עם חומר פתוח אבל עדיין צריך ללמוד היטב את החומר מהמצגות לפני כן. נראה כאילו הציונים מחולקים רנדומלית על סמך היכולת לחרטט באלגנטיות.\n\nהשורה התחתונה: טעימה מעולם המשפטים לא הייתה שווה את זה. לא מעשיר יותר מדי ולפעמים משעמם. להתרחק!", "timestamp": 1647894835701}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: תמר \nחוות דעת - הרצאות: \nהרצאות מעניינות אבל המלג לא מומלץ \nשם המתרגל/ת: \nחוות דעת - תרגולים: אין \n\nשעורי הבית: \nאין\nהמבחן: קשוח ממש.. המון כתיבה וממוצע לא משהו עדיף לוותר..\n\nהשורה התחתונה: עדיף לוותר", "timestamp": 1648205260181}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מרתקות! נהניתי מכל שנייה והיה כיף להגיע\n\nשעורי הבית: מטלה סופר קצרה שהיא 5% מהציון, ותמר ענתה לכל מי שרצה לשאול עליה\n\nהמבחן: ארוך והרבה כתיבה, אבל לא קשה. יש חומר פתוח והשאלות ברורות\n\nהשורה התחתונה: מל\"ג מומלץ וחשוב לכולם", "timestamp": 1657180069759}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: ללא רבב\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין, רק מטלה אחת שלוקחת בערך 20 דקות\n\nהמבחן: מעצבן\n\nהשורה התחתונה: מי שרוצה מקום לשנ\"צים ולהעלות את הממוצע אז פחות אבל אפשר אשכרה ללמוד שם משהו", "timestamp": 1657448416523}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nמרצה טובה, חלק מההרצאות היו קצת משעממות לטעמי על צדק וכו'.. חלק יותר מעניינות על דיני עבודה וכדומה.\n\nשעורי הבית: 5 אמריקאיות במודל על חוק שצריך לקרוא לבד. גג שעה עבודה.\n\nהמבחן: מבחן פתוח עם חומר פתוח. מגפת המל\"גים הגיעה גם לפה... היה מבחן טריקי וממוצע יחסית נמוך. ממליץ להדפיס כל דבר ולכתוב במבחן כמה שיותר כדי שתמר תמצא את מה שהיא חיפשה. מבחינת למידה לפני המבחן, מעבר על החומר של כמה שעות אמור להספיק\n\nהשורה התחתונה: בינוני פלוס.", "timestamp": 1661072972838}, {"author": ":)", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: ההרצאות של תמר ממש מעניינות לדעתי. היא מאוד כריזמטית ומאוד מעודדת אנשים להביע את דעתם, ומנגישה בצורה ממש טובה כל מני ניואנסים בחוק ומשפט שמי שלא למד משפטים כנראה לא מכיר. היו איזה שתי הרצאות קצת מעייפות על צדק אבל השאר (במיוחד ההרצאות על דיני עבודה והטרדות מיניות) היו מאוד מעניינות והיה ממש סבבה להקשיב.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: מטלה קצרה של 5% של לקרוא חוק ולענות על 5 שאלות אמריקאיות פשוטות. בשביל לקבל את כל הנקודות היה צריך לעשות סה\"כ 3/5, שאלות ברמה של הבנת הנקרא בסיסית. הכי בקטנה שיש.\n\nהמבחן: קצת קשוח. צריך לכתוב הרבה מאוד ולזכור כל מני ניואנסים שתמר הדגישה בכיתה (אם הייתם והקשבתם אתם תזכרו אז זה לא כזה בעיה). הממוצע לא הכי מדהים שיש למל\"ג אבל אם אתם סבבה עם לכתוב הרבה אפשר להוציא ציון סבבה לגמרי.\n\nהשורה התחתונה: לא הממוצע הכי מדהים אבל מל\"ג שלומדים בו דווקא דברים די חשובים ודי פותח את הראש. אני נהנתי :).", "timestamp": 1689785892323}, {"author": "Omri", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: כריזמטית ומעניינת. משלבת אקטואליה עם החומר. נוכחות חובה.\n\nשם המתרגל/ת: אין.\nחוות דעת - תרגולים: אין.\n\nשעורי הבית: מטלת הגשה ששווה 5% מהציון הסופי. לקרוא חוק ואז לענות על שאלות אמריקאיות. 15 דקות עבודה.\n\nהמבחן: חומר פתוח. הקשבתי בחצי אוזן בהרצאות אבל למדתי יום וחצי וקיבלתי ציון טוב.\n\nהשורה התחתונה: קורס אקטואלי במיוחד בתקופה האחרונה...", "timestamp": 1689789319574}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: תמר ממש סוחפת בדיבור שלה ומעניינת, דואגת לייצר דיונים ולא רק מעבירה את החומר. בכל תחילת שיעור יש פינת אקטואליה שהיא מעבירה שזה נחמד ממש.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: הייתה משימה אחת במודל. 5 שאלות אמריקאיות על חוק שהיא העלתה למודל וצריך לקרוא פשוט. קליל ממש\n\nהמבחן: 4 שאלות, שעתיים, המבחן עם חומר פתוח אז זה לא בעיה לחפור (ולהגיע למינימום 3/4 עמוד תשובה לשאלה) ואפשר בקלות להוציא מעל 90 כל עוד כותבים מנקודת הנחה שפשוט מנתחים את הטקסט מבחינה משפטית ומתייחסים לכל תרחיש שאפשרי כלומר להיות בספק ולכתוב את 2 האופציות וכל פרשנות שעולה לכם לראש.\n\nהשורה התחתונה: לדעתי מלג מומלץ! היה לי קצת ספק שלא אצליח להתנסח ולהגיע לאורך של תשובות אבל זה ממש זרם וקיבלתי 96 בלי יותר מידי מאמץ, למדתי יומיים בסהכ ובמהלך הסמסטר חוץ מהלקשיב באוזן אחת לתמר ובשניה לעשות משהו אחר לא צריך יותר מיזה.", "timestamp": 1694337136139}]}