{"posts": [{"author": "שרון סגל", "difficultyRank": 2, "generalRank": 4, "semester": "201901", "text": "שם המרצה: מיכל\nחוות דעת - הרצאות: לא רעות, קצת מעיק\n\nשעורי הבית: המון ומעיק\n\nהמבחן: יש לא מעט מבחנים, המבחן הסופי מאוד קשה\n\nהשורה התחתונה:", "timestamp": 1597851603733}, {"author": "R", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: טובה גיטה-דרור\nחוות דעת - הרצאות: מרצה מצוינת!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1600945861433}, {"author": "...", "difficultyRank": 4, "generalRank": 1, "semester": "201902", "text": "אחד הקורסים היותר מזעזעים שיצא לי לעבור- משעמם מאד, לא תורם לידע באנגלית בשום צורה, מיותר, עמוס בצורה מוגזמת וחריגה!\nיש כמות ענקית של שיעורי בית בכל שיעור (השיעורים באמת נבדקים), צריך להכין פזנטציה באנגלית ועבודה כתובה עליה, הסגל לא מפסיד אף הזדמנות להזכיר כמה כוח יש להם כנגדך..", "timestamp": 1601502886758}, {"author": "רבקה שלמה", "difficultyRank": 3, "generalRank": 3, "semester": "201901", "text": "שם המרצה: \nחוות דעת - הרצאות: טוב מאד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין \n\nשעורי הבית: יש הרבה \n\nהמבחן: סביר\n\nהשורה התחתונה: קורס חובה", "timestamp": 1602959448574}, {"author": "idan fischman", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: ארלט\nחוות דעת - הרצאות: \nמשעמם ולא תורם לשפר את האנגלית.\n\nשעורי הבית: \nבזמן הקורונה היה מעט תרגילי בית שהיה לוקח משהו כמו 20 דקות לסיים. לא באמת מורגש.\n\nהמבחן: \nטריקי וכל טעות מורידה הרבה נקודות. הרבה מטלות תקפות לאורך הסמסטר, ולא תמיד קל להוציא בהן 100.\n\nהשורה התחתונה:\nאם אתם מחפשים להוציא בקורס הזה מעל 90 תדעו שזה לא קל (כי כנראה אין לכם אנגלית ברמה מאוד גבוהה אם אתם צריכים לעשות את הקורס מלכתכילה).\nאבל בשביל להוציא מעל 80 זה ממש סבבה. בגדול קורס חופר ולא עוזר בכלום, בדיעבד לא הייתי לוקח אותו.", "timestamp": 1612696891574}, {"author": "מאיה בן שימול", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  טובה דרור\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  קצת מעמיסים בעיקר בתחילת-אמצע סמסטר, אבל ממש קלילים.\n\nהמבחן:  הוגן לחלוטין\n\nהשורה התחתונה: אחלה דרך להעלות ממוצע :)", "timestamp": 1612881028272}, {"author": ".", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עליזה בר-שלמה\nחוות דעת - הרצאות: לא תלמדו יותר מדי דברים חדשים באנגלית, אבל סך הכל פחות גרוע ממה שעושים מזה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קוץ ב.... . מעיקים ולא עוזרים יותר מדי\n\nהמבחן: לא יותר קשה מבגרות 5 יחידות\n\nהשורה התחתונה: סביר יחסית קורס חובה, מעלה את הממוצע", "timestamp": 1612898440407}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: כרמלה\nחוות דעת - הרצאות: \nההרצאות היו נורא משעממות ולא מלמדות, אם לא ידעת אנגלית לפני כן, לא תצליח לשפר את הרמה של האנגלית רק בזכות ההרצאות. \n\nשעורי הבית: \nלא ממש קשורים למבחן\nהמבחן: כביכול קל, אבל הבדיקה מאוד בררנית.\n\nהשורה התחתונה: קורס חסר למידה משמעותית, ארבע שעות שבועיות שבאות על חשבון למידה לקורסים אחרים.", "timestamp": 1614077496042}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ארלט\nחוות דעת - הרצאות: ההרצאות לא כל כך מעניינות ורובן עוסקות בחומר שנלמד בבית הספר. ההרגשה היא של איבוד זמן שבו אפשר ללמוד ולתרגל קורסים אחרים כמו אלגברה וחדווא. יחד עם זאת, המרצה מסבירה את החומר טוב מאוד וחשוב לה לראות שכולם הבינו את החומר.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין \n\nשעורי הבית:  שיעורי הבית קלים ולא לוקחים זמן רב.\n\nהמבחן: המבחן קל מאוד אבל קל לאבד בו נקודות אם אין ריכוז.\n\nהשורה התחתונה: הקורס מקפיץ את הממוצע.", "timestamp": 1614444712118}, {"author": "מר", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  טובה גיטה\nחוות דעת - הרצאות: יצאה לפנסיה\n\nשעורי הבית:  צריך להשקיע שעה בשבוע \n\nהמבחן: אנסין דומה לחומר שלמדנו בסמסטר\n\nהשורה התחתונה: קורס חובה ממליץ לעשות בסמסטרים מתקדמים 3\\4 ובראשון להתמקד בקורסים היותר קשים", "timestamp": 1614669266733}, {"author": ".", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עליזה בר שלמה\nחוות דעת - הרצאות: עליזה מעבירה את ההרצאות בצורה מעניינת ומצחיקה!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש הרבה שיעורי בית וכדאי לעשות אותם כי הם הכנה מעולה לכל הבחנים שיש לאורך הסמסטר. לא לוקח יותר משעה בשבוע.\n\nהמבחן: אנסין ברמה יחסית גבוהה, קליל לאנשים ששולטים טוב באנגלית\n\nהשורה התחתונה: מי שטוב באנגלית - ממליצה לעשות אותו כי זה קורס שיכול ממש להעלות את הממוצע ולא דורש הרבה השקעה. אני אפילו נהנתי מהשיעורים עצמם.", "timestamp": 1625936059185}, {"author": ".", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: ילנה מזרחי\nחוות דעת - הרצאות: היו מקוונות, לא דרשו הרבה השתתפות אבל כן הייתה עבודה בקבוצות כל שיעור\n\nשעורי הבית: בדרך כלל יחסית קצרים, אבל חשוב לזכור לעשות אותם כי הם חלק משמעותי מהציון\n\nהמבחן: אמריקאי של 10 שאלות, סך הכל 25% מהציון הסופי. \n\nהשורה התחתונה: קורס חובה שכדי להיפטר ממנו מהר", "timestamp": 1626103600755}, {"author": "Ma", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עליזה בר שלמה\nחוות דעת - הרצאות: \nההרצאות היו בזום, מרצה נחמדה, גמישה מבחינת נוכחות אם יש לסטודנט בחן/התחייבות אחרת בזמן השיעור, אחלה מרצה תכלס.\n\nשעורי הבית: שעה שבועית במקס'\n\nהמבחן: \nהציון הסופי מחולק להמון מרכיבים, המבחן הסופי מהווה רק 25%\n\nהשורה התחתונה: קורס לא עמוס בכלל, נוכחות חובה, אבל לא תרגישו בו תוך כדי הסמסטר, מבחנים קלים יחסית. מומלץ לקחת בסמסטר השני ללימודים.", "timestamp": 1626331369304}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: עליזה בר שלמה\nחוות דעת - הרצאות: ההרצאות התקיימו בזום. עליזה מרצה מעולה. החומר לא קשה ודומה לרמה של 5 יחידות בתיכון.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: בין חצי שעה לשעה בשבוע. פעם אחת צריך להכין פרזנטציה ולהציג בכיתה שזה כן לוקח זמן ולכן כדאי לעשות כמה שיותר מוקדם בסמסטר לפני שיש לחץ בקורסים אחרים.\n\nהמבחן: דומה לרמה של 5 יחידות בתיכון. \n\nהשורה התחתונה: קורס נחמד ולא עמוס, הציונים בו די גבוהים והוא עוזר לשפר ממוצע. ת'כלס למי שלא הוציא פטור בפסיכומטרי הייתי ממליץ לעשות את הקורס.", "timestamp": 1628795390787}, {"author": "Ronia Keren", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: יצירתית מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש לא מעט ומעיקים אבל ככה זה אנגלית\n\nהמבחן: היה בסדר\n\nהשורה התחתונה: בסדר גמור. אבל יש בעיה עם הציונים כבר למעלה מחודש ועדיין לא טיפלו בזה", "timestamp": 1629107422068}, {"author": "רין קורט", "difficultyRank": 4, "generalRank": 1, "semester": "202003", "text": "שם המרצה:  עליזה בר שלמה\nחוות דעת - הרצאות: \nמרצה לא נעימה. תיאטרלית מאוד וההתנהגות שלה לא עומדת בקנה מידה עם איך שמרצה אמור להתנהג. היא יכולה לקטוע אנשים באמצע המשפט ובאופן כללי הרושם ממנה הוא של אדם לא נעים.\n\nשעורי הבית: \nהמון שיעורי בית. הם לוקחים רבע שעה עד שעה\nהמבחן: \nהבחנים והמבחני פשוטים למי שיש שלא מתקשה באנגלית ומקשיב בשיעור.\nהשורה התחתונה: \nלאנשים שלא מתקשים באנגלית זה קורס פשוט. הבעיה העיקרית טמונה במרצות שחושבות שזה המקצוע החשוב ביותר ומעירות לאנשים שלא מרוכזים בהן, וכמות הזמן שהקורס הזה שואב בעל כורחו. אם יש לכם אופציה לגשת למבחן אמיר; עדיף.", "timestamp": 1630504530240}, {"author": "חורי", "difficultyRank": 2, "generalRank": 2, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלילים אבל לא תורמים כלום לסטודנט\n\nהמבחן: לא קל ולא קשה.\n\nהשורה התחתונה: קורס משעמם ולא משפר רמת האנגלית של הסטודנט", "timestamp": 1635413569793}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: מיכל (מיקי) חיטין-שטיינר \nחוות דעת - הרצאות: פשוט מדהימה, מרצה שמחוברת לסטודנטים ותעשה הכל כדי שיהיה להם נוח, אם היא מרצה אצלכם, לא להתבלבל ופשוט ללכת אליה.\n\nשם המתרגל/ת:  אין\nחוות דעת - תרגולים: \n\nשעורי הבית: לא לקחו לי יותר מחמש שעות בכל הסמסטר (צריך לעשות פרזנטציה)\n\nהמבחן: מקבלים את הטקסט לפני והוא ממש חלק קטן מהציון \n(20,25%)\n\nהשורה התחתונה: להיפטר מזה כמה שאפשר כי מבאס ללמוד בערב על פרסנט פרוגרסיב, וגם אחלה ציונים..", "timestamp": 1643899224833}, {"author": "Gil Pirotsky", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: ילנה מזרחי\nחוות דעת - הרצאות: \nחמודה מאוד ומנסה לעשות את ההכי טוב אבל לפעמים הקורס מעיק קצת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\n \nשעורי הבית: \nקיימים ודי מציקים אבל אפשר לסיים אותם בשניות\n\nהמבחן: \nמבחן אנסין ידוע, שאלות של הבנה של הטקסט כמו: \"מה המטרה של הטקסט\" או \"מה הסיכום של הכותב?\". שאלות של נכון לא נכון שחייב לשים לב לדיוק במשפטים וקטע כתיבה. סה\"כ פשוט אבל מעיק\n\nהשורה התחתונה: \nכדאי לסיים עם זה כמה שיותר מהר, תמצאו אנשים להעביר את הקורס בצורה נחמדה יותר", "timestamp": 1643910840434}, {"author": "Sason Shmuel Lameey", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: כרמלה\nחוות דעת - הרצאות: אם יש לכם רקע טוב מהתיכון, בסך הכל זה השלמות. יש ייתרון בכך שמעבירים \"הרצאה פרונטלית\" של 7 דקות מול הכיתה, אז אם מבינים שזה דבר שצריך לעבוד עליו לעתיד. \nבכללי ההרצאות משעממות אבל יש שם נקודות חשובות שטוב לדעת אם לא למדתם אנגלית כמו שצריך לפני זה (חמישית קורס הולך על ההרצאות הפרונטליות של שאר החברה בכיתה וזה לא נחמד). מה שכן, זהו הקורס היחיד שהכרתי ממנו באמת אחלה חברה, אפילו מסמסטרים גבוהים, באמת הייתה שם אווירה מגובשת כזו וזה נחמד :)\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: סתם מעיקים. קלילים מאוד.\n\nהמבחן: יש בחנים - דיי קלילים. מבחנים - אנסין עם אנגלית טיפה יותר גבוהה אך קל ממש.\n\nהשורה התחתונה: קורס עמוס, אם יש לכם אופציה לאמיר/ם לכו על זה ותחסכו את הכאב ראש של 4 שעות בשבוע.", "timestamp": 1644075798420}, {"author": "אלמוני", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה בר שלמה\nחוות דעת - הרצאות: אין על עליזה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1644327587350}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ורה קיטייב\nחוות דעת - הרצאות: רק ורה. באמת , תקשיבו לאחת שיודעת ;) היא באה לקראת הסטודנטים. מעבירה את ההרצאות בכיף והציונים גבוהים שזה הכי חשוב.\n\nשעורי הבית: לא היה הרבה בכלל כמו שדימיינתי שיהיה. מתחילים בכתה, הרוב מסיימים בכתה. היתה נותנת גם לבית. לא היו הרבה שיעורים כמו במתקדמים א'. היה גם רק מסמנת שהגשנו לא היתה באמת בודקת את התשובות.\n\nהמבחן: היה לנו seen , דומה מאוד לבוחן שעשינו וגם למבחן לדוגמה שפרסמו לנו.\n\nהשורה התחתונה: רק עם ורה. ציונים גבוהים. מרצה תותחית וכיפית!", "timestamp": 1644422469713}, {"author": "אבישג.ד", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ילנה\nחוות דעת - הרצאות: \nאם קיבלתם את ילנה אז זכיתם. היא המרצה הכי טובה שיש בקורס הזה והיא מקסימה! היא רק רוצה שנקבל מאה ובעדנו. אישה נהדרת ומיוחדת.\n\nשעורי הבית: \nילנה נותנת המון שיעורי בית. אבל קחו את הקורס בכיף ותעשו אותם בסופש וזה באמת לא כזה ביג דיל.\nהמבחן: \nקליל והוא רק 20 אחוז מהציון הסופי. המבחן הוא טקסט עם שאלות וכתיבת עמדה כמו מודול G בתיכון. ממש קל.\nהשורה התחתונה:\nהקורס הזה כיפי מאוד והיה בשבילי כמו קייטנה. תכירו בו חברים ותעבירו אותו בכיף וזה יעלה לכם את הממוצע בסוף.", "timestamp": 1644961337051}, {"author": "present simple", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: כרמלה\nחוות דעת - הרצאות: לא מלמדים משהו חדש מעבר לתיכון, מה שכן, 25% מהציון הוא על להכין מצגת ולהציג אותה בפני הכיתה ככה שאם אתם ביישנים זה עשוי להיות מעיק, אבל הציונים אחלה למרות הכל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל שיעור מקבלים שיעורי בית שזה מעיק אבל הם לא לוקחים יותר מחצי שעה-שעה גג\n\nהמבחן: אנסין לא קשה במיוחד\n\nהשורה התחתונה: בעיני זה אחלה קורס לעלות איתו את הממוצע אז לא הייתי ישר רצה לעשות מבחן אמיר. אבל כדי שהוא יעזור צריך לא לזלזל בשיעורי בית ובמבחן", "timestamp": 1645375249932}, {"author": "ל\"א", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דימטרי אוניון\nחוות דעת - הרצאות: מרצה סבבה לא מעמיס בשיעורי בית ובחנים בניגוד למרצים אחרים, אם אתם צריכים לקחת קורס אנגלית לכו אליו\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: סבבה, רובם 100/0 כלומר מקבלים 100 על עצם העובדה שהגשת אותם, וגם אלו שלא ממש סבבה, הדבר היחיד שגוזל זמן זה הפרזנטציה וגם היא דיי סבבה\n\nהמבחן: בסדר גמור, הוגן ממש\n\nהשורה התחתונה: אם אתם צריכים לקחת קורס אנגלית ממליצה על דימטרי", "timestamp": 1645460100910}, {"author": "( :", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עליזה\nחוות דעת - הרצאות: נחמד אבל ממצה את עצמו אחרי חודש\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: די הרבה, אבל קלים\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס נחמד מאוד, תפטרו ממנה בסמסטר א' ואל תחכו עם זה להמשך.", "timestamp": 1645721179995}, {"author": "meseri asaf", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: דמיטרי\nחוות דעת - הרצאות: \nאחלה דמיטרי. עוזר בהכל, מבין ומפרגן.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nמיותרים, אבל לוקחים קצת זמן\nהמבחן: \nקליל\nהשורה התחתונה:", "timestamp": 1647947599287}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: fede \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין \n\nשעורי הבית: הרבה ע\"ב \n\nהמבחן: לא היה מבחן סופי ! (מצגת , ע\"ב , בוחן כולל הבנת הנקרא ו הבעה )\n\nהשורה התחתונה: לא נותן ציונים גבוהים .", "timestamp": 1657665110098}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פדריקו חאנו\nחוות דעת - הרצאות: פדריקו מעביר את ההרצאות בצורה הכי יצירתית שאפשר וזה נתן לי קצת שחרור מהלוז העמוס ומשהו קצת שונה מהיום יום.\n\nשם המתרגל/ת: --\nחוות דעת - תרגולים: --\n\nשעורי הבית: אין המון . כן צריך להראות נכונות להשקיע ולא לחפף בשיעורי בית שכן הוא נותן.\n\nהמבחן: אנסין + כתיבה באנגלית. הרמה היא נמוכה יחסית לדעתי ואפשר להוציא בזה ציון גבוה. מעלה ממוצע\n\nהשורה התחתונה:", "timestamp": 1657819513889}, {"author": "...", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: פדריקו הנו\nחוות דעת - הרצאות: קצת מתישות כי יש הרבה פעילויות והצגות ופחות לימוד אנגלית שתעזור להמשך התואר. הוא מבולגן וזה מפריע לעכוב אחרי מה צריך למתי, מה להגשה ומה הוא מצפה מאיתנו.\n\nשם המתרגל/ת: --\nחוות דעת - תרגולים: --\n\nשעורי הבית: אין הרבה. יחסית פשוטים\n\nהמבחן: אנסין, פרזנטציה\n\nהשורה התחתונה: מאכזב בציונים סופיים ולא 100 קל כמו שחושבים", "timestamp": 1657900764671}, {"author": "חילזון הפרא", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: לוסי שולמן\n \nחוות דעת - הרצאות: \nלוסי העבירה כמעט את כל ההרצאות בזום (כמעט תמיד הודיעה על זה ברגע האחרון) ובסך הכל זה מאוד הקל עלינו.\nשעורי הבית: \nנותנת קצת כל הרצאה ולפחות שבוע להגשה. בנוסף יש פרזנטציה ששווה 30 אחוז מהציון.\nהמבחן: במהלך הסמסטר היו שני מבחנים די קלים, בנוסף היו בחנים שכל אחד עשה במודל לבד (בזמן הרצאה בזום) ולבסוף עוד מבחן אחד על אחת ההרצאות האחרונות וגם הוא היה מאוד קל.\n\nהשורה התחתונה: לכו ללוסי, ציון גבוה מובטח ואחלה מקפצה לממוצע שלכם", "timestamp": 1658069465850}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "קורס ממש בקטנה, לא דורש יותר מדי מאמץ והשקעה מעבר לשלוש שעות הרצאה בשבוע. בסוף הסמסטר יש איזו פרזנטציה בקבוצות וזה גם חביב ונותן ניסיון בהעברת מידע באנגלית", "timestamp": 1665307049851}, {"author": "אושרת חניא", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: \nקורס קליל הרבה משימות אבל פשוטות יחסית \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש המון\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1672135612026}, {"author": "Lior", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: כרמלה שהב\nחוות דעת - הרצאות: \nזה כמו שיעורי אנגלית בתיכון, זמנים, אוצר מילים, טקסטים ועוד כל מיני שטויות.\nאם אתם בקבוצה של כרמלה אז תעברו לקבוצה אחרת כי היא חושבת שהיא מעבירה קורס בחדו\"א 1, עושה בוחן אמצע, בחני אוצר מילים וזמנים, 2 פרזנטציות (אחת מהן גדולה והשנייה קצת פחות) ולא חוסכת בהורדת נקודות. \nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nלא לוקחים הרבה זמן אבל חופרים כי כל פעם צץ משהו חדש. הפרזנטציות לוקחות יחסית הרבה זמן וזה חפירה גדולה כי כרמלה חושבת שכל אחד הוא מרצה אורח מTED ויש לו ניסיון רב בזה. \nהמבחן: סביר +.\n\nהשורה התחתונה: קורס שיכול להעלות ממוצע בכיף אבל אם אתם רואים שיצא לכם את קבוצת הלימוד של כרמלה אז תעברו לקבוצה אחרת", "timestamp": 1674066052803}, {"author": "דריה", "difficultyRank": 4, "generalRank": 2, "semester": "202201", "text": "שם המרצה: כרמלה שהב\nחוות דעת - הרצאות: הרצאות זוועה, מייאשות. בתחילת הסמסטר היו קהוטים כאלה ואז זה הדרדר, ספרנו את השניות לסיום השיעור. אין הפסקה באמצע היא פשוט מסיימת חצי שעה לפני הזמן. \n\nשעורי הבית: מלא, כל שיעור (זה אפילו לא הרצאה) היא נתנה משהו לשיעור הבא. כמות עבודות לא הגיונית, חשבתי שזה קורס קליל להעלאת הממוצע וככה היה בקבוצות האחרות אבל אצלינו היה סיוט. יש פרזנטציות באנגלית מול הכיתה, דוגמא לביקורת שלה ״דיברת מאוד יפה הכל היה מושלם, הרקע במצגת היה קהה מידי 90/100״ \n\nהמבחן: כל מרצה בונה מבחן משלו, לא יודעת איך זה אצל מרצים אחרים אבל אצל כרמלה היו מבחנים מאוד מתחכמים שלא באו לבדוק את האנגלית שלך אלא להאכיל אותך תסביכים במהלך המבחן. \n\nהשורה התחתונה: לא מומלץ תבחרו קבוצה אחרת", "timestamp": 1674460154039}, {"author": "critical thinking", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: כרמלה שהב\nחוות דעת - הרצאות: \nשלא יעבדו עליכם, זה הקורס הכי קשה בטכניון.\nהקורס מצריך ממש סבלנות שלא קיימת בשום קורס אחר,חופר בצורה היסטרית ומצריך יכולות סבלנות יותר גבוהות מיכולות קוגנטיביות. כרמלה מצד אחד מתנהגת כמו מורה לאנגלית בכיתה ח' ומצד שני דורשת ממך כמויות של מטלות,מכסחת בציונים בנוסף לזה שהיא מנסה להמציא את הגלגל וחושבת שהיא מביאה יכולות חדשות עם כל מני שטויות שלא מעניינות אף אחד\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nבין הרצאה להרצאה יש שיעורי בית שלא פורפציונלים לקורס הזה.\nבפרזנטציות נדרשנו לסכם 10 משפטים על כל פרזנטציה של סטודנט שהציג - מה הוא הציג,למה הוא טוב ולמה הוא לא טוב (לכל אחד מה- 20 סטודנטים)\nבקיצור סיוט\nהמבחן: \nכרמלה לא בודקת את יכולות האנגלית אלא בודקת משמעויות  נסתרות שכנראה גם אם הייתם קוראים את הטקסט בעברית לא הייתם מבינים.\nהשורה התחתונה: מי שיכול לקבל פטור שיעשה את זה. במידה ולא קיבלתם פטור *אל תלכו לכרמלה*", "timestamp": 1674686073026}, {"author": "Gg", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: \nמקסים\nשם המתרגל/ת:אין \nחוות דעת - תרגולים: אין\n\nשעורי הבית: מלא שיעורים, אבל לא קשים \nלוקח זמן משמעותי מהשבוע\n\nהמבחן: לא פשוט אבל לא נורא \nצריך לציין הוא גם רק 15% מהציון הסופי\n\nהשורה התחתונה: \nלוסי מתחשבת מאוד ובאה לקראתנו אבל תוך כדי גם מביאה אינספור שיעורים\nלקחתי בסמסטר א מאמין שזה יעזור לממוצע אבל כן עמוס מאוד", "timestamp": 1675435262647}, {"author": "אנונימי‬‎", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דיטמרי\nחוות דעת - הרצאות: אחלה, לא מעניין במיוחד לפעמים יש מאמרים או סרטונים נחמדים\n\n\nשעורי הבית: בהתחלה היה בעיקר דברים שאפשר לעשות בכיתה ולסיים עם זה בזמן השיעור, לקראת סוף הסמסטר יותר\n\nהמבחן: אין ממש מבחן, יש שני אנסינים ו3 פרוייקטים ועוד כמה בחנים, הרוב קורה בזמן השיעור\n\nהשורה התחתונה: תביאו שיעורי בית לעשות בזמן השיעור, בגדול בזבוז זמן, אבל אין מה לעשות חייב לעשות את זה (+מעלה טיפה את הממוצע בלי הרבה מאמץ)", "timestamp": 1675889240140}, {"author": "עוסמאן", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: אלינה\nעדיף להתרחק ! מרצה חמודה וטובה אבל !!!!!!! הרבה משימות היא נותנת , מורידה ציונים בקלות , ומאכזבת בסוף בציונים ! (מתחת ל-90) , פשוט לבחור במישהו אחר .\n\nשעורי הבית: הרבה שיעורי בית\n\nהמבחן: המבחן סביר מאוד אבל הציון מחולק לכל מיני משימות (הצגת נושא מול הכיתה) , חדר בריחה , שני בחני VOCABULARY , ושני בחני הבנת הנקרא .\n\nהשורה התחתונה: קורס סבבה , הנוכחות מעיקה לפעמים , ועדיף לבחור מרצה שנותן ציונים טובים .", "timestamp": 1675974006787}, {"author": "דן", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  דימטרי\nחוות דעת - הרצאות: דימטרי אחד המרצים החמודים, הוא מאד מאד מסודר והשיעורים התנהלו באווירה טובה. גם הבנתי שהפרויקטים שהוא בוחר לתת לסטודנטים יותר קלים מפרויקטים בקבוצות אחרות. מחזיר ציונים מאד מהר, מתחשב ממש ותמיד זמין לכל בעיה / שאלה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש לא מעט הגשות שצריך לעשות, רובן לא קשות אבל פשוט לוקחות זמן. בחודש האחרון של הסמסטר מתחילים להצטבר הפרויקטים הקבוצתיים, שבדרך כלל גוזלים עוד יותר זמן - קחו את זה בחשבון. שוב, המטלות לא קשות במיוחד אבל פשוט לוקחות הרבה יותר זמן מהמצופה\n\nהמבחן: עושים הרבה כאלה דומים בכיתה, יחסית מאד הוגן\n\nהשורה התחתונה: דימטרי מרצה מעולה - לכו אליו. מה שכן קחו בחשבון שזה קורס שיכול ממש לשאוב לכם את הזמן. מעלה ממוצע", "timestamp": 1676057507005}, {"author": "Gg", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: \nנוכחות חובה , דיי מיותרות אבל הייתי משקיע את הזמן בשיעורי בית אחרים\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nלא קשים אבל יש הרבה מהם, הרבה מאוד\nהמבחן: \nאנסין עם שאלות ברמה דיי גבוהה לא נורא אבל גם לא פשוט לא משפיע ברמה דרסטית על הציון(מבחן ובוחן אמצע 30 אחוז ביחד).\nהשורה התחתונה: לקחתי בסמסטר א היה קצת עמוס אבל יעלה את הממוצע לפחות", "timestamp": 1676213203258}, {"author": "לידור זינו", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דר ילנה מזרחי\nחוות דעת - הרצאות: \nילנה מושלמת\nכל שיעור עבר בכיף, היו הרבה משחקים ואווירה קלילה בכל שיעור.\n\nשני הדברים אמנם היו עמוסים יחסי\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: \nבמסגרת הקורס היו שני דברים עמוסים ומאתגרים:\n1. להעביר פרזנטציה בת 10 דקות(לבנות אותה לוקח לכל היותר 3 ימים להערכתי)\n2. לבנות חדר בריחה וירטואלי (לוקח לכל היותר יומיים)\n\nיתר שיעורי הבית היו ממש קלילים, מסיימים אותם ב15 דקות לכל היותר\n\nהמבחן: \nאנסין פשוט\nהשורה התחתונה: \nמומלץ מאוד!! גם לבעלי פטור מאנגלית - לדעתי עדיף לקחת קורס אנגלית כיפי מאשר לקחת קורס קשה יותר בשפה האנגלית.", "timestamp": 1676456929552}, {"author": "C1", "difficultyRank": 4, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לוסי שולמן\nחוות דעת - הרצאות: \nהיה מאד נחמד וצחוקים בשיעורים, לרוב לוסי הייתה מסבירה נושא מסויים ואז היינו צריכים לפתור תרגיל בצוות, מי שסיים יכל ללכת הביתה מוקדם, לרוב סיימנו בשש\n\nשעורי הבית: יש יחסית הרבה שיעורי בית, פעם בשבוע לפחות ולרוב פעמיים בשבוע, התרגילים יחסית מהירים, חצי שעה בממוצע, והרוב זה עובר נכשל\n\nהמבחן: \nהמבחן הוא לא המרכזי אלא יש מספר עבודות ומבחנים שצריך לעשות\nמבחן אמצע - 10 אחוז, אנסין וקטע גרמר\nמבחן סוף - 10 אחוז אנסין ןקטע גרמר\nעבודת סוף - 35 אחוז (או 40 אפילו) מכינים מצגת ופרזנטציה בקבוצה על נושא מהתואר, 8 דקות הצגה כל אחד\nמבחן מילון - 5 אחוז, לוקחים טקסט מחפשים בו מילים ומחפשים הגדרה נכונה במילון\n ומבחן כתיבה - 15 אחוז, כותבים 250 מילים, מאמר דעה\n\nהשורה התחתונה: קורס קליל, היה מאד נחמד ומאד מגבש, מכירים אנשים מפקולטות שלא הכרנו, אבל המון שיעורי בית", "timestamp": 1676536753882}, {"author": "ins", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דימטרי\nחוות דעת - הרצאות: לברוח!!!!!!!!\nעושה רושם שהוא חמוד אבל בחצי השני של הסמסטר הוא דוחף 80 אחוז מההגשות\nעשוה מבחנים משל עצמו והם ברמה לא נורמלית וגם אף אחד לא הספיק לסיים\nהיו ציונים מאוד נמוכים (יחסית לאנגלית) והייתה השקעה מרובה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש מלא!!!!! פעמיים בשבוע שיעורי בית ועוד כל מיני מטלות והצגות וגם כמובן להציג מול הכיתה\n\nהמבחן: לא פרופורציונלי ולא פתיר בכמות הזמן\n\nהשורה התחתונה: אומנם מעלה את הממוצע אבל הרבה יותר מדי השקעה ביחס ל3 נקז, עדיף לעשות אמירם", "timestamp": 1677508265556}, {"author": "מאיה", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דימיטרי\nחוות דעת - הרצאות: \nאחלה מרצה. נותן ציונים טובים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nנותן משימה קטנה כמעט כל שבוע.\n\nהמבחן: \nרוב הציון הוא על פרוייקטים במהלך הסמסטר, ויש 2 בחנים על טקסט.\nהשורה התחתונה:", "timestamp": 1679328014542}, {"author": "Razan", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דמיטרי\nחוות דעת - הרצאות: אני לא יודעת מה אנשים מדברים פה בביקורות הוא היה ממש ממש חמוד - הוא מדבר רק אנגלית ורוסית אז לא יכול לתרגם לכם לעברית שזה קצת מקשה אבל זה היה לי בסדר כי רמה האנגלית שלי די טובה (נק מפטור) אבל נכון שדימטרי נותן מטלות כל שבוע כמעט אבל כך גם כל שאר המרצים - הם ליטרלי מסונכרנים - הוא נותן ציונים ממש טובים ודי הוגנים - יש בסוף שני פרויקטים לקראת סוף הסמסטר שדורשים קצת השקעה בקבוצה אבל זה היה אחלא. ניסיתי את לוסי לשיעור אחת היא הייתה בלתי נסבלת וממש משעממת בקטע מפחיד - התחלתי להירדם מהשיעור (לא יודעת למה חשבתי שהיא תהיה בלונדינית אבל היא ממש לא). הלכתי גם לוורה בתחילת הסמסטר לאיזה 6 שיעורים ושם היה לי ממש עמוס בשיעורי בית בנוסף היא עושה מבחנים ובחנים לא קשורים למציאות - בכל שיעור אנחנו מוצאים ממאמרים או טקסטים שקוראים ביחד בכיתה מילים ״קשות״ וצריך להעלות אותם אחרי כל שיעור! לקויזליט האישי שזה היה מתסכל וחסר כל טעם. ואחרי איזה חודש עושים בחן עליהם - מזל שעברתי לפני שהיה את זה. \nחשובה לדעת !\nלוסי ודימטרי מסונכרנים - זאת אומרת עושים את אותו מבחן בדיוק אבל אולי בחן בצורה שונה \n\nוורה עובדת איך שהיא רוצה ולא קשורה לשניים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש כל שבוע טסקט ושאלות אבל עושים חצי בכיתה והשאר בבית - יש כאלה שהיא מסיימים בכיתה והיה איזה פעמיים שהייתה מטלה שלא התחלנו בכיתה וצריך לעשות לבד אז לדעתי זה ממש סביר.\n\nהמבחן: יש בחן של אוצר מילים שקשור למקורי מידע שאנחנו ממילא עושים לפרויקט מס 2 והוא מחלק מאמר לכל סטודנט ופשוט מוציאים מילים שאנחנו לא יודעים - היה ממש סביר. יש שני מבחני unseen שהם על רמה - אבל פתירים - הם יחסית צפופים מבחינת הזמן המוקצב למבחן אבל ליטרלי זה אותו מבנה מבחן לדעתי לכל הקורס.\n\nהשורה התחתונה: אני ממש נהנתי להיות על דימורי ואני ניסיתי ליטרלי 3 מרצים + שמעתי הרבה זוועות מחברות על מורות בזום אחרות אז כן הייתי אומרת לכו לדימטרי אם הוא מסתדר לכם. כמובן זו רק דעה שלי כי יש אנשים שלא התחברו אליו (כמו לכל מורה)", "timestamp": 1679694982365}, {"author": "המלך", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: מצחיקה, נוכחות חובה, לא חשוב להקשיב באמת. בסוף זה אנגלית קצת מעל רמת תיכון.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: לא נורמלי, מטלה של שעה מהיום למחר. כל שבוע מטלה או שתיים, פשוט לא הגיוני.\n\nהמבחן: אנסין רגיל, לא מיוחד. גם הבוחן אמצע ככה. \n\nהשורה התחתונה: קורס מנפח ממוצע ממש.", "timestamp": 1680166372660}, {"author": "כרמלה", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:  כרמלה שהב\n\nחוות דעת : להוציא 80 עם כרמלה קשה מאוד, בכל שיעור יש תרגיל בית שלוקח 4,5 שעות ובנוסף המבחן הסופי  היה קשה מאוד.. בנוסף הבחנים שהיו במהלך הסמסטר היו ברמה אחרת יחסית לקבוצות אחרות ולא נתנה לנו עזרה או בונוס. \nהיא לוקחת את הקורס ברצינות גבוהה לכן אם אתם רוצים להוציא ציונים טובים לא ממליץ לקחת את הקורס עם כרמלה.\n\nשעורי הבית: 2 \n\nהשורה התחתונה:", "timestamp": 1687177343920}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה:כרמלה שהב\nחוות דעת - הרצאות: \nקצת לאזן את מה שאומרים עליה, היינו כיתה קטנה, השקעה של כלום זמן במהלך הסמסטר, רחוק מאוד מכל שבוע כמו שכתבו פה. פירגנה בציונים, לא באה להתקיל או להקשות והייתה מאוד נחמדה.\n\nשעורי הבית: \nפעם בהרבה זמן להקדיש חצי שעה בערך.\nהמבחן: \nאנסין כמו בתיכון\nהשורה התחתונה: \nקצת קאדר, אבל ציון גבוה יחסית בלי להתאמץ בכלל.", "timestamp": 1688656711224}, {"author": "o.k", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דימיטרי\nחוות דעת - הרצאות: מרצה נחמד ונראה שתמיד יש לו רצון להסביר  \n המתרגל/ת: אין\nחוות דעת - תרגולים: \nשעורי הבית: לרוב מטלות קלילות. מדי פעם יש מטלה שהוא יחסית מתקטנן ומוריד נקודות ובנוסף 2 מצגות להכין ולהציג בכיתה.\n\nהמבחן: שווה 25% ויש בו אנסין ושאלות הבנת הנקרא + grammer אצלנו היה מבחן די קשוח והוא הוריד נקודות אבל יש אופציה לשפר חלק מהשאלות שם בעזרת מיני מבחן חדש \n\nהשורה התחתונה:  קורס נחמד שאפשר להוציא בו ציון טוב עם השקעה ממוצעת", "timestamp": 1689259205573}, {"author": "יהונתן הרפז", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: כרמלה שהב\nחוות דעת - הרצאות: נחמדה ומתחשבת. באה לקראת הסטודנטים. שעות לא נוחות אבל מצד שני קבוצה קטנה ויחס טוב \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין תרגולים \n\nשעורי הבית: לא קשים מדי, לא יותר מדי. דדליינים ארוכים \n\nהמבחן: קליל עשר שאלות אמריקאיות רק צריך לדעת אנגלית \n\nהשורה התחתונה:", "timestamp": 1689347064340}, {"author": "Roy", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: \nלא עושים הרבה בשיעורים יותר לומדים איך לעשות את העבודות. משתחררים בממוצע חצי שעה לפני הזמן\n\nשעורי הבית: \nיש שיעורי בית לקראת סוף הקורס זה קצת לחוץ כי ממש בודקים את העבודות האחרונות\nהמבחן: \nמבחן 25 אחוז מהציון אותו מבנה כמו הבגרות באנגלית", "timestamp": 1689415608174}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ילנה מזרחי\nחוות דעת - הרצאות: ילנה ממש מקסימה, לכו אליה.\n\nשעורי הבית: יש לא מעט במהלך הסמסטר, לא בשמיים אבל דורש משהו כמו שעה-שלוש שעות בשבוע בערך.\n\nהמבחן: היינו צריכים להציג 2 פרזנטציות בכיתה, אחת של מיני פרויקט בקבוצות של עד 3 אנשים במשך 5 דק' בערך (25% מהציון), ועוד סימולציה טיפה יותר ארוכה בקבוצות או ביחידים על תחום שקשור לפקולטה שלכם (30% מהציון). לא כבד מדי ודווקא נחמד. \nהיו גם 2 בחני אוצר מילים (שניהם סה\"כ 10%) ובסוף מבחן אנסין שהיה ממש בסדר (25%).\n\nהשורה התחתונה: עדיף על מלג באנגלית. אולי צריך להשקיע טיפה יותר אבל זה ממש בסדר, זה באווירה טובה והציון שווה את זה בסוף.", "timestamp": 1689448668693}, {"author": "S", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ורה קיטייב\nחוות דעת - הרצאות: ורה מעבירה את התכנים בצורה ממש קלילה, כמו סדנה או חוג. היא אוהבת שמשתתפים והיא גם תבקש להקריא בקול (מפסיקים להתבייש אחרי שני שיעורים). כל שיעור נפתח במין קהות כזה שזה נחמד. ההרצאות הן שעה וחצי בלי הפסקה אבל זה עדיף כי אנחנו היינו מאוחר. היא מנסה להקל ולא להיכנס לפינות של כל הנושאים אבל היא כן דורשת לעבוד ולהשתתף. נוכחות חובה וחבל שירד ציון על זה. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין הרבה בכלל, חלקם לעשות ולהביא לכיתה ומעט להגיש. הבאסה היא שהיא אוהבת שמגישים פיזית ולא במודל (משמע להדפיס). לא קשים אבל זה זמן שצריך במצטבר להשקיע.\n\nהמבחן: לנו לא היה מבחן סופי, הקורס בנוי מבחנים בכל נושא (מילים, אנסין, שמיעה וכו’) אז זה סבבה. כן כדאי ללמוד אליהם כי עם כמה שורה קלילה ועושים צחוקים, היא בודקת די קפדני. \nהשורה התחתונה: קורס קליל (במיוחד למי שיודע אנגלית די סבבה), כן לקחתי ממנו דברים, אם כבר הוא חובה, ונחשב כקורס אנגלית.", "timestamp": 1689661686477}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ורה קיטייב\nחוות דעת - הרצאות: מרצה נהדרת. מאוד נחמדה ומתחשבת בכל מקרה של מילואים/חולי וכו'... יש שני בחני מילים לא קשים מדי ומבחן אנסין בסוף גם לא בשמיים. לאורך הסמסטר יש כל מיני עבודות קטנות ופרנזטציה אחת שהיא לא הכי קשה בעולם.\nהציונים אצלה גבוהים מאוד והיא באמת עושה הכל כדי שהשיעור יעבור בכיף ובאווירה טובה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל מיני עבודות קטנות לאורך הסמסטר\n\nהמבחן: אנסין בסוף...\n\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1689663347864}, {"author": "...", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: לוסי שולמן\nחוות דעת - הרצאות: היא נחמדה מאוד ולא מעמיסה יותר מדי ממש מומלצת.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש כל שבוע או אפילו כל שיעור אבל זה ממש 10 דקות אם מתרכזים ובד\"כ לוסי הייתה נותנת להתחיל בכיתה.\n\nהמבחן: לא קשה זה אנסין והמשקל שלו לא יותר מהפרזנטציה זה מה שחשוב באמת\n\nהשורה התחתונה: קורס קצת חופר אבל עם לוסי הוא קצת פחות", "timestamp": 1689669405787}, {"author": "אנונימית - DDS", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דר ילנה מזרחי\nחוות דעת - הרצאות: 2 הרצאות בשבוע היא מדברת רק אנגלית בכיתה בהתחלה היה מוזר אבל נהיה בסדר עד הסוף לדעתי שיפרת מלא דברים שהם נחוצים לנו ו לעבודה בעתיד בנוסף היא חמודה ו אני אישית התחברתי לה.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\nשעורי הבית: מבחינת שיעורי הבית היא נותנת כל שיעור עד לחודש האחרון, אבל להבנתי כל המרצים מסונכרנים ו נותנים אותו הדבר גם שיעורי הבית יחסית קלילים \nבנוסף היו שני הצגות אחת עושים בקבוצות שהייתה קלילה לדעתי לקחה ממנו יום להכין אותה , בנוסף הייתה מצגת שמציגים בנפרד אני הכנתי אותה ביום ו התכוננתי על ההצגה שלושה ימים כל יום כמה שעות , אבל היא נותנת ציונים טובים\nהמבחן: יש שני מבחני אוצר מלים משהו כמו 40-50 מילה קלילים בנוסף היה מבחן בסוף שהוא נחשב קליל \nהשורה התחתונה: בכמה השיעורים הראשונים תפתרו כל שיעורי הבית אני היה לי מבחן ו לא עשיתי אותם ו היו מלא דווקא בשבוע הזה ו היו 2 הנק היחידות שירדו לי", "timestamp": 1690273109759}, {"author": "אנגלית", "difficultyRank": 1, "generalRank": 3, "semester": "202203", "text": "שם המרצה: דמיטרי \nחוות דעת - הרצאות: \nמרצה נחמד. לפעמים קצת קשה להבין אותו כי הוא לא מדבר עברית בכלל. אם הוא מסביר על מטלות צריך להקשיב טוב בגלל זה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: הרבה מטלות שמרכיבות את הציון. מרגיש קצת מיותר , אבל לא לוקחות הרבה זמן, חוץ מפרויקט בסוף שהוא קצת יותר ארוך, אבל הוא קבוצתי.\n\nהמבחן: היה unseen במקום מבחן+ מטלות/ש.ב . הunseen היה סבבה ואפשר היה להוציא ציון טוב. דמיטרי גם נתן אופציה לשפר ולהגיש שוב ואז הוא עשה ממוצע בין השיפור לכמה שקיבלת בפועל בבחן.\n\nהשורה התחתונה: אם אתם חזקים באנגלית ומתלבטים לעשות מבחן אמיר/ לשפר את חלק האנגלית בפסיכומטרי או לעשות את הקורס אז עדיף לעשות בקיץ(חייבים בכל מקרה 2 קורסים באנגלית וזה מוריד לכם אחד מהם) וגם אפשר להוציא אחלה ציון תוך כדי. לדעתי, הקרוס לא קשה, אבל אם משלבים אותו בסמסטר רגיל זה יכול להיות קצת יותר עמוס.", "timestamp": 1694956929133}, {"author": "לא חשוב", "difficultyRank": 2, "generalRank": 5, "semester": "202203", "text": "שם המרצה: דימטרי\nחוות דעת - הרצאות: דימטרי נהדרר ואכפת לו מהסטודנטים, היה לי כיף ללמוד בהרצאות שלו\n\nשעורי הבית: יש הרבה מטלות לעשות אבל לא קשים, ודימטרי נותן ציונים טובין\n\nהמבחן: unseen text , לא קשה ניתן לקבל ציון טוב במבחן הזה שמהווה 25%\n\nהשורה התחתונה: אם רוצים לסיים את הקורס הזה בציון טוב אז לכו לדימטרי, ומאוד ממליץ לעשות את הקורס בסמסטר קיץ, זה לא עמוס!", "timestamp": 1695037665320}, {"author": "אנונימית", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: לוסי שולמן\nחוות דעת - הרצאות: \nמרצה אידיאלית לאנגלית. לא דורשת כמעט כלום, מבטלת לפעמים, אפשר לעשות חופשי שיעורי בית בשיעור ולא להיות איתה. מפרגנת בציונים ונתנה לנו לתקן חלק מהשאלות בשביל לשפר את הציון. נוכחות חובה שזה באסה, אבל לא תמיד היא בודקת שמות. השיעור עצמו די משמים. \n\nשם המתרגל/ת: איו\nחוות דעת - תרגולים: \n\nשעורי הבית: \nהיו מידי פעם תרגילי דקדוק או אנסינים, בעיקר מטלות לפרויקט (הצגה בכיתה). די בקטנה לרוב סיימנו אותם בכיתה. \n\nהמבחן: \nיש אנסין שהוא אחלה, ופרויקט של מחקר קטן והצגה בכיתה. מספיקים לעבוד כמעט על הכל בכיתה. \n\nהשורה התחתונה: קורס מעיק בגלל שזה 4 שעות בשבוע אבל בלי הרבה דרישות ובד\"כ מעלה את הממוצע.", "timestamp": 1695067390350}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202203", "text": "שם המרצה: לוסי שולמן \nחוות דעת - הרצאות: לוסי חמודה ממש, היא עזרה בכל דבר שהיינו צריכים ולא היה לה אכפת בכלל שאנחנו לא תמיד איתה  (אני כתבתי דוחות מעבדה תוך כדי השיעורים והיא לא העירה בשום שלב).\n\nהקורס בכללי : עשו עלינו פיילוט אז יכול מאוד להיות שזה לא ימשיך. בתכלס היה כמה משימות גדולות של הקורס וקצת משימות קטנות. הרבה עבודה בקבוצות אבל חוץ מלפני המבחן לא מצאתי את עצמי משקיעה בקורס הזה יותר מדי זמן בבית.  \n\nהמבחן: הוא קורה באמצע הקורס ולא בתאריך שפורסם אז אל תקבעו שיעורים שאתם לא מגיעים אליהם לפני שאתם יודעים מתי המבחן. התאריך שמפורסם הוא התאריך של המועד ב'. אנסין עם שאלות (למצוא את הmain idea ואת המסקנה ולכתוב במילים שלנו ועוד כמה שאלות יותר קטנות)  ובסוף צריך לכתוב מייל דיווח. לנו נתנו אופציה לשפר שאלה כי הציונים היו יחסית נמוכים. \n\nהשורה התחתונה: קורס חופר וחובה, לעשות אותו בקיץ הייתה החלטה ממש טובה כי אז הוא לא מפריע לקורסים אחרים במהלך הסמסטר והוא נגמר מהר.", "timestamp": 1695189594226}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202203", "text": "שם המרצה: דימיטרי\nחוות דעת - הרצאות: מרצה מומלץ, מסביר את המטלות היטב \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: \nהיו לא מעט מטלות שמרכיבות את סהכ הציון\n\nהמבחן:  מבחן אנסין , דימיטרי נתן לנו לשפר את הציון \n\nהשורה התחתונה: מומלץ לעשות בקיץ ולקחת את דימטרי", "timestamp": 1695204239897}, {"author": "o", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: לוסי שולמן\nחוות דעת - הרצאות: טיפה משעממות אך היא תמיד משתדלת להוסיף סוג של פעילויות כדי לעשות אותן כיפיות יותר\n\nשעורי הבית: גם משעממים ולפעמים מיותרים! כמעט את כל התרגילי הבית היא לא בודקת ורק בסוף הסמסטר עוברת על הכל בגדול ונותנת ציון בהתאם.\n\nהמבחן: המבחן עצמו היה סביר, אך הורדת הציונים הייתה מוגזמת.\n\nהשורה התחתונה: מרצה נחמדה ומתחשבת אך טיפה מגזימה בבקשות.", "timestamp": 1713253270396}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לוסי \nחוות דעת - הרצאות: נחמדות מאוד . בסך הכל לוסי מעבירה את השיעורים באווירה מאוד נעימה וקלילה, החומר אינו קשה בכלל ופשוט צריך רצון להשתתף בשיעורים וזה הכל. השעות הן טיפה מאוחרות, בסופי יום אבל לא מעט מהפעמים לוסי גם משחררת מוקדם יותר. \n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: \n\nשעורי הבית: סבירים ביותר. לא היו לנו הרבה שיעורי בית ובכל מקרה םה לא לקחו יותר משעה בשבוע גג. לסיום הקורס נדרשנו לעבוד על מצגת בהתאם לנושא של התואר שלנו והציג אותה בקבוצות בפני הכיתה בשני השיעורים האחרונים. \n\nהמבחן: המבחן דומה למבחני אנסין אמריקאים בתיכון. ברמה סבירה ביותר ללא צורך ללמוד לפני, אולי לחזור קצת על גראמר באנגלית שמועבר באחד מן השיעורים. \n\nהשורה התחתונה: עם לוסי הקורס קליל מאוד ועובר מהר.", "timestamp": 1714670375552}, {"author": "י", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לוסי שולמן\nחוות דעת - הרצאות: לוסי מעולה נראה לי היה הבחירה הכי טובה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש מלא ומהיום למחר אבל לא משהו רציני וגדול כמעט\n\nהמבחן: המבחן סביר אנסין כזה קצת מחפשים את הניסוח הספיציפי שלהם ולא תמיד קולע מה שמבאס\n\nהשורה התחתונה:", "timestamp": 1715252646060}, {"author": "פבל", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ורה קיטייב\nחוות דעת - הרצאות: פשוט מושלמת. מרצה טובה, נחמדה, מעניינת ולא נותנת שיעורי בית. ממליצה ממש ממש למרות השעות, היה שווה.\n\n\nשעורי הבית: אין אצל ורה :)\n\nהמבחן: לנו היה אנסין, ליסנינג טסט וכל מיני עבודות לאורך הסמסטר שבעיקר עשינו בכיתה. סך הכל לא מעיק בכלל, די קליל במיוחד למי שיש לו אנגלית טובה. \n\nהשורה התחתונה: חובה, ממש נחמד ככה הפסקה באמצע היום מכל המתמטיקות, אווירה טובה והכי חשוב מעלה את הממוצע.", "timestamp": 1717943850540}, {"author": "αβγδ", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: לוסי\nחוות דעת - הרצאות: לוסי מאוד נחמדה וטובה, מקבלים אחלה ציונים איתה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סתם....\n\nהמבחן: סתם....\n\nהשורה התחתונה: לכו ללוסי", "timestamp": 1718363931752}, {"author": "ו", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה:נינה  \nחוות דעת - הרצאות: \nמקסימה ממש ממש , לא מביאה שיעורי בית מעבר לקרוא טקסט כדי שנעשה את השאלות בכיתה ,יש כמה מטלות כיתה עם ציון ,מבחן אנסין ופרזנטציה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718773874825}]}