{"posts": [{"author": "ניק", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: מאוד מעניינות - לא צריך רקע כזה עמוק בביולוגיה לפני כן\n\nהמבחן:  עדיין לא בוצע \n\nהשורה התחתונה: \nמרצה שמלמדת פעם ראשונה במל\"ג\nלא לקחה נוכחות\nיש הקלטות של השיעורים שלה\nומצגות במודל\nהיא בן אדם אחלה באופן כללי\nממליץ להסתכל בהתפלגות ולבדוק - מהמר שיהיה חציון 100", "timestamp": 1674659071612}, {"author": "ווטסון & קריק", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת פליגלמן\nחוות דעת - הרצאות: \nתוכן ההרצאות מעניין ומעשיר בעיניי, לא צריך רקע בכלל - מרגיש שאני מבין יותר טוב נושאים של אתיקה ומוסר שקשורים למדע ולמדינה, והיה מעניין ללמוד על הסטורייה של המדע.\nאין חובת נוכחות!\nיש הקלטות למרות שמצגות ההרצאות מפורטות מאוד\nאם ענת תעביר קורסים אחרים ממליץ מאוד לקחת איתה\nשעורי הבית: \nאין!!\nהמבחן: \nאמריקאי, מאוד קל, ועוד עם חומר פתוח!\nיש 8 שאלות אמריקאיות של \"דעה\" שבייסיקלי כל תשובה בה מתקבלת, ועוד 22 שאלות אמריקאיות על החומר, בשעתיים.\nנכחתי כמעט בכל ההרצאות הסמסטר למרות שלא היה חובה, קראתי את החומר פעם אחת לפני המבחן, והצלחתי לענות על השאלות במבחן בלי להיעזר בחומר הפתוח. המבחן היה לשעתיים, סיימתי לענות על כל השאלות בחצי שעה ועוד 20 דקות הקדשתי ללעבור ברגוע על התשובות (ולא לשנות אף אחת). זה כמה המבחן היה קל.\nהשורה התחתונה: \nרוצו לקחת!!! מל\"ג מושלם", "timestamp": 1675324368319}, {"author": "he", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: \nנושאים מאוד מעניינים, בקורס רואים הרבה דילמות מוסריות לגבי ההתפתחות המדעית. ענת מרצה טובה, היו הקלטות באיכות טובה, היו מצגות (איכותיות) בכל שיעור ובשיעור האחרון מצגת סיכום. \nאין נוכחות חובה בקורס.\n\nשעורי הבית: \nאין.\n\nהמבחן: \nקל מאוד, 22 שאלות אמריקאיות (ועוד 8 שאלות בונוס שכל תשובה נכונה, פשוט להביע עמדה בדילמה מסוימת) בשעתיים, חומר פתוח!! מאמין שהרוב הדפיסו את המצגת סיכום וכל התשובות היו שם.\n\nהשורה התחתונה: \nחומר מעניין, מבחן קל, חומר פתוח, הקלטות, אין נוכחות חובה.", "timestamp": 1675343301989}, {"author": "Bar Gabbay", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: \nאין נוכחות חובה, יש את המצגות במודל וגם את ההקלטות. בגדול - היה מעניין לפי דעתי אבל ממש ממש לא הכרחי להגיע כדי להצליח במבחן.\nהמבחן: \nמבחן עם חומר פתוח (!) קליל ביותר, דרש ממני אולי 3-4 שעות של לעבור על החומר.\nאפשר לפתור את רוב השאלות עם Common Sense \n\nהשורה התחתונה: \nמלג מאוד מאוד מומלץ, ממוצע 99 חציון 100 (45 מתוך 50 קיבלו 100 במבחן)", "timestamp": 1675632998187}, {"author": "רון קרויטורו", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת פליגלמן\nחוות דעת - הרצאות: הנושא מאוד מעניין, אבל המרצה עצמה דיי משעממת. היא מאוד נחמדה ומאוד באה לקרת הסטודנטים.\nהיא הקליטה את כל ההרצאות, אין נוכחות חובה.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: היה עם חומר פתוח, והחומר ממש קל.\n\nהשורה התחתונה: מלג מומלץ בטירוף! הציון מדבר בעד עצמו.\nהתנאים שלו זה הכי טוב שאפשר לבקש. למדתי שעה למבחן וקיבלתי 100. ממליץ בחום.", "timestamp": 1675802395435}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: מרצה מאוד מתחשבת, אבל די משעממת. היה קשה לשבת בשיעורים שלה, למזלנו הנוכחות לא הייתה חובה. \nהייתה מאוד גמישה (הקליטה, הסכימה לתת הפסקה וגם לסיים מוקדם, הסכימה לאמריקאי עם חומר פתוח)\n\nהמבחן: קל מאוד, שאלות הגיון יותר מכל דבר אחר\n\nהשורה התחתונה: מל\"ג מומלץ מאוד אם אתם מחפשים ציון קל. טיפה פחות אם מחפשים עניין", "timestamp": 1675864845024}]}