{"posts": [{"author": "אלון", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: מעניינות, יש רק הרצאה או 2 טיפה משעממות. המבחן אמריקאי ואפשרי מאודלקבל 100", "timestamp": 1599385957429}, {"author": "akiva zonenfeld", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: אחלה מרצה. אוהבת את התחום שלה ושולטת בו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קליל ביותר למרות שאני לא אתפלא אם ישתנה בשנים הבאות\n\nהשורה התחתונה: אחלה קורס. מעניין עם מבחן סבבה", "timestamp": 1602926375776}, {"author": "פרטי", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: נורית שטובר\n\nשעורי הבית: אין\n\nהמבחן: על הפנים במקום להתעסק בהבנה העדיפה לשאול על דברים קטנים ודוגמאות ספציפיות שאלה על התפל ולא על העיקר. השאלות היו מבלבלות בכוונה ומפילות על קטנות ועל ניסוח (נכון/לא נכון) הממוצע נמוך \n\n\nהשורה התחתונה: אם המרצה ממשיכה ככה ואתם רוצים שזה יעלה ממוצע אל תיקחו את הקורס", "timestamp": 1611746794519}, {"author": "מישהו שמתחרט שלקח את המלג", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: מבחן שלא משקף בכלל את מה שנלמד בקורס ולמרצה אין מה לעשות אם ירדו לכם הציונים ב 15 נקודה אחרי שהוזנו ציונים לא נכונים.. בקיצור אל תקחו את המלג הזה!! גם עם ההרצאות המשעממות שאין שאלה אחת עליהן במבחן\n\nהמבחן: מלג עם ממוצע 85!! מי לוקח?\n\nהשורה התחתונה: אל תקחו את המלג הזה!!", "timestamp": 1611748954189}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nאין\nהמבחן: מקבלים ציון של 97 וקמים בבוקר שאחרי לקבל הודעה שקיבלת 72\nמבחן קשה עם חומר מאוד גדול, מומלץ לקחת אותו כ אתגר חדש לחיים\nהשורה התחתונה:", "timestamp": 1611749903784}, {"author": "חתול בשק", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "המבחן: אתה יכול לדעת את החומר ברמה של 100\nבסוף שאלות במבחן מטעות בכוונה וממוצע 85 שלא משקף את הידע שלך.\n\nהשורה התחתונה: חתול בשק, טעות לקחת חבל עליכם", "timestamp": 1611751655578}, {"author": "מאוכזבת", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: ההרצאות מעניינות מאוד והחומר מרתק- ובאותה מידה אפשר ללמוד אותו משיטוט בויקיפדיה. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: קשה בצורה לא פרופורציונלית! המרצה שאלה שאלות מכשילות וטריקיות, על דברים שנאמרו במשפט אחד קצר בהרצאה אחת שלא היה שום סיכוי לדעת אותו אם לא חוזרים לראות שוב 15 שעות של הרצאות. במקום להתעסק בחומר עצמו (ויש הרבה ממנו) שאלה על הדברים הכי קטנים והכי לא משמעותיים וכל מי שידע את החומר טוב לא יכל לקבל ציון טוב בלי מזל בניחושים. פשוט מאכזב ומביש שככה מלג שנועד להעשיר את הידע נראה. \n\nהשורה התחתונה: *לא לקחת את המלג הזה!!! הישמרו לנפשותיכם*", "timestamp": 1611762211258}, {"author": "להתרחק כמו מאש", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: חלק מהחומר מעניין, יש כמה הרצאות משעממות\n\nשעורי הבית: אין\n\nהמבחן: מבחן זוועה!!! המרצה מנסה להוכיח שהקורס שלה \"חשוב\" ע\"י הורדת הממוצע, היא חיברה מבחן זוועתי עם שאלות טריקיות, שאלה על הדברים הכי נישתיים שנאמרו במשפט בהרצאה, גם אם למדת שבוע לפני המבחן אין מצב לקבל מעל 90 אלא אם כן אתה טוב בניחושים. \n\nהשורה התחתונה: להתרחק להתרחק להתרחק!!! לא שווה לקחת מל\"ג כזה, ממוצע 85 עם נוכחות חובה גם. שיגעון גדלות של המרצה שלא מבינה שהיא רק מעבירה מל\"ג.", "timestamp": 1611820330010}, {"author": "אנונימס", "difficultyRank": 5, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: בהרצאות היא סבבה אבל בזמן המבחן והציונים היא לא התייחסה אלינו בכלל. הרגשתי שהיא באה בגישה של ״אתם חושבים שאתם חכמים?״ או של ״אני אראה לכם שמל״ג זה קורס חשמל״ \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אים\n\nשעורי הבית: אין\n\nהמבחן: חומר גדול מאוד, כמות מושגים לא הגיונית והמבחן הוא בקיצוק בא להכשיל ולהטעות סטודנטים.\nהמרצה שמה שאלות ממש מדויקות שהקושי דיברה עליהם בההרצאות ולא התייחסה לרוב החומר!\n\nהשורה התחתונה: ממוצע נמוך וזה משקף עד כמה הקורס נוראי, לא לקחת!!!", "timestamp": 1611846487479}, {"author": "ר", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: הרצאות סבבה והיא בדקה נוחכות במטלה שהיא פתחה במודל לחצי שעה בתחילת השיעור אז לא באמת צריך להיות נוחכים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן זוועה, ממש טריקי. שאלות נכון לא נכון מאוד מבלבלות אי אפשר לחזור אחורה במודל אם ענית ועברת לעמוד שאלות הבא. \nדוגמה לשאלות שלה: היא שמה במשפט אחד 4 היגדים 3 נכונים ו 1 טעות (או יותר גרוע שהיא פשוט לא דיברה על הרביעי בקורס ובגלל זה צריך לנחש שזה לא נכון) ושאלה על דברים מאוד ספציפיים שהיו ב 2 שקופיות בתחילת הקורס.\nאחרי המבחן פרסמה ציונים גבוהים בטעות ואז העלתה שלושה ימים אח\"כ היסטוגרמה חדשה עם ממוצע 85.\nכשהתלוננו בפניה שהמבחן היה יותר קשה מסמטר שעבר ושזה ממוצע הרבה יותר נמוך היא ממש התעצבנה.\n\n\nהשורה התחתונה: פשוט טעות לקחת את המלג הזה.", "timestamp": 1611857664932}, {"author": "DM", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים:- \n\nשעורי הבית: -\n\nהמבחן: קטנונית ברמות- מחפשת איפה להכשיל- ממש ממש לא מומלץ!!!!!!!\n\nהשורה התחתונה:  ממש ממש לא מומלץ!!!!!!! יש סיכום של 60 עמודים שגם הוא לא מכסה את הדקויות שלה.", "timestamp": 1613046576330}, {"author": "ריוליט", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית \nחוות דעת - הרצאות: \nסבירות לפי דעתי\nשם המתרגל/ת: -\nחוות דעת - תרגולים:- \n\nשעורי הבית: -\n\nהמבחן: השאלות במבחנים לא משקפות כלל את מה שלומדים בהרצאה, יש בעיקר שאלות קטנוניות על גבי דברים קטנים שבקושי נאמרים פעם אחת במשך כל הקורס.\n\nהשורה התחתונה: מל\"ג לא מומלץ , בעיקר בגלל הרצון של המרצה לאתגר את הסטודנטים על חשבון הציון שלהם בקורס", "timestamp": 1613914795941}, {"author": "Anonymous", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: לא משהו. היא נכנסת הרבה פעמים לפרטים קטנים ומצפה שנזכור אותם למבחן, במקום לדבר על התמונה הגדולה - מה שהופך את ההרצאות למשעממות מאוד. \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: -\n\nהמבחן: נוראי. המבנה משתנה מסמסטר לסמסטר, אבל בסמסטר הזה, היו 27 שאלות נכון/לא נכון. הרבה שאלות הן בעצם כמה שאלות ביחד, חלק מהדברים נכונים וחלק לא, ורק אם כולם נכונים אז התשובה לשאלה היא: נכון. הממוצע נמוך למלג, והמרצה כנראה לא מבינה מה זה מלג.\n\nהשורה התחתונה:", "timestamp": 1613934802428}, {"author": "י", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: נורית\nחוות דעת - הרצאות: דורשת לראות כל מיני סירטונים נוספים (חלקם של שעה) גם אחרי שעות המלג. מישהו יכול לעדכן אותה שזה קורס העשרה בלבד?\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: היה 27 שאלות אמריקאיות (2 בונוס-לא שעזרו). המבחן היה מתחכם, היגידים נכון לא נכון שתמיד יש טוויסט בסוף של השאלה, הרגיש שהיא מנסה להתעמק בחלקי משפט שהיא זרקה בשרירותיות בהרצאה, לגמרי לא משקף את החומר ולגמרי לא ברמה שאתה מצפה ממלג.\n\nהשורה התחתונה: להתרחק כמו מאש, חבל על הממוצע שלכם", "timestamp": 1614498046256}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: \nהרצאות מעניינות וכיפיות מאוד, נורית מרצה מעולה.\nשעורי הבית: \nאין\nהמבחן: \nהמבחן היה שאלות נכון/לא נכון בניגוד לשאלות אמריקאיות בד\"כ. היו שאלות קצת טריקיות לפעמים אבל לא יותר מדי. לקראת סוף הקורס היא נותנת אפשרות לתת לה שאלות לתת למבחן וגם בוחרת חלק מהן, ועוברת על כולן מול כל הכיתה ועונה עליהן. אפשר היה לצבור יותר מ-100 נקודות סה\"כ, ככה שהמבחן היה סה\"כ הוגן.\nהשורה התחתונה: \nאחלה קורס, מאוד מעניין, יש מאגרי שאלות וסיכומים טובים מאוד לקורס. למידה רצינית של יום יכולה להביא לאחלה ציון. אני ממליץ", "timestamp": 1615808828084}, {"author": "אלפרד וגנר", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  נורית שטראובר\nחוות דעת - הרצאות: \nהרצאות די משעממות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמבחן קטנוני, על נתונים שהמרצה דיברה עליהם שנייה בהרצאה ושאלות מתקילות, מי שכן מחליט לקחת מומלץ שירשום את כל הפרטים הקטנים.\nהשורה התחתונה: לא המל''ג הכי מומלץ.", "timestamp": 1615813108137}, {"author": "ano", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: \nההרצאות יכלו להיות מאוד מעניינות אבל לצערי המרצה לא כלכך מצליחה ליצור עניין, בנוסף יש לא מעט חומר שהיא מעבירה שהוא מטעה ולא נכון. ובכללי מרגיש שהלימוד לא כלכך אפקטיבי.\nשם המתרגל/ת: \nאין\nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nאין\nהמבחן: \nבמועד א' היה ממוצע של 87 שזה נמוך מאוד למלגים. הוא התעסק בכל מיני דברים שהועברו בהרצאות היו כמה שאלות שהרגישו מאוד קטנוניות שבשביל לענות היה צריך לזכור בעלפה כל מיני ניואנסים קטנים מהחומר.\nהשורה התחתונה: \nהשיעורים לא היו מעניינים מאוד המבחן היה לא סביר והמלג לא מומלץ", "timestamp": 1625395588785}, {"author": "B3", "difficultyRank": 4, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nנורית שטובר\n\nחוות דעת - הרצאות: \nשעה וחצי כל שבוע, ויש נוכחות חובה. הסמסטר הנוכחי היה היברידי וההרצאות של הקורס היו רק בזום והיה צריך לרשום נוכחות בMoodle.\nהחומר הנלמד מאוד מעניין. המרצה אינטליגנטית ובעלת הרבה ידע בתחום, והיא מסבירה את החומר בצורה מאוד ברורה. \nבנוסף להרצאות, יש דרישה לצפות בכמה סרטונים בYouTube שחלק מהם באורך שעה (בדרך כלל חוזרים על החומר שנלמד בהרצאות).\nלמשל \nhttps://youtu.be/57merteLsBc\nhttps://youtu.be/tRPu5u_Pizk\nhttps://youtu.be/zbtAXW-2nz0\n\nשעורי הבית: \nאין\n\nהמבחן: \n27 שאלות אמריקאיות, וצריך לפתור 25 נכון כדי לקבל 100 (כלומר כבר מההתחלה יש פקטור 8 נק'). לכל שאלה היו 4 תשובות ולחלק מהשאלות דרוש הבנה עמוקה של החומר הנלמד כדי לפתור אותן נכון.\nיש מעט מאוד שאלות שמשוחזרות ממבחנים קודמים.\nהמרצה ביקשה לפני שבועיים מהמבחן שנכתוב לה שאלות עם תשובות והיא השתמשה בחלק מהן.\n\nהשורה התחתונה: \nמומלץ למי שאוהב ללמוד דברים על כדור הארץ שלנו, אבל לשים לב שהקורס דורש הרבה השקעה ביחס למלג; אם לא תלמדו את חומר הקורס במהלך הסמסטר אז יהיה בלתי אפשרי ללמוד את החומר בשבוע האחרון (שגם ככה עמוס) ולקבל 100.", "timestamp": 1625400954053}, {"author": "א", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nד\"ר נורית שטובר\n\nחוות דעת - הרצאות: \nרובן מעניינות.\n\nשעורי הבית: \nיש כמה סרטונים (וסרט אחד) לצפייה.\n\nהמבחן: \nאמריקאי. הוגן. צריך ללמוד.\n\nהשורה התחתונה: \nקורס מעניין למי שאוהב את הנושאים. צריך להקשיב בהרצאות, ללמוד ולשנן את החומר לקראת המבחן ואפשר בהחלט להוציא 100.", "timestamp": 1633951480580}, {"author": "אורי עברון", "difficultyRank": 4, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניינות למי שאוהב גיאולוגיה, לפעמים אפילו קצת מעמיקות יחסית למלג.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: לראות כמה סרטים, במצטבר שלוש שעות צפייה\n\nהמבחן: אמריקאי עם 27 שאלות, על כל שאלה 4 נקודות, צריך ללמוד טוב את החומר\n\nהשורה התחתונה: קורס קשה יחסית למלג, אבל בלמידה יסודית של כמה ימים לפני המבחן, וסיכום לאורך הסמסטר אפשר להוציא ציון טוב במבחן", "timestamp": 1643363699987}, {"author": "אחד שיודע", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: נורית שטובר\nחוות דעת - הרצאות: נורית אישה חכמה, היא מבינה את הנושא (תתפלאו זו תכונה חשובה למרצה). יש כל מיני נושאים שעוברים עליהם במהירות במהלך הקורס, שווה לעקוב ולהתעכב עליהם אפילו לבד - יכול להיות שיופיעו במבחן\n\nשעורי הבית: צפייה בכמה סרטונים פעם בשבוע - נחמד מאוד למי שאוהב את הנושא.\n\nהמבחן: 27 שאלות אמריקאיות כל שאלה 4 נקודות (סה״כ 108 נקודות)\nמצריך שינון של הנושאים שלמדו, לא בלתי אפשרי לקבל 100. מציע לחפש את השחזור של המבחן שהיה לנו, יכול לעזור מאוד בלמידה למבחן.\n\nהשורה התחתונה: אם אתם אוהבים את הנושא, אני אישית ממליץ לקחת. העשרתי את הידע שלי בנושא שאהבתי מלפני והעליתי את הממוצע על הדרך עם הקורס (שימו לב שהיה חציון 100 בסמסטר שלי (: )", "timestamp": 1644005107573}]}