{"posts": [{"author": "chevichev", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "חוות דעת - הרצאות: \nאוהבת את עצמה מאוד\n\nשעורי הבית: \nאין\n\nהשורה התחתונה: \nקרינג'", "timestamp": 1687451606078}, {"author": "S", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: היא קצת משוגעת אבל בקטע טוב. מדברת כל שיעור על כמה יצירות חדשות ורוב הזמן פשוט מקשיבים למוזיקה והיא מגיבה על כל מיני פרטים. הרצאות יחסית קצרות, שעה וחצי בלי הפסקה לפעמים אפילו קצת פחות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין \n\nשעורי הבית: אין. מדי פעם היא נותנת \"שיעורי בית\" שהם קריאה כלשהי אבל אין שום מעקב על אם עושים את זה או לא וזה לא קריטי למבחן.\n\nהמבחן: אמריקאי, 50 שאלות. כמה שבועות לפני היא שולחת פלייליסט של איזה 15-20 יצירות שצריך להכיר (שזה צמצום משמעותי כי במהלך הסמסטר למדנו הרבה יותר). לא שאלות קשות במיוחד. צריך להקשיב הרבה לפלייליסט ולעשות איזה סשן לימודים של כמה שעות לזכור כל מיני פרטים.\n\nהשורה התחתונה: סבבה.", "timestamp": 1689148513267}, {"author": "תרשמו לעצמכם", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: מקשיבים ליצירות ואורית נותנת הערות עליהם תוך כדי ומרחיבה ונותנת רקע בהמשך השיעור. סך הכל נחמד להגיע להרצאה ולשמוע מוזיקה רוב הזמן, מצד שני אורית אוהבת מאוד לדבר על עצמה ולהכניס מלא פרטים שלא ברור אם הם קשורים. כל משפט שני של אורית זה הרמה לעצמה וכל משפט שלישי זה \"תרשמו לעצמכם\" על משהו לא מובן שהיא אמרה לפני רגע.\n\nשעורי הבית: פורמלית אין, לפעמים אורית מביאה משימות שהיא אומרת שאנחנו \"חייבים\" לעשות (לשמוע יצירה, לקרוא מאמר, לראות Ted Talk). מצד שני אין מעקב וזה לא ממש רלוונטי למבחן אז זה נטו אם בא לך להרחיב.\n\nהמבחן: 50 שאלות אמריקאיות, 19 מהן על חומר כללי שרובו מאוד קל - דברים שחוזרים עליהם עשרות פעמים בשיעורים, וחלקו לא ברור. בשאר השאלות מקשיבים ליצירה, צריכים לזהות אותה ועונים על עוד כמה שאלות די תלושות. אבל אורית מתחשבת בציונים ומפקטרת את השאלות הממש לא ברורות.\n\nהשורה התחתונה: יותר נהניתי ממלג רגיל והיה נחמד ללמוד למבחן. אבל צריך קצת אורך רוח וסבלנות עם אורית.", "timestamp": 1689232210134}, {"author": "Yaniv Slor Futterman", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: נהדרת! קורס מומלץ ברמות. פתח בפיניי עולם שלם. מרתק ומעניין. אומר זה בתור אדם בלי רקע מוזיקלי או הבנה במוזיקה קלאסית לפני כן. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אחלה סך הכל. מבחן אמריקאי עם קטעי האזנה. אם מגיעים לכל השיעורים ומקשיבים אפשר להוציא ציון טוב מאוד, אבל לפעמים עדיין יש כמה שאלות קצת מונפצות. מנגד במבחנים הקודמים היא נתנה פקטור על השאלות שהיו מוזרות וקיבלה יותר מתשובה אחת (ולפעמים את כל האופציות).\n\nהשורה התחתונה:", "timestamp": 1689771901907}]}