{"posts": [{"author": "Adi Haim", "difficultyRank": 1, "generalRank": 5, "semester": "201903", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אמריקאי וקליל\n\nהשורה התחתונה: קורס ממש מעניין וכיף", "timestamp": 1601744854508}, {"author": "copperhead", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: ממש מהנות ומעניינות! דיברנו מלא על טראמפ, פייק נויז, פרסומות וגם איך לוחמה פסיכולוגית ותעלומה התפתחו במהלך ההיסטוריה עד למלחמת המפרץ הראשונה. ההרצאות הכי מעניינות היו על מלחמות העולם.\n\nשעורי הבית: אין שעורי בית - תרקדו\n\nהמבחן: רובו ממוחזר - כדאי מאוד לעבור על כל השאלות משנים קודמות, לסכם את כל הקורס בעצמך ולקרוא סיכומים של אנשים אחרים.\n\nהשורה התחתונה: מל\"ג מומלץ!!!", "timestamp": 1612854866220}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: מעניינות ממש, מרצה מצויין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: יש 2-3 שאלות על נקודות קטנות מההרצאות, קשה להוציא 100.\n\nהשורה התחתונה:  מלג מומלץ", "timestamp": 1616079457200}, {"author": "stln", "difficultyRank": 1, "generalRank": 4, "semester": "202003", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: אחלה מרצה, הרצאות מעניינות\n\nשעורי הבית: אין\n\nהמבחן: מבחן אמריקאי עם 20 שאלות. השאלות די חוזרות על עצמן אבל הוא משלב גם שאלות על נקודות קטנות מההרצאה. 95 אפשרי בקלות אבל לא פשוט להוציא 100\n\nהשורה התחתונה: למצוא סיכום טוב של ההרצאות ולתרגל שאלות משנים קודמות, יש מאגר בקבוצת פייסבוק של הקורס. סה\"כ קורס מומלץ", "timestamp": 1633642407762}, {"author": "קורט רין", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: \nהמרצה כביכול דוקטור להיסטוריה, אבל הוא לא מדייק בפרטים באופן ניכר, ושולף לא מעט מהמותן. הוא מתלהב מהנושא שלו, אך לא מגלה יחס נאות לתלמידים.\n\nהמבחן:  מבחן אמריקאי, 20 שאלות. הוא הוסיף שבוע לפני הבחינה כמה מאמרים לקריאה חופשית. בסוף היו 5 שאלות במבחן עליהם.\n\nהשורה התחתונה: מרצה לא טוב במיוחד, מאוד פופוליסטי, הקורס נחמד אם אתם רוצים לבוא לראות הצגה שנמשכת שעה וחצי. הממוצע בקורס ירד ביותר מ7 נקודות בסמסטר האחרון.", "timestamp": 1644147548397}, {"author": "nobody", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות: \nמאוד מעניינות. אם מישהו לוקח  מל\"ג בשביל העניין, זה הקורס לקחת. הוא מראה את הלוחמה הפסיכולוגית לאורך ההיסטוריה  עם מלא דוגמאות וגם שולף מקרים מאקטואליה רלוונטית.\n\nשעורי הבית:\nאין :-)\n\nהמבחן:  \nטריקי, לשים דגש חזק על קטעי הקריאה, זה יכול להבדיל בין 95-100 לבין 80-85. אבל, יום של למידה עם מבחני עבר, וחצי יום לסכם את המאמרים שהוא מפרסם (בערך באמצע הסמסטר) יותר ממספיק.\n\nהשורה התחתונה: \nעל אף הממוצע הנמוך ׁ(מאוד) הסמסטר, דווקא נהנתי מהחומר, ואפשרי לגמרי להוציא ציון גבוה אם משקיעים עוד קצת בקטעי קריאה.", "timestamp": 1644269167715}, {"author": "anonimi", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: לויתן\nחוות דעת - הרצאות: לרוב מעניינות, אבל מצפה שתדע כל מילה שהוא שואל\n\nשעורי הבית: 5 מאמרים שהוא מבקש לקרוא לפני מבחן\n\nהמבחן: מבחנים אמריקאים עם ממוצעים נמוכים למל\"ג, השאלות שמצפות שתדע בעל פה ברמת הפרטים. הרגשתי שזה שאלות מבחן בהיסטוריה מאשר על חומר לוחמה פסיכולוגית\n\nהשורה התחתונה: לא לקחת אם אכפת לכם מהממוצע, המרצה מגזים בדרישות ומצפה שנדע את הקורס ברמת הפרטים הקטנים והרבה לשנן. (כל סיכום שתמצאו מגיע ל20 עמודים לא כולל המאמרים שלו), שכח שזה קורס העשרה.\nפעם היה מומלץ עכשיו כבר לא. הציון הכי נמוך שלי בסמסטר זה המל\"ג הזה. לברוח", "timestamp": 1646601386955}, {"author": "rami", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "מקורס מעלה ממוצע לקורס שמוריד ממוצע", "timestamp": 1646602071163}, {"author": "WW2", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: יניב\nחוות דעת - הרצאות: מענינות ומרשימות \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: יניב הקשה עלינו הסמסטר , דפק לנו מבחן לא פשוט מבוסס על מאמרים שפירסם ושאלות חדשות שלא היו במבחנים קודמים .\nהפך אותו מקורס עם ממוצע 95 ל 82\n\nהשורה התחתונה: לא יודע אם זה לפי מצב רוח של המרצה או משהו אחר אבל באמת באמת הקשה עלינו הסמסטר הזה.", "timestamp": 1648808978196}, {"author": "ללא שם", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יניב לויתן\nחוות דעת - הרצאות:  ממש מעניינות, יניב מעביר את החומר בצורה סוחפת ומעניינת, מכניס דוגמאות מעכשיו להמחשת הנושאים.\n\nשעורי הבית: אין\n\nהמבחן: אמריקאי, מי שהקשיב בהרצאות וקרא סיכומים לגמרי יכול להצליח.\n\nהשורה התחתונה: מומלץ מאוד. אבל יכול להיות שלא יפתח בסמסטר הבא.", "timestamp": 1676039466267}]}