{"posts": [{"author": "אור טבק", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס תובעני ביחס להומני ובהחלט מעלה את סף הלחץ", "timestamp": 1603273374942}, {"author": "אביה", "difficultyRank": 2, "generalRank": 2, "semester": "201501", "text": "שם המרצה: דליה פלד\nחוות דעת - הרצאות: חובת נוכחות אי אפשר להבריז בכלל (מקריאה שמות כל שיעור) \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל הרצאה צריך להכין סיכום ולהגיש\n\nהמבחן: לכתוב סיפור אישי\n\nהשורה התחתונה: מלג לא מומלץ בכלל. בניגוד לשמו לא עוזר להתמודד עם מצבי לחץ ולא תורם כלום.", "timestamp": 1604226194144}, {"author": "ממליץ מלגים", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דליה פלד\nחוות דעת - הרצאות: תגיעו, ותוך זמן קצר תבינו שזה לא קורס מלג שבו ניתן להכין שיעורי בית או לחזור על החומר תוך כדי ההרצאה. ההרצאות מאוד פעילות, לי אישית זה הפריע מאוד. נוכחות חובה אך היא בסופו של דבר (לפחות אצלינו) 50% מהציון הסופי שלכם, כל הרצאה מקבלים משימות להגשה שמבצעים תוך כדי ההרצאה ולכן אין מה כל כך לדאוג מזה.\n\nשם המתרגל/ת: טל כספני\nחוות דעת - תרגולים: לא רלוונטי כל כך לקורס, בעיקר עזר לדליה להתנהל עם המערכת זום ולנהל את הדברים הטכניים כמו שיעורי בית וכאלו. אישית חושב שזה בזבוז של כסף מצד הטכניון ומתרגל בקורס הזה מיותר כי בפועל הבעיות בהרצאות לא פסקו וגם במבחן המקוון דליה לא ידעה איך להתנהל וכל דבר אמרה \"אתקשר למשרד של הוראה\".\n\nשעורי הבית: השיעורי בית מבוצעים תוך כדי ההרצאות.\n\nהמבחן: מבחן ממוחזר בעיקר, שאלות שהתשובות רשומות בתוך חוברת הקורס מ-מ-ש והחומר פתוח, תדפיסו או תשתמשו באופן דיגטלי (אם יאשרו, אצלינו לא אישרו) ובזמן של הבחינה ניתן למצוא את כל התשובות בחוברת הקורס ללא צורך להבין כל כך בחומר.\n\nהשורה התחתונה: מלג מומלץ ביותר, חוץ מהפעילות המוגזמת במהלך ההרצאות אין לכם מה לדאוג! תתפשו אותו כמה שיותר מוקדם ותקבלו ציון 95+ בקלות!", "timestamp": 1612292785398}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דליה\nחוות דעת - הרצאות: יש נוכחות חובה ולא ממש אפשרי לעשות משהו תוך כדי כי חובה להפעיל מצלמות (בזום) וגם יש בכל הרצאה פעילות בזוגות של כמה דקות שעונים על איזו שהיא שאלה שהיא נותנת זה בדרך כלל לא משהו כבד מדיי לוקח כמה דקות ומסיימים עם זה וההרצאה ממשיכה. זה המטלות להגשה אבל לא נראה שבודקים את זה יותר מדיי זה בעיקר בשביל הפעילות. סך הכל ההרצאות בחלקן מעניינות ונחמדות, מדברות על כל מיני תיאוריות של לחץ וסוגי אנשים ותגובות ללחץ. אני נהנתי מההרצאות ומבחינת השקעה בסמסטר זה רק להגיע להרצאה.\n\nשעורי הבית: \nאין, יש מטלות קצרות שעושים בזמן ההרצאה ומגישים בסוף.\nהמבחן: המבחן די ממוחזר משאלות עבר וגם יש חומר פתוח ככה שלא ממש קשה למצוא את התשובות בסיכום. סה\"כ די פשוט לקבל מעל 95.\n\nהשורה התחתונה: מל\"ג ממש מומלץ בעיני, לא הרבה השקעה ציונים טובים ואותי גם אפילו די עניין.", "timestamp": 1615197565371}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דליה\nחוות דעת - הרצאות: מתחיל במדיטציה קצרה כל פעם. אותי אישית רק הרגיז. החומר מועבר בצורה די שטחית אך מפוזרת. ההרצאות מאוד פעילות: תרגילים בזוגות, ושאילת שאלות. לרוב מאוד לא נעים לענות על השאלות שלה מול כולם והיא לא פעם מעמידה את מי שמשתתף בפני שאלות לא נעימות (\"האם ההרגשה/הסיטואציה נובעת מהפחד להיות לבד?\" או \"האם זה שפחות שיתפת בקשר הזוגי, לדעתך, השפיע על הזוגיות?\" וכו').\n\nשם המתרגל/ת:  שון\nחוות דעת - תרגולים: אין תרגולים, התפקיד שלו הוא לעזור לדליה להעביר את השיעור דרך הזום. די מיותר.\n\nשעורי הבית: המטלות ניתנות תוך כדי השיעור.\n\nהמבחן: ממוחזר\n\nהשורה התחתונה: לא כל דבר שווה 100.", "timestamp": 1624856387027}, {"author": "~", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דליה\nחוות דעת - הרצאות: נוכחות חובה. המתרגל בודק נוכחות בזום (לפחות כך היה בסמסטר האחרון) בתחילת השיעור כמה דקות \"מדיציה\" או \"הרפיה\" או איזה חירטוט כלשהו. לא מתחבר לזה. אחרכך מחלקת לזוגות נותנת 10-15 דקות לכתוב על מקרה לחץ שקרה בשבוע האחרון ולנתח אותו, או לחפש בynet מקרה לחץ, או לחפש בקונפשיינס, משימה פשוטה לחלוטין, מרגיש כאילו היא ממציאה את המשימות על המקום. אחרכך חוזרים לשיעור והיא מלמדת למשך השעה שנותרה. החומר מאוד משעמם לדעתי. לפעמים היא מבקשת לכתוב משהו \"מ 1-100 אם אשתך תמות כמה לחץ תרגיש?\" ואם יש סטודנטים עם שאלות קיטבג בכיתה \"צריך להגיש את זה?\" אז היא פתאום תחליט שכן, ולכן מומלץ להיות עם חצי אוזן על ההרצאה, למרות שלרוב אפשר לא להקשיב בכלל.\n\nשם המתרגל/ת: שון\nחוות דעת - תרגולים: בחור מיותר לתפקיד מיותר. בעיקר רשם נוכחות.\n\nשעורי הבית:  בתחילת כל שיעור יושבים 10-15 דקות לכתוב את השיעורים ולכן מסיימים הכל במהלך השיעור ואין צורך להשקיע מעבר לשעה וחצי השבועיות של השיעור במערכת.\n\nהמבחן: יחסית פשוט. צריך איזה יומיים לחזור על החומר. בקבוצה בפייסבוק יש קובץ עם 200 שאלות שסטודנטים כתבו, עוזר להתכונן. בשיעור האחרון היא הביאה 3-4 שאלות מהמבחן עצמו. הציון נקבע 50-50 שיעורי בית-מבחן.\nהמבחן עם חומר פתוח - חוץ מחוברת הקורס שבמודל.\n\nהשורה התחתונה: קורס יחסית פשוט. משעמם, לא דורש השקעה.", "timestamp": 1626176890828}, {"author": "מבואסניון", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דליה\nחוות דעת - הרצאות: מועבר בצורה מעניינת עם תרגילי שחרור לחץ אקסטרה שיכולים לעזור\n\nשעורי הבית: אין, יש 2 הגשות שעונים עליהם תוך כדי השיעור\n\nהמבחן: אמריקאי, מומלץ לעבור טוב על החומר והערות המרצה לפני כי יש שאלות שנוגעות בנושאים שאין בסיכום\\שקפים\n\nהשורה התחתונה: מומלץ", "timestamp": 1657809659587}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל שיעור כותבים עונים על תרגילים שהמרצה נותנת.\n\nהמבחן: \n\nהשורה התחתונה: מל״ג לא מומלץ בכלל ומשעמם, בכל שיעור צריכים להגיש הגשות, והמבחן לא דווקא משוחזר ומלא בשאלות נכון/לא נכון מבלבלות.", "timestamp": 1677511774925}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דליה פלד\nחוות דעת - הרצאות:  הרצאות מעניינות! האווירה כיפית בכיתה, יש תרגיל נשימות בתחילת כל הרצאה - חובה, שבעיניי היה ממש עוזר, יש מלא שיתוף פעולה וצחוקים. צריכים למצוא שותף קבוע לעבודה תוך כדי השיעור ולהגשה משותפת.\n\n\nחוות דעת - תרגולים:  אין\n\nשעורי הבית:  פותרים שאלות תוך כדי השיעור ומגישים אותם עם שותף\n\nהמבחן: אמריקאי 50% מהציון הסופי לא קשה מדי וגם לא קל (צריך להתכונן אליו ולדעת כמה דברים בעל פה) \n\nהשורה התחתונה: מל\"ג מומלץ וגם עוזר לסטודנטים שמרגישים שלחץ מאוד משפיע עליהם", "timestamp": 1689675088949}, {"author": "האנס סילייה", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דליה פלד\nחוות דעת - הרצאות: דליה נחמדה ממש אבל ההרצאות די מבולגנות ולא ממש לומדים משהו, אוסף מונחים רנדומלים, בהתחלה נראה מעניין וכיף ומהר מאוד הופך למשעמם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין - מגישים מה שעושים בכיתה.\n\nהמבחן: אמריקאי, תכלס לוקחים את השאלות הכי מבלבלות ולא ברורות ושמים במבחן\n\nהשורה התחתונה: ניתן להוציא מאה אבל אישית היה משעמם.", "timestamp": 1712591638271}]}