{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אמה מעיין\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: הייתה עבודה להגשה. מרגיש שהיא נותנת ציונים בהטלת מטבע. אין קשר בין מה שכתבתי בעבודה לבין ההערות שלה והציון.\n\nהשורה התחתונה: לא מומלץ בכלל בגלל התנהלות המרצה והבדיקה הביזיונית.", "timestamp": 1616409751365}, {"author": "tay", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניין קצת ולמרצה יש ידע עמוק, הבעיה שבמצגות אין חומר רק תמונות אז אין איך לחזור על החומר חוץ מההקלטות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: הייתה עבודה להגשה, יש אלה שקיבלו ציון טוב אבל יש אלה שלא, העבודה הייתה בשבוע אחרון בססמסטר והיה עומס, בהתחלה התכנון היה לעשות מבחן אבל בגלל הקורונה הציעה לעשות עבודה ולצערי הרוב הסקים, לא סיכמנו כלום במהלך הסמסטר כי לא ידענו שתהיה עבודה ולכן היה ממש קשה וארוך, לא ממליץ בכלל אם היה עבודה במקום מבחן\n\nהמבחן: היה אמור להתקיים אבל לצערי הרוב הצביע לעבודה \n\nהשורה התחתונה: לא ממליץ, היא נותנת ציונים טובים וגרועים רק לשמור על אותו ממוצע", "timestamp": 1645095375498}, {"author": "דגרוטייפ", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אמה מעיין\nחוות דעת - הרצאות: למרצה יש המון ידע בתחום. מי שמתחבר לצילום יכול למצוא עניין בהרצאות הראשונות שמדברות על איך התחיל כל עידן הצילום ואיך נוצרו התמונות הראשונות, אחר כך העניין דועך אז אני ממליצה לסכם תוך כדי השיעור כדי לא לבהות בשעון\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: לא היה, הייתה לנו עבודה במקום.\n\nהשורה התחתונה: אני השקעתי בערך חצי יום בכתיבת העבודה וזה השתלם לי מי שלא השקיע לא קיבל ציון טוב, אז לא לזלזל בעבודה.", "timestamp": 1645362234623}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אמה מעיין\nחוות דעת - הרצאות: הועבר בזום וגם פרונטלי, נוכחות ע\"י רישום במודל אבל לא חושב שמישהו מסתכל על זה בכלל. הרצאות לפעמים משעממות, הייתי בחצי קשב.\n\nשעורי הבית: אין\n\nהמבחן: קיבלנו עבודת בית שישבתי עליה בערך יום וחצי וציון יפה.\n\nהשורה התחתונה: אין צורך להשקיע בכלל במהלך הסמסטר אלא רק בעבודה להשקיע ולהוציא ציון טוב. עם זאת העבודה מגיעה בשבוע האחרון לסמסטר זו תקופה לחוצה ולכן ממליץ לפחות לדעת על מה היא מדברת בהרצאות.", "timestamp": 1647540139439}]}