{"posts": [{"author": "שם", "difficultyRank": 1, "generalRank": 4, "semester": "201901", "text": "חוות דעת - הרצאות: ההרצאות ממש נחמדות, לא שיא העיניין ולא משעמם מידי, לרוב שומעים מוזיקה או עובדות נחמדות, הוא מתחיל כל הרצאה בשאלה על משהו שהיה שבוע לפני (לא כמבחן או משהו)\n\nהמבחן:  לא קשה, כן כדי לעבור על הסיכום שיש בפייסבוק או לעקוב ולרשום אנקדוטות במהלך ההרצאות, לדעתי יש גם מבחן לדוגמא בפייסבוק שחצי מהמבחן שלנו שוחזר ממנו\n\nהשורה התחתונה: \nקורס מרענן וכיפי באופן כללי, צריך במהלך הסמסטר להציג שיר (להשמיע מיוטיוב שיר שבוחרים אבל גם לדבר על למה דווקא השיר הזה ומה המשמעות שלו בשבילך) שזה מאוד פשוט ובשיעור האחרון בקבוצות של 3 ומעלה מציגים קטע מוזיקלי כלשהו (לא חייב להיות מוזיקליים בשביל זה, היו קבוצות שהקריאו ובמעברים אחד מהם ניגן), כן אומר שצריך להתאמן פעם פעמיים לפני\nבעיניי זה קורס חוויתי ונחמד ביותר", "timestamp": 1600857085133}, {"author": "Yazan Naser", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: נושאים סופר מעניינים, כדאי ללכת להרצאות ולהנות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: קל מאוד רובו מחוזר\n\nהשורה התחתונה: קורס כיף מאוד מל\"ג הכי מומלץ", "timestamp": 1612294570830}, {"author": "Arex 36", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: מעניין וכיף\n\nהמבחן: קל וממוחזר\n\nהשורה התחתונה: יש הרבה תוכן העשרה ויצירה", "timestamp": 1612349514082}, {"author": "zayna", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: כהן דן\nחוות דעת - הרצאות: ממש כיף\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן:קל וממוחזר  \n\nהשורה התחתונה: מומלץץץץץץץץ !!!!!!!!!!!!!!!!!!!!!!!!!!", "timestamp": 1614190918486}, {"author": "נלי קוגן", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: כיף ומומלץ! גם חומר מעניין וגם הרצאות ממש טובות, לא בהכרח חייבים רקע מוזיקלי אבל למי שיש זה בונוס. \nהמבחן ברובו ממוחזר, גם לא כזה מסובך. \nהשורה התחתונה: ממש מומלץ!", "timestamp": 1617110038366}, {"author": "Sujud abu atta", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: הוא מהמם \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש הצגת קטע שאנחנו אוהבים ביחידים, ובסוף הצגות קבוציות. שתי מטלות היו נחמדות ולא דרשו המון עבודה \n\nהמבחן: משוחזר לגמרי. יש בקבוצת הפייסבוק כל השאלות\n\nהשורה התחתונה: קורס כיפי וקל להוציא בו ציונים", "timestamp": 1618774723552}, {"author": "נהך נד", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: \nהחומר עצמו חביב, לא משהו משנה תודעה.\nמה שבאמת נחמד בהרצאות לדעתי זה ההצגות של הקטעים של הסטודנטים בסוף כל הרצאה. מעין הצצה קטנה לעולמות האישיים של הסטודנטים האחרים.\n\nשעורי הבית: \nשתי מטלות- הצגה אישית, הצגה קבוצתית. פורט על המבנה שלהן מספיק בחוות דעת האחרות.\nלדעתי שתיהן היו כיפיות ומפתחות - הן הסיבה העיקרית שאני ממליץ על הקורס הזה.\nהמבחן: \nאמריקאי ממוחזר קליל\nהשורה התחתונה: \nמלג מומלץ מאוד אם באים בגישה של להינות ממה שיש לו להציע.", "timestamp": 1647705799969}, {"author": "כ", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: הרצאות די מעניינות גם למי שלא הכי מתעניין במוזיקה, דן בכללי בן אדם נהדר והשיעורים די מהנים. \n\nצריך לעשות שתי מטלות, לדבר על קטע מוזיקלי שאתם מחוברים אליו מתישהו במהלך הסמסטר, ולקראת סוף הסמסטר הצגה קבוצתית של קטע מוזיקלי. גם זה תכלס כיף ולא דורש הרבה יותר מדי השקעה.\n\nהמבחן: לא סתם זה קורס עם ממוצע 99 וחציון 100. ממוחזר כמעט ב100%, תעברו על מבחני עבר וקצת על המצגות באתר וזה מספיק.\n\nהשורה התחתונה: מלג סופר מומלץ", "timestamp": 1675162413235}, {"author": "קאנון הסרטן", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: מדי פעם בודק נוכחות. מעביר בצורה מעניינת ממש למרות שהמצגות ממוחזרות כבר הרבה שנים. גורם להשתתפות פעילה עם דוגמאות, השמעה של מוזיקה ונגינה תוך כדי. מי שאוהב מוזיקה ייהנה (גם לא מוזיקאים). \n\nשעורי הבית: יש שתי מטלות בקורס. הראשונה זה להציג שיר שמתחברים אליו, וכל שיעור יש 5 שמציגים. זה גם מוסיף עניין לשיעורים. השנייה זה להופיע בקבוצה עם קטע מוזיקלי בשיעור לפני האחרון של הסמסטר. דורש קצת השקעה אבל זה כיף ומי שלא זרק בהגזמה מקבל 100.\n\nהמבחן:  אמריקאי ממוחזר לגמרי. יש בקבוצת פייסבוק את כל התשובות\n\nהשורה התחתונה: לקחת", "timestamp": 1675272713119}, {"author": "no", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: dan\nחוות דעת - הרצאות: The best prof ever!\n\nשם המתרגל/ת: no\nחוות דעת - תרגולים: no\n\nשעורי הבית: no\n\nהמבחן: simple\n\nהשורה התחתונה: If you can take it, take it", "timestamp": 1679306005599}, {"author": "Michelle", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דן\nחוות דעת - הרצאות: מעניין דווקא\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: מושלם ממוחזר\n\nהשורה התחתונה: הציון הכי טוב שלי בתואר", "timestamp": 1713193890122}]}