{"posts": [{"author": "ferberonix", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אילה גוטליב קינג\nחוות דעת - הרצאות: \nאילה מרצה טובה. ההרצאות מעניינות ומסבירות את התפקיד של המוזיאונים בעולם המודרני בהקשר היסטורי, חברתי וטכנולוגי. היתרון הגדול ביותר בקורס הוא שישנם 3 סיורים במוזיאוני חיפה, חלקם מעולים וחלקם פחות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: \nעבודת הגשה באורך של 1300 מילים ליחיד ו-2000 לזוג. היא בסיסית ביותר ובעיקר משקפת את החוויות שלכם מהקורס. היא לא דורשת יותר מ-12 שעות עבודה (למי שרוצה לקבל 100).\n\nהשורה התחתונה: קורס מאוד חוויתי, מלמד, לא עמוס בכלל. מומלץ ביותר!", "timestamp": 1647368521933}, {"author": "מבין עניין", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: איילה קינג\nחוות דעת - הרצאות: \nמרצה מאוד נחמדה ומצחיקה, ההרצאות בעיקר מתרכזות בשאלות פילוסופיות בנושאי אומנות ומוזיאונים, לא חובה להשתתף (ואפשר פשוט לשבת מאחור בשקט עם המחשב) אבל דווקא היו דיונים מעניינים.\n\nשעורי הבית: \nאין\n\nהמבחן: \nאין מבחן, יש עבודת סיום קורס שצריכה להיות באורך 1500-1300 מילים, לקחה לי 5 שעות וקיבלתי 100.\n(יש אוטונומיות מוחלטת בבחירת נושא העבודה, כל עוד מקשרים אותה לשאלות הפילוסופיות שהועלו בקורס). \n\nהשורה התחתונה:\nמלג מומלץ מאוד, יש נוכחות חובה אבל בדיעבד איילה בדקה נוכחות רק 3 פעמים במהלך הסמסטר, בתחילת הסמסטר, בסיור הראשון, ובפעם שהגיעו להרצאה 9 סטודנטים (מתוך 40) ולכן אני מניח שמי שקיבל פחות מ-100 בקורס לא היה נוכח בבדיקות הנוכחות.", "timestamp": 1658125426310}, {"author": "אופק גינת", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אילה\nחוות דעת - הרצאות: לרוב מעניינות מאוד, אילה אישה מקסימה וידענית גדולה בתחומה. יש 3 סיורים למוזיאונים בחיפה על חשבון ההרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: לבחור נושא מהקורס ולכתוב עליו 1500 מילה\n\nהמבחן: אין\n\nהשורה התחתונה: המל\"ג הכי מומלץ ניצח את כולם בפער", "timestamp": 1675348806494}, {"author": "king", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אילה קינג\nחוות דעת - הרצאות: אילה מקסימה וההרצאות נחמדות. חלק מהן מנוהלות בצורה של דיון בכיתה וחלק יותר בצורה של מצגת. יש שלושה סיורים במוזיאונים ומי שמגיע לכולם יכול לקבל מנוי למוזיאוני חיפה לשנה.\n\nשעורי הבית: אין.\n\nהמבחן: אין מבחן. צריך לכתוב עבודת גמר של 1500 מילים על איזה נושא שרוצים שקשור לקורס.\n\nהשורה התחתונה: מלג ממש מומלץ.", "timestamp": 1678621499012}]}