{"posts": [{"author": "barnum effect", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אפרי בן נדב\nחוות דעת - הרצאות: מעניינות מאוד!!, אפרי מרצה מעולה,מעביר את החומר בצורה נחמדה ומעניינת, משלב סיפורים וחוויות שלו מעבודתו,מאוד נהניתי מלהיות בהרצאות(למרות שהנוכחות לא חובה אך ממולץ להגיע-גם בשביל המבחן)\n\nשם המתרגל/ת:אין \nחוות דעת - תרגולים: \n\nשעורי הבית: היו שתי מטלות תקפות עם ציון עובר, לא קשות בכללויכחו לכל היותר שעה~שעתיים(אם ממש מתעמקים )\n\nהמבחן: הוגן מאוד, הייתה שאלה לגבי וידאו שראינו בהרצאה(שדווקא ביום הזה לא נכחתי :( )אז כדאי לבוא..\nהשורה התחתונה: ממליצה בחום לכל אוהבי הפסיכולוגיה, צריך ללכת להרצאות או לקרוא סיכום טוב ,אך חבל לפספס שיעור מעניין כזה ;)", "timestamp": 1675436168084}, {"author": "Tian Han Shen", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אפרי בן נדב\nחוות דעת - הרצאות: \nהרצאה מעניינת למי שמעניין התחום פסיכולוגיה , הרבה מהתוכן של קורס מועבר דרך מה שהועבר בהרצאה ולא נמצאים במצגת.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 4 מטלות כתיבה , צריך לבחור לעשות 2 מהם\nכל אחד מהם באורך דף A4 .\n\nהמבחן: אם היית בהרצאות והקשבת תסתדר\n\nהשורה התחתונה:", "timestamp": 1675443506256}, {"author": "פרויד", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אפרי בר נדב\nחוות דעת - הרצאות:  אפרי אדם מרתק, יודע להעביר את החומר בצורה מעניינת, משתף במקרים מהעולם המקצועי שלו והחוויות האישיות שלו. מל\"ג מומלץ מאוד למי שמתחבר לתחום הפסיכולוגיה ובכללי למי שרוצה להרחיב את האופקים חוץ מהנדסה. אחד המלגים שהכי נהנתי בהם. כל הרצאה ריתקה אותי מחדש.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 2 הגשות עם ציון בינארי, לכתוב חצי עמוד על תופעה פסיכולוגית / ניתוח שיר וכו'. 30% מהציון עם ציון 100.\n\nהמבחן: הוגן מאוד. אם מקשיבים בשיעורים ומסכמים, כל החומר נמצא . 33 שאלות, המבחן פתיר מאוד רק חבל שחומר סגור\n\nהשורה התחתונה: \nמלג מומלץ מאוד מאוד! נהנתי מכל רגע!", "timestamp": 1675617703389}, {"author": "פסיכואנליסט", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה:  אפרי בר לב\nחוות דעת - הרצאות:  אין נוכחות חובה, אך ממש מומלץ להגיע על מנת להצליח במבחן. אפרי מעביר את ההרצאות בצורה מאד מעניינת, לא נראה שחשוב לו יותר מידי להיצמד לחומר ויותר מעוניין להעביר את החומר בצורה הכי מעניינת שניתן. עונה על המון שאלות ומפרט הרבה מהניסיון שלו בתחום. \n\nשעורי הבית: 2 מטלות הגשה של סיכום של נושא מסוים שלמדנו עליו או ניתוח של שיר כלשהו באורך של עד עמוד לכל מטלה - לא דורש יותר מידי. אולי שעה לכל מטלה ומביא 30% תקף על 100 לכל מי שהגיש - ככה שממש שווה.\n\nהמבחן: מבחן אמריקאי של כ-30 שאלות בסגנון מה המשפט הנכון, מה המשפט הלא נכון, או כל התשובות נכונות וכו'...\nהמבחן לא היה קל כי הוא הועבר פעם ראשונה ולא היו הרבה שאלות לתרגל מהן אבל עם סיכום טוב ולמידה של בערך יום - יום וחצי אפשר להוציא 90+. \n\nהשורה התחתונה: נותן סריקה טובה על עולם הפסיכולוגיה והגישות הנפוצות בו. מל\"ג מומלץ לטעמי אבל רק למי שבאמת מתעניין, לא 100 קל אבל בהחלט אפשר להוציא ציון גבוה עם נוכחות בהרצאות.", "timestamp": 1676295008132}, {"author": "דני", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אפרי בר נדב\nחוות דעת - הרצאות: \nמרצה מאוד טוב! מעביר את החומר בצורה מאוד מעניינת. לצערי נאלצתי לפספס הרבה שיעורים וזה היה מבאס כי באמת שיעורים טובים למי שמעוניין בתחום.\nמומלץ להגיע, מקל מאוד בלמידה למבחן. בכל מקרה, ללא נוכחות חובה.\n\nשעורי הבית: \n 2 הגשות לבחירה מתוך כ-4 תרגילים, כתיבה עד עמוד - 30%מהציון. מקבלים ציון בינארי ואפרי נותן משוב אישי מאוד נחמד.\n\nהמבחן: \nמבחן אמריקאי, חומר סגור. הוגן מאוד. אם לומדים מסיכום טוב ונוכחים בהרצאות לגמרי אפשר לקבל מעל 90.\n\nהשורה התחתונה: ממש מומלץ, במיוחד למי שמתעניין ויכול להגיע..", "timestamp": 1677091606558}, {"author": "Tian Han Shen", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ד\"ר א פרי בר נדב\nחוות דעת - הרצאות: \nהרצאות מאוד מעניינות למי שמעוניין בפסיכולוגיה , רוב המלל מועבר בעל פה , ולא מצגות שהוצגו בכיתה.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nבוחרים 2 מתוך 4 מטלות האפשריות , דף A4 כל אחד מהם . \nהמבחן: \nבעיקר דברים שדיברנו בהרצאות , מי שהיה בכל הרצאות והקשיב קיבל ציון טוב\nהשורה התחתונה: קורס מלג סבבה", "timestamp": 1677684481444}, {"author": "ברקופליץ", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: \nאפרי בר נדב\nחוות דעת - הרצאות: \nהרצאות ממש אחלה. אין חובה נוכחות. אפרי עשה סקירה על הזרמים השונים בפסיכולוגיה ודיבר על כל אחד מהם מספר הרצאות. ההרצאות היו ברמה גבוהה ולמדנו הרבה. אפרי ניהל את ההרצאה באופן מאוד פתוח והסית את ההרצאה הרבה פעמים לסגנון של שאלות ותשובות ולפעמים השאיר בסגנון של הרצאה שבה הוא מדבר עם מצגת.\n\nשעורי הבית: \nהיה 2 מטלות כתיבה, שהיו שוות 30% מהציון. לסכם שיר או לכתוב משהו שקשור לשיעור. היה צריך להגיש בין חצי עמוד לעמוד שלם וכל מי שהגיש קיבל 100. משימה ממש קלילה שלוקחת חצי שעה בערך, בקיצור 30 נקודות מתנה.\n\nהמבחן: \nאמריקאי עם 33 שאלות. השאלות היו שאלות ידע על דברים ספציפים שדיברנו בהרצאות, לא היו הרבה שאלות טריק או שאלות עם ניסוח מוזר. אפרי שאל על דברים די ספציפים שהוא דיבר עליהם ככה שבלי לבוא להרצאות אני לא רואה איך אפשר להוציא ציון טוב. מי שכן היה, במיוחד עם סיכום טוב, יכול להוציא 90 פלוס לדעתי די בסבבה.\n\nהשורה התחתונה: \nמל\"ג שהיה אשכרה מעניין עם מרצה טוב ולמדנו בו על פסיכולוגיה די לעומק יחסית למה שהייתי מצפה. אין עומס במהלך הסמסטר בכלל והמבחן ממש סבבה למי שהגיע להרצאות. \nבקיצור, מל\"ג ממולץ.", "timestamp": 1679326168056}, {"author": "A", "difficultyRank": 1, "generalRank": 4, "semester": "202203", "text": "שם המרצה: אפרי\nחוות דעת - הרצאות: \nהרצאות מעניינות! אבל די ארוכות וזה יכול להתיש...\nקחו בחשבון שהמצגות ממש לא מעודכנות ולא מכילות את כל המידע, ואין סיכומים טובים למרות שזה נראה כאילו יש (בכל סמסטר הוא מלמד חומר שונה אז אל תסתמכו על סיכומים משנים קודמות), והמבחן הוא אך ורק על החומר שנאמר בע\"פ בזמן השיעור, גם אם זה רק נאמר בכמה משפטים וזהו, בקיצור תביאו איתכם אייפד או לפטופ ותסכמו כל מילה\n\nתרגולים: אין\n\nשעורי הבית: ממש קלים, לכתוב איזה חצי עמוד על נושא שדיברנו עליו בשיעור. צריך לבחור שני נושאים מתוך ארבעה אפשריים. והציון שלהם בינארי רק צריך להראות שהשתדלתם.\n\nהמבחן: \nמבחן אמריקאי של 20 שאלות, 5 נק' לשאלה, ואין פקטור. המבחן בהחלט מאתגר, יש בו כל מיני ניואנסים קטנטנים שנאמרו בשיעור ותשובות שנראות ממש דומות זו לזו, בגלל זה ממש חשוב להקשיב בהרצאות ושיהיו לכם סיכומים עדכניים ומדויקים אחרת זה לא יילך. רק רבע מהסטודנטים קיבלו 90+. אתם יכולים לקבל ציון גבוה במל\"ג הזה אבל רק אם תדעו את החומר. \n\nהשורה התחתונה: \nלדעתי אי אפשר לומר שזה מל\"ג קל. אני נהניתי מהקורס כי פסיכולוגיה באמת מעניין אותי.", "timestamp": 1700731533870}, {"author": "גישה קוגניטיבית^_^", "difficultyRank": 4, "generalRank": 3, "semester": "202203", "text": "שם המרצה: אפרי\nחוות דעת - הרצאות: מעניינות מאוד, אך בגלל שזה קיץ, היו כפולות, לפעמים היה משעמם קצת, ועמוסות. מסביר המון המון מידע פעל פה שלא נמצא במצגות , ובוחן עליו במבחן. צריך להקשיב טוב ולכתוב. מביא הרבה דוגמאות מהמציאות ומהקלינקה מה שעושה את השיעור מעניין..אין נוכחות חובה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: \n2 מטלות לבחור מתוך 4, קלילות ולא דורשות השקעה\nהמבחן: ממוצע נמוך ב 10 נק׳ מחורף , בוחן על חומר שנאמר פעל פה בהרצאה,צריכים להקשיב, אישית ראיתי שהקורס עמוס , הוא כמעט מלמד חומר קורס מבוא של 5 יח׳ בקורס הזה ( מה שהתברר מסיכומים מאוניברסיטת חיפה), אישית ראיתי שזה לא קל, צריך השקעה ולעקוב.\nהשורה התחתונה:", "timestamp": 1703601183064}, {"author": "ראור", "difficultyRank": 1, "generalRank": 4, "semester": "202203", "text": "שם המרצה: אופרי נדב\nחוות דעת - הרצאות: \nהרצאות מעניינות, עוברים על כל מיני גישות שונות לפסיכולוגיה. לפעמים מרגיש שהכל דומה ואפשר ללכד לאיבוד אבל אם חוזרים קצת על החומר זה עוזר. איבדנו הרצאה עקב סיבות אישיות של המרצה ולא התקיימה הרצאת השלמה אז לא יכולנו להיכנס לעומק לכל הגישות - כמעט חצי מהקורס עסק באחת מתוך שבע.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש 4 אפשריות, צריך לבחור שניים. פחות מעמוד 1 לכל הגשה. מקבלים 100 אם מגישים משהו ולא מזלזלים. אפשר לסיים את שניהן בשעה. מהוות 30% תקף. היה לנו ניתוח חלום (שלך או של דמות מסרט וכו), ניתוח שיר, או לכתוב על שני נושאים שלמדנו.\n\nהמבחן: מועד א היה מאוד דומה לקובץ שאלות שפורסם ע\"י סטודנטים. במועד ב הוא לא טרח לכתוב מבחן מחדש, היה בדיוק אותו מבחן כמו מועד א. לוקח יום של קריאת סיכומים אם יש לכם זיכרון טוב או שניים אחרת.\n\nהשורה התחתונה: נק\"ז חינם בקיץ.", "timestamp": 1705430000617}]}