{"posts": [{"author": "סוקרטס96", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  אילה קינג\nחוות דעת - הרצאות:\nההרצאות היו בנוכחות חובה למרות שלא הייתה אכיפה.  היו הקלטות במודל.\nהיה זמן לדיונים מעניינים, והמרצה אמרה שלהבא היא תנסה שיהיו אפילו יותר איפה שאפשר.\nהקורס בסגנון קורס פילוסופיה, הרבה מהתוכן הוא על איך פילוסופים מיוון העתיקה ועד היום הסתכלו על כל מה שקשור לחשיבה ביקורתית. לדוגמה, השאלה של איך אפשר להבדיל בין מחשבות עצמאיות שלנו לדעות שהחברה הטמיעה בנו, או איך אפשר לדעת שעובדה מסויימת היא אמת מוחלטת (הרי אפילו אחרי מס' ניסויים מדעיים יכול להיות שעדיין התוצאה היא צירוף מקרים).\nלמי שמתעניין להתרשם קצת מפילוסופיה הקורס מומלץ אבל למי שלא - זהירות, זה יהיה חופר. \n\n\nהמבחן:  היה אמור להיות אמריקאי אבל כמה ימים לפי שונה למבחן עם שאלות פתוחות וחומר פתוח. המבנה היה 3 שאלות שמהן צריך לבחור אחת, ובכל שאלה בערך 12 סעיפים. הוא לקח המון זמן (בערך 5 שעות בממוצע ממה שהבנתי מהחברים) אבל לדעתי היה סופר פייר ונדיב - במקום ללמוד מראש למבחן ולשנן מושגים, היה צריך לענות על 12 שאלות כשהמצגת של הקורס פתוחה מולך. ההגשה הייתה פתוחה להמון זמן - כמעט 12 שעות, אז זה בעצם היה מאין עבודת הגשה עם דד ליין קצר.\n\nהשורה התחתונה: פילוסופי, קצת חופר, אבל אוי ההיסטוגרמה 3>", "timestamp": 1612618489902}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אילה קינג\nחוות דעת - הרצאות: הרצאות מעניינות אבל קצת קשות לתפיסה (לא קלילות) המרצה מדהימה, מאוד נעימה ואדיבה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: היה אמור להיות אמריקאי אבל שונה לעבודת הגשה שניתן להגיש בטווח של 12 שעות. העבודה היתה ארוכה מאוד ולקחה הרבה מאוד זמן (כמה שעות) אבל בסופו של דבר היו ציונים מאוד גבוהים והמרצה פירגנה.\n\nהשורה התחתונה: קורס נחמד מאוד פילוסופי למי שאוהב.", "timestamp": 1612693159764}, {"author": "אלון שירי", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אילה קינג\nחוות דעת - הרצאות: מעניינות, למי שאוהב קצת להתפלסף אבל לא מעיק\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: זה דבר שמשתנה לפי מה שהבנתי. בסמסטר שלי היה מבחן פרונטלי עם שאלות פתוחות. אבל אם לתשובה שלך יש ביסוס אמיתי מהחומר, אין תשובות באמת לא נכונות ( עד גבול מסוים)\n\nהשורה התחתונה: אני אהבתי", "timestamp": 1635319779482}, {"author": "צפרדע אנונימית", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איילה קינג\nחוות דעת - הרצאות: \nבאופן אישי, לא הקשבתי למילה שנאמרה בהרצאות וזאת למרות המשפט החוזר של המרצה שהיא תבחן אותנו על הבנה ולא שינון מצגות, אז כמה ההרצאות מעניינות? לא יודע… עשיתי גיליונות בפיזיקה בזמן הזה. הדבר המעצבן היה שאסור להיות בטלפון ובמחשב, אז רק אם אתם מסכמים באייפד, זה בסדר מבחינתה.\n\nהמרצה באופן אישי, מאוד נחמדה, חביבה, רואים שהיא אוהבת את החומר ואוהבת את הסטודנטים וממש בעדם. ראתה שאנחנו נלחצים מהמבחן וכל הזמן כיוונה אותנו מה ללמוד ואיך ללמוד.\n\nשעורי הבית: אין\n\nהמבחן: למדתי למבחן הזה הרבה יותר ממלג ממוצע כי אשכרה היה צריך להבין. בעיני החציון והממוצע לא משקפים את רמת הלמידה שצריך להשקיע כדי להבין פילוסופיה שהוא תחום ככ רחב אופקים וקשה לתפיסה. למדתי אליו בערך מיום שישי והמבחן היה בשלישי, סהכ היה די ברור וקליל: 22 שאלות אמריקאיות וצריך לענות על 20 ושתי שאלות פתוחות שבוחרים מהן אחת ועוד שאלת בונוס. סהכ אפשר להגיע גם ל113. נשמע מפתה אבל מי שלא אוהב את התחום הזה- שיתרחק, לא שווה את הכאב ראש שלפני זה. המבחן גם היה קצת ממוחזר (משהו כמו 10 שאלות אמרקאיות, ככה שזה נחמד)\n\nהשורה התחתונה: בלבול מוח של קורס למי שלא אוהב את התחום. ממוצע לא משקף לדעתי את רמת ההבנה הנדרשת ממלג בסיסי ודורש ליטרלי הרבה חשיבה.", "timestamp": 1656416397088}, {"author": "לא", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: איילה קינג\nחוות דעת - הרצאות: \nמרצה מאוד נחמדה, אוהבת את מה שמלמדת. חומר לא כל כך מעניין לדעתי\n\nהמבחן: היה חלק אמריקאי, שלקוח כמעט לחלוטין ממבחני עבר וממאגרי שאלות, אז סביר\nהיה אצלנו גם חלק פתוח, שלי לפחות לא היה קל, למרות שלמדתי לא מעט למבחן, וכנראה שהורידה לא מעט נקודות שמה\n\nהשורה התחתונה: \nהממוצע נמוך יחסית למלג(90), אז כנראה יישרה קו עם שאר המלגים שמורידים את הממוצע שלהם משמעותית, \nלא מומלץ בכלל לדעתי", "timestamp": 1657445500273}]}