{"posts": [{"author": "נפגע פעולות האתיקה", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: רובן הגדול של ההרצאות מעניין. עוסקים בדילמות ונושאים נפוצים וכל שיעור אחת הקבוצות מציגה עבודה במשך בערך 20-40 דקות בנושא. אין נוכחות חובה.  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: צריך לענות על שאלה שמתפרסמת פעם בשבוע באתר - MENT.IO. לא אמור לקחת יותר מ - 5 - 10 דקות.\n\nהמבחן: אין מבחן. מגישים עבודה דיי ארוכה בקבוצות שמהווה רב הציון. הציונים הסופיים מאוד מאוד נמוכים ביחס למלג כך שלא משנה אם תשקיעו, סביר להניח שתתאכזבו. בנוסף לא שוחררו הציונים של העבודות והמרכיבים האחרים של הציון הסופי... \n\nהשורה התחתונה: צפו לאכזבה.", "timestamp": 1648063538610}, {"author": "prital margi", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: אין נוכחות חובה בהרצאות, ראיתי אותן דרך הזום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין שיעורי בית\n\nהמבחן: אין מבחן, במהלך הסמסטר צריך לבחור נושא כלשהו מהרשימה ולהציג ביחד עם קבוצה של 5 אנשים מול הכיתה. קליל ממש. \n\nהשורה התחתונה:  הציונים ניתנו בצורה רנדומלית לדעתי, הקורס לא דורש השקעה כמעט בכלל אך גם לא כל כך מעניין. מומלץ למי שרוצה ציון טוב בקלות.", "timestamp": 1649512404725}, {"author": "האדם הוא האשם", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: כביכול נוכחות חובה, תכלס רישום עצמי במודל, בשתי הרצאות שהייתי כמעט נרדמתי.\n\nשעורי הבית: כל שבוע לכתוב חוות דעת על נושא מסויים, לוקח כרבע שעה כל פעם.\n\nהמבחן: אין מבחן, יש פרזנטציה שדורשת לקרוא מאמר מאחד הנושאים שהיא נותנת, לדבר על המאמר, על התופעה, ואיך אפשר לשפר... \nדי קליל, משהו כמו יום אחד ומסיימים.\n\nהשורה התחתונה: המטרה של הקורס הוא בעצם להראות כמו בני אדם רעים לטבע ואיך כל הדברים בעצם נהרסים/מוכחדים על ידינו, לא מומלץ לקרניבורים שאוכלים בחד פעמי וקונים בגדים בתדירות גבוהה.\n\n*ציון מוגרל לחלוטין*", "timestamp": 1676038419760}, {"author": "איתי", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: הרצאות מאוד קלילות ונחמדות אם אתם באים במוד להשתתף בדיונים שבכיתה. דינה היא מרצה מאוד נחמדה ואחלה להעביר איתה שעה וחצי בשבוע. ההרצאות יכולות להיות משעממות גם אבל אם תעשו דברים אחרים במהלך השיעור אז דינה לא תגיד לכם כלום כי הנוכחות חשובה (כל הציון למעשה)\n\nשעורי הבית: דיונים בפורום של דינה שהיא מעלה כל שבוע. 10 דקות של השקעה בהגזמה וזה מאחוריכם וזה רק כי אתם רוצים להביא תשובה שונה ממה שנכתב בפורום לפניכם כדי לקבל הערכה יותר גבוהה עליה.\n\nהמבחן: אין מבחן, הצגה בכיתה של אחד מהנושאים בדיונים שבמהלך הסמסטר שאם תשכילו לעשות את זה כמוני על תחילת הסמסטר אז המטלה ה\"גדולה\" של הקורס מאחוריכם ומשם זה נטו נוכחות.", "timestamp": 1679502112507}]}