{"posts": [{"author": "קורונית", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות של עזרי מעניינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nהכנת פרויקט סיום המראה תוצרים\nהשורה התחתונה: \nמלג מומלץ", "timestamp": 1597916570524}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nעזרי טרזי ודינה רפאל\nחוות דעת - הרצאות: \nהרצאות חביבות, קלילות, לא קשה מידי ולא מעניין מידי...\nשעורי הבית: \n3 פעמים במהלך הסמסטר היה צריך להכין מצגת בקבוצות\nהמבחן: \nאין מבחן, כל קבוצה מציגה את המצגת שלה\nהשורה התחתונה: \nקורס קליל ממש, קצת עבודה בקבוצות, אבל עם האנשים הנכונים מסיימים את זה מהר. הדרישות לא גבוהות והממוצע גבוה :) מומלץ בעיקר למי שרוצה ציון גבוה בלי להתאמץ הרבה", "timestamp": 1600251267995}, {"author": "רם הנדסת מכונות", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דר. רפאל מארק- ר דינה\nחוות דעת - הרצאות: \nמתכונת כיתה הפוכה רואים בבית הרצאות של מעצב תעשייתי.\nהמרצה המשני של הקורס הוא פרופסור ראובן כץ.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nהמצגות הן בקבוצות של 5 סטודנטים\nהמבחן: \nיש לעשות 3 מצגות ופרויקט מעשי של מוצר\n\nהשורה התחתונה: \nהקורס לראשונה הסמסטר הזה הפך לקורס בחירה פקולטית של הנדסת מכונות אך סטודנטים מכל הפקולטות עדיין יכולים לקחת אותו כמל\"ג.\nהמרצה המשני של הקורס הוא ראש מגמת תכן של הנדסת מכונות פרופסור ראובן כץ וכידוע הוא מרצה מאוד דורשני וקשוח.\nלפיכך רמת הקושי והדרישות הם כמו קורס רגיל של שתי נק\"ז.\nהביקורות משנים קודמות לא רלוונטיות בכלל.\nאת המוצר הסופי הקורס ביצענו במידול בתוכנת SOLID WORKS והדפסנו אותו בתלת מימד,מצופה מהסטודנטים לבוא עם הידע הזה והוא לא נלמד במהלך הקורס(כל ידע בתיב\"מ הוא ידע שמצפים שהסטודנטים יודעים מקורסי היסוד בהנדסת מכונות).\nמי שמחפש לסמן וי על מל\"ג לא ממליץ לקחת את הקורס.\nמי שמחפש לקבל רקע וניסיון לפני פרויקט סוף של הנדסת מכונות (תכן מוצר חדש) אני ממליץ לקחת את הקורס.", "timestamp": 1657613949539}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "לברוח לברוח לברוח!\nשם המרצה: דינה והעוזר שלה ניב\nחוות דעת - הרצאות: \nמאוד מבולגן.\nרמה נמוכה מאוד של תוכן, כל הקורס בנוי כ\"חקלאות כמטאפורה לתהליך היזמי\", לא צריך להרחיב במילים, גם ילד בן 10 היה מבין שזה שטויות במיץ.\nנדרשים לבנות פרויקט פיזית, למעט המצרכים שלקח נצח לגרום להם לקנות אותם, הם לא סיפקו כלים לבניית הפרויקט עד **השיעור האחרון**\n\nשעורי הבית: \nנדרשים לראות הרצאות מוקלטות ויש 3 הגשות.\n\nהמבחן: \nאין\nהשורה התחתונה: \nסבלתי מכל רגע, היה עינוי, הרגשתי שמסתלבטים עלי כי אין מצב שזה קורס בטכניון.\nממליץ לברוח לכיוון השני.", "timestamp": 1673797207773}, {"author": "באבא גנוש", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה:  דינה רפאל\nחוות דעת : \nבמהלך הקורס עושים פרויקט של קיימות, נחמד מאוד אבל אין שום קשר באמת למנהיגות ולא ליזמות\nמל\"ג נחמד\n\n\n\n\n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675883033218}, {"author": "יובל", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה רפראל\nחוות דעת - הרצאות: פשוט בושה. בכל התואר שלי, לא ראיתי קורס כזה. לא לומדים שום דבר, המרצה useless, לא מכוונת בכלל בהכנה הפרויקט... הקורס הזה הוא בדיחה, בזבוז זמן. \n\nשם המתרגל/ת: הילה הופמן\nחוות דעת - תרגולים: הכי useless שראיתי בחיים שלי. לא עזרה לנו פעם אחת אפילו בפרויקט. אבל היא פה, לא יודעים למה. ואפילו לא מקשיבה כשמייצגים את הפרוייקט, היא על טלפון שלה. בושה.\n\nשעורי הבית: נושא הפרויקט מעניין. רפלקציה אישית לא רלוונטית בכלל. נשאל \"עכשיו שעשיתה את הקורס מנהיגות יזמית, מה תעשה\", כאילו לעשות את הקורס הזה בו לומדים שום דבר יספיק לנו לפתח Start Up : בדיחה !!! בבקשה תעשו משהו, לטובת הסטודנטים ולטובת הטכניון.\n\nהמבחן: פרויקט, רוב הסטודנטים לא משקעים בו בכלל.\n\nהשורה התחתונה: סגל הקורס לא טוב בכלל. צריך להחליף אותם הכי מהר שאפשר. הטכניון שווה יותר טוב מזה, הסטודנטים גם...", "timestamp": 1689754201407}, {"author": "Bassel", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "לברוח הכי רחוק שאפשר מהקורס הזה !!!\n\nשם המרצה: דינה רפאל\nחוות דעת - הרצאות: אין מצב שהיא באמת מרצה. התוכן של הקורס הוא ריק. לומדים שום דבר. איזה אכזבה כי נשמע מעניין בהתחלה.\n\nשם המתרגל/ת: העוזרים של דינה רפאל\nחוות דעת - תרגולים: אפילו לא מקשיבים במשך הצגת הפרויקט. \n\nשעורי הבית: הרפלקציה אישית היא מצחיקה ברמות. מרגישים שצוחקים עלינו.\n\nהמבחן: הפרויקט. הסטודנטים לא משקיעים בו בכלל כי יודעים שהם נותנים ציון באקראי.\n\nהשורה התחתונה: הקורס הזה מצחיק אבל אני לא חושב שזאת המטרה של קורס בטכניון.", "timestamp": 1689886688767}, {"author": "רואי", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: לא טובה, מבולגנת, לא מלמדת.\n\nשם המתרגל/ת: הילה הופמן\nחוות דעת - תרגולים: נחמדה\n\nשעורי הבית: כמה משימות. אין עומס.\n\nהמבחן: הפרויקט\n\nהשורה התחתונה: לא מומלץ בכלל. אין חומר, כל הקורס לא רלוונטי.", "timestamp": 1689887910087}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: בדיחה\n\nשם המתרגל/ת: הילה הופמן\nחוות דעת - תרגולים: בדיחה\n\nשעורי הבית: בדיחה\n\nהמבחן: בדיחה\n\nהשורה התחתונה: הכל בדיחה בקורס הזה.", "timestamp": 1690052385643}, {"author": ".", "difficultyRank": 1, "generalRank": 1, "semester": "202302", "text": "שם המרצה: דינה רפראל\nחוות דעת - הרצאות: פשוט בושה. בזבוז זמן. לא לומדים שום דבר. בנוסף- אומרים בתחילת הקורס שזה לא קורס פוליטי ואז בכל הרצאה יוצאים על כל דבר ימני שקיים.\nאני שמאלנית וזה הרגיש לי מוגזם.. ממש תוקפים את הימין. וכל מי שמשתף דעה ימנית ישר תוקפים אותו.\n\nשעורי הבית: בדיחה ובזבוז זמן\n\nהמבחן: פרויקט בזבוז זמן\n\nהשורה התחתונה: בזבוז זמן.", "timestamp": 1718532845271}]}