{"posts": [{"author": "אורי אמסלם", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: להב אילון נועה\nחוות דעת - הרצאות: הרצאות נעימות ומרצה מצוינת! מי שחובב פילוסופיה יימצא את הקורס הזה ממש נחמד ומעניין. יש הרבה טקסטים בקורס אבל סך הכל אם מקשיבים בהרצאות הם מובנים. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1672704682078}, {"author": "ברקוני", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ד\"ר נועה להב אילון \nחוות דעת - הרצאות: מדברים על כל מיניי פילוסופים ועל התיאוריות שהם הגיעו אליהן ותוך כדי מתפתח שיח בכיתה על התיאוריות. למי שמאוד אוהב פילוסופיה - קורס מומלץ ביותר! \nלמי שאוהב פילוסופיה ככה ככה, עדיין מומלץ כי הוא עם ציונים מדהימים ויחסית מעט השקעה, אבל קחו בחשבון שעלול להיות קצת משעמם בדיונים החופרים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: שיעורי הבית הם 30% מגן מהציון הסופי. צריך להגיש 3 מטלות מתוך 5, שכל מטלה לוקחת 20 דקות בגג.\n\nהמבחן: 25 שאלות אמריקאיות, ברמה הכי בסיסית שיש. כן צריך ללמוד, אבל יומיים למידה ממש מספיקים כדי לקבל 100.\n\nהשורה התחתונה: מל\"ג מומלץ ביותר!", "timestamp": 1675322357074}, {"author": "Niv Arad", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ד\"ר נועה להב אילון\nחוות דעת - הרצאות: בתור מישהו שמאוד אוהב פילוסופיה מאוד מאוד מאוד נהנתי בהרצאות, הרגשתי כאילו זה בונוס לשבוע שלי. המרצה מאוד כריזמטית ונחמדה, נותנת אפשרות לכולם להתבטא, ומעבירה את השיעור באמצעות דיונים שגורמים לשעה וחצי להרגיש כמו עשר דקות!\nעם זאת, במידה ואתה ממש לא מתחבר לנושא הפילוסופיה, אתה כנראה פחות תהנה בהרצאות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: -\n\nשעורי הבית:  3 עבודות להגשה מתוך 5. כל עבודה לא אמורה לקחת יותר מרבע שעה במידה ואתה לא מנסה לעשות מעבר למה שצריך.\n\nהמבחן: 25 שאלות אמריקאיות ברמה בסיסית ביותר, יומיים למידה למבחן הספיקו. לא 100 ללא עבודה, אבל עם מעט עבודה אפשר להוציא בקלות 90+\n\nהשורה התחתונה: קורס חובה למי שמתחבר לז'אנר!", "timestamp": 1675611299290}, {"author": "יובי", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: יחסית מעט חומר כי דנים המון, ולפעמים יש סטודנטים שמתקטננים על קטנות ואז הכל נמרח. נועה מאוד נחמדה.\nפחות מתאים לאנשים בעלי זיקה לדת, לדעתי.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מטלות מאוד בסיסיות שאמנם דרשו קצת קריאה אבל לא הרבה כתיבה.\nהן לא נבדקו כלל, רק להגשה.\n\nהמבחן: קל מאוד, כנראה בגלל שהציונים של הקורס הקודם של נועה הכעיסו קצת סטודנטים. מאמין. היא גם עזרה ממש לסטודנטים במבחן, מצטער שלא פניתי אליה כי היא בטוח הייתה מכוונת אותי בשאלה היחידה שבה טעיתי.\n\nהשורה התחתונה:", "timestamp": 1675620143159}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: \nאהבתי מאוד! מרצה מדהימה\nרואים שהיא מנסה לתת מקום לדעות של כולם ולהבין אותם באמת, וגם מנסה להיות נייטרלית ולא ללמד את ההשקפה שלה   כאילו זה הדבר הנכון\nלא מסכימה עם החוות דעת שלפני - בתור דתיה מאוד נהנתי והמרצה מאוד מכבדת. אפשר לשמוע דעות שונות ולא צריך להסכים עם כל דבר שנאמר\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 3 מטלות הגשה, לקחו לי חמש דקות ויש בחירה\n\nהמבחן: סבבה לגמרי, למדתי שעתיים והצלחתי לגמרי\n\nהשורה התחתונה: אם אתם אוהבים פילוסופיה אז ממש מומלץ\nאם אתם לא אבל לא אכפת לכם לשבת בכיתה בזמן שמתפלספים ולתת כמה שעות למידה לקראת המבחן - גם מומלץ", "timestamp": 1676576150745}, {"author": "ממליצה", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: נועה ממש מקסימה והיה כיף להקשיב לה. מצגות קלילות ולא דורשות יותר מידי לסכם, רק לרשום הערות פה ושם. \n\nשעורי הבית: היו 5 מטלות שמתוכן היה צריך לענות רק על 2. מטלות קלילות, יש שבועיים להגיש כל אחת. פשוט לקרוא קטע שנועה העלתה למודל ועליו שאלה. תשובה של פסקה, ממש בקטנה. הבדיקה מדגמית והיא אמרה אין נכון לא נכון היא רק רוצה לראות שקראנו.\n\nהמבחן: קליל!! 25 שאלות אמריקאיות ברמה בסיסית מאוד. בשיעור האחרון נועה מאוד ממקדת מה צריך לדעת למבחן אז פשוט לזכור את הדברים האלו. \n\nהשורה התחתונה: ממליצה ממש!! מלג קליל וציונים גבוהים. נועה מקסימה ובאמת היה נחמד להקשיב לה באוזן אחת ולעשות דברים במקביל למי שלא ממש מתעניין בפילוסופיה. קל להוציא מעל 90 בלי יותר מידי השקעה (במיוחד לאורך הסמסטר, מספיק ללמוד רק לפני המבחן אבל נחמד להקשיב לה בהרצאות)", "timestamp": 1712651862738}, {"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: \nמלאת תשוקה על החומר. מי שמתעניין מעט בפילוסופיה יהנה בהרצאות כי היא גם מנגישה את החומר באופן פשוט. בפועל לא הקשבתי דקה והוצאתי מעל 90.\n\nשעורי הבית: 2 מטלות מתוך 5. מקבלים מאה נטו על הגשה. כל מטלה לוקחת אולי רבע שעה והיא פותחת הגשה לכל המטלות כבר מתחילת סמסטר ככה שאפשר להשקיע בזה כמה דקות טובות בהתחלה ולקבל מגן 30 אחוז קליל של 100\n\nהמבחן: די ממוחזר, נועה הולכת תכלס. תלמדו משחזורים נטו, אין מה לחזור על ההרצאות. יש דגש על מי אמר איזה ציטוט\n\nהשורה התחתונה: אחלה מלג, מומלץ ממש וציון מעל 90 קליל. החסרון היחיד הוא הנוכחות חובה שנועה מקפידה עליה וקוראת כל תחילת שיעור, מותר להבריז פעמיים בסמסטר.", "timestamp": 1714543833340}, {"author": "מים", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: היא פשוט מדהימה, מצחיקה, מעניינת ואוהבת את החומר, קל וכיף להקשיב לה\n\n\n\nשעורי הבית: 2 משימות פשוטות \n\nהמבחן: \nמבחן הוגן היא בוחנת על מה שנאמר בהרצאות ורשום במצגות, לא מסבכת יותר מידי… כן יש שאלות שצריך ממש לזכור מהמצגת משפטים וצריך לזכור ולשנן אותן.\n\nהשורה התחתונה: קורס מגניב בטירוף, אם מתחברים לנושא ואוהבים לקחת הפסקה מרעננת משגרת לימודים אז הקורס ממש מומלץ", "timestamp": 1719995405772}]}