{"posts": [{"author": "ידוע בציבור", "difficultyRank": 1, "generalRank": 5, "semester": "202003", "text": "שם המרצה: ד\"ר תמר פלד\nחוות דעת - הרצאות: אינפורמטיביות ומעניינות. לפעמים מתדיינים קצת על החומר.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\nשעורי הבית: אין\nהמבחן: הקל ביותר שעשיתי בתולדותיי בטכניון. חצי שעה וסיימתי. 29 שאלות אמריקאיות, חלק ממוחזר, חלק זה ציטוטים ממצגת סיכום של המרצה, שאם זכרתם - אז זו התשובה הנכונה.\nהשורה התחתונה: קורס קליל, יש בו אלמנט אינפורמטיבי לחיים עצמם. מבחן קל. מרצה סבבה. מלג-על-הדרך.", "timestamp": 1633452909162}, {"author": "טיילור", "difficultyRank": 1, "generalRank": 5, "semester": "202103", "text": "שם המרצה: תמר פלד כץ\nחוות דעת - הרצאות: סך הכל ההרצאות מעניינות, תמר נחמדה וניכר שהדברים שהיא מדברת עליהם חשובים לה אישית.\nהיא עובדת עם מצגת ורוצה לעורר דיון בכיתה, מעודדת אנשים להביע דעה ולדבר על הסוגיות שהיא מעלה.\nהיא משלבת בהרצאות תיקים משפטיים חשובים שקשורים לנושא ההרצאה ודילמות אקטואליות.\nחשבתי שאעביר את הזמן בטלפון אבל מצאתי את עצמי מקשיב ואפילו משתתף.\nבקיץ לפי המערכת ההרצאות הן 4 שעות פעם בשבוע, בפועל רוב ההרצאות היו כ-3 שעות עם הפסקה באמצע.\n\nשעורי הבית: אין. פעם אחת היא ביקשה שנקרא מאמר מסוים כהכנה להרצאה הבאה, ובפעם אחרת ביקשה שנצפה בסרט קצר. דורש אפס השקעה במהלך סמסטר.\n\nהמבחן: אמריקאי, 34 שאלות. מבחן הוגן לדעתי.\nשבוע לפני המבחן היא עושה שיעור חזרה על החומר עם מצגת וגם מפרסמת אותה במודל, והמבחן מתבסס נטו על מה שבמצגת הזאת, כולל שאלות לדוגמה שמופיעות שם. חצי שעה ואתם בחוץ\n\nהשורה התחתונה: מל\"ג מומלץ, מי שהגיע להרצאות ועבר על מצגת החזרה לפני המבחן - לגמרי יכול לקבל 100", "timestamp": 1667920818381}, {"author": "סטודנט לחשמל", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "חוות דעת - הרצאות: \nמעניינות, המרצה תיאטרלית מאוד וההרצאות עוסקות בנושאים די מעניינים, ככה שזו הפוגה טובה לשבוע.\n\n\nשעורי הבית: אין\n\nהמבחן: למי שנוכח בשיעורים, תספיק שעה שעה וחצי של לחזור על ההסיכומים יום לפני המבחן\n\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1674998008922}, {"author": "E.A", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: חומר ההרצאות מאוד מעניין, ובנוסף לכך תמר משתדלת להלהיב את הסטודנטים ולייצר סקרנות, וזה בכלל לא מובן מאליו.\n\nשעורי הבית: אין\n\nהמבחן: הרוב ממוחזר, שאלות לא מתחכמות, 100 קל.\n\nהשורה התחתונה: \nהנושאים השונים שמועברים במל\"ג נורא מעניינים וגם רלוונטיים לידע כללי. חשבתי שאגיע רק בשביל הנוכחות אבל מצאתי את עצמי ממש מתעניין במהלך השיעור. בקיצור, מהמל\"גים הטובים שעוד נשארו.", "timestamp": 1675093401078}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nההרצאות מעניינות, באתי קצת סקפטית בהתחלה אבל תמר באמת מעבירה הכל בהתלהבות ובצורה מאוד מעניינת. בד\"כ מסיימת את ההרצאה בשעה (סיימה רוב המקרים ב-9:30 במקום ב-10:20) שזה בכל טוב.\n\nשעורי הבית: אין\n\nהמבחן: \nה-100 הכי קל שקיבלתי בחיי. 29 שאלות אמריקאיות, שאם הייתם בהרצאות ועברתם פעם אחת על המצגת לפני המבחן אין סיבה לא להוציא 100.\nהשורה התחתונה: מומלץ בחום! אפס השקעה במהלך הסמסטר וציונים מאוד מאוד גבוהים", "timestamp": 1675318836975}, {"author": "Y", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מומלץ ומעניין- ציונים גבוהים מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1675880868651}, {"author": "Ana", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מעניינות - תמר אוהבת מה היא עושה בחיים ואפשר לראות את זה - ממוצע מעניין גם כן.\nלא אכפת לה מהנוכחות אבל הטכניון מבקש ממנה ופעם ב... בדקה נוכחות - בכל זאת הייתי קמה ב- 8 וחצי בבוקר כי החומר מעניין.\n\nהמבחן: ממוחזר.\n\nהשורה התחתונה: המלג הכי שווה.", "timestamp": 1680035569675}]}