{"posts": [{"author": ":)", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אלכס טל\nחוות דעת - הרצאות: בסמסטר זום הנוכחות לא הייתה חובה, יש הרצאות די מעניינות ויש כאלה שפחות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחן עם חומר פתוח, בנוסף הוא היה ממוחזר שזה ממש אחלה והממוצע גבוה\n\nהשורה התחתונה:", "timestamp": 1612099956231}, {"author": ":(", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "חוות דעת - הרצאות: \nמשעממות מאוד, אפשר להרדם בלי לשים לב\n\nהמבחן: \nמבחן מרופרנס לגמרי, כל השאלות הופיעו במאגר. אבל כנראה שיש במאגר טעויות, במועד שלנו כמעט כולם קיבלו 95 למרות שלא נשאלו שאלות חדשות.\n\nהשורה התחתונה: \nבשביל 95, לא שווה להרשם לקורס הזה. משעמם מאוד, ולא מומלץ באופן כללי. מעדיף לקחת אדם קדמון או כל דבר אחר שטיפה יותר מעניין.", "timestamp": 1612191368628}, {"author": "Amit Elharar", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אלכס טל\nחוות דעת - הרצאות: לא הקשבתי\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: קל, ממוחזר.\n\nהשורה התחתונה: קורס קל, מומלץ מאוד.", "timestamp": 1612691925360}, {"author": "מורן ויצמן", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מל\"ג מעניין מאוד. מבחן לא קשה וממוחזר לרוב.", "timestamp": 1615715467617}, {"author": "F", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "חוות דעת - הרצאות: היה בזום עם נוכחות חובה, לא בטוח כמה זה נאכף. הרצאות משעממות בטירוף.\n\nשעורי הבית: אין\n\nהמבחן: להבדיל משנים קודמות שהיו 20 שאלות אמריקאיות ממוחזרות, היה מבחן שכלל רק 10 שאלות אמריקאיות ומתוכן רק 4 היו מהמאגר. הסיבה היחידה שרוב האנשים עברו, זה שהמבחן עם חומר פתוח ובסמסטר שעבר היה סטודנט תותח שהכין סיכום מאוד מושקע שהכיל חלק מהתשובות.\n\nהשורה התחתונה: משעמם רצח, ולא מובטח ציון טוב, לברוח כמו מאש.", "timestamp": 1625357300876}, {"author": "KS", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלכס\nחוות דעת - הרצאות: הייתי רק ב3 הרצאות והיה סביר\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: -\n\nהמבחן: 19 מתוך 20 השאלות שהיו מוחזרו והמבחן עם חומר פתוח. יש לקורס סיכום נפלא מלפני שנתיים של סטודנט בשם רז ומומלץ להשתמש בו.\nהשורה התחתונה:  קורס קליל, המרצה בדק נוכחות רק פעמיים במשך כל הסמסטר.", "timestamp": 1675155588863}, {"author": "סטודנטית שמחה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הלכתי רוב הפעמים, בדקו נוכחות פעמיים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: הכי קל שעשיתי בחיי , מבחן של שעה ,לא למדתי למבחן בכלל בכלל! אפילו לא שנייה , רק הדפסתי סיכומים ומאגרי שאלות ותשובות שמצאתי בפייסבוק , ובמבחן היו 20 שאלות שמתוכן 19 ממוחזרות שמצאתי להן פתרון במבחן , רק אחד שהייתי צריכה לחפש בסיכום , השתמשתי בסיכום של רז , מאודד עזר רק פתחתי את הדף והמקור לפי מה שהמרצה כתב בשאלה, קראתי שני משפטים ומצאתי את התשובה ובום יש לי 100 בקורס :)\n\nהשורה התחתונה: מומלץ מומלץ מומלץץ, מלג הכי מומלץ .", "timestamp": 1675351530119}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלכס טל\nחוות דעת - הרצאות: די משעמם. הוא בודק נוכחות פעם באף פעם אז אפשר להבריז. מי שרוצה לכסות את עצמו אפשר להגיד למישהו \"להתחלק\" איתכם בנוכחות. לא צריך להיות נוכח או להקשיב כדי לקבל ציון גבוה.\n\nשעורי הבית: אין\n\nהמבחן: 20 אמריקאיות ממוחזר עם חומר פתוח. גם אם לא תלמדו בכלל ותבואו למבחן עם הדף תשובות שיש בפייסבוק תקבלו מינימום 90-95. אני השקעתי 4 שעות למידה בשביל לקבל 100.\n\nהשורה התחתונה: מומלץ למי שמחפש ציון גבוה עם אפס השקעה. עניין כנראה שלא תמצאו פה.", "timestamp": 1679953259742}]}