{"posts": [{"author": "...", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: נחמדות, מעניינות וקלילות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: המבחן הוא מבחן שמיעה על 6 יצירות (סך הכל משהו כמו 3 שעות של שמיעה). במבחן משמיעים 30 שניות של יצירה קלאסית וצריך לזהות איזו יצירה זו הייתה. כדי להצליח במבחן צריך לשמוע את היצירות לאורך כל הסמסטר ולא מספיק ללמוד כמה שעות לפני המבחן שזה דיי מבאס.\n\nהשורה התחתונה:", "timestamp": 1611428068503}, {"author": "באך", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: רועי\nחוות דעת - הרצאות: חלק מההרצאות ממש מעניינות ועוסקות בחיבור של המוזיקה אלינו ובהגדרות שונות מהעולם המוזיקלי וחלק פחות. למי שמתעניין בכללי במוזיקה ממש מומלץ.\n\nשעורי הבית: אין - אבל הלמידה למבחן לגמרי נחשבת כשיעורי בית כי דורשת המון השקעה במהלך הסמסטר. קיבלנו בשבוע הראשון של הסמסטר רשימה של 16 יצירות (באורך של כ-4 שעות האזנה במצטבר) היצירות היו כל אחת באורכים של 3 דקות עד ל47 דקות!! וליצירות היותר ארוכות לרוב הייתה חלוקה לקטעים ביצירה - שגם אותם היה צריך לזכור ולדעת להבדיל ביניהם. למשל בסימפוניה השלישית של בטהובן - להבדיל בין 4 החלקים שלה. ובנוסף אליהם אלבום שלם של הביטלס (revolver) עם 14 שירים באורך של 2-3 דק' כל אחד (כדי להקליל מעט על כל היצירות היותר כבדות לטענת המרצה).\n\nהמבחן: המבחן היה מבחן האזנה אמריקאי כמו בשנים קודמות, משמיעים יצירה מסוימת במשך 30 שניות 3 פעמים (לפעמים הוא משמיע קטעים שונים מתוך היצירה לפעמים הוא חוזר על אותו הקטע - תלוי עד כמה היצירה ארוכה) וצריך לבחור את היצירה הנכונה מבין 5 תשובות אפשריות - סה\"כ 10 שאלות כאלה. מבין 5 התשובות יכולות להיות 2 תשובות של אותה יצירה, רק חלקים שונים שלה (היתרון של כך הוא שאם סימנתם בטעות את החלק הלא נכון ביצירה, אבל כן זיהיתם את היצירה בכלליות אז תקבלו 5 נקודות מתוך 10 על השאלה במקום 0). על הביטלס הייתה רק שאלה אחת, אבל מכיוון שהיא הייתה ממש קלה היא הייתה גם מעין בונוס. הסמסטר רועי החליט להוסיף 10 נקודות בונוס למבחן בדמות 5 שאלות אמריקאיות ששואלות על הנושאים השונים שלמדו לאורך הסמסטר בקורס כך שהיה אפשר לצבור עד 110 נקודות במבחן. למי שהקשיב והשתתף (ככל הנראה חלק קטן מאד מהאנשים בקורס) הבונוס היה מובטח. \n\nאני אישית הגעתי ללא רקע כלל והשקעתי לאורך כל הסמסטר כשעה בשבוע להאזנה (תוך כדי ביצוע פעולות מונוטוניות אחרות כמו שטיפת כלים או כביסה - מומלץ!) פלוס בימים שלפני המבחן השקעתי כל יום כמה שעות נוספות בשביל עוד יותר לחדד את הזיכרון - בהתחלה זה ממש ממש קשה ובטוחים שהכל נשמע אותו הדבר אבל לקראת סוף הסמסטר מתחילים להבדיל ולשים לב לייחודיות של כל מלחין ואפשר לחלוטין לקבל ציון יפה.\n\nהשורה התחתונה: אל תתנו להיסטוגרמה לתעתע בכם! הציונים הגבוהים הם או כתוצאה של עבודה מאד קשה או פשוט אנשים עם רקע טוב מאד במוזיקה שכבר הכירו את היצירות בכל מקרה ולכן הקורס הזה קל עבורם. למי שמגיע בלי רקע הציון הגבוה אפשרי בהחלט אבל דורש עבודה.", "timestamp": 1645692196086}, {"author": "Shostakovich", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nבדגש על האספקט הפילוסופי של מוזיקה אותי די שיעמם ולא קשורות כלל למבחן\n\nהמבחן:  נותן רשימת מנגינות ואומר לך להקשיב להם במהלך הסמסטר ומזהיר שלא ניתן להתכונן למבחן כמו למבחן רגיל. \nאישית הקשבתי להם רק שבועיים לפני המבחן (באופן אינטנסבי) והצלחתי לזהות את רוב המנגינות במבחן שהיה הוגן והיה בו חלק של 10% בונוס של שאלות מההרצאות.", "timestamp": 1646862508542}, {"author": "דבוז'אק", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "חוות דעת - הרצאות: \nלדעתי קורס מעניין, התפלספות על החוויה המוזיקלית, המרצה מעניין ומצחיק.\nמומלץ בעיקר למי שאוהב מוזיקה, בטח מוזיקה קלאסית.\n\nהמבחן: \nהמבחן הוא מבחן האזנה ליצירות, וההרצאות לא מתקשרות לזה כל כך. אצלינו הוא גם הוסיף שאלות בונוס קלות שכן היו על ההרצאות (אז כדאי לפחות טיפה להקשיב - השאלות בונוס היו באמת בסיסיות על הרעיונות המרכזיים).\nהמבחן הוא זיהוי של יצירות. זה נשמע לא פשוט, וזה כן מצריך אימון, אבל זה אפשרי גם לאדם לא מיומן כי המרצה מתאים את המבחן לכך וגם בוחר קטעים מהותיים יחסית. לדעתי כן מומלץ להשקיע לאורך הסמסטר לשמוע את היצירות כל פעם במנות, זה יקל על הלמידה. אבל יש כמה שיטות ומכיר גם כאלה שהצליחו לעשות סשנים אינטנסיבים וללמוד בשבועיים.", "timestamp": 1646863751062}]}