{"posts": [{"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמרצה סבירה... לא ממש יודעת על מה היא מדבר\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nבסמסטר קורונה צריך לראות את הסרטים לבד בבית\nהמבחן: \nמבחן קל מאוד\nהשורה התחתונה:  קורס סביר מבחן קל", "timestamp": 1599122583103}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "אמנם המצרה קטנונית לפעמים, אבל הקורס מעניין והיא חזקה בחומר.", "timestamp": 1610439801940}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: איבון קובלוסקי-גולן\nחוות דעת - הרצאות: הרצאות משעממות והמרצה בכלל לא נחמדה לסטודנטים. אין שום מהלך אמיתי לאורך ההרצאות או הקורס, יותר כמו ערבוביה של נושאים ואנקדוטות. בכל פעם שלמרצה יש טעות היא לא לוקחת עליה אחריות והסטודנטים צריכים לפנות למזכירות הומניסטיים.\nמצד שני המבחן קל ולא מצריך למידה משמעותית.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן קל, אמריקאי. לא מצריך הרבה למידה.\n\nהשורה התחתונה: קורס משעמם ולא מוצלח, אבל כנראה ממוצע גבוה.", "timestamp": 1612190293770}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר איבון (אק\"ג)\nחוות דעת - הרצאות: \nהרצאות מעניינות אך יוצאות מגדר נושא השיעור. בסמסטר קורונה יש לצפות בסרטים בבית מראש ובשיעור עצמו לאו דווקא המרצה מדברת על הסרט. \n\nשעורי הבית: צפייה בסרטים...\n\nהמבחן: קל. 40 שאלות מתוך 50, שאלות אמריקאיות לא מתחכמות. ידע כללי ועברת את זה.\n\nהשורה התחתונה: למי שאוהב לצפות בסרטים ויכול לפנות לזה זמן", "timestamp": 1612196193975}, {"author": "-", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:  מבחן קליל אבל מרצה שהולכת ראש בראש עם הסטודנטים", "timestamp": 1612367782363}, {"author": "ירדן", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: איבון\nחוות דעת - הרצאות: ההרצאות עצמן די מעניינות, מדברים שם הרבה על היסטוריה. איבון טיפה באה נגד הסטודנטים הסמסטר ונתנה לנו לראות מלא סרטים בבית (שזה לוקח המון זמן) וגם לא היתה קשובה לבקשות של הסטודנטים.\n\nהמבחן: המבחן די קל, לא צריך ללמוד אליו הרבה בכלל.", "timestamp": 1616255577152}, {"author": "Bob Bobinson", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: איבון\nחוות דעת - הרצאות: מרצה שלא באמת אכפת לה מהקורס ומהתלמידים. היא מלמדת את הסרטים שהיא רוצה באותו רגע, ואפילו לא יודעת איך קוראים לקורס - היא קוראת לו \"אירופה מתמודדת עם עברה\" חצי מהזמן. חצי מהסרטים (אם לא יותר) הם לא סרטים אירופאים מהמאה העשרים: יש סרט דוקומינטרי ישראלי מ-2017 על חסיד אומות עולם, סרט עליליתי ישראלי מ-2011 על מדריך כדורסל שעבר לגרמניה, סרט קומדיה צרפתי מ-2014 על המהגרים בצרפת במאה ה-21 ועוד. אם באמת מעניין אתכם הקולנוע האירופאי של המאה ה-20, זה לא הקורס.\n\nהמבחן: המבחן אמריקאי, 30 שאלות שכל אחת 3 נקודות (המרצה כה נדיבה שנתנה נקודה אחת במתנה. היא הדגישה זאת). קל ביותר אם הקשבתם בחצי אוזן בהרצאות ולא דורש למידה.\n\nהשורה התחתונה: קורס משעמם, לא קשור לכלום עם מרצה שלא מבינה בכלום. להימנע אם חשוב לכם משהו במל\"גים מעבר לממוצע.", "timestamp": 1626079051793}, {"author": "נ", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: איבון\nשעורי הבית: \nהיה צריך לצפות בסרטים. אני אישית לא צפיתי בכלום. למדתי למבחן מסיכום שהכין אותו מישהוא במהלך הסמסטר.\nהמבחן: \n33 שאילות אמריקאיות , קלות וברורות \nהשורה התחתונה: קורס טוב וציון גבוה +90", "timestamp": 1626088572485}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: איבון\nחוות דעת - הרצאות: מרצה לא נחמדה , באה לרעת הסטודנטים.\nהרצאות לא מעניינות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: שאלות אמריקאיות על הסרטים\n\nהשורה התחתונה: קורס לא מומלץ, לא מעניין, מרצה גרועה ואפילו המומצע ירד הסמסטר", "timestamp": 1627282148486}, {"author": "אביב צ.", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: איבון\nחוות דעת - הרצאות: הרצאות עם נוכחות חובה (מצלמה דלוקה) עם \"התקלות\" נוכחות. מרגשי שזה מאוד חשוב למרצה והיא מתעסקת בזה הרבה יותר מדי. חומר שיכל להיות מעניין אבל מועבר די פושר ובחוסר עניין, חבל כי באתי עם ציפיות גבוהות והרבה עניין בתחום. ההרצאות הרגישו מאוד מסורבלות, המרצה לא מסתדרת עם מחשב והרבה מזמן השיעור הולך על בעיות טכניות (אפילו שזה כבר סמסטר קורונה שלישי. או אולי רביעי? איבדתי תחושת זמן).\n\nהמבחן: קל מאוד. מספיק להקשיב בהרצאות. מצד שני הייתה הרגשה שהיה נרמול/פקטור שלילי של שאלה או 2 כי כמעט כולם פשוט קיבלו באזור ה90.\n\nהשורה התחתונה: מקווה שתחזור הזיקה ללמד אחרת לא מאוד מומלץ.", "timestamp": 1628534844124}]}