{"posts": [{"author": "מב", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דר' אריאל מירב\nחוות דעת - הרצאות: \nמעניינות, אין בדיקת נוכחות.\n\nשעורי הבית: אין\n\nהמבחן: 17 שאלות לא קלות, התוצאות מדברות בעד עצמן\n\nהשורה התחתונה: צריך להתכונן למבחן הסופי ולשלוט בחומר. מעבר לזה לא דורש כלום במהלך סמסטר.", "timestamp": 1625784119517}, {"author": "anon", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nד\"ר מירב (משפחה) אריאל (פרטי) מאוני' חיפה.\n\nחוות דעת - הרצאות:\nהסברים מבולגנים, לא שומר על קו ברור ואין פואנטה או מטרה או משהו שצריך לקחת או להבין באופן מוגדר (לזכור שזה קורס, צריך בהירות ומטרות שיימדדו).\nמשעמם/מעניין זה עניין של טעם - בעיניי נושא מעניין שהועבר באופן גרוע, מבולגן ומרדים.\n\nמבנה הציון: \nיש חובת נוכחות שלא נאכפת בכלל, מבקש לקרוא בבית אך לא מוודא את זה. קריאה של חומרים סרוקים שמוציאים את העיניים ובעברית מליצית ולא נוחה. כמות קריאה גדולה מאוד שרלוונטית למבחן (מכסה את עצמו בשאלות שישאל על דברים שלא היו בכיתה). אין ש\"ב ומטלות מלבד אלה שציינתי. הציון כולו בהתאם לציון הבחינה ורצונו הטוב של המרצה.\n\nהשורה התחתונה: קורס כאוטי ולא מומלץ - גם מל\"ג צריך לעבור במידה של רצינות ולכל הפחות הוגנות התואמת את הציון שיינתן. קורס כזה צריך לחלק מאיות לכל הרשומים מתוך אותה הגינות, כי הוא פשוט מבולגן ולא ניתן לאומדן ולהערכה.", "timestamp": 1676276103033}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נועה להב אילון \nחוות דעת - הרצאות: \nנועה ממש נחמדה, אוהבת ללמד סטודנטים ומכירה את הסטודנטים בשם שלהם. היא מנסה תמיד לעורר דיון בכיתה אז זה טוב למי שאוהב. לדעתי זה הרבה פעמים הופך להיות מאוד חופר ותכלס אם לא היה דיונים אז הקורס היה הרבה יותר זורם.\nקצת קשה להבין את החומר אם אתה לא מגיע מעולם הפילוסופיה ולא מכיר בכלל בפילוסופיה והסטוריה יוונית אבל אם מתאמצים להקשיב תוך כמה הרצאות כן מתחילים להבין יותר מה קורה.\n\nשעורי הבית: \n2 הגשות כל אחת 15 אחוז מהציון. קל, לוקח רבע שעה גג לכל אחת. \n\nהמבחן: \nנועה אמרה שיהיה קל אבל מה שקל למרצה לפילוסופיה זה עדיין לא באמת קל. 70 אחוז מהשאלות באמת היו ממש בסדר ונרמז לנו שיופיעו אבל ה30% האחרות היו שאלות שצריך לזכור איזה פילוסוף אמר משפט מסויים או באיזה מאמר משפט כלשהו נכתב וזה לא קל. ממש צריך לקרוא את הטקסטים הפילוסופים ולזכור איך כל אחד מהם מתנסח.\n\nהשורה התחתונה: \nאפשר להתעניין בחומר של הקורס אם באמת מקשיבים אבל זה לא 95+ קל. \nהייתי ממליץ לאנשים שבאמת מתעניינים בנושאים של הקורס או אם כבר יש לכם רקע בנושאים האלה.", "timestamp": 1712601748923}, {"author": "_", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: נועה\nחוות דעת - הרצאות: נועה ממש מקסימה ונהניתי להקשיב כי אני גם מתחבר לנושאים, היא בכל זאת מפוזרת קצת בהרצאות (בהתאם לכך שהיא מרצה לפילוסופיה?) וקצת קשה להבין מה למבחן ומה סתם הדעות שלה. חלק ניכר מהשיעור הוקדש פשוט לשיחה עם סטודנטים על הנושאים שעליהם עוברים, לפעמים זה מעניין ולפעמים סתם מציק. מה שהכי הפריע לי הוא כמה המצגות הן פשוט חסרות תועלת, לא היה כתוב בהן כלום בעיני והושקעה בהן מעט מאוד מחשבה. שווה לשפר אותן לדעתי.\n\nשעורי הבית: \nשתי מטלות מתוך חמש (אין לי מושג אם הן נבדקות) לדעתי המטלות לא ממש פשוטות, הן כוללות טקסט ברמה מאוד גבוה מבחינת העברית ולא היה לי הכי פשוט להבין מה רוצים מחיי, מצד שני לא נראה שיש יותר מידי הערות על תוכן ההגשה אז כנראה שזה לא הכי קריטי.\n\nהמבחן: לדעתי היה סופר הוגן, היה בדיוק את מה שנועה אמרה ואם נכחתם בכל ההרצאות\\ עברתם על המצגת כנראה שתקבלו ציון טוב, מה שכן צריך לזכור אמרות ספציפיות של חלק מהפילוסופים וזה קצת מכשיל אז שווה לקרוא כל טקסט כמה פעמים כדי לדעת למי לשייך אותו.\n\nהשורה התחתונה: מעניין אם יש לכם קצת עניין בפילוסופיה ואתם רוצים להרחיב קצת אופקים בנושא, לא צוללים עמוק מידי לשום נושא. בנוסף נועה באמת מאוד נחמדה", "timestamp": 1714936166836}, {"author": "ב", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: נועה \nחוות דעת - הרצאות: קורס ממש כיפי למי שאוהב פילוסופיה, מעניין מאד וממש כיף ללמוד עם נועה, היא נעימה, מעניינת ומצחיקה. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nהמבחן: מבחן הוגן לחלוטין ולא קשה, מתבסס על החומר הנלמד בשיעורים\n\nהשורה התחתונה: ממליצה!!", "timestamp": 1716235563365}]}