{"posts": [{"author": "א", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אוֹרית שמאי\nחוות דעת - הרצאות: מרצה מדהימה ומתחשבת מאוד\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: --\n\nשעורי הבית: יש עבודה שצריך להגיש עד סוף הסמסטר. לא עמוס.\n\nהמבחן: אין\n\nהשורה התחתונה: מומלץ מאוד כקורס העשרה (מל\"ג). גם קליל וגם מעניין ומעשיר", "timestamp": 1611561419596}, {"author": "אוקטובר 20", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: גיא ליבנה\nחוות דעת - הרצאות: \nמספק לי אושר \nדואג לי ליצרתיות\nנותן לי חדשנות\n\nשעורי הבית: \nאישיים פרונטליים\nהמבחן: \nאישי פרונטלי\nהשורה התחתונה: רק אצל גיא ליבנה", "timestamp": 1695904593663}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202203", "text": "מרצה:  דר. רפאל דינה, סיגלית וכל מי שחלק מ-t:hub בהנהלה תאכלס.\n\nחוות דעת: אחלה מלג קליל. עובדים בצוות ומארגנים עבודה לאירוע פרסום של המרכז מהודר. לא דורש הרבה אבל צריך להתרגל לעזור לתת כיוון ברור לעבודה ולחלק תפקידים בצורה ברורה.", "timestamp": 1704979690210}, {"author": "-", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דינה רפאל וסיגלית מטי-האב \nקורס לא מאורגן וחסר תוכן זה פשוט קורס ביזמות, אין קשר לשם הקורס בכלל.\nאצלנו הקורס היה על בעיות \"ירוקות\" בקמפוס, למצוא בעיה ולמצוא לה פתרון חדשני, דינה מצפה לסטארטאפ מטורף ולא פחות מזה.\nהדרישה של סיגלית לעומת זאת, זה למצוא פתרון פרקטי שיכול לצאת לפועל תוך חצי שנה. הן לא מתואמות בינהן כלל והדרישות של הקורס לא ברורות ולכן גם הציונים מוגרלים בהתאם\nפשוט קורס חפירה ודרישות הזויות מצד דינה וסיגלית\nהמבחן: אומנם אין מבחן אבל יש עבודות במהלך הסמסטר, לפעמים נותנת לעבוד במהלך השיעור, לפעמים השיעור מתקצר סתם ככה (בדרכ הוא לא שעתיים)  והיא גם לא בודקת נוכחות\nהעבודה הסופית זה הצעה חופרת של הפרויקט שעשיתם.\n\nהשורה התחתונה: \nקורס לא מומלץ, השקעה ובסוף הרוב קיבלו 90 סתם כי הגרילו את הציון ככה. עדיף לעשות מבחן אמריקאי במלג אחר ולקבל 100", "timestamp": 1714470749601}, {"author": "SDG", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דינה רפאל וסיגלית קורן\n\nחוות דעת - הרצאות: בגדול, קורס די מונפץ. כל מפגש בדר\"כ ארך שעה וחצי רצוף, כשבחצי הראשון שלו דינה או סיגלית הרצו על משהו שקשור ליזמות, ובחצי השני שלו עבדנו.\n\nלאורך הקורס עובדים על פרויקט קבוצתי (במפגש הראשון מתחלקים לקבוצות, אז מציעה לבוא עם חברים כדי להנעים את החוויה). הסמסטר, הפרויקטים היו צריכים להתקשר לקיימות בקמפוס ול-SDGs, בשיתוף פעולה עם מרכז הקיימות בקמפוס. הוא כולל ממש בנייה שלו מאפס, תוך כדי ליווי של הסגל, והבאתו למצב של שגר ושלח.\n\nבעיקרון, אם לוקחים את זה ברצינות, אפשר לעשות משהו ממש מעניין, ואפילו תיאורטית הייתה לנו הזדמנות הסמסטר שקבוצה אחת תיבחר להשתתף בתחרות בינלאומית. הבעיה היא שדינה ציפתה לפרויקט חדשני מחוץ לקופסה, כשסיגלית מאידך ציפתה למשהו פרקטי יותר, והייתה ביניהן חוסר התאמה. דינה גם כמעט לא דיברה על יצירתיות או אושר, וגם החדשנות היא ספק יזמות.\n\nמה שכן, דינה מאוד אמפתית כך שאם צצות בעיות פרטניות במהלך הסמסטר היא מגלה כלפיהן הבנה. אז לדעתי באמת שאפשר לעשות מהפרויקט הזה דבר נפלא.\n\nהיה מפגש אחד שבו היה כמו מן מירוץ עם משימות בין הקבוצות, שהוא דווקא היה ממש יצירתי ונחמד והמחיש עבודת צוות. הקבוצות הזוכות גם קיבלו פיצה :) זה בהחלט היה המפגש הכי טוב בקורס.\n\nשעורי הבית: היו פעמים בודדות שהיינו צריכים לצפות בבית בסרטון כלשהו ולסמן במודל שצפינו בו.\n\nהמבחן: אין\n\nהשורה התחתונה: הקורס נורא מושפע מהאנשים שתהיו איתם בקבוצה, תבחרו אותה טוב. סה\"כ קורס נחמד בתור תוכנית ב' כזה.", "timestamp": 1714478368201}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דינה (לפעמים יש עוזרות)\nחוות דעת - הרצאות: \nלא לומדים חומר בקורס, מתחלקים לקבוצות (3-5 בקבוצה) ועובדים על פרויקט לאורך הסמסטר \nתמיד מסיימים מוקדם ולא לוקחת נוכחות (אבל לפעמים יש הצגה אז חייבים לבוא)\nלא מעניין ואף אחד לא יודע מה קורה/מה רוצים\nבלגן ובזבוז זמן\n\nשם המתרגל/ת: \nאין תרגולים\n\nשעורי הבית: \nמציגים כמה פעמים איך התקדמתם עד עכשיו בפרויקט שלכם\n\nהמבחן: \nאין, יש הצגה סופית בסוף הסמסטר + מגישים דוח מסכם (לא קצר!)\n\nהשורה התחתונה: \nלברוח! אין מלג יותר גרוע מזה\nאם לוקחים כי אין ברירה, תעשו את המינימום, וקצת פחות, חבל להשקיע, זה לא משפיע על הציון\nכן עמוס יחסית למלג\n\nהערה: הקורס השתנה, חוות דעת מסמסטרים קודמים לא רלוונטיות", "timestamp": 1714478973299}, {"author": "|", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: \nדינה נחמדה אבל הקורס פשוט נוראי\nהיה מפגש אחד שעשינו תחרות בין הקבוצות, זה היה הדבר הלא נוראי היחיד בקורס \n\nהמבחן: \nאין\n\nהשורה התחתונה: \nלא מסודר\nלא מעניין\nלא מוצלח\nלא לומדים כלום\nלא ברור מה צריך לעשות\nדורש השקעה ובסוף ציונים רנדומלים\n\nלא מומלץ בכלל!!!", "timestamp": 1714481303553}, {"author": "שולמן", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: בקושי יש הרצאות. זה בעיקר עבודה בקבוצות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש להכין מצגת אמצע.\n\nהמבחן: \n\nהשורה התחתונה: מל\"ג לא מומלץ בכלל. עושים איזשהו נושא מונפץ. אין כמעט מעקב וביקורת ואז בסוף הציונים הם יחסית נמוכים(90-95). אמנם אין כמעט השקעה והעבודה הסופית לא ארוכה, אבל הציון נמוך ולאמר את האמת הקורס בכלל לא מעניין. בקיצור לא ממליץ בכלל.", "timestamp": 1714717324719}, {"author": "*****", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ד\"ר דינה רפאל\nחוות דעת - הרצאות: \nהקורס בקיצור הוא תכנון פרויקט (עבודה בקבוצות)\nאין חומר, נפגשים בעיקר בשביל המעקב\n\n\nהשורה התחתונה: \nיש הרבה בעיות בקורס, אבל הבעיה העיקרית היא שלא משנה כמה משקיעים, לרוב מקבלים ציון לא טוב (למל\"ג).\nוהקורס דורש רמת השקעה מסוימת לאורך הסמסטר, וקצת יותר בסוף.\nדינה חייבת לעשות שינוי בקורס הזה, אי אפשר שימשיך הקורס בצורה זו, וממה שבנתי זה אותו דבר בקורסים אחרים שהיא מלמדת.\n\n\nלא מומלץ למי שמחפש מל\"ג עם ציון טוב\nלא מומלץ למי שמחפש מל\"ג ללא השקעה\nמתאים למי שרק מחפש מל\"ג כלשהו ולא אכפת לו בכלל מהציון", "timestamp": 1715073656805}, {"author": "צ'יקו חבר של דיקו", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "אל תקחו! \n\nהמל\"ג הכי גרוע שעשיתי. גם בכללי הקורס הכי גרוע שעשיתי. משעמם בצורה לא יאמן, חכו לתפוס מקום במלג אחר. אפילו אם זה לקחת את הקורס הזה או לא לקחת מלג, עדיף לא לקחת כלום. \n\nשוב אני כותב מלג לא מומלץ! אל תקחו!", "timestamp": 1716289758832}, {"author": ".", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nבחלק מההרצאות היה שיעור של חצי שעה בערך שמהווה איזשהו חלק בבניית הפרויקט ובשאר הזמן רק מתקדמים בבנייה של הפרויקט.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n-\nשעורי הבית: \nפעם ב נתנו איזה משימה קטנה לצפות בסרטון או למלא שאלון.\nהמבחן: \nאין\nהשורה התחתונה: \nבסמסטר הנוכחי היה צריך לבנות פרויקט בנושא שקשור לקיימות. לאורך הסמסטר המרצות מסבירות איך צריך להיות בנוי הפרויקט וככה מתקדמים בכל שיעור. יש הצגת אמצע והצגה בסוף ודוח שמגישים.\nהדעה שלי פחות פופולרית מהדעות בסמסטר הנוכחי.. אכן היה חוסר תיאום בין המרצות מבחינת הדרישות לפרוייקט כי אחת רצתה משהו יותר מפוצץ ומיוחד ופחות ריאלי והשניייה רצתה משהו יותר ריאלי וזה היה מעצבן איך שזה התנהל, אבל בסופו של דבר לא נדרשה השקעה גדולה מדי מעבר לשעות ההרצאה (לנו יצא לשבת על זה איזה שעתיים-שלוש מעבר לזמן של ההרצאות) ואפשר לקבל עם זה 90+.\nאולי הן יקחו לתשומת ליבן בסמסטר הבא איך להתנהל יותר נכון...", "timestamp": 1716563210152}]}