{"posts": [{"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ד\"ר יוחאי מקבילי\nחוות דעת - הרצאות: ההרצאות יחסית משעממות לחומר עצמו שיותר מעניין, סמסטר זום המרצה דורש נוכחות חובה ומצלמות פתוחות, מנסה לפתח דיון ושאלות עליהם הוא נותן בונוס בציון הסופי.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  אין - לפעמים הוא נותן לקרוא איזה טקסט לשיעור הבא אבל זה לא באמת חובה\n\nהמבחן: מבחן קשה יחסית, חלק מהשאלות פתוחות - הציון הם לאחר פקטור שהוא מראש אומר שיתן נקודות בונוס. מי שהיה נוכח בכל ההרצאות מקבל את הבונוס הגבוה ביותר, מי שנכח רק בחלק מקבל פחות או לא מקבל בכלל.\n\nהשורה התחתונה: החומר עצמו מעניין אך לא מועבר בצורה מעניינת, הציונים הם לאחר פקטור, צריך ללמוד למבחן משהו כמו יום וחצי - יומיים ואפשר לקבל את ה100 אחרי בונוסים, חשוב לנכוח בכל ההרצאות.", "timestamp": 1612340601147}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202001", "text": "שם המרצה:יוחאי מקבילי \nחוות דעת - הרצאות: \nהרצאות דיי משעממות, חובה הגעה, ובסמסטר זום הכריחו אותנו לפתוח מצלמה גם, בנוסף יש נקודה נוספת לציון הסופי על השתתפות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: \nהיה מורכב 80 אחוז אמריקאי במודל ו20 אחוז פתוחות, שאלות לא פשוטות בכלל, עם הרבה מקום ליפול בהם במיוחד באמריקאי, גם למי שלמד את החומר. היה 15 נקודות פקטור שעזרו לחצי מהקורס להגיע לציון טוב אבל לא לכולם.\n\nהשורה התחתונה: \nלא מומלץ ולא כדאי, לכו על מלג בטוח ולא מלג שיש בו סיכון עם מרצה כזה.", "timestamp": 1614670165174}, {"author": "ג", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "השורה התחתונה: האומנם ממוצע גבוהה, אבל המבחן לא פשוט, לא ממוחזר, ודורש למידה אמיתית (הממוצע לאחר ככל הנראה פקטור). \nאני לא ממליץ על הקורס למי שאינו מתחבר לחומר או לאופן בו הוא מועבר.", "timestamp": 1616316702644}, {"author": "Amit Kfir", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ד\"ר יוחאי מקבילי\nחוות דעת - הרצאות: מעניינות למי שבא ללמוד ולשמוע באמת, אבל לפעמים הפואנטה לא ברורה\n\nהקורס עמוס בחומר ודורש קריאה מעבר למה שהמרצה מדבר עליו בכיתה, צריך לזכור כל פרט ושורה מהקבצים במודל, ויש הרבה מהם כשכל אחד הוא בין 20 ל-40 עמודים\n\nהמבחן: יורד לפרטים, שואל שאלות על הדברים הכי קטנים מהחומר, דורש בקיאות לא הגיונית בכל מה שנלמד וגם מה שלא נלמד בכיתה אלא כתוב בחומר הנוסף\n\nהשורה התחתונה: קורס עם דרישות ממש גבוהות בשביל מלג, דורש הרבה יותר למידה למבחן ממה שהגיוני, כמות עצומה של חומר. לא מומלץ", "timestamp": 1656578682953}, {"author": "חילזון הפרא", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: \nבסך הכל סבבה, לפעמים מעניין יותר לפעמים פחות\n\nהמבחן: \nצריך ללמוד למבחן, יש קבצי סיכומים יחסית טובים ולעבור על הטקסטים שיוחאי ציין. בסוף גם היה פקטור למי שהיה נוכח בכל ההרצאות\nהשורה התחתונה: לא מלג קשה מדי אבל אל תזלזלו במבחן", "timestamp": 1657012787112}, {"author": "כ", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יוחאי מקבילי\nחוות דעת - הרצאות: הרצאות מעניינות, והוא מנסה לפתח דיונים סביב החומר.\n\nהמבחן: צריך לזכור אליו הרבה טקסט, קשה יחסית למלגים. חלק אמריקאי מאוד סביר וחלק פתוח די קשה, למרות שנראה לי שהייתה בדיקה הוגנת ומקלה.\nלמרות זאת המלג אפילו הוריד ממוצע לחלק מהאנשים.\n\nהשורה התחתונה: קורס חביב אבל אם אין לכם רקע קודם בעניינים האלה הוא הרבה יותר מסובך וקשה.", "timestamp": 1657269671867}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יוחאי מקבילי\nחוות דעת - הרצאות: לא כל כך מנסה לפתח דיון כמו שאמרו בביקורות. יש לו גישה מסוימת וזה מה שהוא מעביר. אני לא כל כך רואה בזה קורס פילוסופיה. נוכחות חובה עם קוד שנותן בכיתה וקריאת שמות אקראית. נותן להשלים שיעורים בצורה של מבחן בעל פה על השיעור הקודם, בד\"כ שאלה אחת.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: מבחן חצי פתוח חצי אמריקאי, דורש חשיבה. התשובות לא נמצאות בהכרח בסיכומים, וקשה להבין לפעמים לאן הוא חותר. דורש היכרות ממש טובה עם הרבה טקסטים שלא בהכרח קראנו בכיתה (ברמת ציטוט לפעמים, או שימת לב לשורה מסוימת) לקראת המבחן. שאלות האמריקאיות חלקן ממוחזרות וחלקן קשות, אבל אם בחלק הפתוח הוא רואה שלמדת למבחן באמת הוא מעגל ל100, למרות שלפי הפקטור שהוא אמר שיהיה (שתלוי בנוכחות, מי שהיה בהכל 8 נקודות ומי שהחסיר 1 4 נקודות) היה אמור להיות פחות. בסוף החציון עדיין 100.\n\nהשורה התחתונה:", "timestamp": 1657782163179}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nיוחאי מקבילי\nחוות דעת - הרצאות: \nהרצאות די מייגעות. בבירור המרצה הוא אדם מוכשר וחכם, אך מיומנות הלימוד דורשת שיפור רב. אין קו רציף בלימוד, הרבה פעמים אופי העברת החומר אסוציאטיבית והבנייתו אינה ברורה, למרות שלפי דעת המרצה החומר מסודר למהדרין. ניכר שהוא תמיד בלחץ להספיק את החומר, וכשאנשים שואלים שאלות התחושה שלהם היא שהם על זמן קצוב - אין מקום לפתיחת דיון ולהעלאת רעיונות חדשים, מבחינתו התשובות הן אבסולוטיות, ולכן לכל המתעניין - לא מדובר בקורס אקדמי בכלל -הלימוד נעשה ללא ניתוק מתוך השקפת עולם עמוקה, חסרה הביקורת האקדמית, והיא נדרשת עד מאוד, בייחוד כשהעיסוק הוא בתחום הפילוסופיה.  לטענתו, הוא מלמד מתוך התנדבות ורצון אמיתי, וזה ראוי להערכה. יחד עם זאת, אני חושב שאנשים יקחו איתם הרבה יותר מהקורס אם החומר יהיה יותר ממוקד,  ולא כשהניסיון הוא לגדוש את הסטודנט בחומר, באובססיביות לכל רגע דל לא מנוצל (גם יש לקחת בחשבון - שאתר הקורס שופע בחומרי קריאה באופן מוגזם).  על זה נאמר \"תפסת מרובה לא תפסת - תפסת מועט תפסת\". כפי שנראה עכשיו - למרות העידוד לפידבק מצד המרצה, הערכתי שהקורס לא ישנה את פניו כי די ברור שהוא בטוח בדרכו. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \nשעורי הבית: \nהמבחן: \nמבחן שנכנס לפרטים שוליים, ולא בודק את העיקר. החומר אליו הוא אינו פרופורציונלי לקורס מל\"ג ואקלקטי מאוד. אני בטוח שסטודנטים רבים התקשו בהתמודדות עם החומרים הכתובים, לא לכולם יש את המיומנות והכלים להתמודד איתם. הממוצע גבוה לאחר \"מייק אפ\" של הציון, והוא אינו מהווה בהכרח מדד למעורבות הסטודנט וניסיונו להבין את הרעיונות העיקריים (שלא תמיד ברור מה הם) שעומדים מאחורי הקורס. המבחן יכל לעשות הרבה יותר חסד עם הסטודנט אילו היה בודק אם התמונה הכללית מובנת, ולא אם הוא זוכר חלקי משפטים מאחד הטקסטים.", "timestamp": 1658729582351}, {"author": "יעל", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות: מאוד מעניינות!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש עבודה וקבוצת דיון.. קצת חופר אבל נחמד\n\nהמבחן: לא קשה..\n\nהשורה התחתונה: אחלה של קורס! מאוד מעניין ויש שם מלא דברים שלקחתי לחיים שלי!", "timestamp": 1673122019369}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר. יוחאי מקבילי\nחוות דעת - הרצאות:  עמוסות, בלי הפסקה, אין הרבה מקום לשאלות של סטודנטים. אבל הוא סך הכל קריזמטי, ולמי שמתעניין בפילוסופיה וגישה חדשה לדת, אז מומלץ. \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: \n\nהמבחן:  יש בוחן אמצע סמסטר שזה עבודה ועליה הוא שואל שאלות בעל פה. וגם מבחן סופי. צריך להתכונן היטב, לקרוא, הוא ישאל שאלות עמוקות. המבחן הוא מקריאה של החומר והקשבה בהרצאות. שוב לא ממש פשוט, אבל אפשרי. \n\nהשורה התחתונה: לא הכי פשוט, אבל למעוניינים בפילוסופיה-דת אז מומלץ.", "timestamp": 1679235888517}, {"author": "adir blajwas", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוחאי מקבילי\nחוות דעת - הרצאות: \nיוחאי מרצה מעולה אני מאוד נהניתי מההרצאות הן היו מרתקות. יוחאי בעיקר מדבר ומלמד על הפילוסופיה של הרמבם הוא כן מאוד מעודד השתתפות בהרבה חלקים . אך מי שמצפה לדיונים פילוסופיים בכל נושא זה לא בשבילו. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש באמצע סמסטר עבודה אחת שהיא 50 אחוז מהציון והיא לא קשה בכלל רק דורשת להיות רציני\nהמבחן: \nלא הכי קל דורש ללמוד קצת אבל ממש לא בשמיים . בנוסף יוחאי בודק אותן בעין טובה ונותן בונוסים אז בשורה התחתונה הציונים מאוד גבוהים בקורס\n\nהשורה התחתונה: \nשווה מאוד למי שאוהב פילוסופיה ויהדות", "timestamp": 1679561958129}, {"author": "איתן זינו", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nיוחאי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \n\nהשורה התחתונה:  לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת! לא לקחת!", "timestamp": 1712079706255}, {"author": "Kernel SVM", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "חוות דעת - הרצאות:\nיוחאי\nשעורי הבית:\nאין\nהשורה התחתונה: לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת! לקחת!", "timestamp": 1712851777766}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יוחאי מקבילי\nחוות דעת - הרצאות: \nיוחאי רץ על החומר כי הוא מנסה להספיק המון במעט זמן. נקודה לטובתו במהלך הסמסטר הוא העביר בינינו פתקים על מנת שנרשום לו איך הוא יכול להשתפר כי במשאל מרצה זה כבר מאוחר מידי לנו, והוא יישם חלק מהדברים שאמרנו. מבחינת חומר יש מלא חומר במודל והוא מצפה שתקראו את הכול לשיעורים ולמבחן (היו שאלות במבחן שהיו רק בחומר קריאה ולא הועברו בהרצאות וגם במהלך השיעורים שאל על החומר קריאה לפעמים כבונוס לפעמים סתם שאלה)\n\nשם המתרגל/ת: אין תרגולים\nחוות דעת - תרגולים: אין תרגולים\n\nשעורי הבית: \nאין שיעורי בית, יש אפשרות להגיש בונוסים שנותנים נקודות לציון הסופי (לפעמים שאל שאלת בונוס בכיתה לפעמים שלח מייל עם שאלה להגשה בכתב לאחר שביקשנו שתהיה אפשרות לבונוס גם למי שלא רוצה לענות בכיתה, כן אציין שאלו שהיו במייל יכלו גם להוריד ניקוד אם ענית שטויות גמורות וללא ביסוס על חומר, כנ\"ל לגבי השאלת בונוס במבחן).\nהסמסטר לא היה בוחן אמצע/עבודת אמצע בגלל המלחמה.\n\nהמבחן: \nהיה מלא חומר ללמוד למבחן, דיי עמוס למל\"ג. יוחאי נתן דגשים בשעת קבלה אבל היא הייתה רק בלילה לפני המבחן. המבחן היה סה\"כ שעה, 16 שאלות אמריקאיות בחצי שעה הראשונה ו3 שאלות פתוחות + שאלת בונוס בחצי שעה השנייה, באופן מפתיע כן היה אפשרי לענות על המבחן בזמן המוקצב. לפי מה שראיתי מהממוצע יוחאי בדק את המבחנים בעין טובה והוא הוסיף פקטור על הגעה לשיעורים (אם הגעת 11 שיעורים 2 נקודות ואם 12 4 נקודות)\n\nהשורה התחתונה: \nיש בו הרבה חומר, והמבחן דורש למידה עמוקה (לא מספיק רק להגיע לשיעורים צריך לקרוא את כל החומר במודל, סיכומים ולראות שאלות עבר כי לפעמים שואל על פסוקים מסוימים) הייתי לוקח רק אם אתה באמת מתעניין בפילוסופיה של הרמב\"ם, ועוד משהו לקחת בחשבון - הרבה פעמים יוחאי דיבר בשפה דיי גבוהה, אז אם אתה לא דובר עברית כשפת אם הייתי מוסיפה את זה לשיקולים.", "timestamp": 1713634570209}, {"author": "_", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוחאי\nחוות דעת - הרצאות:\nיוחאי אחלה. ניכר שהוא מחובר לנושא ומעביר אותו מתוך תחושת שליחות. מנסה לעורר דיון. ההרצאות היו שעה וחצי רצוף (לבקשת הסטודנטים). \nיש חובת נוכחות. קוד בתחילת כל שיעור ובסוף השיעור לפעמים הוא קורא אליו סטודנטים לבדוק נוכחות רנדומלית.\n\nשעורי הבית: \nאין.\n\nהמבחן: \nחלק אמריקאי של 16 שאלות, סה\"כ 72 נקודות. חלק שני של שאלות פתוחות שהוא הכווין אותנו מה יהיו הנושאים בשעת שאלות ותשובות שהיו לפני המבחן.\nהוא כל הזמן חוזר על זה שצריך לקרוא הרבה חומר בבית ולמבחן - לא מצאתי לזה הצדקה. קראתי כמה מהסיכומים שרצים בין הסמסטרים וזה די הספיק. כמובן לעבור על שאלות ממבחנים כי היו כמה דומים מאוד.\n\nהשורה התחתונה: אין צורך להלחץ מההפחדות של יוחאי על כמות החומר. יומיים למידה + הקשבה בשיעורים מביאים לציון טוב מאוד (חשוב לציין שאני התחברתי לחומר אז זה זרם יותר).", "timestamp": 1714668701248}]}