{"posts": [{"author": "ר", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: ההרצאות מאוד מלמדות וכוללות זמן שיחה שמדברים רק בסינית כך שלכל אחד יש זמן להתאמן.\n\nשם המתרגל/ת: ללא\nחוות דעת - תרגולים: \n\nשעורי הבית: קצרים אך חשובים\n\nהמבחן: יש מבחן בכתב ומבחן בע\"פ שצריך ללמוד אליהם אבל מתאימים לרמה של הקורס.\n\nהשורה התחתונה: קורס מומלץ למי שטוב בשפות אך כדאי מאוד ללמוד במהלך הסמסטר כי אחרת ההרצאות לא מועילות וקשה להשלים את הפער.", "timestamp": 1627925901818}, {"author": "שי ג'יפינג", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: מושלמת. כל מילה נוספת מיותרת. אחת המרצות הטובות ביותר שהיו לי בתואר!\n\nשעורי הבית: יש עם תאריך הגשה גמיש וזה נותן ציון מגן טוב, סה\"כ אם לא עושים אז לא יודעים את החומר ממש\n\nהמבחן: חצי מבחן בכתב חצי בע\"פ ואפשר לעשות מצגת על סין שזה נותן חמש נקודות בונוס למבחן\n\nהשורה התחתונה: מומלץ ושווה מאוד, מקצוע מושלם עם מרצה מושלמת!", "timestamp": 1657183879405}, {"author": "George", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה:  אביטל \n פשוט מלכה, מסבירה טוב ומשתדלת לא להעמיס על הסטודנטים ומנסה לעשות את השיעורים כמה שיותר כיפיים.\n\nשעורי הבית: (מקבלים 100 רק על הגשתם)\nשניים ל3 שבועות בערך, לא ארוכים מידי אבל ממש חשובים להבנת החומר.\n\nבוחן אמצע: (ממוצע 96)\nלא קשה, הבנת הנשמע בדיוק מה שלמדנו בכיתה ללא שינויים בכלל, והתרגום מסינית לעברית לא משהו כזה קשה אם אתם משתתפים בשיעורים.\n\nהמבחן:  (ממוצע בעל פה 98    ממוצע  מבחן כתיבה 92)\nאביטל אוהבת להביא טריק כלשהו במבחן שלא למדנו אותו בכיתה כדי לבחן יצירתיות אבל המבחן סה''כ קליל.\n\nמצגת בונוס: (+5 נקודות לציון הסופי!)\nלא משנה כמה אתם מפספסים בשאר הקטיגוריות, אם אתם מגישים את המצגת יש לכם 100 בסופי, ממולץ בגדול אך לא חובה.\n\nציון סופי:\n30% תרגילי בית\n20% בוחן אמצע (מגן)\n50% מבחן סופי (25% בעל פה ו25% כתיבה)\n\n אין היסטוגרמה כי מספר הסטודנטים קטן מ10, אבל הממוצע הכללי היה 98, קורס ממולץ בחום!", "timestamp": 1657523709847}, {"author": "Adi", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: אביטל מושלמת, ההרצאות שלה מסודרות נכון. בתחילת כל הרצאה בדרך כלל יש 10 דק של רק סינית. מדברים ושומעים סינית אחד עם השני בהנחייתה של אביטל. לומדים מילים חדשות פעם בשבועיים, מתרגלים בשיעור לאחר מכן את המילים החדשות וגם המילים הקודמות. ממליצה להגיע לכל ההרצאות. עוברים גם על דקדוק סיני. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל שבוע, אין ציון (רק הגיש/לא הגיש) אבל אביטל מחזירה משוב עם תיקונים. הש\"ב חשובים לתרגול והבנה של השפה. לא קשים ולא ארוכים.\n\nהמבחן: שלושה חלקים: \nשמיעה: הקראת 4 משפטים בסינית מהירה, וצריך לכתוב תרגום של שלושה. אביטל בחרה משפטים הוגנים ולא קשים מדי. \nבכתב: יש טקסטים שצריך לתרגם, לפעמים שאלות על הטקסטים, ויש חלק דיקדוקי וחלק עם השלמת מילה חסרה. חייב לדעת את כל הסימניות, יש בערך 120 בסמסטר השני, וצריך לדעת את בערך 100 מהסמסטר הראשון. המבחן היה פייר. \nשיחה: זה בוחן גם שמיעה וגם דיבור, בעיני החלק היותר קשה. אביטל מדברת מהר יחסית, אבל אם צריך, היא חוזרת מספר פעמים עד שמבינים מה היא שואלת/אומרת. פשוט צריך לתרגל הרבה גם דיבור וגם שמיעה.\n\nהשורה התחתונה: אביטל מושלמת❤️, סינית זה קשה.", "timestamp": 1689586537580}]}