{"posts": [{"author": "ד", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: \nמרצה ממש ממש טובה ומעניינת. מאוד משתפת ומעודדת דיון פתוח והצגת דעה אישית. היא גם ממש נחמדה ובאה לקראת הסטודנטים. אני בתואר של מדעים מדוייקים וזה היה הקרוס הכי מעניין שלקחתי בינתיים בזכותה.\nנוכחות חובה.\n\nשעורי הבית: סוג של אין, היא מבקשת שנקרא דברים לפני ההרצאות אבל זה ממש לא קריטי והיא גם יודעת שהרוב לא קוראים לכן עוברת על כל הדברים החשובים בכל מקרה.\n\nהמבחן: שני בחנים אמריקאים של 6 שאלות במהלך הסמסטר. השאלות די טריקיות ולפעמים לא מנוסחות הכי טוב אבל היא נתנה לנו גם אפשרות להגיש 2 עבודות קצרות, סדר גודל של עמוד, כתחליף לכל אחד מהבחנים, עם 10 נקודות בונוס על הגשה לפני שהיא מלמד את החומר, אם הלך לך לא טוב באחד מהם וגם עבודה מראש לסוף הסמסטר עבור 20% בונוס.\n\nהשורה התחתונה: ממש ממש מעניין וכיף ואפרת ממש מתחשבת ויודעת שהציונים אמורים לעלות את הממוצע ובאה לקראת הסטודנטים.", "timestamp": 1710753522498}, {"author": "Yousef Alwan", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: \nהמרצה הכי טובה שיש, מלמדת בשיטה מאוד טובה ומעניינת, ממש ההרצאות לא משעממות איתה אלא מאוד מעניינות. והיא מאוד מתחשבת בסטודנטים, ומבינה ומבינה שלוקחים קורסים כאלה בשביל להעלות את הממוצע\n\nשעורי הבית: \nאין שיעורי בית, ולא באמת צריך להכין דברים לפני שיעורים, היא עוברת על הכל ומלמדת ממש טוב.\n\nהמבחן: \nשני בחנים של שאלות אמריקאיות (50% של כל בוחן), שהתקיימו באמצע הסמסטר ובשיעור האחרון. השאלות טריקיות, וקל לטעות בהם(וכל טעות עולה הרבה), ולכן היא עשתה עוד 2 מטלות, ממש קלות כתחליף לשני הבחנים, וחישבה בציון הסופי את הציון הגבוה מביניהם. בנוסף לעוד מטלת בונוס של 20 נקודות למי שיצטרך.\nהשורה התחתונה: \nממש מעניין, וקל להוציא ציון בו, והמרצה ממש דואגת לסטודנטים ומנסה לעזור כדי להוציא ציון טוב.", "timestamp": 1712270570582}, {"author": "ניב המלך 123 שליט המיקמק", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אפרת רם טיקטין\nחוות דעת - הרצאות: מרצה מעולה, מעבירה את השיעורים בצורה שגורמת לך לחשוב לעומק. השיעורים מועברים בכיתה בצורה שכל אחד יכול להתבטא, ומרגיש שקיים שיח אמיתי עם הקשבה בכיתה. כמו כן, הנושא של הקורס סופר מעניין בעיניי, לא הייתה פעם אחת שחיכיתי לסוף ההרצאה.\n\nשעורי הבית:  אין תרגילי בית. לפעמים היא אומרת לקרוא משהו לפני השיעור אבל בתכלס לא צריך ואף אחד לא עושה את זה\n\nהמבחן: הסמסטר שלנו היה די ניסיוני. בגלל שהכיתה הייתה גדולה ולמרצה לא היה כוח לבדוק מיליון עבודות היא החליטה שיתקיימו שני בחנים שירכיבו את הציון הסופי + מטלה אפשרית לבונוס של 20 נקודוץ. הבחנים התגלו ככישלון לאחר שבבוחן הראשון היה ממוצע 56 ובשני היה 61. הבחנים היו מכשילים בלשון המעטה - גם אם ידעת את החומר יכולת ליפול על ניסוח לא טוב של השאלה (ולכל שאלה היה משקל רציני) בעקבות הממוצע הזוועתי המרצה הבינה שזה לא יכול להיות ככה, לכן היא נתנה אפשרות להגיש עבודות קצרות של עד עמוד, כאשר הציון הגבוה מבין הבוחן לעבודה הוא זה שיינתן. בשתי העבודות קיבלתי 100 ללא יותר מדי מאמץ, וזה בלי להתחשב בבונוס של 20 הנקודות.\n\nהשורה התחתונה: ה100 הכי קל בקיום, הרצאות סופר מעניינות עם לחץ דם גבוה מאוד אחרי הבוחן הראשון. 9.9/10", "timestamp": 1712328790721}, {"author": "AI", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אפרת רם טיקטין\nחוות דעת - הרצאות: ממש מעניינות בעיני. אפרת כריזמטית ומפשטת חומר מורכב - גישות אתיות פילוסופיות - בדרך שאדם פשוט יכול להבין אם מקשיבים ועוקבים. נותנת הרבה מקום לשאלות ודיונים שעולים מהסטודנטים ומתייחסת לכל אחד.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: היו 2 מטלות שהיה אפשר לעשות במקום הבחנים. קריאה של כ-20 עמודים וכתיבה של עמוד בערך - די סביר. הייתה אפשרות להגיש מטלות בונוס בהיקף דומה שיכולה לתת עד 20 נקודות נוספות לציון.\n\nהמבחן: 2 בחנים אמריקאיים. הממוצע בבוחן הראשון היה מאוד נמוך אז אפרת אפשרה להגיש עבודה במקום הבוחן. הבחנים די מבלבלים אבל אם יודעים את החומר ולומדים יום-יומיים לפני לדעתי אפשר להוציא ציון טוב.\n\nהשורה התחתונה: מאוד מומלץ למי שאוהב את התחום או סתם מחפש מל\"ג מעניין וללמוד דברים חדשים. לי היה כיף לבוא לשיעורים.", "timestamp": 1713463831174}, {"author": "vjdz", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אפרת\nחוות דעת - הרצאות: לא יצא לי להתעסק בתחום של אתיקה לפני הקורס ולכן היה די מעניין. אפרת העלתה הרבה דוגמאות לדיון בכיתה ולכן השיעורים הרגישו דינאמיים ומעיניים.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: 2 מטלות כתיבה של עמוד כל אחת + מטלת בונוס למי שרוצה. ישבתי כשעה על כל מטלה (הן דרשו קצת קריאה), השתמשתי בGPT בכל הכח והוצאתי 100 בשתי המטלות.\n\nהמבחן: שני בחנים, כל אחד 50%. הבוחן הראשון היה מבלבל ולכן הממוצע היה 56, אך ישר אחרי האירוע אפרת נתנה אופציה להחליף את הציון במטלת כתיבה.\n\nהשורה התחתונה: קורס מומלץ", "timestamp": 1713692899947}]}