{"posts": [{"author": "ירון", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ירון\nחוות דעת - הרצאות: אחלה של מרצה, מעניין מאוד ומעשיר את הידע \n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש כל שבוע תרגיל בית שבהרצאה עוברים עליהם \n\nהמבחן: מבחן מחולק ל4 חלקים, תרגום מעברית לערבית, וההפך. חלק ג׳ זה משפטים משיעורי בית שצריך לתרגם לעברית וחלק ד׳ זה בונוס- ברכות. מה המשמעות והפירוש\n\nהשורה התחתונה: מי שלא מגיע עם ידע קודם או לא למד בכלל ערבית אז שימו לב שהקורס מצריך הרבה השקעה ולזכור ולשנן מילים ודגשים( שדה) . מי שיש לו ידע קודם( בגרות, צהל) ככל הנראה יקבל מעל 95 ....", "timestamp": 1678789994136}, {"author": "מישהו", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ירון פרידמן\nחוות דעת - הרצאות: \nהרצאות מעניינות ואוצר המילים והדקדוק שלומדים עוזרים לנהל שיחה בסיסית בערבית. הנושא הנלמד הוא ערבית מדוברת ולכן לומדים בתעתיק עברית ולא לומדים אותיות ערביות. חסרון שזה ב8:30.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשיעורי הבית: יש שיעורי בית כל שבוע לפתור איזה תרגיל או 2 לתרגם משפטים מעברית לערבית, קצת מוסיף עומס בסמסטר עמוס אבל לא נורא סה\"כ.\n\nהמבחן: \nיחסית קשה לקורס הומני (גם אם זה שפות שאמור להיות פחות קל מהאחרים). אם עוברים ממש אבל ממש טוב על המיקוד אז אפשרי לגמרי לקבל 95+, אבל למידה חפיף של יומיים כמו רוב המלגים לא תספיק פה. יש גם דברים במבחן שלא הופיעו במיקוד אז לא להסתמך על זה בלבד.\n\nהשורה התחתונה: \nקורס מעניין סה\"כ אבל לא מהמלג\"ים הקלילים. אם יש לכם עניין ללמוד לדבר ערבית ויש לכם סמסטר לא כזה עמוס סה\"כ אז זה מומלץ בשבילכם.", "timestamp": 1679227284335}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ירון פרידמן\nחוות דעת - הרצאות: ההרצאות מאוד קלילות ונחמדות, ירון מספר בדיחות ומלמד מילים בצורה נחמדה. אווירה מאוד טובה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: לא הרבה בכלל, בדרך כלל שלושה תרגילי בית לשבוע העוקב שבו מתרגמים מערבית לעברית, מעברית לערבית והשלמה של מילה בשורה.\n\nהמבחן: מורכב ממילים ומשפטים שהם מתרגילי הבית במהלך הסמסטר עצמו. גם לא מסובך כל כך\n\nהשורה התחתונה: קורס חביב ולא מעמיס, במיוחד אם יש לכם רקע.", "timestamp": 1689077769949}]}