{"posts": [{"author": "תומר", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ליעד נים \nחוות דעת - הרצאות: \nההרצאות מאוד מעניינות וליעד מסביר בצורה מאוד טובה על המשבר ועל הסכנות שהוא יגרום לנו, ומנסה ליצור דיונים תורמים עליהם. הוא מדגיש כמעט בכל נושא חדש על מה הוא ישאל במבחן אז כדאי להיות די קשובים בהרצאות. \n \nשעורי הבית: אין\n\nהמבחן: זה היה פעם ראשונה אז אין מבחנים קודמים, אבל חוץ משאלה אחת שצריך היה לדעת את ריכוז הco2 באוויר מתישהו לא היה קשה ודי מספיק רק להיות בהרצאות ולעבור על החומר זריז יום לפני\n\nהשורה התחתונה: מומלץ", "timestamp": 1603178955462}, {"author": "idooi sarel", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ליעד נים\nחוות דעת - הרצאות: \nמעניינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: די פשוט\n\nהשורה התחתונה: אחלה קורס ונושא חשוב", "timestamp": 1612606495730}, {"author": "גרטה", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  ליעד נים\nחוות דעת - הרצאות: מאוד נעים ובעל יכולות ורבליות טובות.\nנוכחות חובה, אולם אין חובה לפתוח מצלמות\\להשתתף בדיון.\nהמרצה נמצא בקנדה, אז כנראה שהמל\"ג ימשיך להיות מועבר בזום.\nאין שעורי הבית.\n\nהמבחן: אמריקאי, השאלות קצת יותר כמותיות מאשר איכותיות, אבל אפשר לגמרי ללמוד באותו יום\\יום לפני ולקבל 90-100. ב\"ה המבחן ימוחזר לדורות הבאים.\n\nהשורה התחתונה: \nמל\"ג משמעותי ולא קל להכלה, אבל חשוב מאוד לדעת ולא לחיות בשקר.", "timestamp": 1613839366069}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ליעד נים\nחוות דעת - הרצאות: \nמרצה מעולה, מסביר טוב ונעים, מעביר את העובדות מגובות עם מחקרים ועונה גם לכל טענות הנגד הנפוצות, בודק כל הרצאה מה שלומנו ומשתדל שנצא עם תחושה יחסית טובה כי הנושא באמת כבד וחשוב אבל הוא מעביר את זה נעים ואכפתי ומשתדל לתת תחושת מסוגלות בנושא ולא להכביד בלי שיהיה ניתן לעשות שום דבר.\n\nשעורי הבית: הייתה מטלה אחת של 10 נקודות שלא לוקחת יותר מדיי זמן חצי שעה - שעה גג אם משקיעים. קיבלתי בה 100 מניחה שהרוב ככה.\n\nהמבחן: די פשוט, ממוחזר משנים קודמות כן דורש לזכור קצת מספרים וזה אבל סך הכל לא מסובך ללמוד אליו והשאלות חוזרות על עצמן.\n\nהשורה התחתונה: קורס מעולה, בנוי טוב מסביר מהבסיס על הנושא וחשוב מאוד. ממליצה לכל מי שיש לו טיפה של עניין בנושא האקלים או שבא לו להעמיק קצת יותר במסגרת מל\"ג שגם לא דורש יותר מדיי. הבנתי שליעד לא מעביר יותר את הקורס אז אם יהיה מרצה אחר זה יכול לשנות את הקורס כי ליעד היה מצוין והיה כיף לבוא להרצאות שלו, אפילו שלא תכננתי להקשיב תמיד בסוף יצא שהקשבתי לכל ההרצאות.", "timestamp": 1656352137205}, {"author": "האננס", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ליעד נים\nחוות דעת - הרצאות: מרצה מקסים עם הרצאות מעולות.\nליעד בחור מאוד נעים ומאוד חביב שממש אכפת לו מהמקצוע.\nהקורס עשיר בידע ומאוד מלמד.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: יש מטלת כתיבה של 10 נקודות, לא קשה בכלל ואפילו מאוד מעניינת.\nהמטלה לא דורשת הרבה זמן בכלל ומטרתה למנוע מסטודנטים להיות פסיבים במהלך הסמסטר. \nלמדתי המון מהמטלה הזו ודרשה סך הכל שעה-שעה וחצי השקעה. \nלפי דעתי כל מי שלא זרק לגמרי קיבל 100 על המטלה.\n\nהמבחן: ממש על החומר, צריך לשלוח את ליעד להעביר קורס למרצים אחרים איך לכתוב מבחן שבאמת שואל שאלות על החומר שנלמד.\nדיי משוחזר.\n\nהשורה התחתונה: קורס מאוד מעניין ומלמד.\nלפי דעתי צריכים להפוך את הקורס הזה לחובה, מלמד בצורה מרתקת את כל הבעיות שאנו כבני אדם גורמים לכדור המקסים שאנחנו חיים עליו.\nנ.ב. למי שבכלל לא בקיא בנושא משבר האקלים והתחממות גלובלית עלול להיות קורס מאוד מאוד מדכא.", "timestamp": 1658655242774}]}