{"posts": [{"author": "אני", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אביטל בינה-פולק\nחוות דעת - הרצאות: מרצה מעולה. הגעתי להרצאות למרות שהסמסטר הן הועברו בזום ולא הייתה נוכחות חובה. מעבירה את השיעור בכיף ותמיד מעודדת דיונים והשתתפות סטודנטים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש קצת שיעורי בית, שזה אולי מבאס בשביל מל\"ג, אבל הם לא נוראיים במיוחד. צריך להקדיש גג שעתיים בסה\"כ כל הסמסטר בשביל לקבל את כל הנקודות עליהם.\n\nהמבחן: המבחן הוגן. מי שהיה קשוב בהרצאות מספיק שיעבור איזה פעם אחת על סיכום של החומר יום לפני הבחינה בשביל 100. הניסוח של כמה שאלות לא היה מדהים, אבל ניתן היה לפנות לאביטל שהבהירה אותן.\n\nהשורה התחתונה: הייתי ממליץ על הקורס לכל מי שלא אכפת להקדיש שעתיים נוספות במשך הסמסטר לשיעורי בית. קל לקבל ציון גבוה והקורס עצמו מעניין.", "timestamp": 1600007404482}, {"author": "idan fischman", "difficultyRank": 1, "generalRank": 2, "semester": "201902", "text": "* עשיתי בסמסטר מקוון, יכול להשתנות במקרה ויהיה פרונטלי.\n\nשעורי הבית: \nהיה צריך לכתוב תגובה למאמרים שהיא פרסמה, משהו כמו  5 פעמים בסמסטר. משימה של כמה דקות, ולרוב מקבלים את מירב הנקודות על מה שרושמים. למרות שהיא באמת קוראת את זה.\n\nהמבחן: \nלנו היה מבחן טריקי, עם חלק מהשאלות שהיו ממוחזרות ממהלך השיעורים. היא משתדלת לחזור כמה פעמים על מה שחשוב למבחן ושואלת על זה, אבל המבחן לא היה 100 וודאי.\n\nהשורה התחתונה: \nאל תקחו אותו בשביל מל״ג של 100, אלא אם זה מעניין אתכם", "timestamp": 1600780734973}, {"author": "Michal Alexandrov", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אביטל \nחוות דעת - הרצאות: \nמעבירה את ההרצאות בצורה מעניינת ומעודדת דיונים.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין שיעורי בית\nהמבחן: \nאמריקאי וקליל. מספיק לקרוא סיכומים ולעבור על בחנים יום לפני כדי להיות מוכן ולקבל ציון טוב\nהשורה התחתונה: קורס מומלץ ומעניין", "timestamp": 1601374627169}, {"author": "Mao Zedong", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: ההרצאות היו ממש מעניינות- אביטל מרצה מעולה, ויודעת להעביר את הנושא בצורה ממש טובה. \n\nשעורי הבית: היו כמה פורומים שבהם היה צריך להביע דעה על כתבה או נושא מסויים (לדעתי היו סה\"כ 12% מהציון), והייתה אפשרות לענות על 3 סקרים בשביל מחקר (על כל סקר שענית היו בערך 3% , והיה אפשר לענות רק על חלק. לדעתי אביטל אפשרה למי שלא רצה לענות על הסקר לקבל איזו משימה אחרת, אבל היה אפשר גם שזה פשוט יצטרף לאחוז של המבחן). בנוסף, בחלק מהשיעורים היה קאהוט, שמי שענה על 4 מתוך 5 נכון קיבל נקודה נוספת לציון הסופי (פר קאהוט).\n\nהמבחן: המבחן היה סבבה, סה\"כ הוגן... היו כמה שאלות מבלבלות, אבל הציון היה סבבה למל\"ג.\n\nהשורה התחתונה: אחלה מל\"ג, מעניין יחסית ודי מומלץ.", "timestamp": 1607385427775}, {"author": "Ido Frankel", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: \nהרצאות מעניינות, אביטל מרצה מעולה.\n\nשעורי הבית: \nבסמסטר שלו, היו 8 פורומים שמתוכם היה צריך לענות על 5 ( היוו 20% מהציון בקורס).\n\nהמבחן: \nסמסטר קורונה, היה פרויקט במקום מבחן, מבאס אבל לא נורא כל כך. היא פרסמה את הדרישות לפרויקט בסביבות שבוע 5, אז היה מלא זמן לעשות ולסיים את זה מוקדם.\n\nהשורה התחתונה: אחלה קורס, ממוצע טוב, ויש סיכום טוב ולא ארוך במקרה ויש מבחן ולא פרויקט.", "timestamp": 1611919773499}, {"author": "יואב מאירי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: מעניינות ממש\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: היה פרוייקט סיום (בדרך כלל יש מבחן), לא דורש יותר מדי מאמץ\n\nהשורה התחתונה: אחלה מלג, קליל ומעניין", "timestamp": 1612898332127}, {"author": "ס", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: הרצאות מעניינות למי שאוהב- דיברנו על היסטוריה והיו דיונים, לפעמים פילוסופיים יותר ולפעמים פוליטיים. בכל הדיונים המרצה שמרה על כבודם של כל הסטודנטים, לכן הדיונים היו מלמדים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: פרסום פוסט קצר בפורום כל 2-3 שבועות, לפעמים היה צריך לקרוא מאמר או לראות קטע מסרט. יחסית למל\"ג זה קצת מבאס, אבל לא מוגזם, ונותן ציון טוב.\n\nהמבחן: סמסטר מקוון- היה פרויקט במקום המבחן הרגיל. פרויקט לא מורכב מדי, ניתן בונוס על יצירתיות ברעיון/הגשה, והמון זמן להגיש. \n\nהשורה התחתונה:", "timestamp": 1613153758371}, {"author": "א'", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: \nד\"ר אביטל בינה פולק\nחוות דעת - הרצאות: \nמעניינות. הרבה דיונים והמרצה טובה ומכבדת את דעות הסטודנטים.\nמידי פעם היו מבחני קאהוט - נותנים בונוס לציון הסופי.\nשעורי הבית: \nכתיבה בפורום פעם בשבועיים, לא באמת לוקח יותר מידי זמן.\nמהווה חלק מהציון הסופי.\nעל חלק מהפורומים יש צורך לקרוא או לראות סרטון לפני המענה (לא נבדק אך רלוונטי לכתיבת הדיון בפורום).\nהמבחן: \nסמסטר קורונה - עבודה במקום מבחן.\nהייתה אפשרות להגיש את העבודה כחודש לפני סיום הסמסטר, כך שאפשר לסיים הרבה לפני הסוף.\nניתנה חשיבות גם ליצירתיות העבודה, אך כמובן בעיקר לתוכן.\n\nהשורה התחתונה: \nאחלה מל\"ג למי שמוכן להשקיע עוד קצת במהלך הסמסטר. בהנחה שיש עבודה ולא מבחן, ניתן לסיים כבר חודש לפני סוף הסמסטר. מומלץ.", "timestamp": 1617702857840}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "הרצאות: מעניינות, אביטל מרצה מאוד חמודה. צריך שיהיה לכם איזשהו עניין כלפי סין אם אתם רוצים לאהוב את המלג הזה.\nהיו לוגים בסוף כל שיעור בהקשר של הנושא הנלמד. הכוונה היא שהיא הייתה שואלת שאלה והיינו צריכים לענות עליה (10 מתוך 12  סך הכל) וזה 40% מהציון. אם ענית קיבלת את כל הנקודות.\nהיא לא בדקה נוכחות, אבל הלוגים מהווים סוג של בדיקת נוכחות. השיעור שודר גם בזום למי שרצה.\n\nהמבחן: במקום מבחן הייתה עבודה בצוותים של ארבעה אנשים. אם מראים לה בסוף הסמסטר עבודה מושקעת שעונה על כל הדרישות, היא תיתן 100. (60% מהציון). וראיתי שמי שלא קיבל 100 היא נתנה הזדמנות לשפר את העבודה. \nלעשות פרויקט היתה אלטרנטיבה טובה עבורי במקום מבחן, כי לקחתי 2 מלגים ולכן זה חסך לי זמן למידה לעוד מבחן.\n\nהשורה התחתונה: מל\"ג מעניין, אבל האמת היא שאהבתי קצת יותר את המל\"ג שלה \"חינוך בסין\" שלקחתי מזמן, מבחינת התוכן שמועבר.", "timestamp": 1657616936936}]}