{"posts": [{"author": "סטודנט", "difficultyRank": 1, "generalRank": 4, "semester": "201901", "text": "חוות דעת - הרצאות: המרצה לא רע אבל החומר ברובו משעמם, ממש כמו השם של הקורס מדברים על המשמעות של תנועות ותנוחות של דמויות באמנות.\nבסמסטר שלי (פרונטלי) לא הייתה נוכחות חובה.\n\nאין שיעורי בית\n\nהמבחן: היה על כל החומר הנלמד, לא מאוד קשה אבל כן צריך ללמוד ולהיעזר בסיכומים כי צריך לזכור הרבה דברים (לא תאריכים ודברים טכניים אבל כן דורש שינון קל), דורש לפחות יום למידה שלם, לא צריך יותר משניים אבל.\nהמבחן אמריקאי עם הרבה שאלות (אצלנו היו 40 וצריך לבחור 36 או משהו בסדר גודל הזה)שרובן קלות מאוד אם התכוננתם אז קשה מאוד לקבל 100 אבל קל לקבל מעל 90\n\nהשורה התחתונה: \nלא מאוד מעניין, אפס השקעה בסמסטר (אולי בלי נוכחות חובה אפילו) ומבחן סביר", "timestamp": 1610369527758}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: גיל פישהוף\nחוות דעת - הרצאות: \nבהרצאות המרצה מראה אומנות מתקופות שונות (ימי הביניים וכו) ומסביר בעיקר על משמעות המחוות השונות של הדמויות, הקשר שלהם לתקופות אחרות וכו. \nבלי נוכחות חובה, חומר לא קשה בכלל, מסביר מובן ואפילו בקצב איטי. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין שיעורי בית\n\nהמבחן: \nהמבחן אמריקאי, 36 שאלות ובכל שאלה 4 אפשרויות. מבחן מאוד הוגן, אבל יש הרבה חומר אז כדאי לעבור על סיכומים לפני המבחן. \nהשורה התחתונה: \nחומר קל, מרצה בסדר לגמרי, כן דורש לעבור על החומר לפני המבחן.", "timestamp": 1624973314738}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: גיל פישהוף\nחוות דעת - הרצאות: המרצה מציג תמונות של דמויות ופסלים מתקופות שונות ומסביר את המחוות ושפת הגוף, החומר בכללי משעמם ,בלי נוכחות חובה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין שעורי בית\n\nהמבחן:  36 שאלות אמריקאיות, המבחן לא קשה בכלל, מספיק לעבור היטב על הסיכומים לפני המבחן, דורש שינון קל אבל לא צריך לזכור שמות או תאריכים, דורש יום למידה למבחן מקסימום יום וחצי.\n\nהשורה התחתונה: מבחן הוגן וניתן לקבל ציון גבוה בקלות, אפס השקעה במהלך הסמסטר.", "timestamp": 1626015359595}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: גיל\nחוות דעת - הרצאות: מאוד ברורות, די מעניינות. עוברים בין תקופות שונות ונושאים שונים, ותוך כדי רואים המון דוגמאות לכך (תמונות, פסלים וכו'). \n\nשעורי הבית: אין\n\nהמבחן: הוגן מאוד. גיל הסביר לאורך כל הסמסטר שהוא רוצה שנבין את הרעיון ולא שנשנן שמות של דוגמאות או יצירות מסוימות. המבחן היה בהתאם לכך, 4 אפשרויות לכל אמריקאית וללא ניסיון להפיל. \n\nהשורה התחתונה: מל\"ג מומלץ לאנשים שמתעניינים בתחומי האומנות, ובכל מקרה הוא לא עמוס (בכלל). מי שלא הגיע להרצאות ויקרא סיכומים, עדיין די בקלות יקבל מעל 90.", "timestamp": 1626443051357}, {"author": "Avital Yamin", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אמריקאי. קליל.\n\nהשורה התחתונה: מומלץ", "timestamp": 1633538818314}]}