{"posts": [{"author": "מיילס דיוויס", "difficultyRank": 1, "generalRank": 2, "semester": "202002", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: מעניינות וכיפיות\n\nהמבחן: מעצבן ולא יפה. קשה מדי. למדתי כמו שצריך ועדיין המבחן היה מתקיל, ממוצע 80 במועד א'. \n\nהשורה התחתונה: \nהמל\"ג הזה היה הציון הכי נמוך שלי בסמסטר. חבל, היה מאוד מעניין. לא ממליץ, ואם כן רוצים אז להיות מוכנים מראש למועד ב'", "timestamp": 1648112074638}, {"author": "לא מוזיקאי", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: \nהמרצה משתדל להנגיש את הקורס לכולם אבל ללא הצלחה, בסופו של דבר יושבים שם הרבה מוזיקאים (הם לפחות בולטים יותר) וזה גורם למרצה לקחת את זה למקומות שאנשים ללא רקע מוזיקלי יאבדו קונטקסט.\n\nשעורי הבית: \nאין\nהשורה התחתונה: \nאם את/ה לא מוזיקאי/ת - תתרחק/י! השתעממתי רצח וגם ההכנה למבחן היה מתסכל", "timestamp": 1689228717691}, {"author": "שמוליק", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס בעל אופי מאוד תאורטי של מוזיקה, מי שלא מנגן\\מבין בתווים ממליץ לא לקחת. המבחן גם כן לא קל, צריך לשנן הרבה מאוד וללמוד לפחות יום - יומיים. אמנם חצי מהשיעור שומעים מוזיקה אבל יש הרבה תאוריה, ובנוסף 20% מהציון זה לזהות סגנון של יצירות שבשביל להצליח בזה צריך לשמוע לפחות שבועיים לפני המבחן.\nמי שמבין במוזיקה ממליץ לקחת, לשאר ממש לא, למרות שהמרצה מאוד נחמד.", "timestamp": 1689336779434}, {"author": "יובל", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: משעממות נורא למי שאין לו רקע מוזיקלי.  \n\nשעורי הבית: אין.\n\nהמבחן: בנוי מחלק של שאלות ומחלק של הקשבה. השאלות ממוחזרות אבל זה עדיין נורא מתסכל ללמוד אליהן. והחלק של ההקשבה אפילו יותר גרוע.\n\nהשורה התחתונה: להתרחק.", "timestamp": 1689499197262}, {"author": "Tom", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דן כהן\nחוות דעת - הרצאות: מי שמתעניין במוסיקה, אז נחמד, לפעמים משעמם, למרות שדן מאוד נחמד ומנסה להנגיש את החומר לכולם, אבל לא תמיד מצליח.\n\nשעורי הבית: אין\n\nהמבחן: על הפנים. שאלות באמת מיותרות של שינון חומר מהמצגות בלי טיפה של הבנה. ציונים לא טובים\n\nהשורה התחתונה: להתרחק", "timestamp": 1693412455476}]}