{"posts": [{"author": "Guy Yoffe", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "המבחן: \nמבחן נחמד, לא לוקח הרבה זמן ללמוד אליו\nהשורה התחתונה: \nאחלה קורס. מאוד מומלץ בתור מלג (למרות שהממוצע \"רק\" 93)", "timestamp": 1597753867267}, {"author": "סטודנט נטחן", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: לא התחלפו כבר עשור תבדקו בהיסטוגרמות\n\nחוות דעת - הרצאות: החלק על דיני עבודה מועבר בצורה נחמדה, החומר על פטנטים משעמם. בכללי מי שמחפש קורס מעניין וחושב שמצא את האחד יכול לכתוב דיני עבודה ודיני פטנטים בגוגל ולהעשיר את עצמו בשעה במקום לשרוף על זה זמן בסמסטר. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: הקורס דורש זמן ללמידה למבחן ושינון של לא מעט חומר וגזל ממני זמן יקר והשקעה שלא הייתה שווה את הציון בכלל. מבחן די טריקי. \n\nהשורה התחתונה: להתרחק, אל תקחו את הקורס הממוצע זה מלכודת דבש וכשאתה בפנים אתה מבין שההשקעה בלתי נמנעת ואף אחד לא סיפר לך על זה לפני, אז הנני כאן בכדי לספר מתוקות שאו ברכה בהצלחה בתואר קחו מל״גים מתגמלים", "timestamp": 1612297219255}, {"author": "~", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "חוות דעת - הרצאות: \nההרצאות מחולקות ל-2: פטנטים ודיני עבודה.\nההרצאות של דיני עבודה ללא ספק יותר מעניינות אך ניתן למצוא עניין גם בפטנטים.\nחשוב לזכור שהקורס מועבר על ידי שני עו\"ד אז יש לא מעט חומר.\nהמבחן: \nהשקעה של יום וחצי-יומיים אם אתה מקשיב בשיעורים לאורך הסמסטר.\nהחלק של של דיני עבודה בדרך כלל פתוח עם בחירה \nהחלק של פטנטים בדרך כלל שאלות אמריקאיות (חלק לא קטן ממוחזרות)\nהשורה התחתונה: \nהחלק של תמר יותר מעניין וגם חשוב לחיים ולקריירה האישית.\nלא דורש השקעה לאורך הסמסטר רק יומיים לפני המבחן לחזור על החומר ומבחני עבר.", "timestamp": 1612359996262}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות: ההרצאות של תמר מעניינות ורלוונטיות גם לחיים, החלק של פטנטים פחות עניין אותי\n\nהמבחן: חצי אמריקאי וחצי פתוח. האמריקאי ממוחזר בערך 50%, סתם טריקי ומתחכם בעיניי. החלק הפתוח יותר סביר, שואלים בערך את אותן השאלות כל סמסטר.\n\nהשורה התחתונה: מלג חשוב לחיים אבל המון חומר לשנן למבחן, לא כיף להשקיע כל כך הרבה זמן למידה בשביל מלג שהוא חצי לא ממוחזר.", "timestamp": 1625682398885}, {"author": "ר.ק.", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: תמר/דורון\nחוות דעת - הרצאות: החלק של המשפטים היה מעניין בטירוף. החלק של הפטנטים חידש לי לא מעט אבל היה קצת יותר טכני ופחות סחף אותי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין. אבל יש נוכחות חובה\n\nהמבחן: קליל. הפטנטים היה בחלקו ממוחזר\n\nהשורה התחתונה: אחלה קורס - מומלץ", "timestamp": 1629117583821}, {"author": "S", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות:\nתמר מרצה מושלמת, ממליצה מאוד ללמוד אצלה. נושאים רלוונטיים לחיים ומעניינים מאוד. היא עושה עוד קורס שהיא מעבירה לבד משפט שיוויון וצדק חברתי, ולדעתי מומלץ מאוד.\nאצל דורון לעומת זאת לדעתי החומר משעמם וטכני ברמות, וכתוב בשפה משפטית ולא מונגשת מספיק.\nשעורי הבית: עבודה קצרה שמייצגת את ההבדל בין המרצים - סבירה ונחמדה אצל תמר, מבלבלת, בשפה משפטית ומכשילה אצל דורון.\n\nהמבחן: נוראי. ממש. כל אחד מהם עושה מבחן כאילו הוא מעביר מלג לבד מבחינת גודל, והלמידה למלג הזה מוגזמת מאוד. החומר של דורון לבד הוא כפול בסדר גודל שיש במלג רגיל. החלק של תמר עוד אפשר ללמוד אליו ולהסתדר אבל החלק של דורון כל כך טריקי, כל כך מחפש בקטנות, טכני דורש שינון של מליון דברים, מליון חוקים, מליון מספרים, וממש לא מעגל פינות אלא מחפש אותך על חודה של מילה.\n\nהשורה התחתונה: תכלס לא ממליצה. החלק של תמר מעניין מאוד לחיים האמיתיים, אבל החלק של דורון הוא לא משעמם בצורה לא מזיקה אלא הופך את המלג לציון לא טוב ביחס למלגים, דורש למידה מוגזמת ובסוף עדיין נופלים על שטויות. בדיעבד לא שווה את זה לדעתי.", "timestamp": 1643132486440}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות: \nכמו שאמרו רבים לפניי, ההרצאות של תמר מעניינות ממש ורלוונטיות, אבל בעיניי גם ההרצאות של דורון מעניינות ומחדשות - הבעיה היחידה היא שלפעמים יש התעסקות בדברים ממש קטנים וספציפיים וזה מה שמוריד קצת. \nבשונה ממה שאמרו פה לפני - בעיניי שווה להגיע להרצאות ולהקשיב באמת, ככה גם תוכלו לנצל את כל המידע וגם יהיה קל ללמוד למבחן. אין באמת המון חומר אם מקשיבים במהלך הסמסטר, כי יש עקרונות שאם מבינים זה מקל ממש על הלמידה.\n\nשעורי הבית: \nהשנה הטכניון חייב את המרצים לתת שיעורי בית, היו שני תרגילי בית קצרים - לא קשים אבל כן דורשים חשיבה.\n\nהמבחן: \nהוגן. \n\nהשורה התחתונה: \nשווה", "timestamp": 1643213796717}, {"author": "דנה", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דורון ותמר\nחוות דעת - הרצאות: לא הקשבתי בהרצאות.\n\nשעורי הבית: יש מטלה בשביל כל אחד מהמרצים, אפשר לשאול אחרים מה סימנו ולסמן בלי לקרוא בכלל, אצל דורון הייתה שאלה מזעזעת שרוב האנשים טעו בה.\n\nהמבחן: לא פשוט, יש מלא חומר לשנן לפני, במיוחד אם לא הגעת באמת לשיעורים ולא באמת למדת. החומר של הפטנטים מזעזע, ארוך, חופר ולא ברור. המזל שלפחות דורון קצת מיחזר דברים ממבחנים קודמים.\n\nהשורה התחתונה: ממש לא מומלץ, סיימתי עם ציון טוב אבל זה לא היה שווה את כל המאמץ, למדתי למבחן איזה שבוע מראש, לקח המון זמן לשנן את כל החומר. שורה תחתונה- יש מלגים הרבה יותר נורמלים, עדיף לא לקחת.", "timestamp": 1644196886960}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מאוד מאוד מעניין, מדברת בצורה שממש כיף להקשיב, עונה על שאלות ויש אווירה ממש טובה בכיתה\n\nשם המרצה:  דורון\nחוות דעת - הרצאות : \n\nשעורי הבית: היה תרגיל בית לכל מרצה ממש קטן, פחות משחצי שעה עבודה \n\nהמבחן: הרבה די ממוחזר בחלק של הפטנטים. בדיני עבודה היה יותר מאתגר ודורש הבנה של החומר\n\nהשורה התחתונה:  לא קורס של 100 מתנה בלי השקעה, אבל המלג הכי טוב שעשיתי", "timestamp": 1657259645481}, {"author": "מפוטר טרי", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות: תמר מעבירה את משפט העבודה, די מעניין\nדורון מעביר דיני פטנטנים. משעמם ולא מעניין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל מרצה עשה מטלה אחת במודל, כל אחת 10 דקות בלחץ.\n\nהמבחן: החלק של דורון טריקי, הרוב ממוחזר אבל מה שלא די מכשיל. החלק של תמר זה לכתוב הרבה אבל אם עברת על החומר לא בעייתי\n\nהשורה התחתונה: לא מלג של 90+ בלי ללמוד, לדעתי בעיקר בגלל החלק של הפטנטים. אבל די מעניין", "timestamp": 1658690508881}, {"author": "***", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: יותר מידי מאמץ בשביל מל\"ג ממש לא כדאי", "timestamp": 1676115930604}, {"author": "מבין עניין", "difficultyRank": 5, "generalRank": 4, "semester": "202201", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות: \nתמר מרצה מעולה שתמיד מנסה לעורר דיון בכיתה.\nדורון מתמקד יותר בפרטים, די משעמם.\n\nשעורי הבית: \nיש 2 מטלות במודל שדורשות חצי שעה בערך והן שוות 5 נקודות לציון הסופי.\n\nהמבחן: \nיחסית למלג זה עמוס מאוד, דורש 2-3 ימי למידה בשביל להוציא ציון מעל הממוצע.\n\nהשורה התחתונה: \nבעצם ניסו לדחוף 2 מלגים במחיר של 1 (הראשון הוא דיני עבודה והשני פטנטים), קורס שחשוב לכל סטודנט אבל לא בהכרח מצדיק את העומס.\nלפני שתקחו אותו, תבדקו שהוא לא פוגע לכם בתקופת מבחנים\\הגשות של השבוע האחרון.\n\n*יש נוכחות חובה שנבדקת בכל הרצאה בשעה הראשונה.", "timestamp": 1679304520285}, {"author": "קורס חרטא", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "המבחן:\nלא קליל בכלל, החלק האמריקאי של הפטנטים ממוחזר ברובו אבל גם יכול להיות טריקי\nהחלק של דיני עבודה - שאלות פתוחות (שזה כבר מעיק) ו גם לא כאלה פשוטות\n גם די טריקיות עם תתי סעיפים על דברים קטנים מההרצאות\n\nהשורה התחתונה: לא מומלץ בכלל.. למדתי למבחן כמה ימים והציון לא היה שווה את ההשקעה.\nאפשר ללמוד את הכל מחיפוש קליל באינטרנט במקום לשבת כל שבוע בכיתה מסריחה ומחניקה ולהקשיב להרצאות", "timestamp": 1689786925838}, {"author": "LS", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דורון ותמר\n\nחוות דעת - הרצאות: \nהקורס מחולק ל-2 חלקים, שכל אחד מועבר ע\"י מרצה אחר באופן בלתי תלוי:\n\n1. חלק אחד על חוקים סביב פטנטים - מה ניתן לרישום כפטנט, מה התוקף של פטנט, השוואות בין פטנטים בארץ לאירופה וארה\"ב, הליכי קדימות, וכל מיני בירוקרטיות שונות. יש גם קצת דברים בסוף על סודות מסחריים, הגנה על עיצובים, זכויות יוצרים, וסימן מסחרי.\nזה מסוג הדברים שהיו מעניינים אם היו מתמצתים להרצאה אחת, אולי של שעה וחצי, שהייתה מכסה את הבסיס של העולם הזה, ומשאירים את הניואנסים הבירוקרטיים בחוץ.\nאז סה\"כ יש קצת מעניין, הרוב לא. דורון בקיא בחומר ואכפת לו, אבל כבר מהרצאה שנייה-שלישית כנראה יימאס לכם.\n\n2. חלק שני על דיני עבודה - בגדול כל מה שקורה ביניכם לבין מעסיק: שזה בעיקר חוזה עבודה (מה חוקי לשים בו, אילו זכויות מגיעות לכם בכל מקרה), הבדלים בין שכיר ועצמאי (ועובד קבלן), ואיזה אתם (ספוילר - לא החוזה הוא שקובע את זה), וזכויות בפיטורין (שימוע, פיצויים, וכו').\nמאודדדד אקטואלי, ונטו בגלל זה מעניין. אבל נמרח מדי. תמר אחת המרצות היותר כריזמטיות בטכניון כנראה, אבל היא נמרחת על מלא פסקי דין כאילו הם הגביע הקדוש. בסוף זה תקדים משפטי שנוצר במקרה מתיק מסויים, ועכשיו הוא מחייב בהיעדר חקיקה מסודרת.\nבעיני החלק הזה של הקורס היה מרוויח אם במקום להיכנס לפסקי דין, היה מכסה זכויות / חובות נוספות של עובד ומעסיק, ואפילו נכנס לדברים שרלוונטים ספציפית למשרות בהייטק.\n\nהמבחן: \nזה לא ללמוד יום ולגשת, צריך יותר. וזה לא 100 אוטומטית, אבל אין סיבה שתתרסקו. החלק של דורון אמריקאי, והרבה שאלות ממוחזרות ויש שחזורים, והחלק של תמר תמיד באותו מבנה - הנה סעיפים מחוזה עבודה וסיפור על איך העובד פוטר/התפטר ובואו נתפלסף על כל דבר אם חוקי/לא חוקי.\n\nהשורה התחתונה: \nאם אתם מצפים שזה יהיה מל\"ג שתהיו מרותקים כל שיעור, או 100 עם השקעה מינימלית - זה לא ממש זה.\nאבל אם אתם מחפשים מל\"ג, ומעוניינים על הדרך לדעת את הזכויות שמגיעות לכם בחוזי עבודה ובפיטורין, זו דרך לא רעה ללמוד אותן.", "timestamp": 1690729189900}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: תמר ודורון\nחוות דעת - הרצאות:\nהחלק של תמר (דיני עבודה) - מאוד מעניין, מאוד רלוונטי. חושב שאמור להיות חובה לכל סטודנט בטכניון.\nהחלק של דורון (דיני פטנטים) - לדעתי גם מעניין ורלוונטי אבל לפעמים עמוס בפרטים וקצת כבד.\n\nשעורי הבית: 2 תרגילי בית (אחד דיני עבודה ואחד פטנטים) של כחמש שאלות כל אחד. אפשר לסיים בשעתיים את שניהם.\n\nהמבחן:\nדיני עבודה - מקרה לניתוח על בסיס החומר הנלמד. דורש למידה ושינון בכמות סבירה. תמר מפרסת מיקוד לפני המבחן שעוזר להוריד את כמות החומר.\nדיני פטנטים - אמריקאיות שבחלקן ממוחזרות. לפעמים יש שאלות על פינות בחומר. גם דורש שינון אך גם בכמות סבירה.\n\nכל אחד עם הקצב שהוא משנן בו אבל לדעתי עדיף ללמוד שעתיים-שלוש ביום למשך ארבעה ימים שכל יום משננים ואז פותרים מבחן אחד וזה אמור להספיק.\n\nהשורה התחתונה: מומלץ ורלוונטי מאוד. גם כשתכננתי לעשות גיליונות תוך כדי ההרצאה, הבנתי שאני מעדיף להקשיב (כי החומר מעניין ורלוונטי, לא קשור למבחן).", "timestamp": 1715332645874}, {"author": "עובר ועוד אפסילון", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: תמר ודורון \nחוות דעת - הרצאות: חומר מעניין מאוד בשני ההרצאות שבתור מהנדסים חשוב לדעת בעיקר את החלק של תמר על חוזים וזכויות העובד. תמר כריזמטית ומאוד מערבת ויוזמת. דורון מעניין אבל קצת מרדים תהיו עם אוזן אחת על ההרצאה \n\n\n\nשעורי הבית: תמצאו רפרנס מחבר או תקדישו חצי שעה. לא קשה הם בכוונה עושים משהו קליל\n\nהמבחן: יש מספיק ביקורות על המבנה עצמו מה שכן אין ממש איך להתכונן חוץ מלשנן. תעזרו בchat gpt 4o שייצר לכם שאלות בלי סוף חזרה מעולה( שימו לב שהתשובה שהוא נתן באמת נכונה אבל לרוב הכל טוב)\n\nהשורה התחתונה: מידע מועיל ורלוונטי בעיקר מהווה בסיס שתשכחו את רובו אבל תדעו מה בגדול קורה ולהזכר", "timestamp": 1717926941667}]}