{"posts": [{"author": "*", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: אין חובת נוכחות. משעממות לרוב. מועברים תכנים שאני כחילוני מזווית אובייקטיבית תופס כמסלפים את המציאות ומסיטים נגד דתות אחרות כגון הנצרות והאסלאם.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: 25 שאלות: 10 פתוחות ו15 אמריקאיות מאוד מבלבלות לפעמים עם 4,5 או 6 אפשרויות בחירה כשחלק מהן אומרות \"בדיוק 2 מהתשובות נכונות\" או \"לפחות אחת התשובות נכונה\" ולרוב קומבינציה של שתיים כאלה. רוב הקורס מורכב מאנשים דתיים הדוקים שאני מאמין שמכירים את כל הרבנים והציטוטים שנלמדו בקורס ולכן הממוצע גבוה - ***מלכודת לחילונים מחפשי המל\"גים הטובים***\n\nהשורה התחתונה: מומלץ לדתיים בעיקר. מי שחילוני ולא בעל זיקה ליהדות *כנראה* שיסבול מהקורס הזה, ובעיקר מהמבחן ומהציון. יש לציין שניתן להגיש פרויקט בזוגות המשלב סוגיה שמעניינת אתכם בעולם היהודי ולכלול בו פרשנויות של פרשני הדת. הפרויקט מקנה 25% מגן לסופי אם מגישים.", "timestamp": 1626596721808}, {"author": "א", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות לא משהו. די מבולגנות ועם מידע ממקורות מפוקפקים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nטרם ניגשנו\nהשורה התחתונה:", "timestamp": 1642514537441}, {"author": "אחד שיודע", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: משעממות מאוד. המצגות מועתקות מויקיפדיה מילה במילה. מאוד לא מסודרות, מלא מלל והכל חסר תוכן. המרצה מקריא בחיפזון, לא מסודר מבחינת החומר וקופץ מנושא לנושא. פעם בכמה שיעורים לומדים סיפור נחמד על יהודי בימי הביניים וזהו.\n\nהמבחן: בהינתן זה שאי אפשר ללמוד מהמצגות בכלל ואין סדר כל כך בחומר, המבחן לא קל ממש כמו רוב המלגים. יש סיכום טוב בקבוצה של הפייסבוק אבל גם הוא לוקה בחסר כי המרצה יכול להכניס מלא שאלות מבלבלות על דברים שהוא לא ממש דיבר. הממוצע אמנם 90 אבל זה עם מגן 25 אחוז כן? אל תתהפנטו מההיסטוגרמה. \n\nהשורה התחתונה: לא ממליץ. אמנם אפשר ללמוד יומיים ולהוציא 85-90 אבל זה לא בכיף בכלל. במהלך הסמסטר מרגיש כמו בזבוז זמן. זה לא שהמרצה מדבר עניינית אבל עדיין משעמם- הוא פשוט לא מדבר עניינית. בתור אחד שכן אוהב מלגים כי זה מרחיב את הידע שלך מעבר למתמטיקה של הטכניון, על המלג הזה אני לא ממליץ בכלל.", "timestamp": 1643805593658}, {"author": "סטודנט כללי", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: גרוע\nהמבחן: מבלבל \n\nהשורה התחתונה:  תקראו את חוות הדעת של אחד שיודע מפברואר 22, ניסח מדויק!", "timestamp": 1644151139675}, {"author": "הרמבן", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: משמעממות לעיתים אבל לעתים מענינות וגולשות לדיונים.\n\nשעורי הבית:  הייתה עבודת רשות שלא עשיתי. היא מגן של 20% והבנתי שכל מי שעשה קיבל 100.\n\nהמבחן: צריך לקרוא את כל החומר ביומיים לפני ומסתדרים.\n\nהשורה התחתונה: מלג בסדר.", "timestamp": 1644161864066}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: לרוב ההרצאות ממש משעממות, רק במעט מאוד פעמים ההרצאות היו מעניינות וגלשו לדיונים.\nהמרצה דווקא רוצה שיהיה מעניין ועשה פעמיים הצבעה אם אנחנו רוצים שנמשיך את הנושא שעסקנו בו אבל עדיין ההרצאות לרוב לא מעניינות.\nיש תוספת לציון על נוכחות מלאה ובנוסף על עבודה \n\nשעורי הבית: \nיש עבודה שניתן להכין במהלך הסמסטר והיא נותנת תוספת לציון.\n\nהמבחן: ניתן ללמוד יום לפני ולהוציא ציון של 90 אבל ההרצאות לרוב לא מעניינות\n\nהשורה התחתונה: ציונים אחלה אבל ההרצאות לא מעניינות לרוב", "timestamp": 1644831424847}, {"author": "התכלס", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: אלעד (הרב)\nחוות דעת - הרצאות: \nהסמסטר החליט להוריד את הממוצע, את החומר למבחן קשה למצוא כי הוא לא מתומצת, לא מסובר טוב, וצריך להבין את הראש שלו כדי לענות עליהם (יש הרבה בעיה של ניסוחים קלוקלים).\n\nאם תעשו את כל הבונוס שהוא מציע, ביחד עם מבחן סביר תוכלו להוציא מעל 95+ עדיין\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1648978848024}, {"author": "אילנה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלעד דוקוב\n\nחוות דעת - הרצאות: נחמדות, אלעד מעביר אותם בצורה מעניינת במיוחד יחסית למל\"ג..\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה\n\nהמבחן: לא קשה לקבל ציוד טוב במבחן פשוט לעקוב בהרצאות.\n\nהשורה התחתונה: ממליצה מאוד! נושאים מאוד מעניינים", "timestamp": 1673121891927}]}