{"posts": [{"author": "סטודנט ממורמר", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "תתעלמו ממה שרשמתי בעומס ובדירוג, זה פשוט חובה לרשום.\n\nאני מעדכן לכל מי שחושב לקחת את הקורס מכיוון שזה לא רשום *באף מקום* (אפילו לא בדף הקורס)\n\nהקורס דורש ידע בסיסי בניגון ושליטה על כלי נגינה, צריך לדעת לקרוא תווים ויש בחינה בשיעור הראשון. \nקחו את זה בחשבון לפני שאתם נרשמים.", "timestamp": 1674124545317}, {"author": "Y.R.", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דר. כהן דן\n\nחוות דעת - הרצאות: \nיש יחסית מעט חומר תיאורטי. בדרך כלל מנגנים יחד כל מני תרגילים ולקראת סוף הסמסטר מתחילים לאלתר כל אחד בתורו ולקבל פידבק. \n\nשעורי הבית: \nבדרך כלל מקבלים קטע שצריך ללמוד את התווים ופירוקי האקורדים שלו. זה לוקח זמן אבל דן משתדל לא להעמיס בסוף הסמסטר.\n\nהמבחן: \nמבחן כניסה - לפני תחילת ההרצאה הראשונה דן בודק שאתם יודעים לקרוא תוים טוב.\nמבחן תיאורטי - אפשר לקבל מאה גם אם לפני הקורס לא יודעים תיאורי בכלל. לומדים את כל החומר בהרצאה הראשונה וחוזרים עליו במהלך הסמסטר.\nמבחן מעשי - כל אחד בוחר שניים מהקטעים שנלמדו במהלך הסמסטר ומנגן כל אחד עם קטע אילטור באמצע.\n\nהשורה התחתונה: \nממליץ מאוד למי שמנגן. למי שלא יודע תיאוריה זה קצת יותר קשה בהתחלה אבל לומדים במהלך הסמסטר ובסוף כולם מקבלים ציון טוב.", "timestamp": 1689499836697}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דן \nחוות דעת - הרצאות: המרצה לא רוצה להימד, הוא רק רוצה לעזור אנשים שכבר יודעים לאלתר. מרצה הכי גרוע שראיתי בעלום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אל תקחו הקורס אם תרצו ללמוד לאלתר", "timestamp": 1689771551412}, {"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דן\nחוות דעת - הרצאות: המרצה לא רוצה ללמד, הוא רק רוצה לעזור אנשים שכבר יודעים לאלתר. מרצה הכי גרוע שראיתי בעולם.\n\nאל תקחו הקורס אם תרצו ללמוד לאלתר\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אל תקחו הקורס אם תרצו ללמוד לאלתר.", "timestamp": 1689773654955}]}