{"posts": [{"author": "Lir", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: גבריאל מונסיס\nחוות דעת - הרצאות: מרצה מדהים. מאוד אוהבת את שיטת הלימוד שלו. פרט לדברים מנהליים שהוא אומר רוב השיעור מתנהל באיטלקית פשוטה (הוא יסביר כל מה שהוא אומר בכל מיני דרכים כך שתבינו ואם לא הבנתם הוא יגיד לכם אתהפירוש שלו כמובן). הדרך הזו לדעתי מאוד יעילה לקליטת השפה.\n\n\nשעורי הבית: רשות. מאוד ממליצה לתרגל בין אם לעשות את שיעורי הבית ובין אם ע\"י אפליקציה. אני פשוט תרגלתי קצת כל יום באפליקציה וקלטתי ממש טוב את השפה, אפילו למדתי קצת מעבר (יותר אוצר מילים וכו), אז ממש ממליצה.\n\nהמבחן: הוגן, קליל, אבל אל תצפו להצילח רק מנוכחות בשיעורים, חשוב להיות על הדופק ותרגל את השפה כל הסמסטר כי מן הסתם לא לומדים שפה רגע לפני המבחן.\n\nהשורה התחתונה: אחלה קורס", "timestamp": 1597743765168}, {"author": "שחר כהן", "difficultyRank": 2, "generalRank": 4, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמרצה מצוין\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nאין\nהמבחן: \nהוגן \nהשורה התחתונה: \nקורס טוב, יש צורך ללמוד למבחן המסכם אבל למי שלומד מובטח ציון גבוה", "timestamp": 1597829151818}, {"author": "XXX", "difficultyRank": 1, "generalRank": 3, "semester": "202001", "text": "שם המרצה: גבריאל מונסיס\nחוות דעת - הרצאות: המרצה נחמד , מלמד בשיטות שעוזרות לקלוט את השפה והוא גם חוזר הרבה על הדברים. יש דגש רחב על הדקדוק , יותר מאשר ללמוד אוצר מילים או הרכבת משפטים מועילים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין. יש תרגילי רשות שלדעתי עדיף לפתור לפני המבחן כי גם כך יש רק מבחן בודד לדוגמא שהוא נותן בהרצאה אחרונה ופותר.\n\nהמבחן: קליל והוגן. לדעתי מספיק ללמוד לזה יומיים 3 ולא באמת להשקיע בסמסטר.\n\nהשורה התחתונה: אם בא לכם להתעמק בשפה מבחינה דקדוקית זה המקום.", "timestamp": 1605041332733}, {"author": "~", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות מעניינות ומלמדות, אבל דורש תרגול לאורך הסמסטר כדי לבוא מוכן למבחן\n\nשעורי הבית: \nיש אבל הם לא חובה, מומלץ לעשות אחרי כל כמה שבועות\nהמבחן: \n60% מהציון, 20% כתיבת 4 טקסטים ו20% נוכחות והשתתפות.\n\nהשורה התחתונה: \nקורס מומלץ עם מרצה מעולה למי שרוצה ללמוד בסיס של שפה חדשה.", "timestamp": 1625911508371}, {"author": "אפוסטרופו", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: גבריאל מונסיס\nחוות דעת - הרצאות: המרצה נחמד , מלמד רק באיטלקית. יש דגש רחב על הדקדוק ועל הטיות פעלים.\n\nשעורי הבית: יש להגיש 4 טקסטים קצרצרים באיטלקית (סה\"כ 200 מילה) עד סוף סמסטר. יש תרגילי רשות שלדעתי עדיף לפתור לפני המבחן כי גם כך יש רק מבחן בודד לדוגמא שהוא נותן בהרצאה אחרונה ופותר. \n\nהמבחן: די קל אבל לא טיול בפארק. צריך ללמוד ולהשקיע, ולשנן כללי דקדוק וכמה מילים חשובות באוצר המילים. אני הקדשתי את השבוע האחרון לפני המבחן לחזרה מלאה על החומר, כולל פתירת תרגילים ושינון הכללים וההטיות. זה עזר מאוד.\n\nהשורה התחתונה: לומדים את הדקדוק של האיטלקית. פחות נכנסים לעומק מבחינה תרבותית. לא יצא לנו לשוחח באיטלקית כל כך. רוב השיעור ורוב הזמן הלמידה היא פרונטלית - להעתיק או לצלם מהלוח. אני חושב שחסר כאן מעבר על שיעורי בית בכל שיעור ופתרון התרגילים ביחד, כדי ללמוד מטעויות - מכל הסמסטר הזה יצא שרק בשבוע האחרון אני השקעתי והתעמקתי לפני המבחן, כי לא היו לי תמריצים לעבוד על זה במהלך הסמסטר שהרי אין שיעורי בית. מרוב כללי דקדוק והטיות פעלים, לא רואים את האיטלקית באמת.", "timestamp": 1657795762137}, {"author": "ליאונרדו די וינצי", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "שם המַרְצֶה: גַּבְרִיאֵלֵה מונאצ'יס\nחוות דעת - הרצאות: \nהמרצה מתנגד לשיטות לימוד רב לשוניות ולכן רוב השיעור עובר באיטלקית ובפנטומימה. לי היה קשה עם השיטה והייתי צריך להיות צמוד למילון בשביל להבין חצי מהדברים. השיעור עובר 1.5 שעות בלי הפסקה בהן המרצה מדבר וכותב על הלוח, שואל שאלות וצריך לענות לו. לעיתים בכמה דקות האחרונות מתחלקים לזוגות ומתאמנים בשיחה 1:1 עם תסריט שאלות שצריך לענות עליהן.\n\nשעורי הבית:\n ספר הקורס מחולק לפרקים לפי שבועות הסמסטר ויש תרגולים (כמעט) לכל נושא, אבל בשיעור הראשון הוא אומר שלא חובה לעשות ושלא נבדוק בכיתה ש\"ב. בתכלס חשוב מאוד לעקוב אחרי התרגולים ולהיות עם יד על הדופק כדי לא להגיע לשיעור ולהיות קלולס לגבי מה שקורה.\n\nהמבחן: \nראשית הלמידה למבחן הזכירה את הלמידה לפסיכומטרי מבחינת שינון ואסוציאציות כי הרבה לא טריויאלי לאנגלית\\לטינית. בנוסף לדעתי הרמה של המבחן לא מתאימה ל'מתחילים' ויש הרבה חוקים יוצאים מהכלל שהופיעו במבחן, מה גם ש'המבחן לדוגמה' שפתרנו בשיעור האחרון היה שונה שנות אור מהמבחן האמיתי עד כדי שהיו תרגילים בעלי אופי אחר על נושאים שלא תרגלנו בכיתה ביחד. כנראה שהיה פקטור רציני אם סיימתי עם הציון שסיימתי איתו.\n\nהשורה התחתונה: \nבאופן טבעי הקורס הזה יבוא בעדיפות תחתונה לעומת קורסי חובה, ויהיה תקוע כמו עצם בגרון כי הוא דורש יותר השקעה מקורסי בחירה אחרים.\nקשה מאוד ללמוד שפה חדשה ובטח שב13 שבועות, אבל אחרי הקורס אני יודע קצת יותר איטלקית ממה שידעתי לפניו, ולא הייתי מגיע לידע הזה באופן עצמאי לולא הקורס.\nאם היה לכם סבבה לשנן אסוציאציות בפסיכומטרי ואתם רוצים בסיס ללמוד איטלקית, קחו את הקורס", "timestamp": 1675671691046}, {"author": "רז אמזלג", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: גבריאל\nחוות דעת - הרצאות: \nאחד הקורסים היותר מהנים שלקחתי, ממליץ בחום\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1718562217046}]}