{"posts": [{"author": "שליחי הדודה", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: דינה רפאל\nהשורה התחתונה: מלג מעניין וקל, מרצה מעולה", "timestamp": 1597752380052}, {"author": "~~", "difficultyRank": 1, "generalRank": 4, "semester": "201803", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: מדברים בעיקר על פילוסופים מערביים ידועים ורואים סרטים שאמורים להמחיש עקרונות בפילוסופיה. לא חובבת גדולה של הנושא אז לא היה מרתק, ובנוסף ההוראה בזום הורידה את כל הדיונים שכנראה היו אמורים להיות בקורס.\n\nשם המתרגל/ת: ללא\nחוות דעת - תרגולים: ללא\n\nשעורי הבית: ללא\n\nהמבחן: ממש לא דורש המון. צריך למצוא סיכום עם שמות הפילוסופים, מונחים שדוברו וזרמים בפילוסופיה ולא צריך שום דבר מעבר לזה. \n\nהשורה התחתונה: קליל. אם מוצאים את הסיכום הנכון דורש קריאה של 6 עמודים וזהו. אחלה 100.", "timestamp": 1600087912391}, {"author": "רוניה", "difficultyRank": 1, "generalRank": 5, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: סבבה, קליל יחסית\n\nהשורה התחתונה: קורס מעניין, הרעיון של הסרטים נחמד מאוד ומרענן", "timestamp": 1601882585893}, {"author": "נמ", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: מבחן אמריקאי של 20 שאלות על החומר מהרצאות\n\nהשורה התחתונה: משלבת סרטונים כדי להבין את החומר, קורס מעניין", "timestamp": 1610895221729}, {"author": "Nate", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "שם המרצה: רפאל דינה\nחוות דעת - הרצאות: הנושאים מעניינים יחסית. בהרצאות לעתים קשה להבין את המסר שהיא רוצה להעביר ומה באמת צריך לקחת למבחן. משלבת קטעים מסרטים וזה מאוד נחמד. בהרצאה האחרונה עברה על כל החומר ואמרה מה צריך למבחן ומה לא וגם נתנה דוגמאות לשאלות שיכולות להיות. ההרצאות היו מוקלטות ולא בלייב. היה אפשר לא לראות אפילו הרצאה אחת, לקרוא סיכומים ולהצליח במבחן.\n\nשעורי הבית: אין\n\nהמבחן: 20 שאלות אמריקאיות. הרגיש קצת כמו פסיכומטרי מבחינת אופי השאלות. אך מבחן נחמד, דורש ריכוז והבנה אבל לא קשה מידי. מספיק לקרוא סיכומים מעודכנים לפני המבחן.\n\nהשורה התחתונה: מל\"ג יחסית מומלץ", "timestamp": 1611738908431}, {"author": "מלג בפילוסופיה", "difficultyRank": 2, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: הנושאים מעניינים, הלימוד שלהם הרבה פחות, מאוד ממוקד בנקודה שהמרצה רוצה להעביר, לא תמיד אפשר לדעת מה הפילוסוף רצה להגיד(במיוחד לגבי ניטשה). ממליץ למי שבא כי מעניין אותו פילוסופיה לוותר ולשמוע פודקאסט נחמד במקום.\nיש גימיק מגניב של לראות קטעים מסרטים לפני כל שיעור(סמסטר זום) אבל באיכות בלתי נסבלת בפנופטו(אולי יתקנו בעתיד).\n\nשם המתרגל/ת: אין תרגולים\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אמריקאי, אבל מבחן לא הוגן, אפשר היה לדעת את כל החומר שנלמד, ללמוד למבחן ולטעות בכל זאת בכמה שאלות מטעות.\n\nהשורה התחתונה: יש היסטוגרמה, תבואו אם אתם רוצים את הציון בהיסטוגרמה, לא ממליץ על החומר.", "timestamp": 1612269299799}]}