{"posts": [{"author": ".", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב הוכנברג\nחוות דעת - הרצאות: יואב מרצה ממש מעניין, מלמד עקרונות שקשורות להבנת המערכת העסקית שבה עובדים, מדגים הרבה בעזרת דוגמאות מעניינות והסמסטר הסתכלנו על אמזון כמודל. היה גם הרצאת אורח אחת. ההרצאות באמת קלילות ומעניינות.\n\nשעורי הבית: יש כמה הגשות לא גדולות במהלך הסמסטר שאפשר לקבל בהן ציון מעולה כי הרוב נאמר בהרצאה.\n\nהשורה התחתונה: הציון בקורס נקבע עפ\"י ההגשות במהלך הסמסטר ופרויקט סופי שמציגים + מכינים מצגת להצגה + קובץ וורד כפרויקט שמגישים. חלק גדול מהציון נקבע לפי הפרויקט. אפשר לא מאוד להשקיע במהלך הסמסטר, רק לקלוט את הרעיונות המרכזיים ומהם לכתוב עבודה. הרבה מקום ליצירתיות, הבעה עצמית ולדעה אישית. באמת קורס סבבה. הציונים מעולים.", "timestamp": 1633865804701}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יואב\n\nחוות דעת - הרצאות: \nלא מומלץ בכלל, הנושא של הקורס אמנם מעניין אבל המרצה חסר כריזמה.\n\nשעורי הבית: יש כ6 הגשות, וצריך להשקיע בהכל לא מעט זמן\n\nהמבחן: אין\n\nהשורה התחתונה: קורס לא מומלץ מבחינת יחס השקעה לציון סופי אם משווים למלגים אחרים, עדיף לוותר", "timestamp": 1648553737766}, {"author": ".", "difficultyRank": 4, "generalRank": 1, "semester": "202101", "text": "שם המרצה: יואב הוכברג\nחוות דעת - הרצאות: כבדות מאוד.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל הסמסטר יש הגשות כמעט שבועיות ובסוף צריך לעשות פרזנטציה ובנוסף להגיש עבודה.\n\nהמבחן: אין מבחן.\n\nהשורה התחתונה: קורס ממש על הפנים. החומר משעמם וגם זה מלא עומס בסמסטר. בנוסף לזה, אחרי שהשקענו ממש, היינו בכל ההרצאות, כל ההגשות שלנו היו מצוינות (לפחות לפי מה שיואב אמר) ולא היתה לו אפילו הערה אחת על הפרזנטציה ועל העבודה חוץ מזה שהוא אמר שזה מצוין, הוא נתן לנו ציון ממש נמוך שאשכרה מוריד את הממוצע. \nבנוסף, יואב לא ענה בכלל למיילים ודיי נעלם והציונים הגיעו פתאום כבר אחרי תחילת הסמסטר הבא. התנהלות מביישת.\nבקיצור, לא מלג מומלץ בכלל!!!", "timestamp": 1648554476068}, {"author": "הסטודנט הממוצע", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יואב הוכברג\nחוות דעת - הרצאות: \nצריך להבין, הקורס הוא לא מל\"ג טיפוסי, הוא מתאים למי שמתעניין בתחום היזמות והפיתוח העסקי. בהרצאות לומדים מושגים מהעולם הזה, כלים וגישה איתם ניתן לפתור בעיות מהתחום. \nיואב מגיע מהתחום וחי אותו כבר יותר מ20 שנה, הוא מביא את הניסיון שלו וההשקפה שלו בכל הרצאה. ההרצאות עמוסות בידע אבל יואב מעביר אותם בצורה טובה. \n\nשעורי הבית: \nאין מבחן בקורס, הציון בנוי מהגשות במהלך הסמסטר ופרויקט סוף. החלק הראשון של הסמסטר בנוי מתרגילים קטנים שמגישים לבד (שעתיים עבודה) (בין 2 ל3 תרגילים). \nלאחר מכן ועד סוף הסמסטר ההגשות הן בקבוצות (אצלנו היה קבוצות של 5) לטוב ולרע. אם יש חבר'ה עם פחות מוטיבציה בקבוצה תתכוננו לעבוד קשה יותר.. (עוד 3 הגשות בערך, זמן העבודה משתנה ממש כתלות בקבוצה)\n\nהמבחן: אין מבחן. תרקדו\n\nפרויקט: רוב הציון בקורס הוא על הפרויקט, בוחרים חברה כלשהי, מבצעים עליה ניתוח עם כלים שנלמדים בקורס ובונים עבורה תוכנית עסקית. בסוף התוצרים אצלנו היו דף סיכום ומצגת אותה הצגנו מול הכיתה. הפרויקט בהיקף בינוני מבחינת ההשקעה ושוב הרבה תלוי בחלוקת עבודה בקבוצה.\n סה\"כ מעניין ונחמד ליישם את הכלים שנלמדו בקורס, בעיקר מי שהעולם הזה קורץ לו. \n\nהשורה התחתונה: \nקורס מומלץ מאוד למי שמתעניין בתחום. תעשו טובה לאחרים, אם אתם רוצים לסמנו מל\"ג אל תבואו לקורס הזה.", "timestamp": 1688554724943}, {"author": "BD", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה:הוכברג יואב \nחוות דעת - הרצאות: מצגות מסורבלות, נוכחות חובה, משעמם \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: היו כמה שיעורי בית במהלך הסמסטר, בהתחלה ההגשה ביחידים ואז עם הקבוצה שתעשו איתה את ההצגה. יש הצגה בסוף שכל חברי הקבוצה עושים ומציגים\n\nהמבחן: אין\n\nהשורה התחתונה: בכלל לא מומלץ, אין ציונים טובים אלא אם אתם ממש משקיעים בקורס. תתרחקו!!!", "timestamp": 1694694625746}]}