{"posts": [{"author": "Lev Gershman", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: תמר שניידר\nחוות דעת - הרצאות: \nהרצאות מעניינות גורמות לך לחשוב על כל מיני דברים פילוסופים וגישות אבולוציוניות וביולוגיות שהאמנת שהן נכונות. \n\nשעורי הבית: \nלפני כל שיעור צריך לרשום משפט על המאמר שהשיעור יתעסק בו, לוקח חמש דקות לעבור בכללי על הדף הראשון של המאמר. \nפעם בשבועיים צריך לרשום פסקה שתיים על אחד מהמאמרים שדיברו עליהם בהרצאות. לוקח חצי שעה-שעה אם הגזמת. אם הקשבת בשיעור לא אמור לקחת יותר מדי זמן\nבסוף הקורס צריך לעשות הרצאה של עשר דקות בקבוצות של עשר דקות מועבר באווירה קלילה ונחמדה. \nסה\"כ מל\"ג ממש נחמד, לא דורש יותר מדי השקעה ותמר מעבירה אותו בצורה ממש קלילה, יוצרת דיונים בכיתה.\n\n\nהמבחן: אין\n\nהשורה התחתונה: מלג נחמד ללא מבחן אבל דורש טיפה התעסקות תוך כדי הסמסטר ובשבוע האחרון.", "timestamp": 1657701749622}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: תמר שניידר \nחוות דעת - הרצאות: הקורס מועבר פרונטלי, החומר מאוד מעניין בעיניי ותמר מציגה אותו בצורה מעניינת ואינטראקטיבית כך שגם הסטודנטים משתפפים בדיונים. יש חובת נוכחות של לפחות 10 שיעורים מתוך 13.\n\nשעורי הבית: בכל שבוע צריך לקרוא מאמר של כ15 עמודים ולהגיב עליו ב2-3 שורות בפורום. בנוסף היו 4 מטלות הגשה במהלך הסמסטר של כתיבת כחצי עמוד.\n\nהמבחן: הייתה פרזנצטיה קבוצתית בשבועות 12-13, כל קבוצה מציגה את אחד המאמרים לאורך הסמסטר. בנוסף סיכום של שני עמודים באותו הנושא. קצת חופר אבל לא מאוד נורא. \n\nהשורה התחתונה: סה\"כ נהניתי, תמר מקסימה והחומר מעניין, אבל בתכלס הקורס קצת עמוס יחסית למלג (במצטבר המטלות לוקחות לא מעט זמן ממהלך הסמסטר, הפרזנצטיה ממש בסוף הסמסטר)", "timestamp": 1658659261918}, {"author": "~~", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nמרצה מקסימה אבל הייתה לי בעיה עם הקורס הזה. אסביר בסוף\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מלג אין תרגולים\n\nשעורי הבית: \nהציון מתבסס על מטלות קריאה והגשה לאורך כל הסמסטר + הרצאה קצרה של 10 דקות שצריך להעביר בסוף הסמסטר.\n* דורש המון זמן, לא פרופורציונלי למלג!!!* \n\n1) מדובר על כל שבוע מאמר פילוסופי ארוך מאוד במדעים, שכתוב בשפה ארכאית ומתנשאת ולא מובנת(באנגלית). פשוט עינוי כל שבוע מחדש ולוקח ים זמן, ואחרי הקריאה צריך להגיב בפורום משהו לגביו. \n\n2) 4 מטלות כתיבת חיבור על 4 מאמרים שקראנו לאורך הסמסטר, לכאורה לא נורא אבל המאמרים פשוט מזעזעים ודורשים ידע מוקדם בביולוגיה אחרת אתה כל שניה בגוגל לבדוק מושגים.\n\n3) הכנת מצגת על אחד המאמרים כדי להציג אותה בכיתה + סיכום אישי כמה כיף היה לך להכין את המצגת.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: \nלקורס יש פוטנציאל ותמר היא מרצה מקסימה אבל היא לא מבינה את מקומו של מל\"ג. ההרצאות היו מלאות במונחים ומושגים מביולוגיה שנזרקו לאוויר כדרך אגב ומי שאין לו רקע פשוט מאבד את זה. בנוסף לכך שום דבר לא מוגדר באופן מדעי הכל פילוסופי ואבסטרקטי ממש לא תואם את התיאור של הקורס.\n*מלג לא מומלץ*", "timestamp": 1689246917916}, {"author": "מעריץ של הסופר", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: תמר שניידר\nחוות דעת - הרצאות: \nמעניין רק למי שאוהב דיונים פילוסופיים. \nניסיתי להקשיב מדי פעם אבל מהר מאוד זה תמיד מגיע לזה, זה מהות הקורס.\n\nלא חייב להקשיב, אבל זה כנראה יקל על מטלות הכתיבה והמטלה הסופית.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nכמו שרשמו יש מטלה שבועית להגיב למאמר. המאמרים ארוכים מאוד, עשרות עמודים. ממש לא מתאים. זה רק להתמקד בפסקה שתיים או להעזר ב ChatGPT. \n\nיש 4 מטלות כתיבה על מאמרים שלמדנו. \nגם, מי שלא מקשיב זה בעיה. צריך לחפש תשובות במאמר או להעזר ב ChatGPT. \n\nבסוף מטלת הצגה קבוצתית על מאמר שלמדנו וסיכום אישי/זוגות.\nזה כבר נהיה קשה בלי להבין במהלך הסמסטר מה קורה.\nכמובן עדיין ניתן לעזר ב ChatGPT.\n\nהמבחן: המטלה הקבוצית והסיכום. \n\nהשורה התחתונה: \nמבחינת עניין - רק למי שרוצה דיונים פילוסופיים שחוזרים על עצמם כל שיעור מחדש בנושא ביולוגיה. \n\nמבחינת השקעה - זה דורש זמן, אבל בעזרת הצ׳אט קצת פחות.\nיש בזה משהו מעיק כשזה נכנס בלוז ועוד כשהקורס לא מעניין אותך, אבל פתיר.", "timestamp": 1690836430027}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תמר שניידר\nחוות דעת - הרצאות: \nתמר ממש נחמדה, קשובה לבקשות של סטודנטים ורואים שהיא מאוד אוהבת את התחום ונהנת להרצות עליו.\nבכל הרצאה מדברים על מאמר כלשהו שקשור לפילוסופיה של המדע בהקשר של מיקרובים. בין הדברים שדיברנו עליהם: מהי הגדרה של יצור חי / סופר אורגניזם / מטאגנום / הולוביונט והולוגנום / מחקרים שקשורים למיקרובים והשפעתם על משקל ופסיכולוגיה / איך צריך להגדיר ולהתייחס למיקרוביום בגוף האדם. \n\nשעורי הבית: \nיש לא מעט מטלות לאורך הסמסטר.\n**כל שבוע לקרוא מאמר של 15 עמודים בערך ולהגיב עליו בפורום משפט או שניים (אפשר לרפרף על המאמר ולהגיב משהו כללי בפורום).\n**על 4 מהמאמרים תמר מפרסמת שאלות שצריך לענות עליהן בתור משימה להגשה במודל, אם עוקבים אחרי ההרצאות בכיתה זה יחסית בסדר. \n**פרזנטציה שבה בוחרים מאמר אחד ומדברים לעומק על אחד הטיעונים שבו. זה קורה בשבועיים האחרונים של הסמסטר.\n**סיכום של הפרזנטציה בסדר גודל של שני עמודים שבו מרחיבים על הנושא שהצגנו בפרזנטציה. ההגשה של הסיכום פתוחה ליחסית הרבה זמן, אצלנו היא הייתה לשבוע אחרי סוף הסמסטר.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: \nעמוס יחסית למלג, אבל אם משקיעים בעבודות לאורך הסמסטר כנראה תסיימו עם ציון גבוה.\nנקודה חשובה - המאמרים באנגלית ומדברים בהם על כל מיני מושגים מדעיים אז בלי רקע ביולוגי כלשהו זה יכול קצת להקשות.", "timestamp": 1691580773957}, {"author": "חלוץ סטטי", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: תמר\n\nאקדים ואומר, שלמרות שהביקורת לא חיובית, היא לא רלוונטית לכל הסטודנטים, יש סטודנטים שיכולים להתחבר למל\"ג הזה, לאופי ההרצאות וכו'. לטעמי המל\"ג הזה עמוס בצורה חריגה למל\"ג טכניוני, דיי \"משעמם\" (לרוב המוחלט של הסטודנטים), ולא שווה את הציון הגבוה שמקבלים בסוף בלי מבחן. תמר באמת מקסימה ועם תשוקה למה שהיא עושה, אני רק רוצה להזהיר סטודנטים אחרים שככל הנראה, כמוני, לא מתחברים לנושאים של הקורס, ועלולים להיות מוטעים ולא להבין שמדובר בקורס שהוא פילוסופי (כמעט) לגמרי.\n\nחוות דעת - הרצאות: לפני שהגעתי לשיעור הראשון, חשבתי שהקורס יעסוק בנושאים מנקודת מבט מדעית הרבה יותר ממה שמתרחש בפועל. ידעתי שיש היבט פילוסופי לקורס, אבל לא תארתי לעצמי שהוא יהיה ברמה של 95%. גם בתור מישהו שהגיע לקורס אחרי קורס בביולוגיה, ואחרי שסיימתי את ביולוגיה אם ציון דיי טוב - ההרצאות לא עניינו אותי. יש ציונים גבוהים אבל זה עדיין מבאס להגיע כל שבוע לשעה וחצי ששום דבר מהנאמר בהן לא באמת מעניין אותך. תמר מאוד מתלהבת מהחומר שהיא מלמדת ורואים שהיא באמת רוצה להעביר אותו בצורה המעניינת ביותר, היא באמת מתאמצת. אני חושב שאני, ולפחות 80 אחוז מהסטודנטים לא התעניינו באמת בהרצאות שמועברות, ובהתקטננויות הפילוספיות-מיותרות (בעיניי) של מה ההבדל בין חיידק למיקרוב ומה מביניהם חי, ולמה, ואיזה ויכוח עיקש וסוער התרחש באיזו נישה אקדמית בעקבות כך. השורה התחתונה היא שמומלץ שתתעניינו בפילוסופיה של ביולוגיה ודברים דומים אם אתם רוצים להירשם לקורס הזה. כמובן שאפשר לשבת ולא לעשות כלום ולא להקשיב, אבל לדעתי זה לא מכבד, ומיותר. ובנוסף, לחוסר ההקשבה יש עוד השלכה עליה אפרט מיד.\n\nחשוב מאוד לציין שמדובר במל\"ג עמוס ביותר לטעמי. כל שבוע יש מאמר שצריך לקרוא, באנגלית לא קלה בכלל (גם למי שקיבל 150 באנגלית בפסיכומטרי), ולאחר מכן צריך לכתוב כמה משפטים על המאמר בפורום הייעודי לכך במודל. ב2 מאמרים הראשונים ממש התאמצתי ובזבזתי שעתיים-שלוש על כל מאמר. בשלב מסוים החלטתי לקרוא רק כמה פסקאות או לראות על מה אחרים כתבו ולהתאים את עצמי. אפשר תכלס גם להיעזר בGPT אבל לא הייתי סומך עליו. דבר נוסף הוא המטלות שיש כל שבועיים - אלו מטלות כתיבה, מצופה מכם לענות על כמה שאלות פתוחות, ולכתוב סדר גודל של כמה מאות מילים על כך. לא מדובר בשאלות קלות בכלל, התשובות אליהן לא מופיעות באופן מפורש במצגות של תמר, צריך ממש להסיק מסקנות - כלומר לפעמים אין לשאלות הללו תשובה מפורשת אפילו לא במאמרים הארוכם עצמם. מי שלא הקשיב בשיעורים של תמר ופשוט נמצא בשיעור מאוד יתקשה עם זה. לא רק שיקבל ציון נמוך יותר על המטלות האלו, אלא גם יבזבז זמן רב על נסיון לענות עליהן, פה GPT וקריאה של 2 פסקאות לא יעזרו. יש 4 מטלות כאלה בכל הסמסטר.\nבנוסף והכי חשוב - לקראת סוף הסמסטר מתחלקים לקבוצות, צריך לבחור את אחד מהמאמרים שעברנו עליהם במהלך הסמסטר, להכין פרזנטציה כיתית לגביו, ולהכין סיכום של כמה עמודים בנושא. אלו מטלות לא קלות בכלל, שגוזלות המון זמן רב בנקודות קריטיות של הסמסטר.", "timestamp": 1691626849401}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: מי שמתעניין בנושאים הפילוסופיים של המדע יהנה בקורס. אני פחות התחברתי ורוב ההרצאות היו משעממות עבורי, ולדעתי עבור חלק גדול מהסטודנטים שלא ידעו שהקורס באמת כזה פילוסופי ופחות מדעי נטו. *לא להתייחס לביקורת המפרגנת יתר על המידה שנכתבה פה, ההשקעה היא לא \"יחסית גבוהה למל\"ג\" אלא השקעה גבוהה מאוד כמעט כמו קורס רגיל  של 3 נק\"ז בטכניון. מעמיס מאוד על הסמסטר*\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1691743620346}, {"author": "צייד מלגים", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: תמר שניידר\nחוות דעת - הרצאות: נחמדות, לרוב חצי דיון פילוסופי על מאמר שעליו נדרשנו להגיב בפורום וחצי הסבר ומעבר על מצגת של תמר על המאמר.\n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: אין\n\nשעורי הבית: פעם בשבוע נדרשים לקרוא מאמר באנגלית ולהגיב בפורום. נשמע קצר ואפשר לנסות לא לקרוא הכל אלא רק חלק ולהבין באופן כללי את המאמר ולהגיב אבל בכל זאת אלא אם אתם ממש זורקים על הקורס זה יקח לפחות שעה וחצי מהחיים שלכם פעם בשבוע. פעם בשבועיים + - יש מטלת כתיבה של מענה על שאלות (גם כאן לוקח שלוש שעות מהחיים שלכם בכיף)\n\nהמבחן: אין- יש פרזנטיצה קבוצתית בסוף הסמסטר והגשת סיכום אישי על הפרזנטציה. (לא נורא בכלל)\n\nהשורה התחתונה:מלג נחמד עם ממוצע יחסית גבוה אבל דורש יחסית הרבה ואם בא לכם מלג שלא דורש השקעה בכלל אז תוותרו מראש. אם מעניין אתכם פילוסופיה ומיקרוביולוגיה אז אחלה מל\"ג ותמר באמת משקיעה ומרגיש שחשוב לה הדיונים בכיתה. מי שרוצה מל\"ג בלי מבחן, שמוכן להשקיע ולקבל ציון מעל 95 - ממליץ", "timestamp": 1691941191769}]}