{"posts": [{"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: ישראל\nחוות דעת - הרצאות: תותח! ההרצאות מעניינות רצח, אבל באנגלית\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין  \n\nהמבחן: אני חושב את עצמי יודע אנגלית די טוב אבל זה התקיל אותי במבחן (הוא באנגלית). ברור שאם אתה לא מבין משהו במהלך הבחינה ישראל יבוא ויתרגם אבל עדיין... \n\nהשורה התחתונה: מעניין, מלמד, קליל, מבחן קצת באסה", "timestamp": 1657448630195}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ישראל נאמן\nחוות דעת - הרצאות: הרצאות מעניינות, לישראל יש מלא ידע והוא מעביר אותו בהתלהבות תוך שיחה עם הסטודנטים וממש מעניין להקשיב לו.\n \nאין שיעורי בית.\nיש דף נוכחות שעובר כל כמה שיעורים שצריך לחתום בו.\n\nהמבחן: ממש סבבה, 20-25 שאלות אמריקאיות שאם לומדים את הנושאים כמו שצריך יום-יומיים לפני אפשר להוציא אחלה ציון.  \n\nהשורה התחתונה: אחלה מל\"ג ממליץ בחום וסוגר את הפינה של קורס אנגלית לבעלי פטור.", "timestamp": 1690275464731}, {"author": "O.R.", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ישראל נאמן\nחוות דעת - הרצאות: מעניינות מאד. ההרצאות באנגלית.\n\nשעורי הבית: אין\n\nהמבחן: אמריקאי, קל, ממוצע גבוה. ישראל מכוון שמי שהיה בשיעורים ידע את התשובות בקלות.\n\nהשורה התחתונה: קורס סופר מומלץ. אני כותב חוות דעת הרבה אחרי שנגמר הסמסטר, בתקופת \"חרבות ברזל\", כי אני מוצא את עצמי מבין הרבה יותר דברים במצב הנוכחי בעקבות הקורס הזה. הקורס הזה תרם לי הרבה מאד ידע בנושא ונקודת מבט עמוקה יותר על טרור בכלל ועל הסכסוך הישראלי פלסטיני בפרט. שמח מאד שלקחתי את הקורס הזה כקורס בחירה חופשית (זה לא מלג למיטב ידיעתי) כי התלבטתי מאד אם לקחת קורס באנגלית כשאני לא חייב.", "timestamp": 1697206338000}, {"author": "דארק ביט", "difficultyRank": 3, "generalRank": 2, "semester": "202302", "text": "עוסקים יותר מדי בתיאוריה, לא נותנים שום תרגול פרקטי.", "timestamp": 1710098971881}, {"author": "מרוואן עיסת בשר", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ישראל  נאמן\nחוות דעת - הרצאות: \nלדעתי ההרצאות של ישראל היו מרתקות, נתנו המון ידע במגוון מאוד רחב של נושאים מאוד רלוונטים ונותן לך הבנה על מה מניע טרור ומאיפה מגיע הג'יהאד. ישראל יודע לנווט את הכיתה טוב, והמון הרצאות היו דיון פתוח עם הסטודנטים, שלדעתי לימדו אותנו הרבה כי הוא בנאדם עם ידע עצום בנושאים האלה. לכאורה יש נוכחות חובה בהרצאות, היא לא באמת נאכפה הסמסטר, אבל שווה להגיע בעיקר כי הן מעניינות.\n\nהמבחן: סבבה לגמרי, ישראל נותן 50~ מושגים שצריך לדעת (רובם מאוד שטחיים - מי זה נסראללה, איזה עימותים גדולים היו בין חמאס לישראל), שעתיים למידה יום לפני המבחן ואתם סגורים על החומר (אם הייתם בהרצאות) \n\nהשורה התחתונה: מל\"ג מרתק", "timestamp": 1713529331074}]}