{"posts": [{"author": "sad anon", "difficultyRank": 4, "generalRank": 2, "semester": "202001", "text": "שם המרצה: רעות-רינה בנדריהם \nחוות דעת - הרצאות: כל הרצאה מרגישה כמו שיחת חונכות בתיכון (לאילו שמכירים). היא דורשת מצלמות פתוחות שזה קצת מציק, אבל בסה\"כ אפשר לשרוד. אישית לא הקשבתי להרצאות בכלל, לא שזה שינה הרבה.\n\nשעורי הבית: המרצה מביאה בסוף כל מצגת PPT כמה מאמרים לקרוא. הם ארוכים ולוקחים יותר מדי זמן לקרוא ובכל מקרה החומר הרלוונטי שבהם נמצא במצגות אז לא באמת צריך לקרוא אותם.\n\nהמבחן: הייתה עבודה שאפשר היה להתחיל אותה באמצע סמסטר. לוקחת בערך 4 ימים שלמים (עדיף לנצל את אחת מהחופשות שיש בתקופת הלימודים בשביל לעשות אותה). הבדיקה לקחה זמן (שבועיים+) והמרצה לא הייתה הכי רחמנית בבדיקה. בדיון על הפקטור (שמתקיים בעת כתיבת חוות דעת זו) היא טענה שהיא לא חושבת שציונים גבוהים זה בהכרח דרישת חובה לקורסי מל\"ג (תבינו את מה שתרצו להבין מזה), אבל היא כן ניסתה/מנסה לבוא לטובתנו (אבל זה רק כי היא מודעת לבעייתיות בדרישות שלה).\n\nהשורה התחתונה: לא הייתי לוקח שוב", "timestamp": 1615491837916}, {"author": "Depression", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "חוות דעת - הרצאות: חלקם מעניינות , בעיקר כשיש דיונים , כאשר איו דיונים בדרך כלל די משעמם.\n\nעבודה: ארוכה ממש מעצבנת המרצה מצפה ממך איכות הכתיבה של סטודנט לסוציולגיה ונותנת ציונים לפי זה. אל תטעו הממוצע נראה כך מכיוון ולאחר קבלת הציונים ניהלנו דיונים ארוכים איתה עד שכנראה התייאשה ונתנה פקטור של 10 נקודות \n\nהשורה התחתונה: לא ממליץ הממוצע הוא אך ורק נראה כך עקב הדיונים שלנו איתה ונראה כי לא תעשה פקטור כזה שוב בסמסטרים הבאים.", "timestamp": 1618861720439}, {"author": "---", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "הרצאות עם נוכחות חובה\nאין מבחן\nאין ש.ב\nהפרויקט מעיק והמרצה לא מפרגנת בציונים, נאלצנו להתחנן לפקטור", "timestamp": 1629887043040}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: רעות בנדרהיים\nחוות דעת - הרצאות: לא קריטי להקשיב למה שהיא אומרת בכיתה, ולהשתתף בדיונים לא יעזור לך לקבל ציון טוב בעבודה הסופית. שותפה שלי השתתפה בדיונים כל הזמן וממש הייתה (היינו) רציניות, בסוף קיבלנו 80 על העבודה ולא הצלחנו לשנות את דעתה לעלות לנו את הציונים\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: \nצדקו במה שנאמר בחוות דעת של הסמסטר משנה קודמת, בדיקה לא הוגנת בכלל, היא מצפה מאיתנו לכתוב עבודה כמו סטודנט לסוציולוגיה. אם תנסו לערער על כל טענה שבגללה החסירה נקודות(והיא מחסירה לא מעט אם חסרה מילה שהיא רצתה לראות), יהיה לה תשובה פילוסופית מסודרת כמו \"למדנו בכיתה\" ו \"אמרתי את זה כבר\" למרות שרוב הסטודנטים הסכימו שלא ברור מאוד מה היה צריך לעשות בעבודה הסופית. לכן אם תקחו את הקורס אני ממש ממליצה להתחיל לכתוב את העבודה בחופשה הראשונה שתהיה בחורף\\אביב, ואחרי שאתם כותבם כל חלק (דף או שתי דפים) תלכו תסבירו לה על מה המחקר שלכם ותבקשו פידבק, היא יותר נחמדה לסטודנטים שמגיעים ומשתתפים בכיתה, והיא לא תסכים שתגישו עבודה שלמה ושתתן לכם פידבק בטלפון או במייל, היא לא תתן לכם לתקן אחרי שהגשתם!\nהמבחן: \nאין\nהשורה התחתונה: מלג לא מומלץ ,ולא חשוב למרצה שתקבלו ציונים גבוהים! כך הרגשתי לפחות:(\nבהצלחה בכל מקרה!", "timestamp": 1650675409317}, {"author": "סטודנט ממורמר מהקורס", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמעניינות במידה מסוימת. כל שיעור יש דיון על איזשהי נושא חברתי. \n\nשעורי הבית: \nהמרצה נתנה שיעורי בית למרות שלא רשום בסילבוס ולא נכלל בציון הסופי. לא סבבה. \n\nהמבחן: \nאין מבחן. עבודה סופית. נתנה ציונים נמוכים הורידה נקודות על דעות אישיות שלה ועל דברים כמו, ״אני הייתי חושבת/עושה אחרת״. לא עונה למיילים או ערעורים. \n\nהשורה התחתונה: \nמלג מאוד לא מומלץ. לא מעניין את המרצה אם יש השתתפות פעילה או השקעה.", "timestamp": 1650896841178}]}