{"posts": [{"author": "אנונימי", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: \nהרצאות משעממות \n\nשעורי הבית: חובה לעשות \nלא נכללים בציון \nאבל זה שיש שיעורי בית במלג זה על הפנים\n\nהמבחן: קשה, לא מובן, מנוסח גרוע\n\nהשורה התחתונה: מלג מאוד    לא     מומלץ", "timestamp": 1611499020821}, {"author": "מעיין", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: אליק\nחוות דעת - הרצאות:  מאוד מעניינות אם אתה נהנה מהנושאים של הקורס\nויכולות להיות מעניינות גם אם אתה לא מתעניין בנושאים\nהמרצה מאוד נחמד ומסביר היטב את החומר\n\nשעורי הבית:  בערך שעה בשבוע (קצת חומר קריאה להעשרה על הנושא של ההרצאות)\nושאלה קצרה וקלה\n\nהמבחן: על החומר של הקורס (של ההרצאות)\nדורש כמה שעות של למידה לפני (חזרה על החומר)\nהיו מספר קטן של שאלות עם תשובות בעייתיות יותר אבל כנראה שבמועדים הבאים המצב ישתפר\n\n\nהשורה התחתונה:  מומלץ בחום, לא מלג של 100 קל אבל אם מקשיבים בהרצאות אפשר לקבל 100 יחסית בקלות ולפחות 90 בלי בעייה", "timestamp": 1611499480804}, {"author": "המפל", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות:  הרצאות מאוד מעניינות אפילו לאנשים שלא מגיעים מהתחום, בכללי קורס מאוד מעניין.\nהמרצה עצמו מעביר את השיעורים בצורה מאוד טובה ומאוד מעניינת ועונה על שאלות.\n\nשעורי הבית: כל שבוע יש שאלה לעשות שלוקחת 5-10דק וקטע קריאה פעם בשבועיים בערך שלוקח 15-30דקות, סך הכל בממוצע 15-20דק בשבוע לשיעורי בית.\n\nהמבחן: מבחן לא מאוד קל, גם אם מקשיבים בשיעורים וקוראים עדיין המבחן לא קל בגלל שהניסוחים לא טובים, אבל עדיין אפשר לקבל ציון טוב במלג (90+) עם למידה קצת לפני המבחן.\n\nהשורה התחתונה:  מלג מאוד מעניין ומומלץ למי שרוצה מלג מעניין, זה לא מלג של 100 קל.", "timestamp": 1611499867454}, {"author": "Ari", "difficultyRank": 2, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: המרצה לא הבין שמל\"ג צריך להיות עם ממוצע גבוה. בכללי קורס משעמם וחסר פואנטה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: שאלות לא ברורות. מעצבן.\n\nהשורה התחתונה: אל תיקחו את הקורס!", "timestamp": 1611502309557}, {"author": "Mohammad A.Azab", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: החומר של הקורס הזה הוא הכי מעניין שהיה לי בטכניון. הקורס מתחיל בהקדמה והגדרת מהי מתודה מדעית ולמה יש ביקורת עליה. אחרי זה לומדים לוגיקה שמשרתת חקירה מדעית (אינדוקציה, דדוקציה...., השימוש בהם וככלי היסק...). החלק השלישי הוא הגדרת המתודה המדעית במדויק (האידיאלית) ואיך היא עובדת תוך שימוש בלוגיקה. ואחרי שחושבים שאין על המדע, מגיע החלק האחרון והוא ביקורות על המתודה הזו, שהוא חצי מהקורס בערך. ולאט לאט הביקורות האלה הורסות כל מה שתלמדו בקורס עד החלק השלישי.\nההרצאות שעתיים בשבוע, יש חובת נוכחות ל80% מהן. לדעתי כדאי להיות נוכחים בכולן, ובאמת להקשיב ולהבין כי זה נורא מעניין.\nאליק נחמד כמרצה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כל שבוע יש תרגיל קצרצר על השיעור האחרון או הכנה לשיעור הבא. חובה להגיש  80% ומעלה מהן, והן לא נכללות בחישוב הציון. הוא היה נותן גם מטלות קריאה של כמה עמודים, אני לא קראתי אף פעם ובכל זאת יש לי ציון מאוד גבוה בקורס. הסרטונים ביוטיוב שהוא נתן כן צפיתי בהם כי הם נחמדים. לדעתי אפשר גם בלי והעיקר להבין מה נאמר בשיעורים.\n\nהמבחן: \nהמבחן שלנו (מועד א) הכיל כמה תקלות: שאלות לא מנוסחות כמו שצריך, דברים שאף פעם לא דיברנו עליהם בשיעור בצורה מורחבת...\nוהדברים האלה בוודאי גרמו לממוצע הנמוך (יחסית לשאר המל\"גים) שהוא בכלל ככה אחרי פקטור. הוא הועבר במודל, והכיל 22 שאלות אמריקאיות כשצריך לבחור 20 מהן ולענות עליהן.\nהשורה התחתונה: אני כן ממליץ עליו בסך הכל, אבל חייבים להתעניין בו כדי להשיג ציון יפה.", "timestamp": 1611532047666}, {"author": "מתודה", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: \n\nקורס לא מעניין וגם לא ברור, המרצה כל הזמן משנה ניסוחים כי קלט שטעה, הסטודנטים נכנסים איתו לשיחה אישית וכבר לא ברור אם זה חלק מהשיעור או לא וזה רק יוצר עוד בלבול. רמת הקושי של השיעורי בית ממש לא תואם את הרמה של המבחן. מבחן מזעזע ברמה גבוהה מאוד ביחס לחומר הנלמד, לא מנוסח טוב וגם אם יודעים את החומר שעה לא מספיקה לענות על 20 שאלות, הציון הכי נמוך שיש לי בתואר. ממש לא מומלץ, להתרחק מהמל\"ג הזה!!!!", "timestamp": 1611565365539}, {"author": "מישהו", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמבחן בדיחה. שאלות לא מנוסחות נכון (*לא רק* לא ברור).\nהשורה התחתונה: \nמרצה חלש עם רמת משכל בינונית בערך. הגיוני שקיבל את הדוקטורט שלו הרי ידוע שיש חוסר ביקוש בלימודי הפילוסופיה בארץ.\nהוא חושב שממוצע נמוך כי הוא חושב שיש לו את היכולת להביא מבחנים קשים, אבל האמת היא שחלק גדול מהממוצע הנמוך נובע מהבעייתיות ששאלות המבחן.\nא- למרות שזו לא משימה קשה, הוא לא מצליח לנסח שאלות בצורה נכונה מבחינה שפתית במבחן. \nב- הוא מביא שאלות שלפי ההרצאה, רק שתיים מהתשובות הינו נכון והשאר לא. אך הוא סתם מחליט שאחת מהן נכונה חחח.\nג- שאלות טיפשיות - נגיד למשל, הוזכרו 2 אנשים בהרצאה שאחד מהם אמר X והשני אמר Y, ששתי האמירות X ו- Y מאוד דומות, הן שונות רק קצת, ואז הוא מביא שאלה במבחן: מה הראשון אמר? ואז בתשובות יש גם את X וגם את Y. נו ומה? זה מטופש.\n\nמל\"ג זוועה. ממוצע 83 וזה אחרי 5 נקודות פקטור! אני מסיים את התואר במדעי המחשב בהצטיינות וקיבלתי איתו 80 אחרי פקטור.", "timestamp": 1612026164204}, {"author": "anon", "difficultyRank": 4, "generalRank": 1, "semester": "202001", "text": "שם המרצה: אליק\n\nחוות דעת - הרצאות: \n\nקורס שהמרצה מעביר כדאי להרגיש חכם ולא בשביל ללמד, כל הקורס נועד לכך שהסטודנטים יסכימו איתו, או לא יסכימו בדרך שהוא מסכים איתה... \n\nהמבחן: \n\nהמבחן הוא 20 שאלות אמריקאיות לא ברורות, ממוצע על הפנים למל\"ג (גם אחרי 5נק פקטור) , והוא עונה לערעורים בזה שהיו 5 נקודות פקטור, אז אם אתה מרגיש ששאלה X לא הוגנת, תעמיד פנים שהפקטור עלייה. \n\nהשורה התחתונה: \n\nממש ממש לא מומלץ", "timestamp": 1612177206896}, {"author": "מה", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: ההרצאות בסדר. החומר עצמו מעניין, אבל מקצועות פילוסופיה מושכים אנשים שאוהבים להתווכח, וגם המרצה לא אוהב לוותר כל כך מהר על הוויכוח אז הרצאות יכולות להיגרר למקומות שלא רלוונטיים ולא כל כך מעניינים,  בעיקר כתוצאה מסטודנטים ולא שהמרצה בעייתי.\n\nשעורי הבית: צריך לעשות 80%, אבל אין עליהם ציון ולוקחים בין 10 דקות לחצי שעה (תלוי בהאם יש חומר קריאה) ובעיקר מהווים כלי למרצה לדעת על מה לחזור ומה להדגיש\n\nהמבחן: אמריקאי, 20 שאלות בשעה. יש אנשים שמתקשים עם זה, אבל אני סיימתי את כל המבחן תוך חצי שעה, כי רוב השאלות מיידיות. מועד א' היה מאוד בעייתי, וניתן פקטור של 5 נקודות, אבל השאלות היו מנוסחות בצורה שדרשה שינון מוחלט של הניסוח מההרצאה וזה אכן היה בעייתי. עכשיו עשיתי מועד ב' והוא היה הרבה יותר טוב מהבחינה הזו. לא ראיתי את הציון אבל מרבית השאלות היו ברורות מאוד, ולאחר תשאול המרצה כולן היו ברורות, והוא היה מאוד בסדר עם המענה על השאלות והנהלים של הקורס בכללי.\n\nהשורה התחתונה: אם הנושא לא מעניין אתכם או שיש לכם מהירות קריאה מאוד נמוכה ומקצועות רבי מלל מפחידים אתכם אז הקורס לא מאוד מומלץ, אבל אם כן מעניין אתכם מדע ולא אכפת לכם לקרוא (קצת) אז אני כן הייתי ממליץ על הקורס, בהנחה והמועד ב' מצביע על השתפרות של המרצה בכתיבת מבחנים שתישמר לסמסטר הבא.", "timestamp": 1614168984842}, {"author": "rg", "difficultyRank": 2, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: הקורס עוסק בפילוסופיה ולוגיקה, חומר שדורש עקרונית ריכוז ומאמץ אינטלקטואלי, מצד שני אליק עובר על הדברים מאוד לאט וכל הרצאה מתחילה במה שהיה בהרצאה הקודמת ככה שאפשר להבין הכל גם אם פוזלים לטלפון פה ושם.\nהנושא עצמו של הקורס סופר מעניין, וממש נוגע לכל מי שלומד משהו שקשור למדע בסיסי ומנסה להבין על מה כל מה שהוא עושה מתבסס בכלל.\nאליק ממש נחמד ומעביר את החומר בצורה טובה מאוד לדעתי, החיסרון הוא נטייה של סטודנטים חפרנים לבוא לקורס הזה ולאכול לכולם את הראש.  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: באופן חריג זה מלג עם מטלות בית שחובה להגיש אבל אין עליהם ציון. בפועל לא לוקחות יותר מרבע שעה גג.\n\nהמבחן: במועד א' שהיה הפעם הראשונה שהועבר המבחן היו כמה שאלות קצת טריקיות שדרשו ריכוז מעבר לסטנדרט במל\"ג, ובאמת נתנו פקטור 5 נקודות. לדעתי מי שהיה מאופס באמת על החומר אין סיבה שיצא עם פחות מ90.\n\nהשורה התחתונה: מל\"ג קצת יותר תובעני מהשאר אך לדעתי האישית שווה את זה כי הוא הרבה יותר מעניין ורלוונטי מהאחרים. למי שפשוט מחפש מל\"ג עם הממוצע הכי גבוה אז יש אופציות יותר טובות.", "timestamp": 1625405191505}, {"author": "AY", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "חוות דעת - הרצאות: חומר מעניין, אך תובעני בשביל מל\"ג.\n\nשעורי הבית: מאמר קצר\\סרטון ואחריו שאלות\n\nהמבחן: אמריקאי מבלבל. לא מומלץ.\n\nהשורה התחתונה: מתחרטת שלקחתי - הקשבתי בשיעורים ולמדתי לפני ועדיין ציון לא מספק עבור מל\"ג.", "timestamp": 1625485196425}, {"author": "s", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: קורס שני שאני לוקח עם אליק, ואני ממש אוהב את הסגנון שלו. יש לו מצגות *מאוד* מסודרות, ובתחילת כל מצגת יש חזרה על המצגות הקודמות, כך שלא שוכחים את החומר. הקורס מעניין לדעתי ואליק מעביר אותו בצורה די טובה.\n\nתרגילי בית:\nיש תרגיל שצריך לעשות כל שבוע, שהוא קריאה של כמה עמודים + מענה על שאלה/כמה שאלות במודל.\nאין צורך בכלל לקרוא את החומרים כדי ללמוד למבחן, והתרגילי בית הם בעלי ציון בינארי אז אפשר לרשום סתם תשובה.\n\nהמבחן: \nאישית כמעט ולא נגעתי בקורס כל הסמסטר ולמדתי יומיים לפני המבחן, אפשר לעשות את זה כי המצגות והחומר מסודר, וכמעט ולא צריך לשנן את החומר אלא רק להבין. אז במבחן צריך קצת להסיק ולהבין אבל לא משהו קשה.", "timestamp": 1630066404286}, {"author": "בני", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: מעניינות מאד, מועברות בצורה מאד טובה. המרצה מאד עירני, יודע ללמד, ובקי בחומר. לפעמים הוא מסתבך קצת בלענות על שאלות, או מתעכב יותר מידי על דברים קטנים, אבל לרוב הוא מלמד מעולה. החומר עצמו של ההרצאות מעניין ממש, נותן פרספקטיבה שונה על המדע, וטעימה של פילוסופיה.\nההרצאות גם מלוות במצגות מפורטות מאד, כך שקל לעכוב אחרי השיעור, המצגות מועלות למודל אז אפשר גם לדפדף בהן תוך כדי או אחרי השיעור אם מפספסים משהו. בתחילת כל שיעור המרצה עושה חזרה מפורטת יחסית על החומר של השיעור הקודם, כך שלא צריך להשלים לבד (במיוחד אם קוראים את החומר של שיעורי הבית).\nנוכחות חובה 80% כמו כל מל\"ג.\n\nשם המתרגל/ת: לא רלוונטי.\nחוות דעת - תרגולים: לא רלוונטי.\n\nשעורי הבית: חשוב לשים לב שהשיעורי בית תקפים (כתוב בסילבוס, והמרצה הדגיש בשיעור הראשון, אבל אנשים לא שמו לב ונדפקו..). בכל שבוע יש כעשרה עמודים לקרוא ושאלת שיעורי בית שעונים עליה במודל במשך שבוע.\nאני אישית קראתי בכל שבוע את החומר כי זה עניין אותי, אבל תכלס מקבלים נקודות על ההגשה עצמה ולא על תשובה נכונה, אז בשבוע עמוס אפשר לחפף קצת..\n\nהמבחן: המבחן קשה ביחס למל\"גים, והקורס חדש יחסית אז המרצה משתדל שלא יהיו שאלות ממוחזרות שידועות לכולם, אבל מצד שני ממש לא בלתי אפשרי להוציא מאה.\n\nהשורה התחתונה: אם אתם מחפשים מל\"ג של 100 ממוצע ב0 מאמץ - תברחו. אבל אם רוצים קורס מאד מעניין עם השקעה מסויימת, אבל לא גדולה, וציונים טובים, מומלץ בחום.", "timestamp": 1633971050750}, {"author": "אביגיל", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אלק פלמן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מאתגר\n\nהשורה התחתונה: כיף ומעניין, אבל דורש השקעה במהלך הסמסטר", "timestamp": 1644148232927}, {"author": "Yonex", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: \nמעניינות ויש מקום לדיון (לא ארוך וחפרני מדי) על הנושאים.  אליק מרצה מרתק והיה ממש כיף להגיע להרצאות שלו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאחרי כל הרצאה היה צריך לקרוא כמה עמודים בעברית (וכמה פעמים גם באנגלית) ואחרי זה לענות על איזה 2 שאלות פתוחות (קלילות).\nהשיעורי בית היו חובה אבל כל עוד ענית עליהם (גם אם התשובה לא נכונה) קיבלת עליהם 100\n\nהמבחן: \nמבחן אמריקאי בלי טריקים או נסיון להכשיל.  מי שהקשיב בהרצאות כל הסמסטר  ועשה את שיעורי הבית יכל לקבל 100 בלי בעיה. \n\nהשורה התחתונה:\nאחלה  קורס, אחלה מרצה, נותן נקודת מבט מעניינת על תחום המדע והפילוסופיה שמאחוריו.  מומלץ", "timestamp": 1646915326795}, {"author": "${name}", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: משעמם, מועבר בצורה משעממת ומרדימה\n\nשעורי הבית: כל שבוע הגשה!!! כל שבוע קריאה חובה על חומר שיהיה במבחן!!! \n\nהמבחן: קשה, ניסוחים מבלבלים, דורש למידה ויש דף נוסחאות (באמת?)\nהשורה התחתונה: להתרחק!!! לא מומלץ!!!", "timestamp": 1674718944541}, {"author": "לא חשוב", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס מזעזע! זה לא קורס ,זה תואר בפילוסופיה, אחד הקורסים הקשים שעשיתי במהלך התואר , לא מומלץ בכלל\nלהתרחקקקקקקקקקקקקקקקקקקקקקקקקקקק", "timestamp": 1674732074365}, {"author": "בדוי", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: \nלא מובנות, המרצה בונה על העובדה שנזכור בעל פה את כל הטרמינולוגיה בעולם ומאבדים אותו מאוד מהר, יותר מזה גם משעמם\nשם המתרגל/ת: אין (אבל צריך)\nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש לקרוא כ10 עמודים לשיעור שלא נשמע כזה נורא עד שזוכרים שזה אמצע סמסטר ויש עוד מיליון הגשות ואין זמן לנסות לפענח את האנגלית הלא ברורה\nהמבחן: \n ניסוח לא טוב, כמו על פסיכומטרי רק על דרך השלילה, יש המון המון חומר יחסית למלג ואפילו המרצה מודה מדיעבד שהוא טעה בניסוח השאלה\nהשורה התחתונה: \n\nלא מומלץ אלא אם אוהבים מאוד מאוד פילוסופיה ובאים עם רקע \nלהתרחק", "timestamp": 1674757933308}, {"author": "נעה עם ו", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אליק פלמן\n\nהשורה התחתונה: לא מומלץ, המבחן מכשיל, צריך לזכור מלא ולהבין, השאלות לא של ידע אלא של התקלות\nהרצאות שעה וחצי רצוף משעממות (לפעמים מוסיף עוד 5 דקות)\nמרגיש כמו קורס 4 נק\"ז\nתתרחקו!!!", "timestamp": 1674996887425}, {"author": "אביעד בר שי", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אליק פלמן\nחוות דעת - הרצאות: מעביר את החומר מעניין ועושה הרבה חזרות על החומר מה שמאוד תורם לחיבור ולקליטה של הנושא. כל שיעור מתחיל בחזרה מזורזת על השיעור הקודם מה שיוצר רצף בין ההרצאות והנושאים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: היו כמה מטלות קריאה שהיו די כבדות ומייבשות לקרוא אבל הרוב המוחלט היה לא ארוך או מתפלסף מדי.\nהמטלת בית האחרונה היא לענות על מבחן מסמסטר קודם והשיעור האחרון מוקדש לחזרה על החומר ומעבר על אותו מבחן מה שמאוד עוזר להבין את הטעויות ולהכיר את הסגנון של הדגשים שצריך לשים לב אליהם בשאלות לקראת המבחן.\n\nהמבחן: 21 שאלות אמריקאיות לא קשות ולא מאוד מתקילות שצריך לענות על 20 מתוכן נכון כדי לקבל 100. אם הקשבת כל הסמסטר בהרצאות ועשית חזרה- שתיים על המצגות שבמודל אין שום סיבה שהציון יהיה פחות מ90.\n\nהשורה התחתונה: קורס לא קשה ואפילו די מעניין. מאוד מומלץ", "timestamp": 1676565209130}, {"author": "Tom", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אליק\nחוות דעת - הרצאות: \nיכולות להיות מעניינות לפעמים, ולפעמים לא כל כך. מראים נקודות מאוד מעניינות לגבי המדע בכללי, אבל לפעמים מרגיש קצת כמו קשקוש.\nלפני כל הרצאה צריך לקרוא די הרבה חומר, שלפעמים הוא  מאודדדד משעמם ולא ברור, אבל לפעמים יש משהו נחמד.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \nאין\nשעורי הבית:\nלפני כל הרצאה צריך לענות על שאלה שקשורה לחומר שהיה צריך לקרוא, לא משהו נורא.\nמבחן:\nמועד א היה סביר (ממוצע 90), מועד ב היה זוועתי (ממוצע 73).\nהשורה התחתונה: \nאם יש משהו יותר טוב, אל תיקחו את הקורס הזה, אלא אם כן אתם מאוד אוהבים פילוסופיה.", "timestamp": 1678879668567}]}