{"posts": [{"author": "עדי יוסף", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: מעניין, בתחילת הסמסטר ראיתי את ההרצאות ובהמשך כבר פחות..\n\nשעורי הבית: יש מאמר בד\"כ באנגלית אקדמית, ולאחר מכן צריך לענות על שאלה או שתיים קצרות. השאלות נועדו לראות שקראת  את המאמר ולא נבדקות בנוקשות.\n\nהמבחן: מבחן אמריקאי היה ממש סבבה, יום למידה לפני וזה מספיק.\n\nהשורה התחתונה: לכו על זה", "timestamp": 1625484886713}, {"author": "רן", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אורי ערן\n\nחוות דעת - הרצאות:\nאם אתם אוהבים פילוסופיה, קחו את הקורס ואל תקראו את ההמשך. \n\nהנושא מעניין, ובתור אדם שמתעניין הפסיכולוגיה הקורס הזה נראה לי בול. אבל...\n\nאם אתם יותר בכיוון של פסיכולוגיה/גישה מדעית עבור הנחות, טענות, מאמרים ומחקרים - הקורס הזה לא בשבילכם. הקורס סובב סביב המון מאמרים, רובם עתיקים (המאה ה-19 ותחילת המאה ה-20) והמאמרים האלה הם לא מאמרים מדעיים, אלא דעתם האישית של הכותבים. לי אישית זה מאוד הפריע שהציגו טענות כנכונות וההוכחה היחידה לטענה היא שהיא עובדת במקרה מסויים מאוד.\n\nשעורי הבית: \nגיליון בשבוע -  כל אחד על מאמר פילוסופי אחר. יש כמה שאלות בודדות והבדיקה לא מעמיקה. אל תחשבו שזה כל כך קל בכל זאת כי רוב המאמרים כתובים בשפה פילוסופית ולא מובנת - צריך לקרוא לאט וכמה פעמים לפעמים. מטלת קריאה כזו לפעמים הייתה לוקחת שעתיים (אם לא מוצאים ישר את התשובה בטקסט) ולפעמים כמה דקות (אם כן).\n\nהמבחן: \nמבחן אמריקאי. צריך לעבור על כל המצגות לפני וזה לא מעט חומר. יומיים למידה כדי לעבור על הכל. המבחן לא קשה אבל צריך לזכור הרבה נקודות חשובות על כל אדם שהקורס ציין.\n\nהשורה התחתונה: \nאוהבי פילוסופיה - קחו.\nאוהבי פסיכולוגיה - לא בשבילכם.", "timestamp": 1625532748224}, {"author": "אלון", "difficultyRank": 2, "generalRank": 2, "semester": "202101", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: הרצאות נחמדות , המרצה נחמד ומעביר את החומר עם מצגות ועורך דיונים בכיתה בנושאים מסויימים.\n\nשעורי הבית: צריך להגיש 6 עבודות מתוך 8 לאורך הסמסטר , כל עבודה מתרכזת במאמר של פילוסוף מסויים . העבודה היא רק לענות על שאלה באיזה 3 שורות של תשובה אבל אורך המאמרים הוא בין 6 ל 20 דפים ורובם באנגלית אז למצוא את התשובה קצת מייגע.\n\nהמבחן: 22 שאלות אמריקאיות\n\nהשורה התחתונה: אין מאגר שאלות לבחינה , שאלות קצת מעצבנות עם תשובות דומות ומבלבלות. \nהקורס עצמו הוא קורס פילוסופי , למי שלא מתחבר לפילוסופיה או להמון מושגים מורכבים ומבלבלים לדעתי לא כדאי לקחת.\nסהכ לדעתי המלג לא ממש מומלץ בגלל כל הסיבות שכתבתי , הקורס לא קשה מידי או עמוס מידי פשוט לעומת מלגים אחרים הלמידה למבחן דיי עמוסה (לעבור על 40 דפי PDF ולזכור המון דברים גם קטנים והבדלים בין דעות של פילוסופים שלא לגמרי מובנים).", "timestamp": 1643219217285}, {"author": "אמוטביזם", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ערן אורי\nחוות דעת - הרצאות: \nההנאה מההרצאות תלויה בכמה החומר מעניין לדעתכם, לדעתי הירידה לפרטים דקדקניים של מה הוא רגש קצת משעמם, אבל אם זה עושה לכם את זה לכו על זה\n\nשעורי הבית: \nהיו סדר גודל של 10 עבודות שמתוכן צריך להגיש 6, כל אחת שווה 4 נקודות לציון הסופי, והן לא נבדקות בקפדנות, פעם אחת קיבלתי משוב שכתבתי תשובה לא נכונה ועדיין קיבלתי את הנקודות. לפעמים הוא משאיר את המצגות לשיעורים העתידיים ושם פשוט מופיעות התשובות למי שרוצה לחסוך מעצמו את הקריאה.\n\nהמבחן: \n22 שאלות אמריקאיות, חלקן טריקיות, אבל בנוסף לנקודות משיעורי בית ונקודות בונוס שמוצעות למי שמשתתף בתנוחות יוגה עם המרצה בתחילת השיעור לא קשה לקבל ציון טוב בקורס\nהשורה התחתונה: \nלא נושא מעניין במיוחד, אבל ציון טוב כנראה יצא לכם מזה", "timestamp": 1643880887841}]}