{"posts": [{"author": "Tal", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: ריקה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: נחמדים, עוזרים לתרגל כתיבה ואוצר מילים\n\nהמבחן: קליל, ברובו אמריקאי.\n\nהשורה התחתונה: קורס שהייתי מחכה לו כל שבוע.", "timestamp": 1598287848318}, {"author": "shoval ozeri", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: ריקה עיני-טאקאקי\nחוות דעת - הרצאות: מתחילים עם היראגנה ומשפטים בסיסיים, ולקראת סוף הקורס אפילו נוגעים קצת בקאנג'י ולומדים להקליד יפנית במחשב. בשיעורים עצמם יש השתתפות של כל הסטודנטים (בהקראה או בדיבור אחד עם השני). הקורס נותן אחלה כלים למי שמעוניין לשפר את היפנית שלו, אבל ברמה בסיסית. מאוד עוזר אם יודעים קצת את השפה מראש (דואלינגו יכול לעזור). ההרצאות משלבות גם נושאים תרבותיים ובסך הכל חוויה מאוד כיפית. \n\nשעורי הבית: מאוד קלילים ועוזרים לזכור את מה שנלמד, ריקה גם גמישה עם הציון (כמה טעויות קטנות לא משנות)\n\nהמבחן/בוחן אמצע: מבחן מאוד הוגן, די פשוט. ריקה הביאה מבחן לדוגמא שהמחיש בדיוק איך המבחן האמיתי יתבצע. בעיקר אמריקאיות עם קצת תרגום\n\nהשורה התחתונה: קורס מאוד מומלץ למי שמתעניין, וגם הציונים גבוהים", "timestamp": 1615901722567}, {"author": "DD", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ריקה עיני-טאקאקי\nחוות דעת - הרצאות: ההרצאות מעניינות. ריקה דואגת גם ללמד על יפן ותרבות יפנית מעבר ללימודי שפה בלבד. בזמן השיעורים היא נותן תרגילי כיתה שהסטודנטים מבצעים בינם לבין עצמם.\n\nשעורי הבית: לקראת כל הרצאה יש תרגיל בית קליל שעוזר לתרגל את מה שנלמד בהרצאה האחרונה.\n\nהמבחן: דורש מעט השקעה. בכל זאת מדובר בלימודי שפה וזה לא משהו שקולטים מבלי לתרגל את זה. לדעתי המבחן לא קשה מדי ומשקף את מה שנלמד במהלך הסמסטר.\n\nהשורה התחתונה: הקורס מעניין. המרצה טובה ויש אווירה מאוד נעימה במהלך השיעורים. ממליץ בחום למי שמעוניין ללמוד את השפה או בכללי מתעניין בתרבות יפן.", "timestamp": 1626157036956}, {"author": "רועי אברהם", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ריקה\nחוות דעת - הרצאות: מלכה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: קלילים ונחוצים לתרגול השפה, מקבלים 100 על כל גליון על עצם הגשתו, ריקה תמיד בודקת ונותנת משוב ספציפי. רואים שאכפת לה\n\nהמבחן: נחמד, אם הייתם על החומר תוך כדי הסמסטר צריך ללמוד אליו סביבות השעתיים שלוש\n\nהשורה התחתונה: קורס כיף, מעניין שמועבר באווירה טובה ועם המון אכפתיות", "timestamp": 1647728005419}, {"author": "Hiragana Master", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ריקה\nההרצאות ממש קיפיות, המרצה ממש אחלה מרצה ורואים שאכפת לה מאוד. 3 שעות של הרצאה זה טיפה מעייף אבל ריקה משתדלת להפוך את ההרצאות למשהו כיפי על ידי הוספת פיעילות או תחרות.\n\nשעורי הבית: \nמקבלים 100 רק על הגשתם. ארוכים יחסית לקורס שפה. ריקה דואגת לתת משוב מאוד מפורט.\n\nהמבחן: \nמבחן עמוס והמרצה שואלת על כל המקרים יוצאים דופן לכן המבחן יוצא טריקי אבל ניתן לגמרי להוציא ציון טוב.\nמועד א' זהה מאוד מאוד למועד ב', אם חושבים שאתם יכולים להוציא ציון יותר גבוה מציונכם במועד א' אל תוותרו. (זה כמעט אותו מבחן עד כדי שינוי כמה שמות ופעלים פה ושם). זאת הסיבה למה לא מקבלים סריקות.\n\nחלוקת ציון סופי:\n10% שעורי בית \n10% בוחן הירגנה\n25% בוחן דקדוק\nהשאר למבחן סופי\n\n\nהשורה התחתונה: \nקורס יחסית עמוס לקורס שפה (לקחתי שני קורסים של סינית ואני יכול להגיד שזה היה הרבה פחות עמוס שם). אבל כיפי ללמוד יפנית ובמיוחד עם ריקה-סיניי.", "timestamp": 1679832909208}]}