{"posts": [{"author": "טל", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אילת שביט\nחוות דעת - הרצאות: המרצה מעבירה את החומר בצורה ברורה ומרתקת, ומעוררת עניין רב בנושאים שהיא מעלה. ניתן לראות כי היא אוהבת את החומר. חומר מאוד מעניין, ורלוונטי מאוד לאלו העוסקים במדע.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  היו  מספר מטלות קריאה של מאמרים עליהם המרצה דנה בשיעורים (קריאת המאמר היא לפני ההרצאה העוסקת במאמר). סה\"כ השקעה של כחצי שעה עד שעה בשבוע. נדרש היה להגיב על גבי הטקסט הערות שלנו בהתאם לשאלות מונחות של המרצה.\nהיו גם מטלות כתיבה או מענה על שאלות אמריקאיות ( כשלא היה מאמר חדש לקרוא). \nאם ניכרת השקעה ורצינות, המרצה נותנת ציון 100 גורף, גם אם לא ענינו נכון, כך שמאוד קל לקבל מגן טוב.\n\nהמבחן: 22 שאלות אמריקאיות, כאשר ניתן לטעות ב2 שאלות ועדיין לקבל 100. היה נדרש להבין רק את הרעיון המרכזי של המאמרים, ולא לשנן. \n\nהשורה התחתונה: אחלה קורס, ממש מומלץ, וממש מעניין. מרצה מעולה ונהניתי מאוד מההרצאות. בעיניי קורס חובה לדור העתידי של המדענים/מדעניות.", "timestamp": 1625848070630}, {"author": "\\", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אילת שביט\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כארבעים דקות קריאה ומשימות בשבוע, טקסטים באנגלית, יש מל''גים משתלמים יותר. \n\nהמבחן: אמריקאי היה אצלנו, על פניו כביכול קל כי מתוך 110 אבל ממוצע 86 במבחן למל''ג זה לא כזה טוב\n\nהשורה התחתונה: לא הכי מומלץ ביחס למל''ג", "timestamp": 1625910499031}, {"author": "1", "difficultyRank": 3, "generalRank": 4, "semester": "202002", "text": "שם המרצה: איילת שביט\nחוות דעת - הרצאות: מרצה מדהימה, רואים שאכפת לה מלהעביר מסרב להעביר את החומר עצמו ורואים גם שאכפת לה מהסטודנטים, בקיצור מרצה מעולה. \n\nשעורי הבית: כל שבועיים בערך יש מטלת קריאה בתוכנת הפרוזאל שצריך לקרוא ולהגיב שם. בגדול המאמרים די קשים מבחינה של הבנה פילוסופית, גם חלקם באנגלית מה שמקשה יותר על ההבנה ועל ביצוע המטלה...\n\nהמבחן: המבחן סביר, אם הקשבתם והשקעתם במהלך הסמסטר אז תקבלו ציון טוב, לא מבטיח 100 אבל ציון טוב. \n\nהשורה התחתונה: המלג מאוד מעניין ומראה פרספקטיבה מעניינת על מדע, המלג לדעתי דרש ממני השקעה קצת יותר מדי ממה שהייתי מצפה למלג. מצאתי את עצמי שבוע לפני סוף הסמסטר, במקום ללמוד למבחן הראשון, קורא טקסטים בפילוסופיה ומנסה לדחוף כמות די גדולה של חומר שמתאים לקורס חובה שנה א'.", "timestamp": 1648498642904}, {"author": "Bellman", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "השורה התחתונה: לא. ממוצע נמוך יחסית למל״ג.", "timestamp": 1658163908977}]}