{"posts": [{"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: סבבה, מעביר את החומר בצורה יחסית טובה, לפעמים הוא עושה דיונים בכיתה - אם אתם נהנים מזה אז זה נחמד (אם אתם מאלה שפחות מתחברים לדיונים אז אולי פחות תאהבו).\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nמתוך 10 גליונות צריך להגיש 6, אפשר לצבור עד 24% מגן.\nהעבודות דיי קלילות, יש שאלה אחת שצריך לענות עליה בכמה משפטים בודדים שמתבססת על מאמר (באנגלית). בפועל אין צורך באמת לקרוא את כל המאמר, מספיק פשוט לחפש את הנושא של השאלה הספציפית.\n\nהמבחן: \nהמבחן כן דרש להבין מה הייתה הטענה המרכזית של כל פילוסוף שלמדנו עליו בקורס, חלק מהשאלות לא היו רק על הטענה המרכזית אלא על איך הפילוסוף עונה למתנגדים שלו ודרשו להבין ניואנסים קטנים יותר. מתוך המבחן הייתה שאלה אחת שהייתה לא הוגנת (לדעת סטודנטים רבים) שלחנו מייל למרצה והוא הודה שהשאלה הייתה בעייתית ואמר שיתחשב בזה (לא יודעת אם זה קרה בסוף).\n\nהשורה התחתונה: \nבסך הכל מלג סבבה, לא מאוד משעמם, המרצה נחמד ונראה שהוא נהנה ללמד, המבחן דורש קצת למידה והתעמקות וזה גם הסמסטר הראשון שבו הועבר הקורס אז לא ידענו ממש למה לצפות. לדעתי לא המלג הכי קל אבל גם לא הכי קשה, אם באמת עוברים על כל החומר פעמיים שלוש אני מאמינה שאפשר ממש להצליח.\nעוד נקודה נחמדה, בסמסטר שלנו השתתפות בתרגילי מדיטציה / יוגה במהלך ההפסקות הקנתה 4 נקודות בונוס לציון שזה היה ממש נחמד.", "timestamp": 1657003700222}, {"author": "קאנט", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: סבבה. יש במהלך ההרצאות דיונים בכיתה ככה שאם אתם פחות מתחברים לזה אז יהיה משעמם.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין \n\nשעורי הבית: גיליונות שבועיים. לקרוא טקסט ולענות על שאלה קצרה בעקבותיו, אבל לא באמת חייבים לקרוא הכל.\n\nהמבחן: צריך לשנן בשביל להצליח, וגם אז חצי מהשאלות נכנסות לפרטים יחסית שוליים אז די מעצבן. אחרי מועד א' ממוצע 90 בערך.\n\nהשורה התחתונה: הסיבה היחידה לקחת את הקורס זה אם מעניין אתכם הדיונים בכיתה, אבל אם לא אז ממליץ לוותר", "timestamp": 1657020315254}, {"author": "קיילי המילטון", "difficultyRank": 2, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי ערן\nמעייף. מדבר באופן גבוה על כל מיני בעיות בחברה בצורה מאוד מתנשאת, בדיון שלכאורה אמור להיות ניטרלי מדעות ולעורר מחשבה אך בפועל מעביר את את ראיית העולם שלו (ושל רוב הסטודנטים) כראייה הנכונה והבלעדית.\nחוץ מזה ההרצאות מאוד משעממות\n\nשעורי הבית: \nלא ארוכים, כל שבוע יש לכתוב שלושה ארבעה משפטים על איזה פילוסוף מתוך מאמר באנגלית \nלרוב עושים חיפוש של מילת המפתח ומתרגמים לעברית\n\nהשורה התחתונה: לא להירשם. \nלא. \nלהירשם.\nמל״ג שכביכול לא מצריך הרבה אבל בתכלס יש שיעורי בית כל שבוע, חובת הגעה להרצאות ימבה דמבה חומר למבחן\nמתחרט שנרשמתי כי הסתכלתי רק על ההיסטוגרמות. מל״ג לא אמור לגזול זמן בתקופת מבחנים", "timestamp": 1672834786384}, {"author": "שמוליק", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אורי\nחוות דעת - הרצאות: הרצאות די מעניינות, לומדים על טכנולוגיות חדשות ועל גישות אליהן מבחינה אתית, יש גם דיונים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 6 מטלות של 10 דק' וזה מביא 24% תקף + 4 נק' בונוס על מתיחות בזמן ההפסקה.\n\nהמבחן: \nנכנס יחסית לקטנות. למידה של יום - יום וחצי למל\"ג בצורה טובה ואפשר להוציא 100 ביחד עם הבונוס.\nהשורה התחתונה: בסה\"כ לדעתי היה מעניין וגם אפשר להוציא ציון טוב.", "timestamp": 1675153039475}, {"author": "החילזון", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורי\n\nאל. תקחו. את. הקורס. הזה.\n\nההיסטוגרמות מטעות!\n\nהממוצע פה הוא לא באמת 90, אלא יותר לכיוון ה75+-\nואני אסביר:\nיש 24% הגשות תקפות, שהן די מעיקות ביחס למלג במהלך הסמסטר\n + 4 נקודות בונוס שצריכים לעשות כל שבוע תנוחות יוגה הזויות כדי לקבל, ואין ברירה אלא לעשות אם לא רוצים להדפק בציון.\n\nהמבחן מזעזע, סופר דו משמעי, וניכר שהוא נכתב ע״מ להכשיל את הסטודנטים ולהתפס להכי קטנות שרק אפשר.\n\nיודעים את החומר? אחלה, אז קחו שאלות אמריקאיות ש 3 מתוך 4 מן האפשרויות בהן הן כמעט אותן התשובות רק עם שינוי של מילה בודדת, ואם לא שיננתם כל מילה שהמרצה אמר במהלך הסמסטר אז חבל.\n\nחוץ מזה החומר משעמם טילים, ועובר בצורה מונוטונית ופשוט ממש ממש לא מעניינת.\n\nבקיצור, תברחו, להתרחק כמו מאש, לא חסרים מל״גים טובים בהרבה.", "timestamp": 1675205323310}, {"author": "מאותגר אתית על ידי טכנולוגיה", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: \nההרצאות היו יחסית משעממות. אמנם היו יחסית הרבה דיונים, והיה לא מעט מקום להשתתף ולהביע דעה, אבל עדיין הנושאים עצמם היו לא ממש מעניינים, ולרוב מי שהשתתף היו אותם שלושה/ארבעה סטודנטים וסטודנטיות.\nהרבה מהפעמים ההרצאות הרגישו כמו רשימת מאמרים ודעות שצריך לזכור, והן הועברו באופן יחסית מתנשא ולא היה כיף לשבת ולשמוע את הכל.\nהקורס מחולק לארבעה נושאים, ובכל נושא יש כשלושה או ארבעה מאמרים, ולכל מאמר יש את התוכן שלו ומלא ביקורות בעד ונגד, והיה לא פשוט בכלל לשנן את הכל.\n\nשם המתרגל/ת: אין.\nחוות דעת - תרגולים: אין.\n\nשעורי הבית: עשרה תרגילים שבועיים, מתוכם צריך להגיש לפחות שישה. מהווים 24 אחוז תקף (4 נקודות לכל הגשה).\nבכל הגשה היה לקרוא מאמר אחד, ולענות על שאלה מסוימת בכמה משפטים. בפועל, מספיק לקרוא פסקה או שתיים מתוך המעל 20 עמודים של המאמר כדי לענות על השאלה, אבל לפעמים לקח הרבה זמן להבין את הקונקסט של המאמר ולמצוא את אותן שתי פסקאות שצריך לקרוא כדי לענות על השאלה.\nההגשות היו על מאמרים שהוצגו בכיתה, לפני שהם הוצגו, המטרה להכין אותנו לשיעור. בפועל, ההצאות התעכבו וכל נושא לקח יותר זמן ממה שאורי תכנן (מה שגם התבטא בזה שבהרצאות האחרונות הוא פשוט רץ על מלא חומר), ועברו שבועיים או שלושה מאז שקראנו מאמר מסוים ועד שדיברנו עליו בכיתה, ואז זה כבר נהפך לכמעט ולא רלוונטי.\n\nהמבחן: נכנס מאוד לפרטים הכי קטנוניים של החומר. בשיעור האחרון הוא אמר שזה לא יהיה ככה, ושמספיק להבין את עיקר הרעיונות של כל מאמר ושל כל הוגה דעות, אבל בפועל היה צריך ממש לשנן פרטים מסוימים כדי להצליח לענות על יותר מ-5 שאלות.\nהמבחן אמריקאי, והכיל 22 שאלות. אחת השאלות הייתה יותר מדי קטנונית והיו מלא תלונות עליה, ולכן הוא פסל אותה (שזה בעצמו טיפשי, כי ההגיון הוא שייתן לכולם את הניקוד עליה במקום לא להתחשב בה בכלל).\n\nהשורה התחתונה: נרשמתי לקורס מתוך התעניינות בחלקים שקשורים לבינה המלאכותית וההשפעה של הטכנולוגיות הכי חדשניות על העולם, ובפועל לגמרי התאכזבתי. הנושאים היו לא מעניינים - פונדקאות, השבחה גנטית, התחממות גלובלית, חיסוני קורונה, ובתחום הבינה כל מה שדיברנו בערך היה על ההשלכות של האם יש למכונות תודעה, ועל מכוניות ללא נהג.\n\nהמל\"ג לא ממש מומלץ, אלא אם אתם ממש מתחברים לאתיקה ופסיכולוגיה של דברים. אם נרשמתם, מאוד מומלץ לבצע את ההגשות ולעשות את הניסוי (תנוחות יוגה בהפסקות) כדי לקבל את הבונוס (4 נקודות על 10 ניסויים). הניסויים זה מה שגרמו להיסטודרמה להיראות כמו שהיא וגרמו ללמוצע להיות מעל 90 (וגם השיעורי בית).", "timestamp": 1675355355682}, {"author": "אנונימי/", "difficultyRank": 2, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: חופרות , ארוכות. כדי לקבל בונוס ארבע נק' יש איזה שטות של לעשות תנוחות מוזרות ובלי זה ממוצע המלג היה 86 כי הרוב השתתפו. \n\nמלג היחיד שראיתי שבאמת מקפידים בו על בדיקת נוכחות. כך שסה\"כ זה אפילו מלג בלי הפסקה ולרוב אם לא יעצרו אותו זה יימשך מעבר לשעה וחמישים. \n\nהמבחן- שאלות אמריקאיות כל כך מטעות בניסוח, על פילוסופים שמבלבלים את המח : צריך לעשות X כי Y , אבל לא X כי בלה בלה אלא Z כי Y. \n\nוהשאלה במבחן מה הפילוסוף אומר ? \nלעשות X כי Y  או Z כי Y \n\nתכל'ס הממוצע של המבחן היה בקושי 80 רק שלא פרסמו את זה , ומהשאלות ששאלו אותו אנשים דווקא למדו", "timestamp": 1675541142911}, {"author": "Yaakov L.", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: הנושא הכללי מעניין אבל הרגיש לי שחפר יותר מידי לעומק בכל נושא במקום לתת יותר תמונה רוחבית\n\nשעורי הבית: חצי שניה\n\nהמבחן: לפעמים צריך לזכור דברים שנאמרו בהרצאה\n\nהשורה התחתונה: סבבה", "timestamp": 1679392921400}, {"author": "~", "difficultyRank": 3, "generalRank": 3, "semester": "202201", "text": "להתרחק. ההרצאות לא כאלו גרועות אבל המבחן מטעה ומתקטנן בהגזמה", "timestamp": 1679432170662}, {"author": "The Dude", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אורי ערן\nחוות דעת - הרצאות: \nוואללה שמתי אוזניות וסימנתי נוכחות, יש ניסויים בהפסקה שמטרתם לתת נקודות בונוס, אם אתם עושים אותם זה משתלם.\n\nשעורי הבית: \nGPT, מכירים?\n\nהמבחן: \nלמדתי יום, יש לי סופי 89 וזה מעצבן אותי, אבל חרא על המבחן ועל הקורס.\nהשורה התחתונה: \nלקחתי נטו כי מלג אחרון בתואר, לא ממליץ בכלל.", "timestamp": 1689595136204}]}