{"posts": [{"author": "פריקלס", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: מרצה מצויין מעביר את החומר באופן ברור ומסודר הוא לא בודק נוכחות אבל מי שלא הגיע שילם על זה במבחן\n \nהמבחן: סה\"כ הוגן אבל היה צריך להיות בהרצאות כדי להצליח\n\nהשורה התחתונה: אחלה מלג אם מתעניינים בנושא", "timestamp": 1617543366643}, {"author": "נ.ה", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: מרצה מצוין , כיפי ומעביר את החומר בצורה מעניינת וגם בן אדם מאוד נחמד \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: המבחן מאוד קל ולא מתחכם , כן דרושה התכוננות של שלוש שעות בערך לפני (למי שהקשיב בהרצאות) \n\nהשורה התחתונה: אחלה מלג , חומר סופר מעניין ומי שחשב שמשחקי הכס הייתה עם אירועים ואנשים נוראיים לא הכיר את יוון העתיקה", "timestamp": 1624618390666}, {"author": "אגממנון", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה:  אייל\nחוות דעת - הרצאות:  הרצאות מאוד כיפיות ומעניינות\n\nשעורי הבית:  אין. יש חומר קריאה נוסף למי שרוצה.\n\nהמבחן:  שאלות אמריקאיות + שאלות נכון\\לא נכון. הרבה פרטים שצריך לזכור.  אם ראיתם את ההרצאות ממליץ לפחות חצי יום ללמידה.\n\nהשורה התחתונה: קשה יחסית למל\"ג.  הייתי ממליץ רק למי שכבר יש ידע כללי על התקופה או מאוד מתעניין.", "timestamp": 1625040607105}, {"author": "U.H", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: הרצאות מאוד מעניינות, אייל מעביר את החומר בצורה כיפית ומעניינת\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין \n\nהמבחן: קל, יש רשימה (לא קצרה) של מושגים שצריך לזכור, אבל עם עוברים על זה כמה פעמים אפשר להוציא ציון גבוה מאוד בלי בעיה\n\nהשורה התחתונה: מל\"ג מעניין מאוד, מומלץ", "timestamp": 1625935812753}, {"author": "נ", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: מרצה מעולה! אייל נחמד ממש ומעביר את החומר בצורה מעניינת ונגישה.\n\nהמבחן: מצריך קצת למידה. \nצריך לזכור כל מיני מושגים, אבל הם חלק מסיפורים היסטוריים ככה שזה לא נורא בכלל ואפילו נחמד. אם מקשיבים בהרצאות זה לא נורא בכלל\n\nהשורה התחתונה: קורס מעניין בטירוף ומומלץ בחום. המרצה תותח ועושה מאמצים כדי שתהיה אווירה כיפית בכיתה. ממליצה בחום :)", "timestamp": 1626094480422}, {"author": "A", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מרצה מעולה. מעביר את החומר בצורה כיפית.\n\nשעורי הבית: אין. יש קטע קריאה לכל שבוע אבל הם לא חובה.\n\nהמבחן: לא קשה. אפשר לקבל 100 גם בלי להקשיב בהרצאות אם משקיעים יום ללמידה רצינית\n\nהשורה התחתונה: אחלה קורס. לא קשה מידי. לא צריך ידע קודם או השקעה גדולה", "timestamp": 1626253143580}, {"author": "הרודוטוס איש הליקרנאסוס", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל מאיר \nחוות דעת - הרצאות: \nתותח! כיף לבוא להרצאות שתמיד מועברות בצורה מעניינת\nדאג לאווירה טובה ממש בכיתה\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nכל שבוע פורסמו קטעי קריאה, מומלץ לקרוא אבל לא באמת רלוונטי למבחן (אין חובה לקרוא)\nהמבחן: \nהמבחן היה הוגן ומי שהשקיע כמה שעות בלהתכונן יכל להוציא אחלה ציון. במיוחד אם הקשבת להרצאות\nפורסמה רשימת מושגים לחזור עליה לפני המבחן ככה שהיה באמת סבבה להתכונן למבחן.\nהשורה התחתונה: \nאחלה מלג, מחכה למלג על רומא העתיקה!", "timestamp": 1626712077021}, {"author": "אלכסנדר", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: מרצה טוב מאוד!\nהעביר את החומר בצורה ברורה, כיפית ומענייינת. יש הרבה חומר בהרצאות מעמיקים בהרבה דברים שהם אקסטרה\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: רשות- יש בכל שבוע מספר עמודים לקריאה (לא הכרחי להבנת החומר אם כי עוזר ומעשיר).\n\nהמבחן: בנוי מ20 שאלות אמריקאיות ו10 נכון לא נכון. לא קשה. \nהמבחן דורש לזכור יחסית הרבה חומר היסטורי - שמות, קרבות, גורמים לתהליכים וכו' \n\nהשורה התחתונה: קורס מומלץ מאוד למי שאוהב היסטוריה בכללי ובפרט של יוון העתיקה. \nלכל חובבי המיתולגיה - נוגעים בנושא באופן מינורי..", "timestamp": 1627142718349}, {"author": "luffy", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: \nמצוין , מרצה נחמד וכיפי ומעביר מצוין את החומר ובצורה עניינית.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין. יש אופציה לקרוא מעבר בספרים שהוא נותן אך זה לא חובה\n\nהמבחן: המבחן לא קשה והוגן. למי שהקשיב בהרצאות מספיק לדעתי ללמוד כמה שעות וזהו \n\nהשורה התחתונה: אחלה מלג , אני ספציפית נהנתי ואני ממליץ על המלג", "timestamp": 1628802669707}, {"author": "סהר", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: מרצה מצוין וקליל, בא לטובת הסטודנטים, הרצאות מעניינות.\nיש הרבה חומר אבל המרצה נותן מיקוד עם מספר מסוים של מושגים לקראת המבחן. \nהמרצה מעלה הקלטות זום ולא מחייב נוכחות אם מגיעים מספיק סטודנטים לכיתה.\n\nשעורי הבית:  אין. יש קטעי קריאה שלא חובה לקרוא ולא נבחנים עליהם.\n\nהמבחן: מצריך התכוננות של יום בשביל ציון מאוד גבוה.  המבחן הוגן וממוחזר חלקית. אפשר לקבל 100 עם מעט מאמץ. עם זאת, אפשר לקבל ציון מאוד נמוך אם לא משקיעים בכלל ומסתמכים רק על מבחני עבר,\n\nהשורה התחתונה: מומלץ מאוד במיוחד למי שאוהב את הנושא", "timestamp": 1656604101602}, {"author": "בר", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "הגעה לא חובה וציון גבוה\n\nשיעורים באוירה טובה, הגעתי לכל ההרצאות כי היה סבבה\nהמבחן כולל רשימת מושגים לשנן ואז לענות על שאלות אמריקאיות\nלדוגמה:\n\"בית המלוכה הארגאדי שלט על:\nא. ממלכת מוקדון, ב. ממלכת לידיה, ג. ממלכת מצרים, ד. ממלכת פרס\"\n\nמומלץ", "timestamp": 1656781362266}, {"author": "Yaniv Slor Futterman", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: אחלה מרצה. נותן עניין ורואים שאכפת לו מהתלמידים ושהוא לא בא להכשיל או לעשות דווקא.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: יחסית קל אם לומדים אליו. כן צריך לעבור על החומר, על סיכומים ועל מצגות. אבל למי שהגיע לכל השיעור וסיכם בקטנה זה דורש רק יום אחד שלם של למידה לפני המבחן. \n\nהשורה התחתונה: אחלה קורס. מעניין למי שוהב והמרצה נחמד ועם אנרגיות.", "timestamp": 1658682621791}, {"author": "הילה", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: היה באמת העונג לפתוח את ראשון בבוקר עם אייל, אני נהנתי מאוד, ההרצאות ממש נחמדות ולא מרדימות בכלל . אייל אחלה גבר וכיף לשמוע אותו מרצה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש קטעי קריאה שהם רשות . אני אישית קראתי אחד . זה לא באמת משפיע על כלום .\n\nהמבחן: פייר לחלוטין, שוב, אייל אחלה גבר, לא מחפש להכשיל אף אחד, אוהב את החציון 97 בקורס שלו . צריך ללמוד מהסיכומים שיש בקבוצה בפייסבוק ולזכור קצת בע\"פ . לא ביג דיל .\n\nהשורה התחתונה: אחלה מל\"ג ממליצה ממש", "timestamp": 1659093577412}, {"author": "מישו", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מלמד את החומר בצורה ממש מעניינת, אווירה כיפית בכיתה.\n\nשעורי הבית: אין, יש קטעי קריאה שהם רשות\n\nהמבחן: מבחן עם שאלות אמריקאי ושאלות נכון לא נכון. בן אדם שהיה בכל ההרצאות ושיש לו זיכרון טוב יכול להוציא 100 בקלות אחרי למידה של כמה שעות למבחן.\n\nהשורה התחתונה: אחלה מלג שבעולם (אם זה נושא שמעניין אתכם, אחרת יהיה לכם קצת משעמם)", "timestamp": 1662365931322}, {"author": "הבמ", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אייל מאיר\nחוות דעת - הרצאות: מרצה נהדר, באווירה טובה. מבין את היחס למלגים\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: סבבה\n\nהשורה התחתונה: אחלה קורס בעיקר לחובבי היסטוריה", "timestamp": 1666287455625}]}