{"posts": [{"author": "א", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: מרצה נחמד. את ההרצאות היינו לרוב מתחילים בתרגילי יוגה פשוטים ולאחר מכן עוברים לנושאים התאורטיים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: לפני כל הרצאה יש קטע קריאה שצריך לקרוא. כדאי לקרוא אותם כי במבחן מופיעות שאלות על כמה משפטים מובהקים מקטעי הקריאה.\n\nהמבחן: 25 שאלות רב-ברירה. עם למידה טובה לא בעייתי להוציא ציון גבוה במבחן, אך בהשוואה לקורס העשרה \"אידיאלי\" דורש השקעה\n\nהשורה התחתונה: קורס מעניין ומומלץ למי שאוהב פילוסופיה מערבית אך לא בטוח שזה קורס העשרה אידיאלי מבחינת ממוצע", "timestamp": 1611655964424}, {"author": "ביגוס חשמלטוס", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "למי שמתעניין בפילוסופיה, מאוד מאוד מעניין ומומלץ. עוברים על התפתחות הרעיונות לאורך ההיסטוריה של הפילוסופיה בנושא \"בעיית הגוף-נפש\" ומכירים הוגים חשובים. בפועל עיקר החומר הוא להכיר את התפיסות השונות ולקשר להוגים.\n\nבתחילת כל שיעור יש קצת התנסות ביוגה למי שאוהב, וגם בסוף הסמסטר יש ממש שיעור יוגה קליל.\n\nיש \"דרישה\" לקרוא טקסטים לפני חלק מהשיעורים. בעיקר בתחילת הסמסטר יש קריאה לפני השיעור, אבל זה מפסיק. בכל מקרה לא בטוח כמה חייבים לקרוא בשביל להבין, אבל גם הקריאה לא ארוכה מאוד, ומומלצת בעיקר כדי להכיר טוב יותר למבחן את ההוגים, ויהיה קל יותר לזהות ציטוטים.\n\nהמבחן היה 25 שאלות אמריקאיות. קל למי שעקב אחריו בסמסטר ולמד סבבה לפני המבחן. חלק מהשאלות היו ממוחזרות ממקבץ שאלות שהוא שלח לפני, כך שייתכן והוא גם ימחזר למבחנים הבאים שזה טוב. יש שאלות ציטוטים (לזהות מי כתב), אבל זה בדרך כלל ציטוט מובהק מתוך הטקסט ודברים שהוא דיבר עליהם (ומופיעים במצגת).", "timestamp": 1611830189698}, {"author": "Dinoman", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "חוות דעת - הרצאות: היה מאוד מעניין\nלקחת מי שבאמת מתחבר ואוהב ורוצה ללמוד הקדמה לפילוסופיה\n\nהמבחן: קצת מפחיד יחסית למלג הייתי צריך לעבור על המצגת\n\nהשורה התחתונה: לא מתחרט שלקחתי אבל לא הייתי לוקח אם הייתי רודף אחרי ציונים", "timestamp": 1612381370369}, {"author": "yeela lessick", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: \nהרצאות מעניינות, מדבר על השקפות של פילוסופים שונים לגבי חוויית הגוף והנפש והקשר ביניהם. כל תחילת שיעור עושים 2 תנוחות יוגה ואז עונים על שאלון, ובשיעור האחרון יש גם שיעור יוגה של חצי שעה. \n\nשעורי הבית: \nהוא נותן מאמר בשבוע לקרוא ולהביע דעה עליו בperusal, לפעמים בעברית ולפעמים באנגלית.\n\nהמבחן: \nאם מקשיבים בהרצאות ההכנה למבחן ממש קלה, אני אישית לקראת ההרצאות האחרונות פחות הקשבתי ועדיין לא היה קשה במיוחד להתכונן, יש סיכומים טובים שאנשים עשו סמסטר קודם ולומדים מהם - יום וחצי בגג. המבחן עצמו ברובו היה ממוחזר מסמסטר קודם, אבל עדיין היו כמה שאלות טריקיות.\n\nהשורה התחתונה: \nלא מל\"ג של 100 בלי השקעה, אבל אם מעניין אתכם פילוסופיה לכו על זה", "timestamp": 1626759991202}, {"author": "נועה", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: לפעמים קל לאבד את הריכוז, מרגיש שתלמידים יכולים לסחוף את נושא השיחה מאוד בקלות לכיוונים שונים שלא תמיד מעניינים את השאר.\nסך הכל החומר נחמד, אבל מאוד פילוסופי - רוב הקורס זה התעסקות בלמידה על פילוסופים וההשקפות שלהם ולזכור על כל אחד מה השקפתו בנוגע לנושא של יחסי גוף ונפש.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש כל שבוע לקרוא בממוצע 10 עמודים באנגלית, בהתחלה חושבים שזה נהיה יותר קליל אבל הטקסטים לא נהיים קצרים יותר... מי שזורם לו הקריאה באנגלית מוזמן, לי אישית זה לקח הרבה זמן.\n(מה שכן בדרך כלל צריך להגיב משהו על הטקסט ולכן לא חייב לקרוא את כולו אלא לבחור פיסקה מיועדת ואותה לקרוא, אבל זה חוטא ללמידה של החומר, ולפעמים מתבססים על זה בשיעור הבא)\n\nהמבחן: 25 אמריקאיות בערך, אם לומדים מהסיכומים של הקורס אפשר לעבור די בקלות, גם אם לא נכחת בהרצאות, אבל כן דורש השקעה ולמידה של כמה ימים לפני.\n\nהשורה התחתונה: לא המלג הכי מומלץ כי כן דורש השקעה, אני הרגשתי שלמדתי הרבה, אבל למי שמעוניין במלג קליל זה לא הבחירה הראשונה שהייתי הולכת עליה", "timestamp": 1633421501080}, {"author": "Lotan Amit", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: אחלה מרצה\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: 1-2 קטעי קריאה בשבוע, הרבה באנגלית או בעברית כבדה אבל צריך רק להגיב את דעתך עליהם אז לרוב לא צריך לקרוא עד הסוף בכוח\n\nהמבחן: 20 אמריקאיות, יחסית קל\n\nהשורה התחתונה: קורס מומלץ, מעבר לזה שהוא אשכרה מעניין בעיניי", "timestamp": 1643864887862}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: אחלה מרצה, למרות שיש לו קצת נטייה להתעכב לדיונים עם סטודנטים בהרצאות. זה לא כזו בעיה כי אין נוכחות חובה, אז אם נשבר לכם פשוט אל תבואו. בתחילת כל הרצאה עושים תרגילי יוגה ומי שרוצה עונה על שאלון לאיזה מחקר. שימו לב שהשאלונים מזכים ב-6 נקודות בונוס לציון הסופי (כולם יחד כמובן).\n\nשם המתרגל/ת: אין\n\nשעורי הבית: קטע קריאה בשבוע, צריך לענות בקצרה מה דעתך על כל קטע. בערך שעה בשבוע אם קוראים את כל הקטע, אפשר גם בעשר דקות אם פשוט מחפשים קטע רלוונטי לשאלה ועונים ישר. כדאי להשקיע את השעה לדעתי, זה מכסה את החומר ברמה טובה וממש מקל את ההכנה למבחן.\n\nהמבחן: 20 שאלות אמריקאיות, בערך חצי ממוחזרות. צריך פשוט לשנן את סיכומי ההרצאות, בערך 15 עמודים, למי שקרא.ה את תרגילי הבית במהלך הסמסטר הכל די מוכר וזורם.\n\nהשורה התחתונה: אחלה קורס, בנושא יחסית מעניין.", "timestamp": 1643966748055}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: סך הכל מעניין מאוד, הרבה פעמים גולש לדיון חסר משמעות על נקודות זניחות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: 2 קטעי קריאה כל שבוע, חלק באנגלית חלק בעברית קשה, צריך להגיב דעה על חלקים מהקטעי קריאה. לפעמים הקריאה מייגעת לפעמים עובר טוב.\n\nהמבחן: קליל. 20 אמריקאיות.\n\nהשורה התחתונה: מומלץ בחום.", "timestamp": 1645351684748}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: בסך הכל מאוד מעניין, לפעמים השיעור גולש לדיונים מיותרים בינו לבין סטודנטים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: 1-2 קטעי קריאה כל שבוע שצריך להגיב עליהם דעה. לפעמים באנגלית ולפעמים ממש ארוכים. לא קשה אבל מתיש.\n\nהמבחן: אמריקאי עם 20 שאלות. לא קשה בכלל. \n\nהשורה התחתונה: המלג עצמו מאוד מעניין בעיניי וגם המבחן לא היה קשה בכלל למי שהתעניין במהלך הסמסטר. מומלץ בחום.", "timestamp": 1647536292929}, {"author": "*", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: \nלדעתי אוהד לא מרצה כל כך טוב, אני התקשיתי לעקוב אחריו לאורך השיעור כי לא היה ממש קו אחיד להרצאה ולא היה ברור מה הוא מנסה להעביר הוא זולג להרבה דיונים פרטיים.\n\nשעורי הבית: \nיש משימות קריאה כל שבוע שנותנות בסוף מגן. לפעמים זה ארוך קצת אבל אפשר לקרוא רק חלקים. בעיניי זה היה החלק היותר מעניין של הקורס.\n\nהמבחן: \nלא ממש קשה, היה קצת קשה למצוא מבחני עבר וחומרים אז ממליצה לסכם בהרצאות.\n\nהשורה התחתונה: נושא ממש מעניין וקורס לא מאוד כבד, אבל היה יכול להיות יותר טוב אם ההרצאות היו מעניינות.", "timestamp": 1676287252184}, {"author": "המלך", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: מאוד מבולבל, זולג לשיחות לא רלוונטיות עם יושבי השורה הראשונה. לא הקשבתי בהרצאות באמת.\n\nשם המתרגל/ת: אין\n\nשעורי הבית: קריאה אחת לשבוע של טקסט בעברית קשה או אנגלית פילוסופית מסובכת. צריך לכתוב כמה מילים על קטע שתפס אתכם בקריאה.\n\nהמבחן: 25 אמריקאיות ממוחזרות למדי, לא קשה, להשקיע יום ללמוד לפני. פשוט להקיא את הידע במבחן.\n\nהשורה התחתונה:", "timestamp": 1680166528471}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "תברחו, לא מומלץ.\nמלא השקעה במל\"ג משעמם ובסוף מביאים לך מבחן עם שאלות קטנוניות שבוחן אותך על דברים ספציפיים מדי ולא רלוונטיים בכלל למהות הקורס.\nאם אתם חולים על פילוסופיה אז לכו על זה אבל אם לא אז אל תתקרבו", "timestamp": 1688910762544}, {"author": "סוקראטס", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: \nמתחילים כל הרצאה עם תנועות יוגה ונשימות (עשר דקות ראשונות בערך) וזהו לכל הכיף שבהרצאות... בעיני אוהד מעביר את החומר בצורה די משעממת וחסרת כריזמה, לא הצלחתי להתרכז בשום הרצאה והרגיש לי שעדיף ללכת להשקיע בדברים אחרים.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: כל שבוע יש לקרוא טקסט בעברית כבדה או אנגלית ברמת מינימום מואץ, ולענות על שאלות שמבקשים מאיתנו.\nלא חביב במיוחד אבל ניתן לעמוד בזה\n\nהמבחן: 25 שאלות אמריקאיות, כמה מהן ממוחזרות וכמה שקשה להגיד מהי התשובה הכי נכונה.\n\nהשורה התחתונה: למעט הקושי במהלך ההרצאות, המל\"ג יותר סבבה ממל\"גים אחרים שלקחתי והפעילויות שבתחילת כל הרצאה נחמדות ומשעשעות.\nממליץ מאוד למי שאוהב פילוסופיה.\nסה\"כ עם השקעה של יומיים שלושה לקראת המבחן אפשר להשיג ציון מספק.", "timestamp": 1689167734506}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: מתחילים כל הרצאה ב10 דק יוגה, ישר אחר כך ממלאים סקר (שנותן עד 5 נק בונוס לציון הסופי אם מתמידים במילוי), ואז ההרצאה עצמה. בדרך כלל אוהד מעביר אותה, אבל לפעמים הגיעו אחרים מההומניסטיים. אני לא מתחברת יותר מדי לפילוסופיה אז היה לא הייתי קשובה, מי שיותר מתחבר כנראה יהנה.\n\nשעורי הבית: כל שבוע לקרוא קטע קריאה, ולסמן פסקה/ משפט שעניין אתכם- לא אמור לקחת יותר מחצי שעה. \n\nהמבחן: 20 שאלות אמריקאיות, בערך שליש ממוחזרות. שאר השאלות ממש בסדר ברובן, צריך לעבור טוב על הסיכומים. יש כמה שאלות מבלבלות שמתייחסות לדברים ספציפיים בקטעי הקריאה אז תבואו חדים.\n\nהשורה התחתונה: מל״ג סטנדרטי מאוד", "timestamp": 1693901714222}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: די משעממות ולא ממש הקשבתי למה שהוא אמר במהלך הסמסטר. דווקא כשעברתי על החומר לקראת המבחן הוא היה קצת יותר מעניין אבל לא ממש התחברתי לאיך שאוהד מעביר. בנוסף ה10 דקות יוגה בתחילת כל הרצאה ממש חופר ומאוס.\n\nשעורי הבית: כל שבוע יש קטע קריאה שצריך לקרוא ולהגיב עליו. בפועל לא באמת צריך לקרוא ואפשר להסתפק בלראות מה אחרים הגיבו ולהגיב תגובה בסגנון, אוהד רק מסמן v שהייתה תגובה.\n\nהמבחן: יומיים לעבור על החומר ולפתור את כל השאלות חזרה הספיקו לי בשביל 95. תחפשו בסטודנטים בטכניון יש איזה מישהו שהכין דרייב עם סיכומים ושאלות חזרה של הקורס שממש תפר לי את ההתכוננות. דרש קצת השקעה כי לא הקשבתי למילה כל הסמסטר אבל בסוף היה די בסדר.\n\nהשורה התחתונה: לא מומלץ בכלל אם אתם לא ממש אוהבים פילוסופיה, כן צריך להשקיע קצת זמן בתקופת מבחנים בשביל ציון טוב (למלג).", "timestamp": 1713169883762}, {"author": "yakir bitton", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אוהד נחתומי\nחוות דעת - הרצאות: \nאחלה מרצה, יודע לדבר בהתלהבות על החומר, לפעמים מונוטוני אבל סך הכל מעביר את ההרצאות בצורה קלילה וזורמת\n80% נוכחות - תנאי לגשת לבחינה למרות שזה לא ממש נאכף\nבכל הרצאה יש תרגול יוגה של 15 דקות בהתחלה ולאחר מכן צריך למלא שאלון במודל על איך התרגול גרם לי להרגיש. מילוי 10 שאלונים מזכה בבונוס\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין תרגולים\n\nשעורי הבית: פעם בשבוע צריך לבצע מטלה אחת של קריאה או שתיים בהן צריך לקרוא טקסט של אחד הפילוסופים שלמדנו בהרצאה האחרונה או שנלמד עליו בהרצאה הבאה, ואז לבחור קטע מתוך הטקסט שאהבתי או שעניין אותי ולכתוב עליו מה דעתי, אפשר לרפרף ולתפור את המטלות תוך 10 דקות - חצי שעה גג, למרות שכדאי לקרוא כמה שיותר כי זה בסופו של דבר גם החומר עליו נבחנים בסוף. ביצוע 10 מטלות מזכה בבונוס, לכל מטלה ציון בינארי עשה או לא עשה ללא חשיבות לעומק התוכן.\n\nהמבחן: 20 שאלות אמריקאיות במשך שעה ו20\nמבחן מאוד קליל, שאלות יחסית שטחיות אבל יש כל מני פינות של מי אמר ומתי שלפעמים מבלבל כי יש כמה פילוסופים שהגישות שלהם די דומות אבל סך הכל ניתן ללמוד יום-יומיים למבחן ולקבל 90+\n\nהשורה התחתונה: \nקורס ממש נחמד, מתעסק בכל מני ספקולציות של היחס בין הגוף לנפש לפי כל מני פילוסופים שונים, ונוגע גם בגישה עכשיווית ומודרנית בכיוון מחקרי של מדעי המוח ליחסים בין הגוף לנפש(בצורה קלילה ולא פקולטה לרפואה)\nסך הכל קורס קליל, מל\"ג מאוד מומלץ", "timestamp": 1713429102595}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אוהד \nחוות דעת - הרצאות: \nקצת משעממות, היה נחמד כשחילק אותנו לזוגות כדי לדון בנושא של ההרצאה, וזהו.. אני אישית לא מתחברת ליוגה אבל באמת שזה סתם לא צריך לדאוג זה לא דורש השקעה (בסוף זה מלג ולא קורס ספורט)\n\nשעורי הבית: \nפעם בשבוע, מטלת קריאה, צריך לסמן משפט שאהבנו, 10 דקות גג אפשר פשוט לראות מה אחרים הגיבו ואז לכתוב אותו דבר \n\nהמבחן: \nקצת מבלבל ומעצבן אבל אפשר ללמוד יומיים ולהוציא 90+ כי יש בונוסים למי שמילא את השאלונים אחרי כל תרגיל יוגה בהרצאות\nהשורה התחתונה: סך הכל סבבה, להשקיע לפני המבחן וזהו", "timestamp": 1713636370781}]}