{"posts": [{"author": "noor wishahe", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר כץ פלד\n\nחוות דעת - הרצאות: מעניינות מאוד וקלילות.\n\nשם המתרגל/ת: אין. \nחוות דעת - תרגולים: אין.\n\nשעורי הבית: אין.\n\nהמבחן:  אמריקאי, כ 30 שאלה. היא מביאה שאלות שמופיעות במצגות שלה. שום דבר שלא ראיתם לפני. ללמוד יומיים זה מספיק.\n\nהשורה התחתונה: קורס מומלץ מאוד, מעניין, קל, מבחן סופי הוגן, מרצה מצוינת.", "timestamp": 1643018746387}, {"author": "Niv Sulimany", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר פלד כץ\nחוות דעת - הרצאות: \nמעניינות. עוברים על מקרים שקרו בארץ ובעולם ומנתחים אותם מהזווית האתית \\ מוסרית \\ חוקית\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: ה-100 הכי קל שהיה לי בתואר. בהרצאה לפני המבחן פרסמה מצגת \"חזרה\" עם כל השאלות למבחן (לא אמרה זאת מפורשות אבל). למדתי אותה יום לפני המבחן (משהו כמו שעתיים). המבחן לקח 20 דקות (של להזכר בתשובות).\nהמל\"ג הכי טוב שיש, ואני גם אחזור לתמר בעתיד.\n\nהשורה התחתונה:", "timestamp": 1643098619864}, {"author": "אסף", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר כץ פלד\nחוות דעת - הרצאות: מאוד מעניינות ורלוונטיות. הקורס עוסק הרבה בנושאי רשלנות ואחריות מקצועית אז יש גם חשיבות למה שלומדים.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: מבחן אמריקאי, קליל מאוד, לקוח ברובו המוחלט ממצגת הסיכום שתמר העלתה למודל ועברה עליה בהרצאה האחרונה.\n\nהשורה התחתונה: לי הספיק להיות בכל ההרצאות ולהקשיב ואז גם לראות את ההקלטה של הרצאת הסיכום על מהירות גבוהה בלילה שלפני המבחן.\nמאמין שגם ללא נוכחות מירבית / תשומת לב רבה במהלך הסמסטר אפשר להיסגר על החומר אבל אני ממליץ לנצל את ההרצאות כי הן ממש מעניינות.\n\nקורס סופר מומלץ, כל מה שאפשר לרצות ממל\"ג.", "timestamp": 1643100025440}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nהמרצה מאוד חמודה, היא מעבירה את החומר בצורה מעניינת, מדגישה זמן לדיונים ולשאלות. במהלך ההרצאות היא אומרת מה רלוונטי למבחן ומה לא.\n\nשם המתרגל/ת: אין \nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: \nהמבחן אמריקאי, המרצה לא עושה מבחנים קשים, אין שאלות מבלבלות, צריך להקשיב טוב מאוד לשיעור האחרון-שיעור סיכום וכך ניתן לקבל 100 \nהשורה התחתונה: \nמלג מומלץ, חומר מעניין, מרצה טובה מאוד", "timestamp": 1643100590775}, {"author": "Tal Dahan", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר כץ פלד\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות ותמר מרצה מעולה ופשוט כיף להקשיב לה וללמוד אצלה.\n\nשעורי הבית: אין\n\nהמבחן: קל מאוד, 29 שאלות אמריקאיות, אפשר לסיים ב15-20 דקות. מספיק ללמוד כמה שעות ולחזור על המצגת סיכום שהיא מפרסמת.\n\nהשורה התחתונה: \nמלג מומלץ מאוד.", "timestamp": 1643113156161}, {"author": "David Nave", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: מרצה נהדרת, מאוד כריזמטית ומעניינת.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: יש שאלות לדוגמה לאורך כל הסמסטר במצגות שהיא מפרמתץ השאלות במבחן ממש דומות.\n\nהשורה התחתונה: \nמרצה נהדרת! קורס מומלץ ומעניין", "timestamp": 1644481294587}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה:  תמר\nחוות דעת - הרצאות: פשוט מקסימה ונהדרת. הקורס לא כזה משעמם, אז אם מקשיבים לה אפשר להנות (אבל בתכלס לא הכרחי כדי לקבל ציון טוב).\n\nהמבחן: 100 אחוז מרופרנס. בשיעור האחרון היא מעבירה מצגת סיכום עם מלא שאלות והמבחן היה מורכב מהשאלות האלה. הבנתי שהיא עושה את בכל הקורסים שהיא מעבירה, אז אם לקחת מלג זה רק איתה.\n\nהשורה התחתונה: קורס מעולה, ה100 הכי קל שהוצאתי במלג.", "timestamp": 1645879799465}, {"author": "me", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: תמר\nחוות דעת - הרצאות: \nכמרצה היא מדהימה. החומר לפעמים מעניין לפעמים לא.\n\nשעורי הבית:   אין\n\nהמבחן:  נחמד וקל, יום למידה במקסימום.\n עוברת בשיעור האחרון על מצגת סיכום שזה כל מה שצריך למבחן (עם שאלות חזרה למבחן)\n\nהשורה התחתונה:  ההגדרה למלג המושלם.", "timestamp": 1712315298611}, {"author": "קופץ ראש מעל 45 מעלות למים רדודים", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ד\"ר תמר כץ פלד\nחוות דעת - הרצאות: המרצה הכי טובה שנתקלתי בה בטכניון. יש לה ערוץ יוטיוב למי שסקרן:\nhttps://youtube.com/@Dr.TamarKatz\nהייתה בדיקת נוכחות רק 3-4 פעמים במהלך הסמסטר, אבל וואלה כדאי להגיע בכל מקרה.\n\nהמבחן: ממוצע 99. מה עוד יש להגיד...\n\nהשורה התחתונה: בניגוד לעשרות מל\"גי האתיקה הגנריים שמוצעים בטכניון פה דווקא הדגש הוא הצד המשפטי והאתיקה יחסית שולית. מאוד מעניין למי שמתעניין במשפט פלילי. וגם מי שחושב שזה לא מעניין אותו יחשוב אחרת כשיקשיב לתמר.", "timestamp": 1712874917674}, {"author": "Noga", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: תמר האלופה!\nחוות דעת - הרצאות: \nאין מה לומר האישה הזאת חדה רצח, והחומר מעניין לדעתי, במיוחד איך שהיא מלמדת אותו. גם יש מקום לדיונים בין הסטודנטים ובאמת ממש מעניין בשיעורים שלה. יש נוכחות חובה אבל היא לא בדקה נוכחות כמעט בכלל, ואת כל המצגות שהיא משתמשת בהן בשיעור היא מעלה למודל.\nבשיעור האחרון יש חזרה למבחן שעוברים על החומר ועל שאלות לדוגמה, לא לפספס את השיעור הזה!\n\nשם המתרגל/ת: אין תרגולים\n\nשעורי הבית: אין, אולי רק לראות איזה סרטון שהיא שולחת כי אחר כך היא מתייחסת אליו בשיעור, לא משהו רציני\n\nהמבחן: אמריקאי, ולפי הביקורות בצ'יזפורק היא העלתה את הרמה של המבחן בסמסטר שלנו, צריך באמת לדעת את החומר ולא רק מהמצגת של החזרה למבחן\n\nהשורה התחתונה: מל\"ג מומלץ וגם יש לה עוד מל\"ג וגם הוא מומלץ", "timestamp": 1717861663153}]}