{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גיל \nחוות דעת - הרצאות: מרצה טוב, ההרצאות מעניינות.\n\nהמבחן: היה ממוחזר ביחס לסמסטר קודם. המל\"ג חדש יחסית אז אי אפשר לדעת מה יהיה בהמשך.. \n\nהשורה התחתונה: מל\"ג מומלץ. אפשר לקרוא את סיכום ההרצאות יומיים לפני (108 עמודים אבל יש הרבה תמונות)  ולהוציא 100 בלי הרבה מאמץ. יש גם סיכומים קצרים יותר אבל אם רוצים ללכת על בטוח כדאי לעבור על הסיכום הארוך.", "timestamp": 1612637305648}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: גיל פישהוף\nחוות דעת - הרצאות: מל\"ג קל ומעניין. ממש נהנתי וציפיתי להרצאה. מי שאוהב אומנות נורא יתחבר לקורס הזה. הקורס מתחיל בלמידה על הברית החדשה ועקרונות הנצרות ואחרכך לומדים לזהות את העקרונות האלה ביצירות אומנות מכל התקופות. המרצה מעביר את הקורס בצורה מעניינת ותמיד מקפיד להדגיש את מה שחשוב. מומלץ מאוד!!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: המרצה כן ביקש מאיתנו לקרוא כמה פרקים מהברית החדשה. אפשר היה להסתדר בקורס גם בלי לקרוא זה באמת לא הוסיף יותר מידי.\n\nהמבחן: מבחן קל ומאוד ממוחזר (זה קורס חדש אז היה רק שחזור אחד שלמדנו ממנו וגם זה הספיק) בלי תחכומים.\n\nהשורה התחתונה: מל\"ג מומלץ ואחד המעניינים שלקחתי.", "timestamp": 1613556396777}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גיל פישהוף\nחוות דעת - הרצאות: ההרצאות מעניינות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: הוגן מאוד. גיל הסביר לאורך כל הסמסטר שהוא לא שואל על הדברים שהזכיר על קצה המזלג, אלה על הדברים שהוא הסביר לעומק. המבחן היה בהתאם לכך, ללא תחכומים וללא ניסיון להפיל.\n\nהשורה התחתונה: מלג משוחזר ושווה לקחת אותו.", "timestamp": 1643283406486}, {"author": "dima", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: \nחוות דעת - הרצאות: very good\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: very easy and fair\n\nהשורה התחתונה:", "timestamp": 1645644610609}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: גיל\nחוות דעת - הרצאות: לא הייתי ולא ראיתי\n\nהמבחן: קליל, משוחזר, הוא מוסיף תמיד איזו שאלה או שתיים לא מושחזרות אבל עדיין אפשר לקבל מעל 90 עם אפס השקעה במהלך הסמסטר ועם למידה של שלוש שעות למבחן.\n\nהשורה התחתונה: מומלץ מאוד. משוחזר. בלי נוכחות חובה. שלוש שעות למידה ואתם עם ציון מעל 90.", "timestamp": 1654341346943}, {"author": "Anne Onimus", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: גיל פישהוף\nחוות דעת - הרצאות: מרצה מצוין, מסביר מעולה, החומר מעניין והמבחן סופר הוגן ורק על קונספטים ממש מרכזיים והמרצה גם ציין מראש שהוא ישאל רק על דברים מרכזיים שנאמרו בפירוש ולא יהיו שאלות מתקילות או קטנוניות. בקיצור מרצה מצוין עם יחסי אנוש מעולים.\n\nשעורי הבית: אין\n\nהמבחן: הוגן מאוד וממש קל\n\nהשורה התחתונה: מלג מומלץ גם מבחינת ציון וגם מבחינת עניין", "timestamp": 1656031693335}]}