{"posts": [{"author": "Shani Wassershtein", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אין מבחן יש עבודה קבוצתית - לבנות מודל קנבס (תכנית כלכלית) למוצר שהמצאנו. ממש לא הרבה עבודה, כל אחד בקבוצה לוקח על עצמו שניים שלושה נושאים מטבלת הקנבס וממלא בהתאם למוצר, ובהתאם למה שמדברים עליו בקבוצה. \nציון מאוד גבוה והרצאות מאוד מעניינות (בזום לא הייתה נוכחות חובה בהרצאות, והן לא קריטיות כדי לעשות את העבודה, אלא בעיקר כדי להעשיר את הידע על עולם היזמות).\n\nהשורה התחתונה: אחלה קורס, מעניין ומועיל.", "timestamp": 1598874890975}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 1, "semester": "202001", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: \nלצערי קורס מאכזב, רוב ההרצאות לא מעניינות ומועברות בצורה לא טובה, היו גם הרצאות שחזרו על עצמם מאוד.\nהקורס לא מנוהל בצורה טובה וקשה להבין מה נדרש ממך לאורך הסמסטר.\nהמבחן: \nללא - יש פרויקט קבוצתי שמציגים למרצה.\nלא ניתן זמן מספק להציג אותו כפי שהובטח ונראה שבעיקר היה רצון \"להריץ\" את המצגות של האנשים.\nניקוד על הפרויקט ניתן בצורה לא בונה ונראה כי הוא לא תואם את הפרויקט.\nהשורה התחתונה: \nקורס לא מעניין, דורש השקעה שלבסוף מתעלמים ממנה. אמנם קורס עם ממוצע גבוה, אבל לעניות דעתי לא שווה את זה.", "timestamp": 1612106564360}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דינה רפאל ומרצים אורחים.\nחוות דעת - הרצאות: מאוד מאוד מעניינות, לקחתי המון מההרצאות. אעפ\"י שפה ושם היו הרצאות גרועות, רובן היו מעולות ומאוד מלמדות! אין נוכחות חובה.\n\nשעורי הבית: יש להכין את הפי'ץ ביחד עם מצגת או עם מודל הקנבס (אתר להצגת מיזם וריכוז כל מיני דברים הקשורים למיזם) לפני ההרצאות הסופיות אז צריך להיפגש (כל הקבוצה או רובה) ולעבוד על זה.\n\nהמבחן: אין - ציון על סמך הפי'ץ והמצגת / מודל הקנבס\n\nהשורה התחתונה: קורס חשוב מאוד למי שמעוניין ביזמות, מאוד מאוד מלמד ומאוד רלוונטי לעתיד! מומלץ מאוד מאוד מאוד מאוד!!", "timestamp": 1615982708723}, {"author": "Karam Abu Hanna", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דר. דינה רפאל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: Workshops to watch, interesting and not long\n\nהמבחן: Create a group project which is the Business Model Canvas. Work can be divided which makes it easier\n\nהשורה התחתונה: Great Course, highly recommended", "timestamp": 1615996725119}, {"author": "shoval ozeri", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: דינה רפאלי\nחוות דעת - הרצאות: די מיותרות. אם מישהו מעוניין ביזמות אז אולי הוא יפיק קצת ערך מההרצאות שלה, אני לא התלהבתי. היא גם העלתה סרטונים של יזם מארה\"ב שסיפר על כמה שהוא הצליח בחיים ובסוף הקורס הגשנו \"שאלה ליזם\" בהקשר של הסרטונים האלה. כל כמה זמן צריך להראות התקדמות לקראת מודל הקנבס, בשורה התחתונה מדובר במל\"ג עם שיעורי בית. \nבסוף מציגים את הרעיון היזמי שבחרתם ואת מודל הקנבס, ודינה נותנת ציון באופן אקראי. היא גרמה לנו לצלם סרטון ליזם בשביל בונוס 5 נקודות, לפי ההיסטוגרמה לא היה שום בונוס.\n\nהשורה התחתונה: קורס לא מוצלח. דינה חושבת שהקורס מלמד על יזמות אבל בפועל מרגיש מאולץ ובזבוז זמן. אם אתם מאוד מתלהבים מיזמות מוזמנים לנסות, אם לא אז הקורס לא שווה את המאמץ.", "timestamp": 1627810376998}, {"author": "הייטר ממוצע", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: אין ממש הרצאות, ודינה הזויה\n\nשעורי הבית: צריך להכין פיצ' ומצגת סופית לאורך הסמסטר בקבוצות של 5. זה מפתה אבל כבר עדיף מלג רגיל שיושבים בו שעה בשבוע ולומדים יום למבחן מאשר להצטרך להפגש עם קבוצת של 5 (שזה מועד לפורענות) ולהכין מצגות דביליות בשביל לרצות מרצה הזויה\n\nהמבחן: אין\n\nהשורה התחתונה: לא ממליץ בכלל", "timestamp": 1644305154991}, {"author": "עקצו אותנו", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: \nאין פרונטלי מלבד מספר מפגשים מצומצם, צריך לראות סרטונים ואחריהם לעשות משימות..\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nצריך להכין לאורך הסמסטר מספר דברים:\nמצגת פתיחה שמסבירה על רעיון המיזם\nפיץ׳ היזם שכולל כבר את פתרון הבעיה\nמצגת סופית גדולה  \nתקציר מנהלים\nהמבחן: \nניתן ציון כולל על כל המשימות, בלי באמת הערות על חלוקת הניקוד למרות ששיפרנו ויישמנו את כל ההערות ממשימות הביניים..\nהשורה התחתונה: \nביזיון של קורס, השקעה יותר גדולה בפער ממלג רגיל..והציון ניתן שרירותית!  לא ממליץ בכלל לקחת.", "timestamp": 1644306527945}, {"author": "ע", "difficultyRank": 5, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: \nרובם ללא הגעה\nשעורי הבית: \nלעשות מין פרויקט של מיזם, שבסוף איכשהו נותנים עליו ציון בין 80 ל95 \nהמבחן: \nלא ברור איך נבחרים הציונים אבל הם נמוכים מאוד ביחס למלג\nהשורה התחתונה: \nמלג לא מומלץ", "timestamp": 1644417804163}, {"author": "ע", "difficultyRank": 3, "generalRank": 1, "semester": "202101", "text": "שם המרצה: דינה \nחוות דעת - הרצאות:  אין ממש הרצאות, חוץ מהראשונה ועוד אחת לקראת הסוף, לא באמת מלמדים משהו במלג הזה.\nבסוף המל\"ג הוא ליצור איזשהו מוצר ולהציג אותו.\nמשום מה בסמסטר שלנו דינה החליטה להתאכזר ונתנה לרוב הקבוצות מתחת ל90 במלג שעד עכשיו היה ממוצע 95.\n\nהשורה התחתונה: \nמלג לא מומלץ. אמנם זה ממש קצת השקעה אבל הציון בסוף נמוך", "timestamp": 1645201769521}, {"author": ".", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין בעיקרון אעבל ימש איזהשהו אתר מעצבן שצריך לפתור בו שאלות לפי הפרויקט שלכם בזמנכם הפנוי עד סוף הסמסטר ובהרצאה האחרונה תציגו מצגת \nהמבחן: אין, יש הצגה\n\nהשורה התחתונה: קורס לא מומלץץץץץ בכללל, הנוכחות בו לא חובה, אבל בסוף עליכם להציג מצגת  והיא תשים לכם ציון גרוע מבלי שתבינו למה ככה. בכלל לא מומלץ!!! במל\"גים צריך לקבל  95+ אבל בקורס הזה תקבלו ציונים גרועים ככה ללא סיבה.", "timestamp": 1675878654926}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "שעורי הבית: \nעמוס בטירוף כל שבוע הגשה\nהמבחן: \nאין מבחן קורס הזוייי יש מצגת בסוף מקבלים ציונים רנדומלית וציויניםם גרועים למרות ההשקעה\nהשורה התחתונה: \nממליץ להתרחק כל מלג אחר שיש עדיף על זה !!!", "timestamp": 1689140355201}, {"author": "bratt", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות: אין הרצאות, רעיונית אין חובת נוכחות אבל בקורס הסמסטר היו כל כך הרבה מרצים אורחים שבפועל היינו חייבים להיות גם ככה ב70% בלי קשר לפרוייקט\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: \n\nשעורי הבית: לא ברורים, ערמות של מלל באנגלית שבסופן בסך הכל מטלה שהיה אפשר לכתוב בחמש שורות\n\nהמבחן: אין מבחן, יש הצגת פרויקט שלמי שמעדיף זה אחלה ומרווח את תקופת המבחנים\n\nהשורה התחתונה: עוד אין ציונים כרגע(שבועיים אחרי סוף סמסטר) אבל ביחס לעצמי הבנתי שזה לא בשבילי, אין בדיקה מינימלית אפילו שהפרוייקטים לא באותו נושא וככה אצלנו מתוך 13 פרוייקטים היו שלושה זוגות פרוייקטים שהיו באותו נושא וכאשר אין מבחן ההשוואה היא בלתי נמנעת", "timestamp": 1689449376302}, {"author": "0000", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה\nחוות דעת - הרצאות: אין נוכחות חובה , היא חמודה אבל יש לה הרבה דרישות ולא מפרגנת בציונים הקורס לפי השם נשמע מעניין אבל אין בו שום עניין! אם אין לכם רעיון למיזם אל תקחו אותו, וגם אם יש תחשבו פעמיים\n\nשם המתרגל/ת: הילה\nחוות דעת - תרגולים: חמודה עונה על שאלות בזמן העבודה על פרויקט סיום ותרגילי בית\n\nשעורי הבית: כמעט שבועיות , מתחילים בכתיבת תוכנית עסקית\n\nהמבחן: אין, יש הצגה לתוכנית עסקית שאמורים לעשות במהלך הסמסטר\n\nהשורה התחתונה: תתרחקו !", "timestamp": 1689704296694}, {"author": "אדם", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: דינה רפאל \nחוות דעת - הרצאות: אני לא מבין איך הקורס הזה עדיין פה. רמה ממש ממש נמוכה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: קיבלתי ציון טוב למרות שלא למדתי דבר אחד אז אני לא אתלונן. \n\nהשורה התחתונה: מי שרוצה לא ללמוד דבר אחד אז ברוך הבא. מי שרוצה ללמוד ולהשקיע שיתרחק.", "timestamp": 1689887237378}]}