{"posts": [{"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: טרזי עזרא\t\n\nהקורס הועבר במרוכז בשבוע של חופשת חנוכה. מועבר כמו סדנא. עובדים בקבוצה, יוזמים איזה רעיון ורצים איתו, מפתחים אותו לגמריי בשבוע הזה ומציגים ביום האחרון של הקורס. לאורך השבוע יש הרצאות אורח.\nקורס קליל שסוגר פינה של מל\"ג אבל ממש מעניין.\nהקושי היחיד הוא שזה מהבוקר עד אחה\"צ ברצף כמה ימים,  דיי אינטנסיבי ועדיין הקורס ממש מומלץ לדעתי.\n\nסופר מומלץ!", "timestamp": 1614011014107}, {"author": "ק", "difficultyRank": 5, "generalRank": 4, "semester": "202001", "text": "שם המרצה: עזרי טרזי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס די משעמם אלא אם יש קבוצה טובה ועושים את זה בכיף. לוקח יותר זמן ממלגים אחרים אבל מצד שני זה לא במהלך הסמסטר אלא בחופש ואין מבחן.", "timestamp": 1615195446743}, {"author": "-", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה:  עזרא טרזי\nחוות דעת - הרצאות: הקורס מועבר כשבוע של האקטון משולב בהרצאות. קורס סופר מוצלח!! ממש מעניין והעבודה בקבוצות מאוד מכוונת מטרה ומסודרת. פשוט קורס מוצלח!\n\nציון: ציון נקבע לפי פרויקט וההצגה שלו בסוף.\n\nהשורה התחתונה: קורס סופר מומלץ.", "timestamp": 1625434448801}, {"author": "הליקופטר", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עזרי\nחוות דעת - הרצאות: ההרצאות עצמן די מעניינות, ומביאים הרצאות אורח מאוד שוות לאורך הקורס. לדעתי במתכונת שהוא מועבר קשה להתרכז באמת ולהנות/להפנים את התוכן אבל בסך הכל אחלה.\n\nהמבחן: הציון הוא על עבודה שמציגים כקבוצה בסוף הקורס, ציונים טובים סך הכל.\n\nהשורה התחתונה: הקורס הוא בעצם האקטון בחנוכה, שלושה ימים מבוקר עד ערב(9 עד 18 בערך) שפשוט שומעים הרצאות על יזמות ובמקביל עובדים בקבוצה על איזשהו מיזם ומציגים אותו בסוף. לדעתי עבור מי שלא אכפת לו לשרוף את חופשת חנוכה, זו דרך פצצה להשלים מל''ג בלי שהוא ישפיע בכלל על שאר הסמסטר.(וסוף הסמסטר בפרט).", "timestamp": 1644866698891}, {"author": "YT", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "מל\"ג שמועבר בחופשת חנוכה במשך 3 ימים מרוכזים.\nהסמסטר אצלנו הייתה התמקדות בקיימות עסקית.\n חצי מהזמן היו הרצאות אורח או הרצאות של המרצה האחראי עזרא בנושאים הללו. בגלל לחץ הזמן כמות ההרצאות ביום היא עצומה ומאד מאד קשה להתרכז, למרות שאלו נושאים מעניינים. לדעתי, הם צריכים לשנות את המתכונת הזו. בכל מקרה, אפשר בזמן ההרצאות לשבת בצד ולעשות שיעורי בית. \nהחצי השני של הזמן מוקדש לBRAIN STORM בקבוצות של 6 אנשים על רעיון כלשהו שקשור להרצאות שהועברו ולבסוף הצגה שלו עם מצגת ביום האחרון לקורס.\nלדעתי, מלג מאד מומלץ שדורש סך הכל השקעה של 3 ימים עם ציון מאד גבוה מובטח ולא צריכים בכלל להשקיע בו.", "timestamp": 1645095539598}]}