{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: אורית ולף\nחוות דעת - הרצאות: \nהרצאות מעניינות חבל ש 90% מההרצאות לא קשורות למבחן ,מלג מעפן ולא מומלץ\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1679232452281}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: ההרצאות היו ממש מעניינות, באמת חוויה נהדרת. אין צורך בידע מוקדם במוזיקה למרות שזה לגמרי בונוס. מלג מומלץ למי שמעניין אותו עולם המוזיקה הקלאסית\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: קליל ברובו, היו כמה שאלות שלא נלמדו אז זה היה מוזר\n\nהשורה התחתונה: מספיק רק להיות בכל ההרצאות ולהקשיב כדי להוציא מעל 90 בלי הרבה למידה לפני המבחן, בסהכ מלג מעניין לדעתי ושווה לקחת", "timestamp": 1679772709463}, {"author": "לא לקחת אם אין רקע בפסנתר", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה:  אורית וולף\nחוות דעת - הרצאות:  \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מטעה, המון חומר שרק נגני פסנתר\n\nהשורה התחתונה: לא לקחת! המון השקעה", "timestamp": 1689000715064}, {"author": ".", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: היא משוגעת ומטורפת בתחומה, אבל מפוזרת באותה מידה. בלתי אפשרי לעקוב אחריה ולסכם ואז היא עוד בהלם ששואלים שאלות על דברים לא ברורים שהיא אמרה או שסותרים. היא פשוט צפה עם המחשבות שלה. טוענת שלא צריך ידע מקדים בפסנתר - אבל זה שקר. מי שיש לו ידע מקדים כמובן שיש לו יתרון ענק על פני האחרים במבחן.\n\nהמבחן: 50 אמריקאיות מתוכן 20 על חומר תיאורטי ו-30 על 8 קטעי האזנה שהיו בפליליסט למידה למבחן ועוד אחד חדש שלעולם לא שמענו (שכמובן מי שמנגן על פסנתר מכיר וזה אחד מהיתרונות שלהם). מספיק יום אחד של למידה אבל.\n\nהשורה התחתונה: נאא", "timestamp": 1690012845470}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: משוגעת בקטע טוב, כריזמתית, ההרצאות חצי להקשיב למנגינות, חצי פשוט ללמוד מונחים/תאריכים/הגדרות בעל פה. שזה זוועתי בעיני. היא תגיד שהקורס מיועד לכולם אבל זה שקר, היא מצפה שתדעו לזהות שירים בעל פה בסוף הקורס וחושבת שרק להקשיב להם ברמתך(תוך כדי הליכה או אימון או למידה לקורס אחר), וחושבת שזה יגרום לנו לזכור ולזהות את המנגינות בעל פה.\n\nשעורי הבית: להקשיב לפלייליסט\n\nהמבחן: 20 שאלות על תיאוריה, 30 שאלות על ההאזנה למנגינות, שאתה לא יודע את השם שלהם אבל הם היו בפלייליסט. אין דרך נורמלית ללמוד למבחן מלבעד סיכומים של תלמידים מהסמסטר הנוכחי ולעבור על המילון מונחים של הקורס, השקופיות של הקורס חסרות משמעות.\n\nהשורה התחתונה: מאוד מאוד מאו דלא ממליץ למי שאין זיקה למוזיקה או עבר בנושא. למרות שהיא טוענת שהוא מכוון לאנשים חסרי רקע, הוא מאוד לא, אלא אם יש לך כישרון מולד בלהבחין בין יצירות פסנתריות שונות חסרי הבדל.\nנ.ב: נותן עומס כבד לקורס אך ורק בגלל הלמידה שדרוש כדי ללמוד להבחין בין סוגי היצירות", "timestamp": 1711959203240}, {"author": "כריס", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: מעניינות, מהנות ומלמדות, אורית מפמפמת הרבה דברים שחשוב שנזכור למבחן, כדאי מאוד לסכם את השיעורים ולכתוב את הנקודות החשובות שהיא אומרת, בסוף היא חוזרת על אותן נקודות המון פעמים ואלה הנקודות שהיא גם שואלת עליהן במבחן בסוף. \n\nהמבחן: החומר התאורטי לא קשה, אם הקשבתם בהרצאות החלק התאורטי במבחן יהיה קל ממש. אבל צריך להכיר את הפלייליסט ממש טוב, לדעת לזהות את היצירה + את המלחין שלה. לדעתי מספיק יום אחד של שינון טוב של הפלייליסט, ופשוט להקשיב בהרצאות לאורך הסמסטר ואתם מוכנים למבחן, זה באמת לא יותר מדי קשה.\n\nהשורה התחתונה: מל\"ג שדורש השקעה בלמידה למבחן, אבל לדעתי שווה את זה.", "timestamp": 1712492416947}, {"author": "נשר נשר", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: אין ספק שאורית חיה ונושמת את המוזיקה, מאוד קשובה לסטודנטים מנסה לתת לנו את החוויה וללמד אותנו באמת הרבה מושגים ולהגיע לרמה מאוד גבוהה, אני אישית מעולם לא שמעתי מוזיקה קלאסית והסתדרתי אבל כן צריך לאהוב מוזיקה ומי שמנגן על פסנתר יתחבר כנראה יותר לקורס, או מי שממש מעניין אותו מוסיקה בתיאוריה, מי שלא אל תגיעו בשום פנים ואופן!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: לא פשוט, 50 שאלות אמריקאיות, 20 שאלות הבנה ומושגים ו30 שאלות על קטעי האזנה שהיא משמיעה במהלך המבחן, לקבל 100 באמת בקשה מוגזמת אבל 90-95 אפשר עם השקעה של יום וחצי יומיים לקראת המבחן + כן להקשיב במהלך הסמסטר\n\nהשורה התחתונה: מי שאוהב מוזיקה ורוצה לחוות מעבר לסתם לסגור מל\"ג מומלץ מאוד,  מי שלא אל תתקרבו סתם תסבלו", "timestamp": 1712523265588}]}