{"posts": [{"author": "...", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: עירית ממש מקסימה וההרצאות שלה מעניינות (למי שהחומר מדבר אליו כמובן) עם הרבה סיפורים וחוויות אישיות שלה על יפן. אין נוכחות חובה אבל 10% מהציון היה שאלות שהיה צריך להגיש במהלך השיעור (בפועל היה רק בשתי הרצאות). הבנתי שהיה אפשר להגיש גם במהלך אותו שבוע ולא ספציפית בשיעור.\n\nשעורי הבית: הייתה עבודה שצריך להגיש בסוף הסמסטר בזוגות, לא דורשת יותר מדי השקעה ומהווה 30% מהציון הסופי. במהלך הסמסטר לא היו מטלות (היו מאמרים לקריאה אבל בפועל היה צריך לקרוא רק חלק מהם בסוף למבחן).\n\nהמבחן: 60% מהציון, אמריקאי לא קשה. רוב השאלות היו די בסיסיות כך שמי שהקשיב בהרצאות יודע לענות. ממליץ לעבור על סיכום טוב של ההרצאות לפני.\n\nהשורה התחתונה: לא עמוס בכלל, מבחן חביב, מרצה מקסימה, מי שמתחבר לנושא מאוד מומלץ!", "timestamp": 1644677730046}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אירית\nחוות דעת - הרצאות: מעניינות. אין נוכחות חובה ויש מידי פעם בהרצאות הגשות אז פשוט להיות על זה על המודל לראות אם נפתחה הגשה למהלך השיעור. בפועל היו לנו רק 3.\nלא לומדים על אומנות יפן, אלא על היסודות.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: הגשת רפרט בסוף סמסטר שהוא עבודה של 2 עמודי וורד בכתב גדול ומרווח ולהציג את זה במצגת מול הכיתה למשך 5 דקות. עבודה נחמדה שמתכללת את כל היסודות שנלמדו ביצירת אומנות וככה לומדים על היצירות.\n\nהמבחן: נחמד, 30 שאלות אמריקאיות מאוד קלילות.\n\nהשורה התחתונה: קורס נחמד מאוד.", "timestamp": 1644758666760}, {"author": "Yoav Ronen", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: הרצאות מעניינות, למרות שהכל מרגיש כמו מלא מידע לא קשור כדאי לשבת לסכם הכל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: בהגשת מצגת כולם מקבלים ציונים גבוהים, למבחן קשה ללמוד אם לא סיכמת במהלך השנה כי אין מלל בשקופיות ואין סיכום מוכן\n\nהשורה התחתונה:", "timestamp": 1645363983346}, {"author": "--", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: הרצאות קצת מפוזרות, לא לומדים על אומנות יפנית רק על יסודות אומנות ביפן. מומלץ לסכם הכל גם אם זה מרגיש מיותר.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: במצגת כולם מקבלים ציון גבוה, המבחן הוא על החומר של כל הסמסטר ושל קטעי קריאה באזור ה60 עמודים, חלקם באנגלית ומשעממים. אין מבחנים משנים קודמות ואין סיכום מוכן.\n\nהשורה התחתונה: לא מומלץ", "timestamp": 1645364537605}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202101", "text": "שם המרצה: עירית פרידמן \nחוות דעת - הרצאות: עירית מרצה כצת מבולגנת, השיעורים מפוזרים, היה ממש קשה להתרכז איתה ואפילו יותר קשה לסכם אחריה (מדברת ממש מהר וקופצת בין נושאים).\nכמעט אין מלל כלל במצגות שלה, רק תמונות, היא עומדת ליד המצגת ומסבירה, לא כותבת על הלוח (דבר המקשה אפילו יותר לסכם בשיעורים). \nעל הצד הטוב שלה: מרצה אנרגייטית (אפילו בהרצאה ב 8 בבוקר!!) מסבירה בצורה מעניינת ומדברת על החוויה האישית שלה ביפן (כמובן דברים הקשורים להרצאה ולא סתם סיפורים אישיים).\n\nחומר הקורס: בקורס לומדים על כל מיני תקופות ביפן (כמו שיעור היסטוריה) ועל התפתחות האומנות* ביפן בכל תקופה והשפעת מדינות אחרות על ההתפתחות.\n*אומנות = קליגרפיה וסוגי כתב / לבוש / אוכל וכופסאות בנטו... \n\nשעורי הבית: אין\nהיו כשני תרגילי כיתה ממש קלים שהגשנו במודל בסוף השיעור.\nיש כמה מאמרים (ארוכים) שצריך לקרוא לפני המבחן - ומופיע עליהם שאלות במבחן גם.\n\nהמבחן:\n 60% מהציון הסופי - כ 33 שאלות אמרקאיות קלות על כל החומר (וזה המון חומר וממש מפוזר).\nממש קשה ללמוד למבחן אם לא מסכמים בכיתה ואם לא מקשיבים לכל מילה שנאמרת בכיתה.\n*טיפ: ללמוד מיותר מסיכום אחד, עירית מבולגנת וגם סיכומי הסטודנטים אחריה היו מבולגנים, היו פרקים שלמים שנמצאים בסיכום אחד שלא מדובר עליהם בכלל בסיכומים אחרים, ואפילו היו כמה שאלות באחד המועדים שלא הופיע עליהם כלל חומר באף סיכום! \nאין מבחני עבר או סיכומים מסמסטרים קודמים.\n30% רפרט + הצגה (בזוגות או שלישיות) - בוחרים יצירה אומנותית, מסבירים עליה בצגה של 5 דקות בכיתה. לוקח סה\"כ יום שלם של עבודה וכולם מקבלים ציונים גבוהים בסוף.\n10% תרגילי כיתה\n\nהשורה התחתונה: מלג כייפי, חומר ממש מעניין ומלמד על יפן, אבל *לא מומלץ* לכמה סיבות: חומר ממש מפוזר, רפרט קצת מעצבן, צריך ללמוד ולסכם כמה מאמרים שכן מופיע עליהם שאלות במבחן.", "timestamp": 1645706535373}, {"author": "Bob Bobinson", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: עירית מרצה מאוד נחמדה. רואים שהיא ממש אוהבת את החומר. מה שכן, זה גורם לה קצת להתפזר או להיתקע על חומרים, והסמסטר לא הפסקנו חלק גדול מהחומר שתוכנן.\n\nשעורי הבית: יש רפרט (עבודת בית) ששווה 30% מהציון, אשר כולל מסמך וורד באורך שני עמודים והצגה לכיתה באורך ~5 דקות. בעוד שלא יותר מדי קשה להכין אותו, עדיין זה עמוס ביחד למל\"ג.\n\nהמבחן: כמו כל מל\"ג, אמריקאי ולא קשה במיוחד עם מקשיבים בשיעורים ולומדים כמה שעות. יש חומרי קריאה למבחן, אבל סיכומים בדרך כלל מספיקים.\n\nהשורה התחתונה: קורס מעניין עם מרצה טובה, אבל עמוס קצת ביחס למל\"ג.", "timestamp": 1647267768146}, {"author": "ma neim is a jeff", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: עירית\nחוות דעת - הרצאות: ממש משעמם ועמוס בתוכן, צריך לכתוב הכל כי אין סיכומים מסמסטרים קודמים וצריך לזכור הכל לשיעורי בית ולמבחן.\n\nשעורי הבית: היה צריך לכתוב פרזנטציה כל שבוע, גוזל המון זמן  ועמוס מאוד. לא מומלץ למי שצריך זמן לתרגילי בית מקורסים אחרים\n\nהמבחן: למרות שהמבחן אמריקאי זה היה מבחן מאוד קשה, דברים שוליים שנאמרו בהרצאה הופיעו בשאלות במבחן.\n\nהשורה התחתונה: הממוצע גבוה כי לקחו אותו קבוצה של אומנים מלימודי חוץ. שאר הסטודנטים הוציאו ציון גרוע וסתם בזבזו את הזמן.", "timestamp": 1673245746767}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: עירית\nחוות דעת - הרצאות: לא הקשבתי.\n\nשעורי הבית: היו רק 3 פעמים שהיא נתנה ש\"ב. הש\"ב קצרים והיא נותנת זמן לסיים בזמן השיעור.\nיש רפרט בזוגות (לבחור נושא ולהציג אותו במשך 5 דקות בכיתה). לוקח יום-יומיים לסיים אותו.\nציון: \n10% ש\"ב\n30% רפרט\n60% מבחן\n\nהמבחן: \n33 שאלות אמריקאיות קלות. למדתי רק מסיכומים של אנשים שרשמו במהלך ההרצאות וקיבלתי 97.\n\nלומדים בקורס על תקופות ביפן ועל איך לנתח יצירה אומנותית.\n\nהפעם הקודמת שהקורס הזה הועבר הייתה בחורף 2021-2022, אז החוות דעת הקודמת (סמסטר חורף 2022-2023) כנראה על קורס אחר.", "timestamp": 1689502714403}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עירית\nחוות דעת - הרצאות: מעניינות ממש ועירית מתוקה ברמות. הייתה משחררת אותנו איזה רבע שעה לפני סוף השיעור\n\nשעורי הבית: יש 3 תרגילים ממש קטנים שעושים אותם בכיתה כחלק מהשיעור. יש רפרט שעושים בזוגות שצריך קצת לשבת עליו לקראת סוף סמסטר.\n\nהמבחן: קל מאוד, לא שואלת דברים מסובכים\n\nהשורה התחתונה: מל״ג מושלם, מי שיכול להרשות לעצמו אני ממליץ. מי שמעניין אותו היסטוריה תרבות ואמנות אז בכלל מדהים", "timestamp": 1689648530999}, {"author": "cuse", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: סבבה, נחמדות כאלה.\n\nשעורי הבית: יש 3 תרגילים כל הסמסטר שכל אחד מהם עושים בכיתה ולוקח 5 דקות, ועוד עבודה שצריך לעשות ולוקחת רק כמה שעות בודדות.\n\nהמבחן: קליל, שאלות פשוטות יחסית, בלי הפתעות.\n\nהשורה התחתונה: ממליץ בחום", "timestamp": 1690401483257}, {"author": "סומי אה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: עירית פרידמן\nחוות דעת - הרצאות: מרצה באמת מקסימה. חלק מההרצאות היו מעניינות יותר וחלק פחות, הבאסה היחידה שצריך לכתוב כל מילה שהיא אומרת ולהיות על זה כל השיעור.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: היו במהלך הסמסטר כמה משימות פשוטות שעשינו תוך כדי השיעור, ופרויקט סופי שהוא ממש קליל (2 עמודים)\n\nהמבחן: מבחן אמריקאי, אם יש לכם את כל מה שהיא אמרה כתוב ותעברו על זה אז תצליחו\n\nהשורה התחתונה: מל\"ג סופר מומלץ", "timestamp": 1690871467528}, {"author": "בועז בלומו", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "חוות דעת - הרצאות: \nיש חובת נוכחות. הרצאות נחמדות\n\nשעורי הבית: \nאין שיעורי בית, יש לפעמים מטלות כיתה. יש פרויקט גמר נחמד שאפשר לחלוטין להכחיש ולג'נרט עם GPT, אבל צריך להציג אתו בכיתה בקבוצות\n\nהמבחן: \nקליל מאוד, אמריקאי", "timestamp": 1696399420406}, {"author": "רועי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמעניינות ממש, עירית עוברת על החומר בצורה מעמיקה אך לא כבדה. נהניתי\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nעבודות כיתה קלילות\nהמבחן: \nהיה פרויקט- לא כבד מדי, היה נחמד לשבת עליו. הוא לא כבד ככה שאפשר לקחת אותו ברצינות, להנות ממנו ובכל זאת לא לבזבז יותר מדי זמן\nהשורה התחתונה: \nלקחת", "timestamp": 1714555508147}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: עירית\nחוות דעת - הרצאות: נחמדה מאוד והיה כיף להקשיב, לפעמים אבל הרגיש שהיו דברים ששאלנו והיא לא ידעה לענות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין אבל לפעמים היא נותנת משימה בכיתה ומי שלא מסיים יכול לעשות בבית עד השיעור בשבוע הבא. אין סיבה לא לסיים את זה בכיתה כי בדכ זה לרשום כמה שורות על נושא מסוים וזה לוקח 5-10 דקות והיא נותנת לזה זמן \n\nהמבחן: לא היה, הגשנו פרויקט על נושא שבחרנו לבד ולקח לנו בערך 3 שעות והיה ממש נחמד לעשות אותו. היה צריך להעביר פרזנטציה בכיתה באורך של עד 10 דק. קיבלנו 100 \n\nהשורה התחתונה: קורס ממש ממש נחמד למי שמתחבר ליפן", "timestamp": 1717224527537}]}