{"posts": [{"author": "RL", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אביטל בינה-פולק\nחוות דעת - הרצאות: נחמדות. מתקיימות באנגלית.\nלפעמים מביאה מרצים אורחים ובדרך כלל הם קצת משעממים.\n\nשם המתרגל/ת: אין.\nחוות דעת - תרגולים: אין.\n\nשעורי הבית: יש. צריך להגיב בפורומים, לפרסם פסקאות על סרטים באורך מלא שיש לצפות בהם. בקיצור לא לעצלנים שבינינו.\n\nהמבחן: אין. יש פרויקט להציג.\n\nהשורה התחתונה: יחסית עמוס למלג, יותר משהייתי מצפה.", "timestamp": 1625486286912}, {"author": "Politics of Identities", "difficultyRank": 2, "generalRank": 5, "semester": "202002", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: המלג מועבר בשפה האנגלית ומערב סטודנטים מהבינלאומי. מרגיש ממש כמו שיעור אנגלית בתיכון, שעה וחצי קלילות על נושאים כלליים מאוד הקשורים ברב תרבותיות בארץ ועל החברה הישראלית. מידי פעם גם מגיעים מרצים אורחים.   \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: השתתפות בפורומים.\n\nהמבחן: אין מבחן. יש פרוייקט סוף - הצגה של 5 דק מול הכיתה. \n\nהשורה התחתונה: הקורס חמוד מאוד, ולא צריך להתאמץ יותר מידי בשביל להשיג ציון גבוהה - להקפיד על הפורומים, להגיע לשיעורים ולהשקיע בפרוייקט סוף. בתכל'ס הוא יותר היכרות של החברה הישראלית לסטודנטים מהבינלאומי ככה שאין מה באמת ללמוד בו, אלא יותר להכיר סטודנטים חדשים.", "timestamp": 1625691934937}, {"author": ".", "difficultyRank": 3, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: משעממות, כל סטודנט חווה את דעתו על איזשהו נושא מסויים, ככה כל שיעור שעה וחצי.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: נוראיים! יש פורומים בפורמט של Ment.io, כל תגובה מקבלת ציון ״פופולריות״ לפי ״עניין״ צפיות ולייקים וצריך להתחרות על הדירוג מול הסטודנטים האחרים, כשהדירוג נקבע ע״י מחשב בלי קשר לתוכן שכתבתם אלא רק לפי מדד פופולריות.\nהדירוג שלכם משפיע ישירות על הציון הסופי בקורס (30 אחוז).\n\nהמבחן: אין, יש עבודה, על העבודה קיבלנו משוב מ״שופטים אורחים״ שלא ברור מה הקשר שלהם לקורס, אבל אם לא הרשמת אותם בהצגה של הפרוייקט (5 דקות מצגת), צפה לפגיעה בציון.\n\nחבל שביזבזתי זמן וסמסטר על הקורס הזה.\n\nהשורה התחתונה: להתרחק !!!", "timestamp": 1626375393461}, {"author": "~", "difficultyRank": 4, "generalRank": 2, "semester": "202002", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: מתקיימות באנגלית. קצת משעממות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: לעשות עבודות פעמיים בסמסטר. להגיב בפורומים לפחות פעם בשבועיים. צריך להיות עם יד על הדופק כי אחרת הציון הסופי ידפק.\n\nהמבחן: יש פרויקט להציג (באנגלית).\n\nהשורה התחתונה: למי שמחפש מלג קליל וכיפי בלי שיעורי בית- להתרחק", "timestamp": 1641498098798}, {"author": "ABP", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: מועברות באנגלית, לא מרתקות אבל נחמדות.\n\nשעורי הבית: בסילבוס פורסם שיהיו פורומים ותרגיל בית בסוף את התרגיל בית היא לא נתנה לעשות. היה צריך להגיב ב3 מ4 פורומים ונראה שכל עוד מגיבים לעניין מקבלים בהם ציון סבבה.\n\nהמבחן: אין מבחן יש עבודה, דורשת השקעה אבל לא בצורה מוגזמת. מה שנחמד זה שאפשר להיות יצירתיים ולהוציא מזה גם קצת כיף ועם השקעה סבירה+ גם אחלה של ציון.\n\nהשורה התחתונה: אם יש לכם סבלנות להשקיע בפרויקט בחצי השני של הסמסטר, מומלץ. הרבה פעמים היא גם לא הקפידה על נוכחות וגם נתנה להתחבר מהזום ולא להיות בכיתה.", "timestamp": 1644826025256}, {"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: \nהרצאה שבועית של שעתיים עם הגעה חובה. בתחילת הסמסטר הייתה דרישה להגעה פרונטלית, ודי מהר היא שונמכה להגעה גם בזום בגלל גל האומיקרון של הקורונה. אין חובה להשתתף אקטיבית בהרצאות, רק להירשם בסוף ההרצאה כשמקריאים שמות. ההרצאה עצמה היא באנגלית ומציגה סוגיות בחברה הישראלית בנושאים שונים: החברה החרדית, החברה הערבית, החברה היהודית, מערכת החינוך ועוד.. ההרצאה מתנהלת בצורה של 50% תוכן שהמרצה מעבירה ו- 50% דיון פתוח עם הסטודנטים. מי שרוצה קצת לשפשף את האנגלית שלו ואוהב פוליטיקה והסברים על החברה הישראלית לא יסבול בהרצאות.\n\nשעורי הבית:\nהיו 4 \"פורומים\" במהלך הסמסטר שמתוכם היה צריך לבצע לפחות 3. פורום זה איזושהי שאלה שלרוב מתלווה אליה סרט ועליכם לצפות בסרט ואז לענות על השאלה בפירוט. כל תשובה מתפרסמת בפורום ייעודי של הקורס ושם אפשר להגיב לתשובות של אחרים ולנהל איתם דיון. בסמסטרים קודמים הדיון עם אחרים היה חשוב לציון הסופי אבל בסמסטר הנוכחי הוא כמעט ולא השפיע. פורום שאתם משקיעים בו זה שעתיים עבודה, פורום שאתם מחפפים בו אפשר לסיים גם ב- 20 דקות (לצפות רק בתחילת הסרט ולענות תשובה מחורטטת). 3 פעמים בסמסטר, תעשו את החשבון..\n\nהמבחן:\nאין מבחן בקורס, יש פרויקט. ניתן לעבוד עליו בקבוצות של עד 5 סטודנטים. בוחרים נושא כלשהו שרלוונטי לנושא של הקורס (לא חייב בכלל להיות משהו שנלמד כיתה) ועושים עליו עבודת חקר שכוללת לעבור על שני מאמרים, לאסוף ראיונות, סרטונים.. את ההצגה של הפרויקט אפשר לעשות איך שרוצים. אצלנו כולם הציגו בתור מצגת אבל בתכל'ס אפשר גם להעלות הצגה קצרה או לכתוב שיר (בנוסף לפרויקט הכתוב). זה נשמע כמו כאב ראש אבל אם תמצאו שותפים טובים אפשר לסיים את זה בשעה-שעתיים עבודה של כל אחד בכיף, ואם תאהבו את הנושא אז אפשר גם להשקיע יותר.\n\nהשורה התחתונה:\nנוכחות חובה אבל הרצאות שיכולות לעניין, שיעורי בית לא עמוסים ופרויקט שאפשר לסיים בקלות ולקבל עליו ציון מקסימלי. אחלה של מל\"ג שנשמע לא טוב בגלל הפרויקט ושיעורי הבית אבל בפועל מתגלה כבחירה מדהימה.", "timestamp": 1646155513459}, {"author": "Roy Mahlab", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: אחלה הרצאות לפעמים עולים דיונים מעניינים וזה גם מעניין לראות את דעתכם של אנשים מחול לגבי דברים שקורים בחוץ\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש כמה מטלות פורומים שצריך להגיב אבל די בקטנה\n\nהמבחן: אין מבחן יש עבודה סופית נחמדה שבוחרים בה לעסוק במשהו שקשור לדברים שלומדים בקורס (הרבה אופציות). \n\nהשורה התחתונה: אחלה מלג אני ממליץ", "timestamp": 1647412959986}, {"author": "Jared Goldberg", "difficultyRank": 2, "generalRank": 4, "semester": "202101", "text": "שם המרצה: אביטל בינה פולק\nחוות דעת - הרצאות: לעטים מעניינות, לעטים משעממות. הקורס הזה מועבר באנגלית והוא יותר מכוון לסטודנטים בינלאומיים, אז הרבה מההרצאות זה להציג מי הם בכלל חלק מהקבוצות השונות בארץ, במקום לדון באמת על איך הפילוג האתני\\דתי\\וכו משפיע על התרבות\\פוליטיקה\\וכו. קצת מבאס לפעמים אבל סה\"כ מעניין\n\nשם המתרגל/ת: ללא\nחוות דעת - תרגולים: \n\nשעורי הבית: פורומים סלש צפיינ בסרטים או קריאת מאמרים\n\nהמבחן: \"פרוייקט מחקר\" אשר מציעים נושא ושיטה ומקבלים ציון על העניין והביצוע. זה היה מאוד כיף לבצע בתכלס וחלק מהפרוייקטים של אחרים אף היו מעניינים. \n\nהשורה התחתונה: קורס קליל וסבבה אם לא איכפת לכם מקצת שיעורי בית במהלך הסמסטר. אם אתם דוברי אנגלית שפת אם זה חלום.", "timestamp": 1647437209599}, {"author": "יונתן מדן", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמעניינות בעיקר דיונים \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nיש פרוייקט סוף לחקור איזה נושא ולהגיש מצגת בקבוצות של 3-4 אנשים. צריך להשקיע איזה שבוע ואפשר לקבל ציון מעולה\nהמבחן: \nאין\nהשורה התחתונה:", "timestamp": 1657698827229}, {"author": "אני", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: דיונים מעניינים, המרצה פשוט נהדרת, מדברת בגובה עיניים ומסבירה הכל מאוד ברור, חשוב לה לשתף את כולם והיא באמת יוצרת דיון מעניין.\n\nשעורי הבית: בסוף כל שיעור צריך להגיש מטלה, עושים את זה על הזמן של השיעור וזה ממש בקטנה, יש הגשה של פרויקט שזה מצגת על נושא שבחרתם, דרש השקעה אבל הציון טוב והכתיבה עצמה לא קשה. אין מבחן.\n\n\nהשורה התחתונה: אחלה של קורס", "timestamp": 1660403223212}, {"author": "יאיר שרקי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: \nחצי דיון חצי הרצאה, עם הרבה פוליטיקה בין לבין. \nנוכחות חובה והיא בודקת כל תחילת שיעור.\nהכל באנגלית כמובן.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nצריך לעשות איזה מצגת בסוף הקורס.\n\nהמבחן: אין\n\nהשורה התחתונה: \nאני לא אוהב לעשות את ההפרדה של שמאלנים ימנים.\nאבל זה בוודאות הקורס הכי שמאלני בטכניון, כשאביטל דוחפת את זה בכל דיון והרצאה.\nלא בטוח אם היא עושה את זה כדי לעורר דיון בכיתה או כי היא במאת חושבת ככה.\nזה הדבר היחיד שטיפה מעכיר את האווירה בקורס, חוץ מזה יכול היה להיות אחלה מלג.", "timestamp": 1678961336025}, {"author": "ד.י.", "difficultyRank": 1, "generalRank": 2, "semester": "202202", "text": "שם המרצה: אביטל בינה-פולק\nחוות דעת - הרצאות: \nהקורס מועבר באנגלית \nבהרצאות בעיקר מציגים עובדות ונתונים אודות החברה הישראלית על כל גווניה והמרצה מעודדת שיח פתוח.\nיש לציין כי ניכר מאוד שהמרצה בעלת דעות שמאליות מאוד\nובדרך כלל מכניסה אותם כעובדות בשטח, לכן לכל מי שקשה לו עם דעות שמאליות קיצוניות לא הייתי ממליץ לקחת את הקורס\nלדוגמה המרצה הציגה סרטון בוא סטודנטים ערבים בטכניון מדברים על הקושי שלהם לראות חיילים בטכניון ושהם מגדירים עצמם כפלסטינים ולאחר מכן הדיון היה מוטה מאוד.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nאין מבחן, יש פרויקט אשר בו בוחרים נושא מעניין בחברה הישראלית ומציגים.\nהשורה התחתונה:", "timestamp": 1683198028945}, {"author": "הפיג׳מות", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות:  אחלה מרצה ואישה נהדרת, מתלהבת ממה שהיא עושה, אוהבת לפתוח דיונים ולשמוע קולות. \nאומנם אביטל שמאלנית והיא לא מנסה להסתיר את זה, אבל זה אחלה דבר, בניגוד לשאר המלגים בהם המרצה הוא יוסף הצדיק ואסור להשמיע אף דעה אחרת חוץ ממה שהוא אומר, היא נותנת לכולם לדבר ולבטא את עצמם, לסטודנטים ערבים, ימנים, שמאלנים, חרדים, הקהילה הגאה, ואני חושב שזה לב הכל, לדבר ולשמוע ולפתח את העיניים על הזהויות האחרות. \nבנוסף, לפעמים היא הזמינה אנשים שידברו על דברים בהקשר למה שלמדנו, למשל אני כערבי היה לי מעניין עד השמיים לשמוע מחרדית שהפכה לחילונית איך החיים שלה השתנו לפני ואחרי, גם היה מעניין לוחשוב ללמוד שוב על השואה ואיך היא השפיעה ועדיין משפיעה על קיומה של מדינת ישראל, ולדעתי, הכי חשוב, שקיים במקומות אחרים וחסר בטכניון, לשמוע על הצד הפלסטיני, על הנקבה (אין שום סיבה להסתיר את זה כשזה ניזכר ביומני בן-גריון), משהו שאנשים בכל מקום במדינה מפחדים לדבר עליו, ספציפית כאן בטכניון, ואני בטוח שאנשים שהכרתי במהלך הקורס (ימנים, אגב), למדו דברים חדשים שלא שמעו עליהם אי-פעם רק כי התפתחה שיחה בניהם לבין סטודנט ערבי שלא מתייפייף ופשוט אומר שאני מזדהה כ ערבי-פלסטיני.\n\nשעורי הבית: \nלוגים קטנים אחרי כל שיעור - לכתוב את הדעה שלך על מה שנלמד בהרצאה. משהו של 20 דקות בערך מזמן השיעור. \n\nהמבחן: איו מבחן יש פרויקט, תבחרו נושא שקרוב. ללבכם ותציגו, אך שימו לב שזה צריך להיות באנגלית. בנוסף, אם תשקיעו בהצגה ובנושא שתבחרו לא תהיה סיבה שאביטל לא תשים לכם ציון גבוהה, אם תעשו נפנוף ידיים אל תתפלאו אם תקבלו ציון מתחת ל-90\n\nהשורה התחתונה: אחלה קורס, הייתי לוקח עוד פעם כל סמסטר", "timestamp": 1689512651630}, {"author": "שמעון", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אביטל\nחוות דעת - הרצאות: באנגלית אז טיפה כבד, אביטל מאוד רוצה שיווצר דיון, גם אם מציגים דעות שהן לא בדיוק מדויקות / נשענות על עובדות.\nההרצאות הראשונות שהתחמקו מפוליטיקה היו יותר טובות, אבל לאורך הסמסטר היא נכנסה בתוך החברה הערבית והחרדית, שהיה קשה להמנע מביקורת, ומבינים מאיזה צד של המפה הפוליטית היא.\n\nשעורי הבית: מבקשים לכתוב 'לפחות פסקה' בסוף כל הרצאה, אין דרישה מסוימת. לפעמים היא נותנת שאלה לרשום עליה אבל גם אם תרשום משהו אחר זה בסדר.\n\nהמבחן: אין מבחן, יש פרויקט - צריך להציג 10 דקות מול הכיתה באנגלית, עושים בשלשות/רביעיות. הפרויקט על מה שרוצים (שקשור לפוליטיקה של זהויות), היא לא מגבילה.\n\nהשורה התחתונה: אחלה מל\"ג, לא דורש יותר מדי.", "timestamp": 1690391814040}]}