{"posts": [{"author": "asaf bialystok", "difficultyRank": 1, "generalRank": 4, "semester": "201902", "text": "קורס חביב, קצת יבש אבל יכול להיות שזה כי זה עבר בזום. \nמבחן קל מאוד למי שטוב בלזכור פרטים (אם כי הרבה שאלות הן פשוט שאלות של היגיון בריא, שגם בלי לקחת את הקורס אפשר לענות עליהן).", "timestamp": 1607967931737}, {"author": "סטודנט שקדן", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אייל פיסקוביץ \nחוות דעת - הרצאות: \nמונוטוני ומשעמם \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמתחכם, נופל על נתונים שאף אחד לא יכול לזכור מההרצאות. מלג גרוע גרוע להתרחק כמו מאש ! ! ! \nהשורה התחתונה: \nלא לקחת... תעשו טובה לעצמכם", "timestamp": 1624993078322}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אייל פסקוביץ'\nחוות דעת - הרצאות: מעניינות בעינייץ\n\nהמבחן: נוראי, המון שאלות מתחכמות, על חלקן לא באמת ניתן מענה בהרצאות.\n\nהשורה התחתונה: לא לקחת, הממוצע היה 81 והוא התעקש שלא לפקטר.", "timestamp": 1624993604225}, {"author": "עקצו אותי", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nחומר יחסית מעניין\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nטריקי מאוד, 40 אמריקאיות שחלק לא מבוטל מהם על פרטים שוליים מאוד וגם על פרטים יבשים. הממוצע והחציון ירדו במעל ל-10 נקודות והמרצה לא מוכן להתחשב..\nהשורה התחתונה: \nלא לקחת!", "timestamp": 1625038476682}, {"author": "לא ממליץ לתפוש", "difficultyRank": 1, "generalRank": 1, "semester": "202002", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: מרגיש די מרוח, חומר לעתים מעניין, לעתים נוטה לסטות מהחומר\n\nהמבחן: מנוסח בצורה מזעזעת שבבירור נועדה להכשיל או \"להעלות את הרמה\" ע\"י נרמול הציונים בצורה מלאכותית. ניסוח תשובות אמריקאיות מבלבל, למדנו בעיקר מחזרות על החומר וממבדקים של סמסטרים קודמים וההבדל הוא דרמתי, הסמסטר היה שינוי משמעותי לרעת הסטודנטים.\n שאלות מבלבלות שניתן לפרש בצורות שונות (ובמבחן אייל לא הסביר את כוונותיו ומיהר לחזור לשיעור אחר שהעביר, שוב, בזמן המבחן שהוא כתב בצורה לא ברורה), מכאן הממוצע הנמוך הסמסטר. אם בסמסטרים קודמים נשאלו שאלות על מגמות כלליות, נושאים מרכזיים וחשובים שעלו במהלך השיעורים, הפעם בשני המועדים היו שאלות קטנוניות שמצריכות לזכור למשל פרטים יבשים על כל בעל תפקיד שולי בכל מלחמות ישראל.\n\nהשורה התחתונה: לא לקחת. לא ברור הרציונל מאחורי השינויים השנה, אבל מלג לא מומלץ.", "timestamp": 1628543332262}]}