{"posts": [{"author": "...", "difficultyRank": 1, "generalRank": 1, "semester": "201902", "text": "מל\"ג פשוט משעמם, לא מומלץ בכלל!\nמתנהל בצורה לא רצינית, המבחן בסוף לא קל בכלל, דורש זיכרון רציני ומתמקד בדקויות הקטנות בחומר!\nבקיצור, לברוח כל עוד אפשר, מל\"ג לא מומלץ", "timestamp": 1601502982034}, {"author": "כינוי", "difficultyRank": 1, "generalRank": 1, "semester": "201902", "text": "לא מומלץ.\nהממוצע הנמוך בסמסטר אביב 2020 מדבר בעד עצמו.\nהמבחן מאוד קשה וכדי לעבור אותו צריך לדעת את כל החומר היטב, כאילו זה מבחן באנטומיה.\nתתרחקו כמו מאש! כל מל\"ג של הרב ממש לא מומלץ!", "timestamp": 1603176212793}, {"author": "Gadi Nabet", "difficultyRank": 1, "generalRank": 5, "semester": "201902", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: לא קשה\n\nהשורה התחתונה:  קורס מעניין ומומלץ", "timestamp": 1603181463326}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "201902", "text": "מרצה מזעזע שמזלזל במי שלא מאמין בתורה.\nהוא הומופוב ויצאה לו התבטאות הומופובית בהרצאה.\n\nבנוסף לכל זה, הממוצע נמוך מאוד, לקחתי קורסים פקולטיים עם יותר נק\"ז שהיו יותר קלים ועם ממוצע יותר גבוה.\n\nהמבחן קשה רצח ודורש שינון של החומר ושל הנקודות הקטנות שאף אחד לא שם לב אליהן.\nבנוסף לכל יש חלק פתוח במבחן.\nמותר להביא תנ\"ך למבחן אבל זה לא עוזר אם לא יודעים את הפרק והפסוק שצריך לחפש בו. המרצה לא נותן את הפרק ואת הפסוק. הוא אפילו לא אומר באיזה ספר זה נמצא...\n\nאפשר להצליח במבחן רק אם אתה דתי (או דתייה) שמכירים את כל התנ\"ך והפירושים שלו בעל פה.\n\nבקיצור: כל מל\"ג של הרב לא מומלץ וחובה להתרחק ממנו!", "timestamp": 1603308416208}, {"author": "Shay Shmoul", "difficultyRank": 2, "generalRank": 2, "semester": "201902", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות: ההרצאות הרגישו מעט כמו שטיפת מוח אצל רב מיושן\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: מעניינים וקיבלו ציון מגן\n\nהמבחן: חלק מרופרנס וחלק חדש\n\nהשורה התחתונה: מומלץ לתלמידים עם רקע תורני", "timestamp": 1606745232323}, {"author": "...", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות: \nלדעתי משעממות ולא באמת מלמדות הרבה.\n\nשעורי הבית: עבודה אחת שעושים בתוך חצי שעה ששווה 20% מהציון.\n\nהמבחן: ניסוחי שאלות אמריקאיות לא טובים בכלל, השאלות בחלק הפתוח היו ארוכות\n\nהשורה התחתונה: קורס קשה למי שלא ילמד אליו מספיק/לא מכיר את התנ\"ך בצורה סבירה", "timestamp": 1612259466397}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202001", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות: \nלא ההרצאות הכי מרתקות בהתחלה אבל החומר נורא קליל וסיפורי.\n\nשעורי הבית: יש הגשה קטנה בזוגות שלא לוקחת הרבה זמן ונכנסת לציון.\n\nהמבחן: הוגן ופשוט , שאלות שענינו עליהם בהרצאות.\n\nהשורה התחתונה: קל להוציא 100 גם למי שלא מגיע מרקע דתי,הרקע של התיכון הספיק לי לגמרי וקצת להקשיב בהרצאות. מל\"ג מעולה.", "timestamp": 1612685009854}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה:  ד\"ר אלעד דוקוב, שמכנה את עצמו רב הטכניון למרות שאין משרה של רב הטכניון.\n\nחוות דעת - הרצאות: מתחיל קצת משעמם לדעתי-הרבה נסיונות להסביר למה מלמדים בצורה הזאת דווקא ומה זה תורה שבעל פה, שהיה צריך לתת לזה שיעור או שניים ולא 4.\nההמשך מעניין לדעתי.\nהמרצה בניגוד לסטיגמות עליו נזהר מאוד מכניסה לפוליטיקה ואמירות בעייתיות ולדעתי היה בסדר גמור, במיוחד בהתחשב בדברים בעייתיים שהוא עשה ואמר בעברו...\n\nיש לציין שהנוכחות חובה ושהוא עושה שאלונים תוך כדי השיעור כדי לוודא מי מחובר.\nבנוסף חשוב לי להבהיר שבהתחשב בהיותו של המרצה ד\"ר למתמטיקה ההסקה הלוגית שלו קצת מוזרה בחלק מהנושאים,  פשוט תקבלו את ההיגיון שלו ואל תנסו להתעמק. מוזר לי שמתמטיקאי כמוהו הסכים לבסס חלק מהקורס על מערכת אקיומות רעועה וסותרת את עצמה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית:  יש עבודה אחת, מגן, לסקור פרשנות מודרנית יחסית לסיפור תנכי לבחירתך. ציונים גבוהים ולא לוקח הרבה זמן. יש טווח עצום של זמן אפשרי להגשה.\n\nהמבחן: די הרבה חומר, חצי מבחן חומר פתוח חצי לא, שאלות לפעמים קצת מוזרות בחלק שהחומר לא פתוח(שזה אמריקאי). תכלס בסדר גמור, אפשרי יחד עם המגן וציון השתתפות להגיע לאחלה ציון.\n\nהשורה התחתונה: לפעמים צריך קצת לגלגל עיניים ולתהות לגבי הלוגיקה של הדברים, ולפעמים המרצה עלול להגיד דברים בעייתיים אם כי הוא מאוד משתדל שלא. סה\"כ סביר, אבל יש מלגים יותר מומלצים.", "timestamp": 1615380803675}, {"author": "--", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות: \nלא היו ככ מעניינות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש עבודה להעלאת הציון למי שרוצה. בונוס על נוכחות מלאה\n\nהמבחן: היה אמריקאי. קשה מאוד וטריקי. ברוב השאלות צריך לדעת בדיוק בדיוק מה נכון - היה מסובך מאוד.\n\nהשורה התחתונה: אבל בסוף קיבלתי ציון סבבה", "timestamp": 1629117713654}, {"author": "Netanel", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות: מל״ג מאוד נחמד. \nאין עומס כמעט בסמסטר ויום בודד הספיק ללמוד למבחן\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1647934369898}, {"author": "X", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות:  החלק של אישים בתנ\"ך מעניין, כל מה שקשור ל\"אור ימיינו\" מקומם.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: יש שיעורי בית רשות שהם בונות\n\nהמבחן: המבחן שואל על פרטים ממש קטנוניים בחומר הנלמד.\n\nהשורה התחתונה: בסמסטר הזה המבחן היה קשה (הבנתי שהוא תמיד קשה) אבל תמיד הממוצע עמד על 95 והסמסטר על 86! בגלל \"שינויים בלימודי הסמכה\" לטענתו של הרב. \nההתנהלות בסמסטר ביזיונית- החומר במודל לא מעודכן וסותר את מה שהמרצה אומר. במשך כל הסמסטר ביקשנו מהמרצה לקבל סטטוס נוכחות ושיעורי בית כדי לוודא שאין טעויות- המרצה פרסם את הציונים בלי לשלוח לסטודנטים את הפירוט הזה. הייתה טעות בקביעת המבחן בלימודי הסמכה (המבחן נקבע אחרי שעות השיעור ולא בשעות השיעור כי שהיה אמור להיות), כשפנו לרב בבקשה לתקן את זה הוא אמר שהוא \"במקרה הטוב אדיש\" לשעת המבחן. כנראה שהרב עסוק יותר בשערוריות מאשר ללמד.\n\nלטעמי כל מה שקשור לחומר מהתנך ודברי חז\"ל מעניין אבל כל מה שקשור ל\"לאור ימינו\"- מקורות חיצוניים/כתבות/מאמרים פשוט מגמתי בטירוף ומקומם.\n\nבקיצור אם קראתם עד לפה מדובר במל\"ג שלא תלמדו בו, לא תקבלו ציון טוב ותצאו עם הרבה עוגמת נפש.", "timestamp": 1657445493140}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202102", "text": "שם המרצה: הרב אלעד דוקוב\nחוות דעת - הרצאות: \nהיה ממש מעניין,נותן רקע טוב ועמוק של התנך,ומקשר את זה לזמננו\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש עבודת בית ממש קלילה-25אחוז מהציון\nוכל שבוע יש שאלה קטנה\n\nהמבחן: מבחן ממש נחמד,דורש למידה אבל לא יותר מכל מלג אחר..מי שלומד מצליח במבחן\n\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1658121949686}, {"author": "שירה", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ד\"ר אלעד דוקוב\n\nחוות דעת - הרצאות: הרצאות היו מאוד מסקרנות, פעם ראשונה שאני לומדת יהדות בצורה כזאת מעניינת ולרוונטית לחיים.\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \n\nהמבחן: מבחן קליל,יש מאגרי שאלות..להקשיב בשיעורים וללמוד טיפה לפני\nהשורה התחתונה: קורס מאוד מעניין ורלוונטי לחיים! ממליצה", "timestamp": 1673121689685}, {"author": "גלעד מבורך", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות מעניינות ודי מגוונות, לא נכנס לנושאים שנויים במחלוקת ומביא כיווני מחשבה נוספים. מומלץ!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nתרגילים בקטנה ממש בסוף כל שיעור \nפרויקט 20% מגן שלקח לי חצי שעה (אבל אני עם רקע)\n\nהמבחן: \nצרי לזכור הרבה פרטים אבל ממש ממוחזר אז להשיג את הקובץ של השאלות מסמסטרים קודמים מסדר אותך\n\nהשורה התחתונה: לדעתי יכול לעניין גם מי שלא מרקע דתי ואפשר להוציא ציונים ממש טובים בלי יותר מידי השקעה", "timestamp": 1675854334118}, {"author": "***", "difficultyRank": 1, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת -  לא תואם את שם הקורס, זה פשוט שיעור תורה \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: רוצה ציטוטים מהתורה \n\nהשורה התחתונה: לא מומלץ", "timestamp": 1677147765319}, {"author": "א.ב.", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות:\nמעניין ומחכים. אני אישית מכיר הרבה תנ\"ך, ולמרות זאת היו בקורס הרבה רעיונות שהיו חדשים לי.\n\nשעורי הבית:\nיש רק מטלה אחת גדולה, אבל זה רשות, למגן. וחוץ מזה הרב מפרסם כל שבוע כמה שאלות קטנות לקראת ההרצאה הבאה - בערך 5-10 דקות עבודה.\n\nהמבחן: \nיותר קשה ממה שהייתי מצפה ממל\"ג. צריך גם להבין את הרעיונות, וגם לזכור את החומר לפרטי פרטים. אבל בסוף, מי שמשקיע יכול להצליח.", "timestamp": 1678055238424}, {"author": "סטודנט אזרחית", "difficultyRank": 2, "generalRank": 5, "semester": "202201", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: הרצאה רגועה ומעניינת, קורס מתנה למי שמגיע עם קצת רקע דתי. כל שיעור יש לו בערך 2-3 נקודות אמיתיות שהוא מדגיש ואח״כ שואל עליהם מבחן.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: כל שבוע הוא שולח קישור עם שאלות קלילות, אין תשובות נכונות, הוא רק רוצה שתענו. יש גם פרויקט לקח לי חצי שעה לעשות.\n\nהמבחן: חובה לתרגל מבחני עבר. הוא משחזר\n\nהשורה התחתונה: נהנתי גם מהקורס וגם מהציון הסופי", "timestamp": 1679555690275}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ד\"ר אלעד דוקוב\nחוות דעת - הרצאות: בגדול מעניינות, לפעמים יש קצת חלקים משעממים אבל בסוף הרבה מהנושאים מתחברים לאקטואליה מה שיוצר הרבה עניין.\n\nשעורי הבית: יש כמה ת\"ב קצרים שמקנים בונוס, ועבודה אחת של מגן שלוקח 1-2 שעות להכין.\n\nהמבחן: לא קשה למי שמקשיב בהרצאות וקצת חוזר על זה לפני המבחן, גם למי שלא מגיע מרקע דתי (כמוני).\n\nהשורה התחתונה: ממליץ לקחת, מרחיב אופקים ודי מעניין.", "timestamp": 1689087686280}, {"author": "סטונדט בטכניון", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אלעד דוקוב\nחוות דעת - הרצאות: נראה שהוא ניסה לעורר עניין אבל הצליח לו רק בכמה השורות הראשונות של הכיתה, וגם זה לא בהצלחה גדולה. אין כמעט קשר בין שם הקורס לבין ההרצאות - בסוף כולן הרצאות שלומדים בהם רק תנ\"ך.\n\nשעורי הבית: קלילים\n\nהמבחן: סביר, אפשר ללמוד אליו גם בלי להקשיב במהלך הסמסטר דרך סיכום טוב או להשיג סיכומים.\n\nהשורה התחתונה: מומלץ כי יש מגן גדול של שיעורי בית ופרוייקט שהצ'אטים של הבינה המלאכותית הנפוצים בימנו עוזרים בהם מאוד.", "timestamp": 1690301168045}, {"author": "סהכ מרוצה ממלג", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הרב אלעד דוקוב \nחוות דעת - הרצאות: נחמד, אפשר להתעניין לפעמים אבל לא למות על ההרצאות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: מטלה של 25% מגן. ממליץ, לא הרבה השקעה.\n\nהמבחן: יש שאלות ממוחזרות, יש שלא. שואל על החומר ולא מתפזר יותר מדי. לא קשה במיוחד\n\nהשורה התחתונה: ממליץ מאוד (בעיקרון ממליץ על כל המלגים של הרב).\nבכל הקורסים שלו שהייתי, יש 14 (!!!) נקודות בונוס לציון הסופי רק על נוכחות ו ״תרגילי בית״ (סהכ למלא טופס בגוגל דוקס - לוקח 2 דקות למי שסבבה בלמצוא תשובות מתוך טקסט ולא לקרוא אותו ממש). אין את זה באף מלג אחר שפגשתי.\n\nהייתי ב3 קורסים שלו, 100,95,100.\n\nמה שכן, כדאי לשבת ולסכם את החומר לקראת המבחן או אם יש סיכום (עדכני ואיכותי - כי לרוב מתפספסים דברים) לעבור עליו ועל השאלות ממבחני עבר.\n\nתתפנקו לכם.", "timestamp": 1690555937375}, {"author": "דתל\"A", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות: די משעממות ברובן. נאמרות שם אמירות מגוחכות שמצופה מד\"ר למתמטיקה להבין שאין הגיון בהן.\n\nשעורי הבית: המטלות השבועיות הם סבבה, אבל מרגיש שהן מנסות לקדם נרטיב של הרב. יש מטלה רשות שהיא 25% מגן שמומלץ להגיש.\n\nהמבחן: נורא! התקטננות על פרטים קטנים ושאלות שלא נלמדו בכלל בשיעור. מומלץ לשנן את כל השאלות מהמבחני עבר כי רק ככה אפשר להצליח.\n\nהשורה התחתונה: לברוח כמו מאש! אפילו הממוצע נמוך ביחס למלגים אחרים, וההשקעה בלמידה למבחן עצומה ביחס לקורס של 2 נק\"ז.", "timestamp": 1694201305045}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: הרב דוקוב\nחוות דעת - הרצאות: ממש נהנתי מהשיעורים!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: ממש קלילים, חוץ מאחד שדרש קצת יותר השקעה אבל גם זה לא בצורה מוגזמת.\n\nהמבחן: צריך ללמוד ולזכור הרבה פרטים קטנים שנלמדו מה שקצת מבאס ובכל זאת עם המגן של העבודה והבונוסים על הגעה להרצאות מקבלים ציון יפה.\n\nהשורה התחתונה:", "timestamp": 1695719215196}]}