{"posts": [{"author": "ניק", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אייל פסקובליץ'\nחוות דעת - הרצאות: \nלדעתי היו מעניינות\nשעורי הבית: \nבלי שיעורי בית\nהמבחן: \nהיה יחסית פשוט - 25 שאלות אמריקאיות ב50 דקות.\nחציון 96 - קראתי 3 פעמים את הסיכומים וקיבלתי 100 בלי לנחש אף שאלה\nהשורה התחתונה: \nמומלץ ביותר כמו כל המלגים של אייל", "timestamp": 1712651884428}, {"author": "יובל דיסקין", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהיו הרצאות ממש מעניינות, אייל העביר את החומר בצורה ממש מעניינת, ראינו לרוב תחקירים וסרטי דוקו. \nאין רשימות או משהו אז כדאי לסכם.\n\nשעורי הבית: לא היו שיעורי בית כלל (יכול להיות שזו הקלה בגלל המלחמה).\n\nהמבחן: היה 25 שאלות אמריקאיות, מי שקרא את הסיכומים לפני וזכר תאריכים הוציא 100 דיי בקלות. \n\nהשורה התחתונה: מל״ג ממש מומלץ, גם מעניין וגם מבחן קל.", "timestamp": 1712729144836}, {"author": "אביב העמים הערבי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אייל\nחוות דעת - הרצאות: סופר מעניינות, לא ראיתי אותן מפאת חוסר זמן במהלך הסמסטר, ומכיוון שהוא הקליט וגם לא בדק נוכחות אז תמיד אמרתי לעצמי שהסופש אני משלים את ההקלטה ובסוף לא עשיתי את זה כי לא היה לי זמן.\nהחומר מאוד מעניין ומתעסק בדילמות של השבכ מבחינה אתית, ועל כך שהיו מתעללים במחבלים שהיו תופסים לאחר פיגועים וכדומה.\n\nשעורי הבית: אין. הקורס דורש 0 השקעה במהלך הסמסטר\n\nהמבחן: קליל לגמרי. זאת פעם ראשונה שהקורס הועבר אז לא ידעתי למה לצפות, אבל קראתי סיכום שמישהי כתבה במשך 3 שעות בלילה שלפני המבחן וזה הספיק לגמרי להוציא 100 בלי מאמץ תוך רבע שעה, מעולם לא נבחנתי במבחן קל יותר מזה ואני מאמין שלעולם גם לא אבחן במשהו קל יותר.\n\nהשורה התחתונה: קורס סופר מעניין שהלוואי והייתי משקיע בו בזמן הסמסטר וגם הייתי נהנה ממנו, אבל מבחן קליל רצח 100 מובטח ושווה", "timestamp": 1713124967711}, {"author": "g", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: מעניין- בעיקר לקראת הסוף, משלב קטעים של וידאו. \n\nשעורי הבית: אין\n\nהמבחן: אחלה מבחן - אמריקאי. ללמוד שנים ותאריכים ותהיו בסדר.\n\nהשורה התחתונה: לקחת.", "timestamp": 1716993275019}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אייל פסקוביץ\nחוות דעת - הרצאות: מעניינות. הנושא מעניין,  המרצה מצחיק. היו כמה פעמים שהעביר לזום בגלל המבחנים אבל לא נורא\n\nשעורי הבית: אין\n\nהמבחן: קליל, המועד ב היה זהה גם למועד א \n\nהשורה התחתונה: לקחת", "timestamp": 1718031737595}, {"author": "היידה תעו\"ן", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: אייל פסקוביץ'\nחוות דעת - הרצאות: מדהים, מל\"ג ממש טוב, מרצה מעניין והחומר מעניין.\n\nשעורי הבית: אין\n\nהמבחן: קליל, צריך להקשיב קצת, לא חובה לדעת כל דבר אבל בכללי להבין מה קורה פה, תסתכלו על ההיסטורגמה ותבינו\n\nהשורה התחתונה: בואו, מהמלגי\"ם הכי טובים בטכניון וציון פצצה", "timestamp": 1719402550467}]}