{"posts": [{"author": "SM", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: ד\"ר אורית וולף\nחוות דעת - הרצאות: אורית היא פסנתרנית. וזהו. ולכן כל הקורס היה ברמה מאוד רדודה של פסיכולוגיה בגרוש. אם אתם אוהבים ספרי \"פסיכולוגיה\" וסרטוני העצמה מצוצים מהאצבע זה הקורס בשבילכם. הקורס כולו סבב סביב ted talks ושאלונים שהמהימנות שלהם קרובה ל\"איזה דמות דיסני אני\" ואלוהים יודע איך הסילבוס הזה אושר מול הטכניון. בנוסף, אורית הייתה חייבת בכל הרצאה להזכיר כל חמש דקות שמה שהיא אומרת יכול להיות במבחן ועל סמך הדברים שהיא אמרה בהרצאות היה אפשר לחשוב שמדובר בקורס שדורש לא פחות השקעה מקורסי חובה בטכניון (למרות שבמבחן התוצאה - ממש לא). \n\nשעורי הבית: לקרוא סה\"כ משהו כמו עשרה מאמרים ולראות כמה ted talks, כמובן כולל ה ted talk, הפודקאסט והמאמר של אורית עצמה. בנוסף, מטלת כתיבה של 300 מילים ומענה על שאלון במהלכו אורית מנתחת לכם את האישיות מול הכיתה.\n\nהמבחן: לא נורא בכלל, אפשר פשוט לעבור על החומר יום -יומיים לפני ולשנן. לא להקשיב לכל הדיבורים שלה במהלך הסמסטר על המבחן ולרמת ההשקעה שלה היא מצפה.\n\nהשורה התחתונה: אם זה עושה לכם ממש רע לשמוע בולשיט פסיכולוגי שאין לו שום בסיס אז תחסכו לעצמכם את עוגמת הנפש ותמצאו מל\"ג אחר. אם אתם מסוגלים לעמוד בזה בשביל ציון סביר בהשקעה די מינימלית אז תלכו ותשתדלו לשרוד את זה.", "timestamp": 1711973379508}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: יש חובת נוכחות וההרצאות לא מעניינות. \nיש לא מעט טענות בקורס שניתנות כעובדות, אבל חיפוש קצר באינטרנט יראה שכיום הן ממש לא מקובלות.\n\nשעורי הבית: קצרים \n\nהמבחן: השאלות לא תמיד ברורות ויותר לזכור שמות ורעיונות , אבל הציונים רק קצת יותר נמוך ממל״גים אחרים.\n\nהשורה התחתונה: אם אתם בסמסטר מוקדם ויש מל״ג עם מקום אחרי היום הראשון של הרישום, אל תירשמו אליו", "timestamp": 1712482179432}, {"author": "-", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: משעממות רצח. אורית זולגת מהנושאים כל הזמן, היה שיעור שהיא דיברה על הבעיות צנרת שלה בבית במשך חצי שעה. כל זה באנגלית במבטא כבד תוך כדי המצאת מילים שלא קיימות.\n\nשעורי הבית: קצרים וזריזים.\n\nהמבחן: הזוי לחלוטין. היו כמה שאלות שהתשובה אליהן תלויה בדעה נטו, וצריך היה לנסות להיכנס לראש שלה בשביל לנחש את התשובה שהיא כיוונה אליה. חלק נוסף של השאלות היה פשוט לזכור בעל פה פרטים שהיא הזכירה פעם אחת.\n\nהשורה התחתונה: קורס מזעזע. מומלץ להתרחק כמו מאש, עדיף שתמצאו משהו אחר כדי לסגור את הפינה של האנגלית בתואר.", "timestamp": 1712741035074}, {"author": "Anne Onimus", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: ההרצאות לא כאלה מזעזעות. החומר של הקורס הוא (כמו שנכתב פה כבר בביקורות האחרות) פסיכולוגיה בשקל, כל הקורס בוייבים של חוג מעורבות חברתית של כיתה ז וסרטוני העצמה. לדעתי האישית ההרצאות לא בדיוק משעממות, אורית מעבירה את החומר בצורה מספיק lively בשביל שיהיה יחסית מעניין אבל 99% מהחומר עצמו די בולשיט.\n\nשעורי הבית: יש סהכ 3 מטלות סופר קצרות להגשה שאפשר לסיים ב5 דק כל אחת. הן 20% מהציון ומקבלים 100 רק על עצם ההגשה. בנוסף במהלך הסמסטר היא נותנת כל שבוע לקרוא מאמר אבל אל תעשו את זה, זה לא באמת רלוונטי למבחן. לקראת המבחן היא תשלח רשימה של מאמרים שחשובים למבחן, כדאי לקרוא רק אותם. המאמרים עצמם קצרים, משהו כמו 3-6 עמודים כל אחד.\n\nהמבחן: קטסטרופה לגמרי. אורית התבלבלה בטעות וחשבה שהיא כותבת מבחן באינפי17 ולא במלג. איזה רבע מהמבחן היה שאלות על דברים שהם נטו דעתה האישית ועוד המון שאלות מכשילות ומטעות בכוונה שלא באות לבדוק ידע או הבנה אלא סתם לעצבן. למבחן ידעתי את כל ההרצאות והמטלות בעל פה והרגשתי שממש נכנסתי לראש שלה עד כמה שניתן, ועדיין הוצאתי 93 סופי, שזה עם כל הכבוד לא ציון למלג שיודעים ב1000%, במלג כזה הציון המתאים לרמת הידע הזו צריך להיות 100. את החומר עצמו כן אפשר ללמוד תוך יום-יומיים, אבל גם אם תדעו אותו מצוין כנראה שלא תקבלו 100 אלא באזור ה88-95.\nבנוסף אורית לא מפרסמת את הפתרון של מועד א עד שיסתיימו גם מועד ב וג, כדי שחס וחלילה אף אחד לא יוכל ללמוד מהטעויות שלו.\n\nהשורה התחתונה:  \nאם אתם מחפשים מלג עם ציון שואף ל100- זה לא בשבילכם\nאם אתם מחפשים מלג מעניין עם חומר מעניין- זה ממש לא בשבילכם\nאם קשה לכם לשמוע שטויות על \"פסיכולוגיה\" שלא מבוססות על כלום - תתרחקו כמו מאש\nאם אתם מחפשים מלג עם מינימום השקעה שיתן ציון באזור של 85-95 אז אולי יהיה לכם סבבה", "timestamp": 1712933489271}, {"author": "..", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: \nחובת נוכחות, משעמם ברמות.\nתגיעו ותעשו דברים אחרים\nשעורי הבית: \n3 עבודות,20 אחוז מהציון הסופי כל עבודה לוקחת 2 דקות בלחץ ועצם ההגשה שלהן זה 100.\nהמבחן: \nבעיניי היה הוגן מאוד\n40 שאלות אמריקאיות מתוכן, 5 ״אנסין״ לא קשות בכלל. שאר השאלות היו קצת חופרות אבל על דברים שלמדנו ועל מה שהיא אמרה שיהיה במבחן, יומיים למידה הספיקו לגמרי. \nאמנם היו שאלה שתיים לא טריוויאליות על פרטים קצת הזויים( כמו באיזה יד המנצח בתזמורת מחזיק את השרביט שלו, ימין מסתבר)\nאבל בהתאם היא גם נתנה פקטור.\nהשורה התחתונה:\nקורס קצת הזוי אבל מעבר לחובת נוכחות אפשר לשכוח ממנו לגמרי עד יומיים לפני המבחן ולהוציא +90 בסבבה לגמרי, בתוספת העובדה שהוא באנגלית קיבלתם מלג סביר לחלוטין.", "timestamp": 1713450269781}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: לא בדיוק משעממות אבל גם ממש לא מעניינות.\n\nשעורי הבית: 3 מטלות להגשה שאפשר לסיים ב10 דקות מקסימום, כל מי שמגיש מקבל 100 והן 20% תקף מהציון. בנוסף היא מבקשת כל שבוע לקרוא מאמר אבל אין שום סיבה לעשות את זה.\n\nהמבחן: לא הוגן בעליל, היו הרבה שאלות שהן על דעתה האישית ועל פרטים קטנים ושוליים שהוזכרו פעם אחת. הייתה תחושה שהמבחן בא להכשיל ולא באמת לבדוק ידע בעקרונות המרכזיים של הקורס, שכמעט ולא היו עלהם שאלות.\nאבל מספיקים יום-יומיים של למידה כדי לדעת את כל החומר בעל פה ולהוציא ציון סבבה.\n\nהשיעור האחרון בסמסטר הוא חזרה לקראת המבחן, ובשני השיעורים שלפניו לא מועבר חומר חדש אלא רואים TED talks שהסטודנטים מביאים ומנתחים אותם. זה יתרון די יפה כי יוצא שצריך לדעת למבחן רק חומר של 8 שבועות במקום 12.\n\nהשורה התחתונה: מצד אחד אפשר להוציא ציון סבבה במינימום מאמץ, מצד שני החומר לא מעניין (שלא לומר \"לא נכון\" או \"לא מבוסס על כלום\") והמבחן קטנוני ולא הוגן.", "timestamp": 1713473222322}, {"author": "-", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אורית וולף\nחוות דעת - הרצאות: נרשמתי לקורס הזה כי הוא נשמע לי מעניין, ובאתי בתקווה ללמוד משהו. לצערי זה לא קרה. תוכן ההרצאות לא באמת מעניין ברובו, ואין לו כל כך בסיס לדעתי. לי באופן אישי לא היה ברור מה המטרה של אורית בקורס הזה.\n\nשעורי הבית: שלוש עבודות הגשה שבכלל לא דורשות הרבה זמן. בנוסף, כל שבוע אורית מבקשת שנקרא טקסט אחד או יותר (פרק מספר/ מאמר/ כתבה). חלקם לא קצרים, ואני עשיתי את הטעות של לקרוא ולסכם כל אחד מהם כדי לזכור ולהבין אותם טוב. בפועל זה לא היה רלוונטי בכלל למבחן ואורית פרסמה רשימה מקוצרת של קטעים בודדים שהיא רוצה שנלמד למבחן.\n\nהמבחן: רע. אפשר ללמוד יומיים ולקבל ציון סביר, אבל מעבר לזה, זה הרגיש שזה כבר לא בשליטתינו. אפשר לחרוש שבוע או שבועיים ולקבל את אותו הציון הסביר. הכוונה שלי היא שהמבחן נבנה בצורה כזו שמי שיודע וזוכר את כל הפרטים שלמדנו יוכל לענות יחסית בקלות על85-90% מהמבחן, אבל מעבר לזה זה פשוט לנחש או לנסות להבין מה אורית חשבה כשהיא כתבה את השאלה. חוץ מזה שהיא הייתה זמינה למענה על שאלות רק ממש בתחילת המבחן ואז הלכה, וגם כשהיא הייתה היא ענתה נורא בזלזול. השאלה היחידה בערך שהיא ענתה עליה הייתה שאלה שבטעות כל האפשרויות בה לא היו נכונות, והיא אמרה לכולם איך לתקן אותה. אני אציין שבשביל לעשות את זה היא התחילה לקרוא את המצגת שלה באמצע המבחן כדי לבדוק מה התשובה הנכונה לשאלה. די חסר מקצועיות ואחריות...\n\nהשורה התחתונה: לא מומלץ בכלל. עדיף לנסות להרשם למל\"ג אחר שאולי תלמדו בו משהו באמת.", "timestamp": 1713870506011}]}