{"posts": [{"author": "סטודנטית", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: כל הרצאה יש מרצה\nחוות דעת - הרצאות: כל הרצאה בא יזם שמציג את המצגת ומדבר על מה שעשה וצריך בסיום כל הרצאה להגיש משוב עליה ובכל שיעור מקבלים שיעור בית חדש שצריך לעשות בקבוצות, קיצור מלא מלא השקעה וצריך זמן\n\nשעורי הבית: צריך לחשוב על מיזם לפתח בתחילת הסמסטר בקבוצות ואז בכל שיעור מקבלים תרגיל בית ולדעתי היה מאוווודדדדדד כבד יחסית למל״ג *אל תתקרבו*\n\nהמבחן: אין\n\nהשורה התחתונה: מלא השקעה אל תקחו", "timestamp": 1710972668415}, {"author": "ישראל", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דינה רפאל, רפי נווה\nחוות דעת - הרצאות: \nמחולק לשניים, משהו בלבול מוחי על משהו שיש לו קשר כלשהו ליזמות, והחלק השני נחמד מביאים מרצים אורחים שמספרים את הסיפורים שלהם אבל זה לא מלמד בכלל.\n\nשעורי הבית: \nדורש המון המון (המון) זמן במהלך הסמסטר. צריך לסכם כל הרצאת אורח, בנוסף למטלות אחרות שהם מחלקים.\nהם ניסו לבנות את הקורס ככה שהמטלות לאורך הסמסטר יעזרו עם העבודה שאני מדבר עליה בחלק הבא, לא הצליחו. אולי בסמסטר שלכם יהיה לכם יותר מזל\n\nהמבחן: \nאין מבחן, יש עבודה מסכמת שגם לוקח מלא זמן לעשות אותה, ופרזנטציה.\nאין שום מושג על מה מורידים נקודות ואיך ואיפה ולמה.\n\nהשורה התחתונה: \nלא לקחת את הקורס, דורש המון זמן ובסוף יגרילו לכם ציון בלי קשר להשקעה שלכם או לאיכות של מה שכתבתם. העבודה בקבוצות וממש לא כדאי לכם להיות זה שעשה את כל העבודה וקיבל את הציון הכי נמוך. מניסיון. \nפשוט תקחו מל\"ג נורמלי שלומדים אליו 3-5 שעות פעם אחת ומקבלים ציון כמו שצריך.", "timestamp": 1716452516933}, {"author": "shame", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "קורס בושה.\nלא לומדים כלום על יזמות, ציונים נשלפו מתוך כובע, דורש המון שעות השקעה בזמן הסמסטר. כל מה שמעולם לא רציתם במל\"ג.", "timestamp": 1716453234608}, {"author": "הלורד", "difficultyRank": 4, "generalRank": 1, "semester": "202301", "text": "שם המרצה: משתנה\nחוות דעת - הרצאות: רוב ההרצאות לא מעניינות בכלל ודי רנדומליות. \nכביכול יש חובת נוכחות שנאכפה ע\"י סיכום שיעור ומאחר והיום הקלטות היה אפשר לראות בכמה דקות את ההרצאה (באיכות מזוויעה) ולמלא את הטופס ובכך להימנע מהצורך להיות נוכח בכל הפעמים\n\nהעבודות: מעבר לסיכויי שיעור היה צריך לעבוד כל הסמסטר על רעיון לסטארטאפ או משהו בסגנון בקבוצות. בפועל זה אחד הלא מוגדרים, לא ברור מה צריך לעשות וניכר שהצוות הוא היחיד שלקח את העסק הזה ברצינות. מהסיבה הזו גם הציונים היו נמוכים (ממוצע 88 על יחסית הרבה עבודה) עד שהצוות הבין שזה מלג ופיקטר למעלה (ממוצע 97)\n\nסיכום: הרבה יותר מדי עבודה ותסתכול", "timestamp": 1716554639918}, {"author": "שניר חן", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: משתנה\nחוות דעת - הרצאות: \nלא מסכים בכלל עם שאר הביקורות פה - אני חושב שהקורס היה מעולה למל\"ג לכל מי שמעניין אותו תחום היזמות. \nכל הרצאה בא יזם אחר ממש מוצלח - אנשים שעשו אקזיט, הקימו חברות וכו'. ההרצאות הרגישו כמו הרצאות TED כל אחד הרצה על המיזם ועל סיפורי הצלחה וכישלונות.. מאוד מעניין. \n\nשעורי הבית: \nבתחילת הקורס צריך להתחלק לקבוצות ולחשוב על מיזם. \nבמהלך הקורס יש אחרי כל הרצאה: \n1. לכתוב עליה מחוון. - 5 דק. \n2. לקרוא 2 פרקים באיזה ספר על יזמים שמקימים סטארטאפ (חלקו היה מעניין וחלק לא) \n3. להגיש מטלה שקשורה למה שיש בספר/הרצאה (לא באמת היה חייב לקרוא). \n\nמה שכן הייתה התנהלות לא כזאת מסודרת ומובנת של המשימות גם מבחינת מה לעשות וגם מתי. מקווה שאחרי הפיילוט זה כבר יותר יתייצב. \n\nהמבחן: \nהיה פרויקט סיום שמחולק גם לפיץ' וגם למצגת על המיזם של הפרוקט. למי שבאמת משקיע יקח אולי יום / יומיים גג לסיים.\n\nהשורה התחתונה: לכל מי שמענייו אותו יזמות ממליץ בחום! קורס מאוד מעניין ומעשיר ועם קצת עבודה לדעתי. מי שבא לסמנב פחות.", "timestamp": 1716745668215}, {"author": "לא לקחת את הקורס הזה אם מקווים לציון ששווה להשקעה שלכם", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דינה רפאל\nחוות דעת - הרצאות:  הדבר היחיד המעניין בקורס, כי כל שבוע בא יזם לייצג את המיזם שלו.\n\nשעורי הבית:  אתה יכול להשקיע את המקסימום ולקבל את המינימום, וגם יכול להשקיע את המנימום ולקבל מהשהו באמצע.\n\nהשורה התחתונה: הציונים אקראיים, לכן אם מקווים לציון טוב ביחס להשקעה אל תקחו, יירד לכם ציון בלי לדעת על מה, ולא שווה לכם להשקיע כי אתם יכולים להשקיע בקורס וגם להידפק, וגם אם תנסו לערער זה סיוט, כי יתחילו בלמצוא כל מיני אילוצים, וגם אומרים במפורש שאפשר להוריד ציון על זה...\n\nבקיצור מלג לא ממולץ וזה אחרי נרמול הממוצע והוספת כמה נקודות..", "timestamp": 1716848175854}, {"author": "הקורס הכי נוראי", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: משתנה\nחוות דעת - הרצאות: משעממות ופחות מעניינות\n\nשעורי הבית:  צריכות השקעה רבה, כך שהציונים מוגרלים ללא קשר להשקעה\n\nהשורה התחתונה: המלג הכי נוראי שיש עם ממוצע 88, אל תקחווווווווווווו !!!!", "timestamp": 1716848821404}]}