{"posts": [{"author": "סטודנט מנפגעי הקורס", "difficultyRank": 4, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: משעמם. ממש קשה להכריח את עצמך להקשיב לו יותר מכמה דקות כל פעם.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: חפירההה 20-50 עמודים של משימות קריאה באנגלית גבוהה מ1900 או מוקדם יותר.\n כאשר אתה מקבל ניקוד על משך הזמן שקראת באתר/ הערות שנתת על הטקסט/ קריאה בהמשכים ולא בישיבה אחת וכו וכו.\n\nלא מספיק יש גם עבודות הגשה שצריך לכתוב 500~ מילים על נושא מההרצאות. הממוצע ציונים על העבודות הנל היה באיזור ה75-80.\n\nהמבחן: אין\n\nהשורה התחתונה: אם אתם רוצים מלג שדורש יותר השקעה מקורסים של סמסטר א תהנו\n\nלהתרחק כמו מאש!!", "timestamp": 1673354803566}, {"author": "student", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: Dr. Dustin Lazarovici\nחוות דעת - הרצאות: לא מעניינות, קצת מתבישת ללכת ולשון על השולחן כמו תלמידי תיכון. הוא לא בודק נוכחות שזה משהו טוב \n\nשעורי הבית: \n1. 4 מתוך 5 מסמות כריאה באורך 30 עמודים בערך, הציון ניתן על ידי אלגוריתם שבודק כמה זמן ההשקעה\\מספר שאלות ותגובות\\שאלון עם המטלה\nניתן היה להתגבר על האלגוריתם ולא לקרוא את הכול אבל עדיין לוקח קצת זמן. גם כך אף אחד לא בודק הבנה\n2. 2 מתוך 3 מטלות כתיבה כ 500 מילים, על נושאים קשורים בהרצאות, ניתן היה להיעזר בחומר הקורס אבל אין כלכך הסברים, וגם הנושאים ממש לא מעניינים וקשים ולא מובנים.\nהיא נתן ציונים 70-95 שזה משהו לא טוב, עם קצת השקעה אפשר היה להשיג ציון 90-85\n\nהמבחן: אין\n\nהשורה התחתונה: דורש קצת השקעה, טוב שלא בודק נוכחות אבל יש מה לעשות במהלך הסמסטר.", "timestamp": 1673642783823}, {"author": "סטודנט", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דר. לזרוביץ דסטין \nחוות דעת - הרצאות: ההרצאות היו מעניינות למי שאוהב פיסיקה, אני אישית אהבתי את הנושאים שהועברו. דסטין בקי בחומר. ההרצאות מועברות באנגלית.\n\nשעורי הבית: יש בסה\"כ 5 מטלות קריאה ו- 3 מטלות כתיבה. 4 מטלות הקריאה הטובות ביותר מהווים 50% מהציון הסופי, ו2 מטלות הכתיבה הטובות ביותר מהווים את שאר ה- 50%. אישית לא הרגשתי בהם בסמסטר; הציון במטלות הקריאה נקבע ע\"י רובוט (Perusall) אז מי שמבין איך הוא עובד יכול לקבל 100 בקלות. לגבי מטלות הכתיבה הייתי עושה אותם ביום האחרון-גוגל עזר הרבה. דסטין אוהב את זה שנעזרים במקורות חיצוניים לזה היה (לפי דעתי) חלק טוב מהציון. \n\nהמבחן: אין בחינה YAY :)\n\nהשורה התחתונה: מכיוון וכבר לא מעבירים עוד מלגים עם חציון 100 (אולי נותרו עוד 2-3) הייתי ממליץ על הקורס וגם ממליץ מאוד למי שאוהב פיסיקה. הסמסטר לא הייתה אכיפה על הנוכחות בכיתה אז אם המצב לא ישתנה לדעתי המלג יוגדר כנחשב בסמסטרים הבאים.", "timestamp": 1675860176734}]}