{"posts": [{"author": "לוקריציוס", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אנריקו\nחוות דעת - הרצאות: ההרצאות באנגלית אז מי שקשה לו עם אנגלית פחות. אבל הן מעניינות והוא מנסה לשתף את הסטודנטים כמה שיותר. הוא מדבר בעיקר על 6 ספרים של פילוסוף מסוים והוא מדבר על איך הוא ראה כל מיני דברים בעולם. הנוכחות היא דרך המודל עם סיסמא. הציון מורכב מ50 אחוז מבחן ו50 אחוז 3 משימות קריאה יש גם בונוסים של בחנים שמוסיפים נקודות למשימות קריאה (הבחנים לא חובה) וגם בונוס נוסף של משימת כתיבה על נושא מהקורס. \n\nשעורי הבית: יש 6 קטעי קריאה שמתוכם צריך לקרוא 3 ולהגיב עליהם כמה תגובות שזה ממש קליל. הקטעי קריאה כן קצת ארוכים אבל תכלס לא באמת צריך לקרוא הכל כדי להגיב. \n\nהמבחן: 20 שאלות אמריקאיות שהן די קלות אם הייתי בהרצאה והקשבת המרצה גם מסמן במשימות קריאה על מה הוא ישאל וגם הוא עשה 6 בחנים שהם לא חובה אבל תכלס חלק גדול מהשאלות שהיו שם היו בצורה כזאת או אחרת ואם יש שאלה הוא עונה ממש מהר. והוא החזיר על זה תשובות לפני המבחן. \n\nהשורה התחתונה: המרצה מקסים ממש ושם כדי לסייע בהכל. והקורס באופן כללי ממש מעניין למי שמעניינת אותו פילוסופיה", "timestamp": 1689621104428}, {"author": "ברקוני", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: אנריקו\nחוות דעת - הרצאות: \nלומדים על הספר של הפילוסוף לוקרטיוס \"על טבע היקום\".\nהספר מחולק ל-6 פרקים וכל 2-3 מפגשים מתעמקים בפרק.\nמרצה מאוד לא כריזמטי שמדבר עם מבטא איטלקי דיי כבד.\nגם אם הנושא מאוד מעניין אתכם, לא קל להקשיב.\nאבל, הוא מרצה סופר אכפתי, מתחשב, ובא לקראת הסטודנטים.\n\nשעורי הבית: תקף 50%. על כל פרק בספר נפתחת משימה ב Perusall. צריך לבחור 3 פרקים מתוך ה-6 ולתת הערות על הכתוב בספר. ממש קליל.\nבנוסף מי שרוצה עוד 10% מגן יכול לכתוב עבודה של 500 מילים או לתת \"הרצאה\" לכיתה של 10 דקות. גם כן קליל ממש.\nעוד מגן אופציונלי זה לעשות את הבחנים לדוגמא שלו. \n\nהמבחן: אמריקאי, 20 שאלות. מאוד קלות, 18 מהשאלות שהיו במבחן הופיעו בבחנים לדוגמא שהוא נתן. כדי ללמוד למבחן צריך רק לעבור על המצגות.\n\nהשורה התחתונה: מל\"ג מאוד לא מעניין בציון פצצה!\nלמי שאכפת רק מהציון, יכול להגיע להרצאה ולעשות שיעורי בית במקצועות אחרים... אם אתם רוצים מל\"ג מרתק, פחות...", "timestamp": 1689857896956}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמרצה ממש נחמד אבל חלק מההרצאות היו משעממות ברמה שנלחמתי כדי להישאר ער\n\nהערכה: \nאין מבחן ולכן הציון מתבסס ברובו על מטלות. ראשית צריך לקרוא 2 ספרים של הפילוסוף הרומאי לוקריציוס (סביב 33 עמודים כול אחד) ואז יש בחירה בין עבודה קצרה לבין קריאה של 2 ספרים נוספים. הקריאה היא באתר בשם perusall ושם אפשר להשאיר הערות על הטקסט ולהגיב על הערות של אחרים. האתר בעצם בודק שקראת הכול, לא רפרפת מהר מידי, השארת כמה הערות טובות עם תוכן והאם קיבלת תגובות והערות ממשתמשים אחרים. נשמע די נחמד עד שאתה מוצא את עצמך קורא איזה 5 עמודים ברצף מבלי לכתוב כלום ונכנס ללחץ שזה לא יוריד לך את הציון. הכמות שצריך לקרוא קצת מוגזמת לדעתי. כמעט סיימתי 4 ספרים ומצאתי שהשקעתי כמות זמן שלדעתי ממש מוגזמת בשביל מלג. \nזה גם מאוד ברור שרוב הערות שאנשים כותבים מועתקות ישירות מ-chatGPT ופשוט מתארות מה כתוב בפסקה..\nהמרצה עונה לכול התגובות (איפה שצריך) ומוסיף, מסביר ומתקן וזה מאוד נחמד האמת.\nאני חושב שהמרצה ממש מבין את הבעיות הקורס שכן הוא אמר לא ייקח את הציון כמו שהתוכנה נותנת אלא הוא יתחשב ויעלה ציון אם הוא רואה לנכון.\n\nהשורה התחתונה: \nפילוסופיה רומאית זה שטויות. המרצה ממש נחמד ומבין. כמות השקעה מוגזמת.", "timestamp": 1713176790123}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 2, "semester": "202301", "text": "השורה התחתונה: \nהקורס הכי משעמם שתהיו בו. אין לי בעיה עם פילוסופיה, אבל כאן זה הועבר בצורה כ\"כ משעממת ולא ברורה.\n\nבכללי גם נראה שהבינו ששיטת חלוקת הניקוד לא הייתה טובה ובגלל זה הממוצע המרשים. אז לא הייתי ממהר לקחת כי כנראה זה לא יהיה ככה סמסטר הבא.", "timestamp": 1716451762422}]}