{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: מדבר לעט מאד אבל ההרצאות מעניינות (קורה בזום כי הוא בצרפת). כל הרצאה זה דיון של הסטודנטים בגדול, לא חובה להשתתף, נשאים: היסטוריה של הטכנולוגיה, AI והעתיד שלו, מוסר וזכויות בבינה מלאכוית, דברים כאלה. וגם הכל באנגלית. בלי קשר, הוא אחלה\n\nשעורי הבית: יש מאמר לקריאה בבבית כל שבוע, ממש לא חובה. נתן עבודת בונוס של 10 נק תוספת לציון הסופי שלקח שעה לעשות\n\nהמבחן: מאד קליל, חומר פתוח. הרבה חומר יחסית (באנגלית) אבל אם עברתם בקטנה היה מאד אפשרי להצליח\n\nהשורה התחתונה: מאד מעניין, הכל באנגלית", "timestamp": 1626356228473}, {"author": "לייבניץ", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: ג'סטין סמית\nחוות דעת - הרצאות: *כל הקורס באנגלית* \nבהרצאות ג'סטין מדבר על המאמר שנתן לקרוא בשבוע שעבר, מסביר ומוסיף מהחויה שלו. הנושאים היו בגדול \"מה זה טכנולוגיה\", השפעות הטכנולוגיה על האדם, סוגיות פילוסופיות שונות ב-AI ובמחשבים בעלי מודעות. לטעמי הוא מדבר קצת לאט ומונוטוני, אבל מאוד שמח לערב סטודנטים בשיחה ולהתדיין על דברים קצת מחוץ לתוכנית. הוא גם מאוד פתוח לשינויים - ביקש משוב באמצע סמסטר וניכר שהשתדל לפעול לפי ההצעות. סה\"כ הרצאות בסדר, אחלה ג'סטין.\n\nשעורי הבית: \nלקרוא מאמר אחד (באנגלית) בשבוע. בהתחלה נתן מאמרים ארוכים יחסית (עשרות עמודים) אך לאחר שביקשנו הפנה אותנו למאמרים קצרים (1-5 עמודים) ונגישים יותר. לא חובה כדי להשתתף בשיעורים אבל מומלץ, גם בשביל הכנה למבחן.\n\nהמבחן: \nלנו היה מבחן אמריקאי עם חומר פתוח. חלק מהשאלות פשוטות ודיברנו עליהן בכיתה, חלק קטנוניות ממש על איזו פינה אקראית באחד המאמרים. מזל שהחומר פתוח, אפשר לחפש. סה\"כ לא קשה, אבל דורש לקרוא אותם מראש. \nהייתה גם עבודת בונוס קלילה וקצרה עבור +10 לציון סופי.\n\nהשורה התחתונה: \nנהניתי מהמאמרים וההרצאות, חומר מעניין מאוד אם אתם מתעניינים במדע בדיוני וטכנולוגיה בכללי. מל\"ג מעניין אבל לא 100 קל, דורש קצת למידה, ושווה את זה. 100 אפשרי ומשתלם.", "timestamp": 1628155206081}, {"author": "לייבניץ", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ג'סטין סמית'\nחוות דעת - הרצאות: \nרע מאוד, אי אפשר לעקוב אחרי מה שהוא אומר, מעבר לזה שהוא אומר כנראה הרבה שטויות ולא זוכר מה הוא אמר או לימד\n\nשעורי הבית: לקרוא מאמר כל שבוע\n\nהמבחן: אמריקאי. הוא נותן מאגר שאלות פתוחות שקשורות למבחן אבל משנה אותן לגמרי ומפתיע עם שאלות אחרות בכלל\n\nהשורה התחתונה: להתרחק מהקורס לא לקחת לא משנה מה", "timestamp": 1644057738738}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: גסטין\nחוות דעת - הרצאות: הרצאות די מיותרות ומשעממות. מתנהלות כמו דיון, מאוד מונוטוני והרבה פעמים לא רלוונטי לחומר למבחן. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nלקרוא מאמר כל שבוע. חלקם ממש באורך סביר אפילו קצרים. חלקם לא הגיוניים. להיות בקיאים במאמרים במהלך הסמסטר יחסוך הרבה זמן בהתכוננות למבחן\nהמבחן: \nפרסם 40 שאלות ומתוכם בנה את המבחן. השאלות פתוחות אבל במבחן אמריקאיות לכן יש טיפה שוני אבל ממש בקטנה. המבחן עם חומר פתוח ללא הגבלה אז הבאנו את השאלות פתורות פשוט. היו מתוך 30 איזה 4-5 שאלות שלא ממש כוסו בשאלות הכנה. \nהשורה התחתונה: קורס מעניין. המאמרים מגניבים ובעיקר מה שטוב בקורס שהוא מפנה אותך למקורות האלה שלבד יותר קשה למצוא אותם. פותח את הראש. הקורס לא מיועד למי שרוצה מלג ללא השקעה עם ממוצע 100. אבל עם קצת השקעה ממש קל לקבל 90+. יש אפילו עבודת בונוס קלילה של +10 לציון הסופי.", "timestamp": 1644139156774}, {"author": "יהיה בסדר", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: ג’סטין \nחוות דעת - הרצאות: החומר עצמו די מעניין, אבל ההרצאות מתנהלות בזום, וממש קשה להיות איתו. בכל מקרה, זה לא ממש רלוונטי לבחינה הסופית. \n\nשעורי הבית: \nלקרוא מאמר אחד כל שבוע. אבל שוב זה לא באמת קריטי. קראתי אולי שניים.\n\nהמבחן: \nחומר פתוח ובנוי ברובו משאלות שגסטין נותן מראש. כן היו כמה הפתעות.\n\nהשורה התחתונה: אחלה לגמרי. כן צריך טיפה ללמוד בשביל להשיג את ה90, אבל לא משהו קשה מידי לדעתי. בנוסף יש עבודת בונוס די קלילה שמקנה 10 נק לציון הסופי.", "timestamp": 1644178358794}, {"author": "אנונ'", "difficultyRank": 2, "generalRank": 1, "semester": "202101", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: \nגרוע, מדבר בצורה בלתי נסבלת שאי אפשר בכלל להקשיב למה שהוא אומר.\nהוא קופץ בין נושאים ולא ברור מה מהדברים שהוא אומר רלוונטים לחומר ומה לא. בכלל הוא עושה מה שהוא רוצה ואין בדיוק חומר מוגדר.\nהשיא היה שהוא נתן לנו רשימה של שאלות ואמר שהשאלות במבחן יילקחו מהרשימה הזו. ובפועל היו במבחן שאלות לא קשורות.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nמבחן עם חומר פתוח, 30 שאלות אמריקאיות, רובן קלות, אבל יש כמות מכובדת של שאלות קשות עד בלתי הגיוניות.\nהשורה התחתונה: לא מומלץ בכלל", "timestamp": 1644369342470}, {"author": "Eran Tzoref", "difficultyRank": 1, "generalRank": 3, "semester": "202101", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: \nהרצאות משעממות מאוד, לא הצלחתי להתרכז ליותר משתי דקות ברצף. לרוב ג'סטין מדבר איזה 40 דקות על סתם דברים רנדומאלים ואחר כך עוברים לדבר על איזשהו מאמר שהיינו אמורים לקרוא בבית. עם זאת ההרצאות הן בזום ואפשר  לפתוח אותו ברקע בזמן שעושים דברים אחרים\n\nשעורי הבית: \nיש מאמר לקריאה כל שבוע לפני השיעור (באורך משתנה של 2-10 עמודים בערך). בפועל לא באמת צריך לקרוא אותם ואני (כמו 90 אחוז מהקורס לדעתי) נתקלתי במאמרים בפעם הראשונה לפני המבחן\n\nהמבחן: \nהמבחן עם כמה חומר פתוח שרוצים להביא, בנוסף ג'סטין שלח מראש רשימה של 40-45 שאלות שיהיו במבחן. בפועל הוא התהפך עלינו ונתן במבחן איזה 5 שאלות לא קשורות לכלום שלא היו בשאלות שנתן מראש, וגם אחרי שקראתי את המאמרים בזמן המבחן 5 פעמים לא הצלחתי לענות על השאלות כי הן לא היו קשורות בשום צורה לחומר והוא סתם המציא מושגים\n\nהשורה התחתונה: \nמומלץ בשביל מי שמוכן להתפשר על ציון שהוא לא 100 אבל גם לא יפול מה90 תמורת אפס השקעה במהלך גם במהלך הסמסטר וגם בלמידה למבחן.\n\nהערה : הייתה עבודת בונוס שמגישים לג'סטין אחרי המבחן מי שרוצה בשביל 10 נקודות בונוס. בפועל הוא שוב התהפך עלינו ולא נתן כמעט לאף אחד 10 נקודות אלא במקסימום 5 (לא ברור אם זאת הוראה מלמעלה או שעשה את זה על דעת עצמו...)", "timestamp": 1644594123370}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202101", "text": "שם המרצה: גסטין (קורס באנגלית בזום שעה וחצי נטו בשבוע)\nחוות דעת - הרצאות: ברוב ההרצאות אני השתעממתי, היו קטעים מעניינים מידי פעם שפתחו קצת את הראש.\nאני הרגשתי שהרבה פעמים גסטין קצת זורק - לא עונה למיילים, מזיז את ההרצאה כל פעם (שם את ההפסקה בהתחלה/ בסוף)\n\nשעורי הבית: מאמר לקרוא פעם בשבוע באנגלית ברמה די גבוהה ולא תמיד הכי מובנים. בפועל לא חייב לקרוא אבל כדאי כדי להיות מחוברים לקראת המבחן.\n\nהמבחן: 30 אמריקאיות עם חומר פתוח. שאלות לכאורה ממאגר (כ-50 שאלות), בפועל היו גם שאלות לא מהמאגר. ממליץ מאוד להדפיס את כל המאמרים. חלק מהשאלות לא ידעתי ופשוט קראתי כמעט את כל המאמר עד שמצאתי את התשובה.\n\nהשורה התחתונה: קורס שיכול לעניין חלק וחלק פחות. אני ציפיתי שיהיה יותר מעניין. מבחינת המבחן לצערי הממוצע (אחרי עבודת בונוס של עד 10 נקודות שלוקחת כמה שעות בודדות כתלות ביכולות כתיבה באנגלית. חשוב לציין שבפועל הרוב קיבלו רק 5 נקודות, לא ברור למה). היה לא כזה גבוה. קורס סבבה למי שצריך קורס אנגלית או למי שמתעניין בתחום (הקורס לעיתים מאוד פילוסופי).", "timestamp": 1645396646495}, {"author": "לי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: ג'סטין\n\nהשורה התחתונה בהתחלה:\nג'סטין גר בחו\"ל אז ההרצאות בזום, הוא בדר\"כ מעביר רק שעה וחצי. ההרצאות כוללות אותו מדבר על מה שמעניין אותו בנוגע לבינה מלאכותית והשפעת הטכנולוגיה על האנושות. \n\nבמבחן הוא שואל 30 שאלות אמריקאיות על מאמרים שהיינו אמורים לקרוא בסמסטר (אף אחד לא קורא וזה בסדר). 10 מתוכן זה לזהות מאיזה מאמר הציטוט, כשהציטוט הוא בדר\"כ הפסקה הראשונה/השניה/השלישית במאמר. אח\"כ עוד 20 שאלות אמריקאיות שמספיק לקרוא סיכום משנה שעברה בשביל לדעת לענות עליהן. יש עוד כמה שאלות בודדות שלא ברור מאיפה הוא הביא אותן אבל עם קצת היגיון אפשר לפסול תשובות הזויות.\n\n*אגב, יש חומר פתוח אז כולם מדפיסים את המאמרים וממרקרים את המשפטים החשובים ב2-3 העמודים הראשונים. \n\n**הוא שולח לפני המבחן 45 שאלות שמתוכן הוא יבחר את השאלות למבחן, הוא לא מעתיק אותן אחד לאחד אבל הן באותה הרוח, ככה שאין הפתעות. יותר מזה, הוא לא מרבה לשאול על מה שהוא הרחיב עליו בהרצאות והמבחן בעיקר מה שכתוב במאמרים עצמם.\n\n***במועד ב היו שאלות כמו: אתה חושב שבינה מלאכותית יכולה להיות מודעת? כשהתשובות הן: בטוח שלא, בטוח שכן, אולי, ולא יודע. ביקשנו הבהרה מה הוא רוצה שנענה, והתשובה שקיבלנו היא שזו שאלת מתנה ולענות מה שנרצה וזה יתקבל... הבנתם את הסגנון\n\n****ג'סטין מדבר אנגלית, המאמרים באנגלית, המבחן באנגלית.\n\nשורה תחתונה בסוף: לא דורש הרבה, הסטודנטים מסכמים אחלה את המאמרים ומשתפים את החומר לפני הבחינה.", "timestamp": 1645716450430}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: גסטין\nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: שאלות אמריקאיות בלבד כאשר 10 מתוך 30 זה זיהוי טקסטים ממאמרים. המרצה אמר להתרכז למבחן במאמרים בלבד, כאשר לפחות 5 שאלות היו על דברים שהוא אמר בכיתה ולא היו במאמר (ההרצאות היו בזום בלי נוכחות חובה אז כמעט אף אחד לא ידע לענות). לא דואג לפרסם ציונים בזמן.\n\nהשורה התחתונה: כנראה שהקורס לא שווה את הנוכחות לא חובה והזום כי היה צריך לחרוש על 12 מאמרים של 20 עמודים באנגלית למבחן ובסוף גם זה לא היה שווה את המאמץ כי היו שאלות לא מהמאמרים.", "timestamp": 1657524141671}, {"author": "Sami Abboud", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ג'סטין\n\nלא ראיתי אף הרצאה ולמדתי יום אחד את סיכום הקורס\nהבחינה הייתה מזעזעת.\nבעבר המבחן היה עם חומר פתוח אבל הסמסטר נתן לנו להכניס 4 דפים. ראיתי אנשים שיצאו תוך 20 דקות ובינתיים אני יושב עושה אנדנדינו.\n\nהמבחן: \nלא משוחזר וקשה למי שרוצה ללמוד יום יומיים ולגשת\nהשורה התחתונה: \nהקורס מומלץ רק אם אתם עקביים לאורך כל הסמסטר", "timestamp": 1657524585190}, {"author": "amir alkalay", "difficultyRank": 1, "generalRank": 1, "semester": "202102", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: לא מעניין בשום צורה. אין חובת נוכחות, שלא יטעה אותכם!!!!!!!!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: זוועת עולם\n\nהשורה התחתונה: הבטיחו לנו חומר פתוח מה זה שני דפים ג'סטיןןןןןןןןןןןןןןןןןןןןןןןןןןןןןןןן עקצת אותנווווווווווווווווווו\nחומר לא מעניין אפילו את המתים ומבחן שבא לדפוק חזק\nלהתרחק מהקורס רחוק כמה שאפשר ולהשתדל לא לשאול שאלות פילוסופיות בנוגע למחשבים כי יש מצב שנגיע למצב של סינגולרטי וכולנו יודעים מה יהיה השלב הבא, כמובן אחרי הלמידה של המחשבים מגיע שלב הרבייה שלהם, וכולנו יודעים מה חושבת שיינדל בנוגע לזה.\nקיצר קורס מגעיל לא לקחת תודה ויום טוב", "timestamp": 1657526057622}, {"author": "ANM", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: \nמרצה קצת תלוש מהמציאות ומאד משעמם. בדרך כלל ינסה להעביר את רוב ההרצאה בשיחות חולין ואדמיניסטרציה.\nהיתרון הגדול זה שהוא מתגורר בפריז ולכן ההרצאות בזום ואין נוכחות חובה.\n\nשעורי הבית: צריך לקרוא בכל שבוע מאמרים של כמה עמודים באנגלית שעליהם גם בסוף המבחן. אין חובה לקרוא כמובן. המאמרים מאד משעממים ומתארים פילוסופיות הזויות בנוגע להשפעה של הטכנולוגיה.\n\nהמבחן: אמריקאי, היו 4-5 שאלות שהוא לא דיבר עליהן בכלל או הזכיר במשפט וכמעט כולם טעו. הממוצע מדבר בעד עצמו. הוא נתן אופציה להגיש עבודה ולקבל 5-10 נק בונוס שכמעט אף אחד לא הגיש בגלל העומס בסוף סמסטר.\nבנוסף הציונים הגיעו רק אחרי כמעט 3 שבועות בגלל פשלה של הומניסטים.\n\nהשורה התחתונה: מלג שמאפשר לזרוק כל הסמסטר וללמוד בערך יומיים למבחן ולהוציא ציון סביר אבל הרוב לא יעברו את ה90. מבחינת עניין הוא מאד משעמם ולכן בסך הכל אני לא ממליץ.", "timestamp": 1657625816013}, {"author": "הליקופטר", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: החומר לדעתי מעניין, אבל צורת העברה היא פשוט דיון פתוח ומפוזר. הכל באוויר, בלי לוח או מצגת, ובאנגלית. בסופו של דבר לא התחברתי להרצאות רוב המוחלט של הסמסטר.\n\nשעורי הבית: יש עבודת בונוס של 5-10 נקודות של לכתוב מאמר קצר (2-3 דפים) בנושא של אחד המאמרים שלמדנו. לא קשה, מומלץ לעשות.\n\nהמבחן: 30 אמריקאיות, כשהחלוקה היא פחות או יותר 15 שאלות שישר אפשר לשלוף מהחומר עזר(4 דפים, אבל עם יכולות סיכום טובות וכתב קטן זה הרבה). עוד איזה 7 - 10 שאלות שאם קראתם סיכום טוב והבנתם פחות או יותר את המאמרים אפשר לענות מהגיון וכל השאר זה ניחוש כמו בדאבל לוטו עם שאלות אמריקאיות ש3 מתוך 4 התשובות זה מילים באנגלית שלא הכרתי בכלל.\n\nהשורה התחתונה: נושאים פילוספים מעניינים(קצת רפטטיביים במיוחד במאמרים על AI שמרגישים אותו דבר), העברה חלשה מאוד(למרות שהמרצה נחמד). אפשר לקחת וללמוד יומיים לפני המבחן ועם חומר עזר טוב והגיון בריא להוציא מעל 90 עם העבודת בונוס. (על אף שנראה שהממוצע הוא פחות מ90).", "timestamp": 1657628998186}, {"author": "-", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ג'סטין\nחוות דעת - הרצאות: מועבר באנגלית בזום, אין בדיקת נוכחות. הייתי פעם אחת ל- 10 דקות ומאז לא הגעתי לאף הרצאה. מפתיע כל פעם מחדש לראות כמה מרצה מסוגל לדבר על דברים כל כך משעממים ולהיות כל כך נלהב מהם בו זמנית\n\nהמבחן: אמריקאי לא קשה במיוחד. עם יומיים למידה אפשר לקבל 90+ בקלות\n\nהשורה התחתונה: משעמם להחריד אבל קליל", "timestamp": 1661013920089}, {"author": "George", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: ג'סטין\nמשעמם ואין לו כוח או זמן להתעסק עם עבודות אדמיניסטריביות: לא עונה למיילים בזמן סביר, אומר שחומר כלשהו לא יבוא במבחן ואז מביא שאלה עליו ועוד כל מיני דברים שגורמים לי לא להעריך אותו.\n\nשעורי הבית: אין\n\nהמבחן: אם אין לכם זיכרון מצויין ויש לכם יכולת וזמן לקרוא 8 מאמרים מאוד ארוכים אז המבחן לא כזה בעייתי, אחרת אל תתקרבו\n\nהשורה התחתונה: לא מומלץ בכלל", "timestamp": 1667642513319}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 1, "semester": "202202", "text": "שם המרצה: גסטין\nחוות דעת - הרצאות: מעופף ברמות, אבל לא היה חייב לעלות להרצאות\nאין מבחן יש עבודה והיא מייגעת והציונים בה לא כל כך טובים (ממוצע 91 בערך) במיוחד ביחס לעבודה שהיה צריך להשקיע בה ובזה שהוא ניסה לפתוח לנו אותה להגשה תוך כדי התקופת מבחנים. במהלך הסמסטר הוא לא עמוס בכלל אבל העבודת הגשה מעיקה, הבנתי מחברה שבסמסטר אחרי הוא השיג מראש אישור לתת להם את העבודה בתקופת מבחנים, אז תוודאו מראש מתי ההגשה של העבודה ומתי הוא מתכנן לתת לכם אותה\n\nשורה תחתונה: לא מומלץ, אבל סגר לי את התקנת אנגלית אז אזרום עם זה", "timestamp": 1717010877560}]}