{"posts": [{"author": "-", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ואסל\nחוות דעת - הרצאות: המרצה מחו\"ל לכן רוב ההרצאות היו בזום ורק 3 מהן היו פרונטליות בטכניון. היינו צריכים לקרוא טקסטים שמסכמים את מה שהוא הולך ללמד בהרצאה לפני ההרצאה עצמה(הוא לא בודק), ואז במהלכה הוא היה מרחיב על מה שקראנו. האמת שקטעי הקריאה הרגישו לי קצת מיותרים כי הוא די פשוט חזר על מה שקראנו בהרצאה עצמה. המרצה מאוד נחמד ומתחשב בסטודנטים. בגלל שהוא לא הכיר את העומס שסטודנטים חווים בטכניון הוא בא לטובתנו והקל על העומס כשהיינו צריכים. חובה להגיע ל -80% מההרצאות כלומר אפשר לפספס 2 הרצאות במהלך הסמסטר.\n\nשעורי הבית: פעם בשבועיים מטלת כתיבה להגשה על נושא כלשהו שלמדנו. היה צריך להגיש 3 מטלות לבחירה מתוך 5. המטלות היו בעיניי מאוד מעניינות אבל אם אתם לא מאוד משופשפים בכתיבה באנגלית הן יכולות להיות לא הכי פשוטות. הוא מפרסם מחוון מסודר של על מה מקבלים נקודות במטלות אז זה ממש עוזר. \n\nהמבחן: אין מבחן יש פרויקט. היינו צריכים לבחור נושא כלשהו שקשור לטכנולוגיות חדשניות ולכתוב עליו סוג של מאמר דעה של 1500 מילים(2000 מילים אם עובדים בזוגות). בהרצאה האחרונה הוא ערך סוג של \"פאנל מומחים\" מחולק לפי הנושאים שבחרנו ושאל כל מיני שאלות. היה דיון מאוד מעניין :)\n\nהשורה התחתונה: חייבת להגיד שהקורס היה יותר פילוסופי ממה שציפיתי אז ההרצאות לא תמיד היו לי הכי מעניינות אבל בסך הכל מאוד נהניתי ממטלות הכתיבה והפרויקט. בשביל מל\"ג - יחסית עמוס.", "timestamp": 1657205959320}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: וסל\nחוות דעת - הרצאות: ארוכות ומעייפות. בתחילת כל הרצאה כותבים בזום את המספר זהות, ואז אפשר לא באמת להקשיב להרצאה. וסל ממש בן אדם נחמד ורואים שהוא מתאמץ ומשקיע!\n\nשעורי הבית: ארוכים ביחס למל\"ג. בכל שבועיים כותבים בערך עמוד על נושא מסוים באנגלית וזה תקף.\n\nהמבחן: אין. צריך לכתוב מאמר של 1500 מילים באנגלית ואז לדבר עליו בפני כל הכיתה.\n\nהשורה התחתונה: קורס מעייף, לדעתי גם משעמם. עמוס ביחס למל\"ג. אפשר להוציא ציון גבוה מבלי להקשיב להרצאות אם אתם טובים בכתיבה. ממליצה רק אם אתם טובים בהומניים וצריכים את הנק\"ז.", "timestamp": 1660544909581}, {"author": "~", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: ווסל ראיירס\nחוות דעת - הרצאות: מרצה מקסים ומתחשב. מאוד משקיע בהרצאות, כותב מאמרים לקראת השיעורים ובאמת אכפת לו מהסטודנטים וממה שהוא מלמד. רוב הקורס בזום אז אחרי שכותבים תז לא חייבים להיות על, ואין קשר ממש חזק בין ההרצאות לפרוייקט הסופי. מה שכן, הוא לא כל כך מבין את המבנה של הטכניון, העומסים ואיך עובדים מל״גים אצלנו אז המל״ג עמוס בפער מאחרים והציונים לא בשמיים.\n\nשעורי הבית: פעם בשבועיים מגישים קטע כתיבה, צריך להגיש 3 מתוך 5. לא מאוד מעניין וגוזל הרבה זמן. עדיף להצליח באלו של תחילת הסמסטר כדי להוריד עומס לסוף וזה 30% מהציון.\n\nהמבחן: אין. אבל מגישים מאמר של 1500 מילים, שעם קצת עבודה עליו וניסוח כמו שצריך אפשר להוציא ציון גבוה וזה 50% מהציון. \n\nהשורה התחתונה: מרצה קשוב לסטודנטים ומקבלים 20 נקודות רק על עצם הנוכחות, אבל הרבה השקעה יחסית למל״ג.", "timestamp": 1660578596357}, {"author": "Yaniv Slor Futterman", "difficultyRank": 2, "generalRank": 2, "semester": "202202", "text": "שם המרצה: ווסל\nחוות דעת - הרצאות: \nווסל בחור מאוד נחמד, אבל מרצה קצת משמעם. רוב השיעורים בזום. פעם ב הוא מגיע לארץ וזה מאוד כיף. אלו היו השיעורים הכי כיפיים, מומלץ להגיע אליהם. מה גם שחלק מהציון זה על נוכחות בשיעורים אז מומלץ להגיע לשיעורים הפיזיים ולנכוח לפחות בחלק משיעורים הזום כדי שיכיר אתכם.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: כמה קטעי כתיבה. סך הכל לא קשה מידי. לא מומלץ לכתוב עם CHAT PGT. יש לו כלים לעלות על זה, וזה לפעמים דווקא מפריע בכתיבה כי צריך לדאוג להתייחס בחיבורים לדברים שנאמרו בכיתה.\n\n\nהמבחן: אין\n\nהשורה התחתונה: מלג חמוד. לצערי לא היה מאוד מעניין, אבל היה יחסית קל. במקום מבחן זה כתיבת כמה מאמרים. טיפלה עמוס, אבל לא באמת כזה הרבה עבודה בדיעבד. אפשר גם לכתוב בזוגות אם רוצים", "timestamp": 1689772055908}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ווסל\nחוות דעת - הרצאות: ההרצאות ברובן בזום. היו 3 הרצאות פרונטליות. בשעה הראשונה ווסל מסביר על גישות ועקרונות באתיקה, טכנולוגיות שמעלות סוגיות אתיות בעייתיות וכו'. בחלק השני לרוב מתחלקים לקבוצות קטנות ויש איזשהי משימה או תרגיל שצריך לחשוב עליו כקבוצה.\n\nשעורי הבית: היו במהלך הסמסטר 2 מטלות כתיבה (כמה שעות עבודה כל אחת) ומטלת סיום גדולה יותר במקום מבחן. מטלת הסיום היא כתיבה של מאמר דעה (1500 מילים) על סוגיה אתית. צריך לכתוב pitch על הנושא יחסית בתחילת הסמסטר.\n\nהמבחן: אין\n\nהשורה התחתונה: היקף העבודות יכול להרתיע, אבל לדעתי העבודה על כל אחת מהמטלות במהלך הסמסטר מסתכמת ב-לא יותר מחצי יום אם אתם ממש משקיעים. המטלה הסופית קצת יותר ארוכה אבל ווסל התחשב ואפשר להגיש בתקופת המבחנים. לדעתי השקעה של בערך יום עבודה. כדאי לקחת קצת זמן מראש כדי לגבש את המבנה והרעיונות שרוצים להעביר, לאסוף מקורות וכו' אחרת זה יכול לקחת קצת יותר זמן. סך הכל מל\"ג מומלץ למי שמסתדר עם כתיבה, וסוגר קורס אחד באנגלית. למי שמאוד לא אוהב לכתוב לא הייתי ממליצה.", "timestamp": 1692181750835}, {"author": "AAA", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  הישאם אלחלים\nחוות דעת - הרצאות: אני אהבתי, אפשר להשתתף מתי שמעניין ולעשות ש.ב של מקצועות אחרים ביינתים, הוא לא בדק נוכחות.\nשעורי הבית: \n3 מטלות לאורך הסמסטר בהיקף של שעה בערך כל אחת\nהמבחן: \nלערוך סרטון של חצי דקה עד דקה- סבבה תעשו משהו מגניב תקבלו ציון גבוה\nהשורה התחתונה:  מלג לא דורש הרבה בכלל ואפשר מאוד להוציא ציון גבוה .", "timestamp": 1714474883930}, {"author": "E", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דר. עבד אלחלים הישאם\nחוות דעת - הרצאות: פשוט היה שיח על אתיקה בשיעור (בינו לכיתה אחרי שהוא דיבר על עניינים אתיים בתעשייה) לא עניין אותי במיוחד. אבל לא נראה לי כתב נוכחות.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: חצי עמוד בשבועה (וגם אז לא תמיד)\n\nהמבחן: אין. היה צריך רק להכין סרטון (דקה בערך) על איזהשהו ערך אתי (לפחות בסמסטר שלנו), אבל באמת לא משהו שצריך להיות מאוד מושקע.\n\nהשורה התחתונה: מומלץ למי שמחפש משהו קל, ציון טוב, בלי מבחן וזה גם קורס אנגלית נראה לי.", "timestamp": 1717579468364}]}