{"posts": [{"author": "אנונימי", "difficultyRank": 1, "generalRank": 3, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: דסטין\n\nשעורי הבית: \nאין שיעורי בית.\n\nהמבחן: \nאין מבחן אבל צריך להגיש עבודה במקום. בהתחלה עשה רושם שדסטין יחלק ציונים יחסית גבוהים בצורה יחסית קלילה, והקורס להבנתי תופס בתור קורסי החובה שהחל מ-2021 צריך לעשות באנגלית אבל לאחר הגשת טיוטות כבר לא ברור לי האם באמת יהיה ציון מפרגן.\n\nהשורה התחתונה: \nלא ברור עדיין אם מל״ג שווה, השקעה אפסית השאלה איך יהיו הציונים של העבודות", "timestamp": 1656699648875}, {"author": "MalagMumltz", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: \nהפסקתי לבוא איפשהו באמצע הסמסטר מחוסר עניין. ממש רציתי שהקורס יהיה מעניין אבל דסטין לא כריזמתי, ובהרצאות הראשונות דיבר הרבה על דברים די בסיסיים (כך שאם התעניינת טיפה בנושא בעבר סביר להניח שאת הדברים המעניינים באמת שהוא מציג כבר ראית ביוטיוב).\n\nשעורי הבית: אין\n\nהמבחן: אין\nבמקום מבחן יש מאמר להגשה בקבוצות (כל חבר קבוצה אמור לכתוב 1000 מילים לפחות). 20% מהציון הוא על תכנון מאמר (תכנון מקדים בסדר גודל של דף) ו-80% על המאמר עצמו. לא דורש יותר מדי השקעה והציונים מדברים בעד עצמם.\n\nהשורה התחתונה: מומלץ(?)", "timestamp": 1659696758128}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: דסטין\n\nהמבחן: אין\n\nהשורה התחתונה:\n- לא בדק נוכחות. אמר שאנחנו בוגרים והוא לא רודף אחרינו ושכל עוד שהכיתה לא ריקה לא מעניין אותו מי מגיע\n- הרצאות באנגלית ומשעממות. אבל הוא מנותק, כל מי שמגיע ישוב ועושה תרגילים והוא ממלמל לעצמו שם מקדימה וכולם מרוצים.\n- לא עשה לנו מבחן, אלא לכתוב מאמר בקבוצות, 1000 מילים לכל חבר קבוצה (עד 5 אנשים). הוא קצת פדנטי אם הביבליוגרפיה וציטוטים בצורה נכונה וזה לקמ זמן, אבל הוא בדק נחמד וציונים סבירחם.\n- במהלך הסמסטר היו מטלות קריאה אופציונליות שכל אחד נתן 2 נקודות בונוס לציון הסופי. מאמרי פילוסופיה כבדים, קוראים בתוכנה perusall שמחליט אם קראת או לא ע\"י הקצב מעבר בין עמודים וכמה את מגיב למאמר. אבל לא חובה", "timestamp": 1667386880540}, {"author": "נימי האנונימי", "difficultyRank": 3, "generalRank": 2, "semester": "202202", "text": "שם המרצה: דסטין לזרוביץ'\nחוות דעת - הרצאות: שעמום מוחלט, דסטין מדבר לעצמו, בצורה לא מעניינת ונראה שהוא לא בטוח מה הוא רוצה להגיד בכלל. החומר בסיסי ברמה מחרידה, גם סטודנטים של סמסטר ראשון ידעו את החומר של כל הסמסטר ולא יחודש להם כלום.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין\n\nשעורי הבית: מטלות קריאה בפרוסל, דברים לא מעניינים- ומקבלים ציון על זמן שהמטלה פתוחה כמו גם על תגובות שלך ותגובות של אחרים אליך, כאב ראש נוראי.\n\nהמבחן: אין, יש עבודה\n\nהשורה התחתונה: תעשו לעצמכם טובה ותיקחו קורס ספורט במקום", "timestamp": 1686053916702}, {"author": "אפסילון", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "חוות דעת - הרצאות: \nלסטודנטים למתמטיקה ובכלל למי שאוהב את התחום - הרצאות מרתקות, במיוחד מאמצע הסמסטר והלאה. מאוד מעשיר, רואים שדסטין יודע המון, ולטעמי הוא מעביר את זה בצורה מאוד מעניינת.\nלמי שלא מתעניין במתמטיקה מעבר לחובה הנדרשת, ואין לו רקע (מינימלי לפחות) בזה, פחות מומלץ. מן הסתם אין קדמים ודרישות אבל יש חלקים שמרגישים כמו הרצאות בפקולטה למתמטיקה.\n\nשעורי הבית: \nמטלות קריאה קצת כבדות, עבודת סיום שתלויה בכמה משקיעים בה אבל יכולה לקחת לא מעט זמן (בקבוצות, 1000~ מילים באנגלית כל אחד על נושא מהקורס). מצד שני, אין מבחן.\n\nהשורה התחתונה:\nמומלץ למי שבקטע", "timestamp": 1688469591916}, {"author": "Lior Katz", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: \nאין נוכחות חובה, אז הייתי רק בהרצאה או שתיים הראשונות ואז הפסקתי להגיע. מבחינת הנושאים של הקורס הם בעצמם די מעניינים אם אוהבים פילוסופיה, אבל לשמוע הרצאה של שעתיים אליהם זה קצת יותר מדי בשבילי. דסטין עצמו מדבר בצורה קצת יבשה אבל בכל זאת מרצה סבבה.\n\nשעורי הבית: \nיש בערך 5 משימות קריאה וה-3 הכי טובות נכנסות לציון (40 אחוז) בשונה מסמסטרים קודמים שבהם זה היה אופציונלי והביא בונוס. הראשונה הייתה בערך 30 עמודים והאחרות היו יותר בין 10 -15. התוכנה שקוראים בה עוקבת אחרי כמות הזמן שאתם נמצאים בעמוד ואחרי הקצב קריאה שלכם ועל זה מתבסס הציון, וצריך בכל משימה לכתוב 4 תגובות על קטעים במאמר. המשימות לא דורשות מלא השקעה אבל זה די מבאס לשבת שעה או יותר ולקרוא פילוסופיה.\n\nהמבחן: \nבמקום מבחן יש עבודה בקבוצות שכל אחד צריך לכתוב 1000 מילים (יוצא בערך 15 עמודים בסך הכל). המשימה לא פשוטה, ישבתי עליה יום שלם בערך אבל בסוף קיבלנו ציון טוב.\n\nהשורה התחתונה: \nהמשימה בסוף קצת כבדה, אבל זה שאין מבחן ואין נוכחות חובה מכפר על זה לדעתי. אם אתם שונאים פילוסופיה ושונאים לכתוב באנגלית לא הייתי ממליץ, אבל מלג די סביר.", "timestamp": 1689754758679}, {"author": "ג'פטו", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דסטין לזרוביץ'\nחוות דעת - הרצאות: לא הגעתי להרצאה אחת\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: \nיש 5 מטלות קריאה שמתוכן צריך לעשות 3. מקבלים 100 אם עושים 4 תגובות ונותנים לייק או שניים.\nהמבחן: \nיש במקום עבודה מייגעת שבה כל חבר קבוצה צריך לכתוב 1000 מילים. לא גרוע כמו להיות במלג שאשכרה דורש משהו אבל עדיין די מעיק.\nהשורה התחתונה: \nמלג סביר, שווה את זה בעיקר כי אפשר לשים פס רוב הסמסטר וגם מועבר באנגלית.", "timestamp": 1689758990840}, {"author": "NONE", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: \nמהביקורות והציונים נתן רושם של מלג טוב, ממוצע וחציון גבוהים, לא הרבה מאמץ וקורס באנגלית (צריך 2 לתואר...)\n\nאבל זה לא באמת ככה, ההרצאות משעממות, דסטין פחות או יותר מדבר לעצמו (ולכמה דוקטורנטים או מתרגלים מהפקולטה למתמטיקה) בזמן שכל שאר הסטודנטים עושים שיעורי בית או משחקים בן האש ובת המים במחשב.\nהיתרון היחיד בהרצאות שהוא לא בודק נוכחות (איים בהרצאה ראשונה שאם הרבה לא יגיעו הוא יתחיל, אבל לא קרה הסימסטר).\n\nלמרות זאת יש שיעורי בית שדורשים הרבה יותר מדי ביחס למלג ופרויקט סיכום סביר שהוא בודק לא נחמד ככ.\n\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 3 מתוך 5 מטלות קריאה שנותנות ציון אוטומטי לפי כמה זמן הייתם עם המטלה פתוחה ועשיתם כאילו אתם קוראים ולפי כמה אנשים סימנו לכם לייק על תגובות שנתתם וכו'. לוקח לא מעט זמן ודי מתיש.\n\nהמבחן: אין - פרויקט. לכתוב 1000 מילים באינגלית, מאמר פילוסופי בקבוצות של 3-5, בודק קצת לא נחמד.\n\nהשורה התחתונה: נע", "timestamp": 1690299131599}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: הייתי בחלק (לא בודק נוכחות). יש נקודות מעניינות פה ושם והקורס הוא אמנם פילוסופי אבל מתעסק הרבה גם במתמטיקה.\n\nשעורי הבית: לקרוא מאמרים באנגלית בתוכנה שעוקבת אחרי כמה קראת. בהתחלה נראה מאוד קשוח אבל לומדים איך לכתוב תגובות (לעיתים עם CHATGPT) ומסתדרים ואז זה מאה די קל (ממוצע של שלושת המאמרים הגבוהים - 40% מהציון הסופי).\n\nהמבחן: אין מבחן. צריך להגיש לאורך הסמסטר תכנון על המאמר הסופי ואת המאמר עצמו (אפשר להגיש את המאמר עד לשבוע-שבועיים לתוך תקופת המבחנים). התכנון 20% מהסופי והמאמר 40% מהסופי. הכתיבה לא דורשת נוכחות בכיתה אבל כן מעבר על החומרים (בעיקר על איך לכתוב מאמר) שיש במודל (שימו לב - מאוד חשוב לדסטין הפורמט של הביבליוגרפיה). דורש השקעה אבל אפשר להסתדר. אפשר להתכתב במייל עם דסטין על המאמר ולקבל חוות דעת מה שמאוד עוזר.\n\nהשורה התחתונה: בלי נוכחות חובה, בלי מבחן, באנגלית... ציונים סבבה אם משקיעים בשלושת המטלות (מאמרים לקריאה, תכנון מאמר והמאמר). יש גם חלקים בחומר שמתעניינים ומראים פן אחר של חומר שלומדים בקורסים מתמטיים.", "timestamp": 1691854283542}, {"author": "המתחרט", "difficultyRank": 1, "generalRank": 1, "semester": "202301", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: \nהייתי אולי ב4 הרצאות עד שהשעמום ניצח אותי. לא בודק נוכחות.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית:  4 מטלות קריאה דרך אתר שבודק איך אתה קורא, טרחני ומיותר, במקום לקרוא אתה מחפש דרכים לעקוף את הבינה המלאכותית.\n\nהמבחן:  אין, יש עבודה באנגלית שהיא הרבה מעבר למצופה ממלג. 800 מילים באנגלית לכל חבר קבוצה, בערך 6 בקבוצה. נשמע לא מאיים, אבל יש דרישות ודקויות שדסטין מתעכב עליהם \n\nהשורה התחתונה: לברוח", "timestamp": 1714430082747}, {"author": "-", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: דסטין\nחוות דעת - הרצאות: לא הייתי כי לא הייתה חובת נוכחות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: סבבה\n\nהמבחן: הדוח סוף מזעזע , אסור להשתמש בAI כי הוא מעביר את המסמך תחת אתר כזה שמגלה כמה מהמסמך שלכם מועתק.\n\nהשורה התחתונה: לא מומלץ אלא אם משקיעים באמת ולמי יש כוח", "timestamp": 1718015985794}]}