{"posts": [{"author": "קרן", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "לא יודעת איך היה סימסטרים קודמים, אצלנו התחלף המרצה האחראי ליוסי שמאי והוא שינה קצת את הדגשים של הקורס כך שנוסף דגש על כימיה אורגנית בסיסית שלא היה לפני זה.\nבאופן כללי קורס ממש קליל, יש כמה גליונות מודל, שניים או שלושה גליונות שצריך להגיש גם ב-word, בכל מקרה ממש קליל כי יש בדרייב רפרנסים להכל.\nהמבחן היה ברמה ממש סבבה, השאלות האמריקאיות על החומר מההרצאות היו ממש אחלה, השאלות הפתוחות על התרגולים הן יותר ארוכות ודורשות חשיבה, אבל אם עברתם כמו שצריך על התרגולים והשיעורי בית גם הן ממש סבבה.", "timestamp": 1597738010992}, {"author": ";", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יוסי שמאי\nחוות דעת - הרצאות: מעניינות, אבל לא תמיד ברור מה צריך לדעת למבחן ומה סתם הרחבות ידע.\n\nשם המתרגל/ת: מיטל\nחוות דעת - תרגולים: התרגולים בדרך כלל לא ארכו יותר מ25 דקות. סך הכל מתרגלת טובה\n\nשעורי הבית: 9 גליונות במודל, לא דורשים יותר מדי זמן\n\nהמבחן: הוגן, אבל הסגל לא מפרסם כמעט מבחני עבר מה שממש מקשה על ההתכוננות, וגם אלו שפירסם לא היו רלוונטיים לגמרי/ לא היו עם תשובות.\n\nהשורה התחתונה: במהלך הסמסטר קורס נחמד ולא דורש יותר מדי. חבל שלא נותנים לך תחושה שרוצים לעזור לך ללמוד למבחן, בנוסף חלק מהמתרגלות לא היו סגורות לגמרי על החומר/ אמרו שיחזרו עם תשובות לשאלות שעד היום ממתינים להן.", "timestamp": 1659459273745}, {"author": "סטודנט", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: יוסי שמאי\n חוות דעת- הרצאות: תמיד בעל נוכחות לעזור ולהסביר, דאג תמיד שהסטודנטים יבינו את מה שמועבר יותר מאשר רק להעביר חומר, וזה נדיר.\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: התרגולים הועברו בצורה מאוד שטחית, וכמעט בכל תרגול הרגשתי חוסר מוכנות וחוסר מקצועיות בהעברת התרגול, ותמיד היו שאלות על החומר הנלמד שלא קיבלנו עליהן תשובה חד משמעית.\n\nשעורי הבית: היו שיעורי בית במודל, קלילים יחסית ולא דורשים יותר מדי השקעה. והיה פרויקט סופי שמציגים בהקלטה, בפרויקט הציונים היו פחות הוגנים יחסית לשנים קודמות, והסגל לא בא לקראת הסטודנט בציונים ואפילו לא היה משוב על הציון.\n\nהמבחן: יחסית הוגן- היה יכול להיות יותר טוב אם הסגל היה מפרסם מבחנים משנים קודמות או לפחות יותר שאלות לתרגול עצמי.\n\nהשורה התחתונה: מלבד המרצה האחראי, הסגל היה פחות בעניין לעזור . קורס כזה יכול לעבור בצורה יותר טובה.", "timestamp": 1667492258887}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יוסי שמאי\nחוות דעת - הרצאות: \nאומרים שהוא מבולגן, אני ממש נהניתי בהרצאות. מפרט על נושאים מעניינים\n\nשעורי הבית: \nממש קלים, ויש פרויקט אבל הוא לא ביג דיל בכלל\nהמבחן: \nתכף נגלה...\nהשורה התחתונה: ממש נהניתי מהקורס", "timestamp": 1689497574296}, {"author": "ביצת קינדר", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: יוסי מרצה סבבה נחמד מאוד וקצת איטי ומבולגן אבל סה\"כ סבבה \n\nשם המתרגל/ת: מיטל\nחוות דעת - תרגולים: קצרים ולא מועילים אפשר לקרוא לבד בלי לבוא, רק האחרונים חשובים\n\nשעורי הבית: קלים יש רפרנסים\n\nהמבחן: הוגן מאוד\n\nהשורה התחתונה: קורס מאוד קל, הפרויקט לא ממש כיף ולוקח הרבה זמן ושמחת חיים אבל סה\"כ הקורס עצמו מאוד קליל", "timestamp": 1691959535652}, {"author": "-", "difficultyRank": 2, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: יוסי מרצה מעולה קצת מפוזר\n\nשם המתרגל/ת: מיטל\nחוות דעת - תרגולים: תרגולים קצרים ומהירים אפשר לוותר ולראות מוקלט/ לעבור לבד על מצגת\n\nשעורי הבית: קליל יש רפרנס\n\nהמבחן: סבבה\n\nהשורה התחתונה: חוץ מהמרצה שמאוד נחמד ועוזר, אין תחושה של עזרה מצד הסגל, תרגולים פשוט מוקראים מהמצגת בלי שום הסבר מעבר, מרגיש שכל הקורס לא באמת נתעמק בכלום, עד היום לא קיבלנו תשובה לערעורים למבחן... נראה שיש להם עיסוקים אחרים כמו מחקר שבאים על חשבון הסטודנטים...", "timestamp": 1696112229152}]}