{"posts": [{"author": ";", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ג'וזואה\nחוות דעת - הרצאות: נחמד וכריזמטי, אבל נוטה לעשות לא מעט טעויות חישוב בהרצאות ולכתוב בצורה לא מסודרת\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: המתרגל שהכי משקיע בתרגולים שפגשתי עד עכשיו, אבל לא ברור אם זה בשביל לפרסם את עצמו ביוטיוב או בשביל באמת להעביר את החומר בצורה מיוחדת לסטודנטים.  גם אצלו יש טעויות חישוב בשיעורים\n\nשעורי הבית: לא מאוד פשוטים, דרשו שעות קבלה להבין מה רון רוצה מאיתנו, רון גם שינה דברים בניסוחים אחרי הפירסום ולא תמיד טרח לעדכן.\n\nהמבחן:  לא קשה יותר מדי, מומלץ בחום לעבור על התרגולי חזרה של רון, מאוד רלוונטיים למבחן.\n\nהשורה התחתונה: הקורס הועברה בפעם הראשונה וזה היה מאוד מורגש, הרגיש אפילו קצת זלזול בנו בעיקר בעניין התרגולים ושיעורי הבית, אבל בסוף קורס לא כבד ביחס לכמות הנקז שלו עם מבחן סביר לחלוטין.", "timestamp": 1677273214188}, {"author": "סטודנטית", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ג'וזוואה שניטמן\nחוות דעת - הרצאות: הוא בסך הכול מרצה מאוד נחמד ואכפתי כלפי הסטודנטים, אבל ההרצאות שלו הן ברובן מאוד תיאורטיות וקצת מבולגנות. בגלל העומס הפסקתי להגיע אליהן אחרי בערך שליש/חצי מהסמסטר.\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: קודם כל מאוד מושקעים, דבר שני מוקלטים (וביוטיוב, שאחרי הקריסה של המודל והפנופטו זה ממש מוערך). רון שם המון דגש על הבנה של המשוואות ושל השימוש בהן, ולכן לי אישית טעויות החישוב פחות מפריעות. הוא כהרגלו מביא כל מיני הדגמות, אבל לעומת פיזיקה 2 פה ההדגמות באמת נותנות אחיזה במציאות לכל החישובים.\nאני ראיתי אותו מוקלט ולי זה היה מושלם.\n\nשעורי הבית:  רובם הם וורסיה מסובכת יותר לתרגילים מהתרגולים של רון, וכן מצריכים חשיבה/שעת קבלה.\nלרעה- תיקונים/הבהרות בהרבה משיעורי הבית, לטובה- שעות הקבלה היו מוקלטות ולכן לכולם הייתה האפשרות לדעת מה היה בהן.\nבהתחלה היינו חייבים להגיש 5/5, אבל הסגל התחשב ואפשר להגיש 4/5.\n\nהמבחן: באופן מפתיע סביר מאוד - 3 ימי למידה הספיקו, אם הבנתי את החומר הצלחתי את השאלות בו יחסית בלי בעיה. אין מבחני עבר, אבל למדנו מהתרגולים ובאמת השאלות היו דומות לתרגולים.\n\nהשורה התחתונה: סך הכול הקורס מעניין ונותן איזושהי טעימה מהעולם של זרימה.", "timestamp": 1678613420057}, {"author": "מ", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גוזואה\nחוות דעת - הרצאות: גוזוואה תותח אמיתי, קצת קשה אתו לפעמים עם השפה והמבטא (והרשימות שלו) אבל הוא חמוד ממש ותמיד מוכן לחזור 700 פעם אז תנצלו את זה. מסתכל בגובה העיניים, מתלהב מהמקצוע, איתנו הוא הלך בקצב שלנו בסמסטר ולא מיהר לרוץ על החומר ויצא שהספקנו אולי חצי ממה שהוא תיכנן אבל את הדברים החשובים למדנו. זה בעיניי המעלה הכי גדולה של מרצה. שאפו\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: רון יכול להיות קצת חפרן לפעמים עם היוטיוב שלו וההצגות אבל מתרגל טוב, משקיע ה מ ו ן בקורס ובסוף זה משתלם, זמין לשאלות וסך הכל סבבה\n\nשעורי הבית: סבירים, לא עמוסים מידיי, תתכוננו לראות תמונות של רון במטלות עם נייר טואלט וכאלה, בהחלט תורמים למבחן\n\nהמבחן: פייר לחלוטין , תשאלו את המתרגלים שאלות במהלך המבחן כי הם יכולים ממש לעזור.\n\nהשורה התחתונה: קורס מאוד מעניין ומאמין שמאוד חשוב להמשך, שימשיכו ללכת בקצב של הקורס ולא לרוץ להספיק את החומר כמו רוב המרצים בטכניון. תודה רבה לכם", "timestamp": 1679668429039}, {"author": "המכשף הלטיני", "difficultyRank": 3, "generalRank": 5, "semester": "202301", "text": "שם המרצה: ג'וזואה\nחוות דעת - הרצאות: מרצה מצוין אחד הטובים שהיו לי בטכניון! נותן הרבה יחס וכבוד לסטודנטים, מדבר בגובה העיניים, נותן דגש על הבנה מסביר פחות חומר יותר לעומק, משלב הומור ותיאטרליות בהרצאות, באמת תותח על!\n\nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים: מה אפשר לבקש יותר מזה? חוזר על הנקודות הקשות מההרצאות ומעביר תרגול סופר מעניין, כל שיעור יש הדגמה אחת לפחות שקשורה לתרגיל שפתרנו, הכל מסודר מאורגן ברור, רון מנסה לתת את המיטב כדי לענות לנו אם זה ביוטיוב או בשעת קבלה, משקיע מאוד ובאמת אכפת לו שנבין ונהנה, הלוואי כל הקורסים היו ככה\n\nשעורי הבית: גיליון פעם בשבועיים שלוש סה\"כ 5 גליונות, לכל שאלה יש פתרון בדרייב / בסרטון שרון העלה ליוטיוב במחזור הקודם ופתר איתם בתרגול, תרגילי הבית קשים אבל לאט לאט מתרגלים להבנה ואם משקיעים בהחלט אפשר להבין מצוין\n\nהמבחן: עוד לא היה\n\nהשורה התחתונה: קורס חובה אבל בהחלט עם סגל מהטובים שיש לנו בפקולטה, הלוואי כל הקורסים בפקולטה היו מנוהלים ככה", "timestamp": 1710630821924}, {"author": "-", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ג׳וזואה\nחוות דעת - הרצאות: \nגוזואה חמוד ממש, רואים שממש אכפת לו שנבין את החומר ומעדיף ללמד פחות חומר ולהתמקד יותר בהבנה שלנו  \nשם המתרגל/ת: רון בסלר\nחוות דעת - תרגולים:  רון אחלה מתרגל ומאוד מאוד משקיע בקורס. עם זאת, אני חושבת שלפעמים הוא שוכח שהעבודה שלו זה לתרגל את הקורס ולא הערוץ שלו ביוטיוב. מרגיש לפעמים שהוא יותר עסוק בהצגה למצלמה ובקטעים המצחיקים ליוטיוב וזה בא על חשבון שאלות שלנו בתרגולים לפעמים. \nשעורי הבית: \nיחסית סבבה, יש הרבה סרטונים של רון גם פותר חלק מהם אם נתקעים. אנחנו לא קיבלנו ציונים לשיעורי בית עדיין (והמבחן כבר היה). בנוסף הועלו תשובות סופיות של הבודקת תרגילים שמלאות בטעויות חישוב וגם אין הסברים אז אין לנו איל לדעת אם צדקנו או טעינו בהם.  \nהמבחן: \nבעיניי היה קשה מאוד השנה. רון כל הזמן אמר שהוא לא מחפש להכשיל והעלה 2 מבחנים משנה שעברה שבאמת היו באחלה של רמה. שום קשר בין המבחנים שהעלה לבין המבחן שלנו- הרמה הייתה גבוהה, הוסיפו 20 דק באמצע, בוטלה שאלה תוך כדי, מלאאא התעסקות עם יחידות מידה ברמה שזה גרע מהשאלות עצמן \nהשורה התחתונה:", "timestamp": 1716017535010}, {"author": "....", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גוזואה\nחוות דעת - הרצאות: \nאם ממש מתרכזים הוא מרצה מעולה, לא מרבה לתת כותרות לדברים שהוא עושה אבל באמת די ברור. המרצה הכי מתחשב ואכפתי שנתקלתי בטכניון\n\nשם המתרגל/ת: תירוש\nחוות דעת - תרגולים: מתרגל מקצועי פרקטי ומעולה, נותן המון מקום לשאלות ומדבר בגובה העיניים. רון מברבר שעה סביב השאלה ולא נותן מקום לשאלות. הוא מלמד ליוטיוב ולא לידע שלנו.\n\nשעורי הבית: הוגנים וברמת המבחן, יש רפרנס לכמעט הכל בדרייב/בסרטוני עבר של רון\n\nהמבחן: השנה המבחן לא התעסק בעיקר לדעתי, לא מעט נושאים שנלמדו לא נשאלו בכלל ולא היו שאלות קלאסיות אבל צריך להיות עם דף נוסחאות טוב ולנחש באופן מושכל\n\nהשורה התחתונה: קורס חשוב עם מרצה אכפתי שבאמת בא לקראת הסטודנטים\nלא קל אבל לא בלתי אפשרי", "timestamp": 1716283970737}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: גזואה \nחוות דעת - הרצאות: \nהרצאות נחמדות מאוד, מעביר את החומר מעניין וברור אבל בסוף הן לא ממש קשורות למבחן ואפשר לקבל ציון גבוה בלי להיות בשום הרצאה\nשם המתרגל/ת: רון בסלר \nחוות דעת - תרגולים: ראיתי את הכל מהיוטיוב, מסודר ומועבר מעניין, זה כל מה שהיה צריך למבחן\n\n\nשעורי הבית: \nארוכים מאוד, במהלך הסמסטר נראים  קשים אבל פתרתי לפני המבחן והם ממש בסדר, מומלץ לפתור במקביל לסרטונים של רון ביוטיוב\n\nהמבחן: \nהשנה שלנו היה יותר קשה משנים קודמות של רון אבל בסך הכל אפשר להצליח\nהשורה התחתונה: קורס חובה אבל מועבר ברור ומסודר, מעניין ואפשר להצליח במבחן", "timestamp": 1716480393382}]}