{"posts": [{"author": "עד מתי", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ראמז\nחוות דעת - הרצאות: דיי איטיות, לא תמיד מתואמות עם הקצב של התרגולים\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: מסביר מסודר וברור\n\nשעורי הבית: 5 גליונות מודל, יש רפרנסים כמעט להכל בדרייב\n\nהמבחן: היה אצלנו 27 שאלות אמריקאיות (מתוכן מקבלים ציון על 25), דיי עמוס ל-3 שעות של מבחן, אבל סך הכל יחסית הוגן\n\nהשורה התחתונה: תתרגלו הרבה לפני המבחן ויהיה בסדק", "timestamp": 1615885250248}, {"author": "אנונ~", "difficultyRank": 4, "generalRank": 4, "semester": "202001", "text": "שם המרצה: ראמז \nחוות דעת - הרצאות: האמת לא ראיתי אף הרצאה בשום דבר, הסיכום שיש בדרייב מכסה את כל מה שצריך ואפשר פשוט לקרוא אותו במקום. \n\nשם המתרגל/ת:  שגיא אלון \nחוות דעת - תרגולים: \nהתרגולים מעולים לדעתי, אלון משדל להיות קשוב לסטודנטים והוא עוזר ועונה מהר בכל מה שצריך. \n\nשעורי הבית: \nשיעורי הבית די מרופרנסים, אז לא צריך להתאמץ. \nהשיעורי בית הרטובים לעומת זאת די מעייפים, אבל מהמחזור הבא אמורים לשנות את זה לMATLAB מה שאמור להיות יותר מלמד וגם יותר נוח להשתמש. \n\nהמבחן: המבחן סטנדרטי לחלוטין, מי שפותר הרבה מבחנים ושולט בכל הנוסחאות אמור להצליח. \n\nהשורה התחתונה: סה\"כ קורס חובה סביר בביו-רפואה.", "timestamp": 1615970621403}, {"author": "ביורפואן אקראי", "difficultyRank": 3, "generalRank": 3, "semester": "202101", "text": "שם המרצה: חמי רוטנברג וראמז דאניאל\nחוות דעת - הרצאות: חמי (מל\"מ) - חומר מעניין אבל מורכב. נראה מובן אבל בעצם הוא מאוד עמוק וטריקי. משלב מסוים הפסקתי ללכת וסמכתי על התרגולים ויוטיוב. ראמז (מעגלים) - נטשתי מאוד מהר את ההרצאות שלו שהיו איטיות להחריד ונכנסו לפעמים עמוק מידי לחומר. הסיכום בדרייב + יוטיוב לחלוטין מסדר את הידע הנדרש בנושא המעגלים. \nהמלצה - הסיכום בדרייב מעולה אבל חובה גם לראות סרטונים ביוטיוב שיתנו המחשה גרפית למה שהולך במל\"מ. \n\nשם המתרגל/ת: אלון שגיא\nחוות דעת - תרגולים: מתרגל מעולה, מבאר את החומר ובקיא בו.\n\nשעורי הבית: בין קל לבינוני. הרטובים עמוסים אבל סבירים מבחינת קושי.\n\nהמבחן: מל\"מ - צריך להבין טוב מאוד ולעומק את החומר התיאורטי (התרגולים בנושא פחות מתאימים למה שנדרש במבחן). מעגלים - לתרגל מלא שאלות בנושא ולהבין איך פתרו את השאלות בנושא בתרגולים. זה מכין די טוב.\n\nהשורה התחתונה: קורס חשמלטורי סבבה שצריך להיות בו על החומר.", "timestamp": 1647765753936}, {"author": "שם", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: חמי\nחוות דעת - הרצאות: מרצה מדהים. כל כך נהנתי בהרצאות\nשם המרצה: ראמז\nחוות דעת - סבלתי. ההרצאות איטיות, לא מובנות, וכל הרצאה אם מישהו שואל שאלה לא קשורה - אוטומטית מאבדים 20 דקות בהסבר על \"זה טרנזיסטור\"\n\nשם המתרגל/ת: אלון\nחוות דעת - תרגולים: תרגולים טובים ומובנים\n\nשעורי הבית: היבשים במודל, יש גם כמה רטובים. הרטובים סבירים (במיוחד ביחס לאותות ומערכות), המודל עשה בעיות כי לא רשמנו תשובה עם 4 ספרות אחרי הנקודה.\n\nהמבחן: לא היה נורא, גם הקלו בבדיקה, אפשר ללמוד למבחן במשך 3 ימים \n\nהשורה התחתונה: החצי הראשון של הקורס מעניין, השני לא", "timestamp": 1658672075060}, {"author": "אנונימי", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: חמי וראמז\nחוות דעת - הרצאות: חמי - ההרצאות עוברות טוב. מאוד משתדל להשאיר אותנו על החומר: עושה כל מיני שאלות וחידונים אינטראקטיביים. מרצה אכפתי. שיטת ההוראה שלו מעולה: הוא כל שיעור חוזר על החומר של שיעור קודם, לאחר מכן מלמד חומר חדש, ואז לקראת סוף השיעור עובר בקצרה על מה שנלמד שבוע הבא. קשה לא לעקוב אחריו, מאוד כריזמטי. ראמז - מרצה טוב, אכפתי ומאוד אנושי. התחשב בנו מאוד עם הקלטות, חזר על חומר שלא הובן יותר מכמה פעמים כשביקשו בכיתה, חומר שלימד קרוב למבחן - הוריד מהבחינה במועד א'. \n\nשם המתרגל/ת: ג'ירייס\nחוות דעת - תרגולים: מתרגל מעולה, יודע את החומר טוב, כל שאלת העמקה ששאלנו אותו בדק בספרים וחקר וחזר עם תשובה מעמיקה. + נושאים שפחות התיישבו כתב קבצי הסבר נוספים והעלה למודל. \n\nלקראת המבחן עשיתי מרתון על התרגולים של שגיא והוא גם מעולה ונותן אינטואיציה והסברים טובים ומעמיקים.\n\nשעורי הבית: מודל (יש רפרנס בדרייב) + 2 רטובים בsimulnik שהיו לא נוראים. המגן יוצא סביבות 100 והאחוז לא נמוך (30%?).\n\nהמבחן: הוגן, מבחני עבר מאוד דומים (חוץ מאיזה שנה אחת ששינו פורמט ולא המשיכו איתו). אפשר להוציא ציון מאוד יפה.\n\nהשורה התחתונה: המשך של מעגלים חשמליים עם יינון, זה הזמן להבין כל מיני פיתוחים שהוא עשה ולהבין מה זה דיודה וטרנזיסטור (שלא לימדו במעגלים).", "timestamp": 1679213257487}, {"author": "b2", "difficultyRank": 4, "generalRank": 5, "semester": "202202", "text": "שם המרצה:\n חמי וראמז\nחוות דעת - הרצאות: \nחמי מרצה טוב ומסביר דברים ברור, אבל הוא לא שם לב אם אנחנו מאבדים את זה או לא אז חשוב לשאול אותו הרבה שאלות והוא עונה טוב ובשמחה\nראמז... כמו כל הגאונים - להסביר בצורה פשוטה זה משימה קשה אצלו. צריך לבוא סופר מרוכזים או לא לבוא בכלל.\n\nשם המתרגל/ת:\n ג'ירייס \nחוות דעת - תרגולים: \nמתרגל שבאמת אכפת לו שהסטודנטים יבינו, מפרסם מלא הסברים והבהרות ודברים חשובים שהופיעו גם במבחן\nהוא שם דגשים חשובים על חומר שלפעמים נראה לא חשוב אבל הוא מהותי ממש\nשווה ללכת אליו בשביל הדגשים וחשוב לשאול שאלות אחרת הוא לא מבין אם הבנו או לא ומבחינתו אנחנו \"סבבה\"\n\nשעורי הבית: \nיבשים סבבה - עוזרים להבנה אבל מלא חישובים\nרטובים קצת ארוכים \n\nהמבחן: \nהסמסטר היה הרבה מתמטיקה בשילוב עם תיאוריה.\nזה אחלה שילוב שבאמת חשוב להבנת החומר אבל צריך ממש להבין את החומר לעומק כדי להצליח \n\nהשורה התחתונה: \nקורס חשוב מאודדד, סוף סוף קורס שנותן דוגמה למשהו מעשי ופרקטי שמשתמשים כל כך הרבה בחיים\nיש מלא חומר, קורס עמוס.", "timestamp": 1690362913708}, {"author": "kl", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: חמי- מאוד אכפתי כלפי הסטודנטים אבל לא תמיד הכי ברור.\nראמז- לפעמים קצת מתפזר אבל אבל סבבה סך הכל\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: יאסמין\nחוות דעת - תרגולים: מתרגלת טובה, מעבירה את החומר בצורה טובה ומשקיעה, אם יש זמן מוסיפה עוד קצת תרגולים/ שאלות ממבחני עבר\n\nשעורי הבית: יבשים- לא תואמים את רמת המבחן, דורשים בגדול למצוא את הנוסחא הנכונה ולהציב ולא הרבה מעבר.\nרטובים- סבירים, לא לוקחים הרבה זמן\n\nהמבחן: לא פשוט, רמה יותר גבוהה מאשר השאלות של שיעורי הבית מה שגורם לך לא להרגיש מאוד מכון אליו, דורש הבנה טובה של החומר, אבל בסוף הבדיקה זה לא כמו בפקולטה למתמטיקה \n\nהשורה התחתונה: קורס לא פשוט אבל חובה", "timestamp": 1691091825490}, {"author": "Vgs", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ראמז וחמי (מוקלט כי היה במילואים)\nחוות דעת - הרצאות: הרצאות ארוכות מאוד (שלוש שעות) עם מצגות באורך הגלות שמלאות בפיתוחים מתמטים לא ברורים שעלולים להכיל טעויות, מיותר באופן חד משמעי\n\nשם המתרגל/ת: \nמוקלטות של אלון, אחלה מתרגל שמגיע מחשמל ומבין את החומר טוב מאוד.\nחוות דעת - תרגולים: \nחשוב מאוד כי תכלס זה הדרך היחידה להבין את החומר באמת\n\nשעורי הבית: \nלא מסובכים יותר מידי בעיקר לפתח נוחסאות ולהציב, אין מה לבזבז זמן על הצבות גם ככה רוב המרות היחידות לא יסתדרו לכם בפעם הראשונה ויש רפרנס בדרייב של קוד במטלב שמציב בשבילכם.\nהמבחן: \nמועד א' היה זוועה ברמות שלא ניתן לתאר, החל מהשאלות האמריקיות וכלה בשאלות הפתוחות, הרגיש כאילו אין קשר בין המבחן לקורס עצמו, היה צריך לפתח נוסאות מאפס ולהיקבר בהררים של חישובים, הדף נוסחאות לא עוזר בשום צורה כי גם ככה רוב הנוסחאות הרלוונטיות לא נמצאות בו, רוב המבחן זה שליטה עמוקה מאוד בהבנה של החומר ויכולת לדמיין אלקטרונים קופצים ונופלים בראש...\nהשורה התחתונה: \nחבל שלקחו קורס כלכך מעניין וחשוב והפכו אותו לעוד מקרה קלאסי של מכניקת מוצקים, חבל שאי אפשר ללכת על הקורס של חשמל שגם קשה אבל לפחות יש סכוי להצליח להבין בו את החומר טוב יותר.", "timestamp": 1714560912002}, {"author": "^", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: ראמז\nחוות דעת - הרצאות: סבבה כן מסביר טוב ועוזר להבין את הדברים, ואין מה לעשות צריך להבין את ההרצאות בשביל המבחן\n\nשם המתרגל/ת: יסמין / ג'ירייס\nחוות דעת - תרגולים: לכן להקלטות של אלון, אם באלכם פרונטלי אז יסמין\n\nשעורי הבית: 99% טכני מאוד, לא קרוב לרמת המבחן, לא מכין לכלום אבל עוזר להתמצא בדף נוסחאות\n\nהמבחן: לא מובן למה לעשות מבחן כל כך קשה, אמריקאיות הרוב לא ממוחזר ולא פשוט, שאלות פתוחות ארוכות ומלאות בחישובים ארוכים בטירוף, זה לא מבחן הגיוני לסיים ב3 שעות גם אם אתם שולטים בחומר ברמת מטורפת בלי לבצע המון שגיאות חישוב, חבל שלא בוחנים על מה שבאמת נלמד ולא חסר חומר שנלמד\n\nהשורה התחתונה: קורס מאוד מעניין, מתרגלים שלא מספיק אכפת להם לתקן את הקובץ תרגול ובמינימום את שגיאות החישוב שיש שם/ במבחנים במודל, רמת מבחן גבוהה מדי שדי השאירה רושם רע", "timestamp": 1714680761144}]}