{"posts": [{"author": "שם", "semester": "201902", "text": "קורס נורא קליל עם מבחן משוחזר.\nנוכחות חובה ולכן וודאו שיש לכם ידיד שחותם בשמכם ויודע את מספר הזהות שלכם.\nלא צריך יותר מ3 שעות ללמוד למבחן (וזה כשפותחים את כל המצגות וקוראים אותם ועושים את כל המבחנים משנת 2011)", "timestamp": 1597243500000}, {"author": "באפ", "difficultyRank": 1, "generalRank": 5, "semester": "201901", "text": "שם המרצה:\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: מבחן עם שאלות ממוחזרות, אין צורך ללמוד אלא לשנן את השאלות ולעבור על ההרצאות יום לפני\n\nהשורה התחתונה: \nקורס ממש קל, לא צריך השקעה ומעלה ממוצע", "timestamp": 1600598421226}, {"author": "עידן", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמיותר. לא לומדים כלום בהרצאות כי המרצים מאד מנותקים מהסטודנטים. בסופו של דבר נבחנים על דברים שלא קשורים בכלל להרצאות כי במילא אף אחד לא זוכר מהן כלום ו/או יודע איך לסכם אותן.\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1612725370299}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: מרצים משתנים.\nחוות דעת - הרצאות: סך הכול מעניינות וחושפת לנושאים שחוקרים עליהם בפקולטה. היו הרצאות שהיו מובנות יותר טוב וכאלה שפחות.\n\nשם המתרגל/ת: מורן\nחוות דעת - תרגולים: היא בתכלס מי שאחראית על כל ההתנהלות של הקורס. בסך הכול מתחשבת בעניינים אישיים כשמבקשים ממנה באופן אישי.\n\nשעורי הבית: אין. שימו לב ש-39% מהציון (ככה היה אצלנו) הוא על הגעה, מזינים סיסמה במודל שניתנת במהלך ההרצאה, לפעמים בהתחלה וככל שהתקדם הסמסטר ככה הסיסמה הגיעה יותר ויותר מאוחר.\n\nהמבחן: רובו ממוחזר, לוקח בערך יום וחצי לחזור על כל ההרצאות ולעשות את המבחנים של ה-5-6 שנים האחרונות. היו השנה הרצאות חדשות שונות מההרצאות שהיו בשנים קודמות, ולחלקן היו שאלות על דברים די שוליים ואיזוטריים. די ביאס, כי בשנים קודמות המבחנים היו נטו ממוחזרים ופה היו שאלות שלא היה ברור מאיפה הן הגיעו. לפי מה שראינו בשנים קודמות מועד ב' ממוחזר ממועד א', אז אם לא מקבלים ציון סביר במועד א' ממש שווה לעשות מועד ב'\n\nהשורה התחתונה: בסך הכול קורס חמוד ממש, נק\"ז 1 שיכול להעלות קצת את הממוצע בסמסטר א' וגם לחשוף למה שעושים בפקולטה ולקורסים מתקדמים בהמשך התואר.", "timestamp": 1613987832228}, {"author": "מאור שמעוני", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות ממש מעניינות לרוב, היו איזה 2 מרצים עם מבטא כבד ואיכות לא משהו אז אף אחד לא הבין כלום (לא ממש שינה למבחן)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: הקשר בין ההרצאות לבין המבחן ברובו מקרי בהחלט.\nלא יכול להדגיש את זה מספיק - תעברו על כל המבחנים כי רוב השאלות חוזרות על עצמן, כדאי לשנן את הרוב (לא מסובך) לגמרי אפשרי להוציא ציון טוב אבל לעבור על כל המבחנים.\n\nהשורה התחתונה:", "timestamp": 1616404198604}, {"author": "ש", "difficultyRank": 1, "generalRank": 4, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: \nמרצים- כל הרצאה מרצה אחר, חלק מההרצאות מעניינות יותר ,חלק פחות, חלק מועברות ע\"י מרצים לא ברורים\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס קליל עם נוכחות חובה ומבחן ממוחזר, נחמד כי חושף אותך לכל עולם הביו-רפואה", "timestamp": 1628074173035}, {"author": "מישל", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: מרצים מתחלפים \nחוות דעת - הרצאות: כל שבוע הביאו חוקר.ת מהפקולטה. חלק העבירו הרצאות ממש מעניינות שנתנו מוטיבציה להמשיך ללמוד את התואר וחלק פחות. \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: אמריקאי וממוחזר\n\nהשורה התחתונה: קורס נחמד, נוכחות חובה ומהווה 40% מהציון הסופי", "timestamp": 1675622696777}, {"author": "ביקורת", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה:  משתנה\nחוות דעת - הרצאות: מעניינות קורס שממש כדאי להגיע לשמוע\n\nשם המתרגל/ת: מיטל\nחוות דעת - תרגולים:  לא היו\n\nשעורי הבית: אין\n\nהמבחן:  שיטה ממש מוזרה לבחון גם אם יהיו ציונים טובים המבחן מוזר מאוד, לא מאורגן ואין חומר ללמוד ממנו. אנשים העלו שאלות לא קשורות ולא נכונות\n\nהשורה התחתונה: מומלץ הלמידה למבחן מעצבנת", "timestamp": 1713615804481}, {"author": "ליאור רומנו", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: כל מיני\nחוות דעת - הרצאות: מעניין לרוב\n\nהמבחן: בשנים הקודמות המבחן חזר על עצמו כמעט 1:1 כל שנה. בשנה האחרונה היו איזה 40% שאלות חדשות - כאלו שהיית חייב להיות נוכח ולהקשיב בהרצאות בשביל לדעת.\n\nהמלצה למבחן: לשנן שמות של דימות \\ טיפולים \\ מכשירים ומה הם עושים. \n\nהשורה התחתונה: קורס קליל ואחלה נקז", "timestamp": 1714208249713}, {"author": "עדן", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מרצה משתנה.\nחוות דעת - הרצאות: תלוי מרצה, לפעמים מאוד מעניין ולפעמים משעמם.\n\nשם המתרגל/ת: מיטל אברשמי\nחוות דעת - תרגולים: אין. מיטל הייתה אחראית על שיעורי הבית ולדעתי גם על בניית המבחן. כן אגיד שהיא הייתה מאוד זמינה אם עלו בעיות לאורך הסמסטר.\n\nשעורי הבית: דורשים יצירתיות.\n\nהמבחן: קליל. בנוי משאלות שאנחנו בנינו לאורך הסמסטר ונפתחו לנו מראש כדי שנוכל לפתור כמה שיותר מהן.\n\nהשורה התחתונה: קורס שכיף לקחת כדי להכיר עוד חבר'ה מהפקולטה וכדי להיפתח לסוגי מחקר שונים, וגם אפשר לקבל בו 100 בלי להשקיע יותר מדי.", "timestamp": 1716726145399}]}