{"posts": [{"author": "~", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "חוות דעת - הרצאות: ההרצאות מתחלקות בין מרצים שונים. ההרצאות הכי טובות היו של ד\"ר אסף מרום- פשוט מרצה מצויין ומעניין. משאר המרצים היה צריך להבין מה בדיוק רמת הידע שדורשים למבחן או באופן כללי, וזה היה כמעט בלתי אפשרי. החומר מעניין אבל יש המון חומר ומלמדים בצורה שטחית יחסית. הנוכחות בהרצאות חובה\n\nהמבחן: המבחן לפחות במועד א' היה הזוי, נראה שאף אחד לא עבר על המבחן לפני שקיבלנו אותו והיה מלא בטעויות. הרמה הייתה הוגנת אבל הצורה שבה המבחן היה כתוב הייתה ממש נוראית\n\nהשורה התחתונה: הקורס מעניין והלמידה למבחן בעיקר תלויה בשינון, החלק של קתרין ואסף במבחן שווה הכי הרבה נקודות אז מומלץ להתעכב על זה", "timestamp": 1646222893222}, {"author": "Shiran Fournier", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מיטל\nחוות דעת - הרצאות: מרצה מושלמת והרצאות מעניינות \n\nשם המתרגל/ת: הודיה\nחוות דעת - תרגולים: מושלמת!!!!! המתרגלת הכי טובה. מעבירה את החומר באופן ממש ברור ולא יבש אלא מצחיק ומעניין\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1676100809034}, {"author": ":)", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: קתרין\nחוות דעת - הרצאות: \nהיו מרצים משתנים, חלק מעולים וחלק על הפנים.\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: \n-\nהמבחן: \nלא קשור לחומר הצילו. כאילו הם לא יודעים מה למדנו לאורך הסמסטר לא יודע מה להגיד\nהשורה התחתונה: לאורך הסמסטר העומס לא קיים, הלוואי שהיה ריכוז חומר לקראת המבחן או סילבוס או משהו שנדע מה בחומר.", "timestamp": 1677583587611}, {"author": "/ףפ", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יש כמה,  אסף מרום הכי טוב, קתרין בגדול פשוט מקריאה מהמצגת, כל השאר איפשהו באמצע\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: אליענה פישר\nחוות דעת - תרגולים:  לא ברור מה התפקיד שלה\n\nשעורי הבית: אין, רק לסמן נוכחות במהלך השיעור\n\nהמבחן:  דורש הרבה הבנה של החומר, שינון של קצת דברים אקסטרא שלא נלמדו בהרצאות, בסוף אבל רוב השאלות סבירות\n\nהשורה התחתונה: אין תלונות", "timestamp": 1677934073392}, {"author": ".", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יש כמה מרצים מתחלפים\n\nקורס חמוד, הבאסה היא שבגלל שיש מרצים מתחלפים כל אחד חי בבועה של עצמו ומלמד כמה חומר שהוא רוצה. אין סילבוס מסודר של כמות חומר (לא מפורט מה בדיוק לומדים על כל מערכת בגוף), ובסוף הצטבר כמויותתתת של חומר ביחס לקורס של 2 נקז. באופן כללי הרגיש שהקורס מנוהל לא טוב כלכך. לא היה ברור מתי מתקיימת הרצאה ומתי לא, לא היה ברור מה החומר למבחן בדיוק ומה המבנה שלו (פרסמו מבנה, ואז אמרו שזה \"לא מחייב\", ואז המבחן היה לא קשור למבנה). גם סירבו לפרסם לנו מבחני עבר מה שהיה מוזררר (כי המבחן לא היה ממוחזר). סהכ החומר חמוד, וללמוד אותו זה ממש לא נורא זה פשוט לא מעט חומר. מלא מושגים ומלא לשנן.  מרגיש באסה ללמוד כלכך הרבה חומר בשביל שני נקז אבל סהכ הקורס סבבי. עדיף לסכם את החומר במהלך הסמסטר, כי זה לא כמו הקורסים המתמטיים שאפשר פשוט לתרגל לפני המבחן כי צריך לזכור מלא דברים.", "timestamp": 1714247133605}, {"author": "2", "difficultyRank": 1, "generalRank": 2, "semester": "202301", "text": "שם המרצה: היו הרבה\nחוות דעת - הרצאות: מוזר שהן עוברות בעברית. הרוב המוחלט מדובר ונכתב באנגלית/לטינית. נוכחות חובה ומי שלא מגיע יהיה לו קשה יותר ללמוד, כי המצגות לא מכסות את החומר אלא מהוות כלי עזר בהרצאה עצמה.\nחלק מההרצאות עברו להקלטות הסמסטר\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: אין אבל כל שבוע צריך חוץ מהנוכחות לענות על בוחן ותמיד איכשהו היו כשלים טכניים\n\nהמבחן: אמריקאי, נוטה להיכנס לפינות של משהו שאחד המרצים אמר ברבע מילה בדקה שלפני ההפסקה\n\nהשורה התחתונה: קורס חובה (לתואר ראשון לפחות) אז אין איך לחמוק אבל ההתנהלות סביבו יכולה הייתה להיות טובה יותר מצד הפקולטה. הסירוב העיקש להעלות מבחני עבר וההקלטות שהיו באיכות לא טובה עם מצלמה לא מכוונת שלקח הרבה זמן עד שהעלו משנים קודמות... אפשר להיות נגישים יותר עבור הסטודנטים.", "timestamp": 1715155043197}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: היו מגוון \nחוות דעת - הרצאות: חובת הגעה, רובן לא ממש מועילות וחבל כי החומר כן מעניין. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן אמריקאי 40 שאלות הם בונים על זה שנלמד את הספר לאורכו ולרוחבו בתכלס למדתי מסיכום במשך 3 ימים אחרי שלא הקשבתי ברוב ההרצאות והוצאתי את ה80 לכן זה לא מסובך מדי. \n\nהשורה התחתונה: קורס מעניין שחבל שמעבירים אותו ככה.. הוא מתנהל בבלאגן ולא ברור ככ מה לומדים ומה לא. קורס בסדר", "timestamp": 1715519824299}, {"author": "E", "difficultyRank": 2, "generalRank": 1, "semester": "202301", "text": "שם המרצה: בערך כל מערכת לימד אותה מרצה שונה.\nחוות דעת - הרצאות: \nנוכחות חובה, 10% מהציון הסופי.\nקורס מבולגן! אין סילבוס מסודר, לא מובן מה שבחומר ומה שלא, מה צריך לזכור ומה שלא! מוזר שהקורס בעברית ורוב המושגים צריך לדעת באנגלית זה גם קשה.. \nהמצגות לא מכסות את החומר שנלמד בתוך ההרצאה פשוט מצגות רק עם תמונות (לא כולן). \nהיה ספר לקורס שהוא באנגלית ובערך 1200 עמוד.\nלא היה התנהלות טובה לאורך כל הסמסטר.\n\nמרצה אחראית: קתרין ונדורנה.\nלימדה 3 הרצאות בערך, אין שיטת לימוד היא פשוט קוראת את המצגת, היא לא יודעת עברית (: כל משפט לוקח חצי שעה וזה היה מאוד משעמם! \nאין מענה במייל, (היא אמרה שהיא לא תענה מהר על השאלות שבעברית כי היא לא חזקה בשפה) שאלתי משהו על החומר של המבחן -באנגלית- ועד היום אין מענה(: \n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: 40 שאלה אמריקאית. \nהיתה שאלה על משהו שלא למדנו בתוך ההרצאות. קתרין אמרה שזה היה בעמוד 700 ומשהו בספר והם יכולים ומותר להם לשאול על כל דבר שנמצא בספר (: סיוט לא? זה ספר שסטודנטים לרפואה לומדים ממנו לקורס של ה5 נק!!\n\nהשורה התחתונה: קורס מעניין מאוד חבל שזה הוא הצוות של הקורס. מאוד חבל.", "timestamp": 1715854492575}, {"author": "D", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: מרצים מתחלפים\nחוות דעת - הרצאות: נוכחות חובה. לכל מערכת בגוף מביאים מרצה אחר שהוא רופא שעוסק בתחום. יש יותר טובים ויש פחות, סך הכל מעניין.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין מבחני עבר לתרגל, יש שחזור או שניים בדרייב והמיקוד של החומר לא ברור (המצגות של המרצים זה בעיקר תמונות אז כדאי לכתוב בהרצאות)\nהמבחן הוא 40 שאלות אמריקאיות, הרוב קלות ולא מתחכמות אבל יש כמה ממש קטנוניות. סך הכל אפשר להוציא ציון לא רע\n\nהשורה התחתונה:", "timestamp": 1717265860505}, {"author": "ליים בת אל", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: משתנה \nחוות דעת - הרצאות: ממש תלוי אם מביאים לכם רופא.ה שיודע ללמד ויש לו קמצוץ יכולת עמידה מול קהל, או רופא שמקיא עליך חומר שהוא שינן ואז אפשר לראות הכל ביוטיוב. \nלהגיע להרצאות חובה כי יש בוחן, להקשיב נתון לבחירתכם. עדיף לקרוא את הספר. \nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין, יש בוחן במהלך השיעור שלא נותנים עליו ציון אבל חייבים לעשות אותו בשיעור. \n\nהמבחן: 40 שאלות אמריקאיות, צריך לשנן המון ולהמר קצת, כי הם שולפים שאלות מספר בן 2000 עמודים. לפחות 20+- אפשר לענות אם לומדים מסיכום טוב.  \n\nהשורה התחתונה: מבחן שהוא קצת הימור כי אין מושג מה ישימו, אין הרבה עבודה במהלך הסמסטר.", "timestamp": 1718533541361}]}