{"posts": [{"author": "באפ", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יובל\nחוות דעת - הרצאות: \nמאוד נחמד, באמת אכפת לו מהסטודנטים.\nמדבר יחסית לאט, לי היה קשה להתרכז ב3 שעות הרצאה שגם כמעט תמיד נמרחו מעבר. וגם כל ההקלטות יצאו דפוקות\nשם המתרגל/ת: ווג'די\nחוות דעת - תרגולים: \nאחלה\nשעורי הבית: כמעט כל שבוע גיליון עם הגשה לשבוע, קצת מעמיס\n\nהמבחן: הוגן, יש שאלות קלות ויש קצת יותר (נכתב לפני ציונים נמקווה לטוב)\n\nהשורה התחתונה: אין ברירה, לפי דעתי עדיף משל תעו\"נ למרות שהיו 2 בחני אמצע", "timestamp": 1658689556215}, {"author": "השערת האפס", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יובל גרעיני\nחוות דעת - הרצאות: מרצה טוב, קצת ההרצאות היו ארוכות אבל המרצה חשוב לו שכולם יבינו ולהעביר את החומר כמו שצריך\n\nשם המתרגל/ת: ווג'די\nחוות דעת - תרגולים: מתרגל לא רע בכלל, מנסה לזרוק בדיחות כל הזמן לא כל כך צחקתי אבל גם לא הפריע\n\nשעורי הבית: \nקצת עמוסות כמעת כל שבוע יש גיליון 11 סה\"כ. אבל עוזרות להבנה ורמת הקושי הוגנת\n\nהמבחן: \nמבחן של 4 שאלות פתוחות \nרמת הקושי הייתה סבירה עדיין לא קיבלנו ציונים, הצפי לממוצע טוב\nהשורה התחתונה: \nקורס יותר סביר מתעו\"נ כנראה והסגל טוב ומתחשב. מומלץ להבין את התיאוריה טוב יעזור מאוד למבחן.", "timestamp": 1690536314863}, {"author": "meee", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל גרעיני\nחוות דעת - הרצאות: \nהרבה הרבה חזרה על הסתברות וקצת למידה של חומר חדש.\nבן אדם מקסים ומאוד מתחשב, עוזר וסבלני -צריך עוד מרצים כאלה בפקולטה הזו.\n\nשם המתרגל/ת:  וג'די\nחוות דעת - תרגולים: \nהרבה זמן לא ראיתי מתרגל שגם מבין את החומר וגם יודע *להעביר* אותו בצורה ברורה כמו וג'די.\nתמיד זמין לשאלות, שעות קבלה\nאווירה ממש טובה בתרגולים ולגמרי מומלץ להגיע אליו\n\nשעורי הבית: \nכל שבוע - קצת מציק אבל לא כזה ארוך,  חשוב לתרגל את הדברים זה עוזר במהלך הסמסטר \n\nהמבחן: \nלא קשה במיוחד אם לומדים טוב את החומר במהלך הסמסטר ולא מחכים לשבוע\\יים אחרונים\n\nהשורה התחתונה: \nקורס חשוב ופרקטי לכל תחום בחיים ובאמת מועבר טוב", "timestamp": 1690826761247}, {"author": "kl", "difficultyRank": 3, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל גרעיני\nחוות דעת - הרצאות: לפעמים קצת איטי וחוזר קצת יותר מדי על החומר שעבר, אבל בסופו של דבר מרצה טוב שמאוד קשוב ואכפתי כלפי הסטודנטים, דואג לדף נוסחאות שהוא בגדול פשוט סיכום של החומר ובאמת רוצה שהסטודנטים יצליחו.\n\nשם המתרגל/ת: וג'די\nחוות דעת - תרגולים: אחלה של מתרגל, מעביר את החומר בצורה טובה ומעניינת\n\nשעורי הבית: כל שבוע, לרוב אבל לא דורשים יותר מדי עבודה\n\nהמבחן: סביר לחלוטין, יש אחלה דף נוסחאות\n\nהשורה התחתונה: לא לקחת את סטטיסטיקה של תעו\"נ או איך שלא קוראים להם", "timestamp": 1691091474242}, {"author": "ביורפואי :)", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יובל גרעיני\nחוות דעת - הרצאות: יובל מרצה מעולה בעיניי. מסביר לאט וברור, חוזר על כל דבר גם 10 פעם עד שכולם יבינו. יש שיאמרו שהקצב של ההרצאות היה איטי אבל בעיניי זה היה מעולה ואפשר לי להבין לעומק את החומר ועדיף כל כך על פני מרצה שממהר ולא מוודא הבנה עם הסטודנטים.\n\nשם המתרגל/ת: ווג'די ניקולא\nחוות דעת - תרגולים: אני ראיתי את התרגולים מוקלט כי לא יכולתי לנכוח ובעיניי זה היה מעולה. ווג'די מסביר בצורה מאוד אינטואיטיבית את החומר, שם דגש על דברים ממש רלוונטיים וההקלטות אפשרו לי לחזור אחורה ולא לפספס.\n\nשעורי הבית: עומדים בקנה אחד עם התרגולים והמבחן וממש חשובים להבנה של החומר, לוקחים זמן סביר ולא קשים מדי. ממש חשוב לעשות אותם\n\nהמבחן: הכי הוגן שיצא לי לעשות בטכניון (וזה לא אומר בהכרח קל, זה פשוט אומר שאשכרה שאלו אותנו על החומר שלימדו, כן כן, מפתיע).\n\nהשורה התחתונה: קורס מדהים עם הסגל הכי אכפתי שיצא לי להתקל בו בטכניון, כולם מסבירי פנים, מסבירים טוב את החומר ובאמת אכפת להם שנהנה מהקורס וניקח ממנו דברים רלוונטיים להמשך.", "timestamp": 1692874365689}, {"author": "--", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: יש, ממש סבבה\n\nהמבחן: הוגן\n\nהשורה התחתונה: אחלה קורס וג'די ויובל דואגים להכל", "timestamp": 1704994904897}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: יובל גרעיני\nחוות דעת - הרצאות: 3 שעות הרצאה בסוף היום זה לא קל אז לא הייתי בחלק. הוא מסביר בעיקר את הרקע התיאורטי לחומר  החישובי שמשתמשים בו אחר כך בתרגולים ובמבחן.\n\nשם המתרגל/ת: וג'די\nחוות דעת - תרגולים: מעולה! מסביר הכל ממש ברור וטוב, עונה על שאלות ועוזר מאוד גם בשעות קבלה.\n\nשעורי הבית: טכניים חלקם בפייתון וחלקם בכתב. לא ארוכים ועוזרים לעקוב אחרי החומר של הקורס\n\nהמבחן: מועד א היה קל (מאוד דומה לזה של שנה לפניו). האמיצים שעשו מועד ב סבלו ממועד לא נעים.\n\nהשורה התחתונה: קורס חובה שחשוב ללימודים עם צוות מעולה", "timestamp": 1705258468676}]}