{"posts": [{"author": "קרן", "difficultyRank": 3, "generalRank": 3, "semester": "201902", "text": "שם המרצה: \nחוות דעת - הרצאות: ההרצאות של הוידאו מעולות\n\nשם המתרגל/ת: מרק\nחוות דעת - תרגולים: קצת שבוז, אבל סך הכל מתרגל ממש סבבה, הרבה יותר התחברתי לצורת לימוד שלו מאשר של המתרגל בוידאו\n\nשעורי הבית: לא קלים, אבל יש רפרנס כמעט להכל\n\nהמבחן: המבחן הוא כמה רמות מעל מה שעושים בתרגולים ובשיעורי בית. לפני המבחן כדאי לתרגל כמה שיותר (שזה קצת בעייתי כי אין יותר מדיי מבחני עבר רלוונטים ללמוד מהם). הבדיקה של המבחן היא יחסית חפפנית, אבל אם כותבים שטויות הם מורידים על זה הרבה.\n\nהשורה התחתונה: לא קורס קל. צריך לתרגל כמו שצריך ולהבין את התיאוריה כדי להצליח במבחן.", "timestamp": 1601454583789}, {"author": "שם", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: קשה לשמוע את נתי במהלך ההרצאות ודורש המון מאמץ לעקוב אחריו.\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: לבוא לתרגול השני שהוא מעביר באותו שבוע, אם הוא המתרגל היחיד.\n\nשם המדריך: נועם קידר\nחוות דעת - סדנאות: מסביר כל דבר וממש מובן! בזכות הסדנאות הבנתי את הקורס.\n\nשעורי הבית: 6 שעורי בית שמבוססים שלרוב לקוחים מספר הקורס שקשים לפתירה. הגשה בזוגות.\n\nהמבחן: 3 שאלות פתוחות - תמיד אחד מהם יהיה על מיכל לחץ דק דופן - המבחן קשה. מומלץ לכתוב משהו אפילו אם לא יודעים איך לגשת לשאלה/איך לפתור, אך הציונים בסדר.\n\nהשורה התחתונה: קורס חובה שחייבים לעשות.", "timestamp": 1627589231245}, {"author": "לגרנג", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: קשה להבין מה הוא רוצה בהתחלה אבל אפשר לשאול והוא בדרך כלל בא לקראתכם.\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: \nאין דרך להביע את חוות הדעת...\nשעורי הבית: \nממוחזרים על החומר, ועוזרות להבין דבר או שניים. כדאי לפתור בלי רפרנס בהתחלה.\nהמבחן: יכול להיות מאוד קשה או קצת קשה, כתלות בהבנתכם לחומר. אם מבינים מאוד את מה שעושים, לא אמורה להיות בעיה (אפשר לפתור מהספר תרגילילם בודדים להתחזק בכל נושא). אם פחות מבינים את החומר אז זה יהיה מאוד בעייתי, כי במועד א אצלנו היו שאלות על הבנה.\nהבדיקה בודקת הבנה ולא שטויות חישוב אז כדאי לכם לפחות אם לא עובד לכם משהו, לנסות לפרט איך הייתפ פותרים לפני שאתם מסתכלים על הפתרון\n\nהשורה התחתונה:", "timestamp": 1634653812095}, {"author": "~", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: אחד המרצים הכי מתחשבים שבסטודנטים שפגשתי, אבל ההרצאות קשות וקשה לעקוב אחריו. מומלץ לחזק בסרטונים מהיוטיוב לאורך כל הסמסטר ולא רק לקראת המבחן.\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: תחילת כל תרגול הוא חוזר על החומר של ההרצאה שבעיניי תרם ברמות. דאג לכל דבר שביקשנו ממנו והשתדל להסביר על הכל, אבל לא תמיד יודע לענות על כל השאלות.\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: ממש נחמד וכנראה שמבין את החומר, אבל מאוד איטי ובקושי מספיק דברים בקצב של ההרצאות. בעיניי לא מסביר כל כך טוב.\n\nשעורי הבית: הסמסטר הזה עברו למודל והיו אינסוף תקלות. סה\"כ 7 גיליונות עם תרגילים מהספר, מומלץ לפתור ולא לרפרנס (אבל יש רפרנסים להכל). הסמסטר היה גם תרגיל רטוב קשה ממש בלי רפרנס שהסגל לא היה סגור בעצמו מה התשובות אליו.\n\nהמבחן: אין הרבה מילים לתאר. לא משנה כמה לומדים תמיד נתקלים במבחן הזה במשהו בפעם הראשונה. מומלץ לחזור טוב על ההרצאות והתרגולים ולפני שמתייאשים מפתרון של שאלה לכתוב את הרעיון הכללי של הפתרון. במבחן זה מה שנותן את הנקודות ומאפשר לעבור.\n\nהשורה התחתונה: קורס חובה :(", "timestamp": 1658304085726}, {"author": "עייפנו", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: קשה להבין את החומר בזמן ההרצאה אבל הוא באמת המרצה הכי מתחשב שהיה לנו, עזר בכל בעיה שהייתה (והיו מלא) ונענה בערך לכל בקשה שלנו.\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: מרגיש שהתרגולים עזרו קצת, וליבגני היה ממש אכפת מהסטודנטים וענה על כל שאלה.\nהמצגות של התרגולים מלאות בטעויות כמו סימנים לא נכונים ותשובות סופיות לא נכונות אז אי אפשר היה להסתמך עליהן בכלל, אבל התרגולים עצמם כן עזרו להבנה.\n\nשעורי הבית: היו תרגילים במודל וכל פעם מחדש משהו לא עבד והיה צריך לפנות לצוות. מלא זמן שהלך לפח על לנסות למצוא מה הטעות כשהבעיה הייתה בכלל בתרגילים עצמם.\n\nהיה גם תרגיל רטוב - תרגיל להגשה בכתב וגם כתיבת קוד בפייתון או במה שרוצים, וכמו בכל דבר בקורס היה קשה להבין מה רוצים מאיתנו.\n\nהמבחן: הזוי לגמרי, רובו לא דומה לאף תרגיל שהיה בהרצאות או בתרגולים, מנותק לגמרי מהרמה של הקורס. הממוצע היה 40 או אפילו פחות וזה אחרי שממש ריחמו עלינו בבדיקה. היה בסוף פקטור של 25 נקודות בערך שהביא לממוצע 64 (מועד א).\n\nחשוב!!!! - לא להשאיר אף סעיף ריק, לכתוב אפילו במילים את הכיוון של הפתרון או נוסחאות רלוונטיות גם אם לא יודעים, קיבלנו על זה הרבה נקודות.\n\nהשורה התחתונה: החומר לא נורא\\די מעניין אבל משהו בהתנהלות חייב להשתנות.", "timestamp": 1665328591144}, {"author": ";", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: מאוד אכםת לו מהסטודנטים ומאוד מתחשב, בפועל ההרצאות לא ממש מעניינות \n\nשם המתרגל/ת: יבגני+נועם\nחוות דעת - תרגולים: יבגני- לא תמיד יודע להסביר עד הסוף אבל דואג לסטודנטים\nנועם- מאוד משתדל להסביר הכל, הבעייה שבסוף לא ממש מתקדמים בחומר במהלך השיעור\n\nשעורי הבית:  לא תמיד הכי ברורים, בעיקר היה מעיק שעברו למודל וחצי מהשאלות לא עבדו. לא דורשים המון זמן\n\nהמבחן: הצוות לא יודע לבנות מבחן הגיוני, נדרשים לבנות נוסחאות מאוד ארוכות בלי מספיק זמן, ויש הרבה שאלות שלא ברורות, והציונים של המבחן בהתאם. ייאמר לזכות הצוות שנתן פקטור הגיוני (וגדול) כך שההיסטוגרמה בסוף יוצאת נורמלית\n\nהשורה התחתונה: צוות מאוד אכפתי כלפי הסטודנטים אבל בסוף יש הרבה בעיות מקצועיות שמאוד מקשות על ההתנהלות במהלך הסמסטר ובמבחן הסופי", "timestamp": 1668100668248}, {"author": "נג'י מהאגודה לתרבות הדיור", "difficultyRank": 2, "generalRank": 2, "semester": "202102", "text": "שם המרצה: נתי\nחוות דעת - הרצאות: הפסקתי להגיע בשלב מסויים. היה קשה.\n\nשם המתרגל/ת: נועם\nחוות דעת - תרגולים: ניכר כי מבין את החומר אבל לא הבין את עומק הייאוש שלנו.\n\nשעורי הבית: תרפרנסו כל עוד נפשכם בכם.\n\nהמבחן: אין קשר בינו לבין המציאות, זה לא אתם שלא בסדר, השאלות לא בסדר. כל סמסטר מחדש יבגני נכנס לומר שזה המבחן הכי קל שהיה עד כה- עיוות המציאות בקנה מידה שלא נראה מעולם.\n\nהשורה התחתונה: הקורס הוא בדיחה חד צדדית במסגרתו הסגל מעמיד פנים שלימדו 2 קורסים של הנדסת מכונות ב5 שעות שבועיות ואתם מעמידים פנים שהבנתם וכותבים שטויות על מחברת הבחינה.", "timestamp": 1689970745592}, {"author": "חצי מהנדס", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: גוזואה \nחוות דעת - הרצאות: \nקצת קשה עם השפה והמבטא ולוקח זמן להתרגל אליו\nאבל בתכלס הוא המרצה הראשון שהרגשתי ממנו מה זה הנדסה, ועוד דבר חשוב ממש שהלוואי שכל המרצים היו עושים - הוא לא ממהר לרוץ על החומר אלא באמת מלמד וקשוב לקצב של הכיתה שזה ממש יפה.\nתהיו אמיתיים איתו ותשאלו אותו 700 שאלות עד שהכל יהיה ברור, הוא לא המרצה הכי טוב בעולם אבל הוא אכפתי מאוד ובן אדם טוב ומצחיק.\n\nשם המתרגל/ת: יבגני / תירוש \nחוות דעת - תרגולים: \nיבגני זה בן אדם שצריך לתפעל, אם לא תשאלו הרבה שאלות ותכוונו אותו - לא תבינו כלום.\nהוא יודע את החומר ממש טוב ואכפת לו מהסטודנטים אבל קצת אדיש ושקט, צריך ממש לשאול שאלות ולהיות פעילים כדי להצליח. הוא גם ממש אכפתי ויישאר איתכם אחרי התרגול עד שתבינו.\n\nתירוש - יותר ברור ופעיל מיבגני אבל גם קצת לפעמים מסרבל יותר את ההבנה מאשר עוזר, פשוט תמשיכו להתעקש עד שיהיה ברור עד הסוף.\n\nשעורי הבית: \nסביר, לא עמוס מידיי, עוזר להבין את החומר ו20 אחוז תקף שזה מגניב, יש רפרנסים להרוב\n\nהמבחן: \nקשוח ממש, מבאס שהאופי בקורס הזה התנרמל להיות \"תגרפו כמה נקודות שתוכלו ועם הפקטור יהיה בסדר\"\nאצלנו יבגני הבטיח שהמבחן קל והוא באמת היה קל יותר משנים קודמות אבל זה באמת לא הגיוני מה שהולך שם, זה עמוס מידיי ולא ברור מה רוצים בניסוחים, היה פאקטור של באזור ה30 נקודות אז זה יצא סבבה בסוף\n\nהשורה התחתונה: החומר ממש היה לי מעניין והקורס הזה סבבה, מקווה שימשיכו להשתפר ולתקן את המצב הנוכחי, בכל מקרה הצוות מאוד אכפתי אז זה עוזר.", "timestamp": 1690274987100}, {"author": "אנונימוס", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: גוזואה - לא הייתי\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: יבגני, אפשר לחלק ל2, מבחינת כל מה שהוא לא מקצועיות הוא מעולה, בחור נחמד מאוד, רואים שאכפת לו מהסטודנטים, מנסה לתת מעצמו את המקסימום. מבחינה מקצועית לא הייתי נותן לו להיות מתרגל, פשוט לא יודע להעביר שיעור ולהסביר, אם אתם רוצים להבין את החומר עדיף מיוטיוב מאשר התרגול\n\nשעורי הבית: רק לרפרנס ברמת קושי הרבה יותר גבוהה מההרצאות ותרגולים חוץ מהש.ב הראשונים\n\nהמבחן: המבחן פשוט הזוי, לא מובן למה יבגני חוזר ואומר שהמבחן קל אם הוא צריך תמיד לתת פקטור של 30 נקודות כדי שיהיה ממוצע 70 גג, באמת אין לי מילים כבר על הסגל הזה הכי נחמד וחסר פרופורציות שראיתי\n\nהשורה התחתונה: קורס מעניין ונחמד, שנהרס לחלוטין בעקבות ניהול כושל מכל הבחינות של סגל הקורס, ולמה יש לנו רטוב שצריך לכתוב בו קוד בנומריות שלא נלמד בכלל בחומר הקורס???? מצער אותי שהקורס הזה היה חובה מתסכל מאוד", "timestamp": 1691952776592}, {"author": "פיית לילה", "difficultyRank": 4, "generalRank": 2, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: ג'וזואה מלך פשוט מרצה מושלם\n\nשם המתרגל/ת: יבגני\nחוות דעת - תרגולים: למה????????????? מי נתן לו לתרגל?? אף אחד לא הבין כלום כל הקורס בגלל התרגולים הכושלים, פשוט מזעזע שאף אחד לא בודק שהוא יודע ללמד לפני שהוא מתרגל \n\nשעורי הבית: רפרנס\n\nהמבחן: זוועה תמיד ממוצע 30-40 ואז יבגני נותן פקטור 30-40 נקודות, ואנחנו לא לומדים כלום רק מחרטטים\n\nהשורה התחתונה: להעיף את יבגני, ללמד בסיס יותר טוב לחומר במקום סתם לתת מבחן קשה רצח ופקטור ענק ושהסטודנטים יצטרכו לחרטט ולקוות לטוב, באנו ללמוד להנדס לא לחרטט!", "timestamp": 1707755589197}]}