{"posts": [{"author": ".", "difficultyRank": 5, "generalRank": 1, "semester": "201902", "text": "שם המרצה: עינת\nחוות דעת - הרצאות: הכי גרוע שיש\n\nשם המתרגל/ת: נועה\nחוות דעת - תרגולים: כנ\"ל\n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: איו התחשבויות, סגל לא אחראי", "timestamp": 1599598159851}, {"author": "רנין", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: דר ענת\nחוות דעת - הרצאות: אין בו הרצאות ( רק הרצאה ראשונה וחובת נוכחות בהצגות של הקבוצות בסוף סמסטר ) \n\nשם המתרגל/ת: נועה \nחוות דעת - תרגולים: אין תרגולים\n\nשעורי הבית: \n\nהמבחן: אין מבחן - ציון מבוסס על פרויקט סופי \n\nהשורה התחתונה: קורס נחמד שלא דורש השקעה חוץ מהפרוייקט . בפתיחת סמססטר מתחלקים לקבוצות וכל קבוצה בוחרת מחלקה ברמב\"ם שחוקרים את הבעיות בה ובסוף סמסטר מציגים פרווקט על זה . דורש ביקורים לרמבם ( יש לכל מחלקה מדריך שמלווה את הסטודנטים ) ממש מעניין ו מראה איך מטפלים במטופלים במחלקות.", "timestamp": 1627136453186}, {"author": "מהנדס", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ענת\nחוות דעת - הרצאות: \nהיו כמה מפגשים של הצגות, היתה קצת קשוחה בהערות לפרוייקטים אבל סביר סה\"כ גם החמיאה לנו.\nשם המתרגל/ת: סופי\nחוות דעת - תרגולים: \nלא הבנתי מה תפקידה בקורס \nשעורי הבית: \nאין\nהמבחן: \nאין רק פרויקט נחמד שחושף אותנו לעולם הקליני\nהשורה התחתונה: \nקורס ממש נחמד אפשר להוציא ציון טוב", "timestamp": 1656966710817}, {"author": "ביורפואן אקראי", "difficultyRank": 2, "generalRank": 4, "semester": "202102", "text": "שם המרצה: ענת גרינפלד וסופי סגל.\nחוות דעת: מצטוותים לקבוצות והולכים למחלקות שונות בבתי החולים בחיפה כ3-4 פעמים בסמסטר. שם צריך לחשוב על רעיון לפתרון בעיה שקיימת. בחודש האחרון לסמסטר,כל קבוצה מכינה הרצאה על המחלקה ועל הרעיון ומציגה אותה מול כל כיתת הסטודנטים ומול ענת וסופי. בסוף ההרצאה הן חוות את דעתן ושואלות שאלות.\n\nשעורי הבית: ללכת למחלקות ולהכין את המצגת. טיפ: נסו ללכת למקומות עם צוות רפואה שאוהב את הקורס ומציע רעיונות משל עצמו, שלא תצטרכו לחקור ולגלות לבד מה הבעיות שלהם.\n\nהמבחן: הרצאה והגשה של המצגת+דוח לצוות הקורס.\n\nהשורה התחתונה: קורס נחמד ביותר שגורם לך להתעמק בנושא מסוים ולהבין את הפרקטיקה היומיומית שלו בביה\"ח.", "timestamp": 1657297014287}, {"author": "Dafna Kadosh", "difficultyRank": 2, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דר ענת\nהרצאות: אין הרצאות חוץ מהרצאת פתיחה\n\nשם המתרגל/ת: נועה\nתרגולים: אין תרגולים\n\nבקורס נכנסים למחלקות בבתי חולים ולומדים באופן מעשי ולאחר מכן חושבים על רעיונות לפיתוח על בסיס מה שרואים. מתחלקים לקבוצות של 3 ומגיעים 3-4 פעמים למחלקה שנבחרה. נכנסים לניתוחים/מעבדות/תורים בהתאם למה שקובעים מראש עם ראש המחלקה. \n\nהשורה התחתונה: קורס מאוד חשוב שכדאי לכולם לקחת, רוב התואר לומדים באופן תיאורטי וזה הזדמנות סוף סוף ליישם את הידע שלנו.", "timestamp": 1690884150958}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ענת\n\nשם המתרגל/ת: נועם\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: עושים עבודה על רעיון לפיתרון רפואי אחרי ביקור באחת ממחלקות בתי החולים. בערך 3 ביקורים אחריהם צריך לחשוב על רעיון ולהכין דף סיכום ומצגת שמציגים לכיתה. מעניין ולא מעמיס", "timestamp": 1705258614858}]}