{"posts": [{"author": "אסיל נעמה", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אוסקר המקסיםםם\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1599598093394}, {"author": "ברגי הידוק", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: \nלפעמים היה משעמם לפעמים לא, תלוי איזה נושא. המרצה היא חדשה בפקולטה ולכן לא הספיקה לשנות משהו בקורס או בהרצאות והמשיכה עם הרצאות של המרצה הקודם. סה\"כ מרצה ממש נחמדה.\nשם המתרגל/ת: טניה עסאף\nחוות דעת - תרגולים: \nתרגולים היו ארוכים יחסית וטכניים מאוד, אבל המתרגלת מעולה ונחמדה וממש יודעת להעביר את החומר, גם שאר המתרגלים היו ממש מעולים ועזרו המון בפרויקטים.\nשעורי הבית: \nארוכים וצריכים הרבה השקעה גם היה חלק של סוליד(בונים חלקים ב תלת מימד)\nהמבחן: \nעדיין לא עשיתי\nהשורה התחתונה: \nחבל שקורס כזה שקשור מאוד לתעשייה הביו-רפואית מועבר בצורה שנראת פחות קשורה. לפי דעתי לקורס יש פוטנציאל אדיר לשיפור ואפשר להפוך אותו לקורס יותר מעניין. את החלק של ללמוד בסוליד היה ממש נחמד ומעניין. מומלץ לעשות את הפרויקט שמסדר את החומר בראש(תעשו משהו קל).", "timestamp": 1656967879832}, {"author": "ברגי הנעה", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: משעממות. הכל טכני ומוקרא אחד לאחד מהסיכום/מצגת. עדיף לקרוא את ערכי הויקיפדיה.\n\nשם המתרגל/ת: טניה עסאף\nחוות דעת - תרגולים: אחלה מתרגלת, אבל החומר פשוט משעמם וטכני ברמות. \n\nשעורי הבית: 6 גיליונות, לא להכל יש רפרנסים. בממוצע רמת קושי בינונית. בחלק מהגיליונות יש תרגילים בSolidWorks.\n\nהמבחן: אנחנו המחזור הראשון של צוות הקורס עם הצוות החדש (בלי אוסקר וכו') והרגשנו את זה - מבחן מאוד קשה. נגמרו הימים של שחזור שאלות אמריקאיות ושאלות פתוחות קלות.\n\nהשורה התחתונה: קורס ששעמם אותי (אנשים שאוהבים מכניקה אולי יאהבו), ההרצאות מיותרות לחלוטין, התרגולים אחלה ויש גם תרגולים מוקלטים מ2020 מעולים.\nיש פרויקט סיום רשות- לתכנן מוצר ביורפואי ולנתח אותו מכנית עם הכלים שנלמדו בקורס. הפרויקט הוא צרכן זמן אז לחשוב טוב אם לקחת אותו.", "timestamp": 1658309216368}, {"author": "באפ", "difficultyRank": 4, "generalRank": 2, "semester": "202102", "text": "שם המרצה: אריאל (נראה לי)\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: כבדים, ארוכים, חובה להגיש את כולם והם תקף...\n\nהמבחן: לא הוגן בכלל. שאלות אמריקאיות לא היו דומות לשנים קודמות בכלל\n\nהשורה התחתונה: הרצאות משעממות, לא ברור מה יהיה במבחן ומה לא. קורס משעמם אבל הוא חובה אז אין מה לעשות", "timestamp": 1658689758759}, {"author": ".", "difficultyRank": 3, "generalRank": 2, "semester": "202102", "text": "מי שבוחר לעשות את הפרויקט - תבחרו חלק שאפשר לעשות אותו מאלומניום/ פלדה. אל תתחילו להתעסק עם חלקים מפלסטיק כי זה ממש מסבך.", "timestamp": 1663851459367}, {"author": ";", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: אריאל\nחוות דעת - הרצאות:  סבירות, חלקן מועברות בצורה מאוד שטחית, חלקן לא מובנות וחלקן סבבה\n\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: מאוד משקיעה ואכפתית, קצת עייפה\n\nשעורי הבית: לא דורשים המון זמן, יש רפרנסים\n\nהמבחן:  קצת מציק כי יש התקטננות בשאלות האמריקאיות על נקודות ספציפיות, החלק הפתוח לא אמור להיות קשה אם מכינים דף נוסחאות טוב ופשוט עובדים לפי המתכון\n\nהשורה התחתונה: קורס בסדר, לא מאגר יותר מדי, לא מעניין יותר מדי, מי שאוהב את כל החלק המכני של ליצור ולכנן חלקים יותר יתלהב", "timestamp": 1676670794841}, {"author": "שש", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה:  אריאל\nחוות דעת - הרצאות: מועברות בשיטה לא מעוניינת בכלל\n\nשם המתרגל/ת: רז\nחוות דעת - תרגולים: הוא דואג ממש להעביר את התרגול בשיטה מובנת\n\nשעורי הבית: ארוכים יותר מדי, לוקחים הרבה זמן, יש עבודות בית רטובים שצריכים הרבה עבודה ועזרה מיוטיוב, ואת היבשים לא נחמדים כל כך אבל יש רפרנס.\n\nהמבחן: יש שאלות מבוססות על קורס מכינקת מוצקים, ואת החלק הסגור בקושי החזרו שאלה או שתיים, הוא קשה קצת אבל עובר בסוף.\n\nהשורה התחתונה: תעשו את תרגיל המסכם הוא ממש משפיע על ציון סופי.", "timestamp": 1677086960953}, {"author": "...", "difficultyRank": 5, "generalRank": 1, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות: לא שולטת בחומר ומאוד קשה לתפוס אותה כדי לקבוע איתה שעת קבלה - בכלל לא זמינה לסטודנטים\n\nשם המתרגל/ת: טניה \nחוות דעת - תרגולים: מדברת בקול נמוך, לא רואים שהיא שולטת בחומר, עצבנית ובכלל לא מומלצת \nפעם שאלנו אותה בשעת הקבלה שאלה לגבי תרגיל בית, ענתה לנו משהו לא הגיוני ולא נכון(הבנו את זה אחרי המבחן), ואחרי הבדיקה שכמובן קיבלנו ציון נמוך באותו ת.ב היא הכחישה שהיא ענתה לנו ככה  \n\nשעורי הבית: מאוד עמוסים ולוקחים הרבה זמן אך אין מה לעשות הם חובה\n\nהמבחן: מאוד קשה במיוחד בחלק האמריקאי שיש בו שאלות שלא מנוסחות נכון ומטעות והתשובה הנכונה לפיהם היא לא באמת נכונה \n\nהשורה התחתונה:", "timestamp": 1677749128097}, {"author": "--", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: \nהרצאות מיותרות לחלוטין. אריאל ממש מקריאה מהמצגת ולרוב לא יודעת לענות על שאלות במהלך ההרצאה וגם לא טורחת לברר ולהחזיר תשובות. מומלץ לעבור לבד על מצגות ההרצאה ולהיעזר בהקלטות של אוסקר (לשים לב שיש כמה הרצאות של אריאל שלא חופפות לאלו של אוסקר). יחד עם זאת, ההרצאות כן רלוונטיות לחלק האמריקאי של המבחן.\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: מעולה! סופר אחראית ותמיד מוכנה לעזור. מבהירה הרבה דברים שלא היו ברורים בהרצאה.\n\nשעורי הבית: רובם יותר ארוכים ממה שהייתי מצפה, אבל טכני לחלוטין. צריך לעקוב אחרי \"המתכון\" שמקבלים בתרגולים ולרוב זה מספיק. את אחד הגליונות הסמסטר הם חידשו ולא היה רפרנס, וזה היה ארוך באופן סיוטי...\nפרויקט-  לא ללכת כמו דומרים ולעשות אותו. הציונים לא מפרגנים. אם מצבכם במבחן לא יהיה וואו אז זה יכול להועיל, אבל יכולה להגיד שהשקענו חמישה ימים *מלאים* בחציו השני של הסמסטר שהוא גם ככה עמוס, כדי להגיש פרויקט ברמת מינימום אולימפי מבחינתנו (עדיין לא היינו שלמות עם מה שהוגש). בחרנו רכיב שלא עשוי ממתכת ולכן אי אפשר להסתמך על הטבלאות שמוצגות בתרגולים, ובגדול אי אפשר למצוא את הנתונים הנדרשים בשום מקום נגיש בגוגל או בספרות, אז משם התחלנו במלאכת המצאת נתונים. אם אתם רוצים מצפון נקי- אל תבחרו ברכיב שלא עשוי ממתכת! אתם גם תגלו שאחרי לא מעט חישובים החלק שלכם עלול להיכשל, ואז תתכננו אותו לא פעם ולא פעמיים מחדש ותחזרו על החישובים... בקיצור, שוב- לחשוב פעמיים אם לעשות את הפרויקט. עם בערך 4-5 ימי למידה למבחן סיימתי עם ציון נושק לתשעים וקיבלתי את אותו ציון בדיוק בפרויקט אחרי בונוס שניתן למי שהציג את הפרויקט בהרצאה.\n\nהמבחן: צריך לדעת לתקתק את החלק הטכני. הזמן במבחן גבולי אם לא שולטים בטכניקה של התרגולים בצורה מושלמת. חלק אמריקאי- תכינו דף נוסחאות טוב. לא מצאתי דרך טובה באמת להבין את החומר מההרצאות, והגישה הייתה יותר לשנן משפטי מפתח שהופיעו בהרצאות. \n\nהשורה התחתונה:", "timestamp": 1678801567513}, {"author": "נשר נשר", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: אפשר לשים את הקורא אוטומטי של גוגל במקומה, בגדול 90 עמודים מצגת כל הרצאה, לא ברור מה היא מצפה מאיתנו להבין, לא מסבירה כמעט כלום מעבר, חבל שזה קורס חובה בפקולטה.\n\nשם המתרגל/ת: רז מרגי\nחוות דעת - תרגולים: לא יודע איך לאכול אותו, הוא ממש חכם אבל לא יודע להסביר כלום בצורה פשוטה תמיד מסתבך, לוקח לו מלא זמן להסביר דברים פשוטים ואז הוא לא מגיע לחלק הקשה כי נגמר התרגול, קיצר ללכת רק אם אין ברירה\n\nשעורי הבית: יבשים קלים יש רפרנס, רטוב קצת מעצבן אבל מתרגלים \n\nהמבחן: לא היה עוד, נראה לא כיף\n\nהשורה התחתונה: פוטנציאל לקורס גדול מאוד, בפועל נסיון לתת לנו מכל מיני עולמות של מכונות שפשוט מסבך לנו את החיים, לא צריך את זה לתואר למי שלא מתמקצע בביומכניקה, קורס שצריך להיות בחירה סתם כופים עלינו חבל", "timestamp": 1711039441012}, {"author": "^^", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: חבל על הזמן\n\nשם המתרגל/ת: רז / טניה\nחוות דעת - תרגולים: גם ככה שניהם לא מספיקים את כל התרגול\n\nשעורי הבית: סבבה יש אחלה  רפרנס גם\n\nהמבחן: יש התעקשות מאוד גדולה מצד הסגל לא לתת לנו הכוונה למבחן, פתרונות למבחנים ומבחנים משנים אחרונות, האם זה מפתיע? לא, גם ככה כל הסגל הזה כושל \n\nהשורה התחתונה: תשלחו אותם שיעשו את הקורס בפקולטה להנדסת מכונות לא אצלנו", "timestamp": 1712817913163}, {"author": "ביורפואיי", "difficultyRank": 3, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: על הפנים, כל מצגת 90 עמודים שהיא מקריאה כמו אנציקלופדיה, מונוטוני ומשעמם, היא לא מוכנה לבוא לקראת הסטודנטים ולהקליט הרצאות (טוענת שהיא הקליטה והעלתה רק למילואימניקים אבל הם אמרו שלא...), לקראת סוף הסמסטר הביאה מרצה אורח והחליטה שהנוכחות חובה למרות שאסור לה, אין מילים מזעזעת...\n\nשם המתרגל/ת: טניה, רז\nחוות דעת - תרגולים: שניהם סבבה סה\"כ עוזרים להבין משהו ממה שקורה בהרצאות\n\nשעורי הבית: 5 גליונות יש רפרנס כמעט להכל ועוזרים להבין את החומר\n\nהמבחן: כמובן שאריאל החליטה לשים 45 נקודות אמריקאיות על שאלות שהיו בהרצאה האחרונה לסמסטר שהייתה יום לפני מבחן אחר ולכן הרבה לא יכלו להגיע, שאר השאלות גם כן לא להיט יותר פתירות\n\nהשורה התחתונה: קורס המשך למכניקת המוצקים, שניהם פשוט זוועה אחת גדולה עם סגל מזעזע וזריקת זין על הסטודנטים, אין מבחנים משנים קודמות לתרגול, המצגות תרגול בסריקת יד של סטודנטים, לאריאל יש כנראה פינה לא סגורה עם מכונות ולכן דחפה לנו את כל החומר של מכונות בקורס אחד", "timestamp": 1713282086452}, {"author": ".", "difficultyRank": 4, "generalRank": 2, "semester": "202301", "text": "שם המרצה: אריאל\nחוות דעת - הרצאות: באמת שאין תועלת בלהיות בהרצאות\n\nשם המתרגל/ת: רז\nחוות דעת - תרגולים: היחיד בקורס שיודע את החומר כמו שצריך.\nלא המתרגל האידיאלי אבל כן משתדל ומנסה להעביר את החומר.\nאי אפשר לשכוח שגם החומר משעמם ברמות אז די קשה להעביר תרגולים נורמליים\n\nשעורי הבית: קצת עמוסים אבל כן מכינים למבחן וחוזרים על מה שנלמד בתרגול\n\nהמבחן: איכשהו נפלנו על מבחן עם שאלה שכאילו לקחו אותה ממכניקת מוצקים אבל השאלת ברגים הייתה לגמרי פיירית.\nהאמריקאיות לא ממוחזרות בכלל אז תתפללו לטוב\n\nהשורה התחתונה: קורס שלצערנו הוא חובה, הרבה תפילות ומוטיבציה לא לעשות מועד ב יעזרו. תשתדלו שהחומר ממוצקים ישב לכם טוב כדי שלא יפתח פער שכבר קשה לפצות עליו.", "timestamp": 1714380310063}, {"author": "-", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: אריאל פישר\nחוות דעת - הרצאות: הייתי ברובן אבל לא הקשבתי למה שנאמר. יש במבחן שאלות אמריקאיות שמבוססות על ההרצאות (45% מהציון של המבחן), בסופו של דבר הסתדרתי עם הדף נוסחאות אבל אולי כן היה שווה להקשיב ולכתוב בשביל ציון קצת יותר גבוה.\n\nשם המתרגל/ת: טניה\nחוות דעת - תרגולים: טניה מתרגלת בסה\"כ טובה, היא יחסית שולטת בחומר והתרגולים שלה עברו סבבה. התרגולים מאוד חשובים כדי להבין את החומר, לתרגילי בית ולמבחן אז ממש לא הייתי מוותרת עליהם. טניה גם באמת חמודה ואכפת לה מהסטודנטים, משקיעה זמן מעבר.\n\nשעורי הבית: היה בשלישיות. השלושה הראשונים היו בסדר והשניים האחרונים ממש קשים ויש רפרנסים עם טעויות. \n\nפרויקט: סמסטר ראשון שהוא היה חובה. שימו לב לבחור חלק שיש בו רק מתכות (בלי פלסטיק) ורצוי משהו שיש לכם רפרנס אליו. הפרויקט לא קל ומעמיס ודורש הרבה זמן של השקעה, מה שכן הוא עוזר להבין את החומר של הקורס.\n\nהמבחן: היה קשה מאוד! 55% שאלות פתוחות שהיו לא פשוטות. 45% אמריקאיות שראו שאריאל התנקמה בנו על זה שלא באנו להרצאות. צריך דף נוסחאות טוב ולתרגל המווון (תרגולים + מבחני עבר) ויהיה בסדר.  \n\nהשורה התחתונה: הרבה יותר פתיר ממכניקת מוצקים אז לא צריך להיות בלחץ, תלמדו טוב בתרגולים ויהיה בסדר.", "timestamp": 1715021403931}, {"author": "סטודנט.ת שנכח.ה בכל הר. תר.", "difficultyRank": 5, "generalRank": 1, "semester": "202301", "text": "שם המרצה: אריאל\nחוות דעת - הרצאות: סתם בזבוז זמן של שעתיים. לא מתחשבת בסטודנטים.\n\nשם המתרגל/ת: טניה \nחוות דעת - תרגולים: מתרגלת ללא כריזמה, נושמת בקול רם מה שמוציא את הסטודנטים מריכוז, לא משהו, אובררייטד. ציוני הפרויקטים לא משקפים בכלל את ההשקעה וחבל את כל ההשקעה.\n\n\nהשורה התחתונה: לא מומלץ עם הסגל הנוכחי, לא אכפתי ולא מסודר.", "timestamp": 1719307414936}]}