{"posts": [{"author": "קרן", "difficultyRank": 2, "generalRank": 5, "semester": "201902", "text": "במהלך הקורס לומדים רשימה של דרכים לפתרון בעיות ספציפיות. מאוד קל לזהות במבחן באיזה דרך הם רוצים שתשתמשו. תכינו לכם מראש דף שליפים עם ההנחות שיש לעשות בשביל כל השיטות בקורס ותעתיקו את ההנחות הרלוונטיות לשיטה שלכם. הפתרון עצמו זה כמו תוכי להעתיק ממה שהיה בתרגולים/שיעורי בית (לא בעיה כי חומר פתוח) עם קצת התאמות לשאלה. יש במבחן סעיף או שניים של תיאוריה, לא משהו רציני וזה גם לא הרבה נקודות. באופן כללי בודקים את המבחנים באופן דיי לארג'י, לא מורידים הרבה נקודות על טעויות שהסברתם את דרך החשיבה שלהן.", "timestamp": 1597737628269}, {"author": "רנין", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: דפנה ויס\nחוות דעת - הרצאות: מעניינות מאוד, דפנה מקסימה\nמעבירה את החומר בצורה מעניינת\nהיה לי כיף בהרצאות. יש לדפנה גם מוקלט בפנופטו 1:1 למה שמועבר בכיתה\nחומר לא קטן ולא כזה קל אבל סבבה לדעתי \n\nשם המתרגל/ת: סאלי\nחוות דעת - תרגולים: התרגולים היו פחות כיפיים\nלא התחברתי למתרגלת ולפעמים הייתי חוזרת על התרגול בפנופטו(יש שם תרגולים מוקלטות למתרגל אחר והיה בסדר )\n\nשעורי הבית: רלוונטיות מאוד, לא היו עמוסים כי בשיעורי הבית יש שני שותפים אז מתחלקים\n\n\nהמבחן: הוגן ! כמו תרגילי הבית והתרגולים\nלא יהי לך במבחן את התחושה הראשונה של \"איך להתחיל\" \nאם אתה פותר שיעורי בית ומתרגל למבחני עבר ילך לך סבבה\n\n\nהשורה התחתונה: מומלץ , החומר על זרימה הוא לא קל אבל היה מעניין לדעתי וניתן לקבל +80", "timestamp": 1597868123170}, {"author": "אנונימי", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דפנה \nחוות דעת - הרצאות: \nהרצאות מעניינות אבל קצת חסרות מבנה מסודר\nהנושאים מעניינים ומתעסקים יותר בזרימה בכללי \nודפנה מעבירה את הקורס עם כמה סרטונים וזה נחמד.\nשם המתרגל/ת: וג'די\nחוות דעת - תרגולים: \nהמתרגל חדש בהתחלה היה לו קצת קושי להעביר את התרגול,אבל בהמשך הוא השתפר מהר והיה אחלה\nתכלס מתרגל טוב.\nשעורי הבית: \nשיעורי בית בזוגות כל שבוע נפתח תרגיל בית עם 2 שאלות יחסית לא לוקחות הרבה זמן ורמת קושי בינונית.\nהמבחן: \nפה הייתה האכזבה הגדולה!!!!!!!!!\nהמבחן היה ברמה אחרת ממבחנים קודמים ,תכלס 3 שאלות הראשונה הייתה בין בינונית לקשה ואחרונה יחסית קלה.\nוהייתה בעייה בשאלה השנייה כאשר הוגדר משהו בשאלה שסותר מה שלמדנו בהרצאה, וכשסטודנטים שאלו על זה בזמן הבחינה את המתרגלים,כל אחד ענה בצורה שונה וייצר בלבול רחב.\nמדובר בשאלה של 30 נק.\nאפשר לראות את הבעייתיות במבחן בממוצע הנמוך בהשוואה לשנים קודמות למרות שהיה פקטור של 12 נק.\n\nהשורה התחתונה: \nקורס מעניין אבל סיומת מאכזבת,למרות שזו השנה האחרונה בה הקורס מתקיים.", "timestamp": 1626772455943}, {"author": "poiselle", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: \nברורה, וניתן להבין את ההרצאות אם חוזרים טוב על החומר\nשם המתרגל/ת: וג״די\nחוות דעת - תרגולים: \nמתרגל טוב מאוד, יחס טוב עם סטודנטים. מסביר בצורה מעולה\nשעורי הבית: \nקלים ממוחזרים\nהמבחן: \nאכזבה. פשוט סיומת רעה ולא ברמה של צוות שהיה מעולה במשך כל הסמסטר. שאלה 2 כתובה בצורה לא נכונה. במקום לתת פקטור, לחשוב טוב לפני שעושים מבחן. זה באמת מאכזב. הבדיקות היו קפדניות ולא כמו כל קורס שעשינו מקודם. \nמה שדופק יותר זה שאין פתרונות למבחנים. \nהשורה התחתונה: \nמאוד מומלץ לשגע את הצוות באיך לגשת לכל נקודה קטנה בקורס. הקורס עצמו לא קשה בכלל. נוטה יותר לצד הקל. פשוט איתנו רצו לתת רושם כי זה היה 3 ימים אחרי אותות וזו הייתה הטענה שלהם לאיך עשינו במבחן. למרות (למי שעושה הסתברות) שמקדם הקורלציה שואף לאפס לדבר זה.", "timestamp": 1627316034230}]}