{"posts": [{"author": "אסיל נעמה", "difficultyRank": 3, "generalRank": 5, "semester": "201902", "text": "שם המרצה: אוסקרר האלוף אין עליווו\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1599598062497}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 3, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \nלקחנו מעבדה בסמסטר קורונה, אפשר היה לקחת חלק מהמעבדות פרונטלי וחלק וירטואלי. אנחנו עשינו את הרוב פרונטלי ובדיעבד זה היה טעות כי זה דרש הרבה יותר זמן מאשר וירטואלי. אם יש לכם אופציה לבחור- עדיף לעשות וירטואלי. חשוב לי לתת עצה למי שעומד לקחת מעבדה בפעם הראשונה: אתם תהיו ממש בשוק מכמה שזה עמוס (וזה עמוס בטירוף!!!). אל תדחו דברים לאחרכך ותנסו לסיים את הכל כמה שיותר מהר שזה לא ייגרר לסוף סמסטר. חשוב להיות עם יד על הדופק כי יש דוחות שהם באמת סיוט, קשים ולוקחים הרבה זמן. אז תתחילו מוקדם ותסיימו מוקדם. הדוחות לא באמת מתבססים אחד על השני ואפשר לעשות כל אחד מהם בנפרד בלי בעיה.\n\nהמבחן: לנו ביטלו את המבחן וכל הציון התבסס על הדוחות. למרות כמה שהקורס והדוחות קשים, דיי מפרגנים בציונים וגם אם קוטלים אותכם במשוב אז זה לא בהכרח אומר שייתנו לכם ציון נמוך, היו לנו דוחות עם משוב כזה ובסוף הורידו מספר בודד של נקודות. תנסו לעשות את הכי טוב שלכם ואל תתרגשו אם אתם מקבלים משוב שנראה לא טוב. לצערי את הציונים על כל הדוחות אנחנו קיבלנו בסוף תקופת מועדי א' (במהלך הסמסטר מקבלים משוב בלי ציון) אז בעצם כל הסמסטר לא ידענו איזה ציונים נקבל אבל בסוף היה בסדר.\n\nהשורה התחתונה: קורס נחמד שמלמד הרבה על איך כותבים דוחות ומבצעים ניסוי. אין באמת ליווי והנחיה תוך כדי הסמסטר אבל תלמדו תוך כדי עבודה. הרבה מעדיפים לקחת מעבדה בקיץ כדי להוריד עומס במהלך הסמסטר שזה לרוב רעיון טוב. מי שיכול- כדאי. עם זאת, זה לגמרי אפשרי להסתדר עם זה תוך כדי הסמסטר עם ניהול זמנים נכון.", "timestamp": 1629065929834}, {"author": "שגיאה סטטסטית", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: הרבה אנשים לכל ניסוי מדריך\nחוות דעת - הרצאות: איו\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: \nאין\nשעורי הבית: \nדוחות שצריכים הרבה השקעה, האחריאת ל המעבדות החדשה שינתה קצת את הניסויים והוסיפה יותר עבודה לדוחות.\nהמבחן: \nבעל פה תלוי איזה מדריך שואל אותך על הדוח עניין של מזל\nהשורה התחתונה: \nדורש הרבה השקעה שווה יותר מ 2 נקודות לא פייר בכלל", "timestamp": 1656966922720}, {"author": "ביורפואן אקראי", "difficultyRank": 4, "generalRank": 3, "semester": "202102", "text": "שם המרצה: המון אנשים.\nכל המעבדות לא קשות לביצוע, חלקן ארוכות וחלקן קצרות.\n\nדוחות מכינים וסופיים:\nארוכים ושואבי זמן -  B1 , B2 , B3, B6\nסבבה וקלילים - B4 , B5 , B7\n\nהמבחן: \nכ-10 דקות שיחה בזום עם מעביר מעבדה רנדומלי על המעבדה שהוא העביר. צריך להראות שאתה מבין מה עשית בדו\"ח ולא שהשותף עשה את הכל לבד. אין צורך ללמוד את הידע התיאורטי למבחן.\n\nהשורה התחתונה: אחלה קורס, במיוחד שהוא רק 8 מפגשים בסמסטר (הראשון הוא מפגש הכנה). הדוחות לוקחים זמן הכנה רב, גם הקלילים.", "timestamp": 1657296615540}, {"author": "B8", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: יש מדריכים טובים ויש חרא נותנים הערכה 90 כשהם לא נמצאים בכלל או שרושמים הערה שחסר משהו בדוח בשורה שאותו הדבר כתוב. אמרו שיש אפשרות לתקן דוחות אחרי שמקבלים הערות. בפועל המדריכים לא מאפשרים\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: דוחות מסכמים קשוחים. לוקחים הרבה זמן\n\nהמבחן: בע\"פ בזום על אחד הדוחות שהגשת. לקח יותר זמן להיכנס לחדר עם מדריך מאשר המבחן עצמו\n\nהשורה התחתונה: חרא אבל אין ברירה", "timestamp": 1658690908759}, {"author": ";", "difficultyRank": 5, "generalRank": 2, "semester": "202201", "text": "שם המרצה: אין\nחוות דעת - הרצאות:  יוליה האחראית הראשית, לפעמים באה לקראת הסטודנטים, לפעמים יכולה להחליט שלא, אבל בגדול אין הרבה ממשק איתה.\n\nשם המתרגל/ת: יש יותר מדי\nחוות דעת - תרגולים: \n\nשעורי הבית:  הדוחות לוקחים המוווון זמן, זה קורס שלוקח הרבה יותר זמן מכל קורס אחר שעשיתם, אבל לפחות יש רק 7 דוחות אז אפשר לסיים עם הקורס (חוץ מהמבחן) משהו כמו 3 שבועות לפני סוף הסמסטר. \nB1,B4,B5 נחמדים, חזרה על כל החלק של חשמל\nB7- חשיפה לאיך עובדים ניסויים ביולוגיים\nB3- מתיחה וקריסה וזה\nB6- המון המון בהצלחה שיהיה לכם,(הניסוי עצמו קליל שלא תטעו) מומלץ לראות את הסרטון שהוסיפו, אולי קצת יקל.\n\nלא ברור איך ועל מה עובדת שיטת הורדת הנקודות.\n\nהמבחן: גג 5 דקות עם אחד ממעבירי הניסויים, אם אתם יודעים להסביר כל דבר בדוח אין סיבה להסתבך.\n\nהשורה התחתונה: מעיק מאוד, לפחות אבל קצת עובדים עם הידיים.", "timestamp": 1677669537283}, {"author": "י", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "7 ניסויים במהלך הסמסטר שכל אחד מהם דורש בוחן קצר כניסה ודוח מכין ודוח מסכם.\n\nהמתרגלים:\nחלקם טובים ונחמדים מאוד - חלקם רעים מאוד.\n \nדוח מכין: \nלא לוקח הרבה זמן - אבל מעיק\nדוח סופי:\nלוקח יוצר מדי זמן ודורש לכתוב רקע תיאורטי לפי הרקע התיאורטי מתוך דפי המעבדה (בזבוז זמן) ומציגים תוצאות שזה יותר מדי עבודה מייגעת. לא לומדים הרבה דברים מעבר. פה אתם תשכחו מכל החלומות שלכם לבנות את העתיד ותבזבזו את הזמן במקום לעשות דברים חשובים.\n\nהמבחן: \nקצר - כדאי לא להעתיק את כל דוח הסופי כי המבחן בעל פה ושואלים על מה שעשיתם.\n\nהשורה התחתונה:\nאל תשקיעו יותר מדי זמן בדברים שתוקעים אותכם, די ניתן לרפרנס ואפילו מומלץ. תזכרו שפייסבוק זו חברת מליארדים המרופרנסת מחבריו של מארק זוקרברג.\n\nזה יחסית לוקח יותר זמן מקורס של 2 נק׳", "timestamp": 1679661615000}, {"author": "שלושת רבעי מהנדס", "difficultyRank": 5, "generalRank": 2, "semester": "202301", "text": "שם המרצה: \nחוות דעת - הרצאות: לקחו קורס שיכל להיות סבבה והפכו אותו לסיוט, הכמות זמן שהולכת על הדוחות האלה זה הזייה אבל בסוף זה נגמר. חלק מהניסויים נחמדים, פשוט הכמות זמן שהולכת על הקורס הזה לא נורמלית. רפרנסו\nאם יש לכם זמן תעשו דוחות הכנה לפני הסמסטר \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: עוד לא היה \n\nהשורה התחתונה: Pffffffff", "timestamp": 1713339967458}]}