{"posts": [{"author": "Shes345", "difficultyRank": 1, "generalRank": 2, "semester": "202001", "text": "שם המרצה: דפנה וויס\nחוות דעת - הרצאות: \nהרבה מאד מידע שחוזר על עצמו, מועבר בצורה לא מסודרת ולא ברורה ובעיקר לא ברור מה רלוונטי מה ולא. \nיש הקלטה של ההרצאות. \n\nשם המתרגל/ת: שני כהן\nחוות דעת - תרגולים: \nבעיקר הקראה של מה שכתוב במצגות. \n\nשעורי הבית: \nממוחזרים.\n\nהמבחן: \nאין דרך ללמוד למבחן- אין מבחנים משנים קודמות או סריקות. צוות הקורס גם לא מפרסם פתרון למבחן, ככה שגם אי אפשר להבין איפה טעית. מקשה מאד על הלמידה, עד כדי בלתי אפשרי.\n\nהשורה התחתונה: \nקורס שמאסף נושאים שנלמדים בקורסי חובה שונים: חומרים רפואיים, ביוכימיה, זרימה. אין הרבה חידוש. החומר מועבר בצורה כללית ולא מאד מעניינת. אין איך ללמוד לקראת המבחן בהיעדר תרגילים או מבחנים.", "timestamp": 1613391203462}, {"author": "-", "difficultyRank": 3, "generalRank": 1, "semester": "202201", "text": "שם המרצה: דפנה וייס\nחוות דעת - הרצאות: המון חומר שלא תמיד קשור למה שמופיע תכלס בתרגולים. חלק מהחומר כן מופיע בתרגולים, אבל הרבה לא.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: חומרי התרגול ישנים ולא מעודכנים. המצגות מכילות טעויות (גם ברמה של חישובים וגם ברמה של שגיאות כתיב) שמעידות על כך שאף אחד לא עדכן או בדק אותן המון זמן. נראה שהמתרגלים פשוט מעבירים אותן מאחד לשני מבלי להשקיע טיפה מחשבה ולבדוק האם כדאי לתקן משהו. אני ראיתי בזה זלזול בסטודנטים. בסוף הסמסטר המתרגלת אפילו לא טרחה לפרסם פתרונות רשמיים לכל הגיליונות.\n\nשעורי הבית: ממוחזרים. בדרייב של ביורפואה יש פתרונות מלאים של סטודנטים משנים שעברו. \n\nהמבחן: \n\nהשורה התחתונה: קורס לא מומלץ בכלל. אם המתרגלים משנה לשנה פשוט מלמדים את הקורס כדי לצאת ידי חובה ולא כדי ללמד את הסטודנטים, אז איך הסטודנטים אמורים ללמוד משהו? אם יש טעויות חישוב בסיסיות בחומרי התרגול, איך סטודנטים אמורים ללמוד למבחן כמו שצריך? אם סגל הקורס לא משקיע את המאמץ המינימאלי בסטודנטים, אז אין סיבה שהסטודנטים יבואו לקורס, מאחר וזה קורס בחירה. גם ככה נראה שעצם ההוראה בקורס היא עונש, אז אולי כדאי לעשות לסגל הקורס טובה ופשוט לתת להם כמה סמסטרים בלי סטודנטים בכלל.", "timestamp": 1677624194187}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: לדעתי משעממות ומיותרות - אין חומר חדש שנלמד בהן . למדתי מסיכום בדרייב\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: תרגולים לא מעודכנים - אבל מספיקים בשביל הבנה של החומר. לא כל כך קשה ללמוד אותם לבד אפילו. \n\nשעורי הבית: משוחזרות ויש ריפרנס בדרייב - כן עוזרות בלהבין איפה אנחנו מבחינת הבנה בקורס. יש 6 הגשות בסמסטר\n\nהמבחן: לא קשה - מספיק תרגולים וסיכום - ציונים טובים ( ממוצע המבחן היה מעל 80 ) \n\nהשורה התחתונה: לא כל כך מעניין אבל גם לא משעמם. לא דורש השקעה בסמסטר. קליל וניתן לסיים על ציון טוב . אבל מעצבן שאין מאיפה ללמוד למבחן . יש את התרגולים ופירסמו קובץ יש בו כמה שאלות לדוגמא וזה הוא..", "timestamp": 1678885572127}, {"author": "--", "difficultyRank": 2, "generalRank": 4, "semester": "202201", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: הרצאות חביבות, מדגימה הרבה על תרופות קיימות\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: מקסימה, ברורה\n\nשעורי הבית: ניתן לרפרנס\n\nהמבחן: כמו השיעורי בית\n\nהשורה התחתונה: קורס מומלץ", "timestamp": 1686054175966}, {"author": ".", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דפנה וייס \nחוות דעת - הרצאות: מיותרות , חומר חמוד ומעניין, היה דרך הזום \n\nשם המתרגל/ת: איילת ואמיר (מדריך פרויקט)\nחוות דעת - תרגולים: איילת לא ממש מסבירה טוב , אבל נחמדה, ניתן לקרוא את התרגולים וזה אותות דבר לעומת ההסברים שלה. \nאמיר - מדריך הפרויקט , מפגין יחסי אנוש יותר טוב ,מסביר טוב ובצורה מעניינת , ותמיד עונה על המילים והשאלות , חבל שלא היה המתרגל במקביל לאיילת\n\nשעורי הבית: קלות מאוד .1 ל1 לתרגולים\n\nהמבחן: אין - יש פרויקט \n\nהשורה התחתונה: כדאי מאוד ,קורס קל", "timestamp": 1711010088880}, {"author": "סטודנט", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: יש הקלטות מסמסטרים קודמים. לא צפיתי ברוב.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: מקסימה ומסבירה את החומר טוב, התרגולים בלי ההרצאות הספיקו כדי לכתוב את הפרויקט.\nאיילת מאוד נחמדה ושמחה לענות על שאלות. ניכר כי חשוב לה שהסטודנטים יבינו ויצליחו בקורס.\n\nשעורי הבית: שאלות רב ברירה, קל.\n\nהמבחן: פרויקט במקום מבחן\n\nהשורה התחתונה: קורס נחמד ולא דורש הרבה השקעה", "timestamp": 1714544482010}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: הרצאות מוקלטות, לא צפיתי.\n\nשם המתרגל/ת: איילת ואמיר\nחוות דעת - תרגולים: הקליטו בנוסף ללייב, לא צפיתי.\nכן היו מאוד נעימים כשביקשנו עזרה, גם במייל וגם באחד על אחד.\n\nשעורי הבית: 4 גיליונות אמריקאים במודל, נראה שחלקם נלקחו משיעורי עבר. לא קשים אבל כן דרשו הרבה גוגל.\n\nהמבחן: הסמסטר פעם ראשונה ללא מבחן. במקום היה פרויקט בחמישיות, שהיה ניתן להתחיל כבר בתחילת הסמסטר ולהגשה בתום מועדי א'. התחלנו באמת בתחילת הסמסטר, מה שהוריד מאיתנו עומס בצורה מאוד משמעותית. הפרויקט לא היה מוגדר בצורה הכי טובה, אבל נראה שקיבלו מגוון יחסית רחב של רמות פירוט.\n\nהשורה התחתונה: במתכונת הזאת מאוד נוח כדי לסגור מגמת רקמות.", "timestamp": 1716888113949}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: לא הייתי\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: צפיתי בהקלטות\n\nשעורי הבית: במודל, חלק מהשאלות לא ברורות והתשובות לפעמים סותרות אחת את השניה. אחרי התייעצות ושבירת ראש עם מלא סטודנטים שונים מתוך 5 גליונות של שאלות אמריקאיות במודל קיבלתי ב-2 מהם 80 ובאחד 70. באסה\n\nהמבחן: לא היה, הגשנו פרויקט בקבוצות של 5 שעבדנו עליו יומיים סהכ. קיבלנו 100 \n\nהשורה התחתונה: קליל", "timestamp": 1717224647854}]}