{"posts": [{"author": "שם", "difficultyRank": 4, "generalRank": 5, "semester": "201802", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: לא הכי ברור, מאוד קשה להבין איפה המשפט נגמר והבא מתחיל ולכן קצת קשה להבין לאן הוא חותר בחלק מהנושאים, אבל התרגול ממש מסדר את זה\n\nשם המתרגל/ת: ז'ואל חלפון (עזבה וכבר לא תתרגל)\nחוות דעת - תרגולים: מהממת, באמת עשתה מעל ומעבר כדי שנבין והתרגולים עצמם כתובים מעולה ועוזרים להפנים את ההרצאות וההגשות מותאמות גם למטרה זו\n\nשעורי הבית: קצת עמוסות אבל מאוד עוזרות להבין את הקורס\n\nהמבחן: מבחן קצת מוזר, יוצאים בהרגשה לא משהו ממנו אבל הרוב מקבלים ציונים טובים, אמיר כותב בעיתי של שאלות, ובגלל שעם חומר פתוח הם לפעמים שואלים על נישות קטנות בחומר, אבל הבדיקה מתקנת את זה אז זה בסדר\n\nהשורה התחתונה: קורס מאוד מעניין וחשוב, למרות ההרצאות הפחות מועילות, השתמשתי במהות של הרבה ממה שנלמד בו, הוא עושה סדר בהרבה תחומים ואני חושבת שהוא צריך הליות קורס חובה. אני חששתי ממנו מאוד לפני שנרשמתי אבל המליצו לי עליו ואני ממש שמחה שעשיתי אותו.", "timestamp": 1600858576415}, {"author": "-", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: אמיר לנדסברג\nחוות דעת - הרצאות: הרצאות מעניינות בסך הכל לדעתי, לפעמים קצת קשה לעקוב אחריו, בעיקר אם ההרצאה ב-8 וחצי בבוקר, אבל חשוב להגיע אליהן.\n\nשם המתרגל/ת: ניסים וטורי\nחוות דעת - תרגולים: מתרגל מצוין, ממש עושה סדר בהכל ומסביר ברור מאוד.\n\nשעורי הבית: 4-5 תרגילי בית ארוכים מאוד אבל ממוחזרים, יש להם רפרנסים. בכל מקרה כדאי להשקיע בלהבין אותם כי הרבה מהשאלות דומות למבחנים ואפילו לקוחות מהם.\n\nהמבחן: מבחן קשה, יחסית הוגן, אבל יותר מדי שאלות בקצת מדי זמן. המבחנים של אמיר ידועים כקשים אבל גם ידוע שהוא בסוף מתקן את זה עם פקטור נכבד והממוצע תמיד גבוה מ-80.\n\nהשורה התחתונה: לדעתי קורס ממש מעניין וחשוב, לומדים המון על מידול של מערכות פיזיולוגיות, מידול בכלל, כמובן את הבסיס של בקרה ורואים איך הכל משתלב ביחד בצורה הנדסית. כדאי ממש לעשות את ההסמכה של on-ramp של סימולינק בתחילת הסמסטר, זה 2-3 שעות השקעה לכל היותר וממש 5 נקודות בונוס מתנה לציון הסופי. היה אמור להיות פרויקט בנוסף למבחן הסופי, אבל בסוף לא הספיקו לכתוב אותו אז זה בוטל, כנראה יהיה למחזור הבא, היה נשמע דווקא שהוא מלמד.", "timestamp": 1677922392636}, {"author": "donad ramp", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: אמיר\nחוות דעת - הרצאות: כשהמבחן עם חומר פתוח בדגש יותר מתמטי אז אמיר פחות בעייתי מפיזיולוגיה, לדעתי כמרצה הוא היה בסדר.\n\nשם המתרגל/ת: ניסים\nחוות דעת - תרגולים: סבבה\n\nשעורי הבית: יבשים קצת ארוכים אבל יש רפרנס להכל. הוסיפו לנו פרויקט שדרש לא מעט זמן וביחד עם היבשים יצא לא מעט זמן השקעה במטלות\n\nהמבחן: מוזר, חלק בקרה פרופר וחלקים לפי יד היוצר של אמיר, אבל בסוף הוא נותן פקטורים והממוצע יוצא סבבה.\n\nהשורה התחתונה: הקורס עצמו לא מסובך, לא מחדש הרבה כשילוב של אותות ומערכות ופיזיולוגיה, החידוש בעיקר מגיע מהמידול המתמטי של מערכות בגוף. היחס סביב המבחן היה מעצבן (אין כמעט פתרונות למבחני עבר, לא מסכימים לפרסם פתרון רשמי, ועוד כל מיני). בסוף יוצא סבבה ואני חושב החומר נחמד אבל יחסית עמוס", "timestamp": 1691874084120}]}