{"posts": [{"author": "פקיניאן", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יעל יניב, לימור פרייפלד, ענבר ברוש\nחוות דעת - הרצאות: כל הקורס הוא בכיתה הפוכה, למרות שכבר היה סמסטר היברידי. חלק מההקלטות של המרצות באיכות שמע גרועה, ההרצאות של לימור ארוכות ומייגעות. אחרי שצופים בהקלטה של הרצאה יש כיתה הפוכה שאפשר להגיע לשאול שאלות. אחרי כל כיתה הפוכה יש בחן לציון מגן.\n\nשם המתרגל/ת: לימור, נועה\nחוות דעת - תרגולים: היו גם תרגולים מוקלטים וגם בלייב. ההקלטות היו בדרך כלל באיכות גרועה, עוברים על שאלות אמריקאיות ממבחנים, נחמד\n\nשעורי הבית: 6 גיליונות של שאלות אמריקאיות במודל\n\nהשורה התחתונה: קורס שציפיתי לו הרבה במהלך התואר וחשבתי שיעניין, בפועל זה ממש לא ככה. האופן שהקורס מועבר הרס את החוויה. הרצאות משעממות ומייגעות לפעמים, והקונספט של הכיתה ההפוכה רק מעיק ומבזבז לסטודנטים יותר זמן.", "timestamp": 1626097046102}, {"author": "אההמממ", "difficultyRank": 5, "generalRank": 1, "semester": "202002", "text": "שם המרצה: לימור\nחוות דעת - הרצאות: \nעל הפרצוף לא מובנת בכלל. באופן כללי ההתנהלות של הקורס והסגל מאוד גרועים.\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים: \nבזבוז זמן, פשוט הקראה של המצגת. גם יש כולה 6 תרגולים\nשעורי הבית: \nהכל מרופרנס, יש אולי 2 שאלות חדשות בגיליון. בכל הרצאה עושים בוחן שגם לו יש רפרנסים לרוב\nהמבחן: \nלשנן לשנן לשנן, מלא חומר לשנן, מלא שאלות לא מנוסחות טוב ומבוטלות. יש סיכוי לציון סבבה אם יש זיכרון טוב\nהשורה התחתונה:  קורס חובה=נדפקתם. קורס של 3 נקז שלוקח זמן כמו 5 נקז", "timestamp": 1626604940579}, {"author": "שם", "difficultyRank": 3, "generalRank": 2, "semester": "202002", "text": "הרצאות: יש יותר הרצאות מתרגולים ולכן חשוב לא לתכנן בהרשמה לקורס לפספס את כל התרגולים כי התרגולים נופלים על יום מסויים - כי ימי ההרצאות וימי התרגולים מתחלפים ביניהם במהלך הסמסטר ויכול להיות שבועות שיש בהם שני הרצאות בשבוע.\nשם המרצה: יעל יניב\nחוות דעת - הרצאות: מובנות, באיכות טובה והיא ממש מקפידה על כך שהשעות של הקלטות + הכיתה ההפוכה יהיו לכל היותר שעתיים.\nשם המרצה: לימור פרייפלד\nחוות דעת: הקלטות ארוכות ומעשעממות וקשות להבנה, כיתות הפוכות ארוכות ומשעממות\nשם המרצה: ענבר הרוש\nחוות דעת: בהקלטות שלה תמיד יש המון בעיות כמו הפניה לקישור שדורש אימייל אחרי זמן מה, איכות גרועה, קטיעות בהקלטה\n\n\nשם המתרגל/ת: נועה קירשנר\nחוות דעת - תרגולים: סבבה, אבל התרגולים הם בדיוק כמו בהקלטות, אז אין טעם לבוא אליהם\n\nשעורי הבית: לרוב מרופרנסים \n\nהמבחן: אמריקאי, אך אין אפשרות לראות את המבחנים משנים הקודמות, הצוות ממש מתנגד לכך! יש בדרייב שחזורים מ2009 שאפשר להשתמש בהם כדי ללמוד למבחן (עם תשובות). מומלץ   לעבור על ההרצאות, תרגולים, הסיכום של פאוזי כדי ללמוד למבחן (וכל מה שיש בדרייב)\n\nהשורה התחתונה: הקורס מועבר בכיתה הפוכה - כלומר - צופים בהרצאות המוקלטות מראש, מגיעים לכיתה לשעת קבלה ארוך ומעצבן ואז אח\"כ יש בוחן. גם התרגולים בכיתה הפוכה - שם צופים בהקלטות של התרגול קודם ואז מגיעים לכיתה ומועבר את אותו תרגול בדיוק רק בלייב. כמות הזמן המושקע בקורס (צפיה בהקלטות, הכיתות ההפוכות לא מתאימות ל3 נק\"ז שניתן לקורס, משקיעים הרבה יותר.\n**אם הקורס הזה הוא לא קורס חובה בשבילך - אל תיקח/י אותו! זה לא קורס שאת/ה מרגיש שיש לך את כל הכלים להצלחה**", "timestamp": 1627022150716}, {"author": "H&H", "difficultyRank": 3, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: \nמשקיעה בהרצאות המוקלטות לא לוקחות הרבה זמן,בכיתה ההפוכה מבלבלת את המוח לפעמים.\nשם המרצה: לימור פרייפלד\nחוות דעת - הרצאות: \nהקלטות ארוכות ומשעממות אין כל כך מלל בשקופיות והיא מדברת הרבה בהקלטות,וגם בכיתה הפוכה ההשיעורים נמשכים להרבה זמן\nשם המרצה: ענבר ברוש\nחוות דעת - הרצאות: \nהקלטות מבינת זמן סבירות,מבחינת תוכן לא טובות תמיד יש תקלות והסגל לא משקיע לתקן אותם.והיא אשקרא קוראת מהדף וזהו!\nשם המתרגל/ת: אין לי מושג\nחוות דעת - תרגולים: \nלא נכחתי קצת מיותר\nשעורי הבית: \nיעני בסדר לא עמוסות\nהמבחן: \nהביאו מבחן לא פייר עם 2 שאלות שהתבטלו ולא כל כך עזר הממוצע יחסית נמוך.\nלא היה מבחנים קודמים ללמוד אליהם הסגל מתנגד לפרסם אותם.\nכאילו שהם לא בא להם לכתוב שאלות חדשות נראה לי שיש דברים יותר חשובם להם מאשר קורס של נוירו וביופיסיקה.\nהשורה התחתונה: \nהחומר הוא סופר מעניין כאליו זה נוירו סאייינס,כדאי להיעזר מתכנים מיוטיוב,לא להשקיע זמן בכיתות הפוכות.\nלפי דעתי צריך שהסגל ישקיע יותר בהנהלת הקורס,חבל שהוא מועבר הצורה לא מעניינת.", "timestamp": 1627454878775}, {"author": "ANIMAL LOVER", "difficultyRank": 2, "generalRank": 3, "semester": "202002", "text": "שם המרצה: יעל, לימור, ענבר\nחוות דעת - הרצאות: ההקלטות של ההרצאות של יעל היו ממש טובות. החומר הועבר בצורה ברורה, מהירה, ישר לעניין.\n\nשם המתרגל/ת: לימור\nחוות דעת - תרגולים: לימור מתרגלת מצטיינת מתמידה, ברור שיש סיבה מוצדקת להיותה מצטיינת, אבל לצערי לא הרגשתי את זה בהקלטות שלה - פשוט היה אפשר לקרוא את ההערות במצגות ולקבל אותה תוצאה.\n\nשעורי הבית: יש רפרנס להכל כמעט. גם למבחנים. ממליצה להבין את שיעורי הבית טוב, יכולות להופיע גם במבחן.\n\nהמבחן: \n\nהשורה התחתונה: לכל אחת מחברות הסגל יש ידע שעזר לה להתקדם בחיים שלה, וניתן לראות את זה ממש ברור. אבל לצערי היחס שנתנו לנו כסטודנטים היה על הפנים. הבקשות שלנו לרוב קיבלו תשובה שלילית. אפשר להבין שכל אחת מהן עסוקה במעבדות ומחקרים שיצילו את העולם, ואין באמת זמן למלא תפקיד \"צנוע\" כמו מתרגל או מרצה. מכבדים אותן אבל לדעתי צריך לצאת מאזור הנוחות שלהן ולדבר עם הסטודנטים בגובה עין. זאת לא בושה להיענות לסטודנטים, זאת לא בושה להיות גמישים או אוזן קשבת.", "timestamp": 1627551916215}, {"author": "Jeries Saleh", "difficultyRank": 3, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יעל, לימור, ענבר\nחוות דעת - הרצאות: \nיעל הייתה סבבה, אפשר להבין מה היא רוצה, למרות שבהתלה זה לא נשמע מובן.\nלימור היו לה הרצאות ארוכות וצריכות הרבה חזרות על ההקלטות כדי להבין את כל המלל, אבל לטובת מי שעושה את הקורס בהמשך, יש סיכומים שנעשו (אני ועוד חברים עשינו אחד מהם) שהם תמלול של ההרצאות שלה, אז זה יעזור לכם.\nענבר: בסדר בסהכ\nשם המתרגל/ת: נועה ולימור\nחוות דעת - תרגולים: \nלא משהו.. לא כזה מוסיפות להבנת החומר\nשעורי הבית: \nיש כמה גליונות שרובם מרופרנסות, לא משהו קשה במיוחד.\nהמבחן: \nאמירקאי, אם יודעים את החומר אפשר לסיים אותו בחצי שעה. צריכים להתכונן היטב וללמוד במהלך הסמסטר. זה דומה לקורסי רפואה בעניין של active recall\nהשורה התחתונה: \nמגניב כי החומר ממש מעניין וצריך השקעה בינונית במהלך הסמסטר והשקעה גדולה לקראת המבחן.", "timestamp": 1634653388708}, {"author": "-", "difficultyRank": 5, "generalRank": 2, "semester": "202002", "text": "שם המרצה: יעל יניב, לימור פרייפלד\nחוות דעת - הרצאות: \nמתישות, הפורמט של הכיתה ההפוכה גורם לכל הרצאה לקחת הרבה יותר זמן מהשעות שמוקצות לזה במערכת. ההרצאות מלאות במידע שנאמר בעל פה ולא כתוב במלל, ומצריכות סיכום, ולכן הצפייה בסרטונים לוקחת הרבה מאוד זמן. הנושאים מעניינים, אבל ההרצאות מצליחות להיות משמימות בטירוף, לגמרי חבל.\nשם המתרגל/ת: נועה קרישנר\nחוות דעת - תרגולים: \nיש מעט מאוד תרגולים בקורס, והם ברמה מאוד שטחית ביחס להרצאות, לא מהותיים.\nשעורי הבית: \nשאלות במודל, יש רפרנסים כמעט להכל, לפעמים הניסוחים מעצבנים והסגל לא כזה עוזר.\nהמבחן: \nאמריקאי מלאאא בניסוחים מעצבנים, קשה ללמוד כי לא מפרסמים מבחני עבר.\nהשורה התחתונה:  קורס שהיה יכול להיות מוצלח, הכיתה ההפוכה עושה לו עוול.", "timestamp": 1635585462774}, {"author": "Anne Onimus", "difficultyRank": 2, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יעל\\לימור\\ענבר\nחוות דעת - הרצאות: זה פשוט מדהים לדעתי איך 3 מרצות שונות מעבירות קורס שיכול להיות כל כך מעניין, ואף אחת מהן לא יודעת לא ללמד ולא להתייחס לסטודנטים. בדרך כלל אני סופר מפרגנת במשובים ורואה את הטוב בכל קורס אבל הסגל של הקורס הזה זה ההגדרה המילונית לאנשים שקמים כל בוקר ובוחרים באלימות. ההרצאות הועברו בצורה לא מובנת, המון ניימדרופינג של מושגים מתמטיים לא ברורים, יש ציפיה שתדעו מושגים שנלמדו בקורסים שנמצאים לפני הקורס הזה במומלצת אבל הם בכלל לא קדם לקורס (בעיקר מדר, פוריה ומכניקה). \nהרבה מההרצאות הועברו בצורה מונוטונית ולא ברורה, הרבה דברים שקריטיים להבנה והופיעו במבחן לא הוסברו אלא הסגל ציפה שפשוט נקרא בין השורות ונבין לבד, וההתנהלות בפן הלוגיסטי הייתה בכלל מתחת לכל ביקורת. (למשל, להעביר את ההרצאה לכיתה עם רק 50 מקומות אבל לסרב לפתוח זום או למצוא כיתה שתכיל את כל הסטודנטים).\nגם היחס לסטודנטים היה ביזיוני.\nמה שכן, היו הקלטות משנים קודמות וזה מאוד עזר.\n\nשם המתרגל/ת: לימור\nחוות דעת - תרגולים: לימור מסבירה מעולה ובזכות התרגולים שלה הבנתי את החומר, מומלץ מאוד כדי לחדד את ההבנה ולהבין טוב יותר איך לגשת לשאלות בשיעורי בית ובמבחן.\nגם היחס שלה לסטודנטים לא וואו, אבל מבחינת יכולות הוראה אין עליה בעולם.\n\nשעורי הבית: ממוחזרים ברובם, גיליונות אמריקאיים במודל. דומים מאוד למבחן, ברמה ששאלה שהופיע בשב השנה\\משנים קודמות יכולה להופיע במבחן. אבל הניסוחים מעצבנים ולפעמים פשוט לא ברור מה כותב השאלה רוצה לשאול ומה התשובות אומרות וצריך לשאול את הסגל כל פעם.\n\nהמבחן: הרבה ממוחזר ודומה לשיעורי בית, אבל זה לא מונע ממנו להיות שואה גרעינית. הניסוחים מעצבנים ולא ברורים, וזה ממש נראה שהסגל בא להכשיל ולא לבדוק הבנה בחומר. הרבה שאלות תלושות לגמרי ולא קשורות לחומר שנלמד בקורס עצמו, חלק מהשאלות היו על חומר שקשור לקורס אבל לא ברור איך או מתי זה נלמד או הוזכר בכלל, וחלק מהשאלות במבחן היו בכלל על חומר של קורסים קודמים(!!) כמו פוריה ואנטומיה.\nחשוב!!!! הסגל יגיד לכם שאם תצטרכו נוסחה במבחן הוא יכתוב לכם אותה, ושאין צורך לשנן נוסחאות אבל כן להבין את ההיגיון והפיתוח מאחורי. לא להקשיב להן! תשננו את כל הנוסחאות!! בשאלות הבנתיות שמתבססות על הנוסחאות, לא מביאים אותן.\nואל תשכחו מחשבונים למבחן.\n\nהשורה התחתונה: סגל לא קשוב והרצאות קשות להבנה בגלל האופן שבו הן מועברות, תרגולים מועברים טוב ואפילו מעניינים. \nהמבחן מזעזע, צריך ללמוד לפניו היטב ולשנן את כל מה שנאמר בהרצאות ובתרגולים+ את כל השיעורי בית והמבחנים משנים קודמות שאפשר. וגם אז לא בטוח שתקבלו ציון טוב.\nאבל, יש פורום שאלות והקלטות משנים קודמות מה שמאוד שימושי.", "timestamp": 1658349878397}, {"author": "~", "difficultyRank": 3, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעל יניב, לימור פרייפלד, ענבר ברוש\nחוות דעת - הרצאות: בסך הכל החומר של הקורס מעניין ממש, אבל הוא מועבר בצורה גרועה ומשעממת ברמות. יש כיתות הפוכות שלוקחות פי 2 מהזמן של ההרצאות, ובסה\"כ נראה שלא כל כך אכפת לסגל מרמת ההוראה בקורס. מההרצאות של פרייפלד מצופה לדעת כל פיפס קטן כי על כל דבר יכולים לשאול במבחן, שהן כמובן ההרצאות הכי פחות ברורות. היחס של המרצות לסטודנטים פשוט מאכזב, מתייחסים אלינו כנטל והתשובות שקיבלנו על בקשות הן בהתאם.\n\nשם המתרגל/ת: לימור\nחוות דעת - תרגולים: מתרגלת חמודה ממש. היה לה חשוב שנבין והייתה עונה לכולם על כל השאלות אבל לא תמיד הראתה בקיאות בחומר שהיא מתרגלת. בסך הכל התרגולים מאוד עוזרים להבין את הקורס בעיקר בחומר של פרייפלד.\n\nשעורי הבית: קלילים וממוחזרים, רמה של שאלות ממבחנים אז מומלץ לפתור.\n\nהמבחן: עד עכשיו השאלות היו מאוד ממוחזרות משנה לשנה, והופיעו גם בשיעורי בית. השנה החליטו להפציץ והביאו שאלות שמעבר לזה שהן לא ממוחזרות, בחיים לא נתקלתי במבחן עם כזו ירידה לפרטים על דברים שרק נאמרו כבדרך אגב בהרצאה.\n\nהשורה התחתונה: מתבסס על המון ידע מקורסים קודמים, ולקראת המבחן צריך פשוט לשנן ולחזור על החומר 1000 פעם עד שמשהו נקלט, כולל את כל הנוסחאות והפיתוחים מההרצאות כי יש שאלות בסגנון על מה מסמל X בנוסחה Y.", "timestamp": 1658750057329}, {"author": "סמוך על סול", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: 3 מרצות\nחוות דעת - הרצאות: היה חלק של כיתה הפוכה, לדעתי היה על הפנים, ההקלטות ברורות סך הכל אבל כל הרעיון מיותר בעיניי ומבזבז זמן. הייתה מרצה פרונטלית משעממת ברמות דווקא בחומר הכי מעניין (המוח ומערכת העצבים), היה מאוד קשה לעקוב אחריה והרבה אנשים היו צריכים לחזור על החומר בדרך כזו או אחרת, והמרצה השלישית (למידה וזיכרון) הייתה הכי סבבה שם, גם לפעמים טיפה מפוזרת אבל סך הכל סבבה.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: כל המתרגלות סבבה\n\nשעורי הבית: סבבה, מטלות במודל, שאלות בסגנון המבחן, לא יותר מידיי\n\nהמבחן: המבחן היה נחמד, רמה פחות או יותר של הש.ב. \n\nהשורה התחתונה: הם ממש צריכים להתאפס על עצמם ולהעביר את הקורס הזה יותר מסודר אבל החומר לרוב מאוד מעניין", "timestamp": 1660726003005}, {"author": "מישהו", "difficultyRank": 2, "generalRank": 3, "semester": "202102", "text": "שם המרצה: יעל יניב ולימור פרייפלד\nחוות דעת - הרצאות: המרצות, במיוחד יעל, עם יכולת הסברה לא הכי טובה. בהרצאות של יעל מרגיש שלא מועבר הרבה חומר אבל אז מתברר שכל מילה הכי קטנה שהיא אמרה יכולה להיות במבחן. בהרצאות של לימור מועבר יותר חומר אבל יותר קל להבין מה חשוב ומה לא (הכול חשוב).\n\nשם המתרגל/ת: לימור\nחוות דעת - תרגולים: התרגולים קצת מיותרים.\n\nשעורי הבית: לא קשים ולא לוקחים הרבה זמן ועדיף להתחיל אותם ישר אחרי ההרצאה או התרגול כשעוד זוכרים את החומר.\n\nהמבחן: צריך להתכונן טוב כי שואלים במבחן על דברים קלים וגם יש שאלות לא ברורות עם תשובות לא ברורות.\n\nהשורה התחתונה: קורס בסדר. קורס יסודי שמסביר דברים בסיסיים שטוב להכיר.", "timestamp": 1660820437243}, {"author": "דנה", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: 3 מרצות, הזיה כולם\nחוות דעת - הרצאות: \nכל אחת עושה חלק מהחומר, יעל עם הכיתה ההפוכה בסוף יוצאת הכי מובנת. החלקים של הזיכרון ולמידה ונוירופיסיולוגיה תיעזרו בזיכומים\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: \nלא באמת עזרו והרבה פעמים בלבלו, הדס ממש נחמדה אבל הרבה פעמים אמרה משהו הפוך מההרצאה וזה רק בלבל\nשעורי הבית: \nעדיף לעשות לבד, בסוף הם באותה רמה של המבחן\nהמבחן: \nמזעזע, גם מי שסיכם הכל ולמד שבוע יצא בתחושה נוראית. מבחן של שינון עשרות עמודים. שאלות מכשילות בכוונה וניסוחים גרועים\nהשורה התחתונה: לא עמוס בסמסטר, עדיף להיות כמה שיותר על זה במהלך הסמסטר ולהבין את החומר. לא לזלזל בלמידה למבחן בכמה זמן צריך אם רוצים ציון גבוה", "timestamp": 1690216667232}, {"author": "--", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "שם המרצה: יעל יניב, לימור, ענבר\nחוות דעת - הרצאות: \nנתחיל מהטוב כי מפה זה רק ידרדר.\nההרצאות של ענבר יחסית מעניינות והיא משלבת סיפורים על כל מיני ניסויים ואם מתרכזים אפשר להבין אותה יחסית סבבה. \nיעל יניב- חושבת שאנחנו בטירונות. השיעור עובר בעצבים, אם היא שואלת שאלה על משהו שלמדנו לפני שנייה ולא עונים לה ישר היא מתעצבנת, ובאופן כללי היכולת העברת שיעור שלה גרועה ממש. שלא נדבר על זה שהיא החליטה גם פה לעשות כיתה הפוכה וכמובן לבזבז לנו 5 שעות בשבוע במקום 2 כי אם אפשר אז למה לא?\nלימור- מאוד מאוד משעממת. מדברת בשקט ובעיקר לעצמה, זורקת מושגים הזויים שבחיים לא שמענו במהירות ובמלמול, חושבת שאם היא אמרה לפני 4 שיעורים איזה מושג אנחנו נזכור אותו במאתיים אחוז. חושבת שזה אפשרי להעביר הרצאה על שלמה על נוירופיזיולוגיה תוך שעתיים ונבין הכל לרמת השמות של כל פיפס שהיא אמרה. הזוי. \n\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים:  באופן כללי הדס יחסית סבבה ומצליחה לעשות סדר בהרצאות אבל הרבה פעמים היא הייתה קצת מבולבלת והיו במצגת טעויות או שהיא אמרה לנו משהו אחד בשעת קבלה ומשהו אחר לחלוטין אחר כך.\n\nשעורי הבית: סיוטיים. יש רק הגשה אחת וזה ברמת ספציפיות שאם לא הקשבתם לכל הברה שהמרצות אמרו בכיתה יכול להיות שיש שאלות שפשוט לא תצליחו.\n\nהמבחן: גם כן הסגל ממשיך במתכונת האהובה עליו- סיוט. \nהסגל הנהדר החליט לפרסם 5 מבחנים לדוגמה (תודה באמת), רובם עם טעויות בסימון של הפתרונות, הסברים לא נכונים, טעויות בהסברים ושלל דברים אחרים שגרמו לחווית הלמידה למבחן להיות מקסימה. \nהמבחן עצמו היה הזוי בעיניי, רמת של ירידה לפרטים כאילו אנחנו מינימום מנתחי מוח, שוב גם פה אם פספסתם הברה שנאמרה בהרצאה או מילה שנכתבה במצגת פשוט אין סיכוי שתדעו את השאלות- בודק בעיקר שינון וממש לא הבנה וחבל. \n\nהשורה התחתונה: עוד כמה מהקלאסיקות שהלכו בקורס:\nהמרצות לא מוכנות לקיים שעות קבלה לפני המבחן (בכלל),\nפורום לשאלות לפני המבחן היה פתוח רק יומיים (תודה על ההשקעה),\nחצי מהזמן שכתוב במערכת כתרגול הוא הרצאה ולא מתוגמלים בהתאם מבחינת נק\"ז,\nלסיכום: גרמו לי לרצות לפרוש מהתואר\nבהצלחה", "timestamp": 1690217112421}, {"author": "אני", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "ברוכים הבאים לפקולטה להנדסה ביו-רפואית, תחזיקו חזק כי מכאן זה רק הולך ומתדרדר.\n\nשם המרצה: טוב ששאלתם, מהיוצרים של מבוא לאנטומיה של האדם (כי מרצה 1 זה לא מספיק): לימור פרייפלד, יעל יניב וענבר ברוש \nחוות דעת - הרצאות: \nיעל יניב - ברוכים הבאים לטירונות 02 מחנה 80, חשבתם שסיימתם את השירות הצבאי? תחשבו שוב. יעל המ״מ החליטה שכיתה הפוכה זו שיטת ההוראה הכי טובה בעולם: בהקלטה אתם רואים אותה קוראת מהמצגת אחכ כותבת באייפד את מה שהיא הקריאה ואחכ בכיתה בפרונטלי הפלא ופלא - מקריאה שוב מהמצגת נושאים נבחרים ממה שהיא כבר הקריאה בהקלטה. ההקלטות בלתי נסבלות ומשעממות. הפרונטלי עוד נסבל אבל עדיין היא לא מרצת השנה.\nלימור פרייפלד - לימור מדברת במהירות האור ובטוחה שאנחנו יודעים את כל המושגים שיש לה במצגת כבר ממקודם, אם הצלחתם להבין חצי שורה שהיא אמרה מצבכם טוב. אי אפשר להתרכז אצלה, היא מעבירה בצורה משעממת ומרדימה וגם לא מבינים מילה ממה שהיא אומרת. היה אפשר לשרוד אם היה כתוב משהו במצגת אבל הכל שם גרפים ותמונות ובמקרה הטוב שורה שתיים שמקיפות 0.00001 אחוז מהחומר.\nענבר ברוש: בסהכ חמודה והעבירה בצורה מעניינת את החלקים שלה. הבעיה שלא ברור מה ממה שהיא לימדה בחומר או לא כי המצגות בלאגן. \n \nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: \n חמודה ממש ועם הרבה כוונות טובות. עשתה סדר בבלאגן של ההרצאות ותכלס רק בזכותה הבנתי מה הולך בקורס הזה. קרה כמה פעמים שהיא הטעתה אותנו במהלך הקורס אז שווה לוודא אם תשובות שהיא עונה אכן נכונות. \nשעורי הבית: \nסיוט. ניסוחים מבלבלים בשאלות וגם בתשובות, מרגיש שלא השקיעו מינימום מאמץ בלבדוק שהם הגיוניים. רצוי לפתור לפני התרגול ואז בתרגול לשאול את המתרגלת שאלות שיכווינו לתשובה הנכונה (אבל ראו הוזהרתם - לפעמים המתרגלים טועים ומטעים).יש ניסיון אחד, בסהכ אפשריים אם משווים ועושים עם חברים.\nהמבחן: אם עד כאן לא השתכנעתם שהקורס הזה מזעזע אולי כאן תצליחו. המבחן מורכב משאלות סופר ספציפיות על החומר הכי לא חשוב שלמדנו מכל נושא. בודק נטו אם שיננו את החומר ולא אם הבנו את הדברים החשובים והעיקריים. נו טוב מה חדש? \n\nהשורה התחתונה: אין ברירה זה קורס חובה. תבואו להרצאות ולתרגולים ותנסו להתרכז כמה שאפשר זה עוזר לקראת המבחן כי זה בלתי אפשרי בעיני להצליח אם רואים פעם ראשונה את החומר בשבוע שלפני המבחן.", "timestamp": 1690219284314}, {"author": "ג'וני בוי", "difficultyRank": 3, "generalRank": 3, "semester": "202202", "text": "שם המרצה: יעל יניב ולימור פרייפלד\nחוות דעת - הרצאות:  חומר סופר מעניין המרצות פשוט לא מאוד טובות בלהעביר אותו, סופר מקצועיות וחכמות אבל מאוד משעממות.\nמעבר לזה מתייחסות לסטודנטים בצורה פשוט בזיונית כאילו אנחנו ילדים קטנים, התנהלות בקורס לא רצינית בכלל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n40 שאלות אמריקאיות, ניסוחים כפולים / דו משמעיים ופשוט מעצבן שנופלים על שאלות בגלל הניסוח שלהן ולא בגלל אי ידיעה\n\nהשורה התחתונה: קורס מאוד מעניין, צוות קורס לא טוב", "timestamp": 1690376892819}, {"author": "יוסי", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: \nחוות דעת - הרצאות: לא הייתי\n\nשם המתרגל/ת: הדס\nחוות דעת - תרגולים: חמודה מאוד, מנסה להעביר את כמות החומר העצומה הזאת בחינניות ובקלילות וסה\"כ באמת העבירה את החומר מעולה\n\nשעורי הבית: רק לפני המבחן באמת הצלחתי להבין אותם, תוך כדי הסמסטר זה פשוט יותר מדי לעומק ולא באמת מבינים, 20 שאלות עם ניסוחים מאוד מבלבלים על דברים רנדומליים שנאמרו, בלגאן שלם\n\nהמבחן: 40 שאלות, שעתיים, לדעתי אין לחץ של זמן, בודק יותר שינון מהבנה לדעתי כי היו המון שאלות טכניות וממש קצת הבנה, ממוצע נמוך יחסית אפשרי אם משננים מאוד טוב את הסיכום בדרייב\n\nהשורה התחתונה: קורס ממש ממש מעניין, מועבר בצורה די משעממת ומבולגנת מאוד, ממש חבל", "timestamp": 1691954206614}]}