{"posts": [{"author": "א", "difficultyRank": 2, "generalRank": 4, "semester": "201901", "text": "שם המרצה: ג'ון קנדי\nחוות דעת - הרצאות: ההרצאות היו הרמה גבוהה, ג'ון מרצה מצוין ויודע להעביר את הנק' החשובות בחומר. \n\nשם המתרגל/ת: דניאל דהיס\nחוות דעת - תרגולים: התרגולים היו ברמה יחסית נמוכה, בסה\"כ עברנו על התרגילים במצגת, ללא שום דגשים לגבי החומר התיאורטי או הרחבה על התוצאות החשובות. התרגילים עצמם די סתמיים, מאוד טכניים ולא דורשים הבנה או מחשבה אלא בעיקר הצבה בנוסחאות - בסה\"כ התרגולים לא תרמו בכלל להבנת החומר והיו בעיקר בזבוז זמן.\n\nשעורי הבית:  ממוחזרים משנים קודמות, ממשיכים את הקו של התרגולים ולא מלמדים במיוחד.\n\nהמבחן: \nהיה בנוי מחלק פתוח של 20% וחלק אמריקאי של 80%, הפתוח דרש מעט מחשבה אבל לא משהו מורכב מדי (יש שחזור בדרייב), החלק האמריקאי היה ברובו משוחזר.\n\nהשורה התחתונה:  בסה\"כ הקורס עוסק בחומר מאוד מעניין ורלוונטי לדעתי, עם זאת מדובר בהתעסקות ברמה מאוד מאוד שטחית, רוב הידע מגיע מההרצאות ולא מהתרגולים ולכן לדעתי לא ממש מקבלים כלים פרקטיים בקורס. מומלץ למי שרוצה לקבל רקע בנושא, עם זאת - אפשר לקרוא את ההרצאות ולראות כמה סרטוני ביוטיוב ולהגיע לאותה רמה כמו מישהו שלקח את הקורס.", "timestamp": 1599497725033}, {"author": "אנונ~", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: חיים אזהרי \nחוות דעת - הרצאות:  לדעתי ההרצאות סבירות, אני לא חושב שאי אפשר לא להסתדר בלעדיהן. חיים בסה\"כ מרצה נחמד והוא משתדל שאנשים יבינו. \n\nשם המתרגל/ת: גדי מנדל \nחוות דעת - תרגולים:  גדי מתרגל מעולה, התרגולים בסה\"כ הרבה יותר עוזרים לשיעורי בית וגם להבנה של החומר אבל בגלל רק שעה מרגיש שחסר קצת תרגול. \n\nשעורי הבית:  שיעורי הבית מועתקים משנים קודמות אז הם לא דורשים השקעה יותר מידי. \n\nהמבחן: המבחן הסמסטר אצלנו היה אמריקאי כולו, הממוצע היה יותר גבוה מהרגיל ואם פותרים את כל התרגילים שיש בספר הקורס זה מבטיח ציון טוב במבחן בסוף. \n\nהשורה התחתונה:  קורס בחירה מומלץ במגמה, גם בסה\"כ החומר מעניין ומלמד וגם הציון מתגמל.", "timestamp": 1615970855410}, {"author": "מישהו", "difficultyRank": 1, "generalRank": 3, "semester": "202201", "text": "שם המרצה: חיים אזהרי\nחוות דעת - הרצאות: מרגיש שהיה אפשר ללמד את החומר באופן טוב יותר. החומר לא מועבר באופן הכי מעניין ובערך שליש מהזמן מושקע על חזרה של השבוע שעבר.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: אחלה של מתרגל\n\nשעורי הבית: קלים ולוקחים מעט זמן\n\nהמבחן: לא קשה\n\nהשורה התחתונה: הקורס בסדר ומסביר באופן לא מעמיק על הרבה סוגי הדמיה.", "timestamp": 1678197556997}, {"author": "ג'ורג' וושינגטון", "difficultyRank": 2, "generalRank": 4, "semester": "202301", "text": "שם המרצה: ג'ון קנדי\nחוות דעת - הרצאות: מרצה די משעמם, בעיקר מקריא מהמצגות ומדבר באנגלית אז קשה יותר לעקוב, אבל לא כל החומר של המבחן גם בתרגולים אז צריך להגיע/ להשלים.\n\nשם המתרגל/ת: רועי פריזאט\nחוות דעת - תרגולים: אחלה של מתרגל! בקיא מאוד בחומר, מסביר טוב וסוגר את כל הפינות\n\nשעורי הבית: לא מסובכים יותר מדי, יש רפרנסים, לא מעמיסים במיוחד\n\nהמבחן: ג'ון קצת נכנס לפרטים קטנים ולא ולא כותב הכי ברור, אבל אם מקפידים להשלים את ההרצאות אפשר להוציא ציון טוב (הרוב בוחר לא לעשות את זה)\n\nהשורה התחתונה: לא קורס קשה במיוחד אבל ג'ון לא הכי ברור. לא לוותר על לראות את ההרצאות למרות השעמום.", "timestamp": 1717171787838}]}