{"posts": [{"author": "שם", "difficultyRank": 4, "generalRank": 2, "semester": "201901", "text": "שם המרצה: יעל\nחוות דעת - הרצאות: עשינו את הקורס בפורמט כיתה הפוכה, אישית אני פחות מתחברת לזה, אבל הקורס כן היה ברור ברובו\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: מתרגלת מקסימה, ממש רצתה לעשור לנו ושנבין את התרגולים.\n\nשעורי הבית: קצת עמוסים, חלקם לא הכי מרגישים קשורים לקורס ולהרוב יש רפרנס\n\nהמבחן: מבחן קליל יחסית, הרגשתי שאני לא מוכנה אליו אבל החלטתי לגשת למועד א' ומקסימום לשפר, הוא שאל דברים שהיו בחומר ונלמדו בצורה ברורה, היו קצת סעפים טריקיים אבל בסוף יצא ממוצע טוב\n\nהשורה התחתונה: \nזה קורס לא הכי מחדש, אם עושים את ביופיזיקה עם יעל הרבה חוזר משם, מה שלא חוזר משם חוזר מבקרה או אותות אקראיים, לדעתי צריך קצת לרענן את הקורס שיהיה יותר ממוקד על משהו יחודי אליו כי הוא לא בסיס באמת לכלום אבל לא מעמיק באמת בכלום, מהקורסים שאני פחות ממליצה עליהם", "timestamp": 1600855802662}, {"author": "Asaf Tzur", "difficultyRank": 3, "generalRank": 4, "semester": "202001", "text": "שם המרצה: יעל יניב\nחוות דעת - הרצאות: \nההרצאות במתכונת כיתה הפוכה, בסך הכל יחסית ברורות ויעל סוגרת את כל הפינות הלא ברורות בפגישה. כל שבוע היה בוחן על ההרצאה הרלוונטית.\n\nשם המתרגל/ת: לימור ארבל גנון\nחוות דעת - תרגולים: \nלימור מקסימה ומסבירה מעולה.\n\nשעורי הבית: \n6 גליונות במהלך הסמסטר,  לוקחים את ממוצע ה5 הכי טובים.\nרוב השאלות מאוד דומות לתרגול, לפעמים צריך להשקיע קצת מחשבה.\n\nהמבחן: \nלא היה מבחן, במהלך הסמסטר היה פרויקט עם 3 חלקים. החלק הראשון והחלק השלישי היו יחסית פשוטים ולא דרשו יותר מכמה ימי עבודה בוורד ומטלב. החלק השני היה עמוס וכלל פיתרון במטלב של מודל המורכב מ 43 משוואות דיפרנציאליות, דרש המון ריכוז ולקח זמן.\nבסוף הסמסטר היה מבחן בע\"פ בזום על הפרויקט.\nהרכב הציון: 50% פרויקט, 30% ש.ב, 10% מבחן על הפרויקט ועוד 10% מגן בחנים. \n\nהשורה התחתונה: \nהקורס נחמד, רואים הרבה אפליקציות של החומר הנלמד, לא עמוס מדי.", "timestamp": 1612692155292}, {"author": "גדכלךדשחג", "difficultyRank": 2, "generalRank": 5, "semester": "202001", "text": "שם המרצה: יעל יניב\nחוות דעת - הרצאות: מקסימה, סבלנית ומסבירה מעולה\n\nשם המתרגל/ת: לימור ארבל גנון\nחוות דעת - תרגולים: מושלמת\n\nשעורי הבית: 6 גליונות, צריך לעשות 5, לא ארוכים מידי ויש להרוב רפרנס בדרייב\n\nהמבחן: אין מבחן, הפרויקט היה קצת מעיק אבל בדיעבד לא נורא בכלל \n\nהשורה התחתונה: ליבה ממש מוצלחת", "timestamp": 1616327491160}, {"author": "Idk I just got here", "difficultyRank": 3, "generalRank": 3, "semester": "202301", "text": "שם המרצה: יעל יניב\nחוות דעת - הרצאות: \nחצי חצי\nשם המתרגל/ת: ראמי\nחוות דעת - תרגולים: \nמתרגל כבוי\nשעורי הבית: \nקלים\nהמבחן: \nעשינו מבחן אמריקאי 10 שאלות ומבחן בעל פה על הפרויקט\nהשורה התחתונה: \nלא יודע", "timestamp": 1712345060043}]}