{"posts": [{"author": "תא לריק נותן ריק", "difficultyRank": 2, "generalRank": 3, "semester": "202001", "text": "שם המרצה: \nחוות דעת - הרצאות: אין מה לבוא להרצאות\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: אין מה לבוא לתרגולים, או שאפשר לשבת ולהקשיב בנחת\n\nשעורי הבית: המאמרים האלה הם קאדר, אבל מספיק לקרוא סיכום של המאמר, שעה וחצי לפני הבוחן ולעבור על שאלות מבחנים קודמים.\n\nהמבחן: לקרוא סיכום מפורט של מישהו ולצלול לפרטים שהיו בהרצאות ויהיה בסדר + לקרוא סיכומי מאמרים. שאלות אמריקאיות מתקטננות.\n\nהשורה התחתונה: קורס ביולוגי קלאסי שהבחנים בו מעצבנים, ועדיף לא לקחת אותו ברצינות יותר מידי.", "timestamp": 1612263580394}, {"author": "-", "difficultyRank": 1, "generalRank": 1, "semester": "202101", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות:  מיותרות, יש סיכום שתופר הכל\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  אין, המאמרים ממש מעיקים וחופרים, במיוחד בזה שמחייבים נוכחות\n\nהמבחן:  מתיש. נטו מתמקד בלשנן מלא חומר ופרטים קטנים, בלי טיפת חשיבה אקסטרא, רק שינון יבש של חומר\n\nהשורה התחתונה:  קורס נוראי, אאכ חובה - לא לעשות!", "timestamp": 1643899786212}, {"author": "אייברי ברעוז", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שולמית לבנברג\nחוות דעת - הרצאות: מעניינות סהכ\n\nשם המתרגל/ת: מג'ד משעוד\nחוות דעת - תרגולים: מג'ד היה חמוד, התרגולים הם די חזרה על ההרצאות, פלוס מעבר על המאמר של אותו שבוע. ממליצה להגיע אליהם אם אפשר.\n\nשעורי הבית: המאמרים ארוכים ולפעמים קשים, ממליצה להשקיע בזה את עמות השעות הנדרשת אם אפשר. בסוף הבחנים על המאמרים הם 20% מהציון וזה משמעותי.\n\nהמבחן: סבבה\n\nהשורה התחתונה: קורס קליל יחסית, אבל עם די הרבה חומר ומטלות קריאת מאמרים שבועיות שלוקחות הרבה זמן.", "timestamp": 1646465254278}, {"author": "ביורפואן אקראי", "difficultyRank": 3, "generalRank": 4, "semester": "202101", "text": "שם המרצה: שולמית לבנברג\nחוות דעת - הרצאות: מעניינות מאוד! החומר שבמצגות הוא חלקי ביותר ורוב החומר החשוב נאמר בהרצאות.\nהמלצה - להגיע עם לפטופ והמצגת ולכתוב בה בהערות.\n\nשם המתרגל/ת: אוריין קרני\nחוות דעת - תרגולים: מתרגלת מעולה ואנושית, בקיאה בחומר. בנוגע לתרגולים עצמם - הם מקיפים את החומר בצורה חלקית אך לפעמים מתעמקים בנושאים שלא העמיקו בהם בהרצאות.\nהמלצה - להגיע גם להרצאות וגם לתרגולים, רק ככה יהיה לכם/ן את כל החומר.\n\nשעורי הבית: מאמרים מאמרים מאמרים. זה מתיש קצת אבל מעניין לעיתים. לרוב המאמרים יש סיכומים בדרייב אז זה מצוין. חשוב ללמוד את המאמרים ולהבחן עליהם כי יש עליהם כמות יפה של שאלות במבחן הסופי. \nהמלצה - לקרוא רק תסיכומים ולא לבזבז את הזמן על המאמרים עצמם, יש סיכומים נהדרים לרובם.\n\nהמבחן: מבחן ברמת הקורס, ממש על החומר הנלמד. כמובן שיש שאלות טריקיות אבל בהחלט אפשר להוציא בו ציון טוב.\n\nהשורה התחתונה: קורס מעניין מאוד, מתעסק בנושאים ביולוגיים-רפואיים. צוות הקורס ממש אדיב ונגיש.", "timestamp": 1647764164943}, {"author": "פיברובלסט", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות: \nההרצאות מעניינות ונחמדות, לומדים ממש על סוגים של רקמות והתפתחות שלהן. יש בהן המון המון חומר ובסוף צריך לזכור את הכל בעפ שזה קצת פחות נחמד.\nשם המתרגל/ת: מג'ד\nחוות דעת - תרגולים: \nתרגולים טובים, קצרים אבל עושים סיכום טוב להרצאה. בכל תחילת תרגול יש בוחן על מאמר שבועי שצריך לקרוא, ואחרי זה בסוף התרגול לומדים את המאמר עם המתרגל. \nמג'ד מתרגל מצוין וכיף ללמוד איתו.\nשעורי הבית: אין שיעורי בית, יש את המאמרים והבחנים עליהם.\nהקטע של ללמוד את החומר של המאמר אחרי הבוחן עליו קצת מבאס, אבל סה\"כ המאמרים היו דרך מעניינת לקבל שיעורי בית אבל זה היה הרבה יותר עמוס ממה שמצפים מקורס של 2.5 נק\"ז.\nהמבחן: \nמבחנים אמריקאים, צריך לשנן המון המון חומר ושמות של חומרים, סוגי תאים, אנזימים וכו'. אין בכלל חומר עזר וזה לא פשוט בכלל.\nהשורה התחתונה: \nקורס מעניין, באסה שבסוף לקראת המבחן צריך ללמוד כמו תוכי.", "timestamp": 1676113686884}, {"author": "מאקרופאג'", "difficultyRank": 3, "generalRank": 4, "semester": "202201", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות: \nנושאים ממש מעניינים ורלוונטים, ההרצאות קצת איטיות וקצת משעממות לפעמים, אבל שולמית מרצה טובה, יודעת להעביר את החומר בצורה ברורה, צריך לחזור על החומר קצת אחרי ההרצאה בשביל באמת להבין כי היא לא עושה הרבה קישור בין הדברים\n\nשם המתרגל/ת: אנה\\מג'ד\nחוות דעת - תרגולים: אנה הייתה חדשה הסמסטר, מדברת ממש(!) מהר אבל יודעת את החומר ויודעת להעביר אותו. מקסימהה\nמג'ד הדבר הכי מושלם שקיים, נחמד אדיב ותמיד עונה על שאלות.\nבכללי כל סגל הקורס באמת מדהים והפקולטה צריכה ללמוד מהם דבר או שניים או אלף.\n\nשעורי הבית: מאמרים- ארוכיםםםם, בהתחלה קשה אבל עם הזמן לומדים איך לקרוא, על מה להתמקד וכו. לוקח מלא זמן. היה עדיף שיעורי בית (מבחינת זמן)\n\nהמבחן: אל תחכו לסוף סמסטר לעבור על החומר, יש בערך 100 עמודים שבאמת צריך לזכור *הכל*, אבל אם עוברים על זה קצת תוך כדי סמסטר ומבינים את הדברים יהיה הרבה יותר קל לקרוא סיכומים ולהצליח לשנן, כי המבחן לפעמים נכנס לדקויות אבל יש גם שאלות סבבה.\nסך הכל 3 ימים רצופים של למידה יספיקו. ולהיות קצת על החומר במהלך הסמסטר.\n\nהשורה התחתונה: קורס מעניין, נחמד, לא הכי מעמיק אבל נותן ידע כללי ונחמד מאוד. תשקיעו במבחן ובבחנים תוך כדי סמסטר ותגידו תודה לסגל כי הם מדהימים וזה נדיר למצוא.", "timestamp": 1676279609314}, {"author": ";", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות: סבבה סך הכל, שולמית מרצה סבבה, לא הכי מעניינת בעולם אבל לא משעממת, משתדלת להוסיף עניין להרצאות\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת טובה\n\nשעורי הבית: אין שיעורי בית, יש מאמרים שכל שבוע נבחנים עליהם והציון תקף. ממש ממש מעיק וגוזל המון זמן ביחס לקורס של 2 נקז כי צריך באמת להשקיע ולהגיע לרמה של מבחן על המאמר כל שבוע, לא להכל יש סיכומים. וחלק מהמאמרים יבשים ומשעממים בצורה מפתיעה.\n\nהמבחן:  מבחן שינון קלאסי, יכול להכינס לפינות מאוד קטנות בחומר. יש שאלות על עיניים שזה נושא שאין בתרגול והשאלות שם גם לא תמיד ממש פשוטות.\n\nהשורה התחתונה: קורס ביולוגי קלאסי, חבל שהמאמרים ממש מעיקים וגורמים לך לא להתחבר לקורס.", "timestamp": 1677137928541}, {"author": "-", "difficultyRank": 4, "generalRank": 4, "semester": "202301", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות: החומר ממש מעניין ושולמית עם ידע לא מהעולם הזה. מומלץ להגיע ולהקשיב גם כי זה מעניין וגם כי יש כמות חומר ענקית למבחן (ממש לא מרגיש 2.5 נקז) אז כדאי להכיר אותו לפני שלומדים למבחן. \nיש 3 הרצאות אורח שהן חלק מהחומר למבחן וגם להן מומלץ להגיע.\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: מתרגלת טובה, מכווינה למבחן, אומרת מה צריך לדעת ומה לא, התרגולים הם סוג של תקציר מזורז להרצאות של שולמית עם תוספות ומאמר בנושא. אנה מתקתקת את התרגולים ובאה לקראת סטודנטים. שימו לב שבתרגולים לפעמים יש תוספת למה ששולמית מלמדת (כבר אמרתי קורס עם מלא חומר) אז לא לוותר עליהם.\n\nשעורי הבית: צריך לקרוא כל שבוע מאמר באנגלית ויש עליו בוחן בתרגול. אם יצא לכם טוב אז המאמר היה בסמסטרים קודמים. אל תקראו את המאמרים, תקראו את הסיכומים טוב טוב, תסתכלו על בחני עבר ותקבלו 100. \n\nהמבחן: היה קשה מאוד עם שאלות הזייייה שלא ציפיתי להן בכלל, ירדו לפרטים באופן מפתיע. יש כמות חומר ענקית כולל המאמרים, צריך לזכור ים דברים בעל פה תוודאו שאתם מתחילים ללמוד בזמן (הסיכום של נוגה ארז בדרייב יחסית טוב למבחן). \n\nהשורה התחתונה: קורס מאוד מעניין אבל עמוס מבחינת השקעה וכמות החומר, אמנם 2.5 נקז אבל מרגיש יותר.", "timestamp": 1715022072301}, {"author": "..", "difficultyRank": 3, "generalRank": 2, "semester": "202301", "text": "שם המרצה: שולמית\nחוות דעת - הרצאות: יש משעממות יש פחות, לדעתי מומלץ להגיע בכל זאת כדי שיכנסו כמה דברים\n\nשם המתרגל/ת: אנה\nחוות דעת - תרגולים: הלכתי לאנה אבל בעיניי רועי מתרגל טוב ובקיא יותר. התרגולים מיותרים ממש ובאנו תכלס רק בשביל לעשות את הבחנים ובשביל המגן.\n\nשעורי הבית: הבחנים מתישים! כל שבוע ללמוד על מאמר אחר. אל תלמדו את המאמרים באמת, פשוט תסמכו על סיכומים ובחני עבר בדרייב.\n\nהמבחן: לא פשוט בכלל, נכנסו לפרטים יותר מבשנים קודמות והתקטננו על עובדות קטנות שנזרקו בהרצאות/בתרגולים או בכלל מלא שאלות מהמאמרים. מבחן קשוח בעיקר בגלל הלמידה אליו שהיא מפוצצת חומר (אזור ה100 עמודים לסיכום). אי אפשר באמת לדעת כל פרט מהחומר אל תרגישו רע, אבל כן צריך לעבור על כל הנושאים כי הכל מופיע בבחינה ואפשר לשאול על מלא נושאים. \n\nהשורה התחתונה: קורס מייגע ומשעמם עם חומר של 40 נקז אבל חובה...", "timestamp": 1715528698785}]}