{"posts": [{"author": "אורן", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה:  יואב שכטמן\nחוות דעת - הרצאות:  הקורס עוסק בחומר יחסית מתקדם ומורכב, יואב לדעתי מרצה מעולה ומסביר את החומר מצוין.\n\nשם המתרגל/ת: אליאס נעמה\nחוות דעת - תרגולים: בתרגולים עושים חזרה על רוב החומר שעובר בהרצאות ומתמקדים בעיקר בפתרון בעיות מאוד ספציפיות ומימוש שלהן במטלב, לדעתי יש פחות דגש על רכישת כלים כלליים לפתרון של מגוון בעיות בכל נושא.\nבכל מקרה - אליאס אחלה מתרגל, משתף פעולה ומוצא פתרונות לכל בעיה שעולה מצד הסטודנטים.\n\nשעורי הבית:  ש.ב יחסית ארוכים, ל-90% מהשאלות רואים פתרון מוכן מראש בתרגול, ולאלה שלא יש רפרנס.\n\nהמבחן:  בנוי כמעט כולו ע\"ב הש.ב והתרגולים - אם מגיעים עם פונק' מוכנות מראש אפשר לפתור חצי מהמבחן תוך חצי שעה בלי לחשוב בכלל אלא רק להזין נתונים לפונק'. \nמומלץ להכיר היטב ולרשום בתחילת כל פונק' בהערה את הקלט והפלט שלה ובאיזה פורמט יש להזין אותם (למשל עבור פונק' שמקבלת קלט של אות נקודה - אם יש להזין כוקטור מרווחי הזמנים / וקטור של זמני המאורעות / משהו אחר)\n\nהשורה התחתונה: \nקורס מומלץ, בנוי היטב ועוסק בחומר מקצועי מתקדם שדורש בסיס ידע טוב בעיבוד אותות כדי באמת להפנים את החומר החדש. בעיני אחד הקורסים היחידים בפקולטה שבאמת נותנים כלים רלוונטים למהנדס.", "timestamp": 1599485313541}, {"author": "הדר", "difficultyRank": 4, "generalRank": 4, "semester": "202002", "text": "שם המרצה: יואב שכטמן\nחוות דעת - הרצאות:  מרצה טוב, ברור, מצגות מסודרות\n\nשם המתרגל/ת: אלון סגוי\nחוות דעת - תרגולים: מתרגל טוב, ברור, אכפתי, מצגות מסודרות \n\nשעורי הבית:  קצת עמוסים, במטלב עם שאלות יבשות, ציונים גבוהים\n\nהמבחן: המבחן רטוב, ממש אותו פורמט של שיעורי הבית. החומר פתוח כולל קבצי המטלב משיעורי הבית. השאלות הוגנות.  \n\nהשורה התחתונה: החומר של הקורס מאוד רלוונטי לעיבוד אותות ונותן כלים פרקטיים לתחום. החומר מועבר בצורה טובה ומבחן הוגן.", "timestamp": 1627974152245}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יואב שכטמן\nחוות דעת - הרצאות: \nמרצה מעולה, מסביר טוב, ההרצאות גם מעניינות ואצלנו היינו 6 סטודנטים רשומים, לכן העלה הקלטות משנה שעברה.\nשם המתרגל/ת: עפרי גולדנברג\nחוות דעת - תרגולים: \nמתרגל מעולה, יחס מאוד טוב ועונה למיילים. יש גם הקלטות של אלון משנה שעברה שהן גם טובות.\nשעורי הבית: \n5 שיעורי בית רטוב במטלב מלמדים טוב את החומר (ממש על מה שהיה בתרגול). אם מתקחלים טוב עם השותף/ה אז יהיה דיי בסדר.\nהמבחן: מבחן במטלב של 3 שאלות שמגיעים עם פונקציות כתובות שלכם במטלב. הוא ארוך מאוד. יכול להיות קשה (אבל לא במיוחד). צריך לדעת את השיטות בשלוף.\nהשורה התחתונה: \nאחד הקורסים הכי טובים בפקולטה של ביורפואה. מאוד קריטי לדעת איך להתמודד עם אותות ביולוגיים. מלמד מלא שיטות.", "timestamp": 1675590369666}]}