{"posts": [{"author": "מישהו", "difficultyRank": 4, "generalRank": 5, "semester": "202102", "text": "שם המרצה: מוטי פריימן\nחוות דעת - הרצאות: מעניינות ומלמדות. המרצה יודע את החומר וכיף בהרצאות.\n\nשם המתרגל/ת: ניצן אבידן.\nחוות דעת - תרגולים: היא בסדר.\n\nשעורי הבית: לוקחים לא מעט זמן. יש חמש מטלות רטובות. ממה שהבנתי בקורס המקביל של הנדסת חשמל (ענ\"ת) יש שלוש מטלות רטובות ועוד כמה מטלות יבשות אז נראה לי שבקורס של ביורפואה עמוס יותר.\n\nהמבחן: היה לא קשה. חוץ מזה 50% מהציון בקורס זה המטלות ויש במטלות ציונים גבוהים. ממה שהבנתי המבחן בהנדסת חשמל קשה יותר.\n\nהשורה התחתונה: ממליץ על הקורס. הוא מלמד כל מיני אלגוריתמים קלאסיים של עיבוד תמונה. יש גם הרבה אלגוריתמים שהוא לא מלמד אבל אולי לומדים אותם בקורס ראייה ממוחשבת. בקורס ענ\"ת על בטוח לא לומדים אותם כי החומר של עת\"ר וענ\"ת כמעט זהה.\nאם רוצים ללמוד אחר כך את הקורס בראייה ממוחשבת של הנדסת חשמל כדאי לבדוק אם הקורס של ביורפואה מאפשר להתקבל לראייה ממוחשבת.", "timestamp": 1660819178058}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מוטי\nחוות דעת - הרצאות: \nהוא טוב ומסביר עם עניין אבל ההרצאות מאוד כלליות ואי אפשר לצפות יותר מקורס של 2.5 נק'.\nשם המתרגל/ת: ניצן\nחוות דעת - תרגולים: לא הלכתי אבל היא מאוד נחמדה, מאוד עזרה בשעות קבלה\n\nשעורי הבית: תרגילי בית חשובים לציון (50%) אבל בנויים גרוע.\nמלמדים איך לממש את האלגוריתמים אבל צריך לחפור יותר מדי להבין איזה אלגוריתם לממש. הניסוח אינו מוסבר היטב.  \n\nהמבחן: \nעדיין לא עשינו\nהשורה התחתונה: בהשוואה לקורסי מדמח/חשמל הקורס אינו מסודר. ביחס לקורסי הפקולטה, הקורס מסודר בסדר.\nזה כן יעזור במימוש דברים ב numpy אם אתם יודעים מה אתםפ עושים אבל אפשר ללמוד את זה יותר טוב במקומות אחרים.\n\nהמלצה הינה להסתכל על קורסי עיבוד תמונה בפקולטות אחרות.", "timestamp": 1673172209103}, {"author": "huffman", "difficultyRank": 4, "generalRank": 3, "semester": "202201", "text": "שם המרצה: מוטי פריימן\nחוות דעת - הרצאות: מרצה בסדר יחסית \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: טובה מאוד \n\nשעורי הבית: קשההההההההההההההההההההההההההההההה!!!!\nאם אתה חושב שאתה טוב בפייתון אתה טועה.\nתשב על המטלות שעות ולא תידע מה אתה עושה\n\nהמבחן: \nעדיין לא עשיתי\n\nהשורה התחתונה: \nאל תיקחו אם הסמסטר עמוד", "timestamp": 1675522227044}, {"author": "-", "difficultyRank": 3, "generalRank": 2, "semester": "202201", "text": "שם המרצה: מוטי\nחוות דעת - הרצאות: בסדר, משתף בכיתה, ועושה דיונים.\nשם המתרגל/ת: ניצן\nחוות דעת - תרגולים: זמינה לשאלות - מסבירה טוב.\nשעורי הבית: \nלא מוגדרים היטב, ויש פער גדול ביחס לקורסי חשמל/מדמח. \nנדרשים לבנות פונקציות ולרוב צריך לקרוא כמה פעמים את השאלה כדי להבין מה דרוש. הקושי בה רק בגלל שזה לא נכתב באופן ברור מספיק. בנוסף, נדרשים לכתוב את הטסטים ולבדוק לבד אם מה שקיבלתם נכון, בניגוד לקורסי חשמל/מדמח. קצת איירוני ששם לומדים לתכנת כמו שצריך אבל מתמקדים באלגוריתם עצמו בשיעורי בית ולא בהצגת plots.\nהמבחן: \nעוד לא היה\nהשורה התחתונה: \nאם בא לכם ללמוד עבוד תמונה עם בסיס טוב לתיאוריה, זה ממש לא הקורס. המצגות לא מכילות הרבה חומר - תעשו השוואה עם החומר שיש בדרייב של חשמל בקורס ענ״ת שלהם.", "timestamp": 1675604359619}, {"author": "-", "difficultyRank": 5, "generalRank": 3, "semester": "202201", "text": "שם המרצה: דר. פריימן מוטי\nחוות דעת - הרצאות: מסביר טוב, הרצאות סך הכל מעניינות.\n\nשם המתרגל/ת: ניצן אבידן\nחוות דעת - תרגולים: עושה הרבה דיונים בכיתה מה שלוקח רוב הזמן ולפעמים לא לצורך, חסרים הסברים מעמיקים יותר וחלק מהנושאים היו קשים להבנה. \nשעורי הבית: לוקחים הרבה זמן, לא מוגדרים היטב. אבל לרוב ציונים טובים.\n\nהמבחן: הציונים לא הכי גבוהים כמו בשאר קורסי בחירה. המבחן לא היה טריקי, אבל הורידו הרבה נקודות גם על דברים קטנים.\n\nהשורה התחתונה: בהתחשב בכך שהקורס היה עמוס, ציון המבחן לא משהו ועם פחות תיאוריה מקורס בחמשל, אולי עדיף כבר לשקול לקחת את הקורס המקביל.", "timestamp": 1679841423003}, {"author": "קודי", "difficultyRank": 4, "generalRank": 5, "semester": "202301", "text": "שם המרצה: מוטי פריימן\nחוות דעת - הרצאות: מעולות! מרצה כיף ומצחיק, מלמד מצוין ובאמת שהיה אחלה לבוא להרצאות שלו. בסמסטר של 6 קורסים הוא היחיד שהגעתי להרצאות שלו.\n\nשם המתרגל/ת: ניצן אבידן\nחוות דעת - תרגולים: מתרגלת מצוינת, מסבירה הכל ממש ברור ועונה על כל השאלות של כולם עד להגעה להבנה.\n\nשעורי הבית: ממש נחמדים למי שאוהב וטוב בתכנות (מחברות jupyter שבהם צריך להשלים קוד ומדי פעם כמה שאלות תיאורטיות של הבנה), יכולים להיות קצת מסובכים לפעמים אבל היום עם קצת ChatGPT שמסביר לנו הכל אז הכל אפשרי. אם הולכים לפי התרגולים זה גם אמור להיות מספיק\n\nהמבחן: \n\nהשורה התחתונה: קורס ממש ממולץ! נותן ידע תיאורטי ופרקטי בחלוקה של 50/50 (גם מבחינת הציון מבחן/שיעורי בית)", "timestamp": 1714033567327}]}