{"posts": [{"author": "רוני קשת", "difficultyRank": 4, "generalRank": 1, "semester": "201901", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: ההרצאות לקוחות מהאתר של NI יוג'ין כן נותן קצת מעבר אבל לא מאוד משמעותי, אני באמצע סמסטר הפסקתי לבוא כי הרגשתי שזה לא מועיל לי\n\nשם המתרגל/ת: אורי\nחוות דעת - תרגולים: לא היו בנויים טוב, הרגיש כמו חזרה על ההרצאה ולא נתן מספיק לתרגל את התוכנה, כמו כן היה פער משמעותי בין רמת התרגולים להגשות שהיו במקביל, זה היה יחסית מתסכל, במקום שיביאו אותנו לרמה שמציפים שנהיה היינו צריכים דיי לבד להגיע לזה, לתרגולים הפסקתי לבוא בשלישי ורק עברתי עליהם לבד. \n\nשעורי הבית: ארוכים ומטישים, הדבר היחיד שבפועל מלמד משהו בקורס\n\nהשורה התחתונה: בעיני קורס דיי מיותר, לא הרגשתי שהו נתן לי משהו חשוב, מה גם שההגשה הסופית עד השבוע הראשון של הסמסטר אחרי (בחורף, לכן מומלץ אם כבר לקחת אז באביב שיש את הקיץ), ואז חוץ מלהעמיס על הסמסטר אחרי מאוד גם אין עדין ציונים חצי שנה אחרי שסיימנו את ההגשה.... מאוד מאוד מתסכל", "timestamp": 1600856708255}, {"author": "DAQ", "difficultyRank": 3, "generalRank": 4, "semester": "202102", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: קצת תלויות באוויר, לדעתי צריך יותר לעסוק hands on בזמן ההרצאות כדי לזכור דברים. אין הקלטות ואען מצגות ללמוד מהן\n\nשם המתרגל/ת: ניסים\nחוות דעת - תרגולים: אחלה, בזכותו הקורס סביל\n\nשעורי הבית: עמוסים אבל היו רק 4 הגשות ולרובן יש רפרנס\n\nהמבחן: אין. יש פרוייקט לאורך הקיץ\n\nהשורה התחתונה: לא מרגיש שמה שמלמדים בקורס עוזר יותר מידי בשביל לבנות את הפרוייקט שצריך לעשות. גם הפרוייקט עצמו לא כלכך ברור מה צריך לעשות.", "timestamp": 1658690062634}, {"author": "אריאל", "difficultyRank": 4, "generalRank": 1, "semester": "202102", "text": "שם המרצה: יוג'ין\nחוות דעת - הרצאות: לקוחות מתוך האתר של NI. מדי פעם המרצה נותן טיפים אך בגדול ההרצאות מיותרות.\n\nשם המתרגל/ת: ניסים \nחוות דעת - תרגולים: מתרגל טוב, מסביר את החומר בצורה ברורה.\n\nשעורי הבית: 4 הגשות קלות ומרופרנסות ועוד הגשה אחת ארוכה שמהווה הכנה לפרויקט גמר. כולן באותו משקל למרות שהאחרונה היא מסכמת ולוקחת הרבה זמן.\n\nהמבחן: יש פרויקט גמר במקום מבחן. ההוראות של הפרוייקט לא לגמרי ברורות והמרצה נעלם לחודש ולא עונה למיילים (בסמסטר שלנו ניתנה הארכה ארוכה להגשה). לבסוף מקבלים את הציון אחרי בערך חצי שנה.\n\nהשורה התחתונה: לא מומלץ בכלל! \nאמנם הקורס מלמד להשתמש בתוכנת LabVIEW שהיא שימושית במקומות מסויימים בתעשייה אך הוא מועבר בצורה מאוד לא טובה והמרצה די מזלזל. הקורס יכול להשתפר אם יועלו תרגולים מוקלטים וההוראות של פרויקט הגמר יהיו הרבה יותר ברורות.", "timestamp": 1680984038867}]}