{"posts": [{"author": "אנונימי", "difficultyRank": 4, "generalRank": 5, "semester": "202001", "text": "שם המרצה: דביר ילין\nחוות דעת - הרצאות: מרצה מצויין שמקפיד להעביר ולהדגיש את התכלס של החומר הלימודי. מראה הרבה מאוד דוגמאות מעניינות.\n\nשם המתרגל/ת: לידן פרידמן\nחוות דעת - תרגולים: בין המתרגלות הכי טובות שהיו לי בתואר בלי להגזים. היא הייתה משקיעה כל כך הרבה מהזמן הפנוי שלה כדי לעזור לנו בש\"ב כולל כמה שעות קבלה בשבוע בחופשת חנוכה, מענה במייל בכל שעות היום. הייתה מקפידה לא להשאיר אף פינה לא מובנת. התרגולים עצמם היו מצויינים, מובנים ומהנים (ונורא אהבתי את המימס שהיא תמיד הייתה מוסיפה למצגת!!). כשהיא יכלה היא תמיד קישרה את החומר לעבודה שהיא עשתה בעצמה בתחום האופטיקה והיה מאוד כיף לשמוע.\n\nשעורי הבית: היו 5 גיליונות. לא תמיד קלים ולא ממוחזרים אבל מאוד מלמדים ועוזרים להבין את החומר. היינו יושבים עליהם דיי הרבה זמן אבל בסוף זה באמת משתלם. כמובן שהמתרגלים עזרו מאוד והיה על מי לסמוך בקטע הזה.\n\nהמבחן: לא קשה במיוחד. דיי דומה לתרגילי הבית כולל שאלת שיעורים בית 1:1 עם שינוי קל בנתונים (המבחן עם חומר פתוח אז זה באמת היה פשוט להעתיק מהש\"ב). הוגן מאוד וממוצע ממש סביר בשביל קורס של 3 נקודות.\n\nהשורה התחתונה: בעיניי אחד הקורסים הכי מוצלחים בפקולטה. קורס דיי קשה במהלך הסמסטר, אבל יצאתי ממנו עם המון ידע באמת שימושי. קורס מעניין ומאוד חשוב.", "timestamp": 1613555906480}, {"author": ".", "difficultyRank": 4, "generalRank": 3, "semester": "202001", "text": "שם המרצה: דביר ילין\nחוות דעת - הרצאות: מעניינות אך לעיתים מופשטות וקשות להבנה\n\nשם המתרגל/ת: בוריס\nחוות דעת - תרגולים: עונה בשניות למיילים יש לו ידע עצום ויודע להרחיב על כל שאלה הרבה מעבר\n\nשעורי הבית: \nמתן נתן הערות מלמדות \nהמבחן: \n\nהשורה התחתונה: \nקורס עמוס ללא פתרונות לא של השיעורי בית ולא של מבחנים משנים קודמות ..\nאומנם היה פקטור והממוצע היה יחסית גבוה אבל לדעתי חסר מאוד גישה לפתרונות ולמידה מהם וזה ניכר בהבנה בסך הכל של הרבה מהסטודנטים ובציונים לפני הפקטור", "timestamp": 1613718428389}, {"author": "שם", "difficultyRank": 4, "generalRank": 3, "semester": "202101", "text": "שם המרצה:  יואב שכמן\nחוות דעת - הרצאות: מפוזרות, במיוחד ההרצאות על גלים, ואופטיקת פוריה. \n\nשם המתרגל/ת: לידן\nחוות דעת - תרגולים: ממש אהבתי את התרגולים שלה! הסמסטר התרגולים הקדימו את ההרצאות ולכן היו כמה תרגולים שיצאנו מהם מבולבלים, אבל לידן תמיד מוכנה לענות על שאלות בכל זמן (עדיף  להגיע לשעת קבלה)\n\nשעורי הבית: 5 הגשות, בכל הגשה כ5 שאלות. לומדים את החומר של הקורס בעיקר בהגשות. \nממש ממליצה על שעות הקבלה של לידן - היא עוברת על כל שאלה ומוודא שאנחנו מבינים.\n\nהמבחן: 4 שאלות פתוחות, אחת מהן היתה בשעורי בית. חומר פתוח, בלי מגבלת דפים.\nתתכווננו לקושי משמעותי בפתירת השאלות במבחן. לנו היה פקטור של 10 נקודות על הבחינה. (שימו לב למי למרצה האחראי - יש הפרש בציוני מועד א)\nיש גישה למבחנים משנים קודמות, אבל לא לכולם יש פתרונות (במיוחד לא האחרונים), אבל אפשר לשלוח מיילים לצוות הקורס והם יקיימו שעות קבלה\nרק כדי להרגיע קצת - הנושא הכי קשה בקורס - אופטיקת פוריה נהיית ממש מובנת במהלך התרגול למבחן (מבחינת איך נגשים לשאלה וכו', ממש התאכזבתי כשהשאלה על אופטיקת פרויה היה משעורי הבית.)\n\nהשורה התחתונה: הרגשה של תפסת מרובה לא תפסת - רק בלמידה למבחן מבינים מה הקשר בין כל הנושאים של הקורס ורוב הזמן לא מבינים את החומר וצריך להגיע למלא שעות קבלה.", "timestamp": 1644706312650}, {"author": "ביורפואן אקראי", "difficultyRank": 3, "generalRank": 5, "semester": "202101", "text": "שם המרצה: יואב שכטמן\nחוות דעת - הרצאות: הרצאות מעניינות בטירוף. יואב מרצה מעולה אבל לא כולם מסתדרים עם הסגנון. חשוב להגיע להרצאות כדי לקבל אינטואיציה לתרגולים.\n\nשם המתרגלת: לידן פרידמן\nחוות דעת - תרגולים: 3 ראשונים שוק טוטאלי. שתו הרבה מים כי אתם עומדים לבכות אחריהם. אחרי שעברתם את השוק הראשוני החומר נהיה יותר ברור ומעניין (ברמת הmind blown לפעמים, חכו לאופטיקת פורייה).\nלידן לדעתי מתרגלת מעולה ובקיאה מאוד בחומר, יודעת להסביר נהדר. עוזרת בשיעורי הבית ובכללי נראה שהיא אוהבת את החומר וזה משפיע לטובה על איך היא מעבירה אותו.\n\nשעורי הבית: ברובם יש שאלות שבלתי ניתנות לפתרון ללא עזרת המתרגלים, אז כדאי שתוסיפו את שעות הקבלה למערכת שלכם כי הן על סף החובה. לא היו לנו תרגילים במטלב/פייתון.\n\nהמבחן: קשה. כל השנים היה קשה ובשנה שלנו משום מה היה קשה מאוד (מוזמנים ומוזמנות לעיין במבחן חורף 22 מועד א).\nשכטמן אוהב לתת שאלות שחלקן על נושאים שלא תורגלו, אז שימו לב שאתם לומדים גם את ההרצאות (לא להתעכב על הוכחות מתמטיות, רק להבין תפיזיקה).\n\nהשורה התחתונה: הקורס הכי מעניין שהיה לי בתואר אבל גם קורס מאתגר שדורש הרבה זמן השקעה.", "timestamp": 1647765297251}]}