{"posts": [{"author": "שם", "difficultyRank": 3, "generalRank": 4, "semester": "201902", "text": "שם המרצה: פיראס\nחוות דעת - הרצאות: אכפתי וברור באופן כללי \n\nשם המתרגל/ת: שונית \nחוות דעת - תרגולים: מאוד אכפתית ורואים את ההשקעה שלה, עזרה לנו מאוד בבחירת מאמר לסמינר\n\nשעורי הבית: קצת עמוסים ובאמת בודקים אותם, אבל עוזרים להבין על מה דיברו בתרגולים\n\nהמבחן: לא היה מבחן, יש עבודה מסכמת, ארוכה יחסית (לקחה לנו משהו כמו שלושה ימי עבודה כל אחת) אבל כן מעניינת ושיפרה את היכולות שלי במטלב\n\nהשורה התחתונה: קורס נחמד, צוות קורס מעולה", "timestamp": 1600849283394}, {"author": "Nitzan B", "difficultyRank": 2, "generalRank": 4, "semester": "202002", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אחלה קורס, לא קשה ולא קל. מעשיר את הידע ורלוונטי למי שרוצה להבין בביומכניקה.", "timestamp": 1637167461449}, {"author": "-", "difficultyRank": 3, "generalRank": 5, "semester": "202102", "text": "שם המרצה: פיראס\nחוות דעת - הרצאות: אחלה מרצה, מובן ואכפתי. ההרצאות הן שילוב של נושאים שונים, כלומר זה לא נבנה אחד על השני, הן סך הכל יחסית קלילות, לא מאוד קשות להבנה, והנושאים נחמדים ויחסית מעניינים, מעין \"nice to know\", יכול לעזור אם רוצים להמשיך בתחום הביומכניקה. יש בקורס 3-4 בחנים קצרצרים של 5-10 דקות על חומר ההרצאות (לא מצטבר), לא קשים בכלל, נטו כדי לראות שאתם עוקבים.\n\nשם המתרגל/ת: יואל מלול\nחוות דעת - תרגולים: למיטב הבנתי לא יתרגל שוב אז לא רלוונטי כל כך. לדעתי לא היה מספיק זמן בתרגולים, כמעט אף פעם לא הספקנו לעבור על כל התרגול. בחלק מהתרגולים יש נושאים טיפה מורכבים יותר מתמטית, שכדאי לנסות להבין בשביל תרגילי הבית.\n\nשעורי הבית: שני התרגילים הראשונים הם יבשים, קצת חזרה על כוחות, מומנטים, מטריצות ווקטורים עם טיפונת חידוש בהקשרים של ביומכניקה. שני תרגילי הבית האחרונים הם רטובים במטלב על אנליזה של זוויות, מיקומים, רוטציה של מפרקים/מרקרים ודורשים יותר השקעה וזמן, אבל בהחלט מלמדים ומעניינים, אמנם יכולים להיות קצת קשים ולא מובנים לפעמים, בעיקר התרגיל האחרון.\nחשוב לדעת שסגל הקורס מאוד מקפיד על העתקות בקורס, ולכן ממש חייבים להיזהר מהתייעצויות עם חברים בנוגע לתרגילים, תקף גם לפרויקט.\n\nהמבחן: אין מבחן בקורס. יש פרויקט סופי שהוא 50% מהציון ויש סמינר שהוא 20% מהציון. הסמינר מדובר בלבחור מאמר שקשור לביומכניקה, יכול להיות קשור לנושאי ההרצאות ויכול להיות שלא, פיראס גם נותן רשימה של נושאים כרעיונות אבל לא חייבים לבחור באחד מהם, כל עוד המאמר מאושר על ידו, צריך בעצם להכין מצגת שמסבירה את מה שהולך במאמר ולהציג את זה בפני הכיתה. סך הכל חביב לדעתי ואם בוחרים מאמר מעניין יכול להיות גם מלמד. הפרויקט הסופי לוקח זמן והוא הרבה מאוד התעסקות במטלב וניתוח של נתוני תנועה והליכה אמיתיים שהקלטנו. לדעתי סך הכל באמת מעניין וממש משפר את הכישורים במטלב ומלמד.\n\nהשורה התחתונה: קורס ממש חביב ומעניין, מומלץ לדעתי למי שמתעניין בביומכניקה.", "timestamp": 1677924609962}]}