{"posts": [{"author": "Maria Berihu", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: \nחוות דעת - הרצאות: \nהרצאות מוקלטות גם, הכל מופיע במוגל בהרצאות הוא עובר בקצרה על הרצאות מוקלטות. \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \nמתרגלת מאוד נחמדה, עוברת על הדברים חשובים שמופיעים בתרגילי בית.\n\nשעורי הבית: \nלא קשים בכלל, מקבלים ציונים גבוהים.\nהמבחן: בסדר מדבר על החומר, למרות שיש כמה דברים קטניטם שהיו לעומק ושלא היה הכי ברור אבל בסוף היה ממש פייר.\n\nהשורה התחתונה: \nאחלה קורס, לא קשה בכלל. אפשר לראות את ההרצאות מתי שנוח שזה יתרון מאוד גדול.", "timestamp": 1666767768892}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דרור סליקטר\nחוות דעת - הרצאות: כל ההרצאות מוקלטות מראש באנגלית, הייתה גם כיתה הפוכה אבל לא הגעתי.\nההרצאות עצמן ממש בסדר, חלקן מעניינות יותר וחלקן פחות, מתאים גם למי שרוצה להקשיב על פי 2 וגם למי שצריך להקשיב בלי להאיץ.\n\nשם המתרגל/ת: ליאורה\nחוות דעת - תרגולים: ראיתי את כל התרגולים מוקלטים אבל הם ממש אחלה, מאוד עוזרים לכוון לשאלות שיהיו אחר כך בשיעורי הבית במבחן.\nליאורה גם עשתה שעת קבלה מאוד מועילה לפני הבחינה, נראה שהיא גם מאוד מעורבת בקורס וכותבת חלק משמעותי במבחן, אז שווה לעבור על התרגולים.\n\nשעורי הבית: 2 גיליונות להגשה בזוגות, לא לוקחים הרבה זמן בכלל אם עוברים על התרגולים וההרצאות שמתאימים לכל גיליון.\n\nהמבחן: 40% שאלות פתוחות, 60% אמריקאי במשך שעתיים.\nסך הכול המבחן בסדר, לא פרסמו הרבה חומר ללמוד ממנו (וכמובן נוהל פתיחת מחברות), אבל מה שהיה היה די מספיק. לא צריך יותר מיומיים-שלושה ללמוד למבחן לדעתי.\n\nהשורה התחתונה: אחלה קורס כדי לשים במגמת רקמות ולקבל בו ציון גבוה יחסית בלי להתאמץ מידי. חלק מההרצאות גם היו לי מעניינות יותר אבל אין ממש התעמקות בכל נושא, אלא יותר נגיעה בכל תחום.", "timestamp": 1690272302551}, {"author": "שם", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: דרור סליקטר\nחוות דעת - הרצאות: לא הגעתי לאף הרצאה. שיטת הלימוד  בקורס הוא כיתה הפוכה - הקלטה של דרור כל שבוע באנגלית ואז מפגש עם דרור (רשות) שבו דרור עובר במהירות על החומר הנלמד השבוע בעברית. אישית צורת הלמידה הכי טובה בשבילי היא ע\"י הרצאות פרונטליות או סיכומים אז לא צפיתי באף הקלטה. \n\nשם המתרגל/ת: ליאורה\nחוות דעת - תרגולים: הגעתי ל-2, די היה בזבוז זמן, במיוחד למי שכבר עשה במעבדה 2 את ניסוי T4\n\nשעורי הבית: יש שניים - סופר קלילים, רק 10% מהציון הסופי בסך הכל\n\nהמבחן: 40% שאלות פתוחות, 60% אמריקאי - החומר די קליל אך משעמם ויש שאלות עם ניסוח מבלבל\n\nהשורה התחתונה: קורס להכחשה", "timestamp": 1690749675602}]}