{"posts": [{"author": "שם", "difficultyRank": 1, "generalRank": 3, "semester": "201901", "text": "קורס: ג'אז לבנות בלבד (שעורי ג'אז יהיו תמיד ביום שלישי)\nחוות דעת - שעורים: מתאים לכל רמה - היו איתי בנות שהיו כמה שנים בבלט או בג'אז ובנות שאף פעם לא למדו ריקוד.\nמהלך השיעור:\nנוכחות\nחימום קבוע עם שירים קבועים (אותם שירים כל שיעור - ימאס עליכם במהרה)\nאלכסונים - קטעי תנועה קצרים שבהם הולכים לאורך האלכסון של החדר - רוב השיעור הוא החלק הזה והוא יכול להיות החלק הכי כייפי בשיעור! \nהחלק האחרון של השיעור הוא עבודה על ריקוד שלומדים במשך 4-6 שבועות - אם לא זוכרים את החלקים שלימדו בשיעור הקודם החלק הזה ממש קשוח\n\n\nהשורה התחתונה: שימו לב לשעות הקורס ואם אתם יכולים לעשות שיעור ספורט בבוקר ולשבת בשאר היום בהרצאות.", "timestamp": 1598013742284}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202002", "text": "שם המורה: יוליה \nחוות דעת - השיעורים: יוליה מדהימה, ויש לה הרבה נסיון. אכפת לה מהתלמידים שלה, ושכולם יתחזקו ויהנו. יש גם שיעורים שבהם היא מעבירה ידע על תזונה נכונה, ספורט וכו התחילת השיעור. היא כן דורשת שהתלמידים ישקיעו ויעבדו במהלך השיעורים שלה אבל לגמרי מבינה אם מישהו לא מרגיש מספיק טוב, ומעריכה שיפור והשקעה.\n\nהמבחן: היא לא מאמינה במחנים. לכן הציון מבוסס על רמת השיפור וההשקעה של כל תלמיד. \n\nהשורה התחתונה: מאוד נהניתי בשיעורים שלה. מומלץ", "timestamp": 1627653184508}, {"author": "אביגיל", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: אסנת\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nאין מבחן\nהשורה התחתונה: מומלץ! שיעורים כיפים ומתאימים לכל רמה", "timestamp": 1644148189945}, {"author": "מאי", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: יוליה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: שיעור כיפי וקליל לכל אחת", "timestamp": 1644422823117}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דוד (סלסה)\nחוות דעת - הרצאות: השיעורים עוברים באווירה נעימה וקלילה. בקבוצת המתחילים לומדים ממש מהבסיס, לא נדרש שום רקע בריקוד, ומגיעים בסוף הסמסטר לרמה דיי סבירה. הקורס לא קשה ברמה הפיסית. המדריך מאוד נחמד, מלמד באווירה טובה ועם הרבה הומור, רואים שאכפת לו והוא שמח לעזור.\nיש לשים לב שהקבוצות רשומות כביכול לפי הפרדה מגדרית, אבל השיעורים הם מעורבים כי מדובר בריקוד זוגי - החלוקה לקבוצות רישום כנראה נועדה כדי לשמור על איזון בשיעור כדי שלכולם יהיה עם מי לרקוד.\n\nהמבחן: \nבדרך כלל בשיעור האחרון צריך לבצע ריקוד לפי הנחיות באורך כדקה (בזוג). הסמסטר בגלל הקורונה, במקום זה היה אפשר לשלוח וידיאו של הריקוד אבל זה לא היה חובה.\n\nהשורה התחתונה:\nקורס קליל ונעים, מומלץ מאוד. בסוף הקורס מגיעים לרמה סבירה של ריקוד ואפשר להנות אם הולכים למסיבות סלסה.", "timestamp": 1644491080906}, {"author": "----", "difficultyRank": 3, "generalRank": 1, "semester": "202102", "text": "שם המרצה: אסנת ביטון\nחוות דעת - הרצאות: אני לא ממליצה לאף אחד שלא יודע לרקוד בלט לקחת את הקורס הזה.\n אכן בתחילת הסמסטר נאמר שאין חובה לדעת לרקוד מלפני ושאין דגש על זה בכלל ושההערכה תהיה בהתאם להשתתפות בשיעורים ונוכחות וכו' ולא הערכה על סמך רמת ביצוע, אך בפועל זה היה ההפך. לא היה מבחן בקורס זה וכולנו חשבנו שזה כן נחמד ושמה שחשוב זה ההשתתפות, אך בפועל היא נדפקתי בציון (ברמה של 88 בקורס שנכחתי בו בכל השיעורים כולל השתתפות מלאה ובלי איחורים). וגם הערעור על הציון לא התקבל מכיוון שהטענה שלה היא שרמת ביצוע שלי לא הייתה מספיק טובה יחסית לשאר (שרוקדים כבר מלפני 100000 שנים). \n וגם כשערערתי על זה שלא היה אמור להיות הערכה על סמך רמת ביצוע ושבמידה וכן הייתה הערכה כזו אז גם לא היה ליווי אישי שאדם יוכל להקדם משבוע לשבוע, היא סיננה את המיילים שלי ואחרי שליחת מייל חוזר היא ענתה שזה ציון \"גבוה\" ומגולם בו את הקריטריונים שלה.\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: אם לא רקדתם/ן בלט כבר מגיל 0, אל תיקחו. ואם בכל זאת רוצים לקחת אז שיהיה לכם/ן בהצלחה, אך אל תאמינו לזה שהיא מורה נחמדה ותדעו שרוב הסיכויים שהיא תדפוק אותכם/ן בציון.", "timestamp": 1658073553854}, {"author": "Yaniv Slor Futterman", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דיוויד\nחוות דעת - הרצאות: סלסה מתחילים. ממש כיף!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: נוכחות 90 אחוז. 10 אחוז מבחן בסוף שצריך להכין קטע ריקוד קצר של דקה. ת'כלס כיף להכין אותו וזה לקח רק כמה מפגשים של שעה פה שעה שם עם הבת זוג. מאוד כיפי אבל לא תמיד מקבלים 100. \n\nהשורה התחתונה: קורס מעולה וממש מומלץ!", "timestamp": 1658682682791}, {"author": "סלסה", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: דוד\nחוות דעת - הרצאות: ממליצה ממש על הסלסה למתחילים! לא היה לי ניסיון בריקוד מעבר לחוג אי שם ביסודי וחששתי בהתחלה מהקורס, אבל נהנתי מכל רגע!!\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: יש מבחן של ריקוד בזוגות שנמשך דקה בערך, אין לו השפעה מאוד גדולה על הציון ככה שאין סיבה להילחץ\n\nהשורה התחתונה: ממש מומלץ", "timestamp": 1659438129519}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: ניר - ריקודי עם\nחוות דעת - הרצאות: קורס נחמד, שירי ארץ ישראל קלאסיים כאלה, יש גם ריקודים במעגל וגם ריקודים בזוגות.\n\nהמבחן: אין מבחן, בערך 30% מהציון זה לזכור ריקודים שהוגדרו \"ריקודי חובה\" פעם בכמה שבועות המדריך מעדכן שיבחן על 3-4 ריקודים ספציפיים ואז בשיעור הבא כולם רוקדים אותם ביחד. הוא שולח גם קישורים לסרטונים ביוטיוב למי שרוצה להיזכר לפני. שאר הציון זה נוכחות.\n\nהשורה התחתונה: קורס נחמד בלי יותר מידי מאמץ פיזי", "timestamp": 1674734340537}, {"author": "-----", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד (סלסה מתחילים)\nחוות דעת - הרצאות: \nשעה וחצי של סלסה כל שבוע, קורס מומלץ מאוד וכיף מאוד!", "timestamp": 1675335303733}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: מחול אירובי עם ויקטוריה\nחוות דעת - הרצאות: \nויקטוריה מדהימה! היה ממש כיף", "timestamp": 1675864887320}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דוד (סלסה מתחילים)\nהמבחן: להכין ריקוד של דקה על כל הצעדים שלומדים במהלך הסמסטר\nהשורה התחתונה: ברוכים הבאים לתחביב החדש שלכם", "timestamp": 1676458292118}, {"author": "1111", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ויקטוריה\nחוות דעת - הרצאות: \nמעבירה תנועה ומחול - מחול אירובי. שיעורים מדהימים וכיפיים, מפרגנת בציונים, אני ממליצה בטירוף.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1678293958391}, {"author": "לא רקדנית", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: יוליה - מחול אירובי\nחוות דעת - הרצאות: קורס ספורט מעולה לחובבי הריקוד וגם למי שזה פחות הצד החזק שלו. יוליה מאוד נחמדה וכיפית ומלמדת קומבינציות אותן צריך לזכור משיעור לשיעור. אני נהנתי כי באמת הרגשתי שביצענו אימון אירובי טוב ומעניין.\nאין מבחן על הריקודים רק צריך להראות השקעה ולשאול כאשר לא זוכרים משהו.\n\nהשורה התחתונה: יוליה מאוד מקצועית ותומכת, מפרגנת בציונים", "timestamp": 1678993267451}, {"author": "לה קופה", "difficultyRank": 2, "generalRank": 4, "semester": "202202", "text": "שם המרצה: דוד (סלסה)\nחוות דעת - הרצאות: \nסלסה זה כיף ומגניב. אבל - לא קורס כזה קל כמו שנראה בהתחלה. ריקוד סלסה דורש קואורדינציה, זיכרון, אילתור וקבלת החלטות בשברירי שניה לגבי המהלך הבא.\n\nשעורי הבית: יש שיעורי בית בניגוד לקורסי ספורט אחרים. צריך לתרגל את הצעדים ואת המהלכים ולבוא מוכנים לשיעור הבא, אחרת לא יודעים איך לרקוד.\n\nהמבחן: יש לרקוד במשך דקה אחת עם הפרטנר/ית שלך מול דוד. בריקוד יש להציג את מרבית הצעדים והמהלכים שנלמדו במהלך הסמסטר. זה לא קל, זה דורש חזרות ותכנון של הכוריאוגרפיה. אני והפרטנרית שלי השקענו בזה משהו כמו 8 שעות בהכנה עם תכנון כוריאוגרפיה וריקוד, וכל זה בשביל הדקה הזו. \n\nהשורה התחתונה: סלסה מעניין, מגניב, ואפשר גם להגיע להרקדות של סלסה ביט בערב וללמוד אפילו עוד צעדים ועוד סגנונות. זה לא קל! אבל האינטנסיביות ממריצה וזה משתלם.", "timestamp": 1688420656604}, {"author": "...", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ויקטוריה\nחוות דעת - מחול אירובי: ויקטוריה מקסימה ברמות!! היא ממש נחמדה, בעיקר כי לא היה לי שום רקע בריקוד והיא הסבירה לי במיוחד צעדים גם אחרי השיעור רק כדאי שאצליח. ממש מפרגנת בציונים. ממליצה בחום!\n \n\nהשורה התחתונה: קורס ממש נחמד בתור ספורט, ממש נהנתי וממליצה בחום זה עושה רק טוב :)", "timestamp": 1688836254830}, {"author": "ריקודי עם מתחילים", "difficultyRank": 3, "generalRank": 1, "semester": "202202", "text": "המדריך לא ממש איתנו.\nיש מבחנים פעם בשבועיים החל מהשבוע החמישי (כשכבר אי אפשר לשנות את המערכת), בכל מבחן צריך להתכונן על 3 - 6 שירים ולרקוד חלק מהם באקראי, הוא מצלם את הריקודים ונותן לכל אחד ציון אישי על כל ריקוד.\nחוץ מזה הוא לא מורה כל כך טוב לריקוד ולכן די קשה בכל מקרה לעקוב ולהבין מה קורה, הוא מניח שכולם מתאמנים בבית וזה (אוביסלי) לא נכון לכן יש פשוט בלאגן כל השיעור.\nנראה לי שבשביל רוב האנשים כדי לקבל בקורס הזה 95 צריך להתאמן לבד עוד איזה שעה כל שבוע בנוסף על השיעור עצמו, בקיצקץ לא מומלץ.", "timestamp": 1689504126250}, {"author": "אנונימי", "difficultyRank": 4, "generalRank": 1, "semester": "202202", "text": "שם המרצה: ריקודי עם - ניר \nאמ\"לק: יש חמש מבחנים שלא רשומים בסילבוס,דורש מלא עבודה,לא מומלץ בכלל והציונים לא משקפים את מידת ההשקעה.\n\nפירוט:\nקורס עם מלא פוטנציאל אבל המדריך דורש ממך לדעת את הריקודים בעל פה ושתתאמן על זה בבית(ויש מלא ריקודים),הוא שולח בקבוצה של הפייסבוק סרטוני הסבר ישנים שלא טובים ומצפה שתלמדו בבית,במבחנים הוא מחלק לקבוצות ומצלם עם הפלפון את הקבוצות רוקדות וככה עושה את הערכת מדריך.\nכל שיעור מחולק לשעה ריקודים במעגל וחצי שעה של זוגות שהוא לוקח כל פעם *בת* אחרת וכל השאר מתחלקים איך שרוצים.\nתכלס השיעור האחרון היה כיף כי כבר ידענו את הריקודים מראש אבל הרבה פעמים היה מתסכל לרקוד בלי לדעת את הריקוד כי הוא עובד בשיטה:ללמד את הריקוד פעם אחת,שיעור אחרי זה מרענן את הידע ושיעור שלישי מצפה שכבר תדע.\n\nאחרי שנגמרת תקופת שינויים הוא מודיע שיש חמש מבחנים,אחד כל שבועיים,2 מהמבחנים כוללים 6 ריקודים שצריך לדעת מתוכן הוא בוחן על 2 ו3 מבחנים של שלוש ריקודים שהוא בוחן על אחד.", "timestamp": 1689509574720}, {"author": "פסטיבל", "difficultyRank": 4, "generalRank": 3, "semester": "202202", "text": "שם המרצה: ריקודי עם - ניר דן\nחוות דעת - הרצאות: \nהקורס מורכב מ13 מפגשים, כשבכל מפגש חוזרים על הריקודים מפעמים קודמות ולומדים ריקודים חדשים, חלקם במעגל וחלקם בזוגות. \nשעורי הבית: \nהמדריך דורש מכל הסטודנטים ללמוד כל שבוע את כל הריקודים, לא שמעתי על שום ספורט שבו נדרש משהו כזה.\nהמבחן: \nכל שיעור שני נבחנו על בין שלושה לשישה ריקודים, שהיינו צריכים לשנן.\nהשורה התחתונה: אם אתם נהנים מזה אז תקחו, אבל אם יש לכם חיים או תסבלו מזה להתרחק כמו מחזיר. הציון גם ממש נמוך יחסית לספורט", "timestamp": 1689529815172}, {"author": "סקנדל", "difficultyRank": 4, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ריקודי עם - ניר דן.\nמפגשים:\n 13 מפגשים, אחד בכל שבוע. כל מפגש חוזרים על חלק מהריקודים מהשיעור הקודם ולומדים כמה חדשים. כל מפגש מחולק לשעה של ריקודי מעגל וחצי שעה של ריקודים בזוגות פלוס מינוס. \n\nשעורי בית:\nהמנחה דורש ללמוד את הריקודים בבית מסרטונים שהוא מפרסם בקבוצת פייסבוק. בהתחלה זה היה נחמד, ללמוד כמה ריקודים פה וכמה ריקודים שם, קצת לאוורר את הראש. אבל במחצית השנייה של הסמסטר כמות העומס הכללית עולה והמנחה גם כן אינו מאחר בלהעלות את הדרישות. בשלב מסוים התרגול העצמי פשוט לוקח יותר מדי זמן.\n\nבחנים:\nציון ניתן לפי נוכחות, השתתפות במפגשים ובחנים שהמנחה עושה כל 2 שבועות. בכל בוחן נבחנים על 3-6 ריקודים. \n\nלסיכום:\nקורס כיף מאוד, אבל דורש המון(!) השקעה, המנחה קשוח מאוד.\nההחלטה היא על אחריותכם בלבד.", "timestamp": 1689531033619}, {"author": "אנונימי", "difficultyRank": 5, "generalRank": 1, "semester": "202202", "text": "קורס ריקודי עם\nשם המרצה: ניר דן\nחוות דעת - הרצאות: \nממליצה להתרחק מהקורס, יש מבחנים פעם בשבועיים לזכור בין 3 ל-6 ריקודים בעל פה, השיעורים היו באולם ללא מזגן היה חום אימים בקיץ והרגיש שניר עשה טובה שהוא נתן לנו הפסקות מים, בכללי ניר לא מפרגן ולא מתחשב בכלל\n\n\nשעורי הבית: ללמוד מלא ריקודים בעל פה\n\nהמבחן: איזה 10 מבחנים לאורך הסמסטר\n\nהשורה התחתונה: לא שווה את זה, לא ממליצה בכלל", "timestamp": 1690117732209}, {"author": "עידון ג'יאובני", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דוד ברויז (סלסה מתחילים)\nחוות דעת - הרצאות: \nדוד מלמד סלסה פשוט מדהים, השיעורים כיפיים ברמות, הספורט שהכי נהנתי בו עד עכשיו.\n\nשעורי הבית: \nאין שיעורי בית אבל כדי להישאר בטופ של הכיתה צריך לתרגל איזה רבע שעה אחרי כל שיעור כדי לזכור איך עושים הכל ולהבין דברים שלא הבנתם בכיתה. לא חובה, אבל מומלץ אם רוצים להיות טובים.\n\nהמבחן: \nמתחיל מ85 אם הגעתם לכל השיעורים. בונים ריקוד של ~דקה עם בת זוג שאמור לשלב את כל מה שנלמד בסמסטר. אם עושים הכל ברמה סבירה מקבלים מעל 95.\n\nהשורה התחתונה: \nממליץ בחום. מעטים הקורסים בטכניון שמהנים כל כך ואפשר להמשיך משם לסלסה למתקדמים או להגיע לערבי סלסה בימי ראשון.", "timestamp": 1713420840145}, {"author": "Honest Abe", "difficultyRank": 2, "generalRank": 5, "semester": "202301", "text": "שם המרצה: סלסה עם דוד\nחוות דעת - הרצאות: \nאחד הקורסים היותר כיפיים שלקחתי הסמסטר, בתור בן אדם שאין לו שום רקע בריקוד וחשב הוא יהיה ממש גרוע הייתי סבבה ונהניתי ממש.\nבערך בכל שיעור לומדים צעד חדש או שניים ומתאמנים עליהם רוב השיעור. בדרך כלל בסוף יש קצת זמן לרקוד חופשי.\nדוד מעביר את הקורס ממש בכיפיות, בצחוק, מעניין וברור. \nהמבחן: \nחושבים על כוראוגרפיה של בערך דקה עם בת זוג, לא כזה קל אבל לא כזה קשה. חשוב למצוא מישהי שאתם נהנים לרקוד איתה כי זה יהפוך את התהליך לכיף וגם את המבחן, להתאמן פעם פעמיים לשעתיים בערך יעשה את העבודה ואם דוד יראה שאתם נהנים, השקעתם והריקוד מגוון הוא ייתן לכם ציון 95+ \nהשורה התחתונה: \nלרקוד סלסה זה די קשה, זה דורש קואורדינציה, לזכור את הצעדים, לדעת בין איזה צעדים אפשר לחבר ואם אתה בן גם לדעת להוביל את בת הזוג ולהחליט תוך כדי ריקוד על הצעד הבא. רק לבוא לקורס בלי לחשוב עליו בשאר השבוע לא מומלץ, לפחות להסתכל בסרטונים ולראות שאתם די זוכרים את הצעדים יעזור בשיעורים עצמם.\nאני באתי עם כמה חברים לקורס וזה היה פשוט ממש כיף, מומלץ בחום לכל מי שמחפש דברים כיפיים לעשות ושוקל ללכת לערבי סלסה בשקוף. אני כבר נרשמתי למתקדמים סמסטר הבא.", "timestamp": 1713421809369}, {"author": "2", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוליה\nחוות דעת - הרצאות: (מחול אירובי) שיעורים מאתגרים אבל מעלים מאוד סיבולת לב-ריאה ועוברים בצורה כיפית\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: -\n\nהמבחן: -\n\nהשורה התחתונה:", "timestamp": 1715155097250}, {"author": "יובל", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המורה: דוד ברויס\nחוות דעת: עשיתי אצל דוד סלסה מתחילים באביב וסלסה מתקדמים באביב העוקב, מורה מצוין וקורס חווייתי. \n\nשעורי הבית: בכל סוף שיעור דוד מצלם את התנועות החדשות שנלמדו בשיעור ושולחים בקבוצה. אני הייתי מגיע כמה דקות לפני תחילת השיעור הבא, צופה בהקלטה (3 דקות) וגם מתרגל עם חברה.\n\nהמבחן: אין מבחן בסלסה מתקדמים, הערכה לפי השתתפות. \n\nהשורה התחתונה: קורס שווה ומהנה שמעלה את הממוצע", "timestamp": 1715426681100}, {"author": "הרקדן בסגול", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוליה - מחול אירובי\nחוות דעת - הרצאות: יוליה נהדרת, בכללי ממליץ מאוד,  כיף לרקוד רוקדים + מתיחות בערך שעה ומשתחררים רבע שעה מוקדם יותר.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס כיפי, ממליץ בחום", "timestamp": 1716319426452}, {"author": "Anne Onimus", "difficultyRank": 3, "generalRank": 4, "semester": "202301", "text": "שם המרצה: סלסה עם דוד\nחוות דעת - הרצאות: \nהקורס ממש כיפי, דוד מקסים ונחמד ועושה מלא צחוקים ובדיחות לא PC בעליל ועל כן אני מעריצה. אבל! קודם כל זה קורס די קשה, הוא דורש הרבה עבודה במהלך השבוע ולזכור הרבה צעדים, והמבחן הוא לבנות ריקוד של דקה בזוגות אז זה דורש יום-יומיים של חזרות למבחן.\nראיתי פה בביקורות הקודמות חברה שאומרים שאם השקעתם אתם תקבלו 95+, ואני רק רוצה להגיד שזו פרופגנדה ציונית מגעילה. מותק, גם ריצ'רד פיינמן כנראה יקבל 95+ אם הוא ישקיע בקורס פיזיקה למתקדמים, אתם כנראה קצת פחות.\nאם יש לכם יכולות ספורטיביות וניסיון בריקוד אתם כנראה תקבלו את הציונים היפים, ואם אתם קלאמזי כמוני לא משנה כמה תשקיעו הציון שלכם יהיה יותר באזור ה92.\nבנוסף חשוב לציין שהקורס יותר קשה לבנות, כי הבנים הם אלה שמובילים. זה אולי נשמע שזה אמור להיות קל יותר למי שמובל אבל זה בדיוק הפוך - מי שמוביל פשוט מחליט איזה צעד בא לו לעשות, ומי שמובל מקבל בוחן פתע באינפי כל פעם מחדש שבו הוא אמור לנחש לפי הזווית של הבן זוג וגובה היד והטיית המישור לאיזה צעד הוא מכווין אתכם עכשיו, להגיב מהר ולעשות את הצעד הנכון.\n\nבקיצור אחלה קורס ואחלה דוד, אבל דורש המון השקעה ואם 90+- מוריד לכם ממוצע אולי עדיף לקחת קורס אחר במקום.", "timestamp": 1716756693965}, {"author": "עוד אחד", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: דוד (סלסה מתחילים)\nחוות דעת - הרצאות: מקסים, אין עליו :)\n\nהמבחן: מכינים ריקוד של דקה ורוקדים מול כולם, היה כיף בסך הכל! יש הזדמנות לשפר ולרקוד פעם נוספת.\n\nהשורה התחתונה: ממליץ מאוד!", "timestamp": 1716885113159}]}