{"posts": [{"author": "אנונימי1", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם הקורס: כ\"ג בקצב אישי עם טימאה\n\nטימאה ממש מצויינת, תמיד בחיוך ותמיד חיובית. תוך שניים שלושה שיעורים הכירה כבר את כולם. \n\nהשיעורים בנויים בתור אימון קבוצתי, אצלנו היה באולם ספורט. תרגילים מגוונים (בטן, רגליים, ידיים וכו') ופעם בכמה שיעורים עושים סיבובי ריצה בחוץ, לא אינטנסיבי. אין לחץ, הכל באמת בקצב אישי. האימונים בנויים היטב והמתיחות שטימאה מעבירה בסוף באמת ממש מעולות, מעולם לא הרגשתי ככה טוב אחרי אימון.\nעדיין לא קיבלנו ציון אבל אני נהניתי לבוא.\n\nהשורה התחתונה: מומלץ בחום לכל מי שהוא לא חיית כושר. אם אתה Buff boy שקם מסט שכיבות סמיכה בבאק-פליפ, תעשה טובה ותירשם לקורס אחר. למרות שטימאה תשמח שתבוא. היא תותחית.", "timestamp": 1641940795913}, {"author": ":)", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "תעשו ספורט זה חשוב", "timestamp": 1651663117174}, {"author": "סטודנט", "difficultyRank": 5, "generalRank": 1, "semester": "202102", "text": "שם המרצה: לא זוכר את השם הוא מהמכון כושר\nחוות דעת - הרצאות: זה פשוט לא TRX . זה שכתוב TRX פונקציונלי זה פשוט חרטה. אימון פונקציונלי לגמרי וזה פשוט סיוט! \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: אל תגיעו!!!!!! אל תרשמו לזה!", "timestamp": 1652694606863}, {"author": "TRX", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "TRX עם טטיאנה, האימונים עצמם עם טטיאנה מאד מאד קשים, היא מתחילה קשה ומעלה עוד יותר את הקושי ככל שעובר הסמסטר, מי שבא להתאמן ולבנות כושר ייצא מרוצה מאד עד סוף הסמסטר. לא מומלץ לבעלי לב חלש. אני הגעתי שמנמן ויצאתי עם כושר וסיבולת מעולים. הציונים היו גבוהים מאד למי שהיא ראתה שהשקיע ולא וויתר (גם אם לא הצליח לסיים את כל התרגילים).", "timestamp": 1661077060406}, {"author": "ויוה", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: גלית (קור פיטנס)\nחוות דעת - הרצאות: \nמגניב, עובדים קשה אבל רואים תוצאות בסוף הסמסטר. כיף\n\nהמבחן: \nלא היה מבחן וקיבלתי 87 למרות שלא השלמתי 2 שיעורים(זה שווה ערך ל10 נק בערך?) אז היא דיי נדיבה.", "timestamp": 1677685359996}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: פקה\nחוות דעת - הרצאות: \nנרשמתי להליכה ספורטיבית. אם תגיעו לכל השיעורים (או תשלימו אם היה לכם חיסור) ולא יהיו לכם ביצועים טובים מדי במדידות תקבלו משהו באזור ה 90-95.\nהציון מתבסס רק על המדידות שלו ועל אם היה חיסור שלא השלמתם, לכן זה לא משנה להראות אם התאמצתם או לא, העיקר שתגיעו בשיעורים שהוא עושה מדידות (לא ממש אפשר לדעת מראש) ובזמן הזה תעשו הכי טוב שלכם. גם אם לא תעשו הכי טוב, יהיה לכם ציון טוב בכל זאת.\nשימו לב שהמסלול הוא לא בהכרח הכי קל, הוא די ארוך ויש המון עליות קשוחות בדרך.", "timestamp": 1678791638090}, {"author": "אנונ'", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דפנה\nחוות דעת -  שיעורים לא הכי כיפים, כל מיני תרגילי יציבה ומשקל גוף.\nתמיד בהתחלה עושים איזה 15 דק' ריצה לחימום שזה דווקא החלק הטוב יותר.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: קורס ספוט לא מעניין או מהנה במיוחד, אבל ציונים מאוד גבוהים ולא מצריך מאמץ מיוחד, מומלץ מאוד!", "timestamp": 1679420153383}, {"author": "מ", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: גלית?\nטיארקס היה ממש כיף ושווה , \nאימונים קשוחים בקטע טוב, אם קשה לך מידי אפשר לנוח וזה סבבה (לא מאמין שזה משפיע על הציון) ממש כיף", "timestamp": 1679668074934}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: TRX עם טימאה\nחוות דעת - הרצאות: אחלה מאמנת. עצימות בינונית. אימונים של כשעה ועשר דקות.\n\nהמבחן: אין. ציון מבוסס על הערכה + נוכחות.\n\nהשורה התחתונה: מומלץ.", "timestamp": 1691854346870}, {"author": "זיו ברזילי", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה:  גלית\nחוות דעת - הרצאות: TRX \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: אין מבחן על סמך רושם והשתתפות\n\nהשורה התחתונה: אחלה", "timestamp": 1693044006478}, {"author": "פילאטיס עם יוליה", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: פילאטיס עם יוליה\nחוות דעת - הרצאות:\nיוליה היא אחלה מדריכה ומעבירה את השיעור טוב מאוד.\nהשיעורים זה לא סתם לשכב עם המזרן. עובדים על כל השרירים בגוף ויש תרגילים מאוד אינטנסיבים.\n לי היה לי ממש קשה במיוחד בפעמים הראשונות כשכל השרירים נתפסים למשך שבוע.\nשעורי הבית: \nבערך רבע שעה מתאגנים על מזרונים, מקריאים שמות ועושים מתיחות, עוד 55 דקות של אימון ואז עוד 5 דקות של מתיחות\nהמבחן: \nאין מבחן. לפעמים יוליה מסתכלת עלינו ואם מישהו עושה לא נכון אז היא אומרת לו תעשה ככה לא ככה אבל נדיר שהיא העירה.\nהשורה התחתונה: \nיכול להיות פינוק למי שמחברת, אני רק חיכיתי שייגמר. מומלץ לבוא עם מגבת שתפריד בינך לבין המזרן", "timestamp": 1713195880281}, {"author": "Ilya Katz", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "קורס: TRX עם יוליה, שלישי ב-10:30\nחוות דעת: יוליה ממש מתוקה! האימון עבר באופן אינטנסיבי ודרש כוח ועצימות, אבל יוליה כן ציינה כמה פעמים שהקצב הוא אישי ולא העירה אם אנשים הלכו לשטוף פנים או לעצור לדקה.\n\nהשורה התחתונה: קורס ספורט לא קל יחסית, אבל כן מחטב ועוזר לשמור על כושר במהלך הסמסטר.", "timestamp": 1713691402045}, {"author": "שניר חן", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוליה - TRX / כושר פונקציונלי\nחוות דעת - הרצאות: יוליה ממש ממש טובה.. הייתי בכושר פונקציונלי והיא הפכה אתזה לTRX שהיה ממש טוב וברצה גבוהה.. הרגשתי מאותגר מאוד אימון ממש טוב לכל הגוף\n\nשעורי הבית: \n\nהמבחן: ציון סופי בלי מבחן רק נוכחות (מרגיש שבאופן רנדומלי בוחרים בין 96 ל100 כל מי שהיה עם הנוכחות הנדרשת) \n\nהשורה התחתונה:  מומלץ בחום.", "timestamp": 1716744705328}, {"author": "^", "difficultyRank": 1, "generalRank": 1, "semester": "202302", "text": "שם המרצה: פקה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס חדר כושר מעורב, פקה בדרך כלל נותן איזה 20-30 דקות משהו בתחילת שיעור (ריצה או קצת כוח) ואז נותן זמן חופשי, מחלק לכולם ציון 95 אלא אם החסרתם ואז הציון יורד, ללא תלות בביצועים שלכם במבחן, חרא על פקה אל תלכו אליו גרוע אלא אם אתם חייבים", "timestamp": 1717182441712}]}