{"posts": [{"author": "---", "difficultyRank": 1, "generalRank": 5, "semester": "201903", "text": "שם המרצה: \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: הספורט המקוצר היה נהדר מומלץ בכל הרמות", "timestamp": 1601744806824}, {"author": "Itai Friman", "difficultyRank": 1, "generalRank": 5, "semester": "202003", "text": "שם המרצה: גלית\nחוות דעת - הרצאות: \nהקבוצה שאני הייתי בה הינה אקווה-פורס. ממש כיף, בונה את השרירים ואת יכולת היציבה. דורש הרבה איזון וריכוז. אפילו הרזיתי קצת :)\nשעורי הבית: אין\nהמבחן: אין, הציון הוא על השתתפות , מאמץ ונוכחות\n\nהשורה התחתונה: אקווה פורס ממש מומלץ! מקורסי הספורט שהכי נהניתי בהם (ולקחתי יותר מ-2...)", "timestamp": 1633452681100}, {"author": "idan fischman", "difficultyRank": 3, "generalRank": 5, "semester": "202003", "text": "שם המרצה: שי (גלישת רוח)\nחוות דעת - הרצאות: שי המאמן היה מעולה, תותח רציני ומלמד באווירה כיפית ומקצועית.\nבעקרון יש שישה גלשני רוח ומלא קאיקים. מתחלקים בזוגות על גלשן וקאיק ומתחלפים באמצע. זה נשמע שלא גולשים הרבה רוח אבל בתכלס  זה סופר מעייף לגלוש אז זה מסתדר טוב שחלק מהזמן נחים על הקיאק.\n\nכל שיעור מתחיל בזה ששי מדגים על מה עובדים הפעם. מתחיל מהמיומנות הכי בסיסית ובסוף המטרה היא להצליח להגיע מכל נקודה לכל נקודה.\nבשבועיים הראשונים בערך נשארנו בתוך המפרץ של החוף השקט, ואחר כך יצאנו לים. כשיוצאנו לים שי המאמן הצטרף עם סירת מנוע והסתובב בין הגולשים, וגם החזיר לחוף אם נסחפת.\n\nהשורה התחתונה: קורס קיץ מגניב למי שאוהב גלישה ואת הים. אני נהניתי וממליץ בחום אבל לדעתי זה פחות מתאים למי שמחפש לא להתאמץ.", "timestamp": 1634846015187}, {"author": "אנונימי אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202103", "text": "שם המרצה: אלכס\nחוות דעת - אימונים:  אלכס מקצוען בטירוף, מצחיק ולב זהב! מאוד קשוב לסטודנטים ועוזר מאוד בכל מה שיכול. כל האימונים איתו היו באווירה טובה ונעימה.\n\nהמבחן: תחרות קיאיקים בזוגות. זוג שמגיע ראשון מקבל 100. לא על זמן.\n\nהשורה התחתונה:קורס כיפי באווירה טובה. אלכס מתאים את עצמו לקבוצה ולא בא לקרוע את המתאמנים. הכל בהדרגה .", "timestamp": 1665325931634}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202103", "text": "שם המרצה:  הראל. קורס סאפ\nהגעה - זה ליד החוף השקט, כמה מטרים אחרי יש ירידה לחניה וכניסה למרכז ספורט ימי. \nחיסורים - כמו בכל הספורט בטכניון, אפשר להחסיר עד 3 ולהשלים בקורס אחר.\n\n\nהשורה התחתונה: כיף מאוד", "timestamp": 1667031794057}]}