{"posts": [{"author": "salsal", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: סבטלנה\nקורס ממש כיפי, לומדים על מפות וסימנים, לאחר מכן נותנים לנו מפה של הטכניון עם כמה תחנות וצריך לרוץ מתחנה ולמצוא את התחנה הבאה! כמו המירוץ למיליון :)\nהמאמנים ממש ממש מדהימים ונחמדים!\nקורס אחלה! רק אל תשכחו לשים קרם הגנה כי אותי שרפה השמש!", "timestamp": 1624984597100}, {"author": "slow rider", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "קורס: אופני הרים למתחילים\nשם המרצה: אנריקה (איגלסיאס) סטרמר\nחוות דעת - הרצאות: \nחשוב לשים לב שאומנם כתוב שהקורס למתחילים, אבל מי שלא נמצא ברמת כושר בינונית+ יתקשה בקורס.\nעושים הרבה עליות, סינגלים, רכיבות שטח בגשם, ואפילו קצת BMX.\nהשעות של הקורס מוקדמות ולפעמים קר, ולמי שזה יגרום לאחר לא כדאי להירשם. איחורים זה big no-no.\nאנריקה מורה מגניב, הקורס היה לי קשה אבל אני גם מרגיש שלמדתי לרכוב בצורה הרבה יותר נכונה ובטיחותית.\n\nהשורה התחתונה: \nאחלה קורס למי שיש כושר וקצת נסיון עם אופניים.", "timestamp": 1645010822041}, {"author": "רצים רצים באוויר", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "ריצות ארוכות 19 עם איליה רייטר\n\nקורס ממש נחמד למי שאוהב ריצות ארוכות.\nכל שיעור רצים 5-6 קילומטר, בשיעורים הראשונים הריצה היא בטכניון או בנווה שאנן ואחר כך באיצטדיון אתלטיקה ליד קנדה.\nמבחינת נוכחות יש קריאת שמות בהתחלה אבל אחרי שמסיימים את הריצה (בערך חצי שעה) אפשר ללכת.\nקשה לקבל 100 אבל לא ראיתי מתחת ל-97 (כל עוד הנוכחות מלאה) ובאופן כללי איליה בחור טוב ובא לקראת הסטודנטים.\nלדעתי קורס כיף ומומלץ אבל לא מתאים למי שלא בא עם ניסיון בריצות כאלה.", "timestamp": 1646451346782}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה:  פלדנקרייז\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: קורס קליל ביותר, עושה טוב לגב אבל קצת משעמם. לא ספורט בכלל, יותר קרוב למדיטציה עם תנועה. ציונים גבוהים יחסית לספורט.", "timestamp": 1657781659156}, {"author": "Someone", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: סבאלנה (ניווט ספורטיבי)\nחוות דעת - הרצאות: קורב מעניין סבטלנה ובעלה ולרי הם אחלה אנשים, מצחיקים וכיפים. אכפת להם שהסטודנט להתקדם ועוזרים ממש.\nלמי  לא יודע איך מתנהל הקורס:\nזה פעם בשבועיים ביום ששי בבוקר בדרך כלל מסימים יותר מוקדם ממה שמותכנן. נותנים לכם מפה לנווט בעזרתה עם סימני תחנות ללכת לתחנות לפי סדר\\או לפי מסלול מסויים לסמן את הפתק שנותנים לכם בצבע הנמצא בכל תחנה \nשעורי הבית: ללמוד כמה סימנים לאחד המפגשים  וזהו.\n\nהמבחן: אין מבחן מיועד בקורס, הציונים הם לפי נוכחות כמעט 65% והשאר לפי הערכה אישית. \n\nהשורה התחתונה: לקחת את הקורס. לא קשה במיוחד אלא ההפך. יש קצת ריצות לפעמים. מאוד מומלץ. זה שהוא פעם בשבועיים חוסך זמן והרבה פחות שעות סכ\"ה בקורס", "timestamp": 1658397224042}, {"author": "~", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: יפעת (פלדנקרייז)\n\nקורס קליל, לא דורש כמעט כלום. לא באמת עושים שם ספורט, שוכבים על מזרון רוב הזמן. זה קורס שמצריך סבלנות, והרבה, אחרת אתם ממש תסבלו בשיעורים. מאוד לא מומלץ לאנשים עם נטייה להירדם.\nאם היא זוכרת אתכם בסוף הסמסטר כנראה שתקבלו ציון טוב (95+).", "timestamp": 1674738177589}, {"author": "DUDE", "difficultyRank": 1, "generalRank": 2, "semester": "202201", "text": "שם המרצה:  יפעת (פדלנקרייז)\nאני אישית לא אהבתי, חופר מתסכל ולעשות סיבובים על מזרנים שעמם אותי כל שבוע מחדש. החסרתי פעמיים וקיבלתי 92.\nממליץ לקחת ספורט שכבר נהנים ממנו\nיפעת הוגנת ונחמדה", "timestamp": 1677684733789}, {"author": "אלון", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נטלי (שחמט)\nחוות דעת - הרצאות: נטלי היא מורה טובה , היא מאוד מקצועית בשחמט ומסבירה יחסית טוב את מה שהיא מנסה להעביר.\n\nמצד שני היחס שלה לסטודנטים הוא דיי נמוך, היא מאוד שחצנית ומתנשאת, בדברים שלא קשורים לשחמט היא מאוד לא מובנת.\nמי שמחסיר שיעורים יכול להשלים אותם במועדון שחמט בנשר אבל חוץ מזה אין התחשבות בשום דבר והיא לא באה לקראת הסטודנטים בכלל.\n\nבנוגע לשחמט אל תבנו על לשחק בשעה וחצי של השיעור, רק אם תגיעו לפני יהיה לכם זמן לשחק. מבחינת לשחק בבית. כמעט כל שיעור יש דף עם שאלות שחמט.\n\nהשורה התחתונה: לומדים הרבה שחמט , לא משחקים בכלל (רק בבית). נטלי מלמדת טוב אבל היחסי אנוש שלה פח ונראה כאילו היא ממש מנסה לחנך אותנו (שזה מאוד מעצבן)", "timestamp": 1688401642936}, {"author": "~~", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: יפעת\nחוות דעת - הרצאות: \nפלדנקרייז-\nאחלה של קורס, יפעת מאמנת מקסימה וקשובה. כל הקורס הוא על מזרון ועושים כל מיני תנועות של מפרקים קליל ונחמד.\n\n\n\nהשורה התחתונה: מומלץ מאוד למי שמחפש ספורט שלא מזיעים בו אבל כן מקבלים ממנו ערך מוסף לתנועתיות של הגוף", "timestamp": 1689247182585}, {"author": "מבין עניין", "difficultyRank": 1, "generalRank": 3, "semester": "202202", "text": "שם המרצה: נטלי (שחמט)\nחוות דעת - הרצאות: \nאוהבת מאוד שחמט, קצת רצינית, אם מתייחסים אליה בכבוד היא תתייחס בחזרה.\n\nהשורה התחתונה: \nהציון מתבסס על נוכחות + מבדקים קצרים כל 2 שיעורים (שואלים מה המהלך הכי טוב בפוזיציה נתונה, פשוט פאזלים).\nכל שיעור לומדים קונספט בסיסי במשחק (מה המטרה בפתיח, איך משחקים endgame עם מלכים וחיילים, זיהוי מטים בסיסיים) וברבע השעה האחרונה (לא תמיד) משחקים מעל לוח.\n\nבאתי עם קצת רקע במשחק (1200 בchess.com) וכן מרגיש שלמדתי כמה דברים חדשים, אבל מצד שני אפשר לסכם את כל מה שלמדתי בסרטון של 10 דקות ביוטיוב, לכן אם אתם מצפים לשחק הרבה מעל לוח או להשתפר מאוד, זה לא הקורס הנכון.\n\nאם יש לכם יכולת טובה בפאזלים, זה קורס של 98+ קל.\nבכל מקרה אני לא ממליץ, עדיף לקחת קורס ספורט שאתם נהנים ממנו", "timestamp": 1689502776773}, {"author": "asaf worku", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: איליה\nחוות דעת - הרצאות: במהלך המפגשים רצים למרקים שונים. כל אחד יכול לרוץ בקצב שלו. מפגשים קצרים יחסית וקלילים.\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: מבחן 5 ק\"מ בסוף הקורס. גם מי שלא נצליח להשלים את הריצה מקבל ציון טוב. איליה ממש אחלה.\n\nהשורה התחתונה: מומלץ מאוד", "timestamp": 1689662538716}, {"author": "~", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "הספורט: ניווט \n\nהיה מאוד כיף להכיר את הספורט ,האימונים הם פעם בשבועיים בשישי ואפשר להחליף שיעורים בתחרויות ניווט. לי החוויה הייתה שווה את להישאר בשישי אבל שווה לחשוב האם זה גם יהיה בשבילכם", "timestamp": 1703523646416}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יפעת\nחוות דעת - הרצאות: פלנדרקרייז - נחמד ביותר למי שלא מעוניין באמת לעשות ספורט, והיא נותנת ציונים טובים\n\n\nהשורה התחתונה: מומלץ", "timestamp": 1716820284258}]}