{"posts": [{"author": "Dunia", "difficultyRank": 1, "generalRank": 3, "semester": "202002", "text": "שם המרצה: לאונטי \nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: לא מומלץ", "timestamp": 1626283871508}, {"author": "/", "difficultyRank": 1, "generalRank": 4, "semester": "202101", "text": "שם המרצה: לאונטי\nחוות דעת:  קודם כל צריך להגיע לאודישן שמתקיים בשיעור הראשון. קחו בחשבון שלאונטי מאוד לא מתגמש עם איחורים או אנשים שמפספסים את האודישנים. באודישן לאונטי בודק אם אתם לא מזייפים, אם אתם יכולים לשיר אחריו רצף בסיסי של כמה תווים (לזכור את מה שהוא מנגן לכם פעם אחת ולשיר), וקצת חוש קצב. בעיקר צריך להיות עם שמיעה מוזיקלית סבירה ויכולת לא לזייף. \nלגבי השיעורים עצמם - בפיתוח קול 1 לא שרים המון, בהשוואה לקורס המשך שבו הדגש הוא ממש על שירה. בקורס הראשון לומדים לא מעט תיאוריה מוזיקלית (סולמות, אקורדים, מעגל קווינטות וכו'). לאונטי טיפוס קצת קשוח ויצפה שתזכרו את כל החומר שלומדים בצורה טובה והוא יבחן אותכם על זה. חוץ מזה עובדים על עקרונות נכונים לשירה - איך לנשום, איך להחזיק את הגוף כששרים, איך להוציא צליל, והוא יתן הרבה תרגילים בסיסיים שיעבדו על הדברים האלה. שרים בשיעור בעיקר תרגילי חימום בסיסיים ולא הרבה מעבר. הקורס נחמד בפני עצמו למי שמתחבר לרעיון של ללמוד הרבה חומר מקדים, והוא בעיקר דרישה בשביל להתקבל לפיתוח קול 2 - ששם ממש שרים כל השיעור ועובדים על יצירות.", "timestamp": 1648208049251}, {"author": "א", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: לאונטי\nחוות דעת - הרצאות: אם יש משהו שציפיתי לו במהלך השבוע זה השיעורים עם לאונטי. צריך קצת זמן להתרגל אליו, אבל הכל באווירה טובה. השיעורים רציניים, מצחיקים, מאתגרים הכל ביחד. (אה והאודישן בשיעור הראשון הוא בצ'רצ'יל למרות שהיה כתוב אולמן באתר בזמנו)\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1674772735844}, {"author": "bahia omari", "difficultyRank": 3, "generalRank": 5, "semester": "202201", "text": "שם המרצה: \nחוות דעת - הרצאות:  נעים מאוד להכיר בן אדם כמו לאונטי .\nצריך להתכונן ולדעת מה עשיתם בשיעור שעבר ולזכור כל מילה .\nאל תשתמשו במילות : אבל , כאילו .\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית:  פשוט תקשיבו טוב בשיעורים . אין בכלל עומס \n\nהמבחן: \nאין\nהשורה התחתונה:", "timestamp": 1677143127623}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: לאונטי\nחוות דעת - הרצאות: הקורס מלמד תרגילי נשימה וזמזום כדי להתחמם ולהתרגל לשירה בצורה טובה, ותאוריה של המוסיקה. לא באמת שרים בקורס, אבל זה אחלה למי שרוצה את הבסיס והבנתי ששרים באמת בפיתוח קול 2. לאורנטי עצמו הוא טיפוס, קצת קשוח ובכלל לא politically correct. לא להגיע אם אתם אנשים רגשיים ולקבל את הביקורות שלו באהבה ולהמשיך, זה לא אישי\n\nשעורי הבית: אין, אבל מאד מומלץ לעבור על החומר והתרגילים מהשיעורים הקודמים, כי הוא מתחיל כל שיעור עם חזרה שבו הוא מצפה שתזכור אתת כל השיעור הקודמם מילה במילה.  \n\nהמבחן: אין, כולם מקבלים 100\n\nהשורה התחתונה: סבבה אם רוצים ללמוד את הבסיס לשירה ומוסיקה", "timestamp": 1678697123124}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 1, "semester": "202202", "text": "שם המרצה: לאונטי וולף\n\nחוות דעת - הרצאות: לאונטי הוא אדם לא נעים בלשון המעטה. \nהוא דיי מנותק מהמציאות, חסר טקט, שלא מכבד את הסטודנטים בכלל.\n\nבשיעור עצמו עומדים/יושבים כל הסטודנטים על במה, בה לאונטי מבקש מכל אחד לבצע תרגיל מסוים כל פעם.\nקחו בחשבון שאם נלחצתם/עשיתם את התרגיל בצורה לא טובה, לאונטי פשוט ישפיל אתכם מול כל הסטודנטים האחרים.\nבנוסף, בפיתוח קול יש צורך לתת חוות דעת על אופן הנשימה מהבטן, ולאונטי עבר אחד אחד ונגע בנו פיזית לבדוק האם אנחנו עושים את זה כמו שצריך.\n\nבקורס לומדים תאוריה בסיסית של מוזיקה, ועושים תרגילים שנועדו לפתח את הקול.\n\nהקורס יכל להיות ממש כיפי ומלמד מבחינת התוכן, אך אופן הלימוד מתבסס על זיכרון ופחד מלא לדעת את התשובה הנכונה כי אז ינזפו בך.\n\n\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מאוד לא מומלץ כל עוד לא מחליפים את לאונטי.", "timestamp": 1696175777119}]}