{"posts": [{"author": "שם", "difficultyRank": 1, "generalRank": 5, "semester": "202002", "text": "שם המרצה: יוליה פילטוב\nחוות דעת - הרצאות:  ספורט כיפי מאוד. עובדים על חיטוב הגוף בצורה מאוד רצינית.\n \nהמבחן: אין מבחן הציון ניתן לפני תפקוד בשיעורים. לא צריך להיות ספורטאי מדהים, רק לעשות את המקסימום ביחס אליך. \n\nהשורה התחתונה: קורס מומלץ למי שרוצה לעבוד על השרירים באמת, מאמנת מדהימה!", "timestamp": 1626617651697}, {"author": ".", "difficultyRank": 2, "generalRank": 5, "semester": "202101", "text": "שם המרצה: נטלי בסקין\n\nקיקבוקסינג - חוות דעת: \nנטלי מקצועית, דוחפת ודורשת עבודה, הכל עם חיוך ואנרגיות.\nהשיעורים מגוונים ודורשים מאמץ.\nהשיעורים לא קלים מבחינת קוארדינציה ומבחינה פיזית (השרירים תפוסים יום למחרת..),אבל מרגישים את המאמץ המשתלם ובקיצור באמת כיף.", "timestamp": 1641229148674}, {"author": "\\", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: פקה\nהליכה ספורטיבית.\nחוות דעת: קורס מונפץ. עדיף על שאר קורסי הספורט שלקחתי עד כה חחחח פשוט הולכות במעגלים במשך שעה.\n\nהשורה התחתונה: מומלץ", "timestamp": 1644425603255}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202101", "text": "שם המרצה: דפנה - אירובי + עיצוב\nחוות דעת - הרצאות: \nקורס ממש קליל וברמה נמוכה גם למי שלא בכושר.\nדפנה מקסימה ומאוד רוצה שכל אחת תעשה את המקס' שלה ולכן השיעורים מועברים בצורה רגועה. \nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \nציון מבוסס על נוכחות והערכה אישית, יש ציונים גבוהים כמובן.\nהשורה התחתונה:", "timestamp": 1645267865425}, {"author": "קאנגורו", "difficultyRank": 1, "generalRank": 2, "semester": "202102", "text": "קאנגו\nשם המרצה: נטלי בסקין\nחוות דעת - הרצאות: השיעורים עצמם כיפיים אבל נטלי נותנת ציונים נמוכים ומאוד לא נעימה ברמה האישית.\n\n\nהשורה התחתונה: אם אכפת לכן מהציון אל תלכו אליה", "timestamp": 1649420246244}, {"author": "חנה רובינס", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "שם המרצה: טימאה\nחוות דעת - הרצאות: TRX-אימון קשה, אבל טוב. \n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: לשים לב-הקורס מעורב בנים-בנות.\nבכללי מאוד נהנתי", "timestamp": 1658322764994}, {"author": "סטודנטית", "difficultyRank": 1, "generalRank": 4, "semester": "202102", "text": "שם המרצה: תימאה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: לי היה די משעמם, לקחתי אותו מחוסר ברירה. אבל אפשר להעביר את זה בסבבה גם בלי להיות בכושר. ציון 95 זה די גנרי בקורס הזה, אל תצפו ליותר.", "timestamp": 1659099576645}, {"author": "אני", "difficultyRank": 1, "generalRank": 5, "semester": "202102", "text": "אירובי עיצוב של דפנה\n\nקצת התבאסתי שתחילת כל שיעור הלכנו איזה 20 דקות הליכה בחוץ הלוך וחזור אינספור פעמים (להרגשתי סתם כדי למרוח את הזמן ולקצר את השיעור). אבל דפנה נהדרת, יש לה כל פעם תרגילים חדשים והיא כל פעם משלבת משהו אחר (משקולת, קוביית ספוג, TRX וכו) ממש הרגשתי שהתאמנתי ושנהניתי.", "timestamp": 1660403445272}, {"author": "Nagam Abo hamdy", "difficultyRank": 1, "generalRank": 4, "semester": "202201", "text": "שם המרצה: נטלי בסקין\nחוות דעת - הרצאות: \nנטלי ממש מקצועית אתה מרגיש שאתה מתאמן באמת, כל שיעור יש תנועות חדשות ולפעמים הכניסה לנו גם דברים כיפיים אבל הכל דורש מאמץ, ככה שאחרי כל שיעור כל הגוף יהיה תפוס, עדיין זה קורס כיפי מאוד למי שרוצה להתאמן באמת ולהתאמץ\n\nהמבחן: אין מבחן אבל היא לא נותנת ציונים גבוהים יחסית לשאר קורסי הספורט, בסביבות 90.\n\nהשורה התחתונה: קורס כיפי, אבל דורש מאמץ", "timestamp": 1677311666672}, {"author": "T", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: ויקטוריה עיצוב וחיטוב\nחוות דעת - שיעורים מאוד טובים ומגוונים, כל שבוע עשינו משהו אחר. \n\nהמבחן: אין מבחן, נותנים ציונים לפי השתתפות ועבודה במהלך השיעורים. לא היה אצלנו ציון מתחת ל-96.\n\nהשורה התחתונה: מאוד מומלץ, אני נהניתי ובסוף גם יוצאים עם ציון גבוה.", "timestamp": 1677322758981}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות:  לא ממש אכפת לה כמה תתאמצו כל עוד אתן שם, אז זה ממש כיף ונח\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה: מומלץ", "timestamp": 1679666676219}, {"author": "הילה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חוה מרגלית\nחוות דעת - הרצאות: הכי מתוקה בעולם, אימונים בקצב אישי, חוה מאוד מתחשבת\n\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: חוה מתוקה ומפרגנת בציון למי שמגיעה ומשקיעה מה שהיא יכולה", "timestamp": 1681981937578}, {"author": "הילה", "difficultyRank": 1, "generalRank": 5, "semester": "202201", "text": "שם המרצה: חוה מרגלית\nמעבירה כש\"ג בקצב אישי- פשוט הכי מתוקה בעולם, היה ממש כיף איתה, זה באמת בקצב אישי כל אחת עושה מה שהיא יכולה\nהמבחן: אין מבחן, היא בוחנת אותך במשך הסמסטר ועל זה הציון\n\nהשורה התחתונה: חוה הכי חמודה שיש ואני נהנתי מאחלה אירובי", "timestamp": 1689425528858}, {"author": "אנונימית", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: ויקטוריה עיצוב וחיטוב\nויקטוריה פשוט מושלמת, לכו אליה. לא משנה לאיזה קורס.\nהיא מעבירה גם פילאטיס, מחול אירובי ואולי עוד כמה קורסים.\nבעיצוב וחיטוב היא קרעה לנו את הצורה, אתן לא תבואו להתגלגל שעה על מזרון וללכת- אבל זה ממש מרענן לאור העובדה שכנראה כולנו יושבות על הטוסיק רוב היום. \nויקטוריה גם קורעת מצחוק אז לפחות מזיעים עם חיוך.\nאין עדיין ציונים אבל אני מאמינה שלא תאכזב.", "timestamp": 1689448998569}, {"author": "-", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פקה-חדר כושר\n\nהמבחן: 12 דקות ריצה על ההליכון ומבדק של שכיבות שמיכה(לבנות על הברכיים) וכפיפות בטן\n\nהשורה התחתונה: \nאחלה קורס ואחלה ציונים :)\nפקה אמר בהתחלה שזה לא קורס למי שסתם רוצה לבוא להתאמן בחדר כושר ולקבל נק\"ז אבל בפועל הרבה מהאימונים היו אימונים חופשיים :)", "timestamp": 1689497973867}, {"author": "כורה נתונים", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: נטלי בסקין - קיבוקסינג\nחוות דעת : נטלי תותחית על, אבל הרגה אותי, חייבים לבוא בכושר בינוני-טוב כדי לשרוד את הקורס.\nהשורה התחתונה: מאוד מאוד מומלץ, לקחת בחשבון שיוצאים עם שרירים תפוסים. פעילות אירובית חזקה. נותנת ציונים גבוהים למי שמשקיע ולא יושב בצד.", "timestamp": 1689612223528}, {"author": "0000", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: ויקטוריה\nחוות דעת - הרצאות: שיעורים שלה חמודים אבל לא מפרגנת בציונים! הייתי בפילאטיס\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1689703431677}, {"author": "is", "difficultyRank": 1, "generalRank": 4, "semester": "202202", "text": "שם המרצה: טימאה\nחוות דעת - הרצאות: מתוקה ממש\n\nהשורה התחתונה: \nבגדול זה לעשות כל מיני סטים של תרגילים\nתחילת סמסטר היה חמוד אבל עם הזמן נהיה לי די אינטנסיבי וקשה אבל כל אחת יכולה לעשות בקצב שלה\nקיבלי 96 אבל אין היסטוגרמה ספציפית לקורס הזה, מניחה שהיא נתנה ציונים טובים לכולן", "timestamp": 1689756239202}, {"author": "נופר", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: פילאטיס- מקק\nחוות דעת - הרצאות: ויקטוריה\nמדהימה, מטורפת עליה. מכניסה לאווירה חיובית וכיפית. אחזור אליה בוודאות סמסטר הבא\n\n\nהשורה התחתונה:", "timestamp": 1690116616397}, {"author": "דנה", "difficultyRank": 1, "generalRank": 5, "semester": "202202", "text": "שם המרצה: חווה מרגלית, כושר גופני בקצב אישי\nחוות דעת - הרצאות: \nהשעה קשוחה, אבל השיעורים נחמדים ומגוונים- חווה דואגת להביא תרגילים חדשים ואביזרים שונים אבל גם לשמור על רצף של עבודה.\nממש עזרה בהתאמה של תרגילים והקלות אם היו בעיות רפואיות ובכללי ממש התחשבה ושמה לב לסטודנטיות\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \n\nהמבחן: \n\nהשורה התחתונה:", "timestamp": 1690216920256}, {"author": "walaa Z", "difficultyRank": 3, "generalRank": 5, "semester": "202202", "text": "שם המרצה: דפנה\nחוות דעת - הרצאות: \n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: \nאין\nהמבחן: \nאין\nהשורה התחתונה: \nכדאי", "timestamp": 1696250184005}, {"author": "gotta go fast", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פקה - הליכה ספורטיבית\n\nחוות דעת: פקה אחלה מאמן, הוא אכפתי ורציני.\n\nבתחילת כל מפגש עשינו חימום קצר ואז יצאנו להליכה של שעה בהקפות של מסלול שהוא הגדיר לנו בתוך הטכניון. המסלול כולל מדרגות, אז בכל הקפה עולים ויורדים. צריך להוריד לטלפון אפליקציה למדידת מרחק ומהירות בהליכה (נגיד strava) ולהשתמש בה. לפעמים ניתנה אפשרות לעשות הקפה ואז תרגילי TRX וחוזר חלילה. יכולנו לשים מוזיקה באוזניות. היו פעמים בודדות שבהן פקה רשם את התוצאות שלנו (מהירות/קילומטראז'), כדי לבדוק את השיפור שלנו לאורך הסמסטר.\n\nאם זה מעניין מישהו - הקפה שלמה היא בערך 1.2-1.3 ק\"מ ו-25 מ' עלייה. בשעה אפשר להספיק 5 כאלה.\n\nעכשיו, היו כאלה שלקחו את זה ברצינות והלכו מהר, והיו כאלה שסתם הסתובבו ודיברו עם חברות שלהן תוך כדי. פקה הולך איתנו, אז אני מניחה שהוא שם לב למי שלא לוקח את הקורס ברצינות. בסופו של דבר אם לוקחים את הקורס ברצינות זה כיף ואחלה אימון.\n\nאישית, נהניתי מאוד. אני מאוד אוהבת הליכה בכללי והליכה מהירה בפרט וזה היה נורא נחמד בבוקר.\n\nשעורי הבית: אין.\n\nהמבחן: אין, הציון הוא רק על סמך הערכה אישית.\n\nהשורה התחתונה: אחלה קורס, ממליצה מאוד", "timestamp": 1713172785626}, {"author": "student", "difficultyRank": 4, "generalRank": 3, "semester": "202301", "text": "שם המרצה: חווה מרגלית כ\"ג בקצב אישי\nחוות דעת - הרצאות: \nחווה מאמנת טובה ושמה לב לכולם ודואגת שנעשה האימונים בצורה נכונה. אבל לא הרגשתי שזה באמת \"קצב אישי\". היה קורס מעייף וקשה.  \n\nהמבחן: \nאין מבחן. הציונים לא כל כך טובים יחסית לקורס ספורט.. (92-95)\nהשורה התחתונה: \nלא ממליצה על הקורס הזה. לא שווה.", "timestamp": 1713428373731}, {"author": "null", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: נטלי רבקין פילאטיס\n\nחוות דעת - שיעורים: \nשיעורים נחמדים, היא מנסה לגוון עם מכשירים, בעיניי הרמה נמוכה והיא מראש \"מנמיכה ציפיות\". היא מדברת המון לאורך השיעור וסתם זורקת מלא הערות  מעיקות. גם באחד על אחד היא לא מאד נעימה ואני חוויתי ממנה לא מעט עקיצות לא במקום. \n\nהמבחן: --\n\nהשורה התחתונה: לא עפתי. אם אכפת לכם מהציון היא נותנת ציונים רנדומליים ונמוכים יחסית , קיבלתי מתחת ל95 ואני מתאמנת בפילאטיס מחוץ לטכניון כבר 5 שנים, סתם מרירות באמת אין סיבה.", "timestamp": 1713551324542}, {"author": "is", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוליה\nחוות דעת - הרצאות: פילאטיס\nתרגילים חמודים, אפשר לחפף ואפשר להשקיע לפי מה שאתם רוצים\n\nהשורה התחתונה: קורס ממש חמוד והציונים בסוף ממש גבוהים, כנראה כולם קיבלו 99", "timestamp": 1714557035374}, {"author": "אנונימי", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: פקה, הליכה ספורטיבית\n\nהשורה התחתונה: מומלץ מאד! כל אחת הולכת עם האוזניות שלה.", "timestamp": 1716655088604}, {"author": "Aviva Peimer", "difficultyRank": 1, "generalRank": 3, "semester": "202301", "text": "שם המרצה: גלית - פונקציונאלי מעורב\nחוות דעת - הרצאות: ספורט מאוד מאתגר. למי שמחפש להכנס לכושר ולקבל גם קצת מסת שריר מומלץ. ממה שהבנתי לא מאוד מפרגנת בציונים. אני קבלתי 96 והייתי מהחביבים עליה (ביקשה ממני להדגים וכו')\n\nשם המתרגל/ת: \nחוות דעת - תרגולים: \n\nשעורי הבית: -\n\nהמבחן: -\n\nהשורה התחתונה: קורס טוב למי שלוקח אותו ברצינות", "timestamp": 1716741021690}, {"author": ".", "difficultyRank": 1, "generalRank": 5, "semester": "202301", "text": "שם המרצה: יוליה \nחוות דעת - הרצאות: בודי בלט\nבלי ספק אחד הקורסים הכי מעניינים והכי מהנים שהייתי בהם הסמסטר, יוליה ממש נחמדה ונותנת  ציונים טובים, וגם השיעורים ממש מרגיעים וכיף\nמקום לשחרר את הלחץ ולרקוד קצת, אבל זה לא בדיוק בלט קלאסי, מעורב יותר עם מתיחות ופיטנס, אז גם אם אין לך ניסיון בבלט (כמוני) את תוכלי להנות\nהמבחן: \nלא היה מבחן, אלא רק הצגה קטנה בשיעור אחרון של הריקוד שעשינו במשך הסמסטר\nהשורה התחתונה: ממליצה מאוד, תהנו לכן", "timestamp": 1717016945279}, {"author": "Ang", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: חוה מרגלית (כושר גופני בקצב אישי)\n\nזה לא באמת בקצב אישי, היא אומרת את המילים האלה בזמן האימון אבל בפועל כולם עושים את אותו הדבר ובאותו קצב\n\nהאימון מגוון ובאמת עובדים על כל החלקים בגוף\nוגם השעות לא מתנגשות עם שאר הקורסים\nאה כן מי שמאחרת אפילו בקצת היא פשוט לא נותנת לה להיכנס לאימון בכלל, אז כדאי מאוד להגיע בזמן", "timestamp": 1717861090142}, {"author": "is", "difficultyRank": 1, "generalRank": 4, "semester": "202301", "text": "שם המרצה: יוליה - פילאטיס\nחוות דעת: השיעורים היו סבבה סך הכל, אבל כל שיעור היה בדיוק כמו הקודם אליו ולדעתי זה קצת משעמם, הייתי רוצה גיוון בתרגילים\nיוליה ממש חמודה ואפשר לוותר על תרגילים מסויימים אם לא מתאים \n\nהשורה התחתונה: נחמד, לא הרבה מאמץ, הציון בסוף יהיה כנראה 99", "timestamp": 1718556991776}]}